{
  "doi": "10.1145/3173574.3174080",
  "title": "Content is King, Leadership Lags: Effects of Prior Experience on Newcomer Retention and Productivity in Online Production Groups",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Organizers of online groups often struggle to recruit members who can most effectively carry out the group's activities and remain part of the group over time. In a study of a sample of 30,000 new editors belonging to 1,054 English WikiProjects, we empirically examine the effects of generalized prior work-productivity experience (measured by overall prior article edits), prior leadership experience (measured by overall prior project edits), and localized prior work-productivity experience (measured by pre-joining article edits on a project) on early retention and productivity. We find that (1)generalized prior work-productivity experience is positively associated with retention, but negatively associated with productivity (2) prior leadership experience is negatively associated with both retention and productivity, and (3) localized prior work-productivity experience is positively associated with both retention and productivity within that focal project. We then discuss implications to inform the designs of early interventions aimed at group success.",
  "authors": [
    {
      "name": "Raghav Pavan Karumur",
      "institution": "University of Minnesota, Minneapolis, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987093",
      "orcid": "missing"
    },
    {
      "name": "Bowen Yu",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131009",
      "orcid": "missing"
    },
    {
      "name": "Haiyi Zhu",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81484646857/rel-imgonly/headshot.png",
      "acmid": "81484646857",
      "orcid": "0000-0001-7271-9100"
    },
    {
      "name": "Joseph A. Konstan",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81100049091/rel-imgonly/konstan-award-photo.jpg",
      "acmid": "81100049091",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. Albanese and D.D. Van Fleet. 1985. The Free-Riding Tendancy. Academy of Management Review 10, 2 (1985), 244--255.",
      "doi": ""
    },
    {
      "text": "Jaime Arguello, Brian S. Butler, Elisabeth Joyce, Robert Kraut, Kimberly S. Ling, Carolyn Rosé, and Xiaoqing Wang. 2006. Talk to Me: Foundations for Successful Individual-group Interactions in Online Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 959--968.  ",
      "doi": "10.1145/1124772.1124916"
    },
    {
      "text": "Hugh J Arnold and Daniel C Feldman. 1982. A multivariate analysis of the determinants of job turnover. Journal of applied psychology 67, 3 (1982), 350.",
      "doi": ""
    },
    {
      "text": "Jeffrey B Arthur. 1994. Effects of human resource systems on manufacturing performance and turnover. Academy of Management journal 37, 3 (1994), 670--687.",
      "doi": ""
    },
    {
      "text": "A.B. Bakker, K.I. Van Der Zee, K.A. Lewig, and M.F. Dollard. 2007. The Relationship Between the Big Five Personality Factors and Burnout: A Study Among Volunteer Counselors. The Journal of Social Psychology 146, 1 (2007), 31--50.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1997. Self-efficacy: The exercise of control. Macmillan.",
      "doi": ""
    },
    {
      "text": "Janice M. Beyer and David R. Hannah. 2002. Building on the Past: Enacting Established Personal Identities in a New Work Setting. Organization Science 13, 6 (Nov. 2002), 636--652.  ",
      "doi": "10.1287/orsc.13.6.636.495"
    },
    {
      "text": "Andrew D. Brown. 2015. Identities and Identity Work in Organizations. International Journal of Management Reviews 17, 1 (2015), 20--40.",
      "doi": ""
    },
    {
      "text": "SL Bryant and A Forte. 2005. Bruckman. A. 2005. Becoming Wikipedian: Transformation of Participation in a Collaborative Online Encyclopedia. Proceedings of GROUP'05 (2005), 1--10.  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Moira Burke and Robert Kraut. 2008. Mopping up: modeling wikipedia promotion decisions. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 27--36.  ",
      "doi": "10.1145/1460563.1460571"
    },
    {
      "text": "Brian S. Butler. 1999. When is a group not a group: An empirical examination of metaphors for online social structure. In Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Gerard Callanan and Cynthia Benzing. 2004. Assessing the role of internships in the career-oriented employment of graduating college students. Education+ Training 46, 2 (2004), 82--89.",
      "doi": ""
    },
    {
      "text": "Jon C. Carr, Allison W. Pearson, Michael J. Vest, and Scott L. Boyar. 2006. Prior Occupational Experience, Anticipatory Socialization, and Employee Retention. Journal of Management 32, 3 (2006), 343--359.",
      "doi": ""
    },
    {
      "text": "Luis V Casaló, Carlos Flavián, and Miguel Guinalíu. 2013. New members' integration: Key factor of success in online travel communities. Journal of Business Research 66, 6 (2013), 706 -- 710. International Tourism Behavior in Turbulent Times.",
      "doi": ""
    },
    {
      "text": "Galyen N. Chandler, Benson Honig, and Johan Wiklund. 2005. Antecedents, moderators, and performance consequences of membership change in new venture teams. Journal of Business Venturing 20, 5 (2005), 705 -- 725.",
      "doi": ""
    },
    {
      "text": "Jilin Chen, Yuqing Ren, and John Riedl. 2010. The effects of diversity on group productivity and member withdrawal in online volunteer groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 821--830.  ",
      "doi": "10.1145/1753326.1753447"
    },
    {
      "text": "Jengchung Victor Chen, Chinho Lin, David C Yen, and Kyaw-Phyo Linn. 2011. The interaction effects of familiarity, breadth and media usage on web browsing experience. Computers in Human Behavior 27, 6 (2011), 2141--2152.  ",
      "doi": "10.1016/j.chb.2011.06.008"
    },
    {
      "text": "Boreum Choi, Kira Alexander, Robert E Kraut, and John M Levine. 2010. Socialization tactics in wikipedia and their effects. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 107--116.  ",
      "doi": "10.1145/1718918.1718940"
    },
    {
      "text": "Jacob Cohen, Patricia Cohen, Stephen G West, and Leona S Aiken. 2013. Applied multiple regression/correlation analysis for the behavioral sciences. Routledge.",
      "doi": ""
    },
    {
      "text": "Samantha A Conroy and Anne M O'Leary-Kelly. 2014. Letting go and moving on: Work-related identity loss and recovery. Academy of Management Review 39, 1 (2014), 67--87.",
      "doi": ""
    },
    {
      "text": "C.L. Cordes and T.W. Dougherty. 1993. A Review and An Integration of Research on Job Burnout. Academy of Management Review 18, 4 (1993), 621--656.",
      "doi": ""
    },
    {
      "text": "John L. Cotton and Jeffrey M. Tuttle. 1986. Employee turnover: A meta-analysis and review with implications for research. Academy of management Review 11, 1 (1986), 55 -- 70.",
      "doi": ""
    },
    {
      "text": "Linus Dahlander and Siobhan O'Mahony. 2011. Progressing to the center: Coordinating project work. Organization science 22, 4 (2011), 961--979.  ",
      "doi": "10.1287/orsc.1100.0571"
    },
    {
      "text": "Y. Rene Darmon. 1990. Identifying sources of turnover costs: A segmental approach. The Journal of Marketing (1990), 46--56.",
      "doi": ""
    },
    {
      "text": "Gregory G. Dess and Jason D. Shaw. 2001. Voluntary turnover, social capital, and organizational performance. Academy of management review 26, 3 (2001), 446--456.",
      "doi": ""
    },
    {
      "text": "Morton Deutsch. 1959. Some factors affecting membership motivation and achievement motivation in a group. Human Relations 12, 1 (1959), 81--95.",
      "doi": ""
    },
    {
      "text": "Gina Dokko, Steffanie L. Wilk, and Nancy P. Rothbard. 2009. Unpacking Prior Experience: How Career History Affects Job Performance. Organization Science 20, 1 (2009), 51--68.  ",
      "doi": "10.1287/orsc.1080.0357"
    },
    {
      "text": "Nicolas Ducheneaut. 2005. Socialization in an open source software community: A socio-technical analysis. Computer Supported Cooperative Work (CSCW) 14, 4 (2005), 323--368.  ",
      "doi": "10.1007/s10606-005-9000-1"
    },
    {
      "text": "Matthew S Eastin and Robert LaRose. 2000. Internet self-efficacy and the psychology of the digital divide. Journal of Computer-Mediated Communication 6, 1 (2000), 0--0.",
      "doi": ""
    },
    {
      "text": "Rosta Farzan, Laura A Dabbish, Robert E Kraut, and Tom Postmes. 2011. Increasing commitment to online communities by designing for social presence. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 321--330.  ",
      "doi": "10.1145/1958824.1958874"
    },
    {
      "text": "Rosta Farzan, Robert Kraut, Aditya Pal, and Joseph Konstan. 2012. Socializing Volunteers in an Online Community: A Field Experiment. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 325--334.  ",
      "doi": "10.1145/2145204.2145256"
    },
    {
      "text": "Andrea Forte, Niki Kittur, Vanessa Larco, Haiyi Zhu, Amy Bruckman, and Robert E Kraut. 2012. Coordination and beyond: social functions of groups in open content production. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 417--426.  ",
      "doi": "10.1145/2145204.2145270"
    },
    {
      "text": "Andrea Forte, Vanesa Larco, and Amy Bruckman. 2009. Decentralization in Wikipedia governance. Journal of Management Information Systems 26, 1 (2009), 49--72.  ",
      "doi": "10.2753/MIS0742-1222260103"
    },
    {
      "text": "Rodger W Griffeth, Peter W Hom, and Stefan Gaertner. 2000. A meta-analysis of antecedents and correlates of employee turnover: Update, moderator tests, and research implications for the next millennium. Journal of management 26, 3 (2000), 463--488.",
      "doi": ""
    },
    {
      "text": "Boris Groysberg. 2010. Chasing stars: The myth of talent and the portability of performance. Princeton University Press, Princeton, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Boris Groysberg, Linda Eling-Lee, and Robin Abrahams. 2010. What it takes to make 'star' hires pay off. MIT Sloan Management Review 51, 2 (2010), 57--61.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, Robert Kraut, and John Riedl. 2009. A jury of your peers: quality, experience and ownership in Wikipedia. In Proceedings of the 5th International Symposium on Wikis and Open Collaboration. ACM, 15.  ",
      "doi": "10.1145/1641309.1641332"
    },
    {
      "text": "John P. Hausknecht and Jacob A. Holwerda. 2013. When does employee turnover matter? Dynamic member configurations, productive capacity, and collective performance. Organizational Science 24, 1 (2013), 210--225.  ",
      "doi": "10.1287/orsc.1110.0720"
    },
    {
      "text": "Johm P. Hausknecht and Charlie O. Trevor. 2011. Collective turnover at the group, unit, and organizational levels: Evidence, issues, and implications. Journal of Management 37, 1 (2011), 352--388.",
      "doi": ""
    },
    {
      "text": "Meng-Hsiang Hsu, Teresa L Ju, Chia-Hui Yen, and Chun-Ming Chang. 2007. Knowledge sharing behavior in virtual communities: The relationship between trust, self-efficacy, and outcome expectations. International journal of human-computer studies 65, 2 (2007), 153--169.  ",
      "doi": "10.1016/j.ijhcs.2006.09.003"
    },
    {
      "text": "M.A. Huselid. 1995. The impact of human resource management practices on turnover, productivity, and corporate financial performance. AMJ 38, 3 (1995), 635--672.",
      "doi": ""
    },
    {
      "text": "John Kammeyer-Mueller, Connie Wanberg, Alex Rubenstein, and Zhaoli Song. 2013. Support, undermining, and newcomer socialization: Fitting in during the first 90 days. Academy of Management Journal 56, 4 (2013), 1104--1124.",
      "doi": ""
    },
    {
      "text": "Raghav Pavan Karumur and Joseph A. Konstan. 2016. Relating Newcomer Personality to Survival and Activity in Recommender Systems. In Proceedings of the 2016 Conference on User Modeling Adaptation and Personalization (UMAP '16). ACM, New York, NY, USA, 195--205.  ",
      "doi": "10.1145/2930238.2930246"
    },
    {
      "text": "Raghav Pavan Karumur, Tien T. Nguyen, and Joseph A. Konstan. 2016. Early Activity Diversity: Assessing Newcomer Retention from First-Session Activity. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work&Social Computing (CSCW '16). ACM, New York, NY, USA, 595--608.  ",
      "doi": "10.1145/2818048.2820009"
    },
    {
      "text": "Raghav Pavan Karumur, Tien T. Nguyen, and Joseph A. Konstan. 2017. Personality, User Preferences and Behavior in Recommender Systems. Information Systems Frontiers (2017).",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed Chi, Bryan A Pendleton, Bongwon Suh, and Todd Mytkowicz. 2007. Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie. World wide web 1, 2 (2007), 19.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Bryan Pendleton, and Robert E Kraut. 2009. Herding the cats: the influence of groups in coordinating peer production. In Proceedings of the 5th international Symposium on Wikis and Open Collaboration. ACM, 7.  ",
      "doi": "10.1145/1641309.1641321"
    },
    {
      "text": "Peter Kollock. 1999. The economies ol online cooperation. Communities in cyberspace 220 (1999).",
      "doi": ""
    },
    {
      "text": "Russell F Korte. 2009. How newcomers learn the social norms of an organization: A case study of the socialization of newly hired engineers. Human Resource Development Quarterly 20, 3 (2009), 285--306.",
      "doi": ""
    },
    {
      "text": "David Krackhardt and Lyman W. Porter. 1985. When friends leave: A structural analysis of the relationship between turnover and stayers' attitudes. Administrative science quarterly (1985), 242--261.",
      "doi": ""
    },
    {
      "text": "Robert E. Kraut, Paul Resnick, Sara Kiesler, Moira Burke, Yan Chen, Niki Kittur, Joseph A. Konstan, Yuging Ren, and John Riedl. 2012. Building Successful Online communities: Evidence-based social design. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Robert LaRose. 2009. Social cognitive theories of media selection. Media choice: A theoretical and empirical overview (2009), 10--31.",
      "doi": ""
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Claire M. Gardiner. 2016. Legitimizing processes: Barriers and facilitators for experienced Newcomers' entry transitions to knowledge practices. (06 2016).",
      "doi": ""
    },
    {
      "text": "J Miller McPherson, Pamela A Popielarz, and Sonja Drobnic. 1992. Social networks and organizational dynamics. American sociological review (1992), 153--170.",
      "doi": ""
    },
    {
      "text": "Jonathan T Morgan, Michael Gilbert, David W McDonald, and Mark Zachry. 2013. Project talk: Coordination work and group membership in WikiProjects. In Proceedings of the 9th International Symposium on Open Collaboration. ACM, 3.  ",
      "doi": "10.1145/2491055.2491058"
    },
    {
      "text": "Bjørn Erik Mørk, Thomas Hoholm, Gunnar Ellingsen, Bjørn Edwin, and Margunn Aanestad. 2010. Challenging expertise: On power relations within and across communities of practice in medical innovation. Management Learning 41, 5 (2010), 575--592.",
      "doi": ""
    },
    {
      "text": "Charles A O'Reilly III, David F Caldwell, and William P Barnett. 1989. Work group demography, social integration, and turnover. Administrative science quarterly (1989), 21--37.",
      "doi": ""
    },
    {
      "text": "Katherine Panciera, Aaron Halfaker, and Loren Terveen. 2009. Wikipedians are born, not made: a study of power editors on Wikipedia. In Proceedings of the ACM 2009 international conference on Supporting group work. ACM, 51--60.  ",
      "doi": "10.1145/1531674.1531682"
    },
    {
      "text": "Katherine Panciera, Reid Priedhorsky, Thomas Erickson, and Loren Terveen. 2010. Lurking? cyclopaths?: a quantitative lifecycle analysis of user behavior in a geowiki. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1917--1926.  ",
      "doi": "10.1145/1753326.1753615"
    },
    {
      "text": "Xiangju Qin, Michael Salter-Townshend, and Pádraig Cunningham. 2014. Exploring the Relationship between Membership Turnover and Productivity in Online Communities. In Proceedings of the 8th International Conference on Weblogs and Social Media (ICWSM '14). AAAI.",
      "doi": ""
    },
    {
      "text": "Amy E Randel and Kimberly S Jaussi. 2003. Functional background identity, diversity, and individual performance in cross-functional teams. Academy of Management Journal 46, 6 (2003), 763--774.",
      "doi": ""
    },
    {
      "text": "Yuqing Ren, Robert Kraut, and Sara Kiesler. 2007. Applying Common Identity and Bond Theory to Design of Online Communities. Organization Studies 28, 3 (2007), 377--408.",
      "doi": ""
    },
    {
      "text": "Yuqing Ren and John Riedl. Helping Wikipedia versus Helping a WikiProject: Subgroup Dynamics, Member Contribution and Turnover in Online Production Communities. Technical Report. https://pdfs.semanticscholar.org/0601/ 4b5cde0c70ff0bb33151e80ba5ede53385ab.pdf",
      "doi": ""
    },
    {
      "text": "Myra H. Strober. 1990. Human capital theory: Implications for HR managers. Industrial Relations 29, 2 (1990), 214--239.",
      "doi": ""
    },
    {
      "text": "Michael C Sturman. 2003. Searching for the inverted U-shaped relationship between time and performance: Meta-analyses of the experience/performance, tenure/performance, and age/performance relationships. Journal of Management 29, 5 (2003), 609--640.",
      "doi": ""
    },
    {
      "text": "Lesley .C Taylor. 2009. Thousands of editors Leaving Wikipedia. Article. (23 November 2009). Retrieved September 4, 2017 from https://www.thestar.com/news/2009/11/23/thousands_of_editors_leaving_wikipedia.html.",
      "doi": ""
    },
    {
      "text": "M Susan Taylor. 1988. Effects of college internships on individual participants. Journal of Applied Psychology 73, 3 (1988), 393.",
      "doi": ""
    },
    {
      "text": "Hang Ung and Jean-Michel Dalle. 2010. Project Management in the Wikipedia Community. In Proceedings of the 6th International Symposium on Wikis and Open Collaboration (WikiSym '10). ACM, New York, NY, USA, Article 13, 4 pages.  ",
      "doi": "10.1145/1832772.1832790"
    },
    {
      "text": "Loxley Sijia Wang, Jilin Chen, Yuqing Ren, and John Riedl. 2012a. Searching for the Goldilocks Zone: Trade-offs in Managing Online Volunteer Groups. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 989--998.  ",
      "doi": "10.1145/2145204.2145351"
    },
    {
      "text": "Yi-Chia Wang, Robert Kraut, and John M. Levine. 2012b. To Stay or Leave?: The Relationship of Emotional and Informational Support to Commitment in Online Health Support Groups. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 833--842.  ",
      "doi": "10.1145/2145204.2145329"
    },
    {
      "text": "Etienne .C. Wenger-Trayner and Beverly Wenger-Trayner. 2015. Learning in landscapes of practice: Boundaries, Identity, And Knowledgeability in Practice-Based Learning (1st ed.). Routledge, New York, NY, Chapter Learning in a landscape of practice: A framework., 13--29.",
      "doi": ""
    },
    {
      "text": "Dmitri Williams, Nicolas Ducheneaut, Li Xiong, Yuanyuan Zhang, Nick Yee, and Eric Nickell. 2006. From tree house to barracks: The social life of guilds in World of Warcraft. Games and Culture 1 (2006), 338--361.",
      "doi": ""
    },
    {
      "text": "KY Williams and CA O'Reilly III. 1998. Demography and Diversity in Organisations: A review of 40 years of research in BM Staw and LL Cummings (eds) Research in Organisational Behaviour Vol. 20. Jai Pres, Connecticut (1998).",
      "doi": ""
    },
    {
      "text": "Bowen Yu, Yuqing Ren, Loren Terveen, and Haiyi Zhu. 2017a. Predicting Member Productivity and Withdrawal from Pre-Joining Attachments in Online Production Groups. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1775--1784.  ",
      "doi": "10.1145/2998181.2998227"
    },
    {
      "text": "Bowen Yu, Xinyi Wang, Allen Yilun Lin, Yuqing Ren, Loren Terveen, and Haiyi Zhu. 2017b. Out With The Old, In With The New?: Unpacking Member Turnover in Online Production Groups. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 117 (Dec. 2017), 19 pages.  ",
      "doi": "10.1145/3134752"
    },
    {
      "text": "Haiyi Zhu, Robert Kraut, and Aniket Kittur. 2012a. Effectiveness of Shared Leadership in Online Communities. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 407--416.  ",
      "doi": "10.1145/2145204.2145269"
    },
    {
      "text": "Haiyi Zhu, Robert Kraut, and Aniket Kittur. 2012b. Organizing Without Formal Organization: Group Identification, Goal Setting and Social Modeling in Directing Online Production. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 935--944.  ",
      "doi": "10.1145/2145204.2145344"
    },
    {
      "text": "Haiyi Zhu, Amy Zhang, Jiping He, Robert E. Kraut, and Aniket Kittur. 2013. Effects of Peer Feedback on Contribution: A Field Experiment in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2253--2262.  ",
      "doi": "10.1145/2470654.2481311"
    },
    {
      "text": "Robert Zinko, Gerald R. Ferris, Fred R. Blass, and Mary D. Laird. 2009. Toward a Theory of Reputation in Organizations. Research in Personnel and Human Resources Management 26, 1 (2009), 163--204.",
      "doi": ""
    }
  ]
}