{
  "doi": "10.1145/3173574.3174091",
  "title": "Inclusive Computing in Special Needs Classrooms: Designing for All",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "With a growing call for an increased emphasis on computing in school curricula, there is a need to make computing accessible to a diversity of learners. One potential approach is to extend the use of physical toolkits, which have been found to encourage collaboration, sustained engagement and effective learning in classrooms in general. However, little is known as to whether and how these benefits can be leveraged in special needs schools, where learners have a spectrum of distinct cognitive and social needs. Here, we investigate how introducing a physical toolkit can support learning about computing concepts for special education needs (SEN) students in their classroom. By tracing how the students' interactions-both with the physical toolkit and with each other-unfolded over time, we demonstrate how the design of both the form factor and the learning tasks embedded in a physical toolkit contribute to collaboration, comprehension and engagement when learning in mixed SEN classrooms.",
  "authors": [
    {
      "name": "Zuzanna Lechelt",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019447",
      "orcid": "missing"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    },
    {
      "name": "Nicola Yuill",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81416600158/rel-imgonly/swisstea.jpg",
      "acmid": "81416600158",
      "orcid": "missing"
    },
    {
      "name": "Lena Nagl",
      "institution": "University of Sussex, Brighton, Sussex, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260704",
      "orcid": "missing"
    },
    {
      "name": "Grazia Ragone",
      "institution": "University of Sussex, Brighton, East Sussex, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261529",
      "orcid": "missing"
    },
    {
      "name": "Nicolai Marquardt",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81324491951/rel-imgonly/portraitnic3.jpg",
      "acmid": "81324491951",
      "orcid": "0000-0002-5473-2448"
    }
  ],
  "references": [
    {
      "text": "Edith K. Ackermann. 1996. Perspective-Taking and Object Construction: Two Keys to Learning. In Constuctionism in Practice: Designing, Thinking, and Learning in a Digital World (Kafai, Y., and Resnick, M., Eds.). Mahwah, New Jersey: Lawrence Erlbaum Associates. Part 1, Chapter 2., 25--37.",
      "doi": ""
    },
    {
      "text": "Alissa N. Antle. 2009. LIFELONG INTERACTIONS Embodied child computer interaction: why embodiment matters. interactions 16, 2: 27--30.  ",
      "doi": "10.1145/1487632.1487639"
    },
    {
      "text": "Arduino. 2016. Open-source electronic prototyping platform. Retrieved from https://www.arduino.cc",
      "doi": ""
    },
    {
      "text": "BBC micro:bit. 2016. Micro:bit: get creative, get connected, get coding. Retrieved from https://www.microbit.co.uk",
      "doi": ""
    },
    {
      "text": "Ayah Bdeir. 2009. Electronics as material: littleBits. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction, 397--400.  ",
      "doi": "10.1145/1517664.1517743"
    },
    {
      "text": "Peter Börjesson, Wolmet Barendregt, Eva Eriksson, and Olof Torgersson. 2015. Designing Technology for and with Developmentally Diverse Children: A Systematic Literature Review. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15), 79--88.  ",
      "doi": "10.1145/2771839.2771848"
    },
    {
      "text": "Karen Brennan and Mitchel Resnick. New frameworks for studying and assessing the development of computational thinking. Retrieved September 6, 2017 from http://scratched.gse.harvard.edu/ct/files/AERA2012.pd f",
      "doi": ""
    },
    {
      "text": "CodeMe. 2016. The CodeMe toolkit. Retrieved from http://www.codeme.io",
      "doi": ""
    },
    {
      "text": "Department for Education. 2017. Special educational needs in England: January 2017. Department for Education. Retrieved from https://www.gov.uk/government/uploads/system/uploa ds/attachment_data/file/633031/SFR37_2017_Main_T ext.pdf",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the Action is: The Foundations of Embodied Interaction. MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Taciana Pontual Falcão and Sara Price. 2010. Informing design for tangible interaction: a case for children with learning difficulties. In Proceedings of the 9th International Conference on Interaction Design and Children, 190--193.  ",
      "doi": "10.1145/1810543.1810568"
    },
    {
      "text": "William Farr, Nicola Yuill, Eric Harris, and Steve Hinske. 2010. In my own words: configuration of tangibles, object interaction and children with autism. In Proceedings of the 9th International Conference on Interaction Design and Children, 30--38.  ",
      "doi": "10.1145/1810543.1810548"
    },
    {
      "text": "Samantha Holt and Nicola Yuill. 2014. Facilitating other-awareness in low-functioning children with autism and typically-developing preschoolers using dual-control technology. Journal of autism and developmental disorders 44, 1: 236--248.",
      "doi": ""
    },
    {
      "text": "Michael S. Horn, R. Jordan Crouser, and Marina U. Bers. 2012. Tangible Interaction and Learning: The Case for a Hybrid Approach. Personal Ubiquitous Comput. 16, 4: 379--389.  ",
      "doi": "10.1007/s00779-011-0404-2"
    },
    {
      "text": "Michael S. Horn, Erin Treacy Solovey, R. Jordan Crouser, and Robert JK Jacob. 2009. Comparing the use of tangible and graphical programming languages for informal science education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 975--984.  ",
      "doi": "10.1145/1518701.1518851"
    },
    {
      "text": "Maya Israel, Quentin M. Wherfel, Jamie Pearson, Saadeddine Shehab, and Tanya Tapia. 2015. Empowering K--12 students with disabilities to learn computational thinking and computer programming. TEACHING Exceptional Children 48, 1: 45--53.",
      "doi": ""
    },
    {
      "text": "Rose Johnson, Venus Shum, Yvonne Rogers, and Nicolai Marquardt. 2016. Make or Shake: An Empirical Study of the Value of Making in Learning About Computing Technology. In Proceedings of the The 15th International Conference on Interaction Design and Children (IDC '16), 440--451.  ",
      "doi": "10.1145/2930674.2930691"
    },
    {
      "text": "Brigitte Jordan and Austin Henderson. 1995. Interaction analysis: Foundations and practice. The journal of the learning sciences 4, 1: 39--103.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai, Quinn Burke, and Mitchel Resnick. 2014. Connected code: Why children need to learn programming. Mit Press. ",
      "doi": "10.5555/2628006"
    },
    {
      "text": "Paul Marshall. 2007. Do Tangible Interfaces Enhance Learning? In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (TEI '07), 163--170.  ",
      "doi": "10.1145/1226969.1227004"
    },
    {
      "text": "Seymour Papert. 1980. Mindstorms: Children, computers, and powerful ideas. Basic Books, Inc. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Jean Piaget. 2013. The construction of reality in the child. Routledge.",
      "doi": ""
    },
    {
      "text": "Taciana Pontual da Rocha Falcão. 2014. Discovery learning with tangible technologies: the case of children with intellectual disabilities. UCL Institute of Education. PhD Thesis.",
      "doi": ""
    },
    {
      "text": "Dylan J. Portelance and Marina Umaschi Bers. 2015. Code and Tell: Assessing young children's learning of computational thinking using peer video interviews with ScratchJr. In Proceedings of the 14th International Conference on Interaction Design and Children, 271--274.  ",
      "doi": "10.1145/2771839.2771894"
    },
    {
      "text": "Sara Price and Taciana Pontual Falcão. 2011. Where the attention is: Discovery learning in novel tangible environments. Interacting with Computers 23, 5: 499--512.  ",
      "doi": "10.1016/j.intcom.2011.06.003"
    },
    {
      "text": "Mitchel Resnick. 2006. Computer as paint brush: Technology, play, and the creative society. Play= learning: How play motivates and enhances children's cognitive and social-emotional growth: 192--208.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick. 2013. Learn to code, code to learn. EdSurge, May. Retrieved September 6, 2017 from https://www.edsurge.com/news/2013-05-08-learn-tocode-code-to-learn",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés MonroyHernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and others. 2009. Scratch: programming for all. Communications of the ACM 52, 11: 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Mitchel Resnick, Fred Martin, Robert Berg, Rick Borovoy, Vanessa Colella, Kwin Kramer, and Brian Silverman. 1998. Digital manipulatives: new toys to think with. In Proceedings of the SIGCHI conference on Human factors in computing systems, 281--287.  ",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Yvonne Rogers and Paul Marshall. 2017. Research in the Wild. Synthesis Lectures on Human-Centered Informatics 10, 3: i-97. ",
      "doi": "10.5555/3103562"
    },
    {
      "text": "Jeremy Roschelle and Stephanie D. Teasley. 1995. The Construction of Shared Knowledge in Collaborative Problem Solving. In Computer Supported Collaborative Learning, Claire O'Malley (ed.). Springer Berlin Heidelberg, 69--97.",
      "doi": ""
    },
    {
      "text": "Sue Sentance, Jane Waite, Steve Hodges, Emily MacLeod, and Lucy Yeomans. 2017. \"Creating Cool Stuff\": Pupils' Experience of the BBC Micro:Bit. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education (SIGCSE '17), 531--536.  ",
      "doi": "10.1145/3017680.3017749"
    },
    {
      "text": "Sowmya Somanath, Lora Oehlberg, Janette Hughes, Ehud Sharlin, and Mario Costa Sousa. 2017. \"Maker\" Within Constraints: Exploratory Study of Young Learners Using Arduino at a High School in India. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 96--108.  ",
      "doi": "10.1145/3025453.3025849"
    },
    {
      "text": "Hideyuki Suzuki and Hiroshi Kato. 1995. Interactionlevel Support for Collaborative Learning: AlgoBlock-an Open Programming Language. In The First International Conference on Computer Support for Collaborative Learning (CSCL '95), 349--355.  ",
      "doi": "10.3115/222020.222828"
    },
    {
      "text": "Anja Thieme, Cecily Morrison, Nicolas Villar, Martin Grayson, and Siân Lindley. 2017. Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 739--752.  ",
      "doi": "10.1145/3064663.3064689"
    },
    {
      "text": "UK Department of Education. 2016. National curriculum in England: design and technology programmes of study - GOV.UK. Retrieved from https://www.gov.uk/government/publications/nationalcurriculum-in-england-design-and-technologyprogrammes-of-study/national-curriculum-in-englanddesign-and-technology-programmes-of-study",
      "doi": ""
    },
    {
      "text": "Marjo Virnes, Erkki Sutinen, and Eija Kärnä-Lin. 2008. How Children's Individual Needs Challenge the Design of Educational Robotics. In Proceedings of the 7th International Conference on Interaction Design and Children (IDC '08), 274--281.  ",
      "doi": "10.1145/1463689.1463766"
    },
    {
      "text": "Lev Semenovich Vygotsky. 1978. Mind in society: the development of higher psychological processes. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Jeannette M. Wing. 2006. Computational thinking. Communications of the ACM 49, 3: 33--35.  ",
      "doi": "10.1145/1118178.1118215"
    },
    {
      "text": "Oren Zuckerman, Saeed Arida, and Mitchel Resnick. 2005. Extending tangible interfaces for education: digital montessori-inspired manipulatives. In Proceedings of the SIGCHI conference on Human factors in computing systems, 859--868.  ",
      "doi": "10.1145/1054972.1055093"
    },
    {
      "text": "Oren Zuckerman and Ayelet Gal-Oz. 2013. To TUI or not to TUI: Evaluating performance and preference in tangible vs. graphical user interfaces. International Journal of Human-Computer Studies 71, 7: 803--820.  ",
      "doi": "10.1016/j.ijhcs.2013.04.003"
    },
    {
      "text": "Raspberry Pi - Teach, Learn, and Make with Raspberry Pi. Raspberry Pi. Retrieved from https://www.raspberrypi.org/",
      "doi": ""
    },
    {
      "text": "Ardublock | A Graphical Programming Language for Arduino. Retrieved from http://blog.ardublock.com/",
      "doi": ""
    }
  ]
}