{
  "doi": "10.1145/3173574.3173734",
  "title": "Intermodulation: Improvisation and Collaborative Art Practice for HCI",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper integrates theory, ethnography, and collaborative artwork to explore improvisational activity as both topic and tool of multidisciplinary HCI inquiry. Building on theories of improvisation drawn from art, music, HCI and social science, and two ethnographic studies based on interviews, participant observation and collaborative art practice, we seek to elucidate the improvisational nature of practice in both art and ordinary action, including human-computer interaction. We identify five key features of improvisational action -- reflexivity, transgression, tension, listening, and interdependence -- and show how these can deepen and extend both linear and open-ended methodologies in HCI and design. We conclude by highlighting collaborative engagement based on 'intermodulation' as a tool of multidisciplinary inquiry for HCI research and design.",
  "tags": [
    "art practice",
    "improvisation",
    "collaboration",
    "creativity"
  ],
  "authors": [
    {
      "name": "Laewoo (Leo) Kang",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81557572456/rel-imgonly/55820036_71559_lrg_1498601009.jpg",
      "acmid": "81557572456",
      "orcid": "missing"
    },
    {
      "name": "Steven J. Jackson",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100096023",
      "orcid": "0000-0002-4426-1320"
    },
    {
      "name": "Phoebe Sengers",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100397464/rel-imgonly/ditheredhead.jpg",
      "acmid": "81100397464",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Philip E Agre, and David Chapman. 1987. Pengi: lementation of a Theory of Activity. aaai.org. ",
      "doi": "10.5555/1856670.1856718"
    },
    {
      "text": "Philip E Agre. 1997. Computation and Human Experience. ",
      "doi": "10.5555/522884"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Peter Dalsgaard, Shad Gross, and Kim Halskov. 2016. Documenting the Research Through Design Process. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16, 96--107.  ",
      "doi": "10.1145/2901790.2901859"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest Proposals. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, 2093--2102.  ",
      "doi": "10.1145/2702123.2702400"
    },
    {
      "text": "Estelle Barrett and Barbara Bolt. 2007. Practice as research: approaches to creative arts enquiry.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Andy Crabtree, Martin Flintham, Brendan Walker, Joe Marshall, Boriana Koleva, Stefan Rennick Egglestone, Gabriella Giannachi, Matt Adams, Nick Tandavanitj, and Ju Row Farr. 2013. Performance-Led Research in the Wild. ACM Transactions on Computer-Human Interaction 20, 3: 14:1--14:22.  ",
      "doi": "10.1145/2491500.2491502"
    },
    {
      "text": "Paul Berliner. 1994. Thinking in Jazz: The Infinite Art of Improvisation.",
      "doi": ""
    },
    {
      "text": "Wiebe E Bijker, Thomas P Hughes, Trevor Pinch, and Deborah G Douglas. 2012. The social construction of technological systems: New directions in the sociology and history of technology. MIT press.",
      "doi": ""
    },
    {
      "text": "J Bowers. 2002. Improvising machines: Ethnographically informed design for improvised electro-acoustic music. ARiADATexts (4).",
      "doi": ""
    },
    {
      "text": "John Bowers, Robyn Taylor, Jonathan Hook, Dustin Freeman, Charlie Bramley, and Christopher Newell. 2014. HCI: human-computer improvisation. In Proceedings of the 2014 companion publication on Designing interactive systems, 203--206.  ",
      "doi": "10.1145/2598784.2598799"
    },
    {
      "text": "1John Cage. 1952. 4'33''(Four thirty-three).",
      "doi": ""
    },
    {
      "text": "John Cage and David Tudor. 1959. Indeterminacy: New Aspect of Form in Instrumental and Electronic Music: Reading. Folkways Records.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Linda Liska Belgrave. 2007. Grounded theory. Wiley Online Library.",
      "doi": ""
    },
    {
      "text": "Taylan Cihan. 2013. Blister. https://vimeo.com/56305601",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard and Peter. 2016. Experimental Systems in Research through Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 4991--4996.  ",
      "doi": "10.1145/2858036.2858310"
    },
    {
      "text": "Paul Dourish, Annette Adler, and Brian Cantwell Smith. 1996. Organising User Interfaces Around Reflective Accounts. In Reflection'96, 235--244.",
      "doi": ""
    },
    {
      "text": "Ernest A. Edmonds, Alastair Weakley, Linda Candy, Mark Fell, Roger Knott, and Sandra Pauletto. 2005. The studio as laboratory: Combining creative practice and digital technology research. International Journal of Human Computer Studies 63, 4--5 SPEC. ISS.: 452--481.  ",
      "doi": "10.1016/j.ijhcs.2005.04.012"
    },
    {
      "text": "Ernest Edmonds and Linda Candy. 2002. Creativity, art practice, and knowledge. Communications of the ACM 45, 10: 91--95.  ",
      "doi": "10.1145/570907.570939"
    },
    {
      "text": "Bill Evans. 1957. Improvisation in Jazz. Kind of Blue.",
      "doi": ""
    },
    {
      "text": "Bill Evans and Jim Hall. 1966. Intermodulation.",
      "doi": ""
    },
    {
      "text": "2SM Feisst. 2009. John Cage and improvisation: an unresolved relationship. Musical improvisation: Art, education, and society.",
      "doi": ""
    },
    {
      "text": "2Bill Gaver and John Bowers. 2012. Annotated portfolios. interactions 19, 4: 40.  ",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "William Gaver and William. 2012. What should we expect from research through design? In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, 937.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Elizabeth Gerber and Elizabeth. 2007. Improvisation principles and techniques for design. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07, 1069.  ",
      "doi": "10.1145/1240624.1240786"
    },
    {
      "text": "Elisa Giaccardi and Gerhard Fischer. 2008. Creativity and evolution: a metadesign perspective. Digital Creativity 19, March 2015: 19--32.",
      "doi": ""
    },
    {
      "text": "Hermann Gottschewski. 2007. The Provisum and the Improvisum in Musical Performance. Yonsei Music Research 14: 13--22.",
      "doi": ""
    },
    {
      "text": "Guy Hoffman and Gil Weinberg. 2010. Gesture-based human-robot jazz improvisation. In Robotics and Automation (ICRA), 2010 IEEE International Conference on, 582--587.",
      "doi": ""
    },
    {
      "text": "Hrönn Brynjarsdóttir Holmer, Carl Disalvo, Phoebe Sengers, and Thomas Lodato. 2015. Constructing and constraining participation in participatory arts and HCI. International Journal of Human Computer Studies 74: 107--123.  ",
      "doi": "10.1016/j.ijhcs.2014.10.003"
    },
    {
      "text": "Jonathan Hook, Guy Schofield, Robyn Taylor, Tom Bartindale, John McCarthy, and Peter Wright. 2012. Exploring HCI's relationship with liveness. In Proceedings of the 2012 ACM annual conference extended abstracts on Human Factors in Computing Systems Extended Abstracts - CHI EA '12, 2771.  ",
      "doi": "10.1145/2212776.2212717"
    },
    {
      "text": "Kristina Höök, Peter Dalsgaard, Stuart Reeves, Jeffrey Bardzell, Jonas Löwgren, Erik Stolterman, and Yvonne Rogers. 2015. Knowledge Production in Interaction Design. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '15, 2429--2432.  ",
      "doi": "10.1145/2702613.2702653"
    },
    {
      "text": "3Steven J. Jackson and Laewoo Kang. 2014. Breakdown, obsolescence and reuse. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, 449--458.  ",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "3Giulio Jacucci, Mira Wagner, Ina Wagner, Elisa Giaccardi, Mauro Annunziato, Nell Breyer, Jonas Hansen, Kazuhiro Jo, Stijn Ossevoort, Alessandro Perini, Natacha Roussel, and Susanne Schuricht. 2010. ParticipArt: Exploring participation in interactive art installations. In 9th IEEE International Symposium on Mixed and Augmented Reality 2010: Arts, Media, and Humanities, ISMAR-AMH 2010 - Proceedings, 3--10.",
      "doi": ""
    },
    {
      "text": "3P.a Jennings, E.b Giaccardi, and M.c Wesolkowska. 2006. About face interface: Creative engagement in the new media arts and HCI. Conference on Human Factors in Computing Systems - Proceedings: 1663--1666.  ",
      "doi": "10.1145/1125451.1125757"
    },
    {
      "text": "Laewoo (Leo) Kang. 2016. Breaking AndyWall: Transgressive and Playful Exploration on the Dynamic Role of Users in Art and Design. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 3855--3858.  ",
      "doi": "10.1145/2851581.2891100"
    },
    {
      "text": "Laewoo (Leo) Kang. 2018. Intermodulator: interactive audio-visual system for collaborative improvisation. In Proceedings of the 2018 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '18).  ",
      "doi": "10.1145/3170427.3177760"
    },
    {
      "text": "Laewoo (Leo) Kang. 2017. Echo (): Listening to the Reflection of Obsolete Technology. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems, 305--308.  ",
      "doi": "10.1145/3064857.3079180"
    },
    {
      "text": "3Scott Barry Kaufman and Carolyn Gregoire. 2016. Wired to create: Unraveling the mysteries of the creative mind. Penguin.",
      "doi": ""
    },
    {
      "text": "3Nathaniel Klemp, Ray Mcdermott, and Jason Raley. 2008. Plans, Takes, and Mistakes. Critical Social Studies, 1: 4--21.",
      "doi": ""
    },
    {
      "text": "3Don Koberg. 1981. The all new universal traveler: A soft-systems guide to creativity, problem-solving, and the process of reaching goals. William Kaufmann Inc.",
      "doi": ""
    },
    {
      "text": "A. Baki Kocaballi and Yeliz Yorulmaz. 2016. Performative Photography as an Ideation Method. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16, 1083--1095.  ",
      "doi": "10.1145/2901790.2901911"
    },
    {
      "text": "4Patricia Leavy. 2010. Method meets art: Arts-based research practice. Counselling and Psychotherapy Research 10, 1: 76--77.",
      "doi": ""
    },
    {
      "text": "4George E. Lewis and Benjamin Piekut. 2016. The Oxford Handbook of Critical Improvisation Studies, Volume 1.",
      "doi": ""
    },
    {
      "text": "4John McCarthy and Peter Wright. 2004. Technology as experience. interactions 11, 5: 42.  ",
      "doi": "10.1145/1015530.1015549"
    },
    {
      "text": "4Timothy J. (Timothy James) McGee. 2003. Improvisation in the arts of the Middle Ages and Renaissance. Medieval Institute Publications, Western Michigan University.",
      "doi": ""
    },
    {
      "text": "4Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic Books (AZ).",
      "doi": "10.5555/2187809"
    },
    {
      "text": "4T Nunn. 1998. Wisdom of the Impulse On the Nature of Musical Free Improvisation Part 2. Pdf julkaisu International Improvised Music Archive.",
      "doi": ""
    },
    {
      "text": "4William Odom, Ron Wakkary, Youn-kyung Lim, Audrey Desjardins, Bart Hengeveld, and Richard Banks. 2016. From Research Prototype to Research Product. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16.  ",
      "doi": "10.1145/2858036.2858447"
    },
    {
      "text": "4Nam June Paik. 1965. Zen for Film.",
      "doi": ""
    },
    {
      "text": "4Nam June Paik. 1969. Participation TV.",
      "doi": ""
    },
    {
      "text": "J Pressing. 1988. Improvisation: methods and models. John A. Sloboda (Hg.): Generative processes in.",
      "doi": ""
    },
    {
      "text": "5Geber Ramalho and Jean-Gabriel Ganascia. 1994. Simulating creativity in jazz performance. In AAAI, 108--113. ",
      "doi": "10.5555/2891730.2891747"
    },
    {
      "text": "5Matt Ratto. 2011. Critical Making: Conceptual and Material Studies in Technology and Social Life. The Information Society 27, 4: 252--260.  ",
      "doi": "10.1080/01972243.2011.583819"
    },
    {
      "text": "5Horst W J Rittel and Melvin M Webber. 1973. Dilemmas in a general theory of planning. Policy sciences 4, 2: 155--169.",
      "doi": ""
    },
    {
      "text": "5Francis. Rumsey and Tim. McCormick. 2006. Sound and recording: an introduction. Focal Press.",
      "doi": ""
    },
    {
      "text": "5R. K. Sawyer. 2006. Group creativity: musical performance and collaboration. Psychology of Music 34, 2: 148--165.",
      "doi": ""
    },
    {
      "text": "5R. Keith Sawyer. 2000. Improvisation and the Creative Process: Dewey, Collingwood, and the Aesthetics of Spontaneity. The Journal of Aesthetics and Art Criticism 58, 2: 149.",
      "doi": ""
    },
    {
      "text": "5R. Keith (Robert Keith) Sawyer. 2011. Structure and improvisation in creative teaching. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "5Lucy Suchman. 1987. Plans and Situated Actions. Cambridge University Press: 224.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "5John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07, Paper 41.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An analysis and critique of Research through Design. In Proceedings of the 8th ACM Conference on Designing Interactive Systems - DIS '10, 310.  ",
      "doi": "10.1145/1858171.1858228"
    },
    {
      "text": "6Adversarial Design. Retrieved September 17, 2017 from http://dl.acm.org/citation.cfm?id=2341007",
      "doi": ""
    },
    {
      "text": "6Festival de Cannes: The Mystery of Picasso (In Competition). festival-cannes.com.",
      "doi": ""
    },
    {
      "text": "6Critical Studies in Improvisation. http://www.criticalimprov.com/",
      "doi": ""
    },
    {
      "text": "6The Electric Golem. http://levelgreen.com/electricgolem/",
      "doi": ""
    },
    {
      "text": "6Annie Lewandowski (Powerdove). http://www.annielewandowski.com/",
      "doi": ""
    }
  ]
}