{
  "doi": "10.1145/3173574.3173656",
  "title": "Sketch&Stitch: Interactive Embroidery for E-textiles",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "E-Textiles are fabrics that integrate electronic circuits and components. Makers use them to create interactive clothing, furniture, and toys. However, this requires significant manual labor and skills, and using technology-centric design tools. We introduce Sketch&Stitch, an interactive embroidery system to create e-textiles using a traditional crafting approach: Users draw their art and circuit directly on fabric using colored pens. The system takes a picture of the sketch, converts it to embroidery patterns, and sends them to an embroidery machine. Alternating between sketching and stitching, users build and test their design incrementally. Sketch&Stitch features Circuitry Stickers representing circuit boards, components, and custom stitch patterns for wire crossings to insulate, and various textile touch sensors such as pushbuttons, sliders, and 2D touchpads. Circuitry Stickers serve as placeholders during design. Using computer vision, they are recognized and replaced later in the appropriate embroidery phases. We close with technical considerations and application examples.",
  "authors": [
    {
      "name": "Nur Al-huda Hamdan",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/do/10.1145/contrib-81557904256/rel-imgonly/hamdan.jpg",
      "acmid": "81557904256",
      "orcid": "missing"
    },
    {
      "name": "Simon Voelker",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/do/10.1145/contrib-81479651640/rel-imgonly/simon_voelker.jpg",
      "acmid": "81479651640",
      "orcid": "missing"
    },
    {
      "name": "Jan Borchers",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/do/10.1145/contrib-81100443423/rel-imgonly/borchers_7154.jpg",
      "acmid": "81100443423",
      "orcid": "0000-0003-1509-3257"
    }
  ],
  "references": [
    {
      "text": "Mary Ellen Berglund, Julia Duvall, Cory Simon, and Lucy E. Dunne. 2015. Surface-mount Component Attachment for e-Textiles. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (ISWC '15). ACM, New York, NY, USA, 65--66.  ",
      "doi": "10.1145/2802083.2808413"
    },
    {
      "text": "J. Berzowska and M. Coelho. 2005. Kukkia and Vilkas: Kinetic Electronic Garments. In Ninth IEEE International Symposium on Wearable Computers (ISWC'05). 82--85.  ",
      "doi": "10.1109/ISWC.2005.29"
    },
    {
      "text": "E. Bonderover and S. Wagner. 2004. A Woven Inverter Circuit for E-textile Applications. IEEE Electron Device Letters 25, 5 (May 2004), 295--297.",
      "doi": ""
    },
    {
      "text": "N. Brechet, G. Ginestet, J. Torres, E. Moradi, L. Ukkonen, T. Bjurninen, and J. Virkki. 2017. Cost- and Time-Effective Sewing Patterns for Embroidered passive UHF RFID Tags. In 2017 International Workshop on Antenna Technology: Small Antennas, Innovative Structures, and Applications (iWAT). 30--33.",
      "doi": ""
    },
    {
      "text": "L. Buechley and M. Eisenberg. 2008. The LilyPad Arduino: Toward Wearable Engineering for Everyone. IEEE Pervasive Computing 7, 2 (April 2008), 12--15.  ",
      "doi": "10.1109/MPRV.2008.38"
    },
    {
      "text": "Leah Buechley and Michael Eisenberg. 2009. Fabric PCBs, Electronic Sequins, and Socket Buttons: Techniques for E-textile Craft. Personal and Ubiquitous Computing 13, 2 (01 Feb 2009), 133--150.  ",
      "doi": "10.1007/s00779-007-0181-0"
    },
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education. In CHI '08. ACM, New York, NY, USA, 423--432.  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "L. Buechley, N. Elumeze, C. Dodson, and M. Eisenberg. 2005. Quilt Snaps: a Fabric Based Computational Construction Kit. In IEEE International Workshop on Wireless and Mobile Technologies in Education (WMTE'05). 3 pp.--.  ",
      "doi": "10.1109/WMTE.2005.55"
    },
    {
      "text": "Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the Wild: How Hardware's Long Tail is Supporting New Engineering and Design Communities. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 199--207.  ",
      "doi": "10.1145/1858171.1858206"
    },
    {
      "text": "Lina M Castano and Alison B Flatau. 2014. Smart Fabric Sensors and E-textile Technologies: A Review. Smart Materials and Structures 23, 5 (may 2014), 053001.",
      "doi": ""
    },
    {
      "text": "Anuj Dhawan, Tushar K. Ghosh, Abdelfattah M. Seyam, and John F. Muth. 2004a. Woven Fabric-Based Electrical Circuits: Part II: Yarn and Fabric Structures to Reduce Crosstalk Noise in Woven Fabric-Based Circuits. Textile Research Journal 74, 11 (2004), 955--960.",
      "doi": ""
    },
    {
      "text": "Anuj Dhawan, Abdelfattah M. Seyam, Tushar K. Ghosh, and John F. Muth. 2004b. Woven Fabric-Based Electrical Circuits: Part I: Evaluating Interconnect Methods. Textile Research Journal 74, 10 (2004), 913--919.",
      "doi": ""
    },
    {
      "text": "Lucy E. Dunne, Kaila Bibeau, Lucie Mulligan, Ashton Frith, and Cory Simon. 2012. Multi-layer e-Textile Circuits. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, New York, NY, USA, 649--650.  ",
      "doi": "10.1145/2370216.2370348"
    },
    {
      "text": "S. Farboodmanesh, J. Chen, J. L. Mead, K. D. White, H. E. Yesilalan, R. Laoulache, and S. B. Warner. 2005. Effect of Coating Thickness and Penetration on Shear Behavior of Coated Fabrics. Journal of Elastomers & Plastics 37, 3 (2005), 197--227.",
      "doi": ""
    },
    {
      "text": "Jonny Farringdon, Andrew J. Moore, Nancy Tilbury, James Church, and Pieter D. Biemond. 1999. Wearable Sensor Badge and Sensor Jacket for Context Awareness. In Proceedings of the 3rd IEEE International Symposium on Wearable Computers (ISWC '99). IEEE Computer Society, Washington, DC, USA, 107--. http://dl.acm.org/citation.cfm?id=519309.856485 ",
      "doi": "10.5555/519309.856485"
    },
    {
      "text": "Madeline Gannon, Tovi Grossman, and George Fitzmaurice. 2015. Tactum: A Skin-Centric Approach to Digital Design and Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1779--1788.  ",
      "doi": "10.1145/2702123.2702581"
    },
    {
      "text": "Ramyah Gowrishankar and Jussi Mikkonen. 2013. Pattern Resistors: Exploring Resistive Motifs as Components for E-embroidery. In Proceedings of the 2013 International Symposium on Wearable Computers (ISWC '13). ACM, New York, NY, USA, 137--138.  ",
      "doi": "10.1145/2493988.2494341"
    },
    {
      "text": "Nur Al-huda Hamdan, Jeffrey R. Blum, Florian Heller, Ravi Kanth Kosuru, and Jan Borchers. 2016a. Grabbing at an Angle: Menu Selection for Fabric Interfaces. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (ISWC '16). ACM, New York, NY, USA, 1--7.  ",
      "doi": "10.1145/2971763.2971786"
    },
    {
      "text": "Nur Al-huda Hamdan, Florian Heller, Chat Wacharamanotham, Jan Thar, and Jan Borchers. 2016b. Grabrics: A Foldable Two-Dimensional Textile Input Controller. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 2497--2503.  ",
      "doi": "10.1145/2851581.2892529"
    },
    {
      "text": "C. Kallmayer, R. Pisarek, A. Neudeck, S. Cichos, S. Gimpel, R. Aschenbrenner, and H. Reichlt. 2003. New Assembly Technologies for Textile Transponder Systems. In 53rd Electronic Components and Technology Conference, 2003. Proceedings. 1123--1126.",
      "doi": ""
    },
    {
      "text": "Eva-Sophie Katterfeldt, Nadine Dittert, and Heidi Schelhowe. 2009. EduWear: Smart Textiles As Ways of Relating Computing Technology to Everyday Life. In Proceedings of the 8th International Conference on Interaction Design and Children (IDC '09). ACM, New York, NY, USA, 9--17.  ",
      "doi": "10.1145/1551788.1551791"
    },
    {
      "text": "Majeed Kazemitabaar, Jason McPeak, Alexander Jiao, Liang He, Thomas Outing, and Jon E. Froehlich. 2017a. MakerWear: A Tangible Approach to Interactive Wearable Creation for Children. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 133--145.  ",
      "doi": "10.1145/3025453.3025887"
    },
    {
      "text": "Majeed Kazemitabaar, Jason McPeak, Alexander Jiao, Liang He, Thomas Outing, and Jon E. Froehlich. 2017b. MakerWear: A Tangible Approach to Interactive Wearable Creation for Children. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 133--145.  ",
      "doi": "10.1145/3025453.3025887"
    },
    {
      "text": "Y. Kim, H. Kim, and H. J. Yoo. 2010. Electrical Characterization of Screen-Printed Circuits on the Fabric. IEEE Transactions on Advanced Packaging 33, 1 (Feb 2010), 196--205.",
      "doi": ""
    },
    {
      "text": "James A. Landay and Brad A. Myers. 1995. Interactive Sketching for the Early Stages of User Interface Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 43--50.  ",
      "doi": "10.1145/223904.223910"
    },
    {
      "text": "David I. Lehn, Craig W. Neely, Kevin Schoonover, Thomas L. Martin, and Mark T. Jones. 2004. e-TAGs: e-Textile Attached Gadgets. In Proceedings of Communication Networks and Distributed Systems: Modeling and Simulation.",
      "doi": ""
    },
    {
      "text": "Jingyi Li, Jennifer Jacobs, Michelle Chang, and Björn Hartmann. 2017. Direct and Immediate Drawing with CNC Machines. In Proceedings of the 1st Annual ACM Symposium on Computational Fabrication (SCF '17). ACM, New York, NY, USA, Article 11, 2 pages.  ",
      "doi": "10.1145/3083157.3096344"
    },
    {
      "text": "Torsten Linz, Christine Kallmayer, Rolf Aschenbrenner, and Herbert Reichl. 2005. Embroidering Electrical Interconnects with Conductive Yarn for The Integration of Flexible Electronic Modules into Fabric. In Proceedings of the Ninth IEEE International Symposium on Wearable Computers (ISWC '05). IEEE Computer Society, Washington, DC, USA, 86--91.  ",
      "doi": "10.1109/ISWC.2005.19"
    },
    {
      "text": "Torsten Linz, René Vieroth, Christian Dils, Mathias Koch, Karl Friedrich Becker, Christine Kallmayer, Soon Min Hong, and Tanja Braun. 2009. Embroidered Interconnections and Encapsulation for Electronics in Textiles for Wearable Electronics Applications. In Smart Textiles (Advances in Science and Technology), Vol. 60. Trans Tech Publications, 85--94.",
      "doi": ""
    },
    {
      "text": "Torsten Linz, Malte von Krshiwoblozki, Hans Walter, and Philipp Foerster. 2012. Contacting Electronics to Fabric Circuits with Nonconductive Adhesive Bonding. The Journal of The Textile Institute 103, 10 (2012), 1139--1150.",
      "doi": ""
    },
    {
      "text": "Hod Lipson and Melba Kurman. 2010. Factory @ home: The Emerging Economy of Personal Fabrication. A report commissioned by the US Office of Science and Technology Policy (2010).",
      "doi": ""
    },
    {
      "text": "Emily Lovell and Leah Buechley. 2010. An e-Sewing Tutorial for DIY Learning. In Proceedings of the 9th International Conference on Interaction Design and Children (IDC '10). ACM, New York, NY, USA, 230--233.  ",
      "doi": "10.1145/1810543.1810578"
    },
    {
      "text": "Md. Tahmidul Islam Molla, Steven Goodman, Nicholas Schleif, Mary Ellen Berglund, Cade Zacharias, Crystal Compton, and Lucy E. Dunne. 2017. Surface-Mount Manufacturing for E-Textile Circuits. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (ISWC '17). ACM, New York, NY, USA, 18--25.  ",
      "doi": "10.1145/3123021.3123058"
    },
    {
      "text": "Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive Construction: Interactive Fabrication of Functional Mechanical Devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Zahi Nakad, Mark Jones, Thomas Martin, and Ravi Shenoy. 2007. Using Electronic Textiles to Implement an Acoustic Beamforming Array: A Case Study. Pervasive Mob. Comput. 3, 5 (Oct. 2007), 581--606.  ",
      "doi": "10.1016/j.pmcj.2007.02.003"
    },
    {
      "text": "Grace Ngai, Stephen C.F. Chan, Joey C.Y. Cheung, and Winnie W.Y. Lau. 2009. The TeeBoard: An Education-friendly Construction Platform for e-Textiles and Wearable Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 249--258.  ",
      "doi": "10.1145/1518701.1518742"
    },
    {
      "text": "Grace Ngai, Stephen C.F. Chan, Vincent T.Y. Ng, Joey C.Y. Cheung, Sam S.S. Choy, Winnie W.Y. Lau, and Jason T.P. Tse. 2010. I*CATch: A Scalable Plug-n-play Wearable Computing Framework for Novices and Children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 443--452.  ",
      "doi": "10.1145/1753326.1753393"
    },
    {
      "text": "R. Paradiso, G. Loriga, and N. Taccini. 2005. A Wearable Health Care System Based on Knitted Integrated Sensors. Trans. Info. Tech. Biomed. 9, 3 (Sept. 2005), 337--344.  ",
      "doi": "10.1109/TITB.2005.854512"
    },
    {
      "text": "Roshan Lalintha Peiris and Suranga Nanayakkara. 2014. PaperPixels: A Toolkit to Create Paper-based Displays. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, New York, NY, USA, 498--504.  ",
      "doi": "10.1145/2686612.2686691"
    },
    {
      "text": "Huaishu Peng, Jennifer Mankoff, Scott E. Hudson, and James McCann. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1789--1798.  ",
      "doi": "10.1145/2702123.2702327"
    },
    {
      "text": "Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2011. Handcrafting Textile Interfaces from a Kit-of-no-parts. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, New York, NY, USA, 61--68.  ",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "E. R. Post, M. Orth, P. R. Russo, and N. Gershenfeld. 2000. E-broidery: Design and Fabrication of Textile-based Computing. IBM Syst. J. 39, 3--4 (July 2000), 840--860.  ",
      "doi": "10.1147/sj.393.0840"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4216--4227.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: Programming for All. Commun. ACM 52, 11 (Nov. 2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Jung-Sim Roh. 2014. Textile Touch Sensors for Wearable and Ubiquitous Interfaces. Textile Research Journal 84, 7 (2014), 739--750.",
      "doi": ""
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 103--108.  ",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 3--12.  ",
      "doi": "10.1145/2642918.2647374"
    },
    {
      "text": "A. Schwarz, J. Cardoen, P. Westbroek, L. Van Langenhove, E. Bruneel, I. Van Driessche, and J. Hakuzimana. 2010. Steps Towards a Textile-Based Transistor: Development of the Gate and Insulating Layer. Textile Research Journal 80, 16 (2010), 1738--1746.",
      "doi": ""
    },
    {
      "text": "Eric Schweikardt and Mark D. Gross. 2000. Digital Clay: Deriving Digital Models From Freehand Sketches. Automation in Construction 9, 1 (2000), 107 -- 115.",
      "doi": ""
    },
    {
      "text": "H Sirringhaus, T Kawase, RH Friend, T Shimoda, M Inbasekaran, W Wu, and EP Woo. 2000. High-resolution Inkjet Printing of All-Polymer Transistor Circuits. Science 290, 5499 (2000), 2123--2126.",
      "doi": ""
    },
    {
      "text": "Anita Vogl, Patrick Parzer, Teo Babic, Joanne Leong, Alex Olwal, and Michael Haller. 2017. StretchEBand: Enabling Fabric-based Interactions Through Rapid Fabrication of Textile Stretch Sensors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2617--2627.  ",
      "doi": "10.1145/3025453.3025938"
    },
    {
      "text": "R. Wijesiriwardana, K. Mitcham, and T. Dias. 2004. Fibre-Meshed Transducers Based Real Time Wearable Physiological Information Monitoring System. In Proceedings of the Eighth International Symposium on Wearable Computers (ISWC '04). IEEE Computer Society, Washington, DC, USA, 40--47.  ",
      "doi": "10.1109/ISWC.2004.20"
    },
    {
      "text": "Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2011. Interactive Fabrication: New Interfaces for Digital Fabrication. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, New York, NY, USA, 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "C. Zeagler, S. Gilliland, H. Profita, and T. Starner. 2012. Textile Interfaces: Embroidered Jog-Wheel, Beaded Tilt Sensor, Twisted Pair Ribbon, and Sound Sequins. In 2012 16th International Symposium on Wearable Computers. 60--63.  ",
      "doi": "10.1109/ISWC.2012.29"
    }
  ]
}