{
  "doi": "10.1145/3173574.3173783",
  "title": "Simulator Sickness in Augmented Reality Training Using the Microsoft HoloLens",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "Augmented Reality is on the rise with consumer-grade smart glasses becoming available in recent years. Those interested in deploying these head-mounted displays need to understand better the effect technology has on the end user. One key aspect potentially hindering the use is motion sickness, a known problem inherited from virtual reality, which so far remains under-explored. In this paper we address this problem by conducting an experiment with 142 subjects in three different industries: aviation, medical, and space. We evaluate whether the Microsoft HoloLens, an augmented reality head-mounted display, causes simulator sickness and how different symptom groups contribute to it (nausea, oculomotor and disorientation). Our findings suggest that the Microsoft HoloLens causes across all participants only negligible symptoms of simulator sickness. Most consumers who use it will face no symptoms while only few experience minimal discomfort in the training environments we tested it in.",
  "authors": [
    {
      "name": "Alla Vovk",
      "institution": "Oxford Brookes University, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260974",
      "orcid": "missing"
    },
    {
      "name": "Fridolin Wild",
      "institution": "Oxford Brookes University, Oxford, United Kingdom",
      "img": "/do/10.1145/contrib-81344500270/rel-imgonly/fridolin-wild-kmi2.jpg",
      "acmid": "81344500270",
      "orcid": "missing"
    },
    {
      "name": "Will Guest",
      "institution": "Oxford Brookes University, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260357",
      "orcid": "missing"
    },
    {
      "name": "Timo Kuula",
      "institution": "VTT Technical Research Centre of Finland Ltd, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448600087",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Balk S., Bertola A., Inman V. 2013. Simulator sickness questionnaire: twenty years later, in: Proceedings of the Seventh International Driving Symposium on Human Factors in Driver Assessment, Training, and Vehicle Design, pp. 257--263.",
      "doi": ""
    },
    {
      "text": "Barrett, Judy, and Defence Science & Technology Organisation (Australia). Information Sciences Laboratory. 2004. Side Effects of Virtual Environments: A Review of the Literature / Judy Barrett. Edinburgh, S. Aust.: DSTO Information Sciences Laboratory, C. Technical Report (Defence Science & Technology Organisation (Australia)); DSTO-TR-1419. Edinburgh, S. Aust: DSTO Information Sciences Laboratory.",
      "doi": ""
    },
    {
      "text": "Bertin, R. J. V., Collet, C., Espié, S., & Graf, W. 2005. Objective measurement of simulator sickness and the role of visual-vestibular conflict situations. Paper presented at the DSC 2005, Orlando.",
      "doi": ""
    },
    {
      "text": "Billinghurst M., Clark A., Lee G.  2015. A survey of augmented reality, Foundations and Trends in Human-Computer Interaction, vol. 8, no. 2--3, pp. 73--272.  ",
      "doi": "10.1561/1100000049"
    },
    {
      "text": "Buker, Timothy J., Dennis A. Vincenzi, and John E. Deaton. 2012. \"The Effect of Apparent Latency on Simulator Sickness While Using a See-through Helmet-Mounted Display: Reducing Apparent Latency with Predictive Compensation.\" Human Factors 54 (2): 235--49.",
      "doi": ""
    },
    {
      "text": "Cobb, Sue V. G., Sarah Nichols, Amanda Ramsey, and John R. Wilson. 1999. \"Virtual Reality-Induced Symptoms and Effects (VRISE).\" Presence: Teleoperators and Virtual Environments 8 (2): 169--8  ",
      "doi": "10.1162/105474699566152"
    },
    {
      "text": "Cutmore T., Tim R.H., Trevor J. Hine, Kerry J. Maberly, Nicole M. Langford, and Grant Hawgood. 2000. \"Cognitive and Gender Factors Influencing Navigation in a Virtual Environment.\" Int. J. Hum.-Comput. Stud. 53 (2): 223--249.  ",
      "doi": "10.1006/ijhc.2000.0389"
    },
    {
      "text": "Davis, S., Nesbitt, K., Nalivaiko, E. 2015. Comparing the onset of cybersickness using the Oculus Rift and two virtual roller coasters. In: Proceedings of the 11th Australasian Conference on Interactive Entertainment, Sydney, Australia, vol. 167, pp. 3--14. CRPIT.",
      "doi": ""
    },
    {
      "text": "DiZio, P. & Lackner, J. R. 1997. Circumventing Side Effects of Immersive Virtual Environments., in Michael J. Smith; Gavriel Salvendy & Richard J. Koubek, ed., 'HCI (2)', Elsevier,, pp. 893--896.",
      "doi": ""
    },
    {
      "text": "Drascic D. and Milgram P. 1996.  \"Perceptual Issues in Augmented Reality\". In: Proceedings of SPIE Stereoscopic Displays and Virtual Reality Systems III.",
      "doi": ""
    },
    {
      "text": "1Gianaros, Peter J., Eric R. Muth, J. Toby Mordkoff, Max E. Levine, and Robert M. Stern. 2001. \"A Questionnaire for the Assessment of the Multiple Dimensions of Motion Sickness.\" Aviation, Space, and Environmental Medicine 72 (2): 115--19.",
      "doi": ""
    },
    {
      "text": "Graybiel A, Wood CD, Miller EF, Cramer DB. 1986. Diagnostic criteria for grading the severity of acute motion sickness. Aerosp Med. 39:453--455.",
      "doi": ""
    },
    {
      "text": "Ihemedu-Steinke, Quinate Chioma, Stanislava Rangelova, Michael Weber, Rainer Erbach, Gerrit Meixner, and Nicola Marsden. 2017. \"Simulation Sickness Related to Virtual Reality Driving Simulation.\" In SpringerLink, 521--32. Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Jerald, J. 2015. The VR Book: Human-Centered Design for Virtual Reality. Association for Computing Machinery and Morgan & Claypool, New York. ",
      "doi": "10.1145/2792790"
    },
    {
      "text": "Jinjakam, C., and K. Hamamoto. 2012. \"Simulator Sickness in Immersive Virtual Environment.\" In The 5th 2012 Biomedical Engineering International Conference, 1--4.",
      "doi": ""
    },
    {
      "text": "Johnson David M. 2005. Research Report 1832. Introduction to and Review of Simulator Sickness Research. U.S. Army Research Institute. 20050627 083.",
      "doi": ""
    },
    {
      "text": "Kalawsky, R. S., A. W. Stedmon, K. Hill, and C. A. Cook. 2000. \"A Taxonomy of Technology: Defining Augmented Reality.\" Proceedings of the Human Factors and Ergonomics Society Annual Meeting 44 (5): 507--10.",
      "doi": ""
    },
    {
      "text": "Kennedy, R.S., Lane, N.E., Berbaum, K.S. & Lilienthal, M.G. 1993. \"Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness \" Journal of Aviation Psychology 3(3): 203--220.",
      "doi": ""
    },
    {
      "text": "Kennedy, Robert S., Norman E. Lane, Michael G. Lilienthal, Kevin S. Berbaum, and Lawrence J. Hettinger. 1992. \"Profile Analysis of Simulator Sickness Symptoms: Application to Virtual Environment Systems.\" Presence: Teleoper. Virtual Environ. 1 (3): 295--301.",
      "doi": "10.5555/2870742.2870745"
    },
    {
      "text": "Keshavarz, Behrang, and Heiko Hecht. 2011. \"Validating an Efficient Method to Quantify Motion Sickness.\" Human Factors 53 (4): 415--26.",
      "doi": ""
    },
    {
      "text": "2Kishishita, N., K. Kiyokawa, J. Orlosky, T. Mashita, H. Takemura, and E. Kruijff. 2014. \"Analysing the Effects of a Wide Field of View Augmented Reality Display on Search Performance in Divided Attention Tasks.\" In 2014 IEEE International Symposium on Mixed and Augmented Reality (ISMAR), 177--86.",
      "doi": ""
    },
    {
      "text": "2Kolasinski E.M., Gilson R.D. 1998. Simulator sickness and related finding in a virtual environment. Proceedings of the Human Factors and Ergonomics Society 42nd Annual Meeting, 1511--1515.",
      "doi": ""
    },
    {
      "text": "Kolasinski, E. M. 1995. Simulator Sickness in Virtual Environments, (ARI Technical Report 1027). Alexandria, VA: U.S. Army Research Institute for the Behavioral and Social Sciences.",
      "doi": ""
    },
    {
      "text": "LaViola, Joseph J., Jr. 2000. \"A Discussion of Cybersickness in Virtual Environments.\" SIGCHI Bull. 32 (1): 47--56.  ",
      "doi": "10.1145/333329.333344"
    },
    {
      "text": "Lawson, B., Graeber, D., Mead, A., & Muth, E. 2002. Signs and symptoms of human syndromes associated with synthetic experiences. In K. M. Stanney (Ed.), Handbook of virtual environments: Design, implementation, and applications (pp. 589--618). Mahwah, NJ: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Llorach, Gerard, Alun Evans, and Josep Blat. 2014. \"Simulator Sickness and Presence Using HMDs: Comparing Use of a Game Controller and a Position Estimation System.\" In, 137--40. ACM.  ",
      "doi": "10.1145/2671015.2671120"
    },
    {
      "text": "McCauley, Michael, and Thomas Sharkey. 1992. \"Cybersickness: Perception of Self-Motion in Virtual Environment.\"",
      "doi": ""
    },
    {
      "text": "Oman, Charles. 1993. Sensory Conflict in Motion Sickness: An Observer Theory Approach in Pictorial Communication in Virtual and Real Environments, S.R. Ellis, Editor. Taylor & Francis: London. p. 362--376. ",
      "doi": "10.5555/169310.169386"
    },
    {
      "text": "Reason, J T. 1978. \"Motion Sickness Adaptation: A Neural Mismatch Model.\" Journal of the Royal Society of Medicine 71 (11): 819--",
      "doi": ""
    },
    {
      "text": "Reason, J.T.,  Brand, J.J. 1975. Motion sickness. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "3Rebenitsch, Lisa, and Charles Owen. 2014. \"Individual Variation in Susceptibility to Cybersickness.\" In, 309--17. ACM.  ",
      "doi": "10.1145/2642918.2647394"
    },
    {
      "text": "3Riccio, Gary E., and Thomas A. Stoffregen. 1991. \"An Ecological Theory of Motion Sickness and Postural Instability.\" Ecological Psychology 3 (3): 195--240.",
      "doi": ""
    },
    {
      "text": "3Sabelman, E., Lam, R. 2015. \"The Real-Life Dangers of Augmented Reality.\" IEEE Spectrum, https://spectrum.ieee.org/consumerelectronics/portable-devices/the-reallife-dangers-of-augmented-reality.",
      "doi": ""
    },
    {
      "text": "Serge, Stephen R., and Gino Fragomeni. 2017. \"Assessing the Relationship Between Type of Head Movement and Simulator Sickness Using an Immersive Virtual Reality Head Mounted Display: A Pilot Study.\" In SpringerLink, 556--66. Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Singer, Michael J., Jennifer A. Ehrlich, and Robert C. Allen. 1998. \"Virtual Environment Sickness: Adaptation to and Recovery from a Search Task.\" Proceedings of the Human Factors and Ergonomics Society Annual Meeting, October.",
      "doi": ""
    },
    {
      "text": "Singla A., S. Fremerey, W. Robitza, and A. Raake. 2017. \"Measuring and Comparing QoE and Simulator Sickness of Omnidirectional Videos in Different Head Mounted Displays.\" In 2017 Ninth International Conference on Quality of Multimedia Experience (QoMEX), 1--6.",
      "doi": ""
    },
    {
      "text": "3Stanney K., Salvendy G., Deisinger J., DiZio P., Ellis S., Ellison J., Fogleman G., Gallimore J., Singer M., Hettinger  L., Kennedy  R., Lackner J., Lawson B., Maida J., Mead A., Mon-Williams M., Newman D., Piantanida T., Reeves L., Riedel O., Stoffregen T., Wann J., Welch R., Wilson J., Witmer B. 1998. Aftereffects and sense of presence in virtual environments: formulation of a research and development agenda.' International Journal of Human-Computer Interaction, vol 10, no. 2, pp. 135--187.",
      "doi": ""
    },
    {
      "text": "3Stone, R. 2001. Virtual reality for interactive training: and industrial practitioner's viewpoint. International Journal of Human - Computer Studies, 55, 699--711.  ",
      "doi": "10.1006/ijhc.2001.0497"
    },
    {
      "text": "3Terhoeven, Jan, and Sascha Wischniewski. 2017. \"Cognitive Load by Context-Sensitive Information Provision Using Binocular Smart Glasses in an Industrial Setting.\" In HCI in Business, Government and Organizations. Interacting with Information Systems, 387--99. Lecture Notes in Computer Science. Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Uliano, K. C., E. Y. Lambert, R. S. Kennedy, and D. J. Sheppard. 1986. \"The Effects of Asynchronous Visual Delays on Simulator Flight Performance and the Development of Simulator Sickness Symptomatology.\"",
      "doi": ""
    },
    {
      "text": "4Valimont, R. B., Gangadharan, S. N., Vincenzi, D. A., & Majoros, A. E. (2007). The Effectiveness of Augmented Reality as a Facilitator of Information Acquisition in Aviation Maintenance Applications. Journal of Aviation/Aerospace Education & Research, 16(2).",
      "doi": ""
    }
  ]
}