{
  "doi": "10.1145/3173574.3174083",
  "title": "Is it Happy?: Behavioural and Narrative Frame Complexity Impact Perceptions of a Simple Furry Robot's Emotions",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Critical to social human-robot interaction is a robot's emotional richness, expressed within the parameters of its physical display. While emotion arousal is straightforward to convey, human valence (positivity) evaluations are famously ambiguous, whether we are assessing other humans or a robot. Imagine someone breathing raggedly: are they nervous, or excited? To assess the premise that irregular breathing connotes low valence (emotion negativity), we implemented different levels of breathing variability and complexity in simple furry robots. We asked 10 participants to watch and feel the behaviors, rate their valence, and explain their impressions. While a quantitative exploration of new and previous data showed correlation between multi-scale entropy and valence, the rich narratives revealed by thematic analysis of participant explanations call into question whether a single motion can, alone, be unambiguously valenced. Based on this evidence that people perceive robots as having inner lives, we recommend ways to build up narrative contexts over multiple interactions.",
  "authors": [
    {
      "name": "Paul Bucci",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658762948",
      "orcid": "missing"
    },
    {
      "name": "Lotus Zhang",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260431",
      "orcid": "missing"
    },
    {
      "name": "Xi Laura Cang",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658761782",
      "orcid": "missing"
    },
    {
      "name": "Karon E. MacLean",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100608981",
      "orcid": "0000-0003-2969-4627"
    }
  ],
  "references": [
    {
      "text": "Justin L Barrett and Amanda Hankes Johnson. 2003. The role of control in attributing intentional agency to inanimate objects. Journal of Cognition and Culture 3, 3 (2003), 208--217.",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett, Batja Mesquita, and Maria Gendron. 2011. Context in emotion perception. Current Directions in Psychological Science 20, 5 (2011), 286--290.",
      "doi": ""
    },
    {
      "text": "Diane S Berry, Stephen J Misovich, Kevin J Kean, and Reuben M Baron. 1992. Effects of disruption of structure and motion on perceptions of social causality. Personality and Social Psychology Bulletin 18, 2 (1992), 237--244.",
      "doi": ""
    },
    {
      "text": "Susana Bloch, Madeleine Lemeignan, and Nancy Aguilera-T. 1991. Specific respiratory patterns distinguish among human basic emotions. Intl Journal of Psychophysiology 11, 2 (1991), 141--154.",
      "doi": ""
    },
    {
      "text": "Frans A Boiten, Nico H Frijda, and Cornelis JE Wientjes. 1994. Emotions and respiratory patterns: review and critical analysis. International Journal of Psychophysiology 17, 2 (1994), 103--128.",
      "doi": ""
    },
    {
      "text": "Danny Oude Bos and others. 2006. EEG-based emotion recognition. The Influence of Visual and Auditory Stimuli 56, 3 (2006), 1--17.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Mason Bretan, Guy Hoffman, and Gil Weinberg. 2015. Emotionally expressive dynamic physical behaviors in robots. International Journal of Human-Computer Studies 78 (2015), 1--16.  ",
      "doi": "10.1016/j.ijhcs.2015.01.006"
    },
    {
      "text": "Paul Bucci, Laura Cang, Sazi Valair, David Marino, Lucia Tseng, Merel Jung, Jussi Rantala, Oliver Schneider, and Karon MacLean. 2017. Sketching CuddleBits: Coupled Prototyping of Body and Behaviour for an Affective Robot Pet. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI) 2017. (2017).  ",
      "doi": "10.1145/3025453.3025774"
    },
    {
      "text": "Herbert H Clark, Susan E Brennan, and others. 1991. Grounding in communication. Perspectives on socially shared cognition 13, 1991 (1991), 127--149.",
      "doi": ""
    },
    {
      "text": "Madalena Costa, Ary L Goldberger, and C-K Peng. 2002. Multiscale entropy analysis of complex physiologic time series. Physical review letters 89, 6 (2002), 068102.",
      "doi": ""
    },
    {
      "text": "Madalena D Costa, Chung-Kang Peng, and Ary L Goldberger. 2008. Multiscale analysis of heart rate dynamics: entropy and time irreversibility measures. Cardiovascular Engineering 8, 2 (2008), 88--93.",
      "doi": ""
    },
    {
      "text": "John R Crawford and Julie D Henry. 2004. The Positive and Negative Affect Schedule (PANAS): Construct validity, measurement properties and normative data in a large non-clinical sample. British Journal of Clinical Psychology 43, 3 (2004), 245--265.",
      "doi": ""
    },
    {
      "text": "Jessica Q. Dawson, Oliver S. Schneider, Joel Ferstay, Dereck Toker, Juliette Link, Shathel Haddad, and Karon MacLean. 2013. It's alive!: exploring the design space of a gesturing phone. In GI '13 Proceedings of Graphics Interface 2013. Canadian Information Processing Society, 205--212. http://dl.acm.org/citation.cfm?id=2532129.2532164 ",
      "doi": "10.5555/2532129.2532164"
    },
    {
      "text": "Celso M de Melo, Patrick Kenny, and Jonathan Gratch. 2010. Real-time expression of affect through respiration. Computer Animation and Virtual Worlds 21, 3--4 (2010), 225--234.  ",
      "doi": "10.5555/1857859.1857870"
    },
    {
      "text": "Johnny RJ Fontaine, Klaus R Scherer, Etienne B Roesch, and Phoebe C Ellsworth. 2007. The world of emotions is not two-dimensional. Psychological science 18, 12 (2007), 1050--1057.",
      "doi": ""
    },
    {
      "text": "Anonymized for Review. Sketching CuddleBits: Coupled Prototyping of Body and Behaviour for an Affective Robot Pet. Submitted to CHI '17 (????).",
      "doi": ""
    },
    {
      "text": "Simon Garrod and Martin J Pickering. 2004. Why is conversation so easy? Trends in cognitive sciences 8, 1 (2004), 8--11.",
      "doi": ""
    },
    {
      "text": "Maria Gendron, Debi Roberson, Jacoba Marietta van der Vyver, and Lisa Feldman Barrett. 2014. Perceptions of emotion from facial expressions are not culturally universal: evidence from a remote culture. Emotion 14, 2 (2014), 251.",
      "doi": ""
    },
    {
      "text": "Alvin I Goldman and others. 2012. Theory of mind. The Oxford handbook of philosophy of cognitive science (2012), 402--424.",
      "doi": ""
    },
    {
      "text": "Fritz Heider and Marianne Simmel. 1944. An experimental study of apparent behavior. The American Journal of Psychology 57, 2 (1944), 243--259.",
      "doi": ""
    },
    {
      "text": "Matthew J Hertenstein, Rachel Holmes, Margaret McCullough, and Dacher Keltner. 2009. The communication of emotion via touch. Emotion 9, 4 (2009), 566.",
      "doi": ""
    },
    {
      "text": "K Michael Hong and Brenda D Townes. 1976. Infants' attachment to inanimate objects: A cross-cultural study. Journal of the American Academy of Child Psychiatry 15, 1 (1976), 49--61.",
      "doi": ""
    },
    {
      "text": "Malte F Jung. 2017. Affective Grounding in Human-Robot Interaction. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 263--273.  ",
      "doi": "10.1145/2909824.3020224"
    },
    {
      "text": "Klaus Krippendorff. 2007. Computing Krippendorff's alpha reliability. Departmental papers (ASC) (2007), 43.",
      "doi": ""
    },
    {
      "text": "David Marino, Paul Bucci, Oliver S Schneider, and Karon E MacLean. 2017. Voodle: Vocal Doodling to Sketch Affective Robot Motion. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 753--765.  ",
      "doi": "10.1145/3064663.3064668"
    },
    {
      "text": "AJ Mitchell, Yates C, Williams K, and Hall RW. 2013. Effects of daily kangaroo care on cardiorespiratory parameters in preterm infants. J Neonatal Perinatal Med 6, 3 (2013), 243--9.",
      "doi": ""
    },
    {
      "text": "Toru Nakata, Tomomasa Sato, Taketoshi Mori, and Hiroshi Mizoguchi. 1998. Expression of emotion and intention by robot body movement. In Proceedings of the 5th International Conference on Autonomous Systems.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Youngme Moon, BJ Fogg, Byron Reeves, and D Christopher Dryer. 1995. Can computer personalities be human personalities? International Journal of Human-Computer Studies 43, 2 (1995), 223--239.  ",
      "doi": "10.1006/ijhc.1995.1042"
    },
    {
      "text": "Tetsuo Ono, Michita Imai, and Ryohei Nakatsu. 2000. Reading a robot's mind: A model of utterance understanding based on the theory of mind mechanism. Advanced Robotics 14, 4 (2000), 311--326.",
      "doi": ""
    },
    {
      "text": "Joshua S Richman and J Randall Moorman. 2000. Physiological time-series analysis using approximate entropy and sample entropy. American Journal of Physiology-Heart and Circulatory Physiology 278, 6 (2000), H2039--H2049.",
      "doi": ""
    },
    {
      "text": "James A Russell, Anna Weiss, and Gerald A Mendelsohn. 1989. Affect grid: a single-item scale of pleasure and arousal. Journal of personality and social psychology 57, 3 (1989), 493.",
      "doi": ""
    },
    {
      "text": "Martin Saerbeck and Christoph Bartneck. 2010. Perception of affect elicited by robot motion. In Human-Robot Interaction (HRI), 2010 5th ACM/IEEE International Conference on. IEEE, 53--60. ",
      "doi": "10.5555/1734454.1734473"
    },
    {
      "text": "Yasaman Sefidgar, Karon E MacLean, S. Yohanan, Machiel Van der Loos, Elizabeth A Croft, and Jane Garland. 2015. Design and Evaluation of a Touch-Centered Calming Interaction with a Social Robot. Trans Affective Computing PP, 99 (2015).",
      "doi": ""
    },
    {
      "text": "David Sirkin, Brian Mok, Stephen Yang, and Wendy Ju. 2015. Mechanical ottoman: how robotic furniture offers and withdraws support. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. ACM, 11--18.  ",
      "doi": "10.1145/2696454.2696461"
    },
    {
      "text": "Sichao Song and Seiji Yamada. 2017. Expressing emotions through color, sound, and vibration with an appearance-constrained social robot. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 2--11.  ",
      "doi": "10.1145/2909824.3020239"
    },
    {
      "text": "Haodan Tan, John Tiab, Selma Šabanovi´ c, and Kasper Hornbæk. 2016. Happy Moves, Sad Grooves: Using Theories of Biological Motion and Affect to Design Shape-Changing Interfaces. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 1282--1293.  ",
      "doi": "10.1145/2901790.2901845"
    },
    {
      "text": "Frank Thomas and Ollie Johnston. 1981. Disney animation: The illusion of life. Abbeville Press.",
      "doi": ""
    },
    {
      "text": "Jennifer A Vadeboncoeur, Anthony Perone, and Natalia Panina-Beard. 2016. Creativity as a practice of freedom: Imaginative play, moral imagination, and the production of culture. In The Palgrave Handbook of Creativity and Culture Research. Springer, 285--305.",
      "doi": ""
    },
    {
      "text": "David Watson, Lee A Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales. Journal of personality and social psychology 54, 6 (1988), 1063.",
      "doi": "10.1037/0022-3514.54.6.1063"
    },
    {
      "text": "Matthias J Wieser, Antje BM Gerdes, Inga Büngel, Katharina A Schwarz, Andreas Mühlberger, and Paul Pauli. 2014. Not so harmless anymore: how context impacts the perception and electrocortical processing of neutral faces. Neuroimage 92 (2014), 74--82.",
      "doi": ""
    },
    {
      "text": "Stephen Yang, Brian Ka-Jun Mok, David Sirkin, Hillary Page Ive, Rohan Maheshwari, Kerstin Fischer, and Wendy Ju. 2015. Experiences developing socially acceptable interactions for a robotic trash barrel. In Robot and Human Interactive Communication (RO-MAN), 2015 24th IEEE International Symposium on. IEEE, 277--284.",
      "doi": "10.1109/ROMAN.2015.7333693"
    },
    {
      "text": "Steve Yohanan and Karon E MacLean. 2011. Design and assessment of the haptic creature's affect display. In Proceedings of the 6th international conference on Human-robot interaction (HRI '11). ACM, New York, NY, USA, 473--480.  ",
      "doi": "10.1145/1957656.1957820"
    }
  ]
}