{
  "doi": "10.1145/3173574.3173762",
  "title": "Silicone Devices: A Scalable DIY Approach for Fabricating Self-Contained Multi-Layered Soft Circuits using Microfluidics",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "We present a scalable Do-It-Yourself (DIY) fabrication workflow for prototyping highly stretchable yet robust devices using a CO2 laser cutter, which we call Silicone Devices. Silicone Devices are self-contained and thus embed components for input, output, processing, and power. Our approach scales to arbitrary complex devices as it supports techniques to make multi-layered stretchable circuits and buried VIAs. Additionally, high-frequency signals are supported as our circuits consist of liquid metal and are therefore highly conductive and durable. To enable makers and interaction designers to prototype a wide variety of Silicone Devices, we also contribute a stretchable sensor toolkit, consisting of touch, proximity, sliding, pressure, and strain sensors. We demonstrate the versatility and novel opportunities of our technique by prototyping various samples and exploring their use cases. Strain tests report on the reliability of our circuits and preliminary user feedback reports on the user-experience of our workflow by non-engineers.",
  "authors": [
    {
      "name": "Steven Nagels",
      "institution": "Hasselt University, Diepenbeek, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702145",
      "orcid": "missing"
    },
    {
      "name": "Raf Ramakers",
      "institution": "Hasselt University-tUL-imec, Hasselt, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549578156",
      "orcid": "0000-0001-6466-0663"
    },
    {
      "name": "Kris Luyten",
      "institution": "Hasselt University - tUL - Flanders Make, Diepenbeek, Belgium",
      "img": "/do/10.1145/contrib-81309493252/rel-imgonly/luyten_k.png",
      "acmid": "81309493252",
      "orcid": "0000-0002-4194-1101"
    },
    {
      "name": "Wim Deferme",
      "institution": "Hasselt University, Diepenbeek, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260661",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 423--432.  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Varun Perumal C and Daniel Wigdor. Printem: Instant Printed Circuit Boards with Standard Office Printers & Inks. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 243--251.  ",
      "doi": "10.1145/2807442.2807511"
    },
    {
      "text": "Marcelo Coelho, Lyndl Hall, Joanna Berzowska, and Pattie Maes. Pulp-based Computing: A Framework for Building Computers out of Paper. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 3527--3528.  ",
      "doi": "10.1145/1520340.1520525"
    },
    {
      "text": "Artem Dementyev, Hsin-Liu (Cindy) Kao, and Joseph A. Paradiso. SensorTape: Modular and Programmable 3D-Aware Dense Sensor Network on a Tape. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA, 649--658.  ",
      "doi": "10.1145/2807442.2807507"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. Ï Don'T Want to Wear a Screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 6028--6039.  ",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Michael D Dickey, Ryan C Chiechi, Ryan J Larsen, Emily A Weiss, David A Weitz, and George M Whitesides. 2008. Eutectic gallium-indium (EGaIn): a liquid metal alloy for the formation of stable structures in microchannels at room temperature. Advanced Functional Materials 18, 7 (2008), 1097--1104.",
      "doi": ""
    },
    {
      "text": "Jamie Dillon, Nick Paparone, and Luren Jenison. Print Liberation: Screen Printing Primer. North Light Books.",
      "doi": ""
    },
    {
      "text": "Seung Hee Jeong, Anton Hagman, Klas Hjort, Magnus Jobs, Johan Sundqvist, and Zhigang Wu. 2012. Liquid alloy printing of microfluidic stretchable electronics. Lab on a Chip 12, 22 (2012), 4657--4664.",
      "doi": ""
    },
    {
      "text": "Seung Hee Jeong, Klas Hjort, and Zhigang Wu. 2015. Tape transfer atomization patterning of liquid alloys for microfluidic stretchable wireless power transfer. Scientific reports 5 (2015).",
      "doi": ""
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 363--372.  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 363--372.  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Hyun-Joong Kim, Chulwoo Son, and Babak Ziaie. 2008. A multiaxial stretchable interconnect using liquid-alloy-filled elastomeric microchannels. Applied Physics Letters 92, 1 (2008), 011904.",
      "doi": ""
    },
    {
      "text": "Rebecca K Kramer, Carmel Majidi, and Robert J Wood. Wearable tactile keypad with stretchable artificial skin. In Robotics and Automation (ICRA), 2011 IEEE International Conference on. IEEE, 1103--1107.",
      "doi": ""
    },
    {
      "text": "Rebecca K Kramer, Carmel Majidi, and Robert J Wood. 2013. Masked Deposition of Gallium-Indium Alloys for Liquid-Embedded Elastomer Conductors. Advanced Functional Materials 23, 42 (2013), 5292--5296.",
      "doi": ""
    },
    {
      "text": "Hanchuan Li, Eric Brockmeyer, Elizabeth J. Carter, Josh Fromm, Scott E. Hudson, Shwetak N. Patel, and Alanson Sample. PaperID: A Technique for Drawing Functional Battery-Free Wireless Interfaces on Paper. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5885--5896.  ",
      "doi": "10.1145/2858036.2858249"
    },
    {
      "text": "Joanne Lo, Doris Jung Lin Lee, Nathan Wong, David Bui, and Eric Paulos. Skintillates: Designing and Creating Epidermal Interactions. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 853--864.  ",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Joanne Lo, Cesar Torres, Isabel Yang, Jasper O'Leary, Danny Kaufman, Wilmot Li, Mira Dontcheva, and Eric Paulos. Aesthetic Electronics: Designing, Sketching, and Fabricating Circuits Through Digital Exploration. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 665--676.  ",
      "doi": "10.1145/2984511.2984579"
    },
    {
      "text": "Tong Lu, Lauren Finkenauer, James Wissman, and Carmel Majidi. 2014. Rapid Prototyping for Soft-Matter Electronics. Advanced Functional Materials 24, 22 (2014), 3351--3356.",
      "doi": ""
    },
    {
      "text": "Tong Lu, Eric Markvicka, Yichu Jin, and Carmel Majidi. 2017. Soft-Matter Printed Circuit Board with UV Laser Micropatterning. ACS Applied Materials & Interfaces (2017).",
      "doi": ""
    },
    {
      "text": "David A. Mellis, Sam Jacoby, Leah Buechley, Hannah Perner-Wilson, and Jie Qi. Microcontrollers As Material: Crafting Circuits with Paper, Conductive Ink, Electronic Components, and an Üntoolkit\". In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, New York, NY, USA, 83--90.  ",
      "doi": "10.1145/2460625.2460638"
    },
    {
      "text": "YiğMengüç, Yong-Lae Park, Hao Pei, Daniel Vogt, Patrick M Aubin, Ethan Winchell, Lowell Fluke, Leia Stirling, Robert J Wood, and Conor J Walsh. 2014. Wearable soft sensing suit for human gait measurement. The International Journal of Robotics Research 33, 14 (2014), 1748--1764.  ",
      "doi": "10.1177/0278364914543793"
    },
    {
      "text": "Kris Myny, Erik van Veenendaal, Gerwin H Gelinck, Jan Genoe, Wim Dehaene, and Paul Heremans. 2012. An 8-bit, 40-instructions-per-second organic microprocessor on plastic foil. IEEE Journal of Solid-State Circuits 47, 1 (2012), 284--291.",
      "doi": ""
    },
    {
      "text": "Simon Olberding, Nan-Wei Gong, John Tiab, Joseph A. Paradiso, and Jürgen Steimle. A Cuttable Multi-touch Sensor. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 245--254.  ",
      "doi": "10.1145/2501988.2502048"
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. Foldio: Digital Fabrication of Interactive and Shape-Changing Objects With Foldable Printed Electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA, 223--232.  ",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. PrintScreen: Fabricating Highly Customizable Thin-film Touch-displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 281--290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4216--4227.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Jie Qi and Leah Buechley. Sketching in Circuits: Designing and Building Electronics on Paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1713--1722.  ",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2457--2466.  ",
      "doi": "10.1145/2702123.2702487"
    },
    {
      "text": "Christian Rendl, Patrick Greindl, Michael Haller, Martin Zirkl, Barbara Stadlober, and Paul Hartmann. PyzoFlex: Printed Piezoelectric Pressure Sensing Foil. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 509--518.  ",
      "doi": "10.1145/2380116.2380180"
    },
    {
      "text": "Christian Rendl, David Kim, Sean Fanello, Patrick Parzer, Christoph Rhemann, Jonathan Taylor, Martin Zirkl, Gregor Scheipl, Thomas Rothländer, Michael Haller, and Shahram Izadi. FlexSense: A Transparent Self-sensing Deformable Surface. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 129--138.  ",
      "doi": "10.1145/2642918.2647405"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. Midas: Fabricating Custom Capacitive Touch Sensors to Prototype Interactive Objects. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Michael Shorter, Jon Rogers, and John McGhee. Enhancing Everyday Paper Interactions with Paper Circuits. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 39--42.  ",
      "doi": "10.1145/2598510.2598584"
    },
    {
      "text": "Ju-Hee So and Michael D Dickey. 2011. Inherently aligned microfluidic electrodes composed of liquid metal. Lab on a Chip 11, 5 (2011), 905--911.",
      "doi": ""
    },
    {
      "text": "Ju-Hee So, Jacob Thelen, Amit Qusba, Gerard J Hayes, Gianluca Lazzi, and Michael D Dickey. 2009. Reversibly deformable and mechanically tunable fluidic antennas. Advanced Functional Materials 19, 22 (2009), 3632--3637.",
      "doi": ""
    },
    {
      "text": "Tung D. Ta, Fuminori Okuya, and Yoshihiro Kawahara. LightTrace: Auto-router for Designing LED Based Applications with Conductive Inkjet Printing. In Proceedings of the 1st Annual ACM Symposium on Computational Fabrication (SCF '17). ACM, New York, NY, USA, Article 3, 10 pages.  ",
      "doi": "10.1145/3083157.3083160"
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2991--3000.  ",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jürgen Steimle. SkinMarks: Enabling Interactions on Body Landmarks Using Conformal Skin Electronics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3095--3105.  ",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Michael Wessely, Theophanis Tsandilas, and Wendy E. Mackay. Stretchis: Fabricating Highly Stretchable User Interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 697--704.  ",
      "doi": "10.1145/2984511.2984521"
    }
  ]
}