{
  "doi": "10.1145/3173574.3173848",
  "title": "Design Vocabulary for Human--IoT Systems Communication",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Digital devices and intelligent systems are becoming popular and ubiquitous all around us. However, they seldom provide sufficient feed-forwards and feedbacks to reassure users as to their current status and indicate what actions they are about to perform. In this study, we selected and analyzed nine concept videos on future IoT products/systems. Through systematic analysis of the interactions and communications of users with the machines and systems demonstrated in the films, we extracted 38 design vocabulary items and clustered them into 12 groups: Active, Request, Trigger functions, Approve, Reject, Notify, Recommend, Guide, Show problems, Express emotions, Exchange info, and Socialize. This framework can not only inspire designers to create self-explanatory intelligence, but also support developers to provide a language structure at different levels of the periphery of human attention. Through the enhancement of situated awareness, human IoT system interaction can become more seamless and graceful.",
  "tags": [
    "intelligibility",
    "feedback",
    "understanding",
    "internet of things",
    "vocabulary"
  ],
  "authors": [
    {
      "name": "Yaliang Chuang",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-99659178340/rel-imgonly/yaliang_ntu_2019.jpg",
      "acmid": "99659178340",
      "orcid": "missing"
    },
    {
      "name": "Lin-Lin Chen",
      "institution": "Eindhoven University of Technology and National Taiwan University of Science & Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706963",
      "orcid": "missing"
    },
    {
      "name": "Yoga Liu",
      "institution": "NTU IoX Center, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659178651",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gregory D. Abowd and Elizabeth D. Mynatt. 2000. Charting past, present, and future research in ubiquitous computing. ACM Trans. Comput.-Hum. Interact. 7, 1, 29--58.  ",
      "doi": "10.1145/344949.344988"
    },
    {
      "text": "Amazon. (n.d.). Echo help: About the light ring. Retrieved Feb. 2, 2017, from https://www.amazon.com/gp/help/customer/display.ht ml?nodeId=201601790",
      "doi": ""
    },
    {
      "text": "Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2014. From 'smart objects' to 'social objects': The next evolutionary step of the Internet of Things. IEEE Communication Magazine, Networks, vol. 52, no. 1, 2014, 97--105.",
      "doi": ""
    },
    {
      "text": "Saskia Bakker and Karin Niemantsverdriet. 2016. The interaction-attention continuum: Considering various levels of human attention in interaction design. International Journal of Design, 10(2), 1--14.",
      "doi": ""
    },
    {
      "text": "Michael Beigl, Hans-W. Gellersen, and Albrecht Schmidt. 2001. MediaCups: Experience with design and use of computer-augmented everyday objects. Computer Networks, 35(4), 2001, 401--409.  ",
      "doi": "10.1016/S1389-1286%2800%2900180-8"
    },
    {
      "text": "A. J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home automation in the wild: Challenges and opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2115--2124.  ",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Cambridge Dictionary. n.d. http://dictionary.cambridge.org/ Last access date: 16 January 2016",
      "doi": ""
    },
    {
      "text": "Nazli Cila, Iskander Smit, Elisa Giaccardi, and Ben Kröse. 2017. Products as agents: Metaphors for designing the products of the IoT age. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 448--459.  ",
      "doi": "10.1145/3025453.3025797"
    },
    {
      "text": "Corning. 2012. A day made of glass 2. Retrieved Sept. 15, 2017, from https://youtu.be/jZkHpNnXLB0",
      "doi": ""
    },
    {
      "text": "Marco de Sá, Judd Antin, David Shamma, and Elizabeth F. Churchill. 2011. Mobile augmented reality: video prototyping. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 18971902.",
      "doi": ""
    },
    {
      "text": "Eva Deckers, Stephan Wensveen, Pierre Levy, and Rene Ahn. 2013. Designing for perceptual crossing: Designing and comparing three behaviors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1901--1910.  ",
      "doi": "10.1145/2470654.2466251"
    },
    {
      "text": "W. Keith Edwards and Rebecca E. Grinter. 2001. At home with ubiquitous computing: Seven challenges. In Proceedings of the 3rd international conference on Ubiquitous Computing (UbiComp '01), Gregory D. Abowd, Barry Brumitt, and Steven A. Shafer (Eds.). Springer-Verlag, London, UK, 256--272. ",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Jodi Forlizzi. 2007. How robotic products become social products: An ethnographic study of cleaning in the home. In Proceedings of the ACM/IEEE international conference on Human-robot interaction (HRI '07). ACM, New York, NY, USA, 129--136.  ",
      "doi": "10.1145/1228716.1228734"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 2002. A descriptive framework of workspace awareness for real-time groupware. Comput. Support Coop. Work, 11(3--4), 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Chris Harrison, John Horstman, Gary Hsieh, and Scott Hudson. 2012. Unlocking the expressivity of point lights. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1683--1692.  ",
      "doi": "10.1145/2207676.2208296"
    },
    {
      "text": "Gartner Research. (n.d.) http://www.gartner.com/itglossary/internet-of-things/",
      "doi": ""
    },
    {
      "text": "Google. (n.d.). Google Home LED lights. Retrieved Feb. 2, 2017, from https://support.google.com/googlehome/answer/7073 219?hl=en",
      "doi": ""
    },
    {
      "text": "Philip Hayes and Reddy Raj D. 1983. Steps toward graceful interaction in spoken and written man machine communication. International Journal of Man-Machine Studies 19: 231--284, 1983.",
      "doi": ""
    },
    {
      "text": "Amy Hwang and Jesse Hoey. 2012. Smart home, the next generation: Closing the gap between users and technology. In AAAI Fall Symposium at Arlington, Virginia, USA. 14--21.",
      "doi": ""
    },
    {
      "text": "Patrik Jonell and Pedro Lopes. 2015. Affordance++: The tale of animating IoT objects. XRDS 22, 2, 20--21.  ",
      "doi": "10.1145/2849487"
    },
    {
      "text": "Youn-kyung Lim, Sang-Su Lee, and Da-jung Kim. (2011). Interactivity attributes for expression-oriented interaction design. International Journal of Design, 5(3), 113--128.",
      "doi": ""
    },
    {
      "text": "Teodor Mitew. 2014. Do objects dream of an internet of things? The Fibreculture Journal, 23, 1--25.",
      "doi": ""
    },
    {
      "text": "Simone Rebaudengo, n.d. Addicted products: The story of Brad the Toaster. Video. Retrieved Sept. 15, 2017, from https://vimeo.com/41363473",
      "doi": ""
    },
    {
      "text": "Sarah Mennicken and Elaine M. Huang. 2012. Hacking the natural habitat: an in-the-wild study of smart homes, their development, and the people who live in them. In Pervasive Computing. Pervasive 2012. Lecture Notes in Computer Science, vol 7319, Judy Kay, Paul Lukowicz, Hideyuki Tokuda, Patrick Olivier, and Antonio Krüger (Eds.). Springer-Verlag, Berlin/Heidelberg, Germany, 143--160.  ",
      "doi": "10.1007/978-3-642-31205-2_10"
    },
    {
      "text": "Sarah Mennicken, Jo Vermeulen, and Elaine M. Huang. 2014. From today's augmented houses to tomorrow's smart homes: new directions for home automation research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 105--115.  ",
      "doi": "10.1145/2632048.2636076"
    },
    {
      "text": "Microsoft. 2013. Microsoft's Concept - Future vision 2020. Video. Retrieved Sept. 15, 2017, from https://www.youtube.com/watch?v=ozLaklIFWUI",
      "doi": ""
    },
    {
      "text": "Microsoft. (n.d.) Productivity future vision. Retrieved Sept. 15, 2017, from https://www.youtube.com/watch?v=w-tFdreZB94",
      "doi": ""
    },
    {
      "text": "MIT House_n Research Group. (n.d.) The PlaceLab. http://web.mit.edu/cron/group/house_n/placelab.html",
      "doi": ""
    },
    {
      "text": "Ulric Neisser. 1978. Perceiving, anticipating, and imagining. Minnesota Stud. Philos. Sci. 9, 89--106.",
      "doi": ""
    },
    {
      "text": "Anton Nijholt. 2004. Where computers disappear, virtual humans appear. Computers & Graphics, 28, 4 (2004), 467--476.",
      "doi": ""
    },
    {
      "text": "Don Norman. 1992. Turn signals are the facial expressions of automobiles. Basic Books.",
      "doi": ""
    },
    {
      "text": "Don Norman. 2007. The design of future things. Basic Books.",
      "doi": ""
    },
    {
      "text": "Alice V. Pintus. 2010. Tangible lightscapes. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (TEI '10). ACM, New York, NY, USA, 379--380.  ",
      "doi": "10.1145/1709886.1709988"
    },
    {
      "text": "Michael Schmitz, Christoph Endres, and Andreas Butz. 2008. A survey of human-computer interaction design in science fiction movies. In Proceedings of the 2nd international conference on INtelligent TEchnologies for interactive enterTAINment (INTETAIN '08). ICST, Brussels, Belgium, Article 7, 10 pages. ",
      "doi": "10.5555/1363200.1363210"
    },
    {
      "text": "Bruce Sterling, 2005. Shaping things. MIT Press.",
      "doi": ""
    },
    {
      "text": "Lucy A. Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge University Press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Harald Sundmaeker, Partick Guillemin, Peter Friess, and Sylvie Woelffle. 2010. Vision and challenges for realizing the Internet of Things. Publications Office of the European Union.",
      "doi": ""
    },
    {
      "text": "L. Takayama, C. Pantofaru, D. Robson, B. Soto, and M. Barry. 2012. Making technology homey: Finding sources of satisfaction and meaning in home automation. In Proc. Ubicomp 2012. 511--520.  ",
      "doi": "10.1145/2370216.2370292"
    },
    {
      "text": "Claude Elwood Shannon & Warren Weaver. 1949. The mathematical theory of communication. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Deborah Tatar. 1989. Using video-based observation to shape the design of a new technology. SIGCHI Bull. 21, 2 (October 1989), 108--111.  ",
      "doi": "10.1145/70609.70628"
    },
    {
      "text": "Sara Tena, Paloma Díaz, David Díez, and Ignacio Aedo. 2012. Bridging the communication gap: A user task vocabulary for multidisciplinary web development team. In Proceedings of the 13th International Conference on Interacción PersonaOrdenador (INTERACCION '12). ACM, New York, NY, USA, Article 27, 7 pages.  ",
      "doi": "10.1145/2379636.2379662"
    },
    {
      "text": "Serge Rijsdijk & Erik Hultink. 2009. How today's consumers perceive tomorrow's smart products. Journal of Product Innovation Management, 26, 24 42.",
      "doi": ""
    },
    {
      "text": "Axel Roesler, Barbara Holder, Dan Ostrowski, Nate Landes, Stephen Minarsch, Daniya Ulgen, Erin Murphy, and Haeree Park. 2017. Video prototyping for interaction design across multiple displays in the commercial flight deck. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 271--283.  ",
      "doi": "10.1145/3064663.3064800"
    },
    {
      "text": "Brian L. Thomas and Diane J. Cook. 2014. CARL: Activity-aware automation for energy efficiency. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, New York, NY, USA, 939--946.  ",
      "doi": "10.1145/2638728.2641554"
    },
    {
      "text": "Bruce Tognazzini. 1994. The \"Starfire\" video prototype project: A case history. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94), Beth Adelson, Susan Dumais, and Judith Olson (Eds.), 99--105.  ",
      "doi": "10.1145/191666.191712"
    },
    {
      "text": "Vocabulary Dictionary. https://www.vocabulary.com/dictionary/ Last access date: 16 January 2016",
      "doi": ""
    },
    {
      "text": "Rayoung Yang and Mark W. Newman. 2013. Learning from a learning thermostat: lessons for intelligent systems for the home. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/2493432.2493489"
    },
    {
      "text": "Ron Wakkary, Doenja Oogjes, Sabrina Hauser, Henry Lin, Cheng Cao, Leo Ma, and Tijs Duel. 2017. Morse Things: A Design Inquiry into the Gap Between Things and Us. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 503--514.  ",
      "doi": "10.1145/3064663.3064734"
    },
    {
      "text": "Roy Want, Kenneth P. Fishkin, Anuj Gujar, and Beverly L. Harrison. 1999. Bridging physical and virtual worlds with electronic tags. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 370--377.  ",
      "doi": "10.1145/302979.303111"
    },
    {
      "text": "Mark Weiser. 1991. The computer for the 21st century. Scientific American, 265(3), 94--104.",
      "doi": ""
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User experience in do-it-yourself-style smart homes. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 779790.  ",
      "doi": "10.1145/2750858.2806063"
    }
  ]
}