{
  "doi": "10.1145/3173574.3174030",
  "title": "“It's not actually that horrible”: Exploring Adoption of Two-Factor Authentication at a University",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Despite the additional protection it affords, two-factor authentication (2FA) adoption reportedly remains low. To better understand 2FA adoption and its barriers, we observed the deployment of a 2FA system at Carnegie Mellon University (CMU). We explore user behaviors and opinions around adoption, surrounding a mandatory adoption deadline. Our results show that (a) 2FA adopters found it annoying, but fairly easy to use, and believed it made their accounts more secure; (b) experience with CMU Duo often led to positive perceptions, sometimes translating into 2FA adoption for other accounts; and, (c) the differences between users required to adopt 2FA and those who adopted voluntarily are smaller than expected. We also explore the relationship between different usage patterns and perceived usability, and identify user misconceptions, insecure practices, and design issues. We conclude with recommendations for large-scale 2FA deployments to maximize adoption, focusing on implementation design, use of adoption mandates, and strategic messaging.",
  "tags": [
    "adoption",
    "two-factor authentication",
    "usability"
  ],
  "authors": [
    {
      "name": "Jessica Colnago",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658691563",
      "orcid": "missing"
    },
    {
      "name": "Summer Devlin",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260595",
      "orcid": "missing"
    },
    {
      "name": "Maggie Oates",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99659261515/rel-imgonly/me-maggie-headshot-lowres.jpg",
      "acmid": "99659261515",
      "orcid": "missing"
    },
    {
      "name": "Chelse Swoopes",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261489",
      "orcid": "missing"
    },
    {
      "name": "Lujo Bauer",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350570444/rel-imgonly/lujo-5.jpg",
      "acmid": "81350570444",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Nicolas Christin",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100131105",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Preston Ackerman. 2014. Impediments to adoption of two-factor authentication by home end-users. Technical Report. SANS Institute. goo.gl/ZhTQdU",
      "doi": ""
    },
    {
      "text": "Yusuf Albayram, Mohammad Maifi Hasan Khan, and Michael Fagan. 2017. A study on designing video tutorials for promoting security features: A case study in the context of two-factor authentication (2FA). International Journal of Human-Computer Interaction 33, 11 (2017).",
      "doi": ""
    },
    {
      "text": "Maha M. Althobaiti and Pam Mayhew. 2014. Security and usability of authenticating process of online banking: User experience study. In International Carnahan Conference on Security Technology (ICCST). IEEE.",
      "doi": ""
    },
    {
      "text": "Ann Bednarz. 2015. After breaches, higher-ed schools adopt two-factor authentication. NetworkWorld. (June 2015). goo.gl/C3MyqE Accessed Sept, 2017.",
      "doi": ""
    },
    {
      "text": "Joseph Bonneau, Cormac Herley, Paul C. van Oorschot, and Frank Stajano. 2012. The quest to replace passwords: A framework for comparative evaluation of Web authentication schemes. In IEEE Symposium on Security and Privacy. IEEE.  ",
      "doi": "10.1109/SP.2012.44"
    },
    {
      "text": "Emiliano de Cristofaro, Honglu Du, Julien Freudiger, and Greg Norcie. 2014. A comparative usability study of two-factor authentication. In Network and Distributed Systems Security Symposium. Internet Society.",
      "doi": ""
    },
    {
      "text": "Alexei Czeskis, Michael Dietz, Tadayoshi Kohno, Dan Wallach, and Dirk Balfanz. 2012. Strengthening user authentication through opportunistic cryptographic identity assertions. In ACM conference on computer and communications security (CCS). ACM.  ",
      "doi": "10.1145/2382196.2382240"
    },
    {
      "text": "Fred D. Davis. 1989. Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Quarterly 13, 3 (1989).  ",
      "doi": "10.2307/249008"
    },
    {
      "text": "Alexander J. DeWitt and Jasna Kuljis. 2006. Aligning usability and security: a usability study of Polaris. In Symposium on Usable Security and Privacy. ACM.  ",
      "doi": "10.1145/1143120.1143122"
    },
    {
      "text": "Duo. 2017. Secure two-factor authentication app. (2017). duo.com Accessed Sept, 2017.",
      "doi": ""
    },
    {
      "text": "Simson Garfinkel and Heather Richter Lipford. 2014. Usable Security: History, Themes, and Challenges. Morgan & Claypool. ",
      "doi": "10.5555/2755205"
    },
    {
      "text": "Paul A. Grassie, Michael E. Garcia, and James L. Fenton. 2017. Digital identity guidelines. Technical Report. NIST Special Publication 800--63--3.",
      "doi": ""
    },
    {
      "text": "Nancie Gunson, Diarmid Marshall, Hazel Morton, and Mervyn Jack. 2011. User perceptions of security and usability of single-factor and two-factor authentication in automated telephone banking. Computers and Security 30, 4 (2011).  ",
      "doi": "10.1016/j.cose.2010.12.001"
    },
    {
      "text": "Patrick Heim. 2016. An inside look at how we keep customer data safe. Dropbox. (Feb 2016). goo.gl/K6HFqV Accessed Sept, 2017.",
      "doi": ""
    },
    {
      "text": "Martin C. Libicki, Edward Balkovich, Brian A. Jackson, Rena Rudavsky, and Katharine Watkins Webb. 2011. Influences on the adoption of multifactor authentication. Technical Report. RAND Corporation. goo.gl/cXLTpz",
      "doi": ""
    },
    {
      "text": "Ziqing Mao, Dinei Florêncio, and Cormac Herley. 2011. Painless migration from passwords to two factor authentication. In IEEE International Workshop on Information Forensics and Security. IEEE.  ",
      "doi": "10.1109/WIFS.2011.6123150"
    },
    {
      "text": "David McCandless. 2016. World's biggest data breaches. informationisbeautiful.net. (2016). goo.gl/4w2K3A Accessed Oct, 2016.",
      "doi": ""
    },
    {
      "text": "University of Utah Information Technology. 2016. 2FA: Two-factor authentication required 12/28/16. (December 2016). goo.gl/wu3oQa Accessed Sept, 2017.",
      "doi": ""
    },
    {
      "text": "Karen O'Hara. 2015. Two-factor authentication is a must for all employees. Miami University. (January 2015). goo.gl/1dnVhp Accessed Sept, 2017.",
      "doi": ""
    },
    {
      "text": "Celeste Lyn Paul, Emile Morse, Aiping Zhang, Yee-Yin Choong, and Mary Theofanos. 2011. A field study of user behavior and perceptions in smartcard authentication. Human-Computer Interaction-INTERACT 2011, Lecture Notes in Computer Science 6949 (2011). ",
      "doi": "10.5555/2042283.2042285"
    },
    {
      "text": "E. Eugene Schultz, Robert W. Proctor, Mei Ching Lien, and Gavriel Salvendy. 2001. Usability and security: An appraisal of usability issues in information security methods. Computers and Security 20, 7 (2001).  ",
      "doi": "10.1016/S0167-4048%2801%2900712-X"
    },
    {
      "text": "Nishit Shah. 2011. Advanced sign-in security for your Google account. Google Blog. (2011). goo.gl/KmVv7y Accessed Oct, 2016.",
      "doi": ""
    },
    {
      "text": "Iain Thomson. 2018. Who's using 2FA? Sweet FA. Less than 10% of Gmail users enable two-factor authentication. The Register. (2018). goo.gl/HzwQR3 Accessed Jan, 2017.",
      "doi": ""
    },
    {
      "text": "Carnegie Mellon University. 2016. Two-factor authentication (2fa) with Duo now available. (December 2016). goo.gl/mhTt7x Accessed Sept, 2017.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Fumiko Noma, Jonathan Bees, Sean M Segreti, Richard Shay, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2015. \"I added '!' at the end to make it secure\": Observing password creation in the lab. In Symposium On Usable Privacy and Security. USENIX.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh and Hillol Bala. 2008. Technology Acceptance Model 3 and a Research Agenda on Interventions. Decision Sciences 39, 2 (2008).",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh, Michael Morris, Gordon Davis, and Fred Davis. 2003. User acceptance of information technology: Toward a unified view. MIS Quarterly 27, 3 (2003). ",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Ding Wang, Qianchen Gu, Haibo Cheng, and Ping Wang. 2016. The request for better measurement: A comparative evaluation of two-factor authentication schemes. In ACM on Asia conference on computer and communications security (ASIA CCS '16). ACM.  ",
      "doi": "10.1145/2897845.2897916"
    },
    {
      "text": "Jake Weidman and Jens Grossklags. 2017. I Like It, but I Hate It: Employee Perceptions Towards an Institutional Transition to BYOD Second-Factor Authentication. In Proceedings of the 33rd Annual Computer Security Applications Conference (ACSAC 2017). ACM.  ",
      "doi": "10.1145/3134600.3134629"
    },
    {
      "text": "Catherine S. Weir, Gary Douglas, Martin Carruthers, and Mervyn Jack. 2009. User perceptions of security, convenience and usability for ebanking authentication tokens. Computers and Security 28, 1--2 (2009).  ",
      "doi": "10.1016/j.cose.2008.09.008"
    }
  ]
}