{
  "doi": "10.1145/3173574.3173625",
  "title": "My Telepresence, My Culture?: An Intercultural Investigation of Telepresence Robot Operators' Interpersonal Distance Behaviors",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Interpersonal distance behaviors can vary significantly across countries and impact human social interaction. Do these cross-cultural differences play out when one of the interaction partners participates through a teleoperated robot? Emerging research shows that when being approached by a robot, people tend to hold similar cultural preferences as they would for an approaching human. However, no work yet has investigated this question from a robot teleoperator's perspective. Toward answering this, we conducted an online study (N = 774) using a novel simulation paradigm across two countries (U.S. and India). Results show that in the role of a telepresence robot operator, participants exhibited cross-cultural differences in interpersonal distance behavior in line with human-human proxemic research, indicating that culture-specific distance behavior can manifest in the way a robot operator controls a robot. We discuss implications for designers who seek to automate path planning and navigation for teleoperated robots.",
  "tags": [
    "robotic telepresence systems",
    "interpersonal distance",
    "cross-cultural",
    "telepresence robots",
    "robot-mediated communication",
    "proxemics",
    "human-robot interaction"
  ],
  "authors": [
    {
      "name": "Solace Shen",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456605597",
      "orcid": "missing"
    },
    {
      "name": "Hamish Tennent",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658994078",
      "orcid": "missing"
    },
    {
      "name": "Houston Claure",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261739",
      "orcid": "missing"
    },
    {
      "name": "Malte Jung",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758949457",
      "orcid": "0000-0001-9359-7122"
    }
  ],
  "references": [
    {
      "text": "Raji Ridwan Adetunji and Koh Phei Sze. 2012. Understanding Non-Verbal Communication across Cultures: A Symbolic Interactionism Approach. (2012).",
      "doi": ""
    },
    {
      "text": "Herman Aguinis, Melissa M Simonsen, and Charles A Pierce. 1998. Effects of nonverbal behavior on perceptions of power bases. The Journal of social psychology 138, 4 (1998), 455--469.",
      "doi": ""
    },
    {
      "text": "John R Aiello and Donna E Thompson. 1980. Personal space, crowding, and spatial behavior in a cultural context. In Environment and culture. Springer, 107--178.",
      "doi": ""
    },
    {
      "text": "Sjriek Alers, Daan Bloembergen, Maximilian Bügler, Daniel Hennes, and Karl Tuyls. 2012. MITRO : an augmented mobile telepresence robot with assisted control ( Demonstration ). Proceedings of the 11th International Conference on Autonomous Agents and Multiagent Systems (2012), 1475--1476. ",
      "doi": "10.5555/2343896.2344068"
    },
    {
      "text": "Peter Andersen. 1988. Explaining intercultural differences in nonverbal communication. Intercultural communication: A reader (1988), 272--281.",
      "doi": ""
    },
    {
      "text": "Peter A Andersen, Myron W Lustig, and Janis F Andersen. 1990. Changes in latitude, changes in attitude: The relationship between climate and interpersonal communication predispositions. Communication Quarterly 38, 4 (1990), 291--311.",
      "doi": ""
    },
    {
      "text": "Michael Argyle and Janet Dean. 1965. Eye-contact, distance and affiliation. Sociometry (1965), 289--304.",
      "doi": ""
    },
    {
      "text": "Matt Beane and Wanda J Orlikowski. 2015. What difference does a robot make? The material enactment of distributed coordination. Organization Science 26, 6 (2015), 1553--1573.",
      "doi": "10.1287/orsc.2015.1004"
    },
    {
      "text": "Tara S Behrend, David J Sharek, Adam W Meade, and Eric N Wiebe. 2011. The viability of crowdsourcing for survey research. Behavior research methods 43, 3 (2011), 800.",
      "doi": ""
    },
    {
      "text": "Charles R Berger. 1994. Power, dominance, and social interaction. Handbook of interpersonal communication 2 (1994), 450--507.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal. 2003. Toward sociable robots. Robotics and autonomous systems 42, 3 (2003), 167--175.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal, Cory D Kidd, Andrea Lockerd Thomaz, Guy Hoffman, and Matt Berlin. 2005. Effects of nonverbal communication on efficiency and robustness in human-robot teamwork. In Intelligent Robots and Systems, 2005.(IROS 2005). 2005 IEEE/RSJ International Conference on. IEEE, 708--713.",
      "doi": ""
    },
    {
      "text": "Judee K Burgoon and Norah E Dunbar. 2000. An interactionist perspective on dominance-submission: Interpersonal dominance as a dynamic, situationally contingent social skill. Communications Monographs 67, 1 (2000), 96--121.",
      "doi": ""
    },
    {
      "text": "Judee K Burgoon, Laura K Guerrero, and Kory Floyd. 2016. Nonverbal communication. Routledge.",
      "doi": ""
    },
    {
      "text": "Judee K Burgoon, Laura K Guerrero, and Valerie Manusov. 2011. Nonverbal signals. The SAGE handbook of interpersonal communication. London: SAGE (2011).",
      "doi": ""
    },
    {
      "text": "Judee K Burgoon and Stephen B Jones. 1976. Toward a theory of personal space expectations and their violations. Human Communication Research 2, 2 (1976), 131--146.",
      "doi": ""
    },
    {
      "text": "Gesa Busch, Daniel M Weary, Achim Spiller, and Marina AG von Keyserlingk. 2017. American and German attitudes towards cow-calf separation on dairy farms. PloS one 12, 3 (2017), e0174013.",
      "doi": ""
    },
    {
      "text": "Kuan-Ta Chen, Chen-Chi Wu, Yu-Chun Chang, and Chin-Laung Lei. 2009. A crowdsourceable QoE evaluation framework for multimedia content. In Proceedings of the 17th ACM international conference on Multimedia. ACM, 491--500.  ",
      "doi": "10.1145/1631272.1631339"
    },
    {
      "text": "Mina Choi, Rachel Kornfield, Leila Takayama, and Bilge Mutlu. 2017. Movement Matters: Effects of Motion and Mimicry on Perception of Similarity and Closeness in Robot-Mediated Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 325--335.  ",
      "doi": "10.1145/3025453.3025734"
    },
    {
      "text": "Rebecca J Cline and Carol A Puhl. 1984. Gender, culture, and geography: A comparison of seating arrangements in the United States and Taiwan. International Journal of Intercultural Relations 8, 2 (1984), 199--219.",
      "doi": ""
    },
    {
      "text": "Ghadeer Eresha, Markus Häring, Birgit Endrass, Elisabeth André, and Mohammad Obaid. 2013. Investigating the influence of culture on proxemic behaviors for humanoid robots. In RO-MAN, 2013 IEEE. IEEE, 430--435.",
      "doi": ""
    },
    {
      "text": "Gary W Evans, Stephen J Lepore, and Karen Mata Allen. 2000. Cross-cultural differences in tolerance for crowding: fact or fiction? Journal of personality and social psychology 79, 2 (2000), 204.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi. 2007. How robotic products become social products: an ethnographic study of cleaning in the home. In Proceedings of the ACM/IEEE international conference on Human-robot interaction. ACM, 129--136.  ",
      "doi": "10.1145/1228716.1228734"
    },
    {
      "text": "Jodi Forlizzi and Carl DiSalvo. 2006. Service robots in the domestic environment: a study of the roomba vacuum in the home. In Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-robot interaction. ACM, 258--265.  ",
      "doi": "10.1145/1121241.1121286"
    },
    {
      "text": "Ge Gao, Sun Young Hwang, Gabriel Culbertson, Sue Fussell,, and Malte F Jung. In Press. Beyond Information Content: The Effects of Culture On Affective Grounding in Instant Messaging Conversations. In CSCW.",
      "doi": ""
    },
    {
      "text": "William B Gudykunst. 2003. Cross-cultural and intercultural communication. Sage.",
      "doi": ""
    },
    {
      "text": "Edward Twitchell Hall. 1966. The hidden dimension. (1966).",
      "doi": ""
    },
    {
      "text": "Judith A Hall, Erik J Coats, and Lavonia Smith LeBeau. 2005. Nonverbal behavior and the vertical dimension of social relations: a meta-analysis. (2005).",
      "doi": ""
    },
    {
      "text": "Judith A Hall and Gregory B Friedman. 1999. Status, gender, and nonverbal behavior: A study of structured interactions between employees of a company. Personality and Social Psychology Bulletin 25, 9 (1999), 1082--1091.",
      "doi": ""
    },
    {
      "text": "Judee K Heston. 1974. Effects of personal space invasion and anomia on anxiety, nonperson orientation and source credibility. Communication Studies 25, 1 (1974), 19--27.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 1983. The cultural relativity of organizational practices and theories. Journal of international business studies 14, 2 (1983), 75--89.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede, Gert Jan Hofstede, and Michael Minkov. 2010. Cultures et organisations: Nos programmations mentales. Pearson Education France.",
      "doi": ""
    },
    {
      "text": "Rob W Holland, Ute-Regina Roeder, Baaren Rick B. van, Aafje C Brandt, and Bettina Hannover. 2004. Don't stand so close to me: The effects of self-construal on interpersonal closeness. Psychological science 15, 4 (2004), 237--242.",
      "doi": ""
    },
    {
      "text": "Veronica Diaz-Peralta Horenstein and Jerrold L Downey. 2003. A Cross-Cultural Investigation of Self-Disclosure. North American Journal of Psychology 5, 3 (2003).",
      "doi": ""
    },
    {
      "text": "Helge Hüttenrauch, Kerstin Severinson Eklundh, Anders Green, and Elin A Topp. 2006. Investigating spatial relationships in human-robot interaction. In Intelligent Robots and Systems, 2006 IEEE/RSJ International Conference on. IEEE, 5052--5059.",
      "doi": ""
    },
    {
      "text": "Michiel P Joosse, Ronald W Poppe, Manja Lohse, and Vanessa Evers. 2014. Cultural differences in how an engagement-seeking robot should approach a group of people. In Proceedings of the 5th ACM international conference on Collaboration across boundaries: culture, distance & technology. ACM, 121--130.  ",
      "doi": "10.1145/2631488.2631499"
    },
    {
      "text": "Timothy A Judge and Daniel M Cable. 2004. The effect of physical height on workplace success and income: preliminary test of a theoretical model. (2004).",
      "doi": ""
    },
    {
      "text": "Neha Khandpur, Dan J Graham, and Christina A Roberto. 2017. Simplifying mental math: Changing how added sugars are displayed on the nutrition facts label can improve consumer understanding. Appetite 114 (2017), 38--46.",
      "doi": ""
    },
    {
      "text": "Hideaki Kuzuoka, Yuya Suzuki, and Jun Yamashita. 2010. Reconfiguring Spatial Formation Arrangement by Robot Body Orientation. Proceedings of the 5th (2010), 285--292. ",
      "doi": "10.5555/1734454.1734557"
    },
    {
      "text": "Dale G Leathers and Michael Eaves. 2015. Successful nonverbal communication: Principles and applications. Routledge.",
      "doi": ""
    },
    {
      "text": "Fred Luthans and Jonathan P Doh. 2009. International management: Culture, strategy, and behavior. McGraw-Hill Irwin New York, NY.",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazonâ A´ Zs Mechanical Turk. Behavior research methods 44, 1 (2012), 1--23.",
      "doi": ""
    },
    {
      "text": "Ross Mead and Maja J. Mataric. 2016. Robots Have Needs Too: People Adapt Their Proxemic Preferences to Improve Autonomous Robot Recognition of Human Social Signals. Human-Robot Interaction 5, 2 (2016), 48--68.  ",
      "doi": "10.5898/JHRI.5.2.Mead"
    },
    {
      "text": "Andrew Molinsky. 2007. Cross-cultural code-switching: The psychological challenges of adapting behavior in foreign cultural interactions. Academy of Management Review 32, 2 (2007), 622--640.",
      "doi": ""
    },
    {
      "text": "Jonathan Mumm and Bilge Mutlu. 2011. Human-robot proxemics: physical and psychological distancing in human-robot interaction. In Proceedings of the 6th international conference on Human-robot interaction. ACM, 331--338.  ",
      "doi": "10.1145/1957656.1957786"
    },
    {
      "text": "Carman Neustaedter, Gina Venolia, Jason Procyk, and Daniel Hawkins. 2016. To Beam or not to Beam: A study of remote telepresence attendance at an academic conference. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 418--431.  ",
      "doi": "10.1145/2818048.2819922"
    },
    {
      "text": "Aydin Ozdemir. 2008. Shopping malls: Measuring interpersonal distance under changing conditions and across cultures. Field Methods 20, 3 (2008), 226--248.",
      "doi": ""
    },
    {
      "text": "W.C.a Pang, G.b Seet, and X.b Yao. 2013. A multimodal person-following system for telepresence applications. Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST (2013), 157--164.  ",
      "doi": "10.1145/2503713.2503722"
    },
    {
      "text": "Irene Rae, Leila Takayama, and Bilge Mutlu. 2013. The influence of height in robot-mediated communication. In Proceedings of the 8th ACM/IEEE international conference on Human-robot interaction. IEEE Press, 1--8. ",
      "doi": "10.5555/2447556.2447558"
    },
    {
      "text": "PL Patrick Rau, Ye Li, and Dingjun Li. 2009. Effects of communication style and culture on ability to accept recommendations from robots. Computers in Human Behavior 25, 2 (2009), 587--595.  ",
      "doi": "10.1016/j.chb.2008.12.025"
    },
    {
      "text": "Martin S Remland. 2016. Nonverbal communication in everyday life. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Debra L Roter, Richard M Frankel, Judith A Hall, and David Sluyter. 2006. The expression of emotion through nonverbal behavior in medical visits. Journal of general internal medicine 21, S1 (2006).",
      "doi": ""
    },
    {
      "text": "Aziez Sardar, Michiel Joosse, Astrid Weiss, and Vanessa Evers. 2012. Don't stand so close to me: users' attitudinal and behavioral responses to personal space invasion by robots. In Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction. ACM, 229--230.  ",
      "doi": "10.1145/2157689.2157769"
    },
    {
      "text": "Robert Shuter. 1977. A field study of nonverbal communication in Germany, Italy, and the United States. Communications Monographs 44, 4 (1977), 298--305.",
      "doi": ""
    },
    {
      "text": "Theodore M Singelis. 1994. The measurement of independent and interdependent self-construals. Personality and social psychology bulletin 20, 5 (1994), 580--591.",
      "doi": ""
    },
    {
      "text": "David Sirkin and Wendy Ju. 2012. Consistency in physical and on-screen action improves perceptions of telepresence robots. In Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction. ACM, 57--64.  ",
      "doi": "10.1145/2157689.2157699"
    },
    {
      "text": "Agnieszka Sorokowska, Piotr Sorokowski, Peter Hilpert, Katarzyna Cantarero, Tomasz Frackowiak, Khodabakhsh Ahmadi, Ahmad M Alghraibeh, Richmond Aryeetey, Anna Bertoni, Karim Bettache, and others. 2017. Preferred Interpersonal Distances: A Global Comparison. Journal of Cross-Cultural Psychology 48, 4 (2017), 577--592.",
      "doi": ""
    },
    {
      "text": "Helen Spencer-Oatey. 2004. Culturally speaking: Managing rapport through talk across cultures. A&C Black.",
      "doi": ""
    },
    {
      "text": "Abraham Stahl. 1994. The Fourfold Gap: preparing teachers for educating the culturally different. European journal of teacher education 17, 3 (1994), 241--251.",
      "doi": ""
    },
    {
      "text": "Nan M Sussman and Howard M Rosenfeld. 1982. Influence of culture, language, and sex on conversational distance. Journal of Personality and Social Psychology 42, 1 (1982), 66.",
      "doi": ""
    },
    {
      "text": "Ann Swidler. 1986. Culture in action: Symbols and strategies. American sociological review (1986), 273--286.",
      "doi": ""
    },
    {
      "text": "Leila Takayama and Janet Go. 2012. Mixing metaphors in mobile remote presence. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 495--504.  ",
      "doi": "10.1145/2145204.2145281"
    },
    {
      "text": "David Trafimow, Harry C Triandis, and Sharon G Goto. 1991. Some tests of the distinction between the private self and the collective self. Journal of personality and social psychology 60, 5 (1991), 649.",
      "doi": ""
    },
    {
      "text": "T van Oosterhout and A Visser. 2008. A visual method for robot proxemics measurements. Proceedings of Metrics for Human-Robot Interaction: A workshop at the Third ACM/IEEE International Conference on Human-Robot Interaction (HRI08) (2008), 61--68. http://dare.uva.nl/record/286164",
      "doi": ""
    },
    {
      "text": "Jered Vroon. 2017. Responsive Social Positioning Behaviors for Semi-Autonomous Telepresence Robots. Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction HRI '17 March 6--9 (2017), 383--384.  ",
      "doi": "10.1145/3029798.3034821"
    },
    {
      "text": "Michael L Walters, Kerstin Dautenhahn, René Te Boekhorst, Kheng Lee Koay, Christina Kaouri, Sarah Woods, Chrystopher Nehaniv, David Lee, and Iain Werry. 2005. The influence of subjects' personality traits on personal spatial zones in a human-robot interaction experiment. In Robot and Human Interactive Communication, 2005. ROMAN 2005. IEEE International Workshop on. IEEE, 347--352.",
      "doi": ""
    },
    {
      "text": "Zhen Wang. 2012. Enquiry into Cultivating Intercultural Nonverbal Communicative Competence in College English Teaching. Theory and Practice in Language Studies 2, 6 (2012), 1230.",
      "doi": ""
    },
    {
      "text": "O Michael Watson. 1970. Proxemic behavior: A cross-cultural study. Vol. 8. Walter de Gruyter GmbH & Co KG.",
      "doi": ""
    },
    {
      "text": "Jennifer D Webb and Margaret J Weber. 2003. Influence of sensory abilities on the interpersonal distance of the elderly. Environment and behavior 35, 5 (2003), 695--711.",
      "doi": ""
    },
    {
      "text": "Ali Winkle. 2017. Suitable Technologies - Beam Pro Press. (2017). https://suitabletech.com/news/press",
      "doi": ""
    },
    {
      "text": "Lillian Yang, Carman Neustaedter, and Thecla Schiphorst. 2017. Communicating Through A Telepresence Robot: A Study of Long Distance Relationships. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 3027--3033.  ",
      "doi": "10.1145/3027063.3053240"
    },
    {
      "text": "Nick Yee, Jeremy N Bailenson, Mark Urbanek, Francis Chang, and Dan Merget. 2007. The unbearable likeness of being digital: The persistence of nonverbal social norms in online virtual environments. CyberPsychology & Behavior 10, 1 (2007), 115--121.",
      "doi": ""
    },
    {
      "text": "Masanori Yokoyama, Masafumi Matsuda, Shinyo Muto, and Naoyoshi Kanamaru. 2014. PoliTel. Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology UIST'14 Adjunct (2014), 91--92.  ",
      "doi": "10.1145/2658779.2658791"
    }
  ]
}