{
  "doi": "10.1145/3173574.3173594",
  "title": "SteeringWheel: A Locality-Preserving Magnification Interface for Low Vision Web Browsing",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Low-vision users struggle to browse the web with screen magnifiers. Firstly, magnifiers occlude significant portions of the webpage, thereby making it cumbersome to get the webpage overview and quickly locate the desired content. Further, magnification causes loss of spatial locality and visual cues that commonly define semantic relationships in the page; reconstructing semantic relationships exclusively from narrow views dramatically increases the cognitive burden on the users. Secondly, low-vision users have widely varying needs requiring a range of interface customizations for different page sections; dynamic customization in extant magnifiers is disruptive to users' browsing. We present SteeringWheel, a magnification interface that leverages content semantics to preserve local context. In combination with a physical dial, supporting simple rotate and press gestures, users can quickly navigate different webpage sections, easily locate desired content, get a quick overview, and seamlessly customize the interface. A user study with 15 low-vision participants showed that their web-browsing efficiency improved by at least 20 percent with SteeringWheel compared to extant screen magnifiers.",
  "authors": [
    {
      "name": "Syed Masum Billah",
      "institution": "Stony Brook University, Stony Brook, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87059293557",
      "orcid": "0000-0001-5063-3808"
    },
    {
      "name": "Vikas Ashok",
      "institution": "Stony Brook University, Stony Brook, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158989757",
      "orcid": "0000-0002-4772-1265"
    },
    {
      "name": "Donald E. Porter",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC, USA",
      "img": "/do/10.1145/contrib-81100437540/rel-imgonly/photo.png",
      "acmid": "81100437540",
      "orcid": "0000-0002-9804-0857"
    },
    {
      "name": "I.V. Ramakrishnan",
      "institution": "Stony Brook University, Stony Brook, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452611166",
      "orcid": "0000-0002-1768-7043"
    }
  ],
  "references": [
    {
      "text": "AFB, Glossary of Eye Conditions. Retrieved from http://www.afb.org/info/living-with-vision-loss/eye-conditions/12#L.",
      "doi": ""
    },
    {
      "text": "AFB, 2017. Screen Magnification Systems. Retrieved from http://www.afb.org/prodBrowseCatResults.aspx?CatID=39.",
      "doi": ""
    },
    {
      "text": "Agarwal, B. and Stuerzlinger, W., 201 Widgetlens: A System for Adaptive Content Magnification of Widgets. In Proceedings of the 27th International BCS Human Computer Interaction Conference. British Computer Society, 1--10. ",
      "doi": "10.5555/2578048.2578052"
    },
    {
      "text": "Álvarez, M., Pan, A., Raposo, J., Bellas, F., and Cacheda, F., 2010. Finding and Extracting Data Records from Web Pages. Journal of Signal Processing Systems 59, 1, 123--137.  ",
      "doi": "10.1007/s11265-008-0270-y"
    },
    {
      "text": "AOA, Common Types of Low Vision. Retrieved from https://www.aoa.org/patients-and-public/caring-for-your-vision/low-vision/common-types-of-low-vision.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B., and Zierlinger, A., 2003. Drag-and-Pop and Drag-and-Pick: Techniques for Accessing Remote Screen Content on Touch-and Pen-Operated Systems. In Proceedings of the of INTERACT. 57--64.",
      "doi": ""
    },
    {
      "text": "Bederson, B. B. and Hollan, J. D., 1994. Pad++: A Zooming Graphical Interface for Exploring Alternate Interface Physics. In Proceedings of the 7th annual ACM symposium on User interface software and technology. ACM, 17--26.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "Bier, E. A., Stone, M. C., Pier, K., Buxton, W., and DeRose, T. D., 1993. Toolglass and Magic Lenses: The See-through Interface. In Proceedings of the 20th annual conference on Computer graphics and interactive techniques. ACM, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Bigham, J. P., 2014. Making the Web Easier to See with Opportunistic Accessibility Improvement. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 117--122.  ",
      "doi": "10.1145/2642918.2647357"
    },
    {
      "text": "Billah, S. M., Ashok, V., Porter, D. E., and Ramakrishnan, I. V., 2017. Speed-Dial: A Surrogate Mouse for Non-Visual Web Browsing. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 110--119.  ",
      "doi": "10.1145/3132525.3132531"
    },
    {
      "text": "1Billah, S. M., Porter, D. E., and Ramakrishnan, I. V., 2016. Sinter: Low-Bandwidth Remote Access for the Visually-Impaired. In Proceedings of the Eleventh European Conference on Computer Systems. ACM, 1--16.  ",
      "doi": "10.1145/2901318.2901335"
    },
    {
      "text": "Blanch, R., Guiard, Y., and Beaudouin-Lafon, M., 2004. Semantic Pointing: Improving Target Acquisition with Control-Display Ratio Adaptation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Blenkhorn, P. and Evans, D. G., 2006. A Screen Magnifier Using \"High Level\" Implementation Techniques. IEEE Transactions on Neural Systems and Rehabilitation Engineering 14, 4, 501--504.",
      "doi": ""
    },
    {
      "text": "Blenkhorn, P., Evans, D. G., and Baude, A., 2002. Full-Screen Magnification for Windows Using Directx Overlays. IEEE Transactions on Neural Systems and Rehabilitation Engineering 10, 4, 225--231.",
      "doi": ""
    },
    {
      "text": "Brooke, J., 1996. Sus-a Quick and Dirty Usability Scale. Usability evaluation in industry 189, 194.",
      "doi": ""
    },
    {
      "text": "Cai, D., Yu, S., Wen, J.-R., and Ma, W.-Y., 2004. Vips: A Vision Based Page Segmentation Algorithm. Microsoft technical report.",
      "doi": ""
    },
    {
      "text": "Christen, M. and Abegg, M., 20 The Effect of Magnification and Contrast on Reading Performance in Different Types of Simulated Low Vision. 2017 10, 2 (2017-05--16).",
      "doi": ""
    },
    {
      "text": "Chung, C. Y., Gertz, M., and Sundaresan, N., 2002. Reverse Engineering for Web Data: From Visual to Semantic Structures. In Proceedings 18th International Conference on Data Engineering. IEEE, 53--63. ",
      "doi": "10.5555/876875.878943"
    },
    {
      "text": "Dill, S., Eiron, N., Gibson, D., Gruhl, D., Guha, R., Jhingran, A., Kanungo, T., Rajagopalan, S., Tomkins, A., and Tomlin, J. A., 2003. Semtag and Seeker: Bootstrapping the Semantic Web Via Automated Semantic Annotation. In Proceedings of the 12th international conference on World Wide Web. ACM, 178--186.  ",
      "doi": "10.1145/775152.775178"
    },
    {
      "text": "Fensel, D., Decker, S., Erdmann, M., and Studer, R., 1998. Ontobroker: Or How to Enable Intelligent Access to the Www. In Proceedings of of the 11th Banff Knowledge Acquisition for Knowledge-Based Systems Workshop. CiteSeer.",
      "doi": ""
    },
    {
      "text": "2Fraser, J. and Gutwin, C., 2000. A Framework of Assistive Pointers for Low Vision Users. In Proceedings of the fourth international ACM conference on Assistive technologies. ACM, 9--16.  ",
      "doi": "10.1145/354324.354329"
    },
    {
      "text": "2Gajos, K. Z., Wobbrock, J. O., and Weld, D. S., 2007. Automatically Generating User Interfaces Adapted to Users' Motor and Vision Capabilities. In Proceedings of the 20th annual ACM symposium on User interface software and technology. ACM, 231--240.  ",
      "doi": "10.1145/1294211.1294253"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R., 2005. The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor's Activation Area. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R., and Beaudouin-Lafon, M., 2004. Object Pointing: A Complement to Bitmap Pointing in Guis. In Proceedings of Graphics Interface 2004. Canadian Human-Computer Communications Society, 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Gutwin, C., 2002. Improving Focus Targeting in Interactive Fisheye Views. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 267--274.  ",
      "doi": "10.1145/503376.503424"
    },
    {
      "text": "Hallett, E. C., Dick, W., Jewett, T., and Vu, K.-P. L., 2018. How Screen Magnification with and without Word-Wrapping Affects the User Experience of Adults with Low Vision. In Advances in Usability and User Experience: Proceedings of the Ahfe 2017 International Conference on Usability and User Experience, July 17--21, 2017, the Westin Bonaventure Hotel, Los Angeles, California, USA, T. AHRAM and C. FALCÃO Eds. Springer International Publishing, Cham, 665--674.",
      "doi": ""
    },
    {
      "text": "Hornbæk, K. and Frøkjær, E., 2001. Reading of Electronic Documents: The Usability of Linear, Fisheye, and Overview+Detail Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 293--300.  ",
      "doi": "10.1145/365024.365118"
    },
    {
      "text": "Hourcade, J. P., Nguyen, C. M., Perry, K. B., and Denburg, N. L., 2010. Pointassist for Older Adults: Analyzing Sub-Movement Characteristics to Aid in Pointing Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1115--1124.  ",
      "doi": "10.1145/1753326.1753494"
    },
    {
      "text": "Huang, A. W. and Sundaresan, N., 2000. A Semantic Transcoding System to Adapt Web Services for Users with Disabilities. In Proceedings of the 4th International ACM Conference on Assistive Technologies. ACM.  ",
      "doi": "10.1145/354324.354363"
    },
    {
      "text": "Jacko, J. A. and Sears, A., 1998. Designing Interfaces for an Overlooked User Group: Considering the Visual Profiles of Partially Sighted Users. In Proceedings of the third international ACM conference on Assistive technologies. ACM, 75--77.  ",
      "doi": "10.1145/274497.274512"
    },
    {
      "text": "3JAWS, 2013. Screen Reader from Freedom Scientific. Retrieved from http://www.freedomscientific.com/products/fs/jaws-product-page.asp.",
      "doi": ""
    },
    {
      "text": "3Kabbash, P. and Buxton, W. A. S., 1995. The \"Prince\" Technique: Fitts' Law and Selection Using Area Cursors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press/Addison-Wesley Publishing Co., 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "3Kline, R. L. and Glinert, E. P., 1995. Improving Gui Accessibility for People with Low Vision. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press/Addison-Wesley Publishing Co., 114--121.  ",
      "doi": "10.1145/223904.223919"
    },
    {
      "text": "Kuber, R., Yu, W., and McAllister, G., 2007. Towards Developing Assistive Haptic Feedback for Visually Impaired Internet Users. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 1525--15  ",
      "doi": "10.1145/1240624.1240854"
    },
    {
      "text": "Lamping, J., Rao, R., and Pirolli, P., 1995. A Focus+Context Technique Based on Hyperbolic Geometry for Visualizing Large Hierarchies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press/Addison-Wesley Publishing Co., 401--408.  ",
      "doi": "10.1145/223904.223956"
    },
    {
      "text": "MacKenzie, I. S., 1992. Fitts' Law as a Research and Design Tool in Human-Computer Interaction. Human-computer interaction 7, 1, 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "3NVDA, 2013. Nonvisual Desktop Access. Retrieved from http://www.nvda-project.org/.",
      "doi": ""
    },
    {
      "text": "3Ramakrishnan, I. V., Stent, A., and Yang, G. L., 2004. Hearsay: Enabling Audio Browsing on Hypertext Content. In International World Wide Web Conference (WWW).  ",
      "doi": "10.1145/988672.988684"
    },
    {
      "text": "3Rotard, M., Knödler, S., and Ertl, T., 2005. A Tactile Web Browser for the Visually Disabled. In Proceedings of the sixteenth ACM conference on Hypertext and hypermedia. ACM, 15--22.  ",
      "doi": "10.1145/1083356.1083361"
    },
    {
      "text": "Soviak, A., Borodin, A., Ashok, V., Borodin, Y., Puzis, Y., and Ramakrishnan, I., 2016. Tactile Accessibility: Does Anyone Need a Haptic Glove? In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 101--109.  ",
      "doi": "10.1145/2982142.2982175"
    },
    {
      "text": "4Szpiro, S., Zhao, Y., and Azenkot, S., 2016. Finding a Store, Searching for a Product: A Study of Daily Challenges of Low Vision People. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 61--72.  ",
      "doi": "10.1145/2971648.2971723"
    },
    {
      "text": "4Szpiro, S. F. A., Hashash, S., Zhao, Y., and Azenkot, S., 2016. How People with Low Vision Access Computing Devices: Understanding Challenges and Opportunities. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 171--180.  ",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "4Theofanos, M. F. and Redish, J., 2005. Helping Low-Vision and Other Users with Web Sites That Meet Their Needs: Is One Site for All Feasible? Technical Communication 52, 1 (//), 9--20.",
      "doi": ""
    },
    {
      "text": "4W3C, 2017. Accessibility Requirements for People with Low Vision. Retrieved from https://w3c.github.io/low-vision-a11y-tf/requirements.html.",
      "doi": ""
    },
    {
      "text": "4Wong, E. J., Yap, K. M., Alexander, J., and Karnik, A., 2015. Habos: Towards a Platform of Haptic-Audio Based Online Shopping for the Visually Impaired. In Open Systems (ICOS), 2015 IEEE Confernece on. IEEE, 62--67.",
      "doi": ""
    },
    {
      "text": "4Worden, A., Walker, N., Bharat, K., and Hudson, S., 1997. Making Computers Easier for Older Adults to Use: Area Cursors and Sticky Icons. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. ACM, 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "4Yu, W., Kuber, R., Murphy, E., Strain, P., and McAllister, G., 2006. A Novel Multimodal Interface for Improving Visually Impaired People's Web Accessibility. Virtual Reality 9, 2--3, 133--148.  ",
      "doi": "10.5555/1124635.1124644"
    },
    {
      "text": "4Zhai, Y. and Liu, B., 2005. Web Data Extraction Based on Partial Tree Alignment. In Proceedings of the 14th international conference on World Wide Web. ACM, 76--85.  ",
      "doi": "10.1145/1060745.1060761"
    },
    {
      "text": "4Zhao, Y., Szpiro, S., and Azenkot, S., 2015. Foresee: A Customizable Head-Mounted Vision Enhancement System for People with Low Vision. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 239--2  ",
      "doi": "10.1145/2700648.2809865"
    },
    {
      "text": "Zhao, Z., Rau, P.-L. P., Zhang, T., and Salvendy, G., 2009. Visual Search-Based Design and Evaluation of Screen Magnifiers for Older and Visually Impaired Users. Int. J. Hum.-Comput. Stud. 67, 8, 663--675.  ",
      "doi": "10.1016/j.ijhcs.2009.03.006"
    },
    {
      "text": "5Zhu, J., Nie, Z., Wen, J.-R., Zhang, B., and Ma, W.-Y., 2006. Simultaneous Record Detection and Attribute Labeling in Web Data Extraction. In Proceedings of the 12th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 494--503.  ",
      "doi": "10.1145/1150402.1150457"
    }
  ]
}