{
  "doi": "10.1145/3173574.3174117",
  "title": "Forgotten But Not Gone: Identifying the Need for Longitudinal Data Management in Cloud Storage",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Users have accumulated years of personal data in cloud storage, creating potential privacy and security risks. This agglomeration includes files retained or shared with others simply out of momentum, rather than intention. We presented 100 online-survey participants with a stratified sample of 10 files currently stored in their own Dropbox or Google Drive accounts. We asked about the origin of each file, whether the participant remembered that file was stored there, and, when applicable, about that file's sharing status. We also recorded participants' preferences moving forward for keeping, deleting, or encrypting those files, as well as adjusting sharing settings. Participants had forgotten that half of the files they saw were in the cloud. Overall, 83% of participants wanted to delete at least one file they saw, while 13% wanted to unshare at least one file. Our combined results suggest directions for retrospective cloud data management.",
  "authors": [
    {
      "name": "Mohammad Taha Khan",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658741163",
      "orcid": "missing"
    },
    {
      "name": "Maria Hyun",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260764",
      "orcid": "missing"
    },
    {
      "name": "Chris Kanich",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361609694",
      "orcid": "missing"
    },
    {
      "name": "Blase Ur",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/do/10.1145/contrib-81496672613/rel-imgonly/blase_headshot_400.jpg",
      "acmid": "81496672613",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ibrahim Arpaci, Kerem Kilicer, and Salih Bardakci. 2015. Effects of security and privacy concerns on educational use of cloud services. Computers in Human Behavior 45 (2015), 93--98.  ",
      "doi": "10.1016/j.chb.2014.11.075"
    },
    {
      "text": "Oshrat Ayalon and Eran Toch. 2013. Retrospective privacy: Managing longitudinal privacy in online social networks. In Proc. SOUPS.  ",
      "doi": "10.1145/2501604.2501608"
    },
    {
      "text": "Taiwo Ayodele, Galyna Akmayeva, and Charles A. Shoniregun. 2012. Machine learning approach towards email management. In Proc. World Congress on Internet Security (WorldCIS). 106--109.",
      "doi": ""
    },
    {
      "text": "Olle Balter. 1997. Strategies for organising email messages. In Proc. HCI. ",
      "doi": "10.5555/646684.702639"
    },
    {
      "text": "Deborah Barreau and Bonnie A. Nardi. 1995. Finding and reminding: File organization from the desktop. ACM SigChi Bulletin 27, 3 (1995), 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Deborah K. Barreau. 1995. Context as a factor in personal information management systems. Journal of the American Society for Information Science 46, 5 (1995), 327.  ",
      "doi": "10.5555/208107.208108"
    },
    {
      "text": "Lujo Bauer, Lorrie Faith Cranor, Saranga Komanduri, Michelle L. Mazurek, Michael K. Reiter, Manya Sleeper, and Blase Ur. 2013. The post anachronism: The temporal dimension of Facebook privacy. In Proc. WPES.  ",
      "doi": "10.1145/2517840.2517859"
    },
    {
      "text": "Victoria Bellotti, Nicolas Ducheneaut, Mark Howard, Ian Smith, and Christine Neuwirth. 2002. Innovation in extremis: Evolving an application for the critical work of email and information management. In Proc. DIS.  ",
      "doi": "10.1145/778712.778740"
    },
    {
      "text": "Ofer Bergman, Richard Boardman, Jacek Gwizdka, and William Jones. 2004. Personal information management. In Proc. CHI Extended Abstracts.  ",
      "doi": "10.1145/985921.986164"
    },
    {
      "text": "Ofer Bergman, Steve Whittaker, and Noa Falk. 2014. Shared files: The retrieval perspective. Journal of the Association for Information Science&Technology 65, 10 (2014), 1949--1963.  ",
      "doi": "10.1002/asi.23147"
    },
    {
      "text": "Richard Boardman and M. Angela Sasse. 2004. Stuff goes into the computer and doesn't come out: A cross-tool study of personal information management. In Proc. CHI.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Richard Boardman, Robert Spence, and M. Angela Sasse. 2003. Too many hierarchies? The daily struggle for control of the workspace. In Proc. HCII.",
      "doi": ""
    },
    {
      "text": "Richard Peter Boardman. 2004. Improving tool support for personal information management. Ph.D. Dissertation. University of London.",
      "doi": ""
    },
    {
      "text": "Dell Cameron. 2014. Apple knew of iCloud security hole 6 months before Celebgate. The Daily Dot. (September 24 2014). http://www.dailydot.com/technology/appleicloud-brute-force-attack-march/.",
      "doi": ""
    },
    {
      "text": "Robert Capra, Emily Vardell, and Kathy Brennan. 2014. File synchronization and sharing: User practices and challenges. In Proc. ASIS&T.",
      "doi": ""
    },
    {
      "text": "Richard Chow, Philippe Golle, Markus Jakobsson, Elaine Shi, Jessica Staddon, Ryusuke Masuoka, and Jesus Molina. 2009. Controlling data in the cloud: Outsourcing computation without outsourcing control. In Proc. CCSW.  ",
      "doi": "10.1145/1655008.1655020"
    },
    {
      "text": "Jason W. Clark, Peter Snyder, Damon McCoy, and Chris Kanich. 2015. I Saw Images I Didn't Even Know I Had: Understanding User Perceptions of Cloud Storage Privacy. In Proc. CHI.  ",
      "doi": "10.1145/2702123.2702535"
    },
    {
      "text": "Idilio Drago, Marco Mellia, Maurizio M. Munaf` o, Anna Sperotto, Ramin Sadre, and Aiko Pras. 2012. Inside Dropbox: Understanding personal cloud storage services. In Proc. IMC.  ",
      "doi": "10.1145/2398776.2398827"
    },
    {
      "text": "Susan Dumais, Edward Cutrell, Jonathan J. Cadiz, Gavin Jancke, Raman Sarin, and Daniel C. Robbins. 2016. Stuff I've seen: A system for personal information retrieval and re-use. In ACM SIGIR Forum, Vol. 49. 28--35.  ",
      "doi": "10.1145/2888422.2888425"
    },
    {
      "text": "Janna Lynn Dupree, Richard Devries, Daniel M. Berry, and Edward Lank. 2016. Privacy personas: Clustering users via attitudes and behaviors toward security practices. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858214"
    },
    {
      "text": "Global Industry Analysts. Inc. Accessed 2017. Personal cloud-A global strategic business report. http://www.strategyr.com/MarketResearch/Personal_Cloud_Market_Trends.asp. (Accessed 2017).",
      "doi": ""
    },
    {
      "text": "Glauber Gonc ¸alves, Idilio Drago, Ana Paula Couto Da Silva, Alex Borges Vieira, and Jussara M. Almeida. 2014. Modeling the Dropbox client behavior. In Proc. ICC.",
      "doi": ""
    },
    {
      "text": "Graham Cluley. Accessed 2017. Dropbox users leak tax returns, mortgage applications and more. https://www.grahamcluley.com/dropbox-box-leak/. (Accessed 2017).",
      "doi": ""
    },
    {
      "text": "Jane Gruning and Sian Lindley. 2016. Things we own together: Sharing possessions at home. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858154"
    },
    {
      "text": "Drew Houston and Arash Ferdowsi. 2016. Celebrating half a billion users. https: //blogs.dropbox.com/dropbox/2016/03/500-million/. (2016).",
      "doi": ""
    },
    {
      "text": "Wenjin Hu, Tao Yang, and Jeanna N. Matthews. 2010. The good, the bad and the ugly of consumer cloud storage. ACM SIGOPS Operating Systems Review 44, 3 (2010), 110--115.  ",
      "doi": "10.1145/1842733.1842751"
    },
    {
      "text": "Iulia Ion, Niharika Sachdeva, Ponnurangam Kumaraguru, and Srdjan Capkun. 2011. Home is safer than the cloud!: Privacy concerns for consumer cloud storage. In Proc. SOUPS.  ",
      "doi": "10.1145/2078827.2078845"
    },
    {
      "text": "Eric Johnson. 2017. Lost in the cloud: Cloud storage, privacy, and suggestions for protecting users' data. Stan. L. Rev. 69 (2017), 867.",
      "doi": ""
    },
    {
      "text": "Victor Kaptelinin. 2003. UMEA: Translating interaction histories into project contexts. In Proc. CHI.  ",
      "doi": "10.1145/642611.642673"
    },
    {
      "text": "Beom Heyn Kim, Wei Huang, and David Lie. 2012. Unity: Secure and durable personal cloud storage. In Proc. CCSW.  ",
      "doi": "10.1145/2381913.2381920"
    },
    {
      "text": "Felix Kollmar. 2017. Cloud Storage Report 2017. https://blog.cloudrail.com/cloud-storage-report-2017/. (2017).",
      "doi": ""
    },
    {
      "text": "Mark W. Lansdale. 1988. The psychology of personal information management. Applied ergonomics 19, 1 (1988), 55--66.",
      "doi": ""
    },
    {
      "text": "Cathy Marshall and John C. Tang. 2012. That syncing feeling: Early user experiences with the cloud. In Proc. DIS.  ",
      "doi": "10.1145/2317956.2318038"
    },
    {
      "text": "Charlotte Massey, Thomas Lennig, and Steve Whittaker. 2014. Cloudy forecast: An exploration of the factors underlying shared repository use. In Proc. CHI.  ",
      "doi": "10.1145/2556288.2557042"
    },
    {
      "text": "Peter Mell, Tim Grance, and others. 2011. The NIST definition of cloud computing. (2011).",
      "doi": ""
    },
    {
      "text": "Adriana Mijuskovic and Mexhid Ferati. 2015. User awareness of existing privacy and security risks when storing data in the cloud. In Proc. ICEL.",
      "doi": ""
    },
    {
      "text": "Mainack Mondal, Johnnatan Messias, Saptarshi Ghosh, Krishna P. Gummadi, and Aniket Kate. 2017. Longitudinal Privacy Management in Social Media: The Need for Better Controls. IEEE Internet Computing 21, 3 (2017), 48--55.  ",
      "doi": "10.1109/MIC.2017.76"
    },
    {
      "text": "Michael Nebeling, Matthias Geel, Oleksiy Syrotkin, and Moira C. Norrie. 2015. MUBox: Multi-user aware personal cloud storage. In Proc. CHI.  ",
      "doi": "10.1145/2702123.2702233"
    },
    {
      "text": "Emilee Rader. 2010. The effect of audience design on labeling, organizing, and finding shared files. In Proc. CHI.  ",
      "doi": "10.1145/1753326.1753440"
    },
    {
      "text": "Kopo Marvin Ramokapane, Awais Rashid, and Jose Such. 2017. \"I feel stupid I can't delete...\": A study of users' cloud deletion practices and coping strategies. In Proc. SOUPS.",
      "doi": ""
    },
    {
      "text": "Esther Schindler. July 2010. Cloud development survey. Evans Data Corporation Strategic Reports. (July 2010).",
      "doi": ""
    },
    {
      "text": "Manya Sleeper, William Melicher, Hana Habib, Lujo Bauer, Lorrie Faith Cranor, and Michelle L Mazurek. 2016. Sharing personal content online: Exploring channel choice and multi-channel behaviors. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858170"
    },
    {
      "text": "Peter Snyder and Chris Kanich. 2013. Cloudsweeper: Enabling data-centric document management for secure cloud archives. In Proc. CCSW.  ",
      "doi": "10.1145/2517488.2517495"
    },
    {
      "text": "Luke Stark and Matt Tierney. 2014. Lockbox: Mobility, privacy and values in cloud storage. Ethics and Information Technology 16, 1 (2014), 1--13.  ",
      "doi": "10.1007/s10676-013-9328-z"
    },
    {
      "text": "Nabil Ahmed Sultan. 2011. Reaching for the cloud: How SMEs can manage. International journal of information management 31, 3 (2011), 272--278.  ",
      "doi": "10.1016/j.ijinfomgt.2010.08.001"
    },
    {
      "text": "Steve Whittaker, Victoria Bellotti, and Jacek Gwizdka. 2006. Email in personal information management. Commun. ACM 49, 1 (2006), 68--73.  ",
      "doi": "10.1145/1107458.1107494"
    },
    {
      "text": "Steve Whittaker and Candace Sidner. 1996. Email overload: Exploring personal information management of email. In Proc. CHI.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Hong Zhang and Michael Twidale. 2012. Mine, yours and ours: Using shared folders in personal information management. Personal Information Management (PIM) (2012).",
      "doi": ""
    },
    {
      "text": "Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of Facebook: Experiencing social media as performance, exhibition, and personal archive. In Proc. CHI.  ",
      "doi": "10.1145/2470654.2470656"
    }
  ]
}