{
  "doi": "10.1145/3173574.3173645",
  "title": "TaskCam: Designing and Testing an Open Tool for Cultural Probes Studies",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "TaskCams are simple digital cameras intended to serve as a tool for Cultural Probe studies and made available by the Interaction Research Studio via open-source distribution. In conjunction with an associated website, instructions and videos, they represent a novel strategy for disseminating and facilitating a research methodology. At the same time, they provide a myriad of options for customisation and modification, allowing researchers to adopt and adapt them to their needs. In the first part of this paper, the design team describes the rationale and design of the TaskCams and the tactics developed to make them publicly available. In the second part, the story is taken up by designers from the Everyday Design Studio, who assembled their own TaskCams and customised them extensively for a Cultural Probe study they ran for an ongoing project. Rather than discussing the results of their study, we focus on how their experiences reveal some of the issues both in producing and using open-source products such as these. These suggest the potential of TaskCams to support design-led user studies more generally.",
  "authors": [
    {
      "name": "Andy Boucher",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100230335",
      "orcid": "0000-0002-4226-7059"
    },
    {
      "name": "Dean Brown",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260745",
      "orcid": "missing"
    },
    {
      "name": "Liliana Ovalle",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704290",
      "orcid": "missing"
    },
    {
      "name": "Andy Sheen",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260342",
      "orcid": "missing"
    },
    {
      "name": "Mike Vanis",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261716",
      "orcid": "missing"
    },
    {
      "name": "William Odom",
      "institution": "Simon Fraser University, Surrey, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582655",
      "orcid": "0000-0002-2824-9292"
    },
    {
      "name": "Doenja Oogjes",
      "institution": "Simon Fraser University, Surrey, Canada",
      "img": "/do/10.1145/contrib-99658985626/rel-imgonly/img_7637_crop.jpg",
      "acmid": "99658985626",
      "orcid": "0000-0002-4398-5060"
    },
    {
      "name": "William Gaver",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104022",
      "orcid": "0000-0003-1275-7652"
    }
  ],
  "references": [
    {
      "text": "Arduio CC. Retrieved 18 September 2017 from https://www.arduino.cc",
      "doi": ""
    },
    {
      "text": "David Benyon, D. 2013. Designing interactive Systems: A Comprehensive Guide to HCI, UX and interaction design. Pearson Education.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, William Gaver, and Andy Boucher. 2012. Probes. In Celia Lury and Nina Wakeman (eds.) Inventive Methods: The happening of the social. Routledge.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1077--1086.  ",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Business design tools. Retrieved 18 September 2017 from http://www.businessdesigntools.com/portfolioitems/cultural-probes/",
      "doi": ""
    },
    {
      "text": "Christian Cawley. 2016. 5 DIY Cameras You Can Build Today. Retrieved 5 January 2018 from https://www.makeuseof.com/tag/5-diy-cameras-canbuild-today/",
      "doi": ""
    },
    {
      "text": "ChefSteps, Inc. Accessed 14 September 2017 at https://www.chefsteps.com/",
      "doi": ""
    },
    {
      "text": "Matthew A. Dalton, Audrey Desjardins, and Ron Wakkary. 2014. From DIY tutorials to DIY recipes. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1405--1410.  ",
      "doi": "10.1145/2559206.2581238"
    },
    {
      "text": "Audrey Desjardins, Ron Wakkary, and William Odom. 2015. Investigating Genres and Perspectives in HCI Research on the Home. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3073--3082.  ",
      "doi": "10.1145/2702123.2702540"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural probes. interactions 6, 1 (January 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "William W. Gaver, Andrew Boucher, Sarah Pennington, and Brendan Walker. 2004. Cultural probes and the value of uncertainty. interactions 11, 5 (September 2004), 53--56.  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "William Gaver and Anthony Dunne. 1999. Projected realities: conceptual design for cultural effect. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 600--607.  ",
      "doi": "10.1145/302979.303168"
    },
    {
      "text": "GitHub. Retrieved 18 September 2017 from github.com.",
      "doi": ""
    },
    {
      "text": "Megan K. Halpern, Ingrid Erickson, Laura Forlano, and Geri K. Gay. 2013. Designing collaboration: comparing cases exploring cultural probes as boundary-negotiating objects. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 10931102.  ",
      "doi": "10.1145/2441776.2441900"
    },
    {
      "text": "Hanington, Bruce, and Bella Martin. Universal methods of design: 100 ways to research complex problems, develop innovative ideas, and design effective solutions. Rockport Publishers, 2012.",
      "doi": ""
    },
    {
      "text": "Sami Hulkko, Tuuli Mattelmäki, Katja Virtanen, and Turkka Keinonen. 2004. Mobile probes. In Proceedings of the third Nordic conference on Human-computer interaction (NordiCHI '04). ACM, New York, NY, USA, 43--51.  ",
      "doi": "10.1145/1028014.1028020"
    },
    {
      "text": "Instructables. Retrieved 18 September 2017 from https://www.instructables.com.",
      "doi": ""
    },
    {
      "text": "Tom Jenkins. 2017. Living Apart, Together: Cohousing as a Site for ICT Design. In Proceedings of the 2017 Conference on Designing Interactive Systems, pp. 1039--1051. ACM.  ",
      "doi": "10.1145/3064663.3064751"
    },
    {
      "text": "Tom Jenkins, Kristina Andersen, William Gaver, William Odom, James Pierce, and Anna Vallgårda. 2016. Attending to Objects as Outcomes of Design Research. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3423--3430.  ",
      "doi": "10.1145/2851581.2856508"
    },
    {
      "text": "Tom Jenkins, Kristina Andersen, William Gaver, William Odom, James Pierce, and Anna Vallgårda. 2017. The Things of Design Research: Diversity in Objects and Outcomes. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 652--659.  ",
      "doi": "10.1145/3027063.3027068"
    },
    {
      "text": "Tejinder K. Judge and Carman Neustaedter. 2014. Studying and Designing Technology for Domestic Life: Lessons from Home. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA. ",
      "doi": "10.5555/2769771"
    },
    {
      "text": "Jean-Baptiste Labrune and Wendy Mackay. 2005. Tangicam: exploring observation tools for children. In Proceedings of the 2005 conference on Interaction design and children (IDC '05). ACM, New York, NY, USA, 95--102.  ",
      "doi": "10.1145/1109540.1109553"
    },
    {
      "text": "Jean-Baptiste Labrune and Wendy Mackay. 2007. SketchCam: creative photography for children. In Proceedings of the 6th international conference on Interaction design and children (IDC '07). ACM, New York, NY, USA, 153--156.  ",
      "doi": "10.1145/1297277.1297309"
    },
    {
      "text": "Gilly Leshed, Maria Håkansson, and Joseph 'Jofish' Kaye. 2014. \"Our life is the farm and farming is our life\": home-work coordination in organic farm families. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 487--498.  ",
      "doi": "10.1145/2531602.2531708"
    },
    {
      "text": "Linksprite. Accessed 18 September 2017 from http://linksprite.com/wiki/index.php5?title=JPEG_Colo r_Camera_Serial_UART_Interface_(TTL_level)",
      "doi": ""
    },
    {
      "text": "Nora McDonald and Sean Goggins. 2013. Performance and participation in open source software on GitHub. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 139--144.  ",
      "doi": "10.1145/2468356.2468382"
    },
    {
      "text": "Mike Michael. 2012. De-signing the object of sociology: toward an ?idiotic' methodology. The Sociological Review, 60(S1), 166--183",
      "doi": ""
    },
    {
      "text": "Makoto Odamaki and Shree K. Nayar. 2017. Cambits: a reconfigurable camera system. Commun. ACM 60, 11 (October 2017), 54--61.  ",
      "doi": "10.1145/3139453"
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. 2010. Designing for dynamic family structures: divorced families and interactive systems. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 151--160.  ",
      "doi": "10.1145/1858171.1858199"
    },
    {
      "text": "Hyunjoo Oh, Sherry Hsi, Kristof Klipfel, and Mark D. Gross. 2017. Paper Machines. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, New York, NY, USA, 771--774.  ",
      "doi": "10.1145/3024969.3025050"
    },
    {
      "text": "Nadya Peek, James Coleman, Ilan Moyer, and Neil Gershenfeld. 2017. Cardboard Machine Kit: Modules for the Rapid Prototyping of Rapid Prototyping Machines. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3657--3668.  ",
      "doi": "10.1145/3025453.3025491"
    },
    {
      "text": "Marianne Graves Petersen, Aviaja Borup Lynggaard, Peter Gall Krogh, and Ida Wentzel Winther. 2010. Tactics for homing in mobile life: a fieldwalk study of extremely mobile people. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services (MobileHCI '10). ACM, New York, NY, USA, 265--274.  ",
      "doi": "10.1145/1851600.1851646"
    },
    {
      "text": "James Pierce. 2012. Undesigning technology: considering the negation of design by design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 957--966.  ",
      "doi": "10.1145/2207676.2208540"
    },
    {
      "text": "James Pierce and Eric Paulos. 2014. Some variations on a counterfunctional digital camera. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 131140.  ",
      "doi": "10.1145/2598510.2602968"
    },
    {
      "text": "James Pierce and Eric Paulos. 2015. Making Multiple Uses of the Obscura 1C Digital Camera: Reflecting on the Design, Production, Packaging and Distribution of a Counterfunctional Device. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2103--2112.  ",
      "doi": "10.1145/2702123.2702405"
    },
    {
      "text": "Simon Roberts. 2006. The pure and the impure? Reflections on applying anthropology and doing ethnography. In Pink, Sarah, ed. Applications of anthropology. Berghahn Books, 2006, 73--89.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers, Helen Sharp, and Jenny Preece. Interaction design: beyond human-computer interaction. John Wiley & Sons, 2011. ",
      "doi": "10.5555/2031622"
    },
    {
      "text": "SenseCam. 2004. Accessed 5 January 2018 from https://www.microsoft.com/enus/research/project/sensecam/",
      "doi": ""
    },
    {
      "text": "Irina A. Shklovski and Scott D. Mainwaring. 2005. Exploring technology adoption and use through the lens of residential mobility. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 621630.  ",
      "doi": "10.1145/1054972.1055058"
    },
    {
      "text": "Startus Magazine. Retrieved 18 September 2017 from http://magazine.startus.cc/design-thinking-fromcultural-probes-to-desktop-walkthrough/",
      "doi": ""
    },
    {
      "text": "Thingiverse. Retrieved 18 September 2017 from https://www.thingiverse.com.",
      "doi": ""
    },
    {
      "text": "Bogdan Vasilescu, Daryl Posnett, Baishakhi Ray, Mark G.J. van den Brand, Alexander Serebrenik, Premkumar Devanbu, and Vladimir Filkov. 2015. Gender and Tenure Diversity in GitHub Teams. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3789--3798.  ",
      "doi": "10.1145/2702123.2702549"
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making design probes work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3441--3450.  ",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Allison Woodruff, Jay Hasbrouck, and Sally Augustin. 2008. A bright green perspective on sustainable choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 313--322.  ",
      "doi": "10.1145/1357054.1357109"
    }
  ]
}