{
  "doi": "10.1145/3173574.3174140",
  "title": "Examining Wikipedia With a Broader Lens: Quantifying the Value of Wikipedia's Relationships with Other Large-Scale Online Communities",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "The extensive Wikipedia literature has largely considered Wikipedia in isolation, outside of the context of its broader Internet ecosystem. Very recent research has demonstrated the significance of this limitation, identifying critical relationships between Google and Wikipedia that are highly relevant to many areas of Wikipedia-based research and practice. This paper extends this recent research beyond search engines to examine Wikipedia's relationships with large-scale online communities, Stack Overflow and Reddit in particular. We find evidence of consequential, albeit unidirectional relationships. Wikipedia provides substantial value to both communities, with Wikipedia content increasing visitation, engagement, and revenue, but we find little evidence that these websites contribute to Wikipedia in return. Overall, these findings highlight important connections between Wikipedia and its broader ecosystem that should be considered by researchers studying Wikipedia. Critically, our results also emphasize the key role that volunteer-created Wikipedia content plays in improving other websites, even contributing to revenue generation.",
  "authors": [
    {
      "name": "Nicholas Vincent",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261135",
      "orcid": "missing"
    },
    {
      "name": "Isaac Johnson",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658747560",
      "orcid": "missing"
    },
    {
      "name": "Brent Hecht",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577456",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexa.com. 2018. Alexa Top 500 Global Sites. Retrieved July 17, 2017 from http://www.alexa.com/topsites",
      "doi": ""
    },
    {
      "text": "Ashton Anderson, Daniel Huttenlocher, Jon Kleinberg, and Jure Leskovec. 2012. Discovering Value from Community Activity on Focused Question Answering Sites: A Case Study of Stack Overflow. In Proceedings of the 18th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '12), 850--858.  ",
      "doi": "10.1145/2339530.2339665"
    },
    {
      "text": "Peter C Austin. 201 An introduction to propensity score methods for reducing the effects of confounding in observational studies. Multivariate behavioral research 46, 3: 399--424.",
      "doi": ""
    },
    {
      "text": "Erik Brynjolfsson and Andrew McAfee. 2014. The second machine age: Work, progress, and prosperity in a time of brilliant technologies. WW Norton&Company. ",
      "doi": "10.5555/2635954"
    },
    {
      "text": "Fabio Calefato, Filippo Lanubile, Maria Concetta Marasciulo, and Nicole Novielli. 2015. Mining successful answers in stack overflow. In Mining Software Repositories (MSR), 2015 IEEE/ACM 12th Working Conference on, 430--433. ",
      "doi": "10.5555/2820518.2820579"
    },
    {
      "text": "Judith A Chevalier and Dina Mayzlin. 2006. The effect of word of mouth on sales: Online book reviews. Journal of marketing research 43, 3: 345--354.",
      "doi": ""
    },
    {
      "text": "Giovanni Luca Ciampaglia and Dario Taraborelli. 2015. MoodBar: Increasing new user retention in Wikipedia through lightweight socialization. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing, 734--742.  ",
      "doi": "10.1145/2675133.2675181"
    },
    {
      "text": "Meri Coleman and Ta Lin Liau. 1975. A computer readability formula designed for machine scoring. Journal of Applied Psychology 60, 2: 283.",
      "doi": ""
    },
    {
      "text": "Richard K Crump, V Joseph Hotz, Guido W Imbens, and Oscar A Mitnik. 2009. Dealing with limited overlap in estimation of average treatment effects. Biometrika 96, 1: 187--199.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering shifts to suicidal ideation from mental health content in social media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 2098--2110.  ",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Dean Eckles and Eytan Bakshy. 2017. Bias and high-dimensional adjustment in observational studies of peer effects. arXiv preprint arXiv:1706.04692.",
      "doi": ""
    },
    {
      "text": "Paolo Ferragina and Ugo Scaiella. 2010. Tagme: on-the-fly annotation of short text fragments (by wikipedia entities). In Proceedings of the 19th ACM international conference on Information and knowledge management, 1625--1628.  ",
      "doi": "10.1145/1871437.1871689"
    },
    {
      "text": "Evgeniy Gabrilovich and Shaul Markovitch. 2007. Computing semantic relatedness using wikipedia-based explicit semantic analysis. In IJcAI, 1606--1611. ",
      "doi": "10.5555/1625275.1625535"
    },
    {
      "text": "Eric Gilbert. 2013. Widespread Underprovision on Reddit. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13), 803--808.  ",
      "doi": "10.1145/2441776.2441866"
    },
    {
      "text": "Carlos Gómez, Brendan Cleary, and Leif Singer. 2013. A Study of Innovation Diffusion Through Link Sharing on Stack Overflow. In Proceedings of the 10th Working Conference on Mining Software Repositories (MSR '13), 81--84. Retrieved from http://dl.acm.org/citation.cfm?id=2487085.2487105 ",
      "doi": "10.5555/2487085.2487105"
    },
    {
      "text": "José González Cabañas, Angel Cuevas, and Rubén Cuevas. 2017. FDVT: Data Valuation Tool for Facebook Users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 3799--3809.  ",
      "doi": "10.1145/3025453.3025903"
    },
    {
      "text": "Aaron Halfaker, Oliver Keyes, and Dario Taraborelli. 2013. Making peripheral participation legitimate: reader engagement experiments in wikipedia. In Proceedings of the 2013 conference on Computer supported cooperative work, 849--860.  ",
      "doi": "10.1145/2441776.2441872"
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, and John Riedl. 2011. Don't bite the newbies: how reverts affect the quantity and quality of Wikipedia work. In Proceedings of the 7th international symposium on wikis and open collaboration, 163--172.  ",
      "doi": "10.1145/2038558.2038585"
    },
    {
      "text": "F. Maxwell Harper, Daphne Raban, Sheizaf Rafaeli, and Joseph A. Konstan. 2008. Predictors of Answer Quality in Online Q&A Sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 865--874.  ",
      "doi": "10.1145/1357054.1357191"
    },
    {
      "text": "Brent Hecht and Darren Gergle. 2009. Measuring self-focus bias in community-maintained knowledge repositories. In Proceedings of the fourth international conference on Communities and technologies, 11--20.  ",
      "doi": "10.1145/1556460.1556463"
    },
    {
      "text": "Brent Hecht and Darren Gergle. 2010. The tower of Babel meets web 2.0: user-generated content and its applications in a multilingual context. In Proceedings of the SIGCHI conference on human factors in computing systems, 291--300.  ",
      "doi": "10.1145/1753326.1753370"
    },
    {
      "text": "Benjamin Mako Hill and Aaron Shaw. 2013. The Wikipedia gender gap revisited: characterizing survey response bias with propensity score estimation. PloS one 8, 6: e65782.",
      "doi": ""
    },
    {
      "text": "Himabindu Lakkaraju, Julian McAuley, and Jure Leskovec. 2013. What's in a Name? Understanding the Interplay between Titles, Content, and Communities in Social Media. International AAAI Conference on Web and Social Media; Seventh International AAAI Conference on Weblogs and Social Media. Retrieved January 1, 2013 from https://www.aaai.org/ocs/index.php/ICWSM/ICWSM13/paper/view/6085",
      "doi": ""
    },
    {
      "text": "Marit Hinnosaar, Toomas Hinnosaar, Michael Kummer, and Olga Slivko. 2017. Wikipedia Matters.",
      "doi": ""
    },
    {
      "text": "Johannes Hoffart, Fabian M Suchanek, Klaus Berberich, and Gerhard Weikum. 2013. YAGO2: A spatially and temporally enhanced knowledge base from Wikipedia. Artificial Intelligence 194: 28--61.  ",
      "doi": "10.1016/j.artint.2012.06.001"
    },
    {
      "text": "Jian Hu, Lujun Fang, Yang Cao, Hua-Jun Zeng, Hua Li, Qiang Yang, and Zheng Chen. 2008. Enhancing text clustering by leveraging Wikipedia semantics. In Proceedings of the 31st annual international ACM SIGIR conference on Research and development in information retrieval, 179--186.  ",
      "doi": "10.1145/1390334.1390367"
    },
    {
      "text": "Guido W Imbens and Donald B Rubin. 2015. Causal inference for statistics, social, and biomedical sciences: an introduction. Cambridge University Press. ",
      "doi": "10.5555/2764565"
    },
    {
      "text": "Isaac L Johnson, Yilun Lin, Toby Jia-Jun Li, Andrew Hall, Aaron Halfaker, Johannes Schöning, and Brent Hecht. 2016. Not at home on the range: Peer production and the urban/rural divide. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 13--25.  ",
      "doi": "10.1145/2858036.2858123"
    },
    {
      "text": "Aniket Kittur and Robert E Kraut. 2008. Harnessing the wisdom of crowds in wikipedia: quality through coordination. In Proceedings of the 2008 ACM conference on Computer supported cooperative work, 37--46.  ",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Alex Leavitt and Joshua A. Clark. 2014. Upvoting Hurricane Sandy: Event-based News Production Processes on a Social News Site. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14), 1495--1504.  ",
      "doi": "10.1145/2556288.2557140"
    },
    {
      "text": "Jun Liu and Sudha Ram. 2011. Who does what: Collaboration patterns in the wikipedia and their impact on article quality. ACM Transactions on Management Information Systems (TMIS) 2, 2: 11.  ",
      "doi": "10.1145/1985347.1985352"
    },
    {
      "text": "Steven Loria, P Keen, M Honnibal, R Yankovsky, D Karesh, E Dempsey, and others. 2014. TextBlob: simplified text processing. Secondary TextBlob: Simplified Text Processing.",
      "doi": ""
    },
    {
      "text": "Michael Luca. 2011. Reviews, Reputation, and Revenue: The Case of Yelp.com. Retrieved June 21, 2017 from http://www.hbs.edu/faculty/Pages/item.aspx?num=41233",
      "doi": ""
    },
    {
      "text": "Connor McMahon, Isaac L Johnson, and Brent J Hecht. 2017. The Substantial Interdependence of Wikipedia and Google: A Case Study on the Relationship Between Peer Production Communities and Information Technologies. In ICWSM, 142--151.",
      "doi": ""
    },
    {
      "text": "Olena Medelyan, David Milne, Catherine Legg, and Ian H Witten. 2009. Mining meaning from Wikipedia. International Journal of Human-Computer Studies 67, 9: 716--754.  ",
      "doi": "10.1016/j.ijhcs.2009.05.004"
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The heart work of Wikipedia: Gendered, emotional labor in the world's largest online encyclopedia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 207--210.  ",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "David Milne and Ian H Witten. 2013. An open-source toolkit for mining Wikipedia. Artificial Intelligence 194: 222--239.  ",
      "doi": "10.1016/j.artint.2012.06.007"
    },
    {
      "text": "Jonathan T Morgan, Siko Bouterse, Heather Walls, and Sarah Stierch. 2013. Tea and sympathy: crafting positive new user experiences on wikipedia. In Proceedings of the 2013 conference on Computer supported cooperative work, 839--848.  ",
      "doi": "10.1145/2441776.2441871"
    },
    {
      "text": "Daniel Moyer, Samuel L Carson, Thayne Keegan Dye, Richard T Carson, and David Goldbaum. 2015. Determining the influence of Reddit posts on Wikipedia pageviews. In Proceedings of the Ninth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Hendrik Müller, Aaron Sedley, and Elizabeth Ferrall-Nunge. 2014. Survey research in HCI. In Ways of Knowing in HCI. Springer, 229--266.",
      "doi": ""
    },
    {
      "text": "Alexandra Olteanu, Onur Varol, and Emre Kiciman. 2017. Distilling the Outcomes of Personal Experiences: A Propensity-scored Analysis of Social Media. In CSCW, 370--386.  ",
      "doi": "10.1145/2998181.2998353"
    },
    {
      "text": "Luca Ponzanelli, Andrea Mocci, Alberto Bacchelli, Michele Lanza, and David Fullerton. 2014. Improving low quality stack overflow post detection. In Software Maintenance and Evolution (ICSME), 2014 IEEE International Conference on, 541--544.  ",
      "doi": "10.1109/ICSME.2014.90"
    },
    {
      "text": "Yuqing Ren and Robert E Kraut. 2014. Agent based modeling to inform the design of multiuser systems. In Ways of Knowing in HCI. Springer, 395--419.",
      "doi": ""
    },
    {
      "text": "Filipe N Ribeiro, Matheus Araújo, Pollyanna Gonçalves, Marcos André Gonçalves, and Fabrício Benevenuto. 2016. Sentibench-a benchmark comparison of state-of-the-practice sentiment analysis methods. EPJ Data Science 5, 1: 1--29.",
      "doi": ""
    },
    {
      "text": "Paul R Rosenbaum and Donald B Rubin. 1984. Reducing bias in observational studies using subclassification on the propensity score. Journal of the American statistical Association 79, 387: 516--524.",
      "doi": ""
    },
    {
      "text": "Paul R Rosenbaum and Donald B Rubin. 1985. Constructing a control group using multivariate matched sampling methods that incorporate the propensity score. The American Statistician 39, 1: 33--38.",
      "doi": ""
    },
    {
      "text": "Derek Ruths and Jürgen Pfeffer. 2014. Social media for large studies of behavior. Science 346, 6213: 1063--1064.",
      "doi": ""
    },
    {
      "text": "Tom De Smedt and Walter Daelemans. 2012. Pattern for python. Journal of Machine Learning Research 13, Jun: 2063--2067. ",
      "doi": "10.5555/2503308.2343710"
    },
    {
      "text": "Greg Stoddard. 2015. Popularity Dynamics and Intrinsic Quality in Reddit and Hacker News. In ICWSM, 416--425.",
      "doi": ""
    },
    {
      "text": "Dario Taraborelli. 2015. The Sum of All Human Knowledge in the Age of Machines: A New Research Agenda for Wikimedia.",
      "doi": ""
    },
    {
      "text": "Yla R. Tausczik and James W. Pennebaker. 2011. Predicting the Perceived Quality of Online Mathematics Contributions from Users' Reputations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1885--1888.  ",
      "doi": "10.1145/1978942.1979215"
    },
    {
      "text": "Zeynep Tufekci. 2014. Big Questions for Social Media Big Data: Representativeness, Validity and Other Methodological Pitfalls. ICWSM 14: 505--514.",
      "doi": ""
    },
    {
      "text": "Claudia Wagner, David Garcia, Mohsen Jadidi, and Markus Strohmaier. 2015. It's a Man's Wikipedia? Assessing Gender Inequality in an Online Encyclopedia. In ICWSM, 454--463.",
      "doi": ""
    },
    {
      "text": "Morten Warncke-Wang, Vladislav R Ayukaev, Brent Hecht, and Loren G Terveen. 2015. The success and failure of quality improvement projects in peer production communities. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing, 743--756.  ",
      "doi": "10.1145/2675133.2675241"
    },
    {
      "text": "Morten Warncke-Wang, Vivek Ranjan, Loren G Terveen, and Brent J Hecht. 2015. Misalignment Between Supply and Demand of Quality Content in Peer Production Communities. In ICWSM, 493--502.",
      "doi": ""
    },
    {
      "text": "Robert West, Ingmar Weber, and Carlos Castillo. 2012. Drawing a data-driven portrait of Wikipedia editors. In Proceedings of the Eighth Annual International Symposium on Wikis and Open Collaboration, 3.  ",
      "doi": "10.1145/2462932.2462937"
    },
    {
      "text": "Eric Yeh, Daniel Ramage, Christopher D Manning, Eneko Agirre, and Aitor Soroa. 2009. WikiWalk: random walks on Wikipedia for semantic relatedness. In Proceedings of the 2009 Workshop on Graph-based Methods for Natural Language Processing, 41--49. ",
      "doi": "10.5555/1708124.1708133"
    },
    {
      "text": "Haiyi Zhu, Robert E. Kraut, and Aniket Kittur. 2014. The Impact of Membership Overlap on the Survival of Online Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 281--290.  ",
      "doi": "10.1145/2556288.2557213"
    },
    {
      "text": "Haiyi Zhu, Robert E Kraut, Yi-Chia Wang, and Aniket Kittur. 2011. Identifying shared leadership in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3431--3434.  ",
      "doi": "10.1145/1978942.1979453"
    },
    {
      "text": "Haiyi Zhu, Robert Kraut, and Aniket Kittur. 2012. Effectiveness of shared leadership in online communities. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, 407--416.  ",
      "doi": "10.1145/2145204.2145269"
    },
    {
      "text": "Haiyi Zhu, Amy Zhang, Jiping He, Robert E Kraut, and Aniket Kittur. 2013. Effects of peer feedback on contribution: a field experiment in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2253--2262.  ",
      "doi": "10.1145/2470654.2481311"
    },
    {
      "text": "2017. OSSM17: Observational Studies Through Social Media.",
      "doi": ""
    },
    {
      "text": "Google turning its lucrative web search over to AI machines - Livemint. Retrieved from http://www.livemint.com/Companies/lPlpcKo53YICXV0ZvF2F7K/Google-turning-its-lucrative-web-search-over-to-AI-machines.html",
      "doi": ""
    },
    {
      "text": "Reddit worth $1.8 billion. Retrieved from https://www.cnbc.com/2017/07/31/reddit-worth-1-point-8-billion.html",
      "doi": ""
    },
    {
      "text": "Stack Exchange, a site for software developers, raises $40 million | Fortune.com. Retrieved from http://fortune.com/2015/01/20/stack-exchange-40-million/",
      "doi": ""
    },
    {
      "text": "Google BigQuery. Retrieved from https://bigquery.cloud.google.com/dataset/bigquery-public-data:stackoverflow",
      "doi": ""
    },
    {
      "text": "reddit.com: api documentation. Retrieved from https://www.reddit.com/dev/api/",
      "doi": ""
    },
    {
      "text": "Today I Learned (TIL). Retrieved from https://www.reddit.com/r/todayilearned/",
      "doi": ""
    },
    {
      "text": "Wikipedia:WikiProject Wikipedia/Assessment - Wikipedia. Retrieved from https://en.wikipedia.org/wiki/Wikipedia:WikiProject_Wikipedia/Assessment",
      "doi": ""
    },
    {
      "text": "Artificial intelligence service \"ORES\" gives Wikipedians X-ray specs to see through bad edits -- Wikimedia Blog. Retrieved July 17, 2017 from https://blog.wikimedia.org/2015/11/30/artificial-intelligence-x-ray-specs/",
      "doi": ""
    },
    {
      "text": "Template:Grading scheme - Wikipedia. Retrieved from https://en.wikipedia.org/wiki/Template:Grading_scheme",
      "doi": ""
    },
    {
      "text": "Causal Inference in Python - Causalinference 0.1.2 documentation. Retrieved from http://causalinferenceinpython.org/",
      "doi": ""
    },
    {
      "text": "Reddit's plan to become a real business could fall apart pretty easily - Recode. Retrieved from https://www.recode.net/2016/4/28/11586522/reddit-advertising-sales-plans",
      "doi": ""
    },
    {
      "text": "Reddit Gold Counter - How much is reddit making from reddit gold. Retrieved from http://gold.reddit-stream.com/gold/table",
      "doi": ""
    },
    {
      "text": "Ad Banners - Developer Advertising Solutions | Advertise on Stack Overflow. Retrieved from https://www.stackoverflowbusiness.com/advertise/solutions/ad-banners",
      "doi": ""
    },
    {
      "text": "IAB Study Says 26% of Desktop Users Turn On Ad Blockers -- Adweek. Retrieved from http://www.adweek.com/digital/iab-study-says-26-desktop-users-turn-ad-blockers-172665/",
      "doi": ""
    },
    {
      "text": "Book a campaign | Stack Exchange Self-Serve. Retrieved from https://www.selfserve-stackexchange.com/",
      "doi": ""
    },
    {
      "text": "Wikipedia:Statistics - Wikipedia. Retrieved from https://en.wikipedia.org/wiki/Wikipedia:Statistics",
      "doi": ""
    }
  ]
}