{
  "doi": "10.1145/3173574.3174185",
  "title": "Investigating Perceptual Congruence between Data and Display Dimensions in Sonification",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "The relationships between sounds and their perceived meaning and connotations are complex, making auditory perception an important factor to consider when designing sonification systems. Listeners often have a mental model of how a data variable should sound during sonification and this model is not considered in most data:sound mappings. This can lead to mappings that are difficult to use and can cause confusion. To investigate this issue, we conducted a magnitude estimation experiment to map how roughness, noise and pitch relate to the perceived magnitude of stress, error and danger. These parameters were chosen due to previous findings which suggest perceptual congruency between these auditory sensations and conceptual variables. Results from this experiment show that polarity and scaling preference are dependent on the data:sound mapping. This work provides polarity and scaling values that may be directly utilised by sonification designers to improve auditory displays in areas such as accessible and mobile computing, process-monitoring and biofeedback.",
  "authors": [
    {
      "name": "Jamie Ferguson",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659218118",
      "orcid": "missing"
    },
    {
      "name": "Stephen A. Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    }
  ],
  "references": [
    {
      "text": "Janet Anderson. 2005. Creating an empirical framework for sonification design. In ICAD 2005, Proceedings of the International Conference on Auditory Display. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Luc H Arnal, Adeen Flinker, Andreas Kleinschmidt, Anne-Lise Giraud, and David Poeppel. 2015. Human screams occupy a privileged niche in the communication soundscape. Current Biology 25, 15 (2015), 2051--2056.",
      "doi": ""
    },
    {
      "text": "Stephen Barrass. 1998. Some golden rules for designing auditory displays. in Csound Textbook, B. Vercoe and R. Boulanger, eds., MIT Press, Cambridge, Mass (1998).",
      "doi": ""
    },
    {
      "text": "Penny Bergman, Anders Sköld, Daniel Västfjäll, and Niklas Fransson. 2009. Perceptual and emotional categorization of sound. The Journal of the Acoustical Society of America 126, 6 (2009), 3156--3167.",
      "doi": ""
    },
    {
      "text": "Sara Bly. 1982. Presenting information in sound. In Proceedings of the 1982 conference on Human factors in computing systems. ACM, 371--375.  ",
      "doi": "10.1145/800049.801814"
    },
    {
      "text": "Stephen Brewster. 2002. Overcoming the lack of screen space on mobile computers. Personal and Ubiquitous Computing 6, 3 (2002), 188--205.  ",
      "doi": "10.1007/s007790200019"
    },
    {
      "text": "Stephen Anthony Brewster. 1994. Providing a structured method for integrating non-speech audio into human-computer interfaces. Ph.D. Dissertation. University of York York, UK.",
      "doi": ""
    },
    {
      "text": "Lorna M Brown, Stephen A Brewster, and Helen C Purchase. 2006. Multidimensional tactons for non-visual information presentation in mobile devices. In Proceedings of the 8th conference on Human-computer interaction with mobile devices and services. ACM, 231--238.  ",
      "doi": "10.1145/1152215.1152265"
    },
    {
      "text": "Michael Czaplik, Rolf Rossaint, Julia Kaliciak, Andreas Follmann, Sabine Kirfel, Roman Scharrer, Martin Guski, Michael Vorländer, Gernot Marx, and Mark Coburn. 2016. Psychoacoustic analysis of noise and the application of earplugs in an ICU: A randomised controlled clinical trial. European Journal of Anaesthesiology (EJA) 33, 1 (2016), 14--21.",
      "doi": ""
    },
    {
      "text": "Guo-Qing Di, Xing-Wang Chen, Kai Song, Bing Zhou, and Chun-Ming Pei. 2016. Improvement of Zwicker's psychoacoustic annoyance model aiming at tonal noises. Applied Acoustics 105 (2016), 164--170.",
      "doi": ""
    },
    {
      "text": "Wanda L. Diaz-Merced, Robert M. Candey, John C. Mannone, David Fields, and Emilio Rodriguez. 2008. Sonification for the Analysis of Plasma Bubbles at 21 MHz. Sun and Geosphere 3, 1 (2008), 42--54.",
      "doi": ""
    },
    {
      "text": "Gaël Dubus and Roberto Bresin. 2013. A systematic review of mapping strategies for the sonification of physical quantities. PloS one 8, 12 (2013), e82491.",
      "doi": ""
    },
    {
      "text": "Hugo Fastl. 1998. Psychoacoustics and sound quality metrics. In INTER-NOISE and NOISE-CON Congress and Conference Proceedings, Vol. 1998. Institute of Noise Control Engineering, 3--10.",
      "doi": ""
    },
    {
      "text": "Jamie Ferguson and Stephen A Brewster. 2017. Evaluation of Psychoacoustic Sound Parameters for Sonification. In Proceedings of the 19th ACM International Conference on Multimodal Interaction-ICMI 2017. ACM Press, 120--127.  ",
      "doi": "10.1145/3136755.3136783"
    },
    {
      "text": "Sam Ferguson, Densil Cabrera, Kirsty Beilharz, and Hong-Jun Song. 2006. Using psychoacoustical models for information sonification. In ICAD 2006, Proceedings of the International Conference on Auditory Display. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "W Tecumseh Fitch and Gregory Kramer. 1994. Sonifying the body electric: Superiority of an Auditory Over a Visual Display in a Complex, Multivariate System. In Santa Fe Institute Studies in the Science of Complexity, Vol. 18. Addison-Wesley Publishing Co., 307--307.",
      "doi": ""
    },
    {
      "text": "D. Gentner. 2001. Mental Models, Psychology of. In International Encyclopedia of the Social & Behavioral Sciences. Pergamon, 9683 -- 9687.",
      "doi": ""
    },
    {
      "text": "Jason Harris, Sarah Vance, Odair Fernandes, Avinash Parnandi, and Ricardo Gutierrez-Osuna. 2014. Sonic respiration: controlling respiration rate through auditory biofeedback. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 2383--2388.  ",
      "doi": "10.1145/2559206.2581233"
    },
    {
      "text": "Christoph Henkelmann. 2007. Improving the aesthetic quality of realtime motion data sonification. Computer Graphics Technical Report CG-2007--4. University of Bonn (2007).",
      "doi": ""
    },
    {
      "text": "Thomas Hermann, Andy Hunt, and John G Neuhoff. 2011. The Sonification Handbook. Logos Verlag Berlin.",
      "doi": ""
    },
    {
      "text": "Bennett Hogg and Paul Vickers. 2006. Sonification abstraite/sonification concrete: An'aesthetic persepctive space'for classifying auditory displays in the ars musica domain. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Yu Huang and Weikang Jiang. 2017. The effect of exposure duration on the subjective discomfort of aircraft cabin noise. Ergonomics 60, 1 (2017), 18--25.",
      "doi": ""
    },
    {
      "text": "Phil N Johnson-Laird, Olivia E Kang, and Yuan Chang Leong. 2012. On musical dissonance. Music Perception: An Interdisciplinary Journal 30, 1 (2012), 19--35.",
      "doi": ""
    },
    {
      "text": "Alan Kan, Ruth Y Litovsky, and Matthew J Goupell. 2015. Effects of interaural pitch-matching and auditory image centering on binaural sensitivity in cochlear-implant users. Ear and hearing 36, 3 (2015), e62.",
      "doi": ""
    },
    {
      "text": "Johan Kildal and Stephen A Brewster. 2006. Non-visual overviews of complex data sets. In CHI'06 Extended Abstracts on Human Factors in Computing Systems. ACM, 947--952.  ",
      "doi": "10.1145/1125451.1125634"
    },
    {
      "text": "Sylvan Kornblum, Thierry Hasbroucq, and Allen Osman. 1990. Dimensional overlap: cognitive basis for stimulus-response compatibility--a model and taxonomy. Psychological review 97, 2 (1990), 253.",
      "doi": ""
    },
    {
      "text": "Gregory Kramer. 1994. Some organizing principles for representing data with sound. Auditory Display-Sonification, Audification, and Auditory Interfaces (1994), 185--221.",
      "doi": ""
    },
    {
      "text": "G Kramer, BN Walker, T Bonebright, P Cook, J Flowers, N Miner, J Neuhoff, R Bargar, S Barrass, J Berger, and others. 1999. The sonification report: Status of the field and research agenda. report prepared for the national science foundation by members of the international community for auditory display. International Community for Auditory Display (ICAD), Santa Fe, NM (1999).",
      "doi": ""
    },
    {
      "text": "Lawrence E Marks and George A Gescheider. 2002. Psychophysical scaling. Stevens' handbook of experimental psychology (2002).",
      "doi": ""
    },
    {
      "text": "John G Neuhoff and Laurie M Heller. 2005. One small step: Sound sources and events as the basis for auditory graphs. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "JMS Pearce. 2005. Selected observations on amusia. European neurology 54, 3 (2005), 145--148.",
      "doi": ""
    },
    {
      "text": "Irwin Pollack and Lawrence Ficks. 1954. Information of elementary multidimensional auditory displays. The Journal of the Acoustical Society of America 26, 2 (1954), 155--158.",
      "doi": ""
    },
    {
      "text": "Robert D Sorkin. 1988. Why are people turning off our alarms? The Journal of the Acoustical Society of America 84, 3 (1988), 1107--1108.",
      "doi": ""
    },
    {
      "text": "Stanley S Stevens. 1955. The measurement of loudness. The Journal of the Acoustical Society of America 27, 5 (1955), 815--829.",
      "doi": ""
    },
    {
      "text": "Paul Strohmeier and Kasper Hornbæk. 2017. Generating Haptic Textures with a Vibrotactile Actuator. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4994--5005.  ",
      "doi": "10.1145/3025453.3025812"
    },
    {
      "text": "Robert Teghtsoonian, SS Stevens, and Geraldine Stevens. 1975. Psychophysics: Introduction to Its Perceptual, Neural, and Social Prospects. The American Journal of Psychology 88, 4 (1975), 677.",
      "doi": ""
    },
    {
      "text": "A Väljamäe, T Steffert, S Holland, X Marimon, R Benitez, S Mealla, A Oliveira, and S Jordà. 2013. A review of real-time EEG sonification research. In ICAD 2013-Proceedings of the International Conference on Auditory Display. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Bruce N. Walker. 2002. Magnitude Estimation of Conceptual Data Dimensions for Use in Sonification. Journal of Experimental Psychology: Applied 8, 4 (2002), 211--221.",
      "doi": ""
    },
    {
      "text": "Bruce N Walker. 2007. Consistency of magnitude estimations with conceptual data dimensions used for sonification. Applied Cognitive Psychology 21, 5 (2007), 579--599.",
      "doi": ""
    },
    {
      "text": "Bruce N Walker and Addie Ehrenstein. 2000. Pitch and pitch change interact in auditory displays. Journal of Experimental Psychology: Applied 6, 1 (2000), 15.",
      "doi": ""
    },
    {
      "text": "Bruce N Walker and Gregory Kramer. 1996. Mappings and Metaphors in Auditory Displays: An Experimental Assessment. In ICAD 1996, Proceedings of the International Conference on Auditory Display. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Bruce N Walker and Gregory Kramer. 2004. Ecological psychoacoustics and auditory displays: Hearing, grouping, and meaning making. Ecological psychoacoustics (2004), 150--175.",
      "doi": ""
    },
    {
      "text": "Bruce N Walker and Gregory Kramer. 2005. Mappings and metaphors in auditory displays: An experimental assessment. ACM Transactions on Applied Perception (TAP) 2, 4 (2005), 407--412.  ",
      "doi": "10.1145/1101530.1101534"
    },
    {
      "text": "Bruce N Walker, Gregory Kramer, and David M Lane. 2000. Psychophysical scaling of sonification mappings. In ICAD 2000, Proceedings of the International Conference on Auditory Display. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Bruce N Walker and David M Lane. 1996. Psychophysical Scaling of Sonification Mappings: A Comparison of Visually Impaired and Sighted Listeners. In ICAD 2001, Proceedings of the International Conference on Auditory Display. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Nigel Warren, Matt Jones, Steve Jones, and David Bainbridge. 2005. Navigation via continuously adapted music. In CHI'05 extended abstracts on Human factors in computing systems. ACM, 1849--1852.  ",
      "doi": "10.1145/1056808.1057038"
    },
    {
      "text": "John Williamson, Roderick Murray-Smith, and Stephen Hughes. 2007. Shoogle: excitatory multimodal interaction on mobile devices. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 121--124.  ",
      "doi": "10.1145/1240624.1240642"
    },
    {
      "text": "Philip Sanford Zeskind and Victoria Collins. 1987. Pitch of infant crying and caregiver responses in a natural setting. Infant Behavior and Development 10, 4 (1987), 501--504.",
      "doi": ""
    },
    {
      "text": "Eberhard Zwicker and Hugo Fastl. 2013. Psychoacoustics: Facts and models. Vol. 22. Springer Science & Business Media.",
      "doi": ""
    }
  ]
}