{
  "doi": "10.1145/3173574.3173742",
  "title": "What Makes an Automated Vehicle a Good Driver?",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "An automated vehicle needs to learn how human road users experience the intentions of other drivers and understand how they communicate with each other in order to avoid misunderstandings and prevent giving a negative external image during interactions. The aim of the present study is to identify a cooperative lane change indication which other drivers understand unambiguously and prefer when it comes to lane change announcements in a dense traffic situation on the highway. A fixed-base driving simulator study is conducted with N = 66 participants in Germany in a car-following scenario. Participants rated, from the lag driver's perspective, different lane change announcements of another driver which varied in lateral movements (i.e., duration, lateral offset). Main findings indicate that a medium offset and moderate duration of lateral movement is experienced as most cooperative. The results are crucial for the development of lane change strategies for automated vehicles.",
  "authors": [
    {
      "name": "Nina Kauffmann",
      "institution": "BMW Group, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260727",
      "orcid": "missing"
    },
    {
      "name": "Franz Winkler",
      "institution": "BMW Group, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260720",
      "orcid": "missing"
    },
    {
      "name": "Mark Vollrath",
      "institution": "Technical University of Braunschweig, Braunschweig, Lower Saxony, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490692825",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Steinle A. Neukum, T. Lübbeke, H.-P. Krüger, C. Mayser. 2008. ACC Stop&Go: Fahrerverhalten an funktionalen Systemgrenzen. ACC Stop&Go: Fahrerverhalten an funktionalen Systemgrenzen, Workshop Fahrassistenzsysteme, 141--150.",
      "doi": ""
    },
    {
      "text": "Kazi Iftekhar Ahmed. 1999. Modeling Drivers Acceleration and Lane Changing Behavior. Retrieved from http://hdl.handle.net/1721.1/9662.",
      "doi": ""
    },
    {
      "text": "Lawrence Barr and Wassim Najm. 2001. Crash Problem Characteristics for the Intelligent Vehicle Initiative. Transportation Research Board 80th Annual Meeting, 30.",
      "doi": ""
    },
    {
      "text": "Matthias Beggiato and Josef F. Krems. 2013. The evolution of mental model, trust and acceptance of adaptive cruise control in relation to initial information. Transportation Research Part F: Traffic Psychology and Behaviour 18: 47--57.",
      "doi": ""
    },
    {
      "text": "Ahmed Benmimoun, Dirk Neunzig, and Christian Maag. 2004. Effizienzsteigerung durch professionelles/partnerschaftliches Verhalten im Straßenverkehr. FAT-Schriftenreihe 181, Forschungsvereinigung Automobiltechnik e.V.",
      "doi": ""
    },
    {
      "text": "Sharon S. Brehm and Jack W. Brehm. 2013. Psychological Reactance: a Theory of Freedom and Control. Elsevier Science.",
      "doi": ""
    },
    {
      "text": "Karel A. Brookhuis and Dick Waard de. 2006. Consequences of Automation for Driver Behaviour and Acceptance. Iea 2006 November: 8.",
      "doi": ""
    },
    {
      "text": "Charisma Farheen Choudhury. 2005. Modeling Lane-changing Behavior in Presence of Exclusive Lanes. University of California, Berkeley 2002: 122.",
      "doi": ""
    },
    {
      "text": "Charisma Farheen Choudhury. 2007. Modeling Driving Decisions with Latent Plans. Environmental Engineering 2002: 238.",
      "doi": ""
    },
    {
      "text": "John Chovan, Louis Tijerina, Graham Alexander, and Donald Hendricks. 1994. Examination of Lane Change Crashes and Potential IVHS Countermeasures. Cambridge.",
      "doi": ""
    },
    {
      "text": "Frederic Christens and Qihui Huang. 2008. Das Fahrermodell im Verkehrsflusssumilationsprogramm PELOPS Modellierung und Applikationsmöglichkeiten. Fahrermodellierung in Wissenschaft und Wirtschaft: 2. Berliner Fachtagung Fahrermodellierung, 19. - 20. Juni 2008: 128--144.",
      "doi": ""
    },
    {
      "text": "John Dawes. 2008. Do data characteristics change according to the number of scale points used? An experiment using 5-point, 7-point and 10-point scales. International Journal of Market Research 50, 1: 61--104.",
      "doi": ""
    },
    {
      "text": "U. Dogan, H. Edelbrunner, and I. Iossifidis. 2008. Towards a Driver Model: Preliminary Study of Lane Change Behavior. 2008 11th International IEEE Conference on Intelligent Transportation Systems: 931--937.",
      "doi": ""
    },
    {
      "text": "Dirk Ehmanns. 2001. Simulation model of human lane change behaviour. Der Fahrer im 21. Jahrhundert: Tagung Berlin, 3. und 4. Mai 2001, DI-Gesellschaft Fahrzeug- und Verkehrstechnik, 203--216.",
      "doi": ""
    },
    {
      "text": "Dieter Ellinghaus. 1986. Rücksichtslosigkeit und Partnerschaft. Eine sozialpsychologische Untersuchung über den Umgang unter Kraftfahrern im Straßenverkehr. IFAPLAN, Köln.",
      "doi": ""
    },
    {
      "text": "Berthold Färber. 2015. Kommunikationsprobleme zwischen autonomen Fahrzeugen und menschlichen Fahrern. In Autonomes Fahren. Springer Berlin Heidelberg, Berlin, Heidelberg, 127--146.",
      "doi": ""
    },
    {
      "text": "Charles L. Folk, Roger W. Remington, and James C. Johnston. 1992. Involuntary covert orienting is contingent on attentional control settings. Journal of Experimental Psychology: Human Perception and Performance 18, 4: 1030--1044.",
      "doi": ""
    },
    {
      "text": "Alexander Frey. 2016. Statischer und dynamischer Fahrsimulator im Vergleich -- Wahrnehmung von Abstand und Geschwindigkeit. Carl Schünemann Verlag .",
      "doi": ""
    },
    {
      "text": "P.G. Gipps. 1985. A model for the structure of lanechanging decisions. Transportation Research Part B 20, 5: 403--414.",
      "doi": ""
    },
    {
      "text": "Riender Happee, Christian Gold, Jonas Radlmayr, Sebastian Hergeth, and Klaus Bengler. 2017. Takeover performance in evasive manoeuvres. Accident Analysis and Prevention 106, October 2016: 211-- 222.",
      "doi": ""
    },
    {
      "text": "O. Heller. 1985. Hörfeldaudiometrie mit dem Verfahren der Kategorienunterteilung (KU). Psychologische Beiträge 27: 478--493.",
      "doi": ""
    },
    {
      "text": "Matthias, Johannes Henning, O. Georgeon, and Josef.F. Krems. 2007. The quality of behavioral and environmental indicators used to infer the intention to change lanes. Proc. of the 4th International Driving Symposium on Human Factors in Driver Assessment, Training and Vehicle Design: 231--237.",
      "doi": ""
    },
    {
      "text": "Peter Hidas. 2002. Modelling lange changing and merging in microscopic traffic simulation. Transportation Research C 10, 5+6: 351--371.",
      "doi": ""
    },
    {
      "text": "Peter Hidas. 2005. Modelling vehicle interactions in microscopic simulation of merging and weaving. Transportation Research Part C: Emerging Technologies 13, 1: 37--62.",
      "doi": ""
    },
    {
      "text": "Kevin Anthony Hoff and Masooda Bashir. 2015. Trust in Automation. Human Factors 57, 3: 407-- 434.",
      "doi": ""
    },
    {
      "text": "Daniel Howard. 2014. Public Perceptions of Selfdriving Cars: The Case of Berkeley, California. MS Transportation Engineering 2014, 1: 21.",
      "doi": ""
    },
    {
      "text": "Edward E. Jones and Richard E. Nisbett. 1972. The actor and the observer: Divergent perceptions of the causes of behavior. Attribution: Perceiving the causes of behavior, 79--94.",
      "doi": ""
    },
    {
      "text": "Nina Kauffmann and Mark Vollrath (submitted). Making a good impression- An attempt to objectify the outward image of the driver while lane changing in dense traffic. Transportation Research Part F: Traffic Psychology and Behaviour.",
      "doi": ""
    },
    {
      "text": "Moritz Körber, Christian Gold, David Lechner, and Klaus Bengler. 2016. The influence of age on the take-over of vehicle control in highly automated driving. Transportation Research Part F: Traffic Psychology and Behaviour 39: 19--32.",
      "doi": ""
    },
    {
      "text": "Miltos Kyriakidis, Riender Happee, and Joost De Winter. 2015. Public opinion on automated driving: Results of an international questionnaire among 5000 respondents. Transportation Research Part F: Traffic Psychology and Behaviour 32, July: 127-- 140.",
      "doi": ""
    },
    {
      "text": "David R. Large, Gary Burnett, Andrew Morris, Arun Muthumani, and Rebecca Matthias. 2018. A Longitudinal Simulator Study to Explore Drivers' Behaviour During Highly-Automated Driving. In Proceedings of the AHFE 2017 International Conference on Human Factors in Transportation. Springer, 583--594.",
      "doi": ""
    },
    {
      "text": "Christian. Maag. 2004. Fahrer und Verkehrsklima: eine verkehrswissenschaftliche Untersuchung zu den Ursachen und Folgen von Emotionen im Strassenverkehr. Fortschritt-Berichte VDI. Reihe 22, Mensch-Maschine-Systeme, Nr. 18.",
      "doi": ""
    },
    {
      "text": "D. Harrison Mcknight, Michelle Carter, Jason Bennett Thatcher, and Paul F. Clay. 2011. Trust in a specific technology: An investigation in its components and measures. ACM Transactions on Management Information Systems 2, 2: 1--12.  ",
      "doi": "10.1145/1985347.1985353"
    },
    {
      "text": "Klaus Merten. 1977. Kommunikationsprozesse im Straßenverkehr. In Symposium Unfallforschung und Verkehrssicherheit 1977=Schriftenreihe Unfallund Sicherheitsforschung Straßenverkehr. Bundesminister für Verkehr, 115--126.",
      "doi": ""
    },
    {
      "text": "Michael. A. Nees. 2016. Acceptance of Self-driving Cars: An Examination of Idealized versus Realistic Portrayals with a Self- driving Car Acceptance Scale. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 60, 1: 1449-- 1453.",
      "doi": ""
    },
    {
      "text": "Eric C.B. Olsen. 2003. Modeling slow lead vehicle lane changing. Ph.D. Thesis. Retrieved from http://scholar.lib.vt.edu/theses/available/etd12032003--152916/.",
      "doi": ""
    },
    {
      "text": "Harold Pashler, James C. Johnston, and Eric Ruthruff. 2001. Attention and Performance. Annual Review of Psychology 52, 1: 629--651.",
      "doi": ""
    },
    {
      "text": "Mizanur Rahman, Mashrur Chowdhury, Yuanchang Xie, and Yiming He. 2013. Review of microscopic lane-changing models and future research opportunities. IEEE Transactions on Intelligent Transportation Systems 14, 4: 1942--1956.  ",
      "doi": "10.1109/TITS.2013.2272074"
    },
    {
      "text": "Tobias Rehder, N Maas, L Louis, and D Schramm. 2016. Merkmalselektion zur Prädiktion von Motivationsbasiertem Fahrverhalten. Nationale und internationale Trends in der Mobilität: 201--215.",
      "doi": ""
    },
    {
      "text": "Tobias Rehder, Wolfgang Muenst, Lawrence Louis, and Dieter Schramm. 2016. Learning Lane Change Intentions through Lane Contentedness Estimation from Demonstrated Driving. IEEE Conference on Intelligent Transportation Systems, Proceedings, ITSC, IEEE, 893--898.",
      "doi": "10.1109/ITSC.2016.7795661"
    },
    {
      "text": "Ralf Risser. 1987. Kommunikation und Kultur des Straßenverkehrs. Literas Ges.m.b.H., Universitäts-, Buch- und Zeitschriftenverlag.",
      "doi": ""
    },
    {
      "text": "Christina Rödel, Susanne Stadler, Alexander Meschtscherjakov, and Manfred Tscheligi. 2014. Towards Autonomous Cars: The Effect of Autonomy Levels on Acceptance and User Experience. Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: 1--8.  ",
      "doi": "10.1145/2667317.2667330"
    },
    {
      "text": "Dirk Rothenbucher, Jamy Li, David Sirkin, Brian Mok, and Wendy Ju. 2016. Ghost driver: A field study investigating the interaction between pedestrians and driverless vehicles. 25th IEEE International Symposium on Robot and Human Interactive Communication, RO-MAN 2016, 795-- 802.",
      "doi": "10.1109/ROMAN.2016.7745210"
    },
    {
      "text": "Brandon Schoettle and Michael Sivak. 2014. A survey of public opinion about autonomous and self-driving vehicles in the U.S., the U.K., and Australia. University of Michigan, Ann Arbor, Transportation Research Institute",
      "doi": ""
    },
    {
      "text": "Martin H. Strobl. 2003. SPIDER - The innovative software framework of the BMW driving simulation. Simulation und Simulatoren Mobilitaet virtuell gestalten. Tagung der VDIGesellschaft Fahrzeug- und Verkehrstechnik in Hamburg, 15. und 16. April 2003, VDI Verlag, 303--320.",
      "doi": ""
    },
    {
      "text": "Sukhan Lee, Woong Kwon, and Jae-Won Lee. 1999. A vision based lane departure warning system. Proceedings 1999 IEEE/RSJ International Conference on Intelligent Robots and Systems. Human and Environment Friendly Robots with High Intelligence and Emotional Quotients (Cat. No.99 CH36289) 1: 160--165.",
      "doi": ""
    },
    {
      "text": "Gail M. Sullivan and Richard Feinn. 2012. Using Effect Size-or Why the P Value Is Not Enough. Journal of graduate medical education 4, 3: 279-- 82.",
      "doi": ""
    },
    {
      "text": "Christopher D. Wickens, Juliana Goh, John Helleberg, William J. Horrey, and Donald A. Talleur. 2003. Attentional Models of Multitask Pilot Performance Using Advanced Display Technology. Human Factors: The Journal of the Human Factors and Ergonomics Society 45, 3: 360--380.",
      "doi": ""
    },
    {
      "text": "Claudia Witzlack, Matthias Beggiato, and Josef Krems. 2016. Interaktionssequenzen zwischen Fahrzeugen und Fußgängern im Parkplatzszenario als Grundlage für kooperativ interagierende Automatisierung. Fahrerassistenz und automatisiertes Fahren. VDI-Berichte 2288, VDI Verlag, 323--336.",
      "doi": ""
    },
    {
      "text": "Jeremy M. Wolfe. 1994. Guided Dearch 2.0. a Revisited Model of Visual Search. Psychonomic Bulletin & Review 1, 2: 202--238.",
      "doi": ""
    },
    {
      "text": "R.D. Worrall and A.G.R Bullen. 1970. An Empirical Analysis of Lane Changing On Multilane Highways. Highway Research Record 303: 30--43.",
      "doi": ""
    }
  ]
}