{
  "doi": "10.1145/3173574.3173926",
  "title": "The Unexpected Entry and Exodus of Women in Computing and HCI in India",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "In India, women represent 45% of total computer science enrollment in universities, almost three times the rate in the United States, where it is 17%. At the same time, women make up an estimated 25-30% of the HCI community in India, half the rate in the U.S. We investigate the complexities of these surprising phenomena through qualitative research of Indian computer science and human-computer interaction researchers and professionals at various life stages. We find among other things that Indian familial norms play a significant role in pressuring young women into computing as a field; that familial pressures and workplace discrimination then cause a precipitous exit of women from computing at the onset of marriage; and that HCI occupies an interstitial space between art and technology that affects women's careers. Our findings underscore the societal influence on women's representation in the tech sector and invite further participation by the HCI community in related questions.",
  "tags": [
    "hci",
    "india",
    "computer science",
    "stem",
    "ictd",
    "gender",
    "it",
    "education",
    "hci4d"
  ],
  "authors": [
    {
      "name": "Divy Thakkar",
      "institution": "Google Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261997",
      "orcid": "missing"
    },
    {
      "name": "Nithya Sambasivan",
      "institution": "Google Inc., Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81350582954/rel-imgonly/nithya_coorg.jpg",
      "acmid": "81350582954",
      "orcid": "missing"
    },
    {
      "name": "Purva Kulkarni",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260414",
      "orcid": "missing"
    },
    {
      "name": "Pratap Kalenahalli Sudarshan",
      "institution": "Google Inc., Bangalore, Karnataka, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261389",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "2017 (accessed December 30, 2017). The Global Gender Gap Report 2017. Technical Report. World Economic Forum. https://goo.gl/SEoSJt.",
      "doi": ""
    },
    {
      "text": "Emmaneul Amberber. In 2016, $4 billion invested in Indian startups =https://goo.gl/5k7weK, month = December, year = 2016.",
      "doi": ""
    },
    {
      "text": "The World Bank. 2016. Labor force participation rate, female. (2016). https://goo.gl/rFRWkQ.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell, Elizabeth Churchill, Jeffrey Bardzell, Jodi Forlizzi, Rebecca Grinter, and Deborah Tatar. 2011. Feminism and interaction design. In CHI'11 Extended Abstracts on Human Factors in Computing Systems. ACM, 1--4.  ",
      "doi": "10.1145/1979742.1979587"
    },
    {
      "text": "Greg Baumann. Google cracks Silicon Valley's wall of silence on workforce diversity, confirming that it is largely white and male = https://goo.gl/J2Ff1c, month = May, year = 2014.",
      "doi": ""
    },
    {
      "text": "Francis Bloch, Vijayendra Rao, and Sonalde Desai. 2004. Wedding celebrations as conspicuous consumption signaling social status in rural India. Journal of Human Resources 39, 3 (2004), 675--695.",
      "doi": ""
    },
    {
      "text": "Stephen J. Ceci, Donna K. Ginther, Shulamit Kahn, and Wendy M. Williams. 2014. Women in Academic Science. Psychological Science in the Public Interest 15, 3 (2014), 75--141. PMID: 26172066.",
      "doi": ""
    },
    {
      "text": "Chakreview. \"2017 (accessed August 31, 2017)\". Top 10 Highest Paying Jobs in India. https://goo.gl/YHsrgK.",
      "doi": ""
    },
    {
      "text": "Mona Chalabi. \"2017 (accessed August 31, 2017)\". Internationally, Women Still Spend More Time Doing Chores Housework. https://goo.gl/dqjVCz.",
      "doi": ""
    },
    {
      "text": "Maria Charles and Karen Bradley. 2009. Indulging our gendered selves? Sex segregation by field of study in 44 countries. American journal of sociology 114, 4 (2009), 924--976.",
      "doi": ""
    },
    {
      "text": "Sapna Cheryan, Allison Master, and Andrew N Meltzoff. 2015. Cultural stereotypes as gatekeepers: increasing girls Z interest in computer science and engineering by diversifying stereotypes. Frontiers in psychology 6 (2015).",
      "doi": ""
    },
    {
      "text": "J McGrath Cohoon, Zhen Wu, and Jie Chao. 2009. Sexism: toxic to women's persistence in CSE doctoral programs. In ACM SIGCSE Bulletin, Vol. 41. ACM, 158--162.  ",
      "doi": "10.1145/1539024.1508924"
    },
    {
      "text": "Shelley J Correll. 2004. Constraints into preferences: Gender, status, and emerging career aspirations. American sociological review 69, 1 (2004), 93--113.",
      "doi": ""
    },
    {
      "text": "Ruth Schwartz Cowan. 1983. More work for mother: The ironies of household technology from the open hearth to the microwave. Vol. 5131. Basic Books.",
      "doi": ""
    },
    {
      "text": "Sonali Das, Sonali Jain-Chandra, Kalpana Kochhar, and Naresh Kumar. 2015. Women workers in India: why so few among so many? (2015).",
      "doi": ""
    },
    {
      "text": "Deloitte. Women in IT jobs: it is about education, but also about more than just education =https://goo.gl/XDEY8n, year = 2016.",
      "doi": ""
    },
    {
      "text": "Susan M Dray, Daniela K Busse, Anke Marei Brock, Anicia N Peters, Shaowen Bardzell, Allison Druin, Margaret M Burnett, Elizabeth F Churchill, Gayna Williams, Karen Holtzblatt, and others. 2014. Perspectives on gender and product design. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 53--56.  ",
      "doi": "10.1145/2559206.2559218"
    },
    {
      "text": "Susan M Dray, Anicia N Peters, Anke M Brock, Andrea Peer, Allison Druin, Shikoh Gitau, Janaki Kumar, and Dianne Murray. 2013. Leveraging the progress of women in the HCI field to address the diversity chasm. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 2399--2406.  ",
      "doi": "10.1145/2468356.2468785"
    },
    {
      "text": "Maya Escueta, Tushar Saxena, and Varun Aggarwal. 2013 (accessed August 20, 2017). Women in Engineering:A comparative study of barriers across Nations. Technical Report. Aspiring Minds India. https://goo.gl/kVLVEh.",
      "doi": ""
    },
    {
      "text": "Henry Etzkowitz, Carol Kemelgor, Michael Neuschatz, and Brian Uzzi. 1992. Athena unbound: Barriers to women in academic science and engineering. Science and Public Policy 19, 3 (1992), 157--179.",
      "doi": ""
    },
    {
      "text": "Susan Kolker Finkel and Steven G Olswang. 1996. Child rearing as a career impediment to women assistant professors. The Review of Higher Education 19, 2 (1996), 123--139.",
      "doi": ""
    },
    {
      "text": "Allan Fisher and Jane Margolis. 2002. Unlocking the clubhouse: the Carnegie Mellon experience. ACM SIGCSE Bulletin 34, 2 (2002), 79--83.  ",
      "doi": "10.1145/543812.543836"
    },
    {
      "text": "Institute for Family Studies (IFS). \"2016 (accessed August 23, 2017)\". Better-Educated Women Still Prefer Higher-Earning Husbands. https://goo.gl/7KZRyL.",
      "doi": ""
    },
    {
      "text": "Vashti Galpin. 2002. Women in computing around the world. ACM SIGCSE Bulletin 34, 2 (2002), 94--100.  ",
      "doi": "10.1145/543812.543839"
    },
    {
      "text": "Melissa Gregg. \"2015 (accessed August 8, 2017)\". The Deficiencies of Tech's 'Pipeline' Metaphor. https://goo.gl/SPKyBu.",
      "doi": ""
    },
    {
      "text": "Namrata Gupta. 2012. Women undergraduates in engineering education in India: A study of growing participation. Gender, Technology and Development 16, 2 (2012), 153--176.",
      "doi": ""
    },
    {
      "text": "Namrata Gupta. 2015. Rethinking the relationship between gender and technology: a study of the Indian example. Work, employment and society 29, 4 (2015), 661--672.",
      "doi": ""
    },
    {
      "text": "Namrata Gupta and Arun K Sharma. 2003. Gender inequality in the work environment at institutes of higher learning in science and technology in India. Work, employment and society 17, 4 (2003), 597--616.",
      "doi": ""
    },
    {
      "text": "Jo Handelsman, Nancy Cantor, Molly Carnes, Denice Denton, Eve Fine, Barbara Grosz, Virginia Hinshaw, Cora Marrett, Sue Rosser, Donna Shalala, and others. 2005. More women in science. Science 309, 5738 (2005), 1190--1191.",
      "doi": ""
    },
    {
      "text": "Steve Henn. When Women Stopped Coding =https://goo.gl/XqkY72, month = October, year = 2014.",
      "doi": ""
    },
    {
      "text": "Catherine Hill, Christianne Corbett, and Andresse St Rose. 2010. Why so few? Women in science, technology, engineering, and mathematics. ERIC.",
      "doi": ""
    },
    {
      "text": "Hai Hong, Jennifer Wang, Jason Ravitz, and Mo-Yun Lei Fong. 2015. Gender Differences in High School Students' Decisions to Study Computer Science and Related Fields. In SIGCSE. 689.  ",
      "doi": "10.1145/2676723.2691920"
    },
    {
      "text": "IBEF. \"2017 (accessed August 23, 2017)\". IT & ITeS Industry in India. https://goo.gl/koCxdN.",
      "doi": ""
    },
    {
      "text": "Kori Inkpen. 1997. Three important research agendas for educational multimedia: Learning, children and gender. In AACE World Conference on Educational Multimedia and Hypermedia, Vol. 97. 521--526.",
      "doi": ""
    },
    {
      "text": "Amanda Kimball. 2011. UC Davis study of California women business leaders: A census of women directors and highest-paid executives. Graduate School of Management, University of California, Davis.",
      "doi": ""
    },
    {
      "text": "Stephan Klasen and Janneke Pieters. 2015. What explains the stagnation of female labor force participation in urban India? The World Bank Economic Review 29, 3 (2015), 449--478.",
      "doi": ""
    },
    {
      "text": "Nalini P Kotamraju. 2011. Playing stupid, caring for users, and putting on a good show: Feminist acts in usability study work. Interacting with Computers 23, 5 (2011), 439--446.  ",
      "doi": "10.1016/j.intcom.2011.03.004"
    },
    {
      "text": "Anne Krook. \"2017 (accessed August 23, 2017)\". Tech and the Gender Pay Gap. https://goo.gl/HLjBns.",
      "doi": ""
    },
    {
      "text": "Ann Light, Ilda Ladeira, Jahmeilah Roberson, N Bidwell, Nimmi Rangaswamy, Nithya Sambasivan, and Shikoh Gitau. 2010. Gender matters: Female perspectives in ICT4D research. (2010).",
      "doi": ""
    },
    {
      "text": "Farhad Manjoo. 2014. Exposing Hidden Bias at Google - The New York Times. https://goo.gl/EmaqNq. (September 2014). (Accessed on 09/02/2017).",
      "doi": ""
    },
    {
      "text": "Jane Margolis, Allan Fisher, and Faye Miller. 1999. Caring about connections: Gender and computing. IEEE technology and society magazine 18, 4 (1999), 13--20.",
      "doi": ""
    },
    {
      "text": "Jane Margolis, Allan Fisher, and Faye Miller. 2000. The anatomy of interest: Women in undergraduate computer science. Women's Studies Quarterly 28, 1/2 (2000), 104--127.",
      "doi": ""
    },
    {
      "text": "J Margolis, A Fisher, and F Miller. 2002. Caring about connections: Gender and computing. Pittsburgh. (2002).",
      "doi": ""
    },
    {
      "text": "Catherine Mavriplis, Rachelle Heller, Cheryl Beil, Kim Dam, Natalya Yassinskaya, Megan Shaw, and Charlene Sorensen. 2010. Mind the gap: Women in STEM career breaks. Journal of technology management & innovation 5, 1 (2010), 140--151.",
      "doi": ""
    },
    {
      "text": "Kristen Monroe, Saba Ozyurt, Ted Wrigley, and Amy Alexander. 2008. Gender equality in academia: Bad news from the trenches, and some possible solutions. Perspectives on politics 6, 2 (2008), 215--233.",
      "doi": ""
    },
    {
      "text": "Corinne A Moss-Racusin, John F Dovidio, Victoria L Brescoll, Mark J Graham, and Jo Handelsman. 2012. Science faculty Zs subtle gender biases favor male students. Proceedings of the National Academy of Sciences 109, 41 (2012), 16474--16479.",
      "doi": ""
    },
    {
      "text": "C.C Mukhopadhyay. 1996. The cultural context of gendered science: a theoretical model derived from studies in India. Gates 3, 1 (1996).",
      "doi": ""
    },
    {
      "text": "Brian A Nosek, Frederick L Smyth, Natarajan Sriram, Nicole M Lindner, Thierry Devos, Alfonso Ayala, Yoav Bar-Anan, Robin Bergh, Huajian Cai, Karen Gonsalkorale, and others. 2009. National differences in gender--science stereotypes predict national sex differences in science and math achievement. Proceedings of the National Academy of Sciences 106, 26 (2009), 10593--10597.",
      "doi": ""
    },
    {
      "text": "Central Institute of Educational Technology. 2013. Information and Communication Technology for the School System: Curricula for ICT in Education. Technical Report. National Council of Educational Research and Training.",
      "doi": ""
    },
    {
      "text": "Ministry of Human Resource Development. 2015--16. All India Survey on Higher Education. Technical Report. Government of India,Ministry of Human Resource Development, Department of Higher Education, Statistics Division.",
      "doi": ""
    },
    {
      "text": "PTI. JEE Main: Number of students appearing have declined, says Govt=https://goo.gl/LufVED, month = April, year = 2017.",
      "doi": ""
    },
    {
      "text": "Parvati Raghuram, Clem Herman, Esther Ruiz-Ben, and Gunjan Sondhi. 2017. WOMEN AND IT SCORECARD-INDIA. (2017).",
      "doi": ""
    },
    {
      "text": "Thillai Rajan. Trends in StartUp Ecosystem and Financing =https://goo.gl/GJE9eb, month = February, year = 2017.",
      "doi": ""
    },
    {
      "text": "Vaidyeswaran Rajaraman. 2015. History of Computing in India: 1955--2010. IEEE Annals of the History of Computing 37, 1 (2015), 24--35.",
      "doi": "10.1109/MAHC.2015.10"
    },
    {
      "text": "Sheryl Sandberg. Lean In. =https://leanin.org/book/, month = June, year = 2010. (????).",
      "doi": ""
    },
    {
      "text": "Christine Satchell. 2010. Women are people too: The problem of designing for gender. (2010).",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W Keith Edwards, and Rebecca E Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5412--5427.  ",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Scroll. \"2017 (accessed August 23, 2017)\". Indians are working too much â S and it's making them sick and tired. https://goo.gl/ldjNDE.",
      "doi": ""
    },
    {
      "text": "Steven J Spencer, Claude M Steele, and Diane M Quinn. 1999. Stereotype threat and women's math performance. Journal of experimental social psychology 35, 1 (1999), 4--28.",
      "doi": ""
    },
    {
      "text": "Statista. 2017. Size of the IT Industry in India as a share of India's gross domestic product from 2008 to 2016. (2017). data retrieved from, https://goo.gl/zBYNiC.",
      "doi": ""
    },
    {
      "text": "Andrea H Tapia and Lynette Kvasny. 2004. Recruitment is never enough: retention of women and minorities in the IT workplace. In Proceedings of the 2004 SIGMIS conference on Computer personnel research: Careers, culture, and ethics in a networked environment. ACM, 84--91.  ",
      "doi": "10.1145/982372.982392"
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "Maria Thomas. 2016. When it comes to feminism, neither Bollywood nor India Inc.'s advertisements have got it right.",
      "doi": ""
    },
    {
      "text": "Roli Varma. 2010. Forms of Social Asymmetry and Cultural Bias: Of Gender and Science in India and the World. Journal of Women and Minorities in Science and Engineering 16 (2010). Issue 3.",
      "doi": ""
    },
    {
      "text": "Sujata Venkatesh. 2015. Forms of Social Asymmetry and Cultural Bias: Of Gender and Science in India and the World. Transcience (2015) 6, 1 (2015).",
      "doi": ""
    },
    {
      "text": "Brian Welle and Madeline E Heilman. 2007. Formal and informal discrimination against women at work. Research in social issues in management: Managing social and ethical issues in organizations (2007), 229--252.",
      "doi": ""
    },
    {
      "text": "Julie A. Winkler. 2000. Faculty Reappointment, Tenure, and Promotion: Barriers for Women. The Professional Geographer 52, 4 (2000), 737--750.",
      "doi": ""
    },
    {
      "text": "Nicholas H Wolfinger, Mary Ann Mason, and Marc Goulden. 2008. Problems in the pipeline: Gender, marriage, and fertility in the ivory tower. The Journal of Higher Education 79, 4 (2008), 388--405.",
      "doi": ""
    }
  ]
}