{
  "doi": "10.1145/3173574.3173784",
  "title": "Experiencing the Body as Play",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Games research in HCI is continually interested in the human body. However, recent work suggests that the field has only begun to understand how to design bodily games. We propose that the games research field is advancing from playing with digital content using a keyboard, to using bodies to play with digital content, towards a future where we experience our bodies as digital play. To guide designers interested in supporting players to experience their bodies as play, we present two phenomenological perspectives on the human body (Körper and Leib) and articulate a suite of design tactics using our own and other people's work. We hope with this paper, we are able to help designers embrace the point that we both \"have\" a body and \"are\" a body, thereby aiding the facilitation of the many benefits of engaging the human body through games and play, and ultimately contributing to a more humanized technological future.",
  "tags": [
    "whole-body interaction",
    "exergame",
    "exertion games",
    "play"
  ],
  "authors": [
    {
      "name": "Florian 'Floyd' Mueller",
      "institution": "RMIT University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260236",
      "orcid": "0000-0001-6472-3476"
    },
    {
      "name": "Richard Byrne",
      "institution": "RMIT University, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81467656581/rel-imgonly/me.png",
      "acmid": "81467656581",
      "orcid": "missing"
    },
    {
      "name": "Josh Andres",
      "institution": "RMIT University, Melbourne, VIC , Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658744130",
      "orcid": "missing"
    },
    {
      "name": "Rakesh Patibanda",
      "institution": "RMIT University, Melbourne, VIC , Australia",
      "img": "/do/10.1145/contrib-99659210824/rel-imgonly/rakesh_photo_bw_lessthan1mb.jpg",
      "acmid": "99659210824",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nike. 2018. Nike+. http://nikeplus.nike.com.",
      "doi": ""
    },
    {
      "text": "David Altimira, Florian Mueller, Jenny Clarke, Gun Lee, Mark Billinghurst and Christoph Bartneck. 2016. Digitally Augmenting Sports: An Opportunity for Exploring and Understanding Novel Balancing Techniques. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1681--1691.  ",
      "doi": "10.1145/2858036.2858277"
    },
    {
      "text": "Josh Andres, Julian de Hoog, Jürg von Känel, Julian Berk, Bach Le, Xizi Wang, Marcus Brazil and Florian Mueller. 2016. Exploring Human: Ebike Interaction to Support Rider Autonomy. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts. ACM, 85--92.  ",
      "doi": "10.1145/2968120.2987719"
    },
    {
      "text": "S. Benford, H. Schnädelbach, B. Koleva, R. Anastasi, C. Greenhalgh, T. Rodden, J. Green, A. Ghali, T. Pridmore and B. Gaver. Expected, Sensed, and Desired: A Framework for Designing Sensing-Based Interaction. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 1 (2005), 3--30.  ",
      "doi": "10.1145/1057237.1057239"
    },
    {
      "text": "Richard Byrne, Joe Marshall and Florian Mueller. 2016. Balance Ninja: Towards the Design of Digital Vertigo Games Via Galvanic Vestibular Stimulation. In 2016 Annual Symposium on Computer-Human Interaction in Play. ACM, 159--170.  ",
      "doi": "10.1145/2967934.2968080"
    },
    {
      "text": "Richard Byrne, Joe Marshall and Florian Mueller. 2016. Designing the Vertigo Experience: Vertigo as a Design Resource for Digital Bodily Play. In Proceedings of TEI '16: Conference on Tangible, Embedded, and Embodied Interaction. ACM, 296--303.  ",
      "doi": "10.1145/2839462.2839465"
    },
    {
      "text": "Richard Byrne, Joe Marshall and Florian Mueller. 2016. Inner Disturbance: Towards Understanding the Design of Vertigo Games through a Novel Balancing Game. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. ACM, 3010999, 551--556.  ",
      "doi": "10.1145/3010915.3010999"
    },
    {
      "text": "Roger Caillois. Man, Play, and Games. University of Illinois Press, 1961.",
      "doi": ""
    },
    {
      "text": "Alan Chatham and Florian Mueller. 2013. Adding an Interactive Display to a Public Basketball Hoop Can Motivate Players and Foster Community. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing. ACM, 2493478, 667--676.  ",
      "doi": "10.1145/2493432.2493478"
    },
    {
      "text": "Martin Clayton. Communication in Indian Raga Performance. Musical communication (2005), 361--381.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W McDonald and James A Landay. Designing for Healthy Lifestyles: Design Considerations for Mobile Technologies to Encourage Consumer Health and Wellness. Human-- Computer Interaction 6, 3--4 (2012), 167--315.  ",
      "doi": "10.1561/1100000040"
    },
    {
      "text": "Bernard De Koven. The Well-Played Game: A Player's Philosophy. MIT Press, 2013. ",
      "doi": "10.5555/2535025"
    },
    {
      "text": "T. Djajadiningrat, K. Overbeeke and S. Wensveen. 2002. But How, Donald, Tell Us How? On the Creation of Meaning in Interaction Design through Feedforward and Inherent Feedback. In DIS '02: Proceedings of the 4th Conference on Designing Interactive Systems. ACM New York, NY, USA, 285--291.  ",
      "doi": "10.1145/778712.778752"
    },
    {
      "text": "P. Dourish. Where the Action Is: The Foundations of Embodied Interaction. Boston, MA, USA: MIT Press, 2001. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Henning Eichberg. Body, Soma-and Nothing Else? Bodies in Language. Sport Science Review 4, 1 (1995), 5--25.",
      "doi": ""
    },
    {
      "text": "Mary Flanagan. Critical Play: Radical Game Design. MIT press, 2009. ",
      "doi": ""
    },
    {
      "text": "Florian Mueller, Martin R. Gibbs, Frank Vetere and Darren Edge. Designing for Bodily Interplay in Social Exertion Games. ACM Trans. Comput.-Hum. Interact. 24, 3 (2017), 1--41.  ",
      "doi": "10.1145/3064938"
    },
    {
      "text": "Jayden Garner, Gavin Wood, Sebastiaan Pijnappel, Martin Murer and Florian Mueller. 2014. I-Dentity: Innominate Movement Representation as Engaging Game Element. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2181--2190.  ",
      "doi": "10.1145/2556288.2557257"
    },
    {
      "text": "Mahmoud Hassan, Florian Daiber, Frederik Wiehr, Felix Kosmalla and Antonio Krüger. Footstriker: An Ems-Based Foot Strike Assistant for Running. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 1 (2017), 2.  ",
      "doi": "10.1145/3053332"
    },
    {
      "text": "Kristina Höök, Martin Jonsson, Anna Ståhl and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'16), San Jose, CA, USA. ACM, 3131--3142.  ",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Kristina Hook, Anna Stahl, Martin Jonsson, Johanna Mercurio, Anna Karlsson and Eva-Carin Banka Johnson. Somaesthetic Design. interactions 22, 4 (2015), 26--33.  ",
      "doi": "10.1145/2770888"
    },
    {
      "text": "Eva Hornecker, Paul Marshall and Jörn Hurtienne. 2017. Locating Theories of Embodiment Along Three Axes: 1st - 3d Person, Body-Context, PracticeCognition. http://www.ehornecker.de/Papers/SomaestheticWSembodimentshortie.pdf.",
      "doi": ""
    },
    {
      "text": "Bernhard Irrgang. Intersubjectivity,\" Other Intelligences\" and the Philosophical Constitution of the Human-Robotics-Interaction. Prajna Vihara 9, 2 (2008).",
      "doi": ""
    },
    {
      "text": "Katherine Isbister, Michael Karlesky and Jonathan Frye. 2012. Scoop!: Using Movement to Reduce Math Anxiety and Affect Confidence. In Proceedings of the International Conference on the Foundations of Digital Games. ACM, 228--230.  ",
      "doi": "10.1145/2282338.2282382"
    },
    {
      "text": "Katherine Isbister and Florian Mueller. Guidelines for the Design of Movement-Based Games and Their Relevance to HCI. Human-Computer Interaction 30, 3--4 (2014), 366--399.  ",
      "doi": "10.1080/07370024.2014.996647"
    },
    {
      "text": "J Juul and M Norton. 2009. Easy to Use and Incredibly Difficult: On the Mythical Border between Interface and Gameplay. In International Conference On The Foundations Of Digital Games. ACM, 107--112.  ",
      "doi": "10.1145/1536513.1536539"
    },
    {
      "text": "Astrid Larssen, Lian Loke, Tony Robertson and Jenny Edwards. 2004. Understanding Movement as Input for Interaction--a Study of Two Eyetoy Games. In Proceedings of OzCHI '04.",
      "doi": ""
    },
    {
      "text": "Sang-won Leigh, Harpreet Sareen, Hsin-Liu Cindy Kao, Xin Liu and Pattie Maes. Body-Borne Computers as Extensions of Self. Computers 6, 1 (2017), 12.",
      "doi": ""
    },
    {
      "text": "Manuela Lenzen. n.d. Feeling Our Emotions. https://http://www.scientificamerican.com/article/feelin g-our-emotions/.",
      "doi": ""
    },
    {
      "text": "Conor Linehan, Sabine Harrer, Ben Kirman, Shaun Lawson and Marcus Carter. 2015. Games against Health: A Player-Centered Design Philosophy. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2732514, 589--600.  ",
      "doi": "10.1145/2702613.2732514"
    },
    {
      "text": "Lian Loke and Toni Robertson. Moving and Making Strange: An Embodied Approach to Movement-Based Interaction Design. ACM Transactions on ComputerHuman Interaction (TOCHI) 20, 1 (2013), 7.  ",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Panos Markopoulos, Janet C Read, Stuart MacFarlane and Johanna Hoysniemi. Evaluating Children's Interactive Products: Principles and Practices for Interaction Designers. Morgan Kaufmann, 2008. ",
      "doi": "10.5555/1386295"
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami and Annika Waern. 2016. Embodied Sketching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 60146027.  ",
      "doi": "10.1145/2858036.2858486"
    },
    {
      "text": "Joe Marshall, Alexandru Dancu and Florian Mueller. 2016. Interaction in Motion: Designing Truly Mobile Interaction. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 2901844, 215--228.  ",
      "doi": "10.1145/2901790.2901844"
    },
    {
      "text": "Joe Marshall and Conor Linehan. 2017. Misrepresentation of Health Research in Exertion Games Literature. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4899--4910.  ",
      "doi": "10.1145/3025453.3025691"
    },
    {
      "text": "Joe Marshall, Conor Linehan and Adrian Hazzard. 2016. Designing Brutal Multiplayer Video Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2669--2680.  ",
      "doi": "10.1145/2858036.2858080"
    },
    {
      "text": "Joe Marshall, Florian Mueller, Steve Benford and Sebastiaan Pijnappel. Expanding Exertion Gaming. International Journal of Human-Computer Studies 90 (2016), 1--13.  ",
      "doi": "10.1016/j.ijhcs.2016.02.003"
    },
    {
      "text": "Joe Marshall, Brendan Walker, Steve Benford, George Tomlinson, Stefan Rennick Egglestone, Stuart Reeves, Patrick Brundell, Paul Tennent, Jo Cranwell, Paul Harter and Jo Longhurst. 2011. The Gas Mask: A Probe for Exploring Fearsome Interactions. In Proceedings of the 2011 Conference on Human factors in computing systems, extended abstracts. ACM, 1979609, 127--136.  ",
      "doi": "10.1145/1979742.1979609"
    },
    {
      "text": "Paul Martin. 2012. A Phenomenological Account of the Playing-Body in Avatar-Based Action Games. In Proceedings of Philosophy of Computer Games Conference. 29--31.",
      "doi": ""
    },
    {
      "text": "Jennifer Mathieu. What Should You Know About Mindful and Intuitive Eating? Journal of the American Dietetic Association 109, 12 (2009), 1982.",
      "doi": ""
    },
    {
      "text": "M. Merleau-Ponty. Phenomenology of Perception (Routledge Classics). Routledge, 1945.",
      "doi": ""
    },
    {
      "text": "F. Mueller, S. Agamanolis and R. Picard. 2003. Exertion Interfaces: Sports over a Distance for Social Bonding and Fun. In SIGCHI conference on Human factors in computing systems. ACM, 561--568.  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Florian Mueller, Chek Tien Tan, Rich Byrne and Matt Jones. 2017. 13 Game Lenses for Designing Diverse Interactive Jogging Systems. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, 3116607, 43--56.  ",
      "doi": "10.1145/3116595.3116607"
    },
    {
      "text": "Florian Mueller, Darren Edge, Frank Vetere, Martin Gibbs, Stefan. Agamanolis, Bert Bongers and Jennifer Sheridan. 2011. Designing Sports: A Framework for Exertion Games. In CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2651--2660.  ",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "Florian Mueller, Martin Gibbs, Frank Vetere, Stefan Agamanolis and Darren Edge. 2014. Designing Mediated Combat Play. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 149--156.  ",
      "doi": "10.1145/2540930.2540937"
    },
    {
      "text": "Florian Mueller and Katherine Isbister. 2014. Movement-Based Game Guidelines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2557163, 2191--2200.  ",
      "doi": "10.1145/2556288.2557163"
    },
    {
      "text": "Florian Mueller, Rohit Ashok Khot, Kathrin Gerling and Regan Mandryk. Exertion Games. Foundations and Trends Human-Computer Interaction 10, 1 (2016), 1--86.  ",
      "doi": "10.1561/1100000041"
    },
    {
      "text": "Florian Mueller, Sophie Stellmach, Saul Greenberg, Andreas Dippon, Susanne Boll, Jayden Garner, Rohit Khot, Amani Naseem and David Altimira. 2014. Proxemics Play: Understanding Proxemics for Designing Digital Play Experiences. In Proceedings of the 2014 conference on Designing interactive systems. ACM, 533--542.  ",
      "doi": "10.1145/2598510.2598532"
    },
    {
      "text": "Florian Mueller and Damon Young. 2017. Five Lenses for Designing Exertion Experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3025746, 2473--2487.  ",
      "doi": "10.1145/3025453.3025746"
    },
    {
      "text": "Martin Murer, Ilhan Aslan and Manfred Tscheligi. 2013. Loll Io: Exploring Taste as Playful Modality. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 299--302.  ",
      "doi": "10.1145/2460625.2460675"
    },
    {
      "text": "Stina Nylander, Jakob Tholander, Florian Mueller and Joe Marshall. HCI and Sports. interactions 22, 2 (2015), 30--31.  ",
      "doi": "10.1145/2729712"
    },
    {
      "text": "Thomas Ots. The Silenced Body--the Expressive Leib: On the Dialectic of Mind and Life in Chinese Cathartic Healing. In Embodiment and Experience: The Existential Ground of Culture and Self, 1994, 116.",
      "doi": ""
    },
    {
      "text": "R. Patibanda, Mueller, F., Leskovsek, M., Duckworth, J. 2017. Life Tree: Understanding the Design of Breathing Exercise Games. In CHI PLAY'17. ACM. 19--31.  ",
      "doi": "10.1145/3116595.3116621"
    },
    {
      "text": "Rosalind Picard. Affective Computing. The MIT Press, 1997. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Stephen Purpura, Victoria Schwanda, Kaiton Williams, William Stubler and Phoebe Sengers. 2011. Fit4life: The Design of a Persuasive Technology Promoting Healthy Behavior and Ideal Weight. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1979003, 423--432.  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Scott Rigby and Richard Ryan. Glued to Games: How Video Games Draw Us in and Hold Us Spellbound. Praeger, 2011.",
      "doi": ""
    },
    {
      "text": "Katie Salen and Eric Zimmerman. Rules of Play: Game Design Fundamentals. The MIT Press (Boston, MA, USA), 2003. ",
      "doi": "10.5555/1215723"
    },
    {
      "text": "Thecla Schiphorst. Bridging Embodied Methodologies from Somatics and Performance to Human Computer Interaction. Unpublished Doctoral Dissertation, University of Plymouth, UK, 2009.",
      "doi": ""
    },
    {
      "text": "m.c. schraefel. #Makenormalbetter. interactions 24, 5 (2017), 24--26.  ",
      "doi": "10.1145/3125393"
    },
    {
      "text": "Elena Marquez Segura, Annika Waern, Jin Moen and Carolina Johansson. 2013. The Design Space of Body Games: Technological, Physical, and Social Design. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 2466461, 33653374.  ",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Shaun Sweeney, Rodrigo Ordonez-Hurtado, Francesco Pilla, Giovanni Russo, David Timoney and Robert Shorten. Cyberphysics, Pollution Mitigation, and Pedelecs. arXiv preprint arXiv:1706.00646 (2017).",
      "doi": ""
    },
    {
      "text": "Jenny Slatman. Our Strange Body: Philosophical Reflections on Identity and Medical Interventions. Amsterdam University Press, 2016.",
      "doi": ""
    },
    {
      "text": "T. Stach, TC Graham, J. Yim and R.E. Rhodes. 2009. Heart Rate Control of Exercise Video Games. In Proceedings of Graphics Interface 2009. Canadian Information Processing Society, 125--132. ",
      "doi": "10.5555/1555880.1555912"
    },
    {
      "text": "Dag Svanæs. Interaction Design for and with the Lived Body: Some Implications of Merleau-Ponty's Phenomenology. ACM Transactions on ComputerHuman Interaction (TOCHI) 20, 1 (2013), 8.  ",
      "doi": "10.1145/2442106.2442114"
    },
    {
      "text": "Dag Svanaes and William Verplank. 2000. In Search of Metaphors for Tangible User Interfaces. In Proceedings of DARE 2000 on Designing augmented reality environments. ACM, 121--129.  ",
      "doi": "10.1145/354666.354679"
    },
    {
      "text": "J Tanenbaum and J Bizzocchi. 2009. Rock Band: A Case Study in the Design of Embodied Interface Experience. In Proceedings of the 2009 ACM SIGGRAPH Symposium on Video Games. ACM, 127134.  ",
      "doi": "10.1145/1581073.1581093"
    },
    {
      "text": "Jakob Tholander and Stina Nylander. 2015. Snot, Sweat, Pain, Mud, and Snow: Performance and Experience in the Use of Sports Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 29132922.  ",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "T. Toscos, A. Faber, S. An and M. P. Gandhi. 2006. Chick Clique: Persuasive Technology to Motivate Teenage Girls to Exercise. In CHI '06 extended abstracts on Human factors in computing systems. ACM New York, NY, USA, 1873--1878.  ",
      "doi": "10.1145/1125451.1125805"
    },
    {
      "text": "Wikipedia contributors. 2017. Dwarf-Tossing. https://en.wikipedia.org/w/index.php?title=Dwarftossing&oldid=800700223.",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Thecla Schiphorst and Sietske Klooster. Move to Design/Design to Move: A Conversation About Designing for the Body. interactions 18, 4 (2011), 22--27.  ",
      "doi": "10.1145/1978822.1978828"
    },
    {
      "text": "T Winograd and F Flores. Understanding Computers and Cognition: A New Foundation for Design. Ablex Publishing Corporation (Norwood, NJ, USA), 1986. ",
      "doi": "10.5555/576359"
    },
    {
      "text": "J. Yim and T. C. N. Graham. 2007. Using Games to Increase Exercise Motivation. In Future Play 2007. ACM New York, NY, USA, 166--173.  ",
      "doi": "10.1145/1328202.1328232"
    },
    {
      "text": "Jeffrey Yim and T. C. Nicholas Graham. 2007. Using Games to Increase Exercise Motivation. In Proceedings of the 2007 conference on Future Play. ACM, 1328232, 166--173.  ",
      "doi": "10.1145/1328202.1328232"
    },
    {
      "text": "Damon Young. How to Think About Exercise. Picador, 2015.",
      "doi": ""
    }
  ]
}