{
  "doi": "10.1145/3173574.3173984",
  "title": "Building Momentum: Scaling up Change in Community Organizations",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Addressing calls in Sustainable HCI to scale up our work in HCI targeting sustainability, and the current knowledge gap of how to do this practically, we here present a qualitative study of 10 sustainability-oriented community organizations that are working to scale up their change making. They are all loosely connected to a local Transition network, meaning that they are aiming at transforming current practices in society, through local and practical action, to meet challenges related to climate change. We wanted to know how they try to scale up their change making, and what role ICT plays in enabling scaling up. The study contributes new insights about three stages of scaling up, in which ICT plays different roles. We conclude with implications for HCI for how to support community organizations in scaling up, while keeping values important for working toward a more resilient society.",
  "authors": [
    {
      "name": "Aksel Biørn-Hansen",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260614",
      "orcid": "missing"
    },
    {
      "name": "Maria Håkansson",
      "institution": "RISE Research Institutes of Sweden & Chalmers University of Technology, Borås, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232108",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Esther Alloun and Samuel Alexander. 2014. The Transition Movement: Questions of Diversity, Power, and Affluence. Simplicity Institute Report.",
      "doi": ""
    },
    {
      "text": "Mariam Asad, Christopher A. Le Dantec, Becky Nielsen, and Kate Diedrick. 2017. Creating a Sociotechnical API: Designing City-Scale Community Engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 22952306.  ",
      "doi": "10.1145/3025453.3025963"
    },
    {
      "text": "Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Andrew Boyd and Dave Oswald Mitchell. 2012. Beautiful trouble: A toolbox for revolution. New York: OR Books.",
      "doi": ""
    },
    {
      "text": "Margot Brereton and Sunil Ghelawat. 2010. Designing for participation in local social ridesharing networks: grass roots prototyping of IT systems. In Proceedings of the 11th Biennial Participatory Design Conference (PDC '10). ACM, New York, NY, USA, 199--202.  ",
      "doi": "10.1145/1900441.1900478"
    },
    {
      "text": "Barry Brown, Susanne Bødker, and Kristina Höök. 2017. Does HCI Scale? Scale Hacking and the Relevance of HCI. interactions, September-October 2017, ACM.  ",
      "doi": "10.1145/3125387"
    },
    {
      "text": "Hrönn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 947--956.  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Susanne Bødker, Henrik Korsgaard, and Joanna Saad-Sulonen. 2016. 'A Farmer, a Place and at least 20 Members': The Development of Artifact Ecologies in Volunteer-based Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1142--1156.  ",
      "doi": "10.1145/2818048.2820029"
    },
    {
      "text": "Teresa Cerratto-Pargman, Daniel Pargman, and Bonnie, Nardi. 2016. The Internet at the eco-village: Performing sustainability in the twenty-first century. First Monday, April 2016. Retrieved August 30, 2017 from http://firstmonday.org/ojs/index.php/fm/article/view/66 37.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. Sage, London.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A pool of dreams: facebook, politics and the emergence of a social movement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3573--3582.  ",
      "doi": "10.1145/2556288.2557100"
    },
    {
      "text": "Clara Crivellaro, Alex Taylor, Vasillis Vlachokyriakos, Rob Comber, Bettina Nissen, and Peter Wright. 2016. Re-Making Places: HCI, 'Community Building' and Change. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2958--2969.  ",
      "doi": "10.1145/2858036.2858332"
    },
    {
      "text": "Christopher A Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science. Vol 43, Issue 2, pp. 241--264.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, Özge Subasi, and Florian Güldenpfennig. 2014. Think globally, act locally: a case study of a free food sharing community and social networking. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 911--921.  ",
      "doi": "10.1145/2531602.2531664"
    },
    {
      "text": "Mena Grossmann and Emily Creamer. 2016. Assessing diversity and inclusivity within the Transition movement: an urban case study. Environmental Politics. 26, 1 (2016), 161--182.",
      "doi": ""
    },
    {
      "text": "Xinning Gui and Bonnie Nardi. 2015. Foster the \"mores\", counter the \"limits\". First Monday, July 2015. Retrieved August 30, 2017 from http://firstmonday.org/ojs/index.php/fm/article/view/61 21/4840.",
      "doi": ""
    },
    {
      "text": "Xinning Gui and Bonnie Nardi. 2015. Sustainability Begins in the Street: A Story of Transition Town Totnes. EnviroInfo and ICT for Sustainability 2015. Atlantis Press.",
      "doi": ""
    },
    {
      "text": "Alex Haxeltine and Gill Seyfang. 2009. Transitions for the People: Theory and Practice of 'Transition'and 'Resilience'in the UK's Transition Movement. Tyndall Centre for Climate Change Research, Working Paper, 134.",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for grassroots urban foodgrowing communities. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13), ACM, New York, NY, USA, 255--264.  ",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Maria Håkansson and Phoebe Sengers. 2014. No easy compromise: sustainability and the dilemmas and dynamics of change. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 1025--1034.  ",
      "doi": "10.1145/2598510.2598569"
    },
    {
      "text": "Matthias Korn and Amy Voida. 2015. Creating friction: infrastructuring civic engagement in everyday life. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (AA '15). Aarhus University Press 145--156.  ",
      "doi": "10.7146/aahcc.v1i1.21198"
    },
    {
      "text": "Bran Knowles, Lynne Blair, Paul Coulton, and Mark Lochrie. 2014. Rethinking plan A for sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3593--3596.  ",
      "doi": "10.1145/2556288.2557311"
    },
    {
      "text": "Airi Lampinen, Victoria Bellotti, Coye Cheshire, and Mary Gray. 2016. CSCW and the Sharing Economy: The Future of Platforms as Sites of Work Collaboration and Trust. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (CSCW '16 Companion). ACM, New York, NY, USA, 491--497.  ",
      "doi": "10.1145/2818052.2855527"
    },
    {
      "text": "Max Liboiron. 2014. Against Awareness, For Scale: Garbage is Infrastructure, Not Behavior. Blog post (January 23, 2014) Retrieved December 27, 2017 from https://discardstudies.com/2014/01/23/againstawareness-for-scale-garbage-is-infrastructure-notbehavior/",
      "doi": ""
    },
    {
      "text": "Ann Light and Clodagh, Miskelly. 2015. Sharing economy vs sharing cultures? Designing for social, economic and environmental good. Interaction Design and Architecture(s), 24. pp. 49--62.",
      "doi": ""
    },
    {
      "text": "Jennifer Mankoff. 2012. HCI and sustainability: a tale of two motivations. interactions 19, 3 (May 2012), 1619.  ",
      "doi": "10.1145/2168931.2168937"
    },
    {
      "text": "Lone Malmborg, Ann Light, Geraldine Fitzpatrick, Victoria Bellotti, and Margot Brereton. 2015. Designing for Sharing in Local Communities. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 2357--2360.  ",
      "doi": "10.1145/2702613.2702645"
    },
    {
      "text": "Cecelia Merkel, Umer Farooq, Lu Xiao, Craig Ganoe, Mary Beth Rosson, and John M. Carroll. 2007. Managing technology use and learning in nonprofit community organizations: methodological challenges and opportunities. In Proceedings of the 2007 symposium on Computer human interaction for the management of information technology (CHIMIT '07). ACM, New York, NY, USA, Article 8 .  ",
      "doi": "10.1145/1234772.1234783"
    },
    {
      "text": "Vicki Moulder, Lorna R. Boschman, Ron Wakkary, William Odom, and Stacey Kuznetsov. 2014. HCI interventions with nonprofit organizations: tactics for effective collaboration. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 877--880.  ",
      "doi": "10.1145/2559206.2559971"
    },
    {
      "text": "Lisa P. Nathan. 2008. Ecovillages, values, and interactive technology: balancing sustainability with daily life in 21st century america. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 37233728.  ",
      "doi": "10.1145/1358628.1358920"
    },
    {
      "text": "Nadia Pantidi, Jennifer Ferreira, Mara Balestrini, Mark Perry, Paul Marshall, and John McCarthy. 2015. Connected sustainability: connecting sustainabilitydriven, grass-roots communities through technology. In Proceedings of the 7th International Conference on Communities and Technologies (C&T '15). ACM, New York, NY, USA, 161--163.  ",
      "doi": "10.1145/2768545.2768563"
    },
    {
      "text": "Daniel Pargman, Elina Eriksson, and Adrian Friday. 2016. Limits to the sharing economy. In Proceedings of the Second Workshop on Computing within Limits (LIMITS '16). ACM, New York, NY, USA, Article 12, 7 pages.  ",
      "doi": "10.1145/2926676.2926683"
    },
    {
      "text": "Chris Preist, Daniel Schien, and Eli Blevis. 2016. Understanding and Mitigating the Effects of Device and Cloud Service Design Decisions on the Environmental Footprint of Digital Infrastructure. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1324--1337.  ",
      "doi": "10.1145/2858036.2858378"
    },
    {
      "text": "Barath Raghavan and Daniel Pargman. 2017. Means and Ends in Human-Computer Interaction: Sustainability through Disintermediation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 786--796.  ",
      "doi": "10.1145/3025453.3025542"
    },
    {
      "text": "Gill Seyfang and Alex Haxeltine. 2012. Growing Grassroots Innovations: Exploring the Role of Community-Based Initiatives in Governing Sustainable Energy Transitions. Environment and Planning C: Government and Policy. 30, 3 (2012), 381--400.",
      "doi": ""
    },
    {
      "text": "M. Six Silberman, Lisa Nathan, Bran Knowles, Roy Bendor, Adrian Clear, Maria Håkansson, Tawanna Dillahunt, and Jennifer Mankoff. 2014. Next steps for sustainable HCI. interactions 21, 5 (September 2014), 66--69.  ",
      "doi": "10.1145/2651820"
    },
    {
      "text": "Vanessa Thomas, Christian Remy, Mike Hazas, and Oliver Bates. 2017. HCI and Environmental Public Policy: Opportunities for Engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6986--6992.  ",
      "doi": "10.1145/3025453.3025579"
    },
    {
      "text": "The Transition Network. 2017. About the movement. Retrieved September 10, 2017 from https://transitionnetwork.org/about-the-movement/",
      "doi": ""
    },
    {
      "text": "Vasillis Vlachokyriakos, Rob Comber, Clara Crivellaro, Nick Taylor, Stacey Kuznetsov, Andrea Kavanaugh, Christopher A. Le Dantec, and B. Joon Kim. 2015. Designing Alternative Systems for Local Communities. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 2333--2336.  ",
      "doi": "10.1145/2702613.2702657"
    },
    {
      "text": "Amy Voida, Ellie Harmon, and Ban Al-Ani. 2011. Homebrew databases: complexities of everyday information management in nonprofit organizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 915--924.  ",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "Amy Voida, Zheng Yao, and Matthias Korn. 2015. (Infra)structures of Volunteering. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1704--1716.  ",
      "doi": "10.1145/2675133.2675153"
    },
    {
      "text": "Xiaolan Wang, Ron Wakkary, Carman Neustaedter, and Audrey Desjardins. 2015. Information sharing, scheduling, and awareness in community gardening collaboration. In Proceedings of the 7th International Conference on Communities and Technologies (C&T '15). ACM, New York, NY, USA, 79--88.  ",
      "doi": "10.1145/2768545.2768556"
    },
    {
      "text": "Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. 'On the ground' in Sidi Bouzid: investigating social media use during the tunisian revolution. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 1409--1418.  ",
      "doi": "10.1145/2441776.2441935"
    }
  ]
}