{
  "doi": "10.1145/3173574.3174146",
  "title": "MindNavigator: Exploring the Stress and Self-Interventions for Mental Wellness",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Mental wellness is a desirable health outcome for students. However, current personal informatics systems do not adequately support students in creating concrete mental health-related goals and turning them into actionable plans. In this paper, we introduce MindNavigator - a workshop in which groups of college students were invited to generate behavioral change goals to manage daily life stress and practice personalized interventions for two weeks. We describe the manner in which participants identified both stressors and pleasures to create actionable, engaging, and open-ended behavioral plans that aided in stress relief. We found that the social nature of the workshop helped participants understand themselves and execute self-intervention in new ways. Through this practice, we build on prior studies to propose an analytical framework of personal informatics for mental wellness.",
  "tags": [
    "stress management",
    "self-tracking",
    "personal informatics",
    "mental wellness",
    "lived informatics"
  ],
  "authors": [
    {
      "name": "Kwangyoung Lee",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659176941",
      "orcid": "missing"
    },
    {
      "name": "Hwajung Hong",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022414",
      "orcid": "0000-0001-5268-3331"
    }
  ],
  "references": [
    {
      "text": "Elena Agapie, Lucas Colusso, Sean A Munson, and Gary Hsieh. 2016. PlanSourcing: Generating Behavior Change Plans with Friends and Crowds. In CSCW '16 Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work&Social Computing, 119--133.  ",
      "doi": "10.1145/2818048.2819943"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, and Anna L. Cox. 2016. Reflections on 5 Years of Personal Informatics. In CHI EA '16 Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, 2774-- 2781.  ",
      "doi": "10.1145/2851581.2892406"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L Cox, Yunan Chen, and U C L Interaction Centre. 2017. Quantifying the Body and Caring for the Mind?: Self-Tracking in Multiple Sclerosis. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6889--6901.  ",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Shrey Bagroy, Ponnurangam Kumaraguru, and Munmun De Choudhury. 2017. A Social Media Based Index of Mental Well-Being in College Campuses. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 1634--1646.  ",
      "doi": "10.1145/3025453.3025909"
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 5: 1--27.  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Nataly Birbeck, Kellie Morrissey, Patrick Oliver, Shaun Lawson, and Tim Rapley. 2017. Self Harmony?: Rethinking Hackathons to Design and Critique Digital Technologies for Those Affected by Self-Harm. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 146--157.  ",
      "doi": "10.1145/3025453.3025931"
    },
    {
      "text": "Frank W Bond. 2002. Handbook of Brief Cognitive Edited by.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. https://doi.org/The publisher's URL is:",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Center for Collegiate Mental Health. 2017. 2016 Annual Report.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding QuantifiedSelfers' Practices in Collecting and Exploring Personal Data. In CHI '14 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Sheldon Cohen, Tom Kamarck, and Robin Mermelstein. 1983. A Global Measure of Perceived Stress. Journal of Health and Social Behavior 24, 4: 385--396.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, Daniel Avrahami, Jon Froehlich, Louis LeGrand, Ryan Libby, Keith Mosher, and James A. Landay. 2008. Flowers or a Robot Army? Encouraging Awareness&Activity with Personal, Mobile Displays. In UbiComp '08 Proceedings of the 10th international conference on Ubiquitous computing, 54--63.  ",
      "doi": "10.1145/1409635.1409644"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, and James A. Landay. 2009. Goal-Setting Considerations for Persuasive Technologies that Encourage Physical Activity. In Persuasive '09 Proceedings of the 4th International Conference on Persuasive Technology, 1.  ",
      "doi": "10.1145/1541948.1541960"
    },
    {
      "text": "David Coyle, Anja Thieme, Conor Linehan, Madeline Balaam, Jayne Wallace, and Siân Lindley. 2014. Emotional Wellbeing. International Journal of HumanComputer Studies 72, 8--9: 627--628.",
      "doi": ""
    },
    {
      "text": "Elisabeth T Kersten-van Dijk, Joyce H.D.M Westerink, Femke Beute, and Wijnand A Ijsselsteijn. 2017. Personal Informatics, Self-Insight, and Behavior Change?: A Critical Review of Current Literature. Human-Computer Interaction 0, 0: 1--29.  ",
      "doi": "10.1080/07370024.2016.1276456"
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S Kirk. 2017. On Speculative Enactments. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 5386--5399.  ",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Andrew Garbett, David Chatting, David Kirk, and John Vines. 2016. Metadating: Exploring the Romance and Future of Personal Data. In CHI '16 Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 685--698.  ",
      "doi": "10.1145/2858036.2858173"
    },
    {
      "text": "Norman S. Endler and James D. Parker. 1990. Multidimensional Assessment of Coping: A Critical Evaluation. Journal of Personality and Social Psychology 58, 5: 844--854.",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, and Sean A. Munson. 2015. From \"nobody cares\" to \"way to go!\": A Design Framework for Social Sharing in Personal Informatics. In CSCW '15 Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing, 1622-- 1636.  ",
      "doi": "10.1145/2675133.2675135"
    },
    {
      "text": "Daniel A Epstein, Nicole B Lee, Jennifer H Kang, Elena Agapie, Jessica Schroeder, Laura R Pina, James Fogarty, Julie A Kientz, and Sean A Munson. 2017. Examining Menstrual Tracking to Inform the Design of Personal Informatics Tools. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6876--6888.  ",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Daniel A Epstein, An Ping, James Fogarty, and Sean A Munson. 2015. A Lived Informatics Model of Personal Informatics. In UbiComp '15 Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 731--742.  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Daniel Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming Data Complexity in Lifelogs: Exploring Visual Cuts of Personal Informatics Data. In DIS '14 Proceedings of the 2014 conference on Designing interactive systems, 667--676.  ",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Mads Frost, Afsaneh Doryab, Maria Faurholt-Jepsen, Lars Vedel Kessing, and Jakob E. Bardram. 2013. Supporting Disease Insight through Data Analysis: Refinements of the MONARCA Self-Assessment System. In UbiComp '13 Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing, 133--142.  ",
      "doi": "10.1145/2493432.2493507"
    },
    {
      "text": "William Gaver, Mike Michael, Tobie Kerridge, Alex Wilkie, Andy Boucher, Liliana Ovalle, and Matthew Plummer-Fernandez. 2015. Energy Babble: Mixing Environmentally-Oriented Internet Content to Engage Community Groups. In CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1115--1124.  ",
      "doi": "10.1145/2702123.2702546"
    },
    {
      "text": "Karen Glanz, Barbara k. Rimer, and K. Viswanath. 2005. Health behavior and health education: theory, research, and practice.",
      "doi": ""
    },
    {
      "text": "Rebecca Gulotta, Jodi Forlizzi, Rayoung Yang, and Mark Wah Newman. 2016. Fostering Engagement with Personal Informatics Systems. In DIS '16 Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 286--300.  ",
      "doi": "10.1145/2901790.2901803"
    },
    {
      "text": "Noreen Kamal, Sidney Fels, and Kendall Ho. 2010. Online Social Networks for Personal Informatics to Promote Positive Health Behavior. In WSM '10: Proceedings of second ACM SIGMM workshop on Social media, 47--52.  ",
      "doi": "10.1145/1878151.1878167"
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for Mental Wellness?: Understanding Expert Perspectives and Student Experiences. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 629--641.  ",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. In CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 272--283.  ",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Young-ho Kim, Jae Ho Jeon, Bongshin Lee, Eun Kyoung Choe, and Jinwook Seo. 2017. OmniTrack?: A Flexible Self-Tracking Approach Leveraging Semi-Automated Tracking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies: Volume 1 Issue 3, September 2017 1, 3.  ",
      "doi": "10.1145/3130930"
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. In CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3063--3072.  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Artie Konrad, Victoria Bellotti, Nicole Crenshaw, Simon Tucker, Les Nelson, Honglu Du, Peter Pirolli, and Steve Whittaker. 2015. Finding the Adaptive Sweet Spot: Balancing Compliance and Achievement in Automated Stress Reduction. In CHI '15 Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 3829--3838.  ",
      "doi": "10.1145/2702123.2702512"
    },
    {
      "text": "Jisoo Lee, Matthew Kay, Matthew Buman, Winslow Burleson, Eric B Hekler, Erin Walker, Winslow Burleson, Matthew Kay, Matthew Buman, and Eric B Hekler. 2017. Self-Experimentation for Behavior Change?: Design and Formative Evaluation of Two Approaches. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6837--6849.  ",
      "doi": "10.1145/3025453.3026038"
    },
    {
      "text": "Kwangyoung Lee and Hwajung Hong. 2017. Designing for Self-Tracking of Emotion and Experience with Tangible Modality. In DIS '17 Proceedings of the 2017 Conference on Designing Interactive Systems, 465--475.  ",
      "doi": "10.1145/3064663.3064697"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stage-Based Model of Personal Informatics Systems. In CHI '10 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2011. Understanding My Data, Myself: Supporting Self-Reflection with Ubicomp Technologies. In UbiComp '11: Proceedings of the 13th international conference on Ubiquitous computing, 405--414.  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Ian Li, Yevgeniy Medynskiy, Jon Froehlich, and Jakob Eg Larsen. 2012. Personal Informatics in Practice?: Improving Quality of Life Through Data. In CHI EA '12: CHI '12 Extended Abstracts on Human Factors in Computing Systems, 2799--2802.  ",
      "doi": "10.1145/2212776.2212724"
    },
    {
      "text": "Gloria Mark, Yiran Wang, and Melissa Niiya. 2014. Stress and multitasking in everyday college life: an empirical study of online activity. In CHI '14 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 41--50.  ",
      "doi": "10.1145/2556288.2557361"
    },
    {
      "text": "Mark Matthews, Stephen Voida, Saeed Abdullah, Gavin Doherty, Tanzeem Choudhury, Sangha Im, and Geri Gay. 2015. In Situ Design for Mental Illness: Considering the Pathology of Bipolar Disorder in mHealth Design. In MobileHCI '15 Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, 86--97.  ",
      "doi": "10.1145/2785830.2785866"
    },
    {
      "text": "Ranjita Misra and Michelle McKean. 2000. College Students Academic Stress and Its Relation to Their Anxiety, Time Management, and Leisure Satisfaction. American Journal of Health Studies 16, 1: 41--51.",
      "doi": ""
    },
    {
      "text": "Neema Moraveji and Charlton Soesanto. 2012. Towards Stress-less User Interfaces: 10 Design Heuristics Based on the Psychophysiology of Stress. In CHI EA '12 CHI '12 Extended Abstracts on Human Factors in Computing Systems, 1643--1648.  ",
      "doi": "10.1145/2212776.2223686"
    },
    {
      "text": "Sean Munson and Sunny Consolvo. 2012. Exploring Goalsetting, Rewards, Self-monitoring, and Sharing to Motivate Physical Activity. In 2012 6th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth) and Workshops, 25--32.",
      "doi": ""
    },
    {
      "text": "National Center for Complementary and Integrative Health. https://nccih.nih.gov/. Retrieved from https://nccih.nih.gov/",
      "doi": ""
    },
    {
      "text": "Kavous Salehzadeh Niksirat, Chaklam Silpasuwanchai, Mahmoud Mohamed Hussien Ahmed, Peng Cheng, and Xiangshi Ren. 2017. A Framework for Interactive Mindfulness Meditation Using Attention-Regulation Process. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2672--2684.  ",
      "doi": "10.1145/3025453.3025914"
    },
    {
      "text": "William Odom, John Zimmerman, Scott Davidoff, Jodi Forlizzi, Anind K. Dey, and Min Kyung Lee. 2012. A Fieldwork of the Future with User Enactments. In DIS '12 Proceedings of the Designing Interactive Systems Conference, 338--347.  ",
      "doi": "10.1145/2317956.2318008"
    },
    {
      "text": "Crystal L. Park and Susan Folkman. 1997. Meaning in the Context of Stress and Coping. Review of General Psychology 1, 2: 115--144.",
      "doi": ""
    },
    {
      "text": "Laura R. Pina, Sang-Wha Sien, Teresa Ward, Jason C. Yip, Sean A. Munson, James Fogarty, and Julie A. Kientz. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring. In CSCW '17 Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, 2300--2315.  ",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "Aare Puussaar, Adrian K. Clear, and Peter Wright. 2017. Enhancing Personal Informatics Through Social Sensemaking. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6936--6942.  ",
      "doi": "10.1145/3025453.3025804"
    },
    {
      "text": "Ruth Ravichandran, Sang-wha Sien, Shwetak N Patel, Julie A Kientz, and Laura R Pina. 2017. Making Sense of Sleep Sensors?: How Sleep Sensing Technologies Support and Undermine Sleep Health. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, Pages 6864--6875.  ",
      "doi": "10.1145/3025453.3025557"
    },
    {
      "text": "Saeyoung Rho, Injung Lee, Hankyung Kim, Jonghyuk Jung, Hyungi Kim, Bong Gwan Jun, and Youn-kyung Lim. 2017. FutureSelf: What Happens When We Forecast Self-Trackers' Future Health Statuses? In DIS '17: Proceedings of the 2017 Conference on Designing Interactive Systems, 637--648.  ",
      "doi": "10.1145/3064663.3064676"
    },
    {
      "text": "David Robotham. 2008. Stress among higher education students: Towards a research agenda. Higher Education 56, 6: 735--746.",
      "doi": ""
    },
    {
      "text": "Shannon Rodgers, Brittany Maloney, Bernd Ploderer, and Margot Brereton. 2016. Managing Stress, Sleep and Technologies: An Exploratory Study of Australian University Students. In OzCHI '16 Proceedings of the 28th Australian Conference on Computer-Human Interaction, 526--530.  ",
      "doi": "10.1145/3010915.3010961"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal Tracking as Lived Informatics John. In CHI '14 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Will Simm, Maria Angela Ferrario, Adrian Gradinar, Marcia Tavares Smith, Stephen Forshaw, Ian Smith, and Jon Whittle. 2016. Anxiety and Autism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 1270--1281.  ",
      "doi": "10.1145/2858036.2858259"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1994. Grounded theory methodology. Handbook of qualitative research, 273--285.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Thomas D Meyer, and Patrick Olivier. 2015. Designing for Mental Wellbeing?: Towards a More Holistic Approach in the Treatment and Prevention of Mental Illness. In British HCI '15: Proceedings of the 2015 British HCI Conference, 1--10.  ",
      "doi": "10.1145/2783446.2783586"
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror BenZeev, and Andrew T. Campbell. 2014. StudentLife: Assessing Mental Health, Academic Performance and Behavioral Trends of College Students using Smartphones. In UbiComp '14: Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 3--14.  ",
      "doi": "10.1145/2632048.2632054"
    },
    {
      "text": "Thomas L Webb, Eleanor Miles, and Paschal Sheeran. 2012. Dealing With Feeling: A Meta-Analysis of the Effectiveness of Strategies Derived From the Process Model of Emotion Regulation. Psychological bulletin 138, 4: 775--808.",
      "doi": ""
    },
    {
      "text": "Yan Xu, Erika Shehan Poole, Andrew D. Miller, Elsa Eiriksdottir, Dan Kestranek, Richard Catrambone, and Elizabeth D. Mynatt. 2012. This is Not a One-Horse Race: Understanding Player Types in Multiplayer Pervasive Health Games for Youth. In CSCW '12 Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, 843--852.  ",
      "doi": "10.1145/2145204.2145330"
    },
    {
      "text": "Bin Zhu, Anders Hedman, and Haibo Li. 2017. Designing Digital Mindfulness: Presence-In and Presence-With versus Presence-Through. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2685--2695.  ",
      "doi": "10.1145/3025453.3025590"
    }
  ]
}