{
  "doi": "10.1145/3173574.3173796",
  "title": "How Information Sharing about Care Recipients by Family Caregivers Impacts Family Communication",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Previous research has shown that tracking technologies have the potential to help family caregivers optimize their coping strategies and improve their relationships with care recipients. In this paper, we explore how sharing the tracked data (i.e., caregiving journals and patient's conditions) with other family caregivers affects home care and family communication. Although previous works suggested that family caregivers may benefit from reading the records of others, sharing patients' private information might fuel negative feelings of surveillance and violation of trust for care recipients. To address this research question, we added a sharing feature to the previously developed tracking tool and deployed it for six weeks in the homes of 15 family caregivers who were caring for a depressed family member. Our findings show how the sharing feature attracted the attention of care recipients and helped the family caregivers discuss sensitive issues with care recipients.",
  "authors": [
    {
      "name": "Naomi Yamashita",
      "institution": "NTT Communication Science Labs, Kyoto, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Hideaki Kuzuoka",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    },
    {
      "name": "Takashi Kudo",
      "institution": "Osaka University, Osaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556313156",
      "orcid": "missing"
    },
    {
      "name": "Keiji Hirata",
      "institution": "Future University Hakodate, Hakodate, Japan",
      "img": "/do/10.1145/contrib-81339504663/rel-imgonly/selfintro201105.jpg",
      "acmid": "81339504663",
      "orcid": "missing"
    },
    {
      "name": "Eiji Aramaki",
      "institution": "Nara Institute of Science & Technology, Kyoto, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310481229",
      "orcid": "missing"
    },
    {
      "name": "Kazuki Hattori",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163120",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nili R Benazon and James C Coyne. 2000. Living with a depressed spouse. Journal of Family Psychology 14, 1: 71--79.",
      "doi": ""
    },
    {
      "text": "Andrew B. L. Berry, Catherine Lim, Andrea L. Hartzler, Tad Hirsch, Edward H. Wagner, Evette Ludman, and James D. Ralston. 2017. How Values Shape Collaboration Between Patients with Multiple Chronic Conditions and Spousal Caregivers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17), 5257--5270.  ",
      "doi": "10.1145/3025453.3025923"
    },
    {
      "text": "Jed R Brubaker, Caitlin Lustig, and Gillian R Hayes. 2010. PatientsLikeMe: Empowerment and Representation in a Patient-Centered Social Network. In CSCW '10 Workshop on research in healthcare: past, present, and future. Retrieved September 19, 2017 from http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.460.6665&rep=rep1&type=pdf",
      "doi": ""
    },
    {
      "text": "Scott E Caplan and Jacob S Turner. 2007. Bringing theory to research on computer-mediated comforting communication. Computers in Human Behavior 23, 2: 985--998.",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Park Sun Young. 2013. Caring for Caregivers: Designing for Integrality. In Proceedings of the ACM 2013 Conference on Computer Supported Cooperative Work (CSCW'13), 91--102.  ",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14), 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. 2006. Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 457--466.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, Daniel Avrahami, Jon Froehlich, Louis LeGrand, Ryan Libby, Keith Mosher, and James a. Landay. 200 Flowers or a robot army?: Encouraging awareness & activity with personal, mobile displays. In Proceedings of the ACM Conference on Ubiquitous Computing (UbiComp'08), 54--63.  ",
      "doi": "10.1145/1409635.1409644"
    },
    {
      "text": "Neil S. Coulson. 2005. Receiving Social Support Online: An Analysis of a Computer-Mediated Support Group for Individuals Living with Irritable Bowel Syndrome. CyberPsychology & Behavior 8, 6: 580--584.",
      "doi": ""
    },
    {
      "text": "David Coyle and Gavin Doherty. 2009. Clinical Evaluations and Collaborative Design: Developing New Technologies for Mental Healthcare Interventions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'09), 2051--2060.  ",
      "doi": "10.1145/1518701.1519013"
    },
    {
      "text": "1Andy Crabtree, Peter Tolmie, and Will Knight. 2017. Repacking \"Privacy\" for a Networked World. Computer Supported Cooperative Work: CSCW: An International Journal 26, 4--6: 453--488.  ",
      "doi": "10.1007/s10606-017-9276-y"
    },
    {
      "text": "Karen Donelan, Craig A Hill, Catherine Hoffman, Kimberly Scoles, Penny Hollander Feldman, Carol Levine, and David Gould. 2002. Challenged to care: informal caregivers in a changing health system. Health aff (Millwood) 21, 4: 222--31.",
      "doi": ""
    },
    {
      "text": "Susannah Fox and Joanna Brenner. 2012. Family Caregivers Online. Pew Research Center Internet & Technology. Retrieved September 19, 2017 from http://www.pewinternet.org/2012/07/12/family-caregivers-online/",
      "doi": ""
    },
    {
      "text": "Victoria Louise Franklin, Alexandra Greene, Annalu Waller, Stephen Alan Greene, and Claudia Pagliari. 2008. Patients' engagement with \"Sweet Talk\" - a text messaging support system for young people with diabetes. Journal of medical Internet research 10, 2.",
      "doi": ""
    },
    {
      "text": "Carolina Fuentes, Valeria Herskovic, Jurgen Heysen, and Monica Tentori. 2013. Towards a technology for caregivers' emotional expression and self-reflection. In Proceedings of International Conference on Ubiquitous Computing and Ambient Intelligence (UCAmI '13), 143--150.",
      "doi": ""
    },
    {
      "text": "D Gammon, E Arsand, O A Walseth, N Andersson, M Jenssen, and T Taylor. 2005. Parent-child interaction using a mobile and wireless system for blood glucose monitoring. Journal of Medical Internet Research 7, 5: e57.",
      "doi": ""
    },
    {
      "text": "Roland Gasser, Dominique Brodbeck, Markus Degen, Jürg Luthiger, Remo Wyss, and Serge Reichlin. 2006. Persuasiveness of a Mobile Lifestyle Coaching Application Using Social Facilitation. In Proceedings of International Conference on Persuasive Technology (Persuasive'06), 27--38. ",
      "doi": "10.5555/1986822.1986828"
    },
    {
      "text": "Rachael Gooberman-Hill and Shah Ebrahim. 2006. Informal care at times of change in health and mobility: A qualitative study. Age and Ageing 35, 3: 261--266.",
      "doi": ""
    },
    {
      "text": "Ian H. Gotlib. Interpersonal and Cognitive Aspects of Depression. Current Directions in Psychological Science 1, 149--154.",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Desney Tan, and Dan Morris. 2009. Toward technologies that support family reflections on health. In Proceedinfs of the ACM Conference on Supporting Group Work (GROUP'09), 311--3  ",
      "doi": "10.1145/1531674.1531721"
    },
    {
      "text": "2Gillian R. Hayes and Gregory D. Abowd. 2006. Tensions in designing capture technologies for an evidence-based care community. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06), 937--946.  ",
      "doi": "10.1145/1124772.1124911"
    },
    {
      "text": "2Lesa Lorenzen Huber, Kalpana Shankar, Kelly Caine, Kay Connelly, L. Jean Camp, Beth Ann Walker, and Lisa Borrero. 2013. How In-Home Technologies Mediate Caregiving Relationships in Later Life. International Journal of Human-Computer Interaction 29, 7: 441--455.",
      "doi": ""
    },
    {
      "text": "Jina Huh and Mark S Ackerman. 2012. Collaborative Help in Chronic Disease Management: Supporting Individualized Problems. In Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW'12), 853--862.  ",
      "doi": "10.1145/2145204.2145331"
    },
    {
      "text": "M Jacob, E Frank, D J Kupfer, and L L Carpenter. 1987. Recurrent depression: an assessment of family burden and family attitudes. The Journal of clinical psychiatry 48, 10: 395--400. Retrieved September 18, 2017 from http://www.ncbi.nlm.nih.gov/pubmed/3667537",
      "doi": ""
    },
    {
      "text": "Thomas Joiner and James C. Coyne. 1999. The interactional nature of depression: Advances in interpersonal approaches. American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Gabor I. Keitner, Chrisine E. Ryan, I. W. Miller, R. Kohn, D. S. Bishop, and N. B. Epstein. 1995. Role of the family in recovery and major depression. American Journal of Psychiatry 152, 7: 1002--1008.",
      "doi": ""
    },
    {
      "text": "Gabor I Keitner and Ivan W Miller. 1990. Family functioning and major depression: an overview. American Journal of Psychiatry 147, 9: 1128--1137.",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja and Wanda Pratt. 2012. Healthcare in the pocket: Mapping the space of mobile-phone health interventions. Journal of Biomedical Informatics 45, 1: 184--198.  ",
      "doi": "10.1016/j.jbi.2011.08.017"
    },
    {
      "text": "Juddy Kopp. 1988. Self-monitoring: A literature review of research and practice. Social Work Research and Abstracts 24, 4: 8--20.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2011. Understanding My Data, Myself: Supporting Self-Reflection with Ubicomp Technologies. In Proceedings of the ACM Conference on Ubiquitous Computing (Ubicomp'11), 405--414.  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "3Deborah Lupton. 2016. The quantified self: a sociology of self-tracking. Polity. ",
      "doi": "10.5555/3052450"
    },
    {
      "text": "3Clara Mancini, Yvonne Rogers, Keerthi Thomas, Adam N. Joinson, Blaine A. Price, Arosha K. Bandara, Lukasz Jedrzejczyk, and Bashar Nuseibeh. 2011. In the best families: tracking and relationships. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2419--2428.  ",
      "doi": "10.1145/1978942.1979296"
    },
    {
      "text": "3Mark Matthews and Gavin Doherty. 2011. In the mood: Engaging teenagers in psychotherapy using mobile phones. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI'11), 2947--2956.  ",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "Jeff Mitchell. 2008. Understanding Depression: A Complete Guide to Its Diagnosis and Treatment, 2nd ed. Primary Care Companion to The Journal of Clinical Psychiatry 10, 3: 257. Retrieved September 18, 2017 from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2446480/",
      "doi": ""
    },
    {
      "text": "Jami L Obermayer, William T Riley, Ofer Asif, and Jersino Jean-Mary. 2004. College smoking-cessation using cell phone text messaging. Journal of American College Health 53, 2: 71--8.",
      "doi": ""
    },
    {
      "text": "Laura R. Pina, Sang-Wha Sien, Teresa Ward, Jason C. Yip, Sean A. Munson, James Fogarty, and Julie A. Kientz. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring. In Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 2300--2315.  ",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "3William Riley, Jami Obermayer, and Jersino Jean-Mary. 2008. Internet and mobile phone text messaging intervention for college smokers. Journal of American College Health 57, 2: 245--248.",
      "doi": ""
    },
    {
      "text": "3John Rooksby, Mattias Rost, Alistair Morrison, Matthew Chalmers Chalmers, John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "3Marco de Sá, Luís Carriço, and Pedro Antunes. 2007. Defining personalized therapies for handheld devices. In Proceedings of the ACM Symposium on Applied Computing (SAC '07), 163--164.  ",
      "doi": "10.1145/1244002.1244043"
    },
    {
      "text": "Deborah A. Salem, G. Anne Bogat, and Christina Reid. 1997. Mutual help goes on-line. Journal of Community Psychology 25, 2: 189--207.",
      "doi": ""
    },
    {
      "text": "4Marén Schorch, Lin Wan, David William Randall, and Volker Wulf. 2016. Designing for Those who are Overlooked - Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 785--797.  ",
      "doi": "10.1145/2818048.2819999"
    },
    {
      "text": "4Karen A. Schwarz and Cheryl S. Elman. 2003. Identification of factors predictive of hospital readmissions for patients with heart failure. Heart Lung 32, 2: 88--99.",
      "doi": ""
    },
    {
      "text": "4Nidhi Sharma, Subho Chakrabarti, and Sandeep Grover. 2016. Gender differences in caregiving among family - caregivers of people with mental illnesses. World journal of psychiatry 6, 1: 7--17.",
      "doi": ""
    },
    {
      "text": "4Misook Sohn and Jeunwoo Lee. 2007. UP health: Ubiquitously persuasive health promotion with an instant messaging system. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07), 2663--2668.  ",
      "doi": "10.1145/1240866.1241059"
    },
    {
      "text": "4Strauss AL and Corbin JM. 1998. Basics of Qualitative Research?: Techniques and Procedures for Developing Grounded Theory. Sage publications. Retrieved September 18, 2017 from file:///C:/Users/dezel/Downloads/BASIC+OF+QUALITATIVE+RESEARCH-Strauss&Corbin+1998 (1).pdf",
      "doi": ""
    },
    {
      "text": "4Matthieu Tixier and Myriam Lewkowicz. 2016. \"Counting on the Group\": Reconciling Online and Offline Social Support among Older Informal Caregivers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 3545--3558.  ",
      "doi": "10.1145/2858036.2858477"
    },
    {
      "text": "4Tammy Toscos, Kay Connelly, and Yvonne Rogers. 2012. Best Intentions: Health Monitoring Technology and Children. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '12), 1431--1440.  ",
      "doi": "10.1145/2207676.2208603"
    },
    {
      "text": "4Cornelia F. van Uden-Kraan, Constance H. C. Drossaert, Erik Taal, Bret R. Shaw, Erwin R. Seydel, and Mart A. F. J. van de Laar. 2008. Empowering Processes and Outcomes of Participation in Online Support Groups for Patients With Breast Cancer, Arthritis, or Fibromyalgia. Qualitative Health Research 18, 3: 405--417.",
      "doi": ""
    },
    {
      "text": "4C Y Wang and M M Fenske. 1996. Self-care of adults with non-insulin-dependent diabetes mellitus: influence of family and friends. Diabetes Educ 22, 5: 465--70. Retrieved from http://www.ncbi.nlm.nih.gov/pubmed/8936125",
      "doi": ""
    },
    {
      "text": "Marsha White and Steve M Dorman. 2001. Receiving social support online: Implications for health education. Health Education Research: Theory & Practice Pages 16, 6: 693--707.",
      "doi": ""
    },
    {
      "text": "5Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing Moods: How Manual Tracking by Family Caregivers Improves Caring and Family Communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17), 158--169.  ",
      "doi": "10.1145/3025453.3025843"
    }
  ]
}