{
  "doi": "10.1145/3173574.3174182",
  "title": "\"We Don't Do That Here\": How Collaborative Editing with Mentors Improves Engagement in Social Q&A Communities",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Online question-and-answer (Q&A) communities like Stack Overflow have norms that are not obvious to novice users. Novices create and post programming questions without feedback, and the community enforces site norms through public downvoting and commenting. This can leave novices discouraged from further participation. We deployed a month long, just-in-time mentorship program to Stack Overflow in which we redirected novices in the process of asking a question to an on-site Help Room. There, novices received feedback on their question drafts from experienced Stack Overflow mentors. We present examples and discussion of various question improvements including: question context, code formatting, and wording that adheres to on-site cultural norms. We find that mentored questions are substantially improved over non-mentored questions, with average scores increasing by 50%. We provide design implications that challenge how socio-technical communities onboard novices across domains.",
  "authors": [
    {
      "name": "Denae Ford",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/do/10.1145/contrib-99658751734/rel-imgonly/99658751734.jpg",
      "acmid": "99658751734",
      "orcid": "missing"
    },
    {
      "name": "Kristina Lustig",
      "institution": "Stack Exchange, Inc., New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261918",
      "orcid": "missing"
    },
    {
      "name": "Jeremy Banks",
      "institution": "Stack Exchange, Inc., New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260792",
      "orcid": "missing"
    },
    {
      "name": "Chris Parnin",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314484662",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tammy D. Allen, Kristen M. Shockley, and Laura Poteat. 2010. Protege anxiety attachment and feedback in mentoring relationships. Journal of Vocational Behavior 77, 1 (2010), 73--80.",
      "doi": ""
    },
    {
      "text": "Muhammad Asaduzzaman, Ahmed Shah Mashiyat, Chanchal K. Roy, and Kevin A. Schneider. 2013. Answering Questions About Unanswered Questions of Stack Overflow. In Proceedings of the 10th Working Conference on Mining Software Repositories (MSR '13). 97--100. ",
      "doi": "10.5555/2487085.2487109"
    },
    {
      "text": "Jeff Atwood. 2009. Non-English Question Policy. (July 2009). Retrieved September 11, 2017 from https://stackoverflow.blog/2009/07/23/ non-english-question-policy/",
      "doi": ""
    },
    {
      "text": "Peter Bailey, Nick Craswell, and David Hawking. 2000. Dark matter on the web. In Proceedings of the 2000 9th World Wide Web Conference. 2.",
      "doi": ""
    },
    {
      "text": "Robert A. Baron. 1993. Criticism (informal negative feedback) as a source of perceived unfairness in organizations: Effects, mechanisms, and countermeasures. (1993), 155--170.",
      "doi": ""
    },
    {
      "text": "Adam D'Angelo. 2016. Quora in Spanish is Now Open to the World. (9 October 2016). Retrieved September 11, 2017 from https://blog.quora.com/ Quora-in-Spanish-is-Now-Open-to-the-World.",
      "doi": ""
    },
    {
      "text": "Michael L. Epstein, Amber D. Lazarus, Tammy B. Calvano, Kelly A. Matthews, Rachel A. Hendel, Beth B. Epstein, and Gary M. Brosvic. 2002. Immediate Feedback Assessment Technique Promotes Learning and Corrects Inaccurate first Responses. The Psychological Record 52, 2 (Apr 2002), 187--201.",
      "doi": ""
    },
    {
      "text": "Sarah Evans, Katie Davis, Abigail Evans, Julie Ann Campbell, David P. Randall, Kodlee Yin, and Cecilia Aragon. 2017. More Than Peer Production: Fanfiction Communities as Sites of Distributed Mentoring. In Proceedings of the 20th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '17). ACM, New York, NY, USA, 259--272.  ",
      "doi": "10.1145/2998181.2998342"
    },
    {
      "text": "Stack Exchange. 2017a. Stack Exchange Data Explorer. (11 September 2017). Retrieved September 11, 2017 from https://data.stackexchange.com/.",
      "doi": ""
    },
    {
      "text": "Stack Exchange. 2017b. The world's Largest Programming Community is Growing. (11 September 2017). Retrieved September 11, 2017 from https://stackexchange.com/about.",
      "doi": ""
    },
    {
      "text": "Donald B. Fedor, Walter D. Davis, John M. Maslyn, and Kieran Mathieson. 2001. Performance improvement efforts in response to negative feedback: The roles of source power and recipient self-esteem. Journal of Management 27, 1 (2001), 79--97.",
      "doi": ""
    },
    {
      "text": "Anna Filippova and Hichang Cho. 2015. Mudslinging and Manners: Unpacking Conflict in Free and Open Source Software. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1393--1403.  ",
      "doi": "10.1145/2675133.2675254"
    },
    {
      "text": "Denae Ford, Kristina Lustig, Jeremy Banks, and Chris Parnin. 2017. Stack Overflow Mentorship Experiment Study Materials. (11 September 2017). http://go.ncsu.edu/p1qf43.",
      "doi": ""
    },
    {
      "text": "Denae Ford, Justin Smith, Philip J. Guo, and Chris Parnin. 2016. Paradise Unplugged: Identifying Barriers for Female Participation on Stack Overflow. In Proceedings of the 24th ACM SIGSOFT International Symposium on Foundations of Software Engineering (FSE '16). ACM, New York, NY, USA, 846--857.  ",
      "doi": "10.1145/2950290.2950331"
    },
    {
      "text": "Lee Giles and Steve Lawrence. 1999. Accessibility and distribution of information on the web. Nature 400, 6740 (1999), 107--109.",
      "doi": ""
    },
    {
      "text": "Philip J. Guo, Jeffery White, and Renan Zanelatto. 2015. Codechella: Multi-User Program Visualizations for Real-Time Tutoring and Collaborative Learning. In Proceedings of the 2015 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC '15). 79--87.",
      "doi": ""
    },
    {
      "text": "Reid Hoffman. 2017. Masters of Scale: Handcrafted. (3 May 2017). Retrieved September 11, 2017 from https://mastersofscale.com/.",
      "doi": ""
    },
    {
      "text": "February Helen Keeney. 2017. Making it Easier to Grow Communities on GitHub. (25 July 2017). Retrieved September 11, 2017 from https://github.com/blog/ 2397-making-it-easier-to-grow-communities-on-github.",
      "doi": ""
    },
    {
      "text": "Robert E. Kraut, Paul Resnick, Sara Kiesler, Moira Burke, Yan Chen, Niki Kittur, Joseph Konstan, Yuqing Ren, and John Riedl. 2012. Building Successful Online Communities: Evidence-Based Social Design. MIT Press. 21--76, 80--97, 145--147, 179--230 pages. ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Chinmay E. Kulkarni, Michael S. Bernstein, and Scott R. Klemmer. 2015. PeerStudio: Rapid Peer Feedback Emphasizes Revision and Improves Performance. In Proceedings of the 2nd ACM Conference on Learning @ Scale (L@S '15). ACM, New York, NY, USA, 75--84.  ",
      "doi": "10.1145/2724660.2724670"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Bella Manoim, Manas Mittal, George Hripcsak, and Björn Hartmann. 2011. Design Lessons from the Fastest Q&A Site in the West. In Proceedings of the 29th ACM Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2857--2866.  ",
      "doi": "10.1145/1978942.1979366"
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The Heart Work of Wikipedia: Gendered, Emotional Labor in the World's Largest Online Encyclopedia. In Proceedings of the 33rd ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 207--210.  ",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "Blair Nonnecke, Dorine Andrews, and Jenny Preece. 2006. Non-public and public online community participation: Needs, attitudes and behavior. Electronic Commerce Research 6, 1 (2006), 7--20.  ",
      "doi": "10.1007/s10660-006-5985-x"
    },
    {
      "text": "Stack Overflow. 2017a. 2017 Stack Overflow Developer Survey. (22 March 2017). Retrieved March 27, 2017 from https://stackoverflow.com/insights/survey/2017.",
      "doi": ""
    },
    {
      "text": "Stack Overflow. 2017b. How do I Ask a Good Question? (11 September 2017). Retrieved September 11, 2017 from https://stackoverflow.com/help/how-to-ask.",
      "doi": ""
    },
    {
      "text": "Stack Overflow. 2017c. How to Create a Minimal, Complete, and Verifiable Example. (11 September 2017). Retrieved September 11, 2017 from https://stackoverflow.com/help/mcve.",
      "doi": ""
    },
    {
      "text": "Leysia Palen, Robert Soden, T. Jennings Anderson, and Mario Barrenechea. 2015. Success & Scale in a Data-Producing Organization: The Socio-Technical Evolution of OpenStreetMap in Response to Humanitarian Events. In Proceedings of the 33rd ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 4113--4122.  ",
      "doi": "10.1145/2702123.2702294"
    },
    {
      "text": "Simbawulf. 2017. Introducing r/popular. (15 February 2017). Retrieved September 11, 2017 from https://www.reddit.com/r/announcements/comments/ 5u9pl5/introducing_rpopular/.",
      "doi": ""
    },
    {
      "text": "Rogier Slag, Mike de Waard, and Alberto Bacchelli. 2015. One-day flies on StackOverflow: Why the vast majority of StackOverflow users only posts once. In Proceedings of the 12th IEEE/ACM Working Conference on Mining Software Repositories (MSR '15). 458--461. ",
      "doi": "10.5555/2820518.2820586"
    },
    {
      "text": "Igor Steinmacher, Tayana Conte, Marco Aurélio Gerosa, and David Redmiles. 2015. Social Barriers Faced by Newcomers Placing Their First Contribution in Open Source Software Projects. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1379--1392.  ",
      "doi": "10.1145/2675133.2675215"
    },
    {
      "text": "Erik H. Trainer, Arun Kalyanasundaram, and James D. Herbsleb. 2017. e-Mentoring for Software Engineering: A Socio-technical Perspective. In Proceedings of the 39th International Conference on Software Engineering: Software Engineering and Education Track (ICSE-SEET '17). 107--116.  ",
      "doi": "10.1109/ICSE-SEET.2017.19"
    },
    {
      "text": "Bogdan Vasilescu, Andrea Capiluppi, and Alexander Serebrenik. 2014. Gender, representation and online participation: A quantitative study. Interacting with Computers 26, 5 (2014), 488--511.",
      "doi": ""
    },
    {
      "text": "Etienne Wenger. 1998. Communities of practice: Learning, meaning, and identity. Cambridge university press.",
      "doi": ""
    }
  ]
}