{
  "doi": "10.1145/3173574.3173875",
  "title": "Greater than the Sum of its PARTs: Expressing and Reusing Design Intent in 3D Models",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "With the increasing popularity of consumer-grade 3D printing, many people are creating, and even more using, objects shared on sites such as Thingiverse. However, our formative study of 962 Thingiverse models shows a lack of re-use of models, perhaps due to the advanced skills needed for 3D modeling. An end user program perspective on 3D modeling is needed. Our framework (PARTs) empowers amateur modelers to graphically specify design intent through geometry. PARTs includes a GUI, scripting API and exemplar library of assertions which test design expectations and integrators which act on intent to create geometry. PARTs lets modelers integrate advanced, model specific functionality into designs, so that they can be re-used and extended, without programming. In two workshops, we show that PARTs helps to create 3D printable models, and modify existing models more easily than with a standard tool.",
  "tags": [
    "fabrication",
    "prototyping",
    "3d printing"
  ],
  "authors": [
    {
      "name": "Megan Hofmann",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99658652727/rel-imgonly/headshot__2_.jpg",
      "acmid": "99658652727",
      "orcid": "0000-0003-2283-8587"
    },
    {
      "name": "Gabriella Hann",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261373",
      "orcid": "missing"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    }
  ],
  "references": [
    {
      "text": "Mathieu Acher, Benoit Baudry, Olivier Barais, and Jean-Marc Jézéquel. 2014. Customization and 3D Printing: A Challenging Playground for Software Product Lines. In Proceedings of the 18th International Software Product Line Conference - Volume 1 (SPLC '14), 142--146.  ",
      "doi": "10.1145/2648511.2648526"
    },
    {
      "text": "Daniel Ashbrook, Shitao Stan Guo, and Alan Lambie. 2016. Towards Augmented Fabrication: Combining Fabricated and Existing Objects. In The 2016 CHI Conference Extended Abstracts, 1510--1518.  ",
      "doi": "10.1145/2851581.2892509"
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1997. Contextual Design: Defining Customer-Centered Systems. Elsevier. ",
      "doi": "10.5555/523184"
    },
    {
      "text": "P Blikstein. 2013. Digital fabrication and 'making'in education: The democratization of invention. FabLabs: Of machines.",
      "doi": ""
    },
    {
      "text": "A Boating. 1979. Thinglab-a constraint-oriented simulation laboratory. SSL-79--3, Xerox PARC, Palo Alto, CA. Table 4. Workshop model and print results. Failures are shown with a red halo and the partially functional model from W1 has a black frame (A4). Unsuccessful designs by A3 and A6 are not shown because they could not be printed. A1 A2 A4 A5 W1: Successful Prints B1 B2 B3 B4 W2: F360 W2: PARTS W2: Succesful Prints",
      "doi": ""
    },
    {
      "text": "Alan Borning. 1981. The programming language aspects of ThingLab, a constraint-oriented simulation laboratory. ACM Transactions on Programming Languages and Systems (TOPLAS) 3, 4: 353--387.  ",
      "doi": "10.1145/357146.357147"
    },
    {
      "text": "Erin Buehler, Niara Comrie, Megan Hofmann, Samantha McDonald, and Amy Hurst. 2016. Investigating the Implications of 3D Printing in Special Education. ACM Trans. Access. Comput. 8, 3: 11:1-- 11:28.  ",
      "doi": "10.1145/2870640"
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014. ABC and 3D: Opportunities and Obstacles to 3D Printing in Special Education Environments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 107--114.  ",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Jack B Dennis. 1973. Modularity. In Software Engineering. Springer, 128--182. ",
      "doi": "10.5555/647430.723703"
    },
    {
      "text": "Chang-Xue Feng and Andrew Kusiak. 1995. Constraint-based design of parts. Computer-Aided Design 27, 5: 343--352.",
      "doi": ""
    },
    {
      "text": "Christoph M. Flath, Sascha Friesike, Marco Wirth, and Frédéric Thiesse. 2017. Copy, transform, combine: exploring the remix as a form of innovation. Journal of Information Technology 32, 4: 306--325.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, David Carr, Emily Lovell, and Hiroshi Ishii. 2010. CopyCAD: RemixingPhysical Objects with Copy and Paste from the Real World. In Adjunct Proceedings of the 23Nd Annual ACM Symposium on User Interface Software showand Technology (UIST '10), 381--382.  ",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "Rajaram Ganeshan, James Garrett, and Susan Finger. 1994. A framework for representing design intent. Design Studies 15, 1: 59--84.",
      "doi": ""
    },
    {
      "text": "Michelle Gantt and Bonnie A. Nardi. 1992. Gardeners and Gurus: Patterns of Cooperation Among CAD Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92), 107--117.  ",
      "doi": "10.1145/142750.142767"
    },
    {
      "text": "Björn Hartmann, Daniel MacDougall, Joel Brandt, and Scott R. Klemmer. 2010. What Would Other Programmers Do: Suggesting Solutions to Error Messages. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1019--1028.  ",
      "doi": "10.1145/1753326.1753478"
    },
    {
      "text": "Tyson R Henry and Scott E Hudson. 1988. Using active data in a UIMS. In Proceedings of the 1st annual ACM SIGGRAPH symposium on User Interface Software, 167--178.  ",
      "doi": "10.1145/62402.62429"
    },
    {
      "text": "Nathaniel Hudson, Celena Alcock, and Parmit K Chilana. 2016. Understanding Newcomers to 3D Printing: Motivations, Workflows, and Barriers of Casual Makers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 384--396.  ",
      "doi": "10.1145/2858036.2858266"
    },
    {
      "text": "Michael D. Jones, Kevin Seppi, and Dan R. Olsen. 2016. What You Sculpt is What You Get: Modeling Physical Interactive Devices with Clay and 3D Printed Widgets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 876--886.  ",
      "doi": "10.1145/2858036.2858493"
    },
    {
      "text": "Jeeeun Kim, Anhong Guo, Tom Yeh, Scott Hudson, and Jennifer Mankoff. 2017. Understanding Uncertainty in Measurement and Accommodating its Impact in 3D Modeling and Printing. In Proceedings of the 2017 ACM Conference on Designing Interactive Systems.  ",
      "doi": "10.1145/3064663.3064690"
    },
    {
      "text": "Fumihiko Kimura and Hiromasa Suzuki. 1989. A CAD system for efficient product design based on design intent. CIRP Annals-Manufacturing Technology 38, 1: 149--152.",
      "doi": ""
    },
    {
      "text": "Siniša Kolarić, Halil Erhan, Robert Woodbury, and Bernhard E. Riecke. 2010. Comprehending Parametric CAD Models: An Evaluation of Two Graphical User Interfaces. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10), 707--710.  ",
      "doi": "10.1145/1868914.1869010"
    },
    {
      "text": "FB Kong, Xin Guo Ming, L Wang, XH Wang, and PP Wang. 2009. On modular products development. Concurrent Engineering 17, 4: 291--300.",
      "doi": ""
    },
    {
      "text": "Yuki Koyama, Shinjiro Sueda, Emma Steinhardt, Takeo Igarashi, Ariel Shamir, and Wojciech Matusik. 2015. AutoConnect: Computational Design of 3D-printable Connectors. ACM Trans. Graph. 34, 6: 231:1--231:11.  ",
      "doi": "10.1145/2816795.2818060"
    },
    {
      "text": "Vladislav Kreavoy, Dan Julius, and Alla Sheffer. 2007. Model Compositionfrom Interchangeable Components. In Proceedings of the 15th Pacific Conference on Computer Graphics and Applications (PG '07), 129-- 138.  ",
      "doi": "10.1109/PG.2007.43"
    },
    {
      "text": "Manfred Lau, Akira Ohgawara, Jun Mitani, and Takeo Igarashi. 2011. Converting 3D Furniture Models to Fabricatable Parts and Connectors. In ACM SIGGRAPH 2011 Papers (SIGGRAPH '11), 85:1--85:6.  ",
      "doi": "10.1145/1964921.1964980"
    },
    {
      "text": "Ghang Lee, Charles M Eastman, Tarang Taunk, and Chun-Heng Ho. 2010. Usability principles and best practices for the user interface design of complex 3D architectural designand engineeringtools. International Journal of Human-Computer Studies 68, 1--2: 90--104.  ",
      "doi": "10.1016/j.ijhcs.2009.10.001"
    },
    {
      "text": "Ming Li, Frank C Langbein, and Ralph R Martin. 2010. Detecting design intent in approximate CAD models using symmetry. Computer-Aided Design 42, 3: 183-- 201.  ",
      "doi": "10.1016/j.cad.2009.10.001"
    },
    {
      "text": "Lin Lu, Andrei Sharf, Haisen Zhao, Yuan Wei, Qingnan Fan, Xuelin Chen, Yann Savoye, Changhe Tu, Daniel Cohen-Or, and Baoquan Chen. 2014. Build-to-last: strength to weight 3D printed objects. ACM Transactions on Graphics (TOG) 33, 4: 97--10.  ",
      "doi": "10.1145/2601097.2601168"
    },
    {
      "text": "Thomas Ludwig, Oliver Stickel, Alexander Boden, and Volkmar Pipek. 2014. Towards sociable technologies: an empirical study on designing appropriation infrastructures for 3D printing. In DIS '14: Proceedings of the 2014 conference on Designing interactive systems.  ",
      "doi": "10.1145/2598510.2598528"
    },
    {
      "text": "Allan MacLean, Kathleen Carter, Lennart Lövstrand, and Thomas Moran. 1990. User-tailorable Systems: Pressing the Issues with Buttons. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90), 175--182.  ",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "Satoshi Matsuoka, Shin Takahashi, Tomihisa Kamada, and Akinori Yonezawa. 1992. A general framework for bidirectional translation between abstract and pictorial data. ACM Transactions on Information Systems (TOIS) 10, 4: 408--437.  ",
      "doi": "10.1145/146486.146557"
    },
    {
      "text": "Jarkko Moilanen, Angela Daly, Ramon Lobato, and Darcy Allen. 2014. Cultures of sharing in 3D printing: What can we learn from the licence choices of Thingiverse users?",
      "doi": ""
    },
    {
      "text": "Catarina Mota. 2011. The rise of personal fabrication. In C&C '11: Proceedings of the 8th ACM conference on Creativity and cognition.  ",
      "doi": "10.1145/2069618.2069665"
    },
    {
      "text": "Don Norman. 1988. The Psychology of Everyday Things. Basic Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 639--648.  ",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "Dan R Olsen Jr and Kirk Allan. 1990. Creating interactive techniques by symbolically solving geometric constraints. In Proceedings of the 3rd annual ACM SIGGRAPH symposium on User interface software and technology, 102--107.  ",
      "doi": "10.1145/97924.97936"
    },
    {
      "text": "Colin Potts and Glenn Bruns. 1988. Recording the reasons for design decisions. In Software Engineering, 1988., Proceedings of the 10th International Conference on, 418--427. ",
      "doi": "10.5555/55823.55863"
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 103--108.  ",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "R Shewbridge, A Hurst, and S K Kane. 2014. Everyday making: identifying future uses for 3D printing in the home. ACM Conference on Designing Interactive Technology.  ",
      "doi": "10.1145/2598510.2598544"
    },
    {
      "text": "Ivan E Sutherland. 1964. Sketchpad a man-machine graphical communication system. Transactions of the Society for Computer Simulation 2, 5: R--3.",
      "doi": ""
    },
    {
      "text": "Robert W Taylor, Allan Heydon, and Greg Nelson. 1994. The Juno-2 constraint-based drawing editor. In Technical Report 131a, Digital Systems Research.",
      "doi": ""
    },
    {
      "text": "Juraj Vanek, Jorge AG Galicia, and Bedrich Benes. 2014. Clever support: Efficient support structure generation for digital fabrication. In Computer graphics forum, 117--125.",
      "doi": ""
    },
    {
      "text": "AR Venkatachalam. 1994. Automating manufacturability evaluation in CAD systems through expert systems approaches. Expert Systems with Applications 7, 4: 495--506.",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Bruno Araujo, Tovi Grossman, and Daniel Wigdor. 2016. Object-Oriented Drawing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4610--4621.  ",
      "doi": "10.1145/2858036.2858075"
    },
    {
      "text": "Xiang \"Anthony\" Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, andCustomizing 3D Printable Adaptations onEverydayObjects. In Proceedings of the 29th Annual ACM Symposium on User Interface Software and Technology.  ",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Brad Vander Zanden, Brad A Myers, Dario Giuse, and Pedro Szekely. 1991. The importance of pointer variables inconstraint models. In Proceedings of the 4th annual ACM symposium on User interface software and technology, 155--164.  ",
      "doi": "10.1145/120782.120799"
    },
    {
      "text": "Tinkercad.com Features | Tinkercad. Retrieved March 21, 2016 from https://www.tinkercad.com/about/features",
      "doi": ""
    },
    {
      "text": "Interference Check | 3D CAD Solutions | SOLIDWORKS. Retrieved April 4, 2017 from http://www.solidworks.com/sw/products/3dcad/interference-check.htm",
      "doi": ""
    },
    {
      "text": "Start a solid body using basic shapes. Retrieved August 29, 2017 from http://help.autodesk.com/view/fusion360/ENU/?guid= GUID-9DECFD77-D3AF-4EA8--98D6CA8A647E5BA4",
      "doi": ""
    },
    {
      "text": "Design Intent | Fusion 360 | Autodesk Knowledge Network. Retrieved August 29, 2017 from https://knowledge.autodesk.com/support/fusion360/learnexplore/caas/CloudHelp/cloudhelp/ENU/FusionForm/files/GUID-CE02E095--6A90--4DCC-B89F4D70185BC69D-htm.html",
      "doi": ""
    },
    {
      "text": "Learning | How to create components. Retrieved August 29, 2017 from http://help.autodesk.com/view/fusion360/ENU/?guid= GUID-5966BF6B-4135--49B3-B5BF-29A6577C9E72",
      "doi": ""
    },
    {
      "text": "2016 SOLIDWORKS Help - Hole Wizard Overview. Retrieved September 13, 2017 from http://help.solidworks.com/2016/english/solidworks/sl dworks/c_hole_wizard_overview.htm",
      "doi": ""
    },
    {
      "text": "Smart Components and Smart Fasteners | SOLIDWORKS. Retrieved August 30, 2016 from http://www.solidworks.com/sw/products/3d-cad/smartcomponents-and-smart-fasteners.htm",
      "doi": ""
    }
  ]
}