{
  "doi": "10.1145/3173574.3174024",
  "title": "Double-sided Printed Tactile Display with Electro Stimuli and Electrostatic Forces and its Assessment",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Humans can perceive tactile sensation through multimodal stimuli. To demonstrate realistic pseudo tactile sensation for the users, a tactile display is needed that can provide multiple tactile stimuli. In this paper, we have explicated a novel printed tactile display that can provide both the electrical stimulus and the electrostatic force. The circuit patterns for each stimulus were fabricated by employing the technique of double-sided conductive ink printing. Requirements for the fabrication process were analyzed and the durability of the tactile display was evaluated. Users' perceptions of a single tactile stimulus and multiple tactile stimuli were also investigated. The obtained experimental results indicate that the proposed tactile display is capable of exhibiting realistic tactile sensation and can be incorporated by various applications such as tactile sensation printing of pictorial illustrations and paintings. Furthermore, the proposed hybrid tactile display can contribute to accelerated prototyping and development of new tactile devices.",
  "tags": [
    "conductive ink",
    "double-sided printing",
    "electrical stimulus",
    "multiple stimuli",
    "electrostatic force",
    "tactile display"
  ],
  "authors": [
    {
      "name": "Kunihiro Kato",
      "institution": "Meiji University, Nakano, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658641922",
      "orcid": "missing"
    },
    {
      "name": "Hiroki Ishizuka",
      "institution": "Kagawa University, Takamatsu, Kagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660750696",
      "orcid": "missing"
    },
    {
      "name": "Hiroyuki Kajimoto",
      "institution": "The University of Electro-Communications, Choufu, Choufugaoka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100131163",
      "orcid": "missing"
    },
    {
      "name": "Homei Miyashita",
      "institution": "Meiji University, Nakano-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81461654671/rel-imgonly/0f4c71c0.jpg",
      "acmid": "81461654671",
      "orcid": "0000-0001-7533-8709"
    }
  ],
  "references": [
    {
      "text": "Takafumi Aoki, Hironori Mitake, Danial Keoki, Shoichi Hasegawa, and Makoto Sato. 2009. Wearable Haptic Device to Present Contact Sensation Based on Cutaneous Sensation Using Thin Wire. In Proceedings of the International Conference on Advances in Computer Enterntainment Technology (ACE ' 09), 115--122.  ",
      "doi": "10.1145/1690388.1690408"
    },
    {
      "text": "Henrik Andersson, Anatoliy Manuilskiy, Stefan Haller, and Hans-Erik Nilsson. 2014. Assembling surface mounted components on inkjet printed double sided paper circuit board. Journal of Nanotechnology, Vol.25, No.9.",
      "doi": ""
    },
    {
      "text": "Jawshan Ara, Sun Hee Hwang, Tongjin Song, and Gon Khang. 2014. Effects of the Stimulus Parameters on the Tactile Sensations Elicited by Single-Channel Transcutaneous Electrical Stimulation. International Journal of Precision Engineering and Manufacturing, Vol.15, Issue 2, 305--313.",
      "doi": ""
    },
    {
      "text": "Shuhei Asano, Shogo Okamoto, Yoichiro Matsuura, Hikaru Nagano, and Yoji Yamada. 2014. Toward Quality Texture Display: Vibrotactile Stimuli to Modify Material Roughness Sensations. Journal of Advanced Robotics, Vol.28, Issue.16, 1079--1089.",
      "doi": ""
    },
    {
      "text": "Shuhei Asano, Shogo Okamoto, and Yoji Yamada. 2015. Vibrotactile Stimulation to Increase and Decrease Texture Roughness. IEEE Transactions on Human-Machine Systems, Vol.45, Issue 3, 393--398.",
      "doi": ""
    },
    {
      "text": "Olivier Bau, and Ivan Poupyrev. 2012. REVEL: Tactile Feedback Technology for Augmented Reality. In Proceedings of ACM SIGGRAPH 2012, Vol.31, Issue 4, No. 89.  ",
      "doi": "10.1145/2343456.2343473"
    },
    {
      "text": "Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: Electrovibration for Touch Surfaces. In Proceedings of the 23nd annual ACM Symposium on User Interface Software and Technology (UIST'10), 283--292.  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch: High-fidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers, In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST'16), 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Simon Gallo, Choonghyun Son, Hyunjoo Jenny Lee, Hannes Bleuler, and Il-Joo Cho. 2015. A flexible multimodal tactile display for delivering shape and material information. Journal of Sensors and Actuators A: Physical, Vol.263, 180--189.",
      "doi": ""
    },
    {
      "text": "Nan-Wei Gong, Amit Zoran, and Joseph A. Paradiso. 2013. Inkjet-printed Conductive Patterns for Physical Manipulation of Audio Signals. In Proceedings of the Adjunct Publication of The 26th Annual ACM Symposium on User Interface Software and Technology (UIST'13), 13--14.  ",
      "doi": "10.1145/2508468.2514932"
    },
    {
      "text": "Nan-Wei Gong, Jürgen Steimle, Simon Olberding, Steve Hodges, Nicholas Gillian, Yoshihiro Kawahara, and Joseph A. Paradiso. 2014. PrintSense: A Versatile Sensing Technique to Support Multimodal Flexible Surface Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14), 1407--1410.  ",
      "doi": "10.1145/2556288.2557173"
    },
    {
      "text": "Takahiro Hashizume, Takuya Sasatani, Koya Narumi, Yoshiaki Narusue, Yoshihiro Kawahara, and Tohru Asami. 2016. Passive and Contactless Epidermal Pressure Sensor Printed with Silver Nano-particle Ink. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Ubicomp'16), 190--195.  ",
      "doi": "10.1145/2971648.2971705"
    },
    {
      "text": "Takayuki Hoshi, Masafumi Takahashi, Takayuki Iwamoto, and Hiroyuki Shinoda. 2010. Noncontact Tactile Display Based on Radiation Pressure of Airbore Ultrasound. IEEE Transactions on Haptics, Vol.3, Issue 3, 155--165.  ",
      "doi": "10.1109/TOH.2010.4"
    },
    {
      "text": "Meghan C Jimenez, and Jeremy A. Fishel. 2014. Evaluation of force, vibration and thermal tactile feedback in prosthetic limbs.In Proceedings of 2014 IEEE Haptics Symposium (HAPTICS'14), 437--441.",
      "doi": ""
    },
    {
      "text": "Lynette A. Jones, and Susan J. Lederman. 2006. Human Hand Function. 1st ed. USA: Oxford University Press,.",
      "doi": ""
    },
    {
      "text": "Hiroyuki Kajimoto. 2012. Design of Cylindrical Whole-Hand Haptic Interface Using Electrocutaneous Display. In Proceedings of International Conference on Human Haptic Sensing and Touch Enabled Computer Applications (EuroHaptics'12), 67--72.  ",
      "doi": "10.1007/978-3-642-31404-9_12"
    },
    {
      "text": "Çagdas Karata¸ s, and Marco Gruteser. 2015. Printing Multi-Key Touch Interfaces. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Ubicomp'15), 169--179.  ",
      "doi": "10.1145/2750858.2804285"
    },
    {
      "text": "Kunihiro Kato, and Homei Miyashita. 2015. ExtensionSticker: A Proposal for a Striped Pattern Sticker to Extend Touch Interfaces and its Assessment. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15), 1851--1854.  ",
      "doi": "10.1145/2702123.2702500"
    },
    {
      "text": "Kunihiro Kato, Homei Miyashita, Hiroyuki Kajimoto, and Hiroki Ishizuka. 2017. Tactile Element with Double-sided Inkjet Printing to Generate Electrostatic Forces and Electrostimuli. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST'17), 31--33.  ",
      "doi": "10.1145/3131785.3131789"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp'13), 363--372.  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Norihide Kitamura, Jurian Chim, and Norihisa Miki. 2015. Electrotactile Display using Microfabricated Micro-needle Array. Journal of Micromechanics and Microengineering, Vol.25, Number 2.",
      "doi": ""
    },
    {
      "text": "Johnny C. Lee, Paul H. Dietz, Darren Leigh, William S. Yerazunis, and Scott E. Hudson. 2004. Haptic Pen: A Tactile Feedback Stylus for Touch Screens. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST'04), 291--294.  ",
      "doi": "10.1145/1029632.1029682"
    },
    {
      "text": "Hanchuan Li, Eric Brockmeyer, Elizabeth J. Carter, Josh Fromm, Scott E. Hudson, Shwetak N. Patel, and Alanson Sample. 2016. PaperID: A Technique for Drawing Functional Battery-Free Wireless Interfaces on Paper. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16), 5885--5896.  ",
      "doi": "10.1145/2858036.2858249"
    },
    {
      "text": "Yasutoshi Makino, Yoshikazu Furuyama, Seki Inoue, and Hiroyuki Shinoda. 2016. HaptoClone (Haptic-Optical Clone) for Mutual Tele-Environment by Real-time 3D Image Transfer with Midair Force Feedback In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16), 1980--1990.  ",
      "doi": "10.1145/2858036.2858481"
    },
    {
      "text": "Takaki Murakami, Tanner Person, Charith Lasantha Fernando, and Kouta Minamizawa. 2017. Altered Touch: Miniature Haptic Display with Force, Thermal and Tactile Feedback for Augmented Haptics. In Proceedings of ACM SIGGRAPH 2017 Emerging Technologies, Article No.2. DOI: http://dl.acm.org/citation.cfm?id=3084836  ",
      "doi": "10.1145/3084822.3084836"
    },
    {
      "text": "Taku Nakamura, and Akio Yamamoto. 2013. Multi-finger Electrostatic Passive Haptic Feedback on a Visual Display. In Proceedings of IEEE World Haptics Conference (WHC'13), 37--42.",
      "doi": ""
    },
    {
      "text": "Kenichi Nakahara, Koya Narumi, Ryuma Niiyama, and Yoshihiro Kawahara. 2017. Electric phase-change actuator with inkjet printed flexible circuit for printable and integrated robot prototyping. In Proceedings of IEEE International Conference on Robotics and Automation (ICRA'17), 1856--1863.",
      "doi": ""
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: Fabricating Highly Customizable Thin-film Touch-displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST'14), 281--290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Simon Olberding, Nan-Wei Gong, John Tiab, Joseph A. Paradiso, and Jürgen Steimle. 2013. A Cuttable Multi-touch Sensor. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST'13), 245--254.  ",
      "doi": "10.1145/2501988.2502048"
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio: Digital Fabrication of Interactive and Shape-Changing Objects With Foldable Printed Electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST'15), 223--232.  ",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "Dongbum Pyo, Semin Ryu, Seung-Chan Kim, and Dong-Soo Kwon. 2014. A New Surface Display for 3D Haptic Rendering. In Proceedings of International Conference on Human Haptic Sensing and Touch Enabled Computer Applications (EuroHaptics'14), 487--495.",
      "doi": ""
    },
    {
      "text": "Alexander Russomanno, R. Brent Gillespie, Sile O'Modhrain, and James Barber. 2014. Modeling Pneumatic Actuators for a Refreshable Tactile Display. In Proceedings of International Conference on Human Haptic Sensing and Touch Enabled Computer Applications (EuroHaptics'14), 385--393.",
      "doi": ""
    },
    {
      "text": "Samuel B. Schorr, and Allison M. Okamura. 2017. Fingertip Tactile Devices for Virtual Object Manipulation and Exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17), 3115--3119.  ",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "Andrew A. Stanley, James C. Gwilliam, and Allison M. Okamura. 2013. Haptic jamming: A Deformable Geometry, Variable Stiffness Tactile Display Using Pneumatics and Particle Jamming. In Proceedings of IEEE World Haptics Conference (WHC'13), 25--30.",
      "doi": ""
    },
    {
      "text": "Peter Steenbergen, Jan R. Buitenweg, Jorg Trojan, Esther M. van der Heide, Teun van den Heuvel, Herta Flor, and Peter H. Veltink. 2012. A system for Inducing Concurrent Tactile and Nociceptive Sensations at the Same Site Using Electrocutaneous Stimulation. Journal of Behavior Research Methods, Vol.44, Issue 4, 924--933.",
      "doi": ""
    },
    {
      "text": "Daniel Spelmezan, Deepak Ranjan Sahoo, and Sriram Subramanian. 2017. Sparkle: Hover Feedback with Touchable Electric Arcs. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17), 3705--3717.  ",
      "doi": "10.1145/3025453.3025782"
    },
    {
      "text": "Robert M. Strong, and Donald E. Troxel.1970. An Electrotactile Display. IEEE Transactions on Man-Machine Systems, Vol.11, Issue 1, 72--79.",
      "doi": ""
    },
    {
      "text": "Andrew Y. J. Szeto, John Lyman, and Ronald E. Prior. 1979. Electrocutaneous Pulse Rate and Pulse Width Psychometric Functions for Sensory Communications. Journal of the Human Factors and Ergonomics Society, Vol.21, Issue 2, 241--249.",
      "doi": ""
    },
    {
      "text": "Tung Ta, Masaaki Fukumoto, Koya Narumi, Shigeki Shino, Yoshihiro Kawahara, and Tohru Asami. 2015. s Interconnection and Double Layer for Flexible ElectronicCircuit with Instant Inkjet Circuits. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp'15), 181--190.  ",
      "doi": "10.1145/2750858.2804276"
    },
    {
      "text": "Akio Yamamoto, Shunichi Nagasawa, Hiroaki Yamamoto, and Toshiro Higuchi. 2006. Electrostatic Tactile Display with Thin Film Slider and Its Application to Tactile Telepresentation Systems. IEEE Transactions on Visualization and Computer Graphics, Vol.12, Issue 2, 168--177.  ",
      "doi": "10.1109/TVCG.2006.28"
    },
    {
      "text": "Gi-Hun Yang, Tae-Heon Yang, Seung-Chan Kim, Dong-Soo Kwon, and Sung-Chul Kang. 2007. Compact Tactile Display for Fingertips with Multiple Vibrotactile Actuator and Thermoelectric Module. In Proceedings of 2007 IEEE International Conference on Robotics and Automation (ICRA'07), 491--496.",
      "doi": ""
    },
    {
      "text": "Vibol Yem, and Hiroyuki Kajimoto. 2017. Wearable Tactile Device using Mechanical and Electrical Stimulation for Fingertip Interaction with Virtual World. In Proceedings of IEEE Virtual Reality (VR'17).",
      "doi": ""
    },
    {
      "text": "Qi Wang, and Vincent Hayward. 2006. Compact, Portable, Modular, High-performance, Distributed Tactile Transducer Device Based on Lateral Skin Deformation. In Proceedings of the Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 67--72.  ",
      "doi": "10.5555/1135770.1136071"
    },
    {
      "text": "Alexander Wiethoff, Hanna Schneider, Michael Rohs, Andreas Butz, and Saul Greenberg. 2012. Sketch-a-TUI: Low Cost Prototyping of Tangible Interactions Using Cardboard and Conductive Ink. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI'12), 309--312.  ",
      "doi": "10.1145/2148131.2148196"
    }
  ]
}