{
  "doi": "10.1145/3173574.3173700",
  "title": "Social Influence and Reciprocity in Online Gift Giving",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Giving gifts is a fundamental part of human relationships that is being affected by technology. The Internet enables people to give at the last minute and over long distances, and to observe friends giving and receiving gifts. How online gift giving spreads in social networks is therefore important to understand. We examine 1.5 million gift exchanges on Facebook and show that receiving a gift causes individuals to be 56% more likely to give a gift in the future. Additional surveys show that online gift giving was more socially acceptable to those who learned about it by observing friends' participation instead of a non-social encouragement. Most receivers pay the gift forward instead of reciprocating directly online, although surveys revealed additional instances of direct reciprocity, where the initial gifting occurred offline. Thus, social influence promotes the spread of online gifting, which both complements and substitutes for offline gifting.",
  "tags": [
    "peer effects",
    "cooperation",
    "quasi-experiment",
    "facebook",
    "reciprocity",
    "online gifts",
    "social networks",
    "social learning"
  ],
  "authors": [
    {
      "name": "René F. Kizilcec",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81555953456/rel-imgonly/kizilcec500x500.jpg",
      "acmid": "81555953456",
      "orcid": "missing"
    },
    {
      "name": "Eytan Bakshy",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436598386",
      "orcid": "missing"
    },
    {
      "name": "Dean Eckles",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350568241",
      "orcid": "missing"
    },
    {
      "name": "Moira Burke",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100241308",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Joshua D Angrist and Jörn-Steffen Pischke. 2008. Mostly Harmless Econometrics: An Empiricist's Companion. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "S. Aral, L. Muchnik, and A. Sundararajan. 2009. Distinguishing influence-based contagion from homophily-driven diffusion in dynamic networks. Proceedings of the National Academy of Sciences 106, 51 (2009), 21544.",
      "doi": ""
    },
    {
      "text": "E. Bakshy, D. Eckles, R. Yan, and I. Rosenn. 2012a. Social influence in social advertising: Evidence from field experiments. In Proc. of the 13th ACM Conference on Electronic Commerce. ACM, 146--161.  ",
      "doi": "10.1145/2229012.2229027"
    },
    {
      "text": "Eytan Bakshy, Itamar Rosenn, Cameron Marlow, and Lada Adamic. 2012b. The role of social networks in information diffusion. In Proceedings of the 21st international conference on World Wide Web (WWW '12).  ",
      "doi": "10.1145/2187836.2187907"
    },
    {
      "text": "Albert Bandura and David C McClelland. 1977. Social learning theory. Prentice-Hall Englewood Cliffs, NJ.",
      "doi": ""
    },
    {
      "text": "Helmuth Berking. 1999. Sociology of Giving. Sage.",
      "doi": ""
    },
    {
      "text": "Moira Burke, Lada A Adamic, and Karyn Marciniak. 2013. Families on Facebook. Proceedings of ICWSM (2013).",
      "doi": ""
    },
    {
      "text": "Moira Burke, Cameron Marlow, and Thomas Lento. 2009. Feed me: motivating newcomer contribution in social network sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 945--954.  ",
      "doi": "10.1145/1518701.1518847"
    },
    {
      "text": "Robert Cialdini. 1984. Influence: The Psychology of Persuasion. HarperCollins.",
      "doi": ""
    },
    {
      "text": "Dean Eckles, René F Kizilcec, and Eytan Bakshy. 2016. Estimating peer effects in networks with peer encouragement designs. Proceedings of the National Academy of Sciences 113, 27 (2016), 7316--7322.",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison, Vitak Jessica, Gray Rebecca, and Cliff Lampe. 2014. Cultivating social resources on social network sites: Facebook relationship maintenance behaviors and their role in social capital processes. Journal of Computer-Mediated Communication 19, 4 (2014), 855--870.  ",
      "doi": "10.1111/jcc4.12078"
    },
    {
      "text": "James H Fowler and Nicholas A Christakis. 2010. Cooperative behavior cascades in human social networks. Proceedings of the National Academy of Sciences 107, 12 (2010), 5334--5338.",
      "doi": ""
    },
    {
      "text": "Matthew Gentzkow. 2007. Valuing new goods in a model with complementarity: Online newspapers. The American Economic Review 97, 3 (2007), 713--744.",
      "doi": ""
    },
    {
      "text": "Alvin Gouldner. 1973. For Sociology: Renewal and Critique in Sociology Today. New York: Basic Books.",
      "doi": ""
    },
    {
      "text": "Kurt Gray, Adrian F Ward, and Michael I Norton. 2014. Paying it forward: Generalized reciprocity and the limits of generosity. Journal of Experimental Psychology: General 143, 1 (2014), 247--254.",
      "doi": ""
    },
    {
      "text": "Keith Hampton, Lauren Sessions Goulet, Lee Rainie, and Kristen Purcell. 2011. Social networking sites and our lives. Pew Research Report. Retrieved from http://www.pewinternet.org/2011/06/16/ social-networking-sites-and-our-lives/.",
      "doi": ""
    },
    {
      "text": "Oliver P Hauser, David G Rand, Alexander Peysakhovich, and Martin A Nowak. 2014. Cooperating with the future. Nature 511, 7508 (2014), 220--223.",
      "doi": ""
    },
    {
      "text": "S. Hill, F. Provost, and C. Volinsky. 2006. Network-based marketing: Identifying likely adopters via consumer networks. Statist. Sci. 21, 2 (2006), 256--276.",
      "doi": ""
    },
    {
      "text": "Michael Kearns, Siddharth Suri, and Nick Montfort. 2006. An experimental study of the coloring problem on human subject networks. Science 313, 5788 (2006), 824--827.",
      "doi": ""
    },
    {
      "text": "Jure Leskovec, Lada A. Adamic, and Bernardo A. Huberman. 2007. The dynamics of viral marketing. ACM Trans. Web 1, 1 (2007), 5.  ",
      "doi": "10.1145/1232722.1232727"
    },
    {
      "text": "Claude Lévi-Strauss. 1969. The Elementary Structures of Kinship. Beacon Press, Boston, MA. Originally published in 1949 in French.",
      "doi": ""
    },
    {
      "text": "Bronislaw Malinowski. 1978. Argonauts of the Western Pacific: An account of native enterprise and adventure in the archipelagoes of Melanesian New Guinea. Routledge.",
      "doi": ""
    },
    {
      "text": "Marcel Mauss. 1954. The Gift: Forms and Functions of Exchange in Archaic Societies. WW Norton & Company.",
      "doi": ""
    },
    {
      "text": "Rose McDermott, James H Fowler, and Nicholas A Christakis. 2013. Breaking up is hard to do, unless everyone else is doing it too: Social network effects on divorce in a longitudinal sample. Social Forces 92, 2 (2013), 491--519.",
      "doi": ""
    },
    {
      "text": "M. McPherson, L. Smith-Lovin, and J.M. Cook. 2001. Birds of a feather: Homophily in social networks. Annual Review of Sociology (2001), 415--444.",
      "doi": ""
    },
    {
      "text": "Linda D Molm. 2010. The structure of reciprocity. Social Psychology Quarterly 73, 2 (2010), 119--131.",
      "doi": ""
    },
    {
      "text": "Linda D Molm, Jessica L Collett, and David R Schaefer. 2007. Building solidarity through generalized exchange: A theory of reciprocity. Amer. J. Sociology 113, 1 (2007), 205--242.",
      "doi": ""
    },
    {
      "text": "Martin A Nowak. 2006. Five rules for the evolution of cooperation. Science 314, 5805 (2006), 1560--1563.",
      "doi": ""
    },
    {
      "text": "Art B Owen and Dean Eckles. 2012. Bootstrapping data arrays of arbitrary order. The Annals of Applied Statistics 6, 3 (2012), 895--927.",
      "doi": ""
    },
    {
      "text": "Andrea Pozzi. 2013. The effect of Internet distribution on brick-and-mortar sales. The RAND Journal of Economics 44, 3 (2013), 569--583.",
      "doi": ""
    },
    {
      "text": "Marshall David Sahlins. 1972. Stone Age Economics. Transaction Publishers.",
      "doi": ""
    },
    {
      "text": "Michael J Sandel. 2012. What Money Can't Buy: The Moral Limits of Markets. Macmillan.",
      "doi": ""
    },
    {
      "text": "Barry Schwartz. 1967. The social psychology of the gift. Amer. J. Sociology 73, 1 (1967), 1--11.",
      "doi": ""
    },
    {
      "text": "William R. Shadish, Thomas D Cook, and Donald Thomas Campbell. 2002. Experimental and Quasi-Experimental Designs for Generalized Causal Inference. Wadsworth Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Cosma Rohilla Shalizi and Andrew C. Thomas. 2011. Homophily and contagion are generically confounded in observational social network studies. Sociological Methods & Research 40, 2 (2011), 211--239.",
      "doi": ""
    },
    {
      "text": "Jörgen Skågeby. 2010. Gift-giving as a conceptual framework: framing social behavior in online networks. Journal of Information Technology 25, 2 (2010), 170--177.",
      "doi": ""
    },
    {
      "text": "Emmi Suhonen, Airi Lampinen, Coye Cheshire, and Judd Antin. 2010. Everyday favors: a case study of a local online gift exchange system. In Proceedings of the 16th ACM international conference on Supporting group work. ACM, 11--20.  ",
      "doi": "10.1145/1880071.1880074"
    },
    {
      "text": "Siddharth Suri and Duncan J Watts. 2011. Cooperation and contagion in web-based, networked public goods experiments. PloS ONE 6, 3 (2011), e16836.",
      "doi": ""
    },
    {
      "text": "Alex S Taylor and Richard Harper. 2002. Age-old practices in the 'new world': A study of gift-giving between teenage mobile phone users. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 439--446.  ",
      "doi": "10.1145/503376.503455"
    },
    {
      "text": "Sean J. Taylor, Eytan Bakshy, and Sinan Aral. 2013. Selection effects in online sharing: Consequences for peer adoption. In Proceedings of the 14th ACM Conference on Electronic Commerce. 821--836.  ",
      "doi": "10.1145/2492002.2482604"
    },
    {
      "text": "Milena Tsvetkova and Michael W Macy. 2014. The Social Contagion of Generosity. PloS ONE 9, 2 (2014), e87275.",
      "doi": ""
    },
    {
      "text": "Johan Ugander, Lars Backstrom, Cameron Marlow, and Jon Kleinberg. 2012. Structural diversity in social contagion. Proceedings of the National Academy of Sciences 109, 16 (2012), 5962--5966.",
      "doi": ""
    },
    {
      "text": "Johan Ugander, Brian Karrer, Lars Backstrom, and Cameron Marlow. 2011. The anatomy of the Facebook social graph. (2011). Tech. report. http://arxiv.org/abs/1111.4503.",
      "doi": ""
    },
    {
      "text": "Xiao Wei, Jiang Yang, Lada A. Adamic, Ricardo Matsumura de Araujo, and Manu Rekhi. 2010. Diffusion dynamics of games on online social networks. In Proceedings of the 3rd conference on Online social networks. USENIX Association. ",
      "doi": "10.5555/1863190.1863192"
    },
    {
      "text": "Donghee Yvette Wohn. 2014. Spending real money: purchasing patterns of virtual goods in an online social game. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 3359--3368.  ",
      "doi": "10.1145/2556288.2557074"
    },
    {
      "text": "Jiang Yang, Mark S Ackerman, and Lada A Adamic. 2011. Virtual gifts and guanxi: Supporting social exchange in a Chinese online community. In Proceedings of the Conference on Computer Supported Cooperative Work. ACM, 45--54.  ",
      "doi": "10.1145/1958824.1958832"
    }
  ]
}