{
  "doi": "10.1145/3173574.3173720",
  "title": "Lost in Migration: Information Management and Community Building in an Online Health Community",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "The ever-growing volume of information within online health communities (OHCs) presents an urgent need for new solutions that improve the efficiency of information organization and retrieval for their members. To meet this need, OHCs may choose to adopt off-the-shelf platforms that provide novel features for information management, but were not specifically designed to meet these communities' needs. The questions remain, however, as to the impact of these new platforms on social dynamics within OHCs and their well-being. To examine these questions, we qualitatively studied a migration of a popular OHC, focusing on diabetes self-management, between two off-the-shelf social computing platforms. Despite improving information management, the migration served as a catalyst to reveal the importance of features for identity management and closed circle communication that were not apparent to either the management or the membership of the community. We describe the study and draw implications for research and design for OHCs.",
  "authors": [
    {
      "name": "Drashko Nakikj",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706954",
      "orcid": "missing"
    },
    {
      "name": "Lena Mamykina",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500656179",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Naji Ahmad Albatayneh, Khairil Imran Ghauth, and Fang-Fang Chua. 2014. A Semantic Content-Based Forum Recommender System Architecture Based on Content-Based Filtering and Latent Semantic Analysis. In Recent Advances on Soft Computing and Data Mining. Springer, Cham, 369--378.",
      "doi": ""
    },
    {
      "text": "Allen C. Johnston, James L. Worrell, Paul M. Di Gangi, and Molly Wasko. 2013. Online health communities: An assessment of the influence of participation on patient empowerment outcomes. Information Technology & People 26, 2: 213--235.",
      "doi": ""
    },
    {
      "text": "Paul J. Ambrose and Grace J. Johnson. 2006. Neotribes: the power and potential of online communities in health care. Commun. ACM 49: 107--113.  ",
      "doi": "10.1145/1107458.1107463"
    },
    {
      "text": "L. F. Berkman, T. Glass, I. Brissette, and T. E. Seeman. 2000. From social integration to health: Durkheim in the new millennium. Social Science & Medicine (1982) 51, 6: 843--857.",
      "doi": ""
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Anirudh Srinivasan, and Eric Gilbert. 2017. The Bag of Communities: Identifying Abusive Behavior Online with Preexisting Internet Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 3175--3187.  ",
      "doi": "10.1145/3025453.3026018"
    },
    {
      "text": "Jilin Chen, Werner Geyer, Casey Dugan, Michael Muller, and Ido Guy. 2009. Make New Friends, but Keep the Old: Recommending People on Social Networking Sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 201--210.  ",
      "doi": "10.1145/1518701.1518735"
    },
    {
      "text": "Justin Cheng, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2015. Antisocial Behavior in Online Discussion Communities. arXiv:1504.00680 {cs, stat}. Retrieved from http://arxiv.org/abs/1504.00680",
      "doi": ""
    },
    {
      "text": "Jason H. D. Cho, Parikshit Sondhi, Chengxiang Zhai, and Bruce R. Schatz. 2014. Resolving Healthcare Forum Posts via Similar Thread Retrieval. In Proceedings of the 5th ACM Conference on Bioinformatics, Computational Biology, and Health Informatics (BCB '14), 33--42.  ",
      "doi": "10.1145/2649387.2649399"
    },
    {
      "text": "T. Chomutare, E. Årsand, and G. Hartvigsen. 2015. Mining Symptoms of Severe Mood Disorders in Large Internet Communities. In 2015 IEEE 28th International Symposium on Computer-Based Medical Systems, 214--219.  ",
      "doi": "10.1109/CBMS.2015.36"
    },
    {
      "text": "Andrea Civan and Wanda Pratt. 2007. Threading Together Patient Expertise. AMIA Annual Symposium Proceedings 2007: 140--144.",
      "doi": ""
    },
    {
      "text": "Cristian Danescu-Niculescu-Mizil, Moritz Sudhof, Dan Jurafsky, Jure Leskovec, and Christopher Potts. 2013. A Computational Approach to Politeness with Application to Social Factors. arXiv:1306.6078 {physics}. Retrieved from http://arxiv.org/abs/1306.6078",
      "doi": ""
    },
    {
      "text": "Kushal Dave, Martin Wattenberg, and Michael Muller. 2004. Flash Forums and forumReader: Navigating a New Kind of Large-scale Online Discussion. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04), 232--241.  ",
      "doi": "10.1145/1031607.1031644"
    },
    {
      "text": "George Demiris. 2006. The diffusion of virtual communities in health care: Concepts and challenges. Patient Education and Counseling 62, 2: 178--188.",
      "doi": ""
    },
    {
      "text": "Alan Dix. 2007. Designing for Appropriation. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...But Not As We Know It - Volume 2 (BCS-HCI '07), 27--30. Retrieved April 24, 2017 from http://dl.acm.org/citation.cfm?id=1531407.1531415 ",
      "doi": "10.5555/1531407.1531415"
    },
    {
      "text": "Jeana H Frost and Michael P Massagli. 2008. Social Uses of Personal Health Information Within PatientsLikeMe, an Online Patient Community: What Can Happen When Patients Have Access to One Another's Data. Journal of Medical Internet Research 10, 3: e15.",
      "doi": ""
    },
    {
      "text": "Gayatree Ganu and Amélie Marian. 2013. One Size Does Not Fit All: Multi-granularity Search of Web Forums. In Proceedings of the 22Nd ACM International Conference on Conference on Information & Knowledge Management (CIKM '13), 9--18.  ",
      "doi": "10.1145/2505515.2505745"
    },
    {
      "text": "Frances Griffiths, Jonathan Cave, Felicity Boardman, Justin Ren, Teresa Pawlikowska, Robin Ball, Aileen Clarke, and Alan Cohen. 2012. Social networks--the future for health care delivery. Social Science & Medicine (1982) 75, 12: 2233--2241.",
      "doi": ""
    },
    {
      "text": "John Hannon, Mike Bennett, and Barry Smyth. 2010. Recommending Twitter Users to Follow Using Content and Collaborative Filtering Approaches. In Proceedings of the Fourth ACM Conference on Recommender Systems (RecSys '10), 199--206.  ",
      "doi": "10.1145/1864708.1864746"
    },
    {
      "text": "Derek L. Hansen, Mark S. Ackerman, Paul J. Resnick, and Sean Munson. 2007. Virtual community maintenance with a collaborative repository. Proceedings of the American Society for Information Science & Technology 44, 1: 1--20.",
      "doi": ""
    },
    {
      "text": "Andrea L. Hartzler, Megan N. Taylor, Albert Park, Troy Griffiths, Uba Backonja, David W. McDonald, Sam Wahbeh, Cory Brown, and Wanda Pratt. 2016. Leveraging cues from person-generated health data for peer matching in online communities. Journal of the American Medical Informatics Association: JAMIA 23, 3: 496--507.",
      "doi": ""
    },
    {
      "text": "Yun-Xian Ho, Brendan H. O'Connor, and Shelagh A. Mulvaney. 2014. Features of online health communities for adolescents with type 1 diabetes. Western Journal of Nursing Research 36, 9: 1183-- 1198.",
      "doi": ""
    },
    {
      "text": "Sara D. Hodges, Kristi J. Kiel, Adam D. I. Kramer, Darya Veach, and B. Renee Villanueva. 2009. Giving Birth to Empathy: The Effects of Similar Experience on Empathic Accuracy, Empathic Concern, and Perceived Empathy. Personality and Social Psychology Bulletin.",
      "doi": ""
    },
    {
      "text": "E. Hoque and G. Carenini. 2014. ConVis: A Visual Text Analytic System for Exploring Blog Conversations. Computer Graphics Forum 33, 3: 221-- 230.",
      "doi": ""
    },
    {
      "text": "Quentin Jones, Gilad Ravid, and Sheizaf Rafaeli. 2004. Information Overload and the Message Dynamics of Online Interaction Spaces: A Theoretical Model and Empirical Exploration. Info. Sys. Research 15, 2: 194-- 210.  ",
      "doi": "10.1287/isre.1040.0023"
    },
    {
      "text": "Aniket Kittur, Bongwon Suh, Bryan A. Pendleton, and Ed H. Chi. 2007. He Says, She Says: Conflict and Coordination in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 453--462.  ",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Robert E. Kraut, Paul Resnick, Sara Kiesler, Moira Burke, Yan Chen, Niki Kittur, Joseph Konstan, Yuqing Ren, and John Riedl. 2012. Building Successful Online Communities: Evidence-Based Social Design. The MIT Press, Cambridge, Mass. ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Robert Kraut, Xiaoqing Wang, Brian Butler, Elisabeth Joyce, and Moira Burke. 2010. Beyond information: Developing the relationship between the individual and the group in online communities. Information Systems Research 10. Retrieved March 4, 2015 from http://casci.umd.edu/research-resource/theory-conceptsummaries/online-communities2/publications_butler_2010/",
      "doi": ""
    },
    {
      "text": "Bum Chul Kwon, Sung-Hee Kim, Sukwon Lee, Jaegul Choo, Jina Huh, and Ji Soo Yi. 2016. VisOHC: Designing Visual Analytics for Online Health Communities. IEEE transactions on visualization and computer graphics 22, 1: 71--80.",
      "doi": ""
    },
    {
      "text": "Diane Maloney-Krichmar and Jenny Preece. 2002. The Meaning of an Online Health Community in the Lives of Its Members: Roles, Relationships and Group Dynamics Social Implications of Information and Communication Technology. In International Symposium on Technology and Society, 20--27.",
      "doi": ""
    },
    {
      "text": "Diane Maloney-Krichmar and Jenny Preece. 2005. A Multilevel Analysis of Sociability, Usability, and Community Dynamics in an Online Health Community. ACM Trans. Comput.-Hum. Interact. 12, 2: 201--232.  ",
      "doi": "10.1145/1067860.1067864"
    },
    {
      "text": "Lena Mamykina, Bella Manoim, Manas Mittal, George Hripcsak, and Björn Hartmann. 2011. Design Lessons from the Fastest Q&a Site in the West. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2857--2866.  ",
      "doi": "10.1145/1978942.1979366"
    },
    {
      "text": "Lena Mamykina, Drashko Nakikj, and Noemie Elhadad. 2015. Collective Sensemaking in Online Health Forums. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3217--3226.  ",
      "doi": "10.1145/2702123.2702566"
    },
    {
      "text": "Drashko Nakikj and Lena Mamykina. A Park or A Highway: Overcoming Tensions in Designing for Socio-emotional and Informational Needs in Online Health Communities. In To appear in the Proceedings of CSCW 2017.  ",
      "doi": "10.1145/2998181.2998339"
    },
    {
      "text": "Drashko Nakikj and Lena Mamykina. DisVis: Visualizing Discussion Threads in Online Health Communities. In To appear in the Proceedings of AMIA 2016.",
      "doi": ""
    },
    {
      "text": "Priya Nambisan. 2011. Information seeking and social support in online health communities: impact on patients' perceived empathy. Journal of the American Medical Informatics Association: JAMIA 18, 3: 298-- 304.",
      "doi": ""
    },
    {
      "text": "Srikanth Narayan and Coye Cheshire. 2010. Not Too Long to Read: The Tldr Interface for Exploring and Navigating Large-Scale Discussion Spaces. In Proceedings of the 2010 43rd Hawaii International Conference on System Sciences (HICSS '10), 1--10.  ",
      "doi": "10.1109/HICSS.2010.288"
    },
    {
      "text": "Chikashi Nobata, Joel Tetreault, Achint Thomas, Yashar Mehdad, and Yi Chang. 2016. Abusive Language Detection in Online User Content. In Proceedings of the 25th International Conference on World Wide Web (WWW '16), 145--153.  ",
      "doi": "10.1145/2872427.2883062"
    },
    {
      "text": "Yannick Ouardi, Tarun Goyal, Lorenz Graf-Vlachy, Jan Mammen, Andreas König, and Carol Saunders. 2016. THE COST OF SHARING: THE EFFECT OF SHARING INCLINATION ON INFORMATION OVERLOAD. Research Papers. Retrieved from http://aisel.aisnet.org/ecis2016_rp/162",
      "doi": ""
    },
    {
      "text": "Pietro Panzarasa, Tore Opsahl, and Kathleen M. Carley. 2009. Patterns and dynamics of users' behavior and interaction: Network analysis of an online community. Journal of the American Society for Information Science & Technology 60, 5: 911--932. ",
      "doi": "10.5555/1543767.1543769"
    },
    {
      "text": "Jenny Preece. 2001. Sociability and usability: Twenty years of chatting online. Behavior and Information Technology Journal 20, 5: 347--356.",
      "doi": ""
    },
    {
      "text": "Emilee Rader and Rebecca Gray. 2015. Understanding User Beliefs About Algorithmic Curation in the Facebook News Feed. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 173--182.  ",
      "doi": "10.1145/2702123.2702174"
    },
    {
      "text": "Stephen A. Rains and Valerie Young. 2009. A MetaAnalysis of Research on Formal Computer-Mediated Support Groups: Examining Group Characteristics and Health Outcomes. Human Communication Research 35, 3: 309--336.",
      "doi": ""
    },
    {
      "text": "Yuqing Ren, F. Maxwell Harper, Sara Drenner, Loren Terveen, Sara Kiesler, John Riedl, and Robert E. Kraut. 2012. Building Member Attachment in Online Communities: Applying Theories of Group Identity and Interpersonal Bonds. MIS Q. 36, 3: 841--864. ",
      "doi": "10.5555/2481655.2481665"
    },
    {
      "text": "Yuqing Ren and Robert E. Kraut. A Simulation for Designing Online Community: Member Motivation, Contribution, and Discussion Moderation.",
      "doi": ""
    },
    {
      "text": "Catherine M. Ridings and David Gefen. 2004. Virtual Community Attraction: Why People Hang Out Online. Journal of Computer-Mediated Communication 10, 1: 00--00.",
      "doi": ""
    },
    {
      "text": "Sabirat Rubya and Svetlana Yarosh. 2017. VideoMediated Peer Support in an Online Community for Recovery from Substance Use Disorders. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 1454--1469.  ",
      "doi": "10.1145/2998181.2998246"
    },
    {
      "text": "Jangwon Seo, W. Bruce Croft, and David A. Smith. 2011. Online Community Search Using Conversational Structures. Inf. Retr. 14, 6: 547--571.  ",
      "doi": "10.1007/s10791-011-9166-8"
    },
    {
      "text": "H. Shen, Z. Li, J. Liu, and J. E. Grant. 2015. Knowledge Sharing in the Online Social Network of Yahoo! Answers and Its Implications. IEEE Transactions on Computers 64, 6: 1715--1728.",
      "doi": ""
    },
    {
      "text": "Philipp Singer, Fabian Flöck, Clemens Meinhart, Elias Zeitfogel, and Markus Strohmaier. 2014. Evolution of Reddit: From the Front Page of the Internet to a Selfreferential Community? In Proceedings of the 23rd International Conference on World Wide Web (WWW '14 Companion), 517--522.  ",
      "doi": "10.1145/2567948.2576943"
    },
    {
      "text": "Sara Owsley Sood, Elizabeth F. Churchill, and Judd Antin. 2012. Automatic Identification of Personal Insults on Social News Sites. J. Am. Soc. Inf. Sci. Technol. 63, 2: 270--285.  ",
      "doi": "10.1002/asi.21690"
    },
    {
      "text": "Jason Swarts. 2009. The Collaborative Construction of \"Fact\" on Wikipedia. In Proceedings of the 27th ACM International Conference on Design of Communication (SIGDOC '09), 281--288.  ",
      "doi": "10.1145/1621995.1622051"
    },
    {
      "text": "Russell Spears Tom Postmes. 2002. Intergroup differentiation in computer-mediated communication: Effects of depersonalization. Group Dynamics: Theory, Research, and Practice 6, 1: 3--16.",
      "doi": ""
    },
    {
      "text": "Jeffrey W. Treem and Paul M. Leonardi. 2012. Social Media Use in Organizations: Exploring the Affordances of Visibility, Editability, Persistence, and Association. Social Science Research Network, Rochester, NY. Retrieved September 20, 2016 from http://papers.ssrn.com/abstract=2129853",
      "doi": ""
    },
    {
      "text": "Tatiana A. Vlahovic, Yi-Chia Wang, Robert E. Kraut, and John M. Levine. 2014. Support Matching and Satisfaction in an Online Breast Cancer Support Community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1625--1634.  ",
      "doi": "10.1145/2556288.2557108"
    },
    {
      "text": "Gang Wang, Konark Gill, Manish Mohanlal, Haitao Zheng, and Ben Y. Zhao. 2013. Wisdom in the Social Crowd: An Analysis of Quora. In Proceedings of the 22Nd International Conference on World Wide Web (WWW '13), 1341--1352.  ",
      "doi": "10.1145/2488388.2488506"
    },
    {
      "text": "Xi Wang, Kang Zhao, and Nick Street. 2014. Social Support and User Engagement in Online Health Communities. In Smart Health, Xiaolong Zheng, Daniel Zeng, Hsinchun Chen, Yong Zhang, Chunxiao Xing and Daniel B. Neill (eds.). Springer International Publishing, 97--110.",
      "doi": ""
    },
    {
      "text": "Yi-Chia Wang, Robert E. Kraut, and John M. Levine. 2015. Eliciting and receiving online support: using computer-aided content analysis to examine the dynamics of online social support. Journal of Medical Internet Research 17, 4: e99.",
      "doi": ""
    },
    {
      "text": "Yi-Chia Wang, Robert Kraut, and John M. Levine. 2012. To Stay or Leave?: The Relationship of Emotional and Informational Support to Commitment in Online Health Support Groups. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 833--842.  ",
      "doi": "10.1145/2145204.2145329"
    },
    {
      "text": "Paul Wicks, Michael Massagli, Jeana Frost, Catherine Brownstein, Sally Okun, Timothy Vaughan, Richard Bradley, and James Heywood. 2010. Sharing Health Data for Better Outcomes on PatientsLikeMe. Journal of Medical Internet Research 12, 2.",
      "doi": ""
    },
    {
      "text": "Christo Wilson, Bryce Boe, Alessandra Sala, Krishna P.N. Puttaswamy, and Ben Y. Zhao. 2009. User Interactions in Social Networks and Their Implications. In Proceedings of the 4th ACM European Conference on Computer Systems (EuroSys '09), 205-- 218.  ",
      "doi": "10.1145/1519065.1519089"
    },
    {
      "text": "Shaodian Zhang, Erin Bantum, Jason Owen, and Noémie Elhadad. 2014. Does Sustained Participation in an Online Health Community Affect Sentiment? AMIA Annual Symposium Proceedings 2014: 1970-- 1979.",
      "doi": ""
    },
    {
      "text": "Jing Zhao, Sejin Ha, and Richard Widdows. 2013. Building trusting relationships in online health communities. Cyberpsychology, Behavior and Social Networking 16, 9: 650--657.",
      "doi": ""
    },
    {
      "text": "Jing Zhao, Sejin Ha, and Richard Widdows. 2016. The influence of social capital on knowledge creation in online health communities. Information Technology and Management 17, 4: 311--321.  ",
      "doi": "10.1007/s10799-014-0211-3"
    },
    {
      "text": "Kang Zhao, John Yen, Greta Greer, Baojun Qiu, Prasenjit Mitra, and Kenneth Portier. 2014. Finding influential users of online health communities: a new metric based on sentiment influence. Journal of the American Medical Informatics Association 21, e2: e212--e218.",
      "doi": ""
    },
    {
      "text": "Haiyi Zhu, Robert E. Kraut, Yi-Chia Wang, and Aniket Kittur. 2011. Identifying Shared Leadership in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3431--3434.  ",
      "doi": "10.1145/1978942.1979453"
    },
    {
      "text": "Haiyi Zhu, Robert Kraut, and Aniket Kittur. 2012. Effectiveness of Shared Leadership in Online Communities. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 407--416.  ",
      "doi": "10.1145/2145204.2145269"
    },
    {
      "text": "2017. Ning (website). Wikipedia. Retrieved January 3, 2018 from https://en.wikipedia.org/w/index.php?title=Ning_(webs ite)&oldid=812976909",
      "doi": ""
    },
    {
      "text": "2017. Discourse (software). Wikipedia. Retrieved January 3, 2018 from https://en.wikipedia.org/w/index.php?title=Discourse_( software)&oldid=816465614",
      "doi": ""
    },
    {
      "text": "Fox S, Purcell K. Social Media and Health, Pew Research Center. June, 2009.",
      "doi": ""
    },
    {
      "text": "Fox S, Purcell K. Social Media and Health, Pew Research Center. March, 2010.",
      "doi": ""
    }
  ]
}