{
  "doi": "10.1145/3173574.3174209",
  "title": "A Visual Interaction Framework for Dimensionality Reduction Based Data Exploration",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Dimensionality reduction is a common method for analyzing and visualizing high-dimensional data. However, reasoning dynamically about the results of a dimensionality reduction is difficult. Dimensionality-reduction algorithms use complex optimizations to reduce the number of dimensions of a dataset, but these new dimensions often lack a clear relation to the initial data dimensions, thus making them difficult to interpret. Here we propose a visual interaction framework to improve dimensionality-reduction based exploratory data analysis. We introduce two interaction techniques, forward projection and backward projection, for dynamically reasoning about dimensionally reduced data. We also contribute two visualization techniques, prolines and feasibility maps, to facilitate the effective use of the proposed interactions. We apply our framework to PCA and autoencoder-based dimensionality reductions. Through data-exploration examples, we demonstrate how our visual interactions can improve the use of dimensionality reduction in exploratory data analysis.",
  "authors": [
    {
      "name": "Marco Cavallo",
      "institution": "IBM Research, Yorktown Heights, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659092108",
      "orcid": "missing"
    },
    {
      "name": "Çağatay Demiralp",
      "institution": "IBM Research, Yorktown, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232387",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Elisa Amorim, Emilio V. Brazil, Jesús Mena-Chalco, Luiz Velho, Luis G. Nonato, Faramarz Samavati, and Mario C. Sousa. 2015. Facing the high-dimensions: Inverse projection with radial basis functions. Computers & Graphics 48 (2015), 35--47.  ",
      "doi": "10.1016/j.cag.2015.02.009"
    },
    {
      "text": "Michael Aupetit. 2007. Visualizing distortions and recovering topology in continuous projection techniques. Neurocomputing 70, 7--9 (2007), 1304--1330.  ",
      "doi": "10.1016/j.neucom.2006.11.018"
    },
    {
      "text": "Sebastian Bach, Alexander Binder, Grégoire Montavon, Frederick Klauschen, Klaus-Robert Müller, and Wojciech Samek. 2015. On pixel-wise explanations for non-linear classifier decisions by layer-wise relevance propagation. PloS one 10, 7 (2015).",
      "doi": ""
    },
    {
      "text": "Benjamin B. Bederson and Angela Boltman. 1999. Does animation help users build mental maps of spatial information?. In Proc. InfoVis. IEEE, 28--35. ",
      "doi": "10.5555/857189.857656"
    },
    {
      "text": "Yoshua Bengio, Jean-François Paiement, Pascal Vincent, Olivier Delalleau, Nicolas Le Roux, and Marie Ouimet. 2003. Out-of-Sample Extensions for LLE, Isomap, MDS, Eigenmaps, and Spectral Clustering. In NIPS. ",
      "doi": "10.5555/2981345.2981368"
    },
    {
      "text": "Christopher M. Bishop. 2006. Pattern Recognition and Machine Learning. Springer-Verlag. ",
      "doi": "10.5555/1162264"
    },
    {
      "text": "Alan Borning. 1981. The programming language aspects of ThingLab, a constraint-oriented simulation laboratory. ACM TOPLAS 3, 4 (1981), 353--387.  ",
      "doi": "10.1145/357146.357147"
    },
    {
      "text": "Stephen P. Boyd and Lieven Vandenberghe. 2004. Convex Optimization. Cambridge University Press. ",
      "doi": "10.5555/993483"
    },
    {
      "text": "Matthew Brehmer, Michael Sedlmair, Stephen Ingram, and Tamara Munzner. 2014. Visualizing dimensionally-reduced data: Interviews with analysts and a characterization of task sequences. In Proc BELIV.  ",
      "doi": "10.1145/2669557.2669559"
    },
    {
      "text": "Andreas Buja, Deborah F Swayne, Michael L. Littman, Nathaniel Dean, Heike Hofmann, and Lisha Chen. 2008. Data Visualization With Multidimensional Scaling. Journal of Computational and Graphical Statistics 17, 2 (2008), 444--472.",
      "doi": ""
    },
    {
      "text": "Marco Cavallo and Çağatay Demiralp. 2017. Exploring Dimensionality Reductions with Forward and Backward Projections. In Proc. Workshop on Interactive Data Exploration and Analytics (IDEA) at KDD.",
      "doi": ""
    },
    {
      "text": "Xi Chen, Yan Duan, Rein Houthooft, John Schulman, Ilya Sutskever, and Pieter Abbeel. 2016. Infogan: Interpretable representation learning by information maximizing generative adversarial nets. In Advances in Neural Information Processing Systems. 2172--2180. ",
      "doi": "10.5555/3157096.3157340"
    },
    {
      "text": "Jason Chuang, Daniel Ramage, Christopher Manning, and Jeffrey Heer. 2012. Interpretation and Trust: Designing Model-Driven Visualizations for Text Analysis. In Proc. CHI.  ",
      "doi": "10.1145/2207676.2207738"
    },
    {
      "text": "Danilo B. Coimbra, Rafael M. Martins, Tácito TAT Neves, Alexandru C. Telea, and Fernando V. Paulovich. 2016. Explaining three-dimensional dimensionality reduction plots. Information Visualization 15, 2 (2016), 154--172.",
      "doi": ""
    },
    {
      "text": "Tarik Crnovrsanin, Chris Muelder, Carlos Correa, and Kwan-Liu Ma. 2009. Proximity-based visualization of movement trace data. In Proc. IEEE VAST.",
      "doi": ""
    },
    {
      "text": "Renato R.O. da Silva, Paulo E. Rauber, and Alexandru C. Telea. 2016. Beyond the Third Dimension: Visualizing High-Dimensional Data with Projections. Computing in Science & Engineering 18, 5 (2016), 98--107.",
      "doi": "10.1109/MCSE.2016.90"
    },
    {
      "text": "Çağatay Demiralp. 2016. Clustrophile: A Tool for Visual Clustering Analysis. In KDD IDEA.",
      "doi": ""
    },
    {
      "text": "Elisa P. dos Santos Amorim, Emilio V. Brazil, Joel Daniels, Paulo Joia, Luis G. Nonato, and Mario C. Sousa. 2012. iLAMP: Exploring high-dimensional spacing through backward multidimensional projection. In Proc. IEEE VAST.  ",
      "doi": "10.1109/VAST.2012.6400489"
    },
    {
      "text": "Alex Endert, Patrick Fiaux, and Chris North. 2012. Semantic interaction for visual text analytics. In Proc. CHI.  ",
      "doi": "10.1145/2207676.2207741"
    },
    {
      "text": "Alex Endert, Chao Han, Dipayan Maiti, Leanna House, and Chris North. 2011. Observation-level interaction with statistical models for visual analytics. In Proc. IEEE VAST.",
      "doi": ""
    },
    {
      "text": "Dumitru Erhan, Yoshua Bengio, Aaron Courville, and Pascal Vincent. 2009. Visualizing Higher-Layer Features of a Deep Network. Technical Report 1341. University of Montreal.",
      "doi": ""
    },
    {
      "text": "Karl Ruben Gabriel. 1971. The biplot graphic display of matrices with application to principal component analysis. Biometrika (1971), 453--467.",
      "doi": ""
    },
    {
      "text": "Michael Gleicher. 2013. Explainers: Expert Explorations with Crafted Projections. IEEE TVCG 19, 12 (dec 2013), 2042--2051.  ",
      "doi": "10.1109/TVCG.2013.157"
    },
    {
      "text": "Peter J. Haas, Paul P. Maglio, Patricia G. Selinger, and Wang Chiew Tan. 2011. Data is Dead...Without What-If Models. PVLDB 4, 12 (2011), 1486--1489.",
      "doi": "10.14778/3402755.3402802"
    },
    {
      "text": "Trevor Hastie, Robert Tibshirani, Jerome Friedman, and James Franklin. 2005. The Elements of Statistical Learning: Data Mining, Inference and Prediction. The Mathematical Intelligencer 27, 2 (2005), 83--85.",
      "doi": ""
    },
    {
      "text": "Geoffrey E. Hinton and Ruslan R. Salakhutdinov. 2006. Reducing the dimensionality of data with neural networks. Science 313, 5786 (2006), 504--507.",
      "doi": ""
    },
    {
      "text": "Edwin L. Hutchins, James D. Hollan, and Donald A. Norman. 1985. Direct manipulation interfaces. Human-Computer Interaction 1, 4 (1985), 311--338.  ",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Dong H. Jeong, Caroline Ziemkiewicz, Brian Fisher, William Ribarsky, and Remco Chang. 2009. iPCA: An Interactive System for PCA-based Visual Analytics. Computer Graphics Forum 28, 3 (2009), 767--774.  ",
      "doi": "10.1111/j.1467-8659.2009.01475.x"
    },
    {
      "text": "Sara Johansson and Jimmy Johansson. 2009. Interactive Dimensionality Reduction Through User-defined Combinations of Quality Metrics. IEEE TVCG 15, 6 (nov 2009), 993--1000.  ",
      "doi": "10.1109/TVCG.2009.153"
    },
    {
      "text": "Paulo Joia, Danilo Coimbra, Jose A. Cuminato, Fernando V. Paulovich, and Luis G. Nonato. 2011. Local affine multidimensional projection. IEEE TVCG 17, 12 (2011), 2563--2571.  ",
      "doi": "10.1109/TVCG.2011.220"
    },
    {
      "text": "Alan Kay and Adele Goldberg. 1977. Personal dynamic media. Computer 10, 3 (1977), 31--41.  ",
      "doi": "10.1109/C-M.1977.217672"
    },
    {
      "text": "Been Kim, Julie A. Shah, and Finale Doshi-Velez. 2015. Mind the gap: A generative approach to interpretable feature selection and extraction. In Advances in Neural Information Processing Systems. 2260--2268. ",
      "doi": "10.5555/2969442.2969492"
    },
    {
      "text": "Diederik P. Kingma and Max Welling. 2013. Auto-encoding variational bayes. arXiv preprint arXiv:1312.6114 (2013).",
      "doi": ""
    },
    {
      "text": "Guillaume Lample, Neil Zeghidour, Nicolas Usunier, Antoine Bordes, Ludovic Denoyer, and Marc'Aurelio Ranzato. 2017. Fader Networks: Manipulating Images by Sliding Attributes. arXiv preprint arXiv:1706.00409 (2017).",
      "doi": ""
    },
    {
      "text": "Quoc V. Le, Marc'Aurelio Ranzato, Rajat Monga, Matthieu Devin, Kai Chen, Greg S. Corrado, Jeff Dean, and Andrew Y. Ng. 2012. Building High-level Features Using Large Scale Unsupervised Learning. In Proc. ICML. ",
      "doi": "10.5555/3042573.3042641"
    },
    {
      "text": "Honglak Lee, Chaitanya Ekanadham, and Andrew Y. Ng. 2007. Sparse Deep Belief Net Model for Visual Area V2. In Proc. NIPS. ",
      "doi": "10.5555/2981562.2981672"
    },
    {
      "text": "Tao Lei, Regina Barzilay, and Tommi Jaakkola. 2016. Rationalizing neural predictions. Proc. EMNLP (2016).",
      "doi": ""
    },
    {
      "text": "Sylvain Lespinats and Michael Aupetit. 2010. CheckViz: Sanity Check and Topological Clues for Linear and Non-Linear Mappings. Computer Graphics Forum 30, 1 (2010), 113--125.",
      "doi": ""
    },
    {
      "text": "Benjamin Letham, Cynthia Rudin, Tyler H. McCormick, David Madigan, and others. 2015. Interpretable classifiers using rules and Bayesian analysis: Building a better stroke prediction model. The Annals of Applied Statistics 9, 3 (2015), 1350--1371.",
      "doi": ""
    },
    {
      "text": "Jiwei Li, Xinlei Chen, Eduard Hovy, and Dan Jurafsky. 2015. Visualizing and understanding neural models in nlp. arXiv preprint arXiv:1506.01066 (2015).",
      "doi": ""
    },
    {
      "text": "Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of Machine Learning Research 9 (2008), 2579--2605.",
      "doi": ""
    },
    {
      "text": "Aravindh Mahendran and Andrea Vedaldi. 2015. Understanding Deep Image Representations by Inverting Them. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "Gladys M.H. Mamani, Francisco M. Fatore, Luis G. Nonato, and Fernando V. Paulovich. 2013. User-driven Feature Space Transformation. Computer Graphics Forum 32 (2013), 291--299.  ",
      "doi": "10.1111/cgf.12116"
    },
    {
      "text": "Nathan D. Monnig, Bengt Fornberg, and Francois G. Meyer. 2014. Inverting nonlinear dimensionality reduction with scale-free radial basis function interpolation. Applied and Computational Harmonic Analysis 37, 1 (2014), 162--170.",
      "doi": ""
    },
    {
      "text": "Anh Nguyen, Jason Yosinski, and Jeff Clune. 2016. Multifaceted feature visualization: Uncovering the different types of features learned by each neuron in deep neural networks. (2016).",
      "doi": ""
    },
    {
      "text": "Guim Perarnau, Joost van de Weijer, Bogdan Raducanu, and Jose M. Álvarez. 2016. Invertible Conditional GANs for image editing. arXiv preprint arXiv:1611.06355 (2016).",
      "doi": ""
    },
    {
      "text": "Marco T. Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. Why should I trust you?: Explaining the predictions of any classifier. In Proc. KDD. ACM, 1135--1144.  ",
      "doi": "10.1145/2939672.2939778"
    },
    {
      "text": "David E. Rumelhart, Geoffrey. E. Hinton, and Ronald. J. Williams. 1986. In Parallel Distributed Processing: Explorations in the Microstructure of Cognition, Vol. 1, David E. Rumelhart and James L. McClelland (Eds.). Chapter Learning Internal Representations by Error Propagation, 318--362. ",
      "doi": "10.5555/104279.104293"
    },
    {
      "text": "Dominik Sacha, Leishi Zhang, Michael Sedlmair, John A. Lee, Jaakko Peltonen, Daniel Weiskopf, Stephen C. North, and Daniel A. Keim. 2017. Visual interaction with dimensionality reduction: A structured literature analysis. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 241--250.  ",
      "doi": "10.1109/TVCG.2016.2598495"
    },
    {
      "text": "Tobias Schreck, Jurgen Bernard, Tatiana von Landesberger, and Jorn Kohlhammer. 2009. Visual cluster analysis of trajectory data with interactive Kohonen maps. Information Visualization 8, 1 (2009), 14--29.  ",
      "doi": "10.1057/ivs.2008.29"
    },
    {
      "text": "Michael Sedlmair, Tamara Munzner, and Melanie Tory. 2013. Empirical Guidance on Scatterplot and Dimension Reduction Technique Choices. IEEE Trans. Visual. Comput. Graphics 19, 12 (2013), 2634--2643.  ",
      "doi": "10.1109/TVCG.2013.153"
    },
    {
      "text": "Ben Shneiderman. 1983. Direct Manipulation: A Step Beyond Programming Languages. Computer 16, 8 (1983), 57--69.  ",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "Avanti Shrikumar, Peyton Greenside, Anna Shcherbina, and Anshul Kundaje. 2016. Not just a black box: Learning important features through propagating activation differences. arXiv preprint arXiv:1605.01713 (2016).",
      "doi": ""
    },
    {
      "text": "Karen Simonyan, Andrea Vedaldi, and Andrew Zisserman. 2013. Deep inside convolutional networks: Visualising image classification models and saliency maps. (2013).",
      "doi": ""
    },
    {
      "text": "Julian Stahnke, Marian Dörk, Boris Müller, and Andreas Thom. 2016. Probing Projections: Interaction Techniques for Interpreting Arrangements and Errors of Dimensionality Reductions. IEEE TVCG 22, 1 (2016), 629--638.",
      "doi": ""
    },
    {
      "text": "Ivan E. Sutherland. 1963. Sketchpad: A man-machine graphical communication system. In Proc. Spring Joint Computer Conference.  ",
      "doi": "10.1145/1461551.1461591"
    },
    {
      "text": "John W. Tukey and Martin B. Wilk. 1966. Data analysis and statistics: an expository overview. In Proc. Fall Joint Computer Conference.  ",
      "doi": "10.1145/1464291.1464366"
    },
    {
      "text": "Laurens Van der Maaten, Eric Postma, and Japp Van den Herik. 2009. Dimensionality Reduction: A Comparative Review. Technical Report. TiCC, Tilburg University.",
      "doi": ""
    },
    {
      "text": "Christophe Viau, Michael J. McGuffin, Yves Chiricota, and Igor Jurisica. 2010. The FlowVizMenu and parallel scatterplot matrix: Hybrid multidimensional visualizations for network exploration. IEEE TVCG (2010), 1100--1108.  ",
      "doi": "10.1109/TVCG.2010.205"
    },
    {
      "text": "Bret Victor. 2013. Media for Thinking the Unthinkable. https://vimeo.com/67076984. (2013). Accessed: Dec 24th, 2017.",
      "doi": ""
    },
    {
      "text": "Matt Williams and Tamara Munzner. 2004. Steerable, Progressive Multidimensional Scaling. In Proc. IEEE InfoVis.  ",
      "doi": "10.5555/1038262.1038782"
    },
    {
      "text": "Jason Yosinski, Jeff Clune, Anh Nguyen, Thomas Fuchs, and Hod Lipson. 2015. Understanding neural networks through deep visualization. (2015).",
      "doi": ""
    },
    {
      "text": "Matthew D. Zeiler and Rob Fergus. 2014. Visualizing and understanding convolutional networks. In Proc. ECCV.",
      "doi": ""
    },
    {
      "text": "Bolei Zhou, Aditya Khosla, Lapedriza. Agata, Aude Oliva, and Antonio Torralba. 2016. Learning Deep Features for Discriminative Localization.. In Proc. CVPR.",
      "doi": ""
    },
    {
      "text": "Luisa M. Zintgraf, Taco S. Cohen, Tameem Adel, and Max Welling. 2017. Visualizing deep neural network decisions: Prediction difference analysis. In Proc. ICLR.",
      "doi": ""
    }
  ]
}