{
  "doi": "10.1145/3173574.3174222",
  "title": "Effects of Viewing Multiple Viewpoint Videos on Metacognition of Collaborative Experiences",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "This paper discusses the effects of multiple viewpoint videos for metacognition of experiences. We present a system for recording multiple users' collaborative experiences by wearable and environmental sensors, and another system for viewing multiple viewpoint videos automatically identified and extracted to associate to individual users. We designed an experiment to compare the metacognition of one's own experience between those based on memory and those supported by video viewing. The experimental results show that metacognitive descriptions related to one's own mind, such as feelings and preferences, are possible regardless whether a person is viewing videos, but such episodic descriptions as the content of someone's utterance and what s/he felt associated with it are strongly promoted by video viewing. We conducted another experiment where the same participants did identical metacognitive description tasks about half a year after the previous experiment. Through the experiments, we found the first-person view video is mostly used for confirming the episodic facts immediately after the experience, whereas after half a year, even one's own experience is often felt like the experiences of others therefore the videos capturing themselves from the conversation partners and environment become important for thinking back to the situations where they were placed.",
  "authors": [
    {
      "name": "Yasuyuki Sumi",
      "institution": "Future University Hakodate, Hakodate, Japan",
      "img": "/do/10.1145/contrib-81100087571/rel-imgonly/sumi-pervasive.jpg",
      "acmid": "81100087571",
      "orcid": "missing"
    },
    {
      "name": "Masaki Suwa",
      "institution": "Keio University, Fujisawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261721",
      "orcid": "missing"
    },
    {
      "name": "Koichi Hanaue",
      "institution": "Integrated Environment Support Inc., Nagoya, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384605589",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kiyoharu Aizawa, Tetsuro Hori, Shinya Kawasaki, and Takayuki Ishikawa. Capture and efficient retrieval of life log. In Pervasive 2004 Workshop on Memory and Sharing of Experiences, 2004.",
      "doi": ""
    },
    {
      "text": "Abdullah Al Mahmud, Rikkert Gerits, and Jean-Bernard Martens. Xtag: Designing an experience capturing and sharing tool for persons with aphasia. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, NordiCHI '10, pages 325--334, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1868914.1868953"
    },
    {
      "text": "Agon Bexheti, Evangelos Niforatos, Seyed Ali Bahrainian, Marc Langheinrich, and Fabio Crestani. Measuring the effect of cued recall on work meetings. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct, UbiComp '16, pages 1020--1026, New York, NY, USA, 2016. ACM.  ",
      "doi": "10.1145/2968219.2968563"
    },
    {
      "text": "Mark Billinghurst, Nigel Davies, Marc Langheinrich, and Albrecht Schmidt. Augmenting human memory capture and recall in the era of lifelogging (Dagstuhl Seminar 14362). Dagstuhl Reports, 4(8):151--173, 2015.",
      "doi": ""
    },
    {
      "text": "Ann L. Brown. Knowing when, where, and how to remember: A problem of metacognition. In Robert Glaser, editor, Advances in instructional psychology, volume 1, pages 77--165. Erlbaum, 1978.",
      "doi": ""
    },
    {
      "text": "Brandon Burr. VACA: A tool for qualitative video analysis. In CHI '06 Extended Abstracts on Human Factors in Computing Systems, CHI EA '06, pages 622--627, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1125451.1125580"
    },
    {
      "text": "Vannevar Bush. As we may think. The Atlantic Monthly, 176(1):101--108, July 1945.",
      "doi": ""
    },
    {
      "text": "Daragh Byrne, Aisling Kelliher, and Gareth J.F. Jones. Life editing: Third-party perspectives on lifelog content. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, pages 1501--1510, New York, NY, USA, 2011. ACM.  ",
      "doi": "10.1145/1978942.1979162"
    },
    {
      "text": "Niamh Caprani, Noel E. O'Connor, and Cathal Gurrin. Experiencing SenseCam: A case study interview exploring seven years living with a wearable camera. In Proceedings of the 4th International SenseCam & Pervasive Imaging Conference, SenseCam '13, pages 52--59, New York, NY, USA, 2013. ACM.  ",
      "doi": "10.1145/2526667.2526676"
    },
    {
      "text": "Yi Chen and Gareth J. F. Jones. Augmenting human memory using personal lifelogs. In Proceedings of the 1st Augmented Human International Conference, AH '10, pages 24:1--24:9, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1785455.1785479"
    },
    {
      "text": "William J. Clancey. Situated Cognition: On Human Knowledge and Computer Representations. Cambridge University Press, 1997. ",
      "doi": "10.5555/523074"
    },
    {
      "text": "Barbara Colombo and Alessandro Antonietti. The role of metacognitive strategies in learning music: A multiple case study. British Journal of Music Education, 34(1):95--113, 2017.",
      "doi": ""
    },
    {
      "text": "Michael T. Cox. Metacognition in computation: A selected research review. Artificial Intelligence, 169:104--141, 2005.  ",
      "doi": "10.5555/1126878.1644571"
    },
    {
      "text": "Tilman Dingler, Passant El Agroudy, Huy Viet Le, Albrecht Schmidt, Evangelos Niforatos, Agon Bexheti, and Marc Langheinrich. Multimedia memory cues for augmenting human memory. IEEE MultiMedia, 23(2):4--11, Apr 2016.",
      "doi": ""
    },
    {
      "text": "John Dunlosky and Janet Metcalfe. Metacognition. SAGE, 2009.",
      "doi": ""
    },
    {
      "text": "Alircza Fathi. Social interactions: A first-person perspective. In Proceedings of the 2012 IEEE Conference on Computer Vision and Pattern Recognition, CVPR '12, pages 1226--1233, Washington, DC, USA, 2012. IEEE Computer Society. ",
      "doi": "10.5555/2354409.2354936"
    },
    {
      "text": "Jim Gemmell and Hari Sundaram, editors. Proceedings of The First ACM Workshop on Continuous Archival and Retrieval of Personal Experiences (CARPE 2004), 2004. http://research.microsoft.com/CARPE2004/. ",
      "doi": ""
    },
    {
      "text": "Jim Gemmell, Lyndsay Williams, Ken Wood, Gordon Bell, and Roger Lueder. Passive capture and ensuing issues for a personal lifetime store. In Proceedings of The First ACM Workshop on Continuous Archival and Retrieval of Personal Experiences (CARPE 2004), pages 48--55, 2004.  ",
      "doi": "10.1145/1026653.1026660"
    },
    {
      "text": "Douglas J. Hacker, John Dunlosky, and Arthur C. Graesser, editors. Metacognition in Educational Theory and Practice. Lawrence Erlbaum Assoc Inc, 1998.",
      "doi": ""
    },
    {
      "text": "Ryan A. Hargrove. Assessing the long-term impact of a metacognitive approach to creative skill development. International Journal of Technology and Design Education, 23(3):489--517, August 2013.",
      "doi": ""
    },
    {
      "text": "Morgan Harvey, Marc Langheinrich, and Geo Ward. Remembering through lifelogging: A survey of human memory augmentation. Pervasive and Mobile Computing, 27(C):14--26, April 2016.  ",
      "doi": "10.1016/j.pmcj.2015.12.002"
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, and Brendan DeBrincat. The autobiographical design and long term usage of an always-on video recording system for the home. In Proceedings of the 2017 Conference on Designing Interactive Systems, DIS '17, pages 675--687, New York, NY, USA, 2017. ACM.  ",
      "doi": "10.1145/3064663.3064759"
    },
    {
      "text": "Keita Higuchi, Ryo Yonetani, and Yoichi Sato. EgoScanning: Quickly scanning first-person videos with egocentric elastic timelines. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, CHI '17, pages 6536--6546, New York, NY, USA, 2017. ACM.  ",
      "doi": "10.1145/3025453.3025821"
    },
    {
      "text": "Steve Hodges, Lyndsay Williams, Emma Berry, Shahram Izadi, James Srinivasan, Alex Butler, Gavin Smyth, Narinder Kapur, and Ken Wood. SenseCam: A retrospective memory aid. In Proceedings of the 8th International Conference on Ubiquitous Computing, UbiComp'06, pages 177--193, Berlin, Heidelberg, 2006. Springer-Verlag.  ",
      "doi": "10.1007/11853565_11"
    },
    {
      "text": "James Hollan, Edwin Hutchins, and David Kirsh. Distributed cognition: Toward a new foundation for human-computer interaction research. ACM Transactions on Computer-Human Interaction, 7(2):174--196, June 2000.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Sadanori Ito, Shoichiro Iwasawa, Yasuyuki Sumi, and Kenji Mase. The wearable sensor devices for detecting conversational experiences. International Journal of Information Technology & Decision Making, 6(3):427--442, 2007.",
      "doi": ""
    },
    {
      "text": "Giulio Jacucci, Antti Oulasvirta, and Antti Salovaara. Active construction of experience through mobile media: A field study with implications for recording and sharing. Personal and Ubiquitous Computing, 11(4):215--234, April 2007.  ",
      "doi": "10.1007/s00779-006-0084-5"
    },
    {
      "text": "Hiroshi Kera, Ryo Yonetani, Keita Higuchi, and Yoichi Sato. Discovering objects of joint attention via first-person sensing. In 2016 IEEE Conference on Computer Vision and Pattern Recognition Workshops, pages 361--369, 2016.",
      "doi": ""
    },
    {
      "text": "Michael S. Kirkpatrick and Samantha Prins. Using the readiness assurance process and metacognition in an operating systems course. In Proceedings of the 2015 ACM Conference on Innovation and Technology in Computer Science Education, ITiCSE '15, pages 183--188, New York, NY, USA, 2015. ACM.  ",
      "doi": "10.1145/2729094.2742594"
    },
    {
      "text": "Yasuyuki Kono and Kaoru Misaki. Remembrance home: storage for re-discovering one's life. In Pervasive 2004 Workshop on Memory and Sharing of Experiences, pages 25--30, April 2004.",
      "doi": ""
    },
    {
      "text": "Artie Konrad, Ellen Isaacs, and Steve Whittaker. Technology-mediated memory: Is technology altering our memories and interfering with well-being? ACM Transactions on Computer-Human Interaction, 23(4):23:1--23:29, August 2016.  ",
      "doi": "10.1145/2934667"
    },
    {
      "text": "Deanna Kuhn. Metacognition development. Current Directions in Psychological Science, 9(5):178--181, 2000.",
      "doi": ""
    },
    {
      "text": "Huy Viet Le, Sarah Clinch, Corina Sas, Tilman Dingler, Niels Henze, and Nigel Davies. Impact of video summary viewing on episodic memory recall: Design guidelines for video summarizations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, CHI '16, pages 4793--4805, New York, NY, USA, 2016. ACM.  ",
      "doi": "10.1145/2858036.2858413"
    },
    {
      "text": "Matthew L. Lee and Anind K. Dey. Lifelogging memory appliance for people with episodic memory impairment. In Proceedings of the 10th International Conference on Ubiquitous Computing, UbiComp '08, pages 44--53, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1409635.1409643"
    },
    {
      "text": "Seunghwan Lee, Hojin Kim, and Geehyuk Lee. Ubigraphy: A third-person viewpoint life log. In CHI '08 Extended Abstracts on Human Factors in Computing Systems, CHI EA '08, pages 3531--3536, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1358628.1358886"
    },
    {
      "text": "Murali Mani and Quamrul Mazumder. Incorporating metacognition into learning. In Proceeding of the 44th ACM Technical Symposium on Computer Science Education, SIGCSE '13, pages 53--58, New York, NY, USA, 2013. ACM.  ",
      "doi": "10.1145/2445196.2445218"
    },
    {
      "text": "Steve Mann. Humanistic computing: \"WearComp\" as a new framework for intelligence signal processing. Proceedings of the IEEE, 86(11):2123--2151, 1998.",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Frederico Schardong, and Anthony Tang. EXCITE: Exploring collaborative interaction in tracked environments. In Proceedings of INTERACT 2015 - 16th IFIP TC 13 International Conference, pages 89--97, 2015.",
      "doi": "10.1007/978-3-319-22668-2_8"
    },
    {
      "text": "Marc Lafuente Mart´nez and Ibis M. ´ Alvarez Valdivia. Promoting student metacognition through the analysis of their own debates. Is it better with text or with graphics? Journal of Educational Technology & Society, 19(4):167--177, 2016.",
      "doi": ""
    },
    {
      "text": "Kenji Mase, Yasuyuki Sumi, and Sidney Fels. Welcome to the special issue on memory and sharing of experience for the journal of personal and ubiquitous computing. Personal and Ubiquitous Computing, 11(4):213--214, 2007.  ",
      "doi": "10.1007/s00779-006-0083-6"
    },
    {
      "text": "Kenji Mase, Yasuyuki Sumi, Tomoji Toriyama, Megumu Tsuchikawa, Sadanori Ito, Shoichiro Iwasawa, Kiyoshi Kogure, and Norihiro Hagita. Ubiquitous experience media. IEEE Multimedia, 13(4):20--29, October-December 2006.  ",
      "doi": "10.1109/MMUL.2006.94"
    },
    {
      "text": "Janet Metcalfe and Arthur P. Shimamura, editors. Metacognition: Knowing about Knowing. MIT Press, 1994.",
      "doi": ""
    },
    {
      "text": "Taiki Miyanishi, Jun-ichiro Hirayama, Quan Kong, Takuya Maekawa, Hiroki Moriya, and Takayuki Suyama. Egocentric video search via physical interactions. In Proceedings of the Thirtieth AAAI Conference on Artificial Intelligence, AAAI'16, pages 330--336. AAAI Press, 2016. ",
      "doi": "10.5555/3015812.3015861"
    },
    {
      "text": "Arthur G. Money and Harry Agius. Video summarisation: A conceptual framework and survey of the state of the art. Journal of Visual Communication and Image Representation, 19(2):121--143, February 2008.  ",
      "doi": "10.1016/j.jvcir.2007.04.002"
    },
    {
      "text": "Afarin Pirzadeh, Li He, and Erik Stolterman. Personal informatics and reflection: A critical examination of the nature of reflection. In CHI '13 Extended Abstracts on Human Factors in Computing Systems, CHI EA '13, pages 1979--1988, New York, NY, USA, 2013. ACM.  ",
      "doi": "10.1145/2468356.2468715"
    },
    {
      "text": "Yvonne Rogers and Judi Ellis. Distributed cognition: an alternative framework for analysing and explaining collaborative working. Journal of Information Technology, 9(2):119--128, Jun 1994.",
      "doi": ""
    },
    {
      "text": "Gavriel Salomon, editor. Distributed Cognitions: Psychological and Educational Considerations. Cambridge University Press, 1997.",
      "doi": ""
    },
    {
      "text": "Abigail J. Sellen, Andrew Fogg, Mike Aitken, Steve Hodges, Carsten Rother, and Ken Wood. Do life-logging technologies support memory for the past?: An experimental study using SenseCam. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '07, pages 81--90, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Abigail J. Sellen and Steve Whittaker. Beyond total capture: A constructive critique of lifelogging. Communications of the ACM, 53(5):70--77, May 2010.  ",
      "doi": "10.1145/1735223.1735243"
    },
    {
      "text": "Yasuyuki Sumi, Sadanori Ito, Tetsuya Matsuguchi, Sidney Fels, Shoichiro Iwasawa, Kenji Mase, Kiyoshi Kogure, and Norihiro Hagita. Collaborative capturing, interpreting, and sharing of experiences. Personal and Ubiquious Computing, 11(4):265--271, 2007.  ",
      "doi": "10.1007/s00779-006-0088-1"
    },
    {
      "text": "Masaki Suwa. Re-representation underlies acquisition of embodied expertise: A case study of snowboarding. In Proceedings of 27th Annual Conference of the Cognitive Science Society, page 2557. Cognitive Science Society, 2005.",
      "doi": ""
    },
    {
      "text": "Masaki Suwa. A cognitive model of acquiring embodied expertise through meta-cognitive verbalization. Transactions of the Japanese Society for Artificial Intelligence, 23(3):141--150, 2008.",
      "doi": ""
    },
    {
      "text": "Kimberly D. Tanner. Promoting student metacognition. CBE Life Sciences Education, 11(2):113--120, June 2012.",
      "doi": ""
    },
    {
      "text": "Khai N. Truong, Gregory D. Abowd, and Jason A. Brotherton. Who, what, when, where, how: Design issues of capture & access applications. In Proceedings of Ubicomp 2001 (Springer LNCS2201), pages 209--224, 2001. ",
      "doi": "10.5555/647987.741319"
    },
    {
      "text": "Elise van den Hoven, Corina Sas, and Steve Whittaker. Introduction to this special issue on designing for personal memories: Past, present, and future. Human-Computer Interaction, 27(1--2):1--12, 2012.",
      "doi": ""
    },
    {
      "text": "Ryo Yonetani, Kris M. Kitani, and Yoichi Sato. Recognizing micro-actions and reactions from paired egocentric videos. In 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pages 2629--2638, June 2016.",
      "doi": ""
    }
  ]
}