{
  "doi": "10.1145/3173574.3173767",
  "title": "Cooperating to Compete: the Mutuality of Cooperation and Competition in Boardgame Play",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "This paper examines the complex relationship between competition and cooperation in boardgame play. We understand boardgaming as distributed cognition, where people work together in a shared activity to accomplish the game. Although players typically compete against each other, this competition is only possible through ongoing cooperation to negotiate, enact and maintain the rules of play. In this paper, we report on a study of people playing modern boardgames. We analyse how knowledge of the game's state is distributed amongst the players and the game components, and examine the different forms of cooperation and collaboration that occur during play. Further, we show how players use the material elements of the game to support articulation work and to improve their awareness and understanding of the game's state. Our goal is to examine the coordinative practices that the players use during play and explicate the ways in which these enable competition.",
  "authors": [
    {
      "name": "Melissa J. Rogerson",
      "institution": "University of Melbourne, Parkville, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020899",
      "orcid": "0000-0002-9851-6608"
    },
    {
      "name": "Martin R. Gibbs",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100536739",
      "orcid": "0000-0002-1990-1955"
    },
    {
      "name": "Wally Smith",
      "institution": "University of Melbourne, Parkville, VIC , Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324494027",
      "orcid": "0000-0002-1059-6704"
    }
  ],
  "references": [
    {
      "text": "Rowland Atkinson and John Flint. 2001. Accessing Hidden and Hard-to-Reach Populations: Snowball Research Strategies. Social Research Update, 33.",
      "doi": ""
    },
    {
      "text": "Amartya Banerjee, Michael S. Horn and Pryce Davis. 2016. Invasion of the Energy Monsters: A Family Board Game About Energy Consumption. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1828--1834.  ",
      "doi": "10.1145/2851581.2892507"
    },
    {
      "text": "Antoine Bauza. 2010. 7 Wonders. Boardgame. Repos Production (Bruxelles, Belgium).",
      "doi": ""
    },
    {
      "text": "Antoine Bauza. 2010. Hanabi. Boardgame. Asmodée (Guyancourt).",
      "doi": ""
    },
    {
      "text": "Steve Benford and Gabriella Giannachi. 2008. Temporal Trajectories in Shared Interactive Narratives. ACM (Florence, Italy).",
      "doi": ""
    },
    {
      "text": "Karl Bergström. 2010. The Implicit Rules of Board Games: On the Particulars of the Lusory Agreement. In Proceedings of 14th International Academic MindTrek Conference: Envisioning Future Media Environments. ACM, 86--93.  ",
      "doi": "10.1145/1930488.1930506"
    },
    {
      "text": "Matthew Berland and Victor R Lee. 2011. Collaborative Strategic Board Games as a Site for Distributed Computational Thinking. International Journal of Game-Based Learning 1, 2, 65.",
      "doi": ""
    },
    {
      "text": "Staffan Björk. 2012. Tisch-Digital Tools Supporting Board Games. Foundations of Digital Games 2012.  ",
      "doi": "10.1145/2282338.2282376"
    },
    {
      "text": "Barry Brown and Marek Bell. 2004. Cscw at Play: 'There' as a Collaborative Virtual Environment. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. ACM, 350--359.  ",
      "doi": "10.1145/1031607.1031666"
    },
    {
      "text": "Alfred Mosher Butts. 1948. Scrabble. Boardgame. James Brunot.",
      "doi": ""
    },
    {
      "text": "Marcus Carter, John Downs, Bjorn Nansen, Mitchell Harrop and Martin Gibbs. 2014. Paradigms of Games Research in Hci: A Review of 10 Years of Research at Chi. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play. ACM, 27--36.  ",
      "doi": "10.1145/2658537.2658708"
    },
    {
      "text": "Gifford Cheung. 2013. Card Board: A Flexible Environment for Any Game, Anyone, Any Moment. In Proceedings of CHI '13 Extended Abstracts on Human Factors in Computing Systems. ACM, 2627--2630.  ",
      "doi": "10.1145/2468356.2479480"
    },
    {
      "text": "Mia Consalvo. 2007. Cheating : Gaining Advantage in Videogames. MIT Press (Cambridge, MA), ",
      "doi": "10.5555/1202447"
    },
    {
      "text": "Andy Crabtree, Steve Benford, Mauricio Capra, Martin Flintham, Adam Drozd, Nick Tandavanitj, Matt Adams and Ju Row-Farr. 2007. The Cooperative Work of Gaming: Orchestrating a Mobile Sms Game. Computer supported cooperative work (CSCW) 16, 167--198.  ",
      "doi": "10.1007/s10606-007-9048-1"
    },
    {
      "text": "Chi Tai Dang and Elisabeth André. 2010. SurfacePoker: Multimodality in Tabletop Games. In Proceedings of ACM International Conference on Interactive Tabletops and Surfaces. ACM, 1936701, 251--252.  ",
      "doi": "10.1145/1936652.1936701"
    },
    {
      "text": "Steve Easterbrook. 2012. Cscw: Cooperation or Conflict? Springer Science & Business Media,",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Hayes Raffle, Janet Go and Hiroshi Ishii. 2010. Video Play: Playful Interactions in Video Conferencing for Long-Distance Families with Young Children. ACM (Atlanta, Georgia, USA).",
      "doi": ""
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell and Shaowen Bardzell. 2016. Revisiting Computer-Mediated Intimacy: InGame Marriage and Dyadic Gameplay in Audition. ACM (San Jose, California, USA).",
      "doi": ""
    },
    {
      "text": "Mac Gerdts. 2013. Concordia. Boardgame. PD-Verlag (Heidenau, DE).",
      "doi": ""
    },
    {
      "text": "Mac Gerdts. 2015. Concordia: Salsa. Boardgame. PDVerlag (Heidenau, DE).",
      "doi": ""
    },
    {
      "text": "Martin Grider. 2014. Usability Lessons from Mobile Board Game Conversions. In Proceedings of GDC 2014.",
      "doi": ""
    },
    {
      "text": "Markus Guhe and Alex Lascarides. 2014. The Effectiveness of Persuasion in the Settlers of Catan. In Proceedings of Computational Intelligence and Games (CIG), 2014 IEEE Conference on. IEEE, 1--8.",
      "doi": ""
    },
    {
      "text": "Christian Heath, Jon Hindmarsh and Paul Luff. 2010. Video in Qualitative Research: Analysing Social Interaction in Everyday Life. Sage (London, UK),",
      "doi": ""
    },
    {
      "text": "James Hollan, Edwin Hutchins and David Kirsh. 2000. Distributed Cognition: Toward a New Foundation for Human-Computer Interaction Research. ACM Transactions on Computer-Human Interaction (TOCHI) 7, 2, 174--196.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Linda A. Hughes. 1999. Children's Games and Gaming. In Children's Folklore: A Source Book, Brian Sutton-Smith et al. Eds. Utah State University Press (Logan, Utah), 93--119.",
      "doi": ""
    },
    {
      "text": "Johan Huizinga. 1950. Homo Ludens: A Study of the Play Element in Culture. The Beacon Press (Boston),",
      "doi": ""
    },
    {
      "text": "Edwin L Hutchins. 1995. Cognition in the Wild. The MIT Press (Cambridge, MA),",
      "doi": ""
    },
    {
      "text": "Catherine Emma Jones, Antonios Liapis, Ioanna Lykourentzou and Daniele Guido. 2017. Board Game Prototyping to Co-Design a Better Location-Based Digital Game. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 3053348, 1055--1064.  ",
      "doi": "10.1145/3027063.3053348"
    },
    {
      "text": "Andruid Kerne, William A Hamilton and Zachary O Toups. 2012. Culturally Based Design: Embodying Trans-Surface Interaction in Rummy. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 509--518.  ",
      "doi": "10.1145/2145204.2145284"
    },
    {
      "text": "Ben Kirman and Duncan Rowland. 2008. Socially Respectful Enjoyment Tracking for Tabletop Games. In Proceedings of CHI '08 Extended Abstracts on Human Factors in Computing Systems. ACM, 1358863, 3393--3398.  ",
      "doi": "10.1145/1358628.1358863"
    },
    {
      "text": "Scott R Klemmer, Björn Hartmann and Leila Takayama. 2006. How Bodies Matter: Five Themes for Interaction Design. In Proceedings of the 6th conference on Designing Interactive systems. ACM, 140--149.  ",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "Justin Kruger and David Dunning. 1999. Unskilled and Unaware of It: How Difficulties in Recognizing One's Own Incompetence Lead to Inflated SelfAssessments\". Journal of Personality and Social Psychology 77, 6, 1121--1134.",
      "doi": ""
    },
    {
      "text": "Matt Leacock. 2007. Pandemic. Boardgame. Z-Man Games (Mahopac, NY).",
      "doi": ""
    },
    {
      "text": "Elizabeth Magie and Charles B. Darrow. 1933. Monopoly. Boardgame. Parker Brothers (Pawtucket, RI).",
      "doi": ""
    },
    {
      "text": "Sebastian Marwecki, Roman Rädle and Harald Reiterer. 2013. Encouraging Collaboration in Hybrid Therapy Games for Autistic Children. ACM (Paris, France).",
      "doi": ""
    },
    {
      "text": "Gregor McEwan and Carl Gutwin. 2016. Chess as a Conversation: Artefact-Based Communication in Online Competitive Board Games. In Proceedings of the 19th International Conference on Supporting Group Work. ACM, 21--30.  ",
      "doi": "10.1145/2957276.2957314"
    },
    {
      "text": "Lennart E. Nacke, Anna Cox, Regan L. Mandryk and Paul Cairns. 2016. Sigchi Games: The Scope of Games and Play Research at Chi. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2886438, 10881091.  ",
      "doi": "10.1145/2851581.2886438"
    },
    {
      "text": "Joshua Newn, Eduardo Velloso, Marcus Carter and Frank Vetere. 2016. Exploring the Effects of Gaze Awareness on Multiplayer Gameplay. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts. ACM, 239--244.  ",
      "doi": "10.1145/2968120.2987740"
    },
    {
      "text": "Donald A. Norman. 1991. Cognitive Artifacts. Designing interaction: Psychology at the humancomputer interface 1, 17--38. ",
      "doi": "10.5555/120352.120354"
    },
    {
      "text": "Alexey Pajitnov. 1984. Tetris. Videogame. Elektronorgtechnica (ELORG) (Moscow, Russia).",
      "doi": ""
    },
    {
      "text": "David Parlett. 1974. Hare and Tortoise. Boardgame. Intellect Games (London, UK).",
      "doi": ""
    },
    {
      "text": "Johan Peitz, Staffan Björk and Anu Jäppinen. 2006. Wizard's Apprentice Gameplay-Oriented Design of a Computer-Augmented Board Game. In Proceedings of the 2006 ACM SIGCHI international conference on Advances in computer entertainment technology. ACM, 79.  ",
      "doi": "10.1145/1178823.1178845"
    },
    {
      "text": "Lewis Pulsipher. 2006. The Essence of Euro-Style Games. The Games Journal.",
      "doi": ""
    },
    {
      "text": "David Randall, Richard Harper and Mark Rouncefield. 2007. Fieldwork for Design. Springer-Verlag (London, UK).",
      "doi": ""
    },
    {
      "text": "Melissa Rogerson, Martin Gibbs and Wally Smith. 2017. What Can We Learn from Eye-Tracking Boardgame Play? In Proceedings of CHI Play.  ",
      "doi": "10.1145/3130859.3131314"
    },
    {
      "text": "Melissa J. Rogerson, Martin Gibbs and Wally Smith. 2015. Digitising Boardgames: Issues and Tensions. In Proceedings of DiGRA 2015; Diversity of Play. Digital Games Research Association.",
      "doi": ""
    },
    {
      "text": "Melissa J. Rogerson, Martin Gibbs and Wally Smith. 2016. \"I Love All the Bits\": The Materiality of Boardgames. In Proceedings of CHI 2016. ACM, 3956--3969.  ",
      "doi": "10.1145/2858036.2858433"
    },
    {
      "text": "Katie Salen and Eric Zimmermann. 2004. Rules of Play. Game Design Fundamentals. MIT Press (Massachusets), ",
      "doi": "10.5555/1215723"
    },
    {
      "text": "Allison Sall and Rebecca E. Grinter. 2007. Let's Get Physical! In, out and around the Gaming Circle of Physical Gaming at Home. Computer Supported Cooperative Work (CSCW) 16, 1 %@ 1573--7551, 199229.  ",
      "doi": "10.1007/s10606-007-9047-2"
    },
    {
      "text": "Kjeld Schmidt and Carla Simone. 1996. Coordination Mechanisms: Towards a Conceptual Foundation of Cscw Systems Design. Computer Supported Cooperative Work (CSCW) 5, 2--3, 155--200.  ",
      "doi": "10.1007/BF00133655"
    },
    {
      "text": "Kjeld Schmidt and Ina Wagner. 2004. Ordering Systems: Coordinative Practices and Artifacts in Architectural Design and Planning. Computer Supported Cooperative Work 13, 349--408.  ",
      "doi": "10.5555/1045432.1045434"
    },
    {
      "text": "Carla Simone, Mark S. Ackerman and Volker Wulf. 2012. Knowledge Management in Action.",
      "doi": ""
    },
    {
      "text": "Karin Slegers, Sanne Ruelens, Jorick Vissers and Pieter Duysburgh. 2015. Using Game Principles in Ux Research: A Board Game for Eliciting Future User Needs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1225--1228.  ",
      "doi": "10.1145/2702123.2702166"
    },
    {
      "text": "Stephen Sniderman. 2006 {1999}. Unwritten Rules. In The Game Design Reader: A Rules of Play Anthology, Katie Salen and Eric Zimmermann Eds. The MIT Press (Cambridge, Massachusetts), 476--502.",
      "doi": ""
    },
    {
      "text": "Robert A. Stebbins. 2012. The Idea of Leisure: First Principles. Transaction Publishers (New Brunswick, New Jersey),",
      "doi": ""
    },
    {
      "text": "Robert A. Stebbins. 2015. Hobbyist Play. In The Interrelationship of Leisure and Play: Play as Leisure, Leisure as Play, Palgrave Macmillan UK (London), 129--149.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss. 1988. The Articulation of Project Work: An Organizational Process. The Sociological Quarterly 29, 2, 163--178.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2007. Human-Machine Reconfigurations: Plans and Situated Actions. Cambridge University Press (Cambridge, UK), ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Bernard Suits. 2014. The Grasshopper: Games, Life and Utopia. Broadview Press,",
      "doi": ""
    },
    {
      "text": "Zsolt Szalavári, Erik Eckstein and Michael Gervautz. 1998. Collaborative Gaming in Augmented Reality. In Proceedings of ACM symposium on Virtual reality software and technology. ACM, 195--204.  ",
      "doi": "10.1145/293701.293740"
    },
    {
      "text": "Klaus Teuber. 1995. The Settlers of Catan. Boardgame. Mayfair Games (Skokie, IL).",
      "doi": ""
    },
    {
      "text": "Phil Turner. 2016. Hci Redux: The Promise of PostCognitive Interaction. Springer (Switzerland). ",
      "doi": "10.5555/3002837"
    },
    {
      "text": "James R. Wallace, Joseph Pape, Yu-Ling Betty Chang, Phillip J. McClelland, T.C. Nicholas Graham, Stacey D. Scott and Mark Hancock. 2012. Exploring Automation in Digital Tabletop Board Game. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion. ACM, 231234.  ",
      "doi": "10.1145/2141512.2141585"
    },
    {
      "text": "Christopher Walsh and Thomas Apperley. 2009. Gaming Capital: Rethinking Literacy. In Proceedings of AARE 2008 International Education Research Conference.",
      "doi": ""
    },
    {
      "text": "Margaret Wilson. 2002. Six Views of Embodied Cognition. Psychonomic bulletin & review 9, 4, 625636.",
      "doi": ""
    },
    {
      "text": "Stewart Woods. 2012. Eurogames: The Design, Culture and Play of Modern European Board Games. McFarland & Company, Inc, Publishers (Jefferson, NC, and London, UK),",
      "doi": ""
    },
    {
      "text": "Klaus-Jürgen Wrede. 2000. Carcassonne. Boardgame. Hans im Glück (München, Germany).",
      "doi": ""
    },
    {
      "text": "Yan Xu, Evan Barba, Iulian Radu, Maribeth Gandy and Blair MacIntyre. 2011. Chores Are Fun: Understanding Social Play in Board Games for Digital Tabletop Game Design. In Proceedings of Think design play: The fifth international conference of the digital research association (DIGRA).",
      "doi": ""
    },
    {
      "text": "Alyson Young, David Gurzick, Wayne Lutters, Caroline Dombrowski and Jeffrey Kim. 2012. Exploring Infrastructure Assemblage in Volunteer Virtual Organizations. ACM (Austin, Texas, USA).",
      "doi": ""
    },
    {
      "text": "Taoshuai Zhang, Jie Liu and Yuanchun Shi. 2012. Enhancing Collaboration in Tabletop Board Game. In Proceedings of the 10th asia pacific conference on Computer human interaction. ACM, 2350050, 7--10.  ",
      "doi": "10.1145/2350046.2350050"
    }
  ]
}