{
  "doi": "10.1145/3173574.3174221",
  "title": "Selection-based Text Entry in Virtual Reality",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "In recent years, Virtual Reality (VR) and 3D User Interfaces (3DUI) have seen a drastic increase in popularity, especially in terms of consumer-ready hardware and software. While the technology for input as well as output devices is market ready, only a few solutions for text input exist, and empirical knowledge about performance and user preferences is lacking. In this paper, we study text entry in VR by selecting characters on a virtual keyboard. We discuss the design space for assessing selection-based text entry in VR. Then, we implement six methods that span different parts of the design space and evaluate their performance and user preferences. Our results show that pointing using tracked hand-held controllers outperforms all other methods. Other methods such as head pointing can be viable alternatives depending on available resources. We summarize our findings by formulating guidelines for choosing optimal virtual keyboard text entry methods in VR.",
  "tags": [
    "virtual reality",
    "task performance",
    "pointing",
    "user experience",
    "text entry",
    "mid-air"
  ],
  "authors": [
    {
      "name": "Marco Speicher",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Saarland, Germany",
      "img": "/do/10.1145/contrib-89758843557/rel-imgonly/89758843557.jpg",
      "acmid": "89758843557",
      "orcid": "missing"
    },
    {
      "name": "Anna Maria Feit",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81556550256/rel-imgonly/crop1.jpg",
      "acmid": "81556550256",
      "orcid": "missing"
    },
    {
      "name": "Pascal Ziegler",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Saarland, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261978",
      "orcid": "missing"
    },
    {
      "name": "Antonio Krüger",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Saarland, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Jaewoo Ahn and Kyungha Min. 2006. VirtualPhonepad: a text input tool for virtual environments. Advances in Artificial Reality and Tele-Existence (2006), 58--64.  ",
      "doi": "10.1007/11941354_7"
    },
    {
      "text": "Ian G Angus and Henry A Sowizral. 1995. Embedding the 2D interaction metaphor in a real 3D virtual environment. In IS&T/SPIE's Symposium on Electronic Imaging: Science & Technology. International Society for Optics and Photonics, 282--293.",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 251--260.  ",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Myroslav Bachynskyi, Gregorio Palmas, Antti Oulasvirta, and Tino Weinkauf. 2015. Informing the Design of Novel Input Methods with Muscle Coactivation Clustering. ACM Trans. Comput.-Hum. Interact. 21, 6, Article 30 (Jan. 2015), 25 pages.  ",
      "doi": "10.1145/2687921"
    },
    {
      "text": "Thomas Baudel and Michel Beaudouin-Lafon. 1993. Charade: Remote Control of Objects Using Free-hand Gestures. Commun. ACM 36, 7 (July 1993), 28--35.  ",
      "doi": "10.1145/159544.159562"
    },
    {
      "text": "Nikolaus Bee and Elisabeth Andr´ e. 2008. Writing with your eye: A dwell time free writing system adapted to the nature of human eye gaze. In International Tutorial and Research Workshop on Perception and Interactive Technologies for Speech-Based Systems. Springer, 111--122.  ",
      "doi": "10.1007/978-3-540-69369-7_13"
    },
    {
      "text": "Doug Bowman, Ernst Kruijff, Joseph J LaViola Jr, and Ivan P Poupyrev. 2004. 3D User Interfaces: Theory and Practice, CourseSmart eTextbook. Addison-Wesley. ",
      "doi": "10.5555/993837"
    },
    {
      "text": "Doug A. Bowman, Ryan P. McMahan, and Eric D. Ragan. 2012. Questioning Naturalism in 3D User Interfaces. Commun. ACM 55, 9 (Sept. 2012), 78--88.  ",
      "doi": "10.1145/2330667.2330687"
    },
    {
      "text": "Doug A. Bowman, Christopher J. Rhoton, and Marcio S. Pinho. 2002. Text Input Techniques for Immersive Virtual Environments: An Empirical Comparison. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 46, 26 (2002), 2154--2158.",
      "doi": ""
    },
    {
      "text": "Wei Ding, Ping Chen, Hisham Al-Mubaid, and Marc Pomplun. 2009. A Gaze-Controlled Interface to Virtual Reality Applications for Motor-and Speech-Impaired Users. HCI International, San Diego, CA (2009).",
      "doi": ""
    },
    {
      "text": "August Dvorak, Nellie L Merrick, William L Dealey, and Gertrude C Ford. 1936. Typewriting behavior. New York: American Book Company 1, 6 (1936).",
      "doi": ""
    },
    {
      "text": "Peter J Gianaros, Eric R Muth, J Toby Mordkoff, Max E Levine, and Robert M Stern. 2001. A questionnaire for the assessment of the multiple dimensions of motion sickness. Aviation, Space, and Environmental Medicine 72, 2 (2001), 115.",
      "doi": ""
    },
    {
      "text": "Yulia Gizatdinova, Oleg Špakov, and Veikko Surakka. 2012. Comparison of Video-based Pointing and Selection Techniques for Hands-free Text Entry. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, New York, NY, USA, 132--139.  ",
      "doi": "10.1145/2254556.2254582"
    },
    {
      "text": "Gabriel Gonz´ alez, Jos´ e P Molina, Arturo S Garc´ìa, Diego Mart´nez, and Pascual Gonz´ alez. 2009. Evaluation of text input techniques in immersive virtual environments. In New Trends on Human-Computer Interaction. Springer, 109--118.",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer, David Dobbelstein, Christian Winkler, Gabriel Haas, and Enrico Rukzio. 2016. FaceTouch: Enabling Touch Interaction in Display Fixed UIs for Mobile Virtual Reality. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 49--60.  ",
      "doi": "10.1145/2984511.2984576"
    },
    {
      "text": "Sean Gustafson, Daniel Bierwirth, and Patrick Baudisch. 2010. Imaginary Interfaces: Spatial Interaction with Empty Hands and Without Visual Feedback. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 3--12.  ",
      "doi": "10.1145/1866029.1866033"
    },
    {
      "text": "S. G. Hart and L. E. Stavenland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Human Mental Workload, P. A. Hancock and N. Meshkati (Eds.). Elsevier, Chapter 7, 139--183. http://ntrs.nasa.gov/archive/nasa/casi.ntrs. nasa.gov/20000004342_1999205624.pdf",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Mary Czerwinski, and Mike Sinclair. 1998. Interaction and Modeling Techniques for Desktop Two-handed Input. In Proceedings of the 11th Annual ACM Symposium on User Interface Software and Technology (UIST '98). ACM, New York, NY, USA, 49--58.  ",
      "doi": "10.1145/288392.288572"
    },
    {
      "text": "Lode Hoste, Bruno Dumas, and Beat Signer. 2012. SpeeG: A Multimodal Speech- and Gesture-based Text Input Solution. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, New York, NY, USA, 156--163.  ",
      "doi": "10.1145/2254556.2254585"
    },
    {
      "text": "Jason Jerald. 2015. The VR book: human-centered design for virtual reality. (2015). ",
      "doi": "10.5555/2886140"
    },
    {
      "text": "Robin Kinkead. 1975. Typing Speed, Keying Rates, and Optimal Keyboard Layouts. Proceedings of the Human Factors Society Annual Meeting 19, 2 (1975), 159--161.",
      "doi": ""
    },
    {
      "text": "Regis Kopper, Doug A. Bowman, Mara G. Silva, and Ryan P. McMahan. 2010. A human motor behavior model for distal pointing tasks. International Journal of Human-Computer Studies 68, 10 (2010), 603 -- 615.  ",
      "doi": "10.1016/j.ijhcs.2010.05.001"
    },
    {
      "text": "Per Ola Kristensson and Keith Vertanen. 2012. Performance Comparisons of Phrase Sets and Presentation Styles for Text Entry Evaluations. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI '12). ACM, New York, NY, USA, 29--32.  ",
      "doi": "10.1145/2166966.2166972"
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and evaluation of a user experience questionnaire. In Symposium of the Austrian HCI and Usability Engineering Group. Springer, 63--76.  ",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "Anatole Lecuyer. 2009. Simulating Haptic Feedback Using Vision: A Survey of Research and Applications of Pseudo-Haptic Feedback. Presence: Teleoperators and Virtual Environments 18, 1 (2009), 39--53.  ",
      "doi": "10.1162/pres.18.1.39"
    },
    {
      "text": "Kun Chang Lee and Namho Chung. 2008. Empirical analysis of consumer reaction to the virtual reality shopping mall. Computers in Human Behavior 24, 1 (2008), 88 -- 104.  ",
      "doi": "10.1016/j.chb.2007.01.018"
    },
    {
      "text": "Vladimir I Levenshtein. 1966. Binary codes capable of correcting deletions, insertions, and reversals. In Soviet physics doklady, Vol. 10. 707--710.",
      "doi": ""
    },
    {
      "text": "Jia-Wei Lin, Ping-Hsuan Han, Jiun-Yu Lee, Yang-Sheng Chen, Ting-Wei Chang, Kuan-Wen Chen, and Yi-Ping Hung. 2017. Visualizing the Keyboard in Virtual Reality for Enhancing Immersive Experience. In ACM SIGGRAPH 2017 Posters (SIGGRAPH '17). ACM, New York, NY, USA, Article 35, 2 pages.  ",
      "doi": "10.1145/3102163.3102175"
    },
    {
      "text": "Kent Lyons, Thad Starner, Daniel Plaisted, James Fusia, Amanda Lyons, Aaron Drew, and E. W. Looney. 2004. Twiddler Typing: One-handed Chording Text Entry for Mobile Phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 671--678.  ",
      "doi": "10.1145/985692.985777"
    },
    {
      "text": "I. Scott MacKenzie. 2002. KSPC (Keystrokes per Character) as a Characteristic of Text Entry Techniques. Springer Berlin Heidelberg, Berlin, Heidelberg, 195--210.",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and Kumiko Tanaka-Ishii. 2007. Text Entry Systems: Mobility, Accessibility, Universality. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA. ",
      "doi": "10.5555/1296062"
    },
    {
      "text": "I. Scott MacKenzie and Shawn X. Zhang. 1999. The Design and Evaluation of a High-performance Soft Keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 25--31.  ",
      "doi": "10.1145/302979.302983"
    },
    {
      "text": "Allan MacLean, Richard M. Young, Victoria M. E. Bellotti, and Thomas P. Moran. 1991. Questions, Options, and Criteria: Elements of Design Space Analysis. Hum.-Comput. Interact. 6, 3 (Sept. 1991), 201--250.  ",
      "doi": "10.1207/s15327051hci0603%25264_2"
    },
    {
      "text": "P¨ aivi Majaranta and Kari-Jouko R¨ aih¨ a. 2007. Text entry by gaze: Utilizing eye-tracking. Text entry systems: Mobility, accessibility, universality (2007), 175--187. http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1. 1.102.5479",
      "doi": ""
    },
    {
      "text": "Anders Markussen, Mikkel R Jakobsen, and Kasper Hornbæk. 2013. Selection-based mid-air text entry on large displays. In IFIP Conference on Human-Computer Interaction. Springer, 401--418.",
      "doi": ""
    },
    {
      "text": "Mark McGill, Daniel Boland, Roderick Murray-Smith, and Stephen Brewster. 2015. A Dose of Reality: Overcoming Usability Challenges in VR Head-Mounted Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2143--2152.  ",
      "doi": "10.1145/2702123.2702382"
    },
    {
      "text": "Mathieu Nancel, Julie Wagner, Emmanuel Pietriga, Olivier Chapuis, and Wendy Mackay. 2011. Mid-air Pan-and-zoom on Wall-sized Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 177--186.  ",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "Jan Noyes. 1983. The QWERTY keyboard: A review. International Journal of Man-Machine Studies 18, 3 (1983), 265--281.",
      "doi": ""
    },
    {
      "text": "Gang Ren and Eamonn O'Neill. 2013. Freehand Gestural Text Entry for Interactive TV. In Proceedings of the 11th European Conference on Interactive TV and Video (EuroITV '13). ACM, New York, NY, USA, 121--130.  ",
      "doi": "10.1145/2465958.2465966"
    },
    {
      "text": "Garth Shoemaker, Leah Findlater, Jessica Q. Dawson, and Kellogg S. Booth. 2009. Mid-air Text Input Techniques for Very Large Wall Displays. In Proceedings of Graphics Interface 2009 (GI '09). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 231--238. http://dl.acm.org/citation.cfm?id=1555880.1555931 ",
      "doi": "10.5555/1555880.1555931"
    },
    {
      "text": "Srinath Sridhar, Anna Maria Feit, Christian Theobalt, and Antti Oulasvirta. 2015. Investigating the Dexterity of Multi-Finger Input for Mid-Air Text Entry. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3643--3652.  ",
      "doi": "10.1145/2702123.2702136"
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2011. A Versatile Dataset for Text Entry Evaluations Based on Genuine Mobile Emails. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 295--298.  ",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "James Walker, Bochao Li, Keith Vertanen, and Scott Kuhl. 2017. Efficient Typing on a Visually Occluded Physical Keyboard. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5457--5461.  ",
      "doi": "10.1145/3025453.3025783"
    },
    {
      "text": "Frank Weichert, Daniel Bachmann, Bartholomus Rudak, and Denis Fisseler. 2013. Analysis of the Accuracy and Robustness of the Leap Motion Controller. Sensors 13, 5 (2013), 6380--6393.",
      "doi": ""
    },
    {
      "text": "Andrew D. Wilson and Maneesh Agrawala. 2006. Text Entry Using a Dual Joystick Game Controller. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 475--478.  ",
      "doi": "10.1145/1124772.1124844"
    },
    {
      "text": "Jacob O Wobbrock. 2007. Measures of text entry performance. San Francisco: Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Duen Horng Chau, and Brad A. Myers. 2007. An Alternative to Push, Press, and Tap-tap-tap: Gesturing on an Isometric Joystick for Mobile Phone Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 667--676.  ",
      "doi": "10.1145/1240624.1240728"
    },
    {
      "text": "Chun Yu, Yizheng Gu, Zhican Yang, Xin Yi, Hengliang Luo, and Yuanchun Shi. 2017. Tap, Dwell or Gesture?: Exploring Head-Based Text Entry Techniques for HMDs. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4479--4488.  ",
      "doi": "10.1145/3025453.3025964"
    },
    {
      "text": "Shumin Zhai. 1995. Human Performance in Six Degree of Freedom Input Control. (1995).",
      "doi": ""
    }
  ]
}