{
  "doi": "10.1145/3173574.3174123",
  "title": "Addressing Network Anxieties with Alternative Design Metaphors",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Optimism and positivity permeate discourses of smart interactive network technologies. Yet we do not have to look too far or too deep to find anxieties knotting up on the horizon and festering below the network's glistening surface. This paper contributes a set of concepts, tactics, and novel design forms for addressing network anxieties generated through a design-led inquiry, or research through design approach. We present three technically grounded metaphors illustrated with examples selected from our exploratory design process. Weaving together concepts from surveillance studies, cultural studies, and other areas of the humanities with our visual and physical design work, we help draw attention to under-addressed concerns within HCI while proposing alternative ways of framing and engaging design issues arising with network technologies.",
  "authors": [
    {
      "name": "James Pierce",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    },
    {
      "name": "Carl DiSalvo",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100258547",
      "orcid": "0000-0002-7344-8741"
    }
  ],
  "references": [
    {
      "text": "Amoore, Louise. The Politics of Possibility: Risk and Security beyond Probability. Duke University Press, 2013.",
      "doi": ""
    },
    {
      "text": "\"Anxiety | Definition of Anxiety in English by Oxford Dictionaries.\" Oxford Dictionaries | English. Accessed September 15, 2017. https://en.oxforddictionaries.com/definition/anxiety.",
      "doi": ""
    },
    {
      "text": "Asad, Mariam, Christopher A. Le Dantec, Becky Nielsen, and Kate Diedrick. \"Creating a Sociotechnical API: Designing City-Scale Community Engagement.\" In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2295--2306. ACM, 2017. http://dl.acm.org/citation.cfm?id=302596  ",
      "doi": "10.1145/3025453.3025963"
    },
    {
      "text": "Symptoms of EMF http://www.weepinitiative.org/areyou.html",
      "doi": ""
    },
    {
      "text": "Bardzell, Shaowen, Jeffrey Bardzell, Jodi Forlizzi, John Zimmerman, and John Antanitis. \"Critical Design and Critical Theory: The Challenge of Designing for Provocation.\" In Proceedings of the Designing Interactive Systems Conference, 288--297. DIS '12. New York, NY, USA: ACM, 2012.  ",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "Blythe, Mark, Kristina Andersen, Rachel Clarke, and Peter Wright. Anti-Solutionist Strategies: Seriously Silly Design Fiction.\" In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 4968--4978. ACM, 201  ",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Browne, Simone. Dark Matters: On the Surveillance of Blackness. Duke University Press, 2015.",
      "doi": ""
    },
    {
      "text": "Brunton, Finn, and Helen Nissenbaum. Obfuscation: A User's Guide for Privacy and Protest. Mit Press, 2015. ",
      "doi": "10.5555/2838885"
    },
    {
      "text": "Carmichael, Jessica. \"Google Knows You Better Than You Know Yourself - The Atlantic.\" Accessed September 16, 2017. https://www.theatlantic.com/technology/archive/2014/08/google-knows-you-better-than-you-know-yourself/378608/.",
      "doi": ""
    },
    {
      "text": "Chun, Wendy Hui Kyong. Control and Freedom: Power and Paranoia in the Age of Fiber Optics. mit Press, 2008. ",
      "doi": "10.5555/1502401"
    },
    {
      "text": "1Deleuze, Gilles. \"Postscript on the Societies of Control.\" October 59 (1992): 3--7.",
      "doi": ""
    },
    {
      "text": "Dubrofsky, Rachel E., and Shoshana Amielle Magnet. Feminist Surveillance Studies. Duke University Press, 2015.",
      "doi": ""
    },
    {
      "text": "Elsden, Chris, David Chatting, Abigail C. Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S. Kirk. \"On Speculative Enactments.\" In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 5386--5399. ACM.  ",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Evans, Dave. \"The Internet of Things: How the next Evolution of the Internet Is Changing Everything.\" CISCO White Paper 1, no. 2011 (2011): 1--11.",
      "doi": ""
    },
    {
      "text": "Fiske, John. \"Surveilling the City: Whiteness, the Black Man and Democratic Totalitarianism.\" Theory, Culture&Society 15, no. 2 (1998): 67--88.",
      "doi": ""
    },
    {
      "text": "Fraser, M. 2010. \"Facts, Ethics and Event.'' In Deleuzian Intersections in Science, Technology and Anthropology, edited by C. Bruun Jensen and K. Ro¨dje, 57--82. New York, NY: Berghahn Press.",
      "doi": ""
    },
    {
      "text": "Galloway, Alexander R. Protocol: How Control Exists after Decentralization. MIT press, 2004. ",
      "doi": "10.5555/975052"
    },
    {
      "text": "Gaver, William. \"What Should We Expect from Research Through Design?\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 937--946. CHI '12. New York, NY, USA: ACM, 2012.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Gaver, William. \"Making Spaces: How Design Workbooks Work.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1551--1560. ACM, 2011.  ",
      "doi": "10.1145/1978942.1979169"
    },
    {
      "text": "Gaver, Bill, Tony Dunne, and Elena Pacenti. \"Design: Cultural Probes.\" Interactions 6, no. 1 (1999): 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "2Giaccardi, Elisa, Nazli Cila, Chris Speed, and Melissa Caldwell. \"Thing Ethnography: Doing Design Research with Non-Humans.\" In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 377--387. DIS '16. New York, NY, USA: ACM, 2016.  ",
      "doi": "10.1145/2901790.2901905"
    },
    {
      "text": "2Gordon, Avery F. Ghostly Matters: Haunting and the Sociological Imagination. U of Minnesota Press, 2008.",
      "doi": ""
    },
    {
      "text": "Haggerty, Kevin D., and Richard V. Ericson. \"The Surveillant Assemblage.\" The British Journal of Sociology 51, no. 4 (2000): 605--622.",
      "doi": ""
    },
    {
      "text": "\"Hackers Use A Refrigerator To Attack Businesses - Business Insider.pdf.\" Accessed September 15, 2017. https://wecanfigurethisout.org/ENERGY/Lecture_notes/Smart_Grid_Supporting_materials/Hackers%20Use%20A%20Refrigerator%20To%20Attack%20Businesses%20-%20Business%20Insider.pdf.",
      "doi": ""
    },
    {
      "text": "Hanington, Bruce, and Bella Martin. Universal Methods of Design: 100 Ways to Research Complex Problems, Develop Innovative Ideas, and Design Effective Solutions. Rockport Publishers, 2012.",
      "doi": ""
    },
    {
      "text": "Harmon, Ellie, and Melissa Mazmanian. \"Stories of the Smartphone in Everyday Discourse: Conflict, Tension&Instability.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1051--1060. ACM, 2013.  ",
      "doi": "10.1145/2470654.2466134"
    },
    {
      "text": "Hu, Tung-Hui. A Prehistory of the Cloud. MIT Press, 2015. ",
      "doi": "10.5555/3098742"
    },
    {
      "text": "Hong, Jason I., and James A. Landay. \"An Architecture for Privacy-Sensitive Ubiquitous Computing.\" In Proceedings of the 2nd International Conference on Mobile Systems, Applications, and Services, 177--189. ACM, 2004.  ",
      "doi": "10.1145/990064.990087"
    },
    {
      "text": "Irani, Lilly C., and M. Silberman. \"Stories We Tell About Labor: Turkopticon and the Trouble with Design.\" In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 4573--4586. ACM, 2016.  ",
      "doi": "10.1145/2858036.2858592"
    },
    {
      "text": "Irani, Lilly C., and M. Silberman. \"Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 611--620. ACM, 2013. http://dl.acm.org/citation.cfm?id=2470742.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "3Kaplan, Caren. \"Precision Targets: GPS and the Militarization of US Consumer Identity.\" American Quarterly 58, no. 3 (2006): 693--714.",
      "doi": ""
    },
    {
      "text": "3Kuntsman, Adi, and Rebecca Stein. Digital Militarism: Israel's Occupation in the Social Media Age. Stanford University Press, 2015.",
      "doi": ""
    },
    {
      "text": "3Leshed, Gilly, and Phoebe Sengers. \"I Lie to Myself That I Have Freedom in My Own Schedule: Productivity Tools and Experiences of Busyness.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 905--914. ACM, 2011.  ",
      "doi": "10.1145/1978942.1979077"
    },
    {
      "text": "Lin, Jialiu, Shahriyar Amini, Jason I. Hong, Norman Sadeh, Janne Lindqvist, and Joy Zhang. \"Expectation and Purpose: Understanding Users' Mental Models of Mobile App Privacy through Crowdsourcing.\" In Proceedings of the 2012 ACM Conference on Ubiquitous Computing, 501--510. ACM, 2012.  ",
      "doi": "10.1145/2370216.2370290"
    },
    {
      "text": "Lindley, Joseph, and Paul Coulton. \"Back to the Future: 10 Years of Design Fiction.\" In Proceedings of the 2015 British HCI Conference, 210--211. ACM  ",
      "doi": "10.1145/2783446.2783592"
    },
    {
      "text": "Monahan, Torin. \"The Right to Hide? Anti-Surveillance Camouflage and the Aestheticization of Resistance.\" Communication and Critical/Cultural Studies 12, no. 2 (2015): 159--178.",
      "doi": ""
    },
    {
      "text": "3Monahan, Torin. \"Counter-Surveillance as Political Intervention?\" Social Semiotics 16, no. 4 (2006): 515--534.",
      "doi": ""
    },
    {
      "text": "3Michael, Mike. \"'What Are We Busy Doing?' Engaging the Idiot.\" Science, Technology,&Human Values 37, no. 5 (2012): 528--554.",
      "doi": ""
    },
    {
      "text": "3Odom, William T., Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. \"Designing for Slowness, Anticipation and Re-Visitation: A Long Term Field Study of the Photobox.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1961--1970. ACM, 2014.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Pierce, James, and Carl DiSalvo. Dark Clouds, Io&!+, and {Crystal Ball Emoji}: Projecting Network Anxieties with Alternative Design Metaphors.\" In Proceedings of the 2017 Conference on Designing Interactive Systems, 1383--1393. DIS '17. New York, NY, USA: ACM, 2017.  ",
      "doi": "10.1145/3064663.3064795"
    },
    {
      "text": "4Pierce, James, and Carl DiSalvo. Network Anxieties Design Packets. In Proceedings of Research through Design Conference 2017.",
      "doi": ""
    },
    {
      "text": "4Pierce, James. \"Design Proposal for a Wireless Derouter: Speculatively Engaging Digitally Disconnected Space.\" In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 388--402. ACM, 2016.  ",
      "doi": "10.1145/2901790.2901908"
    },
    {
      "text": "4Pierce, James, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. \"Expanding and Refining Design and Criticality in HCI.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2083--2092. ACM, 2015.  ",
      "doi": "10.1145/2702123.2702438"
    },
    {
      "text": "4Seigworth, Gregory J., and Melissa Gregg. \"An Inventory of Shimmers.\" The Affect Theory Reader, 2010, 1--25.",
      "doi": ""
    },
    {
      "text": "4Sengers, Phoebe. \"What I Learned on Change Islands: Reflections on IT and Pace of Life.\" Interactions 18, no. 2 (2011): 40--48.  ",
      "doi": "10.1145/1925820.1925830"
    },
    {
      "text": "4Shklovski, Irina, Scott D. Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. \"Leakiness and Creepiness in App Space: Perceptions of Privacy and Mobile App Use.\" In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems, 2347--2356. ACM, 2014.  ",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "4Stapper, Pieter and Elisa Giaccardi. \"Research through Design.\" The Encyclopedia of Human-Computer Interaction, 2nd edition. The Interaction Design Foundation. Accessed January 8, 2018. https://www.interaction-design.org/literature/book/the-encyclopedia-of-human-computer-interaction-2nd-ed/research-through-design.",
      "doi": ""
    },
    {
      "text": "4Troshynski, Emily, Charlotte Lee, and Paul Dourish. \"Accountabilities of Presence: Reframing Location-Based Systems.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 487--496. ACM, 2008.  ",
      "doi": "10.1145/1357054.1357133"
    },
    {
      "text": "4Tufekci, Zeynep. \"Why'Smart'Objects May Be a Dumb Idea.\" New York Times, 2015.",
      "doi": ""
    },
    {
      "text": "\"Uber Is Being Slammed for Its 'surge Pricing' after the London Terror Attack.\" The Independent, June 4, 2017. http://www.independent.co.uk/news/uk/home-news/london-terror-attack-uber-criticised-surge-pricing-after-london-bridge-black-cab-a7772246.html",
      "doi": ""
    },
    {
      "text": "5Uscinski, Joseph E., and Joseph M. Parent. American Conspiracy Theories. Oxford University Press, 2014.",
      "doi": ""
    },
    {
      "text": "\"Silicon Valley's $400 Juicer May Be Feeling the Squeeze.\" Bloomberg.com, April 19, 2017. https://www.bloomberg.com/news/features/2017-04--19/silicon-valley-s-400-juicer-may-be-feeling-the-squeeze.",
      "doi": ""
    },
    {
      "text": "5Wakkary, Ron, William Odom, Sabrina Hauser, Garnet Hertz, and Henry Lin. 'Material Speculation: Actual Artifacts for Critical Inquiry.\" In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives, 97--108. Aarhus University Press, 2015.  ",
      "doi": "10.7146/aahcc.v1i1.21299"
    },
    {
      "text": "5Weiser, Mark. The Computer for the 21 St Century.\" Scientific American 265, no. 3 (1991): 94--105.",
      "doi": ""
    },
    {
      "text": "5Weizman, Eyal. 'Introduction: Forensis.\" Forensis: The Architecture of Public Truth, 2014, 9--32.",
      "doi": ""
    },
    {
      "text": "5Wilson, Dean Jonathon, and Tanya Serisier. 'Video Activism and the Ambiguities of Counter-Surveillance.\" Surveillance&Society 8, no. 2 (2010): 166--180.",
      "doi": ""
    },
    {
      "text": "5Wolf, Tracee Vetting, Jennifer A. Rode, Jeremy Sussman, and Wendy A. Kellogg. 'Dispelling Design as the Black Art of CHI.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 521--530. ACM, 2006.  ",
      "doi": "10.1145/1124772.1124853"
    },
    {
      "text": "5Zimmerman, John, Jodi Forlizzi, and Shelley Evenson. 'Research Through Design As a Method for Interaction Design Research in HCI.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 493--502. CHI '07. New York, NY, USA: ACM, 2007.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}