{
  "doi": "10.1145/3173574.3173852",
  "title": "Science Everywhere: Designing Public, Tangible Displays to Connect Youth Learning Across Settings",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "A major challenge in education is understanding how to connect learning experiences across settings (e.g., school, afterschool, and home) for youth. In this paper, we introduce and describe the participatory design process we undertook to develop Science Everywhere (SE), which is a sociotechnical system where children share their everyday science learning via social media. Public displays installed throughout the neighborhood invite parents, adults, peers, and community members to interact with children's ideas to better develop connections for learning across settings. Our case study of community interactions with the public displays illuminate how these technologies encouraged behaviors such as the noticing of children's ideas, recognition of people in the neighborhood, and bridging to new learning opportunities for youth.",
  "authors": [
    {
      "name": "June Ahn",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160734",
      "orcid": "missing"
    },
    {
      "name": "Tamara Clegg",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317487507",
      "orcid": "missing"
    },
    {
      "name": "Jason Yip",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757149",
      "orcid": "0000-0001-9980-0670"
    },
    {
      "name": "Elizabeth Bonsignore",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641019",
      "orcid": "missing"
    },
    {
      "name": "Daniel Pauw",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259102757",
      "orcid": "missing"
    },
    {
      "name": "Lautaro Cabrera",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-99659261030/rel-imgonly/lautarocabrera.jpg",
      "acmid": "99659261030",
      "orcid": "missing"
    },
    {
      "name": "Kenna Hernly",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261033",
      "orcid": "missing"
    },
    {
      "name": "Caroline Pitt",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659045615/rel-imgonly/option-2.jpg",
      "acmid": "99659045615",
      "orcid": "missing"
    },
    {
      "name": "Kelly Mills",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022363",
      "orcid": "missing"
    },
    {
      "name": "Arturo Salazar",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261911",
      "orcid": "missing"
    },
    {
      "name": "Diana Griffing",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261384",
      "orcid": "missing"
    },
    {
      "name": "Jeff Rick",
      "institution": "BadDesigner.us, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660389940",
      "orcid": "missing"
    },
    {
      "name": "Rachael Marr",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261252",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahn, J. et al. 2014. \"I want to be a game designer or scientist\": Connected learning and developing identities with urban, African-American youth. Proceedings of the Eleventh International Conference of the Learning Sciences (ICLS 2014) (Boulder, CO, 2014), 657--664.",
      "doi": ""
    },
    {
      "text": "Ahn, J. et al. 2016. Seeing the unseen learner: designing and using social media to recognize children's science dispositions in action. Learning, Media and Technology. 41, 2 (2016), 252--282.",
      "doi": ""
    },
    {
      "text": "Alt, F. et al. 2014. UniDisplay-A research prototype to investigate expectations towards public display applications. Pervasive Computing & Communications Workshops (PERCOM Workshops), 2014 IEEE International Conference on (2014), 519-- 524.",
      "doi": ""
    },
    {
      "text": "Ardito, C. et al. 2015. Interaction with large displays: A survey. ACM Computing Surveys (CSUR). 47, 3 (2015), 46.  ",
      "doi": "10.1145/2682623"
    },
    {
      "text": "Azevedo, F.S. 2011. Lines of practice: A practicecentered theory of interest relationships. Cognition and Instruction. 29, 2 (2011), 147--184.",
      "doi": ""
    },
    {
      "text": "Azevedo, F.S. 2013. The tailored practice of hobbies and its implication for the design of interest-driven learning environments. Journal of the Learning Sciences. 22, 3 (2013), 462--510.",
      "doi": ""
    },
    {
      "text": "Barron, B. 2006. Interest and Self-Sustained Learning as Catalysts of Development: A Learning Ecology Perspective. Human Development. 49, 4 (2006), 193-- 224.",
      "doi": ""
    },
    {
      "text": "Barron, B. et al. 2009. Parents as learning partners in the development of technological fluency. (2009).",
      "doi": ""
    },
    {
      "text": "Bell, P. et al. 2013. Learning in diversities of structures of social practice: Accounting for how, why and where people learn science. Human Development. 55, 5--6 (2013), 269--284.",
      "doi": ""
    },
    {
      "text": "Bronkhorst, L.H. and Akkerman, S.F. 2016. At the boundary of school: Continuity and discontinuity in learning across contexts. Educational Research Review. 19, (Nov. 2016), 18--35.",
      "doi": ""
    },
    {
      "text": "Calabrese Barton, A. et al. 2008. Creating hybrid spaces for engaging school science among urban middle school girls. American Educational Research Journal. 45, 1 (2008), 68--103.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. et al. 2014. Grounding Activity in People-Centered Smart Territories by Enhancing Community Awareness. IxD&A. 20, (2014), 9--22.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. and Rosson, M.B. 2013. Wild at home: the neighborhood as a living laboratory for HCI. ACM Transactions on Computer-Human Interaction (TOCHI). 20, 3 (2013), 16.  ",
      "doi": "10.1145/2491500.2491504"
    },
    {
      "text": "Churchill, E. et al. 2004. Blending digital and physical spaces for ubiquitous community participation. Communications of the ACM. 47, 2 (2004), 38--44.  ",
      "doi": "10.1145/966389.966413"
    },
    {
      "text": "Churchill, E.F. et al. 2003. Multimedia fliers: Information sharing with digital community bulletin boards. Communities and technologies (2003), 97--117. ",
      "doi": "10.5555/966263.966269"
    },
    {
      "text": "Clegg, T. et al. 2014. Capturing Personal and Social Science: Technology for Integrating the Building Blocks of Disposition. Proceedings of the Eleventh International Conference of the Learning Sciences (ICLS 2014). (Boulder, CO, 2014).",
      "doi": ""
    },
    {
      "text": "Clegg, T. and Kolodner, J. 2014. Scientizing and Cooking: Helping Middle-School Learners Develop Scientific Dispositions. Science Education. 98, 1 (2014), 36--63.",
      "doi": ""
    },
    {
      "text": "Cobb, P. et al. 2003. Design experiments in educational research. Educational researcher. 32, 1 (2003), 9--13.",
      "doi": ""
    },
    {
      "text": "Crowley, K. et al. 2015. Interest and the development of pathways to science. Handbook of Iinterest in mathematics and science learning and related activitiyes. Washington, DC: AERA. (2015).",
      "doi": ""
    },
    {
      "text": "Davies, N. et al. 2012. Open display networks: A communications medium for the 21st century. Computer. 45, 5 (2012), 58--64.  ",
      "doi": "10.1109/MC.2012.114"
    },
    {
      "text": "Dedoose: http://dedoose.com/. Accessed: 2017-09--16.",
      "doi": ""
    },
    {
      "text": "Eberbach, C. and Crowley, K. 2017. From seeing to observing: How parents and children learn to see science in a botanical garden. Journal of the Learning Sciences. online first (2017).",
      "doi": ""
    },
    {
      "text": "Erete, S.L. 2013. Community, group and individual: A framework for designing community technologies. The Journal of Community Informatics. 10, 1 (2013).",
      "doi": ""
    },
    {
      "text": "Hosio, S. et al. 2012. From school food to skate parks in a few clicks: using public displays to bootstrap civic engagement of the young. Pervasive computing. (2012), 425--442.  ",
      "doi": "10.1007/978-3-642-31205-2_26"
    },
    {
      "text": "Jurmu, M. et al. 2016. Emergent practice as a methodological lens for public displays in-the-wild. Proceedings of the 5th ACM International Symposium on Pervasive Displays (2016), 124--131.  ",
      "doi": "10.1145/2914920.2915007"
    },
    {
      "text": "Koeman, L. et al. 2014. What chalk and tape can tell us: lessons learnt for next generation urban displays. Proceedings of The International Symposium on Pervasive Displays (2014), 130.  ",
      "doi": "10.1145/2611009.2611018"
    },
    {
      "text": "Kuhn, A. et al. 2012. How Students Find, Evaluate and Utilize Peer-collected Annotated Multimedia Data in Science Inquiry with Zydeco. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2012), 3061--3070.  ",
      "doi": "10.1145/2207676.2208719"
    },
    {
      "text": "Kukka, H. et al. 2014. Urban computing in theory and practice: towards a transdisciplinary approach. Proceedings of the 8th Nordic Conference on HumanComputer Interaction: Fun, Fast, Foundational (2014), 658--667.  ",
      "doi": "10.1145/2639189.2639250"
    },
    {
      "text": "Leong, Z.A. and Horn, M.S. 2014. Waiting for learning: designing interactive education materials for patient waiting areas. Proceedings of the 2014 conference on Interaction design and children (2014), 145--153.  ",
      "doi": "10.1145/2593968.2593970"
    },
    {
      "text": "Luce, M.R. et al. 2017. Designing for family science explorations anytime, anywhere. Science Education. 101, 2 (2017), 251--277.",
      "doi": ""
    },
    {
      "text": "Mäkelä, V. et al. 2017. Challenges in Public Display Deployments: A Taxonomy of External Factors. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017), 3426--3475.  ",
      "doi": "10.1145/3025453.3025798"
    },
    {
      "text": "Memarovic, N. et al. 2015. Capture the Moment: In the Wild Longitudinal Case Study of Situated Snapshots Captured Through an Urban Screen in a Community Setting. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (2015), 242--253.  ",
      "doi": "10.1145/2675133.2675165"
    },
    {
      "text": "Memarovic, N. et al. 2011. Connecting people through content--Promoting community identity cognition through people and places. Proceedings of 2011 CIRN Conference on Community Informatics (2011), 9--11.",
      "doi": ""
    },
    {
      "text": "Memarovic, N. et al. 2013. P-LAYERS--A layered framework addressing the multifaceted issues facing community-supporting public display deployments. ACM Transactions on Computer-Human Interaction (TOCHI). 20, 3 (2013), 17.  ",
      "doi": "10.1145/2491500.2491505"
    },
    {
      "text": "Memarovic, N. et al. 2012. The interacting places framework: conceptualizing public display applications that promote community interaction and place awareness. Proceedings of the 2012 International Symposium on Pervasive Displays (2012), 7.  ",
      "doi": "10.1145/2307798.2307805"
    },
    {
      "text": "Memarovic, N. 2015. Understanding future challenges for networked public display systems in community settings. Proceedings of the 7th International Conference on Communities and Technologies (2015), 39--48.  ",
      "doi": "10.1145/2768545.2768559"
    },
    {
      "text": "Müller, J. et al. 2014. Communiplay: a field study of a public display mediaspace. Proceedings of the 32nd annual ACM conference on Human factors in computing systems (2014), 1415--1424.  ",
      "doi": "10.1145/2556288.2557001"
    },
    {
      "text": "Ostermann, E.C. et al. 2015. CommunityConnect: An Interactive Display for Educational Residential Settings. Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing (2015), 175--178.  ",
      "doi": "10.1145/2685553.2699000"
    },
    {
      "text": "Peltonen, P. et al. 2007. Extending large-scale event participation with user-created mobile media on a public display. Proceedings of the 6th international conference on Mobile and ubiquitous multimedia (2007), 131--138.  ",
      "doi": "10.1145/1329469.1329487"
    },
    {
      "text": "Penuel, W.R. et al. 2016. A Social Practice Theory of Learning and Becoming Across Contexts and Time. Frontline Learning Research. 4, 4 (2016), 30--38.",
      "doi": ""
    },
    {
      "text": "Rogers, Y. and Brignull, H. 2002. Subtle ice-breaking: encouraging socializing and interaction around a large public display. Workshop on Public, Community. and Situated Displays (2002).",
      "doi": ""
    },
    {
      "text": "Roque, R. et al. 2016. \"I'm Not Just a Mom\": Parents Developing Multiple Roles in Creative Computing. Singapore: International Society of the Learning Sciences.",
      "doi": ""
    },
    {
      "text": "Sandoval, W. 2014. Conjecture mapping: An approach to systematic educational design research. Journal of the learning sciences. 23, 1 (2014), 18--36.",
      "doi": ""
    },
    {
      "text": "Smart and Connected Communities for Learning -- The Center for Innovative Research in Cyberlearning (CIRCL): http://circlcenter.org/smart-and-connectedcommunities-for-learning/. Accessed: 2017-09--17.",
      "doi": ""
    },
    {
      "text": "Taylor, A.S. et al. 2015. Data-in-place: Thinking through the relations between data and community. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015), 2863-- 2872.  ",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Telhan, O. et al. 2014. Connected messages: a maker approach to interactive community murals with youth. Proceedings of the 2014 conference on Interaction design and children (2014), 193--196.  ",
      "doi": "10.1145/2593968.2610450"
    },
    {
      "text": "Yin, R.K. 2014. Case study research: Design and methods. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Yip, J. et al. 2013. Brownies or Bags-of-stuff?: Domain Expertise in Cooperative Inquiry with Children. Proceedings of the 12th International Conference on Interaction Design and Children (New York, NY, USA, 2013), 201--210.  ",
      "doi": "10.1145/2485760.2485763"
    },
    {
      "text": "Yip, J. et al. 2014. \"It helped me do my science.\" A Case of Designing Social Media Technologies for Children in Science Learning. Proceedings of the 13th International Conference of Interaction Design and Children (IDC 2014). (Aarhus, Denmark, 2014).  ",
      "doi": "10.1145/2593968.2593969"
    },
    {
      "text": "Yip, J. et al. 2016. The Evolution of Engagements and Social Bonds During Child-Parent Co-design. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2016), 3607--3619.  ",
      "doi": "10.1145/2858036.2858380"
    }
  ]
}