{
  "doi": "10.1145/3173574.3173801",
  "title": "Design Opportunities for AAC and Children with Severe Speech and Physical Impairments",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Augmentative and alternative communication (AAC) technologies can support children with severe speech and physical impairments (SSPI) to express themselves. Yet, these seemingly 'enabling' technologies are often abandoned by this target group, suggesting a need to understand how they are used in communication. Little research has considered the interaction between people, interaction design and the material dimension of AAC. To address this, we report on a qualitative video study that examines the situated communication of five children using AAC in a special school. Our findings offer a new perspective on reconceptualising AAC design and use revealing four areas for future design: (1) incorporating an embodied view of communication, (2) designing to emphasise children's competence and agency, (3) regulating the presence, prominence and value of AAC, and (4) supporting a wider range of communicative functions that help address children's needs.",
  "authors": [
    {
      "name": "Seray B. Ibrahim",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260391",
      "orcid": "missing"
    },
    {
      "name": "Asimina Vasalou",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485195",
      "orcid": "missing"
    },
    {
      "name": "Michael Clarke",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260999",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Susan Baxter, Pam Enderby, Philippa Evans, and Simon Judge. 2012. Barriers and facilitators to the use of high-technology augmentative and alternative communication devices: a systematic review and qualitative synthesis: AAC barriers and facilitators review. International Journal of Language & Communication Disorders 47, 2: 115--129.",
      "doi": ""
    },
    {
      "text": "Laura Benton and Hilary Johnson. 2015. Widening participation in technology design: A review of the involvement of children with special educational needs and disabilities. International Journal of ChildComputer Interaction 3--4: 23--40.  ",
      "doi": "10.5555/2991320.2991412"
    },
    {
      "text": "Josephus Johannes Bezemer and Gunther R. Kress. 2016. Multimodality, learning and communication: a social semiotic frame. Routledge, Taylor & Francis Group, London; New York.",
      "doi": ""
    },
    {
      "text": "Rolf Black, Annalu Waller, Ross Turner, and Ehud Reiter. 2012. Supporting Personal Narrative for Children with Complex Communication Needs. ACM Transactions on Computer-Human Interaction 19, 2: 1--35.  ",
      "doi": "10.1145/2240156.2240163"
    },
    {
      "text": "Steven Bloch and Ray Wilkinson. 2004. The Understandability of AAC: A Conversation Analysis Study of Acquired Dysarthria. Augmentative and Alternative Communication 20, 4: 272--282.",
      "doi": ""
    },
    {
      "text": "Peter Börjesson, Wolmet Barendregt, Eva Eriksson, and Olof Torgersson. 2015. Designing technology for and with developmentally diverse children: a systematic literature review. In Proceedings of the 14th International Conference on Interaction Design and Children, 79--88.  ",
      "doi": "10.1145/2771839.2771848"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Rhian Davies, Skip Marcella, Joanna McGrenere, and Barbara Purves. 2003. The ethnographically informed participatory design of a PD application to support communication. ACM SIGACCESS Accessibility and Computing, 77--78: 153.  ",
      "doi": "10.1145/1029014.1028658"
    },
    {
      "text": "Sharon J. Derry, Roy D. Pea, Brigid Barron, Randi A. Engle, Frederick Erickson, Ricki Goldman, Rogers Hall, Timothy Koschmann, Jay L. Lemke, Miriam Gamoran Sherin, and Bruce L. Sherin. 2010. Conducting Video Research in the Learning Sciences: Guidance on Selection, Analysis, Technology, and Ethics. Journal of the Learning Sciences 19, 1: 3--53.",
      "doi": ""
    },
    {
      "text": "Frederick Erickson. Definition and Analysis of Data from Videotape: Some Research Procedures and Their Rationales. In Handbook of Complementary Methods in Education Research.",
      "doi": ""
    },
    {
      "text": "Luciana C.L. de Faria Borges, L.V.L. Filgueiras, Cristiano Maciel, and Vinicius C. Pereira. 2012. Customizing a Communication Device for a Child with Cerebral Palsy Using Participatory Design Practices: Contributions Towards the PD4CAT Method. In Proceedings of 11th Brazilian Symposium on Human Factors in Computing Systems, 57--66. http://dl.acm.org/citation.cfm?id=2393536.2393544 ",
      "doi": "10.5555/2393536.2393544"
    },
    {
      "text": "L.-A. Gallacher and M. Gallagher. 2008. Methodological Immaturity in Childhood Research?: Thinking through 'participatory methods'. Childhood 15, 4: 499--516.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 1981. Conversational organization: interaction between speakers and hearers. Academic Press, New York.",
      "doi": ""
    },
    {
      "text": "D. Jeffery Higginbotham. 2009. In-Person Interaction in AAC: New Perspectives on Utterances, Multimodality, Timing, and Device Design. Perspectives on Augmentative and Alternative Communication 18, 4: 154.",
      "doi": ""
    },
    {
      "text": "Anthony J. Hornof. 2009. Designing with children with severe motor impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2177.  ",
      "doi": "10.1145/1518701.1519032"
    },
    {
      "text": "Anthony Hornof, Haley Whitman, Marah Sutherland, Samuel Gerendasy, and Joanna McGrenere. 2017. Designing for the \"Universe of One\": Personalized Interactive Media Systems for People with the Severe Cognitive Impairment Associated with Rett Syndrome. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2137--2148.  ",
      "doi": "10.1145/3025453.3025904"
    },
    {
      "text": "Gail Jefferson. 2004. Glossary of transcript symbols with an introduction. In Conversation Analysis: Studies from the First Generation. John Benjamins., Amsterdam, pp: 13--31.",
      "doi": ""
    },
    {
      "text": "Jeanne M. Johnson, Ella Inglebret, Carla Jones, and Jayanti Ray. 2006. Perspectives of speech language pathologists regarding success versus abandonment of AAC. Augmentative and Alternative Communication 22, 2: 85--99.",
      "doi": ""
    },
    {
      "text": "Barbara B. Kawulich. 2005. Participant Observation as a Data Collection Method. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research 6, 2. Retrieved August 22, 2017 from http://www.qualitativeresearch.net/index.php/fqs/article/view/466",
      "doi": ""
    },
    {
      "text": "Arlene W. Kraat. 1987. Communication Interaction between Aided and Natural Speakers: A State of the Art Report. Second Edition. Trace Center, University of Wisconsin-Madison, Waisman Center, 1500 Highland Ave. Retrieved August 11, 2017 from https://eric.ed.gov/?id=ED297504",
      "doi": ""
    },
    {
      "text": "Gunther R. Kress. 2010. Multimodality: a social semiotic approach to contemporary communication. Routledge, London?; New York.",
      "doi": ""
    },
    {
      "text": "Janice Light. 1989. Toward a definition of communicative competence for individuals using augmentative and alternative communication systems. Augmentative and Alternative Communication 5, 2: 137--144.",
      "doi": ""
    },
    {
      "text": "Janice Light. 1997. \"Let's go star fishing\": reflections on the contexts of language learning for children who use aided AAC. Augmentative and Alternative Communication 13, 3: 158--171.",
      "doi": ""
    },
    {
      "text": "Janice Light. 1997. \"Communication is the essence of human life\": reflections on communicative competence. Augmentative and Alternative Communication 13, 2: 61--70.",
      "doi": ""
    },
    {
      "text": "Janice Light, Barbara Collier, and Penny Parnes. 1985. Communicative interaction between young nonspeaking physically disabled children and their primary caregivers: Part I-discourse patterns. Augmentative and Alternative Communication 1, 2: 74--83.",
      "doi": ""
    },
    {
      "text": "Janice Light and Kathryn Drager. 2004. Re-thinking Access to AAC Technologies for Young Children: Simplifying the Learning Demands. Perspectives on Augmentative and Alternative Communication 13, 1: 5.",
      "doi": ""
    },
    {
      "text": "Janice Light and Kathryn Drager. 2007. AAC technologies for young children with complex communication needs: State of the science and future research directions. Augmentative and Alternative Communication 23, 3: 204--216.",
      "doi": ""
    },
    {
      "text": "Janice Light and David McNaughton. 2013. Putting People First: Re-Thinking the Role of Technology in Augmentative and Alternative Communication Intervention. Augmentative and Alternative Communication 29, 4: 299--309.",
      "doi": ""
    },
    {
      "text": "Janice Light and David McNaughton. 2014. Communicative Competence for Individuals who require Augmentative and Alternative Communication: A New Definition for a New Era of Communication? Augmentative and Alternative Communication 30, 1: 1--18.",
      "doi": ""
    },
    {
      "text": "Ingunn Moser. 2006. Disability and the promises of technology: Technology, subjectivity and embodiment within an order of the normal. Information, Communication & Society 9, 3: 373-- 395.",
      "doi": ""
    },
    {
      "text": "Joan Murphy, Ivana Marková, Sarah Collins, and Eleanor Moodie. 1996. AAC systems*: obstacles to effective use. International Journal of Language & Communication Disorders 31, 1: 31--44.",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 1990. Qualitative evaluation and research methods. Sage Publications, Newbury Park, Calif.",
      "doi": ""
    },
    {
      "text": "Graham Pullin. 2009. Design meets disability. MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Graham Pullin and Shannon Hennig. 2015. 17 Ways to Say Yes: Toward Nuanced Tone of Voice in AAC and Speech Technology. Augmentative and Alternative Communication 31, 2: 170--180.",
      "doi": ""
    },
    {
      "text": "Joseph Reddington and Lizzie Coles-Kemp. 2011. Trap Hunting: Finding Personal Data Management Issues in Next Generation AAC Devices. In Proceedings of the Second Workshop on Speech and Language Processing for Assistive Technologies, 32-- 42. Retrieved September 18, 2017 from http://dl.acm.org/citation.cfm?id=2140499.2140505 ",
      "doi": "10.5555/2140499.2140505"
    },
    {
      "text": "Emanuel A. Schegloff, Gail Jefferson, and Harvey Sacks. 1977. The Preference for Self-Correction in the Organization of Repair in Conversation. Language 53, 2: 361--382.",
      "doi": ""
    },
    {
      "text": "Martine M. Smith. 2015. Language Development of Individuals Who Require Aided Communication: Reflections on State of the Science and Future Research Directions. Augmentative and Alternative Communication 31, 3: 215--233.",
      "doi": ""
    },
    {
      "text": "Kiley Sobel, Alexander Fiannaca, Jon Campbell, Harish Kulkarni, Ann Paradiso, Ed Cutrell, and Meredith Ringel Morris. 2017. Exploring the Design Space of AAC Awareness Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2890--2903.  ",
      "doi": "10.1145/3025453.3025610"
    },
    {
      "text": "Robert A. Stebbins. 2001. Exploratory research in the social sciences. Sage Publications, Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Miriam Sturdee, Paul Coulton, and Jason Alexander. 2017. Using Design Fiction to Inform ShapeChanging Interface Design and Use. The Design Journal 20, sup1: S4146--S4157.",
      "doi": ""
    },
    {
      "text": "G.C. Vanderheiden. A journey through early augmentative communication and computer access. PubMed - NCBI. Retrieved August 14, 2017 from https://www.ncbi.nlm.nih.gov/pubmed/17642032",
      "doi": ""
    },
    {
      "text": "Lev Semenovich Vygotsky. 1981. Mind in society: the development of higher psychological processes. Harvard Univ. Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "InqScribe: Simple Software for Transcription and Subtitling. Retrieved August 25, 2017 from https://www.inqscribe.com",
      "doi": ""
    }
  ]
}