{
  "doi": "10.1145/3173574.3173794",
  "title": "AlterWear: Battery-Free Wearable Displays for Opportunistic Interactions",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "As the landscape of wearable devices continues to expand, power remains a major issue for adoption, usability, and miniaturization. Users are faced with an increasing number of personal devices to manage, charge, and care for. In this work, we argue that power constraints limit the design space of wearable devices. We present AlterWear: an architecture for new wearable devices that implement a batteryless design using electromagnetic induction via NFC and bistable e-ink displays. Although these displays are active only when in proximity to an NFC-enabled device, this unique combination of hardware enables both quick, dynamic and long-term interactions with persistent visual displays. We demonstrate new wearables enabled through AlterWear with dynamic, fashion-forward, and expressive displays across several form factors, and evaluate them in a user study. By forgoing the need for onboard power, AlterWear expands the ecosystem of functional and fashionable wearable technologies.",
  "authors": [
    {
      "name": "Christine Dierk",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99659022124/rel-imgonly/252295_10151135082961437_1588434457_n.jpg",
      "acmid": "99659022124",
      "orcid": "0000-0001-5456-8126"
    },
    {
      "name": "Molly Jane Pearce Nicholas",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99659163367/rel-imgonly/0-scarf-glasses-the-future-cropped.jpeg",
      "acmid": "99659163367",
      "orcid": "0000-0002-2830-3084"
    },
    {
      "name": "Eric Paulos",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "Matthew J. Chabalko, Mohsen Shahmohammadi, and Alanson Sample. 2017. Quasistatic Cavity Resonance for Ubiquitous Wireless Power Transfer. PLOS One 12, 2 (15 February 2017).",
      "doi": ""
    },
    {
      "text": "Artem Dementyev, Jeremy Gummeson, Derek Thrasher, Aaron Parks, Deepak Ganesan, Joshua R. Smith, and Alanson P. Sample. 2013. Wirelessly powered bistable display tags. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, New York, NY, USA, 383--386.  ",
      "doi": "10.1145/2493432.2493516"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I don't Want to Wear a screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 6028--6039.  ",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Christine Dierk, Tom´ as Vega G´ alvez, and Eric Paulos. 2017. AlterNail: Ambient, Batteryless, Stateful, Dynamic Displays at your Fingertips. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3025453.3025924"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Steve Hodges, Nicholas Chen, John Helmes, Stuart Taylor, James Scott, Josh Fromm, and David Sweeney. 2016. Exploring the Design Space for Energy-Harvesting Situated Displays. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16).  ",
      "doi": "10.1145/2984511.2984513"
    },
    {
      "text": "Antal Haans and Wijnand IJsselsteijn. 2006. Mediated social touch: a review of current research and future directions. Virtual Reality 9, 2--3 (2006), 149--159.  ",
      "doi": "10.5555/1124635.1124640"
    },
    {
      "text": "Noura Howell, Laura Devendorf, Rundong (Kevin) Tian, Tom´ as Vega G´ alvez, Nan-Wei Gong, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. Biosignals as Social Cues: Ambiguity and Emotional Interpretation in Social Displays of Skin Conductance. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 865--870.  ",
      "doi": "10.1145/2901790.2901850"
    },
    {
      "text": "Oskar Juhlin. 2015. Digitizing fashion: software for wearable devices. Interactions 22, 3 (2015), 44--47.  ",
      "doi": "10.1145/2754868"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Artem Dementyev, Joseph A. Paradiso, and Chris Schmandt. 2015. NailO: Fingernails as an Input Surface. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3015--3018.  ",
      "doi": "10.1145/2702123.2702572"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. DuoSkin: Rapidly Prototyping On-skin User Interfaces Using Skin-friendly Materials. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (2016) (ISWC '16). ACM, 16--23.  ",
      "doi": "10.1145/2971763.2971777"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Manisha Mohan, Chris Schmandt, Joseph A. Paradiso, and Katia Vega. 2016. ChromoSkin: Towards Interactive Cosmetics Using Thermochromic Pigments. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3703--3706.  ",
      "doi": "10.1145/2851581.2890270"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Bichlien Nguyen, Asta Roseway, and Michael Dickey. 2017. EarthTones: Chemical Sensing Powders to Detect and Display Environmental Hazards through Color Variation. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17).  ",
      "doi": "10.1145/3027063.3052754"
    },
    {
      "text": "John Kymissis, Clyde Kendall, Joseph Paradiso, and Neil Gershenfeld. 1998. Parasitic Power Harvesting in Shoes. In Proceedings of the 2nd IEEE International Symposium on Wearable Computers (ISWC '98). IEEE Computer Society, Washington, DC, USA, 132. http://dl.acm.org/citation.cfm?id=858024 ",
      "doi": "10.5555/857199.858024"
    },
    {
      "text": "Joanne Lo, Doris Jung Lin Lee, Nathan Wong, David Bui, and Eric Paulos. 2016. Skintillates: Designing and Creating Epidermal Interactions. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 853--864.  ",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Lauren K. Ohnesorge. 2014. The latest weapon in the fight against date rape drugs? Nail polish. (August 2014). http://www.bizjournals.com/triangle/bizwomen/news/ out-of-the-office/2014/08/ the-latest-weapon-in-the-fight-against-daterape.html {Online; posted 26-August-2014}.",
      "doi": ""
    },
    {
      "text": "Simon Olberding, Michael Wessely, and J¨ urgen Steimle. 2014. PrintScreen: Fabricating Highly Customizable Thin-film Touch-displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 281--290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Aaron N. Parks, Alanson P. Sample, Yi Zhao, and Joshua R. Smith. 2013. A Wireless Sensing Platform Utilizing Ambient RF Energy. In Proceedings of the 2nd annual IEEE International Radio and Wireless Symposium (RWS '13). IEEE Computer Society, Washington, DC, USA, 331--333.",
      "doi": ""
    },
    {
      "text": "Eric Paulos. 2012. Energy Parasites. (2012). http://www.energyparasites.net/",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2010. Materializing Energy. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 113--122.  ",
      "doi": "10.1145/1858171.1858193"
    },
    {
      "text": "E. Rehmi Post and Margaret Orth. 1997. Smart Fabric, or \"Wearable Clothing\". In Proceedings of the 1st IEEE International Symposium on Wearable Computers (ISWC '97). IEEE Computer Society, Washington, DC, USA, 167--. http://dl.acm.org/citation.cfm?id=851036.856432 ",
      "doi": "10.5555/851036.856432"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4216--4227.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Cary Stothart, Ainsley Mitchum, and Courtney Yehnert. 2015. The attentional cost of receiving a cell phone notification. ournal of Experimental Psychology: Human Perception and Performance 41, 4 (2015), 893--897.",
      "doi": ""
    },
    {
      "text": "Chao-Huai Su, Liwei Chan, Chien-Ting Weng, Rong-Hao Liang, Kai-Yin Cheng, and Bing-Yu Chen. 2013. NailDisplay: bringing an always available visual display to fingertips. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1461--1464.  ",
      "doi": "10.1145/2470654.2466193"
    },
    {
      "text": "D. Sweeney, N. Chen, S. Hodges, and T. Grosse-Puppendahl. 2016. Displays as a Material: A Route to Making Displays More Pervasive. IEEE Pervasive Computing 15, 3 (July 2016), 77--82.",
      "doi": "10.1109/MPRV.2016.56"
    },
    {
      "text": "Vamsi Talla, Bryce Kellogg, Shyamnath Gollakota, and Joshua R. Smith. 2017. Battery-Free Cellphone. In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT '17), Vol. 1. ACM, New York, NY, USA. Issue 2.  ",
      "doi": "10.1145/3090090"
    },
    {
      "text": "Katia Vega, Abel Arrieta, Felipe Esteves, and Hugo Fuks. 2014. FX e-Makeup for Muscle Based Interaction. In Design, User Experience, and Usability. User Experience Design for Everyday Life Applications and Services (DUXU '14). Springer, Berlin, Heidelberg, 643--652.",
      "doi": ""
    },
    {
      "text": "Katia Vega and Hugo Fuks. 2014. Beauty tech nails: interactive technology at your fingertips. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 61--64.  ",
      "doi": "10.1145/2540930.2540961"
    },
    {
      "text": "Katia Fabiola Canepa Vega, Patricia J. Flanagan, and Hugo Fuks. 2013. Blinklifier: A Case Study for Prototyping Wearable Computers in Technology and Visual Arts. In Design, User Experience, and Usability. User Experience in Novel Technological Environments (DUXU '13). Springer, Berlin, Heidelberg, 439--445.",
      "doi": ""
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jrgen Steimle. SkinMarks: Enabling Interactions on Body Landmarks Using Conformal Skin Electronics. ACM Press, 3095--3105.  ",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21st Century. Scientific American 265, 3 (September 1991), 94--104. http://www.scientificamerican.com/article/ the-computer-for-the-21st-century/",
      "doi": ""
    },
    {
      "text": "Robert S Weiss. 1995. Learning from strangers: The art and method of qualitative interview studies. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Yi Zhao, Joshua R. Smith, and Alanson Sample. 2015. NFC-WISP: an open source software defined near field RFID sensing platform. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 369--372.  ",
      "doi": "10.1145/2800835.2800912"
    }
  ]
}