{
  "doi": "10.1145/3173574.3174007",
  "title": "Quadcopter-Projected In-Situ Navigation Cues for Improved Location Awareness",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-6",
  "year": 2018,
  "badges": [],
  "abstract": "Every day people rely on navigation systems when exploring unknown urban areas. Many navigation systems use multimodal feedback like visual, auditory or tactile cues. Although other systems exist, users mostly rely on a visual navigation using their smartphone. However, a problem with visual navigation systems is that the users have to shift their attention to the navigation system and then map the instructions to the real world. We suggest using in-situ navigation instructions that are presented directly in the environment by augmenting the reality using a projector-quadcopter. Through a user study with 16 participants, we show that using in-situ instructions for navigation leads to a significantly higher ability to observe real-world points of interest. Further, the participants enjoyed following the projected navigation cues.",
  "tags": [
    "quadcopter",
    "human-drone interaction",
    "in-situ projection",
    "navigation",
    "augmented reality"
  ],
  "authors": [
    {
      "name": "Pascal Knierim",
      "institution": "LMU Munich, Munich, Bavaria, Germany",
      "img": "/do/10.1145/contrib-81551225556/rel-imgonly/avatar.jpg",
      "acmid": "81551225556",
      "orcid": "0000-0001-9578-9953"
    },
    {
      "name": "Steffen Maurer",
      "institution": "Ulm University, Ulm, Baden-Wurttemberg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210958",
      "orcid": "missing"
    },
    {
      "name": "Katrin Wolf",
      "institution": "Hamburg University of Applied Science, Hamburg, Germany",
      "img": "/do/10.1145/contrib-81467663120/rel-imgonly/wolf_katrin_aug_2011_.jpg",
      "acmid": "81467663120",
      "orcid": "missing"
    },
    {
      "name": "Markus Funk",
      "institution": "TU Darmstadt, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458955757",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mauro Avila, Markus Funk, and Niels Henze. 2015. DroneNavigator: Using Drones for Navigating Visually Impaired Persons. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 327--328.  ",
      "doi": "10.1145/2700648.2811362"
    },
    {
      "text": "Jörg Baus, Rainer Wasinger, Ilhan Aslan, Antonio Krüger, Andreas Maier, and Tim Schwartz. 2007. Auditory perceptible landmarks in mobile navigation. In Proceedings of the 12th international conference on Intelligent user interfaces. ACM, 302--304.  ",
      "doi": "10.1145/1216295.1216352"
    },
    {
      "text": "Ashley Colley, Lasse Virtanen, Pascal Knierim, and Jonna Häkkilä. 2017. Investigating Drone Motion As Pedestrian Guidance. In Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia (MUM '17). ACM, New York, NY, USA, 143--150.  ",
      "doi": "10.1145/3152832.3152837"
    },
    {
      "text": "Alexandru Dancu, Zlatko Franjcic, and Morten Fjeld. 2014. Smart flashlight: map navigation using a bike-mounted projector. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 3627--3630.  ",
      "doi": "10.1145/2556288.2557289"
    },
    {
      "text": "Sandra G Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. Sage Publications, 904--908.",
      "doi": ""
    },
    {
      "text": "Wilko Heuten, Niels Henze, Susanne Boll, and Martin Pielot. 2008. Tactile wayfinder: a non-visual support system for wayfinding. In Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges. ACM, 172--181.  ",
      "doi": "10.1145/1463160.1463179"
    },
    {
      "text": "Harlan Hile, Ramakrishna Vedantham, Gregory Cuellar, Alan Liu, Natasha Gelfand, Radek Grzeszczuk, and Gaetano Borriello. 2008. Landmark-based pedestrian navigation from collections of geotagged photos. In Proceedings of the 7th international conference on mobile and ubiquitous multimedia. ACM, 145--152.  ",
      "doi": "10.1145/1543137.1543167"
    },
    {
      "text": "Bomyeong Kim, Hyun Young Kim, and Jinwoo Kim. 2016. Getting home safely with drone. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct. ACM, 117--120.  ",
      "doi": "10.1145/2968219.2971426"
    },
    {
      "text": "Tapio Lokki and Matti Grohn. 2005. Navigation with auditory cues in a virtual environment. IEEE MultiMedia 12, 2 (2005), 80--86.  ",
      "doi": "10.1109/MMUL.2005.33"
    },
    {
      "text": "Mikhail Matrosov, Olga Volkova, and Dzmitry Tsetserukou. 2016. LightAir: A Novel System for Tangible Communication with Quadcopters Using Foot Gestures and Projected Image. In ACM SIGGRAPH 2016 Emerging Technologies (SIGGRAPH '16). ACM, New York, NY, USA, Article 16, 2 pages.  ",
      "doi": "10.1145/2929464.2932429"
    },
    {
      "text": "Andrew J May, Tracy Ross, Steven H Bayer, and Mikko J Tarkiainen. 2003. Pedestrian navigation aids: information requirements and design implications. Personal and Ubiquitous Computing 7, 6 (2003), 331--338.  ",
      "doi": "10.1007/s00779-003-0248-5"
    },
    {
      "text": "Florian'Floyd' Mueller and Matthew Muirhead. 2015. Jogging with a Quadcopter. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2023--2032.  ",
      "doi": "10.1145/2702123.2702472"
    },
    {
      "text": "Wolfgang Narzt, Gustav Pomberger, Alois Ferscha, Dieter Kolb, Reiner M¨ uller, Jan Wieghardt, Horst H¨ ortner, and Christopher Lindinger. 2006. Augmented reality navigation systems. Universal Access in the Information Society 4, 3 (01 Mar 2006), 177--187.  ",
      "doi": "10.1007/s10209-005-0017-5"
    },
    {
      "text": "Jack L Nasar and Derek Troyer. 2013. Pedestrian injuries due to mobile phone use in public places. Accident Analysis & Prevention 57 (2013), 91--95.",
      "doi": ""
    },
    {
      "text": "Hiroki Nozaki. 2014. Flying Display: A Movable Display Pairing Projector and Screen in the Air. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 909--914.  ",
      "doi": "10.1145/2559206.2579410"
    },
    {
      "text": "Mohammad Obaid, Omar Mubin, Christina Anne Basedow, A Ayc ¸a ¨ Unl¨ uer, Matz Johansson Bergstr¨ om, and Morten Fjeld. 2015. A drone agent to support a clean environment. In Proceedings of the 3rd International Conference on Human-Agent Interaction. ACM, 55--61.  ",
      "doi": "10.1145/2814940.2814947"
    },
    {
      "text": "Max Pfeiffer, Tim D¨ unte, Stefan Schneegass, Florian Alt, and Michael Rohs. 2015. Cruise Control for Pedestrians: Controlling Walking Direction using Electrical Muscle Stimulation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2505--2514.  ",
      "doi": "10.1145/2702123.2702190"
    },
    {
      "text": "Claudio Pinhanez. 2001. The everywhere displays projector: A device to create ubiquitous graphical interfaces. In Ubicomp 2001: Ubiquitous Computing. Springer, 315--331. ",
      "doi": "10.5555/647987.741324"
    },
    {
      "text": "Karl Rehrl, Elisabeth Husler, Sven Leitinger, and Daniel Bell. 2014. Pedestrian navigation with augmented reality, voice and digital map: final results from an in situ field study assessing performance and user experience. Journal of Location Based Services 8, 2 (2014), 75--96.  ",
      "doi": "10.1080/17489725.2014.946975"
    },
    {
      "text": "Jürgen Scheible and Markus Funk. 2016. In-situ-displaydrone: facilitating co-located interactive experiences via a flying screen. In Proceedings of the 5th ACM International Symposium on Pervasive Displays. ACM, 251--252.  ",
      "doi": "10.1145/2914920.2940334"
    },
    {
      "text": "Stefan Schneegass, Florian Alt, J¨ urgen Scheible, Albrecht Schmidt, and Haifeng Su. 2014. Midair displays: Exploring the concept of free-floating public displays. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 2035--2040.  ",
      "doi": "10.1145/2559206.2581190"
    },
    {
      "text": "Shoko Wakamiya, Hiroshi Kawasaki, Yukiko Kawai, Adam Jatowt, Eiji Aramaki, and Toyokazu Akiyama. 2016. Lets Not Stare at Smartphones while Walking: Memorable Route Recommendation by Detecting Effective Landmarks. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM.  ",
      "doi": "10.1145/2971648.2971758"
    },
    {
      "text": "Andrew Wilson, Hrvoje Benko, Shahram Izadi, and Otmar Hilliges. 2012. Steerable Augmented Reality with the Beamatron. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 413--422.  ",
      "doi": "10.1145/2380116.2380169"
    },
    {
      "text": "Christian Winkler, Julian Seifert, David Dobbelstein, and Enrico Rukzio. 2014. Pervasive information through constant personal projection: the ambient mobile pervasive display (AMP-D). In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 4117--4126.  ",
      "doi": "10.1145/2556288.2557365"
    }
  ]
}