{
  "doi": "10.1145/3173574.3173637",
  "title": "Grafter: Remixing 3D-Printed Machines",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Creating new 3D printed objects by recombining models found in hobbyist repositories has been referred to as \"re-mixing\". In this paper, we explore how to best support users in remixing a specific class of 3D printed objects, namely those that perform mechanical functions. In our survey, we found that makers remix such machines by manually extracting parts from one parent model and combine it with parts from a different parent model. This approach often puts axles made by one maker into bearings made by another maker or combines a gear by one maker with a gear by a different maker. This approach is problem-atic, however, as parts from different makers tend to fit poorly, which results in long series of tweaks and test-prints until all parts finally work together. We address this with our interactive system grafter. Grafter does two things. First, grafter largely automates the process of extracting and recombining mechanical elements from 3D printed machines. Second, it enforces a more efficient approach to reuse: it prevents users from extracting indi-vidual parts, but instead affords extracting groups of me-chanical elements that already work together, such as axles and their bearings or pairs of gears. We call this mecha-nism-based remixing. In a final user study, all models that participants had remixed using grafter could be 3D printed without further tweaking and worked immediately.",
  "tags": [
    "fabrication",
    "3d printing",
    "remixing"
  ],
  "authors": [
    {
      "name": "Thijs Jan Roumen",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658700053/rel-imgonly/44627890994_233b53923c_o.jpg",
      "acmid": "99658700053",
      "orcid": "missing"
    },
    {
      "name": "Willi Müller",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706509",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Celena Alcock, Nathaniel Hudson, and Parmit K. Chilana. 2016. Barriers to Using, Customizing, and Printing 3D Designs on Thingiverse. In Proceedings of the 19th International Conference on Supporting Group Work (GROUP '16). ACM, New York, NY, USA, 195199.  ",
      "doi": "10.1145/2957276.2957301"
    },
    {
      "text": "Chris Anderson 2012. Makers: The New Industrial Revolution. Crown Business, New York, 2012.",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2017, \"Personal Fabrication\", Foundations and Trends in Human-Computer Interaction: Vol. 10: No. 3--4, pp 165--293.",
      "doi": ""
    },
    {
      "text": "Giorgos Cheliotis and Jude Yew. 2009. An analysis of the social structure of remix culture. In Proceedings of the fourth international conference on Communities and technologies (C&T '09). ACM, New York, NY, USA, 165--174.  ",
      "doi": "10.1145/1556460.1556485"
    },
    {
      "text": "Martin A. Fischler and Robert C. Bolles. 1981. Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Commun. ACM 24, 6 (June 1981), 381--395.  ",
      "doi": "10.1145/358669.358692"
    },
    {
      "text": "Christoph M. Flath, Sascha Friesike, Marco Wirth, & Frederic Thiesse, Copy, transform, combine: exploring the remix as a form of innovation. Journal of Information Technology, 1--20.",
      "doi": ""
    },
    {
      "text": "Thomas Funkhouser, Michael Kazhdan, Philip Shilane, Patrick Min, William Kiefer, Ayellet Tal, Szymon Rusinkiewicz, and David Dobkin. 2004. Modeling by example. ACM Trans. Graph. 23, 3 (August 2004), 652663.  ",
      "doi": "10.1145/1015706.1015775"
    },
    {
      "text": "David Garlan, Robert Allen & John Ockerbloom 1995 Architectural Mismatch: Why Reuse Is So Hard. IEEE Software 12(6), 17--26  ",
      "doi": "10.1109/52.469757"
    },
    {
      "text": "Björn Hartmann, Scott Doorley, and Scott R. Klemmer. Hacking, mashing, gluing: Understanding opportunistic design. IEEE Pervasive Computing 7.3 (2008).  ",
      "doi": "10.1109/MPRV.2008.54"
    },
    {
      "text": "Scarlett R. Herring, Chia-Chen Chang, Jesse Krantzler, and Brian P. Bailey. 2009. Getting inspired!: understanding how and why examples are used in creative design practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 87--96.  ",
      "doi": "10.1145/1518701.1518717"
    },
    {
      "text": "Benjamin Mako Hill and Andrés Monroy-Hernández. 2013. The cost of collaboration for code and art: evidence from a remixing community. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 10351046.  ",
      "doi": "10.1145/2441776.2441893"
    },
    {
      "text": "Malcolm Douglas McIlroy, 1969. Mass Produced Software Components. In Software Engineering, ed. P. Naur and B. Randell, NATO Science Committee, Jan 1969, pp. 138--150.",
      "doi": ""
    },
    {
      "text": "Yuki Koyama, Shinjiro Sueda, Emma Steinhardt, Takeo Igarashi, Ariel Shamir, and Wojciech Matusik. 2015. AutoConnect: computational design of 3D-printable connectors. ACM Trans. Graph.34, 6, Article 231 (October 2015), 11 pages.  ",
      "doi": "10.1145/2816795.2818060"
    },
    {
      "text": "Ranjitha Kumar, Jerry O. Talton, Salman Ahmad, and Scott R. Klemmer. 2011. Bricolage: example-based retargeting for web design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2197--2206.  ",
      "doi": "10.1145/1978942.1979262"
    },
    {
      "text": "Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R. Klemmer. 2010. Designing with interactive example galleries. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 22572266.  ",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Lin, M., Shao, T., Zheng, Y., Mitra, N., & Zhou, K. (2017). Recovering Functional Mechanical Assemblies from Raw Scans. IEEE Transactions on Visualization and Computer Graphics.",
      "doi": ""
    },
    {
      "text": "Linjie Luo, Ilya Baran, Szymon Rusinkiewicz, and Wojciech Matusik. 2012. Chopper: partitioning models into 3D-printable parts. ACM Trans. Graph. 31, 6, Article 129 (November 2012), 9 pages.  ",
      "doi": "10.1145/2366145.2366148"
    },
    {
      "text": "MakerBot Customizer. Retrieved February 16, 2017 from http://customizer.makerbot.com",
      "doi": ""
    },
    {
      "text": "McNeel, R. (2017). Rhinoceros. NURBS modeling for Mac: http://www.rhino3d.com/mac",
      "doi": ""
    },
    {
      "text": "Niloy J. Mitra, Mark Pauly, Michael Wand, & Duygu Ceylan (2013, September). Symmetry in 3d geometry: Extraction and applications. In Computer Graphics Forum (Vol. 32, No. 6, pp. 1--23).  ",
      "doi": "10.1111/cgf.12010"
    },
    {
      "text": "Niloy J. Mitra, Yong-Liang Yang, Dong-Ming Yan, Wilmot Li, and Maneesh Agrawala. 2013. Illustrating how mechanical assemblies work. Commun. ACM 56, 1 (January 2013), 106--114.  ",
      "doi": "10.1145/2398356.2398379"
    },
    {
      "text": "Norton, R. L. (1999). Design of machinery: an introduction to the synthesis and analysis of mechanisms and machines. McGraw-Hill Inc., US.",
      "doi": ""
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 639--648.  ",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "Pan, W., Gao, S., & Chen, X. (2016). An approach to automatic adaptation of assembly models. Computers in Industry, 75, 67--79 .  ",
      "doi": "10.1016/j.compind.2015.06.005"
    },
    {
      "text": "Spiros Papadimitriou and Evangelos E. Papalexakis. 2014. Towards laws of the 3d-printable design web. In Proceedings of the 2014 ACM conference on Web science (WebSci '14). ACM, New York, NY, USA, 255256.  ",
      "doi": "10.1145/2615569.2615660"
    },
    {
      "text": "Spiros Papadimitriou, Evangelos Papalexakis, Bin Liu, and Hui Xiong. 2015. Remix in 3D Printing: What your Sources say About You. In Proceedings of the 24th International Conference on World Wide Web (WWW '15 Companion). ACM, New York, NY, USA, 367--368.  ",
      "doi": "10.1145/2740908.2745943"
    },
    {
      "text": "Thingiverse Remix Challenge November-December 2016 http://thingiverse.com/challenges/RemixChallenge",
      "doi": ""
    },
    {
      "text": "Pratt, M. J. (2001). Introduction to ISO 10303-the STEP standard for product data exchange. Journal of Computing & Information Science in Engineering, 1(1), 102--103.  ",
      "doi": "10.1115/1.1354995"
    },
    {
      "text": "Adriana Schulz, Ariel Shamir, David I. W. Levin, Pitchaya Sitthi-amorn, and Wojciech Matusik. 2014. Design and fabrication by example. ACM Trans. Graph. 33, 4, Article 62 (July 2014), 11 pages.  ",
      "doi": "10.1145/2601097.2601127"
    },
    {
      "text": "Maria Shugrina, Ariel Shamir, and Wojciech Matusik. 2015. Fab forms: customizable objects for fabrication with validity and geometry caching. ACM Trans. Graph. 34, 4, Article 100 (July 2015), 12 pages.  ",
      "doi": "10.1145/2766994"
    },
    {
      "text": "Cesar Torres and Eric Paulos. 2015. MetaMorphe: Designing Expressive 3D Models for Digital Fabrication. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, New York, NY, USA, 73--82.  ",
      "doi": "10.1145/2757226.2757235"
    },
    {
      "text": "Yaz, I. O., & Loriot, S. (2014). Triangulated surface mesh segmentation. CGAL User and Reference Manual, 4(1).",
      "doi": ""
    },
    {
      "text": "Ran Zhang, Thomas Auzinger, Duygu Ceylan, Wilmot Li, and Bernd Bickel. 2017. Functionality-aware retargeting of mechanisms to 3D shapes. ACM Trans. Graph. 36, 4, Article 81 (July 2017), 13 pages.  ",
      "doi": "10.1145/3072959.3073710"
    },
    {
      "text": "3D contentcentral. Retrieved February 17, 2017 from http://3dcontentcentral.com",
      "doi": ""
    }
  ]
}