{
  "doi": "10.1145/3173574.3174122",
  "title": "To Put That in Perspective: Generating Analogies that Make Numbers Easier to Understand",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Laypeople are frequently exposed to unfamiliar numbers published by journalists, social media users, and algorithms. These figures can be difficult for readers to comprehend, especially when they are extreme in magnitude or contain unfamiliar units. Prior work has shown that adding \"perspective sentences\" that employ ratios, ranks, and unit changes to such measurements can improve people's ability to understand unfamiliar numbers (e.g., \"695,000 square kilometers is about the size of Texas\"). However, there are many ways to provide context for a measurement. In this paper we systematically test what factors influence the quality of perspective sentences through randomized experiments involving over 1,000 participants. We develop a statistical model for generating perspectives and test it against several alternatives, finding beneficial effects of perspectives on comprehension that persist for six weeks. We conclude by discussing future work in deploying and testing perspectives at scale.",
  "authors": [
    {
      "name": "Christopher Riederer",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490689881",
      "orcid": "missing"
    },
    {
      "name": "Jake M. Hofman",
      "institution": "Microsoft Research, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436601976",
      "orcid": "missing"
    },
    {
      "name": "Daniel G. Goldstein",
      "institution": "Microsoft Research, New York, NY, USA",
      "img": "/do/10.1145/contrib-81485649647/rel-imgonly/dangoldstein_badge1.jpg",
      "acmid": "81485649647",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Pablo J Barrio, Daniel G Goldstein, and Jake M Hofman. 2016. Improving Comprehension of Numbers in the News. In Association for Computing Machinery Conference on Human Factors in Computing Systems, San Jose, CA (May 7--12).  ",
      "doi": "10.1145/2858036.2858510"
    },
    {
      "text": "S Bautista, R Hervás, P Gervás, Richard R Power, and Sandra Williams. 2011. How to Make Numerical Information Accessible: Experimental Identification of Simplification Strategies. In INTERACT 2011. Vol. 6946. Springer Berlin Heidelberg, 57--64. ",
      "doi": "10.5555/2042053.2042062"
    },
    {
      "text": "Elizabeth M Brannon. 2006. The representation of numerical magnitude. Current opinion in neurobiology 16, 2 (2006), 222--229.",
      "doi": ""
    },
    {
      "text": "Norman R Brown and Robert S Siegler. 1993. Metrics and mappings: A framework for understanding real-world quantitative estimation. Psychological review 100, 3 (1993), 511.",
      "doi": ""
    },
    {
      "text": "Arun Tejasvi Chaganty and Percy Liang. 2016. How Much is 131 Million Dollars? Putting Numbers in Perspective with Compositional Descriptions. Technical Report.",
      "doi": ""
    },
    {
      "text": "Fanny Chevalier, Romain Vuillemot, and Guia Gali. 2013. Using concrete scales: A practical framework for effective visual depiction of complex measures. IEEE transactions on visualization and computer graphics 19, 12 (2013), 2426--2435.  ",
      "doi": "10.1109/TVCG.2013.210"
    },
    {
      "text": "Sunaina Dowray, Jonas J. Swartz, Danielle Braxton, and Anthony J. Viera. 2013. Potential effect of physical activity based menu labels on the calorie content of selected fast food meals. Appetite 62, 0 (2013), 173--181.",
      "doi": ""
    },
    {
      "text": "Lisa Feigenson, Stanislas Dehaene, and Elizabeth Spelke. 2004. Core systems of number. Trends in cognitive sciences 8, 7 (2004), 307--314.",
      "doi": ""
    },
    {
      "text": "Gerd Gigerenzer. 2014. Risk savvy: how to make good decisions. Viking Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Yea-Seul Kim, Francis Nguyen, Lauren Speers, and Maneesh Agrawala. 2018. Improving Comprehension of Measurements with Concrete Re-expression Strategies. In Association for Computing Machinery Conference on Human Factors in Computing Systems, Montreal, Canada (April 21--26).  ",
      "doi": "10.1145/3173574.3173608"
    },
    {
      "text": "Yea-Seul Kim, Jessica Hullman, and Maneesh Agrawala. 2016. Generating Personalized Spatial Analogies for Distances and Areas. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 38--48.  ",
      "doi": "10.1145/2858036.2858440"
    },
    {
      "text": "Richard P Larrick and Jack B Soll. 2008. The MPG Illusion. Science 320, 5883 (2008), 1593--1594.",
      "doi": ""
    },
    {
      "text": "W Mason and S Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior research methods (Jan 2012). http://link.springer.com/article/10.3758/s13428-011-0124-6",
      "doi": ""
    },
    {
      "text": "Dennis L McNeill and William L Wilkie. 1979. Public policy and consumer information: Impact of the new energy labels. Journal of Consumer Research (1979), 1--11.",
      "doi": ""
    },
    {
      "text": "L Neuhauser, K Paul, B Fischhoff, NT Brewer, and J Downs. 2011. Communicating Risks and Benefits: An Evidence-Based User's Guide. (2011).",
      "doi": ""
    },
    {
      "text": "John Allen Paulos. 1988. Innumeracy: Mathematical illiteracy and its consequences.",
      "doi": ""
    },
    {
      "text": "Bruce M Ross and Trygg Engen. 1959. Effects of round number preferences in a guessing task. Journal of experimental psychology 58, 6 (1959), 462.",
      "doi": ""
    }
  ]
}