{
  "doi": "10.1145/3173574.3173785",
  "title": "Upstanding by Design: Bystander Intervention in Cyberbullying",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Although bystander intervention can mitigate the negative effects of cyberbullying, few bystanders ever attempt to intervene. In this study, we explored the effects of interface design on bystander intervention using a simulated custom-made social media platform. Participants took part in a three-day, in-situ experiment, in which they were exposed to several cyberbullying incidents. Depending on the experimental condition, they received different information about the audience size and viewing notifications intended to increase a sense of personal responsibility in bystanders. Results indicated that bystanders were more likely to intervene indirectly than directly, and information about the audience size and viewership increased the likelihood of flagging cyberbullying posts through serial mediation of public surveillance, accountability, and personal responsibility. The study has implications for understanding bystander effect in cyberbullying, and how to develop design solutions to encourage bystander intervention in social media.",
  "authors": [
    {
      "name": "Dominic DiFranzo",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655026",
      "orcid": "0000-0001-6039-1806"
    },
    {
      "name": "Samuel Hardman Taylor",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162698",
      "orcid": "missing"
    },
    {
      "name": "Franccesca Kazerooni",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260387",
      "orcid": "missing"
    },
    {
      "name": "Olivia D. Wherry",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261054",
      "orcid": "missing"
    },
    {
      "name": "Natalya N. Bazarova",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100246383",
      "orcid": "0000-0001-5375-6598"
    }
  ],
  "references": [
    {
      "text": "Zahra Ashktorab and Jessica Vitak. 2016. Designing cyberbullying mitigation and prevention solutions through participatory design with teenagers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, 3895--3905.  ",
      "doi": "10.1145/2858036.2858548"
    },
    {
      "text": "Sara Bastiaensens, Heidi Vandebosch, Karolien Poels, Katrien Van Cleemput, Ann Desmet, and Ilse De Bourdeaudhuij. 2014. Cyberbullying on social network sites. An experimental study into bystanders behavioral intentions to help the victim or reinforce the bully. Computers in Human Behavior 31 (2014), 259--271.  ",
      "doi": "10.1016/j.chb.2013.10.036"
    },
    {
      "text": "Michael S Bernstein, Eytan Bakshy, Moira Burke, and Brian Karrer. 2013. Quantifying the invisible audience in social networks. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 21--30.  ",
      "doi": "10.1145/2470654.2470658"
    },
    {
      "text": "Nicholas Brody and Anita L Vangelisti. 2016. Bystander intervention in cyberbullying. Communication Monographs 83, 1 (2016), 94--119.",
      "doi": ""
    },
    {
      "text": "Robin Cohen, Disney Yan Lam, Nikhil Agarwal, Michael Cormier, Jasmeet Jagdev, Tianqi Jin, Madhur Kukreti, Jiawei Liu, Kamal Rahim, Rahul Rawat, and others. 2014. Using computer technology to address the problem of cyberbullying. ACM SIGCAS Computers and Society 44, 2 (2014), 52--61.  ",
      "doi": "10.1145/2656870.2656876"
    },
    {
      "text": "John M Darley and Bibb Latané. 1968. Bystander intervention in emergencies: diffusion of responsibility. Journal of personality and social psychology 8, 4p1 (1968), 377.",
      "doi": ""
    },
    {
      "text": "Simon Denny, Elizabeth R Peterson, Jaimee Stuart, Jennifer Utter, Pat Bullen, Theresa Fleming, Shanthi Ameratunga, Terryann Clark, and Taciano Milfont. 2015. Bystander intervention, bullying, and victimization: A multilevel analysis of New Zealand high schools. Journal of school violence 14, 3 (2015), 245--272.",
      "doi": ""
    },
    {
      "text": "Kelly P Dillon and Brad J Bushman. 2015. Unresponsive or un-noticed?: Cyberbystander intervention in an experimental cyberbullying context. Computers in Human Behavior 45 (2015), 144--150.  ",
      "doi": "10.1016/j.chb.2014.12.009"
    },
    {
      "text": "Karthik Dinakar, Birago Jones, Catherine Havasi, Henry Lieberman, and Rosalind Picard. 2012. Common sense reasoning for detection, prevention, and mitigation of cyberbullying. ACM Transactions on Interactive Intelligent Systems (TiiS) 2, 3 (2012), 18.  ",
      "doi": "10.1145/2362394.2362400"
    },
    {
      "text": "Maeve Duggan. 2014. Online Harassment Part 2: The Online Environment. Pew Research Center. (2014). Retrieved from http://www.pewinternet.org/2014/10/22/ part-2-the-online-environment/.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017a. Experiencing online harassment. Pew Research Center. (2017). Retrieved from http://www.pewinternet.org/2017/07/11/ experiencing-online-harassment/.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017b. Witnessing online harassment. Pew Research Center. (2017). Retrieved from http://www.pewinternet.org/2017/07/11/ witnessing-online-harassment/.",
      "doi": ""
    },
    {
      "text": "Pablo Garaizar and Ulf-Dietrich Reips. 2014. Build your own social network laboratory with Social Lab: A tool for research in social media. Behavior research methods 46, 2 (2014), 430--438.",
      "doi": ""
    },
    {
      "text": "Stephen M Garcia, Kim Weaver, Gordon B Moskowitz, and John M Darley. 2002. Crowded minds: the implicit bystander effect. Journal of personality and social psychology 83, 4 (2002), 843.",
      "doi": ""
    },
    {
      "text": "Kevin J Haley and Daniel MT Fessler. 2005. Nobody's watching?: Subtle cues affect generosity in an anonymous economic game. Evolution and Human behavior 26, 3 (2005), 245--256.",
      "doi": ""
    },
    {
      "text": "D Lynn Hawkins, Debra J Pepler, and Wendy M Craig. 2001. Naturalistic observations of peer interventions in bullying. Social development 10, 4 (2001), 512--527.",
      "doi": ""
    },
    {
      "text": "Andrew F Hayes. 2013. Introduction to mediation, moderation, and conditional process analysis: A regression-based approach. Guilford Press.",
      "doi": ""
    },
    {
      "text": "William C Hill and James D Hollan. 1994. History-enriched digital objects: Prototypes and policy issues. The Information Society 10, 2 (1994), 139--145.",
      "doi": ""
    },
    {
      "text": "Patricia Kearney, Timothy G Plax, Val R Smith, and Gail Sorensen. 1988. Effects of teacher immediacy and strategy type on college student resistance to on-task demands. Communication Education 37, 1 (1988), 54--67.",
      "doi": ""
    },
    {
      "text": "Ellen M Kraft and Jinchang Wang. 2009. Effectiveness of cyber bullying prevention strategies: A study on students' perspectives. International Journal of Cyber Criminology 3, 2 (2009), 513.",
      "doi": ""
    },
    {
      "text": "Robert E Kraut and Paul Resnick. 2011. Encouraging contribution to online communities. Building successful online communities: Evidence-based social design (2011), 21--76.",
      "doi": ""
    },
    {
      "text": "Bibb Latané and John M Darley. 1970. The unresponsive bystander: Why doesn't he help? Appleton-Century-Crofts.",
      "doi": ""
    },
    {
      "text": "Ziyi Li, Junpei Kawamoto, Yaokai Feng, and Kouichi Sakurai. 2016. Cyberbullying detection using parent-child relationship between comments. In Proceedings of the 18th International Conference on Information Integration and Web-based Applications and Services. ACM, 325--334.  ",
      "doi": "10.1145/3011141.3011182"
    },
    {
      "text": "Eden Litt and Eszter Hargittai. 2016. The imagined audience on social network sites. Social Media+ Society 2, 1 (2016), 2056305116633482.",
      "doi": ""
    },
    {
      "text": "Duyen T Nguyen, Laura A Dabbish, and Sara Kiesler. 2015. The perverse effects of social transparency on online advice taking. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 207--217.  ",
      "doi": "10.1145/2675133.2675253"
    },
    {
      "text": "Magdalena Obermaier, Nayla Fawzi, and Thomas Koch. 2014. Bystanding or standing by? How the number of bystanders affects the intention to intervene in cyberbullying. new media & society 18, 8 (2014), 1491--1507.",
      "doi": ""
    },
    {
      "text": "Zizi Papacharissi. 2009. The virtual geographies of social networks: a comparative analysis of Facebook, LinkedIn and ASmallWorld. New media & society 11, 1--2 (2009), 199--220.",
      "doi": ""
    },
    {
      "text": "Stefan Pfattheicher and Johannes Keller. 2015. The watching eyes phenomenon: The role of a sense of being seen and public self-awareness. European Journal of Social Psychology 45, 5 (2015), 560--566.",
      "doi": ""
    },
    {
      "text": "Saskia E Polder-Verkiel. 2012. Online responsibility: Bad samaritanism and the influence of internet mediation. Science and engineering ethics 18, 1 (2012), 117--141.",
      "doi": ""
    },
    {
      "text": "Tiziana Pozzoli and Gianluca Gini. 2010. Active defending and passive bystanding behavior in bullying: The role of personal characteristics and perceived peer pressure. Journal of abnormal child psychology 38, 6 (2010), 815--827.",
      "doi": ""
    },
    {
      "text": "Steven Prentice-Dunn and Ronald W Rogers. 1982. Effects of public and private self-awareness on deindividuation and aggression. Journal of Personality and Social Psychology 43, 3 (1982), 503.",
      "doi": ""
    },
    {
      "text": "Rahat Ibn Rafiq, Homa Hosseinmardi, Richard Han, Qin Lv, Shivakant Mishra, and Sabrina Arredondo Mattson. 2015. Careful what you share in six seconds: Detecting cyberbullying instances in Vine. In Proceedings of the 2015 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining 2015. ACM, 617--622.  ",
      "doi": "10.1145/2808797.2809381"
    },
    {
      "text": "Stephanie S Robbins and Walid A Afifi. 2014. The impact of structure on response decisions for recipients of distressing disclosures: The bystander effect. In Proceedings of the 2014 Conference of the International Communication Association.",
      "doi": ""
    },
    {
      "text": "H Colleen Stuart, Laura Dabbish, Sara Kiesler, Peter Kinnaird, and Ruogu Kang. 2012. Social transparency in networked information exchange: a theoretical framework. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 451--460.  ",
      "doi": "10.1145/2145204.2145275"
    },
    {
      "text": "Joseph Turow, Michael Hennessy, and Nora A Draper. 2015. The tradeoff fallacy: How marketers are misrepresenting American consumers and opening them up to exploitation. (2015).",
      "doi": ""
    },
    {
      "text": "Joshua R Tyler and John C Tang. 2003. When Can I Expect an Email Response? A Study of Rhythms in Email Usage.. In ECSCW, Vol. 3. 239--258. ",
      "doi": "10.5555/1241889.1241902"
    },
    {
      "text": "Marco van Bommel, Jan-Willem van Prooijen, Henk Elffers, and Paul AM Van Lange. 2012. Be aware to care: Public self-awareness leads to a reversal of the bystander effect. Journal of Experimental Social Psychology 48, 4 (2012), 926--930.",
      "doi": ""
    },
    {
      "text": "Marco van Bommel, Jan-Willem van Prooijen, Henk Elffers, and Paul AM van Lange. 2014. Intervene to be seen: The power of a camera in attenuating the bystander effect. Social Psychological and Personality Science 5, 4 (2014), 459--466.",
      "doi": ""
    },
    {
      "text": "Janneke M van der Zwaan and Virginia Dignum. 2013. Robin, an empathic virtual buddy for social support. In Proceedings of the 2013 international conference on Autonomous agents and multi-agent systems. International Foundation for Autonomous Agents and Multiagent Systems, 1413--1414. ",
      "doi": "10.5555/2484920.2485251"
    },
    {
      "text": "Nishant Vishwamitra, Xiang Zhang, Jonathan Tong, Hongxin Hu, Feng Luo, Robin Kowalski, and Joseph Mazer. 2017. MCDefender: Toward Effective Cyberbullying Defense in Mobile Online Social Networks. In Proceedings of the 3rd ACM on International Workshop on Security And Privacy Analytics. ACM, 37--42.  ",
      "doi": "10.1145/3041008.3041013"
    },
    {
      "text": "Alan Wexelblat and Pattie Maes. 1999. Footprints: history-rich tools for information foraging. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 270--277.  ",
      "doi": "10.1145/302979.303060"
    },
    {
      "text": "Elizabeth Whittaker and Robin M Kowalski. 2015. Cyberbullying via social media. Journal of School Violence 14, 1 (2015), 11--29.",
      "doi": ""
    },
    {
      "text": "Wouter Wolf, Ana Levordashka, Johanna R Ruff, Steven Kraaijeveld, Jan-Matthis Lueckmann, and Kipling D Williams. 2015. Ostracism Online: A social media ostracism paradigm. Behavior Research Methods 47, 2 (2015), 361--373.",
      "doi": ""
    },
    {
      "text": "Shanyang Zhao, Sherri Grasmuck, and Jason Martin. 2008. Identity construction on Facebook: Digital empowerment in anchored relationships. Computers in human behavior 24, 5 (2008), 1816--1836.  ",
      "doi": "10.1016/j.chb.2008.02.012"
    },
    {
      "text": "Philip G Zimbardo. 1969. The human choice: Individuation, reason, and order versus deindividuation, impulse, and chaos.. In Nebraska symposium on motivation. University of Nebraska press.",
      "doi": ""
    }
  ]
}