{
  "doi": "10.1145/3173574.3173596",
  "title": "IntroAssist: A Tool to Support Writing Introductory Help Requests",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Writing introductory help requests is a key part of develop-ing new professional connections, such as through email and other online messaging systems. This paper presents the design and an experimental evaluation of IntroAssist-a web-based tool that leverages cognitive apprenticeship in-structional methods to support writing introductory help requests through an expert-informed checklist, tagged peer examples, self-tagging, and suggested word limit. In a study of IntroAssist with novice entrepreneurs, we find that 1) expert raters consider help requests written with the tool as more effective, 2) participants are able to perform introduc-tory help seeking skills after the tool is removed, and 3) participants report being more likely to send help requests written with the tool. We present implications for the de-velopment of systems that support the initiation of profes-sional relationships.",
  "tags": [
    "entrepreneurship",
    "professional connec-tions",
    "skills",
    "help seeking",
    "social capital"
  ],
  "authors": [
    {
      "name": "Julie S. Hui",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557055156",
      "orcid": "0000-0002-9776-9400"
    },
    {
      "name": "Darren Gergle",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    },
    {
      "name": "Elizabeth M. Gerber",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502725085",
      "orcid": "0000-0001-8914-071X"
    }
  ],
  "references": [
    {
      "text": "Moore Alex. 2016. 7 Tips for Getting More Responses to Your Emails (With Data!). Retrieved from http://blog.boomerangapp.com/2016/02/7-tips-forgetting-more-responses-to-your-emails-with-data/",
      "doi": ""
    },
    {
      "text": "Susan A. Ambrose, Michael W. Bridges, Michele DiPietro, Marsha C. Lovett, and Marie K. Norman. 2010. How learning works?: Seven research-based principles for smart teaching. Jossey-Bass, San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Robert H. Anderson. 1995. Universal Access to EMail: Feasibility and Societal Implications. RAND. Retrieved from https://eric.ed.gov/?id=ED401884 ",
      "doi": "10.5555/224248"
    },
    {
      "text": "S. E. Anderson and L. J. Williams. 1996. Individual, job, and interpersonal predictors of helping behavior in organizations. Journal of Applied Psychology 81: 282-- 296.",
      "doi": ""
    },
    {
      "text": "Peter Bamberger. 2009. Employee help-seeking: Antecedents, consequences and new insights for future research. In Research in personnel and human resources management. Emerald Group Publishing Limited, 49-- 98.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2001. Self-Efficacy: The Exercise of Control. W. H. Freeman and Company, New York.",
      "doi": ""
    },
    {
      "text": "Peter Michael Blau. 1964. Exchange and Power in Social Life. Wiley Books, New York, NY.",
      "doi": ""
    },
    {
      "text": "Mohamed Bouguessa, Benoît Dumoulin, and Shengrui Wang. 2008. Identifying authoritative actors in question-answering forums: the case of yahoo! answers. In Proc.of the International Conference on Knowledge Discovery and Data Mining, 866--874.  ",
      "doi": "10.1145/1401890.1401994"
    },
    {
      "text": "Pierre Bourdieu. 2011. The forms of capital.(1986). Cultural theory: An anthology 1: 81--93.",
      "doi": ""
    },
    {
      "text": "Ronald J. Burke, Tamara Weir, and Gordon Duncan. 1976. Informal helping relationship in work organizations. Academy of Management Journal 19, 3: 370-- 377.",
      "doi": ""
    },
    {
      "text": "Julie Ann Campbell, Cecilia Aragon, Katie Davis, Sarah Evans, Abigail Evans, and David P. Randall. 2015. Thousands of Positive Reviews: Distributed Mentoring in Online Fan Communities. In Proc. of the Conference on Computer Supported Cooperative Work and Social Computing.",
      "doi": ""
    },
    {
      "text": "Robert Cialdini. 2001. Influence: Science and Practice. Allyn and Bacon, Boston, MA.",
      "doi": ""
    },
    {
      "text": "Allan Collins. 2006. Cognitive Apprenticeship. In Cambridge handbook of the learning sciences. 47--60.",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt. 2014. Fostering Social Capital in Economically Distressed Communities. In Proc. of the Conference on Human Factors in Computing Systems, 531--540.  ",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Tawanna R. Dillahunt, Nishan Bose, Suleman Diwan, and Asha Chen-Phang. 2016. Designing for disadvantaged job seekers: Insights from early investigations. In Proc. of the ACM Conference on Designing Interactive Systems, 905--910.  ",
      "doi": "10.1145/2901790.2901865"
    },
    {
      "text": "Paul DiMaggio, Eszter Hargittai, and others. 2001. From the 'digital divide'to 'digital inequality': Studying Internet use as penetration increases. Princeton: Center for Arts and Cultural Policy Studies, Woodrow Wilson School, Princeton University 4, 1: 4--2.",
      "doi": ""
    },
    {
      "text": "Shayan Doroudi, Ece Kamar, Emma Brunskill, and Eric Horvitz. 2016. Toward a learning science for complex crowdsourcing tasks. In Proc. of the ACM Conference on Human Factors in Computing Systems, 2623--2634.  ",
      "doi": "10.1145/2858036.2858268"
    },
    {
      "text": "Matthew W. Easterday, Daniel G. Rees Lewis, and Elizabeth M. Gerber. 2017. The logic of design research. Learning: Research and Practice: 1--30.",
      "doi": ""
    },
    {
      "text": "Sarah Evans, Katie Davis, Abigail Evans, Julie Ann Campbell, David P. Randall, Kodlee Yin, and Cecilia Aragon. 2017. More Than Peer Production: Fanfiction Communities as Sites of Distributed Mentoring. In Proc. of the Conference on Computer Supported Cooperative Work & Social Computing.  ",
      "doi": "10.1145/2998181.2998342"
    },
    {
      "text": "Robert W. Fairlie, Alicia M. Robb, and David Hinson. 2010. Disparities in Capital Access between Minority and Non-Minority-Owned Businesses. US Dept. of Commerce.",
      "doi": ""
    },
    {
      "text": "Francis J. Flynn, Ray E. Reagans, Emily T. Amanatullah, and Daniel R. Ames. 2006. Helping one's way to the top: self-monitors achieve status by helping others and knowing who helps whom. Journal of personality and social psychology 91, 6: 1123.",
      "doi": ""
    },
    {
      "text": "Eureka Foong, Steven P. Dow, Brian P. Bailey, and Elizabeth M. Gerber. 2017. Online Feedback Exchange: A Framework for Understanding the SocioPsychological Factors. In Proc. of the Conference on Human Factors in Computing Systems, 4454--4467.  ",
      "doi": "10.1145/3025453.3025791"
    },
    {
      "text": "Atul Gawande. 2010. Checklist Manifesto, The (HB). Penguin Books India.",
      "doi": ""
    },
    {
      "text": "Elizabeth M. Gerber and Julie S. Hui. 2013. Crowdfunding: Motivations and Deterrents for Participation. Transactions on Human-Computer Interaction 20, 6: 34:1--34:32.  ",
      "doi": "10.1145/2530540"
    },
    {
      "text": "Francesca Gino, Alison Wood Brooks, and Maurice E. Schweitzer. 2012. Anxiety, advice, and the ability to discern: feeling anxious motivates individuals to seek and use advice. Journal of personality and social psychology 102, 3: 497.",
      "doi": ""
    },
    {
      "text": "Andreea Daniela Gorbatai and Laura Nelson. 2015. Gender and the Language of Crowdfunding. In Academy of Management Proceedings, 15785. Retrieved from http://proceedings.aom.org/content/2015/1/15785.short",
      "doi": ""
    },
    {
      "text": "Alvin W. Gouldner. 1960. The norm of reciprocity: A preliminary statement. American sociological review: 161--178.",
      "doi": ""
    },
    {
      "text": "Stine Grodal, Andrew J. Nelson, and Rosanne M. Siino. 2015. Help-seeking and help-giving as an organizational routine: Continual engagement in innovative work. Academy of Management Journal 58, 1: 136-- 168.",
      "doi": ""
    },
    {
      "text": "Bruce Hanington. 2012. Universal Methods of Design: 100 Ways to Research Complex Problems, Develop Innovative Ideas, and Design Effective Solutions. Rockport Publishers.",
      "doi": ""
    },
    {
      "text": "Alex B. Haynes, Thomas G. Weiser, William R. Berry, Stuart R. Lipsitz, Abdel-Hadi S. Breizat, E. Patchen Dellinger, Teodoro Herbosa, Sudhir Joseph, Pascience L. Kibatala, Marie Carmela M. Lapitan, and others. 2009. A surgical safety checklist to reduce morbidity and mortality in a global population. New England Journal of Medicine 360, 5: 491--499.",
      "doi": ""
    },
    {
      "text": "Damon Horowitz and Sepandar D. Kamvar. 2010. The anatomy of a large-scale social search engine. In Proc. of the Conference on the World Wide Web, 431--440.  ",
      "doi": "10.1145/1772690.1772735"
    },
    {
      "text": "Julie S. Hui, Michael D Greenberg, and Elizabeth M. Gerber. 2014. Understanding the Role of Community in Crowdfunding Work. In Proc. of the ACM Conference on Computer Supported Cooperative Work & Social Computing, 62--74.  ",
      "doi": "10.1145/2531602.2531715"
    },
    {
      "text": "Grace YoungJoo Jeon, Nicole B. Ellison, Bernie Hogan, and Christine Greenhow. 2016. First-generation students and college: the role of Facebook networks as information sources. In Proc. in the ACM Conference on Computer-Supported Cooperative Work & Social Computing, 887--899.  ",
      "doi": "10.1145/2818048.2820074"
    },
    {
      "text": "Pawel Jurczyk and Eugene Agichtein. 2007. Discovering authorities in question answer communities by using link analysis. In Proceedings of the sixteenth ACM conference on Conference on information and knowledge management, 919--922.  ",
      "doi": "10.1145/1321440.1321575"
    },
    {
      "text": "Matthew Kay and Jacob O. Wobbrock. ARTool: Aligned Rank Transform. Retrieved from https://cran.rproject.org/web/packages/ARTool/index.html",
      "doi": ""
    },
    {
      "text": "Roderick M. Kramer and Tom R. Tyler. 1996. Trust in organizations: Frontiers of theory and research. Sage.",
      "doi": ""
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated Learning: Legitimate peripheral participation. University of Cambridge Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Xiaoyong Liu, W. Bruce Croft, and Matthew Koll. 2005. Finding experts in community-based questionanswering services. In Proc. of the ACM international conference on Information and knowledge management, 315--316.  ",
      "doi": "10.1145/1099554.1099644"
    },
    {
      "text": "Karyn A. Loscocco, Joyce Robinson, Richard H. Hall, and John K. Allen. 1991. Gender and small business success: An inquiry into women's relative disadvantage. Social forces 70, 1: 65--85.",
      "doi": ""
    },
    {
      "text": "Jalal Mahmud, Michelle X. Zhou, Nimrod Megiddo, Jeffrey Nichols, and Clemens Drews. 2013. Recommending targeted strangers from whom to solicit information on social media. In Proc. if the Conference on Intelligent user interfaces, 37--48.  ",
      "doi": "10.1145/2449396.2449403"
    },
    {
      "text": "Jane Margolis and Allan Fisher. 2003. Unlocking the clubhouse: Women in computing. MIT press.",
      "doi": ""
    },
    {
      "text": "Jennifer Marlow and Laura Dabbish. 2014. From rookie to all-star: professional development in a graphic design social networking site. In Proc. of the Conference on Computer Supported Cooperative Work & Social Computing, 922--933.  ",
      "doi": "10.1145/2531602.2531651"
    },
    {
      "text": "David W. McDonald and Mark S. Ackerman. 2000. Expertise recommender: a flexible recommendation system and architecture. In Proc. of the Conference on Computer Supported Cooperative Work & Social Computing, 231--240.  ",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "Bonnie L. McNeely and Bruce M. Meglino. 1994. The role of dispositional and situational antecedents in prosocial organizational behavior: An examination of the intended beneficiaries of prosocial behavior. Journal of applied psychology 79, 6: 836.",
      "doi": ""
    },
    {
      "text": "Matthew B. Miles and Michael Huberman. 1994. Qualitative Data Analysis. Sage Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra and Eric Gilbert. 2014. The language that gets people to give: Phrases that predict success on kickstarter. In Proc. of the Conference on Computer Supported Cooperative Work and Social Computing, 49--61.  ",
      "doi": "10.1145/2531602.2531656"
    },
    {
      "text": "Arie Nadler. 1991. Help-seeking behavior: Psychological costs and instrumental benefits. Retrieved March 6, 2015 from http://psycnet.apa.org/psycinfo/199197117-011",
      "doi": ""
    },
    {
      "text": "Sharon Nelson-Le Gall. 1981. Help-seeking: An understudied problem-solving skill in children. Developmental Review 1, 3: 224--246.",
      "doi": ""
    },
    {
      "text": "Charles A. O'Reilly and Jennifer Chatman. 1986. Organizational commitment and psychological attachment: The effects of compliance, identification, and internalization on prosocial behavior. Journal of applied psychology 71, 3: 492.",
      "doi": ""
    },
    {
      "text": "Aditya Pal, Rosta Farzan, Joseph A. Konstan, and Robert E. Kraut. 2011. Early detection of potential experts in question answering communities. In User Modeling, Adaption and Personalization. Springer, 231--242. ",
      "doi": "10.5555/2021855.2021876"
    },
    {
      "text": "Robert D. Putnam. 2001. Bowling alone: The collapse and revival of American community. Simon & Schuster.",
      "doi": ""
    },
    {
      "text": "Minna Puustinen and Jean-François Rouet. 2009. Learning with new technologies: Help seeking and information searching revisited. Computers & Education 53, 4: 1014--1019.  ",
      "doi": "10.1016/j.compedu.2008.07.002"
    },
    {
      "text": "Allison M. Ryan, Margaret H. Gheen, and Carol Midgley. 1998. Why do some students avoid asking for help? An examination of the interplay among students' academic efficacy, teachers' social--emotional role, and the classroom goal structure. Journal of educational psychology 90, 3: 528.",
      "doi": ""
    },
    {
      "text": "Allison M. Ryan, Paul R. Pintrich, and Carol Midgley. 2001. Avoiding seeking help in the classroom: Who and why? Educational Psychology Review 13, 2: 93-- 114.",
      "doi": ""
    },
    {
      "text": "N. Sadat Shami, Kate Ehrlich, Geri Gay, and Jeffrey T. Hancock. 2009. Making sense of strangers' expertise from signals in digital artifacts. In Proc. of the Conference on Human Factors in Computing Systems, 69--78.  ",
      "doi": "10.1145/1518701.1518713"
    },
    {
      "text": "N. Sadat Shami, Kate Ehrlich, and David R. Millen. 2008. Pick me!: link selection in expertise search results. In Proc. of the Conference on Human Factors in Computing Systems, 1089--1092.  ",
      "doi": "10.1145/1357054.1357223"
    },
    {
      "text": "Scott Shane. 2003. A General Theory of Entrepreneurship: The Individual-Opportunity Nexus. Edward Elgar Publishing Limited, Northampton, MA.",
      "doi": ""
    },
    {
      "text": "Meredith M. Skeels and Jonathan Grudin. 2009. When social networks cross boundaries: a case study of workplace use of facebook and linkedin. In Proc. of the ACM International conference on Supporting group work, 95--104.  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "C. A. Smith, Dennis W. Organ, and Janet P. Near. 1983. Organizational citizenship behavior: Its nature and antecedents. Journal of applied psychology 68, 4: 653.",
      "doi": ""
    },
    {
      "text": "Shane Snow. 2014. What We Learned From Sending 1,000 Cold Emails. Fast Company. Retrieved from https://www.fastcompany.com/3036672/what-welearned-from-sending-1000-cold-emails",
      "doi": ""
    },
    {
      "text": "Etienne St-Jean and Josée Audet. 2012. The role of mentoring in the learning development of the novice entrepreneur. International Entrepreneurship and Management Journal 8, 1: 119--140.",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Niloufar Salehi, Michelle S. Lam, Juan C. Marroquin, and Michael S. Bernstein. 2016. Atelier: Repurposing Expert Crowdsourcing Tasks as Microinternships. In Proc. of the Conference on Computer Supported Cooperative Work.",
      "doi": ""
    },
    {
      "text": "Amber Walraven, Saskia Brand-Gruwel, and Henny PA Boshuizen. 2008. Information-problem solving: A review of problems students encounter and instructional solutions. Computers in Human Behavior 24, 3: 623--648.  ",
      "doi": "10.1016/j.chb.2007.01.030"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proc. of the ACM Conference on Human Factors in Computing Systems, 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Donghee Yvette Wohn, Nicole B. Ellison, M. Laeeq Khan, Ryan Fewins-Bliss, and Rebecca Gray. 2013. The Role of Social Media in Shaping First-generation High School Students' College Aspirations: A Social Capital Lens. Computers & Education 63: 424--436.  ",
      "doi": "10.1016/j.compedu.2013.01.004"
    },
    {
      "text": "Svetlana Yarosh, Tara Matthews, and Michelle Zhou. 2012. Asking the right person: supporting expertise selection in the enterprise. In Proc. of the Conference on Human Factors in Computing Systems, 2247--2256.  ",
      "doi": "10.1145/2207676.2208382"
    },
    {
      "text": "Svetlana Yarosh, Tara Matthews, Michelle Zhou, and Kate Ehrlich. 2013. I need someone to help!: a taxonomy of helper-finding activities in the enterprise. In Proc. of the Conference on Computer supported cooperative work, 1375--1386.  ",
      "doi": "10.1145/2441776.2441931"
    },
    {
      "text": "Jun Zhang and Mark S. Ackerman. 2005. Searching for expertise in social networks: a simulation of potential strategies. In Proc. of the ACM Conference on Supporting group work, 71--80.  ",
      "doi": "10.1145/1099203.1099214"
    },
    {
      "text": "Jun Zhang, Mark S. Ackerman, Lada Adamic, and Kevin Kyung Nam. 2007. QuME: a mechanism to support expertise finding in online help-seeking communities. In Proc. of the ACM symposium on User interface software and technology, 111--114.  ",
      "doi": "10.1145/1294211.1294230"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research. In Proc. of the ACM Conference on Human Factors in Computing Systems, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Mailchimp. Retrieved July 26, 2013 from http://mailchimp.com/",
      "doi": ""
    },
    {
      "text": "Boomerang for Gmail. Retrieved from http://www.boomeranggmail.com/respondable/",
      "doi": ""
    }
  ]
}