{
  "doi": "10.1145/3173574.3173586",
  "title": "Admixed Portrait: Design to Understand Facebook Portrayals in New Parenthood",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "We report on a design-led study of the photographic representation of self and family on Facebook during and after becoming parents for the first time. Our experience-centered, research-through-design study engaged eight participants across five UK homes, in a month-long deployment of a prototype technology -- a design research artifact, Admixed Portrait, that served to prompt participant reflection on first-time parenthood. In addition to pre- and post-deployment interviews, participants kept diaries capturing personal reflections during the deployment, on daily social media use and interactions with Admixed. Our qualitative insights on social media representations of transitional experience and identity for new parents, reveal how their online 'photowork' related to self-expression and social functioning. We contribute design considerations for developing tools to support photographic expression in social media use, and methodological insights about design-led inquiry for understanding transitional experiences.",
  "authors": [
    {
      "name": "Abigail C. Durrant",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488179",
      "orcid": "0000-0003-4752-5376"
    },
    {
      "name": "David S. Kirk",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Diego Trujillo-Pisanty",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758951157",
      "orcid": "missing"
    },
    {
      "name": "Sarah Martindale",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557389856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tawfiq Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing Children's Online Identities: How Parents Decide what to Disclose about their Children Online. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1895--1904.  ",
      "doi": "10.1145/2702123.2702325"
    },
    {
      "text": "Madeline Balaam, Judy Robertson, Geraldine Fitzpatrick, Rebecca Say, Gillian Hayes, Melissa Mazmanian, and Belinda Parmar. 2013. Motherhood and HCI. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 3215--3218.  ",
      "doi": "10.1145/2468356.2479650"
    },
    {
      "text": "L. Barclay, L. Everitt, F. Rogan, V. Schmied, and A. Wyllie. 1997. Becoming a mother-an analysis of women's experience of early motherhood. Journal of Advanced nursing, 25(4), 719--728.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Guo Zhang, and Tyler Pace. 2014. The lonely raccoon at the ball: designing for intimacy, sociability, and selfhood. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3943--3952.  ",
      "doi": "10.1145/2556288.2557127"
    },
    {
      "text": "Mitchell K. Bartholomew, Sarah J. Schoppe-Sullivan, Michael Glassman, Claire M. Kamp Dush, and Jason M. Sullivan. 2012. New Parents' Facebook Use at the Transition to Parenthood. Family Relations 61, 3, 455-- 469.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer, Vera Khovanskaya, Mark Matthews, Lindsay Reynolds, Victoria Schwanda Sosik, and Geri Gay. 2014. Reviewing reflection: on the use of reflection in interactive system design. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 93102.  ",
      "doi": "10.1145/2598510.2598598"
    },
    {
      "text": "Nancy Baym. 2010 Personal connections in the digital age: Digital media and society. Polity Press.",
      "doi": ""
    },
    {
      "text": "Benjamin B. Bederson. 2001. PhotoMesa: a zoomable image browser using quantum treemaps and bubblemaps. In Proceedings of the 14th annual ACM symposium on User interface software and technology (UIST '01). ACM, New York, NY, USA, 71--80.  ",
      "doi": "10.1145/502348.502359"
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Trans. Comput.-Hum. Interact. 12, 2 (June 2005), 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Laurens Boer and Jared Donovan. 2012. Provotypes for participatory innovation. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 388--397.  ",
      "doi": "10.1145/2317956.2318014"
    },
    {
      "text": "danah boyd. 2014. It's complicated: the social lives of networked teens. Yale University Press. ",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Moira Burke and Robert E. Kraut. 2014. Growing closer on facebook: changes in tie strength through social network site use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 4187--4196.  ",
      "doi": "10.1145/2556288.2557094"
    },
    {
      "text": "Fabio Celli, Elia Bruni, and Bruno Lepri. 2014. Automatic Personality and Interaction Style Recognition from Facebook Profile Pictures. In Proceedings of the 22nd ACM international conference on Multimedia (MM '14). ACM, New York, NY, USA, 1101--1104.  ",
      "doi": "10.1145/2647868.2654977"
    },
    {
      "text": "Richard Chalfen. 1987. Snapshot versions of life. University of Wisconsin Press.",
      "doi": ""
    },
    {
      "text": "Joan M. DiMicco and David R. Millen. 2007. Identity management: multiple presentations of self in facebook. In Proceedings of the 2007 international ACM conference on Supporting group work (GROUP '07). ACM, New York, NY, USA, 383--386.  ",
      "doi": "10.1145/1316624.1316682"
    },
    {
      "text": "Abigail Durrant, Alex S. Taylor, David Frohlich, Abigail Sellen, and David Uzzell. 2009. Photo displays and intergenerational relationships in the family home. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCS-HCI '09). British Computer Society, Swindon, UK, UK, 10--19 ",
      "doi": "10.5555/1671011.1671013"
    },
    {
      "text": "Abigail Durrant, David Kirk, Diego Trujillo Pisanty, Wendy Moncur, Kathryn Orzech, Tom Schofield, Chris Elsden, David Chatting, and Andrew Monk. 2017. Transitions in Digital Personhood: Online Activity in Early Retirement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 63986411.  ",
      "doi": "10.1145/3025453.3025913"
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, and David S. Kirk. 2016. It's Just My History Isn't It?: Understanding Smart Journaling Practices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 28192831.  ",
      "doi": "10.1145/2858036.2858103"
    },
    {
      "text": "Chris Elsden, David Kirk, Abigail Durrant. 2016. A Quantified Past: Toward Design for Remembering With Personal Informatics. Human-Computer Interaction, 31, 6, 518--557  ",
      "doi": "10.1080/07370024.2015.1093422"
    },
    {
      "text": "Shelly D. Farnham and Elizabeth F. Churchill. 2011. Faceted identity, faceted lives: social and technical issues with being yourself online. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11). ACM, New York, NY, USA, 359--368.  ",
      "doi": "10.1145/1958824.1958880"
    },
    {
      "text": "Joshua Fogel and Elham Nehmad (2009) Internet social network communities: Risk taking, trust, and privacy concerns. Computers in Human Behavior. 25, 153--160.  ",
      "doi": "10.1016/j.chb.2008.08.006"
    },
    {
      "text": "Batya Friedman and Lisa P. Nathan. 2010. Multilifespan information system design: a research initiative for the hci community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 22432246.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 937946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Lorna Gibson and Vicki L. Hanson. 2013. Digital motherhood: how does technology help new mothers?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 313--322.  ",
      "doi": "10.1145/2470654.2470700"
    },
    {
      "text": "Alex Gillespie and Jack Martin. 2014. Position Exchange Theory: A socio-material basis for discursive and psychological positioning. New Ideas in Psychology 32: 73--79.",
      "doi": ""
    },
    {
      "text": "Adrian Graham, Hector Garcia-Molina, Andreas Paepcke, and Terry Winograd. 2002. Time as essence for photo browsing through personal digital libraries. In Proceedings of the 2nd ACM/IEEE-CS joint conference on Digital libraries (JCDL '02). ACM, New York, NY, USA, 326--335.  ",
      "doi": "10.1145/544220.544301"
    },
    {
      "text": "Rebecca Gulotta, William Odom, Haakon Faste, and Jodi Forlizzi. 2014. Legacy in the age of the internet: reflections on how interactive systems shape how we are remembered. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 975--984.  ",
      "doi": "10.1145/2598510.2598579"
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2016. Digital Footprints and Changing Networks During Online Identity Transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2895--2907.  ",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Richard Harper, Eryn Whitworth, and Ruth Page. 2012. Fixity: Identity, Time and Durée on Facebook. In Proc. IR 13.0.",
      "doi": ""
    },
    {
      "text": "Daniel Herron, Wendy Moncur, and Elise van den Hoven. 2017. Digital Decoupling and Disentangling: Towards Design for Romantic Break Up. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 1175--1185.  ",
      "doi": "10.1145/3064663.3064765"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "David F. Huynh, Steven M. Drucker, Patrick Baudisch, and Curtis Wong. 2005. Time quilt: scaling up zoomable photo browsers for large, unstructured photo collections. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1937--1940.  ",
      "doi": "10.1145/1056808.1057061"
    },
    {
      "text": "Evangelos Karapanos, John Zimmerman, Jodi Forlizzi, and Jean-Bernard Martens. 2009. User experience over time: an initial framework. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 729738.  ",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "David Kirk, Abigail Sellen, Carsten Rother, and Ken Wood. 2006. Understanding photowork. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, New York, NY, USA, 761--770.  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Priya Kumar and Sarita Schoenebeck. 2015. The Modern Day Baby Book: Enacting Good Mothering and Stewarding Privacy on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1302--1312.  ",
      "doi": "10.1145/2675133.2675149"
    },
    {
      "text": "Mary Madden, Susannah Fox, Smith Aaron and Jessica Vitak. 2007. Digital Footprints: Online identity management and search in the age of transparency. Pew Internet & American Life Project. http://www.pewinternet.org/files/oldmedia/Files/Reports/2007/PIP_Digital_Footprints.pdf. pdf Last Accessed 19/09/2017",
      "doi": ""
    },
    {
      "text": "Michael Massimi, Jackie L. Bender, Holly O. Witteman, and Osman H. Ahmed. 2014. Life transitions and online health communities: reflecting on adoption, use, and disengagement. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 1491--1501.  ",
      "doi": "10.1145/2531602.2531622"
    },
    {
      "text": "Michael Massimi, Richard Harper, and Abigail J. Sellen. 2014. \"Real, but Glossy\": technology and the practical pursuit of magic in modern weddings. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 854--865.  ",
      "doi": "10.1145/2531602.2531682"
    },
    {
      "text": "Michael Massimi, William Odom, Richard Banks, and David Kirk. 2011. Matters of life and death: locating the end of life in lifespan-oriented hci research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 987--996.  ",
      "doi": "10.1145/1978942.1979090"
    },
    {
      "text": "John McCarthy and Peter Wright. 2015. Taking {A}Part: The Politics and Aesthetics of Participation in Experience-Centered Design. The MIT Press. ",
      "doi": "10.5555/2742697"
    },
    {
      "text": "Meredith Ringel Morris. 2014. Social networking site use by mothers of young children. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 1272--1282.  ",
      "doi": "10.1145/2531602.2531603"
    },
    {
      "text": "Kellie Morrissey, John McCarthy, and Nadia Pantidi. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1326--1338.  ",
      "doi": "10.1145/3025453.3025527"
    },
    {
      "text": "Nikki Newhouse. 2016. bump2bump: Online Peer Support in First-Time Pregnancy. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 239--243.  ",
      "doi": "10.1145/2851581.2859021"
    },
    {
      "text": "William T. Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 19611970.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Fatih Kursat Ozenc and Shelly D. Farnham. 2011. Life \"modes\" in social media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 561570.  ",
      "doi": "10.1145/1978942.1979022"
    },
    {
      "text": "James Pierce. 2014. On the presentation and production of design research artifacts in HCI. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 735--744.  ",
      "doi": "10.1145/2598510.2598525"
    },
    {
      "text": "Suzanne Prior. 2016. The millennial mum: technology use by new mothers. In Proceedings of the 30th International BCS Human Computer Interaction Conference: Companion Volume (HCI '16). BCS Learning & Development Ltd., Swindon, UK, Article 20, 3 pages. ",
      "doi": "10.5555/3114770.3114790"
    },
    {
      "text": "Gillian Rose. 2010. Doing Family Photography: The Domestic, The Public and The Politics of Sentiment, Ashgate.",
      "doi": ""
    },
    {
      "text": "Risto Sarvas and David Frohlich. 2011. From Snapshots to Social Media -- The Changing Picture of Domestic Photography. Springer Publishing Inc. ",
      "doi": "10.5555/1972512"
    },
    {
      "text": "Corina Sas and Steve Whittaker. 2013. Design for forgetting: disposing of digital possessions after a breakup. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1823--1832.  ",
      "doi": "10.1145/2470654.2466241"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC '05), Olav W. Bertelsen, Niels Olof Bouvin, Peter G. Krogh, and Morten Kyng (Eds.). ACM, New York, NY, USA, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Suvi Silfverberg, Lassi A. Liikkanen, and Airi Lampinen. 2011. \"I'll press play, but I won't listen\": profile work in a music-focused social network service. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11). ACM, 207--216.  ",
      "doi": "10.1145/1958824.1958855"
    },
    {
      "text": "Jonathan A. Smith. (1999). Identity development during the transition to motherhood: An interpretative phenomenological analysis. Journal of reproductive and infant psychology, 17(3), 281--299.",
      "doi": ""
    },
    {
      "text": "Jonathan A. Smith, Paul Flowers, and Michael Larkin. 2009. Interpretative phenomenological analysis: Theory, method and research. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Hyewon Suh, John R. Porter, Alexis Hiniker, and Julie A. Kientz. 2014. @BabySteps: design and evaluation of a system for using twitter for tracking children's developmental milestones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 22792288.  ",
      "doi": "10.1145/2556288.2557386"
    },
    {
      "text": "Angelica Svelander and Mikael Wiberg. 2015. The practice of selfies. interactions 22, 4 (June 2015), 3438.  ",
      "doi": "10.1145/2770886"
    },
    {
      "text": "Yaniv Taigman, Ming Yang, Marc'Aurelio Ranzato, and Lior Wolf. 2014. Deepface: Closing the gap to human-level performance in face verification.\" In Proceedings of the IEEE conference on computer vision and pattern recognition, pp. 1701--1708.  ",
      "doi": "10.1109/CVPR.2014.220"
    },
    {
      "text": "Catalina L. Toma. 2010. Affirming the self through online profiles: beneficial effects of social networking sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1749--1752.  ",
      "doi": "10.1145/1753326.1753588"
    },
    {
      "text": "Diego Trujillo-Pisanty, Abigail Durrant, Sarah Martindale, Stuart James, and John Collomosse. 2014. Admixed portrait: reflections on being online as a new parent. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 503--512.  ",
      "doi": "10.1145/2598510.2602962"
    },
    {
      "text": "José Van Dijck. 2007. Mediated memories in the digital age. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak and Jinyoung Kim. 2014. \"You can't block people offline\": examining how facebook's affordances shape the disclosure process. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 461--474.  ",
      "doi": "10.1145/2531602.2531672"
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 2883--2884.  ",
      "doi": "10.1145/2468356.2479560"
    },
    {
      "text": "Peter Wright and John McCarthy. 2010. Experiencecentered Design: Designers, Users, and Communities in Dialogue. Morgan & Claypool Publishers. ",
      "doi": "10.5555/1855065"
    },
    {
      "text": "Salu Ylirisku, Siân Lindley, Giulio Jacucci, Richard Banks, Craig Stewart, Abigail Sellen, Richard Harper, and Tim Regan. 2013. Designing web-connected physical artefacts for the 'aesthetic' of the home. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 909918.  ",
      "doi": "10.1145/2470654.2466117"
    },
    {
      "text": "Salu Ylirisku, Antti Jylhä, Anu Lehtiö, Imtiaj Ahmed, Craig Stewart, Abigail Sellen, Richard Harper, and Giulio Jacucci. 2016. Designing for Active Place Presence at Home: The Hole in Space Design Experiment. Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, 1341--1352.  ",
      "doi": "10.1145/2901790.2901884"
    },
    {
      "text": "Xuan Zhao and Siân E. Lindley. 2014. Curation Through Use: Understanding the Personal Value of Social Media. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2431--2440.  ",
      "doi": "10.1145/2556288.2557291"
    },
    {
      "text": "Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of facebook: experiencing social media as performance, exhibition, and personal archive. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/2470654.2470656"
    }
  ]
}