{
  "doi": "10.1145/3173574.3173858",
  "title": "Digital Outdoor Play: Benefits and Risks from an Interaction Design Perspective",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Outdoor play has been proven to be beneficial for children's development. HCI research on Heads-Up Games suggests that the well-known decline in outdoor play can be addressed by adding technology to such activities. However, outdoor play benefits such as social interaction, creative thinking, and physical activity may be compromised when digital features are added. We present the design & implementation of a novel digitally-enhanced outdoor-play prototype. Our evaluation with 48 children revealed that a non-digital version of the novel outdoor play object afforded social play and game invention. Evaluation of the digitally-enhanced version showed reduced collaborative social interaction and reduced creative thinking when compared with baseline. However, we showed that specific sensing and feedback features better supported outdoor play benefits. For example non-accumulated feedback was shown to increase collaborative play and creative thinking in comparison to accumulated feedback. We provide evidence-based recommendations for designers of outdoor play technologies.",
  "authors": [
    {
      "name": "Tom Hitron",
      "institution": "The Interdisciplinary Center, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659185146",
      "orcid": "missing"
    },
    {
      "name": "Idan David",
      "institution": "The Interdisciplinary Center, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659183382",
      "orcid": "missing"
    },
    {
      "name": "Netta Ofer",
      "institution": "The Interdisciplinary Center, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261765",
      "orcid": "0000-0003-2971-2223"
    },
    {
      "name": "Andrey Grishko",
      "institution": "The Interdisciplinary Center, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659179132",
      "orcid": "missing"
    },
    {
      "name": "Iddo Yehoshua Wald",
      "institution": "The Interdisciplinary Center, Herzliya , Israel",
      "img": "/do/10.1145/contrib-99659178825/rel-imgonly/iddo.jpg",
      "acmid": "99659178825",
      "orcid": "missing"
    },
    {
      "name": "Hadas Erel",
      "institution": "The Interdisciplinary Center, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260836",
      "orcid": "0000-0001-7099-6104"
    },
    {
      "name": "Oren Zuckerman",
      "institution": "The Interdisciplinary Center, Herzliya, Israel",
      "img": "/do/10.1145/contrib-81100224720/rel-imgonly/oren_h.jpg",
      "acmid": "81100224720",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Habibe Acar. 2014. Learning environments for children in outdoor spaces. Procedia-Social and Behavioral Sciences 141 (2014), 846--853.",
      "doi": ""
    },
    {
      "text": "Tetske Avontuur, Rian De Jong, Eveline Brink, Yves Florack, Iris Soute, and Panos Markopoulos. 2014. Play it our way: customization of game rules in children's interactive outdoor games. In Proceedings of the 2014 conference on Interaction design and children. ACM, 95--104.  ",
      "doi": "10.1145/2593968.2593973"
    },
    {
      "text": "Jon Back, Caspar Heeffer, Susan Paget, Andreas Rau, Eva Lotta Sallnäs Pysander, and Annika Waern. 2016. Designing for Children's Outdoor Play. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 28--38.  ",
      "doi": "10.1145/2901790.2901875"
    },
    {
      "text": "Fiona Bailey and Magnus Moar. 2003. The VERTEX project: Designing and populating shared 3D virtual worlds in the primary (elementary) classroom. Computers & Graphics 27, 3 (2003), 353--359.",
      "doi": ""
    },
    {
      "text": "Saskia Bakker, Panos Markopoulos, and Yvonne de Kort. 2008. OPOS: an observation scheme for evaluating head-up play. In Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges. ACM, 33--42.  ",
      "doi": "10.1145/1463160.1463165"
    },
    {
      "text": "Tilde Bekker and Janienke Sturm. 2009. Stimulating physical and social activity through open-ended play. In Proceedings of the 8th international conference on interaction design and children. ACM, 309--312.  ",
      "doi": "10.1145/1551788.1551869"
    },
    {
      "text": "Tilde Bekker, Janienke Sturm, and Berry Eggen. 2010. Designing playful interactions for social interaction and physical play. Personal and Ubiquitous Computing 14, 5 (2010), 385--396.  ",
      "doi": "10.1007/s00779-009-0264-1"
    },
    {
      "text": "Tilde Bekker, Janienke Sturm, Rik Wesselink, Bas Groenendaal, and Berry Eggen. 2008. Interactive play objects and the effects of open-ended play on social interaction and fun. In Proceedings of the 2008 International Conference on Advances in Computer Entertainment Technology. ACM, 389--392.  ",
      "doi": "10.1145/1501750.1501841"
    },
    {
      "text": "Gabriela Bento and Gisela Dias. 2017. The importance of outdoor play for young children's healthy development. Porto Biomedical Journal (2017).",
      "doi": ""
    },
    {
      "text": "Esta A Berg. 1948. A simple objective technique for measuring flexibility in thinking. The Journal of general psychology 39, 1 (1948), 15--22.",
      "doi": ""
    },
    {
      "text": "Thomas Chatzidimitris, Damianos Gavalas, and Vlasios Kasapakis. 2015. PacMap: transferring PacMan to the physical realm. In Internet of Things. User-Centric IoT. Springer, 139--144.",
      "doi": ""
    },
    {
      "text": "Rhonda Clements. 2004. An investigation of the status of outdoor play. Contemporary issues in early childhood 5, 1 (2004), 68--80.",
      "doi": ""
    },
    {
      "text": "PS Davies, J Gregory, and A White. 1995. Physical activity and body fatness in pre-school children. International journal of obesity and related metabolic disorders: journal of the International Association for the Study of Obesity 19, 1 (1995), 6--10.",
      "doi": ""
    },
    {
      "text": "Linda De Valk, Tilde Bekker, and Berry Eggen. 2013. Leaving room for improvisation: towards a design approach for open-ended play. In Proceedings of the 12th International Conference on Interaction Design and Children. ACM, 92--101.  ",
      "doi": "10.1145/2485760.2485771"
    },
    {
      "text": "AdriáN DomíNguez, Joseba Saenz-De-Navarrete, Luis De-Marcos, Luis FernáNdez-Sanz, Carmen PagéS, and José-Javier MartíNez-HerráIz. 2013. Gamifying learning experiences: Practical implications and outcomes. Computers & Education 63 (2013), 380--392.  ",
      "doi": "10.1016/j.compedu.2012.12.020"
    },
    {
      "text": "Hadas ErEl and Nachshon Meiran. 2011. Mindset changes lead to drastic impairments in rule finding. Cognition 119, 2 (2011), 149--165.",
      "doi": ""
    },
    {
      "text": "Olivier Friard and Marco Gamba. 2016. BORIS: a free, versatile open-source event-logging software for video/audio coding and live observations. Methods in Ecology and Evolution 7, 11 (2016), 1325--1330.",
      "doi": ""
    },
    {
      "text": "Catherine Garvey. 1990. Play. Vol. 27. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Peter Gray. 2011. The decline of play and the rise of psychopathology in children and adolescents. American Journal of Play 3, 4 (2011), 443--463.",
      "doi": ""
    },
    {
      "text": "Koen Hendrix, Guo Yang, Dirk Van De Mortel, Tim Tijs, and Panos Markopoulos. 2008. Designing a head-up game for children. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction-Volume 1. British Computer Society, 45--53. ",
      "doi": "10.5555/1531514.1531521"
    },
    {
      "text": "Tom Hitron, Itamar Apelblat, Iddo Wald, Eitan Moriano, Andrey Grishko, Idan David, Avihay Bar, and Oren Zuckerman. 2017. Scratch Nodes: Coding Outdoor Play Experiences to enhance Social-Physical Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 601--607.  ",
      "doi": "10.1145/3078072.3084331"
    },
    {
      "text": "Heather A Holmes-Lonergan. 2003. Preschool children's collaborative problem-solving interactions: The role of gender, pair type, and task. Sex roles 48, 11--12 (2003), 505--517.",
      "doi": ""
    },
    {
      "text": "Linda Hughes. 1983. Beyond the rules of the game, why are rooie rules nice. The game design reader: A rules of play anthology (1983), 504--516.",
      "doi": ""
    },
    {
      "text": "James Harry Humphrey. 2003. Child development through sports. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii. 2004. Bottles: A transparent interface as a tribute to mark weiser. IEICE Transactions on information and systems 87, 6 (2004), 1299--1311.",
      "doi": ""
    },
    {
      "text": "TF Juster, F Stafford, and H Ono. 2004. Major changes have taken place in how children and teens spend their time: Child development supplement. Ann Arbor, MI: Institute for Social Research, University of Michigan (2004).",
      "doi": ""
    },
    {
      "text": "Matthew Kam, Akhil Mathur, Anuj Kumar, and John Canny. 2009. Designing digital games for rural children: a study of traditional village games in India. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 31--40.  ",
      "doi": "10.1145/1518701.1518707"
    },
    {
      "text": "Anja Kern. 2006. Exploring the relation between creativity and rules: the case of the performing arts. International Studies of Management & Organization 36, 1 (2006), 63--80.",
      "doi": ""
    },
    {
      "text": "Alfie Kohn. 1992. No contest: The case against competition. Houghton Mifflin Harcourt.",
      "doi": ""
    },
    {
      "text": "Jeffrey P Koplan, Catharyn T Liverman, and Vivica I Kraak. 2005. Preventing childhood obesity: health in the balance: executive summary. Journal of the American Dietetic Association 105, 1 (2005), 131--138.",
      "doi": ""
    },
    {
      "text": "Kathryn Kernodle Loveland and J Gregory Olley. 1979. The effect of external reward on interest and quality of task performance in children of high and low intrinsic motivation. Child Development (1979), 1207--1210.",
      "doi": ""
    },
    {
      "text": "Carsten Magerkurth, Adrian David Cheok, Regan L Mandryk, and Trond Nilsen. 2005. Pervasive games: bringing computer entertainment back to the real world. Computers in Entertainment (CIE) 3, 3 (2005), 4--4.  ",
      "doi": "10.1145/1077246.1077257"
    },
    {
      "text": "Remco Magielse and Panos Markopoulos. 2009. HeartBeat: an outdoor pervasive game for children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2181--2184.  ",
      "doi": "10.1145/1518701.1519033"
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The design space of body games: technological, physical, and social design. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 3365--3374.  ",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Stefano Marzano. 2006. Ambient culture. In True Visions. Springer, 35--52.",
      "doi": ""
    },
    {
      "text": "CHARLES G McCLINTOCK and Steven P McNeel. 1966. Reward and score feedback as determinants of cooperative and competitive game behavior. Journal of Personality and Social Psychology 4, 6 (1966), 606.",
      "doi": ""
    },
    {
      "text": "Pinar Metin. 2003. The efect of traditional playground eqipment design in children's developmental needs. Ph.D. Dissertation. METU.",
      "doi": ""
    },
    {
      "text": "Markus Montola, Jaakko Stenros, and Annika Waern. 2009. Pervasive games: theory and design. Morgan Kaufmann Publishers Inc. ",
      "doi": "10.5555/1717294"
    },
    {
      "text": "Robin C Moore and Herb H Wong. 1997. Natural Learning: The Life of an Environmental Schoolyard. Creating Environments for Rediscovering Nature's Way of Teaching. ERIC.",
      "doi": ""
    },
    {
      "text": "Harri Oinas-Kukkonen and Marja Harjumaa. 2009. Persuasive systems design: Key issues, process model, and system features. Communications of the Association for Information Systems 24, 1 (2009), 28.",
      "doi": ""
    },
    {
      "text": "Mildred B Parten. 1932. Social participation among pre-school children. The Journal of Abnormal and Social Psychology 27, 3 (1932), 243.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, Fred Martin, Robert Berg, Rick Borovoy, Vanessa Colella, Kwin Kramer, and Brian Silverman. 1998. Digital manipulatives: new toys to think with. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., 281--287.  ",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Yvonne Rogers. 2006. Moving on from weiserâ Zs vision of calm computing: Engaging ubicomp experiences. In International conference on Ubiquitous computing. Springer, 404--421.  ",
      "doi": "10.1007/11853565_24"
    },
    {
      "text": "Yvonne Rogers. 2014. Bursting our Digital Bubbles: Life Beyond the App. In Proceedings of the 16th International Conference on Multimodal Interaction. ACM, 1--1.  ",
      "doi": "10.1145/2663204.2669984"
    },
    {
      "text": "James F Sallis, Marilyn F Johnson, Karen J Calfas, Susan Caparosa, and Jeanne F Nichols. 1997. Assessing perceived physical environmental variables that may influence physical activity. Research quarterly for exercise and sport 68, 4 (1997), 345--351.",
      "doi": ""
    },
    {
      "text": "Benjamin A Sibley and Jennifer L Etnier. 2003. The relationship between physical activity and cognition in children: a meta-analysis. Pediatric exercise science 15, 3 (2003), 243--256.",
      "doi": ""
    },
    {
      "text": "Iris Soute and Panos Markopoulos. 2007. Head up games: the games of the future will look more like the games of the past. Human-Computer Interaction--INTERACT 2007 (2007), 404--407. ",
      "doi": "10.5555/1778331.1778375"
    },
    {
      "text": "Iris Soute, Panos Markopoulos, and Remco Magielse. 2010. Head Up Games: combining the best of both worlds by merging traditional and digital play. Personal and Ubiquitous Computing 14, 5 (2010), 435--444.  ",
      "doi": "10.1007/s00779-009-0265-0"
    },
    {
      "text": "Kaveri Subrahmanyam, Robert E Kraut, Patricia M Greenfield, and Elisheva F Gross. 2000. The impact of home computer use on children's activities and development. The future of children (2000), 123--144.",
      "doi": ""
    },
    {
      "text": "Jo Thompson Coon, Kate Boddy, Ken Stein, Rebecca Whear, Joanne Barton, and Michael H Depledge. 2011. Does participating in physical activity in outdoor natural environments have a greater effect on physical and mental wellbeing than physical activity indoors? A systematic review. Environmental science & technology 45, 5 (2011), 1761--1772.",
      "doi": ""
    },
    {
      "text": "A Tsiakara and N Digelidis. 2012. Ways preschool children aged 4--5 years old express their desire to excel. European Psychomotricity Journal 4 (2012), 41--48.",
      "doi": ""
    },
    {
      "text": "Jonathan RH Tudge. 1992. Processes and consequences of peer collaboration: A Vygotskian analysis. Child development 63, 6 (1992), 1364--1379.",
      "doi": ""
    },
    {
      "text": "Catrine Tudor-Locke. 2002. Taking steps toward increased physical activity: Using pedometers to measure and motivate. President's Council on Physical Fitness and Sports Research Digest (2002).",
      "doi": ""
    },
    {
      "text": "Robert J Vallerand, Lise I Gauvin, and Wayne R Halliwell. 1986. Negative effects of competition on children's intrinsic motivation. The Journal of Social Psychology 126, 5 (1986), 649--656.",
      "doi": ""
    },
    {
      "text": "Janneke Verhaegh, Iris Soute, Angelique Kessels, and Panos Markopoulos. 2006. On the design of Camelot, an outdoor game for children. In Proceedings of the 2006 conference on Interaction design and children. ACM, 9--16.  ",
      "doi": "10.1145/1139073.1139082"
    },
    {
      "text": "Hao Wang and Chuen-Tsai Sun. 2011. Game reward systems: Gaming experiences and social meanings.. In DiGRA Conference.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21 st Century. Scientific american 265, 3 (1991), 94--105.",
      "doi": ""
    },
    {
      "text": "Douglas Edward Wilson. 2012. Designing for the Pleasures of Disputation-or-How to make friends by trying to kick them! IT University of Copenhagen, Innovative Communication.",
      "doi": ""
    },
    {
      "text": "Oren Zuckerman and Ayelet Gal-Oz. 2014. Deconstructing gamification: evaluating the effectiveness of continuous measurement, virtual rewards, and social comparison for promoting physical activity. Personal and Ubiquitous Computing 18, 7 (2014), 1705--1719.  ",
      "doi": "10.1007/s00779-014-0783-2"
    }
  ]
}