{
  "doi": "10.1145/3173574.3173779",
  "title": "DeepWriting: Making Digital Ink Editable via Deep Generative Modeling",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Digital ink promises to combine the flexibility and aesthetics of handwriting and the ability to process, search and edit digital text. Character recognition converts handwritten text into a digital representation, albeit at the cost of losing personalized appearance due to the technical difficulties of separating the interwoven components of content and style. In this paper, we propose a novel generative neural network architecture that is capable of disentangling style from content and thus making digital ink editable. Our model can synthesize arbitrary text, while giving users control over the visual appearance (style). For example, allowing for style transfer without changing the content, editing of digital ink at the word level and other application scenarios such as spell-checking and correction of handwritten text. We furthermore contribute a new dataset of handwritten text with fine-grained annotations at the character level and report results from an initial user evaluation.",
  "authors": [
    {
      "name": "Emre Aksan",
      "institution": "ETH Zürich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658662736",
      "orcid": "missing"
    },
    {
      "name": "Fabrizio Pece",
      "institution": "ETH Zürich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81479664130/rel-imgonly/profile_pic.jpg",
      "acmid": "81479664130",
      "orcid": "missing"
    },
    {
      "name": "Otmar Hilliges",
      "institution": "ETH Zürich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81309495440/rel-imgonly/81309495440.jpg",
      "acmid": "81309495440",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Martín Abadi, Ashish Agarwal, Paul Barham, Eugene Brevdo, Zhifeng Chen, Craig Citro, Greg S Corrado, Andy Davis, Jeffrey Dean, Matthieu Devin, and others. 2016. Tensorflow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016).",
      "doi": ""
    },
    {
      "text": "James Arvo and Kevin Novins. 2000. Fluid sketches: continuous recognition and morphing of simple hand-drawn shapes. In Proceedings of the 13th annual ACM symposium on User interface software and technology. ACM, 73--80.  ",
      "doi": "10.1145/354401.354413"
    },
    {
      "text": "James Arvo and Kevin Novins. 2005. Appearance-preserving manipulation of hand-drawn graphs. In Proceedings of the 3rd international conference on Computer graphics and interactive techniques in Australasia and South East Asia. ACM, 61--68.  ",
      "doi": "10.1145/1101389.1101400"
    },
    {
      "text": "Virginia Wise Berninger. 2012. Strengthening the mind's eye: The case for continued handwriting instruction in the 21st century. Principal 91 (2012), 28--31.",
      "doi": ""
    },
    {
      "text": "Ujjwal Bhattacharya, Réjean Plamondon, Souvik Dutta Chowdhury, Pankaj Goyal, and Swapan K Parui. 2017. A sigma-lognormal model-based approach to generating large synthetic online handwriting sample databases. International Journal on Document Analysis and Recognition (IJDAR) (2017), 1--17.  ",
      "doi": "10.1007/s10032-017-0287-5"
    },
    {
      "text": "Peter Brandl, Christoph Richter, and Michael Haller. 2010. NiCEBook: Supporting Natural Note Taking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 599--608.  ",
      "doi": "10.1145/1753326.1753417"
    },
    {
      "text": "A. Buades, B. Coll, and J. M. Morel. 2005. A non-local algorithm for image denoising. In 2005 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR'05), Vol. 2. 60--65.  ",
      "doi": "10.1109/CVPR.2005.38"
    },
    {
      "text": "Hans-Joachim Burgert. 2002. The calligraphic line: thoughts on the art of writing. H.-J. Burgert. Translated by Brody Neuenschwander.",
      "doi": ""
    },
    {
      "text": "Won-Du Chang and Jungpil Shin. 2012. A Statistical Handwriting Model for Style-preserving and Variable Character Synthesis. Int. J. Doc. Anal. Recognit. 15, 1 (March 2012), 1--19.  ",
      "doi": "10.1007/s10032-011-0147-7"
    },
    {
      "text": "Hsin-I Chen, Tse-Ju Lin, Xiao-Feng Jian, I-Chao Shen, and Bing-Yu Chen. 2015. Data-driven Handwriting Synthesis in a Conjoined Manner. Computer Graphics Forum 34, 7 (Oct. 2015), 235--244.  ",
      "doi": "10.1111/cgf.12762"
    },
    {
      "text": "Mauro Cherubini, Gina Venolia, Rob DeLine, and Andrew J. Ko. 2007. Let's Go to the Whiteboard: How and Why Software Developers Use Drawings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 557--566.  ",
      "doi": "10.1145/1240624.1240714"
    },
    {
      "text": "Junyoung Chung, Kyle Kastner, Laurent Dinh, Kratarth Goel, Aaron C. Courville, and Yoshua Bengio. 2015. A Recurrent Latent Variable Model for Sequential Data. CoRR abs/1506.02216 (2015). http://arxiv.org/abs/1506.02216",
      "doi": ""
    },
    {
      "text": "Richard C. Davis, James A. Landay, Victor Chen, Jonathan Huang, Rebecca B. Lee, Frances C. Li, James Lin, Charles B. Morrey, III, Ben Schleimer, Morgan N. Price, and Bill N. Schilit. 1999. NotePals: Lightweight Note Sharing by the Group, for the Group. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 338--345.  ",
      "doi": "10.1145/302979.303107"
    },
    {
      "text": "Johanna Drucker. 1995. The Alphabetic Labyrinth: The Letters in History and Imagination. Thames and Hudson.",
      "doi": ""
    },
    {
      "text": "Yousef Elarian, Radwan Abdel-Aal, Irfan Ahmad, Mohammad Tanvir Parvez, and Abdelmalek Zidouri. 2014. Handwriting Synthesis: Classifications and Techniques. Int. J. Doc. Anal. Recognit. 17, 4 (Dec. 2014), 455--469.  ",
      "doi": "10.1007/s10032-014-0231-x"
    },
    {
      "text": "Salvador Espana-Boquera, Maria Jose Castro-Bleda, Jorge Gorbe-Moya, and Francisco Zamora-Martinez. 2011. Improving Offline Handwritten Text Recognition with Hybrid HMM/ANN Models. Transactions on Pattern Recognition and Machine Intelligence 33, 4 (April 2011), 767--779.  ",
      "doi": "10.1109/TPAMI.2010.141"
    },
    {
      "text": "Evernote Corporation. 2017. How Evernotes image recognition works. http://blog.evernote.com/tech/2013/ 07/18/how-evernotes-image-recognition-works/. (2017). Accessed: 2017-08--10.",
      "doi": ""
    },
    {
      "text": "Alex Graves. 2013. Generating Sequences With Recurrent Neural Networks. CoRR abs/1308.0850 (2013). http://arxiv.org/abs/1308.0850",
      "doi": ""
    },
    {
      "text": "Swaminathan Gurumurthy, Ravi Kiran Sarvadevabhatla, and Venkatesh Babu Radhakrishnan. 2017. DeLiGAN: Generative Adversarial Networks for Diverse and Limited Data. arXiv preprint arXiv:1706.02071 (2017).",
      "doi": ""
    },
    {
      "text": "Tom S.F. Haines, Oisin Mac Aodha, and Gabriel J. Brostow. 2016. My Text in Your Handwriting. In Transactions on Graphics.  ",
      "doi": "10.1145/2886099"
    },
    {
      "text": "Michael Haller, Jakob Leitner, Thomas Seifried, James R. Wallace, Stacey D. Scott, Christoph Richter, Peter Brandl, Adam Gokcezade, and Seth Hunter. 2010. The NiCE Discussion Room: Integrating Paper and Digital Media to Support Co-Located Group Meetings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 609--618.  ",
      "doi": "10.1145/1753326.1753418"
    },
    {
      "text": "Tracy Hammond, Stephanie Valentine, Aaron Adler, and Mark Payton. 2015. The Impact of Pen and Touch Technology on Education (1st ed.). Springer Publishing Company, Incorporated. ",
      "doi": "10.5555/2815658"
    },
    {
      "text": "Ken Hinckley, Michel Pahud, Hrvoje Benko, Pourang Irani, François Guimbretière, Marcel Gavriliu, Xiang 'Anthony' Chen, Fabrice Matulic, William Buxton, and Andrew Wilson. 2014. Sensing Techniques for Tablet+Stylus Interaction. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 605--614.  ",
      "doi": "10.1145/2642918.2647379"
    },
    {
      "text": "Geoffrey Hinton and Vinod Nair. 2005. Inferring Motor Programs from Images of Handwritten Digits. In Proceedings of the 18th International Conference on Neural Information Processing Systems (NIPS'05). MIT Press, Cambridge, MA, USA, 515--522. http://dl.acm.org/citation.cfm?id=2976248.2976313 ",
      "doi": "10.5555/2976248.2976313"
    },
    {
      "text": "Fian Hussain and Borut Zalik. 1999. Towards a feature-based interactive system for intelligent font design. In Information Visualization, 1999. Proceedings. 1999 IEEE International Conference on. 378--383. ",
      "doi": "10.5555/555607.850315"
    },
    {
      "text": "Stig Johansson, Atwell Eric, Garside Roger, and Leech Geoffrey. 1986. The Tagged LOB Corpus: User's Manual. Norwegian Computing Centre for the Humanities, Bergen, Norway.",
      "doi": ""
    },
    {
      "text": "Wolf Kienzle and Ken Hinckley. 2013. Writing Handwritten Messages on a Small Touchscreen. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 179--182.  ",
      "doi": "10.1145/2493190.2493200"
    },
    {
      "text": "Diederik P Kingma and Max Welling. 2013. Auto-Encoding Variational Bayes. In Proceedings of the 2nd International Conference on Learning Representations (ICLR).",
      "doi": ""
    },
    {
      "text": "Donald E. Knuth. 1986. The Metafont Book. Addison-Wesley Longman Publishing Co., Inc., Boston, MA, USA. ",
      "doi": "10.5555/536127"
    },
    {
      "text": "James R. Lewis and Jeff Sauro. 2009. The Factor Structure of the System Usability Scale. In Proceedings of the Human Centered Design: First International Conference (HCD 2009), Masaaki Kurosu (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 94--103.  ",
      "doi": "10.1007/978-3-642-02806-9_12"
    },
    {
      "text": "Marcus Liwicki and Horst Bunke. 2005. IAM-OnDB. An On-Line English Sentence Database Acquired from Handwritten Text on a Whiteboard. In In Proc. 8th Int. Conf. on Document Analysis and Recognition. 956--961.  ",
      "doi": "10.1109/ICDAR.2005.132"
    },
    {
      "text": "Marcus Liwicki, Alex Graves, Horst Bunke, and Jürgen Schmidhuber. 2007. A novel approach to on-line handwriting recognition based on bidirectional long short-term memory networks. In In Proceedings of the 9th International Conference on Document Analysis and Recognition, ICDAR 2007.",
      "doi": ""
    },
    {
      "text": "Jingwan Lu, Fisher Yu, Adam Finkelstein, and Stephen DiVerdi. 2012. HelpingHand: Example-based Stroke Stylization. ACM Trans. Graph. 31, 4, Article 46 (July 2012), 10 pages.  ",
      "doi": "10.1145/2185520.2185542"
    },
    {
      "text": "Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of Machine Learning Research 9, Nov (2008), 2579--2605.",
      "doi": ""
    },
    {
      "text": "Pam A. Mueller and Daniel M. Oppenheimer. 2014. The Pen Is Mightier Than the Keyboard: Advantages of Longhand Over Laptop Note Taking. Psychological Science (2014).",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt, Takeo Igarashi, W. Keith Edwards, and Anthony LaMarca. 1999. Flatland: New Dimensions in Office Whiteboards. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 346--353.  ",
      "doi": "10.1145/302979.303108"
    },
    {
      "text": "MyScript. 2016. MyScript: The Power of Handwriting. http://myscript.com/. (2016). Accessed: 2016--10-04.",
      "doi": ""
    },
    {
      "text": "Gerrit Noordzij. 2005. The stroke : Theory of Writing. London : Hyphen. Translated from the Dutch. ",
      "doi": "10.5555/1213134"
    },
    {
      "text": "Florian Perteneder, Martin Bresler, Eva-Maria Grossauer, Joanne Leong, and Michael Haller. 2015. cLuster: Smart Clustering of Free-Hand Sketches on Large Interactive Surfaces. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA, 37--46.  ",
      "doi": "10.1145/2807442.2807455"
    },
    {
      "text": "Ken Pfeuffer, Ken Hinckley, Michel Pahud, and Bill Buxton. 2017. Thumb + Pen Interaction on Tablets. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3254--3266.  ",
      "doi": "10.1145/3025453.3025567"
    },
    {
      "text": "Réjean Plamondon, Christian O'reilly, Javier Galbally, Abdullah Almaksour, and Éric Anquetil. 2014. Recent developments in the study of rapid human movements with the kinematic theory: Applications to handwriting and signature synthesis. Pattern Recognition Letters 35 (2014), 225--235.",
      "doi": "10.5555/3043802.3043940"
    },
    {
      "text": "Réjean Plamondon and Sargur N. Srihari. 2000. On-Line and Off-Line Handwriting Recognition: A Comprehensive Survey. IEEE Trans. Pattern Anal. Mach. Intell. 22, 1 (Jan. 2000), 63--84.  ",
      "doi": "10.1109/34.824821"
    },
    {
      "text": "Max Albert Eugen Pulver. 1972. Symbolik der Handschrift (New ed.). Kindler, Munich.",
      "doi": ""
    },
    {
      "text": "Yann Riche, Nathalie Henry Riche, Ken Hinckley, Sheri Panabaker, Sarah Fuelling, and Sarah Williams. 2017. As We May Ink?: Learning from Everyday Analog Pen Use to Improve Digital Ink Experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3241--3253.  ",
      "doi": "10.1145/3025453.3025716"
    },
    {
      "text": "Andrew Robinson. 2007. The Story of Writing. Thames & Hudson, London, UK.",
      "doi": ""
    },
    {
      "text": "Mike Schuster and Kuldip K Paliwal. 1997. Bidirectional recurrent neural networks. IEEE Transactions on Signal Processing 45, 11 (1997), 2673--2681.  ",
      "doi": "10.1109/78.650093"
    },
    {
      "text": "Abigail J. Sellen and Richard H.R. Harper. 2003. The Myth of the Paperless Office. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Ariel Shamir and Ari Rappoport. 1998. Feature-based design of fonts using constraints. Springer Berlin Heidelberg, Berlin, Heidelberg, 93--108. ",
      "doi": "10.5555/647506.760425"
    },
    {
      "text": "S Srihari, S Cha, H Arora, and S Lee. 2002. Individuality of Handwriting. Journal of Forensic Sciences 47, 4 (2002), 1--17.",
      "doi": ""
    },
    {
      "text": "Craig J Sutherland, Andrew Luxton-Reilly, and Beryl Plimmer. 2016. Freeform Digital Ink Annotations in Electronic Documents: A Systematic Mapping Study. Computer and Graphics 55, C (Apr 2016), 1--20.  ",
      "doi": "10.1016/j.cag.2015.10.014"
    },
    {
      "text": "Ivan E. Sutherland. 1963. Sketchpad: A Man-machine Graphical Communication System. In Proceedings of the May 21--23, 1963, Spring Joint Computer Conference (AFIPS '63 (Spring)). ACM, New York, NY, USA, 329--346.  ",
      "doi": "10.1145/1461551.1461591"
    },
    {
      "text": "Jue Wang, Chenyu Wu, and Heung-Yeung Xu, Ying-Qing nd Shum. 2005. Combining shape and physical modelsfor online cursive handwriting synthesis. International Journal of Document Analysis and Recognition (IJDAR) 7, 4 (2005), 219--227.  ",
      "doi": "10.1007/s10032-004-0131-6"
    },
    {
      "text": "Jue Wang, Chenyu Wu, Ying-Qing Xu, Heung yeung Shum, and Liang Ji. 2002. Learning-based Cursive Handwriting Synthesis. In in: Proc. Eighth International Workshop on Frontiers of Handwriting Recognition. 157--162. ",
      "doi": "10.5555/851040.856887"
    },
    {
      "text": "Nadir Weibel, Adam Fouse, Colleen Emmenegger, Whitney Friedman, Edwin Hutchins, and James Hollan. 2012. Digital Pen and Paper Practices in Observational Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1331--1340.  ",
      "doi": "10.1145/2207676.2208590"
    },
    {
      "text": "Ben H Williams, Marc Toussaint, and Amos J Storkey. 2007. Modelling Motion Primitives and Their Timing in Biologically Executed Movements. In Proceedings of the 20th International Conference on Neural Information Processing Systems (NIPS'07). Curran Associates Inc., USA, 1609--1616. http://dl.acm.org/citation.cfm?id=2981562.2981764 ",
      "doi": "10.5555/2981562.2981764"
    },
    {
      "text": "Haijun Xia, Ken Hinckley, Michel Pahud, Xiao Tu, and Bill Buxton. 2017. WritLarge: Ink Unleashed by Unified Scope, Action, & Zoom. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3227--3240.  ",
      "doi": "10.1145/3025453.3025664"
    },
    {
      "text": "Dongwook Yoon, Nicholas Chen, and François Guimbretière. 2013. TextTearing: Opening White Space for Digital Ink Annotation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 107--112.  ",
      "doi": "10.1145/2501988.2502036"
    },
    {
      "text": "Dongwook Yoon, Nicholas Chen, François Guimbretière, and Abigail Sellen. 2014. RichReview: Blending Ink, Speech, and Gesture to Support Collaborative Document Review. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 481--490.  ",
      "doi": "10.1145/2642918.2647390"
    },
    {
      "text": "Richard Zanibbi, Kevin Novins, James Arvo, and Katherine Zanibbi. 2001. Aiding manipulation of handwritten mathematical expressions through style-preserving morphs. (2001).",
      "doi": ""
    },
    {
      "text": "Bin Zhang, Sargur N. Srihari, and Sangjik Lee. 2003. Individuality of Handwritten Characters. In In Proc. 7th Int. Conf. on Document Analysis and Recognition. 1086--1090. ",
      "doi": "10.5555/938980.939484"
    },
    {
      "text": "C. Lawrence Zitnick. 2013. Handwriting Beautification Using Token Means. ACM Trans. Graph. 32, 4, Article 53 (July 2013), 8 pages.  ",
      "doi": "10.1145/2461912.2461985"
    }
  ]
}