{
  "doi": "10.1145/3173574.3174100",
  "title": "Transforming Last-mile Logistics: Opportunities for more Sustainable Deliveries",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Road congestion, air pollution and sustainability are increasingly important in major cities. We look to understand how last-mile deliveries in the parcel sector are impacting our roads. Using formative field work and quantitative analysis of consignment manifests and location data, we identify how the effectiveness of life-style couriers is contributing to both environmental and non-environmental externalities. This paper presents an analysis of delivery performances and practices in last-mile logistics in central London, quantifying the impacts differing levels of experience have on overall round efficiency. We identify eleven key opportunities for technological support for last-mile parcel deliveries that could contribute to both driver effectiveness and sustainability. We finish by examining how HCI can lead to improved environmental and social justice by re-considering and realizing future collaborative visions in last-mile logistics.",
  "tags": [
    "logistics infrastructure",
    "gig-economy",
    "life-style couriers",
    "on-demand economy",
    "environmental and social justice",
    "mixed-methods",
    "e-commerce",
    "last-mile logistics",
    "smart city",
    "sustainability",
    "parcel sector"
  ],
  "authors": [
    {
      "name": "Oliver Bates",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/do/10.1145/contrib-81556332556/rel-imgonly/oliver_bates_bw.jpg",
      "acmid": "81556332556",
      "orcid": "missing"
    },
    {
      "name": "Adrian Friday",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533743",
      "orcid": "missing"
    },
    {
      "name": "Julian Allen",
      "institution": "University of Westminster, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261308",
      "orcid": "missing"
    },
    {
      "name": "Tom Cherrett",
      "institution": "University of Southampton, Southampton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490657798",
      "orcid": "missing"
    },
    {
      "name": "Fraser McLeod",
      "institution": "University of Southampton, Southampton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260844",
      "orcid": "missing"
    },
    {
      "name": "Tolga Bektas",
      "institution": "University of Southampton, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324487996",
      "orcid": "missing"
    },
    {
      "name": "ThuBa Nguyen",
      "institution": "University of Southampton, Southampton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261683",
      "orcid": "missing"
    },
    {
      "name": "Maja Piecyk",
      "institution": "University of Westminster, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261685",
      "orcid": "missing"
    },
    {
      "name": "Marzena Piotrowska",
      "institution": "University of Westminster, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260350",
      "orcid": "missing"
    },
    {
      "name": "Sarah Wise",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261076",
      "orcid": "missing"
    },
    {
      "name": "Nigel Davies",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/do/10.1145/contrib-81100185417/rel-imgonly/nigel.jpg",
      "acmid": "81100185417",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. S., Dachtera, J., Pipek, V., and Wulf, V. Sharing knowledge and expertise: The CSCW view of knowledge management. Computer Supported Cooperative Work (CSCW) 22, 4 (Aug 2013), 531--573.  ",
      "doi": "10.1007/s10606-013-9192-8"
    },
    {
      "text": "Allen, J., Piecyk, M., and Piotrowska, M. An analysis of the parcels market and parcel carriers' operations in the UK, 2015. http://www.ftc2050.com/reports/ westminster parcels final Dec 2016.pdf, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Allen, J., Piecyk, M., Piotrowska, M., McLeod, F., Cherrett, T., Ghali, K., Nguyen, T., Bektas, T., Bates, O., Friday, A., Wise, S., and Austwick, M. Understanding the impact of e-commerce on last-mile light goods vehicle activity in urban areas: The case of london. Transportation Research Part D: Transport and Environment (2017), --.",
      "doi": ""
    },
    {
      "text": "Aloisi, A. Commoditized workers: Case study research on labor law issues arising from a set of on-demand/gig economy platforms. Comp. Lab. L.&Pol'y J. 37 (2015), 653.",
      "doi": ""
    },
    {
      "text": "Anderson, S., Allen, J., and Browne, M. Urban logistics--how can it meet policy makers' sustainability objectives? Journal of Transport Geography 13, 1 (2005), 71 -- 81. Sustainability and the Interaction Between External Effects of Transport (Part Special Issue, pp. 23--99).",
      "doi": ""
    },
    {
      "text": "Arita, S., Hiyama, A., and Hirose, M. Gber: A social matching app which utilizes time, place, and skills of workers and jobs. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW '17 Companion, ACM (New York, NY, USA, 2017), 127--130.  ",
      "doi": "10.1145/3022198.3026316"
    },
    {
      "text": "Attanasio, A., Bregman, J., Ghiani, G., and Manni, E. Real-Time Fleet Management At Ecourier Ltd. Springer US, Boston, MA, 2007, 219--238.",
      "doi": ""
    },
    {
      "text": "Bates, O., Knowles, B., and Friday, A. Are people the key to enabling collaborative smart logistics? In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems, CHI EA '17, ACM (New York, NY, USA, 2017), 1494--1499.  ",
      "doi": "10.1145/3027063.3053128"
    },
    {
      "text": "Bates, O., Lord, C., Knowles, B., Clear, A. K., Hazas, M., and Friday, A. Exploring (un)sustainable growth of digital technologies in the home. In Proc of ICT for Sustainability (2015).",
      "doi": ""
    },
    {
      "text": "Bates, O., Thomas, V., and Remy, C. Doing Good in HCI: Can We Broaden Our Agenda interactions 24, 5 (Aug. 2017), 80--82.  ",
      "doi": "10.1145/3121386"
    },
    {
      "text": "Baudel, T., Dablanc, L., Alguiar-Melgarejo, P., and Ashton, J. Optimizing urban freight deliveries: From designing and testing a prototype system to addressing real life challenges. Transportation Research Procedia (2016), 170 -- 180. Tenth International Conference on City Logistics 17--19 June 2015, Tenerife, Spain.",
      "doi": ""
    },
    {
      "text": "Berg, J., Colclough, C., Dewhurst, M., Gearhart, D., Graham, M., Jennings, P., McClenahan, G., Scholz, T., Shaw, J., Silberman, S. M., Srnicek, N., and Stefano, V. D. Towards a Farier Gig Economy. Meatspace Press (2017), 2017.",
      "doi": ""
    },
    {
      "text": "Bonanni, L., Hockenberry, M., Zwarg, D., Csikszentmihalyi, C., and Ishii, H. Small business applications of sourcemap: A web tool for sustainable design and supply chain transparency. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, ACM (New York, NY, USA, 2010), 937--946.  ",
      "doi": "10.1145/1753326.1753465"
    },
    {
      "text": "Bothos, E., Apostolou, D., and Mentzas, G. Choice architecture for environmentally sustainable urban mobility. In CHI '13 Extended Abstracts on Human Factors in Computing Systems, CHI EA '13, ACM (New York, NY, USA, 2013), 1503--1508.  ",
      "doi": "10.1145/2468356.2468624"
    },
    {
      "text": "Brynjarsd´ ottir, H., Hakansson, M., Pierce, J., Baumer, E. P., DiSalvo, C., and Sengers, P. Sustainably unpersuaded: How persuasion narrows our vision of sustainability. In Proc. of CHI (2012).  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Castellani, S., Grasso, A., Williamowski, J., Martin, D., Gajera, R., and Mudliar, P. Supporting sustainable mobility with the help of work organizations: Preliminary requirements and future work. In Proceedings of the India HCI 2014 Conference on Human Computer Interaction, IndiaHCI '14, ACM (New York, NY, USA, 2014), 90:90--90:95.  ",
      "doi": "10.1145/2676702.2676712"
    },
    {
      "text": "Chen, M. K. Dynamic Pricing in a Labor Market: Surge Pricing and Flexible Work on the Uber Platform. In Proceedings of the 2016 ACM Conference on Economics and Computation, EC '16, ACM (New York, NY, USA, 2016), 455--455.  ",
      "doi": "10.1145/2940716.2940798"
    },
    {
      "text": "Chestney, N. UK electric car plan could cause huge infrastructure costs in efforts to steer clear of power shortages, The Independent, 2017. http: //www.independent.co.uk/news/business/news/uk-electriccar-plan-infrastructure-costs-power-shortages-petrolvehicles-end-diesel-ban-a7923496.html, (accessed, December, 2017).",
      "doi": ""
    },
    {
      "text": "Consultancy.uk. Parcel delivery sector in a squeeze, say consultants, January 6 2015. http://www.consultancy.uk/news/1291/parcel-deliverysector-in-a-squeeze-say-consultants, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Crabtree, A., and Chamberlain, A. Making It \"Pay a Bit Better\": Design Challenges for Micro Rural Enterprise. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work&Social Computing, CSCW '14, ACM (New York, NY, USA, 2014), 687--696.  ",
      "doi": "10.1145/2531602.2531618"
    },
    {
      "text": "Crabtree, A., Chamberlain, A., Valchovska, S., Davies, M., Glover, K., and Greenhalgh, C. \"I've Got a Sheep with Three Legs if Anybody Wants It?\": Re-visioning the Rural Economy. Personal Ubiquitous Comput. 19, 8 (Dec. 2015), 1247--1258.  ",
      "doi": "10.1007/s00779-015-0890-8"
    },
    {
      "text": "Davies, R., and Butler, S. UK workers earning £2.50 an hour prompts call for government action, The Guardian, July 6 2017. https://www.theguardian.com/business/2017/jul/06/ukworkers-poverty-pay-gig-economy-frank-field-report, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Delling, D., Goldberg, A. V., Goldszmidt, M., Krumm, J., Talwar, K., and Werneck, R. F. Navigation made personal: Inferring driving preferences from gps traces. In Proceedings of the 23rd SIGSPATIAL International Conference on Advances in Geographic Information Systems, SIGSPATIAL '15, ACM (New York, NY, USA, 2015), 31:1--31:9.  ",
      "doi": "10.1145/2820783.2820808"
    },
    {
      "text": "Department for Transport. Transport Statistics Great Britain 2016, 2016.",
      "doi": ""
    },
    {
      "text": "Dillahunt, T. R., Kameswaran, V., Li, L., and Rosenblat, T. Uncovering the values and constraints of real-time ridesharing for low-resource populations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, CHI '17, ACM (New York, NY, USA, 2017), 2757--2769.  ",
      "doi": "10.1145/3025453.3025470"
    },
    {
      "text": "Dunn, C. Delivery the key to growing online retail, The Guardian, April 17, 2013, 2013. https://www.theguardian.com/sustainable-business/ delivery-key-growing-online-retail, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Eames, M., Dixon, T. J., Hunt, M., Lannon, S., et al. Retrofitting cities for tomorrow's world, 2017.",
      "doi": ""
    },
    {
      "text": "Edwards, J., McKinnon, A., and Cullinane, S. Carbon auditing the 'last mile': modelling the environmental impacts of conventional and online non-food shopping. Green Logistics Report, Heriot-Watt University (2009).",
      "doi": ""
    },
    {
      "text": "European Parliament. Policy Department A on Economic and Scientific Policy: The Situation of Workers in the Collaborative Economy, European Parliament., 2016. http://www.europarl.europa.eu/RegData/etudes/IDAN/2016/ 587316/IPOL IDA(2016)587316 EN.pdf,(accessed, Sept. 2017).",
      "doi": ""
    },
    {
      "text": "Feng, R. Startup What3words Aims To Give Billions Of People One Thing They Don't Have: An Address, Forbes Asia, June 11 2016. https://www.forbes.com/sites/rebeccafeng/2016/06/11/ new-company-aims-to-give-billions-of-people-onething-they-dont-have-an-address/#5bc364382b3c, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Fox, S., Asad, M., Lo, K., Dimond, J. P., Dombrowski, L. S., and Bardzell, S. Exploring Social Justice, Design, and HCI. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, CHI EA '16, ACM (New York, NY, USA, 2016), 3293--3300.  ",
      "doi": "10.1145/2851581.2856465"
    },
    {
      "text": "Froehlich, J., Dillahunt, T., Klasnja, P., Mankoff, J., Consolvo, S., Harrison, B., and Landay, J. A. Ubigreen: Investigating a mobile tool for tracking and supporting green transportation habits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '09, ACM (New York, NY, USA, 2009), 1043--1052.  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Gabrielli, S., Maimone, R., Forbes, P., Masthoff, J., Wells, S., Primerano, L., Haverinen, L., Bo, G., and Pompa, M. Designing motivational features for sustainable urban mobility. In CHI '13 Extended Abstracts on Human Factors in Computing Systems, CHI EA '13, ACM (New York, NY, USA, 2013), 1461--1466.  ",
      "doi": "10.1145/2468356.2468617"
    },
    {
      "text": "Ganti, R. K., Pham, N., Ahmadi, H., Nangia, S., and Abdelzaher, T. F. Greengps: A participatory sensing fuel-efficient maps application. In Proceedings of the 8th International Conference on Mobile Systems, Applications, and Services, MobiSys '10, ACM (New York, NY, USA, 2010), 151--164.  ",
      "doi": "10.1145/1814433.1814450"
    },
    {
      "text": "Gl¨ oss, M., McGregor, M., and Brown, B. Designing for labour: Uber and the on-demand mobile workforce. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, CHI '16, ACM (New York, NY, USA, 2016), 1632--1643.  ",
      "doi": "10.1145/2858036.2858476"
    },
    {
      "text": "Goulden, M., Ryley, T., and Dingwall, R. Beyond 'predict and provide': UK transport, the growth paradigm and climate change. Transport Policy 32 (2014), 139 -- 147.",
      "doi": ""
    },
    {
      "text": "Graham, M., Hjorth, I., and Lehdonvirta, V. Digital labour and development: impacts of global digital labour platforms and the gig economy on worker livelihoods. Transfer: European Review of Labour and Research 23, 2 (2017), 135--162.",
      "doi": ""
    },
    {
      "text": "Greasley, A., and Assi, A. Improving \"last mile\" delivery performance to retailers in hub and spoke distribution systems. Journal of Manufacturing Technology Management 23, 6 (2012), 794--805.",
      "doi": ""
    },
    {
      "text": "Gruber, J., Kihm, A., and Lenz, B. A new vehicle for urban freight? an ex-ante evaluation of electric cargo bikes in courier services. Research in Transportation Business&Management 11 (2014), 53--62.",
      "doi": ""
    },
    {
      "text": "Haidinger, B. On the move in global delivery chains: Labour relations and working conditions in the parcel delivery industries of Austria, Germany, the Czech Republic and Hungary. SODIPER Synthesis Report. Vienna: FORBA-Working Life Research Centre (2012).",
      "doi": ""
    },
    {
      "text": "Håkansson, M., and Sengers, P. No easy compromise: Sustainability and the dilemmas and dynamics of change. In Proceedings of the 2014 Conference on Designing Interactive Systems, DIS '14, ACM (New York, NY, USA, 2014), 1025--1034.  ",
      "doi": "10.1145/2598510.2598569"
    },
    {
      "text": "Hann´ ak, A., Wagner, C., Garcia, D., Mislove, A., Strohmaier, M., and Wilson, C. Bias in Online Freelance Marketplaces: Evidence from TaskRabbit and Fiverr. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW '17, ACM (New York, NY, USA, 2017), 1914--1933.  ",
      "doi": "10.1145/2998181.2998327"
    },
    {
      "text": "Harris, I., Wang, Y., and Wang, H. ICT in multimodal transport and technological trends: Unleashing potential for the future. International Journal of Production Economics 159 (2015), 88 -- 103.",
      "doi": ""
    },
    {
      "text": "Hasselqvist, H., Hesselgren, M., and Bogdan, C. Challenging the Car Norm: Opportunities for ICT to Support Sustainable Transportation Practices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, CHI '16, ACM (New York, NY, USA, 2016), 1300--1311.  ",
      "doi": "10.1145/2858036.2858468"
    },
    {
      "text": "Horvitz, E., and Krumm, J. Some help on the way: Opportunistic routing under uncertainty. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing, UbiComp '12, ACM (New York, NY, USA, 2012), 371--380.  ",
      "doi": "10.1145/2370216.2370273"
    },
    {
      "text": "Ikkala, T., and Lampinen, A. Monetizing Network Hospitality: Hospitality and Sociability in the Context of Airbnb. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing, CSCW '15, ACM (New York, NY, USA, 2015), 1033--1044.  ",
      "doi": "10.1145/2675133.2675274"
    },
    {
      "text": "Jack, M., and Jackson, S. J. Logistics as care and control: An investigation into the unicef supply division. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, CHI '16, ACM (New York, NY, USA, 2016), 2209--2219.  ",
      "doi": "10.1145/2858036.2858503"
    },
    {
      "text": "Ji, S., Zheng, Y., and Li, T. Urban sensing based on human mobility. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, UbiComp '16, ACM (New York, NY, USA, 2016), 1040--1051.  ",
      "doi": "10.1145/2971648.2971735"
    },
    {
      "text": "Kasera, J., O'Neill, J., and Bidwell, N. J. Sociality, Tempo&Flow: Learning from Namibian Ridesharing. In Proceedings of the First African Conference on Human Computer Interaction, AfriCHI'16, ACM (New York, NY, USA, 2016), 36--47.  ",
      "doi": "10.1145/2998581.2998582"
    },
    {
      "text": "Kim, G. D., and Eune, J. Sustainable transport system: A wheel based interactive information installation. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, CHI EA '15, ACM (New York, NY, USA, 2015), 375--378.  ",
      "doi": "10.1145/2702613.2725448"
    },
    {
      "text": "Kittur, A., Nickerson, J. V., Bernstein, M., Gerber, E., Shaw, A., Zimmerman, J., Lease, M., and Horton, J. The future of crowd work. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work, CSCW '13, ACM (New York, NY, USA, 2013), 1301--1318.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Kuutti, K., and Bannon, L. J. The turn to practice in HCI: towards a research agenda. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM (2014), 3543--3552.  ",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Last Mile Logistics (LaMiLo). Smart City Logistics: innovative mapping platform for urban freight planning, 2014. http//www.lamiloproject.eu/smart-city-logistics/, (accessed Sept. 2017.).",
      "doi": ""
    },
    {
      "text": "Lee, H., Lee, W., and Lim, Y.-K. The effect of eco-driving system towards sustainable driving behavior. In CHI '10 Extended Abstracts on Human Factors in Computing Systems, CHI EA '10, ACM (New York, NY, USA, 2010), 4255--4260.  ",
      "doi": "10.1145/1753846.1754135"
    },
    {
      "text": "Manning, E. Why retailers stop selling online: the hidden cost of e-commerce, The Guardian, December 15 2016. https://www.theguardian.com/small-businessnetwork/2016/dec/15/hidden-cost-e-commerce-onlineshopping-entrepreneurs, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "McGrath, M. Four major cities move to ban diesel vehicles by 2025, BBC, 2016. http://www.bbc.co.uk/news/science-environment-38170794, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "McInnis, B., Cosley, D., Nam, C., and Leshed, G. Taking a hit: Designing around rejection, mistrust, risk, and workers' experiences in amazon mechanical turk. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, CHI '16, ACM (New York, NY, USA, 2016), 2271--2282.  ",
      "doi": "10.1145/2858036.2858539"
    },
    {
      "text": "Mintel. Mintel (2016) Online Retailing -- UK, July, 2016.",
      "doi": ""
    },
    {
      "text": "Neate, R. Sports Direct challenged by MPs over claims it underpays couriers, The Guardian, September 14 2017. https://www.theguardian.com/business/2017/sep/14/ sports-direct-challenged-by-mps-over-claims-itunderpays-couriers?CMP=Share iOSApp Other, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "O'Conner, S. UK tries to tackle 'gig economy' conundrum, Financial Times, July 11, 2017, 2017. https://www.ft.com/content/cdd95ffa-664a-11e7--9a6693fb352ba1fe, (accessed, Dec., 2017).",
      "doi": ""
    },
    {
      "text": "Office for National Statistics (ONS). Retail sales index internet sales, ONS, 2016.",
      "doi": ""
    },
    {
      "text": "Pace, T., Ramalingam, S., and Roedl, D. Celerometer and idling reminder: Persuasive technology for school bus eco-driving. In CHI '07 Extended Abstracts on Human Factors in Computing Systems, CHI EA '07, ACM (New York, NY, USA, 2007), 2085--2090.  ",
      "doi": "10.1145/1240866.1240954"
    },
    {
      "text": "Parigi, P., and Ma, X. The gig economy. XRDS 23, 2 (Dec. 2016), 38--41.  ",
      "doi": "10.1145/3013496"
    },
    {
      "text": "Pierce, J., Brynjarsdottir, H., Sengers, P., and Strengers, Y. Everyday practice and sustainable HCI: understanding and learning from cultures of (un)sustainability. In Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems, CHI EA '11 (2011), 9--12.  ",
      "doi": "10.1145/1979742.1979583"
    },
    {
      "text": "Pooler, M. Online orders boost UK parcel market, Financial Times, Jan 5, 2016, 2017. https://www.ft.com/ content/85c03ea8-b3ab-11e5-b147-e5e5bba42e51, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Preist, C., Schien, D., and Blevis, E. Understanding and Mitigating the Effects of Device and Cloud Service Design Decisions on the Environmental Footprint of Digital Infrastructure. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, CHI '16, ACM (New York, NY, USA, 2016), 1324--1337.  ",
      "doi": "10.1145/2858036.2858378"
    },
    {
      "text": "Pritchard, G., Vines, J., Briggs, P., Thomas, L., and Olivier, P. Digitally Driven: How Location Based Services Impact the Work Practices of London Bus Drivers. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, CHI '14, ACM (New York, NY, USA, 2014), 3617--3626.  ",
      "doi": "10.1145/2556288.2557156"
    },
    {
      "text": "Pritchard, G., Vines, J., and Olivier, P. Your Money's No Good Here: The Elimination of Cash Payment on London Buses. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (New York, NY, USA, 2015), 907--916.  ",
      "doi": "10.1145/2702123.2702137"
    },
    {
      "text": "Pritchard, G. W., Briggs, P., Vines, J., and Olivier, P. How to Drive a London Bus: Measuring Performance in a Mobile and Remote Workplace. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (New York, NY, USA, 2015), 1885--1894.  ",
      "doi": "10.1145/2702123.2702307"
    },
    {
      "text": "Raghavan, B., and Pargman, D. Means and Ends in Human-Computer Interaction: Sustainability Through Disintermediation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, CHI '17, ACM (New York, NY, USA, 2017), 786--796.  ",
      "doi": "10.1145/3025453.3025542"
    },
    {
      "text": "Reddy, S., Shilton, K., Denisov, G., Cenizal, C., Estrin, D., and Srivastava, M. Biketastic: Sensing and mapping for better biking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, ACM (New York, NY, USA, 2010), 1817--1820.  ",
      "doi": "10.1145/1753326.1753598"
    },
    {
      "text": "Rogers, Y., Sharp, H., and Preece, J. Interaction design: beyond human-computer interaction. John Wiley&Sons, 2011. ",
      "doi": "10.5555/2031622"
    },
    {
      "text": "Røpke, I., and Christensen, T. H. Energy impacts of ICT -- insights from an everyday life perspective. Telematics and Informatics 29, 4 (2012).  ",
      "doi": "10.1016/j.tele.2012.02.001"
    },
    {
      "text": "Salehi, N., Irani, L. C., Bernstein, M. S., Alkhatib, A., Ogbe, E., Milland, K., and Clickhappier. We are dynamo: Overcoming stalling and friction in collective action for crowd workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (New York, NY, USA, 2015), 1621--1630.  ",
      "doi": "10.1145/2702123.2702508"
    },
    {
      "text": "Sawers, P. Mercedes-Benz will use What3words geocoding system to help drivers navigate to any point on Earth, VentureBeat, September 11 2017. https://venturebeat.com/2017/09/11/mercedes-benz-willuse-what3words-geocoding-system-to-help-driversnavigate-to-any-point-on-earth/, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Schuessler, N., and Axhausen, K. Processing raw data from global positioning systems without additional information. Transportation Research Record: Journal of the Transportation Research Board 2105 (2009), 28--36.",
      "doi": ""
    },
    {
      "text": "Shove, E., Trentmann, F., and Wilk, R. Time, consumption and everyday life: practice, materiality and culture. Berg, 2009.",
      "doi": ""
    },
    {
      "text": "Stein, M., Meurer, J., Boden, A., and Wulf, V. Mobility in later life: Appropriation of an integrated transportation platform. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, CHI '17, ACM (New York, NY, USA, 2017), 5716--5729.  ",
      "doi": "10.1145/3025453.3025672"
    },
    {
      "text": "Teodoro, R., Ozturk, P., Naaman, M., Mason, W., and Lindqvist, J. The motivations and experiences of the on-demand mobile workforce. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, CSCW '14, ACM (New York, NY, USA, 2014), 236--247.  ",
      "doi": "10.1145/2531602.2531680"
    },
    {
      "text": "The Taylor Review. Good Work: The Taylor Review of Modern Working Practices, 2017. https://www.thersa.org/globalassets/pdfs/reports/goodwork-taylor-review-into-modern-working-practices.pdf, (accessed, Sept. 2017).",
      "doi": ""
    },
    {
      "text": "Thebault-Spieker, J., Terveen, L., and Hecht, B. Toward a Geographic Understanding of the Sharing Economy: Systemic Biases in UberX and TaskRabbit. ACM Trans. Comput.-Hum. Interact. 24, 3 (Apr. 2017), 21:1--21:40.  ",
      "doi": "10.1145/3058499"
    },
    {
      "text": "Thomas, V., Remy, C., Hazas, M., and Bates, O. HCI and environmental public policy: opportunities for engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM (2017), 6986--6992.  ",
      "doi": "10.1145/3025453.3025579"
    },
    {
      "text": "Twentyman, J. Delivery charges cost online retailers dear, Financial Times, November 18, 2015, 2015. https://www.ft.com/content/fd88f556--70bc-11e5--9b9e690fdae72044, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "United Nations. Sustainable development goals, 2017. http://www.un.org/sustainabledevelopment/sustainabledevelopment-goals/, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Vaughan, A. Sadiq Khan to more than double size of London's clean air zone, The Guardian, May 13 2016. https: //www.theguardian.com/environment/2016/may/13/sadiqkhan-to-double-size-londons-clean-air-zone-pollution, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Visser, J., Nemoto, T., and Browne, M. Home delivery and the impacts on urban freight transport: A review. Procedia-social and behavioral sciences 125 (2014), 15--27.",
      "doi": ""
    },
    {
      "text": "Wang, D. HCI, Policy and the Smart City. In Proceedings of the 30th International BCS Human Computer Interaction Conference: Fusion!, HCI '16, BCS Learning&Development Ltd. (Swindon, UK, 2016), 35:1--35:10.  ",
      "doi": "10.14236/ewic/HCI2016.35"
    },
    {
      "text": "what3words. what3words -- Addressing the World, 2017. http://what3words.com, (accessed Sept. 2017).",
      "doi": ""
    },
    {
      "text": "Work and Pensions Committee. Self-employment and the gig economy inquiry, 2017, 2017. https:// www.parliament.uk/business/committees/committees-a-z/ commons-select/work-and-pensions-committee/inquiries/ parliament-2015/self-employment-gig-economy-16--17/, (accessed, Dec. 2017).",
      "doi": ""
    },
    {
      "text": "Zanni, A. M., and Bristow, A. L. Emissions of CO2 from road freight transport in London: Trends and policies for long run reductions. Energy Policy 38, 4 (2010), 1774 -- 1786. Energy Security - Concepts and Indicators with regular papers.",
      "doi": ""
    }
  ]
}