{
  "doi": "10.1145/3173574.3173780",
  "title": "Media of Things: Supporting the Production of Metadata Rich Media Through IoT Sensing",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Rich metadata is becoming a key part of the broadcast production pipeline. This information can be used to deliver compelling new consumption experiences which are personalized, location-aware, interactive and multi-screen. However, media producers are struggling to generate the metadata required for such experiences, using inefficient post-production solutions which are limited in how much of the original context they can capture. In response, we present Media of Things (MoT), a tool for on-location media productions. MoT enables practical and flexible generation of sensor based point-of-capture metadata. We demonstrate how embedded ubiquitous sensing technologies such as the Internet of Things can be leveraged to produce context rich, time sequenced metadata in a production studio. We reflect on how this workflow can be integrated within the constraints of broadcast production and the possibilities that emerge from access to rich data at the beginning of the production lifecycle to produce well described media for reconfigurable consumption.",
  "authors": [
    {
      "name": "Gerard Wilkinson",
      "institution": "Newcastle University & British Broadcasting Corporation, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-99659021633/rel-imgonly/171423ad995c010ec17eddb1ec24e4ce.jpeg",
      "acmid": "99659021633",
      "orcid": "missing"
    },
    {
      "name": "Tom Bartindale",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81416597993/rel-imgonly/81416597993.jpg",
      "acmid": "81416597993",
      "orcid": "0000-0002-0476-3422"
    },
    {
      "name": "Tom Nappey",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959298457",
      "orcid": "missing"
    },
    {
      "name": "Michael Evans",
      "institution": "British Broadcasting Corporation, Salford, Greater Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502693289",
      "orcid": "missing"
    },
    {
      "name": "Peter Wright",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "J. Assfalg, M. Bertini, C. Colombo, A.D. Bimbo, and W. Nunziati. Automatic extraction and annotation of soccer video highlights. In Proceedings 2003 International Conference on Image Processing (Cat. No.03CH37429), II-527--30.",
      "doi": ""
    },
    {
      "text": "August. August Smart Lock. Retrieved from http://august.com/products/august-smart-lock/",
      "doi": ""
    },
    {
      "text": "Kobus Barnard, Pinar Duygulu, David Forsyth, Nando de Freitas, David M. Blei, and Michael I. Jordan. 2003. Matching Words and Pictures. Journal of Machine Learning Research 3, Feb: 1107--1135. ",
      "doi": "10.5555/944919.944965"
    },
    {
      "text": "Tom Bartindale, Daniel Jackson, Karim Ladha, Sebastian Mellor, Patrick Olivier, and Peter Wright. 2014. RedTag. In Proceedings of the 2014 ACM international conference on Interactive experiences for TV and online video - TVX '14, 19--22.  ",
      "doi": "10.1145/2602299.2602303"
    },
    {
      "text": "Tom Bartindale, Guy Schofield, and Peter Wright. 2016. Scaffolding Community Documentary Film Making using Commissioning Templates. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 2705-- 2716.  ",
      "doi": "10.1145/2858036.2858102"
    },
    {
      "text": "Tom Bartindale, Guy Schofield, Peter C Wright, and Peter Wright. 2016. TryFilm: Situated Support for Interactive Media Productions. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing - CSCW '16, 1410--1420.  ",
      "doi": "10.1145/2818048.2819929"
    },
    {
      "text": "BBC R&D. Nearly Live Production. Retrieved from http://www.bbc.co.uk/rd/projects/nearly-liveproduction",
      "doi": ""
    },
    {
      "text": "BlackBerry IoT. Internet of Things -- Asset Tracking. Retrieved from http://uk.blackberry.com/internetof-things/platform/application-modules/verticalapplications/asset-tracking.html",
      "doi": ""
    },
    {
      "text": "Pablo Cesar, Dick C A Bulterman, and A. J. Jansen. 2008. Usages of the secondary screen in an interactive television environment: Control, enrich, share, and transfer television content. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 168--177.  ",
      "doi": "10.1007/978-3-540-69478-6_22"
    },
    {
      "text": "Pablo Cesar and Konstantinos Chorianopoulos. 2007. The Evolution of TV Systems, Content, and Users Toward Interactivity. Foundations and Trends® in Human-Computer Interaction 2, 4: 373-- 95.  ",
      "doi": "10.1561/1100000008"
    },
    {
      "text": "A. Churnside, M.E.F. Melchior, M. Armstrong, M. Shotton, and M. Brooks. 2014. Object-based broadcasting - curation, responsiveness and user experience. In International Broadcasting Convention (IBC) 2014 Conference, 12.2--12.2.",
      "doi": ""
    },
    {
      "text": "Tony Churnside. Object-Based Broadcasting - BBC R&D. Retrieved from http://www.bbc.co.uk/rd/blog/2013/05/objectbased-approach-to-broadcasting",
      "doi": ""
    },
    {
      "text": "Jasmine Cox, Rhianne Jones, Chris Northwood, Jonathan Tutcher, and Ben Robinson. 2017. ObjectBased Production. In Adjunct Publication of the 2017 ACM International Conference on Interactive Experiences for TV and Online Video - TVX '17 Adjunct, 79--80.  ",
      "doi": "10.1145/3084289.3089912"
    },
    {
      "text": "Deloitte University Press. The Internet of Things in the oil and gas industry. Retrieved from http://dupress.deloitte.com/dup-usen/focus/internet-of-things/iot-in-oil-and-gasindustry.html",
      "doi": ""
    },
    {
      "text": "Boon-lock Yeo, Minerva Yeung, Bede Liu Dennis Yow. Analysis And Presentation Of Soccer Highlights From Digital Video. Retrieved June 2, 2016 from http://citeseerx.ist.psu.edu/viewdoc/summary?doi= 10.1.1.50.24",
      "doi": ""
    },
    {
      "text": "P. Duygulu, K. Barnard, J. F. G. de Freitas, and D. A. Forsyth. 2002. Object Recognition as Machine Translation: Learning a Lexicon for a Fixed Image Vocabulary.. Springer Berlin Heidelberg, 97--112. ",
      "doi": "10.5555/645318.649254"
    },
    {
      "text": "Facebook. Facebook Live. Retrieved from https://live.fb.com/",
      "doi": ""
    },
    {
      "text": "Google Cloud Platform. Vision API - Image Content Analysis. Retrieved from https://cloud.google.com/vision/",
      "doi": ""
    },
    {
      "text": "Pam Hanley and Rachel Viney. 2001. Pressing the red button: Consumers and digital television. Cultural Trends 11, 43--44: 35--60.",
      "doi": ""
    },
    {
      "text": "Jesse Hoey, Thomas Plötz, Dan Jackson, Andrew Monk, Cuong Pham, and Patrick Olivier. 2011. Rapid specification and automated generation of prompting systems to assist people with dementia. Pervasive and Mobile Computing 7, 3: 299--318.  ",
      "doi": "10.1016/j.pmcj.2010.11.007"
    },
    {
      "text": "Clare J. Hooper, Patrick Olivier, Anne Preston, Madeline Balaam, Paul Seedhouse, Daniel Jackson, Cuong Pham, Cassim Ladha, Karim Ladha, and Thomas Plötz. 2012. The french kitchen. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing - UbiComp '12, 193.",
      "doi": "10.1145/2370216.2370246"
    },
    {
      "text": "Chuanping Hu, Zheng Xu, Yunhuai Liu, and Lin Mei. 2015. Video structural description technology for the new generation video surveillance systems. Frontiers of Computer Science 9, 6: 980--989.  ",
      "doi": "10.1007/s11704-015-3482-x"
    },
    {
      "text": "Rene Kaiser, Marcus Thaler, Andreas Kriechbaum, Hannes Fassold, Werner Bailer, and Jakub Rosner. 2011. Real-time Person Tracking in High-resolution Panoramic Video for Automated Broadcast Production. In 2011 Conference for Visual Media Production, 21--29.  ",
      "doi": "10.1109/CVMP.2011.9"
    },
    {
      "text": "Rene Kaiser, Marian F. Ursu, Manolis Falelakis, and Andras Horti. 2015. Enabling Distributed Theatre Performances through Multi-Camera Telepresence. In Proceedings of the 3rd International Workshop on Immersive Media Experiences - ImmersiveME '15, 21--26.  ",
      "doi": "10.1145/2814347.2814351"
    },
    {
      "text": "Rene Kaiser, Wolfgang Weiss, Manolis Falelakis, Spiros Michalakopoulos, and Marian F. Ursu. 2012. A Rule-Based Virtual Director Enhancing Group Communication. In 2012 IEEE International Conference on Multimedia and Expo Workshops, 187--192.  ",
      "doi": "10.1109/ICMEW.2012.39"
    },
    {
      "text": "Girish Kulkarni, Girish Kulkarni, Visruth Premraj, Sagnik Dhar, Siming Li, Yejin Choi, Alexander C Berg, and Tamara L Berg. 2011. Baby talk: Understanding and generating image descriptions. PROCEEDINGS OF THE 24TH CVPR. Retrieved September 21, 2016 from http://citeseerx.ist.psu.edu/viewdoc/summary?doi= 10.1.1.232.7714  ",
      "doi": "10.1109/CVPR.2011.5995466"
    },
    {
      "text": "Livestream. Mevo Camera. Retrieved from https://getmevo.com/",
      "doi": ""
    },
    {
      "text": "Britta Meixner, Maxine Glancy, Matt Rogers, Caroline Ward, Thomas Röggla, and Pablo Cesar. 2017. Multi-Screen Director. In Adjunct Publication of the 2017 ACM International Conference on Interactive Experiences for TV and Online Video TVX '17 Adjunct, 57--62.  ",
      "doi": "10.1145/3084289.3089924"
    },
    {
      "text": "Microsoft. KUKA creates a connected factory with IoT. Retrieved from https://www.microsoft.com/enus/cloud-platform/customer-stories-kuka-robotics",
      "doi": ""
    },
    {
      "text": "Margaret Mitchell, Xufeng Han, Jesse Dodge, Alyssa Mensch, Amit Goyal, Alex Berg, Kota Yamaguchi, Tamara Berg, Karl Stratos, and Hal Daumé III. 2012. Midge: generating image descriptions from computer vision detections. In Proceedings of the 13th Conference of the European Chapter of the Association for Computational Linguistics, 747--756. ",
      "doi": "10.5555/2380816.2380907"
    },
    {
      "text": "Nest. Nest Learning Thermostat. Retrieved from https://nest.com/uk/thermostat/meet-nestthermostat/",
      "doi": ""
    },
    {
      "text": "Newcastle University. OpenMovement. Retrieved from https://github.com/digitalinteraction/openmovement",
      "doi": ""
    },
    {
      "text": "Marianna Obrist, Pablo Cesar, David Geerts, Tom Bartindale, and Elizabeth F. Churchill. 2015. Online video and interactive TV experiences. interactions 22, 5: 32--37.  ",
      "doi": "10.1145/2799629"
    },
    {
      "text": "Patrick Olivier, Guangyou Xu, Andrew Monk, and Jesse Hoey. 2009. Ambient kitchen. In Proceedings of the 2nd International Conference on PErvsive Technologies Related to Assistive Environments PETRA '09, 1--7.",
      "doi": "10.1145/1579114.1579161"
    },
    {
      "text": "Cuong Pham, Clare Hooper, Stephen Lindsay, Dan Jackson, John Shearer, Jurgen Wagner, Cassim Ladha, Karim Ladha, Thomas Plötz, and Patrick Olivier. 2012. The ambient kitchen: a pervasive sensing environment for situated services. Retrieved December 14, 2015 from http://eprints.lincoln.ac.uk/15375/1/DIS2012demo. pdf",
      "doi": ""
    },
    {
      "text": "Cuong Pham, Daniel Jackson, Johannes Schoening, Tom Bartindale, Thomas Ploetz, and Patrick Olivier. 2013. FoodBoard. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing - UbiComp '13, 749.",
      "doi": ""
    },
    {
      "text": "Cuong Pham and Patrick Olivier. 2009. Slice&Dice: Recognizing food preparation activities using embedded accelerometers. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 34--43.  ",
      "doi": "10.1007/978-3-642-05408-2_4"
    },
    {
      "text": "Philips. Philips Hue. Retrieved from http://www2.meethue.com/en-gb/",
      "doi": ""
    },
    {
      "text": "Anne Preston, Madeline Balaam, Paul Seedhouse, Salla Kurhila, Lari Kotilainen, Ashur Rafiev, Daniel Jackson, and Patrick Olivier. 2015. Can a kitchen teach languages? Linking theory and practice in the design of context-aware language learning environments. Smart Learning Environments 2, 1: 9.",
      "doi": ""
    },
    {
      "text": "Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, 767--776.  ",
      "doi": "10.1145/2702123.2702229"
    },
    {
      "text": "Paul Seedhouse, Anne Preston, Patrick Olivier, Dan Jackson, Philip Heslop, Thomas Plötz, Madeline Balaam, and Saandia Ali. 2013. The French Digital Kitchen: implementing task-based language teaching beyond the classroom. International Journal of Computer-Assisted Language Learning and Teaching 3, 1: 50--72.",
      "doi": ""
    },
    {
      "text": "Chris Shallue. Research Blog: Show and Tell: image captioning open sourced in TensorFlow. Retrieved from https://research.googleblog.com/2016/09/show-andtell-image-captioning-open.html",
      "doi": ""
    },
    {
      "text": "Matthew Shotton, Frank Melchior, Michael Evans, Tony Churnside, Matthew Brooks, and Mike Armstrong. Object-based broadcasting - curation, responsiveness and user experience - BBC R&D. Retrieved March 20, 2016 from http://www.bbc.co.uk/rd/publications/whitepaper28",
      "doi": ""
    },
    {
      "text": "Smarter. Smarter - Kitchen Appliances. Retrieved from http://smarter.am/#",
      "doi": ""
    },
    {
      "text": "TensorFlow. TensorFlow - an Open Source Software Library for Machine Intelligence. Retrieved from https://www.tensorflow.org/",
      "doi": ""
    },
    {
      "text": "TIME. Fewer People Than Ever Are Watching TV. Retrieved from http://time.com/3615387/tvviewership-declining-nielsen/",
      "doi": ""
    },
    {
      "text": "Manfred Tscheligi, Boris de Ruyter, Panos Markopoulus, Reiner Wichert, Thomas Mirlacher, Alexander Meschterjakov, and Wolfgang Reitberger (eds.). 2009. Ambient Intelligence. Springer Berlin Heidelberg, Berlin, Heidelberg. ",
      "doi": "10.5555/1694626"
    },
    {
      "text": "Marian F. Ursu, Ian C. Kegel, Doug Williams, Maureen Thomas, Harald Mayer, Vilmos Zsombori, Mika L. Tuomola, Henrik Larsson, and John Wyver. 2008. ShapeShifting TV: interactive screen media narratives. Multimedia Systems 14, 2: 115--132.  ",
      "doi": "10.1007/s00530-008-0119-z"
    },
    {
      "text": "Marian F. Ursu, Julia Sussner, Ulf Myrestam, Nina Hall, Maureen Thomas, Ian Kegel, Doug Williams, Mika Tuomola, Inger Lindstedt, Terence Wright, Andra Leurdijk, and Vilmos Zsombori. 2008. Interactive TV narratives. ACM Transactions on Multimedia Computing, Communications, and Applications 4, 4: 1--39.  ",
      "doi": "10.1145/1412196.1412198"
    },
    {
      "text": "Marian F. Ursu, Vilmos Zsombori, John Wyver, Lucie Conrad, Ian Kegel, and Doug Williams. 2009. Interactive documentaries. Computers in Entertainment 7, 3: 1.  ",
      "doi": "10.1145/1594943.1594953"
    },
    {
      "text": "Gerard Wilkinson. Media of Things. Retrieved from https://github.com/digitalinteraction/MediaOfThing s",
      "doi": ""
    },
    {
      "text": "Yahoo Finance. Cisco's Set-Top Box Business Continues to Decline. Retrieved from http://finance.yahoo.com/news/cisco-set-top-boxbusiness-170635200.html",
      "doi": ""
    },
    {
      "text": "Vilmos Zsombori, Michael Frantzis, Rodrigo Laiola Guimaraes, Marian Florin Ursu, Pablo Cesar, Ian Kegel, Roland Craigie, and Dick C.A. Bulterman. 2011. Automatic generation of video narratives from shared UGC. In Proceedings of the 22nd ACM conference on Hypertext and hypermedia - HT '11, 325.  ",
      "doi": "10.1145/1995966.1996009"
    },
    {
      "text": "EBU Technology & Innovation - Growing network of metadata developers makes MDN 2017 the biggest yet. Retrieved August 16, 2017 from https://tech.ebu.ch/news/2017/07/growing-networkof-metadata-developers-makes-mdn-2017-thebiggest-yet",
      "doi": ""
    },
    {
      "text": "2-IMMERSE. Retrieved August 16, 2017 from https://2immerse.eu/",
      "doi": ""
    },
    {
      "text": "Opta Premier League. Retrieved September 5, 2017 from http://www.optasports.com/events/premierleague.aspx",
      "doi": ""
    },
    {
      "text": "Hawk-Eye Innovations Official Website. Retrieved September 5, 2017 from https://www.hawkeyeinnovations.com/products",
      "doi": ""
    },
    {
      "text": "LockitScript - the script supervising app on the App Store. Retrieved September 5, 2017 from https://itunes.apple.com/gb/app/lockitscript-thescript-supervising-app/id842485792?mt=8",
      "doi": ""
    },
    {
      "text": "Script Evolution on the App Store. Retrieved September 5, 2017 from https://itunes.apple.com/gb/app/scriptevolution/id824223248?mt=8",
      "doi": ""
    },
    {
      "text": "ORPHEUS - BBC R&D. Retrieved April 20, 2017 from http://www.bbc.co.uk/rd/projects/orpheus",
      "doi": ""
    },
    {
      "text": "LG G Watch W100 Mobile Phone Accessories - LG Electronics UK. Retrieved June 26, 2017 from http://www.lg.com/uk/smart-watches/lg-W100",
      "doi": ""
    },
    {
      "text": "Estimote Beacons - real world context for your apps. Retrieved June 26, 2017 from https://estimote.com/",
      "doi": ""
    },
    {
      "text": "UHF Mid Range Reader - ID ISC.MRU102 Identification - Products - FEIG ELECTRONIC. Retrieved June 26, 2017 from http://www.feig.de/en/products/identification/produ ct/id-iscmru102/",
      "doi": ""
    },
    {
      "text": "Liquid Flow Meter. Retrieved July 25, 2017 from https://www.adafruit.com/product/833",
      "doi": ""
    },
    {
      "text": "Smappee Energy Montior. Retrieved June 26, 2017 from http://www.smappee.com/uk/energy-monitor",
      "doi": ""
    },
    {
      "text": "DMC-GH4 4K Compact System Camera | Panasonic UK & Ireland. Retrieved June 26, 2017 from http://www.panasonic.com/uk/consumer/camerascamcorders/lumix-g-compact-system-cameras/dmcgh4rh.html",
      "doi": ""
    }
  ]
}