{
  "doi": "10.1145/3173574.3174220",
  "title": "Observations on Typing from 136 Million Keystrokes",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We report on typing behaviour and performance of 168,000 volunteers in an online study. The large dataset allows detailed statistical analyses of keystroking patterns, linking them to typing performance. Besides reporting distributions and confirming some earlier findings, we report two new findings. First, letter pairs that are typed by different hands or fingers are more predictive of typing speed than, for example, letter repetitions. Second, rollover-typing, wherein the next key is pressed before the previous one is released, is sur- prisingly prevalent. Notwithstanding considerable variation in typing patterns, unsupervised clustering using normalised inter-key intervals reveals that most users can be divided into eight groups of typists that differ in performance, accuracy, hand and finger usage, and rollover. The code and dataset are released for scientific use.",
  "tags": [
    "text entry",
    "modern typing behavior",
    "large-scale study"
  ],
  "authors": [
    {
      "name": "Vivek Dhakal",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262002",
      "orcid": "missing"
    },
    {
      "name": "Anna Maria Feit",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81556550256/rel-imgonly/crop1.jpg",
      "acmid": "81556550256",
      "orcid": "missing"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "Cambridge University, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    }
  ],
  "references": [
    {
      "text": "2017. Rollover Key. (2017). https://en.wikipedia.org/wiki/Rollover_(key) Last accessed 2017/09/12.",
      "doi": ""
    },
    {
      "text": "Salil P Banerjee and Damon L Woodard. 2012. Biometric authentication and identification using keystroke dynamics: A survey. Journal of Pattern Recognition Research 7, 1 (2012), 116--139.",
      "doi": ""
    },
    {
      "text": "Edward Clarkson, Kent Lyons, James Clawson, and Thad Starner. 2007. Revisiting and validating a model of two-thumb text entry. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 163--166.  ",
      "doi": "10.1145/1240624.1240650"
    },
    {
      "text": "August Dvorak, Nellie L Merrick, William L Dealey, and Gertrude C Ford. 1936. Typewriting behavior. Vol. 1. New York: American Book Company.",
      "doi": ""
    },
    {
      "text": "Anna Maria Feit, Daryl Weir, and Antti Oulasvirta. 2016. How we type: Movement strategies and performance in everyday typing. In Proceedings of the 2016 SIGCHI Conference on Human Factors in Computing Systems. ACM, 4262--4273.  ",
      "doi": "10.1145/2858036.2858233"
    },
    {
      "text": "S.M. Furnell, I. Papadopoulos, and P. Dowland. 2004. A long-term trial of alternative user authentication technologies. Information Management & Computer Security 12, 2 (2004), 178--190.",
      "doi": ""
    },
    {
      "text": "Donald R Gentner. 1983. Keystroke timing in transcription typing. In Cognitive aspects of skilled typewriting. Springer, 95--120.",
      "doi": ""
    },
    {
      "text": "Laura Germine, Ken Nakayama, Bradley C Duchaine, Christopher F Chabris, Garga Chatterjee, and Jeremy B Wilmer. 2012. Is the Web as good as the lab? Comparable performance from Web and lab in cognitive/perceptual experiments. Psychonomic bulletin & review 19, 5 (2012), 847--857.",
      "doi": ""
    },
    {
      "text": "Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N Patel, and Jacob O Wobbrock. 2013. ContextType: using hand posture information to improve mobile touch screen text entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2795--2798.  ",
      "doi": "10.1145/2470654.2481386"
    },
    {
      "text": "Joachim Grabowski. 2008. The internal structure of university students' keyboard skills. Journal of writing research 1, 1 (2008).",
      "doi": ""
    },
    {
      "text": "David Graff and Christopher Cieri. 2003. English gigaword LDC2003T05. (2003). https://catalog.ldc.upenn.edu/LDC2003T05",
      "doi": ""
    },
    {
      "text": "Jonathan T Grudin. 1983. Error patterns in novice and skilled transcription typing. In Cognitive aspects of skilled typewriting. Springer, 121--143.",
      "doi": ""
    },
    {
      "text": "Niels Henze, Enrico Rukzio, and Susanne Boll. 2012. Observational and experimental investigation of typing behaviour using virtual keyboards for mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2659--2668.  ",
      "doi": "10.1145/2207676.2208658"
    },
    {
      "text": "Yuzuru Hiraga, Yoshihiko Ono, and Yamada-Hisao. 1980. An analysis of the standard English keyboard. In Proceedings of the 8th conference on Computational linguistics -. Association for Computational Linguistics, Morristown, NJ, USA, 242.  ",
      "doi": "10.3115/990174.990218"
    },
    {
      "text": "Rick Joyce and Gopal Gupta. 1990. Identity authentication based on keystroke latencies. Commun. ACM 33, 2 (1990), 168--176.  ",
      "doi": "10.1145/75577.75582"
    },
    {
      "text": "Akiyo Kano, Janet C Read, Alan Dix, and I Scott MacKenzie. 2007. ExpECT: an expanded error categorisation method for text input. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI... but not as we know it-Volume 1. British Computer Society, 147--156. ",
      "doi": "10.5555/1531294.1531314"
    },
    {
      "text": "Clare-Marie Karat, Christine Halverson, Daniel Horn, and John Karat. 1999. Patterns of entry and correction in large vocabulary continuous speech recognition systems. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 568--575.  ",
      "doi": "10.1145/302979.303160"
    },
    {
      "text": "Marcus Karnan, Muthuramalingam Akila, and Nishara Krishnaraj. 2011. Biometric personal authentication using keystroke dynamics: A review. Applied Soft Computing 11, 2 (2011), 1565--1573.  ",
      "doi": "10.1016/j.asoc.2010.08.003"
    },
    {
      "text": "Leonard Kaufman and Peter J. Rousseeuw. 1990. Finding Groups in Data: An Introduction to Cluster Analysis. John Wiley.",
      "doi": ""
    },
    {
      "text": "Nina Keith and K Anders Ericsson. 2007. A deliberate practice account of typing proficiency in everyday typists. Journal of Experimental Psychology: Applied 13, 3 (2007), 135.",
      "doi": ""
    },
    {
      "text": "Sunjun Kim, Jeongmin Son, Geehyuk Lee, Hwan Kim, and Woohun Lee. 2013. TapBoard: making a touch screen keyboard more touchable. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 553--562.  ",
      "doi": "10.1145/2470654.2470733"
    },
    {
      "text": "Per Ola Kristensson and Keith Vertanen. 2012. Performance Comparisons of Phrase Sets and Presentation Styles for Text Entry Evaluations. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI '12). ACM, New York, NY, USA, 29--32.  ",
      "doi": "10.1145/2166966.2166972"
    },
    {
      "text": "Vladimir I Levenshtein. 1966. Binary codes capable of correcting deletions, insertions, and reversals. In Soviet physics doklady, Vol. 10. 707--710.",
      "doi": ""
    },
    {
      "text": "Gordon D Logan, Jana E Ulrich, and Dakota RB Lindsey. 2016. Different (Key) Strokes for Different Folks: How Standard and Nonstandard Typists Balance Fitts' Law and Hick's Law. (2016).",
      "doi": ""
    },
    {
      "text": "I Scott MacKenzie and R William Soukoreff. 2002. A model of two-thumb text entry. Space 67 (2002), 18--43.",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, USA, 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Martin Maechler. 2017. clara function | R Documentation. (2017). https://www.rdocumentation.org/packages/ cluster/versions/2.0.6/topics/clara Last accessed 2017/09/18.",
      "doi": ""
    },
    {
      "text": "Jochen Musch and Ulf-Dietrich Reips. 2000. A Brief History of Web Experimenting. In Psychological Experiments on the Internet, Michael H Birnbaum (Ed.). Elsevier, 61--87.",
      "doi": ""
    },
    {
      "text": "Ngoc Tran Nguyen. 2016. Distance-based classification of keystroke dynamics. In First International Workshop on Pattern Recognition. International Society for Optics and Photonics, 100111E--100111E.",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z Gajos. 2015. LabintheWild: Conducting large-scale online experiments with uncompensated samples. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1364--1378.  ",
      "doi": "10.1145/2675133.2675246"
    },
    {
      "text": "Ulf-Dietrich Reips. 2000. The Web Experiment Method: Advantages, Disadvantages, and Solutions. In Psychological Experiments on the Internet., Michael H. Birnbaum (Ed.). Academic Press, Chapter 4, 89--117.",
      "doi": ""
    },
    {
      "text": "Martina Rieger and Victoria KE Bart. 2016. Typing Style and the Use of Different Sources of Information during Typing: An Investigation Using Self-Reports. Frontiers in psychology 7 (2016).",
      "doi": ""
    },
    {
      "text": "Timothy A Salthouse. 1984. Effects of age and skill in typing. Journal of Experimental Psychology: General 113, 3 (1984), 345.",
      "doi": ""
    },
    {
      "text": "Timothy A Salthouse. 1986. Perceptual, cognitive, and motoric aspects of transcription typing. Psychological bulletin 99, 3 (1986), 303.",
      "doi": ""
    },
    {
      "text": "Frode Eika Sandnes. 2005. Evaluating Mobile Text Entry Strategies with Finite State Automata. In Proceedings of the 7th International Conference on Human Computer Interaction with Mobile Devices &; Services (MobileHCI '05). ACM, New York, NY, USA, 115--121.  ",
      "doi": "10.1145/1085777.1085797"
    },
    {
      "text": "LH Shaffer and J Hardwick. 1968. Typing performance as a function of text. The Quarterly Journal of Experimental Psychology 20, 4 (1968), 360--369.",
      "doi": ""
    },
    {
      "text": "Paul D Varcholik, Joseph J LaViola, and Charles E Hughes. 2012. Establishing a baseline for text entry for a multi-touch virtual keyboard. International Journal of Human-Computer Studies 70, 10 (2012), 657--672.  ",
      "doi": "10.1016/j.ijhcs.2012.05.007"
    },
    {
      "text": "K. Vertanen and P.O. Kristensson. 2011. A versatile dataset for text entry evaluations based on genuine mobile emails. In Proceedings of the 13th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 295--298.  ",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "Jacob O Wobbrock. 2007. Measures of text entry performance. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock and Brad A Myers. 2006. Analyzing the input stream for character-level errors in unconstrained text entry evaluations. ACM Transactions on Computer-Human Interaction (TOCHI) 13, 4 (2006), 458--489.  ",
      "doi": "10.1145/1188816.1188819"
    },
    {
      "text": "Changxu Wu and Yili Liu. 2008. Queuing network modeling of transcription typing. ACM Transactions on Computer-Human Interaction (TOCHI) 15, 1 (2008), 6.  ",
      "doi": "10.1145/1352782.1352788"
    },
    {
      "text": "Xin Yi, Chun Yu, Weinan Shi, Xiaojun Bi, and Yuanchun Shi. 2017. Word Clarity As a Metric in Sampling Keyboard Test Sets. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4216--4228.  ",
      "doi": "10.1145/3025453.3025701"
    },
    {
      "text": "Ying Yin, Tom Yu Ouyang, Kurt Partridge, and Shumin Zhai. 2013. Making touchscreen keyboards adaptive to keys, hand postures, and individuals: a hierarchical spatial backoff model approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2775--2784.  ",
      "doi": "10.1145/2470654.2481384"
    }
  ]
}