{
  "doi": "10.1145/3173574.3173810",
  "title": "Taking into Account Sensory Knowledge: The Case of Geo-techologies for Children with Visual Impairments",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "This paper argues for designing geo-technologies supporting non-visual sensory knowledge. Sensory knowledge refers to the implicit and explicit knowledge guiding our uses of our senses to understand the world. To support our argument, we build on an 18 months field-study on geography classes for primary school children with visual impairments. Our findings show (1) a paradox in the use of non-visual sensory knowledge: described as fundamental to the geography curriculum, it is mostly kept out of school; (2) that accessible geo-technologies in the literature mainly focus on substituting vision with another modality, rather than enabling teachers to build on children's experiences; (3) the importance of the hearing sense in learning about space. We then introduce a probe, a wrist-worn device enabling children to record audio cues during field-trips. By giving importance to children's hearing skills, it modified existing practices and actors' opinions on non-visual sensory knowledge. We conclude by reflecting on design implications, and the role of technologies in valuing diverse ways of understanding the world.",
  "tags": [
    "probe",
    "geography",
    "education",
    "design",
    "wearable",
    "visual impairments",
    "sensory knowledge",
    "maps"
  ],
  "authors": [
    {
      "name": "Emeline Brulé",
      "institution": "CNRS i3, Télécom ParisTech, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658765641",
      "orcid": "missing"
    },
    {
      "name": "Gilles Bailly",
      "institution": "Sorbonne Université, CNRS, ISIR, Paris, France",
      "img": "/do/10.1145/contrib-81309498332/rel-imgonly/bailly.jpg",
      "acmid": "81309498332",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alissa N. Antle. 2013. Research opportunities: Embodied child-computer interaction. International Journal of Child-Computer Interaction 1, 1 (2013), 30--36.",
      "doi": ""
    },
    {
      "text": "Marc Antrop. 2000. Geography and landscape science. Belgeo. Revue belge de g´ eographie 1--2--3--4 (2000), 9--36.",
      "doi": ""
    },
    {
      "text": "Jean Franc ¸ois Augoyard. 2014. Sonic experience: a guide to everyday sounds. McGill-Queen's Press-MQUP, Montr´ eal, QB, Canada.",
      "doi": ""
    },
    {
      "text": "Ann E. Bartos. 2013. Children sensing place. Emotion, Space and Society 9 (Nov. 2013), 89--98.",
      "doi": ""
    },
    {
      "text": "Marc Behrendt and Teresa Franklin. 2014. A Review of Research on School Field Trips and Their Value in Education. International Journal of Environmental and Science Education 9, 3 (2014), 235--245.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1077--1086.  ",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Anke M. Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2015. Interactivity Improves Usability of Geographic Maps for Visually Impaired People. Human-Computer Interaction 30, 2 (March 2015), 156--194.  ",
      "doi": "10.5555/2692791.2692794"
    },
    {
      "text": "Ann L Brown, Doris Ash, Martha Rutherford, Kathryn Nakagawa, Ann Gordon, and Joseph C Campione. 1993. Distributed expertise in the classroom. Distributed cognitions: Psychological and educational considerations (1993), 188--228.",
      "doi": ""
    },
    {
      "text": "Emeline Brule, Gilles Bailly, Anke Brock, Frederic Valentin, Gr´ egoire Denis, and Christophe Jouffrais. 2016. MapSense: Multi-Sensory Interactive Maps for Children Living with Visual Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 445--457.  ",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Michael Bull, Paul Gilroy, David Howes, and Douglas Kahn. 2006. Introducing Sensory Studies. The Senses and Society 1, 1 (2006), 5--7.",
      "doi": ""
    },
    {
      "text": "Dustin Carroll, Suranjan Chakraborty, and Jonathan Lazar. 2013. Designing Accessible Visualizations: The Case of Designing a Weather Map for Blind Users. In Proceedings of the 7th International Conference on Universal Access in Human-Computer Interaction: Design Methods, Tools, and Interaction Techniques for eInclusion - Volume Part I (UAHCI'13). Springer-Verlag, Berlin, Heidelberg, 436--445.  ",
      "doi": "10.1007/978-3-642-39188-0_47"
    },
    {
      "text": "Simon Catling. 2005. Children's personal geographies and the English primary school geography curriculum. Children's Geographies 3, 3 (2005), 325--344.",
      "doi": ""
    },
    {
      "text": "Jean Ho Chu, Daniel Harley, Jamie Kwan, Melanie McBride, and Ali Mazalek. 2016. Sensing History: Contextualizing Artifacts with Sensory Interactions and Narrative Design. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 1294--1302.  ",
      "doi": "10.1145/2901790.2901829"
    },
    {
      "text": "Constance Classen. 1993. Worlds of sense: Exploring the senses in history and across cultures. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Paul J Cloke, Chris Philo, and David Sadler. 1991. Approaching human geography an introduction to contemporary theoretical debates. Sage, London, UK.",
      "doi": ""
    },
    {
      "text": "Amanda Coffey and Paul Atkinson. 1996. Making sense of qualitative data: Complementary research strategies. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "T. Collins, M. Gaved, P. Mulholland, C. Kerawalla, A. Twiner, E. Scanlon, A. Jones, K. Littleton, G. Conole, and C. Blake. 2008. Supporting location-based inquiry learning across school, field and home contexts. In Proceedings of the MLearn 2008 Conference.",
      "doi": ""
    },
    {
      "text": "Andrea Cornwall and Rachel Jewkes. 1995. What is participatory research? Social science & medicine 41, 12 (1995), 1667--1676.",
      "doi": ""
    },
    {
      "text": "Denis E Cosgrove. 1998. Social formation and symbolic landscape. Wiley Online Library, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "N. Dahlb¨ ack, A. J¨ onsson, and L. Ahrenberg. 1993. Wizard of Oz Studies - Why and How. Knowledge-Baseded Systems 6, 4 (Dec. 1993), 258--266.  ",
      "doi": "10.1016/0950-7051%2893%2990017-N"
    },
    {
      "text": "John Dewey. 1969. The logic of judgments of practice (1915). In The Collected Works of John Dewey: The Middle Works, 1899--1924, vol. 8. Ed. JA Boydston. Carbondale: Southern Illinois University Press, 14--82.",
      "doi": ""
    },
    {
      "text": "Jennifer DeWitt and Martin Storksdieck. 2008. A Short Review of School Field Trips: Key Findings from the Past and Implications for the Future. Visitor Studies 11, 2 (2008), 181--197.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press, Cambridge, MA, USA.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Julie Ducasse, Marc J-M Mac´ e, Marcos Serrano, and Christophe Jouffrais. 2016. Tangible Reels: Construction and Exploration of Tangible Maps by Visually Impaired Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2186--2197.  ",
      "doi": "10.1145/2858036.2858058"
    },
    {
      "text": "Roger Firth. 2011. Teaching geography 11--18: a conceptual approach. The Curriculum Journal 22, 3 (2011), pp. 439--442.",
      "doi": ""
    },
    {
      "text": "Robert Fisher. 1998. Thinking About Thinking: Developing Metacognition in Children. Early Child Development and Care 141, 1 (1998), 1--15.",
      "doi": ""
    },
    {
      "text": "Euan Freeman, Graham Wilson, Stephen Brewster, Gabriel Baud-Bovy, Charlotte Magnusson, and Hector Caltenco. 2017. Audible Beacons and Wearables in Schools: Helping Young Visually Impaired Children Play and Move Independently. In Proceedings of the 35th Annual ACM Conference on Human Factors in Computing Systems - CHI '17. ACM Press, to appear.  ",
      "doi": "10.1145/3025453.3025518"
    },
    {
      "text": "Vasilis Galis. 2011. Enacting disability: how can science and technology studies inform disability studies? Disability & Society 26, 7 (2011), 825--838.",
      "doi": ""
    },
    {
      "text": "Rosemarie Garland-Thomson. 2011. Misfits: A Feminist Materialist Disability Concept. Hypatia 26, 3 (2011), 591--609.",
      "doi": ""
    },
    {
      "text": "Phil Gersmehl. 2014. Teaching geography. Guilford Publications, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Dan Goodley and Katherine Runswick-Cole. 2011. The violence of disablism. Sociology of Health & Illness 33, 4 (2011), 602--617.",
      "doi": ""
    },
    {
      "text": "Anne Graham, Mary Powell, Nicola Taylor, Donnah Anderson, and Robyn Fitzgerald. 2013. Ethical research involving children. Florence: UNICEF Office of Research-Innocenti (2013).",
      "doi": ""
    },
    {
      "text": "Aimi Hamraie. 2013. Designing collective access: A feminist disability theory of universal design. Disability Studies Quarterly 33, 4 (2013).",
      "doi": ""
    },
    {
      "text": "Aimi Hamraie. 2016. Universal Design and the Problem of \"Post- Disability\" Ideology. Design and Culture (2016). http://sci-hub.cc/10.1080/17547075.2016.1218714",
      "doi": ""
    },
    {
      "text": "Halvor Hanisch. 2014. Psycho-emotional disablism: a differentiated process. Scandinavian Journal of Disability Research 16, 3 (2014), 211--228.",
      "doi": ""
    },
    {
      "text": "Mark Harris. 2007. Ways of knowing: Anthropological approaches to crafting experience and knowledge. Vol. 18. Berghahn Books, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Jasmien Herssens and Ann Heylighen. 2012. Blind Photographers: An (Im) material Quest into the Spatial Experiences of Children Born Blind. Children, Youth and Environments 22, 1 (2012), 99--124.",
      "doi": ""
    },
    {
      "text": "Nic Hollinworth, Kate Allen, Gosia Kwiatkowska, Andy Minnion, and Faustina Hwang. 2014. Interactive Sensory Objects for and by People with Learning Disabilities. SIGACCESS Access. Comput. 109 (June 2014), pp. 11--20.  ",
      "doi": "10.1145/2637487.2637489"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, St´ ephane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Bj¨ orn Eiderb¨ ack. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Peter Jackson. 2006. Thinking geographically. GEOGRAPHY-LONDON- 91, 3 (2006), 199.",
      "doi": ""
    },
    {
      "text": "Martin Jay. 1993. Downcast eyes: The denigration of vision in twentieth-century French thought. Univ of California Press, Oakland, CA, USA.",
      "doi": ""
    },
    {
      "text": "Michaela D. Kennedy. 2014. The benefit of Field Trips. Ph.D. Dissertation. Georgia Southern University.",
      "doi": ""
    },
    {
      "text": "Scott R. Klemmer, Bj¨ orn Hartmann, and Leila Takayama. 2006. How Bodies Matter: Five Themes for Interaction Design. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06). ACM, New York, NY, USA, 140--149.  ",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "I. Kocur and S. Resnikoff. 2002. Visual impairment and blindness in Europe and their prevention. Br J Ophthalmol 86, 7 (July 2002), 716--722.",
      "doi": ""
    },
    {
      "text": "Kevin Krahenbuhl. 2014. Collaborative Field Trips: An Opportunity to Connect Practice With Pedagogy. The Geography Teacher 11, 1 (2014), 17--24.",
      "doi": ""
    },
    {
      "text": "Steven Eric Krauss. 2005. Research paradigms and meaning making: A primer. The qualitative report 10, 4 (2005), 758--770.",
      "doi": ""
    },
    {
      "text": "Milos Kravcik, Andreas Kaibel, Marcus Specht, and Lucia Terrenghi. 2004. Mobile Collector for Field Trips. Journal of Educational Technology & Society 7, 2 (2004), 25--33. http://www.jstor.org/stable/jeductechsoci.7.2.25",
      "doi": ""
    },
    {
      "text": "Alex Kuhn, Clara Cahill, Chris Quintana, and Shannon Schmoll. 2011. Using Tags to Encourage Reflection and Annotation on Data During Nomadic Inquiry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 667--670.  ",
      "doi": "10.1145/1978942.1979038"
    },
    {
      "text": "Mei-Po Kwan. 2002. Feminist visualization: Re-envisioning GIS as a method in feminist geographic research. Annals of the association of American geographers 92, 4 (2002), 645--661.",
      "doi": ""
    },
    {
      "text": "Emily R. Lai. 2011. Metacognition: A Literature Review. Technical Report. Pearson. http://images.pearsonassessments.com/images/tmrs/ Metacognition_Literature_Review_Final.pdf",
      "doi": ""
    },
    {
      "text": "David Lambert and David Balderstone. 2012. Learning to teach geography in the secondary school: a companion to school experience. Routledge.",
      "doi": ""
    },
    {
      "text": "Annette Lareau. 1987. Social class differences in family-school relationships: The importance of cultural capital. Sociology of education (1987), 73--85.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec, Erika Shehan Poole, and Susan P Wyche. 2009. Values as lived experience: evolving value sensitive design in support of value discovery. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1141--1150.  ",
      "doi": "10.1145/1518701.1518875"
    },
    {
      "text": "Wan-Tzu Lo and Chris Quintana. 2013. Students' Use of Mobile Technology to Collect Data in Guided Inquiry on Field Trips. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, New York, NY, USA, 297--300.  ",
      "doi": "10.1145/2485760.2485837"
    },
    {
      "text": "Hannah Mary MacPherson. 2007. Landscapes of blindness and visual impairment: sight, touch and laughter in the English countryside. Ph.D. Dissertation. University of Newcastle upon Tyne. https://theses.ncl. ac.uk/dspace/bitstream/10443/258/1/macpherson07.pdf",
      "doi": ""
    },
    {
      "text": "Angelica Carvalho Di Maio, Cilene Gomes, and Maria de Lourdes Neves de Oliveira Kurkdjian. 2011. Geoinformation: a social Issue. In Advances in Cartography and GIScience. Volume 2: Selection from ICC 2011, Paris, Anne Ruas (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 35--48.",
      "doi": ""
    },
    {
      "text": "James MaKinster, Nancy Trautmann, and Michael Barnett. 2014. Teaching science and investigating environmental issues with geospatial technology. Springer, Amsterdam, NL. ",
      "doi": "10.5555/2601510"
    },
    {
      "text": "Lambros Malafouris. 2013. How things shape the mind. MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Laura Malinverni, Edith Ackermann, and Narcis Pares. 2016. Experience As an Object to Think with: From Sensing-in-action to Making-Sense of Action in Full-Body Interaction Learning Environments. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 332--339.  ",
      "doi": "10.1145/2839462.2839477"
    },
    {
      "text": "Laura Malinverni and Narc´ 's Par´ es Burgu` es. 2015. The Medium Matters: The Impact of Full-body Interaction on the Socio-affective Aspects of Collaboration. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15). ACM, New York, NY, USA, 89--98.  ",
      "doi": "10.1145/2771839.2771849"
    },
    {
      "text": "Laura Malinverni, Julian Maya, Marie-Monique Schaper, and Narcis Pares. 2017. The World-as-Support: Embodied Exploration, Understanding and Meaning-Making of the Augmented World. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5132--5144.  ",
      "doi": "10.1145/3025453.3025955"
    },
    {
      "text": "Laura Malinverni and Narcis Pares. 2017. Learning from Failures in Designing and Evaluating Full-Body Interaction Learning Environments. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 1065--1074.  ",
      "doi": "10.1145/3027063.3053352"
    },
    {
      "text": "Kevin St. Martin and Madeleine Hall-Arber. 2008. The missing layer: Geo-technologies, communities, and implications for marine spatial planning. Marine Policy 32, 5 (2008), 779 -- 786. The Role of Marine Spatial Planning in Implementing Ecosystem-based, Sea Use Management.",
      "doi": ""
    },
    {
      "text": "Sarah Maslen. 2015. Researching the Senses as Knowledge. The Senses and Society 10, 1 (March 2015), 52--70.",
      "doi": ""
    },
    {
      "text": "Doreen Massey. 2013. Space, place and gender. John Wiley & Sons, Hoboken, NJ, USA.",
      "doi": ""
    },
    {
      "text": "S´ onia Matos. 2017. The Sound Labyrinth: Computers, Constructionism and Language Learning. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17). ACM, New York, NY, USA, 258--267.  ",
      "doi": "10.1145/3078072.3079726"
    },
    {
      "text": "MH Matthews and Peter Vujakovic. 1995. Private Worlds and Public Places: Mapping the Environmental Values of Wheelchair Users. Environment and Planning A 27, 7 (1995), 1069--1083.",
      "doi": ""
    },
    {
      "text": "Melanie McBride and J. Nolan Jason. 2017. Situating olfactory literacies: An intersensory pedagogy by design. In Designing with Smell : Practices, Techniques and Challenges, Victoria Henshaw, Dominic Medway, Chris Perkins, Gary Warnaby, and Kate C. McLean (Eds.). Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Leyla Norooz, Matthew Louis Mauriello, Anita Jorgensen, Brenna McNally, and Jon E. Froehlich. 2015. BodyVis: A New Approach to Body Learning Through Wearable Sensing and Visualization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1025--1034.  ",
      "doi": "10.1145/2702123.2702299"
    },
    {
      "text": "Dennis Ocholla. 2007. Marginalized knowledge: An agenda for indigenous knowledge development and integration with other forms of knowledge. International review of information ethics 7, 09 (2007), 1--10.",
      "doi": ""
    },
    {
      "text": "OpenStreetMap. 2017. OpenStreetMap for the blind. (2017). http://wiki.openstreetmap.org/wiki/OSM_for_the_blind",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Niels Henze, Wilko Heuten, and Susanne Boll. 2007. Tangible User Interface for the Exploration of Auditory City Maps. In Haptic and Audio Interaction Design, Ian Oakley and Stephen Brewster (Eds.). Lecture Notes in Computer Science, Vol. 4813. Springer Berlin Heidelberg, 86--97. ",
      "doi": "10.5555/1775512.1775526"
    },
    {
      "text": "Sarah Pink, Kerstin Leder Mackley, Val Mitchell, Marcus Hanratty, Carolina Escobar-Tello, Tracy Bhamra, and Roxana Morosanu. 2008. Applying the Lens of Sensory Ethnography to Sustainable HCI. ACM Trans. Comput.-Hum. Interact. 20, 4, Article 25 (Sept. 2008), 18 pages.  ",
      "doi": "10.1145/2494261"
    },
    {
      "text": "Chris Quintana, Brian J. Reiser, Elizabeth A. Davis, Joseph Krajcik, Eric Fretz, Ravit Golan Duncan, Eleni Kyza, Daniel Edelson, and Elliot Soloway. 2004. A Scaffolding Design Framework for Software to Support Science Inquiry. Journal of the Learning Sciences 13, 3 (2004), 337--386.",
      "doi": ""
    },
    {
      "text": "Paul Rodaway. 1994. Sensuous geographies: Body, sense and place. Routledge.",
      "doi": ""
    },
    {
      "text": "Y. Rogers, S. Price, G. Fitzpatrick, R. Fleck, E. Harris, H. Smith, C. Randell, H. Muller, C. O'Malley, D. Stanton, M. Thompson, and M. Weal. 2004. Ambient Wood: Designing New Forms of Digital Augmentation for Learning Outdoors. In ACM IDC'04 (IDC '04). 3--10.  ",
      "doi": "10.1145/1017833.1017834"
    },
    {
      "text": "Jaime S´ anchez, Mauricio Saenz, and Jose Miguel Garrido. 2010. Usability of a Multimodal Video Game to Improve Navigation Skills for Blind Children. ACM Trans. Access. Comput. 3, 2, Article 7 (Nov. 2010), 29 pages.  ",
      "doi": "10.1145/1857920.1857924"
    },
    {
      "text": "Douglas Schuler and Aki Namioka (Eds.). 1993. Participatory Design: Principles and Practices. L. Erlbaum Associates Inc., Hillsdale, NJ, USA. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Mathieu Simonnet, Dan Jacobson, Stephane Vieilledent, and Jacques Tisseau. 2009. SeaTouch: A Haptic and Auditory Maritime Environment for Non Visual Cognitive Mapping of Blind Sailors. Springer Berlin Heidelberg, Berlin, Heidelberg, 212--226.",
      "doi": ""
    },
    {
      "text": "Justin Spinney. 2006. A Place of Sense: A Kinaesthetic Ethnography of Cyclists on Mont Ventoux. Environ Plan D 24, 5 (Oct. 2006), 709--732.",
      "doi": ""
    },
    {
      "text": "Katie Headrick Taylor and Rogers Hall. 2013. Counter-Mapping the Neighborhood on Bicycles: Mobilizing Youth to Reimagine the City. Technology, Knowledge and Learning 18, 1 (July 2013), 65--93.",
      "doi": ""
    },
    {
      "text": "Jean-Paul Thibaud. 2011. A sonic paradigm of urban ambiances. Journal of Sonic Studies 1, 1 (2011), 1--14.",
      "doi": ""
    },
    {
      "text": "Simon Ungar, Mark Blades, and Christopher Spencer. 1997. Strategies for Knowledge Acquisition from Cartographic Maps by Blind and Visually Impaired Adults. The Cartographic Journal 34, 2 (1997), 93--110.",
      "doi": ""
    },
    {
      "text": "Maarten Van Mechelen, Jan Derboven, Ann Laenen, Bert Willems, David Geerts, and Vero Vanden Abeele. 2017. The GLID method: Moving from design features to underlying values in co-design. International Journal of Human-Computer Studies 97 (Jan. 2017), 116--128.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making Design Probes Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3441--3450.  ",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "WHO. 2014. Disabilities - Health Topics. (2014). http://www.who.int/topics/disabilities/en/",
      "doi": ""
    },
    {
      "text": "Dilafruz R. Williams and P. Scott Dixon. 2013. Impact of Garden-Based Learning on Academic Outcomes in Schools. Review of Educational Research 83, 2 (2013), 211--235.",
      "doi": ""
    },
    {
      "text": "Michele A. Williams, Amy Hurst, and Shaun K. Kane. 2013. \"Pray Before You Step out\": Describing Personal and Situational Blind Navigation Behaviors. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, 28:1--28:8.  ",
      "doi": "10.1145/2513383.2513449"
    },
    {
      "text": "Graham R. Williamson and Sue Prosser. 2002. Action research: politics, ethics and participation. Journal of Advanced Nursing 40, 5 (Dec. 2002), 587--593.",
      "doi": ""
    },
    {
      "text": "Myriam Winance. 2014. Universal design and the challenge of diversity: reflections on the principles of UD, based on empirical research of people's mobility. Disability and Rehabilitation 36, 16 (2014), 1334--1343.",
      "doi": ""
    },
    {
      "text": "Ryuichi Yoshida, Ryohei Egusa, Machi Saito, Miki Namatame, Masanori Sugimoto, Fusako Kusunoki, Etsuji Yamaguchi, Shigenori Inagaki, Yoshiaki Takeda, and Hiroshi Mizoguchi. 2015. BESIDE: Body Experience and Sense of Immersion in Digital Paleontological Environment. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 1283--1288.  ",
      "doi": "10.1145/2702613.2732824"
    },
    {
      "text": "Limin Zeng and Gerhard Weber. 2011. Accessible Maps for the Visually Impaired. In Proceedings of IFIP INTERACT 2011 Workshop on ADDW, CEUR, Vol. 792. 54--60. http://ftp.informatik.rwth-aachen.de/ Publications/CEUR-WS/Vol-792/Zeng.pdf",
      "doi": ""
    }
  ]
}