{
  "doi": "10.1145/3173574.3173978",
  "title": "Improving User Confidence in Concept Maps: Exploring Data Driven Explanations",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Automated tools are increasingly being used to generate highly engaging concept maps as an aid to strategic planning and other decision-making tasks. Unless stakeholders can understand the principles of the underlying layout process, however, we have found that they lack confidence and are therefore reluctant to use these maps. In this paper, we present a qualitative study exploring the effect on users' confidence of using data-driven explanation mechanisms, by conducting in-depth scenario-based interviews with ten participants. To provide diversity in stimulus and approach we use two explanation mechanisms based on projection and agglomerative layout methods. The themes exposed in our results indicate that the data-driven explanations improved user confidence in several ways, and that process clarity and layout density also affected users' views of the credibility of the concept maps. We discuss how these factors can increase uptake of automated tools and affect user confidence.",
  "tags": [
    "data driven explanation",
    "concept map",
    "qualitative study",
    "user confidence"
  ],
  "authors": [
    {
      "name": "Pierre Le Bras",
      "institution": "Heriot-Watt University, Edinburgh, Midlothian, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659028656",
      "orcid": "missing"
    },
    {
      "name": "David A. Robb",
      "institution": "Heriot-Watt University, Edinburgh, Midlothian, United Kingdom",
      "img": "/do/10.1145/contrib-99658691643/rel-imgonly/profilephotoposterized.jpg",
      "acmid": "99658691643",
      "orcid": "missing"
    },
    {
      "name": "Thomas S. Methven",
      "institution": "Heriot-Watt University, Edinburgh, Midlothian, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488671090",
      "orcid": "missing"
    },
    {
      "name": "Stefano Padilla",
      "institution": "Heriot-Watt University, Edinburgh, Midlothian, United Kingdom",
      "img": "/do/10.1145/contrib-81421592371/rel-imgonly/screenshot2014-08-22at11.26.43.png",
      "acmid": "81421592371",
      "orcid": "missing"
    },
    {
      "name": "Mike J. Chantler",
      "institution": "Heriot-Watt University, Edinburgh, Midlothian, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620865",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gregory A Aarons, Rebecca S Wells, Karen Zagursky, Danielle L Fettes, and Lawrence A Palinkas. 2009. Implementing evidence-based practice in community mental health agencies: A multiple stakeholder analysis. American journal of public health 99, 11 (2009), 2087--2095.",
      "doi": ""
    },
    {
      "text": "Anne Adams and Anna L Cox. 2008. Questionnaires, in-depth interviews and focus groups. In Research Methods for Human-Computer Interaction, Paul Cairns and Anna L Cox (Eds.). Cambridge University Press, Chapter 2, 17--34.",
      "doi": ""
    },
    {
      "text": "Lynda A. Anderson, Margaret K. Gwaltney, Demia L. Sundra, Ross C. Brownson, Mary Kane, Alan W. Cross, Richard Mack, Randy Schwartz, Tom Sims, and Carol R. White. 2006. Using Concept Mapping to Develop a Logic Model for the Prevention Research Centers Program. Preventing Chronic Disease 3, 1 (2006).",
      "doi": ""
    },
    {
      "text": "Christine Barter and Emma Renold. 1999. The use of vignettes in qualitative research. Social research update 25, 9 (1999), 1--6.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti, Alexander Ambard, Daniel Turner, Christina Gossmann, Kamila Demkova, and John M Carroll. 2015. A muddle of models of motivation for using peer-to-peer economy systems. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1085--1094.  ",
      "doi": "10.1145/2702123.2702272"
    },
    {
      "text": "John Benson and Nicky Britten. 2002. Patients' decisions about whether or not to take antihypertensive drugs: qualitative study. Bmj 325, 7369 (2002), 873.",
      "doi": ""
    },
    {
      "text": "David M Blei. 2012. Probabilistic topic models. Commun. ACM 55, 4 (2012), 77--84.  ",
      "doi": "10.1145/2133806.2133826"
    },
    {
      "text": "David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of machine Learning research 3, Jan (2003), 993--1022. ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 data-driven documents. IEEE transactions on visualization and computer graphics 17, 12 (2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Kevin W Boyack, Richard Klavans, and Katy Börner. 2005. Mapping the backbone of science. Scientometrics 64, 3 (2005), 351--374.",
      "doi": ""
    },
    {
      "text": "Laila Burla, Birte Knierim, Jurgen Barth, Katharina Liewald, Margreet Duetz, and Thomas Abel. 2008. From text to codings: intercoder reliability assessment in qualitative content analysis. Nursing research 57, 2 (2008), 113--117.",
      "doi": ""
    },
    {
      "text": "John L Campbell, Charles Quincy, Jordan Osserman, and Ove K Pedersen. 2013. Coding in-depth semistructured interviews: Problems of unitization and intercoder reliability and agreement. Sociological Methods & Research 42, 3 (2013), 294--320.",
      "doi": ""
    },
    {
      "text": "Emilio Carrizosa, Vanesa Guerrero, and Dolores Romero Morales. 2017. Visualizing proportions and dissimilarities by space-filling maps: a large neighborhood search approach. Computers & Operations Research 78 (2017), 369--380.  ",
      "doi": "10.1016/j.cor.2016.09.018"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2008. Basics of qualitative research: techniques and procedures for developing grounded theory. 2008. (2008).",
      "doi": ""
    },
    {
      "text": "Dan Cosley, Shyong K Lam, Istvan Albert, Joseph A Konstan, and John Riedl. 2003. Is seeing believing?: how recommender system interfaces affect users' opinions. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 585--592.  ",
      "doi": "10.1145/642611.642713"
    },
    {
      "text": "Martin Davies. 2011. Concept mapping, mind mapping and argument mapping: what are the differences and do they matter? Higher education 62, 3 (2011), 279--301.",
      "doi": ""
    },
    {
      "text": "Niklas Elmqvist and Ji Soo Yi. 2015. Patterns for visualization evaluation. Information Visualization 14, 3 (2015), 250--269.",
      "doi": ""
    },
    {
      "text": "Michele Emmer. 2005. The visual mind II. (2005).",
      "doi": ""
    },
    {
      "text": "Holly J Falk-Krzesinski, Noshir Contractor, Stephen M Fiore, Kara L Hall, Cathleen Kane, Joann Keyton, Julie Thompson Klein, Bonnie Spring, Daniel Stokols, and William Trochim. 2011. Mapping a research agenda for the science of team science. Research Evaluation 20, 2 (2011), 145--158.",
      "doi": ""
    },
    {
      "text": "Ohad Fried, Stephen DiVerdi, Maciej Halber, Elena Sizikova, and Adam Finkelstein. 2015. IsoMatch: Creating informative grid layouts. In Computer graphics forum, Vol. 34. Wiley Online Library, 155--166.  ",
      "doi": "10.1111/cgf.12549"
    },
    {
      "text": "Emden R Gansner, Yifan Hu, and Stephen Kobourov. 2010. GMap: Visualizing graphs and clusters as maps. In Visualization Symposium (PacificVis), 2010 IEEE Pacific. IEEE, 201--208.",
      "doi": ""
    },
    {
      "text": "Elena Garces, Aseem Agarwala, Aaron Hertzmann, and Diego Gutierrez. 2017. Style-based exploration of illustration datasets. Multimedia Tools and Applications 76, 11 (2017), 13067--13086.  ",
      "doi": "10.1007/s11042-016-3702-x"
    },
    {
      "text": "Alyssa Glass, Deborah L McGuinness, and Michael Wolverton. 2008. Toward establishing trust in adaptive agents. In Proceedings of the 13th international conference on Intelligent user interfaces. ACM, 227--236.  ",
      "doi": "10.1145/1378773.1378804"
    },
    {
      "text": "Nitesh Goyal, Gilly Leshed, Dan Cosley, and Susan R Fussell. 2014. Effects of implicit sharing in collaborative analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 129--138.  ",
      "doi": "10.1145/2556288.2557229"
    },
    {
      "text": "Raja Gumienny, Steven P Dow, and Christoph Meinel. 2014. Supporting the synthesis of information in design teams. In Proceedings of the 2014 conference on Designing interactive systems. ACM, 463--472.  ",
      "doi": "10.1145/2598510.2598545"
    },
    {
      "text": "Steven Hansen, N Hari Narayanan, and Mary Hegarty. 2002. Designing educationally effective algorithm visualizations. Journal of Visual Languages & Computing 13, 3 (2002), 291--317.",
      "doi": ""
    },
    {
      "text": "Gunnar Harboe, Jonas Minke, Ioana Ilea, and Elaine M Huang. 2012. Computer support for collaborative data analysis: augmenting paper affinity diagrams. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 1179--1182.  ",
      "doi": "10.1145/2145204.2145379"
    },
    {
      "text": "Jason L Harman, John O'Donovan, Tarek Abdelzaher, and Cleotilde Gonzalez. 2014. Dynamics of human trust in recommender systems. In Proceedings of the 8th ACM Conference on Recommender systems. ACM, 305--308.  ",
      "doi": "10.1145/2645710.2645761"
    },
    {
      "text": "Nicholas Jenkins, Michael Bloor, Jan Fischer, Lee Berney, and Joanne Neale. 2010. Putting it in context: the use of vignettes in qualitative interviewing. Qualitative Research 10, 2 (2010), 175--198.",
      "doi": ""
    },
    {
      "text": "Benjamin King. 1967. Step-wise clustering procedures. J. Amer. Statist. Assoc. 62, 317 (1967), 86--101.",
      "doi": ""
    },
    {
      "text": "René F Kizilcec. 2016. How much information?: Effects of transparency on trust in an algorithmic interface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2390--2395.  ",
      "doi": "10.1145/2858036.2858402"
    },
    {
      "text": "Bart P Knijnenburg, Svetlin Bostandjiev, John O'Donovan, and Alfred Kobsa. 2012. Inspectability and control in social recommenders. In Proceedings of the sixth ACM conference on Recommender systems. ACM, 43--50.  ",
      "doi": "10.1145/2365952.2365966"
    },
    {
      "text": "Brian Y Lim, Anind K Dey, and Daniel Avrahami. 2009. Why and why not explanations improve the intelligibility of context-aware intelligent systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2119--2128.  ",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Zachary C Lipton. 2016. The mythos of model interpretability. arXiv preprint arXiv:1606.03490 (2016).",
      "doi": ""
    },
    {
      "text": "Paulo JG Lisboa. 2013. Interpretability in Machine Learning--Principles and Practice. In International Workshop on Fuzzy Logic and Applications. Springer, Cham, 15--21.",
      "doi": ""
    },
    {
      "text": "Duen-Ren Liu, Chin-Hui Lai, and Hsuan Chiu. 2011. Sequence-based trust in collaborative filtering for document recommendation. International Journal of Human-Computer Studies 69, 9 (2011), 587--601.  ",
      "doi": "10.5555/2007511.2007792"
    },
    {
      "text": "Wendy L Martinez, Angel R Martinez, Angel Martinez, and Jeffrey Solka. 2010. Exploratory data analysis with MATLAB. CRC Press. ",
      "doi": "10.5555/1204041"
    },
    {
      "text": "James Munkres. 1957. Algorithms for the assignment and transportation problems. Journal of the society for industrial and applied mathematics 5, 1 (1957), 32--38.",
      "doi": ""
    },
    {
      "text": "Joseph Novak. 1991. Clarify with concept maps. The science teacher 58, 7 (1991), 44.",
      "doi": ""
    },
    {
      "text": "Joseph D Novak and Alberto J Cañas. 2008. The theory underlying concept maps and how to construct and use them. (2008).",
      "doi": ""
    },
    {
      "text": "Joseph D Novak and Dismas Musonda. 1991. A twelve-year longitudinal study of science concept learning. American Educational Research Journal 28, 1 (1991), 117--153.",
      "doi": ""
    },
    {
      "text": "Conor Nugent and Pádraig Cunningham. 2005. A case-based explanation system for black-box systems. Artificial Intelligence Review 24, 2 (2005), 163--178.  ",
      "doi": "10.1007/s10462-005-4609-5"
    },
    {
      "text": "Stefano Padilla, Thomas S Methven, David W Corne, and Mike J Chantler. 2014. Hot topics in CHI: trend maps for visualising research. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 815--824.  ",
      "doi": "10.1145/2559206.2578867"
    },
    {
      "text": "Stefano Padilla, Thomas S Methven, David A Robb, and Mike J Chantler. 2017. Understanding Concept Maps: A Closer Look at How People Organise Ideas. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 815--827.  ",
      "doi": "10.1145/3025453.3025977"
    },
    {
      "text": "Michael Quinn Patton. 1990. Qualitative evaluation and research methods. SAGE Publications, inc.",
      "doi": ""
    },
    {
      "text": "Wolter Pieters. 2006. Acceptance of voting technology: between confidence and trust. In iTrust. Springer, 283--297.  ",
      "doi": "10.1007/11755593_21"
    },
    {
      "text": "Wolter Pieters. 2011. Explanation and trust: what to tell the user in security and AI? Ethics and information technology 13, 1 (2011), 53--64.  ",
      "doi": "10.1007/s10676-010-9253-3"
    },
    {
      "text": "Roberto Pinho, Maria Cristina F de Oliveira, and Alneu de A Lopes. 2009. Incremental board: a grid-based space for visualizing dynamic data sets. In Proceedings of the 2009 ACM symposium on Applied Computing. ACM, 1757--1764.  ",
      "doi": "10.1145/1529282.1529679"
    },
    {
      "text": "Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. Why should i trust you?: Explaining the predictions of any classifier. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 1135--1144.  ",
      "doi": "10.1145/2939672.2939778"
    },
    {
      "text": "David Silverman. 2013. Doing qualitative research: A practical handbook. SAGE Publications Limited.",
      "doi": ""
    },
    {
      "text": "Robert R Sokal. 1958. A statistical method for evaluating systematic relationship. University of Kansas science bulletin 28 (1958), 1409--1438.",
      "doi": ""
    },
    {
      "text": "Justin Solomon, Gabriel Peyré, Vladimir G Kim, and Suvrit Sra. 2016. Entropic metric alignment for correspondence problems. ACM Transactions on Graphics (TOG) 35, 4 (2016), 72.  ",
      "doi": "10.1145/2897824.2925903"
    },
    {
      "text": "Anselm L Strauss. 1987. Qualitative analysis for social scientists. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Pang-Ning Tan, Michael Steinbach, and Vipin Kumar. 2005. Introduction to data mining. 1st. (2005).",
      "doi": ""
    },
    {
      "text": "Joshua B Tenenbaum, Vin De Silva, and John C Langford. 2000. A global geometric framework for nonlinear dimensionality reduction. science 290, 5500 (2000), 2319--2323.",
      "doi": ""
    },
    {
      "text": "William MK Trochim. 1989. An introduction to concept mapping for planning and evaluation. Evaluation and program planning 12, 1 (1989), 1--16.",
      "doi": ""
    },
    {
      "text": "William M Trochim. 2017. Hindsight is 20/20: Reflections on the evolution of concept mapping. Evaluation and program planning 60 (2017), 176--185.",
      "doi": ""
    },
    {
      "text": "Tamara Van Gog, Liesbeth Kester, Fleurie Nievelstein, Bas Giesbers, and Fred Paas. 2009. Uncovering cognitive processes: Different techniques that can contribute to cognitive load research and instruction. Computers in Human Behavior 25, 2 (2009), 325--331.  ",
      "doi": "10.1016/j.chb.2008.12.021"
    },
    {
      "text": "Colin Ware. 2012. Information visualization: perception for design. Elsevier. ",
      "doi": "10.5555/2285540"
    },
    {
      "text": "Kelly D Wason, Michael J Polonsky, and Michael R Hyman. 2002. Designing vignette studies in marketing. Australasian Marketing Journal (AMJ) 10, 3 (2002), 41--58.",
      "doi": ""
    },
    {
      "text": "Tom Wengraf. 2001. Qualitative research interviewing: Biographic narrative and semi-structured methods. Sage.",
      "doi": ""
    },
    {
      "text": "James A Wise, James J Thomas, Kelly Pennock, David Lantrip, Marc Pottier, Anne Schur, and Vern Crow. 1995. Visualizing the non-visual: Spatial analysis and interaction with information from text documents. In Information Visualization, 1995. Proceedings. IEEE, 51--58. ",
      "doi": "10.5555/857186.857579"
    },
    {
      "text": "Iwan GJH Wopereis, Paul A Kirschner, Fred Paas, Slavi Stoyanov, and Maaike Hendriks. 2005. Failure and success factors of educational ICT projects: a group concept mapping approach. British Journal of Educational Technology 36, 4 (2005), 681--684.",
      "doi": ""
    }
  ]
}