{
  "doi": "10.1145/3173574.3174060",
  "title": "Supporting Rhythm Activities of Deaf Children using Music-Sensory-Substitution Systems",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Rhythm is the first musical concept deaf people learn in music classes. However, hearing loss limits the amount of information that allows a deaf person to evaluate his or her performance and stay in sync with other musicians. In this paper, we investigated how a visual and vibrotactile music-sensory-substitution device, MuSS-Bits++, affects rhythm discrimination, reproduction, and expressivity of deaf people. We conducted a controlled study with 11 deaf children and found that most participants felt more confident wearing the device in vibration mode even when it did not objectively improve their accuracy. Furthermore, we studied how MuSS-Bits++ can be used in music classes at deaf schools and what challenges and opportunities arise in such a setting. Based on these studies, we discuss insights and future directions that support the design and development of music-sensory-substitution systems for music making.",
  "authors": [
    {
      "name": "Benjamin Petry",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81548872256/rel-imgonly/benjaminjohannespetry-color-1024x10242.png",
      "acmid": "81548872256",
      "orcid": "missing"
    },
    {
      "name": "Thavishi Illandara",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659079992",
      "orcid": "missing"
    },
    {
      "name": "Don Samitha Elvitigala",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/do/10.1145/contrib-99659118088/rel-imgonly/1004585_677003825650293_574565969_n.jpg",
      "acmid": "99659118088",
      "orcid": "missing"
    },
    {
      "name": "Suranga Nanayakkara",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81416609140/rel-imgonly/_mg_5811-uoa.jpg",
      "acmid": "81416609140",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. Music and the Deaf. (March 2017). Retrieved March 6, 2017 from http://matd.org.uk/.",
      "doi": ""
    },
    {
      "text": "Caterina Bertini, Fabrizio Leo, Alessio Avenanti, and Elisabetta Ladavas. 2010. Independent mechanisms for ventriloquism and multisensory integration as revealed by theta-burst stimulation. European Journal of Neuroscience 31, 10 (2010), 1791--1799.",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Marshal Chasin. 2003. Music and hearing aids. The Hearing Journal 56, 7 (July 2003), 36.",
      "doi": ""
    },
    {
      "text": "Summer Crider. 2009. Re-Defining Music Through Deaf Lens. Master's thesis. Gallaudet University, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Alice-Ann Darrow. 1993. The Role of Music in Deaf Culture: Implications for Music Educators. Journal of Research in Music Education 41, 2 (July 1993), 93--110.",
      "doi": ""
    },
    {
      "text": "Ward R. Drennan and Jay T. Rubinstein. 2008. Music perception in cochlear implant users and its relationship with psychophysical capabilities. Journal of rehabilitation research and development 45, 5 (2008), 779--789.",
      "doi": ""
    },
    {
      "text": "Wiliam G Fawkes. 2006. The Teaching of Music to Hearing Impaired Children and Teenagers. http://www.maryharehistory.org.uk/articles/fawkes/fawkes_2006.pdf",
      "doi": ""
    },
    {
      "text": "Andy Field and Graham Hole. 2002. How to Design and Report Experiments. SAGE. Google-Books-ID: LN6QAwAAQBAJ.",
      "doi": ""
    },
    {
      "text": "Sean Forbes. 2017. Sean Forbes. (2017). Retrieved March 6, 2017 from http://www.deafandloud.com/.",
      "doi": ""
    },
    {
      "text": "David Fourney. 2015. Making The Invisible Visible: Visualization Of Music And Lyrics For Deaf And Hard Of Hearing Audiences. Ph.D. Dissertation. Ryerson University, Toronto, Ontario, Canada.",
      "doi": ""
    },
    {
      "text": "John J. Galvin, Qian-Jie Fu, and Robert V. Shannon. 2009. Melodic Contour Identification and Music Perception by Cochlear Implant Users. Annals of the New York Academy of Sciences 1169, 1 (July 2009), 518--533.",
      "doi": ""
    },
    {
      "text": "Evelyn Glennie. 2003. How to truly listen. (2003). https://www.ted.com/talks/evelyn_glennie_shows_how_to_listen",
      "doi": ""
    },
    {
      "text": "E Goldstein. 2009. Sensation and perception. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Maria Karam, Carmen Branje, Gabe Nespoli, Norma Thompson, Frank A. Russo, and Deborah I. Fels. 2010. The Emoti-chair: An Interactive Tactile Music Exhibit. In Proc. CHI EA 2010. ACM, New York, NY, USA, 3069--3074.  ",
      "doi": "10.1145/1753846.1753919"
    },
    {
      "text": "M. Karam, F.A. Russo, and D.I. Fels. 2009. Designing the Model Human Cochlea: An Ambient Crossmodal Audio-Tactile Display. IEEE Transactions on Haptics 2, 3 (July 2009), 160--169.  ",
      "doi": "10.1109/TOH.2009.32"
    },
    {
      "text": "Árni Kristjánsson, Alin Moldoveanu, Ómar I. Jóhannesson, Oana Balan, Simone Spagnol, Vigdís Vala Valgeirsdóttir, and Rúnar Unnthorsson. 2016. Designing sensory-substitution devices: Principles, pitfalls and potential. Restorative Neurology and Neuroscience 34, 5 (2016), 769--787.",
      "doi": ""
    },
    {
      "text": "Zefir Kurtisi, Xiaoyuan Gu, and Lars Wolf. 2006. Enabling Network-centric Music Performance in Wide-area Networks. Commun. ACM 49, 11 (Nov. 2006), 52--54.  ",
      "doi": "10.1145/1167838.1167862"
    },
    {
      "text": "Daniel J Levitin. 2011. This is your brain on music: Understanding a human obsession. Atlantic Books Ltd.",
      "doi": ""
    },
    {
      "text": "Charles Limb. 2011. Building the musical muscle. (2011). Retrieved November 11, 2014 from http://www.ted.com/talks/charles_limb_building_the_musical_muscle.",
      "doi": ""
    },
    {
      "text": "Suranga Nanayakkara, Elizabeth Taylor, Lonce Wyse, and S H. Ong. 2009. An Enhanced Musical Experience for the Deaf: Design and Evaluation of a Music Display and a Haptic Chair. In Proc. CHI 2009. ACM, New York, NY, USA, 337--346.  ",
      "doi": "10.1145/1518701.1518756"
    },
    {
      "text": "Carol A. Padden and Tom L. Humphries. 1990. Deaf in America: Voices from a Culture. Harvard University Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Russ Palmer. 1994. Tac-Tile Sound System. (1994). http://www.russpalmer.com/tactile.html",
      "doi": ""
    },
    {
      "text": "Benjamin Petry, Jochen Huber, and Suranga Nanayakkara. 2018. Scaffolding the Music Listening and Music Making Experience for the Deaf. In Assistive Augmentation. Springer, Singapore, 23--48. https://link. springer.com/chapter/10.1007/978--981--10--6404--3_3",
      "doi": ""
    },
    {
      "text": "Benjamin Petry, Thavishi Illandara, Juan Pablo Forero, and Suranga Nanayakkara. 2016b. Ad-Hoc Access to Musical Sound for Deaf Individuals. In Proc. ASSETS 2016. ACM, New York, NY, USA, 285--286.  ",
      "doi": "10.1145/2982142.2982213"
    },
    {
      "text": "Benjamin Petry, Thavishi Illandara, and Suranga Nanayakkara. 2016a. MuSS-Bits: Sensor-Display Blocks for Deaf People to Explore Musical Sounds. In Proc. OzCHI 2016. ACM, New York, NY, USA, 72--80.  ",
      "doi": "10.1145/3010915.3010939"
    },
    {
      "text": "Dirk-Jan Povel and Peter Essens. 1985. Perception of Temporal Patterns. Music Perception: An Interdisciplinary Journal 2, 4 (July 1985), 411--440. http://mp.ucpress.edu/content/2/4/411",
      "doi": ""
    },
    {
      "text": "Janine Roebuck. 2007. I am a deaf opera singer. (Sept. 2007). Retrieved August 26, 2015 from https://www.theguardian.com/theguardian/2007/sep/29/weekend7.weekend2.",
      "doi": ""
    },
    {
      "text": "Gottfried Schlaug. 2015. Musicians and music making as a model for the study of brain plasticity. In Progress in Brain Research. Music, Neurology, and Neuroscience: Evolution, the Musical Brain, Medical Conditions, and Therapies, Vol. 217. Elsevier, 37--55.",
      "doi": ""
    },
    {
      "text": "Gottfried Schlaug, Eckart Altenmüller, and Michael Thaut. 2010. Music listening and music making in the treatment of neurological disorders and impairments. Music Perception: An Interdisciplinary Journal 27, 4 (2010), 249--250.",
      "doi": ""
    },
    {
      "text": "Nathan Schuett. 2002. The effects of latency on ensemble performance. Bachelor Thesis, CCRMA Department of Music, Stanford University (2002).",
      "doi": ""
    },
    {
      "text": "Andrew Sears and Vicki L. Hanson. 2012. Representing Users in Accessibility Research. ACM Trans. Access. Comput. 4, 2 (March 2012), 7:1--7:6.  ",
      "doi": "10.1145/2141943.2141945"
    },
    {
      "text": "D Shibata. 2001. Brains of deaf people hear music. International Arts-Medicine Association Newsletter 16 (2001), 4.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Josh Tenenberg. 2009. A Blind Person's Interactions with Technology. Commun. ACM 52, 8 (Aug. 2009), 58--66.  ",
      "doi": "10.1145/1536616.1536636"
    },
    {
      "text": "Carl Stumpf. 1883. Tonpsychologie. Leipzig: Hirzel 1 (1883).",
      "doi": ""
    },
    {
      "text": "Joachim Taelman, S. Vandeput, A. Spaepen, and S. Van Huffel. 2009. Influence of Mental Stress on Heart Rate and Heart Rate Variability. In 4th European Conference of the International Federation for Medical and Biological Engineering. Springer, Berlin, Heidelberg, 1366--1369.",
      "doi": ""
    },
    {
      "text": "Eric Thul. 2008. Measuring the complexity of musical rhythm. Ph.D. Dissertation. McGill University.",
      "doi": ""
    },
    {
      "text": "Godfried T Toussaint. 2004. A Comparison of Rhythmic Similarity Measures. In Proc. ISMIR 2001.",
      "doi": ""
    },
    {
      "text": "Mitchell Tyler, Yuri Danilov, and Paul Bach-Y-Rita. 2003. Closing an open-loop control system: vestibular substitution through the tongue. Journal of Integrative Neuroscience 02, 02 (Dec. 2003), 159--164.",
      "doi": ""
    },
    {
      "text": "Ronald T Verillo. 1991. Vibration sensing in humans. Music Perception 9, 3 (1991), 281--302.",
      "doi": ""
    },
    {
      "text": "Georg Von Bekesy. 1959. Similarities between hearing and skin sensations. Psychological Review 66, 1 (1959), 1--22.",
      "doi": ""
    },
    {
      "text": "Yinsheng Zhou, Khe Chai Sim, Patsy Tan, and Ye Wang. 2012. MOGAT: Mobile Games with Auditory Training for Children with Cochlear Implants. In Proc. MM 2012. ACM, New York, NY, USA, 429--438.  ",
      "doi": "10.1145/2393347.2393409"
    }
  ]
}