{
  "doi": "10.1145/3173574.3173799",
  "title": "Slacktivists or Activists?: Identity Work in the Virtual Disability March",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Protests are important social forms of activism, but can be inaccessible to people with disabilities. Online activism, like the 2017 Disability March, has provided alternative venues for involvement in accessible protesting and social movements. In this study, we use identity theory as a lens to understand why and how disabled activists engaged in an online movement, and its impact on their self-concepts. We interviewed 18 disabled activists about their experiences with online protesting during the Disability March. Respondents' identities (as both disabled individuals and as activists) led them to organize or join the March, evolved alongside the group's actions, and were reprioritized or strained as a result of their involvement. Our findings describe the values and limitations of this activism to our respondents, highlight the tensions they perceived about their activist identities, and present opportunities to support further accessibility and identity changes by integrating technology into their activist experiences.",
  "tags": [
    "activism",
    "accessibility",
    "social media",
    "identity theory"
  ],
  "authors": [
    {
      "name": "Hanlin Li",
      "institution": "Indiana University - Purdue University Indianapolis & Northwestern University, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659080012",
      "orcid": "missing"
    },
    {
      "name": "Disha Bora",
      "institution": "Indiana University - Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659213893",
      "orcid": "missing"
    },
    {
      "name": "Sagar Salvi",
      "institution": "Indiana University - Purdue University Indianapolis, Indianapolis , IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214414",
      "orcid": "missing"
    },
    {
      "name": "Erin Brady",
      "institution": "Indiana University - Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/do/10.1145/contrib-81490664843/rel-imgonly/erinbradyphotowp.jpeg",
      "acmid": "81490664843",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "ADAPT. 2017. Save Disability-Specific Aspects Of ACA. Retrieved from http://adapt.org/save-disability-specific-aspects-of-aca/",
      "doi": ""
    },
    {
      "text": "Michael D. Ayers. 2013. comparing collective identity in online and offline feminist activists. In Cyberactivism: Online Activism in Theory and Practice. Routledge, 145.",
      "doi": ""
    },
    {
      "text": "Susan Balandin, Gwynnyth Llewellyn, Angela Dew, Liora Ballin, and Julie Schneider. 2006. Older disabled workers' perceptions of volunteering. Disability & Society 21, 7: 677--692.",
      "doi": ""
    },
    {
      "text": "Sharon Barnart, Kay Schriner, and Richard Scotch. 2001. Advocacy and Political Action. In Handbook of Disability Studies. SAGE Publications, Inc., 2455 Teller Road, Thousand Oaks California 91320 United States, 430--449.",
      "doi": ""
    },
    {
      "text": "Sharon N. Barnartt and Richard K. Scotch. 2001. Disability Protests: Contentious Politics 1970--1999. Gallaudet University Press.",
      "doi": ""
    },
    {
      "text": "W. Bennett. 2003. Communicating Global Activism. Information, Communication & Society 6, 2: 143--168.",
      "doi": ""
    },
    {
      "text": "Robert M. Bond, Christopher J. Fariss, Jason J. Jones, Adam DI Kramer, Cameron Marlow, Jaime E. Settle, and James H. Fowler. 2012. A 61-million-person experiment in social influence and political mobilization. Nature 489, 7415: 295--298.",
      "doi": ""
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. Collaborative Accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2373--2382.  ",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Judith Butler. 2015. Notes toward a performative theory of assembly. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Henrik Serup Christensen. 2011. Political activities on the Internet: Slacktivism or political participation by other means? First Monday 16, 2. Retrieved April 17, 2017 from http://firstmonday.org/ojs/index.php/fm/article/view/3336",
      "doi": ""
    },
    {
      "text": "Stephen Cornell and Douglas Hartmann. 2007. Ethnicity and Race: Making Identities in a Changing World. Pine Forge Press.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Shagun Jhaver, Benjamin Sugar, and Ingmar Weber. 2016. Social Media Participation in an Activist Movement for Racial Equality. In Tenth International AAAI Conference on Web and Social Media. Retrieved October 13, 2016 from http://www.munmund.net/pubs/BLM_ICWSM16.pdf",
      "doi": ""
    },
    {
      "text": "Jill P. Dimond, Michaelanne Dye, Daphne LaRose, and Amy S. Bruckman. 2013. Hollaback!: the role of storytelling online in a social movement organization. In Proceedings of the 2013 conference on Computer supported cooperative work, 477--490. Retrieved March 30, 2017 from http://dl.acm.org/citation.cfm?id=2441831  ",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Katie Dupere. Virtual march helps people with disabilities join the Women's March on Washington. Mashable. Retrieved April 25, 2017 from http://mashable.com/2017/01/18/disability-march-womens-march-on-washington/",
      "doi": ""
    },
    {
      "text": "Michelle Fine and Adrienne Asch. 1988. Disability Beyond Stigma: Social Interaction, Discrimination, and Activism. Journal of Social Issues 44, 1: 3--21.",
      "doi": ""
    },
    {
      "text": "E. Garcia-Iriarte, J. C. Kramer, J. M. Kramer, and J. Hammel. 2009. 'Who Did What?': A Participatory Action Research Project to Increase Group Capacity for Advocacy. Journal of Applied Research in Intellectual Disabilities 22, 1: 10--22.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 2009. Stigma: Notes on the management of spoiled identity. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2016. Digital Footprints and Changing Networks During Online Identity Transitions. In Proceedings of the 2016 SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 2895--2907.  ",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Oliver L. Haimson and Anna Lauren Hoffmann. 2016. Constructing and enforcing \"authentic\" identity online: Facebook, real names, and non-normative identities. First Monday 21, 6.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson and John C. Tang. 2017. What Makes Live Events Engaging on Facebook Live, Periscope, and Snapchat. In Proceedings of the 2017 SIGCHI Conference on Human Factors in Computing Systems, 48--60.  ",
      "doi": "10.1145/3025453.3025642"
    },
    {
      "text": "Aimi Hamraie. 2013. Designing collective access: A feminist disability theory of universal design. Disability Studies Quarterly 33, 4.",
      "doi": ""
    },
    {
      "text": "Sarah Parker Harris, Randall Owen, and Cindy De Ruiter. 2012. Civic Engagement and People with Disabilities: The Role of Advocacy and Technology. Journal of Community Engagement and Scholarship; Tuscaloosa 5, 1: 70--83.",
      "doi": ""
    },
    {
      "text": "Shih-Wen Huang, Minhyang (Mia) Suh, Benjamin Mako Hill, and Gary Hsieh. 2015. How Activists Are Both Born and Made: An Analysis of Users on Change.Org. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 211--220.  ",
      "doi": "10.1145/2702123.2702559"
    },
    {
      "text": "Rob Imrie and Marion Kumar. 1998. Focusing on disability and access in the built environment. Disability & Society 13, 3: 357--374.",
      "doi": ""
    },
    {
      "text": "K. Jill Kiecolt. 2000. Self-Change in Social Movements. In Self, Identity, and Social Movements. U of Minnesota Press, 110--131.",
      "doi": ""
    },
    {
      "text": "Malte Klar and Tim Kasser. 2009. Some Benefits of Being an Activist: Measuring Activism and Its Role in Psychological Well-Being. Political Psychology 30, 5: 755--777.",
      "doi": ""
    },
    {
      "text": "Kirk Kristofferson, Katherine White, and John Peloza. 2014. The nature of slacktivism: How the social observability of an initial act of token support affects subsequent prosocial action. Journal of Consumer Research 40, 6: 1149--1166.",
      "doi": ""
    },
    {
      "text": "Molly Beutz Land. 2009. Networked activism. Harv. Hum. Rts. J. 22: 205.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Mark Diaz, Robin Brewer, Chelsea Kim, and Anne Marie Piper. 2017. Going Gray, Failure to Hire, and the Ick Factor: Analyzing How Older Bloggers Talk about Ageism. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, 655--668.  ",
      "doi": "10.1145/2998181.2998275"
    },
    {
      "text": "Yu-Hao Lee and Gary Hsieh. 2013. Does Slacktivism Hurt Activism?: The Effects of Moral Balancing and Consistency in Online Activism. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 811--820.  ",
      "doi": "10.1145/2470654.2470770"
    },
    {
      "text": "Hanlin Li and Erin Brady. 2016. #accessibilityFail: Categorizing Shared Photographs of Physical Accessibility Problems. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 277--278.  ",
      "doi": "10.1145/2982142.2982186"
    },
    {
      "text": "Hanlin Li, Lynn Dombrowski, and Erin Brady. 2018. Working toward Empowering a Community: How Immigrant-Focused Nonprofit Organizations Use Twitter during Political Conflicts. In Proceedings of the 2018 ACM Conference on Supporting Groupwork (GROUP '18), 335--346.  ",
      "doi": "10.1145/3148330.3148336"
    },
    {
      "text": "Helen Margetts. 2016. Understanding Political Turbulence: The Data Science of Politics. In Proceedings of the 8th ACM Conference on Web Science (WebSci '16), 2--2.  ",
      "doi": "10.1145/2908131.2908136"
    },
    {
      "text": "Nina Mazar and Chen-Bo Zhong. 2010. Do Green Products Make Us Better People? Psychological Science 21, 4: 494--498.",
      "doi": ""
    },
    {
      "text": "Martha McCaughey and Michael D. Ayers. 2013. Cyberactivism: Online activism in theory and practice. Routledge. Retrieved from https://books.google.com/books?hl=en&lr=&id=cbxw-VEBnvUC&oi=fnd&pg=PP7&dq=Cyberactivism:+Online+Activism+in+Theory+and+Practice&ots=9FLorjnfK7&sig=n93BEJzY0Vs1hOaip9ZGBoVp8GU ",
      "doi": "10.5555/862162"
    },
    {
      "text": "Anna C. Merritt, Daniel A. Effron, and Benoît Monin. 2010. Moral Self-Licensing: When Being Good Frees Us to Be Bad. Social and Personality Psychology Compass 4, 5: 344--357.",
      "doi": ""
    },
    {
      "text": "Jasna S. Miloevi-orevi and Iris L. eelj. 2017. Civic Activism Online. Comput. Hum. Behav. 70, C: 113--118.  ",
      "doi": "10.1016/j.chb.2016.12.070"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. \"With most of it being pictures now, I rarely use it\": Understanding Twitter's Evolving Accessibility to Blind Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 5506--5516.  ",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Verta Taylor and Nancy E. Whittier. 1992. Collective identity in social movement communities: Lesbian feminist mobilization. In Social Perspectives in Lesbian and Gay Studies: A Reader. Routledge.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2001. International Classification of Functioning, Disability and Health: ICF. World Health Organization.",
      "doi": ""
    },
    {
      "text": "Debi Roker, Katie Player, and John Coleman. 1998. Challenging the image: The involvement of young people with disabilities in volunteering and campaigning. Disability & Society 13, 5: 725--741.",
      "doi": ""
    },
    {
      "text": "Lisa Schur, Todd Shields, Douglas Kruse, and Kay Schriner. 2002. Enabling democracy: disability and voter turnout. Political Research Quarterly 55, 1: 167--190.",
      "doi": ""
    },
    {
      "text": "Richard K. Scotch. 2009. \"Nothing About Us Without Us\": Disability Rights in America. OAH Magazine of History 23, 3: 17--22.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 705--714. Retrieved April 26, 2017 from http://dl.acm.org/citation.cfm?id=1979044  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "David A. Snow and Doug McAdam. 2000. Identity work processes in the context of social movements: clarifying the identity/movement nexus. In Self, Identity, and Social Movements. U of Minnesota Press, 41--67.",
      "doi": ""
    },
    {
      "text": "Jan E. Stets and Peter J. Burke. 2000. Identity Theory and Social Identity Theory. Social Psychology Quarterly 63, 3: 224--237.",
      "doi": ""
    },
    {
      "text": "Sheldon Stryker. 1980. Symbolic interactionism: A social structural version. Benjamin-Cummings Publishing Company.",
      "doi": ""
    },
    {
      "text": "Sheldon Stryker. 2000. identity competition key to differential social movement participation. In Self, Identity, and Social Movements. U of Minnesota Press, 1.",
      "doi": ""
    },
    {
      "text": "Sheldon Stryker and Richard T. Serpe. 1994. Identity Salience and Psychological Centrality: Equivalent, Overlapping, or Complementary Concepts? Social Psychology Quarterly 57, 1: 16--35.",
      "doi": ""
    },
    {
      "text": "Borislav Tadic, Markus Rohde, Volker Wulf, and David Randall. 2016. ICT Use by Prominent Activists in Republika Srpska. 3364--3377.  ",
      "doi": "10.1145/2858036.2858153"
    },
    {
      "text": "Patrick Underwood and Howard T. Welser. 2011. \"The Internet is Here\": Emergent Coordination and Innovation of Protest Forms in Digital Culture. In Proceedings of the 2011 iConference (iConference '11), 304--311.  ",
      "doi": "10.1145/1940761.1940803"
    },
    {
      "text": "Morgan Vigil-Hayes, Marisa Duarte, Nicholet Deschine Parkhurst, and Elizabeth Belding. 2017. #Indigenous: Tracking the Connective Actions of Native American Advocates on Twitter. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 1387--1399.  ",
      "doi": "10.1145/2998181.2998194"
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How Blind People Interact with Visual Content on Social Networking Services. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 1584--1595.  ",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "Elyse Wanshel. 2017. People With Disabilities Can Virtually Join The Women's March. Huffington Post. Retrieved April 25, 2017 from http://www.huffingtonpost.com/entry/disability-march-online-movement-womens-march-washington-disabled_us_58813a39e4b0e3a735680f3e",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Konstantin Aal, Ibrahim Abu Kteish, Meryem Atam, Kai Schubert, Markus Rohde, George P. Yerousis, and David Randall. 2013. Fighting Against the Wall: Social Media Use by Political Activists in a Palestinian Village. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1979--1988.  ",
      "doi": "10.1145/2470654.2466262"
    },
    {
      "text": "Leslie Young and Rex Pace. 2002. Accessible Temporary Events, A Planning Guide. Design Research and Methods Journal 1, 1.",
      "doi": ""
    },
    {
      "text": "An Introductory Guide to Disability Language and Empowerment. Retrieved January 5, 2018 from http://sudcc.syr.edu/LanguageGuide/index.html",
      "doi": ""
    },
    {
      "text": "The brave new world of slacktivism. Foreign Policy. Retrieved April 26, 2017 from https://foreignpolicy.com/2009/05/19/the-brave-new-world-of-slacktivism/",
      "doi": ""
    },
    {
      "text": "Disabled Activists Put Their Bodies on the Line to Defend Health Care. Common Dreams. Retrieved September 19, 2017 from https://www.commondreams.org/views/2017/06/26/disabled-activists-put-their-bodies-line-defend-health-care",
      "doi": ""
    },
    {
      "text": "'They want a voice': Disabled who couldn't go to Women's March found a way to be heard. Washington Post. Retrieved April 25, 2017 from https://www.washingtonpost.com/local/they-want-a-voice-disabled-who-couldnt-go-to-womens-march-found-a-way-to-be-heard/2017/01/24/5f74073e-e280--11e6-a453--19ec4b3d09ba_story.html",
      "doi": ""
    }
  ]
}