{
  "doi": "10.1145/3173574.3174002",
  "title": "Substituting Motion Effects with Vibrotactile Effects for 4D Experiences",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-6",
  "year": 2018,
  "badges": [],
  "abstract": "In this paper, we present two methods to substitute motion effects using vibrotactile effects in order to improve the 4D experiences of viewers. This work was motivated by the needs of more affordable 4D systems for individual users. Our sensory substitution algorithms convert motion commands to vibrotactile commands to a grid display that uses multiple actuators. While one method is based on the fundamental principle of vestibular feedback, the other method makes use of intuitive visually-based mapping from motion to vibrotactile stimulation. We carried out a user study and could confirm the effectiveness of our substitution methods in improving 4D experiences. To our knowledge, this is the first study that investigated the feasibility of replacing motion effects using much simpler and less expensive vibrotactile effects.",
  "tags": [
    "motion",
    "4d",
    "sensory substitution",
    "vestibular",
    "vibrotactile"
  ],
  "authors": [
    {
      "name": "Jongman Seo",
      "institution": "Pohang University of Science & Technology, Pohang, Gyeongbuk, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459759257",
      "orcid": "missing"
    },
    {
      "name": "Sunung Mun",
      "institution": "Pohang University of Science & Technology, Pohang, Gyeongbuk, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261216",
      "orcid": "missing"
    },
    {
      "name": "Jaebong Lee",
      "institution": "NVIDIA, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81555716556",
      "orcid": "missing"
    },
    {
      "name": "Seungmoon Choi",
      "institution": "Pohang University of Science & Technology, Pohang, Gyeongbuk, Rebublic of Korea",
      "img": "/do/10.1145/contrib-81100480604/rel-imgonly/bio_seungmoonchoi.jpg",
      "acmid": "81100480604",
      "orcid": "0000-0002-5889-1083"
    }
  ],
  "references": [
    {
      "text": "Leandro Cancar, Alex Díaz, Antonio Barrientos, David Travieso, and David M Jacobs. 2013. Tactile-sight: A sensory substitution device based on distance-related vibrotactile flow. International Journal of Advanced Robotic Systems 10, 6 (2013), 272.",
      "doi": ""
    },
    {
      "text": "Fabien Danieau, Julien Fleureau, Philippe Guillotel, Nicolas Mollet, Marc Christie, and Anatole Lecuyer. 2012. HapSeat: Producing Motion Sensation with Multiple Force-feedback Devices Embedded in a Seat. In Proceedings of ACM Symposium on Virtual Reality Software and Technology (VRST). 69--76.  ",
      "doi": "10.1145/2407336.2407350"
    },
    {
      "text": "Thiago Silva Filgueiras, Ana Carolina Oliveira Lima, Renan Lima Baima, Gabriel Tadayoshi Rodrigues Oka, Luiz Alberto Queiroz Cordovil, and Moisés Pereira Bastos. 2016. Vibrotactile sensory substitution on personal navigation: Remotely controlled vibrotactile feedback wearable system to aid visually impaired. In Proceedings of the IEEE International Symposium on Medical Measurements and Applications (MeMeA). IEEE, 1--5.",
      "doi": "10.1109/MeMeA.2016.7533768"
    },
    {
      "text": "Fred E. Guedry. 1974. Vestibular System Part 2: Psychophysics, Applied Aspects and General Interpretations. Springer, Chapter Psychophysics of Vestibular Sensation, 3--154.",
      "doi": ""
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011. Tactile brush: drawing on skin with a tactile grid display. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI). 2019--2028.  ",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Ali Israr, Zachary Schwemler, John Mars, and Brian Krainer. 2016. VR360HD: A VR360° player with enhanced haptic feedback. In Proceedings of the ACM Conference on Virtual Reality Software and Technology. 183--186.  ",
      "doi": "10.1145/2993369.2993404"
    },
    {
      "text": "Ali Israr, Siyan Zhao, Kaitlyn Schwalje, Roberta Klatzky, and Jill Lehman. 2014. Feel Effects: Enriching Storytelling with Haptic Feedback. ACM Transactions on Applied Perception 11, 3 (2014), 11:1--11:17.  ",
      "doi": "10.1145/2641570"
    },
    {
      "text": "Myongchan Kim, Sungkil Lee, and Seungmoon Choi. 2014. Saliency-driven real-time video-to-tactile translation. IEEE Transactions on Haptics 7, 3 (2014), 394--404.",
      "doi": ""
    },
    {
      "text": "Yeongmi Kim, Jongeun Cha, Jeha Ryu, and Ian Oakley. 2010. A tactile glove design and authoring system for immersive multimedia. IEEE MultiMedia 17, 3 (2010), 34--45.  ",
      "doi": "10.1109/MMUL.2009.63"
    },
    {
      "text": "Jaebong Lee, Bohyung Han, and Seungmoon Choi. 2016a. Interactive Motion Effects Design for a Moving Object in 4D Films. In Proceedings of the ACM Conference on Virtual Reality Software and Technology (VRST). 219--228.  ",
      "doi": "10.1145/2993369.2993389"
    },
    {
      "text": "Jaebong Lee, Bohyung Han, and Seungmoon Choi. 2016b. Motion Effects Synthesis for 4D Films. IEEE Transactions on Visualization and Computer Graphics 22, 10 (2016), 2300--2314.",
      "doi": "10.1109/TVCG.2015.2507591"
    },
    {
      "text": "Paul Lemmens, Floris Crompvoets, Dirk Brokken, Jack Van Den Eerenbeemd, and Gert-Jan de Vries. 2009. A body-conforming tactile jacket to enrich movie viewing. In Proceedings of the World Haptics Conference. IEEE, 7--12.  ",
      "doi": "10.1109/WHC.2009.4810832"
    },
    {
      "text": "Meyer A. Nahon and Lloyd D. Reid. 1990. Simulator Motion-Drive Algorithms: A Designer's Perspective. Journal of Guidance, Control, and Dynamics 13, 2 (1990), 356--362.",
      "doi": ""
    },
    {
      "text": "A. H. Rupert. 2000. Tactile situation awareness system: Proprioceptive prostheses for sensory deficiencies. Aviation Space & Environmental Medicine 71, 9, Suppl. (2000), A92--A99.",
      "doi": ""
    },
    {
      "text": "Oliver S Schneider, Ali Israr, and Karon E MacLean. 2015. Tactile animation by direct manipulation of grid displays. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (VRST). 21--30.  ",
      "doi": "10.1145/2807442.2807470"
    },
    {
      "text": "Suchul Shin, Byounghyun Yoo, and Soonhung Han. 2013. A Framework for Automatic Creation of Motion Effects from Theatrical Motion Pictures. Multimedia Systems 20 (2013), 327--346.  ",
      "doi": "10.1007/s00530-013-0322-4"
    }
  ]
}