{
  "doi": "10.1145/3173574.3173953",
  "title": "The Impact of Abstract vs. Concrete Feedback Design on Behavior Insights from a Large Eco-Driving Field Experiment",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "About 17% of the worldwide CO2-emissions can be ascribed to road transportation. Using information systems (IS)-enabled feedback has shown to be very efficient in promoting a less fuel-consuming driving style. Today, in-car IS that provide feedback on driving behavior are in the midst of a fundamental change. Increasing digitalization of in-car IS enables virtually any kind of feedback. Still, we see a gap in the empirical evidence on how to leverage this potential, raising questions on future HCI-based feedback design. To address this knowledge gap, we designed an eco-driving feedback IS and, building upon construal level theory, hypothesize that abstract feedback is more effective in reducing fuel consumption than concrete feedback. Deployed in a large field experiment with 56 participants covering over 297,000km, we provide first empirical evidence that supports this hypothesis. Despite its limitations, this research may have general implications for the design of real-time feedback.",
  "authors": [
    {
      "name": "André Dahlinger",
      "institution": "University St. Gallen, St. Gallen, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020983",
      "orcid": "missing"
    },
    {
      "name": "Felix Wortmann",
      "institution": "University of St. Gallen, St. Gallen, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100334409",
      "orcid": "0000-0001-5034-2023"
    },
    {
      "name": "Benjamin Ryder",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659088168",
      "orcid": "missing"
    },
    {
      "name": "Bernhard Gahr",
      "institution": "University St. Gallen, St. Gallen, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488671076",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A E af Wahlberg. 2007. Long-term effects of training in economical driving: Fuel consumption, accidents, driver acceleration behavior and technical feedback. International Journal of Industrial Ergonomics 37, 4: 333--343. Retrieved July 22, 2014 from http://linkinghub.elsevier.com/retrieve/pii/S016981 410600268X",
      "doi": ""
    },
    {
      "text": "H. Allcott and S. Mullainathan. 2010. Behavior and Energy Policy. Science 327, 5970: 1204--1205.",
      "doi": ""
    },
    {
      "text": "Auto Alliance. 2014. How automakers are driving innovation.",
      "doi": ""
    },
    {
      "text": "Sebastian Bamberg and Guido Möser. 2007. Twenty years after Hines, Hungerford, and Tomera: A new meta-analysis of psycho-social determinants of proenvironmental behaviour. Journal of environmental psychology 27, 1: 14--25. Retrieved from http://www.sciencedirect.com/science/article/pii/S0 272494406000909",
      "doi": ""
    },
    {
      "text": "D Barić, G Zovak, and M Periša. 2013. Effects of Eco-Drive Education on the Reduction of Fuel Consumption and CO2 Emissions. PROMET (Traffic & Transportation) 25, 3: 265--272. Retrieved August 12, 2014 from http://hrcak.srce.hr/index.php'show=clanak&id_cla nak_jezik=164450",
      "doi": ""
    },
    {
      "text": "Jack N. Barkenbus. 2010. Eco-driving: An overlooked climate change initiative. Energy Policy 38, 2: 762--769. Retrieved July 15, 2014 from http://linkinghub.elsevier.com/retrieve/pii/S030142",
      "doi": ""
    },
    {
      "text": "Marie-Claude Boudreau, Adela J. Chen, and Mark Huber. 2008. Green IS?: Building Sustainable Business Practices. In Information Systems: A Global Text, Richard T. Watson (ed.). GA: Global Text Project, Athens, 1--17. Retrieved from http://globaltext.org/books",
      "doi": ""
    },
    {
      "text": "Wei-yao Chou, Yi-chun Lin, Yu-hui Lin, and Syuanyi Chen. 2012. Intelligent eco-driving suggestion system based on vehicle loading model. 2012 12th Int Conf on ITS Telecommunications, IEEE, 558-- 562.",
      "doi": ""
    },
    {
      "text": "André Dahlinger and Felix Wortmann. 2016. Towards the Design of Eco-Driving Feedback Information Systems -- A Literature Review. In Multikonferenz Wirtschaftsinformatik (MKWI) 2016, Steffen Straßburger und Daniel Fischer Volker Nissen, Dirk Stelzer (ed.). Universitätsverlag Ilmenau, Ilmenau, 801--812.",
      "doi": ""
    },
    {
      "text": "André Dahlinger and Felix Wortmann. 2016. Fostering Pro-Environmental Behavior with Green Consumer IS: The Effects of IS-Induced Construal and General IS Usage Motivations. ECIS.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Miguel Sicart, Lennart Nacke, Kenton O'Hara, and Dan Dixon. 2011. Gamification. using game-design elements in nongaming contexts. Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems, ACM, 2425--2428.  ",
      "doi": "10.1145/1979742.1979575"
    },
    {
      "text": "Ebru Dogan, Linda Steg, and Patricia Delhomme. 2011. The influence of multiple goals on driving behavior: the case of safety, time saving, and fuel saving. Accident; analysis and prevention 43, 5: 1635--43.",
      "doi": ""
    },
    {
      "text": "Tal Eyal, Nira Liberman, and Yaacov Trope. 2008. Judging near and distant virtue and vice. Journal of Experimental Social Psychology 44, 4: 1204--1209.",
      "doi": ""
    },
    {
      "text": "Corinna Fischer. 2008. Feedback on household electricity consumption: a tool for saving energy? Energy Efficiency 1, 1: 79--104.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, et al. 2009. UbiGreen. Proceedings of the 27th international conference on Human factors in computing systems - CHI 09, ACM Press, 1043.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Leah Findlater, and James Landay. 2010. The design of eco-feedback technology. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, ACM Press, 1999--2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Jon Froehlich, Leah Findlater, Marilyn Ostergren, et al. 2012. The design and evaluation of prototype ecofeedback displays for fixture-level water usage data. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, 2367--2376.  ",
      "doi": "10.1145/2207676.2208397"
    },
    {
      "text": "Kentaro Fujita, Marlone D. Henderson, Juliana Eng, Yaacov Trope, and Nira Liberman. 2006. Spatial distance and mental construal of social events. Psychological Science 17, 4: 278--280.",
      "doi": ""
    },
    {
      "text": "GFEI. 2014. Fuel Economy State of the World 2014.",
      "doi": ""
    },
    {
      "text": "Shirley Gregor and Alan R Hevner. 2013. Positioning and presenting design science research for maximum impact. MIS Quarterly 37, 2: 337--355.  ",
      "doi": "10.25300/MISQ/2013/37.2.01"
    },
    {
      "text": "GSMA. 2012. 2025 Every Car Connected.",
      "doi": ""
    },
    {
      "text": "J. Hattie and H. Timperley. 2007. The Power of Feedback. Review of Educational Research 77, 1: 81--112. Retrieved April 28, 2014 from",
      "doi": ""
    },
    {
      "text": "Jerry A. Hausman and David A. Wise. 1979. Attrition Bias in Experimental and Panel Data: The Gary Income Maintenance Experiment. Econometrica 47, 2: 455.",
      "doi": ""
    },
    {
      "text": "International Transportation Forum (ITF). 2010. Transport Green House Gas Emissions - Country Data 2010.",
      "doi": ""
    },
    {
      "text": "Beth Karlin, Joanne F. Zinger, and Rebecca Ford. 2015. The effects of feedback on energy conservation: A meta-analysis. Psychological Bulletin 141, 6: 1205--1227.",
      "doi": ""
    },
    {
      "text": "AN Kluger and A DeNisi. 1996. The effects of feedback interventions on performance: a historical review, a meta-analysis, and a preliminary feedback intervention theory. Psychological Bulletin II, 2: 254--284. Retrieved November 26, 2014 from http://psycnet.apa.org/journals/bul/119/2/254/",
      "doi": ""
    },
    {
      "text": "A. Ledgerwood and S. P. Callahan. 2012. The Social Side of Abstraction: Psychological Distance Enhances Conformity to Group Norms. Psychological Science 23, 8: 907--913.",
      "doi": ""
    },
    {
      "text": "H Lee, W Lee, and Y K Lim. 2010. The effect of ecodriving system towards sustainable driving behavior. CHI 2010, 4255--4260. Retrieved from http://dl.acm.org/citation.cfm?id=1754135  ",
      "doi": "10.1145/1753846.1754135"
    },
    {
      "text": "Nira Liberman and Yaacov Trope. 2014. Traversing psychological distance. Trends in Cognitive Sciences 18, 7: 364--369.",
      "doi": ""
    },
    {
      "text": "Claire-Michelle Loock, Thorsten Staake, and F Thiesse. 2013. Motivating Energy-Efficient Behavior with Green IS: An Investigation of Goal Setting and the Role of Defaults. MIS Quaterly 37, 4: 1313--1332.  ",
      "doi": "10.25300/MISQ/2013/37.4.15"
    },
    {
      "text": "Ritch Macefield. 2007. Usability Studies and the Hawthorne Effect. Journal of Usability Studies 2, 3: 145--154. Retrieved from http://www.usabilityprofessionals.org/upa_publicati ons/jus/2007may/hawthorne-effect.pdf ",
      "doi": "10.5555/2835547.2835551"
    },
    {
      "text": "V. Corcoba Magana and M. Munoz Organero. 2013. GAFU: A game to save fuel using social networks. 2013 International Conference on Connected Vehicles and Expo (ICCVE), IEEE, 151--157.",
      "doi": ""
    },
    {
      "text": "A Malhotra, NP Melville, and Richard T. Watson. 2013. Spurring Impactful Research on Information Systems for Environmental Sustainability. MIS Quarterly 37, 4: 1265--1274.  ",
      "doi": "10.25300/MISQ/2013/37%3A4.3"
    },
    {
      "text": "N P Melville. 2010. Information systems innovation for environmental sustainability. MIS Quarterly 34, 1: 1--21. http://doi.org/Article ",
      "doi": "10.5555/2017447.2017449"
    },
    {
      "text": "Scott Nicholson. 2012. A user-centered theoretical framework for meaningful gamification. Games+ Learning+ Society. Retrieved June 12, 2014 from http://scottnicholson.com/pubs/meaningfulframewo rk.pdf",
      "doi": ""
    },
    {
      "text": "Johannes Paefgen, Thorsten Staake, and Elgar Fleisch. 2014. Multivariate exposure modeling of accident risk: Insights from Pay-as-you-drive insurance data. Transportation Research Part A: Policy and Practice 61: 27--40.",
      "doi": ""
    },
    {
      "text": "Mashfiqui Rabbi. 2014. Automated mobile systems for multidimensional well-being sensing and feedback. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing Adjunct Publication UbiComp '14 Adjunct, 325--330.  ",
      "doi": "10.1145/2638728.2638839"
    },
    {
      "text": "Miyuki Shiraishi, Yasuyuki Washio, Chihiro Takayama, Vili Lehdonvirta, Hiroaki Kimura, and Tatsuo Nakajima. 2009. Using individual, social and economic persuasion techniques to reduce CO 2 emissions in a family setting. Proceedings of the 4th International Conference on Persuasive Technology - Persuasive '09, ACM Press, 1.  ",
      "doi": "10.1145/1541948.1541967"
    },
    {
      "text": "Robin Smit, Geoffrey Rose, and Mark Symmons. 2010. Assessing the Impacts of Ecodriving on Fuel Consumption and Emissions for the Australian Situation. ATRF 2010 Proceedings.",
      "doi": ""
    },
    {
      "text": "P. C. Stern and G. D. Brewer. 2005. Decision Making for the Environment: Social and Behavioral Science Research Priorities. National Academies Press.",
      "doi": ""
    },
    {
      "text": "Tai Stillwater and Kenneth S. Kurani. 2011. Field Test of Energy Information Feedback. Transportation Research Record: Journal of the Transportation Research Board 2252: 7--15.",
      "doi": ""
    },
    {
      "text": "Tai Stillwater and Kenneth S. Kurani. 2014. EcoDrive I-80: A Large Sample Fuel Economy Feedback Experiment. Transportation Research Board 93rd Annual Meeting, 14--74. Retrieved September 10, 2014 from https://fueleconomy.gov/feg/pdfs/EcoDrive I-80.pdf",
      "doi": ""
    },
    {
      "text": "Fazal U. Syed and Dimitar Filev. 2008. Real time Advisory System for Fuel Economy Improvement in a Hybrid Electric Vehicle. NAFIPS 2008 - 2008 Annual Meeting of the North American Fuzzy Information Processing Society, IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Verena Tiefenbeck, Lorenz Goette, Kathrin Degen, et al. 2016. Overcoming Salience Bias: How RealTime Feedback Fosters Resource Conservation. Management Science.",
      "doi": ""
    },
    {
      "text": "H.Y. Tong, W.T. Hung, and C.S. Cheung. 2000. OnRoad Motor Vehicle Emissions and Fuel Consumption in Urban Driving Conditions. Journal of the Air & Waste Management Association 50, 4: 543--554.",
      "doi": ""
    },
    {
      "text": "Yaacov Trope and Nira Liberman. 2000. Temporal construal and time-dependent changes in preference. Journal of Personality and Social Psychology 79, 6: 876--889.",
      "doi": ""
    },
    {
      "text": "Yaacov Trope and Nira Liberman. 2010. Construallevel theory of psychological distance. Psychological Review 117, 2: 440--463.",
      "doi": ""
    },
    {
      "text": "Yaacov Trope, Nira Liberman, and Cheryl Wakslak. 2007. Construal Levels and Psychological Distance: Effects on Representation, Prediction, Evaluation, and Behavior. Journal of consumer psychology?: the official journal of the Society for Consumer Psychology 17, 2: 83--95.",
      "doi": ""
    },
    {
      "text": "Johannes Tulusan, Lito Soi, Johannes Paefgen, Marc Brogle, and Thorsten Staake. 2011. Eco-efficient feedback technologies: Which eco-feedback types prefer drivers most? World of Wireless, Mobile and Multimedia Networks (WoWMoM), 2011 IEEE International Symposium on a, IEEE, 1--8.  ",
      "doi": "10.1109/WoWMoM.2011.5986187"
    },
    {
      "text": "Johannes Tulusan, T Staake, and E Fleisch. 2012. Providing eco-driving feedback to corporate car drivers: what impact does a smartphone application have on their fuel efficiency? UbiComp: 1--4. Retrieved May 7, 2014 from http://dl.acm.org/citation.cfm?id=2370250",
      "doi": ""
    },
    {
      "text": "Alfonso Velosa, James F. Hines, Hung LeHong, Earl Perkins, and Satish R.M. 2015. Predicts 2015: The Internet of Things.",
      "doi": ""
    },
    {
      "text": "I. De Vlieger. 1997. On board emission and fuel consumption measurement campaign on petroldriven passenger cars. Atmospheric Environment 31, 22: 3753--3761.",
      "doi": ""
    },
    {
      "text": "Mascha van der Voort, Mark S Dougherty, and Martin van Maarseveen. 2001. A prototype fuelefficiency support tool. Transportation Research Part C: Emerging Technologies 9, 4: 279--296.",
      "doi": ""
    },
    {
      "text": "Richard T. Watson, Marie-Claude Boudreau, and Adela J. Chen. 2010. Information systems and environmentally sustainable development: energy informatics and new directions for the is community. MIS Quarterly 34, 1: 23--38. ",
      "doi": "10.5555/2017447.2017450"
    }
  ]
}