{
  "doi": "10.1145/3173574.3173766",
  "title": "Understanding the Use and Impact of the Zero-Rated Free Basics Platform in South Africa",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Companies are offering zero-rated, or data-charge free Internet services to help bring unconnected users online where Internet access is less affordable. However, it is unclear whether these services achieve this goal or how they shape Internet use. To inform evidence-based policy around and the design of zero-rated services, we show in this paper how mobile users are making use of Facebook's controversial Free Basics platform. We present findings from interviews of 35 Free Basics users in South Africa: current low-income users and non-regular student users. Our findings suggest that Free Basics does shape Internet usage, for instance, users spend more time online because of 'free' apps. Second, Free Basics saves users money but adoption of the platform depends on access to other 'free' Internet options. Finally, most users are confused about how zero-rated services work and what 'free' means. Based on our findings, we make recommendations for future work.",
  "tags": [
    "south africa",
    "zero-rating",
    "zero-rated",
    "free basics",
    "internet"
  ],
  "authors": [
    {
      "name": "Julianne Romanosky",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261895",
      "orcid": "missing"
    },
    {
      "name": "Marshini Chetty",
      "institution": "Princeton University, Princeton, NJ, USA",
      "img": "/do/10.1145/contrib-81328487724/rel-imgonly/a08a3333.jpg",
      "acmid": "81328487724",
      "orcid": "0000-0003-0804-6110"
    }
  ],
  "references": [
    {
      "text": "Access Now. 2015. Open Letter to Mark Zuckerberg Regarding Internet.org, Net Neutrality, Privacy, and Security. (2015). https://www.facebook.com/notes/access-now/open-letterto-mark-zuckerberg-regarding-internetorg-netneutrality-privacy-and-/935857379791271/",
      "doi": ""
    },
    {
      "text": "Access Now. 2016. Indian regulator stands up for Net Neutrality, rules against zero-rated services. (Febraury 2016). https://www.accessnow.org/indian-regulator-stands-upfor-net-neutrality-rules-against-zero-rated-services/",
      "doi": ""
    },
    {
      "text": "Alliance for Affordable Internet. 2016. The Impacts of Emerging Mobile Data Services in Developing Countries. (2016). http://a4ai.org/the-impacts-of-emerging-mobiledata-services-in-developing-countries/",
      "doi": ""
    },
    {
      "text": "BJ Ard. 2015. Beyond Neutrality: How Zero Rating Can (Sometimes) Advance User Choice, Innovation, and Democratic Participation. Maryland Law Review 4, 3 (2015), 984--1028.",
      "doi": ""
    },
    {
      "text": "BBC. 2016. South African police clash with students over fees. (Spetember 2016). http://www.bbc.com/news/world-africa-37417402",
      "doi": ""
    },
    {
      "text": "Luca Belli. 2016. Net neutrality reloaded: zero rating, specialised service, ad blocking and traffic management. (2016).",
      "doi": ""
    },
    {
      "text": "Michael L Best. 2014. The internet that Facebook built. Commun. ACM 57, 12 (2014), 21--23.  ",
      "doi": "10.1145/2676857"
    },
    {
      "text": "Business Insider. 2017. Facebook offers thousands of cheap WiFi hotspots to fuel expansion in India. (May 2017). http://www.businessinsider.com/facebook-offersthousands-of-express-wifi-hotspots-in-india-2017--5",
      "doi": ""
    },
    {
      "text": "Diana Carew. 2015. Zero-Rating: Kick-Starting Internet Ecosystems in Developing Countries. (March 2015). http://www.progressivepolicy.org/wp-content/uploads/ 2015/03/2015.03-Carew_Zero-Rating_Kick-StartingInternet-Ecosystems-in-Developing-Countries.pdf",
      "doi": ""
    },
    {
      "text": "Arturo J Carrillo. 2015. Having Your Cake and Eating It Too: Zero-Rating, Net Neutrality, and International Law. Stan. Tech. L. Rev. 19 (2015), 364.",
      "doi": ""
    },
    {
      "text": "Cell C. 2017. Free Basics for Facebook. (January 2017). http://www.cellc.co.za/cellc/free-basics-by-facebook",
      "doi": ""
    },
    {
      "text": "Device Atlas. 2017. The Mobile Web Intelligence Report Q4 2016. (2017).",
      "doi": ""
    },
    {
      "text": "Jonathan Donner and Marion Walton. 2013. Your Phone Has Internet - Why Are You at a Library PC? Re-imagining Public Access in the Mobile Internet Era. Springer Berlin Heidelberg, Berlin, Heidelberg, 347--364.",
      "doi": ""
    },
    {
      "text": "Facebook. 2015a. One Year In: Internet.org Free Basic Services. (July 2015). http://newsroom.fb.com/news/2015/ 07/one-year-in-internet-org-free-basic-services/",
      "doi": ""
    },
    {
      "text": "Facebook. 2015b. Update to Internet.org Free Basic Services. (September 2015). http://newsroom.fb.com/news/ 2015/09/update-to-internet-org-free-basic-services/",
      "doi": ""
    },
    {
      "text": "Facebook. 2016. Aquila's First Flight: A Big Milestone Toward Connecting Billions of People. (July 2016). http: //newsroom.fb.com/news/2016/07/aquilas-first-flight-abig-milestone-toward-connecting-billions-of-people/",
      "doi": ""
    },
    {
      "text": "Federal Communications Commission. 2017. Wireless Telecommunications Bureau Report: Policy Review of Mobile Broadband Operators' Sponsored Data Offerings for Zero-Rated Content and Services. (2017). https:// apps.fcc.gov/edocs_public/attachmatch/DOC-342987A1.pdf",
      "doi": ""
    },
    {
      "text": "Ariel Futter and Alison Gillwald. 2015. Zero-rated internet services: What is to be done? Broadband 4 Africa 1 (2015), 1--10.",
      "doi": ""
    },
    {
      "text": "Helani Galpaya. 2017. Zero-Rating in Emerging Economies. (2017).",
      "doi": ""
    },
    {
      "text": "Genevieve Gebhart. 2016. Zero-rating in emerging mobile markets: Free Basics and Wikipedia Zero in Ghana. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. ACM, 16.  ",
      "doi": "10.1145/2909609.2909663"
    },
    {
      "text": "Alison Gillwald, Ariel Futter Chenai Chair, Kweku Koranteng, Fola Odufuwa, and John Walubengo. 2016. Much Ado about Nothing: Zero-rating in the African Context. (September 2016).",
      "doi": ""
    },
    {
      "text": "Shikoh Gitau, Gary Marsden, and Jonathan Donner. 2010. After Access: Challenges Facing Mobile-only Internet Users in the Developing World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2603--2606.  ",
      "doi": "10.1145/1753326.1753720"
    },
    {
      "text": "International Telecommunications Union. 2015a. Fixed Braodband Indicators 2000--2015. (2015). http://www.itu.int/en/ITU-D/Statistics/Documents/ statistics/2016/Fixed_broadband_2000--2015.xls",
      "doi": ""
    },
    {
      "text": "International Telecommunications Union. 2015b. Mobile Cellular Subscriptions 2000--2015. (2015). http://www.itu.int/en/ITU-D/Statistics/Documents/ statistics/2016/Mobile_cellular_2000--2015.xls",
      "doi": ""
    },
    {
      "text": "International Telecommunications Union. 2016. Individual Internet Use 2000--2015. (2016). http://www.itu.int/en/ITU-D/Statistics/Documents/ statistics/2016/Individuals_Internet_2000--2015.xls",
      "doi": ""
    },
    {
      "text": "Internet.org. 2017. Express Wi-Fi by Facebook. (2017). https://info.internet.org/en/story/expresswifi/",
      "doi": ""
    },
    {
      "text": "Internet.org. 2017a. Free Basics by Facebook. (May 2017). https://info.internet.org/en/story/free-basicsfrom-internet-org/",
      "doi": ""
    },
    {
      "text": "Internet.org. 2017b. Where we've launched. (Feb 2017). https: //info.internet.org/en/story/where-weve-launched/",
      "doi": ""
    },
    {
      "text": "Roslyn Layton and Silvia Monica Elaluf-Calderwood. 2016. Free Basics Research Paper: Zero Rating, Free Data, and Use Cases in mhealth, Local Content and Service Development, and ICT4D Policymaking. (2016).",
      "doi": ""
    },
    {
      "text": "Daniel Lyons. 2014. Innovations in mobile broadband pricing. (2014).",
      "doi": ""
    },
    {
      "text": "Arunesh Mathur, Brent Schlotfeldt, and Marshini Chetty. 2015. A Mixed-Methods Study of Mobile Users' Data Usage Practices in South Africa. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 1209--1220.  ",
      "doi": "10.1145/2750858.2804292"
    },
    {
      "text": "Daniel Miller. 2011. Tales from Facebook. Polity.",
      "doi": ""
    },
    {
      "text": "Mozilla. 2017. Mozilla releases research results: Zero rating is not serving as an on-ramp to the Internet. (July 2017). https://blog.mozilla.org/blog/2017/07/31/ mozilla-releases-research-results-zero-rating-notserving-ramp-internet/",
      "doi": ""
    },
    {
      "text": "Amreesh Phokeer, Melissa Densmore, David Johnson, and Nick Feamster. 2016. A First Look at Mobile Internet Use in Township Communities in South Africa. In Proceedings of the 7th Annual Symposium on Computing for Development. ACM, 15.  ",
      "doi": "10.1145/3001913.3001926"
    },
    {
      "text": "Jacob Poushter. 2016. Smartphone Ownership and Internet Usage Continues to Climb in Emerging Economies. Pew Research Center 22 (February 2016). http://www.pewglobal.org/2016/02/22/smartphoneownership-and-internet-usage-continues-to-climb-inemerging-economies/",
      "doi": ""
    },
    {
      "text": "ResearchICTAfrica. 2012. Understanding What Is Happening With ICT in South Africa. Policy Paper 7 (2012).",
      "doi": ""
    },
    {
      "text": "ResearchICTAfrica. 2016a. Prepaid Pricing Trends in South Africa - Q2 2016. 2016 South Africa Pricing Policy Summary (2016).",
      "doi": ""
    },
    {
      "text": "ResearchICTAfrica. 2016b. South Africa Cost to Communicate. Policy Brief 4 (2016).",
      "doi": ""
    },
    {
      "text": "ResearchICTAfrica. 2016c. Top operators for personalized prepaid products South Africa. Policy Brief 3 (2016).",
      "doi": ""
    },
    {
      "text": "W Rogerson. 2016. The economics of data caps and free data services in mobile broadband. CTIA report (2016).",
      "doi": ""
    },
    {
      "text": "Layton Roslyn and Silvia Elaluf-Calderwood. 2015. Zero-rating: do hard rules protect or harm consumers and competition? Evidence from Chile, Netherlands and Slovenia. (2015).",
      "doi": ""
    },
    {
      "text": "Carolina Rossini and Taylor Moore. 2015. Exploring Zero-Rating Challenges:Views From Five Countries A Public Knowledge Working Paper. 28 (2015). https://www.publicknowledge.org/documents/exploringzero-rating-challenges-views-from-five-countries",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Paul Lee, Greg Hecht, Paul M. Aoki, Maria-Ines Carrera, Jenny Chen, Michael Youssefmir, David Cohn, Pete Kruskall, Everett Wetchler, and Astrid Twenebowa Larssen. 2015. SmartBrowse: Design and Evaluation of a Mobile Data Price Transparency Tool for Mobile Web Use. Information Technology and International Development 11, 1 (2015), 21--40. http://www.itidjournal.org/index.php/itid/article/view/ 1360/507",
      "doi": ""
    },
    {
      "text": "Nanjira Sambuli. 2016. Challenges and opportunities for advancing Internet access in developing countries while upholding net neutrality. Journal of Cyber Policy 1, 1 (2016), 61--74.",
      "doi": ""
    },
    {
      "text": "Christine Satchell and Paul Dourish. 2009. Beyond the User: Use and Non-use in HCI. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7 (OZCHI '09). ACM, New York, NY, USA, 9--16.  ",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Rijurekha Sen, Sohaib Ahmad, Amreesh Phokeer, Zaid Ahmed Farooq, Ihsan Ayyub Qazi, David Choffnes, and Krishna P Gummadi. 2017. Inside the Walled Garden: Deconstructing Facebook's Free Basics Program. ACM SIGCOMM Computer Communication Review 47, 5 (2017).  ",
      "doi": "10.1145/3155055.3155058"
    },
    {
      "text": "Rijurekha Sen, Hasnain Ali Pirzada, Amreesh Phokeer, Zaid Ahmed Farooq, Satadal Sengupta, David Choffnes, and Krishna P. Gummadi. 2016. On the Free Bridge Across the Digital Divide: Assessing the Quality of Facebook's Free Basics Service. In Proceedings of the 2016 Internet Measurement Conference (IMC '16). ACM, New York, NY, USA, 127--133.  ",
      "doi": "10.1145/2987443.2987485"
    },
    {
      "text": "Irving Siedman. 2013. Interviewing as Qualitative Research: A Guide for Researchers in Education and the Social Sciences. Teachers College Press.",
      "doi": ""
    },
    {
      "text": "South African Government. 2017. Housing Subsidy. (2017). http://www.gov.za/about-SA/housing",
      "doi": ""
    },
    {
      "text": "South African Tourism Website. 2017. South Africa's Languages. (2017). http://www.southafrica.net/za/en/ travel-tips/entry/travel-tip-south-africas-languages",
      "doi": ""
    },
    {
      "text": "South African Western Cape Government. 2017. All You Need to Know About Housing Subsidies. (2017). https://www.westerncape.gov.za/service/all-you-needknow-about-housing-subsidies",
      "doi": ""
    },
    {
      "text": "The Economist Intelligence Unit. 2017. The Inclusive Internet: Mapping Progress 2017. (2017). https: //theinclusiveinternet.eiu.com/explore/countries/ZA/",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2015. Geek Heresy:Rescuing Social Change from the Cult of Technology. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Barbara van Schewick. 2015. Network Neutrality and Zero-rating. Attachment to Barbara van Schewick's Ex Parte in the Matter of Protecting and Promoting the Open Internet submitted February 19, 2015 (2015), 14--28.",
      "doi": ""
    },
    {
      "text": "Barbara Van Schewick. 2016. T-Mobile's Binge On Violates Key Net Neutrality Principles. Stanford Law School, The Center for Internet and Society.",
      "doi": ""
    },
    {
      "text": "Global Voices. 2017. Free Basics in Real Life: Six Case Studies on Facebook's Internet \"On Ramp\" Initiative from Africa, Asia and Latin America. (2017). https://advox.globalvoices.org/2017/07/27/can-facebookconnect-the-next-billion/",
      "doi": ""
    },
    {
      "text": "Susan Wyche. 2017. Exploring Women's Everyday Mobile Phone Experiences in Nairobi, Kenya. Interacting with Computers 29, 3 (2017), 391.",
      "doi": ""
    },
    {
      "text": "Susan Wyche and Eric PS Baumer. 2016. Imagined Facebook: An exploratory study of non-users' perceptions of social media in Rural Zambia. New Media & Society (2016).",
      "doi": ""
    },
    {
      "text": "Susan P. Wyche, Andrea Forte, and Sarita Yardi Schoenebeck. 2013a. Hustling Online: Understanding Consolidated Facebook Use in an Informal Settlement in Nairobi. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2823--2832.  ",
      "doi": "10.1145/2470654.2481391"
    },
    {
      "text": "Susan P. Wyche, Sarita Yardi Schoenebeck, and Andrea Forte. 2013b. Facebook is a Luxury: An Exploratory Study of Social Media Use in Rural Kenya. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 33--44.  ",
      "doi": "10.1145/2441776.2441783"
    },
    {
      "text": "Google X. 2017. Project Loon: Balloon Powered Internet for Everyone. (2017). https://x.company/loon/",
      "doi": ""
    },
    {
      "text": "Moonjung Yim, Ricardo Gomez, and Michelle S Carter. 2016. Facebookâ \" A´ Zs â \" AIJFree Basicsâ ? A? I: For or against community development? The Journal of Community Informatics 12, 2 (2016).",
      "doi": ""
    },
    {
      "text": "Mark Zuckerberg. 2015. Free Basics Protects Net Neutrality. (2015). http://blogs.timesofindia.indiatimes.com/toi-edit-page/ free-basics-protects-net-neutrality/",
      "doi": ""
    }
  ]
}