{
  "doi": "10.1145/3173574.3173777",
  "title": "\"I can do everything but see!\"  -- How People with Vision Impairments Negotiate their Abilities in Social Contexts",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "This research takes an orientation to visual impairment (VI) that does not regard it as fixed or determined alone in or through the body. Instead, we consider (dis)ability as produced through interactions with the environment and configured by the people and technology within it. Specifically, we explore how abilities become negotiated through video ethnography with six VI athletes and spectators during the Rio 2016 Paralympics. We use generated in-depth examples to identify how technology can be a meaningful part of ability negotiations, emphasizing how these embed into the social interactions and lives of people with VI. In contrast to treating technology as a solution to a 'sensory deficit', we understand it to support the triangulation process of sense-making through provision of appropriate additional information. Further, we suggest that technology should not try and replace human assistance, but instead enable people with VI to better identify and interact with other people in-situ.",
  "authors": [
    {
      "name": "Anja Thieme",
      "institution": "Microsoft Resarch, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482659504",
      "orcid": "0000-0002-9639-5531"
    },
    {
      "name": "Cynthia L. Bennett",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358692957",
      "orcid": "0000-0003-1036-2497"
    },
    {
      "name": "Cecily Morrison",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959289057",
      "orcid": "missing"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, Redmond, USA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    },
    {
      "name": "Alex S. Taylor",
      "institution": "City University London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100517358/rel-imgonly/alex_taylor_profile.jpg",
      "acmid": "81100517358",
      "orcid": "0000-0001-6311-3967"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, William Easley, Michele Williams, Stacy Branham, and Amy Hurst. 2017. Embracing Errors: Examining How Context of Use Impacts Blind Individuals' Acceptance of Navigation Aid Errors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 41584169.  ",
      "doi": "10.1145/3025453.3025528"
    },
    {
      "text": "Shiri Azenkot, Catherine Feng, and Maya Cakmak. 2016. Enabling Building Service Robots to Guide Blind People: A Participatory Design Approach. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction (HRI '16). IEEE Press, Piscataway, NJ, USA, 3--10. ",
      "doi": "10.5555/2906831.2906835"
    },
    {
      "text": "Shiri Azenkot, Jacob O. Wobbrock, Sanjana Prasain, and Richard E. Ladner. 2012. Input finger detection for nonvisual touch screen text entry in Perkinput. In Proceedings of Graphics Interface 2012 (GI '12). Canadian Information Processing Society, 121--129. ",
      "doi": "10.5555/2305276.2305297"
    },
    {
      "text": "Cynthia L. Bennett, Keting Cen, Katherine M. Steele, and Daniela K. Rosner. 2016. An Intimate Laboratory?: Prostheses as a Tool for Experimenting with Identity and Normalcy. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 1745--1756.  ",
      "doi": "10.1145/2858036.2858564"
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Susanne Bødker. 1995. Applying activity theory to video analysis: how to make sense of video data in human-computer interaction. In Bonnie A. Nardi (Ed.). Context and consciousness. Massachusetts Institute of Technology, Cambridge, MA, USA, 147--174. ",
      "doi": "10.5555/223826.223833"
    },
    {
      "text": "Matthew N. Bonner, Jeremy T. Brudvik, Gregory D. Abowd, and W. Keith Edwards. 2010. No-look notes: accessible eyes-free multi-touch text entry. In Pervasive Computing, Springer Berlin Heidelberg, pp. 409426. http://rd.springer.com/chapter/10.1007/978--3--64212654--3_24  ",
      "doi": "10.1007/978-3-642-12654-3_24"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, and Jeffrey P. Bigham. 2015. Gauging Receptiveness to Social Microvolunteering. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1055--1064.  ",
      "doi": "10.1145/2702123.2702329"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative Accessibility: How Blind and Sighted Companions Co-Create Accessible Home Spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2373--2382.  ",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. The Invisible Work of Accessibility: How Blind Employees Manage Accessibility in Mixed-Ability Workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), 163--171.  ",
      "doi": "10.1145/2700648.2809864"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, no. 2 (2006): 77--101.",
      "doi": ""
    },
    {
      "text": "Michael Brock and Per Ola Kristensson. 2013. Supporting blind navigation using depth sensing and sonification. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication (UbiComp '13 Adjunct). ACM, 255--258.  ",
      "doi": "10.1145/2494091.2494173"
    },
    {
      "text": "Galit Buchs, Shachar Maidenbaum, and Amir Amedi. 2014. Obstacle Identification and Avoidance Using the 'EyeCane': a Tactile Sensory Substitution Device for Blind Individuals. In M. Auvray and C. Duriez (eds.), Haptics: Neuroscience, Devices, Modeling, and Applications. Lecture Notes in Computer Science Volume 8619, 96--103.",
      "doi": ""
    },
    {
      "text": "J.M. Hans du Buf, João Barroso, João M.F. Rodrigues, Hugo Paredes, Miguel Farrajota, Hugo Fernandes, João José, Victor Teixeira, and Mário Saleiro. 2011. The SmartVision Navigation Prototype for Blind Users. International Journal of Digital Content Technology and its Applications 5(5), 351--361. http://hdl.handle.net/10400.1/893",
      "doi": ""
    },
    {
      "text": "Michele A. Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P. Bigham, and Amy Hurst. 2012. Crowdsourcing subjective fashion advice using VizWiz: challenges and opportunities. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '12). ACM, 135--142.  ",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Centers for Disease Control and Prevention (CDC). 2016. Facts about Vision Loss. National Center of Birth Defects and Developmental Disabilities. Last retrieved 7th December 2016 from http://www.cdc.gov/ncbddd/actearly/pdf/parents_pdfs/VisionLossFactSheet.pdf",
      "doi": ""
    },
    {
      "text": "Xiangrong Chen and Alan L. Yuille. 2004. Detecting and reading text in natural scenes. In IEEE Computer Society Conference on Computer Vision and Pattern Recognition, 2004. CVPR 2004. vol. 2. ",
      "doi": "10.5555/1896300.1896354"
    },
    {
      "text": "James Coughlan and Roberto Manduchi. 2007. Color targets: Fiducials to help visually impaired people find their way by camera phone. EURASIP Journal on Image and Video Processing 2007, no. 1 (2007), Article ID 096357, 13 pages. https://rd.springer.com/article/10.1155/2007/96357  ",
      "doi": "10.1155/2007/96357"
    },
    {
      "text": "Norman K. Denzin. 1978. The Research Act, A Theoretical Introduction to Sociological Methods, 2d ed. New York: McGraw-Hill.",
      "doi": ""
    },
    {
      "text": "William Easley, Michele A. Williams, Ali Abdolrahmani, Caroline Galbraith, Stacy M. Branham, Amy Hurst, and Shaun K. Kane. 2016. Let's Get Lost: Exploring Social Norms In Predominately Blind Environments. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, 2034--2040.  ",
      "doi": "10.1145/2851581.2892470"
    },
    {
      "text": "Hugo Fernandes, José Faria, Hugo Paredes, and João Barroso. 2011. An integrated system for blind day-today life autonomy. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '11). ACM, 225--226.  ",
      "doi": "10.1145/2049536.2049579"
    },
    {
      "text": "Giuseppe Ghiani, Barbara Leporini, and Fabio Paternò. 2008. Supporting orientation for blind people using museum guides. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, 3417--3422.  ",
      "doi": "10.1145/1358628.1358867"
    },
    {
      "text": "Charles Goodwin, Marjorie H. Goodwin, and David Olsher. 2002. Producing sense with nonsense syllables. The Language of Turn and Sequence, Oxford (CUP), (2002), 56--80.",
      "doi": ""
    },
    {
      "text": "Tiago Guerreiro, Paulo Lagoá, Hugo Nicolau, Daniel Gonçalves, and Joaquim A. Jorge. 2008. From tapping to touching: Making touch screens accessible to blind users. IEEE MultiMedia 15(4), 48--50.  ",
      "doi": "10.1109/MMUL.2008.88"
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang 'Anthony' Chen, Tom Yeh, Scott E. Hudson, Jennifer Mankoff, and Jeffrey P. Bigham. 2017. Facade: Auto-generating Tactile Interfaces to Appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 5826--5838.  ",
      "doi": "10.1145/3025453.3025845"
    },
    {
      "text": "Richard Guy and Khai Truong. 2012. CrossingGuard: exploring information content in navigation aids for visually impaired pedestrians. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 405--414.  ",
      "doi": "10.1145/2207676.2207733"
    },
    {
      "text": "Chandrika Jayant, Christine Acuario, William Johnson, Janet Hollier, and Richard Ladner. 2010. V-braille: haptic braille perception using a touch-screen and vibration on mobile phones. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '10). ACM, 295--296.  ",
      "doi": "10.1145/1878803.1878878"
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P. Bigham. 2011. Supporting blind photography. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '11). ACM, 203--210.  ",
      "doi": "10.1145/2049536.2049573"
    },
    {
      "text": "Todd D. Jick. 1979. Mixing qualitative and quantitative methods: Triangulation in action. Administrative science quarterly 24, no. 4 (1979), 602--611.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. 2009. Freedom to roam: a study of mobile device adoption and accessibility for people with visual and motor disabilities. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility (Assets '09). ACM, 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Vladimir Kulyukin and Aliasgar Kutiyanawala. 2010. From ShopTalk to ShopMobile: vision-based barcode scanning with mobile phones for independent blind grocery shopping. In Proceedings of the 2010 Rehabilitation Engineering and Assistive Technology Society of North America Conference (RESNA 2010), vol. 703, pp. 1--5.",
      "doi": ""
    },
    {
      "text": "Xu Liu. 2008. A camera phone based currency reader for the visually impaired. In Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility (Assets '08). ACM, 305--306.  ",
      "doi": "10.1145/1414471.1414551"
    },
    {
      "text": "Seonaidh McDonald. 2005. Studying actions in context: a qualitative shadowing method for organizational research. Qualitative research 5(4), 455--473.",
      "doi": ""
    },
    {
      "text": "Lauren R. Milne, Cynthia L. Bennett, and Richard E. Ladner. 2013. VBGhost: a braille-based educational smartphone game for children. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, Article 75, 2 pages.  ",
      "doi": "10.1145/2513383.2513396"
    },
    {
      "text": "Loranza Mondada. 2006. Video recording as the reflexive preservation and configuration of phenomenal features for analysis. In Knoblauch, H., Raab, J., Soeffner, H.-G., Schnettler, B. (eds.). Video Analysis. Bern: Lang, 51--68. https://pdfs.semanticscholar.org/87f3/956fbb4d5c07e2738b0f8d8fc1a718 493698.pdf",
      "doi": ""
    },
    {
      "text": "Jo Moran-Ellis, Victoria D. Alexander, Ann Cronin, Mary Dickinson, Jane Fielding, Judith Sleney, and Hilary Thomas. 2006. Triangulation and integration: processes, claims and implications. Qualitative research 6, no. 1 (2006), 45--59.",
      "doi": ""
    },
    {
      "text": "Ingunn Moser. 2005. On becoming disabled and articulating alternatives: The multiple modes of ordering disability and their interferences. Cultural Studies 19, no. 6 (2005), 667--700.",
      "doi": ""
    },
    {
      "text": "João Oliveira, Tiago Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2011. Blind people and mobile touch-based text-entry: acknowledging the need for different flavors. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '11). ACM, 179--186.  ",
      "doi": "10.1145/2049536.2049569"
    },
    {
      "text": "Mike Oliver. 1990. The individual and social models of disability. In joint workshop of The living options Group and the Research Unit of the Royal College of Physicians, vol. 23.",
      "doi": ""
    },
    {
      "text": "Wendy Olsen. 2004. Triangulation in social research: qualitative and quantitative methods can really be mixed. Developments in sociology 20 (2004), 103--118.",
      "doi": ""
    },
    {
      "text": "T. Louise-Bender Pape, J. Kim, and B. Weiner. 2002. The shaping of individual meanings assigned to assistive technology: a review of personal factors. Disability and rehabilitation 24, no. 1--3 (2002): 5--20.",
      "doi": ""
    },
    {
      "text": "Sarah Pink. 2015. Doing sensory ethnography. Sage.",
      "doi": ""
    },
    {
      "text": "Beryl Plimmer, Andrew Crossan, Stephen A. Brewster, and Rachel Blagojevic. 2008. Multimodal collaborative handwriting training for visually-impaired people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, 393402.  ",
      "doi": "10.1145/1357054.1357119"
    },
    {
      "text": "Halley Profita, Reem Albaghli, Leah Findlater, Paul Jaeger, and Shaun K. Kane. 2016. The AT Effect: How Disability Affects the Perceived Social Acceptability of Head-Mounted Display Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 4884--4895.  ",
      "doi": "10.1145/2858036.2858130"
    },
    {
      "text": "Halley P. Profita, Abigale Stangl, Laura Matuszewska, Sigrunn Sky, and Shaun K. Kane. 2016. Nothing to Hide: Aesthetic Customization of Hearing Aids and Cochlear Implants in an Online Community. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, 219--227.  ",
      "doi": "10.1145/2982142.2982159"
    },
    {
      "text": "Hernisa Kacorri, Kris M. Kitani, Jeffrey P. Bigham, and Chieko Asakawa. 2017. People with Visual Impairment Training Personal Object Recognizers: Feasibility and Challenges. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 5839--5849.  ",
      "doi": "10.1145/3025453.3025899"
    },
    {
      "text": "Marti L. Riemer-Reiss, and Robbyn R. Wacker. 2000. Factors associated with assistive technology discontinuance among individuals with disabilities. Journal of Rehabilitation 66, no. 3 (2000): 44.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, William Easley, Ali Abdolrahmani, Amy Hurst, and Stacy Branham. 2017. Learning the Language: The Importance of Studying Written Directions in Designing Navigational Technologies for the Blind. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, 2922--2928.  ",
      "doi": "10.1145/3027063.3053260"
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 705--714.  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2016. SelfConscious or Self-Confident? A Diary Study Conceptualizing the Social Accessibility of Assistive Technology. ACM Trans. Access. Comput. 8, 2, Article 5, 31 pages.  ",
      "doi": "10.1145/2827857"
    },
    {
      "text": "Piyanuch Silapachote, Jerod Weinman, Allen Hanson, Marwan A. Mattar and Richard Weiss. 2005. Automatic sign detection and recognition in natural scenes. IEEE Computer Society Conference on Computer Vision and Pattern Recognition, CVPR Workshops, 2005. http://ieeexplore.ieee.org/abstract/document/1565324/  ",
      "doi": "10.1109/CVPR.2005.417"
    },
    {
      "text": "Caleb Southern, James Clawson, Brian Frey, Gregory Abowd, and Mario Romero. 2012. An evaluation of BrailleTouch: mobile touchscreen text entry for the visually impaired. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12). ACM, 317--326.  ",
      "doi": "10.1145/2371574.2371623"
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How People with Low Vision Access Computing Devices: Understanding Challenges and Opportunities. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16)., 171--180.  ",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Sarit Szpiro, Yuhang Zhao, and Shiri Azenkot. 2016. Finding a store, searching for a product: a study of daily challenges of low vision people. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). 61--72.  ",
      "doi": "10.1145/2971648.2971723"
    },
    {
      "text": "Anja Thieme, Cecily Morrison, Nicolas Villar, Martin Grayson, and Siân Lindley. 2017. Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, 739--752.  ",
      "doi": "10.1145/3064663.3064689"
    },
    {
      "text": "Marynel Vázquez and Aaron Steinfeld. 2012. Helping visually impaired users properly aim a camera. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '12). ACM, 95--102.  ",
      "doi": "10.1145/2384916.2384934"
    },
    {
      "text": "Michele A. Williams, Amy Hurst, and Shaun K. Kane. 2013. \"Pray before you step out\": describing personal and situational blind navigation behaviors. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, Article 28, 8 pages.  ",
      "doi": "10.1145/2513383.2513449"
    },
    {
      "text": "Michele A. Williams, Caroline Galbraith, Shaun K. Kane, and Amy Hurst. 2014. \"just let the cane hit it\": how the blind and sighted see navigation differently. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility (ASSETS '14), 217--224.  ",
      "doi": "10.1145/2661334.2661380"
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. AbilityBased Design: Concept, Principles and Examples. ACM Trans. Access. Comput. 3, 3, Article 9 (April 2011), 27 pages. i http://www.sports-innovation.org.uk/ ii http://vizwiz.org/  ",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "World Health Organisation. 2017. Disabilities. Last retrieved 06.09.2017 from http://www.who.int/topics/disabilities/en/",
      "doi": ""
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Julie Schiller. 2017. Automatic Alt-text: Computer-generated Image Descriptions for Blind Users on a Social Network Service. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, 1180--1192.  ",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Rayoung Yang, Sangmi Park, Sonali R. Mishra, et al. 2011. Supporting spatial awareness and independent wayfinding for pedestrians with visual impairments. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '11). ACM.  ",
      "doi": "10.1145/2049536.2049544"
    },
    {
      "text": "Georgios Yfantidis, and Grigori Evreinov. 2006. Adaptive blind interaction technique for touchscreens. Universal Access in the Information Society 4 (4), 328337. http://rd.springer.com/article/10.1007/s10209004-0109--7  ",
      "doi": "10.1007/s10209-004-0109-7"
    },
    {
      "text": "Yuhang Zhao, Michele Hu, Shafeka Hashash, and Shiri Azenkot. 2017. Understanding Low Vision People's Visual Perception on Commercial Augmented Reality Glasses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 4170--4181.  ",
      "doi": "10.1145/3025453.3025949"
    },
    {
      "text": "Annuska Zolyomi, Anushree Shukla, and Jaime Snyder. 2016. Social Dimensions of Technology-Mediated Sight. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, 299--300. iii https://www.mturk.com/mturk/welcome  ",
      "doi": "10.1145/2982142.2982190"
    }
  ]
}