{
  "doi": "10.1145/3173574.3173850",
  "title": "Crowdsourcing Treatments for Low Back Pain",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Low back pain (LBP) is a globally common condition with no silver bullet solutions. Further, the lack of therapeutic consensus causes challenges in choosing suitable solutions to try. In this work, we crowdsourced knowledge bases on LBP treatments. The knowledge bases were used to rank and offer best-matching LBP treatments to end users. We collected two knowledge bases: one from clinical professionals and one from non-professionals. Our quantitative analysis revealed that non-professional end users perceived the best treatments by both groups as equally good. However, the worst treatments by non-professionals were clearly seen as inferior to the lowest ranking treatments by professionals. Certain treatments by professionals were also perceived significantly differently by non-professionals and professionals themselves. Professionals found our system handy for self-reflection and for educating new patients, while non-professionals appreciated the reliable decision support that also respected the non-professional opinion.",
  "authors": [
    {
      "name": "Simo Johannes Hosio",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81337490114",
      "orcid": "missing"
    },
    {
      "name": "Jaro Karppinen",
      "institution": "Finnish Institute of Occupational Health, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261493",
      "orcid": "missing"
    },
    {
      "name": "Esa-Pekka Takala",
      "institution": "Finnish Institute of Occupational Health, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100543171",
      "orcid": "missing"
    },
    {
      "name": "Jani Takatalo",
      "institution": "Oulu University Hospital, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261972",
      "orcid": "missing"
    },
    {
      "name": "Jorge Goncalves",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488650470",
      "orcid": "0000-0002-0117-0322"
    },
    {
      "name": "Niels van Berkel",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/do/10.1145/contrib-99658743711/rel-imgonly/niels_van_berkel_2022.jpg",
      "acmid": "99658743711",
      "orcid": "0000-0001-5106-7692"
    },
    {
      "name": "Shin'ichi Konomi",
      "institution": "Kyushu University, Kyushu, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100510790",
      "orcid": "missing"
    },
    {
      "name": "Vassilis Kostakos",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100283202/rel-imgonly/vassilis_kostakos2.jpg",
      "acmid": "81100283202",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Elena Agapie, Lucas Colusso, Sean A. Munson and Gary Hsieh. 2016. PlanSourcing: Generating Behavior Change Plans with Friends and Crowds. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, ACM, 119133.  ",
      "doi": "10.1145/2818048.2819943"
    },
    {
      "text": "Steven Alter. 1982. Decision support systems: Current practice and continuing challenges. Reading, Massachusetts: Addison-Wesley Publishing Co., 1980, 316 pp. Behavioral Science, 27 (1). 91--92.",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White and Tom Yeh. 2010. VizWiz: Nearly Real-time Answers to Visual Questions. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology, ACM, 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "D. C. Brabham, K. M. Ribisl, T. R. Kirchner and J. M. Bernhardt. 2014. Crowdsourcing applications for public health. Am J Prev Med, 46 (2). 179--187.",
      "doi": ""
    },
    {
      "text": "Marissa Burgermaster, Krzysztof Z. Gajos, Patricia Davidson and Lena Mamykina. 2017. The Role of Explanations in Casual Observational Learning about Nutrition. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, 40974145.  ",
      "doi": "10.1145/3025453.3025874"
    },
    {
      "text": "Chao-Min Chiu, Ting-Peng Liang and Efraim Turban. 2014. What can crowdsourcing do for decision support? Decision Support Systems, 65. 40--49.  ",
      "doi": "10.1016/j.dss.2014.05.010"
    },
    {
      "text": "R. J. W. Cline and K. M. Haynes. 2001. Consumer health information seeking on the Internet: the state of the art. Health Education Research, 16 (6). 671--692.",
      "doi": ""
    },
    {
      "text": "Anhai Doan, Raghu Ramakrishnan and Alon Y. Halevy. 2011. Crowdsourcing systems on the worldwide web. Communications of the ACM, 54 (4). 86--96.  ",
      "doi": "10.1145/1924421.1924442"
    },
    {
      "text": "Jorge Goncalves, Simo Hosio and Vassilis Kostakos. 2017. Eliciting Structured Knowledge from Situated Crowd Markets. ACM Transactions on Internet Technology, 17 (2), article 14.  ",
      "doi": "10.1145/3007900"
    },
    {
      "text": "Nathan Hahn, Joseph Chang, Ji Eun Kim and Aniket Kittur. 2016. The Knowledge Accelerator: Big Picture Thinking in Small Pieces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 2258--2270.  ",
      "doi": "10.1145/2858036.2858364"
    },
    {
      "text": "A. Hartzler and W. Pratt. 2011. Managing the personal side of health: how patient expertise differs from the expertise of clinicians. Journal of Medical Internet Research, 13 (3). e62.",
      "doi": ""
    },
    {
      "text": "Hwajung Hong, Eric Gilbert, Gregory D. Abowd and Rosa I. Arriaga. 2015. In-group Questions and Outgroup Answers: Crowdsourcing Daily Living Advice for Individuals with Autism. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 777--786.  ",
      "doi": "10.1145/2702123.2702402"
    },
    {
      "text": "Simo Hosio, Jorge Goncalves, Theodoros Anagnostopoulos and Vassilis Kostakos. 2016. Leveraging Wisdom of the Crowd for Decision Support. In British Human Computer Interaction Conference, article 38.  ",
      "doi": "10.14236/ewic/HCI2016.38"
    },
    {
      "text": "D. Hoy, L. March, P. Brooks, F. Blyth, A. Woolf, C. Bain, G. Williams, E. Smith, T. Vos, J. Barendregt, C. Murray, R. Burstein and R. Buchbinder. 2014. The global burden of low back pain: estimates from the Global Burden of Disease 2010 study. Ann Rheum Dis, 73 (6). 968--974.",
      "doi": ""
    },
    {
      "text": "Jina Huh. 2015. Clinical Questions in Online Health Communities: The Case of See your doctor Threads. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1488--1499.  ",
      "doi": "10.1145/2675133.2675259"
    },
    {
      "text": "Jina Huh, Wanda Pratt, Jina Huh and Wanda Pratt. 2014. Weaving clinical expertise in online health communities. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1355--1364.  ",
      "doi": "10.1145/2556288.2557293"
    },
    {
      "text": "Christina Kelley, Bongshin Lee and Lauren Wilcox. 2017. Self-tracking for Mental Wellness: Understanding Expert Perspectives and Student Experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, 629--641.  ",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease and John Horton. 2013. The future of crowd work. In Proceedings of the 2013 conference on Computer supported cooperative work, ACM, 1301--1318.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Nicolas Kokkalis, Thomas Köhn, Johannes Huebner, Moontae Lee, Florian Schulze and Scott R. Klemmer. 2013. TaskGenies: Automatically Providing Action Plans Helps People Complete Tasks. ACM Trans. Comput.-Hum. Interact., 20 (5). 27 21--27 25.  ",
      "doi": "10.1145/2513560"
    },
    {
      "text": "D. L. MacLean and J. Heer. 2013. Identifying medical terms in patient-authored text: a crowdsourcing-based approach. J Am Med Inform Assoc, 20 (6). 1120--1127.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Thomas N. Smyth, Jill P. Dimond and Krzysztof Z. Gajos. 2016. Learning From the Crowd: Observational Learning in Crowdsourcing Communities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 2635--2644.  ",
      "doi": "10.1145/2858036.2858560"
    },
    {
      "text": "Justin Matejka, Michael Glueck, Tovi Grossman and George Fitzmaurice. Year. The Effect of Visual Appearance on the Performance of Continuous Sliders and Visual Analogue Scales. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 5421--5432.  ",
      "doi": "10.1145/2858036.2858063"
    },
    {
      "text": "Marion K. Poetz and Martin Schreier. 2012. The Value of Crowdsourcing: Can Users Really Compete with Professionals in Generating New Product Ideas? Journal of Product Innovation Management, 29 (2). 245--256.",
      "doi": ""
    },
    {
      "text": "Daniel J. Power and Ramesh Sharda. 2007. Modeldriven decision support systems: Concepts and research directions. Decision Support Systems, 43 (3). 1044--1061.  ",
      "doi": "10.1016/j.dss.2005.05.030"
    },
    {
      "text": "James Surowiecki. 2005. The Wisdom of Crowds: Why the Many Are Smarter Than the Few and How Collective Wisdom Shapes Business, Economies, Societies and Nations. Anchor. ",
      "doi": "10.5555/1095645"
    },
    {
      "text": "Pauline Savigny Underwood, Watson Paul and Martin. 2009. Early management of persistent non-specific low back pain: summary of NICE guidance.",
      "doi": ""
    },
    {
      "text": "Anbang Xu, Shih-Wen Huang and Brian Bailey. Year. Voyant: generating structured feedback on visual designs using a crowd of non-experts. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, 14331444.  ",
      "doi": "10.1145/2531602.2531604"
    },
    {
      "text": "Alvin Yuan, Kurt Luther, Markus Krause, Sophie Isabel Vennix, Steven P. Dow and Bjorn Hartmann. Year. Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, ACM, 1005--1017.  ",
      "doi": "10.1145/2818048.2819953"
    }
  ]
}