{
  "doi": "10.1145/3173574.3173590",
  "title": "The Illusion of Control: Placebo Effects of Control Settings",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Algorithmic prioritization is a growing focus for social media users. Control settings are one way for users to adjust the prioritization of their news feeds, but they prioritize feed content in a way that can be difficult to judge objectively. In this work, we study how users engage with difficult-to-validate controls. Via two paired studies using an experimental system -- one interview and one online study -- we found that control settings functioned as placebos. Viewers felt more satisfied with their feed when controls were present, whether they worked or not. We also examine how people engage in sensemaking around control settings, finding that users often take responsibility for violated expectations -- for both real and randomly functioning controls. Finally, we studied how users controlled their social media feeds in the wild. The use of existing social media controls had little impact on user's satisfaction with the feed; instead, users often turned to improvised solutions, like scrolling quickly, to see what they want.",
  "authors": [
    {
      "name": "Kristen Vaccaro",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699068",
      "orcid": "0000-0002-9843-942X"
    },
    {
      "name": "Dylan Huang",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260884",
      "orcid": "missing"
    },
    {
      "name": "Motahhare Eslami",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959132657",
      "orcid": "0000-0002-1499-3045"
    },
    {
      "name": "Christian Sandvig",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100067260",
      "orcid": "missing"
    },
    {
      "name": "Kevin Hamilton",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488642",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "University of Illinois at Urbana-Champaign & Adobe Research, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    }
  ],
  "references": [
    {
      "text": "Eytan Adar, Desney S Tan, and Jaime Teevan. 2013. Benevolent deception in human computer interaction. In Proc. CHI.  ",
      "doi": "10.1145/2470654.2466246"
    },
    {
      "text": "Naveen Farag Awad and Mayuram S Krishnan. 2006. The personalization privacy paradox: an empirical evaluation of information transparency and the willingness to be profiled online for personalization. Management Information Systems Quarterly (2006). ",
      "doi": "10.5555/2017284.2017287"
    },
    {
      "text": "Susan B Barnes. 2006. A privacy paradox: Social networking in the USA. First Monday 11, 9 (2006).",
      "doi": ""
    },
    {
      "text": "Andrew Besmer and Heather Richter Lipford. 2010. Moving Beyond Untagging: Photo Privacy in a Tagged World. In Proc. CHI.  ",
      "doi": "10.1145/1753326.1753560"
    },
    {
      "text": "Reuben Binns. 2017. Algorithmic Accountability and Public Reason. Philosophy & Technology (2017), 1--14.",
      "doi": ""
    },
    {
      "text": "Samuel Brody and Nicholas Diakopoulos. 2011. Cooooooooooooooollllllllllllll!!!!!!!!!!!!!!: using word lengthening to detect sentiment in microblogs. In Proc. EMNLP. Association for Computational Linguistics. ",
      "doi": "10.5555/2145432.2145498"
    },
    {
      "text": "Taina Bucher. 2017. The Algorithmic Imaginary: Exploring the Ordinary Affects of Facebook Algorithms. Information, Communication & Society (2017).",
      "doi": ""
    },
    {
      "text": "Pascal Chesnais, Matthew Mucklo, and Jonathan Sheena. 1995. The Fishwrap Personalized News System. In Proc. 2nd International Workshop on Community Networking.",
      "doi": ""
    },
    {
      "text": "Kate Crawford. 2009. Following you: Disciplines of listening in social media. Continuum 23, 4 (2009), 525--535.",
      "doi": ""
    },
    {
      "text": "John W Creswell and Vicki L Plano Clark. 2011. Designing and Conducting Mixed Methods Research. (2011).",
      "doi": ""
    },
    {
      "text": "John Danaher. 2016. The threat of algocracy: reality, resistance and accommodation. Philosophy & Technology 29, 3 (2016), 245--268.",
      "doi": ""
    },
    {
      "text": "Michael A DeVito, Darren Gergle, and Jeremy Birnholtz. 2017. Algorithms Ruin Everything: #RIPTwitter, Folk Theories, and Resistance to Algorithmic Change in Social Media. In Proc. CHI.  ",
      "doi": "10.1145/3025453.3025659"
    },
    {
      "text": "Nicholas Diakopoulos and Michael Koliska. 2017. Algorithmic Transparency in the News Media. Digital Journalism (2017).",
      "doi": ""
    },
    {
      "text": "Alan Dix, Janet Finlay, Gregory Abowd, and Russell Beale. 2004. Human-computer interaction. Pearson Education.",
      "doi": ""
    },
    {
      "text": "Finale Doshi-Velez and Been Kim. 2017. Towards a rigorous science of interpretable machine learning. https://arxiv.org/abs/1702.08608, (2017).",
      "doi": ""
    },
    {
      "text": "Mary T Dzindolet, Scott A Peterson, Regina A Pomranky, Linda G Pierce, and Hall P Beck. 2003. The Role of Trust in Automation Reliance. International Journal of Human-Computer Studies 58, 6 (2003), 697--718.  ",
      "doi": "10.1016/S1071-5819%2803%2900038-7"
    },
    {
      "text": "Motahhare Eslami, Amirhossein Aleyasen, Roshanak Zilouchian Moghaddam, and Karrie Karahalios. 2014. Friend Grouping Algorithms for Online Social Networks: Preference, Bias, and Implications. In Proc. SocInfo. Springer.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I Like It, Then I Hide It: Folk Theories of Social Feeds. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. I always assumed that I wasn't really that close to {her}: Reasoning about Invisible Algorithms in News Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 153--162.  ",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Megan French and Jeff Hancock. 2017. What's the Folk Theory? Reasoning About Cyber-Social Systems. (2017).",
      "doi": ""
    },
    {
      "text": "Matthew Fuller. 2003. Behind the Blip: Essays on the Culture of Software. Autonomedia. p. 107.",
      "doi": ""
    },
    {
      "text": "Eric Gilbert. 2012. Predicting Tie Strength in a New Medium. In Proc. CSCW.  ",
      "doi": "10.1145/2145204.2145360"
    },
    {
      "text": "Eszter Hargittai and Alice Marwick. 2016. \"What Can I Really Do?\" Explaining the Privacy Paradox with Online Apathy. International Journal of Communication 10, 0 (2016). http://ijoc.org/index.php/ijoc/article/view/4655",
      "doi": ""
    },
    {
      "text": "Anne Harrington. 1999. The placebo effect: An interdisciplinary exploration. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Clayton J Hutto and Eric Gilbert. 2014. Vader: A parsimonious rule-based model for sentiment analysis of social media text. In Proc. ICWSM.",
      "doi": ""
    },
    {
      "text": "Sanjay Kairam, Mike Brzozowski, David Huffaker, and Ed Chi. 2012. Talking in Circles: Selective Sharing in Google+. In Proc. CHI. ACM, 1065--1074.  ",
      "doi": "10.1145/2207676.2208552"
    },
    {
      "text": "Ted J Kaptchuk, John M Kelley, Lisa A Conboy, Roger B Davis, Catherine E Kerr, Eric E Jacobson, Irving Kirsch, Rosa N Schyner, Bong Hyun Nam, Long T Nguyen, and others. 2008. Components of placebo effect: randomised controlled trial in patients with irritable bowel syndrome. BMJ 336, 7651 (2008), 999--1003.",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Joanna Bresee, Lorrie Faith Cranor, and Robert W Reeder. 2009. A nutrition label for privacy. In Proc. SOUPS. ACM, 4.  ",
      "doi": "10.1145/1572532.1572538"
    },
    {
      "text": "René F Kizilcec. 2016. How much information?: Effects of transparency on trust in an algorithmic interface. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858402"
    },
    {
      "text": "Simon Knight, Theresa Anderson, and Kelly Tall. 2017. Dear Learner: Participatory Visualisation of Learning Data for Sensemaking. In Proc. International Learning Analytics & Knowledge Conference. ACM, 532--533.  ",
      "doi": "10.1145/3027385.3029443"
    },
    {
      "text": "Todd Kulesza, Margaret Burnett, Weng-Keen Wong, and Simone Stumpf. 2015. Principles of Explanatory Debugging to Personalize Interactive Machine Learning. In Proc. IUI. ACM.  ",
      "doi": "10.1145/2678025.2701399"
    },
    {
      "text": "Haewoon Kwak, Changhyun Lee, Hosung Park, and Sue Moon. 2010. What is Twitter, a Social Network or a News Media?. In Proc. WWW.  ",
      "doi": "10.1145/1772690.1772751"
    },
    {
      "text": "Clayton Lewis and John Rieman. 1993. Task-centered user interface design.",
      "doi": ""
    },
    {
      "text": "Zachary C Lipton. 2016. The mythos of model interpretability. arXiv preprint arXiv:1606.03490 (2016).",
      "doi": ""
    },
    {
      "text": "Ryan MacCarthy. 2016. The Average Twitter User Now has 707 Followers. https://kickfactory.com/blog/ average-twitter-followers-updated-2016/. (June 2016).",
      "doi": ""
    },
    {
      "text": "Paul Maglio and Rob Barrett. 2000. Intermediaries personalize information streams. Commun. ACM 43, 8 (2000).  ",
      "doi": "10.1145/345124.345158"
    },
    {
      "text": "Joe Marshall, Steve Benford, and Tony Pridmore. 2010. Deception and magic in collaborative interaction. In Proc. CHI. ACM.  ",
      "doi": "10.1145/1753326.1753410"
    },
    {
      "text": "Daniel E Moerman. 2002. Meaning, Medicine, and the \"Placebo Effect\". Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Bonnie M Muir. 1994. Trust in automation: Part I. Theoretical issues in the study of trust and human intervention in automated systems. Ergonomics 37, 11 (1994), 1905--1922.",
      "doi": ""
    },
    {
      "text": "Bonnie M Muir and Neville Moray. 1996. Trust in automation. Part II. Experimental studies of trust and human intervention in a process control simulation. Ergonomics 39, 3 (1996), 429--460.",
      "doi": ""
    },
    {
      "text": "Randall J Mumaw, Emilie M Roth, Kim J Vicente, and Catherine M Burns. 2000. There is more to monitoring a nuclear power plant than meets the eye. Human factors 42, 1 (2000), 36--55.",
      "doi": ""
    },
    {
      "text": "Donald A Norman. 2002. The Design of Everyday Things. (2002). ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Will Oremus. 2016. Who Controls Your Facebook Feed. http://www.slate.com/articles/technology/cover_story/ 2016/01/how_facebook_s_news_feed_algorithm_works.html. (January 2016).",
      "doi": ""
    },
    {
      "text": "Frank A Pasquale. 2011. Restoring transparency to automated authority. https://ssrn.com/abstract=1762766, Journal on Telecommunications and High Technology Law (February 2011).",
      "doi": ""
    },
    {
      "text": "James W Pennebaker, Ryan L Boyd, Kayla Jordan, and Kate Blackburn. 2015. The development and psychometric properties of LIWC2015. Technical Report.",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Desney S Tan, Mark Billinghurst, Hirokazu Kato, Holger Regenbrecht, and Nobuji Tetsutani. 2001. Tiles: A Mixed Reality Authoring Interface. In Proc. Interact.",
      "doi": ""
    },
    {
      "text": "Aare Puussaar, Adrian K Clear, and Peter Wright. 2017. Enhancing Personal Informatics Through Social Sensemaking. In Proc. CHI. ACM.  ",
      "doi": "10.1145/3025453.3025804"
    },
    {
      "text": "Emilee Rader and Rebecca Gray. 2015. Understanding User Beliefs About Algorithmic Curation in the Facebook News Feed. In Proc. CHI.  ",
      "doi": "10.1145/2702123.2702174"
    },
    {
      "text": "Paul Robinette, Wenchen Li, Robert Allen, Ayanna M Howard, and Alan R Wagner. 2016. Overtrust of robots in emergency evacuation scenarios. In Human-Robot Interaction (HRI). IEEE. ",
      "doi": "10.5555/2906831.2906851"
    },
    {
      "text": "Donald A Schön. 1983. The Reflective Practitioner: How Professionals Think in Action. Basic Books.",
      "doi": ""
    },
    {
      "text": "Rajiv C Shah and Christian Sandvig. 2008. Software defaults as de facto regulation the case of the wireless Internet. Information, Community & Society 11, 1 (2008), 25--46.",
      "doi": ""
    },
    {
      "text": "Elisa Shearer and Jeffrey Gottfried. 2017. News Use Across Social Media Platforms 2017. http://www.journalism.org/2017/09/07/ news-use-across-social-media-platforms-2017/. (2017).",
      "doi": ""
    },
    {
      "text": "Jaeeun Shim and Ronald C Arkin. 2013. A taxonomy of robot deception and its benefits in HRI. In Systems, Man, and Cybernetics (SMC). IEEE, 2328--2335.  ",
      "doi": "10.1109/SMC.2013.398"
    },
    {
      "text": "Baba Shiv, Ziv Carmon, and Dan Ariely. 2005. Placebo Effects of Marketing Actions: Consumer May Get What they Pay For. Journal of Marketing Research (November 2005).",
      "doi": ""
    },
    {
      "text": "Aaron Springer, Victoria Hollis, and Steve Whittaker. 2017. Dice in the Black Box: User Experiences with an Inscrutable Algorithm. AAAI Spring Symposium Series (2017).",
      "doi": ""
    },
    {
      "text": "Steve Stewart-Williams and John Podd. 2004. The Placebo Effect: Dissolving the Expectancy versus Conditioning Debate. Psychological Bulletin 130, 2 (2004), 324.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger. 2016. \"This has to be the cats\": Personal Data Legibility in Networked Sensing Systems. In Proc. CSCW. ACM.  ",
      "doi": "10.1145/2818048.2819992"
    },
    {
      "text": "Zeynep Tufekci. 2017. Twitter and tear gas: The power and fragility of networked protest. Yale University Press. ",
      "doi": "10.5555/3159125"
    },
    {
      "text": "Twitter. 2017. Q1 2017 Letter to Shareholders. http://files.shareholder.com/downloads/AMDA-2F526X/ 5234607751x0x939175/ D7BAFE57-DCBD-42E9--9909--7F587047FCED/Q117_Shareholder_Letter.pdf. (April 2017).",
      "doi": ""
    },
    {
      "text": "Kami Vaniea, Lujo Bauer, Lorrie Faith Cranor, and Michael K Reiter. 2012. Out of sight, out of mind: Effects of displaying access-control information near the item it controls. In Privacy, Security and Trust (PST). IEEE, 128--136.  ",
      "doi": "10.1109/PST.2012.6297929"
    },
    {
      "text": "Jeffrey Warshaw, Tara Matthews, Steve Whittaker, Chris Kau, Mateo Bengualid, and Barton A Smith. 2015. Can an Algorithm Know the Real You?: Understanding People's Reactions to Hyper-personal Analytics Systems. In Proc. CHI. ACM.  ",
      "doi": "10.1145/2702123.2702274"
    },
    {
      "text": "Rayoung Yang and Mark W Newman. 2013. Learning from a learning thermostat: lessons for intelligent systems for the home. In Proc. Ubicomp. ACM.  ",
      "doi": "10.1145/2493432.2493489"
    },
    {
      "text": "Rayoung Yang, Eunice Shin, Mark W Newman, and Mark S Ackerman. 2015. When fitness trackers don't 'fit': end-user difficulties in the assessment of personal tracking device accuracy. In Proc. Ubicomp. ACM.  ",
      "doi": "10.1145/2750858.2804269"
    },
    {
      "text": "Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of Facebook: Experiencing social media as performance, exhibition, and personal archive. In Proc. CHI. ACM.  ",
      "doi": "10.1145/2470654.2470656"
    },
    {
      "text": "Ethan Zuckerman. 2017. Who Filters Your News? Why we built gobo.social. https://medium.com/mit-media-lab/ who-filters-your-news-why-we-built-gobo-social-bfa6748b5944. (2017).",
      "doi": ""
    }
  ]
}