{
  "doi": "10.1145/3173574.3173983",
  "title": "ARcadia: A Rapid Prototyping Platform for Real-time Tangible Interfaces",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2018,
  "badges": [],
  "abstract": "Paper-based fabrication techniques offer powerful opportunities to prototype new technological interfaces. Typically, paper-based interfaces are either static mockups or require integration with sensors to provide real-time interactivity. The latter can be challenging and expensive, requiring knowledge of electronics, programming, and sensing. But what if computer vision could be combined with prototyping domain-aware programming tools to support the rapid construction of interactive, paper-based tangible interfaces? We designed a toolkit called ARcadia that allows for rapid, low-cost prototyping of TUIs that only requires access to a webcam, a web browser, and paper. ARcadia brings paper prototypes to life through the use of marker based augmented reality (AR). Users create mappings between real-world tangible objects and different UI elements. After a crafting and programming phase, all subsequent interactions take place with the tangible objects. We evaluated ARcadia in a workshop with 120 teenage girls and found that tangible AR technologies can empower novice technology designers to rapidly construct and iterate on their ideas.",
  "authors": [
    {
      "name": "Annie Kelly",
      "institution": "University of Colorado Boulder, Boulder, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162649",
      "orcid": "missing"
    },
    {
      "name": "R. Benjamin Shapiro",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81316490277/rel-imgonly/skullct.png",
      "acmid": "81316490277",
      "orcid": "missing"
    },
    {
      "name": "Jonathan de Halleux",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435593783",
      "orcid": "missing"
    },
    {
      "name": "Thomas Ball",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100472343",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. ARcadia. https: //laboratoryforplayfulcomputation.github.io/arcadia/. (2017).",
      "doi": ""
    },
    {
      "text": "Apple. 2017. ARKit. https://developer.apple.com/arkit/. (2017). {Online; accessed 5-August-2017}.",
      "doi": ""
    },
    {
      "text": "ARToolKit. 2017. Javascript ARToolKit v5.x. https://github.com/artoolkit/jsartoolkit5. (2017). {Online; accessed 1-September-2017}.",
      "doi": ""
    },
    {
      "text": "Ricardo Cabello. 2017. three.js. https://threejs.org/. (2017). {Online; accessed 21-June-2017}.",
      "doi": ""
    },
    {
      "text": "Jerome Etienne. 2017. AR.js. https://github.com/ jeromeetienne/AR.js/blob/master/README.md. (2017). {Online; accessed 21-June-2017}.",
      "doi": ""
    },
    {
      "text": "Markus Funk and Oliver Korn. 2014. An Augmented Workplace for Enabling User-Defined Tangibles. Proceedings of the 2014 CHI Conference on Human Factors in Computing Systems (2014), 1285--1290.  ",
      "doi": "10.1145/2559206.2581142"
    },
    {
      "text": "Google. 2017. ARCore. https://developers.google.com/ar/. (2017). {Online; accessed 5-August-2017}.",
      "doi": ""
    },
    {
      "text": "Valentin Heun, Shunichi Kasahara, and Pattie Maes. 2013. Smarter Objects: Using AR Technology to Program Physical Objects and their Interactions. Proceedings of the 2013 CHI Conference on Human Factors in Computing Systems (2013), 2939--2942.  ",
      "doi": "10.1145/2468356.2479579"
    },
    {
      "text": "Michael S Horn and Robert J K Jacob. 2007. Designing Tangible Programming Languages for Classroom Use. January 2007 (2007).  ",
      "doi": "10.1145/1226969.1227003"
    },
    {
      "text": "Andrew J Hunsucker and Jennifer Wang. 2017. Augmented Reality Prototyping For Interaction Design Students. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017), 1018--1023.  ",
      "doi": "10.1145/3027063.3053684"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, New York, NY, USA, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Annie Kelly. 2017. Augmented Reality Tangible YouTube Scrubber. https://youtu.be/pbuMtTkT1F4. (2017).",
      "doi": ""
    },
    {
      "text": "Felix Lauber, Claudius Böttcher, and Andreas Butz. 2014. PapAR: Paper Prototyping for Augmented Reality. Automotive UI'14 (2014).  ",
      "doi": "10.1145/2667239.2667271"
    },
    {
      "text": "Microsoft. 2017a. Microsoft MakeCode. https://makecode.com/about. (2017). {Online; accessed 11-June-2017}.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2017b. Microsoft MakeCode (PXT Programming eXperience Toolkit). https://github.com/Microsoft/pxt. (2017). {Online; accessed 5-June-2017}.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: Programming for All. Commun. ACM 52, 11 (Nov. 2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "R Benjamin Shapiro, Annie Kelly, Matthew Ahrens, Benjamin Johnson, and Heather Politi. 2017. BlockyTalky: Tangible Distributed Computer Music for Youth. The Computer Music Journal. MIT Press. (2017).  ",
      "doi": "10.1162/COMJ_a_00420"
    },
    {
      "text": "Tonejs. 2017. Tone.js. https://tonejs.github.io/. (2017). {Online; accessed 2-July-2017}.",
      "doi": ""
    }
  ]
}