{
  "doi": "10.1145/3173574.3173739",
  "title": "VR-OOM: Virtual Reality On-rOad driving siMulation",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Researchers and designers of in-vehicle interactions and interfaces currently have to choose between performing evaluation and human factors experiments in laboratory driving simulators or on-road experiments. To enjoy the benefit of customizable course design in controlled experiments with the immediacy and rich sensations of on-road driving, we have developed a new method and tools to enable VR driving simulation in a vehicle as it travels on a road. In this paper, we describe how the cost-effective and flexible implementation of this platform allows for rapid prototyping. A preliminary pilot test (N = 6), centered on an autonomous driving scenario, yields promising results, illustrating proof of concept and indicating that a basic implementation of the system can invoke genuine responses from test participants.",
  "tags": [
    "design evaluation",
    "autonomous vehicles",
    "virtual reality",
    "prototyping"
  ],
  "authors": [
    {
      "name": "David Goedicke",
      "institution": "University of Twente, Stanford University, & Cornell Tech, New York City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261564",
      "orcid": "missing"
    },
    {
      "name": "Jamy Li",
      "institution": "University of Twente, Enschede, Overijssel, Netherlands",
      "img": "/do/10.1145/contrib-84458764957/rel-imgonly/fpe_200402_0611.jpg",
      "acmid": "84458764957",
      "orcid": "missing"
    },
    {
      "name": "Vanessa Evers",
      "institution": "University of Twente, Enschede, Netherlands",
      "img": "/do/10.1145/contrib-81100133286/rel-imgonly/vanessa-1.jpg",
      "acmid": "81100133286",
      "orcid": "missing"
    },
    {
      "name": "Wendy Ju",
      "institution": "Cornell Tech & Stanford University, New York City, NY, USA",
      "img": "/do/10.1145/contrib-81100098733/rel-imgonly/wendy_headshot.jpg",
      "acmid": "81100098733",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Talal Al-Shihabi and Ronald Mourant. 2003. Toward more realistic driving behavior models for autonomous vehicles in driving simulators. Transportation Research Record: Journal of the Transportation Research Board 1843 (2003), 41--49.",
      "doi": ""
    },
    {
      "text": "Micah Alpern and Katie Minardo. 2003. Developing a car gesture interface for use as a secondary task. In CHI'03 extended abstracts on Human factors in computing systems. ACM, 932--933.  ",
      "doi": "10.1145/765891.766078"
    },
    {
      "text": "Ignacio Alvarez, Laura Rumbel, and Robert Adams. 2015. Skyline: a rapid prototyping driving simulator for user experience. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 101--108.  ",
      "doi": "10.1145/2799250.2799290"
    },
    {
      "text": "Bruce Artz, Larry Cathey, Peter Grant, Dan Houston, Jeff Greenberg, and Max Mariani. 2001. The design and construction of the visual subsystem for VIRTTEX, the driving simulator at the Ford research laboratories. In Driving simulation conference. 255--262.",
      "doi": ""
    },
    {
      "text": "Ed Bachelder. 2006. Helicopter aircrew training using fused reality. Technical Report. Systems Technology Inc. Hawthorne, CA.",
      "doi": ""
    },
    {
      "text": "Sonia Baltodano, Srinath Sibi, Nikolas Martelaro, Nikhil Gowda, and Wendy Ju. 2015. The RRADS platform: a real road autonomous driving simulator. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 281--288.  ",
      "doi": "10.1145/2799250.2799288"
    },
    {
      "text": "Salvador Bayarri, Marcos Fernandez, and Mariano Perez. 1996. Virtual Reality for Driving Simulation. Commun. ACM 39, 5 (Dec. 1996), 72--76.  ",
      "doi": "10.1145/229459.229468"
    },
    {
      "text": "Miles Branman. 2017 (accessed September 17, 2017). Honda's Dream Drive VR experience may be the future of in-car entertainment. https://www.digitaltrends.com/ cars/ces-2017-honda-dream-drive/",
      "doi": ""
    },
    {
      "text": "Monroe Conner. 2015 (accessed September 17, 2017). Fused Reality: Making the Imagined Seem Real. https://www.nasa.gov/centers/armstrong/features/fused_reality.html",
      "doi": ""
    },
    {
      "text": "Piotr Didyk, Elmar Eisemann, Tobias Ritschel, Karol Myszkowski, and Hans-Peter Seidel. 2010. Perceptually-motivated Real-time Temporal Upsampling of 3D Content for High-refresh-rate Displays. In Computer Graphics Forum, Vol. 29. Wiley Online Library, 713--722.",
      "doi": ""
    },
    {
      "text": "Thomas A Dingus, Sheila G Klauer, Vicki L Neale, A Petersen, Suzanne E Lee, JD Sudweeks, MA Perez, J Hankey, DJ Ramsey, S Gupta, and others. 2006. The 100-car naturalistic driving study, Phase II-results of the 100-car field experiment. Technical Report.",
      "doi": ""
    },
    {
      "text": "Frank Flemisch, Matthias Heesen, Tobias Hesse, Johann Kelsch, Anna Schieben, and Johannes Beller. 2012. Towards a dynamic balance between humans and automation: authority, ability, responsibility and control in shared and cooperative control situations. Cognition, Technology & Work 14, 1 (2012), 3--18.  ",
      "doi": "10.1007/s10111-011-0191-6"
    },
    {
      "text": "JS Freeman, G Watson, YE Papelis, TC Lin, A Tayyab, RA Romano, and JG Kuhl. 1995. The Iowa driving simulator: An implementation and application overview. (1995).",
      "doi": ""
    },
    {
      "text": "Petra Geutner, Frank Steffens, and Dietrich Manstetten. 2002. Design of the VICO Spoken Dialogue System: Evaluation of User Expectations by Wizard-of-Oz Experiments. In LREC.",
      "doi": ""
    },
    {
      "text": "Christian Gold, Lutz Lorenz, Daniel Damböck, and Klaus Bengler. 2013. Partially automated driving as a fallback level of high automation. Tagung Fahrerassistenzsysteme. Der Weg zum automatischen Fahren 28, 29.11 (2013), 2013.",
      "doi": ""
    },
    {
      "text": "D Grothkopp, W Krautter, B Grothkopp, F Steffens, and F Geutner. 2001. Using a driving simulator to perform a Wizard-of-Oz experiment on speech-controlled driver information systems. In Proceedings of the 1st Human-Centered Transportation Simulation Conference.",
      "doi": ""
    },
    {
      "text": "David Hallvig, Anna Anund, Carina Fors, Göran Kecklund, Johan G Karlsson, Mattias Wahde, and Torbjörn Åkerstedt. 2013. Sleepy driving on the real road and in the simulator--A comparison. Accident Analysis & Prevention 50 (2013), 44--50.",
      "doi": ""
    },
    {
      "text": "Arne Helland, Gunnar D Jenssen, Lone-Eirin Lervåg, Andreas Austgulen Westin, Terje Moen, Kristian Sakshaug, Stian Lydersen, Jørg Mørland, and Lars Slørdal. 2013. Comparison of driving simulator performance with real driving after alcohol intake: A randomised, single blind, placebo-controlled, cross-over trial. Accident Analysis & Prevention 53 (2013), 9--16.",
      "doi": ""
    },
    {
      "text": "Philipp Hock, Sebastian Benedikter, Jan Gugenheimer, and Enrico Rukzio. 2017. CarVR. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. 4034--4044.  ",
      "doi": "10.1145/3025453.3025665"
    },
    {
      "text": "Robert JK Jacob, Audrey Girouard, Leanne M Hirshfield, Michael S Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2008. Reality-based interaction: a framework for post-WIMP interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 201--210.  ",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Nico Kaptein, Jan Theeuwes, and Richard Van Der Horst. 1996. Driving simulator validity: Some considerations. Transportation Research Record: Journal of the Transportation Research Board 1550 (1996), 30--36.",
      "doi": ""
    },
    {
      "text": "Andras Kemeny and Francesco Panerai. 2003. Evaluating perception in driving simulation experiments. Trends in cognitive sciences 7, 1 (2003), 31--37.",
      "doi": ""
    },
    {
      "text": "F Kramer and M Israel. 2014. Virtueller Greifreflex. Ein Konfliktpotenzial und die Moeglichkeiten der Kompensation in Personenkraftwagen mithilfe moderner Assistenzsysteme. Verkehrsunfall und Fahrzeugtechnik 52, 11 (2014).",
      "doi": ""
    },
    {
      "text": "Markus Kuderer, Shilpa Gulati, and Wolfram Burgard. 2015. Learning driving styles for autonomous vehicles from demonstration. 2015 IEEE International Conference on Robotics and Automation (ICRA) (2015), 2641--2646.",
      "doi": ""
    },
    {
      "text": "Brian Lathrop, Hua Cheng, Fuliang Weng, Rohit Mishra, Joyce Chen, Harry Bratt, Lawrence Cavedon, Carsten Bergmann, Tess Hand-Bender, Heather Pon-Barry, and others. 2004. A Wizard of Oz framework for collecting spoken human-computer dialogs: An experiment procedure for the design and testing of natural language in-vehicle technology systems. In Proc. ITS.",
      "doi": ""
    },
    {
      "text": "Jack M Loomis, James J Blascovich, and Andrew C Beall. 1999. Immersive virtual environment technology as a basic research tool in psychology. Behavior Research Methods, Instruments, & Computers 31, 4 (1999), 557--564.",
      "doi": ""
    },
    {
      "text": "Nikolas Martelaro and Wendy Ju. 2017. WoZ Way: Enabling Real-time Remote Interaction Prototyping & Observation in On-road Vehicles. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 21--24.  ",
      "doi": "10.1145/3022198.3023271"
    },
    {
      "text": "Mark McGill, Alexander Ng, and Stephen Brewster. 2017. I Am The Passenger: How Visual Motion Cues Can Influence Sickness For In-Car VR. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (2017), 5655--5668.  ",
      "doi": "10.1145/3025453.3026046"
    },
    {
      "text": "Natasha Merat, A Hamish Jamson, Frank CH Lai, Michael Daly, and Oliver MJ Carsten. 2014. Transition to manual: Driver behaviour when resuming control from a highly automated vehicle. Transportation research part F: traffic psychology and behaviour 27 (2014), 274--282.",
      "doi": ""
    },
    {
      "text": "David Miller, Annabel Sun, Mishel Johns, Hillary Ive, David Sirkin, Sudipto Aich, and Wendy Ju. 2015. Distraction becomes engagement in automated driving. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 59. SAGE Publications Sage CA: Los Angeles, CA, 1676--1680.",
      "doi": ""
    },
    {
      "text": "Rohit Mishra, Elizabeth Shriberg, Sandra Upson, Joyce Chen, Fuliang Weng, Stanley Peters, Lawrence Cavedon, John Niekrasz, Hua Cheng, and Harry Bratt. 2004. A wizard of Oz framework for collecting spoken human-computer dialogs. In Eighth International Conference on Spoken Language Processing.",
      "doi": ""
    },
    {
      "text": "Brian Ka-Jun Mok, David Sirkin, Srinath Sibi, David Bryan Miller, and Wendy Ju. 2015. Understanding driver-automated vehicle interactions through Wizard of Oz design improvisation. In Proceedings of the International Driving Symposium on Human Factors in Driver Assessment, Training and Vehicle Design. 386--392.",
      "doi": ""
    },
    {
      "text": "Anna Schieben, Matthias Heesen, Julian Schindler, Johann Kelsch, and Frank Flemisch. 2009. The theater-system technique: Agile designing and testing of system behavior and interaction, applied to highly automated vehicles. In Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 43--46.  ",
      "doi": "10.1145/1620509.1620517"
    },
    {
      "text": "G Schmidt, M Kiss, E Babbel, and A Galla. 2008. The Wizard on Wheels: Rapid Prototyping and User Testing of Future Driver Assistance Using Wizard of Oz Technique in a Vehicle. In Proceedings of the FISITA 2008 World Automotive Congress, Munich.",
      "doi": ""
    },
    {
      "text": "JJ Slob. 2008. State-of-the-art driving simulators, a literature survey. DCT report 107 (2008).",
      "doi": ""
    },
    {
      "text": "Jonathan Stevens, Peter Kincaid, and Robert Sottilare. 2015. Visual modality research in virtual and mixed reality simulation. The Journal of Defense Modeling and Simulation 12, 4 (2015), 519--537.",
      "doi": ""
    },
    {
      "text": "Thomas Waltemate, Irene Senna, Felix Hülsmann, Marieke Rohde, Stefan Kopp, Marc Ernst, and Mario Botsch. 2016. The Impact of Latency on Perceptual Judgments and Motor Performance in Closed-loop Interaction in Virtual Reality. In Proceedings of the 22Nd ACM Conference on Virtual Reality Software and Technology (VRST '16). ACM, New York, NY, USA, 27--35.  ",
      "doi": "10.1145/2993369.2993381"
    },
    {
      "text": "Peter Wang, Srinath Sibi, Brian Mok, and Wendy Ju. 2017. Marionette: Enabling On-Road Wizard-of-Oz Autonomous Driving Studies. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 234--243.  ",
      "doi": "10.1145/2909824.3020256"
    },
    {
      "text": "Ginger S. Watson and Yiannis E. Papelis. 1997. The Iowa Driving Simulator: Using Simulation for Human Performance Measurement. In Emerging Technologies for Nutrition Research: Potential for Assessing Military Performance Capability, Sydne J. Carlson-Newberry and Rebecca B. Costello (Eds.). Institute of Medicine (US) Committee on Military Nutrition Research, Oxford, Chapter 26, 551--568.",
      "doi": ""
    }
  ]
}