{
  "doi": "10.1145/3173574.3173633",
  "title": "Rich Representations of Visual Content for Screen Reader Users",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Alt text (short for \"alternative text\") is descriptive text associated with an image in HTML and other document formats. Screen reader technologies speak the alt text aloud to people who are visually impaired. Introduced with HTML 2.0 in 1995, the alt attribute has not evolved despite significant changes in technology over the past two decades. In light of the expanding volume, purpose, and importance of digital imagery, we reflect on how alt text could be supplemented to offer a richer experience of visual content to screen reader users. Our contributions include articulating the design space of representations of visual content for screen reader users, prototypes illustrating several points within this design space, and evaluations of several of these new image representations with people who are blind. We close by discussing the implications of our taxonomy, prototypes, and user study findings.",
  "authors": [
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Jazette Johnson",
      "institution": "Microsoft Research & Vanderbilt University, Nashville, TN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261095",
      "orcid": "missing"
    },
    {
      "name": "Cynthia L. Bennett",
      "institution": "Microsoft Research & University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358692957",
      "orcid": "0000-0003-1036-2497"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    }
  ],
  "references": [
    {
      "text": "Adams, D., Kurniawan, S., Herrera, C., Kang, V., and Friedman, N. Blind Photographers and VizSnap: A Long-Term Study. Proceedings of ASSETS 2016.  ",
      "doi": "10.1145/2982142.2982169"
    },
    {
      "text": "Berners-Lee, T. (1995). Image: IMG. In Hypertext Markup Language - 2.0 Document structure. World Wide Web Consortium. https://www.w3.org/MarkUp/html-spec/htmlspec_5.html#SEC5.10",
      "doi": ""
    },
    {
      "text": "Berners-Lee, T. and Connolly, D. Hypertext Markup Language - 2.0. November 1995. Retrieved February 24, 2017 from https://tools.ietf.org/html/rfc1866 ",
      "doi": "10.17487/RFC1866"
    },
    {
      "text": "Bigham, J.P., Jayant, C., Ji, H., Little, G., Miller, A., Miller, R.C., Miller, R., Tatarowicz, A., White, B., White, S., and Yeh, T. VizWiz: Nearly Real-time Answers to Visual Questions. Proceedings of UIST 2010.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Bigham, J.P., Kaminsky, R.S., Ladner, R.E., Danielsson, O.M., and Hempton, G.I. WebInSight: Making Web Images Accessible. Proceedings of ASSETS 2006.  ",
      "doi": "10.1145/1168987.1169018"
    },
    {
      "text": "Brady, E.L., Zhong, Y., Morris, M.R., and Bigham, J.P. Investigating the Appropriateness of Social Network Question Asking as a Resource for Blind Users. Proceedings of CSCW 2013.  ",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "Brady, E., Morris, M.R., and Bigham, J.P. Gauging Receptiveness to Social Microvolunteering. Proceedings of CHI 2015.  ",
      "doi": "10.1145/2702123.2702329"
    },
    {
      "text": "Card, S., Mackinlay, J.D., and Robertson, G.G. The Design Space of Input Devices. Proceedings of CHI 1990.  ",
      "doi": "10.1145/97243.97263"
    },
    {
      "text": "Edwards, J. \"Planet Selfie: We're Now Posting a Staggering 1.8 Billion Photos Every Day.\" Business Insider, May 28, 2014.",
      "doi": ""
    },
    {
      "text": "Fang, H., Gupta, S., Iandola, F., Srivastava, R.K., Deng, L., dollar, P., Gao, J., He, X., Mitchell, M., Platt, J.C., Zitnick, C.L., and Zweig, G. From captions to visual concepts and back. Proceedings of CVPR 2015.",
      "doi": ""
    },
    {
      "text": "Frolich, D. and Tallyn, E. Audiophotography: Practice and Prospects. Extended Abstracts of CHI 1999.  ",
      "doi": "10.1145/632716.632897"
    },
    {
      "text": "GSA Government-wide Section 508 Accessibility Program. http://www.section508.gov",
      "doi": ""
    },
    {
      "text": "Goodwin, M., Susar, D., Nietzio, A., Snaprud, M., and Jensen, C.S. 2011. Global web accessibility analysis of national government portals and ministry web sites. Journal of Information Technology and Politics, 8(1), 41--67.",
      "doi": ""
    },
    {
      "text": "Harada, S., Sato, D., Adams, D.W., Kurniawan, S., Takagi, H., and Asakawa, C. Accessible Photo Album: Enhancing the Photo Sharing Experience for People with Visual Impairment. Proceedings of CHI 2013.  ",
      "doi": "10.1145/2470654.2481292"
    },
    {
      "text": "Issa, Y.B., Mojahid, M., Oriola, B., and Vigouroux, N. Accessibility for the blind: An automated audio/tactile description of pictures in digital documents. Proceedings of ACTEA 2009.",
      "doi": ""
    },
    {
      "text": "Korpela, J. (September 1998). Guidelines on ALT texts in IMG elements. Retrieved 26 August, 2017 from http://www.cs.tut.fi/~jkorpela/html/alt.html.",
      "doi": ""
    },
    {
      "text": "LaBarre, S.C. 2007. ABA Resolution and Report on Website Accessibility. Mental and Physical Disability Law Reporter. 31(4), 504--507.",
      "doi": ""
    },
    {
      "text": "Loiacono, E.T., Romano, N.C., and McCoy, S. 2009. The state of corporate website accessibility. Communications of the ACM, 52(9), September 2009, 128--132.  ",
      "doi": "10.1145/1562164.1562197"
    },
    {
      "text": "MacLeod, H., Bennett, C.L., Morris, M.R., and Cutrell, E. Understanding Blind People's Experiences with Computer-Generated Captions of Social Media Images. Proceedings of CHI 2017.  ",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Morash, V.S., Siu, Y-T., Miele, J.A., Hasty, L., and Landau, S. Guiding Novice Web Workers in Making Image Descriptions Using Templates. ACM Transactions on Accessible Computing, 7(4), November 2015.  ",
      "doi": "10.1145/2764916"
    },
    {
      "text": "Morris, M.R., Zolyomi, A., Yao, C., Bahram, S., Bigham, J.P., and Kane, S.K. \"With most of it being pictures now, I rarely use it\": Understanding Twitter's Evolving Accessibility to Blind Users. Proceedings of CHI 2016.  ",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Olalere, A. and Lazar, J. 2011. Accessibility of U.S. Federal Government Home Pages: Section 508 Compliance and Site Accessibility Statements. Government Information Quarterly, 28(3), 303--309.",
      "doi": ""
    },
    {
      "text": "Petrie, H., Harrison, C., and Dev, S. Describing Images on the Web: A Survey of current Practice and Prospects for the Future. Proceedings of HCI International 2005.",
      "doi": ""
    },
    {
      "text": "Pilgrim, M. The longdesc lottery. September 14, 2007. https://blog.whatwg.org/the-longdesc-lottery",
      "doi": ""
    },
    {
      "text": "Power, C., Freire, A., Petrie, H., and Swallow, D. Guidelines are only half of the story: Accessibility problems encountered by blind users on the web. Proceedings of CHI 2012.  ",
      "doi": "10.1145/2207676.2207736"
    },
    {
      "text": "Rector, K., Salmon, K., Thornton, D., Joshi, N., and Morris, M.R. (2017) Eyes-Free Art: Exploring Proxemic Audio Interfaces for Blind and Low Vision Art Engagement. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technology (IMWUT 2017).  ",
      "doi": "10.1145/3130958"
    },
    {
      "text": "Salisbury, E., Kamar, E., and Morris, M.R. Toward Scalable Social Alt Text: Conversational Crowdsourcing as a Tool for Refining Vision-toLanguage Technology for the Blind. Proceedings of HCOMP 2017.",
      "doi": ""
    },
    {
      "text": "Slatin, J.M. and Rush, S. Maximum Accessibility: Making your Web Site More Usable for Everyone. Addison-Wesley Longman Publishing Co., Inc. 2002. ",
      "doi": "10.5555/560695"
    },
    {
      "text": "Shi, Y. E-Government Web Site Accessibility in Australia and China: A Longitudinal Study. Social Science Computer Review, Fall 2006. 24: 378--385.",
      "doi": ""
    },
    {
      "text": "Stolley, K. Image Accessibility Part I: Beyond alt Attributes. Digital Rhetoric Collaborative. June 2016. http://www.digitalrhetoriccollaborative.org/2016/06/15 /image-accessibility-part-i-beyond-alt-attributes/",
      "doi": ""
    },
    {
      "text": "Tran, K., He, X., Zhang, L., Sun, J., Carapcea, C., Thrasher, C., Buehler, C., and Sienkiewicz, C. Rich Image Captioning in the Wild. Proceedings of CVPR 2016.",
      "doi": ""
    },
    {
      "text": "Twitter Blog. Accessible Images for Everyone. March 29, 2016. https://blog.twitter.com/official/en_us/a/2016/accessibl e-images-for-everyone.html",
      "doi": ""
    },
    {
      "text": "von Ahn, L., Ginosar, S., Kedia, M., Liu, R., and Blum, M. Improving accessibility of the web with a computer game. Proceedings of CHI 2006.  ",
      "doi": "10.1145/1124772.1124785"
    },
    {
      "text": "Voykinska, V., Azenkot, S., Wu, S., and Leshed, G. How Blind People Interact with Visual Content on Social Networking Services. Proceedings of CSCW 2016.  ",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "Web Accessibility in Mind (WebAIM). Alternative Text. http://webaim.org/techniques/alttext/",
      "doi": ""
    },
    {
      "text": "World Health Organization. \"Visual Impairment and Blindness\" factsheet, August 2014. http://www.who.int/mediacentre/factsheets/fs282/en/",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium (W3C). Accessible Rich Internet Applications (WAI-ARIA) 1.1. https://www.w3.org/TR/wai-aria/",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium (W3C). HTML5 Image Description Extension (longdesc). https://www.w3.org/TR/html-longdesc/",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium (W3C). Techniques for WCAG 2.0, H37: Using alt attributes on img elements. http://www.w3.org/TR/WCAG20-TECHS/H37.html",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium (W3C). Web Accessibility Tutorials: Images Concepts. https://www.w3.org/WAI/tutorials/images/",
      "doi": ""
    },
    {
      "text": "Wu, S., Wieland, J., Farivar, O., and Schiller, J. Automatic Alt-text: Computer-generated Image Descriptions for Blind Users on a Social Network Service. Proceedings of CSCW 2017.  ",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Zhong, Y., Lasecki, W.S., Brady, E., and Bigham, J.P. RegionSpeak: Quick Comprehensive Spatial Descriptions of Complex Images for Blind Users. Proceedings of CHI 2015.  ",
      "doi": "10.1145/2702123.2702437"
    }
  ]
}