{
  "doi": "10.1145/3173574.3173853",
  "title": "Collaborative Reflection: A Practice for Enriching Research Partnerships Spanning Culture, Discipline, and Time",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "All too often, research partnerships are project-driven and short-lived. Multi-lifespan design and other longer-term approaches offer alternative models. In this paper, we contribute one alternative model for cross-boundary research partnerships spanning longer timeframes and offer one best practice: collaborative reflection. Specifically, we provide an in-depth case study of a multi-lifespan design partnership (over nine years and ongoing) between a Rwandan NGO focused on peacebuilding and a US university research group focused on information design theory and method. First, we document our process for conducting a collaborative reflection that seeks balance among the contributors while navigating differences in culture, discipline, experience, and skills. Next, we reflect on five themes: (1) common ground: sensibilities and commitments; (2) trust; (3) research landscape: crossing nations and institutions; (4) research as a healing mechanism; and (5) multi-lifespan design partnership. We conclude with a discussion of overarching considerations for design researchers who engage in cross-boundary research partnership.",
  "authors": [
    {
      "name": "Daisy Yoo",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556772856",
      "orcid": "missing"
    },
    {
      "name": "Odeth Kantengwa",
      "institution": "Never Again Rwanda, Kigali, Rwanda",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260561",
      "orcid": "missing"
    },
    {
      "name": "Nick Logler",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261966",
      "orcid": "missing"
    },
    {
      "name": "Reverien Interayamahanga",
      "institution": "Never Again Rwanda, Kigali, Rwanda",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261161",
      "orcid": "missing"
    },
    {
      "name": "Joseph Nkurunziza",
      "institution": "Never Again Rwanda, Kigali, Rwanda",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260447",
      "orcid": "missing"
    },
    {
      "name": "Batya Friedman",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100636215",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Seyram Avle, Silvia Lindtner, and Kaiton Williams. 2017. How methods make designers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17), 472--482.  ",
      "doi": "10.1145/3025453.3025864"
    },
    {
      "text": "Annette Baier. 1986. Trust and antitrust. Ethics 96, 2: 231--260.",
      "doi": ""
    },
    {
      "text": "Nicola J. Bidwell. 2014. Moving the centre to design social media for rural Africa. AI&Soc: Journal of Culture, Communication & Knowledge 31, 1: 51--77.  ",
      "doi": "10.1007/s00146-014-0564-5"
    },
    {
      "text": "Monika Büscher, Dan Shapiro, Mark Hartswood, Rob Procter, Roger Slack, Alex Voß, and Preben Mogensen. 2002. Promises, premises and risks: Sharing responsibilities, working up trust and sustaining commitment in participatory design projects. In Proceedings of the Participatory Design Conference, 183--192.",
      "doi": ""
    },
    {
      "text": "Phil Clark. 2017. Rwanda-Expert Briefing. Retrieved September 18, 2017 from https://www.africaresearchinstitute.org/newsite/rwanda -expert-briefing/",
      "doi": ""
    },
    {
      "text": "Jonathon N. Cummings, and Sara Kiesler. 2005. Collaborative research across disciplinary and organizational boundaries. Social Studies of Science 35, 5: 703--722.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer, Andreas C. Lemke, Raymond McCall, and Anders I. Morch. 1991. Making argumentation serve design. Human-Computer Interaction 6, 3--4: 393--419.  ",
      "doi": "10.1207/s15327051hci0603%25264_7"
    },
    {
      "text": "Batya Friedman and Lisa P. Nathan. 2010. Multilifespan information system design: A research initiative for the HCI community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 2243--2246.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "Batya Friedman and Daisy Yoo. 2017. Pause: A Multilifespan Design Mechanism. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17), 460--464.  ",
      "doi": "10.1145/3025453.3026031"
    },
    {
      "text": "Dieter K. Hammer, and Isabelle Reymen. 2002. The role of emotion in design reflection. In Proceedings of the 3rd International Conference on Design and Emotion, 421--425.",
      "doi": ""
    },
    {
      "text": "Isaac Holeman, Edwin Blake, Melissa Densmore, 'Maletšbisa Molapo, Fiona Ssozi, Elizabeth Goodman, Indrani Medhi Thies, and Susan Wyche. 2017. Codesign across borders special interest group. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 1318--1321.  ",
      "doi": "10.1145/3027063.3049288"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: A lens on design and development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Thomas P. Moran and John M. Carroll. 1996. Design Rationale: Concepts, Techniques, and Use. L. Erlbaum Associates Inc. ",
      "doi": "10.5555/261685"
    },
    {
      "text": "Naasson Munyandamutsa, Paul Mahoro Nkubamugisha, Marianne Gex-Fabry, and Ariel Eytan. 2012. Mental and physical health in Rwanda 14 years after the genocide. Social Psychiatry and Psychiatric Epidemiology 47, 11: 1753--1761.",
      "doi": ""
    },
    {
      "text": "Lisa P. Nathan, Nell Carden Grey, Milli Lake, Trond Nilsen, Elizabeth J. Utter, Robert F. Utter, Mark Ring, Zoe Kahn, and Batya Friedman. 2011. Multi-lifespan information system design: Investigating a new design approach in Rwanda. In Proceedings of the 2011 iConference (iConference 2011), 591--597.  ",
      "doi": "10.1145/1940761.1940841"
    },
    {
      "text": "Never Again Rwanda. Website. Retrieved September 18, 2017 from http://www.neveragainrwanda.org/",
      "doi": ""
    },
    {
      "text": "Never Again Rwanda and Interpeace. 2015. Societal Healing in Rwanda: Mapping of Actors and Approaches. Retrieved September 18, 2017 from http://neveragainrwanda.org/research",
      "doi": ""
    },
    {
      "text": "Isabelle Reymen. 2001. Improving Design Processes through Structured Reflection: A Domain-independent Approach. Ph.D. Thesis. Technische Universiteit Eindhoven.",
      "doi": ""
    },
    {
      "text": "United Nations. 2004. The rule of law and transitional justice in conflict and post-conflict societies: Report of the Secretary-General. Retrieved December 4, 2017 from https://www.un.org/ruleoflaw/blog/document/therule-of-law-and-transitional-justice-in-conflict-andpost-conflict-societies-report-of-the-secretary-general/",
      "doi": ""
    },
    {
      "text": "Voices from the Rwanda Tribunal. Website. Retrieved September 18, 2017 from http://www.tribunalvoices.org",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. 'On the ground' in Sidi Bouzid: investigating social media use during the tunisian revolution. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13), 1409--1418.  ",
      "doi": "10.1145/2441776.2441935"
    },
    {
      "text": "Daisy Yoo, Milli Lake, Trond Nilsen, Molly E. Utter, Robert Alsdorf, Theoneste Bizimana, Lisa P. Nathan, Mark Ring, Elizabeth J. Utter, Robert F. Utter, and Batya Friedman. 2013. Envisioning across generations: A multi-lifespan information system for international justice in Rwanda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2527--2536.  ",
      "doi": "10.1145/2470654.2481349"
    },
    {
      "text": "Daisy Yoo, Katie Derthick, Shaghayegh Ghassemian, Jean Hakizimana, Brian Gill, and Batya Friedman. 2015. Multi-lifespan design thinking: Two methods and a case study with the Rwandan diaspora. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 4423--4434.  ",
      "doi": "10.1145/2858036.2858366"
    }
  ]
}