{
  "doi": "10.1145/3173574.3173942",
  "title": "Effects of Enhanced Gaze Presentation on Gaze Leading in Remote Collaborative Physical Tasks",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "With respect to collaborative physical tasks, gaze and gestures play significant roles when referring to physical objects. In video-mediated communication, however, such nonverbal cues become \"ineffectual\" when they are presented via a 2D monitor, making video-mediated collaborative physical tasks inefficient. This study focuses on gaze cues to support remote collaborative physical tasks and uses an eye-shaped display, \"ThirdEye,\" a simple add-on display that represents a remote participant's gaze direction. ThirdEye is expected to be especially effective when used with mobile terminals. We investigated whether the ThirdEye's gaze shift is effective in leading a local observer's attention toward objects in the local environment, even when ThirdEye is presented with the actual face image of a remote person. Experimental results show that ThirdEye can lead the local participant's attention to intended objects faster than without ThirdEye.",
  "authors": [
    {
      "name": "Mai Otsuki",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81448596239/rel-imgonly/img_2014.jpg",
      "acmid": "81448596239",
      "orcid": "missing"
    },
    {
      "name": "Keita Maruyama",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078952",
      "orcid": "missing"
    },
    {
      "name": "Hideaki Kuzuoka",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    },
    {
      "name": "Yusuke SUZUKI",
      "institution": "Oki Electric Industry Co., Ltd., Warabi, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81554619056",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Henny Admoni, Caroline Bank, Joshua Tan, Mariya Toneva, and Brian Scassellati. 201 Robot gaze does not reflexively cue human attention. Proceedings of the 33rd Annual Conference of the Cognitive Science Society: 1983--1988.",
      "doi": ""
    },
    {
      "text": "Henny Admoni, Christopher Datsikas, and Brian Scassellati. 2014. Speech and Gaze Conflicts in Collaborative Human-Robot Interactions. Proceedings of the 36th Annual Conference of the Cognitive Science Society (CogSci 2014): 104--109.",
      "doi": ""
    },
    {
      "text": "Sean Andrist, Wesley Collier, Michael Gleicher, Bilge Mutlu, and David Shaffer. 2015. Look together: analyzing gaze coordination with epistemic network analysis. Frontiers in Psychology 6, July: 1016.",
      "doi": ""
    },
    {
      "text": "Sean Andrist, Michael Gleicher, and Bilge Mutlu. 2017. Looking Coordinated: Bidirectional Gaze Mechanisms for Collaborative Interaction with Virtual Characters. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17: 2571--2582.  ",
      "doi": "10.1145/3025453.3026033"
    },
    {
      "text": "Andrew P. Bayliss, Emily Murphy, Claire K. Naughtin, Ada Kritikos, Leonhard Schilbach, and Stefanie I. Becker. 2013. \"Gaze leading\": Initiating simulated joint attention influences eye movements and choice behavior. Journal of Experimental Psychology: General 142, 1: 76--92.",
      "doi": ""
    },
    {
      "text": "Jean David Boucher, Ugo Pattacini, Amelie Lelong, Gerard Bailly, Frederic Elisei, Sascha Fagel, Peter Ford Dominey, and Jocelyne Ventre-Dominey. 2012. I reach faster when i see you look: Gaze effects in human-human and human-robot face-to-face cooperation. Frontiers in Neurorobotics 6, MAY: 1--11.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on shared experiences: Moving Beyond the Camera in Video Communication. In Proceedings of the Designing Interactive Systems Conference on - DIS '12, 96.  ",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Sarah D'Angelo and Andrew Begel. 2017. Improving Communication Between Pair Programmers Using Shared Gaze Awareness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 6245--6290.  ",
      "doi": "10.1145/3025453.3025573"
    },
    {
      "text": "Sarah D'Angelo and Darren Gergle. 2016. Gazed and Confused: Understanding and Designing Shared Gaze for Remote Collaboration. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 2492--2496.  ",
      "doi": "10.1145/2858036.2858499"
    },
    {
      "text": "J. V. Forrester, A. D. Dick, McMenamin, Roberts P. G., and E. F., Pearlman. 2015. The eye: Basic Sciences in Practice. Elsevier Health Sciences. Elsevier Health Sciences UK, London?: Retrieved August 19, 2017 from http://www.worldcat.org/title/eye-basic-sciences-in-practice/oclc/910580769?referer=di&ht=edition#.WZfOXMvkswY.mendeley",
      "doi": ""
    },
    {
      "text": "1Chris Kelland Friesen and Alan Kingstone. 1998. The eyes have it! Reflexive orienting is triggered by nonpredictive gaze. Psychonomic Bulletin & Review 5, 3: 490--495.",
      "doi": ""
    },
    {
      "text": "Susan R Fussell, Leslie D Setlock, and Elizabeth M Parker. 2003. Where do helpers look? In CHI '03 extended abstracts on Human factors in computing systems - CHI '03, 768.",
      "doi": "10.1145/765891.765980"
    },
    {
      "text": "Susan Fussell, Leslie Setlock, Jie Yang, Jiazhi Ou, Elizabeth Mauer, and Adam Kramer. 2004. Gestures Over Video Streams to Support Remote Collaboration on Physical Tasks. Human-Computer Interaction 19, 3: 273--309.  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Höllerer. 20 World-stabilized annotations and virtual scene navigation for remote collaboration. In Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14, 449--459.  ",
      "doi": "10.1145/2642918.2647372"
    },
    {
      "text": "William W. Gaver. 1992. The affordances of media spaces for collaboration. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work - CSCW '92, 17--24.  ",
      "doi": "10.1145/143457.371596"
    },
    {
      "text": "Charles Goodwin. 1994. Professional Vision. American Anthropologist 96, 3: 606--633.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 2003. Pointing as Situated Practice. In Pointing: Where Language, Culture and Cognition Meet, Sotaro Kita (ed.). Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Christian Heath and Paul Luff. 1991. Disembodied conduct: Interactional Asymmetries in Video-Mediated Communication. In Proceedings of the SIGCHI conference on Human factors in computing systems Reaching through technology - CHI '91, 99--103.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "Keita Higuch, Ryo Yonetani, and Yoichi Sato. 2016. Can Eye Help You?: Effects of Visualizing Eye Fixations on Remote Collaboration Scenarios for Physical Tasks. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16: 5180--5190.  ",
      "doi": "10.1145/2858036.2858438"
    },
    {
      "text": "Keita Higuch, Ryo Yonetani, and Yoichi Sato. 2016. Can Eye Help You?: Effects of Visualizing Eye Fixations on Remote Collaboration Scenarios for Physical Tasks. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16: 5180--5190.  ",
      "doi": "10.1145/2858036.2858438"
    },
    {
      "text": "2Tomoko Imai, Dairoku Sekiguchi, Masahiko Inami, Naoki Kawakami, and Susumu Tachi. 2006. Measuring Gaze Direction Perception Capability of Humans to Design Human Centered Communication Systems. Presence: Teleoperators and Virtual Environments 15, 2: 123--138.  ",
      "doi": "10.1162/pres.2006.15.2.123"
    },
    {
      "text": "2Kori Inkpen, Brett Taylor, Sasa Junuzovic, John C Tang, and Gina Venolia. 2013. Experiences2Go: Sharing Kids' Activities Outside the Home with Remote Family Members. Proceedings of the 2013 conference on Computer supported cooperative work - CSCW '13: 1329--1340.  ",
      "doi": "10.1145/2441776.2441926"
    },
    {
      "text": "H Ishii, M Kobayashi, and J Grudin. 1995. Integration of interpersonal space and shared workspace: ClearBoard design and experiments. Groupware for Realtime Drawing: A Designer's Guide 11, November: 33--42.  ",
      "doi": "10.1145/159764.159762"
    },
    {
      "text": "Steven Johnson, Madeleine Gibson, and Bilge Mutlu. 2015. Handheld or Handsfree? Remote Collaboration via Lightweight Head-Mounted Displays and Handheld Devices. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15, 1825--1836.  ",
      "doi": "10.1145/2675133.2675176"
    },
    {
      "text": "Brennan Jones, Anna Witcraft, Scott Bateman, Carman Neustaedter, and Anthony Tang. 2015. Mechanics of Camera Work in Mobile Video Collaboration. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15: 957--966.  ",
      "doi": "10.1145/2702123.2702345"
    },
    {
      "text": "Adam Kendon. 1967. Some functions of gaze-direction in social interaction. Acta Psychologica 26: 22--63.",
      "doi": ""
    },
    {
      "text": "Kibum Kim, John Bolton, Audrey Girouard, Jeremy Cooperstock, and Roel Vertegaal. 2012. TeleHuman: Effects of 3d perspective on gaze and pose estimation with a life-size cylindrical telepresence pod. In CHI '12: Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, 2531--2540.  ",
      "doi": "10.1145/2207676.2208640"
    },
    {
      "text": "David Kirk, Andy Crabtree, and Tom Rodden. 2005. Ways of the Hands. In ECSCW 2005, Hans Gellersen, Kjeld Schmidt, Michel Beaudouin-Lafon and Wendy Mackay (eds.). Springer-Verlag, Berlin/Heidelberg, 1--21. ",
      "doi": "10.5555/1242029.1242030"
    },
    {
      "text": "Robert E. Kraut, Mark D. Miller, and Jane Siegel. 1996. Collaboration in performance of physical tasks. In Proceedings of the 1996 ACM conference on Computer supported cooperative work - CSCW '96, 57--66.  ",
      "doi": "10.1145/240080.240190"
    },
    {
      "text": "Robert E Kraut, Susan R Fussell, and Jane Siegel. 2003. Visual information as a conversational resource in collaborative physical tasks. Human-Computer Interaction 18, 1: 13--49.  ",
      "doi": "10.1207/S15327051HCI1812_2"
    },
    {
      "text": "3Hideaki Kuzuoka. 1992. Spatial workspace collaboration: a SharedView video support system for remote collaboration capability. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '92, 533--540.  ",
      "doi": "10.1145/142750.142980"
    },
    {
      "text": "3Hideaki Kuzuoka, Toshio Kosuge, and Masatomo Tanaka. 1994. GestureCam: A Video Communication System for Sympathetic Remote Collaboration. In Proceedings of the 1994 ACM conference on Computer supported cooperative work - CSCW '94, 35--43.  ",
      "doi": "10.1145/192844.192866"
    },
    {
      "text": "3Paul Luff, Christian Heath, Hideaki Kuzuoka, Keiichi Yamazaki, and Jun Yamashita. 2006. Handling documents and discriminating objects in hybrid spaces. In Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI '06, 561.  ",
      "doi": "10.1145/1124772.1124858"
    },
    {
      "text": "Kana Misawa, Yoshio Ishiguro, and Jun Rekimoto. 2012. LiveMask: a telepresence surrogate system with a face-shaped screen for supporting nonverbal communication. In Proceedings of the International Working Conference on Advanced Visual Interfaces - AVI '12, 394.  ",
      "doi": "10.1145/2254556.2254632"
    },
    {
      "text": "P.J. Moore, C. and Dunham. 1997. Joint Attention: Its Origins and Role in Development.",
      "doi": ""
    },
    {
      "text": "Mai Otsuki, Taiki Kawano, Keita Maruyama, Hideaki Kuzuoka, and Yusuke Suzuki. 2017. ThirdEye: Simple Add-on Display to Represent Remote Participant's Gaze Direction in Video Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 5307--5312.  ",
      "doi": "10.1145/3025453.3025681"
    },
    {
      "text": "3Mai Otsuki, Taiki Kawano, Keita Maruyama, Hideaki Kuzuoka, and Yusuke Suzuki. 2017. ThirdEye: Simple Add-on Display to Represent Remote Participant's Gaze Direction in Video Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 5307--5312.  ",
      "doi": "10.1145/3025453.3025681"
    },
    {
      "text": "3Ye Pan and Anthony Steed. 2014. A gaze-preserving situated multiview telepresence system. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, 2173--2176.  ",
      "doi": "10.1145/2556288.2557320"
    },
    {
      "text": "3Vincent van Rheden, Bernhard Maurer, Dorothé Smit, Martin Murer, and Manfred Tscheligi. 2017. LaserViz: Shared Gaze in the Co-Located Physical World. In Proceedings of the Tenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '17, 191--196.  ",
      "doi": "10.1145/3024969.3025010"
    },
    {
      "text": "N. Sakata, T. Kurata, T. Kato, M. Kourogi, and H. Kuzuoka. 2003. WACL: supporting telecommunications using - wearable active camera with laser pointer. In Seventh IEEE International Symposium on Wearable Computers, 2003. Proceedings., 53--56. ",
      "doi": "10.5555/946249.946870"
    },
    {
      "text": "4Maria Staudte and Matthew W Crocker. 2009. Visual attention in spoken human-robot interaction. Proceedings of the 4th ACM/IEEE International Conference on Human-Robot Interaction (HRI 09): 77--84.  ",
      "doi": "10.1145/1514095.1514111"
    },
    {
      "text": "4John C Tang and Larry J Leifer. 1988. A framework for understanding the workspace activity of design teams. In Proceedings of the 1988 ACM conference on Computer-supported cooperative work - CSCW '88, 244--249.  ",
      "doi": "10.1145/62266.62285"
    },
    {
      "text": "4Roel Vertegaal, Boris Velichkovsky, and Gerrit van der Veer. 1997. Catching the eye. ACM SIGCHI Bulletin 29, 4: 87--92.  ",
      "doi": "10.1145/270950.270998"
    }
  ]
}