{
  "doi": "10.1145/3173574.3173702",
  "title": "Breaking the Tracking: Enabling Weight Perception using Perceivable Tracking Offsets",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Virtual reality (VR) technology strives to enable a highly immersive experience for the user by including a wide variety of modalities (e.g. visuals, haptics). Current VR hardware however lacks a sufficient way of communicating the perception of weight of an object, resulting in scenarios where users can not distinguish between lifting a bowling ball or a feather. We propose a solely software based approach of simulating weight in VR by deliberately using perceivable tracking offsets. These tracking offsets nudge users to lift their arm higher and result in a visual and haptic perception of weight. We conducted two user studies showing that participants intuitively associated them with the sensation of weight and accept them as part of the virtual world. We further show that compared to no weight simulation, our approach led to significantly higher levels of presence, immersion and enjoyment. Finally, we report perceptional thresholds and offset boundaries as design guidelines for practitioners.",
  "tags": [
    "weight perception",
    "virtual reality",
    "pseudo haptics"
  ],
  "authors": [
    {
      "name": "Michael Rietzler",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458666657",
      "orcid": "0000-0003-2599-8308"
    },
    {
      "name": "Florian Geiselhart",
      "institution": "Ulm University, Ulm, Baden-Wuerttemberg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659040195",
      "orcid": "missing"
    },
    {
      "name": "Jan Gugenheimer",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458801557",
      "orcid": "0000-0002-6466-3845"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Merwan Achibet, Adrien Girard, Maud Marchal, and Anatole Lécuyer. 2016. Leveraging passive haptic feedback in virtual environments with the elastic-arm approach. Presence: Teleoperators and Virtual Environments 25, 1 (2016), 17--32.  ",
      "doi": "10.1162/PRES_a_00243"
    },
    {
      "text": "M. Achibet, A. Girard, A. Talvas, M. Marchal, and A. LÃl'cuyer. 2015. Elastic-Arm: Human-scale passive haptic feedback for augmenting interaction and perception in virtual environments. In 2015 IEEE Virtual Reality (VR). 63--68.",
      "doi": ""
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1968--1979.  ",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Yuki Ban, Takashi Kajinami, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Modifying an identified curved surface shape using pseudo-haptic effect. In Haptics Symposium (HAPTICS), 2012 IEEE. IEEE, 211--216.  ",
      "doi": "10.1007/978-3-642-31401-8_3"
    },
    {
      "text": "Frank Biocca, Jin Kim, and Yung Choi. 2001. Visual touch in virtual environments: An exploratory study of presence, multimodal interfaces, and cross-modal sensory illusions. Presence: teleoperators and virtual environments 10, 3 (2001), 247--265.  ",
      "doi": "10.1162/105474601300343595"
    },
    {
      "text": "H. Q. Dinh, N. Walker, L. F. Hodges, Chang Song, and A. Kobayashi. 1999. Evaluating the importance of multi-sensory input on memory and the sense of presence in virtual environments. In Proceedings IEEE Virtual Reality (Cat. No. 99CB36316). 222--228. ",
      "doi": "10.5555/554230.835733"
    },
    {
      "text": "L. Dominjon, A. Lecuyer, J. M. Burkhardt, P. Richard, and S. Richir. 2005. Influence of control/display ratio on the perception of mass of manipulated objects in virtual environments. In IEEE Proceedings. VR 2005. Virtual Reality, 2005. 19--25.  ",
      "doi": "10.1109/VR.2005.49"
    },
    {
      "text": "Marc O Ernst and Martin S Banks. 2002. Humans integrate visual and haptic information in a statistically optimal fashion. Nature 415, 6870 (2002), 429--433.",
      "doi": ""
    },
    {
      "text": "Marc O. Ernst and Heinrich H. BÃijlthoff. 2004. Merging the senses into a robust percept. Trends in Cognitive Sciences 8, 4 (2004), 162 -- 169.",
      "doi": ""
    },
    {
      "text": "Julia Fröhlich and Ipke Wachsmuth. 2013. The Visual, the Auditory and the Haptic -- A User Study on Combining Modalities in Virtual Worlds. In Virtual Augmented and Mixed Reality. Designing and Developing Augmented and Virtual Environments: 5th International Conference, VAMR 2013, Held as Part of HCI International 2013, Las Vegas, NV, USA, July 21--26, 2013, Proceedings, Part I, Randall Shumaker (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 159--168.",
      "doi": ""
    },
    {
      "text": "D. A. G. Jauregui, F. Argelaguet, A. H. Olivier, M. Marchal, F. Multon, and A. Lecuyer. 2014. Towards Pseudo-Haptic Avatars: Modifying the Visual Animation of Self-Avatar Can Simulate the Perception of Weight Lifting. IEEE Transactions on Visualization and Computer Graphics 20, 4 (April 2014), 654--661.  ",
      "doi": "10.1109/TVCG.2014.45"
    },
    {
      "text": "L. Kohli, M. C. Whitton, and F. P. Brooks. 2012. Redirected touching: The effect of warping space on task performance. In 2012 IEEE Symposium on 3D User Interfaces (3DUI). 105--112.",
      "doi": ""
    },
    {
      "text": "Anatole Lécuyer. 2009. Simulating haptic feedback using vision: A survey of research and applications of pseudo-haptic feedback. Presence: Teleoperators and Virtual Environments 18, 1 (2009), 39--53.  ",
      "doi": "10.1162/pres.18.1.39"
    },
    {
      "text": "A. Lecuyer, J. M. Burkhardt, S. Coquillart, and P. Coiffet. 2001. \"Boundary of illusion\": an experiment of sensory integration with a pseudo-haptic system. In Proceedings IEEE Virtual Reality 2001. 115--122. ",
      "doi": "10.5555/580521.835816"
    },
    {
      "text": "Anatole Lécuyer, Jean-Marie Burkhardt, and Laurent Etienne. 2004. Feeling Bumps and Holes Without a Haptic Interface: The Perception of Pseudo-haptic Textures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 239--246.  ",
      "doi": "10.1145/985692.985723"
    },
    {
      "text": "Anatole Lécuyer, Jean-Marie Burkhardt, and Chee-Hian Tan. 2008. A Study of the Modification of the Speed and Size of the Cursor for Simulating Pseudo-haptic Bumps and Holes. ACM Trans. Appl. Percept. 5, 3, Article 14 (Sept. 2008), 21 pages.  ",
      "doi": "10.1145/1402236.1402238"
    },
    {
      "text": "A. Lecuyer, S. Coquillart, A. Kheddar, P. Richard, and P. Coiffet. 2000. Pseudo-haptic feedback: can isometric input devices simulate force feedback?. In Proceedings IEEE Virtual Reality 2000 (Cat. No.00CB37048). 83--90. ",
      "doi": "10.5555/832288.835776"
    },
    {
      "text": "Anatole Lécuyer, Sabine Cuquillart, and Philippe Coiffet. 2001. Simulating haptic information with haptic illusions in virtual environments. Technical Report. DTIC Document.",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 1987. Hand movements: A window into haptic object recognition. Cognitive Psychology 19, 3 (1987), 342 -- 368.",
      "doi": "10.1016/0010-0285%2887%2990008-"
    },
    {
      "text": "J. J. W. Lin, H. B. L. Duh, D. E. Parker, H. Abi-Rached, and T. A. Furness. 2002. Effects of field of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. In Proceedings IEEE Virtual Reality 2002. 164--171. ",
      "doi": "10.5555/580130.835889"
    },
    {
      "text": "Ryuma Niiyama, Lining Yao, and Hiroshi Ishii. 2013. Weight and Volume Changing Device with Liquid Metal Transfer. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 49--52.  ",
      "doi": "10.1145/2540930.2540953"
    },
    {
      "text": "A. Pusch, O. Martin, and S. Coquillart. 2008. HEMP-Hand-Displacement-Based Pseudo-Haptics: A Study of a Force Field Application. In 2008 IEEE Symposium on 3D User Interfaces. 59--66.  ",
      "doi": "10.1109/3DUI.2008.4476593"
    },
    {
      "text": "Andreas Pusch, Olivier Martin, and Sabine Coquillart. 2009. HEMP -- Hand-displacement-based pseudo-haptics: A study of a force field application and a behavioural analysis. International Journal of Human-Computer Studies 67, 3 (2009), 256 -- 268. Current trends in 3D user interface research.  ",
      "doi": "10.1016/j.ijhcs.2008.09.015"
    },
    {
      "text": "Michael Rietzler, Florian Geiselhart, Julian Frommel, and Enrico Rukzio. 2018. Conveying the Perception of Kinesthetic Feedback in Virtual Reality using State-of-the-Art Hardware. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3173574.3174034"
    },
    {
      "text": "Michael Rietzler, Florian Geiselhart, and Enrico Rukzio. 2017. The Matrix Has You: Realizing Slow Motion in Full-body Virtual Reality. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (VRST '17). ACM, New York, NY, USA, Article 2, 10 pages.  ",
      "doi": "10.1145/3139131.3139145"
    },
    {
      "text": "Irvin Rock and Jack Victor. 1964. Vision and Touch: An Experimentally Created Conflict between the Two Senses. Science 143, 3606 (1964), 594--596.",
      "doi": ""
    },
    {
      "text": "Mandayam A Srinivasan, Gerald Lee Beauregard, and David L Brock. 1996. The impact of visual information on the haptic perception of stiffness in virtual environments. In ASME Winter Annual Meeting, Vol. 58. 555--559.",
      "doi": ""
    },
    {
      "text": "Barry E Stein and M Alex Meredith. 1993. The merging of the senses. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Bob G. Witmer and Michael J. Singer. 1998. Measuring Presence in Virtual Environments: A Presence Questionnaire. Presence: Teleoperators and Virtual Environments 7, 3 (1998), 225--240.  ",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "T. Yamamoto and K. Hirota. 2015. Recognition of weight through shaking interaction. In 2015 IEEE World Haptics Conference (WHC). 451--456.",
      "doi": ""
    },
    {
      "text": "A. Zenner and A. Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (April 2017), 1285--1294.  ",
      "doi": "10.1109/TVCG.2017.2656978"
    }
  ]
}