{
  "doi": "10.1145/3173574.3173691",
  "title": "Pulp Nonfiction: Low-Cost Touch Tracking for Paper",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Paper continues to be a versatile and indispensable material in the 21st century. Of course, paper is a passive medium with no inherent interactivity, precluding us from computationally-enhancing a wide variety of paper-based activities. In this work, we present a new technical approach for bringing the digital and paper worlds closer together, by enabling paper to track finger input and also drawn input with writing implements. Importantly, for paper to still be considered paper, our method had to be very low cost. This necessitated research into materials, fabrication methods and sensing techniques. We describe the outcome of our investigations and show that our method can be sufficiently low-cost and accurate to enable new interactive opportunities with this pervasive and venerable material.",
  "tags": [
    "input",
    "multi-touch",
    "interaction techniques",
    "touch tracking",
    "electric field tomography",
    "paper",
    "pen tracking"
  ],
  "authors": [
    {
      "name": "Yang Zhang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81548025596/rel-imgonly/yang.jpg",
      "acmid": "81548025596",
      "orcid": "0000-0003-2472-6968"
    },
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "Andy Adler, and Robert Guardo. Electrical impedance tomography: regularized imaging and contrast detection. IEEE transactions on medical imaging, 15(2), 1996, 170--179.",
      "doi": ""
    },
    {
      "text": "AgIC Inc. Product Information. Retrieved September 16, 2017 from https://shop.agic.cc",
      "doi": ""
    },
    {
      "text": "Anoto Inc. Livescribe smartpen. Retrieved September 16, 2017 from http://www.anoto.com",
      "doi": ""
    },
    {
      "text": "Maribeth Back, Jonathan Cohen, Rich Gold, Steve Harrison, and Scott Minneman. 2001. Listen reader: an electronically augmented paper-based book. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 23--29.  ",
      "doi": "10.1145/365024.365031"
    },
    {
      "text": "Nicholas A. Basbanes. On Paper: The Everything of Its Two-Thousand-Year History Paperback. July 1, 2014",
      "doi": ""
    },
    {
      "text": "Basic Project MIDI Piano. Video. Retrieved September 16, 2017 from https://youtu.be/qtDZ3fYyUN0?t=21",
      "doi": ""
    },
    {
      "text": "Olivier Bau, Ivan Poupyrev, Mathieu Le Goc, Laureline Galliot, and Matthew Glisson. 2012. REVEL: tactile feedback technology for augmented reality. In ACM SIGGRAPH 2012 Emerging Technologies (SIGGRAPH '12). ACM, New York, NY, USA, Article 17, 1 pages.  ",
      "doi": "10.1145/2343456.2343473"
    },
    {
      "text": "Bloomberg. \"The Office of the Future.\" Business Week (2387): 48--70, 30 June 1975",
      "doi": ""
    },
    {
      "text": "Leah Blunt. 2016. Recycling Mystery: Milk and Juice Cartons. Retrieved September 16, 2017 from http://earth911.com/news/recycling-mystery-milk-andjuice- cartons/",
      "doi": ""
    },
    {
      "text": "Circuit Scribe Inc. Product Information. Retrieved September 16, 2017 from https://kickstarter.com/projects/ electroninks/circuit-scribe-draw-circuits-instantly",
      "doi": ""
    },
    {
      "text": "Gabe Cohn, Sidhant Gupta, Tien-Jui Lee, Dan Morris, Joshua R. Smith, Matthew S. Reynolds, Desney S. Tan, and Shwetak N. Patel. 2012. An ultra-low-power human body motion sensor using static electric field sensing. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12), 99--102.  ",
      "doi": "10.1145/2370216.2370233"
    },
    {
      "text": "Desco Industries Inc. SCS. Retrieved September 16, 2017 from http://staticcontrol.descoindustries.com",
      "doi": ""
    },
    {
      "text": "Erconinc Inc. Product Information. Retrieved September 16, 2017 from http://www.erconinc.com/products.html",
      "doi": ""
    },
    {
      "text": "Berna Erol, Emilio Antúnez, and Jonathan J. Hull. 2008. HOTPAPER: multimedia interaction with paper using mobile phones. In Proceedings of the 16th ACM international conference on Multimedia (MM '08), 399--408.  ",
      "doi": "10.1145/1459359.1459413"
    },
    {
      "text": "Blair Evans. 1989. \"Method of and apparatus for sensing the location, such as coordinates, of designated points on an electrically sensitive touch-screen surface.\" U.S. Patent 4,806,709, issued February 21, 1989.",
      "doi": ""
    },
    {
      "text": "David M. Frohlich, Philip Ely, Helen Moore, Connie Golsteijn, Paul Egglestone, John Mills, Jon Rogers, Tom Metcalf, Kate Stone, and Maria Menicou. Designing interactive newsprint. International Journal of Human- Computer Studies, 104 (2017), 36--49.  ",
      "doi": "10.1016/j.ijhcs.2017.03.002"
    },
    {
      "text": "David T. Gallant, Andrew G. Seniuk, and Roel Vertegaal. 2008. Towards more paper-like input: flexible input devices for foldable interaction styles. In Proceedings of the 21st annual ACM symposium on User inter-face software and technology (UIST '08), 283--286.  ",
      "doi": "10.1145/1449715.1449762"
    },
    {
      "text": "Audrey Girouard, Aneesh Tarun, and Roel Vertegaal. 2012. DisplayStacks: interaction techniques for stacks of flexible thin-film displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2431--2440.  ",
      "doi": "10.1145/2207676.2208406"
    },
    {
      "text": "Mathieu Le Goc, Stuart Taylor, Shahram Izadi, and Cem Keskin. 2014. A low-cost transparent electric field sensor for 3d interaction on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3167--3170.  ",
      "doi": "10.1145/2556288.2557331"
    },
    {
      "text": "Nan-Wei Gong, Jürgen Steimle, Simon Olberding, Steve Hodges, Nicholas Edward Gillian, Yoshihiro Kawahara, and Joseph A. Paradiso. 2014. PrintSense: a versatile sensing technique to support multimodal flexible surface interaction. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1407- 1410.  ",
      "doi": "10.1145/2556288.2557173"
    },
    {
      "text": "François Guimbretière. 2003. Paper augmented digital documents. In Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST '03). ACM, New York, NY, USA, 51--60.  ",
      "doi": "10.1145/964696.964702"
    },
    {
      "text": "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H. Witten. 2009. The WEKA data mining software: an update. SIGKDD Explor. Newsl. 11, 1. 10--18.  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Florian Heller, Stefan Ivanov, Chat Wacharamanotham, and Jan Borchers. 2014. FabriTouch: exploring flexible touch input on textiles. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14). ACM, New York, NY, USA, 59--62.  ",
      "doi": "10.1145/2634317.2634345"
    },
    {
      "text": "David S. Holder. 2015. Electrical Impedance Tomography, Methods, History and Applications. Institute of Physics Publishing. CRC Press: 456.",
      "doi": ""
    },
    {
      "text": "David Holman, Roel Vertegaal, Mark Altosaar, Nikolaus Troje, and Derek Johns. 2005. Paper windows: interaction techniques for digital paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 591--599.  ",
      "doi": "10.1145/1054972.1055054"
    },
    {
      "text": "Scott E. Hudson and Jennifer Mankoff. 2006. Rapid construction of functioning physical interfaces from cardboard, thumbtacks, tin foil and masking tape. In Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06), 289- 298.  ",
      "doi": "10.1145/1166253.1166299"
    },
    {
      "text": "Mustafa Emre Karagozler, Ivan Poupyrev, Gary K. Fedder, and Yuri Suzuki. 2013. Paper generators: harvesting energy from touching, rubbing and sliding. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13), 23--30.  ",
      "doi": "10.1145/2501988.2502054"
    },
    {
      "text": "Çağdaş Karataş and Marco Gruteser. 2015. Printing multi-key touch interfaces. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 169--179.  ",
      "doi": "10.1145/2750858.2804285"
    },
    {
      "text": "Philip T. Krein and R. David Meadows. 1990. The electroquasistatics of the capacitive touch panel. IEEE Transactions on Industry Applications Volume: 26, Issue: 3, 529 -- 534.",
      "doi": ""
    },
    {
      "text": "Mark Kurlansky. 2016. Paper: Paging Through History 1st Edition. W. W. Norton & Company.",
      "doi": ""
    },
    {
      "text": "Johnny C. Lee, Scott E. Hudson, and Edward Tse. 2008. Foldable interactive displays. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08), 287--290.  ",
      "doi": "10.1145/1449715.1449763"
    },
    {
      "text": "Hanchuan Li, Eric Brockmeyer, Elizabeth J. Carter, Josh Fromm, Scott E. Hudson, Shwetak N. Patel, and Alanson Sample. 2016. PaperID: A Technique for Drawing Functional Battery-Free Wireless Interfaces on Paper. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5885--5896.  ",
      "doi": "10.1145/2858036.2858249"
    },
    {
      "text": "Rong-Hao Liang, Chao Shen, Yu-Chien Chan, Guan- Ting Chou, Liwei Chan, De-Nian Yang, Mike Y. Chen, and Bing-Yu Chen. 2015. WonderLens: Optical Lenses and Mirrors for Tangible Interactions on Printed Paper. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1281- 1284.  ",
      "doi": "10.1145/2702123.2702434"
    },
    {
      "text": "Chunyuan Liao, Qiong Liu, Bee Liew, and Lynn Wilcox. 2010. Pacer: fine-grained interactive paper via camera-touch hybrid gestures on a cell phone. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 2441--2450.  ",
      "doi": "10.1145/1753326.1753696"
    },
    {
      "text": "Chunyuan Liao. 2009. Papiercraft: a paper-based interface to support interaction with digital documents. Ph.D. Dissertation. University of Maryland, College Park ",
      "doi": "10.5555/1714058"
    },
    {
      "text": "Paul Luff, Christian Heath, Moira Norrie, Beat Signer, and Peter Herdman. 2004. Only touching the surface: creating affinities between digital content and paper. In Proceedings of the 2004 ACM conference on Computer supported cooperative work (CSCW '04), 523--532.  ",
      "doi": "10.1145/1031607.1031695"
    },
    {
      "text": "Kyle McDonald. 2011. ofxCv. https://github.com/kylemcdonald/ofxCv",
      "doi": ""
    },
    {
      "text": "Mouser Inc. Product information. Retrieved January 6, 2018 from http://www.mouser.com/ProductDetail/MGChemicals/ 838AR- 378L/?qs=sGAEpiMZZMvJqaFk9BIiv8iSYHHTmfHTy RacH%252bMTMWQ%3d",
      "doi": ""
    },
    {
      "text": "Adiyan Mujibiya and Jun Rekimoto. 2013. Mirage: exploring interaction modalities using off-body static electric field sensing. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 211- 220.  ",
      "doi": "10.1145/2501988.2502031"
    },
    {
      "text": "Suranga Nanayakkara, Roy Shilkrot, Kian Peen Yeo, and Pattie Maes. 2013. EyeRing: a finger-worn input device for seamless interactions with our surroundings. In Proceedings of the 4th Augmented Human International Conference (AH '13), 13--20.  ",
      "doi": "10.1145/2459236.2459240"
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: fabricating highly customizable thinfilm touch-displays. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 281- 290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Paper Piano - DIY Arduino Project. Video. Retrieved September 16, 2017 from https://www.youtube.com/watch?v=K8zZ3tVi8q8",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Kathrin Probst, Teo Babic, Christian Rendl, Anita Vogl, Alex Olwal, and Michael Haller. 2016. FlexTiles: A Flexible, Stretchable, Formable, Pressure-Sensitive, Tactile Input Sensor. In Proc. of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 3754- 3757.  ",
      "doi": "10.1145/2851581.2890253"
    },
    {
      "text": "Pemro Inc. Product Information. Retrieved September 16, 2017, from: http://www.pemro.com/product Details.cfm?itemCode=MMM-1174",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proc. of the ACM Conference on Human Factors in Computing Systems (CHI '16), 4216- 4227.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Pöyry Inc. 2014. Paper market insights through 2030. Retrieved September 16, 2017, from http://poyry.com/ sites/default/files/worldpapermarkets_up_to_2030_broc hure_and_orderform_2014_web.pdf",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew Reynolds, and Joshua R. Smith. 2017. Finding Common Ground: A Survey of Capacitive Sensing in Human-Computer Interaction. In Proceedings of the 35th Annual ACM Conference on Human Factors in Computing Systems (CHI '17), 3293--3315.  ",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: An Integrated Approach to Fabricating Interactive Paper. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 267--270.  ",
      "doi": "10.1145/2702613.2725430"
    },
    {
      "text": "Jun Rekimoto and Yuji Ayatsuka. 2000. CyberCode: designing augmented reality environments with visual tags. In Proceedings of DARE 2000 on Designing augmented reality environments (DARE '00). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/354666.354667"
    },
    {
      "text": "Jun Rekimoto. 2001. Gesturewrist and gesturepad: Unobtrusive wearable interaction devices. In Proceedings. Fifth International Symposium on Wearable Computers (ISWC '01), IEEE, 21--27. ",
      "doi": "10.5555/580581.856565"
    },
    {
      "text": "Christian Rendl, Patrick Greindl, Michael Haller, Martin Zirkl, Barbara Stadlober, and Paul Hartmann. 2012. PyzoFlex: printed piezoelectric pressure sensing foil. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA, 509--518.  ",
      "doi": "10.1145/2380116.2380180"
    },
    {
      "text": "Ilya Rosenberg and Ken Perlin. 2009. The Un- MousePad: an interpolating multi-touch force-sensing input pad. ACM Trans. Graph. 28, 3, Article 65 (July), 9 pages.  ",
      "doi": "10.1145/1531326.1531371"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Joachim Schöberl. NETGEN An advancing front 2D/3D-mesh generator based on abstract rules. Computing and visualization in science 1, no. 1 (1997): 41--52.",
      "doi": ""
    },
    {
      "text": "Abigail J. Sellen and Richard H.R. Harper. 2003. The Myth of the Paperless Office. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Roy Shilkrot, Jochen Huber, Wong Meng Ee, Pattie Maes, and Suranga Chandima Nanayakkara. 2015. FingerReader: A Wearable Device to Explore Printed Text on the Go. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2363--2372.  ",
      "doi": "10.1145/2702123.2702421"
    },
    {
      "text": "Joshua R. Smith. 1999. Electric field imaging. Ph.D. Dissertation. Massachusetts Institute of Technology, Cambridge, MA. ",
      "doi": "10.5555/929818"
    },
    {
      "text": "Joshua R. Smith. 1995. Toward Electric Field Tomography. M.S. Thesis. Massachusetts Institute of Technology, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Jürgen Steimle, Andreas Jordt, and Pattie Maes. 2013. Flexpad: highly flexible bending interactions for projected handheld displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 237--246.  ",
      "doi": "10.1145/2470654.2470688"
    },
    {
      "text": "Lisa Stifelman, Barry Arons, and Chris Schmandt. 2001. The audio notebook: paper and pen interaction with structured speech. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 182--189.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Sulzer Technical Review. 2006. Retrieved September 16, 2017 from https://www.sulzer.com/en/- /media/Documents/Cross_Division/STR/2006/STR_200 6_4_complete_e_web.pdf",
      "doi": ""
    },
    {
      "text": "US. Environmental Protection Agency. 2016. Retrieved September 16, 2017 from https://archive.epa.gov/wastes/ conserve/materials/paper/web/html/faqs.html",
      "doi": ""
    },
    {
      "text": "Marko Vauhkonen, William RB Lionheart, Lasse M. Heikkinen, Päivi J. Vauhkonen, and Jari P. Kaipio. \"A MATLAB package for the EIDORS project to reconstruct two-dimensional EIT images.\" Physiological Measurement 22, no. 1 (2001): 107.",
      "doi": ""
    },
    {
      "text": "Wacom Bamboo Slate Smartpad. Retrieved January 6, 2018 from http://www.wacom.com/enus/ products/smartpads/bamboo-slate#Overview",
      "doi": ""
    },
    {
      "text": "Nadir Weibel, Adriana Ispas, Beat Signer, and Moira C. Norrie. 2008. Paperproof: a paper-digital proof-editing system. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08), 2349--2354.  ",
      "doi": "10.1145/1358628.1358682"
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21st century. SIGMOBILE Mob. Comput. Commun. Rev.3, 3 (July 1999), 3--11.  ",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Pierre Wellner. 1993. Interacting with paper on the DigitalDesk. Commun. ACM 36, 7 (July 1993), 87--96.  ",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "Raphael Wimmer and Patrick Baudisch. 2011. Modular and deformable touch-sensitive surfaces based on time domain reflectometry. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 517- 526.  ",
      "doi": "10.1145/2047196.2047264"
    },
    {
      "text": "Xing-Dong Yang, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2012. Magic finger: alwaysavailable input through finger instrumentation. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), 147- 156.  ",
      "doi": "10.1145/2380116.2380137"
    },
    {
      "text": "Ron Yeh, Chunyuan Liao, Scott Klemmer, François Guimbretière, Brian Lee, Boyko Kakaradov, Jeannie Stamberger, and Andreas Paepcke. 2006. ButterflyNet: a mobile capture and access system for field biology research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 571- 580.  ",
      "doi": "10.1145/1124772.1124859"
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2015. Tomo: Wearable, Low-Cost Electrical Impedance Tomography for Hand Gesture Recognition. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 167- 173.  ",
      "doi": "10.1145/2807442.2807480"
    },
    {
      "text": "Yang Zhang, Gierad Laput, and Chris Harrison. 2017. Electrick: Low-Cost Touch Sensing Using Electric Field Tomography. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1--14.  ",
      "doi": "10.1145/3025453.3025842"
    },
    {
      "text": "Yang Zhang, Robert Xiao, and Chris Harrison. 2016. Advancing Hand Gesture Recognition with High Resolution Electrical Impedance Tomography. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16), 843--850.  ",
      "doi": "10.1145/2984511.2984574"
    }
  ]
}