{
  "doi": "10.1145/3173574.3173961",
  "title": "ConceptScape: Collaborative Concept Mapping for Video Learning",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "While video has become a widely adopted medium for online learning, existing video players provide limited support for navigation and learning. It is difficult to locate parts of the video that are linked to specific concepts. Also, most video players afford passive watching, thus making it difficult for learners with limited metacognitive skills to deeply engage with the content and reflect on their understanding. To support concept-driven navigation and comprehension of lecture videos, we present ConceptScape, a system that generates and presents a concept map for lecture videos. ConceptScape engages crowd workers to collaboratively generate a concept map by prompting them to externalize reflections on the video. We present two studies to show that (1) interactive concept maps can be useful tools for concept-based video navigation and comprehension, and (2) with ConceptScape, novice crowd workers can collaboratively generate complex concept maps that match the quality of those by experts.",
  "authors": [
    {
      "name": "Ching Liu",
      "institution": "National Tsing Hua University, Hsinchu City, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659180651",
      "orcid": "missing"
    },
    {
      "name": "Juho Kim",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    },
    {
      "name": "Hao-Chuan Wang",
      "institution": "National Tsing Hua University & University of California, Davis, HsinChu, Taiwan Roc",
      "img": "/do/10.1145/contrib-81553656356/rel-imgonly/14188307_10154380982350185_145248478587239185_o.jpg",
      "acmid": "81553656356",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "MeaningCloud: Text Analyze API. https://www.meaningcloud.com/developer/apis. (Accessed Aug. 2017).",
      "doi": ""
    },
    {
      "text": "Mohamed Ally. 2004. Foundations of educational theory for online learning. Theory and practice of online learning 2 (2004), 15--44.",
      "doi": ""
    },
    {
      "text": "Michael S Bernstein, Greg Little, Robert C Miller, Bj¨ orn Hartmann, Mark S Ackerman, David R Karger, David Crowell, and Katrina Panovich. 2015. Soylent: a word processor with a crowd inside. Commun. ACM 58, 8 (2015), 85--94.  ",
      "doi": "10.1145/2791285"
    },
    {
      "text": "K.E. Chang, Y.T. Sung, and S.F. Chen. 2001. Learning through computer-based concept mapping with scaffolding aid. Journal of Computer Assisted Learning 17, 1 (2001), 21--33.",
      "doi": ""
    },
    {
      "text": "Konstantinos Chorianopoulos and Michail N Giannakos. 2013. Usability design for video lectures. In Proceedings of the 11th european conference on Interactive TV and video. ACM, 163--164.  ",
      "doi": "10.1145/2465958.2465982"
    },
    {
      "text": "D Randy Garrison and Martha Cleveland-Innes. 2005. Facilitating cognitive presence in online learning: Interaction is not enough. The American journal of distance education 19, 3 (2005), 133--148.",
      "doi": ""
    },
    {
      "text": "Michail N. Giannakos, Konstantinos Chorianopoulos, Marco Ronchetti, Peter Szegedi, and Stephanie D. Teasley. 2013. Analytics on Video-based Learning. In Proceedings of the Third International Conference on Learning Analytics and Knowledge (LAK '13). ACM, New York, NY, USA, 283--284.  ",
      "doi": "10.1145/2460296.2460358"
    },
    {
      "text": "Elena L. Glassman, Aaron Lin, Carrie J. Cai, and Robert C. Miller. 2016. Learnersourcing Personalized Hints. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1626--1636.  ",
      "doi": "10.1145/2818048.2820011"
    },
    {
      "text": "Katsuhiro Ikeda, Kozo Sugiyama, Isamu Watanabe, and Kazuo Misue. 2006. Generation of Relevance Maps and Navigation in a Digital Book. In Proceedings of the 2006 Asia-Pacific Symposium on Information Visualisation Volume 60 (APVis '06). Australian Computer Society, Inc., Darlinghurst, Australia, Australia, 49--58. http: //dl.acm.org/citation.cfm?id=1151903.1151911 ",
      "doi": "10.5555/1151903.1151911"
    },
    {
      "text": "Heather Kanuka and Terry Anderson. 2007. Online social interchange, discord, and knowledge construction. International Journal of E-Learning & Distance Education 13, 1 (2007), 57--74.",
      "doi": ""
    },
    {
      "text": "Juho Kim. 2013. Toolscape: enhancing the learning experience of how-to videos. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 2707--2712.  ",
      "doi": "10.1145/2468356.2479497"
    },
    {
      "text": "Juho Kim, Elena L. Glassman, Andr´ es Monroy-Hern´ andez, and Meredith Ringel Morris. 2015. RIMES: Embedding Interactive Multimedia Exercises in Lecture Videos. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1535--1544.  ",
      "doi": "10.1145/2702123.2702186"
    },
    {
      "text": "Juho Kim, Philip J. Guo, Carrie J. Cai, Shang-Wen (Daniel) Li, Krzysztof Z. Gajos, and Robert C. Miller. 2014a. Data-driven Interaction Techniques for Improving Navigation of Educational Videos. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 563--572.  ",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Juho Kim, Phu Tran Nguyen, Sarah Weir, Philip J Guo, Robert C Miller, and Krzysztof Z Gajos. 2014b. Crowdsourcing step-by-step information extraction to enhance existing how-to videos. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 4017--4026.  ",
      "doi": "10.1145/2556288.2556986"
    },
    {
      "text": "Geza Kovacs. 2016. Effects of In-Video Quizzes on MOOC Lecture Viewing. In Proceedings of the Third (2016) ACM Conference on Learning @ Scale (L@S '16). ACM, New York, NY, USA, 31--40.  ",
      "doi": "10.1145/2876034.2876041"
    },
    {
      "text": "So Young Kwon and Lauren Cifuentes. 2009. The comparative effect of individually-constructed vs. collaboratively-constructed computer-based concept maps. Computers & Education 52, 2 (2009), 365--375.  ",
      "doi": "10.1016/j.compedu.2008.09.012"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2013. Swifter: Improved Online Video Scrubbing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1159--1168.  ",
      "doi": "10.1145/2470654.2466149"
    },
    {
      "text": "John R McClure, Brian Sonak, and Hoi K Suen. 1999. Concept map assessment of classroom learning: Reliability, validity, and logistical practicality. Journal of research in science teaching 36, 4 (1999), 475--492.",
      "doi": ""
    },
    {
      "text": "Toni-Jan Keith Palma Monserrat, Shengdong Zhao, Kevin McGee, and Anshul Vikram Pandey. 2013. NoteVideo: Facilitating Navigation of Blackboard-style Lecture Videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1139--1148.  ",
      "doi": "10.1145/2470654.2466147"
    },
    {
      "text": "Joseph D Novak and Alberto J Cañ nas. 2008. The theory underlying concept maps and how to construct and use them. (2008).",
      "doi": ""
    },
    {
      "text": "Roni Reingold, Rikki Rimor, and Anat Kalay. 2008. Instructor's scaffolding in support of student's metacognition through a teacher education online course: a case study. Journal of interactive online learning 7, 2 (2008), 139--151.",
      "doi": ""
    },
    {
      "text": "Wolff-Michael Roth and Anita Roychoudhury. 1993. The concept map as a tool for the collaborative construction of knowledge: A microanalysis of high school physics students. Journal of research in science teaching 30, 5 (1993), 503--534.",
      "doi": ""
    },
    {
      "text": "M. Schwab, H. Strobelt, J. Tompkin, C. Fredericks, C. Huff, D. Higgins, A. Strezhnev, M. Komisarchik, G. King, and H. Pfister. 2017. booc.io: An Education System with Hierarchical Concept Maps. IEEE Transactions on Visualization and Computer Graphics PP, 99 (Jan 2017 2017), 1--1.  ",
      "doi": "10.1109/TVCG.2016.2598518"
    },
    {
      "text": "Ruey-Shiang Shaw. 2010. A study of learning performance of e-learning materials design with knowledge maps. Computers & Education 54, 1 (2010), 253--264.  ",
      "doi": "10.1016/j.compedu.2009.08.007"
    },
    {
      "text": "Chao Boon Teo and Robert Kheng Leng Gay. 2006. A Knowledge-driven Model to Personalize e-Learning. J. Educ. Resour. Comput. 6, 1, Article 3 (March 2006).  ",
      "doi": "10.1145/1217862.1217865"
    },
    {
      "text": "Minhong Wang, Jun Peng, Bo Cheng, Hance Zhou, and Jie Liu. 2011. Knowledge visualization for self-regulated learning. Educational Technology & Society 14, 3 (2011), 28--42.",
      "doi": ""
    },
    {
      "text": "Sarah Weir, Juho Kim, Krzysztof Z Gajos, and Robert C Miller. 2015. Learnersourcing subgoal labels for how-to videos. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 405--416.  ",
      "doi": "10.1145/2675133.2675219"
    },
    {
      "text": "Jacob Whitehill and Margo Seltzer. 2017. A Crowdsourcing Approach to Collecting Tutorial Videos--Toward Personalized Learning-at-Scale. In Proceedings of the Fourth (2017) ACM Conference on Learning@ Scale. ACM, 157--160.  ",
      "doi": "10.1145/3051457.3053973"
    },
    {
      "text": "Joseph Jay Williams, Juho Kim, Anna Rafferty, Samuel Maldonado, Krzysztof Z. Gajos, Walter S. Lasecki, and Neil Heffernan. 2016. AXIS: Generating Explanations at Scale with Learnersourcing and Machine Learning. In Proceedings of the Third (2016) ACM Conference on Learning @ Scale (L@S '16). ACM, New York, NY, USA, 379--388.  ",
      "doi": "10.1145/2876034.2876042"
    },
    {
      "text": "Han Zhang. 2017. Smart Jump: Automated Navigation Suggestion for Videos in MOOCs. In Proceedings of the 26th International Conference on World Wide Web Companion (WWW '17 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 1183--1184.  ",
      "doi": "10.1145/3041021.3055364"
    },
    {
      "text": "Barry J Zimmerman and Dale H Schunk. 2001. Self-regulated learning and academic achievement: Theoretical perspectives. Routledge.",
      "doi": ""
    },
    {
      "text": "Krunoslav Zubrinic, Damir Kalpic, and Mario Milicevic. 2012. The automatic creation of concept maps from documents written using morphologically rich languages. Expert systems with applications 39, 16 (2012), 12709--12718.  ",
      "doi": "10.1016/j.eswa.2012.04.065"
    }
  ]
}