{
  "doi": "10.1145/3173574.3174187",
  "title": "BioFidget: Biofeedback for Respiration Training Using an Augmented Fidget Spinner",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "This paper presents BioFidget, a biofeedback system that integrates physiological sensing and display into a smart fidget spinner for respiration training. We present a simple yet novel hardware design that transforms a fidget spinner into 1) a nonintrusive heart rate variability (HRV) sensor, 2) an electromechanical respiration sensor, and 3) an information display. The combination of these features enables users to engage in respiration training through designed tangible and embodied interactions, without requiring them to wear additional physiological sensors. The results of this empirical user study prove that the respiration training method reduces stress, and the proposed system meets the requirements of sensing validity and engagement with 32 participants in a practical setting.",
  "tags": [
    "respiration training",
    "physiological sensing",
    "tangible interaction",
    "fidget spinner",
    "stress",
    "biofeedback"
  ],
  "authors": [
    {
      "name": "Rong-Hao Liang",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321494894",
      "orcid": "0000-0003-3239-8749"
    },
    {
      "name": "Bin Yu",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658739463",
      "orcid": "missing"
    },
    {
      "name": "Mengru Xue",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260589",
      "orcid": "missing"
    },
    {
      "name": "Jun Hu",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100255370",
      "orcid": "missing"
    },
    {
      "name": "Loe M. G. Feijs",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81405593355",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R.F. Baumeister and K.D. Vohs. 2004. Handbook of Self-regulation: Research, Theory, and Applications. Guilford Press. https://books.google.nl/books?id=7CeE67IrVDUC",
      "doi": ""
    },
    {
      "text": "Miguel Bruns Alonso. 2010. Relax!: Inherent Feedback During Product Interaction to Reduce Stress.",
      "doi": ""
    },
    {
      "text": "John T Cacioppo, Gary G Berntson, and Stephen L Crites. 1996. Social neuroscience: Principles of psychophysiological arousal and response. (1996).",
      "doi": ""
    },
    {
      "text": "Rod K Dishman, Yoshio Nakamura, Melissa E Garcia, Ray W Thompson, Andrea L Dunn, and Steven N Blair. 2000. Heart rate variability, trait anxiety, and perceived stress among physically fit men and women. International Journal of Psychophysiology 37, 2 (2000), 121--133.",
      "doi": ""
    },
    {
      "text": "Tom Djajadiningrat, Ben Matthews, and Marcelle Stienstra. 2007. Easy Doesn'T Do It: Skill and Expression in Tangible Aesthetics. Personal Ubiquitous Comput. 11, 8 (Dec. 2007), 657--676.  ",
      "doi": "10.1007/s00779-006-0137-9"
    },
    {
      "text": "Tom Djajadiningrat, Kees Overbeeke, and Stephan Wensveen. 2002. But How, Donald, Tell Us How?: On the Creation of Meaning in Interaction Design Through Feedforward and Inherent Feedback. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, New York, NY, USA, 285--291.  ",
      "doi": "10.1145/778712.778752"
    },
    {
      "text": "Tom Djajadiningrat, Stephan Wensveen, Joep Frens, and Kees Overbeeke. 2004. Tangible Products: Redressing the Balance Between Appearance and Action. Personal Ubiquitous Comput. 8, 5 (Sept. 2004), 294--309.  ",
      "doi": "10.1007/s00779-004-0293-8"
    },
    {
      "text": "Robert Fabricant. 2005. Incorporating Guidance and Rewards into a Handheld-device User Experience. In Proceedings of the 2005 Conference on Designing for User eXperience (DUX '05). AIGA: American Institute of Graphic Arts, New York, NY, USA, Article 30. http: //dl.acm.org/citation.cfm?id=1138235.1138271 ",
      "doi": "10.5555/1138235.1138271"
    },
    {
      "text": "A. B. Farjadian, M. L. Sivak, and C. Mavroidis. 2013. SQUID: Sensorized shirt with smartphone interface for exercise monitoring and home rehabilitation. In 2013 IEEE 13th International Conference on Rehabilitation Robotics (ICORR). 1--6.",
      "doi": ""
    },
    {
      "text": "Kenneth P. Fishkin. 2004. A Taxonomy for and Analysis of Tangible Interfaces. Personal Ubiquitous Comput. 8, 5 (Sept. 2004), 347--358.  ",
      "doi": "10.5555/1023813.1023819"
    },
    {
      "text": "Richard Gevirtz. 2013. The Promise of Heart Rate Variability Biofeedback: Evidence-Based Applications. Biofeedback 41, 3 (2013), 110--120.",
      "doi": ""
    },
    {
      "text": "James J Gibson. 1987. The ecological approach to visual perception. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Catherine A. Hettinger. 1993. Spinning Toy. (1993). US Patent 5591062A.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, New York, NY, USA, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Michael Karlesky and Katherine Isbister. 2013. Designing for the Physical Margins of Digital Workspaces: Fidget Widgets in Support of Productivity and Creativity. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 13--20.  ",
      "doi": "10.1145/2540930.2540978"
    },
    {
      "text": "Kai Kuikkaniemi, Toni Laitinen, Marko Turpeinen, Timo Saari, Ilkka Kosunen, and Niklas Ravaja. 2010. The Influence of Implicit and Explicit Biofeedback in First-person Shooter Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 859--868.  ",
      "doi": "10.1145/1753326.1753453"
    },
    {
      "text": "Hannakaisa Lansisalmi, Jose M. Peiro, and Mika Kivimaki IV. 2000. Collective stress and coping in the context of organizational culture. European Journal of Work and Organizational Psychology 9, 4 (2000), 527--559.",
      "doi": ""
    },
    {
      "text": "Paul M Lehrer, Evgeny Vaschillo, and Bronya Vaschillo. 2000. Resonant frequency biofeedback training to increase cardiac variability: Rationale and manual for training. Applied psychophysiology and biofeedback 25, 3 (2000), 177--191.",
      "doi": ""
    },
    {
      "text": "Rong-Hao Liang, Kai-Yin Cheng, Liwei Chan, Chuan-Xhyuan Peng, Mike Y. Chen, Rung-Huei Liang, De-Nian Yang, and Bing-Yu Chen. 2013. GaussBits: Magnetic Tangible Bits for Portable and Occlusion-free Near-surface Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1391--1400.  ",
      "doi": "10.1145/2470654.2466185"
    },
    {
      "text": "Wan-Hua Lin, Dan Wu, Chunyue Li, Heye Zhang, and Yuan-Ting Zhang. 2014. Comparison of Heart Rate Variability from PPG with That from ECG. Springer International Publishing, Cham, 213--215.",
      "doi": ""
    },
    {
      "text": "G Lu, F Yang, JA Taylor, and JF Stein. 2009. A comparison of photoplethysmography and ECG recording to analyse heart rate variability in healthy subjects. Journal of medical engineering & technology 33, 8 (2009), 634--641.",
      "doi": ""
    },
    {
      "text": "Sonia J Lupien, Bruce S McEwen, Megan R Gunnar, and Christine Heim. 2009. Effects of stress throughout the lifespan on the brain, behaviour and cognition. Nature reviews. Neuroscience 10, 6 (2009), 434.",
      "doi": ""
    },
    {
      "text": "Joanna McGrenere and Wayne Ho. 2000. Affordances: Clarifying and evolving a concept. In Graphics interface, Vol. 2000. 179--186.",
      "doi": ""
    },
    {
      "text": "David Merrill, Jeevan Kalanithi, and Pattie Maes. 2007. Siftables: Towards Sensor Network User Interfaces. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (TEI '07). ACM, New York, NY, USA, 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Alan Monat and Richard S Lazarus. 1991. Stress and coping: An anthology. Columbia University Press.",
      "doi": ""
    },
    {
      "text": "Neema Moraveji, Athman Adiseshan, and Takehiro Hagiwara. 2012. BreathTray: Augmenting Respiration Self-regulation Without Cognitive Deficit. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 2405--2410.  ",
      "doi": "10.1145/2212776.2223810"
    },
    {
      "text": "Donald A. Norman. 2002. The Design of Everyday Things. Basic Books, Inc., New York, NY, USA. ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Joan Sol Roo, Renaud Gervais, Jeremy Frey, and Martin Hachet. 2017. Inner Garden: Connecting Inner States to a Mixed Reality Sandbox for Mindfulness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1459--1470.  ",
      "doi": "10.1145/3025453.3025743"
    },
    {
      "text": "Rachel A Schecter, Jay Shah, Kate Fruitman, and Ruth Lynn Milanaik. 2017. Fidget spinners: Purported benefits, adverse effects and accepted alternatives. Current opinion in pediatrics 29, 5 (2017), 616--618.",
      "doi": ""
    },
    {
      "text": "C. E. Shannon. 1949. Communication in the Presence of Noise. Proc. Institute of Radio Engineers 37, 1 (1949), 10--21.",
      "doi": ""
    },
    {
      "text": "Nandita Sharma and Tom Gedeon. 2012. Objective measures, sensors and computational techniques for stress recognition and classification: A survey. Computer methods and programs in biomedicine 108, 3 (2012), 1287--1301.  ",
      "doi": "10.1016/j.cmpb.2012.07.003"
    },
    {
      "text": "Robin P Smith, Jěrŏme Argod, Jean-Louis P73233;pin, and Patrick A Lévy. 1999. Pulse transit time: an appraisal of potential clinical applications. Thorax 54, 5 (1999), 452--457.",
      "doi": ""
    },
    {
      "text": "Hye-Sue Song and Paul M Lehrer. 2003. The effects of specific respiratory rates on heart rate and heart rate variability. Applied psychophysiology and biofeedback 28, 1 (2003), 13--23.",
      "doi": ""
    },
    {
      "text": "Phyllis K Stein, Matthew S Bosner, Robert E Kleiger, and Brooke M Conger. 1994. Heart rate variability: a measure of cardiac autonomic tone. American heart journal 127, 5 (1994), 1376--1381.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1991. The computer for the 21st century. Scientific american 265, 3 (1991), 94--104.",
      "doi": ""
    },
    {
      "text": "Stephan Wensveen, Kees Overbeeke, and Tom Djajadiningrat. 2002. Push Me, Shove Me and I Show You How You Feel: Recognising Mood from Emotionally Rich Interaction. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, New York, NY, USA, 335--340.  ",
      "doi": "10.1145/778712.778759"
    },
    {
      "text": "S. A. G. Wensveen, J. P. Djajadiningrat, and C. J. Overbeeke. 2004. Interaction Frogger: A Design Framework to Couple Action and Function Through Feedback and Feedforward. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '04). ACM, New York, NY, USA, 177--184.  ",
      "doi": "10.1145/1013115.1013140"
    },
    {
      "text": "Fumihiko Yasuma and Jun-ichiro Hayano. 2004. Respiratory sinus arrhythmia: why does the heartbeat synchronize with respiratory rhythm? Chest 125, 2 (2004), 683--690.",
      "doi": ""
    },
    {
      "text": "K. Yokoyama, J. Ushida, Y. Sugiura, M. Mizuno, Y. Mizuno, and K. Takata. 2002. Heart rate indication using musical data. IEEE Transactions on Biomedical Engineering 49, 7 (July 2002), 729--733.",
      "doi": ""
    },
    {
      "text": "Bin Yu, Rogier Arents, Mathias Funk, Jun Hu, and Loe M.G. Feijs. 2016a. HeartPlotter: Visualizing Bio-data by Drawing on Paper. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1794--1799.  ",
      "doi": "10.1145/2851581.2892289"
    },
    {
      "text": "Bin Yu, Nienke Bongers, Alissa van Asseldonk, Jun Hu, Mathias Funk, and Loe Feijs. 2016b. LivingSurface: Biofeedback Through Shape-changing Display. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 168--175.  ",
      "doi": "10.1145/2839462.2839469"
    }
  ]
}