{
  "doi": "10.1145/3173574.3174037",
  "title": "Antibiotic-Responsive Bioart: Exploring DIYbio as a Design Studio Practice",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Our work links hybrid practices from biology, fine arts, and design in a studio setting to support materially-oriented engagement with biotechnology. Using autoethnographic methods, we present our two-year process of converting an HCI studio into a BSL-1 (biosafety level 1) facility, our iterative development of low-cost tools, and our own self-reflexive experimentation with (DIY)bio protocols. Insights from this work led us to design a weeklong bioart course, whereby junior highschool students creatively \"painted\" with bacteria and antibiotic substances, digitally designed stencils from the resulting petri dish images, and screenprinted them onto physical artifacts. Our findings reveal the nuances of working with biological, analog, and digital materials in a design studio setting. We conclude by reflecting on DIYbio studio as a gathering of diverse actors who work with hybrid materials to give physical form to matters of concern.",
  "authors": [
    {
      "name": "Stacey Kuznetsov",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338489421",
      "orcid": "missing"
    },
    {
      "name": "Cassandra Barrett",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659249726",
      "orcid": "missing"
    },
    {
      "name": "Piyum Fernando",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658675011",
      "orcid": "missing"
    },
    {
      "name": "Kat Fowler",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261898",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American Society for Microbiology. Agar Art Contest. https://www.asm.org/index.php/public-outreach/agar-art",
      "doi": ""
    },
    {
      "text": "Roy Ascott. 2007. Telematic Embrace: Visionary Theories of Art, Technology, and Consciousness. University of California Press, Berkeley, CA. ",
      "doi": "10.5555/862145"
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, and Sarah Ng. 2017. Supporting Cultures of Making: Technology, Policy, Visions, and Myths. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6523--65  ",
      "doi": "10.1145/3025453.3025975"
    },
    {
      "text": "Bell, P., Bricker, L. A., Reeve, S., Zimmerman, H. T., & Tzou, C. (in press). Discovering and Supporting Successful Learning Pathways of Youth In and Out Of School: Accounting for the Development of Everyday Expertise Across Settings. In B. Bevan, P. Bell, & R. Stevens (Eds.), Learning about Out of School Time (LOST) Learning Opportunities: Springer.",
      "doi": ""
    },
    {
      "text": "Blevis, E., Lim, Y.K., Stolterman, E., Makice, K. (2008). The Iterative Design of a Virtual Design Studio. Techtrends: A Journal of the Association for Educational Communications and Technology. Springer US. Volume 52, Number 1. 74--83.",
      "doi": ""
    },
    {
      "text": "Eli Blevis, Youn-kyung Lim, Erik Stolterman, Tracee Vetting Wolf, and Keichi Sato. 2007. Supporting design studio culture in HCI. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, New York, NY, USA, 2821--2824.  ",
      "doi": "10.1145/1240866.1241086"
    },
    {
      "text": "Sarah J. Berman. Bacterial Painting. http://www.sarahjberman.com/bacteriapainting",
      "doi": ""
    },
    {
      "text": "Bilda, Z., Edmonds, E., and Candy, L., Designing for creative engagement. Design Studies 29, 6 (2008), 525--540.",
      "doi": ""
    },
    {
      "text": "Biocurious. http://biocurious.org/",
      "doi": ""
    },
    {
      "text": "Geoffery C. Bowker, Susan Leigh Star, Sorting things out: classification and its consequences, MIT Press, Cambridge, MA, 2000 ",
      "doi": "10.5555/380681"
    },
    {
      "text": "1Brahms, L. & Crowley, K. (in press). Making Sense of Making: Defining Learning Practices in MAKE Magazine. In Y. Kafai & K. Pepler (Eds). Makeology.",
      "doi": ""
    },
    {
      "text": "Bauer, AW; Kirby, WM; Sherris, JC; Turck, M (April 1966). \"Antibiotic susceptibility testing by a standardized single disk method.\". American journal of clinical pathology. 45 (4): 493--6.",
      "doi": ""
    },
    {
      "text": "Carolina Biological. Pigmented Bacteria Set. https://www.carolina.com/bacteria/pigmented-bacteria-set/FAM_154745.pr",
      "doi": ""
    },
    {
      "text": "Katherine Cennamo, Sarah A. Douglas, Mitzi Vernon, Carol Brandt, Brigitte Scott, Yolanda Reimer, and Margarita McGrath. 2011. Promoting creativity in the computer science design studio. In Proceedings of the 42nd ACM technical symposium on Computer science education (SIGCSE '11). ACM, New York, NY, USA, 649--654.  ",
      "doi": "10.1145/1953163.1953344"
    },
    {
      "text": "Center for Genomic Gastronomy. http://genomicgastronomy.com/",
      "doi": ""
    },
    {
      "text": "Critical Art Ensemble. http://critical-art.net/",
      "doi": ""
    },
    {
      "text": "Carlson, R. H. Biology is Technology: The Promise, Peril, and New Business of Engineering Life. Cambridge, MA: Harvard University Press, 2010.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. Biosafety in Microbiological and Biomedical Laboratories (BMBL) 5th Edition. http://www.cdc.gov/biosafety/publications/bmbl5/",
      "doi": ""
    },
    {
      "text": "Matthew Chalmers, Areti Galani, Seamful interweaving: heterogeneity in the theory and design of interactive systems, Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques, August 01-04, 2004, Cambridge, MA, USA  ",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "Chi, M. T. H., & Menekse, M. (2015). Dialogue patterns that promote learning. In L. B. Resnick, C. Asterhan, & S. N. Clarke (Eds.), Socializing intelligence through academic talk and dialogue (Ch. 21, pp. 263--274). Washington, DC: AERA.",
      "doi": ""
    },
    {
      "text": "2Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: how HCI design can express matters of concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2397--2406.  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "2Anna Dumitriu. Infective Textiles. http://annadumitriu.tumblr.com/InfectiveTextiles",
      "doi": ""
    },
    {
      "text": "Rob Dunn. 2010. Painting With Penicillin: Alexander Fleming's Germ Art. Smithsonian.org.",
      "doi": ""
    },
    {
      "text": "http://www.smithsonianmag.com/science-nature/painting-with-penicillin-alexander-flemings-germ-art-1761496/",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. Speculative Everything. MIT Press 2013.",
      "doi": ""
    },
    {
      "text": "Rob Faludi, Kate Hartman, and Kati London. Botanicals. https://www.botanicalls.com/",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Boucher, A., Law, A., Pennington, S., Bowers, J., Beaver, J., Humble, J., Kerridge, T., Villar, N. and Wilkie, A. Threshold devices: looking out from the home. In Proc. CHI '08, ACM Press (2008), 1429--1438.  ",
      "doi": "10.1145/1357054.1357278"
    },
    {
      "text": "Genspace. https://www.genspace.org/",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. (2007) Why Research-Oriented Design Isn't Design-Oriented Research: On the Tensions Between Design and Research in an Implicit Design Discipline. Know Techn Pol (2007) 20: 193.",
      "doi": ""
    },
    {
      "text": "Foad Hamidi and Melanie Baljko. 2017. Engaging Children Using a Digital Living Media System. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 711--723.  ",
      "doi": "10.1145/3064663.3064708"
    },
    {
      "text": "Helmes, J., Taylor, A. S., Cao, X., Höök, K., Schmitt, P., and Villar, N. Rudiments 1, 2 & 3: design speculations on autonomy. In Proc. TEI '11, ACM Press (2011), 145--152.  ",
      "doi": "10.1145/1935701.1935730"
    },
    {
      "text": "3Hertz, G., Cockroach controlled mobile robot. Garnet Hertz-Http://conceptlabcom, (2008).",
      "doi": ""
    },
    {
      "text": "3Honey, M., Kanter, D. E. Design, Make, Play. Growing the next generation of STEM innovators. Routledge, 2013.",
      "doi": ""
    },
    {
      "text": "3C. D. Hundhausen, D. Fairbrother, and M. Petre. 2012. An Empirical Study of the \"Prototype Walkthrough\": A Studio-Based Activity for HCI Education. ACM Trans. Comput.-Hum. Interact. 19, 4, Article 26 (December 2012), 36 pages.  ",
      "doi": "10.1145/2395131.2395133"
    },
    {
      "text": "Ingold, T. Making: Anthropology, Archaeology, Art and Architecture. Routledge, London, 2013.",
      "doi": ""
    },
    {
      "text": "Michael Eisenberg. 2004. Tangible ideas for children: materials sciences as the future of educational technology. In Proceedings of the 2004 conference on Interaction design and children: building a community (IDC '04). ACM, New York, NY, USA, 19--26.  ",
      "doi": "10.1145/1017833.1017836"
    },
    {
      "text": "Piyum Fernando, Matthew Pandelakis, and Stacey Kuznetsov. 2016. Practicing DIYBiology In An HCI Setting. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 2064--2071.  ",
      "doi": "10.1145/2851581.2892325"
    },
    {
      "text": "3Holstius, D., Kembel, J., Hurst, A., Wan, P. H., and Forlizzi, J. 2004. Infotropism: living and robotic plants as interactive displays. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques, 215--221.  ",
      "doi": "10.1145/1013115.1013145"
    },
    {
      "text": "3Cindy Lin Kaiying and Silvia Lindtner. 2016. Legitimacy, boundary objects & participation in transnational DIY biology. In Proceedings of the 14th Participatory Design Conference: Full papers - Volume 1 (PDC '16), Claus Bossen, Rachel Charlotte Smith, Anne Marie Kanstrup, Janet McDonnell, Maurizio Teli, and Keld Bødker (Eds.), Vol. 1. ACM, New York, NY, USA, 171--180.  ",
      "doi": "10.1145/2940299.2940307"
    },
    {
      "text": "3Viirj Kan, Emma Vargo, Noa Machover, Hiroshi Ishii, Serena Pan, Weixuan Chen, and Yasuaki Kakehi. 2017. Organic Primitives: Synthesis and Design of pH-Reactive Materials using Molecular I/O for Sensing, Actuation, and Interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 989--1000.  ",
      "doi": "10.1145/3025453.3025952"
    },
    {
      "text": "40.Cindy Hsin-Liu Kao, Bichlien Nguyen, Asta Roseway, and Michael Dickey. 2017. EarthTones: Chemical Sensing Powders to Detect and Display Environmental Hazards through Color Variation. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 872--883.  ",
      "doi": "10.1145/3027063.3052754"
    },
    {
      "text": "4Riedel-Kruse, I.H., A.M. Chung, B. Dura, A.L. Hamilton, and B.C. Lee, Design, engineering and utility of biotic games. Lab on a Chip, 11, 1 (2011), 14--22.",
      "doi": ""
    },
    {
      "text": "4Kuhn, S. (2001). Learning from the Architecture Studio: Implications for Project-Based Pedagogy. International Journal of Engineering Education, 17, 349--352.",
      "doi": ""
    },
    {
      "text": "4Satoshi Kuribayashi and Akira Wakita. 2006. PlantDisplay: turning houseplants into ambient display. In Proceedings of SIGCHI ACE 2006, Article 40.  ",
      "doi": "10.1145/1178823.1178871"
    },
    {
      "text": "4Stacey Kuznetsov, William Odom, James Pierce, and Eric Paulos. 2011. Nurturing natural sensors. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11). ACM, New York, NY, USA, 227--236.  ",
      "doi": "10.1145/2030112.2030144"
    },
    {
      "text": "4Stacey Kuznetsov, Alex S. Taylor, Tim Regan, Nicolas Villar, and Eric Paulos. 2012. At the seams: DIYbio and opportunities for HCI. In Proceedings of the Designing Interactive Systems Conference(DIS '12). ACM, New York, NY, USA, 258--267.  ",
      "doi": "10.1145/2317956.2317997"
    },
    {
      "text": "4Stacey Kuznetsov, Laura C. Trutoiu, Casey Kute, Iris Howley, Eric Paulos, and Dan Siewiorek. 2011. Breaking boundaries: strategies for mentoring through textile computing workshops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2957--2966.  ",
      "doi": "10.1145/1978942.1979380"
    },
    {
      "text": "4Latour, B. \"From Realpolitik to Dingpolitik.\" In Making Things Public: Atmospheres of Democracy, Weibel, P. and B. Latour, eds. MIT Press: Cambridge MA (2005), 14--44.",
      "doi": ""
    },
    {
      "text": "4Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. 2014. Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 439--448.  ",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "4Lumen Microbiology. Testing the Effectiveness of Antimicrobials. https://courses.lumenlearning.com/microbiology/chapter/testing-the-effectiveness-of-antimicrobials/",
      "doi": ""
    },
    {
      "text": "50.Microbial Art. http://www.microbialart.com/",
      "doi": ""
    },
    {
      "text": "5Seung Ah Lee, Engin Bumbacher, Alice M. Chung, Nate Cira, Byron Walker, Ji Young Park, Barry Starr, Paulo Blikstein, and Ingmar H. Riedel-Kruse. 2015. Trap it!: A Playful Human-Biology Interaction for a Museum Installation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2593--2602.  ",
      "doi": "10.1145/2702123.2702220"
    },
    {
      "text": "5Seung Ah Lee, Alice M. Chung, Nate Cira, and Ingmar H. Riedel-Kruse. 2015. Tangible Interactive Microbiology for Informal Science Education. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 273--280.  ",
      "doi": "10.1145/2677199.2680561"
    },
    {
      "text": "5Anna Loparev, Amanda Sullivan, Clarissa Verish, Lauren Westendorf, Jasmine Davis, Margaret Flemings, Marina Bers, and Orit Shaer. 2017. BacToMars: Creative Engagement with Bio-Design for Children. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17). ACM, New York, NY, USA, 623--628.  ",
      "doi": "10.1145/3078072.3084334"
    },
    {
      "text": "5Anna Loparev, Lauren Westendorf, Margaret Flemings, Jennifer Cho, Romie Littrell, Anja Scholze, and Orit Shaer. 2017. BacPack: Exploring the Role of Tangibles in a Museum Exhibit for Bio-Design. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, New York, NY, USA, 111--120.  ",
      "doi": "10.1145/3024969.3025000"
    },
    {
      "text": "5National Research Council. (2009). Learning in Informal Environments: People, Places, and Pursuits. Bell, P., Lewenstein, B., Shouse, A. W., and Feder, M. A., Editors.",
      "doi": ""
    },
    {
      "text": "5Carman Neustaedter, Tejinder K. Judge and Phoebe Sengers. 2014. Autobiographical Design in the Home. Studying and Designing Technology for Domestic Life: Lessons from Home, 135. Morgan Kaufmann",
      "doi": ""
    },
    {
      "text": "5Neustaedter, C., Sengers. P. 2012. Autobiographical design: what you can learn from designing for yourself. interactions 19, 6 (November 2012), 28--33.  ",
      "doi": "10.1145/2377783.2377791"
    },
    {
      "text": "5D. Norman, The Psychology of Everyday Things, Basic Books, New York (1988).",
      "doi": ""
    },
    {
      "text": "5Johanna Okerlund, Evan Segreto, Casey Grote, Lauren Westendorf, Anja Scholze, Romie Littrell, and Orit Shaer. 2016. SynFlo: A Tangible Museum Exhibit for Exploring Bio-Design. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI '16). ACM, New York, NY, USA, 141--149.  ",
      "doi": "10.1145/2839462.2839488"
    },
    {
      "text": "60.OpenPCR. http://openpcr.org/",
      "doi": ""
    },
    {
      "text": "6Pearl Biotech. https://pearlbiotech.com/",
      "doi": ""
    },
    {
      "text": "6James Pierce and Eric Paulos. 2014. Some variations on a counterfunctional digital camera. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 131--140.  ",
      "doi": "10.1145/2598510.2602968"
    },
    {
      "text": "6Andrew Quitmeyer and Hannah Perner-Wilson. 2015. Wearable studio practice: design considerations for digital crafting in harsh environments. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 1285--1293.  ",
      "doi": "10.1145/2800835.2807926"
    },
    {
      "text": "6Ratto, Matt (2011). \"Critical Making: Conceptual and Material Studies in technology and Social Life\". The Information Society. 27: 252.  ",
      "doi": "10.1080/01972243.2011.583819"
    },
    {
      "text": "6Ali Schachtschneider. Bacterial Textiles. http://www.alischachtschneider.com/material-archive.html",
      "doi": ""
    },
    {
      "text": "6Schon, D. 1986. The Design Studio: An Exploration of Its Traditions and Potentials. Intl Specialized Book Service",
      "doi": ""
    },
    {
      "text": "6Science Buddies Staff. 2017. How Well Do Disinfectants Work?. from https://www.sciencebuddies.org/science-fair-projects/project-ideas/MicroBio_p012/microbiology/how-well-do-disinfectants-work",
      "doi": ""
    },
    {
      "text": "6Phoebe Sengers and Chris Csikszentmihályi. 2003. HCI and the arts: a conflicted convergence?. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, USA, 876--877.  ",
      "doi": "10.1145/765891.766044"
    },
    {
      "text": "6Orit Shaer, Oded Nov, Anne West, and Diana Eastman. 2014. Understanding information practices of interactive personal genomics users. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 2455--2460.  ",
      "doi": "10.1145/2559206.2581145"
    },
    {
      "text": "70.Sheridan, K., Rosenfeld Halverson, E., Litts, B., Brahms, L., Jacobs-Priebe, L., Owens, T. (2014) Learning in the Making: A Comparative Case Study of Three Makerspaces. Harvard Educational Review: December 2014, Vol. 84, No. 4, pp. 505--531.",
      "doi": ""
    },
    {
      "text": "7SymbioticA. http://www.symbiotica.uwa.edu.au/",
      "doi": ""
    },
    {
      "text": "7Alex S. Taylor. 2009. Machine intelligence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 2109--2118  ",
      "doi": "10.1145/1518701.1519022"
    },
    {
      "text": "7Alex S. Taylor, Nir Piterman, Samin Ishtiaq, Jasmin Fisher, Byron Cook, Caitlin Cockerton, Sam Bourton, and David Benque. 2013. At the interface of biology and computation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 493--502.  ",
      "doi": "10.1145/2470654.2470725"
    },
    {
      "text": "7van Eck, W. and Lamers, M.H., Hybrid BiologicalDigital Systems in Artistic and Entertainment Computing. Leonardo 46, 2 (2013), 151--158.",
      "doi": ""
    },
    {
      "text": "7Mihaela Vorvoreanu, Colin M. Gray, Paul Parsons, and Nancy Rasche. 2017. Advancing UX Education: A Model for Integrated Studio Pedagogy. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1441--1446.  ",
      "doi": "10.1145/3025453.3025726"
    },
    {
      "text": "7Guanyun Wang, Lining Yao, Wen Wang, Jifei Ou, Chin-Yi Cheng, and Hiroshi Ishii. 2016. xPrint: A Modularized Liquid Printer for Smart Materials Deposition. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5743--5752.  ",
      "doi": "10.1145/2858036.2858281"
    },
    {
      "text": "7Wen Wang, Lining Yao, Teng Zhang, Chin-Yi Cheng, Daniel Levine, and Hiroshi Ishii. 2017. Transformative Appetite: Shape-Changing Food Transforms from 2D to 3D by Water Interaction through Cooking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6123--6132.  ",
      "doi": "10.1145/3025453.3026019"
    },
    {
      "text": "7Wark, M. A Hacker Manifesto. Cambridge, MA: Harvard University Press, 2004. ",
      "doi": "10.5555/993664"
    },
    {
      "text": "7Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. bioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "80.Adam Zaretsky. http://www.emutagen.com/",
      "doi": ""
    }
  ]
}