{
  "doi": "10.1145/3173574.3174228",
  "title": "CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "CLAW is a handheld virtual reality controller that augments the typical controller functionality with force feedback and actuated movement to the index finger. Our controller enables three distinct interactions (grasping virtual object, touching virtual surfaces, and triggering) and changes its corresponding haptic rendering by sensing the differences in the user's grasp. A servo motor coupled with a force sensor renders controllable forces to the index finger during grasping and touching. Using position tracking, a voice coil actuator at the index fingertip generates vibrations for various textures synchronized with finger movement. CLAW also supports a haptic force feedback in the trigger mode when the user holds a gun. We describe the design considerations for CLAW and evaluate its performance through two user studies. The first study obtained qualitative user feedback on the naturalness, effectiveness, and comfort when using the device. The second study investigated the ease of the transition between grasping and touching when using our device.",
  "tags": [
    "virtual reality",
    "texture",
    "controller design",
    "grasping",
    "touching",
    "force feedback",
    "haptics",
    "trigger"
  ],
  "authors": [
    {
      "name": "Inrak Choi",
      "institution": "Microsoft Research & Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659081195",
      "orcid": "missing"
    },
    {
      "name": "Eyal Ofek",
      "institution": "MIcrosoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    },
    {
      "name": "Hrvoje Benko",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100182346/rel-imgonly/81100182346.jpg",
      "acmid": "81100182346",
      "orcid": "0000-0002-2059-3558"
    },
    {
      "name": "Mike Sinclair",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498872",
      "orcid": "0000-0003-4343-2332"
    },
    {
      "name": "Christian Holz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    }
  ],
  "references": [
    {
      "text": "CyberGrasp, CyberGlove Systems Inc. http://www.cyberglovesystems.com/cybergrasp/. (????). Accessed: 2017--12--17.",
      "doi": ""
    },
    {
      "text": "Richard J. Adams and Blake Hannaford. 2002. Control law design for haptic interfaces to virtual reality. IEEE Transactions on Control Systems Technology 10, 1 (Jan 2002), 3--13.",
      "doi": ""
    },
    {
      "text": "Tomohiro Amemiya and Taro Maeda. 2008. Asymmetric Oscillation Distorts the Perceived Heaviness of Handheld Objects. IEEE Transactions on Haptics 1, 1 (Jan 2008), 9--18.  ",
      "doi": "10.1109/TOH.2008.5"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch: High-fidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Massimo Bergamasco, Bendetto Allotta, L.Bosio, Luca Ferretti, G. Parrini, G. M. Prisco, F. Salsedo, and G. Sartini. 1994. An arm exoskeleton system for teleoperation and virtual environments applications. In Proceedings of the 1994 IEEE International Conference on Robotics and Automation. 1449--1454 vol.2.",
      "doi": ""
    },
    {
      "text": "Jonathan Blake and Hakan B. Gurocak. 2009. Haptic Glove With MR Brakes for Virtual Reality. IEEE/ASME Transactions on Mechatronics 14, 5 (Oct 2009), 606--615.",
      "doi": ""
    },
    {
      "text": "M. Bouzit, G. Burdea, G. Popescu, and R. Boian. 2002. The Rutgers Master II-new design force-feedback glove. IEEE/ASME Transactions on Mechatronics 7, 2 (Jun 2002), 256--263.",
      "doi": ""
    },
    {
      "text": "Ian M. Bullock and Aaron M. Dollar. 2011. Classifying human manipulation behavior. In 2011 IEEE International Conference on Rehabilitation Robotics. 1--6.",
      "doi": ""
    },
    {
      "text": "Francesco Chinello, Monica Malvezzi, Claudio Pacchierotti, and Domenico Prattichizzo. 2015. Design and development of a 3RRS wearable fingertip cutaneous device. In 2015 IEEE International Conference on Advanced Intelligent Mechatronics (AIM). 293--298.",
      "doi": ""
    },
    {
      "text": "Inrak Choi, Heather Culbertson, Mark R. Miller, Alex Olwal, and Sean Follmer. 2017. Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 119--130.  ",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Inrak Choi, Elliot W. Hawkes, David L. Christensen, Christopher J. Ploch, and Sean Follmer. 2016. Wolverine: A wearable haptic interface for grasping in virtual reality. In 2016 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 986--993.",
      "doi": "10.1109/IROS.2016.7759169"
    },
    {
      "text": "Heather Culbertson, Julie M. Walker, Michael Raitor, and Allison M. Okamura. 2017. WAVES: A Wearable Asymmetric Vibration Excitation System for Presenting Three-Dimensional Translation and Rotation Cues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4972--4982.  ",
      "doi": "10.1145/3025453.3025741"
    },
    {
      "text": "Mark R. Cutkosky. 1989. On grasp choice, grasp models, and the design of hands for manufacturing tasks. IEEE Transactions on Robotics and Automation 5, 3 (Jun 1989), 269--279.",
      "doi": ""
    },
    {
      "text": "Takahiro Endo, Haruhisa Kawasaki, Tetsuya Mouri, Yasuhiko Ishigure, Hisayuki Shimomura, Masato Matsumura, and Kazumi Koketsu. 2011. Five-Fingered Haptic Interface Robot: HIRO III. IEEE Transactions on Haptics 4, 1 (January 2011), 14--27.  ",
      "doi": "10.1109/TOH.2010.62"
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. 2016. Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in VR. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1991--1995.  ",
      "doi": "10.1145/2858036.2858487"
    },
    {
      "text": "John M. Hollerbach. 2000. Some current issues in haptics research. In Proceedings 2000 ICRA. Millennium Conference. IEEE International Conference on Robotics and Automation. Symposia Proceedings (Cat. No.00CH37065), Vol. 1. 757--762 vol.1.",
      "doi": ""
    },
    {
      "text": "Kenneth O Johnson. 2001. The roles and functions of cutaneous mechanoreceptors. Current Opinion in Neurobiology 11, 4 (2001), 455 -- 461.",
      "doi": ""
    },
    {
      "text": "Rebecca P. Khurshid, Naomi T. Fitter, Elizabeth A. Fedalei, and Katherine J. Kuchenbecker. 2017. Effects of Grip-Force, Contact, and Acceleration Feedback on a Teleoperated Pick-and-Place Task. IEEE Transactions on Haptics 10, 1 (Jan 2017), 40--53.  ",
      "doi": "10.1109/TOH.2016.2573301"
    },
    {
      "text": "Ki-Uk Kyung and Jun-Young Lee. 2009. Ubi-Pen: A Haptic Interface with Texture and Vibrotactile Display. IEEE Computer Graphics and Applications 29, 1 (Jan 2009), 56--64.",
      "doi": ""
    },
    {
      "text": "Karon E. MacLean, Michael J. Shaver, and Dinesh K. Pai. 2002. Handheld haptics: a USB media controller with force sensing. In Proceedings 10th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. HAPTICS 2002. 311--318. ",
      "doi": "10.5555/795682.797538"
    },
    {
      "text": "Thomas H Massie, J Kenneth Salisbury, and others. 1994. The phantom haptic interface: A device for probing virtual objects. In Proceedings of the ASME winter annual meeting, symposium on haptic interfaces for virtual environment and teleoperator systems, Vol. 55. Chicago, IL, 295--300.",
      "doi": ""
    },
    {
      "text": "Kouta Minamizawa, Souichiro Fukamachi, Hiroyuki Kajimoto, Naoki Kawakami, and Susumu Tachi. 2007. Gravity Grabber: Wearable Haptic Display to Present Virtual Mass Sensation. In ACM SIGGRAPH 2007 Emerging Technologies (SIGGRAPH '07). ACM, New York, NY, USA, Article 8.  ",
      "doi": "10.1145/1278280.1278289"
    },
    {
      "text": "Jun Murayama, Laroussi Bougrila, YanLin Luo, Katsuhito Akahane, Shoichi Hasegawa, Béat Hirsbrunner, and Makoto Sato. 2004. SPIDAR G&G: a two-handed haptic interface for bimanual VR interaction. In Proceedings of EuroHaptics, Vol. 2004. Citeseer, 138--146.",
      "doi": ""
    },
    {
      "text": "Martin Murer, Bernhard Maurer, Hermann Huber, Ilhan Aslan, and Manfred Tscheligi. 2015. TorqueScreen: Actuated Flywheels for Ungrounded Kinaesthetic Feedback in Handheld Devices. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 161--164.  ",
      "doi": "10.1145/2677199.2680579"
    },
    {
      "text": "Claudio Pacchierotti, Gionata Salvietti, Irfan Hussain, Leonardo Meli, and Domenico Prattichizzo. 2016. The hRing: A wearable haptic device to avoid occlusions in hand tracking. In 2016 IEEE Haptics Symposium (HAPTICS). 134--139.",
      "doi": ""
    },
    {
      "text": "William R Provancher. 2014. Creating greater VR immersion by emulating force feedback with ungrounded tactile feedback. IQT Quarterly 6, 2 (2014), 18--21.",
      "doi": ""
    },
    {
      "text": "Samuel B. Schorr and Allison M. Okamura. 2017. Fingertip Tactile Devices for Virtual Object Manipulation and Exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3115--3119.  ",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "Timothy M. Simon, Ross T. Smith, and Bruce H. Thomas. 2014. Wearable Jamming Mitten for Virtual Environment Haptics. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14). ACM, New York, NY, USA, 67--70.  ",
      "doi": "10.1145/2634317.2634342"
    },
    {
      "text": "Massmiliano Solazzi, Antonio Frisoli, and Massimo Bergamasco. 2010. Design of a novel finger haptic interface for contact and orientation display. In 2010 IEEE Haptics Symposium. 129--132.  ",
      "doi": "10.1109/HAPTIC.2010.5444667"
    },
    {
      "text": "Hyunyoung Song, Hrvoje Benko, Francois Guimbretiere, Shahram Izadi, Xiang Cao, and Ken Hinckley. 2011. Grips and Gestures on a Multi-touch Pen. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1323--1332.  ",
      "doi": "10.1145/1978942.1979138"
    },
    {
      "text": "Colin Swindells, Alex Unden, and Tao Sang. 2003. TorqueBAR: An Ungrounded Haptic Feedback Device. In Proceedings of the 5th International Conference on Multimodal Interfaces (ICMI '03). ACM, New York, NY, USA, 52--59.  ",
      "doi": "10.1145/958432.958445"
    },
    {
      "text": "Hong Z Tan, Xiao Dong Pang, Nathaniel I Durlach, and others. 1992. Manual resolution of length, force, and compliance. Advances in Robotics 42 (1992), 13--18.",
      "doi": ""
    },
    {
      "text": "Nikos G. Tsagarakis, T Horne, and Darwin G. Caldwell. 2005. SLIP AESTHEASIS: a portable 2D slip/skin stretch display for the fingertip. In First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics Conference. 214--219.  ",
      "doi": "10.1109/WHC.2005.117"
    },
    {
      "text": "Richard Q. van der Linde and Pien Lammertse. 2003. HapticMaster - a generic force controlled robot for human interaction. Industrial Robot: An International Journal 30, 6 (2003), 515--524.",
      "doi": ""
    },
    {
      "text": "Julie Walker, Heather Culbertson, Michael Raitor, and Allison Okamura. 2017. Haptic Orientation Guidance Using Two Parallel Double-Gimbal Control Moment Gyroscopes. IEEE Transactions on Haptics PP, 99 (2017), 1--1.",
      "doi": ""
    },
    {
      "text": "Bob G. Witmer and Michael J. Singer. 1998. Measuring Presence in Virtual Environments: A Presence Questionnaire. Presence: Teleoperators and Virtual Environments 7, 3 (1998), 225--240.  ",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Bing Wu, Roberta L. Klatzky, and Ralph L. Hollis. 2011. Force, Torque, and Stiffness: Interactions in Perceptual Discrimination. IEEE Transactions on Haptics 4, 3 (July 2011), 221--228.  ",
      "doi": "10.1109/TOH.2011.3"
    },
    {
      "text": "Vibol Yem, Ryuta Okazaki, and Hiroyuki Kajimoto. 2016. FinGAR: Combination of Electrical and Mechanical Stimulation for High-fidelity Tactile Presentation. In ACM SIGGRAPH 2016 Emerging Technologies (SIGGRAPH '16). ACM, New York, NY, USA, Article 7, 2 pages.  ",
      "doi": "10.1145/2929464.2929474"
    },
    {
      "text": "Andre Zenner and Antonio Kruger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (April 2017), 1285--1294.  ",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "Igor Zubrycki and Grzegorz Granosik. 2017. Novel Haptic Device Using Jamming Principle for Providing Kinaesthetic Feedback in Glove-Based Control Interface. Journal of Intelligent & Robotic Systems 85, 3 (01 Mar 2017), 413--429.  ",
      "doi": "10.1007/s10846-016-0392-6"
    }
  ]
}