{
  "doi": "10.1145/3173574.3173647",
  "title": "Group vs Individual: Impact of TOUCH and TILT Cross-Device Interactions on Mixed-Focus Collaboration",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Cross-device environments (XDEs) have been developed to support a multitude of collaborative activities. Yet, little is known about how different cross-device interaction techniques impact group collaboration, including how their impact on independent and joint work that often occurs during group work. In this work, we explore the impact of two XDE data browsing techniques: TOUCH and TILT. Through a mixed-methods study of a collaborative sensemaking task, we show that TOUCH and TILT have distinct impacts on how groups accomplish, and shift between, independent and joint work. Finally, we reflect on these findings and how they can more generally inform the design of XDEs.",
  "authors": [
    {
      "name": "Leila Homaeian",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210004",
      "orcid": "missing"
    },
    {
      "name": "Nippun Goyal",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83059089557",
      "orcid": "missing"
    },
    {
      "name": "James R. Wallace",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81311486022/rel-imgonly/4016_portrait_-_oct_2013_-_small.jpg",
      "acmid": "81311486022",
      "orcid": "missing"
    },
    {
      "name": "Stacey D. Scott",
      "institution": "University of Waterloo & University of Guelph, Guelph, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100544371",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton, and Tony D. DeRose. 1993. Toolglass and magic lenses: the see-through interface. In Proceedings of the 20th annual conference on Computer graphics and interactive techniques, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Christophe Bortolaso, Matthew Oskamp, Greg Phillips, Carl Gutwin, and T. C. Nicholas Graham. 2014. The effect of view techniques on collaboration and awareness in tabletop map-based tasks. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS'14), 79--88.  ",
      "doi": "10.1145/2669485.2669504"
    },
    {
      "text": "Christophe Bortolaso, Matthew Oskamp, T. C. Graham, and Doug Brown. 2013. OrMiS: a tabletop interface for simulation-based training. In Proceedings of the ACM international conference on Interactive tabletops and surfaces (ITS'13), 145--154.  ",
      "doi": "10.1145/2512349.2512792"
    },
    {
      "text": "Richard E. Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Susan E. Brennan, Klaus Mueller, Greg Zelinsky, I. V. Ramakrishnan, David S. Warren, and Arie Kaufman. 2006. Toward a Multi-Analyst, Collaborative Framework for Visual Analytics. In IEEE Symposium On Visual Analytics Science And Technology (VAST'06), 129--136.",
      "doi": ""
    },
    {
      "text": "Frederik Brudy, Steven Houben, Nicolai Marquardt, and Yvonne Rogers. 2016. CurationSpace: CrossDevice Content Curation Using Instrumental Interaction. In Proceedings of the ACM on Interactive Surfaces and Spaces (ISS'16), 159--168.  ",
      "doi": "10.1145/2992154.2992175"
    },
    {
      "text": "Olivier Chapuis Can Liu, Michel Beaudouin-Lafon, and Eric Lecolinet. 2016. Shared interaction on a wallsized display in a data manipulation task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 2075--2086.  ",
      "doi": "10.1145/2858036.2858039"
    },
    {
      "text": "Canadian Sea Ice Service. Latest ice conditions. Available: https://www.ec.gc.ca/glaces-ice/",
      "doi": ""
    },
    {
      "text": "Apoorve Chokshi, Teddy Seyed, Francisco Marinho Rodrigues, and Frank Maurer. 2014. ePlan MultiSurface: A Multi-Surface Environment for Emergency Response Planning Exercises. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS'14), 219--228.  ",
      "doi": "10.1145/2669485.2669520"
    },
    {
      "text": "Andy Cockburn, Amy Karlson, and Benjamin B. Bederson. 2009. A review of overview+ detail, zooming, and focus+ context interfaces. ACM Computing Surveys. 41, 1: 2:1--2:31.  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Raimund Dachselt, and Robert Buchholz. 2009. Natural throw and tilt interaction between mobile phones and distant displays. In Extended Abstracts of the SIGCHI Conference on Human factors in Computing Systems (EA CHI'09), 3253--3258.  ",
      "doi": "10.1145/1520340.1520467"
    },
    {
      "text": "Sebastian Doeweling, Tarik Tahiri, Philipp Sowinski, Benedikt Schmidt, and Mohammadreza Khalilbeigi. 2013. Support for collaborative situation analysis and planning in crisis management teams using interactive tabletops. In Proceedings of the ACM international conference on Interactive tabletops and surfaces (ITS'13), 273--282.  ",
      "doi": "10.1145/2512349.2512823"
    },
    {
      "text": "Nippun Goyal. 2016. Investigating Data Exploration Techniques Involving Map Based Geotagged Data in a Collaborative Sensemaking Environment. Master of Applied Sciences. Systems Design Engineering, University of Waterloo, Waterloo, ON, Canada.",
      "doi": ""
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 1998. Design for individuals, design for groups: tradeoffs between power and workspace awareness. In Proceedings of the ACM conference on Computer supported cooperative work (CSCW '98), 207--216.  ",
      "doi": "10.1145/289444.289495"
    },
    {
      "text": "Carl. Gutwin and Saul. Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Computer Supported Cooperative Work (CSCW). 11, 3: 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Kasper Hornbæk, Benjamin B. Bederson, and Catherine Plaisant. 2002. Navigation patterns and usability of zoomable user interfaces with and without an overview. ACM Transactions on Computer-Human Interaction (TOCHI). 9, 4: 362--389.  ",
      "doi": "10.1145/586081.586086"
    },
    {
      "text": "Petra Isenberg, Danyel Fisher, Sharoda A. Paul, Meredith Ringel Morris, Kori Inkpen, and Mary Czerwinski. 2012. Co-Located Collaborative Visual Analytics around a Tabletop Display. IEEE Transactions on Visualization and Computer Graphics. 18, 5: 689--702.  ",
      "doi": "10.1109/TVCG.2011.287"
    },
    {
      "text": "Petra Isenberg, Sheelegh Carpendale, Anastasia Bezerianos, Nathalie Henry, and Jean-Daniel Fekete. 2009. Collaborative Retrofitting for Information Visualization. IEEE Computer Graphics and Applications. 29, 5: 44--57.  ",
      "doi": "10.1109/MCG.2009.78"
    },
    {
      "text": "Petra Isenberg, Tobias Isenberg, Tobias Hesselmann, Bongshin Lee, Ulrich Von Zadow, and Anthony Tang. 2013. Data visualization on interactive surfaces: A research agenda. IEEE Computer Graphics and Applications. 33, 2: 16--24.  ",
      "doi": "10.1109/MCG.2013.24"
    },
    {
      "text": "Waqas Javed, Sohaib Ghani, and Niklas Elmqvist. 2012. Polyzoom: multiscale and multifocus exploration in 2d visual spaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 287--296.  ",
      "doi": "10.1145/2207676.2207716"
    },
    {
      "text": "Narges Mahyar, Kelly J. Burke, Jialiang Ernest Xiang, Siyi Cathy Meng, Kellogg S. Booth, Cynthia L. Girling, and Ronald W. Kellett. 2016. UD Co-Spaces: A Table-Centred Multi-Display Environment for Public Engagement in Urban Design Charrettes. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS'16), 109--118.  ",
      "doi": "10.1145/2992154.2992163"
    },
    {
      "text": "Will McGrath, Brian Bowman, David McCallum, Juan David Hincapié-Ramos, Niklas Elmqvist, and Pourang Irani. 2012. Branch-explore-merge: facilitating real-time revision control in collaborative visual exploration. In Proceedings of the ACM international conference on Interactive tabletops and surfaces (ITS'12), 235--244.  ",
      "doi": "10.1145/2396636.2396673"
    },
    {
      "text": "Meredith Ringel Morris, Jarrod Lombardo, and Daniel Wigdor. 2010. WeSearch: supporting collaborative search and sensemaking on a tabletop display. In Proceedings of the ACM conference on Computer supported cooperative work (CSCW'10), 401--410.  ",
      "doi": "10.1145/1718918.1718987"
    },
    {
      "text": "National Snow and Ice Data Center. Available: https://nsidc.org/",
      "doi": ""
    },
    {
      "text": "Geoff Norman. 2010. Likert scales, levels of measurement and the ?laws\" of statistics. Advances in health sciences education. 15, 5: 625--632.",
      "doi": ""
    },
    {
      "text": "Peter Pirolli and Stuart Card. 2005. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. In Proceedings of International Conference on Intelligence Analysis, 2--4. http://dx.doi.org/citeulikearticle-id:4452695.",
      "doi": ""
    },
    {
      "text": "Christopher Plaue and John Stasko. 2009. Presence & placement: exploring the benefits of multiple shared displays on an intellective sensemaking task. In Proceedings of the ACM international conference on Supporting group work (GROUP'09), 179--188.  ",
      "doi": "10.1145/1531674.1531701"
    },
    {
      "text": "Yvonne Rogers and Siân Lindley. 2004. Collaborating around vertical and horizontal large interactive displays: which way is best? Interacting with Computers. 16, 6: 1133--1152.",
      "doi": ""
    },
    {
      "text": "Jochen Huber Roman Lissermann, Martin Schmitz, Jürgen Steimle, and Max Mühlhäuser. 2014. Permulin: mixed-focus collaboration on multi-view tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3191--3200.  ",
      "doi": "10.1145/2556288.2557405"
    },
    {
      "text": "Daniel M. Russell, Mark J. Stefik, Peter Pirolli, and Stuart K. Card. 1993. The cost structure of sensemaking. In Proceedings of the INTERACT'93 and CHI'93 conference on Human factors in computing systems, 269--276. ",
      "doi": "10.5555/164632.164922"
    },
    {
      "text": "Stacey D. Scott, and Sheelagh Carpendale. 2010. Theory of tabletop territoriality. In Tabletopshorizontal interactive displays. HCI Series. Springer, 357--385.",
      "doi": ""
    },
    {
      "text": "Teddy Seyed, Mario Costa Sousa, Frank Maurer, and Anthony Tang. 2013. SkyHunter: a multi-surface environment for supporting oil and gas exploration. In Proceedings of the ACM international conference on Interactive tabletops and surfaces (ITS'13), 15--22.  ",
      "doi": "10.1145/2512349.2512798"
    },
    {
      "text": "Robert Spence and Mark Witkowski. 2013. Rapid serial visual presentation: design for cognition. Springer Science & Business Media. ",
      "doi": "10.5555/2484625"
    },
    {
      "text": "Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative coupling over tabletop displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'06), 1181--1190.  ",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "Edward Tse, Jonathan Histon, Stacey D. Scott, and Saul Greenberg. 2004. Avoiding interference: how people use spatial separation and partitioning in SDG workspaces. In ACM conference on Computer supported cooperative work (CSCW '04), 252--261.  ",
      "doi": "10.1145/1031607.1031647"
    },
    {
      "text": "Stephen Voida, Matthew Tobiasz, Julie Stromer, Petra Isenberg, and Sheelagh Carpendale. 2009. Getting practical with interactive tabletop displays: designing for dense data, \"fat fingers,\" diverse interactions, and face-to-face collaboration. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS'09), 109--116.  ",
      "doi": "10.1145/1731903.1731926"
    },
    {
      "text": "James R. Wallace, Stacey D. Scott, and Carolyn G. MacGregor. 2013. Collaborative sensemaking on a digital tabletop and personal tablets: prioritization, comparisons, and tableaux. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13), 3345--3354.  ",
      "doi": "10.1145/2470654.2466458"
    },
    {
      "text": "James R. Wallace, Stacey D. Scott, Eugene Lai, and Deon Jajalla. 2011. Investigating the role of a large, shared display in multi-display environments. Computer Supported Cooperative Work 20, 6: 529561.  ",
      "doi": "10.1007/s10606-011-9149-8"
    },
    {
      "text": "James R. Wallace, Stacey D. Scott, Taryn Stutz, Tricia Enns, and Kori Inkpen. 2009. Investigating teamwork and taskwork in single- and multi-display groupware systems. Personal Ubiquitous Comput. 13, 8: 569581.  ",
      "doi": "10.1007/s00779-009-0241-8"
    },
    {
      "text": "Anna Wu, and Xiaolong Zhang. 2009. Supporting collaborative sensemaking in map-based emergency management and planning. In Proceedings of the ACM international conference on Supporting group work (GROUP'09), 395--396.  ",
      "doi": "10.1145/1531674.1531741"
    },
    {
      "text": "Ji Soo Yi, Youn-ah Kang, John T. Stasko, and Julie A. Jacko. 2008. Understanding and characterizing insights: how do people gain insights using information visualization? In Proceedings of the 2008 Workshop on BEyond time and errors: novel evaLuation methods for Information Visualization, 16.  ",
      "doi": "10.1145/1377966.1377971"
    },
    {
      "text": "Ulrich von Zadow, Wolfgang Büschel, Ricardo Langner, and Raimund Dachselt. 2014. SleeD: Using a Sleeve Display to Interact with Touch-sensitive Display Walls. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS'14), 129--138.  ",
      "doi": "10.1145/2669485.2669507"
    },
    {
      "text": "Johannes Zagermann, Ulrike Pfeil, Roman Rädle, Hans-Christian Jetter, Clemens Klokmose, and Harald Reiterer. 2016. When tablets meet tabletops: The effect of tabletop size on around-the-table collaboration with personal tablets. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI'16), 5470--5481.  ",
      "doi": "10.1145/2858036.2858224"
    }
  ]
}