{
  "doi": "10.1145/3173574.3173870",
  "title": "\"Play PRBLMS\": Identifying and Correcting Less Accessible Content in Voice Interfaces",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Voice interfaces often struggle with specific types of named content. Domain-specific terminology and naming may push the bounds of standard language, especially in domains like music where artistic creativity extends beyond the music itself. Artists may name themselves with symbols (e.g. M S C RA) that most standard automatic speech recognition (ASR) systems cannot transcribe. Voice interfaces also experience difficulty surfacing content whose titles include non-standard spellings, symbols or other ASCII characters in place of English letters, or are written using a non-standard dialect. We present a generalizable method to detect content that current voice interfaces underserve by leveraging differences in engagement across input modalities. Using this detection method, we develop a typology of content types and linguistic practices that can make content hard to surface. Finally, we present a process using crowdsourced annotations to make underserved content more accessible.",
  "authors": [
    {
      "name": "Aaron Springer",
      "institution": "Spotify & University of California, Santa Cruz, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210635",
      "orcid": "missing"
    },
    {
      "name": "Henriette Cramer",
      "institution": "Spotify, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487965",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahmed Ali, Walid Magdy, Peter Bell, and Steve Renais. 2015. Multi-reference WER for evaluating ASR for languages with no orthographic rules. In Automatic Speech Recognition and Understanding (ASRU), 2015 IEEE Workshop on, 576--580.",
      "doi": ""
    },
    {
      "text": "Leif Azzopardi and Vishwa Vinay. 2008. Accessibility in information retrieval. In European Conference on Information Retrieval, 482--489. Retrieved September 18, 2017 from http://link.springer.com/chapter/10.1007/978--3--54078646--7_46 ",
      "doi": "10.5555/1793274.1793333"
    },
    {
      "text": "Ricardo Baeza-Yates. 2016. Data and algorithmic bias in the web. 1--1.  ",
      "doi": "10.1145/2908131.2908135"
    },
    {
      "text": "Catherine T. Best, Jason A. Shaw, and Elizabeth Clancy. 2013. Recognizing words across regional accents: the role of perceptual assimilation in lexical competition. In INTERSPEECH, 14th. Retrieved September 18, 2017 from http://www.academia.edu/download/45189070/Recogn izing_words_across_regional_accent20160428--2462216pjop6.pdf",
      "doi": ""
    },
    {
      "text": "Su Lin Blodgett, Lisa Green, and Brendan O'Connor. 2016. Demographic dialectal variation in social media: A case study of African-American English. arXiv preprint arXiv:1608.08868. Retrieved September 6, 2017 from https://arxiv.org/abs/1608.08868",
      "doi": ""
    },
    {
      "text": "D. Can, E. Cooper, A. Sethy, C. White, B. Ramabhadran, and M. Saraclar. 2009. Effect of pronounciations on OOV queries in spoken term detection. In 2009 IEEE International Conference on Acoustics, Speech and Signal Processing, 3957--3960.  ",
      "doi": "10.1109/ICASSP.2009.4960494"
    },
    {
      "text": "Pu-Jen Cheng, Jei-Wen Teng, Ruei-Cheng Chen, JenqHaur Wang, Wen-Hsiang Lu, and Lee-Feng Chien. 2004. Translating unknown queries with web corpora for cross-language information retrieval. 146.",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-intended Functions of Emojis in US Messaging. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16), 504-- 509.  ",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Michelle Cutajar, Joseph Micallef, Owen Casha, Ivan Grech, and Edward Gatt. 2013. Comparative study of automatic speech recognition techniques. IET Signal Processing 7, 1: 25--46.",
      "doi": ""
    },
    {
      "text": "Cecelia Cutler. 2007. Hip-Hop Language in Sociolinguistics and Beyond. Language and Linguistics Compass 1, 5: 519--538.",
      "doi": ""
    },
    {
      "text": "Sender Dovchin. 2011. Performing identity through language: The local practices of urban youth populations in post-socialist Mongolia. Inner Asia: 315--333.",
      "doi": ""
    },
    {
      "text": "Steven Feld and Aaron Fox. 1994. Music and Language. Annual Review of Anthropology 23: 25--53.",
      "doi": ""
    },
    {
      "text": "Aaron A. Fox. 2004. Real Country: Music and Language in Working-Class Culture. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Sharon Goldwater, Dan Jurafsky, and Christopher D. Manning. 2010. Which words are hard to recognize? Prosodic, lexical, and disfluency factors that increase speech recognition error rates. Speech Communication 52, 3: 181--200.",
      "doi": ""
    },
    {
      "text": "Masataka Goto, Katunobu Itou, Koji Kitayama, and Tetsunori Kobayashi. 2004. Speech-recognition interfaces for music information retrieval: 'speech completion' and speech spotter. In In Proceedings of the 5th International Conference on Music Information Retrieval (ISMIR 2004, 403--408.",
      "doi": ""
    },
    {
      "text": "Emilio Granell and Carlos-D. Martínez-Hinarejos. 2016. A Multimodal Crowdsourcing Framework for Transcribing Historical Handwritten Documents. In Proceedings of the 2016 ACM Symposium on Document Engineering (DocEng '16), 157--163.  ",
      "doi": "10.1145/2960811.2960815"
    },
    {
      "text": "Ido Guy. 2016. Searching by Talking: Analysis of Voice Queries on Mobile Web Search. 35--44.  ",
      "doi": "10.1145/2911451.2911525"
    },
    {
      "text": "M. W. Hahn and R. A. Bentley. 2003. Drift as a mechanism for cultural change: an example from baby names. Proceedings of the Royal Society B: Biological Sciences 270, Suppl_1: S120--S123.",
      "doi": ""
    },
    {
      "text": "Timothy J. Hazan and Issam Bazzi. 2001. A comparison and combination of methods for OOV word detection and word confidence scoring. In Acoustics, Speech, and Signal Processing, 2001. Proceedings.(ICASSP'01). 2001 IEEE International Conference on, 397--400.",
      "doi": ""
    },
    {
      "text": "Caroline Henton. 2005. Bitter pills to swallow. ASR and TTS have drug problems. International Journal of Speech Technology 8, 3: 247--257.",
      "doi": ""
    },
    {
      "text": "Anna Jørgensen, Dirk Hovy, and Anders Søgaard. 2015. Challenges of studying and processing dialects in social media. In Proceedings of the Workshop on Noisy User-generated Text, 9--18. Retrieved September 7, 2017 from http://www.aclweb.org/anthology/W15-",
      "doi": ""
    },
    {
      "text": "Sarvnaz Karimi, Falk Scholer, and Andrew Turpin. 2011. Machine transliteration survey. ACM Computing Surveys 43, 3: 1--46.  ",
      "doi": "10.1145/1922649.1922654"
    },
    {
      "text": "Daniel Kessler. Raising Our Common Voice For The Web. Internet Citizen. Retrieved September 18, 2017 from https://blog.mozilla.org/internetcitizen/2017/06/19/co mmonvoice",
      "doi": ""
    },
    {
      "text": "William J. Kountz. 1899. Billy Baxter's Letters. Duquesne Distributing Company.",
      "doi": ""
    },
    {
      "text": "Peter Ladefoged and Keith Johnson. 2014. A Course in Phonetics. Cengage Learning, Stamford, CT.",
      "doi": ""
    },
    {
      "text": "Antoine Laurent, Sylvain Meignier, and Paul Deléglise. 2014. Improving recognition of proper nouns in ASR through generating and filtering phonetic transcriptions. Computer Speech & Language 28, 4: 979--996.",
      "doi": ""
    },
    {
      "text": "Steve Lawrence and C. Lee Giles. 2000. Accessibility of information on the web. intelligence 11, 1: 32--39.  ",
      "doi": "10.1145/333175.333181"
    },
    {
      "text": "Daniel Luzzati, Cyril Grouin, Ioana Vasilescu, Martine Adda-Decker, Eric Bilinski, Nathalie Camelin, Juliette Kahn, Carole Lailler, Lori Lamel, and Sophie Rosset. 2014. Human Annotation of ASR Error Regions: is \"gravity\" a Sharable Concept for Human Annotators? European Language Resources Association (ELRA). Retrieved from https://hal.archives-ouvertes.fr/hal01134802",
      "doi": ""
    },
    {
      "text": "Hao Ma, Raman Chandrasekar, Chris Quirk, and Abhishek Gupta. 2009. Page Hunt: Improving Search Engines Using Human Computation Games. In Proceedings of the 32Nd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '09), 746--747.  ",
      "doi": "10.1145/1571941.1572108"
    },
    {
      "text": "Rishabh Mehrotra, Ashton Anderson, Fernando Diaz, Amit Sharma, Hanna Wallach, and Emine Yilmaz. 2017. Auditing Search Engines for Differential Satisfaction Across Demographics. arXiv:1705.10689 {cs}.  ",
      "doi": "10.1145/3041021.3054197"
    },
    {
      "text": "Andrew Moody and Yuko Matsumoto. 2003. \"Don't Touch My Moustache\": Language Blending and Code Ambiguation by Two J-Pop Artists. Asian Englishes 6, 1: 4--33.",
      "doi": ""
    },
    {
      "text": "Kenneth Olmstead. Voice assistants used by 46% of Americans, mostly on smartphones | Pew Research Center. Retrieved January 5, 2018 from http://www.pewresearch.org/facttank/2017/12/12/nearly-half-of-americans-use-digitalvoice-assistants-mostly-on-their-smartphones/",
      "doi": ""
    },
    {
      "text": "Aasish Pappu, Teruhisa Misu, and Rakesh Gupta. 2016. Investigating Critical Speech Recognition Errors in Spoken Short Messages. In Situated Dialog in Speech-Based Human-Computer Interaction. Springer, Cham, 71--82.",
      "doi": ""
    },
    {
      "text": "Carolina Parada, Mark Dredze, Denis Filimonov, and Frederick Jelinek. 2010. Contextual Information Improves OOV Detection in Speech. In Human Language Technologies: The 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics (HLT '10), 216--224. Retrieved January 5, 2018 from http://dl.acm.org/citation.cfm?id=1857999.1858024 ",
      "doi": "10.5555/1857999.1858024"
    },
    {
      "text": "Carolina Parada, Abhinav Sethy, Mark Dredze, and Frederick Jelinek. 2010. A spoken term detection framework for recovering out-of-vocabulary words using the web. In Eleventh Annual Conference of the International Speech Communication Association.",
      "doi": ""
    },
    {
      "text": "Manuel Perea, Jon Andoni Duñabeitia, and Manuel Carreiras. 2008. R34D1NG W0RD5 W1TH NUMB3R5. Journal of Experimental Psychology: Human Perception and Performance 34, 1: 237--241.",
      "doi": ""
    },
    {
      "text": "Antoine Raux. 2008. Flexible turn-taking for spoken dialog systems. Language Technologies Institute, Carnegie Mellon University Dec 12. Retrieved September 16, 2017 from http://www.cs.cmu.edu/afs/cs/Web/People/antoine/thes is_antoine.pdf",
      "doi": ""
    },
    {
      "text": "Attapol T. Rutherford, Fuchun Peng, and Françoise Beaufays. 2014. Pronunciation learning for namedentities through crowd-sourcing. In Fifteenth Annual Conference of the International Speech Communication Association. Retrieved August 11, 2017 from https://mazsola.iit.unimiskolc.hu/~czap/letoltes/IS14/IS2014/PDF/AUTHOR /IS140902.PDF",
      "doi": ""
    },
    {
      "text": "Mark Savage. 2012. BBC Sound of 2013: Chvrches. BBC News. Retrieved September 18, 2017 from http://www.bbc.com/news/entertainment-arts-",
      "doi": ""
    },
    {
      "text": "Kurt Schwitters. 1923. w88888888. Drachtster Courant.",
      "doi": ""
    },
    {
      "text": "Rachael Tatman. 2017. Gender and Dialect Bias in YouTube's Automatic Captions. EACL 2017: 53.",
      "doi": ""
    },
    {
      "text": "Erik R. Thomas. 2007. Phonological and Phonetic Characteristics of African American Vernacular English. Language and Linguistics Compass 1, 5: 450-- 475.",
      "doi": ""
    },
    {
      "text": "Crispin Thurlow and Alex Brown. 2003. Generation Txt? The sociolinguistics of young people's textmessaging. Discourse analysis online 1, 1: 30.",
      "doi": ""
    },
    {
      "text": "Angela Watercutter. Crazy Characters Help Indie Bands Outsmart Google. WIRED. Retrieved January 5, 2018 from https://www.wired.com/2011/01/pl_music_ungoogle/",
      "doi": ""
    },
    {
      "text": "Ewald van der Westhuizen and Thomas Niesler. 2016. Automatic Speech Recognition of English-isiZulu Code-switched Speech from South African Soap Operas. Procedia Computer Science 81: 121--127.",
      "doi": ""
    },
    {
      "text": "W. Xiong, J. Droppo, X. Huang, F. Seide, M. Seltzer, A. Stolcke, D. Yu, and G. Zweig. 2016. Achieving Human Parity in Conversational Speech Recognition. arXiv:1610.05256 {cs}. Retrieved from http://arxiv.org/abs/1610.05256",
      "doi": ""
    },
    {
      "text": "Emre Yılmaz, Henk van den Heuvel, and David van Leeuwen. 2016. Investigating Bilingual Deep Neural Networks for Automatic Recognition of Codeswitching Frisian Speech. Procedia Computer Science 81: 159--166.",
      "doi": ""
    },
    {
      "text": "State of the U.S. Online Retail Economy in Q1 2017. comScore, Inc. Retrieved September 18, 2017 from http://www.comscore.com/Insights/Presentations-andWhitepapers/2017/State-of-the-US-Online-RetailEconomy-in-Q1--2017",
      "doi": ""
    },
    {
      "text": "What Does \"Lit\" Mean? | Merriam-Webster. Retrieved September 18, 2017 from https://www.merriamwebster.com/words-at-play/lit-meaning-origin",
      "doi": ""
    }
  ]
}