{
  "doi": "10.1145/3173574.3174015",
  "title": "PEP (3D Printed Electronic Papercrafts): An Integrated Approach for 3D Sculpting Paper-Based Electronic Devices",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We present PEP (Printed Electronic Papercrafts), a set of design and fabrication techniques to integrate electronic based interactivities into printed papercrafts via 3D sculpting. We explore the design space of PEP, integrating four functions into 3D paper products: actuation, sensing, display, and communication, leveraging the expressive and technical opportunities enabled by paper-like functional layers with a stack of paper. We outline a seven-step workflow, introduce a design tool we developed as an add-on to an existing CAD environment, and demonstrate example applications that combine the electronic enabled functionality, the capability of 3D sculpting, and the unique creative affordances by the materiality of paper.",
  "tags": [
    "prototyping",
    "paper electronics",
    "paper craft",
    "fabrication techniques",
    "3d sculpting"
  ],
  "authors": [
    {
      "name": "Hyunjoo Oh",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658684885",
      "orcid": "0000-0001-8661-9426"
    },
    {
      "name": "Tung D. Ta",
      "institution": "University of Tokyo, Hongo, Bunkyo-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-99658745887/rel-imgonly/face_black_round_copy.png",
      "acmid": "99658745887",
      "orcid": "missing"
    },
    {
      "name": "Ryo Suzuki",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-99659155646/rel-imgonly/profile.jpg",
      "acmid": "99659155646",
      "orcid": "0000-0003-3294-9555"
    },
    {
      "name": "Mark D. Gross",
      "institution": "University of Colorado, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81330491589/rel-imgonly/mdg_head_photo_closeup.jpg",
      "acmid": "81330491589",
      "orcid": "missing"
    },
    {
      "name": "Yoshihiro Kawahara",
      "institution": "University of Tokyo, Hongo, Bunkyo-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100423171/rel-imgonly/bb10347-2.jpg",
      "acmid": "81100423171",
      "orcid": "0000-0002-0310-2577"
    },
    {
      "name": "Lining Yao",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261439",
      "orcid": "0000-0002-8842-2317"
    }
  ],
  "references": [
    {
      "text": "Adafruit PN532 NFC/RFID Controller Shield: https://www.adafruit.com/product/789",
      "doi": ""
    },
    {
      "text": "Arduino Capacitive Sensing Library: https://playground.arduino.cc/Main/CapacitiveSensor",
      "doi": ""
    },
    {
      "text": "Autodesk Fusion 360: https://www.autodesk.com/products/fusion-360/",
      "doi": ""
    },
    {
      "text": "Bare Conductive: https://www.bareconductive.com",
      "doi": ""
    },
    {
      "text": "Moritz Bächer, Benjamin Hepp, Fabrizio Pece, Paul G. Kry, Bernd Bickel, Bernhard Thomaszewski, and Otmar Hilliges. 2016. DefSense: Computational Design of Customized Deformable Input Devices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3806--3816.  ",
      "doi": "10.1145/2858036.2858354"
    },
    {
      "text": "ChemCubed: http://www.chemcubed.com/",
      "doi": ""
    },
    {
      "text": "Chibitronics: https://chibitronics.com/",
      "doi": ""
    },
    {
      "text": "Circuitscribe: https://www.circuitscribe.com/",
      "doi": ""
    },
    {
      "text": "Electroluminescent kits: http://www.gwent.org/gem_electroluminescent_kit.html",
      "doi": ""
    },
    {
      "text": "Elephantech: https://www.elephantech.co.jp/en/",
      "doi": ""
    },
    {
      "text": "ENSON silver conductive glue HE-HE-6106B8: https://www.aliexpress.com/item/Silver-Conductive-02ML-Glue-Wire-Electrically-Paste-Adhesive-Paint-PCBRepair-U/32767831630.html",
      "doi": ""
    },
    {
      "text": "Nan-Wei Gong, Amit Zoran, and Joseph A. Paradiso. 2013. Inkjet-printed conductive patterns for physical manipulation of audio signals. In Proceedings of the adjunct publication of the 26th annual ACM symposium on User interface software and technology (UIST '13 Adjunct). ACM, New York, NY, USA, 1314.  ",
      "doi": "10.1145/2508468.2514932"
    },
    {
      "text": "Nan-Wei Gong, Jürgen Steimle, Simon Olberding, Steve Hodges, Nicholas Edward Gillian, Yoshihiro Kawahara, and Joseph A. Paradiso. 2014. PrintSense: a versatile sensing technique to support multimodal flexible surface interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 14071410.  ",
      "doi": "10.1145/2556288.2557173"
    },
    {
      "text": "Felix Heibeck, Basheer Tome, Clark Della Silva, and Hiroshi Ishii. 2015. uniMorph: Fabricating Thin Film Composites for Shape-Changing Interfaces. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 233--242.  ",
      "doi": "10.1145/2807442.2807472"
    },
    {
      "text": "High-Low Tech Paper Speakers: http://highlowtech.org/?p=1372",
      "doi": ""
    },
    {
      "text": "Steve Hodges, Nicolas Villar, Nicholas Chen, Tushar Chugh, Jie Qi, Diana Nowacka, and Yoshihiro Kawahara. 2014. Circuit stickers: peel-and-stick construction of interactive electronic prototypes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1743--1746.  ",
      "doi": "10.1145/2556288.2557150"
    },
    {
      "text": "Scott E. Hudson. 2014. Printing teddy bears: a technique for 3D printing of soft interactive objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 459--468.  ",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant inkjet circuits: lab-based inkjet printing to support rapid prototyping of UbiComp devices. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, New York, NY, USA, 363--372.  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "David Ledo, Fraser Anderson, Ryan Schmidt, Lora Oehlberg, Saul Greenberg, and Tovi Grossman. 2017. Pineal: Bringing Passive Objects to Life with Embedded Mobile Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 25832593.  ",
      "doi": "10.1145/3025453.3025652"
    },
    {
      "text": "Malcolm McCollough. 1996. Abstracting Craft: The Practiced Digital Hand. The MIT Press. ",
      "doi": "10.5555/524384"
    },
    {
      "text": "Mcor IRIS Printer: http://www.mcortechnologies.com/3d-printers/iris/",
      "doi": ""
    },
    {
      "text": "Mod Podge: https://plaidonline.com/brands/mod-podge",
      "doi": ""
    },
    {
      "text": "Kenichi Nakahara, Koya Narumi, Ryuma Niiyama and Yoshihiro Kawahara. 2017. Electric phase-change actuator with inkjet printed flexible circuit for printable and integrated robot prototyping. In Proceedings of the 2017 IEEE International Conference on Robotics and Automation (ICRA), Singapore. 1856--1863.",
      "doi": "10.1109/ICRA.2017.7989217"
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: fabricating highly customizable thin-film touch-displays. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 281--290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio: Digital Fabrication of Interactive and Shape-Changing Objects with Foldable Printed Electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 223--232.  ",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "Huaishu Peng, Jennifer Mankoff, Scott E. Hudson, and James McCann. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1789--1798.  ",
      "doi": "10.1145/2702123.2702327"
    },
    {
      "text": "Varun Perumal C and Daniel Wigdor. 2016. Foldem: Heterogeneous Object Fabrication via Selective Ablation of Multi-Material Sheets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5765--5775.  ",
      "doi": "10.1145/2858036.2858135"
    },
    {
      "text": "Jie Qi and Leah Buechley. 2010. Electronic popables: exploring paper-based computing through an interactive pop-up book. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (TEI '10). ACM, New York, NY, USA, 121--128.  ",
      "doi": "10.1145/1709886.1709909"
    },
    {
      "text": "Michael L. Rivera, Melissa Moukperian, Daniel Ashbrook, Jennifer Mankoff, and Scott E. Hudson. 2017. Stretching the Bounds of 3D Printing with Embedded Textiles. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 497--508.  ",
      "doi": "10.1145/3025453.3025460"
    },
    {
      "text": "Greg Saul, Cheng Xu, and Mark D. Gross. 2010. Interactive paper devices: end-user design & fabrication. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (TEI '10). ACM, New York, NY, USA, 205--212.  ",
      "doi": "10.1145/1709886.1709924"
    },
    {
      "text": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, and Max Mühlhäuser. 2017. Flexibles: Deformation-Aware 3D-Printed Tangibles for Capacitive Touchscreens. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1001--1014.  ",
      "doi": "10.1145/3025453.3025663"
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 253--258.  ",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Michael Shorter, Jon Rogers, and John McGhee. 2014. Enhancing everyday paper interactions with paper circuits. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 39--42.  ",
      "doi": "10.1145/2598510.2598584"
    },
    {
      "text": "Tung Ta, Masaaki Fukumoto, Koya Narumi, Shigeki Shino, Yoshihiro Kawahara, and Tohru Asami. 2015. Interconnection and double layer for flexible electronic circuit with instant inkjet circuits. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 181--190.  ",
      "doi": "10.1145/2750858.2804276"
    },
    {
      "text": "Nobuyuki Umetani and Ryan Schmidt. 2017. SurfCuit: Surface-Mounted Circuits on 3D Prints. In IEEE Computer Graphics and Applications. Vol. 38. No. 3.  ",
      "doi": "10.1109/MCG.2017.40"
    },
    {
      "text": "Nirzaree Vadgama and Jürgen Steimle. 2017. Flexy: Shape-Customizable, Single-Layer, Inkjet Printable Patterns for 1D and 2D Flex Sensing. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, New York, NY, USA, 153--162.  ",
      "doi": "10.1145/3024969.3024989"
    },
    {
      "text": "Alexander D. Valentine, Travis A. Busbee, John William Boley, Jordan R. Raney, Alex Chortos, Arda Kotikian, John Daniel Berrigan, Michael F. Durstock and Jennifer A. Lewis. 2017. Hybrid 3D Printing of Soft Electronics. In Advanced Materials. 1703817.",
      "doi": ""
    },
    {
      "text": "Nicolas Villar, James Scott, and Steve Hodges. 2010. Prototyping with microsoft .net gadgeteer. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11). ACM, New York, NY, USA, 377--380.  ",
      "doi": "10.1145/1935701.1935790"
    },
    {
      "text": "Voxel8: http://www.voxel8.com/",
      "doi": ""
    }
  ]
}