{
  "doi": "10.1145/3173574.3173795",
  "title": "The Role of Gamification in Participatory Environmental Sensing: A Study In the Wild",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Participatory sensing (PS) and citizen science hold promises for a genuinely interactive and inclusive citizen engagement in meaningful and sustained collection of data about social and environmental phenomena. Yet the underlying motivations for public engagement in PS remain still unclear particularly regarding the role of gamification, for which HCI research findings are often inconclusive. This paper reports the findings of an experimental study specifically designed to further understand the effects of gamification on citizen engagement. Our study involved the development and implementation of two versions (gamified and non-gamified) of a mobile application designed to capture lake ice coverage data in the sub-arctic region. Emerging findings indicate a statistically significant effect of gamification on participants' engagement levels in PS. The motivation, approach and results of our study are outlined and implications of the findings for future PS design are reflected.",
  "authors": [
    {
      "name": "Maria V. Palacin-Silva",
      "institution": "Lappeenranta University of Technology, Lappeenranta , Finland",
      "img": "/do/10.1145/contrib-99659178506/rel-imgonly/99659178506.png",
      "acmid": "99659178506",
      "orcid": "missing"
    },
    {
      "name": "Antti Knutas",
      "institution": "Dublin City University & Lappeenranta University of Technology, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84458749657",
      "orcid": "missing"
    },
    {
      "name": "Maria Angela Ferrario",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81464640980/rel-imgonly/profilepic.jpg",
      "acmid": "81464640980",
      "orcid": "missing"
    },
    {
      "name": "Jari Porras",
      "institution": "Lappeenranta University of Technology, Lappeenranta, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100093345",
      "orcid": "missing"
    },
    {
      "name": "Jouni Ikonen",
      "institution": "Lappeenranta University of Technology, Lappeenranta, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100250604",
      "orcid": "missing"
    },
    {
      "name": "Chandara Chea",
      "institution": "Lappeenranta University of Technology, Lappeenranta, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261365",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mariam Asad, Christopher A Le Dantec, Becky Nielsen, and Kate Diedrick. 2017. Creating a Sociotechnical API: Designing City-Scale Community Engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2295--2306. http://dl.acm.org/citation.cfm?id=3025963  ",
      "doi": "10.1145/3025453.3025963"
    },
    {
      "text": "Rick Bonney, Caren b Cooper, Janis Dickinson, Steve Kelling, Tina Phillips, Kenneth V Rosenberg, and Jennifer Shirk. 2009. Citizen Science: A Developing Tool for Expanding Science Knowledge and Scientific Literacy. BioScience 59, 11 (2009), 977 -- 984. http:// bioscience.oxfordjournals.org/content/59/11/977.short",
      "doi": ""
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "G Brundtland, M Khalid, S Agnelli, S Al-Athel, B Chidzero, L Fadika, V Hauff, I Lang, M Shijun, M.M de Botero, and M Singh. 1987. Our Common Future. Technical Report. 300 pages.",
      "doi": ""
    },
    {
      "text": "Jeffrey A Burke, D Estrin, Mark Hansen, Andrew Parker, Nithya Ramanathan, Sasank Reddy, and Mani B Srivastava. 2006. Participatory sensing. In WSW'06 at SenSys '06. ACM, Colorado, USA. http://sensys.acm.org/2006/",
      "doi": ""
    },
    {
      "text": "Alan Chamberlain, Mark Paxton, Kevin Glover, Martin Flintham, Dominic Price, Chris Greenhalgh, Steve Benford, Peter Tolmie, Eiman Kanjo, Amanda Gower, Andy Gower, Dawn Woodgate, and Danaë Stanton Fraser. 2013. Understanding mass participatory pervasive computing systems for environmental campaigns. Personal and Ubiquitous Computing (2013), 1--18.  ",
      "doi": "10.1007/s00779-013-0756-x"
    },
    {
      "text": "Jason Chilvers, Irene Lorenzoni, Geraldine Terry, Paul Buckley, John K Pinnegar, and Stefan Gelcich. 2014. Public engagement with marine climate change issues : ( Re ) framings, understandings and responses. Global Environmental Change 29 (2014), 165--179.",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popovi´ c, and others. 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (2010), 756--760.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2012. Motivation, personality, and development within embedded social contexts: An overview of self-determination theory. The Oxford handbook of human motivation (2012), 85--107.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding. 2014. Eudaimonic Design, or: Six Invitations to Rethink Gamification. SSRN Scholarly Paper ID 2466374. Social Science Research Network, Rochester, NY. https://papers.ssrn.com/abstract=2466374",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From Game Design Elements to Gamefulness: Defining \"Gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, New York, NY, USA, 9--15.  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Darina Dicheva, Christo Dichev, Gennady Agre, and Galia Angelova. 2015. Gamification in education: A systematic mapping study. Educational Technology & Society 18, 3 (2015), 75--88.",
      "doi": ""
    },
    {
      "text": "Janis L. Dickinson, Jennifer Shirk, David Bonter, Rick Bonney, Rhiannon L. Crain, Jason Martin, Tina Phillips, and Karen Purcell. 2012. The current state of citizen science as a tool for ecological research and public engagement. Frontiers in Ecology and the Environment 10, 6 (2012), 291--297.",
      "doi": ""
    },
    {
      "text": "Sheena Erete and Jennifer O Burrell. 2017. Empowered Participation: How Citizens Use Technology in Local Governance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2307--2319.  ",
      "doi": "10.1145/3025453.3025996"
    },
    {
      "text": "Enrique Estelles-Arolas and Fernando Gonzalez-Ladron-de Guevara. 2012. Towards an integrated crowdsourcing definition. Journal of Information Science 38, 2 (2012), 189--200. http://jis.sagepub.com/content/38/2/189.full.pdf+html  ",
      "doi": "10.1177/0165551512437638"
    },
    {
      "text": "Deborah Estrin, K Mani Chandy, R Michael Young, Larry Smarr, Andrew Odlyzko, David Clark, Viviane Reding, Toru Ishida, Sharad Sharma, Vinton G Cerf, and others. 2010. Participatory sensing: applications and architecture {internet predictions}. IEEE Internet Computing 14, 1 (2010), 12--42.  ",
      "doi": "10.1109/MIC.2010.12"
    },
    {
      "text": "Derek Foster, Mark Blythe, Paul Cairns, and Shaun Lawson. 2010. Competitive carbon counting: can social networking sites make saving energy more enjoyable?. In CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 4039--4044.  ",
      "doi": "10.1145/1753846.1754099"
    },
    {
      "text": "Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, Jennifer Mankoff, Sunny Consolvo, Beverly Harrison, and James A Landay. 2009. UbiGreen: investigating a mobile tool for tracking and supporting green transportation habits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1043--1052.  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Mohammad Gharesifard and Uta Wehn. 2016. To share or not to share: Drivers and barriers for sharing data via online amateur weather networks. Journal of Hydrology 535 (2016), 181--190.",
      "doi": ""
    },
    {
      "text": "Benjamin Gnauk, Lars Dannecker, and Martin Hahmann. 2012. Leveraging gamification in demand dispatch systems. In Proceedings of the 2012 Joint EDBT/ICDT workshops. ACM, 103--110.  ",
      "doi": "10.1145/2320765.2320799"
    },
    {
      "text": "Jeffrey Goldman, Katie Shilton, Jeff Burke, Deborah Estrin, Mark Hansen, Nithya Ramanathan, Sasank Reddy, and Vids Samanta. 2009. Participatory Sensing: A citizen-powered approach to illuminating the patterns that shape our world. Technical Report May. UCLA's Center for Embedded Networked Sensing.",
      "doi": ""
    },
    {
      "text": "Connie Golsteijn, Sarah Gallacher, Licia Capra, and Yvonne Rogers. 2016. Sens-Us: Designing Innovative Civic Technology for the Public Good. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 39--49. http://dl.acm.org/citation.cfm?id=2901877  ",
      "doi": "10.1145/2901790.2901877"
    },
    {
      "text": "J. Hamari, J. Koivisto, and H. Sarsa. 2014. Does Gamification Work? -- A Literature Review of Empirical Studies on Gamification. In 2014 47th Hawaii International Conference on System Sciences (HICSS). 3025--3034.  ",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Eric Hand. 2010. People Power. Nature 466, 5 (2010), 685 -- 687.",
      "doi": ""
    },
    {
      "text": "Mike Harding, Bran Knowles, Nigel Davies, and Mark Rouncefield. 2015. HCI, Civic Engagement & Trust. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2833--2842.  ",
      "doi": "10.1145/2702123.2702255"
    },
    {
      "text": "Mike Hazas and James Scott. 2012. Sustainability Does Not Begin with the Individual. Interactions 19, 5 (2012), 14--17. http://dl.acm.org/citation.cfm?id=2334189  ",
      "doi": "10.1145/2334184.2334189"
    },
    {
      "text": "Scott Heggen. 2013. Participatory sensing: repurposing a scientific tool for STEM education. interactions 20, 1 (2013), 18--21.  ",
      "doi": "10.1145/2405716.2405722"
    },
    {
      "text": "Mike Hulme. 2010. Problems with making and governing global kinds of knowledge. Global Environmental Change 20, 4 (2010), 558--564.",
      "doi": ""
    },
    {
      "text": "Kai Huotari and Juho Hamari. 2012. Defining Gamification: A Service Marketing Perspective. In Proceeding of the 16th International Academic MindTrek Conference (MindTrek '12). ACM, New York, NY, USA, 17--22.  ",
      "doi": "10.1145/2393132.2393137"
    },
    {
      "text": "Bran Knowles. 2013. Re-Imagining Persuasion : Designing for Self-Transcendence. (2013). http://dl.acm.org/citation.cfm?id=2479498  ",
      "doi": "10.1145/2468356.2479498"
    },
    {
      "text": "Bran Knowles, Lynne Blair, Paul Coulton, and Mark Lochrie. 2014. Rethinking Plan A for Sustainable HCI. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 3593--3596. http://dl.acm.org/citation.cfm?id=2557311  ",
      "doi": "10.1145/2556288.2557311"
    },
    {
      "text": "Bran Knowles and Janet Davis. 2017. Is Sustainability a Special Case for Persuasion ? Interacting with Computers 29, 1 (2017), 58--70.",
      "doi": ""
    },
    {
      "text": "Johanna Korhonen and Eliisa Haavanlammi. 2012. Hydrologinen vuosikirja 2006--2010/Hydrological Yearbook 2006--2010. (2012).",
      "doi": ""
    },
    {
      "text": "Raph Koster. 2013. Theory of fun for game design. \" O'Reilly Media, Inc.\". ",
      "doi": "10.5555/2601678"
    },
    {
      "text": "James R. Lewis. 1995. IBM computer usability satisfaction questionnaires: psychometric evaluation and instructions for use. International Journal of Human-Computer Interaction 7, 1 (1995), 57--78.  ",
      "doi": "10.1080/10447319509526110"
    },
    {
      "text": "Yefeng Liu, Todorka Alexandrova, and Tatsuo Nakajima. 2011. Gamifying intelligent environments. In Proceedings of the 2011 international ACM workshop on Ubiquitous meta user interfaces. ACM, 7--12.  ",
      "doi": "10.1145/2072652.2072655"
    },
    {
      "text": "John Markoff. 2010. In a Video Game, Tackling the Complexities of Protein Folding. (2010). http: //www.nytimes.com/2010/08/05/science/05protein.html",
      "doi": ""
    },
    {
      "text": "Aaron D Mason, Georgios Michalakidis, and Paul J Krause. 2012. Tiger nation: Empowering citizen scientists. In Digital Ecosystems Technologies (DEST), 2012 6th IEEE International Conference on. IEEE, 1--5.",
      "doi": ""
    },
    {
      "text": "Elaine Massung, David Coyle, Kirsten F Cater, Marc Jay, and Chris Preist. 2013. Using crowdsourcing to support pro-environmental community activism. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 371--380.  ",
      "doi": "10.1145/2470654.2470708"
    },
    {
      "text": "Tanushree Mitra, Clayton J Hutto, and Eric Gilbert. 2015. Comparing person-and process-centric strategies for obtaining quality data on amazon mechanical turk. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1345--1354.  ",
      "doi": "10.1145/2702123.2702553"
    },
    {
      "text": "Andreas Möller, Matthias Kranz, Barbara Schmid, Luis Roalter, and Stefan Diewald. 2013. Investigating self-reporting behavior in long-term studies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2931--2940.  ",
      "doi": "10.1145/2470654.2481406"
    },
    {
      "text": "B. Morschheuser, J. Hamari, and J. Koivisto. 2016. Gamification in Crowdsourcing: A Review. In 2016 49th Hawaii International Conference on System Sciences (HICSS). 4375--4384.  ",
      "doi": "10.1109/HICSS.2016.543"
    },
    {
      "text": "Lennart E. Nacke and Sebastian Deterding. 2017a. The maturing of gamification research. Computers in Human Behavior 71 (June 2017), 450--454.",
      "doi": ""
    },
    {
      "text": "Lennart E. Nacke and Sebastian Deterding. 2017b. The maturing of gamification research. Computers in Human Behavior 71, Supplement C (2017), 450 -- 454.",
      "doi": ""
    },
    {
      "text": "Timothy Nyerges, Michael Barndt, and Kerry Brooks. 2006. Public Participation Geographic Information Systems. Annals of the Association of American Geographers Volume 96, Smith (2006), 224--233.",
      "doi": ""
    },
    {
      "text": "Chris Preist, Elaine Massung, and David Coyle. 2014. Competing or aiming to be average?: normification as a means of engaging digital volunteers. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 1222--1233.  ",
      "doi": "10.1145/2531602.2531615"
    },
    {
      "text": "Mark S Reed. 2008. Stakeholder participation for environmental management : A literature review. 1 (2008).",
      "doi": ""
    },
    {
      "text": "Andrew Rollings and Ernest (Ernest W.) Adams. 2003. Andrew Rollings and Ernest Adams on game design. New Riders. 621 pages. ",
      "doi": "10.5555/1213088"
    },
    {
      "text": "Joel Ross. 2011. Pervasive Negabehavior Games for Environmental Sustainability. In CHI'11. ACM, Vancouver, 1085--1088.  ",
      "doi": "10.1145/1979742.1979694"
    },
    {
      "text": "Sonia Royo, Ana Yetano, and Basilio Acerete. 2011. E-participation and climate change: Are local governments actively promoting responsible behaviors and offering opportunities for citizen involvement? Proceedings of the Annual Hawaii International Conference on System Sciences (2011), 2462--2471.  ",
      "doi": "10.1109/HICSS.2012.248"
    },
    {
      "text": "Elizabeth B-N Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. Co-design 4, 1 (2008), 5--18.",
      "doi": ""
    },
    {
      "text": "Katie Seaborn and Deborah I. Fels. 2015. Gamification in theory and action: A survey. International Journal of Human-Computer Studies 74 (Feb. 2015), 14--31.  ",
      "doi": "10.1016/j.ijhcs.2014.09.006"
    },
    {
      "text": "Six Silberman, Eli Blevis, Elaine Huang, Bonnie Nardi, Lisa Nathan, Daniela Busse, Chris Preist, and Samuel Mann. 2014. What Have We Learned ? A SIGCHI HCI & Sustainability Workshop. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 143--146. http://dl.acm.org/citation.cfm?id=2559238  ",
      "doi": "10.1145/2559206.2559238"
    },
    {
      "text": "Yolande Strengers. 2014. Smart energy in everyday life: Are you designing for resource man? Interactions 21, 4 (2014), 24--31. http://dl.acm.org/citation.cfm?id=2621931  ",
      "doi": "10.1145/2621931"
    },
    {
      "text": "Sonia Talwar, Arnim Wiek, and John Robinson. 2011. User engagement in sustainability research. Science and Public Policy 38, 5 (2011), 379--390.",
      "doi": ""
    },
    {
      "text": "UNECE. 1998. Aarhus Convention: Convention on Access to Information, Public Participation in Decision-making and Access to Justice in Environmental Matters. Aarus Convention June (1998), 25.",
      "doi": ""
    },
    {
      "text": "United Nations. 1992a. Agenda 21. In United Nations Conference on Environment & Development Rio de Janerio. 351.",
      "doi": ""
    },
    {
      "text": "United Nations. 1992b. RIO DECLARATION ON ENVIRONMENT AND DEVELOPMENT. (1992). http://www.un.org/documents/ga/conf151/ aconf15126--1annex1.htm",
      "doi": ""
    },
    {
      "text": "University of Washington. 2014. Foldit game engages the public in research. (2014). https://www.engr.washington.edu/news/trend/aut10",
      "doi": ""
    },
    {
      "text": "Rob van Roy and Bieke Zaman. 2015. Moving Beyond the Effectiveness of Gamification. In CHI '15 workshop 'Researching Gamification: Strategies, Opportunities, Challenges, Ethics'. Seoul, South Korea.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh. 2000. Determinants of perceived ease of use: Integrating control, intrinsic motivation, and emotion into the technology acceptance model. Information systems research 11, 4 (2000), 342--365.  ",
      "doi": "10.1287/isre.11.4.342.11872"
    },
    {
      "text": "Viswanath Venkatesh, Michael G. Morris, Gordon B. Davis, and Fred D. Davis. 2003. User Acceptance of Information Technology: Toward a Unified View. MIS Quarterly 27, 3 (2003), 425--478. ",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Vasilis Vlachokyriakos, Eric Gordon, Clara Crivellaro, Pete Wright, Christopher Le Dantec, and Patrick Olivier. 2016. Digital civics: Citizen empowerment with and through technology. In Proceedings of the 2016 CHI conference extended abstracts on human factors in computing systems. ACM, San Jose, CA, 1096--1099. http://dl.acm.org/citation.cfm?id=2886436  ",
      "doi": "10.1145/2851581.2886436"
    },
    {
      "text": "Uta Wehn, Maria Rusca, Jaap Evers, and Vitavesca Lanfranchi. 2015. Participation in flood risk management and the potential of citizen observatories: A governance analysis. Environmental Science & Policy 48 (2015), 225--236.",
      "doi": ""
    },
    {
      "text": "Eric N Wiebe, Allison Lamb, Megan Hardy, and David Sharek. 2014. Measuring engagement in video game-based environments: Investigation of the User Engagement Scale. Computers in Human Behavior 32 (2014), 123--132.",
      "doi": ""
    },
    {
      "text": "Maximilian Witt, Christian Scheiner, and Susanne Robra-Bissantz. 2011. Gamification of online idea competitions: Insights from an explorative case. Informatik schafft Communities 192 (2011).",
      "doi": ""
    },
    {
      "text": "Claes Wohlin, Per Runeson, Martin Höst, Magnus C Ohlsson, Björn Regnell, and Anders Wesslén. 2012. Experimentation in software engineering. Springer Science & Business Media. ",
      "doi": "10.5555/2349018"
    },
    {
      "text": "Gabe Zichermann and Christopher. Cunningham. 2011. Gamification by design : implementing game mechanics in web and mobile apps. O'Reilly Media. 182 pages. ",
      "doi": "10.5555/2073550"
    }
  ]
}