{
  "doi": "10.1145/3173574.3174125",
  "title": "Tangible Tens: Evaluating a Training of Basic Numerical Competencies with an Interactive Tabletop",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Basic numerical competencies developed in kindergarten form the foundations of math achievement. This indicates the importance of early interventions in the case of numerical difficulties. Building on research on math manipulatives and tangible interfaces, we developed a training of basic numerical competencies using an interactive tabletop in combination with physical LEGO-like blocks. In an experiment, we evaluated the effectiveness of the training on children's learning of the partner number concept, basic numerical competencies and number line estimation, compared to a content-wise similar training with physical manipulatives and a human tutor. We observed significant increases in children's understanding of the partner number concept and basic numerical competencies in both training conditions, but no differential training effects. As children can play on the interactive surface with reasonable autonomy, it seems to provide a low threshold possibility to enrich kindergarten education on numerical concepts.",
  "authors": [
    {
      "name": "Taciana Pontual Falcão",
      "institution": "UFRPE, Recife, Pernambuco, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453661414",
      "orcid": "missing"
    },
    {
      "name": "Tanja Dackermann",
      "institution": "Leibniz-Institut für Wissensmedien, Tuebingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261346",
      "orcid": "missing"
    },
    {
      "name": "Madeleine Schüler",
      "institution": "Leibniz-Institut für Wissensmedien, Tuebingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261622",
      "orcid": "missing"
    },
    {
      "name": "Christine Ulrich",
      "institution": "Leibniz-Institut für Wissensmedien, Tuebingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658770626",
      "orcid": "missing"
    },
    {
      "name": "Andre Klemke",
      "institution": "Leibniz-Institut für Wissensmedien, Tuebingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260990",
      "orcid": "missing"
    },
    {
      "name": "Korbinian Moeller",
      "institution": "Leibniz-Institut für Wissensmedien, Tuebingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467650238",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arthur J. Baroody. 2006. Why children have difficulties mastering the basic number combinations and how to help them. Teaching Children Mathematics 13, 1 (August 2006), 22--31.",
      "doi": ""
    },
    {
      "text": "Lawrence W. Barsalou 2010. Grounded cognition: Past, present, and future. Topics in Cognitive Science 2, 4: 716--724.",
      "doi": ""
    },
    {
      "text": "Jerome S. Bruner. 1974. Entwurf einer Unterrichtstheorie. Berlin Verlag.",
      "doi": ""
    },
    {
      "text": "Brian Butterworth. 2005. The development of arithmetical abilities. Journal of Child Psychology and Psychiatry and Allied Disciplines 46, 1: 3--18.",
      "doi": ""
    },
    {
      "text": "Brian Butterworth, Sashank Varma, and Diana Laurillard. 2011. Dyscalculia: From Brain to Education. Science 332, 6033: 1049--1053.",
      "doi": ""
    },
    {
      "text": "Kira J. Carbonneau, Scott C. Marley, and James P. Selig. 2013. A meta-analysis of the efficacy of teaching mathematics with concrete manipulatives. Journal of Educational Psychology 105, 2: 380--400.",
      "doi": ""
    },
    {
      "text": "Sébastien Cuendet, Engin Bumbacher, and Pierre Dillenbourg. 2012. Tangible vs. virtual representations: when tangibles benefit the training of spatial skills. In Proceedings of the 7th Nordic Conference on HumanComputer Interaction: Making Sense Through Design (NordiCHI '12). ACM, New York, NY, USA, 99--108.  ",
      "doi": "10.1145/2399016.2399032"
    },
    {
      "text": "Tanja Dackermann, Ursula Fischer, Hans-Christoph Nuerk, Ulrike Cress, and Korbinian Moeller. 2017. Applying embodied cognition: from useful interventions and their theoretical underpinnings to practical applications. ZDM Mathematics Education 49, 4: 545557.",
      "doi": ""
    },
    {
      "text": "Pierre Dillenbourg and Michael Evans. 2011. Interactive tabletops in education. International Journal of Computer-Supported Collaborative Learning 6, 4: 491--514.",
      "doi": ""
    },
    {
      "text": "John Dewey. 2001. Democracy and Education. Pennsylvania State University Press.",
      "doi": ""
    },
    {
      "text": "Catherine T. Fosnot and Maarten Dolk. 2001. Young mathematicians at work: Constructing number sense, addition, and subtraction. Heinemann.",
      "doi": ""
    },
    {
      "text": "Sergio Garrido-Jurado, Rafael Muñoz-Salinas, Francisco J. Madrid-Cuevas, and Manuel .J. MarínJiménez. 2014. Automatic generation and detection of highly reliable fiducial markers under occlusion. Pattern Recognition 47, 6 (June 2014), 2280--2292.  ",
      "doi": "10.1016/j.patcog.2014.01.005"
    },
    {
      "text": "Arthur M. Glenberg. 2010. Embodiment as a unifying perspective for psychology. Wiley interdisciplinary reviews, Cognitive science, 1, 4 (July/August 2010), 586--596.",
      "doi": ""
    },
    {
      "text": "Camilla K. Gilmore, Shannon E. McCarthy, and Elizabeth Spelke. 2010. Non-symbolic arithmetic abilities and mathematics achievement in the first year of formal schooling. Cognition 115, 3 (June 2010), 394--406.",
      "doi": ""
    },
    {
      "text": "Robert L. Goldstone, and Ji Y. Son. 2005. The Transfer of Scientific Principles Using Concrete and Idealized Simulations. The Journal of the Learning Sciences, 14, 1: 69--110.",
      "doi": ""
    },
    {
      "text": "Jean Gross, Colin Hudson, and Daniel Price. 2009. The long-term costs of numeracy difficulties. Every Child a Chance Trust and KPMG Foundation.",
      "doi": ""
    },
    {
      "text": "Jane M. Healy. 1998. Failure to Connect: How Computers Affect Our Children's Minds. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Eva Hornecker and Jacob Buur. 2006. Getting a grip on tangible interaction: a framework on physical space and social interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), ACM, New York, NY, USA, 437--446.  ",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Elena Ise and Gerd Schulte-Korne. 2013. Symptomatik, Diagnostik und Behandlung der Rechenstörung. Zeitschrift fur Kinder- und Jugendpsychiatrie und Psychotherapie 41, 4: 271--282.",
      "doi": ""
    },
    {
      "text": "Graham A. Jones, Carol A. Thornton, Ian J. Putt, Kevin M. Hill, A. Timothy Mogill, Beverly S. Rich, and Laura R. Van Zoest. 1996. Multidigit number sense: A framework for instruction and assessment. Journal for Research in Mathematics Education 27, 3: 310--336.",
      "doi": ""
    },
    {
      "text": "Nancy C. Jordan and Susan C. Levine. 2009. Socioeconomic variation, number competence, and mathematics learning difficulties in young children. Developmental disabilities research reviews 15, 1: 6068.",
      "doi": ""
    },
    {
      "text": "Nancy C. Jordan, David Kaplan, Chaitanya Ramineni, and Maria N. Locuniak. 2009. Early math matters: kindergarten number competence and later mathematics outcomes. Developmental Psychology 45, 3: 850--867.",
      "doi": ""
    },
    {
      "text": "Alan S. Kaufman, Nadine L. Kaufman, Peter Melchers, and Martin Melchers. 2015. KABC-II: Kaufman Assessment Battery for Children - II. Pearson.",
      "doi": ""
    },
    {
      "text": "Rina Kim and Lillie R. Albert. 2014. The history of base-ten blocks: Why and who made base-ten blocks? Mediterranean Journal of Social Sciences 5, 9 (May 2014), 356--365.",
      "doi": ""
    },
    {
      "text": "Meijke E. Kolkman, Evelyn H. Kroesbergen, Paul P. M. Leseman. 2013. Early numerical development and the role of non-symbolic and symbolic skills. Learning and Instruction 25 (June 2013), 95--103.",
      "doi": ""
    },
    {
      "text": "Helga Krinzinger, Liane Kaufmann, Ann Dowker, Gemma Thomas, Martina Graf, Hans-Christoph Nuerk, and Klaus Willmes. 2007. Deutschsprachige Version des Fragebogens für Rechenangst (FRA) für 6- bis 9jährige Kinder. Zeitschrift fur Kinder- und Jugendpsychiatrie und Psychotherapie 35, 5: 341--351.",
      "doi": ""
    },
    {
      "text": "Silke Ladel and Ulrich Kortenkamp. 2013. An activitytheoretic approach to multi-touch tools in early mathematics learning. International Journal of Technology in Mathematics Education 20, 1: 1--6.",
      "doi": ""
    },
    {
      "text": "Geroge Lakoff and Rafael E. Núñez. 2000. Where Mathematics Comes From: How the Embodied Mind Brings Mathematics into Being. Basic Books.",
      "doi": ""
    },
    {
      "text": "Kristin K. Lamberty. 2007. Getting and keeping children engaged with constructionist design tool for craft and mathematics. PhD dissertation, Georgia Institute of Technology, Atlanta, GA. ",
      "doi": "10.5555/1329860"
    },
    {
      "text": "Dorota Lembrér and Tamsin Meaney. 2016. Preschool Children Learning Mathematical Thinking on Interactive Tables. In Mathematics Education in the Early Years, Tamsin Meaney, Ola Helenius, Maria L. Johansson, Troels Lange, and Anna Wernberg (eds.). Springer International Publishing Switzerland.",
      "doi": ""
    },
    {
      "text": "Friederike Lenart, Hubert Schaupp, and Norbert Holzer. 2014. Eggenberger Rechentest 0+: Diagnostikum für Dyskalkulie-Disposition für das Ende des Kindergartenalters bis Mitte der 1. Schulstufe. Huber.",
      "doi": ""
    },
    {
      "text": "Tanja Link, Korbinian Moeller, Stefan Huber, Ursula Fischer, and Hans-Christoph Nuerk. 2013. Walk the number line -- An embodied training of numerical concepts. Trends in Neuroscience and Education 2, 2 (June 2013), 74--84.",
      "doi": ""
    },
    {
      "text": "Andrew Manches. 2011. Digital manipulatives: tools to transform early learning experiences. Int. J. Technology Enhanced Learning 3, 6 (February 2011), 608--626.  ",
      "doi": "10.1504/IJTEL.2011.045451"
    },
    {
      "text": "Andrew Manches, Claire O'Malley, and Steve Benford. 2010. The role of physical representations in solving number problems: A comparison of young children's use of physical and virtual materials. Computers&Education 54, 3 (April 2010), 622--640.  ",
      "doi": "10.1016/j.compedu.2009.09.023"
    },
    {
      "text": "Taylor Martin and Daniel L. Schwartz. 2005. Physically distributed learning: adapting and reinterpreting physical environments in the development of fraction concepts. Cognitive Science 29, 4: 587--625.",
      "doi": ""
    },
    {
      "text": "Nicole M. McNeil and Linda Jarvin. 2007. When theories don't add up: Disentangling the manipulatives debate. Theory into Practice 46, 4: 309--316.",
      "doi": ""
    },
    {
      "text": "Korbinian Moeller, Ursula Fischer, Hans-Christoph Nuerk, and Ulrike Cress. 2015. Computers in mathematics education - Training the mental number line. Computers in Human Behavior 48 (July 2015), 597--607.  ",
      "doi": "10.5555/2781900.2782083"
    },
    {
      "text": "Maria Montessori. 2012. Psychoarithmetik: Die Arithmetik dargestellt unter Berücksichtigung kinderpsychologischer Erfahrungen während 25 Jahren. Gesammelte Werke / Maria Montessori: Vol. 11. Herder.",
      "doi": ""
    },
    {
      "text": "Patricia S. Moyer. 2001. Are we having fun yet? How teachers use manipulatives to teach mathematics. Educational Studies in mathematics 47, 2: 175--197.",
      "doi": ""
    },
    {
      "text": "National Governors Association Center for Best Practices&Council of Chief State School Officers. 2010. Common core state standards for mathematics. Washington.",
      "doi": ""
    },
    {
      "text": "Hans-Christoph Nuerk, Martina Graf, and Klaus Willmes. 2006. Grundlagen der Zahlenverarbeitung und des Rechnens. Sprache Stimme Gehör 30, 4: 147--153.",
      "doi": ""
    },
    {
      "text": "Claire O'Malley and Danae S. Fraser. 2004. Literature review in learning with tangible technologies. NESTA Futurelab (12). Retrieved October 2016 from https://telearn.archives-ouvertes.fr/hal-00190328",
      "doi": ""
    },
    {
      "text": "Samantha Parsons and John Bynner. 2005. Does numeracy matter more? National Research and Development Centre for Adult Literacy and Numeracy.",
      "doi": ""
    },
    {
      "text": "Taciana Pontual Falcão, Luciano Meira, and Alex Sandro Gomes. 2007. Designing tangible interfaces for mathematics learning in elementary school. In Proceedings of III Latin American conference on Human-Computer Interaction (CLIHC'07).",
      "doi": ""
    },
    {
      "text": "Sara Price, Yvonne Rogers, Mike Scaife, Danae Stanton, and H Neale. 2003. Using 'tangibles' to promote novel forms of playful learning. Interacting with Computers 15, 2: 169--185.",
      "doi": ""
    },
    {
      "text": "Francis Quek, Chreston Miller, Anurodh Joshi, Yannick Verdie, R Ehrich, M Evans, Sharon Chu Yew Yee, and P Chakraborty. 2010. TanTab, A Tangram Tabletop System. In Proceedings of the Annual Conference on Computer Graphics (ACM SIGGRAPH'10).",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, Fred Martin, Robert Berg, Rick Borovoy, Vanessa Colella, Kwin Kramer, and Brian Silverman. 1998. Digital manipulatives: new toys to think with. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 281--287.  ",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Jochen Rick and Yvonne Rogers. From DigiQuilt to DigiTile: Adapting educational technology to a multitouch table. 2008. In Proceedings of the 3rd IEEE International Workshop on TABLETOP 2008: Horizontal Interactive Human Computer Systems, 1--3 Oct 2008, Amsterdam, Netherlands, IEEE Computer Society, pp. 79--86.",
      "doi": ""
    },
    {
      "text": "Mike Scaife and Yvonne Rogers. 2005. External cognition, innovative technologies, and effective learning. In Cognition, Education and Communication Technology, Peter Gardenfors and Peter Johansson (eds.). Lawrence Erlbaum Associates, Hillsdale, NJ, 181--202.",
      "doi": ""
    },
    {
      "text": "Lori L. Scarlatos. 2006. Tangible math. Interactive Technology and Smart Education 3, 4: 293--309.",
      "doi": ""
    },
    {
      "text": "Tony Scarlatos and Lori L. Scarlatos. 2006. Tangible math applications. Retrieved October 2016 from: https://xserv.mm.cs.sunysb.edu/TS/research/Math.pdf",
      "doi": ""
    },
    {
      "text": "Robert S. Siegler and Julie L. Booth. 2004. Development of numerical estimation in young children. Child Development 75, 2: 428--444.",
      "doi": ""
    },
    {
      "text": "Robert S. Siegler and David W. Braithwaite. 2017. Numerical development. Annual Review of Psychology 68, 187--213.",
      "doi": ""
    },
    {
      "text": "Bieke Zaman, Vero Vanden Abeele, Panos Markopoulos, and Paul Marshall. 2012. Editorial: the evolving field of tangible interaction for children: the challenge of empirical validation. Personal Ubiquitous Computing 16, 4 (April 2012), 367--378.  ",
      "doi": "10.1007/s00779-011-0409-x"
    }
  ]
}