{
  "doi": "10.1145/3173574.3173929",
  "title": "Revisiting \"The Rise and Decline\" in a Population of Peer Production Projects",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-7",
  "year": 2018,
  "badges": [],
  "abstract": "Do patterns of growth and stabilization found in large peer production systems such as Wikipedia occur in other communities? This study assesses the generalizability of Halfaker et al.'s influential 2013 paper on \"The Rise and Decline of an Open Collaboration System.\" We replicate its tests of several theories related to newcomer retention and norm entrenchment using a dataset of hundreds of active peer production wikis from Wikia. We reproduce the subset of the findings from Halfaker and colleagues that we are able to test, comparing both the estimated signs and magnitudes of our models. Our results support the external validity of Halfaker et al.'s claims that quality control systems may limit the growth of peer production communities by deterring new contributors and that norms tend to become entrenched over time.",
  "tags": [
    "online communities",
    "retention",
    "quality control",
    "wikipedia",
    "governance",
    "replication",
    "peer production",
    "wikis"
  ],
  "authors": [
    {
      "name": "Nathan TeBlunthuis",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131179",
      "orcid": "missing"
    },
    {
      "name": "Aaron Shaw",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81479644451/rel-imgonly/shaw_aaron-nu-headshot-2012-cropped2.jpg",
      "acmid": "81479644451",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ajay Agrawal, Christian Catalini, and Avi Goldfarb. 2014. Some Simple Economics of Crowdfunding. Innovation Policy and the Economy 14, 1 (2014), 63--97.",
      "doi": ""
    },
    {
      "text": "Yochai Benkler. 2002. Coase's Penguin, or, Linux and the Nature of the Firm. Yale Law Journal 112, 3 (2002), 369--446.",
      "doi": ""
    },
    {
      "text": "Yochai Benkler, Aaron Shaw, and Benjamin Mako Hill. 2015. Peer Production: A Form of Collective Intelligence. In Handbook of Collective Intelligence, Thomas W. Malone and Michael S. Bernstein (Eds.). MIT Press, Cambridge, Massachusetts, 175--204.",
      "doi": ""
    },
    {
      "text": "Kenneth Bollen, John T. Cacioppo, Robert M. Kaplan, Jon A. Krosnick, James L. Olds, and Heather Dean. 2015. Social, Behavioral, and Economic Sciences Perspectives on Robust and Reliable Science. Technical Report. National Science Foundation.",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Tarleton Gillespie. 2016. What Is a Flag for? Social Media Reporting Tools and the Vocabulary of Complaint. New Media & Society 18, 3 (March 2016), 410--428.",
      "doi": ""
    },
    {
      "text": "Kevin Crowston, Kangning Wei, James Howison, and Andrea Wiggins. 2008. Free/Libre Open-Source Software Development: What We Know and What We Do Not Know. Comput. Surveys 44, 2 (March 2008), 7:1--7:35.  ",
      "doi": "10.1145/2089125.2089127"
    },
    {
      "text": "Andrea Forte, Vanesa Larco, and Amy Bruckman. 2009. Decentralization in Wikipedia Governance. J. Manage. Inf. Syst. 26, 1 (2009), 49--72.  ",
      "doi": "10.2753/MIS0742-1222260103"
    },
    {
      "text": "Jo Freeman. 1972. The Tyranny of Structurelessness. Berkeley Journal of Sociology 17 (Jan. 1972), 151--164.",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger, Aaron Halfaker, Maryana Pinchuk, and Steven Walling. 2012. Defense Mechanism or Socialization Tactic? Improving Wikipedia's Notifications to Rejected Contributors. In Proceedings of the Sixth International AAAI Conference on Weblogs and Social Media. AAAI Publications, Dublin, Ireland, 122--129.",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger and David Ribes. 2010. The Work of Sustaining Order in Wikipedia: The Banning of a Vandal. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, New York, 117--126.  ",
      "doi": "10.1145/1718918.1718941"
    },
    {
      "text": "Aaron Halfaker, R. Stuart Geiger, Jonathan T. Morgan, and John Riedl. 2013. The Rise and Decline of an Open Collaboration System: How Wikipedia's Reaction to Popularity Is Causing Its Decline. American Behavioral Scientist 57, 5 (May 2013), 664--688.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, and John Riedl. 2011. Don't Bite the Newbies: How Reverts Affect the Quantity and Quality of Wikipedia Work. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11). ACM, New York, New York, 163--172.  ",
      "doi": "10.1145/2038558.2038585"
    },
    {
      "text": "Michael T. Hannan and John Freeman. 1977. The Population Ecology of Organizations. Amer. J. Sociology 82, 5 (1977), 929--964.",
      "doi": ""
    },
    {
      "text": "Benjamin Mako Hill and Aaron Shaw. 2017. Studying Populations of Online Communities. In Oxford Handbook of Networked Communication, Sandra González-Bailón and Brooke Foucault Welles (Eds.). Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk, Søren S. Sander, Javier Andrés Bargas-Avila, and Jakob Grue Simonsen. 2014. Is Once Enough?: On the Extent and Content of Replications in Human-Computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, New York, 3523--3532.  ",
      "doi": "10.1145/2556288.2557004"
    },
    {
      "text": "Aniket Kittur and Robert E. Kraut. 2010. Beyond Wikipedia: Coordination and Conflict in Online Production Groups. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, New York, 215--224.  ",
      "doi": "10.1145/1718918.1718959"
    },
    {
      "text": "Piotr Konieczny. 2009. Governance, Organization, and Democracy on the Internet: The Iron Law and the Evolution of Wikipedia. Sociological Forum 24, 1 (2009), 162--192.",
      "doi": ""
    },
    {
      "text": "John W. Meyer and Brian Rowan. 1977. Institutionalized Organizations: Formal Structure as Myth and Ceremony. Amer. J. Sociology 83, 2 (Sept. 1977), 340--363.",
      "doi": ""
    },
    {
      "text": "Robert Michels. 1915. Political Parties: A Sociological Study of the Oligarchical Tendencies of Modern Democracy. Hearst, New York, NY.",
      "doi": ""
    },
    {
      "text": "Felipe Ortega. 2009. Wikipedia: A Quantitative Analysis. Ph.D. dissertation. Universidad Rey Juan Carlos, Madrid, Spain.",
      "doi": ""
    },
    {
      "text": "Leysia Palen, Robert Soden, T. Jennings Anderson, and Mario Barrenechea. 2015. Success & Scale in a Data-Producing Organization: The Socio-Technical Evolution of OpenStreetMap in Response to Humanitarian Events. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, New York, 4113--4122.  ",
      "doi": "10.1145/2702123.2702294"
    },
    {
      "text": "Camille Roth, Dario Taraborelli, and Nigel Gilbert. 2008. Measuring Wiki Viability: An Empirical Assessment of the Social Dynamics of a Large Sample of Wikis. In Proceedings of the 4th International Symposium on Wikis (WikiSym '08). ACM, New York, New York, 27:1--27:5.  ",
      "doi": "10.1145/1822258.1822294"
    },
    {
      "text": "Charles M. Schweik and Robert C. English. 2012. Internet Success: A Study of Open-Source Software Commons. MIT Press, Cambridge, Massachusetts. ",
      "doi": "10.5555/2339410"
    },
    {
      "text": "W. Richard Scott and Gerald F Davis. 2006. Organizations and Organizing: Rational, Natural and Open Systems Perspectives. Pearson Prentice Hall, Upper Saddle River, New Jersey.",
      "doi": ""
    },
    {
      "text": "Aaron Shaw and Benjamin M. Hill. 2014. Laboratories of Oligarchy? How the Iron Law Extends to Peer Production. Journal of Communication 64, 2 (2014), 215--238.",
      "doi": ""
    },
    {
      "text": "Bongwon Suh, Gregorio Convertino, Ed H. Chi, and Peter Pirolli. 2009. The Singularity Is Not Near: Slowing Growth of Wikipedia. In Proceedings of the 5th International Symposium on Wikis and Open Collaboration (WikiSym '09). ACM, New York, New York, 1--10.  ",
      "doi": "10.1145/1641309.1641322"
    },
    {
      "text": "Max L. Wilson, Wendy Mackay, Ed Chi, Michael Bernstein, Dan Russell, and Harold Thimbleby. 2011. RepliCHI - CHI Should Be Replicating and Validating Results More: Discuss. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, New York, 463--466.  ",
      "doi": "10.1145/1979742.1979491"
    }
  ]
}