{
  "doi": "10.1145/3173574.3173996",
  "title": "More Text Please! Understanding and Supporting the Use of Visualization for Clinical Text Overview",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Clinical practice is heavily reliant on the use of unstructured text to document patient stories due to its expressive and flexible nature. However, a physician's capacity to recover information from text for clinical overview is severely affected when records get longer and time pressure increases. Data visualization strategies have been explored to aid in information retrieval by replacing text with graphical summaries, though often at the cost of omitting important text features. This causes physician mistrust and limits real-world adoption. This work presents our investigation into the role and use of text in clinical practice, and reports on efforts to assess the best of both worlds---text and visualization---to facilitate clinical overview. We report on insights garnered from a field study, and the lessons learned from an iterative design process and evaluation of a text-visualization prototype, MedStory, with 14 medical professionals. The results led to a number of grounded design recommendations to guide visualization design to support clinical text overview.",
  "tags": [
    "medicine",
    "medical visualization",
    "medical narrative",
    "clinical overview",
    "text visualization",
    "user study",
    "clinical text"
  ],
  "authors": [
    {
      "name": "Nicole Sultanum",
      "institution": "University of Toronto & The Hospital for Sick Children, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479664150",
      "orcid": "missing"
    },
    {
      "name": "Michael Brudno",
      "institution": "University of Toronto & The Hospital of Sick Children, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100582628",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    },
    {
      "name": "Fanny Chevalier",
      "institution": "University of Toronto & Inria, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325488036",
      "orcid": "0000-0002-5585-7971"
    }
  ],
  "references": [
    {
      "text": "Jørgen Bansler, Erling Havn, Troels Mønsted, Kjeld Schmidt, and Jesper Hastrup Svendsen. 2013. Physicians' progress notes. In ECSCW 2013: Proceedings of the 13th European Conference on Computer Supported Cooperative Work, 21--25 September 2013, Paphos, Cyprus. Springer, 123--142.",
      "doi": ""
    },
    {
      "text": "Vijayaraghavan Bashyam, William Hsu, Emily Watt, Alex AT Bui, Hooshang Kangarloo, and Ricky K Taira. 2009. Problem-centric Organization and Visualization of Patient Imaging and Clinical Data. Radiographics 29, 2 (2009), 331--343.",
      "doi": ""
    },
    {
      "text": "Claus Bossen and Lotte Groth Jensen. 2014. How physicians 'achieve overview': a case-based study in a hospital ward. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 257--268.  ",
      "doi": "10.1145/2531602.2531620"
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "PJ Brown, JL Marquard, B Amster, M Romoser, J Friderici, S Goff, and D Fisher. 2014. What do physicians read (and ignore) in electronic progress notes? Applied clinical informatics 5, 2 (2014), 430.",
      "doi": ""
    },
    {
      "text": "Alex AT Bui, Denise R Aberle, and Hooshang Kangarloo. 2007. TimeLine: visualizing integrated patient records. IEEE Transactions on Information Technology in Biomedicine 11, 4 (2007), 462--473.  ",
      "doi": "10.1109/TITB.2006.884365"
    },
    {
      "text": "Tom Christensen and Anders Grimsmo. 2008. Instant availability of patient records, but diminished availability of patient information: a multi-method study of GP's use of electronic patient records. BMC medical informatics and decision making 8, 1 (2008), 12.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, Joey Scarr, and Sylvain Malacria. 2015. Supporting novice to expert transitions in user interfaces. ACM Computing Surveys (CSUR) 47, 2 (2015), 31.  ",
      "doi": "10.1145/2659796"
    },
    {
      "text": "Joshua C Feblowitz, Adam Wright, Hardeep Singh, Lipika Samal, and Dean F Sittig. 2011. Summarization of clinical information: a conceptual model. Journal of biomedical informatics 44, 4 (2011), 688--699.  ",
      "doi": "10.1016/j.jbi.2011.03.008"
    },
    {
      "text": "Angus Forbes, Mihai Surdeanu, Peter Jansen, and Jane Carrington. 2013. Transmitting narrative: An interactive shift-summarization tool for improving nurse communication. In Proceedings of the IEEE Workshop on Interactive Visual Text Analytics (TextVis).",
      "doi": ""
    },
    {
      "text": "The Apache Software Foundation. 2013. Apache cTAKES. (2013). http://ctakes.apache.org/",
      "doi": ""
    },
    {
      "text": "Trisha Greenhalgh and Brian Hurwitz. 1999. Narrative based medicine: Why study narrative? Bmj 318, 7175 (1999), 48--50.",
      "doi": ""
    },
    {
      "text": "Trisha Greenhalgh, Katja Stramer, Tanja Bratan, Emma Byrne, Jill Russell, and Henry WW Potts. 2010. Adoption and non-adoption of a shared electronic summary record in England: a mixed-method case study. Bmj 340 (2010), c3111.",
      "doi": ""
    },
    {
      "text": "Catalina Hallett. 2008. Multi-modal presentation of medical histories. In Proceedings of the 13th international conference on Intelligent user interfaces. ACM, 80--89.  ",
      "doi": "10.1145/1378773.1378785"
    },
    {
      "text": "Catalina Hallett, Richard Power, and Donia Scott. 2006. Summarisation and visualisation of e-health data repositories. In UK E-Science All-Hands Meeting, 18--21 Sept 2006, Nottingham, UK.",
      "doi": ""
    },
    {
      "text": "Kristiina Häyrinen, Kaija Saranto, and Pirkko Nykänen. 2008. Definition, structure, content, use and impacts of electronic health records: a review of the research literature. International journal of medical informatics 77, 5 (2008), 291--304.",
      "doi": ""
    },
    {
      "text": "Jamie S Hirsch, Jessica S Tanenbaum, Sharon Lipsky Gorman, Connie Liu, Eric Schmitz, Dritan Hashorva, Artem Ervits, David Vawdrey, Marc Sturm, and Noémie Elhadad. 2014. HARVEST, a longitudinal patient record summarizer. Journal of the American Medical Informatics Association (2014), amiajnl--2014.",
      "doi": ""
    },
    {
      "text": "Pamela Hobbs. 2003. The use of evidentiality in physicians' progress notes. Discourse Studies 5, 4 (2003), 451--478.",
      "doi": ""
    },
    {
      "text": "Robert R Hoffman, Matthew Johnson, Jeffrey M Bradshaw, and Al Underbrink. 2013. Trust in automation. IEEE Intelligent Systems 28, 1 (2013), 84--88.  ",
      "doi": "10.1109/MIS.2013.24"
    },
    {
      "text": "William Hsu, Corey W Arnold, and Ricky K Taira. 2010. A neuro-oncology workstation for structuring, modeling, and visualizing patient records. In Proceedings of the 1st ACM International Health Informatics Symposium. ACM, 837--840.  ",
      "doi": "10.1145/1882992.1883120"
    },
    {
      "text": "William Hsu, Ricky K Taira, Suzie El-Saden, Hooshang Kangarloo, and Alex AT Bui. 2012. Context-based electronic health record: toward patient specific healthcare. IEEE Transactions on information technology in biomedicine 16, 2 (2012), 228--234.  ",
      "doi": "10.1109/TITB.2012.2186149"
    },
    {
      "text": "Kathryn Montgomery Hunter. 1991. Doctors' stories: The narrative structure of medical knowledge. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "i2b2 tranSMART Foundation. 2013. Informatics for Integrating Biology & the Bedside. (2013). https://www.i2b2.org/",
      "doi": ""
    },
    {
      "text": "SNOMED International. 2002. SNOMED-CT. (2002). http://www.snomed.org/snomed-ct",
      "doi": ""
    },
    {
      "text": "Lotte Groth Jensen and Claus Bossen. 2016. Factors affecting physicians' use of a dedicated overview interface in an electronic health record: The importance of standard information and standard documentation. International journal of medical informatics 87 (2016), 44--53.",
      "doi": ""
    },
    {
      "text": "Stephen B Johnson, Suzanne Bakken, Daniel Dine, Sookyung Hyun, Eneida Mendonça, Frances Morrison, Tiffani Bright, Tielman Van Vleck, Jesse Wrenn, and Peter Stetson. 2008. An electronic health record based on structured narrative. Journal of the American Medical Informatics Association 15, 1 (2008), 54--64.",
      "doi": ""
    },
    {
      "text": "Thai Le, B Reeder, H Thompson, G Demiris, and others. 2013. Health providers' perceptions of novel approaches to visualizing integrated health information. Methods of information in medicine 52, 3 (2013), 250--258.",
      "doi": ""
    },
    {
      "text": "Steven Loria. 2013. TextBlob: Simplified Text Processing. (2013). https://textblob.readthedocs.io",
      "doi": ""
    },
    {
      "text": "Troels Mønsted. 2015. Keeping Distributed Care Together: Medical Summaries Reconsidered. In ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19--23 September 2015, Oslo, Norway. Springer, 143--161.",
      "doi": ""
    },
    {
      "text": "Troels Mønsted, Madhu C Reddy, and Jørgen P Bansler. 2011. The use of narratives in medical work: a field study of physician-patient consultations. In ECSCW 2011: Proceedings of the 12th European Conference on Computer Supported Cooperative Work, 24--28 September 2011, Aarhus Denmark. Springer, 81--100.",
      "doi": ""
    },
    {
      "text": "Glenn Munkvold and Monica Divitini. 2006. From storytelling to reporting-converted narratives. In Proceedings of MCIS'06, the Mediterranean Conference on Information Systems.",
      "doi": ""
    },
    {
      "text": "Else Nygren and Peter Henriksson. 1992. Reading the medical record. I. Analysis of physician's ways of reading the medical record. Computer methods and programs in biomedicine 39, 1 (1992), 1--12.",
      "doi": ""
    },
    {
      "text": "Julian Oates, W Wayne Weston, and John Jordan. 2000. The impact of patient-centered care on outcomes. Fam Pract 49 (2000), 796--804.",
      "doi": ""
    },
    {
      "text": "Heekyong Park and Jinwook Choi. 2012. V-model: a new innovative model to chronologically visualize narrative clinical texts. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 453--462.  ",
      "doi": "10.1145/2207676.2207739"
    },
    {
      "text": "Heekyong Park and Jinwook Choi. 2014. V-Model: a new perspective for EHR-based phenotyping. BMC medical informatics and decision making 14, 1 (2014), 90.",
      "doi": ""
    },
    {
      "text": "Rimma Pivovarov and Noémie Elhadad. 2015. Automated methods for the summarization of electronic health records. Journal of the American Medical Informatics Association 22, 5 (2015), 938--947.",
      "doi": ""
    },
    {
      "text": "Catherine Plaisant, Brett Milash, Anne Rose, Seth Widoff, and Ben Shneiderman. 1996. LifeLines: visualizing personal histories. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 221--227.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Catherine Plaisant, Rich Mushlin, Aaron Snyder, Jia Li, Daniel Heller, and Ben Shneiderman. 1998. LifeLines: using visualization to enhance navigation and analysis of patient records. In Proceedings of the AMIA Symposium. American Medical Informatics Association, 76.",
      "doi": ""
    },
    {
      "text": "Stephanie E Pollard, Pamela M Neri, Allison R Wilcox, Lynn A Volk, Deborah H Williams, Gordon D Schiff, Harley Z Ramelson, and David W Bates. 2013. How physicians document outpatient visit notes in an electronic health record. International journal of medical informatics 82, 1 (2013), 39--46.",
      "doi": ""
    },
    {
      "text": "Seth M Powsner and Edward R Tufte. 1994. Graphical summary of patient status. The Lancet 344, 8919 (1994), 386--389.",
      "doi": ""
    },
    {
      "text": "Daniel Reichert, David Kaufman, Benjamin Bloxham, Herbert Chase, Noémie Elhadad, and others. 2010. Cognitive analysis of the summarization of longitudinal patient records. In AMIA annu symp proc, Vol. 2010. 667--671.",
      "doi": ""
    },
    {
      "text": "Alexander Rind, Taowei David Wang, Wolfgang Aigner, Silvia Miksch, Krist Wongsuphasawat, Catherine Plaisant, Ben Shneiderman, and others. 2013. Interactive information visualization to explore and query electronic health records. Foundations and Trends® in Human-Computer Interaction 5, 3 (2013), 207--298.  ",
      "doi": "10.1561/1100000039"
    },
    {
      "text": "S Trent Rosenbloom, Joshua C Denny, Hua Xu, Nancy Lorenzi, William W Stead, and Kevin B Johnson. 2011. Data from clinical notes: a perspective on the tension between structure and flexible documentation. Journal of the American Medical Informatics Association 18, 2 (2011), 181--186.",
      "doi": ""
    },
    {
      "text": "Huibert J Tange, Arie Hasman, Pieter F de Vries Robbé, and Harry C Schouten. 1997. Medical narratives in electronic medical records. International journal of medical informatics 46, 1 (1997), 7--29.",
      "doi": ""
    },
    {
      "text": "Huibert J Tange, Harry C Schouten, Arnold DM Kester, and Arie Hasman. 1998. The granularity of medical narratives and its effect on the speed and completeness of information retrieval. Journal of the American Medical Informatics Association 5, 6 (1998), 571--582.",
      "doi": ""
    },
    {
      "text": "Gaurav Trivedi, Phuong Pham, Wendy Chapman, Rebecca Hwa, Janyce Wiebe, and Harry Hochheiser. 2017. An Interactive Tool for Natural Language Processing on Clinical Text. arXiv preprint arXiv:1707.01890 (2017).",
      "doi": ""
    },
    {
      "text": "Lauren Wilcox, Jie Lu, Jennifer Lai, Steven Feiner, and Desmond Jordan. 2010. Physician-driven management of patient progress notes in an intensive care unit. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1879--1888.  ",
      "doi": "10.1145/1753326.1753609"
    },
    {
      "text": "Xiaomu Zhou, Mark S Ackerman, and Kai Zheng. 2009. I just don't know why it's gone: maintaining informal information use in inpatient care. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2061--2070.  ",
      "doi": "10.1145/1518701.1519014"
    }
  ]
}