{
  "doi": "10.1145/3173574.3174044",
  "title": "Weaving Lighthouses and Stitching Stories: Blind and Visually Impaired People Designing E-textiles",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We describe our experience of working with blind and visually impaired people to create interactive art objects that are personal to them, through a participatory making process using electronic textiles (e-textiles) and hands-on crafting techniques. The research addresses both the practical considerations about how to structure hands-on making workshops in a way which is accessible to participants of varying experience and abilities, and how effective the approach was in enabling participants to tell their own stories and feel in control of the design and making process. The results of our analysis is the offering of insights in how to run e-textile making sessions in such a way for them to be more accessible and inclusive to a wider community of participants.",
  "tags": [
    "story-telling",
    "creativity",
    "e-textiles",
    "touch-based interaction",
    "visual impairment",
    "crafting",
    "participatory making"
  ],
  "authors": [
    {
      "name": "Emilie Giles",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658635599",
      "orcid": "missing"
    },
    {
      "name": "Janet van der Linden",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460650091",
      "orcid": "missing"
    },
    {
      "name": "Marian Petre",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100405136",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Béguin, P. (2003) 'Design as a mutual learning process between users and designers', Interacting with Computers, Vol. 15, Issue 5, pp. 709--730.",
      "doi": ""
    },
    {
      "text": "Bødker, S. (2006) 'When Second Wave HCI meets Third Wave Challenges'. In Proceedings of the 4th Nordic conference on Human-computer Interaction: Changing Roles (NordiCHI'06), pp. 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Bødker, S., Knudsen, J., Kyng, M., Ehn, P., Madsen, K. (1988) 'Computer Support for Cooperative Design'. In Proceedings of the 1988 ACM conference on Computer-supported cooperative work (CSCW '88), pp. 377--394.  ",
      "doi": "10.1145/62266.62296"
    },
    {
      "text": "Bratteteig, T. (1997) 'Mutual Learning: Enabling cooperation on systems design'. In Proceedings from the IRIS 20 Information Systems Research Seminar, p.1--20. http://folk.uio.no/tone/Publications/Bratt-iris'20.html",
      "doi": ""
    },
    {
      "text": "Braun, V. and Clarke, V. (2006) 'Using thematic analysis in psychology', Qualitative research in psychology, Vol. 3, Issue 2, pp. 77--101.",
      "doi": ""
    },
    {
      "text": "Briggs-Goode, A., Glazzard, M., Walker, S., Kettley, S., Heinzel, T., Lucas, R. (2016) 'Wellbeing and Smart Textiles: Reflecting on Collaborative Practices and the Design Process', Journal of Textile Design Research and Practice, Vol. 4, Issue 1, pp. 63--83.",
      "doi": ""
    },
    {
      "text": "Buehler, E., Easley, W., McDonald, S., Comrie, N and Hurst, A. (2015) 'Inclusion and Education: 3D Printing for Integrated Classrooms'. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), pp. 281--290.  ",
      "doi": "10.1145/2700648.2809844"
    },
    {
      "text": "Cute Circuit (n.d) The Galaxy Dress {Online}. Available at http://cutecircuit.com/the-galaxy-dress (Accessed 9th August 2017).",
      "doi": ""
    },
    {
      "text": "Davis, F. (2015) 'The Textility of Emotion: A Study Relating Computational Textile Textural Expression to Emotion'. In Proceedings of 10th SIGCHI Conference on Creativity and Cognition (C&C'15), pp. 23--32.  ",
      "doi": "10.1145/2757226.2757231"
    },
    {
      "text": "Digital Makers Fund (n.d) Digital Makers {Online}. Available at http://www.nesta.org.uk/project/digitalmakers (Accessed 15th September 2017).",
      "doi": ""
    },
    {
      "text": "E-textile Swatch Exchange (2017) Swatchbooks {Online}. Available at http://etextilesummercamp.org/swatch-exchange (Accessed 22nd December 2017).",
      "doi": ""
    },
    {
      "text": "Frauenberger, C., Makhaeva, J. and Spiel, K. (2016) 'Designing Smart Objects with Autistic Children Four Design Exposès'. In Proceedings of the 2015 SIGCH Conference on Human Factors in Computing Systems (CHI'16), pp. 2019--2028.  ",
      "doi": "10.1145/2858036.2858050"
    },
    {
      "text": "Giles, E. and van der Linden, J. (2015) 'Imagining Future Technologies: eTextile Weaving Workshops with Blind and Visually Impaired People'. In Proceedings of 10th SIGCHI Conference on Creativity and Cognition (C&C'15), pp. 3--12.  ",
      "doi": "10.1145/2757226.2757247"
    },
    {
      "text": "Hurst, A. and Tobias, J. (2011) 'Empowering Individuals with self Assistive Technology'. In Proceedings of the 13th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '11), pp. 11--18.  ",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Lee, J.-J. (2013) 'Method-making as a method of designing'. In Proceedings from the 5th Nordic Design Research Conference (Nordes 2013), pp. 100--109. http://www.nordes.org/nordes2013/pictures/Nordes201 3Proceedings.pdf",
      "doi": ""
    },
    {
      "text": "Make (2012) Soft-Circuit LED Bracelet {Online}. Available at https://makezine.com/projects/soft-circuitled-bracelet (Accessed 5 th September 2017).",
      "doi": ""
    },
    {
      "text": "Meissner, J., Vines, J., McLaughlin, J., Nappey, T., Maksimova, J. and Wright, P. (2017) 'Do-It-Yourself Empowerment as Experienced by Novice Makers with Disabilities'. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS'17), pp. 1053--1065.  ",
      "doi": "10.1145/3064663.3064674"
    },
    {
      "text": "Metatla, O., Bryan-Kinns, N., Stockman, T. and Martin, F. (2015) 'Designing with and for people living with visual impairments: audio-tactile mock-ups, audio diaries and participatory prototyping', CoDesign, Vol. 11, Issue 1, pp. 35--48.",
      "doi": ""
    },
    {
      "text": "Mogensen, P. and Trigg, R. (1992) 'Using Artifacts as Triggers for Participatory Analysis'. In Proceedings of the second biennial Participatory Design Conference (PDC'92), pp. 55--62.",
      "doi": ""
    },
    {
      "text": "Perner-Wilston, H., and Buechley, L (2013) 'Handcrafting Textile Sensors', in: Buechley, L., Peppler, K., Eisenberg, M. and Kafal, Y. (eds) Textile Messages: Dispatches From the World of E-Textiles and Education, New York: Peter Lang Publishing, pp. 55--65.",
      "doi": ""
    },
    {
      "text": "Philippe, F., Schacher, L., Adolphe, D.C. and Dacremont, C. (2003) 'The sensory panel applied to textile goods - a new marketing tool', Journal of Fashion Marketing and Management: An International Journal, Vol. 7, Issue 3, pp. 235--248.",
      "doi": ""
    },
    {
      "text": "Rathnayake, A. and Dias, T. (2015) 'Yarns with Embedded Electronics'. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ ISWC 2015), pp. 385--388.  ",
      "doi": "10.1145/2800835.2800919"
    },
    {
      "text": "Roedl, D., Bardzell, S., and Bardzell, J. (2015) 'Sustainable Making? Balancing Optimism and Criticism in HCI Discourse'. ACM Transactions on Computer-Human Interaction, Vol. 22, Issue 3, pp.1-- 27.  ",
      "doi": "10.1145/2699742"
    },
    {
      "text": "Schelle, K., Naranjo, C., Bhömer, M., Tomico, O. and Wensveen, S. (2015) 'Tactile Dialogues: Personalization of Vibrotactile Behavior to Trigger Interpersonal Communication'. In Proceedings of the TEI '15: Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI'15), pp. 637--642.  ",
      "doi": "10.1145/2677199.2687894"
    },
    {
      "text": "Sense Blog (2015) Deft Digits: Giant Finger Knitting {Online}. Available at https://blog.sense.org.uk/2015/05/deft-digits-giantfinger-knitting (Accessed 28th July 2017).",
      "doi": ""
    },
    {
      "text": "Tanaka, A and Parkinson, A. (2016) 'Haptic Wave: A Cross-Modal Interface for Visually- impaired Audio Producers'. In Proceedings of the 2016 SIGCH Conference on Human Factors in Computing Systems (CHI'16), pp. 2150--2161.  ",
      "doi": "10.1145/2858036.2858304"
    },
    {
      "text": "Treadaway, C. and Kenning, G. (2016) 'Sensor etextiles: person centered co-design for people with late stage dementia'. Working with Older People, Vol. 20, Issue 2, pp. 76--85.",
      "doi": ""
    },
    {
      "text": "Toombs, A., Bardzell, S. and Bardzell, J. (2015) 'The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making'. In Proceedings of the 2015 SIGCH Conference on Human Factors in Computing Systems (CHI'15), pp. 2019--2028.  ",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Wiseman, S. van der Linden, J., Spiers, A. and Oshodi, M. (2017) 'Control and Being Controlled: Exploring the use of Technology in an Immersive Theatre Performance'. In Proceedings of the 2017 Conference on Designing Interactive Systems, (DIS'17), pp. 3--14.  ",
      "doi": "10.1145/3064663.3064694"
    },
    {
      "text": "van der Linden, J., Rogers, Y., Oshodi, M., ; Spiers, A., McGoran, D., Cronin, R. and O'Dowd, P. (2011) 'Haptic Reassurance in the Pitch Black for an Immersive Theatre Experience'. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp'11), pp. 143--152.  ",
      "doi": "10.1145/2030112.2030133"
    },
    {
      "text": "Vaucelle, C., Bonanni, L. and Ishii, H. (2009) 'Design of Haptic Interfaces for Therapy'. In Proceedings of the 2009 SIGCH Conference on Human Factors in Computing Systems (CHI'09), pp. 467--470.  ",
      "doi": "10.1145/1518701.1518776"
    },
    {
      "text": "Vogelpoel, N and Jarrold, K. (2014) 'Social prescription and the role of participatory arts programmes for older people with sensory impairments', Journal of Integrated Care, Vol. 22, Issue 2, pp. 39--50.",
      "doi": ""
    },
    {
      "text": "Wood, D., Bruner, J. and Ross, G. (1976) 'The Role of Tutoring in Problem Solving', The journal of Child Psychology and Psychiatry, Vol. 17, Issue 2, pp. 89- 100.",
      "doi": ""
    },
    {
      "text": "Wu, M., Richards, B. and Baecker, R. (2004) 'Participatory Design with Individuals who have Amnesia'. In Proceedings of the 8th biennial Participatory Design Conference (PDC'04), pp.214- 223.  ",
      "doi": "10.1145/1011870.1011895"
    }
  ]
}