{
  "doi": "10.1145/3173574.3173920",
  "title": "“Bursting the Assistance Bubble”: Designing Inclusive Technology with Children with Mixed Visual Abilities",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Children living with visual impairments (VIs) are increasingly educated in mainstream rather than special schools. But knowledge about the challenges they face in inclusive schooling environments and how to design technology to overcome them remains scarce. We report findings from a field study involving interviews and observations of educators and children with/without VIs in mainstream schools, in which we identified the \"teaching assistant bubble\" as a potential barrier to group learning, social play and independent mobility. We present co-design activities blending elements of future workshops, multisensory crafting, fictional inquiry and bodystorming, demonstrating that children with and without VIs can jointly lead design processes and explore design spaces reflective of mixed visual abilities and shared experiences. We extend previous research by characterising challenges and opportunities for improving inclusive education of children with VIs in mainstream schools, in terms of balancing assistance and independence, and reflect on the process and outcomes of co-designing with mixed-ability groups in this context.",
  "authors": [
    {
      "name": "Oussama Metatla",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418592476",
      "orcid": "0000-0002-3882-3243"
    },
    {
      "name": "Clare Cullen",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261229",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mel Ainscow, Tony Booth, and Alan Dyson. 2006. Inclusion and the standards agenda: negotiating policy pressures in England. Int. J. Inclusive Education 10, 4--5 (2006), 295--308.",
      "doi": ""
    },
    {
      "text": "Christine Arter. 2013. Children with visual impairment in mainstream settings. Routledge.",
      "doi": ""
    },
    {
      "text": "Stephen Bach, Ian Kessler, and Paul Heron. 2004. Support Roles and Changing Jobs Boundaries in the Public Services : The Case of Teaching Assistants in British Primary Schools. In Proceedings of the 22nd Annual International Labour Press Conference. 5--7.",
      "doi": ""
    },
    {
      "text": "Julie A Bardin and Sandra Lewis. 2008. A survey of the academic engagement of students with visual impairments in general education classes. Journal of Visual Impairment & Blindness 102, 8 (2008), 472.",
      "doi": ""
    },
    {
      "text": "Helen Beetham and Rhona Sharpe. 2013. Rethinking pedagogy for a digital age: Designing for 21st century learning. routledge. ",
      "doi": "10.5555/1208408"
    },
    {
      "text": "Laura Benton and Hilary Johnson. 2015. Widening participation in technology design: A review of the involvement of children with special educational needs and disabilities. International Journal of Child-Computer Interaction 3 (2015), 23--40.  ",
      "doi": "10.5555/2991320.2991412"
    },
    {
      "text": "Tony Booth, Mel Ainscow, Kristine Black-Hawkins, Mark Vaughan, and Linda Shaw. 2002. Index for inclusion. Bristol: Centre for Studies on Inclusive Education (2002).",
      "doi": ""
    },
    {
      "text": "Goele Bossaert, Hilde Colpin, Sip Jan Pijl, and Katja Petry. 2013. Truly included? A literature study focusing on the social dimension of inclusion in education. Int. J. Inclusive Education 17, 1 (2013), 60--79.",
      "doi": ""
    },
    {
      "text": "Emily C Bouck. 2016. A National Snapshot of Assistive Technology for Students With Disabilities. J. Special Education Technology 31, 1 (2016), 4--13.",
      "doi": ""
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. Collaborative accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2373--2382.  ",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Stephen M. Broer, Mary Beth Doyle, and Michael F. Giangreco. 2005. Perspectives of Students With Intellectual Disabilities About Their Experiences With Paraprofessional Support. Exceptional Children 71, 4 (2005), 415--430.",
      "doi": ""
    },
    {
      "text": "Deana Brown, Victoria Ayo, and Rebecca E Grinter. 2014. Reflection through design: immigrant women's self-reflection on managing health and wellness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1605--1614.  ",
      "doi": "10.1145/2556288.2557119"
    },
    {
      "text": "Emeline Brulé, Gilles Bailly, Anke Brock, Frédéric Valentin, Grégoire Denis, and Christophe Jouffrais. 2016. MapSense: multi-sensory interactive maps for children living with visual impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 445--457.  ",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Emeline Brulé and Christophe Jouffrais. 2016. Representing Children Living with Visual Impairments in the Design Process: A Case Study with Personae. In Proceedings of the 8th Cambridge Workshop on Universal Access and Assistive Technology. CWUAAT, 23--32.",
      "doi": ""
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014. ABC and 3D: Opportunities and Obstacles to 3D Printing in Special Education Environments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 107--114.  ",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Colin Burns, Eric Dishman, William Verplank, and Bud Lassiter. 1994. Actors, Hairdos & Videotape&Mdash;Informance Design. In Conference Companion on Human Factors in Computing Systems (CHI '94). ACM, New York, NY, USA, 119--120.  ",
      "doi": "10.1145/259963.260102"
    },
    {
      "text": "Christian Dindler, Eva Eriksson, Ole Sejer Iversen, Andreas Lykke-Olesen, and Martin Ludvigsen. 2005. Mission from Mars: a method for exploring user requirements for children in a narrative space. In Proceedings of the 2005 conference on Interaction design and children. ACM, 40--47.  ",
      "doi": "10.1145/1109540.1109546"
    },
    {
      "text": "Allison Druin. 1999. Cooperative Inquiry: Developing New Technologies for Children with Children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 592--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Jerry Alan Fails, Mona Leigh Guha, Allison Druin, and others. 2013. Methods and techniques for involving children in the design of new technology for children. Foundations and Trends® in Human-Computer Interaction 6, 2 (2013), 85--166.  ",
      "doi": "10.1561/1100000018"
    },
    {
      "text": "Peter Farrell, Alison Alborz, Andy Howes, and Diana Pearson. 2010. The impact of teaching assistants on improving pupils' academic achievement in mainstream schools: A review of the literature. Educational Review 62, 4 (2010), 435--448.",
      "doi": ""
    },
    {
      "text": "Daniel J. Finnegan, Eamonn O'Neill, and Michael J. Proulx. 2016. Compensating for Distance Compression in Audiovisual Virtual Environments Using Incongruence. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 200--212.  ",
      "doi": "10.1145/2858036.2858065"
    },
    {
      "text": "Ashley Flower, Matthew K. Burns, and Nicole A. Bottsford - Miller. 2007. Meta-analysis of disability simulation research. Remedial and Special Education 28, 2 (2007), 72--79.",
      "doi": ""
    },
    {
      "text": "Department for Education. 2016. School Workforce in England: November 2016. (2016).",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Julia Makhaeva, and Katharina Spiel. 2017. Blending Methods: Developing Participatory Design Sessions for Autistic Children. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 39--49.  ",
      "doi": "10.1145/3078072.3079727"
    },
    {
      "text": "Euan Freeman, Graham Wilson, Stephen Brewster, Gabriel Baud-Bovy, Charlotte Magnusson, and Hector Caltenco. 2017. Audible Beacons and Wearables in Schools: Helping Young Visually Impaired Children Play and Move Independently. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4146--4157.  ",
      "doi": "10.1145/3025453.3025518"
    },
    {
      "text": "Michael F. Giangreco. 2013. Teacher assistant supports in inclusive schools: Research, practices and alternatives. Australasian Journal of Special Education 37, 2 (2013), 93--106.",
      "doi": ""
    },
    {
      "text": "Michael F Giangreco, Susan W Edelman, Tracy Evans Luiselli, and Stephanie Z C MacFarland. 1997. Helping or hovering?: Effects of instructional assistance proximity on students with disabilities. Exceptional Children 64, 1 (1997), 7--18.",
      "doi": ""
    },
    {
      "text": "Stéphanie Giraud, Philippe Truillet, Véronique Gaildrat, and Christophe Jouffrais. 2017. 'DIY' Prototyping of Teaching Materials for Visually Impaired Children: Usage and Satisfaction of Professionals. In International Conference on Universal Access in Human-Computer Interaction. Springer, 515--524.",
      "doi": ""
    },
    {
      "text": "Colette Gray. 2009. A qualitatively different experience: Mainstreaming pupils with a visual impairment in Northern Ireland. Euro. J. Special Needs Education 24, 2 (2009), 169--182.",
      "doi": ""
    },
    {
      "text": "J Greaney, M Tobin, and E Hill. 1999. Braille Version of the Neale Analysis of Reading Abilities. RNIB (1999).",
      "doi": ""
    },
    {
      "text": "Mona Leigh Guha, Allison Druin, and Jerry Alan Fails. 2008. Designing with and for Children with Special Needs: An Inclusionary Model. In Proceedings of the 7th International Conference on Interaction Design and Children (IDC '08). ACM, New York, NY, USA, 61--64.  ",
      "doi": "10.1145/1463689.1463719"
    },
    {
      "text": "David S Hayden, Liqing Zhou, Michael J Astrauskas, and John A Black Jr. 2010. Note-taker 2.0: the next step toward enabling students who are legally blind to take notes in class. In Proc. 12th int. ACM SIGACCESS conf. ACM, 131--138.  ",
      "doi": "10.1145/1878803.1878828"
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering individuals with do-it-yourself assistive technology. In Proc. 13th int. ACM SIGACCESS conf. ACM, 11--18.  ",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Ole Sejer Iversen and Christian Dindler. 2008. Pursuing Aesthetic Inquiry in Participatory Design. In Participatory Design Conference. The Trustees of Indiana University, 138--145. ",
      "doi": "10.5555/1795234.1795254"
    },
    {
      "text": "Eija Kärnä, Jussi Nuutinen, Kaisa Pihlainen-Bednarik, and Virpi Vellonen. 2010. Designing technologies with children with special needs: Children in the Centre (CiC) framework. In Proceedings of the 9th International Conference on Interaction Design and Children. ACM, 218--221.  ",
      "doi": "10.1145/1810543.1810575"
    },
    {
      "text": "Coral Kemp and Mark Carter. 2002. The social skills and social status of mainstreamed students with intellectual disabilities. Educational Psychology 22, 4 (2002), 391--411.",
      "doi": ""
    },
    {
      "text": "B. Lamb. 2009. Lamb Inquiry: Special Needs and Parental Confidence. DCSF Publications (2009).",
      "doi": ""
    },
    {
      "text": "Suk-Hyang Lee, Michael L Wehmeyer, Jane H Soukup, and Susan B Palmer. 2010. Impact of curriculum modifications on access to the general education curriculum for students with disabilities. Exceptional Children 76, 2 (2010), 213--233.",
      "doi": ""
    },
    {
      "text": "Yeunjoo Lee and Luis A Vega. 2005. Perceived knowledge, attitudes, and challenges of AT use in special education. J. Special Education Technology 20, 2 (2005), 60.",
      "doi": ""
    },
    {
      "text": "Stephen Lindsay, Daniel Jackson, Guy Schofield, and Patrick Olivier. 2012. Engaging older people using participatory design. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1199--1208.  ",
      "doi": "10.1145/2207676.2208570"
    },
    {
      "text": "Charlotte Magnusson, Héctor Caltenco, Sara Finocchietti, Giulia Cappagli, Graham Wilson, and Monica Gori. 2015. What do you like? early design explorations of sound and haptic preferences. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. ACM, 766--773.  ",
      "doi": "10.1145/2786567.2793699"
    },
    {
      "text": "Charlotte Magnusson, Per-Olof Hedvall, and Héctor Caltenco. 2018. Co-designing together with Persons with Visual Impairments. In Mobility of Visually Impaired People. Springer, 411--434.",
      "doi": ""
    },
    {
      "text": "Laura Malinverni, Joan Mora-Guiard, Vanesa Padillo, MariaAngeles Mairena, Amaia Hervás, and Narcis Pares. 2014. Participatory design strategies to enhance the creative contribution of children with special needs. In Proceedings of the 2014 conference on Interaction design and children. ACM, 85--94.  ",
      "doi": "10.1145/2593968.2593981"
    },
    {
      "text": "Anne-Marie Mann, Uta Hinrichs, Janet C Read, and Aaron Quigley. 2016. Facilitator, Functionary, Friend or Foe?: Studying the Role of iPads within Learning Activities Across a School Year. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1833--1845.  ",
      "doi": "10.1145/2858036.2858251"
    },
    {
      "text": "Samantha McDonald, Joshua Dutterer, Ali Abdolrahmani, Shaun K Kane, and Amy Hurst. 2014. Tactile aids for visually impaired graphical design education. In Proc. 16th int. ACM SIGACCESS conf. ACM, 275--276.  ",
      "doi": "10.1145/2661334.2661392"
    },
    {
      "text": "Joanne McElligott and Lieselotte Van Leeuwen. 2004. Designing sound tools and toys for blind and visually impaired children. In Proceedings of the 2004 conference on Interaction design and children: building a community. ACM, 65--72.  ",
      "doi": "10.1145/1017833.1017842"
    },
    {
      "text": "Oussama Metatla. 2017. Uncovering Challenges and Opportunities of Including Children with Visual Impairments in Mainstream Schools. Proc BSC-HCI'17 (2017).  ",
      "doi": "10.14236/ewic/HCI2017.102"
    },
    {
      "text": "Oussama Metatla, Nick Bryan-Kinns, Tony Stockman, and Fiore Martin. 2015. Designing with and for people living with visual impairments: audio-tactile mock-ups, audio diaries and participatory prototyping. CoDesign 11, 1 (2015), 35--48.",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Nuno N. Correia, Fiore Martin, Nick Bryan-Kinns, and Tony Stockman. 2016a. Tap the ShapeTones: Exploring the Effects of Crossmodal Congruence in an Audio-Visual Interface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1055--1066.  ",
      "doi": "10.1145/2858036.2858456"
    },
    {
      "text": "Oussama Metatla, Fiore Martin, Adam Parkinson, Nick Bryan-Kinns, Tony Stockman, and Atau Tanaka. 2016b. Audio-haptic interfaces for digital audio workstations. Journal on Multimodal User Interfaces 10, 3 (01 Sep 2016), 247--258.",
      "doi": ""
    },
    {
      "text": "Neema Moraveji, Jason Li, Jiarong Ding, Patrick O'Kelley, and Suze Woolf. 2007. Comicboarding: using comics as proxies for participatory design with children. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1371--1374.  ",
      "doi": "10.1145/1240624.1240832"
    },
    {
      "text": "Marian Morris and Paula Smith. 2008. Educational provision for blind and partially sighted children and young people in England: 2007. National Foundation for Educational Research (NFER) for RNIB (2008).",
      "doi": ""
    },
    {
      "text": "Emma Murphy, Enda Bates, and Dónal Fitzpatrick. 2010. Designing auditory cues to enhance spoken mathematics for visually impaired users. In Proc. 12th int. ACM SIGACCESS conf. ACM, 75--82.  ",
      "doi": "10.1145/1878803.1878819"
    },
    {
      "text": "Michelle R. Nario-Redmond, Dobromir Gospodinov, and Angela Cobb. 2017. Crip for a day: The unintended negative consequences of disability simulations. Rehabilitation Psychology 62, 3 (2017), 324--333.",
      "doi": ""
    },
    {
      "text": "M. Obrist, E. Gatti, E. Maggioni, C. T. Vi, and C. Velasco. 2017. Multisensory Experiences in HCI. IEEE MultiMedia 24, 2 (2017), 9--13.  ",
      "doi": "10.1109/MMUL.2017.33"
    },
    {
      "text": "ONS. 2015. National Population Projections for 2015, 2012-based projections release. Office for National Statistics (2015).",
      "doi": ""
    },
    {
      "text": "Wendy R. Locke and Lynn S. Fuchs. 1995. Effects of Peer-Mediated Reading Instruction on the On-Task Behavior and Social Interaction of Children with Behavior Disorders. Journal of Emotional and Behavioral Disorders 3 (04 1995), 92--99.",
      "doi": ""
    },
    {
      "text": "RNIB. 2013. Key statistics on the prevalence and population of children and young people with vision impairment. (2013).",
      "doi": ""
    },
    {
      "text": "Joao Roe. 2008. Social inclusion: meeting the socio-emotional needs of children with vision needs. British J. Visual Impairment 26, 2 (2008), 147--158.",
      "doi": ""
    },
    {
      "text": "Helen Saddler. 2014. Researching the influence of teaching assistants on the learning of pupils identified with special educational needs in mainstream primary schools: Exploring social inclusion. Journal of Research in Special Educational Needs 14, 3 (2014), 145--152.",
      "doi": ""
    },
    {
      "text": "Nuzhah Gooda Sahib, Tony Stockman, Anastasios Tombros, and Oussama Metatla. 2013. Participatory design with blind users: a scenario-based approach. In IFIP Conference on Human-Computer Interaction. Springer, 685--701.",
      "doi": ""
    },
    {
      "text": "Eva-Lotta Sallnas, Jonas Moll, and Kerstin Severinson-Eklundh. 2007. Group work about geometrical concepts among blind and sighted pupils using haptic interfaces. In EuroHaptics Conference, 2007 and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics 2007. Second Joint. IEEE, 330--335.  ",
      "doi": "10.1109/WHC.2007.61"
    },
    {
      "text": "TE Scruggs, MA Mastropieri, and P Leins. 2011. Teacher attitudes towards inclusion: A synthesis of survey, comparative, and qualitative research, 1958--2010. In Ann. meeting of the Council for Exceptional Children, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Irving Seidman. 2013. Interviewing as qualitative research: A guide for researchers in education and the social sciences. Teachers college press.",
      "doi": ""
    },
    {
      "text": "U Sharma and SJ Salend. 2016. Teaching Assistants in Inclusive Classrooms: A Systematic Analysis of the International Research. Australian Journal of Teacher Education 41, 8 (2016), 118--134.",
      "doi": ""
    },
    {
      "text": "Smita Shukla, Craig H Kennedy, and Lisa Sharon. 1999. Intermediate School Students with Severe Disabilities: Supporting Their Social Participation in General Education Classrooms. Journal of Positive Behavior Interventions 1, 3 (1999), 130--140.",
      "doi": ""
    },
    {
      "text": "Arielle M. Silverman, Jason D. Gwinn, and Leaf Van Boven. 2015. Stumbling in Their Shoes: Disability Simulations Reduce Judged Capabilities of Disabled People. Social Psychological and Personality Science 6, 4 (2015), 464--471.",
      "doi": ""
    },
    {
      "text": "Arielle M. Silverman, Jennifer S. Pitonyak, Ian K. Nelson, Patricia N. Matsuda, Deborah Kartin, and Ivan R. Molton. 2017. Instilling positive beliefs about disabilities: pilot testing a novel experiential learning activity for rehabilitation students. Disability and Rehabilitation 0 (2017), 1--6.",
      "doi": ""
    },
    {
      "text": "Miriam D Skjørten. 2001. Towards inclusion and enrichment. Education Special Needs Education: An Introduction. Oslo: Unipub Forlag (2001).",
      "doi": ""
    },
    {
      "text": "L Tews and J Lupart. 2008. Students With Disabilities' Perspectives of the Role and Impact of Paraprofessionals in Inclusive Education Settings. Journal of Policy and Practice in Intellectual Disabilities 5, 1 (2008), 39--46.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Cecily Morrison, Nicolas Villar, Martin Grayson, and Siân Lindley. 2017. Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 739--752.  ",
      "doi": "10.1145/3064663.3064689"
    },
    {
      "text": "Giasemi N Vavoula and Mike Sharples. 2007. Future technology workshop: A collaborative method for the design of new learning technologies and activities. International Journal of Computer-Supported Collaborative Learning 2, 4 (2007), 393--419.",
      "doi": "10.1007/s11412-007-"
    },
    {
      "text": "Giacomo Vivanti, Ed Duncan, Geraldine Dawson, and Sally J Rogers. 2017. Facilitating Learning Through Peer Interactions and Social Participation. In Implementing the Group-Based Early Start Denver Model for Preschoolers with Autism. Springer, 87--99.",
      "doi": ""
    },
    {
      "text": "Greg Walsh, Alison Druin, Mona Leigh Guha, Elizabeth Foss, Evan Golub, Leshell Hatley, Elizabeth Bonsignore, and Sonia Franckel. 2010. Layered elaboration: a new technique for co-design with children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1237--1240.  ",
      "doi": "10.1145/1753326.1753512"
    },
    {
      "text": "Rob Webster, Peter Blatchford, Paul Bassett, Penelope Brown, Clare Martin, and Anthony Russell. 2010. Double standards and first principles: Framing teaching assistant support for pupils with special educational needs. European Journal of Special Needs Education 25, 4 (2010), 319--336.",
      "doi": ""
    },
    {
      "text": "Ben Whitburn. 2013. The dissection of paraprofessional support in inclusive education: 'You're in mainstream with a chaperone'. Australasian Journal of Special Education 37, 2 (2013), 147--161.",
      "doi": ""
    },
    {
      "text": "Ru Zarin and Daniel Fallman. 2011. Through the troll forest: exploring tabletop interaction design for children with special cognitive needs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3319--3322.  ",
      "doi": "10.1145/1978942.1979434"
    },
    {
      "text": "Li Zhou, Amy T Parker, Derrick W Smith, and Nora Griffin-Shirley. 2011. Assistive technology for students with visual impairments: Challenges and needs in teachers' preparation programs and practice. J. Visual Impairment & Blindness 105, 4 (2011), 197.",
      "doi": ""
    }
  ]
}