{
  "doi": "10.1145/3173574.3174075",
  "title": "HapCube: A Wearable Tactile Device to Provide Tangential and Normal Pseudo-Force Feedback on a Fingertip",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Haptic devices allow a more immersive experience with Virtual and Augmented Reality. However, for a wider range of usage they need to be miniaturized while maintaining the quality of haptic feedback. In this study, we used two kinds of human sensory illusion of vibration. The first illusion involves creating a virtual force (pulling sensation) using asymmetric vibration, and the second involves imparting compliances of complex stress-strain curves (i.e. force-displacement curves of mechanical keyboards) to a rigid object by changing the frequency and amplitude of vibration. Using these two illusions, we developed a wearable tactile device named HapCube, consisting of three orthogonal voicecoil actuators. Four measurement tests and four user tests confirmed that 1) a combination of two orthogonal asymmetric vibrations could provide a 2D virtual force in any tangential directions on a finger pad, and 2) a single voicecoil actuator produced pseudo-force feedback of the complex compliance curves in the normal direction.",
  "tags": [
    "compliance",
    "haptics",
    "asymmetric vibration",
    "wearable devices",
    "haptic illusion"
  ],
  "authors": [
    {
      "name": "Hwan Kim",
      "institution": "Korea Advanced Institute of Science&Technology, Daejon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498651954",
      "orcid": "missing"
    },
    {
      "name": "HyeonBeom Yi",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162621",
      "orcid": "missing"
    },
    {
      "name": "Hyein Lee",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/do/10.1145/contrib-99659261623/rel-imgonly/emt_116s2-auth_pic_0.jpg",
      "acmid": "99659261623",
      "orcid": "missing"
    },
    {
      "name": "Woohun Lee",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100384795",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "T. Amemiya, H. Ando, and T. Maeda. 2005. Virtual Force Display: Direction Guidance Using Asymmetric Acceleration via Periodic Translational Motion. In First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 619--622.  ",
      "doi": "10.1109/WHC.2005.146"
    },
    {
      "text": "T. Amemiya and H. Gomi. 2014. Distinct pseudoattraction force sensation by a thumb-sized vibrator that oscillates asymmetrically. In Haptics: Neuroscience, Devices, Modeling, and Applications. Springer Berlin Heidelberg, 88--95.",
      "doi": ""
    },
    {
      "text": "Tomohiro Amemiya and Hiroaki Gomi. 2013. Directional Torque Perception with Brief, Asymmetric Net Rotation of a Flywheel. IEEE Transactions on Haptics 6, 3: 370--375.  ",
      "doi": "10.1109/TOH.2012.38"
    },
    {
      "text": "Tomohiro Amemiya and Hiroaki Gomi. 2016. Active Manual Movement Improves Directional Perception of Illusory Force. IEEE Transactions on Haptics 9, 4: 465--473.  ",
      "doi": "10.1109/TOH.2016.2587624"
    },
    {
      "text": "Shuhei Asano, Shogo Okamoto, Yoichiro Matsuura, Hikaru Nagano, and Yoji Yamada. 2012. Vibrotactile display approach that modifies roughness sensations of real textures. In 2012 IEEE RO-MAN: The 21st IEEE International Symposium on Robot and Human Interactive Communication, 1001--1006.",
      "doi": ""
    },
    {
      "text": "Shuhei Asano, Shogo Okamoto, and Yoji Yamada. 2015. Vibrotactile Stimulation to Increase and Decrease Texture Roughness. IEEE Transactions on Human-Machine Systems 45, 3: 393--398.",
      "doi": ""
    },
    {
      "text": "Conrad Bullion and Hakan Gurocak. 2010. Haptic Glove with MR Brakes for Distributed Finger Force. Presence 18, 6: 421--433.  ",
      "doi": "10.1162/pres.18.6.421"
    },
    {
      "text": "CHERRY. 2017. Operation characteristics of CHERRY keyboards. Retrieved September 16, 2017 from http://www.cherry.de/PDF/EN_CHERRY_MX_Bo ard_5_0.pdf",
      "doi": ""
    },
    {
      "text": "Francesco Chinello, Monica Malvezzi, Claudio Pacchierotti, and Domenico Prattichizzo. 2015. Design and development of a 3RRS wearable fingertip cutaneous device. In 2015 IEEE International Conference on Advanced Intelligent Mechatronics (AIM), 293--298.",
      "doi": ""
    },
    {
      "text": "Jean-Philippe Choiniere and Clement Gosselin. 2017. Development and Experimental Validation of a Haptic Compass Based on Asymmetric Torque Stimuli. IEEE Transactions on Haptics 10, 1: 29-- 39.  ",
      "doi": "10.1109/TOH.2016.2580144"
    },
    {
      "text": "H. Culbertson, J. Unwin, B. E. Goodman, and K. J. Kuchenbecker. 2013. Generating haptic texture models from unconstrained tool-surface interactions. In 2013 World Haptics Conference (WHC), 295--300.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson, Julie M. Walker, and Allison M. Okamura. 2016. Modeling and design of asymmetric vibrations to induce ungrounded pulling sensation through asymmetric skin displacement. In 2016 IEEE Haptics Symposium (HAPTICS), 27--33.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson, Julie M. Walker, Michael Raitor, and Allison M. Okamura. 2017. WAVES: A Wearable Asymmetric Vibration Excitation System for Presenting Three-Dimensional Translation and Rotation Cues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 4972--4982.  ",
      "doi": "10.1145/3025453.3025741"
    },
    {
      "text": "Knut Drewing, Michael Fritschi, Regine Zopf, Marc O. Ernst, and Martin Buss. 2005. First evaluation of a novel tactile display exerting shear force via lateral displacement. ACM Transactions on Applied Perception 2, 2: 118--131.  ",
      "doi": "10.1145/1060581.1060586"
    },
    {
      "text": "Paulo Gallotti, Alberto Raposo, and Luciano Soares. 2011. V-glove: A 3D virtual touch interface. In Proceedings - 2011 13th Symposium on Virtual Reality, SVR 2011, 242--251.  ",
      "doi": "10.1109/SVR.2011.21"
    },
    {
      "text": "Brian T. Gleeson, Scott K. Horschel, and William R. Provancher. 2010. Perception of Direction for Applied Tangential Skin Displacement: Effects of Speed, Displacement, and Repetition. IEEE Transactions on Haptics 3, 3: 177--188.  ",
      "doi": "10.1109/TOH.2010.20"
    },
    {
      "text": "Martin Grunwald. 2008. Human haptic perception?: basics and applications. Birkhäuser. Retrieved January 5, 2018 from https://books.google.co.kr/books?hl=ko&lr=&id=Q mq4BAAAQBAJ&oi=fnd&pg=PP7&dq=human+h aptic+perception+basics+and+applications&ots=sL Q2kMU8fp&sig=U7B_n8QvTAuvmTQ70pf4M9ry yik#v=onepage&q=human haptic perception basics and applications&f=false",
      "doi": ""
    },
    {
      "text": "Samantha Horvath, John Galeotti, Bing Wu, Roberta Klatzky, Mel Siegel, and George Stetten. 2014. FingerSight: Fingertip Haptic Sensing of the Visual Environment. IEEE Journal of Translational Engineering in Health and Medicine 2372, February: 1--1.",
      "doi": ""
    },
    {
      "text": "Akihiro Imaizumi, Shogo Okamoto, and Yoji Yamada. 2014. Friction Sensation Produced by Laterally Asymmetric Vibrotactile Stimulus.. 11-- 18.",
      "doi": ""
    },
    {
      "text": "David V. Keyson and Adrianus J. M. Houtsma. 1995. Directional sensitivity to a tactile point stimulus moving across the fingerpad. Perception&Psychophysics 57, 5: 738--744.",
      "doi": ""
    },
    {
      "text": "Johan Kildal. 2010. 3D-press: Haptic Illusion of Compliance when Pressing on a Rigid Surface. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction on - ICMI-MLMI '10, 8.  ",
      "doi": "10.1145/1891903.1891931"
    },
    {
      "text": "Hwan Kim, Minhwan Kim, and Woohun Lee. 2016. HapThimble: A Wearable Haptic Device towards Usable Virtual Touch Screen. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 3694--3705.  ",
      "doi": "10.1145/2858036.2858196"
    },
    {
      "text": "Sunjun Kim and Geehyuk Lee. 2013. Haptic Feedback Design for a Virtual Button Along ForceDisplacement Curves. In Proceedings of UIST 2013, 91--96.  ",
      "doi": "10.1145/2501988.2502041"
    },
    {
      "text": "Eunjin Koh, Jongho Won, and Changseok Bae. 2008. Vision-based virtual touch screen interface. Digest of Technical Papers - IEEE International Conference on Consumer Electronics: 4--5.",
      "doi": ""
    },
    {
      "text": "Thomas H Massie and J K Salisbury. 1994. The PHANTOM Haptic Interface?: A Device for Probing Virtual Objects Threee Enabling Observations component of our ability to ? visualize, \" remember and establish cognitive models of the physical structure of our environment stems from haptic interactions. 1--6.",
      "doi": ""
    },
    {
      "text": "Alvaro G. Perez, Daniel Lobo, Francesco Chinello, Gabriel Cirio, Monica Malvezzi, Jose San Martin, Domenico Prattichizzo, and Miguel A. Otaduy. 2017. Optimization-Based Wearable Tactile Rendering. IEEE Transactions on Haptics 10, 2: 254--264.",
      "doi": "10.1109/TOH.2016.2619708"
    },
    {
      "text": "Jun Rekimoto and Jun. 2013. Traxion: a tactile interaction device with virtual force sensation. In Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST '13, 427--432.  ",
      "doi": "10.1145/2501988.2502044"
    },
    {
      "text": "Joseph M. Romano and Katherine J. Kuchenbecker. 2012. Creating Realistic Virtual Textures from Contact Acceleration Data. IEEE Transactions on Haptics 5, 2: 109--119.  ",
      "doi": "10.1109/TOH.2011.38"
    },
    {
      "text": "Rei Sakuragi, Vibol Yem, and Hiroyuki Kajimoto. 2017. Pseudo force presentation to multiple fingers by asymmetric rotational vibration using a motor: Consideration in grasping posture. In 2017 IEEE World Haptics Conference (WHC), 305--309.",
      "doi": ""
    },
    {
      "text": "M. Salada, P. Vishton, J.E. Colgate, and E. Frankel. 2004. Two experiments on the perception of slip at the fingertip. In 12th International Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2004. HAPTICS '04. Proceedings., 146--153. ",
      "doi": "10.5555/1880269.1880291"
    },
    {
      "text": "Samuel B. Schorr and Allison M. Okamura. 2017. Fingertip Tactile Devices for Virtual Object Manipulation and Exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 3115--3119.  ",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "Samuel Benjamin Schorr and Allison M. Okamura. 2017. Three-Dimensional Skin Deformation as Force Substitution: Wearable Device Design and Performance During Haptic Exploration of Virtual Environments. IEEE Transactions on Haptics 10, 3: 418--430.",
      "doi": "10.1109/TOH.2017.2672969"
    },
    {
      "text": "Paul Strohmeier, Jesse Burstyn, Juan Pablo Carrascal, Vincent Levesque, and Roel Vertegaal. 2016. ReFlex: A Flexible Smartphone with Active Haptic Feedback for Bend Input. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction TEI '16, 185--192.  ",
      "doi": "10.1145/2839462.2839494"
    },
    {
      "text": "Paul Strohmeier and Kasper Hornbæ k. 2017. Generating Haptic Textures with a Vibrotactile Actuator. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 4994--5005.  ",
      "doi": "10.1145/3025453.3025812"
    },
    {
      "text": "Takeshi Tanabe, Hiroaki Yano, and Hiroo Iwata. 2016. Properties of proprioceptive sensation with a vibration speaker-type non-grounded haptic interface. In 2016 IEEE Haptics Symposium (HAPTICS), 21--26.",
      "doi": ""
    },
    {
      "text": "Takeshi Tanabe, Hiroaki Yano, and Hiroo Iwata. 2017. Evaluation of the Perceptual Characteristics of a Force Induced by Asymmetric Vibrations. IEEE Transactions on Haptics: 1--1.",
      "doi": ""
    },
    {
      "text": "M. Tosas and B. Li. 2004. Virtual Touch Screen for Mixed Reality. In Computer Vision in HumanComputer Interaction. 48--59.",
      "doi": ""
    },
    {
      "text": "Jun Wu, Dangxiao Wang, and Yuru Zhang. 2009. Virtual fixture based haptic rendering of handwriting. In 2009 IEEE International Conference on Virtual Environments, HumanComputer Interfaces, and Measurements Systems, VECIMS 2009 - Proceedings, 16--21. ",
      "doi": "10.5555/1699798.1699802"
    },
    {
      "text": "Hsin-Yun Yao and Vincent Hayward. 2010. Design and analysis of a recoil-type vibrotactile transducer. The Journal of the Acoustical Society of America 128, 2: 619--627.",
      "doi": ""
    }
  ]
}