{
  "doi": "10.1145/3173574.3174208",
  "title": "D-SWIME: A Design Space for Smartwatch Interaction Techniques Supporting Mobility and Encumbrance",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Smartwatches enable rapid access to information anytime and anywhere. However, current smartwatch content navigation techniques, for panning and zooming, were directly adopted from those used on smartphones. These techniques are cumbersome when performed on small smartwatch screens and have not been evaluated for their support in mobility and encumbrance contexts (when the user's hands are busy). We studied the effect of mobility and encumbrance on common content navigation techniques and found a significant decrease in performance as the pace of mobility increases or when the user was encumbered with busy hands. Based on these initial findings, we proposed a design space which would improve efficiency when navigation techniques, such as panning and zooming, are employed in mobility contexts. Our results reveal that our design space can effectively be used to create novel interaction techniques that improve smartwatch content navigation in mobility and encumbrance contexts.",
  "tags": [
    "design space evaluation",
    "navigation techniques",
    "smartwatch input",
    "pan",
    "touch input",
    "zoom",
    "encumbrance",
    "mobility"
  ],
  "authors": [
    {
      "name": "Gaganpreet Singh",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260392",
      "orcid": "missing"
    },
    {
      "name": "William Delamare",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82259263457",
      "orcid": "missing"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Dzimitry Dzmitry Aliakseyeu, Pourang Irani, Andrés Lucero, and Sriram Subramanian. 2008. Multi-Flick - An Evaluation of Flick-Based Scrolling Techniques for Pen Interfaces. In Proceedings of the International Conference on Human Factors in Computing Systems (CHI'08), 1689--1698.  ",
      "doi": "10.1145/1357054.1357319"
    },
    {
      "text": "Jeff Avery, Mark Choi, Daniel Vogel, and Edward Lank. 2014. Pinch-to-zoom-plus: An Enhanced Pinch-to-zoom That Reduces Clutching and Panning. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST'14), 595--604.  ",
      "doi": "10.1145/2642918.2647352"
    },
    {
      "text": "Leon Barnard, Ji Soo Yi, Julie A. Jacko, and Andrew Sears. 2005. An empirical comparison of use-inmotion evaluation scenarios for mobile computing devices. International Journal of Human Computer Studies 62, 4: 487--520.  ",
      "doi": "10.1016/j.ijhcs.2004.12.002"
    },
    {
      "text": "Alessio Bellino. 2015. Enhancing pinch-drag-flick paradigm with two new gestures: Two-finger-tap for tablets and tap&tap for smartphones. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 534--551.  ",
      "doi": "10.1007/978-3-319-22698-9_37"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, Antti Oulasvirta, and Stephen Brewster. 2011. The effects of walking speed on target acquisition on a touchscreen interface. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11), 143-- 146.  ",
      "doi": "10.1145/2037373.2037396"
    },
    {
      "text": "Staffan Björk and Staffan. 2000. Hierarchical flip zooming: enabling parallel exploration of hierarchical visualizations. In Proceedings of the working conference on Advanced visual interfaces (AVI'00), 232--237.  ",
      "doi": "10.1145/345513.345324"
    },
    {
      "text": "Boring, David Ledo, X Chen, Nicolai Marquardt, Tang, and Saul Greenberg. 2013. The Fat Thumb: Using the Thumb's Contact Size for Single-Handed Mobile Interaction. Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services companion (MobileHCI '12): 39--48.  ",
      "doi": "10.1145/2371574.2371582"
    },
    {
      "text": "Andrew Bragdon, Eugene Nelson, Yang Li, and Ken Hinckley. 2011. Experimental analysis of touchscreen gesture designs in mobile environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 403--412.  ",
      "doi": "10.1145/1978942.1979000"
    },
    {
      "text": "Andrew Crossan, Mark McGill, Stephen Brewster, and Roderick Murray-Smith. 2009. Head tilting for interaction in mobile contexts. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI'09), 1.  ",
      "doi": "10.1145/1613858.1613866"
    },
    {
      "text": "Andrew Crossan, John Williamson, Stephen Brewster, and Rod Murray-Smith. 2008. Wrist rotation for interaction in mobile contexts. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services (MobileHCI '08), 435.  ",
      "doi": "10.1145/1409240.1409307"
    },
    {
      "text": "D Dearman, B MacKay, K M Inkpen, and C Watters. 2005. \"Touch-N-Go: Supporting Screen Navigation on Handheld Computers (Technical Report {CS}2005-08). \" Halifax, {NS}.",
      "doi": ""
    },
    {
      "text": "Mayank Goel, Leah Findlater, and Jacob O Wobbrock. 2012. WalkType: Using accelerometer data to accommodate situational impairments in mobile touch screen text entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 2687--2696.  ",
      "doi": "10.1145/2207676.2208662"
    },
    {
      "text": "Anhong Guo and Tim Paek. 2016. Exploring tilt for no-touch, wrist-only interactions on smartwatches. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI'16), 17--28.  ",
      "doi": "10.1145/2935334.2935345"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. Advances in Psychology 52, C: 139--183.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley and Hyunyoung Song. 2011. Sensor Synaesthesia: Touch in Motion, and Motion in Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11), 801--810.  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Akira Ishii, Buntarou Shizuki, and Jiro Tanaka. 2016. Evaluation of Callout Design for Ultra-small Touch Screen Devices. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 2511-- 2518.  ",
      "doi": "10.1145/2851581.2892434"
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Ian E. Smith. 2008. Getting off the treadmill: evaluating walking user interfaces for mobile devices in public spaces. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services (MobileHCI'08), 109-- 118.  ",
      "doi": "10.1145/1409240.1409253"
    },
    {
      "text": "Amy K. Karlson, Benjamin B. Bederson, John SanGiovanni, Karlson, and Bederson. 2005. AppLens and launchTile: two designs for onehanded thumb use on small devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 201--210.  ",
      "doi": "10.1145/1054972.1055001"
    },
    {
      "text": "Jesper Kjeldskov and Jan Stage. 2004. New techniques for usability evaluation of mobile systems. International Journal of Human-Computer Studies 60, 5--6: 599--620.",
      "doi": ""
    },
    {
      "text": "Yuki Kubo, Buntarou Shizuki, and Shin Takahashi. 2016. Watch Commander: A Gesture-based Invocation System for Rectangular Smartwatches Using B2B-Swipe. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST'16), 37--39.  ",
      "doi": "10.1145/2984751.2985697"
    },
    {
      "text": "Yuki Kubo, Buntarou Shizuki, and Jiro Tanaka. 2016. B2B-Swipe: Swipe Gesture for Rectangular Smartwatches from a Bezel to a Bezel. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16), 3852-- 3856.  ",
      "doi": "10.1145/2858036.2858216"
    },
    {
      "text": "Jianwei Lai, Dongsong Zhang, and Sen Wang. 2017. ContextZoom: A Single-Handed Partial Zooming Technique for Touch-Screen Mobile Devices. International Journal of Human-Computer Interaction 33, 6: 475--485.",
      "doi": ""
    },
    {
      "text": "Ji Jung Lim and Cary Feria. 2012. Visual search on a mobile device while walking. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12), 295--304.  ",
      "doi": "10.1145/2371574.2371618"
    },
    {
      "text": "Bonnie MacKay, David Dearman, Kori Inkpen, and Carolyn Watters. 2005. Walk 'n scroll: a comparison of software-based navigation techniques for different levels of mobility. Proceedings of the 7th international conference on Human computer interaction with mobile devices {&} services (MobileHCI '05): 183--190.  ",
      "doi": "10.1145/1085777.1085808"
    },
    {
      "text": "Sylvain Malacria, Eric Lecolinet, and Yves Guiard. 2010. Clutch-free panning and integrated pan-zoom control on touch-sensitive surfaces: the cyclostar approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10), 2615--2624.  ",
      "doi": "10.1145/1753326.1753724"
    },
    {
      "text": "Takashi Miyaki and Jun Rekimoto. 2009. GraspZoom: Zooming and Scrolling Control Model for Single-Handed Mobile Interaction. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09), 11:1--11:4.  ",
      "doi": "10.1145/1613858.1613872"
    },
    {
      "text": "Fan Mo, Jia Zhou, and Shuping Yi. 2017. Adapting the Navigation Interface of Smart Watches to User Movements. International Journal of Human-- Computer Interaction 33, 6: 460--474.",
      "doi": ""
    },
    {
      "text": "Alexander Ng, Stephen A Brewster, and John Williamson. 2013. The Impact of Encumbrance on Mobile Interactions. In Human-Computer Interaction (INTERACT'2013) 13.  ",
      "doi": "10.1145/2628363.2634268"
    },
    {
      "text": "Alexander Ng, Stephen A Brewster, and John H Williamson. Investigating the Effects of Encumbrance on One- and Two- Handed Interactions with Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI'14).  ",
      "doi": "10.1145/2556288.2557312"
    },
    {
      "text": "Alexander Ng, John Williamson, and Stephen Brewster. 2015. The Effects of Encumbrance and Mobility on Touch-Based Gesture Interactions for Mobile Phones. In Proc. of ACM MobileHCI '15, 536--546.  ",
      "doi": "10.1145/2785830.2785853"
    },
    {
      "text": "Alexander Ng, John H. Williamson, and Stephen A. Brewster. 2014. Comparing Evaluation Methods for Encumbrance and Walking on Interaction with Touchscreen Mobile Devices. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14), 23--32.  ",
      "doi": "10.1145/2628363.2628382"
    },
    {
      "text": "Alex Olwal, Steven Feiner, and Susanna Heyman. 2008. Rubbing and tapping for precise and rapid selection on touch-screen displays. In Proc. of ACM CHI '08, 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "D.C. Daniel Robbins, Edward Cutrell, Raman Sarin, and Eric Horvitz. 2004. ZoneZoom: map navigation for smartphones with recursive view segmentation. In Proceedings of the working conference on Advanced visual interfaces (AVI'04), 234.  ",
      "doi": "10.1145/989863.989901"
    },
    {
      "text": "Martin Schedlbauer and Jesse Heines. 2007. Selecting While Walking: An Investigation of Aiming Performance in a Mobile Work Context. AMCIS 2007 Proceedings: 433. Retrieved November 3, 2016 from http://aisel.aisnet.org/amcis2007/433",
      "doi": ""
    },
    {
      "text": "Bastian Schildbach and Enrico Rukzio. 2010. Investigating selection and reading performance on a mobile phone while walking. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services (MobileHCI '10), 93--102.  ",
      "doi": "10.1145/1851600.1851619"
    },
    {
      "text": "Katie A. Siek, Yvonne Rogers, and Kay H. Connelly. 2005. Fat finger worries: How older and younger users physically interact with PDAs. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) (INTERACT'05), 267-- 280.  ",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Jessica J. Tran, Shari Trewin, Calvin Swart, Bonnie E. John, and John C. Thomas. 2013. Exploring pinch and spread gestures on mobile devices. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services (MobileHCI '13), 151--160.  ",
      "doi": "10.1145/2493190.2493221"
    },
    {
      "text": "Kristin Vadas, Nirmal Patel, Kent Lyons, Thad Starner, and Julie Jacko. 2006. Reading On-the-go: A Comparison of Audio and Hand-held Displays. In Proceedings of the 8th Conference on Humancomputer Interaction with Mobile Devices and Services (MobileHCI '06), 219--226.  ",
      "doi": "10.1145/1152215.1152262"
    },
    {
      "text": "Julie R Williamson, Andrew Crossan, and Stephen Brewster. 2011. Multimodal Mobile Interactions: Usability Studies in Real World Settings. In Proceedings of the 13th international conference on multimodal interfaces (ICMI'11), 361--368.  ",
      "doi": "10.1145/2070481.2070551"
    },
    {
      "text": "Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 193--196.  ",
      "doi": "10.1145/2556288.2557017"
    },
    {
      "text": "Shengdong Zhao, Pierre Dragicevic, Mark Chignell, Ravin Balakrishnan, and Patrick Baudisch. 2007. Earpod: Eyes-free Menu Selection Using Touch Input and Reactive Audio Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 1395--1404.  ",
      "doi": "10.1145/1240624.1240836"
    },
    {
      "text": "Icons and Images - watchOS Human Interface Guidelines. Retrieved April 26, 2017 from https://developer.apple.com/watchos/humaninterface-guidelines/icons-and-images/",
      "doi": ""
    },
    {
      "text": "Interactive watch faces - Patterns - Android Wear design guidelines. Retrieved April 26, 2017 from https://www.google.com/design/specwear/patterns/interactive-watchfaces.html#interactive-watch-faces-interactivewatch-faces",
      "doi": ""
    },
    {
      "text": "Design guidelines | Sony Developer World. Retrieved April 26, 2017 from https://developer.sony.com/develop/archivedsdks/smartwatch-2-apis/design-guidelines/",
      "doi": ""
    }
  ]
}