{
  "doi": "10.1145/3173574.3173917",
  "title": "Are You Dreaming?: A Phenomenological Study on Understanding Lucid Dreams as a Tool for Introspection in Virtual Reality",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Virtual reality (VR) is resurging in popularity with the advancement of low-cost hardware and more realistic graphics. How might this technology help others? That is, to increase mental well-being? The ultimate VR might look like lucid dreaming, the phenomenon of knowing one is dreaming while in the dream. Lucid dreaming can be used as an introspective tool and, ultimately, increase mental well-being. What these introspective experiences are like for lucid dreamers might be key in determining specific design guidelines for future creation of a technological tool used for helping people examine their own thoughts and emotions. This study describes nine active and proficient lucid dreamers' representations of their introspective experiences gained through phenomenological interviews. Four major themes emerged: sensations and feelings, actions and practices, influences on experience, and meaning making. This knowledge can help design a VR system that is grounded in genuine experience and preserving the human condition.",
  "tags": [
    "lucid dreaming",
    "design",
    "virtual reality",
    "introspection",
    "positive technology",
    "well-being"
  ],
  "authors": [
    {
      "name": "Alexandra Kitson",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-99658739432/rel-imgonly/img_2107.jpg",
      "acmid": "99658739432",
      "orcid": "missing"
    },
    {
      "name": "Thecla Schiphorst",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409594757",
      "orcid": "missing"
    },
    {
      "name": "Bernhard E. Riecke",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-81100113270/rel-imgonly/bernhardriecke-hikingstawamuschief_small.jpg",
      "acmid": "81100113270",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark T. Bevan. 2014. A method of phenomenological interviewing. Qualitative health research 24, 1: 136--144.",
      "doi": ""
    },
    {
      "text": "Cristina Botella, Rosa Maria Banos, and Veronica Guillen. 2017. Positive Technologies for Improving Health and WellBeing. In Positive Psychology Interventions in Practice, Carmel Proctor (ed.). Springer International Publishing, 219--234.",
      "doi": ""
    },
    {
      "text": "Doug A. Bowman and Ryan P. McMahan. 2007. Virtual Reality: How Much Immersion Is Enough? Computer 40, 7: 36--43.  ",
      "doi": "10.1109/MC.2007.257"
    },
    {
      "text": "F. P. Brooks. 1999. What's real about virtual reality? IEEE Computer Graphics and Applications 19, 6: 16--27.  ",
      "doi": "10.1109/38.799723"
    },
    {
      "text": "Alex Byrne. 2005. Introspection. Philosophical Topics 33, 1: 79--104.",
      "doi": ""
    },
    {
      "text": "R. Byrne, J. Marshall, and F. Mueller. 2016. Balance ninja: towards the design of digital vertigo games via galvanic vestibular stimulation. 159--170. Retrieved November 19, 2017 from https://researchbank.rmit.edu.au/view/rmit:38669  ",
      "doi": "10.1145/2967934.2968080"
    },
    {
      "text": "Rafael A. Calvo and Dorian Peters. 2014. Positive Computing: Technology for Wellbeing and Human Potential. MIT Press. ",
      "doi": "10.5555/2627995"
    },
    {
      "text": "Rafael A. Calvo and Dorian Peters. 2015. Introduction to Positive Computing: Technology That Fosters Wellbeing. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 2499--2500.  ",
      "doi": "10.1145/2702613.2706674"
    },
    {
      "text": "E. N. Carlson. 2013. Overcoming the Barriers to SelfKnowledge: Mindfulness as a Path to Seeing Yourself as You Really Are. Perspectives on Psychological Science 8, 2: 173--186.",
      "doi": ""
    },
    {
      "text": "Sebnem Cilesiz. 2011. A phenomenological approach to experiences with technology: current state, promise, and future directions for research. Educational Technology Research and Development 59, 4: 487--510.",
      "doi": ""
    },
    {
      "text": "John W. Creswell. 2012. Qualitative Inquiry and Research Design: Choosing Among Five Approaches. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "James J. Cummings and Jeremy N. Bailenson. 2016. How Immersive Is Enough? A Meta-Analysis of the Effect of Immersive Technology on User Presence. Media Psychology 19, 2: 272--309.",
      "doi": ""
    },
    {
      "text": "Bradley Dengler, Naomi Sayre, Viktor Bartanusz, David F. Jimenez, and Alexander Mark Papanastassiou. 2015. Bilateral Stimulation of the Amygdala Treats the Anxiety Component of Posttraumatic Stress Disorder by Upregulation of the Neuropeptide Y System. Neurosurgery 62, CN_suppl_1: 207--207.",
      "doi": ""
    },
    {
      "text": "Julia Diemer, Georg W. Alpers, Henrik M. Peperkorn, Youssef Shiban, and Andreas Mühlberger. 2015. The impact of perception and presence on emotional reactions: a review of research in virtual reality. Frontiers in Psychology 6: 26.",
      "doi": ""
    },
    {
      "text": "G. William Domhoff. 2000. Methods and measures for the study of dream content. Principles and practices of sleep medicine 3: 463--471.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the action is: the foundations of embodied interaction. MIT Press, Cambridge, Mass. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Martin Dresler, Renate Wehrle, Victor I. Spoormaker, Stefan P. Koch, Florian Holsboer, Axel Steiger, Hellmuth Obrig, Philipp G. Sämann, and Michael Czisch. 2012. Neural Correlates of Dream Lucidity Obtained from Contrasting Lucid versus Non-Lucid REM Sleep: A Combined EEG/fMRI Case Study. SLEEP.",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. 2007. Persuade Into What? Why HumanComputer Interaction Needs a Philosophy of Technology. In Persuasive Technology (Lecture Notes in Computer Science), 295--306. ",
      "doi": "10.5555/1780402.1780450"
    },
    {
      "text": "Daniel Fallman. 2011. The New Good: Exploring the Potential of Philosophy of Technology to Contribute to Human-computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1051--1060.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "D. Freeman, S. Reeve, A. Robinson, A. Ehlers, D. Clark, B. Spanlang, and M. Slater. 2017. Virtual reality in the assessment, understanding, and treatment of mental health disorders. Psychological Medicine: 1--8.",
      "doi": ""
    },
    {
      "text": "J. Gackenbach and Stephen LaBerge. 2012. Conscious Mind, Sleeping Brain: Perspectives on Lucid Dreaming. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "J. Gackenbach and Stephen LaBerge. 2012. Conscious Mind, Sleeping Brain: Perspectives on Lucid Dreaming. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Andrea Gaggioli, Giuseppe Riva, Dorian Peters, and Rafael A. Calvo. 2017. Positive Technology, Computing, and Design: Shaping a Future in Which Technology Promotes Psychological Well-Being. In Emotions and Affect in Human Factors and Human-Computer Interaction. Elsevier, 477-- 502.",
      "doi": ""
    },
    {
      "text": "Shaun Gallagher. 2013. Phenomenology. The Encyclopedia of Human-Computer Interaction.",
      "doi": ""
    },
    {
      "text": "L. J. Gerry. 2017. Paint with Me: Stimulating Creativity and Empathy While Painting with a Painter in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4: 1418--1426.  ",
      "doi": "10.1109/TVCG.2017.2657239"
    },
    {
      "text": "Amedeo Giorgi. 1985. Phenomenology and psychological research. Duquesne.",
      "doi": ""
    },
    {
      "text": "Kelly S. Hale and Kay M. Stanney. 2002. Handbook of Virtual Environments: Design, Implementation, and Applications. CRC Press.",
      "doi": ""
    },
    {
      "text": "K. M. T. Hearne. 1978. Lucid dreams?: an elecrophysiological and psychological study. Liverpool University. Retrieved December 12, 2016 from http://ethos.bl.uk/OrderDetails.do?uin=uk.bl.ethos.458729",
      "doi": ""
    },
    {
      "text": "J. Allan Hobson. 2002. The Dream Drugstore: Chemically Altered States of Consciousness. MIT Press.",
      "doi": ""
    },
    {
      "text": "Andrew Holecek. 2016. Dream Yoga: Illuminating Your Life Through Lucid Dreaming and the Tibetan Yogas of Sleep. Sounds True.",
      "doi": ""
    },
    {
      "text": "D. Ihde. 2012. Technics and Praxis: A Philosophy of Technology. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Anna L. Cox, Paul Cairns, Samira Dhoparee, Andrew Epps, Tim Tijs, and Alison Walton. 2008. Measuring and Defining the Experience of Immersion in Games. Int. J. Hum.-Comput. Stud. 66, 9: 641--661.  ",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Jason Jerald. 2016. The VR Book: Human-Centered Design for Virtual Reality. Association for Computing Machinery and Morgan & Claypool, New York, NY, USA. ",
      "doi": "10.1145/2792790"
    },
    {
      "text": "H Kohut. 1982. Introspection, empathy and the semi-circle of mental health. The International Journal of PsychoAnalysis 63, 395. Retrieved December 12, 2016 from http://search.proquest.com/openview/78d62f13ea0ccc80db96feba69122b0c/1?pq-origsite=gscholar&cbl=1818729",
      "doi": ""
    },
    {
      "text": "Stephen LaBerge. 2000. Lucid dreaming: Evidence and methodology. Behavioral and Brain Sciences 23, 6: 962-- 964.",
      "doi": ""
    },
    {
      "text": "Stephen Laberge. 2009. Lucid Dreaming: A Concise Guide to Awakening in Your Dreams and in Your Life. ReadHowYouWant.com.",
      "doi": ""
    },
    {
      "text": "Stephen LaBerge. 2014. Lucid dreaming: Paradoxes of dreaming consciousness. In Varieties of anomalous experience: Examining the scientific evidence, 2nd ed, E. Carde, S. J. Lynn and S. Krippner (eds.). American Psychological Association, Washington, DC, US, 145--173.",
      "doi": ""
    },
    {
      "text": "Stephen LaBerge, Lynne Levitan, and William C. Dement. 1986. Lucid dreaming: Physiological correlates of consciousness during REM sleep. Journal of Mind and Behavior 7, 2--3: 251--258.",
      "doi": ""
    },
    {
      "text": "Stephen LaBerge and L. D. P. Verifield. 1990. Lucid dreaming: Psychophysiological studies of consciousness during REM sleep.",
      "doi": ""
    },
    {
      "text": "Fabien Lotte, Josef Faller, Christoph Guger, Yann Renard, Gert Pfurtscheller, Anatole Lécuyer, and Robert Leeb. 2012. Combining BCI with Virtual Reality: Towards New Applications and Improved BCI. In Towards Practical Brain-Computer Interfaces. Springer, Berlin, Heidelberg, 197--220.",
      "doi": ""
    },
    {
      "text": "Norman Malcolm. 1956. Dreaming and Skepticism. The Philosophical Review 65, 1: 14--37.",
      "doi": ""
    },
    {
      "text": "Daniel Mestre and Jean-Louis Vercher. 2011. Immersion and presence. In Virtual Reality. CRC Press.",
      "doi": ""
    },
    {
      "text": "Julia Mossbridge. 2016. Designing Transcendence Technology. In Psychology's New Design Science and the Reflective Practitioner. 1--27.",
      "doi": ""
    },
    {
      "text": "Clark Moustakas. 1994. Phenomenological research methods. Sage.",
      "doi": ""
    },
    {
      "text": "Florian 'Floyd' Mueller, Gunnar Stevens, Alex Thorogood, Shannon O'Brien, and Volker Wulf. 2007. Sports over a Distance. Personal Ubiquitous Comput. 11, 8: 633--645.  ",
      "doi": "10.1007/s00779-006-0133-0"
    },
    {
      "text": "David Opriş, Sebastian Pintea, Azucena García-Palacios, Cristina Botella, Ştefan Szamosközi, and Daniel David. 2012. Virtual reality exposure therapy in anxiety disorders: a quantitative meta-analysis. Depression and Anxiety 29, 2: 85--93.",
      "doi": ""
    },
    {
      "text": "Thomas D. Parsons and Albert A. Rizzo. 2008. Affective outcomes of virtual reality exposure therapy for anxiety and specific phobias: A meta-analysis. Journal of Behavior Therapy and Experimental Psychiatry 39, 3: 250--261.",
      "doi": ""
    },
    {
      "text": "Rakesh Patibanda, Florian \"Floyd\" Mueller, Matevz Leskovsek, and Jonathan Duckworth. 2017. Life Tree: Understanding the Design of Breathing Exercise Games. 19-- 31.  ",
      "doi": "10.1145/3116595.3116621"
    },
    {
      "text": "B. E. Riecke, J. Schulte-Pelkum, Franck Caniard, and H. H Bülthoff. 2005. Towards Lean and Elegant Self-Motion Simulation in Virtual Reality. In Proceedings of IEEE Virtual Reality 2005, 131--138. Retrieved from http://www.kyb.mpg.de/publication.html?publ=2904  ",
      "doi": "10.1109/VR.2005.83"
    },
    {
      "text": "Giuseppe Riva, Rosa M. Ba?os, Cristina Botella, Brenda K. Wiederhold, and Andrea Gaggioli. 2012. Positive Technology: Using Interactive Technologies to Promote Positive Functioning. Cyberpsychology, Behavior, and Social Networking 15, 2: 69--77.",
      "doi": ""
    },
    {
      "text": "Giuseppe Riva, Fabrizia Mantovani, Claret Samantha Capideville, Alessandra Preziosa, Francesca Morganti, Daniela Villani, Andrea Gaggioli, Cristina Botella, and Mariano Alcañiz. 2007. Affective Interactions Using Virtual Reality: The Link between Presence and Emotions. CyberPsychology & Behavior 10, 1: 45--56.",
      "doi": ""
    },
    {
      "text": "Joan Sol Roo, Renaud Gervais, Jeremy Frey, and Martin Hachet. 2017. Inner Garden: Connecting Inner States to a Mixed Reality Sandbox for Mindfulness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 1459--1470.  ",
      "doi": "10.1145/3025453.3025743"
    },
    {
      "text": "Joan Sol Roo, Renaud Gervais, and Martin Hachet. 2016. Inner Garden: An Augmented Sandbox Designed for SelfReflection. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16), 570--576.  ",
      "doi": "10.1145/2839462.2856532"
    },
    {
      "text": "Barbara O. Rothbaum, Albert \"Skip\" Rizzo, and JoAnn Difede. 2010. Virtual reality exposure therapy for combatrelated posttraumatic stress disorder. Annals of the New York Academy of Sciences 1208, 1: 126--132.",
      "doi": ""
    },
    {
      "text": "Melanie Schädlich and Daniel Erlacher. 2012. Applications of lucid dreams: An online study. International Journal of Dream Research 5, 2: 134--138.",
      "doi": ""
    },
    {
      "text": "Chris D. Shaw, Diane Gromala, and Meehae Song. 2010. The Meditation Chamber: Towards Self-Modulation. In Meta-Plasticity in Virtual Worlds: Aesthetics and Semantics Concepts (in press). Mura, G., ed. Hershey, PA: IGI Global.",
      "doi": ""
    },
    {
      "text": "E. Sikstrom, A. de Gotzen, and S. Serafin. 2015. Wings and flying in immersive VR #x2014; Controller type, sound effects and experienced ownership and agency. In 2015 IEEE Virtual Reality (VR), 281--282.",
      "doi": ""
    },
    {
      "text": "Daniel Sproll, Jacob Freiberg, Timofey Grechkin, and Bernhard E. Riecke. 2013. Poster: Paving the way into virtual reality-a transition in five stages. In 3D User Interfaces (3DUI), 2013 IEEE Symposium on, 175--176. Retrieved May 23, 2016 from http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=655023",
      "doi": ""
    },
    {
      "text": "Isaac Y. Taitz. 2014. Clinical Applications of Lucid Dreaming Therapy. Lucid Dreaming: New Perspectives on Consciousness in Sleep {2 volumes}: New Perspectives on Consciousness in Sleep: 167.",
      "doi": ""
    },
    {
      "text": "Xin Tong, Diane Gromala, Bernhard E. Riecke, Chris D. Shaw, Thomas Loughin, and Mehdi Karamnejad. 2014. Usability Comparisons of Head-Mounted vs. Immersive Desktop Displays for Pain Management in Virtual Reality.",
      "doi": ""
    },
    {
      "text": "Lucia R. Valmaggia, Leila Latif, Matthew J. Kempton, and Maria Rus-Calafell. 2016. Virtual reality in the psychological treatment for mental health problems: An systematic review of recent evidence. Psychiatry Research 236: 189--195.",
      "doi": ""
    },
    {
      "text": "Jay Vidyarthi, Bernhard E. Riecke, and Diane Gromala. 2012. Sonic Cradle: Designing for an Immersive Experience of Meditation by Connecting Respiration to Music. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 408--417.  ",
      "doi": "10.1145/2317956.2318017"
    },
    {
      "text": "Ursula Voss, Romain Holzmann, Allan Hobson, Walter Paulus, Judith Koppehele-Gossel, Ansgar Klimke, and Michael A. Nitsche. 2014. Induction of self awareness in dreams through frontal low current stimulation of gamma activity. Nature Neuroscience 17, 6: 810--812.",
      "doi": ""
    },
    {
      "text": "Ursula Voss, Romain Holzmann, Inka Tuin, and J. Allan Hobson. 2009. Lucid dreaming: a state of consciousness with features of both waking and non-lucid dreaming. Sleep 32, 9: 1191--1200.",
      "doi": ""
    },
    {
      "text": "Ann Webster-Wright. 2010. Authentic Professional Learning. In Authentic Professional Learning. Springer, Dordrecht, 107--142.",
      "doi": ""
    },
    {
      "text": "Mark D. Wiederhold and Brenda K. Wiederhold. 2007. Virtual Reality and Interactive Simulation for Pain Distraction. Pain Medicine 8: S182--S188.",
      "doi": ""
    }
  ]
}