{
  "doi": "10.1145/3173574.3173879",
  "title": "Eliciting Users' Demand for Interface Features",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "How valuable are certain interface features to their users? How can users' demand for features be quantified? To address these questions, users' demand curve for the sorting feature was elicited in a controlled experiment, using personal finance as the user context. Users made ten rounds of investment allocation across up to 77 possible funds, thus encountering choice overload, typical of many online environments. Users were rewarded for positive investment returns. To overcome choice overload, users could sort the alternatives based on product attributes (fees, category, fund name, past performance). To elicit their demand for sorting, the experimental design enabled users to forgo 0%-9% of their reward in return for activating the sorting feature. The elicited downward sloping demand curve suggests a curvilinear relationship between sorting use and cost. More broadly, the study offers a way to quantify user demand of UI features, and a basis for comparison between features.",
  "authors": [
    {
      "name": "Oded Nov",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339520089",
      "orcid": "missing"
    },
    {
      "name": "Han Su",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261680",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Erik Andersen, Yun-En Liu, Rich Snider, Roy Szeto, and Zoran Popovi?, Placing a value on aesthetics in online casual games. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2011. 1275--1278.  ",
      "doi": "10.1145/1978942.1979131"
    },
    {
      "text": "Tamar Ben-Bassat, Joachim Meyer, and Noam Tractinsky, \"Economic and subjective measures of the perceived value of aesthetics and usability,\" ACM Transactions on Computer-Human Interaction (TOCHI), vol. 13, pp. 210--234, 2006.  ",
      "doi": "10.1145/1165734.1165737"
    },
    {
      "text": "Shlomo Benartzi and Jonah Lehrer, The smarter screen: Surprising ways to influence and improve online behavior: Portfolio, 2015.",
      "doi": ""
    },
    {
      "text": "Dirk Bollen, Bart P Knijnenburg, Martijn C Willemsen, and Mark Graus, Understanding choice overload in recommender systems. Proceedings of the fourth ACM conference on Recommender systems, 2010. 63--70.  ",
      "doi": "10.1145/1864708.1864724"
    },
    {
      "text": "Duncan P Brumby and Andrew Howes, \"Strategies for guiding interactive search: An empirical investigation into the consequences of label relevance for assessment and selection,\" Human--Computer Interaction, vol. 23, pp. 1--46, 2008.",
      "doi": ""
    },
    {
      "text": "Duncan P Brumby, Andrew Howes, and Dario D Salvucci, A cognitive constraint model of dual-task trade-offs in a highly dynamic driving task. Proceedings of the SIGCHI conference on Human factors in computing systems, 2007. 233--242.  ",
      "doi": "10.1145/1240624.1240664"
    },
    {
      "text": "Justin Cheng, Jaime Teevan, and Michael S Bernstein, Measuring crowdsourcing effort with error-time curves. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2015. 1365--1374.  ",
      "doi": "10.1145/2702123.2702145"
    },
    {
      "text": "Alexander Chernev, Ulf Böckenholt, and Joseph Goodman, \"Choice overload: A conceptual review and meta-analysis,\" Journal of Consumer Psychology, vol. 25, pp. 333--358, 2015.",
      "doi": ""
    },
    {
      "text": "Elizabeth F Churchill, \"The ROI of HCI,\" ACM Interactions, vol. 24, pp. 22--23, 2017.  ",
      "doi": "10.1145/3068100"
    },
    {
      "text": "Sunny Consolvo, David W McDonald, and James A Landay, Theory-driven design strategies for technologies that support behavior change in everyday life. Proceedings of the SIGCHI conference on human factors in computing systems, 2009. 405--414.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Anna Louise Cox and Richard M Young, A Rational Model of the Effect of Information Scent on the Exploration of Menus. ICCM, 2004. 82--87.",
      "doi": ""
    },
    {
      "text": "Meg Cramer and Gillian R. Hayes, The digital economy: a case study of designing for classrooms. Proceedings of the 12th International Conference on Interaction Design and Children, New York, New York, 2013. 431--434.  ",
      "doi": "10.1145/2485760.2485832"
    },
    {
      "text": "Jonathan D D'Angelo and Catalina L Toma, \"There are plenty of fish in the sea: The effects of choice overload and reversibility on online daters' satisfaction with selected partners,\" Media Psychology, vol. 20, pp. 1--27, 2017.",
      "doi": ""
    },
    {
      "text": "Djellel Eddine Difallah, Michele Catasta, Gianluca Demartini, Panagiotis G Ipeirotis, and Philippe Cudré- Mauroux, The dynamics of micro-task crowdsourcing: The case of amazon mturk. Proceedings of the 24th International Conference on World Wide Web, 2015. 238--247.  ",
      "doi": "10.1145/2736277.2741685"
    },
    {
      "text": "Ido Erev and Daniel Gopher, \"A cognitive gametheoretic analysis of attention strategies, ability, and incentives,\" Attention and performance XVII: Cognitive regulation of performance: Interaction of theory and application, pp. 343--371, 1999.",
      "doi": ""
    },
    {
      "text": "Robert H Frank, Ben Bernanke, and Louis Dorrance Johnston, Principles of economics: McGrawHill/Irwin New York, 2007.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Leah Findlater, and James Landay, The design of eco-feedback technology. Proceedings of the SIGCHI conference on human factors in computing systems, 2010. 1999--2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Daniel G Goldstein, Siddharth Suri, R Preston McAfee, Matthew Ekstrand-Abueg, and Fernando Diaz, \"The economic and cognitive costs of annoying display advertisements,\" Journal of Marketing Research, vol. 51, pp. 742--752, 2014.",
      "doi": ""
    },
    {
      "text": "Rebecca Gulotta, William Odom, Jodi Forlizzi, and Haakon Faste, Digital artifacts as legacy: exploring the lifespan and value of digital data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2013. 1813--1822.  ",
      "doi": "10.1145/2470654.2466240"
    },
    {
      "text": "Junius Gunaratne and Oded Nov, \"Informing and Improving Retirement Saving Performance using Behavioral Economics Theory-driven User Interfaces,\" presented at the Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, Seoul, Republic of Korea, 2015.  ",
      "doi": "10.1145/2702123.2702408"
    },
    {
      "text": "Junius Gunaratne and Oded Nov, \"Using interactive \"Nutrition labels\" for financial products to assist decision making under uncertainty,\" Journal of the Association for Information Science and Technology, vol. 68, pp. 1836--1849, 2017.  ",
      "doi": "10.1002/asi.23844"
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Harri Sarsa, Does gamification work?--a literature review of empirical studies on gamification. System Sciences (HICSS), 2014 47th Hawaii International Conference on, 2014. 3025--3034.  ",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Eric B Hekler, Predrag Klasnja, Jon E Froehlich, and Matthew P Buman, Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2013. 3307--3316.  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Simo Hosio, Denzil Ferreira, Jorge Goncalves, Niels van Berkel, Chu Luo, et al., Monetary assessment of battery life on smartphones. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 2016. 1869--1880.  ",
      "doi": "10.1145/2858036.2858285"
    },
    {
      "text": "Eric J Johnson, Suzanne B Shu, Benedict GC Dellaert, Craig Fox, Daniel G Goldstein, et al., \"Beyond nudges: Tools of a choice architecture,\" Marketing Letters vol. 23, pp. 487--504, 2012.",
      "doi": ""
    },
    {
      "text": "Joseph Jofish Kaye, Mary McCuistion, Rebecca Gulotta, and David A Shamma, Money talks: tracking personal finances. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 2014. 521--530.  ",
      "doi": "10.1145/2556288.2556975"
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt, How to evaluate technologies for health behavior change in HCI research. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2011. 3063--3072.  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Ron Kohavi, Randal M Henne, and Dan Sommerfield, Practical guide to controlled experiments on the web: listen to your customers not to the hippo. Proceedings of the 13th ACM SIGKDD international conference on Knowledge discovery and data mining, 2007. 959- 967.  ",
      "doi": "10.1145/1281192.1281295"
    },
    {
      "text": "Airi Lampinen and Barry Brown, Market Design for HCI: Successes and Failures of Peer-to-Peer Exchange Platforms. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2017. 4331--4343.  ",
      "doi": "10.1145/3025453.3025515"
    },
    {
      "text": "Andreu Mas-Colell, Michael Whinston, and J Green, Microeconomic Theory, 2004.",
      "doi": ""
    },
    {
      "text": "Maureen Morrin, Susan Broniarczyk, J Jeffrey Inman, and John Broussard, \"Saving for retirement: The effects of fund assortment size and investor knowledge on asset allocation strategies,\" Journal of Consumer Affairs, vol. 42, pp. 206--222, 2008.",
      "doi": ""
    },
    {
      "text": "David P Myatt, Hyun Song Shin, and Chris Wallace, \"The assessment: games and coordination,\" Oxford Review of Economic Policy, vol. 18, pp. 397--417, 2002.",
      "doi": ""
    },
    {
      "text": "Oded Nov, Ofer Arazy, Claudia Lopez, and Peter Brusilovsky, Exploring personality-targeted UI design in online social participation systems. CHI 2013: Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, Paris, France, 2013.  ",
      "doi": "10.1145/2470654.2470707"
    },
    {
      "text": "Kenton P O'Hara and Stephen J Payne, \"The effects of operator implementation cost on planfulness of problem solving and learning,\" Cognitive psychology, vol. 35, pp. 34--70, 1998.",
      "doi": ""
    },
    {
      "text": "Nathaniel Popper, \"Silicon Valley Tried to Upend Banks. Now It Works With Them.,\" in New York Times, ed, 2017.",
      "doi": ""
    },
    {
      "text": "Rasmus Prentow, Rasmus Steiniche, Simone D Johansen, Jeni Paay, Ivan Aaen, and Jesper Kjeldskov, When value is greater than money: a micropayment system in Uganda. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, 2015. 765--772.  ",
      "doi": "10.1145/2702613.2702970"
    },
    {
      "text": "Katharina Reinecke and Abraham Bernstein, \"Improving performance, perceived usability, and aesthetics with culturally adaptive user interfaces,\" ACM Transactions on Computer-Human Interaction (TOCHI), vol. 18, p. 8, 2011.  ",
      "doi": "10.1145/1970378.1970382"
    },
    {
      "text": "Paul Samuelson, \"Complementarity: an essay on the 40th anniversary of the Hicks-Allen revolution in demand theory,\" Journal of Economic Literature, vol. 12, pp. 1255--1289, 1974.",
      "doi": ""
    },
    {
      "text": "Sheena Sethi-Iyengar, Gur Huberman, and Wei Jiang, \"How much choice is too much? Contributions to 401 (k) retirement plans,\" Pension design and structure: New lessons from behavioral finance, vol. 83, pp. 84- 87, 2004.",
      "doi": ""
    },
    {
      "text": "Yaron Singer and Manas Mittal, Pricing mechanisms for crowdsourcing markets. Proceedings of the 22nd international conference on World Wide Web, 2013. 1157--1166.  ",
      "doi": "10.1145/2488388.2488489"
    },
    {
      "text": "Heshan Sun, \"Developing an interdisciplinary area of economics and human-computer interaction,\" AIS Transactions on Human-Computer Interaction, vol. 2, pp. 151--166, 2010.",
      "doi": ""
    },
    {
      "text": "Lucia Terrenghi, David Kirk, Abigail Sellen, and Shahram Izadi, Affordances for manipulation of physical versus digital media on interactive surfaces. Proceedings of the SIGCHI conference on Human factors in computing systems, 2007. 1157--1166.  ",
      "doi": "10.1145/1240624.1240799"
    },
    {
      "text": "Michael Toomim, Travis Kriplean, Claus Pörtner, and James Landay, Utility of human-computer interactions: Toward a science of preference measurement. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2011. 2275--2284.  ",
      "doi": "10.1145/1978942.1979277"
    },
    {
      "text": "Yuan-Chi Tseng and Andrew Howes, \"The adaptation of visual search to utility, ecology and design,\" International Journal of Human-Computer Studies, vol. 80, pp. 45--55, 2015.  ",
      "doi": "10.1016/j.ijhcs.2015.03.005"
    },
    {
      "text": "Alonso Vera, Andrew Howes, Michael McCurdy, and Richard L Lewis, A constraint satisfaction approach to predicting skilled interactive cognition. Proceedings of the SIGCHI conference on Human factors in computing systems, 2004. 121--128.  ",
      "doi": "10.1145/985692.985708"
    },
    {
      "text": "Jo Vermeulen, Kris Luyten, Elise van den Hoven, and Karin Coninx, Crossing the bridge over Norman's Gulf of Execution: revealing feedforward's true identity. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2013. 1931- 1940.  ",
      "doi": "10.1145/2470654.2466255"
    },
    {
      "text": "John Vines, Paul Dunphy, and Andrew Monk, Pay or delay: the role of technology when managing a low income. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Toronto, ON, Canada, 2014.  ",
      "doi": "10.1145/2556288.2556961"
    },
    {
      "text": "Susan Wyche and Charles Steinfield, \"Why don't farmers use cell phones to access market prices? technology affordances and barriers to market information services adoption in rural Kenya,\" Information Technology for Development, vol. 22, pp. 320--333, 2016.  ",
      "doi": "10.1080/02681102.2015.1048184"
    }
  ]
}