{
  "doi": "10.1145/3173574.3173887",
  "title": "Methods for Intentional Encoding of High Capacity Human-Designable Visual Markers",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Previous techniques for human-designable visual markers have focused on small encoding spaces, and assume artists do not need to encode specific bit representations. We present a general framework for human-designable visual markers for artists to encode specific bit representations in large spaces. A three-part study, conducted over three weeks, methodically evaluates the usability of different encoding methods when artists encode specific bit representations. The methods span different shape characteristics suitable for artist encoding (convexity, hollowness, number, size, and distance from centroid) and visualization tools are proposed to aid in this process. We further demonstrate that any of the methods presented may be practically used to encode a URL with the aid of a universally available database like TinyURL (rather than a task-specific database), making human-designable visual markers practical for applications such as advertisements.",
  "tags": [
    "encoding",
    "fiducial marker",
    "designable marker",
    "user study"
  ],
  "authors": [
    {
      "name": "Joshua D. A. Jung",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261207",
      "orcid": "missing"
    },
    {
      "name": "Daniel Vogel",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81100054467/rel-imgonly/purple_shirt_selfie_redmond.jpg",
      "acmid": "81100054467",
      "orcid": "0000-0001-7620-0541"
    }
  ],
  "references": [
    {
      "text": "2017. Barcode Generator. (2017). https://www.barcodesinc.com/generator/",
      "doi": ""
    },
    {
      "text": "2017. QR Code Generator. (2017). http://www.qr-code-generator.com/",
      "doi": ""
    },
    {
      "text": "2017. TinyURL. (2017). http://tinyurl.com/",
      "doi": ""
    },
    {
      "text": "Ross Bencina, Martin Kaltenbrunner, and Sergi Jorda. 2005. Improved topological fiducial tracking in the reactivision system. In Computer Vision and Pattern Recognition-Workshops, 2005. CVPR Workshops. IEEE Computer Society Conference on. IEEE, 99--99.  ",
      "doi": "10.1109/CVPR.2005.475"
    },
    {
      "text": "Enrico Costanza and Jeffrey Huang. 2009. Designable visual markers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1879--1888.  ",
      "doi": "10.1145/1518701.1518990"
    },
    {
      "text": "Enrico Costanza and Mirja Leinss. 2006. Telling a story on a tag: the importance of markers' visual design for real world applications. In Workshop Mobile Interaction with the Real World (MIRW 2006) in conjunction with 8th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI 2006), Espoo, Finland. Citeseer.",
      "doi": ""
    },
    {
      "text": "Enrico Costanza and John Robinson. 2003. A Region Adjacency Tree Approach to the Detection and Design of Fiducials. (2003).",
      "doi": ""
    },
    {
      "text": "Mara Dionisio, Valentina Nisi, and Jos P Van Leeuwen. 2010. The iLand of Madeira location aware multimedia stories. In Joint International Conference on Interactive Digital Storytelling. Springer, 147--152. ",
      "doi": "10.5555/1926497.1926521"
    },
    {
      "text": "David L Hecht. 1994. Embedded data glyph technology for hardcopy digital documents. In IS&T/SPIE 1994 International Symposium on Electronic Imaging: Science & Technology. International Society for Optics and Photonics, 341--352.",
      "doi": ""
    },
    {
      "text": "Shinichi Higashino, Sakiko Nishi, and Ryuuki Sakamoto. 2016. ARTTag: aesthetic fiducial markers based on circle pairs. In ACM SIGGRAPH 2016 Posters. ACM, 38.  ",
      "doi": "10.1145/2945078.2945116"
    },
    {
      "text": "ISO. 2015. Information technology -- Automatic identification and data capture techniques -- QR Code bar code symbology specification. ISO 18004:2015. International Organization for Standardization, Geneva, Switzerland.",
      "doi": ""
    },
    {
      "text": "David J Johnston and Adrian F Clark. 2003. A Vision-Based Location System using Fiducials.. In VVG. 159--166.",
      "doi": ""
    },
    {
      "text": "Rupert Meese, Shakir Ali, Emily-Clare Thorne, Steve D Benford, Anthony Quinn, Richard Mortier, Boriana N Koleva, Tony Pridmore, and Sharon L Baurley. 2013. From codes to patterns: designing interactive decoration for tableware. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 931--940.  ",
      "doi": "10.1145/2470654.2466119"
    },
    {
      "text": "Takao Nakamura, Atsushi Katayama, Masashi Yamamuro, and Noboru Sonehara. 2006. Fast watermark detection scheme from camera-captured images on mobile phones. International Journal of Pattern Recognition and Artificial Intelligence 20, 04 (2006), 543--564.",
      "doi": ""
    },
    {
      "text": "William Preston, Steve Benford, Emily-Clare Thorn, Boriana Koleva, Stefan Rennick-Egglestone, Richard Mortier, Anthony Quinn, John Stell, and Michael Worboys. 2017. Enabling hand-crafted visual markers at scale. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 1227--1237.  ",
      "doi": "10.1145/3064663.3064746"
    },
    {
      "text": "Norman J Woodland and Silver Bernard. 1952. Classifying apparatus and method. (Oct. 7 1952). US Patent 2,612,994.",
      "doi": ""
    }
  ]
}