{
  "doi": "10.1145/3173574.3174142",
  "title": "Designing the Audience Journey through Repeated Experiences",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We report on the design, premiere and public evaluation of a multifaceted audience interface for a complex non-linear musical performance called Climb! which is particularly suited to being experienced more than once. This interface is designed to enable audiences to understand and appreciate the work, and integrates a physical instrument and staging, projected visuals, personal devices and an online archive. A public premiere concert comprising two performances of Climb! revealed how the audience reoriented to the second performance through growing understanding and comparison to the first. Using trajectories as an analytical framework for the audience 'journey' made apparent: how the trajectories of a single performance are embedded within the larger trajectories of a concert and the creative work as a whole; the distinctive demands of understanding and interpretation; and the potential of the archive in enabling appreciation across repeated performances.",
  "tags": [
    "performance",
    "spectator interfaces",
    "instrument",
    "public displays",
    "music",
    "piano",
    "archives",
    "trajectory",
    "journey"
  ],
  "authors": [
    {
      "name": "Steve Benford",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Chris Greenhalgh",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100557223/rel-imgonly/chrisgreenhalghsmall.jpg",
      "acmid": "81100557223",
      "orcid": "missing"
    },
    {
      "name": "Adrian Hazzard",
      "institution": "University of Nottingham, Nottingham, Nottinghamshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958943157",
      "orcid": "missing"
    },
    {
      "name": "Alan Chamberlain",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100146006/rel-imgonly/ac.jpg",
      "acmid": "81100146006",
      "orcid": "0000-0002-2122-8077"
    },
    {
      "name": "Maria Kallionpää",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658760164",
      "orcid": "missing"
    },
    {
      "name": "David M. Weigl",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658630103",
      "orcid": "missing"
    },
    {
      "name": "Kevin R. Page",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100469042",
      "orcid": "missing"
    },
    {
      "name": "Mengdie Lin",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261720",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Louise Barkhuus and Tobias Jørgensen. 2008. Engaging the crowd: studies of audience-performer interaction. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 2925--2930.  ",
      "doi": "10.1145/1358628.1358785"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Andy Crabtree, Martin Flintham, Brendan Walker, Joe Marshall, Boriana Koleva, Stefan Rennick Egglestone, Gabriella Giannachi, Matt Adams, Nick Tandavanitj, and Ju Row Farr. 2013. Performance-Led Research in the Wild. ACM Trans. Comput.-Hum. Interact. 20, 3, Article 14 (July 2013).  ",
      "doi": "10.1145/2491500.2491502"
    },
    {
      "text": "Dawn Bennett and Jane Ginsborg. 2017. Audience Reactions to the Program Notes of Unfamiliar Music. Psychology of Music.",
      "doi": ""
    },
    {
      "text": "Florent Berthaut, Mark T. Marshall, Sriram Subramanian and Martin Hachet. 2013. Rouages: Revealing the mechanisms of digital musical instruments to the audience. In New Interfaces for Musical Expression, May 2013, Daejeon, South Korea.",
      "doi": ""
    },
    {
      "text": "S. Astrid Bin, Nick Bryan-Kinns, and Andrew P. McPherson. 2016. Skip the Pre-Concert Demo: How Technical Familiarity and Musical Style Affect Audience Response. In NIME'16, July 11-15, 2016, Griffith University, Brisbane, Australia.",
      "doi": ""
    },
    {
      "text": "Alan S. Brown and Jennifer L. Novak. 2007. Assessing the intrinsic impacts of a live performance. San Francisco, CA: WolfBrown.",
      "doi": ""
    },
    {
      "text": "Pablo Cesar, Dick C.A. Bulterman and A.J. Jansen. 2008. Usages of the secondary screen in an interactive television environment: Control, enrich, share, and transfer television content. In European Conference on Interactive Television (pp. 168--177). Springer, Berlin, Heidelberg.  ",
      "doi": "10.1007/978-3-540-69478-6_22"
    },
    {
      "text": "Eric Clarke. 2005. Ways of listening: An ecological approach to the perception of musical meaning. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Nuno N. Correia, Deborah Castro, and Atau Tanaka. 2017. The Role of Live Visuals in Audience Understanding of Electronic Music Performances. In Proceedings of the 12th International Audio Mostly Conference on Augmented and Participatory Sound and Music Experiences (AM '17). ACM, New York, NY, USA, Article 29, 8 pages.  ",
      "doi": "10.1145/3123514.3123555"
    },
    {
      "text": "Roger B. Dannenberg. 2005. Interactive visual music: a personal perspective. Computer Music Journal, 29(4), 25--35.  ",
      "doi": "10.1162/014892605775179964"
    },
    {
      "text": "John Dewey. 2005. Art as Experience. Penguin.",
      "doi": ""
    },
    {
      "text": "Abigail Durrant, Duncan Rowland, David S. Kirk, Steve Benford, Joel E. Fischer, and Derek McAuley. 2011. Automics: souvenir generating photoware for theme parks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1767--1776.  ",
      "doi": "10.1145/1978942.1979199"
    },
    {
      "text": "Gyorgy Fazekas, Mathieu Barthet and Mark B. Sandler. 2013.. Mood conductor: emotion-driven interactive music performance. In Affective Computing and Intelligent Interaction (ACII), 2013 Humaine Association Conference on (pp. 726--726). IEEE.  ",
      "doi": "10.1109/ACII.2013.165"
    },
    {
      "text": "Martin D. Flintham, Raphael Velt, Max L. Wilson, Edward J. Anstead, Steve Benford, Anthony Brown, Timothy Pearce, Dominic Price, and James Sprinks. 2015. Run Spot Run: Capturing and Tagging Footage of a Race by Crowds of Spectators. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 747--756.  ",
      "doi": "10.1145/2702123.2702463"
    },
    {
      "text": "Lesley Fosh, Steve Benford, Stuart Reeves, Boriana Koleva, and Patrick Brundell. 2013. see me, feel me, touch me, hear me: trajectories and interpretation in a sculpture garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 149--158.  ",
      "doi": "10.1145/2470654.2470675"
    },
    {
      "text": "Jason Freeman. 2008. Extreme sight-reading, mediated expression, and audience participation: Real-time music notation in live performance. Computer Music Journal, 32(3), pp.25--41.  ",
      "doi": "10.1162/comj.2008.32.3.25"
    },
    {
      "text": "Danny Godin and Mithra Zahedi. 2014. Aspects of research through design: a literature review. Proceedings of DRS, 281.",
      "doi": ""
    },
    {
      "text": "Chris Greenhalgh, Steve Benford, and Adrian Hazzard. 2016. ^muzicode$: Composing and Performing Musical Codes. In Proceedings of the Audio Mostly 2016 (AM '16). ACM, New York, NY, USA, 47--54.  ",
      "doi": "10.1145/2986416.2986444"
    },
    {
      "text": "Chris Greenhalgh, Steve Benford, Adrian Hazzard, and Alan Chamberlain. 2017. Playing Fast and Loose with Music Recognition. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4302--4313.  ",
      "doi": "10.1145/3025453.3025900"
    },
    {
      "text": "Jonathan Grudin. 2001. Partitioning digital worlds: focal and peripheral awareness in multiple monitor use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Kate Hayes, Mathieu Barthet, Yongmeng Wu, Leshao Zhang, and Nick Bryan-Kinns. 2016. A Participatory Live Music Performance with the Open Symphony System. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 313--316.  ",
      "doi": "10.1145/2851581.2889471"
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 23 (October 2012), 18 pages.  ",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Kallionpää, Maria and Greenhalgh, Chris and Hazzard, Adrian and Weigl, David M. and Page, Kevin R. and Benford, Steve (2017) Composing and realising a game-like performance for disklavier and electronics. In: New Interfaces for Musical Expression (NIME'17), 15--18 May 2017, Copenhagen, Denmark..",
      "doi": ""
    },
    {
      "text": "Kimihiro Noguchi, Yulia R. Gel, Edgar Brunner and Frank Konietschke. 2012. nparLD: an R software package for the nonparametric analysis of longitudinal data in factorial experiments. Journal of Statistical Software, 50(12), 1--23. 2012",
      "doi": ""
    },
    {
      "text": "Michael Kruppa and Antonio Krüger. 2003. Concepts for a combined use of Personal Digital Assistants and large remote displays. Proceedings of SimVis 2003, Pages 349--361, Magdeburg",
      "doi": ""
    },
    {
      "text": "Fred Lerdahl and Ray Jackendoff. 1985. A Generative Theory of Tonal Music. MIT press.",
      "doi": ""
    },
    {
      "text": "Lars Olov Lundqvist, Fredrik Carlsson, Per Hilmersson and Patrik N. Juslin. 2009. Emotional responses to music: experience, expression, and physiology. Psychology of music, 37(1), pp.61--90.",
      "doi": ""
    },
    {
      "text": "Leonard B. Meyer.1956. Emotion and Meaning in Music. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Simon Penny, Jeffrey Smith, Phoebe Sengers, André Bernhardt and Jamieson Schulte. 2001. Traces: Embodied Immersive Interaction with SemiAutonomous Avatars. Convergence, 7(2), pp.47--65.",
      "doi": ""
    },
    {
      "text": "Jennifer Radbourne, Katya Johanson and Hilary Glow. 2010. Empowering audiences to measure quality. Participations: Journal of audience&reception studies, 7(2), pp.360--379.",
      "doi": ""
    },
    {
      "text": "Matthew Reason. 2010. Asking the audience: audience research and the experience of theatre. About performance (10). pp. 15--34..",
      "doi": ""
    },
    {
      "text": "Stuart Reeves. 2011. Designing interfaces in public settings: Understanding the role of the spectator in Human-Computer Interaction. Springer Science&Business Media. ",
      "doi": "10.5555/1963387"
    },
    {
      "text": "Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning Fans into Film Crew. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 767--776.  ",
      "doi": "10.1145/2702123.2702229"
    },
    {
      "text": "Phoebe Sengers and Bill Gaver. 2006. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proceedings of the 6th conference on Designing Interactive systems (DIS '06). ACM, New York, NY, USA, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Jennifer G. Sheridan, Nick Bryan-Kinns, and Alice Bayliss. 2007. Encouraging witting participation and performance in digital live art. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...but not as we know it - Volume 1 (BCS-HCI '07), Vol. 1. British Computer Society, Swinton, UK, UK, 13--23. ",
      "doi": "10.5555/1531294.1531297"
    },
    {
      "text": "John A. Sloboda, Susan A. O'Neill and Antonia Ivaldi. 2001. Functions of music in everyday life: An exploratory study using the Experience Sampling Method. Musicae scientiae, 5(1), pp.9--32.",
      "doi": ""
    },
    {
      "text": "Lucy A. Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Raphael Velt, Steve Benford, and Stuart Reeves. 2017. A Survey of the Trajectories Conceptual Framework: Investigating Theory Use in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2091--2105.  ",
      "doi": "10.1145/3025453.3026022"
    },
    {
      "text": "Bradley W. Vines, Carol L. Krumhansl, Marcelo M. Wanderley, Ioana M. Dalca, and Daniel J. Levitin. 2011. Music to my eyes: Cross-modal interactions in the perception of emotions in musical performance. Cognition, 118(2), pp.157--170.",
      "doi": ""
    },
    {
      "text": "David M. Weigl and Kevin R. Page. 2017. A framework for distributed semantic annotation of musical score: \"Take it to the bridge!\". In Proceedings of the 18th International Society for Music Information Retrieval Conference (ISMIR 2017), Suzhou, China, 221--228.",
      "doi": ""
    }
  ]
}