{
  "doi": "10.1145/3173574.3173713",
  "title": "Displaying Invisible Objects: Why People Rarely Re-read E-books",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "This study of paper and e-books investigates how specific affordances of physical and digital objects relate to people's valuations and uses of those objects over time. We found that while the visibility of paper books amplified the meaningfulness of organizational and display actions taken with regards to those objects, the systems that supported interactions with e-books instead tended to make such actions less meaningful. We argue that these systems also discouraged re-uses of e-books for most participants -- the important exceptions being several participants who used the book-focused social networking site Goodreads. This paper details how the affordances and limitations that resulted from the material constructions of paper and e-books impacted participants' uses of and feelings towards those objects, and examines the implications of using a supplementary online system for displaying digital objects.",
  "authors": [
    {
      "name": "Jane Gruning",
      "institution": "University of Texas at Austin, Austin, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658692091",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Deborah Barreau and Bonnie A. Nardi. 1995. Finding and Reminding: File Organization from the Desktop. SIGCHI Bull. 27, 3: 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Scott Carter and Jennifer Mankoff. 2005. When Participants Do the Capturing: The Role of Media in Diary Studies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 899--908.  ",
      "doi": "10.1145/1054972.1055098"
    },
    {
      "text": "Steven Chen and Neil Granitz. 2012. Adoption, rejection, or convergence: Consumer attitudes toward book digitization. Journal of Business Research 65, 8: 1219--1225.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2008. Basics of Qualitative Research. SAGE Publications, Los Angeles, CA.",
      "doi": ""
    },
    {
      "text": "Gillian Crampton-Smith. 1995. The hand that rocks the cradle. I.D. Magazine, 60--65.",
      "doi": ""
    },
    {
      "text": "Amber L. Cushing. 2013. \"It's stuff that speaks to me\": Exploring the characteristics of digital possessions. Journal of the American Society for Information Science & Technology 64, 8: 1723--1734.",
      "doi": ""
    },
    {
      "text": "Mary Douglas and Baron C. Isherwood. 1979. The world of goods. Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1959. The presentation of self in everyday life. Anchor Books, New York.",
      "doi": ""
    },
    {
      "text": "Connie Golsteijn, Elise van den Hoven, David Frohlich, and Abigail Sellen. 2012. Towards a More Cherishable Digital Object. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 655--664.  ",
      "doi": "10.1145/2317956.2318054"
    },
    {
      "text": "Nicky Gregson. 2011. Living with Things: Ridding, Accommodation, Dwelling. Sean Kingston Publishing, Wantage.",
      "doi": ""
    },
    {
      "text": "Jane Gruning. 2017. Models for Ownership: Implications for Long-term Relationships to Objects. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 2607--2613.  ",
      "doi": "10.1145/3027063.3053232"
    },
    {
      "text": "Annika Hupfeld and Tom Rodden. 2014. Books As a Social Technology. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), 639--651.  ",
      "doi": "10.1145/2531602.2531647"
    },
    {
      "text": "Annika Hupfeld, Abigail Sellen, Kenton O'Hara, and Tom Rodden. 2013. Leisure-Based Reading and the Place of E-Books in Everyday Life. In HumanComputer Interaction -- INTERACT 2013, Paula Kotzé, et al. (eds.). Springer Berlin Heidelberg, 1--18.",
      "doi": ""
    },
    {
      "text": "Masumi Iida, Patrick E. Shrout, Jean-Phillipe Laurenceau, and Niall Bolger. 2012. Using Diary Methods in Psychological Research. In APA Handbook of Research Methods in Psychology. American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Joseph \"Jofish\" Kaye, Janet Vertesi, Shari Avery, Allan Dafoe, Shay David, Lisa Onaga, Ivan Rosero, and Trevor Pinch. 2006. To Have and to Hold: Exploring the Personal Archive. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 275--284.  ",
      "doi": "10.1145/1124772.1124814"
    },
    {
      "text": "David S. Kirk and Abigail Sellen. 2010. On Human Remains: Values and Practice in the Home Archiving of Cherished Objects. ACM Trans. Comput.-Hum. Interact. 17, 3: 10:1--10:43.  ",
      "doi": "10.1145/1806923.1806924"
    },
    {
      "text": "Catherine C. Marshall. 2010. Reading and Writing the Electronic Book. Morgan & Claypool. ",
      "doi": "10.5555/1822781"
    },
    {
      "text": "Michael Massimi, Rachelle Campigotto, Abbas Attarwala, and Ronald M. Baecker. 2013. Reading together as a Leisure Activity: Implications for Ereading. In Human-Computer Interaction -- INTERACT 2013, Paula Kotzé et al. (eds.). Springer Berlin Heidelberg, 19--36.",
      "doi": ""
    },
    {
      "text": "Joanne E. McNeish and Ummaha Hazra. 2014. Interpreting simultaneous use of an existing technology and its replacement innovation. International Journal of Technology Marketing 9, 4: 376--391.",
      "doi": ""
    },
    {
      "text": "Daniel Miller. 1987. Material culture and mass consumption. B. Blackwell, Oxford, OX, UK; New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Daniel Miller. 2010. Stuff. Polity Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Nathan. 2016. The New Kindle Homescreen Sucks, It's Just One Big Ad. The E-book Reader.com. Retrieved June 7, 2017 from http://blog.the-ebookreader.com/2016/02/13/the-new-kindle-homescreensucks-its-just-one-big-ad/",
      "doi": ""
    },
    {
      "text": "William Odom, Abi Sellen, Richard Harper, and Eno Thereska. 2012. Lost in Translation: Understanding the Possession of Digital Things in the Cloud. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 781--790.  ",
      "doi": "10.1145/2207676.2207789"
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. 2011. Teenagers and Their Virtual Possessions: Design Opportunities and Issues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1491--1500.  ",
      "doi": "10.1145/1978942.1979161"
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. 2014. Placelessness, Spacelessness, and Formlessness: Experiential Qualities of Virtual Possessions. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14), 985--994.  ",
      "doi": "10.1145/2598510.2598577"
    },
    {
      "text": "William Odom, John Zimmerman, Jodi Forlizzi, Hajin Choi, Stephanie Meier, and Angela Park. 2012. Investigating the Presence, Form and Behavior of Virtual Possessions in the Context of a Teen Bedroom. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 327--336.  ",
      "doi": "10.1145/2207676.2207722"
    },
    {
      "text": "Leysia Palen and Marilyn Salzman. 2002. Voice-mail Diary Studies for Naturalistic Data Capture Under Mobile Conditions. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work (CSCW '02), 87--95.  ",
      "doi": "10.1145/587078.587092"
    },
    {
      "text": "Daniela Petrelli and Steve Whittaker. 2010. Family memories in the home: contrasting physical and digital mementos. Personal and Ubiquitous Computing 14, 2: 153--169.  ",
      "doi": "10.1007/s00779-009-0279-7"
    },
    {
      "text": "Pew Research Center. 2016. Book Reading 2016. Retrieved October 7, 2017 from http://www.pewinternet.org/2016/09/01/book-reading2016/",
      "doi": ""
    },
    {
      "text": "John Rieman. 1993. The Diary Study: A Workplaceoriented Research Tool to Guide Laboratory Efforts. In ACM INTERCHI '93, 321--326.  ",
      "doi": "10.1145/169059.169255"
    },
    {
      "text": "Jennifer A. Rode, Eleanor F. Toye, and Alan F. Blackwell. 2005. The Domestic Economy: A Broader Unit of Analysis for End User Programming. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05), 1757--1760.  ",
      "doi": "10.1145/1056808.1057015"
    },
    {
      "text": "Mark Rouncefield and Peter Tolmie. 2011. Digital Words: Reading and the 21st Century Home. In The Connected Home: The Future of Domestic Life, Richard Harper (ed.). Springer London, 133--162.",
      "doi": ""
    },
    {
      "text": "Yin Zhang and Sonali Kudva. 2014. E-books versus print books: Readers' choices and preferences across contexts. Journal of the Association for Information Science & Technology 65, 8: 1695--1706.  ",
      "doi": "10.1002/asi.23076"
    }
  ]
}