{
  "doi": "10.1145/3173574.3173960",
  "title": "The Use of Private Mobile Phones at War: Accounts From the Donbas Conflict",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Studying technology use in unstable and life-threatening conditions can help highlight assumptions of use built into technologies and foreground contradictions in the design of devices and services. This paper provides an account of how soldiers, volunteers, and civilians use mobile technologies in wartime, reporting on fieldwork conducted in Western Russia and Eastern Ukraine with people close to or participating directly in the armed conflict in the Donbas region. We document how private mobile phones and computers became a crucial but ambiguous infrastructure despite their lack of durability in extreme conditions of a military conflict, and their government and military surveillance potential. Our participants rely on a combination of myths and significant technical knowledge to negotiate the possibilities mobile technologies offer and the life-threatening reality of enemy surveillance they engender. We consider the problems of always-on always-connected devices under conditions of war and surveillance and our responsibilities as HCI practitioners in the design of social technologies.",
  "tags": [
    "appropriation",
    "field study",
    "ict infrastructures",
    "mobile media",
    "political conflict",
    "war"
  ],
  "authors": [
    {
      "name": "Irina Shklovski",
      "institution": "IT University of Copenhagen & University of Siegen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81100288406/rel-imgonly/portraits_2019-2020_colour1.jpeg",
      "acmid": "81100288406",
      "orcid": "0000-0003-1874-0958"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Siegen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Ban Al-Ani, Gloria Mark, Justin Chung, and Jennifer Jones. 2012. The Egyptian Blogosphere: A Counter- narrative of the Revolution. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 17--26.  ",
      "doi": "10.1145/2145204.2145213"
    },
    {
      "text": "Kate Brown. 2005. A Biography of No Place: From Ethnic Borderland to Soviet Heartland. Harvard University Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Uri Friedman. 2014. Russia's Slow-Motion Invasion of Ukraine. The Atlantic. Retrieved January 7, 2018 from https://tinyurl.com/y8yra4un",
      "doi": ""
    },
    {
      "text": "Katya Gorchinskaya. He Killed for the Maidan. Foreign Policy. Retrieved September 18, 2017 from https://foreignpolicy.com/2016/02/26/he-killed-forthe-maidan/",
      "doi": ""
    },
    {
      "text": "Anatoliy Gruzd and Ksenia Tsyganova. 2015. Information Wars and Online Activism During the 2013/2014 Crisis in Ukraine: Examining the Social Structures of Pro- and Anti-Maidan Groups. Policy & Internet 7, 2: 121--158.",
      "doi": ""
    },
    {
      "text": "Jaber F. Gubrium and James A. Holstein. 2002. Handbook of Interview Research: Context and Method. SAGE.",
      "doi": ""
    },
    {
      "text": "John-Paul Himka. 2015. The History behind the Regional Conflict in Ukraine. Kritika: Explorations in Russian and Eurasian History 16, 1: 129--136.",
      "doi": ""
    },
    {
      "text": "James A. Holstein and Jaber F. Gubrium. 2000. Constructing the Life Course. AltaMira Press, Dix Hills, N.Y.",
      "doi": ""
    },
    {
      "text": "Patrick Jackson. 2014. \"Frozen conflicts\" and the Kremlin. BBC News. Retrieved September 19, 2017 from http://www.bbc.com/news/world-europe29078541",
      "doi": ""
    },
    {
      "text": "Andrea Kavanaugh, Steven D. Sheetz, Riham Hassan, Seungwon Yang, Hicham G. Elmongui, Edward A. Fox, Mohamed Magdy, and Donald J. Shoemaker. 2013. Between a Rock and a Cell Phone: Communication and Information Technology Use during the 2011 Uprisings in Tunisia and Egypt. International Journal of Information Systems for Crisis Response and Management (IJISCRAM) 5, 1: 1--21.",
      "doi": ""
    },
    {
      "text": "Andrea Kavanaugh, Steven D. Sheetz, Hamida Skandrani, John C. Tedesco, Yue Sun, and Edward A. Fox. 2016. The Use and Impact of Social Media During the 2011 Tunisian Revolution. In Proceedings of the 17th International Digital Government Research Conference on Digital Government Research, 20--30.  ",
      "doi": "10.1145/2912160.2912175"
    },
    {
      "text": "Shaun Walker Oksana Grytsenko in Kiev. 2014. Text messages warn Ukraine protesters they are \"participants in mass riot.\" The Guardian. Retrieved September 19, 2017 from https://tinyurl.com/mxc5lks",
      "doi": ""
    },
    {
      "text": "Andrew E. Kramer. 2017. Ukraine 'Blockaders' Try to Cut Off Rail Traffic From Rebel Areas. The New York Times. Retrieved January 7, 2018 from https://www.nytimes.com/2017/03/02/world/europe/u kraine-blockaders-cut-off-rail-traffic-from-rebelareas.html",
      "doi": ""
    },
    {
      "text": "Svitlana Krasynska and Eric Martin. 2017. The Formality of Informal Civil Society: Ukraine's EuroMaidan. VOLUNTAS: International Journal of Voluntary and Nonprofit Organizations 28, 1: 420-- 449.",
      "doi": ""
    },
    {
      "text": "Gilad Lotan, Erhardt Graeff, Mike Ananny, Devin Gaffney, Ian Pearce, and Danah Boyd. 2011. The Arab Spring| The Revolutions Were Tweeted: Information Flows during the 2011 Tunisian and Egyptian Revolutions. International Journal of Communication 5, 0: 31.",
      "doi": ""
    },
    {
      "text": "Alec Luhn. 2017. Ukraine blocks popular social networks as part of sanctions on Russia. The Guardian. Retrieved September 19, 2017 from http://www.theguardian.com/world/2017/may/16/ukr aine-blocks-popular-russian-websites-kremlin-rolewar",
      "doi": ""
    },
    {
      "text": "Peter Mambrey and Mike Robinson. 1997. Understanding the Role of Documents in a Hierarchical Flow of Work. In Proceedings of the International ACM SIGGROUP Conference on Supporting Group Work: The Integration Challenge (GROUP '97), 119--127.  ",
      "doi": "10.1145/266838.266881"
    },
    {
      "text": "Gloria Mark, Mossaab Bagdouri, Leysia Palen, James Martin, Ban Al-Ani, and Kenneth Anderson. 2012. Blogs As a Collective War Diary. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 37--46.  ",
      "doi": "10.1145/2145204.2145215"
    },
    {
      "text": "Gloria Mark and Bryan Semaan. 2009. Expanding a Country's Borders During War: The Internet War Diary. In Proceedings of the 2009 International Workshop on Intercultural Collaboration (IWIC '09), 3-- 12.  ",
      "doi": "10.1145/1499224.1499228"
    },
    {
      "text": "David Marples. 2016. Ethnic and social Composition of Ukraine's Regions and Voting Patterns. In Ukraine and Russia: People, Politics, Propaganda and Perspectives, Agnieszka Pikulicka-Wilczewska and Richard Sakwa (eds.). E-International Relations, Bristol, UK, 9--18.",
      "doi": ""
    },
    {
      "text": "Olga Onuch. 2014. Who Were the Protesters? Journal of Democracy 25, 3: 44--51.",
      "doi": ""
    },
    {
      "text": "Olga Onuch. 2015. EuroMaidan Protests in Ukraine: Social Media Versus Social Networks. Problems of Post-Communism 62, 4: 217--235.",
      "doi": ""
    },
    {
      "text": "Leysia Palen, Kenneth M. Anderson, Gloria Mark, James Martin, Douglas Sicker, Martha Palmer, and Dirk Grunwald. 2010. A Vision for Technologymediated Support for Public Participation & Assistance in Mass Emergencies & Disasters. In Proceedings of the 2010 ACM-BCS Visions of Computer Science Conference (ACM-BCS '10), 8:1--8:12. Retrieved September 19, 2017 from http://dl.acm.org/citation.cfm?id=1811182.1811194 ",
      "doi": "10.5555/1811182.1811194"
    },
    {
      "text": "Katy Pearce. 2014. Two Can Play At That Game: Social Media Opportunities In Azerbaijan For Government And Opposition. Demokratizatsiya 22, 1: 39--66.",
      "doi": ""
    },
    {
      "text": "Robert Young Pelton. Kill the Messenger. Foreign Policy. Retrieved September 18, 2017 from https://foreignpolicy.com/2012/03/03/kill-themessenger/",
      "doi": ""
    },
    {
      "text": "Serhii Plokhy. 2017. The Gates of Europe: A History of Ukraine. Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Andrii Portnov. 2016. How 'eastern Ukraine' was lost. openDemocracy. Retrieved September 18, 2017 from https://www.opendemocracy.net/odrussia/andrii-portnov/how-eastern-ukraine-was-lost",
      "doi": ""
    },
    {
      "text": "B. Reinicke, J. Cummings, and H. Kleinberg. 2017. The Right to Digital Self-Defense. IEEE Security Privacy 15, 4: 68--71.",
      "doi": "10.1109/MSP.2017.3151324"
    },
    {
      "text": "Markus Rohde, Konstantin Aal, Kaoru Misaki, Dave Randall, Anne Weibert, and Volker Wulf. 2016. Out of Syria: Mobile Media in Use at the Time of Civil War. International Journal of Human--Computer Interaction 32, 7: 515--531.",
      "doi": ""
    },
    {
      "text": "A. Ronzhyn. 2016. Social Media Activism in PostEuromaidan Ukrainian Politics and Civil Society. In 2016 Conference for E-Democracy and Open Government (CeDEM), 96--101.",
      "doi": ""
    },
    {
      "text": "Saqib Saeed, Markus Rohde, and Volker Wulf. 2011. Analyzing Political Activists' Organization Practices: Findings from a Long Term Case Study of the European Social Forum. Computer Supported Cooperative Work (CSCW) 20, 4--5: 265--304.  ",
      "doi": "10.1007/s10606-011-9144-0"
    },
    {
      "text": "United Nations News Service Section. 2017. UN News - Clashes near vital infrastructure in eastern Ukraine may have \"grave\" impact on population, UN warns. UN News Service Section. Retrieved January 8, 2018 from https://tinyurl.com/ybxtktsz",
      "doi": ""
    },
    {
      "text": "Bryan Semaan and Gloria Mark. 2011. Creating a Context of Trust with ICTs: Restoring a Sense of Normalcy in the Environment. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11), 255--264.  ",
      "doi": "10.1145/1958824.1958863"
    },
    {
      "text": "Bryan Semaan and Gloria Mark. 2011. Technologymediated Social Arrangements to Resolve Breakdowns in Infrastructure During Ongoing Disruption. ACM Trans. Comput.-Hum. Interact. 18, 4: 21:1-- 21:21.  ",
      "doi": "10.1145/2063231.2063235"
    },
    {
      "text": "Damien Sharkov. 2017. Russia military bans Facebook as soldiers' battlefield selfies reveal secret locations. Newsweek. Retrieved December 21, 2017 from https://tinyurl.com/ya72lvyv",
      "doi": ""
    },
    {
      "text": "Irina Shklovski and Nalini Kotamraju. 2011. Online Contribution Practices in Countries That Engage in Internet Blocking and Censorship. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1109--1118.  ",
      "doi": "10.1145/1978942.1979108"
    },
    {
      "text": "Irina Shklovski, Scott D. Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and Creepiness in App Space: Perceptions of Privacy and Mobile App Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2347--2356.  ",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Andrei Soldatov and Irina Borogan. 2017. The Red Web: The Kremlin's Wars on the Internet. PublicAffairs, S.l. ",
      "doi": "10.5555/3169373"
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2012. (How) Will the Revolution Be Retweeted?: Information Diffusion and the 2011 Egyptian Uprising. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 7--16.  ",
      "doi": "10.1145/2145204.2145212"
    },
    {
      "text": "Borislav Tadic, Markus Rohde, Volker Wulf, and David Randall. 2016. ICT Use by Prominent Activists in Republika Srpska. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 3364--3377.  ",
      "doi": "10.1145/2858036.2858153"
    },
    {
      "text": "Zeynep Tufekci. 2017. Twitter and Tear Gas: The Power and Fragility of Networked Protest. Yale University Press, New Haven ; London. ",
      "doi": "10.5555/3159125"
    },
    {
      "text": "Dmitry Volchek and Claire Bigg. 2015. Ukrainian bloggers use social media to track Russian soldiers fighting in east. The Guardian. Retrieved September 19, 2017 from https://tinyurl.com/o68ekz4",
      "doi": ""
    },
    {
      "text": "Rick Wash. 2010. Folk Models of Home Computer Security. In Proceedings of the Sixth Symposium on Usable Privacy and Security (SOUPS '10), 11:1-- 11:16.  ",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "Volker Wulf. 1997. Storing and Retrieving Documents in a Shared Workspace: Experiences from the Political Administration. In Human-Computer Interaction INTERACT '97. Springer, Boston, MA, 469-- 476. ",
      "doi": "10.5555/647403.723541"
    },
    {
      "text": "Volker Wulf, Konstantin Aal, Ibrahim Abu Kteish, Meryem Atam, Kai Schubert, Markus Rohde, George P. Yerousis, and David Randall. 2013. Fighting Against the Wall: Social Media Use by Political Activists in a Palestinian Village. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1979--1988.  ",
      "doi": "10.1145/2470654.2466262"
    },
    {
      "text": "Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. \"On the Ground\" in Sidi Bouzid: Investigating Social Media Use During the Tunisian Revolution. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13), 1409--1418.  ",
      "doi": "10.1145/2441776.2441935"
    },
    {
      "text": "Zicong Zhou, Roja Bandari, Joseph Kong, Hai Qian, and Vwani Roychowdhury. 2010. Information Resonance on Twitter: Watching Iran. In Proceedings of the First Workshop on Social Media Analytics (SOMA '10), 123--131.  ",
      "doi": "10.1145/1964858.1964875"
    },
    {
      "text": "2015. Ukraine captures \"Russian soldiers.\" BBC News. Retrieved January 7, 2018 from http://www.bbc.com/news/world-europe-32776198",
      "doi": ""
    },
    {
      "text": "2015. The Avalanche that Went from Russia to Ukraine. bellingcat. Retrieved January 7, 2018 from https://www.bellingcat.com/news/uk-andeurope/2015/05/31/avalanche/",
      "doi": ""
    },
    {
      "text": "2017. UNHCR Ukraine Refugees and Asylum Seekers, June 2017. ReliefWeb. Retrieved September 19, 2017 from https://reliefweb.int/report/ukraine/unhcrukraine-refugees-and-asylum-seekers-june-2017",
      "doi": ""
    },
    {
      "text": "Putin Claims Russia Was 'Forced To Defend Russian-Speaking Population In Donbass.' Retrieved September 18, 2017 from http://www.interpretermag.com/day-968/",
      "doi": ""
    },
    {
      "text": "Ukraine, Separatists Agree To Cease-Fire. RadioFreeEurope/RadioLiberty. Retrieved January 7, 2018 from https://www.rferl.org/a/ukraine-separatistsagree-cease-fire-christmas-new-yearsholidays/27444120.html",
      "doi": ""
    },
    {
      "text": "UN Reports on Human Rights Situation in Ukraine - United Nations in Ukraine. Retrieved September 19, 2017 from http://www.un.org.ua/en/publications-andreports/un-in-ukraine-publications/3592-un-reportson-human-rights-situation-in-ukraine",
      "doi": ""
    },
    {
      "text": "Grey Zone: Eastern Ukraine Blockade. Retrieved January 7, 2018 from https://tinyurl.com/ycy6uazq",
      "doi": ""
    }
  ]
}