{
  "doi": "10.1145/3173574.3173774",
  "title": "Increasing User Attention with a Comic-based Policy",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-6",
  "year": 2018,
  "badges": [],
  "abstract": "End user license agreements, terms of service agreements and privacy policies all suffer from many of the same problems: people rarely read them and yet still agree to whatever is contained within them. There are many usability challenges with these policies: they are often lengthy, with jargon filled language that is difficult to quickly comprehend. However, these notices are the primary tool for users to understand the privacy implications of their digital activities and make informed decisions on which websites and software they use. Prior research has explored alternative designs for such notices, using more visual and structured interfaces for conveying information. We expand upon these results by exploring a comic-based interface, examining whether it can engage users to pay more attention to a terms of service agreement. Our results indicate that the comic version did hold user attention for longer than text-based alternatives, encouraging deeper investigation into comic-based interfaces.",
  "tags": [
    "terms of service",
    "end user license agreement",
    "comic",
    "privacy policy",
    "privacy"
  ],
  "authors": [
    {
      "name": "Madiha Tabassum",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659045262",
      "orcid": "missing"
    },
    {
      "name": "Abdulmajeed Alqhatani",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261278",
      "orcid": "missing"
    },
    {
      "name": "Marran Aldossari",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260698",
      "orcid": "missing"
    },
    {
      "name": "Heather Richter Lipford",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657300",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ewa Luger, Stuart Moran, and Tom Rodden. Consent for all: Revealing the hidden complexity of terms and conditions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, pages 2687--2696. ACM, 2013.  ",
      "doi": "10.1145/2470654.2481371"
    },
    {
      "text": "Carlos Jensen and Colin Potts. Privacy policies as decision-making tools: An evaluation of online privacy notices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '04, pages 471--478. ACM, 2004.  ",
      "doi": "10.1145/985692.985752"
    },
    {
      "text": "Aleecia M. Mcdonald, Robert W. Reeder, Patrick Gage Kelley, and Lorrie Faith Cranor. A comparative study of online privacy policies and formats. In Proceedings of the 9th International Symposium on Privacy Enhancing Technologies, PETS '09, pages 37--55. Springer-Verlag, 2009.  ",
      "doi": "10.1007/978-3-642-03168-7_3"
    },
    {
      "text": "L. F. Cranor. Necessary but not sufficient: Standardized mechanisms for privacy notice and choice. Journal of Telecommunications and High Technology Law, 10(2), 2012.",
      "doi": ""
    },
    {
      "text": "Nathaniel S. Good, Jens Grossklags, Deirdre K. Mulligan, and Joseph A. Konstan. Noticing notice: A large-scale experiment on the timing of software license agreements. In in Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2007. ACM Press, 2007.  ",
      "doi": "10.1145/1240624.1240720"
    },
    {
      "text": "Serge Egelman, Janice Tsai, Lorrie Faith Cranor, and Alessandro Acquisti. Timing is everything?: The effects of timing and placement of online privacy indicators. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '09, pages 319--328. ACM, 2009.  ",
      "doi": "10.1145/1518701.1518752"
    },
    {
      "text": "Nathaniel Good, Rachna Dhamija, Jens Grossklags, David Thaw, Steven Aronowitz, Deirdre Mulligan, and Joseph Konstan. Stopping spyware at the gate: A user study of privacy, notice and spyware. In Proceedings of the 2005 Symposium on Usable Privacy and Security, SOUPS '05, pages 43--52. ACM, 2005.  ",
      "doi": "10.1145/1073001.1073006"
    },
    {
      "text": "L. F. Cranor. P3p: making privacy policies more useful. IEEE Security Privacy, 1(6):50--55, Nov 2003.  ",
      "doi": "10.1109/MSECP.2003.1253568"
    },
    {
      "text": "A.M. McDonald and L.F. Cranor. The cost of reading privacy policies. 4:540--565, 01 2008.",
      "doi": ""
    },
    {
      "text": "Thomas Maronick. Do consumers read terms of service agreements when installing software?a two-study empirical analysis. International Journal of Business and Social Research, 4(6), 2014.",
      "doi": ""
    },
    {
      "text": "Z. Kaupas and J. Ceponis. End-user license agreement-threat to information security: a real life experiment. In Proceedings of the IVUS International Conference on Information Technology, pages 55--60, 2017.",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Joanna Bresee, Lorrie Faith Cranor, and Robert W. Reeder. A \"nutrition label\" for privacy. In Proceedings of the 5th Symposium on Usable Privacy and Security, SOUPS '09, pages 4:1--4:12. ACM, 2009.  ",
      "doi": "10.1145/1572532.1572538"
    },
    {
      "text": "Patrick Gage Kelley, Lucian Cesca, Joanna Bresee, and Lorrie Faith Cranor. Standardizing privacy notices: An online study of the nutrition label approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, pages 1573--1582. ACM, 2010.  ",
      "doi": "10.1145/1753326.1753561"
    },
    {
      "text": "T. Franklin Waddell, Joshua R. Auriemma, and S. Shyam Sundar. Make it simple, or force users to read?: Paraphrased design improves comprehension of end user license agreements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, CHI '16, pages 5252--5256. ACM, 2016.  ",
      "doi": "10.1145/2858036.2858149"
    },
    {
      "text": "Matthew Kay and Michael Terry. Textured agreements: Re-envisioning electronic consent. In Proceedings of the Sixth Symposium on Usable Privacy and Security, SOUPS '10, pages 13:1--13:13. ACM, 2010.  ",
      "doi": "10.1145/1837110.1837127"
    },
    {
      "text": "Cristian Bravo-Lillo, Lorrie Cranor, Saranga Komanduri, Stuart Schechter, and Manya Sleeper. Harder to ignore? revisiting pop-up fatigue and approaches to prevent it. In 10th Symposium On Usable Privacy and Security (SOUPS 2014), pages 105--111, Menlo Park, CA, 2014. USENIX Association.",
      "doi": ""
    },
    {
      "text": "Cristian Bravo-Lillo, Saranga Komanduri, Lorrie Faith Cranor, Robert W. Reeder, Manya Sleeper, Julie Downs, and Stuart Schechter. Your attention please: Designing security-decision uis to make genuine risks harder to ignore. In Proceedings of the Ninth Symposium on Usable Privacy and Security, SOUPS '13, pages 6:1--6:12, New York, NY, USA, 2013. ACM.  ",
      "doi": "10.1145/2501604.2501610"
    },
    {
      "text": "Yousra Javed and Mohamed Shehab. Look before you authorize: Using eye-tracking to enforce user attention towards application permissions. 2017, 04 2017.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru, Steve Sheng, Alessandro Acquisti, Lorrie Faith Cranor, and Jason Hong. Teaching johnny not to fall for phish. ACM Trans. Internet Technol., 10(2):7:1--7:31, June 2010.  ",
      "doi": "10.1145/1754393.1754396"
    },
    {
      "text": "Sukamol Srikwan and Markus Jakobsson. Using cartoons to teach internet security. Cryptologia, 32(2):137--154, April 2008.  ",
      "doi": "10.1080/01611190701743724"
    },
    {
      "text": "Leah Zhang-Kennedy, Khadija Baig, and Sonia Chiasson. Engaging children about online privacy through storytelling in an interactive comic. 2017.",
      "doi": "10.14236/ewic/HCI2017.45"
    },
    {
      "text": "Michael Green and Kimberly R Myers. Graphic medicine: Use of comics in medical education and patient care. 340, 03 2010.",
      "doi": ""
    },
    {
      "text": "Leah Zhang-Kennedy, Sonia Chiasson, and Robert Biddle. The role of instructional design in persuasion: A comics approach for improving cybersecurity. International Journal of Humanâ A¸ SComputer Interaction, 32(3):215--257, 2016.",
      "doi": ""
    },
    {
      "text": "Bart P. Knijnenburg and David Cherry. Comics as a medium for privacy notices. In WSF@SOUPS, 2016.",
      "doi": ""
    }
  ]
}