{
  "doi": "10.1145/3173574.3173628",
  "title": "FaceDisplay: Towards Asymmetric Multi-User Interaction for Nomadic Virtual Reality",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Mobile VR HMDs enable scenarios where they are being used in public, excluding all the people in the surrounding (Non-HMD Users) and reducing them to be sole bystanders. We present FaceDisplay, a modified VR HMD consisting of three touch sensitive displays and a depth camera attached to its back. People in the surrounding can perceive the virtual world through the displays and interact with the HMD user via touch or gestures. To further explore the design space of FaceDisplay, we implemented three applications (FruitSlicer, SpaceFace and Conductor) each presenting different sets of aspects of the asymmetric co-located interaction (e.g. gestures vs touch). We conducted an exploratory user study (n=16), observing pairs of people experiencing two of the applications and showing a high level of enjoyment and social interaction with and without an HMD. Based on the findings we derive design considerations for asymmetric co-located VR applications and argue that VR HMDs are currently designed having only the HMD user in mind but should also include Non-HMD Users.",
  "tags": [
    "nomadic virtual reality",
    "multi-user virtual reality",
    "co-located multiplayer",
    "asymmetric virtual reality"
  ],
  "authors": [
    {
      "name": "Jan Gugenheimer",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458801557",
      "orcid": "0000-0002-6466-3845"
    },
    {
      "name": "Evgeny Stemasov",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-99659161755/rel-imgonly/mitarbeiterportrait-e-s-sq.jpg",
      "acmid": "99659161755",
      "orcid": "missing"
    },
    {
      "name": "Harpreet Sareen",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161013",
      "orcid": "0000-0002-0897-8105"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Audiosurf LLC. 2017. Audioshield: The VR Music Game for Your Entire Music Collection. Game {HTC Vive}, http://audio-shield.com/. (2017). Accessed: 2017-04-02.",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst and Hirokazu Kato. 2002. Collaborative Augmented Reality. Commun. ACM 45, 7 (July 2002), 64--70.  ",
      "doi": "10.1145/514236.514265"
    },
    {
      "text": "Mark Billinghurst, Ivan Poupyrev, Hirokazu Kato, and Richard May. 2000. Mixing Realities in Shared Space: An Augmented Reality Interface for Collaborative Computing. In Multimedia and Expo, 2000. ICME 2000. 2000 IEEE International Conference on, Vol. 3. IEEE, 1641--1644.",
      "doi": ""
    },
    {
      "text": "M. Bolas, J. Iliff, P. Hoberman, N. Burba, T. Phan, I. McDowall, P. Luckey, and D. M. Krum. 2013. Open Virtual Reality. In 2013 IEEE Virtual Reality (VR). 183--184.",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring Emotion: The Self-assessment Manikin and the Semantic Differential. Journal of behavior therapy and experimental psychiatry 25, 1 (1994), 49--59.",
      "doi": "10.1016/0005-7916%2894%2990063-9"
    },
    {
      "text": "Raffaello Brondi, Leila Alem, Giovanni Avveduto, Claudia Faita, Marcello Carrozzino, Franco Tecchia, and Massimo Bergamasco. 2015. Evaluating the Impact of Highly Immersive Technologies and Natural Interaction on Player Engagement and Flow Experience in Games. Springer International Publishing, Cham, 169--181.",
      "doi": ""
    },
    {
      "text": "Andreas Butz, Tobias Hollerer, Steven Feiner, Blair MacIntyre, and Clifford Beshers. 1999. Enveloping Users and Computers in a Collaborative 3D Augmented Reality. In Augmented Reality, 1999.(IWAR'99) Proceedings. 2nd IEEE and ACM International Workshop on. IEEE, 35--44. ",
      "doi": "10.5555/857202.858143"
    },
    {
      "text": "Liwei Chan and Kouta Minamizawa. 2017. FrontFace: Facilitating Communication Between HMD Users and Outsiders Using Front-Facing-Screen HMDs. In 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. IEEE.  ",
      "doi": "10.1145/3098279.3098548"
    },
    {
      "text": "Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic Turk: A Motion Platform Based on People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3463--3472.  ",
      "doi": "10.1145/2556288.2557101"
    },
    {
      "text": "Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, and Patrick Baudisch. 2015. TurkDeck: Physical Virtual Reality Based on People. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "K. Coninx, F. Van Reeth, and E. Flerackers. 1997. A Hybrid 2D / 3D User Interface for Immersive Object Modeling. In Proceedings of the 1997 Conference on Computer Graphics International (CGI '97). IEEE Computer Society, Washington, DC, USA, 47--55. http://dl.acm.org/citation.cfm?id=792756.792856 ",
      "doi": "10.5555/792756.792856"
    },
    {
      "text": "Thierry Duval and Cédric Fleury. 2009. An Aymmetric 2D Pointer/3D Ray for 3D Interaction Within Collaborative Virtual Environments. In Proceedings of the 14th international Conference on 3D Web Technology. ACM, 33--41.  ",
      "doi": "10.1145/1559764.1559769"
    },
    {
      "text": "Foreign VR. 2016. Ruckus Ridge VR Party. Game {HTC Vive}, http://www.ruckusridgegame.com/. (2016). Palo Alto, USA, Accessed: 2017-04-03.",
      "doi": ""
    },
    {
      "text": "Brian Gajadhar, Yvonne de Kort, and Wijnand IJsselsteijn. 2008. Influence of Social Setting on Player Experience of Digital Games. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 3099--3104.  ",
      "doi": "10.1145/1358628.1358814"
    },
    {
      "text": "Chaim Gartenberg. 2015. The Future of Gaming is Lonely (And Online Only). (June 2015). http://www.theverge.com/2015/6/25/8844073/ goodbye-local-multiplayer-we-will-miss-you-",
      "doi": ""
    },
    {
      "text": "and-the-goldeneye-days-of-yore Accessed: 2017-04-03.",
      "doi": ""
    },
    {
      "text": "Google. 2017a. Headset \"Removal\" for Virtual and Mixed Reality. https://research.googleblog.com/2017/02/ headset-removal-for-virtual-and-mixed.html. (2017). Accessed: 2017-04-02.",
      "doi": ""
    },
    {
      "text": "Google. 2017b. (Un)folding a Virtual Journey with Google Cardboard. https://blog.google/products/google-vr/ unfolding-virtual-journey-cardboard/. (2017). Accessed: 2017-04-02.",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer. 2016. Nomadic Virtual Reality: Exploring New Interaction Concepts for Mobile Virtual Reality Head-Mounted Displays. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, New York, NY, USA, 9--12.  ",
      "doi": "10.1145/2984751.2984783"
    },
    {
      "text": "Jan Gugenheimer, David Dobbelstein, Christian Winkler, Gabriel Haas, and Enrico Rukzio. 2016. FaceTouch: Enabling Touch Interaction in Display Fixed UIs for Mobile Virtual Reality. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 49--60.  ",
      "doi": "10.1145/2984511.2984576"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users. In Proc. (CHI '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3025453.3025683"
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Eythor R. Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. GyroVR: Simulating Inertia in Virtual Reality Using Head Worn Flywheels. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 227--232.  ",
      "doi": "10.1145/2984511.2984535"
    },
    {
      "text": "John Harris, Mark Hancock, and Stacey D. Scott. 2016. Leveraging Asymmetries in Multiplayer Games: Investigating Design Elements of Interdependent Play. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 350--361.  ",
      "doi": "10.1145/2967934.2968113"
    },
    {
      "text": "Philipp Hock, Sebastian Benedikter, Jan Gugenheimer, and Enrico Rukzio. 2017. CarVR: Enabling In-Car Virtual Reality Entertainment. In Proc. (CHI '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3025453.3025665"
    },
    {
      "text": "Roland Holm, Erwin Stauder, Roland Wagner, Markus Priglinger, and Jens Volkert. 2002. A Combined Immersive and Desktop Authoring Tool for Virtual Environments. In Virtual Reality, 2002. Proceedings. IEEE. IEEE, 93--100. ",
      "doi": "10.5555/580130.835891"
    },
    {
      "text": "Hikaru Ibayashi, Yuta Sugiura, Daisuke Sakamoto, Natsuki Miyata, Mitsunori Tada, Takashi Okuma, Takeshi Kurata, Masaaki Mochimaru, and Takeo Igarashi. 2015. Dollhouse VR: A Multi-view, Multi-user Collaborative Design Workspace with VR Technology. In SIGGRAPH Asia 2015 Emerging Technologies. ACM, 8.  ",
      "doi": "10.1145/2818466.2818480"
    },
    {
      "text": "WA IJsselsteijn, YAW De Kort, and K Poels. 2013. The Game Experience Questionnaire: Development of a Self-report Measure to Assess the Psychological Impact of Digital Games. (2013).",
      "doi": ""
    },
    {
      "text": "Wijnand IJsselsteijn, Yvonne De Kort, Karolien Poels, Audrius Jurgelionis, and Francesco Bellotti. 2007. Characterising and Measuring User Experiences in Digital Games. In International conference on advances in computer entertainment technology, Vol. 2. 27.",
      "doi": ""
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2015. Creating a Mobile Head-mounted Display with Proprietary Controllers for Interactive Virtual Reality Content. In Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15 Adjunct). ACM, New York, NY, USA, 35--36.  ",
      "doi": "10.1145/2815585.2817776"
    },
    {
      "text": "Leonard Kleinrock. 1995. Nomadic Computing - an Opportunity. SIGCOMM Comput. Commun. Rev. 25, 1 (Jan. 1995), 36--40.  ",
      "doi": "10.1145/205447.205450"
    },
    {
      "text": "Siân E. Lindley, James Le Couteur, and Nadia L. Berthouze. 2008. Stirring Up Experience Through Movement in Game Play: Effects on Engagement and Social Behaviour. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 511--514.  ",
      "doi": "10.1145/1357054.1357136"
    },
    {
      "text": "Kent Lyons. 2016. 2D Input for Virtual Reality Enclosures with Magnetic Field Sensing. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (ISWC '16). ACM, New York, NY, USA, 176--183.  ",
      "doi": "10.1145/2971763.2971787"
    },
    {
      "text": "Joe Marshall, Conor Linehan, and Adrian Hazzard. 2016. Designing Brutal Multiplayer Video Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2669--2680.  ",
      "doi": "10.1145/2858036.2858080"
    },
    {
      "text": "Mark McGill, Daniel Boland, Roderick Murray-Smith, and Stephen Brewster. 2015. A Dose of Reality: Overcoming Usability Challenges in VR Head-Mounted Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2143--2152.  ",
      "doi": "10.1145/2702123.2702382"
    },
    {
      "text": "Mark McGill, Alexander Ng, and Stephen Brewster. 2017. I Am The Passenger: How Visual Motion Cues Can Influence Sickness For In-Car VR. In Proc. (CHI '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3025453.3026046"
    },
    {
      "text": "Kana Misawa and Jun Rekimoto. 2015. Wearing Another's Personality: A Human-surrogate System with a Telepresence Face. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (ISWC '15). ACM, New York, NY, USA, 125--132.  ",
      "doi": "10.1145/2802083.2808392"
    },
    {
      "text": "Ohan Oda, Carmine Elvezio, Mengu Sukan, Steven Feiner, and Barbara Tversky. 2015. Virtual Replicas for Remote Assistance in Virtual and Augmented Reality. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 405--415.  ",
      "doi": "10.1145/2807442.2807497"
    },
    {
      "text": "Mat Ombler. 2015. Why Split-Screen Gaming is Dying (And Why We Should Mourn It). http://www.highsnobiety.com/ 2015/09/09/split-screen-gaming-dead/. (Sept. 2015). Accessed: 2017-04-03.",
      "doi": ""
    },
    {
      "text": "Robin Parker. 2014. Opinion: Is Split-Screen Dead? http: //www.godisageek.com/2014/06/opinion-split-screen-dead/. (June 2014). Accessed: 2017-04-03.",
      "doi": ""
    },
    {
      "text": "Danakorn Nincarean Eh Phon, Mohamad Bilal Ali, and Noor Dayana Abd Halim. 2014. Collaborative Augmented Reality in Education: A Review. In Teaching and Learning in Computing and Engineering (LaTiCE), 2014 International Conference on. IEEE, 78--83.  ",
      "doi": "10.1109/LaTiCE.2014.23"
    },
    {
      "text": "D. Pohl and C. F. de Tejada Quemada. 2016. See What I See: Concepts to Improve the Social Acceptance of HMDs. In 2016 IEEE Virtual Reality (VR). 267--268.",
      "doi": ""
    },
    {
      "text": "Antti Sand, Ismo Rakkolainen, Poika Isokoski, Jari Kangas, Roope Raisamo, and Karri Palovuori. 2015. Head-mounted Display with Mid-air Tactile Feedback. In Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology (VRST '15). ACM, New York, NY, USA, 51--58.  ",
      "doi": "10.1145/2821592.2821593"
    },
    {
      "text": "SCE Japan Studio. 2016. The Playroom VR. Game {PS4/PS VR}, https: //www.playstation.com/en-gb/games/the-playroom-vr-ps4/. (2016). SCCE, London, UK, Accessed: 2017-04-03.",
      "doi": ""
    },
    {
      "text": "Dieter Schmalstieg, Anton Fuhrmann, Gerd Hesina, Zsolt Szalavári, L Miguel Encarnaçao, Michael Gervautz, and Werner Purgathofer. 2002. The Studierstube Augmented Reality Project. Presence: Teleoperators and Virtual Environments 11, 1 (2002), 33--54.  ",
      "doi": "10.1162/105474602317343640"
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of Presence in Virtual Environments. Presence: Teleoperators & Virtual Environments 3, 2 (1994), 130--144.  ",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Boris Smus and Christopher Riederer. 2015. Magnetic Input for Mobile Virtual Reality. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (ISWC '15). ACM, New York, NY, USA, 43--44.  ",
      "doi": "10.1145/2802083.2808395"
    },
    {
      "text": "Aaron Stafford, Wayne Piekarski, and Bruce Thomas. 2006. Implementation of God-like Interaction Techniques for Supporting Collaboration Between Outdoor AR and Indoor Tabletop Users. In Proceedings of the 5th IEEE and ACM International Symposium on Mixed and Augmented Reality (ISMAR '06). IEEE Computer Society, Washington, DC, USA, 165--172.  ",
      "doi": "10.1109/ISMAR.2006.297809"
    },
    {
      "text": "Steel Crate Games. 2015. Keep Talking And Nobody Explodes. Game {HTC Vive}, http://www.keeptalkinggame.com. (2015). Steel Crate Games, Ottawa, CA, Accessed: 2017-04-03.",
      "doi": ""
    },
    {
      "text": "Ivan E. Sutherland. 1968. A Head-mounted Three Dimensional Display. In Proceedings of the December 9--11, 1968, Fall Joint Computer Conference, Part I (AFIPS '68 (Fall, part I)). ACM, New York, NY, USA, 757--764.  ",
      "doi": "10.1145/1476589.1476686"
    },
    {
      "text": "Team Future. 2016. Black Hat Cooperative. Game {HTC Vive, Oculus Rift}, http://www.teamfuturegames.com. (2016). Team Future, Boston, USA, Accessed: 2017-04-03.",
      "doi": ""
    },
    {
      "text": "Amy Voida, Sheelagh Carpendale, and Saul Greenberg. 2010. The Individual and the Group in Console Gaming. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 371--380.  ",
      "doi": "10.1145/1718918.1718983"
    },
    {
      "text": "Amy Voida and Saul Greenberg. 2009. Wii All Play: The Console Game as a Computational Meeting Place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1559--1568.  ",
      "doi": "10.1145/1518701.1518940"
    }
  ]
}