{
  "doi": "10.1145/3173574.3173727",
  "title": "More Stars or More Reviews?",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "The large majority of reputation systems use features such as star ratings and reviews to give users a reputation in online peer-to-peer markets. Both have been shown to be effective for signaling trustworthiness. However, the exact extent to which these features can change perceptions of users' trustworthiness remains an open question. Using data from an online experiment conducted on Airbnb users, we investigate which of the two types of reputation information --average star rating or the number of reviews --is more important for signaling a user's trustworthiness. We find that the relative effectiveness of ratings and reviews differ depending on whether reputation has a strong or a weak differentiation power. Our findings show that reputation effects are contingent on and susceptible to the context created by the alternative choices presented to users, highlighting how reputation information is displayed can drastically alter their efficacy for engendering trust.",
  "tags": [
    "trust",
    "airbnb",
    "sharing economy",
    "reputation and rating systems"
  ],
  "authors": [
    {
      "name": "Will Qiu",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261071",
      "orcid": "missing"
    },
    {
      "name": "Palo Parigi",
      "institution": "Airbnb & Stanford University, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658632294",
      "orcid": "missing"
    },
    {
      "name": "Bruno Abrahao",
      "institution": "New York University Shanghai & Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81367599282",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bruno Abrahao, Paolo Parigi, Alok Gupta, and Karen S Cook. 2017. Reputation offsets trust judgments based on social biases among Airbnb users. Proceedings of the National Academy of Sciences (2017), 201604234.",
      "doi": ""
    },
    {
      "text": "Joyce Berg, John Dickhaut, and Kevin McCabe. 1995. Trust, reciprocity, and social history. Games and economic behavior 10, 1 (1995), 122--142.",
      "doi": ""
    },
    {
      "text": "Abhijit Biswas and Edward A Blair. 1991. Contextual effects of reference prices in retail advertisements. The Journal of Marketing (1991), 1--12.",
      "doi": ""
    },
    {
      "text": "Peter M Blau. 1977. A macrosociological theory of social structure. American journal of sociology 83, 1 (1977), 26--54.",
      "doi": ""
    },
    {
      "text": "Gary Bolton, Ben Greiner, and Axel Ockenfels. 2013. Engineering trust: reciprocity in the production of reputation information. Management Science 59, 2 (2013), 265--285.  ",
      "doi": "10.1287/mnsc.1120.1609"
    },
    {
      "text": "Gary E Bolton, Elena Katok, and Axel Ockenfels. 2004. How effective are electronic reputation mechanisms? An experimental investigation. Management science 50, 11 (2004), 1587--1602.  ",
      "doi": "10.1287/mnsc.1030.0199"
    },
    {
      "text": "Chrysanthos Dellarocas. 2003. The digitization of word of mouth: Promise and challenges of online feedback mechanisms. Management science 49, 10 (2003), 1407--1424.  ",
      "doi": "10.1287/mnsc.49.10.1407.17308"
    },
    {
      "text": "Chrysanthos Dellarocas. 2005. Reputation mechanism design in online trading environments with pure moral hazard. Information Systems Research 16, 2 (2005), 209--230.  ",
      "doi": "10.1287/isre.1050.0054"
    },
    {
      "text": "Chrysanthos Dellarocas. 2006. How often should reputation mechanisms update a trader's reputation profile? Information Systems Research 17, 3 (2006), 271--285.  ",
      "doi": "10.1287/isre.1060.0092"
    },
    {
      "text": "Andreas Diekmann, Ben Jann, Wojtek Przepiorka, and Stefan Wehrli. 2014. Reputation formation and the evolution of cooperation in anonymous online markets. American Sociological Review 79, 1 (2014), 65--85.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt and Amelia R Malone. 2015. The promise of the sharing economy among disadvantaged communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2285--2294.  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Eyal Ert, Aliza Fleischer, and Nathan Magen. 2016. Trust and reputation in the sharing economy: The role of personal photos in Airbnb. Tourism Management 55 (2016), 62--73.",
      "doi": ""
    },
    {
      "text": "John Horton and Joseph Golden. 2015. Reputation inflation: Evidence from an online labor market. Work. Pap., NYU (2015).",
      "doi": ""
    },
    {
      "text": "Nan Hu, Jie Zhang, and Paul A Pavlou. 2009. Overcoming the J-shaped distribution of product reviews. Commun. ACM 52, 10 (2009), 144--147.  ",
      "doi": "10.1145/1562764.1562800"
    },
    {
      "text": "Daniel Kahneman. 2003. A perspective on judgment and choice: mapping bounded rationality. American psychologist 58, 9 (2003), 697.",
      "doi": ""
    },
    {
      "text": "Peter Kollock. 1999. The production of trust in online markets. Advances in group processes 16, 1 (1999), 99--123.",
      "doi": ""
    },
    {
      "text": "Debra Lauterbach, Hung Truong, Tanuj Shah, and Lada Adamic. 2009. Surfing a web of trust: Reputation and reciprocity on couchsurfing. com. In Computational Science and Engineering, 2009. CSE'09. International Conference on, Vol. 4. IEEE, 346--353.  ",
      "doi": "10.1109/CSE.2009.345"
    },
    {
      "text": "Jeffrey A Livingston. 2005. How valuable is a good reputation? A sample selection model of internet auctions. The Review of Economics and Statistics 87, 3 (2005), 453--465.",
      "doi": ""
    },
    {
      "text": "Xiao Ma, Jeffrey T Hancock, Kenneth Lim Mingjie, and Mor Naaman. 2017. Self-Disclosure and Perceived Trustworthiness of Airbnb Host Profiles.. In CSCW. 2397--2409.  ",
      "doi": "10.1145/2998181.2998269"
    },
    {
      "text": "Mikhail I Melnik and James Alm. 2002. Does a sellers ecommerce reputation matter? Evidence from eBay auctions. The journal of industrial economics 50, 3 (2002), 337--349.",
      "doi": ""
    },
    {
      "text": "Paul Resnick, Ko Kuwabara, Richard Zeckhauser, and Eric Friedman. 2000. Reputation systems. Commun. ACM 43, 12 (2000), 45--48.  ",
      "doi": "10.1145/355112.355122"
    },
    {
      "text": "Paul Resnick and Richard Zeckhauser. 2002. Trust among strangers in Internet transactions: Empirical analysis of eBay's reputation system. In The Economics of the Internet and E-commerce. Emerald Group Publishing Limited, 127--157.",
      "doi": ""
    },
    {
      "text": "Paul Resnick, Richard Zeckhauser, John Swanson, and Kate Lockwood. 2006. The value of reputation on eBay: A controlled experiment. Experimental economics 9, 2 (2006), 79--101.",
      "doi": ""
    },
    {
      "text": "Juliet B Schor and Connor J Fitzmaurice. 2015. 26. Collaborating and connecting: the emergence of the sharing economy. Handbook of research on sustainable consumption 410 (2015).",
      "doi": ""
    },
    {
      "text": "Emily Sun, Ross McLachlan, and Mor Naaman. TAMIES: A Study and Model of Adoption in P2P Resource Sharing and Indirect Exchange Systems.",
      "doi": ""
    },
    {
      "text": "Arun Sundararajan. 2016. The sharing economy: The end of employment and the rise of crowd-based capitalism. Mit Press. ",
      "doi": "10.5555/3002839"
    },
    {
      "text": "Steven Tadelis. 2016. Reputation and feedback systems in online platform markets. Annual Review of Economics 8 (2016), 321--340.",
      "doi": ""
    },
    {
      "text": "Georgios Zervas, Davide Proserpio, and John Byers. 2015. A first look at online reputation on Airbnb, where every stay is above average. (2015).",
      "doi": ""
    }
  ]
}