{
  "doi": "10.1145/3173574.3173719",
  "title": "What to Put on the User: Sensing Technologies for Studies and Physiology Aware Systems",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Fitness trackers not just provide easy means to acquire physiological data in real-world environments due to affordable sensing technologies, they further offer opportunities for physiology-aware applications and studies in HCI; however, their performance is not well understood. In this paper, we report findings on the quality of 3 sensing technologies: PPG-based wrist trackers (Apple Watch, Microsoft Band 2), an ECG-belt (Polar H7) and reference device with stick-on ECG electrodes (Nexus 10). We collected physiological (heart rate, electrodermal activity, skin temperature) and subjective data from 21 participants performing combinations of physical activity and stressful tasks. Our empirical research indicates that wrist devices provide a good sensing performance in stationary settings. However, they lack accuracy when participants are mobile or if tasks require physical activity. Based on our findings, we suggest a textitDesign Space for Wearables in Research Settings and reflected on the appropriateness of the investigated technologies in research contexts.",
  "tags": [
    "affective computing",
    "wearable technology",
    "validation",
    "stress"
  ],
  "authors": [
    {
      "name": "Katrin Hänsel",
      "institution": "Queen Mary University of London, London, United Kingdom",
      "img": "/do/10.1145/contrib-99658987129/rel-imgonly/img_7151_2.jpg",
      "acmid": "99658987129",
      "orcid": "missing"
    },
    {
      "name": "Romina Poguntke",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261914",
      "orcid": "missing"
    },
    {
      "name": "Hamed Haddadi",
      "institution": "Imperial College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81381599302/rel-imgonly/30411793_10156512288811189_2782170150948831232_o.jpg",
      "acmid": "81381599302",
      "orcid": "missing"
    },
    {
      "name": "Akram Alomainy",
      "institution": "Queen Mary University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467668534",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "Ludwig Maximilian University, Munich, Bavaria, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "John Allen. 2007. Photoplethysmography and Its Application in Clinical Physiological Measurement. Physiological Measurement 28, 3 (Mar 2007), R1--R39.",
      "doi": ""
    },
    {
      "text": "Stein Andersson and Arnstein Finset. 1998. Heart rate and skin conductance reactivity to brief psychological stress in brain-injured patients. Journal of Psychosomatic Research 44, 6 (1998), 645 -- 656.",
      "doi": ""
    },
    {
      "text": "Michael Andronico. 2017. Microsoft Band 2 vs. Apple Watch, Fitbit Surge and Garmin Vivoactive. Accessed: 15/12/2017. (2017). https://www.tomsguide.com/us/ microsoft-band-vs-apple-watch,news-21684.html",
      "doi": ""
    },
    {
      "text": "Lawrence M Baker and William M Taylor. 1954. The relationship under stress between changes in skin temperature, electrical skin resistance, and pulse rate. Journal of experimental psychology 48, 5 (1954), 361.",
      "doi": ""
    },
    {
      "text": "Armando Barreto, Jing Zhai, and Malek Adjouadi. 2007. Non-intrusive physiological monitoring for automated stress detection in human-computer interaction. Human-Computer Interaction 4796 (2007), 29--38. ",
      "doi": "10.5555/1779576.1779580"
    },
    {
      "text": "A. B. Barreto, S. D. Scargle, and M Adjouadi. 1999. A real-time assistive computer interface for users with motor disabilities. ACM SIGCAPH Computers and the Physically Handicapped 64 (1999), 6--16.  ",
      "doi": "10.1145/569270.569272"
    },
    {
      "text": "Gershon Ben-Shakhar. 1985. Standardization Within Individuals: a Simple Method to Neutralize Individual Differences in Skin Conductance. Psychophysiology 22, 3 (May 1985), 292--299.",
      "doi": ""
    },
    {
      "text": "Irving Biederman. 1973. Mental set and mental arithmetic. Memory & Cognition 1, 3 (1973), 383--386.",
      "doi": ""
    },
    {
      "text": "Kerry Bodine and Francine Gemperle. 2003. Effects of Functionality on Perceived Comfort of Wearables. ISWC (2003), 57--60. ",
      "doi": "10.5555/946249.946867"
    },
    {
      "text": "Andrey Bogomolov, Bruno Lepri, Michela Ferron, Fabio Pianesi, and Alex Sandy Pentland. 2014. Daily Stress Recognition From Mobile Phone Data, Weather Conditions and Individual Traits. In Proceedings of the ACM International Conference on Multimedia (MM'14). 477--486.  ",
      "doi": "10.1145/2647868.2654933"
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring Emotion: the Self-Assessment Manikin and the Semantic Differential. Journal Of Behavior Therapy And Experimental Psychiatry 25, 1 (Mar 1994), 49--59.",
      "doi": ""
    },
    {
      "text": "Sheldon Cohen, Tom Kamarck, and Robin Mermelstein. 1983. A Global Measure of Perceived Stress. Journal of Health and Social Behavior 24, 4 (1983), 385--396. http://www.jstor.org/stable/2136404",
      "doi": ""
    },
    {
      "text": "Richard J. Davidson, Klaus R. Scherer, and H. Hill Goldsmith. 2003. Handbook of Affective Sciences (pp. 572--595). New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Michael E Dawson, Anne M Schell, and Diane L Filion. 2007. The electrodermal system. Handbook of psychophysiology 2 (2007), 200--223.",
      "doi": ""
    },
    {
      "text": "M Eid, P Notz, P Schwenkmezger, and R Steyer. 1994. Sind Stimmungsdimensionen monopolar? Ein Überblick über empirische Befunde und Untersuchungen mit faktorenanalytischen Modellen für kontinuierliche und kategoriale Variablen sowie neuere Ergebnisse. Zeitschrift für Differentielle und Diagnostische Psychologie 15, 4 (1994), 211--233.",
      "doi": ""
    },
    {
      "text": "Fatema El-Amrawy and Mohamed Ismail Nounou. 2015. Are Currently Available Wearable Devices for Activity Tracking and Heart Rate Monitoring Accurate, Precise, and Medically Beneficial? Healthcare Informatics Research 21, 4 (2015), 315.",
      "doi": ""
    },
    {
      "text": "Polar Electro. 2017. How to check the battery level status of my heart rate sensor? Accessed: 15/12/2017. (2017). https://support.polar.com/en/support/how_to_check_the_battery_level_status_of_my_heart_rate_sensor",
      "doi": ""
    },
    {
      "text": "J. D. Evans. 1996. Straightforward statistics for the behavioral sciences. Brooks/Cole Publishing.",
      "doi": ""
    },
    {
      "text": "Kelly R Evenson, Michelle M Goto, and Robert D Furberg. 2015. Systematic Review of the Validity and Reliability of Consumer-Wearable Activity Trackers. International Journal of Behavioral Nutrition and Physical Activity 12, 1 (Dec 2015), e192.",
      "doi": ""
    },
    {
      "text": "Anja Exler, Andrea Schankin, Christoph Klebsattel, and Michael Beigl. 2016. A Wearable System for Mood Assessment Considering Smartphone Features and Data From Mobile ECGs. In Adjunct Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2016 ACM International Symposium on Wearable Computers (Ubicomp/ISWC'16 Adjunct).  ",
      "doi": "10.1145/2968219.2968302"
    },
    {
      "text": "Raihana Ferdous, Venet Osmani, and Oscar Mayora. 2015. Smartphone App Usage as a Predictor of Perceived Stress Levels at Workplace. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '15). 225--228. ",
      "doi": "10.5555/2826165.2826200"
    },
    {
      "text": "Aaron J Fisher and Michelle G Newman. 2013. Heart rate and autonomic response to stress after experimental induction of worry versus relaxation in healthy, high-worry, and generalized anxiety disorder individuals. Biological psychology 93, 1 (2013), 65--74.",
      "doi": ""
    },
    {
      "text": "Thomas B Fitzpatrick. 1988. The Validity and Practicality of Sun-Reactive Skin Types I Through VI. Archives of Dermatology 124, 6 (1988), 869.",
      "doi": ""
    },
    {
      "text": "Peter J Gianaros, Ikechukwu C Onyewuenyi, Lei K Sheu, Israel C Christie, and Hugo D Critchley. 2012. Brain systems for baroreflex suppression during stress in humans. Human brain mapping 33, 7 (2012), 1700--1716.",
      "doi": ""
    },
    {
      "text": "Stephen Gillinov, Muhammad Etiwy, Robert Wang, Gordon Blackburn, Dermot Phelan, A Marc Gillinov, Penny Houghtaling, Hoda Javadikasgari, and Milind Y Desai. 2017. Variable Accuracy of Wearable Heart Rate Monitors During Aerobic Exercise. Medicine & Science in Sports & Exercise 49, 8 (Aug 2017), 1697--1703.",
      "doi": ""
    },
    {
      "text": "Christian Hamilton-Craig, Allison Fifoot, Mark Hansen, Matthew Pincus, Jonathan Chan, Darren L. Walters, and Kelley R. Branch. 2014. Diagnostic performance and cost of CT angiography versus stress ECG -- A randomized prospective study of suspected acute coronary syndrome chest pain in the emergency department (CT-COMPARE). International Journal of Cardiology 177, 3 (2014), 867 -- 873.",
      "doi": ""
    },
    {
      "text": "Skjalg S Hassellund, Arnljot Flaa, Leiv Sandvik, Sverre E Kjeldsen, and Morten Rostrup. 2010. Long-Term Stability of Cardiovascular and Catecholamine Responses to Stress Tests An 18-Year Follow-Up Study. Hypertension 55, 1 (2010), 131--136.",
      "doi": ""
    },
    {
      "text": "Jennifer A Healey and Rosalind W Picard. 2005. Detecting stress during real-world driving tasks using physiological sensors. IEEE Transactions on intelligent transportation systems 6, 2 (2005), 156--166.  ",
      "doi": "10.1109/TITS.2005.848368"
    },
    {
      "text": "Javier Hernandez, Rob R Morris, and Rosalind W Picard. 2011. Call center stress recognition with person-specific models. In International Conference on Affective Computing and Intelligent Interaction. Springer, 125--134. ",
      "doi": "10.5555/2062780.2062798"
    },
    {
      "text": "Gabriella Ilie and William Forde Thompson. 2006. A Comparison of Acoustic Cues in Music and Speech for Three Dimensions of Affect. Music Perception: An Interdisciplinary Journal 23, 4 (Apr 2006), 319--330.",
      "doi": ""
    },
    {
      "text": "Apple Inc. 2017a. Apple Watch Series 3 Battery Information. Accessed: 15/12/2017. (2017). https://www.apple.com/uk/watch/battery.html",
      "doi": ""
    },
    {
      "text": "Statista Inc. 2017b. Forecasted value of the global wearable devices market from 2012 to 2018. Accessed: 16/08/2017. (2017). https://www.statista.com/ statistics/302482/wearable-device-market-value/",
      "doi": ""
    },
    {
      "text": "Martin Jagelka, Martin Donoval, Peter Telek, František Horìnek, Martin Weis, and Martin Daňìček. 2016. Wearable Healthcare Electronics for 24--7 Monitoring with Focus on User Comfort. In 2016 26th International Conference Radioelektronika (RADIOELEKTRONIKA. 5--9.",
      "doi": ""
    },
    {
      "text": "Edward Jo, Kiana Lewis, Dean Directo, Michael J Kim, and Brett A Dolezal. 2016. Validation of Biofeedback Wearables for Photoplethysmographic Heart Rate Tracking. Journal of Sports Science & Medicine 15, 3 (Sep 2016), 540.",
      "doi": ""
    },
    {
      "text": "Hisanori Kataoka, Hiroshi Kano, Hiroaki Yoshida, Atsuo Saijo, Masashi Yasuda, and Masato Osumi. 1998. Development of a skin temperature measuring system for non-contact stress evaluation. In Engineering in Medicine and Biology Society, 1998. Proceedings of the 20th Annual International Conference of the IEEE, Vol. 2. IEEE, 940--943.",
      "doi": ""
    },
    {
      "text": "Rinat Khusainov, Djamel Azzi, Ifeyinwa E Achumba, and Sebastian D Bersch. 2013. Real-time human ambulation, activity, and physiological monitoring: Taxonomy of issues, techniques, applications, challenges and limitations. Sensors 13, 10 (2013), 12852--12902.",
      "doi": ""
    },
    {
      "text": "Arthur F Kramer. 1991. Physiological metrics of mental workload: A review of recent progress. Multiple-task performance (1991), 279--328.",
      "doi": ""
    },
    {
      "text": "Jan Kučera, James Scott, and Nicholas Chen. 2017. Probing Calmness in Applications Using a Calm Display Prototype. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 965--969.  ",
      "doi": "10.1145/3123024.3124564"
    },
    {
      "text": "Wenhui Liao, Weihong Zhang, Zhiwei Zhu, and Qiang Ji. 2005. A real-time human stress monitoring system using dynamic Bayesian network. In Computer Vision and Pattern Recognition-Workshops, 2005. CVPR Workshops. IEEE Computer Society Conference on. IEEE, 70--70.  ",
      "doi": "10.1109/CVPR.2005.394"
    },
    {
      "text": "Robert LiKamWa, Yunxin Liu, Nicholas D Lane, and Lin Zhong. 2013. MoodScope: Building a Mood Sensor From Smartphone Usage Patterns. In Proceeding of the 11th annual international conference (MobiSys '13). 389--402.  ",
      "doi": "10.1145/2462456.2464449"
    },
    {
      "text": "Wan-Hua Lin, Dan Wu, Chunyue Li, Heye Zhang, and Yuan-Ting Zhang. 2014. Comparison of Heart Rate Variability From PPG with That From ECGIFMBE Proceedings. 213--215.",
      "doi": ""
    },
    {
      "text": "Wolfgang Linden. 1991. What do arithmetic stress tests measure? Protocol variations and cardiovascular responses. Psychophysiology 28, 1 (1991), 91--102.",
      "doi": ""
    },
    {
      "text": "Daniel J McDuff, Javier Hernandez, Sarah Gontarek, and Rosalind W Picard. 2016. Cogcam: Contact-free measurement of cognitive stress during computer tasks with a digital camera. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4000--4004.  ",
      "doi": "10.1145/2858036.2858247"
    },
    {
      "text": "Mind Media. 2017. Nexus-10 MKII Specifications. Accessed: 15/12/2017. (2017). https://www.mindmedia.com/products/nexus-10-mkii/",
      "doi": ""
    },
    {
      "text": "Jon D Morris. 1995. Observations: SAM: the Self-Assessment Manikin; an efficient cross-cultural measurement of emotional response. Journal of advertising research 35, 6 (1995), 63--68.",
      "doi": ""
    },
    {
      "text": "Mats Najström and Billy Jansson. 2007. Skin conductance responses as predictor of emotional responses to stressful life events. Behaviour Research and Therapy 45, 10 (2007), 2456 -- 2463.",
      "doi": ""
    },
    {
      "text": "Jakub Parak and Ilkka Korhonen. 2014. Evaluation of Wearable Consumer Heart Rate Monitors Based on Photopletysmography. In 36th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). 3670--3673.",
      "doi": ""
    },
    {
      "text": "Rosalind W Picard and Jennifer Healey. 1997. Affective wearables. In Wearable Computers, 1997. Digest of Papers., First International Symposium on. IEEE, 90--97. ",
      "doi": "10.5555/851036.856451"
    },
    {
      "text": "Julia Pietilä, Saeed Mehrang, Johanna Tolonen, Elina Helander, Holly Jimison, Misha Pavel, and Ilkka Korhonen. 2017. Evaluation of the Accuracy and Reliability for Photoplethysmography Based Heart Rate and Beat-to-Beat Detection During Daily ActivitiesIFMBE Proceedings. 145--148.",
      "doi": ""
    },
    {
      "text": "Halley Profita, James Clawson, Scott M Gilliland, Clint Zeagler, Thad Starner, Jim Budd, and Ellen Yi-Luen Do. 2013. Don't Mind Me Touching My Wrist: a Case Study of Interacting with on-Body Technology in Public. ISWC (2013), 89.  ",
      "doi": "10.1145/2493988.2494331"
    },
    {
      "text": "Andrea A Quesada, Rosana M Tristao, Riccardo Pratesi, and Oliver T Wolf. 2014. Hyper-responsiveness to acute stress, emotional problems and poorer memory in former preterm children. Stress 17, 5 (2014), 389--399.",
      "doi": ""
    },
    {
      "text": "Michaela Riediger, Cornelia Wrzus, Kathrin Klipker, Viktor Muller, FLorian Schmiedek, and Gert G Wagner. 2014. Outside of the Laboratory: Associations of Working-Memory Performance with Psychological and Physiological Arousal Vary with Age. Psychology and Aging 29, 1 (2014), 103--114.",
      "doi": ""
    },
    {
      "text": "James A Russell. 1980. A Circumplex Model of Affect. Journal of Personality and Social Psychology 39, 6 (1980), 1161--1178.",
      "doi": ""
    },
    {
      "text": "Valorie N Salimpoor, Mitchel Benovoy, Gregory Longo, Jeremy R Cooperstock, and Robert J Zatorre. 2009. The rewarding aspects of music listening are related to degree of emotional arousal. PloS one 4, 10 (2009), e7487.",
      "doi": ""
    },
    {
      "text": "Hillary S Schaefer, Christine L Larson, Richard J Davidson, and James A Coan. 2014. Brain, body, and cognition: Neural, physiological and self-report correlates of phobic and normative fear. Biological psychology 98 (2014), 59--69.",
      "doi": ""
    },
    {
      "text": "Axel Schäfer and Jan Vagedes. 2013. How Accurate Is Pulse Rate Variability as an Estimate of Heart Rate Variability? International Journal of Cardiology 166, 1 (Jun 2013), 15--29.",
      "doi": ""
    },
    {
      "text": "Jocelyn Scheirer, Raul Fernandez, Jonathan Klein, and Rosalind W Picard. 2002. Frustrating the user on purpose: a step toward building an affective computer. Interacting with computers 14, 2 (2002), 93--118.",
      "doi": ""
    },
    {
      "text": "Ulrich Schimmack and Alexander Grob. 2000. Dimensional models of core affect: A quantitative comparison by means of structural equation modeling. European Journal of Personality 14, 4 (2000), 325--345.",
      "doi": ""
    },
    {
      "text": "Neil Schneiderman, Gail Ironson, and Scott D Siegel. 2005. Stress and health: psychological, behavioral, and biological determinants. Annu. Rev. Clin. Psychol. 1 (2005), 607--628.",
      "doi": ""
    },
    {
      "text": "N Selvaraj, A Jaryal, J Santhosh, K K Deepak, and S Anand. 2008. Assessment of Heart Rate Variability Derived From Finger-Tip Photoplethysmography as Compared to Electrocardiography. Journal of Medical Engineering & Technology 32, 6 (Jul 2008), 479--484.",
      "doi": ""
    },
    {
      "text": "Peter Seraganian, Attila Szabo, and Thomas G Brown. 1997. The effect of vocalization on the heart rate response to mental arithmetic. Physiology & behavior 62, 2 (1997), 221--224.",
      "doi": ""
    },
    {
      "text": "Cornelia Setz, Bert Arnrich, Johannes Schumm, Roberto La Marca, Gerhard Tröster, and Ulrike Ehlert. 2010. Discriminating stress from cognitive load using a wearable EDA device. IEEE Transactions on information technology in biomedicine 14, 2 (2010), 410--417.  ",
      "doi": "10.1109/TITB.2009.2036164"
    },
    {
      "text": "A Shcherbina, C M Mattsson, and D Waggott. 2017. Accuracy in Wrist-Worn, Sensor-Based Measurements of Heart Rate and Energy Expenditure in a Diverse Cohort. Journal of Personalized Medicine 7, 2 (2017), 3.",
      "doi": ""
    },
    {
      "text": "RP Sloan, PA Shapiro, E Bagiella, SM Boni, M Paik, JT Bigger, RC Steinman, and JM Gorman. 1994. Effect of mental stress throughout the day on cardiac autonomic control. Biological psychology 37, 2 (1994), 89--99.",
      "doi": ""
    },
    {
      "text": "D K Spierer, Z Rosen, and L L Litman. 2015. Validation of Photoplethysmography as a Method to Detect Heart Rate During Rest and Exercise. Journal of Medical Engineering & Technology 39, 5 (2015), 264--271.",
      "doi": ""
    },
    {
      "text": "Sarah E Stahl, Hyun-Sung An, Danae M Dinkel, John M Noble, and Jung-Min Lee. 2016. How Accurate Are the Wrist-Based Heart Rate Monitors During Walking and Running Activities? Are They Accurate Enough? BMJ Open Sport & Exercise Medicine 2, 1 (Apr 2016), e000106.",
      "doi": ""
    },
    {
      "text": "Feng-Tso Sun, Cynthia Kuo, Heng-Tze Cheng, Senaka Buthpitiya, Patricia Collins, and Martin L Griss. 2010. Activity-Aware Mental Stress Detection Using Physiological Sensors. MobiCASE 76, 2 (2010), 282--301.",
      "doi": ""
    },
    {
      "text": "Toshiyo Tamura, Yuka Maeda, Masaki Sekine, and Masaki Yoshida. 2014. Wearable Photoplethysmographic Sensors -- Past and Present. Electronics 3, 2 (Jun 2014), 282--302.",
      "doi": ""
    },
    {
      "text": "Robert E Thayer. 1998. The Biopsychology of Mood and Arousal.",
      "doi": ""
    },
    {
      "text": "Joe Tomaka, Jim Blascovich, and Laura Swart. 1994. Effects of vocalization on cardiovascular and electrodermal responses during mental arithmetic. International Journal of Psychophysiology 18, 1 (1994), 23--33.",
      "doi": ""
    },
    {
      "text": "Christiaan H Vinkers, Renske Penning, Juliane Hellhammer, Joris C Verster, John HGM Klaessens, Berend Olivier, and Cor J Kalkman. 2013. The effect of stress on core and peripheral body temperature in humans. Stress 16, 5 (2013), 520--530.",
      "doi": ""
    },
    {
      "text": "Elke Vlemincx, Ilse Van Diest, and Omer Van den Bergh. 2012. A Sigh Following Sustained Attention and Mental Stress: Effects on Respiratory Variability. Physiology & Behavior 107, 1 (Aug 2012), 1--6.",
      "doi": ""
    },
    {
      "text": "Matthew P Wallen, Sjaan R Gomersall, Shelley E Keating, Ulrik Wisløff, and Jeff S Coombes. 2016. Accuracy of Heart Rate Watches: Implications for Weight Management. PLoS ONE 11, 5 (May 2016), e0154420.",
      "doi": ""
    },
    {
      "text": "Christoph Weinert. 2016. Coping with the Dark Side of IT Usage: Mitigating the Effect of Technostress. In Proceedings of the 2016 ACM SIGMIS Conference on Computers and People Research (SIGMIS-CPR '16). ACM, New York, NY, USA, 9--10.  ",
      "doi": "10.1145/2890602.2906189"
    },
    {
      "text": "Rolf Weitkunat, Christopher RE Coggins, Zheng Sponsiello-Wang, Gerd Kallischnigg, and Ruth Dempsey. 2013. Assessment of cigarette smoking in epidemiologic studies. Beiträge zur Tabakforschung/Contributions to Tobacco Research 25, 7 (2013), 638--648.",
      "doi": ""
    },
    {
      "text": "Charlotte VO Witvliet and Scott R Vrana. 2007. Play it again Sam: Repeated exposure to emotionally evocative music polarises liking and smiling responses, and influences other affective reports, facial EMG, and heart rate. Cognition and Emotion 21, 1 (2007), 3--25.",
      "doi": ""
    }
  ]
}