{
  "doi": "10.1145/3173574.3173584",
  "title": "M-Kulinda: Using a Sensor-Based Technology Probe to Explore Domestic Security in Rural Kenya",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "In rural Kenyan households, property theft is a persistent problem. To explore how Information and Communication Technologies (ICTs) may be used to address this problem we designed and deployed \"M-Kulinda\"-a sensor-based technology probe. We used interview, observation, diary, and data logging methods to understand 20 households' experiences using the system. Our findings suggest that a probe's approach is useful in this context, more specifically we found that participants used our system in different ways to address their specific needs (e.g., monitoring poultry, electronics, and their family members). We also observed changes in our participants' understanding of sensors; M-Kulinda prompted them to reflect on other areas where sensors could be used in their households. We present design implications based on these findings, and offer new perspectives on the role of technology in deterring crime.",
  "tags": [
    "technology probes",
    "ictd",
    "hci4d",
    "rural",
    "kenya",
    "home protection"
  ],
  "authors": [
    {
      "name": "George Hope Chidziwisano",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261869",
      "orcid": "missing"
    },
    {
      "name": "Susan Wyche",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/do/10.1145/contrib-81314492849/rel-imgonly/wyche__susan-2021-1-2.jpg.headshot.small.jpg",
      "acmid": "81314492849",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Seyram Avle and Silvia Lindtner. 2016. Design (ing)'Here'and'There': Tech Entrepreneurs, Global Markets, and Reflexivity in Design Processes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 2233--2245.  ",
      "doi": "10.1145/2858036.2858509"
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2: 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Nicola J Bidwell, Masbulele Siya, Gary Marsden, William D Tucker, M Tshemese, N Gaven, S Ntlangano, Simon Robinson, and Kristen A L I Eglinton. 2008. Walking and the Social Life of Solar Charging in Rural Africa. ACM Trans. Comput.-Hum. Interact. 20, 4: 22:1--22:33.  ",
      "doi": "10.1145/2493524"
    },
    {
      "text": "Patrick Biernacki and Dan Waldorf. 1981. Snowball sampling: Problems and techniques of chain referral sampling. Sociological methods & research 10, 2: 141-- 163.",
      "doi": ""
    },
    {
      "text": "Margot Brereton, Alessandro Soro, Kate Vaisutis, and Paul Roe. 2015. The messaging kettle: Prototyping connection over a distance between adult children and older parents. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 713--716.  ",
      "doi": "10.1145/2702123.2702462"
    },
    {
      "text": "Hilary Browne, Benjamin B Bederson, Catherine Plaisant, and Allison Druin. 2001. Designing an interactive message board as a technology probe for family communication.",
      "doi": ""
    },
    {
      "text": "Emmanuel K Bunei, Samwel Auya, and Joseph K Rono. 2016. Agricultural crime in Africa. The Routledge International Handbook of Rural Criminology: 117.",
      "doi": ""
    },
    {
      "text": "Emmanuel K Bunei, Gerard McElwee, and Robert Smith. 2016. From bush to butchery: cattle rustling as an entrepreneurial process in Kenya. Society and Business Review 11, 1: 46--61.",
      "doi": ""
    },
    {
      "text": "Ke-Yu Chen, Shwetak N Patel, and Sean Keller. 2016. Finexus: Tracking precise motions of multiple fingertips using magnetic sensing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 1504--1514.  ",
      "doi": "10.1145/2858036.2858125"
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, Shwetak N Patel, and Julie A Kientz. 2012. Investigating receptiveness to sensing and inference in the home using sensor proxies. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing, 61--70.  ",
      "doi": "10.1145/2370216.2370226"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A Kientz. 2015. SleepTight: low-burden, self-monitoring technology for capturing and reflecting on sleep behaviors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 121--132.  ",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Andy Crabtree and Peter Tolmie. 2016. A Day in the Life of Things in the Home. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 1738--1750.  ",
      "doi": "10.1145/2818048.2819954"
    },
    {
      "text": "Ben Crow, James Davies, Susan Paterson, and Julio Miles. 2013. Using GPS and recall to understand water collection in Kenyan informal settlements. Water international 38, 1: 43--60.",
      "doi": ""
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The ins and outs of HCI for development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 2220--2232.  ",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. Yours is better!: participant response bias in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1321--1330.  ",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Audrey Desjardins, Ron Wakkary, William Odom, and British Columbia. 2015. Investigating Genres and Perspectives in HCI Research on the Home. 3073-- 3082.  ",
      "doi": "10.1145/2702123.2702540"
    },
    {
      "text": "Sheena Lewis Erete. 2013. Protecting the home: exploring the roles of technology and citizen activism from a burglar's perspective. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 2507--2516.  ",
      "doi": "10.1145/2470654.2481347"
    },
    {
      "text": "Vannessa Evers. 2001. Cultural aspects of user interface understanding. Doc. Diss. Open Univ, London.",
      "doi": ""
    },
    {
      "text": "Graham Farrell, Nick Tilley, and Andromachi Tseloni. 2014. Why the crime drop? Crime and Justice 43, 1: 421--490.",
      "doi": ""
    },
    {
      "text": "Mayank Goel, Elliot Saba, Maia Stiber, Eric Whitmire, Josh Fromm, Eric C Larson, Gaetano Borriello, and Shwetak N Patel. 2016. Spirocall: Measuring lung function over a phone call. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 5675--5685.  ",
      "doi": "10.1145/2858036.2858401"
    },
    {
      "text": "Mayank Goel, Chen Zhao, Ruth Vinisha, and Shwetak N Patel. 2015. Tongue-in-Cheek: Using Wireless Signals to Enable Non-Intrusive and Flexible Facial Gestures Detection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 255--258.  ",
      "doi": "10.1145/2702123.2702591"
    },
    {
      "text": "Ulrike Grote and Frank Neubacher. 2016. Rural Crime in Developing Countries: Theoretical Framework, Empirical Findings, Research Needs. Hannover, Germany.",
      "doi": ""
    },
    {
      "text": "Kyoung Nam Ha, Kyung Chang Lee, and Suk Lee. 2006. Development of PIR sensor based indoor location detection system for smart home. In SICEICASE, 2006. International Joint Conference, 2162-- 2167.",
      "doi": ""
    },
    {
      "text": "M R Ho, T N Smyth, M Kam, and A Dearden. 2009. Human-Computer Interaction for Development: The Past, Present, and Future. Information Technology and International Development (ITID) 5, 4.",
      "doi": ""
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data engagement through physical ambient visualizations in the home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 1608--1619.  ",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Lara Houston. 2013. Inventive infrastructures: an exploration of mobile phone'repair'cultures in Kampala, Uganda.",
      "doi": ""
    },
    {
      "text": "Steve Howard, Jesper Kjeldskov, and Mikael B Skov. 2007. Pervasive computing in the domestic space. Personal and Ubiquitous Computing 11, 5: 329--333.  ",
      "doi": "10.1007/s00779-006-0081-8"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, and Heiko Hansen. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI conference on Human factors in computing systems, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Hilary Hutchinson, Catherine Plaisant, and Allison Druin. 2002. Case study: a message board as a technology probe for family communication and coordination. In Proceedings of the 2002 Conference on Human Factors in Computing Systems (CHI Workshop on Technologies for Families), Minneapolis: ACM Press.",
      "doi": ""
    },
    {
      "text": "Julie A Kientz, Shwetak N Patel, Brian Jones, E D Price, Elizabeth D Mynatt, and Gregory D Abowd. 2008. The georgia tech aware home. In CHI'08 extended abstracts on Human factors in computing systems, 3675--3680.  ",
      "doi": "10.1145/1358628.1358911"
    },
    {
      "text": "Paul Kieti Kimalu. 2002. A situational analysis of poverty in Kenya. Kenya Institute for Public Policy Research and Analysis.",
      "doi": ""
    },
    {
      "text": "Eric Mutisya Kioko. 2017. Conflict Resolution and Crime Surveillance in Kenya: Local Peace Committees and Nyumba Kumi. Africa Spectrum 52, 1: 3--32.",
      "doi": ""
    },
    {
      "text": "Nir Kshetri. 2017. The economics of the Internet of Things in the Global South. Third World Quarterly 38, 2: 311--339.",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, William Odom, James Pierce, and Eric Paulos. 2011. Nurturing natural sensors. In Proceedings of the 13th international conference on Ubiquitous computing, 227--236.  ",
      "doi": "10.1145/2030112.2030144"
    },
    {
      "text": "Geoff Langdale, Judy Kay, and Bob Kummerfeld. 2006. Using an intergenerational communications system as a'light-weight'technology probe. In CHI'06 Extended Abstracts on Human Factors in Computing Systems, 1001--1006.  ",
      "doi": "10.1145/1125451.1125643"
    },
    {
      "text": "Kenneth Lee, Edward Miguel, and Catherine Wolfram. 2016. Appliance Ownership and Aspirations among Electric Grid and Home Solar Households in Rural Kenya. The American Economic Review 106, 5: 89--94.",
      "doi": ""
    },
    {
      "text": "Sheena Lewis and Dan A. Lewis. 2012. Examining technology that supports community policing. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12: 1371.  ",
      "doi": "10.1145/2207676.2208595"
    },
    {
      "text": "Arunesh Mathur, Brent Schlotfeldt, and Marshini Chetty. 2015. A mixed-methods study of mobile users' data usage practices in South Africa. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 1209--1220.  ",
      "doi": "10.1145/2750858.2804292"
    },
    {
      "text": "Izumi Matsuda, Hiroshi Nittono, and Tokihiro Ogawa. 2011. Event-related potentials increase the discrimination performance of the autonomic-based concealed information test. Psychophysiology 48, 12: 1701--1710.",
      "doi": ""
    },
    {
      "text": "Francis M Munene. 2003. Household Population and Housing Characteristics. Kenya Demographic and Health Survey. KCB o. Statistics. Nairobi, Kenya Central Bureau of Statistics.",
      "doi": ""
    },
    {
      "text": "San Murugesan. 2013. Mobile apps in Africa. IT Professional 15, 5: 8--11.  ",
      "doi": "10.1109/MITP.2013.83"
    },
    {
      "text": "Kyalo Musoi. 2014. A study of crime in urban slums in Kenya: the case of Kibra, Bondeni, Manyatta and Mishomoroni slums. Nairobi, Kenya.",
      "doi": ""
    },
    {
      "text": "Eston Ngugi. 2013. Bungoma county. Nairobi, Kenya.",
      "doi": ""
    },
    {
      "text": "Rebecca Njuki, Jerry Okal, Charlotte E Warren, Francis Obare, Timothy Abuya, Lucy Kanya, Chi-Chi Undie, Ben Bellows, and Ian Askew. 2012. Exploring the effectiveness of the output-based aid voucher program to increase uptake of gender-based violence recovery services in Kenya: a qualitative evaluation. BMC Public Health 12, 1: 426.",
      "doi": ""
    },
    {
      "text": "William T Odom, Abigail J Sellen, Richard Banks, David S Kirk, Tim Regan, Mark Selby, Jodi L Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1961--1970.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Collins Oduor, Freddie Acosta, and Everlyne Makhanu. 2014. The adoption of mobile technology as a tool for situational crime prevention in Kenya. In IST-Africa Conference Proceedings, 2014, 1--7.",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Carman Neustaedter, and Kate Hennessy. 2016. The design and evaluation of a photographsharing application for rural and urban Kenyan families. Personal and Ubiquitous Computing: 1--19.  ",
      "doi": "10.1007/s00779-016-0930-z"
    },
    {
      "text": "Erick Oduor, Carman Neustaedter, Tejinder K Judge, Kate Hennessy, Carolyn Pang, and Serena Hillman. 2014. How technology supports family communication in rural, suburban, and urban kenya. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 2705--2714.  ",
      "doi": "10.1145/2556288.2557277"
    },
    {
      "text": "Shigehiro Oishi, Edward F Diener, Richard E Lucas, and Eunkook M Suh. 1999. Cross-cultural variations in predictors of life satisfaction: Perspectives from needs and values. Personality and social psychology bulletin 25, 8: 980--990.",
      "doi": ""
    },
    {
      "text": "Cecilia Oyugi, Lynne Dunckley, and Andy Smith. 2008. Evaluation methods and cultural differences: studies across three continents. NordiCHI '08: Proceedings of the 5th Nordic conference on Humancomputer interaction: building bridges: 318--325.  ",
      "doi": "10.1145/1463160.1463195"
    },
    {
      "text": "Aggeliki Pantazi, Abu Sebastian, T A Antonakopoulos, Peter Bächtold, Anthony R Bonaccio, Jose Bonan, Giovanni Cherubini, Michel Despont, Richard A DiPietro, and Ute Drechsler. 2008. Probe-based ultrahigh-density storage technology. IBM Journal of Research and Development 52, 4.5: 493--511.  ",
      "doi": "10.1147/rd.524.0493"
    },
    {
      "text": "Joshua M Pearce. 2012. Building Research Equipment with Free, Open-Source Hardware. Science 337, 6100: 1303 LP-1304. Retrieved from http://science.sciencemag.org/content/337/6100/1303.a bstract",
      "doi": ""
    },
    {
      "text": "Trevor Perrier, Nicola Dell, Brian DeRenzi, Richard Anderson, John Kinuthia, Jennifer Unger, and Grace John-Stewart. 2015. Engaging Pregnant Women in Kenya with a Hybrid Computer-Human SMS Communication System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1429--1438.  ",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Jacob Poushter and Russ Oates. 2015. Cell phones in Africa: communication lifeline. Washingston DC: Pew Research Centre.",
      "doi": ""
    },
    {
      "text": "RISC. 2016. Kenya 2016 Crime and Safety Report. Nairobi, Kenya.",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, 49-- 58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Anselm L Strauss. 1987. Qualitative analysis for social scientists. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Nick Tilley, Andromachi Tseloni, and Graham Farrell. 2011. Income disparities of burglary risk: Security availability during the crime drop. The British Journal of Criminology 51, 2: 296--313.",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger. 2016. \"This has to be the cats\": Personal Data Legibility in Networked Sensing Systems. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 491--502.  ",
      "doi": "10.1145/2818048.2819992"
    },
    {
      "text": "K Toyama. 2010. Human-Computer Interaction and Global Development. Foundations and Trends in Human-Computer Interaction 4, 1: 1--79.  ",
      "doi": "10.1561/1100000021"
    },
    {
      "text": "Richard Vokes. 2016. Before the Call: Mobile Phones, Exchange Relations, and Social Change in Southwestern Uganda. Ethnos: Journal of Anthropology: 1-- 16.",
      "doi": ""
    },
    {
      "text": "Eric Whitmire, Laura Trutoiu, Robert Cavin, David Perek, Brian Scally, James Phillips, and Shwetak Patel. 2016. EyeContact: scleral coil eye tracking for virtual reality. In Proceedings of the 2016 ACM International Symposium on Wearable Computers, 184--191.  ",
      "doi": "10.1145/2971763.2971771"
    },
    {
      "text": "Urs Martin Wiesmann, Boniface Kiteme, and Zachary Mwangi. 2014. Socio-economic atlas of Kenya: depicting the National Population Census by county and sub-location. Kenya National Bureau of Statistics, Centre for Training and Integrated Research in ASAL Development, Centre for Development and Environment.",
      "doi": ""
    },
    {
      "text": "V Wiseman, L Conteh, and F Matovu. 2005. Using diaries to collect data in resource-poor settings: questions on design and implementation. Health Policy and Planning 20, 6: 394--404.",
      "doi": ""
    },
    {
      "text": "Susan Wyche, Tawanna R Dillahunt, Nightingale Simiyu, and Sharon Alaka. 2015. \"If God gives me the chance I will design my own phone\": Exploring Mobile Phone Repair and Postcolonial Approaches to Design in Rural Kenya. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 463--473.  ",
      "doi": "10.1145/2750858.2804249"
    },
    {
      "text": "Susan P Wyche and Laura L Murphy. 2013. Powering the cellphone revolution: findings from mobile phone charging trials in off-grid Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1959--1968.  ",
      "doi": "10.1145/2470654.2466260"
    },
    {
      "text": "Susan Wyche and Charles Steinfield. 2015. Why Don't Farmers Use Cell Phones to Access Market Prices? Technology Affordances and Barriers to Market Information Services Adoption in Rural Kenya. Information Technology for Development 1102, July 2015: 1--14.  ",
      "doi": "10.1080/02681102.2015.1048184"
    },
    {
      "text": "Alvin Yeo. 1998. Cultural effects in usability assessment. In CHI 98 Cconference Summary on Human Factors in Computing Systems, 74--75.  ",
      "doi": "10.1145/286498.286536"
    },
    {
      "text": "Piero Zappi, Elisabetta Farella, and Luca Benini. 2010. Tracking motion direction and distance with pyroelectric IR sensors. IEEE Sensors Journal 10, 9: 1486--1494.",
      "doi": ""
    }
  ]
}