{
  "doi": "10.1145/3173574.3173786",
  "title": "Examining the Demand for Spam: Who Clicks?",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Despite significant advances in automated spam detection, some spam content manages to evade detection and engage users. While the spam supply chain is well understood through previous research, there is little understanding of spam consumers. We focus on the demand side of the spam equation examining what drives users to click on spam via a large-scale analysis of de-identified, aggregated Facebook log data (n=600,000). We find (1) that the volume of spam and clicking norms in a users' network are significantly related to individual consumption behavior; (2) that more active users are less likely to click, suggesting that experience and internet skill (weakly correlated with activity level) may create more savvy consumers; and (3) we confirm previous findings about the gender effect in spam consumption, but find this effect largely corresponds to spam topics. Our findings provide practical insights to reduce demand for spam content, thereby affecting spam profitability.",
  "authors": [
    {
      "name": "Elissa M. Redmiles",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-87258829257/rel-imgonly/2017headshot.jpg",
      "acmid": "87258829257",
      "orcid": "0000-0003-3930-8128"
    },
    {
      "name": "Neha Chachra",
      "institution": "Facebook Inc., Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486646626",
      "orcid": "missing"
    },
    {
      "name": "Brian Waismeyer",
      "institution": "Facebook Inc., Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261399",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Davey Alba. 2016. Facebook finally gets real about fighting fake news. (2016).",
      "doi": ""
    },
    {
      "text": "Abdullah Alnajim and Malcolm Munro. 2009. An anti-phishing approach that uses training intervention for phishing websites detection. In Information Technology: New Generations, 2009. ITNG'09. Sixth International Conference on. IEEE, 405--410.  ",
      "doi": "10.1109/ITNG.2009.109"
    },
    {
      "text": "Feona Attwood. 2005. 'Tits and ass and porn and fighting': Male heterosexuality in magazines for men. International Journal of Cultural Studies 8, 1 (2005), 83--100.",
      "doi": ""
    },
    {
      "text": "James E Barlett, Joe W Kotrlik, and Chadwick C Higgins. 2001. Organizational research: Determining appropriate sample size in survey research. Information technology, learning, and performance journal 19, 1 (2001), 43.",
      "doi": ""
    },
    {
      "text": "Adam Beautement, M Angela Sasse, and Mike Wonham. 2009. The compliance budget: managing security behaviour in organisations. In Proceedings of the 2008 workshop on New security paradigms. ACM, 47--58.  ",
      "doi": "10.1145/1595676.1595684"
    },
    {
      "text": "Jeremy Birnholtz, Moira Burke, and Annie Steele. 2017. Untagging on social media: Who untags, what do they untag, and why? Computers in Human Behavior 69 (2017), 166--173.  ",
      "doi": "10.1016/j.chb.2016.12.008"
    },
    {
      "text": "Gamze Canova, Melanie Volkamer, Clemens Bergmann, and Roland Borza. 2014. NoPhish: an anti-phishing education app. In International Workshop on Security and Trust Management. Springer, 188--192.",
      "doi": ""
    },
    {
      "text": "Qiang Cao and Xiaowei Yang. 2013. SybilFence: Improving social-graph-based sybil defenses with user negative feedback. arXiv preprint arXiv:1304.3819 (2013).",
      "doi": ""
    },
    {
      "text": "Neha Chachra, Damon McCoy, Stefan Savage, and Geoffrey M Voelker. 2014. Empirically characterizing domain abuse and the revenue impact of blacklisting. In Proceedings of the Workshop on the Economics of Information Security (WEIS). 4.",
      "doi": ""
    },
    {
      "text": "Josh Constine. 2017. Facebook now has 2 billion monthly users and responsibility. (2017). https: //techcrunch.com/2017/06/27/facebook-2-billion-users/",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Adam DI Kramer, Laura A Dabbish, and Jason I Hong. 2015. The role of social influence in security feature adoption. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1416--1426.  ",
      "doi": "10.1145/2675133.2675225"
    },
    {
      "text": "Emiliano De Cristofaro, Arik Friedman, Guillaume Jourjon, Mohamed Ali Kaafar, and M Zubair Shafiq. 2014. Paying for likes?: Understanding facebook like fraud using honeypots. In Proceedings of the 2014 Conference on Internet Measurement Conference. ACM, 129--136.  ",
      "doi": "10.1145/2663716.2663729"
    },
    {
      "text": "Julie S Downs, Mandy Holbrook, and Lorrie Faith Cranor. 2007. Behavioral response to phishing risk. In Proceedings of the anti-phishing working groups 2nd annual eCrime researchers summit. ACM, 37--44.  ",
      "doi": "10.1145/1299015.1299019"
    },
    {
      "text": "Facebook. 2017a. About Pages. (2017). https://www. facebook.com/help/282489752085908/?helpref=hc_fnav",
      "doi": ""
    },
    {
      "text": "Facebook. 2017b. About placements. (2017). https://www.facebook.com/business/help/407108559393196",
      "doi": ""
    },
    {
      "text": "Facebook. 2017c. How Do I Share a Post I See On My News Feed? (2017). https://www.facebook.com/help/ 163779957017799?helpref=search&sr=2&query=reshare",
      "doi": ""
    },
    {
      "text": "Facebook. 2017d. Your Home Page. (2017). https://www. facebook.com/help/753701661398957/?helpref=hc_fnav",
      "doi": ""
    },
    {
      "text": "Deen G Freelon. 2010. ReCal: Intercoder reliability calculation as a web service. International Journal of Internet Science 5, 1 (2010), 20--33.",
      "doi": ""
    },
    {
      "text": "Hongyu Gao, Jun Hu, Christo Wilson, Zhichun Li, Yan Chen, and Ben Y Zhao. 2010. Detecting and characterizing social spam campaigns. In Proceedings of the 10th ACM SIGCOMM conference on Internet measurement. ACM, 35--47.  ",
      "doi": "10.1145/1879141.1879147"
    },
    {
      "text": "Chris Grier, Kurt Thomas, Vern Paxson, and Michael Zhang. 2010. @ spam: the underground on 140 characters or less. In Proceedings of the 17th ACM conference on Computer and communications security. ACM, 27--37.  ",
      "doi": "10.1145/1866307.1866311"
    },
    {
      "text": "Aditi Gupta, Hemank Lamba, Ponnurangam Kumaraguru, and Anupam Joshi. 2013. Faking sandy: characterizing and identifying fake images on twitter during hurricane sandy. In Proceedings of the 22nd international conference on World Wide Web. ACM, 729--736.  ",
      "doi": "10.1145/2487788.2488033"
    },
    {
      "text": "Eszter Hargittai and Yuli Patrick Hsieh. 2012. Succinct survey measures of web-use skills. Social Science Computer Review 30, 1 (2012), 95--107.  ",
      "doi": "10.1177/0894439310397146"
    },
    {
      "text": "Mariana Hentea, Harpal Dhillon, and Manpreet Dhillon. 2006. Towards changes in information security education. Journal of Information Technology Education: Research 5, 1 (2006), 221--233.",
      "doi": ""
    },
    {
      "text": "Jason Hong. 2012. The state of phishing attacks. Commun. ACM 55, 1 (2012), 74--81.  ",
      "doi": "10.1145/2063176.2063197"
    },
    {
      "text": "Danesh Irani, Steve Webb, and Calton Pu. 2010. Study of Static Classification of Social Spam Profiles in MySpace.. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Tom N Jagatic, Nathaniel A Johnson, Markus Jakobsson, and Filippo Menczer. 2007. Social phishing. Commun. ACM 50, 10 (2007), 94--100.  ",
      "doi": "10.1145/1290958.1290968"
    },
    {
      "text": "Jing Jiang, Christo Wilson, Xiao Wang, Wenpeng Sha, Peng Huang, Yafei Dai, and Ben Y Zhao. 2013. Understanding latent interactions in online social networks. ACM Transactions on the Web (TWEB) 7, 4 (2013), 18.  ",
      "doi": "10.1145/2517040"
    },
    {
      "text": "Chris Kanich, Christian Kreibich, Kirill Levchenko, Brandon Enright, Geoffrey M Voelker, Vern Paxson, and Stefan Savage. 2008. Spamalytics: An empirical analysis of spam marketing conversion. In Proceedings of the 15th ACM conference on Computer and communications security. ACM, 3--14.  ",
      "doi": "10.1145/1455770.1455774"
    },
    {
      "text": "Klaus Krippendorff. 2004. Reliability in content analysis. Human communication research 30, 3 (2004), 411--433.",
      "doi": ""
    },
    {
      "text": "Katharina Krombholz, Dieter Merkl, and Edgar Weippl. 2012. Fake identities in social media: A case study on the sustainability of the facebook business model. Journal of Service Science Research 4, 2 (2012), 175.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru, Justin Cranshaw, Alessandro Acquisti, Lorrie Cranor, Jason Hong, Mary Ann Blair, and Theodore Pham. 2009. School of phish: a real-world evaluation of anti-phishing training. In Proceedings of the 5th Symposium on Usable Privacy and Security. ACM, 3.  ",
      "doi": "10.1145/1572532.1572536"
    },
    {
      "text": "Ponnurangam Kumaraguru, Yong Rhee, Alessandro Acquisti, Lorrie Faith Cranor, Jason Hong, and Elizabeth Nunge. 2007. Protecting people from phishing: the design and evaluation of an embedded training email system. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 905--914.  ",
      "doi": "10.1145/1240624.1240760"
    },
    {
      "text": "Kyumin Lee, James Caverlee, and Steve Webb. 2010. Uncovering social spammers: social honeypots+ machine learning. In Proceedings of the 33rd international ACM SIGIR conference on Research and development in information retrieval. ACM, 435--442.  ",
      "doi": "10.1145/1835449.1835522"
    },
    {
      "text": "Stanley Lemeshow and David W Hosmer Jr. 1982. A review of goodness of fit statistics for use in the development of logistic regression models. American journal of epidemiology 115, 1 (1982), 92--106.",
      "doi": ""
    },
    {
      "text": "Kirill Levchenko, Andreas Pitsillidis, Neha Chachra, Brandon Enright, Márk Félegyházi, Chris Grier, Tristan Halvorson, Chris Kanich, Christian Kreibich, He Liu, and others. 2011. Click trajectories: End-to-end analysis of the spam value chain. In Security and Privacy (SP), 2011 IEEE Symposium on. IEEE, 431--446.  ",
      "doi": "10.1109/SP.2011.24"
    },
    {
      "text": "Chengfeng Lin, Jianhua He, Yi Zhou, Xiaokang Yang, Kai Chen, and Li Song. 2013. Analysis and identification of spamming behaviors in sina weibo microblog. In Proceedings of the 7th Workshop on Social Network Mining and Analysis. ACM, 5.  ",
      "doi": "10.1145/2501025.2501035"
    },
    {
      "text": "Xinye Lin, Mingyuan Xia, and Xue Liu. 2015. Does\" Like\" Really Mean Like? A Study of the Facebook Fake Like Phenomenon and an Efficient Countermeasure. arXiv preprint arXiv:1503.05414 (2015).",
      "doi": ""
    },
    {
      "text": "Benjamin Markines, Ciro Cattuto, and Filippo Menczer. 2009. Social spam detection. In Proceedings of the 5th International Workshop on Adversarial Information Retrieval on the Web. ACM, 41--48.  ",
      "doi": "10.1145/1531914.1531924"
    },
    {
      "text": "Michael Mccord and M Chuah. 2011. Spam detection on twitter using traditional classifiers. In international conference on Autonomic and trusted computing. Springer, 175--186. ",
      "doi": "10.5555/2035700.2035717"
    },
    {
      "text": "Damon McCoy, Andreas Pitsillidis, Grant Jordan, Nicholas Weaver, Christian Kreibich, Brian Krebs, Geoffrey M Voelker, Stefan Savage, and Kirill Levchenko. 2012. Pharmaleaks: Understanding the business of online pharmaceutical affiliate programs. In Proceedings of the 21st USENIX conference on Security symposium. USENIX Association, 1--1. ",
      "doi": "10.5555/2362793.2362794"
    },
    {
      "text": "Janice M Morse. 1994. Emerging from the data: The cognitive processes of analysis in qualitative inquiry. Critical issues in qualitative research methods 346 (1994), 350--351.",
      "doi": ""
    },
    {
      "text": "James Nicholson, Lynne Coventry, and Pam Briggs. 2017. Can we fight social engineering attacks by social means? Assessing social salience as a means to improve phish detection. In Thirteenth Symposium on Usable Privacy and Security (SOUPS 2017). USENIX Association, Santa Clara, CA, 285--298.",
      "doi": ""
    },
    {
      "text": "Patrick G Nyeste and Christopher B Mayhorn. 2010. Training Users to Counteract Phishing. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 54. SAGE Publications Sage CA: Los Angeles, CA, 1956--1960.",
      "doi": ""
    },
    {
      "text": "Md Sazzadur Rahman, Ting-Kai Huang, Harsha V Madhyastha, and Michalis Faloutsos. 2012. Frappe: detecting malicious facebook applications. In Proceedings of the 8th international conference on Emerging networking experiments and technologies. ACM, 313--324.  ",
      "doi": "10.1145/2413176.2413213"
    },
    {
      "text": "Jacob Ratkiewicz, Michael Conover, Mark Meiss, Bruno Gonçalves, Snehal Patil, Alessandro Flammini, and Filippo Menczer. 2011. Truthy: mapping the spread of astroturf in microblog streams. In Proceedings of the 20th international conference companion on World wide web. ACM, 249--252.  ",
      "doi": "10.1145/1963192.1963301"
    },
    {
      "text": "Marnie E Rice and Grant T Harris. 2005. Comparing effect sizes in follow-up studies: ROC Area, Cohen's d, and r. Law and human behavior 29, 5 (2005), 615.",
      "doi": ""
    },
    {
      "text": "Hervé Robert. 2016. Spam Fighting at Scale. (2016). https://code.facebook.com/posts/894756093957171/ spam-fighting-scale-2016/",
      "doi": ""
    },
    {
      "text": "Scott Ruoti, Tyler Monson, Justin Wu, Daniel Zappala, and Kent Seamons. 2017. Weighing Context and Trade-offs: How Suburban Adults Selected Their Online Security Posture. In Thirteenth Symposium on Usable Privacy and Security ({SOUPS} 2017). USENIX Association, 211--228.",
      "doi": ""
    },
    {
      "text": "Steve Sheng, Mandy Holbrook, Ponnurangam Kumaraguru, Lorrie Faith Cranor, and Julie Downs. 2010. Who falls for phish?: a demographic analysis of phishing susceptibility and effectiveness of interventions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 373--382.  ",
      "doi": "10.1145/1753326.1753383"
    },
    {
      "text": "Steve Sheng, Bryant Magnien, Ponnurangam Kumaraguru, Alessandro Acquisti, Lorrie Faith Cranor, Jason Hong, and Elizabeth Nunge. 2007. Anti-phishing phil: the design and evaluation of a game that teaches people not to fall for phish. In Proceedings of the 3rd symposium on Usable privacy and security. ACM, 88--99.  ",
      "doi": "10.1145/1280680.1280692"
    },
    {
      "text": "Sukamol Srikwan and Markus Jakobsson. 2008. Using cartoons to teach internet security. Cryptologia 32, 2 (2008), 137--154.  ",
      "doi": "10.1080/01611190701743724"
    },
    {
      "text": "Gianluca Stringhini, Christopher Kruegel, and Giovanni Vigna. 2010. Detecting spammers on social networks. In Proceedings of the 26th annual computer security applications conference. ACM, 1--9.  ",
      "doi": "10.1145/1920261.1920263"
    },
    {
      "text": "Shuhaili Talib, Nathan L Clarke, and Steven M Furnell. 2013. Establishing a personalized information security culture. In Contemporary Challenges and Solutions for Mobile and Multimedia Technologies. IGI Global, 53--69.",
      "doi": ""
    },
    {
      "text": "Kurt Thomas, Chris Grier, Dawn Song, and Vern Paxson. 2011. Suspended accounts in retrospect: an analysis of twitter spam. In Proceedings of the 2011 ACM SIGCOMM conference on Internet measurement conference. ACM, 243--258.  ",
      "doi": "10.1145/2068816.2068840"
    },
    {
      "text": "Kurt Thomas, Damon McCoy, Chris Grier, Alek Kolcz, and Vern Paxson. 2013. Trafficking Fraudulent Accounts: The Role of the Underground Market in Twitter Spam and Abuse.. In USENIX Security Symposium. 195--210. ",
      "doi": "10.5555/2534766.2534784"
    },
    {
      "text": "International Telecommunication Union. 2016. Measuring the Information Society Report. (2016). https://www.itu.int/en/ITU-D/Statistics/Documents/ publications/misr2016/MISR2016-w4.pdf",
      "doi": ""
    },
    {
      "text": "Arun Vishwanath, Tejaswini Herath, Rui Chen, Jingguo Wang, and H Raghav Rao. 2011. Why do people get phished? Testing individual differences in phishing vulnerability within an integrated, information processing model. Decision Support Systems 51, 3 (2011), 576--586.  ",
      "doi": "10.1016/j.dss.2011.03.002"
    },
    {
      "text": "Kaze Wong, Angus Wong, Alan Yeung, Wei Fan, and Su-Kit Tang. 2014. Trust and privacy exploitation in online social networks. IT Professional 16, 5 (2014), 28--33.",
      "doi": ""
    },
    {
      "text": "Chao Yang, Robert Harkreader, Jialong Zhang, Seungwon Shin, and Guofei Gu. 2012. Analyzing spammers' social networks for fun and profit: a case study of cyber criminal ecosystem on twitter. In Proceedings of the 21st international conference on World Wide Web. ACM, 71--80.  ",
      "doi": "10.1145/2187836.2187847"
    },
    {
      "text": "Sarita Yardi, Daniel Romero, Grant Schoenebeck, and others. 2009. Detecting spam in a twitter network. First Monday 15, 1 (2009).",
      "doi": ""
    },
    {
      "text": "Xianchao Zhang, Shaoping Zhu, and Wenxin Liang. 2012. Detecting spam and promoting campaigns in the twitter social network. In Data Mining (ICDM), 2012 IEEE 12th International Conference on. IEEE, 1194--1199.  ",
      "doi": "10.1109/ICDM.2012.28"
    }
  ]
}