{
  "doi": "10.1145/3173574.3173821",
  "title": "HomeFinder Revisited: Finding Ideal Homes with Reachability-Centric Multi-Criteria Decision Making",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Finding an ideal home is a difficult and laborious process. One of the most crucial factors in this process is the reachability between the home location and the concerned points of interest, such as places of work and recreational facilities. However, such importance is unrecognized in the extant real estate systems. By characterizing user requirements and analytical tasks in the context of finding ideal homes, we designed ReACH, a novel visual analytics system that assists people in finding, evaluating, and choosing a home based on multiple criteria, including reachability. In addition, we developed an improved data-driven model for approximating reachability with massive taxi trajectories. This model enables users to interactively integrate their knowledge and preferences to make judicious and informed decisions. We show the improvements in our model by comparing the theoretical complexities with the prior study and demonstrate the usability and effectiveness of the proposed system with task-based evaluation.",
  "authors": [
    {
      "name": "Di Weng",
      "institution": "Zhejiang University, Hangzhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659093884",
      "orcid": "0000-0003-2712-7274"
    },
    {
      "name": "Heming Zhu",
      "institution": "Zhejiang University, HangZhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261070",
      "orcid": "missing"
    },
    {
      "name": "Jie Bao",
      "institution": "Microsoft Research, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658970413",
      "orcid": "missing"
    },
    {
      "name": "Yu Zheng",
      "institution": "Microsoft Research, Beijing, China",
      "img": "/do/10.1145/contrib-81350600388/rel-imgonly/tiny_head_yuzheng.jpg",
      "acmid": "81350600388",
      "orcid": "missing"
    },
    {
      "name": "Yingcai Wu",
      "institution": "Zhejiang University, Hangzhou, Zhejiang, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81388595547",
      "orcid": "0000-0002-1119-3237"
    }
  ],
  "references": [
    {
      "text": "Shamal Al-Dohuki, Yingyu Wu, Farah Kamw, Jing Yang, Xin Li, Ye Zhao, Xinyue Ye, Wei Chen, Chao Ma, and Fei Wang. 2017. SemanticTraj: A New Approach to Interacting with Massive Taxi Trajectories. IEEE TVCG 23, 1 (2017), 11--20.  ",
      "doi": "10.1109/TVCG.2016.2598416"
    },
    {
      "text": "Altisource Inc. 2017. Hubzu: Homes For Sale | Online Real Estate Auctions | Property Listings. http://www.hubzu.com. (2017). Online; accessed 07-Sept-2017.",
      "doi": ""
    },
    {
      "text": "Michael Behrisch, James Davey, Svenja Simon, Tobias Schreck, Daniel Keim, and Jörn Kohlhammer. 2013. Visual Comparison of Orderings and Rankings. In Proc. of EuroVis Workshop on Visual Analytics.",
      "doi": ""
    },
    {
      "text": "Steven Bergner, Michael Sedlmair, Torsten Möller, Sareh Nabi Abdolyousefi, and Ahmed Saad. 2013. ParaGlide: Interactive Parameter Space Partitioning for Computer Simulations. IEEE TVCG 19, 9 (2013), 1499--1512.  ",
      "doi": "10.1109/TVCG.2013.61"
    },
    {
      "text": "Maryam Booshehrian, Torsten Möller, Randall M. Peterman, and Tamara Munzner. 2012. Vismon: Facilitating Analysis of Trade-Offs, Uncertainty, and Sensitivity In Fisheries Management Decision Making. Computer Graphics Forum 31, 3 (2012), 1235--1244.  ",
      "doi": "10.1111/j.1467-8659.2012.03116.x"
    },
    {
      "text": "Jing Cai and Chung Keung Poon. 2010. Path-hop: efficiently indexing large graphs for reachability queries. In Proc. of ACM CIKM. 119--128.  ",
      "doi": "10.1145/1871437.1871457"
    },
    {
      "text": "Giuseppe Carenini and John Loyd. 2004. ValueCharts: analyzing linear models expressing preferences and evaluations. In Proc. of AVI. 150--157.  ",
      "doi": "10.1145/989863.989885"
    },
    {
      "text": "Davide Ceneda, Theresia Gschwandtner, Thorsten May, Silvia Miksch, Hans-Jörg Schulz, Marc Streit, and Christian Tominski. 2017. Characterizing Guidance in Visual Analytics. IEEE TVCG 23, 1 (2017), 111--120.  ",
      "doi": "10.1109/TVCG.2016.2598468"
    },
    {
      "text": "Wei Chen, Fangzhou Guo, and Fei-Yue Wang. 2015. A Survey of Traffic Data Visualization. IEEE TITS 16, 6 (2015), 2970--2984.",
      "doi": ""
    },
    {
      "text": "Yangjun Chen and Yibin Chen. 2008. An Efficient Algorithm for Answering Graph Reachability Queries. In Proc. of IEEE ICDE. 893--902.  ",
      "doi": "10.1109/ICDE.2008.4497498"
    },
    {
      "text": "Peter F. Colwell, Carolyn A. Dehring, and Geoffrey K. Turnbull. 2002. Recreation Demand and Residential Location. Journal of Urban Economics 51, 3 (2002), 418 -- 428.",
      "doi": ""
    },
    {
      "text": "Wenfei Fan, Jianzhong Li, Xin Wang, and Yinghui Wu. 2012. Query preserving graph compression. In Proc. of ACM SIGMOD. 157--168.  ",
      "doi": "10.1145/2213836.2213855"
    },
    {
      "text": "Nivan Ferreira, Jorge Poco, Huy T. Vo, Juliana Freire, and Cláudio T. Silva. 2013. Visual Exploration of Big Spatio-Temporal Urban Data: A Study of New York City Taxi Trips. IEEE TVCG 19, 12 (2013), 2149--2158.  ",
      "doi": "10.1109/TVCG.2013.226"
    },
    {
      "text": "Amy Fontinelle. 2017. Buying A Home: Choosing Your Location. https://goo.gl/8ZKyJc. (2017). {Online; accessed 07-Sept-2017}.",
      "doi": ""
    },
    {
      "text": "Yanjie Fu, Yong Ge, Yu Zheng, Zijun Yao, Yanchi Liu, Hui Xiong, and Jing Yuan. 2014. Sparse Real Estate Ranking with Online User Reviews and Offline Moving Behaviors. In Proc. of IEEE ICDM. 120--129.  ",
      "doi": "10.1109/ICDM.2014.18"
    },
    {
      "text": "Samuel Gratzl, Alexander Lex, Nils Gehlenborg, Hanspeter Pfister, and Marc Streit. 2013. LineUp: Visual Analysis of Multi-Attribute Rankings. IEEE TVCG 19, 12 (2013), 2277--2286.  ",
      "doi": "10.1109/TVCG.2013.173"
    },
    {
      "text": "Xiaoke Huang, Ye Zhao, Chao Ma, Jing Yang, Xinyue Ye, and Chong Zhang. 2016. TrajGraph: A Graph-Based Visual Analytics Approach to Studying Urban Network Centralities Using Taxi Trajectory Data. IEEE TVCG 22, 1 (2016), 160--169.",
      "doi": ""
    },
    {
      "text": "Piotr Jankowski, Natalia Andrienko, and Gennady Andrienko. 2001. Map-centred exploratory approach to multiple criteria spatial decision making. IJGIS 15, 2 (2001), 101--127.",
      "doi": ""
    },
    {
      "text": "John F. Kain. 1962. THE JOURNEY-TO-WORK AS A DETERMINANT OF RESIDENTIAL LOCATION. Regional Science 9, 1 (1962), 137--160.",
      "doi": ""
    },
    {
      "text": "Dmytro Karamshuk, Anastasios Noulas, Salvatore Scellato, Vincenzo Nicosia, and Cecilia Mascolo. 2013. Geo-spotting: Mining Online Location-based Services for Optimal Retail Store Placement. In Proc. of ACM SIGKDD. 793--801.  ",
      "doi": "10.1145/2487575.2487616"
    },
    {
      "text": "Robert Krüger, Dennis Thom, Michael Wörner, Harald Bosch, and Thomas Ertl. 2013. TrajectoryLenses - A Set-based Filtering and Exploration Technique for Long-term Trajectory Data. Computer Graphics Forum 32, 3 (2013), 451--460.  ",
      "doi": "10.1111/cgf.12132"
    },
    {
      "text": "Brian H Y Lee, Paul Waddell, Liming Wang, and Ram M Pendyala. 2010. Reexamining the Influence of Work and Nonwork Accessibility on Residential Location Choices with a Microanalytic Framework. Environment and Planning A 42, 4 (2010), 913--930.",
      "doi": ""
    },
    {
      "text": "Yuhong Li, Jie Bao, Yanhua Li, Yingcai Wu, Zhiguo Gong, and Yu Zheng. 2016. Mining the most influential k-location set from massive trajectories. In Proc. of ACM SIGSPATIAL. 51:1--51:4.  ",
      "doi": "10.1145/2996913.2997009"
    },
    {
      "text": "Yuhong Li, Yu Zheng, Shenggong Ji, Wenjun Wang, Leong Hou U, and Zhiguo Gong. 2015. Location Selection for Ambulance Stations: A Data-driven Approach. In Proc. of ACM SIGSPATIAL. 85:1--85:4.  ",
      "doi": "10.1145/2820783.2820876"
    },
    {
      "text": "Dongyu Liu, Di Weng, Yuhong Li, Jie Bao, Yu Zheng, Huamin Qu, and Yingcai Wu. 2017. SmartAdP: Visual Analytics of Large-scale Taxi Trajectories for Selecting Billboard Locations. IEEE TVCG 23, 1 (2017), 1--10.  ",
      "doi": "10.1109/TVCG.2016.2598432"
    },
    {
      "text": "Yin Lou, Chengyang Zhang, Yu Zheng, Xing Xie, Wei Wang, and Yan Huang. 2009. Map-matching for low-sampling-rate GPS trajectories. In Proc. of ACM SIGSPATIAL. 352--361.  ",
      "doi": "10.1145/1653771.1653820"
    },
    {
      "text": "Dennis Luxen and Christian Vetter. 2011. Real-time routing with OpenStreetMap data. In Proc. of ACM SIGSPATIAL. 513--516.  ",
      "doi": "10.1145/2093973.2094062"
    },
    {
      "text": "Fábio Miranda, Harish Doraiswamy, Marcos Lage, Kai Zhao, Bruno Gonçalves, Luc Wilson, Mondrian Hsieh, and Cláudio T. Silva. 2017. Urban Pulse: Capturing the Rhythm of Cities. IEEE TVCG 23, 1 (2017), 791--800.  ",
      "doi": "10.1109/TVCG.2016.2598585"
    },
    {
      "text": "MongoDB Inc. 2017. MongoDB for GIANT Ideas | MongoDB. https://www.mongodb.com/. (2017). {Online; accessed 07-Sept-2017}.",
      "doi": ""
    },
    {
      "text": "Stephan Pajer, Marc Streit, Thomas Torsney-Weir, Florian Spechtenhauser, Torsten Möller, and Harald Piringer. 2017. WeightLifter: Visual Weight Space Exploration for Multi-Criteria Decision Making. IEEE TVCG 23, 1 (2017), 611--620.  ",
      "doi": "10.1109/TVCG.2016.2598589"
    },
    {
      "text": "Roeland Scheepens, Christophe Hurter, Huub van de Wetering, and Jarke J. van Wijk. 2016. Visualization, Selection, and Analysis of Traffic Flows. IEEE TVCG 22, 1 (2016), 379--388.",
      "doi": ""
    },
    {
      "text": "Jinwook Seo and Ben Shneiderman. 2005. A Rank-by-Feature Framework for Interactive Exploration of Multidimensional Data. Information Visualization 4, 2 (2005), 96--113.  ",
      "doi": "10.1057/palgrave.ivs.9500091"
    },
    {
      "text": "Conglei Shi, Weiwei Cui, Shixia Liu, Panpan Xu, Wei Chen, and Huamin Qu. 2012. RankExplorer: Visualization of Ranking Changes in Large Time Series Data. IEEE TVCG 18, 12 (2012), 2669--2678.  ",
      "doi": "10.1109/TVCG.2012.253"
    },
    {
      "text": "Guodao Sun, Ronghua Liang, Huamin Qu, and Yingcai Wu. 2017. Embedding Spatio-Temporal Information into Maps by Route-Zooming. IEEE TVCG 23, 5 (2017), 1506--1519.  ",
      "doi": "10.1109/TVCG.2016.2535234"
    },
    {
      "text": "Sebastiaan J. van Schaik and Oege de Moor. 2011. A Memory Efficient Reachability Data Structure Through Bit Vector Compression. In Proc. of ACM SIGMOD. 913--924.  ",
      "doi": "10.1145/1989323.1989419"
    },
    {
      "text": "Renê Rodrigues Veloso, Loïc Cerf, Wagner Meira Jr., and Mohammed J. Zaki. 2014. Reachability Queries in Very Large Graphs: A Fast Refined Online Search Approach. In Proc. of ICDT. 511--522.",
      "doi": ""
    },
    {
      "text": "Elizabeth Weintraub. 2017. What Location, Location, Location Means In Real Estate. https://goo.gl/ydJgKU. (2017). {Online; accessed 07-Sept-2017}.",
      "doi": ""
    },
    {
      "text": "Christopher Williamson and Ben Shneiderman. 1992. The Dynamic HomeFinder: Evaluating Dynamic Queries in a Real-Estate Information Exploration System. In Proc. of ACM SIGIR. 338--346.  ",
      "doi": "10.1145/133160.133216"
    },
    {
      "text": "Guojun Wu, Yichen Ding, Yanhua Li, Jie Bao, Yu Zheng, and Jun Luo. 2017. Mining Spatio-Temporal Reachable Regions over Massive Trajectory Data. In Proc. of IEEE ICDE. 1283--1294.",
      "doi": ""
    },
    {
      "text": "H. Wu, Y. Huang, J. Cheng, J. Li, and Y. Ke. 2016. Reachability and time-based path queries in temporal graphs. In Proc. of IEEE ICDE. 145--156.",
      "doi": ""
    },
    {
      "text": "Wenchao Wu, Yixian Zheng, Huamin Qu, Wei Chen, Eduard Gröller, and Lionel M. Ni. 2014. BoundarySeer: Visual analysis of 2D boundary changes. In Proc. of IEEE VAST. 143--152.",
      "doi": ""
    },
    {
      "text": "Jing Yuan, Yu Zheng, Xing Xie, and Guangzhong Sun. 2011. Driving with knowledge from the physical world. In Proc. of ACM SIGKDD. 316--324.  ",
      "doi": "10.1145/2020408.2020462"
    },
    {
      "text": "Jing Yuan, Yu Zheng, Chengyang Zhang, Wenlei Xie, Xing Xie, Guangzhong Sun, and Yan Huang. 2010. T-drive: driving directions based on taxi trajectories. In Proc. of ACM SIGSPATIAL. 99--108.  ",
      "doi": "10.1145/1869790.1869807"
    },
    {
      "text": "Wei Zeng, Chi-Wing Fu, Stefan Müller Arisona, Alexander Erath, and Huamin Qu. 2014. Visualizing Mobility of Public Transportation System. IEEE TVCG 20, 12 (2014), 1833--1842.",
      "doi": ""
    },
    {
      "text": "Wei Zeng, Phillip Chi-Wing Fu, Stefan Müller Arisona, Alexander Erath, and Huamin Qu. 2016. Visualizing Waypoints-Constrained Origin-Destination Patterns for Massive Transportation Data. Computer Graphics Forum 35, 8 (2016), 95--107.",
      "doi": ""
    },
    {
      "text": "Jiawan Zhang, E. Yanli, Jing Ma, Yahui Zhao, Binghan Xu, Liting Sun, Jinyan Chen, and Xiaoru Yuan. 2014. Visual Analysis of Public Utility Service Problems in a Metropolis. IEEE TVCG 20, 12 (2014), 1843--1852.",
      "doi": ""
    },
    {
      "text": "Yu Zheng, Licia Capra, Ouri Wolfson, and Hai Yang. 2014. Urban Computing: Concepts, Methodologies, and Applications. ACM TIST 5, 3 (2014), 38.  ",
      "doi": "10.1145/2629592"
    },
    {
      "text": "Yixian Zheng, Wenchao Wu, Yuanzhe Chen, Huamin Qu, and Lionel M. Ni. 2016. Visual Analytics in Urban Computing: An Overview. IEEE TBD 2, 3 (2016), 276--296.",
      "doi": ""
    },
    {
      "text": "Andy Diwen Zhu, Wenqing Lin, Sibo Wang, and Xiaokui Xiao. 2014. Reachability Queries on Large Dynamic Graphs: A Total Order Approach. In Proc. of ACM SIGMOD. 1323--1334.  ",
      "doi": "10.1145/2588555.2612181"
    },
    {
      "text": "Zillow Group Inc. 2017. Zillow: Real Estate, Apartments, Mortgages & Home Values. http://www.zillow.com. (2017). Online; accessed 07-Sept-2017.",
      "doi": ""
    }
  ]
}