{
  "doi": "10.1145/3173574.3173994",
  "title": "Supporting the Complex Social Lives of New Parents",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "One of the many challenges of becoming a parent is the shift in one's social life. As HCI researchers have begun to investigate the intersection of sociotechnical system design and parenthood, they have also sought to understand how parents' social lives can be best supported. We build on these strands of research through a qualitative study with new parents regarding the role of digital technologies in their social lives as they transition to parenthood. We demonstrate how sociotechnical systems are entangled in the ways new parents manage their relationships, build (or resist building) new friendships and ad hoc support systems, and navigate the vulnerabilities of parenthood. We discuss how systems designed for new parents can better support the vulnerabilities they internalize, the diverse friendships they desire, and the logistical challenges they experience. We conclude with recommendations for future design and research in this area.",
  "authors": [
    {
      "name": "Austin L. Toombs",
      "institution": "Purdue University & Newcastle University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597484",
      "orcid": "missing"
    },
    {
      "name": "Kellie Morrissey",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83059070757",
      "orcid": "0000-0002-6962-6920"
    },
    {
      "name": "Emma Simpson",
      "institution": "Newcastle University, Newcastle-upon-Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659152832",
      "orcid": "missing"
    },
    {
      "name": "Colin M. Gray",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/do/10.1145/contrib-87959081657/rel-imgonly/gray_headshot.jpg",
      "acmid": "87959081657",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    },
    {
      "name": "Madeline Balaam",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448600301",
      "orcid": "0000-0001-9472-3805"
    }
  ],
  "references": [
    {
      "text": "Teresa Almeida, Gavin Wood, Dean Saraf, and Madeline Balaam. 2015. Labella. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, New York, NY, USA, 310--311.  ",
      "doi": "10.1145/2783446.2783626"
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Understanding and Supporting Fathers and Fatherhood on Social Media Sites. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1905--1914.  ",
      "doi": "10.1145/2702123.2702205"
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2016. \"Thanks for your interest in our Facebook group, but it's only for dads\": Social Roles of Stay-at-Home Dads. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1363--1375.  ",
      "doi": "10.1145/2818048.2819927"
    },
    {
      "text": "Tawfiq Ammari, Sarita Schoenebeck, and Silvia Lindtner. 2017. The Crafting of DIY Fatherhood. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1109--1122.  ",
      "doi": "10.1145/2998181.2998270"
    },
    {
      "text": "Sinan E. Arkonac, Joe Frazer, Ryan John Horgan, Anna Kracewicz, and Latefa Al-Naimi. 2017. \"ParentCircle: Helping Single Parents Build a Support Network.\" In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. CHI EA '17. ACM.  ",
      "doi": "10.1145/3027063.3049271"
    },
    {
      "text": "AXA PPP healthcare. 2015. Overcoming feelings of isolation as a new parent: Online survey of 3,000 UK mums conducted during January 2015 by Netmums. Retrieved on September 18, 2017 from: https://www.axappphealthcare.co.uk/healthworries/pregnancy--childcare/article/overcomingfeelings-of-isolation-as-a-new-parent/",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1709--1718.  ",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Madeline Balaam, Judy Robertson, Geraldine Fitzpatrick, Rebecca Say, Gillian Hayes, Melissa Mazmanian, and Belinda Parmar. 2013. Motherhood and HCI. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 3215--3218.  ",
      "doi": "10.1145/2468356.2479650"
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure during Shifting Social Movements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 610622.  ",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Brené Brown. Daring greatly: How the courage to be vulnerable transforms the way we live, love, parent, and lead. Gotham, 2012.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. Basics of qualitative research. Sage, 2014.",
      "doi": ""
    },
    {
      "text": "K. K. Bost, M. J. Cox, M. R. Burchinal, and C. Payne. 2002. Structural and supportive changes in couples' family and friendship networks across the transition to parenthood. Journal of Marriage and Family, 64(2), 517--531.",
      "doi": ""
    },
    {
      "text": "Barbara Dennis, publishing as Barbara Korth. 2003. A Critical Reconstruction of Care-in-Action. The Qualitative Report 8, 3.",
      "doi": ""
    },
    {
      "text": "Catherine D'Ignazio, Alexis Hope, Becky Michelson, Robyn Churchill, and Ethan Zuckerman. 2016. A Feminist HCI Approach to Designing Postpartum Technologies: \"When I first saw a breast pump I was wondering if it was a joke\". In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 26122622.  ",
      "doi": "10.1145/2858036.2858460"
    },
    {
      "text": "Andrew Dow, Rob Comber, and John Vines. 2018. Between Grassroots and the Hierarchy: Lessons Learned from the Design of a Public Services Directory. Proceedings of the 36th Annual ACM Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3173574.3174016"
    },
    {
      "text": "M. Edhborg, A. Matthiesen, W. Lundh, & A. Widström. 2005. Some early indicators for depressive symptoms and bonding 2 months postpartum -- a study of new mothers and fathers. Archives of Women's Mental Health, 8(4), 221--231.",
      "doi": ""
    },
    {
      "text": "English indices of deprivation 2015. 2015. Retrieved on September 18, 2017 from: https://www.gov.uk/government/statistics/englishindices-of-deprivation-2015",
      "doi": ""
    },
    {
      "text": "Lorna Gibson and Vicki L. Hanson. 2013. Digital motherhood: how does technology help new mothers?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 313--322.  ",
      "doi": "10.1145/2470654.2470700"
    },
    {
      "text": "Grace Giorgio. 2013. Chapter Twenty-Two: Trust. Listening. Reflection. Voice: Healing Traumas through Qualitative Research. Counterpoints 354: 459--74. http://www.jstor.org/stable/42981182",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes, Donald J. Patterson, Mohan Singh, Dana Gravem, Julia Rich, and Dan Cooper. 2011. Supporting the transition from hospital to home for premature infants using integrated mobile computing and sensor support. Personal Ubiquitous Computing. 15, 8. 871--885.  ",
      "doi": "10.1007/s00779-011-0402-4"
    },
    {
      "text": "Mary Hui, Christine Ly, and Carman Neustaedter. 2012. MammiBelli: sharing baby activity levels between expectant mothers and their intimate social groups. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1649--1654.  ",
      "doi": "10.1145/2212776.2223687"
    },
    {
      "text": "Patricia Leahy-Warren, Geraldine McCarthy, and Paul Corcoran. 2012. First-time Mothers: Social Support, Maternal Parental Self-efficacy and Postnatal Depression. Journal of clinical nursing 21, no. 3--4: 388--397.",
      "doi": ""
    },
    {
      "text": "Lee, Katharine, Konstantina Vasileiou, and Julie Barnett. 2017. \"'Lonely within the mother': An exploratory study of first-time mothers' experiences of loneliness.\" Journal of health psychology: 1359105317723451.",
      "doi": ""
    },
    {
      "text": "Yvonna S. Lincoln and Egon G. Guba. 1985. Naturalistic inquiry. Sage Publications, Beverly Hills, CA.",
      "doi": ""
    },
    {
      "text": "Kiel Long, Lyndsey L. Bakewell, Roisin C. McNaney, Konstantina Vasileiou, Mark Atkinson, Manuela Barreto, Julie Barnett, Michael Wilson, Shaun Lawson, and John Vines. 2017. Connecting Those That Care: Designing for Transitioning, Talking, Belonging and Escaping. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1339--1351.  ",
      "doi": "10.1145/3025453.3025715"
    },
    {
      "text": "E. Manzini and R. Coad. 2015. Design, when everybody designs: An introduction to design for social innovation. MIT press.",
      "doi": ""
    },
    {
      "text": "B. T. McDaniel, S. M. Coyne, and E. K. Holmes. 2012. New Mothers and Media Use: Associations Between Blogging, Social Networking, and Maternal WellBeing. Maternal and Child Health Journal, 16(7), 1509--17.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris. 2014. Social networking site use by mothers of young children. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 1272--1282.  ",
      "doi": "10.1145/2531602.2531603"
    },
    {
      "text": "Kellie Morrissey, Andrew Garbett, Peter Wright, Patrick Olivier, Edward Ian Jenkins, and Katie Brittain. 2017. Care and Connect: Exploring DementiaFriendliness Through an Online Community Commissioning Platform. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 21632174.  ",
      "doi": "10.1145/3025453.3025732"
    },
    {
      "text": "Mush website. https://www.letsmush.com Accessed: September 18, 2017.",
      "doi": ""
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It's not that I don't have problems, I'm just not putting them on Facebook: challenges and opportunities in using online social networks for health. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11). ACM, New York, NY, USA, 341--350.  ",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "M. L. Nolan, V. Mason, S. Snow, W. Messenger, J. Catling, and P. Upton. 2012. Making Friends at Antenatal Classes: A Qualitative Exploration of Friendship Across the Transition to Motherhood. The Journal of Perinatal Education, 21(3), 178--185.",
      "doi": ""
    },
    {
      "text": "Peanut website. https://www.peanut-app.io Accessed: September 18, 2017.",
      "doi": ""
    },
    {
      "text": "Rahman, R. 2015. Dementia-Friendly Communities and the Big Society. Accessed May 16th: http://dementiasoc.org.uk/other/dementia-friendlycommunities-and-the-big-society-my-pledge-fornhschangeday/",
      "doi": ""
    },
    {
      "text": "Kantar Republic. 2016. Trapped in a bubble: An investigation into triggers for loneliness in the UK. Retrieved from: http://www.redcross.org.uk/~/media/BritishRedCross/ Documents/What%20we%20do/UK%20services/Co_O p_Trapped_in_a_bubble_report_AW.pdf",
      "doi": ""
    },
    {
      "text": "A. Sarkadi and S. Bremberg. 2004. Socially unbiased parenting support on the Internet: a cross-sectional study of users of a large Swedish parenting website. Child: Care, Health and Development 31, 1, 43--52.",
      "doi": ""
    },
    {
      "text": "Sarita Yardi Schoenebeck. 2013. The Secret Life of Online Moms: Anonymity and Disinhibition on YouBeMom.com. Proceedings of the International AAAI Conference on Weblogs and Social Media (ICWSM 2013), 555--562. https://www.aaai.org/ocs/index.php/ICWSM/ICWSM1 3/paper/viewFile/5973/6395",
      "doi": ""
    },
    {
      "text": "Emma Simpson, Andrew Garbett, Rob Comber, and Madeline Balaam. 2016. Factors Important for Women Who Breastfeed in Public: A Content Analysis of Review Data From FeedFinder. BMJ open 6, no. 10, e011762.",
      "doi": ""
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 629--638.  ",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Austin L. Toombs, Shad Gross, Shaowen Bardzell, and Jeffrey Bardzell. 2017. From Empathy to Care: A Feminist Care Ethics Perspective on Long-Term Researcher--Participant Relations. Interacting with Computers, Volume 29, Issue 1. 45--57.",
      "doi": ""
    },
    {
      "text": "Joan C. Tronto. 1993. Moral Boundaries: A Political Argument for an Ethic of Care. Routledge, New York, New York.",
      "doi": ""
    },
    {
      "text": "Diego Trujillo-Pisanty, Abigail Durrant, Sarah Martindale, Stuart James, and John Collomosse. 2014. Admixed portrait: reflections on being online as a new parent. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 503--512.  ",
      "doi": "10.1145/2598510.2602962"
    },
    {
      "text": "Janet Ubido and Alex Scott-Samuel. 2014. Loneliness (Rapid Evidence Review Series). Liverpool Public Health Observatory. Retrieved from: https://www.champspublichealth.com/sites/default/files /loneliness%20final.pdf",
      "doi": ""
    },
    {
      "text": "John Vines, Peter C. Wright, David Silver, Maggie Winchcombe, and Patrick Olivier. 2015. Authenticity, Relatability and Collaborative Approaches to Sharing Knowledge about Assistive Living Technology. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 82--94.  ",
      "doi": "10.1145/2675133.2675222"
    },
    {
      "text": "Ward funding, Newcastle upon Tyne Wards. Last accessed 29 December 2017. https://www.newcastle.gov.uk/communities-andneighbourhoods/grants-and-funding/ward-committeefunding",
      "doi": ""
    },
    {
      "text": "R. Williams. 2015. Faith in the Public Square. London: Bloomsbury Continuum.",
      "doi": ""
    }
  ]
}