{
  "doi": "10.1145/3173574.3173945",
  "title": "Everything We Do, Everything We Press: Data-Driven Remote Performance Management in a Mobile Workplace",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper examines how data-driven performance monitoring technologies affect the work of telecommunications field engineers. As a mobile workforce, this occupational group rely on an array of smartphone applications to plan, manage and report on their jobs, and to liaise remotely with managers and colleagues. These technologies intend to help field engineers be more productive and have greater control over their work; however they also gather data related to the quantity and effectiveness of their labor. We conducted a qualitative study examining engineers' experiences of these systems. Our findings suggest they simultaneously enhance worker autonomy, support co-ordination with and monitoring of colleagues, but promote anxieties around productivity and the interpretation of data by management. We discuss the implications of data-driven performance management technologies on worker agency, and examine the consequences of such systems in an era of quantified workplaces.",
  "authors": [
    {
      "name": "Lyndsey L. Bakewell",
      "institution": "Loughborough University, Loughborough, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160506",
      "orcid": "missing"
    },
    {
      "name": "Konstantina Vasileiou",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162716",
      "orcid": "missing"
    },
    {
      "name": "Kiel S. Long",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659221353",
      "orcid": "missing"
    },
    {
      "name": "Mark Atkinson",
      "institution": "University of Exeter, Exeter, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161501",
      "orcid": "missing"
    },
    {
      "name": "Helen Rice",
      "institution": "Independent Researcher, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261746",
      "orcid": "missing"
    },
    {
      "name": "Manuela Barreto",
      "institution": "University of Exeter, Exeter, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161609",
      "orcid": "missing"
    },
    {
      "name": "Julie Barnett",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86158781057",
      "orcid": "missing"
    },
    {
      "name": "Michael Wilson",
      "institution": "Loughborough University, Loughborough, United Kingdom",
      "img": "/do/10.1145/contrib-99659161774/rel-imgonly/michaelwilson.jpg",
      "acmid": "99659161774",
      "orcid": "missing"
    },
    {
      "name": "Shaun Lawson",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "Rebecca Abraham. 1998. Emotional dissonance in organizations: Antecedents, consequences, and moderators. Genet Soc Gen Psychol Monogr 124, 2: 229--246.",
      "doi": ""
    },
    {
      "text": "Pav Akhtar and Phoebe Moore. 2016. The psychosocial impacts of technological change in contemporary workplaces, and trade union responses. International Journal of Labour Research 8, 1/2: 101--131.",
      "doi": ""
    },
    {
      "text": "Kristina Andersen. 2013. Making magic machines. In Proceedings of 10th European Academy of Design Conference-Crafting the Future.",
      "doi": ""
    },
    {
      "text": "Mark Andrejevic. 2002. The work of watching one another: Lateral surveillance, risk, and governance. Surveill Soc 2, 4: 479--497.",
      "doi": ""
    },
    {
      "text": "Kirstie Ball. 2010. Workplace surveillance: An overview. Labor Hist 51, 1: 87--106.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer. 2015. Usees. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3295--3298.  ",
      "doi": "10.1145/2702123.2702147"
    },
    {
      "text": "Eric P.S. Baumer, Morgan G. Ames, Jenna Burrell, Jed R. Brubaker, and Paul Dourish. 2015. Why study technology non-use?. First Monday 20, 11.",
      "doi": ""
    },
    {
      "text": "Ethan S. Bernstein. 2012. The transparency paradox: A role for privacy in organizational learning and operational control. Adm Sci Q 57, 2: 181--216.",
      "doi": ""
    },
    {
      "text": "Jacob T. Biehl, Thea Turner, William van Melle, and Andreas Girgensohn. 2011. myUnity: A new platform to support communication in the modern workplace. In Proceedings of the 19th ACM international conference on Multimedia (MM '11), 801--802.  ",
      "doi": "10.1145/2072298.2072465"
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-solutionist strategies: Seriously silly design fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4968--4978.  ",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Kristina A. Bourne and Pamela J. Forman. 2014. Living in a culture of overwork: An ethnographic study of flexibility. J Manag Inq 23, 1: 68--79.",
      "doi": ""
    },
    {
      "text": "John Bowers, Graham Button, and Wes Sharrock. 1995. Workflow from within and without: Technology and cooperative work on the print industry shopfloor. In Proceedings of the Fourth European Conference on Computer-Supported Cooperative Work (ECSCW '95), 51--66. ISBN:0--7923--3697--6 ",
      "doi": "10.5555/1241958.1241962"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qual Res Psychol 3, 2: 77--101.",
      "doi": ""
    },
    {
      "text": "Jacqueline Brodie and Mark Perry. 2001. Designing for mobility, collaboration and information use by bluecollar workers. SIGGROUP Bull. 22, 3: 22--27.  ",
      "doi": "10.1145/567352.567356"
    },
    {
      "text": "Graham Button and Wes Sharrock. 1997. The production of order and the order of production: Possibilities for distributed organisations, work and technology in the print industry. In Proceedings of the Fifth European Conference on Computer Supported Cooperative Work (ECSCW '97), 1--16. ISBN:0--7923--4638--6 ",
      "doi": "10.5555/1241980.1241981"
    },
    {
      "text": "Chris Caplice and Yossi Sheffi. 1995. A review and evaluation of logistics performance measurement systems. The International Journal of Logistics Management, 6, 1: 61--74.",
      "doi": ""
    },
    {
      "text": "Goutam Challagalla, Tasadduq Shervani, and George Huber. 2000. Supervisory orientations and salesperson work outcomes: The moderating effect of salesperson location. Journal of Personal Selling & Sales Management 20, 3: 161--171.",
      "doi": ""
    },
    {
      "text": "Adrian K. Clear, Sam Mitchell Finnigan, Patrick Olivier, and Rob Comber. 2017. \"I'd want to burn the data or at least nobble the numbers\": Towards datamediated building management for comfort and energy use. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 2448--2461.  ",
      "doi": "10.1145/2998181.2998188"
    },
    {
      "text": "Joanne O. Crawford, Laura MacCalman, and Craig Jackson. 2009. The health and wellbeing of remote and mobile workers: Final report. Research Report 60300911. Retrieved from: http://www.bohrf.org.uk/downloads/224E05_Final_Re port-December_2009.pdf",
      "doi": ""
    },
    {
      "text": "Joanne O. Crawford, Laura MacCalman, and Craig Jackson. 2011. The health and well-being of remote and mobile workers. Occup Med 61, 6: 385--394.",
      "doi": ""
    },
    {
      "text": "Kurt T. Dirks and Donald L. Ferrin. 2002. Trust in leadership: Meta-analytic findings and implications for research and practice. J Appl Psychol 87, 4: 611--628.",
      "doi": ""
    },
    {
      "text": "Katia Dupret. 2017. Working around technologiesinvisible professionalism?. New Technology, Work and Employment 32, 2: 174--187.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Sebastian Mellor, Patrick Olivier, Pete Wheldon, David Kirk, and Rob Comber. 2016. ResViz: Politics and design issues in visualizing academic metrics. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5015--5027.  ",
      "doi": "10.1145/2858036.2858181"
    },
    {
      "text": "ExakTime. https://www.exaktime.com/time-clockapp/gps-tracking/",
      "doi": ""
    },
    {
      "text": "Ben N. Fairweather. 1999. Surveillance in employment: The case of teleworking. J Bus Ethics 22, 1: 39--49.",
      "doi": ""
    },
    {
      "text": "Henri Fayol. 1949. General and Industrial Management. Pitman and Sons.",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 1995. Discipline and punish: The birth of the prison. Vintage Books.",
      "doi": ""
    },
    {
      "text": "Thomas Fritz, Elaine M. Huang, Gail C. Murphy, and Thomas Zimmermann. 2014. Persuasive technology in the real world: A study of long-term use of activity sensing devices for fitness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 487--496.  ",
      "doi": "10.1145/2556288.2557383"
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, and Florian Güldenpfennig. 2015. Why and what did we throw out?: Probing on Reflection through the Food Waste Diary. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1105--1114.  ",
      "doi": "10.1145/2702123.2702284"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural probes. Interactions 6, 1: 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Nitesh Goyal and Susan R. Fussell. 2017. Intelligent interruption management using electro dermal activity based physiological sensor for collaborative sensemaking. In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 1, 3: Article 52.  ",
      "doi": "10.1145/3130917"
    },
    {
      "text": "Nitesh Goyal, Gilly Leshed, Dan Cosley and Susan R. Fussell. 2014. Effects of implicit sharing in collaborative analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 129--138.  ",
      "doi": "10.1145/2556288.2557229"
    },
    {
      "text": "Alicia Grandey. 2000. Emotion regulation in the workplace: A new way to conceptualize emotional labor. J Occup Health Psychol 5, 1: 95--110.",
      "doi": ""
    },
    {
      "text": "Samantha J. Holland, Kaila M. Simpson, Reeshad S. Dalal, and Ronald P. Vega. 2016. I can't steal from a coworker if I work from home: Conceptual and measurement-related issues associated with studying counterproductive work behavior in a telework setting. Human Performance 29, 3: 172--190.",
      "doi": ""
    },
    {
      "text": "Robert A. Karasek. 1979. Job demands, job decision latitude, and mental strain: Implications for job redesign. Adm Sci Q 24: 285--308.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A. Kientz. 2012. Lullaby: A capture & access system for understanding the sleep environment. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12), 226--234.  ",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Martin Kenney and John Zysman. 2016. The rise of the platform economy. Issues in Science & Technology, 61--69.",
      "doi": ""
    },
    {
      "text": "Steinar Kristoffersen and Fredrik Ljungberg. 1999. \"Making place\" to make IT work: Empirical explorations of HCI for mobile CSCW. In Proceedings of the International ACM SIGGROUP Conference on Supporting Group Work (GROUP '99), 276--285.  ",
      "doi": "10.1145/320297.320330"
    },
    {
      "text": "Labor Sync. http://www.laborsync.com/",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with machines: The Impact of algorithmic and data-driven management on human workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1603--1612.  ",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Samantha Lee and Brian Kleiner. 2003. Electronic surveillance in the workplace. Management Research News 26, 2/3/4: 72--81.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Deborah Lupton. 2014. Self-tracking cultures: Towards a sociology of personal informatics. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design (OzCHI '14), 77--86.  ",
      "doi": "10.1145/2686612.2686623"
    },
    {
      "text": "Deborah Lupton. 2016. The diverse domains of quantified selves: Self-tracking modes and dataveillance. Econ Soc 45, 1: 101--122.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2016. The quantified self. John Wiley & Sons. ",
      "doi": "10.5555/3052450"
    },
    {
      "text": "Robert MacKenzie, Abigail Marks, and Kate Morgan. 2017. Technology, affordances and occupational identity amongst older telecommunications engineers: From living machines to black-boxes. Sociology 51, 4: 732--748.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2015. Focused, aroused, but so distractible: A temporal perspective on multitasking and communications. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 903--916.  ",
      "doi": "10.1145/2675133.2675221"
    },
    {
      "text": "Afra Mashhadi, Fahim Kawsar, Akhil Mathur, Casey Dugan, and N. Sadat Shami. 2016. Let's talk about the quantified workplace. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (CSCW '16 Companion), 522--528.  ",
      "doi": "10.1145/2818052.2855514"
    },
    {
      "text": "Akhil Mathur, Marc Van den Broeck, Geert Vanderhulst, Afra Mashhadi, and Fahim Kawsar. 2015. Quantified workplace: Opportunities and challenges. In Proceedings of the 2nd workshop on Workshop on Physical Analytics (WPA '15), 37--41.  ",
      "doi": "10.1145/2753497.2753500"
    },
    {
      "text": "Laurel McNall and Jeffrey M. Stanton. 2011. Private eyes are watching you: Reactions to location sensing technologies. J Bus Psychol 26, 3: 299--309.",
      "doi": ""
    },
    {
      "text": "Mareike Möhlmann and Lior Zalmanson. 2017. Hands on the wheel: Navigating algorithmic management and Uber drivers' autonomy. In Proceedings of the 38th International Conference on Information Systems (ICIS 2017). December 10--13, Seoul, South Korea.",
      "doi": ""
    },
    {
      "text": "Phoebe Moore and Andrew Robinson. 2016. The quantified self: What counts in the neoliberal workplace. New Media Soc 18, 11: 2774--2792.",
      "doi": ""
    },
    {
      "text": "Phoebe Moore. 2018. The quantified self in precarity: Work, technology and what counts. Routledge.",
      "doi": ""
    },
    {
      "text": "Andrew J. Morris and Daniel C. Feldman. 2010. The dimensions, antecedents, and consequences of emotional labor. Acad Manag Rev 21, 4: 986--1010. DOI: http://www.jstor.org/stable/259161",
      "doi": ""
    },
    {
      "text": "Jay Prakash Mulki, William B. Locander, Greg W. Marshall, Eric G. Harris, and James Hensel. 2008. Workplace isolation, salesperson commitment, and job performance. Journal of Personal Selling & Sales Management 28, 1: 67--78.",
      "doi": ""
    },
    {
      "text": "Tadashi Okoshi, Julian Ramos, Hiroki Nozaki, Jin Nakazawa, Anind K. Dey and Hideyuki Tokuda. 2015. Reducing users' perceived mental effort due to interruptive notifications in multi-device mobile environments. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 475--486.  ",
      "doi": "10.1145/2750858.2807517"
    },
    {
      "text": "Julian Orr. 1996. Talking about machines: An ethnography of a modern job. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Sharoda A. Paul and Joe W. Bolinger. 2015. Ask an Expert: Mobile workspaces for collaborative troubleshooting. In 48th Hawaii International Conference on System Sciences (HICSS '15), 442--451.  ",
      "doi": "10.1109/HICSS.2015.60"
    },
    {
      "text": "Jun-jie Peng. 2008. A survey of location based service for Galileo system. In Proceedings of International Symposium on Computer Science and Computational Technology (ISCSCT '08), 737--741.  ",
      "doi": "10.1109/ISCSCT.2008.33"
    },
    {
      "text": "Elpida Prasopoulou, Athanasia Pouloudi, and Niki Panteli. 2006. Enacting new temporal boundaries: The role of mobile phones. Eur J Inf Syst 15, 3: 277--284.",
      "doi": ""
    },
    {
      "text": "Gary W. Pritchard, John Vines, Pam Briggs, Lisa Thomas, and Patrick Olivier. 2014. Digitally driven: How location based services impact the work practices of London bus drivers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3617--3626.  ",
      "doi": "10.1145/2556288.2557156"
    },
    {
      "text": "Gary W. Pritchard, Pam Briggs, John Vines, and Patrick Olivier. 2015. How to drive a London bus: Measuring performance in a mobile and remote workplace. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1885--1894.  ",
      "doi": "10.1145/2702123.2702307"
    },
    {
      "text": "Aare Puussaar, Adrian K. Clear, and Peter Wright. 2017. Enhancing personal informatics through social sensemaking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 6936--6942.  ",
      "doi": "10.1145/3025453.3025804"
    },
    {
      "text": "Gudbjörg Linda Rafnsdóttir and Margrét Lilja Gudmundsdottir. 2011. EPM technology and the psychosocial work environment. New Technology, Work and Employment 26, 3: 210--221.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the 32nd annual ACM conference on Human Factors in Computing Systems (CHI '14), 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Kjeld Schmidt and Liam Bannon. 1992. Taking CSCW seriously: Supporting articulation work. Comput Support Coop Work 1, 1: 7--40.",
      "doi": ""
    },
    {
      "text": "Benjamin Schneider and David E. Bowen. 1985. Employee and customer perceptions of service in banks: Replication and extension. J. Appl. Psycho 70, 3: 423--433.",
      "doi": ""
    },
    {
      "text": "Abigail Sellen, Rachel Eardley, Shahram Izadi, and Richard Harper. 2006. The whereabouts clock: Early testing of a situated awareness device. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06), 1307--1312.  ",
      "doi": "10.1145/1125451.1125694"
    },
    {
      "text": "Johannes Siegrist. 1996. Adverse health effects of high-effort/low-reward conditions. J Occup Health Psychol 1, 1: 27--41.",
      "doi": ""
    },
    {
      "text": "Baris Şimşek, Fatma Pakdil, Berna Dengiz, and Murat Caner Testik. 2013. Driver performance appraisal using GPS terminal measurements: A conceptual framework. Transportation Research Part C: Emerging Technologies 26: 49--60.",
      "doi": ""
    },
    {
      "text": "M. J. Smith, Pascale Carayon, Katherine J. Sanders, S. Y. Lim, and David LeGrande. 1992. Employee stress and health complaints in jobs with and without electronic performance monitoring. Appl Ergon 23, 1: 17--27.",
      "doi": ""
    },
    {
      "text": "Rannie Teodoro, Pinar Ozturk, Mor Naaman, Winter Mason, and Janne Lindqvist. 2014. The motivations and experiences of the on-demand mobile workforce. In Proceedings of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing (CSCW'14), 236--247.  ",
      "doi": "10.1145/2531602.2531680"
    },
    {
      "text": "Anja Thieme, Rob Comber, Julia Miebach, Jack Weeden, Nicole Kraemer, Shaun Lawson, and Patrick Olivier. 2012. \"We've bin watching you\": Designing for reflection and social persuasion to promote sustainable lifestyles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2337--2346.  ",
      "doi": "10.1145/2207676.2208394"
    },
    {
      "text": "Timesheet Mobile. https://www.timesheetmobile.com/",
      "doi": ""
    },
    {
      "text": "Ian Towers, Linda Duxbury, Christopher Higgins, and John Thomas. 2006. Time thieves and space invaders: Technology, work and the organization. Journal of Organizational Change Management 19, 5: 593--618.",
      "doi": ""
    },
    {
      "text": "John Vines, Mark Blythe, Stephen Lindsay, Paul Dunphy, Andrew Monk, and Patrick Olivier. 2012. Questionable concepts: critique as resource for designing with eighty somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1169--1178.  ",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "H. James Wilson. 2013. Wearables in the workplace. Harvard Business Review, September 2013, https://hbr.org/2013/09/wearables-in-the-workplace",
      "doi": ""
    },
    {
      "text": "Tao Zhou. 2011. The impact of privacy concern on user adoption of location-based services. Ind Manage Data Syst 11, 2: 212--226.",
      "doi": ""
    },
    {
      "text": "David Zweig and Jane Webster. 2002. Where is the line between benign and invasive? An examination of psychological barriers to the acceptance of awareness monitoring systems. J Organ Behav 23, 5: 605--633.",
      "doi": ""
    }
  ]
}