{
  "doi": "10.1145/3173574.3173831",
  "title": "Investigating How Online Help and Learning Resources Support Children's Use of 3D Design Software",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "3D design software is increasingly available to children through libraries, maker spaces, and for free on the web. This unprecedented availability has the potential to unleash children's creativity in cutting edge domains, but is limited by the steep learning curve of the software. Unfortunately, there is little past work studying the breakdowns faced by children in this domain-most past work has focused on adults in professional settings. In this paper, we present a study of online learning resources and help-seeking strategies available to children starting out with 3D design software. We find that children face a range of challenges when trying to learn 3D design independently-tutorials present instructions at a granularity that leads to overlooked and incorrectly-performed actions, and online help-seeking is largely ineffective due to challenges with query formulation and evaluating found information. Based on our findings, we recommend design directions for next-generation help and learning systems tailored to children.",
  "authors": [
    {
      "name": "Nathaniel Hudson",
      "institution": "Autodesk & Ross Video, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020519",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Lafreniere",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363599874",
      "orcid": "missing"
    },
    {
      "name": "Parmit K. Chilana",
      "institution": "Simon Fraser University, Burnaby, BC, Canada",
      "img": "/do/10.1145/contrib-81416609224/rel-imgonly/parmit2015linkedin.jpg",
      "acmid": "81416609224",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, PQ, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    }
  ],
  "references": [
    {
      "text": "Houman Alborzi, Allison Druin, Jaime Montemayor, Michele Platner, Jessica Porteous, Lisa Sherman, Angela Boltman, Gustav Taxén, Jack Best, Joe Hammer, Alex Kruskal, Abby Lal, Thomas Plaisant Schwenn, Lauren Sumida, Rebecca Wagner, and Jim Hendler. 2000. Designing StoryRooms: Interactive Storytelling Spaces for Children. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '00), 95--104.  ",
      "doi": "10.1145/347642.347673"
    },
    {
      "text": "Vincent Aleven, Bruce Mclaren, Ido Roll, and Kenneth Koedinger. 2006. Toward Meta-cognitive Tutoring: A Model of Help Seeking with a Cognitive Tutor. Int. J. Artif. Intell. Ed. 16, 2: 101--128. ",
      "doi": "10.5555/1435344.1435346"
    },
    {
      "text": "Vincent Aleven, Elmar Stahl, Silke Schworm, Frank Fischer, and Raven Wallace. 2003. Help Seeking and Help Design in Interactive Learning Environments. Review of Educational Research 73, 3: 277--320.",
      "doi": ""
    },
    {
      "text": "Autodesk. Tinkercad | Create 3D digital designs with online CAD. Tinkercad. Retrieved July 28, 2017 from https://www.tinkercad.com/",
      "doi": ""
    },
    {
      "text": "Rob Barrett, Eser Kandogan, Paul P. Maglio, Eben M. Haber, Leila A. Takayama, and Madhu Prabaker. 2004. Field studies of computer system administrators: analysis of system management tools and practices. In Proceedings of the 2004 ACM conference on Computer supported cooperative work, 388--395.  ",
      "doi": "10.1145/1031607.1031672"
    },
    {
      "text": "Kathleen Stassen Berger. 2007. The Developing Person Through the Life Span. Worth Publishers, New York.",
      "doi": ""
    },
    {
      "text": "Dania Bilal. 2000. Children's use of the Yahooligans! Web search engine: I. Cognitive, physical, and affective behaviors on fact-based search tasks. Journal of the American Society for Information Science 51, 7: 646--665.  ",
      "doi": "10.5555/369380.369395"
    },
    {
      "text": "Paulo Blikstein. 2013. Digital fabrication and 'making' in education: The democratization of invention. FabLabs: Of machines, makers and inventors: 1--21.",
      "doi": ""
    },
    {
      "text": "Joel Brandt, Philip J. Guo, Joel Lewenstein, Mira Dontcheva, and Scott R. Klemmer. 2009. Two studies of opportunistic programming: interleaving web foraging, learning, and writing code. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1589--1598.  ",
      "doi": "10.1145/1518701.1518944"
    },
    {
      "text": "Ann L. Brown, John D. Bransford, Roberta A. Ferrara, and Joseph C. Campione. 1983. Learning, remembering, and understanding. In Handbook of Child Psychology, P. Mussen (ed.). Wiley.",
      "doi": ""
    },
    {
      "text": "Amy Bruckman, Alisa Bandlow, and Andrea Forte. 2002. HCI for kids.",
      "doi": ""
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014. ABC and 3D: opportunities and obstacles to 3D printing in special education environments. In Proceedings of the 16th international ACM SIGACCESS Conference on Computers & Accessibility, 107--114.  ",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Véronique Celis, Jelle Husson, Vero Vanden Abeele, Leen Loyez, Lieven Van den Audenaeren, Pol Ghesquière, Ann Goeleven, Jan Wouters, and Luc Geurts. 2013. Translating preschoolers' game experiences into design guidelines via a laddering study. In Proceedings of the 12th International Conference on Interaction Design and Children, 147-- 156.  ",
      "doi": "10.1145/2485760.2485772"
    },
    {
      "text": "Paul-Alexandru Chirita, Claudiu S. Firan, and Wolfgang Nejdl. 2007. Personalized query expansion for the web. In Proceedings of the 30th annual international ACM SIGIR conference on Research and development in information retrieval, 7--14. http://dl.acm.org/citation.cfm?id=1277746  ",
      "doi": "10.1145/1277741.1277746"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2007. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Hang Cui, Ji-Rong Wen, Jian-Yun Nie, and Wei-Ying Ma. 2002. Probabilistic query expansion using query logs. In Proceedings of the 11th international conference on World Wide Web, 325--332. http://dl.acm.org/citation.cfm?id=511489  ",
      "doi": "10.1145/511446.511489"
    },
    {
      "text": "Dale Dougherty. 2013. The Maker Mindset. In Design, make, play: Growing the next generation of STEM innovators, Margaret Honey and David E. Kanter (eds.). Routledge.",
      "doi": ""
    },
    {
      "text": "Allison Druin (ed.). 1998. The Design of Children's Technology. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA. ",
      "doi": "10.5555/303430"
    },
    {
      "text": "Allison Druin, Elizabeth Foss, Leshell Hatley, Evan Golub, Mona Leigh Guha, Jerry Fails, and Hilary Hutchinson. 2009. How children search the internet with keyword interfaces. In Proceedings of the 8th International conference on interaction design and children, 89--96. http://dl.acm.org/citation.cfm?id=1551804  ",
      "doi": "10.1145/1551788.1551804"
    },
    {
      "text": "Allison Druin, Elizabeth Foss, Hilary Hutchinson, Evan Golub, and Leshell Hatley. 2010. Children's roles using keyword search interfaces at home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 413--422.  ",
      "doi": "10.1145/1753326.1753388"
    },
    {
      "text": "Sergio Duarte Torres and Ingmar Weber. 2011. What and how children search on the web. In Proceedings of the 20th ACM international conference on Information and knowledge management, 393--402. http://dl.acm.org/citation.cfm?id=2063638  ",
      "doi": "10.1145/2063576.2063638"
    },
    {
      "text": "Michael Eisenberg. 2013. 3D printing for children: What to build next? International Journal of ChildComputer Interaction 1, 1: 7--13.",
      "doi": ""
    },
    {
      "text": "Michael Ekstrand, Wei Li, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2011. Searching for software learning resources using application context. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11), 195--204.  ",
      "doi": "10.1145/2047196.2047220"
    },
    {
      "text": "Sandra Feinberg and James Robert Keller. 2010. Designing space for children and teens in libraries and public places. American Library Association.",
      "doi": ""
    },
    {
      "text": "Ylva Fernaeus and Jakob Tholander. 2006. Designing for programming as joint performances among groups of children. Interacting with Computers 18, 5: 1012-- 1031.  ",
      "doi": "10.1016/j.intcom.2006.05.004"
    },
    {
      "text": "Jennifer Fernquist, Tovi Grossman, and George Fitzmaurice. 2011. Sketch-sketch revolution: an engaging tutorial system for guided sketching and application learning. In Proceedings of the 24th annual ACM symposium on User interface software and technology, 373--382. http://dl.acm.org/citation.cfm?id=2047245  ",
      "doi": "10.1145/2047196.2047245"
    },
    {
      "text": "Daniel Fitton, Janet C. Read, and John Dempsey. 2015. Exploring children's designs for maker technologies. In Proceedings of the 14th International Conference on Interaction Design and Children, 379--382. http://dl.acm.org/citation.cfm?id=2771921  ",
      "doi": "10.1145/2771839.2771921"
    },
    {
      "text": "Louise P. Flannery, Brian Silverman, Elizabeth R. Kazakoff, Marina Umaschi Bers, Paula Bontá, and Mitchel Resnick. 2013. Designing ScratchJr: support for early childhood learning through computer programming. In Proceedings of the 12th International Conference on Interaction Design and Children, 1--10.  ",
      "doi": "10.1145/2485760.2485785"
    },
    {
      "text": "Sean Follmer and Hiroshi Ishii. 2012. KidCAD: digitally remixing toys through tangible tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2401--2410. http://dl.acm.org/citation.cfm?id=2208403  ",
      "doi": "10.1145/2207676.2208403"
    },
    {
      "text": "Adam Fourney, Ben Lafreniere, Parmit K. Chilana, and Michael Terry. 2014. InterTwine: Creating interapplication information scent to support coordinated use of software. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), 429--438.  ",
      "doi": "10.1145/2642918.2647420"
    },
    {
      "text": "G. W. Furnas, T. K. Landauer, L. M. Gomez, and S. T. Dumais. 1987. The Vocabulary Problem in Humansystem Communication. Commun. ACM 30, 11: 964-- 971.  ",
      "doi": "10.1145/32206.32212"
    },
    {
      "text": "Sharon Nelson-Le Gall. 1981. Help-seeking: An understudied problem-solving skill in children. Developmental Review 1, 3: 224--246.",
      "doi": ""
    },
    {
      "text": "Sharon Nelson-Le Gall. 1985. Chapter 2: Help-Seeking Behavior in Learning. Review of research in education 12, 1: 55--90.",
      "doi": ""
    },
    {
      "text": "Tatiana Gossen, Juliane Höbel, and Andreas Nürnberger. 2014. A comparative study about children's and adults' perception of targeted web search engines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1821--1824.  ",
      "doi": "10.1145/2556288.2557031"
    },
    {
      "text": "Tovi Grossman, George Fitzmaurice, and Ramtin Attar. 2009. A Survey of Software Learnability: Metrics, Methodologies and Guidelines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 649--658.  ",
      "doi": "10.1145/1518701.1518803"
    },
    {
      "text": "Kyle J. Harms, Dennis Cosgrove, Shannon Gray, and Caitlin Kelleher. 2013. Automatically Generating Tutorials to Enable Middle School Children to Learn Programming Independently. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13), 11--19.  ",
      "doi": "10.1145/2485760.2485764"
    },
    {
      "text": "A. Hira, C. H. Joslyn, and M. M. Hynes. 2014. Classroom makerspaces: Identifying the opportunities and challenges. In 2014 IEEE Frontiers in Education Conference (FIE) Proceedings, 1--5.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hirsh. 1999. Children's relevance criteria and information seeking on electronic resources. Journal of the Association for Information Science and Technology 50, 14: 1265.  ",
      "doi": "10.5555/323874.323878"
    },
    {
      "text": "Juan Pablo Hourcade. 2015. Child-Computer Interaction. CreateSpace Independent Publishing Platform.",
      "doi": ""
    },
    {
      "text": "Juan Pablo Hourcade, Benjamin B. Bederson, and Allison Druin. 2004. Building KidPad: an application for children's collaborative storytelling. Software: Practice and Experience, 34(9), 895--914.  ",
      "doi": "10.1002/spe.598"
    },
    {
      "text": "Nathaniel Hudson, Celena Alcock, and Parmit K. Chilana. 2016. Understanding Newcomers to 3D Printing: Motivations, Workflows, and Barriers of Casual Makers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 384--396.  ",
      "doi": "10.1145/2858036.2858266"
    },
    {
      "text": "Amy Hurst and Shaun Kane. 2013. Making making accessible. In Proceedings of the 12th International Conference on Interaction Design and Children, 635-- 638.  ",
      "doi": "10.1145/2485760.2485883"
    },
    {
      "text": "Takeo Igarashi, Satoshi Matsuoka, and Hidehiko Tanaka. 1999. Teddy: A Sketching Interface for 3D Freeform Design. In Proceedings of the 26th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '99), 409--416.  ",
      "doi": "10.1145/311535.311602"
    },
    {
      "text": "Yasmin Kafai, Ricarose Roque, Deborah Fields, and Andres Monroy-Hernandez. 2011. Collaboration by choice: Youth online creative collabs in Scratch. In Proceedings of the 19th International Conference on Computers in Education, 189--193.",
      "doi": ""
    },
    {
      "text": "Nancy Kaplan, Yoram Chisik, Kendra Knudtzon, Rahul Kulkarni, Stuart Moulthrop, Kathryn Summers, and Holly Weeks. 2004. Supporting sociable literacy in the international children's digital library. In Proceedings of the 2004 conference on Interaction design and children: building a community, 89--96.  ",
      "doi": "10.1145/1017833.1017845"
    },
    {
      "text": "Caitlin Kelleher and Randy Pausch. 2005. Stencilsbased tutorials: Design and evaluation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 541--550.  ",
      "doi": "10.1145/1054972.1055047"
    },
    {
      "text": "Caitlin Kelleher, Randy Pausch, and Sara Kiesler. 2007. Storytelling alice motivates middle school girls to learn computer programming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1455--1464.  ",
      "doi": "10.1145/1240624.1240844"
    },
    {
      "text": "Kenneth R. Koedinger and Vincent Aleven. 2007. Exploring the assistance dilemma in experiments with cognitive tutors. Educational Psychology Review 19, 3: 239--264.",
      "doi": ""
    },
    {
      "text": "Benjamin Lafreniere, Andrea Bunt, and Michael Terry. 2014. Task-centric interfaces for feature-rich software. In Proceedings of the 26th Australian ComputerHuman Interaction Conference (OZCHI '14), 49--58.  ",
      "doi": "10.1145/2686612.2686620"
    },
    {
      "text": "Benjamin Lafreniere, Tovi Grossman, and George Fitzmaurice. 2013. Community enhanced tutorials: Improving tutorials with multiple demonstrations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1779--1788.  ",
      "doi": "10.1145/2470654.2466235"
    },
    {
      "text": "Ben Leduc-Mills and Michael Eisenberg. 2011. The UCube: a child-friendly device for introductory threedimensional design. In Proceedings of the 10th International Conference on Interaction Design and Children, 72--80. http://dl.acm.org/citation.cfm?id=1999039  ",
      "doi": "10.1145/1999030.1999039"
    },
    {
      "text": "Ghang Lee, Charles M. Eastman, Tarang Taunk, and Chun-Heng Ho. 2010. Usability principles and best practices for the user interface design of complex 3D architectural design and engineering tools. International Journal of Human-Computer Studies 68, 1--2: 90--104.  ",
      "doi": "10.1016/j.ijhcs.2009.10.001"
    },
    {
      "text": "Hod Lipson and Melba Kurman. 2013. Fabricated: The new world of 3D printing. John Wiley & Sons. ",
      "doi": "10.5555/2544040"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2011. IP-QAT: In-product Questions, Answers, & Tips. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11), 175--184.  ",
      "doi": "10.1145/2047196.2047218"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2011. Ambient help. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2751--2760.  ",
      "doi": "10.1145/1978942.1979349"
    },
    {
      "text": "Christian McKay and Kylie Peppler. 2013. MakerCart: a mobile fab lab for the classroom. Position Paper at the Interaction Design for Children Conference (IDC).",
      "doi": ""
    },
    {
      "text": "S. Nelson-Le Gall, L. Kratzer, E. Jones, and P. DeCooke. 1990. Children's self-assessment of performance and task-related help seeking. Journal of Experimental Child Psychology 49, 2: 245--263.",
      "doi": ""
    },
    {
      "text": "Richard S. Newman. 1990. Children's help-seeking in the classroom: The role of motivational factors and attitudes. Journal of educational psychology 82, 1: 71.",
      "doi": ""
    },
    {
      "text": "Richard S. Newman. 2000. Social influences on the development of children's adaptive help seeking: The role of parents, teachers, and peers. Developmental review 20, 3: 350--404.",
      "doi": ""
    },
    {
      "text": "Eleanor O'Rourke, Kyla Haimovitz, Christy Ballweber, Carol Dweck, and Zoran Popović. 2014. Brain points: a growth mindset incentive structure boosts persistence in an educational game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3339--3348.  ",
      "doi": "10.1145/2556288.2557157"
    },
    {
      "text": "Suporn Pongnumkul, Mira Dontcheva, Wilmot Li, Jue Wang, Lubomir Bourdev, Shai Avidan, and Michael F. Cohen. 2011. Pause-and-play: automatically linking screencast video tutorials with applications. In Proceedings of the 24th annual ACM symposium on User interface software and technology, 135--144. http://dl.acm.org/citation.cfm?id=2047213  ",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Minna Puustinen and Jean-François Rouet. 2009. Learning with new technologies: Help seeking and information searching revisited. Computers & Education 53, 4: 1014--1019.  ",
      "doi": "10.1016/j.compedu.2008.07.002"
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés MonroyHernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and others. 2009. Scratch: programming for all. Communications of the ACM 52, 11: 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Marc Rettig. 1991. Nobody reads documentation. Commun. ACM 34, 7: 19--24.  ",
      "doi": "10.1145/105783.105788"
    },
    {
      "text": "Glenda Revelle, Allison Druin, Michele Platner, Ben Bederson, Juan Pablo Hourcade, and Lisa Sherman. 2002. A visual search tool for early elementary science students. Journal of Science Education and Technology 11, 1: 49--57.",
      "doi": ""
    },
    {
      "text": "John Rieman. 1996. A field study of exploratory learning strategies. ACM Transactions on ComputerHuman Interaction (TOCHI) 3, 3: 189--218.  ",
      "doi": "10.1145/234526.234527"
    },
    {
      "text": "Allison M. Ryan and Paul R. Pintrich. 1997. \"Should I ask for help?\" The role of motivation and attitudes in adolescents' help seeking in math class. Journal of educational psychology 89, 2: 329.",
      "doi": ""
    },
    {
      "text": "Gina Scala. 2016. How 3D Printing Inspires 8th Graders to Explore STEM Careers. Stratasys Blog. Retrieved September 21, 2016 from http://blog.stratasys.com/2016/02/19/stem-careers-3dprinting/",
      "doi": ""
    },
    {
      "text": "John L. Sherry. 2013. The challenge of audience reception: A developmental model for educational game engagement. New directions for child and adolescent development 2013, 139: 11--20.",
      "doi": ""
    },
    {
      "text": "Oliver Stickel, Dominik Hornung, Konstantin Aal, Markus Rohde, and Volker Wulf. 2015. 3D Printing with Marginalized Children-An Exploration in a Palestinian Refugee Camp. In ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19--23 September 2015, Oslo, Norway, 83--102.",
      "doi": ""
    },
    {
      "text": "John Sweller. 1988. Cognitive Load During Problem Solving: Effects on Learning. Cognitive Science 12, 2: 257--285.",
      "doi": "10.1016/0364-0213%2888%29"
    },
    {
      "text": "Rosa Trieu. 2014. What Kids Can Teach Us About Tinkercad And The Future Of 3D Printing. Forbes. Retrieved September 21, 2016 from http://www.forbes.com/sites/rosatrieu/2014/09/09/what -kids-can-teach-us-about-tinkercad-and-the-future-of3d-printing/",
      "doi": ""
    },
    {
      "text": "John Vincent. 2001. The role of visually rich technology in facilitating children's writing. Journal of Computer Assisted Learning 17, 3: 242--250.",
      "doi": ""
    },
    {
      "text": "Mark Ward. 2015. How to turn your child into a video games designer. BBC News. Retrieved September 21, 2016 from http://www.bbc.com/news/technology-",
      "doi": ""
    },
    {
      "text": "José Pablo Zagal, Anne Marie Piper, and Amy S. Bruckman. 2006. Social and Technical Factors Contributing to Successful 3D Animation Authoring by Kids. https://smartech.gatech.edu/handle/1853/13120",
      "doi": ""
    }
  ]
}