{
  "doi": "10.1145/3173574.3173595",
  "title": "Extending Keyboard Shortcuts with Arm and Wrist Rotation Gestures",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We propose and evaluate a novel interaction technique to enhance physical keyboard shortcuts with arm and wrist rotation gestures, performed during keypresses: rolling the wrist, rotating the arm/wrist, and lifting it. This extends the set of shortcuts from key combinations (e.g. ctrl + v) to combinations of key(s) and gesture (e.g. v + roll left) and enables continuous control. We implement this approach for isolated single keypresses, using inertial sensors of a smartwatch. We investigate key aspects in three studies: 1) rotation flexibility per keystroke finger, 2) rotation control, and 3) user-defined gesture shortcuts. As a use case, we employ our technique in a painting application and assess user experience. Overall, results show that arm and wrist rotations during keystrokes can be used for interaction, yet challenges remain for integration into practical applications. We discuss recommendations for applications and ideas for future research.",
  "tags": [
    "keyboard",
    "smartwatch",
    "wrist rotation",
    "elicitation study"
  ],
  "authors": [
    {
      "name": "Daniel Buschek",
      "institution": "LMU Munich, Munich, Bavaria, Germany",
      "img": "/do/10.1145/contrib-82659024557/rel-imgonly/daniel.png",
      "acmid": "82659024557",
      "orcid": "0000-0002-0013-715X"
    },
    {
      "name": "Bianka Roppelt",
      "institution": "LMU Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260675",
      "orcid": "missing"
    },
    {
      "name": "Florian Alt",
      "institution": "LMU Munich & Munich University of Applied Sciences, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    }
  ],
  "references": [
    {
      "text": "Oscar Kin-Chung Au, Kira Yip-Wo Yeung, and Jacky Kit Cheung. 2016. DownChord and UpChord: A New Style of Keyboard Shortcuts Based on Simultaneous Key-down and Key-up Events. In Proceedings of the Fourth International Symposium on Chinese CHI (ChineseCHI2016). ACM, New York, NY, USA, Article 3, 10 pages.  ",
      "doi": "10.1145/2948708.2948715"
    },
    {
      "text": "Gilles Bailly, Thomas Pietrzak, Jonathan Deber, and Daniel J. Wigdor. 2013. Métamorphe: Augmenting Hotkey Usage with Actuated Keys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 563--572.  ",
      "doi": "10.1145/2470654.2470734"
    },
    {
      "text": "Olivier Bau and Wendy E. Mackay. 2008. OctoPocus: A Dynamic Guide for Learning Gesture-based Command Sets. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, New York, NY, USA, 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Sebastian Boring, David Ledo, Xiang 'Anthony' Chen, Nicolai Marquardt, Anthony Tang, and Saul Greenberg. 2012. The Fat Thumb: Using the Thumb's Contact Size for Single-handed Mobile Interaction. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 39--48.  ",
      "doi": "10.1145/2371574.2371582"
    },
    {
      "text": "Xiang 'Anthony' Chen, Julia Schwarz, Chris Harrison, Jennifer Mankoff, and Scott E. Hudson. 2014. Air+Touch: Interweaving Touch & In-air Gestures. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 519--525.  ",
      "doi": "10.1145/2642918.2647392"
    },
    {
      "text": "Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N. Patel, and Jacob O. Wobbrock. 2013. ContextType: Using Hand Posture Information to Improve Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2795--2798.  ",
      "doi": "10.1145/2470654.2481386"
    },
    {
      "text": "Tovi Grossman, Pierre Dragicevic, and Ravin Balakrishnan. 2007. Strategies for Accelerating On-line Learning of Hotkeys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1591--1600.  ",
      "doi": "10.1145/1240624.1240865"
    },
    {
      "text": "Chris Harrison, Julia Schwarz, and Scott E. Hudson. 2011. TapSense: Enhancing Finger Interaction on Touch Surfaces. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 627--636.  ",
      "doi": "10.1145/2047196.2047279"
    },
    {
      "text": "Ken Hinckley and Hyunyoung Song. 2011. Sensor Synaesthesia: Touch in Motion, and Motion in Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 801--810.  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2013. Fiberio: A Touchscreen That Senses Fingerprints. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 41--50.  ",
      "doi": "10.1145/2501988.2502021"
    },
    {
      "text": "Sungjae Hwang, John Song, and Junghyeon Gim. 2015. Touch+: Expanding Touch Input Vocabulary Using a Smartphone and a Smartwatch. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 165--165.  ",
      "doi": "10.1145/2702613.2732485"
    },
    {
      "text": "Ken Iwasaki, Takashi Miyaki, and Jun Rekimoto. 2009. Expressive Typing: A New Way to Sense Typing Pressure and Its Applications. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 4369--4374.  ",
      "doi": "10.1145/1520340.1520668"
    },
    {
      "text": "Sven Mayer, Huy Viet Le, and Niels Henze. 2017. Estimating the Finger Orientation on Capacitive Touchscreens Using Convolutional Neural Networks. In Interactive Surfaces and Spaces. Brighton, UK.  ",
      "doi": "10.1145/3132272.3134130"
    },
    {
      "text": "Simon Rogers, John Williamson, Craig Stewart, and Roderick Murray-Smith. 2011. AnglePose: Robust, Precise Capacitive Touch Tracking via 3D Orientation Estimation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2575--2584.  ",
      "doi": "10.1145/1978942.1979318"
    },
    {
      "text": "Stuart Taylor, Cem Keskin, Otmar Hilliges, Shahram Izadi, and John Helmes. 2014. Type-hover-swipe in 96 Bytes: A Motion Sensing Mechanical Keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1695--1704.  ",
      "doi": "10.1145/2556288.2557030"
    },
    {
      "text": "Gerard Wilkinson, Ahmed Kharrufa, Jonathan Hook, Bradley Pursglove, Gavin Wood, Hendrik Haeuser, Nils Y. Hammerla, Steve Hodges, and Patrick Olivier. 2016. Expressy: Using a Wrist-worn Inertial Measurement Unit to Add Expressiveness to Touch-based Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2832--2844.  ",
      "doi": "10.1145/2858036.2858223"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Robert Xiao, Julia Schwarz, and Chris Harrison. 2015. Estimating 3D Finger Angle on Commodity Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 47--50.  ",
      "doi": "10.1145/2817721.2817737"
    },
    {
      "text": "Haimo Zhang and Yang Li. 2014. GestKeyboard: Enabling Gesture-based Interaction on Ordinary Physical Keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1675--1684.  ",
      "doi": "10.1145/2556288.2557362"
    },
    {
      "text": "Jingjie Zheng and Daniel Vogel. 2016. Finger-Aware Shortcuts. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4274--4285.  ",
      "doi": "10.1145/2858036.2858355"
    }
  ]
}