{
  "doi": "10.1145/3173574.3174147",
  "title": "\"Only if you use English you will get to more things\": Using Smartphones to Navigate Multilingualism",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "We contribute to the intersection of multilingualism and human-computer interaction (HCI) with our investigation of language preferences in the context of the interface design of interactive systems. Through interview data collected from avid smartphone users located across distinct user groups in India, none of whom were native English speakers, we examine the factors that shape language choice and use on their mobile devices. Our findings indicate that these users frequently engage in English communication proactively and enthusiastically, despite their lack of English fluency, and we detail their motivations for doing so. We then discuss how language in technology use can be a way of putting forth mobility as an aspect of one's identity, making the case for an intersectional approach to studying language in HCI.",
  "authors": [
    {
      "name": "Naveena Karusala",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163160",
      "orcid": "0000-0003-0355-3041"
    },
    {
      "name": "Aditya Vishwanath",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658764976",
      "orcid": "missing"
    },
    {
      "name": "Aditya Vashistha",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    },
    {
      "name": "Sunita Kumar",
      "institution": "Independent, New Delhi, Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261031",
      "orcid": "missing"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "2017. More than 5.5 billion mobile users by 2022, India to lead. (2017). http://www.hindustantimes.com/world-news/morethan-5--5-billion-mobile-users-by-2022-indiato-lead/story-KqCGSfgALYQ4RsMHg7praN.html.",
      "doi": ""
    },
    {
      "text": "2017. Top 50 Countries by Smartphone Users and Penetration. (2017). https://newzoo.com/insights/rankings/top-50countries-by-smartphone-penetration-and-users/.",
      "doi": ""
    },
    {
      "text": "Rama Kant Agnihotri, Amrit Lal Khanna, and Neeti Ahluwalia. 1997. Problematizing English in India. Sage Delhi.",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames. 2015. Charismatic Technology. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (AA '15). Aarhus University Press, 109--120.  ",
      "doi": "10.7146/aahcc.v1i1.21199"
    },
    {
      "text": "Andrea Ballatore, Mark Graham, and Shilad Sen. 2017. Digital hegemonies: the localness of search engine results. Annals of the American Association of Geographers (2017), 1--22.",
      "doi": ""
    },
    {
      "text": "Rakesh M Bhatt. 2008. In other words: Language mixing, identity representations, and third space. Journal of sociolinguistics 12, 2 (2008), 177--200.",
      "doi": ""
    },
    {
      "text": "Nicola J Bidwell, Thomas Reitmaier, Gary Marsden, and Susan Hansen. 2010. Designing with mobile digital storytelling in rural Africa. In Proceedings of CHI.  ",
      "doi": "10.1145/1753326.1753564"
    },
    {
      "text": "V. Braun and V. Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Alison Burrows, Rachael Gooberman-Hill, and David Coyle. 2016. Shared Language and the Design of Home Healthcare Technology. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3584--3594.  ",
      "doi": "10.1145/2858036.2858496"
    },
    {
      "text": "A Suresh Canagarajah. 2007. The ecology of global English. International multilingual research Journal 1, 2 (2007), 89--100.",
      "doi": ""
    },
    {
      "text": "Noel Cass, Elizabeth Shove, and John Urry. 2005. Social exclusion, mobility and access. The sociological review 53, 3 (2005), 539--555.",
      "doi": ""
    },
    {
      "text": "Monojit Choudhury, Kalika Bali, Tirthankar Dasgupta, and Anupam Basu. 2010. Resource creation for training and testing of transliteration systems for indian languages. LREC.",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1991. Mapping the margins: Intersectionality, identity politics, and violence against women of color. Stanford law review (1991), 1241--1299.",
      "doi": ""
    },
    {
      "text": "Prasenjit Dey, Ramchandrula Sitaram, Rahul Ajmera, and Kalika Bali. 2009. Voice key board: multimodal indic text input. In Proceedings of the 2009 international conference on Multimodal interfaces. ACM, 313--318.  ",
      "doi": "10.1145/1647314.1647380"
    },
    {
      "text": "Rita Kaur Dhamoon. 2011. Considerations on mainstreaming intersectionality. Political Research Quarterly 64, 1 (2011), 230--243.",
      "doi": ""
    },
    {
      "text": "Tony Fernandes. 1995. Global interface design: A guide to designing international user interfaces. (1995). ",
      "doi": "10.5555/207588"
    },
    {
      "text": "David M Frohlich, Dorothy Rachovides, Kiriaki Riga, Ramnath Bhat, Maxine Frank, Eran Edirisinghe, Dhammike Wickramanayaka, Matt Jones, and Will Harwood. 2009. StoryBank: mobile digital storytelling in a development context. In Proceedings of CHI.  ",
      "doi": "10.1145/1518701.1518972"
    },
    {
      "text": "Rikin Gandhi, Rajesh Veeraraghavan, Kentaro Toyama, and Vanaja Ramprasad. 2009. Digital Green: Participatory Video and Mediated Instruction for Agricultural Extension. ITID 5, 1 (2009).",
      "doi": ""
    },
    {
      "text": "Ge Gao and Susan R Fussell. 2017. A Kaleidoscope of Languages: When and How Non-Native English Speakers Shift between English and Their Native Language during Multilingual Teamwork. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 760--772.  ",
      "doi": "10.1145/3025453.3025839"
    },
    {
      "text": "Ge Gao, Hao-Chuan Wang, Dan Cosley, and Susan R Fussell. 2013. Same translation but different experience: the effects of highlighting on machine-translated conversations. In Proceedings of the sigchi conference on human factors in computing systems. ACM, 449--458.  ",
      "doi": "10.1145/2470654.2470719"
    },
    {
      "text": "Ge Gao, Bin Xu, Dan Cosley, and Susan R Fussell. 2014. How beliefs about the presence of machine translation impact multilingual collaborations. In Proceedings of the 17th ACM conference on Computer supported cooperative work&social computing. ACM, 1549--1560.  ",
      "doi": "10.1145/2531602.2531702"
    },
    {
      "text": "Ge Gao, Naomi Yamashita, Ari MJ Hautasaari, Andy Echenique, and Susan R Fussell. 2014. Effects of public vs. private automated transcripts on multiparty communication between native and non-native english speakers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 843--852.  ",
      "doi": "10.1145/2556288.2557303"
    },
    {
      "text": "Ge Gao, Naomi Yamashita, Ari MJ Hautasaari, and Susan R Fussell. 2015. Improving multilingual collaboration by displaying how non-native speakers use automated transcripts and bilingual dictionaries. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3463--3472.  ",
      "doi": "10.1145/2702123.2702498"
    },
    {
      "text": "Isabela Gasparini, Marcelo S Pimenta, and José Palazzo M De Oliveira. 2011. Vive la différence!: a survey of cultural-aware issues in HCI. In Proceedings of the 10th Brazilian Symposium on Human Factors in Computing Systems and the 5th Latin American Conference on Human-Computer Interaction. Brazilian Computer Society, 13--22. ",
      "doi": "10.5555/2254436.2254442"
    },
    {
      "text": "Registrar General. 2002. Census Commissioner, India. Census of India 2001. Provisional Population Totals, Paper 1 (2002).",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1959. The Presentation of Self in Everyday Life. (1959).",
      "doi": ""
    },
    {
      "text": "Leo A Goodman. 1961. Snowball sampling. The annals of mathematical statistics (1961), 148--170.",
      "doi": ""
    },
    {
      "text": "Mark Graham, Ralph K Straumann, and Bernie Hogan. 2015. Digital divisions of labor and informational magnetism: Mapping participation in Wikipedia. Annals of the Association of American Geographers 105, 6 (2015), 1158--1178.",
      "doi": ""
    },
    {
      "text": "Rebecca Grinter and Margery Eldridge. 2003. Wan2tlk?: everyday text messaging. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 441--448.  ",
      "doi": "10.1145/642611.642688"
    },
    {
      "text": "Rüdiger Heimgärtner. 2007. Towards cultural adaptability in driver information and-assistance systems. In International Conference on Usability and Internationalization. Springer, 372--381. ",
      "doi": "10.5555/1783969.1784014"
    },
    {
      "text": "Victor Jupp. 2006. The Sage dictionary of social research methods. Sage.",
      "doi": ""
    },
    {
      "text": "Zahir Koradia, Piyush Aggarwal, Aaditeshwar Seth, and Gaurav Luthra. 2013. Gurgaon idol: a singing competition over community radio and IVRS. In Proceedings of the 3rd ACM Symposium on Computing for Development. ACM, 6.  ",
      "doi": "10.1145/2442882.2442890"
    },
    {
      "text": "Ashish Krishna, Girish Prabhu, Kalika Bali, and Sriganesh Madhvanath. 2005. Indic scripts based online form filling-A usability exploration. In 11th International Conference on Human-Computer Interaction (HCII 2005), Las Vegas, USA (July 2005).",
      "doi": ""
    },
    {
      "text": "Arun Kumar, Nitendra Rajput, Dipanjan Chakraborty, Sheetal K Agarwal, and Amit Anil Nanavati. 2007. Voiserv: Creation and delivery of converged services through voice for emerging economies. In World of Wireless, Mobile and Multimedia Networks, 2007. WoWMoM 2007. IEEE International Symposium on a. IEEE, 1--8.",
      "doi": ""
    },
    {
      "text": "Neha Kumar. 2014. Facebook for self-empowerment? A study of Facebook adoption in urban India. new media&society 16, 7 (2014), 1122--1137.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J. Anderson. 2015. Mobile Phones for Maternal Health in Rural India. In Proceedings of CHI.  ",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, and Richard Anderson. 2015. Projecting Health: Community-led Video Education for Maternal Health. In Proceedings of ICTD.  ",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Alice Ludvig. 2006. Differences between women? Intersecting voices in a female narrative. European Journal of Women's Studies 13, 3 (2006), 245--258.",
      "doi": ""
    },
    {
      "text": "Aaron Marcus and Emilie West Gould. 2000. Crosscurrents: cultural dimensions and global Web user-interface design. interactions 7, 4 (2000), 32--46.  ",
      "doi": "10.1145/345190.345238"
    },
    {
      "text": "Indrani Medhi, SN Gautama, and Kentaro Toyama. 2009. A comparison of mobile money-transfer UIs for non-literate and semi-literate users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1741--1750.  ",
      "doi": "10.1145/1518701.1518970"
    },
    {
      "text": "Indrani Medhi, Somani Patnaik, Emma Brunskill, SN Gautama, William Thies, and Kentaro Toyama. 2011. Designing mobile interfaces for novice and low-literacy users. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 1 (2011), 2.  ",
      "doi": "10.1145/1959022.1959024"
    },
    {
      "text": "Indrani Medhi, Aman Sagar, and Kentaro Toyama. 2006. Text-free user interfaces for illiterate and semi-literate users. In Information and Communication Technologies and Development, 2006. ICTD'06. International Conference on. IEEE, 72--82.",
      "doi": ""
    },
    {
      "text": "Indrani Medhi-Thies, Pedro Ferreira, Nakull Gupta, Jacki O'Neill, and Edward Cutrell. 2015. KrishiPustak: A Social Networking System for Low-Literate Farmers. In Proceedings of CSCW.  ",
      "doi": "10.1145/2675133.2675224"
    },
    {
      "text": "Ajit K Mohanty. 2006. Multilingualism of the unequals and predicaments of education in India: Mother tongue or other tongue. Imagining Multilingual Schools. Clevedon: Multilingual Matters (2006), 262--79.",
      "doi": ""
    },
    {
      "text": "Preeti Mudliar, Jonathan Donner, and William Thies. 2012a. Emergent Practices Around CGNet Swara, A Voice Forum for Citizen Journalism in Rural India. In Proceedings of ICTD.  ",
      "doi": "10.1145/2160673.2160695"
    },
    {
      "text": "Preeti Mudliar, Jonathan Donner, and William Thies. 2012b. Emergent practices around CGNet Swara, voice forum for citizen journalism in rural India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development. ACM, 159--168.  ",
      "doi": "10.1145/2160673.2160695"
    },
    {
      "text": "Constantine V Nakassis. 2016. Doing style: Youth and mass mediation in South India. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Loïc Martínez Normand, Fabio Paternò, and Marco Winckler. 2014. Public policies and multilingualism in HCI. interactions 21, 3 (2014), 70--73.  ",
      "doi": "10.1145/2598608"
    },
    {
      "text": "Jacki O'Neill, Kentaro Toyama, Jay Chen, Berthel Tate, and Aysha Siddique. 2016. The Increasing Sophistication of Mobile Media Sharing in Lower-Middle-Class Bangalore. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. ACM, 17.  ",
      "doi": "10.1145/2909609.2909656"
    },
    {
      "text": "Joyojeet Pal, Meera Lakshmanan, and Kentaro Toyama. 2007. \"My Child will be Respected\": Parental perspectives on computers in rural India. In Information and Communication Technologies and Development, 2007. ICTD 2007. International Conference on. IEEE, 1--9.",
      "doi": ""
    },
    {
      "text": "Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan S Parikh. 2010. Avaaj otalo: a field study of an interactive voice forum for small farmers in rural india. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 733--742.  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Neil Patel, Kapil Shah, Krishna Savani, Scott R. Klemmer, Paresh Dave, and Tapan S. Parikh. 2012. Power to the Peers: Authority of Source Effects for a Voice-based Agricultural Information Service in Rural India. In Proceedings of ICTD.  ",
      "doi": "10.1145/2160673.2160696"
    },
    {
      "text": "Alastair Pennycook. 2004. Performativity and language studies. Critical Inquiry in Language Studies: An International Journal 1, 1 (2004), 1--19.",
      "doi": ""
    },
    {
      "text": "Alastair Pennycook. 2010. Language as a local practice. Routledge.",
      "doi": ""
    },
    {
      "text": "Alastair Pennycook. 2012. Language and mobility: Unexpected places. Vol. 15. Multilingual matters.",
      "doi": ""
    },
    {
      "text": "Kavita Philip, Lilly Irani, and Paul Dourish. 2012. Postcolonial computing: A tactical survey. Science, Technology,&Human Values 37, 1 (2012), 3--29.",
      "doi": ""
    },
    {
      "text": "Madelaine Plauche, Udhyakumar Nallasamy, Joyojeet Pal, Chuck Wooters, and Divya Ramachandran. 2006. Speech recognition for illiterate access to information and technology. In Information and Communication Technologies and Development, 2006. ICTD'06. International Conference on. IEEE, 83--92.",
      "doi": ""
    },
    {
      "text": "Madelaine Plauché and Madhu Prabaker. 2006. Tamil market: a spoken dialog system for rural india. In CHI'06 extended abstracts on Human factors in computing systems. ACM, 1619--1624.  ",
      "doi": "10.1145/1125451.1125746"
    },
    {
      "text": "Archana Prasad, Indrani Medhi, Kentaro Toyama, and Ravin Balakrishnan. 2008. Exploring the feasibility of video mail for illiterate users. In Proceedings of the working conference on Advanced visual interfaces. ACM, 103--110.  ",
      "doi": "10.1145/1385569.1385588"
    },
    {
      "text": "Nimmi Rangaswamy and Edward Cutrell. 2012. Anthropology, development and ICTs: slums, youth and the mobile internet in urban India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development. ACM, 85--93.  ",
      "doi": "10.1145/2160673.2160685"
    },
    {
      "text": "Thomas Reitmaier, Nicola J Bidwell, and Gary Marsden. 2010. Field testing mobile digital storytelling software in rural Kenya. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services.  ",
      "doi": "10.1145/1851600.1851649"
    },
    {
      "text": "Patricia Russo and Stephen Boor. 1993. How fluent is your interface?: designing for international users. In Proceedings of the INTERACT'93 and CHI'93 conference on human factors in computing systems. ACM, 342--347.  ",
      "doi": "10.1145/169059.169274"
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated technology use in developing communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Morgan Klaus Scheuerman, William Easley, Ali Abdolrahmani, Amy Hurst, and Stacy Branham. 2017. Learning the Language: The Importance of Studying Written Directions in Designing Navigational Technologies for the Blind. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2922--2928.  ",
      "doi": "10.1145/3027063.3053260"
    },
    {
      "text": "Andy Smith, Anirudha Joshi, Zhengjie Liu, Liam Bannon, Jan Gulliksen, and Christina Li. 2007. Institutionalizing HCI in Asia. Human-Computer Interaction--INTERACT 2007 (2007), 85--99. ",
      "doi": "10.5555/1778331.1778341"
    },
    {
      "text": "Thomas N Smyth, Satish Kumar, Indrani Medhi, and Kentaro Toyama. 2010. Where there's a will there's a way: mobile media sharing in urban india. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 753--762.  ",
      "doi": "10.1145/1753326.1753436"
    },
    {
      "text": "Piya Sorcar. 2009. Teaching taboo topics without talking about them: An epistemic study of a new approach to HIV /AIDS prevention education in India. Ph.D. Dissertation. Stanford University.",
      "doi": ""
    },
    {
      "text": "Joel Spring. 2007. The triumph of the industrial-consumer paradigm and English as the global language. International Multilingual Research Journal 1, 2 (2007), 61--78.",
      "doi": ""
    },
    {
      "text": "T Tiewtrakul and SR Fletcher. 2010. The challenge of regional accents for aviation English language proficiency standards: A study of difficulties in understanding in air traffic control--pilot communications. Ergonomics 53, 2 (2010), 229--239.",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015a. Sangeet Swara: A Community-Moderated Voice Forum in Rural India. In Proceedings of CHI.  ",
      "doi": "10.1145/2702123.2702191"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Nicola Dell, and Richard Anderson. 2015b. Social media platforms for low-income blind people in india. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers&Accessibility. ACM, 259--272.  ",
      "doi": "10.1145/2700648.2809858"
    },
    {
      "text": "Aditya Vashistha, Neha Kumar, Anil Mishra, and Richard Anderson. 2016. Mobile Video Dissemination for Community Health. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. ACM, 20.  ",
      "doi": "10.1145/2909609.2909655"
    },
    {
      "text": "Aditya Vashistha, Neha Kumar, Anil Mishra, and Richard Anderson. 2017a. Examining Localization Approaches for Community Health. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 357--368.  ",
      "doi": "10.1145/3064663.3064754"
    },
    {
      "text": "Aditya Vashistha, Pooja Sethi, and Richard Anderson. 2017b. Respeak: A Voice-based, Crowd-powered Speech Transcription System. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1855--1866.  ",
      "doi": "10.1145/3025453.3025640"
    },
    {
      "text": "Willian Massami Watanabe, Arnaldo Candido Junior, Vinícius Rodriguez Uzêda, Renata Pontin de Mattos Fortes, Thiago Alexandre Salgueiro Pardo, and Sandra Maria Aluísio. 2009. Facilita: reading assistance for low-literacy readers. In Proceedings of the 27th ACM international conference on Design of communication. ACM, 29--36.  ",
      "doi": "10.1145/1621995.1622002"
    },
    {
      "text": "Susan Wyche and Charles Steinfield. 2016. Why don't farmers use cell phones to access market prices? technology affordances and barriers to market information services adoption in rural Kenya. Information Technology for Development 22, 2 (2016), 320--333.  ",
      "doi": "10.1080/02681102.2015.1048184"
    },
    {
      "text": "Susan Wyche, Charles Steinfield, Tian Cai, Nightingale Simiyu, and Martha E. Othieno. 2016. Reflecting on Video: Exploring the Efficacy of Video for Teaching Device Literacy in Rural Kenya. In Proceedings of ICTD.  ",
      "doi": "10.1145/2909609.2909667"
    },
    {
      "text": "Thimmaraja G Yadava and HS Jayanna. 2017. A spoken query system for the agricultural commodity prices and weather information access in Kannada language. International Journal of Speech Technology (2017), 1--10.  ",
      "doi": "10.1007/s10772-017-9428-y"
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye Text, Hello Emoji: Mobile Communication on WeChat in China. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 748--759.  ",
      "doi": "10.1145/3025453.3025800"
    }
  ]
}