{
  "doi": "10.1145/3173574.3173686",
  "title": "Phone vs. Tangible in Museums: A Comparative Study",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Despite years of HCI research on digital technology in museums, it is still unclear how different interactions impact on visitors'. A comparative evaluation of smart replicas, phone app and smart cards looked at the personal preferences, behavioural change, and the appeal of mobiles in museums. 76 participants used all three interaction modes and gave their opinions in a questionnaire; participants interaction was also observed. The results show the phone is the most disliked interaction mode while tangible interaction (smart card and replica combined) is the most liked. Preference for the phone favour mobility to the detriment of engagement with the exhibition. Different behaviours when interacting with the phone or the tangibles where observed. The personal visiting style appeared to be only marginally affected by the device. Visitors also expect museums to provide the phones against the current trend of developing apps in a \"bring your own device\" approach.",
  "authors": [
    {
      "name": "Daniela Petrelli",
      "institution": "Sheffield Hallam University, Sheffiled, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100189751",
      "orcid": "missing"
    },
    {
      "name": "Sinead O'Brien",
      "institution": "University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659070684",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Archeomatica 2016 Museo Glass Beacon: indagine sul gradimento della visita in realtá aumentata ai Mercati di Traiano https://www.archeomatica.it/musei/museoglass-beacon-indagine-gradimento-della-visita-realtaaumentata-mercati-di-traiano (accessed 15.9.2017)",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology, 3(2), 77--101.",
      "doi": ""
    },
    {
      "text": "Carlotta Capurro, Dries Nollet and Daniel Pletinkx 2015. Tangible interfaces for digital museum applications The Virtex and Virtex Light systems in the Keys to Rome exhibition. Proc of Digital Heritage, Granada, IEEE, 271--276.",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi, Gabriela Avram, Laura Maye, Nicholas Dulake, Mark T. Marshall, Dick van Dijk, D. and Fiona McDermott. 2016. Articulating Co-Design in Museums: Reflection on Two Participatory Processes, Proceedings of CSCW 2016, New York: ACM, 13--25.  ",
      "doi": "10.1145/2818048.2819967"
    },
    {
      "text": "Luigina Ciolfi and Marc McLoughlin. 2012. Of Turf Fires, Fine Linen and Porter Cake: Design for Living History, ACM Interactions, XIX.5 September + October, 18--21.  ",
      "doi": "10.1145/2334184.2334190"
    },
    {
      "text": "Deloitte Global Mobile Consumer Survey 2016, NL edition.https://www2.deloitte.com/content/dam/Deloitt e/nl/Documents/technology-mediatelecommunications/deloitte-nl-tmt-global-mobileconsumer-survey-2016.pdf (accessed 14.9.2017)",
      "doi": ""
    },
    {
      "text": "Lotte de Reus, Jouke Verlinden, Maaike Roozenburg. 2013 Nonlinear stories told by cups and saucers: Smart Replicas with responsive 3D audio. Ar{t} Magazine, 3, 34--39.",
      "doi": ""
    },
    {
      "text": "Maria Economou and E. Meintani. 2011. Promising beginning? Evaluating museum mobile phone apps. Proc. of Rethinking Technology in Museums 2011: Emerging experiences, Limerick, Ireland, 26--27 May 2011.",
      "doi": ""
    },
    {
      "text": "John Falk. 2009 Identity and the Museum Visitor Experience, Left Coast Press.",
      "doi": ""
    },
    {
      "text": "Kieran Ferris, Liam Bannon, Luigina Ciolfi, Paul Gallagher, Tony Hall, and Marilyn Lennon. 2004. Shaping experiences in the hunt museum: a design case study. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). ACM,, 205--214.  ",
      "doi": "10.1145/1013115.1013144"
    },
    {
      "text": "Lesley Fosh, Steve Benford, Stuart Reeves, Boriana Koleva and Patrick Brundell. 2013. 'See Me, Feel Me, Touch Me, Hear Me': Trajectories and Interpretations in a Sculpture Garden. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 149--158.  ",
      "doi": "10.1145/2470654.2470675"
    },
    {
      "text": "Gallery One, Cleveland Museum of Art. 2013. Video. (7 March 2013.). Retrieved September 22, 2015 from https://www.youtube.com/watch?v=qWJqd6lyJ-E (accessed 15.9.2017)",
      "doi": ""
    },
    {
      "text": "Kerry Hannon. 2016 Museums, the New Social Media Darlings. The New York Times, 28 October https://www.nytimes.com/2016/10/30/arts/design/muse ums-the-new-social-media-darlings.html?mcubz=1 (accessed 15.9.2017)",
      "doi": ""
    },
    {
      "text": "Adrian Hazzard, Steve Benford and Gary Burnett. 2015 Sculpting a mobile music soundtrack. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 387--396.  ",
      "doi": "10.1145/2702123.2702236"
    },
    {
      "text": "Uta Hinrichs and Sheelagh Carpendale 2011. Gestures in the Wild: Studying Multi-touch Gesture Sequences on Interactive Tabletop Exhibit. In Proc. of SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3023--3032.  ",
      "doi": "10.1145/1978942.1979391"
    },
    {
      "text": "Eva Hornecker. 2008. I don't understand it either but it's cool\" -- Visitor Interactions with a Multi-touch Table in a Museum. In Proceedings of IEEE Tabletop, 121--128.",
      "doi": ""
    },
    {
      "text": "Jean Ho Chu, Daniel Harley, Jamie Kwan, Melanie McBride, and Ali Mazalek. 2016. Sensing History: Contextualizing Artifacts with Sensory Interactions and Narrative Design. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, 1294--1302.  ",
      "doi": "10.1145/2901790.2901829"
    },
    {
      "text": "Andrew Lewis 2013. What do visitors say about using mobile devices in Museums? V&A -- Victoria and Albert Museum http://www.vam.ac.uk/blog/digitalmedia/museum-visitors-using-mobile (accessed 15.9.2017)",
      "doi": ""
    },
    {
      "text": "David McGookin, Koray Tahiroălu, Tuomas Vaittinen, Mikko Kytö, Beatrice Monastero, and Juan Carlos Vasquez. 2017. Exploring Seasonality in Mobile Cultural Heritage. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 6101--6105.  ",
      "doi": "10.1145/3025453.3025803"
    },
    {
      "text": "Mark T. Marshall, Nicholas Dulake, Luigina Ciolfi, Daniele Duranti, Daniela Petrelli. 2016. Using Tangible Smart Replicas as Controls for an Interactive Museum Exhibition. In Proceedings of TEI 2016 -- Tenth Anniversary Conference on Tangible, Embedded and Embodied Interaction (TEI16), New York: ACM, 159--167  ",
      "doi": "10.1145/2839462.2839493"
    },
    {
      "text": "NMC Horizon Museum Edition 2016 http://cdn.nmc.org/media/2016-nmc-horizon-reportmuseum-EN.pdf (accessed 15.9.2017)",
      "doi": ""
    },
    {
      "text": "Daniela Petrelli, Luigina Ciolfi, Dick van Dijk, Eva Hornecker, Elena Not, Albrecht Schmidt. 2013. Integrating material and digital: a new way for cultural heritage. ACM Interactions, 20(4), 58--63.  ",
      "doi": "10.1145/2486227.2486239"
    },
    {
      "text": "Daniela Petrelli, Nicholas Dulake, Mark T. Marshall, Hub Kockelkorn, Anna Pisetti. 2016. Do it together: The effect of curators, designers, and technologists sharing the making of new interactive visitors' experiences. Proc. of Museums and the Web 2016 (MW2016) http://mw2016.museumsandtheweb.com/paper/do-ittogether-the-effect-of-curators-designers-andtechnologists-sharing-the-making-of-new-interactivevisitors-experiences/ (accessed 11.12.2017)",
      "doi": ""
    },
    {
      "text": "Daniela Petrelli and Elena Not. 2005. User-centred design of flexible hypermedia for a mobile guide: reflections on the HyperAudio experience. UMUAI User Modeling and User-Adapted Interaction 15(3--4), 303--338  ",
      "doi": "10.1007/s11257-005-8816-1"
    },
    {
      "text": "Daniela Petrelli, Mark T. Marshall, Sinead O'Brien, Patrick McEntaggart, Ian Gwilt. 2016. Tangible data souvenirs as a bridge between a physical museum visit and online digital experience. Personal and Ubiquitous Computing, 1--15.  ",
      "doi": "10.1007/s00779-016-0993-x"
    },
    {
      "text": "Daniela Petrelli, Alessandro Soranzo, Luigina Ciolfi and John Reidy. 2016. Exploring the aesthetics of tangible interaction: experiments on the perception of hybrid objects. In Proc. Tangible, Embedded and Embodied Interaction TEI 2016. ACM Press.  ",
      "doi": "10.1145/2839462.2839478"
    },
    {
      "text": "Margaret H. Szymanski, Paul M. Aoki, Rebecca E. Grinter, Amy Hurst, James Thornton, and Alison Woodruff. 2007. Sotto Voce: Facilitating Social Learning in a Historic House. Computer Supported Cooperative Work, 17: 5--34.  ",
      "doi": "10.1007/s10606-007-9067-y"
    },
    {
      "text": "Scott Sayre. 2015 Bring it on: Ensuring the success of BYOD programming in the musuem environment. Proc. Of Museums and the Web. http://mw2015.museumsandtheweb.com/paper/bringit-on-ensuring-the-success-of-byod-programming-inthe-museum-environment/ (accessed 15.9.2017)",
      "doi": ""
    },
    {
      "text": "Beverly Serrell and Britt Raphling. 1992 Computers on the Exhibit Floor. Curator -- The Museum Journal, 35, 3: 181--189.",
      "doi": ""
    },
    {
      "text": "Smithsonian Institution. 2002. The Making of Exhibitions: Purpose, Structure, Role, and Process. http://www.si.edu/content/opanda/docs/rpts2002/02.10. makingexhibitions.final.pdf (accessed 15.9.2017)",
      "doi": ""
    },
    {
      "text": "Neal Stimler. 2013 Seeing the Met through Glass. http://www.metmuseum.org/blogs/digitalunderground/posts/2013/seeing-the-met-through-glass (accessed 15.9.2017)",
      "doi": ""
    },
    {
      "text": "Robyn Taylor, John Bowers, Bettina Nissen, Gavin Wood, Qasim Chaudhry, Peter Wright, Lindsey Bruce, Sarah Glynn, Helen Mallinson, and Roy Bearpark. 2015. Making Magic: Designing for Open Interactions in Museum Settings. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, 313--322.  ",
      "doi": "10.1145/2757226.2757241"
    },
    {
      "text": "Eliseo Veron and Martine Lavasseur. 1983. Ethnographie de l'exposition, Bibliotheque Public d'Information, Centre George Pompidou, Paris.",
      "doi": ""
    },
    {
      "text": "Dirk vom Lehn and Christian Heath. 2003. Displacing the object: mobile technology and interpretive resources. Proc. of Cultural Institution and Digital Technology.http://www.archimuse.com/publishing/ichi m03/088C.pdf",
      "doi": ""
    },
    {
      "text": "Philipp Wacker, Kerstin Kreutz, Florian Heller, and Jan Borchers. 2016. Maps and Location: Acceptance of Modern Interaction Techniques for Audio Guides. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 10671071.  ",
      "doi": "10.1145/2858036.2858189"
    },
    {
      "text": "Ron Wakkary and Marek Hatala. 2007. Situated play in a tangible interface and adaptive audio museum guide. Personal and Ubiquitous Computing, 11, 171--191.  ",
      "doi": "10.1007/s00779-006-0101-8"
    },
    {
      "text": "Ron Wakkary, Marek Hatala, Kevin Muise, Karen Tanenbaum, Greg Corness, Bardia Mohabbati and Jim Budd. 2009. Kurio: A Museum Guide for Families. In Proceedings of Tangible, Embedded and Embodied Interaction (TEI'09), ACM, 215--222.  ",
      "doi": "10.1145/1517664.1517712"
    },
    {
      "text": "Alexandra Weilenmann, Thomas Hillman, and Beata Jungselius. 2013. Instagram at the museum: communicating the museum experience through social photo sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 1843--1852.  ",
      "doi": "10.1145/2470654.2466243"
    },
    {
      "text": "Massimo Zancanaro, Tzvika Kuflik, Zvi Boger, Dina Goren-Bar and Dan Goldwasser, Analyzing Museum Visitors' Behaviour Pattern, Proceedings of the User Modeling UM 2007, LNAI 4511 (2207) 238--246.  ",
      "doi": "10.1007/978-3-540-73078-1_27"
    }
  ]
}