{
  "doi": "10.1145/3173574.3173715",
  "title": "HARK No More: On the Preregistration of CHI Experiments",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Experimental preregistration is required for publication in many scientific disciplines and venues. When experimental intentions are preregistered, reviewers and readers can be confident that experimental evidence in support of reported hypotheses is not the result of HARKing, which stands for Hypothesising After the Results are Known. We review the motivation and outcomes of experimental preregistration across a variety of disciplines, as well as previous work commenting on the role of evaluation in HCI research. We then discuss how experimental preregistration could be adapted to the distinctive characteristics of Human-Computer Interaction empirical research, to the betterment of the discipline.",
  "authors": [
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Alan Dix",
      "institution": "University of Birmingham, Birmingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100537116/rel-imgonly/alan-australia-sml.jpg",
      "acmid": "81100537116",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "APA. 2010. Publication Manual of the American Psychological Association (6th ed.). American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Nikola Banovic. 2016. To Replicate or Not to Replicate? GetMobile: Mobile Comp. and Comm. 19, 4 (March 2016), 23--27.  ",
      "doi": "10.1145/2904337.2904346"
    },
    {
      "text": "Daniel Benjamin, James Berger, Magnus Johannesson, Brian Nosek, E. Wagenmakers, Richard Berk, Kenneth Bollen, Bjorn Brembs, Lawrence Brown, Colin Camerer, David Cesarini, Christopher Chambers, Merlise Clyde, Thomas Cook, Paul De Boeck, Zoltan Dienes, Anna Dreber, Kenny Easwaran, Charles Efferson, Ernst Fehr, Fiona Fidler, Andy Field, Malcom Forster, Edward George, Tarun Ramadorai, Richard Gonzalez, Steven Goodman, Edwin Green, Donald Green, Anthony Greenwald, Jarrod Hadfield, Larry Hedges, Leonhard Held, Teck Hau Ho, Herbert Hoijtink, James Jones, Daniel Hruschka, Kosuke Imai, Guido Imbens, John Ioannidis, Minjeong Jeon, Michael Kirchler, David Laibson, John List, Roderick Little, Arthur Lupia, Edouard Machery, Scott Maxwell, Michael McCarthy, Don Moore, Stephen Morgan, Marcus Munafo, Shinichi Nakagawa, Brendan Nyhan, Timothy Parker, Luis Pericchi, Marco Perugini, Jeff Rouder, Judith Rousseau, Victoria Savalei, Felix Schonbrodt, Thomas Sellke, Betsy Sinclair, Dustin Tingley, Trisha Zandt, Simine Vazire, Duncan Watts, Christopher Winship, Robert Wolpert, Yu Xie, Cristobal Young, Jonathan Zinman, and Valen Johnson. 2017. Redefine Statistical Significance. PsyArXiv (July 22 2017).",
      "doi": ""
    },
    {
      "text": "Mario Biagioli. 2016. Watch out for cheats in citation game. Nature 535, 7611 (Jul 14 2016), 201.",
      "doi": ""
    },
    {
      "text": "J. P. Boissel. 1993. International Collaborative Group on Clinical Trial Registries: Position paper and consensus recommendations on clinical trial registries. Clinical Trials and Meta-Analysis 28, 4--5 (1993), 255--266.",
      "doi": ""
    },
    {
      "text": "Paul Cairns. 2007. HCI... Not As It Should Be: Inferential Statistics in HCI Research. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...But Not As We Know It - Volume 1 (BCS-HCI '07). British Computer Society, Swinton, UK, UK, 195--201. http://dl.acm.org/citation.cfm?id=1531294.1531321 ",
      "doi": "10.5555/1531294.1531321"
    },
    {
      "text": "Lucas C. Coffman and Muriel Niederle. 2015. Pre-analysis Plans Have Limited Upside, Especially Where Replications Are Feasible. Journal of Economic Perspectives 29, 3 (September 2015), 81--98.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1990. Things I have learned (so far). American Psychologist 45, 12 (1990), 1304 -- 1312.",
      "doi": ""
    },
    {
      "text": "G. Cumming. 2012. Understanding the New Statistics: Effect Sizes, Confidence Intervals, and Meta-analysis. Routledge.",
      "doi": ""
    },
    {
      "text": "Rennie D. 2004. Trial registration: A great idea switches from ignored to irresistible. JAMA 292, 11 (2004), 1359--1362.",
      "doi": ""
    },
    {
      "text": "K. Dickersin, S. Chan, T. C. Chalmers, H. S. Sacks, and H. Smith Jr. 1987. Publication bias and clinical trials. Controlled Clinical Trials 8, 4 (1987), 343--353.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair Statistical Communication in HCI. In Modern Statistical Methods for HCI, Judy Robertson and Maurits Kaptein (Eds.). Springer International Publishing, Cham, 291--330.",
      "doi": ""
    },
    {
      "text": "Wolfgang Forstmeier, Eric-Jan Wagenmakers, and Timothy H. Parker. 2016. Detecting and avoiding likely false-positive findings -- a practical guide. Biological Reviews (2016), n/a--n/a.",
      "doi": ""
    },
    {
      "text": "Annie Franco, Neil Malhotra, and Gabor Simonovits. 2014. Publication bias in the social sciences: Unlocking the file drawer. Science 345, 6203 (2014), 1502--1505.",
      "doi": ""
    },
    {
      "text": "C. A. E. Goodhart. 1984. Problems of Monetary Management: The UK Experience. Macmillan Education UK, London, 91--121.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg and Bill Buxton. 2008. Usability evaluation considered harmful (some of the time). In CHI '08: Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems. ACM, New York, NY, USA, 111--120.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Kasper Hornbæk, Søren S. Sander, Javier Andrés Bargas-Avila, and Jakob Grue Simonsen. 2014. Is Once Enough?: On the Extent and Content of Replications in Human-computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3523--3532.  ",
      "doi": "10.1145/2556288.2557004"
    },
    {
      "text": "George S. Howard, Scott E. Maxwell, and Kevin J. Fleming. 2000. The proof of the pudding: An illustration of the relative strengths of null hypothesis, meta-analysis, and Bayesian analysis. Psychological Methods 5, 3 (2000), 315 -- 332.",
      "doi": ""
    },
    {
      "text": "Andrew Howes, Benjamin R. Cowan, Christian P. Janssen, Anna L. Cox, Paul Cairns, Anthony J. Hornof, Stephen J. Payne, and Peter Pirolli. 2014. Interaction Science SIG: Overcoming Challenges. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1127--1130.  ",
      "doi": "10.1145/2559206.2559208"
    },
    {
      "text": "Macartan Humphreys, Raul Sanchez de la Sierra, and Peter van der Windt. 2013. Fishing, Commitment, and Communication: A Proposal for Comprehensive Nonbinding Research Registration. Political Analysis 21, 1 (2013), 1.",
      "doi": ""
    },
    {
      "text": "John P. A. Ioannidis. 2005. Why Most Published Research Findings Are False. PLOS Medicine 2, 8 (08 2005).",
      "doi": ""
    },
    {
      "text": "Leslie K. John, George Loewenstein, and Drazen Prelec. 2012. Measuring the Prevalence of Questionable Research Practices With Incentives for Truth Telling. Psychological Science 23, 5 (2012), 524--532. PMID: 22508865.",
      "doi": ""
    },
    {
      "text": "Valen E. Johnson. 2013. Revised standards for statistical evidence. Proceedings of the National Academy of Sciences 110, 48 (2013), 19313--19317.",
      "doi": ""
    },
    {
      "text": "Dickersin K and Rennie D. 2012. The evolution of trial registries and their use to assess the clinical trial enterprise. JAMA 307, 17 (2012), 1861--1864.",
      "doi": ""
    },
    {
      "text": "Robert M. Kaplan and Veronica L. Irvin. 2015. Likelihood of Null Effects of Large NHLBI Clinical Trials Has Increased over Time. PLOS ONE 10, 8 (08 2015), 1--12.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Steve Haroz, Shion Guha, and Pierre Dragicevic. 2016a. Special Interest Group on Transparent Statistics in HCI. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1081--1084.  ",
      "doi": "10.1145/2851581.2886442"
    },
    {
      "text": "Matthew Kay, Gregory L. Nelson, and Eric B. Hekler. 2016b. Researcher-Centered Design of Statistics: Why Bayesian Statistics Better Fit the Culture and Incentives of HCI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4521--4532.  ",
      "doi": "10.1145/2858036.2858465"
    },
    {
      "text": "Norbert L. Kerr. 1998. HARKing: Hypothesizing After the Results are Known. Personality & Social Psychology Review (Lawrence Erlbaum Associates) 2, 3 (1998), 196.",
      "doi": ""
    },
    {
      "text": "Don Lewis and C. J. Burke. 1949. The use and misuse of the chi-square test. Psychological Bulletin 46, 6 (1949), 433 -- 489. https://www.ncbi.nlm.nih.gov/pubmed/15392587",
      "doi": ""
    },
    {
      "text": "H Lieberman. 2002. The Tyranny of Evaluation. http://web.media.mit.edu/~lieber/Misc/ Tyranny-Evaluation.html. (2002). Last accessed: June 21, 2017.",
      "doi": ""
    },
    {
      "text": "Wendy E. Mackay, Caroline Appert, Michel Beaudouin-Lafon, Olivier Chapuis, Yangzhou Du, Jean-Daniel Fekete, and Yves Guiard. 2007. Touchstone: Exploratory Design of Experiments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1425--1434.  ",
      "doi": "10.1145/1240624.1240840"
    },
    {
      "text": "Michael E. J. Masson. 2011. A tutorial on a practical Bayesian alternative to null-hypothesis significance testing. Behavior Research Methods 43, 3 (2011), 679--690.",
      "doi": ""
    },
    {
      "text": "Bertrand Meyer. 2012. Incremental Research vs. Paradigm-shift Mania. Commun. ACM 55, 9 (Sept. 2012), 8--9.  ",
      "doi": "10.1145/2330667.2330670"
    },
    {
      "text": "James E. Monogan, III. 2013. A Case for Registering Studies of Political Outcomes: An Application in the 2010 House Elections. Political Analysis 21, 1 (2013), 21.",
      "doi": ""
    },
    {
      "text": "Robert Rosenthal. 1979. The file drawer problem and tolerance for null results. Psychological Bulletin 86, 3 (1979), 638 -- 641.",
      "doi": ""
    },
    {
      "text": "J. D. Scargle. 1999. Publication Bias (The \"File-Drawer Problem\") in Scientific Inference. ArXiv Physics e-prints (Sept. 1999). http://adsabs.harvard.edu/abs/1999physics...9033S",
      "doi": ""
    },
    {
      "text": "Theodore D. Sterling. 1959. Publication Decisions and their Possible Effects on Inferences Drawn from Tests of Significance - or Vice Versa. J. Amer. Statist. Assoc. 54, 285 (1959), 30--34.",
      "doi": ""
    },
    {
      "text": "David Trafimow and Michael Marks. 2015. Editorial. Basic and Applied Social Psychology 37, 1 (2015), 1--2.",
      "doi": ""
    },
    {
      "text": "Max L. L. Wilson, Paul Resnick, David Coyle, and Ed H. Chi. 2013. RepliCHI: The Workshop. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 3159--3162.  ",
      "doi": "10.1145/2468356.2479636"
    },
    {
      "text": "S Zhai. 2002. Evaluation is the worst form of HCI research except all those other forms that have been tried. www.shuminzhai.com/papers/EvaluationDemocracy.htm. (2002). Last accessed: June 21, 2017.",
      "doi": ""
    }
  ]
}