{
  "doi": "10.1145/3173574.3173627",
  "title": "\"We Are the Product\": Public Reactions to Online Data Sharing and Privacy Controversies in the Media",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "As online platforms increasingly collect large amounts of data about their users, there has been growing public concern about privacy around issues such as data sharing. Controversies around practices perceived as surprising or even unethical often highlight patterns of privacy attitudes when they spark conversation in the media. This paper examines public reaction \"in the wild\" to two data sharing controversies that were the focus of media attention-regarding the social media and communication services Facebook and WhatsApp, as well as the email service unroll.me. These controversies instigated discussion of data privacy and ethics, accessibility of website policies, notions of responsibility for privacy, cost-benefit analyses, and strategies for privacy management such as non-use. An analysis of reactions and interactions captured by comments on news articles not only reveals information about pervasive privacy attitudes, but also suggests communication and design strategies that could benefit both platforms and users.",
  "authors": [
    {
      "name": "Casey Fiesler",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81464672606/rel-imgonly/caseyfiesler.jpg",
      "acmid": "81464672606",
      "orcid": "missing"
    },
    {
      "name": "Blake Hallinan",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260831",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisiti and Ralph Gross. 2006. Imagined communities: awareness, information sharing, and privacy on the Facebook. Proceedings of the International Workshop on Privacy Enhancing Technologies: 36--58.  ",
      "doi": "10.1007/11957454_3"
    },
    {
      "text": "Julio Angulo. 2015. \"WTH..!?!\" Experiences, reactions, and expectations related to online privacy panic situations. Proceedings of the Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako, Jaeyeon Jung, Wei Lu, Lorrie Faith Cranor, and Carolyn Nguyen. 2013. ''Little brothers watching you'': raising awareness of data leaks on smartphones. Proceedings of the Symposium on Usable Privacy and Security (SOUPS).  ",
      "doi": "10.1145/2501604.2501616"
    },
    {
      "text": "Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, leaving, and (re)lapsing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI). 3257.  ",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Allan Bell. 1994. Media (mis)communication on the science of climate change. Public Understanding of Science 3, 3, 259--275.",
      "doi": ""
    },
    {
      "text": "Joseph Bonneau and Sören Preibusch. 2010. The privacy jungle: on the market for data protection in social networks. In Economics of Information Security and Privacy, Tyler Moore, David Pym and Christos Ioannidis (eds.). Springer International Publishing, London, UK, 121--167.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2, 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Juan Pablo Carrascal, Christopher Riederer, Vijay Erramilli, Mauro Cherubini, and Rodrigo de Oliveira. 2013. Your browsing behavior for a big mac: Economics of personal information online. Proceedings of the International Conference on World Wide Web (WWW).  ",
      "doi": "10.1145/2488388.2488406"
    },
    {
      "text": "Jennifer A. Chandler, Jeffrey A Sun, and Eric Racine. 2017. Online public reactions to fMRI communication with patients with disorders of consciousness?: Quality of life, end-of-life decision making, and concerns with misdiagnosis. AJOB Empirical Bioethics 8, 1, 40--51.",
      "doi": ""
    },
    {
      "text": "Ramón Compañó and Wainer Lusoli. 2010. The Policy Maker's Anguish: Regulating Personal Data Behavior Between Paradoxes and Dilemmas. In Economics of Information Security and Privacy, Tyler Moore, David Pym and Christos Ioannidis (eds.). Springer International Publishing, London, UK, 169--185.",
      "doi": ""
    },
    {
      "text": "Mary J. Culnan and Cynthia Clark Williams. 2009. How ethics can enhance organizational privacy: lessongs from the Choicepoint and TJX data breaches. MIS Quarterly 33, 4, 673--687. ",
      "doi": "10.5555/2017434.2017439"
    },
    {
      "text": "Kim Doyle. 2015. Facebook, WhatsApp and the commodification of affective labour. Communication Politics & Culture 48, 1, 51--65.",
      "doi": ""
    },
    {
      "text": "Catherine Dwyer. 2011. Privacy in the age of google and facebook. IEEE Technology and Society Magazine 30, 3, 58--63.",
      "doi": ""
    },
    {
      "text": "Ap Felt, Elizabeth Ha, Serge Egelman, and Ariel Haney. 2012. Android permissions: user attention, comprehension, and behavior. Proceedings of the Symposium on Usable Privacy and Security (SOUPS).  ",
      "doi": "10.1145/2335356.2335360"
    },
    {
      "text": "Casey Fiesler, Cliff Lampe, and Amy S. Bruckman. 2016. Reality and perception of copyright terms of service for online content creation. Proceedings of the ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW).  ",
      "doi": "10.1145/2818048.2819931"
    },
    {
      "text": "Emma L Giles, Matthew Holmes, Elaine McColl, Falko F Sniehotta, and Jean M Adams. 2015. Acceptability of financial incentives for breastfeeding: thematic analysis of readers' comments to UK online news reports. BMC Pregnancy and Childbirth 15, 1, 116.",
      "doi": ""
    },
    {
      "text": "Nicole Marie Glenn, Claudine C. Champion, and John C. Spence. 2012. Qualitative content analysis of online news media coverage of weight loss surgery and related reader comments. Clinical Obesity 2, 5--6, 125--131.",
      "doi": ""
    },
    {
      "text": "Timothy R. Graeff and Susan Harmon. 2002. Collecting and using personal data: consumers' awareness and concerns. Journal of Consumer Marketing 19, 4, 302--318.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Alice Marwick. 2016. \"What Can I Really Do?\" Explaining the Privacy Paradox with Online Apathy. International Journal of Communication 10, 3737--3757.",
      "doi": ""
    },
    {
      "text": "Jojo Hedaya. 2017. We Can Do Better. Unroll.me Blog. Retrieved April 23, 2017 from http://blog.unroll.me/we-can-do-better/",
      "doi": ""
    },
    {
      "text": "Natalie Henrich and Bev Holmes. 2013. Web news readers' comments: Towards developing a methodology for using on-line comments in social inquiry. Journal of Media and Communication Studies 5, 1, 1--4.",
      "doi": ""
    },
    {
      "text": "Avery Holton, Nayeon Lee, and Renita Coleman. 2014. Commenting on Health?: A Framing Analysis of User Comments in Response to Health Articles Online. 825--837.",
      "doi": ""
    },
    {
      "text": "Mike Isaac. 2017. Uber's CEO plays with fire. The New York Times. Retrieved from https://www.nytimes.com/2017/04/23/technology/tr avis-kalanick-pushes-uber-and-himself-to-theprecipice.html",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. \"My data just goes everywhere\": user mental models of the internet and implications for privacy and security. The Proceedings of the Symposium on Usable Privacy and Security (SOUPS), 39--52.",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Lucian Cesca, Joanna Bresee, and Lorrie Faith Cranor. 2010. Standardizing privacy notices: an online study of the nutrition label approach. The Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI), 1573--1582.  ",
      "doi": "10.1145/1753326.1753561"
    },
    {
      "text": "Patrick Gage Kelley, Lorrie Faith Cranor, and Norman Sadeh. 2013. Privacy as part of the app decision-making process. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI).  ",
      "doi": "10.1145/2470654.2466466"
    },
    {
      "text": "Joop De Kraker, Sacha Kuijs, Ron Cörvers, and Astrid Offermans. 2014. Internet public opinion on climate change: a world views analysis of online reader comments. International Journal of Climate Change Strategies and Management 6, 1, 19--33.",
      "doi": ""
    },
    {
      "text": "Airi Lampinen. 2010. Practices of balancing privacy and publicness in social network services. The Proceedings of the ACM International Conference on Supporting Group Work (GROUP), 343--344.  ",
      "doi": "10.1145/1880071.1880142"
    },
    {
      "text": "Pedro Giovanni Leon, Blase Ur, Yang Wang, et al. 2013. What matters to users?: factors that affect users' willingness to share information with online advertisers. Proceedings of the Symposium on Usable Privacy and Security (SOUPS).  ",
      "doi": "10.1145/2501604.2501611"
    },
    {
      "text": "Ilias Leontiadis, Christos Efstratiou, Marco Picone, and Cecilia Mascolo. 2012. Don't kill my ads! Balancing privacy in an ad-supported mobile application market. The Proceedings of Hotmobile 2012 13th ACM Sigmobile Workshop on Mobile Computing Systems and Applications, 2:1--2:6.  ",
      "doi": "10.1145/2162081.2162084"
    },
    {
      "text": "Jialiu Lin, Shahriyar Amini, Jason I. Hong, Norma Sadeh, Janne Lindqvist, and Joy Zhang. 2012. Expectation and purpose: understanding users' mental models of mobile app privacy through crowdsourcing. Proceedings of the ACM Conference on Pervasive and Ubiquitous Computing (UbiComp).  ",
      "doi": "10.1145/2370216.2370290"
    },
    {
      "text": "Edith Manosevitch and D Walker. 2009. Reader comments to online opinion journalism: a space of public deliberation. The Proceedings of the Symposium on Online Journalism 10, 1--30.",
      "doi": ""
    },
    {
      "text": "Helia Marreiros, Richard Gomer, Michael Vlassopoulos, and Mirco Tonin. 2015. Scared or naive? An exploratory study of users' perceptions of online privacy disclosures. IADIS International Journal of WWW/Internet 13, 2, 1--16.",
      "doi": ""
    },
    {
      "text": "Maxwell McCombs and Donald L. Shaw. 1972. The Agenda-Setting Function of Mass Media. Public Opinion Quarterly 36, 2, 176--187.",
      "doi": ""
    },
    {
      "text": "Aleecia M. Mcdonald and Lorrie Faith Cranor. 2008. The cost of reading privacy policies. I/S: A Journal of Law and Policy for the Information Society 4, 543--565.",
      "doi": ""
    },
    {
      "text": "Jessica Miller, Batya Friedman, Gavin Jancke, and Brian Gill. 2007. Value tensions in design: the value sensitive design, development, and appropriation of a corporation's groupware system. Proceedings of the ACM Conference on Supporting Group Work (GROUP), 281--290.  ",
      "doi": "10.1145/1316624.1316668"
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Washington Law Review 79, 101--139.",
      "doi": ""
    },
    {
      "text": "Jennifer A Pereira, Susan Quach, Huy Hao Dao, et al. 2013. Contagious Comments?: What Was the Online Buzz About the 2011 Quebec Measles Outbreak? PLoS One 8(5).",
      "doi": ""
    },
    {
      "text": "Chanda Phelan, Ann Arbor, and Paul Resnick. 2016. It's creepy, but it doesn't bother me. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI), 5372--5384.  ",
      "doi": "10.1145/2858036.2858381"
    },
    {
      "text": "Joseph Phelps, Glen Nowak, and Elizabeth Ferrell. 2000. Privacy concerns and consumer willingness to provide personal information. Journal of Public Policy & Marketing 19, 1, 27--41.",
      "doi": ""
    },
    {
      "text": "Lee Rainie, Aaron Smith, and Maeve Duggan. 2013. Coming and Going on Facebook. Pew Internet Center Research. Retrieved from http://pewinternet.org/Reports/2013/Coming-andgoing-on-facebook.aspx",
      "doi": ""
    },
    {
      "text": "Michel Schreiner and Thomas Hess. 2015. Examining the role of privacy in virtual migration: the case of WhatsApp and Threema. Proceedings of the 21st Americas Conference on Information Systems, 1--11.",
      "doi": ""
    },
    {
      "text": "Fuming Shih, Ilaria Liccardi, and Daniel Weitzner. 2015. Privacy tipping points in smartphones privacy preferences. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI), 807--816.  ",
      "doi": "10.1145/2702123.2702404"
    },
    {
      "text": "Irina Shklovski, Scott D Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and creepiness in app space: perceptions of privacy and mobile app use. Proceedings of the ACM conference on Human Factors in Computing Systems (CHI), 2347--2356.  ",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Irina Shklovski, Scott D Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and creepiness in app space: perceptions of privacy and mobile app use. Proceedings of the ACM conference on Human Factors in Computing Systems (CHI), 2347--2356.  ",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Judith Simon and Irina Shklovski. 2015. Lessening the Burden of Individualized Responsibility in the Socio-technical World. Proceedings of ISIS Summit - The Information Society at the Crossroads, 1--5. Retrieved from https://sciforum.net/conference/isissummit-vienna-2015/paper/2885/download/pdf",
      "doi": ""
    },
    {
      "text": "Stefan Stieger, Christoph Burger, Manuel Bohn, and Martin Voracek. 2013. Who commits virtual identity suicide? Differences in privacy concerns, Internet addiction, and personality between Facebook users and quitters. Cyberpsychology, Behavior, and Social Networking 16, 9, 629--634.",
      "doi": ""
    },
    {
      "text": "Marisa Torres. 2015. What do users have to say about online news comments? Readers ' accounts and expectations of public debate and online moderation?: a case study. Journal of Audience and Reception Studies 12(2), 32--44.",
      "doi": ""
    },
    {
      "text": "John Vines, Anja Thieme, Rob Comber, Mark Blythe, Peter Wright, and Patrick Olivier. 2013. HCI in the Press: Online Public Reactions to Mass Media Portrayals of HCI Research. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI).  ",
      "doi": "10.1145/2470654.2466247"
    },
    {
      "text": "Jessica Vitak, Katie Shilton, and Z. Ashktorab. 2016. Beyond the Belmont Principles: ethical challenges, practices, and beliefs in the online data research community. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW).  ",
      "doi": "10.1145/2818048.2820078"
    },
    {
      "text": "Laura C. Wilson, Alesha D. Ballman, and Theresa J. Buczek. 2015. News Content About Mass Shootings and Attitudes Toward Mental Illness. Journalism & Mass Communication Quarterly, 1-- 15.",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Xu Heng, Heather Lipford, and Emmanuel Bello-Ogunu. 2015. Facebook apps and tagging: the trade-off between personal privacy and engaging with friends. Journal of the Association for Information Science and Technology 66, 9, 1883--1896.  ",
      "doi": "10.1002/asi.23299"
    },
    {
      "text": "Pamela Wisniewski, A.K.M. Najmul Islam, Bart P Knijnenburg, and Sameer Patil. 2015. Give social network users the privacy they want. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW), 1427--1441.  ",
      "doi": "10.1145/2675133.2675256"
    },
    {
      "text": "Heng Xu, Tamara Dinev, Jeff Smith, and Paul Hart. 2011. Linking individual perceptions with institutional privacy assurances. Journal of the Association for Information Systems 12, 12, 798-- 824.",
      "doi": ""
    },
    {
      "text": "Rodrigo Zamith and Seth C. Lewis. 2014. From public spaces to public sphere. Digital Journalism 2, 4, 558--574.",
      "doi": ""
    }
  ]
}