{
  "doi": "10.1145/3173574.3173933",
  "title": "Geocaching with a Beam: Shared Outdoor Activities through a Telepresence Robot with 360 Degree Viewing",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "People often enjoy sharing outdoor activities together such as walking and hiking. However, when family and friends are separated by distance it can be difficult if not impossible to share such activities. We explore this design space by investigating the benefits and challenges of using a telepresence robot to support outdoor leisure activities. In our study, participants participated in the outdoor activity of geocaching where one person geocached with the help of a remote partner via a telepresence robot. We compared a wide field of view (WFOV) camera to a 360° camera. Results show the benefits of having a physical embodiment and a sense of immersion with the 360° view. Yet challenges related to a lack of environmental awareness, safety issues, and privacy concerns resulting from bystander interactions. These findings illustrate the need to design telepresence robots with the environment and public in mind to provide an enhanced sensory experience while balancing safety and privacy issues resulting from being amongst the general public.",
  "tags": [
    "geocaching",
    "video communication",
    "telepresence robots",
    "social presence",
    "leisure activities"
  ],
  "authors": [
    {
      "name": "Yasamin Heshmat",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440620776",
      "orcid": "missing"
    },
    {
      "name": "Brennan Jones",
      "institution": "Simon Fraser University & University of Calgary, Calgary, AB, Canada",
      "img": "/do/10.1145/contrib-87958805057/rel-imgonly/me.jpg",
      "acmid": "87958805057",
      "orcid": "missing"
    },
    {
      "name": "Xiaoxuan Xiong",
      "institution": "Hunan University, Changsha, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261962",
      "orcid": "missing"
    },
    {
      "name": "Carman Neustaedter",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of Calgary, Calgary, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Bernhard E. Riecke",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-81100113270/rel-imgonly/bernhardriecke-hikingstawamuschief_small.jpg",
      "acmid": "81100113270",
      "orcid": "missing"
    },
    {
      "name": "Lillian Yang",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161196",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Morgan G. Ames, Janet Go, Joseph 'Jofish' Kaye, and Mirjana Spasojevic. 2010. Making love in the network closet: the benefits and work of family videochat. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, New York, NY, USA, 145--154.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Uddipana Baishya and Carman Neustaedter. 2017. In Your Eyes: Anytime, Anywhere Video and Audio Streaming for Couples. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 84--97.  ",
      "doi": "10.1145/2998181.2998200"
    },
    {
      "text": "Frank Biocca, Chad Harms, and Jenn Gregg. 2001. The networked minds measure of social presence: Pilot test of the factor structure and concurrent validity. In 4th annual international workshop on presence, Philadelphia, PA, 1--9",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on shared experiences: moving beyond the camera in video communication. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 96--105.  ",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Xiang Cao, Abigail Sellen, A.J. Bernheim Brush, David Kirk, Darren Edge, and Xianghua Ding. 2010. Understanding family communication across time zones. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, New York, NY, USA, 155--158.  ",
      "doi": "10.1145/1718918.1718947"
    },
    {
      "text": "Munjal Desai, Katherine M. Tsui, Holly A. Yanco, and Chris Uhlik. 2011. Essential features of telepresence robots. In Technologies for Practical Robot Applications (TePRA), 2011 IEEE Conference on (pp. 15--20). IEEE.",
      "doi": ""
    },
    {
      "text": "Diana Fonseca and Martin Kraus. 2016. A comparison of head-mounted and hand-held displays for 360° videos with focus on attitude and behavior change. In Proceedings of the 20th International Academic Mindtrek Conference (AcademicMindtrek '16). ACM, New York, NY, USA, 287--296.  ",
      "doi": "10.1145/2994310.2994334"
    },
    {
      "text": "Azadeh Forghani, Gina Venolia, and Kori Inkpen. 2014. Media2gether: Sharing Media during a Call. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14). ACM, New York, NY, USA, 142--151.  ",
      "doi": "10.1145/2660398.2660417"
    },
    {
      "text": "Saul Greenberg, & Carman Neustaedter, (2013). Shared living, experiences, and intimacy over video chat in long distance relationships. In Connecting families(pp. 37--53). Springer London.",
      "doi": ""
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, Lillian Yang, and Thecla Schiphorst. 2017. Connecting Family Members Across Time Through Shared Media. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 2630--2637.  ",
      "doi": "10.1145/3027063.3053205"
    },
    {
      "text": "Kori Inkpen, Brett Taylor, Sasa Junuzovic, John Tang, and Gina Venolia. 2013. Experiences2Go: sharing kids' activities outside the home with remote family members. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 1329--1340.  ",
      "doi": "10.1145/2441776.2441926"
    },
    {
      "text": "Steven Johnson, Irene Rae, Bilge Mutlu, and Leila Takayama. 2015. Can You See Me Now?: How Field of View Affects Collaboration in Robotic Telepresence. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2397- 2406.  ",
      "doi": "10.1145/2702123.2702526"
    },
    {
      "text": "Brennan Jones, Kody Dillman, Richard Tang, Anthony Tang, Ehud Sharlin, Lora Oehlberg, Carman Neustaedter, and Scott Bateman. 2016. Elevating Communication, Collaboration, and Shared Experiences in Mobile Video through Drones. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 1123--1135.  ",
      "doi": "10.1145/2901790.2901847"
    },
    {
      "text": "Brennan Jones, Anna Witcraft, Scott Bateman, Carman Neustaedter, and Anthony Tang. 2015. Mechanics of Camera Work in Mobile Video Collaboration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 957--966.  ",
      "doi": "10.1145/2702123.2702345"
    },
    {
      "text": "Tejinder K. Judge and Carman Neustaedter. 2010. Sharing conversation and sharing life: video conferencing in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 655- 658.  ",
      "doi": "10.1145/1753326.1753422"
    },
    {
      "text": "Shunichi Kasahara, Shohei Nagai, and Jun Rekimoto. 2015. First Person Omnidirectional Video: System Design and Implications for Immersive Experience. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '15). ACM, New York, NY, USA, 33--42.  ",
      "doi": "10.1145/2745197.2745202"
    },
    {
      "text": "Shunichi Kasahara and Jun Rekimoto. 2015. JackIn head: immersive visual telepresence system with omnidirectional wearable camera for remote collaboration. In Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology (VRST '15), Stephen N. Spencer (Ed.). ACM, New York, NY, USA, 217--225.  ",
      "doi": "10.1145/2821592.2821608"
    },
    {
      "text": "Shunichi Kasahara and Jun Rekimoto. 2014. JackIn: integrating first-person view with out-of-body vision generation for human-human augmentation. In Proceedings of the 5th Augmented Human International Conference (AH '14). ACM, New York, NY, USA,, Article 46, 8 pages.  ",
      "doi": "10.1145/2582051.2582097"
    },
    {
      "text": "Seungwon Kim, Sasa Junuzovic, and Kori Inkpen. 2014. The Nomad and the Couch Potato: Enriching Mobile Shared Experiences with Contextual Information. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14). ACM, New York, NY, USA, 167--177.  ",
      "doi": "10.1145/2660398.2660409"
    },
    {
      "text": "Sven Kratz, Don Kimber, Weiqing Su, Gwen Gordon, and Don Severns. 2014. Polly: \"being there\" through the parrot and a guide. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (MobileHCI '14). ACM, New York, NY, USA, 625--630.  ",
      "doi": "10.1145/2628363.2628430"
    },
    {
      "text": "Min Kyung Lee and Leila Takayama. 2011. \"Now, I have a body\": uses and social norms for mobile remote presence in the workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 33- 42.  ",
      "doi": "10.1145/1978942.1978950"
    },
    {
      "text": "Florian 'Floyd' Mueller, Frank Vetere, Martin R. Gibbs, Stefan Agamanolis, and Jennifer Sheridan. 2010. Jogging over a distance: the influence Koof design in parallel exertion games. In Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games (Sandbox '10), Stephen N. Spencer (Ed.). ACM, New York, NY, USA, 63--68.  ",
      "doi": "10.1145/1836135.1836145"
    },
    {
      "text": "Florian Mueller, Frank Vetere, Martin R. Gibbs, Darren Edge, Stefan Agamanolis, and Jennifer G. Sheridan. 2010. Jogging over a distance between Europe and Australia. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, New York, NY, USA, 189--198.  ",
      "doi": "10.1145/1866029.1866062"
    },
    {
      "text": "Florian 'Floyd' Mueller, Shannon O'Brien, and Alex Thorogood. 2007. Jogging over a distance: supporting a \"jogging together\" experience although being apart. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, New York, NY, USA, 1989--1994.  ",
      "doi": "10.1145/1240866.1240937"
    },
    {
      "text": "Carman Neustaedter, Carolyn Pang, Azadeh Forghani, Erick Oduor, Serena Hillman, Tejinder K. Judge, Michael Massimi, and Saul Greenberg. 2015. Sharing Domestic Life through Long-Term Video Connections. ACM Trans. Comput.-Hum. Interact. 22, 1, Article 3 (February 2015), 29 pages.  ",
      "doi": "10.1145/2696869"
    },
    {
      "text": "Carman Neustaedter, Jason Procyk, Anezka Chua, Azadeh Forghani & Carolyn Pang. 2017. Mobile Video Conferencing for Sharing Outdoor Leisure Activities over Distance. Human--Computer Interaction, (justaccepted).",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter, Anthony Tang, and Tejinder K. Judge. 2013. Creating scalable location-based games: lessons from Geocaching. Personal Ubiquitous Comput. 17, 2 (February 2013), 335--349.  ",
      "doi": "10.1007/s00779-011-0497-7"
    },
    {
      "text": "Carman Neustaedter, Gina Venolia, Jason Procyk, and Daniel Hawkins. 2016. To Beam or Not to Beam: A Study of Remote Telepresence Attendance at an Academic Conference. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 418--431.  ",
      "doi": "10.1145/2818048.2819922"
    },
    {
      "text": "Shannon O'Brien and Florian \"Floyd\" Mueller. 2007. Jogging the distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 523- 526.  ",
      "doi": "10.1145/1240624.1240708"
    },
    {
      "text": "Kenton O'Hara. 2008. Understanding geocaching practices and motivations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1177- 1186.  ",
      "doi": "10.1145/1357054.1357239"
    },
    {
      "text": "Rui Pan, Samarth Singhal, Bernhard E. Riecke, Emily Cramer, and Carman Neustaedter. 2017. \"MyEyes\": The Design and Evaluation of First Person View Video Streaming for Long-Distance Couples. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 135- 146.  ",
      "doi": "10.1145/3064663.3064671"
    },
    {
      "text": "Jason Procyk, Carman Neustaedter, Carolyn Pang, Anthony Tang, and Tejinder K. Judge. 2014. Exploring video streaming in public settings: shared geocaching over distance using mobile video chat. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2163--2172.  ",
      "doi": "10.1145/2556288.2557198"
    },
    {
      "text": "Irene Rae, Bilge Mutlu, and Leila Takayama. 2014. Bodies in motion: mobility, presence, and task awareness in telepresence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2153- 2162.  ",
      "doi": "10.1145/2556288.2557047"
    },
    {
      "text": "Irene Rae and Carman Neustaedter. 2017. Robotic Telepresence at Scale. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 313- 324.  ",
      "doi": "10.1145/3025453.3025855"
    },
    {
      "text": "Irene Rae, Leila Takayama, and Bilge Mutlu. 2013. Inbody experiences: embodiment, control, and trust in robot-mediated communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1921- 1930.  ",
      "doi": "10.1145/2470654.2466253"
    },
    {
      "text": "Irene Rae, Gina Venolia, John C. Tang, and David Molnar. 2015. A Framework for Understanding and Designing Telepresence. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1552--1566.  ",
      "doi": "10.1145/2675133.2675141"
    },
    {
      "text": "Pericle Salvini, Cecilia Laschi, and Paolo Dario (2010). Design for acceptability: improving robots' coexistence in human society. International journal of social robotics, 2(4), 451--460.",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, Thecla Schiphorst, Anthony Tang, Abhisekh Patra, and Rui Pan. 2016. You are Being Watched: Bystanders' Perspective on the Use of Camera Devices in Public Spaces. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3197--3203.  ",
      "doi": "10.1145/2851581.2892522"
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, Yee Loong Ooi, Alissa N. Antle, and Brendan Matkin. 2017. Flex-NFeel: The Design and Evaluation of Emotive Gloves for Couples to Support Touch Over Distance. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 98--110.  ",
      "doi": "10.1145/2998181.2998247"
    },
    {
      "text": "Anthony Tang, Omid Fakourfar, Carman Neustaedter, and Scott Bateman. 2017. Collaboration with 360° Videochat: Challenges and Opportunities. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 1327--1339.  ",
      "doi": "10.1145/3064663.3064707"
    },
    {
      "text": "Lillian Yang, Carman Neustaedter, and Thecla Schiphorst. 2017. Communicating Through A Telepresence Robot: A Study of Long Distance Relationships. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 3027--3033.  ",
      "doi": "10.1145/3027063.3053240"
    }
  ]
}