{
  "doi": "10.1145/3173574.3174195",
  "title": "Playing to Wait: A Taxonomy of Idle Games",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2018,
  "badges": [],
  "abstract": "Idle games are a recent minimalist gaming phenomenon in which the game is left running with little player interaction. We deepen understanding of idle games and their characteristics by developing a taxonomy and identifying game features. This paper examines 66 idle games using a grounded theory approach to analyze play, game mechanics, rewards, interactivity, progress rate, and user interface. To establish a clearly bounded definition of idle games, we analyzed 10 non-idle games with the same approach. We discuss how idle games move players from playing to planning, how they question dominant assumptions about gameplay, and their unusual use of resources such as player attention and computer cycles. Our work illuminates opportunities for the design of idle games, suggests design implications, and provides a framework for researchers to clearly articulate questions about this genre.",
  "authors": [
    {
      "name": "Sultan A. Alharthi",
      "institution": "New Mexico State University, Las Cruces, NM, USA",
      "img": "/do/10.1145/contrib-99659078789/rel-imgonly/sultanclu.jpg",
      "acmid": "99659078789",
      "orcid": "missing"
    },
    {
      "name": "Olaa Alsaedi",
      "institution": "New Mexico State University, Las Cruces, NM, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659023473",
      "orcid": "missing"
    },
    {
      "name": "Zachary O. Toups",
      "institution": "New Mexico State University, Las Cruces, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309499161",
      "orcid": "missing"
    },
    {
      "name": "Theresa Jean Tanenbaum",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81388594272/rel-imgonly/20210704_104248.jpg",
      "acmid": "81388594272",
      "orcid": "missing"
    },
    {
      "name": "Jessica Hammer",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658650866",
      "orcid": "0000-0003-4102-2575"
    }
  ],
  "references": [
    {
      "text": "Espen Aarseth, Solveig Marie Smedstad, and Lise Sunnanå. 2003. A multidimensional typology of games. In DiGRA - Proceedings of the 2003 DiGRA International Conference: Level Up. 48--53.",
      "doi": ""
    },
    {
      "text": "Ernest Adams and Joris Dormans. 2012. Game Mechanics: Advanced Game Design (1st ed.). New Riders Publishing, Thousand Oaks, CA, USA. ",
      "doi": "10.5555/2385822"
    },
    {
      "text": "George Allan. 2003. A Critique of using Grounded Theory as a Research Method. Electronic Journal of Business Research Methods 2, 1 (2003), 1--10.",
      "doi": ""
    },
    {
      "text": "Thomas H. Apperley. 2006. Genre and game studies: Toward a critical approach to video game genres. Simulation & Gaming 37, 1 (2006), 6--23.  ",
      "doi": "10.1177/1046878105282278"
    },
    {
      "text": "ATLAS.ti Scientific Software Development GmbH. 2017. ATLAS.ti Mac. (2017). http://atlasti.com/product/mac-os-edition/.",
      "doi": ""
    },
    {
      "text": "Nadia Bianchi-Berthouze. 2013. Understanding the Role of Body Movement in Player Engagement. Human-Computer Interaction 28, 1 (2013), 40--75.",
      "doi": ""
    },
    {
      "text": "Staffan Björk and Jesper Juul. 2012. Zero-Player Games Or: What We Talk about When We Talk about Players. (2012). http://www.jesperjuul.net/text/zeroplayergames/.",
      "doi": ""
    },
    {
      "text": "Blizzard Entertainment. 2004. World of Warcraft. Game {OSX}. (November 2004). Blizzard Entertainment, Irvine, California, USA.",
      "doi": ""
    },
    {
      "text": "Ian Bogost. 2016. Play Anything: The Pleasure of Limits, the Uses of Boredom, & the Secret of Games. Basic Books.",
      "doi": ""
    },
    {
      "text": "A. J. Allen Bostian and Charles A. Holt. 2013. Veconlab Classroom Clicker Games: The Wisdom of Crowds and the Winner's Curse. The Journal of Economic Education 44, 3 (2013), 217--229.",
      "doi": ""
    },
    {
      "text": "Erik Brynjolfsson, Yu Jeffrey Hu, and Michael D. Smith. 2006. From niches to riches: Anatomy of the long tail. Sloan Management Review 47, 4 (Summer 2006), 67--71.",
      "doi": ""
    },
    {
      "text": "Roger Caillois. 1961. Man, Play, and Games. Thames & Hudson.",
      "doi": ""
    },
    {
      "text": "Marcus Carter, Bjorn Nansen, and Martin R. Gibbs. 2014. Screen Ecologies, Multi-gaming and Designing for Different Registers of Engagement. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, New York, NY, USA, 37--46.  ",
      "doi": "10.1145/2658537.2658686"
    },
    {
      "text": "Jacob Cohen. 1968. Weighted kappa: Nominal scale agreement provision for scaled disagreement or partial credit. Psychological bulletin 70, 4 (1968), 213.",
      "doi": ""
    },
    {
      "text": "David L. Craddock. 2015. Dungeon Hacks: How NetHack, Angband, and Other Roguelikes Changed the Course of Video Games. Press Start Press, Canton, Ohio, USA.",
      "doi": ""
    },
    {
      "text": "Chris Crawford. 1984. The Art of Computer Game Design. Osborne/McGraw-Hill, Berkeley, CA, USA. ",
      "doi": "10.5555/538111"
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1997. Finding flow: The psychology of engagement with everyday life. Basic Books.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding. 2016. Progress Wars: Idle Games and the Demarcation of \"Real\" Games. In DiGRA/FDG #3916 - Abstract Proceedings of the First International Joint Conference of DiGRA and FDG. Digital Games Research Association and Society for the Advancement of the Science of Digital Games, Dundee, Scotland.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From Game Design Elements to Gamefulness: Defining \"Gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, New York, NY, USA, 9--15.  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Christian Elverdam and Espen Aarseth. 2007. Game Classification and Game Design: Construction Through Critical Analysis. Games and Culture 2, 1 (2007), 3--22.",
      "doi": ""
    },
    {
      "text": "Mark Eyles and Roger Eglin. 2008. Ambient Games, Revealing a Route to a World Where Work is Play? Int. J. Comput. Games Technol. 2008 (Jan. 2008), 7:1--7:7.  ",
      "doi": "10.1155/2008/176056"
    },
    {
      "text": "Giant Bomb Wiki. 2015. New Game Plus. (September 2015). https://www.giantbomb.com/new-game-plus/3015--150/.",
      "doi": ""
    },
    {
      "text": "Barney G. Glaser. 1978. Theoretical sensitivity: Advances in the methodology of grounded theory. Sociology Pr.",
      "doi": ""
    },
    {
      "text": "Barney G. Glaser. 1998. Doing grounded theory: Issues and discussions. Sociology Press.",
      "doi": ""
    },
    {
      "text": "Barney G. Glaser and Anselm L. Strauss. 2009. The discovery of grounded theory: Strategies for qualitative research. Transaction publishers.",
      "doi": ""
    },
    {
      "text": "Joyce Goggin. 2011. Playbour, farming and labour. Ephemera: Theory and Politics in Organization 11, 4 (2011), 357--368.",
      "doi": ""
    },
    {
      "text": "Daniel Goldberg and Linus Larsson (Eds.). 2015. The State of Play: Creators and Critics on Video Game Culture. Seven Stories Press.",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Christianne Rooke, Andy Cockburn, Regan L. Mandryk, and Benjamin Lafreniere. 2016. Peak-End Effects on Player Experience in Casual Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5608--5619.  ",
      "doi": "10.1145/2858036.2858419"
    },
    {
      "text": "Kilem Li Gwet. 2014. Handbook of inter-rater reliability: The definitive guide to measuring the extent of agreement among rater. Advanced Analytics, LLC, Gaithersburg, MD, USA.",
      "doi": ""
    },
    {
      "text": "Alison Harvey. 2014. Twine's revolution: Democratization, depoliticization, and the queering of game design. G| A| M| E Games as Art, Media, Entertainment 1, 3 (2014).",
      "doi": ""
    },
    {
      "text": "Rashina Hoda, James Noble, and Stuart Marshall. 2011. Grounded Theory for Geeks. In Proceedings of the 18th Conference on Pattern Languages of Programs (PLoP '11). ACM, New York, NY, USA, 24:1--24:17.  ",
      "doi": "10.1145/2578903.2579162"
    },
    {
      "text": "Mikael Jakobsson. 2011. The achievement machine: Understanding Xbox 360 achievements in gaming practices. Game Studies 11, 1 (2011), 1--22.",
      "doi": ""
    },
    {
      "text": "Friedhoff Jane. 2014. Untangling Twine: A Platform Study. In DiGRA #3913 - Proceedings of the 2013 DiGRA International Conference: DeFragging Game Studies.",
      "doi": ""
    },
    {
      "text": "Eric Jordan. 2016. Why idle/clicker games will have more impact than virtual reality. (February 2016). http://www.develop-online.net/opinions/why-idleclicker-games-will-have-more-impact-than-virtualreality/0216911.",
      "doi": ""
    },
    {
      "text": "Jesper Juul. 2010. A casual revolution: Reinventing video games and their players. MIT Press. ",
      "doi": "10.5555/1667100"
    },
    {
      "text": "Jesper Juul and Rasmus Keldorff. 2010. Well Played 2.0. Springer-Verlag, Berlin, Heidelberg, Chapter Depth in One Minute: A Conversation About Bejeweled Blitz, 196--211. ",
      "doi": "10.5555/1980722.1980737"
    },
    {
      "text": "Brendan Keogh and Ingrid Richardson. 2017. Waiting to play: The labour of background games. European Journal of Cultural Studies (2017).",
      "doi": ""
    },
    {
      "text": "Joey J. Lee and Jessica Hammer. 2011. Gamification in education: What, how, why bother? Academic Exchange Quarterly 15, 2 (2011), 146.",
      "doi": ""
    },
    {
      "text": "Chris Lewis, Noah Wardrip-Fruin, and Jim Whitehead. 2012. Motivational Game Design Patterns of 'Ville Games. In Proceedings of the International Conference on the Foundations of Digital Games (FDG '12). ACM, New York, NY, USA, 172--179.  ",
      "doi": "10.1145/2282338.2282373"
    },
    {
      "text": "Thorey Mariusdottir, Vadim Bulitko, and Matthew Brown. 2015. Maximizing Flow as a Metacontrol in Angband. In The Eleventh AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment (AIIDE-15).",
      "doi": ""
    },
    {
      "text": "Maxis. 2003. SimCity 4. Game {Windows}. (January 2003). EA Games, Redwood City, California.",
      "doi": ""
    },
    {
      "text": "Markus Montola, Jaakko Stenros, and Annika Waern. 2009. Pervasive Games: Theory and Design. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA. ",
      "doi": "10.5555/1717294"
    },
    {
      "text": "Florian 'Floyd' Mueller, Martin R. Gibbs, and Frank Vetere. 2008. Taxonomy of Exertion Games. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (OZCHI '08). ACM, New York, NY, USA, 263--266.  ",
      "doi": "10.1145/1517744.1517772"
    },
    {
      "text": "David Myers. 1990. Computer games genres. Play & Culture 3, 4 (1990), 286--301.",
      "doi": ""
    },
    {
      "text": "Viknashvaran Narayanasamy, Kok Wai Wong, Chun Che Fung, and Shri Rai. 2006. Distinguishing Games and Simulation Games from Simulators. Comput. Entertain. 4, 2 (April 2006).  ",
      "doi": "10.1145/1129006.1129021"
    },
    {
      "text": "Oxford English Dictionary. 2017. \"derivative, adj. and n.\". Dictionary Definition. (June 2017). Retrieved September 12, 2017 from www.oed.com/view/Entry/50609.",
      "doi": ""
    },
    {
      "text": "Janne Paavilainen, Juho Hamari, Jaakko Stenros, and Jani Kinnunen. 2013. Social Network Games: Players' Perspectives. Simulation & Gaming 44, 6 (2013), 794--820.  ",
      "doi": "10.1177/1046878113514808"
    },
    {
      "text": "Anthony Pecorella. 2016a. The Math of Idle Games, Part I. (October 2016). http://blog.kongregate.com/the-mathof-idle-games-part-i/.",
      "doi": ""
    },
    {
      "text": "Anthony Pecorella. 2016b. The Math of Idle Games, Part II. (October 2016). http://blog.kongregate.com/the-mathof-idle-games-part-ii/.",
      "doi": ""
    },
    {
      "text": "Blair Purkiss and Imran Khaliq. 2015. A study of interaction in idle games & perceptions on the definition of a game. In 2015 IEEE Games Entertainment Media Conference (GEM). 1--6.",
      "doi": ""
    },
    {
      "text": "Scott C. Richmond. 2015. Vulgar Boredom, or What Andy Warhol Can Teach Us about Candy Crush. Journal of Visual Culture 14, 1 (2015), 21--39.",
      "doi": ""
    },
    {
      "text": "Evan F. Risko and Sam J. Gilbert. 2016. Cognitive Offloading. Trends in Cognitive Sciences 20, 9 (2016), 676 -- 688.",
      "doi": ""
    },
    {
      "text": "Andrew Rollings and Ernest Adams. 2003. Andrew Rollings and Ernest Adams on Game Design. New Riders Games. ",
      "doi": "10.5555/1213088"
    },
    {
      "text": "Paolo Ruffino. 2016. Games to Live With. Digital Culture & Society 2, 1 (2016), 153--160.",
      "doi": ""
    },
    {
      "text": "Katie Salen and Eric Zimmerman. 2004. Rules of Play: Game Design Fundamentals. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/1215723"
    },
    {
      "text": "Katie Salen and Eric Zimmerman. 2005. The Game Design Reader: A Rules of Play Anthology. The MIT Press. ",
      "doi": "10.5555/1076617"
    },
    {
      "text": "Ian Schreiber. 2009. Level 3: Formal Elements of Games. (July 2009). https://gamedesignconcepts.wordpress.com/ 2009/07/06/level-3-formal-elements-of-games/.",
      "doi": ""
    },
    {
      "text": "David Stark. 2014. So you want to make an incremental game? (January 2014). http://dhmholley.co.uk/incrementals.html.",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum and Jim Bizzocchi. 2009. Rock Band: A Case Study in the Design of Embodied Interface Experience. In Proceedings of the 2009 ACM SIGGRAPH Symposium on Video Games (Sandbox '09). ACM, New York, NY, USA, 127--134. ",
      "doi": "10.1145/1581073.1581093"
    },
    {
      "text": "Jason Tanz. 2011. The curse of Cow Clicker: how a cheeky satire became a videogame hit. (December 2011). https://www.wired.com/2011/12/ff_cowclicker/.",
      "doi": ""
    },
    {
      "text": "thatgamecompany. 2012. Journey. Game {PS3}. (March 2012). Sony Computer Entertainment, San Mateo, California.",
      "doi": ""
    },
    {
      "text": "The Noob Company. 2010. TheNoobBot. (2010). http://thenoobbot.com.",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, and Steve Benford. 2008. \"Are You Watching This Film or What?\": Interruption and the Juggling of Cohorts. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, New York, NY, USA, 257--266.  ",
      "doi": "10.1145/1460563.1460605"
    },
    {
      "text": "Bill Tomlinson, Juliet Norton, Eric P. S. Baumer, Marcel Pufal, and Barath Raghavan. 2015. Self-obviating systems and their application to sustainability. iConference 2015 Proceedings (2015).",
      "doi": ""
    },
    {
      "text": "Zachary O. Toups, Nicole K. Crenshaw, Rina R. Wehbe, Gustavo F. Tondello, and Lennart E. Nacke. 2016a. \"The Collecting Itself Feels Good\": Towards Collection Interfaces for Digital Game Objects. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 276--290.  ",
      "doi": "10.1145/2967934.2968088"
    },
    {
      "text": "Zachary O. Toups, William A. Hamilton, and Sultan A. Alharthi. 2016b. Playing at Planning: Game Design Patterns from Disaster Response Practice. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 362--375.  ",
      "doi": "10.1145/2967934.2968089"
    },
    {
      "text": "Deborah P. Vossen. 2004. The Nature and Classification of Games. Avante 10, 1 (2004), 53--68.",
      "doi": ""
    },
    {
      "text": "Mark Weiser and John Seely Brown. 1995. Designing Calm Technology. (1995). http://www.ubiq.com/weiser/calmtech/calmtech.htm.",
      "doi": ""
    },
    {
      "text": "A. P. White. 1995. Angband Borg. (January 1995). www.innovapain.com/borg/.",
      "doi": ""
    },
    {
      "text": "Nick Yee. 2016. The Surprising Profile of Idle Clicker Gamers. (July 2016). http://quanticfoundry.com/2016/07/06/idle-clickers/.",
      "doi": ""
    },
    {
      "text": "Zynga. 2009. Farmville. Game {Flash}. (June 2009). Zynga, San Francisco, California, USA.",
      "doi": ""
    }
  ]
}