{
  "doi": "10.1145/3173574.3173896",
  "title": "Parody in Place: Exposing Socio-spatial Exclusions in Data-Driven Maps with Design Parody",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "This paper describes the development of Parody in Place, a design parody that depicts Seattle neighborhoods with typographic arrangements derived from data generated by technology platforms such as Yelp and Zillow. The project invites inquiry into what technology corporations make matter and where, in ways that challenge the neutrality of neighborhood-based data. We designed the subject of our parody, a mock company called Dork Posters, to explore how the modes of parody by which the system operates expose socio-spatial exclusions both contested and propagated by digital platforms. Our interventions reveal shifts in response toward mapping techniques, from ambivalence to curiosity. We used Dork Posters to question reductionist techniques of data aggregation and ad hoc theories of data provenance. Our engagements also prompted reflection on the politics of measurement: how data sources shape result- ing insights and valuations. We end by discussing possibilities for expanding the design research program within human-computer interaction through parody.",
  "authors": [
    {
      "name": "Sarah E. Fox",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758668257",
      "orcid": "0000-0002-7888-2598"
    },
    {
      "name": "Meredith Lampe",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261133",
      "orcid": "missing"
    },
    {
      "name": "Daniela K. Rosner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    }
  ],
  "references": [
    {
      "text": "Ahmed Ansari, Danah Abdulla, Ece Canli, Mahmoud Keshavarz, Matthew Kiem, Pedro Oliveira, Luiza Prado, and Tristan Schultz. 2016. Editorial Statement -- Decolonising Design. Decolonising Design. Retrieved September 18, 2017 from http://www.decolonisingdesign.com/statements/2016/e ditorial/",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames. 2015. Charismatic Technology. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (AA '15), 109--120.  ",
      "doi": "10.7146/aahcc.v1i1.21199"
    },
    {
      "text": "M. Mikhail Mikhailovich Bakhtin and Caryl Emerson. 1993. Problems of Dostoevsky's Poetics. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Erica C. Barnett. 2013. The Good News, and Bad, About Car2Go. Seattle Met. Retrieved September 18, 2017 from https://www.seattlemet.com/articles/2013/2/4/car2go",
      "doi": ""
    },
    {
      "text": "Julian Bleeker. 2009. Design Fiction: A Short Essay on Design, Science, Fact and Fiction. Near Future Laboratory.",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2014. Research Through Design Fiction: Narrative in Real and Imaginary Abstracts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 703--712.  ",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-Solutionist Strategies: Seriously Silly Design Fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4968--4978.  ",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Geoffrey C. Bowker and Susan Leigh Star. 2000. Sorting Things Out: Classification and Its Consequences. The MIT Press, Cambridge, Mass. ",
      "doi": "10.5555/380681"
    },
    {
      "text": "Andrew Boyd and Dave Oswald Mitchell (eds.). 2012. Beautiful Trouble: A Toolbox for Revolution. OR Books, New York.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide through Qualitative Analysis. SAGE Publications Ltd, London?; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Sebastian Cobarrubias and Maribel Casas-Cortes. 2007. Drawing Escape Tunnels through Borders: Cartographic Research Experiments by European Social Movements. In An Atlas of Radical Cartography, Lize Mogel and Alexis Bhagat (eds.). Journal of Aesthetics and Protest Press, 51--66.",
      "doi": ""
    },
    {
      "text": "Kate Crawford. 2015. Can an Algorithm be Agonistic? Ten Scenes from Life in Calculated Publics. ResearchGate 41, 1.",
      "doi": ""
    },
    {
      "text": "Guy Debord. 1958. Theory of the Dérive. In Internationale Situationniste 2. 50--54.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf and Daniela K. Rosner. 2015. Reimagining Digital Fabrication As Performance Art. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 555--566.  ",
      "doi": "10.1145/2702613.2732507"
    },
    {
      "text": "Fernando Domínguez Rubio and Luis Fogué. 2015. What Is Cosmopolitical Design? Design, Nature and the Built Environment. In Unfolding the political capacities of design, Albena Yaneva and Alejandro Zaera-Polo (eds.). Farnham: Ashgate. Retrieved September 18, 2017 from http://abacus.universidadeuropea.es/handle/11268/594",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2006. Re-space-ing Place: \"Place\" and \"Space\" Ten Years on. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06), 299--308.  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2001. Design Noir: The Secret Life of Electronic Objects. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything: Design, Fiction, and Social Dreaming. The MIT Press, Cambridge, Massachusetts?; London. ",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Max Eastman. 2009. Enjoyment of Laughter. Routledge, New Brunswick, N.J.",
      "doi": ""
    },
    {
      "text": "J. Evans, D. Hemment, T. Humphries, and M. Raento. 2006. Loca: Set To Discoverable. Retrieved from http://loca- lab.org/index.html",
      "doi": ""
    },
    {
      "text": "Marc Fisher. 2008. Cool Poster, But Where's Barnaby Woods? - Raw Fisher. The Washington Post. Retrieved September 18, 2017 from http://voices.washingtonpost.com/rawfisher/2008/12/c ool_poster_but_wheres_barnaby.html",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 2012. The Order of Things: An Archaeology of Human Sciences. Knopf Doubleday Publishing Group.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2002. Designing for Homo Ludens. I3 Magazine 12.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What Should We Expect from Research Through Design? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. Feminist Studies 14, 3: 575.",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 2016. Staying with the Trouble: Making Kin in the Chthulucene. Duke University Press Books, Durham.",
      "doi": ""
    },
    {
      "text": "Marti A. Hearst. 2008. What's Up with Tag Clouds? Visual Business Intelligence Newsletter, 1--5.",
      "doi": ""
    },
    {
      "text": "Marti A. Hearst and Daniela Rosner. 2008. Tag Clouds: Data Analysis Tool or Social Signaller? In Proceedings of the Proceedings of the 41st Annual Hawaii International Conference on System Sciences (HICSS '08), 160--.  ",
      "doi": "10.1109/HICSS.2008.422"
    },
    {
      "text": "Felix Heibeck, Alexis Hope, and Julie Legault. 2014. Sensory Fiction: A Design Fiction of Emotional Computation. In Proceedings of the 2Nd ACM International Workshop on Immersive Media Experiences (ImmersiveMe '14), 35--40.  ",
      "doi": "10.1145/2660579.2660585"
    },
    {
      "text": "Linda Hutcheon. 1985. A Theory of Parody: The Teachings of Twentieth-century Art Forms. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Miwa Ikemiya and Daniela K. Rosner. 2014. Broken Probes: Toward the Design of Worn Media. Personal Ubiquitous Comput. 18, 3: 671--683.  ",
      "doi": "10.1007/s00779-013-0690-y"
    },
    {
      "text": "Institute for Applied Autonomy. 2007. Tactical Cartographies. In An Atlas of Radical Cartography, Lize Mogel and Alexis Bhagat (eds.). Journal of Aesthetics & Protest Press.",
      "doi": ""
    },
    {
      "text": "Vera Khovanskaya, Maria Bezaitis, and Phoebe Sengers. 2016. The Case of the Strangerationist: Reinterpreting Critical Technical Practice. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 134--145.  ",
      "doi": "10.1145/2901790.2901860"
    },
    {
      "text": "Bence Kollanyi, Philip N. Howard, and Samuel C. Woolley. 2016. Bots and Automation over Twitter during the First U.S. Presidential Debate. Oxford, U.K.",
      "doi": ""
    },
    {
      "text": "Agnieszka Leszczynski. 2016. Speculative futures: Cities, data, and governance beyond smart urbanism.",
      "doi": ""
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2016. Pushing the Limits of Design Fiction: The Case For Fictional Research Papers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4032--4043.  ",
      "doi": "10.1145/2858036.2858446"
    },
    {
      "text": "Siân E. Lindley, Anja Thieme, Alex S. Taylor, Vasilis Vlachokyriakos, Tim Regan, and David Sweeney. 2017. Surfacing Small Worlds Through Data-In-Place. Comput. Supported Coop. Work 26, 1--2: 135--163.  ",
      "doi": "10.1007/s10606-017-9263-3"
    },
    {
      "text": "Doreen Massey. 2009. Concepts of space and power in theory and in political practice. Documents d'anàlisi geogràfica, 55: 015--026.",
      "doi": ""
    },
    {
      "text": "Doreen B. Massey. 2005. For Space. SAGE Publications Ltd, London?; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Rebekah Modrak. 2015. Learning to talk like an urban woodsman: an artistic intervention. Consumption Markets & Culture 18, 6: 539--558.",
      "doi": ""
    },
    {
      "text": "Lize Mogel and Alexis Bhagat (eds.). 2007. An Atlas of Radical Cartography. Journal of Aesthetics & Protest Press.",
      "doi": ""
    },
    {
      "text": "Thomas Nagel. 1989. The View From Nowhere. Oxford University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Gina Neff. 2015. Venture Labor: Work and the Burden of Risk in Innovative Industries. The MIT Press, Cambridge, Mass. ",
      "doi": "10.5555/2789319"
    },
    {
      "text": "Helen Nissenbaum. 2011. A Contextual Approach to Privacy Online. Daedalus 140, 4: 32--48.",
      "doi": ""
    },
    {
      "text": "Samir Passi and Steven Jackson. 2017. Data Vision: Learning to See Through Algorithmic Abstraction. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 2436--2447.  ",
      "doi": "10.1145/2998181.2998331"
    },
    {
      "text": "Alyssa Pereira. 2015. Hilarious Airbnb sign parodies mock \"tone-deaf\" ads around San Francisco. SFGate. Retrieved September 18, 2017 from http://www.sfgate.com/living/article/These-Airbnbsign-parodies-mock-tone-deaf-ads-6584635.php",
      "doi": ""
    },
    {
      "text": "Kathleen H. Pine and Max Liboiron. 2015. The Politics of Measurement and Action. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3147--3156.  ",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Luiza Prado de O. Martins. 2014. Privilege and Oppression: Towards a Feminist Speculative Design. In Proceedings of the Design Research Society Conference, 980--990.",
      "doi": ""
    },
    {
      "text": "Rita Raley. 2009. Tactical Media. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "David Ribes and Steven J. Jackson. 2013. Data Bite Man: The Work of Sustaining a Long-Term Study. In Raw Data Is an Oxymoron, Lisa Gitelman (ed.). MIT Press.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner. 2018. Critical Fabulations: Reworking the Methods and Margins of Design. The MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner and Kimiko Ryokai. 2009. Reflections on Craft: Probing the Creative Process of Everyday Knitters. In Proceedings of the Seventh ACM Conference on Creativity and Cognition (C&C '09), 195-- 204.  ",
      "doi": "10.1145/1640233.1640264"
    },
    {
      "text": "Daniela K. Rosner, Hidekazu Saegusa, Jeremy Friedland, and Allison Chambliss. 2015. Walking by Drawing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 397--406.  ",
      "doi": "10.1145/2702123.2702467"
    },
    {
      "text": "Seattle Times staff. 2010. Seattle's Rainier Valley, one of America's \"Dynamic Neighborhoods.\" The Seattle Times. Retrieved April 27, 2017 from http://www.seattletimes.com/opinion/seattles-rainiervalley-one-of-americas-dynamic-neighborhoods/",
      "doi": ""
    },
    {
      "text": "Nick Seaver. 2013. Knowing Algorithms. Media in Transition 8.",
      "doi": ""
    },
    {
      "text": "Mark Shepard. 2007. The Tactical Sound Garden. Retrieved from http://www.leoalmanac.org/gallery/locative/tsg",
      "doi": ""
    },
    {
      "text": "Catherine Silva. 2009. Racial Restrictive Covenants: Enforcing Neighborhood Segregation in Seattle. University of Washington. Retrieved from https://depts.washington.edu/civilr/covenants_report.ht m",
      "doi": ""
    },
    {
      "text": "Jen Southern. 2004. Surface Patterns: Audio Tours. Retrieved from http://www.theportable.tv/audiotours.html",
      "doi": ""
    },
    {
      "text": "Bruce Sterling. 2005. Shaping Things. The MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Bruce Sterling. 2009. Design Fiction. interactions 16, 20--24.  ",
      "doi": "10.1145/1516016.1516021"
    },
    {
      "text": "Marilyn Strathern. 1990. The Gender of the Gift: Problems with Women and Problems with Society in Melanesia. University of California Press, Berkeley, Calif.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2006. Human-Machine Reconfigurations: Plans and Situated Actions. Cambridge University Press, Cambridge?; New York. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Fernanda B. Viégas and Martin Wattenberg. 2008. TIMELINES: Tag Clouds and the Case for Vernacular Visualization. interactions 15, 4: 49--52.  ",
      "doi": "10.1145/1374489.1374501"
    },
    {
      "text": "Leslie Weisman. 1994. Discrimination by Design: A Feminist Critique of the Man-Made Environment. University of Illinois Press, Urbana.",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Thecla Schiphorst, and Sietske Klooster. 2011. Move to Design/Design to Move: A Conversation About Designing for the Body. interactions 18, 4: 22--27.  ",
      "doi": "10.1145/1978822.1978828"
    },
    {
      "text": "Yeonsu Yu and Tek-Jin Nam. 2014. Let's Giggle!: Design Principles for Humorous Products. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14), 275--284.  ",
      "doi": "10.1145/2598510.2598557"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design As a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "2013. Car2Go West Seattle expansion: The map, and the 1st vote. West Seattle Blog... Retrieved September 18, 2017 from http://westseattleblog.com/2013/03/car2go-westseattle-expansion-the-map-and-the-1st-vote/",
      "doi": ""
    }
  ]
}