{
  "doi": "10.1145/3173574.3173723",
  "title": "MatchSticks: Woodworking through Improvisational Digital Fabrication",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Digital fabrication tools have broadened participation in making and enabled new methods of rapid physical prototyping across diverse materials. We present a novel smart tool designed to complement one of the first materials employed by humans - wood - and celebrate the fabrication practice of joinery. Our tool, MatchSticks, is a digital fabrication system tailored for joinery. Combining a portable CNC machine, touchscreen user interface, and parametric joint library, MatchSticks enables makers of varying skill to rapidly explore and create artifacts from wood. Our system embodies tacit woodworking knowledge and distills the distributed workflow of CNC tools into a hand tool; it operates on materials existing machines find difficult, produces assemblies much larger than its workspace, and supports the parallel creation of geometries. We describe the workflow and technical details of our system, present example artifacts produced by our tool, and report results from our user study.",
  "authors": [
    {
      "name": "Rundong Tian",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659554682",
      "orcid": "missing"
    },
    {
      "name": "Sarah Sterman",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131975",
      "orcid": "0000-0002-9282-559X"
    },
    {
      "name": "Ethan Chiou",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260434",
      "orcid": "missing"
    },
    {
      "name": "Jeremy Warner",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99658953508/rel-imgonly/year6_headshot_crop.jpg",
      "acmid": "99658953508",
      "orcid": "missing"
    },
    {
      "name": "Eric Paulos",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "Harshit Agrawal, Udayan Umapathi, Robert Kovacs, Johannes Frohnhofen, Hsiang-Ting Chen, Stefanie Mueller, and Patrick Baudisch. 2015. Protopiper: Physically Sketching Room-Sized Objects at Actual Scale. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 427--436.  ",
      "doi": "10.1145/2807442.2807505"
    },
    {
      "text": "Laura Devendorf and Kimiko Ryokai. 2014. Being the Machine: Exploring New Modes of Making. In Proceedings of the 2014 Companion Publication on Designing Interactive Systems (DIS Companion '14). ACM, New York, NY, USA, 33--36.  ",
      "doi": "10.1145/2598784.2602775"
    },
    {
      "text": "Chi-Wing Fu, Peng Song, Xiaoqi Yan, Lee Wei Yang, Pradeep Kumar Jayaraman, and Daniel Cohen-Or. 2015. Computational Interlocking Furniture Assembly. ACM Trans. Graph. 34, 4 (July 2015), 91:1--91:11.  ",
      "doi": "10.1145/2766892"
    },
    {
      "text": "Scott E. Hudson. 2014. Printing Teddy Bears: A Technique for 3D Printing of Soft Interactive Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 459--468.  ",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Michael D. Jones, Kevin Seppi, and Dan R. Olsen. 2016. What You Sculpt is What You Get: Modeling Physical Interactive Devices with Clay and 3D Printed Widgets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 876--886.  ",
      "doi": "10.1145/2858036.2858493"
    },
    {
      "text": "Steven J. Keating, Julian C. Leland, Levi Cai, and Neri Oxman. 2017. Toward site-specific and self-sufficient robotic fabrication on architectural scales. Science Robotics 2, 5 (April 2017), eaam8986.",
      "doi": ""
    },
    {
      "text": "John Klein, Michael Stern, Giorgia Franchin, Markus Kayser, Chikara Inamura, Shreya Dave, James C. Weaver, Peter Houk, Paolo Colombo, Maria Yang, and Neri Oxman. 2015. Additive Manufacturing of Optically Transparent Glass. 3D Printing and Additive Manufacturing 2, 3 (Aug. 2015), 92--105.",
      "doi": ""
    },
    {
      "text": "Robert Kovacs, Anna Seufert, Ludwig Wall, Hsiang-Ting Chen, Florian Meinel, Willi Müller, Sijing You, Maximilian Brehm, Jonathan Striebel, Yannis Kommana, Alexander Popiak, Thomas Bläsius, and Patrick Baudisch. 2017. TrussFab: Fabricating Sturdy Large-Scale Structures on Desktop 3D Printers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2606--2616.  ",
      "doi": "10.1145/3025453.3026016"
    },
    {
      "text": "Yuki Koyama, Shinjiro Sueda, Emma Steinhardt, Takeo Igarashi, Ariel Shamir, and Wojciech Matusik. 2015. AutoConnect: Computational Design of 3D-printable Connectors. ACM Trans. Graph. 34, 6 (Oct. 2015), 231:1--231:11.  ",
      "doi": "10.1145/2816795.2818060"
    },
    {
      "text": "Manfred Lau, Akira Ohgawara, Jun Mitani, and Takeo Igarashi. 2011. Converting 3D Furniture Models to Fabricatable Parts and Connectors. In ACM SIGGRAPH 2011 Papers (SIGGRAPH '11). ACM, New York, NY, USA, 85:1--85:6.  ",
      "doi": "10.1145/1964921.1964980"
    },
    {
      "text": "Nadya Peek and Ilan Moyer. 2017. Popfab: A Case for Portable Digital Fabrication. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, New York, NY, USA, 325--329.  ",
      "doi": "10.1145/3024969.3025009"
    },
    {
      "text": "Huaishu Peng, François Guimbretière, James McCann, and Scott Hudson. 2016. A 3D Printer for Interactive Electromagnetic Devices. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 553--562.  ",
      "doi": "10.1145/2984511.2984523"
    },
    {
      "text": "Huaishu Peng, Jennifer Mankoff, Scott E. Hudson, and James McCann. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1789--1798.  ",
      "doi": "10.1145/2702123.2702327"
    },
    {
      "text": "Alec Rivers, Ilan E. Moyer, and Frédo Durand. 2012. Position-correcting Tools for 2D Digital Fabrication. ACM Trans. Graph. 31, 4 (July 2012), 88:1--88:7.  ",
      "doi": "10.1145/2185520.2185584"
    },
    {
      "text": "Thijs Roumen, Bastian Kruck, Tobias Dürschmid, Tobias Nack, and Patrick Baudisch. 2016. Mobile Fabrication. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 3--14.  ",
      "doi": "10.1145/2984511.2984586"
    },
    {
      "text": "Harpreet Sareen, Udayan Umapathi, Patrick Shin, Yasuaki Kakehi, Jifei Ou, Hiroshi Ishii, and Pattie Maes. 2017. Printflatables: Printing Human-Scale, Functional and Dynamic Inflatable Objects. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3669--3680.  ",
      "doi": "10.1145/3025453.3025898"
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 103--108.  ",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Eldon Schoop, Michelle Nguyen, Daniel Lim, Valkyrie Savage, Sean Follmer, and Björn Hartmann. 2016. Drill Sergeant: Supporting Physical Construction Projects Through an Ecosystem of Augmented Tools. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1607--1614.  ",
      "doi": "10.1145/2851581.2892429"
    },
    {
      "text": "Roy Shilkrot, Pattie Maes, Joseph A. Paradiso, and Amit Zoran. 2015. Augmented Airbrush for Computer Aided Painting (CAP). ACM Trans. Graph. 34, 2 (March 2015), 19:1--19:11.  ",
      "doi": "10.1145/2699649"
    },
    {
      "text": "Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching Physical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 83--91.  ",
      "doi": "10.1145/2807442.2807467"
    },
    {
      "text": "Christian Weichel, John Hardy, Jason Alexander, and Hans Gellersen. 2015. ReForm: Integrating Physical and Digital Design Through Bidirectional Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/2807442.2807451"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: A Mixed-reality Environment for Personal Fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3855--3864.  ",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2011. Interactive Fabrication: New Interfaces for Digital Fabrication. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, New York, NY, USA, 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "Jiaxian Yao, Danny M. Kaufman, Yotam Gingold, and Maneesh Agrawala. 2017. Interactive Design and Stability Analysis of Decorative Joinery for Furniture. ACM Trans. Graph. 36, 2 (March 2017), 20:1--20:16.  ",
      "doi": "10.1145/3054740"
    },
    {
      "text": "Hironori Yoshida, Takeo Igarashi, Yusuke Obuchi, Yosuke Takami, Jun Sato, Mika Araki, Masaaki Miki, Kosuke Nagata, Kazuhide Sakai, and Syunsuke Igarashi. 2015. Architecture-scale Human-assisted Additive Manufacturing. ACM Trans. Graph. 34, 4 (July 2015), 88:1--88:8.  ",
      "doi": "10.1145/2766951"
    },
    {
      "text": "Amit Zoran, Nan-Wei Gong, Roy Shilkrot, Shuo Yan, and Pattie Maes. 2015. Cutting Edge Vision: Metal Embedded Optics for Smart Knives. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 185--185.  ",
      "doi": "10.1145/2702613.2732495"
    },
    {
      "text": "A. Zoran, R. Shilkrot, P. Goyal, P. Maes, and J. A. Paradiso. 2014a. The Wise Chisel: The Rise of the Smart Handheld Tool. IEEE Pervasive Computing 13, 3 (July 2014), 48--57.",
      "doi": ""
    },
    {
      "text": "Amit Zoran, Roy Shilkrot, Suranga Nanyakkara, and Joseph Paradiso. 2014b. The Hybrid Artisans: A Case Study in Smart Tools. ACM Trans. Comput.-Hum. Interact. 21, 3 (June 2014), 15:1--15:29.  ",
      "doi": "10.1145/2617570"
    }
  ]
}