{
  "doi": "10.1145/3173574.3174025",
  "title": "RecipeScape: An Interactive Tool for Analyzing Cooking Instructions at Scale",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "For cooking professionals and culinary students, understanding cooking instructions is an essential yet demanding task. Common tasks include categorizing different approaches to cooking a dish and identifying usage patterns of particular ingredients or cooking methods, all of which require extensive browsing and comparison of multiple recipes. However, no existing system provides support for such in-depth and at-scale analysis. We present RecipeScape, an interactive system for browsing and analyzing the hundreds of recipes of a single dish available online. We also introduce a computational pipeline that extracts cooking processes from recipe text and calculates a procedural similarity between them. To evaluate how RecipeScape supports culinary analysis at scale, we conducted a user study with cooking professionals and culinary students with 500 recipes for two different dishes. Results show that RecipeScape clusters recipes into distinct approaches, and captures notable usage patterns of ingredients and cooking actions.",
  "authors": [
    {
      "name": "Minsuk Chang",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163123",
      "orcid": "missing"
    },
    {
      "name": "Leonore V. Guillain",
      "institution": "ecole polytechnique fédérale de lausanne (EPFL), Lausanne, Vaud, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261427",
      "orcid": "missing"
    },
    {
      "name": "Hyeungshik Jung",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260839",
      "orcid": "missing"
    },
    {
      "name": "Vivian M. Hare",
      "institution": "Stanford & Chan Zuckerberg Initiative, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658762980",
      "orcid": "missing"
    },
    {
      "name": "Juho Kim",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Yong-Yeol Ahn, Sebastian E Ahnert, James P Bagrow, and Albert-László Barabási. 2011. Flavor network and the principles of food pairing. Scientific reports 1 (2011).",
      "doi": ""
    },
    {
      "text": "Ira D Baxter, Aaron Quigley, Lorraine Bier, Marcelo Sant'Anna, Leonardo Moura, and Andrew Yahin. 1999. CloneDR: clone detection and removal. In Proceedings of the 1st International Workshop on Soft Computing Applied to Software Engineering. 111--117.",
      "doi": ""
    },
    {
      "text": "John Bluis and Dong-Guk Shin. 2003. Nodal distance algorithm: Calculating a phylogenetic tree comparison metric. In Bioinformatics and Bioengineering, 2003. Proceedings. Third IEEE Symposium on. IEEE, 87--94. ",
      "doi": "10.5555/791213.791330"
    },
    {
      "text": "Minsuk Chang, Vivian M Hare, Juho Kim, and Maneesh Agrawala. 2017. Recipescape: Mining and analyzing diverse processes in cooking recipes. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1524--1531.  ",
      "doi": "10.1145/3027063.3053118"
    },
    {
      "text": "GM Crippen. 1978. Note rapid calculation of coordinates from distance matrices. J. Comput. Phys. 26, 3 (1978), 449--452.",
      "doi": ""
    },
    {
      "text": "Gregory Druck. 2013. Recipe attribute prediction using review text as supervision. In Cooking with Computers 2013, IJCAI workshop.",
      "doi": ""
    },
    {
      "text": "Steven M Drucker, Georg Petschnigg, and Maneesh Agrawala. 2006. Comparing and managing multiple versions of slide presentations. In Proceedings of the 19th annual ACM symposium on User interface software and technology. ACM, 47--56.  ",
      "doi": "10.1145/1166253.1166263"
    },
    {
      "text": "Fan Du, Catherine Plaisant, Neil Spring, and Ben Shneiderman. 2017. Finding similar people to guide life choices: Challenge, design, and evaluation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5498--5544.  ",
      "doi": "10.1145/3025453.3025777"
    },
    {
      "text": "Lingxiao Jiang, Ghassan Misherghi, Zhendong Su, and Stephane Glondu. 2007. Deckard: Scalable and accurate tree-based detection of code clones. In Proceedings of the 29th international conference on Software Engineering. IEEE Computer Society, 96--105.  ",
      "doi": "10.1109/ICSE.2007.30"
    },
    {
      "text": "Stephen C Johnson. 1967. Hierarchical clustering schemes. Psychometrika 32, 3 (1967), 241--254.",
      "doi": ""
    },
    {
      "text": "Toshihiro Kamiya, Shinji Kusumoto, and Katsuro Inoue. 2002. CCFinder: a multilinguistic token-based code clone detection system for large scale source code. IEEE Transactions on Software Engineering 28, 7 (2002), 654--670.  ",
      "doi": "10.1109/TSE.2002.1019480"
    },
    {
      "text": "Masahiro Kazama, Minami Sugimoto, Chizuru Hosokawa, Keisuke Matsushima, Lav R Varshney, and Yoshiki Ishikawa. 2017. Sukiyaki in French style: A novel system for transformation of dietary patterns. arXiv preprint arXiv:1705.03487 (2017).",
      "doi": ""
    },
    {
      "text": "Nicholas Kong, Tovi Grossman, Björn Hartmann, Maneesh Agrawala, and George Fitzmaurice. 2012. Delta: a tool for representing and comparing workflows. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1027--1036.  ",
      "doi": "10.1145/2207676.2208549"
    },
    {
      "text": "Nicholas A Kraft, Brandon W Bonds, and Randy K Smith. 2008. Cross-language Clone Detection.. In SEKE. 54--59.",
      "doi": ""
    },
    {
      "text": "Sana Malik, Fan Du, Megan Monroe, Eberechukwu Onukwugha, Catherine Plaisant, and Ben Shneiderman. 2015. Cohort comparison of event sequences with balanced integration of visual analytics and statistics. In Proceedings of the 20th International Conference on Intelligent User Interfaces. ACM, 38--49.  ",
      "doi": "10.1145/2678025.2701407"
    },
    {
      "text": "Christopher D Manning, Mihai Surdeanu, John Bauer, Jenny Rose Finkel, Steven Bethard, and David McClosky. 2014. The stanford corenlp natural language processing toolkit.. In ACL (System Demonstrations). 55--60.",
      "doi": ""
    },
    {
      "text": "Jon Noronha, Eric Hysen, Haoqi Zhang, and Krzysztof Z Gajos. 2011. Platemate: crowdsourcing nutritional analysis from food photographs. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 1--12.  ",
      "doi": "10.1145/2047196.2047198"
    },
    {
      "text": "Amy Pavel, Floraine Berthouzoz, Björn Hartmann, and Maneesh Agrawala. 2013. Browsing and analyzing the command-level structure of large collections of image manipulation tutorials. Citeseer, Tech. Rep. (2013).",
      "doi": ""
    },
    {
      "text": "JB Phipps. 1971. Dendrogram topology. Systematic zoology 20, 3 (1971), 306--308.",
      "doi": ""
    },
    {
      "text": "Florian Pinel and Lav R Varshney. 2014. Computational creativity for culinary recipes. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 439--442.  ",
      "doi": "10.1145/2559206.2574794"
    },
    {
      "text": "Markus Rokicki, Eelco Herder, Tomasz Ku´ smierczyk, and Christoph Trattner. 2016. Plate and prejudice: Gender differences in online cooking. In Proceedings of the 2016 Conference on User Modeling Adaptation and Personalization. ACM, 207--215.  ",
      "doi": "10.1145/2930238.2930248"
    },
    {
      "text": "Chanchal K Roy, James R Cordy, and Rainer Koschke. 2009. Comparison and evaluation of code clone detection techniques and tools: A qualitative approach. Science of computer programming 74, 7 (2009), 470--495.  ",
      "doi": "10.1016/j.scico.2009.02.007"
    },
    {
      "text": "Jeffrey Rzeszotarski and Aniket Kittur. 2012. CrowdScape: interactively visualizing user behavior and output. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 55--62.  ",
      "doi": "10.1145/2380116.2380125"
    },
    {
      "text": "Naruya Saitou and Masatoshi Nei. 1987. The neighbor-joining method: a new method for reconstructing phylogenetic trees. Molecular biology and evolution 4, 4 (1987), 406--425.",
      "doi": ""
    },
    {
      "text": "Amaia Salvador, Nicholas Hynes, Yusuf Aytar, Javier Marin, Ferda Ofli, Ingmar Weber, and Antonio Torralba. 2017. Learning Cross-modal Embeddings for Cooking Recipes and Food Images. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition.",
      "doi": ""
    },
    {
      "text": "Christian Santoni, Claudio Calabrese, Francesco Di Renzo, and Fabio Pellacini. 2016. SculptStat: Statistical Analysis of Digital Sculpting Workflows. arXiv preprint arXiv:1601.07765 (2016).",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman, Catherine Plaisant, and Bradford W Hesse. 2013. Improving healthcare with interactive visualization. Computer 46, 5 (2013), 58--66.  ",
      "doi": "10.1109/MC.2013.38"
    },
    {
      "text": "Tiago Simas, Michal Ficek, Albert Diaz-Guilera, Pere Obrador, and Pablo R Rodriguez. 2017. Food-bridging: a new network construction to unveil the principles of cooking. arXiv preprint arXiv:1704.03330 (2017).",
      "doi": ""
    },
    {
      "text": "Kuo-Chung Tai. 1979. The tree-to-tree correction problem. Journal of the ACM (JACM) 26, 3 (1979), 422--433.  ",
      "doi": "10.1145/322139.322143"
    },
    {
      "text": "Chun-Yuen Teng, Yu-Ru Lin, and Lada A Adamic. 2012. Recipe recommendation using ingredient networks. In Proceedings of the 4th Annual ACM Web Science Conference. ACM, 298--307.  ",
      "doi": "10.1145/2380718.2380757"
    },
    {
      "text": "Robert L Thorndike. 1953. Who belongs in the family? Psychometrika 18, 4 (1953), 267--276.",
      "doi": ""
    },
    {
      "text": "Warren S Torgerson. 1952. Multidimensional scaling: I. Theory and method. Psychometrika 17, 4 (1952), 401--419.",
      "doi": ""
    },
    {
      "text": "Kush R Varshney, Lav R Varshney, Jun Wang, and Daniel Myers. 2013. Flavor pairing in Medieval European cuisine: A study in cooking with dirty data. arXiv preprint arXiv:1307.7982 (2013).",
      "doi": ""
    },
    {
      "text": "Yiting Wang, Walker M White, and Erik Andersen. 2017. PathViewer: Visualizing Pathways through Student Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 960--964.  ",
      "doi": "10.1145/3025453.3025819"
    },
    {
      "text": "Longqi Yang, Yin Cui, Fan Zhang, John P Pollak, Serge Belongie, and Deborah Estrin. 2015. Plateclick: Bootstrapping food preferences through an adaptive visual interface. In Proceedings of the 24th ACM International on Conference on Information and Knowledge Management. ACM, 183--192.  ",
      "doi": "10.1145/2806416.2806544"
    },
    {
      "text": "Ziheng Yang. 1997. PAML: a program package for phylogenetic analysis by maximum likelihood. Bioinformatics 13, 5 (1997), 555--556.",
      "doi": ""
    },
    {
      "text": "Ning Yu, Desislava Zhekova, Can Liu, and Sandra Kübler. 2013. Do good recipes need butter? Predicting user ratings of online recipes. In Proceedings of the IJCAI Workshop on Cooking with Computers, Beijing, China.",
      "doi": ""
    },
    {
      "text": "Kaizhong Zhang and Dennis Shasha. 1989. Simple fast algorithms for the editing distance between trees and related problems. SIAM journal on computing 18, 6 (1989), 1245--1262.  ",
      "doi": "10.1137/0218082"
    },
    {
      "text": "Kaizhong Zhang, Rick Statman, and Dennis Shasha. 1992. On the editing distance between unordered labeled trees. Information processing letters 42, 3 (1992), 133--139.  ",
      "doi": "10.1016/0020-0190%2892%2990136-J"
    }
  ]
}