{
  "doi": "10.1145/3173574.3174047",
  "title": "Iris: A Conversational Agent for Complex Tasks",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Today, most conversational agents are limited to simple tasks supported by standalone commands, such as getting directions or scheduling an appointment. To support more complex tasks, agents must be able to generalize from and combine the commands they already understand. This paper presents a new approach to designing conversational agents inspired by linguistic theory, where agents can execute complex requests interactively by combining commands through nested conversations. We demonstrate this approach in Iris, an agent that can perform open-ended data science tasks such as lexical analysis and predictive modeling. To power Iris, we have created a domain-specific language that transforms Python functions into combinable automata and regulates their combinations through a type system. Running a user study to examine the strengths and limitations of our approach, we find that data scientists completed a modeling task 2.6 times faster with Iris than with Jupyter Notebook.",
  "authors": [
    {
      "name": "Ethan Fast",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466647178",
      "orcid": "missing"
    },
    {
      "name": "Binbin Chen",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021012",
      "orcid": "missing"
    },
    {
      "name": "Julia Mendelsohn",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260967",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Bassen",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553962456",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    }
  ],
  "references": [
    {
      "text": "Adar, E., Dontcheva, M. and Laput, G., CommandSpace: modeling the relationships between tasks, descriptions and features, In Proceedings of the 27th annual ACM symposium on User interface software and technology, ACM, 2014  ",
      "doi": "10.1145/2642918.2647395"
    },
    {
      "text": "Allen, J., Chambers, N., Ferguson, G., Galescu, L., Jung, H., Swift, M. and Taysom, W., Plow: A collaborative task learning agent, 2007",
      "doi": ""
    },
    {
      "text": "Anderson, E., The species problem in Iris, In Annals of the Missouri Botanical Garden, 1936",
      "doi": ""
    },
    {
      "text": "Berant, J., Chou, A., Frostig, R. and Liang, P., Semantic Parsing on Freebase from Question-Answer Pairs., In EMNLP, 2013",
      "doi": ""
    },
    {
      "text": "Bohus, D. and Rudnicky, A., The RavenClaw dialog management framework: Architecture and systems, In Computer Speech&Language, 2009  ",
      "doi": "10.5555/1518321.1518367"
    },
    {
      "text": "Cranshaw, J., Elwany, E., Newman, T., Kocielnik, R., Yu, B., Soni, S., Teevan, J. and Monroy-Hernández, A., Calendar. help: Designing a Workflow-Based Scheduling Agent with Humans in the Loop, In CHI, 2017  ",
      "doi": "10.1145/3025453.3025780"
    },
    {
      "text": "Fast, E., McGrath, W., Rajpurkar, P. and Bernstein, M., Augur: Mining Human Behaviors from Fiction to Power Interactive Systems, In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 2016  ",
      "doi": "10.1145/2858036.2858528"
    },
    {
      "text": "Fast, E., Steffee, D., Wang, L., Brandt, J. and Bernstein, M., Emergent, crowd-scale programming practice in the IDE, In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM, 2014  ",
      "doi": "10.1145/2556288.2556998"
    },
    {
      "text": "Fast, E., Chen, B. and Bernstein, M., Empath: Understanding topic signals in large-scale text, In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 2016  ",
      "doi": "10.1145/2858036.2858535"
    },
    {
      "text": "Fast, E. and Horvitz, E., Identifying dogmatism in social media: Signals and models, In EMNLP, 2016",
      "doi": ""
    },
    {
      "text": "Fast, E. and Bernstein, M., Meta: Enabling Programming Languages to Learn from the Crowd, In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, ACM, 2016  ",
      "doi": "10.1145/2984511.2984532"
    },
    {
      "text": "Fourney, A., Mann, R. and Terry, M., Query-feature graphs: bridging user vocabulary and system functionality, In Proceedings of the 24th annual ACM symposium on User interface software and technology, ACM, 2011  ",
      "doi": "10.1145/2047196.2047224"
    },
    {
      "text": "Gao, T., Dontcheva, M., Adar, E., Liu, Z. and Karahalios, K., Datatone: Managing ambiguity in natural language interfaces for data visualization, In Proceedings of the 28th Annual ACM Symposium on User Interface Software&Technology, ACM, 2015  ",
      "doi": "10.1145/2807442.2807478"
    },
    {
      "text": "Gee, J., An introduction to discourse analysis: Theory and method, Routledge, 2014",
      "doi": ""
    },
    {
      "text": "Guo, P. and Seltzer, M., BURRITO: Wrapping Your Lab Notebook in Computational Infrastructure., In TaPP, ",
      "doi": "10.5555/2342875.2342882"
    },
    {
      "text": "Hartmann, B., MacDougall, D., Brandt, J. and Klemmer, S., What would other programmers do: suggesting solutions to error messages, In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2010  ",
      "doi": "10.1145/1753326.1753478"
    },
    {
      "text": "Hauswald, J., Laurenzano, M., Zhang, Y., Li, C., Rovinski, A., Khurana, A., Dreslinski, R., Mudge, T., Petrucci, V., Tang, L. and Mars, J., Sirius: An Open End-to-End Voice and Vision Personal Assistant and Its Implications for Future Warehouse Scale Computers, In Proceedings of the Twentieth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), ACM, New York, NY, USA,  ",
      "doi": "10.1145/2694344.2694347"
    },
    {
      "text": "Hutchby, I. and Wooffitt, R., Conversation analysis, Polity, 2008",
      "doi": ""
    },
    {
      "text": "John, R., Potti, N. and Patel, J., Ava: From Data to Insights Through Conversations., In CIDR, 2017",
      "doi": ""
    },
    {
      "text": "Kandel, S., Paepcke, A., Hellerstein, J. and Heer, J., Wrangler: Interactive visual specification of data transformation scripts, In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2011  ",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "Kandel, S., Paepcke, A., Hellerstein, J. and Heer, J., Enterprise data analysis and visualization: An interview study, In IEEE Transactions on Visualization and Computer Graphics, 2012  ",
      "doi": "10.1109/TVCG.2012.219"
    },
    {
      "text": "Kery, M., Horvath, A. and Myers, B., Variolite: Supporting Exploratory Programming by Data Scientists, In CHI, 2017  ",
      "doi": "10.1145/3025453.3025626"
    },
    {
      "text": "Klemmer, S., Sinha, A., Chen, J., Landay, J., Aboobaker, N. and Wang, A., Suede: A Wizard of Oz Prototyping Tool for Speech User Interfaces, In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology, ACM, New York, NY, USA, 2000  ",
      "doi": "10.1145/354401.354406"
    },
    {
      "text": "Laput, G., Dontcheva, M., Wilensky, G., Chang, W., Agarwala, A., Linder, J. and Adar, E., Pixeltone: A multimodal interface for image editing, In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2013  ",
      "doi": "10.1145/2470654.2481301"
    },
    {
      "text": "Lasecki, W., Wesley, R., Nichols, J., Kulkarni, A., Allen, J. and Bigham, J., Chorus: a crowd-powered conversational assistant, In Proceedings of the 26th annual ACM symposium on User interface software and technology, ACM, 2013  ",
      "doi": "10.1145/2501988.2502057"
    },
    {
      "text": "Lasecki, W., Thiha, P., Zhong, Y., Brady, E. and Bigham, J., Answering visual questions with conversational crowd assistants, In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility, ACM, 2013  ",
      "doi": "10.1145/2513383.2517033"
    },
    {
      "text": "Li, T., Azaria, A. and Myers, B., SUGILITE: Creating Multimodal Smartphone Automation by Demonstration, In CHI'17, 2017  ",
      "doi": "10.1145/3025453.3025483"
    },
    {
      "text": "Little, G. and Miller, R., Keyword programming in Java, In Proceedings of the twenty-second IEEE/ACM international conference on Automated software engineering, ACM, 2007  ",
      "doi": "10.1145/1321631.1321646"
    },
    {
      "text": "Lupkowski, P. and Ginzburg, J., A corpus-based taxonomy of question responses, In IWCS 2013 (International Workshop on Computational Semantics), 2013",
      "doi": ""
    },
    {
      "text": "Maes, P., Agents that reduce work and information overload, In CACM, 1994  ",
      "doi": "10.1145/176789.176792"
    },
    {
      "text": "Maloney, J., Resnick, M., Rusk, N., Silverman, B. and Eastmond, E., The Scratch Programming Language and Environment, In Trans. Comput. Educ., 2010  ",
      "doi": "10.1145/1868358.1868363"
    },
    {
      "text": "Nass, C. and Brave, S., Wired for speech: How voice activates and advances the human-computer relationship, MIT press Cambridge, MA, 2005 ",
      "doi": "10.5555/1088925"
    },
    {
      "text": "Ng, V., Supervised noun phrase coreference research: The first fifteen years, In Proceedings of the 48th annual meeting of the association for computational linguistics, Association for Computational Linguistics, 2010 ",
      "doi": "10.5555/1858681.1858823"
    },
    {
      "text": "Patel, K., Bancroft, N., Drucker, S., Fogarty, J., Ko, A. and Landay, J., Gestalt: integrated support for implementation and analysis in machine learning, In Proceedings of the 23nd annual ACM symposium on User interface software and technology, ACM, 2010  ",
      "doi": "10.1145/1866029.1866038"
    },
    {
      "text": "Pennebaker, J., Francis, M. and Booth, R., Linguistic inquiry and word count: LIWC 2001, In Mahway: Lawrence Erlbaum Associates, 2001",
      "doi": ""
    },
    {
      "text": "Porcheron, M., Fischer, J. and Sharples, S., \"Do animals have accents?\": talking with agents in multi-party conversation, In CHI, 2016",
      "doi": ""
    },
    {
      "text": "Reinhart, T., The syntactic domain of anaphora, Massachusetts Institute of Technology, 1976",
      "doi": ""
    },
    {
      "text": "Rong, X., Yan, S., Oney, S., Dontcheva, M. and Adar, E., CodeMend: Assisting Interactive Programming with Bimodal Embedding, In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, ACM, 2016  ",
      "doi": "10.1145/2984511.2984544"
    },
    {
      "text": "Searle, J., Speech acts: An essay in the philosophy of language, Cambridge university press, 1969",
      "doi": ""
    },
    {
      "text": "Serban, I., Sordoni, A., Bengio, Y., Courville, A. and Pineau, J., Building end-to-end dialogue systems using generative hierarchical neural network models, In arXiv preprint arXiv:1507.04808, 2015 ",
      "doi": "10.5555/3016387.3016435"
    },
    {
      "text": "Setlur, V., Battersby, S., Tory, M., Gossweiler, R. and Chang, A., Eviza: A Natural Language Interface for Visual Analysis, In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, ACM, 2016  ",
      "doi": "10.1145/2984511.2984588"
    },
    {
      "text": "Suhm, B., Myers, B. and Waibel, A., Multimodal error correction for speech user interfaces, In ACM transactions on computer-human interaction (TOCHI), 2001  ",
      "doi": "10.1145/371127.371166"
    },
    {
      "text": "Sun, M., Chen, Y. and Rudnicky, A., An intelligent assistant for high-level task understanding, In Proceedings of the 21st International Conference on Intelligent User Interfaces, ACM, 2016  ",
      "doi": "10.1145/2856767.2856818"
    },
    {
      "text": "Talbot, J., Lee, B., Kapoor, A. and Tan, D., EnsembleMatrix: Interactive Visualization to Support Machine Learning with Multiple Classifiers, In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, New York, NY, USA, 2009  ",
      "doi": "10.1145/1518701.1518895"
    },
    {
      "text": "Wang, S., Liang, P. and Manning, C., Learning Language Games through Interaction, In CoRR, 2016",
      "doi": ""
    },
    {
      "text": "Weizenbaum, J., ELIZA--a computer program for the study of natural language communication between man and machine, In Communications of the ACM, 1966  ",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Winograd, T. and Flores, F., Understanding computers and cognition: A new foundation for design, Intellect Books, 1986 ",
      "doi": "10.5555/576359"
    },
    {
      "text": "Winograd, T., A language/action perspective on the design of cooperative work, In Human-Computer Interaction, 1987  ",
      "doi": "10.1207/s15327051hci0301_2"
    },
    {
      "text": "Xu, G. and Lam, M., Almond: The Architecture of an Open, Crowdsourced, Privacy-Preserving, Programmable Virtual Assistant, 2017",
      "doi": ""
    }
  ]
}