{
  "doi": "10.1145/3173574.3173787",
  "title": "ColorMod: Recoloring 3D Printed Objects using Photochromic Inks",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Recent research has shown how to change the color of existing objects using photochromic materials. These materials can switch their appearance from transparent to colored when exposed to light of a certain wavelength. The color remains even when the object is removed from the light source. The process is fully reversible allowing users to recolor the object as many times as they want. So far, these systems have been limited to single color changes, i.e. changes from transparent to colored. In this paper, we present ColorMod, a method to extend this approach to multi-color changes (e.g., red-to-yellow). We accomplish this using a multi-color pattern with one color per voxel across the surface of the object. When recoloring the object, our system locally activates only those voxels that have the desired color and turns all other voxels off. We describe ColorMod's hardware/software system and its user interface that comes with a conversion tool for 3D printing as well as a painting tool that matches physical voxels with the desired appearance. We also contribute our own material formula for a 3D-printable photochromic ink.",
  "authors": [
    {
      "name": "Parinya Punpongsanon",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-84460390257/rel-imgonly/punpongsanon_18102017.png",
      "acmid": "84460390257",
      "orcid": "missing"
    },
    {
      "name": "Xin Wen",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261496",
      "orcid": "missing"
    },
    {
      "name": "David S. Kim",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260874",
      "orcid": "missing"
    },
    {
      "name": "Stefanie Mueller",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81548921556/rel-imgonly/81548921556.jpg",
      "acmid": "81548921556",
      "orcid": "0000-0001-7743-7807"
    }
  ],
  "references": [
    {
      "text": "Patrick Baudisch, and Stefanie Mueller, Personal Fab-rication, Foundations and Trends® in Human--Computer Interaction: Vol. 10: No. 3--4, 165--293, 2017.",
      "doi": ""
    },
    {
      "text": "Joanna Berzowska. Very slowly animating textiles: shimmering flower. In Proceedings of ACM SIGGRAPH 2004 Sketches (SIGGRAPH '04), Article 34, 2004.  ",
      "doi": "10.1145/1186223.1186266"
    },
    {
      "text": "Marinella Ferrara, Murat Bengisu. Materials that Change Color, PoliMI SpringerBriefs in Applied Sci-ences and Technology, 9--60, 2014.",
      "doi": ""
    },
    {
      "text": "Tomoko Hashida, Yasuaki Kakehi, and Takeshi Nae-mura. Photochromic canvas drawing with patterned light. In Proceedings of ACM SIGGRAPH 2010 Posters (SIGGRAPH'10), Article 26, 2010.  ",
      "doi": "10.1145/1836845.1836873"
    },
    {
      "text": "Tomoko Hashida, Yasuaki Kakehi, and Takeshi Nae-mura. Photochromic sculpture: volumetric color-forming pixels. In Proceedings of ACM SIGGRAPH 2011 Emerging Technologies (SIGGRAPH '11), Article 11, 2011.  ",
      "doi": "10.1145/2048259.2048270"
    },
    {
      "text": "Tomoko Hashida, Yasuaki Kakehi, and Takeshi Nae-mura. SolaColor: space coloration with solar light. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11), 417--418, 2011.  ",
      "doi": "10.1145/1935701.1935808"
    },
    {
      "text": "Taosong He, Lichan Hong, A. Kaufman, A. Varshney, and S. Wang. Voxel based object simplification. In Proceedings of the 6th conference on Visualization (VIS '95). 296--299, 1995. ",
      "doi": "10.5555/832271.833850"
    },
    {
      "text": "Ryuji Hirayama, Atsushi Shiraki, Makoto Naruse, Shinnichiro Nakamura, Hirotaka Nakayama, Takashi Kake, Tomoyoshi Shimobaba, and Tomoyoshi Ito. Optical Addressing of Multi-Colour Photochromic Ma-terial Mixture for Volumetric Display. Scientific Re-ports, Article 6, 2016.",
      "doi": ""
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Manisha Mohan, Chris Schmandt, Joseph A. Paradiso, and Katia Vega. ChromoSkin: Towards Interactive Cosmetics Using Thermochromic Pigments. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Fac-tors in Computing Systems (CHI EA '16), 3703--3706, 2016.  ",
      "doi": "10.1145/2851581.2890270"
    },
    {
      "text": "Tatsuya Kaihou and Akira Wakita. Electronic origami with the color-changing function. In Proceedings of the second international workshop on Smart material in-terfaces: another step to a material future (SMI '13). 7--12, 2013.  ",
      "doi": "10.1145/2534688.2534690"
    },
    {
      "text": "Tim Kuipers, Eugeni Doubrovski, and Jouke Verlinden. 3D hatching: linear halftoning for dual extrusion fused deposition modeling. In Proceedings of the 1st Annual ACM Symposium on Computational Fabrication (SCF '17). Article 2, 2017  ",
      "doi": "10.1145/3083157.3083163"
    },
    {
      "text": "MakerBot Photochromic filaments. Retrieved Septem-ber 18, 2017 from https://www.makerbot.com/filament",
      "doi": ""
    },
    {
      "text": "Masakazu Morimoto, Seiya Kobatake, and Masahiro Irie. Multicolor Photochromism of Two- and Three-Component Diarylethene Crystals. Journal of the American Chemical Society, Article 36, 2003.",
      "doi": ""
    },
    {
      "text": "Atsumi Osada, Sae Takeshita, Machi Miyahara, and Masa Inakage. KAMI CHAT. In Proceedings of the 2008 International Conference on Advances in Com-puter Entertainment Technology (ACE '08), 403. 2008.  ",
      "doi": "10.1145/1501750.1501853"
    },
    {
      "text": "Roshan Lalintha Peiris and Ryohei Nakatsu. TempTouch: a novel touch sensor using temperature controllers for surface based textile displays. In Pro-ceedings of the 2013 ACM international conference on Interactive tabletops and surfaces (ITS '13), 105--114, 2013.  ",
      "doi": "10.1145/2512349.2512813"
    },
    {
      "text": "Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. SoftAR: Visually Manipulating Haptic Softness Perception in Spatial Augmented Reality. IEEE Trans-actions on Visualization and Computer Graphics, 21(11), 1279--1288, 2015.  ",
      "doi": "10.1109/TVCG.2015.2459792"
    },
    {
      "text": "Tim Reiner, Nathan Carr, Radomír Měch, Ondřej Št'ava, Carsten Dachsbacher, and Gavin Miller. Dual-color mixing for fused deposition modeling printers. Computer Graphics Forum, 33(2), 479--486, 2014.  ",
      "doi": "10.1111/cgf.12319"
    },
    {
      "text": "Daniel Saakes, Kevin Chiu, Tyler Hutchison, Biyeun M. Buczyk, Naoya Koizumi, Masahiko Inami, and Ramesh Raskar. Slow display. In Proceedings of ACM SIGGRAPH 2010 Emerging Technologies (SIGGRAPH '10), Article 22, 2010.  ",
      "doi": "10.1145/1836821.1836843"
    },
    {
      "text": "Daniel Saakes, Masahiko Inami, Takeo Igarashi, Naoya Koizumi, and Ramesh Raskar. Shader printer. In Proceedings of ACM SIGGRAPH 2012 Emerging Technologies (SIGGRAPH '12), Article 18, 2012.  ",
      "doi": "10.1145/2343456.2343474"
    },
    {
      "text": "Daniel Saakes, Takahiro Tsujii, Kohei Nishimura, Tomoko Hashida, Takeshi Naemura. Photochromic Carpet: Playful Floor Canvas with Color-Changing Footprints. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (ACE '13), 622--625, 2013.",
      "doi": ""
    },
    {
      "text": "Pitchaya Sitthi-Amorn, Javier E. Ramos, Yuwang Wangy, Joyce Kwan, Justin Lan, Wenshou Wang, and Wojciech Matusik. MultiFab: a machine vision assist-ed platform for multi-material 3D printing. ACM Transactions on Graphics 34, 4, Article 129, 2015.  ",
      "doi": "10.1145/2766962"
    },
    {
      "text": "Thingiverse. Retrieved September 18, 2017 from https://www.thingiverse.com/",
      "doi": ""
    },
    {
      "text": "Kohei Tsuji, and Akira Wakita. Anabiosis: an interac-tive pictorial art based on polychrome paper compu-ting. In Proceedings of the 8th International Confer-ence on Advances in Computer Entertainment Tech-nology (ACE '11), Article 80, 2011.  ",
      "doi": "10.1145/2071423.2071521"
    },
    {
      "text": "Takahiro Tsujii, Koizumi Naoya, and Takeshi Naemu-ra. Inkantatory Paper: Dynamically Color-changing Prints with Multiple Functional Inks. In Proceedings of the 27th Annual Symposium on User Interface Soft-ware and Technology (UIST'14), 39--40, 2014.  ",
      "doi": "10.1145/2658779.2659103"
    },
    {
      "text": "Hiroki Yamada, Tomohiro Tanikawa, Kunihiro Nishi-mura, and Michitaka Hirose. Paint color control sys-tem with infrared photothermal conversion. In Pro-ceedings of the 8th International Conference on Ad-vances in Computer Entertainment Technology (ACE '11), Article 64, 2011.  ",
      "doi": "10.1145/2071423.2071503"
    },
    {
      "text": "Yi Zhou, Shuangjiu Xiao, Ning Tang, Zhiyong Wei, and Xu Chen. Pmomo: Projection Mapping on Movable 3D Object. In Proceedings of the 2016 CHI Confer-ence on Human Factors in Computing Systems (CHI '16), 781--790, 2016.  ",
      "doi": "10.1145/2858036.2858329"
    },
    {
      "text": "Andrew Towns. Colorant, Photochromic. Encyclopedia of Color Science and Technology, Springer Sci-ence+Business Media. 447--455, 2016.",
      "doi": ""
    },
    {
      "text": "Brian A. Wandell. Foundations of Vision. Sinauer As-sociates, 1995.",
      "doi": ""
    },
    {
      "text": "Yamada Chemicals. Retrieved December 19, 2017 from http://ymdchem.com/",
      "doi": ""
    },
    {
      "text": "Zhengyou Zhang. A Flexible New Technique for Cam-era Calibration. IEEE Transactions on pattern analysis and machine intelligence, 22(11), 1330--1334, 2000.  ",
      "doi": "10.1109/34.888718"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. DuoSkin: rapidly prototyping on-skin user interfaces using skin-friendly materials. In Proceedings of the 2016 ACM Interna-tional Symposium on Wearable Computers (ISWC '16), 16--23, 2016.  ",
      "doi": "10.1145/2971763.2971777"
    },
    {
      "text": "Yanan Wang, Shijian Luo, Yujia Lu, Hebo Gong, Yex-ing Zhou, Shuai Liu, and Preben Hansen. AnimSkin: Fabricating Epidermis with Interactive, Functional and Aesthetic Color Animation. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 397--401, 2017.  ",
      "doi": "10.1145/3064663.3064687"
    },
    {
      "text": "William E. Lorensen and Harvey E. Cline. Marching cubes: A high resolution 3D surface construction algo-rithm. In Proceedings of the 14th annual conference on Computer graphics and interactive techniques (SIGGRAPH '87), 163--169, 1987.  ",
      "doi": "10.1145/37401.37422"
    },
    {
      "text": "Ariel Calderon, James Griffin, and Juan Cristóbal Za-gal. BeamMaker: an open hardware high-resolution digital fabricator for the masses. Rapid Prototyping Journal, 20(3), 245--255, 2014.",
      "doi": ""
    },
    {
      "text": "Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. Projection-based visualization of tangential de-formation of Nonrigid surface by deformation estima-tion using infrared texture. Virtual Reality, 19(1), 45--56, 2015.  ",
      "doi": "10.1007/s10055-014-0256-y"
    },
    {
      "text": "Shoichi Takeda, Daisuke Iwai, and Kosuke Sato. Inter-reflection Compensation of Immersive Projection Dis-play by Spatio-Temporal Screen Reflectance Modula-tion. IEEE Transactions on Visualization and Comput-er Graphics, 22(4), 1424--1431, 2016.  ",
      "doi": "10.1109/TVCG.2016.2518136"
    }
  ]
}