{
  "doi": "10.1145/3173574.3173703",
  "title": "Remixed Reality: Manipulating Space and Time in Augmented Reality",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "We present Remixed Reality, a novel form of mixed reality. In contrast to classical mixed reality approaches where users see a direct view or video feed of their environment, with Remixed Reality they see a live 3D reconstruction, gathered from multiple external depth cameras. This approach enables changing the environment as easily as geometry can be changed in virtual reality, while allowing users to view and interact with the actual physical world as they would in augmented reality. We characterize a taxonomy of manipulations that are possible with Remixed Reality: spatial changes such as erasing objects; appearance changes such as changing textures; temporal changes such as pausing time; and viewpoint changes that allow users to see the world from different points without changing their physical location. We contribute a method that uses an underlying voxel grid holding information like visibility and transformations, which is applied to live geometry in real time.",
  "authors": [
    {
      "name": "David Lindlbauer",
      "institution": "TU Berlin & Microsoft Research, Berlin, Germany",
      "img": "/do/10.1145/contrib-81558156356/rel-imgonly/userpic-3by4.jpg",
      "acmid": "81558156356",
      "orcid": "0000-0002-0809-9696"
    },
    {
      "name": "Andy D. Wilson",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567780",
      "orcid": "0000-0001-5751-9354"
    }
  ],
  "references": [
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 19681979.  ",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Hrvoje Benko, Andrew D. Wilson, and Federico Zannier. 2014. Dyadic Projected Spatial Augmented Reality. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 645--655.  ",
      "doi": "10.1145/2642918.2647402"
    },
    {
      "text": "Paul J. Besl and Neil D. McKay. 1992. A Method for Registration of 3-D Shapes. IEEE Trans. Pattern Anal. Mach. Intell. 14, 2 (February 1992), 239--256.  ",
      "doi": "10.1109/34.121791"
    },
    {
      "text": "Mark Billinghurst, Adrian Clark, and Gun Lee. 2015. A Survey of Augmented Reality. Found. Trends Hum.Comput. Interact. 8, 2--3, 73--272.  ",
      "doi": "10.1561/1100000049"
    },
    {
      "text": "Oliver Bimber and Ramesh Raskar. 2005. Spatial Augmented Reality: Merging Real and Virtual Worlds. A. K. Peters, Ltd., Natick, MA, USA. ",
      "doi": "10.5555/1088894"
    },
    {
      "text": "Gerd Bruder, Frank Steinicke, Klaus H. Hinrichs. 2009. Arch-Explore: A natural user interface for immersive architectural walkthroughs. In Proceedings of the IEEE Symposium on 3D User Interfaces (3DUI'09). 75--82.  ",
      "doi": "10.1109/3DUI.2009.4811208"
    },
    {
      "text": "Kai Bürger, Jens Krüger and Rüdiger Westermann. Direct Volume Editing. 2008. In IEEE Transactions on Visualization and Computer Graphics, 14 / 6, 13881395.  ",
      "doi": "10.1109/TVCG.2008.120"
    },
    {
      "text": "Mingsong Dou, Sameh Khamis, Yury Degtyarev, Philip Davidson, Sean Ryan Fanello, Adarsh Kowdle, Sergio Orts Escolano, Christoph Rhemann, David Kim, Jonathan Taylor, Pushmeet Kohli, Vladimir Tankovich, and Shahram Izadi. 2016. Fusion4D: real-time performance capture of challenging scenes. In ACM Trans. Graph. 35/4.  ",
      "doi": "10.1145/2897824.2925969"
    },
    {
      "text": "Steven Feiner, Blair MacIntyre, Marcus Haupt, and Eliot Solomon. 1993. Windows on the world: 2D windows for 3D augmented reality. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '93). ACM, New York, NY, USA, 145--155.  ",
      "doi": "10.1145/168642.168657"
    },
    {
      "text": "Sebastian Freitag, Dominik Rausch, Torsten Kuhlen. 2014 Reorientation in virtual environments using interactive portals. In Proceedings of the IEEE Symposium on 3D User Interfaces (3DUI'14). 119--122.",
      "doi": ""
    },
    {
      "text": "Jan Herling and Wolfgang Broll. 2012. PixMix: A realtime approach to high-quality Diminished Reality. In Proceedings of the IEEE International Symposium on Mixed and Augmented Reality (ISMAR '12). IEEE Computer Society, Washington, DC, USA, 141--150.  ",
      "doi": "10.1109/ISMAR.2012.6402551"
    },
    {
      "text": "Anuruddha Hettiarachchi and Daniel Wigdor. 2016. Annexing Reality: Enabling Opportunistic Use of Everyday Objects As Tangible Proxies in Augmented Reality. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1957--1967.  ",
      "doi": "10.1145/2858036.2858134"
    },
    {
      "text": "Matthias Innmann, Michael Zollhöfer, Matthias Nießner, Christian Theobalt, and Marc Stamminger. (2016) VolumeDeform: Real-Time Volumetric Nonrigid Reconstruction. In Proceedings of the European Conference on Computer Vision (ECCV '16). 362--379.",
      "doi": ""
    },
    {
      "text": "Shahram Izadi, David Kim, Otmar Hilliges, David Molyneaux, Richard Newcombe, Pushmeet Kohli, Jamie Shotton, Steve Hodges, Dustin Freeman, Andrew Davison, and Andrew Fitzgibbon. 2011. KinectFusion: real-time 3D reconstruction and interaction using a moving depth camera. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 559--568.  ",
      "doi": "10.1145/2047196.2047270"
    },
    {
      "text": "Brett R. Jones, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2013. IllumiRoom: Peripheral Projected Illusions for Interactive Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 869-- 878.  ",
      "doi": "10.1145/2470654.2466112"
    },
    {
      "text": "Brett R. Jones, Rajinder Sodhi, Michael Murdock, Ravish Mehra, Hrvoje Benko, Andrew D. Wilson, Eyal Ofek, Blair MacIntyre, Nikunj Raghuvanshi, and Lior Shapira. 2014. RoomAlive: magical experiences enabled by scalable, adaptive projector-camera units. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 637--644.  ",
      "doi": "10.1145/2642918.2647383"
    },
    {
      "text": "André Kunert, Alexander Kulik, Stephan Beck, and Bernd Froehlich. 2014. Photoportals: shared references in space and time. In Proceedings of the ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 1388--1399.  ",
      "doi": "10.1145/2531602.2531727"
    },
    {
      "text": "Joshua Lifton, and Joseph A. Paradiso. 2010. Dual Reality: Merging the Real and Virtual. In Facets of Virtual Environments (FaVE '09). Springer, Berlin, Heidelberg.",
      "doi": ""
    },
    {
      "text": "Yung-Ta Lin, Yi-Chi Liao, Shan-Yuan Teng, Yi-Ju Chung, Liwei Chan, and Bing-Yu Chen. 2017. OutsideIn: Visualizing Out-of-Sight Regions-of-Interest in a 360 Video Using Spatial Picture-in-Picture Previews. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3126594.3126656"
    },
    {
      "text": "David Lindlbauer, Jörg Müller, and Marc Alexa. 2016. Changing the Appearance of Physical Interfaces Through Controlled Transparency. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA.  ",
      "doi": "10.1145/2984511.2984556"
    },
    {
      "text": "David Lindlbauer, Jörg Müller, and Marc Alexa. 2017. Changing the Appearance of Real-World Objects By Modifying Their Surroundings. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 39543965.  ",
      "doi": "10.1145/3025453.3025795"
    },
    {
      "text": "Sang-won Leigh and Pattie Maes. 2015. AfterMath: Visualizing Consequences of Actions through Augmented Reality. In Proceedings of the Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 941--946.  ",
      "doi": "10.1145/2702613.2732695"
    },
    {
      "text": "Steve Mann. Mediated reality. Technical Report MITML Percom TR-260, University of Toronto, 1994.",
      "doi": ""
    },
    {
      "text": "Steve Mann and James Fung. 2001. Videoorbits on eye tap devices for deliberately diminished reality or altering the visual perception of rigid planar patches of a real world scene. In Proceedings of the International Symposium on Mixed Reality (ISMR'01). 48--55.",
      "doi": ""
    },
    {
      "text": "Steve Mann and James Fung. 2002. EyeTap devices for augmented, deliberately diminished, or otherwise altered visual perception of rigid planar patches of realworld scenes. In Presence: Teleoperators and Virtual Environments 11, 2 158--175.  ",
      "doi": "10.1162/1054746021470603"
    },
    {
      "text": "Mark McGill, Daniel Boland, Roderick Murray-Smith, and Stephen Brewster. 2015. A Dose of Reality: Overcoming Usability Challenges in VR Head-Mounted Displays. In Proceedings of the Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2143--2152.  ",
      "doi": "10.1145/2702123.2702382"
    },
    {
      "text": "Paul Milgram and Fumio Kishino. A taxonomy of mixed reality visual displays. In IIEICE Transactions on Information Systems, Vol E77-D, No.12 December 1994.",
      "doi": ""
    },
    {
      "text": "Takashi Miyaki and Jun Rekimoto. 2016. LiDARMAN: reprogramming reality with egocentric laser depth scanning. In ACM SIGGRAPH 2016 Emerging Technologies (SIGGRAPH '16). ACM, New York, NY, USA, Article 15.  ",
      "doi": "10.1145/2929464.2929481"
    },
    {
      "text": "Mathias Möhring, Christian Lessig, and Oliver Bimber, Video see-through AR on consumer cell-phones. 2004 In Proceedings of the IEEE and ACM International Symposium on Mixed and Augmented Reality, (ISMAR '04). 252--253.  ",
      "doi": "10.1109/ISMAR.2004.63"
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: Fabricating Highly Customizable Thin-film Touch-displays. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 281-- 290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L. Davidson, Sameh Khamis, Mingsong Dou, Vladimir Tankovich, Charles Loop, Qin Cai, Philip A. Chou, Sarah Mennicken, Julien Valentin, Vivek Pradeep, Shenlong Wang, Sing Bing Kang, Pushmeet Kohli, Yuliya Lutchyn, Cem Keskin, and Shahram Izadi. 2016. Holoportation: Virtual 3D Teleportation in Real-time. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 741--754.  ",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Shigeru Owada, Frank Nielsen, and Takeo Igarashi. 2005. Volume catcher. In Proceedings of the Symposium on interactive 3D graphics and games (I3D '05). ACM, New York, NY, USA, 111--116.  ",
      "doi": "10.1145/1053427.1053445"
    },
    {
      "text": "Ivan Poupyrev, Mark Billinghurst, Suzanne Weghorst, and Tadao Ichikawa. 1996. The go-go interaction technique: non-linear mapping for direct manipulation in VR. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '96). ACM, New York, NY, USA, 79--80.  ",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Ramesh Raskar, Greg Welch, Matt Cutts, Adam Lake, Lev Stesin, and Henry Fuchs. 1998. The Office of the Future: A Unified Approach to Image-based Modeling and Spatially Immersive Displays. In Proceedings of the Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '98). ACM, New York, NY, USA, 179--188.  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Ramesh Raskar, Greg Welch, Kok-Lim Low, and Deepak Bandyopadhyay. 2001. Shader lamps: animating real objects with image-based illumination. In Proceedings of the Eurographics conference on Rendering (EGWR'01). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 89--101.  ",
      "doi": "10.5555/2383696.2383708"
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-changing Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 735--744.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Sharif Razzaque, Zachariah Kohn, and Mary C. Whitton. 2001. Redirected Walking. In Proceedings of Eurographics (EG '01), 289--294.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto and Katashi Nagao. 1995. The world through the computer: computer augmented interaction with real world environments. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '95). ACM, New York, NY, USA, 29--36.  ",
      "doi": "10.1145/215585.215639"
    },
    {
      "text": "Joan Sol Roo, Martin Hachet. Towards a Hybrid Space Combining Spatial Augmented Reality and Virtual Reality. In Proceedings of the 2017 IEEE Symposium on 3D User Interfaces (3DUI '17), Los Angeles, CA, USA, 195--198.",
      "doi": ""
    },
    {
      "text": "Joan Sol Roo, Martin Hachet. One Reality: Augmenting How the Physical World is Experienced by combining Multiple Mixed Reality Modalities. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3126594.3126638"
    },
    {
      "text": "Claus Scheiblauer, Michael Wimmer, Out-of-core selection and editing of huge point clouds. 2011. Computers & Graphics, Volume 35, Issue 2, Pages 342--351, ISSN 0097--8493.  ",
      "doi": "10.1016/j.cag.2011.01.004"
    },
    {
      "text": "Ian Stavness, Billy Lam, and Sidney Fels. 2010. pCubee: A Perspective-corrected Handheld Cubic Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1381--1390.  ",
      "doi": "10.1145/1753326.1753535"
    },
    {
      "text": "Vikas Singh, Deborah Silver and Nicu D. Cornea. 2003. Real-time volume manipulation. In Proceedings of the Eurographics/IEEE TVCG Workshop on Volume graphics (VG '03). ACM, New York, NY, USA, 45--51.  ",
      "doi": "10.1145/827051.827057"
    },
    {
      "text": "Adriana De Souza E Silva. 2009. Hybrid Reality and Location-Based Gaming: Redefining Mobility and Game Spaces in Urban Environments. Simul. Gaming 40, 3 (June 2009), 404--424.  ",
      "doi": "10.1177/1046878108314643"
    },
    {
      "text": "Misha Sra, Sergio Garrido-Jurado, Chris Schmandt, and Pattie Maes. 2016. Procedurally generated virtual reality from 3D reconstructed physical space. In Proceedings of the ACM Conference on Virtual Reality Software and Technology (VRST '16). ACM, New York, NY, USA, 191--200.  ",
      "doi": "10.1145/2993369.2993372"
    },
    {
      "text": "Richard Stoakley, Matthew J. Conway, and Randy Pausch. 1995. Virtual reality on a WIM: interactive worlds in miniature. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM, New York, NY, USA, 265--272.  ",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. 1998. Illuminating Light: An Optical Design Tool with a Luminous-tangible Interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM, New York, NY, USA, 542--549.  ",
      "doi": "10.1145/274644.274717"
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. 1999. Urp: A Luminous-tangible Workbench for Urban Planning and Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 386--393.  ",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Julien Valentin, Vibhav Vineet, Ming-Ming Cheng, David Kim, Jamie Shotton, Pushmeet Kohli, Matthias Nießner, Antonio Criminisi, Shahram Izadi, and Philip Torr. 2015. SemanticPaint: Interactive 3D Labeling and Learning at Your Fingertips. ACM Trans. Graph. 34, 5, Article 154.  ",
      "doi": "10.1145/2751556"
    },
    {
      "text": "John Viega, Matthew J. Conway, George Williams, and Randy Pausch. 1996. 3D magic lenses. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '96). ACM, New York, NY, USA, 51--58.  ",
      "doi": "10.1145/237091.237098"
    },
    {
      "text": "Andrew D. Wilson. 2017. Fast lossless depth image compression. In Proceedings of ACM Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3132272.3134144"
    },
    {
      "text": "Ya-Ting Yue, Yong-Liang Yang, Gang Ren, and Wenping Wang. 2017. SceneCtrl: Mixed Reality Enhancement via Efficient Scene Editing. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3126594.3126601"
    }
  ]
}