{
  "doi": "10.1145/3173574.3173737",
  "title": "GeoCoin: Supporting Ideation and Collaborative Design with Smart Contracts",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Design and HCI researchers are increasingly working with complex digital infrastructures, such as cryptocurrencies, distributed ledgers and smart contracts. These technologies will have a profound impact on digital systems and their audiences. However, given their emergent nature and technical complexity, involving non-specialists in the design of applications that employ these technologies is challenging. In this paper, we discuss these challenges and present GeoCoin, a location-based platform for embodied learning and speculative ideating with smart contracts. In collaborative workshops with GeoCoin, participants engaged with location-based smart contracts, using the platform to explore digital 'debit' and 'credit' zones in the city. These exercises led to the design of diverse distributed-ledger applications, for time-limited financial unions, participatory budgeting, and humanitarian aid. These results contribute to the HCI community by demonstrating how an experiential prototype can support understanding of the complexities behind new digital infrastructures and facilitate participant engagement in ideation and design processes.",
  "authors": [
    {
      "name": "Bettina Nissen",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758858357",
      "orcid": "missing"
    },
    {
      "name": "Larissa Pschetz",
      "institution": "University of Edinburgh, Edinburgh, Midlothian , United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339522880",
      "orcid": "missing"
    },
    {
      "name": "Dave Murray-Rust",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436598350",
      "orcid": "0000-0001-6098-7861"
    },
    {
      "name": "Hadi Mehrpouya",
      "institution": "Abertay Dundee University, Dundee, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658739474",
      "orcid": "missing"
    },
    {
      "name": "Shaune Oosthuizen",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261517",
      "orcid": "missing"
    },
    {
      "name": "Chris Speed",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479661155",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Omari Akil. 2017. Warning: Pokemon GO is a Death Sentence if you are a Black Man. https: //medium.com/mobile-lifestyle/warning-pokemon-go-is-adeath-sentence-if-you-are-a-black-man-acacb4bdae7f. (2017). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Cristina Ampatzidou, Matthijs Bouw, Froukje van de Klundert, Michiel de Lange, and Bastiaan Gerard Martijn Waal. 2014. The Hackable City: A Research Manifesto and Design Toolkit. Knowledge Mile.",
      "doi": ""
    },
    {
      "text": "James Auger. 2013. Speculative design: crafting the speculation. Digital Creativity 24, 1 (2013), 11--35.",
      "doi": ""
    },
    {
      "text": "Kamanashis Biswas and Vallipuram Muthukkumarasamy. 2016. Securing Smart Cities Using Blockchain Technology. In 2016 IEEE 18th International Conference on High Performance Computing & Communications; IEEE 14th International Conference on Smart City; IEEE 2nd International Conference on Data Science and Systems (HPCC/SmartCity/DSS). 1392--1393.",
      "doi": ""
    },
    {
      "text": "Julian Bleecker. 2009. Design fiction. A short essay on design, science, fact and fiction. Near Future Laboratory (2009).",
      "doi": ""
    },
    {
      "text": "Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '00). ACM, New York, NY, USA, 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design. Morgan Kaufmann. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Ruth Catlow, Marc Garrett, Nathan Jones, and Sam Skinner (Eds.). 2017. Artists Re:thinking the Blockchain. Liverpool University Press.",
      "doi": ""
    },
    {
      "text": "Alan Chamberlain, Andy Crabtree, Tom Rodden, Matt Jones, and Yvonne Rogers. 2012. Research in the Wild: Understanding 'in the Wild' Approaches to Design and Development. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 795--796.  ",
      "doi": "10.1145/2317956.2318078"
    },
    {
      "text": "Nazlı Cila and Gabriele Ferri. 2017. Centre for Design Informatics: Blockchain City. In A Lab of Labs. Methods and Approaches for a Human-Centered Design, Gabriele Ferri and Martijn de Waal (Eds.). Amsterdam Creative Industries Publishing, 59--67.",
      "doi": ""
    },
    {
      "text": "The DAO. 2016. The DAO. https://archive.is/Ld33p. (2016). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Michiel De Lange and Martijn De Waal. 2013. Owning the city: New media and citizen engagement in urban design. First Monday 18, 11 (2013).",
      "doi": ""
    },
    {
      "text": "Thomas Dickerson, Paul Gazzillo, Maurice Herlihy, and Eric Koskinen. 2017. Adding Concurrency to Smart Contracts. In Proceedings of the ACM Symposium on Principles of Distributed Computing (PODC '17). ACM, New York, NY, USA, 303--312.  ",
      "doi": "10.1145/3087801.3087835"
    },
    {
      "text": "Will Dunn. 2017. The rise and fall of The DAO, the first code-based company. http: //tech.newstatesman.com/feature/dao-code-based-company. (2017). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Arthi Manohar, Jo Briggs, Mike Harding, Chris Speed, and John Vines. 2018. Making Sense of Blockchain Applications: A Typology for HCI. In Proceedings of the 36th Annual ACM Conference on Human Factors in Computing Systems (CHI '18).  ",
      "doi": "10.1145/3173574.3174032"
    },
    {
      "text": "Haakon Faste, Nir Rachmel, Russell Essary, and Evan Sheehan. 2013. Brainstorm, Chainstorm, Cheatstorm, Tweetstorm: New Ideation Strategies for Distributed HCI Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1343--1352.  ",
      "doi": "10.1145/2470654.2466177"
    },
    {
      "text": "Batya Friedman and David Hendry. 2012. The Envisioning Cards: A Toolkit for Catalyzing Humanistic and Technical Imaginations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1145--1148.  ",
      "doi": "10.1145/2207676.2208562"
    },
    {
      "text": "Xianyi Gao, Gradeigh D. Clark, and Janne Lindqvist. 2016. Of Two Minds, Multiple Addresses, and One Ledger: Characterizing Opinions, Knowledge, and Perceptions of Bitcoin Across Users and Non-Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1656--1668.  ",
      "doi": "10.1145/2858036.2858049"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. interactions 6, 1 (Jan. 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity As a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Michael Golembewski and Mark Selby. 2010. Ideation Decks: A Card-based Design Ideation Tool. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 89--92.  ",
      "doi": "10.1145/1858171.1858189"
    },
    {
      "text": "Steve Huckle, Rituparna Bhattacharya, Martin White, and Natalia Beloff. 2016. Internet of Things, Blockchain and Shared Economy Applications. Procedia Computer Science 98, Supplement C (2016), 461 -- 466.  ",
      "doi": "10.1016/j.procs.2016.09.074"
    },
    {
      "text": "George F. Hurlburt and Irena Bojanova. 2014. Bitcoin: Benefit or Curse? IT Professional 16, 3 (May 2014), 10--15.",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Simona Ibba, Andrea Pinna, Matteo Seu, and Filippo Eros Pani. 2017. CitySense: Blockchain-oriented Smart Cities. In Proceedings of the XP2017 Scientific Workshops (XP '17). ACM, New York, NY, USA, Article 12, 5 pages.  ",
      "doi": "10.1145/3120459.3120472"
    },
    {
      "text": "IDEO. 2003. IDEO Method Cards: 51 Ways to Inspire Design. https://www.ideo.com/post/method-cards. (2003). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Caroline Jaffe, Cristina Mata, and Sepandar Kamvar. 2017. Motivating Urban Cycling Through a Blockchain-based Financial Incentives System. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 81--84.  ",
      "doi": "10.1145/3123024.3123141"
    },
    {
      "text": "Jiong Jin, Jayavardhana Gubbi, Slaven Marusic, and Marimuthu Palaniswami. 2014. An Information Framework for Creating a Smart City Through Internet of Things. IEEE Internet of Things Journal 1, 2 (April 2014), 112--121.",
      "doi": ""
    },
    {
      "text": "Joseph Lindley. 2015. Crypto Heater: A Design Fiction. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, New York, NY, USA, 355--356.  ",
      "doi": "10.1145/2757226.2757367"
    },
    {
      "text": "Loi Luu, Duc-Hiep Chu, Hrishi Olickel, Prateek Saxena, and Aquinas Hobor. 2016. Making Smart Contracts Smarter. In Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security (CCS '16). ACM, New York, NY, USA, 254--269.  ",
      "doi": "10.1145/2976749.2978309"
    },
    {
      "text": "Deborah Maxwell, Chris Speed, and Dug Campbell. 2015. 'Effing' the Ineffable: Opening Up Understandings of the Blockchain. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, New York, NY, USA, 208--209.  ",
      "doi": "10.1145/2783446.2783593"
    },
    {
      "text": "Deborah Maxwell, Chris Speed, and Larissa Pschetz. 2017. Story Blocks: Reimagining narrative through the blockchain. Convergence 23, 1 (2017), 79--97.",
      "doi": ""
    },
    {
      "text": "Sarah Meiklejohn, Marjori Pomarole, Grant Jordan, Kirill Levchenko, Damon McCoy, Geoffrey M. Voelker, and Stefan Savage. 2013. A Fistful of Bitcoins: Characterizing Payments Among Men with No Names. In Proceedings of the 2013 Conference on Internet Measurement Conference (IMC '13). ACM, New York, NY, USA, 127--140.  ",
      "doi": "10.1145/2504730.2504747"
    },
    {
      "text": "Matthias Mettler. 2016. Blockchain technology in healthcare: The revolution starts here. In 2016 IEEE 18th International Conference on e-Health Networking, Applications and Services (Healthcom). 1--3.",
      "doi": ""
    },
    {
      "text": "Angela Monaghan. 2017. Bitcoin is a fraud that will blow up, says JP Morgan boss. https://www.theguardian.com/technology/2017/sep/13/ bitcoin-fraud-jp-morgan-cryptocurrency-drug-dealers. (2017). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Michael J. Muller. 2003. The Human-computer Interaction Handbook. (2003), 1051--1068. http://dl.acm.org/citation.cfm?id=772072.772138",
      "doi": ""
    },
    {
      "text": "Satoshi Nakamoto. 2008. Bitcoin: peer to peer electronic cash system. https://bitcoin.org/bitcoin.pdf. (2008). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Arvind Narayanan, Andrew Miller, and Song Han. 2016. Research for Practice: Cryptocurrencies, Blockchains, and Smart Contracts; Hardware for Deep Learning. Queue 14, 6, Article 60 (Dec. 2016), 43--55 pages.  ",
      "doi": "10.1145/3028687.3043967"
    },
    {
      "text": "Bettina Nissen, Kate Symons, Ella Tallyn, Chris Speed, Deborah Maxwell, and John Vines. 2017. New Value Transactions: Understanding and Designing for Distributed Autonomous Organisations. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (DIS '17 Companion). ACM, New York, NY, USA, 352--355.  ",
      "doi": "10.1145/3064857.3064862"
    },
    {
      "text": "Gareth W. Peters and Efstathios Panayi. 2016. Understanding Modern Banking Ledgers Through Blockchain Technologies: Future of Transaction Processing and Smart Contracts on the Internet of Money. Springer International Publishing, Cham, 239--278.",
      "doi": ""
    },
    {
      "text": "Matthew Ponsford. 2017. Award-winning architect builds 'half houses', says slums should inspire. http://www.reuters.com/article/us-latam-housingarchitecture/award-winning-architect-builds-halfhouses-says-slums-should-inspire-idUSKCN0YI1JG. (2017). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Larissa Pschetz, Ella Tallyn, Rory Gianni, and Chris Speed. 2017. Bitbarista: Exploring Perceptions of Data Transactions in the Internet of Things. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2964--2975.  ",
      "doi": "10.1145/3025453.3025878"
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. CoDesign 10, 1 (2014), 5--14.",
      "doi": ""
    },
    {
      "text": "Paul Sawers. 2017. Spotify acquires Mediachain. https://venturebeat.com/2017/04/26/spotify-acquiresmediachain-to-develop-blockchain-technology-thatmatches-royalties-with-rightsowners/. (2017). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Trebor Scholz. 2016. Platform cooperativism. Challenging the corporate sharing economy. New York, NY: Rosa Luxemburg Foundation (2016).",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers and Bill Gaver. 2006. Staying Open to Interpretation: Engaging Multiple Meanings in Design and Evaluation. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06). ACM, New York, NY, USA, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Laura Shin. 2016. How The Blockchain Will Transform Everything From Banking To Government To Our Identities. https://www.forbes.com/sites/laurashin/2016/ 05/26/how-the-blockchain-will-transform-everythingfrom-banking-to-government-to-our-identities/. (2016). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Los Silva. 2016. The Future Is Now: Smart Cities on the Ethereum Blockchain. https://www.ethnews.com/the-future-is-now-smartcities-on-the-ethereum-blockchain. (2016). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Rasmus Svennson and Hanna Nilsson. 2017. The Block is the Successor to the Book: A publishing proposal. http://rhizome.org/editorial/2015/nov/17/the-block-isthe-successor-to-the-book-a-publishing-proposal/. (2017). Accessed: 2017-09--19.",
      "doi": ""
    },
    {
      "text": "Bas Van Abel, Lucas Evers, Peter Troxler, and Roel Klaassen. 2014. Open design now: Why design cannot remain exclusive. BIS Publishers.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making Design Probes Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3441--3450.  ",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Andrea Zanella, Nicola Bui, Angelo Castellani, Lorenzo Vangelista, and Michele Zorzi. 2014. Internet of Things for Smart Cities. IEEE Internet of Things Journal 1, 1 (Feb 2014), 22--32.",
      "doi": ""
    }
  ]
}