{
  "doi": "10.1145/3173574.3173644",
  "title": "What's at Stake: Characterizing Risk Perceptions of Emerging Technologies",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "One contributing factor to how people choose to use technology is their perceptions of associated risk. In order to explore this influence, we adapted a survey instrument from risk perception literature to assess mental models of users and technologists around risks of emerging, data-driven technologies (e.g., identity theft, personalized filter bubbles). We surveyed 175 individuals for comparative and individual assessments of risk, including characterizations using psychological factors. We report our observations around group differences (e.g., expert versus non-expert) in how people assess risk, and what factors may structure their conceptions of technological harm. Our findings suggest that technologists see these risks as posing a bigger threat to society than do non-experts. Moreover, across groups, participants did not see technological risks as voluntarily assumed. Differences in how people characterize risk have implications for the future of design, decision-making, and public communications, which we discuss through a lens we call risk-sensitive design.",
  "tags": [
    "risk",
    "ethics",
    "design"
  ],
  "authors": [
    {
      "name": "Michael Warren Skirpan",
      "institution": "University of Colorado Boulder & Probable Models, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658688252",
      "orcid": "missing"
    },
    {
      "name": "Tom Yeh",
      "institution": "University of Colorado Boulder, Boulder, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557134256",
      "orcid": "missing"
    },
    {
      "name": "Casey Fiesler",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81464672606/rel-imgonly/caseyfiesler.jpg",
      "acmid": "81464672606",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2015. Google apologises for Photos app's racist blunder. BBC News (July 2015). http://www.bbc.com/news/technology-33347866",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Ralph Gross. 2006. Imagined communities: Awareness, information sharing, and privacy on the Facebook. In International workshop on privacy enhancing technologies. Springer, 36--58.  ",
      "doi": "10.1007/11957454_3"
    },
    {
      "text": "Julio Angulo and Martin Ortlieb. 2015. \"WTH..!â ? A´ L\" Experiences, reactions, and expectations related to online privacy panic situations. In Symposium on Usable Privacy and Security (SOUPS). https://www.usenix.org/system/files/conference/ soups2015/soups15-paper-angulo.pdf",
      "doi": ""
    },
    {
      "text": "Julia Angwin, Lauren Kirchner, Surya Mattu, and Jeff Larson. 2016. Machine Bias: There's Software Used Across the Country to Predict Future Criminals. And it's Biased Against Blacks. (May 2016). https://www.propublica.org/article/ machine-bias-risk-assessments-in-criminal-sentencing",
      "doi": ""
    },
    {
      "text": "Annie I. Anton, Julia B. Earp, and Jessica D. Young. 2010. How internet users' privacy concerns have evolved since 2002. IEEE Security & Privacy 8, 1 (2010). http://ieeexplore.ieee.org/abstract/document/5403147/  ",
      "doi": "10.1109/MSP.2010.38"
    },
    {
      "text": "Rebecca Balebako, Jaeyeon Jung, Wei Lu, Lorrie Faith Cranor, and Carolyn Nguyen. 2013. \"Little Brothers Watching You\": Raising Awareness of Data Leaks on Smartphones. In Proceedings of the Ninth Symposium on Usable Privacy and Security (SOUPS '13). ACM, New York, NY, USA, 12:1--12:11.  ",
      "doi": "10.1145/2501604.2501616"
    },
    {
      "text": "Solon Barocas and Helen Nissenbaum. 2014. Big data's end run around anonymity and consent. Privacy, big data, and the public good: Frameworks for Engagement (2014), 44--75.",
      "doi": ""
    },
    {
      "text": "Andrew Besmer and Heather Richter Lipford. 2010. Users'(mis) conceptions of social applications. In Proceedings of Graphics Interface 2010. Canadian Information Processing Society, 63--70. http://dl.acm.org/citation.cfm?id=1839226 ",
      "doi": "10.5555/1839214.1839226"
    },
    {
      "text": "Igor Bilogrevic and Martin Ortlieb. 2016. \"If You Put All The Pieces Together...\": Attitudes Towards Data Combination and Sharing Across Services and Companies. ACM Press, 5215--5227.  ",
      "doi": "10.1145/2858036.2858432"
    },
    {
      "text": "Buhrmester, Michael, Kwang, Tracy, and Gosling, Samuel D. 2011. Amazon's Mechanical Turk: A New Source of Inexpensive, Yet High-Quality, Data? Perspectives on Psychological Science 6, 1 (Jan. 2011), 3--5.",
      "doi": ""
    },
    {
      "text": "Cranor, Lorrie F., Reagle, Joseph, and Ackerman, Mark S.. 2000. Beyond Concern: Understanding Net Users' Attitudes about Online Privacy. In The Internet Upheaval: Raising Questions, Seeking Answers in Communications Policy, Ingo Vogelsang and Benjamin M. Compaine (Eds.). MIT Press, Cambridge, Massachusetts, 47--70.",
      "doi": ""
    },
    {
      "text": "David J. Hauser and Norbert Schwarz. 2016. Attentive Turkers: MTurk participants perform better on online attention checks than do subject pool participants. Behavior Research Methods 48, 1 (March 2016), 400--407.",
      "doi": ""
    },
    {
      "text": "Serge Egelman. 2013. My Profile is My Password, Verify Me!: The Privacy/Convenience Tradeoff of Facebook Connect. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2369--2378.  ",
      "doi": "10.1145/2470654.2481328"
    },
    {
      "text": "Mostafa El-Bermawy. 2016. Your Filter Bubble is Destroying Democracy. WIRED (Nov. 2016). https://www.wired.com/2016/11/ filter-bubble-destroying-democracy/",
      "doi": ""
    },
    {
      "text": "Mauricio S. Featherman and John D. Wells. 2010. The Intangibility of e-Services: Effects on Perceived Risk and Acceptance. SIGMIS Database 41, 2 (May 2010), 110--131.  ",
      "doi": "10.1145/1795377.1795384"
    },
    {
      "text": "Casey Fiesler, Michaelanne Dye, Jessica L. Feuston, Chaya Hiruncharoenvate, C.J. Hutto, Shannon Morrison, Parisa Khanipour Roshan, Umashanthi Pavalanathan, Amy S. Bruckman, Munmun De Choudhury, and Eric Gilbert. 2017. What (or Who) Is Public?: Privacy Settings and Social Media Content Sharing. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 567--580.  ",
      "doi": "10.1145/2998181.2998223"
    },
    {
      "text": "Casey Fiesler, Cliff Lampe, and Amy S Bruckman. 2016. Reality and Perception of Copyright Terms of Service for Online Content Creation. ACM Press, 1448--1459.  ",
      "doi": "10.1145/2818048.2819931"
    },
    {
      "text": "Samuel Gibbs. 2015a. Musk, Wozniak and Hawking urge ban on warfare AI and autonomous weapons. The Guardian (July 2015). https://www.theguardian.com/technology/2015/jul/27/ musk-wozniak-hawking-ban-ai-autonomous-weapons",
      "doi": ""
    },
    {
      "text": "Samuel Gibbs. 2015b. Women less likely to be shown ads for high-paid jobs on Google, study shows. The Guardian (July 2015). https://www.theguardian.com/technology/2015/jul/08/ women-less-likely-ads-high-paid-jobs-google-study",
      "doi": ""
    },
    {
      "text": "Paul Hitlin. 2016. Research in the Crowdsourcing Age, a Case Study. (July 2016). http://www.pewinternet.org/2016/07/11/ research-in-the-crowdsourcing-age-a-case-study/",
      "doi": ""
    },
    {
      "text": "Carlos Jensen and Colin Potts. 2004. Privacy Policies As Decision-making Tools: An Evaluation of Online Privacy Notices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 471--478.  ",
      "doi": "10.1145/985692.985752"
    },
    {
      "text": "Jennifer King, Airi Lampinen, and Alex Smolen. 2011. Privacy: Is there an app for that?. In Proceedings of the Seventh Symposium on Usable Privacy and Security. ACM, 12. http://dl.acm.org/citation.cfm?id=2078843  ",
      "doi": "10.1145/2078827.2078843"
    },
    {
      "text": "Ewa Luger, Stuart Moran, and Tom Rodden. 2013. Consent for All: Revealing the Hidden Complexity of Terms and Conditions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2687--2696.  ",
      "doi": "10.1145/2470654.2481371"
    },
    {
      "text": "Aleecia McDonald and Lorrie Faith Cranor. 2010. Beliefs and Behaviors: Internet Users' Understanding of Behavioral Advertising. SSRN Scholarly Paper ID 1989092. Social Science Research Network, Rochester, NY. http://papers.ssrn.com/abstract=1989092",
      "doi": ""
    },
    {
      "text": "Gregory S. McNeal. 2014. Facebook Manipulated User News Feeds To Create Emotional Responses. (June 2014). https://www.forbes.com/sites/gregorymcneal/2014/06/28/ facebook-manipulated-user-news-feeds-to-create-emotional-contagio",
      "doi": ""
    },
    {
      "text": "Claire Cain Miller. 2017. Evidence That Robots Are Winning the Race for American Jobs. The New York Times (March 2017). https://www.nytimes.com/2017/03/28/upshot/ evidence-that-robots-are-winning-the-race-for-american-jobs. html",
      "doi": ""
    },
    {
      "text": "Johnny Saldana. 2015. The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Paul Slovic. 1987. Perception of Risk. Science 236 (April 1987), 280--285. http://www.heatherlench.com/ wp-content/uploads/2008/07/slovic.pdf",
      "doi": ""
    },
    {
      "text": "Paul Slovic. 1993. Perceived risk, trust, and democracy. Risk analysis 13, 6 (1993), 675--682.",
      "doi": ""
    },
    {
      "text": "Paul Slovic, Baruch Fischhoff, and Sarah Lichtenstein. 1980. Facts and fears: Understanding perceived risk. Societal risk assessment: How safe is safe enough 4 (1980), 181--214.",
      "doi": ""
    },
    {
      "text": "Paul Slovic, Baruch Fischhoff, and Sarah Lichtenstein. 1985. Characterizing Perceived Risk. SSRN Scholarly Paper ID 2185557. Social Science Research Network, Rochester, NY. https://papers.ssrn.com/abstract=2185557",
      "doi": ""
    },
    {
      "text": "Olivia Solon. 2017. 'This oversteps a boundary': teenagers perturbed by Facebook surveillance. The Guardian (May 2017). https://www.theguardian.com/technology/2017/may/02/ facebook-surveillance-tech-ethics",
      "doi": ""
    },
    {
      "text": "Latanya Sweeney. 2013. Discrimination in online ad delivery. Queue 11.3 (2013), 10. http: //dataprivacylab.org/projects/onlineads/1071--1.pdf  ",
      "doi": "10.1145/2460276.2460278"
    },
    {
      "text": "Eran Toch, Yang Wang, and Lorrie Faith Cranor. 2012. Personalization and privacy: a survey of privacy risks and remedies in personalization-based systems. User Modeling and User-Adapted Interaction 22, 1--2 (April 2012), 203--220.  ",
      "doi": "10.1007/s11257-011-9110-z"
    },
    {
      "text": "Zeynep Tufekci. 2015. Algorithmic Harms beyond Facebook and Google: Emergent Challenges of Computational Agency. Colorado Technology Law Journal 13.2 (2015), 203--218. http://ctlj.colorado. edu/wp-content/uploads/2015/08/Tufekci-final.pdf",
      "doi": ""
    },
    {
      "text": "Joseph Turow, Lauren Feldman, and Kimberly Meltzer. 2005. Open to Exploitation: America's Shoppers Online and Offline. A Report from the Annenberg Public Policy Center of the University of Pennsylvania (2005). https://works.bepress.com/joseph_turow/10/",
      "doi": ""
    },
    {
      "text": "Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, Useful, Scary, Creepy: Perceptions of Online Behavioral Advertising. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12). ACM, New York, NY, USA, 4:1--4:15.  ",
      "doi": "10.1145/2335356.2335362"
    },
    {
      "text": "Jessica Vitak, Katie Shilton, and Zahra Ashktorab. 2016. Beyond the Belmont Principles: Ethical Challenges, Practices, and Beliefs in the Online Data Research Community. ACM Press, 939--951.",
      "doi": ""
    },
    {
      "text": "Rick Wash. 2010. Folk models of home computer security. In Proceedings of the Sixth Symposium on Usable Privacy and Security. ACM, 11. http://dl.acm.org/citation.cfm?id=1837125  ",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "Mu Yang, Yijun Yu, Arosha K. Bandara, and Bashar Nuseibeh. 2014. Adaptive sharing for online social networks: a trade-off between privacy risk and social benefit. In Trust, Security and Privacy in Computing and Communications (TrustCom), 2014 IEEE 13th International Conference on. IEEE, 45--52. http://ieeexplore.ieee.org/abstract/document/7011232/  ",
      "doi": "10.1109/TrustCom.2014.10"
    },
    {
      "text": "Yaxing Yao, Davide Lo Re, and Yang Wang. Folk Models of Online Behavioral Advertising. (????).",
      "doi": ""
    },
    {
      "text": "Michael Zimmer. 2010. \"But the data is already public\": on the ethics of research in Facebook. Ethics and Information Technology 12, 4 (Dec. 2010), 313--325.  ",
      "doi": "10.1007/s10676-010-9227-5"
    },
    {
      "text": "Michael Zimmer. 2016. OkCupid Study Reveals the Perils of Big-Data Science. (May 2016). https://www.wired.com/2016/05/ okcupid-study-reveals-perils-big-data-science/",
      "doi": ""
    }
  ]
}