{
  "doi": "10.1145/3173574.3174107",
  "title": "Pointing All Around You: Selection Performance of Mouse and Ray-Cast Pointing in Full-Coverage Displays",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "As display environments become larger and more diverse - now often encompassing multiple walls and room surfaces - it is becoming more common that users must find and manipulate digital artifacts not directly in front of them. There is little understanding, however, about what techniques and devices are best for carrying out basic operations above, behind, or to the side of the user. We conducted an empirical study comparing two main techniques that are suitable for full-coverage display environments: mouse-based pointing, and ray-cast 'laser' pointing. Participants completed search and pointing tasks on the walls and ceiling, and we measured completion time, path lengths and perceived effort. Our study showed a strong interaction between performance and target location: when the target position was not known a priori the mouse was fastest for targets on the front wall, but ray-casting was faster for targets behind the user. Our findings provide new empirical evidence that can help designers choose pointing techniques for full-coverage spaces.",
  "authors": [
    {
      "name": "Julian Petford",
      "institution": "University of St Andrews, St Andrews, United Kingdom",
      "img": "/do/10.1145/contrib-99659040075/rel-imgonly/img.jpg",
      "acmid": "99659040075",
      "orcid": "missing"
    },
    {
      "name": "Miguel A. Nacenta",
      "institution": "University of St Andrews, St Andrews, United Kingdom",
      "img": "/do/10.1145/contrib-81100377766/rel-imgonly/dsc_7149-small.png",
      "acmid": "81100377766",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Hirotogu Akaike. 1992. Information theory and an extension of the maximum likelihood principle. In Breakthroughs in statistics. Springer, 610--624.",
      "doi": ""
    },
    {
      "text": "Ferran Argelaguet and Carlos Andujar. 2009. Efficient 3D Pointing Selection in Cluttered Virtual Environments. IEEE Comput. Graph. Appl. 29, 6 (Nov. 2009), 34--43.",
      "doi": ""
    },
    {
      "text": "Ferran Argelaguet and Carlos Andujar. 2013. Special Section on Touching the 3rd Dimension: A Survey of 3D Object Selection Techniques for Virtual Environments. Comput. Graph. 37, 3 (May 2013), 121--136.  ",
      "doi": "10.1016/j.cag.2012.12.003"
    },
    {
      "text": "Amartya Banerjee, Jesse Burstyn, Audrey Girouard, and Roel Vertegaal. 2012. MultiPoint: Comparing laser and manual pointing as remote input in large display interactions. International Journal of Human-Computer Studies 70, 10 (2012), 690--702. Special issue on Developing, Evaluating and Deploying Multi-touch Systems.  ",
      "doi": "10.1016/j.ijhcs.2012.05.009"
    },
    {
      "text": "Patrick Baudisch, Nathaniel Good, and Paul Stewart. 2001. Focus Plus Context Screens: Combining Display Technology with Visualization Techniques. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, New York, NY, USA, 31--40.  ",
      "doi": "10.1145/502348.502354"
    },
    {
      "text": "Jacob T. Biehl and Brian P. Bailey. 2004. ARIS: An Interface for Application Relocation in an Interactive Space. In Proceedings of Graphics Interface 2004 (GI '04). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 107--116. http://dl.acm.org/citation.cfm?id=1006058.1006072 ",
      "doi": "10.5555/1006058.1006072"
    },
    {
      "text": "Richard A. Bolt. 1980. \"Put-that-there\": Voice and Gesture at the Graphics Interface. In Proceedings of the 7th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '80). ACM, New York, NY, USA, 262--270.  ",
      "doi": "10.1145/800250.807503"
    },
    {
      "text": "James Boritz, Kellogg S. Booth, and William B. Cowan. 1991. Fitt's Law Studies of Directional Mouse Movement. In Proceedings of Graphics Interface '91 (GI '91). Canadian Man-Computer Communications Society, Toronto, Ontario, Canada, 216--223. http://graphicsinterface.org/wp-content/uploads/ gi1991--28.pdf",
      "doi": ""
    },
    {
      "text": "Doug Bowman, Chadwick. Wingrave, Joshua. Campbell, and Vinh Ly. 2001. Using Pinch Gloves(TM) for both Natural and Abstract Interaction Techniques in Virtual Environments. Technical Report. Computer Science, Virginia Tech.",
      "doi": ""
    },
    {
      "text": "Michelle A. Brown, Wolfgang Stuerzlinger, and E. J. Mendonça Filho. 2014. The Performance of Un-instrumented In-air Pointing. In Proceedings of Graphics Interface 2014 (GI '14). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 59--66. http://dl.acm.org/citation.cfm?id=2619648.2619659 ",
      "doi": "10.5555/2619648.2619659"
    },
    {
      "text": "Stuart K. Card, William. K. English, and Betty. J. Burr. 1987. Human-computer Interaction. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, Chapter Evaluation of Mouse, Rate-controlled Isometric Joystick, Step Keys, and Text Keys, for Text Selection on a CRT, 386--392. http://dl.acm.org/citation.cfm?id=58076.58107 ",
      "doi": "10.5555/58076.58107"
    },
    {
      "text": "Géry Casiez, Daniel Vogel, Ravin Balakrishnan, and Andy Cockburn. 2008. The Impact of Control-Display Gain on User Performance in Pointing Tasks. Human-Computer Interaction 23, 3 (2008), 215--250.",
      "doi": ""
    },
    {
      "text": "Yeonjoo Cha and Rohae Myung. 2010. Extended Fitts' law in Three-Dimensional Pointing Tasks. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 54, 13 (2010), 972--976.",
      "doi": ""
    },
    {
      "text": "Brian W. Epps. 1986. Comparison of Six Cursor Control Devices Based on Fitts' Law Models. Proceedings of the Human Factors Society Annual Meeting 30, 4 (1986), 327--331.",
      "doi": ""
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (1954), 381.",
      "doi": ""
    },
    {
      "text": "Clifton Forlines, Daniel Vogel, and Ravin Balakrishnan. 2006. HybridPointing: Fluid Switching Between Absolute and Relative Pointing with a Direct Input Device. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 211--220.  ",
      "doi": "10.1145/1166253.1166286"
    },
    {
      "text": "Clifton Forlines, Daniel Wigdor, Chia Shen, and Ravin Balakrishnan. 2007. Direct-touch vs. Mouse Input for Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 647--656.  ",
      "doi": "10.1145/1240624.1240726"
    },
    {
      "text": "Fabian Göbel, Konstantin Klamka, Andreas Siegel, Stefan Vogt, Sophie Stellmach, and Raimund Dachselt. 2013. Gaze-supported Foot Interaction in Zoomable Information Spaces. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 3059--3062.  ",
      "doi": "10.1145/2468356.2479610"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2004. Pointing at Trivariate Targets in 3D Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 447--454.  ",
      "doi": "10.1145/985692.985749"
    },
    {
      "text": "Carl Gutwin, Andy Cockburn, and Ashley Coveney. 2017. Peripheral Popout: The Influence of Visual Angle and Stimulus Intensity on Popout Effects. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 208--219.  ",
      "doi": "10.1145/3025453.3025984"
    },
    {
      "text": "Juan Pablo Hourcade and Natasha Bullock-Rest. 2012. How Small Can You Go?: Analyzing the Effect of Visual Angle in Pointing Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 213--216.  ",
      "doi": "10.1145/2207676.2207706"
    },
    {
      "text": "Brett R. Jones, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2013. IllumiRoom: Peripheral Projected Illusions for Interactive Experiences. In ACM SIGGRAPH 2013 Emerging Technologies (SIGGRAPH '13). ACM, New York, NY, USA, Article 7, 1 pages.  ",
      "doi": "10.1145/2503368.2503375"
    },
    {
      "text": "Ricardo Jota, Miguel A. Nacenta, Joaquim A. Jorge, Sheelagh Carpendale, and Saul Greenberg. 2010. A Comparison of Ray Pointing Techniques for Very Large Displays. In Proceedings of Graphics Interface 2010 (GI '10). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 269--276. http://dl.acm.org/citation.cfm?id=1839214.1839261 ",
      "doi": "10.5555/1839214.1839261"
    },
    {
      "text": "Regis Kopper, Doug A Bowman, Mara G Silva, and Ryan P McMahan. 2010. A human motor behavior model for distal pointing tasks. International journal of human-computer studies 68, 10 (2010), 603--615.  ",
      "doi": "10.1016/j.ijhcs.2010.05.001"
    },
    {
      "text": "I. Scott MacKenzie. 1992. Fitts' Law As a Research and Design Tool in Human-computer Interaction. Hum.-Comput. Interact. 7, 1 (March 1992), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "I. Scott MacKenzie and William Buxton. 1992. Extending Fitts' Law to Two-dimensional Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, New York, NY, USA, 219--226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "I. Scott MacKenzie, Abigail Sellen, and William A. S. Buxton. 1991. A Comparison of Input Devices in Element Pointing and Dragging Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91). ACM, New York, NY, USA, 161--166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "David E. Meyer, Richard A. Abrams, Sylvan Kornblum, Charles E. Wright, and J. E. Keith Smith. 1988. Optimality in human motor performance: Ideal control of rapid aimed movements. Psychological Review 95, 3 (1988), 340--370.",
      "doi": ""
    },
    {
      "text": "Brad A. Myers, Rishi Bhatnagar, Jeffrey Nichols, Choon Hong Peck, Dave Kong, Robert Miller, and A. Chris Long. 2002. Interacting at a Distance: Measuring the Performance of Laser Pointers and Other Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 33--40.  ",
      "doi": "10.1145/503376.503383"
    },
    {
      "text": "Miguel A. Nacenta. 2010. Cross-display object movement in multi-display environments. Ph.D. Dissertation. University of Saskatchewan. https: //ecommons.usask.ca/handle/10388/etd-01062010-123426 ",
      "doi": "10.5555/2020001"
    },
    {
      "text": "Miguel A. Nacenta, Dzmitry Aliakseyeu, Sriram Subramanian, and Carl Gutwin. 2005. A Comparison of Techniques for Multi-display Reaching. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Miguel A. Nacenta, Satoshi Sakurai, Tokuo Yamaguchi, Yohei Miki, Yuichi Itoh, Yoshifumi Kitamura, Sriram Subramanian, and Carl Gutwin. 2007. E-conic: A Perspective-aware Interface for Multi-display Environments. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 279--288.  ",
      "doi": "10.1145/1294211.1294260"
    },
    {
      "text": "Miguel A. Nacenta, Samer Sallam, Bernard Champoux, Sriram Subramanian, and Carl Gutwin. 2006. Perspective Cursor: Perspective-based Interaction for Multi-display Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 289--298.  ",
      "doi": "10.1145/1124772.1124817"
    },
    {
      "text": "Mathieu Nancel, Emmanuel Pietriga, Olivier Chapuis, and Michel Beaudouin-Lafon. 2015. Mid-Air Pointing on Ultra-Walls. ACM Trans. Comput.-Hum. Interact. 22, 5, Article 21 (Aug. 2015), 62 pages.  ",
      "doi": "10.1145/2766448"
    },
    {
      "text": "Ji-Young Oh and Wolfgang Stuerzlinger. 2002a. Laser Pointers as Collaborative Pointing Devices. In Proceedings of the Graphics Interface 2002 Conference (GI '02). 141--150. http://graphicsinterface.org/ wp-content/uploads/gi2002-17.pdf",
      "doi": ""
    },
    {
      "text": "Ji-Young Oh and Wolfgang Stuerzlinger. 2002b. Laser pointers as collaborative pointing devices. In Proceedings of Graphics Interface, Vol. 2002. 141--149.",
      "doi": ""
    },
    {
      "text": "Dan R. Olsen, Jr. and Travis Nielsen. 2001. Laser Pointer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 17--22.  ",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "J. Karen Parker, Regan L. Mandryk, and Kori M. Inkpen. 2005. TractorBeam: Seamless Integration of Local and Remote Pointing for Tabletop Displays. In Proceedings of Graphics Interface 2005 (GI '05). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 33--40. http://dl.acm.org/citation.cfm?id=1089508.1089515 ",
      "doi": "10.5555/1089508.1089515"
    },
    {
      "text": "Julian Petford, Miguel A. Nacenta, Carl Gutwin, Joseph Eremondi, and Cody Ede. 2016. The ASPECTA Toolkit: Affordable Full Coverage Displays. In Proceedings of the 5th ACM International Symposium on Pervasive Displays (PerDis '16). ACM, New York, NY, USA, 87--105.  ",
      "doi": "10.1145/2914920.2915006"
    },
    {
      "text": "Ivan Poupyrev, Suzanne Weghorst, Mark Billinghurst, and Tadao Ichikawa. 1997. A Framework and Testbed for Studying Manipulation Techniques for Immersive VR. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (VRST '97). ACM, New York, NY, USA, 21--28.  ",
      "doi": "10.1145/261135.261141"
    },
    {
      "text": "Ramesh Raskar, Greg Welch, Matt Cutts, Adam Lake, Lev Stesin, and Henry Fuchs. 1998. The Office of the Future: A Unified Approach to Image-based Modeling and Spatially Immersive Displays. In Proceedings of the 25th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '98). ACM, New York, NY, USA, 179--188.  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Adrian Reetz and Carl Gutwin. 2014. Making Big Gestures: Effects of Gesture Size on Observability and Identification for Co-located Group Awareness. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 4087--4096.  ",
      "doi": "10.1145/2556288.2557219"
    },
    {
      "text": "Michael Rohs and Antti Oulasvirta. 2008. Target Acquisition with Camera Phones when Used As Magic Lenses. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1409--1418.  ",
      "doi": "10.1145/1357054.1357275"
    },
    {
      "text": "Michael Rohs, Antti Oulasvirta, and Tiia Suomalainen. 2011. Interaction with Magic Lenses: Real-world Validation of a Fitts' Law Model. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2725--2728.  ",
      "doi": "10.1145/1978942.1979343"
    },
    {
      "text": "Alexander Schick, Florian van de Camp, Joris Ijsselmuiden, and Rainer Stiefelhagen. 2009. Extending Touch: Towards Interaction with Large-scale Surfaces. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09). ACM, New York, NY, USA, 117--124.  ",
      "doi": "10.1145/1731903.1731927"
    },
    {
      "text": "Garth Shoemaker, Takayuki Tsukitani, Yoshifumi Kitamura, and Kellogg S Booth. 2012. Two-part models capture the impact of gain on pointing performance. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 4 (2012), 28.  ",
      "doi": "10.1145/2395131.2395135"
    },
    {
      "text": "Sophie Stellmach, Sebastian Stober, Andreas Nürnberger, and Raimund Dachselt. 2011. Designing Gaze-supported Multimodal Interactions for the Exploration of Large Image Collections. In Proceedings of the 1st Conference on Novel Gaze-Controlled Applications (NGCA '11). ACM, New York, NY, USA, Article 1, 8 pages.  ",
      "doi": "10.1145/1983302.1983303"
    },
    {
      "text": "Helmut Strasser and Karl-Werner MÃijller. 1999. Favorable movements of the hand-arm system in the horizontal plane assessed by electromyographic investigations and subjective rating. International Journal of Industrial Ergonomics 23, 4 (1999), 339--347.",
      "doi": ""
    },
    {
      "text": "Robert J. Teather and Wolfgang Stuerzlinger. 2011. Pointing at 3D targets in a stereo head-tracked virtual environment. In 2011 IEEE Symposium on 3D User Interfaces (3DUI). 87--94. ",
      "doi": "10.5555/2013881.2014216"
    },
    {
      "text": "Kentaro Toyama. 1998. Look, ma-no hands! hands-free cursor control with real-time 3d face tracking. In Workshop on Perceptual User Interfaces (PUI '98). 49--54.",
      "doi": ""
    },
    {
      "text": "Jean-Luc Velay, Virginie Daffaure, Nathalie Raphael, and Simone Benoit-Dubrocard. 2001. Hemispheric asymmetry and interhemispheric transfer in pointing depend on the spatial components of the movement. Cortex 37, 1 (2001), 75--90.",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2005. Distant Freehand Pointing and Clicking on Very Large, High Resolution Displays. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology (UIST '05). ACM, New York, NY, USA, 33--42.  ",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Manuela Waldner and Dieter Schmalstieg. 2010. Experiences with Mouse Control in Multi-display Environments. In Proceedings of the International Conference on Advanced Visual Interfaces (AVI '10). ACM, New York, NY, USA, 411--411.  ",
      "doi": "10.1145/1842993.1843089"
    },
    {
      "text": "Andrew D. Wilson and Hrvoje Benko. 2016. Projected Augmented Reality with the RoomAlive Toolkit. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 517--520.  ",
      "doi": "10.1145/2992154.2996362"
    },
    {
      "text": "Robert Xiao, Miguel A. Nacenta, Regan L. Mandryk, Andy Cockburn, and Carl Gutwin. 2011. Ubiquitous Cursor: A Comparison of Direct and Indirect Pointing Feedback in Multi-display Environments. In Proceedings of Graphics Interface 2011 (GI '11). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 135--142. http://dl.acm.org/citation.cfm?id=1992917.1992939 ",
      "doi": "10.5555/1992917.1992939"
    },
    {
      "text": "Hui-Shyong Yeo. 2016. Single-handed Interaction for Mobile and Wearable Computing. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, New York, NY, USA, 907--908.  ",
      "doi": "10.1145/2957265.2963110"
    },
    {
      "text": "Hui-Shyong Yeo, Xiao-Shen Phang, Steven J. Castellucci, Per Ola Kristensson, and Aaron Quigley. 2017. Investigating Tilt-based Gesture Keyboard Entry for Single-Handed Text Entry on Large Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4194--4202.  ",
      "doi": "10.1145/3025453.3025520"
    }
  ]
}