{
  "doi": "10.1145/3173574.3173684",
  "title": "PHUI-kit: Interface Layout and Fabrication on Curved 3D Printed Objects",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "We seek to make physical user interface (PHUI) design more like graphical user interface (GUI) design by using a drag-and drop interface to place widgets, allowing widgets to be repositioned and by hiding implementation details. PHUIs are interfaces built from tangible widgets arranged on the surfaces of physical objects. PHUI layout will become more important as we move from rectangular screens to purpose-built interactive devices. Approaches to PHUI layout based on sculpture make it difficult to reposition widgets, and software approaches do not involve placing widgets on the device exterior. We created PHUI-kit, a software approach to PHUI layout on 3D printed enclosures, which has a drag-and-drop interface, supports repositioning of widgets, and hides implementation details. We describe algorithms for placing widgets on curved surfaces, modifying the enclosure geometry, and routing wiring inside the enclosure. The tool is easy to use and supports a wide range of design possibilities.",
  "tags": [
    "fabrication",
    "user interface layout",
    "internet of things",
    "maker culture"
  ],
  "authors": [
    {
      "name": "Michael D. Jones",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407592837",
      "orcid": "missing"
    },
    {
      "name": "Zann Anderson",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659070644",
      "orcid": "missing"
    },
    {
      "name": "Casey Walker",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659072130",
      "orcid": "missing"
    },
    {
      "name": "Kevin Seppi",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022748",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Daniel Avrahami and Scott E. Hudson. 2002. Forming Interactivity: A Tool for Rapid Prototyping of Physical Interactive Products. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, New York, NY, USA, 141--146.  ",
      "doi": "10.1145/778712.778735"
    },
    {
      "text": "Moritz Bächer, Emily Whiting, Bernd Bickel, and Olga Sorkine-Hornung. 2014. Spin-it: Optimizing Moment of Inertia for Spinnable Objects. ACM Trans. Graph. 33, 4, Article 96 (July 2014), 10 pages.  ",
      "doi": "10.1145/2601097.2601157"
    },
    {
      "text": "W. Buxton, M. R. Lamb, D. Sherman, and K. C. Smith. 1983. Towards a Comprehensive User Interface Management System. In Proceedings of the 10th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '83). ACM, New York, NY, USA, 35--42.  ",
      "doi": "10.1145/800059.801130"
    },
    {
      "text": "Saul Greenberg and Chester Fitchett. 2001. Phidgets: Easy Development of Physical Interfaces Through Physical Widgets. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, New York, NY, USA, 209--218.  ",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang 'Anthony' Chen, Tom Yeh, Scott E. Hudson, Jennifer Mankoff, and Jeffrey P. Bigham. 2017. Facade: Auto-generating Tactile Interfaces to Appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5826--5838.  ",
      "doi": "10.1145/3025453.3025845"
    },
    {
      "text": "Yijiang Huang, Juyong Zhang, Xin Hu, Guoxian Song, Zhongyuan Liu, Lei Yu, and Ligang Liu. 2016. FrameFab: Robotic Fabrication of Frame Shapes. ACM Trans. Graph. 35, 6, Article 224 (Nov. 2016), 11 pages.  ",
      "doi": "10.1145/2980179.2982401"
    },
    {
      "text": "Scott E. Hudson and Jennifer Mankoff. 2006. Rapid Construction of Functioning Physical Interfaces from Cardboard, Thumbtacks, Tin Foil and Masking Tape. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 289--298.  ",
      "doi": "10.1145/1166253.1166299"
    },
    {
      "text": "Alexandra Ion, Ludwig Wall, Robert Kovacs, and Patrick Baudisch. 2017. Digital Mechanical Metamaterials. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 977--988.  ",
      "doi": "10.1145/3025453.3025624"
    },
    {
      "text": "Michael D. Jones, Kevin Seppi, and Dan R. Olsen. 2016. What You Sculpt is What You Get: Modeling Physical Interactive Devices with Clay and 3D Printed Widgets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 876--886.  ",
      "doi": "10.1145/2858036.2858493"
    },
    {
      "text": "Wonhyung Jung, Hayong Shin, and Byoung K Choi. 2004. Self-intersection removal in triangular mesh offsetting. Computer-Aided Design and Applications 1, 1--4 (2004), 477--484.",
      "doi": ""
    },
    {
      "text": "Timothy Langlois, Ariel Shamir, Daniel Dror, Wojciech Matusik, and David I. W. Levin. 2016. Stochastic Structural Analysis for Context-aware Design and Fabrication. ACM Trans. Graph. 35, 6, Article 226 (Nov. 2016), 13 pages.  ",
      "doi": "10.1145/2980179.2982436"
    },
    {
      "text": "Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2161--2170.  ",
      "doi": "10.1145/2702123.2702414"
    },
    {
      "text": "Steven M. LaValle and Jr. James J. Kuffner. 2001. Randomized Kinodynamic Planning. The International Journal of Robotics Research 20, 5 (2001), 378--400.",
      "doi": ""
    },
    {
      "text": "David Ledo, Fraser Anderson, Ryan Schmidt, Lora Oehlberg, Saul Greenberg, and Tovi Grossman. 2017. Pineal: Bringing Passive Objects to Life with Embedded Mobile Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2583--2593.  ",
      "doi": "10.1145/3025453.3025652"
    },
    {
      "text": "Johnny C. Lee, Daniel Avrahami, Scott E. Hudson, Jodi Forlizzi, Paul H. Dietz, and Darren Leigh. 2004. The Calder Toolkit: Wired and Wireless Components for Rapidly Prototyping Interactive Devices. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '04). ACM, New York, NY, USA, 167--175.  ",
      "doi": "10.1145/1013115.1013139"
    },
    {
      "text": "Dingzeyu Li, David I. W. Levin, Wojciech Matusik, and Changxi Zheng. 2016. Acoustic Voxels: Computational Optimization of Modular Acoustic Filters. ACM Trans. Graph. 35, 4, Article 88 (July 2016), 12 pages.  ",
      "doi": "10.1145/2897824.2925960"
    },
    {
      "text": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014. WirePrint: 3D Printed Previews for Fast Prototyping. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 273--280.  ",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. RetroFab: A Design Tool for Retrofitting Physical Interfaces Using Actuators, Sensors and 3D Printing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 409--419.  ",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: Embedded Single-camera Sensing of Printed Physical User Interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 447--456.  ",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015a. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 103--108.  ",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B. Goldman, Gautham Mysore, and Wilmot Li. 2015b. Lamello: Passive Acoustic Sensing for Tangible Input Components. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1277--1280.  ",
      "doi": "10.1145/2702123.2702207"
    },
    {
      "text": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 3--12.  ",
      "doi": "10.1145/2642918.2647374"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: Fabricating Custom Capacitive Touch Sensors to Prototype Interactive Objects. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Ondrej Stava, Juraj Vanek, Bedrich Benes, Nathan Carr, and Radomír Měch. 2012. Stress Relief: Improving Structural Strength of 3D Printable Objects. ACM Trans. Graph. 31, 4, Article 48 (July 2012), 11 pages.  ",
      "doi": "10.1145/2185520.2185544"
    },
    {
      "text": "Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison, and Scott E. Hudson. 2015. 3D Printing Pneumatic Device Controls with Variable Activation Force Capabilities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1295--1304.  ",
      "doi": "10.1145/2702123.2702569"
    },
    {
      "text": "Nicolas Villar, James Scott, Steve Hodges, Kerry Hammil, and Colin Miller. 2012. .NET Gadgeteer: A Platform for Custom Devices. In Proceedings of the 10th International Conference on Pervasive Computing (Pervasive'12). Springer-Verlag, Berlin, Heidelberg, 216--233.  ",
      "doi": "10.1007/978-3-642-31205-2_14"
    },
    {
      "text": "Christian Weichel, Manfred Lau, and Hans Gellersen. 2013. Enclosed: A Component-centric Interface for Designing Prototype Enclosures. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, New York, NY, USA, 215--218.  ",
      "doi": "10.1145/2460625.2460659"
    },
    {
      "text": "Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed Optics: 3D Printing of Embedded Optical Elements for Interactive Devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 589--598.  ",
      "doi": "10.1145/2380116.2380190"
    }
  ]
}