{
  "doi": "10.1145/3173574.3174199",
  "title": "Designing for Diabetes Decision Support Systems with Fluid Contextual Reasoning",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Type 1 diabetes is a potentially life-threatening chronic condition that requires frequent interactions with diverse data to inform treatment decisions. While mobile technologies such as blood glucose meters have long been an essential part of this process, designing interfaces that explicitly support decision-making remains challenging. Dual-process models are a common approach to understanding such cognitive tasks. However, evidence from the first of two studies we present suggests that in demanding and complex situations, some individuals approach disease management in distinctive ways that do not seem to fit well within existing models. This finding motivated, and helped frame our second study, a survey (n=192) to investigate these behaviors in more detail. On the basis of the resulting analysis, we posit Fluid Contextual Reasoning to explain how some people with diabetes respond to particular situations, and discuss how an extended framework might help inform the design of user interfaces for diabetes management.",
  "tags": [
    "health",
    "ubiquitous computing",
    "pervasive com-puting",
    "chronic conditions",
    "wearable interaction",
    "quanti-fied self",
    "personal informatics",
    "mhealth",
    "internet of things",
    "apps",
    "digital health"
  ],
  "authors": [
    {
      "name": "Dmitri S. Katz",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659072041",
      "orcid": "missing"
    },
    {
      "name": "Blaine A. Price",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100551103",
      "orcid": "missing"
    },
    {
      "name": "Simon Holland",
      "institution": "The Open University, Milton Keynes, Buckinghamshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100092137",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Sheep Dalton",
      "institution": "Nortumbria University & Open University, Newcastle, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021776",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Florencia Aguiree, Alex Brown, Nam Ho Cho, Gisela Dahlquist, Sheree Dodd, Trisha Dunning, Michael Hirst, Christopher Hwang, Dianna Magliano, and Chris Patterson. 2013. IDF Diabetes Atlas.",
      "doi": ""
    },
    {
      "text": "American Association of Diabetes Educators. 2009. AADE Guidelines for the Practice of Diabetes Self-Management Education and Training (DSME/T). The Diabetes Educator 35, 3 Suppl: 85S--107S.",
      "doi": ""
    },
    {
      "text": "Eirik Arsand, Dag Helge Frøisland, Stein Olav Skrøvseth, Taridzo Chomutare, Naoe Tatara, Gunnar Hartvigsen, and James T. Tufano. 2012. Mobile health applications to assist patients with diabetes: lessons learned and design implications. Journal of diabetes science and technology 6, 5: 1197--1206. Retrieved February 11, 2015 from http://dst.sagepub.com/content/6/5/1197.short",
      "doi": ""
    },
    {
      "text": "Tom L. Beauchamp and James F. Childress. 2001. Principles of biomedical ethics. Oxford University Press, USA.",
      "doi": ""
    },
    {
      "text": "Katherine Blondon, MSc1 Predrag Klasnja, and M. H. A. Logan Kendall. 2013. Long-term engagement with health--management technology: a dynamic process in diabetes1. Katherine S Blondon: 37. Retrieved No-vember 17, 2016 from https://digital.lib.washington.edu/researchworks/bitstream/handle/1773/23784/Blondon_washington_0250E_11783.pdf'sequence=1&isAllowed=y#page=44",
      "doi": ""
    },
    {
      "text": "Jonathan St. B. T. Evans and Keith E. Stanovich. 2013. Dual-Process Theories of Higher Cognition: Advancing the Debate. Perspectives on Psychological Science 8, 3: 223--241.",
      "doi": ""
    },
    {
      "text": "Martha Mitchell Funnell and Robert M. Anderson. 2000. The Problem With Compliance in Diabetes. JAMA 284, 13: 1709.",
      "doi": ""
    },
    {
      "text": "Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich, and Matthew P. Buman. 2013. Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. In Proceedings of the SIGCHI Con-ference on Human Factors in Computing Systems, 3307--3316. Retrieved March 7, 2016 from http://dl.acm.org/citation.cfm?id=2466452  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Eric B. Hekler, Susan Michie, Misha Pavel, Daniel E. Rivera, Linda M. Collins, Holly B. Jimison, Claire Garnett, Skye Parral, and Donna Spruijt-Metz. 2016. Advancing Models and Theories for Digital Behavior Change Interventions. American Journal of Preventive Medicine 51, 5: 825--832.",
      "doi": ""
    },
    {
      "text": "Stephen S. Intille. 2004. Ubiquitous computing tech-nology for just-in-time motivation of behavior change. Stud Health Technol Inform 107, Pt 2: 1434--7.",
      "doi": ""
    },
    {
      "text": "1Dmitri Katz, Nick Dalton, Simon Holland, Aisling O'Kane, and Blaine A. Price. 2017. Questioning the Reflection Paradigm for Diabetes Mobile Apps. In eHealth 360°: International Summit on eHealth, Bu-dapest, Hungary, June 14--16, 2016, Revised Selected Papers, Kostas Giokas, Laszlo Bokor and Frank Hopfgartner (eds.). Springer International Publishing, Cham, 315--326. Retrieved from",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2011. Under-standing my data, myself: supporting self-reflection with ubicomp technologies. In Proceedings of the 13th international conference on Ubiquitous computing, 405--414. Retrieved April 14, 2015 from http://dl.acm.org/citation.cfm?id=2030166  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "James J. Lin, Lena Mamykina, Silvia Lindtner, Grego-ry Delajoux, and Henry B. Strub. 2006. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game.",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In Proceedings of the SIGCHI Confer-ence on Human Factors in Computing Systems, 477--486. Retrieved February 11, 2015 from http://dl.acm.org/citation.cfm?id=1357131  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Lena Mamykina, Arlene M. Smaldone, and Suzanne R. Bakken. 20 Adopting the sensemaking perspec-tive for chronic disease self-management. Journal of biomedical informatics 56: 406--417.  ",
      "doi": "10.1016/j.jbi.2015.06.006"
    },
    {
      "text": "Rob Meredith and David Arnott. 2003. On ethics and decision support systems development. In On Ethics and Decision Support Systems Development. PACIS 2003 Proceedings. Paper 106. Retrieved Nove 6, 2016 from https://works.bepress.com/david_arnott/1/download/",
      "doi": ""
    },
    {
      "text": "Susan Michie, Maartje M. van Stralen, and Robert West. 2011. The behaviour change wheel: a new meth-od for characterising and designing behaviour change interventions. Implementation Science 6, 1: 42. Re-trieved May 30, 2016 from http://www.",
      "doi": ""
    },
    {
      "text": "implementationscience.com/content/6/1/42/",
      "doi": ""
    },
    {
      "text": "Kellee M. Miller, Nicole C. Foster, Roy W. Beck, Richard M. Bergenstal, Stephanie N. DuBose, Linda A. DiMeglio, David M. Maahs, and William V. Tam-borlane. 2015. Current State of Type 1 Diabetes Treatment in the U.S.: Updated Data From the T1D Exchange Clinic Registry. Diabetes Care 38, 6: 971--978.",
      "doi": ""
    },
    {
      "text": "Veljko Pejovic and Mirco Musolesi. 2014. Anticipa-tory mobile computing for behaviour change interven-tions. 1025--1034.  ",
      "doi": "10.1145/2638728.2641284"
    },
    {
      "text": "Sohail Rafiqi, Chatchai Wangwiwattana, Jasmine Kim, Ephrem Fernandez, Suku Nair, and Eric C. Lar-son. 2015. PupilWare: towards pervasive cognitive load measurement using commodity devices. In Pro-ceedings of the 8th ACM International Conference on PErvasive Technologies Related to Assistive Environ-ments, 42. Retrieved March 21, 2017 from http://dl.acm.org/citation.cfm?id=2769506  ",
      "doi": "10.1145/2769493.2769506"
    },
    {
      "text": "2Keith E. Stanovich. 2009. Distinguishing the reflec-tive, algorithmic, and autonomous minds: Is it time for a tri-process theory. In two minds: Dual processes and beyond: 55--88. Retrieved January 13, 2017 from http://keithstanovich.com/Site/Research_on_Reasoning_files/Stanovich_Two_MInds.pdf",
      "doi": ""
    },
    {
      "text": "2Katarzyna Stawarz, Anna L. Cox, and Ann Blandford. 2015. Beyond self-tracking and reminders: designing smartphone apps that support habit formation. In Pro-ceedings of the 33rd Annual ACM Conference on Hu-man Factors in Computing Systems, 2653--2662.  ",
      "doi": "10.1145/2702123.2702230"
    },
    {
      "text": "Alexandra L. Varga and Kai Hamburger. 2014. Beyond type 1 vs. type 2 processing: the tri-dimensional way. Frontiers in Psychology 5.",
      "doi": ""
    }
  ]
}