{
  "doi": "10.1145/3173574.3173862",
  "title": "Analysis and Modeling of Grid Performance on Touchscreen Mobile Devices",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Touchscreen mobile devices can afford rich interaction behaviors but they are complex to model. Scrollable two-dimensional grids are a common user interface on mobile devices that allow users to access a large number of items on a small screen by direct touch. By analyzing touch input and eye gaze of users during grid interaction, we reveal how multiple performance components come into play in such a task, including navigation, visual search and pointing. These findings inspired us to design a novel predictive model that combines these components for modeling grid tasks. We realized these model components by employing both traditional analytical methods and data-driven machine learning approaches. In addition to showing high accuracy achieved by our model in predicting human performance on a test dataset, we demonstrate how such a model can lead to a significant reduction in interaction time when used in a predictive user interface.",
  "tags": [
    "predictive interfaces",
    "touchscreen mobile device",
    "machine learning",
    "performance modeling",
    "grid ui"
  ],
  "authors": [
    {
      "name": "Ken Pfeuffer",
      "institution": "Google Research & Machine Intelligence -and- Lancaster University, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549578256",
      "orcid": "0000-0002-5870-1120"
    },
    {
      "name": "Yang Li",
      "institution": "Google Research & Machine Intelligence, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    }
  ],
  "references": [
    {
      "text": "Martin Abadi, Paul Barham, Jianmin Chen, Zhifeng Chen, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Geoffrey Irving, Michael Isard, Manjunath Kudlur, Josh Levenberg, Rajat Monga, Sherry Moore, Derek G. Murray, Benoit Steiner, Paul Tucker, Vijay Vasudevan, Pete Warden, Martin Wicke, Yuan Yu, and Xiaoqiang Zheng. 2016. TensorFlow: A system for large-scale machine learning. In 12th USENIX Symposium on Operating Systems Design and Implementation (OSDI 16). 265--283. https://www.usenix. org/system/files/conference/osdi16/osdi16-abadi.pdf ",
      "doi": "10.5555/3026877.3026899"
    },
    {
      "text": "Johnny Accot and Shumin Zhai. 1997. Beyond Fitts' Law: Models for Trajectory-based HCI Tasks. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, New York, NY, USA, 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "David Ahlström, Andy Cockburn, Carl Gutwin, and Pourang Irani. 2010. Why It's Quick to Be Square: Modelling New and Existing Hierarchical Menu Designs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1371--1380.  ",
      "doi": "10.1145/1753326.1753534"
    },
    {
      "text": "Tue Haste Andersen. 2005. A Simple Movement Time Model for Scrolling. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1180--1183.  ",
      "doi": "10.1145/1056808.1056871"
    },
    {
      "text": "John R. Anderson, Michael Matessa, and Christian Lebiere. 1997. ACT-R: A Theory of Higher Level Cognition and Its Relation to Visual Attention. Hum.-Comput. Interact. 12, 4 (Dec. 1997), 439--462.  ",
      "doi": "10.1207/s15327051hci1204_5"
    },
    {
      "text": "Gilles Bailly, Eric Lecolinet, and Laurence Nigay. 2016. Visual Menu Techniques. ACM Comput. Surv. 49, 4, Article 60 (Dec. 2016), 41 pages.  ",
      "doi": "10.1145/3002171"
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Duncan P. Brumby, and Andrew Howes. 2014. Model of Visual Search and Selection Time in Linear Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3865--3874.  ",
      "doi": "10.1145/2556288.2557093"
    },
    {
      "text": "Nikola Banovic, Tovi Grossman, and George Fitzmaurice. 2013. The Effect of Time-based Cost of Error in Target-directed Pointing Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1373--1382.  ",
      "doi": "10.1145/2470654.2466181"
    },
    {
      "text": "Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts Law: Modeling Finger Touch with Fitts' Law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1363--1372.  ",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Hans-Joachim Bieg, Lewis L. Chuang, Roland W. Fleming, Harald Reiterer, and Heinrich H. Bülthoff. 2010. Eye and Pointer Coordination in Search and Selection Tasks. In Proceedings of the 2010 Symposium on Eye-Tracking Research & Applications (ETRA '10). ACM, New York, NY, USA, 89--92.  ",
      "doi": "10.1145/1743666.1743688"
    },
    {
      "text": "Matthias Böhmer and Antonio Krüger. 2013. A Study on Icon Arrangement by Smartphone Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2137--2146.  ",
      "doi": "10.1145/2470654.2481294"
    },
    {
      "text": "Micheal D. Byrne. 2001. ACT-R/PM and Menu Selection. Int. J. Hum.-Comput. Stud. 55, 1 (July 2001), 41--84.  ",
      "doi": "10.1006/ijhc.2001.0469"
    },
    {
      "text": "Michael D. Byrne, John R. Anderson, Scott Douglass, and Michael Matessa. 1999. Eye Tracking the Visual Search of Click-down Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 402--409.  ",
      "doi": "10.1145/302979.303118"
    },
    {
      "text": "Xiang Cao, Jacky Jie Li, and Ravin Balakrishnan. 2008. Peephole Pointing: Modeling Acquisition of Dynamically Revealed Targets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1699--1708.  ",
      "doi": "10.1145/1357054.1357320"
    },
    {
      "text": "Stuart K. Card. 1982. User Perceptual Mechanisms in the Search of Computer Command Menus. In Proceedings of the 1982 Conference on Human Factors in Computing Systems (CHI '82). ACM, New York, NY, USA, 190--196.  ",
      "doi": "10.1145/800049.801779"
    },
    {
      "text": "Géry Casiez, Daniel Vogel, Qing Pan, and Christophe Chaillou. 2007. RubberEdge: Reducing Clutching by Combining Position and Rate Control with Elastic Feedback. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 129--138.  ",
      "doi": "10.1145/1294211.1294234"
    },
    {
      "text": "Andy Cockburn and Carl Gutwin. 2009. A predictive model of human performance with scrolling and hierarchical lists. Human-Computer Interaction 24, 3 (2009), 273--314.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn and Carl Gutwin. 2010. A Model of Novice and Expert Navigation Performance in Constrained-input Interfaces. ACM Trans. Comput.-Hum. Interact. 17, 3, Article 13 (July 2010), 38 pages.  ",
      "doi": "10.1145/1806923.1806927"
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Saul Greenberg. 2007. A Predictive Model of Menu Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 627--636.  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "Michael D Fleetwood and Michael D Byrne. 2002. Modeling Icon Search in ACT-R/PM. Cogn. Syst. Res. 3, 1 (March 2002), 25--33.  ",
      "doi": "10.1016/S1389-0417%2801%2900041-9"
    },
    {
      "text": "William E Hick. 1952. On the rate of gain of information. Quarterly Journal of Experimental Psychology 4, 1 (1952), 11--26.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Edward Cutrell, Steve Bathiche, and Tim Muss. 2002. Quantitative Analysis of Scrolling Techniques. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 65--72.  ",
      "doi": "10.1145/503376.503389"
    },
    {
      "text": "Jussi P. P. Jokinen, Sayan Sarcar, Antti Oulasvirta, Chaklam Silpasuwanchai, Zhenxin Wang, and Xiangshi Ren. 2017. Modelling Learning of New Keyboard Layouts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4203--4215.  ",
      "doi": "10.1145/3025453.3025580"
    },
    {
      "text": "David E. Kieras and David E. Meyer. 1997. An Overview of the EPIC Architecture for Cognition and Performance with Application to Human-computer Interaction. Hum.-Comput. Interact. 12, 4 (Dec. 1997), 391--438.  ",
      "doi": "10.1207/s15327051hci1204_4"
    },
    {
      "text": "David M. Lane, H. Albert Napier, Richard R. Batsell, and John L. Naman. 1993. Predicting the Skilled Use of Hierarchical Menus with the Keystroke-level Model. Hum.-Comput. Interact. 8, 2 (June 1993), 185--192.  ",
      "doi": "10.1207/s15327051hci0802_4"
    },
    {
      "text": "I Scott MacKenzie. 1992. Fitts' law as a research and design tool in human-computer interaction. Human-computer interaction 7, 1 (1992), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "James E McDonald, Jim D Stone, and Linda S Liebelt. 1983. Searching for items in menus: The effects of organization and type of target. In Proceedings of the Human Factors Society Annual Meeting, Vol. 27. SAGE Publications Sage CA: Los Angeles, CA, 834--837.",
      "doi": ""
    },
    {
      "text": "Brad Mehlenbacher, Thomas M. Duffy, and James Palmer. 1989. Finding Information on a Menu: Linking Menu Organization to the User's Goals. Hum.-Comput. Interact. 4, 3 (Sept. 1989), 231--251.  ",
      "doi": "10.1207/s15327051hci0403_3"
    },
    {
      "text": "A. Newell and P. S. Rosenbloom. 1993. The Soar Papers (Vol. 1). MIT Press, Cambridge, MA, USA, Chapter Mechanisms of Skill Acquisition and the Law of Practice, 81--135. http://dl.acm.org/citation.cfm?id=162580.162586 ",
      "doi": "10.5555/162580.162586"
    },
    {
      "text": "Erik Lloyd Nilsen. 1991. Perceptual-motor Control in Human-computer Interaction. Ph.D. Dissertation. Ann Arbor, MI, USA. UMI Order No. GAX91--35659.",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer, Jason Alexander, and Hans Gellersen. 2016. Partially-indirect Bimanual Input with Gaze, Pen, and Touch for Pan, Zoom, and Ink Interaction. In Proc. CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, USA, 2845--2856.  ",
      "doi": "10.1145/2858036.2858201"
    },
    {
      "text": "Philip Quinn, Sylvain Malacria, and Andy Cockburn. 2013. Touch Scrolling Transfer Functions. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 61--70.  ",
      "doi": "10.1145/2501988.2501995"
    },
    {
      "text": "Michael Rohs and Antti Oulasvirta. 2008. Target Acquisition with Camera Phones when Used As Magic Lenses. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1409--1418.  ",
      "doi": "10.1145/1357054.1357275"
    },
    {
      "text": "Joey Scarr, Andy Cockburn, Carl Gutwin, and Andrea Bunt. 2012. Improving Command Selection with CommandMaps. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 257--266.  ",
      "doi": "10.1145/2207676.2207713"
    },
    {
      "text": "Joey Scarr, Andy Cockburn, Carl Gutwin, and Sylvain Malacria. 2013. Testing the Robustness and Performance of Spatially Consistent Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3139--3148.  ",
      "doi": "10.1145/2470654.2466430"
    },
    {
      "text": "Barton A. Smith, Janet Ho, Wendy Ark, and Shumin Zhai. 2000. Hand Eye Coordination Patterns in Target Selection. In Proceedings of the 2000 Symposium on Eye Tracking Research & Applications (ETRA '00). ACM, New York, NY, USA, 117--122.  ",
      "doi": "10.1145/355017.355041"
    },
    {
      "text": "Benjamin L. Somberg. 1987. A Comparison of Rule-based and Positionally Constant Arrangements of Computer Menu Items. In Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface (CHI '87). ACM, New York, NY, USA, 255--260.  ",
      "doi": "10.1145/29933.275639"
    },
    {
      "text": "The Statistics Portal Statistica. 2016. Statistica, The Statistics Portal. (2016). Retrieved Febuary 2, 2015 from https://www.statista.com/statistics/681206/ us-app-installation-usage-device/.",
      "doi": ""
    },
    {
      "text": "Shumin Zhai, Barton A. Smith, and Ted Selker. 1997. Improving Browsing Performance: A Study of Four Input Devices for Scrolling and Pointing Tasks. In Proceedings of the IFIP TC13 Interantional Conference on Human-Computer Interaction (INTERACT '97). Chapman & Hall, Ltd., London, UK, UK, 286--293. http://dl.acm.org/citation.cfm?id=647403.723823 ",
      "doi": "10.5555/647403.723823"
    },
    {
      "text": "Jian Zhao, R William Soukoreff, Xiangshi Ren, and Ravin Balakrishnan. 2014. A model of scrolling on touch-sensitive displays. International Journal of Human-Computer Studies 72, 12 (2014), 805--821.",
      "doi": ""
    },
    {
      "text": "G.K. Zipf. 1949. Human behavior and the principle of least effort: an introduction to human ecology. Addison-Wesley Press. http://psycnet.apa.org/record/2005--10806-009",
      "doi": ""
    }
  ]
}