{
  "doi": "10.1145/3173574.3173603",
  "title": "Predicting Human Performance in Vertical Menu Selection Using Deep Learning",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-7",
  "year": 2018,
  "badges": [],
  "abstract": "Predicting human performance in interaction tasks allows designers or developers to understand the expected performance of a target interface without actually testing it with real users. In this work, we present a deep neural net to model and predict human performance in performing a sequence of UI tasks. In particular, we focus on a dominant class of tasks, i.e., target selection from a vertical list or menu. We experimented with our deep neural net using a public dataset collected from a desktop laboratory environment and a dataset collected from hundreds of touchscreen smartphone users via crowdsourcing. Our model significantly outperformed previous methods on these datasets. Importantly, our method, as a deep model, can easily incorporate additional UI attributes such as visual appearance and content semantics without changing model architectures. By understanding about how a deep learning model learns from human behaviors, our approach can be seen as a vehicle to discover new patterns about human behaviors to advance analytical modeling.",
  "tags": [
    "deep learning",
    "lists",
    "performance modeling",
    "tensorflow",
    "recurrent neural networks",
    "touchscreen",
    "lstm",
    "menus"
  ],
  "authors": [
    {
      "name": "Yang Li",
      "institution": "Google Research & Machine Intelligence, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    },
    {
      "name": "Samy Bengio",
      "institution": "Google Research & Machine Intelligence and Google Brain, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100287032",
      "orcid": "missing"
    },
    {
      "name": "Gilles Bailly",
      "institution": "Sorbonne Université, CNRS, Paris, France",
      "img": "/do/10.1145/contrib-81309498332/rel-imgonly/bailly.jpg",
      "acmid": "81309498332",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bahdanau, D., Cho, K., and Bengio, Y., Neural Machine Translation by Jointly Learning to Align and Translate. ICLR 15: International Conference on Learning Representations, 2015.",
      "doi": ""
    },
    {
      "text": "Bailly, G., Oulasvirta, A., Brumby, D.P., and Howes, A. Model of visual search and selection time in linear menus. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2014. 3865--3874.  ",
      "doi": "10.1145/2556288.2557093"
    },
    {
      "text": "Bi, X., Li, Y., and Zhai, S. FFitts Law: Modeling Finger Touch With Fitts' Law. CHI 2013: ACM Conference on Human Factors in Computing Systems. 2013.  ",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Byrne, M.D., ACT-R/PM and menu selection: Applying a cognitive architecture to HCI. International Journal of Human-Computer Studies, 2001. 55(1): p. 41--84.  ",
      "doi": "10.1006/ijhc.2001.0469"
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A., The keystroke-level model for user performance time with interactive systems. Communications of the ACM, 1980. 23(7): p. 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Chen, X., Bailly, G., Brumby, D.P., Oulasvirta, A., and Howes, A. The Emergence of Interactive Behavior: A Model of Rational Menu Search. CHI'15: ACM Conference of Human Factors in Computing Systems. 2015. 4217--4226.  ",
      "doi": "10.1145/2702123.2702483"
    },
    {
      "text": "Cockburn, A., Gutwin, C., and Greenberg, S. A predictive model of menu performance. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2007. 627--636  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "Fitts, P.M., The Information Capacity of the Human Motor System in Controlling the Amplitude of Movement. Journal of Experimental Psychology, 1954. 121(3): p. 381--391.",
      "doi": ""
    },
    {
      "text": "Graves, A., Supervised Sequence Labelling with Recurrent Neural Networks. Studies in Computational Intelligence. 2012: Springer.",
      "doi": ""
    },
    {
      "text": "Halverson, T. and Hornof, A.J., A Computational Model of \"Active Vision\" for Visual Search in Human--Computer Interaction. Human-Computer Interaction, 2011. 26(4): p. 285--314.  ",
      "doi": "10.5555/2499325.2499326"
    },
    {
      "text": "Hick, W.E., On the rate of gain of information. Journal of Experimental Psychology, 1952. 4(1): p. 11--26.",
      "doi": ""
    },
    {
      "text": "Hochreiter, S. and Schmidhuber, J.u., Long Short-Term Memory. Neural Computation, 1997. 9(8): p. 1735--1780.  ",
      "doi": "10.1162/neco.1997.9.8.1735"
    },
    {
      "text": "Kaptelinin, V. Item recognition in menu selection: the effect of practice. CHI '93 INTERACT '93 and CHI '93 Conference Companion on Human Factors in Computing Systems. 1993. 183--184.  ",
      "doi": "10.1145/259964.260196"
    },
    {
      "text": "Kieras, D.E. and Meyer, D.E., An overview of the EPIC architecture for cognition and performance with application to human-computer interaction. Hum.-Comput. Interact., 1997. 12(4): p. 391--438.  ",
      "doi": "10.1207/s15327051hci1204_4"
    },
    {
      "text": "LeCun, Y., Bengio, Y., and Hinton, G., Deep learning. Nature, 2015(521): p. 436--444.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. and Buxton, W. Extending Fitts' law to two-dimensional tasks. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1992. 219--226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "Martín Abadi, P.B., Jianmin Chen, Zhifeng Chen, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Geoffrey Irving, Michael Isard, Manjunath Kudlur, Josh Levenberg, Rajat Monga, Sherry Moore, Derek G. Murray, Benoit Steiner, Paul Tucker, Vijay Vasudevan, Pete Warden, Martin Wicke, Yuan Yu, Xiaoqiang Zheng. TensorFlow: A system for large-scale machine learning. 12th USENIX Symposium on Operating Systems Design and Implementation (OSDI 16). 2016. 265--283. ",
      "doi": "10.5555/3026877.3026899"
    },
    {
      "text": "Nair, V. and Hinton, G.E. Rectified Linear Units Improve Restricted Boltzmann Machines. ICML: Proceedings of the 27 th International Conference on Machine Learning. 2010. ",
      "doi": "10.5555/3104322.3104425"
    },
    {
      "text": "Näsänena, R., Ojanpääa, H., and Kojob, I., Effect of stimulus contrast on performance and eye movements in visual search. Vision Research, 2001. 41(14): p. 1817--1824.",
      "doi": ""
    },
    {
      "text": "Pennington, J., Socher, R., and Manning, C.D. GloVe: Global Vectors for Word Representation. 2014.",
      "doi": ""
    },
    {
      "text": "Sears, A. and Shneiderman, B., Split menus: effectively using selection frequency to organize menus. ACM Trans. Comput.-Hum. Interact., 1994. 1(1): p. 27--51.  ",
      "doi": "10.1145/174630.174632"
    }
  ]
}