{
  "doi": "10.1145/3173574.3173970",
  "title": "Non-Native English Speakers Learning Computer Programming: Barriers, Desires, and Design Opportunities",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "People from nearly every country are now learning computer programming, yet the majority of programming languages, libraries, documentation, and instructional materials are in English. What barriers do non-native English speakers face when learning from English-based resources? What desires do they have for improving instructional materials? We investigate these questions by deploying a survey to a programming education website and analyzing 840 responses spanning 86 countries and 74 native languages. We found that non-native English speakers faced barriers with reading instructional materials, technical communication, reading and writing code, and simultaneously learning English and programming. They wanted instructional materials to use simplified English without culturally-specific slang, to use more visuals and multimedia, to use more culturally-agnostic code examples, and to embed inline dictionaries. Programming also motivated some to learn English better and helped clarify logical thinking about natural languages. Based on these findings, we recommend learner-centered design improvements to programming-related instructional resources and tools to make them more accessible to people around the world.",
  "tags": [
    "non-native english speakers",
    "learning programming"
  ],
  "authors": [
    {
      "name": "Philip J. Guo",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315488891",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2016. About Scratch. https://scratch.mit.edu/about. (2016). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "2017. Ethnologue: Languages of the World -- English. https://www.ethnologue.com/language/eng. (2017). Accessed: 2017-09-05.",
      "doi": ""
    },
    {
      "text": "2017. MOOC List -- Find MOOCs By Languages. https: //www.mooc-list.com/languages'static=true. (2017). Accessed: 2017-09-05.",
      "doi": ""
    },
    {
      "text": "2017. Simple English Wikipedia. https://simple.wikipedia.org/wiki/Main_Page. (2017). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Christine Alvarado and Zachary Dodds. 2010. Women in CS: An Evaluation of Three Promising Practices. In Proceedings of the 41st ACM Technical Symposium on Computer Science Education (SIGCSE '10). ACM, New York, NY, USA, 57--61.  ",
      "doi": "10.1145/1734263.1734281"
    },
    {
      "text": "Apple. 2017. Introduction to Coding Guidelines for Cocoa. https://developer.apple.com/library/ content/documentation/Cocoa/Conceptual/ CodingGuidelines/CodingGuidelines.html. (2017). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Computing Research Association. 2016. The Taulbee Survey. http://cra.org/resources/taulbee-survey/. (2016). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Jeff Atwood. 2009. Stack Overflow Blog: Non-English Question Policy. https://stackoverflow.blog/2009/ 07/23/non-english-question-policy/. (2009). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "ISO 639--2 Registration Authority. 2017. Codes for the Representation of Names of Languages. https://www.loc.gov/standards/iso639--2/. (2017). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Mordechai Ben-Ari and Jorma Sajaniemi. 2004. Roles of Variables As Seen by CS Educators. In Proceedings of the 9th Annual SIGCSE Conference on Innovation and Technology in Computer Science Education (ITiCSE '04). ACM, New York, NY, USA, 52--56.  ",
      "doi": "10.1145/1007996.1008013"
    },
    {
      "text": "Coursera blog. 2012. Coursera hits 1 million students across 196 countries. https://blog.coursera.org/ coursera-hits-1-million-students-across-196/. (2012). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Bo Brinkman and Amanda Diekman. 2016. Applying the Communal Goal Congruity Perspective to Enhance Diversity and Inclusion in Undergraduate Computing Degrees. In Proceedings of the 47th ACM Technical Symposium on Computing Science Education (SIGCSE '16). ACM, New York, NY, USA, 102--107.  ",
      "doi": "10.1145/2839509.2844562"
    },
    {
      "text": "Pauli Byckling, Petri Gerdt, and Jorma Sajaniemi. 2005. Roles of Variables in Object-oriented Programming. In Companion to the 20th Annual ACM SIGPLAN Conference on Object-oriented Programming, Systems, Languages, and Applications (OOPSLA '05). ACM, New York, NY, USA, 350--355.  ",
      "doi": "10.1145/1094855.1094972"
    },
    {
      "text": "Carrie J. Cai, Philip J. Guo, James R. Glass, and Robert C. Miller. 2015. Wait-Learning: Leveraging Wait Time for Second Language Education. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3701--3710.  ",
      "doi": "10.1145/2702123.2702267"
    },
    {
      "text": "Parmit K. Chilana, Rishabh Singh, and Philip J. Guo. 2016. Understanding Conversational Programmers: A Perspective from the Software Industry. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1462--1472.  ",
      "doi": "10.1145/2858036.2858323"
    },
    {
      "text": "Artem Chistyakov. 2017. The language of programming. https://temochka.com/blog/posts/2017/06/28/ the-language-of-programming.html. (Jun 2017).",
      "doi": ""
    },
    {
      "text": "Patricia H. Collins. 2015. Intersectionality's Definitional Dilemmas. Annual Review of Sociology 41, 1 (2015), 1--20.",
      "doi": ""
    },
    {
      "text": "Juliet M. Corbin and Anselm L. Strauss. 2008. Basics of qualitative research: techniques and procedures for developing grounded theory. SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Sayamindu Dasgupta and Benjamin Mako Hill. 2017. Learning to Code in Localized Programming Languages. In Proceedings of the Fourth (2017) ACM Conference on Learning @ Scale (L@S '17). ACM, New York, NY, USA, 33--39.  ",
      "doi": "10.1145/3051457.3051464"
    },
    {
      "text": "Betsy DiSalvo, Mark Guzdial, Charles Meadows, Ken Perry, Tom McKlin, and Amy Bruckman. 2013. Workifying Games: Successfully Engaging African American Gamers with Computer Science. In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (SIGCSE '13). ACM, New York, NY, USA, 317--322.  ",
      "doi": "10.1145/2445196.2445292"
    },
    {
      "text": "Betsy DiSalvo, Sarita Yardi, Mark Guzdial, Tom McKlin, Charles Meadows, Kenneth Perry, and Amy Bruckman. 2011. African American Men Constructing Computing Identity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2967--2970.  ",
      "doi": "10.1145/1978942.1979381"
    },
    {
      "text": "Brian Dorn and Mark Guzdial. 2010. Learning on the Job: Characterizing the Programming Knowledge and Learning Strategies of Web Designers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 703--712.  ",
      "doi": "10.1145/1753326.1753430"
    },
    {
      "text": "Ian Drosos, Philip J. Guo, and Chris Parnin. 2017. HappyFace: Identifying and Predicting Frustrating Obstacles for Learning Programming at Scale. In Proceedings of the IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC) (VL/HCC '17).",
      "doi": ""
    },
    {
      "text": "Benedict Du Boulay. 1986. Some Difficulties of Learning to Program. Journal of Educational Computing Research 2, 1 (1986), 57--73.",
      "doi": "10.2190/3lfx-9rrf-67t8-uvk9"
    },
    {
      "text": "Darren Edge, Kai-Yin Cheng, Michael Whitney, Yao Qian, Zhijie Yan, and Frank Soong. 2012. Tip Tap Tones: Mobile Microtraining of Mandarin Sounds. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services Companion (MobileHCI '12). ACM, New York, NY, USA, 215--216.  ",
      "doi": "10.1145/2371664.2371715"
    },
    {
      "text": "Darren Edge, Elly Searle, Kevin Chiu, Jing Zhao, and James A. Landay. 2011. MicroMandarin: Mobile Language Learning in Context. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3169--3178.  ",
      "doi": "10.1145/1978942.1979413"
    },
    {
      "text": "Barbara Ericson, Shelly Engelman, Tom McKlin, and Ja'Quan Taylor. 2014. Project Rise Up 4 CS: Increasing the Number of Black Students Who Pass Advanced Placement CS A. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (SIGCSE '14). ACM, New York, NY, USA, 439--444.  ",
      "doi": "10.1145/2538862.2538937"
    },
    {
      "text": "Barbara J. Ericson, Kantwon Rogers, Miranda Parker, Briana Morrison, and Mark Guzdial. 2016. Identifying Design Principles for CS Teacher Ebooks Through Design-Based Research. In Proceedings of the 2016 ACM Conference on International Computing Education Research (ICER '16). ACM, New York, NY, USA, 191--200.  ",
      "doi": "10.1145/2960310.2960335"
    },
    {
      "text": "National Science Foundation. 2017. Broadening Participation in Computing (BPC). https://www.nsf.gov/cise/bpc/. (2017). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Scott Freeman, Sarah L. Eddy, Miles McDonough, Michelle K. Smith, Nnadozie Okoroafor, Hannah Jordt, and Mary Pat Wenderoth. 2014. Active learning increases student performance in science, engineering, and mathematics. Proceedings of the National Academy of Sciences 111, 23 (2014), 8410--8415.",
      "doi": ""
    },
    {
      "text": "T. R. G. Green. 1989. Cognitive dimensions of notations. In People and Computers V. University Press, 443--460. ",
      "doi": "10.5555/92968.93015"
    },
    {
      "text": "J.J. Gumperz and S.C. Levinson. 1996. Rethinking Linguistic Relativity. Cambridge University Press. https://books.google.com/books?id=dPXvxgL2t1oC",
      "doi": ""
    },
    {
      "text": "Philip J. Guo. 2013. Online Python Tutor: Embeddable Web-based Program Visualization for CS Education. In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (SIGCSE '13). ACM, New York, NY, USA, 579--584.  ",
      "doi": "10.1145/2445196.2445368"
    },
    {
      "text": "Philip J. Guo. 2015. Codeopticon: Real-Time, One-To-Many Human Tutoring for Computer Programming. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA, 599--608.  ",
      "doi": "10.1145/2807442.2807469"
    },
    {
      "text": "Philip J. Guo. 2017. Older Adults Learning Computer Programming: Motivations, Frustrations, and Design Opportunities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 7070--7083.  ",
      "doi": "10.1145/3025453.3025945"
    },
    {
      "text": "Philip J. Guo, Jeffery White, and Renan Zanelatto. 2015. Codechella: Multi-user program visualizations for real-time tutoring and collaborative learning. In Proceedings of the IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC) (VL/HCC '15). 79--87.",
      "doi": ""
    },
    {
      "text": "Mark Guzdial. 2015. Learner-Centered Design of Computing Education: Research on Computing for Everyone. Synthesis Lectures on Human-Centered Informatics 8, 6 (2015), 1--165.",
      "doi": ""
    },
    {
      "text": "Scott Hanselman. 2008. Do you have to know English to be a Programmer? http://www.hanselman.com/blog/ DoYouHaveToKnowEnglishToBeAProgrammer.aspx. (Nov 2008).",
      "doi": ""
    },
    {
      "text": "Masayuki Igawa, Dong Ma, and Samuel de Medeiros Queiroz. 2017. Non-native English speakers in Open Source communities: A True Story. (talk at Linux.conf.au). https://youtu.be/fsn6buk-BtE. (Jan 2017).",
      "doi": ""
    },
    {
      "text": "Andy Kirkpatrick. 2011. Internationalization or Englishization: Medium of Instruction in Today's Universities. (01 2011).",
      "doi": ""
    },
    {
      "text": "Andrew J. Ko, Brad A. Myers, and Htet Htet Aung. 2004. Six Learning Barriers in End-User Programming Systems. In Proceedings of the IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC) (VL/HCC '04).  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "Geza Kovacs and Robert C. Miller. 2014. Smart Subtitles for Vocabulary Learning. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 853--862.  ",
      "doi": "10.1145/2556288.2557256"
    },
    {
      "text": "J. Lave and E. Wenger. 1991. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Ron Mace. 1997. What is universal design. The Center for Universal Design at North Carolina State University http://www.udinstitute.org/principles.php (1997).",
      "doi": ""
    },
    {
      "text": "John H. Maloney, Kylie Peppler, Yasmin Kafai, Mitchel Resnick, and Natalie Rusk. 2008. Programming by Choice: Urban Youth Learning Programming with Scratch. In Proceedings of the 39th SIGCSE Technical Symposium on Computer Science Education (SIGCSE '08). ACM, New York, NY, USA, 367--371.  ",
      "doi": "10.1145/1352135.1352260"
    },
    {
      "text": "MaxMind. 2017. GeoLite2 Free Downloadable Databases. https://dev.maxmind.com/geoip/geoip2/geolite2/. (2017). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Charlie McDowell, Linda Werner, Heather Bullock, and Julian Fernald. 2002. The Effects of Pair-programming on Performance in an Introductory Programming Course. In Proceedings of the 33rd SIGCSE Technical Symposium on Computer Science Education (SIGCSE '02). ACM, New York, NY, USA, 38--42.  ",
      "doi": "10.1145/563340.563353"
    },
    {
      "text": "Charlie McDowell, Linda Werner, Heather E. Bullock, and Julian Fernald. 2006. Pair Programming Improves Student Retention, Confidence, and Program Quality. Commun. ACM 49, 8 (Aug. 2006), 90--95.  ",
      "doi": "10.1145/1145287.1145293"
    },
    {
      "text": "Peeter Mehisto. 2012. Criteria for producing CLI learning material. Encuentro Journal (2012), 15--33.",
      "doi": ""
    },
    {
      "text": "Subrata Kumar Mitra. 2010. Internationalization of Education in India: Emerging Trends and Strategies. Asian Social Science 6, 6 (2010).",
      "doi": ""
    },
    {
      "text": "Brad A. Myers and Jeffrey Stylos. 2016. Improving API Usability. Commun. ACM 59, 6 (May 2016), 62--69.  ",
      "doi": "10.1145/2896587"
    },
    {
      "text": "Jakob Nielsen. 1994. Usability Inspection Methods. John Wiley & Sons, Inc., New York, NY, USA, Chapter Heuristic Evaluation, 25--62. http://dl.acm.org/citation.cfm?id=189200.189209 ",
      "doi": "10.5555/189200.189209"
    },
    {
      "text": "The White House: Office of the Press Secretary. 2016. FACT SHEET: President Obama Announces Computer Science For All Initiative. (Jan 2016).",
      "doi": ""
    },
    {
      "text": "Python official documentation. 2017a. PEP 8 -- Style Guide for Python Code. https://www.python.org/dev/peps/pep-0008/. (2017). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Python official documentation. 2017b. sqlite3 DB-API 2.0 interface for SQLite databases. https://docs.python.org/3/library/sqlite3.html. (2017). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Yogendra Pal. 2016. A Framework for Scaffolding to Teach Programming to Vernacular Medium Learners. Ph.D. Dissertation. Indian Institute of Technology Bombay.",
      "doi": ""
    },
    {
      "text": "Yogendra Pal and Sridhar Iyer. 2012. Comparison of English Versus Hindi Medium Students for Programming Abilities Acquired Through Video-Based Instruction. In Proceedings of the 2012 IEEE Fourth International Conference on Technology for Education (T4E '12). IEEE Computer Society, Washington, DC, USA, 26--30.  ",
      "doi": "10.1109/T4E.2012.30"
    },
    {
      "text": "Yogendra Pal and Sridhar Iyer. 2015a. Classroom Versus Screencast for Native Language Learners: Effect of Medium of Instruction on Knowledge of Programming. In Proceedings of the 2015 ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE '15). ACM, New York, NY, USA, 290--295.  ",
      "doi": "10.1145/2729094.2742618"
    },
    {
      "text": "Yogendra Pal and Sridhar Iyer. 2015b. Effect of Medium of Instruction on Programming Ability Acquired through Screencast. In 2015 International Conference on Learning and Teaching in Computing and Engineering. 17--21.  ",
      "doi": "10.1109/LaTiCE.2015.38"
    },
    {
      "text": "John F. Pane and Brad A. Myers. 1996. Usability Issues in the Design of Novice Programming Systems. Technical Report Carnegie Mellon University-CS-96--132. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Annie Murphy Paul. 2014. Bill Gates Is an Autodidact. You're Probably Not. Ed tech promoters need to understand how most of us learn. Slate (July 2014).",
      "doi": ""
    },
    {
      "text": "Roy D. Pea. 1986. Language-Independent Conceptual \"Bugs\" in Novice Programming. Journal of Educational Computing Research 2, 1 (1986), 25--36.",
      "doi": ""
    },
    {
      "text": "Margaret Probyn. 2001. Teachers Voices: Teachers Reflections on Learning and Teaching through the Medium of English as an Additional Language in South Africa. International Journal of Bilingual Education and Bilingualism 4, 4 (2001), 249--266.",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Abraham Bernstein. 2011. Improving Performance, Perceived Usability, and Aesthetics with Culturally Adaptive User Interfaces. ACM Trans. Comput.-Hum. Interact. 18, 2, Article 8 (July 2011), 29 pages.  ",
      "doi": "10.1145/1970378.1970382"
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z. Gajos. 2014. Quantifying Visual Preferences Around the World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 11--20.  ",
      "doi": "10.1145/2556288.2557052"
    },
    {
      "text": "Gabriela T. Richard, Yasmin B. Kafai, Barrie Adleberg, and Orkan Telhan. 2015. StitchFest: Diversifying a College Hackathon to Broaden Participation and Perceptions in Computing. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education (SIGCSE '15). ACM, New York, NY, USA, 114--119.  ",
      "doi": "10.1145/2676723.2677310"
    },
    {
      "text": "E. Soloway and James C. Spohrer. 1988. Studying the Novice Programmer. L. Erlbaum Associates Inc., Hillsdale, NJ, USA. ",
      "doi": "10.5555/576212"
    },
    {
      "text": "Juha Sorva. 2012. Visual program simulation in introductory programming education (PhD dissertation). (2012). http://urn.fi/URN:ISBN:978--952--60--4626--6",
      "doi": ""
    },
    {
      "text": "Juha Sorva. 2013. Notional Machines and Introductory Programming Education. Trans. Comput. Educ. 13, 2, Article 8 (July 2013), 31 pages.  ",
      "doi": "10.1145/2483710.2483713"
    },
    {
      "text": "Andreas Stefik and Susanna Siebert. 2013. An Empirical Investigation into Programming Language Syntax. Trans. Comput. Educ. 13, 4, Article 19 (Nov. 2013), 40 pages.  ",
      "doi": "10.1145/2534973"
    },
    {
      "text": "John Sweller. 1994. Cognitive load theory, learning difficulty, and instructional design. Learning and Instruction 4, 4 (1994), 295 -- 312.",
      "doi": ""
    },
    {
      "text": "Josie Taylor. 1990. Analysing novices analysing Prolog: what stories do novices tell themselves about Prolog? Instructional Science 19, 4 (01 Jul 1990), 283--309.",
      "doi": ""
    },
    {
      "text": "Kyle Thayer and Andrew J. Ko. 2017. Barriers Faced by Coding Bootcamp Students. In Proceedings of the 2017 ACM Conference on International Computing Education Research (ICER '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3105726.3106176"
    },
    {
      "text": "J. Gregory Trafton and Brian J. Reiser. 1993. The Contributions of Studying Examples and Solving Problems to Skill Acquisition. Lawrence Erlbaum Associates, Inc., 1017--1022.",
      "doi": ""
    },
    {
      "text": "Judith Uchidiuno, Amy Ogan, Evelyn Yarzebinski, and Jessica Hammer. 2016. Understanding ESL Students' Motivations to Increase MOOC Accessibility. In Proceedings of the Third (2016) ACM Conference on Learning @ Scale (L@S '16). ACM, New York, NY, USA, 169--172.  ",
      "doi": "10.1145/2876034.2893398"
    },
    {
      "text": "Udacity. 2017. About Us. https://www.udacity.com/us. (2017). Accessed: 2017-09--14.",
      "doi": ""
    },
    {
      "text": "Ashok Kumar Veerasamy and Anna Shillabeer. 2014. Teaching English Based Programming Courses to English Language Learners/Non-Native Speakers of English. International Proceedings of Economics Development and Research 70, 4 (2014), 17--22.",
      "doi": ""
    },
    {
      "text": "Eric von Hippel. 1986. Lead Users: A Source of Novel Product Concepts. Manage. Sci. 32, 7 (July 1986), 791--805.  ",
      "doi": "10.5555/8438.8440"
    },
    {
      "text": "April Wang, Ryan Mitts, Philip J. Guo, and Parmit K. Chilana. 2018. Mismatch of Expectations: How Modern Learning Resources Fail Conversational Programmers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3173574.3174085"
    },
    {
      "text": "Wikipedia. 2017. Non-English-based programming languages. https://en.wikipedia.org/wiki/ Non-English-based_programming_languages. (2017). Accessed: 2017-09-05.",
      "doi": ""
    },
    {
      "text": "David Wolber, Hal Abelson, Ellen Spertus, and Liz Looney. 2011. App Inventor. O'Reilly Media, Inc.",
      "doi": ""
    }
  ]
}