{
  "doi": "10.1145/3173574.3173608",
  "title": "Improving Comprehension of Measurements Using Concrete Re-expression Strategies",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "It can be difficult to understand physical measurements (e.g., 28 lb, 600 gallons) that appear in news stories, data reports, and other documents. We develop tools that automatically re-express unfamiliar measurements using the measurements of familiar objects. Our work makes three contributions: (1) we identify effectiveness criteria for objects used in concrete measurement re-expressions; (2) we operationalize these criteria in a scalable method for mining a large dataset of concrete familiar objects with their physical dimensions from Amazon and Wikipedia; and (3) we develop automated concrete re-expression tools that implement three common re-expression strategies (adding familiar context, reunitization and proportional analogy) as energy minimization algorithms. Crowdsourced evaluations of our tools indicate that people find news articles with re-expressions more helpful and re- expressions help them to better estimate new measurements.",
  "authors": [
    {
      "name": "Jessica Hullman",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657387",
      "orcid": "0000-0001-6826-3550"
    },
    {
      "name": "Yea-Seul Kim",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958696457",
      "orcid": "missing"
    },
    {
      "name": "Francis Nguyen",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260785",
      "orcid": "missing"
    },
    {
      "name": "Lauren Speers",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260421",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon. 2014. Amazon Product Affiliate API. https://affiliate-program.amazon.com/gp/advertising/ api/detail/main.html. (2014).",
      "doi": ""
    },
    {
      "text": "Hessam Bagherinezhad, Hannaneh Hajishirzi, Yejin Choi, and Ali Farhadi. 2016. Are Elephants Bigger than Butterflies? Reasoning about Sizes of Objects. arXiv preprint arXiv:1602.00753 (2016). ",
      "doi": "10.5555/3016387.3016389"
    },
    {
      "text": "Pablo J Barrio, Daniel G Goldstein, and Jake M Hofman. 2016. Improving the Comprehension of Numbers in the News. (2016).",
      "doi": ""
    },
    {
      "text": "Susana Bautista, Raquel HervÃ as, Pablo GervÃ as, Richard Power, and Ra Williams. 2011. How to Make Numerical Information Accessible: Experimental Identification of Simplification Strategies. (2011).",
      "doi": ""
    },
    {
      "text": "Kurt Bollacker, Colin Evans, Praveen Paritosh, Tim Sturge, and Jamie Taylor. 2008. Freebase: A Collaboratively Created Graph Database for Structuring Human Knowledge. In Proc. of SIGMOD '08. ACM, New York, NY, USA, 1247--1250.  ",
      "doi": "10.1145/1376616.1376746"
    },
    {
      "text": "Elizabeth M Brannon. 2006. The representation of numerical magnitude. Current opinion in neurobiology 16, 2 (2006), 222--229.",
      "doi": ""
    },
    {
      "text": "Alexander Budanitsky and Graeme Hirst. 2006. Evaluating WordNet-based Measures of Lexical Semantic Relatedness. Comput. Linguist. 32, 1 (March 2006), 13--47.  ",
      "doi": "10.1162/coli.2006.32.1.13"
    },
    {
      "text": "Lou Burnard. 1995. Users Reference Guide British National Corpus Version 1.0. (1995). http://www.natcorp.ox.ac.uk/",
      "doi": ""
    },
    {
      "text": "Jamie I. D. Campbell. 2005. Handbook of Mathematical Cognition. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Arun Tejasvi Chaganty and Percy Liang. 2016. How Much is 131 Million Dollars? Putting Numbers in Perspective with Compositional Descriptions. arXiv preprint arXiv:1609.00070 (2016).",
      "doi": ""
    },
    {
      "text": "Vira Chankong and Yacov Y Haimes. 2015. Multiobjective Decision Making: Theory and Methodology. (Sept. 2015). http://store.doverpublications.com/0486462897.html",
      "doi": ""
    },
    {
      "text": "Fanny Chevalier, Romain Vuillemot, and Guia Gali. 2013a. Using Concrete Scales: A Practical Framework for Effective Visual Depiction of Complex Measures. IEEE TVCG 19, 12 (2013), 2426--2435.  ",
      "doi": "10.1109/TVCG.2013.210"
    },
    {
      "text": "Fanny Chevalier, Romain Vuillemot, and Guia Gali. 2013b. Using Concrete Scales: A Practical Framework for Effective Visual Depiction of Complex Measures (Presentation). (2013). Presented at IEEE InfoVis 2013.",
      "doi": ""
    },
    {
      "text": "Glen Chiachieri. 2014. The Dictionary of Numbers. http://www.dictionaryofnumbers.com/. (2014).",
      "doi": ""
    },
    {
      "text": "Jonathon Clase. 2017. The Measure of Things. http:// www.bluebulbprojects.com/measureofthings/default.php. (2017).",
      "doi": ""
    },
    {
      "text": "DBpedia. 2015. DBpedia: Downloads 2015--10. (2015). http://wiki.dbpedia.org/Downloads2015--10",
      "doi": ""
    },
    {
      "text": "Stanislas Dehaene, Elizabeth Spelke, and Lisa Feigenson. 2004. Core Systems of Number. Trends in Cognitive Sciences 8, 7 (2004), 307--314.",
      "doi": ""
    },
    {
      "text": "J. Deng, W. Dong, R. Socher, L.-J. Li, K. Li, and L. Fei-Fei. 2009. ImageNet: A Large-Scale Hierarchical Image Database. In CVPR09.",
      "doi": ""
    },
    {
      "text": "Ari Rappaport Dmitry Davidov. 2010. Extraction and Approximation of Numerical Attributes from the Web. (2010).",
      "doi": ""
    },
    {
      "text": "Lisa Feigenson, Stanislas Dehaene, and Elizabeth Spelke. 2004. Core systems of number. Trends in cognitive sciences 8, 7 (2004), 307--314.",
      "doi": ""
    },
    {
      "text": "Google. 2014. Freebase API (Deprecated 2016): Data Dumps. (2014). https://developers.google.com/freebase/",
      "doi": ""
    },
    {
      "text": "Mark F Horstemeyer. 2009. Multiscale modeling: a review. In Practical aspects of computational chemistry. Springer, 87--135.",
      "doi": ""
    },
    {
      "text": "M. Gail Jones, Grant E. Gardner, Amy R. Taylor, Jennifer H. Forrester, and Thomas Andre. 2012. Students' Accuracy of Measurement Estimation: Context, Units, and Logical Thinking. School Science and Mathematics 112, 3 (March 2012), 171--178.",
      "doi": ""
    },
    {
      "text": "M. Gail Jones, Manuela Paechter, Chiung-Fen Yen, Grant Gardner, Amy Taylor, and Thomas Tretter. 2013. Teachersâ A´ Z Concepts of Spatial Scale: An international comparison. International Journal of Science Education 35, 14 (Sept. 2013), 2462--2482.",
      "doi": ""
    },
    {
      "text": "M. Gail Jones and Amy R. Taylor. 2009. Developing a sense of scale: Looking backward. Journal of Research in Science Teaching 46, 4 (2009), 460--475.",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Jessica Hullman, and Maneesh Agrawala. 2016. Generating Personalized Spatial Analogies for Distances and Areas. (2016).",
      "doi": ""
    },
    {
      "text": "Jens Lehmann, Robert Isele, Max Jakob, Anja Jentzsch, Dimitris Kontokostas, Pablo Mendes, Sebastian Hellmann, Mohamed Morsey, Patrick van Kleef, Sören Auer, and Christian Bizer. 2014. DBpedia - A Large-scale, Multilingual Knowledge Base Extracted from Wikipedia. Semantic Web Journal (2014).",
      "doi": ""
    },
    {
      "text": "Alejandra Magana, Sean Brophy, and Lynn Bryan. 2012. An Integrated Knowledge Framework to Characterize and Scaffold Size and Scale Cognition (FS2C). Int'l J. of Science Educ. 34, 14 (2012), 2181--2203.",
      "doi": ""
    },
    {
      "text": "Alejandra J Magana. 2014. Learning strategies and multimedia techniques for scaffolding size and scale cognition. Computers & Education 72 (2014), 367--377.",
      "doi": "10.5555/2753879.2754115"
    },
    {
      "text": "George A. Miller. 1995. WordNet: A Lexical Database for English. Commun. ACM 38, 11 (Nov. 1995), 39--41.  ",
      "doi": "10.1145/219717.219748"
    },
    {
      "text": "NLTK. 2015. NLTK Python WordNet Interface. (Sept. 2015). http://www.nltk.org/howto/wordnet.html",
      "doi": ""
    },
    {
      "text": "John Allen Paulos. 1988. Innumeracy: Mathematical Illiteracy and Its Consequences. Macmillan.",
      "doi": ""
    },
    {
      "text": "Chris Riederer, Jake M. Hofman, and Daniel G. Goldstein. 2018. To put that in perspective: Generating analogies that make numbers easier to understand. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3173574.3174122"
    },
    {
      "text": "Bruce M. Ross and Trygg Engen. 1959. Effects of round number preferences in a guessing task. Journal of Experimental Psychology 58, 6 (1959), 462--468.",
      "doi": ""
    },
    {
      "text": "Charles Seife. 2010. Proofiness: The Dark Arts of Mathematical Deception (1 ed.). Viking Adult.",
      "doi": ""
    },
    {
      "text": "Barbara G. Tabachnick and Linda S. Fidell. 2006. Using Multivariate Statistics (5th Edition). Allyn & Bacon, Inc., Needham Heights, MA, USA. ",
      "doi": "10.5555/1213888"
    },
    {
      "text": "Thomas R Tretter, M Gail Jones, Thomas Andre, Atsuko Negishi, and James Minogue. 2006. Conceptual boundaries and distances: Students' and experts' concepts of the scale of scientific phenomena. Journal of research in science teaching 43, 3 (2006), 282--319.",
      "doi": ""
    },
    {
      "text": "Michael J Wilber, Iljung S Kwak, and Serge J Belongie. 2014. Cost-effective hits for relative similarity comparisons. In Second AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Wolfram|Alpha. 2015. WolframAlpha Computational Knowledge Engine. (2015). http://www.wolframalpha.com/ Last visited on 08/4/2015.",
      "doi": ""
    }
  ]
}