{
  "doi": "10.1145/3173574.3174109",
  "title": "Charrette: Supporting In-Person Discussions around Iterations in User Interface Design",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "As a rule, user interface designers work iteratively. Over the course of a project, they repeatedly gather feedback, typically through in-person meetings, and update their designs accordingly. Through formative work, we find that design software tools do not support designers in managing meeting notes and previous design iterations as a cohesive whole. This causes designers to rely on ad-hoc practices for organizing work, which makes it hard for them to keep track of relevant feedback and explain their design decisions. To address this problem, we present Charrette, a system that allows designers to curate design iterations, attach meeting notes to the relevant content, and navigate sequences of design iterations with the associated notes to facilitate in-person discussions. In an exploratory user study, we evaluate how Charrette affects designers' self-reported ease in handling feedback during face-to-face discussions, compared with using their own tools. We find that using Charrette correlates with increased confidence and recall in discussing previous design decisions.",
  "tags": [
    "design rationale",
    "critique",
    "user interface design tools"
  ],
  "authors": [
    {
      "name": "Jasper O'Leary",
      "institution": "University of Washington&Adobe Research, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659035156/rel-imgonly/so_emotion.jpg",
      "acmid": "99659035156",
      "orcid": "0000-0003-3882-3144"
    },
    {
      "name": "Holger Winnemöller",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314495028",
      "orcid": "missing"
    },
    {
      "name": "Wilmot Li",
      "institution": "Adobe Systems, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100480929",
      "orcid": "missing"
    },
    {
      "name": "Mira Dontcheva",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100654713",
      "orcid": "missing"
    },
    {
      "name": "Morgan Dixon",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660572630",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abstract App. (accessed 2017-09--16). Secure version control and design workflow management. https://www.goabstract.com/",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Joel Brandt, Robert C. Miller, and David R. Karger. 2011. Crowds in Two Seconds: Enabling Realtime Crowd-powered Interfaces. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 33--42.  ",
      "doi": "10.1145/2047196.2047201"
    },
    {
      "text": "Adobe Experience Design CC (Beta). (accessed 2017-09--16). Adobe Experience Design desktop software. https://www.adobe.com/products/experience-design.html",
      "doi": ""
    },
    {
      "text": "Hsiang-Ting Chen, Li-Yi Wei, Björn Hartmann, and Maneesh Agrawala. 2016. Data-driven Adaptive History for Image Editing. In Proceedings of the 20th ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games (I3D '16). ACM, New York, NY, USA, 103--111.  ",
      "doi": "10.1145/2856400.2856417"
    },
    {
      "text": "InVision: Digital Product Design Workflow&Collaboration. (accessed 2017-09--14). InVision. https://www.invisionapp.com/",
      "doi": ""
    },
    {
      "text": "Nigel Cross. 2016. Design thinking: understanding how designers think and work (reprint 2016 ed.). Bloomsbury Academic, London Oxford New York New Delhi Sydney. OCLC: 992436223.",
      "doi": ""
    },
    {
      "text": "Steven P. Dow, Alana Glassco, Jonathan Kass, Melissa Schwarz, Daniel L. Schwartz, and Scott R. Klemmer. 2010. Parallel Prototyping Leads to Better Design Results, More Divergence, and Increased Self-efficacy. ACM Trans. Comput.-Hum. Interact. 17, 4 (Dec. 2010), 18:1--18:24.  ",
      "doi": "10.1145/1879831.1879836"
    },
    {
      "text": "Eureka Foong, Steven P. Dow, Brian P. Bailey, and Elizabeth M. Gerber. 2017. Online Feedback Exchange: A Framework for Understanding the Socio-Psychological Factors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4454--4467.  ",
      "doi": "10.1145/3025453.3025791"
    },
    {
      "text": "Elizabeth Gerber and Maureen Carroll. 2012. The psychological experience of prototyping. Design Studies 33, 1 (Jan. 2012), 64--84.",
      "doi": ""
    },
    {
      "text": "Tom Greever. Articulating Design Decisions: Communicate with Stakeholders, Keep Your Sanity, and Deliver the Best User Experience.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2010. Chronicle: Capture, Exploration, and Playback of Document Workflow Histories. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 143--152.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Björn Hartmann, Sean Follmer, Antonio Ricciardi, Timothy Cardenas, and Scott R. Klemmer. 2010. D.Note: Revising User Interfaces Through Change Tracking, Annotations, and Alternatives. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 493--502.  ",
      "doi": "10.1145/1753326.1753400"
    },
    {
      "text": "Jeffrey Heer, Fernanda B. Viégas, and Martin Wattenberg. 2007. Voyagers and Voyeurs: Supporting Asynchronous Collaborative Information Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1029--1038.  ",
      "doi": "10.1145/1240624.1240781"
    },
    {
      "text": "Kathryn Henderson. 1991. Flexible Sketches and Inflexible Data Bases: Visual Communication, Conscription Devices, and Boundary Objects in Design Engineering. Science, Technology,&Human Values 16, 4 (Oct. 1991), 448--473.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Minoru Kobayashi. 1992. ClearBoard: A Seamless Medium for Shared Drawing and Conversation with Eye Contact. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, New York, NY, USA, 525--532.  ",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Young-Wook Jung, Youn-kyung Lim, and Myung-suk Kim. 2017. Possibilities and Limitations of Online Document Tools for Design Collaboration: The Case of Google Docs. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1096--1108.  ",
      "doi": "10.1145/2998181.2998297"
    },
    {
      "text": "Joy Kim, Maneesh Agrawala, and Michael S. Bernstein. 2017. Mosaic: Designing Online Creative Communities for Sharing Works-in-Progress. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 246--258.  ",
      "doi": "10.1145/2998181.2998195"
    },
    {
      "text": "Scott R. Klemmer, Michael Thomsen, Ethan Phelps-Goodman, Robert Lee, and James A. Landay. 2002. Where Do Web Sites Come from?: Capturing and Interacting with Design History. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 1--8.  ",
      "doi": "10.1145/503376.503378"
    },
    {
      "text": "Charlotte P. Lee. 2007. Boundary Negotiating Artifacts: Unbinding the Routine of Boundary Objects and Embracing Chaos in Collaborative Work. Computer Supported Cooperative Work (CSCW) 16, 3 (June 2007), 307--339.  ",
      "doi": "10.1007/s10606-007-9044-5"
    },
    {
      "text": "J. Lehni and J. Puckey. 2011. Paper.js. (2011).",
      "doi": ""
    },
    {
      "text": "Kurt Luther, Amy Pavel, Wei Wu, Jari-lee Tolentino, Maneesh Agrawala, Björn Hartmann, and Steven P. Dow. 2014. CrowdCrit: Crowdsourcing and Aggregating Visual Design Critique. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work&Social Computing (CSCW Companion '14). ACM, New York, NY, USA, 21--24.  ",
      "doi": "10.1145/2556420.2556788"
    },
    {
      "text": "Jennifer Marlow, Scott Carter, Nathaniel Good, and Jung-Wei Chen. 2016. Beyond Talking Heads: Multimedia Artifact Creation, Use, and Sharing in Distributed Meetings. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work&Social Computing (CSCW '16). ACM, New York, NY, USA, 1703--1715.  ",
      "doi": "10.1145/2818048.2819958"
    },
    {
      "text": "Meteor.js. (accessed 2017-09--16). Platform for building web and mobile apps in pure JavaScript. https://www.meteor.com/",
      "doi": ""
    },
    {
      "text": "Lora Oehlberg, Kyu Simm, Jasmine Jones, Alice Agogino, and Björn Hartmann. 2012. Showing is Sharing: Building Shared Understanding in Human-centered Design Teams with Dazzle. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 669--678.  ",
      "doi": "10.1145/2317956.2318057"
    },
    {
      "text": "Amy Pavel, Dan B. Goldman, Björn Hartmann, and Maneesh Agrawala. 2016. VidCrit: Video-based Asynchronous Video Review. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 517--528.  ",
      "doi": "10.1145/2984511.2984552"
    },
    {
      "text": "Red Pen. (accessed 2017-09--15). Web application to solicit design feedback. https://redpen.io/",
      "doi": ""
    },
    {
      "text": "Daniela Retelny and Pamela Hinds. 2016. Embedding Intentions in Drawings: How Architects Craft and Curate Drawings to Achieve Their Goals. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work&Social Computing (CSCW '16). ACM, New York, NY, USA, 1310--1322.  ",
      "doi": "10.1145/2818048.2819932"
    },
    {
      "text": "Frederick Aliaga Craig Scull Steve Johnson Fredo Durand Sara L. Su, Sylvain Paris. 2009. Interactive Visual Histories for Vector Graphics. Technical Report. MIT.",
      "doi": ""
    },
    {
      "text": "Michael Terry and Elizabeth D. Mynatt. 2002. Recognizing Creative Needs in User Interface Design. In Proceedings of the 4th Conference on Creativity&Cognition (C&C '02). ACM, New York, NY, USA, 38--44.  ",
      "doi": "10.1145/581710.581718"
    },
    {
      "text": "Folio Simple visual version control tool for Mac based on Git. (accessed 2017-09--16). Version control for design documents. http://folioformac.com",
      "doi": ""
    },
    {
      "text": "Moritz Wittenhagen, Christian Cherek, and Jan Borchers. 2016. Chronicler: Interactive Exploration of Source Code History. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3522--3532.  ",
      "doi": "10.1145/2858036.2858442"
    },
    {
      "text": "Anbang Xu, Shih-Wen Huang, and Brian Bailey. 2014. Voyant: Generating Structured Feedback on Visual Designs Using a Crowd of Non-experts. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work&Social Computing (CSCW '14). ACM, New York, NY, USA, 1433--1444.  ",
      "doi": "10.1145/2531602.2531604"
    },
    {
      "text": "Dongwook Yoon, Nicholas Chen, François Guimbretière, and Abigail Sellen. 2014. RichReview: Blending Ink, Speech, and Gesture to Support Collaborative Document Review. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 481--490.  ",
      "doi": "10.1145/2642918.2647390"
    },
    {
      "text": "Loutfouz Zaman, Wolfgang Stuerzlinger, Christian Neugebauer, Rob Woodbury, Maher Elkhaldi, Naghmi Shireen, and Michael Terry. 2015. GEM-NI: A System for Creating and Managing Alternatives In Generative Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1201--1210.  ",
      "doi": "10.1145/2702123.2702398"
    }
  ]
}