{
  "doi": "10.1145/3173574.3174124",
  "title": "Supporting Communication between Grandparents and Grandchildren through Tangible Storytelling Systems",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Grandparents and grandchildren that live apart often rely on communication technologies, such as messengers, video conferencing, and phone calls for maintaining relationships. While some of these systems are challenging for grandparents, others are less engaging for children. To facilitate communication, we developed StoryBox, a tangible device that allows sharing photos, tangible artifacts, and audio recordings of everyday life. We conducted a preliminary study with two families to identify design issues, and further refine the prototype. Subsequently, we conducted a field study with four families for up to four weeks to better understand real-world use and examine inter-generational connectedness. We found that StoryBox was accessible, simple, and helped bridge the technological gap between grandparents and grandchildren. Children communicated asynchronously in a playful and idiosyncratic manner, and grandparents shared past family memories. We provide insights on how to ease communication between different generations, engage them in sharing activities, and strengthen family relationships.",
  "authors": [
    {
      "name": "Torben Wallbaum",
      "institution": "OFFIS - Institute for Information Technology, Oldenburg, Lower-Saxony, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705656",
      "orcid": "missing"
    },
    {
      "name": "Andrii Matviienko",
      "institution": "OFFIS - Institut for Information Technology, Oldenburg, Germany",
      "img": "/do/10.1145/contrib-99658734228/rel-imgonly/andrii_2.jpg",
      "acmid": "99658734228",
      "orcid": "0000-0002-6571-0623"
    },
    {
      "name": "Swamy Ananthanarayan",
      "institution": "University of Oldenburg, Oldenburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472656658",
      "orcid": "0000-0002-9808-5844"
    },
    {
      "name": "Thomas Olsson",
      "institution": "Tampere University of Technology, Tampere, Finland",
      "img": "/do/10.1145/contrib-99659364710/rel-imgonly/20180530-tdo_5098_small.jpg",
      "acmid": "99659364710",
      "orcid": "missing"
    },
    {
      "name": "Wilko Heuten",
      "institution": "OFFIS - Institute for Information Technology, Oldenburg, Lower Saxony, Germany",
      "img": "/do/10.1145/contrib-81320490169/rel-imgonly/csm_offis_gesundheit_heuten_wilko_dsc05737__1__web_4024cc8173.jpg",
      "acmid": "81320490169",
      "orcid": "0000-0003-2085-193X"
    },
    {
      "name": "Susanne C.J. Boll",
      "institution": "University of Oldenburg, Oldenburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398416",
      "orcid": "0000-0003-4293-1623"
    }
  ],
  "references": [
    {
      "text": "Morgan G. Ames, Janet Go, Joseph 'Jofish' Kaye, and Mirjana Spasojevic. 2010. Making Love in the Network Closet: The Benefits and Work of Family Videochat. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 145--154.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Rafael Ballagas, Joseph'Jofish' Kaye, Morgan Ames, Janet Go, and Hayes Raffle. 2009. Family communication: phone conversations with children. In Proceedings of the 8th international Conference on Interaction Design and Children. ACM, 321--324.  ",
      "doi": "10.1145/1551788.1551874"
    },
    {
      "text": "Oliver Arránz Becker and Anja Steinbach. 2012. Relations between Grandparents and Grandchildren in the Context of the Family System. Comparative Population Studies 37, 3--4 (2012).",
      "doi": ""
    },
    {
      "text": "Margit Biemans, Betsy van Dijk, Pavan Dadlani, and Aart van Halteren. 2009. Let's stay in touch: sharing photos for restoring social connectedness between rehabilitants, friends and family. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility. ACM, 179--186.  ",
      "doi": "10.1145/1639642.1639674"
    },
    {
      "text": "Elizabeth Bonsignore, Alexander J. Quinn, Allison Druin, and Benjamin B. Bederson. 2013. Sharing Stories &Ldquo;in the Wild&Rdquo;: A Mobile Storytelling Case Study Using StoryKit. ACM Trans. Comput.-Hum. Interact. 20, 3, Article 18 (July 2013), 38 pages.  ",
      "doi": "10.1145/2491500.2491506"
    },
    {
      "text": "J. Clottes. 2010. Cave Art. Phaidon Press.",
      "doi": ""
    },
    {
      "text": "Allison Druin, Benjamin B. Bederson, and Alex Quinn. 2009. Designing Intergenerational Mobile Storytelling. In Proceedings of the 8th International Conference on Interaction Design and Children (IDC '09). ACM, New York, NY, USA, 325--328.  ",
      "doi": "10.1145/1551788.1551875"
    },
    {
      "text": "Bente Evjemo, Gunnvald B. Svendsen, Eivind Rinde, and Jan-Are K. Johnsen. 2004. Supporting the Distributed Family: The Need for a Conversational Context. In Proceedings of the Third Nordic Conference on Human-computer Interaction (NordiCHI '04). ACM, New York, NY, USA, 309--312.  ",
      "doi": "10.1145/1028014.1028062"
    },
    {
      "text": "Sean Follmer, Rafael (Tico) Ballagas, Hayes Raffle, Mirjana Spasojevic, and Hiroshi Ishii. 2012. People in Books: Using a FlashCam to Become Part of an Interactive Book for Connected Reading. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 685--694.  ",
      "doi": "10.1145/2145204.2145309"
    },
    {
      "text": "Sean Follmer, Hayes Raffle, Janet Go, Rafael Ballagas, and Hiroshi Ishii. 2010. Video play: playful interactions in video conferencing for long-distance families with young children. In Proceedings of the 9th International Conference on Interaction Design and Children. ACM, 49--58.  ",
      "doi": "10.1145/1810543.1810550"
    },
    {
      "text": "Azadeh Forghani and Carman Neustaedter. 2014. The routines and needs of grandparents and parents for grandparent-grandchild conversations over distance. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 4177--4186.  ",
      "doi": "10.1145/2556288.2557255"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, and others. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Jennifer Jacobs and Amit Zoran. 2015. Hybrid Practice in the Kalahari: Design Collaboration Through Digital Tools and Hunter-Gatherer Craft. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 619--628.  ",
      "doi": "10.1145/2702123.2702362"
    },
    {
      "text": "Joris H Janssen, Wijnand A Ijsselsteijn, and Joyce HDM Westerink. 2014. How affective technologies can influence intimate interactions and improve social connectedness. International Journal of Human-Computer Studies 72, 1 (2014), 33--43.  ",
      "doi": "10.1016/j.ijhcs.2013.09.007"
    },
    {
      "text": "Tejinder K Judge, Carman Neustaedter, Steve Harrison, and Andrew Blose. 2011. Family portals: connecting families through a multifamily media space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1205--1214.  ",
      "doi": "10.1145/1978942.1979122"
    },
    {
      "text": "Tejinder K Judge, Carman Neustaedter, and Andrew F Kurtz. 2010. The family window: the design and evaluation of a domestic media space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2361--2370.  ",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "Candace L Kemp. 2005. Dimensions of grandparent-adult grandchild relationships: From family ties to intergenerational friendships. Canadian Journal on Aging/La Revue canadienne du vieillissement 24, 2 (2005), 161--177.",
      "doi": ""
    },
    {
      "text": "Gregory E Kennedy. 1992. Shared activities of grandparents and grandchildren. Psychological reports 70, 1 (1992), 211--227.",
      "doi": ""
    },
    {
      "text": "A. Kornhaber and K.L. Woodward. 1981. Grandparents, Grandchildren: The Vital Connection. Transaction Publishers.",
      "doi": ""
    },
    {
      "text": "Siân E. Lindley. 2012. Shades of Lightweight: Supporting Cross-generational Communication Through Home Messaging. Univers. Access Inf. Soc. 11, 1 (March 2012), 31--43.  ",
      "doi": "10.1007/s10209-011-0231-2"
    },
    {
      "text": "Siân E. Lindley, Richard Harper, and Abigail Sellen. 2009. Desiring to Be in Touch in a Changing Communications Landscape: Attitudes of Older Adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1693--1702.  ",
      "doi": "10.1145/1518701.1518962"
    },
    {
      "text": "Karyn Moffatt, Jessica David, and Ronald M. Baecker. 2013. Connecting Grandparents and Grandchildren. Springer London, London, 173--193.",
      "doi": ""
    },
    {
      "text": "I. Mols, E. v. d. Hoven, and B. Eggen. 2014. Making memories: a cultural probe study into the remembering of everyday life. In Proc. of the 8th Nordic Conf. on Human-Computer Interaction. ACM, 256--265.  ",
      "doi": "10.1145/2639189.2639209"
    },
    {
      "text": "E. D. Mynatt, J. Rowan, S. Craighill, and A. Jacobs. 2001. Digital family portraits: supporting peace of mind for extended family members. In Proc. of the SIGCHI conf. on Human factors in Comp. Sys. ACM, 333--340.  ",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "M. Nunes, S. Greenberg, and C. Neustaedter. 2008. Sharing digital photographs in the home through physical mementos, souvenirs, and keepsakes. In Proc. of the 7th ACM conf. on Designing interc. sys. ACM, 250--260.  ",
      "doi": "10.1145/1394445.1394472"
    },
    {
      "text": "Thomas Olsson, Hannu Soronen, and Kaisa Väänänen-Vainio-Mattila. 2008. User needs and design guidelines for mobile services for sharing digital life memories. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services. ACM, 273--282.  ",
      "doi": "10.1145/1409240.1409270"
    },
    {
      "text": "John P Pollak, Phil Adams, and Geri Gay. 2011. PAM: a photographic affect meter for frequent, in situ measurement of affect. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 725--734.  ",
      "doi": "10.1145/1978942.1979047"
    },
    {
      "text": "Hayes Raffle, Rafael Ballagas, Glenda Revelle, Hiroshi Horii, Sean Follmer, Janet Go, Emily Reardon, Koichi Mori, Joseph Kaye, and Mirjana Spasojevic. 2010. Family story play: reading with young children (and elmo) over a distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1583--1592.  ",
      "doi": "10.1145/1753326.1753563"
    },
    {
      "text": "Hayes Raffle, Rafael Ballagas, Glenda Revelle, Koichi Mori, Hiroshi Horii, Chris Paretti, and Mirjana Spasojevic. 2011a. Pop Goes the Cell Phone: Asynchronous Messaging for Preschoolers. In Proceedings of the 10th International Conference on Interaction Design and Children (IDC '11). ACM, New York, NY, USA, 99--108.  ",
      "doi": "10.1145/1999030.1999042"
    },
    {
      "text": "Hayes Raffle, Glenda Revelle, Koichi Mori, Rafael Ballagas, Kyle Buza, Hiroshi Horii, Joseph Kaye, Kristin Cook, Natalie Freed, Janet Go, and Mirjana Spasojevic. 2011b. Hello, is Grandma There? Let's Read! StoryVisit: Family Video Chat and Connected e-Books. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1195--1204.  ",
      "doi": "10.1145/1978942.1979121"
    },
    {
      "text": "Sarah A. Ruiz and Merril Silverstein. 2007. Relationships with Grandparents and the Emotional Well-Being of Late Adolescent and Young Adult Grandchildren. Journal of Social Issues 63, 4 (2007), 793--808.",
      "doi": ""
    },
    {
      "text": "Abigail Sellen, Richard Harper, Rachel Eardley, Shahram Izadi, Tim Regan, Alex S. Taylor, and Ken R. Wood. 2006. HomeNote: Supporting Situated Messaging in the Home. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06). ACM, New York, NY, USA, 383--392.  ",
      "doi": "10.1145/1180875.1180933"
    },
    {
      "text": "Ben Shneiderman and Catherine Plaisant. 2006. Strategies for evaluating information visualization tools: multi-dimensional in-depth long-term case studies. In Proceedings of the 2006 AVI workshop on BEyond time and errors: novel evaluation methods for information visualization. ACM, 1--7.  ",
      "doi": "10.1145/1168149.1168158"
    },
    {
      "text": "Kimberly Tee, A.J. Bernheim Brush, and Kori M. Inkpen. 2009. Exploring communication and sharing between extended families. International Journal of Human-Computer Studies 67, 2 (Feb. 2009), 128--138.  ",
      "doi": "10.1016/j.ijhcs.2008.09.007"
    },
    {
      "text": "R. Vennelakanti, S. Madhvanath, A. Subramanian, A. Sowndararajan, A. David, and P. Dey. 2012. Pixene: Creating memories while sharing photos. In Proc. of the 14th ACM intern. conf. on Multimodal interaction. ACM, 59--60.  ",
      "doi": "10.1145/2388676.2388692"
    },
    {
      "text": "Thomas Visser, Martijn Vastenburg, and David Keyson. 2010. SnowGlobe: the development of a prototype awareness system for longitudinal field studies. In Proceedings of the 8th ACM Conference on Designing Interactive Systems. ACM, 426--429.  ",
      "doi": "10.1145/1858171.1858254"
    },
    {
      "text": "René Vutborg, Jesper Kjeldskov, Sonja Pedell, and Frank Vetere. 2010. Family storytelling for grandparents and grandchildren living apart. In Proceedings of the 6th Nordic conference on human-computer interaction: Extending boundaries. ACM, 531--540.  ",
      "doi": "10.1145/1868914.1868974"
    },
    {
      "text": "Torben Wallbaum, Matthias Esser, Wilko Heuten, and Susanne Boll. 2016. StoryBox: Design of a System to Support Experience Sharing through Visual Stories. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM, 97.  ",
      "doi": "10.1145/2971485.2996732"
    },
    {
      "text": "Svetlana Yarosh and Gregory D Abowd. 2011. Mediated parent-child contact in work-separated families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1185--1194.  ",
      "doi": "10.1145/1978942.1979120"
    },
    {
      "text": "Svetlana Yarosh, Stephen Cuzzort, Hendrik Müller, and Gregory D Abowd. 2009. Developing a media space for remote synchronous parent-child interaction. In Proceedings of the 8th International Conference on Interaction Design and Children. ACM, 97--105.  ",
      "doi": "10.1145/1551788.1551806"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}