{
  "doi": "10.1145/3173574.3174203",
  "title": "Towards a Multisensory Augmented Reality Map for Blind and Low Vision People: a Participatory Design Approach",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Current low-tech Orientation & Mobility (O&M) tools for visually impaired people, e.g. tactile maps, possess limitations. Interactive accessible maps have been developed to overcome these. However, most of them are limited to exploration of existing maps, and have remained in laboratories. Using a participatory design approach, we have worked closely with 15 visually impaired students and 3 O&M instructors over 6 months. We iteratively designed and developed an augmented reality map destined at use in O&M classes in special education centers. This prototype combines projection, audio output and use of tactile tokens, and thus allows both map exploration and construction by low vision and blind people. Our user study demonstrated that all students were able to successfully use the prototype, and showed a high user satisfaction. A second phase with 22 international special education teachers allowed us to gain more qualitative insights. This work shows that augmented reality has potential for improving the access to education for visually impaired people.",
  "authors": [
    {
      "name": "Jérémy Albouys-Perrois",
      "institution": "Inria Bordeaux, Talence, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260975",
      "orcid": "missing"
    },
    {
      "name": "Jérémy Laviole",
      "institution": "RealityTech, Bordeaux, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500662866",
      "orcid": "missing"
    },
    {
      "name": "Carine Briant",
      "institution": "IRSA, Carbon Blanc, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261000",
      "orcid": "missing"
    },
    {
      "name": "Anke M. Brock",
      "institution": "University Toulouse - ENAC & Inria, Toulouse, France",
      "img": "/do/10.1145/contrib-81479641265/rel-imgonly/ankebrock3-cutout.jpg",
      "acmid": "81479641265",
      "orcid": "0000-0002-0017-396X"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, William Easley, Michele Williams, Stacy Branham, and Amy Hurst. 2017. Embracing Errors: Examining How Context of Use Impacts Blind Individuals' Acceptance of Navigation Aid Errors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4158--4169.  ",
      "doi": "10.1145/3025453.3025528"
    },
    {
      "text": "Samuel Audet and Masatoshi Okutomi. 2009. A user-friendly method to geometrically calibrate projector-camera systems. In Computer Vision and Pattern Recognition Workshops, 2009. CVPR Workshops 2009. IEEE Computer Society Conference on. IEEE, 47--54.",
      "doi": ""
    },
    {
      "text": "Ronald Azuma, Yohan Baillot, Reinhold Behringer, Steven Feiner, Simon Julier, and Blair MacIntyre. 2001. Recent advances in augmented reality. IEEE Computer Graphics and Applications 21, 6 (Nov 2001), 34--47.  ",
      "doi": "10.1109/38.963459"
    },
    {
      "text": "Aaron Bangor, Philip T. Kortum, and James T. Miller. 2008. An Empirical Evaluation of the System Usability Scale. International Journal of Human Computer Interaction 24, 6 (2008), 574--594.",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Kristen Shinohara, Brianna Blaser, Andrew Davidson, and Kat M. Steele. 2016. Using a Design Workshop To Explore Accessible Ideation. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 303--304.  ",
      "doi": "10.1145/2982142.2982209"
    },
    {
      "text": "Xiaojun Bi, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2011. Magic desk: bringing multi-touch surfaces into desktop work. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 2511--2520.  ",
      "doi": "10.1145/1978942.1979309"
    },
    {
      "text": "Oliver Bimber and Ramesh Raskar. 2005. Spatial Augmented Reality: Merging Real and Virtual Worlds. A. K. Peters, Ltd. ",
      "doi": "10.5555/1088894"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative Accessibility: How Blind and Sighted Companions Co-Create Accessible Home Spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2373--2382.  ",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Anke M. Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2015. Interactivity Improves Usability of Geographic Maps for Visually Impaired People. Human-Computer Interaction 30 (2015), 156--194.  ",
      "doi": "10.5555/2692791.2692794"
    },
    {
      "text": "John Brooke. 1996. SUS: A \"quick and dirty\" usability scale. In Usability Evaluation in Industry, P. W. Jordan, B. Thomas, B. A. Weerdmeester, and I. L. McClelland (Eds.). Taylor & Francis, London, UK, 189--194.",
      "doi": ""
    },
    {
      "text": "Emeline Brule, Gilles Bailly, Anke Brock, Frederic Valentin, Grégoire Denis, and Christophe Jouffrais. 2016. MapSense: Multi-Sensory Interactive Maps for Children Living with Visual Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 445--457.  ",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Zaira Cattaneo and Tomaso Vecchi. 2011. Blind vision: the neuroscience of visual impairment. MIT Press.",
      "doi": ""
    },
    {
      "text": "Julie Ducasse, Anke M. Brock, and Christophe Jouffrais. 2018. Accessible Interactive Maps for Visually Impaired Users. Springer International Publishing, Cham, 537--584.",
      "doi": ""
    },
    {
      "text": "Julie Ducasse, Marc J-M Macé, Marcos Serrano, and Christophe Jouffrais. 2016. Tangible Reels: Construction and Exploration of Tangible Maps by Visually Impaired Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2186--2197.  ",
      "doi": "10.1145/2858036.2858058"
    },
    {
      "text": "David R. Flatla and Carl Gutwin. 2012. Situation-Specific Models of Color Differentiation. ACM Trans. Access. Comput. 4, 3, Article 13 (Dec. 2012), 44 pages.  ",
      "doi": "10.1145/2399193.2399197"
    },
    {
      "text": "Giovanni Fusco and Valerie S. Morash. 2015. The Tactile Graphics Helper: Providing Audio Clarification for Tactile Graphics Using Machine Vision. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '15). ACM, New York, NY, USA, 97--106.  ",
      "doi": "10.1145/2700648.2809868"
    },
    {
      "text": "Stéphanie Giraud, Anke M. Brock, Marc J.-M. Macé, and Christophe Jouffrais. 2017. Map Learning with a 3D Printed Interactive Small-Scale Model: Improvement of Space and Text Memorization in Visually Impaired Students. Frontiers in Psychology 8 (jun 2017), 930.",
      "doi": ""
    },
    {
      "text": "Timo Götzelmann and Aleksander Pavkovic. 2014. Towards automatically generated tactile detail maps by 3D Printers for Blind Persons. In Proceedings of ICCHP 2014, LNCS Vol 8548. 1--7. http: //link.springer.com/chapter/10.1007/978--3--319-08599--9",
      "doi": ""
    },
    {
      "text": "Tiago Guerreiro, Kyle Montague, João Guerreiro, Rafael Nunes, Hugo Nicolau, and Daniel J.V. Gonçalves. 2015. Blind People Interacting with Large Touch Surfaces: Strategies for One-handed and Two-handed Exploration. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 25--34.  ",
      "doi": "10.1145/2817721.2817743"
    },
    {
      "text": "Kim Halskov and Nicolai Brodersen Hansen. 2015. The diversity of participatory design research practice at PDC 2002--2012. International Journal of Human-Computer Studies 74 (2015), 81 -- 92.  ",
      "doi": "10.1016/j.ijhcs.2014.09.003"
    },
    {
      "text": "Shawn Lawton Henry. 2007. Just Ask: Integrating Accessibility Throughout Design (second ed.). Lulu.com, Breinigsville, PA, USA. 1--177 pages. http://www.uiaccess.com/accessucd/index.html",
      "doi": ""
    },
    {
      "text": "Brett Jones, Rajinder Sodhi, Michael Murdock, Ravish Mehra, Hrvoje Benko, Andrew Wilson, Eyal Ofek, Blair MacIntyre, Nikunj Raghuvanshi, and Lior Shapira. 2014. RoomAlive: Magical Experiences Enabled by Scalable, Adaptive Projector-camera Units. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 637--644.  ",
      "doi": "10.1145/2642918.2647383"
    },
    {
      "text": "Sasa Junuzovic, Kori Inkpen, Tom Blank, and Anoop Gupta. 2012. IllumiShare: sharing any surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1919--1928.  ",
      "doi": "10.1145/2207676.2208333"
    },
    {
      "text": "Shaun K. Kane, Brian Frey, and Jacob O. Wobbrock. 2013. Access lens: a gesture-based screen reader for real-world documents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. ACM Press, New York, New York, USA, 347.  ",
      "doi": "10.1145/2470654.2470704"
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, Annuska Z. Perkins, Daniel Wigdor, Richard E. Ladner, and Jacob O. Wobbrock. 2011. Access Overlays: Improving Non-visual Access to Large Touch Screens for Blind Users. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 273--282.  ",
      "doi": "10.1145/2047196.2047232"
    },
    {
      "text": "J. F. Kelley. 1984. An iterative design methodology for user-friendly natural language office information applications. ACM Transactions on Information Systems (TOIS) 2, 1 (1984), 26--41.  ",
      "doi": "10.1145/357417.357420"
    },
    {
      "text": "Robert M Kitchin and Ronald D Jacobson. 1997. Techniques to collect and analyze the cognitive map knowledge of persons with visual impairment or blindness: Issues of validity. Journal of Visual Impairment Blindness 91, 4 (1997), 360--376. http://people.ucalgary.ca/",
      "doi": ""
    },
    {
      "text": "Myron W. Krueger and Deborah Gilden. 1997. KnowWhere: an Audio/Spatial Interface for Blind People. In Proceedings of the Fourth International Conference on Auditory Display (ICAD)'97. Palo Alto, CA.",
      "doi": ""
    },
    {
      "text": "Lampix. 2016. Lampix website. (2016). https://www.lampix.co/",
      "doi": ""
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and Evaluation of a User Experience Questionnaire. In HCI and Usability for Education and Work, Andreas Holzinger (Ed.). Lecture Notes in Computer Science, Vol. 5298. Springer Berlin Heidelberg, Berlin, Heidelberg, 63--76.  ",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "Jérémy Laviole and Martin Hachet. 2012. PapARt: interactive 3D graphics and multi-touch augmented paper for artistic creation. In 3D User Interfaces (3DUI), 2012 IEEE Symposium on. IEEE, 3--6.",
      "doi": ""
    },
    {
      "text": "Marcia C Linn and Anne C Petersen. 1985. Emergence and characterization of sex differences in spatial ability: A meta-analysis. Child development (1985), 1479--1498.",
      "doi": ""
    },
    {
      "text": "David McGookin, Euan Robertson, and Stephen Brewster. 2010. Clutching at Straws: Using Tangible Interaction to Provide Non-visual Access to Graphs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1715--1724.  ",
      "doi": "10.1145/1753326.1753583"
    },
    {
      "text": "Oussama Metatla, Nick Bryan-Kinns, Tony Stockman, and Fiore Martin. 2015. Designing with and for people living with visual impairments: audio-tactile mock-ups, audio diaries and participatory prototyping. CoDesign 11, 1 (jan 2015), 35--48.",
      "doi": ""
    },
    {
      "text": "Mei Miao, Wiebke Köhlmann, Maria Schiewe, and Gerhard Weber. 2009. Tactile Paper Prototyping with Blind Subjects. Springer Berlin Heidelberg, Berlin, Heidelberg, 81--90.",
      "doi": ""
    },
    {
      "text": "Betsy Phillips and Hongxin Zhao. 1993. Predictors of assistive technology abandonment. Assistive technology : the official journal of RESNA 5, 1 (jan 1993), 36--45.",
      "doi": ""
    },
    {
      "text": "Delphine Picard and René Pry. 2009. Does Knowledge of Spatial Configuration in Adults with Visual Impairments Improve with Tactile Exposure to a Small-scale Model of Their Urban Environment? Journal of Visual Impairment and Blindness 103, 4 (apr 2009), 199--209. http://www. afb.org/jvib/jvibabstractNew.asp?articleid=jvib030403",
      "doi": ""
    },
    {
      "text": "Halley Profita, Reem Albaghli, Leah Findlater, Paul Jaeger, and Shaun K. Kane. 2016. The AT Effect: How Disability Affects the Perceived Social Acceptability of Head-Mounted Display Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4884--4895.  ",
      "doi": "10.1145/2858036.2858130"
    },
    {
      "text": "Rameshsharma Ramloll, Wai Yu, Stephen Brewster, Beate Riedel, Mike Burton, and Gisela Dimigen. 2000. Constructing Sonified Haptic Line Graphs for the Blind Student: First Steps. In Proceedings of the Fourth International ACM Conference on Assistive Technologies (Assets '00). ACM, New York, NY, USA, 17--25.  ",
      "doi": "10.1145/354324.354330"
    },
    {
      "text": "Casey Reas and Ben Fry. 2007. Processing: a programming handbook for visual designers and artists. Number 6812. Mit Press. ",
      "doi": "10.5555/1296181"
    },
    {
      "text": "Kyle Rector, Lauren Milne, Richard E. Ladner, Batya Friedman, and Julie A. Kientz. 2015. Exploring the Opportunities and Challenges with Exercise Technologies for People Who Are Blind or Low-Vision. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 203--214.  ",
      "doi": "10.1145/2700648.2809846"
    },
    {
      "text": "Elizabeth B-N Sanders. 2002. From user-centered to participatory design approaches. Design and the social sciences: Making connections 1, 8 (2002).",
      "doi": ""
    },
    {
      "text": "Jochen Schneider and Thomas Strothotte. 2000. Constructive exploration of spatial information by blind users. In Proceedings of the fourth international ACM conference on Assistive technologies - Assets '00. ACM Press, New York, New York, USA, 188--192.  ",
      "doi": "10.1145/354324.354375"
    },
    {
      "text": "Marc Schröder and Jürgen Trouvain. 2003. The German Text-to-Speech Synthesis System MARY: A Tool for Research, Development and Teaching. International Journal of Speech Technology 6, 4 (01 Oct 2003), 365--377.",
      "doi": ""
    },
    {
      "text": "Gottfried Seisenbacher, Peter Mayer, Paul Panek, and Wolfgang L. Zagler. 2005. 3D-Finger-System for Auditory Support of Haptic Exploration in the Education of Blind and Visually Impaired Students - Idea and Feasibility Study. In 8th European conference for the advancement of assistive technology in europe - AAATE. IOS Press, Lille, France, 73--77.",
      "doi": ""
    },
    {
      "text": "Ehud Sharlin, Benjamin Watson, Yoshifumi Kitamura, Darren Rorabeck, Robert Lederer, Steve Sutphen, Masafumi Takimoto, and Fumio Kishino. 2004. The Tangible Pathfinder Design of a Wayfinding Trainer for the Visually Impaired. Proc. Graphics Interface (2004), 2--3.",
      "doi": ""
    },
    {
      "text": "Lei Shi, Ross McLachlan, Yuhang Zhao, and Shiri Azenkot. 2016. Magic Touch: Interacting with 3D Printed Graphics. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 329--330.  ",
      "doi": "10.1145/2982142.2982153"
    },
    {
      "text": "Lei Shi, Yuhang Zhao, and Shiri Azenkot. 2017. Markit and Talkit: A Low-Barrier Toolkit to Augment 3D Printed Models with Audio Annotations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 493--506.  ",
      "doi": "10.1145/3126594.3126650"
    },
    {
      "text": "Kristen Shinohara and Josh Tenenberg. 2007. Observing Sara: A Case Study of a Blind Person's Interactions with Technology. In Proceedings of the 9th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '07). ACM, New York, NY, USA, 171--178.  ",
      "doi": "10.1145/1296843.1296873"
    },
    {
      "text": "Adam J. Sporka, Vladislav Němec, and Pavel Slavík. 2005. Tangible Newspaper for the Visually Impaired Users. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1809--1812.  ",
      "doi": "10.1145/1056808.1057028"
    },
    {
      "text": "Liam O Sullivan, Lorenzo Picinali, and Douglas Cawthorne. 2014. A Prototype Interactive Tactile Display with Auditory Feedback. In Irish HCI Conference 2014. Dublin City University, Dublin, Ireland, 4. https://www.researchgate.net/profile/Rami",
      "doi": ""
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How People with Low Vision Access Computing Devices: Understanding Challenges and Opportunities. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 171--180.  ",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Erika Tanhua-Piiroinen and Roope Raisamo. 2008. Tangible models in prototyping and testing of haptic interfaces with visually impaired children. In NordiCHI Workshop on Guidelines for Haptic Lo-Fi Prototyping, Charlotte Magnusson and Stephen Brewster (Eds.). Lund, Sweden, 11--12.",
      "doi": ""
    },
    {
      "text": "Jelle van Dijk, Niels Hendriks, Christopher Frauenberger, Fenne Verhoeven, Karin Slegers, Eva Brandt, and Rita Maldonado Branco. 2016. Empowering People with Impairments: How Participatory Methods Can Inform the Design of Empowering Artifacts. In Proceedings of the 14th Participatory Design Conference: Short Papers, Interactive Exhibitions, Workshops - Volume 2 (PDC '16). ACM, New York, NY, USA, 121--122.  ",
      "doi": "10.1145/2948076.2948101"
    },
    {
      "text": "Daniel Wagner and Dieter Schmalstieg. 2007. Artoolkitplus for pose tracking on mobile devices. na.",
      "doi": ""
    },
    {
      "text": "Pierre Wellner. 1993. Interacting with paper on the DigitalDesk. Commun. ACM 36, 7 (1993), 87--96.  ",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "Robert Xiao, Chris Harrison, and Scott E. Hudson. 2013. WorldKit: Rapid and Easy Creation of Ad-hoc Interactive Applications on Everyday Surfaces. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 2889--2890.  ",
      "doi": "10.1145/2468356.2479563"
    },
    {
      "text": "Yuhang Zhao, Michele Hu, Shafeka Hashash, and Shiri Azenkot. 2017. Understanding Low Vision People's Visual Perception on Commercial Augmented Reality Glasses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4170--4181.  ",
      "doi": "10.1145/3025453.3025949"
    },
    {
      "text": "Yuhang Zhao, Sarit Szpiro, and Shiri Azenkot. 2015. ForeSee: A Customizable Head-Mounted Vision Enhancement System for People with Low Vision. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 239--249.  ",
      "doi": "10.1145/2700648.2809865"
    },
    {
      "text": "Yuhang Zhao, Sarit Szpiro, Jonathan Knighten, and Shiri Azenkot. 2016. CueSee: Exploring Visual Cues for People with Low Vision to Facilitate a Visual Search Task. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 73--84.  ",
      "doi": "10.1145/2971648.2971730"
    }
  ]
}