{
  "doi": "10.1145/3173574.3173769",
  "title": "CommunityCrit: Inviting the Public to Improve and Evaluate Urban Design Ideas through Micro-Activities",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "While urban design affects the public, most people do not have the time or expertise to participate in the process. Many online tools solicit public input, yet typically limit interaction to collecting complaints or early-stage ideas. This paper explores how to engage the public in more complex stages of urban design without requiring a significant time commitment. After observing workshops, we designed a system called CommunityCrit that offers micro-activities to engage communities in elaborating and evaluating urban design ideas. Through a four-week deployment, in partnership with a local planning group seeking to redesign a street intersection, CommunityCrit yielded 352 contributions (around 10 minutes per participant). The planning group reported that CommunityCrit provided insights on public perspectives and raised awareness for their project, but noted the importance of setting expectations for the process. People appreciated that the system provided a window into the planning process, empowered them to contribute, and supported diverse levels of skills and availability.",
  "authors": [
    {
      "name": "Narges Mahyar",
      "institution": "University of California, San Diego, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490689705",
      "orcid": "0000-0003-1781-0029"
    },
    {
      "name": "Michael R. James",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261693",
      "orcid": "missing"
    },
    {
      "name": "Michelle M. Ng",
      "institution": "Harvard University, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260585",
      "orcid": "missing"
    },
    {
      "name": "Reginald A. Wu",
      "institution": "University of California, San Diego, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260910",
      "orcid": "missing"
    },
    {
      "name": "Steven P. Dow",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758794857",
      "orcid": "0000-0002-1354-9866"
    }
  ],
  "references": [
    {
      "text": "2002. Get it Done. (2002). https://www.sandiego.gov/get-it-done",
      "doi": ""
    },
    {
      "text": "2006. Waze. (2006). https://www.waze.com",
      "doi": ""
    },
    {
      "text": "2011. Nextdoor. (2011). https://renaissancesd.nextdoor.com",
      "doi": ""
    },
    {
      "text": "2017. CommunityCrit. (2017). https://cc.ucsd.edu",
      "doi": ""
    },
    {
      "text": "2017. MiVote. (2017). www.mivote.org.au",
      "doi": ""
    },
    {
      "text": "2017. Participatory Approaches to Planning Community Interventions. (2017). Accessed 18 September 2017.",
      "doi": ""
    },
    {
      "text": "Tanja Aitamurto, Helene Landemore, David Lee, and Ashish Goel. 2014. Crowdsourced off-road traffic law experiment in Finland. Report about idea crowdsourcing and evaluation. Publications of the Committee for the Future, the Parliament of Finland 1 (2014), 2014.",
      "doi": ""
    },
    {
      "text": "Tanja Aitamurto and Helene E Landemore. 2015. Five design principles for crowdsourced policymaking: Assessing the case of crowdsourced off-road traffic law in Finland. (2015).",
      "doi": ""
    },
    {
      "text": "Lincoln Allison. 1986. What is urban planning for? Town Planning Review 57, 1 (1986), 5.",
      "doi": ""
    },
    {
      "text": "Paul André, Haoqi Zhang, Juho Kim, Lydia Chilton, Steven P. Dow, and Robert C Miller. 2013. Community clustering: Leveraging an academic crowd to form coherent conference sessions. In First AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Sherry R Arnstein. 1969. A ladder of citizen participation. Journal of the American Institute of planners 35, 4 (1969), 216--224.",
      "doi": ""
    },
    {
      "text": "Mariam Asad, Christopher A Le Dantec, Becky Nielsen, and Kate Diedrick. 2017. Creating a Sociotechnical API: Designing City-Scale Community Engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2295--2306.  ",
      "doi": "10.1145/3025453.3025963"
    },
    {
      "text": "Solomon E Asch. 1955. Opinions and social pressure. Readings about the social animal 193 (1955), 17--26.",
      "doi": ""
    },
    {
      "text": "American Planning Association. 2006. Planning and urban design standards. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Mara Balestrini, Yvonne Rogers, Carolyn Hassan, Javi Creus, Martha King, and Paul Marshall. 2017. A city in common: a framework to orchestrate large-scale citizen engagement around urban issues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2282--2294.  ",
      "doi": "10.1145/3025453.3025915"
    },
    {
      "text": "Anant Bhardwaj, Juho Kim, Steven P. Dow, David Karger, Sam Madden, Rob Miller, and Haoqi Zhang. 2014. Attendee-sourcing: Exploring the design space of community-informed conference scheduling. In Second AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Geoff Boeing, Daniel Church, Haley Hubbard, Julie Mickens, and Lili Rudis. 2014. LEED-ND and livability revisited. (2014).",
      "doi": ""
    },
    {
      "text": "Daren C Brabham. 2009. Crowdsourcing the public participation process for planning projects. Planning Theory 8, 3 (2009), 242--262.",
      "doi": ""
    },
    {
      "text": "John M Bryson, Kathryn S Quick, Carissa Schively Slotterback, and Barbara C Crosby. 2013. Designing public participation processes. Public administration review 73, 1 (2013), 23--34.",
      "doi": ""
    },
    {
      "text": "Joel Chan, Steven Dang, and Steven P. Dow. 2016. Improving crowd innovation with expert facilitation. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1223--1235.  ",
      "doi": "10.1145/2818048.2820023"
    },
    {
      "text": "Caron Chess and Kristen Purcell. 1999. Public participation and the environment: Do we know what works?. In ACS Publications. 2685--2692.",
      "doi": ""
    },
    {
      "text": "Soon Ae Chun, Stuart Shulman, Rodrigo Sandoval, and Eduard Hovy. 2010. Government 2.0: Making connections between citizens, data and government. Information Polity 15, 1 (2010), 1. ",
      "doi": "10.5555/1858974.1858986"
    },
    {
      "text": "Stephen Coleman and John Gotze. 2001. Bowling together: Online public engagement in policy deliberation. Hansard Society London.",
      "doi": ""
    },
    {
      "text": "Patrick M Condon, Duncan Cavens, and Nicole Miller. 2009. Urban planning tools for climate change mitigation. Lincoln Institute of Land Policy Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Rosta Farzan, Robert Kraut, and Tom Postmes. 2012. Fresh faces in the crowd: turnover, identity, and commitment in online groups. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 245--248.  ",
      "doi": "10.1145/2145204.2145243"
    },
    {
      "text": "Fiorella De Cindio and Cristian Peraboni. 2009. Fostering e-participation at the urban level: Outcomes from a large field experiment. In International Conference on Electronic Participation. Springer, 112--124.  ",
      "doi": "10.1007/978-3-642-03781-8_11"
    },
    {
      "text": "Kevin C Desouza and Akshay Bhagwatwar. 2014. Technology-enabled participatory platforms for civic engagement: the case of US cities. Journal of Urban Technology 21, 4 (2014), 25--50.",
      "doi": ""
    },
    {
      "text": "Bob Dick. 1997. Dialectical processes. Online: http:// www.scu.edu/schools/sawd/arr/dialectic.html (1997).",
      "doi": ""
    },
    {
      "text": "Michael Diehl and Wolfgang Stroebe. 1987. Productivity loss in brainstorming groups: Toward the solution of a riddle. Journal of personality and social psychology 53, 3 (1987), 497.",
      "doi": ""
    },
    {
      "text": "Steven P. Dow, Anand Kulkarni, Scott Klemmer, and Björn Hartmann. 2012. Shepherding the crowd yields better work. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 1013--1022.  ",
      "doi": "10.1145/2145204.2145355"
    },
    {
      "text": "Amir Ehsaei, Thomas Sweet, Raphael Garcia, Laura Adleman, and Jean M Walsh. 2015. Successful Public Outreach Programs for Green Infrastructure Projects. In International Low Impact Development Conference 2015: LID: It Works in All Climates and Soils. 74--92.",
      "doi": ""
    },
    {
      "text": "Marcus Foth, Ronald Schroeter, and Irina Anastasiu. 2011. Fixing the city one photo at a time: mobile logging of maintenance requests. In Proceedings of the 23rd Australian Computer-Human Interaction Conference. ACM, 126--129.  ",
      "doi": "10.1145/2071536.2071555"
    },
    {
      "text": "Joel Fredericks and Marcus Foth. 2013. Augmenting public participation: enhancing planning outcomes through the use of social media and web 2.0. Australian planner 50, 3 (2013), 244--256.",
      "doi": ""
    },
    {
      "text": "Archon Fung and David Weil. 2010. Open government and open society. Open government: Collaboration, transparency, and participation in practice 105 (2010), 106--08.",
      "doi": ""
    },
    {
      "text": "Cynthia L Girling. 2006. Informing Design Charrettes: tools for participation in neighbourhood-scale planning. Integrated Assessment 6, 4 (2006).",
      "doi": ""
    },
    {
      "text": "Eric Gordon and Paul Mihailidis. 2016. Civic Media: Technology, Design, Practice. MIT Press. ",
      "doi": "10.5555/3055832"
    },
    {
      "text": "Jan Halatsch, Antje Kunze, and Gerhard Schmitt. 2009. Value Lab: A collaborative environment for the planning of Future Cities. In Proceedings of eCAADe, Vol. 27.",
      "doi": ""
    },
    {
      "text": "Colleen Hardwick. 2012. GeoSocial: Shifting the Paradigm with PlaceSpeak. (2012).",
      "doi": ""
    },
    {
      "text": "Mokter Hossain. 2012. Users' motivation to participate in online crowdsourcing platforms. In Innovation Management and Technology Research (ICIMTR), 2012 International Conference on. IEEE, 310--315.",
      "doi": ""
    },
    {
      "text": "Shih-Wen Huang and Wai-Tat Fu. 2013. Don't hide in the crowd!: increasing social transparency between peer workers improves crowdsourcing outcomes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 621--630.  ",
      "doi": "10.1145/2470654.2470743"
    },
    {
      "text": "Judith E. Innes and David E. Booher. 2004. Reframing public participation: strategies for the 21st century. Planning theory & practice 5, 4 (2004), 419--436.",
      "doi": ""
    },
    {
      "text": "Joshua Introne, Robert Laubacher, Gary Olson, and Thomas Malone. 2013. Solving wicked social problems with socio-computational systems. KI-Künstliche Intelligenz 27, 1 (2013), 45--52.",
      "doi": ""
    },
    {
      "text": "Lilly C Irani and M Silberman. 2016. Stories We Tell About Labor: Turkopticon and the Trouble with Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4573--4586.  ",
      "doi": "10.1145/2858036.2858592"
    },
    {
      "text": "Nassim JafariNaimi. 2015. MRx as a participatory platform. Digital Creativity 26, 3--4 (2015), 207--220.",
      "doi": ""
    },
    {
      "text": "Lars Bo Jeppesen and Karim R Lakhani. 2010. Marginality and problem-solving effectiveness in broadcast search. Organization science 21, 5 (2010), 1016--1033.  ",
      "doi": "10.1287/orsc.1090.0491"
    },
    {
      "text": "Juho Kim and others. 2015. Learnersourcing: improving learning with collective learner activity. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Nam Wook Kim, Jonghyuk Jung, Eun-Young Ko, Songyi Han, Chang Won Lee, Juho Kim, and Jihee Kim. 2016. BudgetMap: Engaging Taxpayers in the Issue-Driven Classification of a Government Budget. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1028--1039.  ",
      "doi": "10.1145/2818048.2820004"
    },
    {
      "text": "Nam Wook Kim, Chang Won Lee, Jonghyuk Jung, Eun-Young Ko, Juho Kim, and Jihee Kim. 2015. Budgetmap: Issue-driven navigation for a government budget. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1097--1102.  ",
      "doi": "10.1145/2702613.2732932"
    },
    {
      "text": "Peter Kinnaird, Laura Dabbish, and Sara Kiesler. 2012. Workflow transparency in a microtask marketplace. In Proceedings of the 17th ACM international conference on Supporting group work. ACM, 281--284.  ",
      "doi": "10.1145/2389176.2389219"
    },
    {
      "text": "Peter Kinnaird, Laura Dabbish, Sara Kiesler, and Haakon Faste. 2013. Co-worker transparency in a microtask marketplace. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1285--1290.  ",
      "doi": "10.1145/2441776.2441921"
    },
    {
      "text": "Aniket Kittur, Jeffrey V Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The future of crowd work. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1301--1318.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E Kraut. 2011. Crowdforge: Crowdsourcing complex work. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 43--52.  ",
      "doi": "10.1145/2047196.2047202"
    },
    {
      "text": "Mark Klein. 2011. How to harvest collective wisdom on complex problems: An introduction to the mit deliberatorium. Center for Collective Intelligence working paper (2011).",
      "doi": ""
    },
    {
      "text": "Travis Kriplean, Jonathan Morgan, Deen Freelon, Alan Borning, and Lance Bennett. 2012. Supporting reflective public thought with considerit. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 265--274.  ",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Anand P Kulkarni, Matthew Can, and Bjoern Hartmann. 2011. Turkomatic: automatic recursive task and workflow design for mechanical turk. In CHI'11 Extended Abstracts on Human Factors in Computing Systems. ACM, 2053--2058.  ",
      "doi": "10.1145/1979742.1979865"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec, Kari E Watkins, Russ Clark, and Elizabeth Mynatt. 2015. Cycle Atlanta and OneBusAway: Driving innovation through the data ecosystems of civic computing. In International Conference on Human-Computer Interaction. Springer, 327--338.",
      "doi": ""
    },
    {
      "text": "Matthew Leighninger. 2006. The next form of democracy: How expert rule is giving way to shared governance--and why politics will never be the same. Vanderbilt University Press.",
      "doi": ""
    },
    {
      "text": "John M Levine and Richard L Moreland. 1994. Group socialization: Theory and research. European review of social psychology 5, 1 (1994), 305--336.",
      "doi": ""
    },
    {
      "text": "Charles E Lindblom. 1959. The science of \"muddling through\". Public administration review (1959), 79--88.",
      "doi": ""
    },
    {
      "text": "Charles E Lindblom. 1979. Still muddling, not yet through. Public administration review 39, 6 (1979), 517--526.",
      "doi": ""
    },
    {
      "text": "Greg Little, Lydia B Chilton, Max Goldman, and Robert C Miller. 2009. Turkit: tools for iterative tasks on mechanical turk. In Proceedings of the ACM SIGKDD workshop on human computation. ACM, 29--30.  ",
      "doi": "10.1145/1600150.1600159"
    },
    {
      "text": "Greg Little, Lydia B Chilton, Max Goldman, and Robert C Miller. 2010. Exploring iterative and parallel human computation processes. In Proceedings of the ACM SIGKDD workshop on human computation. ACM, 68--76.  ",
      "doi": "10.1145/1837885.1837907"
    },
    {
      "text": "Weichen Liu, Sijia Xiao, Browne Jacob T., Ming Yang, and Steven P. Dow. 2018. ConsensUs: Supporting Multi-Criteria Group Decisions by Visualizing Points of Disagreement. In ACM Transactions on Social Computing.  ",
      "doi": "10.1145/3159649"
    },
    {
      "text": "Kurt Luther, Amy Pavel, Wei Wu, Jari-lee Tolentino, Maneesh Agrawala, Björn Hartmann, and Steven P. Dow. 2014. CrowdCrit: crowdsourcing and aggregating visual design critique. In Proceedings of the companion publication of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing. ACM, 21--24.  ",
      "doi": "10.1145/2556420.2556788"
    },
    {
      "text": "Ioanna Lykourentzou, Shannon Wang, Robert E. Kraut, and Steven P. Dow. 2016. Team dating: A self-organized team formation strategy for collaborative crowdsourcing. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1243--1249.  ",
      "doi": "10.1145/2851581.2892421"
    },
    {
      "text": "Susanna Haas Lyons, Mike Walsh, Erin Aleman, and John Robinson. 2014. Exploring regional futures: Lessons from Metropolitan Chicago's online MetroQuest. Technological Forecasting and Social Change 82 (2014), 23--33.",
      "doi": ""
    },
    {
      "text": "Narges Mahyar, Kelly J. Burke, Jialiang Ernest Xiang, Siyi Cathy Meng, Kellogg S Booth, Cynthia L Girling, and Ronald W Kellett. 2016. UD Co-Spaces: A Table-Centred Multi-Display Environment for Public Engagement in Urban Design Charrettes. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces. ACM, 109--118.  ",
      "doi": "10.1145/2992154.2992163"
    },
    {
      "text": "Valérie Maquil. 2015. Towards understanding the design space of tangible user interfaces for collaborative urban planning. Interacting with Computers 28, 3 (2015), 332--351.",
      "doi": ""
    },
    {
      "text": "David Martin, Benjamin V Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a turker. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 224--235.  ",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Taewoo Nam. 2012. Suggesting frameworks of citizen-sourcing via Government 2.0. Government Information Quarterly 29, 1 (2012), 12--20.",
      "doi": ""
    },
    {
      "text": "Donald A Norman and Pieter Jan Stappers. 2016. DesignX: Complex Sociotechnical Systems. She Ji: The Journal of Design, Economics, and Innovation 1, 2 (2016), 83--106.",
      "doi": ""
    },
    {
      "text": "Katherine Panciera, Reid Priedhorsky, Thomas Erickson, and Loren Terveen. 2010. Lurking? cyclopaths?: a quantitative lifecycle analysis of user behavior in a geowiki. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1917--1926.  ",
      "doi": "10.1145/1753326.1753615"
    },
    {
      "text": "Chrysaida-Aliki Papadopoulou and Maria Giaoutzi. 2017. Crowdsourcing and Living Labs in Support of Smart Cities' Development. International Journal of E-Planning Research (IJEPR) 6, 2 (2017), 22--38.  ",
      "doi": "10.4018/IJEPR.2017040102"
    },
    {
      "text": "Suzanne J Piotrowski and Gregg G Van Ryzin. 2007. Citizen attitudes toward transparency in local government. The American Review of Public Administration 37, 3 (2007), 306--323.",
      "doi": ""
    },
    {
      "text": "Horst W. Rittel and Melvin M. Webber. 1973. Planning problems are wicked. Polity 4 (1973), 155--169.",
      "doi": ""
    },
    {
      "text": "Deni Ruggeri and Deven Young. 2016. Community in the information age: Exploring the social potential of web-based technologies in landscape architecture and community design. Frontiers of Architectural Research 5, 1 (2016), 15--26.",
      "doi": ""
    },
    {
      "text": "Niloufar Salehi, Andrew McCabe, Melissa Valentine, and Michael Bernstein. 2016. Huddler: Convening Stable and Familiar Crowd Teams Despite Unpredictable Availability (CSCW '16). ACM, New York, NY, USA.  ",
      "doi": "10.1145/2998181.2998300"
    },
    {
      "text": "Matthew J Salganik and Karen EC Levy. 2015. Wiki surveys: Open and quantifiable social data collection. PloS one 10, 5 (2015).",
      "doi": ""
    },
    {
      "text": "Henry Sanoff. 2000. Community participation methods in design and planning. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Donald A Schon. 1984. The reflective practitioner: How professionals think in action. Vol. 5126. Basic books.",
      "doi": ""
    },
    {
      "text": "Dimitri Schuurman, Bastiaan Baccarne, Lieven De Marez, and Peter Mechant. 2012. Smart ideas for smart cities: Investigating crowdsourcing for generating and selecting ideas for ICT innovation in a city context. Journal of theoretical and applied electronic commerce research 7, 3 (2012), 49--62.  ",
      "doi": "10.4067/S0718-18762012000300006"
    },
    {
      "text": "Swapnil Shrivastav. 2017. Urbane: Community Driven Architecture and Planning Through a Mobile Social Platform. In E-Democracy for Smart Cities. Springer, 487--508.",
      "doi": ""
    },
    {
      "text": "Alina Siegfried. 2014. From Occupy to online democracy: the Loomio story. (2014).",
      "doi": ""
    },
    {
      "text": "Stefan Steiniger, Mohammad Ebrahim Poorazizi, Coral AM Bliss-Taylor, Ehsan Mohammadi, and Andrew JS Hunter. 2012. PlanYourPlace: Merging social networks and participatory GIS for participatory planning. Knowing to manage the territory, protect the environment, evaluate he cultural heritage (2012).",
      "doi": ""
    },
    {
      "text": "Colleen H. Stuart, Laura Dabbish, Sara Kiesler, Peter Kinnaird, and Ruogu Kang. 2012. Social transparency in networked information exchange: a theoretical framework. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 451--460.  ",
      "doi": "10.1145/2145204.2145275"
    },
    {
      "text": "Cass R Sunstein. 2002. The law of group polarization. Journal of political philosophy 10, 2 (2002), 175--195.",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Niloufar Salehi, Michelle S Lam, Juan C Marroquin, and Michael S Bernstein. 2016. Atelier: Repurposing expert crowdsourcing tasks as micro-internships. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2645--2656.  ",
      "doi": "10.1145/2858036.2858121"
    },
    {
      "text": "Linda Tischler. 2011. Looking for Bold Ideas to Fix the City, New York Turns to Crowd Sourcing. (Jan 2011).",
      "doi": ""
    },
    {
      "text": "Jordanka Tomkova. 2009. E-consultations: New tools for civic engagement or facades for political correctness. European Journal of ePractice 7 (2009), 45--55.",
      "doi": ""
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. 1999. Urp: a luminous-tangible workbench for urban planning and design. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 386--393.  ",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Rajan Vaish, Snehalkumar Neil S Gaikwad, Geza Kovacs, Andreas Veit, Ranjay Krishna, Imanol Arrieta Ibarra, Camelia Simoiu, Michael Wilber, Serge Belongie, Sharad Goel, and others. 2017. Crowd Research: Open and Scalable University Laboratories. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 829--843.  ",
      "doi": "10.1145/3126594.3126648"
    },
    {
      "text": "Robert Vogel, Evelina Moulder, and Mike Huggins. 2014. The extent of public participation. Public Management 96, 2 (2014), 6--10.",
      "doi": ""
    },
    {
      "text": "Eric Von Hippel. 1994. \"Sticky information\" and the locus of problem solving: implications for innovation. Management science 40, 4 (1994), 429--439.  ",
      "doi": "10.5555/2845861.2845862"
    },
    {
      "text": "Eric von Hippel. 2017. Free Innovation by Consumers--How Producers Can Benefit: Consumers' free innovations represent a potentially valuable resource for industrial innovators. Research-Technology Management 60, 1 (2017), 39--42.",
      "doi": ""
    },
    {
      "text": "Jason B. Walker and Michael W. Seymour. 2008. Utilizing the design charrette for teaching sustainability. International Journal of Sustainability in Higher Education 9, 2 (2008), 157--169.",
      "doi": ""
    },
    {
      "text": "Mark E. Whiting, Dilrukshi Gamage, Snehalkumar S Gaikwad, Aaron Gilbee, Shirish Goyal, Alipta Ballav, Dinesh Majeti, Nalin Chhibber, Angela Richmond-Fuller, Freddie Vargus, and others. 2016. Crowd guilds: Worker-led reputation and feedback on crowdsourcing platforms. arXiv preprint arXiv:1611.01572 (2016).  ",
      "doi": "10.1145/2998181.2998234"
    },
    {
      "text": "Haoqi Zhang, Edith Law, Rob Miller, Krzysztof Gajos, David Parkes, and Eric Horvitz. 2012. Human computation tasks with global constraints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 217--226.  ",
      "doi": "10.1145/2207676.2207708"
    },
    {
      "text": "Haichao Zheng, Dahui Li, and Wenhua Hou. 2011. Task design, motivation, and participation in crowdsourcing contests. International Journal of Electronic Commerce 15, 4 (2011), 57--88.  ",
      "doi": "10.2753/JEC1086-4415150402"
    },
    {
      "text": "John Zimmerman, Anthony Tomasic, Charles Garrod, Daisy Yoo, Chaya Hiruncharoenvate, Rafae Aziz, Nikhil Ravi Thiruvengadam, Yun Huang, and Aaron Steinfeld. 2011. Field trial of tiramisu: crowd-sourcing bus arrival times to spur co-design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1677--1686.  ",
      "doi": "10.1145/1978942.1979187"
    }
  ]
}