{
  "doi": "10.1145/3173574.3173658",
  "title": "Conversations in the Eye of the Storm: At-Scale Features of Conversational Structure in a High-Tempo, High-Stakes Microblogging Environment",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "This work propels social media research beyond the single post as the unit of analysis toward fuller treatment of interaction by making the construct of the conversation analytically available. We offer a method for constructing @reply conversations in Twitter to apprehend social media conversational features at scale. We apply this method to the high-tempo, high-stakes environment of 2012's Hurricane Sandy, with its high volume of online talk by affected locals and distinct disaster-stage phasing by which to consider interactional difference. We investigate the temporality of conversations; the relationality of who speaks to whom; the number and kind of conversationalists; and how content affects temporal features. The analysis reveals that, during the height of the emergency, people expand conversations both in number and kind of conversational partners-just as their information search intensifies. This expansion contributes to longer, slower-paced conversations in the high-emergency period, suggesting reliance on online relationships during times of greatest uncertainty.",
  "tags": [
    "crisis informatics",
    "computer supported cooperative work",
    "social computing",
    "social media"
  ],
  "authors": [
    {
      "name": "Marina Kogan",
      "institution": "University of New Mexico, Albuquerque, NM, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658688428",
      "orcid": "0000-0002-9200-6914"
    },
    {
      "name": "Leysia Palen",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81100610626/rel-imgonly/image3.jpg",
      "acmid": "81100610626",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jennings Anderson, Marina Kogan, Melissa Bica, Leysia Palen, Kenneth M. Anderson, Rebecca E. Morss, Julie Demuth, Heather Lazrus, Olga Wilhelmi, and Jennifer Henderson. 2016. Far Far Away in Far Rockaway: Responses to Risks and Impacts during Hurricane Sandy through First-Person Social Media Narratives. In Proceedings of the thirteenth international conference on Information System for Crisis Response and Managements (ISCRAM '2016).",
      "doi": ""
    },
    {
      "text": "Ahmer Arif, John J. Robinson, Stephanie A. Stanek, Elodie S. Fichet, Paul Townsend, Zena Worku, & Kate Starbird, 2017. A Closer Look at the Self-Correcting Crowd: Examining Corrections in Online Rumors. In Proc. of CSCW (pp. 155--168). ACM.  ",
      "doi": "10.1145/2998181.2998294"
    },
    {
      "text": "JinYoung Bak, Suin Kim, & Alice Oh. 2012. Selfdisclosure and relationship strength in Twitter conversations. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Short Papers-Volume 2 (pp. 60--64). Association for Computational Linguistics. ",
      "doi": "10.5555/2390665.2390681"
    },
    {
      "text": "Eytan Bakshy, Jake M. Hofman, Winter A. Mason, and Duncan J. Watts. 2011. Everyone's an influencer: quantifying influence on twitter. In Proceedings of the fourth ACM international conference on Web search and data mining (WSDM '11). ACM, New York, NY, USA, 65--74.  ",
      "doi": "10.1145/1935826.1935845"
    },
    {
      "text": "Eytan Bakshy, Itamar Rosenn, Cameron Marlow, and Lada Adamic. 2012. The role of social networks in information diffusion. In Proceedings of the 21st international conference on World Wide Web (WWW '12). ACM, New York, NY, USA, 519--528.  ",
      "doi": "10.1145/2187836.2187907"
    },
    {
      "text": "Eric S. Blake, Todd B. Kimberlain, Robert J. Berg, John P. Cangialosi, and John L. Beven II. (2013).Tropical Cyclone Report: Hurricane Sandy. National Hurricane Center, 12.",
      "doi": ""
    },
    {
      "text": "Catherine A. Bliss, Isabel M. Kloumann, Kameron Decker Harris, Christopher M. Danforth, and Peter Sheridan Dodds. (2012). Twitter reciprocal reply networks exhibit assortativity with respect to happiness. Journal of Computational Science, 3(5), 388--397.",
      "doi": ""
    },
    {
      "text": "Axel Bruns and Jean E. Burgess (2011). The use of Twitter hashtags in the formation of ad hoc publics. In 6th European Consortium for Political Research General Conference, 25--27 August 2011, University of Iceland, Reykjavik.",
      "doi": ""
    },
    {
      "text": "Cornelia Caragea, Anna Squicciarini, Sam Stehle, Kishore Neppalli, and Andrea Tapia. (2014). Mapping Moods: Geo-Mapped Sentiment Analysis During Hurricane Sandy. In Proceedings of eleventh international conference on Information System for Crisis Response and Managements (ISCRAM '2014).",
      "doi": ""
    },
    {
      "text": "Fabio Celli & Luca Rossi. 2012. The role of emotional stability in Twitter conversations. In Proceedings of the workshop on semantic analysis in social media (pp. 1017). Association for Computational Linguistics. ",
      "doi": "10.5555/2389969.2389971"
    },
    {
      "text": "Meeyoung Cha, Hamed Haddadi, Fabricio Benevenuto, and Krishna P. Gummadi. Measuring User Influence in Twitter: The Million Follower Fallacy. In Proceedings of fourth international conference of Weblogs and Social Media (ICWSM '10). pp 10--17 (2010): 30.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Andrés Monroy-Hernández, and Gloria Mark. 2014. \"Narco\" emotions: affect and desensitization in social media during the mexican drug war. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3563--3572.  ",
      "doi": "10.1145/2556288.2557197"
    },
    {
      "text": "Martin Dittus, Giovanni Quattrone, and Licia Capra. 2016. Analysing Volunteer Engagement in Humanitarian Mapping: Building Contributor Communities at Large Scale. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 108--118.  ",
      "doi": "10.1145/2818048.2819939"
    },
    {
      "text": "Russell Rowe Dynes. 1970. Organized Behavior in Disaster. Heath Lexington Books.",
      "doi": ""
    },
    {
      "text": "FEMA (July 1, 2013). Hurricane Sandy FEMA After Action Report, http://www.fema.gov/media-librarydata/20130726--1923--25045--7442/sandy_fema_aar.pdf",
      "doi": ""
    },
    {
      "text": "Charles E. Fritz and J. H. Mathewson. 1957. Convergence Behavior in Disasters: A Problem in Social Control. Committee on Disaster Studies, Disaster Study No. 9. Washington, DC, National Academy of Sciences, National Research Council.",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger and Aaron Halfaker. 2013. Using edit sessions to measure participation in wikipedia. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 861--870.  ",
      "doi": "10.1145/2441776.2441873"
    },
    {
      "text": "Bruce Evan Goldstein. (Ed.). Collaborative resilience: moving through crisis to opportunity. MIT Press. (2012).",
      "doi": ""
    },
    {
      "text": "Bruno Gonçalves, Nicola Perra, & Alessandro Vespignani. 2011. Modeling users' activity on twitter networks: Validation of dunbar's number. PloS one, 6(8), e22656.",
      "doi": ""
    },
    {
      "text": "Mark Granovetter. (1983). The strength of weak ties: A network theory revisited. In Sociological theory 1.1:201--233.",
      "doi": ""
    },
    {
      "text": "Aniko Hannak, Drew Margolin, Brian Keegan, & Ingmar Weber. 2014. Get Back! You Don't Know Me Like That: The Social Mediation of Fact Checking Interventions in Twitter Conversations. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Bartosz Hawelka, Izabela Sitko, Euro Beinat,Stanislav Sobolevsky, Pavlos Kazakopoulos, & Carlo Ratti, 2014. Geo-located Twitter as proxy for global mobility patterns. Cartography and Geographic Information Science, 41(3), 260--271.",
      "doi": ""
    },
    {
      "text": "Amanda Hughes, Leysia Palen, Jeannette Sutton, Sophia Liu, & Sarah Vieweg. 2008. \"Site-Seeing\" in Disaster: An Examination of On-Line Social Convergence Proceedings of the Information Systems for Crisis Response and Management Conference.",
      "doi": ""
    },
    {
      "text": "Brian Keegan, Darren Gergle, & Noshir Contractor. 2013. Hot off the wiki: Structures and dynamics of Wikipedia's coverage of breaking news events. American Behavioral Scientist, 57(5), 595--622.",
      "doi": ""
    },
    {
      "text": "Brian Keegan, Darren Gergle, and Noshir Contractor. 2012. Staying in the loop: structure and dynamics of Wikipedia's breaking news collaborations. In Proceedings of the Eighth Annual International Symposium on Wikis and Open Collaboration (WikiSym '12). Article 1, 10 pages.  ",
      "doi": "10.1145/2462932.2462934"
    },
    {
      "text": "James M. Kendra and Tricia Wachtendorf. 2003. Reconsidering Convergence and Converger Legitimacy in Response to the World Trade Center Disaster. Terrorism and Disaster: New Threats, New Ideas (Research in Social Problems and Public Policy) 11: 97--122.",
      "doi": ""
    },
    {
      "text": "Suin Kim, JinYoung Bak, & Alice Oh. 2012, May. Do You Feel What I Feel? Social Aspects of Emotions in Twitter Conversations. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Marina Kogan, Leysia Palen, and Kenneth M. Anderson. 2015. Think Local, Retweet Global: Retweeting by the Geographically-Vulnerable during Hurricane Sandy. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 981--993.  ",
      "doi": "10.1145/2675133.2675218"
    },
    {
      "text": "Haewoon Kwak, Changhyun Lee, Hosung Park, and Sue Moon. 2010. What is Twitter, a social network or a news media?. In Proceedings of the 19th international conference on World wide web(WWW '10). ACM, New York, NY, USA, 591--600.  ",
      "doi": "10.1145/1772690.1772751"
    },
    {
      "text": "Jeffrey K. Lazo, Ann Bostrom, Rebecca E. Morss, Julie L. Demuth & Heather Lazrus. 2015. Factors affecting hurricane evacuation intentions. Risk analysis, 35(10), 1837--1857.",
      "doi": ""
    },
    {
      "text": "Sophia Liu, Leysia Palen, Jeannette Sutton, Amanda Hughes, & Sarah Vieweg. 2008. In Search of the Bigger Picture: The Emergent Role of On-Line PhotoSharing in Times of Disaster. Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM)",
      "doi": ""
    },
    {
      "text": "Rebecca E. Morss, Julie Demuth, Jeffrey K. Lazo, Katherine Dickinson, Heather Lazrus, and Betty H. Morrow, B. H. (2015) Understanding public hurricane evacuation decisions and responses to forecast and warning messages, submitted to Weather and Forecasting.",
      "doi": ""
    },
    {
      "text": "M. E. J. Newman. (2003). Mixing patterns in networks. Physical Review E,67(2), 026126.",
      "doi": ""
    },
    {
      "text": "M.E.J. Newman, Duncan Watts, & Steven Strogatz. 2002. Random graph models of social networks. Proceedings of the National Academy of Sciences, 99(suppl 1), 2566--2572.",
      "doi": ""
    },
    {
      "text": "Leysia Palen, Sarah Vieweg, Sophia B. Liu, and Amanda Lee Hughes. 2009. Crisis in a Networked World. In Soc. Sci. Comput. Rev. 27, 4: 467--480.  ",
      "doi": "10.1177/0894439309332302"
    },
    {
      "text": "Leysia Palen and Kenneth M. Anderson (2016). Crisis Informatics-New Data for Extraordinary Times.Science, Vol 353, Issue 6296, 15 Jul 2016, pp. 224--225.",
      "doi": ""
    },
    {
      "text": "Sung-Yueh Perng, Monika Buscher, Lisa Wood, Ragnhild Halvorsrud, Michael Stiso, Leonardo Ramirez, and Amro Al-Akkad. 2013. Peripheral response: microblogging during the 22/7/2011 Norway attacks. International Journal of Information Systems for Crisis Response and Management 5, 1: 41--57.",
      "doi": ""
    },
    {
      "text": "John W. Powell. 1954. An introduction to the natural history of disaster. University of Maryland: Disaster Research Project.",
      "doi": ""
    },
    {
      "text": "Yan Qu, Chen Huang, Pengyi Zhang, and Jun Zhang. 2011. Microblogging after a major disaster in China: a case study of the 2010 Yushu earthquake. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11). ACM, New York, NY, USA, 25--34.  ",
      "doi": "10.1145/1958824.1958830"
    },
    {
      "text": "Alan Ritter, Colin Cherry, & Bill Dolan. 2010. Unsupervised modeling of twitter conversations. In Human Language Technologies: The 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics (pp. 172180). Association for Computational Linguistics. ",
      "doi": "10.5555/1857999.1858019"
    },
    {
      "text": "Daniel M. Romero, Brendan Meeder, and Jon Kleinberg. 2011. Differences in the mechanics of information diffusion across topics: idioms, political hashtags, and complex contagion on twitter. In Proceedings of the 20th international conference on World wide web (WWW '11). ACM, New York, NY, USA, 695--704.  ",
      "doi": "10.1145/1963405.1963503"
    },
    {
      "text": "Harvey Sacks, Emanuel A. Schegloff, & Gail Jefferson (1978). A simplest systematics for the organization of turn taking for conversation. In Studies in the organization of conversational interaction (pp. 7--55).",
      "doi": ""
    },
    {
      "text": "Emanuel A. Schegloff. (1968). Sequencing in conversational openings. American anthropologist, 70(6), 1075--1095.",
      "doi": ""
    },
    {
      "text": "Georg Simmel. 2010. Conflict and the web of group affiliations. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Robert Soden and Leysia Palen. 2014. From Crowdsourced Mapping to Community Mapping: The Post-Earthquake Work of OpenStreetMap Haiti. In Proceedings of the Conference on the Design of Cooperative Systems (COOP '14), 311--326.",
      "doi": ""
    },
    {
      "text": "Kate Starbird. 2013. Delivering patients to sacré coeur: collective intelligence in digital volunteer communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '13). ACM, New York, NY, USA, 801810.  ",
      "doi": "10.1145/2470654.2470769"
    },
    {
      "text": "Kate Starbird and Leysia Palen. Pass it on?: Retweeting in mass emergency. In Proceedings of seventh international conference on Information System for Crisis Response and Managements (ISCRAM '2010).",
      "doi": ""
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2011. \"Voluntweeters\": self-organizing by digital volunteers in times of crisis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1071--1080.  ",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2013. Working and sustaining the virtual \"Disaster Desk\". In Proceedings of the ACM conference on Computer supported cooperative work (CSCW '13), 491--502.  ",
      "doi": "10.1145/2441776.2441832"
    },
    {
      "text": "Jeannette Sutton, Leysia Palen, & Irina Shklovski. 2008. Backchannels on the Front Lines: Emergent Use of Social Media in the 2007 Southern California Fires. Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM).",
      "doi": ""
    },
    {
      "text": "Ralph H. Turner. Rumor as Intensified Information Seeking; Earthquake Rumors in China and the United States, in Disasters, Collective Behavior and Social Organization, R.R. Dynes and K.J. Tierney, Editors. 1990, University of Delaware Press: Newark. p. 244256.",
      "doi": ""
    },
    {
      "text": "Sarah Vieweg, Leysia Palen, L. Sophia Liu, Amanda Hughes, & Jeannette Sutton 2008. Collective Intelligence in Disaster: An Examination of the Phenomenon in the Aftermath of the 2007 Virginia Tech Shootings. Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM).",
      "doi": ""
    },
    {
      "text": "Stanley Wasserman and Katherine Faust. 1994. Social Network Analysis: Methods and Applications. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Karl E. Weick. 1993. The collapse of sensemaking in organizations: The Mann Gulch disaster. In Administrative science quarterly, 628--652.",
      "doi": ""
    },
    {
      "text": "Karl E. Weick. 1995. Sensemaking in organizations (Vol. 3). Sage.",
      "doi": ""
    },
    {
      "text": "Joanne I. White, Leysia Palen, and Kenneth M. Anderson. 2014. Digital mobilization in disaster response: the work & self-organization of on-line pet advocates in response to hurricane sandy. In Proceedings of the ACM conference on Computer supported cooperative work & social computing (CSCW '14), 866--876.  ",
      "doi": "10.1145/2531602.2531633"
    },
    {
      "text": "Joanne I. White and Leysia Palen. 2015. Expertise in the Wired Wild West. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 662--675.  ",
      "doi": "10.1145/2675133.2675167"
    },
    {
      "text": "Sarita Yardi & Danah boyd. (2010). Dynamic debates: An analysis of group polarization over time on twitter. Bulletin of Science, Technology & Society, 30(5), 316--327.",
      "doi": ""
    },
    {
      "text": "Michelle Yonetani and Tim Morris. (2013). Global Estimates 2012: people displaced by disasters. IDMC",
      "doi": ""
    }
  ]
}