{
  "doi": "10.1145/3173574.3173696",
  "title": "Measuring Employment Demand Using Internet Search Data",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We are in a transitional economic period emphasizing automation of physical jobs and the shift towards intellectual labor. How can we measure and understand human behaviors of job search, and how communities are adapting to these changes? We use internet search data to estimate employment demand in the United States. Starting with 225 million raw job search queries in 2015 and 2016 from a popular search engine, we classify queries into one of 15 fields of employment with accuracy and F-1 of 97%, and use the resulting query volumes to estimate per-sector employment demand in U.S. counties. We validate against Bureau of Labor Statistics measures, and then demonstrate benefits for communities, showing significant differences in the types of jobs searched for across socio-economic dimensions like poverty and education level. We discuss implications for macroeconomic measurement, as well as how community leaders, policy makers, and the field of HCI can benefit.",
  "tags": [
    "big data",
    "internet search",
    "employment",
    "job search"
  ],
  "authors": [
    {
      "name": "Stevie Chancellor",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658724335",
      "orcid": "0000-0003-0620-0903"
    },
    {
      "name": "Scott Counts",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398596",
      "orcid": "0000-0003-1507-5200"
    }
  ],
  "references": [
    {
      "text": "Ali Alkhatib, Michael S Bernstein, and Margaret Levi. 2017. Examining crowd work and gig work through the historical lens of piecework. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4599--4616.  ",
      "doi": "10.1145/3025453.3025974"
    },
    {
      "text": "Nikolaos Askitas and Klaus F Zimmermann. 2009. Google econometrics and unemployment forecasting. Applied Economics Quarterly 55, 2 (2009), 107--120.",
      "doi": ""
    },
    {
      "text": "Sitaram Asur and Bernardo A Huberman. 2010. Predicting the future with social media. In Web Intelligence and Intelligent Agent Technology (WI-IAT), 2010 IEEE/WIC/ACM International Conference on, Vol. 1. IEEE, 492--499.  ",
      "doi": "10.1109/WI-IAT.2010.63"
    },
    {
      "text": "Scott R Baker and Andrey Fradkin. 2014. The Impact of Unemployment Insurance on Job Search: Evidence from Google Search Data. Review of Economics and Statistics (2014).",
      "doi": ""
    },
    {
      "text": "Anita Balakrishnan. 2017. Self-driving cars could cost America's professional drivers up to 25,000 jobs a month, Goldman Sachs says. (May 2017). https://www.cnbc.com/2017/05/22/ goldman-sachs-analysis-of-autonomous-vehicle-job-loss. html",
      "doi": ""
    },
    {
      "text": "Pierluigi Balduzzi, Edwin J Elton, and T Clifton Green. 2001. Economic news and bond prices: Evidence from the US Treasury market. Journal of financial and Quantitative analysis 36, 4 (2001), 523--543.",
      "doi": ""
    },
    {
      "text": "Benjamin B Bederson, Jonathan Lazar, Jeff Johnson, Harry Hochheiser, and Clare-Marie Karat. 2006. Workshop on SIGCHI public policy. In CHI'06 Extended Abstracts on Human Factors in Computing Systems. ACM, 1655--1657.  ",
      "doi": "10.1145/1125451.1125755"
    },
    {
      "text": "David M Blau and Philip K Robins. 1990. Job search outcomes for the employed and unemployed. Journal of Political Economy 98, 3 (1990), 637--655.",
      "doi": ""
    },
    {
      "text": "Joshua Evan Blumenstock. 2016. Fighting poverty with data. Science 353, 6301 (2016), 753--754.",
      "doi": ""
    },
    {
      "text": "Johan Bollen, Huina Mao, and Xiaojun Zeng. 2011. Twitter mood predicts the stock market. Journal of computational science 2, 1 (2011), 1--8.",
      "doi": ""
    },
    {
      "text": "Ilaria Bordino, Stefano Battiston, Guido Caldarelli, Matthieu Cristelli, Antti Ukkonen, and Ingmar Weber. 2012. Web search queries can predict stock market volumes. PloS one 7, 7 (2012), e40014.",
      "doi": ""
    },
    {
      "text": "Danah Boyd and Kate Crawford. 2012. Critical questions for big data: Provocations for a cultural, technological, and scholarly phenomenon. Information, communication & society 15, 5 (2012), 662--679.",
      "doi": ""
    },
    {
      "text": "Moira Burke and Robert Kraut. 2013. Using Facebook after losing a job: Differential benefits of strong and weak ties. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1419--1430.  ",
      "doi": "10.1145/2441776.2441936"
    },
    {
      "text": "Ronald S Burt. 2009. Structural holes: The social structure of competition. Harvard university press.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Yannis Kalantidis, Jessica A Pater, Munmun De Choudhury, and David A Shamma. 2017. Multimodal Classification of Moderated Online Pro-Eating Disorder Content. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3213--3226.  ",
      "doi": "10.1145/3025453.3025985"
    },
    {
      "text": "Hyunyoung Choi and Hal Varian. 2012. Predicting the present with Google Trends. Economic Record 88, s1 (2012), 2--9.",
      "doi": ""
    },
    {
      "text": "Frank Cowell. 2011. Measuring inequality. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Sean Culey. 2017. Revitalizing The Rust Belt. https://www.forbes.com/sites/realspin/2017/09/08/ revitalizing-the-rust-belt. (2017). {Online; accessed 18-September-2017}.",
      "doi": ""
    },
    {
      "text": "Aron Culotta. 2014. Estimating county health statistics with twitter. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1335--1344.  ",
      "doi": "10.1145/2556288.2557139"
    },
    {
      "text": "Francesco D'Amuri and Juri Marcucci. 2010. Google it!' Forecasting the US unemployment rate with a Google job search index. (2010).",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Meredith Ringel Morris, and Ryen W White. 2014. Seeking and sharing health information online: Comparing search engines and social media. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1365--1376.  ",
      "doi": "10.1145/2556288.2557214"
    },
    {
      "text": "Drew Desilver. 2017. Most Americans unaware that as U.S. manufacturing jobs have disappeared, output has grown. (July 2017). http://www.pewresearch.org/fact-tank/2017/07/25/ most-americans-unaware-that-as-u-s-manufacturing-jobs\\ -have-disappeared-output-has-grown/",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt, Nishan Bose, Suleman Diwan, and Asha Chen-Phang. 2016. Designing for disadvantaged job seekers: Insights from early investigations. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 905--910.  ",
      "doi": "10.1145/2901790.2901865"
    },
    {
      "text": "Tawanna R Dillahunt and Amelia R Malone. 2015. The promise of the sharing economy among disadvantaged communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2285--2294.  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Susan Dumais, Robin Jeffries, Daniel M Russell, Diane Tang, and Jaime Teevan. 2014. Understanding user behavior through log data and analysis. In Ways of Knowing in HCI. Springer, 349--372.",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison, Charles Steinfield, and Cliff Lampe. 2007. The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication 12, 4 (2007), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Michael Ettredge, John Gerdes, and Gilbert Karuga. 2005. Using web-based search data to predict macroeconomic statistics. Commun. ACM 48, 11 (2005), 87--92.  ",
      "doi": "10.1145/1096000.1096010"
    },
    {
      "text": "Jane E Ferrie, Martin J Shipley, Michael Gideon Marmot, Stephen Stansfeld, and George Davey Smith. 1995. Health effects of anticipation of job change and non-employment: longitudinal data from the Whitehall II study. Bmj 311, 7015 (1995), 1264--1269.",
      "doi": ""
    },
    {
      "text": "Adam Fourney, Ryen W White, and Eric Horvitz. 2015. Exploring time-dependent concerns about pregnancy and childbirth from search logs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 737--746.  ",
      "doi": "10.1145/2702123.2702427"
    },
    {
      "text": "Laura K Gee, Jason Jones, and Moira Burke. 2017. Social Networks and labor markets: How strong ties relate to job finding on Facebook's social network. Journal of Labor Economics 35, 2 (2017), 485--518.",
      "doi": ""
    },
    {
      "text": "Eric Gilbert and Karrie Karahalios. 2010. Widespread Worry and the Stock Market. In ICWSM. 59--65.",
      "doi": ""
    },
    {
      "text": "Jeremy Ginsberg, Matthew H Mohebbi, Rajan S Patel, Lynnette Brammer, Mark S Smolinski, and Larry Brilliant. 2009. Detecting influenza epidemics using search engine query data. Nature 457, 7232 (2009), 1012--1014.",
      "doi": ""
    },
    {
      "text": "Glassdoor. 2017. Statistical Reference for Recruiters: 50 HR and Recruiting Statistics for 2017. (2017). http://resources.glassdoor.com/rs/899-LOT-464/images/ 50hr-recruiting-and-statistics-2017.pdf",
      "doi": ""
    },
    {
      "text": "Sharad Goel, Jake M Hofman, Sébastien Lahaie, David M Pennock, and Duncan J Watts. 2010. Predicting consumer behavior with Web search. Proceedings of the National academy of sciences 107, 41 (2010), 17486--17490.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1978. The presentation of self in everyday life. Harmondsworth.",
      "doi": ""
    },
    {
      "text": "Mark Granovetter. 1995. Getting a job: A study of contacts and careers. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Mark S Granovetter. 1973. The strength of weak ties. American journal of sociology 78, 6 (1973), 1360--1380.",
      "doi": ""
    },
    {
      "text": "Anne E Green, Yuxin Li, David Owen, and Maria De Hoyos. 2012. Inequalities in use of the Internet for job search: similarities and contrasts by economic status in Great Britain. Environment and Planning 44, 10 (2012), 2344--2358.",
      "doi": ""
    },
    {
      "text": "Rodger W Griffeth, Peter W Hom, and Stefan Gaertner. 2000. A meta-analysis of antecedents and correlates of employee turnover: Update, moderator tests, and research implications for the next millennium. Journal of management 26, 3 (2000), 463--488.",
      "doi": ""
    },
    {
      "text": "Jamie Guillory and Jeffrey T Hancock. 2012. The effect of Linkedin on deception in resumes. Cyberpsychology, Behavior, and Social Networking 15, 3 (2012), 135--140.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Eden Litt. 2013. New strategies for employment? internet skills and online privacy practices during people's job search. IEEE security & privacy 11, 3 (2013), 38--45.  ",
      "doi": "10.1109/MSP.2013.64"
    },
    {
      "text": "Ahmed Hassan Awadallah, Ryen W White, Patrick Pantel, Susan T Dumais, and Yi-Min Wang. 2014. Supporting complex search tasks. In Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management. ACM, 829--838.  ",
      "doi": "10.1145/2661829.2661912"
    },
    {
      "text": "Edwin AJ Van Hooft, Marise Ph Born, Toon W Taris, Henk Van Der Flier, and Roland WB Blonk. 2004. Predictors of job search behavior among employed and unemployed people. Personnel Psychology 57, 1 (2004), 25--59.",
      "doi": ""
    },
    {
      "text": "Benjamin Jen, Jashanjit Kaur, Jonathan De Heus, and Tawanna R Dillahunt. 2014. Analyzing employment technologies for economically distressed individuals. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1945--1950.  ",
      "doi": "10.1145/2559206.2581290"
    },
    {
      "text": "Michael Kan. 2017. Laid-off IT workers worry US is losing tech jobs to outsourcing. (Mar 2017). https: //www.pcworld.com/article/3175682/techology-business/ laid-off-it-workers-worry-us-is-losing-tech-jobs-to-\\ outsourcing.html",
      "doi": ""
    },
    {
      "text": "Brian C Keegan, Patricia Cavazos-Rehg, Anh Ngoc Nguyen, Saiph Savage, Jofish Kaye, Munmun De Choudhury, and Michael J Paul. 2017. CHI-nnabis: Implications of Marijuana Legalization for and from Human-Computer Interaction. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1312--1317.  ",
      "doi": "10.1145/3027063.3051139"
    },
    {
      "text": "Jaewoo Kim, Meeyoung Cha, and Jong Gun Lee. 2017. Nowcasting commodity prices using social media. PeerJ Computer Science 3 (2017), e126.",
      "doi": ""
    },
    {
      "text": "Kory Kroft and Devin G Pope. 2014. Does online search crowd out traditional search and improve matching efficiency? Evidence from Craigslist. Journal of Labor Economics 32, 2 (2014), 259--303.",
      "doi": ""
    },
    {
      "text": "Peter Kuhn and Hani Mansour. 2014. Is Internet job search still ineffective? The Economic Journal 124, 581 (2014), 1213--1233.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar. 2015. Public policy and HCI: making an impact in the future. interactions 22, 5 (2015), 69--71.  ",
      "doi": "10.1145/2807916"
    },
    {
      "text": "Jonathan Lazar, Julio Abascal, Simone Barbosa, Jeremy Barksdale, Batya Friedman, Jens Grossklags, Jan Gulliksen, Jeff Johnson, Tom McEwan, Loïc Martínez-Normand, and others. 2016. Human--computer interaction and international public policymaking: a framework for understanding and taking future actions. Foundations and Trends® in Human--Computer Interaction 9, 2 (2016), 69--149.  ",
      "doi": "10.1561/1100000062"
    },
    {
      "text": "David Lazer, Ryan Kennedy, Gary King, and Alessandro Vespignani. 2014. The parable of Google Flu: traps in big data analysis. Science 343, 6176 (2014), 1203--1205.",
      "doi": ""
    },
    {
      "text": "David Lazer, Alex Sandy Pentland, Lada Adamic, Sinan Aral, Albert Laszlo Barabasi, Devon Brewer, Nicholas Christakis, Noshir Contractor, James Fowler, Myron Gutmann, and others. 2009. Life in the network: the coming age of computational social science. Science (New York, NY) 323, 5915 (2009), 721.",
      "doi": ""
    },
    {
      "text": "Colin Lindsay, Malcolm Greig, and Ronald W McQuaid. 2005. Alternative Job Search Strategies in Remote Rural and Peri-urban Labour Markets: The Role of Social Networks. Sociologia Ruralis 45, 1--2 (2005), 53--70.",
      "doi": ""
    },
    {
      "text": "Michael Luo. 2009. Job retraining may fall short of high hopes. The New York Times (2009).",
      "doi": ""
    },
    {
      "text": "Emil E Malizia and Shanzi Ke. 1993. The influence of economic diversity on unemployment and stability. Journal of Regional Science 33, 2 (1993), 221--235.",
      "doi": ""
    },
    {
      "text": "Huina Mao, Scott Counts, and Johan Bollen. 2011. Predicting financial markets: Comparing survey, news, twitter and search engine data. arXiv preprint arXiv:1112.1051 (2011).",
      "doi": ""
    },
    {
      "text": "Huina Mao, Scott Counts, and Johan Bollen. 2015. Quantifying the effects of online bullishness on international financial markets. Technical Report. ECB Statistics Paper.",
      "doi": ""
    },
    {
      "text": "Ralph Matthews, Ravi Pendakur, and Nathan Young. 2009. Social capital, labour markets, and job-finding in urban and rural regions: Comparing paths to employment in prosperous cities and stressed rural communities in Canada. The Sociological Review 57, 2 (2009), 306--330.",
      "doi": ""
    },
    {
      "text": "Ruth G McFadyen and Jonathan P Thomas. 1997. Economic and psychological models of job search behavior of the unemployed. Human Relations 50, 12 (1997), 1461--1484.",
      "doi": ""
    },
    {
      "text": "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems. 3111--3119. ",
      "doi": "10.5555/2999792.2999959"
    },
    {
      "text": "Meredith Ringel Morris, Jaime Teevan, and Katrina Panovich. 2010. A Comparison of Information Seeking Using Search Engines and Social Networks. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Bureau of Labor Statistics. 2010. Table B-1. Employees on nonfarm payrolls by industry sector and selected industry detail. https://www.bls.gov/news.release/empsit.t17.htm. (2010). {Online; accessed 17-September-2017}.",
      "doi": ""
    },
    {
      "text": "Bureau of Labor Statistics. 2017. Labor Force Statistics from the Current Population Survey. https://data.bls.gov/timeseries/LNS14000000. (2017). {Online; accessed 14-December-2017}.",
      "doi": ""
    },
    {
      "text": "Michael J Paul, Ryen W White, and Eric Horvitz. 2015. Diagnoses, decisions, and outcomes: Web search as decision support for cancer. In Proceedings of the 24th International Conference on World Wide Web. ACM, 831--841.  ",
      "doi": "10.1145/2736277.2741662"
    },
    {
      "text": "Michael J Paul, Ryen W White, and Eric Horvitz. 2016. Search and breast cancer: On episodic shifts of attention over life histories of an illness. ACM Transactions on the Web (TWEB) 10, 2 (2016), 13.  ",
      "doi": "10.1145/2893481"
    },
    {
      "text": "Jaroslav Pavlicek and Ladislav Kristoufek. 2015. Nowcasting unemployment rates with google searches: Evidence from the visegrad group countries. PloS one 10, 5 (2015), e0127084.",
      "doi": ""
    },
    {
      "text": "Tobias Preis, Helen Susannah Moat, and H Eugene Stanley. 2013. Quantifying trading behavior in financial markets using Google Trends. Scientific reports 3 (2013), srep01684.",
      "doi": ""
    },
    {
      "text": "Tobias Preis, Daniel Reith, and H Eugene Stanley. 2010. Complex dynamics of our economic life on different scales: insights from search engine query data. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 368, 1933 (2010), 5707--5719.",
      "doi": ""
    },
    {
      "text": "Aaron Smith. 2015. Searching for work in the digital era. Pew Research Center: Internet, Science & Tech., Article published on 19 (2015).",
      "doi": ""
    },
    {
      "text": "Marina Sokolova and Guy Lapalme. 2009. A systematic analysis of performance measures for classification tasks. Information Processing & Management 45, 4 (2009), 427--437.  ",
      "doi": "10.1016/j.ipm.2009.03.002"
    },
    {
      "text": "Linnet Taylor, Ralph Schroeder, and Eric Meyer. 2014. Emerging practices and perspectives on Big Data analysis in economics: Bigger and better or more of the same? Big Data & Society 1, 2 (2014), 2053951714536877.",
      "doi": ""
    },
    {
      "text": "Nathan Tefft. 2011. Insights on unemployment, unemployment insurance, and mental health. Journal of Health Economics 30, 2 (2011), 258--264.",
      "doi": ""
    },
    {
      "text": "Jacob Thebault-Spieker, Loren Terveen, and Brent Hecht. 2017. Toward a Geographic Understanding of the Sharing Economy: Systemic Biases in UberX and TaskRabbit. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 3 (2017), 21.  ",
      "doi": "10.1145/3058499"
    },
    {
      "text": "Sonja Utz. 2016. Is LinkedIn making you more successful? The informational benefits derived from public social media. new media & society 18, 11 (2016), 2685--2702.",
      "doi": ""
    },
    {
      "text": "Hal R Varian. 2014. Big data: New tricks for econometrics. The Journal of Economic Perspectives 28, 2 (2014), 3--27.",
      "doi": ""
    },
    {
      "text": "Tara Vishwanath. 1989. Job search, stigma effect, and escape rate from unemployment. Journal of Labor Economics 7, 4 (1989), 487--502.",
      "doi": ""
    },
    {
      "text": "Connie R Wanberg. 2012. The individual experience of unemployment. Annual review of psychology 63 (2012), 369--396.",
      "doi": ""
    },
    {
      "text": "Connie R Wanberg, Ruth Kanfer, and Joseph T Banas. 2000. Predictors and outcomes of networking intensity among unemployed job seekers. Journal of Applied Psychology 85, 4 (2000), 491.",
      "doi": ""
    },
    {
      "text": "Ryen W White and Resa A Roth. 2009. Exploratory search: Beyond the query-response paradigm. Synthesis lectures on information concepts, retrieval, and services 1, 1 (2009), 1--98.",
      "doi": "10.5555/1521589"
    },
    {
      "text": "Hans De Witte. 1999. Job insecurity and psychological well-being: Review of the literature and exploration of some unresolved issues. European Journal of work and Organizational psychology 8, 2 (1999), 155--177.",
      "doi": ""
    },
    {
      "text": "Diyi Yang, Zheng Yao, and Robert E Kraut. 2017. Self-Disclosure and Channel Difference in Online Health Support Groups.. In ICWSM. 704--707.",
      "doi": ""
    }
  ]
}