{
  "doi": "10.1145/3173574.3173726",
  "title": "Repurposing Emoji for Personalised Communication: Why 🍕 means “I love you”",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "The use of emoji in digital communication can convey a wealth of emotions and concepts that otherwise would take many words to express. Emoji have become a popular form of communication, with researchers claiming emoji represent a type of \"ubiquitous language\" that can span different languages. In this paper however, we explore how emoji are also used in highly personalised and purposefully secretive ways. We show that emoji are repurposed for something other than their \"intended\" use between close partners, family members and friends. We present the range of reasons why certain emoji get chosen, including the concept of \"emoji affordance\" and explore why repurposing occurs. Normally used for speed, some emoji are instead used to convey intimate and personal sentiments that, for many reasons, their users cannot express in words. We discuss how this form of repurposing must be considered in tasks such as emoji-based sentiment analysis.",
  "authors": [
    {
      "name": "Sarah Wiseman",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502788334",
      "orcid": "missing"
    },
    {
      "name": "Sandy J. J. Gould",
      "institution": "University of Birmingham, Birmingham, United Kingdom",
      "img": "/do/10.1145/contrib-81502713252/rel-imgonly/s.gould.large.jpg",
      "acmid": "81502713252",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hamdan Azhar. 2016. How We Really Use The Peach. Emojipedia. Retrieved from https://blog.emojipedia.org/how-we-really-use-thepeach/",
      "doi": ""
    },
    {
      "text": "Paul Baker. 2003. Polari-the lost language of gay men. Routledge.",
      "doi": ""
    },
    {
      "text": "Francesco Barbieri, German Kruszewski, Francesco Ronzano, and Horacio Saggion. 2016. How Cosmopolitan Are Emojis?: Exploring Emojis Usage and Meaning over Different Languages with Distributional Semantics. Proceedings of the 2016 ACM on Multimedia Conference, 531--535.  ",
      "doi": "10.1145/2964284.2967278"
    },
    {
      "text": "Edwin Chan, Teddy Seyed, Wolfgang Stuerzlinger, Xing-Dong Yang, and Frank Maurer. 2016. User Elicitation on Single-hand Microgestures. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 3403--3414.  ",
      "doi": "10.1145/2858036.2858589"
    },
    {
      "text": "Zhenpeng Chen, Xuan Lu, Sheng Shen, Wei Ai, Xuanzhe Liu, and Qiaozhu Mei. 2017. Through a Gender Lens: An Empirical Study of Emoji Usage over Large-Scale Android Users. 1--20. Retrieved from http://arxiv.org/abs/1705.05546",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-intended Functions of Emojis in US Messaging. Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services, 504-- 509.  ",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Maurizio Gotti. 1999. The language of thieves and vagabonds: 17th and 18th century canting lexicography in England. Walter de Gruyter.",
      "doi": ""
    },
    {
      "text": "Jialun \"Aaron\" Jiang, Jed R. Brubaker, and Casey Fiesler. 2017. Understanding Diverse Interpretations of Animated GIFs. CHI'17 Extended Abstracts, 1726--1732.  ",
      "doi": "10.1145/3027063.3053139"
    },
    {
      "text": "Ryan Kelly and Leon Watts. 2015. Characterising the Inventive Appropriation of Emoji as Relationally Meaningful in Mediated Close Personal Relationships. Experiences of Technology Appropriation: Unanticipated Users, Usage, Circumstances, and Design.",
      "doi": ""
    },
    {
      "text": "Brian Koerber. 2016. People are mad as hell after Apple ruins the peach emoji. Mashable. Retrieved from http://mashable.com/2016/11/01/peach-emojibutt-no-more/#y0IZqe3q7iqd",
      "doi": ""
    },
    {
      "text": "Xuan Lu, Wei Ai, Xuanzhe Liu, et al. 2016. Learning from the ubiquitous language. Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '16, ACM Press, 770--780.  ",
      "doi": "10.1145/2971648.2971724"
    },
    {
      "text": "Hannah Miller, Daniel Kluver, Jacob ThebaultSpieker, Loren Terveen, and Brent Hecht. 2017. Understanding Emoji Ambiguity in Context: The Role of Text in Emoji-Related Miscommunication. Proceedings of the Eleventh International AAAI Conference on Web and Social Media, 152--161. Retrieved from https://www.aaai.org/ocs/index.php/ICWSM/ICWS M17/paper/view/15703",
      "doi": ""
    },
    {
      "text": "Hannah Miller, Jacob Thebault-Spieker, Shuo Chang, Isaac Johnson, Loren Terveen, and Brent Hecht. 2016. \"Blissfully happy\" or \"ready to fight\": Varying Interpretations of Emoji. International AAAI Conference on Web and Social Media, Icwsm, 259--268.",
      "doi": ""
    },
    {
      "text": "Midas Nouwens, Carla Griggio, and Wendy E Mackay. 2017. \"WhatsApp is for family; Messenger is for friends\": Communication Places in App Ecosystems. CHI '17 - Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 727--735.  ",
      "doi": "10.1145/3025453.3025484"
    },
    {
      "text": "Oxford Dictionaries. 2015. Word of the Year 2015. Retrieved from https://en.oxforddictionaries.com/word-of-theyear/word-of-the-year-2015",
      "doi": ""
    },
    {
      "text": "Jaram Park, Vladimir Barash, Clay Fink, and Meeyoung Cha. 2013. Emoticon Style: Interpreting Differences in Emoticons Across Cultures. Proceedings of the 7th International AAAI Conference on Weblogs and Social Media (ICWSM), 466--475.",
      "doi": ""
    },
    {
      "text": "Ann Senghas, Sotaro Kita, and Asli Özyürek. 2004. Children Creating Core Properties of Language: Evidence from an Emerging Sign Language in Nicaragua. Science 305, 5691, 1779--1782.",
      "doi": ""
    },
    {
      "text": "Selina Sutton and Shaun Lawson. 2017. A Provocation for Rethinking and Democratising Emoji Design. Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems - DIS '17 Companion, ACM Press, 7--12.  ",
      "doi": "10.1145/3064857.3079109"
    },
    {
      "text": "Swiftkey. 2015. Swiftkey Emoji Report. Retrieved from http://www.scribd.com/doc/262594751/SwiftKeyEmoji-Report",
      "doi": ""
    },
    {
      "text": "K Thorpe, R Greenwood, a Eivers, and M Rutter. 2001. Prevalence and developmental course of \"secret language\". International journal of language & communication disorders / Royal College of Speech & Language Therapists 36, 1, 43--62.",
      "doi": ""
    },
    {
      "text": "Garreth W Tigwell and David R. Flatla. 2016. \" Oh that's what you meant?!\": Reducing Emoji Misunderstanding. Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16), 859--866. http://doi.org/2957265.2961844  ",
      "doi": "10.1145/2957265.2961844"
    },
    {
      "text": "Unicode Inc. 2017. Emoji and Pictographs. Retrieved from http://www.unicode.org/faq/emoji_dingbats.html",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther and Kyle P. D'Addario. 2001. The Impacts of Emoticons on Message Interpretation in Computer-Mediated Communication. Social Science Computer Review 19, 3, 324--347.",
      "doi": ""
    },
    {
      "text": "Sanjaya Wijeratne, Lakshika Balasuriya, Amit Sheth, and Derek Doran. 2017. EmojiNet: An Open Service and API for Emoji Sense Discovery. the 11Th International Aaai Conference on Web and Social Media (Icwsm-17), May, 437--446. Retrieved from https://www.aaai.org/ocs/index.php/ICWSM/ICWS M17/paper/view/15551",
      "doi": ""
    },
    {
      "text": "Sanjaya Wijeratne, Lakshika Balasuriya, Amit Sheth, and Derek Doran. 2017. A Semantics-Based Measure of Emoji Similarity.  ",
      "doi": "10.1145/3106426.3106490"
    }
  ]
}