{
  "doi": "10.1145/3173574.3173964",
  "title": "ChromaGlasses: Computational Glasses for Compensating Colour Blindness",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Prescription glasses are used by many people as a simple, and even fashionable way, to correct refractive problems of the eye. However, there are other visual impairments that cannot be treated with an optical lens in conventional glasses. In this work we present ChromaGlasses, Computational Glasses using optical head-mounted displays for compensating colour vision deficiency. Unlike prior work that required users to look at a screen in their visual periphery rather than at the environment directly, ChromaGlasses allow users to directly see the environment using a novel head-mounted displays design that analyzes the environment in real-time and changes the appearance of the environment with pixel precision to compensate the impairment of the user. In this work, we present first prototypes for ChromaGlasses and report on the results from several studies showing that ChromaGlasses are an effective method for managing colour blindness.",
  "authors": [
    {
      "name": "Tobias Langlotz",
      "institution": "University of Otago, Dunedin, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100355442",
      "orcid": "0000-0003-1275-2026"
    },
    {
      "name": "Jonathan Sutton",
      "institution": "University of Otago, Dunedin, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363600306",
      "orcid": "0000-0002-3072-7185"
    },
    {
      "name": "Stefanie Zollmann",
      "institution": "University of Otago, Dunedin, New Zealand",
      "img": "/do/10.1145/contrib-81100198962/rel-imgonly/dsc02962_2.jpeg",
      "acmid": "81100198962",
      "orcid": "missing"
    },
    {
      "name": "Yuta Itoh",
      "institution": "Tokyo Institute of Technology, RIKEN, & Keio University, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704030",
      "orcid": "missing"
    },
    {
      "name": "Holger Regenbrecht",
      "institution": "University of Otago, Dunedin, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100024078",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cagri Ates, Alexander Fiannaca, and Eelke Folmer. 2015. Immersive simulation of visual impairments using a wearable see-through display. TEI 2015 - Proceedings of the 9th International Conference on Tangible, Embedded, and Embodied Interaction (2015), 225--228.  ",
      "doi": "10.1145/2677199.2680551"
    },
    {
      "text": "Michael Bajura, Henry Fuchs, and Ryutarou Ohbuchi. 1992. Merging Virtual Objects with the Real World: Seeing Ultrasound Imagery Within the Patient. In Proceedings of the 19th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '92). ACM, New York, NY, USA, 203--210.  ",
      "doi": "10.1145/133994.134061"
    },
    {
      "text": "Jennifer Birch. 1973. Dichromatic convergence points obtained by subtractive colour matching. Vision Research 13, 9 (1973), 1755 -- 1765.",
      "doi": ""
    },
    {
      "text": "Hans Brettel, Françoise Viénot, and John D. Mollon. 1997. Computerized simulation of color appearance for dichromats. J. Opt. Soc. Am. A 14, 10 (Oct 1997), 2647--2655.",
      "doi": ""
    },
    {
      "text": "Andreas Bulling and Kai Kunze. 2016. Eyewear Computers for Human-computer Interaction. interactions 23, 3 (April 2016), 70--73.  ",
      "doi": "10.1145/2912886"
    },
    {
      "text": "Marta G. Carcedo, Soon Hau Chua, Simon Perrault, Paweł Wozniak, Raj Joshi, Mohammad Obaid, Morten Fjeld, and Shengdong Zhao. 2016. HaptiColor: Interpolating Color Information as Haptic Feedback to Assist the Colorblind. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16 (2016), 3572--3583.  ",
      "doi": "10.1145/2858036.2858220"
    },
    {
      "text": "S Hau Chua, Haimo Zhang, and Muhammad Hammad. 2015. ColorBless: Augmenting Visual Information for Colorblind People with Binocular Luster Effect. ACM Transactions on ... 21, 6 (2015), 1--20.  ",
      "doi": "10.1145/2687923"
    },
    {
      "text": "Steven Feiner, Blair MacIntyre, Tobias Höllerer, and Anthony Webster. 1997. A touring machine: Prototyping 3D mobile augmented reality systems for exploring the urban environment. Personal Technologies 1, 4 (dec 1997), 208--217.",
      "doi": ""
    },
    {
      "text": "D. R. Pilbeam G. A. Harrison, J. M. Tanner and P. T. Baker. 1988. Human Biology An Introduction to Human Evolution, Variation, Growth and Adaptability. OUP Higher Education Division.",
      "doi": ""
    },
    {
      "text": "Yakup Genc, Mihran Tuceryan, and Nassir Navab. 2002. Practical Solutions for Calibration of Optical See-Through Devices. In Proceedings of the 1st International Symposium on Mixed and Augmented Reality (ISMAR '02). IEEE Computer Society, Washington, DC, USA, 169--. http://dl.acm.org/citation.cfm?id=850976.854985 ",
      "doi": "10.5555/850976.854985"
    },
    {
      "text": "J. Grubert, T. Langlotz, S. Zollmann, and H. Regenbrecht. 2017. Towards Pervasive Augmented Reality: Context-Awareness in Augmented Reality. IEEE Transactions on Visualization and Computer Graphics 23, 6 (June 2017), 1706--1724.  ",
      "doi": "10.1109/TVCG.2016.2543720"
    },
    {
      "text": "Chun-Rong Huang, Kuo-Chuan Chiu, and Chu-Song Chen. 2010. Key Color Priority Based Image Recoloring for Dichromats. In Proceedings of the Advances in Multimedia Information Processing, and 11th Pacific Rim Conference on Multimedia: Part II (PCM'10). Springer-Verlag, Berlin, Heidelberg, 637--647. http://dl.acm.org/citation.cfm?id=1894049.1894111 ",
      "doi": "10.5555/1894049.1894111"
    },
    {
      "text": "S. Ishihara. 1917. Tests for color-blindness. Handaya, Tokyo, Hongo Harukicho, Japan.",
      "doi": ""
    },
    {
      "text": "Yuta Itoh and Gudrun Klinker. 2014. Interaction-free calibration for optical see-through head-mounted displays based on 3D Eye localization. In 3D User Interfaces (3DUI), 2014 IEEE Symposium on. 75--82.",
      "doi": ""
    },
    {
      "text": "Yuta Itoh and Gudrun Klinker. 2015. Vision enhancement: defocus correction via optical see-through head-mounted displays. In Proceedings of the 6th Augmented Human International Conference. ACM, 1--8.  ",
      "doi": "10.1145/2735711.2735787"
    },
    {
      "text": "Luke Jefferson and Richard Harvey. 2006. Accommodating color blind computer users. Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility Assets 06 (2006), 40--47.  ",
      "doi": "10.1145/1168987.1168996"
    },
    {
      "text": "Luke Jefferson and Richard Harvey. 2007. An interface to support color blind computer users. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 1535.  ",
      "doi": "10.1145/1240624.1240855"
    },
    {
      "text": "G. Kramida. 2016. Resolving the Vergence-Accommodation Conflict in Head-Mounted Displays. IEEE Transactions on Visualization and Computer Graphics 22, 7 (July 2016), 1912--1931.",
      "doi": "10.1109/TVCG.2015.2473855"
    },
    {
      "text": "Giovane R. Kuhn, Manuel M. Oliveira, and L. A F Fernandes. 2008. An efficient naturalness-preserving image-recoloring method for dichromats. IEEE Transactions on Visualization and Computer Graphics 14, 6 (2008), 1747--1754.  ",
      "doi": "10.1109/TVCG.2008.112"
    },
    {
      "text": "Tobias Langlotz, Matthew Cook, and Holger Regenbrecht. 2016. Real-Time Radiometric Compensation for Optical See-Through Head-Mounted Displays. IEEE Transactions on Visualization and Computer Graphics 22, 11 (nov 2016), 2385--2394.",
      "doi": "10.1109/TVCG.2016.2593781"
    },
    {
      "text": "Tobias Langlotz, Thanh Nguyen, Dieter Schmalstieg, and Raphael Grasset. 2014. Next-Generation Augmented Reality Browsers: Rich, Seamless, and Adaptive. Proc. IEEE 102, 2 (feb 2014), 155--169.",
      "doi": ""
    },
    {
      "text": "Gustavo M. Machado and Manuel M. Oliveira. 2010. Real-Time Temporal-Coherent Color Contrast Enhancement for Dichromats. Computer Graphics Forum 29, 3 (aug 2010), 933--942.",
      "doi": "10.1111/j.1467-8659.2009.01701.x"
    },
    {
      "text": "G M Machado, M M Oliveira, and L A F Fernandes. 2010. A Physiologically-Based Model for Simulation of Color Vision Deficiency (vol 15, pg 1291, 2009). Ieee Transactions on Visualization and Computer Graphics 16, 2 (2010), 352.  ",
      "doi": "10.1109/TVCG.2010.10"
    },
    {
      "text": "Andrew Maimone and Henry Fuchs. 2013. Computational augmented reality eyeglasses. In 2013 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 29--38.",
      "doi": ""
    },
    {
      "text": "G.W. Meyer and D.P. Greenberg. 1988. Color-defective vision and computer graphics displays. IEEE Computer Graphics and Applications 8, 5 (sep 1988), 28--40.  ",
      "doi": "10.1109/38.7759"
    },
    {
      "text": "W. E. K. Middleton. 1957. Vision through the Atmosphere. Springer Berlin Heidelberg, Berlin, Heidelberg, 254--287.",
      "doi": ""
    },
    {
      "text": "E Peli. 2001. Vision multiplexing: an engineering approach to vision rehabilitation device development. Optometry and vision science : official publication of the American Academy of Optometry 78, 5 (may 2001), 304--15. http://www.ncbi.nlm.nih.gov/pubmed/11384008",
      "doi": ""
    },
    {
      "text": "Eli Peli, Gang Luo, Alex Bowers, and Noa Rensing. 2007. Applications of Augmented Vision Head-Mounted Systems in Vision Rehabilitation. Journal of the Society for Information Display 15, 12 (2007), 1037--1045.",
      "doi": ""
    },
    {
      "text": "Alexander Plopski, Yuta Itoh, Christian Nitschke, Kiyoshi Kiyokawa, Gudrun Klinker, and Haruo Takemura. 2015. Corneal-Imaging Calibration for Optical See-Through Head-Mounted Displays. IEEE Transactions on Visualization and Computer Graphics (Proceedings Virtual Reality 2015) 21, 4 (April 2015), 481--490.",
      "doi": "10.1109/TVCG.2015.2391857"
    },
    {
      "text": "B. Sajadi, A. Majumder, M. M. Oliveira, R. G. Schneider, and R. Raskar. 2013. Using Patterns to Encode Color Information for Dichromats. IEEE Transactions on Visualization and Computer Graphics 19, 1 (jan 2013), 118--129.  ",
      "doi": "10.1109/TVCG.2012.93"
    },
    {
      "text": "Simon Schmitt, Stefan Stein, Felix Hampe, and Dietrich Paulus. 2012. Mobile services supporting color vision deficiency. Proceedings of the International Conference on Optimisation of Electrical and Electronic Equipment, OPTIM (2012), 1413--1420.",
      "doi": ""
    },
    {
      "text": "Wuyao Shen, Xiangyu Mao, Xinghong Hu, and Tien-Tsin Wong. 2016. Seamless visual sharing with color vision deficiencies. ACM Transactions on Graphics 35, 4 (jul 2016), 1--12.  ",
      "doi": "10.1145/2897824.2925878"
    },
    {
      "text": "Ivan E. Sutherland. 1968. A head-mounted three dimensional display. In Proceedings of the December 9--11, 1968, fall joint computer conference, part I on AFIPS '68 (Fall, part I). ACM Press, New York, New York, USA, 757. http://dl.acm.org/citation.cfm?id=1476589.1476686  ",
      "doi": "10.1145/1476589.1476686"
    },
    {
      "text": "Enrico Tanuwidjaja, Derek Huynh, Kirsten Koa, Calvin Nguyen, Churen Shao, Patrick Torbett, Colleen Emmenegger, and Nadir Weibel. 2014. Chroma: AWearable Augmented-Reality Solution for Color Blindness. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '14 Adjunct (2014), 799--810.  ",
      "doi": "10.1145/2632048.2632091"
    },
    {
      "text": "Françoise Viénot, Hans Brettel, and John D. Mollon. 1999. Digital video colourmaps for checking the legibility of displays by dichromats. Color Research & Application 24, 4 (1999), 243--252.",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Michele Hu, Shafeka Hashash, and Shiri Azenkot. 2017. Understanding Low Vision People's Visual Perception on Commercial Augmented Reality Glasses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4170--4181.  ",
      "doi": "10.1145/3025453.3025949"
    },
    {
      "text": "Yuhang Zhao, Sarit Szpiro, Jonathan Knighten, and Shiri Azenkot. 2016. CueSee. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '16. ACM Press, New York, New York, USA, 73--84.",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Cornell Tech, Cornell Tech, Sarit Szpiro, Shiri Azenkot, Cornell Tech, Cornell Tech, Sarit Szpiro, and Shiri Azenkot. 2015. ForeSee : A Customizable Head-Mounted Vision Enhancement System for People with Low Vision. ASSETS '15 The 17th International ACM SIGACCESS Conference on Computers and Accessibility (2015), 239--249.  ",
      "doi": "10.1145/2700648.2809865"
    },
    {
      "text": "Stefanie Zollmann, Raphael Grasset, Gerhard Reitmayr, and Tobias Langlotz. 2014. Image-based X-ray Visualization Techniques for Spatial Understanding in Outdoor Augmented Reality. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, New York, NY, USA, 194--203.  ",
      "doi": "10.1145/2686612.2686642"
    }
  ]
}