{
  "doi": "10.1145/3173574.3173712",
  "title": "Towards Design Principles for Visual Analytics in Operations Contexts",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-7",
  "year": 2018,
  "badges": [],
  "abstract": "Operations engineering teams interact with complex data systems to make technical decisions that ensure the operational efficacy of their missions. To support these decision-making tasks, which may require elastic prioritization of goals dependent on changing conditions, custom analytics tools are often developed. We were asked to develop such a tool by a team at the NASA Jet Propulsion Laboratory, where rover telecom operators make decisions based on models predicting how much data rovers can transfer from the surface of Mars. Through research, design, implementation, and informal evaluation of our new tool, we developed principles to inform the design of visual analytics systems in operations contexts. We offer these principles as a step towards understanding the complex task of designing these systems. The principles we present are applicable to designers and developers tasked with building analytics systems in domains that face complex operations challenges such as scheduling, routing, and logistics.",
  "tags": [
    "operations",
    "visual design",
    "design principles",
    "theory",
    "information seeking & search",
    "contextual inquiry",
    "visualization",
    "qualitative methods",
    "design research methods"
  ],
  "authors": [
    {
      "name": "Matthew Conlen",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261907",
      "orcid": "missing"
    },
    {
      "name": "Sara Stalla",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260862",
      "orcid": "missing"
    },
    {
      "name": "Chelly Jin",
      "institution": "University of California, Los Angeles, Los Angeles, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261470",
      "orcid": "missing"
    },
    {
      "name": "Maggie Hendrie",
      "institution": "ArtCenter College of Design, Pasadena, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261714",
      "orcid": "missing"
    },
    {
      "name": "Hillary Mushkin",
      "institution": "California Institute of Technology, Pasadena, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261572",
      "orcid": "missing"
    },
    {
      "name": "Santiago Lombeyda",
      "institution": "California Institute of Technology, Pasadena, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100477510",
      "orcid": "missing"
    },
    {
      "name": "Scott Davidoff",
      "institution": "NASA Jet Propulsion Laboratory, Pasadena, CA, USA",
      "img": "/do/10.1145/contrib-81100010147/rel-imgonly/davidoff-portrait-square.low-res.jpg",
      "acmid": "81100010147",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1998. Contextual Design: Defining Customer-centered Systems. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "B. Broeksema, T. Baudel, A. Telea, and P. Crisafulli. 2013. Decision Exploration Lab: A Visual Analytics Solution for Decision Management. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec 2013), 1972--1981.  ",
      "doi": "10.1109/TVCG.2013.146"
    },
    {
      "text": "Stuart K Card and Jock Mackinlay. 1997. The structure of the information visualization design space. In Information Visualization, 1997. Proceedings., IEEE Symposium on. IEEE, 92--99. ",
      "doi": "10.5555/857188.857632"
    },
    {
      "text": "Stuart K. Card, Jock D. Mackinlay, and Ben Shneiderman (Eds.). 1999. Readings in Information Visualization: Using Vision to Think. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Charles Yiu, John Zimmerman, and Anind K. Dey. 2006. Principles of Smart Home Control. In Proceedings of the 8th International Conference on Ubiquitous Computing (UbiComp'06). Springer-Verlag, Berlin, Heidelberg, 19--34.  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "JoAnn T. Hackos and Janice C. Redish. 1998. User and Task Analysis for Interface Design. John Wiley & Sons, Inc., New York, NY, USA. ",
      "doi": "10.5555/272962"
    },
    {
      "text": "Eric Horvitz. 1999. Principles of Mixed-initiative User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 159--166.  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "A. Malik, R. Maciejewski, B. Maule, and D. S. Ebert. 2011. A visual analytics process for maritime resource allocation and risk assessment. In 2011 IEEE Conference on Visual Analytics Science & Technology (VAST). 221--230.",
      "doi": ""
    },
    {
      "text": "Marc Rettig. 1994. Prototyping for Tiny Fingers. Commun. ACM 37, 4 (April 1994), 21--27.  ",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "Adam Rule and Jodi Forlizzi. 2012. Designing interfaces for multi-user, multi-robot systems. In Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction. ACM, 97--104.  ",
      "doi": "10.1145/2157689.2157705"
    },
    {
      "text": "B. Shneiderman. 1996. The eyes have it: a task by data type taxonomy for information visualizations. In Proceedings 1996 IEEE Symposium on Visual Languages. 336--343. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "B. Tomaszewski and A. M. MacEachren. 2010. Geo-historical context support for information foraging and sensemaking: Conceptual model, implementation, and assessment. In 2010 IEEE Symposium on Visual Analytics Science & Technology. 139--146.",
      "doi": ""
    },
    {
      "text": "Brian Tomaszewski and Alan M MacEachren. 2012. Geovisual analytics to support crisis management: Information foraging for geo-historical context. Information Visualization 11, 4 (2012), 339--359.  ",
      "doi": "10.1177/1473871612456122"
    },
    {
      "text": "Edward R Tufte. 1990. Envisioning information. Graphics press. ",
      "doi": "10.5555/78223"
    },
    {
      "text": "Romain Vuillemot and Jeremy Boy. 2017. Structuring Visualization Mock-ups at the Graphical Level by Dividing the Display Space. IEEE transactions on visualization and computer graphics (2017).",
      "doi": ""
    },
    {
      "text": "X. Wang, W. Dou, T. Butkiewicz, E. A. Bier, and W. Ribarsky. 2011. A two-stage framework for designing visual analytics system in organizational environments. In 2011 IEEE Conference on Visual Analytics Science & Technology (VAST). 251--260.",
      "doi": ""
    },
    {
      "text": "P. Xu, H. Mei, L. Ren, and W. Chen. 2017. ViDX: Visual Diagnostics of Assembly Line Performance in Smart Factories. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan 2017), 291--300.  ",
      "doi": "10.1109/TVCG.2016.2598664"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design As a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}