{
  "doi": "10.1145/3173574.3173883",
  "title": "Family Health Promotion in Low-SES Neighborhoods: A Two-Month Study of Wearable Activity Tracking",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Low-socioeconomic status (SES) families face increased barriers to physical activity (PA)-a behavior critical for reducing and preventing chronic disease. Research has explored how wearable PA trackers can encourage increased activity, and how the adoption of such trackers is driven by people's emotions and social needs. However, more work is needed to understand how PA trackers are perceived and adopted by low-SES families, where PA may be deprioritized due to economic stresses, limited resources, and perceived crime. Accordingly, we conducted a two-month, in-depth qualitative study, exploring low-SES caregivers' perspectives on PA tracking and promotion. Our findings show how PA tracking was impacted by caregivers' attitudes toward safety, which were influenced by how they perceived social connections within their neighborhoods; and cognitive-emotional processes. We conclude that PA tracking tools for low-SES families should help caregivers and children to experience and celebrate progress.",
  "tags": [
    "personal health informatics",
    "self-monitoring",
    "wearables",
    "low-socioeconomic status",
    "crime",
    "neighborhoods",
    "family",
    "places",
    "physical activity trackers",
    "caregivers"
  ],
  "authors": [
    {
      "name": "Herman Saksono",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/do/10.1145/contrib-99658691732/rel-imgonly/saksono_herman-indeximage.jpg",
      "acmid": "99658691732",
      "orcid": "missing"
    },
    {
      "name": "Carmen Castaneda-Sceppa",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658689022",
      "orcid": "missing"
    },
    {
      "name": "Jessica Hoffman",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658690513",
      "orcid": "missing"
    },
    {
      "name": "Magy Seif El-Nasr",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502694399",
      "orcid": "0000-0002-7808-1686"
    },
    {
      "name": "Vivien Morris",
      "institution": "Mattapan Food and Fitness Coalition, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260426",
      "orcid": "missing"
    },
    {
      "name": "Andrea G. Parker",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556858356",
      "orcid": "0000-0002-2362-7717"
    }
  ],
  "references": [
    {
      "text": "Lyn Y Abramson, Martin E P Seligman, and John D Teasdale. 1978. Learned helplessness in humans and reformulation. Journal of abnormal psychology 87, 1: 49--74.",
      "doi": ""
    },
    {
      "text": "Eric P S Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI 2015, 585--594.  ",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Michael L. Booth, Neville Owen, Adrian Bauman, Ornella Clavisi, and Eva Leslie. 2000. Social--Cognitive and Perceived Environment Influences Associated with Physical Activity in Older Australians. Preventive Medicine 31, 1: 15--22.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention (CDC). 1999. Neighborhood safety and the prevalence of physical inactivity--selected states, 1996. Morbidity and Mortality Weekly Report (MMWR) 48, 7: 143--146.",
      "doi": ""
    },
    {
      "text": "B. M. Chaudry, K. H. Connelly, K. A. Siek, and J. L. Welch. 2012. Mobile interface design for low-literacy populations. 2nd ACM SIGHIT International Health Informatics Symposium: 91--100.  ",
      "doi": "10.1145/2110363.2110377"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding Self-Reflection: How People Reflect on Personal Data Through Visual Data Exploration. Proc. EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '17).  ",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Kerry S Courneya and Edward Mcauley. 1993. Predicting Physical Activity From Intention: Conceptual and Methodological Issues. Journal of Sport & Exercise Psychology 15: 50--63.",
      "doi": ""
    },
    {
      "text": "Catherine D'Ignazio. 2005. Creative data literacy Bridging the gap between the data-haves and data-have nots Information. Information Design Journal 23, 1: 6--",
      "doi": ""
    },
    {
      "text": "Kristen Day. 2006. Active Living and Social Justice. Journal of American Planning Association.",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt and Amelia R. Malone. 2015. The Promise of the Sharing Economy among Disadvantaged Communities. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15: 2285--2294.  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "1Paul Dourish. 2006. Re-Space-ing Place?: \"Place\" and \"Space\" Ten Years On. Computing: 299--308.  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Chris Elsden, David S Kirk, and Abigail C Durrant. 2015. A Quantified Past: Toward Design for Remembering With Personal Informatics. Human-Computer Interaction 24, June: 1--40.  ",
      "doi": "10.1080/07370024.2015.1093422"
    },
    {
      "text": "Daniel A Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A Munson. 2016. Beyond Abandonment to Next Steps: Understanding and Designing for Life after Personal Informatics Tool Use. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems: 1109--11  ",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Kelly R. Evenson, Michelle M. Goto, and Robert D. Furberg. 2015. Systematic review of the validity and reliability of consumer-wearable activity trackers. International Journal of Behavioral Nutrition and Physical Activity 12, 1: 159.",
      "doi": ""
    },
    {
      "text": "I. Ferreira, K. Van Der Horst, W. Wendel-Vos, S. Kremers, F. J. Van Lenthe, and J. Brug. 2007. Environmental correlates of physical activity in youth - A review and update. Obesity Reviews 8, 2: 129--154.",
      "doi": ""
    },
    {
      "text": "Sandra Graham. 1991. A Review of Attribution Theory in Achievement Contexts. Educational Psychology Review 3, 1: 5--39.",
      "doi": ""
    },
    {
      "text": "Kenneth J Gruber and Lauren A Haldeman. 2009. Using the family to combat childhood and adult obesity. Preventing Chronic Disease 6, 3: A106.",
      "doi": ""
    },
    {
      "text": "Sabrina L Gustafson and Ryan E Rhodes. 2006. Parental correlates of physical activity in children and early adolescents. Sports Medicine 36, 1: 79--97.",
      "doi": ""
    },
    {
      "text": "N Humpel. 2002. Environmental factors associated with adults' participation in physical activity A review. American Journal of Preventive Medicine 22, 3: 188--199.",
      "doi": ""
    },
    {
      "text": "Lee Humphreys. 2010. Mobile social networks and urban public space. New Media & Society 12, 5: 763--778.",
      "doi": ""
    },
    {
      "text": "2Stephen Kimani, Shlomo Berkovsky, Greg Smith, Jill Freyne, Nilufar Baghaei, and Dipak Bhandari. 2010. Activity awareness in family-based healthy living online social networks. Proceedings of the 15th international conference on Intelligent user interfaces - IUI '10: 337.  ",
      "doi": "10.1145/1719970.1720025"
    },
    {
      "text": "2Abby C. King, Cynthia Castro, Sara Wilcox, Amy A. Eyler, James F. Sallis, and Ross C. Brownson. 2000. Personal and environmental factors associated with physical inactivity among different racial--ethnic groups of U.S. middle-aged and older-aged women. Health Psychology 19, 4: 354--364.",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. Proceedings of the 2011 Annual Conference on Human Factors in Computing Systems - CHI '11: 3063.  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Shiriki Kumanyika and Sonya Grier. 2006. Targeting interventions for ethnic minority and low-income populations. The Future of children / Center for the Future of Children, the David and Lucile Packard Foundation 16, 1: 187--207. Retrieved from http://www.ncbi.nlm.nih.gov/pubmed/16532664",
      "doi": ""
    },
    {
      "text": "James J Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B Strub. 2006. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game. In Ubicomp 2006, 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Lyn H. Lofland. 1998. The Public Realm: Exploring the City's Quintessential Social Territory. Aldine de Gruyter, New York.",
      "doi": ""
    },
    {
      "text": "Stine Lomborg and Kirsten Frandsen. 2016. Self-tracking as communication. Information, Communication & Society 19, 7: 1015--10",
      "doi": ""
    },
    {
      "text": "Ben Lyall and Brady Robards. 2017. Tool, toy and tutor: Subjective experiences of digital self-tracking. Journal of Sociology: 144078331772285.",
      "doi": ""
    },
    {
      "text": "Charles P. Martin-Krumm, Philippe G. Sarrazin, Christopher Peterson, and J. P Jean Pierre Famose. 2003. Explanatory style and resilience after sports failure. Personality and Individual Differences 35, 7: 1685--1695.",
      "doi": ""
    },
    {
      "text": "E McAuley and B Blissmer. 2000. Self-efficacy determinants and consequences of physical activity. Exercise and sport sciences reviews 28, May: 85--88. https://doi.org/0091--6631/2802/85--88",
      "doi": ""
    },
    {
      "text": "3Edward McAuley and Terry E Duncan. 1989. Causal attributions and affective reactions to disconfirming outcomes in motor performance. Journal of Sport & Exercise Psychology 11, 2: 187--200.",
      "doi": ""
    },
    {
      "text": "3Edward McAuley, Dan Russell, and John B. Gross. 1983. Affective consequences of winning and losing: An attributional analysis. Journal of Sport Psychology 5, 3: 278--287.",
      "doi": ""
    },
    {
      "text": "3Alison M McMinn, Esther Mf van Sluijs, Nicholas C Harvey, Cyrus Cooper, Hazel M Inskip, Keith M Godfrey, and Simon J Griffin. 2009. Validation of a maternal questionnaire on correlates of physical activity in preschool children. International Journal of Behavioral Nutrition and Physical Activity 6: 81.",
      "doi": ""
    },
    {
      "text": "Rebecca Ann Meriwether, Pamela M McMahon, Nahid Islam, and William C Steinmann. 2006. Physical activity assessment: Validation of a Clinical Assessment Tool. American Journal of Preventive Medicine 31, 6: 484--91.",
      "doi": ""
    },
    {
      "text": "Florian Mueller and Katherine Isbister. 2014. Movement-based game guidelines. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14: 2191--2200.  ",
      "doi": "10.1145/2556288.2557163"
    },
    {
      "text": "Cynthia L. Ogden, Margaret D. Carroll, Brian K. Kit, and Katherine M. Flegal. 2014. Prevalence of Childhood and Adult Obesity in the United States, 2011--2012. JAMA: The Journal of the American Medical Association 311, 8: 806.",
      "doi": ""
    },
    {
      "text": "3Jacquelynne Eccles Parsons, Terry F Adler, and Caroline M Kaczala. 1982. Socialization of Achievement Attitudes and Beliefs: Classroom Influences. Child Development 53, 2: 322--339.",
      "doi": ""
    },
    {
      "text": "3K. Patrick, J. F. Sallis, B. Long, K. J. Calfas, W. Wooten, G. Heath, and M. Pratt. 1994. A new tool for encouraging activity: Project PACE. Physician and Sportsmedicine, 45--46+48.",
      "doi": ""
    },
    {
      "text": "3Laura R Pina, Sang-Wha Sien, Teresa Ward, Jason C Yip, Sean A Munson, James Fogarty, and Julie A Kientz. From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring.  ",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "J J Reilly and J Kelly. 2011. Long-term impact of overweight and obesity in childhood and adolescence on morbidity and premature mortality in adulthood: systematic review. International journal of obesity 35, July 2010: 891--898.",
      "doi": ""
    },
    {
      "text": "4John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14: 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "4Herman Saksono and Andrea Grimes Parker. 2017. Reflective Informatics Through Family Storytelling: Self-discovering Physical Activity Predictors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 5232--5244.  ",
      "doi": "10.1145/3025453.3025651"
    },
    {
      "text": "4Herman Saksono, Ashwini Ranade, Geeta Kamarthi, Carmen Castaneda-Sceppa, Jessica A. Hoffman, Cathy Wirth, Andrea G. Parker, Huntington Ave Boston, and Huntington Ave Boston. 2015. Spaceship Launch: Designing a Collaborative Exergame for Families. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1776--1787.  ",
      "doi": "10.1145/2675133.2675159"
    },
    {
      "text": "4James F Sallis, Judith J Prochaska, and Wendell C Taylor. 2000. A review of correlates of physical activity of children and adolescents. Medicine & Science in Sports & Exercise 32, 5: 963--975.",
      "doi": ""
    },
    {
      "text": "4Chris Schaefbauer, Danish Kahn, Amy Le, Garrett Sczechowski, and Katie Siek. 2015. Snack Buddy: Supporting Healthy Snacking in Low Socioeconomic Status Families. Cscw 2015: 1045--1057.  ",
      "doi": "10.1145/2675133.2675180"
    },
    {
      "text": "4US Department of Health and Human Services. 2008. 2008 Physical Activity Guidelines for Americans. Retrieved from https://health.gov/PAGuidelines/",
      "doi": ""
    },
    {
      "text": "4Gopal K. Singh, Mohammad Siahpush, and Michael D. Kogan. 2010. Rising Social Inequalities in US Childhood Obesity, 2003--2007. Annals of Epidemiology 20, 1: 40--52.",
      "doi": ""
    },
    {
      "text": "4Kiley Sobel, Arpita Bhattacharya, Alexis Hiniker, Jin H. Lee, Julie A. Kiemtz, and Jason C. Yip. 2017. \"It wasn't really about the Pokémon\": Parents' Perspectives on a Location-Based Mobile Game. Proceedings of the 35th international conference on Human factors in computing systems - CHI '17: In press.  ",
      "doi": "10.1145/3025453.3025761"
    },
    {
      "text": "4Kevin G Stanley, Ian Livingston, Alan Bandurka, Robert Kapiszka, and Regan L Mandryk. 2010. PiNiZoRo: A GPS-based Exercise Game for Families. In FuturePlay.  ",
      "doi": "10.1145/1920778.1920817"
    },
    {
      "text": "David R Thomas. 2003. A general inductive approach for qualitative data analysis. Population English Edition 27, 2: 237--246.",
      "doi": ""
    },
    {
      "text": "5Stewart G Trost and Paul D Loprinzi. 2011. Parental Influences on Physical Activity Behavior in Children and Adolescents: A Brief Review. American Journal of Lifestyle Medicine 5, 2: 171--181.",
      "doi": ""
    },
    {
      "text": "5Stewart G Trost, Neville Owen, Adrian E Bauman, James F Sallis, and Wendy Brown. 2002. Correlates of adults' participation in physical activity: review and update. Medicine & Science in Sports & Exercise 34, 12: 1996--2001.",
      "doi": ""
    },
    {
      "text": "5Amna Umer, George A Kelley, Lesley E Cottrell, Peter Giacobbi Jr, Kim E Innes, and Christa L Lilly. 2009. Childhood obesity and adult cardiovascular disease risk: a systematic review. 1--11.",
      "doi": ""
    },
    {
      "text": "5Kim M. Unertl, Chris L. Schaefbauer, Terrance R. Campbell, Charles Senteio, Katie A. Siek, Suzanne Bakken, and Tiffany C. Veinot. 2016. Integrating community-based participatory research and informatics approaches to improve the engagement and health of underserved populations. Journal of the American Medical Informatics Association 23, 1: 60--73.",
      "doi": ""
    },
    {
      "text": "5Bernard Weiner. 2014. The Attribution Approach to Emotion and Motivation: History, Hypotheses, Home Runs, Headaches/Heartaches. Emotion Review 6, 4: 353--361.",
      "doi": ""
    },
    {
      "text": "5S. Wilcox, C Castro, A C King, R Housemann, and R C Brownson. 2000. Determinants of leisure time physical activity in rural compared with urban older and ethnically diverse women in the United States. Journal of Epidemiology & Community Health 54, 9: 667--672.",
      "doi": ""
    },
    {
      "text": "5Marc A. Zimmerman. 1990. Toward a theory of learned hopefulness: A structural model analysis of participation and empowerment. Journal of Research in Personality 24, 1: 71--86.",
      "doi": ""
    }
  ]
}