{
  "doi": "10.1145/3173574.3173955",
  "title": "[Un]breaking News: Design Opportunities for Enhancing Collaboration in Scientific Media Production",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Contemporary scientific media production requires a complex socio-technical infrastructure we call the \"Media Production Pipeline\" (MPP). Media professionals engage with researchers along the MPP to disseminate science news to the lay public. However, differing incentive structures and professional contexts frequently set researchers' values and needs at odds with those of media professionals, resulting in problematic or failed interactions. We ask the research question: what pain points in scientific media production afford opportunities for future HCI innovation? We then present a grounded theory analysis of 24 interviews with researchers and media professionals, yielding several key contributions. First, we describe two collaborative domains in scientific media production between research advocates and media outlets. Second, we characterize discrete technological gaps and pain points in both domains. Finally, we discuss implications for design and propose solutions from HCI areas like peer production, online communities, recommender systems, and online collaboration.",
  "authors": [
    {
      "name": "C. Estelle Smith",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-99659230846/rel-imgonly/estelle_new_square.jpg",
      "acmid": "99659230846",
      "orcid": "missing"
    },
    {
      "name": "Xinyi Wang",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659231729",
      "orcid": "missing"
    },
    {
      "name": "Raghav Pavan Karumur",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987093",
      "orcid": "missing"
    },
    {
      "name": "Haiyi Zhu",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81484646857/rel-imgonly/headshot.png",
      "acmid": "81484646857",
      "orcid": "0000-0001-7271-9100"
    }
  ],
  "references": [
    {
      "text": "Hunt Allcott and Matthew Gentzkow. 2017. Social media and fake news in the 2016 election. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Ahmer Arif, John J. Robinson, Stephanie A. Stanek, Elodie S. Fichet, Paul Townsend, Zena Worku, and Kate Starbird. 2017. A Closer Look at the Self-Correcting Crowd. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17 (2017), 155--168.  ",
      "doi": "10.1145/2998181.2998294"
    },
    {
      "text": "Hernan Badenes, Mateo N Bengualid, Jilin Chen, Liang Gou, Eben Haber, Jalal Mahmud, Jeffrey W Nichols, Aditya Pal, Jerald Schoudt, Barton A Smith, and others. 2014. System U: automatically deriving personality traits from social media for people recommendation. In Proceedings of the 8th ACM Conference on Recommender systems. ACM, 373--374.  ",
      "doi": "10.1145/2645710.2645719"
    },
    {
      "text": "Krisztian Balog, Leif Azzopardi, and Maarten De Rijke. 2006. Formal models for expert finding in enterprise corpora. In Proceedings of the 29th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 43--50.  ",
      "doi": "10.1145/1148170.1148181"
    },
    {
      "text": "Natalya N Bazarova and Jeffrey T Hancock. 2010. From Dispositional Attributions to Behavior Motives The Folk-Conceptual Theory and Implications for Communication. Annals of the International Communication Association 34, 1 (2010), 63--91.",
      "doi": ""
    },
    {
      "text": "Allan Bell. 1994. Media (mis)communication on the science of climate change. Public Understanding of Science 3 (1994), 259--275.",
      "doi": ""
    },
    {
      "text": "Rémi Bois, Guillaume Gravier, Eric Jamet, Maxime Robert, Morin Emmanuel, and Pascale Sébillot. 2017. Language-based Construction of Explorable News Graphs for Journalists. In Empirical Methods in Natural Language Processing-Workshop on Natural Language Processing meets Journalism.",
      "doi": ""
    },
    {
      "text": "Dominique Brossard. 2013. New media landscapes and the science information consumer. Proceedings of the National Academy of Sciences 110, Supplement 3 (2013), 14096--14101.",
      "doi": ""
    },
    {
      "text": "Carlos Castillo, Marcelo Mendoza, and Barbara Poblete. 2011. Information credibility on twitter. In Proceedings of the 20th international conference on World wide web WWW '11. ACM Press, New York, New York, USA, 675.  ",
      "doi": "10.1145/1963405.1963500"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. Sage.",
      "doi": ""
    },
    {
      "text": "Sophie Chesney, Maria Liakata, Massimo Poesio, and Matthew Purver. 2017. Incongruent Headlines: Yet Another Way to Mislead Your Readers. EMNLP 2017 (2017), 56.",
      "doi": ""
    },
    {
      "text": "Lucas Colusso, Cynthia L Bennett, Gary Hsieh, and Sean A Munson. 2017. Translational Resources: Reducing the Gap Between Academic Research and HCI Practice. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 957--968.  ",
      "doi": "10.1145/3064663.3064667"
    },
    {
      "text": "Kyle Conway. 2008. A cultural studies approach to semantic instability: The case of news translation. Linguistica Antverpiensia, New Series - Themes in Translation Studies 0, 7 (2008).",
      "doi": ""
    },
    {
      "text": "Stephanie Craft, Seth Ashley, and Adam Maksl. 2017. News media literacy and conspiracy theory endorsement. Communication and the Public (2017), 2057047317725539.",
      "doi": ""
    },
    {
      "text": "Julie D'acci. 2004. Cultural studies, television studies, and the crisis in the humanities. Television after TV: Essays on a Medium in Transition (2004), 418--42.",
      "doi": ""
    },
    {
      "text": "Special Eurobarometer 419. 2014. Public perceptions of science, research and innovation. European Union ISBN (2014), 978--92.",
      "doi": ""
    },
    {
      "text": "Declan Fahy. 2017. Historical moments in public understanding of science: 1977, The Visible Scientists identifies a new scientist for the mass media age. Public Understanding of Science 26, 8 (2017), 1019--1024. PMID: 29025370.",
      "doi": ""
    },
    {
      "text": "Declan Fahy and Matthew C Nisbet. 2011. The science journalist online: Shifting roles and emerging practices. Journalism 12, 7 (2011), 778--793.",
      "doi": ""
    },
    {
      "text": "China Research Institute for Science Popularization. 2010. The Survey of Public Scientific Literacy, 2010: Main Findings of Public Knowledge, Approach, Interest, and Attitude regarding Science & Technology. Technical Report. http://www.crsp.org.cn/csi.pdf",
      "doi": ""
    },
    {
      "text": "Jill Freyne, Michal Jacovi, Ido Guy, and Werner Geyer. 2009. Increasing engagement through early recommender intervention. In Proceedings of the third ACM conference on Recommender systems. ACM, 85--92.  ",
      "doi": "10.1145/1639714.1639730"
    },
    {
      "text": "Adrien Friggeri, La Adamic, Dean Eckles, and Justin Cheng. 2014. Rumor Cascades. ICWSM (2014), 101--110.",
      "doi": ""
    },
    {
      "text": "Andrew Garbett, Rob Comber, Paul Egglestone, Maxine Glancy, and Patrick Olivier. 2014. Finding \"Real People\": Trust and Diversity in the Interface Between Professional and Citizen Journalists. In CHI Proceedings. ACM.  ",
      "doi": "10.1145/2556288.2557114"
    },
    {
      "text": "Rae Goodell. 1977. The Visible Scientists. The Sciences, 17: 6--9.",
      "doi": ""
    },
    {
      "text": "Jonathan Gray, Lucy Chambers, and Liliana Bounegru. 2012. The data journalism handbook: how journalists can use data to improve the news. \" O'Reilly Media, Inc.\".",
      "doi": ""
    },
    {
      "text": "Ido Guy, Michal Jacovi, Elad Shahar, Noga Meshulam, Vladimir Soroka, and Stephen Farrell. 2008. Harvesting with SONAR: the value of aggregating social network information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1017--1026.  ",
      "doi": "10.1145/1357054.1357212"
    },
    {
      "text": "Ido Guy, Inbal Ronen, and Eric Wilcox. 2009. Do you know?: recommending people to invite into your social network. In Proceedings of the 14th international conference on Intelligent user interfaces. ACM, 77--86.  ",
      "doi": "10.1145/1502650.1502664"
    },
    {
      "text": "Alfred Hermida. 2010. Twittering the news: The emergence of ambient journalism. Journalism practice 4, 3 (2010), 297--308.",
      "doi": ""
    },
    {
      "text": "Alfred Hermida, Fred Fletcher, Darryl Korell, and Donna Logan. 2012. Share, like, recommend: Decoding the social media news consumer. Journalism Studies 13, 5--6 (2012), 815--824.",
      "doi": ""
    },
    {
      "text": "The Hypothesis Project. 2011. Hypothes.is. (2011). https://web.hypothes.is/ {Online; accessed 06-January-2018 }.",
      "doi": ""
    },
    {
      "text": "Jr. James W. Tankard and Michael Ryan. 1974. News Source Perceptions of Accuracy of Science Coverage. Journalism Quarterly 51, 2 (1974), 219--225.",
      "doi": ""
    },
    {
      "text": "Thomas J Johnson and Barbara K Kaye. 2004. Wag the blog: How reliance on traditional media and the Internet influence credibility perceptions of weblogs among blog users. Journalism & Mass Communication Quarterly 81, 3 (2004), 622--642.",
      "doi": ""
    },
    {
      "text": "Thomas J Johnson and Barbara K Kaye. 2010. Believing the blogs of war? How blog users compare on credibility and characteristics in 2003 and 2007. Media, War & Conflict 3, 3 (2010), 315--333.",
      "doi": ""
    },
    {
      "text": "Karen Kaiser. 2009. Protecting Respondent Confidentiality in Qualitative Research Karen. Qualitative Health Research 19, 11 (2009), 1632--1641.",
      "doi": ""
    },
    {
      "text": "Chelsea Lee and Jeff Hume-Pratuch. 2013. Let's Talk About Research Participants. (2013). http://blog.apastyle.org/apastyle/2013/08/ lets-talk-about-research-participants.html.",
      "doi": ""
    },
    {
      "text": "Stephan Lewandowsky, Ullrich KH Ecker, Colleen M Seifert, Norbert Schwarz, and John Cook. 2012. Misinformation and its correction: Continued influence and successful debiasing. Psychological Science in the Public Interest 13, 3 (2012), 106--131.",
      "doi": ""
    },
    {
      "text": "Mark T Maybury. 2006. Expert finding systems. Technical Report. Technical Report MTR06B000040, MITRE Corporation.",
      "doi": ""
    },
    {
      "text": "Jon D Miller. 2016. Civic Scientific Literacy in the United States in 2016: A report prepared for the National Aeronautics and Space Administration. Technical Report. University of Michigan.",
      "doi": ""
    },
    {
      "text": "Steve Miller and Jane Gregory. 1998. Science in public: Communication, culture & credibility. (1998).",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra and Eric Gilbert. 2015. CREDBANK: A Large-Scale Social Media Corpus With Associated Credibility Annotations.. In ICWSM. 258--267.",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra, Graham P Wright, and Eric Gilbert. 2017. A parsimonious language model of social media credibility across disparate events. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 126--145.  ",
      "doi": "10.1145/2998181.2998351"
    },
    {
      "text": "Saif Mohammad, Svetlana Kiritchenko, Parinaz Sobhani, Xiao-Dan Zhu, and Colin Cherry. 2016. SemEval-2016 Task 6: Detecting Stance in Tweets.. In SemEval@ NAACL-HLT. 31--41.",
      "doi": ""
    },
    {
      "text": "Alejandro Montes-Garcia, Jose Maria Alvarez-rodríguez, Jose Emilio Labra-Gayo, and Marcos Martinez-Merino. 2013. Towards a journalist-based news recommendation system : The Wesomender approach. Expert Systems with Applications (2013).  ",
      "doi": "10.1016/j.eswa.2013.06.032"
    },
    {
      "text": "Michael J Muller. 1995. Ethnocritical questions for working with translations, interpretation and their stakeholders. Commun. ACM 38, 9 (1995), 64--65.  ",
      "doi": "10.1145/223248.223265"
    },
    {
      "text": "Dina Pisarevskaya. 2017. Deception Detection in News Reports in the Russian Language: Lexics and Discourse. EMNLP 2017 (2017), 74.",
      "doi": ""
    },
    {
      "text": "D. Lynn Pulford. 1976. Follow-Up of Study of Science News Accuracy. Journalism Quarterly 53, 1 (1976), 119--121.",
      "doi": ""
    },
    {
      "text": "Quartz. 2017. Quartz New App. (2017). https://itunes.apple.com/us/app/ quartz-news-in-a-whole-new-way/id1076683233",
      "doi": ""
    },
    {
      "text": "Victoria L Rubin, Yimin Chen, and Niall J Conroy. 2015. Deception detection for news: three types of fakes. Proceedings of the Association for Information Science & Technology 52, 1 (2015), 1--4. ",
      "doi": "10.5555/2857070.2857153"
    },
    {
      "text": "Benjamin Saunders and Jenny Kitzinger. 2015. Anonymising interview data: challenges and compromise in practice. Qualitative Research 15, 5 (2015), 616--632.",
      "doi": ""
    },
    {
      "text": "Irving Seidman. 2013. Interviewing as qualitative research: A guide for researchers in education and the social sciences. Teachers college press.",
      "doi": ""
    },
    {
      "text": "Benjamin SP Shen. 1975. Science literacy and the public understanding of science. In Communication of scientific information. Karger Publishers, 44--52.",
      "doi": ""
    },
    {
      "text": "Irina Shklovski. 2013. \"Un-Googling\" Publications : The Ethics and Problems of Anonymization. (2013), 2169--2178.  ",
      "doi": "10.1145/2468356.2468737"
    },
    {
      "text": "P.J. Shoemaker and T.P. Vos. 2009. Gatekeeping Theory. Routledge.",
      "doi": ""
    },
    {
      "text": "Catherine E. Snow and Kenne A. Dibner. 2016. Science Literacy: Concepts, contexts, and consequences. National Academies Press.",
      "doi": ""
    },
    {
      "text": "Christian Stab and Iryna Gurevych. 2017. Recognizing insufficiently supported arguments in argumentative essays. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics: Volume 1, Long Papers, Vol. 1. 980--990.",
      "doi": ""
    },
    {
      "text": "Kate Starbird. 2017. Examining the Alternative Media Ecosystem Through the Production of Alternative Narratives of Mass Shooting Events on Twitter. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Terrence Szymanski, Claudia Orellana-Rodriguez, and Mark T Keane. 2017. Helping News Editors Write Better Headlines: A Recommender to Improve the Keyword Contents & Shareability of News Headlines. arXiv preprint arXiv:1705.09656 (2017).",
      "doi": ""
    },
    {
      "text": "Luc van Doorslaer. 2000. Handbook of Translation Studies : Volume 1. John Benjamins Publishing Company, Chapter Journalism and Translation, 180--184.",
      "doi": ""
    },
    {
      "text": "John Vines, Anja Thieme, Rob Comber, Mark Blythe, Peter Wright, and Patrick Olivier. 2013. HCI in the press: Online public reactions to mass media portrayals of HCI research. Proc. CHI 2013 (2013), 1873--1882.  ",
      "doi": "10.1145/2470654.2466247"
    },
    {
      "text": "Farida Vis. 2013. Twitter as a reporting tool for breaking news: Journalists tweeting the 2011 UK riots. Digital journalism 1, 1 (2013), 27--47.",
      "doi": ""
    },
    {
      "text": "Claire Wardle. 2017. Fake news. It's complicated. (2017). https://firstdraftnews.com/fake-news-complicated/ {Online; accessed 13-September-2017 }.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2017. Newsroom - Wikipedia, The Free Encyclopedia. (2017). https://en.wikipedia.org/w/index. php?title=Newsroom&oldid=785447797 {Online; accessed 31-August-2017 }.",
      "doi": ""
    },
    {
      "text": "Marian G Williams. 1993. Translation in participatory design: lessons from a workshop. In INTERACT'93 and CHI'93 Conference Companion on Human Factors in Computing Systems. ACM, 55--56.  ",
      "doi": "10.1145/259964.260063"
    }
  ]
}