{
  "doi": "10.1145/3173574.3173663",
  "title": "iTurk: Turning Passive Haptics into Active Haptics by Making Users Reconfigure Props in Virtual Reality",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "We present a system that complements virtual reality experiences with passive props, yet still allows modifying the virtual world at runtime. The main contribution of our system is that it does not require any actuators; instead, our system employs the user to reconfigure and actuate otherwise passive props. We demonstrate a foldable prop that users reconfigure to represent a suitcase, fuse cabinet, railing, and a seat. A second prop, suspended from a long pendulum, not only stands in for inanimate objects, but also for objects that move and demonstrate proactive behavior, such as a group of flying droids that physically attack the user. Our approach conveys a sense of a living, animate world, when in reality the user is the only animate entity present in the system, complemented with only one or two physical props. In our study, participants rated their experience as more enjoyable and realistic than a corresponding no-haptics condition.",
  "authors": [
    {
      "name": "Lung-Pan Cheng",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81470651683/rel-imgonly/32956970-44d4-41fa-95c3-df5faf94a414_1_201_a.jpeg",
      "acmid": "81470651683",
      "orcid": "0000-0002-7712-8622"
    },
    {
      "name": "Li Chang",
      "institution": "Hasso Plattner Institute & ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260914",
      "orcid": "missing"
    },
    {
      "name": "Sebastian Marwecki",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558084156",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic turk: a motion platform based on people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 34633472.  ",
      "doi": "10.1145/2556288.2557101"
    },
    {
      "text": "Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, and Patrick Baudisch. 2015. TurkDeck: Physical Virtual Reality Based on People. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "Lung-Pan Cheng, Sebastian Marwecki and Patrick Baudisch. 2017. Mutual Human Actuation. In Proceedings of the 30th Annual ACM Symposium on User Interface Software & Technology (UIST '17).  ",
      "doi": "10.1145/3126594.3126667"
    },
    {
      "text": "Ivan E. Sutherland. 1968. A head-mounted three dimensional display. In Proceedings of the December 911, 1968, fall joint computer conference, part I (AFIPS '68 (Fall, part I)). ACM, New York, NY, USA, 757764.  ",
      "doi": "10.1145/1476589.1476686"
    },
    {
      "text": "Ivan E. Sutherland. 1965. The ultimate display. In Proceedings of the Congress of the International Federation of Information Processing (IFIP), 506--508.",
      "doi": ""
    },
    {
      "text": "W. A. McNeely, \"Robotic graphics: a new approach to force feedback for virtual reality,\" Proceedings of IEEE Virtual Reality Annual International Symposium, Seattle, WA, 1993, pp. 336--341.  ",
      "doi": "10.1109/VRAIS.1993.380761"
    },
    {
      "text": "Doug A. Bowman, David Koller, and Larry F. Hodges. 1997. Travel in Immersive Virtual Environments: An Evaluation of Viewpoint Motion Control Techniques. In Proceedings of the 1997 Virtual Reality Annual International Symposium (VRAIS '97) (VRAIS '97). IEEE Computer Society, Washington, DC, USA, 45-. ",
      "doi": "10.5555/523977.836072"
    },
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 218226.  ",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI '17). ACM, New York, NY, USA, 1471--1482.  ",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 11--19.  ",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch: Highfidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Rajinder Sodhi, Ivan Poupyrev, Matthew Glisson, and Ali Israr. 2013. AIREAL: interactive tactile experiences in free air. ACM Trans. Graph. 32, 4, Article 134 (July 2013), 10 pages.  ",
      "doi": "10.1145/2461912.2462007"
    },
    {
      "text": "H. G. Hoffman, \"Physically touching virtual objects using tactile augmentation enhances the realism of virtual environments,\" Proceedings. IEEE 1998 Virtual Reality Annual International Symposium (Cat. No.98CB36180), Atlanta, GA, USA, 1998, pp. 59--63. ",
      "doi": "10.5555/522258.836098"
    },
    {
      "text": "Insko, B.E. Passive haptics significantly enhances virtual environments. Dissertation at University of North Carolina at Chapel Hill, 2001. ",
      "doi": "10.5555/933178"
    },
    {
      "text": "Kok-Lim Low, Greg Welch, Anselmo Lastra, and Henry Fuchs. 2001. Life-sized projector-based dioramas. In Proceedings of the ACM symposium on Virtual reality software and technology (VRST '01). ACM, New York, NY, USA, 93--101.  ",
      "doi": "10.1145/505008.505026"
    },
    {
      "text": "C. E. Hughes, C. B. Stapleton, D. E. Hughes and E. M. Smith. Mixed reality in education, entertainment, and training. In IEEE Computer Graphics and Applications, vol. 25, no. 6, pp. 24--30, Nov.-Dec. 2005.  ",
      "doi": "10.1109/MCG.2005.139"
    },
    {
      "text": "J. Pair, U. Neumann, D. Piepol and B. Swartout, \"FlatWorld: combining Hollywood set-design techniques with VR,\" in IEEE Computer Graphics and Applications, vol. 23, no. 1, pp. 12--15, Jan/Feb 2003.  ",
      "doi": "10.1109/MCG.2003.1159607"
    },
    {
      "text": "Luv Kohli, Eric Burns, Dorian Miller, and Henry Fuchs. 2005. Combining passive haptics with redirected walking. In Proceedings of the 2005 international conference on Augmented tele-existence (ICAT '05). ACM, New York, NY, USA, 253--254.  ",
      "doi": "10.1145/1152399.1152451"
    },
    {
      "text": "Adalberto L. Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional Reality: Using the Physical Environment to Design Virtual Reality Experiences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3307--3316.  ",
      "doi": "10.1145/2702123.2702389"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D. Wilson. 2017. Sparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive Prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 37183728.  ",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J.C., and Kassell, N.F. Passive Real-world Interface Props for Neurosurgical Visualization. Proc. CHI '94, 452--458.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "HTC Corporation. 2017. HTC Vive. Retrieved September 7, 2017 from https://www.vive.com..",
      "doi": ""
    },
    {
      "text": "Ortega, M. and Coquillart, S. Prop-based haptic interaction with co-location and immersion: an automotive application. Proc. HAVE'05.",
      "doi": ""
    },
    {
      "text": "Boris Schling. 2011. The Boost C++ Libraries. XML Press. ",
      "doi": "10.5555/2049814"
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1968--1979.  ",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Evan A. Suma, Zachary Lipps, Samantha Finkelstein, David M. Krum, and Mark Bolas. 2012. Impossible Spaces: Maximizing Natural Walking in Virtual Environments with Self-Overlapping Architecture. IEEE Transactions on Visualization and Computer Graphics 18, 4 (April 2012), 555--564.  ",
      "doi": "10.1109/TVCG.2012.47"
    },
    {
      "text": "Laurent Aguerreche, Thierry Duval, and Anatole Lécuyer. 2010. Reconfigurable tangible devices for 3D virtual object manipulation by single or multiple users. In Proceedings of the 17th ACM Symposium on Virtual Reality Software and Technology (VRST '10). ACM, New York, NY, USA, 227--230.  ",
      "doi": "10.1145/1889863.1889913"
    },
    {
      "text": "R. W. Lindeman, J. L. Sibert and J. K. Hahn, \"Handheld windows: towards effective 2D interaction in immersive virtual environments,\" Proceedings IEEE Virtual Reality (Cat. No. 99CB36316), Houston, TX, 1999, pp. 205--212. ",
      "doi": "10.5555/554230.835715"
    },
    {
      "text": "Andre Zenner and Antonio Kruger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (April 2017), 1285--1294.  ",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "John C. McClelland, Robert J. Teather, and Audrey Girouard. 2017. Haptobend: shape-changing passive haptic feedback in virtual reality. In Proceedings of the 5th Symposium on Spatial User Interaction (SUI '17). ACM, New York, NY, USA, 82--90.  ",
      "doi": "10.1145/3131277.3132179"
    },
    {
      "text": "Razzaque, S., Kohn, Z., & Whitton, M. C. (2001, September). Redirected walking. In Proceedings of EUROGRAPHICS (Vol. 9, pp. 105--106).",
      "doi": ""
    },
    {
      "text": "Usoh, M., Arthur, K., Whitton, M. C., Bastos, R., Steed, A., Slater, M., & Brooks Jr, F. P. (1999, July). Walking&gt; walking-in-place&gt; flying, in virtual environments. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques, 359--364.  ",
      "doi": "10.1145/311535.311589"
    }
  ]
}