{
  "doi": "10.1145/3173574.3173800",
  "title": "Applying Computational Analysis to Textual Data from the Wild: A Feminist Perspective",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "With technologies that afford much larger-scale data collection than previously imagined, new ways of processing and interpreting qualitative textual data are required. HCI researchers use a range of methods for interpreting the 'full range of human experience' from qualitative data, however, such approaches are not always scalable. Feminist geography seeks to explore how diverse and varied accounts of place can be understood and represented, whilst avoiding reductive classification systems. In this paper, we assess the extent to which unsupervised topic models can support such a research agenda. Drawing on literature from Feminist and Critical GIS, we present a case study analysis of a Volunteered Geographic Information dataset of reviews about breastfeeding in public spaces. We demonstrate that topic modelling can offer novel insights and nuanced interpretations of complex concepts such as privacy and be integrated into a critically reflexive feminist data analysis approach that captures and represents diverse experiences of place.",
  "authors": [
    {
      "name": "Shauna Julia Concannon",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660481107",
      "orcid": "missing"
    },
    {
      "name": "Madeline Balaam",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448600301",
      "orcid": "0000-0001-9472-3805"
    },
    {
      "name": "Emma Simpson",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659152832",
      "orcid": "missing"
    },
    {
      "name": "Rob Comber",
      "institution": "RISE SICS, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    }
  ],
  "references": [
    {
      "text": "2015. English indices of deprivation 2015. (2015). https://www.gov.uk/government/statistics/ english-indices-of-deprivation-2015",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: a location-mapping mobile application for breastfeeding women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1709--1718.  ",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Mara Balestrini, Yvonne Rogers, and Paul Marshall. 2015. Civically engaged HCI: tensions between novelty and social impact. In Proceedings of the 2015 British HCI Conference. ACM, 35--36.  ",
      "doi": "10.1145/2783446.2783590"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 675--684.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of machine Learning research 3, Jan (2003), 993--1022. ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "Elizabeth Bonsignore, Alexander J Quinn, Allison Druin, and Benjamin B Bederson. 2013. Sharing stories \"in the wild\": A mobile storytelling case study using StoryKit. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 3 (2013), 18.  ",
      "doi": "10.1145/2491500.2491506"
    },
    {
      "text": "Shauna Concannon and Matthew Purver. 2014. Interpreting Arts Audiences and Cultural Preference Through Twitter Data. In Digital Intelligence. Nantes, France.",
      "doi": ""
    },
    {
      "text": "Daniel Dorling. 1998. Human cartography: when it is good to map. Environment and Planning A 30, 2 (1998), 277--288.",
      "doi": ""
    },
    {
      "text": "Kenneth J Dueker. 1987. Geographic information systems and computer-aided mapping. Journal of the American Planning Association 53, 3 (1987), 383--390.",
      "doi": ""
    },
    {
      "text": "Jacob Eisenstein, Duen Horng Chau, Aniket Kittur, Eric P Xing, and others. 2011. Topicviz: Semantic navigation of document collections. arXiv preprint arXiv:1110.6200 (2011).",
      "doi": ""
    },
    {
      "text": "Sarah Elwood. 2008. Volunteered geographic information: future research directions motivated by critical, participatory, and feminist GIS. GeoJournal 72, 3--4 (2008), 173--183.",
      "doi": ""
    },
    {
      "text": "Public Health England. 2015. New mothers are anxious about breastfeeding in public. (2015). https://www.gov.uk/government/news/ new-mothers-are-anxious-about-breastfeeding-in-public",
      "doi": ""
    },
    {
      "text": "Robin Flowerdew. 1998. Reacting to ground truth. Environment and Planning A 30, 2 (1998), 289--301.",
      "doi": ""
    },
    {
      "text": "Alastair J Gill, Saba Hinrichs-Krapels, Tobias Blanke, Jonathan Grant, Mark Hedges, and Simon Tanner. 2017. Insight workflow: Systematically combining human and computational methods to explore textual data. Journal of the Association for Information Science & Technology (2017).  ",
      "doi": "10.1002/asi.23767"
    },
    {
      "text": "Thomas L Griffiths and Mark Steyvers. 2004. Finding scientific topics. Proceedings of the National academy of Sciences 101, suppl 1 (2004), 5228--5235.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Feminist Studies 14, 3 (1988), 575--599.",
      "doi": ""
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-place-ing space: the roles of place and space in collaborative systems. In Proceedings of the 1996 ACM Conference on Computer Supported Cooperative Work. ACM, 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Clint Heyer and Margot Brereton. 2010. Design from the everyday: continuously evolving, embedded exploratory prototypes. In Proceedings of the 8th ACM Conference on Designing Interactive Systems. ACM, 282--291.  ",
      "doi": "10.1145/1858171.1858222"
    },
    {
      "text": "Thomas Hofmann. 1999. Probabilistic latent semantic indexing. In Proceedings of the 22nd annual international ACM SIGIR Conference on Research and Development in Information Retrieval. ACM, 50--57.  ",
      "doi": "10.1145/312624.312649"
    },
    {
      "text": "Phil Hubbard, Brendan Bartley, Duncan Fuller, and Rob Kitchin. 2002. Thinking geographically: Space, theory and contemporary human geography. A&C Black.",
      "doi": ""
    },
    {
      "text": "Don Ihde. 1995. Postphenomenology: Essays in the postmodern context. Northwestern University Press.",
      "doi": ""
    },
    {
      "text": "Rob Kitchin and Tracey P Lauriault. 2014. Towards critical data studies: Charting and unpacking data assemblages and their work. (2014).",
      "doi": ""
    },
    {
      "text": "Lauren Klein and Jacob Eisenstein. 2013. Reading Thomas Jefferson with TopicViz: towards a thematic method for exploring large cultural archives. Scholarly and Research Communication 4, 3 (2013).",
      "doi": ""
    },
    {
      "text": "LaDona Knigge and Meghan Cope. 2006. Grounded visualization: integrating the analysis of qualitative and quantitative data through grounded theory and visualization. Environment and Planning A 38, 11 (2006), 2021--2037.",
      "doi": ""
    },
    {
      "text": "Mei-Po Kwan. 2002a. Feminist visualization: Re-envisioning GIS as a method in feminist geographic research. Annals of the association of American geographers 92, 4 (2002), 645--661.",
      "doi": ""
    },
    {
      "text": "Mei-Po Kwan. 2002b. Quantitative methods and feminist geographic research. Feminist Geography in Practice: Research and Methods (2002), 160--73.",
      "doi": ""
    },
    {
      "text": "Mei-Po Kwan. 2004. Beyond difference: From canonical geography to hybrid geographies. Annals of the Association of American Geographers 94, 4 (2004), 756--763.",
      "doi": ""
    },
    {
      "text": "Koen Leurs. 2017. feminist data studies: using digital methods for ethical, reflexive and situated socio-cultural research. Feminist Review 115, 1 (2017), 130--154.",
      "doi": ""
    },
    {
      "text": "Fiona McAndrew, Jane Thompson, Lydia Fellows, Alice Large, Mark Speed, and Mary J Renfrew. 2012. Infant feeding survey 2010. Leeds: Health and Social Care Information Centre (2012).",
      "doi": ""
    },
    {
      "text": "Andrew Kachites McCallum. 2002. Mallet: A machine learning for language toolkit. (2002).",
      "doi": ""
    },
    {
      "text": "Sara L McLafferty. 1995. Counting for Women The Professional Geographer 47, 4 (1995), 436--442.",
      "doi": ""
    },
    {
      "text": "Sara L McLafferty. 2002. Mapping women's worlds: Knowledge, power and the bounds of GIS. Gender, Place and Culture: A Journal of Feminist Geography 9, 3 (2002), 263--269.",
      "doi": ""
    },
    {
      "text": "Chrystie Myketiak, Shauna Concannon, and Paul Curzon. 2017. Narrative perspective, person references, and evidentiality in clinical incident reports. Journal of Pragmatics 117 (2017), 139--154.",
      "doi": ""
    },
    {
      "text": "Laura L Oakley, Mary J Renfrew, Jennifer J Kurinczuk, and Maria A Quigley. 2013. Factors associated with breastfeeding in England: an analysis by primary care trust. BMJ open 3, 6 (2013), e002765.",
      "doi": ""
    },
    {
      "text": "Stan Openshaw. 1998. Towards a more computationally minded scientific human geography. Environment and Planning A 30, 2 (1998), 317--332.",
      "doi": ""
    },
    {
      "text": "David O'Sullivan. 2006. Geographical information science: critical GIS. Progress in Human Geography 30, 6 (2006), 783--791.",
      "doi": ""
    },
    {
      "text": "Michael Paul and Roxana Girju. 2009a. Cross-cultural analysis of blogs and forums with mixed-collection topic models. In Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing: Volume 3-Volume 3. Association for Computational Linguistics, 1408--1417. ",
      "doi": "10.5555/1699648.1699687"
    },
    {
      "text": "Michael J Paul and Roxana Girju. 2009b. Topic Modeling of Research Fields: An Interdisciplinary Perspective.. In RANLP. 337--342.",
      "doi": ""
    },
    {
      "text": "Marianna Pavlovskaya. 2006. Theorizing with GIS: a tool for critical geographies? Environment and Planning A 38, 11 (2006), 2003--2020.",
      "doi": ""
    },
    {
      "text": "Marco Pennacchiotti and Ana-Maria Popescu. 2011. A Machine Learning Approach to Twitter User Classification. ICWSM 11, 1 (2011), 281--288.",
      "doi": ""
    },
    {
      "text": "John Pickles. 1995. Ground truth: The social implications of geographic information systems. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Daniel Ramage, Susan T Dumais, and Daniel J Liebling. 2010. Characterizing microblogs with topic models. ICWSM 10 (2010), 1--1.",
      "doi": ""
    },
    {
      "text": "Daniel Ramage, Christopher D Manning, and Susan Dumais. 2011. Partially labeled topic models for interpretable text mining. In Proceedings of the 17th ACM SIGKDD international conference on Knowledge Discovery and Data Mining. ACM, 457--465.  ",
      "doi": "10.1145/2020408.2020481"
    },
    {
      "text": "Daniel Ramage, Christopher D Manning, and Daniel A McFarland. 2010. Which universities lead and lag? Toward university rankings based on scholarly output. In Proc. of NIPS Workshop on Computational Social Science and the Wisdom of the Crowds.",
      "doi": ""
    },
    {
      "text": "Alan Ritter, Colin Cherry, and Bill Dolan. 2010. Unsupervised modeling of twitter conversations. In Human Language Technologies: The 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics. Association for Computational Linguistics, 172--180. ",
      "doi": "10.5555/1857999.1858019"
    },
    {
      "text": "Jennifer A Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers 23, 5 (2011), 393--400.  ",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Nadine Schuurman and Geraldine Pratt. 2002. Care of the subject: Feminism and critiques of GIS. Gender, Place and Culture: A Journal of Feminist Geography 9, 3 (2002), 291--299.",
      "doi": ""
    },
    {
      "text": "Eric Sheppard. 2001. Quantitative geography: representations, practices, and possibilities. Environment and Planning D: Society and space 19, 5 (2001), 535--554.",
      "doi": ""
    },
    {
      "text": "Emma Simpson, Andrew Garbett, Rob Comber, and Madeline Balaam. 2016. Factors important for women who breastfeed in public: a content analysis of review data from FeedFinder. BMJ open 6, 10 (2016), e011762.",
      "doi": ""
    },
    {
      "text": "Alex Taylor. 2016. Data,(bio) sensing, and (other-) worldly stories from the cycle routes of London. Quantified: Biosensing Technologies in Everyday Life (2016), 189.",
      "doi": ""
    },
    {
      "text": "Jim Thatcher, Luke Bergmann, Britta Ricker, Reuben Rose-Redwood, David O'Sullivan, Trevor J Barnes, Luke R Barnesmoore, Laura Beltz Imaoka, Ryan Burns, Jonathan Cinnamon, and others. 2016. Revisiting critical GIS. Environment and Planning A 48, 5 (2016), 815--824.",
      "doi": ""
    },
    {
      "text": "Anton Törnberg and Petter Törnberg. 2016a. Combining CDA and topic modeling: Analyzing discursive connections between Islamophobia and anti-feminism on an online forum. Discourse & Society 27, 4 (2016), 401--422.",
      "doi": ""
    },
    {
      "text": "Anton Törnberg and Petter Törnberg. 2016b. Muslims in social media discourse: Combining topic modeling and critical discourse analysis. Discourse, Context & Media 13 (2016), 132--142.",
      "doi": ""
    },
    {
      "text": "Yi-Chia Wang, Moira Burke, and Robert E Kraut. 2013. Gender, topic, and audience response: an analysis of user-generated content on facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 31--34.  ",
      "doi": "10.1145/2470654.2470659"
    },
    {
      "text": "Gregor Wiedemann. 2016. Computer-assisted text analysis in the social sciences. In Text Mining for Qualitative Data Analysis in the Social Sciences. Springer, 17--54.",
      "doi": ""
    },
    {
      "text": "Anbang Xu, Xiao Yang, Huaming Rao, Wai-Tat Fu, Shih-Wen Huang, and Brian P Bailey. 2014. Show me the money!: An analysis of project updates during crowdfunding campaigns. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 591--600.  ",
      "doi": "10.1145/2556288.2557045"
    }
  ]
}