{
  "doi": "10.1145/3173574.3173851",
  "title": "Emotional Dialogue Generation using Image-Grounded Language Models",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Computer-based conversational agents are becoming ubiquitous. However, for these systems to be engaging and valuable to the user, they must be able to express emotion, in addition to providing informative responses. Humans rely on much more than language during conversations; visual information is key to providing context. We present the first example of an image-grounded conversational agent using visual sentiment, facial expression and scene features. We show that key qualities of the generated dialogue can be manipulated by the features used for training the agent. We evaluate our model on a large and very challenging real-world dataset of conversations from social media (Twitter). The image-grounding leads to significantly more informative, emotional and specific responses, and the exact qualities can be tuned depending on the image features used. Furthermore, our model improves the objective quality of dialogue responses when evaluated on standard natural language metrics.",
  "tags": [
    "emotion",
    "conversation",
    "computer vision",
    "dialogue",
    "conversational agents"
  ],
  "authors": [
    {
      "name": "Bernd Huber",
      "institution": "Harvard University & Microsoft Research, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557229156",
      "orcid": "missing"
    },
    {
      "name": "Daniel McDuff",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490688111",
      "orcid": "missing"
    },
    {
      "name": "Chris Brockett",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100241835",
      "orcid": "missing"
    },
    {
      "name": "Michel Galley",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100451865",
      "orcid": "missing"
    },
    {
      "name": "Bill Dolan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323489448",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jean-Yves Antoine, Jeanne Villaneau, and Ana&#239;s Lefeuvre. 2014. Weighted Krippendorff's alpha is a more reliable metrics for multi-coders ordinal annotations: experimental studies on emotion, opinion and coreference annotation.. In EACL 2014. 10--p.",
      "doi": ""
    },
    {
      "text": "Stanislaw Antol, Aishwarya Agrawal, Jiasen Lu, Margaret Mitchell, Dhruv Batra, C Lawrence Zitnick, and Devi Parikh. 2015. VQA: Visual question answering. In Proceedings of the IEEE International Conference on Computer Vision. 2425--2433.  ",
      "doi": "10.1109/ICCV.2015.279"
    },
    {
      "text": "Tadas Baltru?aitis, Peter Robinson, and Louis-Philippe Morency. 2016. Openface: an open source facial behavior analysis toolkit. In Applications of Computer Vision (WACV), 2016 IEEE Winter Conference on. IEEE, 1--10.",
      "doi": ""
    },
    {
      "text": "Edward M Bennett, R Alpert, and AC Goldstein. 1954. Communications through limited-response questioning. Public Opinion Quarterly 18, 3 (1954), 303--308.",
      "doi": ""
    },
    {
      "text": "Timothy Bickmore and Justine Cassell. 2001. Relational agents: a model and implementation of building user trust. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 396--403.  ",
      "doi": "10.1145/365024.365304"
    },
    {
      "text": "Timothy W Bickmore and Rosalind W Picard. 2005. Establishing and maintaining long-term human-computer relationships. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2 (2005), 293--327.  ",
      "doi": "10.1145/1067860.1067867"
    },
    {
      "text": "Timothy W Bickmore, Dina Utami, Robin Matsuyama, and Michael K Paasche-Orlow. 2016. Improving access to online health information with conversational agents: a randomized controlled experiment. Journal of medical Internet research 18, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Justine Cassell, Tim Bickmore, Lee Campbell, Hannes Vilhjálmsson, and Hao Yan. 2000. Conversation as a system framework: Designing embodied conversational agents. Embodied conversational agents (2000), 29--63. ",
      "doi": "10.5555/371552.371555"
    },
    {
      "text": "Justin Cranshaw, Emad Elwany, Todd Newman, Rafal Kocielnik, Bowen Yu, Sandeep Soni, Jaime Teevan, and Andrés Monroy-Hernández. 2017. Calendar. help: Designing a Workflow-Based Scheduling Agent with Humans in the Loop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2382--2393.  ",
      "doi": "10.1145/3025453.3025780"
    },
    {
      "text": "Lei Cui, Shaohan Huang, Furu Wei, Chuanqi Tan, Chaoqun Duan, and Ming Zhou. 2017. SuperAgent: A Customer Service Chatbot for E-commerce Websites. Proceedings of ACL 2017, System Demonstrations (2017), 97--102.",
      "doi": ""
    },
    {
      "text": "Abhishek Das, Satwik Kottur, Khushi Gupta, Avi Singh, Deshraj Yadav, José M. F. Moura, Devi Parikh, and Dhruv Batra. 2017a. Visual Dialog. (2017). http://arxiv.org/abs/1611.08669",
      "doi": ""
    },
    {
      "text": "Abhishek Das, Satwik Kottur, José M. F. Moura, Stefan Lee, and Dhruv Batra. 2017b. Learning Cooperative Visual Dialog Agents with Deep Reinforcement Learning. In International Conference on Computer Vision (ICCV). http://arxiv.org/abs/1703.06585",
      "doi": ""
    },
    {
      "text": "David DeVault, Ron Artstein, Grace Benn, Teresa Dey, Ed Fast, Alesia Gainer, Kallirroi Georgila, Jon Gratch, Arno Hartholt, Margaux Lhommet, and others. 2014. SimSensei Kiosk: A virtual human interviewer for healthcare decision support. In Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems. International Foundation for Autonomous Agents and Multiagent Systems, 1061--1068. ",
      "doi": "10.5555/2615731.2617415"
    },
    {
      "text": "Paul Ekman, Wallace V Friesen, and John Hager. 2002. Facial action coding system: A technique for the measurement of facial movement. Research Nexus, Salt Lake City, UT.",
      "doi": ""
    },
    {
      "text": "Michel Galley, Chris Brockett, Alessandro Sordoni, Yangfeng Ji, Michael Auli, Chris Quirk, Margaret Mitchell, Jianfeng Gao, and Bill Dolan. 2015. deltaBLEU: A discriminative metric for generation tasks with intrinsically diverse targets. In Proc. of ACL-IJCNLP.",
      "doi": ""
    },
    {
      "text": "Sayan Ghosh, Mathieu Chollet, Eugene Laksana, Louis-Philippe Morency, and Stefan Scherer. 2017. Affect-LM: A Neural Language Model for Customizable Affective Text Generation. arXiv preprint arXiv:1704.06851 (2017).",
      "doi": ""
    },
    {
      "text": "Yvette Graham, Timothy Baldwin, and Nitika Mathur. 2015. Accurate Evaluation of Segment-level Machine Translation Metrics. In Proc. of NAACL.",
      "doi": ""
    },
    {
      "text": "Jonathan Gratch, Ning Wang, Jillian Gerten, Edward Fast, and Robin Duffy. 2007. Creating rapport with virtual agents. In International Workshop on Intelligent Virtual Agents. Springer, 125--138.  ",
      "doi": "10.1007/978-3-540-74997-4_12"
    },
    {
      "text": "Kilem L Gwet. 2014. Handbook of inter-rater reliability: The definitive guide to measuring the extent of agreement among raters. Advanced Analytics, LLC.",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk. 2006. Current practice in measuring usability: Challenges to usability studies and research. International journal of human-computer studies 64, 2 (2006), 79--102.  ",
      "doi": "10.1016/j.ijhcs.2005.06.002"
    },
    {
      "text": "Brendan Jou, Tao Chen, Nikolaos Pappas, Miriam Redi, Mercan Topkara, and Shih-Fu Chang. 2015. Visual affect around the world: A large-scale multilingual visual sentiment ontology. In Proceedings of the 23rd ACM international conference on Multimedia. ACM, 159--168.  ",
      "doi": "10.1145/2733373.2806246"
    },
    {
      "text": "Karim Sadik Kassam. 2010. Assessment of emotional experience through facial expression. Harvard University.",
      "doi": ""
    },
    {
      "text": "Klaus Krippendorff. 2007. Computing Krippendorff's alpha reliability. Departmental papers (ASC) (2007), 43.",
      "doi": ""
    },
    {
      "text": "Yann LeCun, Yoshua Bengio, and Geoffrey Hinton. 2015. Deep learning. Nature 521, 7553 (2015), 436--444.",
      "doi": ""
    },
    {
      "text": "Jiwei Li, Michel Galley, Chris Brockett, Jianfeng Gao, and Bill Dolan. 2016. A diversity-promoting objective function for neural conversation models. In Proc. of NAACL-HLT.",
      "doi": ""
    },
    {
      "text": "Chia-Wei Liu, Ryan Lowe, Iulian Serban, Mike Noseworthy, Laurent Charlin, and Joelle Pineau. 2016. How NOT To Evaluate Your Dialogue System: An Empirical Study of Unsupervised Evaluation Metrics for Dialogue Response Generation. In Proc. of EMNLP. https://aclweb.org/anthology/D16--1230",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. Like having a really bad PA: the gulf between user expectation and experience of conversational agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Alexander Patrick Mathews, Lexing Xie, and Xuming He. 2016. SentiCap: Generating Image Descriptions with Sentiments.. In AAAI. 3574--3580. ",
      "doi": "10.5555/3016387.3016406"
    },
    {
      "text": "Yoichi Matsuyama, Arjun Bhardwaj, Ran Zhao, Oscar Romeo, Sushma Akoju, and Justine Cassell. 2016. Socially-Aware Animated Intelligent Personal Assistant Agent.. In SIGDIAL Conference. 224--227.",
      "doi": ""
    },
    {
      "text": "Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient estimation of word representations in vector space. arXiv preprint arXiv:1301.3781 (2013).",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Jaime Teevan, and Katrina Panovich. 2010. What do people ask their social networks, and why?: a survey study of status message Q&A behavior. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1739--1748.  ",
      "doi": "10.1145/1753326.1753587"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P Bigham, and Shaun K Kane. 2016. With most of it being pictures now, I rarely use it: Understanding Twitter's Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5506--5516.  ",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Nasrin Mostafazadeh, Chris Brockett, Bill Dolan, Michel Galley, Jianfeng Gao, Georgios P Spithourakis, and Lucy Vanderwende. 2017. Image-grounded conversations: Multimodal context for natural question and response generation. arXiv preprint arXiv:1701.08251 (2017).",
      "doi": ""
    },
    {
      "text": "Nasrin Mostafazadeh, Ishan Misra, Jacob Devlin, Margaret Mitchell, Xiaodong He, and Lucy Vanderwende. 2016. Image-grounded conversations: Multimodal context for natural question and response generation. Annual Meeting on Association for Computational Linguistics. Association for Computational Linguistics, ACL Z16 (2016).",
      "doi": ""
    },
    {
      "text": "Kishore Papineni, Salim Roukos, Todd Ward, and Wei-Jing Zhu. 2002. BLEU: a method for automatic evaluation of machine translation. In Proceedings of the 40th annual meeting on association for computational linguistics. Association for Computational Linguistics, 311--318.  ",
      "doi": "10.3115/1073083.1073135"
    },
    {
      "text": "Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. GloVe: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532--1543.",
      "doi": ""
    },
    {
      "text": "M. Przybocki, K. Peterson, and S. Bronsart. 2008. Official results of the NIST 2008 Metrics for MAchine TRanslation Challenge. In MetricsMATR08 workshop. http://itl.nist.gov/iad/mig/tests/metricsmatr/2008/",
      "doi": ""
    },
    {
      "text": "Ronald E Riggio. 1992. Social interaction skills and nonverbal behavior. Applications of nonverbal behavioral theories and research (1992), 3--30.",
      "doi": ""
    },
    {
      "text": "Alan Ritter, Colin Cherry, and William B Dolan. 2011. Data-driven response generation in social media. In Proc. of EMNLP. ",
      "doi": "10.5555/2145432.2145500"
    },
    {
      "text": "Iulian V Serban, Alessandro Sordoni, Yoshua Bengio, Aaron Courville, and Joelle Pineau. 2016. Building End-To-End Dialogue Systems Using Generative Hierarchical Neural Network Models. In Proc. of AAAI. ",
      "doi": "10.5555/3016387.3016435"
    },
    {
      "text": "Lifeng Shang, Zhengdong Lu, and Hang Li. 2015. Neural Responding Machine for Short-Text Conversation. In ACL-IJCNLP.",
      "doi": ""
    },
    {
      "text": "Nicole Shechtman and Leonard M Horowitz. 2003. Media inequality in conversation: how people behave differently when interacting with computers and people. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 281--288.  ",
      "doi": "10.1145/642611.642661"
    },
    {
      "text": "Andrew Shin, Yoshitaka Ushiku, and Tatsuya Harada. 2016. Image Captioning with Sentiment Terms via Weakly-Supervised Sentiment Dataset. In BMVC.",
      "doi": ""
    },
    {
      "text": "Alessandro Sordoni, Michel Galley, Michael Auli, Chris Brockett, Yangfeng Ji, Margaret Mitchell, Jian-Yun Nie, Jianfeng Gao, and Bill Dolan. 2015. A neural network approach to context-sensitive generation of conversational responses. In Proc. of NAACL-HLT.",
      "doi": ""
    },
    {
      "text": "Ilya Sutskever, Oriol Vinyals, and Quoc V Le. 2014. Sequence to sequence learning with neural networks. In Advances in neural information processing systems. 3104--3112. ",
      "doi": "10.5555/2969033.2969173"
    },
    {
      "text": "Oriol Vinyals and Quoc Le. 2015. A Neural Conversational Model. In Proc. of ICML Deep Learning Workshop.",
      "doi": ""
    },
    {
      "text": "Marilyn A Walker, Diane J Litman, Candace A Kamm, and Alicia Abella. 1997. PARADISE: A framework for evaluating spoken dialogue agents. In Proceedings of the eighth conference on European chapter of the Association for Computational Linguistics. Association for Computational Linguistics, 271--280.  ",
      "doi": "10.3115/976909.979652"
    },
    {
      "text": "S Weitz. 2014. Meet xiaoice, cortana's little sister. Microsoft,{Online}. Available: https://blogs. bing. com/search/2014/09/05/meet-xiaoicecortanas-littlesister (2014).",
      "doi": ""
    },
    {
      "text": "Tsung-Hsien Wen, Milica Gasic, Nikola Mrkši´ c, Lina M. Rojas Barahona, Pei-Hao Su, Stefan Ultes, David Vandyke, and Steve Young. 2016. Conditional Generation and Snapshot Learning in Neural Dialogue Systems. In EMNLP. ACL, Austin, Texas, 2153--2162. https://aclweb.org/anthology/D16--1233",
      "doi": ""
    },
    {
      "text": "Quanzeng You. 2016. Sentiment and Emotion Analysis for Social Multimedia: Methodologies and Applications. In Proceedings of the 2016 ACM on Multimedia Conference. ACM, 1445--1449.  ",
      "doi": "10.1145/2964284.2971475"
    },
    {
      "text": "Quanzeng You, Hailin Jin, Zhaowen Wang, Chen Fang, and Jiebo Luo. 2016. Image captioning with semantic attention. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 4651--4659.",
      "doi": ""
    },
    {
      "text": "Bolei Zhou, Agata Lapedriza, Jianxiong Xiao, Antonio Torralba, and Aude Oliva. 2014. Learning deep features for scene recognition using places database. In Advances in neural information processing systems. 487--495. ",
      "doi": "10.5555/2968826.2968881"
    }
  ]
}