{
  "doi": "10.1145/3173574.3174101",
  "title": "CraftML: 3D Modeling is Web Programming",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We explore web programming as a new paradigm for programmatic 3D modeling. Most existing approaches subscribe to the imperative programming paradigm. While useful, there exists a gulf of evaluation between procedural steps and the intended structure. We present CraftML, a language providing a declarative syntax where the code is the structure. CraftML offers a rich set of programming features familiar to web developers of all skill levels, such as tags, hyperlinks, document object model, cascade style sheet, JQuery, string interpolation, template engine, data injection, and scalable vector graphics. We develop an online IDE to support CraftML development, with features such as live preview, search, module import, and parameterization. Using examples and case studies, we demonstrate that CraftML offers a low floor for beginners to make simple designs, a high ceiling for experts to build complex computational models, and wide walls to support many application domains such as education, data physicalization, tactile graphics, assistive devices, and mechanical components.",
  "authors": [
    {
      "name": "Tom Yeh",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557134256",
      "orcid": "missing"
    },
    {
      "name": "Jeeeun Kim",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-87959397157/rel-imgonly/me_2020.jpeg",
      "acmid": "87959397157",
      "orcid": "0000-0002-8915-481X"
    }
  ],
  "references": [
    {
      "text": "A-Frame. https://aframe.io/.",
      "doi": ""
    },
    {
      "text": "Autodesk Fusion360. https://www.autodesk.com/products/fusion-360/overview.",
      "doi": ""
    },
    {
      "text": "Autodesk Fusion360 API. https://autodeskfusion360.github.io/.",
      "doi": ""
    },
    {
      "text": "Rhino and Grasshopper Developer Documentation. http://developer.rhino3d.com/.",
      "doi": ""
    },
    {
      "text": "AngularJS. https://angularjs.org/.",
      "doi": ""
    },
    {
      "text": "BlocksCAD. https://www.blockscad3d.com/.",
      "doi": ""
    },
    {
      "text": "Erin Buehler, Stacy Branham, Abdullah Ali, Jeremy J. Chang, Megan Kelly Hofmann, Amy Hurst, and Shaun K. Kane. 2015. Sharing is Caring: Assistive Technology Designs on Thingiverse. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 525--534.  ",
      "doi": "10.1145/2702123.2702525"
    },
    {
      "text": "Xiang 'Anthony' Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 29--39.  ",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Thingiverse Customizer. https://customizer.makerbot.com/.",
      "doi": ""
    },
    {
      "text": "D3. https://d3js.org/.",
      "doi": ""
    },
    {
      "text": "ElasticSearch. https://www.elastic.co/.",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang 'Anthony' Chen, Tom Yeh, Scott E. Hudson, Jennifer Mankoff, and Jeffrey P. Bigham. 2017. Facade: Auto-generating Tactile Interfaces to Appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5826--5838.  ",
      "doi": "10.1145/3025453.3025845"
    },
    {
      "text": "Enabling The Future A Global Network Of Passionate Volunteers Using 3D Printing To Give The World A 'Helping Hand.'. 2017. http://enablingthefuture.org/.",
      "doi": ""
    },
    {
      "text": "Nathaniel Hudson, Celena Alcock, and Parmit K. Chilana. 2016. Understanding Newcomers to 3D Printing: Motivations, Workflows, and Barriers of Casual Makers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 384--396.  ",
      "doi": "10.1145/2858036.2858266"
    },
    {
      "text": "Christopher D. Hundhausen and Jonathan Lee Brown. 2007. An experimental study of the impact of visual semantic feedback on novice programming. Journal of Visual Languages Computing 18, 6 (2007), 537 -- 559.  ",
      "doi": "10.1016/j.jvlc.2006.09.001"
    },
    {
      "text": "Jacek Jankowski, Izabela Irzynska, Bill McDaniel, and Stefan Decker. 2009. 2LIPGarden: 3D Hypermedia for Everyone. In Proceedings of the 20th ACM Conference on Hypertext and Hypermedia (HT '09). ACM, New York, NY, USA, 129--134.  ",
      "doi": "10.1145/1557914.1557938"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3227--3236.  ",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "JQuery. https://jquery.com/.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane and Jeffrey P. Bigham. 2014. Tracking @Stemxcomet: Teaching Programming to Blind Students via 3D Printing, Crisis Management, and Twitter. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (SIGCSE '14). ACM, New York, NY, USA, 247--252.  ",
      "doi": "10.1145/2538862.2538975"
    },
    {
      "text": "Jeeeun Kim, Anhong Guo, Tom Yeh, Scott E. Hudson, and Jennifer Mankoff. 2017. Understanding Uncertainty in Measurement and Accommodating Its Impact in 3D Modeling and Printing. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 1067--1078.  ",
      "doi": "10.1145/3064663.3064690"
    },
    {
      "text": "Ranjitha Kumar, Arvind Satyanarayan, Cesar Torres, Maxine Lim, Salman Ahmad, Scott R. Klemmer, and Jerry O. Talton. 2013. Webzeitgeist: Design Mining the Web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3083--3092.  ",
      "doi": "10.1145/2470654.2466420"
    },
    {
      "text": "Meshmixer. http://www.meshmixer.com/.",
      "doi": ""
    },
    {
      "text": "OpenSCAD The Programmers Solid 3D CAD Modeller. http://www.openscad.org/.",
      "doi": ""
    },
    {
      "text": "Pietro Murano and Dino Mackey. 2007. Usefulness of VRML building models in a direction finding context. Interacting with Computers 19, 3 (2007), 305--313.  ",
      "doi": "10.1016/j.intcom.2007.01.005"
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 639--648.  ",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "OopenJSCAD. https://openjscad.org/.",
      "doi": ""
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. RetroFab: A Design Tool for Retrofitting Physical Interfaces Using Actuators, Sensors and 3D Printing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 409--419.  ",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: Programming for All. Commun. ACM 52, 11 (Nov. 2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Rhinoceros. https://www.rhino3d.com/.",
      "doi": ""
    },
    {
      "text": "RubyScad. https://github.com/cjbissonnette/RubyScad.",
      "doi": ""
    },
    {
      "text": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 3--12.  ",
      "doi": "10.1145/2642918.2647374"
    },
    {
      "text": "SketchUp. https://www.sketchup.com/.",
      "doi": ""
    },
    {
      "text": "Maya: Computer Animation&Modeling Software., Autodesk. https://www.autodesk.com/products/maya/overview.",
      "doi": ""
    },
    {
      "text": "SolidPython. https://github.com/SolidCode/SolidPython.",
      "doi": ""
    },
    {
      "text": "SolidWorks. http://www.solidworks.com/.",
      "doi": ""
    },
    {
      "text": "Abigale Stangl, Chia-Lo Hsu, and Tom Yeh. 2015. Transcribing Across the Senses: Community Efforts to Create 3D Printable Accessible Tactile Pictures for Young Children with Visual Impairments. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers&Accessibility (ASSETS '15). ACM, New York, NY, USA, 127--137.  ",
      "doi": "10.1145/2700648.2809854"
    },
    {
      "text": "Gilbert Tekli, Richard Chbeir, and Jacques Fayolle. 2013. A visual programming language for XML manipulation. Journal of Visual Languages Computing 24, 2 (2013), 110 -- 135.  ",
      "doi": "10.1016/j.jvlc.2012.11.001"
    },
    {
      "text": "TinkerCAD. https://www.tinkercad.com/.",
      "doi": ""
    },
    {
      "text": "Cesar Torres and Eric Paulos. 2015. MetaMorphe: Designing Expressive 3D Models for Digital Fabrication. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, New York, NY, USA, 73--82.  ",
      "doi": "10.1145/2757226.2757235"
    },
    {
      "text": "Yunbo Zhang, Wei Gao, Luis Paredes, and Karthik Ramani. 2016. CardBoardiZer: Creatively Customize, Articulate and Fold 3D Mesh Models. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 897--907.  ",
      "doi": "10.1145/2858036.2858362"
    }
  ]
}