{
  "doi": "10.1145/3173574.3174126",
  "title": "'You Can Always Do Better!\": The Impact of Social Proof on Participant Response Bias",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Evaluations of technological artifacts in HCI4D contexts are known to suffer from high levels of participant response bias---where participants only provide positive feedback that they think will please the researcher. This paper describes a practical, low-cost intervention that uses the concept of social proof to influence participant response bias and successfully elicit critical feedback from study participants. We subtly exposed participants to feedback that they perceived to be provided by people 'like them', and experimentally controlled the tone and content of the feedback to provide either positive, negative, or no social proof. We then measured how participants' quantitative and qualitative evaluations of an HCI artifact changed based on the feedback to which they were exposed. We conducted two controlled experiments: an online experiment with 245 MTurk workers and a field experiment with 63 women in rural India. Our findings reveal significant differences between participants in the positive, negative, and no social proof conditions, both online and in the field. Participants in the negative condition provided lower ratings and a greater amount of critical feedback, while participants in the positive condition provided higher ratings and a greater amount of positive feedback. Taken together, our findings demonstrate that social proof is a practical and generalizable technique that could be used by HCI researchers to influence participant response bias in a wide range of contexts and domains.",
  "authors": [
    {
      "name": "Aditya Vashistha",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    },
    {
      "name": "Fabian Okeke",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658744384",
      "orcid": "missing"
    },
    {
      "name": "Richard Anderson",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371591530",
      "orcid": "0000-0002-7283-7219"
    },
    {
      "name": "Nicola Dell",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486656510",
      "orcid": "0000-0002-6119-705X"
    }
  ],
  "references": [
    {
      "text": "Amazon. 2017. Mechanical Turk. https://www.mturk.com. (2017). {Online; accessed September 10, 2017}.",
      "doi": ""
    },
    {
      "text": "Yaw Anokwa, Thomas N Smyth, Divya Ramachandran, Jahanzeb Sherwani, Yael Schwartzman, Rowena Luk, Melissa Ho, Neema Moraveji, and Brian DeRenzi. 2009. Stories from the field: Reflections on HCI4D experiences. Information Technologies&International Development 5, 4 (2009), pp--101.",
      "doi": ""
    },
    {
      "text": "Diana Baumrind. 1985. Research using intentional deception: ethical issues revisited. American psychologist 40, 2 (1985), 165.",
      "doi": ""
    },
    {
      "text": "Nicola J Bidwell, Thomas Reitmaier, Gary Marsden, and Susan Hansen. 2010. Designing with mobile digital storytelling in rural Africa. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1593--1602.  ",
      "doi": "10.1145/1753326.1753564"
    },
    {
      "text": "Rod Bond and Peter B Smith. 1996. Culture and conformity: A meta-analysis of studies using Asch's (1952b, 1956) line judgment task. Psychological bulletin 119, 1 (1996), 111.",
      "doi": ""
    },
    {
      "text": "Robert M Bond, Christopher J Fariss, Jason J Jones, Adam DI Kramer, Cameron Marlow, Jaime E Settle, and James H Fowler. 2012. A 61-million-person experiment in social influence and political mobilization. Nature 489, 7415 (2012), 295--298.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Stuart Reeves, and Scott Sherwood. 2011. Into the wild: challenges and opportunities for field trial methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1657--1666.  ",
      "doi": "10.1145/1978942.1979185"
    },
    {
      "text": "Moira Burke, Cameron Marlow, and Thomas Lento. 2009. Feed me: motivating newcomer contribution in social network sites. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 945--954.  ",
      "doi": "10.1145/1518701.1518847"
    },
    {
      "text": "Apala Lahiri Chavan. 2005. Another culture, another method. In Proceedings of the 11th International Conference on Human-Computer Interaction, Vol. 21. Erlbaum Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini, Wilhelmina Wosinska, Daniel W Barrett, Jonathan Butner, and Malgorzata Gornik-Durose. 1999. Compliance with a request in two cultures: The differential influence of social proof and commitment/consistency on collectivists and individualists. Personality and Social Psychology Bulletin 25, 10 (1999), 1242--1253.",
      "doi": ""
    },
    {
      "text": "Dan Cosley, Shyong K Lam, Istvan Albert, Joseph A Konstan, and John Riedl. 2003. Is seeing believing?: how recommender system interfaces affect users' opinions. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 585--592.  ",
      "doi": "10.1145/642611.642713"
    },
    {
      "text": "Sauvik Das, Adam DI Kramer, Laura A Dabbish, and Jason I Hong. 2014. Increasing security sensitivity with social proof: A large-scale experimental confirmation. In Proceedings of the 2014 ACM SIGSAC conference on computer and communications security. ACM, 739--749.  ",
      "doi": "10.1145/2660267.2660271"
    },
    {
      "text": "Sauvik Das, Adam DI Kramer, Laura A Dabbish, and Jason I Hong. 2015. The role of social influence in security feature adoption. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing. ACM, 1416--1426.  ",
      "doi": "10.1145/2675133.2675225"
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The ins and outs of HCI for development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2220--2232.  ",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. Yours is better!: participant response bias in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1321--1330.  ",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Morton Deutsch and Harold B Gerard. 1955. A study of normative and informational social influences upon individual judgment. The journal of abnormal and social psychology 51, 3 (1955), 629.",
      "doi": ""
    },
    {
      "text": "Francis J Di Vesta. 1959. Effects of confidence and motivation on susceptibility to informational social influence. The Journal of Abnormal and Social Psychology 59, 2 (1959), 204.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt. 2014. Fostering social capital in economically distressed communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 531--540.  ",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Olive Jean Dunn. 1961. Multiple comparisons among means. J. Amer. Statist. Assoc. 56, 293 (1961), 52--64.",
      "doi": ""
    },
    {
      "text": "Olive Jean Dunn. 1964. Multiple comparisons using rank sums. Technometrics 6, 3 (1964), 241--252.",
      "doi": ""
    },
    {
      "text": "Brittany Fiore-Silfvast, Carl Hartung, Kirti Iyengar, Sharad Iyengar, Kiersten Israel-Ballard, Noah Perin, and Richard Anderson. 2013. Mobile video for patient education: the midwives' perspective. In Proceedings of the 3rd ACM Symposium on Computing for Development. ACM, 2.  ",
      "doi": "10.1145/2442882.2442885"
    },
    {
      "text": "Adrian Furnham. 1986. Response bias, social desirability and dissimulation. Personality and individual differences 7, 3 (1986), 385--400.",
      "doi": ""
    },
    {
      "text": "Mrunal Gawade, Rajan Vaish, Mercy Nduta Waihumbu, and James Davis. 2012. Exploring employment opportunities through microtasks via cybercafes. In Global Humanitarian Technology Conference (GHTC), 2012 IEEE. IEEE, 77--82.  ",
      "doi": "10.1109/GHTC.2012.21"
    },
    {
      "text": "Neha Gupta, David Martin, Benjamin V. Hanrahan, and Jacki O'Neill. 2014. Turk-Life in India. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14). 1--11.  ",
      "doi": "10.1145/2660398.2660403"
    },
    {
      "text": "Ralph Hertwig and Andreas Ortmann. 2008. Deception in experiments: Revisiting the arguments in its defense. Ethics&Behavior 18, 1 (2008), 59--92.",
      "doi": ""
    },
    {
      "text": "Melissa R Ho, Thomas N Smyth, Matthew Kam, and Andy Dearden. 2009. Human-computer interaction for development: The past, present, and future. Information Technologies&International Development 5, 4 (2009), pp--1.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Eytan Adar, and Priti Shah. 2011. The impact of social information on visual judgments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1461--1470.  ",
      "doi": "10.1145/1978942.1979157"
    },
    {
      "text": "Jennifer Hyde, Sara Kiesler, Jessica K Hodgins, and Elizabeth J Carter. 2014. Conversing with children: cartoon and video people elicit similar conversational behaviors. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1787--1796.  ",
      "doi": "10.1145/2556288.2557280"
    },
    {
      "text": "Lilly Irani. 2010. HCI on the move: methods, culture, values. In CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 2939--2942.  ",
      "doi": "10.1145/1753846.1753890"
    },
    {
      "text": "Hee-Tae Jung, Yu-kyong Choe, and Roderic Grupen. 2015. Extended virtual presence of therapists through home service robots. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction Extended Abstracts. ACM, 209--210.  ",
      "doi": "10.1145/2701973.2702709"
    },
    {
      "text": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Steven Komarov, Katharina Reinecke, and Krzysztof Z Gajos. 2013. Crowdsourcing performance evaluations of user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 207--216.  ",
      "doi": "10.1145/2470654.2470684"
    },
    {
      "text": "Peter M. Krafft, Michael Macy, and Alex \"Sandy\" Pentland. 2017. Bots As Virtual Confederates: Design and Ethics. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). 183--190.  ",
      "doi": "10.1145/2998181.2998354"
    },
    {
      "text": "Adam DI Kramer. 2012. The spread of emotion via Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 767--770.  ",
      "doi": "10.1145/2207676.2207787"
    },
    {
      "text": "William H Kruskal and W Allen Wallis. 1952. Use of ranks in one-criterion variance analysis. Journal of the American statistical Association 47, 260 (1952), 583--621.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J Anderson. 2015. Mobile phones for maternal health in rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 427--436.  ",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, and others. 2015. Projecting health: Community-led video education for maternal health. In The International Conference on Information and Communication Technologies and Development. ACM, 17.  ",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Jonathan Ledlie. 2010. Huzzah for my Thing: Evaluating a Pilot of a Mobile Service in Kenya. Qual Meets Quant, London, UK (2010).",
      "doi": ""
    },
    {
      "text": "Rensis Likert. 1932. A technique for the measurement of attitudes. Archives of psychology (1932).",
      "doi": ""
    },
    {
      "text": "Steve Love and Mark Perry. 2004. Dealing with mobile conversations in public places: some implications for the design of socially intrusive technologies. In CHI'04 Extended Abstracts on Human Factors in Computing Systems. ACM, 1195--1198.  ",
      "doi": "10.1145/985921.986022"
    },
    {
      "text": "Meethu Malu, Nikunj Jethi, and Dan Cosley. 2012. Encouraging personal storytelling by example. In Proceedings of the 2012 iConference. ACM, 611--612.  ",
      "doi": "10.1145/2132176.2132309"
    },
    {
      "text": "David Martin, Benjamin V. Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a Turker. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work&Social Computing (CSCW '14). ACM, New York, NY, USA, 224--235.  ",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Indrani Medhi, Aman Sagar, and Kentaro Toyama. 2006. Text-free user interfaces for illiterate and semi-literate users. In Information and Communication Technologies and Development, 2006. ICTD'06. International Conference on. IEEE, 72--82.",
      "doi": ""
    },
    {
      "text": "Tamir Mendel and Eran Toch. 2017. Susceptibility to Social Influence of Privacy Behaviors: Peer versus Authoritative Sources. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 581--593.  ",
      "doi": "10.1145/2998181.2998323"
    },
    {
      "text": "Maletsabisa Molapo, Melissa Densmore, and Limpho Morie. 2016. Apps and Skits: Enabling New Forms of Village-To-Clinic Feedback for Rural Health Education. In Proceedings of the 7th Annual Symposium on Computing for Development. ACM, 10.  ",
      "doi": "10.1145/3001913.3001922"
    },
    {
      "text": "Martin T Orne. 1962. On the social psychology of the psychological experiment: With particular reference to demand characteristics and their implications. American psychologist 17, 11 (1962), 776.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Anandhi Viswanathan, Priyank Chandra, Anisha Nazareth, Vaishnav Kameswaran, Hariharan Subramonyam, Aditya Johri, Mark S Ackerman, and Sile O'Modhrain. 2017. Agency in assistive technology adoption: Visual impairment and smartphone use in Bangalore. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5929--5940.  ",
      "doi": "10.1145/3025453.3025895"
    },
    {
      "text": "Jennifer Pearson, Simon Robinson, Matt Jones, Amit Nanavati, and Nitendra Rajput. 2013. Acqr: acoustic quick response codes for content sharing on low end phones with no internet connectivity. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services. ACM, 308--317.  ",
      "doi": "10.1145/2493190.2493195"
    },
    {
      "text": "Karl Pearson. 1900. On the criterion that a given system of deviations from the probable in the case of a correlated system of variables is such that it can be reasonably supposed to have arisen from random sampling. The London, Edinburgh, and Dublin Philosophical Magazine and Journal of Science 50, 302 (1900), 157--175.",
      "doi": ""
    },
    {
      "text": "D. Raghavarao and W. T. Federer. 1979. Block Total Response as an Alternative to the Randomized Response Method in Surveys. Journal of the Royal Statistical Society. Series B (Methodological) 41, 1 (1979), 40--45.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan and Edward Cutrell. 2012. Understanding negotiation in airtime sharing in low-income microenterprises. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 791--800.  ",
      "doi": "10.1145/2207676.2207791"
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated technology use in developing communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Muzafer Sherif. 1935. A study of some social factors in perception. Archives of Psychology (Columbia University) (1935).",
      "doi": ""
    },
    {
      "text": "Shari Trewin, Diogo Marques, and Tiago Guerreiro. 2015. Usage of Subjective Scales in Accessibility Research. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers&Accessibility. ACM, 59--67.  ",
      "doi": "10.1145/2700648.2809867"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015b. Sangeet Swara: A Community-Moderated Voice Forum in Rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2702123.2702191"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Nicola Dell, and Richard Anderson. 2015c. Social media platforms for low-income blind people in india. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers&Accessibility. ACM, 259--272.  ",
      "doi": "10.1145/2700648.2809858"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, and William Thies. 2015a. Increasing the reach of snowball sampling: The impact of fixed versus lottery incentives. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing. ACM, 1359--1363.  ",
      "doi": "10.1145/2675133.2675148"
    },
    {
      "text": "Aditya Vashistha, Neha Kumar, Anil Mishra, and Richard Anderson. 2016. Mobile Video Dissemination for Community Health. In Proceedings of ICTD.  ",
      "doi": "10.1145/2909609.2909655"
    },
    {
      "text": "Aditya Vashistha, Neha Kumar, Anil Mishra, and Richard Anderson. 2017. Examining Localization Approaches for Community Health. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 357--368.  ",
      "doi": "10.1145/3064663.3064754"
    },
    {
      "text": "S. L. Warner. 1965. Randomized response: a survey technique for eliminating evasive answer bias. J. Amer. Statist. Assoc. 60, 309 (March 1965), 63--66.",
      "doi": ""
    },
    {
      "text": "David Wendler and Franklin G Miller. 2004. Deception in the pursuit of science. Archives of Internal Medicine 164, 6 (2004), 597--600.",
      "doi": ""
    },
    {
      "text": "Niall Winters and Kentaro Toyama. 2009. Human-computer interaction for development: mapping the terrain. Information Technologies&International Development 5, 4 (2009).",
      "doi": ""
    },
    {
      "text": "Fang Wu and Bernardo Huberman. 2008. How public opinion forms. Internet and Network Economics (2008), 334--341.  ",
      "doi": "10.1007/978-3-540-92185-1_39"
    },
    {
      "text": "Susan P Wyche, Sarita Yardi Schoenebeck, and Andrea Forte. 2013. Facebook is a luxury: An exploratory study of social media use in rural Kenya. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 33--44.  ",
      "doi": "10.1145/2441776.2441783"
    }
  ]
}