{
  "doi": "10.1145/3173574.3173932",
  "title": "Capturing, Representing, and Interacting with Laughter",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We investigate a speculative future in which we celebrate happiness by capturing laughter and representing it in tangible forms. We explored technologies for capturing naturally occurring laughter as well as various physical representations of it. For several weeks, our participants collected audio samples of everyday conversations with their loved ones. We processed those samples through a machine learning algorithm and shared the resulting tangible representations (e.g., physical containers and edible displays) with our participants. In collecting, listening to, interacting with, and sharing their laughter with loved ones, participants described both joy in preserving and interacting with laughter and tension in collecting it. This study revealed that the tangibility of laughter representations matters, especially its symbolism and material quality. We discuss design implications of giving permanent forms to laughter and consider the sound of laughter as a part of our personal past that we might seek to preserve and reflect upon.",
  "authors": [
    {
      "name": "Kimiko Ryokai",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100335135/rel-imgonly/kimiko_ryokai.jpg",
      "acmid": "81100335135",
      "orcid": "missing"
    },
    {
      "name": "Elena Durán López",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659184897",
      "orcid": "missing"
    },
    {
      "name": "Noura Howell",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81554353756/rel-imgonly/img_8543_crop-square_web_smaller.jpg",
      "acmid": "81554353756",
      "orcid": "missing"
    },
    {
      "name": "Jon Gillick",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470653032",
      "orcid": "missing"
    },
    {
      "name": "David Bamman",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361599706",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gosse Adema. 2015. 3D Chocolate Printer (made from LEGO). Instructables. Retrieved March 19, 2017 from http://www.instructables.com/id/3D-Chocolate-Printermade-from-LEGO-1/",
      "doi": ""
    },
    {
      "text": "Jo-Anne Bachorowski and Michael J. Owren. 2001. Not All Laughs are Alike: Voiced but Not Unvoiced Laughter Readily Elicits Positive Affect. Psychological Science 12, 3: 252--257.",
      "doi": ""
    },
    {
      "text": "Elizabeth S. Bales and Siân Lindley. 2013. Supporting a sense of connectedness: meaningful things in the lives of new university students. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 11371146.  ",
      "doi": "10.1145/2441776.2441905"
    },
    {
      "text": "Gregory A. Bryant and C. Athena Aktipis. 2014. The animal nature of spontaneous human laughter. Evolution and Human Behavior 35, 4: 327--335.",
      "doi": ""
    },
    {
      "text": "Lina Dib, Daniela Petrelli, and Steve Whittaker. 2010. Sonic souvenirs: exploring the paradoxes of recorded sound for family remembering. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, New York, NY, USA, 391--400.  ",
      "doi": "10.1145/1718918.1718985"
    },
    {
      "text": "Shogo Fukushima, Yuki Hashimoto, Takashi Nozawa, and Hiroyuki Kajimoto. 2010. Laugh enhancer using laugh track synchronized with the user's laugh motion. ACM Press, 3613.  ",
      "doi": "10.1145/1753846.1754027"
    },
    {
      "text": "John J. Godfrey and Edward Holliman. \"Switchboard-1 Release 2.\" Linguistic Data Consortium, Philadelphia 926 (1997): 927.",
      "doi": ""
    },
    {
      "text": "Javier Hernandez, Mohammed (Ehsan) Hoque, Will Drevo, and Rosalind W. Picard. 2012. Mood meter: counting smiles in the wild. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, New York, NY, USA, 301--310.  ",
      "doi": "10.1145/2370216.2370264"
    },
    {
      "text": "Hayley Hung, Gwenn Englebienne, and Jeroen Kools. 2013. Classifying social actions with a single accelerometer. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, New York, NY, USA, 207--210.  ",
      "doi": "10.1145/2493432.2493513"
    },
    {
      "text": "Hiroshi Ishii, Ali Mazalek, and Jay Lee. 2001. Bottles as a minimal interface to access digital information. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, New York, NY, USA, 187--188.  ",
      "doi": "10.1145/634067.634180"
    },
    {
      "text": "Jasmine Jones, David Merritt, and Mark S. Ackerman. 2017. KidKeeper: Design for Capturing Audio Mementos of Everyday Life for Parents of Young Children. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1864--1875.  ",
      "doi": "10.1145/2998181.2998348"
    },
    {
      "text": "Lakshmish Kaushik, Abhijeet Sangwan, and John HL Hansen. \"Laughter and filler detection in naturalistic audio.\" INTERSPEECH. 2015.",
      "doi": ""
    },
    {
      "text": "Rohit Ashok Khot, Ryan Pennings, and Florian \"Floyd\" Mueller. 2015. EdiPulse: Turning Physical Activity Into Chocolates. ACM Press, 331--334.  ",
      "doi": "10.1145/2702613.2725436"
    },
    {
      "text": "Mary Tai Knox and Nikki Mirghafori. \"Automatic laughter detection using neural networks.\" Interspeech. 2007.",
      "doi": ""
    },
    {
      "text": "Hyosun Kwon, Boriana Koleva, Holger Schnädelbach, and Steve Benford. 2017. \"It's Not Yet A Gift\": Understanding Digital Gifting. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 2372--2384.  ",
      "doi": "10.1145/2998181.2998225"
    },
    {
      "text": "Sunmin Lee, (Wynnie) Wing Yi Chung, Emily Ip, and Thecla Schiphorst. 2014. The laughing dress: evoking prosocial interaction among strangers. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 2143--2148.  ",
      "doi": "10.1145/2559206.2581360"
    },
    {
      "text": "Diana L. Mahony, W. Jeffrey Burroughs, and Louis g. Lippman. 2002. Perceived Attributes of HealthPromoting Laughter: A Cross-Generational Comparison. The Journal of Psychology 136, 2: 171-- 181.",
      "doi": ""
    },
    {
      "text": "Maurizio Mancini, Giovanna Varni, Radoslaw Niewiadomski, Gualtiero Volpe, and Antonio Camurri. 2014. How is your laugh today?. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 18551860.  ",
      "doi": "10.1145/2559206.2581205"
    },
    {
      "text": "Katsutoshi Masai, Yuta Sugiura, Katsuhiro Suzuki, Sho Shimamura, Kai Kunze, Masa Ogata, Masahiko Inami, and Maki Sugimoto. 2015. AffectiveWear: towards recognizing affect in real life. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 357--360.  ",
      "doi": "10.1145/2800835.2800898"
    },
    {
      "text": "JA Meerloo. 1966. The biology of laughter. Psychoanalytic review 53, 2: 189--208.",
      "doi": ""
    },
    {
      "text": "Harold G. Nelson and Erik Stolterman (2003). Design Way: Intentional Change in an Unpredictable World. Educational Technology Publications Englewood Cliffs. ",
      "doi": "10.5555/861852"
    },
    {
      "text": "Michael Nunes, Saul Greenberg, and Carman Neustaedter. 2008. Sharing digital photographs in the home through physical mementos, souvenirs, and keepsakes. In Proceedings of the 7th ACM conference on Designing interactive systems (DIS '08). ACM, New York, NY, USA, 250--260.  ",
      "doi": "10.1145/1394445.1394472"
    },
    {
      "text": "William Odom, James Pierce, Erik Stolterman, and Eli Blevis. 2009. Understanding why we preserve some things and discard others in the context of interaction design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1053--1062.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. 2011. Teenagers and their virtual possessions: design opportunities and issues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1491--1500.  ",
      "doi": "10.1145/1978942.1979161"
    },
    {
      "text": "Daniela Petrelli and Steve Whittaker. 2010. Family memories in the home: contrasting physical and digital mementos. Personal Ubiquitous Comput. 14, 2 (February 2010), 153--169.  ",
      "doi": "10.1007/s00779-009-0279-7"
    },
    {
      "text": "Anne Marie Piper, Nadir Weibel, and James Hollan. 2013. Audio-enhanced paper photos: encouraging social interaction at age 105. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 215224.  ",
      "doi": "10.1145/2441776.2441802"
    },
    {
      "text": "Kimiko Ryokai, Elena Duran, Dina Bseiso, Noura Howell, and Ji Won Jun. 2017. Celebrating Laughter: Capturing and Sharing Tangible Representations of Laughter. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (DIS '17 Companion). ACM, New York, NY, USA, 202--206.  ",
      "doi": "10.1145/3064857.3079146"
    },
    {
      "text": "Stefan Scherer, Michael Glodek, Friedhelm Schwenker, Nick Campbell, and Günther Palm. 2012. Spotting laughter in natural multiparty conversations: A comparison of automatic online and offline approaches using audiovisual data. ACM",
      "doi": ""
    },
    {
      "text": "Ayaka Shimasaki and Ryoko Ueoka. 2017. Laugh Log: E-textile Bellyband Interface for Laugh Logging. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 20842089.  ",
      "doi": "10.1145/3027063.3053104"
    },
    {
      "text": "Alex S. Taylor and Richard Harper. 2003. The Gift of the Gab?: A Design Oriented Sociology of Young People's Use of Mobiles. Computer Supported Cooperative Work (CSCW) 12, 3: 267--296.  ",
      "doi": "10.1023/A%3A1025091532662"
    },
    {
      "text": "Hitomi Tsujita and Jun Rekimoto. 2011. HappinessCounter: smile-encouraging appliance to increase positive mood. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 117--126.  ",
      "doi": "10.1145/1979742.1979608"
    },
    {
      "text": "Peter-Paul Verbeek, What Things Do: Philosophical Reflections on Technology, Agency and Design The Pennsylvania State University Press, University Park, Pennsylvania, 2005.",
      "doi": ""
    },
    {
      "text": "Yun Wang, Xiaojuan Ma, Qiong Luo, and Huamin Qu. 2016. Data Edibilization: Representing Data with Food. ACM Press, 409--422.  ",
      "doi": "10.1145/2851581.2892570"
    },
    {
      "text": "Jun Wei, Xiaojuan Ma, and Shengdong Zhao. 2014. Food messaging: using edible medium for social messaging. ACM Press, 2873--2882.  ",
      "doi": "10.1145/2556288.2557026"
    },
    {
      "text": "David West, Aaron Quigley, and Judy Kay. 2007. MEMENTO: a digital-physical scrapbook for memory sharing. Personal Ubiquitous Comput. 11, 4 (April 2007), 313--328.  ",
      "doi": "10.1007/s00779-006-0090-7"
    },
    {
      "text": "Choc Edge: Welcome to the world of 3D chocolate printing! Retrieved March 19, 2017 from http://chocedge.com/",
      "doi": ""
    }
  ]
}