{
  "doi": "10.1145/3173574.3173985",
  "title": "Mechanism Perfboard: An Augmented Reality Environment for Linkage Mechanism Design and Fabrication",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Prototyping devices with kinetic mechanisms, such as automata and robots, has become common in physical computing projects. However, mechanism design in the early-concept exploration phase is challenging, due to the dynamic and unpredictable characteristics of mechanisms. We present Mechanism Perfboard, an augmented reality environment that supports linkage mechanism design and fabrication. It supports the concretization of ideas by generating the initial desired linkage mechanism from a real world movement. The projection of simulated movement within the environment enables iterative tests and modifications in real scale. Augmented information and accompanying tangible parts help users to fabricate mechanisms. Through a user study with 10 participants, we found that Mechanism Perfboard helped the participant to achieve their desired movement. The augmented environment enabled intuitive modification and fabrication with an understanding of mechanical movement. Based on the tool development and the user study, we discuss implications for mechanism prototyping with augmented reality and computational support.",
  "tags": [
    "linkage mechanism",
    "fabrication",
    "computational design",
    "prototyping",
    "augmented reality"
  ],
  "authors": [
    {
      "name": "Yunwoo Jeong",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659079011",
      "orcid": "0000-0002-2000-1524"
    },
    {
      "name": "Han-Jong Kim",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/do/10.1145/contrib-81557460156/rel-imgonly/hanjong.png",
      "acmid": "81557460156",
      "orcid": "missing"
    },
    {
      "name": "Tek-Jin Nam",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100320511",
      "orcid": "0000-0002-7942-0766"
    }
  ],
  "references": [
    {
      "text": "Moritz Bächer, Stelian Coros, and Bernhard Thomaszewski. 2015. LinkEdit: Interactive Linkage Editing Using Symbolic Kinematics. ACM Trans. Graph. 34, 4, Article 99 (July 2015), 8 pages.  ",
      "doi": "10.1145/2766985"
    },
    {
      "text": "Duygu Ceylan, Wilmot Li, Niloy J. Mitra, Maneesh Agrawala, and Mark Pauly. 2013. Designing and Fabricating Mechanical Automata from Mocap Sequences. ACM Trans. Graph. 32, 6, Article 186 (Nov. 2013), 11 pages.  ",
      "doi": "10.1145/2508363.2508400"
    },
    {
      "text": "Jeeyong Chung, Kyungeun Min, and Woohun Lee. 2013. CUBEMENT: Democratizing Mechanical Movement Design. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 81--84.  ",
      "doi": "10.1145/2540930.2540933"
    },
    {
      "text": "Loïc Ciccone, Martin Guay, Maurizio Nitti, and Robert W. Sumner. 2017. Authoring Motion Cycles. In Proceedings of the ACM SIGGRAPH / Eurographics Symposium on Computer Animation (SCA '17). ACM, New York, NY, USA, Article 8, 9 pages.  ",
      "doi": "10.1145/3099564.3099570"
    },
    {
      "text": "Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W. Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational Design of Mechanical Characters. ACM Trans. Graph. 32, 4, Article 83 (July 2013), 12 pages.  ",
      "doi": "10.1145/2461912.2461953"
    },
    {
      "text": "Sean Follmer, David Carr, Emily Lovell, and Hiroshi Ishii. 2010. CopyCAD: Remixing Physical Objects with Copy and Paste from the Real World. In Adjunct Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 381--382.  ",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial Mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 529--539.  ",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Han-Jong Kim, Yunwoo Jeong, Ju-Whan Kim, and Tek-Jin Nam. 2016. M.Sketch: Prototyping Tool for Linkage-Based Mechanism Design. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, New York, NY, USA, 75--77.  ",
      "doi": "10.1145/2984751.2985709"
    },
    {
      "text": "Lego 1932. (1932). https://www.lego.com/en-us/technic.",
      "doi": ""
    },
    {
      "text": "LINKKI 2015. Kinetic Construction Toy. (2015). http://eunyoungpark.co/linkki/.",
      "doi": ""
    },
    {
      "text": "Meccano 1901. Engineering & Robotics. (1901). http://www.meccano.com/.",
      "doi": ""
    },
    {
      "text": "Vittorio Megaro, Bernhard Thomaszewski, Damien Gauge, Eitan Grinspun, Stelian Coros, and Markus Gross. 2014. ChaCra: An Interactive Design System for Rapid Character Crafting. In Proceedings of the ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA '14). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 123--130. http://dl.acm.org/citation.cfm?id=2849517.2849538 ",
      "doi": "10.5555/2849517.2849538"
    },
    {
      "text": "Vittorio Megaro, Jonas Zehnder, Moritz Bächer, Stelian Coros, Markus Gross, and Bernhard Thomaszewski. 2017. A Computational Design Tool for Compliant Mechanisms. ACM Trans. Graph. 36, 4, Article 82 (July 2017), 12 pages.  ",
      "doi": "10.1145/3072959.3073636"
    },
    {
      "text": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014. faBrickation: Fast 3D Printing of Functional Objects by Integrating Construction Kit Building Blocks. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 187--188.  ",
      "doi": "10.1145/2559206.2582209"
    },
    {
      "text": "Hyunjoo Oh, Mark D. Gross, and Michael Eisenberg. 2015. FoldMecha: Design for Linkage-Based Paper Toys. In Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15 Adjunct). ACM, New York, NY, USA, 91--92.  ",
      "doi": "10.1145/2815585.2815734"
    },
    {
      "text": "Leonhard Oschuetz, Daniel Wessolek, and Wolfgang Sattler. 2010. Constructing with Movement: Kinematics. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '10). ACM, New York, NY, USA, 257--260.  ",
      "doi": "10.1145/1709886.1709938"
    },
    {
      "text": "Amanda Parkes, Ivan Poupyrev, and Hiroshi Ishii. 2008. Designing Kinetic Interactions for Organic User Interfaces. Commun. ACM 51, 6 (June 2008), 58--65.  ",
      "doi": "10.1145/1349026.1349039"
    },
    {
      "text": "E J F Primrose, F Freudenstein, and B Roth. 1967. Six-bar motion I. The Watt mechanism. Archive for Rational Mechanics and Analysis 24, 1 (1967), 22--41.",
      "doi": ""
    },
    {
      "text": "Hayes Solos Raffle, Amanda J. Parkes, and Hiroshi Ishii. 2004. Topobo: A Constructive Assembly System with Kinetic Memory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 647--654.  ",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Peter Schmitt and Susanne Seitinger. 2009. Plywood Punk: A Holistic Approach to Designing Animated Artifacts. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM, New York, NY, USA, 123--126.  ",
      "doi": "10.1145/1517664.1517695"
    },
    {
      "text": "Science Box 1982. (June 1982). http://www.jeilscience.co.kr.",
      "doi": ""
    },
    {
      "text": "Bernhard Thomaszewski, Stelian Coros, Damien Gauge, Vittorio Megaro, Eitan Grinspun, and Markus Gross. 2014. Computational Design of Linkage-based Characters. ACM Trans. Graph. 33, 4, Article 64 (July 2014), 9 pages.  ",
      "doi": "10.1145/2601097.2601143"
    },
    {
      "text": "Christian Weichel, Jason Alexander, Abhijit Karnik, and Hans Gellersen. 2015. SPATA: Spatio-Tangible Tools for Fabrication-Aware Design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 189--196.  ",
      "doi": "10.1145/2677199.2680576"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: A Mixed-reality Environment for Personal Fabrication. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3855--3864.  ",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Junichi Yamaoka and Yasuaki Kakehi. 2016. MiragePrinter: Interactive Fabrication on a 3D Printer with a Mid-air Display. In ACM SIGGRAPH 2016 Studio (SIGGRAPH '16). ACM, New York, NY, USA, Article 6, 2 pages.  ",
      "doi": "10.1145/2897839.2927436"
    },
    {
      "text": "Ya-Ting Yue, Xiaolong Zhang, Yongliang Yang, Gang Ren, Yi-King Choi, and Wenping Wang. 2017. WireDraw: 3D Wire Sculpturing Guided with Mixed Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3693--3704.  ",
      "doi": "10.1145/3025453.3025792"
    },
    {
      "text": "Yunbo Zhang, Wei Gao, Luis Paredes, and Karthik Ramani. 2016. CardBoardiZer: Creatively Customize, Articulate and Fold 3D Mesh Models. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 897--907.  ",
      "doi": "10.1145/2858036.2858362"
    },
    {
      "text": "Lifeng Zhu, Weiwei Xu, John Snyder, Yang Liu, Guoping Wang, and Baining Guo. 2012. Motion-guided Mechanical Toy Modeling. ACM Trans. Graph. 31, 6, Article 127 (Nov. 2012), 10 pages.  ",
      "doi": "10.1145/2366145.2366146"
    }
  ]
}