{
  "doi": "10.1145/3173574.3173947",
  "title": "A Critical Examination of Feedback in Early Reading Games",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Learning games now play a role in both formal and informal learning, including foundational skills such as literacy. While feedback is recognised as a key pedagogical dimension of these games, particularly in early learning, there has been no research on how commercial games available to schools and parents reify learning theory into feedback. Using a systematic content analysis, we examine how evidence-based feedback principles manifest in five widely-used learning games designed to foster young children's reading skills. Our findings highlight strengths in how games deliver feedback when players succeed. Many of the games, however, were inconsistent and not proactive when providing error feedback, often promoting trial and error strategies. Furthermore, there was a lack of support for learning the game mechanics and a preference for task-oriented rewards less deeply embedded in the gameplay. Our research provides a design and research agenda for the inclusion of feedback in early learning games.",
  "authors": [
    {
      "name": "Laura Benton",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81484651103/rel-imgonly/profilepic_small.jpg",
      "acmid": "81484651103",
      "orcid": "missing"
    },
    {
      "name": "Asimina Vasalou",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485195",
      "orcid": "missing"
    },
    {
      "name": "Kay Berkling",
      "institution": "Cooperative State University Baden Württemberg, Karlsruhe, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100109829",
      "orcid": "missing"
    },
    {
      "name": "Wolmet Barendregt",
      "institution": "University of Gothenburg, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351591558",
      "orcid": "missing"
    },
    {
      "name": "Manolis Mavrikis",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578301",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "John Hattie and Helen Timperley. 2007. The power of feedback. Review of educational research, 77, 1: 81--112.",
      "doi": ""
    },
    {
      "text": "Teach Your Monster to Read. 2017. About the game. Retrieved 15 September 2017 from https://www.teachyourmonstertoread.com/about-the-game",
      "doi": ""
    },
    {
      "text": "Busy Things. 2017. About Us. Retrieved 15 September 2017 from https://www.busythings.co.uk/about-us",
      "doi": ""
    },
    {
      "text": "S Adkins. 2015. The 2014--2019 Global Edugame Market. Whitepaper, Ambient Insight.",
      "doi": ""
    },
    {
      "text": "Education City. 2017. International Overview. Retrieved 15 September 2017 from http://v1.educationcity.com/uk/international/internationaloverview",
      "doi": ""
    },
    {
      "text": "Sarah Vaala, Anna Ly and Michael H Levine. 2015. Getting a Read on the App Stores: A Market Scan and Analysis of Children's Literacy Apps. Full Report. ERIC.",
      "doi": ""
    },
    {
      "text": "Lori M Takeuchi and Sarah Vaala. 2014. Level up Learning: A National Survey on Teaching with Digital Games. Joan Ganz Cooney Center.",
      "doi": ""
    },
    {
      "text": "Stamatios Papadakis, Michail Kalogiannakis and Nicholas Zaranis. 2017. Designing and creating an educational app rubric for preschool teachers. Education and Information Technologies: 1--19.  ",
      "doi": "10.1007/s10639-017-9579-0"
    },
    {
      "text": "Konstantin Mitgutsch and Narda Alvarado. 2012. Purposeful by Design? A Serious Game Design Assessment Framework. In Proceedings of the International Conference on the foundations of digital games. 121--128.  ",
      "doi": "10.1145/2282338.2282364"
    },
    {
      "text": "Brian M. Winn. 2008. The design, play and experience framework. Handbook of research on effective gaming in education: 1010--1024.",
      "doi": ""
    },
    {
      "text": "Jonas Linderoth. 2012. Why gamers don't learn more: An ecological approach to games as learning environments. Journal of Gaming & Virtual Worlds, 4, 1: 45--62.",
      "doi": ""
    },
    {
      "text": "Nessy. 2017. Nessy Reading & Spelling. Retrieved 15 September 2015 from https://www.nessy.com/uk/product/nessy-reading-spelling/",
      "doi": ""
    },
    {
      "text": "Craig A Lindley and Charlotte C Sennersten. 2006. A cognitive framework for the analysis of game play: tasks, schemas and attention theory. In Proceedings of the Workshop on the cognitive science of games and game play, the 28th annual conference of the cognitive science society.",
      "doi": ""
    },
    {
      "text": "MP Jacob Habgood and Shaaron E Ainsworth. 2011. Motivating children to learn effectively: Exploring the value of intrinsic integration in educational games. The Journal of the Learning Sciences, 20, 2: 169--206.",
      "doi": ""
    },
    {
      "text": "Fonics. 2017. Where children learn to read. Retrieved 15 September 2017 from https://www.readwithfonics.com/",
      "doi": ""
    },
    {
      "text": "Fengfeng Ke. 2016. Designing and integrating purposeful learning in game play: a systematic review. Educational Technology Research and Development, 64, 2: 219--244.",
      "doi": ""
    },
    {
      "text": "Cheryl I Johnson, Shannon KT Bailey and Wendi L Van Buskirk. 2017. Designing Effective Feedback Messages in Serious Games and Simulations: A Research Review. In Instructional Techniques to Facilitate Learning and Motivation of Serious Games Pieter Wouters and Herre Van Oostendorp (eds.). Springer, 119--140.",
      "doi": ""
    },
    {
      "text": "Valerie J Shute. 2008. Focus on formative feedback. Review of educational research, 78, 1: 153--189.",
      "doi": ""
    },
    {
      "text": "John Hattie. 2008. Visible Learning. Routledge.",
      "doi": ""
    },
    {
      "text": "Marc Prensky. 2003. Digital game-based learning. Computers in Entertainment (CIE), 1, 1: 21--21.  ",
      "doi": "10.1145/950566.950596"
    },
    {
      "text": "John AC Hattie and Gregory CR Yates. 2014. Using feedback to promote learning. Acknowledgments and Dedication: 45.",
      "doi": ""
    },
    {
      "text": "Erik Harpstead, Christopher J MacLellan, Vincent Aleven and Brad A Myers. 2014. Using extracted features to inform alignment-driven design ideas in an educational game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 3329--3338.  ",
      "doi": "10.1145/2556288.2557393"
    },
    {
      "text": "Melissa Sommerfeld Gresalfi and Jacqueline Barnes. 2016. Designing feedback in an immersive videogame: supporting student mathematical engagement. Educational Technology Research and Development, 64, 1: 65--86.",
      "doi": ""
    },
    {
      "text": "Pieter Duysburgh, Karin Slegers, Karen Mouws and Marije Nouwen. 2015. Playful Sounds From The Classroom: What Can Designers of Digital Music Games Learn From Formal Educators? In Proceedings of the Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 14671472.  ",
      "doi": "10.1145/2702613.2732832"
    },
    {
      "text": "Laila Shoukry, Christian Sturm and Galal H GalalEdeen. 2015. Pre-MEGa: a proposed framework for the design and evaluation of preschoolers' mobile educational games. In Proceedings of the Innovations and Advances in Computing, Informatics, Systems Sciences, Networking and Engineering. 385--390.",
      "doi": ""
    },
    {
      "text": "Vincent Aleven, Eben Myers, Matthew Easterday and Amy Ogan. 2010. Toward a framework for the analysis and design of educational games. In Proceedings of the Third IEEE International Conference on Digital Game and Intelligent Toy Enhanced Learning (DIGITEL '10). 69--76.  ",
      "doi": "10.1109/DIGITEL.2010.55"
    },
    {
      "text": "John Hattie and Mark Gan. 2011. Instruction based on feedback. In Handbook of research on learning and instruction (eds.). 249--271.",
      "doi": ""
    },
    {
      "text": "Feng Wang and Michael J. Hannafin. 2005. Designbased research and technology-enhanced learning environments. Educational Technology Research and Development, 53: 5--23.",
      "doi": ""
    },
    {
      "text": "Hao Wang and Chuen-Tsai Sun. 2011. Game Reward Systems: Gaming Experiences and Social Meanings. In Proceedings of the Fifth international conference of the Digital Research Association (DIGRA '11).",
      "doi": ""
    },
    {
      "text": "Yvonne Skipper and Karen Douglas. 2012. Is no praise good praise? Effects of positive feedback on children's and university students' responses to subsequent failures. British Journal of Educational Psychology, 82, 2: 327--339.",
      "doi": ""
    },
    {
      "text": "Melissa L Kamins and Carol S Dweck. 1999. Person versus process praise and criticism: implications for contingent self-worth and coping. Developmental psychology, 35, 3: 835.",
      "doi": ""
    },
    {
      "text": "Carol S Dweck. 2000. Self-theories: Their role in motivation, personality, and development. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Li Zhao, Gail D Heyman, Lulu Chen and Kang Lee. 2017. Telling young children they have a reputation for being smart promotes cheating. Developmental Science.",
      "doi": ""
    },
    {
      "text": "Fabienne M van der Kleij, Theo JHM Eggen, Caroline F Timmers and Bernard P Veldkamp. 2012. Effects of feedback in a computer-based assessment for learning. Computers & Education, 58, 1: 263--272.  ",
      "doi": "10.1016/j.compedu.2011.07.020"
    },
    {
      "text": "Richard E Mayer. 2014. Computer games for learning: An evidence-based approach. MIT Press. ",
      "doi": "10.5555/2635971"
    },
    {
      "text": "Roxana Moreno. 2004. Decreasing cognitive load for novice students: Effects of explanatory versus corrective feedback in discovery-based multimedia. Instructional science, 32, 1: 99--113.",
      "doi": ""
    },
    {
      "text": "Richard E Mayer and Cheryl I Johnson. 2010. Adding instructional features that promote learning in a game-like environment. Journal of Educational Computing Research, 42, 3: 241--265.",
      "doi": ""
    },
    {
      "text": "Kristen Pilner Blair. 2013. Learning in critter corral: evaluating three kinds of feedback in a preschool math app. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). 372--375.  ",
      "doi": "10.1145/2485760.2485814"
    },
    {
      "text": "Elizabeth A Boyle, Thomas Hainey, Thomas M Connolly, Grant Gray, Jeffrey Earp, Michela Ott, Theodore Lim, Manuel Ninaus, Claudia Ribeiro and João Pereira. 2016. An update to the systematic literature review of empirical evidence of the impacts and outcomes of computer games and serious games. Computers & Education, 94: 178--192.  ",
      "doi": "10.1016/j.compedu.2015.11.003"
    },
    {
      "text": "Douglas B Clark, Emily E Tanner-Smith and Stephen Killingsworth May. 2013. Digital games for learning: A systematic review and meta-analysis. Menlo Park, CA.",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 1990. Qualitative evaluation and research methods. SAGE Publications, inc.",
      "doi": ""
    },
    {
      "text": "Kathleen Roskos, Jeremy Brueck and Lisa Lenhart. 2017. An analysis of e-book learning platforms: Affordances, architecture, functionality and analytics. International Journal of Child-Computer Interaction, 12: 37--45.  ",
      "doi": "10.1016/j.ijcci.2017.01.003"
    },
    {
      "text": "Matthew Lombard, Jennifer Snyder Duch and Cheryl Campanella Bracken. 2002. Content analysis in mass communication: Assessment and reporting of intercoder reliability. Human communication research, 28, 4: 587--604.",
      "doi": ""
    },
    {
      "text": "Steve Stemler. 2001. An overview of content analysis. Practical assessment, research & evaluation, 7, 17: 137146.",
      "doi": ""
    },
    {
      "text": "Jim Rose. 2009. Identifying and Teaching Children and Young People with Dyslexia and Literacy Difficulties.",
      "doi": ""
    },
    {
      "text": "Sebastian Kelle, Roland Klemke and Marcus Specht. 2011. Design patterns for learning games. International Journal of Technology Enhanced Learning, 3, 6: 555--569.  ",
      "doi": "10.1504/IJTEL.2011.045452"
    },
    {
      "text": "Conor Linehan, Ben Kirman, Shaun Lawson and Gail Chan. 2011. Practical, Appropriate, Empirically-Validated Guidelines for Designing Educational Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). 1979--1986.  ",
      "doi": "10.1145/1978942.1979229"
    },
    {
      "text": "Marc Prensky. 2001. Digital Game-Based Learning. McGraw-Hill. ",
      "doi": "10.5555/1209307"
    },
    {
      "text": "Anna CK Van Duijvenvoorde, Kiki Zanolie, Serge ARB Rombouts, Maartje EJ Raijmakers and Eveline A Crone. 2008. Evaluating the negative or valuing the positive? Neural mechanisms supporting feedback-based learning across development. Journal of Neuroscience, 28, 38: 9495--9503.",
      "doi": ""
    },
    {
      "text": "Jan L Plass, Bruce D. Homer, Charles Kinzer, Jonathan M. Frye and Ken Perlin. 2011. Learning mechanics and assessment mechanics for games for learning. G4LI White Paper, 1: 2011.",
      "doi": ""
    },
    {
      "text": "Asimina Vasalou, Rilla Khaled, Wayne Holmes and Daniel Gooch. 2017. Digital games-based learning for children with dyslexia: A social constructivist perspective on engagement and learning during group game-play. Computers & Education: 175--192.  ",
      "doi": "10.1016/j.compedu.2017.06.009"
    },
    {
      "text": "Matthew Peter Jacob Habgood. 2007. The effective integration of digital games and learning content. University of Nottingham.",
      "doi": ""
    },
    {
      "text": "Deanne M Adams and Douglas B Clark. 2014. Integrating self-explanation functionality into a complex game environment: Keeping gaming in motion. Computers & Education, 73: 149--159.  ",
      "doi": "10.1016/j.compedu.2014.01.002"
    },
    {
      "text": "Andrew K Shenton. 2004. Strategies for ensuring trustworthiness in qualitative research projects. Education for information, 22, 2: 63--75.",
      "doi": ""
    }
  ]
}