{
  "doi": "10.1145/3173574.3173928",
  "title": "SurfaceConstellations: A Modular Hardware Platform for Ad-Hoc Reconfigurable Cross-Device Workspaces",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "We contribute SurfaceConstellations, a modular hardware platform for linking multiple mobile devices to easily create novel cross-device workspace environments. Our platform combines the advantages of multi-monitor workspaces and multi-surface environments with the flexibility and extensibility of more recent cross-device setups. The SurfaceConstellations platform includes a comprehensive library of 3D-printed link modules to connect and arrange tablets into new workspaces, several strategies for designing setups, and a visual configuration tool for automatically generating link modules. We contribute a detailed design space of cross-device workspaces, a technique for capacitive links between tablets for automatic recognition of connected devices, designs of flexible joint connections, detailed explanations of the physical design of 3D printed brackets and support structures, and the design of a web-based tool for creating new SurfaceConstellation setups.",
  "tags": [
    "multi-display environment",
    "reconfigurable workspaces",
    "cross-device interactions",
    "multi surfaces"
  ],
  "authors": [
    {
      "name": "Nicolai Marquardt",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81324491951/rel-imgonly/portraitnic3.jpg",
      "acmid": "81324491951",
      "orcid": "0000-0002-5473-2448"
    },
    {
      "name": "Frederik Brudy",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81502796016/rel-imgonly/photo-square-medium.jpg",
      "acmid": "81502796016",
      "orcid": "missing"
    },
    {
      "name": "Can Liu",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261675",
      "orcid": "missing"
    },
    {
      "name": "Ben Bengler",
      "institution": "IXDS & University College London, Munich , Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82259102557",
      "orcid": "missing"
    },
    {
      "name": "Christian Holz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    }
  ],
  "references": [
    {
      "text": "Rocco Ancona. 2014. The Future of Workplace Productivity: Smart Desks and UltraSharp Monitors. Retrieved September 7, 2017 from https://blog.dell.com/en-us/smart-desks-and-ultrasharp-monitors-are-the-future-of-workplaceproductivity/",
      "doi": ""
    },
    {
      "text": "Jacob T. Biehl and Brian P. Bailey. 2004. ARIS: An Interface for Application Relocation in an Interactive Space. In Proceedings of Graphics Interface 2004 (GI '04), 107--116. ",
      "doi": "10.5555/1006058.1006072"
    },
    {
      "text": "Bloomberg L.P. Bloomberg Professional Services: The Terminal | Hardware. Retrieved from https://www.bloomberg.com/professional/solution/bloomberg-terminal",
      "doi": ""
    },
    {
      "text": "Vannevar Bush. 1945. As We May Think. The Atlantic. Retrieved September 4, 2017 from https://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/",
      "doi": ""
    },
    {
      "text": "Jessica R. Cauchard, Markus Löchtefeld, Pourang Irani, Johannes Schoening, Antonio Krüger, Mike Fraser, and Sriram Subramanian. 2011. Visual Separation in Mobile Multi-display Environments. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11), 451-- 460.  ",
      "doi": "10.1145/2047196.2047256"
    },
    {
      "text": "Liwei Chan, Stefanie Müller, Anne Roudaut, and Patrick Baudisch. 2012. CapStones and ZebraWidgets: Sensing Stacks of Building Blocks, Dials and Sliders on Capacitive Touch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2189--2192.  ",
      "doi": "10.1145/2207676.2208371"
    },
    {
      "text": "Nicholas Chen, Francois Guimbretiere, Morgan Dixon, Cassandra Lewis, and Maneesh Agrawala. 2008. Navigation Techniques for Dual-display e-Book Readers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1779--1788.  ",
      "doi": "10.1145/1357054.1357331"
    },
    {
      "text": "Nicholas Chen, François Guimbretière, and Abigail Sellen. 2013. Graduate Student Use of a Multi-slate Reading System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1799--1808.  ",
      "doi": "10.1145/2470654.2466237"
    },
    {
      "text": "Apoorve Chokshi, Teddy Seyed, Francisco Marinho Rodrigues, and Frank Maurer. 2014. ePlan Multi-Surface: A Multi-Surface Environment for Emergency Response Planning Exercises. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14), 219--228.  ",
      "doi": "10.1145/2669485.2669520"
    },
    {
      "text": "Haeyong Chung, Chris North, Jessica Zeitz Self, Sharon Chu, and Francis Quek. 2014. VisPorter: Facilitating Information Sharing for Collaborative Sensemaking on Multiple Displays. Personal Ubiquitous Comput. 18, 5: 1169--1186.  ",
      "doi": "10.1007/s00779-013-0727-2"
    },
    {
      "text": "David Dearman, Richard Guy, and Khai Truong. 2012. Determining the Orientation of Proximate Mobile Devices Using Their Back Facing Camera. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2231--2234.  ",
      "doi": "10.1145/2207676.2208377"
    },
    {
      "text": "Andreas Dippon, Norbert Wiedermann, and Gudrun Klinker. 2012. Seamless Integration of Mobile Devices into Interactive Surface Environments. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12), 331-- 334.  ",
      "doi": "10.1145/2396636.2396693"
    },
    {
      "text": "Jonathan Grudin. 2001. Partitioning Digital Worlds: Focal and Peripheral Awareness in Multiple Monitor Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01), 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14), 2773--2782.  ",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Harman. Soundcraft Ui24R. Soundcraft - Professional Audio Mixers. Retrieved September 15, 2017 from http://www.soundcraft.com/products/ui24r",
      "doi": ""
    },
    {
      "text": "Ken Hinckley. 2003. Synchronous Gestures for Multiple Persons and Computers. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03), 149--158.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Ken Hinckley, Morgan Dixon, Raman Sarin, Francois Guimbretiere, and Ravin Balakrishnan. 2009. Codex: A Dual Screen Tablet Computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1933--1942.  ",
      "doi": "10.1145/1518701.1518996"
    },
    {
      "text": "Ken Hinckley, Gonzalo Ramos, Francois Guimbretiere, Patrick Baudisch, and Marc Smith. 2004. Stitching: Pen Gestures That Span Multiple Displays. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '04), 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Dugald Ralph Hutchings, John Stasko, and Mary Czerwinski. 2005. Distributed Display Environments. interactions 12, 6: 50--53.  ",
      "doi": "10.1145/1096554.1096592"
    },
    {
      "text": "Shahram Izadi, Harry Brignull, Tom Rodden, Yvonne Rogers, and Mia Underwood. 2003. Dynamo: A Public Interactive Surface Supporting the Cooperative Sharing and Exchange of Media. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03), 159--168.  ",
      "doi": "10.1145/964696.964714"
    },
    {
      "text": "Haojian Jin, Christian Holz, and Kasper Hornbaek. 2015. Tracko: Ad-hoc Mobile 3D Tracking Using Bluetooth Low Energy and Inaudible Signals for Cross-Device Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 147--156.  ",
      "doi": "10.1145/2807442.2807475"
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2015. ExtensionSticker: A Proposal for a Striped Pattern Sticker to Extend Touch Interfaces and Its Assessment. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1851-- 1854.  ",
      "doi": "10.1145/2702123.2702500"
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2016. 3D Printed Physical Interfaces That Can Extend Touch Devices. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct), 47--49.  ",
      "doi": "10.1145/2984751.2985700"
    },
    {
      "text": "Marius Kintel. OpenSCAD. Software for creating solid 3D CAD objects (under GPL v2, https://github.com/openscad/openscad/). Retrieved June 2, 2017 from http://openscad.org",
      "doi": ""
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: Shareable Dynamic Media. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 280-- 290.  ",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Ming Li and Leif Kobbelt. 2012. Dynamic Tiling Display: Building an Interactive Display Surface Using Multiple Mobile Devices. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12), 24:1--24:4.  ",
      "doi": "10.1145/2406367.2406397"
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around: Collaborative Use of Mobile Phones for Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1787--1796.  ",
      "doi": "10.1145/1978942.1979201"
    },
    {
      "text": "MakerBot Industries LLC. Developer Documentation MakerBot Customizer. Retrieved August 22, 2017 from http://customizer.makerbot.com/docs",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt. SurfaceConstellations Github Repository. Retrieved January 1, 2018 from https://github.com/nicmarquardt/surfaceconstellations",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-device Interaction via Micro-mobility and F-formations. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 13--22.  ",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "David Merrill, Jeevan Kalanithi, and Pattie Maes. 2007. Siftables: towards sensor network user interfaces. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (TEI '07), 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Miguel A. Nacenta, Samer Sallam, Bernard Champoux, Sriram Subramanian, and Carl Gutwin. 2006. Perspective Cursor: Perspective-based Interaction for Multi-display Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 289--298.  ",
      "doi": "10.1145/1124772.1124817"
    },
    {
      "text": "NaturalPoint. 2013. Motion Capture Systems by OptiTrack. http://www.optitrack.com/hardware/. Retrieved from http://www.optitrack.com/hardware/",
      "doi": ""
    },
    {
      "text": "Michael Nebeling. 2017. XDBrowser 2.0: Semi-Automatic Generation of Cross-Device Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 4574--4584.  ",
      "doi": "10.1145/3025453.3025547"
    },
    {
      "text": "Michael Nebeling, Maria Husmann, Christoph Zimmerli, Giulio Valente, and Moira C. Norrie. 2015. XDSession: Integrated Development and Testing of Cross-device Applications. In Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '15), 22--27.  ",
      "doi": "10.1145/2774225.2775075"
    },
    {
      "text": "ProtoPlant. Conductive PLA. Retrieved September 10, 2017 from https://www.proto-pasta.com/pages/conductive-pla",
      "doi": ""
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14), 45--54.  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatially-agnostic?: Elicitation and Evaluation of User-Defined Cross-Device Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3913--3922.  ",
      "doi": "10.1145/2702123.2702287"
    },
    {
      "text": "Jun Rekimoto. 1997. Pick-and-drop: A Direct Manipulation Technique For Multiple Computer Environments. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (UIST '97), 31--39.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Jun Rekimoto. 2002. SmartSkin: An Infrastructure for Freehand Manipulation on Interactive Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02), 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Jun Rekimoto and Masanori Saitoh. 1999. Augmented Surfaces: A Spatially Continuous Work Space for Hybrid Computing Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99), 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Dominik Schmidt, Fadi Chehimi, Enrico Rukzio, and Hans Gellersen. 2010. PhoneTouch: a technique for direct phone interaction on surfaces. In Proceedings of the 23nd annual ACM Symposium on User Interface Software and Technology (UIST '10), 13--16.  ",
      "doi": "10.1145/1866029.1866034"
    },
    {
      "text": "Mario Schreiner, Roman Rädle, Hans-Christian Jetter, and Harald Reiterer. 2015. Connichiwa: A Framework for Cross-Device Web Applications. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 2163--2168.  ",
      "doi": "10.1145/2702613.2732909"
    },
    {
      "text": "Julia Schwarz, David Klionsky, Chris Harrison, Paul Dietz, and Andrew Wilson. 2012. Phone As a Pixel: Enabling Ad-hoc, Large-scale Displays Using Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2235--2238.  ",
      "doi": "10.1145/2207676.2208378"
    },
    {
      "text": "Teddy Seyed, Mario Costa Sousa, Frank Maurer, and Anthony Tang. 2013. SkyHunter: A Multi-surface Environment for Supporting Oil and Gas Exploration. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13), 15--22.  ",
      "doi": "10.1145/2512349.2512798"
    },
    {
      "text": "Teddy Seyed, Xing-Dong Yang, and Daniel Vogel. 2016. Doppio: A Reconfigurable Dual-Face Smartwatch for Tangible Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4675--4686.  ",
      "doi": "10.1145/2858036.2858256"
    },
    {
      "text": "Norbert A. Streitz, Jörg Geißler, Torsten Holmer, Shin'ichi Konomi, Christian Müller-Tomfelde, Wolfgang Reischl, Petra Rexroth, Peter Seitz, and Ralf Steinmetz. 1999. i-LAND: An Interactive Landscape for Creativity and Innovation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99), 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Peter Tandler, Thorsten Prante, Christian Müller-Tomfelde, Norbert Streitz, and Ralf Steinmetz. 2001. Connectables: Dynamic Coupling of Displays for the Flexible Creation of Shared Workspaces. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01), 11--20.  ",
      "doi": "10.1145/502348.502351"
    },
    {
      "text": "Simon Voelker, Christian Cherek, Jan Thar, Thorsten Karrer, Christian Thoresen, Kjell Ivar Øvergaard, and Jan Borchers. 2015. PERCs: Persistently Trackable Tangibles on Capacitive Multi-Touch Displays. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 351--356.  ",
      "doi": "10.1145/2807442.2807466"
    },
    {
      "text": "Simon Voelker, Kosuke Nakajima, Christian Thoresen, Yuichi Itoh, Kjell Ivar Øvergaard, and Jan Borchers. 2013. PUCs: Detecting Transparent, Passive Untouched Capacitive Widgets on Unmodified Multitouch Displays. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13), 101--104.  ",
      "doi": "10.1145/2512349.2512791"
    },
    {
      "text": "Colin Ware and Marlon Lewis. 1995. The DragMag Image Magnifier. In Conference Companion on Human Factors in Computing Systems (CHI '95), 407-- 408.  ",
      "doi": "10.1145/223355.223749"
    },
    {
      "text": "Malte Weiss, Simon Voelker, Christine Sutter, and Jan Borchers. 2010. BendDesk: Dragging Across the Curve. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10), 1--10.  ",
      "doi": "10.1145/1936652.1936654"
    },
    {
      "text": "Daniel Wigdor, Hao Jiang, Clifton Forlines, Michelle Borkin, and Chia Shen. 2009. WeSpace: The Design Development and Deployment of a Walk-up and Share Multi-surface Visual Collaboration System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1237--1246.  ",
      "doi": "10.1145/1518701.1518886"
    },
    {
      "text": "Raphael Wimmer, Fabian Hennecke, Florian Schulz, Sebastian Boring, Andreas Butz, and Heinrich Hußmann. 2010. Curve: Revisiting the Digital Desk. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10), 561--570.  ",
      "doi": "10.1145/1868914.1868977"
    },
    {
      "text": "Christian Winkler, Julian Seifert, Christian Reinartz, Pascal Krahmer, and Enrico Rukzio. 2013. Penbook: Bringing Pen+Paper Interaction to a Tablet Device to Facilitate Paper-based Workflows in the Hospital Domain. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13), 283--286.  ",
      "doi": "10.1145/2512349.2512797"
    },
    {
      "text": "Pawel Wozniak, Nitesh Goyal, Przemyslaw Kucharski, Lars Lischke, Sven Mayer, and Morten Fjeld. 2016. RAMPARTS: Supporting Sensemaking with Spatially-Aware Mobile Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 2447--2460.  ",
      "doi": "10.1145/2858036.2858491"
    },
    {
      "text": "Pawel Wozniak, Lars Lischke, Benjamin Schmidt, Shengdong Zhao, and Morten Fjeld. 2014. Thaddeus: A Dual Device Interaction Space for Exploring Information Visualisation. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14), 41--50.  ",
      "doi": "10.1145/2639189.2639237"
    },
    {
      "text": "Neng-Hao Yu, Li-Wei Chan, Seng Yong Lau, SungSheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Fang-I Hsiao, Lung-Pan Cheng, Mike Chen, Polly Huang, and YiPing Hung. 2011. TUIC: Enabling Tangible Interaction on Capacitive Multi-touch Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2995--3004.  ",
      "doi": "10.1145/1978942.1979386"
    },
    {
      "text": "Neng-Hao Yu, Sung-Sheng Tsai, I-Chun Hsiao, DianJe Tsai, Meng-Han Lee, Mike Y. Chen, and Yi-Ping Hung. 2011. Clip-on Gadgets: Expanding Multi-touch Interaction Area with Unpowered Tactile Controls. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11), 367--372.  ",
      "doi": "10.1145/2047196.2047243"
    }
  ]
}