{
  "doi": "10.1145/3173574.3173973",
  "title": "The Application and Its Consequences for Non-Standard Knowledge Work",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Application-centric computing dominates human-computer interactions, yet the concept of an application is ambiguous and the impact of its ubiquity underexplored. We unpack \"the application\" through the lens of non-standard knowledge work: freelance, self-employed, and fixed-term contract workers who create knowledge in collaboration with a wide variety of stakeholders on a per-project basis. Based on interviews with fourteen participants we describe how: i) their economic value is intertwined with data and skills related to specific applications; ii) their access to this value is systematically jeopardised in collaboration due to the different application practices, preferences, and proficiencies of other stakeholders; and iii) they mitigate the costs of this compromise through cross-application collaboration strategies. We trace these experiences to common characteristics of applications, such as update processes, interface symmetries, application-document relationships, and operating system and hardware dependencies. By empirically and analytically focusing on \"the application\", we reveal the implications of the current application-centric computing paradigm and discuss how variations within this model create qualitatively different human-computer interactions.",
  "tags": [
    "application-centric computing",
    "knowledge work",
    "application paradigm",
    "non-standard work"
  ],
  "authors": [
    {
      "name": "Midas Nouwens",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160397",
      "orcid": "missing"
    },
    {
      "name": "Clemens Nylandsted Klokmose",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Eytan Adar, David Karger, and Lynn Andrea Stein. 1999. Haystack: Per-user Information Environments. In Proceedings of the Eighth International Conference on Information and Knowledge Management (CIKM '99). ACM, New York, NY, USA, 413--422.  ",
      "doi": "10.1145/319950.323231"
    },
    {
      "text": "Ali Alkhatib, Michael S. Bernstein, and Margaret Levi. 2017. Examining Crowd Work and Gig Work Through The Historical Lens of Piecework. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4599--4616.  ",
      "doi": "10.1145/3025453.3025974"
    },
    {
      "text": "Jakob Bardram, Jonathan Bunde-Pedersen, and Mads Soegaard. 2006. Support for Activity-based Computing in a Personal Computing Operating System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 211--220.  ",
      "doi": "10.1145/1124772.1124805"
    },
    {
      "text": "Eric A. Bier. 1991. EmbeddedButtons: Documents As User Interfaces. In Proceedings of the 4th Annual ACM Symposium on User Interface Software and Technology (UIST '91). ACM, New York, NY, USA, 45--53.  ",
      "doi": "10.1145/120782.120787"
    },
    {
      "text": "Susanne Bødker. 2006. When Second Wave HCI Meets Third Wave Challenges. In Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles (NordiCHI '06). ACM, New York, NY, USA, 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Richard E. Boyatzis. 1998. Transforming Qualitative Information: Thematic Analysis and Code Development. SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Brown Brown and Kenton O'Hara. 2003. Place as a Practical Concern of Mobile Workers. Environment and Planning A 35, 9 (2003), 1565--1587.",
      "doi": ""
    },
    {
      "text": "Vannevar Bush. 1945. As we may think. Atlantic Monthly 176 (1945), 101--108.",
      "doi": ""
    },
    {
      "text": "European Political Strategy Center. 2016. The Future of Work: Skills and Resilience for a World of Change. Strategic Notes 13 (2016).",
      "doi": ""
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2016. Social Inequality and HCI: The View from Political Economy. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4997--5002.  ",
      "doi": "10.1145/2858036.2858343"
    },
    {
      "text": "Douglas C Engelbart. 1962. Augmenting human intellect: a conceptual framework. Summary Report, Stanford Research Institute, on Contract AF 49(638)-1024 (1962).",
      "doi": ""
    },
    {
      "text": "Douglas C. Engelbart. 1988. Computer-supported Cooperative Work: A Book of Readings. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, Chapter Toward High-performance Knowledge Workers (Reprint), 67--78. http://dl.acm.org/citation.cfm?id=49504.49507 ",
      "doi": "10.5555/49504.49507"
    },
    {
      "text": "Douglas C. Engelbart. 1990. Knowledge-domain Interoperability and an Open Hyperdocument System. In Proceedings of the 1990 ACM Conference on Computer-supported Cooperative Work (CSCW '90). ACM, New York, NY, USA, 143--156.  ",
      "doi": "10.1145/99332.99351"
    },
    {
      "text": "John C Flanagan. 1954. The critical incident technique. Psychological bulletin 51, 4 (1954), 327.",
      "doi": ""
    },
    {
      "text": "Mareike Glöss, Moira McGregor, and Barry Brown. 2016. Designing for Labour: Uber and the On-Demand Mobile Workforce. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1632--1643.  ",
      "doi": "10.1145/2858036.2858476"
    },
    {
      "text": "Bengt Goransson, Mats Lind, Else Pettersson, Bengt Sandblad, and Patrik Schwalbe. 1987. The Interface is Often Not the Problem. In Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface (CHI '87). ACM, New York, NY, USA, 133--136.  ",
      "doi": "10.1145/29933.30872"
    },
    {
      "text": "Mark J. Handel and Steven Poltrock. 2011. Working Around Of?cial Applications: Experiences from a Large Engineering Project. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, New York, NY, USA, 309--312.  ",
      "doi": "10.1145/1958824.1958870"
    },
    {
      "text": "Richard Harper and Abigail Sellen. 1995. Collaborative Tools and the Practicalities of Professional Work at the International Monetary Fund. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 122--129.  ",
      "doi": "10.1145/223904.223920"
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 611--620.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Marina Jirotka, Charlotte P. Lee, and Gary M. Olson. 2013. Supporting Scienti?c Collaboration: Methods, Tools and Concepts. Comput. Supported Coop. Work 22, 4--6 (Aug. 2013), 667--715.  ",
      "doi": "10.1007/s10606-012-9184-0"
    },
    {
      "text": "Jeff Johnson, Teresa L. Roberts, William Verplank, David C. Smith, Charles H. Irby, Marian Beard, and Kevin Mackey. 1989. The Xerox Star: A Retrospective. Computer 22, 9 (Sept. 1989), 11--26, 28--29.  ",
      "doi": "10.1109/2.35211"
    },
    {
      "text": "Victor Kaptelinin and Liam J. Bannon. 2012. Interaction Design Beyond the Product: Creating Technology-Enhanced Activity Spaces. Human-Computer Interaction 27, 3 (2012), 277--309.",
      "doi": ""
    },
    {
      "text": "David Karger. 2007. Haystack: Per-User Information Environments Based on Semistructured Data. In Beyond the Desktop Metaphor: Designing Integrated Digital Work Environments, Victor Kaptelinin and Mary Czerwinski (Eds.). MIT Press, Cambridge, MA, USA, Chapter 3, 49--100.",
      "doi": ""
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: Shareable Dynamic Media. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 280--290.  ",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Henrik Korsgaard, Clemens Nylandsted Klokmose, and Susanne Bødker. 2016. Computational Alternatives in Participatory Design: Putting the T Back in Socio-technical Research. In Proceedings of the 14th Participatory Design Conference: Full Papers - Volume 1 (PDC '16). ACM, New York, NY, USA, 71--79.  ",
      "doi": "10.1145/2940299.2940314"
    },
    {
      "text": "Airi Lampinen and Barry Brown. 2017. Market Design for HCI: Successes and Failures of Peer-to-Peer Exchange Platforms. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4331--4343.  ",
      "doi": "10.1145/3025453.3025515"
    },
    {
      "text": "Irene Mandl, Maurizio Curtarelli, Sara Riso, Oscar Vargas, and Elias Gerogiannis. 2015. New Forms of Employment. Vol. 2. Publications Of?ce of the European Union.",
      "doi": ""
    },
    {
      "text": "David Martin, Benjamin V. Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a Turker. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 224--235.  ",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Charlotte Massey, Thomas Lennig, and Steve Whittaker. 2014. Cloudy Forecast: An Exploration of the Factors Underlying Shared Repository Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2461--2470.  ",
      "doi": "10.1145/2556288.2557042"
    },
    {
      "text": "Manos Matsaganis, Erhan Özdemir, Terry Ward, and Alkistis Zavakou. 2016. Non-Standard Employment and Access to Social Security Bene?ts. Technical Report. Directorate-General for Employment, Social Affairs and Inclusion, European Commission.",
      "doi": ""
    },
    {
      "text": "Michael Muller, David R. Millen, and Jonathan Feinberg. 2010. Patterns of Usage in an Enterprise File-sharing Service: Publicizing, Discovering, and Telling the News. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 763--766.  ",
      "doi": "10.1145/1753326.1753438"
    },
    {
      "text": "Donald A. Norman. 1998. The Invisible Computer. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "OECD. 2015. In It Together: Why Less Inequality Bene?ts All. OECD Publishing, Paris.",
      "doi": ""
    },
    {
      "text": "German Federal Ministry of Labour and Social Affairs. 2015. Green Paper Work 4.0. Strategic Notes (2015).",
      "doi": ""
    },
    {
      "text": "Kurt Piersol. 1994. Under the Hood: A Close-Up of OpenDoc. BYTE 19 (1994), 183--188. http://archive.li/zPfWW",
      "doi": ""
    },
    {
      "text": "Rob Pike and Brian W Kernighan. 1984. The UNIX System: Program Design in the UNIX Environment. AT&T Bell Laboratories Technical Journal 63, 8 (1984), 1595--1605.",
      "doi": ""
    },
    {
      "text": "Jef Raskin. 2000. The Humane Interface: New Directions for Designing Interactive Systems. Addison-Wesley Professional. ",
      "doi": "10.5555/333103"
    },
    {
      "text": "Kjeld Schmidt and Ina Wagner. 2004. Ordering Systems: Coordinative Practices and Artifacts in Architectural Design and Planning. Computer Supported Cooperative Work (CSCW) 13, 5 (01 Dec 2004), 349--408.  ",
      "doi": "10.5555/1045432.1045434"
    },
    {
      "text": "Abigail J. Sellen and Richard H.R. Harper. 2003. The Myth of the Paperless Of?ce. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Abigail J. Sellen, Rachel Murphy, and Kate L. Shaw. 2002. How Knowledge Workers Use the Web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 227--234.  ",
      "doi": "10.1145/503376.503418"
    },
    {
      "text": "Norman Makoto Su and Gloria Mark. 2008. Designing for Nomadic Work. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (DIS '08). ACM, New York, NY, USA, 305--314.  ",
      "doi": "10.1145/1394445.1394478"
    },
    {
      "text": "Rannie Teodoro, Pinar Ozturk, Mor Naaman, Winter Mason, and Janne Lindqvist. 2014. The Motivations and Experiences of the On-demand Mobile Workforce. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 236--247.  ",
      "doi": "10.1145/2531602.2531680"
    },
    {
      "text": "Bill Tomlinson, Joel Ross, Paul Andre, Eric Baumer, Donald Patterson, Joseph Corneli, Martin Mahaux, Syavash Nobarany, Marco Lazzari, Birgit Penzenstadler, Andrew Torrance, David Callele, Gary Olson, Six Silberman, Marcus Stünder, Fabio Romancini Palamedi, Albert Ali Salah, Eric Morrill, Xavier Franch, Florian Floyd Mueller, Joseph 'Jo'sh' Kaye, Rebecca W. Black, Marisa L. Cohn, Patrick C. Shih, Johanna Brewer, Nitesh Goyal, Pirjo Näkki, Jeff Huang, Nilufar Baghaei, and Craig Saper. 2012. Massively Distributed Authorship of Academic Papers. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 11--20.  ",
      "doi": "10.1145/2212776.2212779"
    },
    {
      "text": "Langdon Winner. 1980. Do artifacts have politics? Daedalus (1980), 121--136.",
      "doi": ""
    }
  ]
}