{
  "doi": "10.1145/3173574.3173665",
  "title": "Methods for Evaluation of Imperfect Captioning Tools by Deaf or Hard-of-Hearing Users at Different Reading Literacy Levels",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "As Automatic Speech Recognition (ASR) improves in accuracy, it may become useful for transcribing spoken text in real-time for Deaf and Hard-of-Hearing (DHH) individuals. To quantify users' comprehension and opinion of automatic captions, which inevitably contain some errors, we must identify appropriate methodologies for evaluation studies with DHH users, including quantitative measurement instruments suitable to the various literacy levels among the DHH population. A literature review guided our selection of several probes (e.g. multiple-choice comprehension-question accuracy or response time, scalar-questions about user estimation of ASR errors or their impact, users' numerical estimation of accuracy), which we evaluated in a lab study with DHH users, wherein their literacy levels and the actual accuracy of each caption stimulus were factors. For some probes, participants with lower literacy had more positive subjective responses overall, and, for participants with particular literacy score ranges, some probes were insufficiently sensitive to distinguish between caption accuracy levels.",
  "authors": [
    {
      "name": "Larwan Berke",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659081706",
      "orcid": "missing"
    },
    {
      "name": "Sushant Kafle",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-99659214311/rel-imgonly/img_8680.jpg",
      "acmid": "99659214311",
      "orcid": "missing"
    },
    {
      "name": "Matt Huenerfauth",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-81100240888/rel-imgonly/huenerfauth-matt-headshot-1.jpg",
      "acmid": "81100240888",
      "orcid": "0000-0001-6290-2681"
    }
  ],
  "references": [
    {
      "text": "John Albertini, Connie Mayer. 2011. Using miscue analysis to assess comprehension in deaf college readers. J Deaf Stud Deaf Edu 16, 1 (2011), 35.",
      "doi": ""
    },
    {
      "text": "Larwan Berke, Christopher Caulfield, Matt Huenerfauth. 2017. Deaf and hard-of-hearing perspectives on imperfect automatic speech recognition for captioning one-on-one meetings. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '17). ACM, NY, NY, USA.  ",
      "doi": "10.1145/3132525.3132541"
    },
    {
      "text": "Frank Bowe. 2002. Deaf and hard of hearing Americans' instant messaging and e-mail use: A national survey. American Annals of the Deaf 147, 4 (2002), 6--10.",
      "doi": ""
    },
    {
      "text": "Michael Stinson, Lisa Elliot, Ronald Kelly. 2017. Deaf and hard-of-hearing high school and college students' perceptions of speech-to-text and interpreting/note taking services and motivation. J Dev Phys Disabil, 29, 1, 131--152.",
      "doi": ""
    },
    {
      "text": "Ana-Belen Dominguez, Jesus Alegria. 2010. Reading mechanisms in orally educated deaf adults. Journal of deaf studies and deaf education, 15(2): 136--148.",
      "doi": ""
    },
    {
      "text": "Anita Cremers, Marlies Welbie, Kim Kranenborg, Harriët Wittink. 2017. Deriving guidelines for designing interactive questionnaires for low-literate persons. Universal Access in the Information Society 16, 1, 161-- 172.  ",
      "doi": "10.1007/s10209-015-0431-2"
    },
    {
      "text": "Lisa Elliot, Michael Stinson, James Mallory, Donna Easton, Matt Huenerfauth. 2016. Deaf and hard of hearing individuals' perceptions of communication with hearing colleagues in small groups. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, 271--272.  ",
      "doi": "10.1145/2982142.2982198"
    },
    {
      "text": "Lisa Elliot, Michael Stinson, Barbara McKee, Victoria Everhart, Pamela Francis. 2001. College students' perceptions of the C-Print speech-to-text transcription system. Journal of deaf studies and deaf education 6, 4, 285--298.",
      "doi": ""
    },
    {
      "text": "Jon Fiscus. 2007. Speech recognition scoring toolkit (SCTK). Retrieved July 1, 2017 from http://www.itl.nist.gov/iad/mig/tools/",
      "doi": ""
    },
    {
      "text": "Rudolph Flesch. 1948. A new readability yardstick. Journal of applied psychology 32, 3 (1948), 221--233.",
      "doi": ""
    },
    {
      "text": "Yashesh Gaur, Florian Metze, Yajie Miao, Jeffrey Bigham. 2015. Using keyword spotting to help humans correct captioning faster. In Conf. of Int'l Speech Communication Assoc. (Interspeech'15). 2829--2833.",
      "doi": ""
    },
    {
      "text": "Stephen Gulliver, George Ghinea. 2003. How level and type of deafness affect user perception of multimedia video. Universal Access in the Information Society 2, 4, 374--386.  ",
      "doi": "10.1007/s10209-003-0067-5"
    },
    {
      "text": "Rebecca Perkins Harrington, Gregg Vanderheiden. 2013. Crowd caption correction (ccc). In Proc. Conf. on Computers and Accessibility (ASSETS '13). ACM, NY, NY, USA.  ",
      "doi": "10.1145/2513383.2513413"
    },
    {
      "text": "Xiodong He, Li Deng, Alex Acero. 2011. Why word error rate is not a good metric for speech recognizer training for the speech translation task? In 2011 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). 5632--5635.",
      "doi": ""
    },
    {
      "text": "Ippei Hisaki, Hiroaki Nanjo, Takehiko Yoshimi. 2010. Evaluation of speech balloon captions for auditory information support in small meetings. In Proceedings of 20th International Congress on Acoustics. 3775--3779.",
      "doi": ""
    },
    {
      "text": "Xuedong Huang, James Baker, Raj Reddy. 2014. A historical perspective of speech recognition. Commun. ACM 57, 1, 94--103.  ",
      "doi": "10.1145/2500887"
    },
    {
      "text": "Matt Huenerfauth, Lijun Feng, Noémie Elhadad. 2009. Comparing evaluation techniques for text readability software for adults with intellectual disabilities. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '09). ACM, New York, NY, USA, 3--10.  ",
      "doi": "10.1145/1639642.1639646"
    },
    {
      "text": "Hernisa Kacorri, Matt Huenerfauth, Sarah Ebling, Kasmira Patel, Kellie Menzies, Mackenzie Willard. 2017. Regression analysis of demographic and technologyexperience factors influencing acceptance of sign language animation. ACM Trans. Access. Comput. 10, 1, Article 3 (April 2017), 33 pages.  ",
      "doi": "10.1145/3046787"
    },
    {
      "text": "Sushant Kafle, Matt Huenerfauth. 2016. Effect of speech recognition errors on text understandability for people who are deaf or hard of hearing. In 7th Workshop on Speech and Language Processing for Assistive Technologies (SLPAT). 20--25. http://scholarworks.rit.edu/other/891/",
      "doi": ""
    },
    {
      "text": "Saba Kawas, George Karalis, Tzu Wen, Richard Ladner. 2016. Improving real-time captioning experiences for deaf and hard of hearing students. In Conf. on Computers and Accessibility (ASSETS '16). ACM, NY, USA, 15--23.  ",
      "doi": "10.1145/2982142.2982164"
    },
    {
      "text": "Richard Kheir, Thomas Way. 2007. Inclusion of deaf students in computer science classes using real-time speech transcription. In Proc. of the 12th Annual SIGCSE Conf. on Innovation and Technology in Computer Science Education (ITiCSE '07). ACM, N, NY, USA, 261--265.  ",
      "doi": "10.1145/1268784.1268860"
    },
    {
      "text": "Raja Kushalnagar, Walter Lasecki, Jeffrey Bigham. 2012. A readability evaluation of real-time crowd captions in the classroom. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '12). ACM, NY, NY, USA, 71--78.  ",
      "doi": "10.1145/2384916.2384930"
    },
    {
      "text": "Raja Kushalnagar, Walter Lasecki, Jeffrey Bigham. 2014. Accessibility evaluation of classroom captions. ACM Trans. Access. Comput. 5, 3, Article 7 (Jan. 2014), 24 pp.  ",
      "doi": "10.1145/2543578"
    },
    {
      "text": "Paul Lamere, Philip Kwok, Evandro Gouvea, Bhiksha Raj, Rita Singh, William Walker, Manfred Warmuth, Peter Wolf. 2003. The Carnegie Mellon University SPHINX-4 speech recognition system. In Conf. on Acoustics, Speech and Signal Processing (ICASSP 2003), Vol. 1., 2--5.",
      "doi": ""
    },
    {
      "text": "Seongjae Lee, Sunmee Kang, Hanseok Ko, Minseok Keum. 2013. Dialogue enabling speech-to-text user assistive agent with auditory perceptual beamforming for hearing-impaired. In Proc. of the IEEE International Conference on Consumer Electronics (ICCE). 360--361.",
      "doi": ""
    },
    {
      "text": "Michella Maiorana-Basas, Claudia Pagliaro. 2014. Technology use among adults who are deaf and hard of hearing: a national survey. The Journal of Deaf Studies and Deaf Education 19, 3 (2014), 400--410.",
      "doi": ""
    },
    {
      "text": "Marc Marschark, John Albertini, Harry Lang. 2002. Educating deaf students: from research to practice (1 ed.). Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Marc Marschark, Greg Leigh, Patricia Sapere, Denis Burnham, Carol Convertino, Michael Stinson, Harry Knoors, Mathijs PJ Vervloed, William Noble. 2006. Benefits of sign language interpreting and text alternatives for deaf students' classroom learning. Journal of deaf studies and deaf education 11, 4 (2006), 421--437.",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Scott Carter, Carol Pai, Janette Fong, Jennifer Mankoff. 2006. Scribe4Me: Evaluating a mobile sound transcription tool for the deaf. In Proceedings of the Conference on Ubiquitous Computing. Springer, Berlin, 159--176.  ",
      "doi": "10.1007/11853565_10"
    },
    {
      "text": "Mohammad Reza Mirzaei, Seyed Ghorshi, Mohammad Mortazavi. 2012. Using augmented reality and automatic speech recognition techniques to help deaf and hard of hearing people. In Proceedings of the 2012 virtual reality international conference. ACM, NY, USA, Article 5, 4 pages.  ",
      "doi": "10.1145/2331714.2331720"
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Julie Maitland, Daniel McDonald, Rock Leung, Joanna Lumsden, Hélène Fournier. 2012. Tale of two studies: Challenges in field research with low-literacy adult learners in a developed country. In CHI '12 Extended Abstracts on Human Factors in Computing Systems. ACM, NY, NY, USA, 489--504.  ",
      "doi": "10.1145/2212776.2212825"
    },
    {
      "text": "Mark Neerincx, Anita Cremers, Judith Kessens, David van Leeuwen, Khiet P. Truong. 2009. Attuning speechenabled interfaces to user and context for inclusive design: technology, methodology and practice. Universal Access in the Information Society (UAIS) 8, 2 (2009), 109--122.  ",
      "doi": "10.1007/s10209-008-0136-x"
    },
    {
      "text": "Susan Parault, Heather Williams. 2010. Reading Motivation, Reading Amount, and Text Comprehension in Deaf and Hearing Adults. J Deaf Stud Deaf Edu 15, 2, 120--135.",
      "doi": ""
    },
    {
      "text": "Soraia Silva Prietch, Napoliana Silva de Souza, Lucia Villela Leite Filgueiras. 2015. Application requirements for deaf students to use in inclusive classrooms. In Proc. of the Latin American Conf. on Human Computer Interaction (CLIHC '15). ACM, NY, NY, USA, Article 5, 8 pages.  ",
      "doi": "10.1145/2824893.2824898"
    },
    {
      "text": "Luz Rello, Ricardo Baeza-Yates. 2017. How to present more readable text for people with dyslexia. Univ Access in the Information Society 16, 1 (2017), 29-- 49.  ",
      "doi": "10.1007/s10209-015-0438-8"
    },
    {
      "text": "Horacio Saggion, Sanja Štajner, Stefan Bott, Simon Mille, Luz Rello, Biljana Drndarevic. 2015. Making it simplext: Implementation and evaluation of a text simplification system for Spanish. ACM Trans. Access. Comput. 6, 4, Article 14 (May 2015), 36 pages.  ",
      "doi": "10.1145/2738046"
    },
    {
      "text": "George Saon, Gakuto Kurata, Tom Sercu, Kartik Audhkhasi, Samuel Thomas, Dimitrios Dimitriadis, Xiaodong Cui, Bhuvana Ramabhadran, Michael Picheny, Lynn-Li Lim, Bergul Roomi, Phil Hall. 2017. English conversational telephone speech recognition by humans and machines. CoRR, abs/1703.02136. http://arxiv.org/abs/1703.02136",
      "doi": ""
    },
    {
      "text": "Brent Shiver, Rosalee Wolfe. 2015. Evaluating alternatives for better deaf accessibility to selected webbased multimedia. In Proc. of the 17th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '15). ACM, NY, NY, USA, 223--230.",
      "doi": "10.1145/2700648.2809857"
    },
    {
      "text": "LeAdelle Phelps, Barbara Branyan. 1990. Academic achievement and nonverbal intelligence in public school hearing-impaired children. Psychol Schs, 27, 210--217.",
      "doi": ""
    },
    {
      "text": "Michael Stinson, Lisa Elliot, Ronald Kelly, Yufang Liu. 2009. Deaf and hard-of-hearing students' memory of lectures with speech-to-text and interpreting/note taking services. The Journal of Special Education 43, 1 (2009), 52--64.",
      "doi": ""
    },
    {
      "text": "Dorothy Jackson, Peter Paul, Jonathan C. Smith. 1997. Prior knowledge and reading comprehension ability of deaf adolescents. J Deaf Stud Deaf Edu, 2, 3, 172--84.",
      "doi": ""
    },
    {
      "text": "Mike Wald. 2005. Using automatic speech recognition to enhance education for all students: Turning a vision into reality. In Proc. of Frontiers in Education Conference. S3G-22--25.",
      "doi": ""
    },
    {
      "text": "Wayne Xiong, Jasha Droppo, Xuedong Huang, Frank Seide, Mike Seltzer, Andreas Stolcke, Dong Yu, Geoffrey Zweig. 2016. The Microsoft 2016 conversational speech recognition system. CoRR, abs/1609.03528. http://arxiv.org/abs/1609.03528",
      "doi": ""
    },
    {
      "text": "Walter Lasecki, Christopher Miller, Adam Sadilek, Andrew Abumoussa, Donato Borrello, Raja Kushalnagar, and Jeffrey Bigham. 2012. Real-time captioning by groups of non-experts. In Proceedings User interface software and technology (UIST '12). ACM, NY, USA, 23--34.  ",
      "doi": "10.1145/2380116.2380122"
    },
    {
      "text": "Jon P. Barker, Ricard Marxer, Emmanuel Vincent, Shinji Watanabe. 2017. The CHiME challenges: Robust speech recognition in everyday environments. New Era for Robust Speech Recognition. Springer, Cham, 327--344.",
      "doi": ""
    }
  ]
}