{
  "doi": "10.1145/3173574.3173938",
  "title": "Seemo: A Computational Approach to See Emotions",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Successful human interactions are based on becoming aware of other's emotion and making adaptations accordingly. However, understanding emotion is a complex task that has generated countless debates among researchers over the past decades. The abstract nature of human emotion highlights the need for a new data-driven approach that can better describe and compare across fine-grained emotional states. In this study, we propose Seemo, a novel neural embedding framework, which allows us to map human emotions into vector space representations. Seemo is trained using Twitter data and is evaluated on two fundamental use cases in traditional emotion research: determining the underlying dimensions of emotions and identifying the set of basic emotions. The evaluation reveals that on both tasks Seemo can generate results consistent with the mainstream theories. Results also show that the vector space representation of Seemo can effectively decode the important relationships between emotions that were usually not explicitly presented.",
  "authors": [
    {
      "name": "Zhe Liu",
      "institution": "IBM Research - Almaden, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258932057",
      "orcid": "missing"
    },
    {
      "name": "Anbang Xu",
      "institution": "IBM Research - Almaden, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81542802456",
      "orcid": "missing"
    },
    {
      "name": "Yufan Guo",
      "institution": "IBM Research - Almaden, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161331",
      "orcid": "missing"
    },
    {
      "name": "Jalal U. Mahmud",
      "institution": "IBM Research - Almaden, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319496986",
      "orcid": "missing"
    },
    {
      "name": "Haibin Liu",
      "institution": "IBM Research - Almaden, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261825",
      "orcid": "missing"
    },
    {
      "name": "Rama Akkiraju",
      "institution": "IBM Research - Almaden, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100272227",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Regina Bernhaupt, Andreas Boldt, Thomas Mirlacher, David Wilfinger and Manfred Tscheligi. 2007. Using emotion in games: emotional flowers. In Proceedings of ACE, 41--48.  ",
      "doi": "10.1145/1255047.1255056"
    },
    {
      "text": "Jeffrey T Hancock, Christopher Landrigan and Courtney Silver. 2007. Expressing emotion in textbased communication. In Proceedings of SIGCHI, 929932.  ",
      "doi": "10.1145/1240624.1240764"
    },
    {
      "text": "Katri Salminen, Veikko Surakka, Jani Lylykangas, Jukka Raisamo, Rami Saarinen, Roope Raisamo, Jussi Rantala and Grigori Evreinov. 2008. Emotional and behavioral responses to haptic stimulation. In Proceedings of SIGCHI, 1555--1562.  ",
      "doi": "10.1145/1357054.1357298"
    },
    {
      "text": "James A Russell and Lisa Feldman Barrett. 1999. Core affect, prototypical emotional episodes, and other things called emotion: dissecting the elephant. Journal of personality and social psychology, 76, 5 (1999), 805.",
      "doi": ""
    },
    {
      "text": "Johnny Rj Fontaine, Klaus R Scherer, Etienne B Roesch and Phoebe C Ellsworth. 2007. The world of emotions is not two-dimensional. Psychological science, 18, 12 (2007), 1050--1057.",
      "doi": ""
    },
    {
      "text": "Robert Plutchik. 1980. Emotion: A psychoevolutionary synthesis. Harpercollins College Division.",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 1992. An argument for basic emotions. Cognition & emotion, 6, 3--4 (1992), 169--200.",
      "doi": ""
    },
    {
      "text": "Philip Nicholas Johnson-Laird and Keith Oatley. 1989. The language of emotions: An analysis of a semantic field. Cognition and emotion, 3, 2 (1989), 81--123.",
      "doi": ""
    },
    {
      "text": "Silvan Tomkins. 1962. Affect imagery consciousness: Volume I: The positive affects. Springer.",
      "doi": ""
    },
    {
      "text": "Quoc Le and Tomas Mikolov. 2014. Distributed representations of sentences and documents. In Proceedings of ICML, 1188--1196. ",
      "doi": "10.5555/3044805.3045025"
    },
    {
      "text": "Richard J Gerrig, Philip G Zimbardo, Andrew J Campbell, Steven R Cumming and Fiona J Wilkes. 2015. Psychology and life. Pearson Higher Education.",
      "doi": ""
    },
    {
      "text": "Auke Tellegen. 1985. Structures of mood and personality and their relevance to assessing anxiety, with an emphasis on self-report. Anxiety and the Anxiety Disorders. Erlbaum, Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Wilhelm Max Wundt. 1907. Outlines of psychology. W. Engelmann.",
      "doi": ""
    },
    {
      "text": "Ja Ressel. 1980. A circumplex model of affect. J. Personality and Social Psychology, 39 (1980), 11611178.",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley, Mark K Greenwald, Margaret C Petry and Peter J Lang. 1992. Remembering pictures: Pleasure and arousal in memory. Journal of experimental psychology: Learning, Memory, and Cognition, 18, 2 (1992), 379--390.",
      "doi": ""
    },
    {
      "text": "David Watson and Auke Tellegen. 1985. Toward a consensual structure of mood. Psychological bulletin, 98, 2 (1985), 219.",
      "doi": ""
    },
    {
      "text": "Albert Mehrabian. 1980. Basic Dimensions for a General Psychological Theory Implications for Personality, Social, Environmental, and Developmental Studies. Cambridge: Oelgeschlager, Gunn & Hain, c1980.",
      "doi": ""
    },
    {
      "text": "Andrew Ortony and Terence J Turner. 1990. What's basic about basic emotions? Psychological review, 97, 3 (1990), 315.",
      "doi": ""
    },
    {
      "text": "Carroll E Izard. 1992. Basic emotions, relations among emotions, and emotion-cognition relations. Psychological Review, 99(3), 561--565.",
      "doi": ""
    },
    {
      "text": "Eugene Y Bann and Joanna J Bryson. 2013. The conceptualisation of emotion qualia: Semantic clustering of emotional tweets. In Proceedings of NCPW, 249--263.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, Rogé rio Depaula, Paul Dourish and Phoebe Sengers. 2007. How emotion is made and measured. International Journal of Human-Computer Studies, 65, 4 (2007), 275--291.  ",
      "doi": "10.1016/j.ijhcs.2006.11.016"
    },
    {
      "text": "Klaus R Scherer. 2005. What are emotions? And how can they be measured? Social science information, 44, 4 (2005), 695--729.",
      "doi": ""
    },
    {
      "text": "Vincent Nowlis. 1965. Research with the Mood Adjective Check List. In S. S. Tompkins & C. E. Izard (Eds.), Affect, cognition, and personality: Empirical studies. Oxford, England: Springer.",
      "doi": ""
    },
    {
      "text": "David Watson, Lee A Clark and Auke Tellegen. 1988 Development and validation of brief measures of positive and negative affect: the PANAS scales. Journal of personality and social psychology, 54, 6 (1988), 1063.",
      "doi": ""
    },
    {
      "text": "Carlo Strapparava and Rada Mihalcea. 2008. Learning to identify emotions in text. In Proceedings of SAC, 1556--1560.  ",
      "doi": "10.1145/1363686.1364052"
    },
    {
      "text": "Taner Danisman and Adil Alpkocak. 2008. Feeler: Emotion classification of text using vector space model. In Proceedings of AISB, 53.",
      "doi": ""
    },
    {
      "text": "Alastair J Gill, Robert M French, Darren Gergle and Jon Oberlander. 2008. The language of emotion in short blog texts. In Proceedings of CSCW, 299--302.  ",
      "doi": "10.1145/1460563.1460612"
    },
    {
      "text": "James W Pennebaker, Martha E Francis and Roger J Booth. 2001 Linguistic inquiry and word count: LIWC 2001. Mahway: Lawrence Erlbaum Associates, 71.",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1999. Affective norms for English words (ANEW): Instruction manual and affective ratings. Technical report C-1, the center for research in psychophysiology, University of Florida.",
      "doi": ""
    },
    {
      "text": "Saif M Mohammad, Svetlana Kiritchenko and Xiaodan Zhu. 2013. NRC-Canada: Building the state-of-the-art in sentiment analysis of tweets. In Proceedings of SemEval, 321--327.",
      "doi": ""
    },
    {
      "text": "Ethan Fast, Binbin Chen and Michael S Bernstein. 2016. Empath: Understanding topic signals in largescale text. In Proceedings of SIGCHI, 4647--4657.  ",
      "doi": "10.1145/2858036.2858535"
    },
    {
      "text": "Christian Peter, Russell Beale, Elizabeth Crane and Lesley Axelrod. 2007. Emotion in HCI. In Proceedings of BCS HCI, 211--212. ",
      "doi": "10.5555/1531407.1531471"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts and Eric Horvitz. 2013. Predicting postpartum changes in emotion and behavior via social media. In Proceedings of SIGCHI, 3267--3276.  ",
      "doi": "10.1145/2470654.2466447"
    },
    {
      "text": "Clayton Epp, Michael Lippold and Regan L Mandryk. 2011. Identifying emotional states using keystroke dynamics. In Proceedings of SIGCHI, 715--724.  ",
      "doi": "10.1145/1978942.1979046"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts and Michael Gamon. 2012. Not all moods are created equal! exploring human emotional states in social media. In Proceedings of ICWSM, 66--73.",
      "doi": ""
    },
    {
      "text": "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Proceedings of NIPS, 3111--3119. ",
      "doi": "10.5555/2999792.2999959"
    },
    {
      "text": "Giuseppe Castellucci, Danilo Croce and Roberto Basili. 2015. Acquiring a large scale polarity lexicon through unsupervised distributional methods. In Proceedings of NLDB, 73--86.",
      "doi": ""
    },
    {
      "text": "Maria Giatsoglou, Manolis G Vozalis, Konstantinos Diamantaras, Athena Vakali, George Sarigiannidis and Konstantinos Ch Chatzisavvas. 2017. Sentiment analysis leveraging emotions and word embeddings. Expert Systems with Applications, 69 (2017), 214--224.",
      "doi": ""
    },
    {
      "text": "Qiang Chen, Wenjie Li, Yu Lei, Xule Liu and Yanxiang He. 2015. Learning to Adapt Credible Knowledge in Cross-lingual Sentiment Analysis. In Proceedings of the ACL, 419--429.",
      "doi": ""
    },
    {
      "text": "Zichao Yang, Diyi Yang, Chris Dyer, Xiaodong He, Alexander J Smola and Eduard H Hovy. 2016. Hierarchical Attention Networks for Document Classification. In Proceedings of HLT-NAACL, 14801489.",
      "doi": ""
    },
    {
      "text": "Andrew M Dai, Christopher Olah and Quoc V Le. 2014. Document Embedding with Paragraph Vectors. In Proceedings of the NIPS.",
      "doi": ""
    },
    {
      "text": "Marie-Catherine De Marneffe, Bill Maccartney and Christopher D Manning. 2006. Generating typed dependency parses from phrase structure parses. In Proceedings of LREC, 449--454.",
      "doi": ""
    },
    {
      "text": "Wenbo Wang, Lu Chen, Krishnaprasad Thirunarayan and Amit P Sheth. 2012. Harnessing twitter\" big data\" for automatic emotion identification. In Proceedings of SocialCom, 587--592.  ",
      "doi": "10.1109/SocialCom-PASSAT.2012.119"
    },
    {
      "text": "Radim Rehurek and Petr Sojka. 2010. Software framework for topic modelling with large corpora. In Proceedings of the LREC, 46--50.",
      "doi": ""
    },
    {
      "text": "Burt L Monroe, Michael P Colaresi and Kevin M Quinn. 2008 Fightin'words: Lexical feature selection and evaluation for identifying the content of political conflict. Political Analysis, 16, 4 (2008), 372--403.",
      "doi": ""
    },
    {
      "text": "Supun Nakandala, Giovanni Luca Ciampaglia, Norman Makoto Su and Yong-Yeol Ahn. 2016. Gendered Conversation in a Social Game-Streaming Platform. In Proceedings of ICWSM, 162--171.",
      "doi": ""
    },
    {
      "text": "Beverley Fehr and James A Russell. 1984. Concept of emotion viewed from a prototype perspective. Journal of experimental psychology: General, 113, 3 (1984), 464.",
      "doi": ""
    },
    {
      "text": "Nico H Frijda. 1986. The emotions: Studies in emotion and social interaction. Paris: Maison de Sciences de l'Homme (1986).",
      "doi": ""
    },
    {
      "text": "William James. 1884. What is an emotion? Mind, 9, 34 (1884), 188--205.",
      "doi": ""
    },
    {
      "text": "Ilona Croy, Selda Olgun and Peter Joraschky. 2011. Basic emotions elicited by odors and pictures. Emotion, 11, 6 (2011), 1331.",
      "doi": ""
    },
    {
      "text": "Saif M Mohammad and Peter D Turney. 2013. Crowdsourcing a word--emotion association lexicon. Computational Intelligence, 29, 3 (2013), 436--465.",
      "doi": ""
    }
  ]
}