{
  "doi": "10.1145/3173574.3173889",
  "title": "Let's Talk About Race: Identity, Chatbots, and AI",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Why is it so hard for chatbots to talk about race? This work explores how the biased contents of databases, the syntactic focus of natural language processing, and the opaque nature of deep learning algorithms cause chatbots difficulty in handling race-talk. In each of these areas, the tensions between race and chatbots create new opportunities for people and machines. By making the abstract and disparate qualities of this problem space tangible, we can develop chatbots that are more capable of handling race-talk in its many forms. Our goal is to provide the HCI community with ways to begin addressing the question, how can chatbots handle race-talk in new and improved ways?",
  "tags": [
    "race",
    "chatbots",
    "artificial intelligence"
  ],
  "authors": [
    {
      "name": "Ari Schlesinger",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-99659161054/rel-imgonly/ari_cover_square.png",
      "acmid": "99659161054",
      "orcid": "missing"
    },
    {
      "name": "Kenton P. O'Hara",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615958",
      "orcid": "missing"
    },
    {
      "name": "Alex S. Taylor",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100517358/rel-imgonly/alex_taylor_profile.jpg",
      "acmid": "81100517358",
      "orcid": "0000-0001-6311-3967"
    }
  ],
  "references": [
    {
      "text": "ACM US Policy Council. 2017. Statement on Algorithmic Transparency and Accountability.",
      "doi": ""
    },
    {
      "text": "Sara Ahmed. 2004. Declarations of Whiteness: The Non-Performativity of Anti-Racism. borderlands ejournal 3, 2.",
      "doi": ""
    },
    {
      "text": "Sara Ahmed. 2017. Living a Feminist Life. Duke University Press#.",
      "doi": ""
    },
    {
      "text": "Memo Akten and Mick Grierson. 2016. Real-time interactive sequence generation and control with Recurrent Neural Network ensembles. Neural Information Processing Systems 2016.",
      "doi": ""
    },
    {
      "text": "H. Samy Alim, John R. Rickford, and Arnetha F. Ball (eds.). 2016. Raciolinguistics: How Language Shapes Our Ideas About Race. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "David Alvarez-melis and Tommi S Jaakkola. 2017. A causal framework for explaining the predictions of black-box sequence-to-sequence models. EMNLP 2017.",
      "doi": ""
    },
    {
      "text": "Mike Ananny and Kate Crawford. 2016. Seeing without knowing: Limitations of the transparency ideal and its application to algorithmic accountability. New Media & Society: 1--17.",
      "doi": ""
    },
    {
      "text": "Alyx Baldwin. 2016. The Hidden Dangers of AI for Queer and Trans People. Model View Culture. Retrieved May 25, 2017 from https://modelviewculture.com/pieces/the-hiddendangers-of-ai-for-queer-and-trans-people",
      "doi": ""
    },
    {
      "text": "James Baldwin. 2010. As Much Truth as One Can Bear. In The Cross of Redemption: Uncollected Writings, Randall Kenan (ed.). Pantheon Books, New York.",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2007. Meeting the Universe Halfway. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Jamie Bartlett. 2015. A Life Ruin: Inside the Digital Underworld. Medium. Retrieved September 16, 2017 from https://medium.com/@PRHDigital/a-life-ruininside-the-digital-underworld-590a23b14981",
      "doi": ""
    },
    {
      "text": "Timothy W Bickmore, Laura M Pfeifer, and Brian W Jack. 2009. Taking the Time to Care: Empowering Low Health Literacy Hospital Patients with Virtual Nurse Agents. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1265--1274.  ",
      "doi": "10.1145/1518701.1518891"
    },
    {
      "text": "Marcia Biederman. 2003. At $10 a Year, Automated Buddy Loses Laughs. New York Times.",
      "doi": ""
    },
    {
      "text": "Eduardo Bonilla-Silva. 2002. The Linguistics of Color Blind Racism: How to Talk Nasty about Blacks without Sounding \"Racist.\" Critical Sociology 28, 1--2: 41--64.",
      "doi": ""
    },
    {
      "text": "Danah Boyd and Kate Crawford. 2012. Critical Questions for Big Data. Information, Communication & Society 15, 5: 662--679.",
      "doi": ""
    },
    {
      "text": "Peter Bright. 2016. Tay, the neo-Nazi millennial chatbot, gets autopsied. Ars Technica. Retrieved August 27, 2017 from https://arstechnica.com/informationtechnology/2016/03/tay-the-neo-nazi-millennialchatbot-gets-autopsied/",
      "doi": ""
    },
    {
      "text": "Aylin Caliskan-Islam, Joanna J. Bryson, and Arvind Narayanan. 2016. Semantics derived automatically from language corpora necessarily contain human biases. Science 186, April: 183--186.",
      "doi": ""
    },
    {
      "text": "Rich Caruana, Paul Koch, Yin Lou, Johannes Gehrke, and Marc Sturm. 2015. Intelligible Models for HealthCare?: Predicting Pneumonia Risk and Hospital 30-day Readmission. Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, ACM.  ",
      "doi": "10.1145/2783258.2788613"
    },
    {
      "text": "Stevie Chancellor, Jessica Annette Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. #Thyghgapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, ACM, 1201--1213.  ",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Ethan Chiel. 2016. Who turned Microsoft's chatbot racist? Surprise, it was 4chan and 8chan. Splinter News. Retrieved September 16, 2017 from http://splinternews.com/who-turned-microsoftschatbot-racist-surprise-it-was-1793855848",
      "doi": ""
    },
    {
      "text": "Noam Chomsky. 2002. Syntactic Structures. Mouton de Gruyter, Berlin.",
      "doi": ""
    },
    {
      "text": "Angèle Christin. 2017. Algorithms in practice: Comparing web journalism and criminal justice. Big Data & Society: 1--14.",
      "doi": ""
    },
    {
      "text": "Rodney Coates. 2007. Covert Racism in the U.S. and Globally. Sociology Compass 2, 1: 208231.",
      "doi": ""
    },
    {
      "text": "Beth Coleman. 2009. Race as Technology. Camera Obscura 24, 1.",
      "doi": ""
    },
    {
      "text": "Gregory F Cooper, Vijoy Abraham, Constantin F Aliferis, et al. 2005. Predicting dire outcomes of patients with community acquired pneumonia. 38: 347--366.  ",
      "doi": "10.1016/j.jbi.2005.02.005"
    },
    {
      "text": "Gregory F Cooper, Constantin F Aliferis, Richard Ambrosino, and John Aronis. 1997. An Evaluation of Machine-Learning Methods for Predicting Pneumonia Mortality.",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Ryan Calo. 2016. There is a Blind Spot in AI Research. Nature 538, 7625: 311--313.",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1991. Mapping the Margins: Intersetionality, Identity Politics, and Violence Against Women of Color. Stanford Law Review 43, 6: 1241-- 1299.",
      "doi": ""
    },
    {
      "text": "Gilles Deleuze and Felix Guattari. 1987. A Thousand Plateaus: Capitalism and Schizophrenia. University of Minessota Press, Minneapolis.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos. 2014. Algorithmic Accountability Reporting: On the Investigation of Black Boxes. Columbia University Academic Commons.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt. 2014. Fostering Social Capital in Economically Distressed Communities. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 531--540.  ",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Paul Dourish. 2014. No SQL: The Shifting Materialities of Database Technology. Computational Culture, 4: 1--37.",
      "doi": ""
    },
    {
      "text": "Jacob Eisenstein. 2013. What to do about bad language on the internet. Naacl-Hlt, Association for Computational Linguistics, 359--369.",
      "doi": ""
    },
    {
      "text": "Sheena Erete and Jennifer O Burrell. 2017. Empowered Participation: How Citizens Use Technology in Local Governance. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, 2307--2319.  ",
      "doi": "10.1145/3025453.3025996"
    },
    {
      "text": "Sheena L Erete. 2015. Engaging Around Neighborhood Issues. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15: 1590--1601.  ",
      "doi": "10.1145/2675133.2675182"
    },
    {
      "text": "Dumitru Erhan, Yoshua Bengio, Aaron Courville, Pierre-Antoine Manzagol, Pascal Vincent, and Samy Bengio. 2010. Why does unsupervised pre-training help deep learning? Journal of Machine Learning Research 11, Feb: 625--660. ",
      "doi": "10.5555/1756006.1756025"
    },
    {
      "text": "Mary Jo Foley. 2017. Microsoft launches Ruuh, yet another AI chatbot. ZDNet. Retrieved September 4, 2017 from http://www.zdnet.com/article/microsoftlaunches-ruuh-yet-another-ai-chatbot/",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E Grinter. 2008. EatWell: Sharing Nutritionrelated Memories in a Low-income Community. Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, ACM, 87--96.  ",
      "doi": "10.1145/1460563.1460579"
    },
    {
      "text": "Barbara J Grosz. 2012. What Question Would Turing Pose Today? AI Magazine 33, 4: 73--81.",
      "doi": ""
    },
    {
      "text": "David Hankerson, Andrea R Marshall, Jennifer Booker, Houda El Mimouni, Imani Walker, and Jennifer A Rode. 2016. Does Technology Have Race? Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 473--486.  ",
      "doi": "10.1145/2851581.2892578"
    },
    {
      "text": "Donna Haraway. 1991. A Cyborg Manifesto: Science, Technology, and Socialist-Feminism in the Late Twentieth Century. In Simians, Cyborgs, and Women: The Reinvention of Nature. Routledge, New York, 149--181.",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 1991. Simians, Cyborgs, and Women: The Reinvention of Nature. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 2016. Staying with the Trouble: Making Kin in the Chthulucene. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Kelly M. Hoffman, Sophie Trawalter, Jordan R. Axt, and M. Norman Oliver. 2016. Racial bias in pain assessment and treatment recommendations, and false beliefs about biological differences between blacks and whites. Proceedings of the National Academy of Sciences 113, 16: 4296--4301.",
      "doi": ""
    },
    {
      "text": "bell hooks. 2003. Talking Race and Racism. In Teaching Community: A Pedagogy of HOpe. Routledge, New York, NY, 25--40.",
      "doi": ""
    },
    {
      "text": "Helena Horton. 2016. Microsoft deletes \"teen girl\" AI after it became a Hitler-loving sex robot within 24 hours. The Telegraph. Retrieved August 27, 2017 from http://www.telegraph.co.uk/technology/2016/03/24/mic rosofts-teen-girl-ai-turns-into-a-hitler-loving-sex-robotwit/",
      "doi": ""
    },
    {
      "text": "David Ingold and Spencer Soper. 2016. Amazon Doesn't Consider the Race of Its Customers. Should it? Bloomberg.",
      "doi": ""
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 611--620.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Lilly C Irani and M Six Silberman. 2016. Stories We Tell About Labor: Turkopticon and the Trouble with \"Design.\" Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 4573-- 4586.  ",
      "doi": "10.1145/2858036.2858592"
    },
    {
      "text": "Natasha Jaques, Shixiang Gu, Richard E Turner, and Douglas Eck. 2017. Tuning Recurrent Neural Networks with Reinforcement Learning. ICLR Workshop.",
      "doi": ""
    },
    {
      "text": "Sarah Jeong. 2016. How to Make a Bot That Isn't Racist. Motherboard. Retrieved May 25, 2017 from https://motherboard.vice.com/en_us/article/how-tomake-a-not-racist-bot",
      "doi": ""
    },
    {
      "text": "Daniel Jurafsky and James Martin. 2017. Dialog Systems and Chatbots. In Speech and Language Processing.",
      "doi": ""
    },
    {
      "text": "Daniel S Jurafsky and James H Martin. 2000. Speech and Language Processing: An Introduction to Natural Language Processing, Computational Linguistics, and Speech Recognition. Speech and Language Processing: An Introduction to Natural Language Processing, Computational Linguistics, and Speech Recognition. ",
      "doi": "10.5555/555733"
    },
    {
      "text": "Darius (Dariusk) Kazemi. 2016. wordfilter. npm. Retrieved May 30, 2017 from https://www.npmjs.com/package/wordfilter",
      "doi": ""
    },
    {
      "text": "Zoe Kleinman. 2017. Artificial intelligence: How to avoid racist algorithms. BBC News.",
      "doi": ""
    },
    {
      "text": "David Kushner. 2015. 4chan's Overlord Christopher Poole Reveals Why He Walked Away. Rolling Stone. Retrieved September 16, 2017 from http://www.rollingstone.com/culture/features/4chansoverlord-christopher-poole-reveals-why-he-walkedaway-20150313",
      "doi": ""
    },
    {
      "text": "Jeff Larson, Surya Mattu, Lauren Kirchner, and Julia Angwin. 2016. How We Analyzed the COMPAS Recidivism Algorithm. ProPublica.",
      "doi": ""
    },
    {
      "text": "Lucian Leahu. 2016. Ontological Surprises: A Relational Perspective on Machine Learning. Proceedings of the 2016 ACM Conference on Designing Interactive Systems, ACM, 182--186.  ",
      "doi": "10.1145/2901790.2901840"
    },
    {
      "text": "Heeyoung Lee, Yves Peirsman, Angel Chang, Nathanael Chambers, Mihai Surdeanu, and Dan Jurafsky. 2011. Stanford's Multi-pass Sieve Coreference Resolution System at the CoNLL-2011 Shared Task. Proceedings of the Fifteenth Conference on Computational Natural Language Learning: Shared Task, Association for Computational Linguistics, 28-- 34. ",
      "doi": "10.5555/2132936.2132938"
    },
    {
      "text": "Peter Lee. 2016. Learning from Tay's introduction. Official Microsoft Blog. Retrieved June 1, 2017 from https://blogs.microsoft.com/blog/2016/03/25/learningtaysintroduction/#sm.0000fpjmog51cfpxpwz11olji2ndk",
      "doi": ""
    },
    {
      "text": "Tao Lei, Regina Barzilay, and Tommi Jaakkola. 2016. Rationalizing Neural Predictions. Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, Association for Computational Linguistics, 107--117.",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16: 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Mitchell P. Marcus, Beatrice Santorini, Mary Ann Marcinkiewicz, and Ann Taylor. 1999. Treebank-3 LDC99T42. Philadelphia: Linguistic Data Consortium. Retrieved from https://catalog.ldc.upenn.edu/ldc99t42",
      "doi": ""
    },
    {
      "text": "Mark C. Marino. 2006. I, Chatbot: The Gender and Race Performativity of Conversational Agents.",
      "doi": ""
    },
    {
      "text": "Mark C. Marino. 2014. The Racial Formation of Chatbots. CLCWeb: Comparative Literature and Culture 16, 5.",
      "doi": ""
    },
    {
      "text": "Tara McPherson. 2011. US Operating Systems at MidCentury: The Intertwining of Race and UNIX. Race After the Internet.",
      "doi": ""
    },
    {
      "text": "Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient estimation of word representations in vector space. ICLR Workshop.",
      "doi": ""
    },
    {
      "text": "Lisa Nakamura. 1995. Race In/For Cyberspace: Identity Tourism and Racial Passing on the Internet. Works and Days 13: 181--193.",
      "doi": ""
    },
    {
      "text": "Gloria Naylor. 1986. The Meanings of a Word.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos, Sorelle Friedler, Marcelo Arenas, et al. Principles for Accountable Algorithms and a Social Impact Statement for Algorithms. FAT/ML. Retrieved June 15, 2017 from http://www.fatml.org/resources/principles-foraccountable-algorithms",
      "doi": ""
    },
    {
      "text": "Sarah Perez. 2016. Microsoft silences its new A.I. bot Tay, after Twitter users teach it racism. Tech Crunch. Retrieved August 27, 2017 from https://techcrunch.com/2016/03/24/microsoft-silencesits-new-a-i-bot-tay-after-twitter-users-teach-it-racism/",
      "doi": ""
    },
    {
      "text": "Derek Powazek. 2013. What online communities can learn from twitter's \"block\" blunder. Wired Magazine. Retrieved June 5, 2017 from https://www.wired.com/2013/12/twitter-blockingpolicy/",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Margaret Echelbarger, and Justine Cassell. 2011. Brick by Brick: Iterating Interventions to Bridge the Achievement Gap with Virtual Peers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2971--2974.  ",
      "doi": "10.1145/1978942.1979382"
    },
    {
      "text": "Stuart Russell and Peter Norvig. 1995. Artificial Intelligence: A Modern Approach. Prentice-Hall, Englewood Cliffs, New Jersey. ",
      "doi": "10.5555/193191"
    },
    {
      "text": "Saiph Savage, Andres Monroy-Hernandez, and Tobias Höllerer. 2016. Botivist: Calling Volunteers to Action Using Online Bots. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, ACM, 813--822.  ",
      "doi": "10.1145/2818048.2819985"
    },
    {
      "text": "Ari Schlesinger, W Keith Edwards, and Rebecca E Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, 5412-- 5427.  ",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "M Six Silberman, Lilly Irani, and Joel Ross. 2010. Ethics and Tactics of Professional Crowdwork. XRDS 17, 2: 39--43.  ",
      "doi": "10.1145/1869086.1869100"
    },
    {
      "text": "Caroline Sinders. 2016. Microsoft's Tay is an Example of Bad Design. Medium. Retrieved August 27, 2017 from https://medium.com/@carolinesinders/microsofts-tay-is-an-example-of-bad-design-d4e65bb2569f",
      "doi": ""
    },
    {
      "text": "Latanya Sweeney. Discrimination in Online Ad Delivery.",
      "doi": ""
    },
    {
      "text": "Alex S Taylor. 2009. Machine Intelligence. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2109--2118.  ",
      "doi": "10.1145/1518701.1519022"
    },
    {
      "text": "Zeynep Tufekci. 2015. Algorithmic Harms beyond Facebook and Google: Emergent Challenges of Computational Agency. Journal of Telecommunications and High Technology Law 90: 203--218.",
      "doi": ""
    },
    {
      "text": "Alan M Turing. 1950. Computing machinery and intelligence. Mind 59, 236: 433--460.",
      "doi": ""
    },
    {
      "text": "James Vincent. 2017. Transgender YouTubers had their videos grabbed to train facial recognition software. The Verge.",
      "doi": ""
    },
    {
      "text": "Joseph Weizenbaum. 1966. ELIZA-A Computer Program for the Study of Natural Language Communication Between Man and Machine. Commun. ACM 9, 1: 36--45.  ",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Kevine A. Whitehead. 2009. \"Categorizing the Categorizer\": The Management of Racial Common Sense in Interaction. Social Psychology Quarterly 72, 4: 325--342.",
      "doi": ""
    },
    {
      "text": "Keving A. Whitehead and Gene H. Lerner. 2009. When are persons \"white\"?: on some practical asymmetries of racial reference in talk-in- interaction. Discourse & Society 20, 5: 613--641.",
      "doi": ""
    },
    {
      "text": "Langdon Winner. 1980. Do Artifacts Have Politics? Daedalus 109, 1: 121--136.",
      "doi": ""
    },
    {
      "text": "Jun Xiao, John Stasko, and Richard Catrambone. 2007. The Role of Choice and Customization on Users' Interaction with Embodied Conversational Agents: Effects on Perception and Performance. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1293--1302.  ",
      "doi": "10.1145/1240624.1240820"
    },
    {
      "text": "Qianli Xu, Liyuan Li, and Gang Wang. 2013. Designing Engagement-aware Agents for Multiparty Conversations. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2233--2242.  ",
      "doi": "10.1145/2470654.2481308"
    },
    {
      "text": "Zhao Yan, Nan Duan, Jun-Wei Bao, et al. 2016. DocChat: An Information Retrieval Approach for Chatbot Engines Using Unstructured Documents. ACL (1).",
      "doi": ""
    },
    {
      "text": "Microsoft Bot Framework. Microsoft. Retrieved August 10, 2017 from https://dev.botframework.com/",
      "doi": ""
    },
    {
      "text": "IBM Watson. IBM. Retrieved August 10, 2017 from https://www.ibm.com/watson/",
      "doi": ""
    },
    {
      "text": "A Tribe Called Red. Tribal Spirit Music. Retrieved from https://tribalspiritmusic.com/artists/a-tribe-calledred/",
      "doi": ""
    },
    {
      "text": "2016. Tay AI. Know Your Meme. Retrieved June 1, 2017 from https://blogs.microsoft.com/blog/2016/03/25/learningtaysintroduction/#sm.0000fpjmog51cfpxpwz11olji2ndk",
      "doi": ""
    }
  ]
}