{
  "doi": "10.1145/3173574.3173886",
  "title": "Going the Distance: Trust Work for Citizen Participation",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Trust is a vital component of citizen participation-whether citizens decide to engage in opportunities for participation in local government can hinge entirely on the existence of trust between citizens and public officials. Understanding the role of trust in this space is vital for HCI and the growing area of Digital Civics which works to improve or create new modes of citizen participation. Currently, however, trust is understudied from the perspectives of public officials. This gap creates a critical blind spot as technical interventions may be mismatched to the ways trust is put into action by public officials working to support citizen participation. We begin to address this gap by presenting a broad qualitative study of how public officials in a large US city operationalize trust in citizen participation. We found trust is enacted through ongoing practices that man-age distance in relationships between public officials and city residents.",
  "authors": [
    {
      "name": "Eric Corbett",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068033",
      "orcid": "missing"
    },
    {
      "name": "Christopher A. Le Dantec",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81367592039/rel-imgonly/le_dantec_-_light_-_small.jpg",
      "acmid": "81367592039",
      "orcid": "0000-0001-8338-4852"
    }
  ],
  "references": [
    {
      "text": "Sherry R. Arnstein. 1969. A Ladder Of Citizen Participation. Journal of the American Institute of Planners 35, 4: 216--224.",
      "doi": ""
    },
    {
      "text": "Mariam Asad and Christopher a. Le Dantec. 2015. Illegitimate civic participation: supporting community activists on the ground. Cscw 2015: 1694--1703.  ",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Mariam Asad, Christopher A. Le Dantec, Becky Nielsen, and Kate Diedrick. 2017. Creating a Sociotechnical API. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems CHI '17, 2295--2306.  ",
      "doi": "10.1145/3025453.3025963"
    },
    {
      "text": "Bernard Barber and Diego Gambetta. 1992. Trust: Making and Breaking Cooperative Relations. Contemporary Sociology 21, 401.",
      "doi": ""
    },
    {
      "text": "Ulrich Beck. 1992. Risk society: Towards a new modernity. Sage.",
      "doi": ""
    },
    {
      "text": "Theodore Lewis Becker and Christa Daryl Slaton. 2000. The future of teledemocracy. Greenwood Publishing Group.",
      "doi": ""
    },
    {
      "text": "Morten Bohøj, Nikolaj G Borchorst, Susanne Bødker, Matthias Korn, and Pär-ola Zander. 2011. Public deliberation in municipal planning: Supporting Action and Reflection with Mobile Technology. Proceedings of the 5th International Conference on Communities and Technologies - C&T '11, July: 88.  ",
      "doi": "10.1145/2103354.2103367"
    },
    {
      "text": "a. Borning, B. Friedman, Janet L. Davis, and P. Lin. 2005. Informing Public Deliberation?: Value Sensitive Design of Indicators for a Large-Scale Urban Simulation. Proceedings of the ECSCW 2005 European Conference on Computer-Supported Cooperative Work, September: 449--468. ",
      "doi": "10.5555/1242029.1242052"
    },
    {
      "text": "Valerie Braithwaite and Margaret Levi. 2003. Trust and governance. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Aurélien Buffat. 2015. Street-Level Bureaucracy and EGovernment. Public Management Review 17, 1: 149-- 161.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2015. Beyond Distrust: How Americans View Their Government.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. Sage.",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec. 2014. The Right Way to Make Cities Smart. The Atlantic, 1--5.",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec, Mariam Asad, Aditi Misra, and Kari E Watkins. 2015. Planning with Crowdsourced Data. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15: 1717--1727.  ",
      "doi": "10.1145/2675133.2675212"
    },
    {
      "text": "Christopher A Le Dantec. 2016. Designing Publics. MIT Press. ",
      "doi": "10.5555/3100000"
    },
    {
      "text": "Christopher a Le Dantec and W Keith Edwards. 2010. Across Boundaries of Influence and Accountability: The Multiple Scales of Public Sector Information Systems. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 113--122.  ",
      "doi": "10.1145/1753326.1753345"
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial design. The MIT Press. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Sheena Erete and Jennifer O Burrell. 2017. Empowered Participation: How Citizens Use Technology in Local Governance. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17: 2307--2319.  ",
      "doi": "10.1145/3025453.3025996"
    },
    {
      "text": "Sheena Lewis Erete. 2012. Crime prevention technologies in low-income communities. XRDS: Crossroads, The ACM Magazine for Students 19, 2: 24.  ",
      "doi": "10.1145/2382856.2382867"
    },
    {
      "text": "Titiana Ertiö. 2013. M-participation?: the emergence of participatory planning applications. Research Briefings.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi. 2008. The product ecology: Understanding social product use and supporting design culture. International Journal of Design 2, 1.",
      "doi": ""
    },
    {
      "text": "Francis Fukuyama. 1995. Trust: The social virtues and the creation of prosperity. Free Press Paperbacks.",
      "doi": ""
    },
    {
      "text": "Diego Gambetta. 1988. Trust: Making and breaking cooperative relations.",
      "doi": ""
    },
    {
      "text": "J Ramon Gil-garcia, Theresa A Pardo, and Armando Aldama-nalda. 2013. Smart Cities and Smart Governments?: Using Information Technologies to address Urban Challenges. 296--297.  ",
      "doi": "10.1145/2479724.2479728"
    },
    {
      "text": "Shaun Goldfinch, Robin Gauld, and Peter Herbison. 2009. The participation divide? political participation, trust in government, and E-government in Australia and New Zealand. Australian Journal of Public Administration 68, 3: 333--350.",
      "doi": ""
    },
    {
      "text": "Eric Gordon, Steven Schirra, and Justin Hollander. 2011. Immersive planning: A conceptual model for designing public participation with new technologies. Environment and Planning B: Planning and Design 38, 3: 505--519.",
      "doi": ""
    },
    {
      "text": "Eric Gordon and Stephen Walter. 2016. Meaningful Inefficiencies: Resisting the Logic of Technological Efficiency in the Design of Civic Systems. Civic Media: Technology, Design, Practice: 243.",
      "doi": ""
    },
    {
      "text": "Kenneth L Hacker and Jan van Dijk. 2000. Digital democracy: Issues of theory and practice. Sage. ",
      "doi": "10.5555/558450"
    },
    {
      "text": "Russell Hardin. 1999. Do we want trust in government? Democracy and trust: 22--41.",
      "doi": ""
    },
    {
      "text": "Mike Harding, Bran Knowles, Nigel Davies, and Mark Rouncefield. 2015. HCI, Civic Engagement & Trust. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15: 2833-- 2842.  ",
      "doi": "10.1145/2702123.2702255"
    },
    {
      "text": "D. Harrison McKnight and Norman L. Chervany. 2001. Trust and Distrust Definitions: One Bite at a Time.. Springer, Berlin, Heidelberg, 27--54.",
      "doi": ""
    },
    {
      "text": "David Held. 2006. Models of democracy. Polity.",
      "doi": ""
    },
    {
      "text": "Steven J Jackson and Laewoo Kang. 2014. Breakdown, obsolescence and reuse: HCI and the art of repair. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 449--458.  ",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "Jonghyuk Jung, Eun-young Ko Songyi, Han Chang, Won Lee, Juho Kim, and Jihee Kim. 2016. BudgetMap?: Engaging Taxpayers in the Issue-Driven Classification of a Government Budget. 1028--1039.  ",
      "doi": "10.1145/2818048.2820004"
    },
    {
      "text": "Juho Kim, Eun-young Ko, Jonghyuk Jung, Chang Won Lee, Nam Wook Kim, and Jihee Kim. 2015. Factful: Engaging Taxpayers in the Public Discussion of a Government Budget. Proceedings of the ACM CHI'15 Conference on Human Factors in Computing Systems 1: 2843--2852.  ",
      "doi": "10.1145/2702123.2702352"
    },
    {
      "text": "Rob Kling. 1978. Design of information systems. 666-- 674.",
      "doi": ""
    },
    {
      "text": "Rob Kling. 1996. Computerization and controversy: value conflicts and social choices. Morgan Kaufmann. ",
      "doi": "10.5555/233372"
    },
    {
      "text": "Bran Knowles, Mike Harding, Lynne Blair, Nigel Davies, James Hannon, Mark Rouncefield, and John Walden. 2014. Trustworthy by design. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14: 1060--1071.  ",
      "doi": "10.1145/2531602.2531699"
    },
    {
      "text": "Bran Knowles, Mark Rouncefield, Mike Harding, Nigel Davies, Lynne Blair, James Hannon, John Walden, and Ding Wang. 2015. Models and Patterns of Trust. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15: 328--338.  ",
      "doi": "10.1145/2675133.2675154"
    },
    {
      "text": "Matthias Korn and Amy Voida. 2015. Creating Friction: Infrastructuring Civic Engagement in Everyday Life. Proc 5th Decennial Aarhus Conference: Critical Alternatives: 145--156.  ",
      "doi": "10.7146/aahcc.v1i1.21198"
    },
    {
      "text": "Margaret Levi. 1998. A State of Trust. Trust and Governance: 77--101.",
      "doi": ""
    },
    {
      "text": "Charles H Levine. 2015. Citizenship and Service Delivery. The age of direct citizen participation 44: 78.",
      "doi": ""
    },
    {
      "text": "J D Lewis and A Weigert. 1984. Trust as a social reality. Social forces 63, 4: 967.",
      "doi": ""
    },
    {
      "text": "Sheena Lewis and Dan a. Lewis. 2012. Examining technology that supports community policing. Chi '12: 1371.",
      "doi": "10.1145/2207676.2208595"
    },
    {
      "text": "M Lipsky. 1980. Street-Level Bureaucracy.",
      "doi": ""
    },
    {
      "text": "Niklas Luhmann. 1979. Trust and Power. Cooperation without Trust 8: 208.",
      "doi": ""
    },
    {
      "text": "Joe C Magee and Pamela K Smith. 2013. The social distance theory of power. Personality and Social Psychology Review 17, 2: 158--186.",
      "doi": ""
    },
    {
      "text": "Christina A Masden, Catherine Grevet, Rebecca E Grinter, Eric Gilbert, and W Keith Edwards. 2014. Tensions in scaling-up community social media: a multi-neighborhood study of nextdoor. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 3239--3248.  ",
      "doi": "10.1145/2556288.2557319"
    },
    {
      "text": "D Harrison Mcknight and Norman L Chervany. 2000. Trust and Distrust Definitions?: One Bite at a Time. Proceedings of the workshop on Deception, Fraud, and Trust in Agent Societies held during the Autonomous Agents Conference: Trust in Cyber-societies, Integrating the Human and Artificial Perspectives: 27-- 54. ",
      "doi": "10.5555/646674.701819"
    },
    {
      "text": "Aditi Misra, Aaron Gooze, Kari Watkins, Mariam Asad, and Christopher a. Le Dantec. 2014. Crowdsourcing and Its Application to Transportation Data Collection and Management. Transportation Research Record: Journal of the Transportation Research Board 2414, 1: 1--8.",
      "doi": ""
    },
    {
      "text": "Guido Mollering. 2001. The Nature of Trust: From Georg Simmel to a Theroy fo Expectation, Interpertation ad Suspension. Sociology 35, 2: 403--420.",
      "doi": ""
    },
    {
      "text": "Guido Möllering. 2006. Trust: Reason, routine, reflexivity. Emerald Group Publishing.",
      "doi": ""
    },
    {
      "text": "Guido Möllering. 2006. Trust, institutions, agency: towards a neoinstitutional theory of trust. Handbook of Trust Research: 355--376.",
      "doi": ""
    },
    {
      "text": "Mark Harrison Moore. 1995. Creating Public Value: Strategic Management In Government.",
      "doi": ""
    },
    {
      "text": "Karen Mossberger, Yonghong Wu, and Jared Crawford. 2013. Connecting citizens and local governments? Social media and interactivity in major U.S. cities. Government Information Quarterly 30, 4: 351--358.",
      "doi": ""
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital civics. Interactions 22, 4: 61--63.  ",
      "doi": "10.1145/2776885"
    },
    {
      "text": "Simon Parker, Phil Spires, Faizal Farook, and Melissa Mean. 2008. State of Trust. How to Build better Relationships between Councils and the Public. Demos, London.",
      "doi": ""
    },
    {
      "text": "Mark Peel. 1998. Trusting disadvantaged citizens. Trust and Governance. New York: Russell Sage Foundation: 315--342.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2015. Beyond Distrust: How Americans View Their Government.",
      "doi": ""
    },
    {
      "text": "Robert D. Putnam. 1995. Bowling Alone: America's Declining Social Capital. Journal of Democracy 6, 1: 65--78.",
      "doi": ""
    },
    {
      "text": "Nancy C Roberts. 2015. The age of direct citizen participation. Routledge.",
      "doi": ""
    },
    {
      "text": "Denise M. Rousseau, Sim B. Sitkin, Ronald S. Burt, and Colin Camerer. 1998. Not so different after all: A crossdiscipline view of trust. Academy of Management Review 23, 3: 393--404.",
      "doi": ""
    },
    {
      "text": "Bryan C. Semaan, Scott P. Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14: 1409--1421.  ",
      "doi": "10.1145/2531602.2531605"
    },
    {
      "text": "Peter Taylor-Gooby. 2006. The Efficiency Trust Dilemma.",
      "doi": ""
    },
    {
      "text": "Yaacov Trope and Nira Liberman. 2010. Construallevel theory of psychological distance. Psychological review 117, 2: 440.",
      "doi": ""
    },
    {
      "text": "Tom R Tyler. 1998. Trust and democratic governance. Trust and governance 1: 269.",
      "doi": ""
    },
    {
      "text": "Nadia Urbinati. 2006. Representative democracy: principles and genealogy. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Eric M Uslaner. 2002. The moral foundations of trust. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Eric M Uslaner and Mitchell Brown. 2005. Inequality, trust, and civic engagement. American politics research 33, 6: 868--894.",
      "doi": ""
    },
    {
      "text": "Eran Vigoda-Gadot and Shlomo Mizrahi. 2014. Managing democracies in turbulent times: Trust, performance, and governance in modern states.",
      "doi": ""
    },
    {
      "text": "Vasillis Vlachokyriakos, Clara Crivellaro, Christopher A. Le Dantec, Eric Gordon, Pete Wright, and Patrick Olivier. 2016. Digital Civics. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16: 1096--1099.  ",
      "doi": "10.1145/2851581.2886436"
    },
    {
      "text": "Amy Voida, Lynn Dombrowski, Gillian R. Hayes, and Melissa Mazmanian. 2014. Shared Values/Conflicting Logics: Working Around E-Government Systems Amy. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14: 3583-- 3592.  ",
      "doi": "10.1145/2556288.2556971"
    },
    {
      "text": "Mark E Warren. 1999. Democracy and trust. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Amanda Williams, Erica Robles, and Paul Dourish. Urbane-ing the City. In Handbook of Research on Urban Informatics. IGI Global, 1--20.",
      "doi": ""
    }
  ]
}