{
  "doi": "10.1145/3173574.3173901",
  "title": "Streets for People: Engaging Children in Placemaking Through a Socio-technical Process",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [
    "Best Paper"
  ],
  "abstract": "In this paper, we present a socio-technical process designed to engage children in an ongoing urban design project-Streets for People-in Newcastle, UK. We translated urban design proposals developed by residents and the local authority to enable children to contribute ideas to the project. Our process comprised three stages: situated explorations and evidence gathering through digitally supported neighbourhood walks; issue mapping and peer-to-peer discussions using an online engagement platform; and face-to-face dialogue between children, residents, and the local authority through a 'Town Hall' event. We report insights gained through our engagement and show how our activities facilitated issue advocacy and the development of children's capacities, but also surfaced tensions around the agency of children in political processes. We reflect on the challenges of working in this space, and discuss wider implications for technology design and ethical questions that 'scaling up' such work might pose.",
  "tags": [
    "urban design",
    "community engagement",
    "children",
    "urban planning",
    "digital civics"
  ],
  "authors": [
    {
      "name": "Sean Peacock",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261362",
      "orcid": "missing"
    },
    {
      "name": "Robert Anderson",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261760",
      "orcid": "missing"
    },
    {
      "name": "Clara Crivellaro",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959323457",
      "orcid": "0000-0002-4578-4545"
    }
  ],
  "references": [
    {
      "text": "Alissa Antle. 2017. Crazy Like Us: Design for Vulnerable Populations. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17), 3--4.  ",
      "doi": "10.1145/3078072.3078074"
    },
    {
      "text": "Mariam Asad and Christopher A. Le Dantec. 2015. Illegitimate civic participation: supporting community activists on the ground. Cscw 2015: 1694--1703.  ",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Mariam Asad and Christopher A. Le Dantec. 2017. Tap the Button: A Design-Based Inquiry into Issue Advocacy and Digital Civics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 6304--6316.  ",
      "doi": "10.1145/3025453.3026034"
    },
    {
      "text": "Mariam Asad, Christopher A. Le Dantec, Becky Nielsen, and Kate Diedrick. 2017. Creating a Sociotechnical API: Designing City-Scale Community Engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 2295--2306.  ",
      "doi": "10.1145/3025453.3025963"
    },
    {
      "text": "Tom P. Bakker and Claes H. de Vreese. 2011. Good News for the Future? Young People, Internet Use, and Political Participation. Communication Research 38, 4: 451--470.",
      "doi": ""
    },
    {
      "text": "W. Lance Bennett, Chris Wells, and Allison Rank. 2009. Young citizens and civic learning: two paradigms of citizenship in the digital age. Citizenship Studies 13, 2: 105--120.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner and Carl DiSalvo. 2016. Data, Design and Civics: An Exploratory Study of Civic Tech. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 2970--2981.  ",
      "doi": "10.1145/2858036.2858326"
    },
    {
      "text": "Harry C. Boyte. 2004. Everyday Politics: Reconnecting Citizens and Public Life. University of Pennsylvania Press.",
      "doi": ""
    },
    {
      "text": "Bart Cammaerts, Michael Bruter, Shakuntala Banaji, Sarah Harrison, and Nick Anstead. 2016. Youth Participation in Democratic Life: Stories of Hope and Disillusion. Palgrave Macmillan, Basingstoke, Hampshire.",
      "doi": ""
    },
    {
      "text": "Barry Checkoway, Katie Richards-Schuster, Shakira Abdullah, Margarita Aragon, Evelyn Facio, Lisa Figueroa, Ellen Reddy, Mary Welsh, and Al White. 2003. Young people as competent citizens. Community Development Journal 38, 4: 298--309.",
      "doi": ""
    },
    {
      "text": "Keith Cheverst, Helen Turner, Trien Do, and Dan Fitton. 2017. Supporting the consumption and coauthoring of locative media experiences for a rural village community: design and field trial evaluation of the SHARC2.0 framework. Multimedia Tools and Applications 76, 4: 5243--5274.  ",
      "doi": "10.1007/s11042-016-3515-y"
    },
    {
      "text": "Commonplace. 2017. Commonplace - Online Community Consultation Platform. Retrieved September 19, 2017 from http://www.commonplace.is",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A Pool of Dreams: Facebook, Politics and the Emergence of a Social Movement. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14), 3573--3582.  ",
      "doi": "10.1145/2556288.2557100"
    },
    {
      "text": "Clara Crivellaro, Rob Comber, Martyn DadeRobertson, Simon J. Bowen, Peter C. Wright, and Patrick Olivier. 2015. Contesting the City: Enacting the Political Through Digitally Supported Urban Walks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2853--2862. Retrieved from  ",
      "doi": "10.1145/2702123.2702176"
    },
    {
      "text": "Clara Crivellaro, Alex Taylor, Vasilis Vlachokyriakos, Rob Comber, Bettina Nissen, and Peter Wright. 2016. Re-Making Places: HCI, 'Community Building\" and Change. In CHI'16, May 07--12, 2016, San Jose, CA, USA, 2958--2969.  ",
      "doi": "10.1145/2858036.2858332"
    },
    {
      "text": "Barry Cullingworth, Vincent Nadin, Trevor Hart, Simin Davoudi, John Pendlebury, Geoff Vigar, David Webb, and Tim Townshend. 2014. Town and Country Planning in the UK. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard. 2008. Designing for Inquisitive Use. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (DIS '08), 21--30.  ",
      "doi": "10.1145/1394445.1394448"
    },
    {
      "text": "Christopher A Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2: 241--264.",
      "doi": ""
    },
    {
      "text": "Laurie Day, Liz Sutton, and Jenkins Sarah. 2011. Children and young people's participation in planning and regeneration: a final report to the Ecorys Research Programme 2010--11.",
      "doi": ""
    },
    {
      "text": "Victoria Derr, Louise Chawla, Mara Mintzer, Debra Flanders Cushing, and Willem Van Vliet. 2013. A City for All Citizens: Integrating Children and Youth from Marginalized Populations into City Planning. Buildings 3, 3: 482--505.",
      "doi": ""
    },
    {
      "text": "Tawanna Dillahunt, Olga Lyra, Mary L. Barreto, and Evangelos Karapanos. 2017. Reducing children's psychological distance from climate change via ecofeedback technologies. International Journal of ChildComputer Interaction 13, Supplement C: 19--28.",
      "doi": ""
    },
    {
      "text": "Bent Flyvbjerg. 1998. Rationality and Power: Democracy in Practice. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Marcus Foth. 2011. From Social Butterfly to Engaged Citizen: Urban Informatics, Social Media, Ubiquitous Computing, and Mobile Technology to Support Citizen Engagement. MIT Press. ",
      "doi": "10.5555/2124399"
    },
    {
      "text": "Marcus Foth, Bhishna Bajracharya, Ross Brown, and Greg Hearn. 2009. The Second Life of urban planning? Using NeoGeography tools for community engagement. Journal of Location Based Services 3, 2: 97--117.  ",
      "doi": "10.1080/17489720903150016"
    },
    {
      "text": "Kathryn Frank. 2006. The Potential of Youth Participation in Planning. Journal of Planning Literature 20, 4: 351--371.",
      "doi": ""
    },
    {
      "text": "Claire Freeman and Paul Tranter. 2012. Children and their Urban Environment: Changing Worlds. Routledge.",
      "doi": ""
    },
    {
      "text": "Anita Harris, Johanna Wyn, and Salem Younes. 2010. Beyond apathetic or activist youth: \"Ordinary\" young people and contemporary forms of participation. Young 18, 1: 9--32.",
      "doi": ""
    },
    {
      "text": "Roger A. Hart. 2008. Stepping Back from \"The Ladder\": Reflections on a Model of Participatory Work with Children. In Participation and Learning: Perspectives on Education and the Environment, Health and Sustainability. Springer, Dordrecht, 19--31.",
      "doi": ""
    },
    {
      "text": "Jane Jacobs. 1961. The Death and Life of Great American Cities. Random House, New York.",
      "doi": ""
    },
    {
      "text": "Reinout Kleinhans, Maarten Van Ham, and Jennifer Evans-Cowley. 2015. Using Social Media and Mobile Technologies to Foster Engagement and SelfOrganization in Participatory Urban Planning and Neighbourhood Governance. Planning Practice & Research 30, 3: 237--247.",
      "doi": ""
    },
    {
      "text": "Lisa Koeman, Vaiva Kalnikaité, and Yvonne Rogers. 2015. \"Everyone Is Talking About It!\": A Distributed Approach to Urban Voting Technology and Visualisations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3127--3136.  ",
      "doi": "10.1145/2702123.2702263"
    },
    {
      "text": "Michiel de Lange and Martijn de Waal. 2013. Owning the city: New media and citizen engagement in urban design. First Monday 18, 11. Retrieved April 21, 2017 from http://firstmonday.org/ojs/index.php/fm/article/view/49",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec, Mariam Asad, Aditi Misra, and Kari E Watkins. 2015. Planning with Crowdsourced Data. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15: 1717--1727.  ",
      "doi": "10.1145/2675133.2675212"
    },
    {
      "text": "Laura Lentini and Françoise Decortis. 2010. Space and places: when interacting with and in physical space becomes a meaningful experience. Personal and Ubiquitous Computing 14, 5: 407--415.  ",
      "doi": "10.1007/s00779-009-0267-y"
    },
    {
      "text": "Brian D. Loader, Ariadne Vromen, and Michael A. Xenos. 2014. The networked young citizen: social media, political participation and civic engagement. Information, Communication & Society 17, 2: 143--150.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2015. Taking {A}part: The Politics and Aesthetics of Participation in Experience-Centered Design. MIT Press. ",
      "doi": "10.5555/2742697"
    },
    {
      "text": "Matthew B. Miles and A. Michael Huberman. 1994. Qualitative Data Analysis: An Expanded Sourcebook. SAGE.",
      "doi": ""
    },
    {
      "text": "mySociety. FixMyStreet. Retrieved September 19, 2017 from https://www.fixmystreet.com/",
      "doi": ""
    },
    {
      "text": "Newcastle City Council. 2015. Digital by Choice: 2015/16 Budget Proposal Integrated Impact Assessment. Retrieved September 19, 2017 from https://www.newcastle.gov.uk/node/104825",
      "doi": ""
    },
    {
      "text": "William Odom, Richard Banks, Abigail Durrant, David Kirk, and James Pierce. 2012. Slow Technology: Critical Reflection and Future Directions. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 816--817.  ",
      "doi": "10.1145/2317956.2318088"
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital civics. Interactions 22, 4: 61--63.  ",
      "doi": "10.1145/2776885"
    },
    {
      "text": "Barry Percy-Smith. 2010. Councils, consultations and community: rethinking the spaces for children and young people's participation. Children's Geographies 8, 2: 107--122.",
      "doi": ""
    },
    {
      "text": "Anthony T. Pinter, Pamela J. Wisniewski, Heng Xu, Mary Beth Rosson, and Jack M. Caroll. 2017. Adolescent Online Safety: Moving Beyond Formative Evaluations to Designing Solutions for the Future. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17), 352--357.  ",
      "doi": "10.1145/3078072.3079722"
    },
    {
      "text": "Keith F. Punch. 2013. Introduction to Social Research: Quantitative and Qualitative Approaches. SAGE.",
      "doi": ""
    },
    {
      "text": "Aare Puussaar, Adrian K. Clear, and Peter Wright. 2017. Enhancing Personal Informatics Through Social Sensemaking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 6936--6942.  ",
      "doi": "10.1145/3025453.3025804"
    },
    {
      "text": "Matt Ratto. 2011. Critical Making: Conceptual and Material Studies in Technology and Social Life. The Information Society 27, 4: 252--260.  ",
      "doi": "10.1080/01972243.2011.583819"
    },
    {
      "text": "Janet C. Read, Daniel Fitton, and Matthew Horton. 2014. Giving Ideas an Equal Chance: Inclusion and Representation in Participatory Design with Children. In Proceedings of the 2014 Conference on Interaction Design and Children (IDC '14), 105--114.  ",
      "doi": "10.1145/2593968.2593986"
    },
    {
      "text": "Janet C. Read, Matthew Horton, Gavin Sim, Peggy Gregory, Daniel Fitton, and Brendan Cassidy. 2013. CHECk: A Tool to Inform and Encourage Ethical Practice in Participatory Design with Children. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13), 187--192.  ",
      "doi": "10.1145/2468356.2468391"
    },
    {
      "text": "Gwyther Rees, Sabine Andresen, and Jonathan Richard Bradshaw. 2016. Children's Views on Their Lives and Well-being in 16 Countries?: A report on the Children's Worlds survey of children aged eight years old 2013--15. University of York, York. Retrieved September 19, 2017 from http://eprints.whiterose.ac.uk/95207/",
      "doi": ""
    },
    {
      "text": "Karen Renaud and Joseph Maguire. 2015. Regulating Access to Adult Content (with Privacy Preservation). In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 4019--4028.  ",
      "doi": "10.1145/2702123.2702456"
    },
    {
      "text": "Dan Richardson, Clara Crivellaro, Ahmed Kharrufa, Kyle Montague, and Patrick Olivier. 2017. Exploring Public Places As Infrastructures for Civic M-Learning. In Proceedings of the 8th International Conference on Communities and Technologies (C&T '17), 222--231.  ",
      "doi": "10.1145/3083671.3083678"
    },
    {
      "text": "Jennifer A. Rode. 2009. Digital Parenting: Designing Children's Safety. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCSHCI '09), 244--251. Retrieved September 19, 2017 from http://dl.acm.org/citation.cfm?id=1671011.1671041 ",
      "doi": "10.5555/1671011.1671041"
    },
    {
      "text": "Yvonne Rydin. 2015. Five Radical Ideas for a Better Planning System. University College London, London. Retrieved September 19, 2017 from https://www.ucl.ac.uk/bartlett/planning/research/fiveradical-ideas-better-planning-system",
      "doi": ""
    },
    {
      "text": "Joanna Catherine Saad-Sulonen and Liisa Horelli. 2010. The value of Community Informatics to participatory urban planning and design: a case-study in Helsinki. The Journal of Community Informatics 6, 2: 1--22.",
      "doi": ""
    },
    {
      "text": "Tania M. Schusler, Marianne E. Krasny, Scott J. Peters, and Daniel J. Decker. 2009. Developing citizens and communities through youth environmental action. Environmental Education Research 15, 1: 111--127.",
      "doi": ""
    },
    {
      "text": "E. Seltzer and D. Mahmoudi. 2013. Citizen Participation, Open Innovation, and Crowdsourcing: Challenges and Opportunities for Planning. Journal of Planning Literature 28, 1: 3--18.",
      "doi": ""
    },
    {
      "text": "Amartya Sen. 1992. Inequality Reexamined. Clarendon Press, Oxford.",
      "doi": ""
    },
    {
      "text": "David Williamson Shaffer and Mitchel Resnick. 1999. \"Thick\" Authenticity: New Media and Authentic Learning. Journal of Interactive Learning Research 10, 2: 195. ",
      "doi": "10.5555/325370.325387"
    },
    {
      "text": "Cristiana S. Silva, Glívia A.R. Barbosa, Ismael S. Silva, Tatiane S. Silva, Fernando Mourão, and Flávio Coutinho. 2017. Privacy for Children and Teenagers on Social Networks from a Usability Perspective: A Case Study on Facebook. In Proceedings of the 2017 ACM on Web Science Conference (WebSci '17), 63--71.  ",
      "doi": "10.1145/3091478.3091479"
    },
    {
      "text": "Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. 2863-- 2872.  ",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Mark Tewdwr-Jones, John Goddard, and Paul Cowie. 2015. Newcastle City Futures 2065 Report. Newcastle Institute for Social Renewal, Newcastle University, Newcastle upon Tyne. Retrieved September 19, 2017 from http://www.newcastlecityfutures.org/wpcontent/uploads/2016/11/NewcastleCityFutures2065Re port.pdf",
      "doi": ""
    },
    {
      "text": "Kay E. M. Tisdall. 2008. Is the Honeymoon Over? Children and Young People's Participation in Public Decision-Making. The International Journal of Children's Rights 16, 3: 419--429.",
      "doi": ""
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring participation: on how we involve people in design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 429--438.  ",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Vasilis Vlachokyriakos, Clara Crivellaro, Christopher A. Le Dantec, Eric Gordon, Pete Wright, and Patrick Olivier. 2016. Digital Civics: Citizen Empowerment With and Through Technology. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 1096-- 1099.  ",
      "doi": "10.1145/2851581.2886436"
    },
    {
      "text": "William Hollingsworth Whyte. 1980. The Social Life of Small Urban Spaces. Project for Public Spaces.",
      "doi": ""
    },
    {
      "text": "Alexander Wilson, Mark Tewdwr-Jones, and Rob Comber. 2017. Urban planning, public participation and digital technology: App development as a method of generating citizen involvement in local planning processes. Environment and Planning B: Urban Analytics and City Science: 239980831771251.",
      "doi": ""
    },
    {
      "text": "Jill Palzkill Woelfer and David G. Hendry. 2010. Homeless Young People's Experiences with Information Systems: Life and Work in a Community Technology Center. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1291--1300.  ",
      "doi": "10.1145/1753326.1753520"
    },
    {
      "text": "Gavin Wood, John Vines, Madeline Balaam, Nick Taylor, Thomas Smith, Clara Crivellaro, Juliana Mensah, Helen Limon, John Challis, Linda Anderson, Adam Clarke, and Peter C. Wright. 2014. The Department of Hidden Stories: Playful Digital Storytelling for Children in a Public Library. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1885--1894.  ",
      "doi": "10.1145/2556288.2557034"
    },
    {
      "text": "Pamela Wridt. 2010. A Qualitative GIS Approach to Mapping Urban Neighborhoods with Children to Promote Physical Activity and Child-Friendly Community Planning. Environment and Planning B: Planning and Design 37, 1: 129--147.",
      "doi": ""
    }
  ]
}