{
  "doi": "10.1145/3173574.3174005",
  "title": "Tensions of Data-Driven Reflection: A Case Study of Real-Time Emotional Biosensing",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Biosensing displays, increasingly enrolled in emotional reflection, promise authoritative insight by presenting users' emotions as discrete categories. Rather than machines interpreting emotions, we sought to explore an alternative with emotional biosensing displays in which users formed their own interpretations and felt comfortable critiquing the display. So, we designed, implemented, and deployed, as a technology probe, an emotional biosensory display: Ripple is a shirt whose pattern changes color responding to the wearer's skin conductance, which is associated with excitement. 17 participants wore Ripple over 2 days of daily life. While some participants appreciated the 'physical connection' Ripple provided between body and emotion, for others Ripple fostered insecurities about 'how much' feeling they had. Despite our design intentions, we found participants rarely questioned the display's relation to their feelings. Using biopolitics to speculate on Ripple's surprising authority, we highlight ethical stakes of biosensory representations for sense of self and ways of feeling.",
  "tags": [
    "affect-as-interaction",
    "biopolitics",
    "skin conductance",
    "biosensing",
    "technological mediation",
    "clothing-based display"
  ],
  "authors": [
    {
      "name": "Noura Howell",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81554353756/rel-imgonly/img_8543_crop-square_web_smaller.jpg",
      "acmid": "81554353756",
      "orcid": "missing"
    },
    {
      "name": "Laura Devendorf",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81557677456/rel-imgonly/laura_devendorf14ga.jpg",
      "acmid": "81557677456",
      "orcid": "0000-0002-3656-7936"
    },
    {
      "name": "Tomás Alfonso Vega Gálvez",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-99659036052/rel-imgonly/img_3167.jpg",
      "acmid": "99659036052",
      "orcid": "missing"
    },
    {
      "name": "Rundong Tian",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659554682",
      "orcid": "missing"
    },
    {
      "name": "Kimiko Ryokai",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100335135/rel-imgonly/kimiko_ryokai.jpg",
      "acmid": "81100335135",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chris Anderson. 2008. The End of Theory: The Data Deluge Makes the Scientific Method Obsolete. Wired. Retrieved August 17, 2017 from https://www.wired.com/2008/06/pb-theory/",
      "doi": ""
    },
    {
      "text": "A. Aron, E. Melinat, E. N. Aron, R. D. Vallone, and R. J. Bator. 1997. The Experimental Generation of Interpersonal Closeness: A Procedure and Some Preliminary Findings. Personality and Social Psychology Bulletin 23, 4: 363--377.",
      "doi": ""
    },
    {
      "text": "Rain Ashford. 2014. Baroesque barometric skirt. Proceedings of the 2014 ACM International Symposium on Wearable Computers: Adjunct Program (ISWC'14 Adjunct), ACM Press, 9--14.  ",
      "doi": "10.1145/2641248.2641271"
    },
    {
      "text": "Madeline Balaam, Geraldine Fitzpatrick, Judith Good, and Rosemary Luckin. 2010. Exploring Affective Technologies for the Classroom with the Subtle Stone. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1623--1632.  ",
      "doi": "10.1145/1753326.1753568"
    },
    {
      "text": "Kirsten Boehner, Rogério DePaula, Paul Dourish, and Phoebe Sengers. 2007. How emotion is made and measured. International Journal of Human-Computer Studies 65, 4: 275--291.  ",
      "doi": "10.1016/j.ijhcs.2006.11.016"
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Chris Bopp, Ellie Harmon, and Amy Voida. 2017. Disempowered by Data: Nonprofits, Social Enterprises, and the Consequences of Data-Driven Work. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, 3608-- 3619.  ",
      "doi": "10.1145/3025453.3025694"
    },
    {
      "text": "danah boyd and Kate Crawford. 2012. Critical Questions for Big Data: Provocations for a cultural, technological, and scholarly phenomenon. Information, Communication & Society 15, 5: 662--679.",
      "doi": ""
    },
    {
      "text": "Leah Buechley and Michael Eisenberg. 2009. Fabric PCBs, electronic sequins, and socket buttons: techniques for e-textile craft. Personal and Ubiquitous Computing 13, 2: 133--150.  ",
      "doi": "10.1007/s00779-007-0181-0"
    },
    {
      "text": "Luca Canzian and Mirco Musolesi. 2015. Trajectories of Depression: Unobtrusive Monitoring of Depressive States by Means of Smartphone Mobility Traces Analysis. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 1293--1304.  ",
      "doi": "10.1145/2750858.2805845"
    },
    {
      "text": "K. Crawford, J. Lingel, and T. Karppi. 2015. Our metrics, ourselves: A hundred years of self-tracking from the weight scale to the wrist wearable device. European Journal of Cultural Studies 18, 4--5: 479-- 496.",
      "doi": ""
    },
    {
      "text": "Kate Crawford, Mary L. Gray, and Kate Miltner. 2014. Critiquing Big Data: Politics, Ethics, Epistemology. International Journal of Communication 8, 0: 10.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Lin Lee Jung, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I don't want to wear a screen\": Probing perceptions of and possibilities for dynamic displays on clothing. Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16).  ",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Marieke van Dooren, J.J.G. (Gert-Jan) de Vries, and Joris H. Janssen. 2012. Emotional sweating across the body: Comparing 16 different skin conductance measurement locations. Physiology & Behavior 106, 2: 298--304.",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Melissa Mazmanian. 2011. Media as material: Information representations as material foundations for organizational practice. Third International Symposium on Process Organization Studies.",
      "doi": ""
    },
    {
      "text": "Natasha Dow Schüll. 2016. Sensor technology and the time-series self. continent. 5, 1: 24--29.",
      "doi": ""
    },
    {
      "text": "Joseph Dumit. 2012. Drugs for life: how pharmaceutical companies define our health. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2002. The Placebo Project. Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, 9--12.  ",
      "doi": "10.1145/778712.778714"
    },
    {
      "text": "Behnaz Farahi. 2015. Caress of the Gaze. Retrieved November 3, 2017 from http://behnazfarahi.com/caress-of-the-gaze/",
      "doi": ""
    },
    {
      "text": "Behnaz Farahi. 2017. Opale. Retrieved November 3, 2017 from http://behnazfarahi.com/opale/",
      "doi": ""
    },
    {
      "text": "Maria Fedorova. 2014. Tyler Fox at LocoMotoArt. Temporary Art Review. Retrieved August 31, 2017 from http://temporaryartreview.com/tyler-fox-atlocomotoart/",
      "doi": ""
    },
    {
      "text": "Tyler Fox. 2014. Biolesce. Retrieved August 31, 2017 from http://www.tylersfox.com/487",
      "doi": ""
    },
    {
      "text": "Amisha Gadani. 2010. Porcupine Defensive Dress. Retrieved December 15, 2017 from http://www.amishagadani.com/Work/porcupine/index. html",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. interactions 6, 1: 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity As a Resource for Design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "A. Ghandeharious, S. Fedor, L. Sangermano, D. Ionescu, J. Alpert, C. Dale, D. Sontag, and R. Picard. 2017. Objective assessment of depressive symptoms with machine learning and wearable sensors data.",
      "doi": ""
    },
    {
      "text": "Lisa Gitelman (ed.). 2013. \"Raw data\" is an oxymoron. The MIT Press, Cambridge, Massachusetts ; London, England.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 1994. Professional Vision. American Anthropologist 96, 3: 606--633.",
      "doi": ""
    },
    {
      "text": "Ellie Harmon and Melissa Mazmanian. 2013. Stories of the Smartphone in everyday discourse: conflict, tension & instability. ACM Press, 1051.  ",
      "doi": "10.1145/2470654.2466134"
    },
    {
      "text": "Kate Hartman, Jackson McConnell, Boris Kourtoukov, Hillary Predko, and Izzie Colpitts-Campbell. 2015. Monarch: Self-Expression Through Wearable Kinetic Textiles. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 413--414.  ",
      "doi": "10.1145/2677199.2690875"
    },
    {
      "text": "Jennifer Healey. 2015. Physiological Sensing of Emotion. In The Oxford Handbook of Affective Computing, Rafael Calvo, Sidney D'Mello, Jonathan Gratch and Arvid Kappas (eds.). Oxford University Press. Retrieved May 18, 2016 from http://www.oxfordhandbooks.com/view/10.1093/oxfor dhb/9780199942237.001.0001/oxfordhb9780199942237-e-023",
      "doi": ""
    },
    {
      "text": "J. Hernandez, C. Ferguson, A. Sano, W. Chen, L. Weihui, A. Yeung, and R. Picard. 2017. Stress Measurement from Tongue Color Imaging.",
      "doi": ""
    },
    {
      "text": "Javier Hernandez, Rob R. Morris, and Rosalind W. Picard. 2011. Call Center Stress Recognition with Person-specific Models. Proceedings of the 4th International Conference on Affective Computing and Intelligent Interaction, Springer-Verlag, 125--134. Retrieved January 12, 2016 from http://dl.acm.org/citation.cfm?id=2062780.2062798 ",
      "doi": "10.5555/2062780.2062798"
    },
    {
      "text": "Tad Hirsch, Kritzia Merced, Shrikanth Narayanan, Zac E. Imel, and David C. Atkins. 2017. Designing Contestability: Interaction Design, Machine Learning, and Mental Health. 95--99.  ",
      "doi": "10.1145/3064663.3064703"
    },
    {
      "text": "Bjørn Hofmann. 2001. The technological invention of disease. Medical Humanities 27, 1: 10--19.",
      "doi": ""
    },
    {
      "text": "Noura Howell, Laura Devendorf, Rundong (Kevin) Tian, Tomás Vega, Nan-Wei Gong, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. Biosignals as social cues: Ambiguity and emotional interpretation in social displays of skin conductance. Designing Interactive Systems (DIS).  ",
      "doi": "10.1145/2901790.2901850"
    },
    {
      "text": "Noura Howell and Tomás Vega Gálvez. 2017. ebbsense: color-changing threads respond to skin conductance sensor. Retrieved from https://github.com/Noura/ebbsense",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology Probes: Inspiring Design for and with Families. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Andrew Iliadis and Federica Russo. 2016. Critical data studies: An introduction. Big Data & Society 3, 2: 1--7.",
      "doi": ""
    },
    {
      "text": "iMotions. 2016. Qualtrics and iMotions form partnership. iMotions. Retrieved August 25, 2017 from https://imotions.com/press-release/qualtrics-andimotions-partnership/",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2004. Why Has Critique Run out of Steam? From Matters of Fact to Matters of Concern. Critical Inquiry 30, 2: 225--248.",
      "doi": ""
    },
    {
      "text": "Lucian Leahu and Phoebe Sengers. 2014. Freaky: performing hybrid human-machine emotion. Proceedings of the 2014 conference on Designing interactive systems (DIS'14), ACM Press, 607--616.  ",
      "doi": "10.1145/2598510.2600879"
    },
    {
      "text": "Dawn Nafus. 2014. Stuck data, dead data, and disloyal data: the stops and starts in making numbers into social practices. Distinktion: Journal of Social Theory 15, 2: 208--222.",
      "doi": ""
    },
    {
      "text": "Dawn Nafus. 2016. Introduction. In Quantified: Biosensing Technologies in Everyday Life, Dawn Nafus (ed.). MIT Press.",
      "doi": ""
    },
    {
      "text": "Yoshiki Nakashima, Jonghwa Kim, Simon Flutura, Andreas Seiderer, and Elisabeth André. 2015. Stress Recognition in Daily Work. International Symposium on Pervasive Computing Paradigms for Mental Health, Springer International Publishing, 23--33. Retrieved September 13, 2016 from http://link.springer.com/chapter/10.1007/978--3--319- 32270--4_3",
      "doi": ""
    },
    {
      "text": "Peter Orszag. 2017. People Lie, But Search Data Tell the Truth. Bloomberg.com. Retrieved September 17, 2017 from https://www.bloomberg.com/view/articles/2017-05- 09/people-lie-but-search-data-tell-the-truth",
      "doi": ""
    },
    {
      "text": "Brian Parkinson. 2015. Emotions in Interpersonal Life. In The Oxford Handbook of Affective Computing, Rafael Calvo, Sidney D'Mello, Jonathan Gratch and Arvid Kappas (eds.). Oxford University Press. Retrieved May 18, 2016 from http://www.oxfordhandbooks.com/view/10.1093/oxfor dhb/9780199942237.001.0001/oxfordhb9780199942237-e-023",
      "doi": ""
    },
    {
      "text": "P. Pedrelli, E. Howe, D. Mischoulon, R. Picard, A. Ghandeharious, and S. Fedor. 2017. Integrating EMA, clinical assessment and wearable sensors to examine the association between MDD and alcohol use.",
      "doi": ""
    },
    {
      "text": "Rosalind W. Picard and Jocelyn Scheirer. 2001. The Galvactivator: A glove that senses and communicates skin conductivity. Proceedings from the 9th International Conference on Human-Computer Interaction, 1538--1542.",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, M. Emre Karagozler, Carsten Schwesig, and Karen Robinson. 2016. Project Jacquard: Manufacturing Digital Textiles at Scale. Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Paul Rabinow and Nikolas Rose. 2006. Biopower Today. BioSocieties 1, 2: 195--217.",
      "doi": ""
    },
    {
      "text": "Nikolas Rose. 2001. The Politics of Life Itself. Theory, Culture & Society 18, 6: 1--30.",
      "doi": ""
    },
    {
      "text": "Minna Ruckenstein and Natasha Dow Schüll. 2017. The Datafication of Health. Annual Review of Anthropology 46, 1: 261--278.",
      "doi": ""
    },
    {
      "text": "Akane Sano and Rosalind W. Picard. 2013. Stress Recognition Using Wearable Sensors and Mobile Phones. Proceedings of the 2013 Humaine Association Conference on Affective Computing and Intelligent Interaction (ACII'13), IEEE, 671--676.  ",
      "doi": "10.1109/ACII.2013.117"
    },
    {
      "text": "Anne M. Schell, Michael E. Dawson, and Diane L. Filion. 1988. Psychophysiological Correlates of Electrodermal Lability. Psychophysiology 25, 6: 619-- 632.",
      "doi": ""
    },
    {
      "text": "Natasha Dow Schüll. 2016. Data for life: Wearable technology and the design of self-care. BioSocieties 11, 3: 317--333.",
      "doi": ""
    },
    {
      "text": "Natasha Dow Schüll. 2017. Algorithmic Selves: Sensory Technology and the Mediation of Sentience. Retrieved December 14, 2017 from http://cstms.berkeley.edu/current-events/datasensesensor-technology-and-the-mediation-of-sentience/",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph \"Jofish\" Kaye. 2005. Reflective Design. Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility, ACM, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Phoebe Sengers and Bill Gaver. 2006. Staying Open to Interpretation: Engaging Multiple Meanings in Design and Evaluation. Proceedings of the 6th Conference on Designing Interactive Systems (DIS'06), ACM, 99-- 108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Sensoree (Collective), Kristin Neidlinger, Scott Minneman, Anthony Asterisk, and Erik Johnson. GER Mood Sweater. Retrieved March 21, 2016 from http://sensoree.com/artifacts/ger-mood-sweater/",
      "doi": ""
    },
    {
      "text": "Sensoree (Collective), Kristin Neidlinger, Grant Patterson, Nathan Tucker, and Machinic (Collective). NEUROTiQ. Retrieved March 21, 2016 from http://sensoree.com/artifacts/neurotiq/",
      "doi": ""
    },
    {
      "text": "Eric Shouse. 2005. Feeling, Emotion, Affect. M/C Journal: A Journal of Media and Culture 8, 6. Retrieved December 17, 2016 from http://journal.media-culture.org.au/0512/03-shouse.php",
      "doi": ""
    },
    {
      "text": "H. P. da Silva, A. Fred, and R. Martins. 2014. Biosignals for Everyone. IEEE Pervasive Computing 13, 4: 64--71.",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Joris Janssen, and Geraldine Fitzpatrick. 2012. Understanding Heart Rate Sharing: Towards Unpacking Physiosocial Space. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 859--868.  ",
      "doi": "10.1145/2207676.2208526"
    },
    {
      "text": "Petr Slovák, Paul Tennent, Stuart Reeves, and Geraldine Fitzpatrick. 2014. Exploring skin conductance synchronisation in everyday interactions. Proceedings of the 8th Nordic Conference on HumanComputer Interaction: Fun, Fast, Foundational (NordiCHI'14), ACM Press, 511--520.  ",
      "doi": "10.1145/2639189.2639206"
    },
    {
      "text": "Jaime Snyder, Mark Matthews, Jacqueline Chien, Pamara F. Chang, Emily Sun, Saeed Abdullah, and Geri Gay. 2015. MoodLight: Exploring Personal and Social Implications of Ambient Display of Biosensor Data. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW'15), ACM Press, 143--153.  ",
      "doi": "10.1145/2675133.2675191"
    },
    {
      "text": "Anna Ståhl, Kristina Höök, Martin Svensson, Alex S. Taylor, and Marco Combetto. 2009. Experiencing the Affective Diary. Personal Ubiquitous Comput. 13, 5: 365--378.",
      "doi": "10.1007/s00779-008-0202-7"
    },
    {
      "text": "Petra Sundström, Anna St\\a ahl, and Kristina Höök. 2005. eMoto: Affectively Involving Both Body and Mind. CHI '05 Extended Abstracts on Human Factors in Computing Systems, ACM, 2005--2008.  ",
      "doi": "10.1145/1056808.1057078"
    },
    {
      "text": "Melanie Swan. 2012. Health 2050: The Realization of Personalized Medicine through Crowdsourcing, the Quantified Self, and the Participatory Biocitizen. Journal of Personalized Medicine 2, 3: 93--118.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2006. Materializing Morality: Design Ethics and Technological Mediation. Science, Technology, & Human Values 31, 3: 361--380.",
      "doi": ""
    },
    {
      "text": "Kaiton Williams. 2015. An Anxious Alliance. Aarhus Series on Human Centered Computing 1, 1: 11.",
      "doi": "10.7146/aahcc.v1i1.21146"
    },
    {
      "text": "Michele A. Williams, Asta Roseway, Chris O'Dowd, Mary Czerwinski, and Meredith Ringel Morris. 2015. SWARM: An Actuated Wearable for Mediating Affect. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 293--300.  ",
      "doi": "10.1145/2677199.2680565"
    },
    {
      "text": "Langdon Winner. 1980. Do Artifacts Have Politics? Daedalus 109, 1: 121--136.",
      "doi": ""
    },
    {
      "text": "Anouk Wipprecht. 2014. Synapse. Retrieved July 28, 2016 from https://i.materialise.com/blog/wearabletech-just-got-smarter-anouk-wipprechts-intel-edisonpowered-3d-printed-synapse-dress-logs-your-mood/",
      "doi": ""
    },
    {
      "text": "Anouk Wipprecht. Spider Dress 2.0. Retrieved December 26, 2015 from http://www.anoukwipprecht.nl/",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong and Deirdre K. Mulligan. 2016. When a Product Is Still Fictional: Anticipating and Speculating Futures through Concept Videos. ACM Press, 121--133.  ",
      "doi": "10.1145/2901790.2901801"
    },
    {
      "text": "G. Wu, G. Liu, and M. Hao. 2010. The Analysis of Emotion Recognition from GSR Based on PSO. 2010 International Symposium on Intelligence Information Processing and Trusted Computing, 360--363.  ",
      "doi": "10.1109/IPTC.2010.60"
    },
    {
      "text": "Bin Yu, Mathias Funk, Jun Hu, and Loe Feijs. 2017. StressTree: A Metaphorical Visualization for Biofeedback-assisted Stress Management. ACM Press, 333--337.  ",
      "doi": "10.1145/3064663.3064729"
    },
    {
      "text": "2014. Microsoft Band 2 Advertisement. Retrieved August 25, 2017 from https://i.imgur.com/tiC9ufb.jpg",
      "doi": ""
    },
    {
      "text": "Fitbit. Retrieved September 13, 2016 from https://www.fitbit.com/",
      "doi": ""
    },
    {
      "text": "Jawbone UP3. Retrieved January 11, 2016 from https://jawbone.com/store/buy/up3",
      "doi": ""
    },
    {
      "text": "Spire. Spire. Retrieved September 19, 2017 from http://www.spire.io",
      "doi": ""
    },
    {
      "text": "Feel. Retrieved January 12, 2016 from http://www.myfeel.co/",
      "doi": ""
    },
    {
      "text": "OMbra. OMsignal. Retrieved September 14, 2016 from https://www.omsignal.com/products/ombra",
      "doi": ""
    },
    {
      "text": "Apple Watch. Retrieved January 12, 2016 from http://www.apple.com/watch/watch-reimagined/",
      "doi": ""
    },
    {
      "text": "Apple Watch Nike+. Apple. Retrieved September 13, 2016 from http://www.apple.com/apple-watch-nike/",
      "doi": ""
    },
    {
      "text": "Microsoft Band 2. Retrieved January 11, 2016 from https://www.microsoft.com/microsoft-band/enus/features",
      "doi": ""
    },
    {
      "text": "E4 wristband. Empatica Store. Retrieved September 18, 2017 from https://store.empatica.com/products/e4- wristband",
      "doi": ""
    },
    {
      "text": "Affectiva. Retrieved from http://www.affectiva.com/",
      "doi": ""
    },
    {
      "text": "Affectiva Developer Portal: Metrics. Retrieved May 2, 2017 from http://developer.affectiva.com/metrics/",
      "doi": ""
    },
    {
      "text": "Hussein Chalayan and Intel take stress tracking accessories to Paris Fashion Week. Wareable. Retrieved August 25, 2017 from https://www.wareable.com/fashion/hussein-chalayanparis-fashion-week-wearable-tech-889",
      "doi": ""
    },
    {
      "text": "PoloTech Shirt by Ralph Lauren. Retrieved September 14, 2016 from http://press.ralphlauren.com/polotech/",
      "doi": ""
    },
    {
      "text": "Athos. Retrieved September 14, 2016 from http://www.liveathos.com",
      "doi": ""
    },
    {
      "text": "Feel: About Us. Retrieved September 19, 2017 from https://www.myfeel.co/about-us",
      "doi": ""
    }
  ]
}