{
  "doi": "10.1145/3173574.3174050",
  "title": "Visual ODLs: Co-Designing Patient-Generated Observations of Daily Living to Support Data-Driven Conversations in Pediatric Care",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Teens with complex chronic illnesses have difficulty understanding and articulating symptoms such as pain and emotional distress. Yet, symptom communication plays a central role in clinical care and illness management. To understand how design can help overcome these challenges, we created a visual library of 72 sketched illustrations, informed by the Observations of Daily Living framework along with insights from 11 clinician interviews. We utilized our library with storyboarding techniques, free-form sketching, and interviews, in co-design sessions with 13 pairs of chronically-ill teens and their parents. We found that teens depicted symptoms as being interwoven with narratives of personal and social identity. Teens and parents were enthusiastic about collaboratively-generated, interactive storyboards as a tracking and communication mechanism, and suggested three ways in which they could aid in communication and coordination with informal and formal caregivers. In this paper, we detail these findings, to guide the design of tools for symptom-tracking and incorporation of patient-generated data into pediatric care.",
  "authors": [
    {
      "name": "Matthew K. Hong",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81548905356/rel-imgonly/81548905356.jpeg",
      "acmid": "81548905356",
      "orcid": "missing"
    },
    {
      "name": "Udaya Lakshmi",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260678",
      "orcid": "missing"
    },
    {
      "name": "Thomas A. Olson",
      "institution": "Children's Healthcare of Atlanta, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021435",
      "orcid": "missing"
    },
    {
      "name": "Lauren Wilcox",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81416600696/rel-imgonly/81416600696.jpeg",
      "acmid": "81416600696",
      "orcid": "0000-0001-6598-1733"
    }
  ],
  "references": [
    {
      "text": "Raewyn Bassett, Brenda L. Beagan, Svetlana RistovskiSlijepcevic, and Gwen E. Chapman. 2008. Tough Teens: The Methodological Challenges of Interviewing Teenagers as Research Participants. Journal of Adolescent Research 23, 2: 119--131.",
      "doi": ""
    },
    {
      "text": "Patricia Flatley Brennan and Gail Casper. 2015. Observing health in everyday living: ODLs and the care-between-the-care. Personal and Ubiquitous Computing 19, 1: 3--8.  ",
      "doi": "10.1007/s00779-014-0805-0"
    },
    {
      "text": "Patricia Flatley Brennan, Stephen Downs, and Gail Casper. 2010. Project HealthDesign: rethinking the power and potential of personal health records. Journal of biomedical informatics 43, 5: S3--S5.  ",
      "doi": "10.1016/j.jbi.2010.09.001"
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for caregivers: designing for integrality. Proceedings of the 2013 conference on Computer Supported Cooperative Work, ACM, 91--102.  ",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Eun Kyoung Choe, Saeed Abdullah, Mashfiqui Rabbi, et al. 2017. Semi-Automated Tracking: A Balanced Approach for Self-Monitoring Applications. IEEE Pervasive Computing 16, 1: 74--84.  ",
      "doi": "10.1109/MPRV.2017.18"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, et al. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM Press, 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Chia-Fang Chung, Kristin Dew, Allison M Cole, et al. 2016. Boundary Negotiating Artifacts in Personal Informatics: Patient-Provider Collaboration with Patient-Generated Data. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work&Social Computing - CSCW '16, ACM Press, 768--784.  ",
      "doi": "10.1145/2818048.2819926"
    },
    {
      "text": "John J. Collins, Maura E. Byrnes, Ira J. Dunkel, et al. 2000. The Measurement of Symptoms in Children with Cancer. Journal of Pain and Symptom Management 19, 5: 363--377.",
      "doi": ""
    },
    {
      "text": "Pippa G. Corrie. 2008. Cytotoxic chemotherapy: clinical aspects. Medicine 36, 1: 24--28.",
      "doi": ""
    },
    {
      "text": "Prasanna R Deshpande, Surulivel Rajan, B Lakshmi Sudeepthi, and C P Abdul Nazir. 2011. Patientreported outcomes: A new era in clinical research. Perspectives in clinical research 2, 4: 137--44.",
      "doi": ""
    },
    {
      "text": "Christian Dindler and Ole Sejer Iversen. 2007. Fictional Inquiry-design collaboration in a shared narrative space. CoDesign 3, 4: 213--234.",
      "doi": ""
    },
    {
      "text": "Sarah E. Drew, Rony E. Duncan, and Susan M. Sawyer. 2010. Visual Storytelling: A Beneficial But Challenging Method for Health Research With Young People. Qualitative Health Research 20, 12: 1677-- 1688.",
      "doi": ""
    },
    {
      "text": "Jerry Alan Fails, Mona Leigh Guha, and Allison Druin. 2012. Methods and Techniques for Involving Children in the Design of New Technology for Children. Foundations and Trends® in Human-Computer Interaction 6, 2: 85--166.  ",
      "doi": "10.1561/1100000018"
    },
    {
      "text": "Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating Rigor Using Thematic Analysis: A Hybrid Approach of Inductive and Deductive Coding and Theme Development. International Journal of Qualitative Methods 5, 1: 80--92.",
      "doi": ""
    },
    {
      "text": "Chris Feudtner, Ross M Hays, Gerri Haynes, J Russell Geyer, John M Neff, and Thomas D Koepsell. 2001. Deaths attributed to pediatric complex chronic conditions: national trends and implications for supportive care services. Pediatrics 107, 6: e99--e99.",
      "doi": ""
    },
    {
      "text": "Andrea L Hartzler, Jason P Izard, Bruce L Dalkin, Sean P Mikles, and John L Gore. 2015. Design and feasibility of integrating personalized PRO dashboards into prostate cancer care. Journal of the American Medical Informatics Association: ocv101.",
      "doi": ""
    },
    {
      "text": "Kimberly Hieftje, Lindsay R Duncan, and Lynn E Fiellin. 2014. Novel methods to collect meaningful data from adolescents for the development of health interventions. Health promotion practice 15, 5: 714-- 22.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Kiley Sobel, and Bongshin Lee. 2017. Co-Designing with Preschoolers Using Fictional Inquiry and Comicboarding. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, 5767--5772.  ",
      "doi": "10.1145/3025453.3025588"
    },
    {
      "text": "Matthew K Hong, Lauren Wilcox, Daniel Machado, Thomas A Olson, and Stephen F Simoneaux. 2016. Care Partnerships: Toward Technology to Support Teens' Participation in Their Health Care. Proceedings of the 34th annual ACM Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2858036.2858508"
    },
    {
      "text": "Hilary Hutchinson, Heiko Hansen, Nicolas Roussel, et al. 2003. Technology probes: inspiring design for and with families. Proceedings of the conference on Human factors in computing systems - CHI '03, ACM Press, 17.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Catherine E. Jansen, Christine Miaskowski, Marylin Dodd, Glenna Dowling, and Joel Kramer. 2005. A metaanalysis of studies of the effects of cancer chemotherapy on various domains of cognitive function. Cancer 104, 10: 2222--2233.",
      "doi": ""
    },
    {
      "text": "Sidney Katz, Amasa B Ford, Roland W Moskowitz, Beverly A Jackson, and Marjorie W Jaffe. 1963. Studies of illness in the aged: the index of ADL: a standardized measure of biological and psychosocial function. Jama 185, 12: 914--919.",
      "doi": ""
    },
    {
      "text": "Yoojung Kim, Eunyoung Heo, Hyunjeong Lee, et al. 2017. Prescribing 10,000 Steps Like Aspirin: Designing a Novel Interface for Data-Driven Medical Consultations. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, 5787--5799.  ",
      "doi": "10.1145/3025453.3025570"
    },
    {
      "text": "Predrag Klasnja, Andrea Civan Hartzler, Kent T Unruh, and Wanda Pratt. 2010. Blowing in the wind: unanchored patient information work during cancer care. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 193--202.  ",
      "doi": "10.1145/1753326.1753355"
    },
    {
      "text": "Kristine L. Kwekkeboom. 2016. Cancer Symptom Cluster Management. Seminars in Oncology Nursing 32, 4: 373--382.",
      "doi": ""
    },
    {
      "text": "Charlotte P. Lee. 2007. Boundary Negotiating Artifacts: Unbinding the Routine of Boundary Objects and Embracing Chaos in Collaborative Work. Computer Supported Cooperative Work (CSCW) 16, 3: 307--339.  ",
      "doi": "10.1007/s10606-007-9044-5"
    },
    {
      "text": "Matthew L. Lee and Anind K. Dey. 2015. Sensorbased observations of daily living for aging in place. Personal and Ubiquitous Computing 19, 1: 27--43.  ",
      "doi": "10.1007/s00779-014-0810-3"
    },
    {
      "text": "Susanne Lindberg and Susanne. 2013. Participatory design workshops with children with cancer. Proceedings of the 12th International Conference on Interaction Design and Children - IDC '13, ACM Press, 332--335.  ",
      "doi": "10.1145/2485760.2485840"
    },
    {
      "text": "Louis S. Matza, Donald L. Patrick, Anne W. Riley, et al. 2013. Pediatric Patient-Reported Outcome Instruments for Research to Support Medical Product Labeling: Report of the ISPOR PRO Good Research Practices for the Assessment of Children and Adolescents Task Force. Value in Health 16, 4: 461-- 479.",
      "doi": ""
    },
    {
      "text": "Gillian M. McCarthy, Edgar R. Rodriguez Ramírez, and Brian J. Robinson. 2017. Participatory Design to Address Stigma with Adolescents with Type 1 Diabetes. Proceedings of the 2017 Conference on Designing Interactive Systems - DIS '17, ACM Press, 83--94.  ",
      "doi": "10.1145/3064663.3064740"
    },
    {
      "text": "Helena M. Mentis, Anita Komlodi, Katrina Schrader, et al. 2017. Crafting a View of Self-Tracking Data in the Clinical Visit. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, 5800--5812.  ",
      "doi": "10.1145/3025453.3025589"
    },
    {
      "text": "Neema Moraveji, Jason Li, Jiarong Ding, Patrick O'Kelley, and Suze Woolf. 2007. Comicboarding: using comics as proxies for participatory design with children. Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07, ACM Press, 1371.  ",
      "doi": "10.1145/1240624.1240832"
    },
    {
      "text": "Rupa A Patel, Predrag Klasnja, Andrea Hartzler, Kenton T Unruh, and Wanda Pratt. 2012. Probing the benefits of real-time tracking during cancer care. AMIA Annual Symposium Proceedings, American Medical Informatics Association, 1340.",
      "doi": ""
    },
    {
      "text": "Laura R. Pina, Sang-Wha Sien, Teresa Ward, et al. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17, ACM Press, 2300-- 2315.  ",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "Erika S. Poole and Tamara Peyton. 2013. Interaction design research with adolescents. Proceedings of the 12th International Conference on Interaction Design and Children - IDC '13, ACM Press, 211--217.  ",
      "doi": "10.1145/2485760.2485766"
    },
    {
      "text": "Jessica Schroeder, Jane Hoffswell, Chia-Fang Chung, James Fogarty, Sean Munson, and Jasmine Zia. 2017. Supporting Patient-Provider Collaboration to Identify Individual Triggers using Food and Symptom Journals. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17, ACM Press, 1726--1739.  ",
      "doi": "10.1145/2998181.2998276"
    },
    {
      "text": "Michael Shapiro, Douglas Johnston, Jonathan Wald, and Donald Mon. 2012. Patient-Generated Health Data White Paper: White Paper Prepared for the Office of the National Coordinator for Health it by RTI International. Retrieved June 29, 2017 from http://www.rti.org/pubs/patientgeneratedhealthdata.pdf",
      "doi": ""
    },
    {
      "text": "AnneLoes Van Staa, Susan Jedeloo, Jos M Latour, and Margo J Trappenburg. 2010. Exciting but exhausting: experiences with participatory research with chronically ill adolescents. Health Expectations 13, 1: 95--107.",
      "doi": ""
    },
    {
      "text": "S. L. Star and J. R. Griesemer. 1989. Institutional Ecology, 'Translations' and Boundary Objects: Amateurs and Professionals in Berkeley's Museum of Vertebrate Zoology, 1907--39. Social Studies of Science 19, 3: 387--420.",
      "doi": ""
    },
    {
      "text": "James W Varni, Michael Seid, and Paul S Kurtin. 2001. PedsQLTM 4.0: Reliability and validity of the Pediatric Quality of Life InventoryTM Version 4.0 Generic Core Scales in healthy and patient populations. Medical care 39, 8: 800--812.",
      "doi": ""
    },
    {
      "text": "Peter West, Max Van Kleek, Richard Giordano, Mark Weal, and Nigel Shadbolt. 2017. Information Quality Challenges of Patient-Generated Data in Clinical Practice. Frontiers in public health 5: 284.",
      "doi": ""
    },
    {
      "text": "Jason C Yip, Elizabeth Foss, and Mona Leigh Guha. 2012. Co-designing with adolescents. Designing Interactive Technology for Teens Workshop, NordiCHI, Copenhagen, Denmark. Retrieved from: http://www. chici. org/ditt2012/papers. html.",
      "doi": ""
    }
  ]
}