{
  "doi": "10.1145/3173574.3173636",
  "title": "Exploring the Potential of Exergames to affect the Social and Daily Life of People with Dementia and their Caregivers",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2018,
  "badges": [],
  "abstract": "This paper presents the outcomes of an exploratory field study that examined the social impact of an ICT-based suite of exergames for people with dementia and their caregivers. Qualitative data was collected over a period of 8 months, during which time we studied the daily life of 14 people with dementia and their informal and professional caregivers. We focus on the experiential aspects of the system and examine its social impact when integrated into the daily routines of both people with dementia themselves and their professional and family caregivers. Our findings indicate that relatives were able to regain leisure time, whilst people with dementia were able to recapture certain aspects of their social and daily activities that might otherwise have been lost to them. Results suggest that the system enhanced social-interaction, invigorated relationships, and improved the empowerment of people with dementia and their caregivers to face daily challenges.",
  "authors": [
    {
      "name": "David Unbehaun",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659235403",
      "orcid": "missing"
    },
    {
      "name": "Daryoush Daniel Vaziri",
      "institution": "University of Applied Sciences, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659077944",
      "orcid": "missing"
    },
    {
      "name": "Konstantin Aal",
      "institution": "University of Siegen, Siegen, NRW, Germany",
      "img": "/do/10.1145/contrib-81557694656/rel-imgonly/konstantin_aal_jpg.jpg",
      "acmid": "81557694656",
      "orcid": "missing"
    },
    {
      "name": "Rainer Wieching",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078272",
      "orcid": "missing"
    },
    {
      "name": "Peter Tolmie",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/do/10.1145/contrib-81100030964/rel-imgonly/profilepicture.jpeg",
      "acmid": "81100030964",
      "orcid": "missing"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Laura D. Baker, Laura L. Frank, K. Foster-Schubert, P. S. Green, C. W. Wilkinson, A. McTiernan, and S. Craft. 2010. Aerobic exercise improves cognition for older adults with glucose intolerance, a risk factor for Alzheimer's disease. Journal of Alzheimer's Disease 22, 2: 569--579.",
      "doi": ""
    },
    {
      "text": "Kerstin Bindel and Johannes Pantel. 2012. InA: Inanspruchnahme von Unterstützungsangeboten für versorgende Angehörige von Menschen mit Demenz. Logos Verl, Berlin.",
      "doi": ""
    },
    {
      "text": "Christiaan G. Blankevoort, Marieke J.G. van Heuvelen, Froukje Boersma, Helga Luning, Jeltsje de Jong, and Erik J.A. Scherder. 2010. Review of Effects of Physical Activity on Strength, Balance, Mobility and ADL Performance in Elderly Subjects with Dementia. Dementia and Geriatric Cognitive Disorders 30, 5: 392--402.",
      "doi": ""
    },
    {
      "text": "Mélodie Boulay, Samuel Benveniste, Sandra Boespflug, Pierre Jouvelot, and Anne-Sophie Rigaud. 2011. A pilot usability study of MINWii, a music therapy game for demented patients. Technology and health care 19, 4: 233--246.  ",
      "doi": "10.5555/2595780.2595782"
    },
    {
      "text": "Melodie Boulay, Samuel Benveniste, Sandra Boespflug, Pierre Jouvelot, and Anne-Sophie Rigaud. 2011. A pilot usability study of MINWii: A music therapy game for demented patients. Technology and Health care 19, 4: 233--246.  ",
      "doi": "10.5555/2595780.2595782"
    },
    {
      "text": "Rens Brankaert. 2016. Design for dementia?: a designdriven living lab approach to involve people with dementia and their context Eindhoven. Technische Universiteit Eindhoven.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": ""
    },
    {
      "text": "Deutschland Bundesregierung. 2016. Sechster Bericht der Bundesregierung über die Entwicklung der Pflegeversicherung und den Stand der pflegerischen Versorgung in der Bundesrepublik Deutschland.",
      "doi": ""
    },
    {
      "text": "Mima Cattan, Martin White, John Bond, and Alison Learmouth. 2005. Preventing social isolation and loneliness among older people: A systematic review of health promotion interventions. Ageing and Society 25, 1: 41--67.",
      "doi": ""
    },
    {
      "text": "Wassiliki Chassioti. 2014. Verständnis und Definition von Pflegebed&#252;rftigkeit aus l&#228;nderübergreifender Sicht: Probleme und Kritik zum Pflegebedürftigkeitsbegriff sowie Lösungsvorschläge. Diplomica Verlag, Hamburg.",
      "doi": ""
    },
    {
      "text": "Stanley Colcombe and Arthur F. Kramer. 2003. Fitness effects on the cognitive function of older adults: A metaanalytic study. Psychological science 14, 2: 125--130.",
      "doi": ""
    },
    {
      "text": "David W. Coon and Bronwynne Evans. 2009. Empirically based treatments for family caregiver distress: what works and where do we go from here? Geriatric Nursing (New York, N.Y.) 30, 6: 426--436.",
      "doi": ""
    },
    {
      "text": "Richard J. Davidson and Bruce S. McEwen. 2012. Social influences on neuroplasticity: Stress and interventions to promote well-being. Nature neuroscience 15, 5: 689--695.",
      "doi": ""
    },
    {
      "text": "Helios De Rosario, Juan Manuel Belda-Lois, Francisco Fos, Enrique Medina, Rakel Poveda-Puente, and Michael Kroll. 2014. Correction of Joint Angles from Kinect for Balance Exercising and Assessment. Journal of Applied Biomechanics 30, 2: 294--299.",
      "doi": ""
    },
    {
      "text": "Laura F. DeFina, Benjamin L. Willis, Nina B. Radford, Ang Gao, David Leonard, William L. Haskell, Myron F. Weiner, Jarett D. Berry. 2013. The Association Between Midlife Cardiorespiratory Fitness Levels and Later-Life Dementia: A Cohort Study. Annals of Internal Medicine 158, 3: 162.",
      "doi": ""
    },
    {
      "text": "Deutsche Alzheimer Gesellschaft e.V. Die Häufigkeit von Demenzerkrankungen. 2016. Retrieved from https://www.deutschealzheimer.de/fileadmin/alz/pdf/factsheets/infoblatt1_ha eufigkeit_demenzerkrankungen_dalzg.pdf",
      "doi": ""
    },
    {
      "text": "Grazia D'Onofrio, Daniele Sancarlo, Francesco Ricciardi, Francesco Panza, Davide Seripa, Filippo Cavallo, Francesco Giuliani, and Antonio Greco. 2017. Information and Communication Technologies for the Activities of Daily Living in Older Patients with Dementia: A Systematic Review. Journal of Alzheimer's Disease 57, 3: 927--935.",
      "doi": ""
    },
    {
      "text": "Alexandra Douglass-Bonner and Henry W. w. Potts. 2013. Exergame Efficacy in Clinical and Non-Clinical Populations: A Systematic Review and Meta-Analysis. In Presented at: 6th World Congress on Social Media, Mobile Apps, Internet/Web 2.0, London, UK. (2013). Retrieved April 14, 2017 from http://www.medicine20congress.com/ocs/index.php/m ed/med2013/paper/view/1555",
      "doi": ""
    },
    {
      "text": "Erica Dove and Arlene J Astell. 2017. The Use of Motion-Based Technology for People Living With Dementia or Mild Cognitive Impairment: A Literature Review. Journal of Medical Internet Research 19, 1: e3.",
      "doi": ""
    },
    {
      "text": "Laura HP. Eggermont, Erik Scherder, E. 2006. Physical activity and behavior in dementia: A review of the literature and implications for psychosocial Intervention in primary care. Dementia 5: 411--428.",
      "doi": ""
    },
    {
      "text": "Laura HP. Eggermont, Dick Swaab, Paul Luiten, and Erik Scherder. 2006. Exercise, cognition and Alzheimer's disease: more is not necessarily better. Neuroscience & biobehavioral reviews 30, 4: 562--575.",
      "doi": ""
    },
    {
      "text": "Carl Eisdorfer, Sara J. Czaja, David A. Loewenstein, Mark P. Rubert, Soledad Argüelles, Victoria B. Mitrani, and José Szapocznik. 2003. The effect of a family therapy and technology-based intervention on caregiver depression. The Gerontologist 43, 4: 521--531.",
      "doi": ""
    },
    {
      "text": "Mats Eriksson, Veli-Pekka Niitamo, and Seija Kulkki. State-of-the-art in utilizing Living Labs approach to usercentric ICT innovation - a European approach. Lulea: Center fpr Distance-Spanning Technology (Lulea University of Technology Sweden: Lulea).",
      "doi": ""
    },
    {
      "text": "Bernadino Férnandez-Calvo, Roberto Rodriguez-Pérez, Israel Contador, Alicia Rubio-Santorum, Francisco Ramos. 2011. Efficacy of cognitive training programs based on new software technologies in patients with Alzheimer- Type dementia. Psicothema 23: 44--50.",
      "doi": ""
    },
    {
      "text": "Geraldine Fitzpatrick and Gunnar Ellingsen. 2013. A Review of 25 Years of CSCW Research in Healthcare: Contributions, Challenges and Future Agendas. Computer Supported Cooperative Work (CSCW) 22, 4-- 6: 609--665.  ",
      "doi": "10.1007/s10606-012-9168-0"
    },
    {
      "text": "Patrick D. Gajewski and Michael Falkenstein. 2016. Physical activity and neurocognitive functioning in aging - a condensed updated review. European Review of Aging and Physical Activity 13, 1.",
      "doi": ""
    },
    {
      "text": "Grant Gibson, Claire Dickinson, Katie Brittain, and Louise Robinson. 2015. The everyday use of assistive technology by people with dementia and their family carers: a qualitative study. BMC Geriatrics 15, 1.",
      "doi": ""
    },
    {
      "text": "Yves J. Gschwind, Sabine Eichberg, Andreas Ejupi, Helios de Rosario, Michael Kroll, Hannah R. Marston, Mario Drobics, Janneke Annegarn, Rainer Wieching, Stephen R. Lord, Konstantin Aal, Daryoush Vaziri, Ashley Woodbury, Dennis Fink, and Kim Delbaere. 2015. ICT-based system to predict and prevent falls (iStoppFalls): results from an international multicenter randomized controlled trial. European Review of Aging and Physical Activity 12, 1.",
      "doi": ""
    },
    {
      "text": "Ute Haas (ed.). 2012. Pflege von Menschen mit Querschnittlähmung: Probleme, Bedürfnisse, Ressourcen und Interventionen. Huber, Bern.",
      "doi": ""
    },
    {
      "text": "Beat Ted Hannemann. 2006. Creativity with Dementia Patients. Gerontology 52, 1: 59--65.",
      "doi": ""
    },
    {
      "text": "Klaus Hauer, Michael Schwenk, Tanja Zieschang, Marco Essig, Clemens Becker, and Peter Oster. 2012. Physical training improves motor performance in people with dementia: a randomized controlled trial. Journal of the American Geriatrics Society 60, 1: 8--15.",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Liesbeth Huybrechts, Andrea Wilkinson, and Karin Slegers. 2014. Challenges in doing participatory design with people with dementia. 33--36.  ",
      "doi": "10.1145/2662155.2662196"
    },
    {
      "text": "Patricia Heyn, Beatriz C. Abreu, and Kenneth J. Ottenbacher. 2004. The effects of exercise training on elderly persons with cognitive impairment and dementia: A meta-analysis. Archives of Physical Medicine and Rehabilitation 85, 10: 1694--1704.",
      "doi": ""
    },
    {
      "text": "Amy S. Hwang, Khai N. Truong, and Alex Mihailidis. 2016. Expanding design possibilities for life with dementia. interactions 23, 3: 59--61.  ",
      "doi": "10.1145/2899380"
    },
    {
      "text": "Wijnand Ijsselsteijn, Henk Herman Nap, Yvonne de Kort, and Karolien Poels. 2007. Digital game design for elderly users. 17.",
      "doi": ""
    },
    {
      "text": "Eva Karlsson, Karin Axelsson, Karin Zingmark, and Stefan Savenstedt. 2011. The challenge of coming to terms with the use of a new digital assistive device: A case study of two persons with mild dementia. The open nursing journal 5: 102--110.",
      "doi": ""
    },
    {
      "text": "Zvonimir S. Katusic and Susan A. Austin. 2014. Endothelial nitric oxide: Protector of a healthy mind. European Heart Journal 35, 14: 888--894.",
      "doi": ""
    },
    {
      "text": "Armin Koeppe, Nicole Maly-Lukas, Dorothee Mausberg, Monika Reichert, and DiözesanCaritasverband für das Erzbistum Köln (eds.). 2003. Zur Lebenslage pflegender Angehöriger psychisch kranker alter Menschen: eine empirische Untersuchung. LITVerl, Münster.",
      "doi": ""
    },
    {
      "text": "Nils A. Lahmann, Ralf Suhr, Simone Kuntz, and Jan Kottner. 2014. Over-and undersupply in home care: A representative multicenter correlational study. Aging clinical and experimental research: 1--11.",
      "doi": ""
    },
    {
      "text": "Steve Lauriks, Annika Reinersmann, Henriette Geralde Van der Roest, F.J.M. Meiland, Richard J. Davies, Ferial Moelaert, Maurice D. Mulvenna, Chris D. Nugent, and Rose-Marie Dröes. 2007. Review of ICTbased services for identified unmet needs in people with dementia. Ageing Research Reviews 6, 3: 223--246.",
      "doi": ""
    },
    {
      "text": "Grégory Legouverneur, Maribel Pino, Melodie Boulay, and Anne-Sophie Rigaud. 2011. Wii sports, a usability study with MCI and Alzheimer's patients. Alzheimer's & Dementia 7, 4: 500--501.",
      "doi": ""
    },
    {
      "text": "Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. 521.",
      "doi": ""
    },
    {
      "text": "Teresa Liu-Ambrose, Meghan G. Donaldson, Yasmin Ahamed, Peter Graf, Wendy L. Cook, Jacqueline Close, Stephen R. Lord, and Karim M. Khan. 2008. Otago Home-Based Strength and Balance Retraining Improves Executive Functioning in Older Fallers: A Randomized Controlled Trial: HOME EXERCISE PROGRAM AND COGNITION. Journal of the American Geriatrics Society 56, 10: 1821--1830.",
      "doi": ""
    },
    {
      "text": "Rebecca G Logsdon, Susan M McCurry, and Linda Teri. 2007. Evidence-Based Interventions to Improve Quality of Life for Individuals with Dementia. Alzheimer's care today 8, 4: 309--318.",
      "doi": ""
    },
    {
      "text": "Julia M. Mayer and Jelena Zach. 2013. Lessons learned from participatory design with and for people with dementia. 540.",
      "doi": ""
    },
    {
      "text": "Simon McCallum and Costas Boletsis. 2013. Dementia Games: A Literature Review of Dementia-Related Serious Games. In Serious games development and applications, M. Ma, M. F. Oliveira, S. Petersen and J. B. Hauge (eds.). Springer, Berlin, 15--27.",
      "doi": ""
    },
    {
      "text": "Orii McDermott, Martin Orrell, and Hanne Mette Ridder. 2014. The importance of music for people with dementia: the perspectives of people with dementia, family carers, staff and music therapists. Aging & Mental Health 18, 6: 706--716.",
      "doi": ""
    },
    {
      "text": "Franka Meiland, Anthea Innes, Gail Mountain, Louise Robinson, Henriëtte van der Roest, J Antonio GarcíaCasal, Dianne Gove, Jochen René Thyrian, Shirley Evans, Rose-Marie Dröes, Fiona Kelly, Alexander Kurz, Dympna Casey, Dorota Szcześniak, Tom Dening, Michael P Craven, Marijke Span, Heike Felzmann, Magda Tsolaki, and Manuel Franco-Martin. 2017. Technologies to Support Community-Dwelling Persons With Dementia: A Position Paper on Issues Regarding Development, Usability, Effectiveness and CostEffectiveness, Deployment, and Ethics. JMIR Rehabilitation and Assistive Technologies 4, 1: e1.",
      "doi": ""
    },
    {
      "text": "Eneida Mioshi, Christopher M. Kipps, and John R. Hodges. 2009. Activities of daily living in behavioral variant frontotemporal dementia: differences in caregiver and performance-based assessments. Alzheimer Disease and Associated Disorders 23, 1: 70-- 76.",
      "doi": ""
    },
    {
      "text": "Claudia Müller, Dominik Hornung, Theodor Hamm, and Volker Wulf. 2015. Practice-based design of a neighborhood portal: Focusing on elderly tenants in a city quarter living lab. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Seoul, 2295--2304.  ",
      "doi": "10.1145/2702123.2702449"
    },
    {
      "text": "Maurice D. Mulvenna, Chris D. Nugent, Ferial Moelaert, David Craig, Rose-Marie Dröes, and Johan E. Bengtsson. 2010. Supporting People with Dementia Using Pervasive Healthcare Technologies. In Supporting People with Dementia Using Pervasive Health Technologies, Maurice D. Mulvenna and Chris D. Nugent (eds.). Springer London, London, 3--14. Retrieved January 4, 2017 from http://link.springer.com/10.1007/978--1--84882--551--2_1",
      "doi": ""
    },
    {
      "text": "Corinna Ogonowski, Konstantin Aal, Daryoush Vaziri, Thomas Von Rekowski, Dave Randall, Dirk Schreiber, Rainer Wieching, and Volker Wulf. 2016. ICT-Based Fall Prevention System for Older Adults: Qualitative Results from a Long-Term Field Study. ACM Transactions on Computer-Human Interaction 23, 5: 1-- 33.  ",
      "doi": "10.1145/2967102"
    },
    {
      "text": "Corinna Ogonowski, Benedikt Ley, Jan Hess, Lin Wan, and Volker Wulf. 2013. Designing for the living room. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 1539--1548.  ",
      "doi": "10.1145/2470654.2466205"
    },
    {
      "text": "Kalpana P. Padala, Prasad R. Padala, Timothy R. Malloy, Jenenne A. Geske, Patricia M. Dubbert, Richard A. Dennis, Kimberly K. Garner, Melinda M. Bopp, William J. Burke, and Dennis H. Sullivan. 2012. Wii-fit for improving gait and balance in an assisted living facility: A pilot study. Journal of aging research 2012.",
      "doi": ""
    },
    {
      "text": "Marco Aurélio Monteiro Peluso and Laura Helena Silveira Guerra de Andrade. 2005. Physical activity and mental health: the association between exercise and mood. Clinics 60, 1: 61--70.",
      "doi": ""
    },
    {
      "text": "Ángel C. Pinto-Bruno, J. Antonio García-Casal, Emese Csipke, Cristina Jenaro-Río, and Manuel FrancoMartín. 2017. ICT-based applications to improve social health and social participation in older adults with dementia. A systematic literature review. Aging & Mental Health 21, 1: 58--65.",
      "doi": ""
    },
    {
      "text": "Volkmar Pipek and Volker Wulf. 2009. Infrastructuring: Toward an Integrated Perspective on the Design and Use of Information Technology. Journal of the Association for Information Systems 10, 5: Article 1. https://doi.org/http://aisel.aisnet.org/jais/vol10/iss5/1",
      "doi": ""
    },
    {
      "text": "John Powell, Teresa Chiu, and Gunther Eysenbach. 2008. A systematic review of networked technologies supporting carers of people with dementia. Journal of Telemedicine and Telecare 14, 3: 154--156.",
      "doi": ""
    },
    {
      "text": "Philippe H. Robert, Alexandra Konig, Helene Amieva, Sandrine Andrieu, Francois Bremond, Roger Bullock, Mathieu Ceccaldi, Bruno Dubois, Serge Gauthier, PaulAriel Kenigsberg, Stephane Nave, Jean M. Orgogozo, Julie Piano, Michel Benoit, Jacques Touchon, Bruno Vellas, Jerome Yesavage, and Valeria Manera. 2014. Recommendations for the use of Serious Games in people with Alzheimer's Disease, related disorders and frailty. Frontiers in aging neuroscience 6: 54.",
      "doi": ""
    },
    {
      "text": "Allyson C. Rosen, Lisa Sugiura, Joel H. Kramer, Susan Whitfield-Gabrieli, and John D. Gabrieli. 2011. Cognitive training changes hippocampal function in mild cognitive impairment: A pilot study. Journal of Alzheimer's Disease 26, 3: 349--357.",
      "doi": ""
    },
    {
      "text": "Qingwei Ruan. 2015. Cognitive frailty, a novel target for the prevention of elderly dependency. Ageing Research Reviews 20: 1--10.",
      "doi": ""
    },
    {
      "text": "Sara Sanders. 2005. Is the Glass Half Empty or Half Full?: Reflections on Strain and Gain in Caregivers of Individuals with Alzheimer's Disease. Social Work in Health Care 40, 3: 57--73.",
      "doi": ""
    },
    {
      "text": "Teppo Sarkamo, Mari Tervaniemi, Sari Laitinen, Ava Numminen, Merja Kurki, Julene Johnson, and Pekka Rantanen. 2014. Cognitive, Emotional, and Social Benefits of Regular Musical Activities in Early Dementia: Randomized Controlled Study. The Gerontologist 54, 4: 634--650.",
      "doi": ""
    },
    {
      "text": "Beate Schmitt and Lutz Frölich. 2007. Kreative Therapieansätze in der Behandlung von Demenzen eine systematische Übersicht. Fortschritte der Neurologie · Psychiatrie 75, 12: 699--707.",
      "doi": ""
    },
    {
      "text": "Tanja Schultz, Putze Felix, and Kruse Andreas. 2014. Technische Unterstuetzung fuer Menschen mit Demenz?: Symposium 30.09. - 01.10.2013. KIT Scientific Publishing.",
      "doi": ""
    },
    {
      "text": "Richard Schulz and Paula R. Sherwood. 2008. Physical and Mental Health Effects of Family Caregiving: AJN, American Journal of Nursing 108, Supplement: 23--27.",
      "doi": ""
    },
    {
      "text": "Patricia Silveira, Rolf van de Langenberg, Eva van het Reve, Florian Daniel, Fabio Casati, and Eling D. de Bruin. 2013. Tablet-Based Strength-Balance Training to Motivate and Improve Adherence to Exercise in Independently Living Older People: A Phase II Preclinical Exploratory Trial. Journal of Medical Internet Research 15.",
      "doi": ""
    },
    {
      "text": "Panote Siriaraya and Chee Siang Ang. 2014. CHI 2014, one of a CHInd: conference proceedings: Toronto, Canada, April 26 - May 1, 2014?; the 32nd Annual ACM Conference on Human Factors in Computing Systems. Assoc. for Computing Machinery, New York, NY.",
      "doi": ""
    },
    {
      "text": "Karin Slegers, Pieter Duysburgh, and Niels Hendriks. 2014. Participatory design with people living with cognitive or sensory impairments. 49--52.  ",
      "doi": "10.1145/2559206.2560475"
    },
    {
      "text": "Karin Slegers, Andrea Wilkinson, and Niels Hendriks. 2013. Active collaboration in healthcare design: participatory design to develop a dementia care app. 475.  ",
      "doi": "10.1145/2468356.2468440"
    },
    {
      "text": "Silvia Sörensen and Yeates Conwell. 2011. Issues in Dementia Caregiving: Effects on Mental and Physical Health, Intervention Strategies, and Research Needs. The American Journal of Geriatric Psychiatry 19, 6: 491--496.",
      "doi": ""
    },
    {
      "text": "Zafeiropoulos Stavros, Kounti Fotini, and Tsolaki Magda. 2010. Computer based cognitive training for patients with mild cognitive impairment (MCI). In Proceedings of the 3rd International Conference on Pervasive Technologies Related to Assistive Environments, 1--3.  ",
      "doi": "10.1145/1839294.1839319"
    },
    {
      "text": "Sütterlin, S., Hossmann, I., Klingholz R. 2011. DemenzReport: Wie sich die Regionen in Deutschland, Österreich und der Schweiz auf die Alterung der Gesellschaft vorbereiten können.",
      "doi": ""
    },
    {
      "text": "Michiko Takai, Megumi Takahashi, Yumi Iwamitsu, Noriko Ando, Shigemi Okazaki, K. Nakajima, S. Oishi, and H. Miyaoka. 2009. The experience of burnout among home caregivers of patients with dementia: Relations to depression and quality of life. Archives of Gerontology and Geriatrics 49, 1: e1--e5.",
      "doi": ""
    },
    {
      "text": "Jochen René Thyrian, Johannes Hertel, Diana Wucherer, Tilly Eichler, Bernhard Michalowsky, Adina Dreier-Wolfgramm, Ina Zwingmann, Ingo Kilimann, Stefan Teipel, and Wolfgang Hoffmann. 2017. Effectiveness and Safety of Dementia Care Management in Primary Care: A Randomized Clinical Trial. JAMA Psychiatry.",
      "doi": ""
    },
    {
      "text": "Daryoush D. Vaziri, Konstantin Aal, Corinna Ogonowski, Thomas Von Rekowski, Michael Kroll, Hannah R. Marston, Rakel Poveda, Yves J. Gschwind, Kim Delbaere, Rainer Wieching, and Volker Wulf. 2016. Exploring user experience and technology acceptance for a fall prevention system: results from a randomized clinical trial and a living lab. European Review of Aging and Physical Activity 13, 1.",
      "doi": ""
    },
    {
      "text": "Daryoush Daniel Vaziri, Konstantin Aal, Yves J Gschwind, Kim Delbaere, Anne Weibert, Janneke Annegarn, Helios de Rosario, Rainer Wieching, David Randall, and Volker Wulf. 2017. Analysis of effects and usage indicators for a ICT-based fall prevention system in community dwelling older adults. International Journal of Human-Computer Studies 106: 10--25.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. 2617.  ",
      "doi": "10.1145/2468356.2479560"
    },
    {
      "text": "Lin Wan, Claudia Müller, Volker Wulf, Dave Randall, 2014. Addressing the Subtleties in Dementia Care: Prestudy & Evaluation of a GPS Monitoring System. In CHI 2014, 3987--3996.  ",
      "doi": "10.1145/2556288.2557307"
    },
    {
      "text": "Elizabeth Weybright, John Dattilo, Frank Rusch. 2010. Effects of an interactive video game (Nintendo Wii) on older women with Mild Cognitive Impairment. Therapeutic Recreation Journal 44, 4: 271--287.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Claudia Müller, Volkmar Pipek, David Randall, Markus Rohde, and Gunnar Stevens. 2015. Practice-based computing: Empirically grounded conceptualizations derived from design case studies. In Designing Socially Embedded Technologies in the Real-World. Springer, 111--150.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Volkmar Pipek, Dave Randall, Markus Rohde, Kjeld Schmidt, and Gunnar Stevens (eds.). 2018. Socio Informatics -- A Practice-based Perspective on the Design and Use of IT Artefacts. Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "H. Yamaguchi, Y. Maki, and K. Takahashi. 2011. Rehabilitation for dementia using enjoyable videosports games. International psychogeriatrics 23, 4: 674--676.",
      "doi": ""
    }
  ]
}