{
  "doi": "10.1145/3173574.3173602",
  "title": "Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Digital self-tracking technologies offer many potential benefits over self-tracking with paper notebooks. However, they are often too rigid to support people's practical and emotional needs in everyday settings. To inform the design of more flexible self-tracking tools, we examine bullet journaling: an analogue and customisable approach for logging and reflecting on everyday life. Analysing a corpus of paper bullet journal photos and related conversations on Instagram, we found that individuals extended and adapted bullet journaling systems to their changing practical and emotional needs through: (1) creating and combining personally meaningful visualisations of different types of trackers, such as habit, mood, and symptom trackers; (2) engaging in mindful reflective thinking through design practices and self-reflective strategies; and (3) posting photos of paper journals online to become part of a self-tracking culture of sharing and learning. We outline two interrelated design directions for flexible and mindful self-tracking: digitally extending analogue self-tracking and supporting digital self-tracking as a mindful design practice.",
  "tags": [
    "bullet journaling",
    "self-tracking",
    "personal informatics",
    "self-care technologies",
    "symptom tracking",
    "self-monitoring",
    "instagram",
    "mood tracking",
    "habit tracking"
  ],
  "authors": [
    {
      "name": "Amid Ayobi",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020909",
      "orcid": "0000-0003-1104-0043"
    },
    {
      "name": "Tobias Sonne",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558390556",
      "orcid": "missing"
    },
    {
      "name": "Paul Marshall",
      "institution": "University College London & University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280485",
      "orcid": "0000-0003-2950-8310"
    },
    {
      "name": "Anna L. Cox",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81350567335/rel-imgonly/a.cox.png",
      "acmid": "81350567335",
      "orcid": "0000-0003-2231-2964"
    }
  ],
  "references": [
    {
      "text": "Phil Adams, Elizabeth L. Murnane, Michael Elfenbein, Elaine Wethington, and Geri Gay. 2017. Supporting the Self-Management of Chronic Pain Conditions with Tailored Momentary Self-Assessments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 1065--1077.  ",
      "doi": "10.1145/3025453.3025832"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, and Anna L. Cox. 2016. Reflections on 5 Years of Personal Informatics: Rising Concerns and Emerging Directions. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 2774--2781.  ",
      "doi": "10.1145/2851581.2892406"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L Cox, and Yunan Chen. 2017. Quantifying the Body and Caring for the Mind: Self-Tracking in Multiple Sclerosis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17).  ",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing Mobile Health Technology for Bipolar Disorder: A Field Trial of the Monarca System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2627--2636.  ",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Clara Caldeira, Matthew Bietz, Marisol Vidauri, and Yunan Chen. 2017. Senior Care for Aging in Place: Balancing Assistance and Independence. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 1605--1617.  ",
      "doi": "10.1145/2998181.2998206"
    },
    {
      "text": "Ryder Carroll. 2016. Bullet Journal: the analog system for the digital age. Retrieved November 9, 2017 from http://bulletjournal.com/",
      "doi": ""
    },
    {
      "text": "Scott Carter and Jennifer Mankoff. 2005. When participants do the capturing: the role of media in diary studies. 899.",
      "doi": ""
    },
    {
      "text": "Yunan Chen. 2010. Take It Personally: Accounting for Individual Difference in Designing Diabetes Management Systems. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10), 252--261.  ",
      "doi": "10.1145/1858171.1858218"
    },
    {
      "text": "Eun Kyoung Choe, Saeed Abdullah, Mashfiqui Rabbi, Edison Thomaz, Daniel A. Epstein, Felicia Cordeiro, Matthew Kay, Gregory D. Abowd, Tanzeem Choudhury, James Fogarty, Bongshin Lee, Mark Matthews, and Julie A. Kientz. 2017. Semi-Automated Tracking: A Balanced Approach for Self-Monitoring Applications. IEEE Pervasive Computing 16, 1: 74--84.  ",
      "doi": "10.1109/MPRV.2017.18"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, and m.c. schraefel. 2015. Characterizing Visualization Insights from Quantified Selfers' Personal Data Presentations. IEEE Computer Graphics and Applications 35, 4: 28--37.",
      "doi": "10.1109/MCG.2015.51"
    },
    {
      "text": "Chia-Fang Chung, Elena Agapie, Jessica Schroeder, Sonali Mishra, James Fogarty, and Sean A. Munson. 2017. When Personal Tracking Becomes Social: Examining the Use of Instagram for Healthy Eating. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 1674--1687.  ",
      "doi": "10.1145/3025453.3025747"
    },
    {
      "text": "Emily I. M. Collins, Anna L. Cox, Jon Bird, and Cassie Cornish-Tresstail. 2014. Barriers to Engagement with a Personal Informatics Productivity Tool. In Proceedings of the 26th Australian ComputerHuman Interaction Conference on Designing Futures: The Future of Design (OzCHI '14), 370--379.  ",
      "doi": "10.1145/2686612.2686668"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 1994. Grounded theory methodology. Handbook of qualitative research 17: 273--285.",
      "doi": ""
    },
    {
      "text": "Felicia Cordeiro, Elizabeth Bales, Erin Cherry, and James Fogarty. 2015. Rethinking the Mobile Food Journal: Exploring Opportunities for Lightweight Photo-Based Capture. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3207--3216.  ",
      "doi": "10.1145/2702123.2702154"
    },
    {
      "text": "Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, Elizabeth Bales, Arvind K. Jagannathan, Gregory D. Abowd, and James Fogarty. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1159--1162. A.L. Cox, J. Bird, and R. Fleck. 2013. Digital Epiphanies: how self-knowledge can change habits and our attitudes towards them. In Presented at: The 27th International British Computer Society Human Computer Interaction Conference: The Internet of things, Brunel University, London, UK. (2013).  ",
      "doi": "10.1145/2702123.2702155"
    },
    {
      "text": "Nicola Davis. 2017. Can you write your way to happiness? The Observer. Retrieved September 17, 2017 from http://www.theguardian.com/lifeandstyle/2017/jun/11/ bullet-journalling-can-you-write-your-way-tohappiness",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, David Chatting, and David S. Kirk. 2017. Designing Documentary Informatics. In In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 649--661.  ",
      "doi": "10.1145/3064663.3064714"
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, and David S. Kirk. 2016. It's just my history isn't it?: Understanding Smart Journaling Practices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 2819--2831.  ",
      "doi": "10.1145/2858036.2858103"
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Andrew Garbett, David Chatting, David Kirk, and John Vines. 2016. Metadating: Exploring the Romance and Future of Personal Data. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 685--698.  ",
      "doi": "10.1145/2858036.2858173"
    },
    {
      "text": "Daniel A. Epstein, Jennifer H. Kang, Laura R. Pina, James Fogarty, and Sean A. Munson. 2016. Reconsidering the device in the drawer: lapses as a design opportunity in personal informatics. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 829--840.  ",
      "doi": "10.1145/2971648.2971656"
    },
    {
      "text": "Daniel A. Epstein, Nicole B. Lee, Jennifer H. Kang, Elena Agapie, Jessica Schroeder, Laura R. Pina, James Fogarty, Julie A. Kientz, and Sean Munson. 2017. Examining Menstrual Tracking to Inform the Design of Personal Informatics Tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 6876--6888.  ",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742.  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Denise Florez. 2016. Why is everyone crazy for #bujo? What you need to know about \"bullet journaling.\" Los Angeles Times. Retrieved from http://www.latimes.com/home/la-he-bullet-journaling20160309-story.html",
      "doi": ""
    },
    {
      "text": "Susannah Fox and Maeve Duggan. Tracking for Health. Pew Research Center. Retrieved September 15, 2017 from http://www.pewinternet.org/2013/01/28/tracking-forhealth/",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How do we engage with activity trackers?: a longitudinal study of Habito. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 1305--1316. Retrieved from http://dl.acm.org/citation.cfm?id=2804290  ",
      "doi": "10.1145/2750858.2804290"
    },
    {
      "text": "Xinning Gui, Yu Chen, Clara Caldeira, Dan Xiao, and Yunan Chen. 2017. When Fitness Meets Social Networks: Investigating Fitness Tracking and Social Practices on WeRun. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 1647--1659.  ",
      "doi": "10.1145/3025453.3025654"
    },
    {
      "text": "Rebecca Gulotta, Jodi Forlizzi, Rayoung Yang, and Mark Wah Newman. 2016. Fostering Engagement with Personal Informatics Systems. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 286--300.  ",
      "doi": "10.1145/2901790.2901803"
    },
    {
      "text": "Daniel Harrison, Paul Marshall, Nadia BianchiBerthouze, and Jon Bird. 2015. Activity Tracking: Barriers, Workarounds and Customisation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 617--621.  ",
      "doi": "10.1145/2750858.2805832"
    },
    {
      "text": "William Jones. 2007. Personal Information Management. Annual Review of Information Science and Technology 41, 1: 453--504.  ",
      "doi": "10.5555/1658843.1658860"
    },
    {
      "text": "Ravi Karkar, Jasmine Zia, Jessica Schroeder, Daniel A. Epstein, Laura R. Pina, Jeffrey Scofield, James Fogarty, Julie A. Kientz, Sean A. Munson, and Roger Vilardaga. 2017. TummyTrials: A Feasibility Study of Using Self-Experimentation to Detect Individualized Food Triggers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 6850--6863.  ",
      "doi": "10.1145/3025453.3025480"
    },
    {
      "text": "Joseph Jofish Kaye, Mary McCuistion, Rebecca Gulotta, and David A. Shamma. 2014. Money talks: tracking personal finances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 521--530.  ",
      "doi": "10.1145/2556288.2556975"
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for Mental Wellness: Understanding Expert Perspectives and Student Experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 629--641.  ",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Elisabeth T. Kersten-van Dijk, Joyce H.D.M. Westerink, Femke Beute, and Wijnand A. IJsselsteijn. 2017. Personal Informatics, Self-Insight, and Behavior Change: A Critical Review of Current Literature. Human-Computer Interaction: 1--29.  ",
      "doi": "10.1080/07370024.2016.1276456"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Bongshin Lee, Eun Kyoung Choe, and Jinwook Seo. 2017. OmniTrack: A Flexible Self-Tracking Approach Leveraging SemiAutomated Tracking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3: 28.  ",
      "doi": "10.1145/3130930"
    },
    {
      "text": "Karina Kusk, Dorthe B. Nielsen, Troels Thylstrup, Niels Holm Rasmussen, Jacob Jorvang, Christian F. Pedersen, and Steffen Wagner. 2013. Feasibility of using a lightweight context-aware system for facilitating reliable home blood pressure selfmeasurements. In Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2013 7th International Conference on, 236--239.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252107"
    },
    {
      "text": "Amanda Lazar, Christian Koehler, Joshua Tanenbaum, and David H. Nguyen. 2015. Why We Use and Abandon Smart Devices. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 635--646.  ",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Effie Le Moignan, Shaun Lawson, Duncan A. Rowland, Jamie Mahoney, and Pam Briggs. 2017. Has Instagram Fundamentally Altered the \"Family Snapshot\"? In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 4935--4947.  ",
      "doi": "10.1145/3025453.3025928"
    },
    {
      "text": "Stephen J Lepore and Joshua M Smyth. 2003. The Writing Cure: How Expressive Writing Promotes Health and Well-Being. Journal of Poetry Therapy 16, 3: 177--179.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stagebased Model of Personal Informatics Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game. In UbiComp 2006: Ubiquitous Computing, 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Giorgia Lupi and Stefanie Posavec. 2016. Dear data. Particular Books, {London} UK.",
      "doi": ""
    },
    {
      "text": "D. Lupton. 2014. Self-tracking cultures: Towards a sociology of personal informatics. OzCHI'14. Sydney: ACM Publishing.  ",
      "doi": "10.1145/2686612.2686623"
    },
    {
      "text": "Haley MacLeod, Anthony Tang, and Sheelagh Carpendale. 2013. Personal informatics in chronic illness management. In Proceedings of Graphics Interface 2013, 149--156. ",
      "doi": "10.5555/2532129.2532155"
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: Investigation of Social Scaffolding for Reflective Thinking in Diabetes Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Zameena Mejia. 2017. How the creator behind the viral bullet journal turned his own life hack into a full-time business. Retrieved September 16, 2017 from https://www.cnbc.com/2017/08/02/how-the-creatorbehind-the-viral-bullet-journal-turned-his-own-lifehack-into-a-full-time-business.html",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Trans. Comput.- Hum. Interact. 22, 6: 33:1--33:45.  ",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Aisling Ann O'Kane, Yvonne Rogers, and Ann E. Blandford. 2015. Concealing or Revealing Mobile Medical Devices?: Designing for Onstage and Offstage Presentation. In Proceedings of the 33rd annual ACM conference on human factors in computing systems, 1689--1698.  ",
      "doi": "10.1145/2702123.2702453"
    },
    {
      "text": "Sun Young Park and Yunan Chen. 2015. Individual and Social Recognition: Challenges and Opportunities in Migraine Management. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1540--1551.  ",
      "doi": "10.1145/2675133.2675248"
    },
    {
      "text": "Zachary Pousman, John Stasko, and Michael Mateas. 2007. Casual Information Visualization: Depictions of Data in Everyday Life. IEEE Transactions on Visualization and Computer Graphics 13, 6: 1145-- 1152.  ",
      "doi": "10.1109/TVCG.2007.70541"
    },
    {
      "text": "Ruth Ravichandran, Sang-Wha Sien, Shwetak N. Patel, Julie A. Kientz, and Laura R. Pina. 2017. Making Sense of Sleep Sensors: How Sleep Sensing Technologies Support and Undermine Sleep Health. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 6864--6875.  ",
      "doi": "10.1145/3025453.3025557"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal Tracking As Lived Informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Donald A Schön. 1983. The reflective practitioner: How professionals think in action. Basic books.",
      "doi": ""
    },
    {
      "text": "Abigail J. Sellen and Richard H. R. Harper. 2003. The myth of the paperless office. MIT Press, Cambridge, Mass. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Abigail J. Sellen and Steve Whittaker. 2010. Beyond total capture: a constructive critique of lifelogging. Communications of the ACM 53, 5: 70--77.  ",
      "doi": "10.1145/1735223.1735243"
    },
    {
      "text": "Kayla Smolarski, Kristy Leone, and Steven J. Robbins. 2015. Reducing Negative Mood Through Drawing: Comparing Venting, Positive Expression, and Tracing. Art Therapy 32, 4: 197--201.",
      "doi": ""
    },
    {
      "text": "Cristiano Storni. 2013. Design challenges for ubiquitous and personal computing in chronic disease care and patient empowerment: a case study rethinking diabetes self-monitoring. Personal and Ubiquitous Computing 18, 5: 1277--1290.  ",
      "doi": "10.1007/s00779-013-0707-6"
    },
    {
      "text": "Leanne Townsend and Claire Wallace. Social Media Research: A Guide to Ethics. Retrieved from http://www.dotrural.ac.uk/socialmediaresearchethics.p df",
      "doi": ""
    },
    {
      "text": "Max G. Van Kleek, Michael Bernstein, Katrina Panovich, Gregory G. Vargas, David R. Karger, and Mc Schraefel. 2009. Note to self: examining personal information keeping in a lightweight note-taking tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1477.  ",
      "doi": "10.1145/1518701.1518924"
    },
    {
      "text": "Julio Vega, Samuel Couth, Ellen Poliakoff, Sonja Kotz, Matthew Sullivan, Caroline Jay, Markel Vigo, and Simon Harper. Back to Analogue: Self-Reporting for Parkinson's Disease. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18).  ",
      "doi": "10.1145/3173574.3173648"
    },
    {
      "text": "Helena Webb, Marina Jirotka, Bernd Carsten Stahl, William Housley, Adam Edwards, Matthew Williams, Rob Procter, Omer Rana, and Pete Burnap. 2017. The Ethical Challenges of Publishing Twitter Data for Research Dissemination. In Proceedings of the 2017 ACM on Web Science Conference (WebSci '17), 339-- 348.  ",
      "doi": "10.1145/3091478.3091489"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing Moods: How Manual Tracking by Family Caregivers Improves Caring and Family Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 158--169.  ",
      "doi": "10.1145/3025453.3025843"
    },
    {
      "text": "J. K. Zia, C.-F. Chung, J. Schroeder, S. A. Munson, J. A. Kientz, J. Fogarty, E. Bales, J. M. Schenk, and M. M. Heitkemper. 2017. The feasibility, usability, and clinical utility of traditional paper food and symptom journals for patients with irritable bowel syndrome. Neurogastroenterology & Motility 29, 2: e12935.",
      "doi": ""
    }
  ]
}