{
  "doi": "10.1145/3173574.3173822",
  "title": "SpaceTokens: Interactive Map Widgets for Location-centric Interactions",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Map users often need to interact repetitively with multiple important locations. For example, a traveler may frequently check her hotel or a train station on a map, use them to localize an unknown location, or investigate routes involving them. Ironically, these location-centric tasks cannot be performed using locations directly; users must instead pan and zoom the map or use a menu to access locations. We propose SpaceTokens, interactive widgets that act as clones of locations, and which users can create and place on map edges like virtual whiteboard magnets. SpaceTokens make location a first-class citizen of map interaction. They empower users to rapidly perform location-centric tasks directly using locations: users can select combinations of on-screen locations and SpaceTokens to control the map window, or connect them to create routes. Participants in a study overwhelmingly preferred a SpaceTokens prototype over Google Maps on identical smartphones for the majority of tasks.",
  "authors": [
    {
      "name": "Daniel Miau",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/do/10.1145/contrib-99659021744/rel-imgonly/img_1520.jpg",
      "acmid": "99659021744",
      "orcid": "missing"
    },
    {
      "name": "Steven Feiner",
      "institution": "Columbia University, New York City, NY, USA",
      "img": "/do/10.1145/contrib-81100427474/rel-imgonly/feiner02nothumb.png",
      "acmid": "81100427474",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Eytan Adar, Jaime Teevan, and Susan T Dumais. 2008. Large scale analysis of web revisitation patterns. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 1197--1206.  ",
      "doi": "10.1145/1357054.1357241"
    },
    {
      "text": "Maneesh Agrawala and Chris Stolte. 2001. Rendering effective route maps: improving usability through generalization. In Proceedings of the 28th annual conference on Computer graphics and interactive techniques. ACM, 241--249.  ",
      "doi": "10.1145/383259.383286"
    },
    {
      "text": "Jason Alexander, Andy Cockburn, Stephen Fitchett, Carl Gutwin, and Saul Greenberg. 2009. Revisiting read wear: analysis, design, and evaluation of a footprints scrollbar. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1665--1674.  ",
      "doi": "10.1145/1518701.1518957"
    },
    {
      "text": "Caroline Appert and Jean-Daniel Fekete. 2006. OrthoZoom scroller: 1D multi-scale navigation. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 21--30.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "Apple. 2017. Apple Maps location sharing. (2017). https://support.apple.com/en-us/HT201493",
      "doi": ""
    },
    {
      "text": "Anthony J Aretz. 1991. The design of electronic map displays. Human Factors: The Journal of the Human Factors and Ergonomics Society 33, 1 (1991), 85--101.  ",
      "doi": "10.1177/001872089103300107"
    },
    {
      "text": "Patrick Baudisch and Ruth Rosenholtz. 2003. Halo: a technique for visualizing off-screen objects. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 481--488.  ",
      "doi": "10.1145/642611.642695"
    },
    {
      "text": "John Brosz, Miguel A Nacenta, Richard Pusch, Sheelagh Carpendale, and Christophe Hurter. 2013. Transmogrification: causal manipulation of visualizations. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, 97--106.  ",
      "doi": "10.1145/2501988.2502046"
    },
    {
      "text": "Yang Cao, Hai Wang, Changhu Wang, Zhiwei Li, Liqing Zhang, and Lei Zhang. 2010. Mindfinder: interactive sketch-based image search on millions of images. In Proceedings of the 18th ACM international conference on Multimedia. ACM, 1605--1608.  ",
      "doi": "10.1145/1873951.1874299"
    },
    {
      "text": "M Sheelagh T Carpendale and Catherine Montagnese. 2001. A framework for unifying presentation space. In Proceedings of the 14th annual ACM symposium on User interface software and technology. ACM, 61--70.  ",
      "doi": "10.1145/502348.502358"
    },
    {
      "text": "Tao Chen, Ming-Ming Cheng, Ping Tan, Ariel Shamir, and Shi-Min Hu. 2009. Sketch2photo: Internet image montage. ACM Transactions on Graphics (TOG) 28, 5 (2009), 124.  ",
      "doi": "10.1145/1618452.1618470"
    },
    {
      "text": "Mei C Chuah, Steven F Roth, Joe Mattis, and John Kolojejchick. 1995. SDM: Selective dynamic manipulation of visualizations. In Proceedings of the 8th annual ACM symposium on User interface and software technology. ACM, 61--70.  ",
      "doi": "10.1145/215585.215654"
    },
    {
      "text": "Andy Cockburn and Bruce McKenzie. 2001. What do web users do? An empirical analysis of web use. International Journal of human-computer studies 54, 6 (2001), 903--922.  ",
      "doi": "10.1006/ijhc.2001.0459"
    },
    {
      "text": "Mathias Eitz, Ronald Richter, Kristian Hildebrand, Tamy Boubekeur, and Marc Alexa. 2011. Photosketcher: interactive sketch-based image synthesis. IEEE Computer Graphics and Applications 31, 6 (2011), 56--66.  ",
      "doi": "10.1109/MCG.2011.67"
    },
    {
      "text": "Niklas Elmqvist, Nathalie Henry, Yann Riche, and Jean-Daniel Fekete. 2008. Melange: space folding for multi-focus interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1333--1342.  ",
      "doi": "10.1145/1357054.1357263"
    },
    {
      "text": "George W Furnas and Benjamin B Bederson. 1995. Space-scale diagrams: Understanding multiscale interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., 234--241.  ",
      "doi": "10.1145/223904.223934"
    },
    {
      "text": "Google. 2017a. Google Maps iOS SDK. (2017). https://developers.google.com/maps",
      "doi": ""
    },
    {
      "text": "Google. 2017b. Google Maps mobile. (2017). https://www.google.com/maps/about/",
      "doi": ""
    },
    {
      "text": "Google. 2017c. Google Maps Real-Time Location Sharing. (2017). https://blog.google/products/maps/ share-your-trips-and-real-time-location-google-maps/",
      "doi": ""
    },
    {
      "text": "Sean Gustafson, Patrick Baudisch, Carl Gutwin, and Pourang Irani. 2008. Wedge: clutter-free visualization of off-screen locations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 787--796.  ",
      "doi": "10.1145/1357054.1357179"
    },
    {
      "text": "Jeffrey Heer, Jock D Mackinlay, Chris Stolte, and Maneesh Agrawala. 2008. Graphical histories for visualization: Supporting analysis, communication, and evaluation. Visualization and Computer Graphics, IEEE Transactions on 14, 6 (2008), 1189--1196.  ",
      "doi": "10.1109/TVCG.2008.137"
    },
    {
      "text": "William C Hill, James D Hollan, Dave Wroblewski, and Tim McCandless. 1992. Edit wear and read wear. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Christian Holz and Steven Feiner. 2009. Relaxed selection techniques for querying time-series graphs. In Proceedings of the 22nd annual ACM symposium on User interface software and technology. ACM, 213--222.  ",
      "doi": "10.1145/1622176.1622217"
    },
    {
      "text": "Zahid Hossain, Khalad Hasan, Hai-Ning Liang, and Pourang Irani. 2012. EdgeSplit: facilitating the selection of off-screen objects. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services. ACM, 79--82.  ",
      "doi": "10.1145/2371574.2371588"
    },
    {
      "text": "Takeo Igarashi and Ken Hinckley. 2000. Speed-dependent automatic zooming for browsing large documents. In Proceedings of the 13th annual ACM symposium on User interface software and technology. ACM, 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Alexandra Ion, Y-L Betty Chang, Michael Haller, Mark Hancock, and Stacey D Scott. 2013. Canyon: providing location awareness of multiple moving objects in a detail view on large displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3149--3158.  ",
      "doi": "10.1145/2470654.2466431"
    },
    {
      "text": "Edward W Ishak and Steven K Feiner. 2006. Content-aware scrolling. In Proceedings of the 19th annual ACM symposium on User interface software and technology. ACM, 155--158.  ",
      "doi": "10.1145/1166253.1166277"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. ACM, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Charles E Jacobs, Adam Finkelstein, and David H Salesin. 1995. Fast multiresolution image querying. In Proceedings of the 22nd annual conference on Computer graphics and interactive techniques. ACM, 277--286.  ",
      "doi": "10.1145/218380.218454"
    },
    {
      "text": "Waqas Javed, Sohaib Ghani, and Niklas Elmqvist. 2012. Polyzoom: multiscale and multifocus exploration in 2d visual spaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 287--296.  ",
      "doi": "10.1145/2207676.2207716"
    },
    {
      "text": "Juho Kim, Amy X Zhang, Jihee Kim, Robert C Miller, and Krzysztof Z Gajos. 2014. Content-aware kinetic scrolling for supporting web page navigation. In Proc. of UIST.  ",
      "doi": "10.1145/2642918.2647401"
    },
    {
      "text": "Sari A Laakso, Karri Pekka Laakso, and Asko J Saura. 2000. Improved scroll bars. In CHI'00 Extended Abstracts on Human Factors in Computing Systems. ACM, 97--98.  ",
      "doi": "10.1145/633292.633350"
    },
    {
      "text": "Yong Jae Lee, C Lawrence Zitnick, and Michael F Cohen. 2011. ShadowDraw: real-time user guidance for freehand drawing. In ACM Transactions on Graphics (TOG), Vol. 30. ACM, 27.  ",
      "doi": "10.1145/2010324.1964922"
    },
    {
      "text": "Kevin Lynch. 1960. The image of the city. MIT press.",
      "doi": ""
    },
    {
      "text": "Daniel Miau and Steven Feiner. 2016. Personalized Compass: A Compact Visualization for Direction and Location. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5114--5125.  ",
      "doi": "10.1145/2858036.2858068"
    },
    {
      "text": "Microsoft. 2017. Bing Maps. (2017). https://www.bing.com/maps/",
      "doi": ""
    },
    {
      "text": "Dan R. Olsen, Jr. 1992. The Interaction Technique Notebook: Bookmarks: An Enhanced Scroll Bar. ACM Trans. Graph. 11, 3 (July 1992), 291--295.  ",
      "doi": "10.1145/130881.370595"
    },
    {
      "text": "Gian Pangaro, Dan Maynes-Aminzade, and Hiroshi Ishii. 2002. The actuated workbench: computer-controlled actuation in tabletop tangible interfaces. In Proceedings of the 15th annual ACM symposium on User interface software and technology. ACM, 181--190.  ",
      "doi": "10.1145/571985.572011"
    },
    {
      "text": "Daniel C Robbins, Edward Cutrell, Raman Sarin, and Eric Horvitz. 2004. ZoneZoom: map navigation for smartphones with recursive view segmentation. In Proceedings of the working conference on Advanced visual interfaces. ACM, 231--234.  ",
      "doi": "10.1145/989863.989901"
    },
    {
      "text": "Manojit Sarkar and Marc H Brown. 1992. Graphical fisheye views of graphs. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 83--91.  ",
      "doi": "10.1145/142750.142763"
    },
    {
      "text": "Manojit Sarkar, Scott S Snibbe, Oren J Tversky, and Steven P Reiss. 1993. Stretching the rubber sheet: a metaphor for viewing large layouts on small screens. In Proceedings of the 6th annual ACM symposium on User interface software and technology. ACM, 81--91.  ",
      "doi": "10.1145/168642.168650"
    },
    {
      "text": "Brygg Ullmer and Hiroshi Ishii. 1997. The metaDESK: models and prototypes for tangible user interfaces. In Proceedings of the 10th annual ACM symposium on User interface software and technology. ACM, 223--232.  ",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "Brygg Ullmer, Hiroshi Ishii, and Dylan Glas. 1998. mediaBlocks: physical containers, transports, and controls for online media. In Proceedings of the 25th annual conference on Computer graphics and interactive techniques. ACM, 379--386.  ",
      "doi": "10.1145/280814.280940"
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: a technique for operating pen-based interfaces using touch. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Fangzhou Wang, Yang Li, Daisuke Sakamoto, and Takeo Igarashi. 2014. Hierarchical route maps for efficient navigation. In Proceedings of the 19th international conference on Intelligent User Interfaces. ACM, 169--178.  ",
      "doi": "10.1145/2557500.2557514"
    },
    {
      "text": "Dirk Wenig, Johannes Schöning, Brent Hecht, and Rainer Malaka. 2015. StripeMaps: Improving Map-based Pedestrian Navigation for Smartwatches. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 52--62.  ",
      "doi": "10.1145/2785830.2785862"
    },
    {
      "text": "Jian Zhao, Daniel Wigdor, and Ravin Balakrishnan. 2013. TrailMap: facilitating information seeking in a multi-scale digital map via implicit bookmarking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3009--3018.  ",
      "doi": "10.1145/2470654.2481417"
    },
    {
      "text": "Huiyuan Zhou, Aisha Edrah, Bonnie MacKay, and Derek Reilly. 2017. Block Party: Synchronized Planning and Navigation Views for Neighbourhood Expeditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1702--1713.  ",
      "doi": "10.1145/3025453.3026035"
    }
  ]
}