{
  "doi": "10.1145/3173574.3173638",
  "title": "Depth Conflict Reduction for Stereo VR Video Interfaces",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "Applications for viewing and editing 360° video often render user interface (UI) elements on top of the video. For stereoscopic video, in which the perceived depth varies over the image, the perceived depth of the video can conflict with that of the UI elements, creating discomfort and making it hard to shift focus. To address this problem, we explore two new techniques that adjust the UI rendering based on the video content. The first technique dynamically adjusts the perceived depth of the UI to avoid depth conflict, and the second blurs the video in a halo around the UI. We conduct a user study to assess the effectiveness of these techniques in two stereoscopic VR video tasks: video watching with subtitles, and video search.",
  "tags": [
    "360",
    "subtitles",
    "stereoscopic",
    "virtual reality",
    "video interface"
  ],
  "authors": [
    {
      "name": "Cuong Nguyen",
      "institution": "Portland State University, Portland, OR, USA",
      "img": "/do/10.1145/contrib-81502644262/rel-imgonly/avatar.jpg",
      "acmid": "81502644262",
      "orcid": "0000-0001-9234-9960"
    },
    {
      "name": "Stephen DiVerdi",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340488763",
      "orcid": "missing"
    },
    {
      "name": "Aaron Hertzmann",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100015154",
      "orcid": "missing"
    },
    {
      "name": "Feng Liu",
      "institution": "Portland State University, Portland, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310489042",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. Binocular Vision, Stereoscopic Imaging and Depth Cues. (2017). https://developer.oculus.com/design/ latest/concepts/bp_app_imaging/",
      "doi": ""
    },
    {
      "text": "Robert Anderson, David Gallup, Jonathan T. Barron, Janne Kontkanen, Noah Snavely, Carlos Hernández, Sameer Agarwal, and Steven M. Seitz. 2016. Jump: virtual reality video. ACM Transactions on Graphics 35, 6 (nov 2016), 1--13.  ",
      "doi": "10.1145/2980179.2980257"
    },
    {
      "text": "Stephen R Arnott and Judith M Shedden. 2000. Attention switching in depth using random-dot autostereograms: Attention gradient asymmetries. Attention, Perception, & Psychophysics 62, 7 (2000), 1459--1473.",
      "doi": ""
    },
    {
      "text": "Blaine Bell, Steven Feiner, and Tobias Höllerer. 2001. View management for virtual and augmented reality. In Proceedings of the 14th annual ACM symposium on User interface software and technology. ACM, 101--110.  ",
      "doi": "10.1145/502348.502363"
    },
    {
      "text": "Anastasia Bezerianos, Pierre Dragicevic, and Ravin Balakrishnan. 2006. Mnemonic Rendering: An Image-Based Approach for Exposing Hidden Changes in Dynamic Displays. In Proceedings of the 19th annual ACM symposium on User interface software and technology - UIST '06. ACM Press, New York, New York, USA, 159.  ",
      "doi": "10.1145/1166253.1166279"
    },
    {
      "text": "Tobias Blum, Matthias Wieczorek, Andre Aichert, Radhika Tibrewal, and Nassir Navab. 2010. The effect of out-of-focus blur on visual discomfort when using stereo displays. In 2010 IEEE International Symposium on Mixed and Augmented Reality. IEEE, 13--17.",
      "doi": ""
    },
    {
      "text": "David K. Broberg. 2011. Infrastructures for Home Delivery, Interfacing, Captioning, and Viewing of 3-D Content. Proc. IEEE 99, 4 (apr 2011), 684--693.",
      "doi": ""
    },
    {
      "text": "Jacqueline Chu, Chris Bryan, Min Shih, Leonardo Ferrer, and Kwan-Liu Ma. 2017. Navigable Videos for Presenting Scientific Data on Affordable Head-Mounted Displays. In Proceedings of the 8th ACM on Multimedia Systems Conference - MMSys'17. ACM Press, New York, New York, USA, 250--260.  ",
      "doi": "10.1145/3083187.3084015"
    },
    {
      "text": "Bleeding Disorders Community. 2017. Factor Treatment in Hemophilia A and B. Video. (9 June 2017). Retrieved August 22, 2017 from https://www.youtube.com/watch?v=tHbFY5G3GVs.",
      "doi": ""
    },
    {
      "text": "Joao L C Dasilva. 2017. period film scene full VR 360 3D on film set. Video. (2 September 2017). Retrieved August 22, 2017 from https://www.youtube.com/watch?v=nH1xJox61z4.",
      "doi": ""
    },
    {
      "text": "IRALTA VR Productora de video. 2016. 360 3D The Circus School CARAMPA. Video. (19 February 2016). Retrieved August 22, 2017 from https://www.youtube.com/watch?v=tABJlVww-2M.",
      "doi": ""
    },
    {
      "text": "devinsupertramp. 2017. Terrifying Masquerade Party in 3D 360!! Video. (8 February 2017). Retrieved August 22, 2017 from https://www.youtube.com/watch?v=mb_J_bMor1g.",
      "doi": ""
    },
    {
      "text": "Piotr Didyk, Tobias Ritschel, Elmar Eisemann, Karol Myszkowski, Hans-Peter Seidel, and Wojciech Matusik. 2012. A luminance-contrast-aware disparity model and applications. ACM Transactions on Graphics 31, 6 (nov 2012), 1.  ",
      "doi": "10.1145/2366145.2366203"
    },
    {
      "text": "Adeola Fabola, Alan Miller, and Richard Fawcett. 2015. Exploring the past with Google Cardboard. In Digital Heritage, 2015, Vol. 1. IEEE, 277--284.",
      "doi": ""
    },
    {
      "text": "Steven Feiner, Blair MacIntyre, Marcus Haupt, and Eliot Solomon. 1993. Windows on the world: 2D windows for 3D augmented reality. In Proceedings of the 6th annual ACM symposium on User interface software and technology. ACM, 145--155.  ",
      "doi": "10.1145/168642.168657"
    },
    {
      "text": "Davide Gadia, Marco Granato, Dario Maggiorini, Laura Anna Ripamonti, and Cinzia Vismara. 2017. Consumer-oriented Head Mounted Displays: Analysis and Evaluation of Stereoscopic Characteristics and User Preferences. Mobile Networks and Applications February (feb 2017), 1--11.  ",
      "doi": "10.1007/s11036-017-0834-9"
    },
    {
      "text": "ZDF Enterprises GmbH. 2017. Gladiators In The Roman Colosseum VR 3D 360°. Video. (28 February 2017). Retrieved August 22, 2017 from https://www.youtube.com/watch?v=XBuijx_iZtQ.",
      "doi": ""
    },
    {
      "text": "David M Hoffman and Martin S Banks. 2010. Focus information is used to interpret binocular images. Journal of vision 10, 5 (2010), 13.",
      "doi": ""
    },
    {
      "text": "Hong Hua. 2017. Enabling Focus Cues in Head-Mounted Displays. Proc. IEEE 105, 5 (may 2017), 805--824.",
      "doi": ""
    },
    {
      "text": "Jingwei Huang, Zhili Chen, Duygu Ceylan, and Hailin Jin. 2017. 6-DOF VR videos with a single 360-camera. In 2017 IEEE Virtual Reality (VR). IEEE, 37--44.",
      "doi": ""
    },
    {
      "text": "Robert Kennedy, Norman Lane, Kevin Berbaum, and Michael Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. (1993).",
      "doi": ""
    },
    {
      "text": "Johannes Kopf. 2016. 360 video stabilization. ACM Transactions on Graphics (TOG) 35, 6 (2016), 195.  ",
      "doi": "10.1145/2980179.2982405"
    },
    {
      "text": "Gregory Kramida and Amitabh Varshney. 2015. Resolving the Vergence-Accommodation Conflict in Head Mounted Displays. IEEE Transactions on Visualization and Computer Graphics 22, 7 (2015), 1--16.",
      "doi": ""
    },
    {
      "text": "Arun Kulshreshth and Joseph J. LaViola. 2016. Dynamic Stereoscopic 3D Parameter Adjustment for Enhanced Depth Discrimination. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16. ACM Press, New York, New York, USA, 177--187.  ",
      "doi": "10.1145/2858036.2858078"
    },
    {
      "text": "Jeremy Lacoche, Morgan Le Chenechal, Sebastien Chalme, Jerome Royan, Thierry Duval, Valerie Gouranton, Eric Maisel, and Bruno Arnaldi. 2015. Dealing with frame cancellation for stereoscopic displays in 3D user interfaces. In 2015 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 73--80.",
      "doi": ""
    },
    {
      "text": "M. Lambooij, M.J. Murdoch, W.A. IJsselsteijn, and I. Heynderickx. 2013. The impact of video characteristics and subtitles on visual comfort of 3D TV. Displays 34, 1 (jan 2013), 8--16.",
      "doi": ""
    },
    {
      "text": "Marc T. M. Lambooij, Wijnand A. IJsselsteijn, and Ingrid Heynderickx. 2007. Visual discomfort in stereoscopic displays: a review. 6490, May 2010 (2007), 64900I.",
      "doi": ""
    },
    {
      "text": "Robert S. Laramee and Colin Ware. 2002. Rivalry and interference with a head-mounted display. ACM Transactions on Computer-Human Interaction 9, 3 (sep 2002), 238--251.  ",
      "doi": "10.1145/568513.568516"
    },
    {
      "text": "Andrew MacQuarrie and Anthony Steed. 2017. Cinematic virtual reality: Evaluating the effect of display type on the viewing experience for panoramic video. In Virtual Reality (VR), 2017 IEEE. IEEE, 45--54.",
      "doi": ""
    },
    {
      "text": "Kevin Matzen, Michael F. Cohen, Bryce Evans, Johannes Kopf, and Richard Szeliski. 2017. Low-cost 360 stereo photography and video capture. ACM Trans. Graphics (2017).  ",
      "doi": "10.1145/3072959.3073645"
    },
    {
      "text": "Ming Hou. 2003. A model of real-virtual object interactions in stereoscopic augmented reality environments. In Proceedings on Seventh International Conference on Information Visualization, 2003. IV 2003., Vol. 2003-Janua. IEEE Comput. Soc, 512--517. ",
      "doi": "10.5555/938981.939630"
    },
    {
      "text": "Cuong Nguyen, Stephen DiVerdi, Aaron Hertzmann, and Feng Liu. 2017a. CollaVR: Collaborative In-Headset Review for VR Video. In ACM symposium on User interface software and technology - UIST '17. ACM.  ",
      "doi": "10.1145/3126594.3126659"
    },
    {
      "text": "Cuong Nguyen, Stephen DiVerdi, Aaron Hertzmann, and Feng Liu. 2017b. Vremiere: In-Headset Virtual Reality Video Editing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems CHI '17. ACM Press, New York, New York, USA, 5428--5438.  ",
      "doi": "10.1145/3025453.3025675"
    },
    {
      "text": "Thomas Oskam, Alexander Hornung, Huw Bowles, Kenny Mitchell, and Markus Gross. 2011. OSCAM optimized stereoscopic camera control for interactive 3D. In Proceedings of the 2011 SIGGRAPH Asia Conference on - SA '11. ACM Press, New York, New York, USA, 1.  ",
      "doi": "10.1145/2024156.2024223"
    },
    {
      "text": "Javier Sánchez Pérez, Enric Meinhardt-Llopis, and Gabriele Facciolo. 2013. TV-L1 optical flow estimation. Image Processing On Line 2013 (2013), 137--150.",
      "doi": ""
    },
    {
      "text": "Stephan Reichelt, Ralf Häussler, Gerald Fütterer, and Norbert Leister. 2010. Depth cues in human visual perception and their realization in 3D displays. In Proc. SPIE, Vol. 7690. 76900B.",
      "doi": ""
    },
    {
      "text": "Leila Schemali and Elmar Eisemann. 2014. Design and evaluation of mouse cursors in a stereoscopic desktop environment. In 2014 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 67--70.",
      "doi": ""
    },
    {
      "text": "Jonas Schild, Liane Bölicke, Joseph J. LaViola Jr., and Maic Masuch. 2013. Creating and analyzing stereoscopic 3D graphical user interfaces in digital games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, New York, New York, USA, 169.  ",
      "doi": "10.1145/2470654.2470678"
    },
    {
      "text": "Jonas Schild, Joseph J. LaViola, and Maic Masuch. 2014. Altering gameplay behavior using stereoscopic 3D vision-based video game design. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, New York, New York, USA, 207--216.  ",
      "doi": "10.1145/2556288.2557283"
    },
    {
      "text": "Aljoscha Smolic, Peter Kauff, Sebastian Knorr, Alexander Hornung, Matthias Kunter, M MuÌ´ Lller, and Manuel Lang. 2011. Three-Dimensional Video Postproduction and Processing. Proc. IEEE 99, 4 (apr 2011), 607--625.",
      "doi": ""
    },
    {
      "text": "Filippo Speranza, Wa J Tam, Ron Renaud, and Namho Hur. 2006. Effect of disparity and motion on visual comfort of stereoscopic images. In Proceedings of SPIE: Stereoscopic Displays and Virtual Reality Systems XIII, Andrew J. Woods, Neil A. Dodgson, John O. Merritt, Mark T. Bolas, and Ian E. McDowall (Eds.), Vol. 6055. 60550B.",
      "doi": ""
    },
    {
      "text": "Wa James Tam, Filippo Speranza, Carlos Vázquez, Ron Renaud, and Namho Hur. 2012. Visual comfort: stereoscopic objects moving in the horizontal and mid-sagittal planes. In Proc. SPIE, Andrew J. Woods, Nicolas S. Holliman, and Gregg E. Favalora (Eds.), Vol. 8288. 828813.",
      "doi": ""
    },
    {
      "text": "Junle Wang, Patrick Le Callet, Sylvain Tourancheau, Vincent Ricordel, and Matthieu Perreira Da Silva. 2012. Study of depth bias of observers in free viewing of still stereoscopic synthetic stimuli. Journal of Eye Movement Research 5, 5 (2012).",
      "doi": ""
    },
    {
      "text": "Colin Ware. 1995. Dynamic stereo displays. Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '95 (1995), 310--316.  ",
      "doi": "10.1145/223904.223944"
    },
    {
      "text": "Yong Jung, Hosik Sohn, Seong-il Lee, and Yong Ro. 2014. Visual comfort improvement in stereoscopic 3D displays using perceptually plausible assessment metric of visual comfort. IEEE Transactions on Consumer Electronics 60, 1 (feb 2014), 1--9.",
      "doi": ""
    }
  ]
}