{
  "doi": "10.1145/3173574.3173846",
  "title": "Graphical Perception of Continuous Quantitative Maps: the Effects of Spatial Frequency and Colormap Design",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Continuous 'pseudocolor' maps visualize how a quantitative attribute varies smoothly over space. These maps are widely used by experts and lay citizens alike for communicating scientific and geographical data. A critical challenge for designers of these maps is selecting a color scheme that is both effective and aesthetically pleasing. Although there exist empirically grounded guidelines for color choice in segmented maps (e.g., choropleths), continuous maps are significantly understudies, and their color-coding guidelines are largely based on expert opinion and design heuristics--many of these guidelines have yet to be verified experimentally. We conducted a series of crowdsourced experiments to investigate how the perception of continuous maps is affected by colormap characteristics and spatial frequency (a measure of data complexity). We find that spatial frequency significantly impacts the effectiveness of color encodes, but the precise effect is task-dependent. While rainbow schemes afforded the highest accuracy in quantity estimation irrespective of spatial complexity, divergent colormaps significantly outperformed other schemes in tasks requiring the perception of high-frequency patterns. We interpret these results in relation to current practices, and devise new and more granular guidelines for color mapping in continuous maps.",
  "tags": [
    "perception",
    "scalar field visualization",
    "continuous colormaps"
  ],
  "authors": [
    {
      "name": "Khairi Reda",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81552730756",
      "orcid": "0000-0002-8096-658X"
    },
    {
      "name": "Pratik Nalawade",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261168",
      "orcid": "missing"
    },
    {
      "name": "Kate Ansah-Koi",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261283",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-level components of analytic activity in information visualization. In Information Visualization, 2005. INFOVIS 2005. IEEE Symposium on. IEEE, 111--117.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Lawrence D Bergman, Bernice E Rogowitz, and Lloyd A Treinish. 1995. A rule-based tool for assisting colormap selection. In Proceedings of the 6th conference on Visualization'95. IEEE Computer Society, 118. ",
      "doi": "10.5555/832271.833862"
    },
    {
      "text": "Michelle Borkin, Krzysztof Gajos, Amanda Peters, Dimitrios Mitsouras, Simone Melchionna, Frank Rybicki, Charles Feldman, and Hanspeter Pfister. 2011. Evaluation of artery visualizations for heart disease diagnosis. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2479--2488.  ",
      "doi": "10.1109/TVCG.2011.192"
    },
    {
      "text": "David Borland and Russell M Taylor Ii. 2007. Rainbow color map (still) considered harmful. IEEE Computer Graphics and Applications 27, 2 (2007).  ",
      "doi": "10.1109/MCG.2007.323435"
    },
    {
      "text": "Cynthia A Brewer. 1994. Visualization in Modern Cartography. Elsevier Science, Chapter Color use guidelines for mapping and visualization.",
      "doi": ""
    },
    {
      "text": "Cynthia A Brewer. 1996. Guidelines for selecting colors for diverging schemes on maps. The Cartographic Journal 33, 2 (1996), 79--86.",
      "doi": ""
    },
    {
      "text": "Cynthia A Brewer, Alan M MacEachren, Linda W Pickle, and Douglas Herrmann. 1997. Mapping mortality: Evaluating color schemes for choropleth maps. Annals of the Association of American Geographers 87, 3 (1997), 411--438.",
      "doi": ""
    },
    {
      "text": "Roxana Bujack, Terece L Turton, Francesca Samsel, Colin Ware, David H Rogers, and James Ahrens. 2017. The Good, the Bad, and the Ugly: A Theoretical Framework for the Assessment of Continuous Colormaps. IEEE Transactions on Visualization and Computer Graphics (2017).",
      "doi": ""
    },
    {
      "text": "William S Cleveland and William S Cleveland. 1983. A color-caused optical illusion on a statistical graph. The American Statistician 37, 2 (1983), 101--105.",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387 (1984), 531--554.",
      "doi": ""
    },
    {
      "text": "Russel De Valois and Karen De Valouis. 1990. Spatial Vision. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Russell L De Valois, Duane G Albrecht, and Lisa G Thorell. 1978. Cortical cells: bar and edge detectors, or spatial frequency filters? In Frontiers in visual science. Springer, 544--556.",
      "doi": ""
    },
    {
      "text": "Connor C Gramazio, David H Laidlaw, and Karen B Schloss. 2017. Colorgorical: Creating discriminable and preferable color palettes for information visualization. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 521--530.  ",
      "doi": "10.1109/TVCG.2016.2598918"
    },
    {
      "text": "D. A. Green. 2011. A colour scheme for the display of astronomical intensity images. Bulletin of the Astronomical Society of India 39 (June 2011), 289--295.",
      "doi": ""
    },
    {
      "text": "Mark Harrower and Cynthia A Brewer. 2003. ColorBrewer. org: an online tool for selecting colour schemes for maps. The Cartographic Journal 40, 1 (2003), 27--37.",
      "doi": ""
    },
    {
      "text": "Christopher G Healey. 1996. Choosing effective colours for data visualization. In Visualization'96. Proceedings. IEEE, 263--270. ",
      "doi": "10.5555/244979.245597"
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "GT Herman and H Levkowitz. 1992. Color scales for image data. Computer Graphics and Applications 12, 1 (1992), 72--80.  ",
      "doi": "10.1109/38.135886"
    },
    {
      "text": "Michael D Hyslop. 2006. A comparison of spectral color and greyscale continuous-tone map perception. Master's thesis. Michigan State University.",
      "doi": ""
    },
    {
      "text": "Alan David Kalvin, Bernice E Rogowitz, Adar Pelah, and Aron Cohen. 2000. Building perceptual color maps for visualizing interval data. In Human Vision and Electronic Imaging V, Vol. 3959. International Society for Optics and Photonics, 323--336.",
      "doi": ""
    },
    {
      "text": "Eamonn Keogh and Chotirat Ann Ratanamahatana. 2005. Exact indexing of dynamic time warping. Knowledge and information systems 7, 3 (2005), 358--386.  ",
      "doi": "10.5555/2993953.2994027"
    },
    {
      "text": "Gordon Kindlmann, Erik Reinhard, and Sarah Creem. 2002. Face-based luminance matching for perceptual colormap generation. In Proceedings of the Conference on Visualization'02. IEEE Computer Society, 299--306. ",
      "doi": "10.5555/602099.602145"
    },
    {
      "text": "Mark P Kumler and Richard E Groop. 1990. Continuous-tone mapping of smooth surfaces. Cartography and Geographic Information Systems 17, 4 (1990), 279--289.",
      "doi": ""
    },
    {
      "text": "Kenneth Moreland. 2009. Diverging color maps for scientific visualization. In International Symposium on Visual Computing. Springer, 92--103.  ",
      "doi": "10.1007/978-3-642-10520-3_9"
    },
    {
      "text": "Kenneth Moreland. 2016. Why We Use Bad Color Maps and What You Can Do About It. Electronic Imaging 2016, 16 (2016), 1--6.",
      "doi": ""
    },
    {
      "text": "Lace Padilla, P Samuel Quinan, Miriah Meyer, and Sarah H Creem-Regehr. 2017. Evaluating the Impact of Binning 2D Scalar Fields. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 431--440.  ",
      "doi": "10.1109/TVCG.2016.2599106"
    },
    {
      "text": "Stephen E Palmer. 1999. Vision science: Photons to phenomenology. MIT press.",
      "doi": ""
    },
    {
      "text": "Ken Perlin. 1985. An image synthesizer. ACM Siggraph Computer Graphics 19, 3 (1985), 287--296.  ",
      "doi": "10.1145/325165.325247"
    },
    {
      "text": "Linda Williams Pickle. 2003. Usability testing of map designs. In Proceedings of Symposium on the Interface of Computing Science and Statistics. 42--56.",
      "doi": ""
    },
    {
      "text": "P Samuel Quinan and Miriah Meyer. 2016. Visually comparing weather features in forecasts. IEEE transactions on visualization and computer graphics 22, 1 (2016), 389--398.",
      "doi": ""
    },
    {
      "text": "Penny L Rheingans. 2000. Task-based color scale design. In 28th AIPR Workshop: 3D Visualization for Data Exploration and Decision Making. International Society for Optics and Photonics, 35--43.",
      "doi": ""
    },
    {
      "text": "Bernice E Rogowitz and Lloyd A Treinish. 1994. Using perceptual rules in interactive visualization. In IST/SPIE 1994 International Symposium on Electronic Imaging: Science & Technology. International Society for Optics and Photonics, 287--295.",
      "doi": ""
    },
    {
      "text": "Bernice E Rogowitz, Lloyd A Treinish, Steve Bryson, and others. 1996. How not to lie with visualization. Computers in Physics 10, 3 (1996), 268--273.  ",
      "doi": "10.1063/1.4822401"
    },
    {
      "text": "Samuel Silva, Beatriz Sousa Santos, and Joaquim Madeira. 2011. Using color in visualization: A survey. Computers Graphics 35, 2 (2011), 320--333.  ",
      "doi": "10.1016/j.cag.2010.11.015"
    },
    {
      "text": "Maureen Stone, Danielle Albers Szafir, and Vidya Setlur. 2014. An engineering model for color difference as a function of size. In Color and Imaging Conference, Vol. 2014. Society for Imaging Science & Technology, 253--258.",
      "doi": ""
    },
    {
      "text": "Danielle Albers Szafir. 2017. Modeling Color Difference for Visualization Design. IEEE Transactions on Visualization and Computer Graphics (2017).",
      "doi": ""
    },
    {
      "text": "Christian Tominski, Georg Fuchs, and Heidrun Schumann. 2008. Task-driven color coding. In Information Visualisation, 2008. IV'08. 12th International Conference. IEEE, 373--380.  ",
      "doi": "10.1109/IV.2008.24"
    },
    {
      "text": "J Gregory Trafton, Susan S Kirschenbaum, Ted L Tsui, Robert T Miyamoto, James A Ballas, and Paula D Raymond. 2000. Turning pictures into numbers: extracting and generating information from complex visualizations. International Journal of Human-Computer Studies 53, 5 (2000), 827--850.  ",
      "doi": "10.1006/ijhc.2000.0419"
    },
    {
      "text": "Bruce E Trumbo. 1981. A theory for coloring bivariate statistical maps. The American Statistician 35, 4 (1981), 220--226.",
      "doi": ""
    },
    {
      "text": "W3C. 2016. CSS Values and Units Module Level 3. (2016). http://www.w3.org/TR/css3-values/#absolute-lengths",
      "doi": ""
    },
    {
      "text": "Colin Ware. 1988. Color sequences for univariate maps: Theory, experiments and principles. IEEE Computer Graphics and Applications 8, 5 (1988), 41--49.  ",
      "doi": "10.1109/38.7760"
    },
    {
      "text": "Colin Ware. 2012. Information visualization: perception for design. Elsevier. ",
      "doi": "10.5555/2285540"
    },
    {
      "text": "Liang Zhou and Charles D Hansen. 2016. A survey of colormaps in visualization. IEEE transactions on visualization and computer graphics 22, 8 (2016), 2051--2069.  ",
      "doi": "10.1109/TVCG.2015.2489649"
    }
  ]
}