{
  "doi": "10.1145/3173574.3174226",
  "title": "Cognitive Load Estimation in the Wild",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "Cognitive load has been shown, over hundreds of validated studies, to be an important variable for understanding human performance. However, establishing practical, non-contact approaches for automated estimation of cognitive load under real-world conditions is far from a solved problem. Toward the goal of designing such a system, we propose two novel vision-based methods for cognitive load estimation, and evaluate them on a large-scale dataset collected under real-world driving conditions. Cognitive load is defined by which of 3 levels of a validated reference task the observed subject was performing. On this 3-class problem, our best proposed method of using 3D convolutional neural networks achieves 86.1% accuracy at predicting task-induced cognitive load in a sample of 92 subjects from video alone. This work uses the driving context as a training and evaluation dataset, but the trained network is not constrained to the driving environment as it requires no calibration and makes no assumptions about the subject's visual appearance, activity, head pose, scale, and perspective.",
  "authors": [
    {
      "name": "Lex Fridman",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658990326",
      "orcid": "missing"
    },
    {
      "name": "Bryan Reimer",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392608432",
      "orcid": "missing"
    },
    {
      "name": "Bruce Mehler",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81416594701/rel-imgonly/brucemehlerstaffphoto2010.jpg",
      "acmid": "81416594701",
      "orcid": "missing"
    },
    {
      "name": "William T. Freeman",
      "institution": "Massachusetts Institute of Technology & Google Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452610969",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Linda S Angell, J Auflick, PA Austria, Dev S Kochhar, Louis Tijerina, W Biever, T Diptiman, J Hogsett, and S Kiger. 2006. Driver Workload Metrics. Technical Report.",
      "doi": ""
    },
    {
      "text": "Marie-Pierre Bruyas, Laëtitia Dumont, and France Bron. 2013. Sensitivity of Detection Response Task (DRT) to the driving demand and task difficulty. In Proceedings of the Seventh International Driving Symposium on Human Factors in Driver Assessment, Training, and Vehicle Design. 64--70.",
      "doi": ""
    },
    {
      "text": "Siyuan Chen and Julien Epps. 2013. Automatic classification of eye activity for cognitive load measurement with emotion interference. Computer methods and programs in biomedicine 110, 2 (2013), 111--124.  ",
      "doi": "10.1016/j.cmpb.2012.10.021"
    },
    {
      "text": "Melissa Patricia Coral. 2016. Analyzing Cognitive Workload Through Eye-related Measurements: A Meta-Analysis. Ph.D. Dissertation. Wright State University.",
      "doi": ""
    },
    {
      "text": "Lex Fridman, Daniel E. Brown, William Angell, Irman Abdic, Bryan Reimer, and Hae Young Noh. 2016a. Automated Synchronization of Driving Data Using Vibration and Steering Events. Pattern Recognition Letters (2016).  ",
      "doi": "10.1016/j.patrec.2016.02.011"
    },
    {
      "text": "Lex Fridman, Joonbum Lee, Bryan Reimer, and Trent Victor. 2016b. Owl and Lizard: Patterns of Head Pose and Eye Pose in Driver Gaze Classification. IET Computer Vision (2016).",
      "doi": ""
    },
    {
      "text": "Eija Haapalainen, SeungJun Kim, Jodi F Forlizzi, and Anind K Dey. 2010. Psycho-physiological measures for assessing cognitive load. In Proceedings of the 12th ACM international conference on Ubiquitous computing. ACM, 301--310.  ",
      "doi": "10.1145/1864349.1864395"
    },
    {
      "text": "Tal Hassner, Shai Harel, Eran Paz, and Roee Enbar. 2015. Effective face frontalization in unconstrained images. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 4295--4304.",
      "doi": ""
    },
    {
      "text": "Vahid Kazemi and Josephine Sullivan. 2014. One millisecond face alignment with an ensemble of regression trees. In Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference on. IEEE, 1867--1874.  ",
      "doi": "10.1109/CVPR.2014.241"
    },
    {
      "text": "Davis E. King. 2009. Dlib-ml: A Machine Learning Toolkit. Journal of Machine Learning Research 10 (2009), 1755--1758. ",
      "doi": "10.5555/1577069.1755843"
    },
    {
      "text": "Sergey Kirshner. 2005. Modeling of multivariate time series using hidden Markov models. Ph.D. Dissertation. UNIVERSITY OF CALIFORNIA, IRVINE. ",
      "doi": "10.5555/1087844"
    },
    {
      "text": "Rainer Lienhart and Jochen Maydt. 2002. An extended set of haar-like features for rapid object detection. In Image Processing. 2002. Proceedings. 2002 International Conference on, Vol. 1. IEEE, I--900.",
      "doi": ""
    },
    {
      "text": "Bruce Mehler, Bryan Reimer, and Joseph F Coughlin. 2012. Sensitivity of physiological measures for detecting systematic variations in cognitive demand from a working memory task: an on-road study across three age groups. Human factors 54, 3 (2012), 396--412.",
      "doi": ""
    },
    {
      "text": "Bruce Mehler, Bryan Reimer, and JA Dusek. 2011. MIT AgeLab delayed digit recall task (n-back). Cambridge, MA: Massachusetts Institute of Technology (2011).",
      "doi": ""
    },
    {
      "text": "Fred Paas, Juhani E Tuovinen, Huib Tabbers, and Pascal WM Van Gerven. 2003. Cognitive load measurement as a means to advance cognitive load theory. Educational psychologist 38, 1 (2003), 63--71.",
      "doi": ""
    },
    {
      "text": "Bastian Pfleging, Drea K Fekety, Albrecht Schmidt, and Andrew L Kun. 2016. A Model Relating Pupil Diameter to Mental Workload and Lighting Conditions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5776--5788.  ",
      "doi": "10.1145/2858036.2858117"
    },
    {
      "text": "Thomas A Ranney, GH Baldwin, Larry A Smith, Elizabeth N Mazzae, and Russell S Pierce. 2014. Detection Response Task (DRT) Evaluation for Driver Distraction Measurement Application. Technical Report.",
      "doi": ""
    },
    {
      "text": "Miguel A Recarte and Luis M Nunes. 2003. Mental workload while driving: effects on visual search, discrimination, and decision making. Journal of experimental psychology: Applied 9, 2 (2003), 119.",
      "doi": ""
    },
    {
      "text": "Bryan Reimer, Bruce Mehler, J Dobres, and JF Coughlin. 2013. The effects of a production level \"voice-command\" interface on driver behavior: summary findings on reported workload, physiology, visual attention, and driving performance. (2013).",
      "doi": ""
    },
    {
      "text": "Bryan Reimer, Bruce Mehler, Jonathan Dobres, Hale McAnulty, Alea Mehler, Daniel Munger, and Adrian Rumpold. 2014. Effects of an'Expert Mode'Voice Command System on Task Performance, Glance Behavior & Driver Physiology. In Proceedings of the 6th international conference on automotive user interfaces and interactive vehicular applications. ACM, 1--9.  ",
      "doi": "10.1145/2667317.2667320"
    },
    {
      "text": "Bryan Reimer, Bruce Mehler, Ying Wang, and Joseph F Coughlin. 2012. A field study on the impact of variations in short-term memory demands on drivers' visual attention and driving performance across three age groups. Human Factors: The Journal of the Human Factors and Ergonomics Society 54, 3 (2012), 454--468.",
      "doi": ""
    },
    {
      "text": "Alexander Schliep, Benjamin Georgi, Wasinee Rungsarityotin, I Costa, and A Schonhuth. 2004. The general hidden markov model library: Analyzing systems with unobservable states. Proceedings of the Heinz-Billing-Price 2004 (2004), 121--135.",
      "doi": ""
    },
    {
      "text": "Gerald Schweighofer and Axel Pinz. 2008. Globally Optimal O (n) Solution to the PnP Problem for General Camera Models.. In BMVC. 1--10.",
      "doi": ""
    },
    {
      "text": "Karen Simonyan and Andrew Zisserman. 2014. Very deep convolutional networks for large-scale image recognition. arXiv preprint arXiv:1409.1556 (2014).",
      "doi": ""
    },
    {
      "text": "John Sweller, Paul Ayres, and Slava Kalyuga. 2011. Measuring cognitive load. In Cognitive load theory. Springer, 71--85.",
      "doi": ""
    },
    {
      "text": "Du Tran, Lubomir Bourdev, Rob Fergus, Lorenzo Torresani, and Manohar Paluri. 2015. Learning spatiotemporal features with 3d convolutional networks. In 2015 IEEE International Conference on Computer Vision (ICCV). IEEE, 4489--4497.  ",
      "doi": "10.1109/ICCV.2015.510"
    },
    {
      "text": "Ying Wang, Bryan Reimer, Jonathan Dobres, and Bruce Mehler. 2014. The sensitivity of different methodologies for characterizing drivers' gaze concentration under increased cognitive demand. Transportation research part F: traffic psychology and behaviour 26 (2014), 227--237.",
      "doi": ""
    },
    {
      "text": "Joe Yue-Hei Ng, Matthew Hausknecht, Sudheendra Vijayanarasimhan, Oriol Vinyals, Rajat Monga, and George Toderici. 2015. Beyond short snippets: Deep networks for video classification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 4694--4702.",
      "doi": ""
    },
    {
      "text": "Matthew D Zeiler and Rob Fergus. 2014. Visualizing and understanding convolutional networks. In European Conference on Computer Vision. Springer, 818--833.",
      "doi": ""
    },
    {
      "text": "Matthew D Zeiler, Graham W Taylor, and Rob Fergus. 2011. Adaptive deconvolutional networks for mid and high level feature learning. In 2011 International Conference on Computer Vision. IEEE, 2018--2025.  ",
      "doi": "10.1109/ICCV.2011.6126474"
    },
    {
      "text": "Yilu Zhang, Yuri Owechko, and Jing Zhang. 2004. Driver cognitive workload estimation: A data-driven perspective. In Intelligent Transportation Systems, 2004. Proceedings. The 7th International IEEE Conference on. IEEE, 642--647.",
      "doi": ""
    }
  ]
}