{
  "doi": "10.1145/3173574.3174130",
  "title": "Measuring, Understanding, and Classifying News Media Sympathy on Twitter after Crisis Events",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "This paper investigates bias in coverage between Western and Arab media on Twitter after the November 2015 Beirut and Paris terror attacks. Using two Twitter datasets covering each attack, we investigate how Western and Arab media differed in coverage bias, sympathy bias, and resulting information propagation. We crowdsourced sympathy and sentiment labels for 2,390 tweets across four languages (English, Arabic, French, German), built a regression model to characterize sympathy, and thereafter trained a deep convolutional neural network to predict sympathy. Key findings show: (a) both events were disproportionately covered (b) Western media exhibited less sympathy, where each media coverage was more sympathetic towards the country affected in their respective region (c) Sympathy predictions supported ground truth analysis that Western media was less sympathetic than Arab media (d) Sympathetic tweets do not spread any further. We discuss our results in light of global news flow, Twitter affordances, and public perception impact.",
  "tags": [
    "news media bias",
    "twitter",
    "nlp",
    "cross-cultural",
    "crisis informatics",
    "crowdsourcing",
    "sympathy",
    "sentiment analysis"
  ],
  "authors": [
    {
      "name": "Abdallah El Ali",
      "institution": "CWI (Centrum Wiskunde&Informatica)&University of Oldenburg, Amsterdam, Netherlands",
      "img": "/do/10.1145/contrib-81474700470/rel-imgonly/offis_photo_el_ali.jpg",
      "acmid": "81474700470",
      "orcid": "missing"
    },
    {
      "name": "Tim C. Stratmann",
      "institution": "University of Oldenburg, Oldenburg, Germany",
      "img": "/do/10.1145/contrib-83058698457/rel-imgonly/dsc_1492.jpg",
      "acmid": "83058698457",
      "orcid": "missing"
    },
    {
      "name": "Souneil Park",
      "institution": "Telefonica Research, Barcelona, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659536514",
      "orcid": "missing"
    },
    {
      "name": "Johannes Schöning",
      "institution": "University of Bremen, Bremen, Germany",
      "img": "/do/10.1145/contrib-81508685058/rel-imgonly/20160404_5404_dsc_6947_small.jpg",
      "acmid": "81508685058",
      "orcid": "0000-0002-8823-4607"
    },
    {
      "name": "Wilko Heuten",
      "institution": "OFFIS - Institute for Information Technology, Oldenburg, Germany",
      "img": "/do/10.1145/contrib-81320490169/rel-imgonly/csm_offis_gesundheit_heuten_wilko_dsc05737__1__web_4024cc8173.jpg",
      "acmid": "81320490169",
      "orcid": "0000-0003-2085-193X"
    },
    {
      "name": "Susanne C.J. Boll",
      "institution": "University of Oldenburg, Oldenburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398416",
      "orcid": "0000-0003-4293-1623"
    }
  ],
  "references": [
    {
      "text": "Sofiane Abbar, Jisun An, Haewoon Kwak, Yacine Messaoui, and Javier Borge-Holthoefer. 2015. Consumers and Suppliers: Attention asymmetries. A Case Study of Aljazeera's News Coverage and Comments. In Computation+Journalism Symposium 2015. http://cj2015.brown.columbia.edu/papers/ consumers-and-suppliers.pdf",
      "doi": ""
    },
    {
      "text": "Jisun An, Haewoon Kwak, Yelena Mejova, Sonia Alonso Saenz De Oger, and Braulio Gomez Fortes. 2016. Are You Charlie or Ahmed? Cultural Pluralism in Charlie Hebdo Response on Twitter. In Proc. ICWSM '16. 2--11. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM16/paper/ view/12997",
      "doi": ""
    },
    {
      "text": "David P. Baron. 2006. Persistent media bias. Journal of Public Economics 90, 1--2 (January 2006), 1--36. https: //ideas.repec.org/a/eee/pubec/v90y2006i1--2p1--36.html",
      "doi": ""
    },
    {
      "text": "Jonah Berger and Katherine L. Milkman. 2012. What Makes Online Content Viral? Journal of Marketing Research 49, 2 (2012), 192--205.",
      "doi": ""
    },
    {
      "text": "Shane Bergsma, Paul McNamee, Mossaab Bagdouri, Clayton Fink, and Theresa Wilson. 2012. Language identification for creating language-specific twitter collections. In Proc. LSM '12. ACL, 65--74. ",
      "doi": "10.5555/2390374.2390382"
    },
    {
      "text": "Javier Borge-Holthoefer, Walid Magdy, Kareem Darwish, and Ingmar Weber. 2015. Content and Network Dynamics Behind Egyptian Political Polarization on Twitter. In Proc. CSCW '15. ACM Press, 700--711.  ",
      "doi": "10.1145/2675133.2675163"
    },
    {
      "text": "D. Britz. 2015. Implementing a CNN for Text Classification in Tensorflow. (2015). https://github.com/dennybritz/cnn-text-classification-tf",
      "doi": ""
    },
    {
      "text": "Meeyoung Cha, Hamed Haddadi, Fabrício Benevenuto, and Krishna P. Gummadi. 2010. Measuring user influence in Twitter: The million follower fallacy. In Proc. ICWSM '10. http://twitter.mpi-sws.org/icwsm2010_fallacy.pdf",
      "doi": ""
    },
    {
      "text": "D D'Alessio and M Allen. 2000. Media bias in presidential elections: a meta-analysis. Journal of Comm. 50, 4 (2000), 133--156.",
      "doi": ""
    },
    {
      "text": "Alexander Dallmann, Florian Lemmerich, Daniel Zoller, and Andreas Hotho. 2015. Media Bias in German Online Newspapers. In Proc. HT '15. ACM, New York, NY, USA, 133--137.  ",
      "doi": "10.1145/2700171.2791057"
    },
    {
      "text": "Jean Decety and Thierry Chaminade. 2003. Neural correlates of feeling sympathy. Neuropsychologia 41, 2 (2003), 127--138. The cognitive neuroscience of social behavior.",
      "doi": ""
    },
    {
      "text": "Mark Deuze. 2002. National news cultures: A comparison of Dutch, German, British, Australian, and US journalists. Journalism&Mass Communication Quarterly 79, 1 (2002), 134--149.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos, Munmun De Choudhury, and Mor Naaman. 2012. Finding and Assessing Social Media Information Sources in the Context of Journalism. In Proc. CHI '12. ACM, 2451--2460.  ",
      "doi": "10.1145/2207676.2208409"
    },
    {
      "text": "Nicholas Diakopoulos and Arkaitz Zubiaga. 2014. Newsworthiness and Network Gatekeeping on Twitter: The Role of Social Deviance.. In ICWSM '14. AAAI. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM14/paper/view/8065",
      "doi": ""
    },
    {
      "text": "Nicholas A. Diakopoulos and David A. Shamma. 2010. Characterizing Debate Performance via Aggregated Twitter Sentiment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1195--1198.  ",
      "doi": "10.1145/1753326.1753504"
    },
    {
      "text": "Júlio Cesar dos Reis, Fabrício Benevenuto, Pedro Olmo S. Vaz de Melo, Raquel O. Prates, Haewoon Kwak, and Jisun An. 2015. Breaking the News: First Impressions Matter on Online News., In Proc. ICWSM '15. CoRR (2015). http://arxiv.org/abs/1503.07921",
      "doi": ""
    },
    {
      "text": "R.A. Fisher. 1925. Statistical methods for research workers. Edinburgh Oliver&Boyd.",
      "doi": ""
    },
    {
      "text": "Johan Galtung and Mari Holmboe Ruge. 1965. The Structure of Foreign News: The Presentation of the Congo, Cuba and Cyprus Crises in Four Norwegian Newspapers. Journal of Peace Research 2, 1 (1965), 64--90.",
      "doi": ""
    },
    {
      "text": "C.J. Glynn, S. Herbst, G.J. O'Keefe, and R.Y. Shapiro. 2004. Public Opinion. Westview Press. https://books.google.de/books?id=b3OqBAAAQBAJ",
      "doi": ""
    },
    {
      "text": "Jennifer Golbeck and Derek Hansen. 2011. Computing Political Preference Among Twitter Followers. In Proc. CHI '11. ACM, 1105--1108.  ",
      "doi": "10.1145/1978942.1979106"
    },
    {
      "text": "Yoav Goldberg. 2015. A Primer on Neural Network Models for Natural Language Processing. CoRR abs/1510.00726 (2015). http://arxiv.org/abs/1510.00726",
      "doi": ""
    },
    {
      "text": "Sandra González-Bailón, Ning Wang, Alejandro Rivero, Javier Borge-Holthoefer, and Yamir Moreno. 2014. Assessing the bias in samples of large online networks. Soc. Net. 38 (2014), 16--27.",
      "doi": ""
    },
    {
      "text": "Thomas Hanitzsch, Folker Hanusch, Claudia Mellado, Maria Anikina, Rosa Berganza, Incilay Cangoz, Mihai Coman, Basyouni Hamada, María Elena Hernández, Christopher D Karadjov, and others. 2011. Mapping journalism cultures across nations: A comparative study of 18 countries. Journalism Studies 12, 3 (2011), 273--293.",
      "doi": ""
    },
    {
      "text": "Lars Kai Hansen, Adam Arvidsson, Finn Aarup Nielsen, Elanor Colleoni, and Michael Etter. 2011. Good Friends, Bad News - Affect and Virality in Twitter. Springer Berlin Heidelberg, 34--43.",
      "doi": ""
    },
    {
      "text": "E.S. Herman and N. Chomsky. 1988. Manufacturing consent: the political economy of the mass media. Pantheon Books. https://books.google.de/books?id=Up5sAAAAIAAJ",
      "doi": ""
    },
    {
      "text": "Isaac Johnson, Connor McMahon, Johannes Schöning, and Brent Hecht. 2017. The Effect of Population and \"Structural\" Biases on Social Media-based Algorithms: A Case Study in Geolocation Inference Across the Urban-Rural Spectrum. In Proc. CHI '17. ACM, 1167--1178.  ",
      "doi": "10.1145/3025453.3026015"
    },
    {
      "text": "Isaac L. Johnson, Subhasree Sengupta, Johannes Schöning, and Brent Hecht. 2016. The Geography and Importance of Localness in Geotagged Social Media. In Proc. CHI '16. ACM, 515--526.  ",
      "doi": "10.1145/2858036.2858122"
    },
    {
      "text": "Ankit Kariryaa, Isaac Johnson, Brent Hecht, and Johannes Schöning. 2018. Defining and Predicting the Localness of Volunteered Geographic Information using Ground Truth Data. In Proc. CHI '18. ACM.  ",
      "doi": "10.1145/3173574.3173839"
    },
    {
      "text": "Yoon Kim. 2014. Convolutional Neural Networks for Sentence Classification. In Proc. EMNLP '14, Alessandro Moschitti, Bo Pang, and Walter Daelemans (Eds.). ACL, 1746--1751. http://aclweb.org/anthology/D/D14/D14--1181.pdf",
      "doi": ""
    },
    {
      "text": "Yonghwan Kim, Youngju Kim, Joong Suk Lee, Jeyoung Oh, and Na Yeon Lee. 2015. Tweeting the public: journalists' Twitter use, attitudes toward the public's tweets, and the relationship with the public. Information, Communication&Society 18, 4 (2015), 443--458.",
      "doi": ""
    },
    {
      "text": "James T Kost and Michael P McDermott. 2002. Combining dependent P-values. Statistics&Probability Letters 60, 2 (2002), 183--190.",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak and Jisun An. 2014a. SocInfo. Springer, Chapter A First Look at Global News Coverage of Disasters by Using the GDELT Dataset, 300--308.",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak and Jisun An. 2014b. Understanding News Geography and Major Determinants of Global News Coverage of Disasters. CoRR abs/1410.3710 (2014). http://arxiv.org/abs/1410.3710",
      "doi": ""
    },
    {
      "text": "V. I. Levenshtein. 1966. Binary codes capable of correcting deletions, insertions and reversals. Soviet Phys. Doklady. 10, 8 (Feb. 1966), 707--710.",
      "doi": ""
    },
    {
      "text": "Lin, Yu-Ru and Margolin, Drew. 2014. The ripple of fear, sympathy and solidarity during the Boston bombings. EPJ Data Sci. 3, 1 (2014), 31.",
      "doi": ""
    },
    {
      "text": "Gilad Lotan, Erhardt Graeff, Mike Ananny, Devin Gaffney, Ian Pearce, and danah boyd. 2011. The Arab Spring| The Revolutions Were Tweeted: Information Flows during the 2011 Tunisian and Egyptian Revolutions. International Journal of Communication 5, 0 (2011). http://ijoc.org/index.php/ijoc/article/view/1246",
      "doi": ""
    },
    {
      "text": "Marco Lui and Timothy Baldwin. 2012. Langid.Py: An Off-the-shelf Language Identification Tool. In Proc. ACL '12 System Demonstrations. ACL, Stroudsburg, PA, USA, 25--30. http://dl.acm.org/citation.cfm?id=2390470.2390475 ",
      "doi": "10.5555/2390470.2390475"
    },
    {
      "text": "Walid Magdy, Kareem Darwish, Norah Abokhodair, Afshin Rahimi, and Timothy Baldwin. 2016. #ISISisNotIslam or #DeportAllMuslims?: Predicting Unspoken Views. In Proc. WebSci '16. ACM, New York, NY, USA, 95--106.  ",
      "doi": "10.1145/2908131.2908150"
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods 44, 1 (2012), 1--23.",
      "doi": ""
    },
    {
      "text": "Yelena Mejova, Amy X. Zhang, Nicholas Diakopoulos, and Carlos Castillo. 2014. Controversy and sentiment in online news. Symposium on Computation and Journalism (2014). https://arxiv.org/abs/1409.8152",
      "doi": ""
    },
    {
      "text": "Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient Estimation of Word Representations in Vector Space. ICLR (2013). https://arxiv.org/abs/1301.3781",
      "doi": ""
    },
    {
      "text": "Soo Jung Moon and Patrick Hadley. 2014. Routinizing a New Technology in the Newsroom: Twitter as a News Source in Mainstream Media. Journal of Broadcasting&Electronic Media 58, 2 (2014), 289--305.",
      "doi": ""
    },
    {
      "text": "Jonathan Scott Morgan, Cliff Lampe, and Muhammad Zubair Shafiq. 2013. Is News Sharing on Twitter Ideologically Biased?. In Proc. CSCW '13. ACM, New York, NY, USA, 887--896.  ",
      "doi": "10.1145/2441776.2441877"
    },
    {
      "text": "Alexandra Olteanu, Sarah Vieweg, and Carlos Castillo. 2015. What to Expect When the Unexpected Happens: Social Media Communications Across Crises. In Proc. CSCW '15. ACM, New York, NY, USA, 994--1009.  ",
      "doi": "10.1145/2675133.2675242"
    },
    {
      "text": "Bo Pang and Lillian Lee. 2008. Opinion Mining and Sentiment Analysis. Found. Trends Inf. Retr. 2, 1--2 (Jan. 2008), 1--135.  ",
      "doi": "10.1561/1500000011"
    },
    {
      "text": "Souneil Park, Seungwoo Kang, Sangyoung Chung, and Junehwa Song. 2009. NewsCube: Delivering Multiple Aspects of News to Mitigate Media Bias. In Proc. CHI '09. ACM, New York, NY, USA, 443--452.  ",
      "doi": "10.1145/1518701.1518772"
    },
    {
      "text": "Richard M. Perloff. 2015. A Three-Decade Retrospective on the Hostile Media Effect. Mass Communication and Society 18, 6 (2015), 701--729.",
      "doi": ""
    },
    {
      "text": "Vincent Price and David Tewksbury. 1997. News values and public opinion: A theoretical account of media priming and framing. Progress in communication sciences (1997), 173--212.",
      "doi": ""
    },
    {
      "text": "Diego Saez-Trumper, Carlos Castillo, and Mounia Lalmas. 2013. Social media news communities: gatekeeping, coverage, and statement bias. In Proc. CIKM '13. ACM, 1679--1684.  ",
      "doi": "10.1145/2505515.2505623"
    },
    {
      "text": "Axel Schulz, T Thanh, H Paulheim, and Immanuel Schweizer. 2013. A fine-grained sentiment analysis approach for detecting crisis related microposts. ISCRAM 2013 (2013). http://idl.iscram.org/files/schulz/2013/ 927_Schulz_etal2013.pdf",
      "doi": ""
    },
    {
      "text": "Elad Segev. 2015. Visible and invisible countries: News flow theory revised. Journalism 16, 3 (2015), 412--428.",
      "doi": ""
    },
    {
      "text": "David A. Shamma, Lyndon Kennedy, and Elizabeth F. Churchill. 2009. Tweet the Debates: Understanding Community Annotation of Uncollected Sources. In Proc. WSM '09. ACM, New York, NY, USA, 3--10.  ",
      "doi": "10.1145/1631144.1631148"
    },
    {
      "text": "P.J. Shoemaker and S.D. Reese. 1996. Mediating the Message: Theories of Influences on Mass Media Content. Longman. https://books.google.de/books?id=E_HtAAAAMAAJ",
      "doi": ""
    },
    {
      "text": "J. Singer. 2006. Journalists and News Bloggers: Complements, Contradictions and Challenges. In Uses of Blogs, A. Bruns and J. Jacobs (Eds.). Peter Lang, New York, 23--32. http://openaccess.city.ac.uk/4024/",
      "doi": ""
    },
    {
      "text": "Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. 2014. Dropout: A Simple Way to Prevent Neural Networks from Overfitting. Journal of Machine Learning Research 15 (2014), 1929--1958. http://jmlr.org/papers/v15/srivastava14a.html ",
      "doi": "10.5555/2627435.2670313"
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2012. (How) will the revolution be retweeted?: information diffusion and the 2011 Egyptian uprising. In Proc. CSCW '12. ACM, 7--16. http://dl.acm.org/citation.cfm?id=2145212  ",
      "doi": "10.1145/2145204.2145212"
    },
    {
      "text": "Saúl Vargas, Richard Mccreadie, Craig Macdonald, and Iadh Ounis. 2016. Comparing Overall and Targeted Sentiments in Social Media during Crises. In Proc. ICWSM '16. https://www.aaai.org/ocs/index.php/ICWSM/ ICWSM16/paper/view/13066",
      "doi": ""
    },
    {
      "text": "Wayne Wanta, Guy Golan, and Cheolhan Lee. 2004. Agenda Setting and International News: Media Influence on Public Perceptions of Foreign Nations. Journalism&Mass Communication Quarterly 81, 2 (2004), 364--377.",
      "doi": ""
    },
    {
      "text": "Zhongyu Wei, Yulan He, Wei Gao, Binyang Li, Lanjun Zhou, and Kam-fai Wong. 2013. Mainstream Media Behavior Analysis on Twitter: A Case Study on UK General Election. In Proc. HT '13. ACM, 174--178.  ",
      "doi": "10.1145/2481492.2481512"
    },
    {
      "text": "HD Wu. 2000. Systemic determinants of international news coverage: a comparison of 38 countries. Journal of Comm. 50, 2 (2000), 110--130.",
      "doi": ""
    },
    {
      "text": "Sevgi Yigit-Sert, Ismail Sengor Altingovde, and Özgür Ulusoy. 2016. Towards Detecting Media Bias by Utilizing User Comments. In Proc. WebSci '16. ACM, New York, NY, USA, 374--375.  ",
      "doi": "10.1145/2908131.2908186"
    },
    {
      "text": "Arjumand Younus, Muhammad Atif Qureshi, Suneel Kumar Kingrani, Muhammad Saeed, Nasir Touheed, Colm O'Riordan, and Pasi Gabriella. 2012. Investigating Bias in Traditional Media Through Social Media. In Proc. WWW '12 Companion. ACM, New York, NY, USA, 643--644.  ",
      "doi": "10.1145/2187980.2188168"
    },
    {
      "text": "Matthew D. Zeiler. 2012. ADADELTA: An Adaptive Learning Rate Method. CoRR abs/1212.5701 (2012). http://arxiv.org/abs/1212.5701",
      "doi": ""
    }
  ]
}