{
  "doi": "10.1145/3173574.3173630",
  "title": "Environmental Factors in Indoor Navigation Based on Real-World Trajectories of Blind Users",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Indoor localization technologies can enhance quality of life for blind people by enabling them to independently explore and navigate indoor environments. Researchers typically evaluate their systems in terms of localization accuracy and user behavior along planned routes. We propose two measures of path-following behavior: deviation from optimal route and trajectory variability. Through regression analysis of real-world trajectories from blind users, we identify relationships between a) these measures and b) elements of the environment, route characteristics, localization error, and instructional cues that users receive. Our results provide insights into path-following behavior for turn-by-turn indoor navigation and have implications for the design of future interactions. Moreover, our findings highlight the importance of reporting these environmental factors and route properties in similar studies. We present automated and scalable methods for their calculation and to encourage their reporting for better interpretation and comparison of results across future studies.",
  "authors": [
    {
      "name": "Hernisa Kacorri",
      "institution": "University of Maryland, College Park, USA",
      "img": "/do/10.1145/contrib-81474702153/rel-imgonly/81474702153.jpg",
      "acmid": "81474702153",
      "orcid": "0000-0002-7798-308X"
    },
    {
      "name": "Eshed Ohn-Bar",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549452156",
      "orcid": "missing"
    },
    {
      "name": "Kris M. Kitani",
      "institution": "Carnegie Mellon University, Pittsburgh, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331496187",
      "orcid": "missing"
    },
    {
      "name": "Chieko Asakawa",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100044475",
      "orcid": "0000-0002-5447-1305"
    }
  ],
  "references": [
    {
      "text": "Dragan Ahmetovic, Cole Gleason, Chengxiong Ruan, Kris M Kitani, Hironobu Takagi, and Chieko Asakawa. 2016. NavCog: a navigational cognitive assistant for the blind.. In MobileHCI. 90--99.  ",
      "doi": "10.1145/2935334.2935361"
    },
    {
      "text": "Dragan Ahmetovic, Masayuki Murata, Cole Gleason, Erin Brady, Hironobu Takagi, Kris Kitani, and Chieko Asakawa. 2017. Achieving Practical and Accurate Indoor Navigation for People with Visual Impairments. In Web for All Conference. ACM.  ",
      "doi": "10.1145/3058555.3058560"
    },
    {
      "text": "Jo ao Guerreiro, Dragan Ahmetovic, Kris Kitani, and Chieko Asakawa. 2017. Virtual Navigation for Blind People: Building Sequential Representations of the real-world. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM.  ",
      "doi": "10.1145/3132525.3132545"
    },
    {
      "text": "E. Batista, F. Borras, F. Casino, and A. Solanas. 2015. A study on the detection of wandering patterns in human trajectories. In 6th International Conference on Information, Intelligence, Systems and Applications. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Yao-Jen Chang. 2010. Anomaly Detection for Travelling Individuals with Cognitive Impairments. SIGACCESS Access. Comput. 97 (2010), 25--32.  ",
      "doi": "10.1145/1873532.1873535"
    },
    {
      "text": "Trevor A Craney and James G Surles. 2002. Model-dependent variance inflation factor cutoff values. Quality Engineering 14, 3 (2002), 391--403.",
      "doi": ""
    },
    {
      "text": "Dimitrios Dakopoulos, Sanjay K Boddhu, and Nikolaos Bourbakis. 2007. A 2D vibration array as an assistive device for visually impaired. In Bioinformatics and Bioengineering, 2007. BIBE 2007. Proceedings of the 7th IEEE International Conference on. IEEE, 930--937.",
      "doi": ""
    },
    {
      "text": "Trung-Kien Dao, Thanh-Hai Tran, Thi-Lan Le, Hai Vu, Viet-Tung Nguyen, Dang-Khoa Mac, Ngoc-Diep Do, and Thanh-Thuy Pham. 2016. Indoor navigation assistance system for visually impaired people using multimodal technologies. In Control, Automation, Robotics and Vision (ICARCV), 2016 14th International Conference on. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Navid Fallah, Ilias Apostolopoulos, Kostas Bekris, and Eelke Folmer. 2012. The user as a sensor: navigating users with visual impairments in indoor spaces using tactile landmarks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 425--432.  ",
      "doi": "10.1145/2207676.2207735"
    },
    {
      "text": "Navid Fallah, Ilias Apostolopoulos, Kostas Bekris, and Eelke Folmer. 2013. Indoor Human Navigation Systems: A Survey. Interacting with Computers 25, 1 (2013), 21.",
      "doi": ""
    },
    {
      "text": "German H. Flores and R. Manduchi. 2016. WeAllWalk: An Annotated Data Set of Inertial Sensor Time Series from Blind Walkers. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 141--150.  ",
      "doi": "10.1145/2982142.2982179"
    },
    {
      "text": "Thomas Gallagher, Elyse Wise, Binghao Li, Andrew G Dempster, Chris Rizos, and Euan Ramsey-Stewart. 2012. Indoor positioning system based on sensor fusion for the blind and visually impaired. In Indoor Positioning and Indoor Navigation (IPIN), 2012 International Conference on. IEEE, 1--9.",
      "doi": ""
    },
    {
      "text": "Nicholas A Giudice and Gordon E Legge. 2008. Blind navigation and the role of technology. The Engineering Handbook of Smart Technology for Aging, Disability, and Independence (2008), 479--500.",
      "doi": ""
    },
    {
      "text": "Ulrike Grömping and others. 2006. Relative importance for linear regression in R: the package relaimpo. Journal of statistical software 17, 1 (2006), 1--27.",
      "doi": ""
    },
    {
      "text": "Rosen Ivanov. 2010. Indoor navigation system for visually impaired. In Proceedings of the 11th International Conference on Computer Systems and Technologies and Workshop for PhD Students in Computing on International Conference on Computer Systems and Technologies. ACM, 143--149.  ",
      "doi": "10.1145/1839379.1839405"
    },
    {
      "text": "Hernisa Kacorri, Kris M. Kitani, Jeffrey P. Bigham, and Chieko Asakawa. 2017. People with Visual Impairment Training Personal Object Recognizers: Feasibility and Challenges. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM.  ",
      "doi": "10.1145/3025453.3025899"
    },
    {
      "text": "Hernisa Kacorri, Sergio Mascetti, A. Gerino, D. Ahmetovic, H. Takagi, and C. Asakawa. 2016. Supporting Orientation of People with Visual Impairment: Analysis of Large Scale Usage Data. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 151--159.  ",
      "doi": "10.1145/2982142.2982178"
    },
    {
      "text": "K. Kitani, B. Ziebart, J. Bagnell, and M. Hebert. 2012. Activity Forecasting. In European Conference on Computer Vision. 201--214.  ",
      "doi": "10.1007/978-3-642-33765-9_15"
    },
    {
      "text": "Roberta L Klatzky, Jack M Loomis, Reginald G Golledge, Joseph G Cicinelli, Sally Doherty, and James W Pellegrino. 1990. Acquisition of route and survey knowledge in the absence of vision. Journal of motor behavior 22, 1 (1990), 19--43.",
      "doi": ""
    },
    {
      "text": "Qiang Lin, Daqing Zhang, Kay Connelly, Hongbo Ni, Zhiwen Yu, and Xingshe Zhou. 2015. Disorientation detection by mining {GPS} trajectories for cognitively-impaired elders. Pervasive and Mobile Computing 19 (2015), 71--85.  ",
      "doi": "10.1016/j.pmcj.2014.01.003"
    },
    {
      "text": "Fernando Lyardet, Diego Wong Szeto, and Erwin Aitenbichler. 2008. Context-Aware Indoor Navigation. Springer Berlin Heidelberg, Berlin, Heidelberg, 290--307.  ",
      "doi": "10.1007/978-3-540-89617-3_19"
    },
    {
      "text": "James Marston and BillieLouiseBeezy Bentzen. 2012. Evaluating the effectiveness of assistive travel and wayfinding devices for persons who are blind or visually impaired. Assistive Technology for Blindness and Low Vision (2012), 133.",
      "doi": ""
    },
    {
      "text": "Pyry Matikainen, Martial Hebert, and Rahul Sukthankar. 2009. Trajectons: Action recognition through the motion analysis of tracked features. In ICCVW. IEEE.",
      "doi": ""
    },
    {
      "text": "B. T. Morris and M. M. Trivedi. 2011. Trajectory Learning for Activity Understanding: Unsupervised, Multilevel, and Long-Term Adaptive Approach. IEEE Transactions on Pattern Analysis and Machine Intelligence 33, 11 (2011), 2287--2301.  ",
      "doi": "10.1109/TPAMI.2011.64"
    },
    {
      "text": "L. Nack, R. Roor, M. Karg, A. Kirsch, O. Birth, S. Leibe, and M. Strassberger. 2015. Acquisition and Use of Mobility Habits for Personal Assistants. In 2015 IEEE 18th International Conference on Intelligent Transportation Systems. 1500--1505.  ",
      "doi": "10.1109/ITSC.2015.245"
    },
    {
      "text": "Joy Ng and Haixun Kong. 2016. Not All Who Wander Are Lost: Smart Tracker for People with Dementia. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2241--2248.  ",
      "doi": "10.1145/2851581.2892499"
    },
    {
      "text": "Yeonju Oh, Wei-Liang Kao, and Byung-Cheol Min. 2017. Indoor Navigation Aid System Using No Positioning Technique for Visually Impaired People. In International Conference on Human-Computer Interaction. Springer, 390--397.",
      "doi": ""
    },
    {
      "text": "Eshed Ohn-Bar, Joo Guerreiro, Dragan Ahmetovic, Kris Kitani, and Chieko Asakawa. 2018. Assessing and Modeling Expertise in Assistive Navigation Interfaces for Blind People. In International Conference on Intelligent User Interfaces.  ",
      "doi": "10.1145/3172944.3173008"
    },
    {
      "text": "Ofir Pele and Michael Werman. 2010. The quadratic-chi histogram distance family. In European conference on computer vision. ",
      "doi": "10.5555/1888028.1888085"
    },
    {
      "text": "J Eduardo Pérez, Myriam Arrue, Masatomo Kobayashi, Hironobu Takagi, and Chieko Asakawa. 2017. Assessment of Semantic Taxonomies for Blind Indoor Navigation Based on a Shopping Center Use Case. In Proceedings of the 14th Web for All Conference on The Future of Accessible Work. ACM, 19.  ",
      "doi": "10.1145/3058555.3058575"
    },
    {
      "text": "Timothy H Riehle, Shane M Anderson, Patrick A Lichter, William E Whalen, and Nicholas A Giudice. 2013. Indoor inertial waypoint navigation for the blind. In Engineering in Medicine and Biology Society (EMBC), 2013 35th Annual International Conference of the IEEE. IEEE, 5187--5190.",
      "doi": ""
    },
    {
      "text": "H. Sakoe and S. Chiba. 1978. Dynamic programming algorithm optimization for spoken word recognition. IEEE Transactions on Acoustics, Speech, and Signal Processing 26, 1 (1978), 43--49.",
      "doi": ""
    },
    {
      "text": "Daisuke Sato, Uran Oh, Kakuya Naito, Hironobu Takagi, Kris Kitani, and Chieko Asakawa. 2017. NavCog3: An Evaluation of a Smartphone-Based Blind Indoor Navigation Assistant with Semantic Features in a Large-Scale Environment. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility.  ",
      "doi": "10.1145/3132525.3132535"
    },
    {
      "text": "George W Snedecor and William G Cochran. 1967. Statistical Methods. (1967).",
      "doi": ""
    },
    {
      "text": "Zheng Yang, Chenshu Wu, Zimu Zhou, Xinglin Zhang, Xu Wang, and Yunhao Liu. 2015. Mobility increases localizability: A survey on wireless indoor localization using inertial sensors. ACM Computing Surveys (CSUR) 47, 3 (2015), 54.  ",
      "doi": "10.1145/2676430"
    },
    {
      "text": "Yu Zheng, Quannan Li, Yukun Chen, Xing Xie, and Wei-Ying Ma. 2008. Understanding Mobility Based on GPS Data. In Proceedings of the 10th International Conference on Ubiquitous Computing. ACM, 312--321.  ",
      "doi": "10.1145/1409635.1409677"
    }
  ]
}