{
  "doi": "10.1145/3173574.3173839",
  "title": "Defining and Predicting the Localness of Volunteered Geographic Information using Ground Truth Data",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Many applications of geotagged content are predicated on the concept of localness (e.g., local restaurant recommendation, mining social media for local perspectives on an issue). However, definitions of who is a \"local\" in a given area are typically informal and ad-hoc and, as a result, approaches for localness assessment that have been used in the past have not been formally validated. In this paper, we begin the process of addressing these gaps in the literature. Specifically, we (1) formalize definitions of \"local\" using themes identified in a 30-paper literature review, (2) develop the first ground truth localness dataset consisting of 132 Twitter users and 58,945 place-tagged tweets, and (3) use this dataset to evaluate existing localness assessment approaches. Our results provide important methodological guidance to the large body of research and practice that depends on the concept of localness and suggest means by which localness assessment can be improved.",
  "tags": [
    "localness",
    "twitter",
    "geographic hci",
    "placetag"
  ],
  "authors": [
    {
      "name": "Ankit Kariryaa",
      "institution": "University of Bremen, Bremen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261253",
      "orcid": "missing"
    },
    {
      "name": "Isaac Johnson",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658747560",
      "orcid": "missing"
    },
    {
      "name": "Johannes Schöning",
      "institution": "University of Bremen, Bremen, Germany",
      "img": "/do/10.1145/contrib-81508685058/rel-imgonly/20160404_5404_dsc_6947_small.jpg",
      "acmid": "81508685058",
      "orcid": "0000-0002-8823-4607"
    },
    {
      "name": "Brent Hecht",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577456",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sofiane Abbar, Yelena Mejova, and Ingmar Weber. 2015. You tweet what you eat: Studying food consumption through twitter. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 3197--3206.  ",
      "doi": "10.1145/2702123.2702153"
    },
    {
      "text": "Saeed Abdullah, Elizabeth L. Murnane, Jean MR Costa, and Tanzeem Choudhury. 2015. Collective smile: Measuring societal happiness from geolocated images. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 361--374.  ",
      "doi": "10.1145/2675133.2675186"
    },
    {
      "text": "Mark Bjelland, Daniel Montello, Jerome Fellmann, Arthur Getis, and Judith Getis. 2013. Human Geography: Landscapes of Human Activities. McGrawHill Higher Education.",
      "doi": ""
    },
    {
      "text": "Peter Blickle. 2004. Heimat: A Critical Theory of the German Idea of Homeland. Camden House.",
      "doi": ""
    },
    {
      "text": "Ryan Compton, Craig Lee, Jiejun Xu, Luis ArtiedaMoncada, Tsai-Ching Lu, Lalindra De Silva, and Michael Macy. 2014. Using publicly visible social media to build detailed forecasts of civil unrest. Security informatics 3, 1: 4.",
      "doi": ""
    },
    {
      "text": "Lee Cuba and David M. Hummon. 1993. A place to call home: Identification with dwelling, community, and region. The sociological quarterly 34, 1: 111--131.",
      "doi": ""
    },
    {
      "text": "Aron Culotta. 2014. Estimating county health statistics with twitter. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 1335--1344.  ",
      "doi": "10.1145/2556288.2557139"
    },
    {
      "text": "Tawanna R. Dillahunt, Xinyi Wang, Earnest Wheeler, Hao Fei Cheng, Brent Hecht, and Haiyi Zhu. 2017. The Sharing Economy in Computing: A Systematic Literature Review. Proc. ACM Hum.-Comput. Interact. 1, CSCW: 38:1--38:26.  ",
      "doi": "10.1145/3134673"
    },
    {
      "text": "Melanie Eckle and João Porto de Albuquerque. 2015. Quality Assessment of Remote Mapping in OpenStreetMap for Disaster Management Purposes. In ISCRAM.",
      "doi": ""
    },
    {
      "text": "Friederike Eigler and Jens Kugele. 2012. \"Heimat\": At the Intersection of Memory and Space. Walter de Gruyter.",
      "doi": ""
    },
    {
      "text": "Lee Fiorio, Guy Abel, Jixuan Cai, Emilio Zagheni, Ingmar Weber, and Guillermo Vinué. 2017. Using Twitter Data to Estimate the Relationship between Short-term Mobility and Long-term Migration. In Proceedings of the 2017 ACM on Web Science Conference, 103--110.  ",
      "doi": "10.1145/3091478.3091496"
    },
    {
      "text": "Fabien Girardin, Francesco Calabrese, Filippo Dal Fiore, Carlo Ratti, and Josep Blat. 2008. Digital footprinting: Uncovering tourists with user-generated content. IEEE Pervasive computing 7, 4.  ",
      "doi": "10.1109/MPRV.2008.71"
    },
    {
      "text": "Michael F. Goodchild. 2007. Citizens as sensors: the world of volunteered geography. GeoJournal 69, 4: 211--221.",
      "doi": ""
    },
    {
      "text": "Jungkyu Han and Hayato Yamana. 2015. Why People Go to Unfamiliar Areas?: Analysis of Mobility Pattern Based on Users' Familiarity. In Proceedings of the 17th International Conference on Information Integration and Web-based Applications & Services (iiWAS '15), 28:1--28:10.  ",
      "doi": "10.1145/2837185.2837190"
    },
    {
      "text": "Jungkyu Han and Hayato Yamana. 2017. Familiarityaware POI Recommendation in Urban Neighborhoods. Journal of Information Processing 25: 386--396.",
      "doi": ""
    },
    {
      "text": "Brent Hecht, Lichan Hong, Bongwon Suh, and Ed H. Chi. 2011. Tweets from Justin Bieber's heart: the dynamics of the location field in user profiles. In Proceedings of the SIGCHI conference on human factors in computing systems (CHI '11), 237--246.  ",
      "doi": "10.1145/1978942.1978976"
    },
    {
      "text": "Brent J. Hecht and Darren Gergle. 2010. On the localness of user-generated content. In Proceedings of the 2010 ACM conference on Computer supported cooperative work, 229--232.  ",
      "doi": "10.1145/1718918.1718962"
    },
    {
      "text": "Brent J. Hecht and Monica Stephens. 2014. A Tale of Cities: Urban Biases in Volunteered Geographic Information. ICWSM 14: 197--205.",
      "doi": ""
    },
    {
      "text": "Brent Hecht, Johannes Schöning, Thomas Erickson, and Reid Priedhorsky. 2011. Geographic Human-computer Interaction. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11), 447--450.  ",
      "doi": "10.1145/1979742.1979532"
    },
    {
      "text": "Christopher Ingraham. How Trump's nationwide voter data request could lead to voter suppression. The Washington Post. Retrieved September 16, 2017 from https://www.washingtonpost.com/news/wonk/wp/2017 /06/30/how-trumps-nationwide-voter-data-requestcould-lead-to-voter-suppression",
      "doi": ""
    },
    {
      "text": "Isaac Johnson, Jessica Henderson, Caitlin Perry, Johannes Schöning, and Brent Hecht. 2017. Beautiful... but at What Cost?: An Examination of Externalities in Geographic Vehicle Routing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 2: 15.  ",
      "doi": "10.1145/3090080"
    },
    {
      "text": "Isaac L. Johnson, Subhasree Sengupta, Johannes Schöning, and Brent Hecht. 2016. The geography and importance of localness in geotagged social media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 515--526.  ",
      "doi": "10.1145/2858036.2858122"
    },
    {
      "text": "Christopher B. Jones and Ross S. Purves. 2008. Geographical information retrieval. International Journal of Geographical Information Science 22, 3: 219--228.  ",
      "doi": "10.1080/13658810701626343"
    },
    {
      "text": "David Jurgens, Tyler Finethy, James McCorriston, Yi Tian Xu, and Derek Ruths. 2015. Geolocation Prediction in Twitter Using Social Networks: A Critical Analysis and Review of Current Practice. ICWSM 15: 188--197.",
      "doi": ""
    },
    {
      "text": "Marina Kogan, Leysia Palen, and Kenneth M. Anderson. 2015. Think local, retweet global: Retweeting by the geographically-vulnerable during Hurricane Sandy. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing, 981--993.  ",
      "doi": "10.1145/2675133.2675218"
    },
    {
      "text": "Vikas Kumar, Saeideh Bakhshi, Lyndon Kennedy, and David A. Shamma. 2017. Modeling Characteristics of Location from User Photos. In Proceedings of the 2017 ACM Workshop on Theory-Informed User Modeling for Tailoring and Personalizing Interfaces, 1--6.  ",
      "doi": "10.1145/3039677.3039683"
    },
    {
      "text": "Vikas Kumar, Saeideh Bakhshi, Lyndon Kennedy, and David A. Shamma. 2017. Adaptive City Characteristics: How Location Familiarity Changes What Is Regionally Descriptive. In Proceedings of the 25th Conference on User Modeling, Adaptation and Personalization, 131-- 139.  ",
      "doi": "10.1145/3079628.3079665"
    },
    {
      "text": "Linna Li, Michael F. Goodchild, and Bo Xu. 2013. Spatial, temporal, and socioeconomic patterns in the use of Twitter and Flickr. cartography and geographic information science 40, 2: 61--77.",
      "doi": ""
    },
    {
      "text": "Setha M. Low and Irwin Altman. 1992. Place Attachment. In Place Attachment. Springer, Boston, MA, 1--12.",
      "doi": ""
    },
    {
      "text": "Pamela J. Ludford, Reid Priedhorsky, Ken Reily, and Loren Terveen. 2007. Capturing, sharing, and using local place information. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '07), 1235--1244.  ",
      "doi": "10.1145/1240624.1240811"
    },
    {
      "text": "Momin M. Malik, Hemank Lamba, Constantine Nakos, and Jurgen Pfeffer. 2015. Population bias in geotagged tweets. People 1, 3,759.710: 3--759.",
      "doi": ""
    },
    {
      "text": "Alan Mislove, Sune Lehmann, Yong-Yeol Ahn, JukkaPekka Onnela, and J. Niels Rosenquist. 2011. Understanding the Demographics of Twitter Users. ICWSM 11: 5th.",
      "doi": ""
    },
    {
      "text": "Aline Morais and Nazareno Andrade. 2014. The Relevance of Annotations Shared by Tourists and Residents on a Geo-Social Network During a LargeScale Touristic Event: The Case of São João. In COOP 2014-Proceedings of the 11th International Conference on the Design of Cooperative Systems, 27--30 May 2014, Nice (France), 393--408.",
      "doi": ""
    },
    {
      "text": "Fred Morstatter, Jürgen Pfeffer, Huan Liu, and Kathleen M. Carley. 2013. Is the Sample Good Enough? Comparing Data from Twitter's Streaming API with Twitter's Firehose. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Mohamed Musthag and Deepak Ganesan. 2013. Labor dynamics in a mobile micro-task market. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 641--650.  ",
      "doi": "10.1145/2470654.2470745"
    },
    {
      "text": "Mor Naaman, Amy Xian Zhang, Samuel Brody, and Gilad Lotan. 2012. On the Study of Diurnal Urban Routines on Twitter. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Jeffrey Nichols and Jeon-Hyung Kang. 2012. Asking Questions of Targeted Strangers on Social Networks. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 999--1002.  ",
      "doi": "10.1145/2145204.2145352"
    },
    {
      "text": "Luke Pittaway. 2011. Systematic Literature Reviews. In The SAGE Dictionary of Qualitative Management Research, Richard Thorpe and Robin Holt (Eds.). SAGE Publications Ltd., 217--218.",
      "doi": ""
    },
    {
      "text": "Barbara Poblete, Ruth Garcia, Marcelo Mendoza, and Alejandro Jaimes. 2011. Do all birds tweet the same?: characterizing twitter around the world. In Proceedings of the 20th ACM international conference on Information and knowledge management, 1025--1030.  ",
      "doi": "10.1145/2063576.2063724"
    },
    {
      "text": "Adrian Popescu and Gregory Grefenstette. 2010. Mining User Home Location and Gender from Flickr Tags. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Harold M. Proshansky, Abbe K. Fabian, and Robert Kaminoff. 1983. Place-identity: Physical world socialization of the self. Journal of environmental psychology 3, 1: 57--83.",
      "doi": ""
    },
    {
      "text": "Edward Relph. 1997. Sense of place. Ten geographic ideas that changed the world: 205--226.",
      "doi": ""
    },
    {
      "text": "Christopher J. Riederer, Sebastian Zimmeck, Coralie Phanord, Augustin Chaintreau, and Steven M. Bellovin. 2015. \"I don't have a photograph, but you can have my footprints.\": Revealing the Demographics of Location Data. In Proceedings of the 2015 ACM on Conference on Online Social Networks (COSN '15), 185--195.  ",
      "doi": "10.1145/2817946.2817968"
    },
    {
      "text": "Derek Ruths and Jürgen Pfeffer. 2014. Social media for large studies of behavior. Science 346, 6213: 1063-- 1064.",
      "doi": ""
    },
    {
      "text": "Justin Sablich. How to Explore a City Like a Local Using Your Smartphone. The New York Times. Retrieved September 16, 2017 from https://www.nytimes.com/2017/09/08/travel/localtourist-apps.html",
      "doi": ""
    },
    {
      "text": "David Seamon. 1979. A Geography of the Lifeworld.",
      "doi": ""
    },
    {
      "text": "Shilad W. Sen, Heather Ford, David R. Musicant, Mark Graham, Oliver SB Keyes, and Brent Hecht. 2015. Barriers to the localness of volunteered geographic information. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 197--206.  ",
      "doi": "10.1145/2702123.2702170"
    },
    {
      "text": "Fritz Steele. 1981. The Sense of Place. CBI Pub Co.",
      "doi": ""
    },
    {
      "text": "Dan Tasse, Zichen Liu, Alex Sciuto, and Jason I. Hong. 2017. State of the Geotags: Motivations and Recent Changes. In ICWSM, 250--259.",
      "doi": ""
    },
    {
      "text": "Jacob Thebault-Spieker, Loren G. Terveen, and Brent Hecht. 2015. Avoiding the south side and the suburbs: The geography of mobile crowdsourcing markets. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 265--275.  ",
      "doi": "10.1145/2675133.2675278"
    },
    {
      "text": "Yi-Fu Tuan. 2013. Landscapes of fear. Pantheon.",
      "doi": ""
    },
    {
      "text": "Clare L. Twigger-Ross and David L. Uzzell. 1996. Place and identity processes. Journal of environmental psychology 16, 3: 205--220.",
      "doi": ""
    },
    {
      "text": "Alessandro Venerandi, Giovanni Quattrone, Licia Capra, Daniele Quercia, and Diego Saez-Trumper. 2015. Measuring urban deprivation from user generated content. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 254--264.  ",
      "doi": "10.1145/2675133.2675233"
    },
    {
      "text": "Ryen White and Georg Buscher. 2012. Characterizing local interests and local knowledge. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1607--1610.  ",
      "doi": "10.1145/2207676.2208283"
    },
    {
      "text": "Daniel R. Williams, Michael E. Patterson, Joseph W. Roggenbuck, and Alan E. Watson. 1992. Beyond the commodity metaphor: Examining emotional and symbolic attachment to place. Leisure sciences 14, 1: 29--46.",
      "doi": ""
    },
    {
      "text": "Shaomei Wu, Shenwei Liu, Dan Cosley, and Michael Macy. 2011. Mining collective local knowledge from google mymaps. In Proceedings of the 20th international conference companion on World wide web, 151--152.  ",
      "doi": "10.1145/1963192.1963269"
    },
    {
      "text": "Amy X. Zhang and Scott Counts. 2015. Modeling ideology and predicting policy change with social media: Case of same-sex marriage. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2603--2612.  ",
      "doi": "10.1145/2702123.2702193"
    },
    {
      "text": "Kaiqi Zhao, Gao Cong, and Aixin Sun. 2016. Annotating Points of Interest with Geo-tagged Tweets. In Proceedings of the 25th ACM International on Conference on Information and Knowledge Management, 417--426.  ",
      "doi": "10.1145/2983323.2983850"
    },
    {
      "text": "Dennis Zielstra, Hartwig H. Hochmair, Pascal Neis, and Francesco Tonini. 2014. Areal delineation of home regions from contribution and editing patterns in OpenStreetMap. ISPRS International Journal of GeoInformation 3, 4: 1211--1233.",
      "doi": ""
    },
    {
      "text": "Like a Local. Retrieved September 17, 2017 from https://www.likealocalguide.com/",
      "doi": ""
    },
    {
      "text": "Local Foods. Retrieved September 17, 2017 from https://www.nal.usda.gov/aglaw/local-foods",
      "doi": ""
    },
    {
      "text": "The Twitter Rules. Retrieved September 17, 2017 from https://support.twitter.com/articles/18311",
      "doi": ""
    },
    {
      "text": "Twitter Ads. Retrieved September 17, 2017 from https://dev.twitter.com/ads/campaigns/target-bidding",
      "doi": ""
    }
  ]
}