{
  "doi": "10.1145/3173574.3173631",
  "title": "BSpeak: An Accessible Voice-based Crowdsourcing Marketplace for Low-Income Blind People",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "BSpeak is an accessible crowdsourcing marketplace that enables blind people in developing regions to earn money by transcribing audio files through speech. We examine accessibility and usability barriers that 15 first-time users, who are low-income and blind, experienced while completing transcription tasks on BSpeak and Mechanical Turk (MTurk). Our mixed-methods analysis revealed severe accessibility barriers in MTurk due to the absence of landmarks, unlabeled UI elements, and improper use of HTML headings. Compared to MTurk, participants found BSpeak significantly more accessible and usable, and completed tasks with higher accuracy in lesser time due to its voice-based implementation. In a two-week field deployment of BSpeak in India, 24 low-income blind users earned rupee 7,310 by completing over 16,000 transcription tasks to yield transcriptions with 87% accuracy. Through our analysis of BSpeak's strengths and weaknesses, we provide recommendations for designing crowdsourcing marketplaces for low-income blind people in resource-constrained settings.",
  "tags": [
    "accessibility",
    "crowdsourcing",
    "voice",
    "hci4d",
    "india"
  ],
  "authors": [
    {
      "name": "Aditya Vashistha",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    },
    {
      "name": "Pooja Sethi",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162921",
      "orcid": "missing"
    },
    {
      "name": "Richard Anderson",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371591530",
      "orcid": "0000-0002-7283-7219"
    }
  ],
  "references": [
    {
      "text": "2009. Employment of Disabled People in India. Technical Report. Diversity and Equal Opportunity Centre (DEOC).",
      "doi": ""
    },
    {
      "text": "2014. WHO | Visual impairment and blindness. (2014). http: //www.who.int/mediacentre/factsheets/fs282/en/.",
      "doi": ""
    },
    {
      "text": "2016. Get Paid to Click: 10 Legit Sites That Pay You to Click on Ads | SurveySatrap. (Feb. 2016). http://surveysatrap.com/get-paid-to-click/.",
      "doi": ""
    },
    {
      "text": "2016. National Institute for the Visually Handicapped Annual Report 2015--16. Technical Report. Department OF Empowerment of Persons with Disabilities, Ministry of Social Justic and Empowerment, Government of India. http://nivh.gov.in/index.php/annual-report",
      "doi": ""
    },
    {
      "text": "2016. Quick Transcription Service. (2016). http://www.quicktranscriptionservice.com/ Hindi-Transcription.html.",
      "doi": ""
    },
    {
      "text": "2016. Scripts Complete. (2016). http://scriptscomplete.com/ Hindi-Transcription-Services.php.",
      "doi": ""
    },
    {
      "text": "2016. Transcription Services Us. (2016). http://www.transcription-services-us.com/ Language-Transcription-Rates.php.",
      "doi": ""
    },
    {
      "text": "2017. Accessibility | Android Developers. (2017). https://developer.android.com/guide/topics/ui/ accessibility/index.html.",
      "doi": ""
    },
    {
      "text": "2017. Amazon Mechanical Turk. (2017). https://www.mturk.com/mturk/welcome.",
      "doi": ""
    },
    {
      "text": "2017. AWS Developer Forums: MTurk CENSUS: About how many workers were on Mechanical Turk in 2010? (2017). https://forums.aws.amazon.com/thread. jspa?threadID=58891.",
      "doi": ""
    },
    {
      "text": "2017. Be My Eyes Lend Your Eyes to the Blind. (2017). http://bemyeyes.com.",
      "doi": ""
    },
    {
      "text": "2017. CLOUD SPEECH API: Speech to text conversion powered by machine learning. (2017). https://cloud.google.com/speech/.",
      "doi": ""
    },
    {
      "text": "2017. CrowdFlower: AI for your business. (2017). https://www.crowdflower.com/.",
      "doi": ""
    },
    {
      "text": "2017a. Four Dollar Click | Earn Money by Viewing Ads. (2017). https://fourdollarclick.com/.",
      "doi": ""
    },
    {
      "text": "2017. H59: Using the link element and navigation tools | Techniques for WCAG 2.0. (2017). https://www.w3.org/TR/WCAG20-TECHS/H59.html",
      "doi": ""
    },
    {
      "text": "2017. India Average Daily Wage Rate Forecast 2016--2020. (2017). http://www.tradingeconomics. com/india/wages/forecast.",
      "doi": ""
    },
    {
      "text": "2017. Jana. (2017). https://www.jana.com/.",
      "doi": ""
    },
    {
      "text": "2017. Labeling Regions Page Structure WAI Web Accessibility Tutorials. (2017). https://www.w3.org/ WAI/tutorials/page-structure/labels/.",
      "doi": ""
    },
    {
      "text": "2017. Liv.ai. (2017). https://liv.ai/.",
      "doi": ""
    },
    {
      "text": "2017. mSurvey. (2017). https://www.msurvey.co/.",
      "doi": ""
    },
    {
      "text": "2017. Paytm. (2017). https://paytm.com/.",
      "doi": ""
    },
    {
      "text": "2017b. Poverty & Equity Data | India | The World Bank. (2017). http: //povertydata.worldbank.org/poverty/country/IND, urldate = 2016-09--30.",
      "doi": ""
    },
    {
      "text": "2017. Samasource. (2017). http://www.samasource.org/.",
      "doi": ""
    },
    {
      "text": "2017c. Two Dollar Click : Get Paid To Click. (2017). http: //www.twodollarclick.com/index.php?view=click.",
      "doi": ""
    },
    {
      "text": "2017. Using ARIA landmarks to identify regions of a page - WCAG WG. (2017). https://www.w3.org/WAI/GL/wiki/Using_ARIA_landmarks_to_identify_regions_of_a_page",
      "doi": ""
    },
    {
      "text": "2017. WCAG Overview | Web Accessibility Initiative (WAI) | W3C. (2017). https://www.w3.org/WAI/intro/wcag.",
      "doi": ""
    },
    {
      "text": "2018. Babajob. (2018). http://www.babajob.com/.",
      "doi": ""
    },
    {
      "text": "2018. CGNet Swara. (2018). http://cgnetswara.org/.",
      "doi": ""
    },
    {
      "text": "2018. Gram Vaani. (2018). http://www.gramvaani.org/.",
      "doi": ""
    },
    {
      "text": "2018a. Hotlines & Helplines | National AIDS Control Organization | MoHFW | GoI. (2018). http://naco.gov.in/hotlines-helplines.",
      "doi": ""
    },
    {
      "text": "2018b. Kisan Call center. (2018). http://dackkms.gov.in.",
      "doi": ""
    },
    {
      "text": "2018c. Minimum Wages | Chief Labour Commissioner. (2018). http://clc.gov.in/clc/min-wages.",
      "doi": ""
    },
    {
      "text": "2018d. NCW::Helpline. (2018). http://ncw.nic.in/frmhelpline.aspx.",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: Nearly Real-time Answers to Visual Questions. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, and Jeffrey P. Bigham. 2015. Gauging Receptiveness to Social Microvolunteering. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1055--1064.  ",
      "doi": "10.1145/2702123.2702329"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P. Bigham. 2013a. Visual Challenges in the Everyday Lives of Blind People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2117--2126.  ",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Erin L. Brady, Yu Zhong, Meredith Ringel Morris, and Jeffrey P. Bigham. 2013b. Investigating the Appropriateness of Social Network Question Asking As a Resource for Blind Users. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 1225--1236.  ",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "V. Braun and V. Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Stacy Butler, Adele Crudden, and William Sansing. 2005. Overcoming barriers to employment: Strategies of rehabilitation providers. Journal of Visual Impairment & Blindness (JVIB) 99, 06 (2005).",
      "doi": ""
    },
    {
      "text": "Anthony Candela and Karen Wolffe. 2002. A qualitative analysis of employers' experiences with visually impaired workers. Journal of Visual Impairment & Blindness (JVIB) 96, 09 (2002).",
      "doi": ""
    },
    {
      "text": "Adele Crudden, Lynn W McBroom, Amy L Skinner, and J Elton Moore. 1998. Comprehensive Examination of Barriers to Employment among Persons Who Are Blind or Visually Impaired. (1998).",
      "doi": ""
    },
    {
      "text": "Nathan Eagle. 2009. Txteagle: Mobile Crowdsourcing. In Proceedings of HCI International. Springer-Verlag.  ",
      "doi": "10.1007/978-3-642-02767-3_50"
    },
    {
      "text": "Kristin Skeide Fuglerud, Ingvar Tjøstheim, Birkir Růnar Gunnarsson, and Morten Tollefsen. 2012. Use of Social Media by People with Visual Impairments: Usage Levels, Attitudes and Barriers. In Proceedings of the 13th International Conference on Computers Helping People with Special Needs - Volume Part I (ICCHP'12). Springer-Verlag, Berlin, Heidelberg, 565--572.  ",
      "doi": "10.1007/978-3-642-31522-0_85"
    },
    {
      "text": "Yashesh Gaur, Florian Metze, and Jeffrey P. Bigham. 2016. Manipulating Word Lattices to Incorporate Human Corrections. In INTERSPEECH.",
      "doi": ""
    },
    {
      "text": "Yvonne HH Goertz, Brigitte AG van Lierop, Inge Houkes, and Frans JN Nijhuis. 2010. Factors related to the employment of visually impaired persons: A systematic literature review. Journal of Visual Impairment & Blindness 104, 7 (2010), 404.",
      "doi": ""
    },
    {
      "text": "Aakar Gupta, William Thies, Edward Cutrell, and Ravin Balakrishnan. 2012. mClerk: Enabling Mobile Crowdsourcing in Developing Regions. In Proceedings of CHI.  ",
      "doi": "10.1145/2207676.2208320"
    },
    {
      "text": "Rohit Khanna, Usha Raman, and Gullapalli N. Rao. 2007. Blindness and poverty in India: the way forward. Clinical & Experimental Optometry 90, 6 (Nov. 2007), 406--414.",
      "doi": ""
    },
    {
      "text": "Shashank Khanna, Aishwarya Ratan, James Davis, and William Thies. 2010. Evaluating and Improving the Usability of Mechanical Turk for Low-income Workers in India. In Proceedings of the First ACM Symposium on Computing for Development (ACM DEV '10). ACM, New York, NY, USA, 12:1--12:10.  ",
      "doi": "10.1145/1926180.1926195"
    },
    {
      "text": "Ramya Naraharisetti and Marcia C. Castro. 2016. Factors associated with persons with disability employment in India: a cross-sectional study. BMC Public Health 16 (Oct. 2016), 1063.",
      "doi": ""
    },
    {
      "text": "Prayag Narula, David Rolnitzky, and Bjoern Hartmann. 2011. MobileWorks: A Mobile Crowdsourcing Platform for Workers at the Bottom of the Pyramid. In In Proceedings of HCOMP. ",
      "doi": "10.5555/2908698.2908723"
    },
    {
      "text": "Joyojeet Pal and Meera Lakshmanan. 2012. Assistive Technology and the Employment of People with Vision Impairments in India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development (ICTD '12). ACM, New York, NY, USA, 307--317.  ",
      "doi": "10.1145/2160673.2160711"
    },
    {
      "text": "D. Pascolini and S. P. Mariotti. 2012. Global estimates of visual impairment: 2010. British Journal of Ophthalmology 96, 5 (May 2012), 614--618.",
      "doi": ""
    },
    {
      "text": "PD Rumrill and CM Scheff. 1997. Impact of the ADA on the employment and promotion of persons who are visually impaired. Occupational Health and Industrial Medicine 6, 37 (1997), 311.",
      "doi": ""
    },
    {
      "text": "Alexander Shaw, Deborah Gold, and Karen Wolffe. 2007. Employment-Related Experiences of Youths Who Are Visually Impaired: How Are These Youths Faring? Journal of Visual Impairment & Blindness v101 (Jan. 2007), 7--21.",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Erin Brady, William Thies, and Edward Cutrell. 2014. Educational Content Creation and Sharing by Low-Income Visually Impaired People in India. In Proceedings of the Fifth ACM Symposium on Computing for Development (ACM DEV-5 '14). ACM, New York, NY, USA, 63--72.  ",
      "doi": "10.1145/2674377.2674385"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Nicola Dell, and Richard Anderson. 2015. Social Media Platforms for Low-Income Blind People in India. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 259--272.  ",
      "doi": "10.1145/2700648.2809858"
    },
    {
      "text": "Aditya Vashistha, Pooja Sethi, and Richard Anderson. 2017. Respeak: A Voice-based, Crowd-powered Speech Transcription System. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1855--1866.  ",
      "doi": "10.1145/3025453.3025640"
    },
    {
      "text": "Brian Wentz and Jonathan Lazar. 2011. Are Separate Interfaces Inherently Unequal?: An Evaluation with Blind Users of the Usability of Two Interfaces for a Social Networking Platform. In Proceedings of the 2011 iConference (iConference '11). ACM, New York, NY, USA, 91--97.  ",
      "doi": "10.1145/1940761.1940774"
    },
    {
      "text": "Yu Zhong, Walter S. Lasecki, Erin Brady, and Jeffrey P. Bigham. 2015. RegionSpeak: Quick Comprehensive Spatial Descriptions of Complex Images for Blind Users. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2353--2362.  ",
      "doi": "10.1145/2702123.2702437"
    },
    {
      "text": "Kathryn Zyskowski, Meredith Ringel Morris, Jeffrey P. Bigham, Mary L. Gray, and Shaun K. Kane. 2015. Accessible Crowdwork?: Understanding the Value in and Challenge of Microtask Employment for People with Disabilities. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1682--1693.  ",
      "doi": "10.1145/2675133.2675158"
    }
  ]
}