{
  "doi": "10.1145/3173574.3173600",
  "title": "MirrorMirror: A Mobile Application to Improve Speechreading Acquisition",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Many people around the world have difficulties in day-to-day conversation due to hearing loss. Hearing aids often fail to offer enough benefits and have low adoption rates. However, people with hearing loss find that speechreading can improve their understanding during conversation, but speechreading is a challenging skill to learn. Speechreading classes can improve acquisition, however there are a limited number of classes available and students can only practice effectively when attending class. To address this, we conducted a postal survey with 59 speechreading students to understand students' perspectives on practicing. Using our findings, we developed an Android application called MirrorMirror - a new Speechreading Acquisition Tool (SAT) that allows students to practice their speechreading by recording and watching videos of people they frequently speak with. We evaluated MirrorMirror through three case studies with speechreading students and found that they could effectively target their speechreading practice on people, words and situations they encounter during daily conversations.",
  "authors": [
    {
      "name": "Benjamin M. Gorman",
      "institution": "University of Dundee, Dundee, Scotland, United Kingdom",
      "img": "/do/10.1145/contrib-99658650473/rel-imgonly/ben2018.jpeg",
      "acmid": "99658650473",
      "orcid": "missing"
    },
    {
      "name": "David R. Flatla",
      "institution": "University of Dundee & University of Guelph, Dundee, Scotland, Canada",
      "img": "/do/10.1145/contrib-81460658260/rel-imgonly/mypicture2cropped.png",
      "acmid": "81460658260",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Action On Hearing Loss 2015. Hearing Matters. https://www.actiononhearingloss.org.uk/supporting-you/ policy-research-and-influencing/research/ hearing-matters.aspx. (2015).",
      "doi": ""
    },
    {
      "text": "Action On Hearing Loss 2016a. Describing Deafness. https://www.actiononhearingloss.org.uk/your-hearing/ about-deafness-and-hearing-loss/deafness/ describing-deafness.aspx. (2016).",
      "doi": ""
    },
    {
      "text": "Action On Hearing Loss 2016b. Learning to Lipread. https://www.actiononhearingloss.org.uk/-/media/ahl/ documents/publications/factsheets-and-leaflets/ leaflets/learning-to-lipread-leaflet.pdf. (2016).",
      "doi": ""
    },
    {
      "text": "Nicholas Altieri and Cheng-Ta Yang. 2016. Parallel linear dynamic models can mimic the McGurk effect in clinical populations. Journal of computational neuroscience 41, 2 (2016), 143--155.  ",
      "doi": "10.1007/s10827-016-0610-z"
    },
    {
      "text": "Linda Armstrong. 2015. On everybody's lips. http://www.scotlipreading.org.uk/files/1914/2686/1587/ On_everybodys_lips_-_report.pdf. (2015).",
      "doi": ""
    },
    {
      "text": "C. Benoît, M. T. Lallouache, T. Mohamadi, and C. Abry. 1992. A set of French visemes for visual speech synthesis. In Talking Machines: Theories, Models and Designs, G. Bailly and C. Benoît (Eds.). Elsevier Science Publishers B. V., North-Holland, Amsterdam, 485--504.",
      "doi": ""
    },
    {
      "text": "Carl A Binnie, Allen A Montgomery, and Pamela L Jackson. 1974. Auditory and visual contributions to the perception of consonants. Journal of speech, language, and hearing research 17, 4 (1974), 619--630.",
      "doi": ""
    },
    {
      "text": "Dan G. Blazer, Sarah Domnitz, and Catharyn T. Liverman (Eds.). 2016. Hearing Health Care for Adults: Priorities for Improving Access and Affordability. The National Academies Press, Washington, D.C.",
      "doi": ""
    },
    {
      "text": "Jan Blustein and Barbara E Weinstein. 2016. Opening the Market for Lower Cost Hearing Aids: Regulatory Change Can Improve the Health of Older Americans. American journal of public health 106, 6 (2016), 1032--1035.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Christoph Bregler and Yochai Konig. 1994. \"Eigenlips\" for robust speech recognition. In Acoustics, Speech, and Signal Processing ICASSP-94., Vol. 2. IEEE, Piscataway, NJ, II--669.",
      "doi": ""
    },
    {
      "text": "Anna Mae Bunger. 1961. Speech reading, Jena method: a textbook with lesson plans in full development for hard of hearing adults and discussion of adaptations for hard of hearing and deaf children. The Interstate, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Ruth Campbell, Barbara Dodd, and Denis K Burnham. 1998. Hearing by eye II. Vol. 2. Psychology Press, Hove, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Alan Cheng, Lei Yang, and Erik Andersen. 2017. Teaching Language and Culture with a Virtual Reality Game. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 541--549.  ",
      "doi": "10.1145/3025453.3025857"
    },
    {
      "text": "Richard Orin Cornett. 1967. Cued speech. Am. Ann. Deaf. 112, 1 (1967), 3--13.",
      "doi": ""
    },
    {
      "text": "Luke Dixon. 2016. Speak Easy: Hearing the views of your customers. Action On Hearing Loss, https://www. actiononhearingloss.org.uk/-/media/ahl/documents/ research-and-policy/reports/speakeasy-report.pdf. (2016).",
      "doi": ""
    },
    {
      "text": "Melisa Echalier. 2010. In it together: the impact of hearing loss on personal relationships. Royal National Institute for Deaf People, London, UK.",
      "doi": ""
    },
    {
      "text": "Norman P Erber. 1974. Effects of angle, distance, and illumination on visual reception of speech by profoundly deaf children. Journal of Speech and Hearing Research 17, 1 (1974), 99--112.",
      "doi": ""
    },
    {
      "text": "Cletus G Fisher. 1968. Confusions among visually perceived consonants. Journal of Speech, Language, and Hearing Research 11, 4 (1968), 796--804.",
      "doi": ""
    },
    {
      "text": "Marilyn French-St George and Richard G Stoker. 1988. Speechreading: An historical perspective. The Volta Review 90, 5 (1988), 17--21.",
      "doi": ""
    },
    {
      "text": "Stuart Gatehouse, Graham Naylor, and Clous Elberling. 2003. Benefits from hearing aids in relation to the interaction between the user and the environment. International Journal of Audiology 42, sup1 (2003), 77--85.",
      "doi": ""
    },
    {
      "text": "George A Gates and John H Mills. 2005. Presbycusis. The Lancet 366, 9491 (2005), 1111--1120.",
      "doi": ""
    },
    {
      "text": "E. Bruce Goldstein. 2013. Sensation and perception. Cengage Learning, Independence, KY.",
      "doi": ""
    },
    {
      "text": "Benjamin M Gorman and David R Flatla. 2017. A Framework for Speechreading Acquisition Tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, 519--530.  ",
      "doi": "10.1145/3025453.3025560"
    },
    {
      "text": "Louise Hickson, Carly Meyer, Karen Lovelock, Michelle Lampert, and Asad Khan. 2014. Factors associated with success with hearing aids in older adults. International journal of audiology 53, sup1 (2014), S18--S27.",
      "doi": ""
    },
    {
      "text": "Shizuo Hiki and Yumiko Fukuda. 1997. Negative Effect of Homophones on Speechreading in Japanese. In Audio-Visual Speech Processing: Computational & Cognitive Science Approaches. ISCA, Baxias, France, 9--12.",
      "doi": ""
    },
    {
      "text": "Amy Irwin, Michael Pilling, and Sharon M Thomas. 2011. An analysis of British regional accent and contextual cue effects on speechreading performance. Speech Communication 53, 6 (2011), 807--817.  ",
      "doi": "10.1016/j.specom.2011.01.010"
    },
    {
      "text": "Janet Jeffers and Margaret Barley. 1980. Speechreading (lipreading). Charles C. Thomas Publisher, Springfield, IL.",
      "doi": ""
    },
    {
      "text": "Carl J Jensema, Ramalinga Sarma Danturthi, and Robert Burch. 2000. Time spent viewing captions on television programs. American annals of the deaf 145, 5 (2000), 464--468.",
      "doi": ""
    },
    {
      "text": "Donald D Johnson and Karen B Snell. 1986. Effect of distance visual acuity problems on the speechreading performance of hearing-impaired adults. Journal of the Academy of Rehabilitative Audiology 19 (1986), 42--55.",
      "doi": ""
    },
    {
      "text": "Harriet Kaplan, Scott J Bally, and Carol Garretson. 1985. Speechreading: A way to improve understanding. Gallaudet University Press, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Celeste Kinginger. 2009. Language learning and study abroad: A critical reading of research. Springer.",
      "doi": ""
    },
    {
      "text": "Sharon G. Kujawa and M. Charles Liberman. 2006. Acceleration of Age-Related Hearing Loss by Early Noise Exposure: Evidence of a Misspent Youth. Journal of Neuroscience 26, 7 (2006), 2115--2123.",
      "doi": ""
    },
    {
      "text": "Patrick Lucey, Terrence Martin, and Sridha Sridharan. 2004. Confusability of phonemes grouped according to their viseme classes in noisy environments. In Proc. of Australian Int. Conf. on Speech Science & Tech. Australasian Speech Science and Technology Association (ASSTA), Canberra City, ACT, Australia, 265--270.",
      "doi": ""
    },
    {
      "text": "A Markides. 1989. Lipreading - Theory and Practice. Journal of the British Association of Teachers of the Deaf 13, 2 (1989), 29--47.",
      "doi": ""
    },
    {
      "text": "Laura Matthews. 2011. Unlimited potential?: a research report into hearing loss in the workplace. Action On Hearing Loss, https://www.actiononhearingloss.org.uk/ -/media/ahl/documents/research-and-policy/reports/ unlimited-potential-report.pdf. (2011).",
      "doi": ""
    },
    {
      "text": "Abby McCormack and Heather Fortnum. 2013. Why do people fitted with hearing aids not wear them? International Journal of Audiology 52, 5 (2013), 360--368.",
      "doi": ""
    },
    {
      "text": "Association of Teachers of Lipreading to Adults. 2010. Watch this face - A practical guide to lipreading. The Royal National Institute for Deaf People (RNID).",
      "doi": ""
    },
    {
      "text": "Pew Research Center 2017. Tech Adoption Climbs Amongst Older Adults. http://assets.pewresearch.org/ wp-content/uploads/sites/14/2017/05/16170850/PI_2017. 05.17_Older-Americans-Tech_FINAL.pdf. (2017).",
      "doi": ""
    },
    {
      "text": "Andrew Sears and Vicki L. Hanson. 2012. Representing Users in Accessibility Research. ACM Trans. Access. Comput. 4, 2, Article 7 (March 2012), 6 pages.  ",
      "doi": "10.1145/2141943.2141945"
    },
    {
      "text": "Patricia Sherren and Martin Christine. 1990. Look Hear: An Introduction to Lipreading. MGM/UA Home Video, London.",
      "doi": ""
    },
    {
      "text": "June E Shoup. 1980. Phonological aspects of speech recognition. In Trends in speech recognition. Prentice Hall, Englewood Cliffs, NJ, 125--138.",
      "doi": ""
    },
    {
      "text": "Donald G. Sims, C Dorn, C Clark, L Bryant, and B Mumford. 2002. New developments in computer assisted speechreading and auditory training.. In American Speech-Language-Hearing Association convention. ASHA, Atlanta, GA.",
      "doi": ""
    },
    {
      "text": "Nancy Tye-Murray. 2002. Conversation made easy: Speechreading and conversation training for individuals who have hearing loss (adults and teenagers). St. Louis: Central Institute for the Deaf (2002).",
      "doi": ""
    },
    {
      "text": "Nancy Tye-Murray. 2014. Foundations of aural rehabilitation: Children, adults, and their family members. Nelson Education, Scarborough, ON, Canada.",
      "doi": ""
    },
    {
      "text": "WHO 2015. Deafness and hearing loss, Fact sheet N.300. http://www.who.int/mediacentre/factsheets/fs300/en/. (2015).",
      "doi": ""
    }
  ]
}