{
  "doi": "10.1145/3173574.3174196",
  "title": "Empowering Families Facing English Literacy Challenges to Jointly Engage in Computer Programming",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Research suggests that parental engagement through Joint Media Engagement (JME) is an important factor in children's learning for coding and programming. Unfortunately, parents with limited technology background may have difficulty supporting their children's access to programming. English-language learning (ELL) families from marginalized communities face particular challenges in understanding and supporting programming, as code is primarily authored using English text. We present BlockStudio, a programming tool for empowering ELL families to jointly engage in introductory coding, using an environment embodying two design principles, text-free and visually concrete. We share a case study involving three community centers serving immigrant and refugee populations. Our findings show ELL families can jointly engage in programming without text, via co-creation and flexible roles, and can create a range of artifacts, indicating understanding of aspects of programming within this environment. We conclude with implications for coding together in ELL families and design ideas for text-free programming research.",
  "tags": [
    "joint media engagement (jme)",
    "coding",
    "text-free",
    "english-language learning (ell) families",
    "programming"
  ],
  "authors": [
    {
      "name": "Rahul Banerjee",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660471600",
      "orcid": "missing"
    },
    {
      "name": "Leanne Liu",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262014",
      "orcid": "missing"
    },
    {
      "name": "Kiley Sobel",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557410456",
      "orcid": "missing"
    },
    {
      "name": "Caroline Pitt",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659045615/rel-imgonly/option-2.jpg",
      "acmid": "99659045615",
      "orcid": "missing"
    },
    {
      "name": "Kung Jin Lee",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659044533",
      "orcid": "missing"
    },
    {
      "name": "Meng Wang",
      "institution": "Wuhan Huada National E-Learning Technologies, Wuhan, Hubei, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260613",
      "orcid": "missing"
    },
    {
      "name": "Sijin Chen",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479661619",
      "orcid": "missing"
    },
    {
      "name": "Lydia Davison",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260927",
      "orcid": "missing"
    },
    {
      "name": "Jason C. Yip",
      "institution": "University of Washington, Seattle, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757149",
      "orcid": "0000-0001-9980-0670"
    },
    {
      "name": "Amy J. Ko",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    },
    {
      "name": "Zoran Popovic",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620346",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Uzi Armon. 1997. Cooperative parent-child learning in a LEGO-Logo environment. Retrieved September 13, 2017 from http://eurologo.web.elte.hu/lectures/armon.htm.",
      "doi": ""
    },
    {
      "text": "Rahul Banerjee, Jason Yip, Kung Jin Lee, and Zoran Popović. 2016. Empowering children to rapidly author games and animations without writing code. In Proceedings of the 15th International Conference on Interaction Design and Children (IDC '16), 230--237.  ",
      "doi": "10.1145/2930674.2930688"
    },
    {
      "text": "Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as learning partners in the development of technological fluency. International Journal of Learning and Media 1, 2 (May 2009), 55--77.",
      "doi": ""
    },
    {
      "text": "Aaron Bauer, Eric Butler, and Zoran Popović. 2017. Dragon architect: Open design problems for guided learning in a creative computational thinking sandbox game. In Proceedings of the 12th International Conference on the Foundations of Digital Games (FDG '17), Article 26, 6 pages.  ",
      "doi": "10.1145/3102071.3102106"
    },
    {
      "text": "Beginner's Mind Collective and David Shaw. 2012. Makey Makey: improvising tangible and nature-based user interfaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), Stephen N. Spencer (Ed.), 367--370.  ",
      "doi": "10.1145/2148131.2148219"
    },
    {
      "text": "Stephen Cooper, Wanda Dann, and Randy Pausch. 2000. Alice: a 3-D tool for introductory programming concepts. In Proceedings of the Fifth Annual CCSC Northeastern Conference on the Journal of Computing in Small Colleges (CCSC '00), John G. Meinke (ed.). Consortium for Computing Sciences in Colleges, 107116. ",
      "doi": "10.5555/364132.364161"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. SAGE",
      "doi": ""
    },
    {
      "text": "Allen Cypher and Daniel Conrad Halbert (eds). 1993. Watch What I Do: Programming by Demonstration. MIT press. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "Allen Cypher and David C. Smith. 1995. KidSim: end user programming of simulations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95), 27--34.  ",
      "doi": "10.1145/223904.223908"
    },
    {
      "text": "Sayamindu Dasgupta and Benjamin Mako Hill. 2017. Learning to code in localized programming languages. In Proceedings of the Fourth (2017) ACM Conference on Learning @ Scale (L@S '17), 33--39.  ",
      "doi": "10.1145/3051457.3051464"
    },
    {
      "text": "Sayamindu Dasgupta, William Hale, Andrés MonroyHernández, and Benjamin Mako Hill. 2016. Remixing as a Pathway to Computational Thinking. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 1438--1449.  ",
      "doi": "10.1145/2818048.2819984"
    },
    {
      "text": "Oscar Dieste, Alejandrina M. Aranda, Fernando Uyaguari, Burak Turhan, Ayse Tosun, Davide Fucci, Markku Oivo, and Natalia Juristo. 2017. Empirical evaluation of the effects of experience on code quality and programmer productivity: An exploratory study. Empirical Software Engineering 22, 5 (February 2017), 2457--2542.  ",
      "doi": "10.1007/s10664-016-9471-3"
    },
    {
      "text": "Betsy DiSalvo, Cecili Reid, and Parisa Khanipour Roshan. 2014. They can't find us: the search for informal CS education. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (SIGCSE '14), 487--492.  ",
      "doi": "10.1145/2538862.2538933"
    },
    {
      "text": "Andrea A. diSessa and Harold Abelson. 1986. Boxer: A Reconstructible Computational Medium. In Communications of the ACM 29, no. 9 (1986), 859--868.  ",
      "doi": "10.1145/6592.6595"
    },
    {
      "text": "Allison Druin. 1999. Cooperative inquiry: developing new technologies for children with children. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99), 592--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Benedict du Boulay. 1989. Some difficulties of learning to program. In Studying the Novice Programmer, E. Soloway & J.C. Spohrer (eds.). Lawrence Erlbaum, Hillsdale, NJ, USA, 283--289.",
      "doi": ""
    },
    {
      "text": "Paul G. Fehrmann, Timothy Z. Keith, and Thomas M. Reimers. 1987. Home influence on school learning: Direct and indirect effects of parental involvement on high school grades. The Journal of Educational Research 80, 6 (July 1987), 330--337.",
      "doi": ""
    },
    {
      "text": "Janet Feigenspan, Christian Kastner, Jorg Liebig, Sven Apel, and Stefan Hanenberg. 2012. Measuring programming experience. In 2012 IEEE 20th International Conference on Program Comprehension (ICPC '12), 73--82.",
      "doi": ""
    },
    {
      "text": "Louise P. Flannery, Brian Silverman, Elizabeth R. Kazakoff, Marina Umaschi Bers, Paula Bontá, and Mitchel Resnick. 2013. Designing ScratchJr: support for early childhood learning through computer programming. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13), 1--10.  ",
      "doi": "10.1145/2485760.2485785"
    },
    {
      "text": "Ephraim P. Gilnert and Steven L. Tanimoto. 1984. Pict: An interactive graphical programming environment. Computer 17, 11 (1984), 7--25.  ",
      "doi": "10.1109/MC.1984.1658997"
    },
    {
      "text": "Bassam Hasan. 2003. The influence of specific computer experiences on computer self-efficacy beliefs. Computers in Human Behavior 19, 4 (July 2003), 443450.",
      "doi": ""
    },
    {
      "text": "Donald J. Hernandez, Nancy A. Denton, and Suzanne E. Macartney. 2007. Children in Immigrant FamiliesThe US and 50 States: National Origins, Language, and Early Education. Research Brief Series. Publication# 2007--11. Child Trends.",
      "doi": ""
    },
    {
      "text": "Donald J. Hernandez, Nancy A. Denton, and Suzanne E. Macartney. 2008. Children in immigrant families: Looking to America's future. Social Policy Report 22, 3 (2008), 1--24. Society for Research in Child Development.",
      "doi": ""
    },
    {
      "text": "William H. Jeynes. 2005. A meta-analysis of the relation of parental involvement to urban elementary school student academic achievement. Urban education 40, 3 (May 2005), 237--269.",
      "doi": ""
    },
    {
      "text": "Joel Jones. 2003. Abstract syntax tree implementation idioms. In Proceedings of the 10th Conference on Pattern Languages of Programs (PLoP2003).",
      "doi": ""
    },
    {
      "text": "Ken Kahn. 1996. Toontalk TM-an animated programming environment for children. Journal of Visual Languages & Computing 7, 2 (June 1996), 197--217.",
      "doi": ""
    },
    {
      "text": "Rosemin Kassam, Régis Vaillancourt, and John B. Collins. 2004. Pictographic instructions for medications: do different cultures interpret them accurately? International Journal of Pharmacy Practice 12, 4 (December 2004), 199--209.",
      "doi": ""
    },
    {
      "text": "Barbara B. Kawulich. 2005. Participant observation as a data collection method. Forum Qualitative Sozialforschung/Forum: Qualitative Social Research. Vol. 6. No. 2. 2005.",
      "doi": ""
    },
    {
      "text": "Caitlin Kelleher and Randy Pausch. 2005. Lowering the barriers to programming: A taxonomy of programming environments and languages for novice programmers. ACM Computing Surveys (CSUR), 37, 2 (June 2005), 83--137.  ",
      "doi": "10.1145/1089733.1089734"
    },
    {
      "text": "Finn Kensing and Jeanette Blomberg. 1998. Participatory design: Issues and concerns. Comput. Supported Coop. Work 7, 3--4 (January 1998), 167--185.  ",
      "doi": "10.1023/A%3A1008689307411"
    },
    {
      "text": "Andrew J. Ko, Brad A. Myers, and Htet Htet Aung. 2004. Six learning barriers in end-user programming systems. IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC), 59--66. IEEE.  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "Kyu Han Koh, Ashok Basawapatna, Vicki Bennett, Alexander Repenning. 2010. Towards the automatic recognition of computational thinking for adaptive visual language learning. In 2010 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC), 59--66.  ",
      "doi": "10.1109/VLHCC.2010.17"
    },
    {
      "text": "Raymond Lister, Beth Simon, Errol Thompson, Jacqueline L. Whalley, and Christine Prasad. 2006. Not seeing the forest for the trees: novice programmers and the SOLO taxonomy. In Proceedings of the 11th Annual SIGCSE Conference on Innovation and Technology in Computer Science Education (ITICSE '06), 118--122.  ",
      "doi": "10.1145/1140124.1140157"
    },
    {
      "text": "Sonia Livingstone, Leslie Haddon, Leslie, Anke Görzig, and Kjartan Ólafsson. 2011. Risks and safety on the internet: the perspective of European children: full findings and policy implications from the EU Kids Online survey of 9--16 year olds and their parents in 25 countries. Deliverable D4. EU Kids Online, London, UK.",
      "doi": ""
    },
    {
      "text": "Jane Margolis, Rachel Estrella, Joanna Goode, Jennifer Jellison Holme, and Kim Nao. 2010. Stuck in the Shallow End: Education, Race, and Computing. MIT Press ",
      "doi": "10.5555/1413116"
    },
    {
      "text": "Indrani Medhi, Aman Sagar, and Kentaro Toyama. 2006. Text-free user interfaces for illiterate and semiliterate users. International Conference on Information and Communication Technologies and Development (ICTD '06), 72--82. IEEE.",
      "doi": ""
    },
    {
      "text": "Sharan B. Merriam. 1988. Case Study Research in Education: A Qualitative Approach. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "D. Morere. 2011. Reading research and deaf children. Visual Language and Visual Learning Science of Learning Center, Research Brief No. 4.",
      "doi": ""
    },
    {
      "text": "Greg L. Nelson, Benjamin Xie, and Amy J. Ko. 2017. Comprehension First: Evaluating a Novel Pedagogy and Tutoring System for Program Tracing in CS1. In Proceedings of the 2017 ACM Conference on International Computing Education Research (ICER '17), 2--11. ",
      "doi": "10.1145/3105726.3106178"
    },
    {
      "text": "Laura M. Padilla-Walker, Sarah M. Coyne, and Ashley M. Fraser. 2012. Getting a high'speed family connection: Associations between family media use and family connection. Family Relations 61, 3 (June 2012), 426--440.",
      "doi": ""
    },
    {
      "text": "Alexander Repenning. 2013. Making programming accessible and exciting. Computer 46, 6 (June 2013), 78--81.  ",
      "doi": "10.1109/MC.2013.214"
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés MonroyHernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: programming for all. Communications of the ACM 52, 11 (November 2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Ricarose Roque. 2016. Family creative learning. In Makeology: Makerspaces as Learning Environments, Volume 1, Kylie Peppler, Erica Halverson, and Yasmin B. Kafai (eds.). Routledge, 47--63.",
      "doi": ""
    },
    {
      "text": "Ricarose Roque, Karina Lin, and Richard Liuzzi. 2015. Engaging parents as creative learning partners in computing. Exploring the Material Conditions of Learning 2, 687--688.",
      "doi": ""
    },
    {
      "text": "Ricarose Roque, Karina Lin, and Richard Liuzzi. 2016. \"I'm not just a mom\": Parents developing multiple roles in creative computing. In Proceedings of the International Society of the Learning Sciences (ISLS '16), 663--670.",
      "doi": ""
    },
    {
      "text": "Seattle Times Staff. 2010. Seattle's Rainier Valley, One of America's 'Dynamic Neighborhoods.' The Seattle Times. Retrieved September 13, 2017 from http://www.seattletimes.com/opinion/seattles-rainiervalley-one-of-americas-dynamic-neighborhoods/.",
      "doi": ""
    },
    {
      "text": "Sandra D. Simpkins, Pamela E. Davis-Kean, and Jacquelynne S. Eccles. 2005. Parents' socializing behavior and children's participation in math, science, and computer out-of-school activities. Applied Developmental Science 9, 1 (January 2005), 14--30.",
      "doi": ""
    },
    {
      "text": "Juha Sorva. 2012. Visual program simulation in introductory programming education. Doctoral Dissertation. Aalto University, Espoo, Finland",
      "doi": ""
    },
    {
      "text": "Lori Takeuchi and Reed Stevens. 2011. The New Coviewing: Designing for Learning through Joint Media Engagement. The Joan Ganz Cooney Center at Sesame Workshop. New York, NY.",
      "doi": ""
    },
    {
      "text": "Steven L Tanimoto. 2003. Programming in a data factory. In Proceedings of the 2003 IEEE Symposium on Human Centric Computing Languages and Environment, 100--107. ",
      "doi": "10.5555/1153917.1153973"
    },
    {
      "text": "Laura Tucker, Rachel E. Scherr, Todd Zickler, and Eric Mazur. 2016. Exclusively visual analysis of classroom group interactions. Physical Review Physics Education Research 12, 2 (November 2016), 1--9.",
      "doi": ""
    },
    {
      "text": "Aaron Tyo-Dickerson and Kristi Williams. 2017. ICS Addis and MIT Translate Scratch into Amharic. Retrieved September 13, 2017 from www.tieonline.com/article/2100/ics-addis-and-mittranslate-scratch-into-amharic.",
      "doi": ""
    },
    {
      "text": "Anneliese von Mayrhauser and A. Marie Vans. 1995. Program comprehension during software maintenance and evolution. Computer 28, 8 (1995), 44--55.  ",
      "doi": "10.1109/2.402076"
    },
    {
      "text": "Seungwon Yang, Carlotta Domeniconi, Matt Revelle, Mack Sweeney, Ben U. Gelman, Chris Beckley, and Aditya Johri. 2015. Uncovering trajectories of informal learning in large online communities of creators. In Proceedings of the Second (2015) ACM Conference on Learning @ Scale (L@S '15), 131--140.  ",
      "doi": "10.1145/2724660.2724674"
    },
    {
      "text": "Robert Yin. 2013. Validity and generalizations in future case study evaluations. Evaluation, 19(3), 321332.",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Carmen Gonzalez, and Vikki Katz. 2016. The learning experiences of youth online information brokers. In Proceedings of the International Society of the Learning Sciences (ISLS '16), 362--369.",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Caroline Pitt, Kung Jin Lee, Sijin Chen, Kari Nasu, and Laura R. Pina. 2017. Examining adult-child interactions in intergenerational participatory design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5742--5754.  ",
      "doi": "10.1145/3025453.3025787"
    }
  ]
}