{
  "doi": "10.1145/3173574.3174210",
  "title": "Complex Mediation in the Formation of Political Opinions",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The Internet plays an important role in the formation of political opinions by supporting citizens in discovering diverse political information and opinions. However, the echo chamber effect has become of increasing concern, referring to the tendency for people to encounter opinions and information similar to their own online. It remains poorly understood how ordinary citizens use the Internet in the formation of political opinions. To answer this question, we conducted an interview study with 32 Chinese citizens. We found that participants used complex strategies to coordinate personal networks and technologies in specific ways to better understand political events. To analyze this phenomenon, we draw on Bødker and Andersen's model of complex mediation which describes how multiple mediators including people and artifacts work together to mediate an activity. We discuss how complex mediation supported participants in informing their political opinions. We derive design implications for supporting people to form political opinions.",
  "tags": [
    "political opinion",
    "activity theory",
    "political deliberation",
    "information seeking",
    "complex mediation",
    "complex media environment"
  ],
  "authors": [
    {
      "name": "Yubo Kou",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020443",
      "orcid": "0000-0002-4255-3725"
    },
    {
      "name": "Bonnie Nardi",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100150025",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lada A. Adamic and Natalie Glance. 2005. The political blogosphere and the 2004 U.S. election. Proceedings of the 3rd international workshop on Link discovery - LinkKDD '05, ACM Press, 36--43.  ",
      "doi": "10.1145/1134271.1134277"
    },
    {
      "text": "Roya Akhavan-Majid. 2004. Mass Media Reform in China: Toward a New Analytical Framework. International Communication Gazette 66, 6: 553--565.",
      "doi": ""
    },
    {
      "text": "Ashley Lutz. 2012. These 6 Corporations Control 90% Of The Media In America. Business Insider. Retrieved from http://www.businessinsider.com/these-6corporations-control-90-of-the-media-in-america-2012-",
      "doi": ""
    },
    {
      "text": "Eytan Bakshy, Solomon Messing, and Lada A. Adamic. 2015. Exposure to ideologically diverse news and opinion on Facebook. Science 348, 6239: 1130--1132.",
      "doi": ""
    },
    {
      "text": "Eytan Bakshy, Itamar Rosenn, Cameron Marlow, and Lada Adamic. 2012. The role of social networks in information diffusion. Proceedings of the 21st international conference on World Wide Web WWW '12, ACM Press, 519--528.  ",
      "doi": "10.1145/2187836.2187907"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"critical\" about critical design? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, ACM Press, 3297--3306.  ",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Jiao Bei. 2013. How Chinese Journalists use Weibo microblogging for investigative reporting. Retrieved from http://reutersinstitute.politics.ox.ac.uk/publication/howchinese-journalists-use-weibo-microblogginginvestigative-reporting",
      "doi": ""
    },
    {
      "text": "Yochai Benkler, Hal Roberts, Robert Faris, Alicia Solow-Niederman, and Bruce Etling. 2013. Social Mobilization and the Networked Public Sphere: Mapping the SOPA-PIPA Debate. SSRN Electronic Journal.",
      "doi": ""
    },
    {
      "text": "Bruce Bimber. 2000. The Study of Information Technology and Civic Engagement. Political Communication 17, 4: 329--333.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 1996. Applying activity theory to video analysis: how to make sense of video data in human-computer interaction. In Context and consciousness: activity theory and human-computer interactiond consciousness. MIT Press, 147--174. ",
      "doi": "10.5555/223826.223833"
    },
    {
      "text": "Susanne Bødker and Peter Bøgh Andersen. 2005. Complex Mediation. Human-Computer Interaction 20: 353--402.  ",
      "doi": "10.1207/s15327051hci2004_1"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Mike Budd, Steve Craig, and Clayton M. Steinman. 1999. Consuming Environments: Television and Commercial Culture. Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "Jörg Cassens. 2005. User Aspects of Explanation Aware CBR Systems. IFIP Conference on HumanComputer Interaction - INTERACT 2005, 1087--1090.  ",
      "doi": "10.1007/11555261_111"
    },
    {
      "text": "CERN. 2001. Evolution of Internet in China. Retrieved from http://www.edu.cn/introduction_1378/20060323/t2006 0323_4285.shtml",
      "doi": ""
    },
    {
      "text": "Andrew. Chadwick. 2017. The hybrid media system: politics and power. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Thomas Chase. 2012. An internet-mediated political public sphere in China and South Korea.",
      "doi": ""
    },
    {
      "text": "Cindy Chiu, Davis Lin, and Ari Silverman. 2012. China's social media boom.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Andrés Monroy-Hernández, and Gloria Mark. 2014. \"Narco\" emotions: affect and desensitization in social media during the mexican drug war. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM Press, 3563--3572.  ",
      "doi": "10.1145/2556288.2557197"
    },
    {
      "text": "Torkil Clemmensen, Victor Kaptelinin, and Bonnie Nardi. 2016. Making HCI theory work: an analysis of the use of activity theory in HCI research. Behaviour & Information Technology 35, 8: 608--627.  ",
      "doi": "10.1080/0144929X.2016.1175507"
    },
    {
      "text": "CNNIC. 2015. The 35th China Internet Development Statistics Report. Retrieved from https://www.cnnic.net.cn/hlwfzyj/hlwxzbg/hlwtjbg/201 502/t20150203_51634.htm",
      "doi": ""
    },
    {
      "text": "Elanor Colleoni, Alessandro Rozza, and Adam Arvidsson. 2014. Echo Chamber or Public Sphere? Predicting Political Orientation and Measuring Political Homophily in Twitter Using Big Data. Journal of Communication 64, 2: 317--332.",
      "doi": ""
    },
    {
      "text": "Kelley Cotter, Janghee Cho, and Emilee Rader. 2017. Explaining the News Feed Algorithm: An Analysis of the \"News Feed FYI\" Blog. Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17, ACM Press, 1553--1560.  ",
      "doi": "10.1145/3027063.3053114"
    },
    {
      "text": "Nick Couldry and James Curran. 2003. Contesting media power: alternative media in a networked world. Rowman & Littlefield Publishers.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A pool of dreams: facebook, politics and the emergence of a social movement. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 3573--3582.  ",
      "doi": "10.1145/2556288.2557100"
    },
    {
      "text": "Lincoln Dahlberg. 2001. The Internet and Democratic Discourse: Exploring The Prospects of Online Deliberative Forums Extending the Public Sphere. Information, Communication & Society 4, 4: 615--633.",
      "doi": ""
    },
    {
      "text": "Peter Dahlgren. 2002. In Search of the Talkative Public: Media, Deliberative Democracy and Civic Culture. Javnost - The Public 9, 3: 5--25.",
      "doi": ""
    },
    {
      "text": "Peter Dahlgren. 2005. The Internet, Public Spheres, and Political Communication: Dispersion and Deliberation. Political Communication 22, 2: 147--162.",
      "doi": ""
    },
    {
      "text": "Kevin M. DeLuca, Sean Lawson, and Ye Sun. 2012. Occupy Wall Street on the Public Screens of Social Media: The Many Framings of the Birth of a Protest Movement. Communication, Culture & Critique 5, 4: 483--509.",
      "doi": ""
    },
    {
      "text": "Ganlin Ding. 2002.(China Press Development). Higher Education Press, Beijing.",
      "doi": ""
    },
    {
      "text": "Abraham Doris-Down, Husayn Versee, and Eric Gilbert. 2013. Political blend: an application designed to bring people together based on political differences. Proceedings of the 6th International Conference on Communities and Technologies - C&T '13, ACM Press, 120--130.  ",
      "doi": "10.1145/2482991.2483002"
    },
    {
      "text": "Sara Douglas, Roxanne B. Raine, Misa Maruyama, Bryan Semaan, and Scott P. Robertson. 2015. Community matters: How young adults use Facebook to evaluate political candidates. Information Polity 20, 2,3: 135--150.",
      "doi": ""
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2016. Social Inequality and HCI: The View from Political Economy. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, 4997--5002.  ",
      "doi": "10.1145/2858036.2858343"
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2017. Heteromation, and Other Stories of Computing and Capitalism. MIT Press. ",
      "doi": "10.5555/3158920"
    },
    {
      "text": "Mostafa M. El-Bermaway. 2016. Your Echo Chamber is Destroying Democracy. Wired Magazine. Retrieved from https://www.wired.com/2016/11/filter-bubbledestroying-democracy/",
      "doi": ""
    },
    {
      "text": "Robert Entman. 1993. Framing Toward Clarification of a Fractured Paradigm. Journal of Communication 43, 4: 51--58.",
      "doi": ""
    },
    {
      "text": "Robert Entman. 2007. Framing Bias: Media in the Distribution of Power. Journal of Communication 57, 1: 163--173.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, et al. 2016. First I \"like\" it, then I hide it: Folk Theories of Social Feeds. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, 2371--2382.  ",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Hanqi Fang. 2002. China Journalism and Communication History). Renmin University of China Press, Beijing.",
      "doi": ""
    },
    {
      "text": "Marcus Franda. 2002. Launching into Cyberspace: Internet Development and Politics in Five World Regions. Lynne Rienner Publishers, Inc., Boulder. ",
      "doi": "10.5555/516013"
    },
    {
      "text": "R. Kelly Garrett. 2009. Echo chambers online?: Politically motivated selective exposure among Internet news users. Journal of Computer-Mediated Communication 14, 2: 265--285.",
      "doi": ""
    },
    {
      "text": "R. Kelly Garrett. 2009. Politically Motivated Reinforcement Seeking: Reframing the Selective Exposure Debate. Journal of Communication 59, 4: 676--699.",
      "doi": ""
    },
    {
      "text": "Margo Gee. 1985. The 1980 Olympic boycott: media bias in Canada and Great Britain. The 1980 Olympic boycott: media bias in Canada and Great Britain.",
      "doi": ""
    },
    {
      "text": "Eric Gilbert, Tony Bergstrom, and Karrie Karahalios. 2009. Blogs are Echo Chambers: Blogs are Echo Chambers. 2009 42nd Hawaii International Conference on System Sciences, IEEE, 1--10.  ",
      "doi": "10.1109/HICSS.2009.91"
    },
    {
      "text": "Jennifer Golbeck and Derek Hansen. 2011. Computing political preference among twitter followers. Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, ACM Press, 1105--1108.  ",
      "doi": "10.1145/1978942.1979106"
    },
    {
      "text": "Merle Goldman. 1994. The Role of The Press In PostMao Political Struggles. In China's Media, Media's China, Chin-Chuan Lee (ed.). Westview Press, Inc., Boulder, Colorado, 23--35.",
      "doi": ""
    },
    {
      "text": "Catherine Grevet, Loren G. Terveen, and Eric Gilbert. 2014. Managing political differences in social media. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, ACM Press, 1400--1408.  ",
      "doi": "10.1145/2531602.2531676"
    },
    {
      "text": "Marlowe Hood. 1994. the Use and Abuse of Mass Media by Chinese Leaders During the 1980s. In China's Media, Media's China, Chin-Chuan Lee (ed.). Westview Press, Inc., Boulder, Colorado, 37--57.",
      "doi": ""
    },
    {
      "text": "Christopher Hooton. 2016. Social media echo chambers gifted Donald Trump the presidency. the Independent. Retrieved from http://www.independent.co.uk/voices/donald-trumppresident-social-media-echo-chamberhypernormalisation-adam-curtis-protests-blamea7409481.html",
      "doi": ""
    },
    {
      "text": "Robert Huckfeldt and John Sprague. 1987. Networks in Context: The Social Flow of Political Information. The American Political Science Review 81, 4: 1197--1216.",
      "doi": ""
    },
    {
      "text": "Victor Kaptelinin. 1996. Activity Theory: Implications for Human-Computer Interaction. In Context and Consciousness: Activity Theory and Human-computer Interaction. MIT Press, 103--116. ",
      "doi": "10.5555/223826.223831"
    },
    {
      "text": "Victor Kaptelinin and Bonnie A. Nardi. 2006. Acting with Technology: Activity Theory and Interaction Design. The MIT Press. ",
      "doi": "10.5555/1196435"
    },
    {
      "text": "Lu Keng. 1994. Press Control in \"New China\" and \"Old China.\" In China's Media, Media's China, ChinChuan Lee (ed.). Westview Press, Inc., Boulder, Colorado, 147--161.",
      "doi": ""
    },
    {
      "text": "Valdimer Orlando Key and Milton C. Cummings. 1966. The responsible electorate: rationality in presidential voting, 1936--1960, Volume 1966. Belknap Press of Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Gary King, Jennifer Pan, and Margaret Roberts. 2013. How Censorship in China Allows Government Criticism but Silences Collective Expression. American Political Science Review 107, 2: 326--343.",
      "doi": ""
    },
    {
      "text": "Yubo Kou, Yong Ming Kow, and Xinning Gui. 2017. Resisting the Censorship Infrastructure in China. 2017 50th Hawaii International Conference on System Sciences, 2332--2340.",
      "doi": ""
    },
    {
      "text": "Yubo Kou, Yong Ming Kow, Xinning Gui, and Waikuen Cheng. 2017. One Social Movement, Two Social Media Sites: A Comparative Study of Public Discourses. Computer Supported Cooperative Work (CSCW) 26, 4--6: 807--836.  ",
      "doi": "10.1007/s10606-017-9284-y"
    },
    {
      "text": "Yubo Kou, Bryan Semaan, and Bonnie Nardi. 2017. A Confucian Look at Internet Censorship in China. IFIP Conference on Human-Computer Interaction INTERACT 2017, Springer, Cham, 377--398.",
      "doi": ""
    },
    {
      "text": "Yong Ming Kow, Yubo Kou, Bryan Semaan, and Waikuen Cheng. 2016. Mediating the Undercurrents: Using Social Media to Sustain a Social Movement. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, 3883--3894.  ",
      "doi": "10.1145/2858036.2858186"
    },
    {
      "text": "Juhi Kulshrestha, Motahhare Eslami, Johnnatan Messias, et al. 2017. Quantifying Search Bias: Investigating Sources of Bias for Political Searches in Social Media. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17, ACM Press, 417-- 432.  ",
      "doi": "10.1145/2998181.2998321"
    },
    {
      "text": "Chin-Chuan Lee. 1994. Ambiguities and Contradictions: Issues in China's Changing Political Communication. In China's Media, Media's China, Chin-Chuan Lee (ed.). Westview Press, Inc., Boulder, Colorado, 3--20.",
      "doi": ""
    },
    {
      "text": "Jayeon Lee. 2014. Are Some People Less Influenced by Others' Opinions? The Role of Internal Political Self-Efficacy and Need for Cognition in Impression Formation on Social Networking Sites. Cyberpsychology, Behavior, and Social Networking 17, 9: 571--577.",
      "doi": ""
    },
    {
      "text": "Alexei Leont'ev. 1978. Activity, Consciousness, and Personality. Prentice-Hall.",
      "doi": ""
    },
    {
      "text": "Zhan Li. 2004. Will the Internet Form the Public Sphere in China? Systemics, Cybernetics and Informatics 2, 2.",
      "doi": ""
    },
    {
      "text": "Bin Liang and Hong Lu. 2010. Internet Development, Censorship, and Cyber Crimes in China. Journal of Contemporary Criminal Justice 26, 1: 103--120.",
      "doi": ""
    },
    {
      "text": "Helena Lindgren and Ingeborg Nilsson. 2009. Designing Systems for Health Promotion and Autonomy in Older Adults. IFIP Conference on Human-Computer Interaction -- INTERACT 2009, 700--703.  ",
      "doi": "10.1007/978-3-642-03658-3_75"
    },
    {
      "text": "Qing Liu and Barrett McCormick. 2011. The Media and the Public Sphere in Contemporary China. boundary 2 38, 1: 101--134.",
      "doi": ""
    },
    {
      "text": "Gilad Lotan, Erhardt Graeff, Mike Ananny, Devin Gaffney, Ian Pearce, and danah boyd. 2011. The Arab Spring| The Revolutions Were Tweeted: Information Flows during the 2011 Tunisian and Egyptian Revolutions. International Journal of Communication 5, 31.",
      "doi": ""
    },
    {
      "text": "Arthur Lupia. 1994. Shortcuts Versus Encyclopedias: Information and Voting Behavior in California Insurance Reform Elections. American Political Science Review 88, 1: 63--76.",
      "doi": ""
    },
    {
      "text": "Ringo Ma. 2008. Spread of SARS and War-Related Rumors through New Media in China. Communication Quarterly 56, 4: 376--391.",
      "doi": ""
    },
    {
      "text": "Rebecca MacKinnon. 2011. China's \"Networked Authoritarianism.\" Journal of Democracy 22, 32--46.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Mossaab Bagdouri, Leysia Palen, James Martin, Ban Al-Ani, and Kenneth Anderson. 2012. Blogs as a collective war diary. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work - CSCW '12, ACM Press, 37--46.  ",
      "doi": "10.1145/2145204.2145215"
    },
    {
      "text": "Marshall McLuhan and Lewis H. Lapham. 1994. Understanding Media: The Extensions of Man. The MIT Press. Retrieved from http://www.amazon.com/dp/0262631598",
      "doi": ""
    },
    {
      "text": "Mary Milliken, Kerri Gibson, and Susan O'Donnell. 2008. User-generated video and the online public sphere: Will YouTube facilitate digital freedom of expression in Atlantic Canada. American Communication Journal 10, 3: 1--14.",
      "doi": ""
    },
    {
      "text": "Andrés Monroy-Hernández, Danah Boyd, Emre Kiciman, Munmun De Choudhury, and Scott Counts. 2013. The new war correspondents: the rise of civic media curation in urban warfare. Proceedings of the 2013 conference on Computer supported cooperative work - CSCW '13, ACM Press, 1443--1452.  ",
      "doi": "10.1145/2441776.2441938"
    },
    {
      "text": "Yi Mou, Kevin Wu, and David Atkin. 2014. Understanding the use of circumvention tools to bypass online censorship. New Media & Society 18, 5: 837-- 856.",
      "doi": ""
    },
    {
      "text": "Michael J. Muller and Sarah Kuhn. 1993. Participatory design. Communications of the ACM 36, 6: 24--28.  ",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Sean A. Munson and Paul Resnick. 2011. The Prevalence of Political Discourse in Non-Political Blogs. Fifth International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Bonnie A Nardi. 1996. Activity Theory and Humancomputer Interaction. In Context and consciousness: activity theory and human-computer interaction. MIT Press, Cambridge, Mass. ",
      "doi": "10.5555/223826.223827"
    },
    {
      "text": "Natalie Pang. 2013. Civic Action and Media Perceptions within the Wall: The (Re) Negotiation of Power in China. JeDEM - eJournal of eDemocracy and Open Government 5, 1: 1--15.",
      "doi": ""
    },
    {
      "text": "Zizi Papacharissi. 2002. The virtual sphere: The internet as a public sphere. New Media & Society 4, 1: 9--27.",
      "doi": ""
    },
    {
      "text": "Eli Pariser. 2011. The filter bubble: What the Internet is hiding from you. Penguin UK. ",
      "doi": "10.5555/2029079"
    },
    {
      "text": "Nathaniel Poor. 2006. Mechanisms of an Online Public Sphere: The Website Slashdot. Journal of ComputerMediated Communication 10, 2: 00--00.",
      "doi": ""
    },
    {
      "text": "Bei Qin, David Stromberg, and Yanhui Wu. 2016. Media Bias in China.",
      "doi": ""
    },
    {
      "text": "Margaret Roberts. 2015. Experiencing Censorship Emboldens Internet Users and Decreases Government Support in China.",
      "doi": ""
    },
    {
      "text": "Sarita Yardi Schoenebeck. 2014. Giving up Twitter for Lent: how and why we take breaks from social media. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM Press, 773--782.  ",
      "doi": "10.1145/2556288.2556983"
    },
    {
      "text": "Bryan Semaan, Heather Faucett, Scott P. Robertson, Misa Maruyama, and Sara Douglas. 2015. Designing Political Deliberation Environments to Support Interactions in the Public Sphere. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, ACM Press, 3167--3176.  ",
      "doi": "10.1145/2702123.2702403"
    },
    {
      "text": "Bryan Semaan, Scott Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres: towards depolarization. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14, ACM Press, 1409-- 1421.  ",
      "doi": "10.1145/2531602.2531605"
    },
    {
      "text": "Maqsood Ahmad Shaheen. 2008. Use of social networks and information seeking behavior of students during political crises in Pakistan: A case study. The International Information & Library Review 40, 3: 142--147.",
      "doi": ""
    },
    {
      "text": "Clay Shirky. 2011. Political Power of Social Media Technology, the Public Sphere Sphere, and Political Change, The. Foreign Affairs 90.",
      "doi": ""
    },
    {
      "text": "Olivia Solon. 2016. Facebook's failure: did fake news and polarized politics get Trump elected? the Guardian. Retrieved from https://www.theguardian.com/technology/2016/nov/10/ facebook-fake-news-election-conspiracy-theories",
      "doi": ""
    },
    {
      "text": "Nick Srnicek. Platform capitalism. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2012. (How) will the revolution be retweeted?: information diffusion and the 2011 Egyptian uprising. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work - CSCW '12, ACM Press, 7--16.  ",
      "doi": "10.1145/2145204.2145212"
    },
    {
      "text": "Daniela Stockmann and Mary E. Gallagher. 2011. Remote Control: How the Media Sustain Authoritarian Rule in China. Comparative Political Studies 44, 4: 436--467.",
      "doi": ""
    },
    {
      "text": "Jennifer Stromer-Galley. 2006. Diversity of Political Conversation on the Internet: Users' Perspectives. Journal of Computer-Mediated Communication 8, 3: 0--0.",
      "doi": ""
    },
    {
      "text": "Miklos Sukosd and King-wa Fu. 2013. How Chinese Netizens Discuss Environmental Conflicts? Framing and Functions on Sina Weibo. SSRN Electronic Journal.",
      "doi": ""
    },
    {
      "text": "Cass R. Sunstein. 2009. Republic. Com 2. 0. Princeton University Press. ",
      "doi": "10.5555/1536923"
    },
    {
      "text": "Borislav Tadic, Markus Rohde, Volker Wulf, and David Randall. 2016. ICT Use by Prominent Activists in Republika Srpska. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16, ACM Press, 3364--3377.  ",
      "doi": "10.1145/2858036.2858153"
    },
    {
      "text": "Zixue Tai. 2006. The Internet in China. Cyberspace and Civil Society. Routledge Tayloy & Francis Group, LLC. Retrieved from http://www.taylorandfrancis.com ",
      "doi": "10.5555/2378744"
    },
    {
      "text": "Zeynep Tufekci and Christopher Wilson. 2012. Social Media and the Decision to Participate in Political Protest: Observations From Tahrir Square. Journal of Communication 62, 2: 363--379.",
      "doi": ""
    },
    {
      "text": "Lev Vygotsky. 1978. Mind in society: the development of higher psychological processes. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Cara Wallis. 2011. New Media Practices in China: Youth Patterns, Processes, and Politics. International Journal of Communication 5, 31.",
      "doi": ""
    },
    {
      "text": "Yiran Wang and Gloria Mark. 2013. Trust in Online News: Comparing Social Media and Official Media Use by Chinese Citizens. Proceedings of the 2013 conference on Computer supported cooperative work, ACM, 599--610.  ",
      "doi": "10.1145/2441776.2441843"
    },
    {
      "text": "Yiran Wang and Gloria Mark. 2017. Engaging with Political and Social Issues on Facebook in College Life. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17, ACM Press, 433--445.  ",
      "doi": "10.1145/2998181.2998295"
    },
    {
      "text": "Ran Wei and Zhongdang Pan. 1999. Mass Media and Consumerist Values in the People's Republic of China. International Journal of Public Opinion Research 11, 1: 75--96.",
      "doi": ""
    },
    {
      "text": "Data Center Weibo. 2014. 2014 Weibo User Development Report. Retrieved from http://data.weibo.com/report/reportDetail?id=215",
      "doi": ""
    },
    {
      "text": "Mike Westling. 2007. Expanding the Public Sphere: The Impact of Facebook on Political Communication. Society 28, May: 835--860. Retrieved from http://www.thenewvernacular.com/projects/facebook_a nd_political_communication.pdf",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Konstantin Aal, Ibrahim Abu Kteish, et al. 2013. Fighting against the wall: social media use by political activists in a Palestinian village. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, ACM Press, 1979--1988.  ",
      "doi": "10.1145/2470654.2466262"
    },
    {
      "text": "Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. \"On the ground\" in Sidi Bouzid: investigating social media use during the tunisian revolution. Proceedings of the 2013 conference on Computer supported cooperative work CSCW '13, ACM Press, 1409--1418.  ",
      "doi": "10.1145/2441776.2441935"
    },
    {
      "text": "Sarita Yardi and Danah Boyd. 2010. Dynamic Debates: An Analysis of Group Polarization Over Time on Twitter. Bulletin of Science, Technology & Society 30, 5: 316--327.",
      "doi": ""
    },
    {
      "text": "Lee Chyen Yee and Paul Carsten. 2013. China to invest $323 bln to expand broadband to all-minister. Reuters. Retrieved from http://www.reuters.com/article/2013/09/18/chinabroadband-idUSL3N0HE0O720130918",
      "doi": ""
    },
    {
      "text": "Haiqing Yu. 2006. From Active Audience to Media Citizenship: The Case of Post-Mao China. Social Semiotics 16, 2: 303--326.",
      "doi": ""
    },
    {
      "text": "Haiqing Yu. 2007. Talking, Linking, Clicking: The Politics of AIDS and SARS in Urban China. positions: east asia cultures critique 15, 1: 35--63.",
      "doi": ""
    },
    {
      "text": "X. Zhou. 2009. The political blogosphere in China: A content analysis of the blogs regarding the dismissal of Shanghai leader Chen Liangyu. New Media & Society 11, 6: 1003--1022.",
      "doi": ""
    }
  ]
}