{
  "doi": "10.1145/3173574.3173760",
  "title": "Video Game Selection Procedures For Experimental Research",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "Videogames are complex stimuli, and selecting games that consistently induce a desired player experience (PX) in an experimental setting can be challenging. The number of relatively high-quality games being released each year continues to increase, which makes deriving a shortlist of plausible candidate games from this pool increasingly problematic. Despite this, guidance for structuring and reporting on the game selection process remains limited. This paper therefore proposes two approaches to game selection: the first leverages online videogame databases and existing PX research, and is structured with respect to widely-applicable videogame metadata. The second process applies established game design theory to serve researchers when insufficient connections between desired PX outcomes and recognisable game elements exist. Both methods are accompanied by example reports of their application. The present work aims to assist experimental researchers in selecting videogames likely to meet their needs, while encouraging more rigorous standards of reporting in the field.",
  "tags": [
    "game selection",
    "player experience",
    "video games",
    "experiments"
  ],
  "authors": [
    {
      "name": "April Tyack",
      "institution": "Queensland University of Technology (QUT), Brisbane, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078187",
      "orcid": "missing"
    },
    {
      "name": "Peta Wyeth",
      "institution": "Queensland University of Technology (QUT), Brisbane, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100401053",
      "orcid": "missing"
    },
    {
      "name": "Madison Klarkowski",
      "institution": "Queensland University of Technology (QUT), Brisbane, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658771903",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Roger Altizer Jr. and José P. Zagal. 2014. Designing Inside the Box or Pitching Practices in Industry and Education. In Proceedings of DiGRA 2014.",
      "doi": ""
    },
    {
      "text": "Craig A. Anderson. 2004. An Update on the Effects of Playing Violent Video Games. Journal of Adolescence 27, 1, 113--122.",
      "doi": ""
    },
    {
      "text": "Craig A. Anderson, Nicholas L. Carnagey, Mindy Flanagan, Arlin J. Benjamin Jr., Janie Eubanks, and Jeffery C. Valentine. 2004. Violent Video Games: Specific Effects of Violent Content on Aggressive Thoughts and Behavior. Advances in Experimental Social Psychology 36, 199--249.",
      "doi": ""
    },
    {
      "text": "Patrícia Arriaga, Joana Adrião, Filipa Madeira, Inês Cavaleiro, Alexandra Maia e Silva, Isabel Barahona, and Francisco Esteves. 2015. A \"Dry Eye\" for Victims of Violence: Effects of Playing a Violent Video Game on Pupillary Dilation to Victims and on Aggressive Behavior. Psychology of Violence 5, 2, 199--208.",
      "doi": ""
    },
    {
      "text": "J. A. Bargas-Avila and K. Hornbæk. 2011. Old Wine in New Bottles or Novel Challenges: A Critical Analysis of Empirical Studies of User Experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2689--2698.  ",
      "doi": "10.1145/1978942.1979336"
    },
    {
      "text": "Pippin Barr, James Noble, and Robert Biddle. 2007. Video Game Values: Human-Computer Interaction and Games. Interacting with Computers 19, 2, 180--195.  ",
      "doi": "10.1016/j.intcom.2006.08.008"
    },
    {
      "text": "Debbie Bonetti, Martin Eccles, Marie Johnston, Nick Steen, Jeremy Grimshaw, Rachel Baker, Anne Walker, and Nigel Pitts. 2005. Guiding the Design and Selection of Interventions to Influence the Implementation of Evidence-Based Practice: An Experimental Simulation of a Complex Intervention Trial. Social Science & Medicine 60, 9, 2135--2147.",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Boyle, Thomas M. Connolly, Thomas Hainey, and James M. Boyle. 2012. Engagement in Digital Entertainment Games: A Systematic Review. Computers in Human Behavior 28, 3, 771--780.  ",
      "doi": "10.1016/j.chb.2011.11.020"
    },
    {
      "text": "Paul Cairns. 2007. HCI... Not as it Should Be: Inferential Statistics in HCI Research. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...But not as we Know It - Volume 1. 195--201. ",
      "doi": "10.5555/1531294.1531321"
    },
    {
      "text": "Paul Cairns, Anna L. Cox, Matthew Day, Hayley Martin, and Thomas Perryman. 2013. Who But Not Where: The Effect of Social Play on Immersion in Digital Games. International Journal of Human-Computer Studies 71, 11, 10691077.  ",
      "doi": "10.1016/j.ijhcs.2013.08.015"
    },
    {
      "text": "Donald T. Campbell and Julian C. Stanley. 2015. Experimental and Quasi-Experimental Designs for Research. Ravenio Books.",
      "doi": ""
    },
    {
      "text": "Peter Craig, Paul Dieppe, Sally Macintyre, Susan Michie, Irwin Nazareth, and Mark Petticrew. 2008. Developing and Evaluating Complex Interventions: The New Medical Research Council Guidance. BMJ 337.",
      "doi": ""
    },
    {
      "text": "Christy Dena. 2017. Finding a Way: Techniques to Avoid Schema Tension in Narrative Design. Transactions of the Digital Games Research Association 3, 1, 27--61.",
      "doi": ""
    },
    {
      "text": "Alena Denisova and Paul Cairns. 2015. First Person vs. Third Person Perspective in Digital Games: Do Player Preferences Affect Immersion? In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 145--148.  ",
      "doi": "10.1145/2702123.2702256"
    },
    {
      "text": "Mark D. Dunlop and Mark Baillie. 2009. Paper Rejected (p&gt;0.05): An Introduction to the Debate on Appropriateness of Null-Hypothesis Testing. International Journal of Mobile Human Computer Interaction 1, 3, 1--8.",
      "doi": ""
    },
    {
      "text": "Malte Elson and Thorsten Quandt. 2016. Digital Games in Laboratory Experiments: Controlling a Complex Stimulus Through Modding. Psychology of Popular Media Culture 5, 1, 52--65.",
      "doi": ""
    },
    {
      "text": "Christian Elverdam and Espen Aarseth. 2007. Game Classification and Game Design: Construction Through Critical Analysis. Games and Culture 2, 1, 3--22.",
      "doi": ""
    },
    {
      "text": "GameFAQs. 2017. Search GameFAQs. Retrieved 17 September, 2017 from https://www.gamefaqs.com/search_advanced",
      "doi": ""
    },
    {
      "text": "Russell Gersten, Scott Baker, and John Wills Lloyd. 2000. Designing High-Quality Research in Special Education: Group Experimental Design. The Journal of Special Education 34, 1, 2--18.",
      "doi": ""
    },
    {
      "text": "Wayne D. Gray and Marilyn C. Salzman. 1998. Damaged Merchandise? A Review of Experiments that Compare Usability Evaluation Methods. Human-Computer Interaction 13, 3, 203--261.  ",
      "doi": "10.1207/s15327051hci1303_2"
    },
    {
      "text": "Morten Hertzum and Niels Ebbe Jacobsen. 2001. The Evaluator Effect: A Chilling Fact About Usability Evaluation Methods. International Journal of Human-Computer Interaction 13, 4, 421--443.",
      "doi": ""
    },
    {
      "text": "Joseph Hilgard, Christopher R. Engelhardt, Bruce D. Bartholow, and Jeffrey N. Rouder. 2017. How Much Evidence Is p &gt; .05? Stimulus Pre-Testing and Null Primary Outcomes in Violent Video Games Research. Psychology of Popular Media Culture 6, 4, 361--380.",
      "doi": ""
    },
    {
      "text": "Clint Hocking. 2011. Dynamics: The State of the Art. Video.",
      "doi": ""
    },
    {
      "text": "Robin Hunicke and Vernell Chapman. 2004. AI for Dynamic Difficulty Adjustment in Games. In Challenges in Game Artificial Intelligence. AAAI, 91--96.",
      "doi": ""
    },
    {
      "text": "Robin Hunicke, Marc LeBlanc, and Robert Zubek. 2004. MDA: A Formal Approach to Game Design and Game Research. In Proceedings of the AAAI Workshop on Challenges in Game AI.",
      "doi": ""
    },
    {
      "text": "Simo Järvelä, Inger Ekman, J. Matias Kivikangas, and Niklas Ravaja. 2014. A Practical Guide to Using Digital Games as an Experiment Stimulus. Transactions of the Digital Games Research Association 1, 2.",
      "doi": ""
    },
    {
      "text": "Simo Järvelä, Inger Ekman, J. Matias Kivikangas, and Niklas Ravaja. 2015. Stimulus Games. In Game Research Methods. ETC Press. ",
      "doi": "10.5555/2812774.2812790"
    },
    {
      "text": "Monique W. M. Jaspers. 2009. A Comparison of Usability Methods for Testing Interactive Health Technologies: Methodological Aspects and Empirical Evidence. International Journal of Medical Informatics 78, 5, 340--353.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett. 2010. Is Game Immersion Just Another Form of Selective Attention? An Empirical Investigation of Real World Dissociation in Computer Game Immersion. PhD Thesis. University College London, London, England.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Anna L. Cox, Paul Cairns, Samira Dhoparee, Andrew Epps, Tim Tijs, and Alison Walton. 2008. Measuring and Defining the Experience of Immersion in Games. International Journal of Human-Computer Studies 66, 9, 641661.  ",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Jacob Jett, Simone Sacchi, Jin Ha Lee, and Rachel Ivy Clarke. 2016. A Conceptual Model for Video Games and Interactive Media. Journal of the Association for Information Science & Technology 67, 3, 505--517.  ",
      "doi": "10.1002/asi.23409"
    },
    {
      "text": "Daniel Johnson, Lennart Nacke, and Peta Wyeth. 2015. All about that Base: Differing Player Experiences in Video Game Genres and the Unique Case of MOBA Games. In Proceedings of 33rd Annual ACM Conference on Human Factors in Computing Systems. 2265--2274.  ",
      "doi": "10.1145/2702123.2702447"
    },
    {
      "text": "Daniel Johnson, Peta Wyeth, Penelope Sweetser, and John Gardner. 2012. Personality, Genre and Videogame Play Experience. In Proceedings of the 4th International Conference on Fun and Games. ACM, 117--120.  ",
      "doi": "10.1145/2367616.2367633"
    },
    {
      "text": "Maurits Kaptein and Judy Robertson. 2012. Rethinking Statistical Analysis Methods for CHI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1105--1114.  ",
      "doi": "10.1145/2207676.2208557"
    },
    {
      "text": "Robert E. Larzelere, Brett R. Kuhn, and Byron Johnson. 2004. The Intervention Selection Bias: An Underrecognized Confound in Intervention Research. Psychological Bulletin 130, 2, 289--303.",
      "doi": ""
    },
    {
      "text": "Effie Lai-Chong Law, Paul van Schaik, and Virpi Roto. 2014. Attitudes Towards User Experience (UX) Measurement. International Journal of Human-Computer Studies 72, 6, 526--541.",
      "doi": ""
    },
    {
      "text": "Jin Ha Lee, Hyerim Cho, Violet Fox, and Andrew Perti. 2013. User-Centered Approach in Creating a Metadata Schema for Video Games and Interactive Media. In Proceedings of the 13th ACM/IEEE-CS Joint Conference on Digital Libraries. 229--238.  ",
      "doi": "10.1145/2467696.2467702"
    },
    {
      "text": "Jin Ha Lee, Rachel Ivy Clarke, and Andrew Perti. 2015. Empirical Evaluation of Metadata for Video Games and Interactive Media. Journal of the Association for Information Science & Technology 66, 12, 2609--2625.  ",
      "doi": "10.1002/asi.23357"
    },
    {
      "text": "Jin Ha Lee, Andrew Perti, Rachel Ivy Clarke, Travis W. Windleharth, and Marc Schmalz. 2017. Video Game Metadata Schema Version 4.0. Retrieved from http://gamer.ischool.uw.edu/official_release/",
      "doi": ""
    },
    {
      "text": "Ian J. Livingston, Regan L. Mandryk, and Kevin G. Stanley. 2010. Critic-Proofing: How Using Critic Review and Game Genres Can Refine Heuristic Evaluations. In Proceedings of the International Academic Conference on the Future of Game Design and Technology. ACM, 48--55.  ",
      "doi": "10.1145/1920778.1920786"
    },
    {
      "text": "Kathleen N. Lohr. 2002. Assessing Health Status and Quality-of-Life Instruments: Attributes and Review Criteria. Quality of Life Research 11, 3, 193--205.",
      "doi": ""
    },
    {
      "text": "Sus Lundgren and Staffan Bjork. 2003. Game Mechanics: Describing Computer-Augmented Games in Terms of Interaction. In Proceedings of the 2003 Technologies for Interactive Digital Storytelling and Entertainment Conference.",
      "doi": ""
    },
    {
      "text": "Frances Mair and Pamela Whitten. 2000. Systematic Review of Studies of Patient Satisfaction with Telemedicine. BMJ 320, 7248, 1517--1520.",
      "doi": ""
    },
    {
      "text": "Ryan P. McMahan, Eric D. Ragan, Anamary Leal, Robert J. Beaton, and Doug A. Bowman. 2011. Considerations for the Use of Commercial Video Games in Controlled Experiments. Entertainment Computing 2, 1, 3--9.",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler, Julia Ayumi Bopp, Alexandre N. Tuch, and Klaus Opwis. 2014. A Systematic Review of Quantitative Studies on the Enjoyment of Digital Entertainment Games. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems. ACM, 927--936.  ",
      "doi": "10.1145/2556288.2557078"
    },
    {
      "text": "Bonnie A. Nardi, ed. Context and Consciousness: Activity Theory and Human-Computer Interaction. 1996, MIT Press: Massachusetts, USA. ",
      "doi": "10.5555/223826"
    },
    {
      "text": "Nintendo EAD. 2008. Mario Kart Wii. Videogame {Wii}. Nintendo, Kyoto, Japan.",
      "doi": ""
    },
    {
      "text": "Overhaul Games. 2017. Planescape: Torment Enhanced Edition. Videogame {PC}. Beamdog, Edmonton, Canada.",
      "doi": ""
    },
    {
      "text": "Cody Phillips, Daniel Johnson, Peta Wyeth, Leanne Hides, and Madison Klarkowski. 2015. Redefining Videogame Reward Types. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. 83--91.  ",
      "doi": "10.1145/2838739.2838782"
    },
    {
      "text": "David Pinelle, Nelson Wong, and Tadeusz Stach. 2008. Heuristic Evaluation for Games: Usability Principles for Video Game Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1453--1462.  ",
      "doi": "10.1145/1357054.1357282"
    },
    {
      "text": "PlatinumGames. 2017. Bayonetta. Videogame {PC}. SEGA, Tokyo, Japan.",
      "doi": ""
    },
    {
      "text": "Michael Pressley, Steve Graham, and Karen Harris. 2006. The State of Educational Intervention Research as Viewed Through the Lens of Literacy Intervention. British Journal of Educational Psychology 76, 1, 1--19.",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, Edward L. Deci, C. Scott Rigby, and Richard M. Ryan. 2014. CompetenceImpeding Electronic Games and Players' Aggressive Feelings, Thoughts, and Behaviors. Journal of Personality and Social Psychology 106, 3, 441--457.",
      "doi": ""
    },
    {
      "text": "Ready At Dawn. 2017. Lone Echo. Videogame {PC}. Oculus Studios, California, USA.",
      "doi": ""
    },
    {
      "text": "Red Hook Studios. 2017. Darkest Dungeon - The Crimson Court. Videogame {PC}. Red Hook Studios, Vancouver, Canada.",
      "doi": ""
    },
    {
      "text": "John P. Robinson, Phillip R. Shaver, and Lawrence S. Wrightsman. 1991. Criteria for Scale Selection and Evaluation. Measures of Personality and Social Psychological Attitudes 1, 3, 1--16.",
      "doi": ""
    },
    {
      "text": "Robert Rosenthal. 1979. The File Drawer Problem and Tolerance for Null Results. Psychological Bulletin 86, 3, 638--641.",
      "doi": ""
    },
    {
      "text": "SteamSpy. 2017. Monthly Summaries. Retrieved 7th September, 2017 from http://steamspy.com/year/",
      "doi": ""
    },
    {
      "text": "Caroline B. Terwee, Sandra D. M. Bot, Michael R. de Boer, Daniëlle A. W. M. van der Windt, Dirk L. Knol, Joost Dekker, Lex M. Bouter, and Henrica C. W. de Vet. 2007. Quality Criteria Were Proposed for Measurement Properties of Health Status Questionnaires. Journal of Clinical Epidemiology 60, 1, 34--42.",
      "doi": ""
    },
    {
      "text": "Vero Vanden Abeele, Lennart E. Nacke, Elisa D. Mekler, and Daniel Johnson. 2016. Design and Preliminary Validation of The Player Experience Inventory. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts. ACM, 335341.  ",
      "doi": "10.1145/2968120.2987744"
    },
    {
      "text": "Gary L. Wells and Paul D. Windschitl. 1999. Stimulus Sampling and Social Psychological Experimentation. Personality and Social Psychology Bulletin 25, 9, 1115--1125.",
      "doi": ""
    },
    {
      "text": "Dmitri Williams. 2005. Bridging the Methodological Divide in Game Research. Simulation & Gaming 36, 4, 447--463.",
      "doi": ""
    },
    {
      "text": "Dolf Zillmann. 1988. Mood Management Through Communication Choices. The American Behavioral Scientist 31, 3, 327--340.",
      "doi": ""
    }
  ]
}