{
  "doi": "10.1145/3173574.3174098",
  "title": "Intellingo: An Intelligible Translation Environment",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Translation environments offer various translation aids to support professional translators. However, translation aids typically provide only limited justification for the translation suggestions they propose. In this paper we present Intellingo, a translation environment that explores intelligibility for translation aids, to enable more sensible usage of translation suggestions. We performed a comparative study between an intelligible version and a non-intelligible version of Intellingo. The results show that although adding intelligibility does not necessarily result in significant changes to the user experience, translators can better assess translation suggestions without a negative impact on their performance. Intelligibility is preferred by translators when the additional information it conveys benefits the translation process and when this information is not part of the translator's readily available knowledge.",
  "tags": [
    "translation",
    "intelligibility",
    "user interfaces",
    "usability"
  ],
  "authors": [
    {
      "name": "Sven Coppers",
      "institution": "Hasselt University - tUL - imec, Diepenbeek, Belgium",
      "img": "/do/10.1145/contrib-99659022233/rel-imgonly/profile.jpg",
      "acmid": "99659022233",
      "orcid": "missing"
    },
    {
      "name": "Jan Van den Bergh",
      "institution": "Hasselt University - tUL - imec, Diepenbeek, Belgium",
      "img": "/do/10.1145/contrib-81100371140/rel-imgonly/1253small.jpg",
      "acmid": "81100371140",
      "orcid": "missing"
    },
    {
      "name": "Kris Luyten",
      "institution": "Hasselt University - tUL - Flanders Make, Diepenbeek, Belgium",
      "img": "/do/10.1145/contrib-81309493252/rel-imgonly/luyten_k.png",
      "acmid": "81309493252",
      "orcid": "0000-0002-4194-1101"
    },
    {
      "name": "Karin Coninx",
      "institution": "Hasselt University - tUL - Flanders Make, Diepenbeek, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100095928",
      "orcid": "missing"
    },
    {
      "name": "Iulianna van der Lek-Ciudin",
      "institution": "KU Leuven - University of Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260958",
      "orcid": "missing"
    },
    {
      "name": "Tom Vanallemeersch",
      "institution": "KU Leuven - University of Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261977",
      "orcid": "missing"
    },
    {
      "name": "Vincent Vandeghinste",
      "institution": "KU Leuven - University of Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414616554",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Stavros Antifakos, Nicky Kern, Bernt Schiele, and Adrian Schwaninger. 2005. Towards Improving Trust in Context-aware Systems by Displaying System Confidence. In Proceedings of the 7th International Conference on Human Computer Interaction with Mobile Devices & Services (MobileHCI '05). ACM, New York, NY, USA, 9--14.  ",
      "doi": "10.1145/1085777.1085780"
    },
    {
      "text": "Edmund K. Asare. 2011. An Ethnographic Study of the Use of Translation Tools in a Translation Agency: Implications for Translation Tool Design. Ph.D. Dissertation. Kent State University. ",
      "doi": "10.5555/2338440"
    },
    {
      "text": "Louise Barkhuus and Anind Dey. 2003. Is Context-Aware Computing Taking Control away from the User? Three Levels of Interactivity Examined. In Proceedings of UbiComp 2003: Ubiquitous Computing: 5th International Conference, Seattle, WA, USA, October 12--15, 2003. Springer Berlin Heidelberg, Berlin, Heidelberg, 149--156.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti and Keith Edwards. 2001. Intelligibility and Accountability: Human Considerations in Context-Aware Systems. Human-Computer Interaction 16, 2 (Dec. 2001), 193--212.  ",
      "doi": "10.1207/S15327051HCI16234_05"
    },
    {
      "text": "John Brooke. 1996. SUS: A quick and dirty usability scale. (1996).",
      "doi": ""
    },
    {
      "text": "Andreas Buja, John Alan McDonald, John Michalak, and Werner Stuetzle. 1991. Interactive Data Visualization Using Focusing and Linking. In Proceedings of the 2Nd Conference on Visualization '91 (VIS '91). IEEE Computer Society Press, Los Alamitos, CA, USA, 156--163. http://dl.acm.org/citation.cfm?id=949607.949633 ",
      "doi": "10.5555/949607.949633"
    },
    {
      "text": "Casmacat. 2016. Casmacat. (11 November 2016). Retrieved January 3, 2018 from http://www.casmacat.eu/.",
      "doi": ""
    },
    {
      "text": "Chan Sin-wai. 2004. A dictionary of Translation and Technology. Hong Kong: Chinese University Press. ",
      "doi": "10.5555/1199506"
    },
    {
      "text": "Keith Cheverst, Nigel Davies, Keith Mitchell, and Christos Efstratiou. 2001. Using Context as a Crystal Ball: Rewards and Pitfalls. Personal and Ubiquitous Computing 5, 1 (Feb. 2001), 8--11.  ",
      "doi": "10.1007/s007790170020"
    },
    {
      "text": "Collaborative Translation Networks, LLC. 2018. CafeTran Espresso. (2018). Retrieved January 3, 2018 from https://www.cafetran.com/.",
      "doi": ""
    },
    {
      "text": "Jan Van den Bergh, Eva Geurts, Donald Degraen, Mieke Haesen, Iulianna van der Lek-Ciudin, and Karin Coninx. 2015. Recommendations for Translation Environments to Improve Translators' Workflows. In Translating and the Computer 37. Asling.",
      "doi": ""
    },
    {
      "text": "Anind K. Dey and Alan Newberger. 2009. Support for Context-aware Intelligibility and Control. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 859--868.  ",
      "doi": "10.1145/1518701.1518832"
    },
    {
      "text": "Gavin Doherty, Nikiforos Karamanis, and Saturnino Luz. 2012. Collaboration in Translation: The Impact of Increased Reach on Cross-organisational Work. Computer Supported Cooperative Work 21, 6 (2012), 525--554.",
      "doi": ""
    },
    {
      "text": "F. Doshi-Velez and B. Kim. 2017. Towards A Rigorous Science of Interpretable Machine Learning. ArXiv e-prints (Feb. 2017).",
      "doi": ""
    },
    {
      "text": "Maureen Ehrensberger-Dow and Gary Massey. 2014. Cognitive ergonomic issues in professional translation. The development of translation competence: Theories and methodologies from psycholinguistics and cognitive science (2014), 58--86.",
      "doi": ""
    },
    {
      "text": "Michael D. Ekstrand, F. Maxwell Harper, Martijn C. Willemsen, and Joseph A. Konstan. 2014. User Perception of Differences in Recommender Algorithms. In Proceedings of the 8th ACM Conference on Recommender Systems (RecSys '14). ACM, New York, NY, USA, 161--168.  ",
      "doi": "10.1145/2645710.2645737"
    },
    {
      "text": "Marcello Federico, Nicola Bertoldi, Mauro Cettolo, Matteo Negri, Marco Turchi, Marco Trombetti, Alessandro Cattelan, Antonio Farina, Domenico Lupinetti, Andrea Martines, and others. 2014. The MateCat tool. In Proceedings of COLING. 129--132. Extended abstract on free online tool for analysis of effect of MT on post-editing.",
      "doi": ""
    },
    {
      "text": "Spence Green, Jeffrey Heer, and Christopher D. Manning. 2013. The Efficacy of Human Post-editing for Language Translation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 439--448.  ",
      "doi": "10.1145/2470654.2470718"
    },
    {
      "text": "Spence Green, Jeffrey Heer, and Christopher D. Manning. 2015. Natural Language Translation at the Intersection of AI and HCI. Commun. ACM 58, 9 (Aug. 2015), 46--53.  ",
      "doi": "10.1145/2767151"
    },
    {
      "text": "Jonathan L. Herlocker, Joseph A. Konstan, and John Riedl. 2000. Explaining Collaborative Filtering Recommendations. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (CSCW '00). ACM, New York, NY, USA, 241--250.  ",
      "doi": "10.1145/358916.358995"
    },
    {
      "text": "Mat Honan. 2014. I liked everything I saw on Facebook for two days. Here?s what it did to me. I Wired, publisert 8 (2014), 2014.",
      "doi": ""
    },
    {
      "text": "Lilt Inc. 2017. Lilt. (2017). Retrieved January 3, 2018 from https://www.lilt.com.",
      "doi": ""
    },
    {
      "text": "Hilary Johnson and Peter Johnson. 1993. Explanation facilities and interactive systems. ACM Press, 159--166.  ",
      "doi": "10.1145/169891.169951"
    },
    {
      "text": "Nikiforos Karamanis, Saturnino Luz, and Gavin Doherty. 2011. Translation practice in the workplace: contextual analysis and implications for machine translation. Machine Translation 25, 1 (2011), 35--52.  ",
      "doi": "10.1007/s10590-011-9093-x"
    },
    {
      "text": "Kilgray. 2018. MemoQ Translation software. (2018). Retrieved January 3, 2018 from https://www.memoq.com/en/.",
      "doi": ""
    },
    {
      "text": "Philipp Koehn, Hieu Hoang, Alexandra Birch, Chris Callison-Burch, Marcello Federico, Nicola Bertoldi, Brooke Cowan, Wade Shen, Christine Moran, Richard Zens, Chris Dyer, Ondřej Bojar, Alexandra Constantin, and Evan Herbst. 2007. Moses: Open Source Toolkit for Statistical Machine Translation. In Proceedings of the 45th Annual Meeting of the ACL on Interactive Poster and Demonstration Sessions (ACL '07). Association for Computational Linguistics, Stroudsburg, PA, USA, 177--180. http://dl.acm.org/citation.cfm?id=1557769.1557821 ",
      "doi": "10.5555/1557769.1557821"
    },
    {
      "text": "Joseph A Konstan and John Riedl. 2012. Recommender systems: from algorithms to user experience. User Modeling and User-Adapted Interaction 22, 1--2 (2012), 101--123.  ",
      "doi": "10.1007/s11257-011-9112-x"
    },
    {
      "text": "Elina Lagoudaki. 2008. The value of machine translation for the professional translator. In Proceedings of the 8th Conference of the Association for Machine Translation in the Americas. 262--269.",
      "doi": ""
    },
    {
      "text": "Elina Lagoudaki. 2009. Translation editing environments. In MT Summit XII: Workshop on Beyond Translation Memories.",
      "doi": ""
    },
    {
      "text": "Vladimir Iosifovich Levenshtein. 1966. Binary Codes Capable of Correcting Deletions, Insertions, and Reversals. Soviet Physics-Doklady 10, 8 (1966). https: //nymity.ch/sybilhunting/pdf/Levenshtein1966a.pdf",
      "doi": ""
    },
    {
      "text": "Brian Y. Lim and Anind K. Dey. 2010. Toolkit to support intelligibility in context-aware applications. ACM Press, 13.  ",
      "doi": "10.1145/1864349.1864353"
    },
    {
      "text": "Brian Y. Lim, Anind K. Dey, and Daniel Avrahami. 2009. Why and Why Not Explanations Improve the Intelligibility of Context-aware Intelligent Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 2119--2128.  ",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Lieve Macken, Els Lefever, and Veronique Hoste. 2013. Texsis: bilingual terminology extraction from parallel corpora using chunk-based alignment. Terminology. International Journal of Theoretical and Applied Issues in Specialized Communication 19, 1 (2013), 1--30.",
      "doi": ""
    },
    {
      "text": "MateCat. 2018. MateCat. (2018). Retrieved January 3, 2018 from https://www.matecat.com/.",
      "doi": ""
    },
    {
      "text": "Joss Moorkens and Sharon O'Brien. 2016. Assessing User Interface Needs of Post-Editors of Machine Translation. Human Issues in Translation Technology: The IATIS Yearbook. Abingdon: Routledge (to appear) (2016).",
      "doi": ""
    },
    {
      "text": "Bonnie M. Muir. 1994. Trust in automation: Part I. Theoretical issues in the study of trust and human intervention in automated systems. Ergonomics 37, 11 (Nov. 1994), 1905--1922.",
      "doi": ""
    },
    {
      "text": "SDL. 2018. SDL Trados Studio. (2018). Retrieved January 3, 2018 from http://www.sdl.com/software-and-services/ translation-software/sdl-trados-studio/.",
      "doi": ""
    },
    {
      "text": "David Silver, Aja Huang, Chris J. Maddison, Arthur Guez, Laurent Sifre, George van den Driessche, Julian Schrittwieser, Ioannis Antonoglou, Veda Panneershelvam, Marc Lanctot, Sander Dieleman, Dominik Grewe, John Nham, Nal Kalchbrenner, Ilya Sutskever, Timothy Lillicrap, Madeleine Leach, Koray Kavukcuoglu, Thore Graepel, and Demis Hassabis. 2016. Mastering the game of Go with deep neural networks and tree search. Nature 529, 7587 (Jan. 2016), 484--489.",
      "doi": ""
    },
    {
      "text": "Rashmi Sinha and Kirsten Swearingen. 2002. The Role of Transparency in Recommender Systems. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, New York, NY, USA, 830--831.  ",
      "doi": "10.1145/506443.506619"
    },
    {
      "text": "Across Systems. 2018. Across Translator Edition. (2018). Retrieved January 3, 2018 from https://www.my-across.net/en/.",
      "doi": ""
    },
    {
      "text": "Jörg Tiedemann. 2009. News from OPUS-A collection of multilingual parallel corpora with tools and interfaces. In Recent advances in natural language processing, Vol. 5. 237--248.",
      "doi": ""
    },
    {
      "text": "Nava Tintarev and Judith Masthoff. 2007a. Effective Explanations of Recommendations: User-centered Design. In Proceedings of the 2007 ACM Conference on Recommender Systems (RecSys '07). ACM, New York, NY, USA, 153--156.  ",
      "doi": "10.1145/1297231.1297259"
    },
    {
      "text": "N. Tintarev and J. Masthoff. 2007b. A Survey of Explanations in Recommender Systems. In 2007 IEEE 23rd International Conference on Data Engineering Workshop. 801--810.  ",
      "doi": "10.1109/ICDEW.2007.4401070"
    },
    {
      "text": "Tom Vanallemeersch and Vincent Vandeghinste. 2015. Assessing linguistically aware fuzzy matching in translation memories. In Proceedings of the 18th Annual Conference of EAMT.",
      "doi": ""
    },
    {
      "text": "Jo Vermeulen, Kris Luyten, and Karin Coninx. 2013. Intelligibility Required: How to Make Us Look Smart Again. In Proceedings of the 10th Romanian Conference on Human-Computer Interaction, ROCHI, Vol. 13. 36.",
      "doi": ""
    },
    {
      "text": "Jesse Vig, Shilad Sen, and John Riedl. 2009. Tagsplanations: Explaining Recommendations Using Tags. In Proceedings of the 14th International Conference on Intelligent User Interfaces (IUI '09). ACM, New York, NY, USA, 47--56.  ",
      "doi": "10.1145/1502650.1502661"
    },
    {
      "text": "Wordfast, LLC. 2018. Wordfast. (2018). Retrieved January 3, 2018 from http://www.wordfast.com/.",
      "doi": ""
    },
    {
      "text": "XTM International Ltd. 2018. XTM - Better Translation Technology. (2018). Retrieved January 3, 2018 from https://xtm-intl.com/.",
      "doi": ""
    },
    {
      "text": "Jianlong Zhou, M. Asif Khawaja, Zhidong Li, Jinjun Sun, Yang Wang, and Fang Chen. 2016. Making machine learning useable by revealing internal states update - a transparent approach. International Journal of Computational Science and Engineering 13, 4 (2016), 378.  ",
      "doi": "10.1504/IJCSE.2016.080214"
    }
  ]
}