{
  "doi": "10.1145/3173574.3174048",
  "title": "Explaining Viewers' Emotional, Instrumental, and Financial Support Provision for Live Streamers",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "On live streams, viewers can support streamers through various methods ranging from well-wishing text messages to money. In this study (N=230) we surveyed viewers who had given money to a streamer. We identified six motivations for why they gave money to their favorite live streamer. We then examined how factors related to viewer, streamer, and viewer-streamer interaction were associated with three forms of social support provision: emotional, instrumental, and financial support. Our main findings are: parasocial relationship was consistently correlated with all three types of social support, while social presence was only related with instrumental and financial support; interpersonal attractiveness was associated with emotional and instrumental support and lonely people were more likely to give instrumental support. Our focus on various types of social support in a live streaming masspersonal platform adds a more detailed understanding to the existing literature of mediated social support. Furthermore, it suggests potential directions for designing more supportive and interactive live streaming platforms.",
  "authors": [
    {
      "name": "Donghee Yvette Wohn",
      "institution": "New Jersey Institute of Technology, Newark, NJ, USA",
      "img": "/do/10.1145/contrib-81481649423/rel-imgonly/yvettesmall.jpg",
      "acmid": "81481649423",
      "orcid": "0000-0001-5583-4430"
    },
    {
      "name": "Guo Freeman",
      "institution": "University of Cincinnati, Cincinnati, OH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639182",
      "orcid": "0000-0001-5107-7794"
    },
    {
      "name": "Caitlin McLaughlin",
      "institution": "Thompson Rivers University, Kamloops, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482653143",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Philip J. Auter. 1992. TV that talks back: An experimental validation of a parasocial interaction scale. Journal of Broadcasting and Electronic Media 36, 2: 173--182.",
      "doi": ""
    },
    {
      "text": "Manuel Barrera. 1986. Distinctions between social support concepts, measures, and models. American Journal of Community Psychology 14, 4: 413--445.",
      "doi": ""
    },
    {
      "text": "Katherine Y. Chuang and Christopher C. Yang. 2010. Helping you to help me: exploring supportive interaction in online health community. Proceedings of the 73rd ASIS&T Annual Meeting on Navigating Streams in an Information Ecosystem - Volume 47 47: No.9. Retrieved September 17, 2017 from http://dl.acm.org/citation.cfm?id=1920344&CFID=809 185747&CFTOKEN=79139081 ",
      "doi": "10.5555/1920331.1920344"
    },
    {
      "text": "Jessica Conditt. 2017. Twitch's in-chat tipping program generated $6 million in 2016. Engadget. Retrieved from https://www.engadget.com/2017/02/15/twitchstreamers-bits-6-million-year-in-review-2016/",
      "doi": ""
    },
    {
      "text": "Carolyn E. Cutrona and Daniel W. Russell. 1987. The provisions of social relationships and adaptation to stress. Advances in Personal Relationships 1, 1: 37--67.",
      "doi": ""
    },
    {
      "text": "Carolyn Cutrona, Daniel Russell, and Jayne Rose. 1986. Social support and adaptation to stress by the elderly. Psychology and Aging1 1, 1: 47--54.",
      "doi": ""
    },
    {
      "text": "Mary Conway Dato-on and Marc Fetscherin. 2012. Brand Love: Interpersonal or Parasocial Love Relationship? In Consumer-Brand Relationships: Theory and Practice. Routledge, 151--166. Retrieved from http://www.brandmanagement.usi.ch/Abstracts/Monday/Brandrelationsh ipIII/Monday_BrandrelationshipIII_Fetscherin.pdf",
      "doi": ""
    },
    {
      "text": "Michael Delucchi and Susan Pelowski. 2000. Liking or learning? The effect of instructor likeability and student perceptions of learning on overall ratings of teaching ability. Radical Pedagogy 2.",
      "doi": ""
    },
    {
      "text": "Jayson L. Dibble, Tilo Hartmann, and Sarah F. Rosaen. 2016. Parasocial Interaction and Parasocial Relationship: Conceptual Clarification and a Critical Assessment of Measures. Human Communication Research 42, 1: 21--44.",
      "doi": ""
    },
    {
      "text": "Derek Doran, Samir Yelne, Luisa Massari, Maria-Carla Calzarossa, LaTrelle Jackson, and Glen Moriarty. 2015. Stay Awhile and Listen: User interactions in a crowdsourced platform offering emotional support. Proceedings of the 2015 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining 2015 - ASONAM '15, ACM Press, 667-- 674.  ",
      "doi": "10.1145/2808797.2809311"
    },
    {
      "text": "Nicole B. Ellison, Jessica Vitak, Rebecca Gray, and Cliff Lampe. 2014. Cultivating social resources on social network sites: Facebook relationship maintenance behaviors and their role in social capital processes. Journal of Computer-Mediated Communication 19, 4: 855--870.  ",
      "doi": "10.1111/jcc4.12078"
    },
    {
      "text": "Marc Fetscherin. 2014. What type of relationship do we have with loved brands? Journal of Consumer Marketing 31, 6/7: 430--440.",
      "doi": ""
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, and Shaowen Bardzell. 2016. Revisiting Computer-Mediated Intimacy: Ingame marriage and dyadic gameplay in Audition. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, 4325--4336.  ",
      "doi": "10.1145/2858036.2858484"
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, Shaowen Bardzell, and Susan C. Herring. 2015. Simulating Marriage: Gender roles and emerging intimacy in an online game. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing CSCW '15, ACM Press, 1191--1200.  ",
      "doi": "10.1145/2675133.2675192"
    },
    {
      "text": "August E. Grant, K. Kendall Guthrie, and Sandra J. Ball-Rokeach. 1991. Television Shopping: A Media System Dependency Perspective. COMMUNICATION RESEARCH 18, 6: 773--798.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson and John C. Tang. 2017. What Makes Live Events Engaging on Facebook Live, Periscope, and Snapchat. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, 48--60.  ",
      "doi": "10.1145/3025453.3025642"
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on twitch: Fostering participatory communities of play within live mixed media. Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), ACM Press, 1315--1324.  ",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "Donald Horton and R Richard Wohl. 1956. Mass communication and para-social interactions: Observations on intimacy at a distance. Psychiatry 19: 215--229.",
      "doi": ""
    },
    {
      "text": "Jina Huh. 2015. Clinical Questions in Online Health Communities. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing - CSCW '15, ACM Press, 1488-- 1499.  ",
      "doi": "10.1145/2675133.2675259"
    },
    {
      "text": "Joshua Introne, Bryan Semaan, and Sean Goggins. 2016. A Sociotechnical Mechanism for Online Support Provision. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, 3559--3571.  ",
      "doi": "10.1145/2858036.2858582"
    },
    {
      "text": "Brandon Van Der Heide Joseph B. Walther, Caleb T. Carr, Scott Seung W. Choi, David C. DeAndrea, Jinsuk Kim, Stephanie Tom Tong. 2011. Interaction of interpersonal, peer, and media influence sources online: A research agenda for technology convergence. In A Networked Self: Identity, Community, and Culture on Social Network Sites, Zizi Papacharissi (ed.). Routledge, New York, NY, 17--38.",
      "doi": ""
    },
    {
      "text": "Mehdi Kaytoue, Arlei Silva, Loïc Cerf, Wagner Meira, and Chedy Raïssi. 2012. Watch me playing, i am a professional: A first study on video game live streaming. Proceedings of the 21st international conference companion on World Wide Web (WWW '12) Companion, ACM Press, 1181--1188.  ",
      "doi": "10.1145/2187980.2188259"
    },
    {
      "text": "Luke Kelly and Yue Wang. 2017. China's booming live streaming market has reached its zenith. Forbes. Retrieved from https://www.forbes.com/sites/ljkelly/2017/09/08/thebooming-chinese-live-streaming-market-has-reachedits-zenith/#6677212b2ab3",
      "doi": ""
    },
    {
      "text": "Johannes Knoll, Holger Schramm, Christiana Schallhorn, and Sabrina Wynistorf. 2015. Good guy vs. bad guy: The influence of parasocial interactions with media characters on brand placement effects. International Journal of Advertising 34, 5: 720--743.",
      "doi": ""
    },
    {
      "text": "Anne C. Krendl, Nicole S. Magoon, Jay G. Hull, and Todd F. Heatherton. 2011. Judging a book by its cover: The differential impact of attractiveness on predicting one's acceptance to high- or low-status social groups. Journal of Applied Social Psychology 41, 10: 2538-- 2550.",
      "doi": ""
    },
    {
      "text": "Cliff Lampe, Jessica Vitak, Rebecca Gray, and Nicole Ellison. 2012. Perceptions of facebook's value as an information source. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, ACM Press, 3195--3204.  ",
      "doi": "10.1145/2207676.2208739"
    },
    {
      "text": "Pascal Lessel, Alexander Vielhauer, and Antonio Krüger. 2017. Expanding Video Game Live-Streams with Enhanced Communication Channels: A case study. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), ACM Press, 1571--1576.  ",
      "doi": "10.1145/3025453.3025708"
    },
    {
      "text": "Danielle Lottridge, Frank Bentley, Matt Wheeler, et al. 2017. Third-wave livestreaming: Teens' long form selfie. Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '17, ACM Press, 1--12.  ",
      "doi": "10.1145/3098279.3098540"
    },
    {
      "text": "James C. McCroskey and Thomas A. McCain. 1974. The measurement of interpersonal attraction. Speech Monographs 41, 3: 261--266.",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi and Justin Harris. 2010. Strangers and friends: Collaborative play in World of Warcraft. International Handbook of Internet Research: 395-- 410.",
      "doi": ""
    },
    {
      "text": "Kristine L. Nowak and Frank Biocca. 2003. The Effect of the Agency and Anthropomorphism on Users' Sense of Telepresence, Copresence, and Social Presence in Virtual Environments. Presence: Teleoperators and Virtual Environments 12, 5: 481--494.  ",
      "doi": "10.1162/105474603322761289"
    },
    {
      "text": "Gordon L. Patzer. 1983. Source credibility as a function of communicator physical attractiveness. Journal of Business Research 11, 2: 229--241.",
      "doi": ""
    },
    {
      "text": "Anthony J. Pellicone and June Ahn. 2017. The Game of Performing Play: Understanding streaming as cultural production. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, 4863--4874.  ",
      "doi": "10.1145/3025453.3025854"
    },
    {
      "text": "Elizabeth M Perse. 1990. Media involvement and local news effects. Journal of Broadcasting&Electronic Media 34, 1: 17--36.",
      "doi": ""
    },
    {
      "text": "Stephen Reysen. 2005. Construction of a new scale: The Reysen likeability scale. Social Behavior and Personality 33, 2: 201--208. Retrieved from http://www.sbpjournal.com/index.php/sbp/article/view/1391",
      "doi": ""
    },
    {
      "text": "Vicki Ritts, Miles L. Patterson, and Mark E. Tubbs. 1992. Expectations, Impressions, and Judgments of Physically Attractive Students: A Review. Review of Educational Research 62, 4: 413--426.",
      "doi": ""
    },
    {
      "text": "Alan M. Rubin and Elizabeth M. Perse. 1987. Audience Activity and Television News Gratifications. Communication Research 14, 1: 58--84.",
      "doi": ""
    },
    {
      "text": "Alan M. Rubin, Elizabeth M. Perse, and Robert A. Powell. 1985. Loneliness, parasocial interaction, and local television news viewing. Human Communication Research 12, 2: 155--180.",
      "doi": ""
    },
    {
      "text": "Dan Russell, Letitia Anne Peplau, and Mary Lund Ferguson. 1978. Developing a Measure of Loneliness. Journal of Personality Assessment 42, 3: 290--294.",
      "doi": ""
    },
    {
      "text": "Rainforest Scully-Blaker, Jason Begy, Mia Consalvo, and Sarah Christina Ganzon. 2017. Playing along and playing for on Twitch: Livestreaming from tandem play to performance. Proceedings of the 50th Hawaii International Conference on System Sciences: 2026-- 2035. Retrieved from http://hdl.handle.net/10125/41400",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Robert Kraut, and Laura Dabbish. 2017. Shaping Pro and Anti-Social Behavior on Twitch Through Moderation and Example-Setting. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17, ACM Press, 111--125.  ",
      "doi": "10.1145/2998181.2998277"
    },
    {
      "text": "John Short, Ederyn Williams, and Bruce Christie. 1976. The social psychology of telecommunications. John Wiley&Sons, London, UK.",
      "doi": ""
    },
    {
      "text": "Charles Steinfield, Joan M. DiMicco, Nicole B. Ellison, and Cliff Lampe. 2009. Bowling online: social networking and social capital within the organization. Proceedings of the fourth international conference on Communities and technologies, ACM, 245--254.  ",
      "doi": "10.1145/1556460.1556496"
    },
    {
      "text": "Michael J. Tews, Kathryn Stafford, and Jinfei Zhu. 2009. Beauty revisited: The impact of attractiveness, ability, and personality in the assessment of employment suitability. International Journal of Selection and Assessment 17, 1: 92--100.",
      "doi": ""
    },
    {
      "text": "Twitch.tv. About Twitch. Retrieved September 16, 2017 from https://www.twitch.tv/p/about/",
      "doi": ""
    },
    {
      "text": "Robert Weiss. 1974. The Provisions of Social Relationships. Doing Unto Others, 17--26.",
      "doi": ""
    },
    {
      "text": "Chris Weller and Rachel Butt. 2016. Millions of lonely Chinese bachelors are turning to live-streams for human contact. Business Insider. Retrieved from http://www.businessinsider.com/chinese-bachelorslivestreams-2016--7",
      "doi": ""
    },
    {
      "text": "Dmitri Williams, Nicolas Ducheneaut, Li Xiong, Yuanyuan Zhang, Nick Yee, and Eric Nickell. 2006. From tree house to barracks: The social life of guilds in World of Warcraft. Games&Culture 1: 338--361.",
      "doi": ""
    },
    {
      "text": "D Yvette Wohn and Eun-Kyung Na. 2011. Tweeting about TV: Sharing television viewing experiences via social media message streams. First Monday 16, 3: 1-- 13. Retrieved from http://firstmonday.org/htbin/cgiwrap/bin/ojs/index.php/ fm/article/view/3368/2779",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn. 2016. From Faux-Social to Pro-Social: The Mediating Role of Copresence in Developing Expectations of Social Support in a Game. Presence: Teleoperators and Virtual Environments 25, 1: 61--74.  ",
      "doi": "10.1162/PRES_a_00246"
    },
    {
      "text": "Donghee Yvette Wohn, Caleb T. Carr, and Rebecca A. Hayes. 2016. How Affective Is a \"Like\"?: The Effect of Paralinguistic Digital Affordances on Perceived Social Support. Cyberpsychology, Behavior, and Social Networking 19, 9: 562--566.",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn, Yu-hao Lee, Jieun Sung, and Torger Bjornrud. 2010. Building common ground and reciprocity through social network games. Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems CHI EA '10, ACM Press, 4423--28.  ",
      "doi": "10.1145/1753846.1754164"
    },
    {
      "text": "Ziming Wu and Xiaojuan Ma. 2017. Money As a Social Currency to Manage Group Dynamics: Red Packet Gifting in Chinese Online Communities. Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems, 2240--2247.  ",
      "doi": "10.1145/3027063.3053153"
    },
    {
      "text": "Yingzhi Yang. 2017. In China, live-streaming apps soothe lonely souls and create fortunes. LA Times. Retrieved from http://www.latimes.com/world/asia/lafg-china-live-streaming-20161128-story.html",
      "doi": ""
    },
    {
      "text": "Xinyi Zhang, Shiliang Tang, Yun Zhao, Gang Wang, Haitao Zheng, and Ben Y. Zhao. 2017. Cold hard ecash: Friends and vendors in the Venmo digital payment system. Proceedings of ICWSM, 1--10.",
      "doi": ""
    },
    {
      "text": "Zhenhui Zhu, Zhi Yang, and Yafei Dai. 2017. Understanding the Gift-Sending Interaction on LiveStreaming Video Websites. Social Computing and Social Media: Human Behavior LNCS, 1028: 274-- 285.",
      "doi": ""
    }
  ]
}