{
  "doi": "10.1145/3173574.3173654",
  "title": "Gamification for Self-Tracking: From World of Warcraft to the Design of Personal Informatics Systems",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2018,
  "badges": [],
  "abstract": "World of Warcraft (WoW) may be a source of inspiration to enrich the Personal Informatics systems user's experience and, at the same time, improve gamification design. Through the findings of a four-year reflexive ethnography in WoW, I outline how its game design elements support players in making sense of their own data, emphasizing how \"game numbers\" are turned into meanings. On the basis of the study results, I propose a series of design considerations to be used in the design of self-tracking systems, which recommend to embody data into digital entities, provide different analytical tools depending on the users' expertise through a flexible model, and foster the formation of \"communities of practice\" in order to support learning processes.",
  "tags": [
    "self-tracking",
    "world of warcraft",
    "gamification",
    "personal informatics",
    "quantified self"
  ],
  "authors": [
    {
      "name": "Amon Rapp",
      "institution": "University of Torino, Torino, Italy",
      "img": "/do/10.1145/contrib-81384596893/rel-imgonly/81384596893.jpg",
      "acmid": "81384596893",
      "orcid": "0000-0003-3855-9961"
    }
  ],
  "references": [
    {
      "text": "Bianca Beersma, John H. Hollenbeck, Stephen E. Humphrey, Henry Moon, Donald E. Conlon, and Daniel R. Ilgen. 2003. Cooperation, competition, and team performance: Towards a contingency approach. Academy of Management Journal, 46(5): 572--590.",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Trans. Comput.-Hum. Interact., 20, 5, Article 30.  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Blizzard Entertainment. 2004. World of Warcraft. Game {Microsoft Windows, macOs}. (23 November 2004). Blizzard Entertainment, Irvine, California. Played September 2016.",
      "doi": ""
    },
    {
      "text": "Blizzard Entertainment. 1998. StarCraft. Game {Microsoft Windows, macOs}. (31 March 1998). Blizzard Entertainment, Irvine, California.",
      "doi": ""
    },
    {
      "text": "Tom Boellstorff. 2008. Coming of age in second life: An anthropologist explores the virtual human. Princeton University Press, Princeton, NJ. ",
      "doi": "10.5555/1435408"
    },
    {
      "text": "Glenn A. Bowen. 2008.. Naturalistic inquiry and the saturation concept: A research note. Qualitative Research, 8(1): 137--152.",
      "doi": ""
    },
    {
      "text": "Andrea Braithwaite. 2015. WoWing Alone: The Evolution of \"Multiplayer\" in World of Warcraft. Games and Culture.",
      "doi": ""
    },
    {
      "text": "Joseph A. Cafazzo, Mark Casselman, Nathaniel Hamming, Debra K. Katzman, and Mark R. Palmert. 2012. Design of an mHealth app for the selfmanagement of adolescent type 1 diabetes: a pilot study. Journal of medical Internet research, 14(3) :e70.",
      "doi": ""
    },
    {
      "text": "Mario Cardano. 2009. Ethnography And Reflexivity. Notes on the Construction of Objectivity. Ethnographic Research, NetPaper, 1/2009",
      "doi": ""
    },
    {
      "text": "Mark G. Chen. 2012. Leet noobs: The life and death of an expert player group in World of Warcraft. Peter Lang, New York, NY.",
      "doi": ""
    },
    {
      "text": "Yu Chen and Pearl Pu. 2014. HealthyTogether: exploring social incentives for mobile fitness applications. In Proceedings of the Second International Symposium of Chinese CHI (Chinese CHI '14), 25--34.  ",
      "doi": "10.1145/2592235.2592240"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Trina Choontanom and Bonnie Nardi. 2012. Theorycrafting: The Art and Science of Using Numbers to Interpret the World. In Games, learning, and society: Learning and meaning in the digital age, Constance Steinkuehler, Kurt Squire, and Sasha Barab (eds.). University Press, Cambridge, UK, 185--209.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, et al. 2008. Activity sensing in the wild: a field trial of ubifit garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Hilde G. Corneliussen and Jill Walker Rettberg (eds). 2011. Digital Culture, Play and Identity: A World of Warcraft. Reader. The MIT Press, Boston, MA. ",
      "doi": "10.5555/1386572"
    },
    {
      "text": "Council on Science and Public Health (2007). Emotional and behavioral effects, including addictive potential, of video games. Retrieved August 22, 2017 from http://psychcentral.com/blog/images/csaph12a07.pdf",
      "doi": ""
    },
    {
      "text": "Kate Crawford, Jessa Lingel, and Tero Karppi. 2015. Our Metrics, Ourselves: A Hundred Years of SelfTracking from the Weight Scale to the Wrist Wearable Device. European Journal of Cultural Studies, 18(4--5): 479--496.",
      "doi": ""
    },
    {
      "text": "Nicole Crenshaw, Jaclyn LaMorte, and Bonnie Nardi. 2017. \"Something We Loved That Was Taken Away\": Community and Neoliberalism in World of Warcraft. In Proceedings of the 50th Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Thomas Debeauvais, Bonnie Nardi, Diane J. Schiano, Nicolas Ducheneaut, and Nicholas Yee. 2011. If you build it they might stay: retention mechanisms in World of Warcraft. In Proceedings of the 6th International Conference on Foundations of Digital Games (FDG '11), 180--187.  ",
      "doi": "10.1145/2159365.2159390"
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining \"gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, New York, 9--15.  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J. Moore. 2007. The life and death of online gaming communities: a look at guilds in world of warcraft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 839848.  ",
      "doi": "10.1145/1240624.1240750"
    },
    {
      "text": "Paul Dourish. 2006. Implications for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742.  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Daniel Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming data complexity in lifelogs: exploring visual cuts of personal informatics data. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14), 667--676.  ",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, and Sean A. Munson. 2015. From \"nobody cares\" to \"way to go!\": A Design Framework for Social Sharing in Personal Informatics. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1622--1636.  ",
      "doi": "10.1145/2675133.2675135"
    },
    {
      "text": "Lina Eklund, and Magnus Johansson. 2013. Played and designed sociality in a massive multiplayer online game. Eludamos, 7(1): 35--54.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David S. Kirk, and Abigail C. Durrant. 2016. A Quantified Past: Toward Design for Remembering With Personal Informatics. Hum.Comput. Interact. 31, 6 (November 2016): 518--557.  ",
      "doi": "10.1080/07370024.2015.1093422"
    },
    {
      "text": "René Glas. 2013. Battlefields of negotiation: Control, agency, and ownership in World of Warcraft. Amsterdam University Press, Amsterdam, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Giampietro Gobo. 2008. Re-Conceptualizing Generalization. Old Issues in a New Frame. In The SAGE Handbook of Social Research Methods Pertti Alasuutari, Julia Brannen, Leonard Bickman (eds.). Sage, London, UK, 193--213.",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How do we engage with activity trackers?: a longitudinal study of Habito. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 1305--1316.  ",
      "doi": "10.1145/2750858.2804290"
    },
    {
      "text": "Thomas Fritz, Elaine M. Huang, Gail C. Murphy, and Thomas Zimmermann. 2014. Persuasive technology in the real world: a study of long-term use of activity sensing devices for fitness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 487--496.  ",
      "doi": "10.1145/2556288.2557383"
    },
    {
      "text": "Cathal Gurrin, Alan F. Smeaton, and Aiden R. Doherty. 2014. Lifelogging: Personal big data. Foundations and Trends in Information Retrieval, 8(1): 1--125.  ",
      "doi": "10.1561/1500000033"
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does gamification work? A literature review of empirical studies on gamification. In Proceedings of the Hawaii International Conference on System Sciences (HICSS '14), 3025--3034.  ",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Martin Heidegger. 1982. The basic problems of phenomenology. Indiana University Press, Bloomington, IN.",
      "doi": ""
    },
    {
      "text": "Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich, and Matthew P. Buman. 2013. Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3307--3316.  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Hine, C. (2000). Virtual ethnography. Thousand Oaks, California: Sage Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Jeong-Ki Hong, Bon-Chang Koo, So-Ryang Ban, JunDong Cho, and Andrea Bianchi. 2015. BeuPo: a digital plant that you can raise and customize with your current posture. In Adjunct Proceedings of UbiComp/ISWC'15, 1015--1020.  ",
      "doi": "10.1145/2800835.2800953"
    },
    {
      "text": "Leah Hunter. 2014. Are wearables over? Fast Company Inc. (April 2014). Retrieved March 1, 2017 from http://www.fastcompany.com/3028879/mostinnovative-companies/are-wearables-over.",
      "doi": ""
    },
    {
      "text": "Edmund Husserl. 1962. Phenomenological psychology: Lectures from the summer semester, 1925. Martinus Nijhoff, The Hague, The Netherlands:.",
      "doi": ""
    },
    {
      "text": "IDTechEx. 2014. Wearable technology 2014--2024: Technologies, markets, forecasts e-textiles, wearable electronics, medical diagnostics, smart glasses, smart wristbands and more. (July 2014). Retrieved March 1, 2017 from http://www.idtechex.com/research/reports/ wearable-technology-2014--2024-technologies",
      "doi": ""
    },
    {
      "text": "markets-forecasts-000379.asp.",
      "doi": ""
    },
    {
      "text": "41. Daniel Johnson, Sebastian Deterding, Kerri-Ann Kuhn, Aleksandra Staneva, Stoyan Stoyanov, and Leanne Hides. 2016. Gamification for health and wellbeing: A systematic review of the literature. Internet Interventions, 6: 89--106.",
      "doi": ""
    },
    {
      "text": "42. Predrag Klasnja and Wanda Pratt. 2012. Healthcare in the pocket: Mapping the space of mobile-phone health interventions. Journal of Biomedical Informatics 45, 1 (2012): 184--198.  ",
      "doi": "10.1016/j.jbi.2011.08.017"
    },
    {
      "text": "43. Yong Ming Kow and Timothy Young. 2013. Media technologies and learning in the starcraft esport community. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13), 387--398.  ",
      "doi": "10.1145/2441776.2441821"
    },
    {
      "text": "44. Dan Ledger, and Daniel McCaffrey. 2014. Inside wearables: How the science of human behavior change offers the secret to long-term engagement. Endeavour Partners LLC 93, (2014), 36--",
      "doi": ""
    },
    {
      "text": "45. Yamini Karanam, Leslie Filko, Lindsay Kaser, Hanan Alotaibi, Elham Makhsoom, and Stephen Voida. 2014. Motivational affordances and personality types in personal informatics. In Adjunct Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 79--82.  ",
      "doi": "10.1145/2638728.2638800"
    },
    {
      "text": "46. Ravi Karkar, James Fogarty, Julie A. Kientz, Sean A. Munson, Roger Vilardaga, and Jasmine Zia. 2015. Opportunities and challenges for self-experimentation in self-tracking. In Adjunct Proceedings of UbiComp/ISWC'15, 991--996.  ",
      "doi": "10.1145/2800835.2800949"
    },
    {
      "text": "47. Amanda Lazar, Christian Koehler, Joshua Tanenbaum, and David H. Nguyen. 2015. Why we use and abandon smart devices. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 635--646  ",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "48. Jean Lave. 1991. Situating learning in communities of practice. In Perspectives on socially Shared Cognition, Lauren B. Resnick, Stephanie D. Teasley, John M. Levine (eds.). American Psychological Association, Washington, D.C., 63--84.",
      "doi": ""
    },
    {
      "text": "49. Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "50. Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "51. Ian Li, Anind K. Dey, and Jodi Forlizzi. 2012. Using context to reveal factors that affect physical activity. ACM Trans. Comput.-Hum. Interact., 19, 1, Article 7 (May 2012), 21 pages.  ",
      "doi": "10.1145/2147783.2147790"
    },
    {
      "text": "52. Ian J. Livingston, Carl Gutwin, Regan L. Mandryk, and Max Birk. 2014. How players value their characters in world of warcraft. In Proceedings of the ACM conference on Computer supported cooperative work & social computing (CSCW '14), 1333--1343  ",
      "doi": "10.1145/2531602.2531661"
    },
    {
      "text": "53. Teena Maddox 2014. Wearables have a dirty little secret: 50% of users lose interest. Tech Republic Inc. (February 2014). Retrieved March 1, 2017 from http://www.techrepublic.com/article/wearables-have-adirty-little-secret-most-people-lose-interest/.",
      "doi": ""
    },
    {
      "text": "54. Alessandro Marcengo and Amon Rapp. 2014. Visualization of Human Behavior data: the Quantified Self. In Innovative Approaches of Data Visualization and Visual Analytics, Mao Lin Huang, Weidong Huang (eds.). IGI Global, Hershey, PA, 236--265.",
      "doi": ""
    },
    {
      "text": "55. Mark Matthews and Gavin Doherty. 2011. In the mood: engaging teenagers in psychotherapy using mobile phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2947--29  ",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "56. Davide Michael and Sande Chen. 2005. Serious Games: Games That Educate, Train, and Inform. Thomson Course Technology, Boston, MA. ",
      "doi": "10.5555/1051239"
    },
    {
      "text": "57. Markus Montola, Timo Nummenmaa, Andrés Lucero, Marion Boberg, and Hannu Korhonen. 2009. Applying Game Achievement Systems to Enhance User Experience in a Photo Sharing Service. In Proceedings of the 13th International MindTrek Conference (Mindtrek '09), 94--97.  ",
      "doi": "10.1145/1621841.1621859"
    },
    {
      "text": "58. Benedikt Morschheuser, Verónica Rivera-Pelayo, Athanasios Mazarakis, and Valentin Zacharias. 2014. Interaction and reflection with quantified self and gamification: an experimental study. Journal of Literacy and Technology, 15(2).",
      "doi": ""
    },
    {
      "text": "59. Benedikt Morschheuser, Juho Hamari, Jonna Koivisto, and Alexander Maedche. 2017. Gamified Crowdsourcing: Conceptualization, literature review, and future Agenda. International Journal of HumanComputer Studies, 106: 26--43.",
      "doi": ""
    },
    {
      "text": "60. Elizabeth Murnane, Mark Matthews, Geri Gay, and Dan Cosley. 2016. Playing with your data: towards personal informatics driven games. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16), 565--569.  ",
      "doi": "10.1145/2968219.2968322"
    },
    {
      "text": "61. Ilya Musabirov, Denis Bulygin, Paul Okopny, and Alexander Sirotkin. 2017. Deconstructing Cosmetic Virtual Goods Experiences in Dota 2. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 2054--2058.  ",
      "doi": "10.1145/3025453.3025893"
    },
    {
      "text": "62. Dawn Nafus, Pete Denman, Lenitra Durham, Omar Florez, Lama Nachman, Saurav Sahay, Evan Savage, Sangita Sharma, Devon Strawn, and Rita H. Wouhaybi. 2016. As Simple as Possible but No Simpler: Creating Flexibility in Personal Informatics. In CHI Extended Abstracts '16, 1445--1452.  ",
      "doi": "10.1145/2851581.2892541"
    },
    {
      "text": "63. Bonnie Nardi. 2010. My Life as a Night Elf Priest: An Anthropological Account of World of Warcraft. University of Michigan Press, Ann Arbor, MI.",
      "doi": ""
    },
    {
      "text": "64. Bonnie Nardi and Justin Harris. 2006. Strangers and friends: collaborative play in world of warcraft. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06), 149--158.  ",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "65. Bonnie A. Nardi, Stella Ly, and Justin Harris. 2007. Learning conversations in World of Warcraft. In Proceedings of the Hawaii International Conference on System Sciences (HICSS '07), 79a.  ",
      "doi": "10.1109/HICSS.2007.321"
    },
    {
      "text": "66. Rosemery O. Nelson, and Steven C. Hayes.1981. Theoretical explanations for reactivity in selfmonitoring. Behav. Modif. 5(1): 3--14.",
      "doi": ""
    },
    {
      "text": "67. Cristopher A. Paul. 2011. Optimizing Play: How Theorycraft Changes Gameplay and Design. Game Studies. Game studies, 11(2).",
      "doi": ""
    },
    {
      "text": "68. Valentina Rao. 2013. Challenges of Implementing Gamification for Behavior Change: Lessons Learned from the Design of Blues Buddies. Presented at CHI 2013 Workshops. Retrieved March 1, 2017 from http:// gamification-research.org/wpcontent/uploads/2013/03/Rao.pdf.",
      "doi": ""
    },
    {
      "text": "69. Amon Rapp. 2015. A Qualitative Investigation of Gamification: Motivational Factors in Online Gamified Services and Applications. International Journal of Technology and Human Interaction 11(1), 67--82.  ",
      "doi": "10.4018/ijthi.2015010105"
    },
    {
      "text": "70. Amon Rapp. 2017. From games to gamification: A classification of rewards in World of Warcraft for the design of gamified systems. Simulation & Gaming, 48(3), 381--401.  ",
      "doi": "10.1177/1046878117697147"
    },
    {
      "text": "71. Amon Rapp. 2017. Designing interactive systems through a game lens: An ethnographic approach. Computers in human behavior, 71, 455--468.  ",
      "doi": "10.1016/j.chb.2015.02.048"
    },
    {
      "text": "72. Amon Rapp and Federica Cena. 2014. Self-monitoring and Technology: Challenges and Open Issues in Personal Informatics. (2014). In Proceedings of the HCI International Conference. Design for All and Accessibility Practice Lecture Notes in Computer Science, vol. 8516, 613--622. Springer.",
      "doi": ""
    },
    {
      "text": "73. Amon Rapp and Federica Cena. 2016. Personal Informatics for everyday life: How users without prior self-tracking experience engage with personal data. International Journal of Human-Computer Studies, 94, 1--17.  ",
      "doi": "10.1016/j.ijhcs.2016.05.006"
    },
    {
      "text": "74. Amon Rapp, Federica Cena, Cristina Gena, Alessandro Marcengo and Luca Console. 2016. Using game mechanics for field evaluation of prototype social applications: a novel methodology. Behaviour & Information Technology, 35(3), 184--195.  ",
      "doi": "10.1080/0144929X.2015.1046931"
    },
    {
      "text": "75. Amon Rapp, Federica Cena, Judy Kay, Bob Kummerfeld, Frank Hopfgartner, Till Plumbaum, Jakob Eg Larsen, Daniel A. Epstein, and Rúben Gouveia. 2016. New frontiers of quantified self 2: going beyond numbers. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16), 506509.  ",
      "doi": "10.1145/2968219.2968331"
    },
    {
      "text": "76. Amon Rapp. 2017. Drawing Inspiration from World of Warcraft: Gamification Design Elements for Behavior Change Technologies. Interacting with computers, 29(5), 648--678.",
      "doi": ""
    },
    {
      "text": "77. Amon Rapp and Maurizio Tirassa. 2017. Know Thyself: A theory of the self for Personal Informatics. Human-Computer Interaction, 32(5--6), 335--380.  ",
      "doi": "10.1080/07370024.2017.1285704"
    },
    {
      "text": "78. Margaret Robertson. 2010. Can't play, won't play. Retrieved August 22, 2017 from http://kotaku.com/5686393/cantplay- wont-play/",
      "doi": ""
    },
    {
      "text": "79. Scott Rigby and Richard Ryan. 2011. Glued to Games: How Video Games Draw Us In and Hold Us Spellbound. Praeger, Santa Barbara, CA.",
      "doi": ""
    },
    {
      "text": "80. John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "81. John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2015. Pass the Ball: Enforced Turn-Taking in Activity Tracking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2417--2426.  ",
      "doi": "10.1145/2702123.2702577"
    },
    {
      "text": "82. Jennifer A. Rode. 2011. Reflexivity in digital anthropology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 123--132.  ",
      "doi": "10.1145/1978942.1978961"
    },
    {
      "text": "83. Minna Ruckenstein and Mika Pantzar. 2017. Beyond the Quantified Self: Thematic exploration of a dataistic paradigm. new media & society, 19(3), 401--418.",
      "doi": ""
    },
    {
      "text": "84. Corina Sas and Steve Whittaker. 2013. Design for forgetting: disposing of digital possessions after a breakup. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1823--1832.  ",
      "doi": "10.1145/2470654.2466241"
    },
    {
      "text": "85. Sakamoto, M., Nakajima, T., & Alexandrova, T. (2012). Value-based design for gamifying daily activities. In Proceedings of the International Conference on Entertainment Computing, 421--424.  ",
      "doi": "10.1007/978-3-642-33542-6_43"
    },
    {
      "text": "86. Natasha D. Schüll. 2014. Addiction by design: Machine gambling in Las Vegas. Princeton University Press, Princeton, NJ. ",
      "doi": "10.5555/2621987"
    },
    {
      "text": "87. Natasha D. Schüll. 2016. Data for life: Wearable technology and the design of self-care. BioSocieties, 11(3), 317--333.",
      "doi": ""
    },
    {
      "text": "88. Katie Seaborn and Deborah I. Fels. 2015. Gamification in theory and action. International Journal of HumanComputer Studies, 74, C (February 2015), 14--31.  ",
      "doi": "10.1016/j.ijhcs.2014.09.006"
    },
    {
      "text": "89. Jeffrey G. Snodgrass. 2016. A guild culture of' casual raiding' enhances its members' online gaming experiences: A cognitive anthropological and ethnographic approach to World of Warcraft. New Media & society, 19(12), 1927--1944.",
      "doi": ""
    },
    {
      "text": "90. Jeffrey G. Snodgrass, Michael G. Lacy, Francois Dengah, and Jesse Fagan. 2011. Enhancing one life rather than living two: Playing MMOs with offline friends. Computers in human behavior, 27(3), 12111222.  ",
      "doi": "10.1016/j.chb.2011.01.001"
    },
    {
      "text": "91. Constance Steinkuehler, Kurt Squire, and Sasha Barab (eds.). 2012. Games, learning, and society: Learning and meaning in the digital age. University Press, Cambridge, UK. ",
      "doi": "10.5555/2385793"
    },
    {
      "text": "92. Anselm L. Strauss and Juliet M. Corbin. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative Sociology, 13(1), 3--21.",
      "doi": ""
    },
    {
      "text": "93. T.L. Taylor. 2003. Power gamers just want to have fun?: Instrumental play in a MMOG. In Proceedings of the 1st Digra conference: Level Up. The University of Utrecht, The Netherlands.",
      "doi": ""
    },
    {
      "text": "94. T.L. Taylor. 2006. Play Between Worlds: Exploring Online Game Culture. MIT Press, Cambridge, MA. ",
      "doi": "10.5555/1137764"
    },
    {
      "text": "95. Barbara Tedlock. 1991. From participant observation to the observation of participation: The emergence of narrative ethnography. Journal of Anthropological Research, 47(1), 69--94.",
      "doi": ""
    },
    {
      "text": "96. John Van Maanen. 2011. Tales from the field. On writing ethnography (2nd. ed.). The University of Chicago Press Chicago, IL.",
      "doi": ""
    },
    {
      "text": "97. Asimina Vasalou, Adam N. Joinson, and Jeremy Pitt. 2007. Constructing my online self: avatars that increase self-focused attention. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 445--448.  ",
      "doi": "10.1145/1240624.1240696"
    },
    {
      "text": "98. Kevin Werbach and Dan Hunter. 2012. For the win: How game thinking can revolutionize your business. Wharton Digital Press, Philadelphia, PA.",
      "doi": ""
    },
    {
      "text": "99. Zachary O. Toups, Nicole K. Crenshaw, Rina R. Wehbe, Gustavo F. Tondello, and Lennart E. Nacke. 2016. \"The Collecting Itself Feels Good\": Towards Collection Interfaces for Digital Game Objects. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16), 276--290.  ",
      "doi": "10.1145/2967934.2968088"
    },
    {
      "text": "100. Zhao Zhao, S. Ali Etemad, and Ali Arya. 2017. Gamification of Exercise and Fitness using Wearable Activity Trackers. Proceedings of the 10th International Symposium on Computer Science in Sports (ISCSS), 233--240.",
      "doi": ""
    },
    {
      "text": "101. Oren Zuckerman and Ayelet Gal-Oz. 2014. Deconstructing gamification: evaluating the effectiveness of continuous measurement, virtual rewards, and social comparison for promoting physical activity. Personal Ubiquitous Comput., 18(7), 17051719.  ",
      "doi": "10.1007/s00779-014-0783-2"
    }
  ]
}