{
  "doi": "10.1145/3173574.3173832",
  "title": "Tactile Information Transmission by 2D Stationary Phantom Sensations",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "A phantom sensation refers to an illusory tactile sensation perceived midway between multiple distant stimulations on the skin. Phantom sensations have been used intensively in tactile interfaces owing to their simplicity and effectiveness. Despite that, the perceptual performance of phantom sensations is not completely understood, especially for 2D cases. This work is concerned with 2D stationary phantom sensations and their fundamental value as a means for information display. In User Study 1, we quantified the information transmission capacity using an absolute identification task of 2D phantom sensations. In User Study 2, we probed the distributions of the actual perceived positions of 2D phantom sensations. The investigations included both types of phantom sensations-within and out of the body. Our results provide general guidelines as to leveraging 2D phantom sensations in the design of spatial tactile display.",
  "authors": [
    {
      "name": "Gunhyuk Park",
      "institution": "Pohang University of Science & Technology, Pohang, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488655407",
      "orcid": "0000-0003-2677-5907"
    },
    {
      "name": "Seungmoon Choi",
      "institution": "Pohang University of Science & Technology, Pohang, Rebublic of Korea",
      "img": "/do/10.1145/contrib-81100480604/rel-imgonly/bio_seungmoonchoi.jpg",
      "acmid": "81100480604",
      "orcid": "0000-0002-5889-1083"
    }
  ],
  "references": [
    {
      "text": "David S. Alles. 1970. Information Transmission by Phantom Sensations. IEEE Transactions on Man-Machine Systems MMS-11, 1 (1970), 85--91.",
      "doi": ""
    },
    {
      "text": "A. Barghout, J. Cha, A. El Saddik, J. Kammerl, and E. Steinbach. 2009. Spatial Resolution of Vibrotactile Perception on the Human Forearm When Exploiting Funneling Illusion. In Proceedings of the IEEE International Workshop on Haptic Audio Visual Environments and Games (HAVE). 19--23.",
      "doi": ""
    },
    {
      "text": "Stephen Brewster and Lorna M. Brown. 2004. Tactons: Structured Tactile Messages for Non-Visual Information Display. In Proceedings of the Australasian User Interface Conference. 15--23. ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "Lorna M. Brown, Stephen A. Brewster, and Helen C. Purchase. 2006. Multidimensional Tactons for Non-Visual Information Presentation in Mobile Device. In Proceedings of the International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI). ACM, 231--238.  ",
      "doi": "10.1145/1152215.1152265"
    },
    {
      "text": "Jongeun Cha, Lara Rahal, and A. E. Saddick. 2008. A Pilot Study on Simulating Continuous Sensation with Two Vibrating Motors. In Proceedings of the IEEE International Workshop on Haptic Audio Visual Environments and their Applications (HAVE). 143--147.",
      "doi": ""
    },
    {
      "text": "Seungmoon Choi and Katherine J. Kuchenbecker. 2013. Vibrotactile Display: Perception, Technology, and Applications. Proc. IEEE 101, 9 (2013), 2093--2104.",
      "doi": ""
    },
    {
      "text": "Alberto Gallace, Hong Z. Tan, and Charles Spence. 2007. The Body Surface as a Communication System: The State of the Art after 50 Years. Presence 16, 6 (2007), 655--676.  ",
      "doi": "10.1162/pres.16.6.655"
    },
    {
      "text": "E. Bruce Goldstein. 2002. Sensation and Perception (6th ed.). Wadsworth-Thomson Learning, Pacific Grove, CA, USA.",
      "doi": ""
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011a. Control Space of Apparent Haptic Motion. In Proceedings of the IEEE World Haptics Conference (WHC). 457--462.",
      "doi": ""
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011b. Tactile Brush: Drawing on Skin with a Tactile Grid Display. In Proceedings of the ACM SIGCHI Annual Conference on Human Factors in Computing Systems (CHI). 2019--2028.  ",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Ali Israr, Siyan Zhao, Kaitlyn Schwalje, Roberta Klatzky, and Jill Lehman. 2014. Feel Effects: Enriching Storytelling with Haptic Feedback. ACM Transactions on Applied Perception 11, 3 (2014), 11:1--11:17.  ",
      "doi": "10.1145/2641570"
    },
    {
      "text": "Lynette A. Jones and Susan J. Lederman. 2006. Human Hand Function. Oxford University Press, Inc., New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Jeonggoo Kang, Junghwan Kook, Kwangsu Cho, Semyung Wang, and Jeha Ryu. 2012a. Effects of Amplitude Modulation on Vibrotactile Flow Displays on Piezo-actuated Thin Touch Screen. International Journal of Control, Automation, and Systems 10, 3 (2012), 582--588.",
      "doi": ""
    },
    {
      "text": "Jeonggoo Kang, Jongsuh Lee, Heewon Kim, Kwangsu Cho, Semyung Wang, and Jeha Ryu. 2012b. Smooth Vibrotactile Flow Generation Using Two Piezoelectric Actuators. IEEE Transactions on Haptics 5, 1 (2012), 21--32.  ",
      "doi": "10.1109/TOH.2012.1"
    },
    {
      "text": "Jaeha Kim, Yonghwan Oh, and Jaeyoung Park. 2017b. Adaptive Vibrotactile Flow Rendering of 2.5D Surface Features on Touch Screen with Multiple Fingertip Interfaces. In Proceedings of the IEEE World Haptics Conference (WHC). 316--321.",
      "doi": ""
    },
    {
      "text": "Myongchan Kim, Sungkil Lee, and Seungmoon Choi. 2014. Saliency-Driven Real-Time Video-to-Tactile Translation. IEEE Transactions on Haptics 7, 3 (2014), 394--404.",
      "doi": ""
    },
    {
      "text": "Sang-Youn Kim and Jeong Cheol Kim. 2012. Vibrotactile Rendering for a Traveling Vibrotactile Wave Based on a Haptic Processor. IEEE Transactions on Haptics 5, 1 (2012), 14--20.  ",
      "doi": "10.1109/TOH.2011.72"
    },
    {
      "text": "Sang-Youn Kim, Jae-Oh Kim, and Kyu Yong Kim. 2009. Traveling Vibrotactile Wave - A New Vibrotactile Rendering Method for Mobile Devices. IEEE Transactions on Consumer Electronics 55, 3 (2009), 1032--1038.  ",
      "doi": "10.1109/TCE.2009.5277952"
    },
    {
      "text": "Youngsun Kim, Jaedong Lee, and Gerard J. Kim. 2015a. Designing of 2D Illusory Tactile Feedback for Hand-Held Tablets. Lecture Notes in Computer Science (INTERACT) LNCS 9299 (2015), 10--17.",
      "doi": "10.1007/978-3-319-22723-8_2"
    },
    {
      "text": "Youngsun Kim, Jaedong Lee, and Gerard J. Kim. 2015b. Extending \"Out of the Body\" Tactile Phantom Sensations to 2D and Applying it to Mobile Interaction. Personal and Ubiquitous Computing 19, 8 (2015), 1295--1311.  ",
      "doi": "10.1007/s00779-015-0894-4"
    },
    {
      "text": "Youngsun Kim, Jaedong Lee, and Gerard Jounghyun Kim. 2017a. Design and Application of 2D Illusory Vibrotactile Feedback for Hand-held Tablets. Journal on Multimodal User Interfaces 11, 2 (2017), 133--148.",
      "doi": ""
    },
    {
      "text": "Jaedong Lee, Youngsun Kim, and Gerard Kim. 2012. Funneling and Saltation Effects for Tactile Interaction with Virtual Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI). ACM, 3141--3148.  ",
      "doi": "10.1145/2207676.2208729"
    },
    {
      "text": "Jaedong Lee, Youngsun Kim, and Gerard Kim. 2015. Applying \"Out of Body\" Vibrotactile Illusion to Two-Finger Interaction for Perception of Object Dynamics. Lecture Notes on Computer Science LNCS 9299 (INTERACT 2015, Part IV) (2015), 506--509.",
      "doi": ""
    },
    {
      "text": "Makoto Miyazaki, Masaya Hirashima, and Daichi Nozaki. 2010. The \"Cutaneous Rabbit\" Hopping out of the Body. The Journal of Neuroscience 30, 5 (2010), 1856--1860.",
      "doi": ""
    },
    {
      "text": "Gunhyuk Park, Hojun Cha, and Seungmoon Choi. 2017. Attachable and Detachable Vibrotactile Feedback Modules and Their Information Capacity for Spatiotemporal Patterns. In Proceedings of the IEEE World Haptics Conference (WHC). 78--83.",
      "doi": ""
    },
    {
      "text": "Jaeyoung Park, Jaeha Kim, Yonghwan Oh, and Hong Z. Tan. 2016. Rendering Moving Tactile Stroke on the Palm Using a Sparse 2D Array. Lecture Notes on Computer Science (LNCS) LNCS 9774 (Eurohaptics 2016, Part I) (2016), 47--56.  ",
      "doi": "10.1007/978-3-319-42321-0_5"
    },
    {
      "text": "Dario Pittera, Marianna Obrist, and Ali Israr. 2017. Hand-to-Hand: An Intermanual Illusion of Movement. In Proceedings of the ACM International Conference on Multimodal Interaction (ICMI). 73--81.  ",
      "doi": "10.1145/3136755.3136777"
    },
    {
      "text": "Jukka Raisamo, Roope Raisamo, and Veikko Surakka. 2009. Evaluating the Effect of Temporal Parameters for Vibrotactile Saltatory Patterns. In Proceedings of the International Conference on Multimodal Interfaces (ICMI). 319--326.  ",
      "doi": "10.1145/1647314.1647381"
    },
    {
      "text": "Jukka Raisamo, Roope Raisamo, and Veikko Surakka. 2013. Comparison of Saltation, Amplitude Modulation, and a Hybrid Method of Vibrotactile Stimulation. IEEE Transactions on Haptics 6, 4 (2013), 517--521.  ",
      "doi": "10.1109/TOH.2013.25"
    },
    {
      "text": "Dongseok Ryu, Gi-Hun Yang, and Sungchul Kang. 2009. T-Hive: Vibrotactile Interface Presenting Spatial Information on Handle Surface. In Proceedings of the IEEE International Conference on Robotics and Automation (ICRA). 683--688. ",
      "doi": "10.5555/1703775.1704019"
    },
    {
      "text": "Oliver S. Schneider, Ali Israr, and Karon E. MacLean. 2015. Tactile Animation by Direct Manipulation of Grid Displays. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST). 21--30.  ",
      "doi": "10.1145/2807442.2807470"
    },
    {
      "text": "Jongman Seo and Seungmoon Choi. 2010. Initial Study of Creating Linearly Moving Vibrotactile Sensation on Mobile Device. In Proceedings of the Haptics Symposium (HAPTICS). IEEE, 67--70.  ",
      "doi": "10.1109/HAPTIC.2010.5444677"
    },
    {
      "text": "Jongman Seo and Seungmoon Choi. 2013. Perceptual Analysis of Vibrotactile Flows on a Mobile Device. IEEE Transactions on Haptics 6, 4 (2013), 522--527.  ",
      "doi": "10.1109/TOH.2013.24"
    },
    {
      "text": "Jongman Seo and Seungmoon Choi. 2015. Edge Flows: Improving Information Transmission in Mobile Devices Using Two-Dimensional Vibrotactile Flows. In Proceedings of the IEEE World Haptics Conference (WHC). 25--30.",
      "doi": ""
    },
    {
      "text": "Katherine O. Sofia and Lynette A. Jones. 2013. Mechanical and Psychophysical Studies of Surface Wave Propagation During Vibrotactile Stimulation. IEEE Transactions on Haptics 6 (2013), 320--329.  ",
      "doi": "10.1109/TOH.2013.1"
    },
    {
      "text": "S. Tachi, K. Tanie, K. Komiyama, K. Asaba, Y. Tomita, and M. Abe. 1980. Information Transmission by Two-Dimensional Electrocutaneous Phantom Sensation. In Proceedings of the 8th Annual Northeast Bioengineering Conference. 258--262.",
      "doi": ""
    },
    {
      "text": "Hong Z. Tan, Robert Gray, J. Jay Young, and Ryan Traylor. 2003. A Haptic Back Display for Attentional and Directional Cueing. Haptics-e (http://www.haptics-e.org) 3, 1 (2003).",
      "doi": ""
    },
    {
      "text": "Hong Z. Tan, Charlotte M. Reed, and Nathaniel I. Durlach. 2010. Optimum Information-Transfer Rates for Communication through Haptic and Other Sensor Modalities. IEEE Transactions on Haptics 3, 2 (2010), 98--108.  ",
      "doi": "10.1109/TOH.2009.46"
    },
    {
      "text": "Gi-Hun Yang, Dongseok Ryu, and Sungchul Kang. 2009. Vibrotactile Display for Hand-held Input Device Providing Spatial and Directional Information. In Proceedings of the World Haptics Conference (WHC). IEEE, 79--84.  ",
      "doi": "10.1109/WHC.2009.4810831"
    },
    {
      "text": "Gi-Hun Yang, Moon sub Jin, Yeonsub Jin, and Sungchul Kang. 2010. T-Mobile: Vibrotactile Display Pad with Spatial and Directional Information for Hand-held Device. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 5245--5250.",
      "doi": ""
    },
    {
      "text": "Nesra Yannier, Ali Israr, Jill Fain Lehman, and Roberta L. Klatzky. 2015. FeelSleeve: Haptic Feedback to Enhance Early Reading. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). 1015--1024.  ",
      "doi": "10.1145/2702123.2702396"
    },
    {
      "text": "Koji Yatani and Khai N. Truong. 2009. SemFeel: A User Interface with Semantic Tactile Feedback for Mobile Touch-screen Devices. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST). 111--120.  ",
      "doi": "10.1145/1622176.1622198"
    },
    {
      "text": "Siyan Zhao, Ali Israr, and Roberta L. Klatzky. 2015. Intermanual Apparent Tactile Motion on Handheld Tablets. In Proceedings of the IEEE World Haptics Conference. 241--247.",
      "doi": ""
    }
  ]
}