{
  "doi": "10.1145/3173574.3173969",
  "title": "How to Design a Digital Storytelling Authoring Tool for Developing Pre-Reading and Pre-Writing Skills",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "In the paper we describe an exploration into the design of an authoring tool to support the creation of multimedia stories. We explicitly targeted children with no reading or writing skills and their educators. Children in this age group often enjoy reading and creating stories together with adults and in so doing develop important pre-literacy skills. Literature suggests that when children play an active role in these activities, with a high level of engagement and interaction, there is a significant increase in their vocabulary acquisition and an improvement in their communication skills. Thus, we investigated these issues by conducting an explorative study in a pre-school class with fifteen children and three teachers. Here, we describe the emerging challenges and provide design directions for an authoring system to support the co-creation of stories for pre-literate children.",
  "authors": [
    {
      "name": "Elisa Rubegni",
      "institution": "University of Lincoln, Lincoln, Lincolnshire, United Kingdom",
      "img": "/do/10.1145/contrib-81100267253/rel-imgonly/eli_pict_2.tif",
      "acmid": "81100267253",
      "orcid": "missing"
    },
    {
      "name": "Monica Landoni",
      "institution": "Università della Svizzera Italiana, Lugano, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100625309",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bonsignore E, Quinn AJ, Druin A, Bederson BB. Sharing stories ?in the wild\": A mobile storytelling case study using StoryKit. ACM Transactions on Computer-Human Interaction (TOCHI). 2013 Jul 1;20(3):18.  ",
      "doi": "10.1145/2491500.2491506"
    },
    {
      "text": "Iurgel, I.A., Zagalo, N. and Petta, P. (Eds.) Proceedings of ICIDS (International Conference on Interactive Digital Storytelling) 2009, 9--11 December, Guimarães, Portugal. ",
      "doi": "10.5555/1695522"
    },
    {
      "text": "Ole Sejer Iversen, Rachel Charlotte Smith, and Christian Dindler. 2017. Child as Protagonist: Expanding the Role of Children in Participatory Design. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17). ACM, New York, NY, USA, 27--37.  ",
      "doi": "10.1145/3078072.3079725"
    },
    {
      "text": "Ofra Korat. 2010. Reading electronic books as a support for vocabulary, story comprehension and word reading in kindergarten and first grade. Comput. Educ. 55, 1 (August 2010), 24--31.  ",
      "doi": "10.1016/j.compedu.2009.11.014"
    },
    {
      "text": "Ali Mazalek, and Glorianna Davenport. \"A tangible platform for documenting experiences and sharing multimedia stories.\" In Proceedings of the 2003 ACM SIGMM workshop on Experiential telepresence, pp. 105--109. ACM, 2003.  ",
      "doi": "10.1145/982484.982505"
    },
    {
      "text": "Jean Piaget. 1964. Part I: Cognitive development in children: Piaget development and learning. Journal of research in science teaching, 2(3), pp.176--186",
      "doi": ""
    },
    {
      "text": "Emily Rhodes and Greg Walsh. 2016. Recommendations for Developing Technologies that Encourage Reading Practices Among Children in Families with Low-literate Adults. IDC '16: Proceedings of the 15th International Conference on Interaction Design and Children. 125--136  ",
      "doi": "10.1145/2930674.2930709"
    },
    {
      "text": "Anna Richter and Mary L. Courage. 2017. Comparing electronic and paper storybooks for preschoolers: Attention, engagement, and recall. Journal of Applied Developmental Psychology 48. 92--102",
      "doi": ""
    },
    {
      "text": "Antonio Rizzo, Marti Patrizia, Decortis Françoise, Rutgers Job, and Paul Thursfield. \"Building narrative experiences for children through real time media manipulation: POGO World.\" In Funology, pp. 189199. Springer Netherlands, 2003. ",
      "doi": "10.5555/1139008.1139029"
    },
    {
      "text": "Bernard Robin. \"The educational uses of digital storytelling.\" Technology and teacher education annual 1 (2006): 709.",
      "doi": ""
    },
    {
      "text": "Elisa Rubegni and Monica Landoni. 2014. Fiabot!: design and evaluation of a mobile storytelling application for schools. In Proceedings of the 2014 conference on Interaction design and children (IDC '14). ACM, New York, NY, USA, 165--174.  ",
      "doi": "10.1145/2593968.2593979"
    },
    {
      "text": "Elisa Rubegni and Monica Landoni. 2015. Supporting creativity in designing story authoring tools. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15). ACM, New York, NY, USA, 287--290  ",
      "doi": "10.1145/2771839.2771898"
    },
    {
      "text": "Andy Russell. 2010. ToonTastic: a global storytelling network for kids, by kids. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (TEI '10). ACM, New York, NY, USA, 271--274.  ",
      "doi": "10.1145/1709886.1709942"
    },
    {
      "text": "Kimiko Ryokai and Justine Cassell. 1998. StoryMat: a play space with narrative memories. In Proceedings of the 4th international conference on Intelligent user interfaces (IUI '99). ACM, New York, NY, USA, 201-.  ",
      "doi": "10.1145/291080.291126"
    },
    {
      "text": "Daisy JH Smeets, and Adriana G. Bus. \"The interactive animated e-book as a word learning device for kindergartners.\" Applied Psycholinguistics 36.4 (2015): 899--920.",
      "doi": ""
    },
    {
      "text": "Doukoulos Theodoros, Chita Murray, Michael Hogan, Owen Harney, Tony Hall, and Bonnie Thompson Long. 2017. Using a Collective Intelligence ScenarioBased Design approach to develop a collaboration ecosystem supporting the authorship of pedagogically valuable e-books for children. The Journal of Literacy and Technology Volume 18, Number 2: Summer/Fall",
      "doi": ""
    },
    {
      "text": "Marian JAJ Verhallen, Adriana G. Bus, and Maria T. de Jong. \"The promise of multimedia stories for kindergarten children at risk.\" Journal of educational psychology 98.2 (2006): 410.",
      "doi": ""
    },
    {
      "text": "Greg Walsh, Allison Druin, Mona Leigh Guha, Elizabeth Bonsignore, Elizabeth Foss, Jason C. Yip, Evan Golub, Tamara Clegg, Quincy Brown, Robin Brewer, Asmi Joshi, and Richelle Brown. 2012. DisCo: a co-design online tool for asynchronous distributed child and adult design partners. In Proceedings of the 11th International Conference on Interaction Design and Children (IDC '12). ACM, New York, NY, USA, 11--19.  ",
      "doi": "10.1145/2307096.2307099"
    },
    {
      "text": "Grover J. Whitehurst, Francine L. Falco, Christopher J. Lonigan, Janet E. Fischel, Barbara D. DeBaryshe, Marta C. Valdez-Menchaca, and Marie Caulfield. \"Accelerating language development through picture book reading.\" Developmental psychology 24, no. 4 (1988): 552.",
      "doi": ""
    },
    {
      "text": "Schuler, Douglas, and Aki Namioka. 1993. Participatory Design: Principles and Practices, Lawrence Erlbaum, Hillsdale, NJ,. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Vygotsky, Lev Semenovich. (2004; 1967). Imagination and creativity in childhood. Journal of Russian and east European psychology. Vol 42, no. 1",
      "doi": ""
    },
    {
      "text": "Vygotsky, Lev Semenovich. (1978) Mind in Society: The Development of Higher Psychological Processes. Cambridge, MA: Harvard University Press",
      "doi": ""
    }
  ]
}