{
  "doi": "10.1145/3173574.3173907",
  "title": "Food Democracy in the Making: Designing with Local Food Networks",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "This paper introduces the concept of 'food democracy' as a theoretical framing for HCI to engage in human-food interaction. Extending existing foci of health and environmental sustainability, food democracy requires thinking through aspects of social and economic justice, and democratic governance as directions for the study and design of technologies for alternative food movements. To exemplify food democracy, we report on field observations and interviews about the opportunities and challenges for supporting the development of local food networks with communities in deprived neighbourhoods using an online direct food marketing platform. Using a food democracy framing, we identify tensions around environmental, social, and economic goals; challenges of local food businesses operating within the existing economic paradigm; and differing perspectives on ownership and governance in the network. We discuss the need for HCI to design for systems change and propose a design space for HCI in supporting food democracy movements.",
  "authors": [
    {
      "name": "Sebastian Prost",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81479661636/rel-imgonly/profile-500px.png",
      "acmid": "81479661636",
      "orcid": "missing"
    },
    {
      "name": "Clara Crivellaro",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959323457",
      "orcid": "0000-0002-4578-4545"
    },
    {
      "name": "Andy Haddon",
      "institution": "Earth Doctors Ltd., Wylam, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260980",
      "orcid": "missing"
    },
    {
      "name": "Rob Comber",
      "institution": "RISE SICS, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    }
  ],
  "references": [
    {
      "text": "Sofiane Abbar, Yelena Mejova, and Ingmar Weber. 2015. You Tweet What You Eat: Studying Food Consumption Through Twitter. In CHI '15 Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 3197--3206.  ",
      "doi": "10.1145/2702123.2702153"
    },
    {
      "text": "Rob Abercrombie, Ellen Harries, and Rachel Wharton. 2015. Systems Change: A Guide To What It Is and How to Do It. New Philanthrophy Capital",
      "doi": ""
    },
    {
      "text": "Ferran Altarriba, Stefano Eugenio Lanzani, Ana Torralba, and Mathias Funk. 2017. The Grumpy Bin. Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems - DIS '17 Companion: 90--94.  ",
      "doi": "10.1145/3064857.3079125"
    },
    {
      "text": "Eli Blevis and Susan Coleman Morse. 2009. Food, Dude. Interactions 16, 2: 58--62.",
      "doi": "10.1145/1487632.1487646"
    },
    {
      "text": "Susanne Bødker and Pär-Ola Zander. 2015. Participation in Design between Public Sector and Local Communities. In Proceedings of the 7th International Conference on Communities and Technologies - C&T '15, 49--58.  ",
      "doi": "10.1145/2768545.2768546"
    },
    {
      "text": "Kirsten Boehner and Carl DiSalvo. 2016. Data, Design and Civics: An Exploratory Study of Civic Tech. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 2970--2981.  ",
      "doi": "10.1145/2858036.2858326"
    },
    {
      "text": "Branden Born and Mark Purcell. 2006. Avoiding the Local Trap. Journal of Planning Education and Research 26, 2: 195--207.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Hrönn Brynjarsdóttir and Maria Håkansson. 2012. Sustainably unpersuaded: How persuasion narrows our vision of sustainability. Proc. CHI '12: 947--956.  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Michael Carolan. 2016. Agro-Digital Governance and Life Itself: Food Politics at the Intersection of Code and Affect. Sociologia Ruralis 0, 0: 1--20.",
      "doi": ""
    },
    {
      "text": "Winyu Chinthammit, Henry Been-Lirn Duh, Jun Rekimoto, Winyu Chinthammit, Henry Been-Lirn Duh, and Jun Rekimoto. 2014. HCI in food product innovation. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14, 1111--1114.  ",
      "doi": "10.1145/2559206.2559213"
    },
    {
      "text": "Jh Choi, Rob Comber, and C Linehan. 2013. Food for thought: designing for critical reflection on food practices. In DIS 2012 Workshops, 793--794.  ",
      "doi": "10.1145/2317956.2318077"
    },
    {
      "text": "Adrian K. Clear, Rob Comber, Adrian Friday, Eva Ganglbauer, Mike Hazas, and Yvonne Rogers. 2013. Green food technology: UbiComp opportunities for reducing the environmental impacts of food. In UbiComp '13 Adjunct, 553--558.  ",
      "doi": "10.1145/2494091.2497316"
    },
    {
      "text": "Adrian K. Clear, Adrian Friday, and Mike Hazas. 2016. Bearing an Open \"Pandora's Box\": HCI for Reconciling Everyday Food and Sustainability. ACM Transactions on Computer-Human Interaction (TOCHI) 23, 5: 1--25.  ",
      "doi": "10.1145/2970817"
    },
    {
      "text": "Adrian K. Clear, Adrian Friday, Mark Rouncefield, and Alan Chamberlain. 2015. Supporting Sustainable Food Shopping. IEEE Pervasive Computing 14, 4: 28--36.",
      "doi": "10.1109/MPRV.2015.78"
    },
    {
      "text": "Adrian K Clear, Mike Hazas, Janine Morley, Adrian Friday, and Oliver Bates. 2013. Domestic food and sustainable design: A Study of University Student Cooking and its Impacts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2447--2456.  ",
      "doi": "10.1145/2470654.2481339"
    },
    {
      "text": "Rob Comber, Jaz Hee Jeong Choi, Jettie Hoonhout, and Kenton O'Hara. 2014. Designing for human-food interaction: An introduction to the special issue on \"food and interaction design.\" International Journal of Human Computer Studies 72, 2: 181--184.  ",
      "doi": "10.1016/j.ijhcs.2013.09.001"
    },
    {
      "text": "Rob Comber, Jettie Hoonhout, Aart van Halteren, Paula Moynihan, and Patrick Olivier. 2013. Food practices as situated action. In CHI '13, 2457.  ",
      "doi": "10.1145/2470654.2481340"
    },
    {
      "text": "Rob Comber, Anja Thieme, Ashur Rafiev, Nick Taylor, and Nicole Krämer. 2009. BinCam: Designing for Engagement with Facebook for Behavior Change. In Interact 2009.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Alex Taylor, Vasilis Vlachokyriakos, Rob Comber, Bettina Nissen, and Peter Wright. 2016. Re-Making Places: HCI, \"Community Building\" and Change.",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt and Amelia R. Malone. 2015. The Promise of the Sharing Economy among Disadvantaged Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, 2285--2294.  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Markéta Dolej?ová and Denisa Kera. 2017. Soylent Diet Self-Experimentation. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17, 2112--2123.  ",
      "doi": "10.1145/2998181.2998365"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16, 656--671.  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Lynn Susan Dombrowski. 2015. Sociotechnical Food Justice: Examining and Designing Public Interventions for Systemic Social Issues. UC Irvine.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. In Proc. DIS '10, 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Andy Dow, John Vines, Toby Lowe, Rob Comber, and Rob Wilson. 2017. What Happens to Digital Feedback? In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 5813--5825.  ",
      "doi": "10.1145/3025453.3025943"
    },
    {
      "text": "E. Melanie DuPuis and Sean Gillon. 2009. Alternative modes of governance: Organic as civic engagement. Agriculture and Human Values 26, 1--2: 43--56.",
      "doi": ""
    },
    {
      "text": "E. Melanie DuPuis and David Goodman. 2005. Should we go \"home\" to eat?: Toward a reflexive politics of localism. Journal of Rural Studies 21, 3: 359--371.",
      "doi": ""
    },
    {
      "text": "Sheena Erete and Jennifer O. Burrell. 2017. Empowered Participation: How Citizens Use Technology in Local Governance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 2307--2319.  ",
      "doi": "10.1145/3025453.3025996"
    },
    {
      "text": "Geremy Farr-Wharton, Jaz Hee-Jeong Choi, and Marcus Foth. 2014. Food Talks Back: Exploring the Role of Mobile Applications in Reducing Domestic Food Wastage. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures the Future of Design - OzCHI '14, 352--361.  ",
      "doi": "10.1145/2686612.2686665"
    },
    {
      "text": "Sarah Fox, Mariam Asad, Katherine Lo, Jill P. Dimond, Lynn S. Dombrowski, and Shaowen Bardzell. 2016. Exploring Social Justice, Design, and HCI. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems CHI EA '16, 3293--3300.  ",
      "doi": "10.1145/2851581.2856465"
    },
    {
      "text": "J K Frawley, L E Dyson, and J Underwood. 2014. Rewriting, redesigning and reimagining the recipe for more sustainable food systems. In 26th Australian Computer-Human Interaction Conference, OzCHI 2014, 366--369.  ",
      "doi": "10.1145/2686612.2686667"
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, and Rob Comber. 2013. Negotiating food waste: Using a Practice Lens to Inform Design. ACM Transactions on Computer-Human Interaction 20, 2: 1--25.  ",
      "doi": "10.1145/2463579.2463582"
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, Özge Subasi, and Florian Güldenpfennig. 2014. Think Globally, Act Locally: A Case Study of a Free Food Sharing Community and Social Networking. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14, 911--921.  ",
      "doi": "10.1145/2531602.2531664"
    },
    {
      "text": "Andrea Grimes and Richard Harper. 2008. Celebratory Technology: New Directions for Food Research in HCI. In CHI '08, 467.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Shad Gross, Austin Toombs, Jeff Wain, and Kevin Walorski. 2011. Foodmunity: designing community interactions over food. In CHI '11 Extended Abstracts on Human Factors in Computing Systems, 1019--1024.  ",
      "doi": "10.1145/1979742.1979504"
    },
    {
      "text": "Neil D. Hamilton. 2005. Food Democracy II: Revolution or Restoration? Journal of Food Law & Policy 1, 1: 8--23.",
      "doi": ""
    },
    {
      "text": "Keith Hart, Jean-Louis Laville, and Antonio David Cattani (eds.). 2010. The Human Economy. Polity Press, Malden, MA.",
      "doi": ""
    },
    {
      "text": "Neva Hassanein. 2003. Practicing food democracy: A pragmatic politics of transformation. Journal of Rural Studies 19, 1: 77--86.",
      "doi": ""
    },
    {
      "text": "Neva Hassanein. 2008. Locating Food Democracy: Theoretical and Practical Ingredients. Journal of Hunger & Environmental Nutrition 3, 2--3: 286--308.",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction 18, 3: 1--20.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Sara Heitlinger. 2013. Sustainable HCI for Grassroots Urban Food - Growing Communities. In ozCHI '13, 1-- 4.  ",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Eric Holt-Giménez and Annie Shattuck. 2011. Food crises, food regimes and food movements: rumblings of reform or tides of transformation? The Journal of peasant studies 38, 1: 109--44.",
      "doi": ""
    },
    {
      "text": "Rohit Ashok Khot, Deborah Lupton, Markéta Dolejšová, and Florian Floyd\" Mueller. 2017. Future of Food in the Digital Realm. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17, 1342-- 1345.  ",
      "doi": "10.1145/3027063.3049283"
    },
    {
      "text": "Sherah Kurnia, Serenity Hill, Md Mahbubur Rahim, Kirsten Larsen, Patrice Braun, and Danny Samson. 2015. Open Food Network: the Role of ICT to Support Regional Food Supply Chains in Australia. In Australasian Conference on Information Systems.",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, Christina J. Santana, and Elenore Long. 2016. Everyday Food Science as a Design Space for Community Literacy and Habitual Sustainable Practice. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 1786--1797.  ",
      "doi": "10.1145/2858036.2858363"
    },
    {
      "text": "Airi Lampinen and Barry Brown. 2017. Market Design for HCI: Successes and Failures of Peer-to-Peer Exchange Platforms. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems: 4331--4343.  ",
      "doi": "10.1145/3025453.3025515"
    },
    {
      "text": "Tim Lang. 2007. Food security or food democracy? Pesticides News, 78: 12--16.",
      "doi": ""
    },
    {
      "text": "Charles Z. Levkoe. 2013. Food sovereignty in Canada: creating just and sustainable food systems. Journal of Peasant Studies 40, 1: 293--297.",
      "doi": ""
    },
    {
      "text": "Charles Zalman Levkoe. 2011. Towards a transformative food politics. Local Environment 16, 7: 687--705.",
      "doi": ""
    },
    {
      "text": "Ann Light. 2014. The Allure of Provenance: Tracing Food through User-Generated Production Information. In Eat, Cook, Grow: Mixing Human-Computer Interactions with Human-Food Interactions, Jaz Heejeong Choi, Marcus Foth and Greg Hearn (eds.). MIT Press, 213--226.",
      "doi": ""
    },
    {
      "text": "Ruth Little, Damian Maye, and Brian Ilbery. 2010. Collective purchase: Moving local and organic foods beyond the niche market. Environment and Planning A 42, 8: 1797--1813.",
      "doi": ""
    },
    {
      "text": "H. P. P. Lötter. 2013. Poverty, ethics and justice. University Of Wales Press.",
      "doi": ""
    },
    {
      "text": "Peter Lyle, Jaz Hee-jeong Choi, and Marcus Foth. 2015. Growing food in the city. C&T '15: 89--97.",
      "doi": ""
    },
    {
      "text": "Thomas A. Lyson. 2005. Civic Agriculture and Community Problem Solving. Culture Agriculture 27, 2: 92--98.",
      "doi": ""
    },
    {
      "text": "Julie Maitland, Matthew Chalmers, and Katie A. Siek. 2009. Persuasion not required Improving our understanding of the sociotechnical context of dietary behavioural change. In Proceedings of the 3d International ICST Conference on Pervasive Computing Technologies for Healthcare, 1--8.",
      "doi": ""
    },
    {
      "text": "Enzio Manzini. 2014. Making Things Happen: Social Innovation and Design. Design Issues 30, 1: 57--66.",
      "doi": ""
    },
    {
      "text": "James Matson and Jeremiah Thayer. 2013. The role of food hubs in food supply chains. Journal of Agriculture, Food Systems, and Community Development 3, 4: 43--47.",
      "doi": ""
    },
    {
      "text": "Nathan McClintock. 2014. Radical, reformist, and garden-variety neoliberal: coming to terms with urban agriculture's contradictions. Local Environment 19, 2: 147--171.",
      "doi": ""
    },
    {
      "text": "Takuji Narumi, Yuki Ban, Takashi Kajinami, Tomohiro Tanikawa, and Michitaka Hirose. Augmented Perception of Satiety: Controlling Food Consumption by Changing Apparent Size of Food with Augmented Reality.",
      "doi": ""
    },
    {
      "text": "Marianna Obrist and Marianna. 2017. Mastering the Senses in HCI. In Proceedings of the 12th Biannual Conference on Italian SIGCHI Chapter - CHItaly '17, 1--2.  ",
      "doi": "10.1145/3125571.3125603"
    },
    {
      "text": "William Odom. 2010. \"Mate, we don't need a chip to tell us the soil s dry\" Opportunities for Designing Interactive Systems to Support Urban Food Production. In Human-Computer Interaction, 232--235.  ",
      "doi": "10.1145/1858171.1858211"
    },
    {
      "text": "OFN. 2017. Get on the Open Food Network! Showcase your beautiful food. Open Food Nerwork UK. Retrieved August 22, 2017 from https://openfoodnetwork.org.uk/sell",
      "doi": ""
    },
    {
      "text": "OFN. 2017. Welcome to Open Food Network. Open Food Network. Retrieved August 24, 2017 from https://openfoodnetwork.org.uk/",
      "doi": ""
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital Civics: Taking a Local Turn. Interactions 22, 4: 61--63.  ",
      "doi": "10.1145/2776885"
    },
    {
      "text": "Michel Pimbert. 2009. Towards Food Sovereignty: Reclaiming Autonomous Food Systems. London.",
      "doi": ""
    },
    {
      "text": "Chris Preist, Daniel Schien, and Eli Blevis. 2016. Understanding and Mitigating the Effects of Device and Cloud Service Design Decisions on the Environmental Footprint of Digital Infrastructure. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 1324--1337.  ",
      "doi": "10.1145/2858036.2858378"
    },
    {
      "text": "Mark Purcell and Shannon K. Tyman. 2015. Cultivating food as a right to the city. Local Environment 20, 10: 1132--1147.",
      "doi": ""
    },
    {
      "text": "Theodoros Rakopoulos. 2014. The crisis seen from below, within, and against: From solidarity economy to food distribution cooperatives in Greece. Dialectical Anthropology 38, 2: 189--207.",
      "doi": ""
    },
    {
      "text": "Ankita Raturi, Juliet Norton, Bill Tomlinson, Eli Blevis, and Lynn Dombrowski. 2017. Designing Sustainable Food Systems. In CHI EA '17, 609--616.  ",
      "doi": "10.1145/3027063.3027075"
    },
    {
      "text": "Henk Renting, Markis Schermer, and Adanella Rossi. 2012. Building Food Democracy: Exploring Civic Food Networks and Newly Emerging Forms of Food Citizenship. International Journal of Sociology of Agriculture and Food 19, 3: 289--307.",
      "doi": ""
    },
    {
      "text": "Edward W. Soja. 2010. Seeking Spatial Justice. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Nick Taylor, Keith Cheverst, Peter Wright, and Patrick Olivier. 2013. Leaving the wild. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 1549.",
      "doi": "10.1145/2470654.2466206"
    },
    {
      "text": "Trebor Scholz. 2014. Platform Cooperativism vs. the Sharing Economy. Medium. Retrieved September 19, 2017 from https://medium.com/@trebors/platformcooperativism-vs-the-sharing-economy-2ea737f1b5ad",
      "doi": ""
    },
    {
      "text": "Pia Tukkinen and Janne Lindqvist. 2015. Understanding Motivations for Using Grocery Shopping Applications. IEEE Pervasive Computing 14, 4: 38--44.",
      "doi": "10.1109/MPRV.2015.65"
    },
    {
      "text": "Via Campesina. 2007. Declaration of Nyéléni. Nyéléni 2007 - Forum for Food Sovereignty. Retrieved August 21, 2017 from https://viacampesina.org/en/declarationof-nyi/",
      "doi": ""
    },
    {
      "text": "Vasillis Vlachokyriakos, Matt Jones, Shaun Lawson, Patrick Olivier, Clara Crivellaro, Pete Wright, Evika Karamagioli, Eleni-Revekka Staiou, Dimitris Gouscos, Rowan Thorpe, Antonio Krüger, and Johannes Schöning. 2017. HCI, Solidarity Movements and the Solidarity Economy. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 3126--3137.  ",
      "doi": "10.1145/3025453.3025490"
    },
    {
      "text": "Xiaolan Wang, Ron Wakkary, Carman Neustaedter, and Audrey Desjardins. 2015. Information sharing, scheduling, and awareness in community gardening collaboration. C&T '15: 79--88.  ",
      "doi": "10.1145/2768545.2768556"
    },
    {
      "text": "Jun Wei, Xiaojuan Ma, and Shengdong Zhao. Food Messaging: Using an Edible Medium for Social Messaging.  ",
      "doi": "10.1145/2556288.2557026"
    },
    {
      "text": "Jennifer Welsh and Rod MacRae. 1998. Food Citizenship and Community Food Security: Lessons from Toronto, Canada. Canadian Journal of Development Studies/Revue canadienne d'études du développement 19, December: 237--255.",
      "doi": ""
    },
    {
      "text": "Jennifer L. Wilkins. 2005. Eating right here: Moving from consumer to food citizen: 2004 presidential address to the agriculture, food, and human values society, Hyde Park, New York, June 11, 2004. Agriculture and Human Values 22, 3: 269--273.",
      "doi": ""
    },
    {
      "text": "Michael Windfuhr and Jennie Jonsén. 2005. Food Sovereignty: Towards Democracy in Localized Food Systems.",
      "doi": ""
    },
    {
      "text": "Hannah Wittman. 2009. Reworking the metabolic rift: La Vía Campesina, agrarian citizenship, and food sovereignty. Journal of Peasant Studies 36, 4: 805-- 826.",
      "doi": ""
    }
  ]
}