{
  "doi": "10.1145/3173574.3173641",
  "title": "Crowdsourcing Rural Network Maintenance and Repair via Network Messaging",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Repair and maintenance requirements limit the successful operation of rural infrastructure. Current best practices are centralized management, which requires travel from urban areas and is prohibitively expensive, or intensively training community members, which limits scaling. We explore an alternative model: crowdsourcing repair from the community. Leveraging a Community Cellular Network in the remote Philippines, we sent SMS to all active network subscribers (n = 63) requesting technical support. From the pool of physical respondents, we explored their ability to repair through mock failures and conducted semi-structured interviews about their experiences with repair. We learned that community members would be eager to practice repair if allowed, would network to recruit more expertise, and seemingly have the collective capacity to resolve some common failures. They are most successful when repairs map directly to their lived experiences. We suggest infrastructure design considerations that could make repairs more tractable and argue for an inclusive approach.",
  "tags": [
    "technology for development",
    "ictd",
    "rural development",
    "crowdsourcing",
    "internet access"
  ],
  "authors": [
    {
      "name": "Esther Jang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659180433",
      "orcid": "missing"
    },
    {
      "name": "Mary Claire Barela",
      "institution": "University of the Philippines Diliman, Quezon City, Philippines",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659042530",
      "orcid": "missing"
    },
    {
      "name": "Matt Johnson",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659180407/rel-imgonly/profile.jpg",
      "acmid": "99659180407",
      "orcid": "missing"
    },
    {
      "name": "Philip Martinez",
      "institution": "University of the Philippines Diliman, Quezon City, Philippines",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659040767",
      "orcid": "missing"
    },
    {
      "name": "Cedric Festin",
      "institution": "University of the Philippines Diliman, Quezon City, Philippines",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453655378",
      "orcid": "missing"
    },
    {
      "name": "Margaret Lynn",
      "institution": "Unaffiliated, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196162",
      "orcid": "missing"
    },
    {
      "name": "Josephine Dionisio",
      "institution": "University of the Philippines Diliman, Quezon City, Philippines",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659223746",
      "orcid": "missing"
    },
    {
      "name": "Kurtis Heimerl",
      "institution": "University of Washington, Seattle, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331494033",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2014. 10 Globe Cable Theft Suspects Arrested. https://www.globe.com.ph/press-room/10-globe-cabletheft-suspects-arrested. (May 2014).",
      "doi": ""
    },
    {
      "text": "Anirudh Badam, KyoungSoo Park, Vivek S Pai, and Larry L Peterson. 2009. HashCache: Cache Storage for the Next Billion.. In NSDI, Vol. 9. 123--136. ",
      "doi": "10.5555/1558977.1558986"
    },
    {
      "text": "Roger Baig, Ramon Roca, Felix Freitag, and Leandro Navarro. 2015. Guifi.Net, a Crowdsourced Network Infrastructure Held in Common. Comput. Netw. 90, C (Oct. 2015), 150--165.  ",
      "doi": "10.1016/j.comnet.2015.07.009"
    },
    {
      "text": "German Castignani, Lucien Loiseau, and Nicolas Montavont. 2011. An evaluation of IEEE 802.11 community networks deployments. In Information Networking (ICOIN), 2011 International Conference on. IEEE, 498--503.",
      "doi": ""
    },
    {
      "text": "Facebook. 2017. CommunityCellularManager. https:// github.com/facebookincubator/CommunityCellularManager. (2017). Accessed: 2017-05--7.",
      "doi": ""
    },
    {
      "text": "Hernan Galperin and François Bar. 2006. The microtelco opportunity: evidence from Latin America. Information Technologies & International Development 3, 2 (2006), pp--73. http://itidjournal.org/itid/article/view/225",
      "doi": ""
    },
    {
      "text": "James Galvez. 2016. PLDT Calls for Uniformity in Telco Policies. The Manila Times Online (Nov. 2016).",
      "doi": ""
    },
    {
      "text": "Jorge Goncalves, Denzil Ferreira, Simo Hosio, Yong Liu, Jakob Rogstadius, Hannu Kukka, and Vassilis Kostakos. 2013. Crowdsourcing on the Spot: Altruistic Use of Public Displays, Feasibility, Performance, and Behaviours. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 753--762.  ",
      "doi": "10.1145/2493432.2493481"
    },
    {
      "text": "Stephen Graham and Nigel Thrift. 2007. Out of order: understanding repair and maintenance. Theory, Culture & Society 24, 3 (2007), 1--25.",
      "doi": ""
    },
    {
      "text": "Kurtis Heimerl, Brian Gawalt, Kuang Chen, Tapan Parikh, and Björn Hartmann. 2012. CommunitySourcing: Engaging Local Crowds to Perform Expert Work via Physical Kiosks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1539--1548.  ",
      "doi": "10.1145/2207676.2208619"
    },
    {
      "text": "Kurtis Heimerl, Shaddi Hasan, Kashif Ali, Eric Brewer, and Tapan Parikh. 2013. Local, Sustainable, Small-scale Cellular Networks. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (ICTD '13). ACM, New York, NY, USA, 2--12.  ",
      "doi": "10.1145/2516604.2516616"
    },
    {
      "text": "Kurtis Heimerl, Anuvind Menon, Shaddi Hasan, Kashif Ali, Eric Brewer, and Tapan Parikh. 2015. Analysis of Smartphone Adoption and Usage in a Rural Community Cellular Network. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (ICTD '15). ACM, New York, NY, USA, Article 40, 4 pages.  ",
      "doi": "10.1145/2737856.2737880"
    },
    {
      "text": "Simo Hosio, Jorge Goncalves, Vili Lehdonvirta, Denzil Ferreira, and Vassilis Kostakos. 2014. Situated Crowdsourcing Using a Market Model. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 55--64.  ",
      "doi": "10.1145/2642918.2647362"
    },
    {
      "text": "Lara Houston and Steven J. Jackson. 2016. Caring for the \"Next Billion\" Mobile Handsets: Opening Proprietary Closures Through the Work of Repair. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (ICTD '16). ACM, New York, NY, USA, Article 10, 11 pages.  ",
      "doi": "10.1145/2909609.2909658"
    },
    {
      "text": "D. L. Johnson, Elizabeth M. Belding, and Gertjan van Stam. 2012. Network Traffic Locality in a Rural African Village. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development (ICTD '12). ACM, New York, NY, USA, 268--277.  ",
      "doi": "10.1145/2160673.2160707"
    },
    {
      "text": "Zahir Koradia, C. Balachandran, Kapil Dadheech, Mayank Shivam, and Aaditeshwar Seth. 2012. Experiences of Deploying and Commercializing a Community Radio Automation System in India. In Proceedings of the 2Nd ACM Symposium on Computing for Development (ACM DEV '12). ACM, New York, NY, USA, Article 8, 10 pages.  ",
      "doi": "10.1145/2160601.2160612"
    },
    {
      "text": "James R Lewis and Jeff Sauro. 2006. When 100% really isn't 100%: improving the accuracy of small-sample estimates of completion rates. Journal of Usability studies 1, 3 (2006), 136--150. ",
      "doi": "10.5555/2835663.2835667"
    },
    {
      "text": "Sarvapali D. Ramchurn, Trung Dong Huynh, Matteo Venanzi, and Bing Shi. 2013. Collabmap: Crowdsourcing Maps for Emergency Planning. In Proceedings of the 5th Annual ACM Web Science Conference (WebSci '13). ACM, New York, NY, USA, 326--335.  ",
      "doi": "10.1145/2464464.2464508"
    },
    {
      "text": "Syril Repe and Mary Judaline F. Partlow. Globe Cell Site in Guihulngan Bombed. http://www.philstar.com/region/767131/globe-cell-siteguihulngan-bombed. (????).",
      "doi": ""
    },
    {
      "text": "Rhizomatica. 2017. Rhizomatica. https://www.rhizomatica.org/. (2017). Accessed: 2017-05--7.",
      "doi": ""
    },
    {
      "text": "Kushal Shah, Philip Martinez, Emre Tepedelenlioglu, Shaddi Hasan, Cedric Festin, Joshua Blumenstock, Josephine Dionisio, and Kurtis Heimerl. 2017. An Investigation of Phone Upgrades in Remote Community Cellular Networks. In Proceedings of the International Conference on Information and Communication Technologies and Development (ICTD '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3136560.3136569"
    },
    {
      "text": "Susan Leigh Star. 1999. The ethnography of infrastructure. American behavioral scientist 43, 3 (1999), 377--391.",
      "doi": ""
    },
    {
      "text": "Sonesh Surana, Rabin Patra, Sergiu Nedevschi, Manuel Ramos, Lakshminarayanan Subramanian, Yahel Ben-David, and Eric Brewer. 2008. Beyond Pilots: Keeping Rural Wireless Networks Alive. In Proceedings of the 5th USENIX Symposium on Networked Systems Design and Implementation (NSDI'08). USENIX Association, Berkeley, CA, USA, 119--132. http://dl.acm.org/citation.cfm?id=1387589.1387598 ",
      "doi": "10.5555/1387589.1387598"
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles and Examples. ACM Trans. Access. Comput. 3, 3, Article 9 (April 2011), 27 pages.  ",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Mariya Zheleva, Arghyadip Paul, David L. Johnson, and Elizabeth Belding. 2013. Kwiizya: Local Cellular Network Services in Remote Areas. In Proceeding of the 11th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '13). ACM, New York, NY, USA, 417--430.  ",
      "doi": "10.1145/2462456.2464458"
    }
  ]
}