{
  "doi": "10.1145/3173574.3174072",
  "title": "Revisiting “Hole in the Wall” Computing: Private Smart Speakers and Public Slum Settings",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Millions of homes worldwide enjoy access to digital content and services through smart speakers such as Amazon's Echo and Google's Home. Promotional materials and users' own videos typically show homes that have many well-resourced rooms, with good power and data infrastructures. Over the last several years, we have been working with slum communities in India, whose dwellings are usually very compact (one or two rooms), personal home WiFi is almost unheard of, power infrastructures are far less robust, and financial resources put such smart speakers out of individual household reach. Inspired by the \"hole in the wall\" internet-kiosk programme, we carried out workshops with slum inhabitants to uncover issues and opportunities for providing a smart-speaker-type device in public areas and passageways. We designed and deployed a simple probe that allowed passers-by to ask and receive answers to questions. In this paper, we present the findings of this work, and a design space for such devices in these settings.",
  "tags": [
    "conversational speech",
    "emergent users",
    "public spaces"
  ],
  "authors": [
    {
      "name": "Simon Robinson",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81371592031/rel-imgonly/profile-small-rect.jpg",
      "acmid": "81371592031",
      "orcid": "0000-0001-9228-006X"
    },
    {
      "name": "Jennifer Pearson",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81384596881/rel-imgonly/img_4695.jpg",
      "acmid": "81384596881",
      "orcid": "0000-0002-1960-1012"
    },
    {
      "name": "Shashank Ahire",
      "institution": "IIT Bombay, Mumbai, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658659910",
      "orcid": "missing"
    },
    {
      "name": "Rini Ahirwar",
      "institution": "IIT Bombay, Mumbai, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261947",
      "orcid": "missing"
    },
    {
      "name": "Bhakti Bhikne",
      "institution": "IIT Bombay, Mumbai, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260515",
      "orcid": "missing"
    },
    {
      "name": "Nimish Maravi",
      "institution": "IIT Bombay, Mumbai, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261374",
      "orcid": "missing"
    },
    {
      "name": "Matt Jones",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81328488881/rel-imgonly/forweb.jpg",
      "acmid": "81328488881",
      "orcid": "0000-0001-7657-7373"
    }
  ],
  "references": [
    {
      "text": "Theologos Athanaselis, Stelios Bakamidis, Ioannis Dologlou, Evmorfia N. Argyriou and Antonis Symvonis (2014). Making assistive reading tools user friendly: a new platform for Greek dyslexic students empowered by automatic speech recognition. Multimedia Tools and Applications 68, 3, 681--699.  ",
      "doi": "10.1007/s11042-012-1073-5"
    },
    {
      "text": "Shiri Azenkot and Nicole B. Lee (2013). Exploring the use of speech input by blind people on mobile devices. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, 11:1--11:8.  ",
      "doi": "10.1145/2513383.2513440"
    },
    {
      "text": "Laurent Besacier, Etienne Barnard, Alexey Karpov and Tanja Schultz (2014). Automatic speech recognition for under-resourced languages: a survey. Speech Communication 56, 85--100.  ",
      "doi": "10.1016/j.specom.2013.07.008"
    },
    {
      "text": "Nicola J. Bidwell and Masbulele Jay Siya (2013). Situating asynchronous voice in rural Africa. In Human-Computer Interaction -- INTERACT 2013: 14th IFIP TC 13 International Conference, Proceedings, Part III. Springer Berlin Heidelberg, Berlin, Heidelberg, 36--53.",
      "doi": ""
    },
    {
      "text": "Nicola J. Bidwell, Simon Robinson, Elina Vartiainen, Matt Jones, Masbulele Jay Siya, Thomas Reitmaier, Gary Marsden and Mounia Lalmas (2014). Designing social media for community information sharing in rural South Africa. In SAICSIT '14: Proceedings of the Southern African Institute for Computer Scientist and Information Technologists Annual Conference 2014. ACM, New York, NY, USA, 104--114.  ",
      "doi": "10.1145/2664591.2664615"
    },
    {
      "text": "Stephen Brewster, Matt Jones, Roderick Murray-Smith, Amit A. Nanavati, Nitendra Rajput, Albrecht Schmidt and M. Turunen (2011). We need to talk: rediscovering audio for universal access. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 715--716.  ",
      "doi": "10.1145/2037373.2037494"
    },
    {
      "text": "Andrew D. Christian and Brian L. Avery (2000). Speak out and annoy someone: experience with intelligent kiosks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 313--320.  ",
      "doi": "10.1145/332040.332449"
    },
    {
      "text": "Ritu Dangwal, Swati Jha, Shiffon Chatterjee and Sugata Mitra (2005). A model of how children acquire computing skills from hole-in-the-wall computers in public places. Information Technologies&International Development 2, 4, 41--60.  ",
      "doi": "10.1162/154475205775249319"
    },
    {
      "text": "Ritu Dangwal and Preeti Kapur (2008). Children's learning processes using unsupervised \"hole in the wall\" computers in shared public spaces. Australasian Journal of Educational Technology 24, 3, 339--354.",
      "doi": ""
    },
    {
      "text": "Nicola Dell and Neha Kumar (2016). The ins and outs of HCI for development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2220-- 2232.  ",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Devanuj and Anirudha Joshi (2013). Technology adoption by 'emergent' users: the user-usage model. In Proceedings of the 11th Asia Pacific Conference on Computer Human Interaction (APCHI '13). ACM, New York, NY, USA, 28--38.  ",
      "doi": "10.1145/2525194.2525209"
    },
    {
      "text": "David Eustis (2014). Speak more than one language? So does Google. https://search.googleblog.com/2014/ 08/speak-more-than-one-language-so-does.html (visited on 25/08/2017).",
      "doi": ""
    },
    {
      "text": "David M. Frohlich, Dorothy Rachovides, Kiriaki Riga, Ramnath Bhat, Maxine Frank, Eran Edirisinghe, Dhammike Wickramanayaka, Matt Jones and Will Harwood (2009). Storybank: mobile digital storytelling in a development context. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1761--1770.  ",
      "doi": "10.1145/1518701.1518972"
    },
    {
      "text": "Jean-Luc Gauvain, Jean-Jacques Gangolf and Lori Lamel (1996). Speech recognition for an information kiosk. In Proceedings of the Fourth International Conference on Spoken Language Processing (ICSLP '96). Vol. 2. IEEE, 849--852.",
      "doi": ""
    },
    {
      "text": "Javier Gonzalez-Dominguez, David Eustis, Ignacio Lopez-Moreno, Andrew Senior, Françoise Beaufays and Pedro J. Moreno (2015). A real-time end-to-end multilingual speech recognition architecture. IEEE Journal of Selected Topics in Signal Processing 9, 4, 749--759.",
      "doi": ""
    },
    {
      "text": "Matt Jones, Simon Robinson, Jennifer Pearson, Manjiri Joshi, Dani Raju, Charity Chao Mbogo, Sharon Wangari, Anirudha Joshi, Edward Cutrell and Richard Harper (2017). Beyond \"yesterday's tomorrow\": futurefocused mobile interaction design by and for emergent users. Personal and Ubiquitous Computing 21, 1, 157-- 171.  ",
      "doi": "10.1007/s00779-016-0982-0"
    },
    {
      "text": "John F. Kelley (1984). An iterative design methodology for user-friendly natural language office information applications. ACM Transactions on Information Systems 2, 1, 26--41.  ",
      "doi": "10.1145/357417.357420"
    },
    {
      "text": "Arun Kumar, Nitendra Rajput, Dipanjan Chakraborty, Sheetal K. Agarwal and Amit A. Nanavati (2007). WWTW: the world wide telecom web. In Proceedings of the 2007 Workshop on Networked Systems for Developing Regions (NSDR '07). ACM, New York, NY, USA, 7:1--7:6.  ",
      "doi": "10.1145/1326571.1326582"
    },
    {
      "text": "Anuj Kumar, Anuj Tewari, Seth Horrigan, Matthew Kam, Florian Metze and John Canny (2011). Rethinking speech recognition on mobile devices. In Proceedings of International Workshop on Intelligent User Interfaces for Developing Regions (IUI4DR). http://repository.cmu.edu/lti/117/.",
      "doi": ""
    },
    {
      "text": "Anuj Kumar, Pooja Reddy, Anuj Tewari, Rajat Agrawal and Matthew Kam (2012). Improving literacy in developing countries using speech recognitionsupported games on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1149--1158.  ",
      "doi": "10.1145/2207676.2208564"
    },
    {
      "text": "Lori Lamel, Samir Bennacef, Jean-Luc Gauvain, Hervé Dartigues and Jean-Noël Temem (2002). User evaluation of the mask kiosk. Speech Communication 38, 1, 131--139.  ",
      "doi": "10.1016/S0167-6393%2801%2900048-6"
    },
    {
      "text": "Gautam Varma Mantena, S. Rajendran, B. Rambabu, Suryakanth V. Gangashetty, B. Yegnanarayana and Kishore Prahallad (2011). A speech-based conversation system for accessing agriculture commodity prices in Indian languages. In 2011 Joint Workshop on Handsfree Speech Communication and Microphone Arrays, 153--154.",
      "doi": ""
    },
    {
      "text": "Ministry of Home Affairs, Government of India (2001). Census of India 2001: General Note. http://www. censusindia.gov.in/Census_Data_2001/Census_Data_Online/Language/gen_note.html (visited on 01/09/2017).",
      "doi": ""
    },
    {
      "text": "Sugata Mitra, Ritu Dangwal, Shiffon Chatterjee, Swati Jha, Ravinder S Bisht and Preeti Kapur (2005). Acquisition of computing literacy on shared public computers: children and the \"hole in the wall\". Australasian Journal of Educational Technology 21, 3, 407--426.",
      "doi": ""
    },
    {
      "text": "Sugata Mitra (2000). Minimally invasive education for mass computer literacy. In Conference on Research in Distance and Adult Learning in Asia. http://citeseerx. ist.psu.edu/viewdoc/summary?doi=10.1.1.112.9984.",
      "doi": ""
    },
    {
      "text": "Sugata Mitra (2005). Self organising systems for mass computer literacy: findings from the 'hole in the wall' experiments. International Journal of Development Issues 4, 1, 71--81.",
      "doi": ""
    },
    {
      "text": "Neema Moraveji, Kori Inkpen, Ed Cutrell and Ravin Balakrishnan (2009). A mischief of mice: examining children's performance in single display groupware systems with 1 to 32 mice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 2157-- 2166.  ",
      "doi": "10.1145/1518701.1519030"
    },
    {
      "text": "Preeti Mudliar, Jonathan Donner and William Thies (2012). Emergent practices around cgnet swara, voice forum for citizen journalism in rural India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development (ICTD '12). ACM, New York, NY, USA, 159--168.  ",
      "doi": "10.1145/2160673.2160695"
    },
    {
      "text": "Cosmin Munteanu, Matt Jones, Steve Whittaker, Sharon Oviatt, Matthew Aylett, Gerald Penn, Stephen Brewster and Nicolas d'Alessandro (2014). Designing speech and language interactions. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 75--78.  ",
      "doi": "10.1145/2559206.2559228"
    },
    {
      "text": "Cosmin Munteanu and Gerald Penn (2015). Speechbased interaction: myths, challenges, and opportunities. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 2483--2484.  ",
      "doi": "10.1145/2702613.2706679"
    },
    {
      "text": "Maia Naftali and Leah Findlater (2014). Accessibility in context: understanding the truly mobile experience of smartphone users with motor impairments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers&Accessibility (ASSETS '14). ACM, New York, NY, USA, 209--216.  ",
      "doi": "10.1145/2661334.2661372"
    },
    {
      "text": "NPR and Edison Research (28th June 2017). The Smart Audio Report. http : / / nationalpublicmedia. com/smart-audio-report/.",
      "doi": ""
    },
    {
      "text": "Thuy Ong (2017). Google now recognizes 119 languages for voice-to-text dictation. https : / / www. theverge.com/2017/8/14/16142786/google-recognises119- languages- dictation- voice- typing (visited on 25/08/2017).",
      "doi": ""
    },
    {
      "text": "John Gorham Palfrey and Urs Gasser (2010). Born Digital: Understanding the First Generation of Digital Natives. Basic Books. ",
      "doi": "10.5555/1875337"
    },
    {
      "text": "Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave and Tapan S. Parikh (2010). Avaaj otalo: a field study of an interactive voice forum for small farmers in rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 733--742.  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Madelaine Plauché, Udhyakumar Nallasamy, Joyojeet Pal, Chuck Wooters and Divya Ramachandran (2006). Speech recognition for illiterate access to information and technology. In 2006 International Conference on Information and Communication Technologies and Development. IEEE, 83--92.",
      "doi": ""
    },
    {
      "text": "Madelaine Plauché and Madhu Prabaker (2006). Tamil market: a spoken dialog system for rural India. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, USA, 1619--1624.  ",
      "doi": "10.1145/1125451.1125746"
    },
    {
      "text": "Madeline Plauché and Udhyakumar Nallasamy (2007). Speech interfaces for equitable access to information technology. Information Technologies&International Development 4, 1, 69--86.  ",
      "doi": "10.1162/itid.2007.4.1.69"
    },
    {
      "text": "Nitin Sawhney and Chris Schmandt (2000). Nomadic radio: speech and audio interaction for contextual messaging in nomadic environments. ACM Transactions on Computer-Human Interaction 7, 3, 353--383.  ",
      "doi": "10.1145/355324.355327"
    },
    {
      "text": "Sunny Sen (2017). The backstory of Alexa's Indian makeover. https://factordaily.com/amazon-alexa-indiamakeover-review/ (visited on 22/11/2017).",
      "doi": ""
    },
    {
      "text": "Jahanzeb Sherwani, Nosheen Ali, Sarwat Mirza, Anjum Fatma, Yousuf Memon, Mehtab Karim, Rahul Tongia and Roni Rosenfeld (2007). Healthline: speechbased access to health information by low-literate users. In 2007 International Conference on Information and Communication Technologies and Development, 1--9.",
      "doi": ""
    },
    {
      "text": "Jahanzeb Sherwani, Sooraj Palijo, Sarwat Mirza, Tanveer Ahmed, Nosheen Ali and Roni Rosenfeld (2009). Speech vs. touch-tone: telephony interfaces for information access by low literate users. In 2009 International Conference on Information and Communication Technologies and Development (ICTD), 447--457. ",
      "doi": "10.5555/1812530.1812575"
    },
    {
      "text": "Roger Silverstone and Leslie Haddon (1996). Design and the domestication of information and communication technologies: technical change and everyday life. In Communication by Design: The Politics of Information and Communication Technologies. Oxford University Press, 44--74. http://eprints.lse.ac.uk/64821/.",
      "doi": ""
    },
    {
      "text": "Charl Van Heerden, Etienne Barnard and Marelie Davel (2009). Basic speech recognition for spoken dialogues. In INTERSPEECH-2009. International Speech Communication Association, 3003--3006. http: //hdl.handle.net/10204/3649.",
      "doi": ""
    },
    {
      "text": "Ian H Witten (1983). Principles of computer speech. Academic Press, Inc. ",
      "doi": "10.5555/538758"
    }
  ]
}