{
  "doi": "10.1145/3173574.3173982",
  "title": "Interactive Feedforward for Improving Performance and Maintaining Intrinsic Motivation in VR Exergaming",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Exergames commonly use low to moderate intensity exercise protocols. Their effectiveness in implementing high intensity protocols remains uncertain. We propose a method for improving performance while maintaining intrinsic motivation in high intensity VR exergaming. Our method is based on an interactive adaptation of the feedforward method: a psychophysical training technique achieving rapid improvement in performance by exposing participants to self models showing previously unachieved performance levels. We evaluated our method in a cycling-based exergame. Participants competed against (i) a self model which represented their previous speed; (ii) a self model representing their previous speed but increased resistance therefore requiring higher performance to keep up; or (iii) a virtual competitor at the same two levels of performance. We varied participants' awareness of these differences. Interactive feedforward led to improved performance while maintaining intrinsic motivation even when participants were aware of the interventions, and was superior to competing against a virtual competitor.",
  "tags": [
    "intrinsic motivation",
    "exergame",
    "virtual reality (vr)",
    "performance",
    "feedforward"
  ],
  "authors": [
    {
      "name": "Soumya C. Barathi",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261555",
      "orcid": "missing"
    },
    {
      "name": "Daniel J. Finnegan",
      "institution": "University Of Bath, Bath, United Kingdom",
      "img": "/do/10.1145/contrib-99658646811/rel-imgonly/acm-profile-photo.jpg",
      "acmid": "99658646811",
      "orcid": "missing"
    },
    {
      "name": "Matthew Farrow",
      "institution": "University Of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260719",
      "orcid": "missing"
    },
    {
      "name": "Alexander Whaley",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261933",
      "orcid": "missing"
    },
    {
      "name": "Pippa Heath",
      "institution": "University Of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260566",
      "orcid": "missing"
    },
    {
      "name": "Jude Buckley",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658980951",
      "orcid": "missing"
    },
    {
      "name": "Peter W. Dowrick",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260369",
      "orcid": "missing"
    },
    {
      "name": "Burkhard C. Wuensche",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82858694257",
      "orcid": "missing"
    },
    {
      "name": "James L. J. Bilzon",
      "institution": "University Of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659537071",
      "orcid": "missing"
    },
    {
      "name": "Eamonn O'Neill",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041277",
      "orcid": "0000-0002-1637-458X"
    },
    {
      "name": "Christof Lutteroth",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100238140",
      "orcid": "0000-0003-0634-7569"
    }
  ],
  "references": [
    {
      "text": "Konstantinos Alexandris, Charalambos Tsorbatzoudis, and George Grouios. 2002. Perceived constraints on recreational sport participation: Investigating their relationship with intrinsic motivation, extrinsic motivation and amotivation. Journal of Leisure Research 34, 3 (2002), 233.",
      "doi": ""
    },
    {
      "text": "James Annesi. 2003. Effects of a cognitive behavioral treatment package on exercise attendance and drop out in fitness centers. European Journal of Sport Science 3, 2 (2003), 1--16.",
      "doi": ""
    },
    {
      "text": "James J Annesi. 1998. Effects of computer feedback on adherence to exercise. Perceptual and Motor Skills 87, 2 (1998), 723--730.",
      "doi": ""
    },
    {
      "text": "Bruce W Bailey and Kyle McInnis. 2011. Energy cost of exergaming: a comparison of the energy cost of 6 forms of exergaming. Archives of Pediatrics & Adolescent Medicine 165, 7 (2011), 597--602.",
      "doi": ""
    },
    {
      "text": "Rosa M Banos, Patricia Escobar, Ausias Cebolla, Jaime Guixeres, Julio Alvarez Pitti, Juan Francisco Lisón, and Cristina Botella. 2016. Using virtual reality to distract overweight children from bodily sensations during exercise. Cyberpsychology, Behavior, and Social Networking 19, 2 (2016), 115--119.",
      "doi": ""
    },
    {
      "text": "Jonathan D Bartlett, Graeme L Close, Don PM MacLaren, Warren Gregson, Barry Drust, and James P Morton. 2011. High-intensity interval running is perceived to be more enjoyable than moderate-intensity continuous exercise: implications for exercise adherence. Journal of Sports Sciences 29, 6 (2011), 547--553.",
      "doi": ""
    },
    {
      "text": "Elaine Biddiss and Jennifer Irwin. 2010. Active video games to promote physical activity in children and youth: a systematic review. Archives of Pediatrics & Adolescent Medicine 164, 7 (2010), 664--672.",
      "doi": ""
    },
    {
      "text": "John Bolton, Mike Lambert, Denis Lirette, and Ben Unsworth. 2014. PaperDude: a virtual reality cycling exergame. In Proc. CHI Extended Abstracts. ACM, 475--478.  ",
      "doi": "10.1145/2559206.2574827"
    },
    {
      "text": "Kerri N Boutelle, Robert W Jeffery, and Simone A French. 2004. Predictors of vigorous exercise adoption and maintenance over four years in a community sample. International Journal of Behavioral Nutrition and Physical Activity 1, 1 (2004), 13.",
      "doi": ""
    },
    {
      "text": "Emily Brown and Paul Cairns. 2004. A grounded investigation of game immersion. In Proc. CHI extended abstracts. ACM, 1297--1300.  ",
      "doi": "10.1145/985921.986048"
    },
    {
      "text": "Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Eran Tiza, Buğra Can Sefercik, Idil Bostan, Oğuz Turan Buruk, Tilbe Göksun, and Oğuzhan Özcan. 2016. Sensation: Measuring the Effects of a Human-to-Human Social Touch Based Controller on the Player Experience. In Proc. CHI. ACM, 3944--3955.  ",
      "doi": "10.1145/2858036.2858418"
    },
    {
      "text": "Rachel B Clancy, Matthew P Herring, and Mark J Campbell. 2017. Motivation Measures in Sport: A Critical Review and Bibliometric Analysis. Frontiers in Psychology 8 (2017).",
      "doi": ""
    },
    {
      "text": "Shannon E Clark and Diane M Ste-Marie. 2007. The impact of self-as-a-model interventions on children's self-regulation of learning and swimming performance. Journal of Sports Sciences 25, 5 (2007), 577--586.",
      "doi": ""
    },
    {
      "text": "Jo Corbett, Martin J Barwood, Alex Ouzounoglou, Richard Thelwell, and Matthew Dicks. 2012. Influence of competition on performance and pacing during cycling exercise. Medicine & Science in Sports & Exercise 44, 3 (2012), 509--515.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1975. Play and intrinsic rewards. Journal of Humanistic Psychology (1975).",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 1985. Intrinsic motivation and self-determination in human behavior. Springer.",
      "doi": ""
    },
    {
      "text": "Rod K Dishman. 1988. Exercise adherence: Its impact on public health. Human Kinetics.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick. 1999. A review of self modeling and related interventions. Applied and Preventive Psychology 8, 1 (1999), 23--39.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick. 2012a. Self model theory: Learning from the future. Wiley Interdisciplinary Reviews: Cognitive Science 3, 2 (2012), 215--230.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick. 2012b. Self modeling: Expanding the theories of learning. Psychology in the Schools 49, 1 (2012), 30--41.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick and Simon J Biggs. 1983. Using video: Psychological and social applications. Wiley.",
      "doi": ""
    },
    {
      "text": "Trevor Egli, Helen W Bland, Bridget F Melton, and Daniel R Czech. 2011. Influence of age, sex, and race on college students' exercise motivation of physical activity. Journal of American College Health 59, 5 (2011), 399--406.",
      "doi": ""
    },
    {
      "text": "Panteleimon Ekkekakis, Eric E Hall, and Steven J Petruzzello. 2008. The relationship between exercise intensity and affective responses demystified: to crack the 40-year-old nut, replace the 40-year-old nutcracker! Annals of Behavioral Medicine 35, 2 (2008), 136--149.",
      "doi": ""
    },
    {
      "text": "Stefan Engeser. 2012. Advances in flow research. Springer.",
      "doi": ""
    },
    {
      "text": "Samantha Finkelstein, Andrea Nickel, Zachary Lipps, Tiffany Barnes, Zachary Wartell, and Evan A Suma. 2011. Astrojumper: Motivating exercise with an immersive virtual reality exergame. Presence: Teleoperators and Virtual Environments 20, 1 (2011), 78--92.",
      "doi": "10.5555/3116694.3116701"
    },
    {
      "text": "Canadian Fitness and Lifestyle Research Institute. 2005. 2005 Physical Activity Monitor. (2005).",
      "doi": ""
    },
    {
      "text": "Diarmaid Fitzgerald, Nanthana Trakarnratanakul, Barry Smyth, and Brian Caulfield. 2010. Effects of a wobble board-based therapeutic exergaming system for balance training on dynamic postural stability and intrinsic motivation levels. Journal of Orthopaedic & Sports Physical Therapy 40, 1 (2010), 11--19.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. 2008. US Department of Health and Human Services Physical activity guidelines for Americans 2008. (2008).",
      "doi": ""
    },
    {
      "text": "Ian M Franks and LJ Maile. 1991. The use of video in sport skill acquisition. Practical guide to using video in the behavioral sciences (1991), 231--243.",
      "doi": ""
    },
    {
      "text": "Christina M Frederick and Richard M Ryan. 1993. Differences in motivation for sport and exercise and their relations with participation and mental health. Journal of Sport Behavior 16, 3 (1993), 124.",
      "doi": ""
    },
    {
      "text": "Martin J Gibala, Jenna B Gillen, and Michael E Percival. 2014. Physiological and health-related adaptations to low-volume interval training: influences of nutrition and sex. Sports Medicine 44, 2 (2014), 127--137.",
      "doi": ""
    },
    {
      "text": "Martin J Gibala, Jonathan P Little, Maureen J MacDonald, and John A Hawley. 2012. Physiological adaptations to low-volume, high-intensity interval training in health and disease. Journal of Physiology 590, 5 (2012), 1077--1084.",
      "doi": ""
    },
    {
      "text": "Martin J Gibala and Sean L McGee. 2008. Metabolic adaptations to short-term high-intensity interval training: a little pain for a lot of gain? Exercise and Sport Sciences Reviews 36, 2 (2008), 58--63.",
      "doi": ""
    },
    {
      "text": "Benoît R Gonzales, Vincent Hagin, Peter W Dowrick, and Alain Groslambert. 2015. Effects of Various Cognitive Video Stimulations on the Measured Stamina of Runners. Sport Psychologist 29, 4 (2015), 335--343.",
      "doi": ""
    },
    {
      "text": "Bryan L Haddock, Sarah Jarvis, Nicholas R Klug, Tarah Gonzalez, Bryan Barsaga, Shannon R Siegel, and Linda D Wilkin. 2012. Measurement of energy expenditure while playing exergames at a self-selected intensity. Open Sports Sciences Journal 5 (2012), 1--6.",
      "doi": ""
    },
    {
      "text": "Kristoffer Hagen, Konstantinos Chorianopoulos, Alf Inge Wang, Letizia Jaccheri, and Stian Weie. 2016. Gameplay as exercise. In Proc. CHI Extended Abstracts. ACM, 1872--1878.  ",
      "doi": "10.1145/2851581.2892515"
    },
    {
      "text": "Maria Hagströmer, Pekka Oja, and Michael Sjöström. 2006. The International Physical Activity Questionnaire (IPAQ): a study of concurrent and construct validity. Public Health Nutrition 9, 6 (2006), 755--762.",
      "doi": ""
    },
    {
      "text": "Robin Hunicke, Marc LeBlanc, and Robert Zubek. 2004. MDA: A formal approach to game design and game research. In Proc. AAAI Workshop on Challenges in Game AI, Vol. 4. 1722.",
      "doi": ""
    },
    {
      "text": "Wijnand Ijsselsteijn, Yvonne De Kort, Ronald Bonants, Marco De Jager, and Joyce Westerink. 2004. Virtual Cycling: Effects of immersion and a virtual coach on motivation and presence in a home fitness application. In Proc. Virtual Reality Design and Evaluation Workshop. 22--23.",
      "doi": ""
    },
    {
      "text": "Omri Inbar, Oded Bar-Or, and James S Skinner. 1996. The Wingate anaerobic test. Wiley.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Anna L Cox, Paul Cairns, Samira Dhoparee, Andrew Epps, Tim Tijs, and Alison Walton. 2008. Measuring and defining the experience of immersion in games. International Journal of Human-Computer Studies 66, 9 (2008), 641--661.  ",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "James H Johnson and Donald S Siegel. 1992. Effects of association and dissociation on effort perception. Journal of Sport Behavior 15, 2 (1992), 119.",
      "doi": ""
    },
    {
      "text": "Hollie S Jones, Emily L Williams, Craig A Bridge, Dave Marchant, Adrian W Midgley, Dominic Micklewright, and Lars R Mc Naughton. 2013. Physiological and psychological effects of deception on pacing strategy and performance: a review. Sports Medicine 43, 12 (2013), 1243--1257.",
      "doi": ""
    },
    {
      "text": "Hollie S Jones, Emily L Williams, David Marchant, S Andy Sparks, Craig A Bridge, Adrian W Midgley, and Lars R Mc Naughton. 2016a. Improvements in cycling time trial performance are not sustained following the acute provision of challenging and deceptive feedback. Frontiers in Physiology 7 (2016).",
      "doi": ""
    },
    {
      "text": "Hollie S Jones, Emily L Williams, David C Marchant, S Andy Sparks, Craig A Bridge, Adrian W Midgley, and Lars R Mc Naughton. 2016b. Deception has no acute or residual effect on cycling time trial performance but negatively effects perceptual responses. Journal of Science and Medicine in Sport 19, 9 (2016), 771--776.",
      "doi": ""
    },
    {
      "text": "Mary E Jung, Jessica E Bourne, and Jonathan P Little. 2014. Where does HIT fit? An examination of the affective response to high-intensity intervals in comparison to continuous moderate-and continuous vigorous-intensity exercise in the exercise intensity-affect continuum. PLoS One 9, 12 (2014).",
      "doi": ""
    },
    {
      "text": "Mallory Ketcheson, Zi Ye, and TC Graham. 2015. Designing for exertion: how heart-rate power-ups increase physical activity in exergames. In Proc. Annual Symposium on Computer-Human Interaction in Play. ACM, 79--89.  ",
      "doi": "10.1145/2793107.2793122"
    },
    {
      "text": "Jonna Koivisto and Juho Hamari. 2014. Demographic differences in perceived benefits from gamification. Computers in Human Behavior 35 (2014), 179--188.",
      "doi": ""
    },
    {
      "text": "Paul B Laursen and David G Jenkins. 2002. The scientific basis for high-intensity interval training. Sports Medicine 32, 1 (2002), 53--73.",
      "doi": ""
    },
    {
      "text": "I-Min Lee, Eric J Shiroma, Felipe Lobelo, Pekka Puska, Steven N Blair, Peter T Katzmarzyk, Lancet Physical Activity Series Working Group, and others. 2012. Effect of physical inactivity on major non-communicable diseases worldwide: an analysis of burden of disease and life expectancy. Lancet 380, 9838 (2012), 219--229.",
      "doi": ""
    },
    {
      "text": "Emmanuel Lesaffre. 2008. Superiority, equivalence, and non-inferiority trials. Bulletin of the NYU Hospital for Joint Diseases 66, 2 (2008), 150--154.",
      "doi": ""
    },
    {
      "text": "Andrew Macvean and Judy Robertson. 2013. Understanding exergame users' physical activity, motivation and behavior over time. In Proc. CHI. ACM, 1251--1260.  ",
      "doi": "10.1145/2470654.2466163"
    },
    {
      "text": "Tímea Magyaródi, Henriett Nagy, Péter Soltész, Tamás Mózes, and Attila Oláh. 2013. Psychometric properties of a newly established flow state questionnaire. The Journal of Happiness & Well-Being 1, 2 (2013), 85--96.",
      "doi": ""
    },
    {
      "text": "Peter J Maud and Barry B Shultz. 1986. Gender comparisons in anaerobic power and anaerobic capacity tests. British Journal of Sports Medicine 20, 2 (1986), 51--54.",
      "doi": ""
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Research Quarterly for Exercise and Sport 60, 1 (1989), 48--58.",
      "doi": ""
    },
    {
      "text": "Elisa D Mekler, Florian Brühlmann, Alexandre N Tuch, and Klaus Opwis. 2015. Towards understanding the effects of individual gamification elements on intrinsic motivation and performance. Computers in Human Behavior (2015).  ",
      "doi": "10.1016/j.chb.2015.08.048"
    },
    {
      "text": "Richard S Metcalfe, John A Babraj, Samantha G Fawkner, and Niels BJ Vollaard. 2012. Towards the minimal amount of exercise for improving metabolic health: beneficial effects of reduced-exertion high-intensity interval training. European Journal of Applied Physiology 112, 7 (2012), 2767--2775.",
      "doi": ""
    },
    {
      "text": "Trine Moholdt, Stian Weie, Konstantinos Chorianopoulos, Alf Inge Wang, and Kristoffer Hagen. 2017. Exergaming can be an innovative way of enjoyable high-intensity interval training. BMJ Open Sport & Exercise Medicine 3, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Javier Monedero, Elizabeth J Lyons, and Donal J O'Gorman. 2015. Interactive video game cycling leads to higher energy expenditure and is more enjoyable than conventional exercise in adults. PloS One 10, 3 (2015).",
      "doi": ""
    },
    {
      "text": "Muriel Niederle and Lise Vesterlund. 2007. Do women shy away from competition? Do men compete too much? Quarterly Journal of Economics 122, 3 (2007), 1067--1101.",
      "doi": ""
    },
    {
      "text": "Stephen R Norris and Stewart R Petersen. 1998. Effects of endurance training on transient oxygen uptake responses in cyclists. Journal of Sports Sciences 16, 8 (1998), 733--738.",
      "doi": ""
    },
    {
      "text": "US Department of Health and Human Services. 2013. Healthy people 2010: Final review.",
      "doi": ""
    },
    {
      "text": "American College of Sports Medicine. 2017. ACSM's guidelines for exercise testing and prescription. Lippincott Williams & Wilkins.",
      "doi": ""
    },
    {
      "text": "Stephen Olejnik, James Algina, and others. 2003. Generalized eta and omega squared statistics: measures of effect size for some common research designs. Psychological Methods 8, 4 (2003), 434--447.",
      "doi": ""
    },
    {
      "text": "Bruno RR Oliveira, Fabian A Slama, Andrea C Deslandes, Elen S Furtado, and Tony M Santos. 2013. Continuous and high-intensity interval training: which promotes higher pleasure? PLoS One 8, 11 (2013).",
      "doi": ""
    },
    {
      "text": "Wei Peng, Jih-Hsuan Lin, and Julia Crouse. 2011. Is playing exergames really exercising? A meta-analysis of energy expenditure in active video games. Cyberpsychology, Behavior, and Social Networking 14, 11 (2011), 681--688.",
      "doi": ""
    },
    {
      "text": "Rachel M Perron, Courtney A Graham, Jamie R Feldman, Rebecca A Moffett, and Eric E Hall. 2011. Do exergames allow children to achieve physical activity intensity commensurate with national guidelines? International Journal of Exercise Science 4, 4 (2011), 257.",
      "doi": ""
    },
    {
      "text": "Johnmarshall Reeve and Edward L Deci. 1996. Elements of the competitive situation that affect intrinsic motivation. Personality and Social Psychology Bulletin 22, 1 (1996), 24--33.",
      "doi": ""
    },
    {
      "text": "Ann Reinthal, Kathy Szirony, Cindy Clark, Jeffrey Swiers, Michelle Kellicker, and Susan Linder. 2012. ENGAGE: guided activity-based gaming in neurorehabilitation after stroke: a pilot study. Stroke Research and Treatment 2012 (2012).",
      "doi": ""
    },
    {
      "text": "Richard M Ryan. 1982. Control and information in the intrapersonal sphere: An extension of cognitive evaluation theory. Journal of Personality and Social Psychology 43, 3 (1982), 450--461.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Intrinsic and extrinsic motivations: Classic definitions and new directions. Contemporary Educational Psychology 25, 1 (2000), 54--67.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, Christina M Frederick, Deborah Lepes, Noel Rubio, and Kennon M Sheldon. 1997. Intrinsic motivation and exercise adherence. International Journal of Sport Psychology 28, 4 (1997), 335--354.",
      "doi": ""
    },
    {
      "text": "Jennifer Schumi and Janet T Wittes. 2011. Through the looking glass: understanding non-inferiority. Trials 12, 1 (2011), 106.",
      "doi": ""
    },
    {
      "text": "Lindsay A Shaw, Jude Buckley, Paul M Corballis, Christof Lutteroth, and Burkhard C Wünsche. 2016. Competition and cooperation with virtual players in an exergame. PeerJ Computer Science 2 (2016).",
      "doi": ""
    },
    {
      "text": "Lindsay A Shaw, Burkhard C Wünsche, Christof Lutteroth, Stefan Marks, Jude Buckley, and Paul Corballis. 2015b. Development and Evaluation of an Exercycle Game Using Immersive Technologies. In Proc. Australasian Workshop on Health Informatics and Knowledge Management (HIKM). Australian Computer Society, 75--85.",
      "doi": ""
    },
    {
      "text": "Lindsay A Shaw, Burkhard C Wünsche, Christof Lutteroth, Stefan Marks, and Rodolphe Callies. 2015a. Challenges in Virtual Reality Exergame Design. In Proc. Australasian User Interface Conference (AUIC). Australian Computer Society, 61--68.",
      "doi": ""
    },
    {
      "text": "Ren-Jay Shei, Emily M Adamic, John S Raglin, Kevin G Thompson, and Timothy D Mickleborough. 2017. Commentary: Improvements in Cycling Time Trial Performance Are Not Sustained Following the Acute Provision of Challenging and Deceptive Feedback. Frontiers in Physiology 8 (2017).",
      "doi": ""
    },
    {
      "text": "Jeff Sinclair, Philip Hingston, and Martin Masek. 2009. Exergame development using the dual flow model. In Proc. Australasian Conference on Interactive Entertainment. ACM.  ",
      "doi": "10.1145/1746050.1746061"
    },
    {
      "text": "Joanna Starek and Penny McCullagh. 1999. The effect of self-modeling on the performance of beginning swimmers. Sport Psychologist 13, 3 (1999), 269--287.",
      "doi": ""
    },
    {
      "text": "Kylie A Steel, Roger D Adams, Susan E Coulson, Colleen G Canning, and Holly J Hawtin. 2013. Video self-model training of punt kicking. International Journal of Sport and Health Science 11 (2013), 49--53.",
      "doi": ""
    },
    {
      "text": "Jeroen Swart, Robert Patrick Lamberts, Michael Ian Lambert, Estelle Vicki Lambert, Richard William Woolrich, Susan Johnston, and Timothy David Noakes. 2009. Exercising with reserve: exercise regulation by perceived exertion in relation to duration of exercise and knowledge of endpoint. British Journal of Sports Medicine 43, 10 (2009), 775--781.",
      "doi": ""
    },
    {
      "text": "Scott Thomas, Jeff Reading, and Roy J Shephard. 1992. Revision of the Physical Activity Readiness Questionnaire (PAR-Q). Canadian Journal of Sport Sciences (1992).",
      "doi": ""
    },
    {
      "text": "Jacob S Thum, Gregory Parsons, Taylor Whittle, and Todd A Astorino. 2017. High-Intensity Interval Training Elicits Higher Enjoyment than Moderate Intensity Continuous Exercise. PloS One 12, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Jill Tracey. 2011. Benefits and usefulness of a personal motivation video: A case study of a professional mountain bike racer. Journal of Applied Sport Psychology 23, 3 (2011), 308--325.",
      "doi": ""
    },
    {
      "text": "Kelly A Vertes and Diane M Ste-Marie. 2013. Trampolinists' self-controlled use of a feedforward self-modeling video in competition. Journal of Applied Sport Psychology 25, 4 (2013), 463--477.",
      "doi": ""
    },
    {
      "text": "Emily L Williams, Hollie S Jones, S Andy Sparks, David C Marchant, Adrian W Midgley, and Lars R Mc Naughton. 2015. Competitor presence reduces internal attentional focus and improves 16.1 km cycling time trial performance. Journal of Science and Medicine in Sport 18, 4 (2015), 486--491.",
      "doi": ""
    },
    {
      "text": "Gareth Williams and Gema Frühbeck. 2009. Obesity: Science to practice. Wiley.",
      "doi": ""
    },
    {
      "text": "Soojeong Yoo, Tristan Heywood, Lie Ming Tang, Bob Kummerfeld, and Judy Kay. 2017. Towards a Long Term Model of Virtual Reality Exergame Exertion. In Proc. Conference on User Modeling, Adaptation and Personalization. ACM, 247--255.  ",
      "doi": "10.1145/3079628.3079679"
    },
    {
      "text": "Sue Ziebland, Margaret Thorogood, Pat Yudkin, Lesley Jones, and Angela Coulter. 1998. Lack of willpower or lack of wherewithal? \"Internal\" and \"external\" barriers to changing diet and exercise in a three year follow-up of participants in a health check. Social Science & Medicine 46, 4--5 (1998), 461--465.",
      "doi": ""
    }
  ]
}