{
  "doi": "10.1145/3173574.3173580",
  "title": "Patterns for How Users Overcome Obstacles in Voice User Interfaces",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-7",
  "year": 2018,
  "badges": [],
  "abstract": "Voice User Interfaces (VUIs) are growing in popularity. However, even the most current VUIs regularly cause frustration for their users. Very few studies exist on what people do to overcome VUI problems they encounter, or how VUIs can be designed to aid people when these problems occur. In this paper, we analyze empirical data on how users (n=12) interact with our VUI calendar system, DiscoverCal, over three sessions. In particular, we identify the main obstacle categories and types of tactics our participants employ to overcome them. We analyzed the patterns of how different tactics are used in each obstacle category. We found that while NLP Error obstacles occurred the most, other obstacles are more likely to frustrate or confuse the user. We also found patterns that suggest participants were more likely to employ a \"guessing\" approach rather than rely on visual aids or knowledge recall.",
  "authors": [
    {
      "name": "Chelsea Myers",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658651163",
      "orcid": "missing"
    },
    {
      "name": "Anushay Furqan",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162068",
      "orcid": "missing"
    },
    {
      "name": "Jessica Nebolsky",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659244224",
      "orcid": "missing"
    },
    {
      "name": "Karina Caro",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87358741257",
      "orcid": "missing"
    },
    {
      "name": "Jichen Zhu",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488646953",
      "orcid": "0000-0001-6740-4550"
    }
  ],
  "references": [
    {
      "text": "Matthew P Aylett, Per Ola Kristensson, Steve Whittaker, and Yolanda Vazquez-Alvarez. 2014. None of a CHInd: Relationship Counselling for HCI and Speech Technology. CHI '14 Extended Abstracts on Human Factors in Computing Systems (2014), 749--760.  ",
      "doi": "10.1145/2559206.2578868"
    },
    {
      "text": "Eric Corbett and Astrid Weber. 2016. What can I say? Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '16 (2016), 72--82.  ",
      "doi": "10.1145/2935334.2935386"
    },
    {
      "text": "Anushay Furqan, Chelsea Myers, and Jichen Zhu. 2017. Learnability through Adaptive Discovery Tools in Voice User Interfaces. Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17 (2017), 1617--1623.  ",
      "doi": "10.1145/3027063.3053166"
    },
    {
      "text": "Jonathan Huyghe, Jan Derboven, and Dirk De Grooff. 2014. ALADIN: Demo of a Multimodal Adaptive Voice Interface. Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (2014), 1035--1038.  ",
      "doi": "10.1145/2639189.2670269"
    },
    {
      "text": "Clare M Karat, Christine Halverson, Daniel Horn, and John Karat. 1999. Patterns of entry and correction in large vocabulary continuous speech recognition systems. Proceedings of the SIGCHI conference on Human factors in computing systems: the CHI is the limit (1999), 568--575.  ",
      "doi": "10.1145/302979.303160"
    },
    {
      "text": "Lewis R. Karl, Michael Pettey, and Ben Shneiderman. 1993. Speech versus mouse commands for word processing: an empirical evaluation. International Journal of Man-Machine Studies 39, 4 (oct 1993), 667--687.  ",
      "doi": "10.1006/imms.1993.1078"
    },
    {
      "text": "Ranjitha Gurunath Kulkarni, Ahmed El Kholy, Ziad Al Bawab, Noha Alon, Imed Zitouni, Umut Ozertem, and Shuangyu Chang. 2017. Hyperarticulation Detection in Repetitive Voice Queries Using Pairwise Comparison for Improved Speech Recognition. (2017), 4985--4989.",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Gabriel Lyons, Vinh Tran, Carsten Binnig, Ugur Cetintemel, and Tim Kraska. 2016. Making the case for Query-by-Voice with EchoQuery. Sigmod (2016), 2129--2132.  ",
      "doi": "10.1145/2882903.2899394"
    },
    {
      "text": "Amanda Purington, Jessie G. Taft, Shruti Sannon, Natalya N. Bazarova, and Samuel Hardman Taylor. 2017. \"Alexa is my new BFF\". Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17 (2017), 2853--2859.  ",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Pernilla Qvarfordt, Arne Jönsson, and Nils Dahlbäck. 2003. The Role of Spoken Feedback in Experiencing Multimodal Interfaces as Human-like. Proceedings of the 5th international conference on Multimodal interfaces ICMI 03 (2003), 250--257.  ",
      "doi": "10.1145/958432.958478"
    },
    {
      "text": "Xin Rong, Adam Fourney, Robin N Brewer, Meredith Ringel Morris, and Paul N Bennett. 2017. Managing Uncertainty in Time Expressions for Virtual Assistants. Acm (2017), 568--579.  ",
      "doi": "10.1145/3025453.3025674"
    },
    {
      "text": "Nicole Shechtman and Leonard M Horowitz. 2003. Media Inequality in Conversation. Proceedings of the conference on Human factors in computing systems - CHI '03 5 (2003), 281--288.  ",
      "doi": "10.1145/642611.642661"
    },
    {
      "text": "Ben Shneiderman. 2000. The limits of speech recognition. Commun. ACM 43, 9 (2000), 63--65.  ",
      "doi": "10.1145/348941.348990"
    },
    {
      "text": "Amanda J. Stent, Marie K. Huffman, and Susan E. Brennan. 2008. Adapting speaking after evidence of misrecognition: Local and global hyperarticulation. Speech Communication 50, 3 (2008), 163--178.  ",
      "doi": "10.1016/j.specom.2007.07.005"
    },
    {
      "text": "A. Strauss and J. Corbin. 1998. Basics of Qualitative Research: Techniques and Procedures for developing grounded theory. (second ed.). SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Yu Zhong, T V Raman, Casey Burkhardt, Fadi Biadsy, and Jeffrey P Bigham. 2014. JustSpeak: Enabling Universal Voice Control on Android. Proceedings of the 11th Web for All Conference on - W4A '14 (2014), 1--4.  ",
      "doi": "10.1145/2596695.2596720"
    }
  ]
}