{
  "doi": "10.1145/3173574.3173613",
  "title": "Practices and Technology Needs of a Network of Farmers in Tharaka Nithi, Kenya",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "Farmers in rural areas of Kenya generally rely on traditional agricultural practices inherited from past generations. However, population increases and climate changes have put pressure on resources such as land and water. These resource pressures have created a need to broaden and expand farming practices. We conducted an exploratory study with farmers in Tharaka Nithi, Kenya to explore their practices, if and how they used ICT, and how the technologies used might be designed to aid their practices, if at all. Overall, our results show that farmers desired more knowledge to enable them apply ICT interventions in ways that improved yields. Farmers were also interested in accessing information on soil fertility, water predictability and market opportunities. These findings suggest opportunities for technology design to support farming practices among rural communities in rural settings. We also articulate social challenges that designers will face when thinking about coming up with such solutions.",
  "authors": [
    {
      "name": "Erick Oduor",
      "institution": "IBM Research Africa, Nairobi, Kenya",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548358456",
      "orcid": "missing"
    },
    {
      "name": "Peninah Waweru",
      "institution": "IBM Research Africa, Nairobi, Kenya",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260356",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Lenchner",
      "institution": "IBM Research Africa, Nairobi, Kenya",
      "img": "/do/10.1145/contrib-81314490298/rel-imgonly/jon-2-croppedx2.jpg",
      "acmid": "81314490298",
      "orcid": "missing"
    },
    {
      "name": "Carman Neustaedter",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    }
  ],
  "references": [
    {
      "text": "Joy Selasi Afenyo (2012). Making small-scale farming work in sub-Saharan Africa. In Global Forum on Food Security and Nutrition \"FSN Forum\", FAO.",
      "doi": ""
    },
    {
      "text": "Sheetal K. Agarwal, Arun Kumar, Amit Anil Nanavati, and Nitendra Rajput (2009) User-Generated Content Creation and Dissemination in Rural Areas. Proc. of the 3rd international conference on Information communication technology and development ICTD 5665. IEEE Press Piscataway, NJ, USA",
      "doi": ""
    },
    {
      "text": "Chepkoech Anita (2015) Basic Things You Need To Know Before Starting Agrovet.http://www.nation.co.ke/business/seedsofgold/ Secrets-of-running-agrovet-successfully/23012382842598-kajwdn/index.html. Daily Nation, Accessed 19th September 2016.",
      "doi": ""
    },
    {
      "text": "Bidogeza, J., Berentsen, P., Graaff, J., & Lansink, A. (2015). Potential impact of alternative aricultural technologies to ensure food security and raise income of farm households in Rwanda. Forum for Development Studies. Vol 42, Issue 1.",
      "doi": ""
    },
    {
      "text": "Nicola J Bidwell, Simon Robinson, Elina Vartiainen, Matt Jones, Masbulele J Siya, Thomas Reitmaier, Gary Marsden and Mounia Lalmas (2014) Designing social media for community information sharing in rural South Africa. In: Proceedings of SAICIT 2014. ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=2664591.2664615  ",
      "doi": "10.1145/2664591.2664615"
    },
    {
      "text": "Nicola J Bidwell, Masbulele Siya, Marsden, Gary Marsden, William D Tucker, M. Tshemese, S. Ntlangano, Simon Robinson, Kristen Ali Eglinton (2013) Walking the Social Life of Solar Charging. ACM Transactions on Computer-Human Interactions 20, 4, 1--33. https://dl.acm.org/citation.cfm?doid=2509404.2493524  ",
      "doi": "10.1145/2493524"
    },
    {
      "text": "Jenna Burrell and Kentaro Toyama, (2009). What constitutes good ICTD research? Annenberg School for Communication 5(3), 82--94 https://pdfs.semanticscholar.org/2e59/a69dffc527a2444 83052bd9b7f973e894192.pdf",
      "doi": ""
    },
    {
      "text": "Jenna Burrell and Elisa Oreglia (2013). The Myth of Market Price Information: Mobile Phones and Epistemology in ICTD. Working Paper No 1, Beyond Market Prices Project, UC Berkeley. https://markets.ischool.berkeley.edu/files/2015/02/Myt hOfMarketPrice_wp.pdf",
      "doi": ""
    },
    {
      "text": "W. Thomas Conelly and Miriam S. Chaiken (2000). Intensive Farming, Agro-Diversity, and Food Security under Conditions of Extreme Population Pressure in Western Kenya. Human Ecology Vol. 28, No. 1, pp. 19--51. http://www.jstor.org/stable/4603343",
      "doi": ""
    },
    {
      "text": "Bill Cook and Uma Kothari (2001) Participation: The new Tyranny. Zed Books London.",
      "doi": ""
    },
    {
      "text": "Kevin Donovan (2017)\"Anytime, Anywhere: Mobile Devices and Services and their Impact on Agriculture and Rural Development,\" in ICT in Agriculture: Connecting Smallholders to Knowledge, Networks, and Institutions, World Bank, Washington, D.C., 4970.",
      "doi": ""
    },
    {
      "text": "Cheryl R. Doss \"Designing agricultural technology for African women farmers: Lessons from 25 years of experience.\" World development 29.12 (2001): 20752092.",
      "doi": ""
    },
    {
      "text": "Rikin Gandhi, Rajesh Veeraraghavan, Kentaro Toyama and Vanaja Ramprasad, V. (2009). Digital Green: Participatory video and mediated instruction for agricultural extension. USC Annenberg School for Communication 5(1): 1--15. http://itidjournal.org/itid/article/view/322",
      "doi": ""
    },
    {
      "text": "Dean M. G. Hargreaves Bob R. L. McCown (2008) Low-Cost, Low-Bandwidth Online Meetings Between Farmers and Scientists. Proceedings of the OzCHI 2008.  ",
      "doi": "10.1145/1517744.1517776"
    },
    {
      "text": "Kagonya Awori, Frank Vetere, Wally Smith (2015) Transnationalism, indigenousknowledgeand technology: insightsfrom theKenyan Diaspora. In: Proceedings of the CHI. ACM Press, NY, USA https://dl.acm.org/citation.cfm?doid=2702123.2702488  ",
      "doi": "10.1145/2702123.2702488"
    },
    {
      "text": "Stephanie Kethers, Dean Hargreaves and Ross Wilkinson (2004) Remote Meetings Between Farmers and Researchers -- A Case Study on Asymmetry. Proceedings of the CSCW. ACM Press. NY, USA, https://dl.acm.org/citation.cfm?doid=1031607.1031714  ",
      "doi": "10.1145/1031607.1031714"
    },
    {
      "text": "Kituyi Kwake A., Adigun M. O (2008). Analyzing ICT useand access' amongst rural women in Kenya. International Journal of Education Developing Using Information Communication Technology 4(4): 127--",
      "doi": ""
    },
    {
      "text": "Travis Lybbert and Daniel Sumner (2010). Agricultural technologies for climate change mitigation and adaptation in developing countries: policy options for innovation and technology diffusion. International Centre for Trade and Sustainable Development Issue Brief No. 6. https://www.ictsd.org/downloads/2010/06/agriculturaltechnologies-for-climate-change-mitigation-andadaptation-in-developing-countries_web.pdf",
      "doi": ""
    },
    {
      "text": "Brandie Lee Martin and Eric Abbott (2011) Mobile Phones and Rural Livelihoods: Diffusion, Uses, and Perceived Impacts Among Farmers in Rural Uganda. Information Technologies & International Development, Volume 7, Number 4, 17--34. http://itidjournal.org/itid/article/view/789",
      "doi": ""
    },
    {
      "text": "Andrew Maunder, Gary Marsden and Richard Harper (2011) Making the link- providing mobile media for novice communities in the developing world. International Journal Human Computing Volume 9,10, Pages 647--657. http://www.sciencedirect.com/science/article/pii/S1071 581910001667?via%3Dihub  ",
      "doi": "10.1016/j.ijhcs.2010.12.009"
    },
    {
      "text": "Nakul Gupta, Indrani Medhi-Thies I, Pedro Ferreira, Gupta N, Jacki O'Neill, Cutrell E (2015) KrishiPustak: a social networking system for low-literate farmers. In: Proceedings of the CSCW. ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=2685553.2702683  ",
      "doi": "10.1145/2685553.2702683"
    },
    {
      "text": "Indrani Medhi, Sameni Patnaik, Emma Brunskill, E., S. N. Ngasena Gautama, William Thies and Kentaro Toyama (2011) Designing mobile interfaces for novice and low-literacy users. TOCHI 18, 1 (2011). ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=1959022.1959024  ",
      "doi": "10.1145/1959022.1959024"
    },
    {
      "text": "David R. Millen (2010) Rapid ethnography: Time deepening strategies for HCI field research. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques (pp. 280--286). ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=347642.347763  ",
      "doi": "10.1145/347642.347763"
    },
    {
      "text": "Eduardo Nakasone, Maximo Torero and Bart Minten 2014. The power of information: The ICT revolution in agricultural development. Annual Review of Resource Economics 6, 533--550.",
      "doi": ""
    },
    {
      "text": "Justice Nyamangara, L. F. Bergström, M. I. Piha, and K. E. Giller (2003). Fertilizer use efficiency and nitrate leaching in a tropical sandy soil. Journal of Environmental Quality 32, 599--606.",
      "doi": ""
    },
    {
      "text": "William Odom (2010) \"Mate, we don't need a chip to tell us the soil's dry\" Opportunities for Designing Interactive Systems to Support Urban Food Production. In proceedings of Designing Interactive Systems. DIS '10. ACM Press, NY, USA. Pages 232--235 https://dl.acm.org/citation.cfm?doid=1858171.1858211  ",
      "doi": "10.1145/1858171.1858211"
    },
    {
      "text": "Erick Oduor, Carman Neustaedter, Serena Hillman and Carolyn Pang (2013) Family communication in rural and slum regions of Kenya. In: Ext Abstracts in the Proceedings of CHI. ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=2468356.2468508  ",
      "doi": "10.1145/2468356.2468508"
    },
    {
      "text": "Erick Oduor, Carman Neustaedter, Tejinder Judge, Kate Hennessey, Serena Hillman and Carolyn Pang (2014) How technology supports family communication in rural, suburban, and urban Kenya. In: Proceedings of the CHI. ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=2556288.2557277  ",
      "doi": "10.1145/2556288.2557277"
    },
    {
      "text": "Erick Oduor, Carman Neustaedter and Kate Hennessy (2016) The Design and Evaluation of a PhotographSharing Application for Rural and Urban Kenyan Families. In Personal and Ubiquitous Computing, 20.615--633. Springer Verlag, London, UK. https://link.springer.com/article/10.1007%2Fs00779016-0930-z  ",
      "doi": "10.1007/s00779-016-0930-z"
    },
    {
      "text": "Julius Juma Okello, Oliver Kirui, Georgina Wambui Njiraini, and Zachary Gitonga (2012). Drivers of use of information and communication technologies by farm households: The case of smallholder farmers in Kenya. Journal of Agricultural Science Vol 4, No. 2: 111 -124.",
      "doi": ""
    },
    {
      "text": "Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, Tapan S. Parikh (2010) Avaaj Otalo-a field study of an interactive voice forum for small farmers in rural India. In: Proceedings of the CHI. ACM, NY, USA.  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Alex Pentland, Richard Fletcher and Amir Hasson (2004) DakNet: Rethinking connectivity in developing nations. Published by the IEEE Computer Society Vol 37, Issue 1. http://ieeexplore.ieee.org/document/1319279/  ",
      "doi": "10.1109/MC.2004.1260729"
    },
    {
      "text": "Nimmi Rangaswamy, Nithya Sambasivan (2011) Cutting Chaai, Jugaad and Here Pheri: towards UbiComp for a global community. Personal Ubiquitous Computing Volume 15, Issue 6, Pages 553--564. Springer Verlag, London, UK. https://link.springer.com/article/10.1007%2Fs00779010-0349-x  ",
      "doi": "10.1007/s00779-010-0349-x"
    },
    {
      "text": "Sambasivan, N., Rangaswamy, N., Toyama, K., and Nardi, B. Encountering Development Ethnographically. Volume 15, Issue 6. Pages 20--23. ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=1620693.1620698  ",
      "doi": "10.1145/1620693.1620698"
    },
    {
      "text": "Regina Scheyvens (2014) Development Field Work: A practical Guide. Sage Publishers.",
      "doi": ""
    },
    {
      "text": "Shamba Shape Up. https://shambashapeup.com/",
      "doi": ""
    },
    {
      "text": "Jolynna Siananan (2008) Social tools and social capital: reading mobile phone usage in rural indigenous communities. In Proceedings of the OZCHI. ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=1517744.1517775  ",
      "doi": "10.1145/1517744.1517775"
    },
    {
      "text": "Thomas, N. Smyth, Satish Kumar, Indrani Medhi and Kentaro Toyama, Where There's a Will There's a Way: Mobile Media Sharing in Urban India. Proceedings of CHI. ACM, NY, USA, 753--762. Pages 267--270. https://dl.acm.org/citation.cfm?doid=1753326.1753436  ",
      "doi": "10.1145/1753326.1753436"
    },
    {
      "text": "Dunstan Spencer (2001). Will they survive? Prospects for small farmers in sub-Saharan Africa. Panel Discussion on Will they survive? Prospects for small farmers in sub-Saharan Africa. Sustainable Food Security for All by 2020Sustainable Food Security for All by 2020, IFPRI.",
      "doi": ""
    },
    {
      "text": "Souleymane Camara and Jose Abdelnour-Nocera (2013) Revealing the Socio-Technical Context of Design Settings: Toward Participatory IS Design. International Journal of Human-Computer Interaction Volume 29, 2013 - Issue 4: Reframing HCI Through Local and Indigenous Perspectives.",
      "doi": ""
    },
    {
      "text": "Huub Spiertz (2012). Avenues to meet food security. The role of agronomy on solving complexity in food production and resource use. European Journal of Agronomy 43, 1--8. DIS: 10.1016/j.eja.2012.04.004",
      "doi": ""
    },
    {
      "text": "Anselm Strauss, Juliet Corbin (1998) Basics of qualitative research, 2nd edition. Sage, Beverley Hills",
      "doi": ""
    },
    {
      "text": "Alex Taylor (2011) Out There. Proceedings of the Conference on Computer Human Interaction (CHI). ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=1978942.1979042",
      "doi": ""
    },
    {
      "text": "Tharaka Nithi. https://tharakanithi.go.ke/. Accessed 18th Dec 2017",
      "doi": ""
    },
    {
      "text": "Kevin Walker, Joshua Underwood, Tim Waema, Lynne Dunkley, Jose Abdelnour-Nocera, Rosemary Luckin, Cecilia Oyugi and Souleymane Camara (2008). A resource kit for participatory socio-technical design in rural Kenya. ACM, NY, USA. https://dl.acm.org/citation.cfm?doid=1358628.1358749  ",
      "doi": "10.1145/1358628.1358749"
    },
    {
      "text": "Mattia Zeni, Elizabeth Ondula, Reagan Mbitiru, Lianna Samuel, Kala and Komminist Weldemariam. (2015). Low-power Low-cost Wireless Sensors for Real-time Plant Stress Detection. In Proceedings of the 2015 Annual Symposium on Computing for Development DEV '1. https://dl.acm.org/citation.cfm?doid=2830629.2830641  ",
      "doi": "10.1145/2830629.2830641"
    }
  ]
}