{
  "doi": "10.1145/3173574.3173735",
  "title": "OptiMo: Optimization-Guided Motion Editing for Keyframe Character Animation",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "The mission of animators is to create nuanced, high-quality character motions. To achieve this, the careful editing of animation curves---curves that determine how a series of keyframed poses are interpolated over time---is an important task. Manual editing affords full and precise control, but requires tedious and nonintuitive trials and errors. Numerical optimization can automate such exploration; however, automatic solutions cannot always be perfect, and it is difficult for animators to control optimization owing to its black-box behavior. In this paper, we present a new framework called optimization-guided motion editing, which is aimed at maintaining a sense of full control while utilizing the power of optimization. We have designed interactions and developed a set of mathematical formulations to enable them. We discuss the framework's potential by demonstrating several usage scenarios with our proof-of-concept system, named OptiMo.",
  "tags": [
    "computational interaction",
    "computational design",
    "physics",
    "optimization",
    "motion editing",
    "computer animation"
  ],
  "authors": [
    {
      "name": "Yuki Koyama",
      "institution": "National Institute of Advanced Industrial Science & Technology (AIST), Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81551575156/rel-imgonly/1x1_zoom.jpg",
      "acmid": "81551575156",
      "orcid": "missing"
    },
    {
      "name": "Masataka Goto",
      "institution": "National Institute of Advanced Industrial Science & Technology (AIST), Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81100017919/rel-imgonly/masatakagoto.jpg",
      "acmid": "81100017919",
      "orcid": "0000-0003-1167-0977"
    }
  ],
  "references": [
    {
      "text": "Adobe Systems Inc. 2017. Adobe After Effects CC. http://www.adobe.com/products/aftereffects.html. (2017).",
      "doi": ""
    },
    {
      "text": "Autodesk Inc. 2017a. Maya. https://www.autodesk.com/products/maya/overview. (2017).",
      "doi": ""
    },
    {
      "text": "Autodesk Inc. 2017b. MotionBuilder. https: //www.autodesk.com/products/motionbuilder/overview. (2017).",
      "doi": ""
    },
    {
      "text": "Moritz B¨ acher, Emily Whiting, Bernd Bickel, and Olga Sorkine-Hornung. 2014. Spin-it: Optimizing Moment of Inertia for Spinnable Objects. ACM Trans. Graph. 33, 4, Article 96 (July 2014), 10 pages.  ",
      "doi": "10.1145/2601097.2601157"
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Timo K¨ otzing, and Sabrina Hoppe. 2013. MenuOptimizer: Interactive Optimization of Menu Systems. In Proc. UIST '13. 331--342.  ",
      "doi": "10.1145/2501988.2502024"
    },
    {
      "text": "Mikhail Bessmeltsev, Nicholas Vining, and Alla Sheffer. 2016. Gesture3D: Posing 3D Characters via Gesture Drawings. ACM Trans. Graph. 35, 6, Article 165 (Nov. 2016), 13 pages.  ",
      "doi": "10.1145/2980179.2980240"
    },
    {
      "text": "Samuel R. Buss. 2009. Introduction to Inverse Kinematics with Jacobian Transpose, Pseudoinverse and Damped Least Squares Methods. (2009). http://euclid. ucsd.edu/?sbuss/ResearchWeb/ikmethods/index.html",
      "doi": ""
    },
    {
      "text": "Byungkuk Choi, Roger Blanco i Ribera, J. P. Lewis, Yeongho Seol, Seokpyo Hong, Haegwang Eom, Sunjin Jung, and Junyong Noh. 2016. SketchiMo: Sketch-based Motion Editing for Articulated Characters. ACM Trans. Graph. 35, 4, Article 146 (July 2016), 12 pages.  ",
      "doi": "10.1145/2897824.2925970"
    },
    {
      "text": "Marek Dvorožň´k, Pierre B´ enard, Pascal Barla, Oliver Wang, and Daniel S´ ykora. 2017. Example-based Expressive Animation of 2D Rigid Bodies. ACM Trans. Graph. 36, 4, Article 127 (July 2017), 10 pages.  ",
      "doi": "10.1145/3072959.3073611"
    },
    {
      "text": "Roy Featherstone. 2008. Rigid Body Dynamics Algorithms. Springer US. ",
      "doi": "10.5555/1324846"
    },
    {
      "text": "Martin L. Felis. 2017. RBDL: an Efficient Rigid-Body Dynamics Library using Recursive Algorithms. Autonomous Robots 41, 2 (Feb 2017), 495--511.  ",
      "doi": "10.1007/s10514-016-9574-0"
    },
    {
      "text": "Christoph Gebhardt, Benjamin Hepp, Tobias N¨ ageli, Stefan Stevši´ c, and Otmar Hilliges. 2016. Airways: Optimization-Based Planning of Quadrotor Trajectories According to High-Level User Goals. In Proc. CHI '16. 2508--2519.  ",
      "doi": "10.1145/2858036.2858353"
    },
    {
      "text": "Oliver Glauser, Wan-Chun Ma, Daniele Panozzo, Alec Jacobson, Otmar Hilliges, and Olga Sorkine-Hornung. 2016. Rig Animation with a Tangible and Modular Input Device. ACM Trans. Graph. 35, 4, Article 144 (July 2016), 11 pages.  ",
      "doi": "10.1145/2897824.2925909"
    },
    {
      "text": "Michael Gleicher. 1997. Motion Editing with Spacetime Constraints. In Proc. I3D '97. 139--148.  ",
      "doi": "10.1145/253284.253321"
    },
    {
      "text": "Keith Grochow, Steven L. Martin, Aaron Hertzmann, and Zoran Popovi´ c. 2004. Style-based Inverse Kinematics. ACM Trans. Graph. 23, 3 (Aug. 2004), 522--531.  ",
      "doi": "10.1145/1015706.1015755"
    },
    {
      "text": "Martin Guay, R´ emi Ronfard, Michael Gleicher, and Marie-Paule Cani. 2015. Space-time Sketching of Character Animation. ACM Trans. Graph. 34, 4, Article 118 (July 2015), 10 pages.  ",
      "doi": "10.1145/2766893"
    },
    {
      "text": "Fabian Hahn, Sebastian Martin, Bernhard Thomaszewski, Robert Sumner, Stelian Coros, and Markus Gross. 2012. Rig-space Physics. ACM Trans. Graph. 31, 4, Article 72 (July 2012), 8 pages.  ",
      "doi": "10.1145/2185520.2185568"
    },
    {
      "text": "Daniel Holden, Jun Saito, and Taku Komura. 2015. Learning an Inverse Rig Mapping for Character Animation. In Proc. SCA '15. 165--173.  ",
      "doi": "10.1145/2786784.2786788"
    },
    {
      "text": "Alec Jacobson, Daniele Panozzo, Oliver Glauser, C´ edric Pradalier, Otmar Hilliges, and Olga Sorkine-Hornung. 2014. Tangible and Modular Input Device for Character Articulation. ACM Trans. Graph. 33, 4, Article 82 (July 2014), 12 pages.  ",
      "doi": "10.1145/2601097.2601112"
    },
    {
      "text": "Steven G. Johnson. 2017. The NLopt Nonlinear-Optimization Package. (2017). http://ab-initio.mit.edu/nlopt",
      "doi": ""
    },
    {
      "text": "Andreas Karrenbauer and Antti Oulasvirta. 2014. Improvements to Keyboard Optimization with Integer Programming. In Proc. UIST '14. 621--626.  ",
      "doi": "10.1145/2642918.2647382"
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Nobuyuki Umetani, and George Fitzmaurice. 2016. Motion Amplifiers: Sketching Dynamic Illustrations Using the Principles of 2D Animation. In Proc. CHI '16. 4599--4609.  ",
      "doi": "10.1145/2858036.2858386"
    },
    {
      "text": "Yuki Koyama, Daisuke Sakamoto, and Takeo Igarashi. 2014. Crowd-powered Parameter Analysis for Visual Design Exploration. In Proc. UIST '14. 65--74.  ",
      "doi": "10.1145/2642918.2647386"
    },
    {
      "text": "John Lasseter. 1987. Principles of Traditional Animation Applied to 3D Computer Animation. SIGGRAPH Comput. Graph. 21, 4 (Aug. 1987), 35--44.  ",
      "doi": "10.1145/37402.37407"
    },
    {
      "text": "J. P. Lewis, Ken Anjyo, Taehyun Rhee, Mengjie Zhang, Fred Pighin, and Zhigang Deng. 2014. Practice and Theory of Blendshape Facial Models. In Eurographics 2014 -- State of the Art Reports.",
      "doi": ""
    },
    {
      "text": "Xiaolei Lv, Jinxiang Chai, and Shihong Xia. 2016. Data-driven Inverse Dynamics for Human Motion. ACM Trans. Graph. 35, 6, Article 163 (Nov. 2016), 12 pages.  ",
      "doi": "10.1145/2980179.2982440"
    },
    {
      "text": "J. McCann, N. S. Pollard, and S. Srinivasa. 2006. Physics-based Motion Retiming. In Proc. SCA '06. 205--214. http://dl.acm.org/citation.cfm?id=1218064.1218092 ",
      "doi": "10.5555/1218064.1218092"
    },
    {
      "text": "Peter O'Donovan, Aseem Agarwala, and Aaron Hertzmann. 2015. DesignScape: Design with Interactive Layout Suggestions. In Proc. CHI '15. 1221--1224.  ",
      "doi": "10.1145/2702123.2702149"
    },
    {
      "text": "A. Cengiz ¨ Oztireli, Ilya Baran, Tiberiu Popa, Boris Dalstein, Robert W. Sumner, and Markus Gross. 2013. Differential Blending for Expressive Sketch-based Posing. In Proc. SCA '13. 155--164.  ",
      "doi": "10.1145/2485895.2485916"
    },
    {
      "text": "Michael J. D. Powell. 2009. The BOBYQA Algorithm for Bound Constrained Optimization without Derivatives. Technical Report NA2009/06. Department of Applied Mathematics and Theoretical Physics, Cambridge England.",
      "doi": ""
    },
    {
      "text": "Alla Safonova, Jessica K. Hodgins, and Nancy S. Pollard. 2004. Synthesizing Physically Realistic Human Motion in Low-dimensional, Behavior-specific Spaces. ACM Trans. Graph. 23, 3 (Aug. 2004), 514--521.  ",
      "doi": "10.1145/1015706.1015754"
    },
    {
      "text": "Ari Shapiro and Sung-Hee Lee. 2010. Practical Character Physics for Animators. IEEE Computer Graphics and Applications 31 (2010), 45--55.  ",
      "doi": "10.1109/MCG.2010.22"
    },
    {
      "text": "Kwang Won Sok, Katsu Yamane, Jehee Lee, and Jessica Hodgins. 2010. Editing Dynamic Human Motions via Momentum and Force. In Proc. SCA '10. 11--20.",
      "doi": ""
    },
    {
      "text": "Kashyap Todi, Daryl Weir, and Antti Oulasvirta. 2016. Sketchplore: Sketch and Explore with a Layout Optimiser. In Proc. DIS '16. 543--555.  ",
      "doi": "10.1145/2901790.2901817"
    },
    {
      "text": "Nobuyuki Umetani, Yuki Koyama, Ryan Schmidt, and Takeo Igarashi. 2014. Pteromys: Interactive Design and Optimization of Free-formed Free-flight Model Airplanes. ACM Trans. Graph. 33, 4, Article 65 (July 2014), 10 pages.  ",
      "doi": "10.1145/2601097.2601129"
    },
    {
      "text": "Jack M. Wang, Samuel R. Hamner, Scott L. Delp, and Vladlen Koltun. 2012. Optimizing Locomotion Controllers Using Biologically-based Actuators and Objectives. ACM Trans. Graph. 31, 4, Article 25 (July 2012), 11 pages.  ",
      "doi": "10.1145/2185520.2185521"
    },
    {
      "text": "Andrew Witkin and Michael Kass. 1988. Spacetime Constraints. SIGGRAPH Comput. Graph. 22, 4 (June 1988), 159--168.  ",
      "doi": "10.1145/378456.378507"
    }
  ]
}