{
  "doi": "10.1145/3173574.3173819",
  "title": "Multiray: Multi-Finger Raycasting for Large Displays",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "We explore and evaluate a multi-finger raycasting design space that we call \"multiray\". Each finger projects a ray on to the display, so the user is interacting from a distance using a form of direct input. Specifically, we propose techniques, where patterns of ray intersections created by hand postures form 2D geometric shapes to trigger actions and perform direct manipulations that go beyond single-point selections. Two formative studies examine characteristics of multi-finger raycasting for different projection methods, shapes, and tasks. Based on the results of those investigations, we demonstrate a number of dynamic UI controls and operations that utilise multiray points and shapes.",
  "authors": [
    {
      "name": "Fabrice Matulic",
      "institution": "University of Waterloo & Preferred Networks Inc., Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318497946",
      "orcid": "0000-0002-1804-631X"
    },
    {
      "name": "Daniel Vogel",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81100054467/rel-imgonly/purple_shirt_selfie_redmond.jpg",
      "acmid": "81100054467",
      "orcid": "0000-0001-7620-0541"
    }
  ],
  "references": [
    {
      "text": "https://glofx.com/product/glofx-lzr-laser-gloves-green/",
      "doi": ""
    },
    {
      "text": "F. Argelaguet, C. Andujar and R. Trueba. 2008. Overcoming eye-hand visibility mismatch in 3D pointing selection. In Proceedings of the 2008 ACM symposium on Virtual reality software and technology, ACM, 43--46.  ",
      "doi": "10.1145/1450579.1450588"
    },
    {
      "text": "G. Bailly, R. Walter, J. Müller, T. Ning and E. Lecolinet. 2011. Comparing Free Hand Menu Techniques for Distant Displays Using Linear, Marking and FingerCount Menus. In Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction - Volume Part II, Springer Berlin Heidelberg, 248--262. ",
      "doi": "10.5555/2042118.2042143"
    },
    {
      "text": "A. Banerjee, J. Burstyn, A. Girouard and R. Vertegaal. 2012. MultiPoint: Comparing laser and manual pointing as remote input in large display interactions. International Journal of Human-Computer Studies, 70, 10 (2012/10/01/ 2012), 690--702.  ",
      "doi": "10.1016/j.ijhcs.2012.05.009"
    },
    {
      "text": "A. Banerjee, J. Burstyn, A. Girouard and R. Vertegaal. 2011. Pointable: an in-air pointing technique to manipulate out-of-reach targets on tabletops. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, ACM, 11--20.  ",
      "doi": "10.1145/2076354.2076357"
    },
    {
      "text": "S. Bateman, R. L. Mandryk, C. Gutwin and R. Xiao. 2013. Analysis and comparison of target assistance techniques for relative ray-cast pointing. International Journal of Human-Computer Studies, 71, 5 (2013/05/01/ 2013), 511--532.  ",
      "doi": "10.1016/j.ijhcs.2012.12.006"
    },
    {
      "text": "M. A. Brown and W. Stuerzlinger. 2016. Exploring the Throughput Potential of In-Air Pointing. In Proceedings, Part II, of the 18th International Conference on Human-Computer Interaction. Interaction Platforms and Techniques - Volume 9732, Springer-Verlag New York, Inc., 13--24.  ",
      "doi": "10.1007/978-3-319-39516-6_2"
    },
    {
      "text": "G. Casiez, N. Roussel and D. Vogel. 2012. 1 - filter: a simple speed-based low-pass filter for noisy input in interactive systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2527--2530.  ",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "A. Cockburn, P. Quinn, C. Gutwin, G. Ramos and J. Looser. 2011. Air pointing: Design and evaluation of spatial target acquisition with and without visual feedback. International Journal of Human-Computer Studies, 69, 6 (2011/06/01/ 2011), 401--414.  ",
      "doi": "10.1016/j.ijhcs.2011.02.005"
    },
    {
      "text": "W. Fikkert, P. van der Vet and A. Nijholt. 2010. Gestures in an Intelligent User Interface. In Multimedia Interaction and Intelligent User Interfaces: Principles, Methods and Applications, (2010), 215--242.",
      "doi": ""
    },
    {
      "text": "M. Frisch, S. Kleinau, R. Langner and R. Dachselt. 2011. Grids & guides: multi-touch layout and alignment tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 16151618.  ",
      "doi": "10.1145/1978942.1979177"
    },
    {
      "text": "E. Ghomi, S. Huot, O. Bau, M. Beaudouin-Lafon and W. E. Mackay. 2013. Arpège: learning multitouch chord gestures vocabularies. In Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces, ACM, 209--218.  ",
      "doi": "10.1145/2512349.2512795"
    },
    {
      "text": "A. Goguey, M. Nancel, G. Casiez and D. Vogel. 2016. The Performance and Preference of Different Fingers and Chords for Pointing, Dragging, and Object Transformation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 4250--4261.  ",
      "doi": "10.1145/2858036.2858194"
    },
    {
      "text": "V. Gracia-Ibáñez, M. Vergara and J. L. Sancho-Bru. 2016. Interdependency of the maximum range of flexion--extension of hand metacarpophalangeal joints. Computer Methods in Biomechanics and Biomedical Engineering, 19, 16 (2016/12/09 2016), 1800--1807.",
      "doi": ""
    },
    {
      "text": "C. Häger-Ross and M. H. Schieber. 2000. Quantifying the Independence of Human Finger Movements: Comparisons of Digits, Hands, and Movement Frequencies. The Journal of Neuroscience, 20, 22 (2000), 8542--8550.",
      "doi": ""
    },
    {
      "text": "F. Haque, M. Nancel and D. Vogel. 2015. Myopoint: Pointing and Clicking Using Forearm Mounted Electromyography and Inertial Motion Sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 36533656.  ",
      "doi": "10.1145/2702123.2702133"
    },
    {
      "text": "C. Harrison, R. Xiao, J. Schwarz and S. E. Hudson. 2014. TouchTools: leveraging familiarity and skill with physical tools to augment touch interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2913--2916.  ",
      "doi": "10.1145/2556288.2557012"
    },
    {
      "text": "R. Jota, M. A. Nacenta, J. A. Jorge, S. Carpendale and S. Greenberg. 2010. A comparison of ray pointing techniques for very large displays. In Proceedings of Graphics Interface 2010, Canadian Information Processing Society, 269--276. ",
      "doi": "10.5555/1839214.1839261"
    },
    {
      "text": "W. A. König, J. Gerken, S. Dierdorf and H. Reiterer. 2009. Adaptive pointing: implicit gain adaptation for absolute pointing devices. In CHI '09 Extended Abstracts on Human Factors in Computing Systems, ACM, 4171--4176.  ",
      "doi": "10.1145/1520340.1520635"
    },
    {
      "text": "R. Kopper, D. A. Bowman, M. G. Silva and R. P. McMahan. 2010. A human motor behavior model for distal pointing tasks. Int. J. Hum.-Comput. Stud., 68, 10 (2010), 603--615.  ",
      "doi": "10.1016/j.ijhcs.2010.05.001"
    },
    {
      "text": "R. Kopper, M. G. Silva, R. P. McMahan and D. A. Bowman. 2008. Increasing the Precision of Distant Pointing for Large High-Resolution Displays. Technical Report,",
      "doi": ""
    },
    {
      "text": "Y. Kou, Y. M. Kow and K. Cheng. 2015. Developing Intuitive Gestures for Spatial Interaction with Large Public Displays. In Proceedings of the Third International Conference on Distributed, Ambient, and Pervasive Interactions - Volume 9189, Springer-Verlag New York, Inc., 174--181.  ",
      "doi": "10.1007/978-3-319-20804-6_16"
    },
    {
      "text": "G. J. Lepinski, T. Grossman and G. Fitzmaurice. 2010. The design and evaluation of multitouch marking menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 22332242.  ",
      "doi": "10.1145/1753326.1753663"
    },
    {
      "text": "Z. M. Li, S. Dun, D. A. Harkness and T. L. Brininger. 2004. Motion enslaving among multiple fingers of the human hand. Motor control, 8, 1 (Jan 2004), 1--15.",
      "doi": ""
    },
    {
      "text": "M. Liu, M. Nancel and D. Vogel. 2015. Gunslinger: Subtle Arms-down Mid-air Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, ACM, 63--71.  ",
      "doi": "10.1145/2807442.2807489"
    },
    {
      "text": "X. Lou, A. X. Li, R. Peng and P. Hansen. 2016. Optimising Free Hand Selection in Large Displays by Adapting to User's Physical Movements. In Proceedings of the 2016 Symposium on Spatial User Interaction, ACM, 23--31.  ",
      "doi": "10.1145/2983310.2985754"
    },
    {
      "text": "S. Mayer, K. Wolf, S. Schneegass and N. Henze. 2015. Modeling Distant Pointing for Compensating Systematic Displacements. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4165--4168.  ",
      "doi": "10.1145/2702123.2702332"
    },
    {
      "text": "V. McArthur, S. J. Castellucci and I. S. MacKenzie. 2009. An empirical comparison of \"wiimote\" gun attachments for pointing tasks. In Proceedings of the 1st ACM SIGCHI symposium on Engineering interactive computing systems, ACM, 203--208.  ",
      "doi": "10.1145/1570433.1570471"
    },
    {
      "text": "T. Moscovich and J. F. Hughes. 2006. Multi-finger cursor techniques. In Proceedings of Graphics Interface 2006, Canadian Information Processing Society, 1--7. ",
      "doi": "10.5555/1143079.1143081"
    },
    {
      "text": "B. A. Myers, R. Bhatnagar, J. Nichols, C. H. Peck, D. Kong, R. Miller and A. C. Long. 2002. Interacting at a distance: measuring the performance of laser pointers and other devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 33--40.  ",
      "doi": "10.1145/503376.503383"
    },
    {
      "text": "M. Nancel, J. Wagner, E. Pietriga, O. Chapuis and W. Mackay. 2011. Mid-air pan-and-zoom on wall-sized displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 177--186.  ",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "T. Ni, R. P. McMahan and D. A. Bowman. 2008. Technote: rapMenu: Remote Menu Selection Using Freehand Gestural Input. In Proceedings of the 2008 IEEE Symposium on 3D User Interfaces, IEEE Computer Society, 55--58.  ",
      "doi": "10.1109/3DUI.2008.4476592"
    },
    {
      "text": "M. Ortega and L. Nigay. 2009. AirMouse: Finger Gesture for 2D and 3D Interaction. In Proceedings of the 12th IFIP TC 13 International Conference on HumanComputer Interaction: Part II, Springer-Verlag, 214227.  ",
      "doi": "10.1007/978-3-642-03658-3_28"
    },
    {
      "text": "K. Pietroszek, A. Kuzminykh, J. R. Wallace and E. Lank. 2014. Smartcasting: a discount 3D interaction technique for public displays. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design, ACM, 119128.  ",
      "doi": "10.1145/2686612.2686629"
    },
    {
      "text": "O. Polacek, M. Klima, A. J. Sporka, P. Zak, M. Hradis, P. Zemcik and V. Prochazka. 2012. A comparative study on distant free-hand pointing. In Proceedings of the 10th European Conference on Interactive TV and Video, ACM, 139--142.  ",
      "doi": "10.1145/2325616.2325644"
    },
    {
      "text": "I. Poupyrev, T. Ichikawa, S. Weghorst and M. Billinghurst. 1998. Egocentric Object Manipulation in Virtual Environments: Empirical Evaluation of Interaction Techniques. Computer Graphics Forum, 17, 3 (1998), 41--52.",
      "doi": ""
    },
    {
      "text": "M. Schwaller and D. Lalanne. 2013. Pointing in the Air: Measuring the Effect of Hand Selection Strategies on Performance and Effort. In Human Factors in Computing and Informatics: First International Conference, SouthCHI 2013, Maribor, Slovenia, July 13, 2013. Proceedings, (2013), 732--747.",
      "doi": ""
    },
    {
      "text": "P. Song, W. B. Goh, W. Hutama, C.-W. Fu and X. Liu. 2012. A handle bar metaphor for virtual object manipulation with mid-air interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1297--1306.  ",
      "doi": "10.1145/2207676.2208585"
    },
    {
      "text": "S. Sridhar, A. M. Feit, C. Theobalt and A. Oulasvirta. 2015. Investigating the Dexterity of Multi-Finger Input for Mid-Air Text Entry. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3643--3652.  ",
      "doi": "10.1145/2702123.2702136"
    },
    {
      "text": "J. Taylor, L. Bordeaux, T. Cashman, B. Corish, C. Keskin, T. Sharp, E. Soto, D. Sweeney, J. Valentin, B. Luff, A. Topalian, E. Wood, S. Khamis, P. Kohli, S. Izadi, R. Banks, A. Fitzgibbon and J. Shotton. 2016. Efficient and precise interactive hand tracking through joint, continuous optimization of pose and correspondences. ACM Trans. Graph., 35, 4 (2016), 112.  ",
      "doi": "10.1145/2897824.2925965"
    },
    {
      "text": "D. Vogel and R. Balakrishnan. 2005. Distant freehand pointing and clicking on very large, high resolution displays. In Proceedings of the 18th annual ACM symposium on User interface software and technology, ACM, 33--42.  ",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "R. Walter, G. Bailly, N. Valkanova, Jörg Müller. 2014. Cuenesics: using mid-air gestures to select items on interactive public displays. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, ACM, 299308.  ",
      "doi": "10.1145/2628363.2628368"
    },
    {
      "text": "W. Westerman. 1999. Hand tracking, finger identification, and chordic manipulation on a multitouch surface. PhD Thesis, University of Delaware",
      "doi": ""
    },
    {
      "text": "D. Wigdor, H. Benko, J. Pella, J. Lombardo and S. Williams. 2011. Rock & rails: extending multi-touch interactions with shape gestures to enable precise spatial manipulations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1581--1590.  ",
      "doi": "10.1145/1978942.1979173"
    },
    {
      "text": "M. L. Wittorf and M. R. Jakobsen. 2016. Eliciting MidAir Gestures for Wall-Display Interaction. In Proceedings of the 9th Nordic Conference on HumanComputer Interaction, ACM, 1--4.  ",
      "doi": "10.1145/2971485.2971503"
    },
    {
      "text": "M. Wu and R. Balakrishnan. 2003. Multi-finger and whole hand gestural interaction techniques for multiuser tabletop displays. In Proceedings of the 16th annual ACM symposium on User interface software and technology, ACM, 193--202.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "M. Wu, S. Chia, K. Ryall, C. Forlines and R. Balakrishnan. 2006. Gesture registration, relaxation, and reuse for multi-point direct-touch surfaces. In First IEEE International Workshop on Horizontal Interactive Human-Computer Systems, 185--192.  ",
      "doi": "10.1109/TABLETOP.2006.19"
    },
    {
      "text": "H. P. Wyss, R. Blach and M. Bues. 2006. iSith Intersection-based Spatial Interaction for Two Hands. In Proceedings of the IEEE conference on Virtual Reality, IEEE Computer Society, 123.",
      "doi": ""
    },
    {
      "text": "C. Xiang, A. D. Wilson, R. Balakrishnan, K. Hinckley and S. E. Hudson. 2008. ShapeTouch: Leveraging contact shape on interactive surfaces. In Horizontal Interactive Human Computer Systems, 2008. TABLETOP 2008. 3rd IEEE International Workshop on, 129--136.",
      "doi": ""
    },
    {
      "text": "S. Zhai. 1998. User performance in relation to 3D input device design. SIGGRAPH Comput. Graph., 32, 4 (1998), 50--54.  ",
      "doi": "10.1145/307710.307728"
    }
  ]
}