{
  "doi": "10.1145/3173574.3173898",
  "title": "Crowdsourcing Exercise Plans Aligned with Expert Guidelines and Everyday Constraints",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Exercise plans help people implement behavior change. Crowd workers can help create exercise plans for clients, but their work may result in lower quality plans than produced by experts. We built CrowdFit, a tool that provides feedback about compliance with exercise guidelines and leverages strengths of crowdsourcing to create plans made by non-experts. We evaluated CrowdFit in a comparative study with 46 clients using exercise plans for two weeks. Clients received plans from crowd planners using CrowdFit, crowd planners without CrowdFit, or from expert planners. Compared to crowd planners not using CrowdFit, crowd planners using CrowdFit created plans that are more actionable and more aligned with exercise guidelines. Compared to experts, crowd planners created more actionable plans, and plans that are not significantly different with respect to tailoring, strength and aerobic principles. They struggled, however, to satisfy exercise requirements of amount of exercise. We discuss opportunities for designing technology supporting physical activity planning by non-experts.",
  "authors": [
    {
      "name": "Elena Agapie",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556994956",
      "orcid": "missing"
    },
    {
      "name": "Bonnie Chinh",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261848",
      "orcid": "missing"
    },
    {
      "name": "Laura R. Pina",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659534483",
      "orcid": "missing"
    },
    {
      "name": "Diana Oviedo",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261151",
      "orcid": "missing"
    },
    {
      "name": "Molly C. Welsh",
      "institution": "Seattle University, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260411",
      "orcid": "missing"
    },
    {
      "name": "Gary Hsieh",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495056",
      "orcid": "0000-0002-9460-2568"
    },
    {
      "name": "Sean Munson",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81416604516/rel-imgonly/12239463_533957215446_4643031366914155723_n.jpg",
      "acmid": "81416604516",
      "orcid": "0000-0002-0472-6138"
    }
  ],
  "references": [
    {
      "text": "Elena Agapie, Lucas Colusso, Sean A Munson, and Gary Hsieh. 2016. PlanSourcing: Generating Behavior Change Plans with Friends and Crowds. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing - CSCW '16, 119--133.  ",
      "doi": "10.1145/2818048.2819943"
    },
    {
      "text": "Elena Agapie, Jaime Teevan, and Andrés MonroyHernández. 2015. Crowdsourcing in the Field: A Case Study Using Local Crowds for Event Reporting. In In Proceedings of the Third AAAI Conference on Human Computation and Crowdsourcing - HCOMP '15.",
      "doi": ""
    },
    {
      "text": "Barbara E. Ainsworth, William L. Haskell, StephenD. Herrmann, Nathanel Meckes, David R. Bassett, Catrine Tudor-Locke, Jennifer L. Greer, Jesse Vezina, Melicia C. Whitt-Glover, and Arthur S. Leon. 2011. 2011 Compendium of Physical Activities. Medicine & Science in Sports & Exercise 43, 8: 1575--1581.",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Transactions on Computer-Human Interaction 20, 5: 1--27.  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Marissa Burgermaster, Krzysztof Z. Gajos, Patricia Davidson, and Lena Mamykina. 2017. The Role of Explanations in Casual Observational Learning about Nutrition. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 4097--4145.  ",
      "doi": "10.1145/3025453.3025874"
    },
    {
      "text": "Barbara A. Bushman, Rebecca Battista, Pamela Swan, Lynda Ransdell, and Walter R. Thompson. 2013. ACSM's Resources for the Personal Trainer: Fourth Edition. Wolters Kluwer Health Adis (ESP). Retrieved September 18, 2017 from https://asu.pure.elsevier.com/en/publications/acsmsresources-for-the-personal-trainer-fourth-edition",
      "doi": ""
    },
    {
      "text": "Heather L. Coley, Rajani S. Sadasivam, Jessica H. Williams, Julie E. Volkman, Yu-Mei Schoenberger, Connie L. Kohler, Heather Sobko, Midge N. Ray, Jeroan J. Allison, Daniel E. Ford, Gregg H. Gilbert, Thomas K. Houston, and National Dental PBRN and QUITPRIMO Collaborative Group. 2013. Crowdsourced Peer- Versus Expert-Written SmokingCessation Messages. American Journal of Preventive Medicine 45, 5: 543--550.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity Sensing in the Wild: A Field Trial of UbiFit Garden. Proceedings of the 2008 CHI Conference on Human Factors in Computing Systems - CHI '08: 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Justin Cranshaw, Emad Elwany, Todd Newman, Rafal Kocielnik, Bowen Yu, Sandeep Soni, Jaime Teevan, and Andrés Monroy-Hernandez. 2017. Calendar.help: Designing a Workflow-Based Scheduling Agent with Humans in the Loop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 2382--2393.  ",
      "doi": "10.1145/3025453.3025780"
    },
    {
      "text": "David Elsweiler and Morgan Harvey. 2015. Towards Automatic Meal Plan Recommendations for Balanced Nutrition. Proceedings of the 9th ACM Conference on Recommender Systems: 313--316.  ",
      "doi": "10.1145/2792838.2799665"
    },
    {
      "text": "Lena Fleig, Benjamin Gardner, Jan Keller, Sonia Lippke, Sarah Pomp, and Amelie U. Wiedemann. 2017. What contributes to action plan enactment? Examining characteristics of physical activity plans. British Journal of Health Psychology.",
      "doi": ""
    },
    {
      "text": "Carol Ewing Garber, Bryan Blissmer, Michael R. Deschenes, Barry A. Franklin, Michael J. Lamonte, IMin Min Lee, David C. Nieman, David P. Swain, and American College of Sports Medicine. 2011. Quantity and quality of exercise for developing and maintaining cardiorespiratory, musculoskeletal, and neuromotor fitness in apparently healthy adults: Guidance for prescribing exercise. Medicine and Science in Sports and Exercise 43, 7: 1334--1359.",
      "doi": ""
    },
    {
      "text": "Khurshid R. Ghani, David C. Miller, Susan Linsell, Andrew Brachulis, Brian Lane, Richard Sarle, Deepansh Dalela, Mani Menon, Bryan Comstock, Thomas S. Lendvay, James Montie, and James O. Peabody. 2016. Measuring to Improve: Peer and Crowd-sourced Assessments of Technical Skill with Robot-assisted Radical Prostatectomy. European Urology 69, 4: 547--550.",
      "doi": ""
    },
    {
      "text": "Peter M. Gollwitzer. 1999. Implementation intentions: Strong effects of simple plans. American Psychologist 54, 7: 493--503.",
      "doi": ""
    },
    {
      "text": "Peter M. Gollwitzer and Paschal Sheeran. 2006. Implementation Intentions and Goal Achievement: A Meta-analysis of Effects and Processes. Advances in Experimental Social Psychology 38, December: 69--119.",
      "doi": ""
    },
    {
      "text": "Yi Guo, Jiang Bian, Trevor Leavitt, Heather K. Vincent, Lindsey Vander Zalm, Tyler L. Teurlings, Megan D. Smith, and François Modave. 2017. Assessing the Quality of Mobile Exercise Apps Based on the American College of Sports Medicine Guidelines: A Reliable and Valid Scoring Instrument. Journal of Medical Internet Research 19, 3: e67.",
      "doi": ""
    },
    {
      "text": "Hwajung Hong, Eric Gilbert, Gregory D. Abowd, and Rosa I. Arriaga. 2015. In-group Questions and Outgroup Answers: Crowdsourcing Daily Living Advice for Individuals with Autism. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, 777--786.  ",
      "doi": "10.1145/2702123.2702402"
    },
    {
      "text": "Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E. Kraut. 2011. CrowdForge: Crowdsourcing Complex Work. In Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11, 43--52.  ",
      "doi": "10.1145/2047196.2047202"
    },
    {
      "text": "Emily Knight, Melanie I. Stuckey, Harry Prapavessis, and Robert J. Petrella. 2015. Public Health Guidelines for Physical Activity: Is There an App for That? A Review of Android and Apple App Stores. Journal of Medical Internet Research mHealth and uHealth 3, 2: e43.",
      "doi": ""
    },
    {
      "text": "Nicolas Kokkalis, Thomas Köhn, Johannes Huebner, Moontae Lee, Florian Schulze, and Scott R. Klemmer. 2013. TaskGenies: Automatically Providing Action Plans Helps People Complete Tasks. ACM Trans. Comput.-Hum. Interact. 20, 5: 27:1--27:25.  ",
      "doi": "10.1145/2513560"
    },
    {
      "text": "Dominika Kwasnicka, Justin Presseau, Martin White, and Falko F. Sniehotta. 2013. Does planning how to cope with anticipated barriers facilitate health-related behaviour change? A systematic review. Health Psychology Review 7, 2: 129--145.",
      "doi": ""
    },
    {
      "text": "Walter S. Lasecki, Rachel Wesley, Jeffrey Nichols, Anand Kulkarni, James F. Allen, and Jeffrey P. Bigham. 2013. Chorus: A Crowd-powered Conversational Assistant. In Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST '13, 151--162.  ",
      "doi": "10.1145/2501988.2502057"
    },
    {
      "text": "Jisoo Lee, Erin Walker, Winslow Burleson, Matthew Kay, Matthew Buman, and Eric B. Hekler. 2017. SelfExperimentation for Behavior Change: Design and Formative Evaluation of Two Approaches. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 6837--6849.  ",
      "doi": "10.1145/3025453.3026038"
    },
    {
      "text": "Min Kyung Lee, Min Kyung Lee, Junsung Kim, Jodi Forlizzi, and Sara Kiesler. 2015. Personalization Revisited?: A Reflective Approach Helps People Better Personalize Health Services and Motivates Them To Increase Physical Activity. In Proceedings of the 2015 International Conference on Ubiquitous computing - UbiComp'15, 743--754.  ",
      "doi": "10.1145/2750858.2807552"
    },
    {
      "text": "James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game. Proceedings of the 2006 International Conference on Ubiquitous computing UbiComp'06: 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Aleksandra Luszczynska. 2006. An Implementation Intentions Intervention, the Use of a Planning Strategy, and Physical Activity after Myocardial Infarction. Social Science & Medicine 62, 4: 900--908.",
      "doi": ""
    },
    {
      "text": "Kurt Luther, Jari-Lee Tolentino, Wei Wu, Amy Pavel, Brian P. Bailey, Maneesh Agrawala, Björn Hartmann, and Steven P. Dow. 2015. Structuring, Aggregating, and Evaluating Crowdsourced Design Critique. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15.  ",
      "doi": "10.1145/2675133.2675283"
    },
    {
      "text": "Lena Mamykina, Thomas N. Smyth, Jill P. Dimond, and Krzysztof Z. Gajos. 2016. Learning From the Crowd: Observational Learning in Crowdsourcing Communities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 2635--2644.  ",
      "doi": "10.1145/2858036.2858560"
    },
    {
      "text": "American College of Sports Medicine. 2013. ACSM's guidelines for exercise testing and prescription. Lippincott Williams & Wilkins.",
      "doi": ""
    },
    {
      "text": "François Modave, Jiang Bian, Trevor Leavitt, Jennifer Bromwell, Charles Harris III, and Heather Vincent. 2015. Low Quality of Free Coaching Apps With Respect to the American College of Sports Medicine Guidelines: A Review of Current Mobile Apps. Journal of Medical Internet Research mHealth and uHealth 3, 3: e77.",
      "doi": ""
    },
    {
      "text": "Fiona Morgan, Alysia Battersby, Alison L. Weightman, Lydia Searchfield, Ruth Turley, Helen Morgan, James Jagroo, and Simon Ellis. 2016. Adherence to Exercise Referral Schemes by Participants -- What Do Providers and Commissioners Need to Know? A Systematic Review of Barriers and Facilitators. BMC Public Health 16, 1: 227.",
      "doi": ""
    },
    {
      "text": "Robert R. Morris and Rosalind Picard. 2014. Crowdpowered positive psychological interventions. The Journal of Positive Psychology 9, 6: 509--516.",
      "doi": ""
    },
    {
      "text": "Robert R. Morris, Stephen M. Schueller, and Rosalind W. Picard. 2015. Efficacy of a Web-Based, Crowdsourced Peer-To-Peer Cognitive Reappraisal Platform for Depression: Randomized Controlled Trial. Journal of Medical Internet Research 17, 3: e72.",
      "doi": ""
    },
    {
      "text": "Sean A. Munson and Sunny Consolvo. 2012. Exploring goal-setting, rewards, self-monitoring, and sharing to motivate physical activity. In Proceedings of the 6th International Conference on Pervasive Computing Technologies for Healthcare, 25--32.",
      "doi": ""
    },
    {
      "text": "Sean A. Munson, Erin Krupka, Caroline Richardson, and Paul Resnick. 2015. Effects of Public Commitments and Accountability in a TechnologySupported Physical Activity Intervention. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, 1135--1144.  ",
      "doi": "10.1145/2702123.2702524"
    },
    {
      "text": "Mashfiqui Rabbi, Min Hane Aung, Mi Zhang, and Tanzeem Choudhury. 2015. MyBehavior: automatic personalized health feedback from user behaviors and preferences using smartphones. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '15, 707--718.  ",
      "doi": "10.1145/2750858.2805840"
    },
    {
      "text": "Mashfiqui Rabbi, Angela Pfammatter, Mi Zhang, Bonnie Spring, and Tanzeem Choudhury. 2015. Automated Personalized Feedback for Physical Activity and Dietary Behavior Change With Mobile Phones: A Randomized Controlled Trial on Adults. Journal of Medical Internet Research mHealth and uHealth 3, 2: e42.",
      "doi": ""
    },
    {
      "text": "Falko F. Sniehotta, Ralf Schwarzer, Urte Scholz, and Benjamin Schuz. 2005. Action Planning and Coping Planning for Long-term Lifestle Change, Theory Assessment. European Journal of Social Psychology 35, December 2004: 565--576.",
      "doi": ""
    },
    {
      "text": "Roelof A.J. de Vries, Khiet P. Truong, Sigrid Kwint, Constance H.C. Drossaert, and Vanessa Evers. 2016. Crowd-Designed Motivation: Motivational Messages for Exercise Adherence Based on Behavior Change Theory. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 297--308.  ",
      "doi": "10.1145/2858036.2858229"
    },
    {
      "text": "Haoqi Zhang, Edith Law, Rob Miller, Krzysztof Gajos, David Parkes, and Eric Horvitz. 2012. Human Computation Tasks with Global Constraints. In Proceedings of the 2012 CHI Conference on Human Factors in Computing Systems - CHI '12, 217--226.  ",
      "doi": "10.1145/2207676.2207708"
    },
    {
      "text": "Hans-Joachim Franz Zunft, Dietlinde Friebe, Brigitte Seppelt, Kurt Widhalm, Anne-Marie Remaut de Winter, Maria Daniel Vaz de Almeida, John M Kearney, and Michael Gibney. 1999. Perceived Benefits and Barriers to Physical Activity in a Nationally Representative Sample in the European Union. Public Health Nutrition 2, Supplement 1a: 153--160.",
      "doi": ""
    },
    {
      "text": "Chronic Disease Overview | Publications | Chronic Disease Prevention and Health Promotion | CDC. Retrieved September 17, 2017 from https://www.cdc.gov/chronicdisease/overview/",
      "doi": ""
    },
    {
      "text": "2008 Physical Activity Guidelines - health.gov. Retrieved September 17, 2017 from https://health.gov/paguidelines/guidelines/",
      "doi": ""
    },
    {
      "text": "Personal Trainers for Fitness: Cost, Credentials, and More Tips for Choosing One. Retrieved September 17, 2017 from http://www.webmd.com/fitnessexercise/features/finding-personal-fitness-trainer#1",
      "doi": ""
    },
    {
      "text": "2015. Prevalence of insufficient physical activity. World Health Organization. Retrieved September 19, 2017 from http://www.who.int/gho/ncd/risk_factors/physical_act ivity/en/",
      "doi": ""
    }
  ]
}