{
  "doi": "10.1145/3173574.3174206",
  "title": "Flotation Simulation in a Cable-driven Virtual Environment -- A Study with Parasailing",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "This paper presents flotation simulation in a cable-driven virtual environment. For this, a virtual parasailing system was developed, where the visual stimulus was provided through a VR headset and the physical stimulus was given by wires. In order to prevent the user from moving out of the limited workspace of the cable-driven system, the visual acceleration was washout-filtered to produce the physical acceleration. In the parasailing trajectory, we focused on the stages of vertical acceleration/deceleration and conducted an experiment to identify how much gain can be applied to the visual acceleration, which makes the user feel the natural self-motion when integrated with physical stimulus. Then, the results were tested using several types of full-course virtual parasailing. The results showed that fairly large differences between visual and physical stimuli would be accepted and different gains could be assigned depending on the user's altitudes.",
  "tags": [
    "flying sports",
    "visual gain",
    "parasailing",
    "virtual reality",
    "flotation simulation"
  ],
  "authors": [
    {
      "name": "HyeongYeop Kang",
      "institution": "Korea University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658694161",
      "orcid": "missing"
    },
    {
      "name": "Geonsun Lee",
      "institution": "Korea University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260949",
      "orcid": "missing"
    },
    {
      "name": "Seongsu Kwon",
      "institution": "Korea University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260671",
      "orcid": "missing"
    },
    {
      "name": "Ohung Kwon",
      "institution": "KITECH, Ansan, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416596098",
      "orcid": "missing"
    },
    {
      "name": "Seongpil Kim",
      "institution": "KITECH, Ansan, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659145868",
      "orcid": "missing"
    },
    {
      "name": "JungHyun Han",
      "institution": "Korea University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100056369",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "David Allerton. 2009. Principles of flight simulation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Tom Banton, Jeanine Stefanucci, Frank Durgin, Adam Fass, and Dennis Proffitt. 2006. The perception of walking speed in a virtual environment. Perception 14, 4 (2006).  ",
      "doi": "10.1162/105474605774785262"
    },
    {
      "text": "AJ Benson, MB Spencer, and JR Stott. 1986. Thresholds for the detection of the direction of whole-body, linear movement in the horizontal plane. Aviation, space, and environmental medicine (1986).",
      "doi": ""
    },
    {
      "text": "Daniel R Berger, Jörg Schulte-Pelkum, and Heinrich H Bülthoff. 2010. Simulating believable forward accelerations on a stewart motion platform. ACM Transactions on Applied Perception (TAP) 7, 1 (2010), 5.  ",
      "doi": "10.1145/1658349.1658354"
    },
    {
      "text": "Gerd Bruder and Frank Steinicke. 2014. Threefolded motion perception during immersive walkthroughs. In Proceedings of the 20th ACM symposium on virtual reality software and technology. ACM, 177--185.  ",
      "doi": "10.1145/2671015.2671026"
    },
    {
      "text": "Horst Eidenberger and Annette Mossel. 2015. Indoor skydiving in immersive virtual reality with embedded storytelling. In Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology. ACM, 9--12.  ",
      "doi": "10.1145/2821592.2821612"
    },
    {
      "text": "Leonard Evans. 1970. Speed estimation from a moving automobile. Ergonomics 13, 2 (1970), 219--230.",
      "doi": ""
    },
    {
      "text": "Sidney Fels, Steve Yohanan, Sachiyo Takahashi, Yuichiro Kinoshita, Kenji Funahashi, Yasufumi Takama, and Grace Tzu-Pei Chen. 2005. User experiences with a virtual swimming interface exhibit. In International Conference on Entertainment Computing. Springer, 433--444.  ",
      "doi": "10.1007/11558651_42"
    },
    {
      "text": "Freya Festl, Fabian Recktenwald, Chunrong Yuan, and Hanspeter A Mallot. 2012. Detection of linear ego-acceleration from optic flow. Journal of vision 12, 7 (2012), 10--10.",
      "doi": ""
    },
    {
      "text": "Gene F Franklin, J David Powell, Abbas Emami-Naeini, and J David Powell. 1994. Feedback control of dynamic systems. Vol. 3. Addison-Wesley Reading, MA. ",
      "doi": "10.5555/529926"
    },
    {
      "text": "Peter R Grant and Lloyd D Reid. 1997. Motion washout filter tuning: Rules and requirements. Journal of Aircraft 34, 2 (1997), 145--151.",
      "doi": ""
    },
    {
      "text": "John A Groeger, Oliver MJ Carsten, E Blana, and A Hamish Jamson. 1999. Speed and distance estimation under simulation conditions. Vision in vehicles 7 (1999), 291--299.",
      "doi": ""
    },
    {
      "text": "EL Groen and W Bles. 2004. How to use body tilt for the simulation of linear self motion. Journal of Vestibular Research 14, 5 (2004), 375--385.",
      "doi": ""
    },
    {
      "text": "Eric L Groen, Mario SV Valenti Clari, and RJAW Hosman. 2000. Psychophysical thresholds associated with the simulation of linear acceleration. In Proceedings of the AIAA Modeling and Simulation Technologies Conference, Denver (CO), August. 14--17.",
      "doi": ""
    },
    {
      "text": "Sauli Häkkinen. 1963. Estimation of distance and velocity in traffic situations. Työterveyslaitos.",
      "doi": ""
    },
    {
      "text": "Laurence R Harris, MR Jenkin, D Zikovitz, Fara Redlick, P Jaekl, UT Jasiobedzka, HL Jenkin, and Robert S Allison. 2002. Simulating self-motion I: Cues for the perception of motion. Virtual Reality 6, 2 (2002), 75--85.",
      "doi": ""
    },
    {
      "text": "Jeffrey R Hogue, R Wade Allen, Jerry MacDonald, Cliff Schmucker, Steve Markham, and Arvid Harmsen. 2001. Virtual reality parachute simulation for training and mission rehearsal. AIAA-2001--2061 (2001), 381--388.",
      "doi": ""
    },
    {
      "text": "Jacob A Houck, Robert J Telban, and Frank M Cardullo. 1999. Developments in human centered cueing algorithms for control of flight simulator motion systems. American Institute of Aeronautics and Astronautics, AIAA-99--4328 (1999).",
      "doi": ""
    },
    {
      "text": "PM Jaekl, MR Jenkin, and Laurence R Harris. 2005. Perceiving a stable world during active rotational and translational head movements. Experimental brain research 163, 3 (2005), 388--399.",
      "doi": ""
    },
    {
      "text": "Dhruv Jain, Misha Sra, Jingru Guo, Rodrigo Marques, Raymond Wu, Justin Chiu, and Chris Schmandt. 2016. Immersive terrestrial scuba diving using virtual reality. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1563--1569.  ",
      "doi": "10.1145/2851581.2892503"
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203--220.",
      "doi": ""
    },
    {
      "text": "MyoungGon Kim, Sunglk Cho, Tanh Quang Tran, Seong-Pil Kim, Ohung Kwon, and JungHyun Han. 2017. Scaled Jump in Gravity-Reduced Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 23, 4 (2017), 1360--1368.  ",
      "doi": "10.1109/TVCG.2017.2657139"
    },
    {
      "text": "Keigo Matsumoto, Yuki Ban, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2016. Curvature manipulation techniques in redirection using haptic cues. In 3D User Interfaces (3DUI), 2016 IEEE Symposium on. IEEE, 105--108.",
      "doi": ""
    },
    {
      "text": "Philipp Miermeister, Maria Lächele, Rainer Boss, Carlo Masone, Christian Schenk, Joachim Tesch, Michael Kerger, Harald Teufel, Andreas Pott, and Heinrich H Bülthoff. 2016. The cablerobot simulator large scale motion platform based on cable robot technology. In Intelligent Robots and Systems (IROS), 2016 IEEE/RSJ International Conference on. IEEE, 3024--3029.",
      "doi": "10.1109/IROS.2016.7759468"
    },
    {
      "text": "MA Nahon, LD Reid, and J Kirdeikis. 1992. Adaptive simulator motion software with supervisory control. Journal of Guidance, Control, and Dynamics 15, 2 (1992), 376--383.",
      "doi": ""
    },
    {
      "text": "Niels Christian Nilsson, Stefania Serafin, and Rolf Nordahl. 2014. Establishing the range of perceptually natural visual walking speeds for virtual walking-in-place locomotion. IEEE transactions on visualization and computer graphics 20, 4 (2014), 569--578.  ",
      "doi": "10.1109/TVCG.2014.21"
    },
    {
      "text": "Russell V Parrish, James E Dieudonne, and Dennis J Martin Jr. 1975. Coordinated adaptive washout for motion simulators. Journal of aircraft 12, 1 (1975), 44--50.",
      "doi": ""
    },
    {
      "text": "Wendy Powell, Brett Stevens, Steve Hand, and Maureen Simmonds. 2011. Blurring the boundaries: The perception of visual gain in treadmill-mediated virtual environments. In 3rd IEEE VR 2011 Workshop on Perceptual Illusions in Virtual Environments.",
      "doi": ""
    },
    {
      "text": "Sharif Razzaque, Zachariah Kohn, and Mary C Whitton. 2001. Redirected walking. In Proceedings of EUROGRAPHICS, Vol. 9. Manchester, UK, 105--106.",
      "doi": "10.5555/1124097"
    },
    {
      "text": "Gilles Reymond, Jacques Droulez, and Andras Kemeny. 2002. Visuovestibular perception of self-motion modeled as a dynamic optimization process. Biological Cybernetics 87, 4 (2002), 301--314.",
      "doi": ""
    },
    {
      "text": "Max Rheiner. 2014. Birdly an attempt to fly. In ACM SIGGRAPH 2014 Emerging Technologies. ACM, 3.  ",
      "doi": "10.1145/2614066.2614101"
    },
    {
      "text": "Bernhard E Riecke, Jörg Schulte-Pelkum, Marios N Avraamides, Markus Von Der Heyde, and Heinrich H Bülthoff. 2006. Cognitive factors can influence self-motion perception (vection) in virtual reality. ACM Transactions on Applied Perception (TAP) 3, 3 (2006), 194--216.  ",
      "doi": "10.1145/1166087.1166091"
    },
    {
      "text": "Santo Salvatore. 1969. VELOCITY SENSING-COMPARISON OF FIELD AND LABORATORY METHODS. Technical Report.",
      "doi": ""
    },
    {
      "text": "George Semb. 1969. Scaling automobile speed. Attention, Perception, & Psychophysics 5, 2 (1969), 97--101.",
      "doi": ""
    },
    {
      "text": "Raphael Sivan, Jehuda Ish-Shalom, and Jen-Kuang Huang. 1982. An optimal control approach to the design of moving flight simulators. IEEE Transactions on Systems, Man, and Cybernetics 12, 6 (1982), 818--827.",
      "doi": ""
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2010. Estimation of detection thresholds for redirected walking techniques. IEEE transactions on visualization and computer graphics 16, 1 (2010), 17--27.  ",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Doug Stewart. 1965. A platform with six degrees of freedom. Proceedings of the institution of mechanical engineers 180, 1 (1965), 371--386.",
      "doi": ""
    },
    {
      "text": "Evan A Suma, Seth Clark, David Krum, Samantha Finkelstein, Mark Bolas, and Zachary Warte. 2011. Leveraging change blindness for redirection in virtual environments. In Virtual Reality Conference (VR), 2011 IEEE. IEEE, 159--166.  ",
      "doi": "10.5555/2195921.2196345"
    },
    {
      "text": "AEI Thurrell, A Pelah, and HK Distler. 1998. The influence of non-visual signals of walking on the perceived speed of optic flow. Perception 27 (1998), 147--148.",
      "doi": ""
    },
    {
      "text": "Laura C Trutoiu, Betty J Mohler, Jörg Schulte-Pelkum, and Heinrich H Bülthoff. 2009. Circular, linear, and curvilinear vection in a large-screen virtual environment with floor projection. Computers & Graphics 33, 1 (2009), 47--58.  ",
      "doi": "10.1016/j.cag.2008.11.008"
    },
    {
      "text": "Martin Usoh, Ernest Catena, Sima Arman, and Mel Slater. 2000. Using presence questionnaires in reality. Presence: Teleoperators and Virtual Environments 9, 5 (2000), 497--503.  ",
      "doi": "10.1162/105474600566989"
    },
    {
      "text": "WG Wright, P DiZio, and JR Lackner. 2005. Vertical linear self-motion perception during visual and inertial motion: more than weighted summation of sensory inputs. Journal of Vestibular Research 15, 4 (2005), 185--195.",
      "doi": ""
    }
  ]
}