{
  "doi": "10.1145/3173574.3174165",
  "title": "Sensing Interruptibility in the Office: A Field Study on the Use of Biometric and Computer Interaction Sensors",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Knowledge workers experience many interruptions during their work day. Especially when they happen at inopportune moments, interruptions can incur high costs, cause time loss and frustration. Knowing a person's interruptibility allows optimizing the timing of interruptions and minimize disruption. Recent advances in technology provide the opportunity to collect a wide variety of data on knowledge workers to predict interruptibility. While prior work predominantly examined interruptibility based on a single data type and in short lab studies, we conducted a two-week field study with 13 professional software developers to investigate a variety of computer interaction, heart-, sleep-, and physical activity-related data. Our analysis shows that computer interaction data is more accurate in predicting interruptibility at the computer than biometric data (74.8% vs. 68.3% accuracy), and that combining both yields the best results (75.7% accuracy). We discuss our findings and their practical applicability also in light of collected qualitative data.",
  "authors": [
    {
      "name": "Manuela Züger",
      "institution": "University of Zurich, Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158767457",
      "orcid": "missing"
    },
    {
      "name": "Sebastian C. Müller",
      "institution": "University of Zurich, Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158645557",
      "orcid": "missing"
    },
    {
      "name": "André N. Meyer",
      "institution": "University of Zurich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-99658658128/rel-imgonly/andre_meyer.2.jpg",
      "acmid": "99658658128",
      "orcid": "missing"
    },
    {
      "name": "Thomas Fritz",
      "institution": "University of Zurich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81309488123/rel-imgonly/small.jpg",
      "acmid": "81309488123",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "U Rajendra Acharya, K Paul Joseph, Natarajan Kannathal, Choo Min Lim, and Jasjit S Suri. 2006. Heart rate variability: a review. Medical and biological engineering and computing 44, 12 (2006), 1031--1051.",
      "doi": ""
    },
    {
      "text": "Piotr D Adamczyk and Brian P Bailey. 2004. If not now, when?: the effects of interruption at different moments within task execution. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 271--278.  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Ernesto Arroyo and Ted Selker. 2011. Attention and intention goals can mediate disruption in human-computer interaction. In Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction-Volume Part II. Springer-Verlag, 454--470. ",
      "doi": "10.5555/2042118.2042162"
    },
    {
      "text": "American Heart Association. 2016. Target Heart Rates. (Oct. 2016). http://www.heart.org/HEARTORG/ HealthyLiving/PhysicalActivity/FitnessBasics/ Target-Heart-Rates_UCM_434341_Article.jsp",
      "doi": ""
    },
    {
      "text": "Alberto Bacchelli and Christian Bird. 2013. Expectations, outcomes, and challenges of modern code review. In Proceedings of the 2013 international conference on software engineering. IEEE Press, 712--721. ",
      "doi": "10.5555/2486788.2486882"
    },
    {
      "text": "Brian P Bailey and Shamsi T Iqbal. 2008. Understanding changes in mental workload during execution of goal-directed tasks and its application for interruption management. ACM Transactions on Computer-Human Interaction (TOCHI) 14, 4 (2008), 21.  ",
      "doi": "10.1145/1314683.1314689"
    },
    {
      "text": "Brian P Bailey and Joseph A Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in human behavior 22, 4 (2006), 685--708.",
      "doi": ""
    },
    {
      "text": "Brian P Bailey, Joseph A Konstan, and John V Carlis. 2001. The effects of interruptions on task performance, annoyance, and anxiety in the user interface. In Proceedings of INTERACT, Vol. 1. 593--601.",
      "doi": ""
    },
    {
      "text": "James Bo Begole, Nicholas E Matsakis, and John C Tang. 2004. Lilsys: sensing unavailability. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. ACM, 511--514.  ",
      "doi": "10.1145/1031607.1031691"
    },
    {
      "text": "Jelmer P Borst, Niels A Taatgen, and Hedderik van Rijn. 2015. What makes interruptions disruptive?: A process-model account of the effects of the problem state bottleneck on task interruption and resumption. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 2971--2980.  ",
      "doi": "10.1145/2702123.2702156"
    },
    {
      "text": "Leo Breiman. 2001. Random forests. Machine learning 45, 1 (2001), 5--32.  ",
      "doi": "10.1023/A%3A1010933404324"
    },
    {
      "text": "David M Cades, Deborah A Boehm Davis, J Gregory Trafton, and Christopher A Monk. 2007. Does the difficulty of an interruption affect our ability to resume?. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 51. SAGE Publications Sage CA: Los Angeles, CA, 234--238.",
      "doi": ""
    },
    {
      "text": "Daniel Chen, Jamie Hart, and Roel Vertegaal. 2007. Towards a physiological model of user interruptability. In IFIP Conference on Human-Computer Interaction. Springer, 439--451. ",
      "doi": "10.5555/1778331.1778380"
    },
    {
      "text": "Daniel Chen and Roel Vertegaal. 2004. Using mental load for managing interruptions in physiologically attentive user interfaces. In CHI'04 extended abstracts on Human factors in computing systems. ACM, 1513--1516.  ",
      "doi": "10.1145/985921.986103"
    },
    {
      "text": "Jan Chong and Rosanne Siino. 2006. Interruptions on software teams: a comparison of paired and solo programmers. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 29--38.  ",
      "doi": "10.1145/1180875.1180882"
    },
    {
      "text": "Mary Czerwinski, Edward Cutrell, and Eric Horvitz. 2000. Instant messaging: Effects of relevance and timing. In People and computers XIV: Proceedings of HCI, Vol. 2. British Computer Society, 71--76.",
      "doi": ""
    },
    {
      "text": "Polar Electro. 2017. Equine H7 heart rate sensor belt set. https: //www.polar.com/en/products/equine/accessories/ equine_H7_heart_rate_sensor_belt_set. (2017). {Online; accessed 19-September-2017}.",
      "doi": ""
    },
    {
      "text": "Robert Fisher and Reid Simmons. 2011. Smartphone interruptibility using density-weighted uncertainty sampling with reinforcement learning. In Machine Learning and Applications and Workshops (ICMLA), 2011 10th International Conference on, Vol. 1. IEEE, 436--441.  ",
      "doi": "10.1109/ICMLA.2011.128"
    },
    {
      "text": "Inc. Fitbit. 2017. Fitbit Charge 2. https://www.fitbit.com/de/charge2. (2017). {Online; accessed 19-September-2017}.",
      "doi": ""
    },
    {
      "text": "James Fogarty, Andrew J Ko, Htet Htet Aung, Elspeth Golden, Karen P Tang, and Scott E Hudson. 2005. Examining task engagement in sensor-based statistical models of human interruptibility. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 331--340.  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "James Fogarty, Jennifer Lai, and Jim Christensen. 2004. Presence versus availability: the design and evaluation of a context-aware communication client. International Journal of Human-Computer Studies 61, 3 (2004), 299--317.  ",
      "doi": "10.1016/j.ijhcs.2003.12.016"
    },
    {
      "text": "Thomas Fritz, Andrew Begel, Sebastian C Müller, Serap Yigit-Elliott, and Manuela Züger. 2014. Using psycho-physiological measures to assess task difficulty in software development. In Proceedings of the 36th International Conference on Software Engineering. ACM, 402--413.  ",
      "doi": "10.1145/2568225.2568266"
    },
    {
      "text": "Tony Gillie and Donald Broadbent. 1989. What makes interruptions disruptive? A study of length, similarity, and complexity. Psychological research 50, 4 (1989), 243--250.",
      "doi": ""
    },
    {
      "text": "Victor M González and Gloria Mark. 2004. Constant, constant, multi-tasking craziness: managing multiple working spheres. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Nitesh Goyal and Susan R Fussell. 2017. Intelligent Interruption Management using Electro Dermal Activity based Physiological Sensor for Collaborative Sensemaking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 52.  ",
      "doi": "10.1145/3130917"
    },
    {
      "text": "Fangfang Guo, Yu Li, Mohan S Kankanhalli, and Michael S Brown. 2013. An evaluation of wearable activity monitoring devices. In Proceedings of the 1st ACM international workshop on Personal data meets distributed multimedia. ACM, 31--34.  ",
      "doi": "10.1145/2509352.2512882"
    },
    {
      "text": "Andreas Haag, Silke Goronzy, Peter Schaich, and Jason Williams. 2004. Emotion recognition using bio-sensors: First steps towards an automatic system. In Tutorial and research workshop on affective dialogue systems. Springer, 36--48.",
      "doi": ""
    },
    {
      "text": "Eija Haapalainen, SeungJun Kim, Jodi F Forlizzi, and Anind K Dey. 2010. Psycho-physiological measures for assessing cognitive load. In Proceedings of the 12th ACM international conference on Ubiquitous computing. ACM, 301--310.  ",
      "doi": "10.1145/1864349.1864395"
    },
    {
      "text": "Jennifer A Healey and Rosalind W Picard. 2005. Detecting stress during real-world driving tasks using physiological sensors. IEEE Transactions on intelligent transportation systems 6, 2 (2005), 156--166.  ",
      "doi": "10.1109/TITS.2005.848368"
    },
    {
      "text": "Joyce Ho and Stephen S Intille. 2005. Using context-aware computing to reduce the perceived burden of interruptions from mobile devices. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 909--918.  ",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Eric Horvitz and Johnson Apacible. 2003. Learning and reasoning about interruption. In Proceedings of the 5th international conference on Multimodal interfaces. ACM, 20--27.  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Eric Horvitz, Paul Koch, and Johnson Apacible. 2004. BusyBody: creating and fielding personalized models of the cost of interruption. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. ACM, 507--510.  ",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "Eric Horvitz, Paul Koch, Carl M Kadie, and Andy Jacobs. 2002. Coordinate: Probabilistic forecasting of presence and availability. In Proceedings of the Eighteenth conference on Uncertainty in artificial intelligence. Morgan Kaufmann Publishers Inc., 224--233. ",
      "doi": "10.5555/2073876.2073903"
    },
    {
      "text": "Scott Hudson, James Fogarty, Christopher Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny Lee, and Jie Yang. 2003. Predicting human interruptibility with sensors: a Wizard of Oz feasibility study. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 257--264.  ",
      "doi": "10.1145/642611.642657"
    },
    {
      "text": "Shamsi T Iqbal, Piotr D Adamczyk, Xianjun Sam Zheng, and Brian P Bailey. 2004. Changes in mental workload during task execution. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology.",
      "doi": ""
    },
    {
      "text": "Shamsi T Iqbal and Brian P Bailey. 2007. Understanding and developing models for detecting and differentiating breakpoints during interactive tasks. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 697--706.  ",
      "doi": "10.1145/1240624.1240732"
    },
    {
      "text": "Shamsi T Iqbal and Brian P Bailey. 2008. Effects of intelligent notification management on users and their tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 93--102.  ",
      "doi": "10.1145/1357054.1357070"
    },
    {
      "text": "Shamsi T Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: field study, analysis, and directions. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 677--686.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Ellen Isaacs, Steve Whittaker, David Frohlich, and Brid O'Conaill. 1997. Informal communication re-examined: New functions for video in supporting opportunistic encounters. Video-mediated communication 997 (1997), 459--485.",
      "doi": ""
    },
    {
      "text": "Eric Jones, Travis Oliphant, Pearu Peterson, and others. 2001--. SciPy: Open source scientific tools for Python. (2001--). http://www.scipy.org/ {Online; accessed <today>}.",
      "doi": ""
    },
    {
      "text": "Ashish Kapoor and Eric Horvitz. 2007. Principles of lifelong learning for predictive user modeling. User Modeling 2007 (2007), 37--46.  ",
      "doi": "10.1007/978-3-540-73078-1_7"
    },
    {
      "text": "Ashish Kapoor and Eric Horvitz. 2008. Experience sampling for building predictive user models: a comparative study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 657--666.  ",
      "doi": "10.1145/1357054.1357159"
    },
    {
      "text": "Juha Karvonen and Timo Vuorimaa. 1988. Heart rate and exercise intensity during sports activities. Sports Medicine 5, 5 (1988), 303--311.",
      "doi": ""
    },
    {
      "text": "Ioanna Katidioti, Jelmer P Borst, Douwe J Bierens de Haan, Tamara Pepping, Marieke K van Vugt, and Niels A Taatgen. 2016. Interrupted by Your Pupil: An Interruption Management System Based on Pupil Dilation. International Journal of Human-Computer Interaction 32, 10 (2016), 791--801.",
      "doi": ""
    },
    {
      "text": "Kyohei Komuro, Yuichiro Fujimoto, and Kinya Fujita. 2017. Relationship Between Worker Interruptibility and Work Transitions Detected by Smartphone. In International Conference on Human-Computer Interaction. Springer, 687--699.",
      "doi": ""
    },
    {
      "text": "Jennifer Lai, Sachiko Yoshihama, Thomas Bridgman, Mark Podlaseck, Paul B Chou, and Danny C Wong. 2003. MyTeam: Availability Awareness Through the Use of Sensor Data.. In INTERACT.",
      "doi": ""
    },
    {
      "text": "Andy Liaw, Matthew Wiener, and others. 2002. Classification and regression by randomForest. R news 2, 3 (2002), 18--22.",
      "doi": ""
    },
    {
      "text": "Choubeila Maaoui, Alain Pruski, and F Abdat. 2010. Emotion recognition through physiological signals for human-machine communication. INTECH Open Access Publisher.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Mary Czerwinski, Shamsi Iqbal, and Paul Johns. 2016. Workplace Indicators of Mood: Behavioral and Cognitive Correlates of Mood Among Information Workers. In Proceedings of the 6th International Conference on Digital Health Conference. ACM, 29--36.  ",
      "doi": "10.1145/2896338.2896360"
    },
    {
      "text": "Gloria Mark, Victor M Gonzalez, and Justin Harris. 2005. No task left behind?: examining the nature of fragmented work. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 321--330.  ",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 107--110.  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, and Paul Johns. 2014. Bored mondays and focused afternoons: the rhythm of attention and online activity in the workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3025--3034.  ",
      "doi": "10.1145/2556288.2557204"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, Paul Johns, Akane Sano, and Yuliya Lutchyn. 2016. Email duration, batching and self-interruption: Patterns of email use on productivity and stress. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1717--1728.  ",
      "doi": "10.1145/2858036.2858262"
    },
    {
      "text": "Santosh Mathan, Stephen Whitlow, Michael Dorneich, Patricia Ververs, and Gene Davis. 2007. Neurophysiological estimation of interruptibility: Demonstrating feasibility in a field context. In In Proceedings of the 4th International Conference of the Augmented Cognition Society.",
      "doi": ""
    },
    {
      "text": "Andre N Meyer, Laura E Barton, Gail C Murphy, Thomas Zimmermann, and Thomas Fritz. 2017. The Work Life of Developers: Activities, Switches and Perceived Productivity. IEEE Transactions on Software Engineering (2017).  ",
      "doi": "10.1109/TSE.2017.2656886"
    },
    {
      "text": "André N Meyer, Thomas Fritz, Gail C Murphy, and Thomas Zimmermann. 2014. Software developers' perceptions of productivity. In Proceedings of the 22nd ACM SIGSOFT International Symposium on Foundations of Software Engineering. ACM, 19--29.  ",
      "doi": "10.1145/2635868.2635892"
    },
    {
      "text": "Microsoft. 2017. Microsoft Graph. https://graph.microsoft.io. (2017). {Online; accessed 19-September-2017}.",
      "doi": ""
    },
    {
      "text": "Hamid Turab Mirza, Ling Chen, Gencai Chen, Ibrar Hussain, and Xufeng He. 2011. Switch detector: an activity spotting system for desktop. In Proceedings of the 20th ACM international conference on Information and knowledge management. ACM, 2285--2288.  ",
      "doi": "10.1145/2063576.2063947"
    },
    {
      "text": "Christopher A Monk, J Gregory Trafton, and Deborah A Boehm-Davis. 2008. The effect of interruption duration and demand on resuming suspended goals. Journal of Experimental Psychology: Applied 14, 4 (2008), 299.",
      "doi": ""
    },
    {
      "text": "Hawley E Montgomery-Downs, Salvatore P Insana, and Jonathan A Bond. 2012. Movement toward a novel activity monitoring device. Sleep and Breathing 16, 3 (2012), 913--917.",
      "doi": ""
    },
    {
      "text": "LJM Mulder. 1992. Measurement and analysis methods of heart rate and respiration for use in applied environments. Biological psychology 34, 2 (1992), 205--236.",
      "doi": ""
    },
    {
      "text": "Sebastian C Müller and Thomas Fritz. 2015. Stuck and frustrated or in flow and happy: Sensing developers' emotions and progress. In Software Engineering (ICSE), 2015 IEEE/ACM 37th IEEE International Conference on, Vol. 1. IEEE, 688--699. ",
      "doi": "10.5555/2818754.2818838"
    },
    {
      "text": "Rahul Nair, Stephen Voida, and Elizabeth D Mynatt. 2005. Frequency-based detection of task switches. In Proceedings of the 19th British HCI Group Annual Conference, Vol. 2. 94--99.",
      "doi": ""
    },
    {
      "text": "F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825--2830. ",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "June J Pilcher, Douglas R Ginter, and Brigitte Sadowsky. 1997. Sleep quality versus sleep quantity: relationships between sleep and measures of health, well-being and sleepiness in college students. Journal of psychosomatic research 42, 6 (1997), 583--596.",
      "doi": ""
    },
    {
      "text": "Peter Richter, Thomas Wagner, Ralf Heger, and Gunther Weise. 1998. Psychophysiological analysis of mental load during driving on rural roads-a quasi-experimental field study. Ergonomics 41, 5 (1998), 593--609.",
      "doi": ""
    },
    {
      "text": "Lior Rokach and Oded Maimon. 2005. Top-down induction of decision trees classifiers-a survey. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 35, 4 (2005), 476--487.  ",
      "doi": "10.1109/TSMCC.2004.843247"
    },
    {
      "text": "Mark R Rosekind, Kevin B Gregory, Melissa M Mallis, Summer L Brandt, Brian Seal, and Debra Lerner. 2010. The cost of poor sleep: workplace productivity loss and associated costs. Journal of Occupational and Environmental Medicine 52, 1 (2010), 91--98.",
      "doi": ""
    },
    {
      "text": "Claude Sammut and Geoffrey I Webb. 2011. Encyclopedia of machine learning. Springer Science&Business Media. ",
      "doi": "10.5555/2011878"
    },
    {
      "text": "Akane Sano and Rosalind W Picard. 2013. Stress recognition using wearable sensors and mobile phones. In Affective Computing and Intelligent Interaction (ACII), 2013 Humaine Association Conference on. IEEE, 671--676.  ",
      "doi": "10.1109/ACII.2013.117"
    },
    {
      "text": "Saurabh Sarkar and Chris Parnin. 2017. Characterizing and predicting mental fatigue during programming tasks. In Proceedings of the 2nd International Workshop on Emotion Awareness in Software Engineering. IEEE Press, 32--37.  ",
      "doi": "10.5555/3105556.3105566"
    },
    {
      "text": "Tammar Shrot, Avi Rosenfeld, Jennifer Golbeck, and Sarit Kraus. 2014. Crisp: an interruption management algorithm based on collaborative filtering. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 3035--3044.  ",
      "doi": "10.1145/2556288.2557109"
    },
    {
      "text": "Hermann Stern, Viktoria Pammer, and Stefanie N Lindstaedt. 2011. A preliminary study on interruptibility detection based on location and calendar information. Proc. CoSDEO 11 (2011).",
      "doi": ""
    },
    {
      "text": "Margaret-Anne Storey, Alexey Zagalsky, Fernando Figueira Filho, Leif Singer, and Daniel M German. 2017. How social and communication channels shape and challenge a participatory culture in software development. IEEE Transactions on Software Engineering 43, 2 (2017), 185--204.  ",
      "doi": "10.1109/TSE.2016.2584053"
    },
    {
      "text": "Edward R Sykes. 2011. Interruptions in the workplace: A case study to reduce their effects. International Journal of Information Management 31, 4 (2011), 385--394.  ",
      "doi": "10.1016/j.ijinfomgt.2010.10.010"
    },
    {
      "text": "Takahiro Tanaka and Kinya Fujita. 2011. Study of user interruptibility estimation based on focused application switching. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 721--724.  ",
      "doi": "10.1145/1958824.1958954"
    },
    {
      "text": "Rini van Solingen, Egon Berghout, and Frank van Latum. 1998. Interrupts: just a minute never is. IEEE software 15, 5 (1998), 97.  ",
      "doi": "10.1109/52.714843"
    },
    {
      "text": "Bogdan Vasilescu, Kelly Blincoe, Qi Xuan, Casey Casalnuovo, Daniela Damian, Premkumar Devanbu, and Vladimir Filkov. 2016. The sky is not the limit: multitasking across github projects. In Proceedings of the 38th International Conference on Software Engineering. ACM, 994--1005.  ",
      "doi": "10.1145/2884781.2884875"
    },
    {
      "text": "JA Veltman and AWK Gaillard. 1998. Physiological workload reactions to increasing levels of task difficulty. Ergonomics 41, 5 (1998), 656--669.",
      "doi": ""
    },
    {
      "text": "Stjepan Vidaček, Ljiljana Kaliterna, Biserka Radoševi´ c-Vidaček, and Simon Folkard. 1986. Productivity on a weekly rotating shift system: circadian adjustment and sleep deprivation effects? Ergonomics 29, 12 (1986), 1583--1590.",
      "doi": ""
    },
    {
      "text": "Aku Visuri, Niels van Berkel, Chu Luo, Jorge Goncalves, Denzil Ferreira, and Vassilis Kostakos. 2017. Predicting Interruptibility for Manual Data Collection: A Cluster-Based User Model. (2017).",
      "doi": ""
    },
    {
      "text": "Peter Vorburger, Abraham Bernstein, and Alen Zurfluh. 2011. Interruptability Prediction Using Motion Detection. In 1st Int. Workshop on Managing Context Information in Mobile and Pervasive Environments MCMP-05.",
      "doi": ""
    },
    {
      "text": "Robert Wang, Gordon Blackburn, Milind Desai, Dermot Phelan, Lauren Gillinov, Penny Houghtaling, and Marc Gillinov. 2017. Accuracy of wrist-worn heart rate monitors. Jama cardiology 2, 1 (2017), 104--106.",
      "doi": ""
    },
    {
      "text": "Jacqueline Wijsman, Bernard Grundlehner, Hao Liu, Hermie Hermens, and Julien Penders. 2011. Towards mental stress detection using wearable physiological sensors. In Engineering in Medicine and Biology Society, EMBC, 2011 Annual International Conference of the IEEE. IEEE, 1798--1801.",
      "doi": ""
    },
    {
      "text": "Glenn F Wilson. 2002. An analysis of mental workload in pilots during flight using multiple psychophysiological measures. The International Journal of Aviation Psychology 12, 1 (2002), 3--18.",
      "doi": ""
    },
    {
      "text": "Borejda Xhyheri, Olivia Manfrini, Massimiliano Mazzolini, Carmine Pizzi, and Raffaele Bugiardini. 2012. Heart rate variability today. Progress in cardiovascular diseases 55, 3 (2012), 321--331.",
      "doi": ""
    },
    {
      "text": "Manuela Züger, Christopher Corley, André N Meyer, Boyang Li, Thomas Fritz, David Shepherd, Vinay Augustine, Patrick Francis, Nicholas Kraft, and Will Snipes. 2017. Reducing Interruptions at Work: A Large-Scale Field Study of FlowLight. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 61--72.  ",
      "doi": "10.1145/3025453.3025662"
    },
    {
      "text": "Manuela Züger and Thomas Fritz. 2015. Interruptibility of software developers and its prediction using psycho-physiological sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2981--2990.  ",
      "doi": "10.1145/2702123.2702593"
    }
  ]
}