{
  "doi": "10.1145/3173574.3173765",
  "title": "Single or Multiple Conversational Agents?: An Interactional Coherence Comparison",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Chatbots focusing on a narrow domain of expertise are in great rise. As several tasks require multiple expertise, a designer may integrate multiple chatbots in the background or include them as interlocutors in a conversation. We investigated both scenarios by means of a Wizard of Oz experiment, in which participants talked to chatbots about visiting a destination. We analyzed the conversation content, users' speech, and reported impressions. We found no significant difference between single- and multi-chatbots scenarios. However, even with equivalent conversation structures, users reported more confusion in multi-chatbots interactions and adopted strategies to organize turn-taking. Our findings indicate that implementing a meta-chatbot may not be necessary, since similar conversation structures occur when interacting to multiple chatbots, but different interactional aspects must be considered for each scenario.",
  "authors": [
    {
      "name": "Ana Paula Chaves",
      "institution": "Northern Arizona University & Federal University of Technology - Paraná, Flagstaff, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387605945",
      "orcid": "missing"
    },
    {
      "name": "Marco Aurelio Gerosa",
      "institution": "Northern Arizona University, Flagstaff, AZ, USA",
      "img": "/do/10.1145/contrib-81100523035/rel-imgonly/marco_gerosa.jpg",
      "acmid": "81100523035",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Pelumi Aboluwarin. 2016. Chatbots--Igniting Division of Labour in AI. Retrieved April 7, 2017 from https://businessofmessaging.com/chatbots-ignitingdivision-of-labour-in-ai-1430fcc85c8d.",
      "doi": ""
    },
    {
      "text": "Jeffrey F Anderson, Fred K Beard, and Joseph B Walther. 2010. Turn-Taking and the Local Management of Conversation in a Highly Simultaneous Computer-Mediated Communication System. Language@Internet 7, 7.",
      "doi": ""
    },
    {
      "text": "Mara Gatti de Bayser, Paulo Rodrigo Cavalin, Renan Souza, Alan Braz, Heloisa Candello, Claudio S. Pinhanez, and Jean-Pierre Briot. 2017. A Hybrid Architecture for Multi-Party Conversational Systems. CoRR abs/1705.01214. Retrieved from http://arxiv.org/abs/1705.01214",
      "doi": ""
    },
    {
      "text": "Therese Örnberg Berglund. 2009. Disrupted turn adjacency and coherence maintenance in instant messaging conversations. Language@ Internet 6, 2.",
      "doi": ""
    },
    {
      "text": "Parminder Bhatia, Marsal Gavalda, and Arash Einolghozati. 2017. soc2seq: Social Embedding meets Conversation Model. arXiv preprint arXiv:1702.05512.",
      "doi": ""
    },
    {
      "text": "Heloisa Candello, Claudio Pinhanez, David Millen, and Bruna Daniele Andrade. 2017. Shaping the Experience of a Cognitive Investment Adviser. In International Conference of Design, User Experience, and Usability, 594--613.",
      "doi": ""
    },
    {
      "text": "Justine Cassell. 2000. Embodied conversational interface agents. Communications of the ACM 43, 4: 70--78.  ",
      "doi": "10.1145/332051.332075"
    },
    {
      "text": "Nils Dahlbäck, Arne Jönsson, and Lars Ahrenberg. 1993. Wizard of Oz studies-why and how. Knowledge-based systems 6, 4: 258--266.  ",
      "doi": "10.1016/0950-7051%2893%2990017-N"
    },
    {
      "text": "Robert Dale. 2016. The return of the chatbots. Natural Language Engineering 22, 5: 811--817.",
      "doi": ""
    },
    {
      "text": "Auriol Degbelo, Carlos Granell, Sergio Trilles, Devanjan Bhattacharya, Sven Casteleyn, and Christian Kray. 2016. Opening up smart cities: citizen-centric challenges and opportunities from giscience. ISPRS International Journal of Geo-Information 5, 2: 16.",
      "doi": ""
    },
    {
      "text": "Jon Driver. 2001. A selective review of selective attention research from the past century. British Journal of Psychology 92, 1: 53--78.",
      "doi": ""
    },
    {
      "text": "B.J. Fogg. 2003. Computers as persuasive social actors. In Persuasive Technology, B.J. Fogg (ed.). Morgan Kaufmann, San Francisco, 89--120.",
      "doi": ""
    },
    {
      "text": "Asbjørn Følstad and Petter Bae Brandtzæg. 2017. Chatbots and the new world of HCI. interactions 24, 4: 38--42.  ",
      "doi": "10.1145/3085558"
    },
    {
      "text": "Tianjun Fu, Ahmed Abbasi, and Hsinchun Chen. 2008. A hybrid approach to web forum interactional coherence analysis. Journal of the Association for Information Science & Technology 59, 8: 1195--1209.  ",
      "doi": "10.5555/1388299.1388309"
    },
    {
      "text": "Piedad Garrido, Javier Barrachina, Francisco J Martinez, and Francisco J Seron. 2017. Smart tourist information points by combining agents, semantics and AI techniques. Computer Science & Information Systems 14, 1: 1--23.",
      "doi": ""
    },
    {
      "text": "Will Gibson. 2009. Negotiating textual talk: Conversation analysis, pedagogy and the organisation of online asynchronous discourse. British Educational Research Journal 35, 5: 705--721.",
      "doi": ""
    },
    {
      "text": "Ben Goertzel. 2014. Artificial general intelligence: concept, state of the art, and future prospects. Journal of Artificial General Intelligence 5, 1: 1--48.",
      "doi": ""
    },
    {
      "text": "Google Travel Study. 2014. The 2014 Traveler's Road to Decision. Ipsos MediaCT. Retrieved September 1, 2017 from https://storage.googleapis.com/think/docs/ 2014-travelers-road-to-decision_research_studies.pdf.",
      "doi": ""
    },
    {
      "text": "David Griol, José Manuel Molina, and Zoraida Callejas. 2014. Modeling the user state for contextaware spoken interaction in ambient assisted living. Applied intelligence 40, 4: 749--771.  ",
      "doi": "10.1007/s10489-013-0503-z"
    },
    {
      "text": "David Griol and José Manuel Molina. 2017. Building multi-domain conversational systems from single domain resources. Neurocomputing.  ",
      "doi": "10.1016/j.neucom.2017.01.112"
    },
    {
      "text": "Nicole Gustas. 2016. Chatbots: Next Big Thing or Cash Grab?. Retrieved April 8, 2017 from https://www.metafilter.com/158975/Chatbots-NextBig-Thing-or-Cash-Grab.",
      "doi": ""
    },
    {
      "text": "Melita Hajdinjak and France Mihelic. 2003. Wizard of Oz experiments. In EUROCON 2003. Computer as a Tool. The IEEE Region 8, 112--116.",
      "doi": ""
    },
    {
      "text": "John Heritage. 2008. Conversation analysis as social theory. The new Blackwell companion to social theory: 300--320.",
      "doi": ""
    },
    {
      "text": "Susan C Herring and Andrew J Kurtz. 2006. Visualizing dynamic topic analysis. In Proceedings of CHI'06.",
      "doi": ""
    },
    {
      "text": "Susan C. Herring. 1999. Interactional coherence in CMC. Journal of Computer-Mediated Communication 4, 4: 0--0.",
      "doi": ""
    },
    {
      "text": "Susan C. Herring. 2003. Dynamic topic analysis of synchronous chat. In New Research for New Media: Innovative Research Methodologies Symposium Working Papers and Readings, 47--66.",
      "doi": ""
    },
    {
      "text": "Jennifer Hill, W Randolph Ford, and Ingrid G Farreras. 2015. Real conversations with artificial intelligence: A comparison between human-human online conversations and human--chatbot conversations. Computers in Human Behavior 49: 245--250.  ",
      "doi": "10.1016/j.chb.2015.02.026"
    },
    {
      "text": "Julia Hirschberg and Christopher D Manning. 2015. Advances in natural language processing. Science 349, 6245: 261--266.",
      "doi": ""
    },
    {
      "text": "Torsten Holmer. 2008. Discourse structure analysis of chat communication. Language@ Internet 5, 9: 1--19.",
      "doi": ""
    },
    {
      "text": "Raymond B Jennings, Erich M Nahum, David P Olshefski, Debanjan Saha, Zon-Yin Shae, and Chris Waters. 2006. A study of internet instant messaging and chat protocols. IEEE Network 20, 4: 16--21.  ",
      "doi": "10.1109/MNET.2006.1668399"
    },
    {
      "text": "Aditya Joshi, Anoop Kunchukuttan, Pushpak Bhattacharyya, and Mark James Carman. 2015. SarcasmBot: An open-source sarcasm-generation module for chatbots. In WISDOM Workshop at KDD.",
      "doi": ""
    },
    {
      "text": "Christin Kohrs, Nicole Angenstein, and André Brechmann. 2016. Delays in human-computer interaction and their effects on brain activity. PloS one 11, 1.",
      "doi": ""
    },
    {
      "text": "Werner Kuhmann, Wolfram Boucsein, Florian Schaefer, and Johanna Alexander. 1987. Experimental investigation of psychophysiological stress-reactions induced by different system response times in humancomputer interaction*. Ergonomics 30, 6: 933--943.",
      "doi": ""
    },
    {
      "text": "Tania C Lang. 2000. The effect of the Internet on travel consumer purchasing behaviour and implications for travel agencies. Journal of vacation marketing 6, 4: 368--385.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2010. Receptionist or information kiosk: How do people talk with a robot? In Proceedings of the 2010 ACM conference on Computer supported cooperative work, 31--40.  ",
      "doi": "10.1145/1718918.1718927"
    },
    {
      "text": "Greg Linden, Steve Hanks, and Neal Lesh. 1997. Interactive assessment of user preference models: The automated travel assistant. In User Modeling, 67--78.",
      "doi": ""
    },
    {
      "text": "Daniel Macias-Galindo, Wilson Wong, John Thangarajah, and Lawrence Cavedon. 2012. Coherent topic transition in a conversational agent. In Proceedings of the 13th Annual Conference of the International Speech Communication Association (InterSpeech), Oregon, USA.",
      "doi": ""
    },
    {
      "text": "Panos Markopoulos and Wendy Mackay. 2009. Awareness systems: Advances in theory, methodology and design. Springer Science & Business Media. ",
      "doi": "10.5555/1608964"
    },
    {
      "text": "Hareesh Maturi. 2016. Meta Chatbot: Enabling collaboration between chatbots. Retrieved April 7, 2017 from https://www.linkedin.com/pulse/metachatbot-enabling-collaboration-between-chatbotshareesh-maturi.",
      "doi": ""
    },
    {
      "text": "Yi Mou and Kun Xu. 2017. The media inequality: Comparing the initial human-human and human-AI social interactions. Computers in Human Behavior 72: 432--440.  ",
      "doi": "10.1016/j.chb.2017.02.067"
    },
    {
      "text": "Clifford Nass and Youngme Moon. 2000. Machines and mindlessness: Social responses to computers. Journal of social issues 56, 1: 81--103.",
      "doi": "10.1111/0022-4537.00153"
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems, 72--78.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Daniel Nations. 2017. What is Siri? How Can I Use It and How Can Siri Help Me? A Look at Apple's Personal Assistant for iOS. Retrieved March 21, 2017 from https://www.lifewire.com/what-is-siri-help1994303.",
      "doi": ""
    },
    {
      "text": "Ahmed K Noor. 2015. Potential of cognitive computing and cognitive systems. Open Engineering 5, 1: 75--88.",
      "doi": ""
    },
    {
      "text": "Jacki O'Neill and David Martin. 2003. Text chat in action. In Proceedings of the 2003 international ACM SIGGROUP conference on Supporting group work, 40--49.  ",
      "doi": "10.1145/958160.958167"
    },
    {
      "text": "Jeong-Yeol Park and SooCheong Shawn Jang. 2013. Confused by too many choices? Choice overload in tourism. Tourism Management 35: 1--12.",
      "doi": ""
    },
    {
      "text": "Aneta Pawlowska. 2016. Tourists and social media: Already inseparable marriage or still a long-distance relationship? Analysis of focus group study results conducted among tourists using social media. World Scientific News 57: 106--115.",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, and Sarah Sharples. 2017. Do animals have accents?: talking with agents in multi-party conversation. In ACM CSCW'17.  ",
      "doi": "10.1145/2998181.2998298"
    },
    {
      "text": "Andrew B Raij, Kyle Johnsen, Robert F Dickerson, Benjamin C Lok, Marc S Cohen, Margaret Duerson, Rebecca Rainer Pauly, Amy O Stevens, Peggy Wagner, and D Scott Lind. 2007. Comparing interpersonal interactions with a virtual human to those with a real human. IEEE transactions on visualization and computer graphics 13, 3: 443--457.  ",
      "doi": "10.1109/TVCG.2007.1030"
    },
    {
      "text": "Stuart Reeves. 2017. Some conversational challenges of talking with machines. Talking with Conversational Agents in Collaborative Action Workshop on CSCW 2017.",
      "doi": ""
    },
    {
      "text": "Microsoft Research. 2014. Anticipating More from Cortana. Retrieved March 21, 2017 from https://www.microsoft.com/en-us/research/blog/ anticipating-more-from-cortana/.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks and Emanuel A Schegloff. 1995. Lectures on conversation: Volumes I & II. Wiley Online Library.",
      "doi": ""
    },
    {
      "text": "Claude Sammut. 2001. Managing context in a conversational agent. Linkoping Electronic Articles in Computer & Information Science 3, 7.",
      "doi": ""
    },
    {
      "text": "Emanuel A Schegloff. 1990. On the organization of sequences as a source of \"coherence\" in talk-ininteraction. Conversational organization and its development 38: 51--77.",
      "doi": ""
    },
    {
      "text": "Brian J Scholl. 2001. Objects and attention: The state of the art. Cognition 80, 1: 1--46.",
      "doi": ""
    },
    {
      "text": "Bayan Abu Shawar and Eric Atwell. 2007. Chatbots: are they really useful? In LDV Forum, 29--49.",
      "doi": ""
    },
    {
      "text": "Nicole Shechtman and Leonard M Horowitz. 2003. Media inequality in conversation: how people behave differently when interacting with computers and people. In Proceedings of the SIGCHI conference on Human factors in computing systems, 281--288.  ",
      "doi": "10.1145/642611.642661"
    },
    {
      "text": "Jenna Sheffield. 2016. The Ultimate Travel Bot List. Claire by 30 seconds to fly. Retrieved April 7, 2017 from https://www.30secondstofly.com/ai-software/ ultimate-travel-bot-list/#The_Future_of_Travel_Bots.",
      "doi": ""
    },
    {
      "text": "Jack Sidnell. 2011. Conversation analysis: An introduction. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Nick Statt. 2016. Why Google's fancy new AI assistant is just called 'Google'. Retrieved March 21, 2017 from https://www.theverge.com/2016/5/20/11721278/googl e-ai-assistant-name-vs-alexa-siri.",
      "doi": ""
    },
    {
      "text": "André J Szameitat, Jan Rummel, Diana P Szameitat, and Annette Sterr. 2009. Behavioral and emotional consequences of brief delays in human-computer interaction. International Journal of Human-Computer Studies 67, 7: 561--570.  ",
      "doi": "10.1016/j.ijhcs.2009.02.004"
    },
    {
      "text": "Indrani Medhi Thies, Nandita Menon, Sneha Magapu, Manisha Subramony, and Jacki O'Neill. 2017. How Do You Want Your Chatbot? An Exploratory Wizard-ofOz Study with Young, Urban Indians. In IFIP Conference on Human-Computer Interaction, 441-- 459.",
      "doi": ""
    },
    {
      "text": "David Traum and Jeff Rickel. 2002. Embodied agents for multi-party dialogue in immersive virtual worlds. In Proceedings of the first international joint conference on Autonomous agents and multiagent systems: part 2, 766--773.  ",
      "doi": "10.1145/544862.544922"
    },
    {
      "text": "Gabriele Trovato, Massimiliano Zecca, Tatsuhiro Kishi, Nobutsuna Endo, Kenji Hashimoto, and Atsuo Takanishi. 2013. Generation of humanoid robot's facial expressions for context-aware communication. International Journal of Humanoid Robotics 10, 01: 1350013.",
      "doi": ""
    },
    {
      "text": "David C Uthus and David W Aha. 2013. Multiparticipant chat analysis: A survey. Artificial Intelligence 199: 106--121.  ",
      "doi": "10.1016/j.artint.2013.02.004"
    },
    {
      "text": "Alessandro Vinciarelli, Anna Esposito, Elisabeth André, Francesca Bonin, Mohamed Chetouani, Jeffrey F Cohn, Marco Cristani, Ferdinand Fuhrmann, Elmer Gilmartin, Zakia Hammal, and others. 2015. Open challenges in modelling, analysis and synthesis of human behaviour in human-human and human-- machine interactions. Cognitive Computation 7, 4: 397--413.",
      "doi": ""
    },
    {
      "text": "R Woodburn, R Procter, J Arnott, and A Newell. 1991. A study of conversational turn-taking in a communication aid for the disabled. People and Computers: 359--371.",
      "doi": ""
    },
    {
      "text": "Jun Xiao, Richard Catrambone, and John Stasko. 2003. Be quiet? evaluating proactive and reactive user interface assistants. In Proceedings of INTERACT, 383--390.",
      "doi": ""
    },
    {
      "text": "Zhou Yu, Ziyu Xu, Alan W Black, and Alexander Rudnicky. 2016. Chatbot evaluation and database expansion via crowdsourcing. In Proceedings of the RE-WOCHAT workshop of LREC, Portoroz, Slovenia.",
      "doi": ""
    }
  ]
}