{
  "doi": "10.1145/3173574.3174150",
  "title": "Rethinking Engagement with Online News through Social and Visual Co-Annotation",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "The emergence of fake news, as well as filter bubbles and echo chambers, has precipitated renewed attention upon the ways in which news is consumed, shared and reflected and commented upon. While online news comments sections offer space for pluralist and critical discussion, studies suggest that this rarely occurs. Motivated by common practices of annotating, defacing and scribbling on physical newspapers, we built a mobile app -- Newsr -- that supports co-annotation, in the form of graffiti, on online news articles, which we evaluated in-the-wild for one month. We report on how the app encouraged participants to reflect upon the act of choosing news stories, whilst promoting exploration, the critique of content, and the exposure of bias within the writing. Our findings highlight how the re-design of interactive online news experiences can facilitate more directed, \"in-the-moment\" critique of online news stories as well as encourage readers to expand the range of news content they read.",
  "authors": [
    {
      "name": "Gavin Wood",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479648974",
      "orcid": "missing"
    },
    {
      "name": "Kiel Long",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557422756",
      "orcid": "missing"
    },
    {
      "name": "Tom Feltwell",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658696389",
      "orcid": "missing"
    },
    {
      "name": "Scarlett Rowland",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260770",
      "orcid": "missing"
    },
    {
      "name": "Phillip Brooker",
      "institution": "University of Liverpool, Liverpool, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707710",
      "orcid": "missing"
    },
    {
      "name": "Jamie Mahoney",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259688457",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    },
    {
      "name": "Julie Barnett",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86158781057",
      "orcid": "missing"
    },
    {
      "name": "Shaun Lawson",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Morgan Ames and Mor Naaman. 2007. Why we tag: motivations for annotation in mobile and online media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 971.  ",
      "doi": "10.1145/1240624.1240772"
    },
    {
      "text": "Eric Anderson. SideComments. Retrieved January 4, 2018 from http://aroc.github.io/side-comments-demo/",
      "doi": ""
    },
    {
      "text": "Ashley A. Anderson, Dominique Brossard, Dietram A. Scheufele, Michael A. Xenos, and Peter Ladwig. 2013. The \"Nasty Effect:\" Online Incivility and Risk Perceptions of Emerging Technologies. Journal of Computer-Mediated Communication 19, 3: 373--387.  ",
      "doi": "10.1111/jcc4.12009"
    },
    {
      "text": "E. Bakshy, S. Messing, and L. A. Adamic. 2015. Exposure to ideologically diverse news and opinion on Facebook. Science 348, 6239: 1130--1132.",
      "doi": ""
    },
    {
      "text": "David Bodoff and Eran Vaknin. 2016. Human-- Computer Interaction Priming Effects and Strategic Influences in Social Tagging. Human-Computer Interaction 31, 31: 133--171.  ",
      "doi": "10.1080/07370024.2015.1080609"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Journal of Qualitative Research in Psychology 3, 77--101.",
      "doi": ""
    },
    {
      "text": "Phil Brooker, John Vines, Selina Sutton, Julie Barnett, Tom Feltwell, and Shaun Lawson. 2015. Opus: University of Bath Online Publication Store Debating Poverty Porn on Twitter?: Social Media as a Place for Everyday Socio - Political Talk.",
      "doi": ""
    },
    {
      "text": "Scott Carter, Elizabeth Churchill, Laurent Denoue, Jonathan Helfman, and Les Nelson. 2004. Digital graffiti: public annotation of multimedia content. In Extended Abstracts on Human Factors in Computing Systems, (CHI'04),12071210.  ",
      "doi": "10.1145/985921.986025"
    },
    {
      "text": "Yimin Chen, Niall J. Conroy, and Victoria L. Rubin. 2015. News in an online world: The need for an \"automatic crap detector.\" Proceedings of the Association for Information Science&Technology 52, 1: 1--4. ",
      "doi": "10.5555/2857070.2857151"
    },
    {
      "text": "Nicholas Diakopoulos and Mor Naaman. 2011. Towards quality discourse in online news comments. In Proceedings of the ACM 2011 Conference on Computer supported cooperative work (CSCW '11), 133.  ",
      "doi": "10.1145/1958824.1958844"
    },
    {
      "text": "Seth Flaxman, Sharad Goel, and Justin M Rao. 2016. Filter Bubbles, Echo Chambers, and Online News Consumption. Public Opinion Quarterly 80, S1: 298--320.",
      "doi": ""
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. Proceedings of the conference on Huaman factors in computing systems - CHI '03, 5: 233.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Tom Feltwell, Gavin Wood, Kiel Long, et al. 2017. \"I've been manipulated!\": Designing Second Screen Experiences for Critical Viewing of Reality TV. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'17), 2252--2263.  ",
      "doi": "10.1145/3025453.3025833"
    },
    {
      "text": "Marcus Foth, Martin Tomitsch, Laura Forlano, Matthias Hank Haeusler, and Christine Satchell. 2016. Citizens breaking out of filter bubbles. In Proceedings of the 5th ACM International Symposium on Pervasive Displays (PerDis '16), 140--147.  ",
      "doi": "10.1145/2914920.2915010"
    },
    {
      "text": "Kiran Garimella, Gianmarco De Francisci Morales, Aristides Gionis, and Michael Mathioudakis. 2017. Mary, Mary, Quite Contrary?: Exposing Twitter Users to Contrarian News. In Proceedings of the 26th International Conference on World Wide Web Companion (WWW'17), 201--205.  ",
      "doi": "10.1145/3041021.3054737"
    },
    {
      "text": "Nicole M Glenn, C C Champion, and J C Spence. 2012. Qualitative content analysis of online news media coverage of weight loss surgery and related reader comments. Clinical obesity 2, 5--6: 125--131.",
      "doi": ""
    },
    {
      "text": "Katerina Gorkovenko, Nick Taylor, and Jon Rogers. 2017. Social Printers: a physical social network for political debates. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'17), 2269--2281.  ",
      "doi": "10.1145/3025453.3025611"
    },
    {
      "text": "Habermas, J. The structural transformation of the public sphere. MIT Press, 1991.",
      "doi": ""
    },
    {
      "text": "Frank Allan Hansen. 2006. Ubiquitous annotation systems: technologies and challenges. Proceedings of the seventeenth conference on Hypertext and Hypermedia: 121--132.  ",
      "doi": "10.1145/1149941.1149967"
    },
    {
      "text": "Emma Head. 2009. The ethics and implications of paying participants in qualitative research. International Journal of Social Research Methodology 12, 4: 335--344.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer, Fernanda B. Viégas, and Wattenberg, Martin. (2009) 'Voyagers and Voyeurs: Supporting Asynchronous Collaborative Visualization', Communications of the ACM, 52(1), pp. 87--97.  ",
      "doi": "10.1145/1435417.1435439"
    },
    {
      "text": "Bente Kalsnes and Anders Olof Larsson. 2017. Understanding news sharing across social media. Journalism Studies, 1--20.",
      "doi": ""
    },
    {
      "text": "Jason Kester, Ben Satterfield, Neven Mrgan, and Sam Elmore. 2008. twiddla. Retrieved January 3, 2018 from http://www.twiddla.com",
      "doi": ""
    },
    {
      "text": "Ben Kirman, Connor Lineham, and Shaun Lawson. 2012. Exploring mischief and mayhem in social computing or: How we learned to stop worrying and love the trolls. In Proceedings of Extended Abstracts on Human Factors in Comsputing Systems (CHI EA 12), 121--130.  ",
      "doi": "10.1145/2212776.2212790"
    },
    {
      "text": "Matthias Korn and Amy Voida. 2015. Creating Friction: Infrastructuring Civic Engagement in Everyday Life. Aarhus Series on Human Centered Computing 1, 1: 12.",
      "doi": "10.7146/aahcc.v1i1.21198"
    },
    {
      "text": "Nelya Koteyko, Rusi Jaspal and Brigitte Nehrlich. 2013. Climate change and climategate' in online reader comments: A mixed methods study. The Geographic Journal, 179(1): 74--86.",
      "doi": ""
    },
    {
      "text": "Chinmay Kulkarni and Ed Chi. 2013. All the News That's Fit to Read: A Study of Social Annotations for News Reading. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13), 2407--2416.  ",
      "doi": "10.1145/2470654.2481334"
    },
    {
      "text": "Cliff Lampe and Paul Resnick. 2004. Slash (dot) and burn: distributed moderation in a large online conversation space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'04), 543--550.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "https://en.oxforddictionaries.com/word-of-theyear/word-of-the-year-2016",
      "doi": ""
    },
    {
      "text": "Zizi Papacharissi. 2004. Democracy online: civility, politeness, and the democratic potential of online political discussion groups. New Media&Society 6, 2: 259--283.",
      "doi": ""
    },
    {
      "text": "Deokgun Park, Simranjit Sachar, Nicholas Diakopoulos, and Niklas Elmqvist. 2016. Supporting Comment Moderators in Identifying High Quality Online News Comments. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16: 1114--1125.  ",
      "doi": "10.1145/2858036.2858389"
    },
    {
      "text": "Mark Pollard. 2014. Internet Access 2014 Households and Individuals. Internet Access: Households and individuals, August: 1--49. Retrieved from https://www.ons.gov.uk/peoplepopulationandcommunit y/householdcharacteristics/homeinternetandsocialmedi ausage/bulletins/internetaccesshouseholdsandindividua ls/2015-08-06",
      "doi": ""
    },
    {
      "text": "Nayef Al-Rodhan. 2017. Post-Truth Politics, the Fifth Estate and the Securitization of Fake News. Global Policy Journal. Retrieved from http://www.globalpolicyjournal.com/blog/07/06/2017/p ost-truth-politics-fifth-estate-and-securitization-fakenewsaa",
      "doi": ""
    },
    {
      "text": "E. Pariser. The filter bubble: What the Internet is hiding from you. Penguin, London, 2011.aa ",
      "doi": "10.5555/2029079"
    },
    {
      "text": "Mattia Samory and Enoch Peserico. 2017. Sizing Up the Troll: A Quantitative Characterization of Moderator-Identified Trolling in an Online Forum. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '17: 6--10.  ",
      "doi": "10.1145/3025453.3026007"
    },
    {
      "text": "Jorge de-la-Peña-Sordo, Iker Pastor-López, Xabier Ugarte-Pedrero, Igor Santos, and Pablo García Bringas. 2014. Anomalous User Comment Detection in Social News Websites. In International Joint Conference SOCO'14-CISIS'14-ICEUTE'14: Bilbao, Spain, June 25th-27th, 2014, Proceedings, José Gaviria de la Puerta, Iván García Ferreira, Pablo Garcia Bringas, et al. (eds.). Springer International Publishing, Cham, 517--526.",
      "doi": ""
    },
    {
      "text": "The Economist, \"Art of the lie.\", September 10, 2016. Accessed September 19, 2017. https://www.economist.com/news/leaders/21706525politicians-have-always-lied-does-it-matter-if-theyleave-truth-behind-entirely-art",
      "doi": ""
    },
    {
      "text": "Kevin Wise, Brian Hamman, and Kjerstin Thorson. 2006. Moderation, response rate, and message interactivity: Features of online communities and their effects on intent to participate. Journal of ComputerMediated Communication 12, 1: 24--41.",
      "doi": ""
    }
  ]
}