{
  "doi": "10.1145/3173574.3173708",
  "title": "Understanding Identity Presentation in Medical Crowdfunding",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "People desire to present themselves favorably to others. However, medical crowdfunding beneficiaries are often expected to present their dire medical conditions and financial straits to solicit financial support. To investigate how beneficiaries convey their situation on medical crowdfunding pages and how contributors perceive the presented information, we interviewed both medical crowdfunding beneficiaries and contributors. While beneficiaries emphasized the serious of their medical situations to signal their deservedness of support, contributor participants gave less attention to that content. Rather, they focused on their impression of the beneficiary's character formed by various features of contributions such as the contributor's names, messages, and shared pictures. These contribution features further signaled common connections between the beneficiary and contributors and each contributor's unique involvement in the beneficiary's medical journey. However, the contribution amount resulted in judgement about other contributors. We suggest design opportunities and challenges that apply these results to the design of medical crowdfunding interfaces.",
  "authors": [
    {
      "name": "Jennifer G. Kim",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498653663",
      "orcid": "0000-0003-3253-3963"
    },
    {
      "name": "Hwajung Hong",
      "institution": "Ulsan National Institute of Science & Technology (UNIST), Ulsan, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022414",
      "orcid": "0000-0001-5268-3331"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "University of Illinois at Urbana-Champaign & Adobe Research, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    }
  ],
  "references": [
    {
      "text": "Moira Burke and Robert Kraut. 2014. Growing Closer on Facebook?: Changes in Tie Strength Through Social Network Site Use. Proc. CHI 2014.  ",
      "doi": "10.1145/2556288.2557094"
    },
    {
      "text": "Gordon Burtch and Jason Chan. 2014. Reducing Medical Bankruptcy Through Crowdfunding?: Evidence from GiveForward. Proc. ICIS 2014, 1--19.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity. Proc. ICSWM 2014: 71--80.",
      "doi": ""
    },
    {
      "text": "Chia-fang Chung, Elena Agapie, Jessica Schroeder, Sonali Mishra, James Fogarty, and Sean A Munson. 2017. When Personal Tracking Becomes Social?: Examining the Use of Instagram for Healthy Eating. In Proc. CHI 2017.  ",
      "doi": "10.1145/3025453.3025747"
    },
    {
      "text": "Laura Dabbish, Colleen Stuart, Jason Tsay, and Jim Herbsleb. 2012. Social Coding in GitHub: Transparency and Collaboration in an Open Software Repository. Proc. CSCW 2012, 1277--1286.  ",
      "doi": "10.1145/2145204.2145396"
    },
    {
      "text": "Katie Derthick, Patrick Tsao, Travis Kriplean, Alan Borning, Mark Zachry, and David W Mcdonald. 2011. Collaborative Sensemaking during Admin Permission Granting in Wikipedia. Proc. OCSC 2011, 100--109. ",
      "doi": "10.5555/2029127.2029140"
    },
    {
      "text": "Sanorita Dey, Brittany Duff, and Karrie Karahalios. 2017. The Art and Science of Persuasion?: Not All Crowdfunding Campaign Videos Are The Same Predictors of Crowdfunding Success. Proc. CSCW 2017.  ",
      "doi": "10.1145/2998181.2998229"
    },
    {
      "text": "Joan Morris DiMicco and David R Millen. 2007. Identity Management: Multiple Presentations of Self in Facebook. Proc. Group 2007.  ",
      "doi": "10.1145/1316624.1316682"
    },
    {
      "text": "Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2006. Managing Impressions Online?: Self Presentation Processes in the Online Dating Environment. J. Comput. Commun. 11: 415--441.",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, and Sean A. Munson. 2015. From \"nobody cares\" to \"way to go!\" Proc. CSCW 2015: 1622--1636.  ",
      "doi": "10.1145/2675133.2675135"
    },
    {
      "text": "Andrew T Fiore, Lindsay S Taylor, G A Mendelsohn, Marti Hearst, and South Hall. 2008. Assessing Attractiveness in Online Dating Profiles. Proc. CHI 2008, 797--806.  ",
      "doi": "10.1145/1357054.1357181"
    },
    {
      "text": "Elizabeth M Gerber and Julie Hui. 2013. Crowdfunding?: Motivations and Deterrents for Participation. ACM Trans. Comput. Interact. 20, 6: 32.  ",
      "doi": "10.1145/2530540"
    },
    {
      "text": "Eric Gilbert and Karrie Karahalios. 2009. Predicting tie strength with social media. In Proc. CHI 2009, ACM Press.  ",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "Erving Goffman. 1959. The Presentation of Self in Everyday Life. Anchor: New York.",
      "doi": ""
    },
    {
      "text": "Amy Gonzales. 2017. Flexibility and Intangibles?: The Crowdfunding Needs of Stigmatized Individuals. Proc. CHI 2017: 2371--2375.  ",
      "doi": "10.1145/3025453.3025647"
    },
    {
      "text": "Amy L Gonzales, Elizabeth Y Kwon, Teresa Lynch, and Nicole Fritz. 2016. \"Better everyone should know our business than we lose our house\": Costs and benefits of medical crowdfunding for support, privacy, and identity. New Media Soc.",
      "doi": ""
    },
    {
      "text": "Lauren M Hamel and Hillary C Shulman. 2009. Self-Generated Versus Other-Generated Statements and Impressions in Computer-Mediated Communication. Communic. Res.: 229--253.",
      "doi": ""
    },
    {
      "text": "William Harbaugh. 1998. The prestige motive for making charitable transfers. Am. Econ. Rev. Pap. Proc. 88, 2: 277--82.",
      "doi": ""
    },
    {
      "text": "Emily Harburg, Julie Hui, Mike Greenberg, and Elizabeth Gerber. 2015. Understanding the effect of Crowdfunding on entrepreneurial self-efficacy. Proc. CSCW 2015: 3--16.  ",
      "doi": "10.1145/2675133.2675142"
    },
    {
      "text": "Andrea Hartzler and Wanda Pratt. 2011. Managing the personal side of health: how patient expertise differs from the expertise of clinicians. J. Med. Internet Res. 13, 3: e62.",
      "doi": ""
    },
    {
      "text": "Julie S. Hui, Elizabeth M. Gerber, and Darren Gergle. 2014. Understanding and Leveraging Social Networks for Crowdfunding: Opportunities and Challenges. Proc. DIS 2014, ACM Press, 2083--2088.  ",
      "doi": "10.1145/2598510.2598539"
    },
    {
      "text": "Jennifer G. Kim, Kristen Vaccaro, Karrie Karahalios, and Hwajung Hong. 2017. \"Not by Money Alone\"?: Social Support Opportunities in Medical Crowdfunding Campaigns. Proc. CSCW 2017.  ",
      "doi": "10.1145/2998181.2998245"
    },
    {
      "text": "Jennifer G Kim, Ha Kyung Kong, Karrie Karahalios, Wai-tat Fu, and Hwajung Hong. 2016. The Power of Collective Endorsements?: Credibility Factors in Medical Crowdfunding Campaigns. Proc. CHI 2016.  ",
      "doi": "10.1145/2858036.2858289"
    },
    {
      "text": "Jennifer G Kim, Stephany Park, Karrie Karahalios, and Michael Twidale. 2015. Labor Saving and Labor Making of Value in Online Congratulatory Messages. Proc. SocInfo 2015.",
      "doi": ""
    },
    {
      "text": "Cliff Lampe, Nicole Ellison, and Charles Steinfield. 2007. A Familiar Face ( book ): Profile Elements as Signals in an Online Social Network. Proc. CHI 2007: 435--444.  ",
      "doi": "10.1145/1240624.1240695"
    },
    {
      "text": "Lena Mamykina, Andrew D Miller, Elizabeth D Mynatt, and Daniel Greenblatt. 2010. Constructing Identities through Storytelling in Diabetes Management. Proc. CHI 2010, 1203--1212.  ",
      "doi": "10.1145/1753326.1753507"
    },
    {
      "text": "Jennifer Marlow and Laura Dabbish. 2013. Activity Traces and Signals in Software Developer Recruitment and Hiring. Proc. CSCW 2013, 145--155.  ",
      "doi": "10.1145/2441776.2441794"
    },
    {
      "text": "Jennifer Marlow, Laura Dabbish, and Jim Herbsleb. 2013. Impression Formation in Online Peer Production?: Activity Traces and Personal Profiles in GitHub. Proc. CSCW 2013, 117--128.  ",
      "doi": "10.1145/2441776.2441792"
    },
    {
      "text": "Ethan Mollick. 2014. The dynamics of crowdfunding: An exploratory study. J. Bus. Ventur. 29: 1--16.",
      "doi": ""
    },
    {
      "text": "Mark W Newman, Debra Lauterbach, Sean a Munson, Paul Resnick, and Margaret E Morris. 2011. It' s not that I don't have problems, I'm just not putting them on Facebook\": Challenges and Opportunities in. Proc. CSCW 2011: 341--350.  ",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Vineeth Rakesh, Jaegul Choo, and Chandan Reddy. 2015. Project Recommendation Using Heterogeneous Traits in Crowdfunding. Proc. ICSWM 2015.",
      "doi": ""
    },
    {
      "text": "Julia Sisler. 2012. Crowdfunding for medical expenses. C. Can. Med. Assoc. J. 184, 2: 123--124.",
      "doi": ""
    },
    {
      "text": "Dan Sosik, Victoria, Zhao, Xuan, Cosley. 2012. See Friendship, Sort of?: How Conversation and Digital Traces Might Support Reflection on Friendships. CSCW 2012, 1145--1154.  ",
      "doi": "10.1145/2145204.2145374"
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of Silence, Areanas of Voice: The Ecology of Visible and Ivisible Work. Comput. Support. Coop. Work 8, 1995: 8--30.  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Katie G Tanaka and Amy Voida. 2016. Legitimacy Work?: Invisible Work in Philanthropic Crowdfunding. Proc. CHI 2016.  ",
      "doi": "10.1145/2858036.2858110"
    },
    {
      "text": "David Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. Am. J. Eval. 27, 2: 237--246.",
      "doi": ""
    },
    {
      "text": "Tatiana Vlahovic, Yi-Chia Wang, Robert Kraut, and John Levine. 2014. Support matching and satisfaction in an online breast cancer support community. Proc. CHI 2014: 1625--1634.  ",
      "doi": "10.1145/2556288.2557108"
    },
    {
      "text": "Darcy Warkentin, Michael Woodworth, Jeffrey T. Hancock, and Nicole Cormier. 2010. Warrants and deception in computer mediated communication. Proc. CSCW 2010, ACM Press, 9--12.  ",
      "doi": "10.1145/1718918.1718922"
    },
    {
      "text": "Anbang Xu, Xiao Yang, Huaming Rao, Wai-tat Fu, Shih-wen Huang, and Brian P Bailey. 2014. Show Me the Money! An Analysis of Project Updates during Crowdfunding Campaigns. Proc. CHI 2014, 591--600.  ",
      "doi": "10.1145/2556288.2557045"
    },
    {
      "text": "Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The Many Faces of Facebook?: Experiencing Social Media as Performance, Exhibition, and Personal Archive. Proc. CHI 2013: 1--10.  ",
      "doi": "10.1145/2470654.2470656"
    },
    {
      "text": "Nvivo Tool. Retrieved from http://www.qsrinternational.com",
      "doi": ""
    }
  ]
}