{
  "doi": "10.1145/3173574.3173792",
  "title": "Projective Windows: Bringing Windows in Space to the Fingertip",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2018,
  "badges": [],
  "abstract": "In augmented and virtual reality (AR and VR), there may be many 3D planar windows with 2D texts, images, and videos on them. However, managing the position, orientation, and scale of such a window in an immersive 3D workspace can be difficult. Projective Windows strategically uses the absolute and apparent sizes of the window at various stages of the interaction to enable the grabbing, moving, scaling, and releasing of the window in one continuous hand gesture. With it, the user can quickly and intuitively manage and interact with windows in space without any controller hardware or dedicated widget. Through an evaluation, we demonstrate that our technique is performant and preferable, and that projective geometry plays an important role in the design of spatial user interfaces.",
  "tags": [
    "3d window management",
    "augmented reality",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Joon Hyub Lee",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659205926",
      "orcid": "missing"
    },
    {
      "name": "Sang-Gyun An",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659205168",
      "orcid": "missing"
    },
    {
      "name": "Yongkwan Kim",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502698004",
      "orcid": "missing"
    },
    {
      "name": "Seok-Hyung Bae",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392591403",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic interaction: designing for a proximity and orientation-aware environment. In Proc. ITS '10, 121--130.  ",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Richard W. Bukowski and Carlo H. Séquin. 1995. Object associations: a simple and practical approach to virtual 3D manipulation. In Proc. I3D '95, 131-ff.  ",
      "doi": "10.1145/199404.199427"
    },
    {
      "text": "Li-Wei Chan, Hui-Shan Kao, Mike Y. Chen, Ming-Sui Lee, Jane Hsu, and Yi-Ping Hung. 2010. Touching the void: direct-touch interaction for intangible displays. In Proc. CHI '10, 2625--2634.  ",
      "doi": "10.1145/1753326.1753725"
    },
    {
      "text": "Barrett Ens, Juan David Hincapié-Ramos, and Pourang Irani. 2014. Ethereal planes: a design framework for 2D information space in 3D mixed reality environments. In Proc. SUI '14, 2--12.  ",
      "doi": "10.1145/2659766.2659769"
    },
    {
      "text": "Barrett M. Ens, Rory Finnegan, and Pourang P. Irani. 2014. The personal cockpit: a spatial interface for effective task switching on head-worn displays. In Proc. CHI '14, 3171--3180.  ",
      "doi": "10.1145/2556288.2557058"
    },
    {
      "text": "Steven Feiner, Blair MacIntyre, Marcus Haupt, and Eliot Solomon. 1993. Windows on the world: 2D windows for 3D augmented reality. In Proc. UIST '93,145--155.  ",
      "doi": "10.1145/168642.168657"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2005. The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area. In Proc. CHI '05, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Jan Gugenheimer, David Dobbelstein, Christian Winkler, Gabriel Haas, and Enrico Rukzio. 2016. FaceTouch: enabling touch interaction in display fixed UIs for mobile virtual reality. In Proc. UIST '16, 49--60.  ",
      "doi": "10.1145/2984511.2984576"
    },
    {
      "text": "Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: wearable multitouch interaction everywhere. In Proc. UIST '11, 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Valentin Heun, James Hobin, and Pattie Maes. 2013. Reality editor: programming smarter objects. In Adj. Proc. UbiComp '13, 307--310.  ",
      "doi": "10.1145/2494091.2494185"
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. A survey of design issues in spatial input. In Proc. UIST '94, 213--222.  ",
      "doi": "10.1145/192426.192501"
    },
    {
      "text": "Joon Hyub Lee, Seok-Hyung Bae, Jinyung Jung, and Hayan Choi. 2012. Transparent display interaction without binocular parallax. In Adj. Proc. UIST '12, 9798.  ",
      "doi": "10.1145/2380296.2380340"
    },
    {
      "text": "Joon Hyub Lee and Seok-Hyung Bae. 2013. Binocular cursor: enabling selection on transparent displays troubled by binocular parallax. In Proc. CHI '13, 31693172.  ",
      "doi": "10.1145/2470654.2466433"
    },
    {
      "text": "Frank Chun Yat Li, David Dearman, and Khai N. Truong. 2009. Virtual shelves: interactions with orientation aware devices. In Proc. UIST '09, 125--128.  ",
      "doi": "10.1145/1622176.1622200"
    },
    {
      "text": "Alistair P. Mapp, Hiroshi Ono, and Raphael Barbeito. 2003. What does the dominant eye dominate? A brief and somewhat contentious review. Attention, Perception, & Psychophysics, 65(2), 310--317.",
      "doi": ""
    },
    {
      "text": "Mark R. Mine. 1995. Virtual Environment Interaction Techniques. UNC Chapel Hill CS Dept.",
      "doi": ""
    },
    {
      "text": "Kyle Orland. 2014. Will VR make flat panels obsolete? Oculus' founder gives it 20 years. Ars Technica. Retrieved September 19, 2017 from https://arstechnica.com/gaming/2014/04/will-vr-makeflat-panels-obsolete-oculus-founder-gives-it-20-years/",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Pierce, Andrew S. Forsberg, Matthew J. Conway, Seung Hong, Robert C. Zeleznik, and Mark R. Mine. 1997. Image plane interaction techniques in 3D immersive environments. In Proc. I3D '97, 39-ff.  ",
      "doi": "10.1145/253284.253303"
    },
    {
      "text": "Ivan Poupyrev, Mark Billinghurst, Suzanne Weghorst, and Tadao Ichikawa. 1996. The go-go interaction technique: non-linear mapping for direct manipulation in VR. In Proc. UIST '96, 79--80.  ",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "George Robertson, Maarten van Dantzich, Daniel Robbins, Mary Czerwinski, Ken Hinckley, Kirsten Risden, David Thiel, and Vadim Gorokhovsky. 2000. The Task Gallery: a 3D window manager. In Proc. CHI '00, 494--501.  ",
      "doi": "10.1145/332040.332482"
    },
    {
      "text": "David Canfield Smith, Charles Irby, Ralph Kimball, Bill Verplank, and Eric Harslem. 1987. Designing the Star user interface. Byte, 7, 242--282.",
      "doi": ""
    },
    {
      "text": "Paul S. Strauss and Rikk Carey. 1992. An objectoriented 3D graphics toolkit. In Proc. SIGGRAPH '92, 341--349.  ",
      "doi": "10.1145/133994.134089"
    },
    {
      "text": "Dimitar Valkov, Frank Steinicke, Gerd Bruder, and Klaus Hinrichs. 2011. 2D touching of 3D stereoscopic objects. In Proc. CHI '11, 1353--1362.  ",
      "doi": "10.1145/1978942.1979142"
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21st century. Scientific American, 265(3), 94--104.",
      "doi": ""
    }
  ]
}