{
  "doi": "10.1145/3173574.3173592",
  "title": "Point-and-Shake: Selecting from Levitating Object Displays",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Acoustic levitation enables a radical new type of human-computer interface composed of small levitating objects. For the first time, we investigate the selection of such objects, an important part of interaction with a levitating object display. We present Point-and-Shake, a mid-air pointing interaction for selecting levitating objects, with feedback given through object movement. We describe the implementation of this technique and present two user studies that evaluate it. The first study found that users could accurately (96%) and quickly (4.1s) select objects by pointing at them. The second study found that users were able to accurately (95%) and quickly (3s) select occluded objects. These results show that Point-and-Shake is an effective way of initiating interaction with levitating object displays.",
  "tags": [
    "selection",
    "pointing",
    "ray-cast pointing",
    "acoustic levitation"
  ],
  "authors": [
    {
      "name": "Euan Freeman",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548012975",
      "orcid": "missing"
    },
    {
      "name": "Julie Williamson",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81442606751/rel-imgonly/julie_pic.jpg",
      "acmid": "81442606751",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    }
  ],
  "references": [
    {
      "text": "Tobias Alrøe, Jonas Grann, Erik Grönvall, Marianne Graves Petersen, and Jesper L. Rasmussen. 2012. Aerial Tunes: Exploring Interaction Qualities of Mid-air Displays. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction - NordiCHI '12. ACM Press, 514--523.  ",
      "doi": "10.1145/2399016.2399095"
    },
    {
      "text": "Thomas Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: Multi-Point Mid-Air Haptic Feedback for Touch Surfaces. In Proceedings of the 26th Symposium on User Interface Software and Technology - UIST '13. ACM Press, 505--514.  ",
      "doi": "10.1145/2501988.2502018"
    },
    {
      "text": "Euan Freeman, Ross Anderson, Carl Andersson, Julie Williamson, and Stephen Brewster. 2017. Floating Widgets: Interaction with Acoustically-Levitated Widgets. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces - ISS '17 Demos. ACM Press, 417--420.  ",
      "doi": "10.1145/3132272.3132294"
    },
    {
      "text": "Euan Freeman, Stephen Brewster, and Vuokko Lantz. 2014. Tactile Feedback for Above-Device Gesture Interfaces: Adding Touch to Touchless Interactions. In Proceedings of the 16th International Conference on Multimodal Interaction - ICMI '14. ACM Press, 419--426.  ",
      "doi": "10.1145/2663204.2663280"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2006. The design and evaluation of selection techniques for 3D volumetric displays. In Proceedings of the 19th annual ACM symposium on User interface software and technology - UIST '06. ACM Press, 3--12.  ",
      "doi": "10.1145/1166253.1166257"
    },
    {
      "text": "Tovi Grossman, Daniel Wigdor, and Ravin Balakrishnan. 2005. Multi-finger gestural interaction with 3D volumetric displays. ACM Transactions on Graphics 24, 2 (2005), 931.  ",
      "doi": "10.1145/1073204.1073287"
    },
    {
      "text": "Keisuke Hasegawa and Hiroyuki Shinoda. 2013. Aerial Display of Vibrotactile Sensation with High Spatial-Temporal Resolution using Large-Aperture Airborne Ultrasound Phased Array. In Proceedings of World Haptics 2013. IEEE, 31--36.",
      "doi": ""
    },
    {
      "text": "Takayuki Hoshi, Masafumi Takahashi, Takayuki Iwamoto, and Hiroyuki Shinoda. 2010. Noncontact Tactile Display Based on Radiation Pressure of Airborne Ultrasound. IEEE Transactions on Haptics 3, 3 (2010), 155--165.  ",
      "doi": "10.1109/TOH.2010.4"
    },
    {
      "text": "Seki Inoue, Yasutoshi Makino, and Hiroyuki Shinoda. 2015. Active touch perception produced by airborne ultrasonic haptic hologram. In Proceedings of IEEE World Haptics Conference - WHC '15. IEEE, 362--367.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical Atoms: Beyond Tangible Bits, Toward Transformable Materials. Interactions XIX.1 (2012), 38--51.  ",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, and Jean-Daniel Fekete. 2013. Evaluating the Efficiency of Physical Visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, 2593--2602.  ",
      "doi": "10.1145/2470654.2481359"
    },
    {
      "text": "Georgios Korres and Mohamad Eid. 2016. Haptogram: Ultrasonic Point-Cloud Tactile Stimulation. IEEE Access 4 (2016), 7758 -- 7769.",
      "doi": ""
    },
    {
      "text": "Jinha Lee, Rehmi Post, and Hiroshi Ishii. 2011. ZeroN: Mid-Air Tangible Interaction Enabled by Computer Controlled Magnetic Levitation. In Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11. ACM Press, 327--366.  ",
      "doi": "10.1145/2047196.2047239"
    },
    {
      "text": "Asier Marzo, Sue Ann Seah, Bruce W. Drinkwater, Deepak Ranjan Sahoo, Benjamin Long, and Sriram Subramanian. 2015. Holographic acoustic elements for manipulation of levitated objects. Nature Communications 6 (2015), Article 8661.",
      "doi": ""
    },
    {
      "text": "Yoichi Ochiai, Takayuki Hoshi, and Jun Rekimoto. 2014. Pixie Dust: Graphics Generated by Levitated and Animated Objects in Computation Acoustic-Potential Field. ACM Transactions on Graphics 33, 4 (2014), Article 85.  ",
      "doi": "10.1145/2601097.2601118"
    },
    {
      "text": "Yoichi Ochiai, Takayuki Hoshi, and Ippei Suzuki. 2017. Holographic Whisper: Rendering Audible Sound Spots in Three-dimensional Space by Focusing Ultrasonic Waves. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, 4314--4325.  ",
      "doi": "10.1145/3025453.3025989"
    },
    {
      "text": "Themis Omirou, Asier Marzo, Sue Ann Seah, and Sriram Subramanian. 2015. LeviPath: Modular Acoustic Levitation for 3D Path Visualisations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, 309--312.  ",
      "doi": "10.1145/2702123.2702333"
    },
    {
      "text": "Themis Omirou, Asier Marzo Perez, Sriram Subramanian, and Anne Roudaut. 2016. Floating Charts: Data Plotting using Free-Floating Acoustically Levitated Representations. In 2016 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 187--190.",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Mark Billinghurst, Suzanne Weghorst, and Tadao Ichikawa. 1996. The Go-Go Interaction Technique: Non-Linear Mapping for Direct Manipulation in VR. In Proceedings of the 9th annual ACM symposium on User interface software and technology - UIST '96. ACM Press, 79--80.  ",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Deepak Ranjan Sahoo, Takuto Nakamura, Asier Marzo, Themis Omirou, Michihiro Asakawa, and Sriram Subramanian. 2016. JOLED: A Mid-air Display based on Electrostatic Rotation of Levitated Janus Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology - UIST '16. ACM Press, 437--448.  ",
      "doi": "10.1145/2984511.2984549"
    },
    {
      "text": "Lode Vanacken, Tovi Grossman, and Karin Coninx. 2009. Multimodal selection techniques for dense and occluded 3D virtual environments. International Journal of Human Computer Studies 67, 3 (2009), 237--255.  ",
      "doi": "10.1016/j.ijhcs.2008.09.001"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only ANOVA Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '11. ACM Press, 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Toshiya Yui and Tomoko Hashida. 2016. Floatio: Floating Tangible User Interface Based on Animacy Perception. In Adjunct Proceedings of the 29th Annual Symposium on User Interface Software and Technology UIST '16 Adjunct. ACM Press, 43--45.  ",
      "doi": "10.1145/2984751.2985699"
    },
    {
      "text": "Shumin Zhai, William Buxton, and Paul Milgram. 1994. Investigating The \"Silk Cursor\": Transparency for 3D Target Acquisition. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '94, Vol. 1. ACM Press, 459--465.  ",
      "doi": "10.1145/191666.191822"
    }
  ]
}