{
  "doi": "10.1145/3173574.3173914",
  "title": "BreathVR: Leveraging Breathing as a Directly Controlled Interface for Virtual Reality Games",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "With virtual reality head-mounted displays rapidly becoming accessible to mass audiences, there is growing interest in new forms of natural input techniques to enhance immersion and engagement for players. Research has explored physiological input for enhancing immersion in single player games through indirectly controlled signals like heart rate or galvanic skin response. In this paper, we propose breathing as a directly controlled physiological signal that can facilitate unique and engaging play experiences through natural interaction in single and multiplayer virtual reality games. Our study (N = 16) shows that participants report a higher sense of presence and find the gameplay more fun and challenging when using our breathing actions. From study observations and analysis we present five design strategies that can aid virtual reality game designers interested in using directly controlled forms of physiological input.",
  "authors": [
    {
      "name": "Misha Sra",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548542856",
      "orcid": "missing"
    },
    {
      "name": "Xuhai Xu",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/do/10.1145/contrib-99659534445/rel-imgonly/orson-uw-talk-head-small.png",
      "acmid": "99659534445",
      "orcid": "0000-0001-5930-3899"
    },
    {
      "name": "Pattie Maes",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319638",
      "orcid": "0000-0002-7722-6038"
    }
  ],
  "references": [
    {
      "text": "Ismo Alakärppä, Elisa Jaakkola, Ashley Colley, and Jonna Häkkilä. 2017. BreathScreen: Design and Evaluation of an Ephemeral UI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4424--4429.  ",
      "doi": "10.1145/3025453.3025973"
    },
    {
      "text": "Durand R Begault and Leonard J Trejo. 2000. 3-D sound for virtual reality and multimedia. (2000). ",
      "doi": "10.5555/184407"
    },
    {
      "text": "Daniel Bersak, Gary McDarby, Ned Augenblick, Phil McDarby, Daragh McDonnell, Brian McDonald, and Rahul Karkun. 2001. Intelligent biofeedback using an immersive competitive environment. Paper at the Designing Ubiquitous Computing Games Workshop at UbiComp.",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst and Bill Buxton. 2011. Gesture based interaction. Haptic input 24 (2011).",
      "doi": ""
    },
    {
      "text": "E Bisson, Bruce Contant, Heidi Sveistrup, and Yves Lajoie. 2007. Functional balance and dual-task reaction times in older adults are improved by virtual reality and biofeedback training. Cyberpsychology & behavior 10, 1 (2007), 16--23.",
      "doi": ""
    },
    {
      "text": "C Burdea Grigore and P Coiffet. 1994. Virtual reality technology. London: Wiley-Interscience. ",
      "doi": "10.5555/177812"
    },
    {
      "text": "Mihaly Csikszentmihalyi. 2000. Beyond boredom and anxiety. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Char Davies and John Harrison. 1996. Osmose: Towards Broadening the Aesthetics of Virtual Reality. SIGGRAPH Comput. Graph. 30, 4 (Nov. 1996), 25--28.  ",
      "doi": "10.1145/240806.240808"
    },
    {
      "text": "Yvonne AW De Kort, Wijnand A IJsselsteijn, and Karolien Poels. 2007. Digital games as social presence technology: Development of the Social Presence in Gaming Questionnaire (SPGQ). Proceedings of PRESENCE 195203 (2007).",
      "doi": ""
    },
    {
      "text": "Gary D Ellis, Judith E Voelkl, and Catherine Morris. 1994. Measurement and analysis issues with explanation of variance in daily experience using the flow model. Journal of leisure research 26, 4 (1994), 337.",
      "doi": ""
    },
    {
      "text": "Diarmaid Fitzgerald, John Foody, Dan Kelly, Tomas Ward, Charles Markham, John McDonald, and Brian Caulfield. 2007. Development of a wearable motion capture suit and virtual reality biofeedback system for the instruction and analysis of sports rehabilitation exercises. In Engineering in Medicine and Biology Society, 2007. EMBS 2007. 29th Annual International Conference of the IEEE. IEEE, 4870--4874.",
      "doi": ""
    },
    {
      "text": "Kiel Gilleade, Alan Dix, and Jen Allanson. 2005. Affective videogames and modes of affective gaming: assist me, challenge me, emote me. DiGRA 2005: Changing Views--Worlds in Play. (2005).",
      "doi": ""
    },
    {
      "text": "Sara Ilstedt Hjelm. 2003. Research + Design: The Making of Brainball. interactions 10, 1 (Jan. 2003), 26--34.  ",
      "doi": "10.1145/604575.604576"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3131--3142.  ",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Wijnand IJsselsteijn, Karolien Poels, and Yvonne AW de Kort. 2008. The Game Experience Questionnaire: Development of a self-report measure to assess player experiences of digital games. TU Eindhoven, Eindhoven, The Netherlands (2008).",
      "doi": ""
    },
    {
      "text": "Dhruv Jain, Misha Sra, Jingru Guo, Rodrigo Marques, Raymond Wu, Justin Chiu, and Chris Schmandt. 2016. Immersive Terrestrial Scuba Diving Using Virtual Reality. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1563--1569.  ",
      "doi": "10.1145/2851581.2892503"
    },
    {
      "text": "Mikkel R Jakobsen and Kasper Hornbæk. 2016. Negotiating for Space?: Collaborative Work Using a Wall Display with Mouse and Touch Input.. In CHI. 2050--2061.  ",
      "doi": "10.1145/2858036.2858158"
    },
    {
      "text": "Henry Jenkins. 2004. Game design as narrative. Computer 44 (2004), 53.",
      "doi": ""
    },
    {
      "text": "Jason Jerald. 2015. The VR book: human-centered design for virtual reality. Morgan & Claypool. ",
      "doi": "10.5555/2886140"
    },
    {
      "text": "John N Latta and David J Oberg. 1994. A conceptual virtual reality model. IEEE Computer Graphics and Applications 14, 1 (1994), 23--29.  ",
      "doi": "10.1109/38.250915"
    },
    {
      "text": "Joe Marshall, Duncan Rowland, Stefan Rennick Egglestone, Steve Benford, Brendan Walker, and Derek McAuley. 2011. Breath Control of Amusement Rides. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 73--82.  ",
      "doi": "10.1145/1978942.1978955"
    },
    {
      "text": "André Mourão and João Magalhães. 2013. Competitive Affective Gaming: Winning with a Smile. In Proceedings of the 21st ACM International Conference on Multimedia (MM '13). ACM, New York, NY, USA, 83--92.  ",
      "doi": "10.1145/2502081.2502115"
    },
    {
      "text": "Lennart Erik Nacke, Michael Kalyn, Calvin Lough, and Regan Lee Mandryk. 2011. Biofeedback Game Design: Using Direct and Indirect Physiological Control to Enhance Game Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 103--112.  ",
      "doi": "10.1145/1978942.1978958"
    },
    {
      "text": "Federica Pallavicini, Davide Algeri, Claudia Repetto, Alessandra Gorini, and Giuseppe Riva. 2009. Biofeedback, virtual reality and mobile phones in the treatment of Generalized Anxiety Disorder (GAD): A phase-2 controlled clinical trial. Journal of CyberTherapy and Rehabilitation 2, 4 (2009), 315--327.",
      "doi": ""
    },
    {
      "text": "Avinash Parnandi, Beena Ahmed, Eva Shipp, and Ricardo Gutierrez-Osuna. 2013. Chill-Out: Relaxation training through respiratory biofeedback in a mobile casual game. In International Conference on Mobile Computing, Applications, and Services. Springer, 252--260.",
      "doi": ""
    },
    {
      "text": "W Boyd Rayward and Michael B Twidale. 1999. From Docent to Cyberdocent: Education and Guidancein the Virtual Museum. Archives and Museum Informatics 13, 1 (1999), 23--53.",
      "doi": ""
    },
    {
      "text": "Joan Sol Roo, Renaud Gervais, Jeremy Frey, and Martin Hachet. 2017. Inner Garden: Connecting Inner States to a Mixed Reality Sandbox for Mindfulness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1459--1470.  ",
      "doi": "10.1145/3025453.3025743"
    },
    {
      "text": "José Luis González Sánchez, Francisco Luis Gutiérrez Vela, Francisco Montero Simarro, and Natalia Padilla-Zea. 2012. Playability: analysing user experience in video games. Behaviour & Information Technology 31, 10 (2012), 1033--1054.  ",
      "doi": "10.1080/0144929X.2012.710648"
    },
    {
      "text": "Holger Schnädelbach, Kevin Glover, and Ainojie Alexander Irune. 2010. ExoBuilding: Breathing Life into Architecture. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, New York, NY, USA, 442--451.  ",
      "doi": "10.1145/1868914.1868965"
    },
    {
      "text": "Holger Schnädelbach, Ainojie Irune, David Kirk, Kevin Glover, and Patrick Brundell. 2012. ExoBuilding: Physiologically Driven Adaptive Architecture. ACM Trans. Comput.-Hum. Interact. 19, 4, Article 25 (Dec. 2012), 22 pages.  ",
      "doi": "10.1145/2395131.2395132"
    },
    {
      "text": "Mel Slater and Maria V Sanchez-Vives. 2016. Enhancing our lives with immersive virtual reality. Frontiers in Robotics and AI 3 (2016), 74.",
      "doi": ""
    },
    {
      "text": "Mel Slater and Martin Usoh. 1994. Body centred interaction in immersive virtual environments. Artificial life and virtual reality 1, 1994 (1994), 125--148.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of presence in virtual environments. Presence: Teleoperators & Virtual Environments 3, 2 (1994), 130--144.  ",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Tobias Sonne and Mads Møller Jensen. 2016. ChillFish: A Respiration Game for Children with ADHD. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 271--278.  ",
      "doi": "10.1145/2839462.2839480"
    },
    {
      "text": "Florian Soyka, Markus Leyrer, Joe Smallwood, Chris Ferguson, Bernhard E. Riecke, and Betty J. Mohler. 2016. Enhancing Stress Management Techniques Using Virtual Reality. In Proceedings of the ACM Symposium on Applied Perception (SAP '16). ACM, New York, NY, USA, 85--88.  ",
      "doi": "10.1145/2931002.2931017"
    },
    {
      "text": "Ivan E Sutherland. 1965. The ultimate display. Multimedia: From Wagner to virtual reality (1965).",
      "doi": ""
    },
    {
      "text": "Eugene M. Taranta II, Amirreza Samiei, Mehran Maghoumi, Pooya Khaloo, Corey R. Pittman, and Joseph J. LaViola Jr. 2017. Jackknife: A Reliable Recognizer with Few Samples and Many Modalities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5850--5861.  ",
      "doi": "10.1145/3025453.3026002"
    },
    {
      "text": "Paul Tennent, Duncan Rowland, Joe Marshall, Stefan Rennick Egglestone, Alexander Harrison, Zachary Jaime, Brendan Walker, and Steve Benford. 2011. Breathalising Games: Understanding the Potential of Breath Control in Game Interfaces. In Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology (ACE '11). ACM, New York, NY, USA, Article 58, 8 pages.  ",
      "doi": "10.1145/2071423.2071496"
    },
    {
      "text": "Daniel Yule, Bonnie MacKay, and Derek Reilly. 2015. Operation Citadel: Exploring the Role of Docents in Mixed Reality. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, New York, NY, USA, 285--294.  ",
      "doi": "10.1145/2793107.2793135"
    },
    {
      "text": "Daniel Zielasko, Sebastian Freitag, Dominik Rausch, Yuen C. Law, Benjamin Weyers, and Torsten W. Kuhlen. 2015. BlowClick: A Non-Verbal Vocal Input Metaphor for Clicking. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction (SUI '15). ACM, New York, NY, USA, 20--23.  ",
      "doi": "10.1145/2788940.2788953"
    },
    {
      "text": "Thomas G Zimmerman, Jaron Lanier, Chuck Blanchard, Steve Bryson, and Young Harvill. 1987. A hand gesture interface device. In ACM SIGCHI Bulletin, Vol. 18. ACM, 189--192.  ",
      "doi": "10.1145/1165387.275628"
    }
  ]
}