{
  "doi": "10.1145/3173574.3173935",
  "title": "How “Wide Walls” Can Increase Engagement: Evidence From a Natural Experiment in Scratch",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "A core aim for designing constructionist learning systems and toolkits is enabling \"wide walls\"-a metaphor used to describe supporting a diverse range of creative outcomes. Ensuring that a broad design space is afforded to learners by a toolkit is a common approach to achieving wide walls. We use econometric methods to provide an empirical test of the wide walls theory through a natural experiment in the Scratch online community. We estimate the causal effect of a policy change that gave a large number of Scratch users access to a more powerful version of Scratch data structures, effectively widening the walls for learners. We show that access to and use of these more powerful new data structures caused learners to use data structures more frequently. Our findings provide support for the theory that wide walls can increase engagement and learning.",
  "tags": [
    "creativity support tools",
    "design",
    "evaluation",
    "computers and children",
    "learning",
    "constructionism",
    "scratch"
  ],
  "authors": [
    {
      "name": "Sayamindu Dasgupta",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484641200",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hal Abelson, Nat Goodman, and Lee Rudolph. 1974. LOGO Manual. Memo 313. Massachusetts Institute of Technology, Cambridge, MA. http://dspace.mit.edu/handle/1721.1/6226",
      "doi": ""
    },
    {
      "text": "Harshit Agrawal, Rishika Jain, Prabhat Kumar, and Pradeep Yammiyavar. 2014. FabCode: Visual Programming Environment for Digital Fabrication. In Proceedings of the 2014 Conference on Interaction Design and Children (IDC '14). ACM, New York, NY, 353--356.  ",
      "doi": "10.1145/2593968.2610490"
    },
    {
      "text": "Joshua D. Angrist and Jörn-Steffen Pischke. 2008. Mostly Harmless Econometrics: An Empiricist's Companion. Princeton University Press, Princeton, NJ.",
      "doi": ""
    },
    {
      "text": "Karen Brennan and Mitchel Resnick. 2012. New frameworks for studying and assessing the development of computational thinking. In Proceedings of the 2012 annual meeting of the American Educational Research Association. AERA, Vancouver, Canada. http: //scratched.gse.harvard.edu/ct/files/AERA2012.pdf",
      "doi": ""
    },
    {
      "text": "Siddhartha Chaudhuri and Vladlen Koltun. 2010. Data-driven Suggestions for Creativity Support in 3D Modeling. ACM Trans. Graph. 29, 6 (Dec. 2010), 183:1--183:10.  ",
      "doi": "10.1145/1882261.1866205"
    },
    {
      "text": "Sayamindu Dasgupta. 2013a. From Surveys to Collaborative Art: Enabling Children to Program with Online Data. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, New York, NY, 28--35.  ",
      "doi": "10.1145/2485760.2485784"
    },
    {
      "text": "Sayamindu Dasgupta. 2013b. Surveys, collaborative art and virtual currencies: Children programming with online data. International Journal of Child-Computer Interaction 1, 3--4 (Sept. 2013), 88--98.",
      "doi": ""
    },
    {
      "text": "Sayamindu Dasgupta, William Hale, Andrés Monroy-Hernández, and Benjamin Mako Hill. 2016. Remixing as a pathway to computational thinking. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, 1438--1449.  ",
      "doi": "10.1145/2818048.2819984"
    },
    {
      "text": "Sayamindu Dasgupta and Benjamin Mako Hill. 2017. Learning to code in localized programming languages. In Proceedings of the Fourth ACM Conference on Learning @ Scale (L@S '17). ACM, New York, NY, 33--39.  ",
      "doi": "10.1145/3051457.3051464"
    },
    {
      "text": "Andrea A. diSessa. 1986. Models of computation. In User-Centered System Design: New Perspectives in Human-Computer Interaction, Donald A. Norman and Stephen W. Draper (Eds.). Lawrence Erlbaum Associates, Hillsdale, New Jersey, 201--218.",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and Jennifer Hill. 2007. Data analysis using regression and multilevel / hierarchical models. Cambridge University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Elizabeth Mara Gerber and Caitlin Kennedy Martin. 2012. Supporting Creativity Within Web-based Self-services. International Journal of Design; Vol 6, No 1 (2012) (2012). http://www.ijdesign.org/ojs/index.php/ IJDesign/article/view/911",
      "doi": ""
    },
    {
      "text": "Michael Gurevich, Paul Stapleton, and Peter Bennett. 2009. Designing for Style in New Musical Interactions. In Proceedings of the International Conference on New Interfaces for Musical Expression. Pittsburgh, PA, 213--217. http://www.nime.org/proceedings/2009/nime2009_213.pdf",
      "doi": ""
    },
    {
      "text": "Idit Harel and Seymour Papert (Eds.). 1991. Constructionism: Research reports and essays, 1985--1990. Ablex Pub. Corp., Norwood, NJ.",
      "doi": ""
    },
    {
      "text": "William G. Howell, Patrick J. Wolf, David E. Campbell, and Paul E. Peterson. 2002. School vouchers and academic performance: Results from three randomized field trials. Journal of Policy Analysis and Management 21, 2 (2002), 191--217.",
      "doi": ""
    },
    {
      "text": "Guido W. Imbens and Thomas Lemieux. 2008. Regression discontinuity designs: A guide to practice. Journal of Econometrics 142, 2 (Feb. 2008), 615--635.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai. 2006. Constructionism. In The Cambridge Handbook of the Learning Sciences (1st ed.), Keith R. Sawyer (Ed.). Cambridge University Press, Cambridge, UK, 35--46.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai and Mitchel Resnick (Eds.). 1996. Constructionism in Practice: Designing, Thinking, and Learning in a Digital World. Lawrence Erlbaum Associates, Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Caitlin Kelleher, Randy Pausch, and Sara Kiesler. 2007. Storytelling Alice Motivates Middle School Girls to Learn Computer Programming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, 1455--1464.  ",
      "doi": "10.1145/1240624.1240844"
    },
    {
      "text": "A Knörig. 2008. Design Tools Design: How to design tools for designers, and a proposal of two new tools for the design of physical interactions. Ph.D. Dissertation. University of Applied Sciences Potsdam. http://fritzing.org/media/uploads/publications/ Knoerig08_DesignToolsDesign.pdf",
      "doi": ""
    },
    {
      "text": "Alan B. Krueger and Pei Zhu. 2004. Another look at the New York City school voucher experiment. American Behavioral Scientist 47, 5 (2004), 658 --698.",
      "doi": ""
    },
    {
      "text": "Momin Malik and Jürgen Pfeffer. 2016. Identifying Platform Effects in Social Media Data. In International AAAI Conference on Web and Social Media. AAAI, Palo Alto, CA. http://www.aaai.org/ocs/index.php/ICWSM/ ICWSM16/paper/view/13163",
      "doi": ""
    },
    {
      "text": "Jean-Bernard Martens. 2014. Interactive Statistics with Illmo. ACM Trans. Interact. Intell. Syst. 4, 1 (April 2014), 4:1--4:28.  ",
      "doi": "10.1145/2509108"
    },
    {
      "text": "J. Nathan Matias, Sayamindu Dasgupta, and Benjamin Mako Hill. 2016. Skill progression in Scratch revisited. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM Press, New York, NY, 1486--1490.  ",
      "doi": "10.1145/2858036.2858349"
    },
    {
      "text": "Andrés Monroy-Hernández and Mitchel Resnick. 2008. FEATURE: Empowering Kids to Create and Share Programmable Media. Interactions 15, 2 (March 2008), 50--53.  ",
      "doi": "10.1145/1340961.1340974"
    },
    {
      "text": "Jesús Moreno-León and Gregorio Robles. 2015. Dr. Scratch: A web tool to automatically evaluate Scratch projects. In Proceedings of the Workshop in Primary and Secondary Computing Education (WiPSCE '15). ACM, New York, NY, 132--133.  ",
      "doi": "10.1145/2818314.2818338"
    },
    {
      "text": "Jesús Moreno-León, Marcos Román-González, Casper Harteveld, and Gregorio Robles. 2017. On the automatic assessment of computational thinking skills: A comparison with human experts. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, 2788--2795.  ",
      "doi": "10.1145/3027063.3053216"
    },
    {
      "text": "Richard J. Murnane and John B. Willett. 2011. Methods matter: Improving causal inference in educational and social science research. Oxford University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Sneha Narayan, Jake Orlowitz, Jonathan Morgan, Benjamin Mako Hill, and Aaron Shaw. 2017. The Wikipedia Adventure: Field Evaluation of an Interactive Tutorial for New Users. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, 1785--1799.  ",
      "doi": "10.1145/2998181.2998307"
    },
    {
      "text": "Seymour Papert. 1980. Mindstorms: Children, computers, and powerful ideas. Basic Books, New York, New York. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Seymour Papert. 1996. An exploration in the space of mathematics educations. International Journal of Computers for Mathematical Learning 1, 1 (1996), 95--123.",
      "doi": ""
    },
    {
      "text": "Seymour Papert and Idit Harel. 1991. Situating constructionism. In Constructionism. Vol. 36. Ablex Publishing, New York, NY, 1--11.",
      "doi": ""
    },
    {
      "text": "Jean Piaget. 1970. Genetic epistemology. Columbia University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick. 1996. Beyond the Centralized Mindset. Journal of the Learning Sciences 5, 1 (Jan. 1996), 1--22.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick. 2016. Designing for Wide Walls. (Aug. 2016). https://design.blog/2016/08/25/ mitchel-resnick-designing-for-wide-walls/ Archived at https://perma.cc/9N3P-48E3.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: Programming for all. Commun. ACM 52, 11 (Nov. 2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Mitchel Resnick, Brad Myers, Kumiyo Nakakoji, Ben Shneiderman, Randy Pausch, Ted Selker, and Mike Eisenberg. 2005. Design Principles for Tools to Support Creative Thinking. Technical Report. Institute for Software Research, Carnegie Mellon University, Pittsburgh, PA. http://repository.cmu.edu/isr/816 (Working paper).",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick and Brian Silverman. 2005. Some reflections on designing construction kits for kids. In Proceedings of the 2005 conference on Interaction design and children (IDC '05). ACM, New York, NY, 117--122.  ",
      "doi": "10.1145/1109540.1109556"
    },
    {
      "text": "James Randal Sargent. 1995. The programmable LEGO brick : ubiquitous computing for kids. Thesis. Massachusetts Institute of Technology. http://dspace.mit.edu/handle/1721.1/34694",
      "doi": ""
    },
    {
      "text": "Christopher Scaffidi and Christopher Chambers. 2011. Skill progression demonstrated by users in the Scratch animation environment. International Journal of Human-Computer Interaction 28, 6 (June 2011), 383--398.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2007. Creativity Support Tools: Accelerating Discovery and Innovation. Commun. ACM 50, 12 (Dec. 2007), 20--32.  ",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Judith D. Singer and John B. Willett. 2003. Applied Longitudinal Data Analysis: Modeling Change and Event Occurrence. Oxford University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Uri Wilensky. 1999. Netlogo. (1999). http://ccl.northwestern.edu/netlogo/",
      "doi": ""
    },
    {
      "text": "David Wolber, Hal Abelson, Ellen Spertus, and Liz Looney. 2011. App Inventor. O'Reilly, Sebastopol, CA.",
      "doi": ""
    },
    {
      "text": "Seungwon Yang, Carlotta Domeniconi, Matt Revelle, Mack Sweeney, Ben U. Gelman, Chris Beckley, and Aditya Johri. 2015. Uncovering trajectories of informal learning in large online communities of creators. In Proceedings of the Second (2015) ACM Conference on Learning @ Scale (L@S '15). ACM, New York, NY, 131--140.  ",
      "doi": "10.1145/2724660.2724674"
    }
  ]
}