{
  "doi": "10.1145/3173574.3174169",
  "title": "Mediating Conflicts in Minecraft: Empowering Learning in Online Multiplayer Games",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Multiplayer online games, such as Minecraft, have the potential to be powerful sites for youth learning, but can be plagued by inter-personal conflicts. This brings the need for online moderation. However, only very little is known about the practices through which such moderation happens, or how socio-technical systems could be designed to enable 'safe' learning spaces online. To start addressing this gap, our research examines the existing mediation practices within a moderated Minecraft server for children aged 8-13. As part of our 14 months long engagement, we triangulate data from participant observation, interviews, and analysis of server logs. We demonstrate how---in trying to 'keep peace'---the online moderators monopolised the conflict resolution process, essentially preventing the children from actively working with and learning from the experiences of conflict. In response to these findings, we present an alternative framework for online conflict mediation, suggesting ways in which existing conflict resolution techniques originating in Prevention Science could be re-interpreted for online multiplayer settings",
  "authors": [
    {
      "name": "Petr Slovak",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611500",
      "orcid": "missing"
    },
    {
      "name": "Katie Salen",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702612",
      "orcid": "missing"
    },
    {
      "name": "Stephanie Ta",
      "institution": "Vienna University of Technology, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022123",
      "orcid": "missing"
    },
    {
      "name": "Geraldine Fitzpatrick",
      "institution": "Vienna University of Technology, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2015. Essential Facts about the Computer and Video Games Industry (Annual report). Technical Report. Association, Entertainment Software. http://www.theesa.com/wp-content/uploads/2015/ 04/ESA-Essential-Facts-2015.pdf",
      "doi": ""
    },
    {
      "text": "J. Lawrence Aber, Joshua L. Brown, and Stephanie M. Jones. 2003. Developmental trajectories toward violence in middle childhood: Course, demographic differences, and response to school-based intervention. Developmental Psychology 39, 2 (2003), 324--348.",
      "doi": ""
    },
    {
      "text": "Yaser Adi, Amanda Killoran, Schrader McMillan, Amanda Kiloran, and S Steward-Brown. 2007. Systematic review of the effectiveness of interventions to promote mental wellbeing in children in primary education. Report 1: Universal approaches: non-violence related outcomes. Technical Report June 2007. National Institute of Health and Clinical Excellence Report (NICE).",
      "doi": ""
    },
    {
      "text": "Diego Fernando Gutierrez Aponte and Deborah Richards. 2013. Managing cyber-bullying in online educational virtual worlds. In Interactive Entertainment'13. ACM Press, New York, New York, USA, 1--9.  ",
      "doi": "10.1145/2513002.2513006"
    },
    {
      "text": "M. E. Ballard and K. M. Welch. 2015. Virtual Warfare: Cyberbullying and Cyber-Victimization in MMOG Play. Games and Culture (jun 2015).",
      "doi": ""
    },
    {
      "text": "R Bar-On, K Maree, and MJ Elias. 2007. Educating people to be emotionally intelligent. Greenwood Publishing Group.",
      "doi": ""
    },
    {
      "text": "Sasha a Barab, M Gresalfi, and Anna Arici. 2009. Why educators should care about games. Educational Leadership 67, 1 (2009), 76--80.",
      "doi": ""
    },
    {
      "text": "S. A. Barab, M. Gresalfi, and A. Ingram-Goble. 2010. Transformational Play: Using Games to Position Person, Content, and Context. Educational Researcher 39, 7 (2010), 525--536.",
      "doi": ""
    },
    {
      "text": "Diana Baumrind. 1991. The influence of parenting style on adolescent competence and substance use. The Journal of Early Adolescence 11, 1 (1991), 56--95.",
      "doi": ""
    },
    {
      "text": "Max V Birk, Benjamin Buttlar, Jason T Bowey, Susanne Poeller, Shelby C Thomson, Nicola Baumann, and Regan L Mandryk. 2016. The Effect s of Social Exclusion on Play Experience and Hostile Cognitions in Digital Games. Chi '16 (2016), 1--14.  ",
      "doi": "10.1145/2858036.2858061"
    },
    {
      "text": "Rebecca W Black and Stephanie M Reich. 2012. 14 Culture and Community in a Virtual World for Young Children. Games, learning, and society: Learning and meaning in the digital age (2012), 210.",
      "doi": ""
    },
    {
      "text": "Jeremy Blackburn and Haewoon Kwak. 2014. STFU NOOB!. In Proceedings of the 23rd international conference on World wide web - WWW '14. ACM Press, New York, New York, USA, 877--888.  ",
      "doi": "10.1145/2566486.2567987"
    },
    {
      "text": "H. Blumer. 1954. What is Wrong with Social Theory? American Sociological Review 19, 1 (1954), 3--10.",
      "doi": ""
    },
    {
      "text": "Danah Boyd. 2014. It's Complicated: the social lives of networked teens. Yale University Press. ",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "J Bridgeland, M Bruce, and A Hariharan. 2013. The missing piece: A national teacher survey on how social and emotional learning can empower children and transform schools. (2013).",
      "doi": ""
    },
    {
      "text": "Amy Bruckman, Pavel Curtis, Cliff Figallo, and Brenda Laurel. 1994. Approaches to managing deviant behavior in virtual communities. In CHI Conference Companion. 183--184.  ",
      "doi": "10.1145/259963.260231"
    },
    {
      "text": "John D Coie, Norman F Watt, Stephen G West, J David Hawkins, Joan R Asarnow, Howard J Markman, Sharon L Ramey, Myrna B Shure, and Beverly Long. 1993. The science of prevention: A conceptual framework and some directions for a national research program. American psychologist 48, 10 (1993), 1013.",
      "doi": ""
    },
    {
      "text": "Colleen S. Conley, Joseph A. Durlak, Jenna B. Shapiro, Alexandra C. Kirsch, and Evan Zahniser. 2016. A Meta-Analysis of the Impact of Universal and Indicated Preventive Technology-Delivered Interventions for Higher Education Students. Prevention Science 17, 6 (2016), 659--678.",
      "doi": ""
    },
    {
      "text": "William DeJong. 1994. Building the Peace: The resolving Conflict Creatively Program. http://www.ncjrs.gov/App/abstractdb/AbstractDBDetails.aspx?id=149549",
      "doi": ""
    },
    {
      "text": "Sanford M Dornbusch, Philip L Ritter, P Herbert Leiderman, Donald F Roberts, and Michael J Fraleigh. 1987. The relation of parenting style to adolescent school performance. Child development (1987), 1244--1257.",
      "doi": ""
    },
    {
      "text": "Joseph A Durlak, Roger P Weissberg, Allison B Dymnicki, Rebecca D Taylor, and Kriston B Schellinger. 2011. The impact of enhancing students' social and emotional learning: a meta-analysis of school-based universal interventions. Child development 82, 1 (2011), 405--32.",
      "doi": ""
    },
    {
      "text": "Cy Foo and Emi Koivisto. 2004. Defining grief play in MMORPGs: Player and developer perceptions. Proceedings of the 2004 ACM SIGCHI International Conference on Advances in computer entertainment technology (2004), 245--250.  ",
      "doi": "10.1145/1067343.1067375"
    },
    {
      "text": "Colin Gallagher. 2014. An Educator's Guide to Using Minecraft {R} in the Classroom: Ideas, inspiration, and student projects for teachers. Peachpit Press.",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2008. What video games have to teach us about learning and literacy. Macmillan. 256 pages.",
      "doi": "10.5555/983348"
    },
    {
      "text": "Douglas A. Gentile, Craig A. Anderson, Shintaro Yukawa, Nobuko Ihori, Muniba Saleem, Lim Kam Ming, Akiko Shibuya, Albert K. Liau, Angeline Khoo, Brad J. Bushman, L. Rowell Huesmann, and Akira Sakamoto. 2009. The Effects of Prosocial Video Games on Prosocial Behaviors: International Evidence From Correlational, Longitudinal, and Experimental Studies. Personality and Social Psychology Bulletin 35, 6 (2009), 752--763.",
      "doi": ""
    },
    {
      "text": "Isabela Granic, Adam Lobel, and Rutger C M E Engels. 2014. The benefits of playing video games. American Psychologist 69, 1 (2014), 66.",
      "doi": ""
    },
    {
      "text": "Mark T Greenberg. 2006. Promoting resilience in children and youth: preventive interventions and their interface with neuroscience. Annals of the New York Academy of Sciences 1094 (dec 2006), 139--50.",
      "doi": ""
    },
    {
      "text": "Mark T. Greenberg. 2010. Schoolbased prevention: current status and future challenges. Effective Education 2, 1 (mar 2010), 27--52.",
      "doi": ""
    },
    {
      "text": "Mark D Griffiths, Mark N O Davies, and Darren Chappell. 2004. Demographic factors and playing variables in online computer gaming. CyberPsychology&behavior 7, 4 (2004), 479--487.",
      "doi": ""
    },
    {
      "text": "Mizuko Ito, Sonja Baumer, Matteo Bittanti, Rachel Cody, Becky Herr Stephenson, Heather A Horst, Patricia G Lange, Dilan Mahendran, Katynka Z Martínez, C J Pascoe, and Others. 2009. Hanging out, messing around, and geeking out: Kids living and learning with new media. MIT press. ",
      "doi": "10.5555/1822783"
    },
    {
      "text": "Mizuko Ito, Kris Gutiérrez, Sonia Livingstone, Bill Penuel, Jean Rhodes, Katie Salen, Juliet Schor, Julian Sefton-Green, and S Craig Watkins. 2013. Connected learning: An agenda for research and design. BookBaby.",
      "doi": ""
    },
    {
      "text": "David W Johnson and Roger T Johnson. 1995. Reducing school violence through conflict resolution. ASCD.",
      "doi": ""
    },
    {
      "text": "David W. Johnson and Roger T. Johnson. 1996. Conflict Resolution and Peer Mediation Programs in Elementary and Secondary Schools: A Review of the Research. Review of Educational Research 66, 4 (1996), 459--506.",
      "doi": ""
    },
    {
      "text": "Tricia S. Jones. 2004. Conflict resolution education: The field, the findings, and the future. Conflict Resolution Quarterly 22, 1 (2004), 233--267.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai. 2010. World of Whyville. Games and Culture 5, 1 (2010), 3 --22.",
      "doi": ""
    },
    {
      "text": "YB Yasmin B Kafai and Kristin A Searle. 2010. Safeguarding Play in Virtual Worlds: Designs and Perspectives on Tween Player Participation in Community Management. International Journal of Learning 2, 4 (2010), 31--42.",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring Cyberbullying and Other Toxic Behavior in Team Competition Online Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 3739--3748.  ",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart, Joseph Kahne, Ellen Middaugh, Alexandra Rankin Macgill, Chris Evans, and Jessica Vitak. 2008. Teens, Video Games, and Civics: Teens' Gaming Experiences Are Diverse and Include Significant Social Interaction and Civic Engagement. Pew internet&American life project (2008).",
      "doi": ""
    },
    {
      "text": "Jeffrey Lin. 2013. The science behind shaping player behavior in online games. In Annual Game Developers Conference.",
      "doi": ""
    },
    {
      "text": "Brendan Maher. 2016. Can a video game company tame toxic behaviour? Nature 531, 7596 (mar 2016), 568--571.",
      "doi": ""
    },
    {
      "text": "Yong Ming Kow, Timothy Young, and Katie Salen Tekinbas. 2014. Crafting the metagame: Connected learning in the Starcraft II community. (2014).",
      "doi": ""
    },
    {
      "text": "Virginia Molgaard and Richard Spoth. 2001. The Strengthening Families Program for young adolescents: overview and outcomes. Residential Treatment for Children&Youth 18, 3 (2001), 15--19.",
      "doi": ""
    },
    {
      "text": "Matthew H. Rafalow and Katie Salen Tekinba. 2014. Sackboy Planet: LittleBigPlanet 2 Players. Technical Report. Digital Media and Learning Research Hub, Irvine, CA. 1--43 pages.",
      "doi": ""
    },
    {
      "text": "Kathryn E Ringland, Christine T Wolf, Lynn Dombrowski, and Gillian R Hayes. 2015. Making Safe: Community-Centered Practices in a Virtual World Dedicated to Children with Autism. In CSCW '15. ACM Press, New York, New York, USA, 1788--1800.  ",
      "doi": "10.1145/2675133.2675216"
    },
    {
      "text": "Travis L Ross and Andrew J Weaver. 2012. Shall We Play a Game? Journal of Media Psychology (2012).",
      "doi": ""
    },
    {
      "text": "Katie Salen. 2008. The ecology of games: Connecting youth, games, and learning. MIT press.",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Robert E Kraut, and Laura Dabbish. 2017. Shaping Pro and Anti - Social Behavior on Twitch Through Moderation and Example - Setting. Computer Supoport, Cooperative Work and Social Computing Proceedings (2017), 111--125.  ",
      "doi": "10.1145/2998181.2998277"
    },
    {
      "text": "Kenneth B Shores, Yilin He, Kristina L Swanenburg, Robert Kraut, and John Riedl. 2014. The identification of deviance and its impact on retention in a multiplayer game. In Proceedings of the 17th ACM conference on Computer supported cooperative work&social computing. ACM, 1356--1365.  ",
      "doi": "10.1145/2531602.2531724"
    },
    {
      "text": "Myrna B Shure. 2001. I can problem solve (ICPS): An interpersonal cognitive problem solving program for children. Residential Treatment for Children&Youth 18, 3 (2001), 3--14.",
      "doi": ""
    },
    {
      "text": "Myrna B. Shure and George Spivack. 1980. Interpersonal problem solving as a mediator of behavioral adjustment in preschool and kindergarten children. Journal of Applied Developmental Psychology 1, 1 (dec 1980), 29--44.",
      "doi": ""
    },
    {
      "text": "Myrna B. Shure and George Spivack. 1982. Interpersonal problem-solving in young children: A cognitive approach to prevention. American Journal of Community Psychology 10, 3 (jun 1982), 341--356.",
      "doi": ""
    },
    {
      "text": "Petr Slov´ ak and Geraldine Fitzpatrick. 2015. Teaching and developing social and emotional skills with technology. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 4 (2015), 19.  ",
      "doi": "10.1145/2744195"
    },
    {
      "text": "Petr Slovak, Chris Frauenberger, and Geraldine Fitzpatrick. 2017. Reflective Practicum: A Framework of Sensitising Concepts to Design for Transformative Reflection. In CHI'17. ACM, 2696--2707.  ",
      "doi": "10.1145/3025453.3025516"
    },
    {
      "text": "Jonas Heide Smith. 2004. Playing dirty understanding conflicts in multiplayer games. The Association of Internet Researchers September (2004), 19--22.",
      "doi": ""
    },
    {
      "text": "K. Squire. 2006. From content to context: Videogames as designed experience. Educational Researcher 35, November 2006 (2006), 19--29.",
      "doi": ""
    },
    {
      "text": "Constance Steinkuehler and Esra Alagoz. 2010. Out-of-School Virtual Worlds Based Programs: A Cross-Case Analysis Methods : Data Collection&Analysis. 2 (2010), 304--305. ",
      "doi": "10.5555/1854509.1854669"
    },
    {
      "text": "Ca Steinkuehler, Sean Duncan, and David Simkins. 2007. Massively Multiplayer Online Games&Education: An Outline of Research. Proceedings of the Eighth Conference of Computer Supported Collaborative Learning 48, 1 (2007), 674--684. ",
      "doi": "10.5555/1599600.1599726"
    },
    {
      "text": "Constance Steinkuehler, Kurt Squire, and Sasha a. Barab. 2012. Games, Learning, and Society Learning and Meaning in the Digital Age. Cambridge University Press. 490 pages. ",
      "doi": "10.5555/2385793"
    },
    {
      "text": "Constance A Steinkuehler. 2002. Learning in Massively Multiplayer Online Games. Proceedings of the 6th International Conference on Learning Sciences (ICLS '04) 608 (2002), 521--528. ",
      "doi": "10.5555/1149126.1149190"
    },
    {
      "text": "Tina L Taylor. 2009. Play between worlds: Exploring online game culture. Mit Press. ",
      "doi": "10.5555/1137764"
    },
    {
      "text": "John A Velez, Chad Mahood, David R Ewoldsen, and Emily Moyer-Gusé. 2014. Ingroup versus outgroup conflict in the context of violent video game play: The effect of cooperation on increased helping and decreased aggression. Communication Research 41, 5 (2014), 607--626.",
      "doi": ""
    },
    {
      "text": "K. Weare and M. Nind. 2011. Mental health promotion and problem prevention in schools: what does the evidence say? Health Promotion International 26, S1 (nov 2011), i29--i69.",
      "doi": ""
    },
    {
      "text": "C Webster-Stratton and T Taylor. 2001. Nipping early risk factors in the bud: preventing substance abuse, delinquency, and violence in adolescence through interventions targeted at young children (0-8 years). Prevention science 2, 3 (2001), 165--192.",
      "doi": ""
    },
    {
      "text": "James V Wertsh and Peter Tulviste. 1990. Apprenticeship in thinking: Cognitive development in social context. Science 249, 4969 (1990), 684--686.",
      "doi": ""
    }
  ]
}