{
  "doi": "10.1145/3173574.3174099",
  "title": "Thor's Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "We present a new handheld haptic device, Thor's Hammer, which uses propeller propulsion to generate ungrounded, 3-DOF force feedback. Thor's Hammer has six motors and propellers that generates strong thrusts of air without the need for physical grounding or heavy air compressors. With its location and orientation tracked by an optimal tracking system, the system can exert forces in arbitrary directions regardless of the device's orientation. Our technical evaluation shows that Thor's Hammer can apply up to 4 N of force in arbitrary directions with less than 0.11 N and 3.9° of average magnitude and orientation errors. We also present virtual reality applications that can benefit from the force feedback provided by Thor's Hammer. Using these applications, we conducted a preliminary user study and participants felt the experience more realistic and immersive with the force feedback.",
  "tags": [
    "propeller-based feedback.",
    "ungrounded force feedback",
    "haptic feedback",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Seongkook Heo",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81484643096/rel-imgonly/81484643096.jpg",
      "acmid": "81484643096",
      "orcid": "0000-0003-2004-4812"
    },
    {
      "name": "Christina Chung",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659025526",
      "orcid": "missing"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    }
  ],
  "references": [
    {
      "text": "Muhammad Abdullah, Minji Kim, Waseem Hassan, Yoshihiro Kuroda, and Seokhee Jeon. 2017. HapticDrone: An Encountered-Type Kinesthetic Haptic Interface with Controllable Force Feedback: Initial Example for 1D Haptic Feedback. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17), 115--117.  ",
      "doi": "10.1145/3131785.3131821"
    },
    {
      "text": "Parastoo Abtahi, David Y. Zhao, L. E. Jane, and James A. Landay. 2017. Drone Near Me: Exploring TouchBased Human-Drone Interaction. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3: 34:1--34:8.  ",
      "doi": "10.1145/3130899"
    },
    {
      "text": "Michael L. Agronin. 1987. The design of a nine-string six-degree-of-freedom force-feedback joystick for telemanipulation. In Proceedings of the Workshop on Space Telerobotics.",
      "doi": ""
    },
    {
      "text": "Tomohiro Amemiya, Hideyuki Ando, and Taro Maeda. 2005. Virtual force display: direction guidance using asymmetric acceleration via periodic translational motion. In First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics Conference, 619--622.  ",
      "doi": "10.1109/WHC.2005.146"
    },
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16), 218--226.  ",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Akash Badshah, Sidhant Gupta, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. GyroTab: A Handheld Device That Provides Reactive Torque Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 3153--3156.  ",
      "doi": "10.1145/2207676.2208731"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch: Highfidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16), 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Jonathan Blake and Hakan B. Gurocak. 2009. Haptic Glove With MR Brakes for Virtual Reality. IEEE/ASME Transactions on Mechatronics 14, 5: 606--615.",
      "doi": ""
    },
    {
      "text": "Diego Borro, Joan Savall, Aiert Amundarain, Jorge Juan Gil, Alejandro Garcia-Alonso, and Luis Matey. 2004. A large haptic device for aircraft engine maintainability. IEEE Computer Graphics and Applications 24, 6: 70--74.  ",
      "doi": "10.1109/MCG.2004.45"
    },
    {
      "text": "Mourad Bouzit, Grigore Burdea, George Popescu, and Rares Boian. 2002. The Rutgers Master II-new design force-feedback glove. IEEE/ASME Transactions on Mechatronics 7, 2: 256--263.",
      "doi": ""
    },
    {
      "text": "D. Brescianini and R. D'Andrea. 2016. Design, modeling and control of an omni-directional aerial vehicle. In 2016 IEEE International Conference on Robotics and Automation (ICRA), 3261--3266.",
      "doi": "10.1109/ICRA.2016.7487497"
    },
    {
      "text": "Frederick P. Brooks Jr., Ming Ouh-Young, James J. Batter, and P. Jerome Kilpatrick. 1990. Project GROPEHaptic Displays for Scientific Visualization. In Proceedings of the 17th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '90), 177--185.  ",
      "doi": "10.1145/97879.97899"
    },
    {
      "text": "Inrak Choi and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct), 117--119.  ",
      "doi": "10.1145/2984751.2985725"
    },
    {
      "text": "Tim Duente, Max Pfeiffer, and Michael Rohs. 2017. Zap++: A 20-channel Electrical Muscle Stimulation System for Fine-grained Wearable Force Feedback. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17), 1:1--1:13.  ",
      "doi": "10.1145/3098279.3098546"
    },
    {
      "text": "Antonio Gomes, Calvin Rubens, Sean Braley, and Roel Vertegaal. 2016. BitDrones: Towards Using 3D Nanocopter Displays As Interactive Self-Levitating Programmable Matter. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 770--780.  ",
      "doi": "10.1145/2858036.2858519"
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Eythor R. Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. GyroVR: Simulating Inertia in Virtual Reality Using Head Worn Flywheels. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16), 227--232.  ",
      "doi": "10.1145/2984511.2984535"
    },
    {
      "text": "Hakan Gurocak, Sankar Jayaram, Benjamin Parrish, and Uma Jayaram. 2003. Weight sensation in virtual environments using a haptic device with air jets. Journal of Computing&Information Science in Engineering 3, 2: 130--135.",
      "doi": ""
    },
    {
      "text": "Yukihiro Hirata and Makoto Sato. 1992. 3-dimensional Interface Device For Virtual Work Space. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems, 889--896.",
      "doi": ""
    },
    {
      "text": "Michitaka Hirose, Koichi Hirota, Tetsuro Ogi, Hiroaki Yano, Naoyuki Kakehi, Makoto Saito, and Mutsuhiro Nakashige. 2001. HapticGEAR: the development of a wearable force display system for immersive projection displays. In Proceedings IEEE Virtual Reality 2001, 123--129. ",
      "doi": "10.5555/580521.835817"
    },
    {
      "text": "Han-Pang Huang and Ya-Fu Wei. 1998. Control of dexterous hand master with force feedback. In Proceedings. 1998 IEEE International Conference on Robotics and Automation (Cat. No.98CH36146), 687--692 vol.1.",
      "doi": ""
    },
    {
      "text": "Pascal Knierim, Thomas Kosch, Valentin Schwind, Markus Funk, Francisco Kiss, Stefan Schneegass, and Niels Henze. 2017. Tactile Drones - Providing Immersive Tactile Feedback in Virtual Reality Through Quadcopters. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 433--436.  ",
      "doi": "10.1145/3027063.3050426"
    },
    {
      "text": "John Lindow. 2002. Norse Mythology: A Guide to Gods, Heroes, Rituals, and Beliefs. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. 2013. Musclepropelled Force Feedback: Bringing Force Feedback to Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2577--2580.  ",
      "doi": "10.1145/2470654.2481355"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software&Technology (UIST '15), 11--19.  ",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls&Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 1471--1482.  ",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Martin Murer, Bernhard Maurer, Hermann Huber, Ilhan Aslan, and Manfred Tscheligi. 2015. TorqueScreen: Actuated Flywheels for Ungrounded Kinaesthetic Feedback in Handheld Devices. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15), 161--164.  ",
      "doi": "10.1145/2677199.2680579"
    },
    {
      "text": "Kazuki Nagai, Soma Tanoue, Katsuhito Akahane, and Makoto Sato. 2015. Wearable 6-DoF Wrist Haptic Device 'SPIDAR-W.\" In SIGGRAPH Asia 2015 Haptic Media And Contents Design (SA '15), 19:1-- 19:2.  ",
      "doi": "10.1145/2818384.2818403"
    },
    {
      "text": "Jun Rekimoto. 2013. Traxion: A Tactile Interaction Device with Virtual Force Sensation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13), 427--432.  ",
      "doi": "10.1145/2501988.2502044"
    },
    {
      "text": "J. M. Romano and K. J. Kuchenbecker. 2009. The AirWand: Design and characterization of a largeworkspace haptic device. In 2009 IEEE International Conference on Robotics and Automation, 1461--1466. ",
      "doi": "10.5555/1703435.1703599"
    },
    {
      "text": "Yuriko Suzuki and Minoru Kobayashi. 2005. Air jet driven force feedback in virtual reality. IEEE Computer Graphics and Applications 25, 1: 44--47.  ",
      "doi": "10.1109/MCG.2005.1"
    },
    {
      "text": "Yuriko Suzuki, Minoru Kobayashi, and Satoshi Ishibashi. 2002. Design of Force Feedback Utilizing Air Pressure Toward Untethered Human Interface. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02), 808--809.  ",
      "doi": "10.1145/506443.506608"
    },
    {
      "text": "Colin Swindells, Alex Unden, and Tao Sang. 2003. TorqueBAR: An Ungrounded Haptic Feedback Device. In Proceedings of the 5th International Conference on Multimodal Interfaces (ICMI '03), 52-- 59.  ",
      "doi": "10.1145/958432.958445"
    },
    {
      "text": "Takeshi Tanabe, Hiroaki Yano, and Hiroo Iwata. 2017. Evaluation of the Perceptual Characteristics of a Force Induced by Asymmetric Vibrations. IEEE Transactions on Haptics PP, 99: 1--1.",
      "doi": ""
    },
    {
      "text": "Mohamed Yassine Tsalamlal, Paul Issartel, Nizar Ouarti, and Mehdi Ammi. 2014. HAIR: HAptic feedback with a mobile AIR jet. In 2014 IEEE International Conference on Robotics and Automation (ICRA), 2699--2706.",
      "doi": ""
    },
    {
      "text": "Jessica Tsimeris, Tom Gedeon, and Michael Broughton. 2012. Using Magnetic Forces to Convey State Information: An Exploration of a Haptic Technology. In Proceedings of the 24th Australian Computer-Human Interaction Conference (OzCHI '12), 620--623.  ",
      "doi": "10.1145/2414536.2414630"
    },
    {
      "text": "Balemir Uragun and Ibrahim N. Tansel. 2014. The noise reduction techniques for unmanned air vehicles. In 2014 International Conference on Unmanned Aircraft Systems (ICUAS), 800--807.",
      "doi": ""
    },
    {
      "text": "Malte Weiss, Chat Wacharamanotham, Simon Voelker, and Jan Borchers. 2011. FingerFlux: Nearsurface Haptic Feedback on Tabletops. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11), 615--620.  ",
      "doi": "10.1145/2047196.2047277"
    },
    {
      "text": "Kyle N. Winfree, Jamie Gewirtz, Thomas Mather, Jonathan Fiene, and Katherine J. Kuchenbecker. 2009. A high fidelity ungrounded torque feedback device: The iTorqU 2.0. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 261--266.  ",
      "doi": "10.1109/WHC.2009.4810866"
    },
    {
      "text": "Kotaro Yamaguchi, Ginga Kato, Yoshihiro Kuroda, Kiyoshi Kiyokawa, and Haruo Takemura. 2016. A Non-grounded and Encountered-type Haptic Display Using a Drone. In Proceedings of the 2016 Symposium on Spatial User Interaction (SUI '16), 43--46.  ",
      "doi": "10.1145/2983310.2985746"
    },
    {
      "text": "H. Yano, M. Yoshie, and H. Iwata. 2003. Development of a non-grounded haptic interface using the gyro effect. In 11th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2003. HAPTICS 2003. Proceedings., 32--39. ",
      "doi": "10.5555/795683.797589"
    },
    {
      "text": "A. Zenner and A. Krüger. 2017. Shifty: A WeightShifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4: 1285--1294.  ",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "Geomagic Touch (formerly Geomagic Phantom Omni) Overview. Retrieved September 12, 2017 from http://www.geomagic.com/en/products/phantomomni/overview/",
      "doi": ""
    },
    {
      "text": "Novint Falcon. Retrieved September 12, 2017 from http://www.novint.com/index.php/products/novintfalcon",
      "doi": ""
    },
    {
      "text": "ExoHand | Festo Corporate. Retrieved September 13, 2017 from https://www.festo.com/group/en/cms/10233.htm",
      "doi": ""
    },
    {
      "text": "CyberGrasp. CyberGlove Systems LLC. Retrieved September 12, 2017 from http://www.cyberglovesystems.com/cybergrasp/",
      "doi": ""
    },
    {
      "text": "Motion controllers. Retrieved December 19, 2018 from https://developer.microsoft.com/enus/windows/mixed-reality/motion_controllers",
      "doi": ""
    },
    {
      "text": "Finch Shift - Motion Controller for Your Smartphone. Retrieved January 5, 2018 from https://finch-shift.com/",
      "doi": ""
    }
  ]
}