{
  "doi": "10.1145/3173574.3173827",
  "title": "A Trip to the Moon: Personalized Animated Movies for Self-reflection",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Self-tracking physiological and psychological data poses the challenge of presentation and interpretation. Insightful narratives for self-tracking data can motivate the user towards constructive self-reflection. One powerful form of narrative that engages audience across various culture and age groups is animated movies. We collected a week of self-reported mood and behavior data from each user and created in Unity a personalized animation based on their data. We evaluated the impact of their video in a randomized control trial with a non-personalized animated video as control. We found that personalized videos tend to be more emotionally engaging, encouraging greater and lengthier writing that indicated self-reflection about moods and behaviors, compared to non-personalized control videos.",
  "authors": [
    {
      "name": "Fengjiao Peng",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260396",
      "orcid": "missing"
    },
    {
      "name": "Veronica Crista LaBelle",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260435",
      "orcid": "missing"
    },
    {
      "name": "Emily Christen Yue",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261056",
      "orcid": "missing"
    },
    {
      "name": "Rosalind W. Picard",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100496593",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ruth A Baer, Gregory T Smith, Jaclyn Hopkins, Jennifer Krietemeyer, and Leslie Toney. 2006. Using self-report assessment methods to explore facets of mindfulness. Assessment 13, 1 (2006), 27--45.",
      "doi": ""
    },
    {
      "text": "Joseph Bates and others. 1994. The role of emotion in believable agents. Commun. ACM 37, 7 (1994), 122--125.  ",
      "doi": "10.1145/176789.176803"
    },
    {
      "text": "Todd Bentley, Lorraine Johnston, and Karola von Baggo. 2005. Evaluation using cued-recall debrief to elicit information about a user's affective experiences. In Proceedings of the 17th Australia conference on Computer-Human Interaction: Citizens Online: Considerations for Today and the Future. Computer-Human Interaction Special Interest Group (CHISIG) of Australia, 1--10. ",
      "doi": "10.5555/1108368.1108403"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. 3 (01 2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Jean Costa, Alexander T Adams, Malte F Jung, François Guimbetiere, and Tanzeem Choudhury. 2016. EmotionCheck: leveraging bodily signals and false feedback to regulate our emotions. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 758--769.  ",
      "doi": "10.1145/2971648.2971752"
    },
    {
      "text": "Gustav Freytag. 1896. Freytag's technique of the drama: an exposition of dramatic composition and art. Scholarly Press.",
      "doi": ""
    },
    {
      "text": "Stefan Göbel, Sandro Hardy, Viktor Wendel, Florian Mehm, and Ralf Steinmetz. 2010. Serious games for health: personalized exergames. In Proceedings of the 18th ACM international conference on Multimedia. ACM, 1663--1666.  ",
      "doi": "10.1145/1873951.1874316"
    },
    {
      "text": "Anton Gustafsson, Magnus Bång, and Mattias Svahn. 2009. Power explorer: a casual game style for encouraging long term behavior change among teenagers. In Proceedings of the International Conference on Advances in Computer Enterntainment Technology. ACM, 182--189.  ",
      "doi": "10.1145/1690388.1690419"
    },
    {
      "text": "Lisa L Harlow, Michael D Newcomb, and Peter M Bentler. 1986. Depression, self-derogation, substance use, and suicide ideation: Lack of purpose in life as a mediational factor. Journal of clinical psychology 42, 1 (1986), 5--21.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2009. Affective loop experiences: designing for interactional embodiment. Philosophical Transactions of the Royal Society of London B: Biological Sciences 364, 1535 (2009), 3585--3595.",
      "doi": ""
    },
    {
      "text": "Katherine Isbister, Kia Höök, Jarmo Laaksolahti, and Michael Sharp. 2007. The sensual evaluation instrument: Developing a trans-cultural self-report measure of affect. International journal of human-computer studies 65, 4 (2007), 315--328.  ",
      "doi": "10.1016/j.ijhcs.2006.11.017"
    },
    {
      "text": "John F Kihlstrom, Eric Eich, Deborah Sandbrand, and Betsy A Tobias. 2000. Emotion and memory: Implications for self-report. The science of self-report: Implications for research and practice (2000), 81--99.",
      "doi": ""
    },
    {
      "text": "Kurt Lancaster. 2011. The Psychology of the Lens: Patrick Moreau creates filmic intimacy with DSLRs at Stillmotion. (June 2011).",
      "doi": ""
    },
    {
      "text": "Kurt Lancaster. 2017. Using lenses to enhance visual storytelling. (January 2017).",
      "doi": ""
    },
    {
      "text": "Madelene Lindström, Anna Ståhl, Kristina Höök, Petra Sundström, Jarmo Laaksolathi, Marco Combetto, Alex Taylor, and Roberto Bresin. 2006. Affective diary: designing for bodily expressiveness and self-reflection. In CHI'06 extended abstracts on Human factors in computing systems. ACM, 1037--1042.  ",
      "doi": "10.1145/1125451.1125649"
    },
    {
      "text": "Michael Mateas and Phoebe Sengers. 2003. Narrative intelligence. (2003).",
      "doi": ""
    },
    {
      "text": "Robert R McCrae. 1984. Situational determinants of coping responses: Loss, threat, and challenge. Journal of personality and Social Psychology 46, 4 (1984), 919.",
      "doi": ""
    },
    {
      "text": "David R Michael and Sandra L Chen. 2005. Serious games: Games that educate, train, and inform. Muska & Lipman/Premier-Trade. ",
      "doi": "10.5555/1051239"
    },
    {
      "text": "Rosalind W Picard and Shaundra Bryant Daily. 2005. Evaluating affective interactions: Alternatives to asking what users feel. In CHI Workshop on Evaluating Affective Interfaces: Innovative Approaches. ACM New York, NY, 2119--2122.  ",
      "doi": "10.1145/1056808.1057115"
    },
    {
      "text": "Rosalind W Picard and Roalind Picard. 1997. Affective computing. Vol. 252. MIT press Cambridge. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Tom Porter and Galyn Susman. 2000. On site: Creating lifelike characters in pixar movies. Commun. ACM 43, 1 (2000), 25.  ",
      "doi": "10.1145/323830.323839"
    },
    {
      "text": "Hans Rosling. 2006. Debunking third-world myths with the best stats you've ever seen. TED.",
      "doi": ""
    },
    {
      "text": "Christian Roth, Peter Vorderer, and Christoph Klimmt. 2009. The motivational appeal of interactive storytelling: Towards a dimensional model of the user experience. In Joint International Conference on Interactive Digital Storytelling. Springer, 38--43.  ",
      "doi": "10.1007/978-3-642-10643-9_7"
    },
    {
      "text": "Akane Sano. 2016. Measuring college students' sleep, stress, mental health and wellbeing with wearable sensors and mobile phones. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Corina Sas, Tomasz Fratczak, Matthew Rees, Hans Gellersen, Vaiva Kalnikaite, Alina Coman, and Kristina Höök. 2013. AffectCam: arousal-augmented sensecam for richer recall of episodic memories. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1041--1046.  ",
      "doi": "10.1145/2468356.2468542"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility. ACM, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Phoebe Sengers and Bill Gaver. 2006. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proceedings of the 6th conference on Designing Interactive systems. ACM, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "CR Snyder, Randee J Shenkel, and Carol R Lowery. 1977. Acceptance of personality interpretations: the\" Barnum Effect\" and beyond. Journal of consulting and clinical psychology 45, 1 (1977), 104.",
      "doi": ""
    },
    {
      "text": "Frank Thomas, Ollie Johnston, and Frank. Thomas. 1995. The illusion of life: Disney animation. Hyperion New York.",
      "doi": ""
    },
    {
      "text": "AJN Van Breemen. 2004. Bringing robots to life: Applying principles of animation to robots. In Proceedings of Shapping Human-Robot Interaction workshop held at CHI 2004. 143--144.",
      "doi": ""
    }
  ]
}