{
  "doi": "10.1145/3173574.3173750",
  "title": "What Did I Really Vote For?  On the Usability of Verifiable E-Voting Schemes",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "E-voting has been embraced by a number of countries, delivering benefits in terms of efficiency and accessibility. End-to-end verifiable e-voting schemes facilitate verification of the integrity of individual votes during the election process. In particular, methods for cast-as-intended verification enable voters to confirm that their cast votes have not been manipulated by the voting client. A well-known technique for effecting cast-as-intended verification is the Benaloh Challenge. The usability of this challenge is crucial because voters have to be actively engaged in the verification process. In this paper, we report on a usability evaluation of three different approaches of the Benaloh Challenge in the remote e-voting context. We performed a comparative user study with 95 participants. We conclude with a recommendation for which approaches should be provided to afford verification in real-world elections and suggest usability improvements.",
  "authors": [
    {
      "name": "Karola Marky",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659225101",
      "orcid": "missing"
    },
    {
      "name": "Oksana Kulyk",
      "institution": "Technische Universität Darmstadt, Darmstadt, Hessen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658673957",
      "orcid": "missing"
    },
    {
      "name": "Karen Renaud",
      "institution": "Abertay University & University of South Africa, Dundee, United Kingdom",
      "img": "/do/10.1145/contrib-81342508954/rel-imgonly/me.jpg",
      "acmid": "81342508954",
      "orcid": "missing"
    },
    {
      "name": "Melanie Volkamer",
      "institution": "Karlsruhe Institute of Technology & Technische Universität Darmstadt, Karlsruhe, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81330499668",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Claudia Z. Acemyan, Philip Kortum, Michael D. Byrne, and Dan S. Wallach. 2014. Usability of voter verifiable, end-to-end voting systems: Baseline data for Helios, Prêt à Voter, and Scantegrity II. The USENIX Journal of Election Technology and Systems 2, 3 (2014), 26--56.",
      "doi": ""
    },
    {
      "text": "Claudia Z. Acemyan, Philip Kortum, Michael D. Byrne, and Dan S. Wallach. 2015. Users' Mental Models for Three End-to-End Voting Systems: Helios, Prêt à Voter, and Scantegrity II. In International Conference on Human Aspects of Information Security, Privacy, and Trust. Springer, 463--474.  ",
      "doi": "10.1007/978-3-319-20376-8_41"
    },
    {
      "text": "Ben Adida. 2006. Advances in Cryptographic Voting Systems. https://dspace.mit.edu/handle/1721.1/96589. (2006). {Doctoral Dissertation}. ",
      "doi": "10.5555/1293287"
    },
    {
      "text": "Ben Adida. 2008. Helios: Web-based Open-Audit Voting. In USENIX Security Symposium, Vol. 17. USENIX Association, Berkeley, CA, USA, 335--348. ",
      "doi": "10.5555/1496711.1496734"
    },
    {
      "text": "Ben Adida, Olivier De Marneffe, Olivier Pereira, Jean-Jacques Quisquater, and others. 2009. Electing a University President using Open-Audit Voting: Analysis of Real-World use of Helios. Electronic Voting Technology Workshop/Workshop on Trustworthy Elections EVT '09 (2009). ",
      "doi": "10.5555/1855491.1855501"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. Journal of usability studies 4, 3 (2009), 114--123. ",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Benjamin B. Bederson, Bongshin Lee, Robert M. Sherman, Paul S. Herrnson, and Richard G. Niemi. 2003. Electronic Voting System Usability Issues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 145--152.  ",
      "doi": "10.1145/642611.642638"
    },
    {
      "text": "Susan Bell, Josh Benaloh, Michael D. Byrne, Dana DeBeauvoir, Bryce Eakin, Gail Fisher, Philip Kortum, Neal McBurnett, Julian Montoya, Michelle Parker, and others. 2013. STAR-Vote: A Secure, Transparent, Auditable, and Reliable Voting System. USENIX Journal of Election Technology and Systems (JETS) 1, 1 (2013), 18--37.",
      "doi": ""
    },
    {
      "text": "Jonathan Ben-Nun, Niko Fahri, Morgan Llewellyn, Ben Riva, Alon Rosen, Amnon Ta-Shma, and Douglas Wikström. 2012. A New Implementation of a Dual (Paper and Cryptographic) Voting System. In Electronic Voting. 315--329.",
      "doi": ""
    },
    {
      "text": "Josh Benaloh. 2006. Simple Verifiable Elections. Electronic Voting Technology Workshop EVT '06 (2006). ",
      "doi": "10.5555/1251003.1251008"
    },
    {
      "text": "Josh Benaloh. 2007. Ballot Casting Assurance via Voter-Initiated Poll Station Auditing. Electronic Voting Technology Workshop EVT '07 (2007). ",
      "doi": "10.5555/1323111.1323125"
    },
    {
      "text": "John Brooke. 1996. SUS-A Quick and Dirty Usability Scale. Usability Evaluation in Industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Jurlind Budurushi, Karen Renaud, Melanie Volkamer, and Marcel Woide. 2016. An Investigation into the Usability of Electronic Voting Systems for Complex Elections. Annals of Telecommunications 71, 7--8 (2016), 309--322.",
      "doi": ""
    },
    {
      "text": "Michael D. Byrne, Kristen K. Greene, and Sarah P. Everett. 2007. Usability of Voting Systems: Baseline Data for Paper, Punch Cards, and Lever Machines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 171--180.  ",
      "doi": "10.1145/1240624.1240653"
    },
    {
      "text": "Bryan A. Campbell, Chad C. Tossell, Michael D. Byrne, and Philip Kortum. 2014. Toward more Usable Electronic Voting: Testing the Usability of a Smartphone Voting System. Human Factors 56, 5 (2014), 973--985.",
      "doi": ""
    },
    {
      "text": "Frederick G. Conrad, Benjamin B. Bederson, Brian Lewis, Emilia Peytcheva, Michael W Traugott, Michael J. Hanmer, Paul S. Herrnson, and Richard G. Niemi. 2009. Electronic Voting Eliminates Hanging Chads but Introduces New Usability Challenges. International Journal of Human-Computer Studies 67, 1 (2009), 111--124.  ",
      "doi": "10.1016/j.ijhcs.2008.09.010"
    },
    {
      "text": "Lynn A. Cooper and Peter Podgorny. 1976. Mental Transformations and Visual Comparison Processes: Effects of Complexity and Similarity. Journal of Experimental psychology: Human perception and performance 2, 4 (1976), 503.",
      "doi": ""
    },
    {
      "text": "Sergej Dechand, Dominik Schürmann, Karoline Busse, Yasemin Acar, Sascha Fahl, and Matthew Smith. 2016. An Empirical Study of Textual Key-Fingerprint Representations. In USENIX Security Symposium. USENIX Association, 193--208.",
      "doi": "10.5555/3241094.3241110"
    },
    {
      "text": "Estonian National Electoral Committee. 2015. Statistics about Internet Voting in Estonia. https://www.valimised.ee/en/archive/ statistics-about-internet-voting-estonia. (2015). {Online; accessed 28-August-2017}.",
      "doi": ""
    },
    {
      "text": "Sarah P. Everett, Michael D. Byrne, and Kristen K. Greene. 2006. Measuring the Usability of Paper Ballots: Efficiency, Effectiveness, and Satisfaction. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 50. SAGE Publications Sage CA: Los Angeles, CA, 2547--2551.",
      "doi": ""
    },
    {
      "text": "Sarah P. Everett, Kristen K. Greene, Michael D. Byrne, Dan S. Wallach, Kyle Derr, Daniel Sandler, and Ted Torous. 2008. Electronic Voting Machines versus Traditional Methods: Improved Preference, Similar Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 883--892.  ",
      "doi": "10.1145/1357054.1357195"
    },
    {
      "text": "Uwe Flick. 2014. An Introduction to Qualitative Research (5 ed.). Sage, London.",
      "doi": ""
    },
    {
      "text": "Rojan Gharadaghy and Melanie Volkamer. 2010. Verifiability in Electronic Voting-Explanations for Non Security Experts.. In Electronic Voting. 151--162.",
      "doi": ""
    },
    {
      "text": "Juan E. Gilbert, Yolanda McMillian, Ken Rouse, Philicity Williams, Gregory Rogers, Jerome McClendon, Winfred Mitchell, Priyanka Gupta, Idong Mkpong-Ruffin, and E Vincent Cross. 2010. Universal Access in E-Voting for the Blind. Universal Access in the Information Society 9, 4 (2010), 357--365.  ",
      "doi": "10.1007/s10209-009-0181-0"
    },
    {
      "text": "Kaspersky Labs GmbH. 2017. Stimmabgabe per Klick So steht Deutschland zum Thema Online-Wahl. http://newsroom.kaspersky.eu/fileadmin/user_upload/de/ Downloads/PDFs/Kaspersky-Studie_Stimmagbabe_per_Klick. pdf. (2017). {Online; accessed: 13-September-2017}.",
      "doi": ""
    },
    {
      "text": "Kristen K. Greene, Michael D. Byrne, and Sarah P. Everett. 2006. A Comparison of Usability Between Voting Methods. Electronic Voting Technology Workshop EVT '06 (2006). ",
      "doi": "10.5555/1251003.1251005"
    },
    {
      "text": "Stuart Haber, Josh Benaloh, and Shai Halevi. 2010. The Helios E-Voting Demo for the IACR. International Association for Cryptologic Research. (2010).",
      "doi": ""
    },
    {
      "text": "J. Alex Halderman and Vanessa Teague. 2015. The New South Wales iVote System: Security Failures and Verification Flaws in a Live Online Election. In International Conference on E-Voting and Identity. Springer, 35--53.  ",
      "doi": "10.1007/978-3-319-22270-7_3"
    },
    {
      "text": "Jeffrey Hsu and Gary Bronson. 2018. E-Voting Technologies Usability: A Critical Element for Enabling Successful Elections. In Emerging Challenges in Business, Optimization, Technology, and Industry. Springer, 61--78.",
      "doi": ""
    },
    {
      "text": "IACR. 2016. IACR Elections. http://www.iacr.org/elections. (2016). {Online; accessed 19-January-2017}.",
      "doi": ""
    },
    {
      "text": "Fatih Karayumak, Michaela Kauer, M. Maina Olembo, Tobias Volk, and Melanie Volkamer. 2011a. User Study of the Improved Helios Voting System Interfaces. In 2011 1st Workshop on Socio-Technical Aspects in Security and Trust (STAST). IEEE, 37--44.",
      "doi": ""
    },
    {
      "text": "Fatih Karayumak, Maina M. Olembo, Michaela Kauer, and Melanie Volkamer. 2011b. Usability Analysis of Helios-An Open Source Verifiable Remote Electronic Voting System. In Proceedings of the 2011 Conference on Electronic Voting Technology/Workshop on Trustworthy Elections (EVT/WOTE'11). USENIX Association, Berkeley, CA, USA. ",
      "doi": "10.5555/2028012.2028017"
    },
    {
      "text": "Oksana Kulyk, Stephan Neumann, Jurlind Budurushi, and Melanie Volkamer. 2017. Nothing Comes for Free: How Much Usability Can You Sacrifice for Security? IEEE Security & Privacy 15, 3 (2017), 24--29.",
      "doi": "10.1109/MSP.2017.70"
    },
    {
      "text": "Seunghyun Tina Lee, Yilin Elaine Liu, Ljilja Ruzic, and Jon Sanford. 2016. Universal Design Ballot Interfaces on Voting Performance and Satisfaction of Voters with and without Vision Loss. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4861--4871.  ",
      "doi": "10.1145/2858036.2858567"
    },
    {
      "text": "Seunghyun Tina Lee, Yilin Elaine Liu, Xiao Xiong, and Jon Sanford. 2013. Development of a More Universal Voting Interface. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 57. SAGE Publications Sage CA: Los Angeles, CA, 1624--1628.",
      "doi": ""
    },
    {
      "text": "Robert H. Logie. 2014. Visuo-spatial Working Memory. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Damien Mac Namara, Ted Scully, and Paul Gibson. 2011. DualVote Addressing Usability and Verifiability Issues in Electronic Voting Systems. (2011). http://citeseerx.ist. psu.edu/viewdoc/summary?doi=10.1.1.399.7284.",
      "doi": ""
    },
    {
      "text": "Stephan Neumann, Maina M. Olembo, Karen Renaud, and Melanie Volkamer. 2014. Helios Verification: To Alleviate, or to Nominate: Is That the Question, or Shall we Have Both?. In International Conference on Electronic Government and the Information Systems Perspective. Springer, 246--260.",
      "doi": ""
    },
    {
      "text": "Maina M. Olembo, Steffen Bartsch, and Melanie Volkamer. 2013. Mental Models of Verifiability in Voting. In International Conference on E-Voting and Identity. Springer, 142--155.  ",
      "doi": "10.1007/978-3-642-39185-9_9"
    },
    {
      "text": "QR4. 2017. QR Code Data Capacity - How much information can a QR code have ? http://blog.qr4.nl/page/QR-Code-Data-Capacity.aspx. (2017). {Online; accessed: 30-August-2017}.",
      "doi": ""
    },
    {
      "text": "Paulo Realpe-Muñoz, César A. Collazos, Julio Hurtado, Toni Granollers, Jaime Muñoz-Arteaga, and Jaime Velasco-Medina. 2017. Eye Tracking-Based Behavioral Study of Users Using E-Voting Systems. Computer Standards & Interfaces 55 (2017), 182--195.  ",
      "doi": "10.1016/j.csi.2017.08.004"
    },
    {
      "text": "Peter YA Ryan and Vanessa Teague. 2009. Pretty Good Democracy. In Security Protocols Workshop, Vol. 17. Springer, 111--130.",
      "doi": ""
    },
    {
      "text": "Uwe Serdult, Micha Germann, Fernando Mendez, Alicia Portenier, and Christoph Wellig. 2015. Fifteen Years of Internet Voting in Switzerland {History, Governance and Use}. In ICEDEG 2015: 2nd International Conference on eDemocracy & eGovernment. IEEE, 126--132.",
      "doi": ""
    },
    {
      "text": "Drew Springall, Travis Finkenauer, Zakir Durumeric, Jason Kitcat, Harri Hursti, Margaret MacAlpine, and J Alex Halderman. 2014. Security Analysis of the Estonian Internet Voting System. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security. ACM, 703--715.  ",
      "doi": "10.1145/2660267.2660315"
    },
    {
      "text": "International Organization For Standardization. 1998. ISO 9241--11: Ergonomics of Human System Interaction -- Part 11: Guidance on Usability. (1998).",
      "doi": ""
    },
    {
      "text": "Statista. 2017. Statista - Anteil der Smartphone-Nutzer in Deutschland 2017. https://de.statista.com/statistik/daten/studie/585883/ umfrage/anteil-der-smartphone-nutzer-in-deutschland/. (2017). {Online; accessed: 30-March-2017}.",
      "doi": ""
    },
    {
      "text": "Joshua Tan, Lujo Bauer, Joseph Bonneau, Lorrie Faith Cranor, Jeremy Thomas, and Blase Ur. 2017. Can Unicorns Help Users Compare Crypto Key Fingerprints?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3787--3798.  ",
      "doi": "10.1145/3025453.3025733"
    },
    {
      "text": "Michael W. Traugott, Michael J. Hanmer, Won-ho Park, Paul S. Herrnson, Richard G. Niemi, Ben B. Bederson, and Frederick G. Conrad. 2005. The Impact of Voting Systems on Residual Votes, Incomplete Ballots, and Other Measures of Voting Behavior. In Annual Conference of the Midwest Political Science Association, Chicago, IL, April. 7--10.",
      "doi": ""
    },
    {
      "text": "Janna-Lynn Weber and Urs Hengartner. 2009. Usability Study of the Open Audit Voting System Helios. http://www.jannaweber.com/wpcontent/uploads/2009/09/ 858Helios.pdf. (2009). {Online; accessed: 22-December-2017}.",
      "doi": ""
    },
    {
      "text": "Marco Winckler, Regina Bernhaupt, Philippe Palanque, David Lundin, Kieran Leach, Peter Ryan, Eugenio Alberdi, and Lorenzo Strigini. 2009. Assessing the Usability of Open Verifiable E-Voting Systems: a Trial with the System Prêt à Voter. Proceedings of ICE-GOV (2009), 281--296.",
      "doi": ""
    }
  ]
}