{
  "doi": "10.1145/3173574.3174171",
  "title": "How Social Dynamics and the Context of Digital Content Impact Workplace Remix",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "As highlighted in recent work on remix in online content creation communities, people commonly take and appropriate digital content for new activities. Less is known, however, about how people repurpose digital content as part of work. We report findings from an interview study with 19 individuals in which we explored how digital content in the workplace becomes a material for remix. Our analysis emphasizes (i) how digital content is obtained from colleagues for remix, (ii) how content is made available for remix by others, and (iii) how digital content is transformed for remix. In attending to these broader processes of remix, we consider the roles of workplace technologies, such as those for file sharing, as well as social norms that mediate access, remix, and acknowledgement. We draw implications for design of technology that emphasize support for individuals in making digital content available for remix, and raising awareness of the context of that content.",
  "tags": [
    "remix",
    "access",
    "sharing",
    "creative reuse",
    "workplace"
  ],
  "authors": [
    {
      "name": "Jessica L. Feuston",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658657892",
      "orcid": "missing"
    },
    {
      "name": "Siân E. Lindley",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100028041",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Liam Bannon and Susanne Bødker. 1997. Constructing Common Information Spaces. In Proceedings of the Fifth European Conference on Computer Supported Cooperative Work. Springer, Dordrecht, 81--96. ",
      "doi": "10.5555/1241980.1241986"
    },
    {
      "text": "Alberto Barrón-Cedeño. 2010. On the Mono- and Cross-language Detection of Text Reuse and Plagiarism. In Proceedings of the 33rd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '10), 914--914.  ",
      "doi": "10.1145/1835449.1835687"
    },
    {
      "text": "John Bowers. 1994. The Work to Make a Network Work: Studying CSCW in Action. In Proceedings of the 1994 ACM Conference on Computer Supported Cooperative Work (CSCW '94), 287--298.  ",
      "doi": "10.1145/192844.193030"
    },
    {
      "text": "Julia Cambre and Scott Klemmer. 2017. Standing on the Shoulders of Peers: Tournament-Style Remixing in Project Courses. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion), 155--158.  ",
      "doi": "10.1145/3022198.3026353"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory. SAGE.",
      "doi": ""
    },
    {
      "text": "Giorgos Cheliotis, Nan Hu, Jude Yew, and Jianhui Huang. 2014. The Antecedents of Remix. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work&Social Computing (CSCW '14), 1011--1022.  ",
      "doi": "10.1145/2531602.2531730"
    },
    {
      "text": "Giorgos Cheliotis and Jude Yew. 2009. An Analysis of the Social Structure of Remix Culture. In Proceedings of the Fourth International Conference on Communities and Technologies (C&T '09), 165--174.  ",
      "doi": "10.1145/1556460.1556485"
    },
    {
      "text": "Justin Cheng, Jaime Teevan, Shamsi T. Iqbal, and Michael S. Bernstein. 2015. Break It Down: A Comparison of Macro- and Microtasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 4061--4064.  ",
      "doi": "10.1145/2702123.2702146"
    },
    {
      "text": "Christian Collberg and Stephen Kobourov. 2005. Selfplagiarism in Computer Science. Commun. ACM 48, 4: 88--94.  ",
      "doi": "10.1145/1053291.1053293"
    },
    {
      "text": "Tim Coughlan, Rebecca Pitt, and Patrick McAndrew. 2013. Building Open Bridges: Collaborative Remixing and Reuse of Open Educational Resources Across Organisations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 991--1000.  ",
      "doi": "10.1145/2470654.2466127"
    },
    {
      "text": "Stuart Cunningham, Jonathan Weinel, and Darryl Griffiths. 2014. ACERemix: A Tool for Glitch Music Remix Production and Performance. In Proceedings of the 9th Audio Mostly: A Conference on Interaction With Sound (AM '14), 7:1--7:7.  ",
      "doi": "10.1145/2636879.2636888"
    },
    {
      "text": "Claudia Eckert, Martin Stacey, and John Clarkson. 2000. Algorithms and Inspirations: Creative Reuse of Design Experience. In Greenwich 2000 International Symposium: Digital Creativity, 1--10. Retrieved from https://s3.amazonaws.com/academia.edu.documents/30 921285/a_i.pdf?AWSAccessKeyId=AKIAIWOWYY GZ2Y53UL3A&Expires=1515011241&Signature=MT UcfIKDv1JBszuJ6Jhg7oleZb0%3D&responsecontentdisposition=inline%3B%20filename%3DALGORITH MS_AND_INSPIRATIONS_CREATIVE_REU.pdf",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A. Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7: 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Cori Faklaris and Sara Anne Hook. 2017. Attitudes About \"Fair Use\" and Content Sharing in Social Media Applications. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion), 171-- 174.  ",
      "doi": "10.1145/3022198.3026343"
    },
    {
      "text": "Casey Fiesler. 2013. The chilling tale of copyright law in online creative communities. XRDS: Crossroads, The ACM Magazine for Students 19: 26--29.  ",
      "doi": "10.1145/2460436.2460446"
    },
    {
      "text": "Casey Fiesler and Amy S. Bruckman. 2014. Remixers' Understandings of Fair Use Online. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work&Social Computing (CSCW '14), 1023--1032.  ",
      "doi": "10.1145/2531602.2531695"
    },
    {
      "text": "Casey Fiesler, Jessica L. Feuston, and Amy S. Bruckman. 2015. Understanding Copyright Law in Online Creative Communities. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing (CSCW '15), 116--129.  ",
      "doi": "10.1145/2675133.2675234"
    },
    {
      "text": "Tom Gross, Wido Wirsam, and Wolfgang Graether. 2003. AwarenessMaps: Visualizing Awareness in Shared Workspaces. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03), 784--785.  ",
      "doi": "10.1145/765891.765990"
    },
    {
      "text": "Stefan Gruner and Stuart Naven. 2005. Tool Support for Plagiarism Detection in Text Documents. In Proceedings of the 2005 ACM Symposium on Applied Computing (SAC '05), 776--781.  ",
      "doi": "10.1145/1066677.1066854"
    },
    {
      "text": "Jane Gruning and Siân Lindley. 2016. Things We Own Together: Sharing Possessions at Home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1176--1186.  ",
      "doi": "10.1145/2858036.2858154"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 1998. Design for Individuals, Design for Groups: Tradeoffs Between Power and Workspace Awareness. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work (CSCW '98), 207--216.  ",
      "doi": "10.1145/289444.289495"
    },
    {
      "text": "Sarah Hallacher, Jenny Rodenhouse, and Andres Monroy-Hernandez. 2013. Mixsourcing: Turn This into That. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13), 2841--2842.  ",
      "doi": "10.1145/2468356.2479539"
    },
    {
      "text": "Wendy Ju, Arna Ionescu, Lawrence Neeley, and Terry Winograd. 2004. Where the Wild Things Work: Capturing Shared Physical Design Workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04), 533--541.  ",
      "doi": "10.1145/1031607.1031696"
    },
    {
      "text": "Sunyoung Kim and Eric Paulos. 2011. Practices in the Creative Reuse of e-Waste. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2395--2404.  ",
      "doi": "10.1145/1978942.1979292"
    },
    {
      "text": "Romans Lukashenko, Vita Graudina, and Janis Grundspenkis. 2007. Computer-based Plagiarism Detection Methods and Tools: An Overview. In Proceedings of the 2007 International Conference on Computer Systems and Technologies (CompSysTech '07), 40:1--40:6.  ",
      "doi": "10.1145/1330598.1330642"
    },
    {
      "text": "Kurt Luther, Nicholas Diakopoulos, and Amy Bruckman. 2010. Edits&Credits: Exploring Integration and Attribution in Online Creative Collaboration. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10), 2823--2832.  ",
      "doi": "10.1145/1753846.1753869"
    },
    {
      "text": "Leah Maestri and Ron Wakkary. 2011. Understanding Repair As a Creative Process of Everyday Design. In Proceedings of the 8th ACM Conference on Creativity and Cognition (C&C '11), 81--90.  ",
      "doi": "10.1145/2069618.2069633"
    },
    {
      "text": "Catherine C. Marshall and Frank M. Shipman. 2011. Social Media Ownership: Using Twitter As a Window Onto Current Attitudes and Beliefs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1081--1090.  ",
      "doi": "10.1145/1978942.1979103"
    },
    {
      "text": "Catherine C. Marshall and Frank M. Shipman. 2015. Exploring the Ownership and Persistent Value of Facebook Content. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing (CSCW '15), 712--723.  ",
      "doi": "10.1145/2675133.2675203"
    },
    {
      "text": "Catherine C. Marshall, Ted Wobber, Venugopalan Ramasubramanian, and Douglas B. Terry. 2012. Supporting Research Collaboration Through Bi-level File Synchronization. In Proceedings of the 17th ACM International Conference on Supporting Group Work (GROUP '12), 165--174.  ",
      "doi": "10.1145/2389176.2389202"
    },
    {
      "text": "Charlotte Massey, Thomas Lennig, and Steve Whittaker. 2014. Cloudy Forecast: An Exploration of the Factors Underlying Shared Repository Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2461--2470.  ",
      "doi": "10.1145/2556288.2557042"
    },
    {
      "text": "Yelena Mejova, Klaar De Schepper, Lawrence Bergman, and Jie Lu. 2011. Reuse in the Wild: An Empirical and Ethnographic Study of Organizational Content Reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2877--2886.  ",
      "doi": "10.1145/1978942.1979370"
    },
    {
      "text": "Naoko Nitta and Noboru Babaguchi. 2011. Examplebased Video Remixing Support System. In Proceedings of the 19th ACM International Conference on Multimedia (MM '11), 563--572.  ",
      "doi": "10.1145/2072298.2072371"
    },
    {
      "text": "Sylvie Noël and Jean-Marc Robert. 2004. Empirical Study on Collaborative Writing: What Do Co-authors Do, Use, and Like? Comput. Supported Coop. Work 13, 1: 63--89.  ",
      "doi": "10.1023/B%3ACOSU.0000014876.96003.be"
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 639--648.  ",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "Jarno Ojala, Sujeet Mate, Igor D. D. Curcio, Arto Lehtiniemi, and Kaisa Väänänen-Vainio-Mattila. 2014. Automated Creation of Mobile Video Remixes: User Trial in Three Event Contexts. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia (MUM '14), 170--179.  ",
      "doi": "10.1145/2677972.2677975"
    },
    {
      "text": "Celeste Lyn Paul, Kris Cook, and Russ Burtner. 2014. The Economics of Contribution in a Large Enterprisescale Wiki. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work&Social Computing (CSCW Companion '14), 205--208.  ",
      "doi": "10.1145/2556420.2556475"
    },
    {
      "text": "Emilee Rader. 2009. Yours, Mine and (Not) Ours: Social Influences on Group Information Repositories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 2095--2098.  ",
      "doi": "10.1145/1518701.1519019"
    },
    {
      "text": "Abigail J. Sellen and Richard H. R. Harper. 2003. The Myth of the Paperless Office. MIT Press. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Moushumi Sharmin, Lawrence Bergman, Jie Lu, and Ravi Konuru. 2012. On Slide-based Contextual Cues for Presentation Reuse. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI '12), 129--138.  ",
      "doi": "10.1145/2166966.2166992"
    },
    {
      "text": "Judy Sheard and Martin Dick. 2011. Computing Student Practices of Cheating and Plagiarism: A Decade of Change. In Proceedings of the 16th Annual Joint Conference on Innovation and Technology in Computer Science Education (ITiCSE '11), 233--237.  ",
      "doi": "10.1145/1999747.1999813"
    },
    {
      "text": "Judy Sheard, Martin Dick, Selby Markham, Ian Macdonald, and Meaghan Walsh. 2002. Cheating and Plagiarism: Perceptions and Practices of First Year IT Students. In Proceedings of the 7th Annual Conference on Innovation and Technology in Computer Science Education (ITiCSE '02), 183--187.  ",
      "doi": "10.1145/544414.544468"
    },
    {
      "text": "Claudio Soriente, Ghassan O. Karame, Hubert Ritzdorf, Srdjan Marinovic, and Srdjan Capkun. 2015. Commune: Shared Ownership in an Agnostic Cloud. In Proceedings of the 20th ACM Symposium on Access Control Models and Technologies (SACMAT '15), 39--50.  ",
      "doi": "10.1145/2752952.2752972"
    },
    {
      "text": "Alex S. Taylor and Laurel Swan. 2005. Artful Systems in the Home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 641--650.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Jaime Teevan, Shamsi T. Iqbal, and Curtis von Veh. 2016. Supporting Collaborative Writing with Microtasks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 2657--2668.  ",
      "doi": "10.1145/2858036.2858108"
    },
    {
      "text": "Jennifer Thom-Santelli, Dan Cosley, and Geri Gay. 2010. What Do You Know?: Experts, Novices and Territoriality in Collaborative Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1685--1694.  ",
      "doi": "10.1145/1753326.1753578"
    },
    {
      "text": "Jennifer Thom-Santelli, Dan R. Cosley, and Geri Gay. 2009. What's Mine is Mine: Territoriality in Collaborative Authoring. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1481--1484.  ",
      "doi": "10.1145/1518701.1518925"
    },
    {
      "text": "Amy Voida, Judith S. Olson, and Gary M. Olson. 2013. Turbulence in the Clouds: Challenges of Cloud-based Information Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2273--2282.  ",
      "doi": "10.1145/2470654.2481313"
    },
    {
      "text": "Dakuo Wang, Judith S. Olson, Jingwen Zhang, Trung Nguyen, and Gary M. Olson. 2015. DocuViz: Visualizing Collaborative Writing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1865--1874.  ",
      "doi": "10.1145/2702123.2702517"
    },
    {
      "text": "Jie Zhang, Chuan Xiao, Sheng Hu, Toyohide Watanabe, and Yoshiharu Ishikawa. 2016. Managing Presentation Slides with Reused Elements. International Journal of Information and Education Technology 6, 3.",
      "doi": ""
    }
  ]
}