{
  "doi": "10.1145/3173574.3173619",
  "title": "Reading on Smart Glasses: The Effect of Text Position, Presentation Type and Walking",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "Smart glasses are increasingly being used in professional contexts. Having key applications such as short messaging and newsreader, they enable continuous access to textual information. In particular, smart glasses allow reading while performing other activities as they do not occlude the user's world view. For efficient reading, it is necessary to understand how a text should be presented on them. We, therefore, conducted a study with 24 participants using a Microsoft HoloLens to investigate how to display text on smart glasses while walking and sitting. We compared text presentation in the top-right, center, and bottom-center positions with Rapid Serial Visual Presentation (RSVP) and line-by-line scrolling. We found that text displayed in the top-right of smart glasses increases subjective workload and reduces comprehension. RSVP yields higher comprehension while sitting. Conversely, reading with scrolling yields higher comprehension while walking. Insights from our study inform the design of reading interfaces for smart glasses.",
  "tags": [
    "reading",
    "rsvp",
    "reading on the go",
    "smart glasses",
    "hololens"
  ],
  "authors": [
    {
      "name": "Rufat Rzayev",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87258776757",
      "orcid": "0000-0002-0466-2445"
    },
    {
      "name": "Paweł W. Woźniak",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-87958813957/rel-imgonly/pawel_cropped.jpg",
      "acmid": "87958813957",
      "orcid": "0000-0003-3670-1813"
    },
    {
      "name": "Tilman Dingler",
      "institution": "Osaka Prefecture University, Sakai, Osaka, Japan",
      "img": "/do/10.1145/contrib-81472653974/rel-imgonly/lichtbild.jpg",
      "acmid": "81472653974",
      "orcid": "0000-0001-6180-7033"
    },
    {
      "name": "Niels Henze",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81350574049/rel-imgonly/nielshenze.jpg",
      "acmid": "81350574049",
      "orcid": "0000-0002-5702-6290"
    }
  ],
  "references": [
    {
      "text": "Blaine Bell, Steven Feiner, and Tobias Höllerer. 2001. View Management for Virtual and Augmented Reality. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, New York, NY, USA, 101--110.  ",
      "doi": "10.1145/502348.502363"
    },
    {
      "text": "Simone Benedetto, Andrea Carbone, Marco Pedrotti, Kevin Le Fevre, Linda Amel Yahia Bey, and Thierry Baccino. 2015. Rapid serial visual presentation in reading: The case of Spritz. Computers in Human Behavior 45 (2015), 352--358.  ",
      "doi": "10.1016/j.chb.2014.12.043"
    },
    {
      "text": "John P. Chin, Virginia A. Diehl, and Kent L. Norman. 1988. Development of an Instrument Measuring User Satisfaction of the Human-computer Interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '88). ACM, New York, NY, USA, 213--218.  ",
      "doi": "10.1145/57167.57203"
    },
    {
      "text": "Soon Hau Chua, Simon T. Perrault, Denys J. C. Matthies, and Shengdong Zhao. 2016. Positioning Glass: Investigating Display Positions of Monocular Optical See-Through Head-Mounted Display. In Proceedings of the Fourth International Symposium on Chinese CHI (ChineseCHI2016). ACM, New York, NY, USA, Article 1, 6 pages.  ",
      "doi": "10.1145/2948708.2948713"
    },
    {
      "text": "Andrew Dillon, John Richardson, and Cliff McKnight. 1990. The effects of display size and text splitting on reading lengthy text from screen. Behaviour & Information Technology 9, 3 (1990), 215--227.",
      "doi": ""
    },
    {
      "text": "Robert L Duchnicky and Paul A Kolers. 1983. Readability of Text Scrolled on Visual Display Terminals as a Function of Window Size. Human Factors 25, 6 (1983), 683--692. PMID: 6671649.",
      "doi": ""
    },
    {
      "text": "Kenneth I Forster. 1970. Visual perception of rapidly presented word sequences of varying complexity. Attention, Perception, & Psychophysics 8, 4 (1970), 215--221.",
      "doi": ""
    },
    {
      "text": "Joseph L Gabbard, II J Edward Swan, and Deborah Hix. 2006. The effects of text drawing styles, background textures, and natural lighting on text legibility in outdoor augmented reality. Presence: Teleoperators and Virtual Environments 15, 1 (2006), 16--32.  ",
      "doi": "10.1162/pres.2006.15.1.16"
    },
    {
      "text": "Erin Gannon, Jibo He, Xuefei Gao, and Barbara Chaparro. 2016. RSVP Reading on a Smart Watch. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 60, 1 (2016), 1130--1134.",
      "doi": ""
    },
    {
      "text": "Edward Twitchell Hall. 1966. The hidden dimension. (1966).",
      "doi": ""
    },
    {
      "text": "Sandra G Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. Sage Publications Sage CA: Los Angeles, CA, 904--908.",
      "doi": ""
    },
    {
      "text": "Björn Hedin and Erik Lindgren. 2007. A Comparison of Presentation Methods for Reading on Mobile Phones. IEEE Distributed Systems Online 8, 6 (June 2007), 2--2.  ",
      "doi": "10.1109/MDSO.2007.34"
    },
    {
      "text": "Michelle Hester, Steffen Werner, Cassie Greenwald, and Jessica Gunning. 2016. Exploring the Effects of Text Length and Difficulty on RSVP Reading. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 60, 1 (2016), 1294--1298.",
      "doi": ""
    },
    {
      "text": "T Jin Kang and Paul Muter. 1989. Reading dynamically displayed text. Behaviour & information technology 8, 1 (1989), 33--42.",
      "doi": ""
    },
    {
      "text": "Andrés Lucero and Akos Vetek. 2014. NotifEye: Using Interactive Glasses to Deal with Notifications While Walking in Public. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (ACE '14). ACM, New York, NY, USA, Article 17, 10 pages.  ",
      "doi": "10.1145/2663806.2663824"
    },
    {
      "text": "Koji Makita, Masayuki Kanbara, and Naokazu Yokoya. 2009. View management of annotations for wearable augmented reality. In 2009 IEEE International Conference on Multimedia and Expo. 982--985. ",
      "doi": "10.5555/1698924.1699165"
    },
    {
      "text": "Michael E. J. Masson. 1983. Conceptual processing of text during skimming and rapid sequential reading. Memory & Cognition 11, 3 (01 May 1983), 262--274.",
      "doi": ""
    },
    {
      "text": "Terhi Mustonen, Maria Olkkonen, and Jukka Hakkinen. 2004. Examining Mobile Phone Text Legibility While Walking. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, New York, NY, USA, 1243--1246.  ",
      "doi": "10.1145/985921.986034"
    },
    {
      "text": "Gustav Öquist and Kristin Lundin. 2007. Eye Movement Study of Reading Text on a Mobile Phone Using Paging, Scrolling, Leading, and RSVP. In Proceedings of the 6th International Conference on Mobile and Ubiquitous Multimedia (MUM '07). ACM, New York, NY, USA, 176--183.  ",
      "doi": "10.1145/1329469.1329493"
    },
    {
      "text": "Jason Orlosky, Kiyoshi Kiyokawa, and Haruo Takemura. 2013. Dynamic Text Management for See-through Wearable and Heads-up Display Systems. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, New York, NY, USA, 363--370.  ",
      "doi": "10.1145/2449396.2449443"
    },
    {
      "text": "Jason Orlosky, Kiyoshi Kiyokawa, and Haruo Takemura. 2014. Managing Mobile Text in Head Mounted Displays: Studies on Visual Preference and Text Placement. SIGMOBILE Mob. Comput. Commun. Rev. 18, 2 (June 2014), 20--31.  ",
      "doi": "10.1145/2636242.2636246"
    },
    {
      "text": "Elizabeth Quinn and Ian Stephen Paul Nation. 1974. Speed reading: A course for learners of English. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Lauren FV Scharff, Alyson L Hill, and Albert J Ahumada. 2000. Discriminability measures for predicting readability of text on textured backgrounds. Opt. Express 6, 4 (Feb 2000), 81--91.",
      "doi": ""
    },
    {
      "text": "Bastian Schildbach and Enrico Rukzio. 2010. Investigating Selection and Reading Performance on a Mobile Phone While Walking. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/1851600.1851619"
    },
    {
      "text": "Kohei Tanaka, Yasue Kishino, Masakazu Miyamae, Tsutomu Terada, and Shojiro Nishio. 2008. An Information Layout Method for an Optical See-through Head Mounted Display Focusing on the Viewability. In Proceedings of the 7th IEEE/ACM International Symposium on Mixed and Augmented Reality (ISMAR '08). IEEE Computer Society, Washington, DC, USA, 139--142.  ",
      "doi": "10.1109/ISMAR.2008.4637340"
    },
    {
      "text": "Kristin Vadas, Nirmal Patel, Kent Lyons, Thad Starner, and Julie Jacko. 2006. Reading On-the-go: A Comparison of Audio and Hand-held Displays. In Proceedings of the 8th Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '06). ACM, New York, NY, USA, 219--226.  ",
      "doi": "10.1145/1152215.1152262"
    }
  ]
}