{
  "doi": "10.1145/3173574.3174160",
  "title": "Squadbox: A Tool to Combat Email Harassment Using Friendsourced Moderation",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Communication platforms have struggled to provide effective tools for people facing harassment online. We conducted interviews with 18 recipients of online harassment to understand their strategies for coping, finding that they often resorted to asking friends for help. Inspired by these findings, we explore the feasibility of friendsourced moderation  as a technique for combating online harassment. We present Squadbox, a tool to help recipients of email harassment coordinate a \"squad\" of friend moderators to shield and support them during attacks. Friend moderators intercept email from strangers and can reject, organize, and redirect emails, as well as collaborate on filters. Squadbox is designed to let its users implement highly customized workflows, as we found in interviews that harassment and preferences for mitigating it vary widely. We evaluated Squadbox on five pairs of friends in a field study, finding that participants could comfortably navigate around privacy and personalization concerns.",
  "tags": [
    "social media",
    "crowdsourcing",
    "email",
    "online harassment",
    "private messages",
    "friendsourcing",
    "moderation"
  ],
  "authors": [
    {
      "name": "Kaitlin Mahar",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260573",
      "orcid": "missing"
    },
    {
      "name": "Amy X. Zhang",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640424",
      "orcid": "0000-0001-9462-9835"
    },
    {
      "name": "David Karger",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100337812/rel-imgonly/square-photo-2.0569-17-centered.jpg",
      "acmid": "81100337812",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "CJ Adams and Lucas Dixon. 2017. Better discussions with imperfect models. (11 September 2017). Retrieved January 3, 2018 from https://medium.com/the-false-positive/ better-discussions-with-imperfect-models-91558235d442",
      "doi": ""
    },
    {
      "text": "Zahra Ashktorab and Jessica Vitak. 2016. Designing Cyberbullying Mitigation and Prevention Solutions Through Participatory Design With Teenagers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3895--3905.  ",
      "doi": "10.1145/2858036.2858548"
    },
    {
      "text": "Reuben Binns, Michael Veale, Max Van Kleek, and Nigel Shadbolt. 2017. Like trainer, like bot? Inheritance of bias in algorithmic content moderation. In Social Informatics: 9th International Conference, SocInfo 2017, Oxford, UK, September 13-15, 2017, Proceedings, Part II. Springer, Springer International Publishing, 405--415.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and Its Consequences for Online Harassment: Design Insights from HeartMob. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 24 (Dec. 2017), 19 pages.  ",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Michael L. Bourke and Sarah W. Craun. 2014. Secondary Traumatic Stress Among Internet Crimes Against Children Task Force Personnel: Impact, Risk Factors, and Coping Strategies. Sexual Abuse 26, 6 (2014), 586--609.",
      "doi": ""
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Anirudh Srinivasan, and Eric Gilbert. 2017. The Bag of Communities: Identifying Abusive Behavior Online with Preexisting Internet Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3175--3187.  ",
      "doi": "10.1145/3025453.3026018"
    },
    {
      "text": "Jill P. Dimond, Michaelanne Dye, Daphne Larose, and Amy S. Bruckman. 2013. Hollaback!: The Role of Storytelling Online in a Social Movement Organization. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 477--490.  ",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Maeve Duggan. 2017. Online Harassment 2017. The Pew Research Center. (11 July 2017). Retrieved September 8, 2017 from http://www.pewinternet.org/2017/07/11/ online-harassment-2017/",
      "doi": ""
    },
    {
      "text": "Steven Englehardt, Jeffrey Han, and Arvind Narayanan. 2018. I never signed up for this! Privacy implications of email tracking. Proceedings on Privacy Enhancing Technologies 1 (2018), 109--126.",
      "doi": ""
    },
    {
      "text": "Robert Faris, Amar Ashar, Urs Gasser, and Daisy Joo. 2016. Understanding Harmful Speech Online. Berkman Klein Center Research Publication 2016--21, (8 December 2016).",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Wai Yen Tang. 2017. Women's experiences with general and sexual harassment in online video games: Rumination, organizational responsiveness, withdrawal, and coping strategies. New Media&Society 19, 8 (2017), 1290--1307.",
      "doi": ""
    },
    {
      "text": "Björn Gambäck and Utpal Kumar Sikdar. 2017. Using Convolutional Neural Networks to Classify Hate-Speech. In Proceedings of the First Workshop on Abusive Language Online. Association for Computational Linguistics, 85--90. http://aclweb.org/anthology/W17--3013",
      "doi": ""
    },
    {
      "text": "R Stuart Geiger. 2016. Bot-based collective blocklists in Twitter: the counterpublic moderation of harassment in a networked public space. Information, Communication&Society 19, 6 (21 March 2016), 787--803. https://ssrn.com/abstract=2761503",
      "doi": ""
    },
    {
      "text": "Jennifer Golbeck, Zahra Ashktorab, Rashad O. Banjo, Alexandra Berlinger, Siddharth Bhagwan, Cody Buntain, Paul Cheakalos, Alicia A. Geller, Quint Gergory, Rajesh Kumar Gnanasekaran, Raja Rajan Gunasekaran, Kelly M. Hoffman, Jenny Hottle, Vichita Jienjitlert, Shivika Khare, Ryan Lau, Marianna J. Martindale, Shalmali Naik, Heather L. Nixon, Piyush Ramachandran, Kristine M. Rogers, Lisa Rogers, Meghna Sardana Sarin, Gaurav Shahane, Jayanee Thanki, Priyanka Vengataraman, Zijian Wan, and Derek Michael Wu. 2017. A Large Labeled Corpus for Online Harassment Research. In Proceedings of the 2017 ACM on Web Science Conference (WebSci '17). ACM, New York, NY, USA, 229--233.  ",
      "doi": "10.1145/3091478.3091509"
    },
    {
      "text": "Randi Lee Harper. 2014. Good Game Auto Blocker. (2014). Retrieved September 8, 2017 from https://github.com/freebsdgirl/ggautoblocker",
      "doi": ""
    },
    {
      "text": "Randi Lee Harper. 2016. Putting out the Twitter trashfire. Art + Marketing. (13 February 2016). Retrieved September 8, 2017 from https://artplusmarketing.com/ putting-out-the-twitter-trashfire-3ac6cb1af3e",
      "doi": ""
    },
    {
      "text": "Jacob Hoffman-Andrews. 2017. BlockTogether. (2017). Retrieved September 8, 2017 from https://blocktogether.org/",
      "doi": ""
    },
    {
      "text": "Hossein Hosseini, Sreeram Kannan, Baosen Zhang, and Radha Poovendran. 2017. Deceiving Google's Perspective API Built for Detecting Toxic Comments. CoRR abs/1702.08138 (2017). http://arxiv.org/abs/1702.08138",
      "doi": ""
    },
    {
      "text": "Google Jigsaw. 2017. Perspective API. (2017). Retrieved September 8, 2017 from https://www.perspectiveapi.com/",
      "doi": ""
    },
    {
      "text": "George Kennedy, Andrew McCollough, Edward Dixon, Alexei Bastidas, John Ryan, Chris Loo, and Saurav Sahay. 2017. Technology Solutions to Combat Online Harassment. In Proceedings of the First Workshop on Abusive Language Online. Association for Computational Linguistics, 73--77. http://aclweb.org/anthology/W17-3013",
      "doi": ""
    },
    {
      "text": "Nicolas Kokkalis, Chengdiao Fan, Johannes Roith, Michael S. Bernstein, and Scott Klemmer. 2017. MyriadHub: Efficiently Scaling Personalized Email Conversations with Valet Crowdsourcing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 73--84.  ",
      "doi": "10.1145/3025453.3025954"
    },
    {
      "text": "Nicolas Kokkalis, Thomas Köhn, Carl Pfeiffer, Dima Chornyi, Michael S. Bernstein, and Scott R. Klemmer. 2013. EmailValet: Managing Email Overload Through Private, Accountable Crowdsourcing. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 1291--1300.  ",
      "doi": "10.1145/2441776.2441922"
    },
    {
      "text": "Amanda Lenhart, Michele Ybarra, Kathryn Zickuhr, and Myeshia Price-Feeney. 2017. Online Harassment, Digital Abuse, and Cyberstalking in America. Data&Society. (18 January 2017). Retrieved September 8, 2017 from https://datasociety.net/blog/2017/01/18/ online-harassment-digital-abuse",
      "doi": ""
    },
    {
      "text": "Alice E Marwick and Ross W Miller. 2014. Online harassment, defamation, and hateful speech: A primer of the legal landscape. Fordham Center on Law and Information Policy Report, (10 June 2014). http://ssrn.com/abstract=2447904",
      "doi": ""
    },
    {
      "text": "J. Nathan Matias. 2016. High Impact Questions and Opportunities for Online Harassment Research and Action. (August 2016). Retrieved September 8, 2017 from https://civic.mit.edu/sites/civic.mit.edu/files/ OnlineHarassmentWorkshopReport-08.2016.pdf",
      "doi": ""
    },
    {
      "text": "J Nathan Matias, Amy Johnson, Whitney Erin Boesel, Brian Keegan, Jaclyn Friedman, and Charlie DeTar. 2015. Reporting, reviewing, and responding to harassment on Twitter. Women, Action, and the Media, (13 May 2015). http://womenactionmedia.org/twitter-report/",
      "doi": ""
    },
    {
      "text": "Kevin Munger. 2017. Tweetment Effects on the Tweeted: Experimentally Reducing Racist Harassment. Political Behavior 39, 3 (01 Sep 2017), 629--649.",
      "doi": ""
    },
    {
      "text": "Ji Ho Park and Pascale Fung. 2017. One-step and Two-step Classification for Abusive Language Detection on Twitter. CoRR abs/1706.01206 (2017). http://arxiv.org/abs/1706.01206",
      "doi": ""
    },
    {
      "text": "Jessica A. Pater, Moon K. Kim, Elizabeth D. Mynatt, and Casey Fiesler. 2016. Characterizations of Online Harassment: Comparing Policies Across Social Media Platforms. In Proceedings of the 19th International Conference on Supporting Group Work (GROUP '16). ACM, New York, NY, USA, 369--374.  ",
      "doi": "10.1145/2957276.2957297"
    },
    {
      "text": "Joseph Seering, Robert Kraut, and Laura Dabbish. 2017. Shaping Pro and Anti-Social Behavior on Twitch Through Moderation and Example-Setting. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 111--125.  ",
      "doi": "10.1145/2998181.2998277"
    },
    {
      "text": "Tamara Shepherd, Alison Harvey, Tim Jordan, Sam Srauy, and Kate Miltner. 2015. Histories of Hating. Social Media + Society 1, 2 (2015).",
      "doi": ""
    },
    {
      "text": "Aaron Smith and Maeve Duggan. 2018. Crossing the Line: What Counts as Online Harassment? The Pew Research Center. (4 January 2018). Retrieved January 8, 2018 from http://www.pewinternet.org/2018/01/04/ crossing-the-line-what-counts-as-online-harassment/",
      "doi": ""
    },
    {
      "text": "Working to Halt Online Abuse. 2013. WHOA Comparison Statistics 2000--2013. (2013). Retrieved September 8, 2017 from http://www.haltabuse.org/ resources/stats/Cumulative2000--2013.pdf",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying Women's Experiences With and Strategies for Mitigating Negative Effects of Online Harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1231--1245.  ",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "Charlie Warzel. 2016. \"A Honeypot For Assholes\": Inside Twitter's 10-Year Failure To Stop Harassment. (11 August 2016). Retrieved September 8, 2017 from https://www.buzzfeed.com/charliewarzel/ a-honeypot-for-assholes-inside-twitters-10-year-failure-to-s",
      "doi": ""
    },
    {
      "text": "Charlie Warzel. 2017. Twitter Is Still Dismissing Harassment Reports And Frustrating Victims. Buzzfeed. (17 July 2017). Retrieved September 8, 2017 from https://www.buzzfeed.com/charliewarzel/ twitter-is-still-dismissing-harassment-reports-and",
      "doi": ""
    },
    {
      "text": "Zeerak Waseem, Thomas Davidson, Dana Warmsley, and Ingmar Weber. 2017. Understanding Abuse: A Typology of Abusive Language Detection Subtasks. (2017), 78--84. http://aclweb.org/anthology/W17-3012",
      "doi": ""
    },
    {
      "text": "Janis Wolak, Kimberly J Mitchell, and David Finkelhor. 2007. Does online harassment constitute bullying? An exploration of online harassment by known peers and online-only contacts. The Journal of adolescent health : official publication of the Society for Adolescent Medicine 41, 6 (2007), S51--S58.",
      "doi": ""
    },
    {
      "text": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Ex Machina: Personal Attacks Seen at Scale. In Proceedings of the 26th International Conference on World Wide Web (WWW '17). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 1391--1399.  ",
      "doi": "10.1145/3038912.3052591"
    },
    {
      "text": "Amy X Zhang, Mark S Ackerman, and David R Karger. 2015. Mailing Lists: Why Are They Still Here, What's Wrong With Them, and How Can We Fix Them?. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 4009--4018.  ",
      "doi": "10.1145/2702123.2702194"
    }
  ]
}