{
  "doi": "10.1145/3173574.3174055",
  "title": "Infrastructuring the Solidarity Economy: Unpacking Strategies and Tactics in Designing Social Innovation",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Solidarity organizations in Europe are committed to building a more socially just society through a better configuration of democracy, politics and economy. In this paper, we describe our efforts to contribute to the socio-political designed innovation of solidarity movements through the establishment of a research lab embedded in, and operating within, the solidarity economy. We describe three cases that span the polarities of everyday and expert design, and contribute to the scaling out of social innovations. We use these cases to exemplify the strategies and tactics that emerge from the ongoing negotiation of 'infrastructuring' work with solidarity organizations. Finally, we discuss how guerilla infrastructuring, designing coalitions, and spanning design polarities can contribute to HCI and design for social innovation more generally.",
  "tags": [
    "solidarity economy",
    "social movements",
    "social innovation"
  ],
  "authors": [
    {
      "name": "Vasillis Vlachokyriakos",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502803064",
      "orcid": "0000-0001-6038-5959"
    },
    {
      "name": "Clara Crivellaro",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959323457",
      "orcid": "0000-0002-4578-4545"
    },
    {
      "name": "Pete Wright",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Athina Arampatzi. 2014. Resisting austerity: the spatial politics of solidarity and struggle in Athens, Greece. University of Leeds.",
      "doi": ""
    },
    {
      "text": "Athina Arampatzi and Walter J. Nicholls. 2012. The urban roots of anti-neoliberal social movements: The case of Athens, Greece. Environment and Planning A 44, 11: 2591--2610.",
      "doi": ""
    },
    {
      "text": "Thomas Binder and Eva Brandt. 2008. The Design: Lab as platform in participatory design research. Co-Design 4, 2: 115--129.",
      "doi": ""
    },
    {
      "text": "Erling Bjögvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Design things and design thinking: Contemporary participatory design challenges. Design Issues 28, 3: 101--116.",
      "doi": ""
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory design and democratizing innovation. In Proceedings of the 11th Biennial participatory design conference, 41--50.  ",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Agonistic participatory design: working with marginalised social movements. CoDesign 8, 2--3: 127--144.",
      "doi": ""
    },
    {
      "text": "Manuel Castells. 2012. Where are the \"indignados\" going\" La Vanguardia. Retrieved September 21, 2016 from https://goo.gl/7wL06M",
      "doi": ""
    },
    {
      "text": "Michel De Certeau and Pierre Mayol. 1998. The Practice of Everyday Life: Living and cooking. Volume 2. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2: 241--264.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec and Sarah Fox. 2015. Strangers at the gate: Gaining access, building rapport, and co-constructing community-based research. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work&Social Computing, 1348--1358.  ",
      "doi": "10.1145/2675133.2675147"
    },
    {
      "text": "Carl DiSalvo. 2009. Design and the Construction of Publics. Design Issues 25, 1: 48--63.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Andrew Clement, and Volkmar Pipek. 2012. Participatory design for, with, and by communities. International Handbook of Participatory Design. Simonsen, Jesper and Toni Robertson (Eds). Oxford: Routledge.(2012): 182--209.",
      "doi": ""
    },
    {
      "text": "Pelle Ehn. 2008. Participation in design things. In Proceedings of the tenth anniversary conference on participatory design 2008, 92--101. ",
      "doi": "10.5555/1795234.1795248"
    },
    {
      "text": "Andy Garbett, Rob Comber, Edd Jenkins, and Patrick Olivier. 2016. App Movement: A Platform for Community Commissioning of Mobile Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2858036.2858094"
    },
    {
      "text": "Julie Katherine Gibson-Graham. 2006. A postcapitalist politics. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Keith Hart, Jean-Louis Laville, and Antonio David Cattani. 2010. The human economy.",
      "doi": ""
    },
    {
      "text": "Gillian R Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 3: 15.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Per-Anders Hillgren, Anna Seravalli, and Anders Emilson. 2011. Prototyping and infrastructuring in design for social innovation. CoDesign 7, 3--4: 169--183.",
      "doi": ""
    },
    {
      "text": "Per-Anders Hillgren, Anna Seravalli, and Mette Agger Eriksen. 2016. Counter-hegemonic practices; dynamic interplay between agonism, commoning and strategic design. Strategic Design Research Journal 9, 2: 89.",
      "doi": ""
    },
    {
      "text": "Tom Jenkins, Christopher A Le Dantec, Carl Disalvo, Thomas Lodato, and Mariam Asad. 2016. Object-Oriented Publics.",
      "doi": ""
    },
    {
      "text": "Helena Karasti. 2014. Infrastructuring in participatory design. In Proceedings of the 13th Participatory Design Conference: Research Papers-Volume 1, 141--150.  ",
      "doi": "10.1145/2661435.2661450"
    },
    {
      "text": "Helena Karasti and Karen S Baker. 2004. Infrastructuring for the long-term: Ecological information management. In Proceedings of the 37th Annual Hawaii International Conference on System Sciences. ",
      "doi": "10.5555/962749.962804"
    },
    {
      "text": "Helena Karasti and Karen S Baker. 2008. Community Design: growing one's own information infrastructure. In Proceedings of the Tenth Anniversary Conference on Participatory Design 2008, 217--220. ",
      "doi": "10.5555/1795234.1795280"
    },
    {
      "text": "Helena Karasti, Karen S Baker, and Eija Halkola. 2006. Enriching the notion of data curation in e-science: data managing and information infrastructuring in the long term ecological research (LTER) network. Computer Supported Cooperative Work (CSCW) 15, 4: 321--358.  ",
      "doi": "10.1007/s10606-006-9023-2"
    },
    {
      "text": "Helena Karasti and Anna-Liisa Syrjänen. 2004. Artful infrastructuring in two cases of community PD. In Proceedings of the eighth conference on Participatory design: Artful integration: interweaving media, materials and practices-Volume 1, 20--30.  ",
      "doi": "10.1145/1011870.1011874"
    },
    {
      "text": "Emily Kawano, Thomas Neal Masterson, and Jonathan Teller-elsberg. 2009. Solidarity Economy I?: Building Alternatives for People and Planet.",
      "doi": ""
    },
    {
      "text": "Matthias Korn and Amy Voida. 2015. Creating Friction: Infrastructuring Civic Engagement in Everyday Life. In Proceedings of the Decennial Aarhus Conference on Critical Alternatives.  ",
      "doi": "10.7146/aahcc.v1i1.21198"
    },
    {
      "text": "Lila Leontidou. 2010. Urban social movements in \"weak\"civil societies: The right to the city and cosmopolitan activism in Southern Europe. Urban Studies 47, 6: 1179--1203.",
      "doi": ""
    },
    {
      "text": "Ezio Manzini. 2014. Making things happen: Social innovation and design. Design Issues 30, 1: 57--66.",
      "doi": ""
    },
    {
      "text": "Ezio Manzini and Rachel Coad. 2015. Design, when everybody designs: An introduction to design for social innovation. MIT press.",
      "doi": ""
    },
    {
      "text": ".Sanna Marttila, Andrea Botero, and Joanna Saad-Sulonen. 2014. Towards commons design in participatory design. In Proceedings of the 13th Participatory Design Conference, 9--12.  ",
      "doi": "10.1145/2662155.2662187"
    },
    {
      "text": "Chantal Mouffe. 2000. The democratic paradox. Verso.",
      "doi": ""
    },
    {
      "text": "Laura J Neumann and Susan Leigh Star. 1996. Making infrastructure: The dream of a common language. In PDC, 231--240.",
      "doi": ""
    },
    {
      "text": "Volkmar Pipek and Volker Wulf. 2009. Infrastructuring: Toward an integrated perspective on the design and use of information technology. Journal of the Association for Information Systems 10, 5: 447.",
      "doi": ""
    },
    {
      "text": "Theodoros Rakopoulos. 2014. Resonance of solidarity: meanings of a local concept in anti-austerity Greece. Journal of Modern Greek Studies 32, 2: 313--337.",
      "doi": ""
    },
    {
      "text": "Theodoros Rakopoulos. 2014. The crisis seen from below, within, and against: from solidarity economy to food distribution cooperatives in Greece. Dialectical Anthropology 38, 2: 189--207.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star. 1999. The ethnography of infrastructure. American behavioral scientist 43, 3: 377--391.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Karen Ruhleder. 1994. Steps towards an ecology of infrastructure: complex problems in design and access for large-scale collaborative systems. In Proceedings of the 1994 ACM conference on Computer supported cooperative work, 253--264.  ",
      "doi": "10.1145/192844.193021"
    },
    {
      "text": "Susan Leigh Star and Karen Ruhleder. 1996. Steps toward an ecology of infrastructure: Design and access for large information spaces. Information systems research 7, 1: 111--134.  ",
      "doi": "10.1287/isre.7.1.111"
    },
    {
      "text": "Maurizio Teli. 2015. Computing and the common: hints of a new utopia in participatory design. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives, 17--20.  ",
      "doi": "10.7146/aahcc.v1i1.21318"
    },
    {
      "text": "Maurizio Teli, Angela Di Fiore, and Vincenzo D'Andrea. 2016. Computing and the common: an empirical case of participatory design today. In Proceedings of the 14th Participatory Design Conference: Full papers-Volume 1, 1--10.  ",
      "doi": "10.1145/2940299.2940312"
    },
    {
      "text": "Vasilis Vlachokyriakos, Rob Comber, Karim Ladha, Nick Taylor, Paul Dunphy, Patrick McCorry, and Patrick Olivier. 2014. PosterVote: Expanding the Action Repertoire for Local Political Activism. In Proceedings of the Designing Interactive Systems Conference.  ",
      "doi": "10.1145/2598510.2598523"
    },
    {
      "text": "Vasilis Vlachokyriakos, Clara Crivellaro, Christopher A Le Dantec, Eric Gordon, Pete Wright, and Patrick Olivier. 2016. Digital Civics: Citizen Empowerment With and Through Technology. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, 1096--1099.  ",
      "doi": "10.1145/2851581.2886436"
    },
    {
      "text": "Vasilis Vlachokyriakos, Clara Crivellaro, Pete Wright, Evika Karamagioli, Eleni-Revekka Staiou, Dimitris Gouscos, Rowan Thorpe, Antonio Krüger, Johannes Schöning, Matt Jones, and others. 2017. HCI, Solidarity Movements and the Solidarity Economy. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 3126--3137.  ",
      "doi": "10.1145/3025453.3025490"
    }
  ]
}