{
  "doi": "10.1145/3173574.3173759",
  "title": "SymbiosisSketch: Combining 2D & 3D Sketching for Designing Detailed 3D Objects in Situ",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2018,
  "badges": [],
  "abstract": "We present SymbiosisSketch, a hybrid sketching system that combines drawing in air (3D) and on a drawing surface (2D) to create detailed 3D designs of arbitrary scale in an augmented reality (AR) setting. SymbiosisSketch leverages the complementary affordances of 3D (immersive, unconstrained, life-sized) and 2D (precise, constrained, ergonomic) interactions for in situ 3D conceptual design. A defining aspect of our system is the ongoing creation of surfaces from unorganized collections of 3D curves. These surfaces serve a dual purpose: as 3D canvases to map strokes drawn on a 2D tablet, and as shape proxies to occlude the physical environment and hidden curves in a 3D sketch. SymbiosisSketch users draw interchangeably on a 2D tablet or in 3D within an ergonomically comfortable canonical volume, mapped to arbitrary scale in AR. Our evaluation study shows this hybrid technique to be easy to use in situ and effective in transcending the creative potential of either traditional sketching or drawing in air.",
  "authors": [
    {
      "name": "Rahul Arora",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-99659159921/rel-imgonly/rahul_arora_aug_2021.jpg",
      "acmid": "99659159921",
      "orcid": "missing"
    },
    {
      "name": "Rubaiat Habib Kazi",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260374",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    },
    {
      "name": "Karan Singh",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335497253",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. Gravity Sketch - Bringing Virtual Reality Into Your Design Workflow. (2017). https://www.gravitysketch.com/",
      "doi": ""
    },
    {
      "text": "2017. MixedRealityToolkit-Unity. (Sept. 2017). https: //github.com/Microsoft/MixedRealityToolkit-Unity original-date: 2016-01--28T18:54:58Z.",
      "doi": ""
    },
    {
      "text": "2017. Pixologic : ZBrush - The all-in-one-digital sculpting solution. (2017). http://pixologic.com",
      "doi": ""
    },
    {
      "text": "2017. Tilt Brush by Google. (2017). https://www.tiltbrush.com/",
      "doi": ""
    },
    {
      "text": "Fatemeh Abbasinejad, Pushkar Joshi, and Nina Amenta. 2011. Surface Patches from Unorganized Space Curves. Computer Graphics Forum 30, 5 (Aug. 2011), 1379--1387.",
      "doi": ""
    },
    {
      "text": "Ian G. Angus and Henry A. Sowizral. 1995. Embedding the 2D interaction metaphor in a real 3D virtual environment, Vol. 2409. International Society for Optics and Photonics, 282--294.",
      "doi": ""
    },
    {
      "text": "Rahul Arora, Rubaiat Habib Kazi, Fraser Anderson, Tovi Grossman, Karan Singh, and George Fitzmaurice. 2017. Experimental Evaluation of Sketching on Surfaces in VR. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5643--5654.  ",
      "doi": "10.1145/3025453.3025474"
    },
    {
      "text": "Seok-Hyung Bae, Ravin Balakrishnan, and Karan Singh. 2008. ILoveSketch: as-natural-as-possible sketching system for creating 3d curve models. In Proceedings of the 21st annual ACM symposium on User interface software and technology. ACM, 151--160.  ",
      "doi": "10.1145/1449715.1449740"
    },
    {
      "text": "Seok-Hyung Bae, Ravin Balakrishnan, and Karan Singh. 2009. EverybodyLovesSketch: 3D Sketching for a Broader Audience. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, New York, NY, USA, 59--68.  ",
      "doi": "10.1145/1622176.1622189"
    },
    {
      "text": "Katie Bassett, Ilya Baran, Johannes Schmid, Markus Gross, and Robert W. Sumner. 2013. Authoring and Animating Painterly Characters. ACM Trans. Graph. 32, 5, Article 156 (Oct. 2013), 12 pages.  ",
      "doi": "10.1145/2484238"
    },
    {
      "text": "Mikhail Bessmeltsev, Caoyu Wang, Alla Sheffer, and Karan Singh. 2012. Design-driven quadrangulation of closed 3D curves. ACM Transactions on Graphics 31, 6 (Nov. 2012), 1.  ",
      "doi": "10.1145/2366145.2366197"
    },
    {
      "text": "Richard L. Bishop. 1975. There is More than One Way to Frame a Curve. The American Mathematical Monthly 82, 3 (March 1975), 246.",
      "doi": ""
    },
    {
      "text": "D. A. Bowman, J. Wineman, L. F. Hodges, and D. Allison. 1998. Designing animal habitats within an immersive VE. IEEE Computer Graphics and Applications 18, 5 (Sept. 1998), 9--13.  ",
      "doi": "10.1109/38.708555"
    },
    {
      "text": "D. A. Bowman and C. A. Wingrave. 2001. Design and evaluation of menu systems for immersive virtual environments. In Proceedings IEEE Virtual Reality 2001. 149--156. ",
      "doi": "10.5555/580521.835855"
    },
    {
      "text": "Xuejin Chen, Sing Bing Kang, Ying-Qing Xu, Julie Dorsey, and Heung-Yeung Shum. 2008. Sketching Reality: Realistic Interpretation of Architectural Designs. ACM Trans. Graph. 27, 2 (May 2008), 11:1--11:15.  ",
      "doi": "10.1145/1356682.1356684"
    },
    {
      "text": "Xiang Anthony Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects. ACM Press, 29--39.  ",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Kelvin Cheng and Masahiro Takatsuk. 2009. Interaction Paradigms for Bare-Hand Interaction with Large Displays at a Distance. In Human-Computer Interaction, Inaki Maurtua (Ed.). InTech, 195--222.",
      "doi": ""
    },
    {
      "text": "Siu-Wing Cheng, Tamal Krishna Dey, and Jonathan Richard Shewchuk. 2013. Algorithms for constructing Delaunay triangulations. CRC Press / Taylor & Francis, Boca Raton, Fla. OCLC: 844619099.",
      "doi": ""
    },
    {
      "text": "Zeynep Cipiloglu, Abdullah Bulbul, and Tolga Capin. 2010. A framework for enhancing depth perception in computer graphics. ACM Press, 141.  ",
      "doi": "10.1145/1836248.1836276"
    },
    {
      "text": "Josh Constine. 2016. Oculus \"Quill\" Turns VR Painting Into Performance Art. (2016). http://social.techcrunch.com/2016/01/26/oculus-quill/",
      "doi": ""
    },
    {
      "text": "Chris De Paoli and Karan Singh. 2015. SecondSkin: Sketch-based Construction of Layered 3D Models. ACM Trans. Graph. 34, 4 (July 2015), 126:1--126:10.  ",
      "doi": "10.1145/2766948"
    },
    {
      "text": "Michael F. Deering. 1995. HoloSketch: A Virtual Reality Sketching/Animation Tool. ACM Trans. Comput.-Hum. Interact. 2, 3 (Sept. 1995), 220--238.  ",
      "doi": "10.1145/210079.210087"
    },
    {
      "text": "Gianluca Donato and Serge Belongie. 2002. Approximate Thin Plate Spline Mappings. In Computer Vision ECCV 2002, Gerhard Goos, Juris Hartmanis, Jan van Leeuwen, Anders Heyden, Gunnar Sparr, Mads Nielsen, and Peter Johansen (Eds.). Vol. 2352. Springer Berlin Heidelberg, Berlin, Heidelberg, 21--31. http://link.springer.com/10.1007/3--540--47977--5_2 ",
      "doi": "10.5555/645317.649310"
    },
    {
      "text": "Tom Dorta, Gokce Kinayoglu, and Michael Hoffmann. 2016. Hyve-3D and the 3D Cursor: Architectural co-design with freedom in Virtual Reality. International Journal of Architectural Computing 14, 2 (2016), 87--102.",
      "doi": ""
    },
    {
      "text": "David Eberly. 2000. Least squares fitting of data. (2000).",
      "doi": ""
    },
    {
      "text": "Koos Eissen and Roselien Steur. 2011. Sketching: the basics ; the prequel to Sketching: drawing techniques for product designers. BIS, Amsterdam. OCLC: 756275344.",
      "doi": ""
    },
    {
      "text": "Michele Fiorentino, Giuseppe Monno, Pietro Alexander Renzulli, and Antonio E. Uva. 2003. 3D Sketch Stroke Segmentation and Fitting in Virtual Reality. In International Conference Graphicon.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman, Ravin Balakrishnan, Gordon Kurtenbach, George Fitzmaurice, Azam Khan, and Bill Buxton. 2002. Creating Principal 3D Curves with Digital Tape Drawing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 121--128.  ",
      "doi": "10.1145/503376.503398"
    },
    {
      "text": "Andrew J. Hanson and Hui Ma. 1995. Parallel transport approach to curve framing. Technical Report TR425. 4--7 pages. ftp://ftp.cs.indiana.edu/pub/hanson/iucs-tr425.ps",
      "doi": ""
    },
    {
      "text": "Ian P. Howard and Brian J. Rogers. 2008. Depth from monocular cues and vergence. In Seeing in Depth. Oxford University Press, 355--410. http://www.oxfordscholarship.com/view/10.1093/acprof: oso/9780195367607.001.0001/acprof-9780195367607",
      "doi": ""
    },
    {
      "text": "Kiia Kallio. 2005. 3D6B Editor: Projective 3D Sketching with Line-Based Rendering. The Eurographics Association. http://diglib.eg.org/handle/10.2312/SBM.SBM05.073-079",
      "doi": ""
    },
    {
      "text": "L. B. Kara and K. Shimada. 2007. Sketch-Based 3D-Shape Creation for Industrial Styling Design. IEEE Computer Graphics and Applications 27, 1 (Jan. 2007), 60--71.  ",
      "doi": "10.1109/MCG.2007.18"
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Hyunmin Cheong, Ali Hashemi, and George Fitzmaurice. 2017. DreamSketch: Early Stage 3D Design Explorations with Sketching and Generative Design. ACM, Quebec City, QC, Canada.",
      "doi": ""
    },
    {
      "text": "Daniel Keefe, Robert Zeleznik, and David Laidlaw. 2007. Drawing on air: Input techniques for controlled 3D line illustration. IEEE Transactions on Visualization and Computer Graphics 13, 5 (2007), 1067--1081. http:// ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=4135646  ",
      "doi": "10.1109/TVCG.2007.1060"
    },
    {
      "text": "Daniel F. Keefe, Daniel Acevedo Feliz, Tomer Moscovich, David H. Laidlaw, and Joseph J. LaViola Jr. 2001. CavePainting: a fully immersive 3D artistic medium and interactive experience. In Proceedings of the 2001 symposium on Interactive 3D graphics. ACM, 85--93.  ",
      "doi": "10.1145/364338.364370"
    },
    {
      "text": "Yongkwan Kim and Seok-Hyung Bae. 2016. SketchingWithHands: 3D Sketching Handheld Products with First-Person Hand Posture. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 797--808.  ",
      "doi": "10.1145/2984511.2984567"
    },
    {
      "text": "Vojtêch Krs, Ersin Yumer, Nathan Carr, Bedrich Benes, and Radomìr Mêch. 2017. Skippy: single view 3D curve interactive modeling. ACM Transactions on Graphics 36, 4 (July 2017), 1--12.  ",
      "doi": "10.1145/3072959.3073603"
    },
    {
      "text": "P. Lapides, E. Sharlin, M.C. Sousa, and L. Streit. 2006. The 3D Tractus: A Three-Dimensional Drawing Board. IEEE, 169--176.  ",
      "doi": "10.1109/TABLETOP.2006.33"
    },
    {
      "text": "Yuwei Li, Xi Luo, Youyi Zheng, Pengfei Xu, and Hangbo Fu. 2017. SweepCanvas: Sketch-based 3D Prototyping on an RGB-D Image. ACM, Quebec City, QC, Canada.",
      "doi": ""
    },
    {
      "text": "John Finley Lucas. 2005. Design and evaluation of 3D multiple object selection techniques. Ph.D. Dissertation. Virginia Tech.",
      "doi": ""
    },
    {
      "text": "Patrick Paczkowski, Min H. Kim, Yann Morvan, Julie Dorsey, Holly Rushmeier, and Carol O'Sullivan. 2011. Insitu: Sketching Architectural Designs in Context. In Proceedings of the 2011 SIGGRAPH Asia Conference (SA '11). ACM, New York, NY, USA, 182:1--182:10.  ",
      "doi": "10.1145/2024156.2024216"
    },
    {
      "text": "Scott Robertson and Thomas Bertling. 2013. How to draw: drawing and sketching objects and environments from your imagination. Designstudio Press, Culver City, Calif. OCLC: 897060023.",
      "doi": ""
    },
    {
      "text": "E. Sachs, A. Roberts, and D. Stoops. 1991. 3-Draw: a tool for designing 3D shapes. IEEE Computer Graphics and Applications 11, 6 (Nov. 1991), 18--26.  ",
      "doi": "10.1109/38.103389"
    },
    {
      "text": "Bardia Sadri and Karan Singh. 2014. Flow-complex-based Shape Reconstruction from 3D Curves. ACM Trans. Graph. 33, 2 (April 2014), 20:1--20:15.  ",
      "doi": "10.1145/2560328"
    },
    {
      "text": "Steven Schkolne, Michael Pruett, and Peter Schruder. 2001. Surface Drawing: Creating Organic 3D Shapes with the Hand and Tangible Tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 261--268.  ",
      "doi": "10.1145/365024.365114"
    },
    {
      "text": "Ryan Schmidt, Azam Khan, Karan Singh, and Gord Kurtenbach. 2009. Analytic drawing of 3D scaffolds. ACM Press, 1.  ",
      "doi": "10.1145/1618452.1618495"
    },
    {
      "text": "Ryan Schmidt and Karan Singh. 2008. Sketch-Based Procedural Surface Modeling and Compositing Using Surface Trees. Computer Graphics Forum 27, 2 (April 2008), 321--330.",
      "doi": ""
    },
    {
      "text": "Karan Singh. 2006. Industrial motivation for interactive shape modeling: a case study in conceptual automotive design. ACM Press, 3.  ",
      "doi": "10.1145/1185657.1185671"
    },
    {
      "text": "Ivan E. Sutherland. 1963. Sketchpad: a man-machine graphical communication system. ACM Press, 329.  ",
      "doi": "10.1145/1461551.1461591"
    },
    {
      "text": "Zsolt Szalavàri and Michael Gervautz. 1997. The Personal Interaction Panel--a Two-Handed Interface for Augmented Reality. Computer Graphics Forum 16, 3 (Sept. 1997), C335--C346.",
      "doi": ""
    },
    {
      "text": "Shun' ichi Tano, Shinya Yamamoto, Junko Ichino, Tomonori Hashiyama, and Mitsuru Iwata. 2013. Truly Useful 3D Drawing System for Professional Designer by \"Life-Sized and Operable\" Feature and New Interaction. In Human-Computer Interaction--INTERACT 2013. Number 8117 in Lecture Notes in Computer Science. Springer Berlin Heidelberg, 37--55.",
      "doi": ""
    },
    {
      "text": "Yannick Thiel, Karan Singh, and Ravin Balakrishnan. 2011. Elasticurves: exploiting stroke dynamics and inertia for the real-time neatening of sketched 2D curves. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 383--392.  ",
      "doi": "10.1145/2047196.2047246"
    },
    {
      "text": "Gerold Wesche and Hans-Peter Seidel. 2001. FreeDrawer: a free-form sketching system on the responsive workbench. ACM Press, 167.  ",
      "doi": "10.1145/505008.505041"
    },
    {
      "text": "Brian Whited, Eric Daniels, Michael Kaschalk, Patrick Osborne, and Kyle Odermatt. 2012. Computer-assisted Animation of Line and Paint in Disney's Paperman. In ACM SIGGRAPH 2012 Talks (SIGGRAPH '12). ACM, New York, NY, USA, Article 19, 1 pages.  ",
      "doi": "10.1145/2343045.2343071"
    },
    {
      "text": "Baoxuan Xu, William Chang, Alla Sheffer, Adrien Bousseau, James McCrae, and Karan Singh. 2014. True2Form: 3D Curve Networks from 2D Sketches via Selective Regularization. ACM Trans. Graph. 33, 4 (July 2014), 131:1--131:13.  ",
      "doi": "10.1145/2601097.2601128"
    },
    {
      "text": "Maria C Yang and Jorge G Cham. 2007. An analysis of sketching skill and its role in early stage engineering design. Journal of Mechanical Design 129, 5 (2007), 476--482.",
      "doi": ""
    },
    {
      "text": "Youyi Zheng, Han Liu, Julie Dorsey, and Niloy J. Mitra. 2016. SmartCanvas: Context-inferred Interpretation of Sketches for Preparatory Design Studies. In Computer Graphics Forum, Vol. 35. Wiley Online Library, 37--48.  ",
      "doi": "10.5555/3028584.3028590"
    }
  ]
}