{
  "doi": "10.1145/3173574.3173813",
  "title": "KeyTime: Super-Accurate Prediction of Stroke Gesture Production Times",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We introduce KeyTime, a new technique and accompanying software for predicting the production times of users' stroke gestures articulated on touchscreens. KeyTime employs the principles and concepts of the Kinematic Theory, such as lognormal modeling of stroke gestures' velocity profiles, to estimate gesture production times significantly more accurately than existing approaches. Our experimental results obtained on several public datasets show that KeyTime predicts user-independent production times that correlate r=.99 with groundtruth from just one example of a gesture articulation, while delivering an average error in the predicted time magnitude that is 3 to 6 times smaller than that delivered by CLC, the best prediction technique up to date. Moreover, KeyTime reports a wide range of useful statistics, such as the trimmed mean, median, standard deviation, and confidence intervals, providing practitioners with unprecedented levels of accuracy and sophistication to characterize their users' a priori time performance with stroke gesture input.",
  "authors": [
    {
      "name": "Luis A. Leiva",
      "institution": "Sciling, Valencia, Spain",
      "img": "/do/10.1145/contrib-81413601851/rel-imgonly/luileito-crop.jpg",
      "acmid": "81413601851",
      "orcid": "0000-0002-5011-1847"
    },
    {
      "name": "Daniel Martín-Albo",
      "institution": "Universitat Politècnica de València, Valencia, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488670951",
      "orcid": "missing"
    },
    {
      "name": "Réjean Plamondon",
      "institution": "Ecole Polytechnique de Montreal, Montreal, PQ, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100456687",
      "orcid": "missing"
    },
    {
      "name": "Radu-Daniel Vatavu",
      "institution": "University Stefan cel Mare of Suceava, Suceava, Romania",
      "img": "/do/10.1145/contrib-81343507895/rel-imgonly/radu.jpg",
      "acmid": "81343507895",
      "orcid": "0000-0002-7631-6445"
    }
  ],
  "references": [
    {
      "text": "Johnny Accot and Shumin Zhai. 1997. Beyond Fitts' law: Models for trajectory-based HCI tasks. In Proc. CHI '97.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Abdullah Almaksour, Eric Anquetil, Réjean Plamondon, and Christian O'Reilly. 2011. Synthetic handwritten gesture generation using Sigma-Lognormal model for evolving handwriting classifiers. In Proc. IGS '11.",
      "doi": ""
    },
    {
      "text": "Lisa Anthony, Radu-Daniel Vatavu, and Jacob O. Wobbrock. 2013. Understanding the consistency of users' pen and finger stroke gesture articulation. In Proc. GI '13. ",
      "doi": "10.5555/2532129.2532145"
    },
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2010. A lightweight multistroke recognizer for user interface prototypes. In Proc. GI '10. ",
      "doi": "10.5555/1839214.1839258"
    },
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2012. $N-protractor: a fast and accurate multistroke recognizer. In Proc. GI '12. ",
      "doi": "10.5555/2305276.2305296"
    },
    {
      "text": "Caroline Appert and Shumin Zhai. 2009. Using strokes as command shortcuts: Cognitive benefits and toolkit support. In Proc. CHI '09.  ",
      "doi": "10.1145/1518701.1519052"
    },
    {
      "text": "Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. Ffitts law: Modeling finger touch with Fitts' law. In Proc. CHI '13.  ",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Rachel Blagojevic, Samuel Hsiao-Heng Chang, and Beryl Plimmer. 2010. The power of automatic feature selection: Rubine on steroids. In Proc. SBIM '10. ",
      "doi": "10.5555/1923363.1923377"
    },
    {
      "text": "Xiang Cao and Shumin Zhai. 2007. Modeling human performance of pen stroke gestures. In Proc. CHI '07.  ",
      "doi": "10.1145/1240624.1240850"
    },
    {
      "text": "Stuart K. Card, Thomas P. Moran, and Allen Newell. 1980. The keystroke-level model for user performance time with interactive systems. Commun. ACM 23(1).  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Steven J. Castellucci and I. Scott MacKenzie. 2008. Graffiti vs. Unistrokes: An empirical comparison. In Proc. CHI '08.  ",
      "doi": "10.1145/1357054.1357106"
    },
    {
      "text": "Moussa Djioua and Réjean Plamondon. 2009. Studying the variability of handwriting patterns using the Kinematic Theory. Hum. Mov. Sci. 28(5).",
      "doi": ""
    },
    {
      "text": "Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. J. Exp. Psychol. 47(6).",
      "doi": ""
    },
    {
      "text": "Tamar Flash and Neville Hogan. 1985. The coordination of arm movements: an experimentally confirmed mathematical model. J. Neurosci. 5(7).",
      "doi": ""
    },
    {
      "text": "Javier Galbally, Réjean Plamondon, Julián Fierrez, and Javier Ortega-García. 2012. Synthetic on-line signature generation. Part II: Experimental validation. Pattern Recogn. 45(7).  ",
      "doi": "10.1016/j.patcog.2011.12.007"
    },
    {
      "text": "Poika Isokoski. 2001. Model for unistroke writing time. In Proc. CHI '01.  ",
      "doi": "10.1145/365024.365299"
    },
    {
      "text": "Shaun K. Kane, Jeffrey P. Bigham, and Jacob O. Wobbrock. 2008. Slide rule: Making mobile touch screens accessible to blind people using multi-touch interaction techniques. In Proc. ASSETS '08.  ",
      "doi": "10.1145/1414471.1414487"
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. 2011. Usable gestures for blind people: Understanding preference and performance. In Proc. CHI '11.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Per Ola Kristensson and Shumin Zhai. 2004. SHARK2 : A large vocabulary shorthand writing system for pen-based computers. In Proc. UIST '04.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Luis A. Leiva. 2017. Large-scale user perception of synthetic stroke gestures. In Proc. DIS '17.  ",
      "doi": "10.1145/3064663.3064724"
    },
    {
      "text": "Luis A. Leiva, Vicent Alabau, Verónica Romero, Alejandro H. Toselli, and Enrique Vidal. 2014. Context-aware gestures for mixed-initiative text editing UIs. Interact. Comput. 27(1).",
      "doi": ""
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, and Réjean Plamondon. 2016. Gestures à Go Go: Authoring synthetic human-like stroke gestures using the kinematic theory of rapid movements. ACM T. Intel. Syst. Tec. 7(2).  ",
      "doi": "10.1145/2799648"
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, and Réjean Plamondon. 2017a. The Kinematic Theory produces human-like stroke gestures. Interact. Comput. 29(4).",
      "doi": ""
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, and Radu-Daniel Vatavu. 2017b. Synthesizing stroke gestures across user populations: A case for users with visual impairments. In Proc. CHI '17.  ",
      "doi": "10.1145/3025453.3025906"
    },
    {
      "text": "A. Chris Long, Jr., James A. Landay, Lawrence A. Rowe, and Joseph Michiels. 2000. Visual similarity of pen gestures. In Proc. CHI '00.  ",
      "doi": "10.1145/332040.332458"
    },
    {
      "text": "Daniel Martín-Albo and Luis A. Leiva. 2016. G3: bootstrapping stroke gestures design with synthetic samples and built-in recognizers. In Proc. MobileHCI '16.  ",
      "doi": "10.1145/2957265.2961833"
    },
    {
      "text": "Daniel Martín-Albo, Réjean Plamondon, and Enrique Vidal. 2014. Training of on-line handwriting text recognizers with synthetic text generated using the Kinematic Theory of rapid human movements. In Proc. ICFHR '14.",
      "doi": ""
    },
    {
      "text": "Daniel Martín-Albo, Réjean Plamondon, and Enrique Vidal. 2015. Improving sigma-lognormal parameter extraction. In Proc. ICDAR '15.  ",
      "doi": "10.1109/ICDAR.2015.7333769"
    },
    {
      "text": "Jörg Müller, Antti Oulasvirta, and Roderick Murray-Smith. 2017. Control theoretic models of pointing. ACM Trans. Comput.-Hum. Interact. 24(4).  ",
      "doi": "10.1145/3121431"
    },
    {
      "text": "Christian O'Reilly, Réjean Plamondon, Mohamed K. Landou, and Brigitte Stemmer. 2013. Using kinematic analysis of movement to predict the time occurrence of an evoked potential associated with a motor command. Eur. J. Neurosci. 37(2).",
      "doi": ""
    },
    {
      "text": "Réjean Plamondon. 1995a. A kinematic theory of rapid human movements. Part I: Movement representation and control. Biol. Cybern. 72(4).  ",
      "doi": "10.1007/BF00202786"
    },
    {
      "text": "Réjean Plamondon. 1995b. A kinematic theory of rapid human movements. Part II: Movement time and control. Biol. Cybern. 72(4).  ",
      "doi": "10.1007/BF00202786"
    },
    {
      "text": "Réjean Plamondon, Adel M. Alimi, Pierre Yergeau, and Franck Leclerc. 1993. Modelling velocity profiles of rapid movements: a comparative study. Biol. Cybern. 69(1).  ",
      "doi": "10.1007/BF00226195"
    },
    {
      "text": "Réjean Plamondon and Moussa Djioua. 2006. A multi-level representation paradigm for handwriting stroke generation. Hum. Mov. Sci. 25(4--5).",
      "doi": ""
    },
    {
      "text": "Réjean Plamondon, Chunhua Feng, and Anna Woch. 2003. A kinematic theory of rapid human movement. Part IV: A formal mathematical proof and new insights. Biol. Cybern. 89(2).  ",
      "doi": "10.1007/s00422-003-0407-9"
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2016. Modeling gesture-typing movements. Hum.-Comput. Interact.. Advance online publication.",
      "doi": ""
    },
    {
      "text": "Yosra Rekik, Radu-Daniel Vatavu, and Laurent Grisoni. 2014. Understanding users' perceived difficulty of multi-touch gesture articulation. In Proc. ICMI '14.  ",
      "doi": "10.1145/2663204.2663273"
    },
    {
      "text": "Quentin Roy, Sylvain Malacria, Yves Guiard, Eric Lecolinet, and James Eagan. 2013. Augmented letters: Mnemonic gesture-based shortcuts. In Proc. CHI '13.  ",
      "doi": "10.1145/2470654.2481321"
    },
    {
      "text": "Eugene M. Taranta, II, Mehran Maghoumi, Corey R. Pittman, and Joseph J. LaViola, Jr. 2016. A rapid prototyping approach to synthetic data generation for improved 2D gesture recognition. In Proc. UIST '16.  ",
      "doi": "10.1145/2984511.2984525"
    },
    {
      "text": "Eugene M. Taranta II, Amirreza Samiei, Mehran Maghoumi, Pooya Khaloo, Corey R. Pittman, and Joseph J. LaViola Jr. 2017. Jackknife: A reliable recognizer with few samples and many modalities. In Proc. CHI '17.  ",
      "doi": "10.1145/3025453.3026002"
    },
    {
      "text": "Huawei Tu, Xiangshi Ren, and Shumin Zhai. 2012. A comparative evaluation of finger and pen stroke gestures. In Proc. CHI '12.  ",
      "doi": "10.1145/2207676.2208584"
    },
    {
      "text": "John W. Tukey. 1977. Exploratory data analysis. Addison-Wesley Publishing Co.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2012. Gestures as point clouds: a $P recognizer for user interface prototypes. In Proc. ICMI '12.  ",
      "doi": "10.1145/2388676.2388732"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2013. Relative accuracy measures for stroke gestures. In Proc. ICMI '13.  ",
      "doi": "10.1145/2522848.2522875"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2014. Gesture heatmaps: Understanding gesture performance with colorful visualizations. In Proc. ICMI '14.  ",
      "doi": "10.1145/2663204.2663256"
    },
    {
      "text": "Radu-Daniel Vatavu, Gabriel Cramariuc, and Doina Maria Schipor. 2015. Touch interaction for children aged 3 to 6 years: Experimental findings and relationship to motor skills. Int. J. Hum.-Comput. Stud. 74.  ",
      "doi": "10.1016/j.ijhcs.2014.10.007"
    },
    {
      "text": "Radu-Daniel Vatavu, Daniel Vogel, Géry Casiez, and Laurent Grisoni. 2011. Estimating the perceived difficulty of pen gestures. In Proc. INTERACT '11. ",
      "doi": "10.5555/2042118.2042130"
    },
    {
      "text": "Paolo Viviani and Tamar Flash. 1995. Minimum-jerk, two-thirds power law, and isochrony: converging approaches to movement planning. J. Exp. Psychol. 21(1).",
      "doi": ""
    },
    {
      "text": "Paolo Viviani and Carlo Terzuolo. 1982. Trajectory determines movement dynamics. Neuroscience 7(2).",
      "doi": ""
    },
    {
      "text": "Rand Wilcox. 2012. Modern Statistics for the Social and Behavioral Sciences. Taylor & Francis Group, LLC, Boca Raton, FL, USA.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Edward Cutrell, Susumu Harada, and I. Scott MacKenzie. 2008. An error model for pointing based on fitts' law. In Proc. CHI '08.  ",
      "doi": "10.1145/1357054.1357306"
    },
    {
      "text": "Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures without libraries, toolkits or training: A $1 recognizer for user interface prototypes. In Proc. UIST '07.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Shumi Zhai, Per Ola Kristensson, Caroline Appert, Tue H. Anderson, and Xiang Cao. 2012. Foundational issues in touch-surface stroke gesture design - an integrative review. In Foundations and Trends in Human-Computer Interaction. Vol. 5.  ",
      "doi": "10.1561/1100000012"
    }
  ]
}