{
  "doi": "10.1145/3173574.3174054",
  "title": "Passenger Trip Planning using Ride-Sharing Services",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Ride-sharing can potentially address transportation challenges such as traffic congestion and air pollution by letting drivers share their cars unused capacity with a number of passengers. However, even though multiple ride-sharing services exist and HCI research has investigated various aspects of their use, we still have limited knowledge on how passengers use ride-sharing services to plan their trips. In this paper, we study how passengers use existing services to support the activity of planning a trip. We report from a qualitative study where we participated in 5 rides and conducted interviews with 19 passengers about their use and opinions towards ride-sharing services. We found that planning a ride involves comparing individual preferences across a number of services which enabled participants to support finding a trip and handle challenges such as privacy and trust. Further, we discuss these findings and their implications for future HCI research in ride-sharing.",
  "tags": [
    "transportation",
    "ride-sharing",
    "passengers",
    "mobility"
  ],
  "authors": [
    {
      "name": "Michael K. Svangren",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196415",
      "orcid": "missing"
    },
    {
      "name": "Mikael B. Skov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723616",
      "orcid": "0000-0003-4488-5683"
    },
    {
      "name": "Jesper Kjeldskov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020677",
      "orcid": "0000-0001-7990-4229"
    }
  ],
  "references": [
    {
      "text": "Niels Agatz, Alan Erera, Martin Savelsbergh, and Xing Wang. 2012. Optimization for dynamic ride-sharing: A review. European Journal of Operational Research 223, 295--303.",
      "doi": ""
    },
    {
      "text": "BlaBlaCar. BlaBlaCar - Trusted carpooling. Retrieved September 12, 2017 from https://www.blablacar.com/",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Andrew Monk, and Jisoo Park. 2002. Technology biogarphies. In Proceedings of CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02), 658.",
      "doi": "10.1145/506443.506532"
    },
    {
      "text": "John M. Booher, Balakrishna Chennupati, Nina S. Onesti, and David P. Royer. 2007. Facebook ride connect. In Proceedings of CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07), 2043.  ",
      "doi": "10.1145/1240866.1240947"
    },
    {
      "text": "Rachel Botsman and Roo Rogers. 2010. What's mine is yours: How Collaborative Consumption is changing the way we live.",
      "doi": ""
    },
    {
      "text": "Margot Brereton, Paul Roe, Marcus Foth, Jonathan M. Bunker, and Laurie Buys. 2009. Designing participation in agile ridesharing with mobile social software. In proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group on Design: Open 24/7 (OZCHI '09), 257.  ",
      "doi": "10.1145/1738826.1738868"
    },
    {
      "text": "Vineeta Chaube, Andrea L. Kavanaugh, and Manuel A. Perez-Quinones. 2010. Leveraging Social Networks to Embed Trust in Rideshare Programs. In Proceedings of the 43rd Hawaii International Conference on System Sciences (HICSS '10), 1--8.  ",
      "doi": "10.1109/HICSS.2010.255"
    },
    {
      "text": "Blerim Cici, Athina Markopoulou, Enrique FriasMartinez, and Nikolaos Laoutaris. 2014. Assessing the potential of ride-sharing using mobile and social data. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14 Adjunct), 201--211.  ",
      "doi": "10.1145/2632048.2632055"
    },
    {
      "text": "Blerim Cici, Athina Markopoulou, and Nikolaos Laoutaris. 2016. SORS. In Proceedings of the 9th ACM SIGSPATIAL International Workshop on Computational Transportation Science (IWCTS '16), 13--18.  ",
      "doi": "10.1145/3003965.3003971"
    },
    {
      "text": "Brian Coltin. 2013. Towards Ridesharing with Passenger Transfers. In Proceedings of the 2013 international conference on Autonomous agents and multi-agent systems (AAMAS '13), 1299--1300. ",
      "doi": "10.5555/2484920.2485193"
    },
    {
      "text": "Lisa Créno and Béatrice Cahour. 2014. Chronicles of Lived Experiences for studying the process of trust building in carpooling. In Proceedings of the 2014 European Conference on Cognitive Ergonomics (ECCE '14), 1--8.  ",
      "doi": "10.1145/2637248.2637255"
    },
    {
      "text": "David Dearman and Jeffery S. Pierce. 2008. It's on my other computer! In Proceeding of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 767.",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt and Amelia R. Malone. 2015. The Promise of the Sharing Economy among Disadvantaged Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2285--2294.  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Tawanna R Dillahunt, Vaishnav Kameswaran, Linfeng Li, and Tanya Rosenblat. 2017. Uncovering the Values and Constraints of Real-time Ridesharing for Lowresource Populations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 2757--2769.  ",
      "doi": "10.1145/3025453.3025470"
    },
    {
      "text": "Masabumi Furuhata, Maged Dessouky, Fernando Ordóñez, Marc Etienne Brunet, Xiaoqing Wang, and Sven Koenig. 2013. Ridesharing: The state-of-the-art and future directions. Transportation Research Part B: Methodological 57: 28--46.",
      "doi": ""
    },
    {
      "text": "GoMore. GoMore. Retrieved September 17, 2017 from https://gomore.dk/",
      "doi": ""
    },
    {
      "text": "Lisa Gransky. 2014. The mesh - why the future of business is sharing. Portfolio Penguin. ",
      "doi": "10.5555/2331393"
    },
    {
      "text": "Volker Handke and Helga Jonuschat. 2012. Flexible Ridesharing: New Opportunities and Service Concepts for Sustainable Mobility. Springer Science&Business Media.",
      "doi": ""
    },
    {
      "text": "Heekyoung Jung, Erik Stolterman, Will Ryan, Tonya Thompson, and Marty Siegel. 2008. Toward a framework for ecologies of artifacts. In Proceedings of the 5th Nordic conference on Human-computer interaction building bridges - NordiCHI '08, 201.  ",
      "doi": "10.1145/1463160.1463182"
    },
    {
      "text": "H. J. Kaiser. 2009. Mobility in Old Age: Beyond the Transportation Perspective. Journal of Applied Gerontology 28, 4: 411--418.",
      "doi": ""
    },
    {
      "text": "Esther Keymolen. 2013. Trust and technology in collaborative consumption. Why it is not just about you and me. Bridging distances in technology and regulation: 135--150.",
      "doi": ""
    },
    {
      "text": "Steinar Kvale. 1996. InterViews: An introduction to qualitative research interviewing. Sage Publications: 129--140.",
      "doi": ""
    },
    {
      "text": "Airi Lampinen, Kai Huotari, and Coye Cheshire. 2015. Challenges to participation in the sharing economy: The Case of Local Online Peer-to-Peer Exchange in a Single Parents' Network. Interaction Design and Architecture(s) special issue on peer-to-peer exchange and the sharing economy 24, 1: 16--32.",
      "doi": ""
    },
    {
      "text": "Alan Lee and Martin Savelsbergh. 2015. Dynamic ridesharing: Is there a role for dedicated drivers? Transportation Research Part B: Methodological 81: 483--497.",
      "doi": ""
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around. In Proceedings of the 2011 annual conference on Human factors in computing systems (CHI '11), 1787.",
      "doi": ""
    },
    {
      "text": "Lyft. A ride whenever you need one. Retrieved September 12, 2017 from https://www.lyft.com/",
      "doi": ""
    },
    {
      "text": "Johanna Meurer, Dennis Lawo, Lukas Janßen, and Volker Wulf. 2016. Designing Mobility Eco-Feedback for Elderly Users. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 921--926.  ",
      "doi": "10.1145/2851581.2851599"
    },
    {
      "text": "Johanna Meurer, Martin Stein, David Randall, Markus Rohde, and Volker Wulf. 2014. Social dependency and mobile autonomy. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 1923--1932.  ",
      "doi": "10.1145/2556288.2557300"
    },
    {
      "text": "Johanna Meurer, Martin Stein, David Randall, Markus Rohde, and Volker Wulf. 2014. Social dependency and mobile autonomy. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 1923--1932.  ",
      "doi": "10.1145/2556288.2557300"
    },
    {
      "text": "Johanna Meurer, Martin Stein, and Volker Wulf. 2014. Designing Cooperation for Sustainable Mobility: Mobile Methods in Ridesharing Contexts. In Proceedings of the 11th International Conference on the Design of Cooperative Systems (COOP '14), 27--30 May 2014, Nice (France). Springer International Publishing, Cham, 345--359.",
      "doi": ""
    },
    {
      "text": "Microsoft inc. Skype. Retrieved September 15, 2017 from https://www.skype.com/da/",
      "doi": ""
    },
    {
      "text": "Joshua Morse, Joshua Palay, Yarun Luon, and Satyendra Nainwal. 2007. CarLoop. In Proceedings of CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07), 2073.",
      "doi": ""
    },
    {
      "text": "Will Odom, Scott Jensen, and Meng Li. 2007. Senior travel buddies. In Proceedings of CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07), 2079.",
      "doi": "10.1145/1240866.1240953"
    },
    {
      "text": "Sungkyu Park, Jaram Park, Suyeon Cho, and Jaeyeon Won. 2017. Approaches to Successful Entry of the Ride-sharing Service for Startups. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 1161--1169.  ",
      "doi": "10.1145/3027063.3053340"
    },
    {
      "text": "Kenneth Radke, Margot Brereton, Seyed Mirisaee, Sunil Ghelawat, Colin Boyd, and Juan Gonzalez Nieto. 2011. Tensions in Developing a Secure Collective Information Practice - The Case of Agile Ridesharing. In Interact'11. 524--532. ",
      "doi": "10.5555/2042118.2042168"
    },
    {
      "text": "Henrik Sørensen, Dimitrios Raptis, Jesper Kjeldskov, and Mikael Skov. 2014. The 4C Framework The 4C Framework: Principles of Interaction in Digital Ecosystems. 87--97.",
      "doi": ""
    },
    {
      "text": "Henrik Sørensen, Dimitrios Raptis, Jesper Kjeldskov, and Mikael B. Skov. 2014. The 4C framework. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14), 87--97.",
      "doi": ""
    },
    {
      "text": "Linda Steg. 2005. Car use: Lust and must. Instrumental, symbolic and affective motives for car use. Transportation Research Part A: Policy and Practice 39, 2--3 SPEC. ISS.: 147--162.",
      "doi": ""
    },
    {
      "text": "Martin Stein, Johanna Meurer, Alexander Boden, and Volker Wulf. 2017. Mobility in Later Life. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5716--5729.  ",
      "doi": "10.1145/3025453.3025672"
    },
    {
      "text": "Shahram Tahmasseby, Lina Kattan, and Brian Barbour. 2016. Propensity to participate in a peer-to-peer socialnetwork-based carpooling system. Journal of Advanced Transportation 50, 2: 240--254.",
      "doi": ""
    },
    {
      "text": "Iis P. Tussyadiah and Juho Pesonen. 2016. Drivers and barriers of peer-to-peer accommodation stay -- an exploratory study with American and Finnish travellers. Current Issues in Tourism: 1--18.",
      "doi": ""
    },
    {
      "text": "Uber. UberCommute. Retrieved September 12, 2017 from https://www.uber.com/info/commute/",
      "doi": ""
    },
    {
      "text": "Xin Xing, Tobias Warden, Tom Nicolai, and Otthein Herzog. 2009. SMIZE: A spontaneous ride-sharing system for individual urban transit. In Lecture Notes in Computer Science, 165--176. ",
      "doi": "10.5555/1791994.1792011"
    },
    {
      "text": "Huayu Xu, Fernando Ordóñez, and Maged Dessouky. 2015. A traffic assignment model for a ridesharing transportation market. Journal of Advanced Transportation 49, 7: 793--816.",
      "doi": ""
    },
    {
      "text": "Robert K (Robert Kuo-Zuir) Yin. 2014. Case study research: design and methods, 5th ed. Sage publications.",
      "doi": ""
    },
    {
      "text": "Desheng Zhang, Tian He, F A N Zhang, Mingming Lu, Yunhuai Liu, Haengju Lee, and Sang H Son. 2016. Carpooling Service for Large-Scale Taxicab Networks.  ",
      "doi": "10.1145/2897517"
    },
    {
      "text": "Friederike Ziegler and Tim Schwanen. 2011. \"I like to go out to be energised by different people\": an exploratory analysis of mobility and wellbeing in later life. Ageing and Society 31, 5: 758--781.",
      "doi": ""
    }
  ]
}