{
  "doi": "10.1145/3173574.3173768",
  "title": "A Matter of Control or Safety?: Examining Parental Use of Technical Monitoring Apps on Teens' Mobile Devices",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Adoption rates of parental control applications (\"apps\") for teens' mobile devices are low, but little is known about the characteristics of parents (or teens) who use these apps. We conducted a web-based survey of 215 parents and their teens (ages 13-17) using two separate logistic regression models (parent and teen) to examine the factors that predicted parental use of technical monitoring apps on their teens' mobile devices. Both parent and teen models confirmed that low autonomy granting (e.g., authoritarian) parents were the most likely to use parental control apps. The teen model revealed additional nuance, indicating that teens who were victimized online and had peer problems were more likely to be monitored by their parents. Overall, increased parental control was associated with more (not fewer) online risks. We discuss the implications of these findings and provide design recommendations for mobile apps that promote online safety through engaged, instead of restrictive, parenting.",
  "authors": [
    {
      "name": "Arup Kumar Ghosh",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659085636",
      "orcid": "missing"
    },
    {
      "name": "Karla Badillo-Urquiola",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/do/10.1145/contrib-99659059922/rel-imgonly/99659059922.jpg",
      "acmid": "99659059922",
      "orcid": "0000-0002-1165-3619"
    },
    {
      "name": "Mary Beth Rosson",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    },
    {
      "name": "Heng Xu",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414616940",
      "orcid": "missing"
    },
    {
      "name": "John M. Carroll",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    },
    {
      "name": "Pamela J. Wisniewski",
      "institution": "The University of Central Florida, Orlando, FL, USA",
      "img": "/do/10.1145/contrib-81498641142/rel-imgonly/wisniewski.jpg",
      "acmid": "81498641142",
      "orcid": "0000-0002-6223-1029"
    }
  ],
  "references": [
    {
      "text": "Monica Anderson. 2016. Parents, Teens and Digital Monitoring. Pew Research Center: Internet, Science & Tech. Retrieved July 12, 2016 from http://www.pewinternet.org/2016/01/07/parents-teens-and-digital-monitoring/",
      "doi": ""
    },
    {
      "text": "Zahra Ashktorab and Jessica Vitak. 2016. Designing Cyberbullying Mitigation and Prevention Solutions Through Participatory Design With Teenagers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 3895--3905.  ",
      "doi": "10.1145/2858036.2858548"
    },
    {
      "text": "Eric P. S. Baumer and Jed R. Brubaker. 2017. Post-userism. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6291--6303.  ",
      "doi": "10.1145/3025453.3025740"
    },
    {
      "text": "Diana Baumrind. 1987. A developmental perspective on adolescent risk taking in contemporary America. New directions for child development, 37: 93--125.",
      "doi": ""
    },
    {
      "text": "Diana Baumrind. 2005. Patterns of parental authority and adolescent autonomy. New Directions for Child and Adolescent Development 2005, 108: 61--69.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Emma Gardiner, and Sarita Schoenebeck. 2016. Managing Expectations: Technology Tensions Among Parents and Teens. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 1390--1401.  ",
      "doi": "10.1145/2818048.2819928"
    },
    {
      "text": "Julie Boesen, Jennifer A. Rode, and Clara Mancini. 2010. The Domestic Panopticon: Location Tracking in Families. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing, 65--74.  ",
      "doi": "10.1145/1864349.1864382"
    },
    {
      "text": "danah boyd. 2014. It's Complicated: The Social Lives of Networked Teens. Yale University Press, New Haven. ",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Gene H. Brody and Douglas L. Flor. 1998. Maternal Resources, Parenting Practices, and Child Competence in Rural, Single-Parent African American Families. Child Development 69, 3: 803--816.",
      "doi": ""
    },
    {
      "text": "A Calafat, F Garcia, M Juan, E Becoña, and JR Fernandez-Hermida. Which parenting style is more protective against adolescent substance use? Evidence within the European context. Retrieved September 14, 2017 from https://www.ncbi.nlm.nih.gov/pubmed/24679841",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor, Adam L. Durity, Abigail Marsh, and Blase Ur. 2014. Parents' and Teens' Perspectives on Privacy In a Technology-Filled World. In Proceedings of the Tenth Symposium On Usable Privacy and Security.",
      "doi": "10.5555/3235838.3235841"
    },
    {
      "text": "Alexei Czeskis, Ivayla Dermendjieva, Hussein Yapit, Alan Borning, Batya Friedman, Brian Gill, and Tadayoshi Kohno. 2010. Parenting from the pocket: value tensions and technical directions for secure and private parent-teen mobile safety. 1.",
      "doi": ""
    },
    {
      "text": "Melanie M. Domenech Rodríguez, Melissa R. Donovick, and Susan L. Crowley. 2009. Parenting Styles in a Cultural Context: Observations of \"Protective Parenting\" in First-Generation Latinos. Family Process 48, 2: 195--210.",
      "doi": ""
    },
    {
      "text": "Matthew S. Eastin, Bradley S. Greenberg, and Linda Hofschire. 2006. Parenting the Internet. Journal of Communication 56, 3: 486--504.",
      "doi": ""
    },
    {
      "text": "Lynne Edwards and April Kontostathis. 2012. Reclaiming Privacy: Reconnecting Victims of Cyberbullying and Cyberpredation. Retrieved from http://webpages.ursinus.edu/akontostathis/cscw2012Final.pdf",
      "doi": ""
    },
    {
      "text": "Lee B. Erickson, Pamela Wisniewski, Heng Xu, John M. Carroll, Mary Beth Rosson, and Daniel F. Perkins. 2016. The Boundaries Between: Parental Involvement in a Teen's Online World. J. Assoc. Inf. Sci. Technol. 67, 6: 1384--1403.  ",
      "doi": "10.1002/asi.23450"
    },
    {
      "text": "Jieqiong Fan and Li-fang Zhang. 2014. The role of perceived parenting styles in thinking styles. Learning and Individual Differences 32, Supplement C: 204--211.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter H. Kahn Jr, Alan Borning, and Alina Huldtgren. 2013. Value Sensitive Design and Information Systems. In Early engagement and new technologies: Opening up the laboratory, Neelke Doorn, Daan Schuurbiers, Ibo van de Poel and Michael E. Gorman (eds.). Springer Netherlands, 55--95. Retrieved May 22, 2016 from http://link.springer.com/chapter/10.1007/978--94-007--7844--3_4",
      "doi": ""
    },
    {
      "text": "D. Gefen, E. Rigdon, and W. D. Straub. 2011. An Update and Extension to SEM Guidelines for Administrative and Social Science Research. MIS Quarterly 35, 2: iii--xiv. ",
      "doi": "10.5555/2017507.2017508"
    },
    {
      "text": "Douglas A. Gentile, Amy I. Nathanson, Eric E. Rasmussen, Rachel A. Reimer, and David A. Walsh. 2012. Do You See What I See? Parent and Child Reports of Parental Monitoring of Media. Family Relations 61, 3: 470--487.",
      "doi": ""
    },
    {
      "text": "Douglas A. Gentile, Rachel A. Reimer, Amy I. Nathanson, David A. Walsh, and Joey C. Eisenmann. 2014. Protective effects of parental monitoring of children's media use: a prospective study. JAMA pediatrics 168, 5: 479--484.",
      "doi": ""
    },
    {
      "text": "R. Goodman, H. Meltzer, and V. Bailey. 1998. The strengths and difficulties questionnaire: A pilot study on the validity of the self-report version. European Child & Adolescent Psychiatry 7, 3: 125--130.",
      "doi": ""
    },
    {
      "text": "Robert Goodman. 1997. The Strengths and Difficulties Questionnaire: A Research Note. Journal of Child Psychology and Psychiatry 38, 5: 581--586.",
      "doi": ""
    },
    {
      "text": "Sandra Burri Gram-Hansen. 2009. Towards an Approach to Ethics and HCI Development Based on Løgstrup's Ideas. In Human-Computer Interaction -- INTERACT 2009 (Lecture Notes in Computer Science), 200--203.",
      "doi": ""
    },
    {
      "text": "Leilani Greening, Laura Stoppelbein, and Aaron Luebbe. 2010. The Moderating Effects of Parenting Styles on African-American and Caucasian Children's Suicidal Behaviors. Journal of Youth and Adolescence 39, 4: 357--369.",
      "doi": ""
    },
    {
      "text": "Marjorie Lindner Gunnoe, E. Mavis Hetherington, and David Reiss. 1999. Parental Religiosity, Parenting Style, and Adolescent Social Responsibility. The Journal of Early Adolescence 19, 2: 199--225.",
      "doi": ""
    },
    {
      "text": "Heidi Hartikainen, Netta Iivari, and Marianne Kinnula. 2016. Should We Design for Control, Trust or Involvement: A Discourses Survey About Children's Online Safety. In Proceedings of the The 15th International Conference on Interaction Design and Children (IDC '16), 367--378.  ",
      "doi": "10.1145/2930674.2930680"
    },
    {
      "text": "Yasmeen Hashish, Andrea Bunt, and James E. Young. 2014. Involving Children in Content Control: A Collaborative and Education-oriented Content Filtering Approach. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14), 1797--1806.  ",
      "doi": "10.1145/2556288.2557128"
    },
    {
      "text": "Karin Helweg-Larsen, Nina Schütt, and Helmer B Larsen. 2012. Predictors and protective factors for adolescent Internet victimization: results from a 2008 nationwide Danish youth survey. Acta Paediatrica 101, 5: 533--539.",
      "doi": ""
    },
    {
      "text": "Katherine M. Hertlein and Katrina Ancheta. 2014. Advantages and Disadvantages of Technology in Relationships: Findings from an Open-Ended Survey. The Qualitative Report; Fort Lauderdale 19, 11: 1--11.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sarita Y. Schoenebeck, and Julie A. Kientz. 2016. Not at the Dinner Table: Parents' and Children's Perspectives on Family Technology Rules. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 1376--1389.  ",
      "doi": "10.1145/2818048.2819940"
    },
    {
      "text": "Cara J. Kiff, Liliana J. Lengua, and Nicole R. Bush. 2011. Temperament variation in sensitivity to parenting: predicting changes in depression and anxiety. Journal of Abnormal Child Psychology 39, 8: 1199--1212.",
      "doi": ""
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Subin Yang, Joonwon Lee, and Uichin Lee. 2015. FamiLync: Facilitating Participatory Parental Mediation of Adolescents' Smartphone Use. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 867--878.  ",
      "doi": "10.1145/2750858.2804283"
    },
    {
      "text": "Susie D. Lamborn, Nina S. Mounts, Laurence Steinberg, and Sanford M. Dornbusch. 1991. Patterns of Competence and Adjustment among Adolescents from Authoritative, Authoritarian, Indulgent, and Neglectful Families. Child Development 62, 5: 1049--1065.",
      "doi": ""
    },
    {
      "text": "Sook-Jung Lee. 2013. Parental restrictive mediation of children's internet use: Effective for what and for whom? New Media & Society 15, 4: 466--481.",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart. 2015. Teens, Social Media & Technology Overview 2015. Pew Research Center: Internet, Science & Tech. Retrieved July 13, 2016 from http://www.pewinternet.org/2015/04/09/teens-social-media-technology-2015/",
      "doi": ""
    },
    {
      "text": "Thomas C. Leonard. 2008. Richard H. Thaler, Cass R. Sunstein, Nudge: Improving decisions about health, wealth, and happiness. Constitutional Political Economy 19, 4: 356--360.",
      "doi": ""
    },
    {
      "text": "Louis Leung and Paul S.N. Lee. 2012. The influences of information literacy, internet addiction and parenting styles on internet risks. New Media & Society 14, 1: 117--136.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Leslie Haddon, Anke Görzig, and Kjartan Ólafsson. 2011. Risks and safety on the internet: the perspective of European children: full findings and policy implications from the EU Kids Online survey of 9--16 year olds and their parents in 25 countries. Retrieved June 11, 2017 from http://www.eukidsonline.net/",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone and Peter K. Smith. 2014. Annual Research Review: Harms experienced by child users of online and mobile technologies: the nature, prevalence and management of sexual and aggressive risks in the digital age. Journal of Child Psychology and Psychiatry 55, 6: 635--654.",
      "doi": ""
    },
    {
      "text": "Adam W. Meade and S. Bartholomew Craig. 2012. Identifying careless responses in survey data. Psychological Methods 17, 3: 437--455.",
      "doi": ""
    },
    {
      "text": "Kimberly J. Mitchell, David Finkelhor, and Janis Wolak. 2005. Protecting youth online: Family use of filtering and blocking software. Child Abuse & Neglect 29, 7: 753--765.",
      "doi": ""
    },
    {
      "text": "Kimberly Mitchell, Lisa Jones, David Finkelhor, and Janis Wolak. 2014. Trends in Unwanted Online Experiences and Sexting: Final Report. Crimes Against Children Research Center. Retrieved from http://scholars.unh.edu/ccrc/49",
      "doi": ""
    },
    {
      "text": "Carol Moser, Tianying Chen, and Sarita Y. Schoenebeck. 2017. Parents' And Children's Preferences About Parents Sharing About Children on Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5221--5225.  ",
      "doi": "10.1145/3025453.3025587"
    },
    {
      "text": "Michiko Nakayama. 2011. Parenting style and parental monitoring with information communication technology: A study on Japanese junior high school students and their parents. Computers in Human Behavior 27, 5: 1800--1805.  ",
      "doi": ""
    },
    {
      "text": "Marije Nouwen, Maarten Van Mechelen, and Bieke Zaman. 2015. A Value Sensitive Design Approach to Parental Software for Young Children. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15), 363--366.  ",
      "doi": "10.1145/2771839.2771917"
    },
    {
      "text": "Martin Pinquart. 2017. Associations of parenting dimensions and styles with externalizing problems of children and adolescents: An updated meta-analysis. Developmental Psychology 53, 5: 873--932.",
      "doi": ""
    },
    {
      "text": "Robert D. Putnam. 1995. Bowling Alone: America's Declining Social Capital. Journal of Democracy 6, 1: 65--78.",
      "doi": ""
    },
    {
      "text": "E. Reitz, M. Deković, and A. M. Meijer. 2006. Relations between parenting and externalizing and internalizing problem behaviour in early adolescence: Child behaviour as moderator and predictor. Journal of Adolescence 29, 3: 419--436.",
      "doi": ""
    },
    {
      "text": "Eric Rice, Hailey Winetrobe, Ian W. Holloway, Jorge Montoya, Aaron Plant, and Timothy Kordic. 2015. Cell Phone Internet Access, Online Sexual Solicitation, Partner Seeking, and Sexual Risk Behavior among Adolescents. Archives of sexual behavior 44, 3: 755--763.",
      "doi": ""
    },
    {
      "text": "Christian M. Ringle, Sven Wende, and Jan-Michael Becker. 2015. SmartPLS 3. Bönningstedt: SmartPLS. Retrieved from http://www.smartpls.com",
      "doi": ""
    },
    {
      "text": "James A. Roberts and Meredith E. David. 2016. My life has become a major distraction from my cell phone: Partner phubbing and relationship satisfaction among romantic partners. Computers in Human Behavior 54, Supplement C: 134--141.  ",
      "doi": "10.1016/j.chb.2015.07.058"
    },
    {
      "text": "Jennifer A. Rode. 2009. Digital Parenting: Designing Children's Safety. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCS-HCI '09), 244--251. ",
      "doi": "10.5555/1671011.1671041"
    },
    {
      "text": "J. Reynaldo A. Santos. 1999. Cronbach's Alpha: A Tool for Assessing the Reliability of Scales. Journal of Extension 37, 2. Retrieved from https://www.joe.org/joe/1999april/tt3.php",
      "doi": ""
    },
    {
      "text": "Sue Shellenbarger. 2016. What Teens Need Most From Their Parents. Retrieved June 16, 2017 from http://www.wsj.com/articles/what-teens-need-most-from-their-parents-1470765906",
      "doi": ""
    },
    {
      "text": "Wonsun Shin and Nurzali Ismail. 2014. Exploring the role of parents and peers in young adolescents' risk taking on social networking sites. Cyberpsychology, Behavior and Social Networking 17, 9: 578--583.",
      "doi": ""
    },
    {
      "text": "Paul R. Smokowski, Martica L. Bacallao, Katie L. Cotter, and Caroline B. R. Evans. 2015. The effects of positive and negative parenting practices on adolescent mental health outcomes in a multicultural sample of rural youth. Child Psychiatry & Human Development 46, 3: 333--345.",
      "doi": ""
    },
    {
      "text": "Andre Sourander, Anat Brunstein Klomek, Maria Ikonen, Jarna Lindroos, Terhi Luntamo, Merja Koskelainen, Terja Ristkari, and Hans Helenius. 2010. Psychosocial risk factors associated with cyberbullying among adolescents: a population-based study. Archives of General Psychiatry 67, 7: 720--728.",
      "doi": ""
    },
    {
      "text": "Laurence Steinberg, Susie D. Lamborn, Sanford M. Dornbusch, and Nancy Darling. 1992. Impact of Parenting Practices on Adolescent Achievement: Authoritative Parenting, School Involvement, and Encouragement to Succeed. Child Development 63, 5: 1266--1281.",
      "doi": "10.1111/j.1467-8624.1992.tb01694.x"
    },
    {
      "text": "Chang Su and Michaela Hynie. 2011. Effects of Life Stress, Social Support, and Cultural Norms on Parenting Styles Among Mainland Chinese, European Canadian, and Chinese Canadian Immigrant Mothers. Journal of Cross-Cultural Psychology 42, 6: 944--962.",
      "doi": ""
    },
    {
      "text": "Joseph Sullivan, and Joseph W. Sullivan, Sherman W. Tyler (editors, Paul Luff, Rank Xerox, and Cambridge Europarc. 1994. Intelligent User Interfaces.",
      "doi": ""
    },
    {
      "text": "Masayo Uji, Ayuko Sakamoto, Keiichiro Adachi, and Toshinori Kitamura. 2014. The Impact of Authoritative, Authoritarian, and Permissive Parenting Styles on Children's Later Mental Health in Japan: Focusing on Parent and Child Gender. Journal of Child and Family Studies 23, 2: 293--302.",
      "doi": ""
    },
    {
      "text": "M. Valcke, S. Bonte, B. De Wever, and I. Rots. 2010. Internet Parenting Styles and the Impact on Internet Use of Primary School Children. Comput. Educ. 55, 2: 454--464.  ",
      "doi": "10.1016/j.compedu.2010.02.009"
    },
    {
      "text": "J. Mitchell Vaterlaus, Troy E. Beckert, Sarah Tulane, and Clare V. Bird. 2014. \"They Always Ask What I'm Doing and Who I'm Talking to\": Parental Mediation of Adolescent Interactive Technology Use. Marriage & Family Review 50, 8: 691--713.",
      "doi": ""
    },
    {
      "text": "Rong Wang, Suzanne M. Bianchi, and Sara B. Raley. 2005. Teenagers' Internet Use and Family Rules: A Research Note. Journal of Marriage and Family 67, 5: 1249--1258.",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Arup Kumar Ghosh, Mary Beth Rosson, Heng Xu, and John M. Carroll. 2017. Parental Control vs. Teen Self-Regulation: Is there a middle ground for mobile online safety? In Proceedings of the 20th ACM Conference on Computer Supported Cooperative Work & Social Computing.  ",
      "doi": "10.1145/2998181.2998352"
    },
    {
      "text": "Pamela Wisniewski, Haiyan Jia, Na Wang, Saijing Zheng, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. Resilience Mitigates the Negative Effects of Adolescent Internet Addiction and Online Risk Exposure. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 4029--4038.  ",
      "doi": "10.1145/2702123.2702240"
    },
    {
      "text": "Pamela Wisniewski, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2017. Parents Just Don't Understand: Why Teens Don't Talk to Parents About Their Online Risk Experiences. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 523--540.  ",
      "doi": "10.1145/2998181.2998236"
    },
    {
      "text": "Pamela Wisniewski, Heng Xu, Mary Beth Rosson, Daniel F. Perkins, and John M. Carroll. 2016. Dear Diary: Teens Reflect on Their Weekly Online Risk Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 3919--3930.  ",
      "doi": "10.1145/2858036.2858317"
    },
    {
      "text": "Sarita Yardi and Amy Bruckman. 2011. Social and Technical Challenges in Parenting Teens' Social Media Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3237--3246.  ",
      "doi": "10.1145/1978942.1979422"
    },
    {
      "text": "Sarita Yardi and Amy Bruckman. 2012. Income, Race, and Class: Exploring Socioeconomic Differences in Family Technology Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 3041--3050.  ",
      "doi": "10.1145/2207676.2208716"
    },
    {
      "text": "Michele L. Ybarra, David Finkelhor, Kimberly J. Mitchell, and Janis Wolak. 2009. Associations between blocking, monitoring, and filtering software on the home computer and youth-reported unwanted exposure to sexual material online. Child Abuse & Neglect 33, 12: 857--869.",
      "doi": ""
    },
    {
      "text": "Bieke Zaman and Marije Nouwen. 2016. Parental controls: advice for parents, researchersand industry. Retrieved January 1, 2018 from http://www.lse.ac.uk/media@lse/research/EUKidsOnline/Home.aspx",
      "doi": ""
    },
    {
      "text": "2017. Qualtrics. Wikipedia. Retrieved April 27, 2017 from https://en.wikipedia.org/w/index.php?title=Qualtrics&oldid=775298833",
      "doi": ""
    },
    {
      "text": "IBM SPSS Statistics 24 Documentation - United States. Retrieved June 19, 2017 from http://www-01.ibm.com/support/docview.wss?uid=swg27047033",
      "doi": ""
    },
    {
      "text": "Nunnally, J. (1978). Psychometric Theory (2nd ed.). New York: McGraw-Hill. - References - Scientific Research Publish. Retrieved June 17, 2017 from http://www.scirp.org/(S(351jmbntvnsjt1aadkposzje))/reference/ReferencesPapers.aspx?ReferenceID=1408496",
      "doi": ""
    },
    {
      "text": "Tabachnick & Fidell, Using Multivariate Statistics, 6th Edition. Retrieved July 3, 2017 from https://www.pearson.com/us/higher-education/program/Tabachnick-Using-Multivariate-Statistics-6th-Edition/PGM332849.html",
      "doi": ""
    }
  ]
}