{
  "doi": "10.1145/3173574.3174029",
  "title": "Doppio: Tracking UI Flows and Code Changes for App Development",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Developing interactive systems often involves a large set of callback functions for handling user interaction, which makes it challenging to manage UI behaviors, create descriptive documentation, and track code revisions. We developed Doppio, a tool that automatically tracks and visualizes UI flows and their changes based on source code. For each input event listener of a widget, e.g., onClick of an Android View class, Doppio captures and associates its UI output from a program execution with its code snippet from the codebase. It automatically generates a screenflow diagram organized by the callback methods and interaction flow, where developers can review the code and UI revisions interactively. Doppio, as an IDE plugin, is seamlessly integrated into a common development workflow. Our studies show that our tool is able to generate quality visual documentation and helped participants understand unfamiliar source code and track changes.",
  "authors": [
    {
      "name": "Pei-Yu (Peggy) Chi",
      "institution": "Google Inc., Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81440599192/rel-imgonly/peggychi_se2.jpg",
      "acmid": "81440599192",
      "orcid": "0000-0001-8511-2834"
    },
    {
      "name": "Sen-Po Hu",
      "institution": "Google Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261784",
      "orcid": "missing"
    },
    {
      "name": "Yang Li",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    }
  ],
  "references": [
    {
      "text": "Dimitar Asenov, Otmar Hilliges, and Peter Müller. 2016. The Effect of Richer Visualizations on Code Comprehension. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5040--5045.  ",
      "doi": "10.1145/2858036.2858372"
    },
    {
      "text": "Tanzirul Azim, Oriana Riva, and Suman Nath. 2016. uLink: Enabling User-Defined Deep Linking to App Content. In Proceedings of the 14th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '16). ACM, New York, NY, USA, 305--318.  ",
      "doi": "10.1145/2906388.2906416"
    },
    {
      "text": "Brian Burg, Richard Bailey, Andrew J. Ko, and Michael D. Ernst. 201 Interactive record/replay for web application debugging. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 473--484.  ",
      "doi": "10.1145/2501988.2502050"
    },
    {
      "text": "Brian Burg, Andrew J. Ko, and Michael D. Ernst. 2015. Explaining Visual Changes in Web Interfaces. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 259--268.  ",
      "doi": "10.1145/2807442.2807473"
    },
    {
      "text": "Raymond P.L. Buse and Westley R. Weimer. 2010. Automatically documenting program changes. In Proceedings of the IEEE/ACM international conference on Automated software engineering (ASE '10). ACM, New York, NY, USA, 33--42.  ",
      "doi": "10.1145/1858996.1859005"
    },
    {
      "text": "Kerry Shih-Ping Chang and Brad A Myers. 2012. WebCrystal: understanding and reusing examples in web authoring. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3205--3214.  ",
      "doi": "10.1145/2207676.2208740"
    },
    {
      "text": "Hsiang-Ting Chen, Tovi Grossman, Li-Yi Wei, Ryan M. Schmidt, Björn Hartmann, George Fitzmaurice, and Maneesh Agrawala. 2014. History assisted view authoring for 3D models. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2027--2036.  ",
      "doi": "10.1145/2556288.2557009"
    },
    {
      "text": "Yan Chen, Sang Won Lee, Yin Xie, YiWei Yang, Walter S. Lasecki, and Steve Oney. 2017. Codeon: On-Demand Software Development Assistance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6220--6231.  ",
      "doi": "10.1145/3025453.3025972"
    },
    {
      "text": "Pei-Yu (Peggy) Chi, Sally Ahn, Amanda Ren, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2012. MixT: automatic generation of step-by-step mixed media tutorials. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Pei-Yu (Peggy) Chi, Yang Li, and Björn Hartmann. 2016. Enhancing Cross-Device Interaction Scripting with Interactive Illustrations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5482--5493.  ",
      "doi": "10.1145/2858036.2858382"
    },
    {
      "text": "1Shigeru Chiba. 2000. Load-Time Structural Reflection in Java. In ECOOP 2000: Object-Oriented Programming. Springer. ",
      "doi": "10.5555/646157.679856"
    },
    {
      "text": "Shigeru Chiba and Muga Nishizawa. 2003. An Easy-to-Use Toolkit for Efficient Java Bytecode Translators. In GPCE 2003: Generative Programming and Component Engineering. Springer. ",
      "doi": "10.5555/954186.954208"
    },
    {
      "text": "Biplab Deka, Zifeng Huang, and Ranjitha Kumar. 2016. ERICA: Interaction Mining Mobile Apps. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 767--776.  ",
      "doi": "10.1145/2984511.2984581"
    },
    {
      "text": "Biplab Deka, Zifeng Huang, Chad Franzen, Joshua Hibschman, Daniel Afergan, Yang Li, Jeffrey Nichols and Ranjitha Kumar. 2017. Rico: A Mobile App Dataset for Building Data-Driven Design Applications. In Proceedings of the 30th Annual Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3126594.3126651"
    },
    {
      "text": "Stephan Diehl. 2007. Software Visualization: Visualizing the Structure, Behaviour, and Evolution of Software. Springer-Verlag New York, Inc., Secaucus, NJ, USA. ",
      "doi": "10.5555/1209814"
    },
    {
      "text": "Morgan Dixon and James Fogarty. 2010. Prefab: implementing advanced behaviors using pixel-based reverse engineering of interface structure. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1525--1534.  ",
      "doi": "10.1145/1753326.1753554"
    },
    {
      "text": "Ethan Fast, Daniel Steffee, Lucy Wang, Joel R. Brandt, and Michael S. Bernstein. 2014. Emergent, crowd-scale programming practice in the IDE. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2491--2500.  ",
      "doi": "10.1145/2556288.2556998"
    },
    {
      "text": "Shiry Ginosar, Luis Fernando De Pombo, Maneesh Agrawala, and Bjorn Hartmann. 2013. Authoring multi-stage code examples with editable code histories. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 485--494.  ",
      "doi": "10.1145/2501988.2502053"
    },
    {
      "text": "Google Inc. Android Studio. https://developer.android.com/studio/ (accessed: 09/01/2017).",
      "doi": ""
    },
    {
      "text": "Google Inc. Google Samples. https://github.com/googlesamples/ (accessed: 09/01/2017).",
      "doi": ""
    },
    {
      "text": "2Google Inc. Testing UI for a Single App. https://developer.android.com/training/testing/ui-testing/espresso-testing.html (accessed: 09/01/2017).",
      "doi": ""
    },
    {
      "text": "2Google Inc. Topeka for Android. https://github.com/googlesamples/android-topeka/tree/java (accessed: 09/01/2017).",
      "doi": ""
    },
    {
      "text": "Google Inc. Material Design. https://material.io/ (accessed: 09/01/2017).",
      "doi": ""
    },
    {
      "text": "Floraine Grabler, Maneesh Agrawala, Wilmot Li, Mira Dontcheva, and Takeo Igarashi. 2009. Generating photo manipulation tutorials by demonstration. ACM Trans. Graph. 28, 3, Article 66 (July 2009), 9 pages.  ",
      "doi": "10.1145/1531326.1531372"
    },
    {
      "text": "Tovi Grossman and George Fitzmaurice. 2010. ToolClips: an investigation of contextual video assistance for functionality understanding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1515--1524.  ",
      "doi": "10.1145/1753326.1753552"
    },
    {
      "text": "Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2010. Chronicle: capture, exploration, and playback of document workflow histories. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, New York, NY, USA, 143--152.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Yiyang Hao, Ge Li, Lili Mou, Lu Zhang, and Zhi Jin. 2013. MCT: a tool for commenting programs by multimedia comments. In Proceedings of the 2013 International Conference on Software Engineering (ICSE '13). IEEE Press, Piscataway, NJ, USA, 1339--1342. ",
      "doi": "10.5555/2486788.2487000"
    },
    {
      "text": "Dorsaf Haouari, Houari Sahraoui, and Philippe Langlais. 2011. How Good is Your Comment? A Study of Comments in Java Programs. 2011 International Symposium on Empirical Software Engineering and Measurement, Banff, AB, Canada, 137--146.  ",
      "doi": "10.1109/ESEM.2011.22"
    },
    {
      "text": "Björn Hartmann, Loren Yu, Abel Allison, Yeonsoo Yang, and Scott R. Klemmer. 2008. Design as exploration: creating interface alternatives through parallel authoring and runtime tuning. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08). ACM, New York, NY, USA, 91--100.  ",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "Björn Hartmann, Sean Follmer, Antonio Ricciardi, Timothy Cardenas, and Scott R. Klemmer. 2010. d.note: revising user interfaces through change tracking, annotations, and alternatives. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 493--502.  ",
      "doi": "10.1145/1753326.1753400"
    },
    {
      "text": "3Joshua Hibschman and Haoqi Zhang. 2015. Unravel: Rapid Web Application Reverse Engineering via Interaction Recording, Source Tracing, and Library Detection. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 270--279.  ",
      "doi": "10.1145/2807442.2807468"
    },
    {
      "text": "3Joshua Hibschman and Haoqi Zhang. 2016. Telescope: Fine-Tuned Discovery of Interactive Web UI Feature Implementation. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 233--245.  ",
      "doi": "10.1145/2984511.2984570"
    },
    {
      "text": "3JetBrains. Program Structure Interface. IntelliJ Platform SDK DevGuide. http://www.jetbrains.org/intellij/sdk/docs/basics/architectural_overview/psi_files.html (accessed: 03/10/2017).",
      "doi": ""
    },
    {
      "text": "Hyeonsu Kang and Philip J. Guo. 2017. Omnicode: A Novice-Oriented Live Programming Environment with Always-On Run-Time Value Visualizations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 737--745.  ",
      "doi": "10.1145/3126594.3126632"
    },
    {
      "text": "Thorsten Karrer, Jan-Peter Krämer, Jonathan Diehl, Björn Hartmann, and Jan Borchers. 2011. Stacksplorer: call graph navigation helps increasing code maintenance efficiency. In Proc. UIST '11, 217--224.  ",
      "doi": "10.1145/2047196.2047225"
    },
    {
      "text": "Jun Kato, Sean McDirmid, and Xiang Cao. 2012. DejaVu: integrated support for developing interactive camera-based programs. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA, 189--196.  ",
      "doi": "10.1145/2380116.2380142"
    },
    {
      "text": "3Jun Kato, Daisuke Sakamoto, and Takeo Igarashi. 2013. Picode: inline photos representing posture data in source code. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3097--3100.  ",
      "doi": "10.1145/2470654.2466422"
    },
    {
      "text": "3Andrew J. Ko and Brad A. Myers. 2004. Designing the whyline: a debugging interface for asking questions about program behavior. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 151--158.  ",
      "doi": "10.1145/985692.985712"
    },
    {
      "text": "3Douglas Kramer. 1999. API documentation from source code comments: a case study of Javadoc. In Proceedings of the 17th annual international conference on Computer documentation (SIGDOC '99). ACM, New York, NY, USA, 147--153.  ",
      "doi": "10.1145/318372.318577"
    },
    {
      "text": "Jan-Peter Krämer, Joel Brandt, and Jan Borchers. 2016. Using Runtime Traces to Improve Documentation and Unit Test Authoring for Dynamic Languages. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3232--3237.  ",
      "doi": "10.1145/2858036.2858311"
    },
    {
      "text": "4Sandeep K. Kuttal, Anita Sarma, and Gregg Rothermel. 2014. On the benefits of providing versioning support for end users: An empirical study. ACM Trans. Comput.-Hum. Interact. 21, 2, Article 9 (February 2014), 43 pages.  ",
      "doi": "10.1145/2560016"
    },
    {
      "text": "4Timothy C. Lethbridge, Janice Singer, and Andrew Forward. 2003. How Software Engineers Use Documentation: The State of the Practice. IEEE Softw. 20, 6 (November 2003), 35--39.  ",
      "doi": "10.1109/MS.2003.1241364"
    },
    {
      "text": "4Tom Lieber, Joel R. Brandt, and Rob C. Miller. 2014. Addressing misconceptions about code with always-on programming visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2481--2490.  ",
      "doi": "10.1145/2556288.2557409"
    },
    {
      "text": "4Henry Lieberman. 1993. Mondrian: a teachable graphical editor. In Watch what I do, Allen Cypher, Daniel C. Halbert, David Kurlander, Henry Lieberman, David Maulsby, Brad A. Myers, and Alan Turransky (Eds.). MIT Press, Cambridge, MA, USA 341--358. ",
      "doi": "10.5555/168080.168126"
    },
    {
      "text": "4Mario Linares-Vásquez, Luis Fernando Cortés-Coy, Jairo Aponte, and Denys Poshyvanyk. 2015. ChangeScribe: a tool for automatically generating commit messages. In Proceedings of the 37th International Conference on Software Engineering - Volume 2 (ICSE '15), Vol. 2. IEEE Press, Piscataway, NJ, USA, 709--712. ",
      "doi": "10.5555/2819009.2819144"
    },
    {
      "text": "4Dastyni Loksa, Andrew J. Ko, Will Jernigan, Alannah Oleson, Christopher J. Mendez, and Margaret M. Burnett. 2016. Programming, Problem Solving, and Self-Awareness: Effects of Explicit Guidance. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1449--1461.  ",
      "doi": "10.1145/2858036.2858252"
    },
    {
      "text": "4Josip Maras, Jan Carlson, and Ivica Crnkovi. 2012. Extracting client-side web application code. In Proceedings of the 21st international conference on World Wide Web. ACM, 819--828.  ",
      "doi": "10.1145/2187836.2187947"
    },
    {
      "text": "4Richard E Mayer, William Bove, Alexandra Bryman, Rebecca Mars, and Lene Tapangco. \"When less is more: Meaningful learning from visual and verbal summaries of science textbook lessons.\" In: Journal of educational psychology 88.1 (1996), p. 64.",
      "doi": ""
    },
    {
      "text": "4Paul W. McBurney and Collin McMillan. 2014. Automatic documentation generation via source code summarization of method context. In Proceedings of the 22nd International Conference on Program Comprehension (ICPC 2014). ACM, New York, NY, USA, 279--290.  ",
      "doi": "10.1145/2597008.2597149"
    },
    {
      "text": "Hiroaki Mikami, Daisuke Sakamoto, and Takeo Igarashi. 2017. Micro-Versioning Tool to Support Experimentation in Exploratory Programming. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6208--6219.  ",
      "doi": "10.1145/3025453.3025597"
    },
    {
      "text": "5Brad Myers, Scott E. Hudson, and Randy Pausch. 2000. Past, present, and future of user interface software tools. ACM Trans. Comput.-Hum. Interact. 7, 1, 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "5Stas Negara, Mihai Codoban, Danny Dig, and Ralph E. Johnson. 2014. Mining fine-grained code changes to detect unknown change patterns. In Proceedings of the 36th International Conference on Software Engineering (ICSE 2014). ACM, New York, NY, USA, 803--813.  ",
      "doi": "10.1145/2568225.2568317"
    },
    {
      "text": "5Stephen Oney and Brad Myers. 2009. FireCrystal: Understanding interactive behaviors in dynamic web pages. In Visual Languages and Human-Centric Computing, 2009. VL/HCC 2009. IEEE Symposium on. IEEE, 105--108.  ",
      "doi": "10.1109/VLHCC.2009.5295287"
    },
    {
      "text": "5Stephen Oney and Joel Brandt. 2012. Codelets: linking interactive documentation and example code in the editor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2697--2706.  ",
      "doi": "10.1145/2207676.2208664"
    },
    {
      "text": "5Oracle. Javadoc Tool. http://www.oracle.com/technetwork/articles/java/index-jsp-135444.html (accessed: 3/10/ 2017).",
      "doi": ""
    },
    {
      "text": "5Zhengrui Qin, Yutao Tang, Ed Novak, and Qun Li. 2016. MobiPlay: a remote execution based record-and-replay tool for mobile applications. In Proceedings of the 38th International Conference on Software Engineering (ICSE '16). ACM, New York, NY, USA, 571--582.  ",
      "doi": "10.1145/2884781.2884854"
    },
    {
      "text": "5Xin Rong, Shiyan Yan, Stephen Oney, Mira Dontcheva, and Eytan Adar. 2016. CodeMend: Assisting Interactive Programming with Bimodal Embedding. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 247--258.  ",
      "doi": "10.1145/2984511.2984544"
    },
    {
      "text": "5Giriprasad Sridhara, Emily Hill, Divya Muppaneni, Lori Pollock, and K. Vijay-Shanker. 2010. Towards automatically generating summary comments for Java methods. In Proceedings of the IEEE/ACM international conference on Automated software engineering (ASE '10). ACM, New York, NY, USA, 43--52.  ",
      "doi": "10.1145/1858996.1859006"
    },
    {
      "text": "5Moritz Wittenhagen, Christian Cherek, and Jan Borchers. 2016. Chronicler: Interactive Exploration of Source Code History. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3522--3532.  ",
      "doi": "10.1145/2858036.2858442"
    },
    {
      "text": "Tom Yeh, Tsung-Hsiang Chang, and Robert C. Miller. 2009. Sikuli: using GUI screenshots for search and automation. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09). ACM, New York, NY, USA, 183--192.  ",
      "doi": "10.1145/1622176.1622213"
    },
    {
      "text": "6YoungSeok Yoon, Brad A. Myers, and Sebon Koo. 2013. Visualization of fine-grained code change history. 2013 IEEE Symposium on Visual Languages and Human Centric Computing, San Jose, CA, USA, 119--126.",
      "doi": ""
    }
  ]
}