{
  "doi": "10.1145/3173574.3173814",
  "title": "Entrepreneurship and the Socio-Technical Chasm in a Lean Economy",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Online technologies are increasingly hailed as enablers of entrepreneurship and income generation. Recent evidence suggests, however, that even the best such tools disproportionately favor those with pre-existing entrepreneurial advantages. Despite intentions, the technology on its own seems far from addressing socio-economic inequalities. Using participatory action research, we investigated why this might be, in an intimate, close-up context. Over a 1-year period, we--a collaborative team of university researchers and residents of Detroit's East Side--worked to establish a neighborhood tour whose initial goal was to raise supplementary income and fundraise for community block clubs. We found that in addition to technical requirements, such as communication tools, a range of non-technological efforts is needed to manage projects, build self-efficacy, and otherwise support community participants. Our findings widen Ackerman's \"socio-technical gap\" for some contexts and offer a counterpoint to overgeneralized claims about well-designed technologies being able to address certain classes of social challenges.",
  "tags": [
    "entrepreneurship",
    "social-technical gap",
    "lean economies"
  ],
  "authors": [
    {
      "name": "Tawanna R. Dillahunt",
      "institution": "University of Michigan, Ann Arbor, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606961",
      "orcid": "0000-0002-1155-8507"
    },
    {
      "name": "Vaishnav Kameswaran",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659027270",
      "orcid": "missing"
    },
    {
      "name": "Desiree McLain",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260735",
      "orcid": "missing"
    },
    {
      "name": "Minnie Lester",
      "institution": "Eastside Community Network, Detroit, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260732",
      "orcid": "missing"
    },
    {
      "name": "Delores Orr",
      "institution": "Eastside Community Network, Detroit, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261072",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "Mark S Ackerman. 2000. The intellectual challenge of CSCW: the gap between social requirements and technical feasibility. Human-computer interaction 15, 2 (2000), 179--203.  ",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Peter Bailis, Tawanna Dillahunt, Stefanie Mueller, and Patrick Baudisch. 2017. Research for Practice: Technology for Underserved Communities; Personal Fabrication. Commun. ACM 60, 10 (Sept. 2017), 46--49.  ",
      "doi": "10.1145/3080188"
    },
    {
      "text": "Albert Bandura. 1977. Self-efficacy: toward a unifying theory of behavioral change. Psychological review 84, 2 (1977), 191.",
      "doi": ""
    },
    {
      "text": "J. Robert Baum, Edwin A Locke, and Ken G Smith. 2001. A multidimensional model of venture growth. Academy of management journal 44, 2 (2001), 292--303.",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1998. Contextual Design: Defining Customer-centered Systems. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Karen Bouffard. 2015. Census bureau: Detroit is poorest big city in U.S. (17 Sep. 2015). http://www.detroitnews. com/story/news/local/michigan/2015/09/16/ census-us-uninsured-drops-income-stagnates/32499231/",
      "doi": ""
    },
    {
      "text": "Pierre Bourdieu. 1984. Distinction: A social critique of the judgement of taste. Harvard Univ Pr.",
      "doi": ""
    },
    {
      "text": "Nancy G. Boyd and George S Vozikis. 1994. The influence of self-efficacy on the development of entrepreneurial intentions and actions. Entrepreneurship theory and practice 18 (1994), 63--63.",
      "doi": ""
    },
    {
      "text": "Colleen Casey. 2013. Critical Connections: The Importance of Community-Based Organizations and Social Capital to Credit Access for Low-Wealth Entrepreneurs. Urban Affairs Review (2013), 1078087413508915.",
      "doi": ""
    },
    {
      "text": "Chao C. Chen, Patricia Gene Greene, and Ann Crick. 1998. Does entrepreneurial self-efficacy distinguish entrepreneurs from managers? Journal of business venturing 13, 4 (1998), 295--316.",
      "doi": ""
    },
    {
      "text": "Amit Chowdhry. 2016. Most Of Your Facebook Friends Are Not Your Real Friends, Says Study. (9 Sep. 2016). https://www.forbes.com/sites/amitchowdhry/2016/01/30/ most-facebook-friends-are-not-your-real-friends",
      "doi": ""
    },
    {
      "text": "-says-study",
      "doi": ""
    },
    {
      "text": "Andy Crabtree and Alan Chamberlain. 2014. Making It \"Pay a Bit Better\": Design Challenges for Micro Rural Enterprise. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 687--696.  ",
      "doi": "10.1145/2531602.2531618"
    },
    {
      "text": "David C. DeAndrea, Nicole B. Ellison, Robert LaRose, Charles Steinfield, and Andrew Fiore. 2012. Serious social media: On the use of social media for improving students' adjustment to college. The Internet and higher education 15, 1 (2012), 15--23.",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt. 2014. Fostering social capital in economically distressed communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 531--540.  ",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Tawanna R. Dillahunt, Nishan Bose, Suleman Diwan, and Asha Chen-Phang. 2016. Designing for Disadvantaged Job Seekers: Insights from Early Investigations. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 905--910.  ",
      "doi": "10.1145/2901790.2901865"
    },
    {
      "text": "Tawanna R. Dillahunt, Vaishnav Kameswaran, Linfeng Li, and Tanya Rosenblat. 2017. Uncovering the Values and Constraints of Real-time Ridesharing for Low-resource Populations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2757--2769.  ",
      "doi": "10.1145/3025453.3025470"
    },
    {
      "text": "Tawanna R. Dillahunt and Amelia R. Malone. 2015. The Promise of the Sharing Economy Among Disadvantaged Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2285--2294.  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Tawanna R. Dillahunt, Sandy Ng, Michelle Fiesta, and Zengguang Wang. 2016. Do Massive Open Online Course Platforms Support Employability?. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 233--244.  ",
      "doi": "10.1145/2818048.2819924"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 656--671.  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Benjamin G. Edelman, Michael Luca, and Dan Svirsky. 2016. Racial discrimination in the sharing economy: Evidence from a field experiment. (2016).",
      "doi": ""
    },
    {
      "text": "Babson Executive Education. 2016. Platforms: Where the Sharing Economy and Entrepreneurship Ecosystems Meet. (2016). http://www.babson.edu/executive-education/ thought-leadership/technology/Pages/ platforms-where-sharing-economy-and-entrepreneurship",
      "doi": ""
    },
    {
      "text": "-ecosystems-meet.aspx",
      "doi": ""
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2016. Social Inequality and HCI: The View from Political Economy. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4997--5002.  ",
      "doi": "10.1145/2858036.2858343"
    },
    {
      "text": "Karen Evans, Penny Fraser, and Sandra Walklate. 1996. Whom can you trust? The politics of 'grassing' on an inner city housing estate. The Sociological Review 44, 3 (1996), 361--380.",
      "doi": ""
    },
    {
      "text": "Casey J. Frid, David M Wyman, William B Gartner, and Diana H Hechavarria. 2016. Low-wealth entrepreneurs and access to external financing. International Journal of Entrepreneurial Behavior & Research 22, 4 (2016), 531--555.",
      "doi": ""
    },
    {
      "text": "Yanbo Ge, Christopher R. Knittel, Don MacKenzie, and Stephen Zoepf. 2016. (Oct. 2016). http://www.nber.org/papers/w22776.pdf",
      "doi": ""
    },
    {
      "text": "Elizabeth M. Gerber and Julie Hui. 2013. Crowdfunding: Motivations and Deterrents for Participation. ACM Trans. Comput.-Hum. Interact. 20, 6, Article 34 (Dec. 2013), 32 pages.  ",
      "doi": "10.1145/2530540"
    },
    {
      "text": "Mareike Glöss, Moira McGregor, and Barry Brown. 2016. Designing for Labour: Uber and the On-Demand Mobile Workforce. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1632--1643.  ",
      "doi": "10.1145/2858036.2858476"
    },
    {
      "text": "Robert Halpern. 1995. Rebuilding the inner city: A history of neighborhood initiatives to address poverty in the United States. Columbia University Press.",
      "doi": ""
    },
    {
      "text": "Charles Handy. 1995. Trust and the virtual organization. Harvard business review 73, 3 (1995), 40--51.",
      "doi": ""
    },
    {
      "text": "Emily Harburg, Julie Hui, Michael Greenberg, and Elizabeth M. Gerber. 2015. Understanding the Effects of Crowdfunding on Entrepreneurial Self-Efficacy. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 3--16.  ",
      "doi": "10.1145/2675133.2675142"
    },
    {
      "text": "Gillian R. Hayes. 2011. The Relationship of Action Research to Human-computer Interaction. ACM Trans. Comput.-Hum. Interact. 18, 3, Article 15 (Aug. 2011), 20 pages.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Joey Chiao-Yin Hsiao and Tawanna R. Dillahunt. 2017. People-Nearby Applications: How Newcomers Move Their Relationships Offline and Develop Social and Cultural Capital. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 26--40.  ",
      "doi": "10.1145/2998181.2998280"
    },
    {
      "text": "Julie Hui. 2016. Online Help-Seeking in Communities of Novice Innovators. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 218--222.  ",
      "doi": "10.1145/2851581.2859018"
    },
    {
      "text": "Julie S. Hui and Elizabeth M. Gerber. 2017. Developing Makerspaces As Sites of Entrepreneurship. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 2023--2038.  ",
      "doi": "10.1145/2998181.2998264"
    },
    {
      "text": "Julie S. Hui, Elizabeth M. Gerber, and Darren Gergle. 2014a. Understanding and Leveraging Social Networks for Crowdfunding: Opportunities and Challenges. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 677--680.  ",
      "doi": "10.1145/2598510.2598539"
    },
    {
      "text": "Julie S. Hui, Michael D. Greenberg, and Elizabeth M. Gerber. 2014b. Understanding the role of community in crowdfunding work. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 62--74.  ",
      "doi": "10.1145/2531602.2531715"
    },
    {
      "text": "Margareta Hult and Sven-Åke Lennung. 1980. Towards a definition of action research: a note and bibliography. Journal of management studies 17, 2 (1980), 241--250.",
      "doi": ""
    },
    {
      "text": "Tapio Ikkala and Airi Lampinen. 2015. Monetizing network hospitality: Hospitality and sociability in the context of Airbnb. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing. ACM, 1033--1044.  ",
      "doi": "10.1145/2675133.2675274"
    },
    {
      "text": "The Experts Journal Reports: Small Business. 2013. The Most Important Traits for Entrepreneurs. (20 Aug. 2013). https://tinyurl.com/k4o5vyq",
      "doi": ""
    },
    {
      "text": "Nicolas Kokkalis, Chengdiao Fan, Thomas Breier, and Michael S. Bernstein. 2017. Founder Center: Enabling Access to Collective Social Capital. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 2010--2022.  ",
      "doi": "10.1145/2998181.2998244"
    },
    {
      "text": "Kahliah Laney. 2013. Launching Low-Income Entrepreneurs. Center for an Urban Future (2013).",
      "doi": ""
    },
    {
      "text": "Luke Eric Lassiter. 2005. Collaborative Ethnography and Public Anthropology. Current Anthropology 46, 1 (2005), 83--106.",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1348--1358.  ",
      "doi": "10.1145/2675133.2675147"
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1603--1612.  ",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Silvia Lindtner, Anna Greenspan, and David Li. 2015. Designed in Shenzhen: Shanzhai Manufacturing and Maker Entrepreneurs. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (AA '15). Aarhus University Press, 85--96.  ",
      "doi": "10.7146/aahcc.v1i1.21265"
    },
    {
      "text": "Michael Luca. 2017. Designing Online Marketplaces: Trust and Reputation Mechanisms. Innovation Policy and the Economy 17, 1 (2017), 77--93.",
      "doi": ""
    },
    {
      "text": "Gideon D. Markman and Robert A. Baron. 2003. Person-entrepreneurship fit: why some people are more successful as entrepreneurs than others. Human Resource Management Review 13, 2 (2003), 281 -- 301.",
      "doi": ""
    },
    {
      "text": "Mokeira Masita-Mwangi, Nancy Mwakaba, and Jussi Impio. 2012. Taking Micro-enterprise Online: The Case of Kenyan Businesses. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 367--382.  ",
      "doi": "10.1145/2212776.2212815"
    },
    {
      "text": "Bill McEvily, Vincenzo Perrone, and Akbar Zaheer. 2003. Trust as an organizing principle. Organization science 14, 1 (2003), 91--103.  ",
      "doi": "10.1287/orsc.14.1.91.12814"
    },
    {
      "text": "Alice McIntyre. 2007. Participatory action research. Vol. 52. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Michael Muller, Werner Geyer, Todd Soule, Steven Daniels, and Li-Te Cheng. 2013. Crowdfunding Inside the Enterprise: Employee-initiatives for Innovation and Collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 503--512.  ",
      "doi": "10.1145/2470654.2470727"
    },
    {
      "text": "Mohamed Musthag and Deepak Ganesan. 2013. Labor Dynamics in a Mobile Micro-task Market. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 641--650.  ",
      "doi": "10.1145/2470654.2470745"
    },
    {
      "text": "JP Morgan Chase & Co. New Skills at Work. 2015. Driving Opportunity in Detroit: Building a middle-skill workforce to strengthen economic recovery and expand the middle class. (Apr. 2015). https://www.jpmorganchase. com/corporate/Corporate-Responsibility/document/ 54841-jpmc-gap-detroit-aw3-final.pdf",
      "doi": ""
    },
    {
      "text": "Dayo Olopade. 2014. The bright continent: Breaking rules and making change in modern Africa. Houghton Mifflin Harcourt.",
      "doi": ""
    },
    {
      "text": "Peter Osalor. 2016. The impact of entrepreneurship on economic growth, Development. Vanguard (17 Oct. 2016). http://www.vanguardngr.com/2016/10/ impact-entrepreneurship-economic-growth-development",
      "doi": ""
    },
    {
      "text": "Elinor Ostrom, James Walker, and Roy Gardner. 1992. Covenants with and without a Sword: Self-governance Is Possible. American political science Review 86, 02 (1992), 404--417.",
      "doi": ""
    },
    {
      "text": "Noopur Raval and Paul Dourish. 2016. Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 97--107.  ",
      "doi": "10.1145/2818048.2820026"
    },
    {
      "text": "Jo Rhodes. 2009. A strategic framework for rural micro-enterprise development: The integration of information communication technology (ICT), e-commerce, marketing, and actor-network theory. Perspectives on global development and technology 8, 1 (2009), 48--69.",
      "doi": ""
    },
    {
      "text": "Lauren Rhue and Jessica Clark. 2016. Who Gets Started on Kickstarter? Racial Disparities in Crowdfunding Success. (9 Sep. 2016).",
      "doi": ""
    },
    {
      "text": "Elena Rocco, Thomas A Finholt, Erik C Hofer, and JD Herbsleb. 2001. Out of sight, short of trust. In Presentation at the Founding Conference of the European Academy of Management. Barcelona, Spain.",
      "doi": ""
    },
    {
      "text": "Alex Rosenblat and Luke Stark. 2016. Algorithmic Labor and Information Asymmetries: A Case Study of Uber's Drivers. (2016).",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated technology use in developing communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "DK Sarasvathy, Herbert A. Simon, and Lester Lave. 1998. Perceiving and managing business risks: Differences between entrepreneurs and bankers. Journal of economic behavior & organization 33, 2 (1998), 207--225.",
      "doi": ""
    },
    {
      "text": "Gerry Segal, Dan Borgia, and Jerry Schoenfeld. 2005. The motivation to become an entrepreneur. International journal of Entrepreneurial Behavior & research 11, 1 (2005), 42--57.",
      "doi": ""
    },
    {
      "text": "S.E. Shanahan and N.B. Tuma. 1994. The sociology of distribution and redistribution. In The handbook of economic sociology, N.J. Smelser and R. Swedberg (Eds.). Princeton University Press, Princeton, NJ, 733--765.",
      "doi": ""
    },
    {
      "text": "Scott Andrew Shane. 2003. A general theory of entrepreneurship: The individual-opportunity nexus. Edward Elgar Publishing.",
      "doi": ""
    },
    {
      "text": "Nick Taylor, Ursula Hurley, and Philip Connolly. 2016. Making Community: The Wider Role of Makerspaces in Public Life. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1415--1425.  ",
      "doi": "10.1145/2858036.2858073"
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 629--638.  ",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Kentaro Toyama. 2015. Geek Heresy: Rescuing Social Change from the Cult of Technology. (2015). http://www.amazon.com/ Geek-Heresy-Rescuing-Social-Technology/dp/161039528X",
      "doi": ""
    },
    {
      "text": "United States Census Bureau. 2015. Selected Economic Characteristics: 2010--2015 American Community Survey 5-Year Estimates. n.d. (2015). https://factfinder.census.gov",
      "doi": ""
    },
    {
      "text": "William Foote Whyte (Ed.). 1991. Participatory action research. Sage Publications, Inc, Thousand Oaks, CA, US. 247 pages.",
      "doi": ""
    },
    {
      "text": "Hao Zhao, Scott E Seibert, and Gerald E Hills. 2005. The mediating role of self-efficacy in the development of entrepreneurial intentions. Journal of applied psychology 90, 6 (2005), 1265.",
      "doi": ""
    },
    {
      "text": "Jun Zheng, Elizabeth Veinott, Nathan Bos, Judith S. Olson, and Gary M. Olson. 2002. Trust without touch: jumpstarting long-distance trust with initial social activities. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 141--146.  ",
      "doi": "10.1145/503376.503402"
    }
  ]
}