{
  "doi": "10.1145/3173574.3174145",
  "title": "Impact Activation Improves Rapid Button Pressing",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2018,
  "badges": [],
  "abstract": "The activation point of a button is defined as the depth at which it invokes a make signal. Regular buttons are activated during the downward stroke, which occurs within the first 20 ms of a press. The remaining portion, which can be as long as 80 ms, has not been examined for button activation for reason of mechanical limitations. The paper presents a technique and empirical evidence for an activation technique called Impact Activation, where the button is activated at its maximal impact point. We argue that this technique is advantageous particularly in rapid, repetitive button pressing, which is common in gaming and music applications. We report on a study of rapid button pressing, wherein users' timing accuracy improved significantly with use of Impact Activation. The technique can be implemented for modern push-buttons and capacitive sensors that generate a continuous signal.",
  "authors": [
    {
      "name": "Sunjun Kim",
      "institution": "Aalto University&Korea Advanced Institute of Science&Technology, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81460641074/rel-imgonly/sunjun.png",
      "acmid": "81460641074",
      "orcid": "missing"
    },
    {
      "name": "Byungjoo Lee",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659503945",
      "orcid": "0000-0003-0341-448X"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    }
  ],
  "references": [
    {
      "text": "Gisa Aschersleben. 2002. Temporal Control of Movements in Sensorimotor Synchronization. Brain and Cognition 48, 1 (2002), 66--79.",
      "doi": ""
    },
    {
      "text": "Sebastian Boring, David Ledo, Xiang 'Anthony' Chen, Nicolai Marquardt, Anthony Tang, and Saul Greenberg. 2012. The Fat Thumb: Using the Thumb's Contact Size for Single-handed Mobile Interaction. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 39--48.  ",
      "doi": "10.1145/2371574.2371582"
    },
    {
      "text": "Kimberly Chu and Chui Yin Wong. 2011. Mobile input devices for gaming experience. In 2011 International Conference on User Science and Engineering (i-USEr ). 83--88.",
      "doi": ""
    },
    {
      "text": "Marc O Ernst and Martin S Banks. 2002. Humans integrate visual and haptic information in a statistically optimal fashion. Nature 415, 6870 (2002), 429--433.",
      "doi": ""
    },
    {
      "text": "Curt B. Irwin and Mary E. Sesto. 2012. Performance and touch characteristics of disabled and non-disabled participants during a reciprocal tapping task using touch screen technology. Applied Ergonomics 43, 6 (2012), 1038--1043.",
      "doi": ""
    },
    {
      "text": "Topi Kaaresoja, Emilia Anttila, and Eve Hoggan. 2011. The effect of tactile feedback latency in touchscreen interaction. In 2011 IEEE World Haptics Conference. 65--70.",
      "doi": ""
    },
    {
      "text": "Topi Kaaresoja, Stephen Brewster, and Vuokko Lantz. 2014. Towards the Temporally Perfect Virtual Button: Touch-Feedback Simultaneity and Perceived Quality in Mobile Touchscreen Press Interactions. ACM Trans. Appl. Percept. 11, 2, Article 9 (June 2014), 25 pages.  ",
      "doi": "10.1145/2611387"
    },
    {
      "text": "Steven W. Keele and Harold L. Hawkins. 1982. &gt;Explorations of Individual Differences Relevant to High Level Skill. Journal of Motor Behavior 14, 1 (1982), 3--23. PMID: 15151886.",
      "doi": ""
    },
    {
      "text": "Sunjun Kim, Jeongmin Son, Geehyuk Lee, Hwan Kim, and Woohun Lee. 2013. TapBoard: Making a Touch Screen Keyboard More Touchable. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 553--562.  ",
      "doi": "10.1145/2470654.2470733"
    },
    {
      "text": "Paul A Kolers and Joan M Brewster. 1985. Rhythms and responses. Journal of Experimental Psychology: Human Perception and Performance 11, 2 (1985), 150--167.",
      "doi": ""
    },
    {
      "text": "Vanessa Krause, Bettina Pollok, and Alfons Schnitzler. 2010. Perception in action: The impact of sensory information on sensorimotor synchronization in musicians and non-musicians. Acta Psychologica 133, 1 (2010), 28--37.",
      "doi": ""
    },
    {
      "text": "Byungjoo Lee, Qiao Deng, Eve Hoggan, and Antti Oulasvirta. 2017. Boxer: A Multimodal Collision Technique for Virtual Objects. In Proceedings of the 19th ACM International Conference on Multimodal Interaction (ICMI 2017). ACM, New York, NY, USA, 252--260.  ",
      "doi": "10.1145/3136755.3136761"
    },
    {
      "text": "Byungjoo Lee and Antti Oulasvirta. 2016. Modelling Error Rates in Temporal Pointing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1857--1868.  ",
      "doi": "10.1145/2858036.2858143"
    },
    {
      "text": "John Morton, Steve Marcus, and Clive Frankish. 1976. Perceptual centers (P-centers). Psychological Review 83, 5 (1976), 405.",
      "doi": ""
    },
    {
      "text": "Takao Nagashima. 1986. Keyboard switch. (April 22 1986). US Patent 4,584,444.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Sunjun Kim, and Byungjoo Lee. 2018. Neuromechanics of a Button Press. In Proceedings of the 36th Annual ACM Conference on Human Factors in Computing Systems (CHI'18). ACM Press.  ",
      "doi": "10.1145/3173574.3174082"
    },
    {
      "text": "Robert G. Radwin and One-Jang Jeng. 1997. Activation Force and Travel effects on Overexertion in Repetitive Key Tapping. Human Factors 39, 1 (1997), 130--140. PMID: 9302885.",
      "doi": ""
    },
    {
      "text": "David Rempel, Jack Dennerlein, C.D. Mote, and Thomas Armstrong. 1994. A method of measuring fingertip loading during keyboard use. Journal of Biomechanics 27, 8 (1994), 1101--1104.",
      "doi": ""
    },
    {
      "text": "David Rempel, Elaine Serina, Edward Klinenberg, Bernard J Martin, Thomas J Armstrong, James A Foulke, and Sivakumaran Natarajan. 1997. The effect of keyboard keyswitch make force on applied force and finger flexor muscle activity. Ergonomics 40, 8 (1997), 800--808.",
      "doi": ""
    },
    {
      "text": "Bruno H. Repp. 2003. Rate Limits in Sensorimotor Synchronization With Auditory and Visual Sequences: The Synchronization Threshold and the Benefits and Costs of Interval Subdivision. Journal of Motor Behavior 35, 4 (2003), 355--370. PMID: 14607773.",
      "doi": ""
    },
    {
      "text": "Bruno H. Repp. 2005. Sensorimotor synchronization: A review of the tapping literature. Psychonomic Bulletin&Review 12, 6 (01 Dec 2005), 969--992.",
      "doi": ""
    },
    {
      "text": "Bruno H. Repp. 2008. Multiple temporal references in sensorimotor synchronization with metrical auditory sequences. Psychological Research 72, 1 (01 Jan 2008), 79--98.",
      "doi": ""
    },
    {
      "text": "Bruno H Repp. 2012. Comments on The effects of stimulus rate and tapping rate on tapping performance I by Zendel, Ross, and Fujioka (2011). Music Perception: An Interdisciplinary Journal 29, 4 (2012), 447--448.",
      "doi": ""
    },
    {
      "text": "Bruno H Repp and Amandine Penel. 2002. Auditory dominance in temporal processing: new evidence from synchronization with simultaneous visual and auditory sequences. Journal of Experimental Psychology-Human Perception and Performance 28, 5 (2002), 1085--1099.",
      "doi": ""
    },
    {
      "text": "Bruno H. Repp and Yi-Huang Su. 2013. Sensorimotor synchronization: A review of recent research (2006--2012). Psychonomic Bulletin&Review 20, 3 (01 Jun 2013), 403--452.",
      "doi": ""
    },
    {
      "text": "Benjamin G. Schultz and Floris T. van Vugt. 2016. Tap Arduino: An Arduino microcontroller for low-latency auditory feedback in sensorimotor synchronization experiments. Behavior Research Methods 48, 4 (01 Dec 2016), 1591--1607.",
      "doi": ""
    },
    {
      "text": "Martine Turgeon, Alan M Wing, and Lawrence W Taylor. 2011. Timing and aging: Slowing of fastest regular tapping rate with preserved timing error detection and correction. Psychology and Aging 26, 1 (2011), 150--161.",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: A Technique for Operating Pen-based Interfaces Using Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Piet G. Vos, JiÅŹÃ Mates, and Noud W. van Kruysbergen. 1995. The Perceptual Centre of a Stimulus as the Cue for Synchronization to a Metronome: Evidence from Asynchronies. The Quarterly Journal of Experimental Psychology Section A 48, 4 (1995), 1024--1040.",
      "doi": ""
    },
    {
      "text": "Jean Vroomen, Mirjam Keetels, Beatrice de Gelder, and Paul Bertelson. 2004. Recalibration of temporal order perception by exposure to audio-visual asynchrony. Cognitive Brain Research 22, 1 (2004), 32 -- 35.",
      "doi": ""
    },
    {
      "text": "Christopher D Wickens, Justin G Hollands, Simon Banbury, and Raja Parasuraman. 2015. Engineering psychology&human performance. Psychology Press.",
      "doi": ""
    },
    {
      "text": "EJ Williams. 1949. Experimental designs balanced for the estimation of residual effects of treatments. Australian Journal of Chemistry 2, 2 (1949), 149--168.",
      "doi": ""
    },
    {
      "text": "Alan M. Wing and A. B. Kristofferson. 1973a. Response delays and the timing of discrete motor responses. Perception&Psychophysics 14, 1 (01 Feb 1973), 5--12.",
      "doi": ""
    },
    {
      "text": "Alan M. Wing and A. B. Kristofferson. 1973b. The timing of interresponse intervals. Perception&Psychophysics 13, 3 (01 Oct 1973), 455--460.",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Ricardo Jota, Benjamin McCanny, Zhe Yu, Clifton Forlines, Karan Singh, and Daniel Wigdor. 2014. Zero-latency Tapping: Using Hover Information to Predict Touch Locations and Eliminate Touchdown Latency. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 205--214.  ",
      "doi": "10.1145/2642918.2647348"
    },
    {
      "text": "Loutfouz Zaman and I Scott MacKenzie. 2013. Evaluation of nano-stick, foam buttons, and other input methods for gameplay on touchscreen phones. In International Conference on Multimedia and Human-Computer Interaction-MHCI 2013. 69--1.",
      "doi": ""
    },
    {
      "text": "Loutfouz Zaman, Daniel Natapov, and Robert J. Teather. 2010. Touchscreens vs. Traditional Controllers in Handheld Gaming. In Proceedings of the International Academic Conference on the Future of Game Design and Technology (Futureplay '10). ACM, New York, NY, USA, 183--190.  ",
      "doi": "10.1145/1920778.1920804"
    },
    {
      "text": "Benjamin Rich Zendel, Bernhard Ross, and Takako Fujioka. 2011. The Effects of Stimulus Rate and Tapping Rate on Tapping Performance. Music Perception: An Interdisciplinary Journal 29, 1 (2011), 65--78.",
      "doi": ""
    }
  ]
}