{
  "doi": "10.1145/3173574.3174232",
  "title": "Whiskers: Exploring the Use of Ultrasonic Haptic Cues on the Face",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Haptic cues are a valuable feedback mechanism for smart glasses. Prior work has shown how they can support navigation, deliver notifications and cue targets. However, a focus on actuation technologies such as mechanical tactors or fans has restricted the scope of research to a small number of cues presented at fixed locations. To move beyond this limitation, we explore perception of in-air ultrasonic haptic cues on the face. We present two studies examining the fundamental properties of localization, duration and movement perception on three facial sites suitable for use with glasses: the cheek, the center of the forehead, and above the eyebrow. The center of the forehead led to optimal performance with a localization error of 3.77mm and accurate duration (80%) and movement perception (87%). We apply these findings in a study delivering eight different ultrasonic notifications and report mean recognition rates of up to 92.4% (peak: 98.6%). We close with design recommendations for ultrasonic haptic cues on the face.",
  "authors": [
    {
      "name": "Hyunjae Gil",
      "institution": "Ulsan National Institute of Science & Technology, Ulsan, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160448",
      "orcid": "missing"
    },
    {
      "name": "Hyungki Son",
      "institution": "Electronics and Telecommunications Research Institute, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261742",
      "orcid": "missing"
    },
    {
      "name": "Jin Ryong Kim",
      "institution": "Electronics and Telecommunications Research Institute, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261062",
      "orcid": "missing"
    },
    {
      "name": "Ian Oakley",
      "institution": "Ulsan National Institute of Science & Technology, Ulsan, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100367387",
      "orcid": "0000-0001-5834-8577"
    }
  ],
  "references": [
    {
      "text": "Mark Billinghurst, Adrian Clark, and Gun Lee. 2015. A Survey of Augmented Reality. Found. Trends Hum.Comput. Interact. 8, 2--3 (March 2015), 73--272.  ",
      "doi": "10.1561/1100000049"
    },
    {
      "text": "Stephen Brewster and Lorna M. Brown. 2004. Tactons: structured tactile messages for non-visual information display. In Proceedings of the fifth conference on Australasian user interface - Volume 28 (AUIC '04), A. Cockburn (Ed.), Vol. 28. Australian Computer Society, Inc., Darlinghurst, Australia, Australia, 15--23. ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "Lorna M. Brown, Stephen A. Brewster, and Helen C. Purchase. 2006. Multidimensional tactons for nonvisual information presentation in mobile devices. In Proceedings of the 8th conference on Humancomputer interaction with mobile devices and services (MobileHCI '06). ACM, New York, NY, USA, 231--238.  ",
      "doi": "10.1145/1152215.1152265"
    },
    {
      "text": "Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: multi-point mid-air haptic feedback for touch surfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 505--514.  ",
      "doi": "10.1145/2501988.2502018"
    },
    {
      "text": "Alvaro Cassinelli, Carson Reynolds, and Masatoshi Ishikawa. 2006. Augmenting spatial awareness with haptic radar. In 10th IEEE International Symposium on Wearable Computers. IEEE, 61--64.",
      "doi": ""
    },
    {
      "text": "Roger W. Cholewiak and Amy A. Collins. 2003. Vibrotactile localization on the arm: Effects of place, space, and age. Attention, Perception, & Psychophysics, 65(7), 1058--1077.",
      "doi": ""
    },
    {
      "text": "Joseph L. Gabbard, Gregory M. Fitch, and Hyungil Kim. Behind the Glass: Driver challenges and opportunities for AR automotive applications. Proceedings of the IEEE 102(2), 124--136.",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Eythor R. Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. GyroVR: Simulating Inertia in Virtual Reality using Head Worn Flywheels. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 227--232.  ",
      "doi": "10.1145/2984511.2984535"
    },
    {
      "text": "Steven Henderson and Steven Feiner. 2011. Exploring the Benefits of Augmented Reality Documentation for Maintenance and Repair. IEEE Transactions on Visualization and Computer Graphics 17, 10 (October 2011), 1355--1368.  ",
      "doi": "10.1109/TVCG.2010.245"
    },
    {
      "text": "Jason Hong. 2013. Considering privacy issues in the context of Google glass. Commun. ACM 56, 11 (November 2013), 10--11.  ",
      "doi": "10.1145/2524713.2524717"
    },
    {
      "text": "Takayuki Hoshi, Masafumi Takahashi, Kei Nakatsuma, and Hiroyuki Shinoda. 2009. Touchable holography. In ACM SIGGRAPH 2009 Emerging Technologies (SIGGRAPH '09). ACM, New York, NY, USA, Article 23, 1 page.  ",
      "doi": "10.1145/1597956.1597979"
    },
    {
      "text": "Takayuki Hoshi, Masafumi Takahashi, Takayuki Iwamoto, and Hiroyuki Shinoda. 2010. Noncontact Tactile Display Based on Radiation Pressure of Airborne Ultrasound. IEEE Trans. Haptics 3, 3 (July 2010), 155--165.  ",
      "doi": "10.1109/TOH.2010.4"
    },
    {
      "text": "Takayuki Hoshi. 2011. Development of aerial-input and aerial-tactile-feedback system. In IEEE World Haptics Conference (WHC), IEEE, 569--573.",
      "doi": ""
    },
    {
      "text": "Takayuki Hoshi. 2012. Handwriting transmission system using noncontact tactile display. In IEEE Haptics Symposium (HAPTICS), IEEE, 399--401.",
      "doi": ""
    },
    {
      "text": "Felix Hülsman, Nikita Mattar, Julia Fröhlich, and Ipke Wachsmuth. 2014. Simulating wind and warmth in virtual reality: conception, realization and evaluation for a cave environment. JVRB-Journal of Virtual Reality and Broadcasting, 11(10).",
      "doi": ""
    },
    {
      "text": "Inwook Hwang, Hyungki Son, and Jin Ryong Kim. 2017. AirPiano: Enhancing music playing experience in virtual reality with mid-air haptic feedback. In IEEE World Haptics Conference (WHC), IEEE, 213--218.",
      "doi": ""
    },
    {
      "text": "Oliver Beren Kaul and Michael Rohs. 2017. HapticHead: A Spherical Vibrotactile Grid around the Head for 3D Guidance in Virtual and Augmented Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3729--3740.  ",
      "doi": "10.1145/3025453.3025684"
    },
    {
      "text": "Cédric Kervegant, Félix Raymond, Delphine Graeff, and Julien Castet. 2017. Touch hologram in mid-air. In ACM SIGGRAPH 2017 Emerging Technologies (SIGGRAPH '17). ACM, New York, NY, USA, Article 23, 2 pages.  ",
      "doi": "10.1145/3084822.3084824"
    },
    {
      "text": "Jacob H. Kirman. 1974. Tactile apparent movement: The effects of interstimulus onset interval and stimulus duration. Perception & Psychophysics, 15(1), 1--6.",
      "doi": ""
    },
    {
      "text": "Panos E. Kourouthanassis, Costas Boletsis, and George Lekakos. 2015. Demystifying the design of mobile augmented reality applications. Multimedia Tools and Applications, 74(3), 1045--1066.  ",
      "doi": "10.1007/s11042-013-1710-7"
    },
    {
      "text": "B. W. Lawton. 2001. Damage to human hearing by airborne sound of very high frequency or ultrasonic frequency or ultrasonic frequency. Health & Safety Executive, 77pp.",
      "doi": ""
    },
    {
      "text": "Kangdon Lee. 2012. Augmented reality in education and training. TechTrends, 56(2), 13--21.",
      "doi": ""
    },
    {
      "text": "Jaeyeon Lee and Geehyuk Lee. 2016. Designing a Non-contact Wearable Tactile Display Using Airflows. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 183--194.  ",
      "doi": "10.1145/2984511.2984583"
    },
    {
      "text": "Stephen Levy. 2017. Google Glass 2.0 is a Startling Second Act. In Wired Backchannel. Retrieved September, 2017 from https://www.wired.com/story/google-glass-2-is-here/.",
      "doi": ""
    },
    {
      "text": "Kris Luyten, Donald Degraen, Gustavo Rovelo Ruiz, Sven Coppers, and Davy Vanacken. 2016. Hidden in Plain Sight: an Exploration of a Visual Language for Near-Eye Out-of-Focus Displays in the Peripheral View. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 487--497.  ",
      "doi": "10.1145/2858036.2858339"
    },
    {
      "text": "Patricia Ivette Cornelio Martinez, Silvana De Pirro, Chi Thanh Vi, and Sriram Subramanian. 2017. Agency in Mid-air Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 24262439.  ",
      "doi": "10.1145/3025453.3025457"
    },
    {
      "text": "Marianna Obrist, Sriram Subramanian, Elia Gatti, Benjamin Long, and Thomas Carter. 2015. Emotions Mediated Through Mid-Air Haptics. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2053--2062.  ",
      "doi": "10.1145/2702123.2702361"
    },
    {
      "text": "Victor Adriel de Jesus Oliveira, Luca Brayda, and Luciana Nedel. 2017. Designing a vibrotactile headmounted display for spatial awareness in 3d spaces. IEEE Transactions on Visualization and Computer Graphics, 23(4), 1409--1417.  ",
      "doi": "10.1109/TVCG.2017.2657238"
    },
    {
      "text": "Roshan Lalintha Peiris, Wei Peng, Zikun Chen, Liwei Chan, and Kouta Minamizawa. 2017. ThermoVR: Exploring Integrated Thermal Haptic Feedback with Head Mounted Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 54525456.  ",
      "doi": "10.1145/3025453.3025824"
    },
    {
      "text": "Roshan Lalintha Peiris, Wei Peng, Zikun Chen, and Kouta Minamizawa. 2017. Exploration of cuing methods for localization of spatial cues using thermal haptic feedback on the forehead. In IEEE World Haptics Conference (WHC), IEEE, 400--405.",
      "doi": ""
    },
    {
      "text": "Yasuaki Monnai, Keisuke Hasegawa, Masahiro Fujiwara, Kazuma Yoshino, Seki Inoue, and Hiroyuki Shinoda. 2014. HaptoMime: mid-air haptic interaction with a floating virtual screen. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 663--667.  ",
      "doi": "10.1145/2642918.2647407"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Shienny Karwita, David Tolley, and Ellen Yi-Luen Do. 2017. Ambiotherm: Enhancing Sense of Presence in Virtual Reality by Simulating Real-World Environmental Conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 17311742.  ",
      "doi": "10.1145/3025453.3025723"
    },
    {
      "text": "Michael Rietzler, Katrin Plaumann, Taras Kränzle, Marcel Erath, Alexander Stahl, and Enrico Rukzio. 2017. VaiR: Simulating 3D Airflows in Virtual Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5669--5677.  ",
      "doi": "10.1145/3025453.3026009"
    },
    {
      "text": "Antti Sand, Ismo Rakkolainen, Poika Isokoski, Jari Kangas, Roope Raisamo, and Karri Palovuori. 2015. Head-mounted display with mid-air tactile feedback. In Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology (VRST '15), Stephen N. Spencer (Ed.). ACM, New York, NY, USA, 51--58.  ",
      "doi": "10.1145/2821592.2821593"
    },
    {
      "text": "Yuka Sato and Ryoko Ueoka. 2017. Investigating Haptic Perception of and Physiological Responses to Air Vortex Rings on a User's Cheek. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3083--3094.  ",
      "doi": "10.1145/3025453.3025501"
    },
    {
      "text": "Carl E. Sherrick and Ronald Rogers. 1966. Apparent haptic movement. Perception & Psychophysics, 1(3), 175--180.",
      "doi": ""
    },
    {
      "text": "Maria Z. Siemionow, Bahar Bassiri Gharb, and Antonio Rampazzo. 2011. The face as a sensory organ. In The Know-How of Face Transplantation. Springer London, 11--23.",
      "doi": ""
    },
    {
      "text": "Yolanda Vazquez-Alvarez, Ian Oakley, and Stephen A. Brewster. 2012. Auditory display design for exploration in mobile audio-augmented reality. Personal and Ubiquitous computing, 16(8), 987--999.  ",
      "doi": "10.1007/s00779-011-0459-0"
    },
    {
      "text": "Ronald T. Verrillo. 1980. Age related changes in the sensitivity to vibration. Journal of gerontology, 35(2), 185--193.",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Thomas Carter, Sriram Subramanian, and Stephen A. Brewster. 2014. Perception of ultrasonic haptic feedback on the hand: localisation and apparent motion. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 11331142.  ",
      "doi": "10.1145/2556288.2557033"
    },
    {
      "text": "Flynn Wolf and Ravi Kuber. 2018. Developing a HeadMounted Tactile Prototype to Support Situational Awareness. International Journal of Human-Computer Studies, 109, 54--67.  ",
      "doi": "10.1016/j.ijhcs.2017.08.002"
    }
  ]
}