{
  "doi": "10.1145/3173574.3173752",
  "title": "FingerT9: Leveraging Thumb-to-finger Interaction for Same-side-hand Text Entry on Smartwatches",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "We introduce FingerT9, leveraging the action of thumb-to-finger touching on the finger segments, to support same-side-hand (SSH) text entry on smartwatches. This is achieved by mapping a T9 keyboard layout to the finger segments. Our solution avoids the problems of fat finger and screen occlusion, and enables text entry using the same-side hand which wears the watch. In the pilot study, we determined the layout mapping preferred by the users. We conducted an experiment to compare the text-entry performances of FingerT9, the tilt-based SSH input, and the direct-touch non-SSH input. The results showed that the participants performed significantly faster and more accurately with FingerT9 than the tilt-based method. There was no significant difference between FingerT9 and direct-touch methods in terms of efficiency and error rate. We then conducted the second experiment to study the learning curve on SSH text entry methods: FingerT9 and the tilt-based input. FingerT9 gave significantly better long-term improvement. In addition, eyes-free text entry (i.e., looking at the screen output but not the keyboard layout mapped on the finger segments) was made possible once the participants were familiar with the keyboard layout.",
  "authors": [
    {
      "name": "Pui Chung Wong",
      "institution": "City University of Hong Kong, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659090080",
      "orcid": "missing"
    },
    {
      "name": "Kening Zhu",
      "institution": "City University of Hong Kong, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81455605722",
      "orcid": "0000-0001-6740-4921"
    },
    {
      "name": "Hongbo Fu",
      "institution": "City University of Hong Kong, Hong Kong, Hong Kong",
      "img": "/do/10.1145/contrib-84458824857/rel-imgonly/hongbo_headshot_2023__small_.png",
      "acmid": "84458824857",
      "orcid": "0000-0002-0284-726X"
    }
  ],
  "references": [
    {
      "text": "Arif, Ahmed. Sabbir., and Stuerzlinger, Wolfgang. 2009. Analysis of text entry performance metrics. In Science & Technology for Humanity (TIC-STH), 2009 IEEE Toronto International Conference. 100105.",
      "doi": ""
    },
    {
      "text": "Azenkot, Shiri, and Shumin Zhai. Touch behavior with different postures on soft smartphone keyboards. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services. ACM, 2012.  ",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Chen, Xiang'Anthony, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard: a text entry technique for ultra-small interfaces that supports novice to expert transitions. In: Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM. 615--620.  ",
      "doi": "10.1145/2642918.2647354"
    },
    {
      "text": "Cho, Hyeonjoong; Kim, Miso; Seo, Kyeongeun. A text entry technique for wrist-worn watches with tiny touchscreens. In Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology. 2014. p. 79--80.  ",
      "doi": "10.1145/2658779.2658785"
    },
    {
      "text": "Christina L. James and Kelly M. Reischel. 2001. Text input for mobile devices: comparing model prediction to actual performance. In Proceedings of the 2001 SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 365--371.  ",
      "doi": "10.1145/365024.365300"
    },
    {
      "text": "Curran, Kevin., Woods, Derek., and Riordan, Barry. O. 2006. Investigating text input methods for mobile phones. Telematics and Informatics, 23(1), 1--21.  ",
      "doi": "10.1016/j.tele.2004.12.001"
    },
    {
      "text": "Darbar, Rajkumar., Sen, Prasanta Kr, Dash, Punyashlok., and Samanta, Debasis. 2016. Using hall effect sensors for 3D space text entry on smartwatches. Procedia Computer Science, 84, 79--85.",
      "doi": ""
    },
    {
      "text": "Funk, Markus., Sahami, Alireza., Henze, Niels., and Schmidt, Albrecht. 2014. Using a touch-sensitive wristband for text entry on smart watches. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. 2305--2310.  ",
      "doi": "10.1145/2559206.2581143"
    },
    {
      "text": "Gong, Jun, Xing-Dong Yang, and Pourang Irani. 2016. WristWhirl: One-handed Continuous Smartwatch Input using Wrist Gestures. Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM. 861--872.  ",
      "doi": "10.1145/2984511.2984563"
    },
    {
      "text": "Gordon, Mitchell, Tom Ouyang, and Shumin Zhai. 2016. WatchWriter: Tap and gesture typing on a smartwatch miniature keyboard with statistical decoding. In: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM. 38173821.  ",
      "doi": "10.1145/2858036.2858242"
    },
    {
      "text": "Götzelmann, Timo, and Pere-Pau Vázquez. 2015. InclineType: An Accelerometer-based Typing Approach for Smartwatches. In: Proceedings of the XVI International Conference on Human Computer Interaction. ACM. 59.  ",
      "doi": "10.1145/2829875.2829929"
    },
    {
      "text": "Grover, D. L., King, M. T., and Kushler, C. A. Patent No. US 5818437. Reduced keyboard disambiguating computer. Tegic Communications, Inc., Seattle. 1998",
      "doi": ""
    },
    {
      "text": "Guo, Anhong., and Paek, Tim. 2016. Exploring tilt for no-touch, wrist-only interactions on smartwatches. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. 17--28.  ",
      "doi": "10.1145/2935334.2935345"
    },
    {
      "text": "Hart, Sandra G., and Lowell E. Staveland.1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Advances in psychology, 52: 139--183.",
      "doi": ""
    },
    {
      "text": "Hong, Jonggi., Heo, Seongkook., Isokoski, Poika., and Lee, Geehyuk. 2015. SplitBoard: A simple split soft keyboard for wristwatch-sized touch screens. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1233--1236.  ",
      "doi": "10.1145/2702123.2702273"
    },
    {
      "text": "Huang, Da-Yuan., Chan, Liwei., Yang, Shuo., Wang, Fan., Liang, Rong-Hao., Yang, De-Nian. and Chen, Bing-Yu. 2016. DigitSpace: Designing Thumb-toFingers Touch Interfaces for One-Handed and EyesFree Interactions. In: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM. 1526--1537.  ",
      "doi": "10.1145/2858036.2858483"
    },
    {
      "text": "Kerber, Frederic., Löchtefeld, Markus., Krüger, Antonio., McIntosh, Jess., McNeill, Charlie., and Fraser, Mike. 2016. Understanding same-side interactions with wrist-worn devices. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. 28  ",
      "doi": "10.1145/2971485.2971519"
    },
    {
      "text": "Komninos, A., & Dunlop, M. (2014). Text input on a smart watch. IEEE Pervasive Computing, 13(4), 50--58.",
      "doi": ""
    },
    {
      "text": "Laput, Gierad, Xiao, Robert., and Chris Harrison. 2016. Viband: High-fidelity bio-acoustic sensing using commodity smartwatch accelerometers. In: Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 2016. 321333.  ",
      "doi": "10.1145/2984511.2984582"
    },
    {
      "text": "Leiva, Luis. A., Sahami, Alireza., Catala, Alejandro., Henze, Niels., and Schmidt, Albrecht. 2015. Text entry on tiny qwerty soft keyboards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 669--678  ",
      "doi": "10.1145/2702123.2702388"
    },
    {
      "text": "MacKenzie, I. Scott, and R. William Soukoreff. 2003 Phrase sets for evaluating text entry techniques. In: CHI'03 extended abstracts on Human factors in computing systems. ACM, 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Mottelson, Aske., Larsen, Christoffer., Lyderik, Mikkel., Strohmeier, Paul., and Knibbe, Jarrod. 2016. Invisiboard: maximizing display and input space with a full screen text entry method for smartwatches. In: MobileHCI. 53--59.  ",
      "doi": "10.1145/2935334.2935360"
    },
    {
      "text": "Oney, Stephen, Harrison, Chris., Ogan, Amy., and Wiese, Jason. 2013. ZoomBoard: a diminutive qwerty soft keyboard using iterative zooming for ultra-small devices. In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 27992802.  ",
      "doi": "10.1145/2470654.2481387"
    },
    {
      "text": "Poirier, Franck; Belatar, Mohammed. UniWatch: A Soft Keyboard for Text Entry on SmartWatches Using 3 Keys. In: International Conference on HumanComputer Interaction. Springer International Publishing, 2016. p. 341--349.  ",
      "doi": "10.1007/978-3-319-39516-6_33"
    },
    {
      "text": "Prätorius, Manuel., Valkov, Dimitar., Burgbacher, Ulrich., and Hinrichs, Klaus. 2014. DigiTap: an eyesfree VR/AR symbolic input device. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology. 9--18.  ",
      "doi": "10.1145/2671015.2671029"
    },
    {
      "text": "Rekimoto, Jun. 2001. Gesturewrist and gesturepad: Unobtrusive wearable interaction devices. In Wearable Computers, 2001. Proceedings. Fifth International Symposium on IEEE. 21--27. ",
      "doi": "10.5555/580581.856565"
    },
    {
      "text": "Shao, Yuan-Fu., Chang-Ogimoto, Masatoshi., Pointner, Reinhard., Lin, Yu-Chih., Wu, Chen-Ting., and Chen, Mike. 2016. SwipeKey: a swipe-based keyboard design for smartwatches. In: Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM. 60--71.  ",
      "doi": "10.1145/2935334.2935336"
    },
    {
      "text": "Shibata, Tomoki., Afergan, Daniel., Kong, Danielle., Yuksel, Beste. F., MacKenzie, I. Scott., and Jacob, Robert. J.K. 2016. DriftBoard: A Panning-Based Text Entry Technique for Ultra-Small Touchscreens. In: Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM. 575--582.  ",
      "doi": "10.1145/2984511.2984591"
    },
    {
      "text": "Sun, Ke., Wang, Yuntao., Yu, Chun., Yan, Yukang., Wen, Hongyi., and Shi, Yuanchun. 2017. Float: OneHanded and Touch-Free Target Selection on Smartwatches. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 692--704.  ",
      "doi": "10.1145/3025453.3026027"
    },
    {
      "text": "Tsai, Hsin-Ruey., Wu, Cheng-Yuan., Huang, LeeTing., and Hung, Yi-Ping. 2016. ThumbRing: private interactions using one-handed thumb motion input on finger segments. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. 791--798.  ",
      "doi": "10.1145/2957265.2961859"
    },
    {
      "text": "Vertanen, Keith., Memmi, Haythem., Emge, Justin., Reyal, Shyam., and Kristensson, Per. Ola. 2015. VelociTap: Investigating fast mobile text entry using sentence-based decoding of touchscreen keyboard input. In: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM. 659--668.  ",
      "doi": "10.1145/2702123.2702135"
    },
    {
      "text": "Wong, Chui. Yin., Khong, Chee. Weng., and Thwaites, Harold. 2007. Aesthetics and virtual keyboard designs for PDAs. In Proceedings of the 4th international conference on mobile technology, applications, and systems and the 1st international symposium on Computer human interaction in mobile technology. 181--186.  ",
      "doi": "10.1145/1378063.1378093"
    },
    {
      "text": "Xin, Yi., Yu, Chun., Xu, Weihie., Bi, Xiaojun., and Shi, Yuanchun. 2017. COMPASS: Rotational Keyboard on Non-Touch Smartwatches. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 705--715.  ",
      "doi": "10.1145/3025453.3025454"
    },
    {
      "text": "Xin Yi, Yu, Chun., Weinan Shi and Yuanchun Shi. Is it too small?: Investigating the performances and preferences of users when typing on tiny QWERTY keyboards. International Journal of Human Computer Studies, 2017, 106: 44--62",
      "doi": ""
    },
    {
      "text": "Yeo, Hui-Shyong., Phang, Xiao-Shen., Castellucci, Steven. J., Kristensson, Per Ola., and Quigley, Aaron. 2017. Investigating tilt-based gesture keyboard entry for single-handed text entry on large devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems 4194--4202.  ",
      "doi": "10.1145/3025453.3025520"
    },
    {
      "text": "Zhu, Kening., Ma, Xiaojuan., Chen, Haoyuan., and Liang, Miaoyin. 2017. Tripartite Effects: Exploring Users' Mental Model of Mobile Gestures under the Influence of Operation, Handheld Posture, and Interaction Space. International Journal of Human-- Computer Interaction, 33(6). 443--459",
      "doi": ""
    }
  ]
}