{
  "doi": "10.1145/3173574.3173758",
  "title": "AdaM: Adapting Multi-User Interfaces for Collaborative Environments in Real-Time",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Developing cross-device multi-user interfaces (UIs) is a challenging problem. There are numerous ways in which content and interactivity can be distributed. However, good solutions must consider multiple users, their roles, their preferences and access rights, as well as device capabilities. Manual and rule-based solutions are tedious to create and do not scale to larger problems nor do they adapt to dynamic changes, such as users leaving or joining an activity. In this paper, we cast the problem of UI distribution as an assignment problem and propose to solve it using combinatorial optimization. We present a mixed integer programming formulation which allows real-time applications in dynamically changing collaborative settings. It optimizes the allocation of UI elements based on device capabilities, user roles, preferences, and access rights. We present a proof-of-concept designer-in-the-loop tool, allowing for quick solution exploration. Finally, we compare our approach to traditional paper prototyping in a lab study.",
  "tags": [
    "cross-device interaction",
    "optimization",
    "distributed user interface",
    "ui adaptation"
  ],
  "authors": [
    {
      "name": "Seonwook Park",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261172",
      "orcid": "missing"
    },
    {
      "name": "Christoph Gebhardt",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958643057",
      "orcid": "missing"
    },
    {
      "name": "Roman Rädle",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81416608648/rel-imgonly/roman.jpeg",
      "acmid": "81416608648",
      "orcid": "missing"
    },
    {
      "name": "Anna Maria Feit",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81556550256/rel-imgonly/crop1.jpg",
      "acmid": "81556550256",
      "orcid": "missing"
    },
    {
      "name": "Hana Vrzakova",
      "institution": "University of Eastern Finland, Joensuu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500663329",
      "orcid": "missing"
    },
    {
      "name": "Niraj Ramesh Dayama",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261059",
      "orcid": "missing"
    },
    {
      "name": "Hui-Shyong Yeo",
      "institution": "University of St. Andrews, St. Andrews, Fife, United Kingdom",
      "img": "/do/10.1145/contrib-99658693776/rel-imgonly/20150812_183746.jpg",
      "acmid": "99658693776",
      "orcid": "0000-0002-9512-828X"
    },
    {
      "name": "Clemens N. Klokmose",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    },
    {
      "name": "Aaron Quigley",
      "institution": "University of St Andrews, St Andrews, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502006",
      "orcid": "0000-0002-5274-6889"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Otmar Hilliges",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81309495440/rel-imgonly/81309495440.jpg",
      "acmid": "81309495440",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sriram Karthik Badam and Niklas Elmqvist. 2014. PolyChrome: A Cross-Device Framework for Collaborative Web Visualization. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, USA, 109--118.  ",
      "doi": "10.1145/2669485.2669518"
    },
    {
      "text": "Pei-Yu (Peggy) Chi and Yang Li. 2015. Weave: Scripting Cross-Device Wearable Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3923--3932.  ",
      "doi": "10.1145/2702123.2702451"
    },
    {
      "text": "Tao Dong, Elizabeth F. Churchill, and Jeffrey Nichols. 2016. Understanding the Challenges of Designing and Developing Multi-Device Experiences. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 62--72.  ",
      "doi": "10.1145/2901790.2901851"
    },
    {
      "text": "S. Eilemann, M. Makhinya, and R. Pajarola. 2009. Equalizer: A Scalable Parallel Rendering Framework. IEEE Transactions on Visualization and Computer Graphics 15, 3 (May 2009), 436--452.  ",
      "doi": "10.1109/TVCG.2008.104"
    },
    {
      "text": "Jacob Eisenstein, Jean Vanderdonckt, and Angel Puerta. 2001. Applying Model-based Techniques to the Development of UIs for Mobile Computers. In Proceedings of the 6th International Conference on Intelligent User Interfaces (IUI '01). ACM, New York, NY, USA, 69--76.  ",
      "doi": "10.1145/359784.360122"
    },
    {
      "text": "Niklas Elmqvist. 2011. Distributed User Interfaces: State of the Art. Springer London, London, 1--12.",
      "doi": ""
    },
    {
      "text": "Luca Frosini and Fabio Patern` o. 2014. User Interface Distribution in Multi-device and Multi-user Environments with Dynamically Migrating Engines. In Proceedings of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 55--64.  ",
      "doi": "10.1145/2607023.2607032"
    },
    {
      "text": "Krzysztof Gajos and Daniel S. Weld. 2004. SUPPLE: Automatically Generating User Interfaces. In Proceedings of the 9th International Conference on Intelligent User Interfaces (IUI '04). ACM, New York, NY, USA, 93--100.  ",
      "doi": "10.1145/964442.964461"
    },
    {
      "text": "Giuseppe Ghiani, Fabio Patern` o, and Carmen Santoro. 2010. On-demand Cross-device Interface Components Migration. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 299--308.  ",
      "doi": "10.1145/1851600.1851653"
    },
    {
      "text": "Jens Grubert, Matthias Heinisch, Aaron Quigley, and Dieter Schmalstieg. 2015. MultiFi: Multi Fidelity Interaction with Displays On and Around the Body. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3933--3942.  ",
      "doi": "10.1145/2702123.2702331"
    },
    {
      "text": "Jens Grubert, Matthias Kranz, and Aaron Quigley. 2016. Challenges in mobile multi-device ecosystems. mUX: The Journal of Mobile User Experience 5, 1 (26 Aug 2016), 5.",
      "doi": ""
    },
    {
      "text": "Inc. Gurobi Optimization. 2016. Gurobi Optimizer Reference Manual. (2016). http://www.gurobi.com",
      "doi": ""
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2773--2782.  ",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Richard Han, Veronique Perret, and Mahmoud Naghshineh. 2000. WebSplitter: A Unified XML Framework for Multi-device Collaborative Web Browsing. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (CSCW '00). ACM, New York, NY, USA, 221--230.  ",
      "doi": "10.1145/358916.358993"
    },
    {
      "text": "Tommi Heikkinen, Jorge Goncalves, Vassilis Kostakos, Ivan Elhart, and Timo Ojala. 2014. Tandem Browsing Toolkit: Distributed Multi-Display Interfaces with Web Technologies. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, New York, NY, USA, Article 142, 6 pages.  ",
      "doi": "10.1145/2611009.2611026"
    },
    {
      "text": "Otmar Hilliges, Lucia Terrenghi, Sebastian Boring, David Kim, Hendrik Richter, and Andreas Butz. 2007. Designing for Collaborative Creative Problem Solving. In Proceedings of the 6th ACM SIGCHI Conference on Creativity &Amp; Cognition (C&C '07). ACM, New York, NY, USA, 137--146.  ",
      "doi": "10.1145/1254960.1254980"
    },
    {
      "text": "Steven Houben and Nicolai Marquardt. 2015. WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1247--1256.  ",
      "doi": "10.1145/2702123.2702215"
    },
    {
      "text": "Maria Husmann, Daniel Huguenin, Matthias Geel, and Moira C. Norrie. 2017. Orchestrating Multi-device Presentations with OmniPresent. In Proceedings of the 6th ACM International Symposium on Pervasive Displays (PerDis '17). ACM, New York, NY, USA, Article 3, 8 pages.  ",
      "doi": "10.1145/3078810.3078812"
    },
    {
      "text": "Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3903--3912.  ",
      "doi": "10.1145/2702123.2702211"
    },
    {
      "text": "Andreas Karrenbauer and Antti Oulasvirta. 2014. Improvements to Keyboard Optimization with Integer Programming. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 621--626.  ",
      "doi": "10.1145/2642918.2647382"
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: Shareable Dynamic Media. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 280--290.  ",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Chinmay Eishan Kulkarni and Scott R. Klemmer. 2011. Automatically Adapting Web Pages to Heterogeneous Devices. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 1573--1578.  ",
      "doi": "10.1145/1979742.1979810"
    },
    {
      "text": "R. Langner, T. Horak, and R. Dachselt. 2017. VISTILES: Coordinating and Combining Co-located Mobile Devices for Visual Data Exploration. IEEE Transactions on Visualization and Computer Graphics PP, 99 (2017), 1--1.",
      "doi": ""
    },
    {
      "text": "Andr´ es Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around: Collaborative Use of Mobile Phones for Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1787--1796.  ",
      "doi": "10.1145/1978942.1979201"
    },
    {
      "text": "Andr´ es Lucero, Matt Jones, Tero Jokela, and Simon Robinson. 2013. Mobile Collocated Interactions: Taking an Offline Break Together. interactions 20, 2 (March 2013), 26--32.  ",
      "doi": "10.1145/2427076.2427083"
    },
    {
      "text": "K. Luyten and K. Coninx. 2005. Distributed user interface elements to support smart interaction spaces. In Seventh IEEE International Symposium on Multimedia (ISM'05). 8 pp.--.  ",
      "doi": "10.1109/ISM.2005.52"
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-device Interaction via Micro-mobility and F-formations. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 13--22.  ",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "J´ er´ emie Melchior, Donatien Grolaux, Jean Vanderdonckt, and Peter Van Roy. 2009. A Toolkit for Peer-to-peer Distributed User Interfaces: Concepts, Implementation, and Applications. In Proceedings of the 1st ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '09). ACM, New York, NY, USA, 69--78.  ",
      "doi": "10.1145/1570433.1570449"
    },
    {
      "text": "Jan Meskens, Jo Vermeulen, Kris Luyten, and Karin Coninx. 2008. Gummy for Multi-platform User Interface Designs: Shape Me, Multiply Me, Fix Me, Use Me. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '08). ACM, New York, NY, USA, 233--240.  ",
      "doi": "10.1145/1385569.1385607"
    },
    {
      "text": "Brad A. Myers, Herb Stiel, and Robert Gargiulo. 1998. Collaboration Using Multiple PDAs Connected to a PC. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work (CSCW '98). ACM, New York, NY, USA, 285--294.  ",
      "doi": "10.1145/289444.289503"
    },
    {
      "text": "Michael Nebeling. 2016. Cross-Device Interfaces: Existing Research, Current Tools, Outlook. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 513--516.  ",
      "doi": "10.1145/2992154.2996361"
    },
    {
      "text": "Michael Nebeling. 2017. XDBrowser 2.0: Semi-Automatic Generation of Cross-Device Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4574--4584.  ",
      "doi": "10.1145/3025453.3025547"
    },
    {
      "text": "Michael Nebeling and Anind K. Dey. 2016. XDBrowser: User-Defined Cross-Device Web Page Designs. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5494--5505.  ",
      "doi": "10.1145/2858036.2858048"
    },
    {
      "text": "Michael Nebeling, Theano Mintsi, Maria Husmann, and Moira Norrie. 2014. Interactive Development of Cross-device User Interfaces. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2793--2802.  ",
      "doi": "10.1145/2556288.2556980"
    },
    {
      "text": "Jeffrey Nichols, Brad A. Myers, Michael Higgins, Joseph Hughes, Thomas K. Harris, Roni Rosenfeld, and Mathilde Pignol. 2002. Generating Remote Control Interfaces for Complex Appliances. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, New York, NY, USA, 161--170.  ",
      "doi": "10.1145/571985.572008"
    },
    {
      "text": "Jeffrey Nichols, Brad A. Myers, and Kevin Litwack. 2004. Improving Automatic Interface Generation with Smart Templates. In Proceedings of the 9th International Conference on Intelligent User Interfaces (IUI '04). ACM, New York, NY, USA, 286--288.  ",
      "doi": "10.1145/964442.964507"
    },
    {
      "text": "Katie O'Leary, Tao Dong, Julia Katherine Haines, Michael Gilbert, Elizabeth F. Churchill, and Jeffrey Nichols. 2017. The Moving Context Kit: Designing for Context Shifts in Multi-Device Experiences. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 309--320.  ",
      "doi": "10.1145/3064663.3064768"
    },
    {
      "text": "A. Oulasvirta. 2017. User Interface Design with Combinatorial Optimization. Computer 50, 1 (Jan 2017), 40--47.  ",
      "doi": "10.1109/MC.2017.6"
    },
    {
      "text": "Fabio Patern` o and Carmen Santoro. 2012. A Logical Framework for Multi-device User Interfaces. In Proceedings of the 4th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '12). ACM, New York, NY, USA, 45--50.  ",
      "doi": "10.1145/2305484.2305494"
    },
    {
      "text": "Martin Porcheron, Andr´ es Lucero, and Joel E. Fischer. 2016. Co-curator: Designing for Mobile Ideation in Groups. In Proceedings of the 20th International Academic Mindtrek Conference (AcademicMindtrek '16). ACM, New York, NY, USA, 226--234.  ",
      "doi": "10.1145/2994310.2994350"
    },
    {
      "text": "Roman R¨ adle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, USA, 45--54.  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Roman R¨ adle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatially-agnostic: Elicitation and Evaluation of User-Defined Cross-Device Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3913--3922.  ",
      "doi": "10.1145/2702123.2702287"
    },
    {
      "text": "Roman R¨ adle, Midas Nouwens, Kristian Antonsen, James R Eagan, and Clemens Nylandsted Klokmose. 2017. Codestrates: Literate Computing with Webstrates. In Proceedings of the 30th annual ACM symposium on User interface software & technology (UIST '17). New York, NY, USA.  ",
      "doi": "10.1145/3126594.3126642"
    },
    {
      "text": "Jun Rekimoto. 1998. A Multiple Device Approach for Supporting Whiteboard-based Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 344--351.  ",
      "doi": "10.1145/274644.274692"
    },
    {
      "text": "Simon Robinson, Jennifer Pearson, Matt Jones, Anirudha Joshi, and Shashank Ahire. 2017. Better Together: Disaggregating Mobile Services for Emergent Users. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 44, 13 pages.  ",
      "doi": "10.1145/3098279.3098534"
    },
    {
      "text": "Stephanie Santosa and Daniel Wigdor. 2013. A Field Study of Multi-device Workflows in Distributed Workspaces. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 63--72.  ",
      "doi": "10.1145/2493432.2493476"
    },
    {
      "text": "Mario Schreiner, Roman R¨ adle, Hans-Christian Jetter, and Harald Reiterer. 2015. Connichiwa: A Framework for Cross-Device Web Applications. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 2163--2168.  ",
      "doi": "10.1145/2702613.2732909"
    },
    {
      "text": "Julia Schwarz, David Klionsky, Chris Harrison, Paul Dietz, and Andrew Wilson. 2012. Phone As a Pixel: Enabling Ad-hoc, Large-scale Displays Using Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2235--2238.  ",
      "doi": "10.1145/2207676.2208378"
    },
    {
      "text": "Lucia Terrenghi, Aaron Quigley, and Alan Dix. 2009. A Taxonomy for and Analysis of Multi-person-display Ecosystems. Personal Ubiquitous Comput. 13, 8 (Nov. 2009), 583--598.  ",
      "doi": "10.1007/s00779-009-0244-5"
    },
    {
      "text": "Minna W¨ aljas, Katarina Segersthl, Kaisa V¨ a¨ an¨ anen-Vainio-Mattila, and Harri Oinas-Kukkonen. 2010. Cross-platform Service User Experience: A Field Study and an Initial Framework. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 219--228.  ",
      "doi": "10.1145/1851600.1851637"
    },
    {
      "text": "Jishuo Yang and Daniel Wigdor. 2014. Panelrama: Enabling Easy Specification of Cross-device Web Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2783--2792.  ",
      "doi": "10.1145/2556288.2557199"
    }
  ]
}