{
  "doi": "10.1145/3173574.3173924",
  "title": "Assisting Students with Intellectual and Developmental Disabilities in Inclusive Education with Smartwatches",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Smartwatches have a large potential to support everyday activities. However, their potential as assistive technologies in inclusive academic environments is unclear. To investigate how smartwatches can support students with intellectual and developmental disabilities (IDDs) to perform activities that require emotional and behavioral skills and involve communication, collaboration and planning, we implemented WELI. WELI (Wearable Life) is a wearable application designed to assist young adults with IDDs attending a postsecondary education program. This paper reports on the user-centric design process adopted in the development of WELI, and describes how smartwatches can assist students with IDDs in special education. The results reported are drawn from 8 user studies with 58 participants in total. WELI features include behavioral intervention, mood regulation, reminders, checklists, surveys and rewards. Results indicate that several considerations must be taken into account when designing for students with IDD, and that overall the students are enthusiastic about adopting an innovative smartwatch application in class, as they reacted positively about the technology and features provided.",
  "authors": [
    {
      "name": "Hui Zheng",
      "institution": "George Mason University, Fairfax, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214408",
      "orcid": "missing"
    },
    {
      "name": "Vivian Genaro Motti",
      "institution": "George Mason University, Fairfax, VA, USA",
      "img": "/do/10.1145/contrib-81435609174/rel-imgonly/avatar.jpg",
      "acmid": "81435609174",
      "orcid": "0000-0003-1336-3743"
    }
  ],
  "references": [
    {
      "text": "LouAnne E. Boyd, Xinlong Jiang, and Gillian R. Hayes. 2017. ProCom: Designing and Evaluating a Mobile and Wearable System to Support Proximity Awareness for People with Autism. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2865--2877.  ",
      "doi": "10.1145/3025453.3026014"
    },
    {
      "text": "Coleen A Boyle, Sheree Boulet, Laura A Schieve, Robin A Cohen, Stephen J Blumberg, Marshalyn Yeargin-Allsopp, Susanna Visser, and Michael D Kogan. 2011. Trends in the prevalence of developmental disabilities in US children, 1997--2008. Pediatrics 127, 6 (2011), 1034--1042.",
      "doi": ""
    },
    {
      "text": "Luke Buschmann, Lourdes Morales, and Sri Kurniawan. 2014. Online Learning System for Teaching Basic Skills to People with Developmental Disabilities. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 271--272.  ",
      "doi": "10.1145/2661334.2661391"
    },
    {
      "text": "Karina Caro, Ana I. Martínez-García, Mónica Tentori, and Iván Zavala-Ibarra. 2014. Designing Exergames Combining the Use of Fine and Gross Motor Exercises to Support Self-care Activities. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 247--248.  ",
      "doi": "10.1145/2661334.2661403"
    },
    {
      "text": "Yao-Jen Chang, Ya-Shu Kang, Yao-Sheng Chang, Hung-Huan Liu, Cheng-Chieh Wang, and Chia Chun Kao. 2015. Designing Kinect2Scratch Games to Help Therapists Train Young Adults with Cerebral Palsy in Special Education School Settings. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 317--318.  ",
      "doi": "10.1145/2700648.2811356"
    },
    {
      "text": "Victor Dibia. 2016. FOQUS: A Smartwatch Application for Individuals with ADHD and Mental Health Challenges. In Proc. of ASSETS'16. USA, 311--312.  ",
      "doi": "10.1145/2982142.2982207"
    },
    {
      "text": "Victor Dibia, Shari Trewin, Maryam Ashoori, and Thomas Erickson. 2015. Exploring the Potential of Wearables to Support Employment for People with Mild Cognitive Impairment. In Proc. of ASSETS'15. Portugal, 401--402.  ",
      "doi": "10.1145/2700648.2811390"
    },
    {
      "text": "Alexander Fiannaca, Ilias Apostolopoulous, and Eelke Folmer. 2014. Headlock: A Wearable Navigation Aid That Helps Blind Cane Users Traverse Large Open Spaces. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 19--26.  ",
      "doi": "10.1145/2661334.2661453"
    },
    {
      "text": "Euan Freeman, Graham Wilson, Stephen Brewster, Gabriel Baud-Bovy, Charlotte Magnusson, and Hector Caltenco. 2017. Audible Beacons and Wearables in Schools: Helping Young Visually Impaired Children Play and Move Independently. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4146--4157.  ",
      "doi": "10.1145/3025453.3025518"
    },
    {
      "text": "Markus Funk, Sven Mayer, and Albrecht Schmidt. 2015. Using In-Situ Projection to Support Cognitively Impaired Workers at the Workplace. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 185--192.  ",
      "doi": "10.1145/2700648.2809853"
    },
    {
      "text": "Dorothy F. Garrison-Wade. 2012. Listening to their voices: Factors that inhibit or enhance postsecondary outcomes for students with disabilities. International Journal of Special Education 27, 2 (2012), 113--125.",
      "doi": ""
    },
    {
      "text": "Dedra Hafner, Courtney Moffatt, and Nutullah Kisa. 2011. Cutting-Edge. Career Development for Exceptional Individuals 34, 1 (2011), 18--30.",
      "doi": ""
    },
    {
      "text": "Stefan Johansson, Jan Gulliksen, and Ann Lantz. 2015. User Participation When Users Have Mental and Cognitive Disabilities. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 69--76.  ",
      "doi": "10.1145/2700648.2809849"
    },
    {
      "text": "Thomas Kosch, Romina Kettner, Markus Funk, and Albrecht Schmidt. 2016. Comparing Tactile, Auditory, and Visual Assembly Error-Feedback for Workers with Cognitive Impairments. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 53--60.  ",
      "doi": "10.1145/2982142.2982157"
    },
    {
      "text": "Leah Kuyper. 2014. the Zones of reglation. website. (2014). Retrieved Sept. 2nd, 2017 from http://www.zonesofregulation.com/index.html.",
      "doi": ""
    },
    {
      "text": "Stephen Lipscomb, Joshua Haimson, Albert Y. Liu, John Burghardt, David R. Johnson, and Martha L. Thurlow. 2017. Preparing for life after high school: The characteristics and experiences of youth in special education. Findings from the National Longitudinal Transition Study 2012. Volume 1: Comparisons with other youth: Full report. (03 2017).",
      "doi": ""
    },
    {
      "text": "Sinziana Mazilu, Ulf Blanke, Michael Hardegger, Gerhard Tröster, Eran Gazit, and Jeffrey M. Hausdorff. 2014. GaitAssist: A Daily-life Support and Training System for Parkinson's Disease Patients with Freezing of Gait. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2531--2540.  ",
      "doi": "10.1145/2556288.2557278"
    },
    {
      "text": "Lourdes M. Morales-Villaverde, Karina Caro, Taylor Gotfrid, and Sri Kurniawan. 2016. Online Learning System to Help People with Developmental Disabilities Reinforce Basic Skills. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 43--51.  ",
      "doi": "10.1145/2982142.2982174"
    },
    {
      "text": "Nathalie Nader-Grosbois. 2014. Self-perception, self-regulation and metacognition in adolescents with intellectual disability. 35 (04 2014), 1334--1348.",
      "doi": ""
    },
    {
      "text": "Wagner M. Cameto R. Knokey A. M. Shaver D. Newman, L. 2010. Comparisons across Time of the Outcomes of Youth with Disabilities up to 4 Years after High School. A Report of Findings from the National Longitudinal Transition Study (NLTS) and the National Longitudinal Transition Study-2 (NLTS2). NCSER 2010--3008. (September 2010).",
      "doi": ""
    },
    {
      "text": "American Association on Intellectual and Developmental Disabilities. 2010. Intellectual Disability: Definition, Classification, and Systems of Supports. American Association on Intellectual and Developmental Disabilities. https://books.google.com/books?id=Og8-QQAACAAJ",
      "doi": ""
    },
    {
      "text": "Kathryn E. Ringland, Christine T. Wolf, LouAnne E. Boyd, Mark S. Baldwin, and Gillian R. Hayes. 2016. Would You Be Mine: Appropriating Minecraft As an Assistive Technology for Youth with Autism. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 33--41.  ",
      "doi": "10.1145/2982142.2982172"
    },
    {
      "text": "Robert L Schalock. 2010. Intellectual disability. The Encyclopedia of Clinical Psychology (2010).",
      "doi": ""
    },
    {
      "text": "Sumita Sharma, Saurabh Srivastava, Krishnaveni Achary, Blessin Varkey, Tomi Heimonen, Jaakko Hakulinen, Markku Turunen, and Nitendra Rajput. 2016. Gesture-based Interaction for Individuals with Developmental Disabilities in India. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 61--70.  ",
      "doi": "10.1145/2982142.2982166"
    },
    {
      "text": "Will Simm, Maria Angela Ferrario, Adrian Gradinar, Marcia Tavares Smith, Stephen Forshaw, Ian Smith, and Jon Whittle. 2016. Anxiety and Autism: Towards Personalized Digital Health. In Proc. of CHI'16. USA, 1270--1281.  ",
      "doi": "10.1145/2858036.2858259"
    },
    {
      "text": "Kiley Sobel, Kyle Rector, Susan Evans, and Julie A. Kientz. 2016. Incloodle: Evaluating an Interactive Application for Young Children with Mixed Abilities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 165--176.  ",
      "doi": "10.1145/2858036.2858114"
    },
    {
      "text": "Tobias Sonne, Jörg Müller, Paul Marshall, Carsten Obel, and Kaj Grønbæk. 2016. Changing Family Practices with Assistive Technology: MOBERO Improves Morning and Bedtime Routines for Children with ADHD. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 152--164.  ",
      "doi": "10.1145/2858036.2858157"
    },
    {
      "text": "Vicky Spencer, Anna Evmenova, Richard T. Boon, and Laura Harris. 2014. A review of research-based interventions for students with Autism Spectrum Disorders (ASD) in content area instruction: Implications and considerations for classroom practice. 49 (09 2014), 331--354.",
      "doi": ""
    },
    {
      "text": "Kenji Suzuki, Taku Hachisu, and Kazuki Iida. 2016. EnhancedTouch: A Smart Bracelet for Enhancing Human-Human Physical Touch. In Proc. of CHI'16. USA, 1282--1293.  ",
      "doi": "10.1145/2858036.2858439"
    },
    {
      "text": "Camellia Zakaria and Richard C. Davis. 2016. Demo: Wearable Application to Manage Problem Behavior in Children with Neurodevelopmental Disorders. In Proc. of MobiSys'16. Singapore, 127--127.  ",
      "doi": "10.1145/2938559.2938575"
    },
    {
      "text": "Xiaoyi Zhang, Harish Kulkarni, and Meredith Ringel Morris. 2017. Smartphone-Based Gaze Gesture Communication for People with Motor Disabilities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2878--2889.  ",
      "doi": "10.1145/3025453.3025790"
    },
    {
      "text": "Hui Zheng and Vivian Genaro Motti. 2017a. Wearable Life: A Wrist-Worn Application to Assist Students in Special Education. In International Conference on Universal Access in Human-Computer Interaction. Springer, 259--276.",
      "doi": ""
    },
    {
      "text": "Hui Zheng and Vivian Genaro Motti. 2017b. WeLi: A Smartwatch Application to Assist Students with Intellectual and Developmental Disabilities. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 355--356.  ",
      "doi": "10.1145/3132525.3134770"
    }
  ]
}