{
  "doi": "10.1145/3173574.3174186",
  "title": "Acceptability and Acceptance of Autonomous Mobility on Demand: The Impact of an Immersive Experience",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Autonomous vehicles have the potential to fundamentally change existing transportation systems. Beyond legal concerns, these societal evolutions will critically depend on user acceptance. As an emerging mode of public transportation [7], Autonomous mobility on demand (AMoD) is of particular interest in this context. The aim of the present study is to identify the main components of acceptability (before first use) and acceptance (after first use) of AMoD, following a user experience (UX) framework. To address this goal, we conducted three workshops (N=14) involving open discussions and a ride in an experimental autonomous shuttle. Using a mixed-methods approach, we measured pre-immersion acceptability before immersing the participants in an on-demand transport scenario, and eventually measured post-immersion acceptance of AMoD. Results show that participants were reassured about safety concerns, however they perceived the AMoD experience as ineffective. Our findings highlight key factors to be taken into account when designing AMoD experiences.",
  "tags": [
    "mobility on demand",
    "acceptability",
    "user experience",
    "acceptance",
    "autonomous driving",
    "human needs"
  ],
  "authors": [
    {
      "name": "Verena Distler",
      "institution": "University of Luxembourg, Esch-Sur-Alzette, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260538",
      "orcid": "0000-0002-4461-0551"
    },
    {
      "name": "Carine Lallemand",
      "institution": "University of Luxembourg, Esch-sur-Alzette, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486656273",
      "orcid": "missing"
    },
    {
      "name": "Thierry Bellet",
      "institution": "The French Institute of Science & Technology for Transport, Development & Networks, Bron, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317491524",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adell, E. (2010). Acceptance of driver support systems. In Proceedings of the European Conference on Human Centred Design for Intelligent Transport Systems. Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "Auvray, M., Lefèvre, J., Lenay, C., & O'Regan, K. (2005). Suppléance perceptive, immersion et informations proprioceptives, Arob@se, 1, 94--113.",
      "doi": ""
    },
    {
      "text": "Barcenilla, J., & Bastien, J.-M.-C. (2009). L'acceptabilité des nouvelles technologies: quelles relations avec l'ergonomie, l'utilisabilité et l'expérience utilisateur? Le travail humain, 72(4), 311.",
      "doi": ""
    },
    {
      "text": "Bellet, T., Paris, J.-C., & Marin-Lamellet, C. (2017). The difficulties of elderly drivers when driving and their expectations concerning driving aids. Transportation Research Part F: Traffic Psychology and Behaviour.",
      "doi": ""
    },
    {
      "text": "Chong, Z. J., Qin, B., Bandyopadhyay, T., Wongpiromsarn, T., Rankin, E. S., Ang, M. H., Low, K. H. (2011). Autonomous personal vehicle for the first- and last-mile transportation services. MIT Web Domain.",
      "doi": ""
    },
    {
      "text": "Davis Jr, F. D. (1986). A technology acceptance model for empirically testing new end-user information systems: Theory and results (Doctoral dissertation). Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Etherington, D. (2017, November 1). Las Vegas launches the first electric autonomous shuttle on U.S. public roads. Retrieved March 21, 2017, from https://techcrunch.com/2017/01/11/las-vegaslaunches-the-first-electric-autonomous-shuttle-onu-s-public-roads",
      "doi": ""
    },
    {
      "text": "Frei, C., Hyland, M., & Mahmassani, H. S. (2017). Flexing service schedules: Assessing the potential for demand-adaptive hybrid transit via a stated preference approach. Transportation Research Part C: Emerging Technologies, 76, 71--89.",
      "doi": ""
    },
    {
      "text": "Green, P., & Wei-Haas, L. (1985). The Rapid Development of User Interfaces: Experience with the Wizard of OZ Method. Proceedings of the Human Factors Society Annual Meeting, 29(5), 470--474.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. (2001). The effect of perceived hedonic quality on product appealingness. International Journal of Human-Computer Interaction, 13(4), 481--499.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. (2004). The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction, 19(4), 319--349.  ",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "Hassenzahl, M. (2008). User experience (UX): towards an experiential perspective on product quality. In Proceedings of the 20th Conference on l'Interaction Homme-Machine (pp. 11--15). ACM.  ",
      "doi": "10.1145/1512714.1512717"
    },
    {
      "text": "Hassenzahl, M., Eckoldt, K., Diefenbach, S., Laschke, M., Len, E., & Kim, J. (2013). Designing moments of meaning and pleasure. Experience design and happiness. International Journal of Design, 7(3).",
      "doi": ""
    },
    {
      "text": "Hornbæk, K., & Hertzum, M. (2017). Technology Acceptance and User Experience: A Review of the Experiential Component in HCI. ACM Transactions on Computer-Human Interaction, 24(5), 1--30.  ",
      "doi": "10.1145/3127358"
    },
    {
      "text": "Kim, J., Park, S., Hassenzahl, M., & Eckoldt, K. (2011). The essence of enjoyable experiences: the human needs. In International Conference of Design, User Experience, and Usability (pp. 77-- 83). Springer.",
      "doi": ""
    },
    {
      "text": "König, M., & Neumayr, L. (2017). Users' resistance towards radical innovations: The case of the self-driving car. Transportation Research Part F: Traffic Psychology and Behaviour, 44, 42--52.",
      "doi": ""
    },
    {
      "text": "Krueger, R., Rashidi, T. H., & Rose, J. M. (2016). Preferences for shared autonomous vehicles. Transportation Research Part C: Emerging Technologies, 69, 343--355.",
      "doi": ""
    },
    {
      "text": "Lallemand, C. (2015). Towards consolidated methods for the design and evaluation of user experience (Doctoral dissertation).",
      "doi": ""
    },
    {
      "text": "Law, E. L.-C., Vermeeren, A. P., Hassenzahl, M., & Blythe, M. (2007). Towards a UX manifesto. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI... but not as we know it-Volume 2 (pp. 205--206). British Computer Society. ",
      "doi": "10.5555/1531407.1531468"
    },
    {
      "text": "Liamputtong, P. (2011). Focus Group Methodology. London: Sage.",
      "doi": ""
    },
    {
      "text": "Leung, L. (2015). Validity, reliability, and generalizability in qualitative research (Vol. 4).",
      "doi": ""
    },
    {
      "text": "Madigan, R., Louw, T., Dziennus, M., Graindorge, T., Ortega, E., Graindorge, M., & Merat, N. (2016). Acceptance of Automated Road Transport Systems (ARTS): an adaptation of the UTAUT model.",
      "doi": ""
    },
    {
      "text": "Mahlke, S. (2008). User experience of interaction with technical systems (Doctoral dissertation).",
      "doi": ""
    },
    {
      "text": "Martin, N., Jamet, É., Erhel, S., & Rouxel, G. (2016). From Acceptability to Acceptance: Does Experience with the Product Influence User Initial Representations? In C. Stephanidis (Ed.), HCI International 2016 -- Posters' Extended Abstracts (Vol. 617, pp. 128--133). Cham: Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Miles, H., Huberman, M., Saldana, J. (2014) Qualitative Data Analysis. London: Sage.",
      "doi": ""
    },
    {
      "text": "Osswald, S., Wurhofer, D., Trösterer, S., Beck, E., & Tscheligi, M. (2012). Predicting information technology usage in the car: towards a car technology acceptance model. Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (pp. 51--58). ACM.  ",
      "doi": "10.1145/2390256.2390264"
    },
    {
      "text": "Partala, T., & Kallinen, A. (2012). Understanding the most satisfying and unsatisfying user experiences: Emotions, psychological needs, and context. Interacting with Computers, 24(1), 25--34.  ",
      "doi": "10.1016/j.intcom.2011.10.001"
    },
    {
      "text": "Pavone, M. (2016). Autonomous Mobility-onDemand Systems for Future Urban Mobility. In M. Maurer, J. C. Gerdes, B. Lenz, & H. Winner (Eds.), Autonomous Driving (pp. 387--404). Berlin, Heidelberg: Springer Berlin Heidelberg.",
      "doi": ""
    },
    {
      "text": "Petterson, I. (2016). The temporality of in-vehicle User Experience. Retrieved from http://publications.lib.chalmers.se/records/fulltext/ 236743/236743.pdf",
      "doi": ""
    },
    {
      "text": "Rödel, C., Stadler, S., Meschtscherjakov, A., & Tscheligi, M. (2014). Towards Autonomous Cars: The Effect of Autonomy Levels on Acceptance and User Experience (pp. 1--8). ACM Press.  ",
      "doi": "10.1145/2667317.2667330"
    },
    {
      "text": "Schade, J., & Schlag, B. (2003). Acceptability of urban transport pricing strategies. Transportation Research Part F: Traffic Psychology and Behaviour, 6(1), 45--61.",
      "doi": ""
    },
    {
      "text": "Schuitema, G., Steg, L., & Forward, S. (2010). Explaining differences in acceptability before and acceptance after the implementation of a congestion charge in Stockholm. Transportation Research Part A: Policy and Practice, 44(2), 99-- 109.",
      "doi": ""
    },
    {
      "text": "Sheldon, K. M., Elliot, A. J., Kim, Y., & Kasser, T. (2001). What is satisfying about satisfying events? Testing 10 candidate psychological needs. Journal of Personality and Social Psychology, 80(2), 325.",
      "doi": ""
    },
    {
      "text": "Somat, A., Jamet, E., Menguy, G., Forzy, J.-F., & El-Jaafari, M. (2012). Acceptabilité individuelle, sociale & acceptation. Livrable L5.3 du projet PARTAGE (ANR--08--VTT--012--01).",
      "doi": ""
    },
    {
      "text": "Spieser, K., Treleaven, K., Zhang, R., Frazzoli, E., Morton, D., & Pavone, M. (2014). Toward a systematic approach to the design and evaluation of automated mobility-on-demand systems: A case study in Singapore. In Road Vehicle Automation (pp. 229--245). Springer.",
      "doi": ""
    },
    {
      "text": "Venkatesh, V., Morris, M. G., Davis, G. B., & Davis, F. D. (2003). User acceptance of information technology: Toward a unified view. MIS Quarterly, 425--478. ",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Venkatesh, V., Thong, J. Y., & Xu, X. (2012). Consumer acceptance and use of information technology: extending the unified theory of acceptance and use of technology. MIS Quarterly, 36(1), 157--178. ",
      "doi": "10.5555/2208955.2208966"
    }
  ]
}