{
  "doi": "10.1145/3173574.3173908",
  "title": "Better Understanding of Foot Gestures: An Elicitation Study",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We present a study aimed to better understand users' perceptions of foot gestures employed on a horizontal surface. We applied a user elicitation methodology, in which participants were asked to suggest foot gestures to actions (referents) in three conditions: standing up in front of a large display, sitting down in front of a desktop display, and standing on a projected surface. Based on majority count and agreement scores, we identified three gesture sets, one for each condition. Each gesture set shows a mapping between a common action and its chosen gesture. As a further contribution, we suggest a new measure called specification score, which indicates the degree to which a gesture is specific, preferable and intuitive to an action in a specific condition of use. Finally, we present measurable insights that can be implemented as guidelines for future development and research of foot interaction.",
  "tags": [
    "foot interaction",
    "foot gestures",
    "user-defined gesture set",
    "elicitation study"
  ],
  "authors": [
    {
      "name": "Yasmin Felberbaum",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706703",
      "orcid": "missing"
    },
    {
      "name": "Joel Lanir",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350574181",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jason Alexander, Teng Han, William Judd, Pourang Irani, Sriram Subramanian. 2012. Putting your best foot forward: investigating real-world mappings for foot-based gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1229--1238.  ",
      "doi": "10.1145/2207676.2208575"
    },
    {
      "text": "Thomas Augsten, Konstantin Kaefer, René Meusel, Caroline Fetzer, Dorian Kanitz, Thomas Stoff, Torsten Becker, Christian Holz, and Patrick Baudisch. 2010. Multitoe: high-precision interaction with backprojected floors based on high-resolution multi-touch input. In Proceedings of the 23nd annual ACM symposium on User interface software and technology, 209--218  ",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "Jean P. Chapman, Loren J. Chapman and John J. Allen. 1987. The Measurement of Foot Preference. Neuropsychologia Rev 25, 3: 579--584",
      "doi": ""
    },
    {
      "text": "Andrew Crossan, Stephen Brewster, Alexander Ng. 2010. Foot tapping for mobile interaction. In Proceedings of the 24th BCS Interaction Specialist Group Conference, 418--422 ",
      "doi": "10.5555/2146303.2146366"
    },
    {
      "text": "Ilya Efanov, Joel Lanir. 2015. Augmenting Indirect Multi-Touch Interaction with 3D Hand Contours and Skeletons. In Extended Abstracts of the ACM CHI'15 Conference on Human Factors in Computing Systems, 989--994.  ",
      "doi": "10.1145/2702613.2732897"
    },
    {
      "text": "Göbel Fabian, Konstantin Klamka, Andreas Siegel, Stefan Vogt, Sophie Stellmach, and Raimund Dachselt. 2013. Gaze-supported foot interaction in zoomable information spaces. In CHI'13 Extended Abstracts on Human Factors in Computing Systems, 3059--3062.  ",
      "doi": "10.1145/2468356.2479610"
    },
    {
      "text": "Koumei Fukahori, Daisuke Sakamoto, and Takeo Igarashi. 2015. Exploring Subtle Foot Plantar-based Gestures with Sock-placed Pressure Sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 3019--3028.  ",
      "doi": "10.1145/2702123.2702308"
    },
    {
      "text": "Yasmin Felberbaum, and Joel Lanir. 2016. Step by Step: Investigating Foot Gesture Interaction. In Proceedings of the International Working Conference on Advanced Visual Interfaces, 306--307.  ",
      "doi": "10.1145/2909132.2926057"
    },
    {
      "text": "Teng Han, Jason Alexander, Abhijit Karnik, Pourang Irani and Sriram Subramanian. 2011. Kick?: Investigating the Use of Kick Gestures for Mobile Interactions. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, 29--32.  ",
      "doi": "10.1145/2037373.2037379"
    },
    {
      "text": "Jota Ricardo, Pedro Lopes, Daniel Wigdor, and Joaquim Jorge. 2014. Let's kick it: how to stop wasting the bottom third of your large screen display. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 1411--1414.  ",
      "doi": "10.1145/2556288.2557316"
    },
    {
      "text": "Byron Lahey, Audrey Girouard, Winslow Burleson, and Roel Vertegaal. 2011. PaperPhone: understanding the use of bend gestures in mobile devices with flexible electronic paper displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1303--1312.  ",
      "doi": "10.1145/1978942.1979136"
    },
    {
      "text": "Jr LaViola, Joseph J., Daniel Acevedo Feliz, Daniel F. Keefe, and Robert C. Zeleznik. 2001. Hands-free multi-scale navigation in virtual environments. In Proceedings of the 2001 symposium on Interactive 3D graphics, 9--15.  ",
      "doi": "10.1145/364338.364339"
    },
    {
      "text": "ChanSu Lee, SangWon Ghyme, ChanJong Park, and KwangYun Wohn. 1998. The control of avatar motion using hand gesture. In Proceedings of the ACM symposium on Virtual reality software and technology, 59--65.  ",
      "doi": "10.1145/293701.293709"
    },
    {
      "text": "Zhihan Lv, Muhammad Sikandar Lal Khan, and Shafiq Ur Réhman. 2013. Hand and foot gesture interaction for handheld devices. In Proceedings of the 21st ACM international conference on Multimedia, 621--624.  ",
      "doi": "10.1145/2502081.2502163"
    },
    {
      "text": "Zhihan Lv, Shengzhong Feng, Muhammad Sikandar Lal Khan, Shafiq Ur Réhman and Haibo Li. 2014. Foot motion sensing: augmented game interface based on foot interaction for smartphone. In CHI'14 Extended Abstracts on Human Factors in Computing Systems, 293--296.  ",
      "doi": "10.1145/2559206.2580096"
    },
    {
      "text": "Volker Paelke, Christian Reimann, and Dirk Stichling. 2004. Kick-up menus. In CHI'04 Extended Abstracts on Human Factors in Computing Systems, 1552--1552.  ",
      "doi": "10.1145/985921.986128"
    },
    {
      "text": "Toni Pakkanen and Roope Raisamo. 2004. Appropriateness of foot interaction for non-accurate spatial tasks. In CHI'04 extended abstracts on Human factors in computing systems, 1123--1126.  ",
      "doi": "10.1145/985921.986004"
    },
    {
      "text": "Bruce Richardson, Krispin Leydon, Mikael Fernstrom, and Joseph A. Paradiso. 2004. Z-Tiles: building blocks for modular, pressure-sensing floorspaces. In CHI'04 extended abstracts on Human factors in computing systems, 1529--1532.  ",
      "doi": "10.1145/985921.986107"
    },
    {
      "text": "Jaime Ruiz, Yang Li, and Edward Lank. 2011. Userdefined motion gestures for mobile interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 197--206.  ",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "William Saunders, and Daniel Vogel. 2016. Tap-KickClick: Foot Interaction for a Standing Desk. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 323--333.  ",
      "doi": "10.1145/2901790.2901815"
    },
    {
      "text": "Johannes Schöning, Florian Daiber, Antonio Krüger, and Michael Rohs. 2009. Using hands and feet to navigate and manipulate spatial data. In CHI'09 Extended Abstracts on Human Factors in Computing Systems, 4663--4668.  ",
      "doi": "10.1145/1520340.1520717"
    },
    {
      "text": "Jeremy Scott, David Dearman, Koji Yatani and Khai N. Truong. 2010. Sensing foot gestures from the pocket. In Proceedings of the 23nd annual ACM symposium on User interface software and technology, 199--208.  ",
      "doi": "10.1145/1866029.1866063"
    },
    {
      "text": "Mara G. Silva and Doug A. Bowman. 2009. Bodybased interaction for desktop games. In CHI'09 Extended Abstracts on Human Factors in Computing Systems, 4249--4254.  ",
      "doi": "10.1145/1520340.1520648"
    },
    {
      "text": "Adalberto L. Simeone, Eduardo Velloso, Jason Alexander, and Hans Gellersen. 2014. Feet movement in desktop 3D interaction. In 3D User Interfaces (3DUI), 2014 IEEE Symposium on, 71--74.",
      "doi": ""
    },
    {
      "text": "Helman I. Stern, Juan P. Wachs and Yael Edan. 2008. Optimal consensus intuitive hand gesture vocabulary design. In IEEE International Conference on Semantic Computing, 2008, 96--103.  ",
      "doi": "10.1109/ICSC.2008.29"
    },
    {
      "text": "Radu-Daniel Vatavu, and Jacob O. Wobbrock. 2015. Formalizing agreement analysis for elicitation studies: new measures, significance test, and toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1325--1334.  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Radu-Daniel Vatavu, and Jacob O. Wobbrock. 2016. Between-subjects elicitation studies: Formalization and tool support. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 3390--3402.  ",
      "doi": "10.1145/2858036.2858228"
    },
    {
      "text": "Eduardo Velloso, Jason Alexander, Andreas Bulling, and Hans Gellersen. 2015. Interactions under the desk: A characterisation of foot movements for input in a seated position. In Human-Computer Interaction. pp. 384--401. Springer.",
      "doi": ""
    },
    {
      "text": "Eduardo Velloso, Dominik Schmidt, Jason Alexander, Hans Gellersen and Andreas Bulling. 2015. The feet in human-computer interaction: A survey of foot-based interaction. ACM Computing Surveys (CSUR) 48, 2: 21.  ",
      "doi": "10.1145/2816455"
    },
    {
      "text": "Daniel Wigdor and Dennis Wixon. 2011. Brave NUI world: designing natural user interfaces for touch and gesture. Elsevier. ",
      "doi": "10.5555/1995309"
    },
    {
      "text": "Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the guessability of symbolic input. In CHI'05 extended abstracts on Human Factors in Computing Systems,1869--1872.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris and Andrew D. Wilson. 2009. User-defined gestures for surface computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Tetsuya Yamamoto, Tsutomu Terada, and Masahiko Tsukamoto. 2011. Designing gestures for hands and feet in daily life. In Proceedings of the 9th International Conference on Advances in Mobile Computing and Multimedia, 285--288.  ",
      "doi": "10.1145/2095697.2095757"
    },
    {
      "text": "KangKang Yin and Dinesh K. Pai. 2003. Footsee: an interactive animation system. In Proceedings of the 2003 ACM SIGGRAPH/Eurographics symposium on Computer animation, 329--338. ",
      "doi": "10.5555/846276.846323"
    }
  ]
}