{
  "doi": "10.1145/3173574.3174049",
  "title": "Making the News: Digital Creativity Support for Journalists",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "This paper reports the design and first evaluations of new digital support for journalists to discover and examine crea-tive angles on news stories under development. The support integrated creative news search algorithms, interactive crea-tive sparks and reusable concept cards into one daily work tool of journalists. The first evaluations of INJECT by jour-nalists in their places of work to write published news sto-ries revealed that the journalists generated new angles on existing stories rather than new stories, changed their writ-ing behaviour, and reported evidence that INJECT use had the potential to increase the objectivity and the boldness of journalism methods used.",
  "authors": [
    {
      "name": "Neil Maiden",
      "institution": "City University London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533733",
      "orcid": "missing"
    },
    {
      "name": "Konstantinos Zachos",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100043452",
      "orcid": "missing"
    },
    {
      "name": "Amanda Brown",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82259413157",
      "orcid": "missing"
    },
    {
      "name": "George Brock",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659133361",
      "orcid": "missing"
    },
    {
      "name": "Lars Nyre",
      "institution": "University of Bergen, Bergen, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658976649",
      "orcid": "missing"
    },
    {
      "name": "Aleksander Nygård Tonheim",
      "institution": "University of Bergen, Bergen, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261032",
      "orcid": "missing"
    },
    {
      "name": "Dimitris Apsotolou",
      "institution": "National Technical University of Athens, Athens, Greece",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261292",
      "orcid": "missing"
    },
    {
      "name": "Jeremy Evans",
      "institution": "Explaain, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261695",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sara F. Alaou, Thecia Schlphorst, Shannon Cuykendall, Kristin Carlson, Karen Studd and Karen Bradley. 2015. Strategies for Embodied Design: The Value and Challenges of Observing Movement. In Proceedings of the ACM Conference on Creativity and Cognition (C&C'15), 121--130.  ",
      "doi": "10.1145/2757226.2757238"
    },
    {
      "text": "Teresa M. Amabile and Michael G. Pratt. 2016. The Dynamic Componential Model of Creativity and Innovation in Organizations: Making Progress, Making Meaning. Research in Organizational Behavior 36: 157--183.",
      "doi": ""
    },
    {
      "text": "What is Journalism? Retrieved December 28, 2017 from https://www.americanpressinstitute.org/journalismessentials/what-is-journalism/",
      "doi": ""
    },
    {
      "text": "Tom Bartindale, Elizabeth Valentine, Maxine Glancy, David Kirk, Peter Wright and Patrick Olivier. 2013. Facilitating TV Production Using StoryCrate. In Proceedings of the ACM Conference on Creativity and Cognition (C&C'13), 193--202.  ",
      "doi": "10.1145/2466627.2466628"
    },
    {
      "text": "Alan Baddeley. 1982. Your Memory: A User's Guide. Multimedia Publications.",
      "doi": ""
    },
    {
      "text": "Andrew Currah. 2009. What's Happening To Our News? Reuters Institute for the Study of Journalism, Oxford.",
      "doi": ""
    },
    {
      "text": "Brian Ekdale, Jane B Singer, Melissa Tully and Shawn Harmsen. 2015. Making Change: Diffusion of Technological, Relational, and Cultural Innovation in the Newsroom. Journalism and Mass Communication Quarterly 92,4: 938--958.",
      "doi": ""
    },
    {
      "text": "Bring your articles to life. Retrieved December 28, 2017 from http://explaain.com",
      "doi": ""
    },
    {
      "text": "Andrew Garbett, Rob Comber, Paul Egglestone, Maxine Glancy and Patrick Olivier. 2014. Finding \"real people\": trust and diversity in the interface between professional and citizen journalists, In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14), 3015--3024.  ",
      "doi": "10.1145/2556288.2557114"
    },
    {
      "text": "Sharon L. Greene. 2002. Characteristics of Applications that Support Creativity. Communications of the ACM 45,10: 100104.  ",
      "doi": "10.1145/570907.570941"
    },
    {
      "text": "Astrid Gynnild. 2014. Journalism innovation leads to innovation journalism: The impact of computational exploration on changing mindsets. Journalism 15,6: 713--730.",
      "doi": ""
    },
    {
      "text": "Lars Holmquist. 2017. Intelligence on Tap: Artificial Intelligence as a New Design Material. ACM Interactions 24,4, 2933.  ",
      "doi": "10.1145/3085571"
    },
    {
      "text": "Michaela Honauer and Eva Hornecker. 2015. Challenges for Creating and Staging Interactive Costumes for the Theatre Stage. In Proceedings of the ACM Conference on Creativity and Cognition (C&C'15), 13--22.  ",
      "doi": "10.1145/2757226.2757242"
    },
    {
      "text": "James C. Kaufman, and Ronald A. Beghetto. 2009. Beyond Big and Little: The Four c-model of Creativity. Review of General Psychology 13,1.",
      "doi": ""
    },
    {
      "text": "Andruid Kerne, Eunyee Koh, Steven M. Smith, Andrew Webb and Blake Dworaczyk. 2008. combinFormation: MixedInitiative Composition of Image and Text Surrogates Promotes Information Discovery. ACM Transactions on Information Systems 27,1: 1--45.  ",
      "doi": "10.1145/1416950.1416955"
    },
    {
      "text": "Raymond Liaw, Ari Zilnik, Mark Baldwin and Stephanie Butler S. 2013. Maater: crowdsourcing to improve online journalism. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2549--2554.  ",
      "doi": "10.1145/2468356.2468828"
    },
    {
      "text": "Neil Maiden, Konstantinos Zachos, James Lockerbie, Sergio Levis, Kasia Camargo, Shaun Hoddy and Gianluca Allemandi. 2017. Evaluating Digital Creativity Support To Improve Health-and-Safety in a Manufacturing Plant. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17), 7005--7014.  ",
      "doi": "10.1145/3025453.3025712"
    },
    {
      "text": "Neil Maiden, Konstantinos Zachos, James Lockerbie, George Brock and Christopher Traver. 2016. Developing and Evaluating Digital Creativity Support in Google Docs for Journalists. In Proceedings of the 30th International British Human Computer Interaction Conference (HCI'16), Article No. 23.  ",
      "doi": "10.14236/ewic/HCI2016.23"
    },
    {
      "text": "Nando Malmelin and Sari Virta. 2016. Managing creativity in change: Motivations and constraints of creative work in a media organization. Journalism Practice 10,6: https://1041--1054.",
      "doi": ""
    },
    {
      "text": "Diana McCarthy, Rob Koeling, Julie Weeds and John Carroll. 2004. Using Automatically Acquired Predominant Senses for Word Sense Disambiguation, In Proceedings of the ACL 2004 Senseval-3 Workshop. Association of Computational Linguistics.",
      "doi": ""
    },
    {
      "text": "Brian McNair. 1998. The Sociology of Journalism. London: Arnold.",
      "doi": ""
    },
    {
      "text": "Michael Michalko. 2006. Thinkertoys: A Handbook of Creative-Thinking Techniques. Random House Inc., New York",
      "doi": ""
    },
    {
      "text": "Anne-Lyse Minard, Manuela Speranza, Eneko Agirre, Itziar Aldabe, Marieke van Erp, Bernando Magnini, German Rigau and Ruben Urizar. 2015. SemEval-2015 Task 4: Timeline: cross-document event ordering. In Proceedings of the 9th International Workshop on Semantic Evaluation, 778--786.",
      "doi": ""
    },
    {
      "text": "Sharing Liberally. Retrieved December 28, 2017, from http://bostonreview.net/BR35.4/morozov.php",
      "doi": ""
    },
    {
      "text": "Tom Schofield, John Vines, Tom Higham, Ed Carter, Memo Atken and Amy Golding. 2013. Trigger Shift: Participatory Design of an Augmented Theatrical Performance with Young People. In Proceedings of the ACM Conference on Creativity and Cognition (C&C'13), 203--212.  ",
      "doi": "10.1145/2466627.2466640"
    },
    {
      "text": "Ivor Shapiro. 2010. Evaluating Journalism. Journalism Practice 4,2: 143,163.",
      "doi": ""
    },
    {
      "text": "Robert J. Sternberg (Ed.). 1999. Handbook of Creativity. New York, Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Mark Stevenson and Yorick Wilks. 2001. The Interaction of Knowledge Sources in Word Sense Disambiguation. Computational Linguistics, 27,3: 321--349.  ",
      "doi": "10.1162/089120101317066104"
    },
    {
      "text": "Helle Sjøvaag. 2014. Homogenisation or Differentiation? The Effects of Consolidation in the Regional Newspaper Market. Journalism Studies 15,5: 511--521.",
      "doi": ""
    },
    {
      "text": "Bregtje Van Der Haak, Michael Parks and Manuel Castells. 2012. The Future of Journalism: Networked Journalism. International Journalism of Communication 6: 2923--2938.",
      "doi": ""
    },
    {
      "text": "Google Docs introduces new sidebar research tool. Retrieved December 28, 2017 from https://thenextweb.com/apps/2012 /05/15/useful-google-docs-introduces-new-sidebar-researchtool",
      "doi": ""
    },
    {
      "text": "Andrew Warr and Eamon O'Neill, 2005. Understanding design as a social creative process. In Proceedings of the ACM Creativity and Cognition Conference (C&C'05), 118--127.  ",
      "doi": "10.1145/1056224.1056242"
    },
    {
      "text": "Tamara Witschge and Gunnar Nygren. 2009. Journalism: a profession under pressure? Journal of Media Business Studies 6,1: 37--59.",
      "doi": ""
    }
  ]
}