{
  "doi": "10.1145/3173574.3173962",
  "title": "Expressive Time Series Querying with Hand-Drawn Scale-Free Sketches",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [
    "Best Paper"
  ],
  "abstract": "We present Qetch, a tool where users freely sketch patterns on a scale-less canvas to query time series data without specifying query length or amplitude. We study how humans sketch time series patterns --- humans preserve visually salient perceptual features but often non-uniformly scale and locally distort a pattern --- and we develop a novel matching algorithm that accounts for human sketching errors. Qetch enables the easy construction of complex and expressive queries with two key features: regular expressions over sketches and relative positioning of sketches to query multiple time-aligned series. Through user studies, we demonstrate the effectiveness of Qetch's different interaction features. We also demonstrate the effectiveness of Qetch's matching algorithm compared to popular algorithms on targeted, and exploratory query-by-sketch search tasks on a variety of data sets.",
  "authors": [
    {
      "name": "Miro Mannino",
      "institution": "New York University - Abu Dhabi, Abu Dhabi, Uae",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261718",
      "orcid": "missing"
    },
    {
      "name": "Azza Abouzied",
      "institution": "New York University - Abu Dhabi, Abu Dhabi, Uae",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309481109",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rakesh Agrawal, Giuseppe Psaila, Edward L. Wimmers, and Mohamed Zaït. 1995. Querying Shapes of Histories. In Proceedings of the 21th International Conference on Very Large Data Bases (VLDB '95). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 502--514. ",
      "doi": "10.5555/645921.673157"
    },
    {
      "text": "Gustavo E.A.P.A. Batista, Xiaoyue Wang, and Eamonn J. Keogh. 2011. A Complexity-Invariant Distance Measure for Time Series. In Proceedings of the 2011 SIAM International Conference on Data Mining. 699--710.",
      "doi": ""
    },
    {
      "text": "Donald J. Berndt and James Clifford. 1994. Using Dynamic Time Warping to Find Patterns in Time Series. In Proceedings of the 3rd International Conference on Knowledge Discovery and Data Mining (AAAIWS'94). AAAI Press, 359--370. ",
      "doi": "10.5555/3000850.3000887"
    },
    {
      "text": "Y. Chen, M. A. Nascimento, B. C. Ooi, and A. K. H. Tung. 2007. SpADe: On Shape-based Pattern Detection in Streaming Time Series. In 2007 IEEE 23rd International Conference on Data Engineering. 786--795.",
      "doi": ""
    },
    {
      "text": "P. Cortez, M. Rio, M. Rocha, and P. Sousa. 2006. Internet Traffic Forecasting using Neural Networks. In The 2006 IEEE International Joint Conference on Neural Network Proceedings. 2635--2642. ",
      "doi": "10.5555/1778066.1778118"
    },
    {
      "text": "Nick Craswell. 2009. Mean Reciprocal Rank. Springer US, Boston, MA, 1703--1703.",
      "doi": ""
    },
    {
      "text": "W Bruce Croft, Donald Metzler, and Trevor Strohman. 2010. Search engines: Information retrieval in practice. Vol. 283. Addison-Wesley Reading. ",
      "doi": "10.5555/1516224"
    },
    {
      "text": "Hui Ding, Goce Trajcevski, Peter Scheuermann, Xiaoyue Wang, and Eamonn Keogh. 2008. Querying and Mining of Time Series Data: Experimental Comparison of Representations and Distance Measures. Proc. VLDB Endow. 1, 2 (Aug. 2008), 1542--1552.  ",
      "doi": "10.14778/1454159.1454226"
    },
    {
      "text": "Philipp Eichmann and Emanuel Zgraggen. 2015. Evaluating Subjective Accuracy in Time Series Pattern-Matching Using Human-Annotated Rankings. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, New York, NY, USA, 28--37.  ",
      "doi": "10.1145/2678025.2701379"
    },
    {
      "text": "Mathias Eitz, James Hays, and Marc Alexa. 2012. How Do Humans Sketch Objects? ACM Trans. Graph. 31, 4, Article 44 (July 2012), 10 pages.  ",
      "doi": "10.1145/2185520.2185540"
    },
    {
      "text": "Mathias Eitz, Kristian Hildebrand, Tamy Boubekeur, and Marc Alexa. 2009. PhotoSketch: A Sketch Based Image Query and Compositing System. In SIGGRAPH 2009: Talks (SIGGRAPH '09). ACM, New York, NY, USA, Article 60, 1 pages.  ",
      "doi": "10.1145/1597990.1598050"
    },
    {
      "text": "Philippe Esling and Carlos Agon. 2012. Time-series Data Mining. ACM Comput. Surv. 45, 1, Article 12 (Dec. 2012), 34 pages.  ",
      "doi": "10.1145/2379776.2379788"
    },
    {
      "text": "Ada Wai-Chee Fu, Eamonn Keogh, Leo Yung Lau, Chotirat Ann Ratanamahatana, and Raymond Chi-Wing Wong. 2008. Scaling and Time Warping in Time Series Querying. The VLDB Journal 17, 4 (July 2008), 899--921.  ",
      "doi": "10.1007/s00778-006-0040-z"
    },
    {
      "text": "Ary L Goldberger, Luis AN Amaral, Leon Glass, Jeffrey M Hausdorff, Plamen Ch Ivanov, Roger G Mark, Joseph E Mietus, George B Moody, Chung-Kang Peng, and H Eugene Stanley. 2000. Physiobank, Physiotoolkit, and Physionet Components of a New Research Resource for Complex Physiologic Signals. Circulation 101, 23 (2000), e215--e220.",
      "doi": ""
    },
    {
      "text": "Keith W Hipel and A Ian McLeod. 1994. Time series modelling of water resources and environmental systems. Vol. 45. Elsevier.",
      "doi": ""
    },
    {
      "text": "Harry Hochheiser. 2002. Interactive Querying of Time Series Data. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, New York, NY, USA, 552--553.  ",
      "doi": "10.1145/506443.506477"
    },
    {
      "text": "Harry Hochheiser and Ben Shneiderman. 2001. Interactive Exploration of Time Series Data. In Proceedings of the 4th International Conference on Discovery Science (DS '01). Springer-Verlag, London, UK, UK, 441--446. ",
      "doi": "10.5555/647858.738708"
    },
    {
      "text": "Harry Hochheiser and Ben Shneiderman. 2004. Dynamic Query Tools for Time Series Data Sets: Timebox Widgets for Interactive Exploration. Information Visualization 3, 1 (March 2004), 1--18.  ",
      "doi": "10.1145/993176.993177"
    },
    {
      "text": "Donald D Hoffman and Manish Singh. 1997. Salience of visual parts. Cognition 63, 1 (1997), 29 -- 78.",
      "doi": ""
    },
    {
      "text": "Christian Holz and Steven Feiner. 2009. Relaxed Selection Techniques for Querying Time-series Graphs. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, New York, NY, USA, 213--222.  ",
      "doi": "10.1145/1622176.1622217"
    },
    {
      "text": "Kalervo Järvelin and Jaana Kekäläinen. 2002. Cumulated Gain-based Evaluation of IR Techniques. ACM Trans. Inf. Syst. 20, 4 (Oct. 2002), 422--446.  ",
      "doi": "10.1145/582415.582418"
    },
    {
      "text": "Eamonn Keogh. 2003. Efficiently Finding Arbitrarily Scaled Patterns in Massive Time Series Databases. Springer Berlin Heidelberg, Berlin, Heidelberg, 253--265.",
      "doi": ""
    },
    {
      "text": "Eamonn Keogh. 2008. Indexing and Mining Time Series Data. Springer US, Boston, MA, 493--497.",
      "doi": ""
    },
    {
      "text": "Eamonn Keogh, Selina Chu, David Hart, and Michael Pazzani. 2004. Segmenting time series: A survey and novel approach. Data mining in time series databases 57 (2004), 1--22.",
      "doi": ""
    },
    {
      "text": "Eamonn Keogh and Shruti Kasetty. 2002. On the Need for Time Series Data Mining Benchmarks: A Survey and Empirical Demonstration. In Proceedings of the Eighth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '02). ACM, New York, NY, USA, 102--111.  ",
      "doi": "10.1145/775047.775062"
    },
    {
      "text": "Eamonn Keogh and Padhraic Smyth. 1997. A Probabilistic Approach to Fast Pattern Matching in Time Series Databases. In Proceedings of the Third International Conference on Knowledge Discovery and Data Mining (KDD'97). AAAI Press, 24--30. ",
      "doi": "10.5555/3001392.3001397"
    },
    {
      "text": "Eamonn Keogh, Li Wei, Xiaopeng Xi, Michail Vlachos, Sang-Hee Lee, and Pavlos Protopapas. 2009. Supporting Exact Indexing of Arbitrarily Rotated Shapes and Periodic Time Series Under Euclidean and Warping Distance Measures. The VLDB Journal 18, 3 (June 2009), 611--630.  ",
      "doi": "10.1007/s00778-008-0111-4"
    },
    {
      "text": "Vladimir G. Kim, Wilmot Li, Niloy J. Mitra, Stephen DiVerdi, and Thomas Funkhouser. 2012. Exploring Collections of 3D Models Using Fuzzy Correspondences. ACM Trans. Graph. 31, 4, Article 54 (July 2012), 11 pages.  ",
      "doi": "10.1145/2185520.2185550"
    },
    {
      "text": "Nicholas Kong and Maneesh Agrawala. 2009. Perceptual Interpretation of Ink Annotations on Line Charts. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, New York, NY, USA, 233--236.  ",
      "doi": "10.1145/1622176.1622219"
    },
    {
      "text": "Jefrey Lijffijt, Panagiotis Papapetrou, Jaakko Hollmén, and Vassilis Athitsos. 2010. Benchmarking Dynamic Time Warping for Music Retrieval. In Proceedings of the 3rd International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '10). ACM, New York, NY, USA, Article 59, 7 pages.  ",
      "doi": "10.1145/1839294.1839365"
    },
    {
      "text": "George B. Moody and M.D. Ary L. Goldberger. 2017. MIT-BIH Heart Rate Time Series. (July 2017). http://ecg.mit.edu/time-series/",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Morrill. 1998. Distributed Recognition of Patterns in Time Series Data. Commun. ACM 41, 5 (May 1998), 45--51.  ",
      "doi": "10.1145/274946.274955"
    },
    {
      "text": "Abdullah Mueen and Eamonn Keogh. 2016. Extracting Optimal Performance from Dynamic Time Warping. In Proceedings of the 22Nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '16). ACM, New York, NY, USA, 2129--2130.  ",
      "doi": "10.1145/2939672.2945383"
    },
    {
      "text": "New York University Abu Dhabi, Design Technology Lab. 2018. Qetch source code repository. (January 2018). https://github.com/dtl-nyuad/qetch",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 2002. The Design of Everyday Things. Basic Books, Inc., New York, NY, USA. ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Central Bank of Iceland. 2016. Insurance companies statistics. (Jun 2016). http://www.cb.is/statistics/ statistics/2016/08/15/Insurance-companies/",
      "doi": ""
    },
    {
      "text": "Maks Ovsjanikov, Wilmot Li, Leonidas Guibas, and Niloy J. Mitra. 2011. Exploration of Continuous Variability in Collections of 3D Shapes. ACM Trans. Graph. 30, 4, Article 33 (July 2011), 10 pages.  ",
      "doi": "10.1145/2010324.1964928"
    },
    {
      "text": "Sanghyun Park, Sang-Wook Kim, and Wesley W. Chu. 2001. Segment-based Approach for Subsequence Searches in Sequence Databases. In Proceedings of the 2001 ACM Symposium on Applied Computing (SAC '01). ACM, New York, NY, USA, 248--252.  ",
      "doi": "10.1145/372202.372334"
    },
    {
      "text": "Thanawin Rakthanmanon, Bilson Campana, Abdullah Mueen, Gustavo Batista, Brandon Westover, Qiang Zhu, Jesin Zakaria, and Eamonn Keogh. 2012. Searching and Mining Trillions of Time Series Subsequences Under Dynamic Time Warping. In Proceedings of the 18th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '12). ACM, New York, NY, USA, 262--270.  ",
      "doi": "10.1145/2339530.2339576"
    },
    {
      "text": "Kathy Ryall, Neal Lesh, Tom Lanning, Darren Leigh, Hiroaki Miyashita, and Shigeru Makino. 2005. QueryLines: Approximate Query for Visual Browsing. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1765--1768.  ",
      "doi": "10.1145/1056808.1057017"
    },
    {
      "text": "Martin Wattenberg. 2001. Sketching a Graph to Query a Time-series Database. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, New York, NY, USA, 381--382.  ",
      "doi": "10.1145/634067.634292"
    },
    {
      "text": "M Wertheimer. 1938. Laws of organization in perceptual forms (partial translation). A Sourcebook of Gestalt Psychology (1938), 71--88.",
      "doi": ""
    },
    {
      "text": "Yunyue Zhu and Dennis Shasha. 2003. Warping Indexes with Envelope Transforms for Query by Humming. In Proceedings of the 2003 ACM SIGMOD International Conference on Management of Data (SIGMOD '03). ACM, New York, NY, USA, 181--192.  ",
      "doi": "10.1145/872757.872780"
    },
    {
      "text": "Kostas Zoumpatianos, Stratos Idreos, and Themis Palpanas. 2015. RINSE: Interactive Data Series Exploration with ADS+. Proc. VLDB Endow. 8, 12 (Aug. 2015), 1912--1915.  ",
      "doi": "10.14778/2824032.2824099"
    }
  ]
}