{
  "doi": "10.1145/3173574.3173958",
  "title": "Stitching Infrastructures to Facilitate Telemedicine for Low-Resource Environments",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Telemedicine can potentially transform healthcare delivery in low-resource environments by enabling extension of medical knowledge to remote locations, thus enhancing the efficiency and effectiveness of the larger healthcare infrastructure. However, empirical studies have shown mixed results at best. We present a qualitative investigation of a long-standing telemedicine program operating from Lucknow (Uttar Pradesh, India). Invoking the lenses of human infrastructure and seamful spaces, we highlight the factors that determine the success of this telemedicine program. We identify and describe three important aspects: (1) conceptualizing telemedicine as the connectedness of two nodes rather than doctors and patients alone, (2) identifying the critical 'carrying agent' (local doctors at peripheral nodes) and engaging them in program design and implementation, and (3) ensuring co-creation by engaging patients in the process. Finally, we discuss how our lenses allowed us to recognize the seams made visible through the juxtaposition of the infrastructures at the central and peripheral nodes, and to emphasize the human elements that addressed these seams for ensuring the facilitation of a successful telemedicine program.",
  "tags": [
    "ictd",
    "health",
    "telemedicine",
    "india",
    "hci4d"
  ],
  "authors": [
    {
      "name": "Rajesh Chandwani",
      "institution": "Indian Institute of Management Ahmedabad, Ahmedabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84460030557",
      "orcid": "missing"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "Nirwan Ansari, Bernard Fong, and Yuan-Ting Zhang. 2006. Wireless technology advances and challenges for telemedicine. IEEE Communications Magazine 44, 4 (2006), 39--40.  ",
      "doi": "10.1109/MCOM.2006.1632647"
    },
    {
      "text": "Yarlini Balarajan, Selvaraj Selvaraj, and SV Subramanian. 2011. Health care and equity in India. The Lancet 377, 9764 (2011), 505--515.",
      "doi": ""
    },
    {
      "text": "Lavees Bhandari and Siddartha Dutta. 2007. Health infrastructure in rural India. India infrastructure report (2007), 265--271.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker, Jeremiah Schroll, and Kristina Groth. 2010. Design for Collaboration in Health Care: Experiences from Highly Specialized Surgical Care in Sweden. In CSCW Research in Healthcare: Past, Present, and Future, workshop at CSCW 2010.",
      "doi": ""
    },
    {
      "text": "Charles W Callahan, Francis Malone, David Estroff, and Donald A Person. 2005. Effectiveness of an Internet-based store-and-forward telemedicine system for pediatric subspecialty consultation. Archives of pediatrics & adolescent medicine 159, 4 (2005), 389--393.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Peter Roessler, Brett E Shelton, Anthony LaMarca, Bill Schilit, and Sara Bly. 2004. Technology for care networks of elders. IEEE Pervasive Computing 3, 2 (2004), 22--29.  ",
      "doi": "10.1109/MPRV.2004.1316814"
    },
    {
      "text": "Isabel de la Torre-D´ez, Miguel L´ opez-Coronado, Cesar Vaca, Jes´ us Saez Aguado, and Carlos de Castro. 2015. Cost-utility and cost-effectiveness studies of telemedicine, electronic, and mobile health systems in the literature: a systematic review. Telemedicine and e-Health 21, 2 (2015), 81--85.",
      "doi": ""
    },
    {
      "text": "Anne G Ekeland, Alison Bowes, and Signe Flottorp. 2010. Effectiveness of telemedicine: a systematic review of reviews. International journal of medical informatics 79, 11 (2010), 736--771.",
      "doi": ""
    },
    {
      "text": "Antoine Geissbuhler, Cheick Oumar Bagayoko, and Ousmane Ly. 2007. The RAFT network: 5 years of distance continuing medical education and tele-consultations over the Internet in French-speaking Africa. International journal of medical informatics 76, 5 (2007), 351--356.",
      "doi": ""
    },
    {
      "text": "Ayushi Gudwani, Palash Mitra, Ankur Puri, and Manadar Vaidya. 2012. India healthcare: inspiring possibilities, challenging journey. New York: McKinsey & Co (2012).",
      "doi": ""
    },
    {
      "text": "Susan S Gustke, David C Balch, Vivian L West, and Lance O Rogers. 2000. Patient satisfaction with telemedicine. Telemedicine Journal 6, 1 (2000), 5--13.",
      "doi": ""
    },
    {
      "text": "Richard Heeks. 2008. ICT4D 2.0: The next phase of applying ICT for international development. Computer 41, 6 (2008), 26--33.  ",
      "doi": "10.1109/MC.2008.192"
    },
    {
      "text": "Jeremy M Kahn. 2011. The use and misuse of ICU telemedicine. JAMA 305, 21 (2011), 2227-- 2228.",
      "doi": ""
    },
    {
      "text": "Bridget Kane and Saturnino Luz. 2009. Achieving diagnosis by consensus. Computer Supported Cooperative Work (CSCW) 18, 4 (2009), 357--392.  ",
      "doi": "10.1007/s10606-009-9094-y"
    },
    {
      "text": "Mengistu Kifle, Fay Cobb Payton, Victor Mbarika, and Peter Meso. 2010. Transfer and adoption of advanced information technology solutions in resource-poor environments: the case of telemedicine systems adoption in Ethiopia. Telemedicine and e-Health 16, 3 (2010), 327--343.",
      "doi": ""
    },
    {
      "text": "Beth E Kolko, Alexis Hope, Waylon Brunette, Karen Saville, Wayne Gerard, Michael Kawooya, and Robert Nathan. 2012. Adapting collaborative radiological practice to low-resource environments. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 97--106.  ",
      "doi": "10.1145/2145204.2145223"
    },
    {
      "text": "Richelle J Koopman, Bonnie J Wakefield, Jennifer L Johanning, Lynn E Keplinger, Robin L Kruse, Marilee Bomar, Beth Bernt, Douglas S Wakefield, and David R Mehr. 2014. Implementing home blood glucose and blood pressure telemonitoring in primary care practices for patients with diabetes: lessons learned. Telemedicine and e-Health 20, 3 (2014), 253--260.",
      "doi": ""
    },
    {
      "text": "Simon B Larsen and Jakob E Bardram. 2008. Competence articulation: alignment of competences and responsibilities in synchronous telemedical collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 553--562.  ",
      "doi": "10.1145/1357054.1357144"
    },
    {
      "text": "Karen Locke. 2001. Grounded theory in management research. Sage.",
      "doi": ""
    },
    {
      "text": "Rowena Luk, Melissa Ho, and Paul M Aoki. 2008. Asynchronous remote medical consultation for Ghana. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 743--752.  ",
      "doi": "10.1145/1357054.1357173"
    },
    {
      "text": "Frances Mair and Pamela Whitten. 2000. Systematic review of studies of patient satisfaction with telemedicine. Bmj 320, 7248 (2000), 1517--1520.",
      "doi": ""
    },
    {
      "text": "Frances Mair, Pamela Whitten, Carl May, and Gary C Doolittle. 2000. Patients' perceptions of a telemedicine specialty clinic. Journal of Telemedicine and Telecare 6, 1 (2000), 36--40.",
      "doi": ""
    },
    {
      "text": "SK Meher and S Kant. 2014. Awareness and attitudes of geriatric patients towards telemedicine in India. Gerontechnology 13, 2 (2014), 262.",
      "doi": ""
    },
    {
      "text": "Edward Alan Miller. 2003. The technical and interpersonal aspects of telemedicine: effects on doctor--patient communication. Journal of telemedicine and telecare 9, 1 (2003), 1--7.",
      "doi": ""
    },
    {
      "text": "Gianluca Miscione. 2007. Telemedicine in the Upper Amazon: Interplay with local health care practices. MIS quarterly (2007), 403--425. ",
      "doi": "10.5555/2017345.2017355"
    },
    {
      "text": "Saroj Kanta Mishra, Lily Kapoor, and Indra Pratap Singh. 2009. Telemedicine in India: current scenario and the future. Telemedicine and e-Health 15, 6 (2009), 568--575.",
      "doi": ""
    },
    {
      "text": "Ashok Vikhe Patil, KV Somasundaram, and RC Goyal. 2002. Current health scenario in rural India. Australian Journal of Rural Health 10, 2 (2002), 129--135.",
      "doi": ""
    },
    {
      "text": "Victor Patterson and Richard Wootton. 2013. A web-based telemedicine system for low-resource settings 13 years on: insights from referrers and specialists. Global health action 6, 1 (2013), 21465.",
      "doi": ""
    },
    {
      "text": "Katrina Peddle. 2007. Telehealth in context: Socio-technical barriers to telehealth use in labrador, canada. Computer Supported Cooperative Work (CSCW) 16, 6 (2007), 595-- 614.  ",
      "doi": "10.1007/s10606-006-9030-3"
    },
    {
      "text": "Sebastiaan Theodorus Micha¨ el Peek, Eveline JM Wouters, Katrien G Luijkx, and Hubertus JM Vrijhoef. 2016. What it Takes to Successfully Implement Technology for Aging in Place: Focus Groups With Stakeholders. Journal of medical Internet research 18, 5 (2016), e98.",
      "doi": ""
    },
    {
      "text": "Madhu C Reddy and Bernard J Jansen. 2008. A model for understanding collaborative information behavior in context: A study of two healthcare teams. Information Processing & Management 44, 1 (2008), 256--273.  ",
      "doi": "10.1016/j.ipm.2006.12.010"
    },
    {
      "text": "Toni Robertson, Jane Li, Kenton O'Hara, and Susan Hansen. 2010. Collaboration within different settings: A study of co-located and distributed multidisciplinary medical team meetings. Computer Supported Cooperative Work (CSCW) 19, 5 (2010), 483-- 513.  ",
      "doi": "10.1007/s10606-010-9124-9"
    },
    {
      "text": "Pedro Romero-Aroca, Ramon Sagarra-Alamo, Alicia Pareja-Rios, and Maribel L´ opez. 2015. Importance of telemedicine in diabetes care: Relationships between family physicians and ophthalmologists. World journal of diabetes 6, 8 (2015), 1005.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan and Thomas Smyth. 2010. The human infrastructure of ICTD. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development. ACM, 40.  ",
      "doi": "10.1145/2369220.2369258"
    },
    {
      "text": "Gursharan Singh, Leah Findlater, Kentaro Toyama, Scott Helmer, Rikin Gandhi, and Ravin Balakrishnan. 2009. Numeric Paper Forms for NGOs. In Information and Communication Technologies and Development. 406--416. ",
      "doi": "10.5555/1812530.1812571"
    },
    {
      "text": "Gurmit Singh, Christopher S Walsh, Christopher R Jones, Ricardo B Cardoso, Edison H¨ uttner, Helena W Oliveira, Marlise A dos Santos, Maria Helena Itaqui Lopes, and Thais Russomano. 2012. Towards designing for equity: active citizen participation in eHealth. Transforming Government: People, Process and Policy 6, 4 (2012), 333--344.",
      "doi": ""
    },
    {
      "text": "Ranjit Singh and Steven J Jackson. 2017. From Margins to Seams: Imbrication, Inclusion, and Torque in the Aadhaar Identification Project. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4776--4824.  ",
      "doi": "10.1145/3025453.3025910"
    },
    {
      "text": "Duncan Roderick Stevenson. 2011. Tertiary-level telehealth: A media space application. Computer Supported Cooperative Work (CSCW) 20, 1--2 (2011), 61-- 92.  ",
      "doi": "10.1007/s10606-010-9125-8"
    },
    {
      "text": "Anselm Strauss. 1985. Work and the division of labor. The Sociological Quarterly 26, 1 (1985), 1--19.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Commun. ACM 38, 9 (1995), 56--64.  ",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Jun Sun and Zhe Qu. 2015. Understanding health information technology adoption: A synthesis of literature from an activity perspective. Information Systems Frontiers 17, 5 (2015), 1177--1190.  ",
      "doi": "10.1007/s10796-014-9497-2"
    },
    {
      "text": "Sonesh Surana, Rabin Patra, Sergiu Nedevschi, and Eric Brewer. 2008. Deploying a rural wireless telemedicine system: Experiences in sustainability. Computer 41, 6 (2008).  ",
      "doi": "10.1109/MC.2008.184"
    },
    {
      "text": "Janet Vertesi. 2014. Seamful spaces: Heterogeneous infrastructures in interaction. Science, Technology, & Human Values 39, 2 (2014), 264--284.",
      "doi": ""
    },
    {
      "text": "Boyd R Viers, Sandhya Pruthi, Marcelino E Rivera, Daniel A O'Neil, Matthew R Gardner, Sarah M Jenkins, Deborah J Lightner, and Matthew T Gettman. 2015. Are patients willing to engage in telemedicine for their care: a survey of preuse perceptions and acceptance of remote video visits in a urological patient population. Urology 85, 6 (2015), 1233--1240.",
      "doi": ""
    },
    {
      "text": "Victoria A Wade, Jonathan Karnon, Adam G Elshaug, and Janet E Hiller. 2010. A systematic review of economic analyses of telehealth services using real time video communication. BMC health services research 10, 1 (2010), 1.",
      "doi": ""
    },
    {
      "text": "Geoff Walsham. 2012. Are we making a better world with ICTs? Reflections on a future agenda for the IS field. Journal of Information Technology 27, 2 (2012), 87--93.",
      "doi": ""
    },
    {
      "text": "Pamela Whitten, Beverly Davenport Sypher, and James D Patterson. 2000. Transcending the technology of telemedicine: an analysis of telemedicine in North Carolina. Health communication 12, 2 (2000), 109--135.",
      "doi": ""
    },
    {
      "text": "Richard Wootton. 2008. Telemedicine support for the developing world. Journal of telemedicine and telecare 14, 3 (2008), 109--114.",
      "doi": ""
    },
    {
      "text": "Richard Wootton and Laurent Bonnardot. 2015. Telemedicine in low-resource settings. Frontiers in public health 3 (2015).",
      "doi": ""
    },
    {
      "text": "R Wootton, K Youngberry, P Swinfen, and R Swinfen. 2004. Prospective case review of a global e-health system for doctors in developing countries. Journal of telemedicine and telecare 10, 1 suppl (2004), 94--96.",
      "doi": ""
    },
    {
      "text": "Robert K Yin. 2013. Case study research: Design and methods. Sage publications.",
      "doi": ""
    }
  ]
}