{
  "doi": "10.1145/3173574.3174173",
  "title": "Two Kinds of Novel Multi-user Immersive Display Systems",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "Stereoscopic display is a standard display mode for virtual reality environments. Typical 3D projection provides only a single stereoscopic video stream; thus co-located users cannot correctly perceive the virtual scene based on their own position and view. Several works devoted to developing multi-user stereoscopic display, but the number of users is very limited or the technical implementation is complicated. In this paper we put forward two flexible and simple projection-based multi-user stereoscopic display systems. The first one, named TPA, is based on a triple-projector array and provides a 120Hz active stereo for three users. Two TPAs can be combined to form a six-user system. The second one, named DPA, is a dual-projector and easy-implemented system providing individual stereoscopic video stream for two to six users. Finally, a co-located multi-user virtual fireman simulation training system and a virtual tennis simulation system were created to verify the effectiveness of our systems.",
  "tags": [
    "virtual reality",
    "co-located collaboration",
    "multi-users stereoscopic display"
  ],
  "authors": [
    {
      "name": "Dongdong Guan",
      "institution": "Shandong University&Ministry of Education, Jinan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658660947",
      "orcid": "missing"
    },
    {
      "name": "Chenglei Yang",
      "institution": "Shandong University, Jinan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100356283",
      "orcid": "missing"
    },
    {
      "name": "Weisi Sun",
      "institution": "Shandong University, Jinan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658658954",
      "orcid": "missing"
    },
    {
      "name": "Yuan Wei",
      "institution": "Shandong University, Jinan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260861",
      "orcid": "missing"
    },
    {
      "name": "Wei Gai",
      "institution": "Shandong University&Ministry of Education, Ji'nan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658661304",
      "orcid": "missing"
    },
    {
      "name": "Yulong Bian",
      "institution": "Shandong University&Ministry of Education, Jinan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659007132",
      "orcid": "missing"
    },
    {
      "name": "Juan Liu",
      "institution": "Shandong University&Ministry of Education, Ji'nan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659801245",
      "orcid": "missing"
    },
    {
      "name": "Qianhui Sun",
      "institution": "Shandong University, Jinan, Shandong , China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260345",
      "orcid": "missing"
    },
    {
      "name": "Siwei Zhao",
      "institution": "Shandong University, Jinan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260829",
      "orcid": "missing"
    },
    {
      "name": "Xiangxu Meng",
      "institution": "Shandong University&Ministry of Education, Ji'nan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322501374",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Maneesh Agrawala, Andrew C. Beers, Bernd Frohlich, Pat Hanrahan, Ian McDowall, and Mark Bolas. 1997. The two-user Responsive Workbench: support for collaboration through individual views of a shared space. In Proceedings of the 24th annual conference on Computer graphics and interactive techniques, 327332.  ",
      "doi": "10.1145/258734.258875"
    },
    {
      "text": "Barco. 2017. Virtual surgery table. Retrieved August 22, 2017 from http://www.barco.com/en",
      "doi": ""
    },
    {
      "text": "Stephan Beck, AndréKunert, Alexander Kulik, and Bernd Froehlich. 2013. Immersive group-to-group telepresence. IEEE Transactions on Visualization and Computer Graphics 19, 4: 616--625.  ",
      "doi": "10.1109/TVCG.2013.33"
    },
    {
      "text": "Wei Y. Chen, Nicolas Ladeveze, Cé line Clavel, Daniel Mestre, and Patrick Bourdot. 2015. User cohabitation in multi-stereoscopic immersive virtual environment for individual navigation tasks. In Virtual Reality (VR), 47--54.",
      "doi": ""
    },
    {
      "text": "Niranjan Damera-Venkata, and Nelson L. Chang. 2007. Realizing super-resolution with superimposed projection. In Computer Vision and Pattern Recognition, 1--8.",
      "doi": ""
    },
    {
      "text": "Sunkwang Hong, B. Berkeley, and Sang S. Kim. 2005. Motion image enhancement of LCDs. In IEEE International Conference on Image Processing, 11--17.",
      "doi": ""
    },
    {
      "text": "Abhijit Karnik, Walterio Mayol-Cuevas, and Sriram Subramanian. 2012. MUSTARD: a multi user see through AR display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems 2541--2550.  ",
      "doi": "10.1145/2207676.2208641"
    },
    {
      "text": "Alexander Kulik, AndréKunert, Stephan Beck, Roman Reichel, Roland Blach, Armin Zink, and Bernd Froehlich. 2011. C1x6: a stereoscopic six-user display for co-located collaboration in shared virtual environments. ACM Transactions on Graphics 30, 6: 188.  ",
      "doi": "10.1145/2070781.2024222"
    },
    {
      "text": "Roman Lissermann, Jochen Huber, Martin Schmitz, Jürgen Steimle, and Max Mühlhäuser. 2014. Permulin: mixed-focus collaboration on multi-view tabletops. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems 3191--3200.  ",
      "doi": "10.1145/2556288.2557405"
    },
    {
      "text": "Jonathan Marbach. 2009. Image blending and view clustering for multi-viewer immersive projection environments. In Virtual Reality Conference 51--54.  ",
      "doi": "10.1109/VR.2009.4810998"
    },
    {
      "text": "Wojciech Matusik, Clifton Forlines, and Hanspeter Pfister. 2008. Multiview user interfaces with an automultiscopic display. In Proceedings of the working conference on Advanced visual interfaces 363--366.  ",
      "doi": "10.1145/1385569.1385634"
    },
    {
      "text": "Brice Pollock, Melissa Burton, Jonathan W. Kelly, Stephen Gilbert, and Eliot Winer. 2012. The right view from the wrong location: Depth perception in stereoscopic multi-user virtual environments. IEEE Transactions on Visualization and Computer Graphics 18, 4: 581--588.  ",
      "doi": "10.1109/TVCG.2012.58"
    },
    {
      "text": "Tom Peterka, Robert L. Kooima, Javier I. Girado, Jinghua Ge, Daniel J. Sandin, Andrew Johnson, Jason Leigh, Jurgen Schulze, and Thomas A. DeFanti. 2007. Dynallax: solid state dynamic parallax barrier autostereoscopic VR display. In Virtual Reality Conference 155--162.",
      "doi": ""
    },
    {
      "text": "Kai Riege, T. Holtkamper, G. Wesche, and B. Frohlich. 2006. The bent pick ray: An extended pointing technique for multi-user interaction. In IEEE Symposium on 3D User Interfaces 62--65.  ",
      "doi": "10.1109/VR.2006.127"
    },
    {
      "text": "Andreas Simon. 2005. First-person experience and usability of co-located interaction in a projection-based virtual environment. In Proceedings of the ACM symposium on Virtual reality software and technology 23--30.  ",
      "doi": "10.1145/1101616.1101622"
    },
    {
      "text": "Jun Wang, Kyeongyuk Min, and Jongwha Chong. 2007. A hybrid image coding in overdriving for motion blur reduction in LCD. In Entertainment Computing 263--270. ",
      "doi": "10.5555/2394259.2394298"
    },
    {
      "text": "Hong D. Yu, Hui Y. Li, Wei S. Sun, Wei Gai, Ting T. Cui, Chu T. Wang, Dong D. Guan, Yi J. Yang, Cheng L. Yang, and Wei Zeng. 2014. A two-view VR shooting theater system. In Proceedings of the 13th ACM SIGGRAPH International Conference on VirtualReality Continuum and its Applications in Industry 223--226.  ",
      "doi": "10.1145/2670473.2670497"
    }
  ]
}