{
  "doi": "10.1145/3173574.3174119",
  "title": "Sense of Presence, Attitude Change, Perspective-Taking and Usability in First-Person Split-Sphere 360° Video",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "This paper examines the sense of presence, attitude change, perspective-taking, and usability of a split-sphere, first-person perspective 360 degree video about gender inequality, in which people can choose to watch the narrative from the male or female character's perspective. Sixty-seven participants were randomly assigned to watch (1) the video in 360 degree split-view in a head-mounted display, (2) the same film as 180 degree in a HMD, or (3) a flat control version of the video on a laptop. The 360 degree split-sphere increased the viewers' feeling of personal responsibility for resolving gender inequality, desire to rewatch the video, fear of missing out, and feeling of missing the full story. The 180 degree video created the strongest sense of presence, embodiment, and understanding of the character. However, people with greater egocentric projection onto the male character felt less responsible for resolving gender inequality, particularly in the 360 degree split-view.",
  "tags": [
    "usability",
    "user-experience",
    "perspective-taking",
    "storytelling",
    "360 degree video",
    "cinematic virtual reality",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Tanja Aitamurto",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658743232",
      "orcid": "missing"
    },
    {
      "name": "Shuo Zhou",
      "institution": "Colorado School of Public Health, Aurora, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260664",
      "orcid": "missing"
    },
    {
      "name": "Sukolsak Sakshuwong",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260680",
      "orcid": "missing"
    },
    {
      "name": "Jorge Saldivar",
      "institution": "Catholic University of Asuncion, Asuncion, Paraguay",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82459242257",
      "orcid": "missing"
    },
    {
      "name": "Yasamin Sadeghi",
      "institution": "Foothill College, Los Altos Hills, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261247",
      "orcid": "missing"
    },
    {
      "name": "Amy Tran",
      "institution": "Mission College, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261018",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sun Joo-Grace Ahn, Amanda Minh Tran Le, and Jeremy Bailenson. 2013. The Effect of Embodied Experiences on Self-Other Merging, Attitude, and Helping Behavior. Media Psychology 16 (2013), 7--38.",
      "doi": ""
    },
    {
      "text": "Daniel R. Ames. 2004a. Inside the mind reader's tool kit: projection and stereotyping in mental state inference. Journal of Personality and Social Psychology 87, 3 (2004), 340--353.",
      "doi": ""
    },
    {
      "text": "Daniel R Ames. 2004b. Strategies for social inference: a similarity contingency model of projection and stereotyping in attribute prevalence estimates. Journal of Personality and Social Psychology 87, 5 (2004), 573--585.",
      "doi": ""
    },
    {
      "text": "Jakki O. Bailey, Jeremy N. Bailenson, and Daniel Casasanto. 2016. When does virtual embodiment change our minds? Presence: Teleoperators and Virtual Environments 25, 3 (2016), 222--233.  ",
      "doi": "10.1162/PRES_a_00263"
    },
    {
      "text": "Jakki O. Bailey, Jeremy N. Bailenson, June Flora, K. Carrie Armel, David Voelker, and Byron Reeves. 2015. The Impact of Vivid Messages on Reducing Energy Consumption Related to Hot Water Use. Environment and Behavior 47, 5 (2015), 570--592.",
      "doi": ""
    },
    {
      "text": "William Sims Bainbridge. 2007. The scientific research potential of virtual worlds. Science 317, 5837 (2007), 472--476.",
      "doi": ""
    },
    {
      "text": "C. Daniel Batson. 2009. Two forms of perspective taking: Imagining how another feels and imagining how you would feel. In Handbook of Imagination and Mental Simulation (1st ed.), Keith D. Markman, William M. P. Klein, and Julie A. Suhr (Eds.). Psychology Press, New York, NY, 267--279.",
      "doi": ""
    },
    {
      "text": "Yoav Benjamini and Yosef Hochberg. 1995. Controlling the false discovery rate - a practical and powerful approach to multiple testing. Journal of the Royal Statistical Society. Series B (Methodological) 57 (1995), 289--300.",
      "doi": ""
    },
    {
      "text": "Jim Blascovich and Jeremy Bailenson. 2011. Infinite reality: Avatars, eternal life, new worlds, and the dawn of the virtual revolution. William Morrow&Co. ",
      "doi": "10.5555/2018630"
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands 'feel' touch that eyes see. Nature 391, 6669 (1998), 756--756.",
      "doi": ""
    },
    {
      "text": "Doug A. Bowman and Ryan P. McMahan. 2007. Virtual Reality: How Much Immersion Is Enough? Computer 40, 7 (2007), 36--43.  ",
      "doi": "10.1109/MC.2007.257"
    },
    {
      "text": "John Brooke. 1996. SUS-A quick and dirty usability scale. Usability Evaluation in Industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Jonathan Cohen. 2001. Defining identification: A theoretical look at the identification of audiences with media characters. Mass Communication&Society 4, 3 (2001), 245--264.",
      "doi": ""
    },
    {
      "text": "Kim De Corte, Ann Buysse, Lesley L. Verhofstadt, Herbert Roeyers, Koen Ponnet, and Mark H. Davis. 2007. Measuring Empathic Tendencies: Reliability And Validity of the Dutch Version of the Interpersonal Reactivity Index. Psychologica Belgica 47 (2007), 235--260.",
      "doi": ""
    },
    {
      "text": "James J. Cummings and Jeremy N. Bailenson. 2016. How immersive is enough? A meta-analysis of the effect of immersive technology on user presence. Media Psychology 19, 2 (2016), 272--309.",
      "doi": ""
    },
    {
      "text": "Nicholas Epley, Boaz Keysar, Leaf Van Boven, and Thomas Gilovich. 2004. Perspective taking as egocentric anchoring and adjustment. Journal of personality and social psychology 87, 3 (2004), 327--339.",
      "doi": ""
    },
    {
      "text": "Diana Fonseca and Martin Kraus. 2016. A comparison of head-mounted and hand-held displays for 360° videos with focus on attitude and behavior change. In Proceedings of the 20th International Academic Mindtrek Conference. ACM, 287--296.  ",
      "doi": "10.1145/2994310.2994334"
    },
    {
      "text": "Mark G. Frank and Thomas Gilovich. 1989. Effect of memory perspective on retrospective causal attributions. Journal of Personality and Social Psychology 57, 3 (1989), 399--403.",
      "doi": ""
    },
    {
      "text": "Edward E. Jones and Richard E. Nisbett. 1987. The actor and the observer: Divergent perceptions of the causes of behavior. In Attribution: Perceiving the causes of behavior, Edward E. Jones, David E. Kanouse, Harold H. Kelley, Richard E. Nisbett, Stuart Valins, and Bernard Weiner (Eds.). Lawrence Erlbaum Associates, Hillsdale, NJ, 79--94.",
      "doi": ""
    },
    {
      "text": "Sarah Jones. 2016. A big talk from Sarah Jones, 360 Immersive Lab. Video. (2016). Retrieved September 19, 2017 from https://www.youtube.com/watch?v=a17SmSG9Xxk.",
      "doi": ""
    },
    {
      "text": "Maurits Clemens Kaptein, Clifford Nass, and Panos Markopoulos. 2010. Powerful and Consistent Analysis of Likert-type Ratingscales. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2391--2394.  ",
      "doi": "10.1145/1753326.1753686"
    },
    {
      "text": "Elena Kokkinara, Mel Slater, and Joan López-Moliner. 2015. The Effects of Visuomotor Calibration to the Perceived Space and Body, Through Embodiment in Immersive Virtual Reality. ACM Trans. Appl. Percept. 13, 1, Article 3 (October 2015), 22 pages.  ",
      "doi": "10.1145/2818998"
    },
    {
      "text": "Yen-Chen Lin, Yung-Ju Chang, Hou-Ning Hu, Hsien-Tzu Cheng, Chi-Wen Huang, and Min Sun. 2017. Tell Me Where to Look: Investigating Ways for Assisting Focus in 360° Video. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2535--2545.  ",
      "doi": "10.1145/3025453.3025757"
    },
    {
      "text": "Aaron Luber. 2016. What virtual reality will mean for advertising. (2016). https://www.thinkwithgoogle.com/ marketing-resources/virtual-reality-advertising",
      "doi": ""
    },
    {
      "text": "Andrew MacQuarrie and Anthony Steed. 2017. Cinematic virtual reality: Evaluating the effect of display type on the viewing experience for panoramic video. In Virtual Reality 2017. IEEE, 45--54.",
      "doi": ""
    },
    {
      "text": "Bertram F. Malle. 2005. Folk theory of mind: Conceptual foundations of human social cognition. In The New Unconscious, Ran R. Hassin, James S. Uleman, and John A. Bargh (Eds.). Oxford University Press, UK, 225--255.",
      "doi": ""
    },
    {
      "text": "Bertram F. Malle and Joshua Knobe. 1997. The folk concept of intentionality. Journal of Experimental Social Psychology 33, 2 (1997), 101--121.",
      "doi": ""
    },
    {
      "text": "Salvatore Mangiafico. 2015. An R Companion for the Handbook of Biological Statistics.",
      "doi": ""
    },
    {
      "text": "Davis Mark. 1980. A multidimensional approach to individual differences in empathy. Catalog of Selected Documents in Psychology 10, 85 (1980).",
      "doi": ""
    },
    {
      "text": "Davis Mark. 1994. Empathy: A social psychological approach. Westview, Colorado.",
      "doi": ""
    },
    {
      "text": "Katy Newton and Karin Soukup. 2016. The Storyteller's Guide to the Virtual Reality Audience. Medium (2016).",
      "doi": ""
    },
    {
      "text": "Peter J. Passmore, Maxine Glancy, Adam Philpot, Amelia Roscoe, Andrew Wood, and Bob Fields. 2016. Effects of viewing condition on user experience of panoramic video. In Proceedings of the International Conference on Artificial Reality and Telexistence and Eurographics Symposium on Virtual Environments. The Eurographics Association, 9--16.  ",
      "doi": "10.5555/3061323.3061326"
    },
    {
      "text": "Adam Philpot. 2017. Effects of Camera Position on Perception of Self In 360 Degree Video and Virtual Environments. In Adjunct Publication of the 2017 ACM International Conference on Interactive Experiences for TV and Online Video. ACM, 87--91.  ",
      "doi": "10.1145/3084289.3084290"
    },
    {
      "text": "Vanessa C. Pope, Robert Dawes, Florian Schweiger, and Alia Sheikh. 2017. The Geometry of Storytelling: Theatrical Use of Space for 360-degree Videos and Virtual Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4468--4478.  ",
      "doi": "10.1145/3025453.3025581"
    },
    {
      "text": "Andrew K. Przybylski, Kou Murayama, Cody R. DeHaan, and Valerie Gladwell. 2013. Motivational, emotional, and behavioral correlates of fear of missing out. Computers in Human Behavior 29, 4 (2013), 1841--1848.",
      "doi": ""
    },
    {
      "text": "Howard J. Seltman. 2012. Experimental design and analysis. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical transactions of the Royal Society of London. Series B, Biological sciences 364 1535 (2009), 3549--57.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Bernhard Spanlang, Maria V. Sanchez-Vives, and Olaf Blanke. 2010. First Person Experience of Body Transfer in Virtual Reality. PLOS ONE 5, 5 (2010), 1--9.",
      "doi": ""
    },
    {
      "text": "Mel Slater and Sylvia Wilbur. 1997. A framework for immersive virtual environments (FIVE): Speculations on the role of presence in virtual environments. Presence: Teleoperators and Virtual Environments 6, 6 (1997), 603--616.  ",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "Anthony Steed, Sebastian Frlston, Maria Murcia Lopez, Jason Drummond, Ye Pan, and David Swapp. 2016. An 'In the Wild' Experiment on Presence and Embodiment using Consumer Virtual Reality Equipment. IEEE Transactions on Visualization and Computer Graphics 22, 4 (2016), 1406--1414.  ",
      "doi": "10.1109/TVCG.2016.2518135"
    },
    {
      "text": "Jonathan Steuer. 1992. Defining Virtual Reality: Dimensions Determining Telepresence. Journal of Communication 42, 4 (1992), 73--93.",
      "doi": ""
    },
    {
      "text": "Michael D. Storms. 1973. Videotape and the attribution process: Reversing actors' and observers' points of view. Journal of personality and social psychology 27, 2 (1973), 165--175.",
      "doi": ""
    },
    {
      "text": "Audrey Tse, Charlene Jennett, Joanne Moore, Zillah Watson, Jacob Rigby, and Anna L. Cox. 2017. Was I There?: Impact of Platform and Headphones on 360 Video Immersion. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 2967--2974.  ",
      "doi": "10.1145/3027063.3053225"
    },
    {
      "text": "Leonard Wein. 2014. Visual Recognition in Museum Guide Apps: Do Visitors Want It?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 635--638.  ",
      "doi": "10.1145/2556288.2557270"
    },
    {
      "text": "Soo Youn Oh, Jeremy Bailenson, Erika Weisz, and Jamil Zaki. 2016. Virtually old: Embodied perspective taking and the reduction of ageism under threat. Computers in Human Behavior 60 (2016), 398--410.  ",
      "doi": "10.1016/j.chb.2016.02.007"
    },
    {
      "text": "Chun Yu, Yizheng Gu, Zhican Yang, Xin Yi, Hengliang Luo, and Yuanchun Shi. 2017. Tap, Dwell or Gesture?: Exploring Head-Based Text Entry Techniques for HMDs. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4479--4488.  ",
      "doi": "10.1145/3025453.3025964"
    },
    {
      "text": "Shuo Zhou and Michael A. Shapiro. 2017. Measuring Actor-Observer Perspective Taking in Narrative Processing. International Communication Association (ICA) Conference, San Diego, CA.",
      "doi": ""
    },
    {
      "text": "Jordan Zlatev, Timothy P. Racine, Chris Sinha, and Esa Itkonen. 2008. The shared mind: Perspectives on intersubjectivity. John Benjamins Publishing.",
      "doi": ""
    }
  ]
}