{
  "doi": "10.1145/3173574.3174214",
  "title": "Voice Interfaces in Everyday Life",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Voice User Interfaces (VUIs) are becoming ubiquitously available, being embedded both into everyday mobility via smartphones, and into the life of the home via 'assistant' devices. Yet, exactly how users of such devices practically thread that use into their everyday social interactions remains underexplored. By collecting and studying audio data from month-long deployments of the Amazon Echo in participants' homes-informed by ethnomethodology and conversation analysis-our study documents the methodical practices of VUI users, and how that use is accomplished in the complex social life of the home. Data we present shows how the device is made accountable to and embedded into conversational settings like family dinners where various simultaneous activities are being achieved. We discuss how the VUI is finely coordinated with the sequential organisation of talk. Finally, we locate implications for the accountability of VUI interaction, request and response design, and raise conceptual challenges to the notion of designing 'conversational' interfaces.",
  "tags": [
    "conversation analysis",
    "intelligent personal assistants",
    "conversational user interface",
    "conversational agent",
    "collocated interaction",
    "ethnomethodology",
    "amazon echo"
  ],
  "authors": [
    {
      "name": "Martin Porcheron",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-87958771157/rel-imgonly/martinporcheron2021-square.png",
      "acmid": "87958771157",
      "orcid": "0000-0003-3814-7174"
    },
    {
      "name": "Joel E. Fischer",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81416603014/rel-imgonly/joel.jpg",
      "acmid": "81416603014",
      "orcid": "missing"
    },
    {
      "name": "Stuart Reeves",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100228688/rel-imgonly/headshot2-2016.jpg",
      "acmid": "81100228688",
      "orcid": "missing"
    },
    {
      "name": "Sarah Sharples",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323495754",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Maxwell Atkinson and John Heritage. 1984. Transcript Notation. In Structures of Social Action: Studies in Conversation Analysis. Cambridge University Press, ix--xvi.",
      "doi": ""
    },
    {
      "text": "Liam Bannon, John Bowers, Peter Carstensen, John A. Hughes, Kari Kuutii, James Pycock, Tom Rodden, Kjeld Schmidt, Dan Shapiro, Wes Sharrock, and Stephen Viller. 1993. Informing CSCW System Requirements. In COMIC Deliverable 2.1.",
      "doi": ""
    },
    {
      "text": "Graham Button, Jeff Coulter, John R. E. Lee, and Wes Sharrock. 1995. Computers, Minds and Conduct. Polity Press, Cambridge, UK. ",
      "doi": "10.5555/581100"
    },
    {
      "text": "Andy Crabtree, Steve Benford, Chris Greenhalgh, Paul Tennent, Matthew Chalmers, and Barry Brown. 2006. Supporting Ethnographic Studies of Ubiquitous Computing in the Wild. In Proceedings of the 6th ACM Conference on Designing Interactive Systems (DIS '06), 60.  ",
      "doi": "10.1145/1142405.1142417"
    },
    {
      "text": "David DeVault, Ron Artstein, Grace Benn, Teresa Dey, Ed Fast, Alesia Gainer, Kallirroi Georgila, Jon Gratch, Arno Hartholt, Margaux Lhommet, Gale Lucas, Stacy Marsella, Fabrizio Morbini, Angela Nazarian, Stefan Scherer, Giota Stratou, Apar Suri, David Traum, Rachel Wood, Yuyu Xu, Albert Rizzo, and Louisphilippe Morency. 2014. SimSensei Kiosk: A Virtual Human Interviewer for Healthcare Decision Support. International Conference on Autonomous Agents and Multi-Agent Systems, 1: 1061--1068. ",
      "doi": "10.5555/2615731.2617415"
    },
    {
      "text": "Paul Dourish and Graham Button. 1998. On \"Technomethodology\": Foundational Relationships Between Ethnomethodology and System Design. Human-Computer Interaction 13, 4: 395--432.  ",
      "doi": "10.1207/s15327051hci1304_2"
    },
    {
      "text": "Hasan Shahid Ferdous, Frank Vetere, Hilary Davis, Bernd Ploderer, and Kenton OHara. 2016. Technologies At Mealtime: Collocated Interactions In The Family Home. In CHI '16 Workshop on Proxemic Mobile Collocated Interactions.",
      "doi": ""
    },
    {
      "text": "Harold Garfinkel. 1967. Studies in Ethnomethodology. Prentice-Hall.",
      "doi": ""
    },
    {
      "text": "Nigel Gilbert, Robin Wooffitt, and Norman Fraser. 1990. Organising Computer Talk. In Computers and Conversation (1st edition), Paul Luff, David Frohlich and Nigel Gilbert (eds.). Academic Press, 235 -- 257.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin and John Heritage. 1990. Conversation Analysis. Annual Review of Anthropology 19, 1: 283--307.",
      "doi": ""
    },
    {
      "text": "Christian Heath, Jon Hindmarsh, and Paul Luff. 2010. Video in Qualitative Research. SAGE.",
      "doi": ""
    },
    {
      "text": "Jiepu Jiang, Wei Jeng, and Daqing He. 2013. How Do Users Respond to Voice Input Errors?: Lexical and Phonetic Query Reformulation in Voice Search. In Proceedings of the 36th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '13), 143--152.  ",
      "doi": "10.1145/2484028.2484092"
    },
    {
      "text": "Mohammed Waleed Kadous and Claude Sammut. 2004. InCa: A Mobile Conversational Agent. PRICAI 2004: Trends in Artificial Intelligence 3157: 644--653.",
      "doi": ""
    },
    {
      "text": "Stefan Kopp, Lars Gesellensetter, Nicole C. Krämer, and Ipke Wachsmuth. 2005. A Conversational Agent as Museum Guide -- Design and Evaluation of a RealWorld Application. In Lecture Notes in Computer Science, 329--343.  ",
      "doi": "10.1007/11550617_28"
    },
    {
      "text": "Stephen C. Levinson. 1983. Pragmatics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "J. C. R. Licklider. 1960. Man-Computer Symbiosis. IRE Transactions on Human Factors in Electronics HFE-1, 1: 4--11.",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Moira McGregor and John Tang. 2017. More to Meetings: Challenges in Using Speech-Based Technology to Support Meetings. In Proceedings of the 20th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '17).  ",
      "doi": "10.1145/2998181.2998335"
    },
    {
      "text": "Michael McTear. 2002. Spoken Dialogue Technology: Enabling the Conversational User Interface. ACM Computing Surveys 34, 1: 90--169.  ",
      "doi": "10.1145/505282.505285"
    },
    {
      "text": "Michael McTear, Zoraida Callejas, and David Griol. 2016. The Conversational Interface. Springer International Publishing. ",
      "doi": "10.5555/2965050"
    },
    {
      "text": "Dong Nguyen, A. Seza Doğruöz, Carolyn P. Rosé, and Franciska de Jong. 2016. Computational Sociolinguistics: A Survey. Computational Linguistics 42, 3: 537--593.  ",
      "doi": "10.1162/COLI_a_00258"
    },
    {
      "text": "Kenton O'Hara, Richard Harper, Helena Mentis, Abigail Sellen, and Alex Taylor. 2013. On the Naturalness of Touchless: Putting the \"Interaction\" Back into NUI. ACM Transactions on ComputerHuman Interaction 20, 1: 1--25.  ",
      "doi": "10.1145/2442106.2442111"
    },
    {
      "text": "Sabine Payr. 2013. Virtual butlers and real people: styles and practices in long-term use of a companion. In Your Virtual Butler, Robert Trappl (ed.). SpringerVerlag Berlin, Heidelberg, 134--178. ",
      "doi": "10.5555/2554494.2554509"
    },
    {
      "text": "Hannah R. M. Pelikan and Mathias Broth. 2016. Why That Nao?: How Humans Adapt to a Conventional Humanoid Robot in Taking Turns-at-Talk. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4921--4932.  ",
      "doi": "10.1145/2858036.2858478"
    },
    {
      "text": "Stefania Pizza, Barry Brown, Donald McMillan, and Airi Lampinen. 2016. Smartwatch in vivo. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5456--5469.  ",
      "doi": "10.1145/2858036.2858522"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Moira McGregor, Barry Brown, Ewa Luger, Heloisa Candello, and Kenton O'Hara. 2017. Talking with Conversational Agents in Collaborative Action. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion), 431--436.  ",
      "doi": "10.1145/3022198.3022666"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, and Sarah Sharples. 2017. \"Do Animals Have Accents?\": Talking with Agents in Multi-Party Conversation. In Proceedings of the 20th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '17).  ",
      "doi": "10.1145/2998181.2998298"
    },
    {
      "text": "Stuart Reeves and Barry Brown. 2016. Embeddedness and Sequentiality in Social Media. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 1050--1062.  ",
      "doi": "10.1145/2818048.2820008"
    },
    {
      "text": "Jacob M. Rigby, Duncan P. Brumby, Sandy J. J. Gould, and Anna L Cox. 2017. Media Multitasking at Home. In Proceedings of the 2017 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '17), 3--10.  ",
      "doi": "10.1145/3077548.3077560"
    },
    {
      "text": "Sean Rintel, Richard Harper, and Kenton O'Hara. 2016. The Tyranny of the Everyday in Mobile Video Messaging. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 47814792.  ",
      "doi": "10.1145/2858036.2858042"
    },
    {
      "text": "John Rooksby, Timothy E. Smith, Alistair Morrison, Mattias Rost, and Matthew Chalmers. 2015. Configuring Attention in the Multiscreen Living Room. In Proceedings of the 14th European Conference on Computer Supported Cooperative Work (ECSCW '15), 243--261.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks. 1992. Harvey Sacks: Lectures on Conversation. Basil Publishing, Oxford.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks, Emanuel A. Schegloff, and Gail Jefferson. 1974. A Simplest Systematics for the Organization of Turn-Taking for Conversation. Language 50, 4: 696--735.",
      "doi": ""
    },
    {
      "text": "Emanuel A. Schegloff. 1987. Analyzing Single Episodes of Interaction: An Exercise in Conversation Analysis. Social Psychology Quarterly 50, 2: 101--114.",
      "doi": ""
    },
    {
      "text": "Emanuel A. Schegloff. 2007. Sequence Organization in Interaction. Cambridge University Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Tanya Stivers, N. J. Enfield, Penelope Brown, Christina Englert, Makoto Hayashi, Trine Heinemann, Gertie Hoymann, Federico Rossano, Jan Peter de Ruiter, Kyung-Eun Yoon, and Stephen C Levinson. 2009. Universals and cultural variation in turn-taking in conversation. Proceedings of the National Academy of Sciences of the United States of America 106, 26: 10587--92.",
      "doi": ""
    },
    {
      "text": "Peter Tolmie and Andy Crabtree. 2008. Deploying Research Technology in the Home. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08), 639--648.  ",
      "doi": "10.1145/1460563.1460662"
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, and Steve Benford. 2008. \"Are You Watching This Film or What?\" Interruption and the Juggling of Cohorts. In Proceedings of the ACM 2008 Conference on Computer Supported Cooperative Work (CSCW '08), 257.  ",
      "doi": "10.1145/1460563.1460605"
    },
    {
      "text": "Sherry Turkle. 2011. Alone Together: Why We Expect More from Technology and Less from Each Other. Basic Books. ",
      "doi": "10.5555/1972496"
    },
    {
      "text": "Laura Pfeifer Vardoulakis, Lazlo Ring, Barbara Barry, Candace L. Sidner, and Timothy Bickmore. 2012. Designing Relational Agents as Long Term Social Companions for Older Adults. In Intelligent Virtual Agents. 289--302.",
      "doi": ""
    },
    {
      "text": "Robin Wooffitt. 1994. Applying Sociology: Conversation Analysis in the Study of Human(Simulated) Computer Interaction. Bulletin de Méthodologie Sociologique 43, 1: 7--33.",
      "doi": ""
    },
    {
      "text": "Victor Zue, Stephanie Seneff, J. R. Glass, Joseph Polifroni, Christine Pao, T. J. Hazen, and Lee Hetherington. 2000. JUPlTER: a telephone-based conversational interface for weather information. IEEE Transactions on Speech and Audio Processing 8, 1: 85--96.",
      "doi": ""
    }
  ]
}