{
  "doi": "10.1145/3173574.3174074",
  "title": "T-Cal: Understanding Team Conversational Data with Calendar-based Visualization",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Understanding team communication and collaboration patterns is critical for improving work efficiency in organizations. This paper presents an interactive visualization system, T-Cal, that supports the analysis of conversation data from modern team messaging platforms (e.g., Slack). T-Cal employs a user-familiar visual interface, a calendar, to enable seamless multi-scale browsing of data from different perspectives. T-Cal also incorporates a number of analytical techniques for disentangling interleaving conversations, extracting keywords, and estimating sentiment. The design of T-Cal is based on an iterative user-centered design process including interview studies, requirements gathering, initial prototypes demonstration, and evaluation with domain users. The resulting two case studies indicate the effectiveness and usefulness of T-Cal in real-world applications, including daily conversations within an industry research lab and student group chats in a MOOC.",
  "authors": [
    {
      "name": "Siwei Fu",
      "institution": "Hong Kong University of Science&Technology, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659093496",
      "orcid": "missing"
    },
    {
      "name": "Jian Zhao",
      "institution": "FX Palo Alto Laboratory, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81484648585/rel-imgonly/dsc_7313__jian_zhao_portrait_large_.jpg",
      "acmid": "81484648585",
      "orcid": "missing"
    },
    {
      "name": "Hao Fei Cheng",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659156442",
      "orcid": "missing"
    },
    {
      "name": "Haiyi Zhu",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81484646857/rel-imgonly/headshot.png",
      "acmid": "81484646857",
      "orcid": "0000-0001-7271-9100"
    },
    {
      "name": "Jennifer Marlow",
      "institution": "FX Palo Alto Laboratory, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482656556",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. Microsoft Teams-Group Chat Software. https://products.office.com/en-us/microsoft-teams/ group-chat-software. (2017). Accessed: 2017--8--18.",
      "doi": ""
    },
    {
      "text": "2017. Online Courses From Top Universities. Join For Free. https://www.coursera.org/. (2017). Accessed: 2017--8--18.",
      "doi": ""
    },
    {
      "text": "2017. Slack: Where work happens. https://www.slack.com/. (2017). Accessed: 2017--8--18.",
      "doi": ""
    },
    {
      "text": "2017. Workplace by Facebook - A New Way to Work. https://www.facebook.com/workplace. (2017). Accessed: 2017--8--18.",
      "doi": ""
    },
    {
      "text": "Basak Alper, Benjamin Bach, Nathalie Henry Riche, Tobias Isenberg, and Jean-Daniel Fekete. 2013. Weighted Graph Comparison Techniques for Brain Connectivity Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 483--492.  ",
      "doi": "10.1145/2470654.2470724"
    },
    {
      "text": "Henrik Artman and Christer Garbis. 1998. Team communication and coordination as distributed cognition. In 9th Conference of Cognitive Ergonomics. 151--156.",
      "doi": ""
    },
    {
      "text": "Farzindar Atefeh and Wael Khreich. 2015. A Survey of Techniques for Event Detection in Twitter. Comput. Intell. 31, 1 (Feb. 2015), 132--164.  ",
      "doi": "10.1111/coin.12017"
    },
    {
      "text": "Giuseppe Di Battista, Peter Eades, Roberto Tamassia, and Ioannis G Tollis. 1998. Graph Drawing: Algorithms for the Visualization of Graphs. Prentice Hall PTR. ",
      "doi": "10.5555/551884"
    },
    {
      "text": "Tony Bergstrom and Karrie Karahalios. 2009. Conversation Clusters: Grouping Conversation Topics Through Human-computer Dialog. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 2349--2352.  ",
      "doi": "10.1145/1518701.1519060"
    },
    {
      "text": "Steven Bird, Ewan Klein, and Edward Loper. 2009. Natural language processing with Python. O'Reilly Media, Inc. ",
      "doi": "10.5555/1717171"
    },
    {
      "text": "David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of machine Learning research 3, Jan (2003), 993--1022. ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "Ulrik Brandes and Bobo Nick. 2011. Asymmetric Relations in Longitudinal Social Networks. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2283--2290.  ",
      "doi": "10.1109/TVCG.2011.169"
    },
    {
      "text": "Nan Cao, Lu Lu, Yu-Ru Lin, Fei Wang, and Zhen Wen. 2015. SocialHelix: visual analysis of sentiment divergence in social media. Journal of Visualization 18, 2 (01 May 2015), 221--235.  ",
      "doi": "10.1007/s12650-014-0246-x"
    },
    {
      "text": "W. Cui, S. Liu, L. Tan, C. Shi, Y. Song, Z. Gao, H. Qu, and X. Tong. 2011. TextFlow: Towards Better Understanding of Evolving Topics in Text. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec 2011), 2412--2421.  ",
      "doi": "10.1109/TVCG.2011.239"
    },
    {
      "text": "Weiwei Cui, Shixia Liu, Zhuofeng Wu, and Hao Wei. 2014. How Hierarchical Topics Evolve in Large Text Corpora. Visualization and Computer Graphics, IEEE Transactions on 20, 12 (2014), 2281--2290.",
      "doi": ""
    },
    {
      "text": "Kushal Dave, Martin Wattenberg, and Michael Muller. 2004. Flash Forums and forumReader: Navigating a New Kind of Large-scale Online Discussion. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). 232--241.  ",
      "doi": "10.1145/1031607.1031644"
    },
    {
      "text": "Judith Donath and Fernanda B. Viégas. 2002. The Chat Circles Series: Explorations in Designing Abstract Graphical Communication Interfaces. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, New York, NY, USA, 359--369.  ",
      "doi": "10.1145/778712.778764"
    },
    {
      "text": "W. Dou, X. Wang, R. Chang, and W. Ribarsky. 2011. ParallelTopics: A probabilistic approach to exploring document collections. In 2011 IEEE Conference on Visual Analytics Science&Technology (VAST). 231--240.",
      "doi": ""
    },
    {
      "text": "W. Dou, L. Yu, X. Wang, Z. Ma, and W. Ribarsky. 2013. HierarchicalTopics: Visually Exploring Large Text Collections Using Topic Hierarchies. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec 2013), 2002--2011.  ",
      "doi": "10.1109/TVCG.2013.162"
    },
    {
      "text": "Mennatallah El-Assady, Valentin Gold, Carmela Acevedo, Christopher Collins, and Daniel Keim. 2016. ConToVi: Multi-Party Conversation Exploration using Topic-Space Views. Computer Graphics Forum 35, 3 (2016), 431--440. ",
      "doi": "10.5555/3071534.3071580"
    },
    {
      "text": "Mennatallah El-Assady, Rita Sevastjanova, Bela Gipp, Daniel Keim, and Christopher Collins. 2017. NEREx: Named-Entity Relationship Exploration in Multi-Party Conversations. Computer Graphics Forum 36, 3 (2017), 213--225.  ",
      "doi": "10.1111/cgf.13181"
    },
    {
      "text": "Micha Elsner and Eugene Charniak. 2010. Disentangling Chat. Comput. Linguist. 36, 3 (Sept. 2010), 389--409.  ",
      "doi": "10.1162/coli_a_00003"
    },
    {
      "text": "S. Fu, J. Zhao, W. Cui, and H. Qu. 2017. Visual Analysis of MOOC Forums with iForum. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan 2017), 201--210.  ",
      "doi": "10.1109/TVCG.2016.2598444"
    },
    {
      "text": "S. Havre, E. Hetzler, P. Whitney, and L. Nowell. 2002. ThemeRiver: visualizing thematic changes in large document collections. IEEE Transactions on Visualization and Computer Graphics 8, 1 (Jan 2002), 9--20.  ",
      "doi": "10.1109/2945.981848"
    },
    {
      "text": "E. Hoque and G. Carenini. 2014. ConVis: A Visual Text Analytic System for Exploring Blog Conversations. Computer Graphics Forum 33, 3 (2014), 221--230.",
      "doi": ""
    },
    {
      "text": "Enamul Hoque and Giuseppe Carenini. 2016. MultiConVis: A Visual Text Analytics System for Exploring a Collection of Online Conversations. In Proceedings of the 21st International Conference on Intelligent User Interfaces (IUI '16). ACM, New York, NY, USA, 96--107.  ",
      "doi": "10.1145/2856767.2856782"
    },
    {
      "text": "Sujana Jyothi, Claire McAvinia, and John Keating. 2012. A Visualisation Tool to Aid Exploration of Students' Interactions in Asynchronous Online Communication. Comput. Educ. 58, 1 (2012), 30--42.  ",
      "doi": "10.1016/j.compedu.2011.08.026"
    },
    {
      "text": "Areti Karamanou, Nikolaos Loutas, and Konstantinos Tarabanis. 2011. ArgVis: Structuring Political Deliberations Using Innovative Visualisation Technologies. Springer Berlin Heidelberg, Berlin, Heidelberg, 87--98.",
      "doi": ""
    },
    {
      "text": "B. Kerr. 2003. Thread Arcs: an email thread visualization. In Information Visualization, 2003. INFOVIS 2003. IEEE Symposium on. 211--218. ",
      "doi": "10.5555/1947368.1947407"
    },
    {
      "text": "B.C. Kwon, S. Kim, S. Lee, J. Choo, J. Huh, and J.S. Yi. 2016. VisOHC: Designing Visual Analytics for Online Health Communities. Visualization and Computer Graphics, IEEE Transactions on 22, 1 (2016), 71--80.",
      "doi": ""
    },
    {
      "text": "Gilly Leshed, Diego Perez, Jeffrey T. Hancock, Dan Cosley, Jeremy Birnholtz, Soyoung Lee, Poppy L. McLeod, and Geri Gay. 2009. Visualizing Real-time Language-based Feedback on Teamwork Behavior in Computer-mediated Groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 537--546.  ",
      "doi": "10.1145/1518701.1518784"
    },
    {
      "text": "S. Liu, J. Yin, X. Wang, W. Cui, K. Cao, and J. Pei. 2016. Online Visual Analytics of Text Streams. IEEE Transactions on Visualization and Computer Graphics 22, 11 (Nov 2016), 2451--2466.",
      "doi": "10.1109/TVCG.2015.2509990"
    },
    {
      "text": "Tamara Munzner. 2009. A Nested Model for Visualization Design and Validation. IEEE Transactions on Visualization and Computer Graphics 15, 6 (Nov. 2009), 921--928.  ",
      "doi": "10.1109/TVCG.2009.111"
    },
    {
      "text": "S. Narayan and C. Cheshire. 2010. Not Too Long to Read: The tldr Interface for Exploring and Navigating Large-Scale Discussion Spaces. In System Sciences, 2010. Proceedings of the 43rd Annual Hawaii International Conference on. 1--10.  ",
      "doi": "10.1109/HICSS.2010.288"
    },
    {
      "text": "Paula S. Newman. 2002. Exploring Discussion Lists: Steps and Directions. In Proceedings of the 2nd ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL '02). 126--134.  ",
      "doi": "10.1145/544220.544245"
    },
    {
      "text": "V. Pascual-Cid and A. Kaltenbrunner. 2009. Exploring Asynchronous Online Discussions through Hierarchical Visualisation. In Information Visualization, 2009 13th International Conference. 191--196.  ",
      "doi": "10.1109/IV.2009.14"
    },
    {
      "text": "Adam Perer, Ben Shneiderman, and Douglas W. Oard. 2006. Using rhythms of relationships to understand e-mail archives. Journal of the American Society for Information Science&Technology 57, 14 (2006), 1936--1948. ",
      "doi": "10.5555/1182620.1182622"
    },
    {
      "text": "Arti Ramesh, Dan Goldwasser, Bert Huang, Hal Daume III, and Lise Getoor. 2014. Understanding MOOC Discussion Forums using Seeded LDA. In 9th ACL Workshop on Innovative Use of NLP for Building Educational Applications.",
      "doi": ""
    },
    {
      "text": "Stuart Rose, Dave Engel, Nick Cramer, and Wendy Cowley. 2010. Automatic Keyword Extraction from Individual Documents. John Wiley&Sons, Ltd, 1--20.",
      "doi": ""
    },
    {
      "text": "Warren Sack. 2000. Discourse diagrams: Interface design for very large-scale conversations. In System Sciences, 2000. Proceedings of the 33rd Annual Hawaii International Conference on. IEEE, 10. ",
      "doi": "10.5555/820261.820276"
    },
    {
      "text": "B. Shneiderman. 1996. The eyes have it: a task by data type taxonomy for information visualizations. In Proceedings 1996 IEEE Symposium on Visual Languages. IEEE. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Ben Shneiderman and Catherine Plaisant. 2006. Strategies for Evaluating Information Visualization Tools: Multi-dimensional In-depth Long-term Case Studies. In Proceedings of the 2006 AVI Workshop on BEyond Time and Errors: Novel Evaluation Methods for Information Visualization (BELIV '06). ACM, New York, NY, USA, 1--7.  ",
      "doi": "10.1145/1168149.1168158"
    },
    {
      "text": "G. Sun, Y. Wu, S. Liu, T. Q. Peng, J. J. H. Zhu, and R. Liang. 2014. EvoRiver: Visual Analysis of Topic Coopetition on Social Media. IEEE Transactions on Visualization and Computer Graphics 20, 12 (Dec 2014), 1753--1762.",
      "doi": ""
    },
    {
      "text": "Gina Danielle Venolia and Carman Neustaedter. 2003. Understanding Sequence and Reply Relationships Within Email Conversations: A Mixed-model Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). 361--368.  ",
      "doi": "10.1145/642611.642674"
    },
    {
      "text": "Fernanda B. Viégas, Scott Golder, and Judith Donath. 2006. Visualizing Email Content: Portraying Relationships from Conversational Histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 979--988.  ",
      "doi": "10.1145/1124772.1124919"
    },
    {
      "text": "Lidan Wang and Douglas W. Oard. 2009. Context-based Message Expansion for Disentanglement of Interleaved Text Conversations. In Proceedings of Human Language Technologies: The 2009 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL '09). Association for Computational Linguistics, Stroudsburg, PA, USA, 200--208. http://dl.acm.org/citation.cfm?id=1620754.1620783 ",
      "doi": "10.5555/1620754.1620783"
    },
    {
      "text": "Weixin Wang, Hui Wang, Guozhong Dai, and Hongan Wang. 2006. Visualization of Large Hierarchical Data by Circle Packing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). 517--520.  ",
      "doi": "10.1145/1124772.1124851"
    },
    {
      "text": "Franz Wanner, Thomas Ramm, and Daniel A. Keim. 2011. ForAVis: Explorative User Forum Analysis. In Proceedings of the International Conference on Web Intelligence, Mining and Semantics (WIMS '11). Article 14, 10 pages.  ",
      "doi": "10.1145/1988688.1988705"
    },
    {
      "text": "Merrill Warkentin and Peggy M. Beranek. 1999. Training to improve virtual team communication. Information Systems Journal 9, 4 (1999), 271--289.",
      "doi": ""
    },
    {
      "text": "Martin Wattenberg and David Millen. 2003. Conversation Thumbnails for Large-scale Discussions. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). 742--743.  ",
      "doi": "10.1145/765891.765963"
    },
    {
      "text": "Furu Wei, Shixia Liu, Yangqiu Song, Shimei Pan, Michelle X. Zhou, Weihong Qian, Lei Shi, Li Tan, and Qiang Zhang. 2010. TIARA: A Visual Exploratory Text Analytic System. In Proceedings of the 16th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '10). 153--162.  ",
      "doi": "10.1145/1835804.1835827"
    },
    {
      "text": "J. J. Van Wijk and E. R. Van Selow. 1999. Cluster and calendar based visualization of time series data. In Information Visualization, 1999. (Info Vis '99) Proceedings. 1999 IEEE Symposium on. 4--9, 140. ",
      "doi": "10.5555/857189.857665"
    },
    {
      "text": "Yingcai Wu, Shixia Liu, Kai Yan, Mengchen Liu, and Fangzhao Wu. 2014. OpinionFlow: Visual Analysis of Opinion Diffusion on Social Media. Visualization and Computer Graphics, IEEE Transactions on 20, 12 (2014), 1763--1772.",
      "doi": ""
    },
    {
      "text": "Panpan Xu, Yingcai Wu, Enxun Wei, Tai-Quan Peng, Shixia Liu, J.J.H. Zhu, and Huamin Qu. 2013. Visual Analysis of Topic Competition on Social Media. Visualization and Computer Graphics, IEEE Transactions on 19, 12 (2013), 2012--2021.  ",
      "doi": "10.1109/TVCG.2013.221"
    },
    {
      "text": "Ka-Ping Yee and Marti Hearst. 2005. Content-centered discussion mapping. Online Deliberation (2005).",
      "doi": ""
    },
    {
      "text": "J. Zhao, N. Cao, Z. Wen, Y. Song, Y. R. Lin, and C. Collins. 2014. #FluxFlow: Visual Analysis of Anomalous Information Spreading on Social Media. IEEE Transactions on Visualization and Computer Graphics 20, 12 (Dec 2014), 1773--1782.",
      "doi": ""
    }
  ]
}