{
  "doi": "10.1145/3173574.3173867",
  "title": "SpeechBubbles: Enhancing Captioning Experiences for Deaf and Hard-of-Hearing People in Group Conversations",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Deaf and hard-of-hearing (DHH) individuals encounter difficulties when engaged in group conversations with hearing individuals, due to factors such as simultaneous utterances from multiple speakers and speakers whom may be potentially out of view. We interviewed and co-designed with eight DHH participants to address the following challenges: 1) associating utterances with speakers, 2) ordering utterances from different speakers, 3) displaying optimal content length, and 4) visualizing utterances from out-of-view speakers. We evaluated multiple designs for each of the four challenges through a user study with twelve DHH participants. Our study results showed that participants significantly preferred speechbubble visualizations over traditional captions. These design preferences guided our development of SpeechBubbles, a real-time speech recognition interface prototype on an augmented reality head-mounted display. From our evaluations, we further demonstrated that DHH participants preferred our prototype over traditional captions for group conversations.",
  "tags": [
    "hololens",
    "deaf and hard of hearing",
    "closed captions",
    "augmented reality",
    "accessibility",
    "text bubbles",
    "word balloons"
  ],
  "authors": [
    {
      "name": "Yi-Hao Peng",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-99659261824/rel-imgonly/me_hci_2.png",
      "acmid": "99659261824",
      "orcid": "0000-0002-6335-5904"
    },
    {
      "name": "Ming-Wei Hsi",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260793",
      "orcid": "missing"
    },
    {
      "name": "Paul Taele",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/do/10.1145/contrib-81443597406/rel-imgonly/paul.jpg",
      "acmid": "81443597406",
      "orcid": "missing"
    },
    {
      "name": "Ting-Yu Lin",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261236",
      "orcid": "missing"
    },
    {
      "name": "Po-En Lai",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261114",
      "orcid": "missing"
    },
    {
      "name": "Leon Hsu",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261932",
      "orcid": "missing"
    },
    {
      "name": "Tzu-chuan Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261980",
      "orcid": "missing"
    },
    {
      "name": "Te-Yen Wu",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658755390",
      "orcid": "missing"
    },
    {
      "name": "Yu-An Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260768",
      "orcid": "missing"
    },
    {
      "name": "Hsien-Hui Tang",
      "institution": "National Taiwan University of Science & Technology, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508691680",
      "orcid": "missing"
    },
    {
      "name": "Mike Y. Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81460645188/rel-imgonly/mikebiophotosmall.jpg",
      "acmid": "81460645188",
      "orcid": "0000-0001-5410-652X"
    }
  ],
  "references": [
    {
      "text": "Ava. http://www.ava.me/.",
      "doi": ""
    },
    {
      "text": "Google Noto Fonts. https://www.google.com/get/noto/help/guidelines/.",
      "doi": ""
    },
    {
      "text": "UNI. http://www.motionsavvy.com/.",
      "doi": ""
    },
    {
      "text": "Unity. https://www.unity3d.com/.",
      "doi": ""
    },
    {
      "text": "Andy Brown, Rhia Jones, Mike Crabb, James Sandford, Matthew Brooks, Mike Armstrong, and Caroline Jay. 2015. Dynamic Subtitles: The User Experience. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '15). ACM, New York, NY, USA, 103--112.  ",
      "doi": "10.1145/2745197.2745204"
    },
    {
      "text": "Delia Chiaro, Christine Heiss, and Chiara Bucaria. 2008. Between Text and Image: Updating Research in Screen Translation. John Benjamins Publishing Company, Amsterdam, Netherlands.",
      "doi": ""
    },
    {
      "text": "Bong-Kyung Chun, Dong-Sung Ryu, Won-Il Hwang, and Hwan-Gue Cho. 2006. An Automated Procedure for Word Balloon Placement in Cinema Comics. In Advances in Visual Computing: Second International Symposium, ISVC 2006 Lake Tahoe, NV, USA, November 6--8, 2006. Proceedings, Part II. Springer Berlin Heidelberg, Berlin, Heidelberg, 576--585.  ",
      "doi": "10.1007/11919629_58"
    },
    {
      "text": "Michael Crabb, Rhianne Jones, Mike Armstrong, and Chris J. Hughes. 2015. Online News Videos: The UX of Subtitle Position. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 215--222.  ",
      "doi": "10.1145/2700648.2809866"
    },
    {
      "text": "Marilyn E. Demorest and Sue Ann Erdman. 1986. Scale Composition and Item Analysis of the Communication Profile for the Hearing Impaired. Journal of Speech and Hearing Research 29, 4 (dec 1986), 515--535.",
      "doi": ""
    },
    {
      "text": "Gilbert C.F. Fong. 2009. Let the Words Do the Talking: The Nature and Art of Subtitling. In Dubbing and Subtitling in a World Context. The Chinese University of Hong Kong, 91--106.",
      "doi": ""
    },
    {
      "text": "Benjamin M. Gorman. 2014. VisAural: A Wearable Sound-localisation Device for People with Impaired Hearing. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 337--338.  ",
      "doi": "10.1145/2661334.2661410"
    },
    {
      "text": "Jan Gugenheimer, Katrin Plaumann, Florian Schaub, Patrizia Di Campli San Vito, Saskia Duck, Melanie Rabus, and Enrico Rukzio. 2017. The Impact of Assistive Technology on Communication Quality Between Deaf and Hearing Individuals. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 669--682.  ",
      "doi": "10.1145/2998181.2998203"
    },
    {
      "text": "Stephen R. Gulliver. 2002. Impact of Captions on Deaf and Hearing Perception of Multimedia Video Clips. In Proceedings of the 2002 IEEE International Conference on Multimedia and Expo (ICME '02), Vol. 1. IEEE, Washington, DC, USA, 753--756.",
      "doi": ""
    },
    {
      "text": "Stephen R. Gulliver and George Ghinea. 2003. How Level and Type of Deafness Affect User Perception of Multimedia Video Clips. Universal Access in the Information Society 2, 4 (nov 2003), 374--386.  ",
      "doi": "10.1007/s10209-003-0067-5"
    },
    {
      "text": "Richard S. Hallam and Roslyn Corney. 2014. Conversation Tactics in Persons with Normal Hearing and Hearing-impairment. International Journal of Audiology 53, 3 (mar 2014), 174--181.",
      "doi": ""
    },
    {
      "text": "Marion A. Hersh and Michael A. Johnson. 2003. Assistive Technology for the Hearing-impaired, Deaf and Deafblind. Springer-Verlag London, London, England, UK.",
      "doi": ""
    },
    {
      "text": "Myles Hollander, Douglas A. Wolfe, and Eric Chicken. 1999. Nonparametric Statistical Methods. Wiley, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Richang Hong, Meng Wang, Mengdi Xu, Shuicheng Yan, and Tat-Seng Chua. 2010. Dynamic Captioning: Video Accessibility Enhancement for Hearing Impairment. In Proceedings of the 18th ACM International Conference on Multimedia (MM '10). ACM, New York, NY, USA, 421--430.  ",
      "doi": "10.1145/1873951.1874013"
    },
    {
      "text": "Dhruv Jain, Leah Findlater, Jamie Gilkeson, Benjamin Holland, Ramani Duraiswami, Dmitry Zotkin, Christian Vogler, and Jon E. Froehlich. 2015. Head-Mounted Display Visualizations to Support Sound Awareness for the Deaf and Hard of Hearing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 241--250.  ",
      "doi": "10.1145/2702123.2702393"
    },
    {
      "text": "Jacek Jankowski, Krystian Samp, Izabela Irzynska, Marek Jozwowicz, and Stefan Decker. 2010. Integrating Text with Video and 3D Graphics: The Effects of Text Drawing Styles on Text Readability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1321--1330.  ",
      "doi": "10.1145/1753326.1753524"
    },
    {
      "text": "Fotios Karamitroglou. 1998. A Proposed Set of Subtitling Standards in Europe. Translation Journal 2, 2 (1998), 1â S15.",
      "doi": ""
    },
    {
      "text": "Saba Kawas, George Karalis, Tzu Wen, and Richard E. Ladner. 2016. Improving Real-Time Captioning Experiences for Deaf and Hard of Hearing Students. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 15--23.  ",
      "doi": "10.1145/2982142.2982164"
    },
    {
      "text": "Cees M. Koolstra, Allerd L. Peeters, and Herman Spinhof. 2002. The Pros and Cons of Dubbing and Subtitling. European Journal of Communication 17 (sep 2002), 325--354.",
      "doi": ""
    },
    {
      "text": "David Kurlander, Tim Skelly, and David Salesin. 1996. Comic Chat. In Proceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '96). ACM, New York, NY, USA, 225--236.  ",
      "doi": "10.1145/237170.237260"
    },
    {
      "text": "Kuno Kurzhals, Emine Cetinkaya, Yongtao Hu, Wenping Wang, and Daniel Weiskopf. 2017. Close to the Action: Eye-Tracking Evaluation of Speaker-Following Subtitles. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6559--6568.  ",
      "doi": "10.1145/3025453.3025772"
    },
    {
      "text": "Raja S. Kushalnagar, Gary W. Behm, Aaron W. Kelstone, and Shareef Ali. 2015. Tracked Speech-To-Text Display: Enhancing Accessibility and Readability of Real-Time Speech-To-Text. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 223--230.  ",
      "doi": "10.1145/2700648.2809843"
    },
    {
      "text": "Tara Matthews, Janette Fong, and Jennifer Mankoff. 2005. Visualizing Non-speech Sounds for the Deaf. In Proceedings of the 7th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '05). ACM, New York, NY, USA, 52--59.  ",
      "doi": "10.1145/1090785.1090797"
    },
    {
      "text": "Ryan W. McCreery, Rebecca A. Venediktov, Jaumeiko J. Coleman, and Hillary M. Leech. 2012. An Evidence-Based Systematic Review of Directional Microphones and Digital Noise Reduction Hearing Aids in School-Age Children With Hearing Loss. American Journal of Audiology 21, 2 (dec 2012), 295--312.",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper and James D. Hollan. 2008. Supporting Medical Conversations Between Deaf and Hearing Individuals with Tabletop Displays. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, New York, NY, USA, 147--156.  ",
      "doi": "10.1145/1460563.1460587"
    },
    {
      "text": "Ruiwei Shen, Tsutomu Terada, and Masahiko Tsukamoto. 2012. A System for Visualizing Sound Source Using Augmented Reality. In Proceedings of the 10th International Conference on Advances in Mobile Computing & Multimedia (MoMM '12). ACM, New York, NY, USA, 97--102.  ",
      "doi": "10.1145/2428955.2428979"
    },
    {
      "text": "Nancy Tye-Murray, Suzanne C. Purdy, and George G. Woodworth. 1992. Reported Use of Communication Strategies by SHHH Members: Client, Talker, and Situational Variables. Journal of Speech, Language, and Hearing Research 35 (jun 1992), 708--717.",
      "doi": ""
    },
    {
      "text": "Y. Wang. 2006. Discussion on Technical Principle for Handling with Translation of Captions of Movies and Televisions. Journal of Hebei Polytechnic College 6, 1 (2006), 61--63.",
      "doi": ""
    },
    {
      "text": "Huayong Zhao. 2000. The Approach & Research of Foreign Film Dubbing. Broadcasting Corporation of China, Beijing, China.",
      "doi": ""
    }
  ]
}