{
  "doi": "10.1145/3173574.3173897",
  "title": "From Scanning Brains to Reading Minds: Talking to Engineers about Brain-Computer Interface",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2018,
  "badges": [],
  "abstract": "We presented software engineers in the San Francisco Bay Area with a working brain-computer interface (BCI) to surface the narratives and anxieties around these devices among technical practitioners. Despite this group's heterogeneous beliefs about the exact nature of the mind, we find a shared belief that the contents of the mind will someday be \"read' or \"decoded' by machines. Our findings help illuminate BCI's imagined futures among engineers. We highlight opportunities for researchers to involve themselves preemptively in this nascent space of intimate biosensing devices, suggesting our findings' relevance to long-term futures of privacy and cybersecurity.",
  "tags": [
    "mind-reading",
    "brain-computer interface",
    "technology probe"
  ],
  "authors": [
    {
      "name": "Nick Merrill",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99659085848/rel-imgonly/headshot.jpg",
      "acmid": "99659085848",
      "orcid": "0000-0003-3669-1387"
    },
    {
      "name": "John Chuang",
      "institution": "University of California Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100637202",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Phil Agre. 1997. Computation and Human Experience. ",
      "doi": "10.5555/522884"
    },
    {
      "text": "Sabrina S Ali, Michael Lifshitz, and Amir Raz. 2014. Empirical neuroenchantment: from reading minds to thinking critically. Frontiers in human neuroscience 8, May (may 2014), 357.",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames. 2015. Charismatic Technology. Proceedings of the 5th Decennial AARHUS Conference (2015), 109--120.  ",
      "doi": "10.7146/aahcc.v1i1.21199"
    },
    {
      "text": "Jimmy Ba, Geoffrey E Hinton, Volodymyr Mnih, Joel Z Leibo, and Catalin Ionescu. 2016. Using fast weights to attend to the recent past. In Advances In Neural Information Processing Systems. 4331--4339. ",
      "doi": "10.5555/3157382.3157582"
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07 (2007), 1077.  ",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Francesco Carrino, Joel Dumoulin, Elena Mugellini, Omar Abou Khaled, and Rolf Ingold. 2012. A self-paced BCI system to control an electric wheelchair: Evaluation of a commercial, low-cost EEG device. In 2012 ISSNIP Biosignals and Biorobotics Conference: Biosignals and Robotics for Better and Safer Living, BRC 2012. 1--6.",
      "doi": ""
    },
    {
      "text": "Tianqi Chen and Carlos Guestrin. 2016. XGBoost : Reliable Large-scale Tree Boosting System. arXiv (2016), 1--6.",
      "doi": ""
    },
    {
      "text": "John Chuang, Hamilton Nguyen, Charles Wang, and Benjamin Johnson. 2013. I think, therefore I am: Usability and security of authentication using brainwaves. In International Conference on Financial Cryptography and Data Security. 1--16.",
      "doi": ""
    },
    {
      "text": "Andy Clark. 2013. Whatever next? Predictive brains, situated agents, and the future of cognitive science. The Behavioral and brain sciences 36, 3 (2013), 181--204.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I don't want to wear a screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. 6028--6039.  ",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Markéta Dolej?ová and Denisa Kera. 2017. Soylent Diet Self-Experimentation: Design Challenges in Extreme Citizen Science Projects. (2017), 2112--2123.  ",
      "doi": "10.1145/2998181.2998365"
    },
    {
      "text": "Joseph Dumit. 2004. Picturing Personhood: Brain Scans and Biomedical Identity. Information Series (2004), 251.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 1994. Professional Vision. American Anthropologist 96, 3 (1994), 606--633.",
      "doi": ""
    },
    {
      "text": "Mick Grierson and Chris Kiefer. 2011. Better brain interfacing for the masses. In Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems - CHI EA '11 (CHI EA '11). ACM Press, New York, NY, USA, 1681.  ",
      "doi": "10.1145/1979742.1979828"
    },
    {
      "text": "N. Katherine Hayles. 1999. Contesting for the Body of Information: The Macy Conferences on Cybernetics. In How We Became Posthuman: Virtual Bodies in Cybernetics, Literature, and Informatics. 50--83.",
      "doi": ""
    },
    {
      "text": "Edwin Hutchins. 2005. Distributed cognition. Cognition, Technology & Work 7, 1 (2005), 5--5.",
      "doi": "10.1007/s10111-004-0172-0"
    },
    {
      "text": "Hilary Hutchinson, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Wendy E. Mackay, Helen Evans, Heiko Hansen, Stéphane Conversy, Michel Beaudouin-Lafon, Nicolas Roussel, Loïc Lacomme, Björn Eiderbäck, Sinna Lindquist, Yngve Sundblad, Bosse Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03) 5 (2003), 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Interaxon. 2017. Muse: The brain sensing headband. (2017). http://www.choosemuse.com/",
      "doi": ""
    },
    {
      "text": "Katherine Isbister, Kia Höök, Michael Sharp, and Laaksoñahti Jarmo. 2006. The Sensual Evaluation Instrument: Developing an Affective Evaluation Tool. In CHI 2006 Proceedings. 1163--1172.  ",
      "doi": "10.1145/1124772.1124946"
    },
    {
      "text": "Olave E. Krigolson, Chad C. Williams, Angela Norton, Cameron D. Hassall, and Francisco L. Colino. 2017. Choosing MUSE: Validation of a low-cost, portable EEG system for ERP research. Frontiers in Neuroscience 11, MAR (2017).",
      "doi": ""
    },
    {
      "text": "Lucian Leahu and Phoebe Sengers. 2014. Freaky: performing hybrid human-machine emotion. Proceedings of the 2014 conference on Designing interactive systems - DIS '14 (2014), 607--616.  ",
      "doi": "10.1145/2598510.2600879"
    },
    {
      "text": "Steven Levy. 2017. Brain-Machine Interface Isn't Sci-Fi Anymore. (sep 2017). https://www.wired.com/ story/brain-machine-interface-isnt-sci-fi-anymore/",
      "doi": ""
    },
    {
      "text": "Nick Merrill, Max T Curran, and John Chuang. 2017. Is the Future of Authenticity All In Our Heads? Moving Passthoughts from the Lab to the World. New Security Paradigms Workshop (NSPW) (2017).  ",
      "doi": "10.1145/3171533.3171537"
    },
    {
      "text": "Neurable. 2017. Neurable: Power Brain-Controlled Virtual Reality. (2017). http://www.neurable.com/",
      "doi": ""
    },
    {
      "text": "NeurotechX. The international neurotechnology network. (????). http://neurotechx.com/",
      "doi": ""
    },
    {
      "text": "James Pierce. 2017. Dark Clouds, Io $ #! +, and { Crystal Ball Emoji }: Projecting Network Anxieties with Alternative Design Metaphors. (2017), 1383--1393. ",
      "doi": "10.1145/3064663.3064795"
    },
    {
      "text": "Nikolas Rose. 2016. Reading the human brain: How the mind became legible. Body & Society 22, 2 (jun 2016), 140--177.",
      "doi": ""
    },
    {
      "text": "AnnaLee Saxenian. 1996. Regional advantage. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers and Bill Gaver. 2006. Staying open to interpretation: engaging multiple meanings in design and evaluation. Proceedings of the 6th conference on Designing. .. (2006), 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Smith Optical. 2017. Lowdown Focus mpowered by Muse. (2017). http://www.smithoptics.com/us/lowdownfocus",
      "doi": ""
    },
    {
      "text": "Tim Urban. 2017. Neuralink and the Brain's Magical Future. (2017). https://waitbutwhy.com/2017/04/neuralink.html",
      "doi": ""
    },
    {
      "text": "Robert S Weiss. 1995. Learning from strangers: The art and method of qualitative interview studies. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Richmond Y Wong and Deirdre K Mulligan. 2016. When a Product Is Still Fictional: Anticipating and Speculating Futures through Concept Videos. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 121--133.  ",
      "doi": "10.1145/2901790.2901801"
    }
  ]
}