{
  "doi": "10.1145/3173574.3173833",
  "title": "Understanding Artefact and Process Challenges for Designing Low-Res Lighting Displays",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Low-resolution (low-res) lighting displays are increasingly used by HCI researchers, designers, and in the industry as a versatile and aesthetic medium for deploying ambient interfaces in various contexts. These display types distinguish themselves from conventional high-res screens through: high contrasts, hi-power LED technology which allows visibility even in bright environments, and their ability to take on three-dimensional free forms. However, to date most work on low-res displays has been either of experimental nature or carried out in isolated industry contexts. This paper addresses this gap through an analysis of our own experiences from previous experimental design studies and related work, which led us to five domain challenges for designing low-res displays. We then describe how we approached these challenges in a deployment study, which involved the implementation of a prototype guided by a low-res prototyping toolkit. Based on an analysis of our design process and findings from the deployment study, we present ten design recommendations for low-res lighting displays.",
  "authors": [
    {
      "name": "Marius Hoggenmueller",
      "institution": "University of Munich (LMU) & The University of Sydney, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658646156",
      "orcid": "missing"
    },
    {
      "name": "Martin Tomitsch",
      "institution": "The University of Sydney, Sydney, NSW, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100138830",
      "orcid": "missing"
    },
    {
      "name": "Alexander Wiethoff",
      "institution": "University of Munich (LMU), Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467670465",
      "orcid": "0000-0003-2938-7272"
    }
  ],
  "references": [
    {
      "text": "Moshe Bar and Maital Neta. Humans prefer curved visual objects. Psychological Science 17, 8 (2006), 645--648.",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. Contextual Design: Defining Customer-Centered Systems. San Francisco, CA: Morgan Kaufmann Publishers Inc. 1997. SBN: 9781558604117 ",
      "doi": "10.5555/523184"
    },
    {
      "text": "Bill Buxton. Sketching User Experiences. 2007. ISBN: 9780123740373",
      "doi": ""
    },
    {
      "text": "Seijin Cha, Moon-Hwan Lee and Tek-Jin Nam. Gleamy: An Ambient Display Lamp with a Transparency-Controllable Shade. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (TEI'16).  ",
      "doi": "10.1145/2839462.2839501"
    },
    {
      "text": "Sandy Claes, Karin Slegers and Andrew Vande Moere. The Bicycle Barometer: Design and Evaluation of Cyclist-Specific Interaction for a Public Display. In Proc. of the International Conference on Human Factors in Computing Systems (CHI '16).  ",
      "doi": "10.1145/2858036.2858429"
    },
    {
      "text": "Marcelo Coelho, Jamie Zigelbaum and Joshua Kopin. Six-forty by four-eighty: the post-industrial design of computational materials. In Proc. of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11).  ",
      "doi": "10.1145/1935701.1935752"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2008. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory, Third. ed. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2010. Designing Urban Media Façades: Cases and Challenges. In Proc. of the International Conference on Human Factors in Computing Systems (CHI '10).  ",
      "doi": "10.1145/1753326.1753670"
    },
    {
      "text": "Nicole Gardner, M. Hank Haeusler and Briedy Mahar. INTERchanging: Future Designs for Responsive Transport Environments. Published by Spurbuch Verlag, 2014. ISBN 978--3--88778--418--8",
      "doi": ""
    },
    {
      "text": "William Gaver, John Bowers, Andy Boucher, Andy Law, Sarah Pennington and Nicholas Villar. The history tablecloth: illuminating domestic activity. In Proc. of the International Conference on Designing Interactive systems (DIS '06).  ",
      "doi": "10.1145/1142405.1142437"
    },
    {
      "text": "Alyn Griffiths. 21st Century Lighting Design. Bloomsbury Visual Arts. ISBN: 9781472503138",
      "doi": ""
    },
    {
      "text": "Richard Grusin, Richard Schiff and John G. Hanhardt. Jim Campbell: Material Light. Hatje Cantz Verlag, Ostfildern (Germany), 2010. ISBN: 9783775725422 ",
      "doi": "10.5555/1875078"
    },
    {
      "text": "Anton Gustafsson and Magnus Gyllenswärd. The power-aware cord: energy awareness through ambient information display. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '05).  ",
      "doi": "10.1145/1056808.1056932"
    },
    {
      "text": "Kim Halskov and Tobias Ebsen. 2013. A framework for designing complex media façades. Design studies 34(5).",
      "doi": ""
    },
    {
      "text": "Chris Harrison, John Horstman, Gary Hsieh and Scott Hudson. Unlocking the expressivity of point lights. In Proc. of the International Conference on Human Factors in Computing Systems (CHI '12), 1683--1692.  ",
      "doi": "10.1145/2207676.2208296"
    },
    {
      "text": "Marius Hoggenmueller, Alexander Wiethoff and Martin Tomitsch. Sketching-in-Light: Enabling Hybrid Prototyping of Low-Resolution Lighting Displays. In Proc. of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI'17).  ",
      "doi": "10.1145/3024969.3025001"
    },
    {
      "text": "Marius Hoggenmueller and Alexander Wiethoff. LightSet: enabling urban prototyping of interactive media façades. In Proc. of the 2014 conference on Designing Interactive Systems (DIS '14).  ",
      "doi": "10.1145/2598510.2598551"
    },
    {
      "text": "Jettie Hoonhout, Lillian Jumpertz, Jon Mason and Tom Bergman. Exploration into Lighting Dynamics for the Design of More Pleasurable Luminaires. In Proc. of the International Conference on Designing Pleasurable Products and Interfaces (DPPI' 13).  ",
      "doi": "10.1145/2513506.2513526"
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra and Yvonne Rogers. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. In Proc. of the Conference on Human Factors in Computing Systems (CHI '16).  ",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Karin Kappel and Thomas Grechenig. \"Show-Me\": water consumption at a glance to promote water conservation in the shower. In Proc. of the International Conference on Persuasive Technology (Persuasive 09).  ",
      "doi": "10.1145/1541948.1541984"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. UpStream: motivating water conservation with low-cost water flow sensing and persuasive displays. In Proc. of the International Conference on Human Factors in Computing Systems (CHI '10).  ",
      "doi": "10.1145/1753326.1753604"
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng and Harry Hochheiser. Research Methods in Human-Computer Interaction. John Wiley & Sons, 2009. ISBN : 978-0470--72337--1 ",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Andreas Löcken, Heiko Müller, Wilko Heuten and Susanne CJ Boll. Exploring the design space of ambient light displays. In Extended Abstracts on Human Factors in Computing Systems (CHI '14).",
      "doi": ""
    },
    {
      "text": "Jonas Löwgren and Erik Stolterman. Thoughtful Interaction Design. 2004. ISBN: 9780262122719",
      "doi": ""
    },
    {
      "text": "Andrii Matviienmki, Vanessa Cobus, Heiko Müller, Jutta Fortmann, Andreas Löcken, Susanne Boll, Maria Rauschenberger, Janko Timmermann, Christoph Trappe and Wilko Heuten. Deriving design guidelines for ambient light systems. In Proc. of the International Conference on Mobile and Ubiquitous Multimedia (MUM'15).  ",
      "doi": "10.1145/2836041.2836069"
    },
    {
      "text": "Matthew Mauriello, Michael Gubbels and Jon E. Froehlich. Social fabric fitness: the design and evaluation of wearable E-textile displays to support group running. In Proc. of the Conference on Human Factors in Computing Systems (CHI '14).  ",
      "doi": "10.1145/2556288.2557299"
    },
    {
      "text": "Dietmar Offenhuber and Susanne Seitinger. Over the rainbow: information design for low-resolution urban displays. In Proc. of the 2nd Media Architecture Biennale Conference (MAB '14).  ",
      "doi": "10.1145/2682884.2682886"
    },
    {
      "text": "Florian Perteneder, Eva-Maria Grossauer, Joanne Leong, Wolfgang Stuerzlinger and Michael Haller. Glowworms and Fireflies: Ambient Light on Large Interactive Surfaces. In Proc. of the Conference on Human Factors in Computing Systems (CHI '16).  ",
      "doi": "10.1145/2858036.2858524"
    },
    {
      "text": "Casey Reas and Ben Fry. 2007. Processing - A Programming Handbook for Visual Designers and Artists, MIT Press. ",
      "doi": "10.5555/1296181"
    },
    {
      "text": "Erica Robles and Mikael Wiberg. Texturing the \"Material Turn\" in Interaction Design. In Proc. of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI '10).  ",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Elizabeth B.-N. Sanders. From User-Centered to Participatory Design Approaches. Design and the Social Sciences (2002), 7.",
      "doi": ""
    },
    {
      "text": "Johann Schrammel, Cornelia Gerdenitsch, Astrid Weiss, Patricia M. Kluckner and Manfred Tscheligi. FORE-Watch -- The Clock That Tells You When to Use: Persuading Users to Align Their Energy Consumption with Green Power Availability. In Ambient Intelligence. Springer International Publishing. 2013.  ",
      "doi": "10.1007/978-3-642-25167-2_19"
    },
    {
      "text": "Martin Tomitsch. Towards the real-time city: An investigation of public displays for behaviour change and sustainable living. In Proc. of the Making Cities Liveable Conference, PANDORA Archive, National Library of Australia. 2014.",
      "doi": ""
    },
    {
      "text": "Cesar Torres, Jasper O'Leary, Molly Nicholas and Eric Paulos. Illumination Aesthetics: Light as a Creative Material within Computational Design. In Proc. of the Conference on Human Factors in Computing Systems (CHI '17).  ",
      "doi": "10.1145/3025453.3025466"
    },
    {
      "text": "Alexander Wiethoff and Magdalena Blöckner. LightBox: exploring interaction modalities with colored light. In Proc. of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI'11).  ",
      "doi": "10.1145/1935701.1935799"
    },
    {
      "text": "Alexander Wiethoff and Marius Hoggenmueller. Experiences Deploying Hybrid Media Architecture in Public Environments. In Media Architecture: Using Information and Media as Construction Material, A. Wiethoff and H. Hussmann, Eds. de Gruyter Mouton. 2017. ISBN: 978--3--11-045387--4",
      "doi": ""
    },
    {
      "text": "Jiang Wu, Harm van Essen and Berry Eggen. Designing Sculpting Light Systems for Information Decoration. In Proc. of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI'16).  ",
      "doi": "10.1145/2839462.2856547"
    }
  ]
}