{
  "doi": "10.1145/3173574.3173609",
  "title": "Understanding the Needs of Searchers with Dyslexia",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "As many as 20% of English speakers have dyslexia, a language disability that impacts reading and spelling. Web search is an important modern literacy skill, yet the accessibility of this language-centric endeavor to people with dyslexia is largely unexplored. We interviewed ten adults with dyslexia and conducted an online survey with 81 dyslexic and 80 non-dyslexic adults, in which participants described challenges they face in various stages of web search (query formulation, search result triage, and information extraction). We also report the findings of an online study in which 174 adults with dyslexia and 172 without dyslexia rated the readability and relevance of sets of search query results. Our findings demonstrate differences in behaviors and preferences between dyslexic and non-dyslexic searchers, and indicate that factoring readability into search engine rankings and/or interfaces may benefit both dyslexic and non-dyslexic users.",
  "tags": [
    "search engine",
    "reading disabilities",
    "web search",
    "learning disabilities",
    "dyslexia"
  ],
  "authors": [
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Adam Fourney",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81330490871/rel-imgonly/adamfo.png",
      "acmid": "81330490871",
      "orcid": "missing"
    },
    {
      "name": "Abdullah Ali",
      "institution": "Microsoft Research & University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99658705728/rel-imgonly/b0c4d23b-845f-4299-910e-8089d3809af0.jpeg",
      "acmid": "99658705728",
      "orcid": "missing"
    },
    {
      "name": "Laura Vonessen",
      "institution": "Microsoft Research & University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658750057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ageev, M., Go, Q., Lagun, D., and Agichtein, E. Find it if you can: A game for modeling different types of web search success using interaction data. Proceedings of SIGIR 2011.  ",
      "doi": "10.1145/2009916.2009965"
    },
    {
      "text": "Al-Wabil, A., Zaphiris, P., and Wilson, S. Web Navigation for Individuals with Dyslexia: An Exploratory Study. Universal Access in Human Computer Interaction 2007. ",
      "doi": "10.5555/1766311.1766380"
    },
    {
      "text": "Al-Wabil, A., Zaphiris, P., and Wilson, S. Examining visual attention of dyslexics on web navigation with eye tracking. Innovations in Information Technology 2008.",
      "doi": ""
    },
    {
      "text": "Berget, G. Search and find? An accessibility study of dyslexia and information retrieval. Doctoral Dissertation, University of Oslo, 2016.",
      "doi": ""
    },
    {
      "text": "Berget, G. and Sandnes, F.E. (2015) Searching databases without query-building-aids: Implications for dyslexic users. Information Research, 20(4).",
      "doi": ""
    },
    {
      "text": "Berget, G., Mulvey, F., and Sandnes, F.E. (2016) Is visual content in textual search interfaces beneficial to dyslexic users? International Journal of HumanComputer Studies. August 2016, Vol. 92, Issue C, pp. 17--29.  ",
      "doi": "10.1016/j.ijhcs.2016.04.006"
    },
    {
      "text": "Broder, A. A Taxonomy of Web Search. SIGIR Forum 2002.  ",
      "doi": "10.1145/792550.792552"
    },
    {
      "text": "Collins-Thompson, K., Bennet, P.N., White, R.W., de la Chica, S., and Sontag, D. Personalizing Web Search Results by Reading Level. Proceedings of CIKM 2011.  ",
      "doi": "10.1145/2063576.2063639"
    },
    {
      "text": "DATAUSA: Special Education Teachers. https://datausa.io/profile/soc/252050/#demographics Retrieved August 25, 2017.",
      "doi": ""
    },
    {
      "text": "Figueredo de Santana, V., de Oliveira, R., Almeida, L.D.A., and Baranauskas, M.C.C. Web accessibility and people with dyslexia: a survey on techniques and guidelines. Proceedings of the International CrossDisciplinary Conference on Web Accessibility 2012.  ",
      "doi": "10.1145/2207016.2207047"
    },
    {
      "text": "Flanagan, J. The critical incident technique. Psychological Bulletin, 51:327--358, 1954.",
      "doi": ""
    },
    {
      "text": "Fourney, A., White, R., and Horvitz, E. Exploring Time-Dependent Concerns about Pregnancy and Childbirth from Search Logs. Proceedings of CHI 2015.  ",
      "doi": "10.1145/2702123.2702427"
    },
    {
      "text": "Fourney, A., White, R., and Morris, M.R. Web Search as a Linguistic Tool. Proceedings of WWW 2017.  ",
      "doi": "10.1145/3038912.3052651"
    },
    {
      "text": "Greenwood, S., Perrin, A., and Duggan, M. Social Media Update 2016. Pew Research Center for Internet and Technology. November 11, 2016. http://www.pewinternet.org/2016/11/11/social-mediaupdate-2016/",
      "doi": ""
    },
    {
      "text": "Hawke, J.L., Olson, R.K., Willcutt, E.G., Wadsworth, S.J., and DeFries, J.C. (2009) Gender ratios for reading difficulties. Dyslexia, 2009 August, 15(3), 239--242.",
      "doi": ""
    },
    {
      "text": "Hoeft, F., McCardle, P., and Pugh, K. \"The Myths and Truths of Dyslexia in Different Writing Systems.\" International Dyslexia Association blog, March 2015.",
      "doi": ""
    },
    {
      "text": "International Dyslexia Association. \"Dyslexia Basics.\" https://dyslexiaida.org/dyslexia-basics/ Retrieved 11/23/16.",
      "doi": ""
    },
    {
      "text": "International Dyslexia Association. \"Testing and Evaluation.\" https://dyslexiaida.org/testing-andevaluation/ Retrieved 12/13/17.",
      "doi": ""
    },
    {
      "text": "Ivory, M., Sinha, R.R., and Hearst, M.A. (2000) Preliminary Findings on Quantitative Measures for Distinguishing Highly Rated Information-Centric Web Pages. Proceedings of the Sixth Conference on Human Factors and the Web.",
      "doi": ""
    },
    {
      "text": "Joachims, T., Granka. L., Pan, B., Hembrooke, H., and Gay, G. Accurately interpreting clickthrough data as implicit feedback. Proceedings of SIGIR 2005.  ",
      "doi": "10.1145/1076034.1076063"
    },
    {
      "text": "Kim, J., Collins-Thompson, K., Bennett, P.N., and Dumais, S. Characterizing Web content, User Interests, and Search Behavior by Reading Level and Topic. Proceedings of WSDM 2012.  ",
      "doi": "10.1145/2124295.2124323"
    },
    {
      "text": "Lazar, J., Feng, J.H., and Hochheiser, H. Research Methods in Human-Computer Interaction. Wiley, 2010. ",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Liu, X., Croft, W.B., Oh, P. and Hart, D. Automatic recognition of reading levels from user queries. Proceedings of SIGIR 2004.  ",
      "doi": "10.1145/1008992.1009114"
    },
    {
      "text": "Loiacono, E.T., Watson, R.T., and Dale L. Goodhue, D.L. (2007) WebQual: An Instrument for Consumer Evaluation of Web Sites. International Journal of Electronic Commerce, 11(4).  ",
      "doi": "10.2753/JEC1086-4415110302"
    },
    {
      "text": "MacFarlane, A., Al-Wabil, A., Marshall, C.R., Albrair, A., Jones, S.A., and Zaphiris, P. (2010) The effect of dyslexia on information retrieval: a pilot study. Journal of Documentation, 66(3), 307--326.",
      "doi": ""
    },
    {
      "text": "MacFarlane, A., Albraier, A., Marshall, C.R., and Buchanan, G. Phonological working memory impacts on information searching: an investigation of dyslexia. Proc. of the Information Interaction in Context Symposium, 2012.  ",
      "doi": "10.1145/2362724.2362734"
    },
    {
      "text": "MacFarlane, A., Buchanan, G., Al-Wabil, A., Andrienko, G., and Andrienko, N. Visual Analysis of Dyslexia on Search. CHIIR 2017.  ",
      "doi": "10.1145/3020165.3022134"
    },
    {
      "text": "Marshall, N. (1979) Readability and Comprehensibility. Journal of Reading, 22(6), 542544.",
      "doi": ""
    },
    {
      "text": "McCallum, D.R. and Peterson, J.L. (1982) Computerbased readability indexes. Proceedings of the ACM '82 Conference.  ",
      "doi": "10.1145/800174.809754"
    },
    {
      "text": "Miles, T.R., Haslum, M.N., and Wheeler, T.J. Gender Ratio in Dyslexia. Annals of Dyslexia, December 1998, Volume 48, Issue 1, pp. 27 -- 55.",
      "doi": ""
    },
    {
      "text": "Page, L., Brin, S., Motwani, R., and Winograd, T. (1999) The PageRank Citation Ranking: Bringing Order to the Web. Technical Report. Stanford InfoLab.",
      "doi": ""
    },
    {
      "text": "Paparrizos, J., White, R., and Horvitz, E. Screening for Pancreatic Adenocarcinoma Using Signals from Web Search Logs: Feasibility Study and Results. Journal of Oncology Practice, 12(8), August 2016, p. 737--744.",
      "doi": ""
    },
    {
      "text": "Radlinski, F., and Joachims, T. Query chains: learning to rank from implicit feedback. Proceedings of KDD 2005.  ",
      "doi": "10.1145/1081870.1081899"
    },
    {
      "text": "Rello, L., Ballesteros, M., Ali, A., Serra, M., Sánchez, D.A., and Bigham, J.P. Dytective: Detecting Risk of Dyslexia with a Game. Proceedings of Pervasive Health 2016. ",
      "doi": "10.5555/3021319.3021333"
    },
    {
      "text": "Rello, L., Pielot, M., and Marcos, M-C. Make It Big! The Effect of Font Size and Line Spacing on Online Readability. Proceedings of CHI 2016.  ",
      "doi": "10.1145/2858036.2858204"
    },
    {
      "text": "Rello, L., Ballesteros, M., and Bigham, J.P. A Spellchecker for Dyslexia. Proceedings of ASSETS 2015.  ",
      "doi": "10.1145/2700648.2809850"
    },
    {
      "text": "Rello, L. Dyslexia and Web Accessibility: Synergies and Challenges. Proceedings of W4A 2015.  ",
      "doi": "10.1145/2745555.2746655"
    },
    {
      "text": "Spärck Jones, K., Walker, S., and Robertson, S. E. A probabilistic model of information retrieval: Development and comparative experiments. Journal of Information Processing and Management, 36(6), November 2000, p. 779--808.  ",
      "doi": "10.1016/S0306-4573%2800%2900015-7"
    },
    {
      "text": "Woodruff, A., Faulring, A., Rosenholtz, R.E., Morrison, J., and Pirolli, P.L. Using Thumbnails to Search the Web. Proceedings of CHI 2001.  ",
      "doi": "10.1145/365024.365098"
    }
  ]
}