{
  "doi": "10.1145/3173574.3173922",
  "title": "Semi-Automated Coding for Qualitative Research: A User-Centered Inquiry and Initial Prototypes",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Qualitative researchers perform an important and painstaking data annotation process known as coding. However, much of the process can be tedious and repetitive, becoming prohibitive for large datasets. Could coding be partially automated, and should it be? To answer this question, we interviewed researchers and observed them code interview transcripts. We found that across disciplines, researchers follow several coding practices well-suited to automation. Further, researchers desire automation after having developed a codebook and coded a subset of data, particularly in extending their coding to unseen data. Researchers also require any assistive tool to be transparent about its recommendations. Based on our findings, we built prototypes to partially automate coding using simple natural language processing techniques. Our top-performing system generates coding that matches human coders on inter-rater reliability measures. We discuss implications for interface and algorithm design, meta-issues around automating qualitative research, and suggestions for future work.",
  "tags": [
    "qualitative coding",
    "natural language processing",
    "qualitative research",
    "qualitative data analysis",
    "user-centered design"
  ],
  "authors": [
    {
      "name": "Megh Marathe",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658660109",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    }
  ],
  "references": [
    {
      "text": "Aneesha Bakharia, Peter Bruza, Jim Watters, Bhuva Narayan, and Laurianne Sitbon. 2016. Interactive Topic Modeling for aiding Qualitative Content Analysis. Proceedings of the 2016 ACM on Conference on Human Information Interaction and Retrieval - CHIIR '16 (2016), 213--222.  ",
      "doi": "10.1145/2854946.2854960"
    },
    {
      "text": "Tehmina N. Basit. 2003. Manual or electronic? The role of coding in qualitative data analysis. Educational Research 45, 2 (2003), 143--154.",
      "doi": ""
    },
    {
      "text": "Peter M Bednar and Christine Welch. 2009. Contextual Inquiry and Requirements Shaping. Information Systems Development Challenges in Practice Theory and Education Vols 1and 2 1 (2009), 225--236.",
      "doi": ""
    },
    {
      "text": "Steven Bird, Ewan Klein, and Edward Loper. 2009. Natural Language Processing with Python. O'Reilly Media Inc. 479 pages. ",
      "doi": "10.5555/1717171"
    },
    {
      "text": "V. Braun and V. Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3 (2006), 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Liora Bresler, Judy Davidson Wasser, Nancy B Hertzog, and Mary Lemons. 1996. Beyond the lone ranger researcher: Team work in qualitative research. Research Studies in Music Education 7, 1 (1996), 13--27.",
      "doi": ""
    },
    {
      "text": "John L Campbell, Charles Quincy, Jordan Osserman, and Ove K Pedersen. 2013. Coding In-depth Semistructured Interviews: Problems of Unitization and Intercoder Reliability and Agreement. Sociological Methods & Research 42, 3 (2013), 294--320.",
      "doi": ""
    },
    {
      "text": "Matt Chaput. 2016. Whoosh: A fast, pure-Python full text indexing, search, and spell checking library. (2016). https://pypi.python.org/pypi/Whoosh/",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis R. Sage Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Nan-chen Chen, Michael Brooks, Rafal Kocielnik, Sungsoo Ray Hong, Jeff Smith, Sanny Lin, Zening Qu, and Cecilia Aragon. 2017. Lariat : A Visual Analytics Tool for Social Media Researchers to Explore Twitter Datasets. In Hawaii International Conference on System Sciences. Honolulu, HI. DOI: http://dx.doi.org/10125/41382",
      "doi": ""
    },
    {
      "text": "Nan-chen Chen, Rafal Kocielnik, Margaret Drouhard, Vanessa Peña-Araya, Jina Suh, Keting Cen, Xiangyi Zheng, and Cecilia Aragon. 2016. Challenges of Applying Machine Learning to Qualitative Coding. In ACM SIGCHI Workshop on Human-Centered Machine Learning. http://hcml2016.goldsmithsdigital.com/program/",
      "doi": ""
    },
    {
      "text": "J W Creswell. 2007. Qualitative Inquiry and Research Design: Choosing Among Five Approaches. SAGE Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Gregory Dam and Stefan Kaufmann. 2008. Computer assessment of interview data using latent semantic analysis. Behavior Research Methods 40, 1 (2008), 8--20.",
      "doi": ""
    },
    {
      "text": "J. Davidson, T. Paulus, and K. Jackson. 2016. Speculating on the Future of Digital Tools for Qualitative Research. Qualitative Inquiry 22, 7 (2016), 606--610.",
      "doi": ""
    },
    {
      "text": "S Deerwester, S Dumais, G Furnas, T Landauer, and R Harshman. 1990. Indexing by Latent Semantic Analysis. Journal of the American Society for Information Science 41, 6 (1990), 391--407.",
      "doi": ""
    },
    {
      "text": "N.K. Denzin and Y.S. Lincoln. 1994. Handbook of Qualitative Research. Sage Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Karthik Dinakar, Jackie Chen, Henry Lieberman, Rosalind Picard, and Robert Filbin. 2015. Mixed-Initiative Real-Time Topic Modeling & Visualization for Crisis Counseling. Proceedings of the 20th International Conference on Intelligent User Interfaces - IUI '15 (2015), 417--426.  ",
      "doi": "10.1145/2678025.2701395"
    },
    {
      "text": "Karthik Dinakar, Henry Lieberman, Allison J B Chaney, and David M Blei. 2014. Real-time Topic Models for Crisis Counseling. (2014), 1--4.",
      "doi": ""
    },
    {
      "text": "Robert Emerson, Rachel Fretz, and Linda Shaw. 2011. Writing Ethnographic Fieldnotes. University of Chicago Press, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Jerry Alan Fails and Dan R Olsen. 2003. Interactive machine learning. Proceedings of the 8th international conference on Intelligent user interfaces IUI 03 (2003), 39--45.",
      "doi": "10.1145/604045.604056"
    },
    {
      "text": "Ethan Fast, Binbin Chen, and Michael S. Bernstein. 2016. Empath: Understanding Topic Signals in Large-Scale Text. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 4647--4657.  ",
      "doi": "10.1145/2858036.2858535"
    },
    {
      "text": "Nigel Fielding and Raymond Lee. 2002. New Patterns in the Adoption and Use of Qualitative Software. Field Methods 14, 2 (2002), 197--216.",
      "doi": ""
    },
    {
      "text": "N. G. Fielding. 2012. Triangulation and Mixed Methods Designs: Data Integration With New Research Technologies. Journal of Mixed Methods Research 6, 2 (2012), 124--136.",
      "doi": ""
    },
    {
      "text": "Linda S. Gilbert, Kristi Jackson, and Silvana di Gregorio. 2014. Tools for Analyzing Qualitative Data: The History and Relevance of Qualitative Data Analysis Software. In Handbook of Research on Educational Communications and Technology. 221--236.",
      "doi": ""
    },
    {
      "text": "Barney G Glaser and Anselm L Strauss. 1967. The discovery of grounded theory. International Journal of Qualitative Methods 5 (1967), 1--10.",
      "doi": ""
    },
    {
      "text": "Tony Hak and Ton Bernts. 1996. Coder training: Theoretical training or practical socialization? Qualitative Sociology 19, 2 (jun 1996), 235--257.",
      "doi": ""
    },
    {
      "text": "Enamul Hoque and Giuseppe Carenini. 2015. ConVisIT : Interactive Topic Modeling for Exploring Asynchronous Online Conversations. Proceedings of the 20th International Conference on Intelligent User Interfaces IUI '15 (2015), 169--180.  ",
      "doi": "10.1145/2678025.2701370"
    },
    {
      "text": "Paula Jarzabkowski, Rebecca Bednarek, and Laure Cabantous. 2014. Conducting global team-based ethnography: Methodological challenges and practical methods. Human Relations (2014), 0018726714535449.",
      "doi": ""
    },
    {
      "text": "Udo Kelle, Gerald Prein, and Katherine Bird. 1995. Computer-aided qualitative data analysis : theory, methods and practice. Sage Publications. 224 pages.",
      "doi": ""
    },
    {
      "text": "Raymond M Lee and Nigel G Fielding. 1995. Users' Experiences of Qualitative Data Analysis Software. In Computer-aided qualitative data analysis: theory, methods and practice, Udo Kelle, Gerald Prein, and Katherine Bird (Eds.). SAGE Publications, London ; Thousand Oaks, Chapter 2, 29--.",
      "doi": ""
    },
    {
      "text": "R. B. Lewis. 2004. NVivo 2.0 and ATLAS.ti 5.0: A Comparative Review of Two Popular Qualitative Data-Analysis Programs. Field Methods 16, 4 (2004), 439--464.",
      "doi": ""
    },
    {
      "text": "Christopher D Manning, Prabhakar Raghavan, and Hinrich Schütze. 2008. Introduction to Information Retrieval. 2008 1, c (2008), 496.",
      "doi": ""
    },
    {
      "text": "Joseph A Maxwell. 2010. Qualitative Research Design: An Interactive Approach. SAGE Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "M B Miles, A M Huberman, and Johnny Saldaña. 2014. Qualitative Data Analysis: A Methods Sourcebook. Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Peter Axel Nielsen. 2012. Collaborative Coding of Qualitative Data. (2012).",
      "doi": ""
    },
    {
      "text": "Pablo Paredes, Ana Rufino Ferreira, Cory Schillaci, Gene Yoo, Pierre Karashchuk, Dennis Xing, Coye Cheshire, and John Canny. 2017. Inquire: Large-scale Early Insight Discovery for Qualitative Research. In Proceedings of the 20th ACM Conference on Computer-Supported Cooperative Work & Social Computing.  ",
      "doi": "10.1145/2998181.2998363"
    },
    {
      "text": "Mary Elizabeth Raven and Alicia Flanders. 1996. Using contextual inquiry to learn about your audiences. ACM SIGDOC Asterisk Journal of Computer Documentation 20, 1 (1996), 1--13.  ",
      "doi": "10.1145/227614.227615"
    },
    {
      "text": "Johnny Saldaña. 2012. The Coding Manual for Qualitative Researchers. Sage Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Bruce Sherin. 2013. A Computational Study of Commonsense Science: An Exploration in the Automated Analysis of Clinical Interview Data. Journal of the Learning Sciences 22, 4 (2013), 600--638.",
      "doi": ""
    },
    {
      "text": "Amit Singhal. 2001. Modern Information Retrieval: A Brief Overview. Bulletin of the IEEEE Computer Society Technical Committee on Data Engineering 24, 4 (2001), 1--9.",
      "doi": ""
    },
    {
      "text": "Jonathan A Smith and Mike Osborn. 2015. Interpretative phenomenological analysis. In Qualitative Psychology: A Practical Guide to Research Methods. 54--80.",
      "doi": ""
    },
    {
      "text": "Pontus Stenetorp, Sampo Pyysalo, Goran Topi, Tomoko Ohta, Sophia Ananiadou, and Jun'ichi Tsujii. 2012. BRAT : a Web-based Tool for NLP-Assisted Text Annotation. Proceedings of the Demonstrations at the 13th Conference of the European Chapter of the Association for Computational Linguistics (EACL '12) Figure 1 (2012), 102--107. http://dl.acm.org/citation.cfm?id=2380921.2380942 ",
      "doi": "10.5555/2380921.2380942"
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualiative evaluation data. American Journal of Evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "Gregor Wiedemann. 2013. Opening up to big data: Computer-assisted analysis of textual data in social sciences. Historical Social Research 38, 4 (2013), 332--357.",
      "doi": ""
    },
    {
      "text": "Jasy Suet Liew Yan, Nancy McCracken, and Kevin Crowston. 2014. Semi-Automatic Content Analysis of Qualitative Data. In iConference Proceedings.",
      "doi": ""
    }
  ]
}