{
  "doi": "10.1145/3173574.3174168",
  "title": "Beagle: Automated Extraction and Interpretation of Visualizations from the Web",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2018,
  "badges": [],
  "abstract": "\"How common is interactive visualization on the web?\" \"What is the most popular visualization design?\" \"How prevalent are pie charts really?\" These questions intimate the role of interactive visualization in the real (online) world. In this paper, we present our approach (and findings) to answering these questions. First, we introduce Beagle, which mines the web for SVG-based visualizations and automatically classifies them by type (i.e., bar, pie, etc.). With Beagle, we extract over 41,000 visualizations across five different tools and repositories, and classify them with 85% accuracy, across 24 visualization types. Given this visualization collection, we study usage across tools. We find that most visualizations fall under four types: bar charts, line charts, scatter charts, and geographic maps. Though controversial, pie charts are relatively rare for the visualization tools that were studied. Our findings also suggest that the total visualization types supported by a given tool could factor into its ease of use. However this effect appears to be mitigated by providing a variety of diverse expert visualization examples to users.",
  "authors": [
    {
      "name": "Leilani Battle",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435594270",
      "orcid": "0000-0003-3870-636X"
    },
    {
      "name": "Peitong Duan",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260550",
      "orcid": "missing"
    },
    {
      "name": "Zachery Miranda",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261946",
      "orcid": "missing"
    },
    {
      "name": "Dana Mukusheva",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261732",
      "orcid": "missing"
    },
    {
      "name": "Remco Chang",
      "institution": "Tufts University, Medford, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319489175",
      "orcid": "missing"
    },
    {
      "name": "Michael Stonebraker",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81337493529/rel-imgonly/stonebreaker.jpg",
      "acmid": "81337493529",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Edward Benson and David R. Karger. 2014. End-users Publishing Structured Information on the Web: An Observational Study of What, Why, and How. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1265--1274.  ",
      "doi": "10.1145/2556288.2557036"
    },
    {
      "text": "Michael Bostock. 2016. Popular Blocks - bl.ocks.org. (Sept. 2016). http://bl.ocks.org/",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Chartblocks. 2017. Online Chart Builder - ChartBlocks. (2017). https://www.chartblocks.com/en/",
      "doi": ""
    },
    {
      "text": "Stephen Few and Perceptual Edge. 2007. Save the pies for dessert. Visual Business Intelligence Newsletter (2007), 1--14.",
      "doi": ""
    },
    {
      "text": "Jonathan Harper and Maneesh Agrawala. 2014. Deconstructing and Restyling D3 Visualizations. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 253--262.  ",
      "doi": "10.1145/2642918.2647411"
    },
    {
      "text": "J. Harper and M. Agrawala. 2017. Converting Basic D3 Charts into Reusable Style Templates. IEEE Transactions on Visualization and Computer Graphics PP, 99 (2017), 1--1.",
      "doi": ""
    },
    {
      "text": "Weihua Huang and Chew Lim Tan. 2007. A System for Understanding Imaged Infographics and Its Applications. In Proceedings of the 2007 ACM Symposium on Document Engineering (DocEng '07). ACM, New York, NY, USA, 9--18.  ",
      "doi": "10.1145/1284420.1284427"
    },
    {
      "text": "Graphiq Inc. 2017. Graphiq | Knowledge Delivered. (2017). https://www.graphiq.com/",
      "doi": ""
    },
    {
      "text": "Daekyoung Jung, Wonjae Kim, Hyunjoo Song, Jeong-in Hwang, Bongshin Lee, Bohyoung Kim, and Jinwook Seo. 2017. ChartSense: Interactive Data Extraction from Chart Images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6706--6717.  ",
      "doi": "10.1145/3025453.3025957"
    },
    {
      "text": "Ranjitha Kumar, Arvind Satyanarayan, Cesar Torres, Maxine Lim, Salman Ahmad, Scott R. Klemmer, and Jerry O. Talton. 2013. Webzeitgeist: Design Mining the Web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3083--3092.  ",
      "doi": "10.1145/2470654.2466420"
    },
    {
      "text": "Poshen Lee, Jevin West, and Bill Howe. 2016. Viziometrics: Analyzing Visual Patterns in the Scientific Literature. Journal of the Association for Information Science&Technology (JASIST) (in prep) (2016).",
      "doi": ""
    },
    {
      "text": "InfoSoft Global Pvt. Ltd. 2017. JavaScript Charts for Web, Mobile&Apps. (2017). http://www.fusioncharts.com/",
      "doi": ""
    },
    {
      "text": "Cole Nussbaumer. 2011. death to pie charts. (July 2011). http://www.storytellingwithdata.com/blog/2011/07/ death-to-pie-charts",
      "doi": ""
    },
    {
      "text": "F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825--2830. ",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Plotly. 2016. Plotly | Make charts and dashboards online. (2016). https://plot.ly/",
      "doi": ""
    },
    {
      "text": "Jorge Poco and Jeffrey Heer. 2017. Reverse-Engineering Visualizations: Recovering Visual Encodings from Chart Images. Computer Graphics Forum (Proc. EuroVis) (2017). http://idl.cs.washington.edu/papers/reverse-engineering-vis  ",
      "doi": "10.1111/cgf.13193"
    },
    {
      "text": "V. S. N. Prasad, B. Siddiquie, J. Golbeck, and L. S. Davis. 2007. Classifying Computer Generated Charts. In 2007 International Workshop on Content-Based Multimedia Indexing. 85--92.",
      "doi": ""
    },
    {
      "text": "Daniel Ritchie, Ankita Arvind Kejriwal, and Scott R. Klemmer. 2011. D.Tour: Style-based Exploration of Design Example Galleries. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 165--174.  ",
      "doi": "10.1145/2047196.2047216"
    },
    {
      "text": "Babak Saleh, Mira Dontcheva, Aaron Hertzmann, and Zhicheng Liu. 2015. Learning Style Similarity for Searching Infographics. In Proceedings of the 41st Graphics Interface Conference (GI '15). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 59--64. http://dl.acm.org/citation.cfm?id=2788890.2788902 ",
      "doi": "10.5555/2788890.2788902"
    },
    {
      "text": "Manolis Savva, Nicholas Kong, Arti Chhajta, Li Fei-Fei, Maneesh Agrawala, and Jeffrey Heer. 2011. ReVision: Automated Classification, Analysis and Redesign of Chart Images. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 393--402.  ",
      "doi": "10.1145/2047196.2047247"
    },
    {
      "text": "Mingyan Shao and Robert P. Futrelle. 2006. Recognition and Classification of Figures in PDF Documents. In Proceedings of the 6th International Conference on Graphics Recognition: Ten Years Review and Future Perspectives (GREC'05). Springer-Verlag, Berlin, Heidelberg, 231--242.  ",
      "doi": "10.1007/11767978_21"
    },
    {
      "text": "Noah Siegel, Zachary Horvitz, Roie Levin, Santosh Divvala, and Ali Farhadi. 2016. FigureSeer: Parsing Result-Figures in Research Papers. In Computer Vision -- A ECCV 2016 (Lecture Notes in Computer Science). Springer, Cham, 664--680.",
      "doi": ""
    },
    {
      "text": "Tableau Software. 2016. Tableau Public. (2016). https://public.tableau.com//",
      "doi": ""
    },
    {
      "text": "Edward R. Tufte. 1986. The Visual Display of Quantitative Information. Graphics Press, Cheshire, CT, USA. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "Fernanda B. Viegas, Martin Wattenberg, Frank van Ham, Jesse Kriss, and Matt McKeon. 2007. ManyEyes: A Site for Visualization at Internet Scale. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov. 2007), 1121--1128.  ",
      "doi": "10.1109/TVCG.2007.70577"
    }
  ]
}