{
  "doi": "10.1145/3173574.3174069",
  "title": "Huggable: The Impact of Embodiment on Promoting Socio-emotional Interactions for Young Pediatric Inpatients",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Most hospitals make efforts to provide socio-emotional support for patients and their families during care. In order to expand the service provided by certified child life specialists, we created a social robot and a virtual avatar that augment part of the care CCLS offers to patients by engaging pediatric patients in playful interactions and promoting their socio-emotional wellbeing. We ran a randomized controlled trial in a form of a Wizard-of-Oz study at a local pediatric hospital to study how three different interactive media (a plush teddy bear, a virtual agent on a screen, and a social robot) influence the pediatric patient's affect, joyful play, and social interactions with others. Behavioral analyses of verbal utterance transcriptions and children's physical behavior revealed that the social robot is most effective in producing socially energetic conversations as well as increasing positivity and promoting multi-party interactions. The virtual avatar was socially engaging but children tended to attend more exclusively to a virtual avatar and were less responsive to others. The plush toy was least engaging of the three interventions, but children touched it the most. Based on these findings, we recommend use cases for each agent appropriate for individual pediatric patients' health conditions and needs. These analyses of behavioral data suggest the benefit of deploying a physically embodied social robot in pediatric inpatient-care contexts on young patients'; social and emotional wellbeing.",
  "authors": [
    {
      "name": "Sooyeon Jeong",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459944557",
      "orcid": "missing"
    },
    {
      "name": "Cynthia Breazeal",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100258451",
      "orcid": "missing"
    },
    {
      "name": "Deirdre Logan",
      "institution": "Boston Children's Hospital, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658688683",
      "orcid": "missing"
    },
    {
      "name": "Peter Weinstock",
      "institution": "Boston Children's Hospital, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658691296",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aoalgeirsson, S.O. 2008. MeBot: The design of a portable mobile robotic platform for robot-mediated interaction at a distance. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "von Baeyer, C.L. 2009. Numerical rating scale for self-report of pain intensity in children and adolescents: recent progress and further questions. European journal of pain (London, England). 13, 10 (Nov. 2009), 1005--7.",
      "doi": ""
    },
    {
      "text": "Bakx, I. et al. 2003. Facial orientation during multi-party interaction with information kiosks. Proceedings of INTERACT (2003), 701--704.",
      "doi": ""
    },
    {
      "text": "Beran, T.N. et al. 2013. Reducing children's pain and distress towards flu vaccinations: A novel and effective application of humanoid robotics. Vaccine. 31, 25 (2013), 2772--2777.",
      "doi": ""
    },
    {
      "text": "Bers, M.U. et al. 1998. Interactive Storytelling Environments: Coping with Cardiac Illness at Boston's Children's Hospital. the SIGCHI conference on Human factors in computing systems (1998), 603--610.  ",
      "doi": "10.1145/274644.274725"
    },
    {
      "text": "Bickmore, T.W. et al. 2009. Taking the time to care: empowering low health literacy hospital patients with virtual nurse agents. Proceedings of the 27th international conference on Human factors in computing systems (2009), 1265--1274.  ",
      "doi": "10.1145/1518701.1518891"
    },
    {
      "text": "Braun, C. et al. 2009. Animal-assisted therapy as a pain relief intervention for children. Complementary therapies in clinical practice. 15, 2 (May 2009), 105--9. http://doi.acm.org/10.1145/503376.503378",
      "doi": ""
    },
    {
      "text": "Chambers, C.T. et al. 2002. The impact of maternal behavior on children's pain experiences: An experimental analysis. Journal of Pediatric Psychology. 27, 3 (2002), 293--301.",
      "doi": ""
    },
    {
      "text": "Cohen, S. and Wills, T.A. 1985. Stress, Social Support, and the Buffering Hypothesis. Psychological Bulletin. 98, 2 (1985), 310--357.",
      "doi": ""
    },
    {
      "text": "Davis, M.J. 2010. Contrast coding in multiple regression analysis: Strengths, weaknesses, and utility of popular coding structures. Journal of Data Science. 8, (2010), 61--73.",
      "doi": ""
    },
    {
      "text": "DiMatteo, M. 2004. Social support and patient adherence to medical treatment: a meta-analysis. Health psychology. 23, 2 (2004), 207--18.",
      "doi": ""
    },
    {
      "text": "van der Drift, E. et al. 2014. A remote social robot to motivate and support diabetic children in keeping a diary. Proceedings of Human-Robot Interaction 2014. (2014).  ",
      "doi": "10.1145/2559636.2559664"
    },
    {
      "text": "Fasola, J. and Mataric, M. 2011. Comparing physical and virtual embodiment in a socially assistive robot exercise coach for the elderly.",
      "doi": ""
    },
    {
      "text": "Feil-Seifer, D. and Mataric, M. 2005. Defining socially assistive robotics. Proceedings of the 2005 IEEE 9th International Conference on Rehabilitation Robotics (2005), 465--468.",
      "doi": ""
    },
    {
      "text": "Greeff, J. De and Henkemans, O.B. 2014. Child-robot interaction in the wild: field testing activities of the ALIZ-E project. Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction (2014), 148--149.  ",
      "doi": "10.1145/2559636.2559804"
    },
    {
      "text": "Han, S. et al. 2005. Distinct neural substrates for the perception of real and virtual visual worlds. NeuroImage. 24, 3 (2005), 928--935.",
      "doi": ""
    },
    {
      "text": "Harlow, H.F. 1959. The Nature of Love. American psychologist. 13, 12 (1959), 673--685.",
      "doi": ""
    },
    {
      "text": "Hicks, C.L. et al. 2001. The Faces Pain Scale-Revised: toward a common metric in pediatric pain measurement. Pain. 93, 2 (2001), 173--183.",
      "doi": ""
    },
    {
      "text": "Jeong, S. et al. 2015. A Social Robot to Mitigate Stress, Anxiety, and Pain in Hospital Pediatric Care. Proceedings of the 2015 ACM/IEEE international conference on Human-Robot Interaction (2015), 103--104.  ",
      "doi": "10.1145/2701973.2702028"
    },
    {
      "text": "Jeong, S. et al. 2015. Designing a Socially Assistive Robot for Pediatric Care. Proceedings of the 14th international conference on Interaction Design and Children, 387--390.  ",
      "doi": "10.1145/2771839.2771923"
    },
    {
      "text": "Jeong, S. et al. 2017. Huggable: Impact of Embodiment on Promoting Verbal and Physical Engagement for Young Pediatric Inpatients. 26th iEEE Interantional Symposium on Robot and Human Interactive Communication (RO-MAN) (2017).",
      "doi": ""
    },
    {
      "text": "Shibata, T., et al. 2008. Robot therapy at elder care institutions: Effects of long-term interaction with seal robots. The engineering handbook of smart technology for aging, disability, and independence, 405--418.",
      "doi": ""
    },
    {
      "text": "Kaminski, M. et al. 2002. Play and Pets: The Physical and Emotional Impact of Child-Life and Pet Therapy on Hospitalized Children. Children's Health Care. 31, 4 (Dec. 2002), 321--335.",
      "doi": ""
    },
    {
      "text": "Li, J. 2015. The benefit of being physically present: A survey of experimental works comparing copresent robots, telepresent robots and virtual agents. International Journal of Human Computer Studies. 77, (2015), 23--27.  ",
      "doi": "10.1016/j.ijhcs.2015.01.001"
    },
    {
      "text": "Li, J. 2013. The Nature of the Bots: How People Respond to Robots, Virtual Agents and Humans as Multimodal Stimuli. Proceeding ICMI '13 Proceedings of the 15th ACM on International conference on multimodal interaction (2013), 337--340.  ",
      "doi": "10.1145/2522848.2532193"
    },
    {
      "text": "McCullagh, P. and Nelder, J.A. 1989. Generalized Linear Models, Second Edition.",
      "doi": ""
    },
    {
      "text": "Mostafa, M. et al. 2016. Incorporating Emotion and Personality-Based Analysis in User-Centered Modelling. Research and Development in Intelligent Systems XXXIII: Incorporating Applications and Innovations in Intelligent Systems XXIV (2016), 383--389.",
      "doi": ""
    },
    {
      "text": "Nilsson, S. et al. 2014. The Facial Affective Scale as a Predictor for Pain Unpleasantness When Children Undergo Immunizations. Nursing Research and Practice. 2014, (2014), 1--7.",
      "doi": ""
    },
    {
      "text": "Ringoot, A.P. et al. 2013. Young Children's Self-reported Emotional, Behavioral, and Peer Problems: The Berkeley Puppet Interview. Psychological Assessment. 25, 4 (2013), 1273--1285.",
      "doi": ""
    },
    {
      "text": "Sobo, E.J. et al. 2006. Canine visitation (pet) therapy: pilot data on decreases in child pain perception. Journal of holistic nursing: official journal of the American Holistic Nurses' Association. 24, 1 (2006), 51--7.",
      "doi": ""
    },
    {
      "text": "Spielberger, C. and Edwards, C. 1973. State-trait Anxiety Inventory for Children: STAIC: How I Feel Questionnaire: Professional Manual. Mind Garden. (1973), 2014.",
      "doi": ""
    },
    {
      "text": "Uchino, B.N. et al. 1996. The Relationship Between Social Support and Physiological Processes: A Review With Emphasis on Underlying Mechanisms and Implications for Health. Psychological Bulletin. 119, 3 (1996), 488--531.",
      "doi": ""
    },
    {
      "text": "Vandewater, E.A. 2006. Time Well Spent? Relating Television Use to Children's Free-Time Activities. Pediatrics. 117, 2 (2006), 181--191.",
      "doi": ""
    },
    {
      "text": "Wainer, J. et al. 2006. The role of physical embodiment in human-robot interaction. Proceedings - IEEE International Workshop on Robot and Human Interactive Communication. (2006), 117--122.",
      "doi": ""
    },
    {
      "text": "Watson, D. et al. 1988. Development and Validation of Brief Measures of Positive and Negative Affect: The PANAS Scales. Journal of Personality and Social Psychology. 54, 6 (1988), 1063--1070.",
      "doi": ""
    },
    {
      "text": "What is a Child Life Specialist? .",
      "doi": ""
    },
    {
      "text": "Wilson, J.M. 2006. Child life services. Pediatrics. 118, 4 (Oct. 2006), 1757--63.",
      "doi": ""
    },
    {
      "text": "Robins, B., et al. 2005. Robotic assistants in therapy and education of children with autism: can a small humanoid robot help encourage social interaction skills?. Universal Access in the Information Society, 4(2), 105--120.  ",
      "doi": "10.1007/s10209-005-0116-3"
    },
    {
      "text": "Mazzei, D., et al. 2011. Development and evaluation of a social robot platform for therapy in autism. In Engineering in Medicine and Biology Society, EMBC, 2011 Annual International Conference of the IEEE, 4515--4518.",
      "doi": ""
    },
    {
      "text": "Jeong, S., 2017. The Impact of Social Robots on Young Patients' Socio-emotional Well-being in a Pediatric Inpatient Care Context. MS Thesis. Media Arts and Sciences, MIT.",
      "doi": ""
    },
    {
      "text": "Peterson, A. M., et al. 2007. Parents' interpersonal distance and touch behavior and child pain and distress during painful pediatric oncology procedures. Journal of Nonverbal Behavior 31, 2 (2007), 79--97.",
      "doi": ""
    },
    {
      "text": "Wilson, J. M., Goldberger, J. 1996. Children in the process of becoming. Arch Pediatr Adolesc Med. 150 (1996), 1234--1235.",
      "doi": ""
    },
    {
      "text": "Thompson, R. H. 1995. Documenting the value of play for hospitalized children: the challenge of playing the game. ACCH Advocate. 2 (1995), 11--19.",
      "doi": ""
    },
    {
      "text": "Solnit, A. 1984. Preparing. Psychoanal Study Child. 7 (1984), 613--632",
      "doi": ""
    },
    {
      "text": "Southall, D. P., Burr, S., Smith, R. D., et al. 2000. The child-friendly healthcare initiative (CFHI): healthcare provision in accordance with the UN convention on the rights of the child. Pediatrics. 106 (2000), 1054--1064",
      "doi": ""
    },
    {
      "text": "Rollins, J. A., Bolig, R., Mahan, C. 2005. Meeting Children's Psychosocial Needs: Across the Health-Care Continuum. Austin, TX: Pro-Ed.",
      "doi": ""
    }
  ]
}