{
  "doi": "10.1145/3173574.3173755",
  "title": "WrisText: One-handed Text Entry on Smartwatch using Wrist Gestures",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present WrisText - a one-handed text entry technique for smartwatches using the joystick-like motion of the wrist. A user enters text by whirling the wrist of the watch hand, towards six directions which each represent a key in a circular keyboard, and where the letters are distributed in an alphabetical order. The design of WrisText was an iterative process, where we first conducted a study to investigate optimal key size, and found that keys needed to be 55º or wider to achieve over 90% striking accuracy. We then computed an optimal keyboard layout, considering a joint optimization problem of striking accuracy, striking comfort, word disambiguation. We evaluated the performance of WrisText through a five-day study with 10 participants in two text entry scenarios: hand-up and hand-down. On average, participants achieved a text entry speed of 9.9 WPM across all sessions, and were able to type as fast as 15.2 WPM by the end of the last day.",
  "tags": [
    "text entry",
    "smartwatch",
    "one-handed input"
  ],
  "authors": [
    {
      "name": "Jun Gong",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659081291",
      "orcid": "missing"
    },
    {
      "name": "Zheer Xu",
      "institution": "Shanghai Jiao Tong University & Dartmouth College, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260507",
      "orcid": "missing"
    },
    {
      "name": "Qifan Guo",
      "institution": "University of Science & Technology of China & Dartmouth College, Hefei, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261969",
      "orcid": "missing"
    },
    {
      "name": "Teddy Seyed",
      "institution": "University of Calgary, Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486653672",
      "orcid": "0000-0003-3388-0166"
    },
    {
      "name": "Xiang 'Anthony' Chen",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81498649386/rel-imgonly/xac.jpg",
      "acmid": "81498649386",
      "orcid": "missing"
    },
    {
      "name": "Xiaojun Bi",
      "institution": "Stony Brook University, Stony Brook, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309485662",
      "orcid": "0000-0002-9716-7709"
    },
    {
      "name": "Xing-Dong Yang",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481651",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American National Corpus. 2016. Retrieved April 20, 2017 from http://www.anc.org/",
      "doi": ""
    },
    {
      "text": "Aria Wearable. 2014. Retrieved July 15, 2017 from http://www.ariawearables.com/",
      "doi": ""
    },
    {
      "text": "TouchOne Keyboard. 2015. Retrieved July 15, 2017 from http://www.touchone.net/",
      "doi": ""
    },
    {
      "text": "Johnny Accot and Shumin Zhai. 2002. More than dotting the i's - foundations for crossing-based interfaces. In Proceedings of the 20th Annual ACM Conference on Human Factors in Computing Systems (CHI'02), 73--80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Sandip Agrawal, Ionut Constandache, Shravan Gaonkar, Romit Roy Choudhury, Kevin Caves and Frank DeRuyter. 2011. Using mobile phones to write in air. In Proceedings of the 9th international conference on Mobile Systems, Applications, and Services (MobiSys'11), 15--28.  ",
      "doi": "10.1145/1999995.1999998"
    },
    {
      "text": "Brian Amento, Will Hill and Loren Terveen. 2002. The sound of one hand: a wrist-mounted bio-acoustic fingertip gesture interface. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA'02), 724--725.  ",
      "doi": "10.1145/506443.506566"
    },
    {
      "text": "Xiaojun Bi, Tomer Moscovich, Gonzalo Ramos, Ravin Balakrishnan and Ken Hinckley. 2008. An exploration of pen rolling for pen-based interaction. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST'08), 191--200.  ",
      "doi": "10.1145/1449715.1449745"
    },
    {
      "text": "Xiaojun Bi, Barton A. Smith and Shumin Zhai. 2010. Quasi-qwerty soft keyboard optimization. In Proceedings of the 28th Annual ACM Conference on Human Factors in Computing Systems (CHI'10), 283286.  ",
      "doi": "10.1145/1753326.1753367"
    },
    {
      "text": "Xiaojun Bi and Shumin Zhai. 2016. IJQwerty: What Difference Does One Key Change Make? Gesture Typing Keyboard Optimization Bounded by One Key Position Change from Qwerty. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16), 49--58.  ",
      "doi": "10.1145/2858036.2858421"
    },
    {
      "text": "Barry Brown, Moira McGregor and Donald McMillan. 2014. 100 days of iPhone use: understanding the details of mobile device use. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices and services (MobileHCI'14), 223--232.  ",
      "doi": "10.1145/2628363.2628377"
    },
    {
      "text": "Vikram Cannanure, Xiang 'Anthony' Chen and Jennifer Mankoff. 2016. Twist'n'Knock: A One-handed Gesture for Smart Watches. In Proceedings of the 42nd Graphics Interface Conference (GI'16), 189--193.  ",
      "doi": "10.5555/3076132.3076169"
    },
    {
      "text": "Liwei Chan, Yi-Ling Chen, Chi-Hao Hsieh, Rong-Hao Liang and Bing-Yu Chen. 2015. CyclopsRing: Enabling Whole-Hand and Context-Aware Interactions Through a Fisheye Ring. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST'15), 549--556.  ",
      "doi": "10.1145/2807442.2807450"
    },
    {
      "text": "Xiang 'Anthony' Chen, Tovi Grossman and George Fitzmaurice. 2014. Swipeboard: a text entry technique for ultra-small interfaces that supports novice to expert transitions. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST'14), 615--620.  ",
      "doi": "10.1145/2642918.2647354"
    },
    {
      "text": "Andrew Crossan and Roderick Murray-Smith. 2004. Variability in Wrist-Tilt Accelerometer Based Gesture Interfaces. In International Conference on Mobile Human-Computer Interaction (MobileHCI'04), 144155.",
      "doi": ""
    },
    {
      "text": "Andrew Crossan, John Williamson, Stephen Brewster and Rod Murray-Smith. 2008. Wrist rotation for interaction in mobile contexts. In Proceedings of the 10th International conference on Human computer interaction with mobile devices and services (MobileHCI'08), 435--438.  ",
      "doi": "10.1145/1409240.1409307"
    },
    {
      "text": "Artem Dementyev and Joseph A. Paradiso. 2014. WristFlex: low-power gesture input with wrist-worn pressure sensors. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST'14), 161--166.  ",
      "doi": "10.1145/2642918.2647396"
    },
    {
      "text": "Leah Findlater and Jacob Wobbrock. 2012. Personalized input: improving ten-finger touchscreen typing through automatic adaptation. In Proceedings of the 30th Annual ACM Conference on Human Factors in Computing Systems (CHI'12), 815--824.  ",
      "doi": "10.1145/2207676.2208520"
    },
    {
      "text": "Rui Fukui, Masahiko Watanabe, Tomoaki Gyota, Masamichi Shimosaka and Tomomasa Sato. 2011. Hand shape classification with a wrist contour sensor: development of a prototype device. In Proceedings of the 13th international conference on Ubiquitous computing (Ubicomp'11), 311--314.  ",
      "doi": "10.1145/2030112.2030154"
    },
    {
      "text": "Jun Gong, Xing-Dong Yang and Pourang Irani. 2016. WristWhirl: One-handed Continuous Smartwatch Input using Wrist Gestures. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST'16), 861--872.  ",
      "doi": "10.1145/2984511.2984563"
    },
    {
      "text": "Joshua Goodman, Gina Venolia, Keith Steury and Chauncey Parker. 2002. Language modeling for soft keyboards. In Proceedings of the 7th international conference on Intelligent user interfaces (IUI'02), 194195.  ",
      "doi": "10.1145/502716.502753"
    },
    {
      "text": "Mitchell Gordon, Tom Ouyang and Shumin Zhai. 2016. WatchWriter: tap and gesture typing on a smartwatch miniature keyboard with statistical decoding. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16), ACM, 3817--3821.  ",
      "doi": "10.1145/2858036.2858242"
    },
    {
      "text": "Anhong Guo and Tim Paek. 2016. Exploring tilt for notouch, wrist-only interactions on smartwatches. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI'16), 17--28.  ",
      "doi": "10.1145/2935334.2935345"
    },
    {
      "text": "Aakar Gupta and Ravin Balakrishnan. 2016. DualKey: Miniature Screen Text Entry via Finger Identification. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16), 59--70.  ",
      "doi": "10.1145/2858036.2858052"
    },
    {
      "text": "Chris Harrison, Desney S. Tan and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the 28th Annual ACM Conference on Human Factors in Computing Systems (CHI'10), 453462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Ken Hinckley, Jeff Pierce, Mike Sinclair and Eric Horvitz. 2000. Sensing techniques for mobile interaction. In Proceedings of the 13th annual ACM symposium on User interface software and technology (UIST '00), 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Yamada Hisao. 1980. A Historical Study of Typewriters and Typing Methods: from the Position of Planning Japanese Parallels. Journal of Information Processing, 175--202.",
      "doi": ""
    },
    {
      "text": "Jonggi Hong, Seongkook Heo, Poika Isokoski and Geehyuk Lee. 2015. SplitBoard: A Simple Split Soft Keyboard for Wristwatch-sized Touch Screens. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15), 12331236.  ",
      "doi": "10.1145/2702123.2702273"
    },
    {
      "text": "Akiyo Kano and Janet C Read. 2009. Text input error categorisation: solving character level insertion ambiguities using Zero Time analysis. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BSC-HCI'09), 293--302. ",
      "doi": "10.5555/1671011.1671047"
    },
    {
      "text": "Keiko Katsuragawa, James R. Wallace and Edward Lank. 2016. Gestural Text Input Using a Smartwatch. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI'16), 220--223.  ",
      "doi": "10.1145/2909132.2909273"
    },
    {
      "text": "Frederic Kerber, Antonio Krüger and Markus Löchtefeld. 2014. Investigating the effectiveness of peephole interaction for smartwatches in a map navigation task. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices and services (MobileHCI'14), 291--294.  ",
      "doi": "10.1145/2628363.2628393"
    },
    {
      "text": "Frederic Kerber, Markus Lochtefeld, Antonio Kruger, Jess McIntosh, Charlie McNeill and Mike Fraser. 2016. Understanding Same-Side Interactions with Wrist-Worn Devices. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI'16), 1--10.  ",
      "doi": "10.1145/2971485.2971519"
    },
    {
      "text": "Frederic Kerber, Pascal Lessel and Antonio Kruger. 2015. Same-side Hand Interactions with Arm-placed Devices Using EMG. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA'15), 1367--1372.  ",
      "doi": "10.1145/2702613.2732895"
    },
    {
      "text": "Per-Ola Kristensson and Shumin Zhai. 2004. SHARK 2: a large vocabulary shorthand writing system for penbased computers. In Proceedings of the 17th annual ACM symposium on User interface software and technology (UIST'04), 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Gordon P. Kurtenbach, Abigail J. Sellen and William A. S. Buxton. 1993. An empirical evaluation of some articulatory and cognitive aspects of marking menus. Journal of Human-Computer Interaction, 1--23.  ",
      "doi": "10.1207/s15327051hci0801_1"
    },
    {
      "text": "James R. Lewis, Peter J. Kennedy and Mary J. LaLomia. 1999. Development of a Digram-Based Typing Key Layout for Single-Finger/Stylus Input. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 415--419.",
      "doi": ""
    },
    {
      "text": "Christian Loclair, Sean Gustafson and Patrick Baudisch. 2010. PinchWatch: a wearable device for one-handed microinteractions. In Proceedings of the 12th international conference on Human-computer interaction with mobile devices and services (MobileHCI'10).",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and Shawn X. Zhang. 1999. The design and evaluation of a high-performance soft keyboard. In Proceedings of the 17th Annual ACM conference on Human Factors in Computing Systems (CHI'99), 25--31.  ",
      "doi": "10.1145/302979.302983"
    },
    {
      "text": "Jennifer Mankoff and Gregory D. Abowd. 1998. Cirrin: a word-level unistroke keyboard for pen input. In Proceedings of the 11th annual ACM symposium on User interface software and technology (UIST'98), 213--214.  ",
      "doi": "10.1145/288392.288611"
    },
    {
      "text": "Wenguang Mao, Jian He and Lili Qiu. 2016. CAT: high-precision acoustic motion tracking.In Proceedings of the 22nd Annual International Conference on Mobile Computing and Networking (MobiCom'16), 69--81.  ",
      "doi": "10.1145/2973750.2973755"
    },
    {
      "text": "Sachi Mizobuchi, Shinya Terasaki, Turo Keski-Jaskari, Jari Nousiainen, Matti Ryynanen and Miika Silfverberg. 2005. Making an impression: forcecontrolled pen input for handheld devices. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05), 1661--1664.  ",
      "doi": "10.1145/1056808.1056991"
    },
    {
      "text": "Stephen Oney, Chris Harrison, Amy Ogan and Jason Wiese. 2013. ZoomBoard: a diminutive qwerty soft keyboard using iterative zooming for ultra-small devices. In Proceedings of the 31th Annual ACM Conference on Human Factors in Computing Systems (CHI'13), 2799--2802.  ",
      "doi": "10.1145/2470654.2481387"
    },
    {
      "text": "Santiago Ortega-Avila, Bogdana Rakova, Sajid Sadi and Pranav Mistry. 2015. Non-invasive optical detection of hand gestures. In Proceedings of the 6th Augmented Human International Conference (AH'15), 179--180.  ",
      "doi": "10.1145/2735711.2735801"
    },
    {
      "text": "Antti Oulasvirta, Anna Reichel, Wenbin Li, Yan Zhang, Myroslav Bachynskyi, Keith Vertanen and Per Ola Kristensson. 2013. Improving two-thumb text entry on touchscreen devices. In Proceedings of the 31th Annual ACM Conference on Human Factors in Computing Systems (CHI'13), 2765--2774.  ",
      "doi": "10.1145/2470654.2481383"
    },
    {
      "text": "Morten Proschowsky, Nette Schultz and Niels Ebbe Jacobsen. 2006. An intuitive text input method for touch wheels. In Proceedings of the 24th Annual ACM Conference on Human Factors in Computing Systems (CHI'06), 467--470.  ",
      "doi": "10.1145/1124772.1124842"
    },
    {
      "text": "Mahfuz Rahman, Sean Gustafson, Pourang Irani and Sriram Subramanian. 2009. Tilt techniques: investigating the dexterity of wrist-based input In Proceedings of the 27th Annual ACM Conference on Human Factors in Computing Systems (CHI'09), 19431952.  ",
      "doi": "10.1145/1518701.1518997"
    },
    {
      "text": "Jun Rekimoto. 2001. GestureWrist and GesturePad: Unobtrusive Wearable Interaction Devices. In Proceedings of the 5th IEEE International Symposium on Wearable Computers (ISWC'01), 21. ",
      "doi": "10.5555/580581.856565"
    },
    {
      "text": "T. Scott Saponas, Desney S. Tan, Dan Morris, Ravin Balakrishnan, Jim Turner and James A. Landay. 2009. Enabling always-available input with muscle-computer interfaces. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09), 167--176.  ",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "Tomoki Shibata, Daniel Afergan, Danielle Kong, Beste F. Yuksel, I. Scott MacKenzie and Robert J.K. Jacob. 2016. DriftBoard: A Panning-Based Text Entry Technique for Ultra-Small Touchscreens. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST'16), 575582.  ",
      "doi": "10.1145/2984511.2984591"
    },
    {
      "text": "Brian A. Smith, Xiaojun Bi and Shumin Zhai. 2015. Optimizing Touchscreen Keyboards for Gesture Typing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15), 3365--3374.  ",
      "doi": "10.1145/2702123.2702357"
    },
    {
      "text": "Paul Strohmeier, Roel Vertegaal and Audrey Girouard. 2012. With a flick of the wrist: stretch sensors as lightweight input for mobile devices. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI'12), 307308.  ",
      "doi": "10.1145/2148131.2148195"
    },
    {
      "text": "Ke Sun, Yuntao Wang, Chun Yu, Yukang Yan, Hongyi Wen and Yuanchun Shi. 2017. Float: One-Handed and Touch-Free Target Selection on Smartwatches. In Proceedings of the 35th Annual ACM Conference on Human Factors in Computing Systems (CHI'17), 692704.  ",
      "doi": "10.1145/3025453.3026027"
    },
    {
      "text": "Li Sun, Souvik Sen, Dimitrios Koutsonikolas and KyuHan Kim. 2015. WiDraw: Enabling Hands-free Drawing in the Air on Commodity WiFi Devices. In Proceedings of the 21st Annual International Conference on Mobile Computing and Networking (MobiCom'15), 77--89.  ",
      "doi": "10.1145/2789168.2790129"
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: a technique for operating pen-based interfaces using touch. In Proceedings of the 25th Annual ACM Conference on Human Factors in Computing Systems (CHI '07), 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Jue Wang, Deepak Vasisht and Dina Katabi. 2014. RFIDraw: virtual touch screen in the air using RF signals. In Proceedings of the 2014 ACM conference on SIGCOMM (SIGCOMM '14), 235--246.  ",
      "doi": "10.1145/2619239.2626330"
    },
    {
      "text": "Wei Wang, Alex X. Liu and Ke Sun. 2016. Device-free gesture tracking using acoustic signals. In Proceedings of the 22nd Annual International Conference on Mobile Computing and Networking (MobiCom'16), 82--94.  ",
      "doi": "10.1145/2973750.2973764"
    },
    {
      "text": "Lars Weberg, Torbjörn Brange and Åsa Wendelbo Hansson. 2001. A piece of butter on the PDA display. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA'01), 435--436.  ",
      "doi": "10.1145/634067.634320"
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers and John A. Kembel. 2003. EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion. In Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST'03), 61--70.  ",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Katrin Wolf, Anja Naumann, Michael Rohs and Jorg Muller. 2011. Taxonomy of microinteractions: defining microgestures based on ergonomic and scenariodependent requirements. In Proceedings of the 13th IFIP TC 13 international conference on Humancomputer interaction - Volume Part I (INTERACT'11), 559--575. ",
      "doi": "10.5555/2042053.2042111"
    },
    {
      "text": "Ka-Ping Yee. 2003. Peephole displays: pen interaction on spatially aware handheld computers. In Proceedings of the 21th Annual ACM Conference Conference on Human Factors in Computing Systems (CHI'03), 1--8.  ",
      "doi": "10.1145/642611.642613"
    },
    {
      "text": "Xin Yi, Chun Yu, Weinan Shi, Xiaojun Bi and Yuanchun Shi. 2017. Word Clarity as a Metric in Sampling Keyboard Test Sets. In Proceedings of the 35th Annual ACM Conference on Human Factors in Computing Systems (CHI'17), 4216--4228.  ",
      "doi": "10.1145/3025453.3025701"
    },
    {
      "text": "Xin Yi, Chun Yu, Weijie Xu, Xiaojun Bi and Yuanchun Shi. 2017. COMPASS: Rotational Keyboard on NonTouch Smartwatches. In Proceedings of the 35th Annual ACM Conference on Human Factors in Computing Systems (CHI'17), 705--715.  ",
      "doi": "10.1145/3025453.3025454"
    },
    {
      "text": "Sangki Yun, Yi-Chao Chen and Lili Qiu. 2015. Turning a Mobile Device into a Mouse in the Air. In Proceedings of the 13th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys'15), 15--29.  ",
      "doi": "10.1145/2742647.2742662"
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2015. Tomo: Wearable, Low-Cost Electrical Impedance Tomography for Hand Gesture Recognition. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST'15), 167--173.  ",
      "doi": "10.1145/2807442.2807480"
    }
  ]
}