{
  "doi": "10.1145/3173574.3173688",
  "title": "Keeping a Low Profile?: Technology, Risk and Privacy among Undocumented Immigrants",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2018,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Undocumented immigrants in the United States face risks of discrimination, surveillance, and deportation. We investigate their technology use, risk perceptions, and protective strategies relating to their vulnerability. Through semi-structured interviews with Latinx undocumented immigrants, we find that while participants act to address offline threats, this vigilance does not translate to their online activities. Their technology use is shaped by needs and benefits rather than risk perceptions. While our participants are concerned about identity theft and privacy generally, and some raise concerns about online harassment, their understanding of government surveillance risks is vague and met with resignation. We identify tensions among self-expression, group privacy, and self-censorship related to their immigration status, as well as strong trust in service providers. Our findings have implications for digital literacy education, privacy and security interfaces, and technology design in general. Even minor design decisions can substantially affect exposure risks and well-being for such vulnerable communities.",
  "tags": [
    "undocumented immigrants",
    "privacy",
    "surveillance",
    "immigration",
    "technology use",
    "integration",
    "online risk"
  ],
  "authors": [
    {
      "name": "Tamy Guberek",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260535",
      "orcid": "missing"
    },
    {
      "name": "Allison McDonald",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659296796",
      "orcid": "0000-0001-7477-6782"
    },
    {
      "name": "Sylvia Simioni",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261195",
      "orcid": "missing"
    },
    {
      "name": "Abraham H. Mhaidli",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659082383",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    },
    {
      "name": "Florian Schaub",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548024188",
      "orcid": "0000-0003-1039-7155"
    }
  ],
  "references": [
    {
      "text": "Ruba Abu-Salma, M Angela Sasse, Joseph Bonneau, Anastasia Danilova, Alena Naiakshina, and Matthew Smith. 2017. Obstacles to the Adoption of Secure Communication Tools. In 2017 IEEE Symposium on Security and Privacy (SP'17). IEEE Computer Society.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Hunt Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, Yang Wang, and Shomir Wilson. 2016. Nudges for Privacy and Security: Understanding and Assisting Users' Choices Online. SSRN Electronic Journal (2016).  ",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. (2015).",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Leslie K. John, and George Loewenstein. 2013. What Is Privacy Worth? The Journal of Legal Studies 42, 2 (2013), 249--274.",
      "doi": ""
    },
    {
      "text": "Hazim Almuhimedi, Florian Schaub, Norman Sadeh, Idris Adjerid, Alessandro Acquisti, Joshua Gluck, Lorrie Faith Cranor, and Yuvraj Agarwal. 2015. Your Location has been Shared 5,398 Times!. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. 787--796.  ",
      "doi": "10.1145/2702123.2702210"
    },
    {
      "text": "Tawfiq Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing Children ' s Online Identities : How Parents Decide what to Disclose about their Children Online. Chi 2015 (2015), 1895--1904.  ",
      "doi": "10.1145/2702123.2702325"
    },
    {
      "text": "Susan B. Barnes. 2006. A privacy paradox: Social networking in the United States. First Monday 11, 9 (2006), 5.",
      "doi": ""
    },
    {
      "text": "Luis Fernando Baron and Ricardo Gomez. 2017. Living in the limits: Migration and information practices of undocumented Latino migrants. In IFIP Advances in Information and Communication Technology, Vol. 504. 147--158.",
      "doi": ""
    },
    {
      "text": "Luis Fernando Baron, Moriah Neils, and Ricardo Gomez. 2014. Crossing new borders: Computers, mobile phones, transportation, and english language among hispanic day laborers in seattle, washington. Journal of the American Society for Information Science & Technology 65, 1 (2014), 98--108.  ",
      "doi": "10.1002/asi.22949"
    },
    {
      "text": "Frank D. Bean, Susan K. Brown, and James D. Bachmeier. 2015. Parents without papers: The progress and pitfalls of Mexican American integration. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Alvaro M. Bedoya. 2017. Deportation is Going High-Tech Under Trump. The Atlantic (June 2017). https://www.theatlantic.com/technology/archive/2017/06/ data-driven-deportation/531090/ {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Ali Behdad. 2005. A Forgetful Nation: On Immigration and Cultural Identity in the United States. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Andrew Besmer and Heather Richter Lipford. 2010. Moving Beyond Untagging: Photo Privacy in a Tagged World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1563--1572.  ",
      "doi": "10.1145/1753326.1753560"
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure During Shifting Social Movements. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 610--622.  ",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Nikita Borisov, Ian Goldberg, and Eric Brewer. 2004. Off-the-record Communication, or, Why Not to Use PGP. In Proceedings of the 2004 ACM Workshop on Privacy in the Electronic Society (WPES '04). ACM, New York, NY, USA, 77--84.  ",
      "doi": "10.1145/1029179.1029200"
    },
    {
      "text": "Christoph Bösch, Benjamin Erb, Frank Kargl, Henning Kopp, and Stefan Pfattheicher. 2016. Tales from the Dark Side: Privacy Dark Strategies and Privacy Dark Patterns. Proceedings on Privacy Enhancing Technologies 2016, 4 (2016).",
      "doi": ""
    },
    {
      "text": "Danah Boyd. 2014. It's Complicated: The Social Lives of Networked Teens. Yale University Press. ",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Laura Brandimarte, Alessandro Acquisti, and George Loewenstein. 2013. Misplaced Confidences: Privacy and the Control Paradox. Social Psychological and Personality Science 4, 3 (2013), 340--347.",
      "doi": ""
    },
    {
      "text": "Russell Brandom. 2017. The US Border Patrol is trying to build face-reading drones. (6 April 2017). https: //www.theverge.com/2017/4/6/15208820/customs-borderpatrol-drone-facial-recognition-silicon-valley-dhs {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Susan K. Brown and Alejandra Jazmin Sanchez. 2017. Parental Legal Status and the Political Engagement of Second-Generation Mexican Americans. RSF: The Russell Sage Foundation Journal of the Social Sciences 3, 4 (2017), 136--47.",
      "doi": ""
    },
    {
      "text": "Andreas Buchenscheit, Bastian Könings, Andreas Neubert, Florian Schaub, Matthias Schneider, and Frank Kargl. 2014. Privacy implications of presence sharing in mobile messaging applications. Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia - MUM '14 December (2014), 20--29.  ",
      "doi": "10.1145/2677972.2677980"
    },
    {
      "text": "Jenna Burrell and Ken Anderson. 2008. 'I have great desires to look beyond my world': Trajectories of information and communication technology use among Ghanaians living abroad. New Media and Society 10, 2 (2008), 203--224.",
      "doi": ""
    },
    {
      "text": "Ricardo Castro-Salazar and Carl Bagley. 2010. 'Ni de aquí ni from there'. Navigating between contexts: Counter-narratives of undocumented Mexican students in the United States. Race Ethnicity and Education 13, 1 (2010), 23--40.",
      "doi": ""
    },
    {
      "text": "Daphne Chang, Erin L. Krupka, Eytan Adar, and Alessandro Acquisti. 2016. Engineering Information Disclosure: Norm Shaping Designs. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. 587--597.  ",
      "doi": "10.1145/2858036.2858346"
    },
    {
      "text": "Leo R. Chavez. 2012. Shadowed Lives: Undocumented Immigrants in American Society (third ed.). Wadsworth.",
      "doi": ""
    },
    {
      "text": "Jay Chen, Michael Paik, and Kelly McCabe. 2014. Exploring Internet Security Perceptions and Practices in Urban Ghana. SOUPS '14: Proceedings of the Tenth Symposium On Usable Privacy and Security (2014), 129--142. https://www.usenix.org/conference/soups2014/ proceedings/presentation/chen",
      "doi": ""
    },
    {
      "text": "Wenli Chen. 2010. Internet-Usage Patterns of Immigrants in the Process of Intercultural Adaptation. CyberPsychology, Behavior & Social Networking 13, 4 (2010), 387--399.",
      "doi": ""
    },
    {
      "text": "Wenli Chen and Wenting Xie. 2012. Cyber behaviors of immigrants. Encyclopedia of Cyber Behavior, 259--272.",
      "doi": ""
    },
    {
      "text": "Mathew Coleman. 2012. The \"Local\" Migration State: The Site-Specific Devolution of Immigration Enforcement in the U.S. South. Law and Policy 34, 2 (2012), 159--190.",
      "doi": ""
    },
    {
      "text": "Sasha Constanza-Chock. 2011. Digital Popular Communication: Lessons on Information and Communication Technologies for Social Change from the Immigrant Rights Movement National. Civic Review (Fall 2011), 29--35.",
      "doi": ""
    },
    {
      "text": "Stephen M. Croucher. 2011. Social Networking and Cultural Adaptation: A Theoretical Model. Journal of International and Intercultural Communication 4, 4 (2011), 259--264.",
      "doi": ""
    },
    {
      "text": "Ralf De Wolf, Koen Willaert, and Jo Pierson. 2014. Managing privacy boundaries together: Exploring individual and group privacy management strategies in Facebook. Computers in Human Behavior 35 (2014), 444--454.",
      "doi": ""
    },
    {
      "text": "Department of Homeland Security. 2012. Exercising Prosecutorial Discretion with Respect to Individuals Who Came to the United States as Children. (15 June 2012). https://www.dhs.gov/xlibrary/assets/s1-exercisingprosecutorial-discretion-individuals-who-came-to-usas-children.pdf {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Diaspora. 2017. (2017). https://diasporafoundation.org/ {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Roger Dingledine, Nick Mathewson, and Paul Syverson. 2004. Tor: The second-generation onion router. Usenix. http://static.usenix.org/legacy/events/sec04/tech/ dingledine.html ",
      "doi": "10.5555/1251375.1251396"
    },
    {
      "text": "Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2011. Connection strategies: Social capital implications of Facebook-enabled communication practices. New Media & Society 13, 6 (2011), 873--892.",
      "doi": ""
    },
    {
      "text": "Laura E. Enriquez. 2011. 'Because We Feel the Pressure and We Also Feel the Support': Examining the Educational Success of Undocumented Immigrant Latina/o Students. Harvard Educational Review 81, 3 (2011), 476--500.",
      "doi": ""
    },
    {
      "text": "Adolfo Flores. 2017. People Are Worried About DHS Plans To Gather Social Media Info. Buzzfeed News (September 2017). https://www.buzzfeed.com/adolfoflores/people-areworried-about-dhs-plans-to-gather-social-media {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Forbes On Marketing. 2012. Social Media And The Big Data Explosion. (Jul 2012). https://www.forbes.com/sites/onmarketing/2012/06/28/ social-media-and-the-bigdata-explosion/#58a8c1766a61 {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Simson Garfinkel and Heather Richter Lipford. 2014. Usable Security: History, Themes, and Challenges. Synthesis Lectures on Information Security, Privacy, and Trust 5, 2 (2014), 1--124. ",
      "doi": "10.5555/2755205"
    },
    {
      "text": "Ruth Gomberg-Muñoz. 2011. Labor and Legality: An Ethnography of a Mexican Immigrant Network. Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Ricardo Gomez and Sara Vannini. 2015. Fotohistorias: Participatory Photography and the Experience of Migration. CreateSpace Independent Publishing Platform, Seattle, WA.",
      "doi": ""
    },
    {
      "text": "Roberto G. Gonzales and Leo Chavez. 2012. \"Awakening to a nightmare\": Abjectivity and illegality in the lives of undocumented 1.5-generation Latino immigrants in the United States. Current Anthropology 53, 3 (2012), 255--281.",
      "doi": ""
    },
    {
      "text": "Roberto. G. Gonzales and Steven Raphael. 2017. Illegality: A Contemporary Portrait of Immigration. RSF: The Russell Sage Foundation Journal of the Social Sciences 3, 4 (2017), 1--17.",
      "doi": ""
    },
    {
      "text": "Glenn Greenwald. 2014. No Place to Hide: Edward Snowden, the NSA, and the U.S. Surveillance State. Metropolitan Books. ",
      "doi": "10.5555/2621976"
    },
    {
      "text": "Ralph Gross and Alessandro Acquisti. 2005. Information Revelation and Privacy in Online Social Networks. (2005), 71--80.  ",
      "doi": "10.1145/1102199.1102214"
    },
    {
      "text": "Lauren E. Gulbas and Luis H. Zayas. 2017. Exploring the Effects of U.S Immigration Enforcement on the Well-being of Citizen Children in Mexican Immigrant Families. RSF: The Russell Sage Foundation Journal of the Social Sciences 3, 4 (2017), 53--69.",
      "doi": ""
    },
    {
      "text": "Lisa J. Hardy, Christina M. Getrich, Julio C. Quezada, Amanda Guay, Raymond J. Michalowski, and Eric Henley. 2012. A call for further research on the impact of state-level immigration policies on public health. (2012).",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Alice Marwick. 2016. \"What Can I Really Do?\" Explaining the Privacy Paradox with Online Apathy. International Journal of Communication 10, 0 (2016), 21.",
      "doi": ""
    },
    {
      "text": "Bernie Hogan. 2010. The Presentation of Self in the Age of Social Media: Distinguishing Performances and Exhibitions Online. Bulletin of Science, Technology & Society 30, 6 (2010), 377--386.",
      "doi": ""
    },
    {
      "text": "Iulia Ion, Rob Reeder, and Sunny Consolvo. 2015. ...no one can hack my mind\": Comparing Expert and Non-Expert Security Practices. In Proc. Symposium on Usable Privacy and Security (SOUPS'15), USENIX (2015). https://www.usenix.org/system/files/conference/ soups2015/soups15-paper-ion.pdf",
      "doi": ""
    },
    {
      "text": "Michael Jones-Correa and James A. McCann. 2016. In the Public but Not the Electorate: The \"Civic Status Gap\" in the United States. RSF: The Russell Sage Foundation Journal of the Social Sciences 2, 3 (2016), 1--19.",
      "doi": ""
    },
    {
      "text": "Anil Kalhan. 2013. Immigration Policing and Federalism Through the Lens of Technology, Surveillance and Privacy. Ohio State Law Journal 74 (2013). https://ssrn.com/abstract=2316327",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. \"My data just goes everywhere\": User mental models of the internet and implications for privacy and security. In Symposium on Usable Privacy and Security (SOUPS) 2015. 39--52.",
      "doi": ""
    },
    {
      "text": "Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in It Together: Interpersonal Management of Disclosure in Social Network Services. Annual conference on human factors in computing systems (2011), 3217--3226.  ",
      "doi": "10.1145/1978942.1979420"
    },
    {
      "text": "Jialiu Lin, Norman Sadeh, Shahriyar Amini, Janne Lindqvist, Jason I Hong, and Joy Zhang. 2012. Expectation and purpose: understanding users' mental models of mobile app privacy through crowdsourcing. Proceedings of the 2012 ACM Conference on Ubiquitous Computing - UbiComp '12 (2012), 501.  ",
      "doi": "10.1145/2370216.2370290"
    },
    {
      "text": "Dara Lind. 2017. Fewer immigrants are being deported under Trump than under Obama: But it's not because Trump isn't trying. Vox (Aug. 2017). https://www.vox.com/policy-and-politics/2017/8/10/ 16119910/trump-deportations-obama {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Eden Litt and Eszter Hargittai. 2014. A bumpy ride on the information superhighway: Exploring turbulence online. Computers in Human Behavior 36 (2014), 520--529.  ",
      "doi": "10.1016/j.chb.2014.04.027"
    },
    {
      "text": "William D. Lopez, Daniel J. Kruger, Jorge Delva, Mikel Llanes, Charo Ledón, Adreanne Waller, Melanie Harner, Ramiro Martinez, Laura Sanders, Margaret Harner, and Barbara Israel. 2017. Health Implications of an Immigration Raid: Findings from a Latino Community in the Midwestern United States. Journal of Immigrant and Minority Health 19, 3 (2017), 702--708.",
      "doi": ""
    },
    {
      "text": "Mary Madden. 2017. Privacy, Security, and Digital Inequality. Research report. Data & Society. https://datasociety.net/output/privacy-security-anddigital-inequality/ {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Mastodon. 2017. Decentralized Social Network. (2017). https://mastodon.social {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Kathleen O'Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F. Churchill, and Sunny Consolvo. 2017. Stories from Survivors: Privacy & Security Practices when Coping with Intimate Partner Abuse. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. 2189--2201.  ",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Roger C. Mayer, James H. Davis, and F. David Schoorman. 1995. An Integrative Model of Organizational Trust. Academy of Management Review 20, 3 (1995), 709--734.",
      "doi": "10.2307/258792"
    },
    {
      "text": "Susan E. McGregor, Franziska Roesner, and Kelly Caine. 2016. Individual versus Organizational Computer Security and Privacy Concerns in Journalism. Proceedings on Privacy Enhancing Technologies (2016).",
      "doi": ""
    },
    {
      "text": "Cecilia Menjivar. 2006. Liminal legality: Salvadoran and Guatemalan immigrants' lives in the United States. Amer. J. Sociology 111, 4 (2006), 999--1037.",
      "doi": ""
    },
    {
      "text": "Brian Naylor. 2017. Trump's Plan To Hire 15,000 Border Patrol And ICE Agents Won't Be Easy. (February 2017). http://www.npr.org/2017/02/23/516712980/trumps-plan-tohire-15-000-border-patrol-and-ice-agents-wont-beeasy-to-fulfill {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press. ",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Patricia A. Norberg, Daniel R. Horne, and David A. Horne. 2007. The privacy paradox: Personal information disclosure intentions versus behaviors. Journal of Consumer Affairs 41, 1 (2007), 100--126.",
      "doi": "10.1111/j.1745-"
    },
    {
      "text": "Nicole L. Novak, Arline T. Geronimus, and Aresha M. Martinez-Cardoso. 2017. Change in birth outcomes among infants born to Latina mothers after a major immigration raid. International Journal of Epidemiology 46, 3 (2017), 839--849.",
      "doi": ""
    },
    {
      "text": "Michael A. Olivas. 2007. Immigration-Related State and Local Ordinances: Preemption, Prejudice, and the Proper Role for Enforcement. University of Chicago Legal Forum 2007, 1 (2007). https://ssrn.com/abstract=1069121",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Passel and D'Vera Cohn. 2017. As Mexican share declined, U.S. unauthorized immigrant population fell in 2015 below recession level. Fact Tank, Pew Research Center. (2017). http://www.pewresearch.org/fact-tank/2017/04/25/asmexican-share-declined-u-s-unauthorized-immigrantpopulation-fell-in-2015-below-recession-level/",
      "doi": ""
    },
    {
      "text": "Sandra Petronio. 2010. Communication Privacy Management Theory: What Do We Know About Family Privacy Regulation? Journal of Family Theory & Review 2, 3 (2010), 175--196.",
      "doi": ""
    },
    {
      "text": "Chanda Phelan, Ann Arbor, and Paul Resnick. 2016. It's Creepy, But It Doesn't Bother Me. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 5372--5384.  ",
      "doi": "10.1145/2858036.2858381"
    },
    {
      "text": "Alejandro Portes and Rubén G. Rumbaut. 2006. Immigrant America: A Portrait. Univ. of California Press.",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Rick Wash, and Brandon Brooks. 2012. Stories As Informal Lessons About Security., Article 6 (2012), 17 pages.",
      "doi": ""
    },
    {
      "text": "Ashwini Rao, Florian Schaub, Norman Sadeh, Alessandro Acquisti, and Ruogu Kang. 2016. Expecting the Unexpected: Understanding Mismatched Privacy Expectations Online. (2016), 77--96. https://www.usenix.org/conference/soups2016/technicalsessions/presentation/rao",
      "doi": ""
    },
    {
      "text": "Immigration Research and Information. 2012. Digital Diaspora: How Immigrants Are Capitalizing on Today's Technology. Philadelphia.",
      "doi": ""
    },
    {
      "text": "Rubén G. Rumbaut and Alejandro Portes. 2001. Ethnicities: Children of immigrants in America. Univ. of California Press.",
      "doi": ""
    },
    {
      "text": "Erin M Sales. 2014. The Biometric Revolution: An Erosion of the Fifth Amendment Privilege to Be Free from Self-Incrimination. U. Miami L. Rev. 69 (2014), 193. https://ssrn.com/abstract=2410688",
      "doi": ""
    },
    {
      "text": "Bruce Schneider. 2015. Data and Goliath: The Hidden Battles to Collect Your Data and Control Your World. W. W. Norton & Company. ",
      "doi": "10.5555/2685412"
    },
    {
      "text": "John T Scholz and Mark Lubell. 1998. Trust and Taxpaying: Testing the Heuristic Approach to Collective Action. American Journal of Political Science 42, 2 (1998), 398--417.",
      "doi": ""
    },
    {
      "text": "Fatemeh Shirazi and Melanie Volkamer. 2014. What Deters Jane from Preventing Identification and Tracking on the Web?. In Proceedings of the 13th Workshop on Privacy in the Electronic Society (WPES '14). ACM, New York, NY, USA, 107--116.  ",
      "doi": "10.1145/2665943.2665963"
    },
    {
      "text": "Dawinder S Sidhu. 2007. The Chilling Effect of Government Surveillance Programs on the Use of the Internet By Muslim-Americans. University of Maryland Law Journal of Race, Religion, Gender and Class 7 (2007), 375--393. https://ssrn.com/abstract=1002145",
      "doi": ""
    },
    {
      "text": "P Slovic. 1987. Perception of risk. Science 236, 4799 (1987), 280--285.",
      "doi": ""
    },
    {
      "text": "Robert Snell. 2017. Feds use anti-terror tool to hunt the undocumented. (18 May 2017). http: //www.detroitnews.com/story/news/local/detroit-city/ 2017/05/18/cell-snooping-fbi-immigrant/101859616/ {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Carola Suárez-Orozco, Marcelo M. Suárez-Orozco, and Irina Todorova. 2009. Learning a New Land: Immigrant Students in American Society. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Linnet Taylor, Luciano Floridi, and Bart van der Sloot (Eds.). 2017. Group Privacy. Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Paul Taylor, Mark H. Lopez, Jeffrey S. Passel, and Seth Motel. 2011. Unauthorized Immigrants: Length of Residency, Patterns of Parenthood. Pew Hispanic Center. (2011). http://assets.pewresearch.org/wp-content/uploads/sites/ 7/2011/12/Unauthorized-Characteristics.pdf",
      "doi": ""
    },
    {
      "text": "The American Civil Liberties Union of Vermont. 2017. ACLU Demands Immediate End to DMV Facial Recognition Program. Press Release. (24 May 2017). https://www.acluvt.org/en/press-releases/aclu-demandsimmediate-end-dmv-facial-recognition-program {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "The White House. 2017a. Executive Order 13767. (25 January 2017). https://www.whitehouse.gov/the-pressoffice/2017/01/25/executive-order-border-securityand-immigration-enforcement-improvements {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "The White House. 2017b. Executive Order 13768. (25 January 2017). https://www.whitehouse.gov/the-pressoffice/2017/01/25/presidential-executive-orderenhancing-public-safety-interior-united {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "The White House. 2017c. Executive Order 13769. (25 January 2017). https://www.whitehouse.gov/the-pressoffice/2017/01/27/executive-order-protecting-nationforeign-terrorist-entry-united-states {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2015. Geek Heresy: Rescuing Social Change from the Cult of Technology. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Jenny Hsin-Chun Tsai. 2006. Use of Computer Technology to Enhance Immigrant Families' Adaptation. Journal of Nursing Scholarship 38, 1 (2006), 87--93.",
      "doi": ""
    },
    {
      "text": "Joseph Turow and Michael Hennessy. 2015. The Tradeoff Fallacy: How Marketers are Misrepresenting American Consumers and Opening Them Up to Exploitation. SSRN Electronic Journal (2015).",
      "doi": ""
    },
    {
      "text": "Jessica Vitak. 2012. The Impact of Context Collapse and Privacy on Social Network Site Disclosures. Journal of Broadcasting & Electronic Media 56, 4 (2012), 451--470.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak and Jinyoung Kim. 2014. \"You Can't Block People Offline\": Examining How Facebook's Affordances Shape the Disclosure Process. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 461--474.  ",
      "doi": "10.1145/2531602.2531672"
    },
    {
      "text": "Kaveh Waddell. 2017. 'Give Us Your Passwords'. The Atlantic (February 2017). https://www.theatlantic.com/technology/archive/2017/02/ give-us-your-passwords/516315/ {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Alessandro Acquisti, Lorrie Faith Cranor, Alain Forget, and Norman Sadeh. 2014. A Field Trial of Privacy Nudges for Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2367--2376.  ",
      "doi": "10.1145/2556288.2557413"
    },
    {
      "text": "Yang Wang, Gregory Norcie, Saranga Komanduri, Alessandro Acquisti, Pedro Giovanni Leon, and Lorrie Faith Cranor. 2011. \"I Regretted the Minute I Pressed Share\": A Qualitative Study of Regrets on Facebook. In Proceedings of the Seventh Symposium on Usable Privacy and Security (SOUPS '11). ACM, New York, NY, USA, Article 10, 16 pages.  ",
      "doi": "10.1145/2078827.2078841"
    },
    {
      "text": "Tom Warren. 2017. iOS 11 has a 'cop button' to temporarily disable Touch ID. The Verge, Aug. 17, 2017. (2017). https://www.theverge.com/2017/8/17/16161758/ios11-touch-id-disable-emergency-services-lock {Online; Retrieved 2 January 2018}.",
      "doi": ""
    },
    {
      "text": "Alma Whitten and J. D. Tygar. 1999. Why Johnny Can't Encrypt: A Usability Evaluation of PGP 5.0. In Proceedings of the 8th Conference on USENIX Security Symposium - Volume 8 (SSYM'99). USENIX Association, Berkeley, CA, USA, 14--14. http://dl.acm.org/citation.cfm?id=1251421.1251435 ",
      "doi": "10.5555/1251421.1251435"
    },
    {
      "text": "Jill Palzkill Woelfer and David G. Hendry. 2010. Homeless Young People's Experiences with Information Systems: Life and Work in a Community Technology Center. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1291--1300.  ",
      "doi": "10.1145/1753326.1753520"
    },
    {
      "text": "Svetlana Yarosh. 2013. Shifting Dynamics or Breaking Sacred Traditions?: The Role of Technology in Twelve-step Fellowships. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3413--3422.  ",
      "doi": "10.1145/2470654.2466468"
    },
    {
      "text": "Hirokazu Yoshikawa. 2011. Immigrants Raising Citizens: Undocumented Parents and Their Children. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Reza Zafarani, Mohammad Ali Abbasi, and Huan Liu. 2014. Social Media Mining: An Introduction. Cambridge University Press. ",
      "doi": "10.5555/2670030"
    },
    {
      "text": "Philip R. Zimmermann. 1995. The Official PGP User's Guide. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/202735"
    }
  ]
}