{
  "doi": "10.1145/3173574.3173642",
  "title": "Interactive Interior and Proxemics Thresholds: Empowering Participants in Sensitive Conversations",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The position and workings of interactive interior elements matter greatly on the relations people may enact. This paper reports on the conception and evaluation of an interactive table and its interior effects designed to support sensitive consultations between healthcare personnel, patients and relatives as they happen during treatment of cancer diseases in a hospital department of oncology. The interior design includes the physical shape of artefact, its digital functionality and how the seating around it is to take place. The design of the table is substantiated through observations of current practice, framing of the design challenge, conceptualization, and exploring form giving alternatives. Through a set of evaluations in actual use settings it is argued how the design concept of the table as interactive interior points to how notions in interaction proxemics should be rearticulated. In particular, this paper argues how proxemics thresholds should be regarded as dynamic and relational.",
  "tags": [
    "interactive interior",
    "sensitive contexts",
    "design in the wild",
    "interaction proxemics",
    "healthcare"
  ],
  "authors": [
    {
      "name": "Josephine Raun Thomsen",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705539",
      "orcid": "missing"
    },
    {
      "name": "Peter Gall Krogh",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100021191",
      "orcid": "missing"
    },
    {
      "name": "Jacob Albæk Schnedler",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658984588",
      "orcid": "missing"
    },
    {
      "name": "Hanne Linnet",
      "institution": "Herning Hospital, Herning, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261273",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anne Louise Bang, Peter Krogh, Martin Ludvigsen, and Thomas Markussen. 2012. The role of hypothesis in constructive design research. The Art of Research 2012: Making, Reflecting and understanding.",
      "doi": ""
    },
    {
      "text": "Eva Bjerrum and Susanne Dahl. 2017. Enabling organisational learning and knowledge sharing through employee involvement. OLKC 2010.",
      "doi": ""
    },
    {
      "text": "Caroline Bradbury-Jones, Sally Sambrook, and Fiona Irvine. 2008. Power and empowerment in nursing: a fourth theoretical approach. Journal of advanced nursing 62, 2: 258--266.",
      "doi": ""
    },
    {
      "text": "Eva Marie Castro, Tine Van Regenmortel, Kris Vanhaecht, Walter Sermeus, and Ann Van Hecke. 2016. Patient empowerment, patient participation and patientcenteredness in hospital care: A concept analysis based on a literature review. Patient Education and Counseling 99, 12: 1923--1939.",
      "doi": ""
    },
    {
      "text": "5 .Paul Dourish. 2006. Re-space-ing place: place and space ten years on. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, ACM, 299--308.  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Paul Dourish and Victoria Bellotti. 1992. Awareness and coordination in shared workspaces. Proceedings of the 1992 ACM conference on Computer-supported cooperative work, ACM, 107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Maiken Hillerup Fogtmann, Peter Gall Krogh, and Thomas Markussen. 2011. Spatial sharing: Designing computational artifacts as architecture. Proceedings of the International Conference on Designing Pleasurable Products and Interfaces, 1--9.",
      "doi": ""
    },
    {
      "text": "Pin Sym Foong. 2008. Designing technology for sensitive contexts: supporting end-of-life decision making. Proceedings of the 20th Australasian conference on computer-human interaction: designing for habitus and habitat, ACM, 172--179.  ",
      "doi": "10.1145/1517744.1517801"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design? Proceedings of the SIGCHI conference on human factors in computing systems, ACM, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Jens Emil Grønbæk, Henrik Korsgaard, Marianne Graves Petersen, Morten Henriksen Birk, and Peter Gall Krogh. 2017. Proxemic Transitions: Designing Shape- Changing Furniture for Informal Meetings. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, 7029--7041.  ",
      "doi": "10.1145/3025453.3025487"
    },
    {
      "text": "Edward Twitchell Hall. 1966. The hidden dimension. .",
      "doi": ""
    },
    {
      "text": "Rose Johnson, Yvonne Rogers, Janet van der Linden, and Nadia Bianchi-Berthouze. 2012. Being in the thick of in-the-wild studies: the challenges and insights of researcher participation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1135--1144.  ",
      "doi": "10.1145/2207676.2208561"
    },
    {
      "text": "Adam Kendon. 1990. Conducting interaction: Patterns of behavior in focused encounters. CUP Archive.",
      "doi": ""
    },
    {
      "text": "Ilpo Koskinen and Peter Gall Krogh. 2015. Design accountability: When design research entangles theory and practice. International Journal of Design 9, 1: 121-- 127.",
      "doi": ""
    },
    {
      "text": "Ilpo Koskinen, John Zimmerman, Thomas Binder, Johan Redstrom, and Stephan Wensveen. 2011. Design research through practice: From the lab, field, and showroom. Elsevier. ",
      "doi": "10.5555/2132674"
    },
    {
      "text": "Peter Gall Krogh, Marianne Graves Petersen, Kenton O'Hara, and Jens Emil Groenbaek. 2017. Sensitizing Concepts for Socio-spatial Literacy in HCI. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, 6449--6460.  ",
      "doi": "10.1145/3025453.3025756"
    },
    {
      "text": "Bryan Lawson. 2007. Language of space. Routledge.",
      "doi": ""
    },
    {
      "text": "Paul Luff and Christian Heath. 1998. Mobility in collaboration. Proceedings of the 1998 ACM conference on Computer supported cooperative work, ACM, 305-- 314.  ",
      "doi": "10.1145/289444.289505"
    },
    {
      "text": "Nicolai Marquardt and Saul Greenberg. 2012. Informing the design of proxemic interactions. IEEE Pervasive Computing 11, 2: 14--23.  ",
      "doi": "10.1109/MPRV.2012.15"
    },
    {
      "text": "Paul Marshall, Yvonne Rogers, and Nadia Pantidi. 2011. Using F-formations to analyse spatial patterns of interaction in physical environments. Proceedings of the ACM 2011 conference on Computer supported cooperative work, ACM, 445--454.  ",
      "doi": "10.1145/1958824.1958893"
    },
    {
      "text": "Malcolm McCullough. 2005. Digital ground: architecture, pervasive computing, and environmental knowing. The MIT Press. ",
      "doi": "10.5555/1203322"
    },
    {
      "text": "Nicola Mead and Peter Bower. 2000. Patientcentredness: a conceptual framework and review of the empirical literature. Social science & medicine 51, 7: 1087--1110.",
      "doi": ""
    },
    {
      "text": "Nienke van der Meulen, Jesse Jansen, Sandra van Dulmen, Jozien Bensing, and Julia van Weert. 2008. Interventions to improve recall of medical information in cancer patients: a systematic review of the literature. Psycho-Oncology 17, 9: 857--868.",
      "doi": ""
    },
    {
      "text": "Preben Holst Mogensen. 1992. Towards a prototyping approach in systems development. DAIMI Report Series 21, 412.",
      "doi": ""
    },
    {
      "text": "Annemarie Mol. 2008. The logic of care: Health and the problem of patient choice. Routledge.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O'Donnell, and John Vines. 2015. Situational ethics: Re-thinking approaches to formal ethics requirements for human-computer interaction. Proceedings of the 33rd Annual ACM Human Factors in Computing Systems, ACM, 105--114.  ",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "Harold G. Nelson and Erik Stolterman. 2003. The design way: Intentional change in an unpredictable world:Foundations and fundamentals of design competence. Educational Technology. ",
      "doi": "10.5555/861852"
    },
    {
      "text": "Kenton O'hara, Jesper Kjeldskov, and Jeni Paay. 2011. Blended interaction spaces for distributed team collaboration. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 1: 3.  ",
      "doi": "10.1145/1959022.1959025"
    },
    {
      "text": "Yvonne Rogers. 2011. Interaction design gone wild: striving for wild theory. Interactions 18, 4: 58--62.  ",
      "doi": "10.1145/1978822.1978834"
    },
    {
      "text": "Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in collaborative tabletop workspaces. Proceedings of the 2004 ACM conference on Computer supported cooperative work, ACM, 294-- 303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Norbert A. Streitz, Jörg Gei\\s sler, and Torsten Holmer. 1998. Roomware for cooperative buildings: Integrated design of architectural spaces and information spaces. International Workshop on Cooperative Buildings, Springer, 4--21. ",
      "doi": "10.5555/645968.674732"
    },
    {
      "text": "Anja Thieme, John Vines, Jayne Wallace, et al. 2014. Enabling empathy in health and care: Design methods and challenges. CHI'14 Extended Abstracts on Human Factors in Computing Systems, ACM, 139--142.  ",
      "doi": "10.1145/2559206.2559237"
    },
    {
      "text": "Jenny Waycott, Cosmin Munteanu, Hilary Davis, et al. 2016. Ethical encounters in human-computer interaction. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 3387--3394.  ",
      "doi": "10.1145/2851581.2856498"
    },
    {
      "text": "Daniel Wigdor, Chia Shen, Clifton Forlines, and Ravin Balakrishnan. 2006. Table-centric interactive spaces for real-time collaboration. Proceedings of the working conference on Advanced visual interfaces, ACM, 103-- 107.  ",
      "doi": "10.1145/1133265.1133286"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "2012. Empowering patients. Retrieved September 13, 2017 from http://www.euro.who.int/en/healthtopics/ noncommunicablediseases/ diabetes/news/news/2012/4/empoweringpatients.",
      "doi": ""
    },
    {
      "text": "Danske Regioner - Værdibaseret styring. Retrieved from http://www.regioner.dk/sundhed/kvalitet-ogstyring/ vaerdibaseret-styring.",
      "doi": ""
    },
    {
      "text": "Danske Regioner - Effektivisering. Retrieved September 12, 2017 from http://www.regioner.dk/sundhed/kvalitetog- styring/effektivisering.",
      "doi": ""
    }
  ]
}