{
  "doi": "10.1145/3173574.3174236",
  "title": "Live Sketch: Video-driven Dynamic Deformation of Static Drawings",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Creating sketch animations using traditional tools requires special artistic skills, and is tedious even for trained professionals. To lower the barrier for creating sketch animations, we propose a new system, emphLive Sketch,&lt;/i&gt; which allows novice users to interactively bring static drawings to life by applying deformation-based animation effects that are extracted from video examples. Dynamic deformation is first extracted as a sparse set of moving control points from videos and then transferred to a static drawing. Our system addresses a few major technical challenges, such as motion extraction from video, video-to-sketch alignment, and many-to-one motion-driven sketch animation. While each of the sub-problems could be difficult to solve fully automatically, we present reliable solutions by combining new computational algorithms with intuitive user interactions. Our pilot study shows that our system allows both users with or without animation skills to easily add dynamic deformation to static drawings.",
  "authors": [
    {
      "name": "Qingkun Su",
      "institution": "HKUST, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658628839",
      "orcid": "missing"
    },
    {
      "name": "Xue Bai",
      "institution": "Megvii Inc., Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659542258",
      "orcid": "missing"
    },
    {
      "name": "Hongbo Fu",
      "institution": "City University of Hong Kong, Hong Kong, Hong Kong",
      "img": "/do/10.1145/contrib-84458824857/rel-imgonly/hongbo_headshot_2023__small_.png",
      "acmid": "84458824857",
      "orcid": "0000-0002-0284-726X"
    },
    {
      "name": "Chiew-Lan Tai",
      "institution": "HKUST, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100311561",
      "orcid": "missing"
    },
    {
      "name": "Jue Wang",
      "institution": "Megvii Inc., Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261047",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aseem Agarwala, Aaron Hertzmann, David H. Salesin, and Steven M. Seitz. 2004. Keyframe-based Tracking for Rotoscoping and Animation. ACM Trans. Graph. 23, 3 (2004), 584--591.  ",
      "doi": "10.1145/1015706.1015764"
    },
    {
      "text": "B. Amberg and T. Vetter. 2011. GraphTrack: Fast and globally optimal tracking in videos. In CVPR 2011. 1209--1216.  ",
      "doi": "10.1109/CVPR.2011.5995341"
    },
    {
      "text": "M. Arie-Nachimson, S. Z. Kovalsky, I. Kemelmacher-Shlizerman, A. Singer, and R. Basri. 2012. Global Motion Estimation from Point Matches. In 3DIMPVT '12. 81--88.  ",
      "doi": "10.1109/3DIMPVT.2012.46"
    },
    {
      "text": "Rahul Arora, Darolia Ishan, Vany P. Namboodiri, Karan Singh, and Adrien Bousseau. 2017. SketchSoup: Exploratory Ideation using Design Sketches. Computer Graphics Forum (2017).",
      "doi": ""
    },
    {
      "text": "Nicole M. Artner, Adrian Ion, and Walter G. Kropatsch. 2011. Multi-scale 2D tracking of articulated objects using hierarchical spring systems. Pattern Recognition 44, 9 (2011), 1969 -- 1979.  ",
      "doi": "10.1016/j.patcog.2011.04.004"
    },
    {
      "text": "Connelly Barnes, David E. Jacobs, Jason Sanders, Dan B Goldman, Szymon Rusinkiewicz, Adam Finkelstein, and Maneesh Agrawala. 2008. Video Puppetry: A Performative Interface for Cutout Animation. In SIGGRAPH Asia '08. ACM, Article 124, 9 pages.  ",
      "doi": "10.1145/1457515.1409077"
    },
    {
      "text": "Serge Belongie, Jitendra Malik, and Jan Puzicha. 2000. Shape context: A new descriptor for shape matching and object recognition. In Nips, Vol. 2. ",
      "doi": "10.5555/3008751.3008867"
    },
    {
      "text": "Nir Ben-Zvi, Jose Bento, Moshe Mahler, Jessica Hodgins, and Ariel Shamir. 2015. Line-Drawing Video Stylization. In Computer Graphics Forum, Vol. 35. 18--32.  ",
      "doi": "10.1111/cgf.12729"
    },
    {
      "text": "Pierre Bénard, Forrester Cole, Michael Kass, Igor Mordatch, James Hegarty, Martin Sebastian Senn, Kurt Fleischer, Davide Pesare, and Katherine Breeden. 2013. Stylizing Animation by Example. ACM Trans. Graph. 32, 4, Article 119 (2013), 12 pages.  ",
      "doi": "10.1145/2461912.2461929"
    },
    {
      "text": "Christoph Bregler, Lorie Loeb, Erika Chuang, and Hrishi Deshpande. 2002. Turning to the Masters: Motion Capturing Cartoons. In SIGGRAPH '02. 399--407.  ",
      "doi": "10.1145/566570.566595"
    },
    {
      "text": "A. Buchanan and A. Fitzgibbon. 2006. Interactive Feature Tracking using K-D Trees and Dynamic Programming. In CVPR'06, Vol. 1. 626--633.  ",
      "doi": "10.1109/CVPR.2006.158"
    },
    {
      "text": "Z. Cai, L. Wen, Z. Lei, N. Vasconcelos, and S. Z. Li. 2014. Robust Deformable and Occluded Object Tracking With Dynamic Graph. IEEE Transactions on Image Processing 23, 12 (2014), 5497--5509.",
      "doi": ""
    },
    {
      "text": "Chen Cao, Yanlin Weng, Stephen Lin, and Kun Zhou. 2013. 3D Shape Regression for Real-time Facial Animation. ACM Trans. Graph. 32, 4, Article 41 (2013), 10 pages.  ",
      "doi": "10.1145/2461912.2462012"
    },
    {
      "text": "L. Cehovin, M. Kristan, and A. Leonardis. 2013. Robust Visual Tracking Using an Adaptive Coupled-Layer Visual Model. TPAMI 35, 4 (2013), 941--953.  ",
      "doi": "10.1109/TPAMI.2012.145"
    },
    {
      "text": "Jiawen Chen, Shahram Izadi, and Andrew Fitzgibbon. 2012. KinÊTre: Animating the World with the Human Body. In UIST '12. ACM, 435--444.  ",
      "doi": "10.1145/2380116.2380171"
    },
    {
      "text": "Theodoros Chondrogiannis, Panagiotis Bouros, Johann Gamper, and Ulf Leser. 2015. Alternative routing: k-shortest paths with limited overlap. In SIGSPATIAL GIS '15. ACM, 68.  ",
      "doi": "10.1145/2820783.2820858"
    },
    {
      "text": "James Davis, Maneesh Agrawala, Erika Chuang, Zoran Popovi´ c, and David Salesin. 2003. A Sketching Interface for Articulated Figure Animation. In SCA '03. Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 320--328. ",
      "doi": "10.5555/846276.846322"
    },
    {
      "text": "Julien Diener, Lionel Reveret, and Eugene Fiume. 2006. Hierarchical retargetting of 2D motion fields to the animation of 3D plant models. In SCA'06. ",
      "doi": "10.5555/1218064.1218089"
    },
    {
      "text": "Yotam Gingold, Etienne Vouga, Eitan Grinspun, and Haym Hirsh. 2012. Diamonds From the Rough: Improving Drawing, Painting, and Singing via Crowdsourcing. In HCOMP.",
      "doi": ""
    },
    {
      "text": "Martin Guay, Rémi Ronfard, Michael Gleicher, and Marie-Paule Cani. 2015. Space-time Sketching of Character Animation. ACM Trans. Graph. 34, 4, Article 118 (2015), 10 pages.  ",
      "doi": "10.1145/2766893"
    },
    {
      "text": "S. Hare, A. Saffari, and P. H. S. Torr. 2011. Struck: Structured output tracking with kernels. In ICCV '11. 263--270.  ",
      "doi": "10.1109/ICCV.2011.6126251"
    },
    {
      "text": "Robert Held, Ankit Gupta, Brian Curless, and Maneesh Agrawala. 2012. 3D Puppetry: A Kinect-based Interface for 3D Animation. In UIST '12. ACM, 423--434.  ",
      "doi": "10.1145/2380116.2380170"
    },
    {
      "text": "Alexander Hornung, Ellen Dekkers, and Leif Kobbelt. 2007. Character Animation from 2D Pictures and 3D Motion Data. ACM Trans. Graph. 26, 1, Article 1 (Jan. 2007).  ",
      "doi": "10.1145/1189762.1189763"
    },
    {
      "text": "Takeo Igarashi, Tomer Moscovich, and John F. Hughes. 2005. As-rigid-as-possible Shape Manipulation. In ACM Trans. Graph., Vol. 24. 1134--1141.  ",
      "doi": "10.1145/1073204.1073323"
    },
    {
      "text": "Alec Jacobson, Ilya Baran, Jovan Popovi´ c, and Olga Sorkine. 2011. Bounded Biharmonic Weights for Real-time Deformation. In SIGGRAPH '11. ACM, Article 78, 8 pages.  ",
      "doi": "10.1145/1964921.1964973"
    },
    {
      "text": "Michael Kass, Andrew Witkin, and Demetri Terzopoulos. 1988. Snakes: Active contour models. IJCV 1, 4 (1988), 321--331.",
      "doi": ""
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, Shengdong Zhao, and George Fitzmaurice. 2014. Draco: Bringing Life to Illustrations with Kinetic Textures. In CHI '14. ACM, 351--360.  ",
      "doi": "10.1145/2556288.2556987"
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Nobuyuki Umetani, and George Fitzmaurice. 2016. Motion Amplifiers: Sketching Dynamic Illustrations Using the Principles of 2D Animation. In CHI '16. ACM, 4599--4609.  ",
      "doi": "10.1145/2858036.2858386"
    },
    {
      "text": "Midori Kitagawa and Brian Windsor. 2008. MoCap for Artists: Workflow and Techniques for Motion Capture. Focal Press. ",
      "doi": "10.5555/1816971"
    },
    {
      "text": "Jan Eric Kyprianidis, John Collomosse, Tinghuai Wang, and Tobias Isenberg. 2013. State of the Art: A Taxonomy of Artistic Stylization Techniques for Images and Video. TVCG 19, 5 (2013), 866--885.  ",
      "doi": "10.1109/TVCG.2012.160"
    },
    {
      "text": "Yong Jae Lee, C. Lawrence Zitnick, and Michael F. Cohen. 2011. ShadowDraw: Real-time User Guidance for Freehand Drawing. In ACM Trans. Graph., Vol. 30. Article 27, 10 pages.  ",
      "doi": "10.1145/2010324.1964922"
    },
    {
      "text": "Guanbin Li, Sai Bi, Jue Wang, Yingqing Xu, and Yizhou Yu. 2017. ColorSketch: A Drawing Assistant for Generating Color Sketches from Photos. IEEE Computer Graphics and Applications 38, 3 (2017), 70--81.  ",
      "doi": "10.1109/MCG.2016.37"
    },
    {
      "text": "Brais Martinez and Xavier Binefa. 2008. Piecewise affine kernel tracking for non-planar targets. Pattern Recognition 41, 12 (2008), 3682 -- 3691.  ",
      "doi": "10.1016/j.patcog.2008.06.001"
    },
    {
      "text": "Min Je Park, Min Gyu Choi, Yoshihisa Shinagawa, and Sung Yong Shin. 2006. Video-guided Motion Synthesis Using Example Motions. ACM Trans. Graph. 25, 4 (2006), 1327--1359.  ",
      "doi": "10.1145/1183287.1183291"
    },
    {
      "text": "Bernhard Reinert, Tobias Ritschel, and Hans-Peter Seidel. 2016a. Animated 3D Creatures from Single-view Video by Skeletal Sketching. In GI '16. 133--141.  ",
      "doi": "10.5555/3076132.3076159"
    },
    {
      "text": "Bernhard Reinert, Tobias Ritschel, and Hans-Peter Seidel. 2016b. Animated 3D Creatures from Single-view Video by Skeletal Sketching.. In Graphics Interface. 133--141.  ",
      "doi": "10.5555/3076132.3076159"
    },
    {
      "text": "Carsten Rother, Vladimir Kolmogorov, and Andrew Blake. 2004. \"GrabCut\": Interactive Foreground Extraction Using Iterated Graph Cuts. ACM Trans. Graph. 23, 3 (Aug. 2004), 309--314.  ",
      "doi": "10.1145/1015706.1015720"
    },
    {
      "text": "Stephanie Santosa, Fanny Chevalier, Ravin Balakrishnan, and Karan Singh. 2013. Direct Space-time Trajectory Control for Visual Media Editing. In CHI '13. ACM, 1149--1158.  ",
      "doi": "10.1145/2470654.2466148"
    },
    {
      "text": "Steven M. Seitz and Charles R. Dyer. 1996. View Morphing. In SIGGRAPH '96. ACM, 21--30.  ",
      "doi": "10.1145/237170.237196"
    },
    {
      "text": "Jianbo Shi and Carlo Tomasi. 1994. Good Features to Track. In CVPR'94. 593 -- 600.",
      "doi": ""
    },
    {
      "text": "Eisung Sohn and Yoon-Chul Choy. 2012. Sketch-n-Stretch: Sketching Animations Using Cutouts. IEEE Comput. Graph. Appl. 32, 3 (2012), 59--69.  ",
      "doi": "10.1109/MCG.2010.106"
    },
    {
      "text": "Qingkun Su, Wing Ho Andy Li, Jue Wang, and Hongbo Fu. 2014. EZ-Sketching: Three-Level Optimization for Error-Tolerant Image Tracing. ACM Trans. Graph. 33, 4 (2014), 54:1--54:9.  ",
      "doi": "10.1145/2601097.2601202"
    },
    {
      "text": "J. Thies, M. Zollhöfer, M. Stamminger, C. Theobalt, and M. Nießner. 2016. Face2Face: Real-time Face Capture and Reenactment of RGB Videos. In CVPR'16.",
      "doi": ""
    },
    {
      "text": "Matthew Thorne, David Burke, and Michiel van de Panne. 2004. Motion Doodles: An Interface for Sketching Character Motion. In SIGGRAPH '04. ACM, 424--431.  ",
      "doi": "10.1145/1186562.1015740"
    },
    {
      "text": "Jue Wang, Steven M. Drucker, Maneesh Agrawala, and Michael F. Cohen. 2006. The Cartoon Animation Filter. In SIGGRAPH '06. ACM, 1169--1173.  ",
      "doi": "10.1145/1179352.1142010"
    },
    {
      "text": "Jue Wang, Yingqing Xu, Heung-Yeung Shum, and Michael F. Cohen. 2004. Video Tooning. In ACM Trans. Graph., Vol. 23. 574--583.  ",
      "doi": "10.1145/1015706.1015763"
    },
    {
      "text": "Shih-En Wei, Varun Ramakrishna, Takeo Kanade, and Yaser Sheikh. 2016. Convolutional Pose Machines. In CVPR'16.",
      "doi": ""
    },
    {
      "text": "Nora S. Willett, Wilmot Li, Jovan Popovic, and Adam Finkelstein. 2017. Triggering Artwork Swaps for Live Animation. In UIST '17. ACM, 85--95.  ",
      "doi": "10.1145/3126594.3126596"
    },
    {
      "text": "Jun Xing, Hsiang-Ting Chen, and Li-Yi Wei. 2014. Autocomplete Painting Repetitions. ACM Trans. Graph. 33, 6, Article 172 (2014), 11 pages.  ",
      "doi": "10.1145/2661229.2661247"
    },
    {
      "text": "Jun Xing, Rubaiat Habib Kazi, Tovi Grossman, Li-Yi Wei, Jos Stam, and George Fitzmaurice. 2016. Energy-Brushes: Interactive Tools for Illustrating Stylized Elemental Dynamics. In UIST '16. 755--766.  ",
      "doi": "10.1145/2984511.2984585"
    },
    {
      "text": "Jun Xing, Li-Yi Wei, Takaaki Shiratori, and Koji Yatani. 2015. Autocomplete Hand-drawn Animations. ACM Trans. Graph. 34, 6, Article 169 (2015), 11 pages.  ",
      "doi": "10.1145/2816795.2818079"
    },
    {
      "text": "Katsu Yamane, Yuka Ariki, and Jessica Hodgins. 2010. Animating non-humanoid characters with human motion data. In SCA '10. 169--178. ",
      "doi": "10.5555/1921427.1921453"
    },
    {
      "text": "Alper Yilmaz, Omar Javed, and Mubarak Shah. 2006. Object tracking: A survey. Acm computing surveys (CSUR) 38, 4 (2006), 13.  ",
      "doi": "10.1145/1177352.1177355"
    },
    {
      "text": "Tong Zhang and C. Tomasi. 1999. Fast, robust, and consistent camera motion estimation. In CVPR '99, Vol. 1. 170 Vol. 1.",
      "doi": ""
    },
    {
      "text": "Kun Zhou, Jin Huang, John Snyder, Xinguo Liu, Hujun Bao, Baining Guo, and Heung-Yeung Shum. 2005. Large Mesh Deformation Using the Volumetric Graph Laplacian. ACM Trans. Graph. 24, 3 (2005), 496--503.  ",
      "doi": "10.1145/1073204.1073219"
    }
  ]
}