{
  "doi": "10.1145/3173574.3174191",
  "title": "Navigation Systems for Motorcyclists: Exploring Wearable Tactile Feedback for Route Guidance in the Real World",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-7",
  "year": 2018,
  "badges": [],
  "abstract": "Current navigation systems for motor cyclists use visual or auditory cues for guidance. However, this poses a challenge to the motorcyclists since their visual and auditory channels are already occupied with controlling the motorbike, paying attention to other road users, and planing the next turn. In this work, we explore how tactile feedback can be used to guide motorcyclists. We present MOVING (MOtorbike VIbrational Navigation Guidance), a smart kidney belt that presents navigation cues through 12 vibration motors. In addition, we report on the design process of this wearable and on an evaluation with 16 participants in a real world riding setting. We show that MOVING outperforms off-the-shelf navigation systems in terms of turn errors and distraction.",
  "tags": [
    "motorcycle navigation",
    "real world evaluations",
    "tactile feedback"
  ],
  "authors": [
    {
      "name": "Francisco Kiss",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-99659163052/rel-imgonly/kiss_francisco02.jpg",
      "acmid": "99659163052",
      "orcid": "missing"
    },
    {
      "name": "Robin Boldt",
      "institution": "University of Stuttgart, Stuttgart, Baden-Württemberg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959072257",
      "orcid": "missing"
    },
    {
      "name": "Bastian Pfleging",
      "institution": "LMU Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460651934",
      "orcid": "missing"
    },
    {
      "name": "Stefan Schneegass",
      "institution": "University of Duisburg-Essen, Essen, Germany",
      "img": "/do/10.1145/contrib-81503680798/rel-imgonly/stefan_wide.png",
      "acmid": "81503680798",
      "orcid": "0000-0002-0132-4934"
    }
  ],
  "references": [
    {
      "text": "Amna Asif and Susanne Boll. 2010. Where to Turn My Car?: Comparison of a Tactile Display and a Conventional Car Navigation System Under High Load Condition. In Proceedings of the 2nd International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '10). ACM, New York, NY, USA, 64--71.  ",
      "doi": "10.1145/1969773.1969786"
    },
    {
      "text": "Amna Asif, Wilko Heuten, and Susanne Boll. 2010. Exploring Distance Encodings with a Tactile Display to Convey Turn by Turn Information in Automobiles. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, New York, NY, USA, 32--41.  ",
      "doi": "10.1145/1868914.1868923"
    },
    {
      "text": "Dominik Bial, Dagmar Kern, Florian Alt, and Albrecht Schmidt. 2011. Enhancing Outdoor Navigation Systems Through Vibrotactile Feedback. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 1273--1278.  ",
      "doi": "10.1145/1979742.1979760"
    },
    {
      "text": "David D. Clarke, Pat Ward, Craig Bartle, and Wendy Truman. 2004. In-depth Study of Motorcycle Accidents. Technical Report Road Safety Research Report No. 54. Department for Transportation, London, UK.",
      "doi": ""
    },
    {
      "text": "Frederik Diederichs and Benjamin Fischle. 2008. HMI Concepts & Strategies, Deliverable 5.1 of the EC FP7 Project SAFERIDER. Technical Report. Fraunhofer-Institut für Arbeitswirtschaft und Organisation IAO. http://www.saferider-eu.org/assets/docs/deliverables/ SAFERIDER_D5_1_HMI_Concepts_and_Strategies.pdf",
      "doi": ""
    },
    {
      "text": "Hisaji Fukuda, Takafumi Inoue, Yukimasa Sato, and Yumeko Hayashi. 1999. Study on Level Crossing Design and Evaluation Method based on Cognitive Model. Quarterly Report of RTRI 40, 1 (1999), 26--31.",
      "doi": ""
    },
    {
      "text": "Alberto Gallace, Sophia Zeeden, Brigitte Röder, and Charles Spence. 2010. Lost in the move? Secondary task performance impairs tactile change detection on the body. Consciousness and Cognition 19, 1 (2010), 215--229.",
      "doi": ""
    },
    {
      "text": "Francine Gemperle, Chris Kasabach, John Stivoric, Malcolm Bauer, and Richard Martin. 1998. Design for Wearability. In Digest of Papers. Second International Symposium on Wearable Computers (Cat. No.98EX215) (ISWC '98). IEEE, 116--122. ",
      "doi": "10.5555/857199.857998"
    },
    {
      "text": "Wilhelmiina Hamäläinen, Mikko Järvinen, Paula Martiskainen, and Jaakko Mononen. 2011. Jerk-based feature extraction for robust activity recognition from acceleration data. In 2011 11th International Conference on Intelligent Systems Design and Applications (ISDA '11). IEEE, 831--836.",
      "doi": ""
    },
    {
      "text": "Wilko Heuten, Niels Henze, Susanne Boll, and Martin Pielot. 2008. Tactile Wayfinder: A Non-visual Support System for Wayfinding. In Proceedings of the 5th Nordic Conference on Human-Computer Interaction: Building Bridges (NordiCHI '08). ACM, New York, NY, USA, 172--181.  ",
      "doi": "10.1145/1463160.1463179"
    },
    {
      "text": "Joe Marshall, Alexandru Dancu, and Florian \"Floyd\" Mueller. 2016. Interaction in Motion: Designing Truly Mobile Interaction. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 215--228.  ",
      "doi": "10.1145/2901790.2901844"
    },
    {
      "text": "Joe Marshall and Paul Tennent. 2013. Mobile Interaction Does Not Exist. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 2069--2078.  ",
      "doi": "10.1145/2468356.2468725"
    },
    {
      "text": "Martin Pielot and Susanne Boll. 2010. Tactile Wayfinder: Comparison of Tactile Waypoint Navigation with Commercial Pedestrian Navigation Systems. Springer Berlin Heidelberg, Berlin, Heidelberg, 76--93.",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2012. Tacticycle: Supporting Exploratory Bicycle Trips. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 369--378.  ",
      "doi": "10.1145/2371574.2371631"
    },
    {
      "text": "Manoj Prasad, Paul Taele, Daniel Goldberg, and Tracy A. Hammond. 2014. HaptiMoto: Turn-By-Turn Haptic Route Guidace Interface for Motorcyclists. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3597--3606.  ",
      "doi": "10.1145/2556288.2557404"
    },
    {
      "text": "Stefan Schneegass, Bastian Pfleging, Nora Broy, Frederik Heinrich, and Albrecht Schmidt. 2013. A Data Set of Real World Driving to Assess Driver Workload. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '13). ACM, New York, NY, USA, 150--157.  ",
      "doi": "10.1145/2516540.2516561"
    },
    {
      "text": "Haska Steltenpohl and Anders Bouwer. 2013. Vibrobelt: Tactile Navigation Support for Cyclists. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2449396.2449450"
    },
    {
      "text": "Koji Tsukada and Michiaki Yasumura. 2004. ActiveBelt: Belt-Type Wearable Tactile Display for Directional Navigation. In Ubiquitous Computing: 6th International Conference (UbiComp '04), Nigel Davies, Elizabeth D. Mynatt, and Itiro Siio (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 384--399.",
      "doi": ""
    },
    {
      "text": "Jan B. F. van Erp and Hendrik A.H.C. van Veen. 2004. Vibrotactile In-Vehicle Navigation System. Transportation Research Part F: Traffic Psychology and Behaviour 7, 4 (2004), 247--256.",
      "doi": ""
    }
  ]
}