{
  "doi": "10.1145/3173574.3173650",
  "title": "How Teens with Visual Impairments Take, Edit, and Share Photos on Social Media",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "We contribute a qualitative investigation of how teens with visual impairments (VIP) access smartphone photography, from the time they take photos through editing and sharing them on social media. We observed that they largely want to engage with photos visually, similarly to their sighted peers, and have developed strategies around photo capture, editing, sharing, and consumption that attempt to mitigate usability limitations of current photography and social media apps. We demonstrate the need for more work examining how young people with low vision engage with smartphone photography and social media, as they are heavy users of such technologies and have challenges distinct from their totally blind counterparts. We conclude with design considerations to alleviate the usability barriers we uncovered and for making smartphone photography and social media more accessible and relevant for VIPs.",
  "authors": [
    {
      "name": "Cynthia L. Bennett",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358692957",
      "orcid": "0000-0003-1036-2497"
    },
    {
      "name": "Jane E",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-99658729422/rel-imgonly/janee_0148.jpg",
      "acmid": "99658729422",
      "orcid": "missing"
    },
    {
      "name": "Martez E. Mott",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81472645021/rel-imgonly/mott_headshot_2019.jpg",
      "acmid": "81472645021",
      "orcid": "0000-0003-4711-7268"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    }
  ],
  "references": [
    {
      "text": "Dustin Adams, Lourdes Morales, and Sri Kurniawan. 2013. A qualitative study to support a blind photography mobile application. In Proceedings of the 6th International Conference on Pervasive Technologies Related to Assistive Environments (PETRA '13). ACM, New York, NY, USA Article 25, 8 pages.  ",
      "doi": "10.1145/2504335.2504360"
    },
    {
      "text": "Dustin Adams, Sri Kurniawan, Cynthia Herrera, Veronica Kang, and Natalie Friedman. 2016. Blind Photographers and VizSnap: A Long-Term Study. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 201--208.  ",
      "doi": "10.1145/2982142.2982169"
    },
    {
      "text": "Saeideh Bakhshi, David A. Shamma, Lyndon Kennedy, and Eric Gilbert. 2015. Why We Filter Our Photos and How It Impacts Engagement. In ICWSM, 12--21.",
      "doi": ""
    },
    {
      "text": "Jan Balata, Zdenek Mikovec, and Lukas Neoproud. 2015. BlindCamera: Central and Golden-ratio Composition for Blind Photographers. In Proceedings of the Mulitimedia, Interaction, Design and Innnovation (MIDI '15). ACM, New York, NY, USA, Article 8, 8 pages.  ",
      "doi": "10.1145/2814464.2814472"
    },
    {
      "text": "Joseph B. Bayer, Nicole B. Ellison, Sarita Y. Schoenebeck, and Emily B. Falk. 2015. \"Sharing the small moments: ephemeral social interaction on Snapchat.\" Information, Communication & Society: 122.",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, New York, NY, USA, 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Andrew Miller, Brandyn White, and Tom Yeh. 2010. VizWiz:: LocateIt-enabling blind people to locate objects in their environment. In 2010 IEEE Computer Society Conference on Computer Vision and Pattern Recognition-Workshops, pp. 65--72.",
      "doi": ""
    },
    {
      "text": "danah boyd. 2014. It's complicated: The social lives of networked teens. Yale University Press. ",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Erin L. Brady. 2015. Getting fast, free, and anonymous answers to questions asked by people with visual impairments. SIGACCESS Access. Comput. 112 (July 2015), 16--25.  ",
      "doi": "10.1145/2809915.2809918"
    },
    {
      "text": "Erin L. Brady, Yu Zhong, Meredith Ringel Morris, and Jeffrey P. Bigham. 2013. Investigating the appropriateness of social network question asking as a resource for blind users. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 1225--1236.  ",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "Michele A. Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P. Bigham, and Amy Hurst. 2012. Crowdsourcing subjective fashion advice using VizWiz: challenges and opportunities. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '12). ACM, New York, NY, USA, 135--142.  ",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Luiz Henrique C.B. Cavalcanti, Alita Pinto, Jed R. Brubaker, and Lynn S. Dombrowski. 2017. Media, Meaning, and Context Loss in Ephemeral Communication Platforms: A Qualitative Investigation on Snapchat. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1934--1945.  ",
      "doi": "10.1145/2998181.2998266"
    },
    {
      "text": "Kathy Charmaz. Constructing grounded theory. Sage, 2014.",
      "doi": ""
    },
    {
      "text": "Emilio Ferrara, Roberto Interdonato, and Andrea Tagarelli. 2014. Online popularity and topical interests through the lens of instagram. In Proceedings of the 25th ACM conference on Hypertext and social media (HT '14). ACM, New York, NY, USA, 24--34.  ",
      "doi": "10.1145/2631775.2631808"
    },
    {
      "text": "Susumu Harada, Daisuke Sato, Dustin W. Adams, Sri Kurniawan, Hironobu Takagi, and Chieko Asakawa. 2013. Accessible photo album: enhancing the photo sharing experience for people with visual impairment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2127--2136.  ",
      "doi": "10.1145/2470654.2481292"
    },
    {
      "text": "Kjersten L. Hild. 2014. Outreach and Engagement through Instagram: Experiences with the Herman B Wells Library Account. Indiana Libraries 33, 2 30--32.",
      "doi": ""
    },
    {
      "text": "Yuheng Hu, Lydia Manikonda, and Subbarao Kambhampati. 2014. What We Instagram: A First Analysis of Instagram Photo Content and User Types. In Eighth International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Instagram. About. https://www.instagram.com/about/us/ Retrieved 9/12/17.",
      "doi": ""
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P. Bigham. 2011. Supporting blind photography. In Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '11). ACM, New York, NY, USA, 203--210.  ",
      "doi": "10.1145/2049536.2049573"
    },
    {
      "text": "Hernisa Kacorri, Kris M. Kitani, Jeffrey P. Bigham, and Chieko Asakawa. 2017. People with Visual Impairment Training Personal Object Recognizers: Feasibility and Challenges. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 58395849.  ",
      "doi": "10.1145/3025453.3025899"
    },
    {
      "text": "Jordan Kahn. 2017. New for Accessibility: 'Smart Invert Colors' in iOS 11, macOS Onscreen Keyboard, Text and Photo Detection for Voiceover and More. https://9to5mac.com/2017/06/08/wwdc-accessibilityios-11-macos-high-sierra-keyboard-smart-invert/ Retrieved 9/12/16.",
      "doi": ""
    },
    {
      "text": "Anand Khanse. 2015. Download Lumia Selfie App for Windows Phone, to Capture Your \"Selfie\" Moments. http://www.thewindowsclub.com/lumia-selfie-appwindows-phone Retrieved 9/13/17.",
      "doi": ""
    },
    {
      "text": "Tim Kindberg, Mirjana Spasojevic, Rowanne Fleck, and Abigail Sellen. 2005. The ubiquitous camera: An in-depth study of camera phone use. IEEE Pervasive Computing 4, 2 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Walter S. Lasecki, Phyo Thiha, Yu Zhong, Erin Brady, and Jeffrey P. Bigham. 2013. Answering visual questions with conversational crowd assistants. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA,, Article 18, 8 pages.  ",
      "doi": "10.1145/2513383.2517033"
    },
    {
      "text": "Amanda Lenhart, Maeve Duggan, Andrew Perrin, Renee Stepler, Harrison Rainie, and Kim Parker. Teens, social media & technology overview 2015. Pew Research Center {Internet & American Life Project}, 2015.",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Cynthia L. Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding Blind People's Experiences with Computer-Generated Captions of Social Media Images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5988--5999.  ",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Lydia Manikonda, Venkata Vamsikrishna Meduri, and Subbarao Kambhampati. 2016. Tweeting the Mind and Instagramming the Heart: Exploring Differentiated Content Sharing on Social Media. In Tenth International AAAI Conference on Web and Social Media, 639--642.",
      "doi": ""
    },
    {
      "text": "Bret Molina. Your Snaps Can Now Last To 'Infinity' with Snapchat's Latest Update. https://www.usatoday.com/story/tech/talkingtech/2017/ 05/09/your-snaps-wont-disappear-quickly-snapchatupdate/101473094/ Retrieved 9/12/17.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. \"With most of it being pictures now, I rarely use it\": Understanding Twitter's Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 55065516.  ",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Sandy Murillo. 2016. How do Blind People Take Pictures of Things? https://sandysview1.wordpress.com/2016/01/14/howdo-blind-people-take-pictures-of-things/ Retrieved 9/16/16.",
      "doi": ""
    },
    {
      "text": "Lukasz Piwek and Adam Joinson. 2016. \"What do they snapchat about?\" Patterns of use in time\"-limited instant messaging service.\" Computers in Human Behavior 54: 358--367.  ",
      "doi": "10.1016/j.chb.2015.08.026"
    },
    {
      "text": "Franziska Roesner, Brian T. Gill and Tadayoshi Kohno. 2014. Sex, lies, or kittens? Investigating the use of Snapchat's self-destructing messages. In Financial Cryptography and Data Security: 64--76. Springer Berlin Heidelberg.",
      "doi": ""
    },
    {
      "text": "Danielle Salomon. \"Moving on from Facebook: Using Instagram to connect with undergraduates and engage in teaching and learning.\" College & Research Libraries News 74, no. 8 (2013): 408--412.",
      "doi": ""
    },
    {
      "text": "Sight Unseen: International Photography by Blind Artists. 2009. University of California, Riverside",
      "doi": ""
    },
    {
      "text": "Snapchat. Create and Send Snaps. https://support.snapchat.com/en-US/a/create Retrieved 9/8/2017.",
      "doi": ""
    },
    {
      "text": "Nick Statt. 2016. Twitter Brings Night Mode to it's iOS App. https://www.theverge.com/2016/8/22/12586178/twitter -night-mode-feature-ios-app-update Retrieved 9/15/2017.",
      "doi": ""
    },
    {
      "text": "Nick Statt. 2017. Apple shows off breathtaking new augmented reality demos on iPhone 8. https://www.theverge.com/2017/9/12/16272904/applearkit-demo-iphone-augmented-reality-iphone-8 Retrieved 9/12/17.",
      "doi": ""
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How People with Low Vision Access Computing Devices: Understanding Challenges and Opportunities. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, New York, NY, USA, 171--180.  ",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Sarit Szpiro, Yuhang Zhao, and Shiri Azenkot. 2016. Finding a store, searching for a product: a study of daily challenges of Low Vision people. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 61--72.  ",
      "doi": "10.1145/2971648.2971723"
    },
    {
      "text": "Twitter. 2016. Making Images Accessible for People on Twitter. https://support.twitter.com/articles/20174660# Retrieved 9/6/2017.",
      "doi": ""
    },
    {
      "text": "Nancy A. Van House. 2009. Collocated photo sharing, story-telling, and the performance of self. International Journal of Human-Computer Studies 67, 12 10731086.  ",
      "doi": "10.1016/j.ijhcs.2009.09.003"
    },
    {
      "text": "Nancy A. Van House. 2011. Personal photography, digital technologies and the uses of the visual. Visual Studies 26, 2 125--134.",
      "doi": ""
    },
    {
      "text": "Marynel Vázquez and Aaron Steinfeld. 2012. Helping visually impaired users properly aim a camera. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '12). ACM, New York, NY, USA, 95--102.  ",
      "doi": "10.1145/2384916.2384934"
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How Blind People Interact with Visual Content on Social Networking Services. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1584--1595.  ",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "Shaomei Wu and Lada Adamic, Visually Impaired Users on an Online Social Network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3133--3142.  ",
      "doi": "10.1145/2556288.2557415"
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Julie Schiller. 2017. Automatic Alt-text: Computergenerated Image Descriptions for Blind Users on a Social Network Service. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1180--1192.  ",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Bin Xu, Pamara Chang, Christopher L. Welker, Natalya N. Bazarova, and Dan Cosley. 2016. Automatic Archiving versus Default Deletion: What Snapchat Tells Us About Ephemerality in Design. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1662--1675.  ",
      "doi": "10.1145/2818048.2819948"
    },
    {
      "text": "Yuhang Zhao, Michele Hu, Shafeka Hashash, and Shiri Azenkot. 2017. Understanding Low Vision People's Visual Perception on Commercial Augmented Reality Glasses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4170--4181.  ",
      "doi": "10.1145/3025453.3025949"
    },
    {
      "text": "Yu Zhong, Walter S. Lasecki, Erin Brady, and Jeffrey P. Bigham. 2015. RegionSpeak: Quick Comprehensive Spatial Descriptions of Complex Images for Blind Users. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2353--2362.  ",
      "doi": "10.1145/2702123.2702437"
    }
  ]
}