{
  "doi": "10.1145/3173574.3174149",
  "title": "Using Co-Design to Examine How Children Conceptualize Intelligent Interfaces",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2018,
  "badges": [],
  "abstract": "Prior work has shown that intelligent user interfaces (IUIs) that use modalities such as speech, gesture, and writing pose challenges for children due to their developing cognitive and motor skills. Research has focused on improving recognition and accuracy by accommodating children's specific interaction behaviors. Understanding children's expectations of IUIs is also important to decrease the impact of recognition errors that occur. To understand children's conceptual model of IUIs, we completed four consecutive participatory design sessions on designing IUIs with an emphasis on error detection and correction. We found that, while children think of interactive systems in terms of both user input and behavior and system output and behavior, they also propose ideas that require advanced system intelligence, e.g., context and conversation. Our work contributes new understanding of how children conceptualize IUIs and new methods for error detection and correction, and will inform the design of future IUIs for children to improve their experience.",
  "tags": [
    "error correction",
    "co-design",
    "children",
    "intelligent user interfaces",
    "participatory design",
    "design methods",
    "conceptual model"
  ],
  "authors": [
    {
      "name": "Julia Woodward",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021759",
      "orcid": "missing"
    },
    {
      "name": "Zari McFadden",
      "institution": "Spelman College, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260682",
      "orcid": "missing"
    },
    {
      "name": "Nicole Shiver",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260752",
      "orcid": "missing"
    },
    {
      "name": "Amir Ben-hayon",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260518",
      "orcid": "missing"
    },
    {
      "name": "Jason C. Yip",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757149",
      "orcid": "0000-0001-9980-0670"
    },
    {
      "name": "Lisa Anthony",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/do/10.1145/contrib-81100196272/rel-imgonly/lisa-anthony-headshot-2018.jpg",
      "acmid": "81100196272",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lisa Anthony, Quincy Brown, Jaye Nias, and Berthel Tate. 2013. Examining the need for visual feedback during gesture interaction on mobile touchscreen devices for kids. In Proceedings of the International Conference on Interaction Design and Children (IDC '2013), 157--164.  ",
      "doi": "10.1145/2485760.2485775"
    },
    {
      "text": "Lisa Anthony, Quincy Brown, Jaye Nias, Berthel Tate, and Shreya Mohan. 2012. Interaction and recognition challenges in interpreting children's touch and gesture input on mobile devices. In Proceedings of the ACM Interational Conference on Interactive Tabletops and Surfaces (ITS '2012), 225--234.  ",
      "doi": "10.1145/2396636.2396671"
    },
    {
      "text": "Lisa Anthony, Quincy Brown, Berthel Tate, Jaye Nias, Robin Brewer, and Germaine Irwin. 2014. Designing smarter touch-based interfaces for educational contexts. Personal and Ubiquitous Computing 18, 6: 1471--1483.  ",
      "doi": "10.1007/s00779-013-0749-9"
    },
    {
      "text": "Lisa Anthony, Jie Yang, and Kenneth R. Koedinger. 2012. A paradigm for handwriting-based intelligent tutors. International Journal of Human-Computer Studies 70, 11: 866--887.  ",
      "doi": "10.1016/j.ijhcs.2012.04.003"
    },
    {
      "text": "Ahmed Sabbir Arif and Cristina Sylla. 2013. A comparative evaluation of touch and pen gestures for adult and child users. In Proceedings of the International Conference on Interaction Design and Children (IDC '2013), 392--395.  ",
      "doi": "10.1145/2485760.2485804"
    },
    {
      "text": "Titus Barik, Jim Witschey, Brittany Johnson, and Emerson Murphy-Hill. 2014. Compiler error notifications revisited: an interaction-first approach for helping developers more effectively comprehend and resolve error notifications. In Proceedings of the International Conference on Software Engineering (ICSE'2014), 536--539.  ",
      "doi": "10.1145/2591062.2591124"
    },
    {
      "text": "Mathilde Bekker, Julie Beusmans, David Keyson, and Peter Lloyd. 2003. KidReporter: a user requirements gathering technique for designing with children. Interacting with Computers 15, 2: 187--202.",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1999. Contextual design. Interactions 6, 32--42.  ",
      "doi": "10.1145/291224.291229"
    },
    {
      "text": "Kaitlin L. Brunick, Marisa M. Putnam, Lauren E. McGarry, Melissa N. Richards, and Sandra L. Calvert. 2016. Children's future parasocial relationships with media characters: the age of intelligent characters. Journal of Children and Media 10, 2: 181--190.",
      "doi": ""
    },
    {
      "text": "Cynthia Chiong and Carly Shuler. Learning: Is there an app for that? Investigations of young children's usage and learning with mobile devices and apps. The Joan Ganz Cooney Center at Sesame Workshop, New York, NY. Retrieved September 12, 2017 from http://dmlcentral.net/resources/4496",
      "doi": ""
    },
    {
      "text": "Christian Dindler, Eva Eriksson, Ole Sejer Iversen, Andreas Lykke-Olesen, and Martin Ludvigsen. 2005. Mission from Mars: a method for exploring user requirements for children in a narrative space. In Proceedings of the International Conference on Interaction Design and Children (IDC '2005), 40--47.  ",
      "doi": "10.1145/1109540.1109546"
    },
    {
      "text": "Allison Druin. 1999. Cooperative inquiry: developing new technologies for children with children. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'1999), 592--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Allison Druin. 2002. The role of children in the design of new technology. Behaviour&Information Technology 21, 1: 1--25.",
      "doi": ""
    },
    {
      "text": "Allison Druin, Ben Bederson, Angela Boltman, Adrian Miura, Debby Knotts-Callahan, and Mark Platt. 1999. Children as our technology design partners. In The Design of Children's Technology. Morgan Kaufmann Publishers, 51--72. ",
      "doi": "10.5555/303430.303435"
    },
    {
      "text": "Allison Druin, Benjamin B. Bederson, Juan Pablo Hourcade, Lisa Sherman, Glenda Revelle, Michele Platner, and Stacy Weng. 2001. Designing a digital library for young children. In Proceedings of the Joint Conference on Digital Libraries (JCDL '2001), 398-- 405.  ",
      "doi": "10.1145/379437.379735"
    },
    {
      "text": "Allison Druin, Elizabeth Foss, Hilary Hutchinson, Evan Golub, and Leshell Hatley. 2010. Children's roles using keyword search interfaces at home. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2010), 413--422.  ",
      "doi": "10.1145/1753326.1753388"
    },
    {
      "text": "Mark D. Dunlop, Andrew Glen, Sunil Motaparti, and Sanjay Patel. 2006. AdapTex: contextually adaptive text entry for mobiles. In Proceedings of the International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI'2006), 265.  ",
      "doi": "10.1145/1152215.1152277"
    },
    {
      "text": "Elizabeth Foss, Allison Druin, Robin Brewer, Phillip Lo, Luis Sanchez, Evan Golub, and Hilary Hutchinson. 2012. Children's search roles at home: Implications for designers, researchers, educators, and parents. Journal of the American Society for Information Science&Technology 63, 3: 558--573.  ",
      "doi": "10.1002/asi.21700"
    },
    {
      "text": "Elizabeth Foss, Allison Druin, Jason Yip, Whitney Ford, Evan Golub, and Hilary Hutchinson. 2013. Adolescent search roles. Journal of the American Society for Information Science&Technology 64, 1: 173--189.  ",
      "doi": "10.1002/asi.22809"
    },
    {
      "text": "Sören Frappart, Maartje Raijmakers, and Valérie Frède. 2014. What do children know and understand about universal gravitation? Structural and developmental aspects. Journal of Experimental Child Psychology 120: 17--38.",
      "doi": ""
    },
    {
      "text": "James H. Gray, Emily Reardon, and Jennifer A. Kotler. 2017. Designing for Parasocial Relationships and Learning. In Proceedings of the International Conference on Interaction Design and Children (IDC '2017), 227--237.  ",
      "doi": "10.1145/3078072.3079736"
    },
    {
      "text": "Mona Leigh Guha, Allison Druin, Gene Chipman, Jerry Alan Fails, Sante Simms, and Allison Farber. 2004. Mixing ideas: a new technique for working with young children as design partners. In Proceedings of the International Conference on Interaction Design and Children (IDC '2004), 35--42.  ",
      "doi": "10.1145/1017833.1017838"
    },
    {
      "text": "Mona Leigh Guha, Allison Druin, Gene Chipman, Jerry Alan Fails, Sante Simms, and Allison Farber. 2005. Working with young children as technology design partners. Communications of the ACM 48, 39-- 42.  ",
      "doi": "10.1145/1039539.1039567"
    },
    {
      "text": "Timothy J. Hazen, Stephanie Seneff, and Joseph Polifroni. 2002. Recognition confidence scoring and its use in speech understanding systems. Computer Speech&Language 16, 1: 49--67.  ",
      "doi": "10.1006/csla.2001.0183"
    },
    {
      "text": "Juan Pablo Hourcade, Benjamin B. Bederson, and Allison Druin. 2004. Preschool children's use of mouse buttons. In Extended Abstracts of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2004), 1411--1412.  ",
      "doi": "10.1145/985921.986077"
    },
    {
      "text": "Juan Pablo Hourcade, Keith B. Perry, and Aditya Sharma. 2008. PointAssist: helping four year olds point with ease. In Proceedings of the International Conference on Interaction Design and Children (IDC '2008), 202--209.  ",
      "doi": "10.1145/1463689.1463757"
    },
    {
      "text": "Tina Jarvis and Léonie J. Rennie. 1998. Factors that Influence Children's Developing Perceptions of Technology. International Journal of Technology and Design Education 8, 3: 261--279.",
      "doi": ""
    },
    {
      "text": "Jeff Johnson and Austin Henderson. 2002. Conceptual models: begin by designing what to design. Interactions 9, 25--32.  ",
      "doi": "10.1145/503355.503366"
    },
    {
      "text": "Hilda K. Kabali, Matilde M. Irigoyen, Rosemary Nunez-Davis, Jennifer G. Budacki, Sweta H. Mohanty, Kristin P. Leister, and Robert L. Bonner Jr. 2015. Exposure and Use of Mobile Media Devices by Young Children. Pediatrics 136, 6: 1044--1050.",
      "doi": ""
    },
    {
      "text": "Cecilia Kang. 2013. Survey: For young children, mobile devices such as tablets, smartphones now a mainstay. The Washington Post, Washington DC. Retrieved September 12, 2017 from https://www.washingtonpost.com/business/technology/ survey-for-young-children-mobile-devices-such-astablets-smartphones-now-amainstay/2013/10/27/7e386f3c-3f1f-11e3-a62441d661b0bb78_story.html?",
      "doi": ""
    },
    {
      "text": "Finn Kensing and Jeanette Blomberg. 1998. Participatory Design: Issues and Concerns. Computer Supported Cooperative Work (CSCW) 7, 3--4: 167-- 185.  ",
      "doi": "10.1023/A%3A1008689307411"
    },
    {
      "text": "Andreas Komninos, Emma Nicol, and Mark D. Dunlop. 2015. Designed with Older Adults to Support Better Error Correction in SmartPhone Text Entry: The MaxieKeyboard. In Proceedings of the International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI'2015), 797--802.  ",
      "doi": "10.1145/2786567.2793703"
    },
    {
      "text": "Mary LaLomia. 1994. User acceptance of handwritten recognition accuracy. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'1994), 107--108.  ",
      "doi": "10.1145/259963.260086"
    },
    {
      "text": "Mona Leigh Guha, Allison Druin, and Jerry Alan Fails. 2013. Cooperative Inquiry Revisited: Reflections of the past and guidelines for the future of intergenerational co-design. International Journal of Child-Computer Interaction 1, 1: 14--23.",
      "doi": "10.1016/J.IJCCI.2012.08.003"
    },
    {
      "text": "Sonia Livingstone and Dafna Lemish. 2001. Doing comparative research with children and young people. In Children and Their Changing Media Environment: A European Comparative Study, S. Livingstone and M. Bovill (eds.). Lawrence Erlbaum Associates, 31--50.",
      "doi": ""
    },
    {
      "text": "Silvia Lovato and Anne Marie Piper. 2015. \"Siri, is this you?\": Understanding young children's interactions with voice input systems. In Proceedings of the International Conference on Interaction Design and Children (IDC '2015), 335--338.  ",
      "doi": "10.1145/2771839.2771910"
    },
    {
      "text": "Lorna McKnight and Brendan Cassidy. 2010. Children's Interaction with Mobile Touch-Screen Devices. International Journal of Mobile Human Computer Interaction 2, 2: 1--18.  ",
      "doi": "10.4018/jmhci.2010040101"
    },
    {
      "text": "Lorna McKnight and Daniel Fitton. 2010. Touchscreen technology for children. In Proceedings of the International Conference on Interaction Design and Children (IDC '2010), 238--241.  ",
      "doi": "10.1145/1810543.1810580"
    },
    {
      "text": "Donald A. Norman. 2002. The Design of Everyday Things. Basic Books. ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Cathleen Norris and Elliot Soloway. 2004. Envisioning the Handheld-Centric Classroom. Journal of Educational Computing Research 30, 4: 281--294.",
      "doi": ""
    },
    {
      "text": "Maureen O'Sullivan. 2005. Emotional intelligence and deception detection: Why most people can't \"read\" others, but a few can. In Applications of Nonverbal Communication, Ronald E. Riggio and Robert S. Feldman (eds.). Lawrence Erlbaum Associates, 215--253.",
      "doi": ""
    },
    {
      "text": "Jean Piaget. 1983. Piaget's Theory. In Handbook of Child Psychology, P. Mussen (ed.). Wiley&Sons, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Janet C. Read. 2009. Warp speed design: a rapid design method for use with children. In Extended Abstracts of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2009), 4681--4686.  ",
      "doi": "10.1145/1520340.1520720"
    },
    {
      "text": "Janet C. Read, Stuart MacFarlane, and Chris Casey. 2003. \"Good enough for what?\": acceptance of handwriting recognition errors by child users. In Proceedings of the International Conference on Interaction Design and Children (IDC '2003), 155-- 155.  ",
      "doi": "10.1145/953536.953565"
    },
    {
      "text": "Janet Read, Stuart MacFarlane, and Chris Casey. 2001. Measuring the Usability of Text Input Methods for Children. In People and Computers XV-Interaction without Frontiers. Springer London, London, 559--572.",
      "doi": ""
    },
    {
      "text": "Glenda Revelle and Emily Reardon. 2009. Designing and testing mobile interfaces for children. In Proceedings of the International Conference on Interaction Design and Children (IDC '2009), 329--332.  ",
      "doi": "10.1145/1551788.1551876"
    },
    {
      "text": "Mary B. Rosson and John B. Carroll. 2003. Scenariobased design. In The Human-Computer Interaction Handbook. Lawrence Erlbaum Associates, 1032--1050. ",
      "doi": "10.5555/772072.772137"
    },
    {
      "text": "Mike Sharples, Inmaculada Amedillo Sanchez, Marcelo Milrad, and Giasemi Vavoula. 2009. Mobile learning: small devices, big issues. In Technology Enhanced Learning: Principles and Products, N. Balacheff, S. Ludvigsen, T. de Jong and S. Barnes (eds.). Springer, Heidelberg, 233--249.",
      "doi": ""
    },
    {
      "text": "Alex Shaw and Lisa Anthony. 2016. Analyzing the articulation features of children's touchscreen gestures. In Proceedings of the International Conference on Multimodal Interaction (ICMI '2016), 333--340.  ",
      "doi": "10.1145/2993148.2993179"
    },
    {
      "text": "Joseph W. Sullivan and William Mark. 1991. Intelligent User Interfaces. ACM Press. ",
      "doi": ""
    },
    {
      "text": "Jerry R. Thomas. 1980. Acquisition of Motor Skills: Information Processing Differences between Children and Adults. Research Quarterly for Exercise and Sport 51, 1: 158--173.",
      "doi": ""
    },
    {
      "text": "Elba del Carmen Valderrama Bahamóndez, Thomas Kubitza, Niels Henze, and Albrecht Schmidt. 2013. Analysis of children's handwriting on touchscreen phones. In Proceedings of the International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI'2013), 171--174.  ",
      "doi": "10.1145/2493190.2493222"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Quincy Brown. 2015. Child or Adult? Inferring Smartphone Users' Age Group from Touch Measurements Alone. In Human-Computer Interaction - INTERACT 2015. Springer International Publishing, 9 pages.",
      "doi": "10.1007/978-3-319-22723-8_1"
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2008. On the benefits of confidence visualization in speech recognition. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2008), 1497--1500.  ",
      "doi": "10.1145/1357054.1357288"
    },
    {
      "text": "Stella Vosniadou and William F Brewer. 1992. Mental models of the earth: A study of conceptual change in childhood. Cognitive Psychology 24, 4: 535--585.",
      "doi": ""
    },
    {
      "text": "Greg Walsh. 2011. Distributed participatory design. In Extended Abstracts of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2011), 1061--1064.  ",
      "doi": "10.1145/1979742.1979696"
    },
    {
      "text": "Greg Walsh, Alison Druin, Mona Leigh Guha, Elizabeth Foss, Evan Golub, Leshell Hatley, Elizabeth Bonsignore, and Sonia Franckel. 2010. Layered elaboration: a new technique for co-design with children. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2010), 1237--1240.  ",
      "doi": "10.1145/1753326.1753512"
    },
    {
      "text": "Greg Walsh, Elizabeth Foss, Jason Yip, and Allison Druin. 2013. FACIT PD: A Framework for Analysis and Creation of Intergenerational Techniques for Participatory Design. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2013), 2893--2902.  ",
      "doi": "10.1145/2470654.2481400"
    },
    {
      "text": "Jieyu Wang and Anita Komlodi. 2012. Children's formal and informal definition of technology. In Proceedings of the iConference (iConference'2012), 587--588.  ",
      "doi": "10.1145/2132176.2132299"
    },
    {
      "text": "Julia Woodward, Lisa Anthony, Germaine Irwin, Alex Shaw, Annie Luc, Brittany Craig, Juthika Das, Phillip Hall, Akshay Holla, Danielle Sikich, and Quincy Brown. 2016. Characterizing How Interface Complexity Affects Children's Touchscreen Interactions. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2016), 1921--1933.  ",
      "doi": "10.1145/2858036.2858200"
    },
    {
      "text": "Robert K. Yin. 2013. Validity and generalization in future case study evaluations. Evaluation 19, 3: 321--332.",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Caroline Pitt, Kung Jin Lee, Sijin Chen, Kari Nasu, and Laura R. Pina. 2017. Examining Adult-Child Interactions in Intergenerational Participatory Design. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'2017), 5742--5754.  ",
      "doi": "10.1145/3025453.3025787"
    },
    {
      "text": "Wenxuan Zhou, Jason Croft, Bingzhe Liu, and Matthew Caesar. 2017. NEAt: Network Error AutoCorrect. In Proceedings of the ACM Symposium on SDN Research (SOSR '2017), 157--163.  ",
      "doi": "10.1145/3050220.3050238"
    },
    {
      "text": "Cortana | Your Intelligent Virtual&Personal Assistant. Microsoft. Retrieved September 15, 2017 from https://www.microsoft.com/en-us/windows/cortana",
      "doi": ""
    },
    {
      "text": "Echo&Alexa - Amazon Devices - Amazon Official Site. Amazon. Retrieved September 15, 2017 from https://www.amazon.com/Amazon-Echo-And-AlexaDevices/b?ie=UTF8&node=9818047011",
      "doi": ""
    },
    {
      "text": "iOS - Siri - Apple. Apple. Retrieved September 15, 2017 from https://www.apple.com/ios/siri/",
      "doi": ""
    },
    {
      "text": "OK Google. Google. Retrieved September 15, 2017 from http://ok-google.io/",
      "doi": ""
    },
    {
      "text": "RealtimeBoard | Virtual Whiteboard&Remote Collaboration tool. Retrieved September 11, 2017 from https://realtimeboard.com/",
      "doi": ""
    },
    {
      "text": "Monster Messenger. Retrieved September 18, 2017 from https://monster-messenger.com/",
      "doi": ""
    },
    {
      "text": "ChatterPix Kids - by Duck Duck Moose. Apple App Store. Retrieved September 15, 2017 from https://itunes.apple.com/us/app/chatterpix-kids-byduck-duck-moose/id734046126?mt=8",
      "doi": ""
    },
    {
      "text": "2010. FAQ 15: What are the best ways to interview children? LSE Media and Communications. Retrieved September 12, 2017 from http://www.lse.ac.uk/media@lse/research/EUKidsOnli ne/BestPracticeGuide/FAQ/FAQ-15.pdf",
      "doi": ""
    },
    {
      "text": "2017. The Common Sense Census: Media Use by Kids Age Zero to Eight 2017. Common Sense Media. Retrieved December 10, 2017 from https://www.commonsensemedia.org/research/thecommon-sense-census-media-use-by-kids-age-zero-toeight-2017",
      "doi": ""
    }
  ]
}