{
  "doi": "10.1145/3173574.3173643",
  "title": "Blocks4All: Overcoming Accessibility Barriers to Blocks Programming for Children with Visual Impairments",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2018,
  "badges": [],
  "abstract": "Blocks-based programming environments are a popular tool to teach children to program, but they rely heavily on visual metaphors and are therefore not fully accessible for children with visual impairments. We evaluated existing blocks-based environments and identified five major accessibility barriers for visually impaired users. We explored techniques to overcome these barriers in an interview with a teacher of the visually impaired and formative studies on a touchscreen blocks-based environment with five children with visual impairments. We distill our findings on usable touchscreen interactions into guidelines for designers of blocks-based environments.",
  "authors": [
    {
      "name": "Lauren R. Milne",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358939557",
      "orcid": "missing"
    },
    {
      "name": "Richard E. Ladner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100297556/rel-imgonly/ladner3.jpg",
      "acmid": "81100297556",
      "orcid": "0000-0001-9413-6774"
    }
  ],
  "references": [
    {
      "text": "Apple. 2012. Accessibility Programming Guide for iOS. Retrieved February 25, 2017 from https://developer.apple.com/library/content/documenta tion/UserExperience/Conceptual/iPhoneAccessibility/I ntroduction/Introduction.html#//apple_ref/doc/uid/TP4 0008785",
      "doi": ""
    },
    {
      "text": "David Bau, Jeff Gray, Caitlin Kelleher, Josh Sheldon, and Franklyn Turbak. 2017. Learnable Programming: Blocks and Beyond. Commun. ACM 60, 6: 72--80.  ",
      "doi": "10.1145/3015455"
    },
    {
      "text": "Louise P. Flannery, Brian Silverman, Elizabeth R. Kazakoff, Marina Umaschi Bers, Paula Bontá, and Mitchel Resnick. 2013. Designing ScratchJr: Support for Early Childhood Learning Through Computer Programming. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13), 1--10.  ",
      "doi": "10.1145/2485760.2485785"
    },
    {
      "text": "Nicholas A. Giudice, Hari Prasath Palani, Eric Brenner, and Kevin M. Kramer. 2012. Learning Nonvisual Graphical Information Using a Touch-based Vibro-audio Interface. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '12), 103--110.  ",
      "doi": "10.1145/2384916.2384935"
    },
    {
      "text": "Google. Blockly. Retrieved from https://developers.google.com/blockly/",
      "doi": ""
    },
    {
      "text": "Google. Accessible Blockly. Retrieved from https://blocklydemo.appspot.com/static/demos/accessible/index.html",
      "doi": ""
    },
    {
      "text": "Libby Hanna, Kirsten Risden, and Kirsten Alexander. 1997. Guidelines for Usability Testing with Children. interactions 4, 5: 9--14.  ",
      "doi": "10.1145/264044.264045"
    },
    {
      "text": "Shaun K. Kane, Jeffrey P. Bigham, and Jacob O. Wobbrock. 2008. Slide Rule: Making Mobile Touch Screens Accessible to Blind People Using Multi-touch Interaction Techniques. In Proceedings of the 10th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '08), 73--80.  ",
      "doi": "10.1145/1414471.1414487"
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, Annuska Z. Perkins, Daniel Wigdor, Richard E. Ladner, and Jacob O. Wobbrock. 2011. Access Overlays: Improving Nonvisual Access to Large Touch Screens for Blind Users. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11), 273--282.  ",
      "doi": "10.1145/2047196.2047232"
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. 2011. Usable Gestures for Blind People: Understanding Preference and Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 413--422.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Varsha Koushik and Clayton Lewis. 2016. An Accessible Blocks Language: Work in Progress. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 317--318.  ",
      "doi": "10.1145/2982142.2982150"
    },
    {
      "text": "Clayton Lewis. 2014. Work in Progress Report: Nonvisual Visual Programming. Psychology of Programming Interest Group. Retrieved from http://users.sussex.ac.uk/~bend/ppig2014/14ppig2014_submission_5.pdf",
      "doi": ""
    },
    {
      "text": "Stephanie Ludi, Mohammed Abadi, Yuji Fujiki, Priya Sankaran, and Spencer Herzberg. 2010. JBrick: Accessible Lego Mindstorm Programming Tool for Users Who Are Visually Impaired. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '10), 271-- 272.  ",
      "doi": "10.1145/1878803.1878866"
    },
    {
      "text": "Stephanie Ludi and Tom Reichlmayr. 2011. The Use of Robotics to Promote Computing to Pre-College Students with Visual Impairments. Trans. Comput. Educ. 11, 3: 20:1--20:20.  ",
      "doi": "10.1145/2037276.2037284"
    },
    {
      "text": "John Maloney, Mitchel Resnick, Natalie Rusk, Brian Silverman, and Evelyn Eastmond. 2010. The Scratch Programming Language and Environment. Trans. Comput. Educ. 10, 4: 16:1--16:15.  ",
      "doi": "10.1145/1868358.1868363"
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V. Tammen. 1989. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting: A Confirmatory Factor Analysis. Research Quarterly for Exercise and Sport 60, 1: 48--58.",
      "doi": ""
    },
    {
      "text": "S. Mealin and E. Murphy-Hill. 2012. An exploratory study of blind software developers. In 2012 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC), 71--74.",
      "doi": ""
    },
    {
      "text": "Lauren R. Milne, Cynthia L. Bennett, Richard E. Ladner, and Shiri Azenkot. 2014. BraillePlay: Educational Smartphone Games for Blind Children. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 137--144.  ",
      "doi": "10.1145/2661334.2661377"
    },
    {
      "text": "Jaime Sánchez and Fernando Aguayo. 2005. Blind Learners Programming Through Audio. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05), 1769--1772.  ",
      "doi": "10.1145/1056808.1057018"
    },
    {
      "text": "Andreas Stefik, Christopher Hundhausen, and Robert Patterson. 2011. An Empirical Investigation into the Design of Auditory Cues to Enhance Computer Program Comprehension. Int. J. Hum.-Comput. Stud. 69, 12: 820--838.  ",
      "doi": "10.1016/j.ijhcs.2011.07.002"
    },
    {
      "text": "Andreas M. Stefik, Christopher Hundhausen, and Derrick Smith. 2011. On the Design of an Educational Infrastructure for the Blind and Visually Impaired in Computer Science. In Proceedings of the 42Nd ACM Technical Symposium on Computer Science Education (SIGCSE '11), 571--576.  ",
      "doi": "10.1145/1953163.1953323"
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How People with Low Vision Access Computing Devices: Understanding Challenges and Opportunities. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 171--180.  ",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Anja Thieme, Cecily Morrison, Nicolas Villar, Martin Grayson, and Siân Lindley. 2017. Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 739--752.  ",
      "doi": "10.1145/3064663.3064689"
    },
    {
      "text": "UC: Berkley. Snap! Build your own blocks. Retrieved from https://snap.berkeley.edu/",
      "doi": ""
    },
    {
      "text": "Bruce N. Walker, Amanda Nance, and Jeffrey Lindsay. 2006. Spearcons: speech-based earcons improve navigation performance in auditory menus. Retrieved September 10, 2017 from https://smartech.gatech.edu/handle/1853/50642",
      "doi": ""
    },
    {
      "text": "Wonder Workshop. Blockly iOS Application for Dot and Dash Robots. Retrieved from https://www.makewonder.com/apps/blockly",
      "doi": ""
    },
    {
      "text": "Hour of Code. Code.org. Retrieved September 3, 2017 from https://hourofcode.com/learn",
      "doi": ""
    },
    {
      "text": "Vision Accessibility - Mac - Apple. Retrieved September 5, 2017 from https://www.apple.com/accessibility/mac/vision/",
      "doi": ""
    },
    {
      "text": "Get started on Android with TalkBack - Android Accessibility Help. Retrieved September 5, 2017 from https://support.google.com/accessibility/android/answe r/6283677?hl=en",
      "doi": ""
    },
    {
      "text": "WebAIM: Screen Reader User Survey #6 Results. Retrieved February 16, 2017 from http://webaim.org/projects/screenreadersurvey6/#mobil e",
      "doi": ""
    },
    {
      "text": "Coding for Kids. Tynker.com. Retrieved September 5, 2017 from https://www.tynker.com/",
      "doi": ""
    },
    {
      "text": "Hopscotch - Learn to Code Through Creative Play. Retrieved September 5, 2017 from https://www.gethopscotch.com/",
      "doi": ""
    },
    {
      "text": "Tickle: Program Star Wars BB-8, LEGO, Drones, Arduino, Dash & Dot, Sphero, Robots, Hue, Scratch, Swift, and Smart Homes on your iPhone and iPad. Tickle Labs, Inc. Retrieved February 27, 2017 from https://www.tickleapp.com/",
      "doi": ""
    },
    {
      "text": "How to Meet WCAG 2.0. Retrieved February 25, 2017 from https://www.w3.org/WAI/WCAG20/quickref/",
      "doi": ""
    },
    {
      "text": "Accessibility Developer Checklist | Android Developers. Retrieved February 25, 2017 from https://developer.android.com/guide/topics/ui/accessibi lity/checklist.html",
      "doi": ""
    },
    {
      "text": "iOS VoiceOver Gesture, Keyboard & Braille Shortcuts | AxS Lab. Retrieved September 16, 2017 from http://axslab.com/articles/ios-voiceover-gestures-andkeyboard-commands.php",
      "doi": ""
    }
  ]
}