{
  "doi": "10.1145/3173574.3174176",
  "title": "c.light: A Tool for Exploring Light Properties in Early Design Stage",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [],
  "abstract": "Although a light becomes an important design element, there are little techniques available to explore shapes and light effects in early design stages. We present c.light, a design tool that consists of a set of modules and a mobile application for visualizing the light in a physical world. It allows designers to easily fabricate both tangible and intangible properties of a light without a technical barrier. We analyzed how c.light contributes to the ideation process of light design through a workshop. The results showed that c.light largely expands designers' capability to manipulate intangible properties of light and, by doing so, it facilitates collaborative and inverted ideation process in early design stages. It is expected that the results of this study could enhance our understanding of how designers manipulate light in a physical world in early design stages and could be a good stepping stone for future tool development.",
  "tags": [
    "prototyping",
    "design ideation",
    "light",
    "product design"
  ],
  "authors": [
    {
      "name": "Kyeong Ah Jeong",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658991056",
      "orcid": "missing"
    },
    {
      "name": "Eunjin Kim",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658729511",
      "orcid": "missing"
    },
    {
      "name": "Taesu Kim",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/do/10.1145/contrib-99659260418/rel-imgonly/taesukim.jpg",
      "acmid": "99659260418",
      "orcid": "missing"
    },
    {
      "name": "Hyeon-Jeong Suk",
      "institution": "Korea Advanced Institute of Science&Technology, Daejeon, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484648163",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adafruit. NeoPixels. Retrieved January 2, 2018 from https://www.adafruit.com/category/168",
      "doi": ""
    },
    {
      "text": "Apple. HomeKit. Retrieved January 2, 2018 from https://developer.apple.com/homekit/",
      "doi": ""
    },
    {
      "text": "Auraglow. 2017. Auraglow 7W Remote Controlled Colour Changing B22 and E27 Light Bulb. Video. (19 April 2017). Retrieved January 2, 2018 from https://www.youtube.com/watch?v=4UIElAQZa4g",
      "doi": ""
    },
    {
      "text": "Sebastian Boring, Sven Gehring, Alexander Wiethoff, Anna Magdalena Blöckner, Johannes Schöning, and Andreas Butz. 201 Multi-user interaction on media facades through live video on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2721--2724.  ",
      "doi": "10.1145/1978942.1979342"
    },
    {
      "text": "Virginia Braun, and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Amber Case. 2015. Calm technology: Principles and patterns for non-intrusive design. O'Reilly Media.",
      "doi": ""
    },
    {
      "text": "Emilie Chalcraft. 2013. Driverless cars and OLED headlights by Audi at CES 2013. (January 2013). Retrieved January 2, 2018 from https://www.dezeen.com/2013/01/11/piloted-driving-and-oled-lighting-technology-presented-by-audi-at-ces/",
      "doi": ""
    },
    {
      "text": "Kyungah Choi, Jeongmin Lee, and Hyeon-Jeong Suk. 2016. Context-based presets for lighting setup in residential space. Applied ergonomics 52, 222--231.",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho, Jamie Zigelbaum, and Joshua Kopin. 2011. Six-forty by four-eighty: the post-industrial design of computational materials. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction, 253--256.  ",
      "doi": "10.1145/1935701.1935752"
    },
    {
      "text": "Design Council. 2007. Eleven lessons: Managing design in eleven global companies-desk research report.",
      "doi": ""
    },
    {
      "text": "Cutecircuit. 2015. Mirror Handbag. Retrieved January 2, 2018 from https://shop.cutecircuit.com/collections/accessories/products/mirror-handbag",
      "doi": ""
    },
    {
      "text": "Margarita Dekoli, and Bakhtiar Mikhak. 2004. CODACHROME: a system for creating interactive electronic jewelry for children. In Proceedings of the 2004 conference on Interaction design and children: building a community, 139--140.  ",
      "doi": "10.1145/1017833.1017859"
    },
    {
      "text": "Tomas Dorta, Edgar Perez, and Annemarie Lesage. 2008. The ideation gap:: hybrid tools, design flow and practice. Design studies 29, 2, 121--141.",
      "doi": ""
    },
    {
      "text": "Tim Edensor. 2012. Illuminated atmospheres: anticipating and reproducing the flow of affective experience in Blackpool. Environment and Planning D: Society and Space 30, 6, 1103--1122.",
      "doi": ""
    },
    {
      "text": "Michael Fox. 2016. Interactive Architecture: Adaptive World. Chronicle Books.",
      "doi": ""
    },
    {
      "text": "John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. Shapeclip: towards rapid prototyping with shape-changing displays for designers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 19--28.  ",
      "doi": "10.1145/2702123.2702599"
    },
    {
      "text": "Chris Harrison, John Horstman, Gary Hsieh, and Scott Hudson. 2012. Unlocking the expressivity of point lights. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1683--1692.  ",
      "doi": "10.1145/2207676.2208296"
    },
    {
      "text": "Björn Hartmann, Scott R Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective physical prototyping through integrated design, test, and analysis. In Proceedings of the 19th annual ACM symposium on User interface software and technology, 299--308.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Georg Hoffmann, Veronika Gufler, Andrea Griesmacher, Christian Bartenbach, Markus Canazei, Siegmund Staggl, and Wolfgang Schobersberger. 2008. Effects of variable lighting intensities and colour temperatures on sulphatoxymelatonin and subjective mood in an experimental office workplace. Applied Ergonomics 39, 6, 719--728.",
      "doi": ""
    },
    {
      "text": "Marius Hoggenmüller, and Alexander Wiethoff. 2014. LightSet: enabling urban prototyping of interactive media façades. In Proceedings of the 2014 conference on Designing interactive systems, 925--934.  ",
      "doi": "10.1145/2598510.2598551"
    },
    {
      "text": "Marius Hoggenmueller, and Alexander Wiethoff. 2015. Blinking Lights and Other Revelations: Experiences Designing Hybrid Media Façades. In Proceedings of the 4th International Symposium on Pervasive Displays, 77--82.  ",
      "doi": "10.1145/2757710.2757725"
    },
    {
      "text": "Hiroshi Ishii. 2004. Bottles: A transparent interface as a tribute to mark weiser. IEICE Transactions on information and systems 87, 6, 1299--1311.",
      "doi": ""
    },
    {
      "text": "Majeed Kazemitabaar, Jason McPeak, Alexander Jiao, Liang He, Thomas Outing, and Jon E Froehlich. 2017. MakerWear: A Tangible Approach to Interactive Wearable Creation for Children. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 133--145.  ",
      "doi": "10.1145/3025453.3025887"
    },
    {
      "text": "Han-Jong Kim, Ju-Whan Kim, and Tek-Jin Nam. 2016. miniStudio: Designers' Tool for Prototyping Ubicomp Space with Interactive Miniature. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 213--224.  ",
      "doi": "10.1145/2858036.2858180"
    },
    {
      "text": "Woohun Lee, and Jun Park. 2005. Augmented foam: A tangible augmented reality for product design. In Proceedings of International Symposium on Mixed and Augmented Reality, 106--109.  ",
      "doi": "10.1109/ISMAR.2005.16"
    },
    {
      "text": "Remco Magielse, and Philip R Ross. 2011. A design approach to socially adaptive lighting environments. In Proceedings of the 9th ACM SIGCHI Italian Chapter International Conference on Computer-Human Interaction: Facing Complexity, 171--176.  ",
      "doi": "10.1145/2037296.2037337"
    },
    {
      "text": "NooElec. WS2801 LED Pixels. Retrieved January 2, 2018 from http://www.nooelec.com/store/25pc-12mm-diffused-rgb-led-pixels-5v-ws2801-drivers-waterproof-addressable-color.html",
      "doi": ""
    },
    {
      "text": "Santiago Ortega-Avila, Jochen Huber, Nuwan Janaka, Anusha Withana, Piyum Fernando, and Suranga Nanayakkara. 2014. SparKubes: exploring the interplay between digital and physical spaces with minimalistic interfaces. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design, 204--207.  ",
      "doi": "10.1145/2686612.2686643"
    },
    {
      "text": "Osram. LIGHTIFY. Retrieved January 2, 2018 from https://www.osram.com/cb/lightify/index.jsp",
      "doi": ""
    },
    {
      "text": "Jin-Yung Park, and Tek-Jin Nam. 2007. Understanding dynamic design elements for information representation of ambient media. In Proceedings of IASDR07.",
      "doi": ""
    },
    {
      "text": "Amanda Parkes, and Hiroshi Ishii. 2009. Kinetic sketchup: motion prototyping in the tangible design process. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction, 367--372.  ",
      "doi": "10.1145/1517664.1517738"
    },
    {
      "text": "Roshan Lalintha Peiris, and Suranga Nanayakkara. 2014. PaperPixels: a toolkit to create paper-based displays. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design, 498--504.  ",
      "doi": "10.1145/2686612.2686691"
    },
    {
      "text": "Philips. Hue. Retrieved January 2, 2018 from https://www2.meethue.com/en-us",
      "doi": ""
    },
    {
      "text": "Henrika Pihlajaniemi, Toni Österlund, and Aulikki Herneoja. 2014. Urban echoes: adaptive and communicative urban lighting in the virtual and the real. In Proceedings of the 2nd Media Architecture Biennale Conference: World Cities, 48--57.  ",
      "doi": "10.1145/2682884.2682888"
    },
    {
      "text": "Cecil Piya, Senthil Chandrasegaran, Niklas Elmqvist, and Karthik Ramani. 2017. Co-3Deator: A Team-First Collaborative 3D Design Ideation Tool. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6581--6592.  ",
      "doi": "10.1145/3025453.3025825"
    },
    {
      "text": "Carsten Röcker, Thorsten Prante, NA Streitz, and Daniel van Alphen. 2004. Using ambient displays and smart artefacts to support community interaction in distributed teams. In Proceedings of the OZCHI Conference, 22--24.",
      "doi": ""
    },
    {
      "text": "Norbert FM Roozenburg, and Johannes Eekels. 1995. Product design: fundamentals and methods. Wiley Chichester.",
      "doi": ""
    },
    {
      "text": "Daniel Saakes, and Pieter Jan Stappers. 2009. A tangible design tool for sketching materials in products. AI EDAM 23, 3, 275--287.  ",
      "doi": "10.1017/S0890060409000249"
    },
    {
      "text": "Samsung. Samsung SmartThings. Retrieved January 2, 2018 from https://www.samsung.com/us/smart-home/",
      "doi": ""
    },
    {
      "text": "Philipp Schardt, Michael Schmitz, Hannes Käfer, and Eric Hofmann. 2015. Lichtform: A Shape Changing Light Installation. In Proceedings of the 4th International Symposium on Pervasive Displays, 259--260.  ",
      "doi": "10.1145/2757710.2776811"
    },
    {
      "text": "Donald A Schon. 1984. The reflective practitioner: How professionals think in action. Basic books.",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1987. Educating the reflective practitioner: Toward a new design for teaching and learning in the professions. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Thomas Schroepfer, Suranga Nanayakkara, Anusha Withana, Juan Pablo, Thomas Wortmann, Alex Cornelius, Yu Nong Khew, and Aloysius Lian. 2014. nZwarm: a swarm of luminous sea creatures that interact with passers-by. In Wellington LUX 2014.",
      "doi": ""
    },
    {
      "text": "Susanne Seitinger, Daniel S Perry, and William J Mitchell. 2009. Urban pixels: painting the city with light. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 839--848.  ",
      "doi": "10.1145/1518701.1518829"
    },
    {
      "text": "Solderlab. Glediator - LED matrix control software. Retrieved January 2, 2018 from http://www.solderlab.de/index.php/software/glediator",
      "doi": ""
    },
    {
      "text": "no new folk studio. 2016. Orphe Smart footwear for Artists&Performers. Video. (20 June 2016). Retrieved January 2, 2018 from https://www.youtube.com/watch?v=9wzYunGFPLE&feature=youtu.be",
      "doi": ""
    },
    {
      "text": "ThingM. 2010. BlinkMSequencer. (October 2010). Retrieved January 2, 2018 from http://blog.thingm.com/2010/10/new-blinkmsequencer-features/",
      "doi": ""
    },
    {
      "text": "Cesar Torres, Jasper O'Leary, Molly Nicholas, and Eric Paulos. 2017. Illumination Aesthetics: Light as a Creative Material within Computational Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6111--6122.  ",
      "doi": "10.1145/3025453.3025466"
    },
    {
      "text": "Carlo Volf. 2011. Light and the Aesthetics of Perception. The Nordic Journal of Aesthetics 22, 40--41.",
      "doi": ""
    },
    {
      "text": "Alexander Wiethoff, and Sven Gehring. 2012. Designing interaction with media façades: a case study. In Proceedings of the Designing Interactive Systems Conference, 308--317.  ",
      "doi": "10.1145/2317956.2318004"
    },
    {
      "text": "H. James Wilson, Baiju Shah, and Brian Whipple. 2015. How people are actually using the Internet of Things. (October 2015). Retrieved January 2, 2018 from https://hbr.org/2015/10/how-people-are-actually-using-the-internet-of-things",
      "doi": ""
    }
  ]
}