{
  "doi": "10.1145/3173574.3173682",
  "title": "In Search of the Dream Team: Temporally Constrained Multi-Armed Bandits for Identifying Effective Team Structures",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2018,
  "badges": [],
  "abstract": "Team structures---roles, norms, and interaction patterns---define how teams work. HCI researchers have theorized ideal team structures and built systems nudging teams towards them, such as those increasing turn-taking, deliberation, and knowledge distribution. However, organizational behavior research argues against the existence of universally ideal structures. Teams are diverse and excel under different structures: while one team might flourish under hierarchical leadership and a critical culture, another will flounder. In this paper, we present DreamTeam: a system that explores a large space of possible team structures to identify effective structures for each team based on observable feedback. To avoid overwhelming teams with too many changes, DreamTeam introduces multi-armed bandits with temporal constraints: an algorithm that manages the timing of exploration--exploitation trade-offs across multiple bandits simultaneously. A field experiment demonstrated that DreamTeam teams outperformed self-managing teams by 38%, manager-led teams by 46%, and teams with unconstrained bandits by 41%. This research advances computation as a powerful partner in establishing effective teamwork.",
  "authors": [
    {
      "name": "Sharon Zhou",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659080165",
      "orcid": "missing"
    },
    {
      "name": "Melissa Valentine",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639706",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    }
  ],
  "references": [
    {
      "text": "Mark S Ackerman. 2000. The intellectual challenge of CSCW: the gap between social requirements and technical feasibility. Human-computer interaction 15, 2 (2000), 179--203.  ",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Shipra Agrawal and Navin Goyal. 2012. Analysis of Thompson sampling for the multi-armed bandit problem. In Conference on Learning Theory. 39--1.",
      "doi": ""
    },
    {
      "text": "Deborah G Ancona, Gerardo A Okhuysen, and Leslie A Perlow. 2001. Taking time to integrate temporal research. Academy of Management Review 26, 4 (2001), 512--529.",
      "doi": ""
    },
    {
      "text": "Holly Arrow. 1997. Stability, bistability, and instability in small group influence patterns. Journal of Personality and Social Psychology 72, 1 (1997), 75.",
      "doi": ""
    },
    {
      "text": "Sasha A Barab and Thomas Duffy. 2000. From practice fields to communities of practice. Theoretical foundations of learning environments 1, 1 (2000), 25--55.",
      "doi": ""
    },
    {
      "text": "Jeremy B Bernerth, H Jack Walker, and Stanley G Harris. 2011. Change fatigue: Development and initial validation of a new measure. Work & Stress 25, 4 (2011), 321--337.",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Greg Little, Robert C. Miller, Björn Hartmann, Mark S. Ackerman, David R. Karger, David Crowell, and Katrina Panovich. 2015. Soylent: A Word Processor with a Crowd Inside. Commun. ACM 58,  ",
      "doi": "10.1145/2791285"
    },
    {
      "text": "(July 2015), 85--94. 8. Omar Besbes, Yonatan Gur, and Assaf Zeevi. 2015. Non-stationary stochastic optimization. Operations research 63, 5 (2015), 1227--1244.",
      "doi": ""
    },
    {
      "text": "Peter Michael Blau. 1974. On the nature of organizations. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "J Stuart Bunderson and Peter Boumgarden. 2010. Structure and learning in self-managed teams: Why \"bureaucratic\" teams can be better learners. Organization Science 21, 3 (2010), 609--624.  ",
      "doi": "10.1287/orsc.1090.0483"
    },
    {
      "text": "Tom E Burns and George Macpherson Stalker. 1961. The management of innovation. (1961).",
      "doi": ""
    },
    {
      "text": "Stéphane Caron and Smriti Bhagat. 2013. Mixing bandits: A recipe for improved cold-start recommendations in a social network. In Proceedings of the 7th Workshop on Social Network Mining and Analysis. ACM.  ",
      "doi": "10.1145/2501025.2501029"
    },
    {
      "text": "Nicolo Cesa-Bianchi, Claudio Gentile, and Giovanni Zappella. 2013. A gang of bandits. In Advances in Neural Information Processing Systems. 737--745. ",
      "doi": "10.5555/2999611.2999694"
    },
    {
      "text": "Joel Chan, Steven Dang, and Steven P Dow. 2016. Improving crowd innovation with expert facilitation. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1223--1235.  ",
      "doi": "10.1145/2818048.2820023"
    },
    {
      "text": "Hans De Bruijn and Ernst et al. Ten Heuvelhof. 2010. Process management: why project management fails in complex decision making processes. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "C. K. W. De Dreu and M. A. West. 2001. Minority dissent and team innovation: The importance of participation in decision making. Journal of Applied Psychology 86, 6 (2001), 1191--1201.",
      "doi": ""
    },
    {
      "text": "Lex Donaldson. 1999. The normal science of structural contingency theory. SAGE Publications Ltd. 51--70 pages.",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Victoria Bellotti. 1992. Awareness and coordination in shared workspaces. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work. ACM, 107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "A. Edmondson. 1999. Psychological safety and learning behavior in work teams. Administrative Science Quarterly 44, 2 (1999), 350--383.",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7, 1 (2000), 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Ethan Fast, Binbin Chen, and Michael S Bernstein. 2016. Empath: Understanding topic signals in large-scale text. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4647--4657.  ",
      "doi": "10.1145/2858036.2858535"
    },
    {
      "text": "Colin M Fisher. 2017. An ounce of prevention or a pound of cure? Two experiments on in-process interventions in decision-making groups. Organizational Behavior and Human Decision Processes 138 (2017), 59--73.",
      "doi": ""
    },
    {
      "text": "Victor Gabillon, Mohammad Ghavamzadeh, Alessandro Lazaric, and Sébastien Bubeck. 2011. Multi-bandit best arm identification. In Advances in Neural Information Processing Systems. 2222--2230. ",
      "doi": "10.5555/2986459.2986707"
    },
    {
      "text": "Nicolas Galichet, Michele Sebag, and Olivier Teytaud. 2013. Exploration vs exploitation vs safety: Risk-aware multi-armed bandits. In Asian Conference on Machine Learning. 245--260.",
      "doi": ""
    },
    {
      "text": "R.T. Golembiewski. 2000. Handbook of Organizational Behavior, Second Edition, Revised and Expanded. Taylor and Francis.",
      "doi": ""
    },
    {
      "text": "Google. 2016. re:Work with Google. https://rework. withgoogle.com/print/guides/5721312655835136/. (2016).",
      "doi": ""
    },
    {
      "text": "Alvin Ward Gouldner. 1959. Organizational analysis. Basic Books.",
      "doi": ""
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 2002. A descriptive framework of workspace awareness for real-time groupware. Computer Supported Cooperative Work (CSCW) 11, 3 (2002), 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "J Richard Hackman. 2012. From causes to conditions in group research. Journal of Organizational Behavior 33, 3 (2012), 428--444.",
      "doi": ""
    },
    {
      "text": "Nathan Hahn, Joseph Chang, Ji Eun Kim, and Aniket Kittur. 2016. The Knowledge Accelerator: Big picture thinking in small pieces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2258--2270.  ",
      "doi": "10.1145/2858036.2858364"
    },
    {
      "text": "Jim Hollan and Scott Stornetta. 1992. Beyond being there. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 119--125.  ",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Daniel R Ilgen, John R Hollenbeck, Michael Johnson, and Dustin Jundt. 2005. Teams in organizations: From input-process-output models to IMOI models. Annu. Rev. Psychol. 56 (2005), 517--543.",
      "doi": ""
    },
    {
      "text": "Farnaz Jahanbakhsh, Wai-Tat Fu, Karrie Karahalios, Darko Marinov, and Brian Bailey. 2017. You Want Me to Work with Who?: Stakeholder Perceptions of Automated Team Formation in Project-based Courses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3201--3212.  ",
      "doi": "10.1145/3025453.3026011"
    },
    {
      "text": "Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E Kraut. 2011. Crowdforge: Crowdsourcing complex work. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 43--52.  ",
      "doi": "10.1145/2047196.2047202"
    },
    {
      "text": "Aniket Kittur, Bongwon Suh, Bryan A Pendleton, and Ed H Chi. 2007. He says, she says: conflict and coordination in Wikipedia. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 453--462.  ",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Travis Kriplean, Michael Toomim, Jonathan Morgan, Alan Borning, and Andrew Ko. 2012. Is this what you meant?: promoting listening on the web with reflect. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1559--1568.  ",
      "doi": "10.1145/2207676.2208621"
    },
    {
      "text": "Paul R Lawrence and Jay W Lorsch. 1967. Differentiation and integration in complex organizations. Administrative science quarterly (1967), 1--47.",
      "doi": ""
    },
    {
      "text": "Ioanna Lykourentzou, Robert E. Kraut, and Steven P. Dow. 2017. Team Dating Leads to Better Online Ad Hoc Collaborations. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 2330--2343.  ",
      "doi": "10.1145/2998181.2998322"
    },
    {
      "text": "Thomas W Malone, Kevin Crowston, and George Arthur Herman. 2003. Organizing business knowledge: The MIT process handbook. MIT press. ",
      "doi": "10.5555/949270"
    },
    {
      "text": "Andrew Mao, Winter Mason, Siddharth Suri, and Duncan J Watts. 2016. An experimental study of team size and performance on a complex task. PloS one 11, 4 (2016).",
      "doi": ""
    },
    {
      "text": "Michelle A Marks, John E Mathieu, and Stephen J Zaccaro. 2001. A temporally based framework and taxonomy of team processes. Academy of management review 26, 3 (2001), 356--376.",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior research methods 44, 1 (2012), 1--23.",
      "doi": ""
    },
    {
      "text": "Joseph Edward McGrath. 1984. Groups: Interaction and performance. Vol. 14. Prentice-Hall Englewood Cliffs, NJ.",
      "doi": ""
    },
    {
      "text": "Gerardo A Okhuysen and Mary J Waller. 2002. Focusing on midpoint transitions: An analysis of boundary conditions. Academy of Management Journal 45, 5 (2002), 1056--1065.",
      "doi": ""
    },
    {
      "text": "Gary M Olson and Judith S Olson. 2000. Distance matters. Human-computer interaction 15, 2 (2000), 139--178.  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Derek Salman Pugh and David J Hickson. 1976. Organizational structure in its context. Saxon House Westmead, Farnborough.",
      "doi": ""
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S Bernstein. 2014. Expert crowdsourcing with flash teams. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 75--85.  ",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "Horst WJ Rittel and Melvin M Webber. 1973. Dilemmas in a general theory of planning. Policy sciences 4, 2 (1973), 155--169.",
      "doi": ""
    },
    {
      "text": "Sandra L Robinson and Anne M O'Leary-Kelly. 1998. Monkey see, monkey do: The influence of work groups on the antisocial behavior of employees. Academy of Management Journal 41, 6 (1998), 658--672.",
      "doi": ""
    },
    {
      "text": "Niloufar Salehi, Andrew McCabe, Melissa Valentine, and Michael Bernstein. 2017. Huddler: Convening Stable and Familiar Crowd Teams Despite Unpredictable Availability. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1700--1713.  ",
      "doi": "10.1145/2998181.2998300"
    },
    {
      "text": "Jane E Salk and Mary Yoko Brannen. 2000. National culture, networks, and individual influence in a multinational management team. Academy of Management journal 43, 2 (2000), 191--202.",
      "doi": ""
    },
    {
      "text": "Amir Sani, Alessandro Lazaric, and Rémi Munos. 2012. Risk-aversion in multi-armed bandits. In Advances in Neural Information Processing Systems. 3275--3283. ",
      "doi": "10.5555/2999325.2999500"
    },
    {
      "text": "Michaéla C Schippers, Amy C Edmondson, and Michael A West. 2014. Team reflexivity as an antidote to team information-processing failures. Small Group Research 45, 6 (2014), 731--769.",
      "doi": ""
    },
    {
      "text": "W.R. Scott and G.F. Davis. 2015. Organizations and Organizing: Rational, Natural and Open Systems Perspectives. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Pao Siangliulue, Joel Chan, Steven P Dow, and Krzysztof Z Gajos. 2016. IdeaHound: Improving Large-scale Collaborative Ideation with Crowd-powered Real-time Semantic Modeling. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 609--624.  ",
      "doi": "10.1145/2984511.2984578"
    },
    {
      "text": "Jane Siegel, Vitaly Dubrovsky, Sara Kiesler, and Timothy W McGuire. 1986. Group processes in computer-mediated communication. Organizational behavior and human decision processes 37, 2 (1986), 157--187.",
      "doi": ""
    },
    {
      "text": "HA Simon. 1947. Administrative behavior; a study of decision-making processes in administrative organization. Macmillan.",
      "doi": ""
    },
    {
      "text": "Christine A Sprigg, Paul R Jackson, and Sharon K Parker. 2000. Production teamworking: The importance of interdependence and autonomy for employee strain and satisfaction. Human Relations 53, 11 (2000), 1519--1543.",
      "doi": ""
    },
    {
      "text": "Bradley R Staats, Katherine L Milkman, and Craig R Fox. 2012. The team scaling fallacy: Underestimating the declining efficiency of larger teams. Organizational Behavior and Human Decision Processes 118, 2 (2012), 132--142.",
      "doi": ""
    },
    {
      "text": "James D Thompson. 1967. Organizations in action: Social science bases of administrative theory. Transaction publishers.",
      "doi": ""
    },
    {
      "text": "H. H. M. Tse, M. T. Dasborough, and N. M. Ashkanasy. 2008. A multi-level analysis of team climate and interpersonal exchange relationships at work. Leadership Quarterly 19, 2 (2008), 195--211.",
      "doi": ""
    },
    {
      "text": "Rajan Vaish, Snehalkumar Neil S Gaikwad, Geza Kovacs, Andreas Veit, Ranjay Krishna, Imanol Arrieta Ibarra, Camelia Simoiu, Michael Wilber, Serge Belongie, Sharad Goel, James Davis, and Michael S Bernstein. 2017. Crowd Research: Open and Scalable University Laboratories. In Proceedings of the 32nd annual ACM Symposium on User Interface Software and Technology.  ",
      "doi": "10.1145/3126594.3126648"
    },
    {
      "text": "Sattar Vakili and Qing Zhao. 2016. Risk-Averse Multi-Armed Bandit Problems under Mean-Variance Measure. IEEE Journal of Selected Topics in Signal Processing 10, 6 (2016), 1093--1111.",
      "doi": ""
    },
    {
      "text": "Gina Venolia, John Tang, Ruy Cervantes, Sara Bly, George Robertson, Bongshin Lee, and Kori Inkpen. 2010. Embodied social proxy: mediating interpersonal connection in hub-and-satellite teams. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1049--1058.  ",
      "doi": "10.1145/1753326.1753482"
    },
    {
      "text": "Fernanda B Viégas and Judith S Donath. 1999. Chat circles. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 9--16.  ",
      "doi": "10.1145/302979.302981"
    },
    {
      "text": "Ruth Wageman. 1995. Interdependence and group effectiveness. Administrative science quarterly (1995), 145--180.",
      "doi": ""
    },
    {
      "text": "Ruth Wageman and Frederick M Gordon. 2005. As the twig is bent: How group values shape emergent task interdependence in groups. Organization Science 16, 6 (2005), 687--700.  ",
      "doi": "10.1287/orsc.1050.0146"
    },
    {
      "text": "Ruth Wageman, J Richard Hackman, and Erin Lehman. 2005. Team diagnostic survey: Development of an instrument. The Journal of Applied Behavioral Science 41, 4 (2005), 373--398.",
      "doi": ""
    },
    {
      "text": "Lan Wang, Jian Han, Colin M Fisher, and Yan Pan. 2017. Learning to share: Exploring temporality in shared leadership and team learning. Small Group Research 48, 2 (2017), 165--189.",
      "doi": ""
    },
    {
      "text": "Terry Winograd. 1986. A language/action perspective on the design of cooperative work. In Proceedings of the 1986 ACM conference on Computer-supported cooperative work. ACM, 203--220.  ",
      "doi": "10.1145/637069.637096"
    },
    {
      "text": "Yingce Xia, Haifang Li, Tao Qin, Nenghai Yu, and Tie-Yan Liu. 2015. Thompson Sampling for Budgeted Multi-Armed Bandits. In IJCAI. 3960--3966. ",
      "doi": "10.5555/2832747.2832801"
    },
    {
      "text": "Lixiu Yu, Aniket Kittur, and Robert E Kraut. 2014. Distributed analogical idea generation: inventing with crowds. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1245--1254.  ",
      "doi": "10.1145/2556288.2557371"
    },
    {
      "text": "Amy X Zhang, Lea Verou, and David R Karger. 2017b. Wikum: Bridging Discussion Forums and Wikis Using Recursive Summarization. In CSCW. 2082--2096.  ",
      "doi": "10.1145/2998181.2998235"
    },
    {
      "text": "Haoqi Zhang, Matthew W Easterday, Elizabeth M Gerber, Daniel Rees Lewis, and Leesha Maliakal. 2017a. Agile Research Studios: Orchestrating Communities of Practice to Advance Research Training. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 45--48.  ",
      "doi": "10.1145/3022198.3023265"
    }
  ]
}