{
  "doi": "10.1145/3173574.3173587",
  "title": "MABLE: Mediating Young Children's Smart Media Usage with Augmented Reality",
  "published": "2018-04-19",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2018,
  "badges": [],
  "abstract": "There has been a growing concern over the huge increase in use of smart media by young children. This study explores the possibility of using augmented-reality(AR) for regulat-ing preschoolers' media usage behavior. With MABLE (mobile application for behavioral learning and education), parents can provide AR-assisted feedback by changing facial expressions and sound effects. When overlaying a smart media, which has MABLE running, in front of a QR marker on a puppet, a facial expression is displayed on top of the puppet's face. A two-week long experiment with 36 parent-child pairs showed that compared to using just the puppet, using MABLE showed higher amount of engage-ment among preschoolers. For the effectiveness of parental mediation in terms of self-control, our data showed mixed results. MABLE had positive effects in that the amount of rule-compliance increased and problematic behaviors de-creased, whereas the level of behavioral dependency on smart media was not influenced.",
  "tags": [
    "preschoolers",
    "engagement",
    "smart media usage",
    "rule compliance",
    "augmented reality (ar)",
    "parental medi-ation"
  ],
  "authors": [
    {
      "name": "Gahgene Gweon",
      "institution": "Seoul National University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100111542",
      "orcid": "0000-0003-3268-477X"
    },
    {
      "name": "Bugeun Kim",
      "institution": "Seoul National University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659248175",
      "orcid": "missing"
    },
    {
      "name": "Jinyoung Kim",
      "institution": "Seoul National University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260911",
      "orcid": "missing"
    },
    {
      "name": "Kung Jin Lee",
      "institution": "University of Washington - Seattle, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659044533",
      "orcid": "missing"
    },
    {
      "name": "Jungwook Rhim",
      "institution": "Seoul National University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659247650",
      "orcid": "0000-0003-1224-1939"
    },
    {
      "name": "Jueun Choi",
      "institution": "Seoul National University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161922",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sara Aronin and Kim K. Floyd. 2013. Using an iPad in inclusive preschool classrooms to introduce STEM concepts. Teaching Exceptional Children 45, 4: 34--39.",
      "doi": ""
    },
    {
      "text": "Ronald T. Azuma. 1997. A survey of augmented reality. Teleoperators and Virtual Environments 6, 4: 355385.  ",
      "doi": "10.1162/pres.1997.6.4.355"
    },
    {
      "text": "Zhen Bai, Alan F. Blackwell, and George Coulouris. 2015. Exploring expressive augmented reality: the FingAR puppet system for social pretend play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1035--1044.  ",
      "doi": "10.1145/2702123.2702250"
    },
    {
      "text": "Beth Beschorner and Amy Hutchison. 2013. iPads as a literacy teaching tool in early childhood. International Journal of Education in Mathematics, Science and Technology 1, 1: 16--24.",
      "doi": ""
    },
    {
      "text": "Clancy Blair and Rachel Peters Razza. 2007. Relating effortful control, executive function, and false belief understanding to emerging math and literacy ability in kindergarten. Child Development 78, 2: 647--663.",
      "doi": ""
    },
    {
      "text": "Chiong Cynthia, and Carly Shuler. 2010. Learning: is there an app for that? In Investigations of young children's usage and learning with mobile devices and apps. New York: The Joan Ganz Cooney Center at Sesame Workshop.",
      "doi": ""
    },
    {
      "text": "Susanne A. Denham, Heather K. Warren-Khot, Hideko Hamada Bassett, Todd Wyatt, and Alyssa Perna. 2012. Factor structure of self-regulation in preschoolers: testing models of a field-based assessment for predicting early school readiness. Journal of Experimental Child Psychology 111, 3: 386--404.",
      "doi": ""
    },
    {
      "text": "Leanne C. Findlay, Alberta Girardi and Robert J. Coplan. 2006. Links between empathy, social behavior, and social understanding in early childhood. Early Childhood Research Quarterly 21, 3: 347--359.",
      "doi": ""
    },
    {
      "text": "Michelle M. Garrison, Kimberly Liekweg & Dimitri A. Christakis. (2011). Media use and child sleep: the impact of content, timing, and environment. Pediatrics 128, 1: 29--35.",
      "doi": ""
    },
    {
      "text": "Eugene Geist. 2014. Using tablet computers with toddlers & young preschoolers. Young Children 69, 1: 58.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sarita Y. Schoenebeck, and Julie A. Kientz. 2016. Not at the dinner table: Parents' and children's perspectives on family technology rules. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 1376--1389.  ",
      "doi": "10.1145/2818048.2819940"
    },
    {
      "text": "Blandine Hubert, Philippe Guimard, Agnès Florin & Alexis Tracy. 2015. Indirect and direct relationships between self-regulation and academic achievement during the nursery/elementary school transition of french students. Early Education and Development 26, 5--6: 685--707.",
      "doi": ""
    },
    {
      "text": "Y.-H.Hung, C.-H.Chen, and S.-W.Huang. 2016. Applying augmented reality to enhance learning: a study of different teaching materials. Journal of Computer Assisted Learning 33, 3: 252--266.",
      "doi": ""
    },
    {
      "text": "Heather L. Kirkorian and Tiffany A. Pempek. 2013. Toddlers and touch screens: potential for early learning? Zero To Three 33, 4: 32--37.",
      "doi": ""
    },
    {
      "text": "Young-Ja Ko, and Min-Jung Kim. 2012. Animation character preference according to age and gender of children. Journal of the Korea Contents Association 12, 3: 470--479.",
      "doi": ""
    },
    {
      "text": "Clair B. Kopp. 1982. Antecedents of self-regulation: a developmental perspective. Developmental Psychology 18, 2: 199--214.",
      "doi": ""
    },
    {
      "text": "Jung-rim Lee. 2013. Smartphone exposure of infants and toddlers, and child care policy. In Proceedings of the KICCE Conference, 3--36.",
      "doi": ""
    },
    {
      "text": "Ministry of Science and ICT of South Korea. 2016. The survey on internet overdependence.",
      "doi": ""
    },
    {
      "text": "Terrie E. Moffitt, Louise Arseneault, Daniel Belsky, Nigel Dickson, Robert J. Hancox, HonaLee Harrington, Renate Houts, Richie Poulton, Brent W. Roberts, Stephen Ross, Malcolm R. Sears, W. Murray Thomson, and Avshalom Caspi. 2011. A gradient of childhood self-control predicts health, wealth, and public safety. PNAS 108, 7: 2693--2698.",
      "doi": ""
    },
    {
      "text": "Mark Muraven and Roy F. Baumeister. 2000. Selfregulation and depletion of limited resources: does selfcontrol resemble a muscle? Psychology Bulletin 126, 2: 247--259.",
      "doi": ""
    },
    {
      "text": "Amy I. Nathanson. 2001. Parent and child perspectives on the presence and meaning of parental television mediation. Journal of Broadcasting & Electronic Media 45, 2: 201--220.",
      "doi": ""
    },
    {
      "text": "National Information Society Agency of South Korea. 2016. Children's usage of Smart Phone scale.",
      "doi": ""
    },
    {
      "text": "Sara R. Nichols, Margarita Svetlova, and Celia A. Brownell. 2009. The role of social understanding and empathic disposition in young children's responsiveness to distress in parents and peers. Cognition, brain, behavior: an interdisciplinary journal 13, 4: 449.",
      "doi": ""
    },
    {
      "text": "Michelle M. Neumann and David L. Neumann. 2015. The use of touch-screen tablets at home and pre-school to foster emergent literacy. Journal of Early Childhood Literacy 17, 2: 203--220.",
      "doi": ""
    },
    {
      "text": "Dayang R. A. Rambli, Wannisa Matcha, and Suziah Sulaiman. 2013. Fun leaning with AR alphabet book for preschool children. 2013 International Conference on Virtual and Augmented Reality in Education 25: 211--219.",
      "doi": ""
    },
    {
      "text": "Janet Read, Stuart Macfarlane. 2002. Endurability, Engagement and Expectations: Measuring children's fun. In: Interaction design and children, vol 2. Shaker Publishing, Aachen, pp 1--23.",
      "doi": ""
    },
    {
      "text": "Janet Read. 2008. Validating the Fun Toolkit: an instrument for measuring children's opinions of technology. Cognition, Technology & Work, 10(2), 119--128.  ",
      "doi": "10.1007/s10111-007-0069-9"
    },
    {
      "text": "Gavin Sim and Brendan Cassidy. 2013. Investigating the fidelity effect when evaluating game prototypes with children. In Proceedings of the 27th International BCS Human Computer Interaction Conference, 53. ",
      "doi": "10.5555/2578048.2578111"
    },
    {
      "text": "Radiah Smith-Donald, C. Cybele Raver, Tiffany Hayes, and Breeze Richardson. 2007. Preliminary construct and concurrent validity of the preschool selfregulation assessment (PSRA) for field-based research. Early Childhood Research Quarterly 22, 2: 173--187.",
      "doi": ""
    },
    {
      "text": "Tracy L. Spinrad and Cynthia A. Stifter. 2006. Toddlers' empathy-related responding to distress: Predictions from negative emotionality and maternal behavior in infancy. Infancy 10.2: 97--121.",
      "doi": ""
    },
    {
      "text": "Stephanie F. Thompson, Liliana J. Lengua, Maureen Zalewski, and Lyndsey Moran. 2013. Income and the development of effortful control as predictors of teacher reports of preschool adjustment, Early Childhood Research Quarterly 28, 4: 784--793.",
      "doi": ""
    },
    {
      "text": "Ron Warren. 2003. Parental mediation of preschool children's television viewing. Journal of Broadcasting & Electronic Media 47, 3: 394--417.",
      "doi": ""
    },
    {
      "text": "Nicola Yelland. 1999. Technology as Play. Early Childhood Education Journal 26, 4: 217--220.",
      "doi": ""
    },
    {
      "text": "Rabia M. Yilmaz, Sevda Kucuk, and Yuksel Goktas. 2016. Are augmented reality picture books magic or real for preschool children aged five to six? British Journal of Educational Technology 48, 3: 824--841.",
      "doi": ""
    },
    {
      "text": "Frederick J. Zimmerman and Dimitri A. Christakis. 2007. Associations between content types of early media exposure and subsequent attentional problems. Pediatrics 120, 5: 986--992.",
      "doi": ""
    }
  ]
}