{
  "doi": "10.1145/3173574.3173863",
  "title": "Communication Behavior in Embodied Virtual Reality",
  "published": "2018-04-21",
  "proctitle": "CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2018,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Embodied virtual reality faithfully renders users' movements onto an avatar in a virtual 3D environment, supporting nuanced nonverbal behavior alongside verbal communication. To investigate communication behavior within this medium, we had 30 dyads complete two tasks using a shared visual workspace: negotiating an apartment layout and placing model furniture on an apartment floor plan. Dyads completed both tasks under three different conditions: face-to-face, embodied VR with visible full-body avatars, and no embodiment VR, where the participants shared a virtual space, but had no visible avatars. Both subjective measures of users' experiences and detailed annotations of verbal and nonverbal behavior are used to understand how the media impact communication behavior. Embodied VR provides a high level of social presence with conversation patterns that are very similar to face-to-face interaction. In contrast, providing only the shared environment was generally found to be lonely and appears to lead to degraded communication.",
  "authors": [
    {
      "name": "Harrison Jesse Smith",
      "institution": "Oculus Research & University of California, Davis, Sausalito, CA, USA",
      "img": "/do/10.1145/contrib-99659189596/rel-imgonly/smith_profile_pic.png",
      "acmid": "99659189596",
      "orcid": "missing"
    },
    {
      "name": "Michael Neff",
      "institution": "Oculus Research & University of California, Davis, Sausalito, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81405595242",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "U.S. Department of Energy Advanced Research Projects Agency Energy (ARPA-E). 2017. FACSIMILE APPEARANCE TO CREATE ENERGY SAVINGS (FACES). (2017).",
      "doi": ""
    },
    {
      "text": "Leila Alem and Jane Li. 2011. A study of gestures in a video-mediated collaborative assembly task. Advances in Human-Computer Interaction 2011 (2011), 1.  ",
      "doi": "10.1155/2011/987830"
    },
    {
      "text": "M. Argyle. 1988. Bodily communication. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Michael Argyle and Mark Cook. 1976. Gaze and mutual gaze. (1976).",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Jim Blascovich, Andrew C Beall, and Jack M Loomis. 2001. Equilibrium theory revisited: Mutual gaze and personal space in virtual environments. Presence: Teleoperators and virtual environments 10, 6 (2001), 583--598.  ",
      "doi": "10.1162/105474601753272844"
    },
    {
      "text": "Atman Binstock. 2015. Powering the Rift. (2015). https://www.oculus.com/blog/powering-the-rift/",
      "doi": ""
    },
    {
      "text": "Frank Biocca, Judee Burgoon, Chad Harms, and Matt Stoner. 2001. Criteria and scope conditions for a theory and measure of social presence. Presence: Teleoperators and virtual environments (2001).",
      "doi": ""
    },
    {
      "text": "Frank Biocca, Chad Harms, and Judee K Burgoon. 2003. Toward a more robust theory and measure of social presence: Review and suggested criteria. Presence: Teleoperators and virtual environments 12, 5 (2003), 456--480.  ",
      "doi": "10.1162/105474603322761270"
    },
    {
      "text": "Frank Biocca, Chad Harms, and Jenn Gregg. 2001. The networked minds measure of social presence: Pilot test of the factor structure and concurrent validity. In 4th annual international workshop on presence, Philadelphia, PA. 1--9.",
      "doi": ""
    },
    {
      "text": "Sara A Bly. 1988. A use of drawing surfaces in different collaborative settings. In Proceedings of the 1988 ACM conference on Computer-supported cooperative work. ACM, 250--256.  ",
      "doi": "10.1145/62266.62286"
    },
    {
      "text": "A. Campbell and J. Rushton. 1978. Bodily communication and personality. The British Journal of Social and Clinical Psychology 17, 1 (1978), 31--36.",
      "doi": ""
    },
    {
      "text": "Herbert H Clark, Susan E Brennan, and others. 1991. Grounding in communication. Perspectives on socially shared cognition 13, 1991 (1991), 127--149.",
      "doi": ""
    },
    {
      "text": "Herbert H Clark and Meredyth A Krych. 2004. Speaking while monitoring addressees for understanding. Journal of memory and language 50, 1 (2004), 62--81.",
      "doi": ""
    },
    {
      "text": "P. Ekman and W. V. Friesen. 1972. Hand movements. Journal of Communication 22 (1972), 353--374.",
      "doi": ""
    },
    {
      "text": "Susan R Fussell, Robert E Kraut, and Jane Siegel. 2000. Coordination of communication: Effects of shared visual context on collaborative work. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. ACM, 21--30.  ",
      "doi": "10.1145/358916.358947"
    },
    {
      "text": "Susan R Fussell and Leslie D Setlock. 2014. Computer-mediated communication. Handbook of Language and Social Psychology. Oxford University Press, Oxford, UK (2014), 471--490.",
      "doi": ""
    },
    {
      "text": "Susan R Fussell, Leslie D Setlock, Jie Yang, Jiazhi Ou, Elizabeth Mauer, and Adam DI Kramer. 2004. Gestures over video streams to support remote collaboration on physical tasks. Human-Computer Interaction 19, 3 (2004), 273--309.  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Darren Gergle, Robert E Kraut, and Susan R Fussell. 2004a. Action as language in a shared visual space. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. ACM, 487--496.  ",
      "doi": "10.1145/1031607.1031687"
    },
    {
      "text": "Darren Gergle, Robert E Kraut, and Susan R Fussell. 2004b. Language efficiency and visual technology: Minimizing collaborative effort with visual information. Journal of language and social psychology 23, 4 (2004), 491--517.",
      "doi": ""
    },
    {
      "text": "Darren Gergle, Robert E Kraut, and Susan R Fussell. 2013. Using visual information for grounding and awareness in collaborative tasks. Human-Computer Interaction 28, 1 (2013), 1--39.",
      "doi": ""
    },
    {
      "text": "Darren Gergle, Carolyn P Rosé, and Robert E Kraut. 2007. Modeling the impact of shared visual information on collaborative reference. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1543--1552.  ",
      "doi": "10.1145/1240624.1240858"
    },
    {
      "text": "Jörg Hauber, Holger Regenbrecht, Mark Billinghurst, and Andy Cockburn. 2006. Spatiality in videoconferencing: trade-offs between efficiency and social presence. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 413--422.  ",
      "doi": "10.1145/1180875.1180937"
    },
    {
      "text": "Jörg Hauber, Holger Regenbrecht, Aimee Hills, Andrew Cockburn, and Mark Billinghurst. 2005. Social presence in two-and three-dimensional videoconferencing. (2005).",
      "doi": ""
    },
    {
      "text": "Aimèe Hills, Jörg Hauber, and Holger Regenbrecht. 2005. Videos in space: a study on presence in video mediating communication systems. In Proceedings of the 2005 international conference on Augmented tele-existence. ACM, 247--248.  ",
      "doi": "10.1145/1152399.1152447"
    },
    {
      "text": "Ellen A Isaacs and John C Tang. 1994. What video can and cannot do for collaboration: a case study. Multimedia systems 2, 2 (1994), 63--73.  ",
      "doi": "10.1007/BF01274181"
    },
    {
      "text": "Steven Johnson, Madeleine Gibson, and Bilge Mutlu. 2015. Handheld or handsfree?: Remote collaboration via lightweight head-mounted displays and handheld devices. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1825--1836.  ",
      "doi": "10.1145/2675133.2675176"
    },
    {
      "text": "Adam Kendon. 1967. Some functions of gaze-direction in social interaction. Acta psychologica 26 (1967), 22--63.",
      "doi": ""
    },
    {
      "text": "David Kirk and Danae Stanton Fraser. 2006. Comparing remote gesture technologies for supporting collaborative physical tasks. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 1191--1200.  ",
      "doi": "10.1145/1124772.1124951"
    },
    {
      "text": "Robert M Krauss, Connie M Garlock, Peter D Bricker, and Lee E McMahon. 1977. The role of audible and visible back-channel responses in interpersonal communication. Journal of personality and social psychology 35, 7 (1977), 523.",
      "doi": ""
    },
    {
      "text": "Robert E Kraut, Susan R Fussell, and Jane Siegel. 2003. Visual information as a conversational resource in collaborative physical tasks. Human-computer interaction 18, 1 (2003), 13--49.  ",
      "doi": "10.1207/S15327051HCI1812_2"
    },
    {
      "text": "Robert E Kraut, Steven H Lewis, and Lawrence W Swezey. 1982. Listener responsiveness and the coordination of conversation. Journal of personality and social psychology 43, 4 (1982), 718.",
      "doi": ""
    },
    {
      "text": "Robert E Kraut, Mark D Miller, and Jane Siegel. 1996. Collaboration in performance of physical tasks: Effects on outcomes and communication. In Proceedings of the 1996 ACM conference on Computer supported cooperative work. ACM, 57--66.  ",
      "doi": "10.1145/240080.240190"
    },
    {
      "text": "David McNeill. 1992. Hand and Mind: What Gestures Reveal about Thought. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "D. McNeill. 2005. Gesture and thought. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Ian E Morley and Geoffrey M Stephenson. 1969. INTERPERSONAL AND INTER-PARTY EXCHANGE: A LABORATORY SIMULATION OF AN INDUSTRIAL NEGOTIATION AT THE PLANT LEVEL. British Journal of Psychology 60, 4 (1969), 543--545.",
      "doi": ""
    },
    {
      "text": "Kristine L Nowak and Frank Biocca. 2003. The effect of the agency and anthropomorphism on users' sense of telepresence, copresence, and social presence in virtual environments. Presence: Teleoperators and Virtual Environments 12, 5 (2003), 481--494.  ",
      "doi": "10.1162/105474603322761289"
    },
    {
      "text": "Brid O'Conaill, Steve Whittaker, and Sylvia Wilbur. 1993. Conversations over video conferences: An evaluation of the spoken aspects of video-mediated communication. Human-computer interaction 8, 4 (1993), 389--428.  ",
      "doi": "10.1207/s15327051hci0804_4"
    },
    {
      "text": "Oculus. 2016. Oculus Touch Tutorial. Oculus Store. (2016).",
      "doi": ""
    },
    {
      "text": "Gary M Olson and Judith S Olson. 2000. Distance matters. Human-computer interaction 15, 2 (2000), 139--178.  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Charles Egerton Osgood, George J Suci, and Percy H Tannenbaum. 1964. The measurement of meaning. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Tomislav Pejsa, Michael Gleicher, and Bilge Mutlu. 2017. Who, Me? How Virtual Agents Can Shape Conversational Footing in Virtual Reality. Springer International Publishing, Cham, 347--359.",
      "doi": ""
    },
    {
      "text": "Jan Richter, Bruce H Thomas, Maki Sugimoto, and Masahiko Inami. 2007. Remote active tangible interactions. In Proceedings of the 1st international conference on Tangible and embedded interaction. ACM, 39--42.  ",
      "doi": "10.1145/1226969.1226977"
    },
    {
      "text": "Abigail J Sellen. 1995. Remote conversations: The effects of mediating talk with technology. Human-computer interaction 10, 4 (1995), 401--444.  ",
      "doi": "10.1207/s15327051hci1004_2"
    },
    {
      "text": "John Short, Ederyn Williams, and Bruce Christie. 1976. The social psychology of telecommunications. (1976).",
      "doi": ""
    },
    {
      "text": "Linda Tickle-Degnen and Robert Rosenthal. 1990. The nature of rapport and its nonverbal correlates. Psychological inquiry 1, 4 (1990), 285--293.",
      "doi": ""
    },
    {
      "text": "P. Waxer. 1977. Nonverbal Cues for Anxiety: An Examination of Emotional Leakage. Journal of Abnormal Psychology 86, 3 (1977), 306--314.",
      "doi": ""
    },
    {
      "text": "Steve Whittaker. 2003. Theories and methods in mediated communication. The handbook of discourse processes (2003), 243--286.",
      "doi": ""
    },
    {
      "text": "Steve Whittaker, Erik Geelhoed, and Elizabeth Robinson. 1993. Shared workspaces: how do they work and when are they useful? International Journal of Man-Machine Studies 39, 5 (1993), 813--842.  ",
      "doi": "10.1006/imms.1993.1085"
    }
  ]
}