{
  "doi": "10.1145/3544548.3582074",
  "title": "Participation and Division of Labor in User-Driven Algorithm Audits: How Do Everyday Users Work together to Surface Algorithmic Harms?",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Recent years have witnessed an interesting phenomenon in which users come together to interrogate potentially harmful algorithmic behaviors they encounter in their everyday lives. Researchers have started to develop theoretical and empirical understandings of these user-driven audits, with a hope to harness the power of users in detecting harmful machine behaviors. However, little is known about users’ participation and their division of labor in these audits, which are essential to support these collective efforts in the future. Through collecting and analyzing 17,984 tweets from four recent cases of user-driven audits, we shed light on patterns of users’ participation and engagement, especially with the top contributors in each case. We also identified the various roles users’ generated content played in these audits, including hypothesizing, data collection, amplification, contextualization, and escalation. We discuss implications for designing tools to support user-driven audits and users who labor to raise awareness of algorithm bias.",
  "authors": [
    {
      "name": "Rena Li",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783468",
      "orcid": "0000-0002-8380-7912"
    },
    {
      "name": "Sara Kingsley",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659680751",
      "orcid": "0000-0001-9150-368X"
    },
    {
      "name": "Chelsea Fan",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783883",
      "orcid": "0000-0002-8315-4501"
    },
    {
      "name": "Proteeti Sinha",
      "institution": "School of Computer Science, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660642885",
      "orcid": "0000-0003-3691-6400"
    },
    {
      "name": "Nora Wai",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782211",
      "orcid": "0000-0001-6305-0716"
    },
    {
      "name": "Jaimie Lee",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780863",
      "orcid": "0000-0002-8615-9041"
    },
    {
      "name": "Hong Shen",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659589829",
      "orcid": "0000-0002-5364-3718"
    },
    {
      "name": "Motahhare Eslami",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959132657",
      "orcid": "0000-0002-1499-3045"
    },
    {
      "name": "Jason Hong",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. \"Apple Card launches today for all US customers\". https://www.apple.com/newsroom/2019/08/apple-card-launches-today-for-all-us-customers/",
      "doi": ""
    },
    {
      "text": "2020. Twitter investigates racial bias in image previews. BBC News (Sep 2020). https://www.bbc.com/news/technology-54234822",
      "doi": ""
    },
    {
      "text": "Parag Agrawal and Dantley Davis. 2020. Transparency around image cropping and changes to come. Twitter (2020). https://blog.twitter.com/en_us/topics/product/2020/transparency-image-cropping.html",
      "doi": ""
    },
    {
      "text": "Mike Ananny and Kate Crawford. 2018. Seeing without knowing: Limitations of the transparency ideal and its application to algorithmic accountability. new media & society 20, 3 (2018), 973–989.",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett, Cole Gleason, Morgan Klaus Scheuerman, Jeffrey P Bigham, Anhong Guo, and Alexandra To. 2021. “It’s Complicated”: Negotiating Accessibility and (Mis) Representation in Image Descriptions of Race, Gender, and Disability. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445498"
    },
    {
      "text": "Reuben Binns, Max Van Kleek, Michael Veale, Ulrik Lyngs, Jun Zhao, and Nigel Shadbolt. 2018. ’It’s Reducing a Human Being to a Percentage’; Perceptions of Justice in Algorithmic Decisions. CoRR abs/1801.10408(2018). arxiv:1801.10408http://arxiv.org/abs/1801.10408",
      "doi": ""
    },
    {
      "text": "Tolga Bolukbasi, Kai-Wei Chang, James Y Zou, Venkatesh Saligrama, and Adam T Kalai. 2016. Man is to computer programmer as woman is to homemaker? debiasing word embeddings. Advances in neural information processing systems 29 (2016), 4349–4357.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Anna Brown, Alexandra Chouldechova, Emily Putnam-Hornstein, Andrew Tobin, and Rhema Vaithianathan. 2019. Toward algorithmic accountability in public services: A qualitative study of affected community perspectives on algorithmic decision-making in child welfare services. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300271"
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. In FAT.",
      "doi": ""
    },
    {
      "text": "Ángel Alexander Cabrera, Abraham J Druck, Jason I Hong, and Adam Perer. 2021. Discovering and validating ai errors with crowdsourced failure reports. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–22.",
      "doi": "10.1145/3479569"
    },
    {
      "text": "Nolan L Cabrera, Cheryl E Matias, and Roberto Montoya. 2017. Activism or slacktivism? The potential and pitfalls of social media in contemporary student activism.Journal of Diversity in Higher Education 10, 4 (2017), 400.",
      "doi": ""
    },
    {
      "text": "Zhilong Chen, Hancheng Cao, Fengli Xu, Mengjie Cheng, Tao Wang, and Yong Li. 2020. Understanding the Role of Intermediaries in Online Social E-commerce: An Exploratory Study of Beidian. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24.",
      "doi": "10.1145/3415185"
    },
    {
      "text": "Myoung-Gi Chon and Hyojung Park. 2020. Social media activism in the digital age: Testing an integrative model of activism on contentious issues. Journalism & Mass Communication Quarterly 97, 1 (2020), 72–97.",
      "doi": ""
    },
    {
      "text": "Rumman Chowdhury and Jutta Williams. 2021. Introducing Twitter’s first algorithmic bias bounty challenge. Twitter (2021). https://blog.twitter.com/engineering/en_us/topics/insights/2021/algorithmic-bias-bounty-challenge",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popović, 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (2010), 756–760.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock, Inioluwa Deborah Raji, and Joy Buolamwini. 2022. Who Audits the Auditors? Recommendations from a Field Scan of the Algorithmic Auditing Ecosystem. In 2022 ACM Conference on Fairness, Accountability, and Transparency (Seoul, Republic of Korea) (FAccT ’22). Association for Computing Machinery, New York, NY, USA, 1571–1583. https://doi.org/10.1145/3531146.3533213",
      "doi": "10.1145/3531146.3533213"
    },
    {
      "text": "Justin Cranshaw and Aniket Kittur. 2011. The polymath project: lessons from a successful online collaboration in mathematics. In Proceedings of the SIGCHI conference on human factors in computing systems. 1865–1874.",
      "doi": "10.1145/1978942.1979213"
    },
    {
      "text": "Kate Crawford and Trevor Paglen. 2021. Excavating AI: The politics of images in machine learning training sets. AI & SOCIETY (2021), 1–12.",
      "doi": ""
    },
    {
      "text": "Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. 2009. ImageNet: A large-scale hierarchical image database. In 2009 IEEE conference on computer vision and pattern recognition. IEEE, 248–255.",
      "doi": ""
    },
    {
      "text": "Michael A. DeVito, Jeremy Birnholtz, Jeffery T. Hancock, Megan French, and Sunny Liu. 2018. How People Form Folk Theories of Social Media Feeds and What It Means for How We Study Self-Presentation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173694",
      "doi": "10.1145/3173574.3173694"
    },
    {
      "text": "Michael A DeVito, Darren Gergle, and Jeremy Birnholtz. 2017. \" Algorithms ruin everything\" # RIPTwitter, Folk Theories, and Resistance to Algorithmic Change in Social Media. In Proceedings of the 2017 CHI conference on human factors in computing systems. 3163–3174.",
      "doi": "10.1145/3025453.3025659"
    },
    {
      "text": "Alicia DeVos, Aditi Dhabalia, Hong Shen, Kenneth Holstein, and Motahhare Eslami. 2022. Toward User-Driven Algorithm Auditing: Investigating users’ strategies for uncovering harmful algorithmic behavior. In CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3491102.3517441"
    },
    {
      "text": "John Downey and Natalie Fenton. 2003. New media, counter publicity and the public sphere. New media & society 5, 2 (2003), 185–202.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I\" like\" it, then I hide it: Folk Theories of Social Feeds. In Proceedings of the 2016 cHI conference on human factors in computing systems. 2371–2382.",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. \" I always assumed that I wasn’t really that close to [her]\" Reasoning about Invisible Algorithms in News Feeds. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 153–162.",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Motahhare Eslami, Kristen Vaccaro, Karrie Karahalios, and Kevin Hamilton. 2017. “Be careful; things can be worse than they appear”: Understanding Biased Algorithms and Users’ Behavior around Them in Rating Platforms. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 11.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Kristen Vaccaro, Min Kyung Lee, Amit Elazari Bar On, Eric Gilbert, and Karrie Karahalios. 2019. User attitudes towards algorithmic opacity and transparency in online reviewing platforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300724"
    },
    {
      "text": "Casey Fiesler and Nicholas Proferes. 2018. “Participant” perceptions of Twitter Research Ethics. Social Media + Society 4, 1 (2018), 205630511876336. https://doi.org/10.1177/2056305118763366",
      "doi": ""
    },
    {
      "text": "Kristie Fisher, Scott Counts, and Aniket Kittur. 2012. Distributed sensemaking: Improving sensemaking by leveraging the efforts of previous users. In Proceedings of the 2012 CHI Conference on Human Factors in Computing Systems. 247–256.",
      "doi": "10.1145/2207676.2207711"
    },
    {
      "text": "Nancy Fraser. 2021. Rethinking the public sphere: A contribution to the critique of actually existing democracy. In Public Space Reader. Routledge, 34–41.",
      "doi": ""
    },
    {
      "text": "Orit Gat. 2019. \"How AI Selfie App ImageNet Roulette Took the Internet by Storm\". (2019). https://www.frieze.com/article/how-ai-selfie-app-imagenet-roulette-took-internet-storm",
      "doi": ""
    },
    {
      "text": "R Stuart Geiger and Aaron Halfaker. 2013. Using edit sessions to measure participation in Wikipedia. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work. 861–870.",
      "doi": "10.1145/2441776.2441873"
    },
    {
      "text": "Susan A Gelman and Cristine H Legare. 2011. Concepts and folk theories. Annual review of anthropology 40 (2011), 379–398.",
      "doi": ""
    },
    {
      "text": "Carol Gilligan. 1993. In a different voice: Psychological theory and women’s development. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Nina Grgic-Hlaca, Elissa M. Redmiles, Krishna P. Gummadi, and Adrian Weller. 2018. Human Perceptions of Fairness in Algorithmic Decision Making: A Case Study of Criminal Risk Prediction. (2018), 903–912. https://doi.org/10.1145/3178876.3186138",
      "doi": "10.1145/3178876.3186138"
    },
    {
      "text": "Gabriel Grill and Nazanin Andalibi. 2022. Attitudes and Folk Theories of Data Subjects on Transparency and Accuracy in Emotion Recognition. Proc. ACM Hum.-Comput. Interact. 6, CSCW1, Article 78 (apr 2022), 35 pages. https://doi.org/10.1145/3512925",
      "doi": "10.1145/3512925"
    },
    {
      "text": "Aaron Halfaker and R Stuart Geiger. 2020. Ores: Lowering barriers with participatory machine learning in wikipedia. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–37.",
      "doi": "10.1145/3415219"
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, and John Riedl. 2011. Don’t bite the newbies: How reverts affect the quantity and quality of Wikipedia work. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration. 163–172.",
      "doi": "10.1145/2038558.2038585"
    },
    {
      "text": "Aniko Hannak, Gary Soeller, David Lazer, Alan Mislove, and Christo Wilson. 2014. Measuring price discrimination and steering on e-commerce web sites. In Proceedings of the 2014 Conference on Internet Measurement Conference. 305–318.",
      "doi": "10.1145/2663716.2663744"
    },
    {
      "text": "Alex Hern. 2020. Twitter apologises for ’racist’ image-cropping algorithm. The Guardian (Sept. 2020). https://www.theguardian.com/technology/2020/sep/21/twitter-apologises-for-racist-image-cropping-algorithm",
      "doi": ""
    },
    {
      "text": "Khari Johnson. 2020. Apparent racial bias found in Twitter photo algorithm. VentureBeat (Sep 2020). https://venturebeat.com/2020/09/20/apparent-racial-bias-found-in-twitter-photo-algorithm/",
      "doi": ""
    },
    {
      "text": "Nadia Karizat, Dan Delmonaco, Motahhare Eslami, and Nazanin Andalibi. 2021. Algorithmic Folk Theories and Identity: How TikTok Users Co-Produce Knowledge of Identity and Engage in Algorithmic Resistance. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 305 (oct 2021), 44 pages. https://doi.org/10.1145/3476046",
      "doi": "10.1145/3476046"
    },
    {
      "text": "Sara Kingsley, Proteeti Sinha, Clara Wang, Motahhare Eslami, and Jason I. Hong. 2022. \"Give Everybody [..] a Little Bit More Equity\": Content Creator Perspectives and Responses to the Algorithmic Demonetization of Content Associated with Disadvantaged Groups. Proc. ACM Hum.-Comput. Interact. 6, CSCW2, Article 424 (nov 2022), 37 pages. https://doi.org/10.1145/3555149",
      "doi": "10.1145/3555149"
    },
    {
      "text": "Sara Kingsley, Clara Wang, Alex Mikhalenko, Proteeti Sinha, and Chinmay Kulkarni. 2020. Auditing Digital Platforms for Discrimination in Economic Opportunity Advertising. https://doi.org/10.48550/ARXIV.2008.09656",
      "doi": ""
    },
    {
      "text": "Shamika Klassen. 2022. Black Twitter is Gold: Why This Online Community is Worthy of Study and How to Do so Respectfully. Interactions 29, 1 (jan 2022), 96–98. https://doi.org/10.1145/3505681",
      "doi": "10.1145/3505681"
    },
    {
      "text": "Will Knight. 2019. \"The Apple Card Didn’t ’See’ Gender—and That’s the Problem\". (2019). https://www.wired.com/story/the-apple-card-didnt-see-genderand-thats-the-problem/",
      "doi": ""
    },
    {
      "text": "Irene Font Peradejordi Kyra Yee. 2021. \"Sharing learnings from the first algorithmic bias bounty challenge\". Twitter (2021). https://blog.twitter.com/engineering/en_us/topics/insights/2021/learnings-from-the-first-algorithmic-bias-bounty-challenge",
      "doi": ""
    },
    {
      "text": "Michelle S. Lam, Mitchell L. Gordon, Danaë Metaxa, Jeffrey T. Hancock, James A. Landay, and Michael S. Bernstein. 2022. End-User Audits: A System Empowering Communities to Lead Large-Scale Investigations of Harmful Algorithmic Behavior. Proc. ACM Hum.-Comput. Interact. 6, CSCW2, Article 512 (nov 2022), 34 pages. https://doi.org/10.1145/3555625",
      "doi": "10.1145/3555625"
    },
    {
      "text": "J Richard Landis and Gary G Koch. 1977. The measurement of observer agreement for categorical data. biometrics (1977), 159–174.",
      "doi": ""
    },
    {
      "text": "Yu-Hao Lee and Gary Hsieh. 2013. Does slacktivism hurt activism? The effects of moral balancing and consistency in online activism. In Proceedings of the SIGCHI conference on human factors in computing systems. 811–820.",
      "doi": "10.1145/2470654.2470770"
    },
    {
      "text": "Danaë Metaxa, Joon Sung Park, Ronald E Robertson, Karrie Karahalios, Christo Wilson, Jeff Hancock, Christian Sandvig, 2021. Auditing algorithms: Understanding algorithmic systems from the outside in. Foundations and Trends® in Human–Computer Interaction 14, 4(2021), 272–344.",
      "doi": ""
    },
    {
      "text": "Carolina Milanesi. 2021. \"The Apple Card’s new feature tackles one of credit’s biggest problems\". (2021). https://www.fastcompany.com/90627796/apple-card-apple-card-family-share-card-children",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of Oppression: How Search Engines Reinforce Racism. (2018). https://www.jstor.org/stable/j.ctt1pwt9w5",
      "doi": ""
    },
    {
      "text": "New York State Department of Financial Services. 2021. \"NYSDFS Report on Apple Card Investigation\". (2021). https://www.dfs.ny.gov/system/files/documents/2021/03/rpt_202103_apple_card_investigation.pdf",
      "doi": ""
    },
    {
      "text": "Parmy Olson. 2018. The algorithm that helped google translate become sexist. Forbes (Feb. 2018). https://www.forbes.com/sites/parmyolson/2018/02/15/the-algorithm-that-helped-google-translate-become-sexist/",
      "doi": ""
    },
    {
      "text": "Charles C. Ragin and Howard S. Becker. 1992. What is a case?: Exploring the foundations of social inquiry. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Inioluwa Deborah Raji and Joy Buolamwini. 2019. Actionable Auditing: Investigating the Impact of Publicly Naming Biased Performance Results of Commercial AI Products. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (Honolulu, HI, USA) (AIES ’19). Association for Computing Machinery, New York, NY, USA, 429–435. https://doi.org/10.1145/3306618.3314244",
      "doi": "10.1145/3306618.3314244"
    },
    {
      "text": "Brandon Reynante, Steven P Dow, and Narges Mahyar. 2021. A framework for open civic design: Integrating public participation, crowdsourcing, and design thinking. Digital Government: Research and Practice 2, 4 (2021), 1–22.",
      "doi": "10.1145/3487607"
    },
    {
      "text": "Ronald E. Robertson, Shan Jiang, Kenneth Joseph, Lisa Friedland, David Lazer, and Christo Wilson. 2018. Auditing Partisan Audience Bias within Google Search. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 148 (Nov. 2018), 22 pages. https://doi.org/10.1145/3274417",
      "doi": "10.1145/3274417"
    },
    {
      "text": "Dana Rotman, Sarah Vieweg, Sarita Yardi, Ed Chi, Jenny Preece, Ben Shneiderman, Peter Pirolli, and Tom Glaisyer. 2011. From slacktivism to activism: participatory culture in the age of social media. In CHI’11 Extended Abstracts on Human Factors in Computing Systems. 819–822.",
      "doi": "10.1145/1979742.1979543"
    },
    {
      "text": "Christina Ruiz. 2019. Leading online database to remove 600,000 images after art project reveals its racist bias. The Art Newspaper (2019), 23.",
      "doi": ""
    },
    {
      "text": "Christian Sandvig, Kevin Hamilton, Karrie Karahalios, and Cedric Langbort. 2014. Auditing algorithms: Research methods for detecting discrimination on internet platforms. Data and discrimination: converting critical concerns into productive inquiry 22(2014), 4349–4357.",
      "doi": ""
    },
    {
      "text": "James C Scott. 1985. Weapons of the weak: Everyday forms of peasant resistance. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Hong Shen, Alicia DeVos, Motahhare Eslami, and Kenneth Holstein. 2021. Everyday Algorithm Auditing: Understanding the Power of Everyday Users in Surfacing Harmful Algorithmic Behaviors. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 433 (oct 2021), 29 pages. https://doi.org/10.1145/3479577",
      "doi": "10.1145/3479577"
    },
    {
      "text": "Stefan Stieglitz and Linh Dang-Xuan. 2013. Emotions and information diffusion in social media—sentiment of microblogs and sharing behavior. Journal of management information systems 29, 4 (2013), 217–248.",
      "doi": ""
    },
    {
      "text": "Latanya Sweeney. 2013. Discrimination in online ad delivery. Commun. ACM 56, 5 (2013), 44–54.",
      "doi": "10.1145/2447976.2447990"
    },
    {
      "text": "Niels van Berkel, Jorge Goncalves, Danula Hettiachchi, Senuri Wijenayake, Ryan M. Kelly, and Vassilis Kostakos. 2019. Crowdsourcing Perceptions of Fair Predictors for Machine Learning: A Recidivism Case Study. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 28 (Nov. 2019), 21 pages. https://doi.org/10.1145/3359130",
      "doi": "10.1145/3359130"
    },
    {
      "text": "Neil Vigdor. 2019. Apple Card Investigated After Gender Discrimination Complaints. (2019). https://www.nytimes.com/2019/11/10/business/Apple-credit-card-investigation.html",
      "doi": ""
    },
    {
      "text": "Luis Von Ahn and Laura Dabbish. 2004. Labeling images with a computer game. In Proceedings of the SIGCHI conference on Human factors in computing systems. 319–326.",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Karl E Weick. 1995. Sensemaking in organizations. Vol. 3. Sage.",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sarah E. Fox, Steven Rousso-Schindler, and Jeffrey Warshaw. 2018. A Qualitative Exploration of Perceptions of Algorithmic Fairness. (2018), 1–14. https://doi.org/10.1145/3173574.3174230",
      "doi": "10.1145/3173574.3174230"
    },
    {
      "text": "Yuxi Wu, W Keith Edwards, and Sauvik Das. 2022. “A Reasonable Thing to Ask For”: Towards a Unified Voice in Privacy Collective Action. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": ""
    },
    {
      "text": "Kyra Yee, Uthaipon Tantipongpipat, and Shubhanshu Mishra. 2021. Image Cropping on Twitter: Fairness Metrics, Their Limitations, and the Importance of Representation, Design, and Agency. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 450 (oct 2021), 24 pages. https://doi.org/10.1145/3479594",
      "doi": "10.1145/3479594"
    },
    {
      "text": "Cat Zakrzewski. 2021. The Technology 202: Democrats introduce legislation prohibiting algorithmic discrimination. The Washington Post (2021).",
      "doi": ""
    }
  ]
}