{
  "doi": "10.1145/3544548.3581436",
  "title": "“What if everyone is able to program?” – Exploring the Role of Software Development in Science Fiction",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "For decades, research around emerging technologies has been inspired by science fiction and vice versa. While so far almost only the technologies themselves have been considered, we explore the underlying software development and programming approaches. We therefore conduct a detailed media content analysis of twenty-seven movies that examines the role of software development in science fiction by identifying and investigating new approaches to programming and how software development is conceptualized portrayed within science fiction scenes. With the additional analysis of eighteen design fiction stories exploring the scenario “What if everyone is able to program?”, we envision potential impacts of the democratization of software development on business and society. Our study opens new discussions and perspectives, by investigating the current vision of the future of programming and uncovers new approaches to software development which can serve as a starting point for further research in the HCI community.",
  "tags": [
    "Design Fiction",
    "Science Fiction",
    "End-User Development (EUD)",
    "Software Development",
    "Content Analysis"
  ],
  "authors": [
    {
      "name": "Kevin Krings",
      "institution": "Cyber-Physical Systems, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659770083",
      "orcid": "0000-0002-8772-6132"
    },
    {
      "name": "Nino S. Bohn",
      "institution": "Cyber-Physical-Systems, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659753404",
      "orcid": "0000-0002-2988-2954"
    },
    {
      "name": "Nora Anna Luise Hille",
      "institution": "Cyber-Physical Systems, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778546",
      "orcid": "0000-0002-9843-6173"
    },
    {
      "name": "Thomas Ludwig",
      "institution": "Cyber-Physical Systems, University of Siegen, Germany",
      "img": "/do/10.1145/contrib-99658655780/rel-imgonly/thomas_ludwig.jpg",
      "acmid": "99658655780",
      "orcid": "0000-0003-4020-6321"
    }
  ],
  "references": [
    {
      "text": "Ulrike Abelein, Helen Sharp, and Barbara Paech. 2013. Does Involving Users in Software Development Really Influence System Success? IEEE Software 30, 6: 17–23. https://doi.org/10.1109/MS.2013.124",
      "doi": "10.1109/MS.2013.124"
    },
    {
      "text": "Reinhold Achatz. 2006. Optimization of Software Development. In Proceedings of the 28th international conference on Software engineering.",
      "doi": "10.1145/1134285.1134289"
    },
    {
      "text": "Vincenzo Ambriola, Paolo Ciancarini, Andrea Corradini, and Nicoletta DeFrancesco. 1991. Towards innovative software engineering environments. Journal of Systems and Software 14, 1: 17–29. https://doi.org/10.1016/0164-1212(91)90085-K",
      "doi": "10.1016/0164-1212%2891%2990085-K"
    },
    {
      "text": "Markus Appel, Stefan Krause, Uli Gleich, and Martina Mara. 2016. Meaning through fiction: Science fiction and innovative technologies. Psychology of Aesthetics, Creativity, and the Arts 10, 4: 472–480. https://doi.org/10.1037/aca0000052",
      "doi": ""
    },
    {
      "text": "Benett Axtell and Cosmin Munteanu. 2021. Tea, Earl Grey, Hot: Designing Speech Interactions from the Imagined Ideal of Star Trek. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3411764.3445640",
      "doi": "10.1145/3411764.3445640"
    },
    {
      "text": "John Backus. 1978. The history of Fortran I, II, and III. ACM SIGPLAN Notices 13, 8: 165–180. https://doi.org/10.1145/960118.808380",
      "doi": "10.1145/960118.808380"
    },
    {
      "text": "Gillian Bain and Ian Barnes. 2014. Why is programming so hard to learn? In Proceedings of the 2014 conference on Innovation & technology in computer science education - ITiCSE ’14, 356–356. https://doi.org/10.1145/2591708.2602675",
      "doi": "10.1145/2591708.2602675"
    },
    {
      "text": "Titus Barik, Rahul Pandita, Justin Middleton, and Emerson Murphy-Hill. 2016. Designing for dystopia: software engineering research for the post-apocalypse. In Proceedings of the 2016 24th ACM SIGSOFT International Symposium on Foundations of Software Engineering, 924–927. https://doi.org/10.1145/2950290.2983986",
      "doi": "10.1145/2950290.2983986"
    },
    {
      "text": "Rebecca Bates, Judy Goldsmith, Rosalyn Berne, Valerie Summet, and Nanette Veilleux. 2012. Science fiction in computer science education. In SIGCSE’12 - Proceedings of the 43rd ACM Technical Symposium on Computer Science Education, 161–162. https://doi.org/10.1145/2157136.2157184",
      "doi": "10.1145/2157136.2157184"
    },
    {
      "text": "Francesco Benzi and Daniela Fogli. 2015. The Role of Gamification in End-User Development. In CoPDA@ IS-EUD, 32–38.",
      "doi": ""
    },
    {
      "text": "Alan F. Blackwell. 2017. End-User Developers – What Are They Like? In New Perspectives in End-User Development, Fabio Paternò and Volker Wulf (eds.). Springer International Publishing, Cham, 121–135. https://doi.org/10.1007/978-3-319-60291-2_6",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Robert L. Brennan and Dale J. Prediger. 1981. Coefficient Kappa: Some Uses, Misuses, and Alternatives. Educational and Psychological Measurement 41, 3: 687–699. https://doi.org/10.1177/001316448104100307",
      "doi": ""
    },
    {
      "text": "Damien Brun, Philipp Jordan, and Jonna Hakkila. 2021. Demonstrating a Memory Orb — Cylindrical Device Inspired by Science Fiction. In 20th International Conference on Mobile and Ubiquitous Multimedia, 239–241. https://doi.org/10.1145/3490632.3497873",
      "doi": "10.1145/3490632.3497873"
    },
    {
      "text": "Felix Carros, Isabel Schwaninger, Adrian Preussner, Dave Randall, Rainer Wieching, Geraldine Fitzpatrick, and Volker Wulf. 2022. Care Workers Making Use of Robots: Results of a Three-Month Study on Human-Robot Interaction within a Care Home. In CHI Conference on Human Factors in Computing Systems, 1–15. https://doi.org/10.1145/3491102.3517435",
      "doi": "10.1145/3491102.3517435"
    },
    {
      "text": "Yu-Ting Cheng, Guo-Ling Tsai, Heng-An Lin, Yi-Ching Huang, Rung Huei Liang, and Lin-Lin Chen. 2019. Call Me by My Name. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems, 1–6. https://doi.org/10.1145/3290607.3313074",
      "doi": "10.1145/3290607.3313074"
    },
    {
      "text": "Victor Cheung and Alissa N. Antle. 2020. Tangible Interfaces and Interactions in Sci-Fi Movies. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction, 393–401. https://doi.org/10.1145/3374920.3374942",
      "doi": "10.1145/3374920.3374942"
    },
    {
      "text": "Yu-Kai Chou. 2014. Actionable gamification. Beyond Points, Badges, and Leaderboards.",
      "doi": ""
    },
    {
      "text": "K. R. Chowdhary. 2020. On the Evolution of Programming Languages. ArXiv abs/2007.0. Retrieved from http://arxiv.org/abs/2007.02699",
      "doi": ""
    },
    {
      "text": "Nicholas S. Dalton, Rebecca Moreau, and Ross K. Adams. 2016. Resistance is Fertile. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, 365–374. https://doi.org/10.1145/2851581.2892572",
      "doi": "10.1145/2851581.2892572"
    },
    {
      "text": "Yvonne Dittrich, Christian Bo Michelsen, Paolo Tell, Pernille Lous, and Allan Ebdrup. 2020. Exploring the evolution of software practices. In Proceedings of the 28th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering, 493–504. https://doi.org/10.1145/3368089.3409766",
      "doi": "10.1145/3368089.3409766"
    },
    {
      "text": "Paul Dourish. 2003. The Appropriation of Interactive Technologies: Some Lessons from Placeless Documents. Computer Supported Cooperative Work (CSCW) 12, 4: 465–490. https://doi.org/10.1023/A:1026149119426",
      "doi": "10.1023/A%3A1026149119426"
    },
    {
      "text": "Phan Minh Dung. 1995. On the acceptability of arguments and its fundamental role in nonmonotonic reasoning, logic programming and n-person games. Artificial Intelligence 77, 2: 321–357. https://doi.org/10.1016/0004-3702(94)00041-X",
      "doi": "10.1016/0004-3702%2894%2900041-X"
    },
    {
      "text": "Tore Dyba and Torgeir Dingsoyr. 2009. What Do We Know about Agile Software Development? IEEE Software 26, 5: 6–9. https://doi.org/10.1109/MS.2009.145",
      "doi": "10.1109/MS.2009.145"
    },
    {
      "text": "Hakan Erdogmus, Nenad Medvidovic, and Frances Paulisch. 2018. 50 Years of Software Engineering. IEEE Software 35, 5: 20–24. https://doi.org/10.1109/MS.2018.3571240",
      "doi": ""
    },
    {
      "text": "Katrina Falkner, Claudia Szabo, Rebecca Vivian, and Nickolas Falkner. 2015. Evolution of Software Development Strategies. https://doi.org/10.1109/ICSE.2015.153",
      "doi": ""
    },
    {
      "text": "Ylva Fernaeus and Jakob Tholander. 2006. Finding design qualities in a tangible programming space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 447–456. https://doi.org/10.1145/1124772.1124839",
      "doi": "10.1145/1124772.1124839"
    },
    {
      "text": "Edgardo Ferretti, Marcelo L. Errecalde, Alejandro J. García, and Guillermo R. Simari. 2014. A possibilistic defeasible logic programming approach to argumentation-based decision-making. Journal of Experimental & Theoretical Artificial Intelligence 26, 4: 519–550. https://doi.org/10.1080/0952813X.2014.921733",
      "doi": ""
    },
    {
      "text": "Corinne Gendron, Silvester Ivanaj, Bernard Girard, and Marie-Luc Arpin. 2017. Science-fiction literature as inspiration for social theorizing within sustainability research. Journal of Cleaner Production 164: 1553–1562. https://doi.org/10.1016/j.jclepro.2017.07.044",
      "doi": ""
    },
    {
      "text": "GitHub. GitHub Copilot. Retrieved from https://github.com/features/copilot/",
      "doi": ""
    },
    {
      "text": "Judy Goldsmith and Nicholas Mattei. 2014. Fiction as an Introduction to Computer Science Research. ACM Transactions on Computing Education 14, 1: 1–14. https://doi.org/10.1145/2576873",
      "doi": "10.1145/2576873"
    },
    {
      "text": "Ruthanna Gordon. 2009. Learning From Fiction: Applications in Emerging Technologies. Bulletin of Science, Technology & Society 29, 6: 470–475. https://doi.org/10.1177/0270467609349054",
      "doi": ""
    },
    {
      "text": "Thomas F. Gordon, Horst Friedrich, and Douglas Walton. 2018. Representing argumentation schemes with Constraint Handling Rules (CHR). Argument & Computation 9, 2: 91–119. https://doi.org/10.3233/AAC-180039",
      "doi": ""
    },
    {
      "text": "Loretta Rose Guarino. 1978. The Evolution of Abstraction in Programming Languages.",
      "doi": ""
    },
    {
      "text": "Ilyena Hirskyj-Douglas, Roosa Piitulainen, and Andrés Lucero. 2021. Forming the Dog Internet. Proceedings of the ACM on Human-Computer Interaction 5, ISS: 1–20. https://doi.org/10.1145/3488539",
      "doi": "10.1145/3488539"
    },
    {
      "text": "Philipp Jordan. 2018. Science Fiction in HCI-A nuanced view. ACM IX Blogs. Ed. by Gilbert Cockton.",
      "doi": ""
    },
    {
      "text": "Philipp Jordan and Brent Auernheimer. 2018. The Fiction in Computer Science: A Qualitative Data Analysis of the ACM Digital Library for Traces of Star Trek. In Advances in Intelligent Systems and Computing. Springer Verlag, 508–520. https://doi.org/10.1007/978-3-319-60492-3_48",
      "doi": ""
    },
    {
      "text": "Philipp Jordan, Omar Mubin, Mohammad Obaid, and Paula Alexandra Silva. 2018. Exploring the referral and usage of science fiction in HCI literature. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 19–38. https://doi.org/10.1007/978-3-319-91803-7_2",
      "doi": "10.1007/978-3-319-91803-7_2"
    },
    {
      "text": "Philipp Jordan, Omar Mubin, and Paula Alexandra Silva. 2016. A Conceptual Research Agenda and Quantification Framework for the Relationship Between Science-Fiction Media and Human-Computer Interaction. In Communications in Computer and Information Science. Springer Verlag, 52–57. https://doi.org/10.1007/978-3-319-40548-3_9",
      "doi": ""
    },
    {
      "text": "Philipp Jordan and Paula Alexandra Silva. 2019. Building an Argument for the Use of Science Fiction in HCI Education. In Advances in Intelligent Systems and Computing. Springer Verlag, 846–851. https://doi.org/10.1007/978-3-030-11051-2_129",
      "doi": ""
    },
    {
      "text": "Philipp Jordan and Paula Alexandra Silva. 2021. Science Fiction—An Untapped Opportunity in HCI Research and Education. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Springer Science and Business Media Deutschland GmbH, 34–47. https://doi.org/10.1007/978-3-030-78221-4_3",
      "doi": "10.1007/978-3-030-78221-4_3"
    },
    {
      "text": "K. Kakas. 1999. Computing argumentation in logic programming. Journal of Logic and Computation 9, 4: 515–562. https://doi.org/10.1093/logcom/9.4.515",
      "doi": ""
    },
    {
      "text": "Murata Kiyoshi, A. Adams Andrew, Fukuta Yasunori, Orito Yohko, Arias-Oliva Mario, and Pelegrin-Borondo Jorge. 2017. From a Science Fiction to the Reality. The ORBIT Journal 1, 2: 1–15. https://doi.org/10.29297/orbit.v1i2.42",
      "doi": ""
    },
    {
      "text": "Amy J. Ko, Brad A. Myers, and Htet Htet Aung. 2004. Six Learning Barriers in End-User Programming Systems. In 2004 IEEE Symposium on Visual Languages - Human Centric Computing, 199–206. https://doi.org/10.1109/VLHCC.2004.47",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "Tadayoshi Kohno and Brian David Johnson. 2011. Science fiction prototyping and security education: Cultivating contextual and societal thinking in computer security education and beyond. In SIGCSE’11 - Proceedings of the 42nd ACM Technical Symposium on Computer Science Education, 9–14. https://doi.org/10.1145/1953163.1953173",
      "doi": "10.1145/1953163.1953173"
    },
    {
      "text": "Bowen Kong, Rung-Huei Liang, MengChi Liu, Shu-Hsiang Chang, Hsiu-Chen Tseng, and Chian-Huei Ju. 2021. Neuromancer Workshop: Towards Designing Experiential Entanglement with Science Fiction. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21). https://doi.org/10.1145/3411764.3445273",
      "doi": "10.1145/3411764.3445273"
    },
    {
      "text": "Veronika Krauß, Alexander Boden, Leif Oppermann, and René Reiners. 2021. Current Practices, Challenges, and Design Implications for Collaborative AR/VR Application Development. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–15. https://doi.org/10.1145/3411764.3445335",
      "doi": "10.1145/3411764.3445335"
    },
    {
      "text": "Kevin Krings, Philip Weber, Florian Jasche, and Thomas Ludwig. 2022. FADER: An Authoring Tool for Creating Augmented Reality-Based Avatars from an End-User Perspective. In Mensch und Computer 2022, 52–65. https://doi.org/10.1145/3543758.3543778",
      "doi": "10.1145/3543758.3543778"
    },
    {
      "text": "Michael Laakasuo, Marianna Drosinou, Mika Koverola, Anton Kunnari, Juho Halonen, Noora Lehtonen, and Jussi Palomäki. 2018. What makes people approve or condemn mind upload technology? Untangling the effects of sexual disgust, purity and science fiction familiarity. Palgrave Communications 4, 1: 1–14. https://doi.org/10.1057/s41599-018-0124-6",
      "doi": ""
    },
    {
      "text": "Shaun Lawson, Ben Kirman, and Conor Linehan. 2016. Power, participation, and the dog internet. Interactions 23, 4: 37–41. https://doi.org/10.1145/2942442",
      "doi": "10.1145/2942442"
    },
    {
      "text": "Lik-Hang Lee, Tristan Braud, Pengyuan Zhou, Lin Wang, Dianlei Xu, Zijun Lin, Abhishek Kumar, Carlos Bermejo, and Pan Hui. 2021. All One Needs to Know about Metaverse: A Complete Survey on Technological Singularity, Virtual Ecosystem, and Research Agenda. Retrieved from http://arxiv.org/abs/2110.05352",
      "doi": ""
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, Markus Klann, and Volker Wulf. 2006. End-User Development: An Emerging Paradigm. In End User Development, Henry Lieberman, Fabio Paternò and Volker Wulf (eds.). Springer Netherlands, Dordrecht, 1–8. https://doi.org/10.1007/1-4020-5386-X_1",
      "doi": ""
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2016. Pushing the Limits of Design Fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 4032–4043. https://doi.org/10.1145/2858036.2858446",
      "doi": "10.1145/2858036.2858446"
    },
    {
      "text": "Dapeng Liu, Shaochun Xu, and Wencai Du. 2011. Case Study on Incremental Software Development. In 2011 Ninth International Conference on Software Engineering Research, Management and Applications, 227–234. https://doi.org/10.1109/SERA.2011.43",
      "doi": "10.1109/SERA.2011.43"
    },
    {
      "text": "Thomas Ludwig, Julian Dax, Volkmar Pipek, and Volker Wulf. 2017. A Practice-Oriented Paradigm for End-User Development. In New Perspectives in End-User Development, Fabio Paternò and Volker Wulf (eds.). Springer International Publishing, Cham, 23–41. https://doi.org/10.1007/978-3-319-60291-2_2",
      "doi": ""
    },
    {
      "text": "Thomas Ludwig, Volkmar Pipek, and Peter Tolmie. 2018. Designing for Collaborative Infrastructuring: Supporting Resonance Activities. Proceedings of the ACM on Human-Computer Interaction - CSCW Volume 2, CSCW: 113.",
      "doi": "10.1145/3274382"
    },
    {
      "text": "Thomas Ludwig, Oliver Stickel, Alexander Boden, and Volkmar Pipek. 2014. Towards sociable technologies. In Proceedings of the 2014 conference on Designing interactive systems, 835–844. https://doi.org/10.1145/2598510.2598528",
      "doi": "10.1145/2598510.2598528"
    },
    {
      "text": "Allan MacLean, Kathleen Carter, Lennart Lövstrand, and Thomas Moran. 1990. User-tailorable systems: pressing the issues with buttons. In Proceedings of the SIGCHI conference on Human factors in computing systems Empowering people - CHI ’90 (Human factors in computing systems), 175–182. https://doi.org/10.1145/97243.97271",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "Camillia Matuk, Talia Hurwich, and Anna Amato. 2019. How Science Fiction Worldbuilding Supports Students’ Scientific Explanation. In Proceedings of FabLearn 2019. Retrieved September 16, 2022 from https://doi.org/10.1145/3311890.3311925",
      "doi": "10.1145/3311890.3311925"
    },
    {
      "text": "Philipp Mayring. 2019. Qualitative content analysis: Demarcation, varieties, developments. Forum Qualitative Sozialforschung 20, 3. https://doi.org/10.17169/fqs-20.3.3343",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-rater Reliability in Qualitative Research. Proceedings of the ACM on Human-Computer Interaction 3, CSCW: 1–23. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Marjan Mernik and Viljem Žumer. 2005. Incremental programming language development. Computer Languages, Systems & Structures 31, 1: 1–16. https://doi.org/10.1016/j.cl.2004.02.001",
      "doi": "10.1016/j.cl.2004.02.001"
    },
    {
      "text": "Thomas Michaud. 2017. Innovation, Between Science and Science Fiction. Wiley. https://doi.org/10.1002/9781119427568",
      "doi": ""
    },
    {
      "text": "Colin Milburn. 2010. Modifiable Futures: Science Fiction at the Bench. Isis 101, 3: 560–569. https://doi.org/10.1086/655793",
      "doi": ""
    },
    {
      "text": "Clark A Miller and Ira Bennett. 2008. Thinking longer term about technology: is there value in science fiction-inspired approaches to constructing futures? Science and Public Policy 35, 8: 597–606. https://doi.org/10.3152/030234208X370666",
      "doi": ""
    },
    {
      "text": "George R. Milne, Begum Kaplan, Kristen L. Walker, and Larry Zacharias. 2021. Connecting with the future: The role of science fiction movies in helping consumers understand privacy‐technology trade‐offs. Journal of Consumer Affairs 55, 3: 737–762. https://doi.org/10.1111/joca.12366",
      "doi": ""
    },
    {
      "text": "Omar Mubin, Kewal Wadibhasme, Philipp Jordan, and Mohammad Obaid. 2019. Reflecting on the Presence of Science Fiction Robots in Computing Literature. ACM Transactions on Human-Robot Interaction 8, 1: 1–25. https://doi.org/10.1145/3303706",
      "doi": "10.1145/3303706"
    },
    {
      "text": "Gail C. Murphy. 2019. Beyond Integrated Development Environments: Adding Context to Software Development. In 2019 IEEE/ACM 41st International Conference on Software Engineering: New Ideas and Emerging Results (ICSE-NIER), 73–76. https://doi.org/10.1109/ICSE-NIER.2019.00027",
      "doi": "10.1109/ICSE-NIER.2019.00027"
    },
    {
      "text": "Helen Oliver. 2019. Design Fiction for Real-World Connected Wearables. In The 5th ACM Workshop on Wearable Systems and Applications - WearSys ’19, 59–64. https://doi.org/10.1145/3325424.3329664",
      "doi": "10.1145/3325424.3329664"
    },
    {
      "text": "Harold Ossher, William Harrison, and Peri Tarr. 2000. Software engineering tools and environments. In Proceedings of the conference on The future of Software engineering - ICSE ’00, 261–277. https://doi.org/10.1145/336512.336569",
      "doi": "10.1145/336512.336569"
    },
    {
      "text": "Janne Paavilainen, Hannu Korhonen, Kati Alha, Jaakko Stenros, Elina Koskinen, and Frans Mayra. 2017. The Pokémon GO Experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 2493–2498. https://doi.org/10.1145/3025453.3025871",
      "doi": "10.1145/3025453.3025871"
    },
    {
      "text": "Pritam Panda. 2020. Science Fiction as a Precursor of Advanced Healthcare Technology: An Analysis of Select Science Fiction Narratives. The Criterion Vol. 11, VI.",
      "doi": ""
    },
    {
      "text": "Fabio Paternò. 2013. End User Development: Survey of an Emerging Field for Empowering People. ISRN Software Engineering 2013: 1–11. https://doi.org/10.1155/2013/532659",
      "doi": ""
    },
    {
      "text": "Nayan B. Ruparelia. 2010. Software development lifecycle models. ACM SIGSOFT Software Engineering Notes 35, 3: 8–13. https://doi.org/10.1145/1764810.1764814",
      "doi": "10.1145/1764810.1764814"
    },
    {
      "text": "Daniel M. Russell and Svetlana Yarosh. 2018. Can we look to science fiction for innovation in HCI? Interactions 25, 2: 36–40. https://doi.org/10.1145/3178552",
      "doi": "10.1145/3178552"
    },
    {
      "text": "Mahsa Hasani Sadi and Eric Yu. 2014. Analyzing the evolution of software development: From creative chaos to software ecosystems. In 2014 IEEE Eighth International Conference on Research Challenges in Information Science (RCIS), 1–11. https://doi.org/10.1109/RCIS.2014.6861055",
      "doi": ""
    },
    {
      "text": "Theodosios Sapounidis and Stavros Demetriadis. 2017. Educational Robots Driven by Tangible Programming Languages: A Review on the Field. In Advances in Intelligent Systems and Computing. Springer Verlag, 205–214. https://doi.org/10.1007/978-3-319-55553-9_16",
      "doi": ""
    },
    {
      "text": "Michael Schmitz, Christoph Endres, and Andreas Butz. 2008. A Survey of Human-Computer Interaction Design in Science Fiction Movies. https://doi.org/10.5555/1363200.1363210",
      "doi": "10.5555/1363200.1363210"
    },
    {
      "text": "Nathan Shedroff and Chris Noessel. 2012. Make it so. In Proceedings of the International Working Conference on Advanced Visual Interfaces - AVI ’12, 7. https://doi.org/10.1145/2254556.2254561",
      "doi": "10.1145/2254556.2254561"
    },
    {
      "text": "Yannis Smaragdakis, Shan Shan Huang, and David Zook. 2004. Program generators and the tools to make them. In Proceedings of the ACM SIGPLAN Symposium on Partial Evaluation and Semantics-Based Program Manipulation, 92–100. https://doi.org/10.1145/1014007.1014017",
      "doi": "10.1145/1014007.1014017"
    },
    {
      "text": "Gunnar Stevens, Volkmar Pipek, and Volker Wulf. 2009. Appropriation Infrastructure: Supporting the Design of Usages. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Springer, Berlin, Heidelberg, 50–69. https://doi.org/10.1007/978-3-642-00427-8_4",
      "doi": ""
    },
    {
      "text": "Lenard George Swamy. 2020. Enhancing Bodily Engagements with Manipulatives for Tangible Programming. In Communications in Computer and Information Science. Springer, 223–230. https://doi.org/10.1007/978-3-030-50726-8_29",
      "doi": ""
    },
    {
      "text": "Donna Teague. A People-First Approach to Programming. https://doi.org/10.5555/1862712.1862737",
      "doi": "10.5555/1862712.1862737"
    },
    {
      "text": "Giovanni Maria Troiano, John Tiab, and Youn-Kyung Lim. 2016. SCI-FI. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction, 1–10. https://doi.org/10.1145/2971485.2971489",
      "doi": "10.1145/2971485.2971489"
    },
    {
      "text": "Sergi Valverde and Ricard V. Solé. 2015. Punctuated equilibrium in the large-scale evolution of programming languages. Journal of The Royal Society Interface 12, 107: 20150249. https://doi.org/10.1098/rsif.2015.0249",
      "doi": ""
    },
    {
      "text": "A.I. Wasserman. 2000. Software tools: past, present, and future. In Proceedings International Conference on Software Methods and Tools. SMT 2000, 3–6. https://doi.org/10.1109/SWMT.2000.890413",
      "doi": ""
    },
    {
      "text": "Philip Weber, Kevin Krings, Julia Nießner, Sabrina Brodesser, and Thomas Ludwig. 2021. FoodChattAR: Exploring the Design Space of Edible Virtual Agents for Human-Food Interaction. In Designing Interactive Systems Conference 2021, 638–650. https://doi.org/10.1145/3461778.3461998",
      "doi": "10.1145/3461778.3461998"
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21st century. ACM SIGMOBILE mobile computing and communications review 3, 3: 3–11.",
      "doi": ""
    },
    {
      "text": "H Winschiers and Barbara Paterson. 2004. Sustainable Software Development. In Proceedings of the 2004 annual research conference of the South African institute of computer scientists and information technologists on IT research in developing countries, 274–278. https://doi.org/10.5555/1035053.1035090",
      "doi": "10.5555/1035053.1035090"
    },
    {
      "text": "Richmond Y. Wong, Nick Merrill, and John Chuang. 2018. When BCIs have APIs. In Proceedings of the 2018 Designing Interactive Systems Conference, 1359–1371. https://doi.org/10.1145/3196709.3196746",
      "doi": "10.1145/3196709.3196746"
    },
    {
      "text": "Richmond Y Wong, Ellen Van Wyk, and James Pierce. 2017. Real-Fictional Entanglements. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS ’17), 567–579. https://doi.org/10.1145/3064663.3064682",
      "doi": "10.1145/3064663.3064682"
    }
  ]
}