{
  "doi": "10.1145/3544548.3581103",
  "title": "Social Virtual Reality as a Mental Health Tool: How People Use VRChat to Support Social Connectedness and Wellbeing",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Social virtual reality (VR) platforms have increased in popularity with many people turning to these platforms to experience social connection, including a rapid influx of users during the COVID-19 pandemic. However, there is limited understanding of how people appropriate and use emerging social VR applications to actively support their mental health and wellbeing in daily life. Through an online questionnaire and exploratory interviews conducted within the social VR app VRChat during the COVID-19 pandemic, we document how social VR is being used explicitly as a mental health support tool. Participants reported positive wellbeing benefits, mostly attributed to the anonymity provided by avatars and perceived safety within digital worlds and communities of practice. We also report how people use social VR to practice social interaction, reduce negative thoughts and form strong social bonds and connections with others.",
  "authors": [
    {
      "name": "Mairi Therese Deighan",
      "institution": "School of Computer Science, Electrical and Electronic Engineering, University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778460",
      "orcid": "0000-0003-0660-1678"
    },
    {
      "name": "Amid Ayobi",
      "institution": "Department of Computer Science, UCL Interaction Centre, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020909",
      "orcid": "0000-0003-1104-0043"
    },
    {
      "name": "Aisling Ann O'Kane",
      "institution": "University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81484657437/rel-imgonly/headshot.jpg",
      "acmid": "81484657437",
      "orcid": "0000-0001-8219-8126"
    }
  ],
  "references": [
    {
      "text": "The Oculus Subreddit. Retrieved April 30, 2021 from https://www.reddit.com/r/oculus/.",
      "doi": ""
    },
    {
      "text": "Virtual Reality. Retrieved September 15, 2022 from https://www.reddit.com/r/virtualreality/.",
      "doi": ""
    },
    {
      "text": "Ryufath Soepeno. 2021. Metaverse: A Potential Threat to Humanity and Ethics. https://doi.org/10.13140/RG.2.2.25540.14726.%20",
      "doi": ""
    },
    {
      "text": "Paola Iannello, Angela Sorgente, Margherita Lanz, and Alessandro Antonietti. 2021. Financial Well-Being and Its Relationship with Subjective and Psychological Well-Being Among Emerging Adults: Testing the Moderating Effect of Individual Differences. Journal of Happiness Studies 22, 3: 1385–1411. https://doi.org/10.1007/s10902-020-00277-x.",
      "doi": ""
    },
    {
      "text": "Steven Baker, Ryan M. Kelly, Jenny Waycott, Romina Carrasco, Thuong Hoang, Frances Batchelor, Elizabeth Ozanne, Briony Dow, Jennifer Warburton, and Frank Vetere. 2019. Interrogating social virtual reality as a communication medium for older adults. Proceedings of the ACM on Human-Computer Interaction 3, CSCW. https://doi.org/10.1145/3359251.",
      "doi": "10.1145/3359251"
    },
    {
      "text": "Steven Baker, Jenny Waycott, Elena Robertson, Romina Carrasco, Barbara Barbosa Neves, Ralph Hampson, and Frank Vetere. 2020. Evaluating the use of interactive virtual reality technology with older adults living in residential aged care. Information Processing and Management 57, 3. https://doi.org/10.1016/j.ipm.2019.102105.",
      "doi": "10.1016/j.ipm.2019.102105"
    },
    {
      "text": "Louise Barkhuus, Elizabeth Bales, and Lisa Cowan. 2017. Internet Ecologies of New Mothers: Trust, Variety and Strategies for Managing Diverse Information Sources. Proceedings of the Annual Hawaii International Conference on System Sciences 2017-January: 2283–2292. https://doi.org/10.24251/HICSS.2017.276.",
      "doi": ""
    },
    {
      "text": "Matthew Barr and Alicia Copeland-Stewart. 2022. Playing Video Games During the COVID-19 Pandemic and Effects on Players’ Well-Being. Games and Culture 17, 1: 122–139. https://doi.org/10.1177/15554120211017036.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in social virtual reality: Challenges for platform governance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW. https://doi.org/10.1145/3359202.",
      "doi": "10.1145/3359202"
    },
    {
      "text": "Robillard Genevieve Bouchard, Stephane, Dumoulin Stephanie. 2020. Virtual reality compared with in vivo exposure in the treatment of social anxiety disorder: a three-arm randomised controlled trial. https://doi.org/10.1192/bjp.bp.116.184234.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. APA handbook of research methods in psychology, Vol 2: Research designs: Quantitative, qualitative, neuropsychological, and biological.: 57–71. https://doi.org/10.1037/13620-004.",
      "doi": ""
    },
    {
      "text": "Daniel Freeman, Sarah Reeve, A Robinson, Anke Ehlers, David Clark Bernhard Spanlang, and Mel Slater. 2017. Virtual reality in the assessment, understanding, and treatment of mental health disorders. Psychological medicine 47, 14: 2393–2400. https://doi.org/10.1017/S003329171700040X",
      "doi": ""
    },
    {
      "text": "Wenrui Deng, Die Hu, S. Xu, Xiaoyu Liu, Jingwen Zhao, Qian Chen, Jiayuan Liu, Z. Zhang, Wenxiu Jiang, L. Ma, X. Hong, Shengrong Cheng, Boya Liu, and Xiaoming Li. 2019. The efficacy of virtual reality exposure therapy for PTSD symptoms: A systematic review and meta-analysis. Journal of Affective Disorders 257, 698–709. https://doi.org/10.1016/j.jad.2019.07.086.",
      "doi": ""
    },
    {
      "text": "Trevor J Dodds, Betty J Mohler, and Heinrich H Bü Lthoff. 2011. Talk to the Virtual Hands: Self-Animated Avatars Improve Communication in Head-Mounted Display Virtual Environments. https://doi.org/10.1371/journal.pone.0025759.",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut, Ming Hui Don Wen, Nicholas Yee, and Greg Wadley. 2009. Body and mind: A study of avatar personalization in three virtual worlds. Conference on Human Factors in Computing Systems - Proceedings, May: 1151–1160. https://doi.org/10.1145/1518701.1518877.",
      "doi": "10.1145/1518701.1518877"
    },
    {
      "text": "Guo Freeman, Alexandra Adkins, Samaneh Zamanifard, and Divine Maloney. 2020. My Body, My Avatar: How People Perceive Their Avatars in Social Virtual Reality. CHI 2020. https://doi.org/10.1145/3334480.3382923.",
      "doi": "10.1145/3334480.3382923"
    },
    {
      "text": "Guo Freeman and Divine Maloney. 2021. Body, Avatar, and Me. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3: 1–27. https://doi.org/10.1145/3432938.",
      "doi": "10.1145/3432938"
    },
    {
      "text": "Guo Freeman and Andrew Robb. Stay Connected in An Immersive World: Why Teenagers Engage in Social Virtual Reality. Association for Computing Machinery. https://doi.org/10.1145/3459990.3460703 .",
      "doi": "10.1145/3459990.3460703"
    },
    {
      "text": "Azucena Garcia-Palacios, Hunter G. Hoffman, Sheree Kwong See, Amy Tsai, and Cristina Botella. 2001. Redefining therapeutic success with virtual reality exposure therapy. Cyberpsychology and Behavior 4, 3: 341–348. https://doi.org/10.1089/109493101300210231.",
      "doi": ""
    },
    {
      "text": "Douglas A. Gentile, Craig A. Anderson, Shintaro Yukawa, Nobuko Ihori, Muniba Saleem, Lim Kam Ming, Akiko Shibuya, Albert K. Liau, Angeline Khoo, Brad J. Bushman, L. Rowell Huesmann, and Akira Sakamoto. 2009. The effects of prosocial video games on prosocial behaviors: International evidence from correlational, longitudinal, and experimental studies. Personality and Social Psychology Bulletin 35, 6: 752–763. https://doi.org/10.1177/0146167209333045 .",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco and Tabitha C. Peck. 2018. Avatar Embodiment. Towards a Standardized Questionnaire. Frontiers in Robotics and AI 5, JUN: 74. https://doi.org/10.3389/frobt.2018.00074.",
      "doi": ""
    },
    {
      "text": "Jenny M. Groarke, Emma Berry, Lisa Graham-Wisener, Phoebe E. McKenna-Plumley, Emily McGlinchey, and Cherie Armour. 2020. Loneliness in the UK during the COVID-19 pandemic: Cross-sectional results from the COVID-19 Psychological Wellbeing Study. PLOS ONE 15, 9: e0239698. https://doi.org/10.1371/JOURNAL.PONE.0239698.",
      "doi": ""
    },
    {
      "text": "Yemaya J. Halbrook, Aisling T. O'Donnell, and Rachel M. Msetfi. 2019. When and How Video Games Can Be Good: A Review of the Positive Effects of Video Games on Well-Being. Perspectives on Psychological Science 14, 6: 1096–1104. https://doi.org/10.1177/1745691619863807.",
      "doi": ""
    },
    {
      "text": "Louise C. Hawkley and John T. Cacioppo. 2010. Loneliness matters: A theoretical and empirical review of consequences and mechanisms. Annals of Behavioral Medicine 40, 2: 218–227. https://doi.org/10.1007/s12160-010-9210-8.",
      "doi": ""
    },
    {
      "text": "Fazida Karim, Azeezat A Oyewande, Lamis F Abdalla, Reem Chaudhry Ehsanullah, and Safeera Khan. 2020. Social Media Use and Its Connection to Mental Health: A Systematic Review. Cureus 12, 6. https://doi.org/10.7759/CUREUS.8627.",
      "doi": ""
    },
    {
      "text": "Rachel Kowert, Emese Domahidi, and Thorsten Quandt. 2014. The relationship between online video game involvement and gaming-related friendships among emotionally sensitive individuals. Cyberpsychology, Behavior, and Social Networking 17, 7: 447–453. https://doi.org/10.1089/cyber.2013.0656.",
      "doi": ""
    },
    {
      "text": "Nancy Lau, Alison O'Daffer, Susannah Colt, Joyce P. Yi-Frazier, Tonya M. Palermo, Elizabeth McCauley, and Abby R. Rosenberg. 2020. Android and iPhone Mobile Apps for Psychosocial Wellness and Stress Management: Systematic Search in App Stores and Literature Review. JMIR Mhealth Uhealth 2020;8(5):e17798 https://mhealth.jmir.org/2020/5/e17798 8, 5: e17798. https://doi.org/10.2196/17798.",
      "doi": ""
    },
    {
      "text": "Louise Lynch, Maggie Long, and Anne Moorhead. 2018. Young Men, Help-Seeking, and Mental Health Services: Exploring Barriers and Solutions. American Journal of Men's Health 12, 1: 138–149. https://doi.org/10.1177/1557988315619469.",
      "doi": ""
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2020. A Virtual Space for All: Exploring Children's Experience in Social Virtual Reality. CHI PLAY 2020 - Proceedings of the Annual Symposium on Computer-Human Interaction in Play: 472–483. https://doi.org/10.1145/3410404.3414268.",
      "doi": "10.1145/3410404.3414268"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2021. Social Virtual Reality: Ethical Considerations and Future Directions for An Emerging Research Space. Retrieved April 13, 2021 from http://arxiv.org/abs/2104.05030.",
      "doi": ""
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Donghee Yvette Wohn. 2020. “Talking without a Voice”: Understanding Non-Verbal Communication in Social Virtual Reality. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2: 1–25. https://doi.org/10.1145/3415246.",
      "doi": "10.1145/3415246"
    },
    {
      "text": "Jessica L. Maples-Keller, Brian E. Bunnell, Sae Jin Kim, and Barbara O. Rothbaum. 2017. The use of virtual reality technology in the treatment of anxiety and other psychiatric disorders. Harvard Review of Psychiatry 25, 103–113. https://doi.org/10.1097/HRP.0000000000000138.",
      "doi": ""
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping pro-social interaction in VR an emerging design framework. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3290605.3300794.",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Joshua McVeigh-Schultz, Elena Márquez Segura, Nick Merrill, and Katherine Isbister. 2018. What's It Mean to “Be Social” in VR? DIS: 289–294. https://doi.org/10.1145/3197391.3205451.",
      "doi": "10.1145/3197391.3205451"
    },
    {
      "text": "Fiordalisa Melodia, Natale Canale, and Mark D. Griffiths. 2022. The Role of Avoidance Coping and Escape Motives in Problematic Online Gaming: A Systematic Literature Review. International Journal of Mental Health and Addiction 20, 2: 996–1022. https://doi.org/10.1007/S11469-020-00422-W/TABLES/2.",
      "doi": ""
    },
    {
      "text": "Jo Mitchell, Kellie Vella, Daniel Johnson, Nicole Peever, Vanessa Wan Sze Cheng, Tracey Davenport, Jane Burns, Ian Hickie, Anne Kyle, Brent Hedley, and Brett Johnson. 2017. MindMax: Using Videogames and Sport to Engage Young Men and Improve Wellbeing. 2nd Symposium Computing and Mental Health.",
      "doi": ""
    },
    {
      "text": "Fares Moustafa and Anthony Steed. 2018. A longitudinal study of small group interaction in social virtual reality. Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST. https://doi.org/10.1145/3281505.3281527.",
      "doi": "10.1145/3281505.3281527"
    },
    {
      "text": "New World Notes: VRChat Site User Demographics: 430,000 Uniques, Mostly Male and Over 25. Retrieved September 15, 2022 from https://nwn.blogs.com/nwn/2019/05/vrchat-user-numbers-demographics-social-vr.html.",
      "doi": ""
    },
    {
      "text": "Dorian Peters, Rafael A. Calvo, and Richard M. Ryan. 2018. Designing for motivation, engagement and wellbeing in digital experience. Frontiers in Psychology 9, MAY: 797. https://doi.org/10.3389/fpsyg.2018.00797.",
      "doi": ""
    },
    {
      "text": "Dorian Peters, Naseem Ahmadpour, and Rafael A. Calvo. 2020. Tools for wellbeing-supportive design: Features, characteristics, and prototypes. Multimodal Technologies and Interaction 4, 3: 1–19. https://doi.org/10.3390/mti4030040.",
      "doi": ""
    },
    {
      "text": "Roosa Piitulainen, Perttu Hämäläinen, and Elisa D Mekler. 2022. Vibing Together: Dance Experiences in Social Virtual Reality; Vibing Together: Dance Experiences in Social Virtual Reality. https://doi.org/10.1145/3491102.3501828.%3c/bib>",
      "doi": "10.1145/3491102.3501828"
    },
    {
      "text": "Anne M. Porter and Paula Goolkasian. 2019. Video games and stress: How stress appraisals and game content affect cardiovascular and emotion outcomes. Frontiers in Psychology 10, APR. https://doi.org/10.3389/fpsyg.2019.00967.",
      "doi": ""
    },
    {
      "text": "Muhannad Quwaider, Abdullah Alabed, and Rehab Duwairi. 2019. The impact of video games on the players behaviors: A survey. In Procedia Computer Science, 575–582. https://doi.org/10.1016/j.procs.2019.04.077.",
      "doi": "10.1016/j.procs.2019.04.077"
    },
    {
      "text": "Simon M. Rice, Rosemary Purcell, and Patrick D. McGorry. 2018. Adolescent and Young Adult Male Mental Health: Transforming System Failures Into Proactive Models of Engagement. Journal of Adolescent Health 62, S9–S17. https://doi.org/10.1016/j.jadohealth.2017.07.024/",
      "doi": ""
    },
    {
      "text": "Hannah Ritchie, Edouard Mathieu, Lucas Rodés-Guirao, Cameron Appel, Charlie Giattino, Esteban Ortiz-Ospina, Joe Hasell, Bobbie Macdonald, Diana Beltekian, and Max Roser. 2020. Coronavirus Pandemic (COVID-19). Our World in Data. Retrieved September 12, 2022 from https://ourworldindata.org/coronavirus.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 1985. Self-Determination Theory and the Facilitation of Intrinsic Motivation, Social Development, and Well-Being Self-Determination Theory.",
      "doi": ""
    },
    {
      "text": "Alexander K. Saeri, Tegan Cruwys, Fiona Kate Barlow, Samantha Stronge, and Chris G. Sibley. 2018. Social connectedness improves public mental health: Investigating bidirectional relationships in the New Zealand attitudes and values survey. Australian and New Zealand Journal of Psychiatry 52, 4: 365–374. https://doi.org/10.1177/0004867417723990.",
      "doi": ""
    },
    {
      "text": "David Saffo, Sara di Bartolomeo, Caglar Yildirim, and Cody Dunne. 2020. Crowdsourcing Virtual Reality Experiments using VRChat. February. https://doi.org/10.31219/osf.io/w569f.",
      "doi": ""
    },
    {
      "text": "Susan M. Schneider and Linda E. Hood. 2007. Virtual reality: A distraction intervention for chemotherapy. Oncology Nursing Forum 34, 1: 39–46. https://doi.org/10.1188/07.ONF.39-46.",
      "doi": ""
    },
    {
      "text": "Raz Schwartz and William Steptoe. 2018. The immersive VR self: Performance, embodiment and presence in immersive virtual reality environments. A Networked Self and Human Augmentics, Artificial Intelligence, Sentience: 108–116. https://doi.org/10.4324/9781315202082.",
      "doi": ""
    },
    {
      "text": "Ketaki Shriram and Oculus Vr. 2017. All Are We l com e: Using VR Ethnography to Explore Harassment Behavior In Immersive Social Virtual Reality. 5–6.",
      "doi": ""
    },
    {
      "text": "Alessandro Siani and Sarah Anne Marley. 2021. Impact of the recreational use of virtual reality on physical and mental wellbeing during the Covid-19 lockdown. Health and Technology 11, 2: 425–435. https://doi.org/10.1007/s12553-021-00528-8.",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Chris Preist, Debbie Tallon, Nicola Wiles, and David Coyle. 2018. User Experience of Cognitive Behavioral Therapy Apps for Depression: An Analysis of App Functionality and User Reviews. J Med Internet Res 2018;20(6):e10120 https://www.jmir.org/2018/6/e10120 20, 6: e10120. https://doi.org/10.2196/10120.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Thomas D. Meyer, and Patrick Olivier. 2015. Designing for mental wellbeing: Towards a more holistic approach in the treatment and prevention of mental illness. ACM International Conference Proceeding Series: 1–10. https://doi.org/10.1145/2783446.2783586.",
      "doi": "10.1145/2783446.2783586"
    },
    {
      "text": "Timeline of UK government coronavirus lockdowns and restrictions | The Institute for Government. Retrieved August 15, 2022 from https://www.instituteforgovernment.org.uk/charts/uk-government-coronavirus-lockdowns.",
      "doi": ""
    },
    {
      "text": "Gustavo F. Tondello, Daniel Johnson, Rita Orji, Marierose M.M. van Dooren, Kellie Vella, and Lennart E. Nacke. 2017. Proceedings of the positive gaming: Workshop on gamification and games for wellbeing – Preface. CEUR Workshop Proceedings 2055.",
      "doi": ""
    },
    {
      "text": "Selen Türkay, Allan Lin, Daniel Johnson, and Jessica Formosa. 2022. Self-determination theory approach to understanding the impact of videogames on wellbeing during COVID-19 restrictions. https://doi.org/10.1080/0144929X.2022.2094832.",
      "doi": ""
    },
    {
      "text": "April Tyack, Peta Wyeth, and Daniel Johnson. 2020. Restorative Play: Videogames Improve Player Wellbeing After a Need-Frustrating Event. 1–15. https://doi.org/10.1145/3313831.3376332.",
      "doi": "10.1145/3313831.3376332"
    },
    {
      "text": "Kellie Vella, Daniel Johnson, and Leanne Hides. 2015. Indicators of wellbeing in recreational video game players. OzCHI 2015: Being Human - Conference Proceedings: 613–617. https://doi.org/10.1145/2838739.2838818.",
      "doi": "10.1145/2838739.2838818"
    },
    {
      "text": "Kellie Vella, Daniel Johnson, and Jo Mitchell. 2016. Playing support: Social connectedness amongst male video game players. CHI PLAY 2016 - Proceedings of the Annual Symposium on Computer-Human Interaction in Play Companion: 343–350. https://doi.org/10.1145/2968120.2987734.",
      "doi": "10.1145/2968120.2987734"
    },
    {
      "text": "VRChat. Retrieved May 5, 2021 from https://hello.vrchat.com/.",
      "doi": ""
    },
    {
      "text": "VRChat. Retrieved September 15, 2022 from https://www.reddit.com/r/VRchat/.",
      "doi": ""
    },
    {
      "text": "VRChat - Crunchbase Company Profile & Funding. Retrieved September 14, 2022 from https://www.crunchbase.com/organization/vrchat.",
      "doi": ""
    },
    {
      "text": "VRChat on Steam. Retrieved December 7, 2022 from https://store.steampowered.com/app/438100/VRChat/.",
      "doi": ""
    },
    {
      "text": "VRChat on Oculus Quest 2 | Oculus. Retrieved December 7, 2022 from https://www.oculus.com/experiences/quest/1856672347794301/?locale=en_GB.",
      "doi": ""
    },
    {
      "text": "VRChat - Steam Charts. Retrieved May 5, 2021 from https://steamcharts.com/app/438100.",
      "doi": ""
    },
    {
      "text": "Lisa Wiese, Anna E. Pohlmeyer, and Paul Hekkert. 2020. Design for sustained wellbeing through positive activities—a multi-stage framework. Multimodal Technologies and Interaction 4, 4: 1–25. https://doi.org/10.3390/mti4040071.",
      "doi": ""
    },
    {
      "text": "Nick Yee, Jeremy N. Bailenson, and Nicolas Ducheneaut. 2009. The proteus effect: Implications of transformed digital self-representation on online and offline behavior. https://doi.org/10.1177/0093650208330254.",
      "doi": ""
    },
    {
      "text": "Gunwoo Yoon and Patrick T. Vargas. 2014. Know Thy Avatar: The Unintended Effect of Virtual-Self Representation on Behavior. Psychological Science 25, 4: 1043–1045. https://doi.org/10.1177/0956797613519271.",
      "doi": ""
    },
    {
      "text": "Samaneh Zamanifard and Guo Freeman. 2019. “The togetherness that we crave”: Experiencing social VR in long distance relationships. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW: 438–442. https://doi.org/10.1145/3311957.3359453.",
      "doi": "10.1145/3311957.3359453"
    }
  ]
}