{
  "doi": "10.1145/3544548.3581519",
  "title": "A novel interaction for competence assessment using micro-behaviors:: Extending CACHET to graphs and charts",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Competence Assessment by Chunk Hierarchy Evaluation with Transcription-tasks (CACHET) was proposed by Cheng [14]. It analyses micro-behaviors captured during cycles of stimulus viewing and copying in order to probe chunk structures in memory. This study extends CACHET by applying it to the domain of graphs and charts. Since drawing strategies are diverse, a new interactive stimulus presentation method is introduced: Transcription with Incremental Presentation of the Stimulus (TIPS). TIPS aims to reduce strategy variations that mask the chunking signal by giving users manual element-by-element control over the display of the stimulus. The potential of TIPS, is shown by the analysis of six participants transcriptions of stimuli of different levels of familiarity and complexity that reveal clear signals of chunking. To understand how the chunk size and individual differences drive TIPS measurements, a CPM-GOMS model was constructed to formalize the cognitive process involved in stimulus comprehension and chunk creation.",
  "tags": [
    "Task Analysis",
    "Competence assessment",
    "Individual Differences",
    "Chunking",
    "GOMS"
  ],
  "authors": [
    {
      "name": "Fiorenzo Colarusso",
      "institution": "Department of Informatics, University of Sussex, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660153816",
      "orcid": "0000-0002-1953-5959"
    },
    {
      "name": "Peter C-H. Cheng",
      "institution": "Department of Informatics, University of Sussex, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100097980",
      "orcid": "0000-0002-0355-5955"
    },
    {
      "name": "Grecia Garcia Garcia",
      "institution": "Department of Informatics, University of Sussex, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613872",
      "orcid": "0000-0002-7327-7225"
    },
    {
      "name": "Aaron Stockdill",
      "institution": "Department of Informatics, University of Sussex, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659952286",
      "orcid": "0000-0003-3312-5267"
    },
    {
      "name": "Daniel Raggi",
      "institution": "Department of Computer Science and Technology, University of Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659045139",
      "orcid": "0000-0002-9207-6621"
    },
    {
      "name": "Mateja Jamnik",
      "institution": "Department of Computer Science and Technology, University of Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100097678",
      "orcid": "0000-0003-2772-2532"
    }
  ],
  "references": [
    {
      "text": "Albehaijan, N., Cheng, P.C.-H.: Measuring programming competence by assessing chunk struc- tures in a code transcription task. In: Goel, A., Seifert, C., Freksa, C. (eds.) Proceedings of the 41st Annual Conference of the Cognitive Science Society, pp. 76–82. Cognitive Science Society, Austin, TX (2019)",
      "doi": ""
    },
    {
      "text": "Baker, R. S., Martin, T., & Rossi, L. M. (2016). Educational data mining and learning analytics. The Wiley handbook of cognition and assessment: Frameworks, methodologies, and applications, 379-396.",
      "doi": ""
    },
    {
      "text": "Bauer, M. I., & John, B. E. (1995, May). Modeling time-constrained learning in a highly interactive task. In Proceedings of the SIGCHI conference on human factors in computing systems (pp. 19-26).",
      "doi": "10.1145/223904.223907"
    },
    {
      "text": "Bera, K., Shukla, A., & Bapi, R. S. (2021). Motor chunking in internally guided sequencing. Brain Sciences, 11(3), 1–11. https://doi.org/10.3390/brainsci11030292",
      "doi": ""
    },
    {
      "text": "C. M. Carswell. Choosing specifiers: an evaluation of the basic tasks model of graphical perception. Human Factors, 34(5):535–554, 1992",
      "doi": ""
    },
    {
      "text": "Card, S., Moran, T.P., Newell, A.: The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale (1983)",
      "doi": "10.5555/578027"
    },
    {
      "text": "Carpenter, P. A., & Shah, P. (1998). A model of the perceptual and conceptual processes in graph comprehension. Journal of Experimental Psychology: Applied, 4, 75-100.",
      "doi": ""
    },
    {
      "text": "Carswell, C. M., Emery, C., & Lonon, A. M. (1993). Stimulus complexity and information integration in the spontaneous interpretations of line graphs. Applied Cognitive Psychology, 7(4), 341–357. https://doi.org/10.1002/acp.2350070407",
      "doi": ""
    },
    {
      "text": "Chase, W. G., & Simon, H. A. (1973). Perception in chess. Cognitive psychology, 4(1), 55-81.",
      "doi": ""
    },
    {
      "text": "Chase, W., & Simon, H. A. (1973). The mind eye's in chess. In W. Chase (Ed.), Visual information processing. New York, N.Y.: Academic press.",
      "doi": ""
    },
    {
      "text": "Cheng, P. C.-H. (2015). Analyzing chunk pauses to measure mathematical competence: Copying equations using ‘centre-click’ interaction. In Proc. 37th Ann. Conf. Cognitive Science Society (pp. 345-350).",
      "doi": ""
    },
    {
      "text": "Cheng, P., McFadzean, J., Copeland, L.: Drawing out the temporal signature of induced perceptual chunks. In: Proceedings of the Twenty-Third Annual Conference of the Cognitive Science Society, pp. 200–205 (2001)",
      "doi": ""
    },
    {
      "text": "Cheng, P., Rojas-Anaya, H.: Measuring mathematic formula writing competence: an application of graphical protocol analysis. In: Proceedings of the Thirtieth Annual Conference of the Cognitive science Society (2007)",
      "doi": ""
    },
    {
      "text": "Cheng, P.C.-H (2014): Copying equations to assess mathematical competence: an evaluation of pause measures using graphical protocol analysis. In: Bello, P., Guarini, M., McShane, M., Scassellati, B. (eds.) Proceedings of the 36th Annual Meeting of the Cognitive Science Society, pp. 319–324. Cognitive Science Society, Austin, TX",
      "doi": ""
    },
    {
      "text": "Cheng, P.C.-H. and van Genuchten, E. (2018), Combinations of Simple Mechanisms Explain Diverse Strategies in the Freehand Writing of Memorized Sentences. Cogn Sci, 42: 1070-1109. https://doi.org/10.1111/cogs.12606",
      "doi": ""
    },
    {
      "text": "Colarusso, F., Cheng, P. C. H., Garcia, G. G., Raggi, D., & Jamnik, M. (2021). Observing Strategies of Drawing Data Representations. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics): Vol. 12909 LNAI. Springer International Publishing. https://doi.org/10.1007/978-3-030-86062-2_55",
      "doi": "10.1007/978-3-030-86062-2_55"
    },
    {
      "text": "Cowan N. (2001). The magical number 4 in short-term memory: a reconsideration of mental storage capacity. The Behavioral and brain sciences, 24(1), 87–185. https://doi.org/10.1017/s0140525x01003922",
      "doi": ""
    },
    {
      "text": "Cox, R., Grawemeyer, B.: The mental organisation of external representations. Proc. Eurocogsci 03, 91–96 (2003)",
      "doi": ""
    },
    {
      "text": "Egan, D. E., & Schwartz, B. J. (1979). Chunking in recall of symbolic drawings. Memory & Cognition, 7(2), 149–158. https://doi.org/10.3758/BF03197595",
      "doi": ""
    },
    {
      "text": "F.R.Curcio. Comprehension of mathematical relationships expressed in graphs. Journal for Research in Mathematics Education, 18(5):382–393, 1987.",
      "doi": ""
    },
    {
      "text": "Freedman, E.G., Shah, P.: Toward a model of knowledge-based graph comprehension. In: Hegarty, M., Meyer, B., Narayanan, N.H. (eds.) Diagrams 2002. LNCS (LNAI), vol. 2317, pp. 18–30. Springer, Heidelberg (2002). https://doi.org/10.1007/3-540-46037-3_3",
      "doi": ""
    },
    {
      "text": "Gobet, F., & Simon, H. A. (1996). Templates in chess memory: a mechanism for recalling several boards. Cognitive Psychology, 31, 1-40.",
      "doi": ""
    },
    {
      "text": "Gobet, F., Lane, P. C. R., Croker, S., Cheng, P. C.-H., Jones, G., Oliver, I., & Pine, J. M. (2001). Chunking mechanisms in human learning. Trends in Cognitive Science, 5(6), 1236-1243.",
      "doi": ""
    },
    {
      "text": "Gray, W.D., Boehm-Davis, D.A.: Milliseconds matter: an introduction to microstrategies and to their use in describing and predicting interactive behavior. J. Exp. Psychol. Appl. 6(4), 322–335 (2000)",
      "doi": ""
    },
    {
      "text": "H. Wainer. Understanding graphs and tables. Educational Researcher, 21(1):14–23, 1992.",
      "doi": ""
    },
    {
      "text": "Hegarty, M.: Multimedia learning about physical systems. In: Mayer, R.E. (ed.), The Cambridge Handbook of Multimedia Learning, pp. 447–465. Cambridge University Press, Cambridge (2005)",
      "doi": ""
    },
    {
      "text": "Hochstein, L. (2002). Goms. Theories in Computer Human Interaction, University of Maryland, College Park, MD, USA.",
      "doi": ""
    },
    {
      "text": "Ismail, H., & Cheng, P. (2021). Competence Assessment by Stimulus Matching: An Application of GOMS to Assess Chunks in Memory. Proceedings of the Annual Meeting of the Cognitive Science Society, 43. Retrieved from https://escholarship.org/uc/item/7dh1s1cb",
      "doi": ""
    },
    {
      "text": "J.Bertin. Semiology of Graphics: Diagrams, Networks, Maps. EsriPress, 2010.",
      "doi": ""
    },
    {
      "text": "John, B. E., & Kieras, D. E. (1996a). The GOMS family of user interface analysis techniques. ACM Transactions on Computer-Human Interaction, 3(4), 320–351. https://doi.org/10.1145/235833.236054",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "John, B. E., & Kieras, D. E. (1996b). Using GOMS for user interface design and evaluation. ACM Transactions on Computer-Human Interaction, 3(4), 287–319. https://doi.org/10.1145/235833.236050",
      "doi": "10.1145/235833.236050"
    },
    {
      "text": "John, B.E., Newell, A.: Cumulating the science of HCI: from S-R compatibility to transcription typing. In: Proceedings of the Conference on Human Factors in Computing Systems, May, pp. 109–114 (1989).https://doi.org/10.1145/67449.67472",
      "doi": "10.1145/67449.67472"
    },
    {
      "text": "Johnson, N. F. (1970). The role of chunking and organization in the process of recall. In G. H. Bower (Ed.), The Psychology of Learning and Motivation 4. (pp. 171-247). New York, NY: Academic Press.",
      "doi": ""
    },
    {
      "text": "Kintsch, W. (1988). The role of knowledge in discourse comprehension. A construction-integration model. Psychological Review, 95, 163-182.",
      "doi": ""
    },
    {
      "text": "Koedinger, K. R., Yudelson, M. V., & Pavlik Jr., P. I. (2016). Testing Theories of Transfer Using Error Rate Learning Curves. Topics in Cognitive Science, 8(3), 589-609. doi:doi:10.1111/tops.12208",
      "doi": ""
    },
    {
      "text": "Kriz, S., Hegarty, M.: Top-down and bottom-up influences on learning from animations. Int. J. Hum. Comput. Stud. 65, 911–930 (2007)",
      "doi": ""
    },
    {
      "text": "Landy, D., & Goldstone, R. L. (2007). Formal notations are diagrams: Evidence from a production task. Memory & Cognition, 35(8), 2033-2040. ",
      "doi": ""
    },
    {
      "text": "Landy, D., & Goldstone, R. L. (2007). How abstract is symbolic thought? Journal of experimental psychology: Learning, memory, and cognition, 33(4), 720-733. ",
      "doi": ""
    },
    {
      "text": "Lee, S., Kim, S. H., & Kwon, B. C. (2017). VLAT: Development of a Visualization Literacy Assessment Test. IEEE Transactions on Visualization and Computer Graphics, 23(1), 551–560. https://doi.org/10.1109/TVCG.2016.2598920",
      "doi": "10.1109/TVCG.2016.2598920"
    },
    {
      "text": "Lewis, C. D. (1982). Industrial and business forecasting methods: A practical guide to exponential smoothing and curve fitting. Butterworth-Heinemann.",
      "doi": ""
    },
    {
      "text": "Lezak, M. D. (1982). The problem of assessing executive functions. International journal of Psychology, 17(1-4), 281-297.",
      "doi": ""
    },
    {
      "text": "Miller, G.A.: The magical number seven, plus or minus two: Some limits on our capacity for processing information. Psychol. Rev. 63(2), 81–97 (1956)",
      "doi": ""
    },
    {
      "text": "Miyake, A., Friedman, N. P., Emerson, M. J., Witzki, A. H., Howerter, A., & Wager, T. D. (2000). The Unity and Diversity of Executive Functions and Their Contributions to Complex “Frontal Lobe” Tasks: A Latent Variable Analysis. Cognitive Psychology, 41(1), 49–100. https://doi.org/10.1006/cogp.1999.0734",
      "doi": ""
    },
    {
      "text": "Miyake, A., Friedman, N.P.: The nature and organization of individual differences in executivefunctions: four general conclusions. Curr. Dir. Psychol. Sci.21(1), 8–14 (2012).https://doi.org/10.1177/0963721411429458",
      "doi": ""
    },
    {
      "text": "Morris, N., & Jones, D. M. (1990). Memory updating in working memory: The role of the central executive. British Journal of Psychology, 81(2), 111–121. https://doi.org/10.1111/j.2044-8295.1990.tb02349.x",
      "doi": ""
    },
    {
      "text": "Obaidellah, U.H., Cheng, P.C.H.: The role of chunking in drawing Rey complex figure. Percept. Mot. Skills 120(2), 535–555 (2015)",
      "doi": ""
    },
    {
      "text": "Oviatt, S., Hang, K., Zhou, J., Yu, K., & Chen, F. (2018). Dynamic handwriting signal features predict domain expertise. ACM Transactions on Interactive Intelligent Systems, 8(3), 1-21.",
      "doi": "10.1145/3213309"
    },
    {
      "text": "Panesi, S., Morra, S.: Drawing a dog: The role of working memory and executive function. Journal of Experimental Child Psychology 152, 1–11(2016). https://doi.org/10.1016/j.jecp. 2016.06.015",
      "doi": ""
    },
    {
      "text": "Pellegrino, J., Chudowsky, N., & Glaser, R. (2001). Knowing what students know: The science and design of educational assessment. Washington, DC: National Academies Press.",
      "doi": ""
    },
    {
      "text": "Pinker, S. (1990). A theory of graph comprehension. Artificial intelligence and the future of testing, 73, 126.",
      "doi": ""
    },
    {
      "text": "Reitman Olson, J., & Olson, G. M. (1990). The Growth of Cognitive Modeling in Human-Computer Interaction Since GOMS. Human-Computer Interaction, 5(2–3), 221–265. https://doi.org/10.1080/07370024.1990.9667155",
      "doi": ""
    },
    {
      "text": "Roller, R., Cheng, P.C.-H.: Observed strategies in the freehand drawing of complex hierarchical diagrams. In: Bello, P., Guarini, M., McShane, M., Scassellati, B. (eds.) Proceedings of the 36th Annual Meeting of the Cognitive Science Society, pp. 2020–2025. Cognitive Science Society, Austin, TX (2014)",
      "doi": ""
    },
    {
      "text": "S. N. Friel, F. R. Curcio, and G. W. Bright. Making sense of graphs: Critical factors influencing comprehension and instructional implications. Journal for Research in Mathematics Education, 32(2):124–158, 2001",
      "doi": ""
    },
    {
      "text": "Shah, P., & Freedman, E. G. (2011). Bar and line graph comprehension: An interaction of top-down and bottom-up processes. Topics in Cognitive Science, 3(3), 560–578. https://doi.org/10.1111/j.1756-8765.2009.01066.x",
      "doi": ""
    },
    {
      "text": "Shah, P., Carpenter, P.A.: Conceptual limitations in comprehending line graphs. J. Exp. Psychol. Gen. 124(1), 43–61 (1995)",
      "doi": ""
    },
    {
      "text": "Shah, P., Mayer, R.E., Hegarty,M.: Graphs as aids to knowledge construction: signaling techniques for guiding the process of graph comprehension. J. Educ. Psychol. 91(4), 690–702 (1999)",
      "doi": ""
    },
    {
      "text": "Siemens, G. (2013). Learning Analytics: The Emergence of a Discipline. American Behavioral Scientist, 57(10), 1380-1400.",
      "doi": ""
    },
    {
      "text": "Slutsky D. J. (2014). The effective use of graphs. Journal of wrist surgery, 3(2), 67–68. https://doi.org/10.1055/s-0034-1375704",
      "doi": ""
    },
    {
      "text": "Stahovich, T. F., & Lin, H. (2016). Enabling data mining of handwritten coursework. Computers & Graphics, 57, 31-45.",
      "doi": "10.1016/j.cag.2016.01.002"
    },
    {
      "text": "Thompson, J.J., McColeman, C.M., Stepanova, E.R., Blair, M.R.: Using video game telemetry data to research motor chunking, action latencies, and complex cognitive-motor skill learning. Top. Cogn. Sci. 9(2), 467–484 (2017). https://doi.org/10.1111/tops.12254",
      "doi": ""
    },
    {
      "text": "Tulving, E., & Thomson, D. M. (1973). Encoding specificity and retrieval processes in episodic memory. Psychological review, 80(5), 352.",
      "doi": ""
    },
    {
      "text": "Vallat, R. (2018). Pingouin: statistics in Python. Journal of Open Source Software, 3(31), 1026, https://doi.org/10.21105/joss.01026",
      "doi": ""
    },
    {
      "text": "Xi, X. Do visual chunks and planning impact performance on the graph description task in the SPEAK exam? Lang. Test. 22(4), 463–508 (2005)",
      "doi": ""
    }
  ]
}