{
  "doi": "10.1145/3544548.3581411",
  "title": "Invisibility or Visibility in Intimate Care at the Workplace? Examining the Use of Breast Pumps",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Advances in intimate care technologies and on-body wearables are disrupting how and where we think about and care for our bodies. The boundaries between private and public are increasingly porous. This offers new sites for studying intimate care as technology-use-in-practice. We present a qualitative study on the use of breast pumps in the workplace, based on semi-structured interviews with 19 individuals. Through this, we contribute an illustration of the complexities in carrying out intimate care work at the workplace and what it means to be pumping at the workplace. Our analysis unpacks (in)visibility as a crucial tension in the use of breast pumps in the workplace. We discuss how (in)visibility of personal medical devices plays a mediating role in how individuals exercise bodily rights, and the norms of who fits into professional settings.",
  "authors": [
    {
      "name": "Deepika Yadav",
      "institution": "Department of Computer and Systems Sciences, Stockholm University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660741036",
      "orcid": "0000-0003-3443-5806"
    },
    {
      "name": "Madeline Balaam",
      "institution": "Division of Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448600301",
      "orcid": "0000-0001-9472-3805"
    },
    {
      "name": "Airi Lampinen",
      "institution": "Department of Computer and Systems Sciences, Stockholm University, Sweden",
      "img": "/do/10.1145/contrib-81430677521/rel-imgonly/2014-09-1710.28.00.jpg",
      "acmid": "81430677521",
      "orcid": "0000-0002-9100-3826"
    }
  ],
  "references": [
    {
      "text": "Dinislam Abdulgalimov, Reuben Kirkham, James Nicholson, Vasilis Vlachokyriakos, Pam Briggs, and Patrick Olivier. 2020. Designing for employee voice. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376284"
    },
    {
      "text": "Laura Addati, Naomi Cassirer, and Katherine Gilchrist. 2014. Maternity and paternity at work: Law and practice across the world. International Labour Office.",
      "doi": ""
    },
    {
      "text": "Aalya Ahmad. 2019. Living a feminist life. Contemporary Political Theory 18, 2 (2019), 125–128.",
      "doi": ""
    },
    {
      "text": "Teresa Almeida, Madeline Balaam, Shaowen Bardzell, and Lone Koefoed Hansen. 2020. Introduction to the special issue on HCI and the body: reimagining women’s health., 32 pages.",
      "doi": ""
    },
    {
      "text": "Teresa Almeida, Rob Comber, and Madeline Balaam. 2016. HCI and Intimate Care as an Agenda for Change in Women’s Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2599–2611.",
      "doi": "10.1145/2858036.2858187"
    },
    {
      "text": "Teresa Almeida, Rob Comber, Gavin Wood, Dean Saraf, and Madeline Balaam. 2016. On looking at the vagina through labella. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1810–1821.",
      "doi": "10.1145/2858036.2858119"
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A location-mapping mobile application for breastfeeding women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1709–1718.",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. The user reconfigured: on subjectivities of information. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives. 133–144.",
      "doi": "10.7146/aahcc.v1i1.21298"
    },
    {
      "text": "Shaowen Bardzell, Shad Gross, Jeffrey Wain, Austin Toombs, and Jeffrey Bardzell. 2011. The significant screwdriver: care, domestic masculinity, and interaction design. In Proceedings of HCI 2011 The 25th BCS Conference on Human Computer Interaction 25. 371–377.",
      "doi": ""
    },
    {
      "text": "Marian Barnes. 2012. Care in everyday life: An ethic of care in practice. Policy Press.",
      "doi": ""
    },
    {
      "text": "Genevieve E Becker. 2021. Measuring Mothers’ Viewpoints of Breast Pump Usage. International Journal of Environmental Research and Public Health 18, 8(2021), 3883.",
      "doi": ""
    },
    {
      "text": "Rosanna Bellini, Patrick Olivier, and Rob Comber. 2018. “That Really Pushes My Buttons” Designing Bullying and Harassment Training for the Workplace. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3173809"
    },
    {
      "text": "Cynthia L Bennett, Keting Cen, Katherine M Steele, and Daniela K Rosner. 2016. An intimate laboratory? Prostheses as a tool for experimenting with identity and normalcy. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1745–1756.",
      "doi": "10.1145/2858036.2858564"
    },
    {
      "text": "Mariela Bernabe-Garcia, Mardia Lopez-Alarcon, Raul Villegas-Silva, Maricela Rodriguez-Cruz, and Cesar Jimenez-Galicia. 2012. Effectiveness of four manual breast pumps for mothers after preterm delivery in a developing country. Journal of the American College of Nutrition 31, 1 (2012), 63–69.",
      "doi": ""
    },
    {
      "text": "Maia Boswell-Penc and Kate Boyer. 2007. Expressing anxiety? Breast pump usage in American wage workplaces. Gender, place and culture 14, 5 (2007), 551–567.",
      "doi": ""
    },
    {
      "text": "Kate Boyer. 2010. A feminist technology, or (yet)\" More Work for Mother\"?(2010).",
      "doi": ""
    },
    {
      "text": "Kate Boyer. 2014. ‘Neoliberal motherhood’: workplace lactation and changing conceptions of working motherhood in the contemporary US. Feminist Theory 15, 3 (2014), 269–288.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative research in sport, exercise and health 11, 4 (2019), 589–597.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. One size fits all? What counts as quality practice in (reflexive) thematic analysis?Qualitative research in psychology 18, 3 (2021), 328–352.",
      "doi": ""
    },
    {
      "text": "Nadia Campo Woytuk, Marie Louise Juul Søndergaard, Marianela Ciolfi Felice, and Madeline Balaam. 2020. Touching and being in touch with the menstruating body. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376471"
    },
    {
      "text": "Marianela Ciolfi Felice, Marie Louise Juul Søndergaard, and Madeline Balaam. 2021. Resisting the Medicalisation of Menopause: Reclaiming the Body through Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445153"
    },
    {
      "text": "Adrian K Clear, Samantha Mitchell Finnigan, Patrick Olivier, and Rob Comber. 2018. ThermoKiosk: Investigating roles for digital surveys of thermal experience in workplace comfort management. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173956"
    },
    {
      "text": "Sarah N Clemons and Lisa H Amir. 2010. Breastfeeding women’s experience of expressing: a descriptive study. Journal of Human Lactation 26, 3 (2010), 258–265.",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio, Alexis Hope, Becky Michelson, Robyn Churchill, and Ethan Zuckerman. 2016. A Feminist HCI Approach to Designing Postpartum Technologies: \" When I first saw a breast pump I was wondering if it was a joke\". In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2612–2622.",
      "doi": "10.1145/2858036.2858460"
    },
    {
      "text": "Anne Eglash and Michele L Malloy. 2015. Breastmilk expression and breast pump technology. Clinical obstetrics and gynecology 58, 4 (2015), 855–867.",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7, 1(2000), 59–83.",
      "doi": ""
    },
    {
      "text": "Global Market Estimates. 2022. Global Wearable Breast Pumps Market. https://www.globalmarketestimates.com/market-report/global-wearable-breast-pumps-market-2431. [Online; accessed 12-Dec-2022].",
      "doi": ""
    },
    {
      "text": "Mary Fewtrell, Kathy Kennedy, Olga Lukoyanova, Zhuang Wei, Debra Potak, Tatiana Borovik, Leyla Namazova-Baranova, and Richard Schanler. 2019. Short-term efficacy of two breast pumps and impact on breastfeeding outcomes at 6 months in exclusively breastfeeding mothers: A randomised trial. Maternal & child nutrition 15, 3 (2019), e12779.",
      "doi": ""
    },
    {
      "text": "Valerie J Flaherman, Katherine G Hicks, Justine Huynh, Michael D Cabana, and Kathryn A Lee. 2016. Positive and negative experiences of breast pumping during the first 6 months. Maternal & child nutrition 12, 2 (2016), 291–298.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Noura Howell, Richmond Wong, and Franchesca Spektor. 2019. Vivewell: speculating near-future menstrual tracking through current data practices. In Proceedings of the 2019 on Designing Interactive Systems Conference. 541–552.",
      "doi": "10.1145/3322276.3323695"
    },
    {
      "text": "Sheela R Geraghty, Jane C Khoury, and Heidi J Kalkwarf. 2005. Human milk pumping rates of mothers of singletons and mothers of multiples. Journal of Human Lactation 21, 4 (2005), 413–420.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 2021. The presentation of self in everyday life. Anchor.",
      "doi": ""
    },
    {
      "text": "Bernice Hausman. 2004. The feminist politics of breastfeeding. Australian feminist studies 19, 45 (2004), 273–285.",
      "doi": ""
    },
    {
      "text": "Karey Helms. 2021. Entangled Reflections on Designing with Leaky Breastfeeding Bodies. In Designing Interactive Systems Conference 2021. 1998–2012.",
      "doi": ""
    },
    {
      "text": "Karey Helms, Pedro Ferreira, Barry Brown, and Airi Lampinen. 2019. Away and (dis) connection: Reconsidering the use of digital technologies in light of long-term outdoor activities. Proceedings of the ACM on Human-Computer Interaction 3, GROUP(2019), 1–20.",
      "doi": "10.1145/3361111"
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L Bennett. 2020. Living disability theory: Reflections on access, research, and design. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Sarah Homewood. 2018. Designing for the changing body: A feminist exploration of self-tracking technologies. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–4.",
      "doi": "10.1145/3170427.3173031"
    },
    {
      "text": "Sarah Homewood, Harvey Bewley, and Laurens Boer. 2019. Ovum: Designing for fertility tracking as a shared and domestic experience. In Proceedings of the 2019 on Designing Interactive Systems Conference. 553–565.",
      "doi": "10.1145/3322276.3323692"
    },
    {
      "text": "Kristina Hook. 2018. Designing with the body: Somaesthetic interaction design. MIt Press.",
      "doi": ""
    },
    {
      "text": "Alexis Hope, Catherine D’Ignazio, Josephine Hoy, Rebecca Michelson, Jennifer Roberts, Kate Krontiris, and Ethan Zuckerman. 2019. Hackathons as participatory design: iterating feminist utopias. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300291"
    },
    {
      "text": "Jordynn Jack. 2016. Leviathan and the breast pump: Toward an embodied rhetoric of wearable technology. Rhetoric Society Quarterly 46, 3 (2016), 207–221.",
      "doi": ""
    },
    {
      "text": "Alison Kafer. 2013. Time for disability studies and a future for crips. Feminist, queer, crip(2013), 25–46.",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Jeffrey Bardzell, and Shaowen Bardzell. 2011. How HCI talks about sexuality: discursive strategies, blind spots, and opportunities for future research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 695–704.",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Neha Kumar, Naveena Karusala, Azra Ismail, and Anupriya Tuli. 2020. Taking the long, holistic, and intersectional view to women’s wellbeing. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 4(2020), 1–32.",
      "doi": "10.1145/3397159"
    },
    {
      "text": "Hyosun Kwon, Joel E Fischer, Martin Flintham, and James Colley. 2018. The connected shower: Studying intimate data in everyday life. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–22.",
      "doi": "10.1145/3287054"
    },
    {
      "text": "Airi Lampinen, Moira McGregor, Rob Comber, and Barry Brown. 2018. Member-Owned Alternatives: Exploring Participatory Forms of Organising with Cooperatives. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–19.",
      "doi": "10.1145/3274369"
    },
    {
      "text": "Amanda Lazar, Norman Makoto Su, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Parting the Red Sea: sociotechnical systems and lived experiences of menopause. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–16.",
      "doi": "10.1145/3290605.3300710"
    },
    {
      "text": "Robyn Lee. 2018. Breastfeeding bodies: Intimacies at work. Gender, Work & Organization 25, 1 (2018), 77–90.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Thecla Schiphorst. 2018. The somatic turn in human-computer interaction. Interactions 25, 5 (2018), 54–5863.",
      "doi": "10.1145/3236675"
    },
    {
      "text": "Trevor MacDonald, Joy Noel-Weiss, Diana West, Michelle Walks, MaryLynne Biener, Alanna Kibbe, and Elizabeth Myler. 2016. Transmasculine individuals’ experiences with lactation, chestfeeding, and gender identity: a qualitative study. BMC Pregnancy and Childbirth 16, 1 (2016), 1–17.",
      "doi": ""
    },
    {
      "text": "Jessica Martucci. 2013. Breast pumping. AMA Journal of Ethics 15, 9 (2013), 791–797.",
      "doi": ""
    },
    {
      "text": "Emily Mitchell-Eaton. 2021. Postpartum geographies: Intersections of academic labor and care work. Environment and Planning C: Politics and Space 39, 8 (2021), 1755–1772.",
      "doi": ""
    },
    {
      "text": "Orwell H. Needham. 1854. Breas. https://patents.google.com/patent/US11135. [Online; accessed 5-Sept-2022].",
      "doi": ""
    },
    {
      "text": "Sarah Ng, Shaowen Bardzell, and Jeffrey Bardzell. 2020. The Menstruating Entrepreneur Kickstarting a New Politics of Women’s Health. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 4(2020), 1–25.",
      "doi": "10.1145/3397158"
    },
    {
      "text": "Aisling Ann O’Kane, Yvonne Rogers, and Ann E Blandford. 2015. Concealing or revealing mobile medical devices? Designing for onstage and offstage presentation. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1689–1698.",
      "doi": ""
    },
    {
      "text": "Oura. 2022. Oura Ring. https://ouraring.com/. [Online; accessed 5-Sept-2022].",
      "doi": ""
    },
    {
      "text": "Elspeth Probyn. 1991. This body which is not one: Speaking an embodied self. Hypatia 6, 3 (1991), 111–124.",
      "doi": ""
    },
    {
      "text": "Grand Review Research. 2022. Breast Pump Market Size, Share & Trends Analysis Report. https://www.grandviewresearch.com/industry-analysis/breast-pumps-market. [Online; accessed 12-Dec-2022].",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers. 2006. Moving on from weiser’s vision of calm computing: Engaging ubicomp experiences. In International conference on Ubiquitous computing. Springer, 404–421.",
      "doi": "10.1007/11853565_24"
    },
    {
      "text": "Judith Rollins. 1985. Between women: Domestics and their employers. Vol. 71. Temple University Press.",
      "doi": ""
    },
    {
      "text": "Ellen Samuels and Elizabeth Freeman. 2021. Introduction: crip temporalities. South Atlantic Quarterly 120, 2 (2021), 245–254.",
      "doi": ""
    },
    {
      "text": "Sami Schalk. 2013. Coming to claim crip: Disidentification with/in disability studies. Disability Studies Quarterly 33, 2 (2013).",
      "doi": ""
    },
    {
      "text": "Kjeld Schmidt. 2008. Taking cscw seriously: Supporting articulation work (1992). In Cooperative Work and Coordinative Practices. Springer, 45–71.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2008. Body consciousness: A philosophy of mindfulness and somaesthetics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2018. Intimate futures: Staying with the trouble of digital personal assistants through design fiction. In Proceedings of the 2018 designing interactive systems conference. 869–880.",
      "doi": "10.1145/3196709.3196766"
    },
    {
      "text": "Marie Louise Juul Søndergaard, Ozgun Kilic Afsar, Marianela Ciolfi Felice, Nadia Campo Woytuk, and Madeline Balaam. 2020. Designing with Intimate Materials and Movements: Making\" Menarche Bits\". In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 587–600.",
      "doi": "10.1145/3357236.3395592"
    },
    {
      "text": "Katta Spiel. 2021. The bodies of tei–investigating norms and assumptions in the design of embodied interaction. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–19.",
      "doi": "10.1145/3430524.3440651"
    },
    {
      "text": "Anna Ståhl, Madeline Balaam, Rob Comber, Pedro Sanches, and Kristina Höök. 2022. Making New Worlds–Transformative Becomings with Soma Design. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3491102.3502018"
    },
    {
      "text": "Anna Ståhl, Vasiliki Tsaknaki, and Madeline Balaam. 2021. Validity and Rigour in Soma Design-Sketching with the Soma. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 6(2021), 1–36.",
      "doi": "10.1145/3470132"
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer supported cooperative work (CSCW) 8, 1 (1999), 9–30.",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Linda Steele and Beth Goldblatt. 2020. Engaging with Law’s Menstrual Moment. Australian Feminist Law Journal 46, 1 (2020), 83–113.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Commun. ACM 38, 9 (1995), 56–64.",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Kentaro Toyama. 2018. From needs to aspirations in information technology for development. Information Technology for Development 24, 1 (2018), 15–36.",
      "doi": ""
    },
    {
      "text": "Joan C Tronto. 2020. Moral boundaries: A political argument for an ethic of care. Routledge.",
      "doi": ""
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Pushpendra Singh, and Neha Kumar. 2020. Menstrual (Im) mobilities and safe spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376653"
    },
    {
      "text": "Stephan Van den Broucke, Walter Vandereycken, and Hans Vertommen. 1995. Marital intimacy: Conceptualization and assessment. Clinical Psychology Review 15, 3 (1995), 217–233.",
      "doi": ""
    },
    {
      "text": "Carol Wolkowitz. 2006. Bodies at work. Sage.",
      "doi": ""
    }
  ]
}