{
  "doi": "10.1145/3544548.3580758",
  "title": "Assessing Mapper Conflict in OpenStreetMap Using the Delphi Survey Method",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Studies of mapper conflict in OpenStreetMap (OSM) have focused exclusively on cartographic vandalism and its effect on data quality. This paper takes a broader view on mapper conflict in OSM. Using a Delphi survey method, we collect qualitative data on perceived conflict from long-time OSM mappers. We ask mappers about four aspects of conflict in OSM: (1) topic of conflict, (2) factors leading to conflict, (3) effects of conflict, and (4) potential conflict management methods. Our results show that conflict in OSM can be explained by clashing values and opinions within and across different mapper subgroups and can be exacerbated by negative mapper behaviors. The boundaries of these subgroups, while implicit, are often defined by gender, mappers’ geographic location, level of expertise, and mappers’ professional affiliation. Based on these results, we discuss design options for OSM’s existing public communication channels that often become foci of mapper conflict management.",
  "tags": [
    "Delphi survey",
    "OpenStreetMap",
    "Mapper conflict"
  ],
  "authors": [
    {
      "name": "Youjin Choe",
      "institution": "Department of Infrastructure Engineering, Faculty of Engineering and Information Technology, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783819",
      "orcid": "0000-0002-3959-2141"
    },
    {
      "name": "Martin Tomko",
      "institution": "Department of Infrastructure Engineering, Faculty of Engineering and Information Technology, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496645361",
      "orcid": "0000-0002-5736-4679"
    },
    {
      "name": "Mohsen Kalantari",
      "institution": "School of Civil and Enviromental Engineering, The University of New South Wales, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81555093656",
      "orcid": "0000-0002-6650-5218"
    }
  ],
  "references": [
    {
      "text": "Ahmed Loai Ali, Falko Schmid, Rami Al-Salman, and Tomi Kauppinen. 2014. Ambiguity and plausibility. In Proceedings of the 22nd ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems - SIGSPATIAL ’14. ACM Press, Dallas/Fort Worth, USA, 143–152. https://doi.org/10.1145/2666310.2666392",
      "doi": "10.1145/2666310.2666392"
    },
    {
      "text": "J. Anderson, D. Sarkar, and L. Palen. 2019. Corporate Editors in the Evolving Landscape of OpenStreetMap. ISPRS International Journal of Geo-Information 8, 5 (May 2019), 232—–249. https://doi.org/10.3390/ijgi8050232",
      "doi": ""
    },
    {
      "text": "Ofer Arazy, Oded Nov, Raymond Patterson, and Lisa Yeo. 2011. Information Quality in Wikipedia: The Effects of Group Composition and Task Conflict. Journal of Management Information Systems 27, 4 (2011), 71–98. https://doi.org/10.2753/mis0742-1222270403",
      "doi": "10.2753/mis0742-1222270403"
    },
    {
      "text": "Andrea Ballatore. 2014. Defacing the Map: Cartographic Vandalism in the Digital Commons. Cartographic Journal 51, 3 (Aug. 2014), 214–224. https://doi.org/10.1179/1743277414Y.0000000085",
      "doi": ""
    },
    {
      "text": "Andrea Ballatore and Peter Mooney. 2015. Conceptualising the geographic world: the dimensions of negotiation in crowdsourced cartography. International Journal of Geographical Information Science 29, 12 (Aug. 2015), 2310–2327. https://doi.org/10.1080/13658816.2015.1076825",
      "doi": "10.1080/13658816.2015.1076825"
    },
    {
      "text": "Eric P.S. Baumer, Xiaotong Xu, Christine Chu, Shion Guha, and Geri K. Gay. 2017. When Subjects Interpret the Data: Social Media Non-Use as a Case for Adapting the Delphi Method to CSCW. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1527–1543. https://doi.org/10.1145/2998181.2998182",
      "doi": "10.1145/2998181.2998182"
    },
    {
      "text": "Matt Billings and Leon A. Watts. 2010. Understanding Dispute Resolution Online: Using Text to Reflect Personal and Substantive Issues in Conflict. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1447–1456. https://doi.org/10.1145/1753326.1753542",
      "doi": "10.1145/1753326.1753542"
    },
    {
      "text": "Youjin Choe, Martin Tomko, and Mohsen Kalantari. 2023. Producer Conflict Management Approaches in Online Peer Production Communities – Case Study of OpenStreetMap. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (Hamburg, Germany) (CHI ’23). Association for Computing Machinery, New York, NY, USA, forthcoming. https://doi.org/10.1145/3544548.3581036",
      "doi": "10.1145/3544548.3581036"
    },
    {
      "text": "Norman Dalkey and Olaf Helmer. 1963. An experimental application of the Delphi method to the use of experts. Management science 9, 3 (1963), 458–467.",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Brent Hecht, and Darren Gergle. 2019. The Gendered Geography of Contributions to OpenStreetMap: Complexities in Self-Focus Bias. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300793",
      "doi": "10.1145/3290605.3300793"
    },
    {
      "text": "Martin Dittus and Licia Capra. 2017. Private peer feedback as engagement driver in humanitarian mapping. Proceedings of the ACM on human-computer interaction 1, CSCW(2017), 1–18.",
      "doi": "10.1145/3134675"
    },
    {
      "text": "Anna Filippova and Hichang Cho. 2015. Mudslinging and Manners: Unpacking Conflict in Free and Open Source Software. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1393–1403. https://doi.org/10.1145/2675133.2675254",
      "doi": "10.1145/2675133.2675254"
    },
    {
      "text": "Anna Filippova and Hichang Cho. 2016. The Effects and Antecedents of Conflict in Free and Open Source Software Development. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 705––716. https://doi.org/10.1145/2818048.2820018",
      "doi": "10.1145/2818048.2820018"
    },
    {
      "text": "Andrea Forte, Vanesa Larco, and Amy Bruckman. 2009. Decentralization in Wikipedia governance. Journal of Management Information Systems 26, 1 (2009), 49–72.",
      "doi": "10.2753/MIS0742-1222260103"
    },
    {
      "text": "Josephine ME Gibson. 1998. Using the Delphi technique to identify the content and context of nurses’ continuing professional development needs. Journal of clinical nursing 7, 5 (1998), 451–459.",
      "doi": ""
    },
    {
      "text": "Claire M Goodman. 1987. The Delphi technique: a critique. Journal of advanced nursing 12, 6 (1987), 729–734.",
      "doi": ""
    },
    {
      "text": "Mordechai Haklay, Sofia Basiouka, Vyron Antoniou, and Aamer Antoniou. 2010. How Many Volunteers Does it Take to Map an Area Well? The Validity of Linus’ Law to Volunteered Geographic Information. Cartographic Journal 47, 4 (Nov. 2010), 315–322. https://doi.org/10.1179/000870410X12911304958827",
      "doi": ""
    },
    {
      "text": "Mordechai (Muki) Haklay and Patrick Weber. 2008. OpenStreetMap: User-Generated Street Maps. IEEE Pervasive Computing 7, 4 (Oct. 2008), 12–18. https://doi.org/10.1109/mprv.2008.80",
      "doi": "10.1109/mprv.2008.80"
    },
    {
      "text": "Aaron Halfaker, R Stuart Geiger, Jonathan T Morgan, and John Riedl. 2013. The rise and decline of an open collaboration system: How Wikipedia’s reaction to popularity is causing its decline. American Behavioral Scientist 57, 5 (2013), 664–688.",
      "doi": ""
    },
    {
      "text": "Andrew Hall, Sarah McRoberts, Jacob Thebault-Spieker, Yilun Lin, Shilad Sen, Brent Hecht, and Loren Terveen. 2017. Freedom versus Standardization: Structured Data Generation in a Peer Production Community. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6352–6362. https://doi.org/10.1145/3025453.3025940",
      "doi": "10.1145/3025453.3025940"
    },
    {
      "text": "Andrew Hall, Jacob Thebault-Spieker, Shilad Sen, Brent Hecht, and Loren Terveen. 2018. Exploring the Relationship Between \"Informal Standards\" and Contributor Practice in OpenStreetMap. In Proceedings of the 14th International Symposium on Open Collaboration (Paris, France) (OpenSym ’18). Association for Computing Machinery, New York, NY, USA, Article 10, 11 pages. https://doi.org/10.1145/3233391.3233962",
      "doi": "10.1145/3233391.3233962"
    },
    {
      "text": "Matthew R Hallowell and John A Gambatese. 2010. Qualitative research: Application of the Delphi method to CEM research. Journal of construction engineering and management 136, 1(2010), 99.",
      "doi": ""
    },
    {
      "text": "Felicity Hasson, Sinead Keeney, and Hugh Mckenna. 2000. Research guidelines for the Delphi Survey Technique. Journal of advanced nursing 32 (11 2000), 1008–1015. https://doi.org/10.1046/j.1365-2648.2000.t01-1-01567.x",
      "doi": ""
    },
    {
      "text": "Molly G. Hickman, Viral Pasad, Harsh Kamalesh Sanghavi, Jacob Thebault-Spieker, and Sang Won Lee. 2021. Understanding Wikipedia Practices Through Hindi, Urdu, and English Takes on an Evolving Regional Conflict. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 34 (apr 2021), 31 pages. https://doi.org/10.1145/3449108",
      "doi": "10.1145/3449108"
    },
    {
      "text": "Pamela J. Hinds and Diane E. Bailey. 2003. Out of Sight, Out of Sync: Understanding Conflict in Distributed Teams. Organization Science 14, 6 (Nov. 2003), 615–632. https://doi.org/10.1287/orsc.14.6.615.24872",
      "doi": "10.1287/orsc.14.6.615.24872"
    },
    {
      "text": "I. Richard Hoffman and Norman R. F. Maier. 1961. QUALITY AND ACCEPTANCE OF PROBLEM SOLUTIONS BY MEMBERS OF HOMOGENEOUS AND HETEROGENEOUS GROUPS. Journal of Abnormal and Social Psychology 62, 2 (March 1961), 401–407.",
      "doi": ""
    },
    {
      "text": "Chia-Chien Hsu and Brian A Sandford. 2007. The Delphi technique: making sense of consensus. Practical Assessment, Research, and Evaluation 12, 1(2007), 10.",
      "doi": ""
    },
    {
      "text": "Wenjian Huang, Tun Lu, Haiyi Zhu, Guo Li, and Ning Gu. 2016. Effectiveness of Conflict Management Strategies in Peer Review Process of Online Collaboration Projects. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 717–728. https://doi.org/10.1145/2818048.2819950",
      "doi": "10.1145/2818048.2819950"
    },
    {
      "text": "Bernard Jacquemin, Aurélien Lauf, Céline Poudat, Martine Hurault-Plantet, and Nicolas Auray. 2008. Managing conflicts between users in Wikipedia. In CEUR Workshop Proceedings, Vol. 333. RWTH Aachen University, Innsbruck, Austria, 87–99.",
      "doi": ""
    },
    {
      "text": "Karen A. Jehn and Corinne Bendersky. 2003. Intragroup Conflict in Organizations: A Contingency Perspective on the Conflict-Outcome Relationship. Research in Organizational Behavior 25, s (2003), 187–242. https://doi.org/10.1016/S0191-3085(03)25005-X",
      "doi": ""
    },
    {
      "text": "Karen A. Jehn and Elizabeth A. Mannix. 2001. The Dynamic Nature of Conflict: A Longitudinal Study of Intragroup Conflict and Group Performance. Academy of Management Journal 44, 2 (April 2001), 238–251. https://doi.org/10.5465/3069453",
      "doi": ""
    },
    {
      "text": "Sema Kalaian and Rafa M Kasim. 2012. Terminating sequential Delphi survey data collection. Practical Assessment, Research, and Evaluation 17, 1(2012), 5.",
      "doi": ""
    },
    {
      "text": "Gerald C Kane, Jeremiah Johnson, and Ann Majchrzak. 2014. Emergent life cycle: The tension between knowledge change and knowledge retention in open online coproduction communities. Management Science 60, 12 (2014), 3026–3048.",
      "doi": "10.1287/mnsc.2013.1855"
    },
    {
      "text": "A. Jehn Karen, Gregory B. Northcraft, and Margaret A. Neale. 1999. Why Differences Make a Difference: A Field Study of Diversity, Conflict, and Performance in Workgroups. Administrative Science Quarterly 44, 4 (Dec. 1999), 741–763. https://doi.org/10.2307/2667054",
      "doi": ""
    },
    {
      "text": "Sinead Keeney, Felicity Hasson, and Hugh McKenna. 2011. Analysing Data from a Delphi and Reporting Results. In The Delphi Technique in Nursing and Health Research, Sinead Keeney, Felicity Hasson, and Hugh McKenna (Eds.). John Wiley & Sons, Ltd, Toronto, Ontario, Canada, Chapter 6, 84–95. https://doi.org/10.1002/9781444392029.ch6",
      "doi": ""
    },
    {
      "text": "Arto Lanamäki, Netta Iivari, Mikko Rajanen, and Henrik Hedberg. 2015. Battle over Media Choice: Multiplex Tensions in the Online Community of Wikipedia. In 23rd European Conference on Information Systems (ECIS)-2015 Completed Research Papers. European Research Centre for Information Systems, Münster, Germany, 1–18.",
      "doi": ""
    },
    {
      "text": "Yu Wei Lin. 2011. A qualitative enquiry into OpenStreetMap making. New Review of Hypermedia and Multimedia 17, 1 (April 2011), 53–71. https://doi.org/10.1080/13614568.2011.552647",
      "doi": "10.1080/13614568.2011.552647"
    },
    {
      "text": "Zarif Mahmud, Aarjav Chauhan, Dipto Sarkar, and Robert Soden. 2022. Revisiting Engagement in Humanitarian Mapping: An Updated Analysis of Contributor Retention in OpenStreetMap. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 251, 6 pages. https://doi.org/10.1145/3491101.3519728",
      "doi": "10.1145/3491101.3519728"
    },
    {
      "text": "Elizabeth Mannix and Karen. A. Jehn. 2004. Let’s Norm and Storm, but Not Right Now: Integrating Models of Group Development and Performance. In Research on Managing Groups and Teams: Time in Groups. JAI, Amsterdam; London:;, 11–38.",
      "doi": ""
    },
    {
      "text": "Sorin Adam Matei and Caius Dobrescu. 2011. Wikipedia’s “Neutral Point of View”: Settling Conflict through Ambiguity. The Information Society 27, 1 (2011), 40–51. https://doi.org/10.1080/01972243.2011.534368",
      "doi": "10.1080/01972243.2011.534368"
    },
    {
      "text": "J. N. Matias, S. Benesch, P. Earley, T. Gillespie, B. Keegan, N. Levy, and E. Maher. 2015. Research: Online Harassment Resource Guide. Retrieved 14 November, 2022 from https://meta.wikimedia.org/wiki/Research:Online_harassment_resource_guide",
      "doi": ""
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The Heart Work of Wikipedia: Gendered, Emotional Labor in the World’s Largest Online Encyclopedia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 207–210. https://doi.org/10.1145/2702123.2702514",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "Jonathan T. Morgan and Anna Filippova. 2018. “Welcome” Changes? Descriptive and Injunctive Norms in a Wikipedia Sub-Community. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 52 (Nov. 2018), 26 pages. https://doi.org/10.1145/3274321",
      "doi": "10.1145/3274321"
    },
    {
      "text": "Pascal Neis and Alexander Zipf. 2012. Analyzing the Contributor Activity of a Volunteered Geographic Information Project – The Case of OpenStreetMap. ISPRS International Journal of Geo-Information 1, 2 (July 2012), 146–165. https://doi.org/10.3390/ijgi1020146",
      "doi": ""
    },
    {
      "text": "Siobhan O’Mahony and Fabrizio Ferraro. 2007. The Emergence of Governance in an Open Source Community. Academy of Management Journal 50 (10 2007), 1079–1106. https://doi.org/10.5465/AMJ.2007.27169153",
      "doi": ""
    },
    {
      "text": "OpenStreetMap. 2019. Organised Editing Guidelines. Retrieved February 02, 2022 from https://wiki.openstreetmap.org/wiki/Etiquette/Etiquette_Guidelines",
      "doi": ""
    },
    {
      "text": "OpenStreetMap. 2020. Facebook (company). Retrieved March 03, 2020 from https://wiki.openstreetmap.org/wiki/Facebook_(company)",
      "doi": ""
    },
    {
      "text": "OpenStreetMap. 2021. Etiquette/Etiquette Guidelines. Retrieved February 02, 2022 from https://wiki.openstreetmap.org/wiki/Etiquette/Etiquette_Guidelines",
      "doi": ""
    },
    {
      "text": "Leysia Palen, Robert Soden, T. Jennings Anderson, and Mario Barrenechea. 2015. Success & Scale in a Data-Producing Organization: The Socio-Technical Evolution of OpenStreetMap in Response to Humanitarian Events. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 4113–4122. https://doi.org/10.1145/2702123.2702294",
      "doi": "10.1145/2702123.2702294"
    },
    {
      "text": "Giovanni Quattrone, Afra Mashhadi, and Licia Capra. 2014. Mind the Map: The Impact of Culture and Economic Affluence on Crowd-Mapping Behaviours. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 934–944. https://doi.org/10.1145/2531602.2531713",
      "doi": "10.1145/2531602.2531713"
    },
    {
      "text": "Afzalur M. Rahim. 2002. Toward a Theory of Managing Organizational Conflict. International Journal of Conflict Management 13, 3(2002), 206–235. https://doi.org/10.2139/ssrn.437684",
      "doi": ""
    },
    {
      "text": "Afzalur M. Rahim and Thomas V. Bonoma. 1979. Managing Organizational Conflict: A Model for Diagnosis and Intervention. Psychological Reports 44, 3_suppl (1979), 1323–1344. https://doi.org/10.2466/pr0.1979.44.3c.1323",
      "doi": ""
    },
    {
      "text": "Michael Raish. 2019. Identifying and Classifying Harassment in Arabic Wikipedia: A “Netnography”. Technical Report. Wikimedia Foundation.",
      "doi": ""
    },
    {
      "text": "Ruqin Ren and Bei Yan. 2017. Crowd Diversity and Performance in Wikipedia: The Mediating Effects of Task Conflict and Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6342–6351. https://doi.org/10.1145/3025453.3025992",
      "doi": "10.1145/3025453.3025992"
    },
    {
      "text": "Jon Russell. 2018. Grab is messing up the world’s largest mapping community’s data in Southeast Asia. Retrieved October 23, 2019 from https://techcrunch.com/2018/12/19/grabmapsosmthailandsoutheastasia/",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Felicia Ng, Zheng Yao, and Geoff Kaufman. 2018. Applications of Social Identity Theory to Research and Design in Computer-Supported Cooperative Work. Proceedings of the ACM on Human-Computer Interaction 2, CSCW, Article 201 (Nov. 2018), 34 pages. https://doi.org/10.1145/3274771",
      "doi": "10.1145/3274771"
    },
    {
      "text": "Bongwon Suh, Ed H. Chi, Bryan A. Pendleton, and Aniket Kittur. 2007. Us vs. Them: Understanding Social Dynamics in Wikipedia with Revert Graph Visualizations. In 2007 IEEE Symposium on Visual Analytics Science and Technology. IEEE, Sacramento, CA, USA, 163–170. https://doi.org/10.1109/VAST.2007.4389010",
      "doi": "10.1109/VAST.2007.4389010"
    },
    {
      "text": "Nathan TeBlunthuis, Aaron Shaw, and Benjamin Mako Hill. 2018. Revisiting \"The Rise and Decline\" in a Population of Peer Production Projects. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3173574.3173929",
      "doi": "10.1145/3173574.3173929"
    },
    {
      "text": "Guillaume Touya, Vyron Antoniou, Ana-Maria Olteanu-Raimond, and Marie-Dominique Van Damme. 2017. Assessing Crowdsourced POI Quality: Combining Methods Based on Reference Data, History, and Spatial Relations. ISPRS International Journal of Geo-Information 6, 3 (March 2017), 80. https://doi.org/10.3390/ijgi6030080",
      "doi": ""
    },
    {
      "text": "W. Ben Towne, Aniket Kittur, Peter Kinnaird, and James Herbsleb. 2013. Your Process is Showing: Controversy Management and Perceived Quality in Wikipedia. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1059–1068. https://doi.org/10.1145/2441776.2441896",
      "doi": "10.1145/2441776.2441896"
    },
    {
      "text": "Quy Thy Truong, Guillaume Touya, and Cyril de Runz. 2018. Towards vandalism detection in OpenStreetMap through a data driven approach. In International Conference on Geographic Information Science (GIScience). Schloss Dagstuhl–Leibniz-Zentrum fuer Informatik, Germany, 61:1–61:7.",
      "doi": ""
    },
    {
      "text": "Quy Thy Truong, Guillaume Touya, and Cyril de Runz. 2020. OSMWatchman: Learning How to Detect Vandalized Contributions in OSM Using a Random Forest Classifier. ISPRS International Journal of Geo-Information 9, 9(2020), 504.",
      "doi": ""
    },
    {
      "text": "János Török, Gerardo Iñiguez, Taha Yasseri, Maxi Miguel, Kimmo Kaski, and János Kertész. 2013. Opinions, Conflicts, and Consensus: Modeling Social Dynamics in a Collaborative Environment. Physical review letters 110 (2013), 088701. https://doi.org/10.1103/PhysRevLett.110.088701",
      "doi": ""
    },
    {
      "text": "Fernanda B. Viégas, Martin Wattenberg, and Kushal Dave. 2004. Studying Cooperation and Conflict between Authors with History Flow Visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vienna, Austria). Association for Computing Machinery, New York, NY, USA, 575––582. https://doi.org/10.1145/985692.985765",
      "doi": "10.1145/985692.985765"
    },
    {
      "text": "Wikimedia. 2022. Wikimedia 2030 Movement Strategy Recommendations. Retrieved November 10, 2022 from https://meta.wikimedia.org/wiki/Movement_Strategy/Recommendations",
      "doi": ""
    },
    {
      "text": "Serge Wroclawski. 2014. Introducing Changeset Discussions. Retrieved June 9, 2022 from https://blog.openstreetmap.org/2014/11/02/introducing-changeset-discussions/",
      "doi": ""
    },
    {
      "text": "Pujan Ziaie and Medin Imamovic. 2013. Lifecycle-based evolution of features in collaborative open production communities: the case of Wikipedia. In 21st European Conference on Information Systems(Proceedings of the 21st European Conference on Information Systems). European Research Centre for Information Systems, Utrecht, The Netherlands, 1–12.",
      "doi": ""
    }
  ]
}