{
  "doi": "10.1145/3544548.3581341",
  "title": "Love on the Spectrum: Toward Inclusive Online Dating Experience of Autistic Individuals",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Online dating is a space where autistic individuals can find romantic partners with reduced social demands. Autistic individuals are often expected to adapt their behaviors to the social norms underlying the online dating platform to appear as desirable romantic partners. However, given that their autistic traits can lead them to different expectations of dating, it is uncertain whether conforming their behaviors to the norm will guide them to the person they truly want. In this paper, we explored the perceptions and expectations of autistic adults in online dating through interviews and workshops. We found that autistic people desired to know whether they behaved according to the platform’s norms. Still, they expected to keep their unique characteristics rather than unconditionally conform to the norm. We conclude by providing suggestions for designing inclusive online dating experiences that could foster self-guided decisions of autistic users and embrace their unique characteristics.",
  "authors": [
    {
      "name": "Dasom Choi",
      "institution": "Department of Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526494",
      "orcid": "0000-0002-3392-6243"
    },
    {
      "name": "Sung-In Kim",
      "institution": "Medical division, Seoul Dasiseogi Homless Support Center, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214465",
      "orcid": "0000-0001-7627-2756"
    },
    {
      "name": "Sunok Lee",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367308",
      "orcid": "0000-0002-8518-7315"
    },
    {
      "name": "Hyunseung Lim",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700693",
      "orcid": "0000-0002-5645-1009"
    },
    {
      "name": "Hee Jeong Yoo",
      "institution": "Seoul National University Bundang Hospital, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659433099",
      "orcid": "0000-0003-0521-2718"
    },
    {
      "name": "Hwajung Hong",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022414",
      "orcid": "0000-0001-5268-3331"
    }
  ],
  "references": [
    {
      "text": "Kalaivani Annadorai, Pramela Krish, Azianura Hani Shaari, and Mohammad Rahim Kamaluddin. 2018. Mapping Computer Mediated Communication Theories and Persuasive Strategies in Analysing Online Dating Romance Scam. Journal of Xi’an Shiyou University ISSN No 1673 (2018), 064X.",
      "doi": ""
    },
    {
      "text": "AspieSingles. accessed 2022. AspieSingles. Retrieved September 09, 2022 from https://www.aspie-singles.com/",
      "doi": ""
    },
    {
      "text": "atlas.ti. accessed 2022. atlas.ti. Retrieved September 09, 2022 from https://atlasti.com",
      "doi": ""
    },
    {
      "text": "Karla Badillo-Urquiola, Chhaya Chouhan, Stevie Chancellor, Munmun De Choudhary, and Pamela Wisniewski. 2020. Beyond Parental Control: Designing Adolescent Online Safety Apps Using Value Sensitive Design. Journal of Adolescent Research 35, 1 (2020), 147–175. https://doi.org/10.1177/0743558419884692 arXiv:https://doi.org/10.1177/0743558419884692",
      "doi": ""
    },
    {
      "text": "Karla Badillo-Urquiola, Scott Harpin, and Pamela Wisniewski. 2017. Abandoned but Not Forgotten: Providing Access While Protecting Foster Youth from Online Risks. In Proceedings of the 2017 Conference on Interaction Design and Children (Stanford, California, USA) (IDC ’17). Association for Computing Machinery, New York, NY, USA, 17–26. https://doi.org/10.1145/3078072.3079724",
      "doi": "10.1145/3078072.3079724"
    },
    {
      "text": "Simon Baron-Cohen, Rebecca C. Knickmeyer, and Matthew K. Belmonte. 2005. Sex Differences in the Brain: Implications for Explaining Autism. Science 310, 5749 (2005), 819–823. https://doi.org/10.1126/science.1115455 arXiv:https://www.science.org/doi/pdf/10.1126/science.1115455",
      "doi": ""
    },
    {
      "text": "Matthew Bennett, Amanda A. Webster, Emma Goodall, and Susannah Rowland. 2018. Intimacy and Romance Across the Autism Spectrum: Unpacking the “Not Interested in Sex” Myth. Springer Singapore, Singapore, 195–211. https://doi.org/10.1007/978-981-13-3359-0_10",
      "doi": ""
    },
    {
      "text": "Laura Benton, Hilary Johnson, Emma Ashwin, Mark Brosnan, and Beate Grawemeyer. 2012. Developing IDEAS: Supporting Children with Autism within a Participatory Design Team. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2599–2608. https://doi.org/10.1145/2207676.2208650",
      "doi": "10.1145/2207676.2208650"
    },
    {
      "text": "OkCupid Dating Blog. accessed 2022. Exactly What To Say In A First Message. Retrieved September 09, 2022 from https://theblog.okcupid.com/exactly-what-to-say-in-a-first-message-2bf680806c72",
      "doi": ""
    },
    {
      "text": "Kristen Bottema-Beutel, Steven K. Kapp, Jessica Nina Lester, Noah J. Sasson, and Brittany N. Hand. 2021. Avoiding Ableist Language: Suggestions for Autism Researchers. Autism in Adulthood 3, 1 (2021), 18–29. https://doi.org/10.1089/aut.2020.0014 arXiv:https://doi.org/10.1089/aut.2020.0014",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa arXiv:https://www.tandfonline.com/doi/pdf/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Mark Brosnan and Jeff Gavin. 2015. Why those with an autism spectrum disorder (ASD) thrive in online cultures but suffer in offline cultures. The Wiley handbook of psychology, technology, and society (2015), 250.",
      "doi": ""
    },
    {
      "text": "M Brosnan and J Gavin. 2021. The Impact of Stigma, Autism Label and Wording on the Perceived Desirability of the Online Dating Profiles of Men on the Autism Spectrum. Journal of Autism and Developmental Disorders 51, 11(2021), 4077–4085. https://doi.org/10.1007/s10803-020-04830-8",
      "doi": ""
    },
    {
      "text": "Bumble. accessed 2022. Bumble. Retrieved September 09, 2022 from https://bumble.com/",
      "doi": ""
    },
    {
      "text": "Moira Burke, Robert Kraut, and Diane Williams. 2010. Social Use of Computer-Mediated Communication by Adults on the Autism Spectrum. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (Savannah, Georgia, USA) (CSCW ’10). Association for Computing Machinery, New York, NY, USA, 425–434. https://doi.org/10.1145/1718918.1718991",
      "doi": "10.1145/1718918.1718991"
    },
    {
      "text": "E Sandra Byers, Shana Nichols, and Susan D Voyer. 2013. Challenging stereotypes: Sexual functioning of single adults with high functioning autism spectrum disorder. Journal of autism and developmental disorders 43, 11(2013), 2617–2627. https://doi.org/10.1007/s10803-013-1813-z",
      "doi": ""
    },
    {
      "text": "Bronwyn Carlson. 2020. Love and hate at the Cultural Interface: Indigenous Australians and dating apps. Journal of Sociology 56, 2 (2020), 133–150. https://doi.org/10.1177/1440783319833181",
      "doi": ""
    },
    {
      "text": "Nancy C Cheak-Zamora, Michelle Teti, Anna Maurer-Batjer, Karen V O’Connor, and Jena K Randolph. 2019. Sexual and relationship interest, knowledge, and experiences among adolescents and young adults with autism spectrum disorder. Archives of sexual Behavior 48, 8 (2019), 2605–2615. https://doi.org/10.1007/s10508-019-1445-2",
      "doi": ""
    },
    {
      "text": "CNBC. accessed 2022. Online daters lost a record $547 million to scams in 2021. How to stay safe, according to Nev Schulman from MTV’s ‘Catfish’. Retrieved September 09, 2022 from https://www.cnbc.com/2022/03/08/online-daters-lost-a-record-547-million-to-scams-in-2021.html",
      "doi": ""
    },
    {
      "text": "Inclusive design research centre of OCAD University. accessed 2022. What is Inclusive Design. Retrieved September 09, 2022 from https://legacy.idrc.ocadu.ca/about-the-idrc/49-resources/online-resources/articles-and-papers/443-whatisinclusivedesign",
      "doi": ""
    },
    {
      "text": "Kelley D. Drummond. 2013. Self-concept, behavioural attributions and self-awareness in adolescents with Autism Spectrum Disorder: A mixed-methods approach. Ph. D. Dissertation. https://www.proquest.com/dissertations-theses/self-concept-behavioural-attributions-awareness/docview/1501462525/se-2 Copyright - Database copyright ProQuest LLC; ProQuest does not claim copyright in the individual underlying works; Last updated - 2022-10-20.",
      "doi": ""
    },
    {
      "text": "Stefanie Duguay. 2017. Dressing up Tinderella: interrogating authenticity claims on the mobile dating app Tinder. Information, Communication & Society 20, 3 (2017), 351–367. https://doi.org/10.1080/1369118X.2016.1168471 arXiv:https://doi.org/10.1080/1369118X.2016.1168471",
      "doi": ""
    },
    {
      "text": "Meredyth Goldberg Edelson. 2010. Sexual Abuse of Children with Autism: Factors that Increase Risk and Interfere with Recognition of Abuse.Disability Studies Quarterly 30, 1 (2010), 16. https://search.ebscohost.com/login.aspx?direct=true&db=eue&AN=48487289&site=eds-live",
      "doi": ""
    },
    {
      "text": "eharmony. accessed 2022. EHARMONY’S COMPATIBILITY SCORES EXPLAINED. Retrieved September 09, 2022 from https://www.eharmony.com/tour/faq/explanation-of-compatibility-scores/",
      "doi": ""
    },
    {
      "text": "Julia R. Fernandez and Jeremy Birnholtz. 2019. \"I Don’t Want Them to Not Know\": Investigating Decisions to Disclose Transgender Identity on Dating Platforms. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 226 (nov 2019), 21 pages. https://doi.org/10.1145/3359328",
      "doi": "10.1145/3359328"
    },
    {
      "text": "Eli J. Finkel, Paul W. Eastwick, Benjamin R. Karney, Harry T. Reis, and Susan Sprecher. 2012. Online Dating: A Critical Analysis From the Perspective of Psychological Science. Psychological Science in the Public Interest 13, 1 (2012), 3–66. https://doi.org/10.1177/1529100612436522 arXiv:https://doi.org/10.1177/1529100612436522PMID: 26173279.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Katta Spiel, and Julia Makhaeva. 2019. Thinking OutsideTheBox - Designing Smart Things with Autistic Children. International Journal of Human–Computer Interaction 35, 8(2019), 666–678. https://doi.org/10.1080/10447318.2018.1550177 arXiv:https://doi.org/10.1080/10447318.2018.1550177PMID: 31057337.",
      "doi": ""
    },
    {
      "text": "Jeff Gavin, Daisie Rees-Evans, and Mark Brosnan. 2019. Shy Geek, Likes Music, Technology, and Gaming: An Examination of Autistic Males’ Online Dating Profiles. Cyberpsychology, Behavior, and Social Networking 22, 5(2019), 344–348. https://doi.org/10.1089/cyber.2018.0607 arXiv:https://doi.org/10.1089/cyber.2018.0607PMID: 30939034.",
      "doi": ""
    },
    {
      "text": "Jeff Gavin, Daisie Rees-Evans, Amy Duckett, and Mark Brosnan. 2019. The attractiveness, trustworthiness and desirability of autistic males’ online dating profiles. Computers in Human Behavior 98 (2019), 189–195. https://doi.org/10.1016/j.chb.2019.04.016",
      "doi": "10.1016/j.chb.2019.04.016"
    },
    {
      "text": "Jennifer L. Gibbs, Nicole B. Ellison, and Chih-Hui Lai. 2011. First Comes Love, Then Comes Google: An Investigation of Uncertainty Reduction Strategies and Self-Disclosure in Online Dating. Communication Research 38, 1 (2011), 70–100. https://doi.org/10.1177/0093650210377091 arXiv:https://doi.org/10.1177/0093650210377091",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 2009. Stigma: Notes on the management of spoiled identity. Simon and schuster.",
      "doi": ""
    },
    {
      "text": "Kathryn Greene, Valerian J Derlega, and Alicia Mathews. 2006. Self-Disclosure in Personal Relationships.(2006). https://doi.org/10.1017/CBO9780511606632.023",
      "doi": ""
    },
    {
      "text": "Grace Hancock, Mark A Stokes, and Gary Mesibov. 2020. Differences in romantic relationship experiences for individuals with an autism spectrum disorder. Sexuality and Disability 38, 2 (2020), 231–245. https://doi.org/10.1007/s11195-019-09573-8",
      "doi": ""
    },
    {
      "text": "Mark J. Handel and Irina Shklovski. 2012. Disclosure, Ambiguity and Risk Reduction in Real-Time Dating Sites. In Proceedings of the 17th ACM International Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’12). Association for Computing Machinery, New York, NY, USA, 175–178. https://doi.org/10.1145/2389176.2389203",
      "doi": "10.1145/2389176.2389203"
    },
    {
      "text": "Gillian R Hayes, Sen Hirano, Gabriela Marcu, Mohamad Monibi, David H Nguyen, and Michael Yeganyan. 2010. Interactive visual supports for children with autism. Personal and ubiquitous computing 14, 7 (2010), 663–680. https://doi.org/10.1007/s00779-010-0294-8",
      "doi": "10.1007/s00779-010-0294-8"
    },
    {
      "text": "Aaron Hess and Carlos Flores. 2018. Simply more than swiping left: A critical analysis of toxic masculine performances on Tinder Nightmares. New Media and Society 20, 3 (1 mar 2018), 1085–1102. https://doi.org/10.1177/1461444816681540 Publisher Copyright: © 2016, © The Author(s) 2016..",
      "doi": ""
    },
    {
      "text": "HiKi. accessed 2022. HiKi. Retrieved September 09, 2022 from https://www.hikiapp.com/",
      "doi": ""
    },
    {
      "text": "Mitchell Hobbs, Stephen Owen, and Livia Gerber. 2017. Liquid love? Dating apps, sex, relationships and the digital transformation of intimacy. Journal of Sociology 53, 2 (2017), 271–284. https://doi.org/10.1177/1440783316662718 arXiv:https://doi.org/10.1177/1440783316662718",
      "doi": ""
    },
    {
      "text": "Jevan A. Hutson, Jessie G. Taft, Solon Barocas, and Karen Levy. 2018. Debiasing Desire: Addressing Bias & Discrimination on Intimate Platforms. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 73 (nov 2018), 18 pages. https://doi.org/10.1145/3274342",
      "doi": "10.1145/3274342"
    },
    {
      "text": "Denise C Kellaher. 2015. Sexual behavior and autism spectrum disorders: an update and discussion. Current psychiatry reports 17, 4 (2015), 1–8. https://doi.org/10.1007/s11920-015-0562-4",
      "doi": ""
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-Tracking for Mental Wellness: Understanding Expert Perspectives and Student Experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 629–641. https://doi.org/10.1145/3025453.3025750",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Lorcan Kenny, Caroline Hattersley, Bonnie Molins, Carole Buckley, Carol Povey, and Elizabeth Pellicano. 2016. Which terms should be used to describe autism? Perspectives from the UK autism community. Autism 20, 4 (2016), 442–462. https://doi.org/10.1177/136236131558820",
      "doi": ""
    },
    {
      "text": "Jennifer G. Kim, Taewan Kim, Sung-In Kim, So-youn Jang, Eun Bin (Stephanie) Lee, Heejung Yoo, Kyungsik Han, and Hwajung Hong. 2022. The Workplace Playbook VR: Exploring the Design Space of Virtual Reality to Foster Understanding of and Support for Autistic People. Proc. ACM Hum.-Comput. Interact. 6, CSCW2, Article 357 (nov 2022), 24 pages. https://doi.org/10.1145/3555082",
      "doi": "10.1145/3555082"
    },
    {
      "text": "Sung-In Kim, Eunkyung Jo, Myeonghan Ryu, Inha Cha, Young-Ho Kim, Heejung Yoo, and Hwajung Hong. 2019. Toward Becoming a Better Self: Understanding Self-Tracking Experiences of Adolescents with Autism Spectrum Disorder Using Custom Trackers. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare(Trento, Italy) (PervasiveHealth’19). Association for Computing Machinery, New York, NY, USA, 169–178. https://doi.org/10.1145/3329189.3329209",
      "doi": "10.1145/3329189.3329209"
    },
    {
      "text": "Sean Kolhoff. 2021. Romantic Miscalculations on Dating Applications: Definitions and Experiences of Mobile Dating Micro-Rejection. Ph. D. Dissertation. Wayne State University.",
      "doi": ""
    },
    {
      "text": "A. Krzywicki, W. Wobcke, Y.S. Kim, X. Cai, M. Bain, A. Mahidadia, and P. Compton. 2015. Collaborative Filtering for people-to-people recommendation in online dating: Data analysis and user trial. International Journal of Human-Computer Studies 76 (2015), 50–66. https://doi.org/10.1016/j.ijhcs.2014.12.003",
      "doi": "10.1016/j.ijhcs.2014.12.003"
    },
    {
      "text": "Richard E. Ladner and Sheryl Burgstahler. 2015. Increasing the Participation of Individuals with Disabilities in Computing. Commun. ACM 58, 12 (nov 2015), 33–36. https://doi.org/10.1145/2835961",
      "doi": "10.1145/2835961"
    },
    {
      "text": "Theodora Lau and Uday Akkaraju. 2019. When algorithms decide whose voices will be heard. Harvard Business Review(2019).",
      "doi": ""
    },
    {
      "text": "Kirsty Macmillan, Tessa Berg, Mike Just, and Mary Stewart. 2020. Are Autistic Children More Vulnerable Online? Relating Autism to Online Safety, Child Wellbeing and Parental Risk Management. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society (Tallinn, Estonia) (NordiCHI ’20). Association for Computing Machinery, New York, NY, USA, Article 14, 11 pages. https://doi.org/10.1145/3419249.3420160",
      "doi": "10.1145/3419249.3420160"
    },
    {
      "text": "Elizabeth Mazur. 2022. Online Dating Experiences of LGBTQ+ Emerging Adults With Disabilities. Sexuality and Disability 40, 2 (2022), 213–231. https://doi.org/10.1007/s11195-022-09726-2",
      "doi": ""
    },
    {
      "text": "Ryan A Miller, Brett Ranon Nachman, and Richmond D Wynn. 2020. \" I Feel Like They are all Interconnected\": Understanding the Identity Management Narratives of Autistic LGBTQ College Students. College Student Affairs Journal 38, 1 (2020), 1–15.",
      "doi": ""
    },
    {
      "text": "Karim Nader. 2020. DATING THROUGH THE FILTERS. Social Philosophy and Policy 37, 2 (2020), 237–248. https://doi.org/10.1017/S0265052521000133",
      "doi": ""
    },
    {
      "text": "Karim Nader and Min Kyung Lee. 2022. Folk Theories and User Strategies on Dating Apps. In Information for a Better World: Shaping the Global Future, Malte Smits (Ed.). Springer International Publishing, Cham, 445–458.",
      "doi": ""
    },
    {
      "text": "Shana Nichols, Gina Marie Moravcik, and Samara Pulver Tetenbaum. 2009. Girls growing up on the autism spectrum: What parents and professionals should know about the pre-teen and teenage years. Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "OkCupid. accessed 2022. How is Match Percentage Calculated? Discover All Our Matching System Secrets. Retrieved September 09, 2022 from https://help.okcupid.com/hc/en-us/articles/5221215995149-How-is-Match-Percentage-Calculated-Discover-All-Our-Matching-System-Secrets",
      "doi": ""
    },
    {
      "text": "OkCupid. accessed 2022. OkCupid. Retrieved September 09, 2022 from https://www.okcupid.com/",
      "doi": ""
    },
    {
      "text": "Xinru Page, Andrew Capener, Spring Cullen, Tao Wang, Monica Garfield, and Pamela J. Wisniewski. 2022. Perceiving Affordances Differently: The Unintended Consequences When Young Autistic Adults Engage with Social Media. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 144, 21 pages. https://doi.org/10.1145/3491102.3517596",
      "doi": "10.1145/3491102.3517596"
    },
    {
      "text": "Lorenza Parisi and Francesca Comunello. 2020. Dating in the time of “relational filter bubbles”: exploring imaginaries, perceptions and tactics of Italian dating app users. The Communication Review 23, 1 (2020), 66–89. https://doi.org/10.1080/10714421.2019.1704111",
      "doi": ""
    },
    {
      "text": "Sarah Parsons, Nicola Yuill, Judith Good, and Mark Brosnan. 2020. ‘Whose agenda? Who knows best? Whose voice?’ Co-creating a technology research roadmap with autism stakeholders. Disability & Society 35, 2 (2020), 201–234. https://doi.org/10.1080/09687599.2019.1624152 arXiv:https://doi.org/10.1080/09687599.2019.1624152",
      "doi": ""
    },
    {
      "text": "Iva Paska. [n. d.]. Fast Choices and Emancipatory Spaces: Complex Reality of Online dating Apps. American Sociological Review 77, 4 ([n. d.]), 523.",
      "doi": ""
    },
    {
      "text": "John R. Porter, Kiley Sobel, Sarah E. Fox, Cynthia L. Bennett, and Julie A. Kientz. 2017. Filtered Out: Disability Disclosure Practices in Online Dating Communities. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 87 (dec 2017), 13 pages. https://doi.org/10.1145/3134722",
      "doi": "10.1145/3134722"
    },
    {
      "text": "Aunshul Rege. 2009. What’s Love Got to Do with It? Exploring Online Dating Scams and Identity Fraud. International Journal of Cyber Criminology 3, 2 (Jul 2009), 494–512. https://www.proquest.com/scholarly-journals/whats-love-got-do-with-exploring-online-dating/docview/763181753/se-2 Copyright - Copyright International Journal of Cyber Criminology Jul-Dec 2009; Document feature - Tables; ; Last updated - 2011-06-04.",
      "doi": ""
    },
    {
      "text": "Jessica N. Rocheleau and Sonia Chiasson. 2022. Privacy and Safety on Social Networking Sites: Autistic and Non-Autistic Teenagers’ Attitudes and Behaviors. ACM Trans. Comput.-Hum. Interact. 29, 1, Article 1 (jan 2022), 39 pages. https://doi.org/10.1145/3469859",
      "doi": "10.1145/3469859"
    },
    {
      "text": "Michael J. Rosenfeld and Reuben J. Thomas. 2012. Searching for a Mate: The Rise of the Internet as a Social Intermediary. American Sociological Review 77, 4 (2012), 523–547. https://doi.org/10.1177/0003122412448050 arXiv:https://doi.org/10.1177/0003122412448050",
      "doi": ""
    },
    {
      "text": "Matthew Roth. 2015. Surfing Safely: An Examination of Online Dating Skills in Young Adults with Autism Spectrum Disorder. Ph. D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Matthew E Roth and Jennifer M Gillis. 2015. “Convenience with the click of a mouse”: A survey of adults with autism spectrum disorder on online dating. Sexuality and Disability 33, 1 (2015), 133–150. https://doi.org/10.1007/s11195-014-9392-2",
      "doi": ""
    },
    {
      "text": "Giorgia Sala, Merrilyn Hooley, and Mark A Stokes. 2020. Romantic intimacy in autism: A qualitative analysis. Journal of autism and developmental disorders 50, 11(2020), 4133–4147. https://doi.org/10.1007/s10803-020-04377-8",
      "doi": ""
    },
    {
      "text": "Natasha Saltes. 2013. Disability, identity and disclosure in the online dating environment. Disability & Society 28, 1 (2013), 96–109. https://doi.org/10.1080/09687599.2012.695577",
      "doi": ""
    },
    {
      "text": "Marsha Mailick Seltzer, Marty Wyngaarden Krauss, Paul T Shattuck, Gael Orsmond, April Swe, and Catherine Lord. 2003. The symptoms of autism spectrum disorders in adolescence and adulthood. Journal of autism and developmental disorders 33, 6 (2003), 565–581. https://doi.org/10.1023/B:JADD.0000005995.02453.0b",
      "doi": ""
    },
    {
      "text": "Melina Sevlever, Matthew E Roth, and Jennifer M Gillis. 2013. Sexual abuse and offending in autism spectrum disorders. Sexuality and Disability 31, 2 (2013), 189–200. https://doi.org/10.1007/s11195-013-9286-8",
      "doi": ""
    },
    {
      "text": "Liesel L. Sharabi. 2022. Finding Love on a First Data: Matching Algorithms in Online Dating. Harvard Data Science Review 4, 1 (jan 27 2022). https://hdsr.mitpress.mit.edu/pub/i4eb4e8b.",
      "doi": ""
    },
    {
      "text": "Will Simm, Maria Angela Ferrario, Adrian Gradinar, Marcia Tavares Smith, Stephen Forshaw, Ian Smith, and Jon Whittle. 2016. Anxiety and Autism: Towards Personalized Digital Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1270–1281. https://doi.org/10.1145/2858036.2858259",
      "doi": "10.1145/2858036.2858259"
    },
    {
      "text": "Will Simm, Maria Angela Ferrario, Adrian Gradinar, and Jon Whittle. 2014. Prototyping ’Clasp’: Implications for Designing Digital Technology for and with Adults with Autism. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 345–354. https://doi.org/10.1145/2598510.2600880",
      "doi": "10.1145/2598510.2600880"
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Os Keyes, and Geraldine Fitzpatrick. 2019. Agency of Autistic Children in Technology Research—A Critical Literature Review. ACM Trans. Comput.-Hum. Interact. 26, 6, Article 38 (nov 2019), 40 pages. https://doi.org/10.1145/3344919",
      "doi": "10.1145/3344919"
    },
    {
      "text": "Sandra Strunz, Constanze Schermuck, Sarah Ballerstein, Christoph J. Ahlers, Isabel Dziobek, and Stefan Roepke. 2017. Romantic Relationships and Relationship Satisfaction Among Adults With Asperger Syndrome and High-Functioning Autism. Journal of Clinical Psychology 73, 1 (2017), 113–125. https://doi.org/10.1002/jclp.22319 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/jclp.22319",
      "doi": ""
    },
    {
      "text": "tinder. accessed 2022. tinder. Retrieved September 09, 2022 from https://tinder.com/",
      "doi": ""
    },
    {
      "text": "Catalina L. Toma and Jeffrey T. Hancock. 2010. Looks and Lies: The Role of Physical Attractiveness in Online Dating Self-Presentation and Deception. Communication Research 37, 3 (2010), 335–351. https://doi.org/10.1177/0093650209356437 arXiv:https://doi.org/10.1177/0093650209356437",
      "doi": ""
    },
    {
      "text": "Stephanie Tom Tong, Elena F Corriero, Kunto Adi Wibowo, Taj W Makki, and Richard B Slatcher. 2020. Self-presentation and impressions of personality through text-based online dating profiles: A lens model analysis. New Media & Society 22, 5 (2020), 875–895. https://doi.org/10.1177/1461444819872678 arXiv:https://doi.org/10.1177/1461444819872678",
      "doi": ""
    },
    {
      "text": "STEPHANIE T. TONG, JEFFREY T. HANCOCK, and RICHARD B. SLATCHER. 2016. ARTICLE. Personal Relationships 23, 4 (12 2016), 645 – 662. https://doi.org/10.1111/pere.12158",
      "doi": ""
    },
    {
      "text": "Stephanie Tom Tong and Joseph B. Walther. 2011. Just say ‘‘no thanks’’: Romantic rejection in computer-mediated communication. Journal of Social and Personal Relationships 28, 4(2011), 488–506. https://doi.org/10.1177/0265407510384895 arXiv:https://doi.org/10.1177/0265407510384895",
      "doi": ""
    },
    {
      "text": "Paul Whiteley, Lynda Todd, Kevin Carr, and Shattock Paul. 2010. Gender ratios in autism, Asperger syndrome and autism spectrum disorder. Autism Insights (2010), 17–25.",
      "doi": ""
    },
    {
      "text": "Monica T. Whitty. 2008. Revealing the ‘real’ me, searching for the ‘actual’ you: Presentations of self on an internet dating site. Computers in Human Behavior 24, 4 (2008), 1707–1723. https://doi.org/10.1016/j.chb.2007.07.002 Including the Special Issue: Integration of Human Factors in Networked Computing.",
      "doi": "10.1016/j.chb.2007.07.002"
    },
    {
      "text": "Monica T Whitty. 2015. Anatomy of the online dating romance scam. Security Journal 28, 4 (2015), 443–455. https://doi.org/10.1057/sj.2012.57",
      "doi": ""
    },
    {
      "text": "Cara Wilson, Margot Brereton, Bernd Ploderer, and Laurianne Sitbon. 2019. Co-Design Beyond Words: ’Moments of Interaction’ with Minimally-Verbal Children on the Autism Spectrum. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300251",
      "doi": "10.1145/3290605.3300251"
    },
    {
      "text": "Cara Wilson, Margot Brereton, Bernd Ploderer, Laurianne Sitbon, and Beth Saggers. 2017. Digital Strategies for Supporting Strengths- and Interests-Based Learning with Children with Autism. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 52–61. https://doi.org/10.1145/3132525.3132553",
      "doi": "10.1145/3132525.3132553"
    },
    {
      "text": "J Zhang and T Yasseri. 2016. What Happens After You Both Swipe Right: A Statistical Description of Mobile Dating Communications. (2016).",
      "doi": ""
    },
    {
      "text": "Annuska Zolyomi, Andrew Begel, Jennifer Frances Waldern, John Tang, Michael Barnett, Edward Cutrell, Daniel McDuff, Sean Andrist, and Meredith Ringel Morris. 2019. Managing Stress: The Needs of Autistic Adults in Video Calling. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 134 (nov 2019), 29 pages. https://doi.org/10.1145/3359236",
      "doi": "10.1145/3359236"
    }
  ]
}