{
  "doi": "10.1145/3544548.3581530",
  "title": "\"We Cried on Each Other’s Shoulders\": How LGBTQ+ Individuals Experience Social Support in Social Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Although social support can be a vital component of gender and sexual identity formation, many LGBTQ+ individuals often lack offline social networks for such support. Traditional online technologies also reveal several challenges in providing LGBTQ+ individuals with effective social support. Therefore, social VR, as a unique online space for immersive and embodied experiences, is becoming popular within LGBTQ+ communities for supportive online interactions. Drawing on 29 LGBTQ+ social VR users’ experiences, we investigate the types of social support LGBTQ+ users have experienced through social VR and how they leverage unique social VR features to experience such support. We provide one of the first empirical evidence of how social VR innovates traditional online support mechanisms to empower LGBTQ+ individuals but leads to new safety and equality concerns. We also propose important principles for rethinking social VR design to provide all users, rather than just the privileged few, with supportive experiences.",
  "authors": [
    {
      "name": "Lingyuan Li",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588610",
      "orcid": "0000-0002-8640-9936"
    },
    {
      "name": "Guo Freeman",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639182",
      "orcid": "0000-0001-5107-7794"
    },
    {
      "name": "Kelsea Schulenberg",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659959850",
      "orcid": "0000-0002-1503-7872"
    },
    {
      "name": "Dane Acena",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702414",
      "orcid": "0000-0002-2130-8683"
    }
  ],
  "references": [
    {
      "text": "Dane Acena and Guo Freeman. 2021. “In My Safe Space”: Social Support for LGBTQ Users in Social Virtual Reality. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": ""
    },
    {
      "text": "Terrance L Albrecht and Daena J Goldsmith. 2003. Social support, social networks, and health. In The Routledge handbook of health communication. Routledge, 277–298.",
      "doi": ""
    },
    {
      "text": "AltspaceVR. 2017. LGBTQ meetup. https://account.altvr.com/events/665327337784476504",
      "doi": ""
    },
    {
      "text": "AltspaceVR. 2022. LGBTQ+ and friends hang out. https://account.altvr.com/events/2039666805106016352",
      "doi": ""
    },
    {
      "text": "AltspaceVR. 2022. Pride XR. https://account.altvr.com/events/1754798824028635362",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Understanding and supporting fathers and fatherhood on social media sites. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1905–1914.",
      "doi": "10.1145/2702123.2702205"
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2018. Social support, reciprocity, and anonymity in responses to sexual abuse disclosures on social media. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 5(2018), 1–35.",
      "doi": "10.1145/3234942"
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. In Proceedings of the 2016 CHI conference on human factors in computing systems. 3906–3918.",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Nazanin Andalibi, Gabriela Marcu, Tim Moesgen, Rebecca Mullin, and Andrea Forte. 2018. Not alone: designing for self-disclosure and social support exchange after pregnancy loss. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3170427.3188473"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive Self-disclosures, Responses, and Social Support on Instagram: the case of# depression. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 1485–1500.",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Laima Augustaitis, Leland A Merrill, Kristi E Gamarel, and Oliver L Haimson. 2021. Online transgender health information seeking: facilitators, barriers, and future directions. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445091"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI conference on human factors in computing systems. 675–684.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Katherine Bessière, A Fleming Seay, and Sara Kiesler. 2007. The ideal elf: Identity exploration in World of Warcraft. Cyberpsychology & behavior 10, 4 (2007), 530–535.",
      "doi": ""
    },
    {
      "text": "L. Blackwell, N. Ellison, N. Elliott-Deflo, and R. Schwartz. 2019. Harassment in Social VR: Implications for Design. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 854–855. https://doi.org/10.1109/VR.2019.8798165",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in social VR: Implications for design. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 854–855.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT parents and social media: Advocacy, privacy, and disclosure during shifting social movements. In Proceedings of the 2016 CHI conference on human factors in computing systems. 610–622.",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Michael G Blight, Kristy Jagiello, and Erin K Ruppel. 2015. “Same stuff different day:” A mixed-method study of support seeking on Facebook. Computers in Human Behavior 53 (2015), 366–373.",
      "doi": ""
    },
    {
      "text": "Bradley J Bond and Brandon Miller. 2021. YouTube as my space: The relationships between YouTube, social connectedness, and (collective) self-esteem among LGBTQ individuals. New Media & Society(2021), 14614448211061830.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis.American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Brant R Burleson. 1994. Comforting messages: Significance, approaches, and effects. Communication of social support: Messages, interactions, relationships, and community (1994), 3–28.",
      "doi": ""
    },
    {
      "text": "Justin Buss, Hayden Le, and Oliver L Haimson. 2022. Transgender identity management across social media platforms. Media, Culture & Society 44, 1 (2022), 22–38.",
      "doi": ""
    },
    {
      "text": "Human Rights Campaign. 2021. Glossary of terms. https://www.hrc.org/resources/glossary-of-terms",
      "doi": ""
    },
    {
      "text": "Caleb T Carr, D Yvette Wohn, and Rebecca A Hayes. 2016. As social support: Relational closeness, automaticity, and interpreting social support from paralinguistic digital affordances in social media. Computers in Human Behavior 62 (2016), 385–393.",
      "doi": "10.1016/j.chb.2016.03.087"
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer visibility: Supporting LGBT+ selective visibility on social media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Amedeo Cesta, Silvia Coradeschi, Gabriella Cortellessa, Javier Gonzalez, Lorenza Tiberio, and Stephen Von Rump. 2010. Enabling social interaction through embodiment in ExCITE. In ForItAAL: Second Italian Forum on Ambient Assisted Living. 1–7.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory : a practical guide through qualitative analysis. Sage Publications, London; Thousand Oaks, Calif.http://www.amazon.com/Constructing-Grounded-Theory-Qualitative-Introducing/dp/0761973532",
      "doi": ""
    },
    {
      "text": "Sidney Cobb. 1976. Social support as a moderator of life stress.Psychosomatic medicine(1976).",
      "doi": ""
    },
    {
      "text": "Jan Colvin, Lillian Chenoweth, Mary Bold, and Cheryl Harding. 2004. Caregivers of older adults: Advantages and disadvantages of internet-based social support. Family Relations 53, 1 (2004), 49–57.",
      "doi": ""
    },
    {
      "text": "Robyn M Cooper and Warren J Blumenfeld. 2012. Responses to cyberbullying: A descriptive analysis of the frequency of and impact on LGBT and allied youth. Journal of LGBT Youth 9, 2 (2012), 153–177.",
      "doi": ""
    },
    {
      "text": "Shelley L Craig and Lauren McInroy. 2014. You can form a part of yourself online: The influence of new media on identity development and coming out for LGBTQ youth. Journal of Gay & Lesbian Mental Health 18, 1 (2014), 95–109.",
      "doi": ""
    },
    {
      "text": "Yichao Cui, Naomi Yamashita, Mingjie Liu, and Yi-Chieh Lee. 2022. “So Close, yet So Far”: Exploring Sexual-minority Women’s Relationship-building via Online Dating in China. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    },
    {
      "text": "Carolyn E Cutrona and Julie A Suhr. 1992. Controllability of stressful events and satisfaction with spouse support behaviors. Communication research 19, 2 (1992), 154–174.",
      "doi": ""
    },
    {
      "text": "Samantha DeHaan, Laura E Kuper, Joshua C Magee, Lou Bigelow, and Brian S Mustanski. 2013. The interplay between online and offline explorations of identity, relationships, and sex: A mixed-methods study with LGBT youth. Journal of sex research 50, 5 (2013), 421–434.",
      "doi": ""
    },
    {
      "text": "Daniel Delmonaco and Oliver L Haimson. 2022. “Nothing that I was specifically looking for”: LGBTQ+ youth and intentional sexual health information seeking. Journal of LGBT Youth(2022), 1–18.",
      "doi": ""
    },
    {
      "text": "Daniel Delmonaco, Gabriela Marcu, and Oliver L Haimson. 2020. Search engines and the sex education information practices of LGBTQ+ youth. Proceedings of the Association for Information Science and Technology 57, 1 (2020), e364.",
      "doi": ""
    },
    {
      "text": "Eric Deng, Bilge Mutlu, Maja J Mataric, 2019. Embodiment in socially interactive robots. Foundations and Trends® in Robotics 7, 4 (2019), 251–356.",
      "doi": ""
    },
    {
      "text": "Bryan Dosono. 2018. AAPI identity work on Reddit: Toward social support and collective action. In Proceedings of the 2018 ACM Conference on Supporting Groupwork. 373–378.",
      "doi": "10.1145/3148330.3152697"
    },
    {
      "text": "Nicolas Ducheneaut, Ming-Hui Wen, Nicholas Yee, and Greg Wadley. 2009. Body and mind: a study of avatar personalization in three virtual worlds. In Proceedings of the SIGCHI conference on human factors in computing systems. 1151–1160.",
      "doi": "10.1145/1518701.1518877"
    },
    {
      "text": "Lisa Duggan. 2002. The new homonormativity: The sexual politics of neoliberalism. In Materializing democracy. Duke University Press, 175–194.",
      "doi": ""
    },
    {
      "text": "Stefanie Duguay. 2016. “He has a way gayer Facebook than I do”: Investigating sexual identity disclosure and context collapse on a social networking site. New media & society 18, 6 (2016), 891–907.",
      "doi": ""
    },
    {
      "text": "Elena Dzardanova, Vlasios Kasapakis, and Damianos Gavalas. 2018. Social Virtual Reality. Springer International Publishing, Cham, 1–3. https://doi.org/10.1007/978-3-319-08234-9_204-1",
      "doi": ""
    },
    {
      "text": "Stina Ericsson. 2018. The language of cisnormativity: children and parents in interaction with a multimodal app.Gender & Language 12, 2 (2018).",
      "doi": ""
    },
    {
      "text": "Jessica N Fish, Lauren B McInroy, Megan S Paceley, Natasha D Williams, Sara Henderson, Deborah S Levine, and Rachel N Edsall. 2020. “I’m Kinda Stuck at Home With Unsupportive Parents Right Now”: LGBTQ Youths’ Experiences With COVID-19 and the Importance of Online Support. Journal of Adolescent Health 67, 3 (2020), 450–452.",
      "doi": ""
    },
    {
      "text": "Center for American Progress. 2020. The State of the LGBTQ Community in 2020: A National Public Opinion Study. https://www.americanprogress.org/article/state-lgbtq-community-2020/",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Dane Acena. 2021. Hugging from A Distance: Building Interpersonal Relationships in Social Virtual Reality. In ACM International Conference on Interactive Media Experiences. 84–95.",
      "doi": "10.1145/3452918.3458805"
    },
    {
      "text": "Guo Freeman and Dane Acena. 2022. \" Acting Out\" Queer Identity: The Embodied Visibility in Social Virtual Reality. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–32.",
      "doi": "10.1145/3555153"
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, and Shaowen Bardzell. 2016. Revisiting computer-mediated intimacy: In-game marriage and dyadic gameplay in Audition. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4325–4336.",
      "doi": "10.1145/2858036.2858484"
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, Shaowen Bardzell, and Susan C Herring. 2015. Simulating marriage: Gender roles and emerging intimacy in an online game. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1191–1200.",
      "doi": "10.1145/2675133.2675192"
    },
    {
      "text": "Guo Freeman and Divine Maloney. 2021. Body, avatar, and me: The presentation and perception of self in social virtual reality. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–27.",
      "doi": "10.1145/3432938"
    },
    {
      "text": "Guo Freeman, Divine Maloney, Dane Acena, and Catherine Barwulor. 2022. (Re) discovering the Physical Body Online: Strategies and Challenges to Approach Non-Cisgender Identity in Social Virtual Reality. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3491102.3502082"
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2017. Social support in eSports: building emotional and esteem support from instrumental support interactions in a highly competitive environment. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. 435–447.",
      "doi": "10.1145/3116595.3116635"
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2020. Streaming your Identity: Navigating the Presentation of Gender and Sexuality through Live Streaming. Computer Supported Cooperative Work (CSCW)(2020), 1–31.",
      "doi": ""
    },
    {
      "text": "Guo Freeman, Samaneh Zamanifard, Divine Maloney, and Dane Acena. 2022. Disturbing the Peace: Experiencing and Mitigating Emerging Harassment in Social Virtual Reality. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–30.",
      "doi": "10.1145/3512932"
    },
    {
      "text": "Guo Zhang Freeman, Jeffrey Bardzell, and Shaowen Bardzell. 2016. Intimate experiences in virtual worlds: The interplay among hyperpersonal communication, avatar-based systems, and experiential drives. IConference 2016 Proceedings(2016).",
      "doi": ""
    },
    {
      "text": "Zheng Gao and Patrick C Shih. 2019. Communities of support: social support exchange in a HIV online forum. In Proceedings of the Seventh International Symposium of Chinese CHI. 37–43.",
      "doi": "10.1145/3332169.3333576"
    },
    {
      "text": "Cally Gatehouse, Matthew Wood, Jo Briggs, James Pickles, and Shaun Lawson. 2018. Troubling vulnerability: Designing with LGBT young people’s ambivalence towards hate crime reporting. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173683"
    },
    {
      "text": "Lesbian Gay, Straight Education Network, 2013. Out online: The experiences of lesbian, gay, bisexual and transgender youth on the Internet. New York, NY (2013).",
      "doi": ""
    },
    {
      "text": "Giovanni. 2022. What do you need for virtual reality?https://www.coolblue.be/en/advice/what-do-i-need-for-virtual-reality.html",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson. 2017. The social complexities of transgender identity disclosure on social network sites. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 280–285.",
      "doi": "10.1145/3027063.3027136"
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, Lynn Dombrowski, and Gillian R Hayes. 2015. Disclosure, stress, and support during gender transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1176–1190.",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, and Gillian R Hayes. 2014. DDFSeeks same: sexual health-related language in online personal ads for men who have sex with men. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1615–1624.",
      "doi": "10.1145/2556288.2557077"
    },
    {
      "text": "Oliver L Haimson, Justin Buss, Zu Weinger, Denny L Starks, Dykee Gorrell, and Briar Sweetbriar Baron. 2020. Trans Time: Safety, Privacy, and Content Warnings on a Transgender-Specific Social Media Site. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–27.",
      "doi": "10.1145/3415195"
    },
    {
      "text": "Oliver L Haimson, Albert J Carter, Shanley Corvite, Brookelyn Wheeler, Lingbo Wang, Tianxiao Liu, and Alexxus Lige. 2021. The major life events taxonomy: Social readjustment, social media information sharing, and online network separation during times of life transition. Journal of the Association for Information Science and Technology 72, 7(2021), 933–947.",
      "doi": "10.1002/asi.24455"
    },
    {
      "text": "Oliver L Haimson, Dykee Gorrell, Denny L Starks, and Zu Weinger. 2020. Designing trans technology: Defining challenges and envisioning community-centered solutions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376669"
    },
    {
      "text": "Xi Han, Wenting Han, Jiabin Qu, Bei Li, and Qinghua Zhu. 2019. What happens online stays online?——Social media dependency, online support behavior and offline effects for LGBT. Computers in Human Behavior 93 (2019), 91–98.",
      "doi": "10.1016/j.chb.2018.12.011"
    },
    {
      "text": "Jennie L Hanna. 2017. One student at a time: A reflection of support for a first-year GSA club and its impact on perceived acceptance for LGBTQ students. The Clearing House: A Journal of Educational Strategies, Issues and Ideas 90, 3(2017), 98–102.",
      "doi": ""
    },
    {
      "text": "Rebecca A Hayes, Caleb T Carr, and Donghee Yvette Wohn. 2016. It’s the audience: Differences in social support across social media. Social Media+ Society 2, 4 (2016), 2056305116678894.",
      "doi": ""
    },
    {
      "text": "Rebecca A Hayes, Caleb T Carr, and Donghee Yvette Wohn. 2016. One click, many meanings: Interpreting paralinguistic digital affordances in social media. Journal of Broadcasting & Electronic Media 60, 1 (2016), 171–187.",
      "doi": ""
    },
    {
      "text": "Christopher M Homan, Naiji Lu, Xin Tu, Megan C Lytle, and Vincent MB Silenzio. 2014. Social structure and depression in TrevorSpace. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 615–625.",
      "doi": "10.1145/2531602.2531704"
    },
    {
      "text": "James S House. 1981. Work stress and social support. Addison-Wesley series on occupational stress (1981).",
      "doi": ""
    },
    {
      "text": "Searle Huh and Dmitri Williams. 2010. Dude looks like a lady: Gender swapping in an online game. In Online worlds: Convergence of the real and the virtual. Springer, 161–174.",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides and Elisa D Mekler. 2019. The role of gaming during difficult life experiences. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300453"
    },
    {
      "text": "Olu Jenzen and Irmi Karl. 2014. Make, share, care: Social media and LGBTQ youth engagement. A Journal of Gender, New Media, and Technology 5 (2014).",
      "doi": ""
    },
    {
      "text": "Jazette Johnson, Rebecca W Black, and Gillian R Hayes. 2020. Roles in the discussion: an analysis of social support in an online forum for people with dementia. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–30.",
      "doi": "10.1145/3415198"
    },
    {
      "text": "Simone Kolysh. 2021. Everyday violence: The public harassment of women and LGBTQ people. Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "Brian Lakey and Sheldon Cohen. 2000. Social support theory and measurement.(2000).",
      "doi": ""
    },
    {
      "text": "Leah E LeFebvre, Heather J Carmack, and Joshua R Pederson. 2020. “It’s only one negative comment”: women instructors’ perceptions of (un) helpful support messages following hurtful course evaluations. Communication Education 69, 1 (2020), 19–47.",
      "doi": ""
    },
    {
      "text": "Ada Lerner, Helen Yuxun He, Anna Kawakami, Silvia Catherine Zeamer, and Roberto Hoyle. 2020. Privacy and activism in the transgender community. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376339"
    },
    {
      "text": "Joshua Lewandowski, Benjamin D Rosenberg, M Jordan Parks, and Jason T Siegel. 2011. The effect of informal social support: Face-to-face versus computer-mediated communication. Computers in Human Behavior 27, 5 (2011), 1806–1814.",
      "doi": ""
    },
    {
      "text": "Calvin A Liang, Sean A Munson, and Julie A Kientz. 2021. Embracing Four Tensions in Human-Computer Interaction Research with Marginalized People. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 2(2021), 1–47.",
      "doi": "10.1145/3443686"
    },
    {
      "text": "Taylor Lorenz. 2016. Virtual Reality Is Full of Assholes Who Sexually Harass Me. Here’s Why I Keep Going Back. https://www.mic.com/articles/144470/sexual-harassment-in-virtual-reality",
      "doi": ""
    },
    {
      "text": "Zhicong Lu, Haijun Xia, Seongkook Heo, and Daniel Wigdor. 2018. You watch, you give, and you engage: a study of live streaming practices in China. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174040"
    },
    {
      "text": "Leanna Lucero. 2017. Safe spaces in online places: Social media and LGBTQ youth. Multicultural Education Review 9, 2 (2017), 117–128.",
      "doi": ""
    },
    {
      "text": "Divine Maloney and Guo Freeman. 2020. Falling asleep together: What makes activities in social virtual reality meaningful to users. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. 510–521.",
      "doi": "10.1145/3410404.3414266"
    },
    {
      "text": "Avi Marciano and Nadav Antebi-Gruszka. 2022. Offline and online discrimination and mental distress among lesbian, gay, and bisexual individuals: the moderating effect of LGBTQ facebook use. Media Psychology 25, 1 (2022), 27–50.",
      "doi": ""
    },
    {
      "text": "Elizabeth A McConnell, Michelle Birkett, and Brian Mustanski. 2016. Families matter: Social support and mental health trajectories among lesbian, gay, bisexual, and transgender youth. Journal of Adolescent Health 59, 6 (2016), 674–680.",
      "doi": ""
    },
    {
      "text": "Elizabeth A McConnell, Antonia Clifford, Aaron K Korpak, Gregory Phillips II, and Michelle Birkett. 2017. Identity, victimization, and support: Facebook experiences and mental health among LGBTQ youth. Computers in Human Behavior 76 (2017), 237–244.",
      "doi": "10.1016/j.chb.2017.07.026"
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Lauren B McInroy and Faye Mishna. 2017. Cyberbullying on online gaming platforms for children and youth. Child and adolescent social work journal 34, 6 (2017), 597–607.",
      "doi": ""
    },
    {
      "text": "Brad McKenna and Hameed Chughtai. 2020. Resistance and sexuality in virtual worlds: An LGBT perspective. Computers in Human Behavior 105 (2020), 106199.",
      "doi": "10.1016/j.chb.2019.106199"
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Jude P Mikal, Ronald E Rice, Audrey Abeyta, and Jenica DeVilbiss. 2013. Transition, stress and computer-mediated social support. Computers in Human Behavior 29, 5 (2013), A40–A53.",
      "doi": ""
    },
    {
      "text": "Kirk Miller. 2022. Report: The Metaverse Is Already Plagued by Hate Speech and Sexual Assault. https://www.insidehook.com/daily_brief/tech/metaverse-report-hate-speech-assault",
      "doi": ""
    },
    {
      "text": "Phoenix KH Mo and Neil S Coulson. 2008. Exploring the communication of social support within virtual communities: a content analysis of messages posted to an online HIV/AIDS support group. Cyberpsychology & behavior 11, 3 (2008), 371–374.",
      "doi": ""
    },
    {
      "text": "PFLAG. 2022. PFLAG National Glossary of Terms. https://pflag.org/glossary",
      "doi": ""
    },
    {
      "text": "Alexis Pulos. 2013. Confronting heteronormativity in online games: A critical discourse analysis of LGBTQ sexuality in World of Warcraft. Games and Culture 8, 2 (2013), 77–97.",
      "doi": ""
    },
    {
      "text": "Cassidy Pyle, Lee Roosevelt, Ashley Lacombe-Duncan, and Nazanin Andalibi. 2021. LGBTQ Persons’ Pregnancy Loss Disclosures to Known Ties on Social Media: Disclosure Decisions and Ideal Disclosure Environments. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3411764.3445331"
    },
    {
      "text": "Stephen A Rains, Steven R Brunner, Chelsie Akers, Corey A Pavlich, and Selin Goktas. 2017. Computer-mediated communication (CMC) and social support: Testing the effects of using CMC on support outcomes. Journal of Social and Personal Relationships 34, 8(2017), 1186–1205.",
      "doi": ""
    },
    {
      "text": "Rabindra A Ratan, Jae Eun Chung, Cuihua Shen, Dmitri Williams, and Marshall Scott Poole. 2010. Schmoozing and smiting: Trust, social institutions, and communication patterns in an MMOG. Journal of Computer-Mediated Communication 16, 1 (2010), 93–114.",
      "doi": ""
    },
    {
      "text": "Microsoft Mixed Reality. 2022. Community standards. https://learn.microsoft.com/en-us/windows/mixed-reality/altspace-vr/community/community-standards",
      "doi": ""
    },
    {
      "text": "Samantha Reig, Jodi Forlizzi, and Aaron Steinfeld. 2019. Leveraging robot embodiment to facilitate trust and smoothness. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 742–744.",
      "doi": ""
    },
    {
      "text": "Samson G Romero and MRP An. 2017. Queering Space: LGBTQ* Gaming as a Form of Resistance and Community Development. Ph. D. Dissertation. Tesis de Maestría). Universidad Ryerson.",
      "doi": ""
    },
    {
      "text": "Bobby Rozzell, Cameron W Piercy, Caleb T Carr, Shawn King, Brianna L Lane, Michael Tornes, Amy Janan Johnson, and Kevin B Wright. 2014. Notification pending: Online social support from close and nonclose relational ties via Facebook. Computers in Human Behavior 38 (2014), 272–280.",
      "doi": "10.1016/j.chb.2014.06.006"
    },
    {
      "text": "Bo Ruberg and Johanna Brewer. 2022. Digital Intimacy in Real Time: Live Streaming Gender and Sexuality. Television & New Media(2022), 15274764221084071.",
      "doi": ""
    },
    {
      "text": "Bonnie Ruberg and Adrienne Shaw. 2017. Queer game studies. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Stephen T Russell, Meg D Bishop, Victoria C Saba, Isaac James, and Salvatore Ioverno. 2021. Promoting school safety for LGBTQ and all students. Policy insights from the behavioral and brain sciences 8, 2 (2021), 160–166.",
      "doi": ""
    },
    {
      "text": "Caitlin Ryan, Stephen T Russell, David Huebner, Rafael Diaz, and Jorge Sanchez. 2010. Family acceptance in adolescence and the health of LGBT young adults. Journal of Child and Adolescent Psychiatric Nursing 23, 4 (2010), 205–213.",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Cagri Tasci, Patrick Franczak, Nico Haas, and Niels Henze. 2017. \" These are not my hands!\" Effect of Gender on the Perception of Avatar Hands in Virtual Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1577–1582.",
      "doi": "10.1145/3025453.3025602"
    },
    {
      "text": "Tanja Sihvonen and Jaakko Stenros. 2018. Cues for queer play: Carving a possibility space for LGBTQ role-play. In Queerness in Play. Springer, 167–184.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Daniel Pérez Marcos, Henrik Ehrsson, and Maria V Sanchez-Vives. 2009. Inducing illusory ownership of a virtual body. Frontiers in neuroscience(2009), 29.",
      "doi": ""
    },
    {
      "text": "Beatriz Sousa Santos, Paulo Dias, Angela Pimentel, Jan-Willem Baggerman, Carlos Ferreira, Samuel Silva, and Joaquim Madeira. 2009. Head-mounted display versus desktop for 3D navigation in virtual reality: a user study. Multimedia tools and applications 41, 1 (2009), 161–181.",
      "doi": "10.1007/s11042-008-0223-2"
    },
    {
      "text": "Hannah Sparks. 2021. Woman claims she was virtually ’groped’ in Meta’s VR metaverse. https://nypost.com/2021/12/17/woman-claims-she-was-virtually-groped-in-meta-vr-metaverse",
      "doi": ""
    },
    {
      "text": "Constance A Steinkuehler and Dmitri Williams. 2006. Where everybody knows your (screen) name: Online games as “third places”. Journal of computer-mediated communication 11, 4 (2006), 885–909.",
      "doi": ""
    },
    {
      "text": "Philipp Sykownik, Linda Graf, Christoph Zils, and Maic Masuch. 2021. The Most Social Platform Ever? A Survey about Activities amp; Motives of Social VR Users. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). 546–554. https://doi.org/10.1109/VR50410.2021.00079",
      "doi": ""
    },
    {
      "text": "Samuel Hardman Taylor, Jevan Alexander Hutson, and Tyler Richard Alicea. 2017. Social consequences of Grindr use: Extending the internet-enhanced self-disclosure hypothesis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6645–6657.",
      "doi": "10.1145/3025453.3025775"
    },
    {
      "text": "Sabine Trepte, Leonard Reinecke, and Keno Juechems. 2012. The social side of gaming: How playing online computer games creates online and offline social support. Computers in Human behavior 28, 3 (2012), 832–839.",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 2017. Alone together: Why we expect more from technology and less from each other. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Jirassaya Uttarapong, Ross Bonifacio, Rae Jereza, and Donghee Yvette Wohn. 2022. Social Support in Digital Patronage: OnlyFans Adult Content Creators as an Online Community. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–7.",
      "doi": "10.1145/3491101.3519836"
    },
    {
      "text": "Jirassaya Uttarapong, Jie Cai, and Donghee Yvette Wohn. 2021. Harassment Experiences of Women and LGBTQ Live Streamers and How They Handled Negativity. In ACM International Conference on Interactive Media Experiences. 7–19.",
      "doi": ""
    },
    {
      "text": "Sonja Utz. 2020. Social network sites as vehicles for effective/ineffective social support. Social support and health in the digital age (2020), 5–27.",
      "doi": ""
    },
    {
      "text": "Brandon L Velez, Bonnie Moradi, and Melanie E Brewster. 2013. Testing the tenets of minority stress theory in workplace contexts.Journal of counseling psychology 60, 4 (2013), 532.",
      "doi": ""
    },
    {
      "text": "VRChat. 2022. VRChat Community Guidelines. https://hello.vrchat.com/community-guidelines",
      "doi": ""
    },
    {
      "text": "Ashley Marie Walker and Michael A DeVito. 2020. \"’More gay’fits in better\": Intracommunity Power Dynamics and Harms in Online LGBTQ+ Spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376497"
    },
    {
      "text": "Robert Weiss. 1974. The provisions of social relationships. Doing unto others (1974), 17–26.",
      "doi": ""
    },
    {
      "text": "Emma Westecott. 2016. Playing with Gender: Promoting Representational Diversity with Dress-Up, Cross-Dressing and Drag in Games. DIVERSIFYING BARBIE (2016), 240.",
      "doi": ""
    },
    {
      "text": "Dmitri Williams, Nicolas Ducheneaut, Li Xiong, Yuanyuan Zhang, Nick Yee, and Eric Nickell. 2006. From tree house to barracks: The social life of guilds in World of Warcraft. Games and culture 1, 4 (2006), 338–361.",
      "doi": ""
    },
    {
      "text": "Thomas Ashby Wills. 1991. Social support and interpersonal relationships.(1991).",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn, Caleb T Carr, and Rebecca A Hayes. 2016. How affective is a “Like”?: The effect of paralinguistic digital affordances on perceived social support. Cyberpsychology, Behavior, and Social Networking 19, 9(2016), 562–566.",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn, Guo Freeman, and Caitlin McLaughlin. 2018. Explaining viewers’ emotional, instrumental, and financial support provision for live streamers. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174048"
    },
    {
      "text": "Meredith GF Worthen. 2016. Hetero-cis–normativity and the gendering of transphobia. International Journal of Transgenderism 17, 1 (2016), 31–57.",
      "doi": ""
    },
    {
      "text": "Yan Xu and Brant R Burleson. 2001. Effects of sex, culture, and support type on perceptions of spousal social support: An assessment of the “support gap” hypothesis in early marriage. Human Communication Research 27, 4 (2001), 535–566.",
      "doi": ""
    },
    {
      "text": "Michele L Ybarra, Kimberly J Mitchell, Neal A Palmer, and Sari L Reisner. 2015. Online social support as a buffer against online and offline peer and sexual victimization among US LGBT and non-LGBT youth. Child abuse & neglect 39 (2015), 123–136.",
      "doi": ""
    },
    {
      "text": "Nick Yee, Nicolas Ducheneaut, Mike Yao, and Les Nelson. 2011. Do men heal more when in drag? Conflicting identity cues between user and avatar, In CHI 2011 - 29th Annual CHI Conference on Human Factors in Computing Systems, Conference Proceedings and Extended Abstracts. Conference on Human Factors in Computing Systems - Proceedings, 773–776. https://doi.org/10.1145/1978942.1979054",
      "doi": "10.1145/1978942.1979054"
    }
  ]
}