{
  "doi": "10.1145/3544548.3581473",
  "title": "Augmenting On-Body Touch Input with Tactile Feedback Through Fingernail Haptics",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "The key assumption attributed to on-body touch input is that the skin being touched provides natural tactile feedback. In this paper, we for the first time systematically explore augmenting on-body touch input with computer-generated tactile feedback. We employ vibrotactile actuation on the fingernail to couple on-body touch input with tactile feedback. Results from our first experiment show that users prefer tactile feedback for on-body touch input. In our second experiment, we determine the frequency thresholds for rendering realistic tactile “click” sensations for on-body touch buttons on three different body locations. Finally, in our third experiment, we dig deeper to render highly expressive tactile effects with a single actuator. Our non-metric multi-dimensional analysis shows that haptic augmentation of on-body buttons enhances the expressivity of on-body touch input. Overall, results from our experiments reinforce the need for tactile feedback for on-body touch input and show that actuation on the fingernail is a promising approach.",
  "authors": [
    {
      "name": "Peter Khoa Duc Tran",
      "institution": "Department of Computer Science, University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782957",
      "orcid": "0000-0002-9772-1204"
    },
    {
      "name": "Purna Valli Anusha Gadepalli",
      "institution": "Computer Science, Saarland University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779699",
      "orcid": "0000-0001-9673-9472"
    },
    {
      "name": "Jaeyeon Lee",
      "institution": "Computer Science & Engineering, UNIST, Korea, Republic of",
      "img": "/do/10.1145/contrib-60000000516/rel-imgonly/jaeyeon.jpg",
      "acmid": "60000000516",
      "orcid": "0000-0002-6474-8080"
    },
    {
      "name": "Aditya Shekhar Nittala",
      "institution": "Department of Computer Science, University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161539",
      "orcid": "0000-0002-3698-9733"
    }
  ],
  "references": [
    {
      "text": "Hideyuki Ando, Eisuke Kusachi, and Junji Watanabe. 2007. Nail-Mounted Tactile Display for Boundary/Texture Augmentation. In Proceedings of the International Conference on Advances in Computer Entertainment Technology (Salzburg, Austria) (ACE ’07). Association for Computing Machinery, New York, NY, USA, 292–293. https://doi.org/10.1145/1255047.1255131",
      "doi": "10.1145/1255047.1255131"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, Sebastian Boring, and Kasper Hornbæk. 2017. Placing and Recalling Virtual Items on the Skin. Association for Computing Machinery, New York, NY, USA, 1497–1507. https://doi.org/10.1145/3025453.3026030",
      "doi": "10.1145/3025453.3026030"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, David Coyle, Jarrod Knibbe, and Kasper Hornbæk. 2018. I Really Did That: Sense of Agency with Touchpad, Keyboard, and On-Skin Interaction. Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3173574.3173952",
      "doi": "10.1145/3173574.3173952"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, Kasper Hornbæk, and Sebastian Boring. 2018. It’s a Wrap: Mapping On-Skin Input to Off-Skin Displays. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174138",
      "doi": "10.1145/3173574.3174138"
    },
    {
      "text": "Ingvars Birznieks, Vaughan G Macefield, Göran Westling, and Roland S Johansson. 2009. Slowly adapting mechanoreceptors in the borders of the human fingernail encode fingertip forces. Journal of Neuroscience 29, 29 (2009), 9370–9379.",
      "doi": ""
    },
    {
      "text": "Mathieu Boniol, Jean-Pierre Verriest, Remy Pedeux, and Jean-François Doré. 2008. Proportion of skin surface area of children and young adults from 2 to 18 years old. Journal of investigative dermatology 128, 2 (2008), 461–464.",
      "doi": ""
    },
    {
      "text": "Idil Bostan, Oğuz Turan Buruk, Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Tilbe Göksun, and Oğuzhan Özcan. 2017. Hands as a Controller: User Preferences for Hand Specific On-Skin Gestures. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 1123–1134. https://doi.org/10.1145/3064663.3064766",
      "doi": "10.1145/3064663.3064766"
    },
    {
      "text": "Edwin Chan, Teddy Seyed, Wolfgang Stuerzlinger, Xing-Dong Yang, and Frank Maurer. 2016. User Elicitation on Single-Hand Microgestures. Association for Computing Machinery, New York, NY, USA, 3403–3414. https://doi.org/10.1145/2858036.2858589",
      "doi": "10.1145/2858036.2858589"
    },
    {
      "text": "Liwei Chan, Yi-Ling Chen, Chi-Hao Hsieh, Rong-Hao Liang, and Bing-Yu Chen. 2015. CyclopsRing: Enabling Whole-Hand and Context-Aware Interactions Through a Fisheye Ring. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 549–556. https://doi.org/10.1145/2807442.2807450",
      "doi": "10.1145/2807442.2807450"
    },
    {
      "text": "Liwei Chan, Rong-Hao Liang, Ming-Chang Tsai, Kai-Yin Cheng, Chao-Huai Su, Mike Y. Chen, Wen-Huang Cheng, and Bing-Yu Chen. 2013. FingerPad: Private and Subtle Interaction Using Fingertips. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). ACM, New York, NY, USA, 255–260. https://doi.org/10.1145/2501988.2502016",
      "doi": "10.1145/2501988.2502016"
    },
    {
      "text": "Yu-Chun Chen, Chia-Ying Liao, Shuo-wen Hsu, Da-Yuan Huang, and Bing-Yu Chen. 2020. Exploring User Defined Gestures for Ear-Based Interactions. Proc. ACM Hum.-Comput. Interact. 4, ISS, Article 186 (Nov. 2020), 20 pages. https://doi.org/10.1145/3427314",
      "doi": "10.1145/3427314"
    },
    {
      "text": "Marco D’Alonzo, Francesco Clemente, and Christian Cipriani. 2014. Vibrotactile stimulation promotes embodiment of an alien hand in amputees with phantom sensations. IEEE Transactions on Neural Systems and Rehabilitation Engineering 23, 3(2014), 450–457.",
      "doi": ""
    },
    {
      "text": "Niloofar Dezfuli, Mohammadreza Khalilbeigi, Jochen Huber, Florian Müller, and Max Mühlhäuser. 2012. PalmRC: Imaginary Palm-based Remote Control for Eyes-free Television Interaction. In Proceedings of the 10th European Conference on Interactive TV and Video (Berlin, Germany) (EuroITV ’12). ACM, New York, NY, USA, 27–34. https://doi.org/10.1145/2325616.2325623",
      "doi": "10.1145/2325616.2325623"
    },
    {
      "text": "Aritra Dhar, Aditya Nittala, and Kuldeep Yadav. 2016. TactBack: VibroTactile Braille output using smartphone and smartwatch for visually impaired. In Proceedings of the 13th International Web for All Conference. ACM, New York, NY, USA, 1–2.",
      "doi": "10.1145/2899475.2899514"
    },
    {
      "text": "Christine Dierk, Tomás Vega Gálvez, and Eric Paulos. 2017. AlterNail: Ambient, Batteryless, Stateful, Dynamic Displays at Your Fingertips. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6754–6759. https://doi.org/10.1145/3025453.3025924",
      "doi": "10.1145/3025453.3025924"
    },
    {
      "text": "M D’Alonzo, LF Engels, M Controzzi, and C Cipriani. 2017. Electro-cutaneous stimulation on the palm elicits referred sensations on intact but not on amputated digits. Journal of Neural Engineering 15, 1 (2017), 016003.",
      "doi": ""
    },
    {
      "text": "H Henrik Ehrsson, Birgitta Rosén, Anita Stockselius, Christina Ragnö, Peter Köhler, and Göran Lundborg. 2008. Upper limb amputees can be induced to experience a rubber hand as their own. Brain 131, 12 (2008), 3443–3452.",
      "doi": ""
    },
    {
      "text": "Likun Fang, Ting Zhu, Erik Pescara, Yiran Huang, Yexu Zhou, and Michael Beigl. 2022. DragTapVib: An On-Skin Electromagnetic Drag, Tap, and Vibration Actuator for Wearable Computing. In Augmented Humans 2022 (Kashiwa, Chiba, Japan) (AHs 2022). Association for Computing Machinery, New York, NY, USA, 203–211. https://doi.org/10.1145/3519391.3519395",
      "doi": "10.1145/3519391.3519395"
    },
    {
      "text": "William Frier, Dario Pittera, Damien Ablart, Marianna Obrist, and Sriram Subramanian. 2019. Sampling Strategy for Ultrasonic Mid-Air Haptics. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300351",
      "doi": "10.1145/3290605.3300351"
    },
    {
      "text": "Bo Geng, Ken Yoshida, Laura Petrini, and Winnie Jensen. 2012. Evaluation of sensation evoked by electrocutaneous stimulation on forearm in nondisabled subjects. J Rehabil Res Dev 49, 2 (2012), 297–308.",
      "doi": ""
    },
    {
      "text": "Jun Gong, Yang Zhang, Xia Zhou, and Xing-Dong Yang. 2017. Pyro: Thumb-Tip Gesture Recognition Using Pyroelectric Infrared Sensing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology(Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 553–563. https://doi.org/10.1145/3126594.3126615",
      "doi": "10.1145/3126594.3126615"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew S. Reynolds, and Joshua R. Smith. 2017. Finding Common Ground: A Survey of Capacitive Sensing in Human-Computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Denver, USA) (CHI ’17). ACM, New York, NY, USA, 3293–3315. https://doi.org/10.1145/3025453.3025808",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Aakar Gupta, Antony Albert Raj Irudayaraj, and Ravin Balakrishnan. 2017. HapticClench: Investigating Squeeze Sensations Using Memory Alloys. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 109–117. https://doi.org/10.1145/3126594.3126598",
      "doi": "10.1145/3126594.3126598"
    },
    {
      "text": "Sean Gustafson, Christian Holz, and Patrick Baudisch. 2011. Imaginary phone: learning imaginary interfaces by transferring spatial memory from a familiar device. In Proceedings of the 24th annual ACM symposium on User Interface Software and Technology. ACM, ACM, New York, NY, USA, 283–292.",
      "doi": "10.1145/2047196.2047233"
    },
    {
      "text": "Sean G. Gustafson, Bernhard Rabe, and Patrick M. Baudisch. 2013. Understanding Palm-based Imaginary Interfaces: The Role of Visual and Tactile Cues when Browsing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). ACM, New York, NY, USA, 889–898. https://doi.org/10.1145/2470654.2466114",
      "doi": "10.1145/2470654.2466114"
    },
    {
      "text": "Nur Al-huda Hamdan, Adrian Wagner, Simon Voelker, Jürgen Steimle, and Jan Borchers. 2019. Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300718",
      "doi": "10.1145/3290605.3300718"
    },
    {
      "text": "Teng Han, Fraser Anderson, Pourang Irani, and Tovi Grossman. 2018. HydroRing: Supporting Mixed Reality Haptics Using Liquid Flow. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 913–925. https://doi.org/10.1145/3242587.3242667",
      "doi": "10.1145/3242587.3242667"
    },
    {
      "text": "Teng Han, Shubhi Bansal, Xiaochen Shi, Yanjun Chen, Baogang Quan, Feng Tian, Hongan Wang, and Sriram Subramanian. 2020. HapBead: On-Skin Microfluidic Haptic Interface Using Tunable Bead. Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376190",
      "doi": "10.1145/3313831.3376190"
    },
    {
      "text": "Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: Wearable Multitouch Interaction Everywhere. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 441–450. https://doi.org/10.1145/2047196.2047255",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Chris Harrison, Shilpa Ramamurthy, and Scott E. Hudson. 2012. On-Body Interaction: Armed and Dangerous. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (Kingston, Ontario, Canada) (TEI ’12). Association for Computing Machinery, New York, NY, USA, 69–76. https://doi.org/10.1145/2148131.2148148",
      "doi": "10.1145/2148131.2148148"
    },
    {
      "text": "Chris Harrison, Shilpa Ramamurthy, and Scott E. Hudson. 2012. On-Body Interaction: Armed and Dangerous. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (Kingston, Ontario, Canada) (TEI ’12). Association for Computing Machinery, New York, NY, USA, 69–76. https://doi.org/10.1145/2148131.2148148",
      "doi": "10.1145/2148131.2148148"
    },
    {
      "text": "Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: Appropriating the Body as an Input Surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 453–462. https://doi.org/10.1145/1753326.1753394",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Eve Hoggan, Stephen A. Brewster, and Jody Johnston. 2008. Investigating the Effectiveness of Tactile Feedback for Mobile Touchscreens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1573–1582. https://doi.org/10.1145/1357054.1357300",
      "doi": "10.1145/1357054.1357300"
    },
    {
      "text": "M Hollins, R Faldowski, S Rao, and F Young. 1993. Individual differences in perceptual space for tactile textures: evidence from multidimensional scaling analysis. Perception and Psychophysics 54, 6 (1993), 697–705.",
      "doi": ""
    },
    {
      "text": "Meng-Ju Hsieh, Rong-Hao Liang, and Bing-Yu Chen. 2016. NailTactors: Eyes-Free Spatial Output Using a Nail-Mounted Tactor Array. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 29–34. https://doi.org/10.1145/2935334.2935358",
      "doi": "10.1145/2935334.2935358"
    },
    {
      "text": "Da-Yuan Huang, Liwei Chan, Shuo Yang, Fan Wang, Rong-Hao Liang, De-Nian Yang, Yi-Ping Hung, and Bing-Yu Chen. 2016. DigitSpace: Designing Thumb-to-Fingers Touch Interfaces for One-Handed and Eyes-Free Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1526–1537. https://doi.org/10.1145/2858036.2858483",
      "doi": "10.1145/2858036.2858483"
    },
    {
      "text": "Seokhee Jeon, Jean-Claude Metzger, Seungmoon Choi, and Matthias Harders. 2011. Extensions to haptic augmented reality: Modulating friction and weight. In 2011 IEEE World Haptics Conference. IEEE, 227–232.",
      "doi": ""
    },
    {
      "text": "Roland S Johansson and Ake B Vallbo. 1979. Tactile sensibility in the human hand: relative and absolute densities of four types of mechanoreceptive units in glabrous skin.The Journal of physiology 286, 1 (1979), 283–300.",
      "doi": ""
    },
    {
      "text": "Lynette A Jones and Hong Z Tan. 2012. Application of psychophysical techniques to haptic research. IEEE transactions on haptics 6, 3 (2012), 268–284.",
      "doi": ""
    },
    {
      "text": "Lynette A Jones and Hong Z Tan. 2013. Application of psychophysical techniques to haptic research. IEEE transactions on haptics 6, 3 (2013), 268–284.",
      "doi": "10.1109/TOH.2012.74"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Artem Dementyev, Joseph A. Paradiso, and Chris Schmandt. 2015. NailO: Fingernails as an Input Surface. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3015–3018. https://doi.org/10.1145/2702123.2702572",
      "doi": "10.1145/2702123.2702572"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. 2016. DuoSkin. In Proceedings of the 2016 ACM International Symposium on Wearable Computers - ISWC ’16. ACM Press, New York, New York, USA, 16–23. https://doi.org/10.1145/2971763.2971777",
      "doi": "10.1145/2971763.2971777"
    },
    {
      "text": "Keiko Katsuragawa, Ju Wang, Ziyang Shan, Ningshan Ouyang, Omid Abari, and Daniel Vogel. 2019. Tip-Tap: Battery-Free Discrete 2D Fingertip Input. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1045–1057. https://doi.org/10.1145/3332165.3347907",
      "doi": "10.1145/3332165.3347907"
    },
    {
      "text": "Anzu Kawazoe, Massimiliano Di Luca, and Yon Visell. 2019. Tactile echoes: A wearable system for tactile augmentation of objects. In 2019 IEEE World Haptics Conference (WHC). IEEE, 359–364.",
      "doi": ""
    },
    {
      "text": "Wolf Kienzle, Eric Whitmire, Chris Rittaler, and Hrvoje Benko. 2021. ElectroRing: Subtle Pinch and Touch Detection with a Ring. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3411764.3445094",
      "doi": "10.1145/3411764.3445094"
    },
    {
      "text": "David Kim, Otmar Hilliges, Shahram Izadi, Alex D. Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: Freehand 3D Interactions Anywhere Using a Wrist-Worn Gloveless Sensor. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology(Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 167–176. https://doi.org/10.1145/2380116.2380139",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Jayoung Kim, Thomas N Cho, Gabriela Valdés-Ramírez, and Joseph Wang. 2016. A wearable fingernail chemical sensing platform: pH sensing at your fingertips. Talanta 150(2016), 622–628.",
      "doi": ""
    },
    {
      "text": "Emilia Koskinen, Topi Kaaresoja, and Pauli Laitinen. 2008. Feel-Good Touch: Finding the Most Pleasant Tactile Feedback for a Mobile Touch Screen Button. In Proceedings of the 10th International Conference on Multimodal Interfaces (Chania, Crete, Greece) (ICMI ’08). Association for Computing Machinery, New York, NY, USA, 297–304. https://doi.org/10.1145/1452392.1452453",
      "doi": "10.1145/1452392.1452453"
    },
    {
      "text": "DoYoung Lee, SooHwan Lee, and Ian Oakley. 2020. Nailz: Sensing Hand Input with Touch Sensitive Nails. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376778",
      "doi": "10.1145/3313831.3376778"
    },
    {
      "text": "Jaeyeon Lee, Jaehyun Han, and Geehyuk Lee. 2015. Investigating the information transfer efficiency of a 3x3 watch-back tactile display. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1229–1232.",
      "doi": "10.1145/2702123.2702530"
    },
    {
      "text": "Jaeyeon Lee and Geehyuk Lee. 2016. Designing a non-contact wearable tactile display using airflows. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 183–194.",
      "doi": "10.1145/2984511.2984583"
    },
    {
      "text": "Shu-Yang Lin, Chao-Huai Su, Kai-Yin Cheng, Rong-Hao Liang, Tzu-Hao Kuo, and Bing-Yu Chen. 2011. Pub - Point upon Body: Exploring Eyes-Free Interaction and Methods on an Arm. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology(Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 481–488. https://doi.org/10.1145/2047196.2047259",
      "doi": "10.1145/2047196.2047259"
    },
    {
      "text": "Joanne Lo, Doris Jung Lin Lee, Nathan Wong, David Bui, and Eric Paulos. 2016. Skintillates. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS ’16. ACM Press, New York, New York, USA, 853–864. https://doi.org/10.1145/2901790.2901885",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Flavia Mancini, Armando Bauleo, Jonathan Cole, Fausta Lui, Carlo A Porro, Patrick Haggard, and Gian Domenico Iannetti. 2014. Whole-body mapping of spatial acuity for pain and touch. Annals of neurology 75, 6 (2014), 917–924.",
      "doi": ""
    },
    {
      "text": "Alex Mazursky, Shan-Yuan Teng, Romain Nith, and Pedro Lopes. 2021. MagnetIO: Passive yet Interactive Soft Haptic Patches Anywhere. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3411764.3445543",
      "doi": "10.1145/3411764.3445543"
    },
    {
      "text": "Alex Mazursky, Shan-Yuan Teng, Romain Nith, and Pedro Lopes. 2021. MagnetIO: Passive yet Interactive Soft Haptic Patches Anywhere. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 213, 15 pages. https://doi.org/10.1145/3411764.3445543",
      "doi": "10.1145/3411764.3445543"
    },
    {
      "text": "Jess McIntosh, Paul Strohmeier, Jarrod Knibbe, Sebastian Boring, and Kasper Hornbæk. 2019. Magnetips: Combining Fingertip Tracking and Haptic Feedback for Around-Device Interaction. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300638",
      "doi": "10.1145/3290605.3300638"
    },
    {
      "text": "Pardis Miri, Robert Flory, Andero Uusberg, Helen Uusberg, James J. Gross, and Katherine Isbister. 2017. HapLand: A Scalable Robust Emotion Regulation Haptic System Testbed. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 1916–1923. https://doi.org/10.1145/3027063.3053147",
      "doi": "10.1145/3027063.3053147"
    },
    {
      "text": "Pranav Mistry, Pattie Maes, and Liyan Chang. 2009. WUW - Wear Ur World: A Wearable Gestural Interface. Association for Computing Machinery, New York, NY, USA, 4111–4116. https://doi.org/10.1145/1520340.1520626",
      "doi": "10.1145/1520340.1520626"
    },
    {
      "text": "Adiyan Mujibiya, Xiang Cao, Desney S. Tan, Dan Morris, Shwetak N. Patel, and Jun Rekimoto. 2013. The Sound of Touch: On-body Touch and Gesture Sensing Based on Transdermal Ultrasound Propagation. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (St. Andrews, Scotland, United Kingdom) (ITS ’13). ACM, New York, NY, USA, 189–198. https://doi.org/10.1145/2512349.2512821",
      "doi": "10.1145/2512349.2512821"
    },
    {
      "text": "Sunung Mun, Hojin Lee, and Seungmoon Choi. 2019. Perceptual space of regular homogeneous haptic textures rendered using electrovibration. In 2019 IEEE World Haptics Conference (WHC). IEEE, IEEE, 7–12.",
      "doi": ""
    },
    {
      "text": "Alexander Ng and Stephen A. Brewster. 2016. Investigating Pressure Input and Haptic Feedback for In-Car Touchscreens and Touch Surfaces. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Ann Arbor, MI, USA) (Automotive’UI 16). Association for Computing Machinery, New York, NY, USA, 121–128. https://doi.org/10.1145/3003715.3005420",
      "doi": "10.1145/3003715.3005420"
    },
    {
      "text": "Aditya Shekhar Nittala, Klaus Kruttwig, Jaeyeon Lee, Roland Bennewitz, Eduard Arzt, and Jürgen Steimle. 2019. Like A Second Skin: Understanding How Epidermal Devices Affect Human Tactile Perception. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’19). ACM, New York, NY, USA, 1–16. https://doi.org/10.1145/3290605.3300610",
      "doi": "10.1145/3290605.3300610"
    },
    {
      "text": "Aditya Shekhar Nittala, Nico Li, Stephen Cartwright, Kazuki Takashima, Ehud Sharlin, and Mario Costa Sousa. 2015. PLANWELL: spatial user interface for collaborative petroleum well-planning. In SIGGRAPH Asia 2015 Mobile Graphics and Interactive Applications. ACM, New York, NY, USA, 1–8.",
      "doi": ""
    },
    {
      "text": "Aditya Shekhar Nittala, Anusha Withana, Narjes Pourjafarian, and Jürgen Steimle. 2018. Multi-Touch Skin: A Thin and Flexible Multi-Touch Sensor for On-Skin Input. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 33, 12 pages. https://doi.org/10.1145/3173574.3173607",
      "doi": "10.1145/3173574.3173607"
    },
    {
      "text": "Masataka Niwa, Robert W Lindeman, Yuichi Itoh, and Fumio Kishino. 2009. Determining appropriate parameters to elicit linear and circular apparent motion using vibrotactile cues. In World Haptics 2009-Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, IEEE, 75–78.",
      "doi": "10.1109/WHC.2009.4810856"
    },
    {
      "text": "Uran Oh and Leah Findlater. 2014. Design of and Subjective Response to On-Body Input for People with Visual Impairments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility (Rochester, New York, USA) (ASSETS ’14). Association for Computing Machinery, New York, NY, USA, 115–122. https://doi.org/10.1145/2661334.2661376",
      "doi": "10.1145/2661334.2661376"
    },
    {
      "text": "Uran Oh and Leah Findlater. 2015. A Performance Comparison of On-Hand versus On-Phone Nonvisual Input by Blind and Sighted Users. ACM Trans. Access. Comput. 7, 4, Article 14 (Nov. 2015), 20 pages. https://doi.org/10.1145/2820616",
      "doi": "10.1145/2820616"
    },
    {
      "text": "Lizhi Pan, Luis Vargas, Aaron Fleming, Xiaogang Hu, Yong Zhu, and He Helen Huang. 2020. Evoking haptic sensations in the foot through high-density transcutaneous electrical nerve stimulations. Journal of neural engineering 17, 3 (2020), 036020.",
      "doi": ""
    },
    {
      "text": "Jerome Pasquero, Joseph Luk, Shannon Little, and Karon MacLean. 2006. Perceptual analysis of haptic icons: an investigation into the validity of cluster sorted mds. In 2006 14th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, IEEE, 437–444.",
      "doi": ""
    },
    {
      "text": "Fabrizio Pece, Juan Jose Zarate, Velko Vechev, Nadine Besse, Olexandr Gudozhnik, Herbert Shea, and Otmar Hilliges. 2017. MagTics: Flexible and Thin Form Factor Magnetic Actuators for Dynamic and Wearable Haptic Feedback. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 143–154. https://doi.org/10.1145/3126594.3126609",
      "doi": "10.1145/3126594.3126609"
    },
    {
      "text": "Pornthep Preechayasomboon and Eric Rombokas. 2021. Haplets: Finger-Worn Wireless and Low-Encumbrance Vibrotactile Haptic Feedback for Virtual and Augmented Reality. Frontiers in Virtual Reality 2 (2021), 738613. https://doi.org/10.3389/frvir.2021.738613",
      "doi": ""
    },
    {
      "text": "Halley P. Profita, James Clawson, Scott Gilliland, Clint Zeagler, Thad Starner, Jim Budd, and Ellen Yi-Luen Do. 2013. Don’t Mind Me Touching My Wrist: A Case Study of Interacting with on-Body Technology in Public. In Proceedings of the 2013 International Symposium on Wearable Computers (Zurich, Switzerland) (ISWC ’13). Association for Computing Machinery, New York, NY, USA, 89–96. https://doi.org/10.1145/2493988.2494331",
      "doi": "10.1145/2493988.2494331"
    },
    {
      "text": "Jorge-Luis Pérez-Medina, Santiago Villarreal, and Jean Vanderdonckt. 2020. A Gesture Elicitation Study of Nose-Based Gestures. Sensors 20, 24 (2020). https://doi.org/10.3390/s20247118",
      "doi": ""
    },
    {
      "text": "Vilayanur S Ramachandran. 1993. Behavioral and magnetoencephalographic correlates of plasticity in the adult human brain. Proceedings of the National Academy of Sciences 90, 22 (1993), 10413–10420.",
      "doi": ""
    },
    {
      "text": "Benjamin Zhi Qiang Seah, Clement Chun Ho Wu, Sandeep Jacob Sebastin, and Amitabha Lahiri. 2013. Tactile sensibility on the fingernail. The Journal of hand surgery 38, 11 (2013), 2159–2163.",
      "doi": ""
    },
    {
      "text": "Adwait Sharma, Michael A Hedderich, Divyanshu Bhardwaj, Bruno Fruchard, Jess McIntosh, Aditya Shekhar Nittala, Dietrich Klakow, Daniel Ashbrook, and Jürgen Steimle. 2021. SoloFinger: Robust microgestures while grasping everyday objects. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15.",
      "doi": "10.1145/3411764.3445197"
    },
    {
      "text": "Adwait Sharma, Joan Sol Roo, and Jürgen Steimle. 2019. Grasping Microgestures: Eliciting Single-Hand Microgestures for Handheld Objects. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300632",
      "doi": "10.1145/3290605.3300632"
    },
    {
      "text": "Susan S Shiffman, M Lance Reynolds, and Forrest W Young. 1981. Handbook of multidimensional scaling. New York, NY, USA: Academic(1981).",
      "doi": ""
    },
    {
      "text": "Youngbo Aram Shim, Jaeyeon Lee, and Geehyuk Lee. 2018. Exploring multimodal watch-back tactile display using wind and vibration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3173706"
    },
    {
      "text": "Katherine O Sofia and Lynette Jones. 2013. Mechanical and psychophysical studies of surface wave propagation during vibrotactile stimulation. IEEE transactions on haptics 6, 3 (2013), 320–329.",
      "doi": "10.1109/TOH.2013.1"
    },
    {
      "text": "Srinath Sridhar, Anders Markussen, Antti Oulasvirta, Christian Theobalt, and Sebastian Boring. 2017. WatchSense: On- and Above-Skin Input Sensing through a Wearable Depth Sensor. Association for Computing Machinery, New York, NY, USA, 3891–3902. https://doi.org/10.1145/3025453.3026005",
      "doi": "10.1145/3025453.3026005"
    },
    {
      "text": "Chao-Huai Su, Liwei Chan, Chien-Ting Weng, Rong-Hao Liang, Kai-Yin Cheng, and Bing-Yu Chen. 2013. NailDisplay: Bringing an Always Available Visual Display to Fingertips. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1461–1464. https://doi.org/10.1145/2470654.2466193",
      "doi": "10.1145/2470654.2466193"
    },
    {
      "text": "Yuta Sugiura, Fumihiko Nakamura, Wataru Kawai, Takashi Kikuchi, and Maki Sugimoto. 2017. Behind the palm: Hand gesture recognition through measuring skin deformation on back of hand by using optical sensors. In 2017 56th Annual Conference of the Society of Instrument and Control Engineers of Japan (SICE). 1082–1087. https://doi.org/10.23919/SICE.2017.8105457",
      "doi": ""
    },
    {
      "text": "Emi Tamaki, Takashi Miyak, and Jun Rekimoto. 2010. BrainyHand: A Wearable Computing Device without HMD and It’s Interaction Techniques. In Proceedings of the International Conference on Advanced Visual Interfaces (Roma, Italy) (AVI ’10). Association for Computing Machinery, New York, NY, USA, 387–388. https://doi.org/10.1145/1842993.1843070",
      "doi": "10.1145/1842993.1843070"
    },
    {
      "text": "Shan-Yuan Teng, Pengyu Li, Romain Nith, Joshua Fonseca, and Pedro Lopes. 2021. Touch & Fold: A Foldable Haptic Actuator for Rendering Touch in Mixed Reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 736, 14 pages. https://doi.org/10.1145/3411764.3445099",
      "doi": "10.1145/3411764.3445099"
    },
    {
      "text": "Wouter M Bergmann Tiest and Astrid ML Kappers. 2006. Analysis of haptic perception of materials by multidimensional scaling and physical measurements of roughness and compressibility. Acta psychologica 121, 1 (2006), 1–20.",
      "doi": ""
    },
    {
      "text": "Ake B Vallbo, Roland S Johansson, 1984. Properties of cutaneous mechanoreceptors in the human hand related to touch sensation. Hum neurobiol 3, 1 (1984), 3–14.",
      "doi": ""
    },
    {
      "text": "Dong-Bach Vo, Eric Lecolinet, and Yves Guiard. 2014. Belly Gestures: Body Centric Gestures on the Abdomen. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational(Helsinki, Finland) (NordiCHI ’14). Association for Computing Machinery, New York, NY, USA, 687–696. https://doi.org/10.1145/2639189.2639210",
      "doi": "10.1145/2639189.2639210"
    },
    {
      "text": "Julie Wagner, Mathieu Nancel, Sean G Gustafson, Stephane Huot, and Wendy E Mackay. 2013. Body-centric design space for multi-surface interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1299–1308.",
      "doi": "10.1145/2470654.2466170"
    },
    {
      "text": "Cheng-Yao Wang, Wei-Chen Chu, Po-Tsung Chiu, Min-Chieh Hsiu, Yih-Harn Chiang, and Mike Y. Chen. 2015. PalmType: Using Palms as Keyboards for Smart Glasses. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services(Copenhagen, Denmark) (MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 153–160. https://doi.org/10.1145/2785830.2785886",
      "doi": "10.1145/2785830.2785886"
    },
    {
      "text": "Saiwen Wang, Jie Song, Jaime Lien, Ivan Poupyrev, and Otmar Hilliges. 2016. Interacting with Soli: Exploring Fine-Grained Dynamic Gesture Recognition in the Radio-Frequency Spectrum. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 851–860. https://doi.org/10.1145/2984511.2984565",
      "doi": "10.1145/2984511.2984565"
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, New York, New York, USA, 2991–3000. https://doi.org/10.1145/2702123.2702391",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Martin Weigel, Vikram Mehta, and Jürgen Steimle. 2014. More Than Touch: Understanding How People Use Skin As an Input Surface for Mobile Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 179–188. https://doi.org/10.1145/2556288.2557239",
      "doi": "10.1145/2556288.2557239"
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jürgen Steimle. 2017. SkinMarks: Enabling Interactions on Body Landmarks Using Conformal Skin Electronics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 3095–3105. https://doi.org/10.1145/3025453.3025704",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Thomas E von Wiegand, David W Schloerb, and Wendelin L Sachtler. 1999. Virtual workbench: Near-field virtual environment system with applications. Presence 8, 5 (1999), 492–519.",
      "doi": "10.1162/105474699566422"
    },
    {
      "text": "Anusha Withana, Daniel Groeger, and Jürgen Steimle. 2018. Tacttoo: A Thin and Feel-Through Tattoo for On-Skin Tactile Output. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). ACM, New York, NY, USA, 365–378. https://doi.org/10.1145/3242587.3242645",
      "doi": "10.1145/3242587.3242645"
    },
    {
      "text": "Zheer Xu, Pui Chung Wong, Jun Gong, Te-Yen Wu, Aditya Shekhar Nittala, Xiaojun Bi, Jürgen Steimle, Hongbo Fu, Kening Zhu, and Xing-Dong Yang. 2019. TipText: Eyes-Free Text Entry on a Fingertip Keyboard. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 883–899. https://doi.org/10.1145/3332165.3347865",
      "doi": "10.1145/3332165.3347865"
    },
    {
      "text": "Hui-Shyong Yeo, Erwin Wu, Juyoung Lee, Aaron Quigley, and Hideki Koike. 2019. Opisthenar: Hand Poses and Finger Tapping Recognition by Observing Back of Hand Using Embedded Wrist Camera. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 963–971. https://doi.org/10.1145/3332165.3347867",
      "doi": "10.1145/3332165.3347867"
    },
    {
      "text": "Sang Ho Yoon, Siyuan Ma, Woo Suk Lee, Shantanu Thakurdesai, Di Sun, Flávio P. Ribeiro, and James D. Holbery. 2019. HapSense: A Soft Haptic I/O Device with Uninterrupted Dual Functionalities of Force Sensing and Vibrotactile Actuation. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 949–961. https://doi.org/10.1145/3332165.3347888",
      "doi": "10.1145/3332165.3347888"
    },
    {
      "text": "Chuang-Wen You, Min-Wei Hung, Ximeng Zhang, Po-Chun Huang, and Hsin-Liu (Cindy) Kao. 2020. Online Survey Study on Social Perceptions towards Color-Changing on-Skin Displays. In Proceedings of the 2020 International Symposium on Wearable Computers (Virtual Event, Mexico) (ISWC ’20). Association for Computing Machinery, New York, NY, USA, 90–95. https://doi.org/10.1145/3410531.3414301",
      "doi": "10.1145/3410531.3414301"
    },
    {
      "text": "Chuang-Wen You, Ya-Fang Lin, Elle Luo, Hung-Yeh Lin, and Hsin-Liu (Cindy) Kao. 2019. Understanding Social Perceptions towards Interacting with On-Skin Interfaces in Public. In Proceedings of the 23rd International Symposium on Wearable Computers (London, United Kingdom) (ISWC ’19). Association for Computing Machinery, New York, NY, USA, 244–253. https://doi.org/10.1145/3341163.3347751",
      "doi": "10.1145/3341163.3347751"
    },
    {
      "text": "Forrest W Young and Robert M Hamer. 2013. Multidimensional scaling: History, theory, and applications. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Qasim Zaidi, Jonathan Victor, Josh McDermott, Maria Geffen, Sliman Bensmaia, and Thomas A Cleland. 2013. Perceptual spaces: mathematical structures to neural mechanisms. Journal of Neuroscience 33, 45 (2013), 17597–17602.",
      "doi": ""
    },
    {
      "text": "Clint Zeagler. 2017. Where to Wear It: Functional, Technical, and Social Considerations in on-Body Location for Wearable Technology 20 Years of Designing for Wearability. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (Maui, Hawaii) (ISWC ’17). Association for Computing Machinery, New York, NY, USA, 150–157. https://doi.org/10.1145/3123021.3123042",
      "doi": "10.1145/3123021.3123042"
    },
    {
      "text": "Yang Zhang, Wolf Kienzle, Yanjun Ma, Shiu S. Ng, Hrvoje Benko, and Chris Harrison. 2019. ActiTouch: Robust Touch Detection for On-Skin AR/VR Interfaces. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1151–1159. https://doi.org/10.1145/3332165.3347869",
      "doi": "10.1145/3332165.3347869"
    },
    {
      "text": "Yang Zhang, Junhan Zhou, Gierad Laput, and Chris Harrison. 2016. SkinTrack: Using the Body as an Electrical Waveguide for Continuous Finger Tracking on the Skin. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1491–1503. https://doi.org/10.1145/2858036.2858082",
      "doi": "10.1145/2858036.2858082"
    },
    {
      "text": "Junhan Zhou, Yang Zhang, Gierad Laput, and Chris Harrison. 2016. AuraSense: Enabling Expressive Around-Smartwatch Interactions with Electric Field Sensing. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 81–86. https://doi.org/10.1145/2984511.2984568",
      "doi": "10.1145/2984511.2984568"
    }
  ]
}