{
  "doi": "10.1145/3544548.3580830",
  "title": "Feel the Force, See the Force: Exploring Visual-tactile Associations of Deformable Surfaces with Colours and Shapes",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Deformable interfaces provide unique interaction potential for force input, for example, when users physically push into a soft display surface. However, there remains limited understanding of which visual-tactile design elements signify the presence and stiffness of such deformable force-input components. In this paper, we explore how people correspond surface stiffness to colours, graphical shapes, and physical shapes. We conducted a cross-modal correspondence (CC) study, where 30 participants associated different surface stiffnesses with colours and shapes. Our findings evidence the CCs between stiffness levels for a subset of the 2D/3D shapes and colours used in the study. We distil our findings in three design recommendations: (1) lighter colours should be used to indicate soft surfaces, and darker colours should indicate stiff surfaces; (2) rounded shapes should be used to indicate soft surfaces, while less-curved shapes should be used to indicate stiffer surfaces, and; (3) longer 2D drop-shadows should be used to indicate softer surfaces, while shorter drop-shadows should be used to indicate stiffer surfaces.",
  "tags": [
    "Force",
    "Multisensory Interaction",
    "Touch",
    "Colour",
    "Crossmodal Correspondences"
  ],
  "authors": [
    {
      "name": "Cameron Steer",
      "institution": "Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707900",
      "orcid": "0000-0001-8497-7932"
    },
    {
      "name": "Teodora Dinca",
      "institution": "Department of Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779603",
      "orcid": "0000-0002-1992-6749"
    },
    {
      "name": "Crescent Jicol",
      "institution": "Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702356",
      "orcid": "0000-0003-0599-8108"
    },
    {
      "name": "Michael J Proulx",
      "institution": "Department of Psychology, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490649352",
      "orcid": "0000-0003-4066-3645"
    },
    {
      "name": "Jason Alexander",
      "institution": "Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019697",
      "orcid": "0000-0001-6093-6116"
    }
  ],
  "references": [
    {
      "text": "Jason Alexander, John Hardy, and Stephen Wattam. 2014. Characterising the Physicality of Everyday Buttons. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces(ITS ’14). ACM, New York, NY, USA, 205–208. https://doi.org/10.1145/2669485.2669519 00011 event-place: Dresden, Germany.",
      "doi": "10.1145/2669485.2669519"
    },
    {
      "text": "Jason Alexander, Anne Roudaut, Jurgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand Challenges in Shape-Changing Interface Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 299:1–299:14. https://doi.org/10.1145/3173574.3173873 event-place: Montreal QC, Canada.",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: electrovibration for touch surfaces. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. Association for Computing Machinery, New York, NY, USA, 283–292. https://doi.org/10.1145/1866029.1866074",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Alberto Boem and Giovanni Maria Troiano. 2019. Non-Rigid HCI: A Review of Deformable Interfaces and Input. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 885–906. https://doi.org/10.1145/3322276.3322347 tex.ids= boemNonRigidHCIReview2019a.",
      "doi": "10.1145/3322276.3322347"
    },
    {
      "text": "Cesar Flores Cano and Anne Roudaut. 2019. MorphBenches: Using mixed reality experimentation platforms to study dynamic affordances in shape-changing devices. International Journal of Human-Computer Studies 132 (2019), 1–11. https://doi.org/10.1016/j.ijhcs.2019.07.006",
      "doi": "10.1016/j.ijhcs.2019.07.006"
    },
    {
      "text": "Müge Cavdan, Katja Doerschner, and Knut Drewing. 2021. Task and material properties interactively affect softness explorations along different dimensions. IEEE Transactions on Haptics 14, 3 (2021), 603–614.",
      "doi": ""
    },
    {
      "text": "Aleksandra Ćwiek, Susanne Fuchs, Christoph Draxler, Eva Liina Asu, Dan Dediu, Katri Hiovain, Shigeto Kawahara, Sofia Koutalidis, Manfred Krifka, Pärtel Lippus, 2022. The bouba/kiki effect is robust across cultures and writing systems. Philosophical Transactions of the Royal Society B 377, 1841(2022), 20200390.",
      "doi": ""
    },
    {
      "text": "Alexandra Delazio, Ali Israr, and Roberta L. Klatzky. 2017. Cross-Modal Correspondence between Vibrations and Colors. In 2017 IEEE World Haptics Conference (WHC). 219–224. https://doi.org/10.1109/WHC.2017.7989904",
      "doi": ""
    },
    {
      "text": "Massimiliano Di Luca. 2014. Multisensory softness. Springer.",
      "doi": ""
    },
    {
      "text": "Feng Feng, Dan Bennett, Zhi-jun Fan, and Oussama Metatla. 2022. It’s Touching: Understanding Touch-Affect Association in Shape-Change with Kinematic Features. In CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3491102.3502003",
      "doi": "10.1145/3491102.3502003"
    },
    {
      "text": "Feng Feng and Tony Stockman. 2017. An investigation of dynamic crossmodal instantiation in TUIs. In Proceedings of the 19th ACM International Conference on Multimodal Interaction(ICMI ’17). Association for Computing Machinery, New York, NY, USA, 82–90. https://doi.org/10.1145/3136755.3136782",
      "doi": "10.1145/3136755.3136782"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming User Interfaces: Programmable Particle Stiffness and Sensing for Malleable and Shape-changing Devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology(UIST ’12). ACM, New York, NY, USA, 519–528. https://doi.org/10.1145/2380116.2380181 event-place: Cambridge, Massachusetts, USA.",
      "doi": "10.1145/2380116.2380181"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology(UIST ’13). ACM, New York, NY, USA, 417–426. https://doi.org/10.1145/2501988.2502032 event-place: St. Andrews, Scotland, United Kingdom.",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Bruno Fruchard, Paul Strohmeier, Roland Bennewitz, and Jürgen Steimle. 2021. Squish This: Force Input on Soft Surfacesfor Visual Targeting Tasks. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3411764.3445623",
      "doi": "10.1145/3411764.3445623"
    },
    {
      "text": "Alix Goguey, Sylvain Malacria, and Carl Gutwin. 2018. Improving Discoverability and Expert Performance in Force-Sensitive Text Selection for Touch Devices with Mode Gauges. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174051 00015.",
      "doi": "10.1145/3173574.3174051"
    },
    {
      "text": "Jaehyun Han, Seongkook Heo, Jiseong Gu, and Geehyuk Lee. 2014. Trampoline: a double-sided elastic touch device for repoussé and chasing techniques. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 1627–1632. https://doi.org/10.1145/2559206.2581252",
      "doi": "10.1145/2559206.2581252"
    },
    {
      "text": "Chris Harrison and Scott Hudson. 2012. Using shear as a supplemental two-dimensional input channel for rich touchscreen interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Austin Texas USA, 3149–3152. https://doi.org/10.1145/2207676.2208730",
      "doi": "10.1145/2207676.2208730"
    },
    {
      "text": "Liang He, Gierad Laput, Eric Brockmeyer, and Jon E. Froehlich. 2017. SqueezaPulse: Adding Interactive Input to Fabricated Objects Using Corrugated Tubes and Air Pulses. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’17). ACM, New York, NY, USA, 341–350. https://doi.org/10.1145/3024969.3024976 event-place: Yokohama, Japan.",
      "doi": "10.1145/3024969.3024976"
    },
    {
      "text": "Seongkook Heo and Geehyuk Lee. 2011. Force Gestures: Augmented Touch Screen Gestures Using Normal and Tangential Force. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’11). ACM, New York, NY, USA, 1909–1914. https://doi.org/10.1145/1979742.1979895 event-place: Vancouver, BC, Canada.",
      "doi": "10.1145/1979742.1979895"
    },
    {
      "text": "Seongkook Heo and Geehyuk Lee. 2013. Indirect Shear Force Estimation for Multi-point Shear Force Operations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). ACM, New York, NY, USA, 281–284. https://doi.org/10.1145/2470654.2470693 event-place: Paris, France.",
      "doi": "10.1145/2470654.2470693"
    },
    {
      "text": "Yvonne Jansen, Thorsten Karrer, and Jan Borchers. 2010. MudPad: A Tactile Memory Game. In ACM International Conference on Interactive Tabletops and Surfaces(ITS ’10). ACM, New York, NY, USA, 306–306. https://doi.org/10.1145/1936652.1936734 event-place: Saarbrücken, Germany.",
      "doi": "10.1145/1936652.1936734"
    },
    {
      "text": "Yvonne Jansen, Thorsten Karrer, and Jan Borchers. 2010. MudPad: Tactile Feedback and Haptic Texture Overlay for Touch Surfaces. In ACM International Conference on Interactive Tabletops and Surfaces(ITS ’10). ACM, New York, NY, USA, 11–14. https://doi.org/10.1145/1936652.1936655 00111 event-place: Saarbrücken, Germany.",
      "doi": "10.1145/1936652.1936655"
    },
    {
      "text": "Kasun Karunanayaka, Anton Nijholt, Thilina Halloluwa, Nimesha Ranasinghe, Manjusri Wickramasinghe, and Dhaval Vyas. 2021. Multisensory Augmented Reality. In IFIP Conference on Human-Computer Interaction. Springer, 558–563.",
      "doi": ""
    },
    {
      "text": "Hyunyoung Kim, Celine Coutrix, and Anne Roudaut. 2018. Morphees+: Studying Everyday Reconfigurable Objects for the Design and Taxonomy of Reconfigurable UIs. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174193",
      "doi": "10.1145/3173574.3174193"
    },
    {
      "text": "Hyunyoung Kim, Aluna Everitt, Carlos Tejada, Mengyu Zhong, and Daniel Ashbrook. 2021. MorpheesPlug: A Toolkit for Prototyping Shape-Changing Interfaces. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3411764.3445786 00000.",
      "doi": "10.1145/3411764.3445786"
    },
    {
      "text": "Wolfgang Köhler. 1970. Gestalt psychology: An introduction to new concepts in modern psychology. Vol. 18. WW Norton & Company.",
      "doi": ""
    },
    {
      "text": "Bhoram Lee, Hyunjeong Lee, Soo-Chul Lim, Hyungkew Lee, Seungju Han, and Joonah Park. 2012. Evaluation of Human Tangential Force Input Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). ACM, New York, NY, USA, 3121–3130. https://doi.org/10.1145/2207676.2208727 00000 tex.ids= leeEvaluationHumanTangential2012a, leeEvaluationHumanTangential2012b event-place: Austin, Texas, USA.",
      "doi": "10.1145/2207676.2208727"
    },
    {
      "text": "Anan Lin, Meike Scheller, Feng Feng, Michael J. Proulx, and Oussama Metatla. 2021. Feeling Colours: Crossmodal Correspondences Between Tangible 3D Objects, Colours and Emotions. CHI (May 2021). https://doi.org/10.1145/3411764.3445373 MAG ID: 3161343203 S2ID: 932ad61224a1cdb61b924ec9a509a82d14ea8491.",
      "doi": "10.1145/3411764.3445373"
    },
    {
      "text": "Tayfun Lloyd-Esenkaya, Vanessa Lloyd-Esenkaya, Eamonn O’Neill, and Michael J Proulx. 2020. Multisensory inclusive design with sensory substitution. Cognitive Research: Principles and Implications 5, 1(2020), 1–15.",
      "doi": ""
    },
    {
      "text": "Vera U. Ludwig and Julia Simner. 2013. What colour does that feel? Tactile–visual mapping and the development of cross-modality. Cortex 49, 4 (April 2013), 1089–1099. https://doi.org/10.1016/j.cortex.2012.04.004",
      "doi": ""
    },
    {
      "text": "Daphne Maurer, Thanujeni Pathman, and Catherine J Mondloch. 2006. The shape of boubas: Sound–shape correspondences in toddlers and adults. Developmental science 9, 3 (2006), 316–322.",
      "doi": ""
    },
    {
      "text": "Philipp Mayring. 2000. Qualitative Content Analysis. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research [On-line Journal], http://qualitative-research.net/fqs/fqs-e/2-00inhalt-e.htm 1 (06 2000).",
      "doi": ""
    },
    {
      "text": "Philipp Mayring. 2019. Qualitative Content Analysis: Demarcation, Varieties, Developments. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research 20, 3 (Sep. 2019). https://doi.org/10.17169/fqs-20.3.3343",
      "doi": ""
    },
    {
      "text": "Timothy Robert Merritt, Mie Nørgaard, Christian Laursen, Majken Kirkeg\\aard Rasmussen, and Marianne Graves Petersen. 2015. Imagined Physics: Exploring Examples of Shape-changing Interfaces. In Cognitive Robotics. CRC Press, 89–111. 00000.",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Emanuela Maggioni, Clare Cullen, and Marianna Obrist. 2019. \"Like Popcorn\": Crossmodal Correspondences Between Scents, 3D Shapes and Emotions in Children. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300689",
      "doi": "10.1145/3290605.3300689"
    },
    {
      "text": "Margaret R. Minsky. 1984. Manipulating Simulated Objects with Real-world Gestures Using a Force and Position Sensitive Screen. SIGGRAPH Comput. Graph. 18, 3 (1984), 195–203. https://doi.org/10.1145/964965.808598 00000 Place: New York, NY, USA Publisher: ACM.",
      "doi": "10.1145/964965.808598"
    },
    {
      "text": "Viktor Miruchna, Robert Walter, David Lindlbauer, Maren Lehmann, Regine von Klitzing, and Jorg Muller. 2015. GelTouch: Localized Tactile Feedback Through Thin, Programmable Gel. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(UIST ’15). ACM, New York, NY, USA, 3–10. https://doi.org/10.1145/2807442.2807487 00000 event-place: Charlotte, NC, USA.",
      "doi": "10.1145/2807442.2807487"
    },
    {
      "text": "Ken Nakagaki, Daniel Fitzgerald, Zhiyao (John) Ma, Luke Vink, Daniel Levine, and Hiroshi Ishii. 2019. inFORCE: Bi-directional ‘Force’ Shape Display for Haptic Interaction. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’19). Association for Computing Machinery, New York, NY, USA, 615–623. https://doi.org/10.1145/3294109.3295621 00000.",
      "doi": "10.1145/3294109.3295621"
    },
    {
      "text": "Ken Nakagaki, Luke Vink, Jared Counts, Daniel Windham, Daniel Leithinger, Sean Follmer, and Hiroshi Ishii. 2016. Materiable: Rendering Dynamic Material Properties in Response to Direct Physical Touch with Shape Changing Interfaces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 2764–2772. https://doi.org/10.1145/2858036.2858104 00000 event-place: San Jose, California, USA.",
      "doi": "10.1145/2858036.2858104"
    },
    {
      "text": "Mie Nørgaard, Tim Merritt, Majken Kirkegaard Rasmussen, and Marianne Graves Petersen. 2013. Exploring the Design Space of Shape-changing Objects: Imagined Physics. In Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces(DPPI ’13). ACM, New York, NY, USA, 251–260. https://doi.org/10.1145/2513506.2513533 00000 event-place: Newcastle upon Tyne, United Kingdom.",
      "doi": "10.1145/2513506.2513533"
    },
    {
      "text": "Jifei Ou, Mélina Skouras, Nikolaos Vlavianos, Felix Heibeck, Chin-Yi Cheng, Jannik Peters, and Hiroshi Ishii. 2016. aeroMorph - Heat-sealing Inflatable Shape-change Materials for Interaction Design. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(UIST ’16). ACM, New York, NY, USA, 121–132. https://doi.org/10.1145/2984511.2984520 00000 event-place: Tokyo, Japan.",
      "doi": "10.1145/2984511.2984520"
    },
    {
      "text": "Cesare Parise and Charles Spence. 2008. Synesthetic congruency modulates the temporal ventriloquism effect. Neuroscience Letters 442, 3 (Sept. 2008), 257–261. https://doi.org/10.1016/j.neulet.2008.07.010",
      "doi": ""
    },
    {
      "text": "Cesare V. Parise and Charles Spence. 2012. Audiovisual crossmodal correspondences and sound symbolism: a study using the implicit association test. Experimental Brain Research 220, 3-4 (Aug. 2012), 319–333. https://doi.org/10.1007/s00221-012-3140-6",
      "doi": ""
    },
    {
      "text": "Esben W. Pedersen, Sriram Subramanian, and Kasper Hornbæk. 2014. Is My Phone Alive?: A Large-scale Study of Shape Change in Handheld Devices Using Videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, New York, NY, USA, 2579–2588. https://doi.org/10.1145/2556288.2557018 00000 event-place: Toronto, Ontario, Canada.",
      "doi": "10.1145/2556288.2557018"
    },
    {
      "text": "Isabel PS Qamar, Rainer Groh, David Holman, and Anne Roudaut. 2018. HCI meets material science: A literature review of morphing materials for the design of shape-changing interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–23.",
      "doi": "10.1145/3173574.3173948"
    },
    {
      "text": "Isabel P. S. Qamar, Rainer Groh, David Holman, and Anne Roudaut. 2018. HCI meets Material Science: A Literature Review of Morphing Materials for the Design of Shape-Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–23. https://doi.org/10.1145/3173574.3173948 00000 tex.ids= qamarHCIMeetsMaterial2018a.",
      "doi": "10.1145/3173574.3173948"
    },
    {
      "text": "Vilayanur S Ramachandran and Edward M Hubbard. 2003. Hearing colors, tasting shapes. Scientific American 288, 5 (2003), 52–59.",
      "doi": ""
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-changing Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). ACM, New York, NY, USA, 735–744. https://doi.org/10.1145/2207676.2207781 00000 event-place: Austin, Texas, USA.",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Simon Robinson, Céline Coutrix, Jennifer Pearson, Juan Rosso, Matheus Fernandes Torquato, Laurence Nigay, and Matt Jones. 2016. Emergeables: Deformable Displays for Continuous Eyes-Free Mobile Interaction. In CHI’16: 2016 CHI Conference on Human Factors in Computing Systems Proceedings. ACM, New York, NY, USA. https://doi.org/10.1145/2858036.2858097 00000 event-place: San Jose, CA, USA.",
      "doi": "10.1145/2858036.2858097"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Lochtefeld, and Sriram Subramanian. 2013. Morphees: Toward High Shape Resolution in Self-actuated Flexible Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). ACM, New York, NY, USA, 593–602. https://doi.org/10.1145/2470654.2470738 00000 event-place: Paris, France.",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Anne Roudaut, Diana Krusteva, Mike McCoy, Abhijit Karnik, Karthik Ramani, and Sriram Subramanian. 2016. Cubimorph: designing modular interactive devices. In 2016 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 3339–3345. https://doi.org/10.1109/ICRA.2016.7487508 00000.",
      "doi": "10.1109/ICRA.2016.7487508"
    },
    {
      "text": "Deepak Ranjan Sahoo, Kasper Hornbæk, and Sriram Subramanian. 2016. TableHop: An Actuated Fabric Display Using Transparent Electrodes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 3767–3780. https://doi.org/10.1145/2858036.2858544 00000 event-place: Santa Clara, California, USA.",
      "doi": "10.1145/2858036.2858544"
    },
    {
      "text": "Martin Schmitz, Sebastian Günther, Dominik Schön, and Florian Müller. 2022. Squeezy-Feely: Investigating Lateral Thumb-Index Pinching as an Input Modality. In CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3491102.3501981",
      "doi": "10.1145/3491102.3501981"
    },
    {
      "text": "Nadiya Slobodenyuk, Yasmina Jraissati, Ali Kanso, Lama Ghanem, and Imad Elhajj. 2015. Cross-Modal Associations between Color and Haptics. Attention, Perception, & Psychophysics 77, 4 (May 2015), 1379–1395. https://doi.org/10.3758/s13414-015-0837-1",
      "doi": ""
    },
    {
      "text": "Ronit Slyper, Ivan Poupyrev, and Jessica Hodgins. 2010. Sensing through Structure: Designing Soft Silicone Sensors. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (Funchal, Portugal) (TEI ’11). Association for Computing Machinery, New York, NY, USA, 213–220. https://doi.org/10.1145/1935701.1935744",
      "doi": "10.1145/1935701.1935744"
    },
    {
      "text": "Mandayam A Srinivasan and Robert H LaMotte. 1995. Tactual discrimination of softness. Journal of neurophysiology 73, 1 (1995), 88–101.",
      "doi": ""
    },
    {
      "text": "Cameron Steer, Jennifer Pearson, Simon Robinson, and Matt Jones. 2017. Deformable Paint Palette: Actuated Force Controls for Digital Painting. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). ACM, New York, NY, USA, 2936–2943. https://doi.org/10.1145/3027063.3053219 00000 event-place: Denver, Colorado, USA.",
      "doi": "10.1145/3027063.3053219"
    },
    {
      "text": "Miriam Sturdee and Jason Alexander. 2018. Analysis and Classification of Shape-Changing Interfaces for Design and Application-based Research. ACM Computing Surveys (CSUR) 51, 1 (2018), 2. https://doi.org/10.1145/3143559 00030 tex.ids= sturdeeAnalysisClassificationShapechanging2018 tex.mag_id: 2781970480 tex.pmcid: null publisher: ACM.",
      "doi": "10.1145/3143559"
    },
    {
      "text": "Faisal Taher, Jason Alexander, John Hardy, and Eduardo Velloso. 2014. An Empirical Characterization of Touch-Gesture Input-Force on Mobile Devices. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces(ITS ’14). ACM, New York, NY, USA, 195–204. https://doi.org/10.1145/2669485.2669515 00008 event-place: Dresden, Germany.",
      "doi": "10.1145/2669485.2669515"
    },
    {
      "text": "John Tiab and Kasper Hornbæk. 2016. Understanding Affordance, System State, and Feedback in Shape-Changing Buttons. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 2752–2763. https://doi.org/10.1145/2858036.2858350 00000 event-place: Santa Clara, California, USA.",
      "doi": "10.1145/2858036.2858350"
    },
    {
      "text": "Wouter M Bergmann Tiest and Astrid ML Kappers. 2009. Cues for haptic perception of compliance. IEEE transactions on haptics 2, 4 (2009), 189–199.",
      "doi": "10.1109/TOH.2009.16"
    },
    {
      "text": "Jessica Tsimeris, Colin Dedman, Michael Broughton, and Tom Gedeon. 2013. ForceForm: A Dynamically Deformable Interactive Surface. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces(ITS ’13). ACM, New York, NY, USA, 175–178. https://doi.org/10.1145/2512349.2512807 00000 event-place: St. Andrews, Scotland, United Kingdom.",
      "doi": "10.1145/2512349.2512807"
    },
    {
      "text": "Kevin Vlack, Terukazu Mizota, Naoki Kawakami, Kazuto Kamiyama, Hiroyuki Kajimoto, and Susumu Tachi. 2005. GelForce: a vision-based traction field computer interface. In CHI ’05 extended abstracts on Human factors in computing systems - CHI ’05. ACM Press, Portland, OR, USA, 1154. https://doi.org/10.1145/1056808.1056859 00067.",
      "doi": "10.1145/1056808.1056859"
    },
    {
      "text": "Joe H Ward Jr. 1963. Hierarchical grouping to optimize an objective function. Journal of the American statistical association 58, 301(1963), 236–244.",
      "doi": ""
    },
    {
      "text": "Kentaro Yoshida, Hiroshi Suzuki, Hironobu Abe, Akira Ono, Hiroto Kawaguchi, Masahiro Sato, Yota Komoriya, and Kazunobu Ohkuri. 2021. Pneumatic Concave Deformable Device and Finger Deformation-Based Evaluation for Hardness Perception. In 2021 IEEE World Haptics Conference (WHC). 668–673. https://doi.org/10.1109/WHC49131.2021.9517139 00000.",
      "doi": ""
    }
  ]
}