{
  "doi": "10.1145/3544548.3581489",
  "title": "“I See Me Here”: Mental Health Content, Community, and Algorithmic Curation on TikTok",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Social media platforms are a place where people look for information and social support for mental health, resulting in both positive and negative effects on users. TikTok has gained notoriety for an abundance of mental health content and discourse. We present findings from a semi-structured interview study with 16 participants about mental health content and participants’ perceptions of community on TikTok. We find that TikTok’s community structure is permeable, allowing for self-discovery and understanding not found in traditional online communities. However, participants are wary of mental health information due to conflicts between a creator’s vulnerability and credibility. Our interviews suggest that the “For You Page\" is a runaway train that encourages diverse community and content engagement but also displays harmful content that participants feel they cannot escape. We propose design implications to support better mental health, as well as implications for social computing research on community in algorithmic landscapes.",
  "tags": [
    "Social Media",
    "Mental Health",
    "Interview",
    "Community",
    "TikTok"
  ],
  "authors": [
    {
      "name": "Ashlee Milton",
      "institution": "University of Minnesota, Minneapolis, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659463679",
      "orcid": "0000-0002-0320-6122"
    },
    {
      "name": "Leah Ajmani",
      "institution": "University of Minnesota, Minneapolis, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659897213",
      "orcid": "0000-0003-2468-6070"
    },
    {
      "name": "Michael Ann DeVito",
      "institution": "University of Colorado Boulder, United States, USA",
      "img": "/do/10.1145/contrib-99659130873/rel-imgonly/img_4038.jpg",
      "acmid": "99659130873",
      "orcid": "0000-0003-1001-2307"
    },
    {
      "name": "Stevie Chancellor",
      "institution": "University of Minnesota, Minneapolis, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658724335",
      "orcid": "0000-0003-0620-0903"
    }
  ],
  "references": [
    {
      "text": "Patricia A Adler and Peter Adler. 1987. Membership roles in field research. Vol. 6. Sage, USA.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2018. Social support, reciprocity, and anonymity in responses to sexual abuse disclosures on social media. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 5(2018), 1–35.",
      "doi": "10.1145/3234942"
    },
    {
      "text": "American Psychological Association. 2019. Mental health issues increased significantly in young adults over last decade. Retrieved December 12, 2022 from https://www.sciencedaily.com/releases/2019/03/190315110908.htm",
      "doi": ""
    },
    {
      "text": "Corey H Basch, Lorie Donelle, Joseph Fera, and Christie Jaime. 2022. Deconstructing TikTok videos on mental health: cross-sectional, descriptive content analysis. JMIR formative research 6, 5 (2022), e38340.",
      "doi": ""
    },
    {
      "text": "Natalie Berry, Fiona Lobban, Maksim Belousov, Richard Emsley, Goran Nenadic, and Sandra Bucci. 2017. #WhyWeTweetMH: Understanding Why People Use Twitter to Discuss Mental Health Problems. Journal of Medical Internet Research 19, 4 (2017), e6173. https://doi.org/10.2196/jmir.6173",
      "doi": ""
    },
    {
      "text": "Aparajita Bhandari and Sara Bimo. 2022. Why’s Everyone on TikTok Now? The Algorithmized Self and the Future of Self-Making on Social Media. Social Media+ Society 8, 1 (2022), 20563051221086241.",
      "doi": ""
    },
    {
      "text": "Johnna Blair and Saeed Abdullah. 2018. Supporting Constructive Mental Health Discourse in Social Media. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare(PervasiveHealth ’18). Association for Computing Machinery, New York, NY, USA, 299–303. https://doi.org/10.1145/3240925.3240930",
      "doi": "10.1145/3240925.3240930"
    },
    {
      "text": "Anita L Blanchard and M Lynne Markus. 2004. The experienced\" sense\" of a virtual community: Characteristics and processes. ACM Sigmis Database: the database for advances in information systems 35, 1(2004), 64–79.",
      "doi": ""
    },
    {
      "text": "Andrea Bonior. 2019. What is rejection sensitive dysphoria?Retrieved September 8, 2022 from https://www.psychologytoday.com/us/blog/friendship-20/201907/what-is-rejection-sensitive-dysphoria",
      "doi": ""
    },
    {
      "text": "Ted K Bradshaw. 2008. The post-place community: Contributions to the debate about the definition of community. Community Development 39, 1 (2008), 5–16.",
      "doi": ""
    },
    {
      "text": "Gillian Brown, Max Marshall, Peter Bower, Adrine Woodham, and Waquas Waheed. 2014. Barriers to recruiting ethnic minorities to mental health research: a systematic review. International journal of methods in psychiatric research 23, 1(2014), 36–48.",
      "doi": ""
    },
    {
      "text": "Eleanor R Burgess, Kathryn E Ringland, Jennifer Nicholas, Ashley A Knapp, Jordan Eschler, David C Mohr, and Madhu C Reddy. 2019. \"I think people are powerful\" The Sociality of Individuals Managing Depression. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–29.",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2016. Local standards for sample size at CHI. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 981–992.",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Christina Caron. 2022. Teens turn to TikTok in search of a mental health diagnosis. Retrieved September 8, 2022 from https://www.nytimes.com/2022/10/29/well/mind/tiktok-mental-illness-diagnosis.html",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, Erica L Goodman, Stephanie Zerwas, and Munmun De Choudhury. 2016. Quantifying and predicting mental illness severity in online pro-eating disorder communities. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. ACM, 1171–1184.",
      "doi": "10.1145/2818048.2819973"
    },
    {
      "text": "Stevie Chancellor, Jessica Annette Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. # thyghgapp: Instagram content moderation and lexical variation in pro-eating disorder communities. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. ACM, 1201–1213.",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. sage.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz, Liska Belgrave, 2012. Qualitative interviewing and grounded theory analysis. The SAGE handbook of interview research: The complexity of the craft 2 (2012), 347–365.",
      "doi": ""
    },
    {
      "text": "Eugene Ch’ng. 2015. The bottom-up formation and maintenance of a Twitter community: Analysis of the #FreeJahar Twitter community. Industrial Management & Data Systems 115, 4 (2015), 612–624. https://doi.org/10.1108/IMDS-11-2014-0332",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity. In Eighth International AAAI Conference on Weblogs and Social Media. AAAI.",
      "doi": ""
    },
    {
      "text": "Geoffrey Comp, Sean Dyer, and Michael Gottlieb. 2021. Is TikTok the next social media frontier for medicine?AEM Education and Training 5, 3 (2021).",
      "doi": ""
    },
    {
      "text": "Kelley Cotter, Julia R DeCook, Shaheen Kanthawala, and Kali Foyle. 2022. In FYP We Trust: The Divine Force of Algorithmic Conspirituality. International Journal of Communication 16 (2022), 1–23.",
      "doi": ""
    },
    {
      "text": "Carolyn E Cutrona and Daniel W Russell. 1990. Type of social support and specific stress: Toward a theory of optimal matching.In Social support: An interactional view, B. R. Sarason, I. G. Sarason, and G. R. Pierce (Eds.). John Wiley & Sons, 319–366.",
      "doi": ""
    },
    {
      "text": "Michael F Dahlstrom. 2021. The narrative truth about scientific misinformation. Proceedings of the National Academy of Sciences 118, 15(2021), e1914085117.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental health discourse on reddit: Self-disclosure, social support, and anonymity. In Eighth international AAAI conference on weblogs and social media.",
      "doi": ""
    },
    {
      "text": "Ivan De Martino, Rocco D’Apolito, Alexander S McLawhorn, Keith A Fehring, Peter K Sculco, and Giorgio Gasparini. 2017. Social media for patients: benefits and drawbacks. Current reviews in musculoskeletal medicine 10, 1 (2017), 141–145.",
      "doi": ""
    },
    {
      "text": "Andrew Devendorf, Ansley Bender, and Jonathan Rottenberg. 2020. Depression presentations, stigma, and mental health literacy: A critical review and YouTube content analysis. Clinical Psychology Review 78 (2020), 101843. https://doi.org/10.1016/j.cpr.2020.101843",
      "doi": ""
    },
    {
      "text": "Michael A. DeVito. 2019. User Adaptation to Constant Change in Algorithmically-Driven Social Platforms. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3299082",
      "doi": "10.1145/3290607.3299082"
    },
    {
      "text": "Michael Ann DeVito. 2022. How Transfeminine TikTok Creators Navigate the Algorithmic Trap of Visibility Via Folk Theorization. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2, 1–31.",
      "doi": "10.1145/3555105"
    },
    {
      "text": "Michael Ann DeVito, Ashley Marie Walker, and Julia R. Fernandez. 2021. Values (Mis)alignment: Exploring Tensions Between Platform and LGBTQ+ Community Design Values. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 88:1–88:27. https://doi.org/10.1145/3449162",
      "doi": "10.1145/3449162"
    },
    {
      "text": "Meagan Drillinger. 2022. What to Know About Using TikTok as a Mental Health Resource. Retrieved September 8, 2022 from https://www.healthline.com/health-news/what-to-know-about-using-tiktok-as-a-mental-health-resource",
      "doi": ""
    },
    {
      "text": "Sindhu Kiranmai Ernala, Tristan Labetoulle, Fred Bane, Michael L Birnbaum, Asra F Rizvi, John M Kane, and Munmun De Choudhury. 2018. Characterizing audience engagement and assessing its impact on social media disclosures of mental illnesses. In Twelfth international AAAI conference on web and social media.",
      "doi": ""
    },
    {
      "text": "Jessica L. Feuston. 2019. Algorithms, Oppression, and Mental Illness on Social Media. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/3290607.3299072",
      "doi": "10.1145/3290607.3299072"
    },
    {
      "text": "Jessica L. Feuston and Anne Marie Piper. 2018. Beyond the Coded Gaze: Analyzing Expression of Mental Health and Illness on Instagram. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 51:1–51:21. https://doi.org/10.1145/3274320",
      "doi": "10.1145/3274320"
    },
    {
      "text": "Jessica L. Feuston and Anne Marie Piper. 2019. Everyday Experiences: Small Stories and Mental Illness on Instagram. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": ""
    },
    {
      "text": "R Gilmore, J Beezhold, V Selwyn, R Howard, I Bartolome, and N Henderson. 2022. Is TikTok increasing the number of self-diagnoses of ADHD in young people?European Psychiatry 65, S1 (2022), S571–S571.",
      "doi": ""
    },
    {
      "text": "Crystal Gong, Koustuv Saha, and Stevie Chancellor. 2021. \" The Smartest Decision for My Future\": Social Media Reveals Challenges and Stress During Post-College Life Transition. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–29.",
      "doi": "10.1145/3476039"
    },
    {
      "text": "Jina Huh and Mark S Ackerman. 2012. Collaborative help in chronic disease management: supporting individualized problems. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. 853–862.",
      "doi": "10.1145/2145204.2145331"
    },
    {
      "text": "Jeffrey C Johnson and Susan C Weller. 2002. Elicitation techniques for interviewing. Handbook of interview research: Context and method (2002), 491–514.",
      "doi": ""
    },
    {
      "text": "Marius Kaminskas and Derek Bridge. 2016. Diversity, serendipity, novelty, and coverage: a survey and empirical analysis of beyond-accuracy objectives in recommender systems. ACM Transactions on Interactive Intelligent Systems (TiiS) 7, 1(2016), 1–42.",
      "doi": "10.1145/2926720"
    },
    {
      "text": "Nadia Karizat, Dan Delmonaco, Motahhare Eslami, and Nazanin Andalibi. 2021. Algorithmic folk theories and identity: How TikTok users co-produce Knowledge of identity and engage in algorithmic resistance. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–44.",
      "doi": "10.1145/3476046"
    },
    {
      "text": "Wenwen Kong, Shijie Song, Yuxiang Chris Zhao, Qinghua Zhu, Ling Sha, 2021. TikTok as a health information source: assessment of the quality of information in diabetes-related videos. Journal of Medical Internet Research 23, 9 (2021), e30409.",
      "doi": ""
    },
    {
      "text": "Kelli María Korducki. 2022. TikTok trends or the pandemic? What’s behind the rise in ADHD diagnoses. Retrieved September 8, 2022 from https://www.theguardian.com/society/2022/jun/02/tiktok-trends-or-the-pandemic-whats-behind-the-rise-in-adhd-diagnoses",
      "doi": ""
    },
    {
      "text": "Robert E Kraut and Paul Resnick. 2012. Building successful online communities: Evidence-based social design. Mit Press.",
      "doi": "10.5555/2207798"
    },
    {
      "text": "E. Megan Lachmar, Andrea K. Wittenborn, Katherine W. Bogen, and Heather L. McCauley. 2017. #MyDepressionLooksLike: Examining Public Discourse About Depression on Twitter. JMIR Mental Health 4, 4 (2017), e8141. https://doi.org/10.2196/mental.8141",
      "doi": ""
    },
    {
      "text": "Annie YS Lau, Elia Gabarron, Luis Fernandez-Luque, and Manuel Armayones. 2012. Social media in health—what are the safety concerns for health consumers?Health Information Management Journal 41, 2 (2012), 30–35.",
      "doi": ""
    },
    {
      "text": "Daniel Le Compte and Daniel Klug. 2021. “It’s Viral!” - A Study of the Behaviors, Practices, and Motivations of TikTok Users and Social Activism. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’21). Association for Computing Machinery, New York, NY, USA, 108–111. https://doi.org/10.1145/3462204.3481741",
      "doi": "10.1145/3462204.3481741"
    },
    {
      "text": "Alex Leavitt. 2015. \" This is a Throwaway Account\" Temporary Technical Identities and Perceptions of Anonymity in a Massive Online Community. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing. 317–327.",
      "doi": ""
    },
    {
      "text": "Yachao Li, Mengfei Guan, Paige Hammond, and Lane E Berrey. 2021. Communicating COVID-19 information on TikTok: a content analysis of TikTok videos from official accounts featured in the COVID-19 information hub. Health education research 36, 3 (2021), 261–271.",
      "doi": ""
    },
    {
      "text": "Alice E Marwick and Danah Boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New media & society 13, 1 (2011), 114–133.",
      "doi": ""
    },
    {
      "text": "Katerina Eva Matsa. 2022. More Americans are getting news on TikTok, bucking the trend on other social media sites. (2022). https://www.pewresearch.org/fact-tank/2022/10/21/more-americans-are-getting-news-on-tiktok-bucking-the-trend-on-other-social-media-sites/",
      "doi": ""
    },
    {
      "text": "Darragh McCashin and Colette M Murphy. 2022. Using TikTok for public and youth mental health–A systematic review and content analysis. Clinical Child Psychology and Psychiatry(2022), 13591045221106608.",
      "doi": ""
    },
    {
      "text": "David W. McMillan and David M. Chavis. 1986. Sense of community: A definition and theory. Journal of Community Psychology 14, 1 (1986), 6–23. https://doi.org/10.1002/1520-6629(198601)14:1<6::AID-JCOP2290140103>3.0.CO;2-I",
      "doi": ""
    },
    {
      "text": "Nicole Messina. 2021. IT’S THERE FOR YOU, BUT IS IT #FYP?: A METHODOLOGICAL REFLECTION OF RESEARCHING CONTENT VS. COMMUNITY ON TIKTOK. AoIR Selected Papers of Internet Research(2021). https://doi.org/10.5210/spir.v2021i0.11982",
      "doi": ""
    },
    {
      "text": "Matthew B Miles and A Michael Huberman. 1994. Qualitative data analysis: An expanded sourcebook. sage.",
      "doi": ""
    },
    {
      "text": "Ashlee Milton and Stevie Chancellor. 2022. The Users Aren’t Alright: Dangerous Mental Illness Behaviors and Recommendations. arXiv preprint arXiv:2209.03941(2022).",
      "doi": ""
    },
    {
      "text": "J. A. Naslund, K. A. Aschbrenner, L. A. Marsch, and S. J. Bartels. 2016. The future of mental health care: peer-to-peer support and social media. Epidemiology and Psychiatric Sciences 25, 2 (2016), 113–122. https://doi.org/10.1017/S2045796015001067",
      "doi": ""
    },
    {
      "text": "TikTok Newsroom. 2020. How TikTok recommends videos #ForYou. Retrieved December 12, 2022 from https://newsroom.tiktok.com/en-us/how-tiktok-recommends-videos-for-you",
      "doi": ""
    },
    {
      "text": "TikTok Newsroom. 2021. Thanks a billion!Retrieved December 12, 2022 from https://newsroom.tiktok.com/en-us/1-billion-people-on-tiktok",
      "doi": ""
    },
    {
      "text": "Ray Oldenburg. 1999. The great good place: Cafes, coffee shops, bookstores, bars, hair salons, and other hangouts at the heart of a community. Da Capo Press.",
      "doi": ""
    },
    {
      "text": "Adam M Ostrovsky and Joshua R Chen. 2020. TikTok and its role in COVID-19 information propagation. Journal of adolescent health 67, 5 (2020), 730.",
      "doi": ""
    },
    {
      "text": "Albert Park, Mike Conway, and Annie T. Chen. 2018. Examining thematic similarity, difference, and membership in three online mental health communities from reddit: A text mining and visualization approach. Computers in Human Behavior 78 (2018), 98–112. https://doi.org/10.1016/j.chb.2017.09.001",
      "doi": "10.1016/j.chb.2017.09.001"
    },
    {
      "text": "Robert Plant. 2004. Online communities. Technology in society 26, 1 (2004), 51–65.",
      "doi": ""
    },
    {
      "text": "Constance Elise Porter. 2004. A typology of virtual communities: A multi-disciplinary foundation for future research. Journal of computer-mediated communication 10, 1 (2004), JCMC1011.",
      "doi": ""
    },
    {
      "text": "Claudette Pretorius, Derek Chambers, David Coyle, 2019. Young people’s online help-seeking and mental health difficulties: Systematic narrative review. Journal of medical Internet research 21, 11 (2019), e13873.",
      "doi": ""
    },
    {
      "text": "Claudette Pretorius, Darragh McCashin, and David Coyle. 2022. Mental health professionals as influencers on TikTok and Instagram: What role do they play in mental health literacy and help-seeking?Internet Interventions(2022), 100591.",
      "doi": ""
    },
    {
      "text": "Dana Rotman and Jennifer Preece. 2010. The ’WeTube’ in YouTube – creating an online community through video sharing. International Journal of Web Based Communities 6, 3(2010), 317–333. https://doi.org/10.1504/IJWBC.2010.033755",
      "doi": "10.1504/IJWBC.2010.033755"
    },
    {
      "text": "Kitty Rusking. 2022. For Some Women With ADHD, TikTok Is the First Place They Felt Heard. Retrieved December 1, 2022 from https://time.com/6211695/adhd-tiktok-women/",
      "doi": ""
    },
    {
      "text": "Catherine Sanchez, Adrienne Grzenda, Andrea Varias, Alik S Widge, Linda L Carpenter, William M McDonald, Charles B Nemeroff, Ned H Kalin, Glenn Martin, Mauricio Tohen, 2020. Social media recruitment for mental health research: a systematic review. Comprehensive psychiatry 103 (2020), 152197.",
      "doi": ""
    },
    {
      "text": "Ellen Simpson, Andrew Hamann, and Bryan Semaan. 2022. How to Tame\" Your\" Algorithm: LGBTQ+ Users’ Domestication of TikTok. Proceedings of the ACM on Human-Computer Interaction 6, GROUP(2022), 1–27.",
      "doi": "10.1145/3492841"
    },
    {
      "text": "Ellen Simpson and Bryan Semaan. 2021. For You, or For\"You\"? Everyday LGBTQ+ Encounters with TikTok. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 252:1–252:34. https://doi.org/10.1145/3432951",
      "doi": "10.1145/3432951"
    },
    {
      "text": "Chris Stokel-Walker. 2020. TikTok’s global surge. New Scientist 245, 3273 (2020), 31.",
      "doi": ""
    },
    {
      "text": "Lyndall Strazdins and Dorothy H Broom. 2007. The mental health costs and benefits of giving social support.International Journal of Stress Management 14, 4 (2007), 370.",
      "doi": ""
    },
    {
      "text": "Victor Suarez-Lledo, Javier Alvarez-Galvez, 2021. Prevalence of health misinformation on social media: systematic review. Journal of medical Internet research 23, 1 (2021), e17187.",
      "doi": ""
    },
    {
      "text": "Na Sun, Patrick Pei-Luen Rau, and Liang Ma. 2014. Understanding lurkers in online communities: A literature review. Computers in Human Behavior 38 (2014), 110–117. https://doi.org/10.1016/j.chb.2014.05.022",
      "doi": "10.1016/j.chb.2014.05.022"
    },
    {
      "text": "Na Sun, Patrick Pei-Luen Rau, and Liang Ma. 2014. Understanding lurkers in online communities: A literature review. Computers in Human Behavior 38 (2014), 110–117.",
      "doi": "10.1016/j.chb.2014.05.022"
    },
    {
      "text": "Beth Teitell. 2022. Teens and young adults are self-diagnosing mental illness on TikTok. what could go wrong?Retrieved September 8, 2022 from https://www.bostonglobe.com/2022/11/15/metro/teens-young-adults-are-self-diagnosing-mental-illness-tiktok-what-could-go-wrong/",
      "doi": ""
    },
    {
      "text": "Emily A Vogels, Risa Gelles-Watnick, and Navid Massarat. 2022. Teens, social media and technology 2022. (2022). https://policycommons.net/artifacts/2644169/teens-social-media-and-technology-2022/3667002/",
      "doi": ""
    },
    {
      "text": "Jennifer P Wisdom, Kevin Bruce, Goal Auzeen Saedi, Teresa Weis, and Carla A Green. 2008. ‘Stealing me from myself’: Identity and recovery in personal accounts of mental illness. Australian & New Zealand Journal of Psychiatry 42, 6(2008), 489–495.",
      "doi": ""
    },
    {
      "text": "Lu Yan and Yong Tan. 2014. Feeling blue? Go online: an empirical study of social support among patients. Information Systems Research 25, 4 (2014), 690–709.",
      "doi": "10.1287/isre.2014.0538"
    },
    {
      "text": "Anthony Yeung, Enoch Ng, and Elia Abi-Jaoude. 2022. TikTok and Attention-Deficit/Hyperactivity Disorder: A Cross-Sectional Study of Social Media Content Quality. The Canadian Journal of Psychiatry(2022), 07067437221082854.",
      "doi": ""
    },
    {
      "text": "Marco Zenone, Nikki Ow, and Skye Barbic. 2021. TikTok and public health: a proposed research agenda. BMJ Global Health 6, 11 (2021), e007648. https://doi.org/10.1136/bmjgh-2021-007648",
      "doi": ""
    },
    {
      "text": "Zhongju Zhang. 2009. Feeling the sense of community in social networking usage. IEEE Transactions on Engineering Management 57, 2 (2009), 225–239.",
      "doi": ""
    },
    {
      "text": "SUE Ziebland and Sally Wyke. 2012. Health and illness in a connected world: how might sharing experiences on the internet affect people’s health?The Milbank Quarterly 90, 2 (2012), 219–249.",
      "doi": ""
    }
  ]
}