{
  "doi": "10.1145/3544548.3581184",
  "title": "I Need a Third Arm! Eliciting Body-based Interactions with a Wearable Robotic Arm",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Wearable robotic arms (WRA) open up a unique interaction space that closely integrates the user’s body with an embodied robotic collaborator. This space affords diverse interaction styles, including body movement, hand gestures, or gaze. Yet, it is so-far unexplored which commands are desirable from a user perspective. Contributing findings from an elicitation study (N=14), we provide a comprehensive set of interactions for basic robot control, navigation, object manipulation, and emergency situations, performed when hands are free or occupied. Our study provides insights into preferred body parts, input modalities, and the users’ underlying sources of inspiration. Comparing interaction styles between WRAs and off-body robots, we highlight how WRAs enable a range of interactions specific for on-body robots and how users use WRAs both as tools and as collaborators. We conclude by providing guidance on the design of ad-hoc interaction with WRAs informed by user behavior.",
  "authors": [
    {
      "name": "Marie Muehlhaus",
      "institution": "Saarland University, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660481775",
      "orcid": "0000-0002-5696-7259"
    },
    {
      "name": "Marion Koelle",
      "institution": "OFFIS - Institute for Information Technology, Germany",
      "img": "/do/10.1145/contrib-86158741357/rel-imgonly/marionkoelle_xs.jpg",
      "acmid": "86158741357",
      "orcid": "0000-0002-5931-3218"
    },
    {
      "name": "Artin Saberpour",
      "institution": "Saarland University, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778171",
      "orcid": "0000-0002-5915-5280"
    },
    {
      "name": "Jürgen Steimle",
      "institution": "Saarland University, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613099",
      "orcid": "0000-0003-3493-8745"
    }
  ],
  "references": [
    {
      "text": "Mohammed Al-Sada, Thomas Höglund, Mohamed Khamis, Jaryd Urbani, and Tatsuo Nakajima. 2019. Orochi: Investigating Requirements and Expectations for Multipurpose Daily Used Supernumerary Robotic Limbs. In Proceedings of the 10th Augmented Human International Conference 2019(AH ’19). Association for Computing Machinery, New York, NY, USA, Article 37, 9 pages. https://doi.org/10.1145/3311823.3311850",
      "doi": "10.1145/3311823.3311850"
    },
    {
      "text": "Aude Billard and Danica Kragic. 2019. Trends and Challenges in Robot Manipulation. Science 364, 6446 (2019), 1–8. https://doi.org/10.1126/science.aat8414",
      "doi": ""
    },
    {
      "text": "Patrik Björnfot and Victor Kaptelinin. 2017. Probing the Design Space of a Telepresence Robot Gesture Arm with Low Fidelity Prototypes. In 2017 IEEE International Conference on Human-Robot Interaction(HRI ’17). Association for Computing Machinery, New York, NY, USA, 352–360. https://doi.org/10.1145/2909824.3020223",
      "doi": "10.1145/2909824.3020223"
    },
    {
      "text": "Andrea Bonarini. 2020. Communication in Human-Robot Interaction. Current Robotics Reports 1, 4 (2020), 279–285.",
      "doi": ""
    },
    {
      "text": "Baldin Llorens Bonilla and Harry Asada. 2014. A Robot on the Shoulder: Coordinated Human-wearable Robot Control Using Coloured Petri Nets and Partial Least Squares Predictions. In 2014 IEEE International Conference on Robotics and Automation(ICRA ’14). IEEE, Hong Kong, China, 119–125. https://doi.org/10.1109/ICRA.2014.6906598",
      "doi": ""
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber Hands ‘Feel’ Touch That Eyes See. Nature 391, 6669 (1998), 756–756. https://doi.org/10.1038/35784",
      "doi": ""
    },
    {
      "text": "Clebeson Canuto, Eduardo Freire, Lucas Molina, Elyson Carvalho, and Sidney Givigi. 2022. Intuitiveness Level: Frustration-Based Methodology for Human–Robot Interaction Gesture Elicitation. IEEE Access 10(2022), 17145–17154. https://doi.org/10.1109/ACCESS.2022.3146838",
      "doi": ""
    },
    {
      "text": "Jessica Cauchard, Jane E, Kevin Zhai, and James Landay. 2015. Drone & Me: An Exploration into Natural Human-Drone Interaction. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 361–365. https://doi.org/10.1145/2750858.2805823",
      "doi": "10.1145/2750858.2805823"
    },
    {
      "text": "Liwei Chan, Yi-Ling Chen, Chi-Hao Hsieh, Rong-Hao Liang, and Bing-Yu Chen. 2015. CyclopsRing: Enabling Whole-Hand and Context-Aware Interactions Through a Fisheye Ring. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(UIST ’15). Association for Computing Machinery, New York, NY, USA, 549–556. https://doi.org/10.1145/2807442.2807450",
      "doi": "10.1145/2807442.2807450"
    },
    {
      "text": "Gordon Cheng, Emmanuel Dean-Leon, Florian Bergner, Julio Rogelio Guadarrama Olvera, Quentin Leboutet, and Philipp Mittendorfer. 2019. A Comprehensive Realization of Robot Skin: Sensors, Sensing, Control, and Applications. Proc. IEEE 107, 10 (2019), 2034–2051. https://doi.org/10.1109/JPROC.2019.2933348",
      "doi": ""
    },
    {
      "text": "Andrea Cherubini and David Navarro-Alarcon. 2021. Sensor-based Control for Collaborative Robots: Fundamentals, Challenges, and Opportunities. Frontiers in Neurorobotics 14 (2021). https://doi.org/10.3389/fnbot.2020.576846",
      "doi": ""
    },
    {
      "text": "Nazli Cila. 2022. Designing Human-Agent Collaborations: Commitment, Responsiveness, and Support. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 420, 18 pages. https://doi.org/10.1145/3491102.3517500",
      "doi": "10.1145/3491102.3517500"
    },
    {
      "text": "Phillip Daniel and Harry Asada. 2021. Crawling Support Using Wearable SuperLimbs: Human-Robot Synchronization and Metabolic Cost Assessment. In 2021 IEEE International Conference on Robotics and Automation(ICRA ’21). IEEE, 3205–3211. https://doi.org/10.1109/ICRA48506.2021.9561992",
      "doi": "10.1109/ICRA48506.2021.9561992"
    },
    {
      "text": "Andreea Danielescu and David Piorkowski. 2022. Iterative Design of Gestures During Elicitation: Understanding the Role of Increased Production. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3491102.3501962",
      "doi": "10.1145/3491102.3501962"
    },
    {
      "text": "Nicole Deterding and Mary Waters. 2021. Flexible Coding of In-depth Interviews: A Twenty-first-century Approach. Sociological Methods & Research 50, 2 (2021), 708–739. https://doi.org/10.1177/0049124118799377",
      "doi": ""
    },
    {
      "text": "Guillaume Gourmelen, Adrien Verhulst, Benjamin Navarro, Tomoya Sasaki, Ganesh Gowrishankar, and Masahiko Inami. 2019. Co-Limbs: An Intuitive Collaborative Control for Wearable Robotic Arms. In SIGGRAPH Asia 2019 Emerging Technologies(SA ’19). Association for Computing Machinery, New York, NY, USA, 9–10. https://doi.org/10.1145/3355049.3360526",
      "doi": "10.1145/3355049.3360526"
    },
    {
      "text": "G. Grunwald, G. Schreiber, A. Albu-Schaffer, and G. Hirzinger. 2003. Programming by Touch: The Different Way of Human-robot Interaction. IEEE Transactions on Industrial Electronics 50, 4 (2003), 659–666. https://doi.org/10.1109/TIE.2003.814759",
      "doi": ""
    },
    {
      "text": "Jacob Guggenheim, Rachel Hoffman, Hanjun Song, and Harry Asada. 2020. Leveraging the Human Operator in the Design and Control of Supernumerary Robotic Limbs. IEEE Robotics and Automation Letters 5, 2 (2020), 2177–2184. https://doi.org/10.1109/LRA.2020.2970948",
      "doi": ""
    },
    {
      "text": "Yves Guiard. 1987. Asymmetric Division of Labor in Human Skilled Bimanual Action: The Kinematic Chain as a Model. Journal of Motor Behavior 19, 4 (1987), 486–517. https://doi.org/10.1080/00222895.1987.10735426",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Jan Borchers, Susanne Boll, Astrid Rosenthal-von der Pütten, and Volker Wulf. 2020. Otherware: How to Best Interact with Autonomous Systems. Interactions 28, 1 (2020), 54–57. https://doi.org/10.1145/3436942",
      "doi": "10.1145/3436942"
    },
    {
      "text": "Julia Hertel, Sukran Karaosmanoglu, Susanne Schmidt, Julia Bräker, Martin Semmann, and Frank Steinicke. 2021. A Taxonomy of Interaction Techniques for Immersive Augmented Reality based on an Iterative Literature Review. In 2021 IEEE International Symposium on Mixed and Augmented Reality(ISMAR ’21). IEEE, 431–440. https://doi.org/10.1109/ISMAR52148.2021.00060",
      "doi": ""
    },
    {
      "text": "Eric Horvitz. 1999. Uncertainty, Action, and Interaction: In Pursuit of Mixed-Initiative Computing. IEEE Intelligent Systems 14, 5 (1999), 17–20.",
      "doi": ""
    },
    {
      "text": "Yuhan Hu, Sang-won Leigh, and Pattie Maes. 2017. Hand Development Kit: Soft Robotic Fingers as Prosthetic Augmentation of the Hand. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology(UIST ’17). Association for Computing Machinery, New York, NY, USA, 27–29. https://doi.org/10.1145/3131785.3131805",
      "doi": "10.1145/3131785.3131805"
    },
    {
      "text": "Da-Yuan Huang, Liwei Chan, Shuo Yang, Fan Wang, Rong-Hao Liang, De-Nian Yang, Yi-Ping Hung, and Bing-Yu Chen. 2016. DigitSpace: Designing Thumb-to-Fingers Touch Interfaces for One-Handed and Eyes-Free Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 1526–1537. https://doi.org/10.1145/2858036.2858483",
      "doi": "10.1145/2858036.2858483"
    },
    {
      "text": "Dong-Hyun Hwang, Kohei Aso, Ye Yuan, Kris Kitani, and Hideki Koike. 2020. MonoEye: Multimodal Human Motion Capture System Using A Single Ultra-Wide Fisheye Camera. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology(UIST ’20). Association for Computing Machinery, New York, NY, USA, 98–111. https://doi.org/10.1145/3379337.3415856",
      "doi": "10.1145/3379337.3415856"
    },
    {
      "text": "Stephen Jacobsen, E. Iversen, David Knutti, Richard Johnson, and Keith Biggers. 1986. Design of the Utah/M.I.T. Dextrous Hand. In 1986 IEEE International Conference on Robotics and Automation(ICRA ’86, Vol. 3). IEEE, 1520–1532. https://doi.org/10.1109/ROBOT.1986.1087395",
      "doi": ""
    },
    {
      "text": "Shu Jiang and Ronald Arkin. 2015. Mixed-Initiative Human-Robot Interaction: Definition, Taxonomy, and Survey. In 2015 IEEE International Conference on Systems, Man, and Cybernetics(SMC ’15). IEEE, 954–961. https://doi.org/10.1109/SMC.2015.174",
      "doi": "10.1109/SMC.2015.174"
    },
    {
      "text": "Sara Kiesler and Pamela Hinds. 2004. Introduction to this Special Issue on Human-Robot Interaction. Human–Computer Interaction 19, 1-2 (2004), 1–8.",
      "doi": ""
    },
    {
      "text": "Lawrence Kim, Daniel Drew, Veronika Domova, and Sean Follmer. 2020. User-Defined Swarm Robot Control. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376814",
      "doi": "10.1145/3313831.3376814"
    },
    {
      "text": "Udo Kuckartz and Stefan Rädiker. 2019. Collaborating in Teams. Springer, 253–265. https://doi.org/10.1007/978-3-030-15671-8_18",
      "doi": ""
    },
    {
      "text": "Peter Kyberd and Paul Chappell. 1994. The Southampton Hand: An Intelligent Myoelectric Prosthesis. Journal of Rehabilitation Research and Development 31, 4(1994), 326–334.",
      "doi": ""
    },
    {
      "text": "Sang-Su Lee, Sohyun Kim, Bopil Jin, Eunji Choi, Boa Kim, Xu Jia, Daeeop Kim, and Kun-pyo Lee. 2010. How Users Manipulate Deformable Displays as Input Devices. In Proceedings of the 2010 CHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, New York, NY, USA, 1647–1656. https://doi.org/10.1145/1753326.1753572",
      "doi": "10.1145/1753326.1753572"
    },
    {
      "text": "Sang-won Leigh and Pattie Maes. 2016. Body Integrated Programmable Joints Interface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 6053–6057. https://doi.org/10.1145/2858036.2858538",
      "doi": "10.1145/2858036.2858538"
    },
    {
      "text": "Baldin Llorens Bonilla, Federico Parietti, and Harry Asada. 2012. Demonstration-based Control of Supernumerary Robotic Limbs. In 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems(IROS ’12). IEEE, 3936–3942. https://doi.org/10.1109/IROS.2012.6386055",
      "doi": ""
    },
    {
      "text": "Azumi Maekawa, Shota Takahashi, MHD Yamen Saraiji, Sohei Wakisaka, Hiroyasu Iwata, and Masahiko Inami. 2019. Naviarm: Augmenting the Learning of Motor Skills Using a Backpack-Type Robotic Arm System. In Proceedings of the 10th Augmented Human International Conference 2019(AH ’19). Association for Computing Machinery, New York, NY, USA, Article 38, 8 pages. https://doi.org/10.1145/3311823.3311849",
      "doi": "10.1145/3311823.3311849"
    },
    {
      "text": "Karthik Mahadevan, Mauricio Sousa, Anthony Tang, and Tovi Grossman. 2021. “Grip-That-There”: An Investigation of Explicit and Implicit Task Allocation Techniques for Human-Robot Collaboration. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 215, 14 pages. https://doi.org/10.1145/3411764.3445355",
      "doi": "10.1145/3411764.3445355"
    },
    {
      "text": "Angelo Maravita, Charles Spence, Steffan Kennett, and Jon Driver. 2002. Tool-use Changes Multimodal Spatial Interactions Between Vision and Touch in Normal Humans. Cognition 83, 2 (2002), B25–B34. https://doi.org/10.1016/S0010-0277(02)00003-3",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris. 2012. Web on the Wall: Insights from a Multimodal Interaction Elicitation Study. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces(Cambridge, Massachusetts, USA) (ITS ’12). Association for Computing Machinery, New York, NY, USA, 95–104. https://doi.org/10.1145/2396636.2396651",
      "doi": "10.1145/2396636.2396651"
    },
    {
      "text": "Florian Floyd Mueller, Pedro Lopes, Paul Strohmeier, Wendy Ju, Caitlyn Seim, Martin Weigel, Suranga Nanayakkara, Marianna Obrist, Zhuying Li, Joseph Delfa, Jun Nishida, Elizabeth Gerber, Dag Svanaes, Jonathan Grudin, Stefan Greuter, Kai Kunze, Thomas Erickson, Steven Greenspan, Masahiko Inami, Joe Marshall, Harald Reiterer, Katrin Wolf, Jochen Meyer, Thecla Schiphorst, Dakuo Wang, and Pattie Maes. 2020. Next Steps for Human-Computer Integration. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376242",
      "doi": "10.1145/3313831.3376242"
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, and Hiroshi Ishii. 2015. LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology(UIST ’15). Association for Computing Machinery, New York, NY, USA, 333–339. https://doi.org/10.1145/2807442.2807452",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Michael Nebeling. 2017. XDBrowser 2.0: Semi-Automatic Generation of Cross-Device Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4574–4584. https://doi.org/10.1145/3025453.3025547",
      "doi": "10.1145/3025453.3025547"
    },
    {
      "text": "Roger Newport, Rachel Pearce, and Catherine Preston. 2010. Fake Hands in Action: Embodiment and Control of Supernumerary Limbs. Experimental Brain Research 204, 3 (2010), 385–395.",
      "doi": ""
    },
    {
      "text": "Chloe Ng and Nicolai Marquardt. 2022. Eliciting User-Defined Touch and Mid-Air Gestures for Co-Located Mobile Gaming. Proceedings of the ACM on Human-Computer Interaction 6, ISS, Article 569 (2022), 25 pages. https://doi.org/10.1145/3567722",
      "doi": "10.1145/3567722"
    },
    {
      "text": "Pham Nguyen, Imran Mohd, Curtis Sparks, Francisco Arellano, Wenlong Zhang, and Panagiotis Polygerinos. 2019. Fabric Soft Poly-Limbs for Physical Assistance of Daily Living Tasks. In 2019 IEEE International Conference on Robotics and Automation(ICRA ’19). IEEE, 8429–8435. https://doi.org/10.1109/ICRA.2019.8794294",
      "doi": "10.1109/ICRA.2019.8794294"
    },
    {
      "text": "Pham Nguyen, Curtis Sparks, Sai Nuthi, Nicholas Vale, and Panagiotis Polygerinos. 2019. Soft Poly-Limbs: Toward a New Paradigm of Mobile Manipulation for Daily Living Tasks. Soft robotics 6, 1 (2019), 38–53. https://doi.org/10.1089/soro.2018.0065",
      "doi": ""
    },
    {
      "text": "Aditya Shekhar Nittala, Arshad Khan, Klaus Kruttwig, Tobias Kraus, and Jürgen Steimle. 2020. PhysioSkin: Rapid Fabrication of Skin-Conformal Physiological Interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376366",
      "doi": "10.1145/3313831.3376366"
    },
    {
      "text": "Mohammad Obaid, Felix Kistler, Gabriel Kasparavičiūt, Asim Evren Yantaç, and Morten Fjeld. 2016. How Would You Gesture Navigate a Drone? A User-Centered Approach to Control a Drone. In Proceedings of the 20th International Academic Mindtrek Conference(AcademicMindtrek ’16). Association for Computing Machinery, New York, NY, USA, 113–121. https://doi.org/10.1145/2994310.2994348",
      "doi": "10.1145/2994310.2994348"
    },
    {
      "text": "Federico Parietti, Kameron Chan, and Harry Asada. 2014. Bracing the Human Body with Supernumerary Robotic Limbs for Physical Assistance and Load Reduction. In 2014 IEEE International Conference on Robotics and Automation(ICRA ’14). IEEE, 141–148. https://doi.org/10.1109/ICRA.2014.6906601",
      "doi": ""
    },
    {
      "text": "Federico Parietti, Kameron Chan, Banks Hunter, and Harry Asada. 2015. Design and Control of Supernumerary Robotic Limbs for Balance Augmentation. In 2015 IEEE International Conference on Robotics and Automation(ICRA ’15). IEEE, 5010–5017. https://doi.org/10.1109/ICRA.2015.7139896",
      "doi": ""
    },
    {
      "text": "Christian Penaloza, David Hernandez-Carmona, and Shuichi Nishio. 2018. Towards Intelligent Brain-Controlled Body Augmentation Robotic Limbs. In 2018 IEEE International Conference on Systems, Man, and Cybernetics(SMC ’18). IEEE, 1011–1015. https://doi.org/10.1109/SMC.2018.00180",
      "doi": "10.1109/SMC.2018.00180"
    },
    {
      "text": "Ekaterina Peshkova and Martin Hitz. 2017. Exploring User-defined Gestures to Control a Group of Four UAVs. In 2017 IEEE International Symposium on Robot and Human Interactive Communication(RO-MAN ’17). IEEE, 169–174. https://doi.org/10.1109/ROMAN.2017.8172297",
      "doi": "10.1109/ROMAN.2017.8172297"
    },
    {
      "text": "Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013. User-Defined Gestures for Augmented Reality. In Extended Abstracts of the 2013 CHI Conference on Human Factors in Computing System(CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 955–960. https://doi.org/10.1145/2468356.2468527",
      "doi": "10.1145/2468356.2468527"
    },
    {
      "text": "Alan Poston. 2000. Human Engineering Design Data Digest. Washington, DC: Department of Defense Human Factors Engineering Technical Advisory Group (2000), 61–75.",
      "doi": ""
    },
    {
      "text": "Domenico Prattichizzo, Maria Pozzi, Tommaso Lisini Baldi, Monica Malvezzi, Irfan Hussain, Simone Rossi, and Gionata Salvietti. 2021. Human Augmentation by Wearable Supernumerary Robotic Limbs: Review and Perspectives. Progress in Biomedical Engineering 3, 4 (2021), 1–23. https://doi.org/10.1088/2516-1091/ac2294",
      "doi": ""
    },
    {
      "text": "Jaime Ruiz, Yang Li, and Edward Lank. 2011. User-Defined Motion Gestures for Mobile Interaction. In Proceedings of the 2011 CHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 197–206. https://doi.org/10.1145/1978942.1978971",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "MHD Yamen Saraiji, Tomoya Sasaki, Kai Kunze, Kouta Minamizawa, and Masahiko Inami. 2018. MetaArms: Body Remapping Using Feet-Controlled Artificial Arms. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(UIST ’18). Association for Computing Machinery, New York, NY, USA, 65–74. https://doi.org/10.1145/3242587.3242665",
      "doi": "10.1145/3242587.3242665"
    },
    {
      "text": "Tomoya Sasaki, MHD Yamen Saraiji, Charith Lasantha Fernando, Kouta Minamizawa, and Masahiko Inami. 2017. MetaLimbs: Multiple Arms Interaction Metamorphism. In ACM SIGGRAPH 2017 Emerging Technologies(SIGGRAPH ’17). Association for Computing Machinery, New York, NY, USA, Article 16, 2 pages. https://doi.org/10.1145/3084822.3084837",
      "doi": "10.1145/3084822.3084837"
    },
    {
      "text": "Sebastian Schröer, Ingo Killmann, Barbara Frank, Martin Völker, Lukas Fiederer, Tonio Ball, and Wolfram Burgard. 2015. An Autonomous Robotic Assistant for Drinking. In 2015 IEEE International Conference on Robotics and Automation(ICRA ’15). IEEE, 6482–6487. https://doi.org/10.1109/ICRA.2015.7140110",
      "doi": ""
    },
    {
      "text": "Matthias Seuter, Eduardo Rodriguez Macrillante, Gernot Bauer, and Christian Kray. 2018. Running with Drones: Desired Services and Control Gestures. In Proceedings of the 30th Australian Conference on Computer-Human Interaction(OzCHI ’18). Association for Computing Machinery, New York, NY, USA, 384–395. https://doi.org/10.1145/3292147.3292156",
      "doi": "10.1145/3292147.3292156"
    },
    {
      "text": "Ali Shafti, Pavel Orlov, and Aldo Faisal. 2019. Gaze-based, Context-aware Robotic System for Assisted Reaching and Grasping. In 2019 IEEE International Conference on Robotics and Automation(ICRA ’19). IEEE, 863–869. https://doi.org/10.1109/ICRA.2019.8793804",
      "doi": "10.1109/ICRA.2019.8793804"
    },
    {
      "text": "Thomas Sheridan. 2016. Human–Robot Interaction: Status and Challenges. Human Factors 58, 4 (2016), 525–532.",
      "doi": ""
    },
    {
      "text": "Hideki Shimobayashi, Tomoya Sasaki, Arata Horie, Riku Arakawa, Zendai Kashino, and Masahiko Inami. 2021. Independent Control of Supernumerary Appendages Exploiting Upper Limb Redundancy. In Augmented Humans Conference 2021(AHs’21). Association for Computing Machinery, New York, NY, USA, 19––30. https://doi.org/10.1145/3458709.3458980",
      "doi": "10.1145/3458709.3458980"
    },
    {
      "text": "Ben Shneiderman. 2020. Design Lessons From AI’s Two Grand Goals: Human Emulation and Useful Applications. IEEE Transactions on Technology and Society 1, 2 (2020), 73–82. https://doi.org/10.1109/TTS.2020.2992669",
      "doi": ""
    },
    {
      "text": "Danny Spampinato, Hannah Block, and Pablo Celnik. 2017. Cerebellar–M1 Connectivity Changes Associated with Motor Learning are Somatotopic Specific. Journal of Neuroscience 37, 9 (2017), 2377–2386. https://doi.org/10.1523/JNEUROSCI.2511-16.2017",
      "doi": ""
    },
    {
      "text": "Christoph Stamann and Markus Janssen. 2019. Becoming Able to Work Together as a Central Challenge for a Successful Joint Practice—Experiences From a Qualitative Content Analysis Interpretation Group and Suggestions for Arranging Interpretation Group Sessions. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research 20, 3(2019), 1–14. https://doi.org/10.17169/fqs-20.3.3379",
      "doi": ""
    },
    {
      "text": "Adriana Tapus, Cristian Tapus, and Maja Matarić. 2010. Long Term Learning and Online Robot Behavior Adaptation for Individuals with Physical and Cognitive Impairments. In Field and Service Robotics(FSR ’09). Springer, 389–398. https://doi.org/10.1007/978-3-642-13408-1_35",
      "doi": ""
    },
    {
      "text": "Mahmoud Tavakoli, Carlo Benussi, Pedro Alhais Lopes, Luis Bica Osorio, and Anibal de Almeida. 2018. Robust Hand Gesture Recognition with a Double Channel Surface EMG Wearable Armband and SVM Classifier. Biomedical Signal Processing and Control 46 (2018), 121–130. https://doi.org/10.1016/j.bspc.2018.07.010",
      "doi": ""
    },
    {
      "text": "Marc Teyssier, Brice Parilusyan, Anne Roudaut, and Jürgen Steimle. 2021. Human-Like Artificial Skin Sensor for Physical Human-Robot Interaction. In 2021 IEEE International Conference on Robotics and Automation(ICRA ’21). IEEE, 3626–3633. https://doi.org/10.1109/ICRA48506.2021.9561152",
      "doi": "10.1109/ICRA48506.2021.9561152"
    },
    {
      "text": "Anthony Tran, Sowmya Somanath, and Ehud Sharlin. 2018. Supernumerary Arms for Gestural Communication. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing System(CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188683",
      "doi": "10.1145/3170427.3188683"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. In Proceedings of the 2015 CHI Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 1325–1334. https://doi.org/10.1145/2702123.2702223",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Vighnesh Vatsal and Guy Hoffman. 2017. Wearing Your Arm on Your Sleeve: Studying Usage Contexts for a Wearable Robotic Forearm. In 2017 IEEE International Symposium on Robot and Human Interactive Communication(RO-MAN ’17). IEEE, 974–980. https://doi.org/10.1109/ROMAN.2017.8172421",
      "doi": "10.1109/ROMAN.2017.8172421"
    },
    {
      "text": "Vighnesh Vatsal and Guy Hoffman. 2018. Design and Analysis of a Wearable Robotic Forearm. In 2018 IEEE International Conference on Robotics and Automation(ICRA ’18). IEEE, 5489–5496. https://doi.org/10.1109/ICRA.2018.8461212",
      "doi": "10.1109/ICRA.2018.8461212"
    },
    {
      "text": "Catherine Véronneau, Jeff Denis, Louis-Philippe Lebel, Marc Denninger, Jean-Sébastien Plante, and Alexandre Girard. 2019. A Lightweight Force-Controllable Wearable Arm Based on Magnetorheological-Hydrostatic Actuators. In 2019 IEEE International Conference on Robotics and Automation(ICRA ’19). IEEE, 4018–4024. https://doi.org/10.1109/ICRA.2019.8793978",
      "doi": "10.1109/ICRA.2019.8793978"
    },
    {
      "text": "Stefan Waldherr, Sebastian Thrun, Roseli Romero, and Dimitris Margaritis. 1998. Template-Based Recognition of Pose and Motion Gestures on a Mobile Robot. In Proceedings of the Fifteenth National/Tenth Conference on Artificial Intelligence/Innovative Applications of Artificial Intelligence(AAAI ’98/IAAI ’98). American Association for Artificial Intelligence, 977–982.",
      "doi": ""
    },
    {
      "text": "Martin Weigel, Vikram Mehta, and Jürgen Steimle. 2014. More than Touch: Understanding How People Use Skin as an Input Surface for Mobile Computing. In Proceedings of the 2014 CHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 179–188. https://doi.org/10.1145/2556288.2557239",
      "doi": "10.1145/2556288.2557239"
    },
    {
      "text": "Gerard Wilkinson, Ahmed Kharrufa, Jonathan Hook, Bradley Pursglove, Gavin Wood, Hendrik Haeuser, Nils Hammerla, Steve Hodges, and Patrick Olivier. 2016. Expressy: Using a Wrist-Worn Inertial Measurement Unit to Add Expressiveness to Touch-Based Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 2832–2844. https://doi.org/10.1145/2858036.2858223",
      "doi": "10.1145/2858036.2858223"
    },
    {
      "text": "Jacob Wobbrock, Meredith Ringel Morris, and Andrew Wilson. 2009. User-Defined Gestures for Surface Computing. In Proceedings of the 2009 CHI Conference on Human Factors in Computing Systems(CHI ’09). Association for Computing Machinery, New York, NY, USA, 1083–1092. https://doi.org/10.1145/1518701.1518866",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Haoran Xie, Zeyu Ding, Shogo Yoshida, Toby Chong, Takuma Torii, and Tsukasa Fukusato. 2022. Augmenting Human with Compact Supernumerary Robotic Limbs. In Proceedings 13th Augmented Human International Conference 2022(AH ’22). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3532525.3532531",
      "doi": "10.1145/3532525.3532531"
    },
    {
      "text": "Cuichao Xu, Yueyue Liu, and Zhijun Li. 2019. Biomechatronic Design of a Supernumerary Robotic Limbs for Industrial Assembly. In 2019 IEEE International Conference on Advanced Robotics and Mechatronics(ICARM ’19). IEEE, 553–558. https://doi.org/10.1109/ICARM.2019.8833774",
      "doi": ""
    },
    {
      "text": "Hui-Shyong Yeo, Juyoung Lee, Hyung-il Kim, Aakar Gupta, Andrea Bianchi, Daniel Vogel, Hideki Koike, Woontack Woo, and Aaron Quigley. 2019. WRIST: Watch-Ring Interaction and Sensing Technique for Wrist Gestures and Macro-Micro Pointing. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 19, 15 pages. https://doi.org/10.1145/3338286.3340130",
      "doi": "10.1145/3338286.3340130"
    }
  ]
}