{
  "doi": "10.1145/3544548.3581488",
  "title": "Suspended Circles: Soma Designing a Musical Instrument",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "We present a soma design process of a digital musical instrument grounded in the designer’s first-person perspective of practicing Dalcroze eurhythmics, a pedagogical approach to learning music through movement. Our goal is to design an instrument that invites musicians to experience music as movement. The designer engaged in the soma design process, by first sensitising her body through Dalcroze training. Subsequently, she articulated her bodily experiences into experiential design qualities that guided the making of the instrument. The process resulted in the design of a large suspended mobile played by touching it with bare skin. We shared our instrument with 7 professional musicians and observed how it inspires a variety of approaches to musical meaning-making, ranging from exploring sound, to choreographing the body. Finally, we discuss how engaging with Dalcroze eurhythmics can be generative to the design of music–movement interaction.",
  "tags": [
    "DMIs",
    "Music–movement interaction",
    "Dalcroze eurhythmics",
    "first-person perspectives",
    "soma design"
  ],
  "authors": [
    {
      "name": "Tove Grimstad Bang",
      "institution": "LISN, Université Paris-Saclay, CNRS, Inria, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781482",
      "orcid": "0000-0002-0311-2986"
    },
    {
      "name": "Sarah Fdili Alaoui",
      "institution": "LISN, Université Paris-Saclay, CNRS, Inria, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656800",
      "orcid": "0000-0003-1775-213X"
    }
  ],
  "references": [
    {
      "text": "Sarah Fdili Alaoui, Baptiste Caramiaux, Marcos Serrano, and Frédéric Bevilacqua. 2012. Movement Qualities as Interaction Modality. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 761–769. https://doi.org/10.1145/2317956.2318071",
      "doi": "10.1145/2317956.2318071"
    },
    {
      "text": "Edgar Berdahl, Spencer Salazar, and Myles Borins. 2013. Embedded Networking And Hardware-Accelerated Graphics With Satellite Ccrma. In Proceedings of the International Conference on New Interfaces for Musical Expression. Daejeon, Republic of Korea, 325–330. https://doi.org/10.5281/ZENODO.1178476 Publisher: Zenodo.",
      "doi": ""
    },
    {
      "text": "Francesco Bigoni and Cumhur Erkut. 2020. DogDog: Soma-Based Interface Design for an Improvising Musician. In Proceedings of the 7th International Conference on Movement and Computing (Jersey City/Virtual, NJ, USA) (MOCO ’20). Association for Computing Machinery, New York, NY, USA, Article 23, 4 pages. https://doi.org/10.1145/3401956.3404242",
      "doi": "10.1145/3401956.3404242"
    },
    {
      "text": "Maros Suran Bomba and Palle Dahlstedt. 2019. Somacoustics: Interactive Body-as-Instrument. In Proceedings of the International Conference on New Interfaces for Musical Expression, Marcelo Queiroz and Anna Xambó Sedó (Eds.). UFRGS, Porto Alegre, Brazil, 95–100. https://doi.org/10.5281/zenodo.3672880",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Claude Cadoz and Marcelo Mortensen Wanderley. 2000. Gesture - Music. In Trends in Gestural Control of Music, Ircam-Centre Pompidou Marcelo Wanderley et Marc Battier (Ed.). https://hal.archives-ouvertes.fr/hal-01105543 cote interne IRCAM: Cadoz00a.",
      "doi": ""
    },
    {
      "text": "Baptiste Caramiaux, Alessandro Altavilla, Scott G. Pobiner, and Atau Tanaka. 2015. Form Follows Sound: Designing Interactions from Sonic Memories. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3943–3952. https://doi.org/10.1145/2702123.2702515",
      "doi": "10.1145/2702123.2702515"
    },
    {
      "text": "Doga Cavdir. 2021. Movement-based Music Making: An Aesthetics-based Evaluation. In Creativity and Cognition. ACM, Virtual Event Italy, 1–5. https://doi.org/10.1145/3450741.3467461",
      "doi": "10.1145/3450741.3467461"
    },
    {
      "text": "Kelsey Cotton, Pedro Sanches, Vasiliki Tsaknaki, and Pavel Karpashevich. 2021. The Body Electric: A NIME designed through and with the somatic experience of singing. NIME 2021. https://doi.org/10.21428/92fbeb44.ec9f8fdd https://nime.pubpub.org/pub/ntm5kbux.",
      "doi": ""
    },
    {
      "text": "Marco Donnarumma. 2012. Music for Flesh II: informing interactive music performance with the viscerality of the body system. In Proceedings of the International Conference on New Interfaces for Musical Expression. University of Michigan, Ann Arbor, Michigan. https://doi.org/10.5281/zenodo.1178245",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the action is : the foundations of embodied interaction.",
      "doi": ""
    },
    {
      "text": "Sarah Fdili Alaoui. 2019. Making an Interactive Dance Piece: Tensions in Integrating Technology in Art. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego CA USA, 1195–1208. https://doi.org/10.1145/3322276.3322289",
      "doi": "10.1145/3322276.3322289"
    },
    {
      "text": "Sarah Fdili Alaoui, Jules Françoise, Thecla Schiphorst, Karen Studd, and Frederic Bevilacqua. 2017. Seeing, Sensing and Recognizing Laban Movement Qualities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4009–4020. https://doi.org/10.1145/3025453.3025530",
      "doi": "10.1145/3025453.3025530"
    },
    {
      "text": "Sarah Fdili Alaoui, Thecla Schiphorst, Shannon Cuykendall, Kristin Carlson, Karen Studd, and Karen Bradley. 2015. Strategies for Embodied Design: The Value and Challenges of Observing Movement. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (Glasgow, United Kingdom). Association for Computing Machinery, New York, NY, USA, 121–130. https://doi.org/10.1145/2757226.2757238",
      "doi": "10.1145/2757226.2757238"
    },
    {
      "text": "IRCAM Forum. 2021. MuBu. https://forum.ircam.fr/projects/detail/mubu/",
      "doi": ""
    },
    {
      "text": "Jules Françoise, Yves Candau, Sarah Fdili Alaoui, and Thecla Schiphorst. 2017. Designing for Kinesthetic Awareness: Revealing User Experiences through Second-Person Inquiry. Association for Computing Machinery, New York, NY, USA, 5171–5183. https://doi.org/10.1145/3025453.3025714",
      "doi": "10.1145/3025453.3025714"
    },
    {
      "text": "Elisa Giaccardi and Elvin Karana. 2015. Foundations of Materials Experience: An Approach for HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2447–2456. https://doi.org/10.1145/2702123.2702337",
      "doi": "10.1145/2702123.2702337"
    },
    {
      "text": "Rolf Inge Godøy and Marc Leman. 2010. Musical gestures: Sound, movement, and meaning. Routledge.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Steve Benford, Paul Tennent, Vasiliki Tsaknaki, Miquel Alfaras, Juan Martinez Avila, Christine Li, Joseph Marshall, Claudia Daudén Roquet, Pedro Sanches, Anna Ståhl, Muhammad Umair, Charles Windlin, and Feng Zhou. 2021. Unpacking Non-Dualistic Design: The Soma Design Case. ACM Trans. Comput.-Hum. Interact. 28, 6, Article 40 (nov 2021), 36 pages. https://doi.org/10.1145/3462448",
      "doi": "10.1145/3462448"
    },
    {
      "text": "Eva Hornecker, Paul Marshall, and Jörn Hurtienne. 2017. Locating theories of embodiment along three axes: 1st–3d person, body-context, practice-cognition. In Proceedings of the Workshop Position Paper for CHI 2017 Workshop on Soma-Based Design Theory, Denver, CO, USA. 6–11.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. MIT Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian Müller, Marianne Petersen, Thecla Schiphorst, Elena Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing First-Person Perspectives in Soma-Based Design. Informatics (Basel) 5, 1 (2018), 8.",
      "doi": ""
    },
    {
      "text": "Alexander Refsum Jensenius. 2007. Action-sound : developing methods and tools to study music-related body movement. Ph.D. Dissertation. University of Oslo. https://www.duo.uio.no/handle/10852/27149",
      "doi": ""
    },
    {
      "text": "Alexander Refsum Jensenius. 2017. Sonic Microinteraction in “the Air”. In The Routledge Companion to Embodied Music Interaction (1 ed.). Routledge, 429–437.",
      "doi": ""
    },
    {
      "text": "Alexander Refsum Jensenius. 2022. Sound actions: conceptualizing musical instruments. The MIT Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Marja-Leena Juntunen and Heidi Westerlund. 2001. Digging Dalcroze, or, Dissolving the Mind‐Body Dualism: Philosophical and practical remarks on the musical body in action. Music Education Research 3, 2 (2001), 203–214. https://doi.org/10.1080/14613800120089250 arXiv:https://doi.org/10.1080/14613800120089250",
      "doi": ""
    },
    {
      "text": "David Kirsh. 2013. Embodied Cognition and the Magical Future of Interaction Design. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 3 (apr 2013), 30 pages. https://doi.org/10.1145/2442106.2442109",
      "doi": "10.1145/2442106.2442109"
    },
    {
      "text": "B. Laczkó and A. R. Jensenius. 2021. Reflections on the Development of the Musical Gestures Toolbox for Python. In Proceedings of the Nordic Sound and Music Computing Conference.",
      "doi": ""
    },
    {
      "text": "Marc Leman. 2007. Embodied Music Cognition and Mediation Technology. MIT press. https://doi.org/10.7551/mitpress/7476.001.0001",
      "doi": ""
    },
    {
      "text": "Micheline Lesaffre, Pieter-Jan Maes, and Marc Leman. 2017. The Routledge companion to embodied music interaction. Routledge, Chapter Introduction, 1.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and Making Strange: An Embodied Approach to Movement-Based Interaction Design. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 7 (April 2013), 25 pages. https://doi.org/10.1145/2442106.2442113",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Thor Magnusson. 2009. Of Epistemic Tools: musical instruments as cognitive extensions. Organised Sound 14, 2 (2009), 168–176. https://doi.org/10.1017/S1355771809000272",
      "doi": "10.1017/S1355771809000272"
    },
    {
      "text": "Adnan Marquez-Borbon and Juan Pablo Martinez-Avila. 2018. The Problem Of Dmi Adoption And Longevity: Envisioning A Nime Performance Pedagogy. In Proceedings of the International Conference on New Interfaces for Musical Expression. Blacksburg, Virginia, USA, 190–195. https://doi.org/10.5281/ZENODO.1302541 Publisher: Zenodo.",
      "doi": ""
    },
    {
      "text": "Juan P Martinez Avila, Vasiliki Tsaknaki, Pavel Karpashevich, Charles Windlin, Niklas Valenti, Kristina Höök, Andrew McPherson, and Steve Benford. 2020. Soma Design for NIME. In Proceedings of the International Conference on New Interfaces for Musical Expression, Romain Michon and Franziska Schroeder (Eds.). Birmingham City University, Birmingham, UK, 489–494. https://www.nime.org/proceedings/2020/nime2020_paper93.pdf",
      "doi": ""
    },
    {
      "text": "Fred Everett Maus. 2010. Somaesthetics of Music.Action, criticism, and theory for music education 9, 1 (2010), 9–25.",
      "doi": ""
    },
    {
      "text": "Andrew P McPherson 2019. Embodied Cognition in Performers of Large Acoustic Instruments as a Method of Designing New Large Digital Musical Instruments. International Symposium on Computer Music Multidisciplinary Research.",
      "doi": ""
    },
    {
      "text": "Maurice Merleau-Ponty. 1962. Phenomenology of perception. Routledge, London ; New York.",
      "doi": ""
    },
    {
      "text": "Lia Mice and Andrew P. McPherson. 2022. Super Size Me: Interface Size, Identity and Embodiment in Digital Musical Instrument Design. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 221, 15 pages. https://doi.org/10.1145/3491102.3517626",
      "doi": "10.1145/3491102.3517626"
    },
    {
      "text": "Fabio Morreale and Andrew McPherson. 2017. Design For Longevity: Ongoing Use Of Instruments From Nime 2010-14. In Proceedings of the International Conference on New Interfaces for Musical Expression. Copenhagen, Denmark, 192–197. https://doi.org/10.5281/ZENODO.1176218 Publisher: Zenodo.",
      "doi": ""
    },
    {
      "text": "Fabio Morreale, Andrew P. McPherson, and Marcelo Wanderley. 2018. NIME Identity from the Performer’s Perspective. In Proceedings of the International Conference on New Interfaces for Musical Expression, Thomas Martin Luke Dahl, Douglas Bowman (Ed.). Virginia Tech, Blacksburg, Virginia, USA, 168–173. https://doi.org/10.5281/zenodo.1302533",
      "doi": ""
    },
    {
      "text": "Luc Nijs. 2017. The merging of musician and musical instrument: Incorporation, presence, and levels of embodiment. In The Routledge companion to embodied music interaction. Routledge, 49–57.",
      "doi": ""
    },
    {
      "text": "Luc Nijs. 2018. Dalcroze meets technology: integrating music, movement and visuals with the Music Paint Machine. Music Education Research 20, 2 (2018), 163–183.",
      "doi": ""
    },
    {
      "text": "Eva Nivbrant Wedin. 2015. Playing Music With The Whole Body - eurhythmics and motor development. Gehrmans Musikförlag AB. 13–15 pages.",
      "doi": ""
    },
    {
      "text": "Charlotte Nordmoen, Jack Armitage, Fabio Morreale, Rebecca Stewart, and Andrew McPherson. 2019. Making Sense of Sensors: Discovery Through Craft Practice With an Open-Ended Sensor Material. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 135–146. https://doi.org/10.1145/3322276.3322368",
      "doi": "10.1145/3322276.3322368"
    },
    {
      "text": "Walter J Ong. 2013. Orality and literacy. Routledge.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. [n.d.]. The Encyclopedia of Human-Computer Interaction (2 ed.). Chapter Somaesthetics.",
      "doi": ""
    },
    {
      "text": "Diego Silang Maranan, Sarah Fdili Alaoui, Thecla Schiphorst, Philippe Pasquier, Pattarawut Subyen, and Lyn Bartram. 2014. Designing for Movement: Evaluating Computational Models Using LMA Effort Qualities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 991–1000. https://doi.org/10.1145/2556288.2557251",
      "doi": "10.1145/2556288.2557251"
    },
    {
      "text": "Karlheinz Stockhausen. Premiered in 1981. Donnerstag aus Licht.",
      "doi": ""
    },
    {
      "text": "Hope R Strayer. 2013. From neumes to notes: The evolution of music notation. (2013).",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Vasiliki Tsaknaki, and Madeline Balaam. 2021. Validity and Rigour in Soma Design-Sketching with the Soma. ACM Transactions on Computer-Human Interaction 28, 6 (Dec. 2021), 1–36. https://doi.org/10.1145/3470132",
      "doi": "10.1145/3470132"
    },
    {
      "text": "John Sullivan and Marcelo M. Wanderley. 2018. Stability, Reliability, Compatibility: Reviewing 40 Years Of Dmi Design. Limassol, Cyprus. https://doi.org/10.5281/ZENODO.1422595 ISBN: 9789963697304 Publisher: Zenodo.",
      "doi": ""
    },
    {
      "text": "Dag Svanæs and Louise Barkhuus. 2020. The Designer’s Body as Resource in Design: Exploring Combinations of Point-of-View and Tense. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376430",
      "doi": "10.1145/3313831.3376430"
    },
    {
      "text": "Danielle Wilde, Anna Vallgårda, and Oscar Tomico. 2017. Embodied Design Ideation Methods: Analysing the Power of Estrangement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5158–5170. https://doi.org/10.1145/3025453.3025873",
      "doi": "10.1145/3025453.3025873"
    },
    {
      "text": "Craig Wright. [n.d.]. Quantification in Medieval Paris and How It Changed Western Music. City, Chant, and the Topography of Early Music: In Honor of Thomas Forrest Kelly ([n. d.]), 3–26.",
      "doi": ""
    },
    {
      "text": "Xiao Xiao, Pablo Puentes, Edith Ackermann, and Hiroshi Ishii. 2016. Andantino: Teaching Children Piano with Projected Animated Characters. In Proceedings of the The 15th International Conference on Interaction Design and Children(Manchester, United Kingdom) (IDC ’16). Association for Computing Machinery, New York, NY, USA, 37–45. https://doi.org/10.1145/2930674.2930689",
      "doi": "10.1145/2930674.2930689"
    },
    {
      "text": "Jianing Zheng, Nick Bryan-Kinns, and Andrew P. McPherson. 2022. Material Matters: Exploring Materiality in Digital Musical Instruments Design. In Designing Interactive Systems Conference. ACM, Virtual Event Australia, 976–986. https://doi.org/10.1145/3532106.3533523",
      "doi": "10.1145/3532106.3533523"
    }
  ]
}