{
  "doi": "10.1145/3544548.3580987",
  "title": "Deep Learning Super-Resolution Network Facilitating Fiducial Tangibles on Capacitive Touchscreens",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Over the last few years, we have seen many approaches using tangibles to address the limited expressiveness of touchscreens. Mainstream tangible detection uses fiducial markers embedded in the tangibles. However, the coarse sensor size of capacitive touchscreens makes tangibles bulky, limiting their usefulness. We propose a novel deep-learning super-resolution network to facilitate fiducial tangibles on capacitive touchscreens better. In detail, our network super-resolves the markers enabling off-the-shelf detection algorithms to track tangibles reliably. Our network generalizes to unseen marker sets, such as AprilTag, ArUco, and ARToolKit. Therefore, we are not limited to a fixed number of distinguishable objects and do not require data collection and network training for new fiducial markers. With extensive evaluation, including real-world users and five showcases, we demonstrate the applicability of our open-source approach on commodity mobile devices and further highlight the potential of tangibles on capacitive touchscreens.",
  "authors": [
    {
      "name": "Marius Rusu",
      "institution": "LMU Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527522",
      "orcid": "0000-0002-6313-3236"
    },
    {
      "name": "Sven Mayer",
      "institution": "LMU Munich, Germany and Munich Center for Machine Learning (MCML), Germany",
      "img": "/do/10.1145/contrib-99658696530/rel-imgonly/p_mayersven.jpg",
      "acmid": "99658696530",
      "orcid": "0000-0001-5462-8782"
    }
  ],
  "references": [
    {
      "text": "Daniel Avrahami, Jacob O. Wobbrock, and Shahram Izadi. 2011. Portico: Tangible Interaction on and around a Tablet. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 347–356. https://doi.org/10.1145/2047196.2047241",
      "doi": "10.1145/2047196.2047241"
    },
    {
      "text": "Simon Baker and Takeo Kanade. 2002. Limits on Super-Resolution and How to Break Them. IEEE Trans. Pattern Anal. Mach. Intell. 24, 9 (2002), 1167–1183. https://doi.org/10.1109/TPAMI.2002.1033210",
      "doi": "10.1109/TPAMI.2002.1033210"
    },
    {
      "text": "Patrick Baudisch, Torsten Becker, and Frederik Rudeck. 2010. Lumino: Tangible Blocks for Tabletop Computers Based on Glass Fiber Bundles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1165–1174. https://doi.org/10.1145/1753326.1753500",
      "doi": "10.1145/1753326.1753500"
    },
    {
      "text": "Mads Bock, Martin Fisker, Kasper Fischer Topp, and Martin Kraus. 2015. Tangible Widgets for a Multiplayer Tablet Game in Comparison to Finger Touch. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ’15). Association for Computing Machinery, New York, NY, USA, 755–758. https://doi.org/10.1145/2793107.2810269",
      "doi": "10.1145/2793107.2810269"
    },
    {
      "text": "Konstantinos Bousmalis, Nathan Silberman, David Dohan, Dumitru Erhan, and Dilip Krishnan. 2016. Unsupervised Pixel-Level Domain Adaptation with Generative Adversarial Networks. https://doi.org/10.48550/ARXIV.1612.05424",
      "doi": ""
    },
    {
      "text": "John Campbell and Xharmagne Carandang. 2012. Comparing Graphical and Tangible User Interfaces for a Tower Defense Game. In 18th Americas Conference on Information Systems(AMCIS 2012). Association for Information Systems, New York, NY, USA, 10. https://aisel.aisnet.org/amcis2012/proceedings/HCIStudies/11",
      "doi": ""
    },
    {
      "text": "Liwei Chan, Stefanie Müller, Anne Roudaut, and Patrick Baudisch. 2012. CapStones and ZebraWidgets: Sensing Stacks of Building Blocks, Dials and Sliders on Capacitive Touch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2189–2192. https://doi.org/10.1145/2207676.2208371",
      "doi": "10.1145/2207676.2208371"
    },
    {
      "text": "Leida Chen and Ravi Nath. 2008. A Socio-Technical Perspective of Mobile Work. Inf. Knowl. Syst. Manag. 7, 1,2 (2008), 41–60.",
      "doi": "10.5555/1402701.1402710"
    },
    {
      "text": "Yuhua Chen, Feng Shi, Anthony G. Christodoulou, Yibin Xie, Zhengwei Zhou, and Debiao Li. 2018. Efficient and Accurate MRI Super-Resolution Using a Generative Adversarial Network and 3D Multi-Level Densely Connected Network., 9 pages. https://doi.org/10.1007/978-3-030-00928-1_11",
      "doi": "10.1007/978-3-030-00928-1_11"
    },
    {
      "text": "Yu Cheng, Zhe Gan, Yitong Li, Jingjing Liu, and Jianfeng Gao. 2020. Sequential Attention GAN for Interactive Image Editing. In Proceedings of the 28th ACM International Conference on Multimedia. Association for Computing Machinery, New York, NY, USA, 4383–4391. https://doi.org/10.1145/3394171.3413551",
      "doi": "10.1145/3394171.3413551"
    },
    {
      "text": "Frederick Choi, Sven Mayer, and Chris Harrison. 2021. 3D Hand Pose Estimation on Conventional Capacitive Touchscreens. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction. Association for Computing Machinery, New York, NY, USA, Article 3, 13 pages. https://doi.org/10.1145/3447526.3472045",
      "doi": "10.1145/3447526.3472045"
    },
    {
      "text": "Okkyung Choi, Seolhwa Han, Seungbin Moon, Kangseok Kim, Hongjin Yeh, and Taesik Shon. 2013. Secure Mobile Payment Service Using Vibration Cues on Near Field Communication Smartphone. Sensor Letters 11(2013), 1750–1754. https://doi.org/10.1166/sl.2013.2994",
      "doi": ""
    },
    {
      "text": "Antonia Creswell, Tom White, Vincent Dumoulin, Kai Arulkumaran, Biswa Sengupta, and Anil A. Bharath. 2018. Generative Adversarial Networks: An Overview. IEEE Signal Processing Magazine 35, 1 (2018), 53–65. https://doi.org/10.1109/msp.2017.2765202",
      "doi": ""
    },
    {
      "text": "Chao Dong, Chen Change Loy, Kaiming He, and Xiaoou Tang. 2014. Learning a Deep Convolutional Network for Image Super-Resolution. In Computer Vision – ECCV 2014. Springer International Publishing, Cham, 184–199.",
      "doi": ""
    },
    {
      "text": "Chao Dong, Chen Change Loy, Kaiming He, and Xiaoou Tang. 2016. Image Super-Resolution Using Deep Convolutional Networks. IEEE Trans. Pattern Anal. Mach. Intell. 38, 2 (2016), 295–307. https://doi.org/10.1109/TPAMI.2015.2439281",
      "doi": "10.1109/TPAMI.2015.2439281"
    },
    {
      "text": "Lisa A. Elkin, Jean-Baptiste Beau, Géry Casiez, and Daniel Vogel. 2020. Manipulation, Learning, and Recall with Tangible Pen-Like Input. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376772",
      "doi": "10.1145/3313831.3376772"
    },
    {
      "text": "Shreyas Fadnavis. 2014. Image Interpolation Techniques in Digital Image Processing: An Overview. International Journal Of Engineering Research and Application 4 (2014), 2248–962270.",
      "doi": ""
    },
    {
      "text": "Min Fan, Alissa N. Antle, Maureen Hoskyn, Carman Neustaedter, and Emily S. Cramer. 2017. Why Tangibility Matters: A Design Case Study of At-Risk Children Learning to Read and Spell. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1805–1816.",
      "doi": "10.1145/3025453.3026048"
    },
    {
      "text": "Min Fan, Uddipana Baishya, Elgin-Skye Mclaren, Alissa N. Antle, Shubhra Sarker, and Amal Vincent. 2018. Block Talks: A Tangible and Augmented Reality Toolkit for Children to Learn Sentence Construction. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188576",
      "doi": "10.1145/3170427.3188576"
    },
    {
      "text": "Sina Farsiu, Dirk Robinson, Michael Elad, and Peyman Milanfar. 2004. Advances and challenges in super-resolution. International Journal of Imaging Systems and Technology 14, 2(2004), 47–57. https://doi.org/10.1002/ima.20007",
      "doi": ""
    },
    {
      "text": "Mark Fiala. 2005. ARTag, a fiducial marker system using digital techniques. Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition 2(2005), 590–596 vol. 2. https://doi.org/10.1109/CVPR.2005.74",
      "doi": "10.1109/CVPR.2005.74"
    },
    {
      "text": "George W. Fitzmaurice, Hiroshi Ishii, and William A. S. Buxton. 1995. Bricks: Laying the Foundations for Graspable User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’95). ACM Press/Addison-Wesley Publishing Co., USA, 442–449. https://doi.org/10.1145/223904.223964",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Sergio Garrido-Jurado, Rafael Muñoz-Salinas, Francisco José Madrid-Cuevas, and Manuel J. Marín-Jiménez. 2014. Automatic generation and detection of highly reliable fiducial markers under occlusion. Pattern Recognition 47, 6 (2014), 2280–2292. https://doi.org/10.1016/j.patcog.2014.01.005",
      "doi": "10.1016/j.patcog.2014.01.005"
    },
    {
      "text": "Steven Gelineck, Jesper Andersen, and Morten Büchert. 2013. Music Mixing Surface. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (St. Andrews, Scotland, United Kingdom) (ITS ’13). Association for Computing Machinery, New York, NY, USA, 433–436. https://doi.org/10.1145/2512349.2517248",
      "doi": "10.1145/2512349.2517248"
    },
    {
      "text": "Ian J. Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. 2014. Generative Adversarial Networks. (2014). https://doi.org/10.48550/ARXIV.1406.2661",
      "doi": ""
    },
    {
      "text": "Timo Götzelmann and Christopher Althaus. 2016. TouchSurfaceModels: Capacitive Sensing Objects through 3D Printers. In Proceedings of the 9th ACM International Conference on PErvasive Technologies Related to Assistive Environments (Corfu, Island, Greece) (PETRA ’16). Association for Computing Machinery, New York, NY, USA, Article 22, 8 pages. https://doi.org/10.1145/2910674.2910690",
      "doi": "10.1145/2910674.2910690"
    },
    {
      "text": "Timo Götzelmann and Daniel Schneider. 2016. CapCodes: Capacitive 3D Printable Identification and On-Screen Tracking for Tangible Interaction. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 32, 4 pages. https://doi.org/10.1145/2971485.2971518",
      "doi": "10.1145/2971485.2971518"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew S. Reynolds, and Joshua R. Smith. 2017. Finding Common Ground: A Survey of Capacitive Sensing in Human-Computer Interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3293–3315. https://doi.org/10.1145/3025453.3025808",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2015. Deep Residual Learning for Image Recognition. https://doi.org/10.48550/ARXIV.1512.03385",
      "doi": ""
    },
    {
      "text": "Michael S. Horn, Erin Treacy Solovey, and Robert J. K. Jacob. 2008. Tangible Programming and Informal Science Learning: Making TUIs Work for Museums. In Proceedings of the 7th International Conference on Interaction Design and Children(Chicago, Illinois) (IDC ’08). Association for Computing Machinery, New York, NY, USA, 194–201. https://doi.org/10.1145/1463689.1463756",
      "doi": "10.1145/1463689.1463756"
    },
    {
      "text": "Meng-Ju Hsieh, Rong-Hao Liang, Jr-Ling Guo, and Bing-Yu Chen. 2018. RFIDesk: An Interactive Surface for Multi-Touch and Rich-ID Stackable Tangible Interactions. In SIGGRAPH Asia 2018 Emerging Technologies (Tokyo, Japan) (SA ’18). Association for Computing Machinery, New York, NY, USA, Article 11, 2 pages. https://doi.org/10.1145/3275476.3275491",
      "doi": "10.1145/3275476.3275491"
    },
    {
      "text": "Yizhen Huang and Yangjing Long. 2006. Super-Resolution using Neural Networks Based on the Optimal Recovery Theory. In 16th IEEE Signal Processing Society Workshop on Machine Learning for Signal Processing. Springer, Cham, Switzerland, 465–470. https://doi.org/10.1109/MLSP.2006.275595",
      "doi": ""
    },
    {
      "text": "Kohei Ikeda and Koji Tsukada. 2015. CapacitiveMarker: Novel Interaction Method Using Visual Marker Integrated with Conductive Pattern. In Proceedings of the 6th Augmented Human International Conference (Singapore, Singapore) (AH ’15). Association for Computing Machinery, New York, NY, USA, 225–226. https://doi.org/10.1145/2735711.2735783",
      "doi": "10.1145/2735711.2735783"
    },
    {
      "text": "Phillip Isola, Jun-Yan Zhu, Tinghui Zhou, and Alexei A. Efros. 2016. Image-to-Image Translation with Conditional Adversarial Networks. https://doi.org/10.48550/ARXIV.1611.07004",
      "doi": ""
    },
    {
      "text": "Tero Karras, Samuli Laine, and Timo Aila. 2018. A Style-Based Generator Architecture for Generative Adversarial Networks. https://doi.org/10.48550/ARXIV.1812.04948",
      "doi": ""
    },
    {
      "text": "Tero Karras, Samuli Laine, Miika Aittala, Janne Hellsten, Jaakko Lehtinen, and Timo Aila. 2019. Analyzing and Improving the Image Quality of StyleGAN. https://doi.org/10.48550/ARXIV.1912.04958",
      "doi": ""
    },
    {
      "text": "Sokratis Kartakis, Margherita Antona, and Constantine Stephanidis. 2011. Control Smart Homes Easily with Simple Touch. In Proceedings of the 2011 International ACM Workshop on Ubiquitous Meta User Interfaces (Scottsdale, Arizona, USA) (Ubi-MUI ’11). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/2072652.2072654",
      "doi": "10.1145/2072652.2072654"
    },
    {
      "text": "Hirokazu Kato and Mark Billinghurst. 1999. Marker Tracking and HMD Calibration for a Video-Based Augmented Reality Conferencing System. In Proceedings of the 2nd IEEE and ACM International Workshop on Augmented Reality(IWAR ’99). IEEE Computer Society, New York, NY, USA, 85.",
      "doi": ""
    },
    {
      "text": "Jiwon Kim, Jung Kwon Lee, and Kyoung Mu Lee. 2015. Accurate Image Super-Resolution Using Very Deep Convolutional Networks. https://doi.org/10.48550/ARXIV.1511.04587",
      "doi": ""
    },
    {
      "text": "Jiwon Kim, Jung Kwon Lee, and Kyoung Mu Lee. 2015. Deeply-Recursive Convolutional Network for Image Super-Resolution. https://doi.org/10.48550/ARXIV.1511.04491",
      "doi": ""
    },
    {
      "text": "Diederik P. Kingma and Jimmy Ba. 2014. Adam: A Method for Stochastic Optimization. https://doi.org/10.48550/ARXIV.1412.6980",
      "doi": ""
    },
    {
      "text": "Jungil Kong, Jaehyeon Kim, and Jaekyoung Bae. 2020. HiFi-GAN: Generative Adversarial Networks for Efficient and High Fidelity Speech Synthesis. https://doi.org/10.48550/ARXIV.2010.05646",
      "doi": ""
    },
    {
      "text": "Sven Kratz, Tilo Westermann, Michael Rohs, and Georg Essl. 2011. CapWidgets: Tangile Widgets versus Multi-Touch Controls on Mobile Devices. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 1351–1356. https://doi.org/10.1145/1979742.1979773",
      "doi": "10.1145/1979742.1979773"
    },
    {
      "text": "Abinaya Kumar, Aishwarya Radjesh, Sven Mayer, and Huy Viet Le. 2019. Improving the Input Accuracy of Touchscreens Using Deep Learning. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312928",
      "doi": "10.1145/3290607.3312928"
    },
    {
      "text": "Cornelius Lanczos. 1950. An iteration method for the solution of the eigenvalue problem of linear differential and integral operators. 45, 4 (1950).",
      "doi": ""
    },
    {
      "text": "Kam Hon Lau, Umair Mujtaba Qureshi, Bruno Silva, and Gerhard Petrus Hancke. 2021. Mobile Proximity Channel Using Vibration. In IECON 2021 – 47th Annual Conference of the IEEE Industrial Electronics Society. IEEE, New York, NY, USA, 1–6. https://doi.org/10.1109/IECON48115.2021.9589526",
      "doi": ""
    },
    {
      "text": "Huy Viet Le, Thomas Kosch, Patrick Bader, Sven Mayer, and Niels Henze. 2018. PalmTouch: Using the Palm as an Additional Input Modality on Commodity Smartphones. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173934",
      "doi": "10.1145/3173574.3173934"
    },
    {
      "text": "Huy Viet Le, Sven Mayer, and Niels Henze. 2018. InfiniTouch: Finger-Aware Interaction on Fully Touch Sensitive Smartphones. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 779–792. https://doi.org/10.1145/3242587.3242605",
      "doi": "10.1145/3242587.3242605"
    },
    {
      "text": "Christian Ledig, Lucas Theis, Ferenc Huszár, Jose Caballero, Andrew Cunningham, Alejandro Acosta, Andrew Aitken, Alykhan Tejani, Johannes Totz, Zehan Wang, and Wenzhe Shi. 2017. Photo-Realistic Single Image Super-Resolution Using a Generative Adversarial Network. In 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). IEEE, New York, NY, USA, 105–114. https://doi.org/10.1109/CVPR.2017.19",
      "doi": ""
    },
    {
      "text": "Chuan Li and Michael Wand. 2016. Precomputed Real-Time Texture Synthesis with Markovian Generative Adversarial Networks. https://doi.org/10.48550/ARXIV.1604.04382",
      "doi": ""
    },
    {
      "text": "Yanhong Li, Meng Liang, Julian Preissing, Nadine Bachl, Michelle Melina Dutoit, Thomas Weber, Sven Mayer, and Heinrich Hussmann. 2022. A Meta-Analysis of Tangible Learning Studies from the TEI Conference. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction (Daejeon, Republic of Korea) (TEI ’22). Association for Computing Machinery, New York, NY, USA, Article 7, 17 pages. https://doi.org/10.1145/3490149.3501313",
      "doi": "10.1145/3490149.3501313"
    },
    {
      "text": "Zhouchen Lin and Heung-Yeung Shum. 2004. Fundamental limits of reconstruction-based superresolution algorithms under local translation. IEEE Transactions on Pattern Analysis and Machine Intelligence 26, 1(2004), 83–97. https://doi.org/10.1109/TPAMI.2004.1261081",
      "doi": "10.1109/TPAMI.2004.1261081"
    },
    {
      "text": "Jen-Yu Liu, Yu-Hua Chen, Yin-Cheng Yeh, and Yi-Hsuan Yang. 2020. Unconditional Audio Generation with Generative Adversarial Networks and Cycle Regularization. In Interspeech 2020. ISCA, Baixas, French, 5. https://doi.org/10.21437/interspeech.2020-1137",
      "doi": ""
    },
    {
      "text": "Karola Marky, Martin Schmitz, Verena Zimmermann, Martin Herbers, Kai Kunze, and Max Mühlhäuser. 2020. 3D-Auth: Two-Factor Authentication with Personalized 3D-Printed Items. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376189",
      "doi": "10.1145/3313831.3376189"
    },
    {
      "text": "Sven Mayer, Huy Viet Le, and Niels Henze. 2017. Estimating the Finger Orientation on Capacitive Touchscreens Using Convolutional Neural Networks. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (Brighton, United Kingdom) (ISS ’17). Association for Computing Machinery, New York, NY, USA, 220–229. https://doi.org/10.1145/3132272.3134130",
      "doi": "10.1145/3132272.3134130"
    },
    {
      "text": "Sven Mayer, Xiangyu Xu, and Chris Harrison. 2021. Super-Resolution Capacitive Touchscreens. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 12, 10 pages. https://doi.org/10.1145/3411764.3445703",
      "doi": "10.1145/3411764.3445703"
    },
    {
      "text": "Allison Merz, Annie Hu, and Tracey Lin. 2018. ClipWorks: A Tangible Interface for Collaborative Video Editing. In Proceedings of the 17th ACM Conference on Interaction Design and Children (Trondheim, Norway) (IDC ’18). Association for Computing Machinery, New York, NY, USA, 497–500. https://doi.org/10.1145/3202185.3210758",
      "doi": "10.1145/3202185.3210758"
    },
    {
      "text": "Mehdi Mirza and Simon Osindero. 2014. Conditional Generative Adversarial Nets. https://doi.org/10.48550/ARXIV.1411.1784",
      "doi": ""
    },
    {
      "text": "Eric Daniel Mjolsness. 1986. Neural Networks, Pattern Recognition, and Fingerprint Hallucination. Ph. D. Dissertation. California Institute of Technology. https://doi.org/10.7907/M0VQ-DJ43",
      "doi": ""
    },
    {
      "text": "Kamal Nasrollahi and Thomas B Moeslund. 2014. Super-resolution: a comprehensive survey. Machine vision and applications 25, 6 (2014), 1423–1468. https://doi.org/10.1007/s00138-014-0623-4",
      "doi": "10.1007/s00138-014-0623-4"
    },
    {
      "text": "Alexander Ng, Stephen A. Brewster, Frank Beruscha, and Wolfgang Krautter. 2017. An Evaluation of Input Controls for In-Car Interactions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2845–2852. https://doi.org/10.1145/3025453.3025736",
      "doi": "10.1145/3025453.3025736"
    },
    {
      "text": "Edwin Olson. 2011. AprilTag: A robust and flexible visual fiducial system. In 2011 IEEE International Conference on Robotics and Automation. IEEE, New York, NY, USA, 3400–3407. https://doi.org/10.1109/ICRA.2011.5979561",
      "doi": ""
    },
    {
      "text": "Nobuyuki Otsu. 1979. A Threshold Selection Method from Gray-Level Histograms. IEEE Transactions on Systems, Man, and Cybernetics 9, 1(1979), 62–66. https://doi.org/10.1109/TSMC.1979.4310076",
      "doi": ""
    },
    {
      "text": "Pankaj Parsania and Dr V.Virparia. 2015. A Review: Image Interpolation Techniques for Image Scaling. International Journal of Innovative Research in Computer and Communication Engineering 02(2015), 7409–7414. https://doi.org/10.15680/IJIRCCE.2014.0212024",
      "doi": ""
    },
    {
      "text": "Santiago Pascual, Antonio Bonafonte, and Joan Serrà. 2017. SEGAN: Speech Enhancement Generative Adversarial Network. https://doi.org/10.48550/ARXIV.1703.09452",
      "doi": ""
    },
    {
      "text": "Esben Warming Pedersen and Kasper Hornbæk. 2011. Tangible Bots: Interaction with Active Tangibles in Tabletop Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2975–2984. https://doi.org/10.1145/1978942.1979384",
      "doi": "10.1145/1978942.1979384"
    },
    {
      "text": "Alec Radford, Luke Metz, and Soumith Chintala. 2015. Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks. https://doi.org/10.48550/ARXIV.1511.06434",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto. 2002. SmartSkin: An Infrastructure for Freehand Manipulation on Interactive Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI ’02). Association for Computing Machinery, New York, NY, USA, 113–120. https://doi.org/10.1145/503376.503397",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "David E Rumelhart, Richard Durbin, Richard Golden, and Yves Chauvin. 1995. Backpropagation: The basic theory. Backpropagation: Theory, architectures and applications (1995), 1–34.",
      "doi": ""
    },
    {
      "text": "Martin Schmitz, Florian Müller, Max Mühlhäuser, Jan Riemann, and Huy Viet Viet Le. 2021. Itsy-Bits: Fabrication and Recognition of 3D-Printed Tangibles with Small Footprints on Capacitive Touchscreens. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 419, 12 pages. https://doi.org/10.1145/3411764.3445502",
      "doi": "10.1145/3411764.3445502"
    },
    {
      "text": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, and Max Mühlhäuser. 2017. Flexibles: Deformation-Aware 3D-Printed Tangibles for Capacitive Touchscreens. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1001–1014. https://doi.org/10.1145/3025453.3025663",
      "doi": "10.1145/3025453.3025663"
    },
    {
      "text": "Wenzhe Shi, Jose Caballero, Ferenc Huszar, Johannes Totz, Andrew P. Aitken, Rob Bishop, Daniel Rueckert, and Zehan Wang. 2016. Real-Time Single Image and Video Super-Resolution Using an Efficient Sub-Pixel Convolutional Neural Network. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). IEEE Computer Society, Los Alamitos, CA, USA, 1874–1883. https://doi.org/10.1109/CVPR.2016.207 arxiv:1609.05158",
      "doi": ""
    },
    {
      "text": "Ashish Shrivastava, Tomas Pfister, Oncel Tuzel, Josh Susskind, Wenda Wang, and Russ Webb. 2016. Learning from Simulated and Unsupervised Images through Adversarial Training. https://doi.org/10.48550/ARXIV.1612.07828",
      "doi": ""
    },
    {
      "text": "Jost Tobias Springenberg, Alexey Dosovitskiy, Thomas Brox, and Martin Riedmiller. 2014. Striving for Simplicity: The All Convolutional Net. https://doi.org/10.48550/ARXIV.1412.6806",
      "doi": ""
    },
    {
      "text": "Benedict Steuerlein and Sven Mayer. 2022. Conductive Fiducial Tangibles for Everyone: A Data Simulation-Based Toolkit Using Deep Learning. Proc. ACM Hum.-Comput. Interact. 6, MHCI, Article 183 (sep 2022), 22 pages. https://doi.org/10.1145/3546718",
      "doi": "10.1145/3546718"
    },
    {
      "text": "Paul Streli and Christian Holz. 2021. CapContact: Super-Resolution Contact Areas from Capacitive Touchscreens. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 289, 14 pages. https://doi.org/10.1145/3411764.3445621",
      "doi": "10.1145/3411764.3445621"
    },
    {
      "text": "Satoshi Suzuki and KeiichiA be. 1985. Topological structural analysis of digitized binary images by border following. Computer Vision, Graphics, and Image Processing 30, 1(1985), 32–46. https://doi.org/10.1016/0734-189X(85)90016-7",
      "doi": ""
    },
    {
      "text": "R Tsai. 1984. Multiframe image restoration and registration. Advance Computer Visual and Image Processing 1 (1984), 317–339.",
      "doi": ""
    },
    {
      "text": "Brygg Ullmer and Hiroshi Ishii. 1997. The MetaDESK: Models and Prototypes for Tangible User Interfaces. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (Banff, Alberta, Canada) (UIST ’97). Association for Computing Machinery, New York, NY, USA, 223–232. https://doi.org/10.1145/263407.263551",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. 1999. Urp: A Luminous-Tangible Workbench for Urban Planning and Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Pittsburgh, Pennsylvania, USA) (CHI ’99). Association for Computing Machinery, New York, NY, USA, 386–393. https://doi.org/10.1145/302979.303114",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Simon Voelker, Christian Cherek, Jan Thar, Thorsten Karrer, Christian Thoresen, Kjell Ivar Øvergård, and Jan Borchers. 2015. PERCs: Persistently Trackable Tangibles on Capacitive Multi-Touch Displays. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 351–356. https://doi.org/10.1145/2807442.2807466",
      "doi": "10.1145/2807442.2807466"
    },
    {
      "text": "Simon Voelker, Kosuke Nakajima, Christian Thoresen, Yuichi Itoh, Kjell Ivar Øvergård, and Jan Borchers. 2013. PUCs: Detecting Transparent, Passive Untouched Capacitive Widgets on Unmodified Multi-Touch Displays. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (St. Andrews, Scotland, United Kingdom) (ITS ’13). Association for Computing Machinery, New York, NY, USA, 101–104. https://doi.org/10.1145/2512349.2512791",
      "doi": "10.1145/2512349.2512791"
    },
    {
      "text": "Daniel Wagner and Dieter Schmalstieg. 2007. ARToolKitPlus for Pose Tracking on Mobile Devices. In Proceedings of 12th Computer Vision Winter Workshop(CVWW’07). Graz Technical University, St. Lambrecht, Austria, 8.",
      "doi": ""
    },
    {
      "text": "Johnty Wang, Nicolas D’Alessandro, Sidney Fels, and Bob Pritchard. 2011. SQUEEZY: Extending a Multi-touch Screen with Force Sensing Objects for Controlling Articulatory Synthesis. In 11th International Conference on New Interfaces for Musical Expression(NIME 2011). nime.org, 531–532.",
      "doi": ""
    },
    {
      "text": "John Wang and Edwin Olson. 2016. AprilTag 2: Efficient and robust fiducial detection. In 2016 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, New York, NY, USA, 4193–4198. https://doi.org/10.1109/IROS.2016.7759617",
      "doi": "10.1109/IROS.2016.7759617"
    },
    {
      "text": "Xintao Wang, Ke Yu, Shixiang Wu, Jinjin Gu, Yihao Liu, Chao Dong, Chen Change Loy, Yu Qiao, and Xiaoou Tang. 2018. ESRGAN: Enhanced Super-Resolution Generative Adversarial Networks. https://doi.org/10.48550/ARXIV.1809.00219",
      "doi": ""
    },
    {
      "text": "Zhou Wang, A.C. Bovik, H.R. Sheikh, and E.P. Simoncelli. 2004. Image quality assessment: from error visibility to structural similarity. IEEE Transactions on Image Processing 13, 4 (2004), 600–612. https://doi.org/10.1109/TIP.2003.819861",
      "doi": "10.1109/TIP.2003.819861"
    },
    {
      "text": "Malte Weiss, Julie Wagner, Yvonne Jansen, Roger Jennings, Ramsin Khoshabeh, James D. Hollan, and Jan Borchers. 2009. SLAP Widgets: Bridging the Gap between Virtual and Physical Controls on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 481–490. https://doi.org/10.1145/1518701.1518779",
      "doi": "10.1145/1518701.1518779"
    },
    {
      "text": "Bartlomiej Wronski, Ignacio Garcia-Dorado, Manfred Ernst, Damien Kelly, Michael Krainin, Chia-Kai Liang, Marc Levoy, and Peyman Milanfar. 2019. Handheld Multi-Frame Super-Resolution. ACM Trans. Graph. 38, 4, Article 28 (2019), 18 pages. https://doi.org/10.1145/3306346.3323024",
      "doi": "10.1145/3306346.3323024"
    },
    {
      "text": "Jiajun Wu, Chengkai Zhang, Tianfan Xue, William T. Freeman, and Joshua B. Tenenbaum. 2016. Learning a Probabilistic Latent Space of Object Shapes via 3D Generative-Adversarial Modeling. https://doi.org/10.48550/ARXIV.1610.07584",
      "doi": ""
    },
    {
      "text": "Robert Xiao, Sven Mayer, and Chris Harrison. 2020. VibroComm: Using Commodity Gyroscopes for Vibroacoustic Data Reception. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, Article 5, 9 pages. https://doi.org/10.1145/3379503.3403540",
      "doi": "10.1145/3379503.3403540"
    },
    {
      "text": "Robert Xiao, Julia Schwarz, and Chris Harrison. 2015. Estimating 3D Finger Angle on Commodity Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (Madeira, Portugal) (ITS ’15). Association for Computing Machinery, New York, NY, USA, 47–50. https://doi.org/10.1145/2817721.2817737",
      "doi": "10.1145/2817721.2817737"
    },
    {
      "text": "Xiangyu Xu, Yongrui Ma, and Wenxiu Sun. 2019. Towards Real Scene Super-Resolution with Raw Images. https://doi.org/10.48550/ARXIV.1905.12156",
      "doi": ""
    },
    {
      "text": "Chih-Yuan Yang, Chao Ma, and Ming-Hsuan Yang. 2014. Single-Image Super-Resolution: A Benchmark. In Computer Vision – ECCV 2014. Springer International Publishing, Cham, Switzerland, 372–386. https://doi.org/10.1007/978-3-319-10593-2_25",
      "doi": ""
    },
    {
      "text": "Xin Yu and Fatih Porikli. 2016. Ultra-Resolving Face Images by Discriminative Generative Networks. In Computer Vision – ECCV 2016. Springer International Publishing, Cham, Switzerland, 318–333. https://doi.org/10.1007/978-3-319-46454-1_20",
      "doi": ""
    },
    {
      "text": "Guillaume Zufferey, Patrick Jermann, Aurélien Lucchi, and Pierre Dillenbourg. 2009. TinkerSheets: Using Paper Forms to Control and Visualize Tangible Simulations. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction(Cambridge, United Kingdom) (TEI ’09). Association for Computing Machinery, New York, NY, USA, 377–384. https://doi.org/10.1145/1517664.1517740",
      "doi": "10.1145/1517664.1517740"
    }
  ]
}