{
  "doi": "10.1145/3544548.3580726",
  "title": "multiverse: Multiplexing Alternative Data Analyses in R Notebooks",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "There are myriad ways to analyse a dataset. But which one to trust? In the face of such uncertainty, analysts may adopt multiverse analysis: running all reasonable analyses on the dataset. Yet this is cognitively and technically difficult with existing tools—how does one specify and execute all combinations of reasonable analyses of a dataset?—and often requires discarding existing workflows. We present multiverse, a tool for implementing multiverse analyses in R with expressive syntax supporting existing computational notebook workflows. multiverse supports building up a multiverse through local changes to a single analysis and optimises execution by pruning redundant computations. We evaluate how multiverse supports programming multiverse analyses using (a) principles of cognitive ergonomics to compare with two existing multiverse tools; and (b) case studies based on semi-structured interviews with researchers who have successfully implemented an end-to-end analysis using multiverse. We identify design tradeoffs (e.g. increased flexibility versus learnability), and suggest future directions for multiverse tool design.",
  "tags": [
    "Multiverse Analysis",
    "cognitive dimensions of notations",
    "robust statistical analysis"
  ],
  "authors": [
    {
      "name": "Abhraneel Sarma",
      "institution": "Computer Science, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163410",
      "orcid": "0000-0002-1408-4511"
    },
    {
      "name": "Alex Kale",
      "institution": "Computer Science, University of Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367253",
      "orcid": "0000-0001-7668-2800"
    },
    {
      "name": "Michael Jongho Moon",
      "institution": "Department of Statistical Sciences, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782041",
      "orcid": "0000-0001-9997-5817"
    },
    {
      "name": "Nathan Taback",
      "institution": "Department of Statistical Sciences and Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779131",
      "orcid": "0000-0001-9497-3951"
    },
    {
      "name": "Fanny Chevalier",
      "institution": "Department of Computer Science and Statistical Sciences, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325488036",
      "orcid": "0000-0002-5585-7971"
    },
    {
      "name": "Jessica Hullman",
      "institution": "Computer Science, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657387",
      "orcid": "0000-0001-6826-3550"
    },
    {
      "name": "Matthew Kay",
      "institution": "Computer Science and Communication, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659510709",
      "orcid": "0000-0001-9446-0419"
    }
  ],
  "references": [
    {
      "text": "2020 (accessed September 15, 2020). Tidyverse. https://www.tidyverse.org/",
      "doi": ""
    },
    {
      "text": "Ruben C Arslan, Katharina M Schilling, Tanja M Gerlach, and Lars Penke. 2018. Using 26,000 diary entries to show ovulatory changes in sexual desire and behavior.Journal of Personality and Social Psychology (2018).",
      "doi": ""
    },
    {
      "text": "Laura A Bakkensen and William Larson. 2014. Population matters when modeling hurricane fatalities. Proceedings of the National Academy of Sciences 111, 50(2014), E5331–E5332.",
      "doi": ""
    },
    {
      "text": "Henrik Bengtsson. 2020. future: Unified Parallel and Distributed Processing in R for Everyone. https://CRAN.R-project.org/package=future R package version 1.18.0.",
      "doi": ""
    },
    {
      "text": "Donald Berry. 2012. Multiplicities in cancer research: ubiquitous and necessary evils. Journal of the National Cancer Institute 104, 15 (2012), 1125–1133.",
      "doi": ""
    },
    {
      "text": "Alan F Blackwell, Carol Britton, A Cox, Thomas RG Green, Corin Gurr, Gada Kadoda, MS Kutar, Martin Loomes, Chrystopher L Nehaniv, Marian Petre, 2001. Cognitive dimensions of notations: Design tools for cognitive technology. In International Conference on Cognitive Technology. Springer, 325–341.",
      "doi": ""
    },
    {
      "text": "Christopher J Bryan, David S Yeager, and Joseph M O’Brien. 2019. Replicator degrees of freedom allow publication of misleading failures to replicate. Proceedings of the National Academy of Sciences 116, 51(2019), 25535–25545.",
      "doi": ""
    },
    {
      "text": "Joseph Cesario, David J Johnson, and William Terrill. 2019. Is there evidence of racial disparity in police use of deadly force? Analyses of officer-involved fatal shootings in 2015–2016. Social psychological and personality science 10, 5 (2019), 586–595.",
      "doi": ""
    },
    {
      "text": "Björn Christensen and Sören Christensen. 2014. Are female hurricanes really deadlier than male hurricanes?Proceedings of the National Academy of Sciences 111, 34(2014), E3497–E3498.",
      "doi": ""
    },
    {
      "text": "Pasquale Cirillo and Nassim Nicholas Taleb. 2016. On the statistical properties and tail risk of violent conflicts. Physica A: Statistical Mechanics and its Applications 452 (2016), 29–45.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Alan Dix. 2018. Hark no more: on the preregistration of chi experiments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173715"
    },
    {
      "text": "J Anthony Cookson. 2018. When saving is gambling. Journal of Financial Economics 129, 1 (2018), 24–45.",
      "doi": ""
    },
    {
      "text": "Marcus Credé and Leigh A Phillips. 2017. Revisiting the power pose effect: How robust are the results reported by Carney, Cuddy, and Yap (2010) to data analytic decisions?Social Psychological and Personality Science 8, 5 (2017), 493–499.",
      "doi": ""
    },
    {
      "text": "Egon Dejonckheere, Elise K Kalokerinos, Brock Bastian, and Peter Kuppens. 2019. Poor emotion regulation ability mediates the link between depressive symptoms and affective bipolarity. Cognition and Emotion 33, 5 (2019), 1076–1083.",
      "doi": ""
    },
    {
      "text": "Egon Dejonckheere, Merijn Mestdagh, Marlies Houben, Yasemin Erbas, Madeline Pe, Peter Koval, Annette Brose, Brock Bastian, and Peter Kuppens. 2018. The bipolarity of affect and depressive symptoms.Journal of personality and social psychology 114, 2(2018), 323.",
      "doi": ""
    },
    {
      "text": "Marco Del Giudice and Steven Gangestad. 2020. A Traveler’s Guide to the Multiverse: Promises, Pitfalls, and a Framework for the Evaluation of Analytic Decisions. Advances in Methods and Practices in Psychological Science (07 2020).",
      "doi": ""
    },
    {
      "text": "Emilie Delaherche, Mohamed Chetouani, Ammar Mahdhaoui, Catherine Saint-Georges, Sylvie Viaux, and David Cohen. 2012. Interpersonal Synchrony: A Survey of Evaluation Methods across Disciplines. IEEE Transactions on Affective Computing 3, 3 (Jul 2012), 349–365. https://doi.org/10.1109/T-AFFC.2012.12",
      "doi": "10.1109/T-AFFC.2012.12"
    },
    {
      "text": "Seamus Donnelly, Patricia J Brooks, and Bruce D Homer. 2019. Is there a bilingual advantage on interference-control tasks? A multiverse meta-analysis of global reaction time and interference cost. Psychonomic bulletin & review 26, 4 (2019), 1122–1147.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair statistical communication in HCI. In Modern statistical methods for HCI. Springer, 291–330.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic, Yvonne Jansen, Abhraneel Sarma, Matthew Kay, and Fanny Chevalier. 2019. Increasing the transparency of research papers with explorable multiverse analyses. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300295"
    },
    {
      "text": "Jonah Gabry, Daniel Simpson, Aki Vehtari, Michael Betancourt, and Andrew Gelman. 2019. Visualization in Bayesian workflow. Journal of the Royal Statistical Society: Series A (Statistics in Society) 182, 2(2019), 389–402. https://doi.org/10.1111/rssa.12378",
      "doi": ""
    },
    {
      "text": "Joachim Gassen. 2019. Researcher Degrees of Freedom Analysis (0.0.0.9). https://github.com/joachim-gassen/rdfanalysis",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and Eric Loken. 2013. The garden of forking paths: Why multiple comparisons can be a problem, even when there is no “fishing expedition” or “p-hacking” and the research hypothesis was posited ahead of time. Department of Statistics, Columbia University (2013).",
      "doi": ""
    },
    {
      "text": "Thomas RG Green. 1989. Cognitive dimensions of notations. People and computers V(1989), 443–460.",
      "doi": ""
    },
    {
      "text": "Brian D. Hall, Yang Liu, Yvonne Jansen, Pierre Dragicevic, Fanny Chevalier, and Matthew Kay. 2022. A Survey of Tasks and Visualizations in Multiverse Analysis Reports. Computer Graphics Forum 41, 1 (2022), 402–426. https://doi.org/10.1111/cgf.14443",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Loren Yu, Abel Allison, Yeonsoo Yang, and Scott R Klemmer. 2008. Design as exploration: creating interface alternatives through parallel authoring and runtime tuning. In Proceedings of the 21st annual ACM symposium on User interface software and technology. 91–100.",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "Andrew Head, Fred Hohman, Titus Barik, Steven M Drucker, and Robert DeLine. 2019. Managing messes in computational notebooks. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300500"
    },
    {
      "text": "E. L. Hutchins, J. D. Hollan, and D. A. Norman. 1985. Direct manipulation interfaces. Human-computer interaction 1, 4 (1985), 311–338. https://doi.org/10.1207/s15327051hci0104_2",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Kiju Jung, Sharon Shavitt, Madhu Viswanathan, and Joseph M Hilbe. 2014. Female hurricanes are deadlier than male hurricanes. Proceedings of the National Academy of Sciences 111, 24(2014), 8782–8787.",
      "doi": ""
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph M Hellerstein, and Jeffrey Heer. 2012. Enterprise data analysis and visualization: An interview study. IEEE Transactions on Visualization and Computer Graphics 18, 12(2012), 2917–2926.",
      "doi": "10.1109/TVCG.2012.219"
    },
    {
      "text": "Mary Beth Kery, Amber Horvath, and Brad A Myers. 2017. Variolite: Supporting Exploratory Programming by Data Scientists.. In CHI, Vol. 10. 3025453–3025626.",
      "doi": "10.1145/3025453.3025626"
    },
    {
      "text": "Mary Beth Kery and Brad A Myers. 2017. Exploring exploratory programming. In 2017 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 25–29.",
      "doi": ""
    },
    {
      "text": "Mary Beth Kery and Brad A Myers. 2018. Interactions for untangling messy history in a computational notebook. In 2018 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 147–155.",
      "doi": ""
    },
    {
      "text": "Mary Beth Kery, Marissa Radensky, Mahima Arya, Bonnie E John, and Brad A Myers. 2018. The story in the notebook: Exploratory data science using a literate programming tool. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3173574.3173748"
    },
    {
      "text": "Donald E. Knuth. 1984. Literate Programming. Comput. J. 27, 2 (May 1984), 97–111. https://doi.org/10.1093/comjnl/27.2.97",
      "doi": ""
    },
    {
      "text": "Sean Kross and Philip J Guo. 2019. Practitioners teaching data science in industry and academia: Expectations, workflows, and challenges. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300493"
    },
    {
      "text": "Yang Liu, Alex Kale, Tim Althoff, and Jeffrey Heer. 2020. Boba: Authoring and Visualizing Multiverse Analyses. arXiv preprint arXiv:2007.05551(2020).",
      "doi": ""
    },
    {
      "text": "Steve Maley. 2014. Statistics show no evidence of gender bias in the public’s hurricane preparedness. Proceedings of the National Academy of Sciences 111, 37(2014), E3834–E3834.",
      "doi": ""
    },
    {
      "text": "Daniel Malter. 2014. Female hurricanes are not deadlier than male hurricanes. Proceedings of the National Academy of Sciences 111, 34(2014), E3496–E3496.",
      "doi": ""
    },
    {
      "text": "James G March. 1991. Exploration and exploitation in organizational learning. Organization science 2, 1 (1991), 71–87.",
      "doi": "10.5555/2842497.2842502"
    },
    {
      "text": "Philipp K. Masur and Michael Scharkow. 2019. specr: Statistical functions for conducting specification curve analyses (Version 0.2.1.9000). https://github.com/masurp/specr",
      "doi": ""
    },
    {
      "text": "Michael Jongho Moon, Haoda Li, Mingwei Xu, Nathan Taback, Fanny Chevalier, and Alison Gibbs. 2022. mverse: Tidy Multiverse Analysis Made Simple. https://cran.r-project.org/web/packages/mverse/index.html R package version 0.1.0.",
      "doi": ""
    },
    {
      "text": "Deborah Nolan and Duncan Temple Lang. 2007. Dynamic, interactive documents for teaching statistical practice. International Statistical Review 75, 3 (2007), 295–321.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 2002. The Design of Everyday Things. Basic Books, Inc., USA.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Brian A Nosek, Charles R Ebersole, Alexander C DeHaven, and David T Mellor. 2018. The preregistration revolution. Proceedings of the National Academy of Sciences 115, 11(2018), 2600–2606.",
      "doi": ""
    },
    {
      "text": "Amy Orben and Andrew K Przybylski. 2019. The association between adolescent well-being and digital technology use. Nature Human Behaviour 3, 2 (2019), 173–182.",
      "doi": ""
    },
    {
      "text": "Chirag J Patel, Belinda Burford, and John PA Ioannidis. 2015. Assessment of vibration of effects due to model specification can demonstrate the instability of observational associations. Journal of clinical epidemiology 68, 9 (2015), 1046–1058.",
      "doi": ""
    },
    {
      "text": "Gregory J Poarch, Jan Vanhove, and Raphael Berthele. 2019. The effect of bidialectalism on executive function. International Journal of Bilingualism 23, 2 (2019), 612–628.",
      "doi": ""
    },
    {
      "text": "Adam Rule, Aurélien Tabard, and James D Hollan. 2018. Exploration and explanation in computational notebooks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173606"
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2016. Vega-lite: A grammar of interactive graphics. IEEE transactions on visualization and computer graphics 23, 1(2016), 341–350.",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Daniel J. Schad, Michael Betancourt, and Shravan Vasishth. 2021. Toward a principled Bayesian workflow in cognitive science. Psychological Methods 26, 1 (2021), 103–126. https://doi.org/10.1037/met0000275",
      "doi": ""
    },
    {
      "text": "Beau Sheil. 1986. Power tools for programmers. In Readings in artificial intelligence and software engineering. 573–580.",
      "doi": ""
    },
    {
      "text": "Raphael Silberzahn, Eric Luis Uhlmann, Daniel P Martin, Pasquale Anselmi, Frederik Aust, Eli Awtrey, Štěpán Bahník, Feng Bai, Colin Bannard, Evelina Bonnier, 2018. Many analysts, one data set: Making transparent how variations in analytic choices affect results. Advances in Methods and Practices in Psychological Science 1, 3(2018), 337–356.",
      "doi": ""
    },
    {
      "text": "Joseph P Simmons, Leif D Nelson, and Uri Simonsohn. 2011. False-positive psychology: Undisclosed flexibility in data collection and analysis allows presenting anything as significant. Psychological science 22, 11 (2011), 1359–1366.",
      "doi": ""
    },
    {
      "text": "Uri Simonsohn, Joseph P. Simmons, and Leif D. Nelson. 2020. Specification curve analysis. Nature Human Behaviour 4, 11 (Nov 2020), 1208–1214. https://doi.org/10.1038/s41562-020-0912-z",
      "doi": ""
    },
    {
      "text": "Sara Steegen, Francis Tuerlinckx, Andrew Gelman, and Wolf Vanpaemel. 2016. Increasing transparency through a multiverse analysis. Perspectives on Psychological Science 11, 5 (2016), 702–712.",
      "doi": ""
    },
    {
      "text": "Martin Voracek, Michael Kossmeier, and Ulrich S Tran. 2019. Which Data to Meta-Analyze, and How?Zeitschrift für Psychologie(2019).",
      "doi": ""
    },
    {
      "text": "Hadley Wickham. 2016. ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. https://ggplot2.tidyverse.org",
      "doi": "10.5555/1795559"
    },
    {
      "text": "Hadley. Wickham. 2019. Advanced R (2nd editioned.). CRC Press, Boca Raton, FL, Chapter 7.",
      "doi": ""
    },
    {
      "text": "Hadley. Wickham. 2019. Advanced R (2nd editioned.). CRC Press, Boca Raton, FL, Chapter 19.",
      "doi": ""
    },
    {
      "text": "Jo Wood, Alexander Kachkaev, and Jason Dykes. 2018. Design Exposition with Literate Visualization. IEEE Transactions on Visualization and Computer Graphics (2018), 759–768.",
      "doi": ""
    },
    {
      "text": "Cristobal Young and Katherine Holsteen. 2017. Model uncertainty and robustness: A computational framework for multimodel analysis. Sociological Methods & Research 46, 1 (2017), 3–40.",
      "doi": ""
    }
  ]
}