{
  "doi": "10.1145/3544548.3581061",
  "title": "Affective Profile Pictures: Exploring the Effects of Changing Facial Expressions in Profile Pictures on Text-Based Communication",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "When receiving text messages from unacquainted colleagues in fully remote workplaces, insufficient mutual understanding and limited social cues can lead people to misinterpret the tone of the message and further influence their impression of remote colleagues. Emojis have been commonly used for supporting expressive communication; however, people seldom use emojis before they become acquainted with each other. Hence, we explored how changing facial expressions in profile pictures could be an alternative channel to communicate socio-emotional cues. By conducting an online controlled experiment with 186 participants, we established that changing facial expressions of profile pictures can influence the impression of the message receivers toward the sender and the message valence when receiving neutral messages. Furthermore, presenting incongruent profile pictures to positive messages negatively affected the interpretation of the message valence, but did not have much effect on negative messages. We discuss the implications of affective profile pictures in supporting text-based communication.",
  "tags": [
    "message interpretation",
    "social cues",
    "affective communication",
    "computer-mediated communication",
    "Text-based communication",
    "impression formation"
  ],
  "authors": [
    {
      "name": "Chi-Lan Yang",
      "institution": "Graduate School of Interdisciplinary Information Studies, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959279457",
      "orcid": "0000-0003-0603-2807"
    },
    {
      "name": "Shigeo Yoshida",
      "institution": "The University of Tokyo, Japan",
      "img": "/do/10.1145/contrib-81555914056/rel-imgonly/osx_profile_img.jpg",
      "acmid": "81555914056",
      "orcid": "0000-0001-5381-0187"
    },
    {
      "name": "Hideaki Kuzuoka",
      "institution": "Graduate School of Information Science and Technology, The University of Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    },
    {
      "name": "Takuji Narumi",
      "institution": "The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331500452",
      "orcid": "0000-0002-9010-1491"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    }
  ],
  "references": [
    {
      "text": "Pengcheng An, Ziqi Zhou, Qing Liu, Yifei Yin, Linghao Du, Da-Yuan Huang, and Jian Zhao. 2022. VibEmoji: Exploring User-authoring Multi-modal Emoticons in Social Communication. CHI Conference on Human Factors in Computing Systems (2022).",
      "doi": ""
    },
    {
      "text": "Toshiki Aoki, Rintaro Chujo, Katsufumi Matsui, Saemi Choi, and Ari Hautasaari. 2022. EmoBalloon - Conveying Emotional Arousal in Text Chats with Speech Balloons. CHI Conference on Human Factors in Computing Systems (2022).",
      "doi": ""
    },
    {
      "text": "Blake E. Ashforth and Ronald H. Humphrey. 1995. Emotion in the Workplace: A Reappraisal. Human Relations 48(1995), 125 – 97.",
      "doi": ""
    },
    {
      "text": "Cezary Biele and Anna Grabowska. 2005. Sex differences in perception of emotion intensity in dynamic and static facial expressions. Experimental Brain Research 171 (2005), 1–6.",
      "doi": ""
    },
    {
      "text": "Silvia Bonaccio, Jane O’Reilly, Sharon L O’Sullivan, and François Chiocchio. 2016. Nonverbal behavior and communication in the workplace: A review and an agenda for research. Journal of Management 42, 5 (2016), 1044–1074.",
      "doi": ""
    },
    {
      "text": "Nathan D. Bos, Judy Olson, Darren Gergle, Gary M. Olson, and Zachary C. Wright. 2002. Effects of four computer-mediated communications channels on trust development. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2002).",
      "doi": "10.1145/503376.503401"
    },
    {
      "text": "Isabelle Boutet, Megan LeBlanc, Justin A. Chamberland, and Charles A. Collin. 2021. Emojis influence emotional communication, social attributions, and information processing. Comput. Hum. Behav. 119(2021), 106722.",
      "doi": "10.1016/j.chb.2021.106722"
    },
    {
      "text": "Danah Boyd and Jeffrey Heer. 2006. Profiles as Conversation: Networked Identity Performance on Friendster. Proceedings of the 39th Annual Hawaii International Conference on System Sciences (HICSS’06) 3(2006), 59c–59c.",
      "doi": "10.1109/HICSS.2006.394"
    },
    {
      "text": "Steven P. Brown, Robert A. Westbrook, and Goutam N. Challagalla. 2005. Good cope, bad cope: adaptive and maladaptive coping strategies following a critical negative work event.The Journal of applied psychology 90 4 (2005), 792–8.",
      "doi": ""
    },
    {
      "text": "Kris Byron. 2008. Carrying too Heavy a Load? The Communication and Miscommunication of Emotion by Email. Academy of Management Review 33 (2008), 309–327.",
      "doi": ""
    },
    {
      "text": "Kris Byron and David C. Baldridge. 2007. E-Mail Recipients’ Impressions of Senders’ Likability. Journal of Business Communication 44 (2007), 137 – 160.",
      "doi": ""
    },
    {
      "text": "Yoonjeong Cha, Jongwon Kim, Sangkeun Park, Mun Yong Yi, and Uichin Lee. 2018. Complex and Ambiguous: Understanding Sticker Misinterpretations in Instant Messaging. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 30 (nov 2018), 22 pages. https://doi.org/10.1145/3274299",
      "doi": "10.1145/3274299"
    },
    {
      "text": "Arik Cheshin, Anat Rafaeli, and Nathan D. Bos. 2011. Anger and happiness in virtual teams: Emotional influences of text and behavior on others’ affect in the absence of non-verbal cues. Organizational Behavior and Human Decision Processes 116 (2011), 2–16.",
      "doi": ""
    },
    {
      "text": "Yunjey Choi, Min-Je Choi, Mun Su Kim, Jung-Woo Ha, Sunghun Kim, and Jaegul Choo. 2018. StarGAN: Unified Generative Adversarial Networks for Multi-domain Image-to-Image Translation. 2018 IEEE/CVF Conference on Computer Vision and Pattern Recognition (2018), 8789–8797.",
      "doi": ""
    },
    {
      "text": "Google Cloud. 2022. Natural Language AI. https://cloud.google.com/natural-language.",
      "doi": ""
    },
    {
      "text": "Deborah A. Coker and Judee K. Burgoon. 1987. The Nature of Conversational Involvement and Nonverbal Encoding Patterns. Human Communication Research 13 (1987), 463–494.",
      "doi": ""
    },
    {
      "text": "Max T. Curran, Jeremy Raboff Gordon, Lily Lin, Priyashri Kamlesh Sridhar, and John C.-I. Chuang. 2019. Understanding Digitally-Mediated Empathy: An Exploration of Visual, Narrative, and Biosensory Informational Cues. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019).",
      "doi": "10.1145/3290605.3300844"
    },
    {
      "text": "Fernando De la Torre and Jeffrey F Cohn. 2011. Facial expression analysis. Visual analysis of humans(2011), 377–409.",
      "doi": ""
    },
    {
      "text": "Chad Edwards, Brett Stoll, Natalie Faculak, and Sandi Karman. 2015. Social presence on LinkedIn: Perceived credibility and interpersonal attractiveness based on user profile picture.",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 1970. Universal facial expressions of emotion.",
      "doi": ""
    },
    {
      "text": "Lisa Elkin, Matthew Kay, James J. Higgins, and Jacob O. Wobbrock. 2021. An Aligned Rank Transform Procedure for Multifactor Contrast Tests. The 34th Annual ACM Symposium on User Interface Software and Technology (2021).",
      "doi": ""
    },
    {
      "text": "Claus-Peter Hermann Ernst and Martin Huschens. 2019. Friendly, Humorous, Incompetent? On the Influence of Emoticons on Interpersonal Perception in the Workplace. In HICSS.",
      "doi": ""
    },
    {
      "text": "Jinjuan Feng, Jonathan Lazar, and Jennifer Preece. 2004. Empathy and online interpersonal trust: A fragile relationship. Behaviour & Information Technology 23 (2004), 106 – 97.",
      "doi": ""
    },
    {
      "text": "Tomomi Fujimura and Hiroyuki Umemura. 2018. Development and validation of a facial expression database based on the dimensional and categorical model of emotions. Cognition and Emotion 32(2018), 1663 – 1670.",
      "doi": ""
    },
    {
      "text": "Tina Ganster, Sabrina C. Eimler, and Nicole C. Krämer. 2012. Same Same But Different!? The Differential Influence of Smilies and Emoticons on Person Perception. Cyberpsychology, behavior and social networking 15 4 (2012), 226–30.",
      "doi": ""
    },
    {
      "text": "Ge Gao, Sun Young Hwang, Gabriel Culbertson, Susan R Fussell, and Malte F Jung. 2017. Beyond information content: The effects of culture on affective grounding in instant messaging conversations. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–18.",
      "doi": "10.1145/3134683"
    },
    {
      "text": "Ella Glikson, Arik Cheshin, and Gerben A van Kleef. 2018. The dark side of a smiley: Effects of smiling emoticons on virtual first impressions. Social Psychological and Personality Science 9, 5 (2018), 614–625.",
      "doi": ""
    },
    {
      "text": "Alicia A Grandey, Glenda M. Fisk, Anna S. Mattila, Karen J. Jansen, and Lori Sideman. 2005. Is “service with a smile” enough? Authenticity of positive displays during service encounters. Organizational Behavior and Human Decision Processes 96 (2005), 38–55.",
      "doi": ""
    },
    {
      "text": "Joshua M. Hailpern, Mark W. Huber, and Ronald Calvo. 2020. How Impactful Is Presentation in Email? The Effect of Avatars and Signatures. ACM Transactions on Interactive Intelligent Systems (TiiS) 10 (2020), 1 – 26.",
      "doi": "10.1145/3345641"
    },
    {
      "text": "Jeffrey T Hancock and Philip J Dunham. 2001. Impression formation in computer-mediated communication revisited: An analysis of the breadth and intensity of impressions. Communication research 28, 3 (2001), 325–347.",
      "doi": ""
    },
    {
      "text": "Mariam Hassib, Daniel Buschek, Paweł W. Woźniak, and Florian Alt. 2017. HeartChat: Heart Rate Augmented Mobile Chat to Support Empathy and Awareness. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017).",
      "doi": "10.1145/3025453.3025758"
    },
    {
      "text": "Ari Hautasaari, Naomi Yamashita, and Ge Gao. 2017. How Non-Native English Speakers Perceive the Emotional Valence of Messages in Text-Based Computer-Mediated Communication. Discourse Processes 56(2017), 24 – 40.",
      "doi": ""
    },
    {
      "text": "Noelle J. Hum, Perrin E. Chamberlin, Brittany L. Hambright, Anne C. Portwood, Amanda C. Schat, and Jennifer L. Bevan. 2011. A picture is worth a thousand words: A content analysis of Facebook profile photographs. Comput. Hum. Behav. 27(2011), 1828–1833.",
      "doi": ""
    },
    {
      "text": "William Ickes. 2005. Empathic Accuracy.",
      "doi": ""
    },
    {
      "text": "L Crystal Jiang, Natalya N Bazarova, and Jeffrey T Hancock. 2013. From perception to behavior: Disclosure reciprocity and the intensification of intimacy in computer-mediated communication. Communication Research 40, 1 (2013), 125–143.",
      "doi": ""
    },
    {
      "text": "Joohee Jun, Myeongul Jung, So yeon Kim, and Kwanguk Kim. 2018. Full-Body Ownership Illusion Can Change Our Emotion. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018).",
      "doi": "10.1145/3173574.3174175"
    },
    {
      "text": "Miyuki G. Kamachi, Vicki Bruce, Shigeru Mukaida, Jiro Gyoba, Sakiko Yoshikawa, and Shigeru Akamatsu. 2013. Dynamic Properties Influence the Perception of Facial Expressions. Perception 30(2013), 875 – 887.",
      "doi": ""
    },
    {
      "text": "Shao kang Lo. 2008. The Nonverbal Communication Functions of Emoticons in Computer-Mediated Communication. Cyberpsychology & behavior : the impact of the Internet, multimedia and virtual reality on behavior and society 11 5 (2008), 595–7.",
      "doi": ""
    },
    {
      "text": "Shipra Kayan, Susan R. Fussell, and Leslie D. Setlock. 2006. Cultural differences in the use of instant messaging in Asia and North America. In CSCW ’06.",
      "doi": ""
    },
    {
      "text": "Pranav Khadpe, Chinmay Kulkarni, and Geoff Kaufman. 2022. Empathosphere: Promoting Constructive Communication in Ad-Hoc Virtual Teams through Perspective-Taking Spaces. Proc. ACM Hum.-Comput. Interact. 6, CSCW1, Article 55 (apr 2022), 26 pages. https://doi.org/10.1145/3512902",
      "doi": "10.1145/3512902"
    },
    {
      "text": "Eva G. Krumhuber, Antony S. R. Manstead, Darren P. Cosker, Dave Marshall, Paul L. Rosin, and Arvid Kappas. 2007. Facial dynamics as indicators of trustworthiness and cooperative behavior.Emotion 7 4(2007), 730–5.",
      "doi": ""
    },
    {
      "text": "J Richard Landis and Gary G. Koch. 1977. The measurement of observer agreement for categorical data.Biometrics 33 1(1977), 159–74.",
      "doi": ""
    },
    {
      "text": "Miki Liu, Austin Wong, Ruhi Pudipeddi, Betty Hou, David Wang, and Gary Hsieh. 2018. ReactionBot: Exploring the Effects of Expression-Triggered Emoji in Text Messages. Proc. ACM Hum. Comput. Interact. 2 (2018), 110:1–110:16.",
      "doi": "10.1145/3274379"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Donghee Yvette Wohn. 2020. \"Talking without A Voice\" : Understanding Non-Verbal Communication in Social Virtual Reality.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, and Paul Johns. 2014. Capturing the mood: facebook and face-to-face encounters in the workplace. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(2014).",
      "doi": "10.1145/2531602.2531673"
    },
    {
      "text": "David Matsumoto and Paul Ekman. 1989. American-Japanese cultural differences in intensity ratings of facial expressions of emotion. Motivation and Emotion 13 (1989), 143–157.",
      "doi": ""
    },
    {
      "text": "Mary L. McHugh. 2012. Interrater reliability: the kappa statistic. Biochemia Medica 22(2012), 276 – 282.",
      "doi": ""
    },
    {
      "text": "Hannah Jean Miller, Jacob Thebault-Spieker, Shuo Chang, Isaac L. Johnson, Loren G. Terveen, and Brent J. Hecht. 2016. \"Blissfully Happy\" or \"Ready toFight\": Varying Interpretations of Emoji. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Saif M Mohammad. 2016. Sentiment analysis: Detecting valence, emotions, and other affectual states from text. In Emotion measurement. Elsevier, 201–237.",
      "doi": ""
    },
    {
      "text": "Philipp Matthias Müller, Michael Xuelin Huang, and Andreas Bulling. 2018. Detecting Low Rapport During Natural Interactions in Small Groups from Non-Verbal Behaviour. 23rd International Conference on Intelligent User Interfaces (2018).",
      "doi": "10.1145/3172944.3172969"
    },
    {
      "text": "Naoto Nakazato, Shigeo Yoshida, Sho Sakurai, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2014. Smart Face: enhancing creativity during video conferences using real-time facial deformation. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(2014).",
      "doi": "10.1145/2531602.2531637"
    },
    {
      "text": "M. J. Newcombe and Neal M. Ashkanasy. 2002. The role of affect and affective congruence in perceptions of leaders: An experimental study.Leadership Quarterly 13(2002), 601–614.",
      "doi": ""
    },
    {
      "text": "Duyen T. Nguyen and Susan R. Fussell. 2012. How did you feel during our conversation?: retrospective analysis of intercultural and same-culture instant messaging conversations. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (2012).",
      "doi": ""
    },
    {
      "text": "Kristine L. Nowak. 2013. Choosing Buddy Icons that look like me or represent my personality: Using Buddy Icons for social presence. Comput. Hum. Behav. 29(2013), 1456–1464.",
      "doi": "10.1016/j.chb.2013.01.027"
    },
    {
      "text": "Kristine L. Nowak and Christian Rauh. 2008. Choose your \"buddy icon\" carefully: The influence of avatar androgyny, anthropomorphism and credibility in online interactions. Comput. Hum. Behav. 24(2008), 1473–1493.",
      "doi": "10.1016/j.chb.2007.05.005"
    },
    {
      "text": "Soo Youn Oh, Jeremy N. Bailenson, Nicole C. Krämer, and Benjamin Li. 2016. Let the Avatar Brighten Your Smile: Effects of Enhancing Facial Expressions in Virtual Environments. PLoS ONE 11(2016).",
      "doi": ""
    },
    {
      "text": "Judith S. Olson and Gary M. Olson. 2000. i2i trust in e-commerce. Commun. ACM 43(2000), 41–44.",
      "doi": "10.1145/355112.355121"
    },
    {
      "text": "Per Persson. 2003. Exms: an animated and avatar-based messaging system for expressive peer communication. In GROUP ’03.",
      "doi": ""
    },
    {
      "text": "M. Ptaszynski, Pawel Dybala, Wenhan Shi, Rafal Rzepka, and Kenji Araki. 2009. A System for Affect Analysis of Utterances in Japanese Supported with Web Mining. Journal of Japan Society for Fuzzy Theory and Intelligent Informatics 21 (2009), 194–213.",
      "doi": ""
    },
    {
      "text": "Pei-Luen Patrick Rau, Ye Li, and Dingjun Li. 2009. Effects of communication style and culture on ability to accept recommendations from robots. Comput. Hum. Behav. 25(2009), 587–595.",
      "doi": "10.1016/j.chb.2008.12.025"
    },
    {
      "text": "James A. Russell. 1980. A circumplex model of affect. Journal of Personality and Social Psychology 39 (1980), 1161–1178.",
      "doi": ""
    },
    {
      "text": "Cristina Segalin, Fabio Celli, Luca Polonio, Michal Kosinski, David Stillwell, N. Sebe, Marco Cristani, and B. Lepri. 2017. What your Facebook Profile Picture Reveals about your Personality. Proceedings of the 25th ACM international conference on Multimedia (2017).",
      "doi": "10.1145/3123266.3123331"
    },
    {
      "text": "Leslie D. Setlock and Susan R. Fussell. 2010. What’s it worth to you?: the costs and affordances of CMC tools to asian and american users. In CSCW ’10.",
      "doi": ""
    },
    {
      "text": "Esha Shandilya, Mingming Fan, and Garreth W. Tigwell. 2022. “I need to be professional until my new team uses emoji, GIFs, or memes first’’: New Collaborators’ Perspectives on Using Non-Textual Communication in Virtual Workspaces. CHI Conference on Human Factors in Computing Systems (2022).",
      "doi": ""
    },
    {
      "text": "Alan L. Sillars and Theodore E. Zorn. 2020. Hypernegative Interpretation of Negatively Perceived Email at Work. Management Communication Quarterly 35 (2020), 171 – 200.",
      "doi": ""
    },
    {
      "text": "Lingxiao Song, Zhihe Lu, Ran He, Zhenan Sun, and Tieniu Tan. 2018. Geometry Guided Adversarial Facial Expression Synthesis. Proceedings of the 26th ACM international conference on Multimedia (2018).",
      "doi": "10.1145/3240508.3240612"
    },
    {
      "text": "Catalina L. Toma. 2010. Perceptions of trustworthiness online: the role of visual and textual information. In CSCW ’10.",
      "doi": ""
    },
    {
      "text": "Fang-Wu Tung and Yi-Shin Deng. 2007. Increasing social presence of social actors in e-learning environments: Effects of dynamic and static emoticons on children. Displays 28(2007), 174–180.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther and Kyle P D’addario. 2001. The impacts of emoticons on message interpretation in computer-mediated communication. Social science computer review 19, 3 (2001), 324–347.",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther and Kyle P. D’Addario. 2001. The Impacts of Emoticons on Message Interpretation in Computer-Mediated Communication. Social Science Computer Review 19 (2001), 324 – 347.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther, Brandon Van Der Heide, Artemio Ramirez, Judee K Burgoon, and Jorge Peña. 2015. Interpersonal and hyperpersonal dimensions of computer-mediated communication. The handbook of the psychology of communication technology 1 (2015), 22.",
      "doi": ""
    },
    {
      "text": "Feng Wang, Suncheng Xiang, Ting Liu, and Yuzhuo Fu. 2021. Attention Based Facial Expression Manipulation. 2021 IEEE International Conference on Multimedia & Expo Workshops (ICMEW) (2021), 1–6.",
      "doi": ""
    },
    {
      "text": "David Keith Westerman, Ron Tamborini, and Nicholas David Bowman. 2015. The effects of static avatars on impression formation across different contexts on social networking sites. Comput. Hum. Behav. 53(2015), 111–117.",
      "doi": "10.1016/j.chb.2015.06.026"
    },
    {
      "text": "Steve Whittaker. 2003. Theories and methods in mediated communication.",
      "doi": ""
    },
    {
      "text": "Steve Whittaker, David Mark Frohlich, and Owen Daly-Jones. 1994. Informal workplace communication: what is it like and how might we support it?. In CHI ’94.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2011).",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Adrienne Wood, Jared D Martin, Martha W. Alibali, and Paula M. Niedenthal. 2019. A sad thumbs up: incongruent gestures and disrupted sensorimotor activity both slow processing of facial expressions. Cognition and Emotion 33(2019), 1196 – 1209.",
      "doi": ""
    },
    {
      "text": "Shigeo Yoshida, Sho Sakurai, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2013. Manipulation of an emotional experience by real-time deformed facial feedback. In Proceedings of the 4th Augmented Human International Conference. 35–42.",
      "doi": "10.1145/2459236.2459243"
    },
    {
      "text": "Dejin Zhao and Mary Beth Rosson. 2009. How and why people Twitter: the role that micro-blogging plays in informal communication at work. In GROUP ’09.",
      "doi": ""
    }
  ]
}