{
  "doi": "10.1145/3544548.3581223",
  "title": "Using Pseudo-Stiffness to Enrich the Haptic Experience in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Providing users with a haptic sensation of the hardness and softness of objects in virtual reality is an open challenge. While physical props and haptic devices help, their haptic properties do not allow for dynamic adjustments. To overcome this limitation, we present a novel technique for changing the perceived stiffness of objects based on a visuo-haptic illusion. We achieved this by manipulating the hands’ Control-to-Display (C/D) ratio in virtual reality while pressing down on an object with fixed stiffness. In the first study (N=12), we determine the detection thresholds of the illusion. Our results show that we can exploit a C/D ratio from 0.7 to 3.5 without user detection. In the second study (N=12), we analyze the illusion’s impact on the perceived stiffness. Our results show that participants perceive the objects to be up to 28.1% softer and 8.9% stiffer, allowing for various haptic applications in virtual reality.",
  "authors": [
    {
      "name": "Yannick Weiss",
      "institution": "LMU Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659332650",
      "orcid": "0000-0003-1125-7963"
    },
    {
      "name": "Steeven Villa",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-99659702395/rel-imgonly/enlarge_steeven.jpg",
      "acmid": "99659702395",
      "orcid": "0000-0002-4881-1350"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    },
    {
      "name": "Sven Mayer",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-99658696530/rel-imgonly/p_mayersven.jpg",
      "acmid": "99658696530",
      "orcid": "0000-0001-5462-8782"
    },
    {
      "name": "Florian Müller",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-81464642529/rel-imgonly/flo_small.jpg",
      "acmid": "81464642529",
      "orcid": "0000-0002-9621-6214"
    }
  ],
  "references": [
    {
      "text": "Muhammad Abdullah, Minji Kim, Waseem Hassan, Yoshihiro Kuroda, and Seokhee Jeon. 2018. HapticDrone: An encountered-type kinesthetic haptic interface with controllable force feedback: Example of stiffness and weight rendering. In 2018 IEEE Haptics Symposium (HAPTICS). IEEE, New York, NY, USA, 334–339. https://doi.org/10.1109/HAPTICS.2018.8357197",
      "doi": ""
    },
    {
      "text": "Parastoo Abtahi and Sean Follmer. 2018. Visuo-Haptic Illusions for Improving the Perceived Performance of Shape Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173724",
      "doi": "10.1145/3173574.3173724"
    },
    {
      "text": "Parastoo Abtahi, Benoit Landry, Jackie (Junrui) Yang, Marco Pavone, Sean Follmer, and James A. Landay. 2019. Beyond The Force: Using Quadcopters to Appropriate Objects and the Environment for Haptics in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300589",
      "doi": "10.1145/3290605.3300589"
    },
    {
      "text": "Adilzhan Adilkhanov, Amir Yelenov, Ramakanth Singal Reddy, Alexander Terekhov, and Zhanat Kappassov. 2020. VibeRo: Vibrotactile Stiffness Perception Interface for Virtual Reality. IEEE Robotics and Automation Letters 5 (2020), 2785–2792.",
      "doi": ""
    },
    {
      "text": "Ferran Argelaguet, David Antonio Gómez Jáuregui, Maud Marchal, and Anatole Lécuyer. 2013. Elastic Images: Perceiving Local Elasticity of Images through a Novel Pseudo-Haptic Deformation Effect. ACM Trans. Appl. Percept. 10, 3, Article 17 (Aug. 2013), 14 pages. https://doi.org/10.1145/2501599",
      "doi": "10.1145/2501599"
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1968–1979. https://doi.org/10.1145/2858036.2858226",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Yuki Ban, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Modifying an Identified Position of Edged Shapes Using Pseudo-Haptic Effects. In Proceedings of the 18th ACM Symposium on Virtual Reality Software and Technology (Toronto, Ontario, Canada) (VRST ’12). Association for Computing Machinery, New York, NY, USA, 93–96. https://doi.org/10.1145/2407336.2407353",
      "doi": "10.1145/2407336.2407353"
    },
    {
      "text": "Yuki Ban, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2014. Displaying Shapes with Various Types of Surfaces Using Visuo-Haptic Interaction. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology (Edinburgh, Scotland) (VRST ’14). Association for Computing Machinery, New York, NY, USA, 191–196. https://doi.org/10.1145/2671015.2671028",
      "doi": "10.1145/2671015.2671028"
    },
    {
      "text": "Wouter M. Bergmann Tiest. 2010. Tactual perception of material properties. Vision Research 50, 24 (2010), 2775–2782. https://doi.org/10.1016/j.visres.2010.10.005 Perception and Action: Part I.",
      "doi": ""
    },
    {
      "text": "Wouter M. Bergmann Tiest and Astrid M. L. Kappers. 2009. Cues for Haptic Perception of Compliance. IEEE Transactions on Haptics 2, 4 (2009), 189–199. https://doi.org/10.1109/TOH.2009.16",
      "doi": "10.1109/TOH.2009.16"
    },
    {
      "text": "Joanna Bergström, Aske Mottelson, and Jarrod Knibbe. 2019. Resized Grasping in VR: Estimating Thresholds for Object Discrimination. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1175–1183. https://doi.org/10.1145/3332165.3347939",
      "doi": "10.1145/3332165.3347939"
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands ‘feel’ touch that eyes see. Nature 391, 6669 (01 Feb 1998), 756–756. https://doi.org/10.1038/35784",
      "doi": ""
    },
    {
      "text": "David E Caballero. 2020. Understanding Interaction: Unraveling the mysteries of the mind using Virtual Reality. Dissertation. University of Washington. http://hdl.handle.net/1773/45427",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D. Wilson. 2017. Sparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive Prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3718–3728. https://doi.org/10.1145/3025453.3025753",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Inrak Choi, Yiwei Zhao, Eric J. Gonzalez, and Sean Follmer. 2021. Augmenting Perceived Softness of Haptic Proxy Objects Through Transient Vibration and Visuo-Haptic Illusion in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 27 (2021), 4387–4400.",
      "doi": "10.1109/TVCG.2020.3002245"
    },
    {
      "text": "Denis Cousineau. 2009. Fitting the three-parameter Weibull distribution: Review and evaluation of existing and new methods. IEEE Transactions on Dielectrics and Electrical Insulation 16, 1 (2009), 281–288. https://doi.org/10.1109/TDEI.2009.4784578",
      "doi": ""
    },
    {
      "text": "Xavier de Tinguy, Claudio Pacchierotti, Maud Marchal, and Anatole Lécuyer. 2018. Enhancing the Stiffness Perception of Tangible Objects in Mixed Reality Using Wearable Haptics. 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR) (2018), 81–90.",
      "doi": ""
    },
    {
      "text": "M. Di Luca, B. Knörlein, M.O. Ernst, and M. Harders. 2011. Effects of visual–haptic asynchronies and loading–unloading movements on compliance perception. Brain Research Bulletin 85, 5 (2011), 245–259. https://doi.org/10.1016/j.brainresbull.2010.02.009 Presence: Brian, Virtual Reality and Robots.",
      "doi": ""
    },
    {
      "text": "Knut Drewing, Andreas Ramisch, and Florian Bayer. 2009. Haptic, visual and visuo-haptic softness judgments for objects with deformable surfaces. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, New York, NY, USA, 640–645. https://doi.org/10.1109/WHC.2009.4810828",
      "doi": "10.1109/WHC.2009.4810828"
    },
    {
      "text": "Frédérique Dupuis, Gisela Sole, Craig Wassinger, Mathieu Bielmann, Laurent J Bouyer, and Jean-Sébastien Roy. 2021. Fatigue, induced via repetitive upper-limb motor tasks, influences trunk and shoulder kinematics during an upper limb reaching task in a virtual reality environment. PLoS One 16, 4 (April 2021), e0249403.",
      "doi": ""
    },
    {
      "text": "Marc O. Ernst and Martin S. Banks. 2002. Humans integrate visual and haptic information in a statistically optimal fashion. Nature 415, 6870 (01 Jan 2002), 429–433. https://doi.org/10.1038/415429a",
      "doi": ""
    },
    {
      "text": "Roberta Etzi, Francesco Ferrise, Monica Bordegoni, Massimiliano Zampini, and Alberto Gallace. 2018. The Effect of Visual and Auditory Information on the Perception of Pleasantness and Roughness of Virtual Surfaces. Multisensory Research 31, 6 (2018), 501–522. https://doi.org/10.1163/22134808-00002603",
      "doi": ""
    },
    {
      "text": "Eric J. Gonzalez, Parastoo Abtahi, and Sean Follmer. 2020. REACH+: Extending the Reachability of Encountered-type Haptics Devices through Dynamic Redirection in VR. Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (2020).",
      "doi": "10.1145/3379337.3415870"
    },
    {
      "text": "H K Graham, James C. McConnell, Georges Limbert, and Michael J. Sherratt. 2019. How stiff is skin?Experimental Dermatology 28 (2019), 4–9.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9 (2006), 904–908. https://doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Ronan Hinchet, Velko Vechev, Herbert Shea, Otmar Hilliges, and Eth Zurich. 2018. DextrES: Wearable Haptic Feedback for Grasping in VR via a Thin Form-Factor Electrostatic Brake. The 31st Annual ACM Symposium on User Interface Software and Technology (2018), 901–912. https://doi.org/10.1145/3242587.3242657",
      "doi": "10.1145/3242587.3242657"
    },
    {
      "text": "Yuichi Hirano, Asako Kimura, Fumihisa Shibata, and Hideyuki Tamura. 2011. Psychophysical influence of mixed-reality visual stimulation on sense of hardness. In 2011 IEEE Virtual Reality Conference. IEEE, New York, NY, USA, 51–54. https://doi.org/10.1109/VR.2011.5759436",
      "doi": "10.1109/VR.2011.5759436"
    },
    {
      "text": "Matthias Hoppe, Pascal Knierim, Thomas Kosch, Markus Funk, Lauren Futami, Stefan Schneegass, Niels Henze, Albrecht Schmidt, and Tonja Machulla. 2018. VRHapticDrones: Providing Haptics in Virtual Reality through Quadcopters. In Proceedings of the 17th International Conference on Mobile and Ubiquitous Multimedia (Cairo, Egypt) (MUM 2018). Association for Computing Machinery, New York, NY, USA, 7–18. https://doi.org/10.1145/3282894.3282898",
      "doi": "10.1145/3282894.3282898"
    },
    {
      "text": "Mohssen Hosseini, Ali Sengül, Yudha Pane, Joris De Schutter, and Herman Bruyninck. 2018. ExoTen-Glove: A Force-Feedback Haptic Glove Based on Twisted String Actuation System. In 2018 27th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, New York, NY, USA, 320–327. https://doi.org/10.1109/ROMAN.2018.8525637",
      "doi": "10.1109/ROMAN.2018.8525637"
    },
    {
      "text": "Russell D. Howard. 1990. Joint and actuator design for enhanced stability in robotic force control. Ph. D. Dissertation. Massachusetts Institute of Technology, Dept. of Aeronautics and Astronautics, 1990.",
      "doi": ""
    },
    {
      "text": "Brent Edward Insko. 2001. Passive Haptics Significantly Enhances Virtual Environments. Ph. D. Dissertation. The University of North Carolina at Chapel Hill. Advisor(s) Brooks, Frederick P. AAI3007820.",
      "doi": ""
    },
    {
      "text": "Lynette A. Jones and Susan J. Lederman. 2006. Human Hand Function. Oxford University Press, Oxford, United Kingdom. https://doi.org/10.1093/acprof:oso/9780195173154.001.0001",
      "doi": ""
    },
    {
      "text": "Semin Kang, Takeshi Okuyama, and Mami Tanaka. 2019. The effect of surface roughness on human stiffness feeling. International Journal of Applied Electromagnetics and Mechanics 59 (2019), 1103–1110. https://doi.org/10.3233/JAE-171028 3.",
      "doi": ""
    },
    {
      "text": "Yuta Kataoka. 2018. Somewhat Strange Feeling of Touching, Lifting, and Swinging in Mixed-Reality Space - Psychophysical Analysis of Haptic Illusion Caused by Visual Superimposition -. In Proceedings of the 2018 ACM Companion International Conference on Interactive Surfaces and Spaces (Tokyo, Japan) (ISS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 13–18. https://doi.org/10.1145/3280295.3281634",
      "doi": "10.1145/3280295.3281634"
    },
    {
      "text": "Takahiro Kawabe. 2020. Mid-Air Action Contributes to Pseudo-Haptic Stiffness Effects. IEEE Transactions on Haptics 13, 1 (2020), 18–24. https://doi.org/10.1109/TOH.2019.2961883",
      "doi": "10.1109/TOH.2019.2961883"
    },
    {
      "text": "Roberta L. Klatzky and Bing Wu. 2014. Visual-Haptic Compliance Perception. Springer London, London, 17–30. https://doi.org/10.1007/978-1-4471-6533-0_2",
      "doi": ""
    },
    {
      "text": "Arata Kokubun, Yuki Ban, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2013. ARAtouch: Visuo-Haptic Interaction with Mobile Rear Touch Interface. In SIGGRAPH Asia 2013 Emerging Technologies (Hong Kong, Hong Kong) (SA ’13). Association for Computing Machinery, New York, NY, USA, Article 2, 3 pages. https://doi.org/10.1145/2542284.2542286",
      "doi": "10.1145/2542284.2542286"
    },
    {
      "text": "Anatole Lécuyer, Jean-Marie Burkhardt, and Laurent Etienne. 2004. Feeling Bumps and Holes without a Haptic Interface: The Perception of Pseudo-Haptic Textures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vienna, Austria) (CHI ’04). Association for Computing Machinery, New York, NY, USA, 239–246. https://doi.org/10.1145/985692.985723",
      "doi": "10.1145/985692.985723"
    },
    {
      "text": "A. Lecuyer, S. Coquillart, A. Kheddar, P. Richard, and P. Coiffet. 2000. Pseudo-haptic feedback: can isometric input devices simulate force feedback?. In Proceedings IEEE Virtual Reality 2000 (Cat. No.00CB37048). IEEE, New York, NY, USA, 83–90. https://doi.org/10.1109/VR.2000.840369",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 1987. Hand movements: A window into haptic object recognition. Cognitive Psychology 19, 3 (1987), 342–368. https://doi.org/10.1016/0010-0285(87)90008-9",
      "doi": ""
    },
    {
      "text": "Lorraine Lin and Sophie Jörg. 2016. Need a Hand? How Appearance Affects the Virtual Hand Illusion. In Proceedings of the ACM Symposium on Applied Perception (Anaheim, California) (SAP ’16). Association for Computing Machinery, New York, NY, USA, 69–76. https://doi.org/10.1145/2931002.2931006",
      "doi": "10.1145/2931002.2931006"
    },
    {
      "text": "Andualem Tadesse Maereg, Atulya Nagar, David Reid, and Emanuele L. Secco. 2017. Wearable Vibrotactile Haptic Device for Stiffness Discrimination during Virtual Interactions. Frontiers in Robotics and AI 4 (2017). https://doi.org/10.3389/frobt.2017.00042",
      "doi": ""
    },
    {
      "text": "Steven Martin and Nick Hillier. 2009. Characterisation of the Novint Falcon haptic device for application as a robot manipulator. In Australasian Conference on Robotics and Automation (ACRA). Citeseer, Australian Robotics and Automation Association, Sydney, Australia, 291–292.",
      "doi": ""
    },
    {
      "text": "Valerie Morash, Allison Connell Pensky, and Joshua Miele. 2013. Effects of Using Multiple Hands and Fingers on Haptic Performance. Perception 42 (12 2013), 759–77. https://doi.org/10.1068/p7443",
      "doi": ""
    },
    {
      "text": "Can Ozay and Melih Soner Celiktas. 2016. Statistical analysis of wind speed using two-parameter Weibull distribution in Alaçatı region. Energy Conversion and Management 121 (2016), 49–54. https://doi.org/10.1016/j.enconman.2016.05.026",
      "doi": ""
    },
    {
      "text": "P. S. D. Patel, Duncan E. T. Shepherd, and David W. L. Hukins. 2008. Compressive properties of commercially available polyurethane foams as mechanical models for osteoporotic human cancellous bone. BMC Musculoskeletal Disorders 9 (2008), 137–137.",
      "doi": ""
    },
    {
      "text": "Sai Akhil Penumudi, Veera Aneesh Kuppam, Jeong Ho Kim, and Jaejin Hwang. 2020. The effects of target location on musculoskeletal load, task performance, and subjective discomfort during virtual reality interactions. Applied Ergonomics 84 (2020), 103010. https://doi.org/10.1016/j.apergo.2019.103010",
      "doi": ""
    },
    {
      "text": "Dario Pittera, Elia Gatti, and Marianna Obrist. 2019. I’m Sensing in the Rain: Spatial Incongruity in Visual-Tactile Mid-Air Stimulation Can Elicit Ownership in VR Users. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300362",
      "doi": "10.1145/3290605.3300362"
    },
    {
      "text": "Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. 2015. SoftAR: Visually Manipulating Haptic Softness Perception in Spatial Augmented Reality. IEEE Transactions on Visualization and Computer Graphics 21, 11 (2015), 1279–1288. https://doi.org/10.1109/TVCG.2015.2459792",
      "doi": "10.1109/TVCG.2015.2459792"
    },
    {
      "text": "Zhan Fan Quek, Samuel B. Schorr, Ilana Nisky, Allison M. Okamura, and William R. Provancher. 2013. Sensory augmentation of stiffness using fingerpad skin stretch. In 2013 World Haptics Conference (WHC). IEEE, New York, NY, USA, 467–472. https://doi.org/10.1109/WHC.2013.6548453",
      "doi": ""
    },
    {
      "text": "Zhan Fan Quek, Samuel B. Schorr, Ilana Nisky, Allison M. Okamura, and William R. Provancher. 2014. Augmentation Of Stiffness Perception With a 1-Degree-of-Freedom Skin Stretch Device. IEEE Transactions on Human-Machine Systems 44, 6 (2014), 731–742. https://doi.org/10.1109/THMS.2014.2348865",
      "doi": ""
    },
    {
      "text": "Ismo Rakkolainen, Antti Sand, and Roope Raisamo. 2019. A Survey of Mid-Air Ultrasonic Tactile Feedback. In 2019 IEEE International Symposium on Multimedia (ISM). IEEE, New York, NY, USA, 94–944. https://doi.org/10.1109/ISM46123.2019.00022",
      "doi": ""
    },
    {
      "text": "Sharif Razzaque, Zachariah Kohn, and Mary C. Whitton. 2001. Redirected Walking. In Eurographics 2001 - Short Presentations. Eurographics Association, Eindhoven, The Netherlands. https://doi.org/10.2312/egs.20011036",
      "doi": ""
    },
    {
      "text": "Sicong Ren, Duo Wai-Chi Wong, Hui Yang, Yan Zhou, Jin Lin, and Ming Zhang. 2016. Effect of pillow height on the biomechanics of the head-neck complex: investigation of the cranio-cervical pressure and cervical spine alignment. PeerJ 4 (2016).",
      "doi": ""
    },
    {
      "text": "Steeven Villa Salazar, Claudio Pacchierotti, Xavier de Tinguy, Anderson Maciel, and Maud Marchal. 2020. Altering the Stiffness, Friction, and Shape Perception of Tangible Objects in Virtual Reality Using Wearable Haptics. IEEE Transactions on Haptics 13 (2020), 167–174.",
      "doi": "10.1109/TOH.2020.2967389"
    },
    {
      "text": "Majed Samad, Elia Gatti, Anne Hermes, Hrvoje Benko, and Cesare Parise. 2019. Pseudo-Haptic Weight: Changing the Perceived Weight of Virtual Objects By Manipulating Control-Display Ratio. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300550",
      "doi": "10.1145/3290605.3300550"
    },
    {
      "text": "Samuel Benjamin Schorr and Allison M. Okamura. 2017. Three-Dimensional Skin Deformation as Force Substitution: Wearable Device Design and Performance During Haptic Exploration of Virtual Environments. IEEE Transactions on Haptics 10, 3 (2017), 418–430. https://doi.org/10.1109/TOH.2017.2672969",
      "doi": "10.1109/TOH.2017.2672969"
    },
    {
      "text": "Samuel B. Schorr, Zhan Fan Quek, Robert Y. Romano, Ilana Nisky, William R. Provancher, and Allison M. Okamura. 2013. Sensory substitution via cutaneous skin stretch feedback. In 2013 IEEE International Conference on Robotics and Automation. IEEE, New York, NY, USA, 2341–2346. https://doi.org/10.1109/ICRA.2013.6630894",
      "doi": ""
    },
    {
      "text": "Valentin Schwind, Lorraine Lin, Massimiliano Di Luca, Sophie Jörg, and James Hillis. 2018. Touch with Foreign Hands: The Effect of Virtual Hand Appearance on Visual-Haptic Integration. In Proceedings of the 15th ACM Symposium on Applied Perception (Vancouver, British Columbia, Canada) (SAP ’18). Association for Computing Machinery, New York, NY, USA, Article 9, 8 pages. https://doi.org/10.1145/3225153.3225158",
      "doi": "10.1145/3225153.3225158"
    },
    {
      "text": "M. A. Srinivasan, G. L. Beauregard, and D. L. Brock. 1996. The impact of visual information on the haptic perception of stiffness in virtual environments. In Proceedings of the ASME Dynamics Systems and Control Division, Vol. 58. American Society of Mechanical Engineers, New York, NY, USA, 555–559.",
      "doi": ""
    },
    {
      "text": "M. A. Srinivasan and R. H. LaMotte. 1995. Tactual discrimination of softness. Journal of Neurophysiology 73, 1 (1995), 88–101. https://doi.org/10.1152/jn.1995.73.1.88 arXiv:https://doi.org/10.1152/jn.1995.73.1.88PMID: 7714593.",
      "doi": ""
    },
    {
      "text": "Andrew A. Stanley, James C. Gwilliam, and Allison M. Okamura. 2013. Haptic jamming: A deformable geometry, variable stiffness tactile display using pneumatics and particle jamming. 2013 World Haptics Conference (WHC) (2013), 25–30.",
      "doi": ""
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2010. Estimation of detection thresholds for redirected walking techniques. IEEE transactions on visualization and computer graphics 16, 1 (2010), 17–27. https://doi.org/10.1109/TVCG.2009.62",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Aishwari Talhan and Seokhee Jeon. 2018. Pneumatic Actuation in Haptic-Enabled Medical Simulators: A Review. IEEE Access 6 (2018), 3184–3200.",
      "doi": ""
    },
    {
      "text": "Yujie Tao, Shan-Yuan Teng, and Pedro Lopes. 2021. Altering Perceived Softness of Real Rigid Objects by Restricting Fingerpad Deformation. The 34th Annual ACM Symposium on User Interface Software and Technology (2021).",
      "doi": "10.1145/3472749.3474800"
    },
    {
      "text": "Shan-Yuan Teng, Tzu-Sheng Kuo, Chi Wang, Chi-huan Chiang, Da-Yuan Huang, Liwei Chan, and Bing-Yu Chen. 2018. PuPoP: Pop-up Prop on Palm for Virtual Reality. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 5–17. https://doi.org/10.1145/3242587.3242628",
      "doi": "10.1145/3242587.3242628"
    },
    {
      "text": "R J van Beers, A C Sittig, and J J Denier van der Gon. 1998. The precision of proprioceptive position sense. Exp. Brain Res. 122, 4 (Oct. 1998), 367–377.",
      "doi": ""
    },
    {
      "text": "Yon Visell, Keerthi Adithya Duraikkannan, and Vincent Hayward. 2014. A Device and Method for Multimodal Haptic Rendering of Volumetric Stiffness. In EuroHaptics. Springer, Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "Yon Visell, Bruno L. Giordano, Guillaume Millet, and Jeremy R. Cooperstock. 2011. Vibration Influences Haptic Perception of Surface Compliance During Walking. PLOS ONE 6, 3 (03 2011), 1–11. https://doi.org/10.1371/journal.pone.0017697",
      "doi": ""
    },
    {
      "text": "J P Wann and S F Ibrahim. 1992. Does limb proprioception drift?Exp. Brain Res. 91, 1 (1992), 162–166.",
      "doi": ""
    },
    {
      "text": "Waloddi Weibull. 1951. A statistical distribution function of wide applicability. Journal of applied mechanics (1951). https://doi.org/10.1115/1.4010337",
      "doi": ""
    },
    {
      "text": "Michael White, James Gain, Ulysse Vimont, and Daniel Lochner. 2019. The Case for Haptic Props: Shape, Weight and Vibro-Tactile Feedback. In Motion, Interaction and Games (Newcastle upon Tyne, United Kingdom) (MIG ’19). Association for Computing Machinery, New York, NY, USA, Article 7, 10 pages. https://doi.org/10.1145/3359566.3360058",
      "doi": "10.1145/3359566.3360058"
    },
    {
      "text": "Felix A. Wichmann and N. Jeremy Hill. 2001. The psychometric function: I. Fitting, sampling, and goodness of fit. Perception & Psychophysics 63, 8 (01 Nov 2001), 1293–1313. https://doi.org/10.3758/BF03194544",
      "doi": ""
    },
    {
      "text": "Katrin Wolf and Timm Bäder. 2015. Illusion of Surface Changes Induced by Tactile and Visual Touch Feedback. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 1355–1360. https://doi.org/10.1145/2702613.2732703",
      "doi": "10.1145/2702613.2732703"
    },
    {
      "text": "Bing Wu, Sung Hun Sim, Andinet Enquobahrie, and Ricardo Ortiz. 2015. Effects of visual latency on visual-haptic experience of stiffness. In 2015 Seventh International Workshop on Quality of Multimedia Experience (QoMEX). IEEE, New York, NY, USA, 1–6. https://doi.org/10.1109/QoMEX.2015.7148129",
      "doi": ""
    },
    {
      "text": "Vibol Yem and Hiroyuki Kajimoto. 2018. A Fingertip Glove with Motor Rotational Acceleration Enables Stiffness Perception When Grasping a Virtual Object. In Human Interface and the Management of Information. Interaction, Visualization, and Analytics, Sakae Yamamoto and Hirohiko Mori (Eds.). Springer International Publishing, Cham, 463–473.",
      "doi": ""
    },
    {
      "text": "André Zenner and Antonio Krüger. 2019. Estimating Detection Thresholds for Desktop-Scale Hand Redirection in Virtual Reality. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, New York, NY, USA, 47–55. https://doi.org/10.1109/VR.2019.8798143",
      "doi": ""
    },
    {
      "text": "Igor Zubrycki and Grzegorz Granosik. 2016. Novel Haptic Device Using Jamming Principle for Providing Kinaesthetic Feedback in Glove-Based Control Interface. Journal of Intelligent and Robotic Systems: Theory and Applications 85, 3-4 (2016), 413–429. https://doi.org/10.1007/s10846-016-0392-6",
      "doi": "10.1007/s10846-016-0392-6"
    }
  ]
}