{
  "doi": "10.1145/3544548.3581513",
  "title": "“If I Had All the Time in the World”: Ophthalmologists’ Perceptions of Anchoring Bias Mitigation in Clinical AI Support",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Clinical needs and technological advances have resulted in increased use of Artificial Intelligence (AI) in clinical decision support. However, such support can introduce new and amplify existing cognitive biases. Through contextual inquiry and interviews, we set out to understand the use of an existing AI support system by ophthalmologists. We identified concerns regarding anchoring bias and a misunderstanding of the AI’s capabilities. Following, we evaluated clinicians’ perceptions of three bias mitigation strategies as integrated into their existing decision support system. While clinicians recognised the danger of anchoring bias, we identified a concern around the impact of bias mitigation on procedure time. Our participants were divided in their expectations of any positive impact on diagnostic accuracy, stemming from varying reliance on the decision support. Our results provide insights into the challenges of integrating bias mitigation into AI decision support.",
  "tags": [
    "bias mitigation",
    "anchoring bias",
    "Cognitive bias",
    "decision support",
    "artificial intelligence",
    "AI support",
    "DSS",
    "CDSS",
    "ophthalmology"
  ],
  "authors": [
    {
      "name": "Anne Kathrine Petersen Bach",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782176",
      "orcid": "0000-0003-3396-5944"
    },
    {
      "name": "Trine Munch Nørgaard",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778877",
      "orcid": "0000-0001-6274-3238"
    },
    {
      "name": "Jens Christian Brok",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780116",
      "orcid": "0000-0002-5719-9036"
    },
    {
      "name": "Niels van Berkel",
      "institution": "Department of Computer Science, Aalborg University, Denmark",
      "img": "/do/10.1145/contrib-99658743711/rel-imgonly/niels_van_berkel_2022.jpg",
      "acmid": "99658743711",
      "orcid": "0000-0001-5106-7692"
    }
  ],
  "references": [
    {
      "text": "Michael D. Abràmoff, Philip T. Lavin, Michele Birch, Nilay Shah, and James C. Folk. 2018. Pivotal trial of an autonomous AI-based diagnostic system for detection of diabetic retinopathy in primary care offices. npj Digital Medicine 1, 1 (2018), 39. https://doi.org/10.1038/s41746-018-0040-6",
      "doi": ""
    },
    {
      "text": "Bradley J Adame. 2016. Training in the mitigation of anchoring bias: A test of the consider-the-opposite strategy. Learning and Motivation 53 (2016), 36–48. https://doi.org/10.1016/j.lmot.2015.11.002",
      "doi": ""
    },
    {
      "text": "M. Usman Akram, Anam Tariq, Shoab A. Khan, and M. Younus Javed. 2014. Automated detection of exudates and macula for grading of diabetic macular edema. Computer Methods and Programs in Biomedicine 114, 2(2014), 141–152. https://doi.org/10.1016/j.cmpb.2014.01.010",
      "doi": "10.1016/j.cmpb.2014.01.010"
    },
    {
      "text": "Niels-Bjørn Albinus. 2021. Antallet af øjenpatienter er eksploderet på 15 år. https://dagensmedicin.dk/antallet-af-oejenpatienter-er-eksploderet-paa-15-aar/",
      "doi": ""
    },
    {
      "text": "Emma Beede, Elizabeth Baylor, Fred Hersch, Anna Iurchenko, Lauren Wilcox, Paisan Ruamviboonsuk, and Laura M. Vardoulakis. 2020. A Human-Centered Evaluation of a Deep Learning System Deployed in Clinics for the Detection of Diabetic Retinopathy. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376718",
      "doi": "10.1145/3313831.3376718"
    },
    {
      "text": "Astrid Bertrand, Rafik Belloum, James R. Eagan, and Winston Maxwell. 2022. How Cognitive Biases Affect XAI-Assisted Decision-Making: A Systematic Review. In Proceedings of the 2022 AAAI/ACM Conference on AI, Ethics, and Society (Oxford, United Kingdom) (AIES ’22). Association for Computing Machinery, New York, NY, USA, 78–91. https://doi.org/10.1145/3514094.3534164",
      "doi": "10.1145/3514094.3534164"
    },
    {
      "text": "Virginia Braun, Victoria Clarke, Nikki Hayfield, and Gareth Terry. 2019. Thematic Analysis. Springer Singapore, Singapore, 843–860. https://doi.org/10.1007/978-981-10-5251-4_103",
      "doi": ""
    },
    {
      "text": "F. Cabitza and J. D. Zeitoun. 2019. The proof of the pudding: in praise of a culture of real-world validation for medical artificial intelligence. Annals of Translational Medicine 7, 8 (2019), 161. https://doi.org/10.21037/atm.2019.04.07",
      "doi": ""
    },
    {
      "text": "Carrie J. Cai, Emily Reif, Narayan Hegde, Jason Hipp, Been Kim, Daniel Smilkov, Martin Wattenberg, Fernanda Viegas, Greg S. Corrado, Martin C. Stumpe, and Michael Terry. 2019. Human-Centered Tools for Coping with Imperfect Algorithms During Medical Decision-Making. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300234",
      "doi": "10.1145/3290605.3300234"
    },
    {
      "text": "Carrie J. Cai, Samantha Winter, David Steiner, Lauren Wilcox, and Michael Terry. 2019. \"Hello AI\": Uncovering the Onboarding Needs of Medical Practitioners for Human-AI Collaborative Decision-Making. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 104(2019), 24 pages. https://doi.org/10.1145/3359206",
      "doi": "10.1145/3359206"
    },
    {
      "text": "Parag S. Chandakkar, Ragav Venkatesan, Baoxin Li, and Helen K. Li. 2012. A Machine-Learning Approach to Retrieving Diabetic Retinopathy Images. In Proceedings of the ACM Conference on Bioinformatics, Computational Biology and Biomedicine(BCB ’12). Association for Computing Machinery, New York, NY, USA, 588–589. https://doi.org/10.1145/2382936.2383030",
      "doi": "10.1145/2382936.2383030"
    },
    {
      "text": "P. Croskerry. 2013. From mindless to mindful practice–cognitive bias and clinical decision making. The New England Journal of Medicine 368, 26 (2013), 2445–2448. https://doi.org/10.1056/NEJMp1303712",
      "doi": ""
    },
    {
      "text": "Tilman Dingler, Benjamin Tag, David A. Eccles, Niels van Berkel, and Vassilis Kostakos. 2022. Method for Appropriating the Brief Implicit Association Test to Elicit Biases in Users. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 243, 16 pages. https://doi.org/10.1145/3491102.3517570",
      "doi": "10.1145/3491102.3517570"
    },
    {
      "text": "Jessica Maria Echterhoff, Matin Yarmand, and Julian McAuley. 2022. AI-Moderated Decision-Making: Capturing and Balancing Anchoring Bias in Sequential Decision Tasks. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 161, 9 pages. https://doi.org/10.1145/3491102.3517443",
      "doi": "10.1145/3491102.3517443"
    },
    {
      "text": "Riccardo Fogliato, Shreya Chappidi, Matthew Lungren, Paul Fisher, Diane Wilson, Michael Fitzke, Mark Parkinson, Eric Horvitz, Kori Inkpen, and Besmira Nushi. 2022. Who Goes First? Influences of Human-AI Workflow on Decision Making in Clinical Imaging. In 2022 ACM Conference on Fairness, Accountability, and Transparency(FAccT ’22). Association for Computing Machinery, New York, NY, USA, 1362–1374. https://doi.org/10.1145/3531146.3533193",
      "doi": "10.1145/3531146.3533193"
    },
    {
      "text": "Adrian Furnham and Hua Chu Boo. 2011. A literature review of the anchoring effect. The Journal of Socio-Economics 40, 1 (2011), 35–42. https://doi.org/10.1016/j.socec.2010.10.008",
      "doi": ""
    },
    {
      "text": "Mingkun Gao, Hyo Jin Do, and Wai-Tat Fu. 2018. Burst Your Bubble! An Intelligent System for Improving Awareness of Diverse Social Opinions. In 23rd International Conference on Intelligent User Interfaces (Tokyo, Japan) (IUI ’18). Association for Computing Machinery, New York, NY, USA, 371–383. https://doi.org/10.1145/3172944.3172970",
      "doi": "10.1145/3172944.3172970"
    },
    {
      "text": "James Kang Hao Goh, Carol Y. Cheung, Shaun Sebastian Sim, Pok Chien Tan, Gavin Siew Wei Tan, and Tien Yin Wong. 2016. Retinal Imaging Techniques for Diabetic Retinopathy Screening. Journal of Diabetes Science and Technology 10, 2 (2016), 282–294. https://doi.org/10.1177/1932296816629491",
      "doi": ""
    },
    {
      "text": "Ninel Z Gregori. 2021. Diabetic Retinopathy: Causes, Symptoms, Treatment. https://www.aao.org/eye-health/diseases/what-is-diabetic-retinopathy",
      "doi": ""
    },
    {
      "text": "Jerome E Groopman. 2007. How doctors think. Vol. 82. Houghton Mifflin Boston.",
      "doi": ""
    },
    {
      "text": "Andrzej Grzybowski, Piotr Brona, Gilbert Lim, Paisan Ruamviboonsuk, Gavin S. W. Tan, Michael Abramoff, and Daniel S. W. Ting. 2020. Artificial intelligence for diabetic retinopathy screening: a review. Eye 34, 3 (01 Mar 2020), 451–460. https://doi.org/10.1038/s41433-019-0566-0",
      "doi": ""
    },
    {
      "text": "Varun Gulshan, Lily Peng, Marc Coram, Martin C. Stumpe, Derek Wu, Arunachalam Narayanaswamy, Subhashini Venugopalan, Kasumi Widner, Tom Madams, Jorge Cuadros, Ramasamy Kim, Rajiv Raman, Philip C. Nelson, Jessica L. Mega, and Dale R. Webster. 2016. Development and Validation of a Deep Learning Algorithm for Detection of Diabetic Retinopathy in Retinal Fundus Photographs. JAMA 316, 22 (2016), 2402–2410. https://doi.org/10.1001/jama.2016.17216",
      "doi": ""
    },
    {
      "text": "H. W. Horowitz, C. Behar, and J. Greene. 2021. COVID-19 and the Consequences of Anchoring Bias. Emerging Infectious Diseases 27, 8 (2021), 2235–2236. https://doi.org/10.3201/eid2708.211107",
      "doi": ""
    },
    {
      "text": "Ozan Isler, Onurcan Yilmaz, and Burak Dogruyol. 2020. Activating reflective thinking with decision justification and debiasing training. Judgment and Decision Making 15, 6 (2020), 926–938.",
      "doi": ""
    },
    {
      "text": "Fei Jiang, Yong Jiang, Hui Zhi, Yi Dong, Hao Li, Sufeng Ma, Yilong Wang, Qiang Dong, Haipeng Shen, and Yongjun Wang. 2017. Artificial intelligence in healthcare: past, present and future. Stroke and Vascular Neurology 2, 4 (2017), 230–243. https://doi.org/10.1136/svn-2017-000101",
      "doi": ""
    },
    {
      "text": "Eunkyung Jo, Myeonghan Ryu, Georgia Kenderova, Samuel So, Bryan Shapiro, Alexandra Papoutsaki, and Daniel A. Epstein. 2022. Designing Flexible Longitudinal Regimens: Supporting Clinician Planning for Discontinuation of Psychiatric Drugs. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 352, 17 pages. https://doi.org/10.1145/3491102.3502206",
      "doi": "10.1145/3491102.3502206"
    },
    {
      "text": "Rahul Kapoor, Stephen P. Walters, and Lama A. Al-Aswad. 2019. The current state of artificial intelligence in ophthalmology. Survey of Ophthalmology 64, 2 (2019), 233–240. https://doi.org/10.1016/j.survophthal.2018.09.002",
      "doi": ""
    },
    {
      "text": "J. E. H. Korteling, J. Y. J. Gerritsma, and A. Toet. 2021. Retention and Transfer of Cognitive Bias Mitigation Interventions: A Systematic Literature Study. Front Psychol 12(2021), 629354.",
      "doi": ""
    },
    {
      "text": "Clemens Scott Kruse and Nolan Ehrbar. 2020. Effects of computerized decision support systems on practitioner performance and patient outcomes: systematic review. JMIR Medical Informatics 8, 8 (2020), e17283.",
      "doi": ""
    },
    {
      "text": "Kathryn Ann Lambe, Gary O’Reilly, Brendan D Kelly, and Sarah Curristan. 2016. Dual-process cognitive interventions to enhance diagnostic reasoning: a systematic review. BMJ Quality & Safety 25, 10 (2016), 808–820. https://doi.org/10.1136/bmjqs-2015-004417",
      "doi": ""
    },
    {
      "text": "Min Hun Lee, Daniel P. Siewiorek, Asim Smailagic, Alexandre Bernardino, and Sergi Bermúdez i Badia. 2021. A Human-AI Collaborative Approach for Clinical Decision Making on Rehabilitation Assessment. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 392, 14 pages. https://doi.org/10.1145/3411764.3445472",
      "doi": "10.1145/3411764.3445472"
    },
    {
      "text": "Falk Lieder, Thomas L. Griffiths, Quentin J. M. Huys, and Noah D. Goodman. 2018. The anchoring bias reflects rational use of cognitive resources. Psychonomic Bulletin & Review 25, 1 (2018), 322–349. https://doi.org/10.3758/s13423-017-1286-8",
      "doi": ""
    },
    {
      "text": "Geoffrey K Lighthall and Cristina Vazquez-Guillamet. 2015. Understanding decision making in critical care. Clinical Medicine & Research 13, 3-4 (2015), 156–168. https://doi.org/10.3121/cmr.2015.1289",
      "doi": ""
    },
    {
      "text": "Scott O. Lilienfeld and Steven Jay Lynn. 2014. Errors/Biases in Clinical Decision Making. John Wiley & Sons, Ltd, 1–9. https://doi.org/10.1002/9781118625392.wbecp567",
      "doi": ""
    },
    {
      "text": "Jesper Molin, Paweł W. Woźniak, Claes Lundström, Darren Treanor, and Morten Fjeld. 2016. Understanding Design for Automated Image Analysis in Digital Pathology. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction(NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 58, 10 pages. https://doi.org/10.1145/2971485.2971561",
      "doi": "10.1145/2971485.2971561"
    },
    {
      "text": "Carey K. Morewedge, Haewon Yoon, Irene Scopelliti, Carl W. Symborski, James H. Korris, and Karim S. Kassam. 2015. Debiasing Decisions: Improved Decision Making With a Single Training Intervention. Policy Insights from the Behavioral and Brain Sciences 2, 1 (2015), 129–140. https://doi.org/10.1177/2372732215600886",
      "doi": ""
    },
    {
      "text": "Thomas Mussweiler, Fritz Strack, and Tim Pfeiffer. 2000. Overcoming the inevitable anchoring effect: Considering the opposite compensates for selective accessibility. Personality and Social Psychology Bulletin 26, 9 (2000), 1142–1150.",
      "doi": ""
    },
    {
      "text": "Quang H. Nguyen, Ramasamy Muthuraman, Laxman Singh, Gopa Sen, Anh Cuong Tran, Binh P. Nguyen, and Matthew Chua. 2020. Diabetic Retinopathy Detection Using Deep Learning. In Proceedings of the 4th International Conference on Machine Learning and Soft Computing(ICMLSC 2020). Association for Computing Machinery, New York, NY, USA, 103–107. https://doi.org/10.1145/3380688.3380709",
      "doi": "10.1145/3380688.3380709"
    },
    {
      "text": "NHS. 2021. Stages, Diabetic Retinopathy. https://www.nhs.uk/conditions/diabetic-retinopathy/stages/",
      "doi": ""
    },
    {
      "text": "Meindert Niemeijer, Bram van Ginneken, Stephen R. Russell, Maria S. A. Suttorp-Schulten, and Michael D. Abràmoff. 2007. Automated Detection and Differentiation of Drusen, Exudates, and Cotton-Wool Spots in Digital Color Fundus Photographs for Diabetic Retinopathy Diagnosis. Investigative Ophthalmology & Visual Science 48, 5 (2007), 2260–2267. https://doi.org/10.1167/iovs.06-0996",
      "doi": ""
    },
    {
      "text": "G. R. Norman, S. D. Monteiro, J. Sherbino, J. S. Ilgen, H. G. Schmidt, and S. Mamede. 2017. The Causes of Errors in Clinical Reasoning: Cognitive Biases, Knowledge Deficits, and Dual Process Thinking. Academic Medicine 92, 1 (2017), 23–30.",
      "doi": ""
    },
    {
      "text": "Mahsan Nourani, Chiradeep Roy, Jeremy E Block, Donald R Honeycutt, Tahrima Rahman, Eric Ragan, and Vibhav Gogate. 2021. Anchoring Bias Affects Mental Model Formation and User Reliance in Explainable AI Systems. In 26th International Conference on Intelligent User Interfaces(IUI ’21). Association for Computing Machinery, New York, NY, USA, 340–350. https://doi.org/10.1145/3397481.3450639",
      "doi": "10.1145/3397481.3450639"
    },
    {
      "text": "Magnus Heunicke (Minister of Health and the Elderly). 2020. Question 54. The Danish Parliament(2020). https://www.ft.dk/samling/20201/almdel/SUU/spm/54/svar/1706109/index.htm",
      "doi": ""
    },
    {
      "text": "Alexis R. Ogdie, James B. Reilly, Wyki G. Pang, Shimrit Keddem, Frances K. Barg, Joan M. Von Feldt, and Jennifer S. Myers. 2012. Seen Through Their Eyes: Residents’ Reflections on the Cognitive and Contextual Components of Diagnostic Errors in Medicine. Academic Medicine 87, 10 (2012). https://doi.org/10.1097/ACM.0b013e31826742c9",
      "doi": ""
    },
    {
      "text": "ED O’Sullivan and SJ Schofield. 2018. Cognitive Bias in Clinical Medicine. Journal of the Royal College of Physicians of Edinburgh 48, 3 (2018), 225–232. https://doi.org/10.4997/jrcpe.2018.306",
      "doi": ""
    },
    {
      "text": "David Piorkowski, Soya Park, April Yi Wang, Dakuo Wang, Michael Muller, and Felix Portnoy. 2021. How AI Developers Overcome Communication Challenges in a Multidisciplinary Team: A Case Study. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 131 (2021), 25 pages. https://doi.org/10.1145/3449205",
      "doi": "10.1145/3449205"
    },
    {
      "text": "Henning Pohl, Andreea Muresan, and Kasper Hornbæk. 2019. Charting Subtle Interaction in the HCI Literature. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300648",
      "doi": "10.1145/3290605.3300648"
    },
    {
      "text": "Charvi Rastogi, Yunfeng Zhang, Dennis Wei, Kush R. Varshney, Amit Dhurandhar, and Richard Tomsett. 2022. Deciding Fast and Slow: The Role of Cognitive Biases in AI-Assisted Decision-Making. Proc. ACM Hum.-Comput. Interact. 6, CSCW1, Article 83(2022), 22 pages. https://doi.org/10.1145/3512930",
      "doi": "10.1145/3512930"
    },
    {
      "text": "Alisa Rieger, Tim Draws, Mariët Theune, and Nava Tintarev. 2021. This Item Might Reinforce Your Opinion: Obfuscation and Labeling of Search Results to Mitigate Confirmation Bias. In Proceedings of the 32nd ACM Conference on Hypertext and Social Media(HT ’21). Association for Computing Machinery, New York, NY, USA, 189–199. https://doi.org/10.1145/3465336.3475101",
      "doi": "10.1145/3465336.3475101"
    },
    {
      "text": "Abhijit Guha Roy, Sailesh Conjeti, Sri Phani Krishna Karri, Debdoot Sheet, Amin Katouzian, Christian Wachinger, and Nassir Navab. 2017. ReLayNet: retinal layer and fluid segmentation of macular optical coherence tomography using fully convolutional networks. Biomedical Optics Express 8, 8 (2017), 3627–3642. https://doi.org/10.1364/BOE.8.003627",
      "doi": ""
    },
    {
      "text": "Celeste S. Royce, Margaret M. Hayes, and Richard M. Schwartzstein. 2019. Teaching Critical Thinking: A Case for Instruction in Cognitive Biases to Reduce Diagnostic Errors and Improve Patient Safety. Academic Medicine 94, 2 (2019).",
      "doi": ""
    },
    {
      "text": "Sashank Santhanam, Alireza Karduni, and Samira Shaikh. 2020. Studying the Effects of Cognitive Biases in Evaluation of Conversational Agents. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376318",
      "doi": "10.1145/3313831.3376318"
    },
    {
      "text": "Henk G Schmidt, Sílvia Mamede, Kees Van Den Berge, Tamara Van Gog, Jan LCM Van Saase, and Remy MJP Rikers. 2014. Exposure to media information about a disease can cause doctors to misdiagnose similar-looking clinical cases. Academic Medicine 89, 2 (2014), 285–291.",
      "doi": ""
    },
    {
      "text": "J. Sherbino, K. Kulasegaram, E. Howey, and G. Norman. 2014. Ineffectiveness of cognitive forcing strategies to reduce biases in diagnostic reasoning: a controlled trial. Canadian Journal of Emergency Medicine 16, 1 (2014), 34–40.",
      "doi": ""
    },
    {
      "text": "Jacob Solomon. 2014. Customization Bias in Decision Support Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 3065–3074. https://doi.org/10.1145/2556288.2557211",
      "doi": "10.1145/2556288.2557211"
    },
    {
      "text": "Srinivas Sridharan, Reynold Bailey, Ann McNamara, and Cindy Grimm. 2012. Subtle Gaze Manipulation for Improved Mammography Training. In Proceedings of the Symposium on Eye Tracking Research and Applications(ETRA ’12). Association for Computing Machinery, New York, NY, USA, 75–82. https://doi.org/10.1145/2168556.2168568",
      "doi": "10.1145/2168556.2168568"
    },
    {
      "text": "N. Sriram and Anthony G. Greenwald. 2009. The Brief Implicit Association Test. Experimental Psychology 56, 4 (2009), 283–294. https://doi.org/10.1027/1618-3169.56.4.283",
      "doi": ""
    },
    {
      "text": "Liyuan Tao, Chen Zhang, Lin Zeng, Shengrong Zhu, Nan Li, Wei Li, Hua Zhang, Yiming Zhao, Siyan Zhan, and Hong Ji. 2020. Accuracy and effects of clinical decision support systems integrated with BMJ best practice–aided diagnosis: interrupted time series study. JMIR medical informatics 8, 1 (2020), e16912.",
      "doi": ""
    },
    {
      "text": "Predrag Teovanović, Goran Knežević, and Lazar Stankov. 2015. Individual differences in cognitive biases: Evidence against one-factor theory of rationality. Intelligence 50(2015), 75–86. https://doi.org/10.1016/j.intell.2015.02.008",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1974. Judgment under Uncertainty: Heuristics and Biases. Science 185, 4157 (1974), 1124–1131. https://doi.org/10.1126/science.185.4157.1124",
      "doi": ""
    },
    {
      "text": "Niels van Berkel, Omer F. Ahmad, Danail Stoyanov, Laurence Lovat, and Ann Blandford. 2021. Designing Visual Markers for Continuous Artificial Intelligence Support: A Colonoscopy Case Study. ACM Trans. Comput. Healthcare 2, 1, Article 7 (dec 2021), 24 pages. https://doi.org/10.1145/3422156",
      "doi": "10.1145/3422156"
    },
    {
      "text": "Niels van Berkel, Maura Bellio, Mikael B. Skov, and Ann Blandford. 2023. Measurements, Algorithms, and Presentations of Reality: Framing Interactions with AI-Enabled Decision Support. ACM Trans. Comput.-Hum. Interact.(2023). https://doi.org/10.1145/3571815",
      "doi": "10.1145/3571815"
    },
    {
      "text": "Niels van Berkel, Jeremy Opie, Omer F. Ahmad, Laurence Lovat, Danail Stoyanov, and Ann Blandford. 2022. Initial Responses to False Positives in AI-Supported Continuous Interactions: A Colonoscopy Case Study. ACM Trans. Interact. Intell. Syst. 12, 1, Article 2(2022), 18 pages. https://doi.org/10.1145/3480247",
      "doi": "10.1145/3480247"
    },
    {
      "text": "Elizabeth S. Veinott, James Leonard, Elizabeth Lerner Papautsky, Brandon Perelman, Aleksandra Stankovic, Jared Lorince, Jared Hotaling, Travis Ross, Peter Todd, Edward Castronova, Jerome Busemeyer, Christoper Hale, Richard Catrambone, Elizabeth Whitaker, Olivia Fox, John Flach, and Robert R. Hoffman. 2013. The effect of camera perspective and session duration on training decision making in a serious video game. In 2013 IEEE International Games Innovation Conference (IGIC). 256–262. https://doi.org/10.1109/IGIC.2013.6659170",
      "doi": ""
    },
    {
      "text": "Barbara G. Vickrey, Martin A. Samuels, and Allan H. Ropper. 2010. How neurologists think: A cognitive psychology perspective on missed diagnoses. Annals of Neurology 67, 4 (2010), 425–433. https://doi.org/10.1002/ana.21907",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Liuping Wang, Zhan Zhang, Ding Wang, Haiyi Zhu, Yvonne Gao, Xiangmin Fan, and Feng Tian. 2021. “Brilliant AI Doctor” in Rural Clinics: Challenges in AI-Powered Clinical Decision Support System Deployment. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 697, 18 pages. https://doi.org/10.1145/3411764.3445432",
      "doi": "10.1145/3411764.3445432"
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y. Lim. 2019. Designing Theory-Driven User-Centric Explainable AI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300831",
      "doi": "10.1145/3290605.3300831"
    },
    {
      "text": "Ruotong Wang, F. Maxwell Harper, and Haiyi Zhu. 2020. Factors Influencing Perceived Fairness in Algorithmic Decision-Making: Algorithm Outcomes, Development Procedures, and Individual Differences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376813",
      "doi": "10.1145/3313831.3376813"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, and John Zimmerman. 2019. Unremarkable AI: Fitting Intelligent Decision Support into Critical, Clinical Decision-Making Processes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300468",
      "doi": "10.1145/3290605.3300468"
    },
    {
      "text": "Qian Yang, John Zimmerman, Aaron Steinfeld, Lisa Carey, and James F. Antaki. 2016. Investigating the Heart Pump Implant Decision Process: Opportunities for Decision Support Tools to Help. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 4477–4488. https://doi.org/10.1145/2858036.2858373",
      "doi": "10.1145/2858036.2858373"
    },
    {
      "text": "Yunfeng Zhang, Rachel K.E. Bellamy, and Wendy A. Kellogg. 2015. Designing Information for Remediating Cognitive Biases in Decision-Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 2211–2220. https://doi.org/10.1145/2702123.2702239",
      "doi": "10.1145/2702123.2702239"
    }
  ]
}