{
  "doi": "10.1145/3544548.3580754",
  "title": "Deimos: A Grammar of Dynamic Embodied Immersive Visualisation Morphs and Transitions",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "We present Deimos, a grammar for specifying dynamic embodied immersive visualisation morphs and transitions. A morph is a collection of animated transitions that are dynamically applied to immersive visualisations at runtime and is conceptually modelled as a state machine. It is comprised of state, transition, and signal specifications. States in a morph are used to generate animation keyframes, with transitions connecting two states together. A transition is controlled by signals, which are composable data streams that can be used to enable embodied interaction techniques. Morphs allow immersive representations of data to transform and change shape through user interaction, facilitating the embodied cognition process. We demonstrate the expressivity of Deimos in an example gallery and evaluate its usability in an expert user study of six immersive analytics researchers. Participants found the grammar to be powerful and expressive, and showed interest in drawing upon Deimos’ concepts and ideas in their own research.",
  "tags": [
    "data visualisation",
    "grammar",
    "user study",
    "animated transitions",
    "Immersive Analytics",
    "embodied interaction"
  ],
  "authors": [
    {
      "name": "Benjamin Lee",
      "institution": "Data Visualisation and Immersive Analytics Lab, Monash University, Australia and VISUS, University of Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480874",
      "orcid": "0000-0002-1171-4741"
    },
    {
      "name": "Arvind Satyanarayan",
      "institution": "CSAIL, MIT, United States",
      "img": "/do/10.1145/contrib-81500663321/rel-imgonly/arvind-satyanarayan.jpg",
      "acmid": "81500663321",
      "orcid": "0000-0001-5564-635X"
    },
    {
      "name": "Maxime Cordeil",
      "institution": "School of Information Technology and Electrical Engineering, The University Of Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488668405",
      "orcid": "0000-0002-9732-4874"
    },
    {
      "name": "Arnaud Prouzeau",
      "institution": "Potioc, Inria, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658766854",
      "orcid": "0000-0003-3800-5870"
    },
    {
      "name": "Bernhard Jenny",
      "institution": "Data Visualisation and Immersive Analytics Lab, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597718",
      "orcid": "0000-0001-6101-6100"
    },
    {
      "name": "Tim Dwyer",
      "institution": "Data Visualisation and Immersive Analytics Lab, Monash University, Australia",
      "img": "/do/10.1145/contrib-81100013275/rel-imgonly/tim-dwyer-2016-small.jpg",
      "acmid": "81100013275",
      "orcid": "0000-0002-9076-9571"
    }
  ],
  "references": [
    {
      "text": "Felwa A. Abukhodair, Bernhard E. Riecke, Halil I. Erhan, and Chris D. Shaw. 2013. Does Interactive Animation Control Improve Exploratory Data Analysis of Animated Trend Visualization?. In IS&T/SPIE Electronic Imaging, Pak Chung Wong, David L. Kao, Ming C. Hao, Chaomei Chen, and Christopher G. Healey (Eds.). Burlingame, California, USA, 86540I. https://doi.org/10.1117/12.2001874",
      "doi": ""
    },
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Jason Leboe-McGowan, and Pourang Irani. 2018. Hooked on Data Videos: Assessing the Effect of Animation and Pictographs on Viewer Engagement. In Proceedings of the 2018 International Conference on Advanced Visual Interfaces. ACM, Castiglione della Pescaia Grosseto Italy, 1–9. https://doi.org/10.1145/3206505.3206552",
      "doi": "10.1145/3206505.3206552"
    },
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Andres Monroy-Hernandez, and Pourang Irani. 2017. Authoring Data-Driven Videos with DataClips. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 501–510. https://doi.org/10.1109/TVCG.2016.2598647",
      "doi": "10.1109/TVCG.2016.2598647"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301–2309. https://doi.org/10.1109/TVCG.2011.185",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Wolfgang Büschel, Jian Chen, Raimund Dachselt, Steven Drucker, Tim Dwyer, Carsten Görg, Tobias Isenberg, Andreas Kerren, Chris North, and Wolfgang Stuerzlinger. 2018. Interaction for Immersive Analytics. In Immersive Analytics, Kim Marriott, Falk Schreiber, Tim Dwyer, Karsten Klein, Nathalie Henry Riche, Takayuki Itoh, Wolfgang Stuerzlinger, and Bruce H. Thomas (Eds.). Springer International Publishing, Cham, 95–138. https://doi.org/10.1007/978-3-030-01388-2_4",
      "doi": ""
    },
    {
      "text": "Wolfgang Büschel, Anke Lehmann, and Raimund Dachselt. 2021. MIRIA: A Mixed Reality Toolkit for the In-Situ Visualization and Analysis of Spatio-Temporal Interaction Data. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–15. https://doi.org/10.1145/3411764.3445651",
      "doi": "10.1145/3411764.3445651"
    },
    {
      "text": "Wolfgang Büschel, Patrick Reipschläger, Ricardo Langner, and Raimund Dachselt. 2017. Investigating the Use of Spatial Interaction for 3D Data Visualization on Mobile Devices. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces. ACM, Brighton United Kingdom, 62–71. https://doi.org/10.1145/3132272.3134125",
      "doi": "10.1145/3132272.3134125"
    },
    {
      "text": "Peter W. S. Butcher, Nigel W. John, and Panagiotis D. Ritsos. 2021. VRIA: A Web-Based Framework for Creating Immersive Analytics Experiences. IEEE Transactions on Visualization and Computer Graphics 27, 7 (July 2021), 3213–3225. https://doi.org/10.1109/TVCG.2020.2965109",
      "doi": "10.1109/TVCG.2020.2965109"
    },
    {
      "text": "John M. Carroll, Robert L. Mack, and Wendy A. Kellogg. 1988. Chapter 3 - Interface Metaphors and User Interface Design. In Handbook of Human-Computer Interaction, MARTIN Helander (Ed.). North-Holland, Amsterdam, 67–85. https://doi.org/10.1016/B978-0-444-70536-5.50008-7",
      "doi": ""
    },
    {
      "text": "Maxime Cordeil, Andrew Cunningham, Benjamin Bach, Christophe Hurter, Bruce H. Thomas, Kim Marriott, and Tim Dwyer. 2019. IATK: An Immersive Analytics Toolkit. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Osaka, Japan, 200–209. https://doi.org/10.1109/VR.2019.8797978",
      "doi": ""
    },
    {
      "text": "Maxime Cordeil, Andrew Cunningham, Tim Dwyer, Bruce H. Thomas, and Kim Marriott. 2017. ImAxes: Immersive Axes as Embodied Affordances for Interactive Multivariate Data Visualisation. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, Québec City QC Canada, 71–83. https://doi.org/10.1145/3126594.3126613",
      "doi": "10.1145/3126594.3126613"
    },
    {
      "text": "Anind K. Dey, Gregory D. Abowd, and Daniel Salber. 2001. A Conceptual Framework and a Toolkit for Supporting the Rapid Prototyping of Context-Aware Applications. Human-Computer Interaction 16, 2 (Dec. 2001), 97–166. https://doi.org/10.1207/S15327051HCI16234_02",
      "doi": "10.1207/S15327051HCI16234_02"
    },
    {
      "text": "Paul Dourish. 2001. Where the Action Is: The Foundations of Embodied Interaction. MIT Press, Cambridge, Mass.http://ieeexplore.ieee.org/xpl/bkabstractplus.jsp?bkn=6267252",
      "doi": "10.5555/513034"
    },
    {
      "text": "Pierre Dragicevic, Anastasia Bezerianos, Waqas Javed, Niklas Elmqvist, and Jean-Daniel Fekete. 2011. Temporal Distortion for Animated Transitions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 2009–2018. https://doi.org/10.1145/1978942.1979233",
      "doi": "10.1145/1978942.1979233"
    },
    {
      "text": "Kenneth P. Fishkin, Anuj Gujar, Beverly L. Harrison, Thomas P. Moran, and Roy Want. 2000. Embodied User Interfaces for Really Direct Manipulation. Commun. ACM 43, 9 (Sept. 2000), 74–80. https://doi.org/10.1145/348941.348998",
      "doi": "10.1145/348941.348998"
    },
    {
      "text": "Philipp Fleck, Aimee Sousa Calepso, Sebastian Hubenschmid, Michael Sedlmair, and Dieter Schmalstieg. 2022. RagRug: A Toolkit for Situated Analytics. IEEE Transactions on Visualization and Computer Graphics (2022), 1–1. https://doi.org/10.1109/TVCG.2022.3157058",
      "doi": ""
    },
    {
      "text": "Flow Immersive, Inc.2022. Data Storytelling with Immersive Visualizations. https://flowimmersive.com",
      "doi": ""
    },
    {
      "text": "Tong Ge, Bongshin Lee, and Yunhai Wang. 2021. CAST: Authoring Data-Driven Chart Animations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–15. https://doi.org/10.1145/3411764.3445452",
      "doi": "10.1145/3411764.3445452"
    },
    {
      "text": "T. Ge, Y. Zhao, B. Lee, D. Ren, B. Chen, and Y. Wang. 2020. Canis: A High-Level Language for Data-Driven Chart Animations. Computer Graphics Forum 39, 3 (June 2020), 607–617. https://doi.org/10.1111/cgf.14005",
      "doi": ""
    },
    {
      "text": "Zeinab Ghaemi, Ulrich Engelke, Barrett Ens, and Bernhard Jenny. 2022. Proxemic Maps for Immersive Visualization. Cartography and Geographic Information Science 49, 3 (May 2022), 205–219. https://doi.org/10.1080/15230406.2021.2013946",
      "doi": ""
    },
    {
      "text": "Cleotilde Gonzalez. 1996. Does Animation in User Interfaces Improve Decision Making?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems Common Ground - CHI ’96. ACM Press, Vancouver, British Columbia, Canada, 27–34. https://doi.org/10.1145/238386.238396",
      "doi": "10.1145/238386.238396"
    },
    {
      "text": "T. R. G. Green. 1989. Cognitive Dimensions of Notations. In People and Computers V. University Press, 443–460.",
      "doi": "10.5555/92968.93015"
    },
    {
      "text": "Devamardeep Hayatpur, Haijun Xia, and Daniel Wigdor. 2020. DataHop: Spatial Data Exploration in Virtual Reality. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. ACM, Virtual Event USA, 818–828. https://doi.org/10.1145/3379337.3415878",
      "doi": "10.1145/3379337.3415878"
    },
    {
      "text": "Jeffrey Heer and George Robertson. 2007. Animated Transitions in Statistical Data Graphics. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov. 2007), 1240–1247. https://doi.org/10.1109/TVCG.2007.70539",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Sebastian Hubenschmid, Johannes Zagermann, Simon Butscher, and Harald Reiterer. 2021. STREAM: Exploring the Combination of Spatially-Aware Tablets with Augmented Reality Head-Mounted Displays for Immersive Analytics. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–14. https://doi.org/10.1145/3411764.3445298",
      "doi": "10.1145/3411764.3445298"
    },
    {
      "text": "Christophe Hurter, Nathalie Henry Riche, Steven M. Drucker, Maxime Cordeil, Richard Alligier, and Romain Vuillemot. 2019. FiberClay: Sculpting Three Dimensional Trajectories to Reveal Structural Insights. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 704–714. https://doi.org/10.1109/TVCG.2018.2865191",
      "doi": "10.1109/TVCG.2018.2865191"
    },
    {
      "text": "Petra Isenberg, Bongshin Lee, Huamin Qu, and Maxime Cordeil. 2018. Immersive Visual Data Stories. In Immersive Analytics. Springer International Publishing, Cham, 165–184. https://doi.org/10.1007/978-3-030-01388-2_6",
      "doi": ""
    },
    {
      "text": "Mina C. Johnson-Glenberg. 2018. Immersive VR and Education: Embodied Design Principles That Include Gesture and Hand Controls. Frontiers in Robotics and AI 5 (2018). https://www.frontiersin.org/articles/10.3389/frobt.2018.00081",
      "doi": ""
    },
    {
      "text": "Mina C. Johnson-Glenberg and Colleen Megowan-Romanowicz. 2017. Embodied Science and Mixed Reality: How Gesture and Motion Capture Affect Physics Education. Cognitive Research: Principles and Implications 2, 1 (May 2017), 24. https://doi.org/10.1186/s41235-017-0060-9",
      "doi": ""
    },
    {
      "text": "Yoshifumi Kawai. 2022. UniRx - Reactive Extensions for Unity. https://github.com/neuecc/UniRx",
      "doi": ""
    },
    {
      "text": "Younghoon Kim and Jeffrey Heer. 2021. Gemini 2 : Generating Keyframe-Oriented Animated Transitions Between Statistical Graphics. In 2021 IEEE Visualization Conference (VIS). IEEE, New Orleans, LA, USA, 201–205. https://doi.org/10.1109/VIS49827.2021.9623291",
      "doi": ""
    },
    {
      "text": "Younghoon Kim and Jeffrey Heer. 2021. Gemini: A Grammar and Recommender System for Animated Transitions in Statistical Graphics. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb. 2021), 485–494. https://doi.org/10.1109/TVCG.2020.3030360",
      "doi": ""
    },
    {
      "text": "Brittany Kondo and Christopher Collins. 2014. DimpVis: Exploring Time-varying Information Visualizations by Direct Manipulation. IEEE Transactions on Visualization and Computer Graphics 20, 12 (Dec. 2014), 2003–2012. https://doi.org/10.1109/TVCG.2014.2346250",
      "doi": ""
    },
    {
      "text": "Brittany Kondo, Hrim Mehta, and Christopher Collins. 2014. Glidgets: Interactive Glyphs for Exploring Dynamic Graphs. Proc. of IEEE Conf. on Information Visualization (InfoVis) (2014).",
      "doi": ""
    },
    {
      "text": "George Lakoff and Mark Johnson. 2008. Metaphors We Live By. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Ricardo Langner, Marc Satkowski, Wolfgang Büschel, and Raimund Dachselt. 2021. MARVIS: Combining Mobile Devices and Augmented Reality for Visual Data Analysis. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–17. https://doi.org/10.1145/3411764.3445593",
      "doi": "10.1145/3411764.3445593"
    },
    {
      "text": "Benjamin Lee, Maxime Cordeil, Arnaud Prouzeau, Bernhard Jenny, and Tim Dwyer. 2022. A Design Space For Data Visualisation Transformations Between 2D And 3D In Mixed-Reality Environments. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–14. https://doi.org/10.1145/3491102.3501859",
      "doi": "10.1145/3491102.3501859"
    },
    {
      "text": "Bongshin Lee, Tim Dwyer, Dominikus Baur, and Xaquín González Veira. 2018. Watches to Augmented Reality: Devices and Gadgets for Data-Driven Storytelling. In Data-Driven Storytelling. AK Peters/CRC Press, 153–168.",
      "doi": ""
    },
    {
      "text": "Benjamin Lee, Xiaoyun Hu, Maxime Cordeil, Arnaud Prouzeau, Bernhard Jenny, and Tim Dwyer. 2021. Shared Surfaces and Spaces: Collaborative Data Visualisation in a Co-located Immersive Environment. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb. 2021), 1171–1181. https://doi.org/10.1109/TVCG.2020.3030450",
      "doi": ""
    },
    {
      "text": "Tica Lin, Zhutian Chen, Yalong Yang, Daniele Chiappalupi, Johanna Beyer, and Hanspeter Pfister. 2022. The Quest for Omnioculars: Embedded Visualization for Augmenting Basketball Game Viewing Experiences. IEEE Transactions on Visualization and Computer Graphics (2022), 1–10. https://doi.org/10.1109/TVCG.2022.3209353",
      "doi": ""
    },
    {
      "text": "Jiazhou Liu, Arnaud Prouzeau, Barrett Ens, and Tim Dwyer. 2020. Design and Evaluation of Interactive Small Multiples Data Visualisation in Immersive Spaces. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Atlanta, GA, USA, 588–597. https://doi.org/10.1109/VR46266.2020.00081",
      "doi": ""
    },
    {
      "text": "K. Marriott, F. Schreiber, T. Dwyer, K. Klein, N. Henry Riche, T. Itoh, W. Stuerzlinger, and B. H. Thomas. 2018. Immersive Analytics. Springer International Publishing. https://books.google.com.au/books?id=vaVyDwAAQBAJ",
      "doi": ""
    },
    {
      "text": "Microsoft. 2021. Mixed Reality UX Elements - Mixed Reality. https://learn.microsoft.com/en-us/windows/mixed-reality/design/app-patterns-landingpage",
      "doi": ""
    },
    {
      "text": "Microsoft. 2022. MixedRealityToolkit-Unity. https://github.com/microsoft/MixedRealityToolkit-Unity",
      "doi": ""
    },
    {
      "text": "Mark R. Mine, Frederick P. Brooks, and Carlo H. Sequin. 1997. Moving Objects in Space: Exploiting Proprioception in Virtual-Environment Interaction. In Proceedings of the 24th Annual Conference on Computer Graphics and Interactive Techniques(SIGGRAPH ’97). ACM Press/Addison-Wesley Publishing Co., USA, 19–26. https://doi.org/10.1145/258734.258747",
      "doi": "10.1145/258734.258747"
    },
    {
      "text": "Tamara Munzner. 2014. Visualization Analysis and Design. CRC Press, Taylor & Francis Group, CRC Press is an imprint of the Taylor & Francis Group, an informa business, Boca Raton.",
      "doi": ""
    },
    {
      "text": "Patrick Reipschläger and Raimund Dachselt. 2019. DesignAR: Immersive 3D-Modeling Combining Augmented Reality with Interactive Displays. In Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces. ACM, Daejeon Republic of Korea, 29–41. https://doi.org/10.1145/3343055.3359718",
      "doi": "10.1145/3343055.3359718"
    },
    {
      "text": "Patrick Reipschlager, Tamara Flemisch, and Raimund Dachselt. 2021. Personal Augmented Reality for Information Visualization on Large Interactive Displays. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb. 2021), 1182–1192. https://doi.org/10.1109/TVCG.2020.3030460",
      "doi": ""
    },
    {
      "text": "George Robertson, Kim Cameron, Mary Czerwinski, and Daniel Robbins. 2002. Animated Visualization of Multiple Intersecting Hierarchies. Information Visualization 1, 1 (March 2002), 50–65. https://doi.org/10.1057/palgrave.ivs.9500002",
      "doi": ""
    },
    {
      "text": "G. Robertson, R. Fernandez, D. Fisher, B. Lee, and J. Stasko. 2008. Effectiveness of Animation in Trend Visualization. IEEE Transactions on Visualization and Computer Graphics 14, 6 (Nov. 2008), 1325–1332. https://doi.org/10.1109/TVCG.2008.125",
      "doi": "10.1109/TVCG.2008.125"
    },
    {
      "text": "Hans Rosling. 2007. The Best Stats You’ve Ever Seen | Hans Rosling. https://www.youtube.com/watch?v=hVimVzgtD6w",
      "doi": ""
    },
    {
      "text": "Puripant Ruchikachorn and Klaus Mueller. 2015. Learning Visualizations by Analogy: Promoting Visual Literacy through Visualization Morphing. IEEE Transactions on Visualization and Computer Graphics 21, 9 (Sept. 2015), 1028–1044. https://doi.org/10.1109/TVCG.2015.2413786",
      "doi": "10.1109/TVCG.2015.2413786"
    },
    {
      "text": "Arvind Satyanarayan, Bongshin Lee, Donghao Ren, Jeffrey Heer, John Stasko, John Thompson, Matthew Brehmer, and Zhicheng Liu. 2019. Critical Reflections on Visualization Authoring Systems. IEEE Transactions on Visualization and Computer Graphics (2019), 1–1. https://doi.org/10.1109/TVCG.2019.2934281",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 341–350. https://doi.org/10.1109/TVCG.2016.2599030",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Arvind Satyanarayan, Kanit Wongsuphasawat, and Jeffrey Heer. 2014. Declarative Interaction Design for Data Visualization. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology. ACM, Honolulu Hawaii USA, 669–678. https://doi.org/10.1145/2642918.2647360",
      "doi": "10.1145/2642918.2647360"
    },
    {
      "text": "B. Shneiderman. 1996. The Eyes Have It: A Task by Data Type Taxonomy for Information Visualizations. In Proceedings 1996 IEEE Symposium on Visual Languages. IEEE Comput. Soc. Press, Boulder, CO, USA, 336–343. https://doi.org/10.1109/VL.1996.545307",
      "doi": ""
    },
    {
      "text": "Ronell Sicat, Jiabao Li, Junyoung Choi, Maxime Cordeil, Won-Ki Jeong, Benjamin Bach, and Hanspeter Pfister. 2019. DXR: A Toolkit for Building Immersive Data Visualizations. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 715–725. https://doi.org/10.1109/TVCG.2018.2865152",
      "doi": "10.1109/TVCG.2018.2865152"
    },
    {
      "text": "Jim Smiley, Benjamin Lee, Siddhant Tandon, Maxime Cordeil, Lonni Besançon, Jarrod Knibbe, Bernhard Jenny, and Tim Dwyer. 2021. The MADE-Axis: A Modular Actuated Device to Embody the Axis of a Data Dimension. Proceedings of the ACM on Human-Computer Interaction 5, ISS (Nov. 2021), 1–23. https://doi.org/10.1145/3488546",
      "doi": "10.1145/3488546"
    },
    {
      "text": "Dag Svanæs. 2001. Context-Aware Technology: A Phenomenological Perspective. Human–Computer Interaction 16, 2-4 (Dec. 2001), 379–400. https://doi.org/10.1207/S15327051HCI16234_17",
      "doi": "10.1207/S15327051HCI16234_17"
    },
    {
      "text": "J. Thompson, Z. Liu, W. Li, and J. Stasko. 2020. Understanding the Design Space and Authoring Paradigms for Animated Data Graphics. Computer Graphics Forum 39, 3 (June 2020), 207–218. https://doi.org/10.1111/cgf.13974",
      "doi": ""
    },
    {
      "text": "John R Thompson, Zhicheng Liu, and John Stasko. 2021. Data Animator: Authoring Expressive Animated Data Graphics. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–18. https://doi.org/10.1145/3411764.3445747",
      "doi": "10.1145/3411764.3445747"
    },
    {
      "text": "Barbara Tversky, Julie Bauer Morrison, and Mireille Betrancourt. 2002. Animation: Can It Facilitate?International Journal of Human-Computer Studies 57, 4 (Oct. 2002), 247–262. https://doi.org/10.1006/ijhc.2002.1017",
      "doi": "10.1006/ijhc.2002.1017"
    },
    {
      "text": "J. A. Wagner Filho, C.M.D.S. Freitas, and L. Nedel. 2018. VirtualDesk: A Comfortable and Efficient Immersive Information Visualization Approach. Computer Graphics Forum 37, 3 (June 2018), 415–426. https://doi.org/10.1111/cgf.13430",
      "doi": ""
    },
    {
      "text": "Zhanyong Wan, Walid Taha, and Paul Hudak. 2002. Event-Driven FRP. In Practical Aspects of Declarative Languages, Gerhard Goos, Juris Hartmanis, Jan van Leeuwen, Shriram Krishnamurthi, and C. R. Ramakrishnan (Eds.). Vol. 2257. Springer Berlin Heidelberg, Berlin, Heidelberg, 155–172. https://doi.org/10.1007/3-540-45587-6_11",
      "doi": ""
    },
    {
      "text": "Qianwen Wang, Zhen Li, Siwei Fu, Weiwei Cui, and Huamin Qu. 2019. Narvis: Authoring Narrative Slideshows for Introducing Data Visualization Designs. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 779–788. https://doi.org/10.1109/TVCG.2018.2865232",
      "doi": "10.1109/TVCG.2018.2865232"
    },
    {
      "text": "Hadley Wickham. 2010. A Layered Grammar of Graphics. Journal of Computational and Graphical Statistics 19, 1 (Jan. 2010), 3–28. https://doi.org/10.1198/jcgs.2009.07098",
      "doi": ""
    },
    {
      "text": "Wesley Willett, Yvonne Jansen, and Pierre Dragicevic. 2017. Embedded Data Representations. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 461–470. https://doi.org/10.1109/TVCG.2016.2598608",
      "doi": "10.1109/TVCG.2016.2598608"
    },
    {
      "text": "Amanda Williams, Eric Kabisch, and Paul Dourish. 2005. From Interaction to Participation: Configuring Space Through Embodied Interaction. In UbiComp 2005: Ubiquitous Computing(Lecture Notes in Computer Science), Michael Beigl, Stephen Intille, Jun Rekimoto, and Hideyuki Tokuda (Eds.). Springer, Berlin, Heidelberg, 287–304. https://doi.org/10.1007/11551201_17",
      "doi": "10.1007/11551201_17"
    },
    {
      "text": "Yalong Yang, Tim Dwyer, Kim Marriott, Bernhard Jenny, and Sarah Goodwin. 2020. Tilt Map: Interactive Transitions Between Choropleth Map, Prism Map and Bar Chart in Immersive Environments. IEEE Transactions on Visualization and Computer Graphics 27, 12(2020), 4507–4519. https://doi.org/10.1109/TVCG.2020.3004137",
      "doi": "10.1109/TVCG.2020.3004137"
    },
    {
      "text": "Stephanie Yee and Tony Chu. 2015. A Visual Introduction to Machine Learning. http://www.r2d3.us/visual-intro-to-machine-learning-part-1/",
      "doi": ""
    },
    {
      "text": "Jonathan Zong, Dylan Wootton, Arvind Satyanarayan, and Josh Pollock. 2022. Animated Vega-Lite: Unifying Animation with a Grammar of Interactive Graphics. IEEE Transactions on Visualization and Computer Graphics (2022), 1–11. https://doi.org/10.1109/TVCG.2022.3209369",
      "doi": ""
    }
  ]
}