{
  "doi": "10.1145/3544548.3581386",
  "title": "Creator-friendly Algorithms: Behaviors, Challenges, and Design Opportunities in Algorithmic Platforms",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2023,
  "badges": [],
  "abstract": "In many creator economy platforms, algorithms significantly impact creators’ practices and decisions about their creative expression and monetization. Emerging research suggests that the opacity of the algorithm and platform policies often distract creators from their creative endeavors. To study how algorithmic platforms can be more ‘creator-friendly,’ we conducted a mixed-methods study: interviews (N=14) and a participatory design workshop (N=12) with YouTube creators. Through the interviews, we found how creators’ folk theories of the curation algorithm impact their work strategies — whether they choose to work with or against the algorithm — and the associated challenges in the process. In the workshop, creators explored solution ideas to overcome the aforementioned challenges, such as fostering diverse and creative expressions, achieving success as a creator, and motivating creators to continue their job. Based on these findings, we discuss design opportunities for how algorithmic platforms can support and motivate creators to sustain their creative work.",
  "authors": [
    {
      "name": "Yoonseo Choi",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526491",
      "orcid": "0000-0001-6808-2848"
    },
    {
      "name": "Eun Jeong Kang",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778443",
      "orcid": "0000-0003-1347-7556"
    },
    {
      "name": "Min Kyung Lee",
      "institution": "The University of Texas at Austin, United States",
      "img": "/do/10.1145/contrib-81414592368/rel-imgonly/mklee.png",
      "acmid": "81414592368",
      "orcid": "0000-0002-2696-6546"
    },
    {
      "name": "Juho Kim",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    }
  ],
  "references": [
    {
      "text": "Himan Abdollahpouri, Gediminas Adomavicius, Robin Burke, Ido Guy, Dietmar Jannach, Toshihiro Kamishima, Jan Krasnodebski, and Luiz Pizzato. 2020. Multistakeholder recommendation: Survey and research directions. User Modeling and User-Adapted Interaction 30, 1 (2020), 127–158.",
      "doi": ""
    },
    {
      "text": "Juan Carlos Alvarez de la Vega, Marta E Cecchinato, and John Rooksby. 2022. Design Opportunities for Freelancing Platforms: Online Freelancers’ Views on a Worker-Centred Design Fiction. In 2022 Symposium on Human-Computer Interaction for Work. 1–19.",
      "doi": ""
    },
    {
      "text": "Mark Andrejevic. 2009. Exploiting YouTube: Contradictions of user-generated labor. The youtube reader 413, 36 (2009), 406–423.",
      "doi": ""
    },
    {
      "text": "Jack Bandy and Nicholas Diakopoulos. 2020. #TulsaFlop: A Case Study of Algorithmically-Influenced Collective Action on TikTok. https://doi.org/10.48550/ARXIV.2012.07716",
      "doi": ""
    },
    {
      "text": "Nancy K Baym. 2021. Creator culture: An introduction to global social media entertainment. NYU Press.",
      "doi": ""
    },
    {
      "text": "Hemant K Bhargava. 2022. The creator economy: Managing ecosystem supply, revenue sharing, and platform design. Management Science 68, 7 (2022), 5233–5251.",
      "doi": "10.1287/mnsc.2021.4126"
    },
    {
      "text": "Matt Binderm. 2021. YouTube rolls out new content-specific creator analytics for YouTube Shorts, livestreams. https://mashable.com/article/youtube-content-specific-analytics",
      "doi": ""
    },
    {
      "text": "Sophie Bishop. 2018. Anxiety, panic and self-optimization: Inequalities and the YouTube algorithm. Convergence 24, 1 (2018), 69–84.",
      "doi": ""
    },
    {
      "text": "Sophie Bishop. 2019. Managing visibility on YouTube through algorithmic gossip. New media & society 21, 11-12 (2019), 2589–2606.",
      "doi": ""
    },
    {
      "text": "Sophie Bishop. 2020. Algorithmic experts: Selling algorithmic lore on YouTube. Social Media+ Society 6, 1 (2020), 2056305119897323.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa arXiv:https://www.tandfonline.com/doi/pdf/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Taina Bucher and Anne Helmond. 2017. The affordances of social media platforms. (2017).",
      "doi": ""
    },
    {
      "text": "Emanuele Bugliarello, Rishabh Mehrotra, James Kirk, and Mounia Lalmas. 2022. Mostra: A Flexible Balancing Framework to Trade-off User, Artist and Platform Objectives for Music Sequencing. In Proceedings of the ACM Web Conference 2022. 2936–2945.",
      "doi": "10.1145/3485447.3512014"
    },
    {
      "text": "Aldijana Bunjak, Matej Černe, and Aleš Popovič. 2021. Absorbed in technology but digitally overloaded: Interplay effects on gig workers’ burnout and creativity. Information & Management 58, 8 (2021), 103533.",
      "doi": "10.1016/j.im.2021.103533"
    },
    {
      "text": "Jean Burgess and Joshua Green. 2018. YouTube: Online video and participatory culture. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Lindsey Cameron, Angele Christin, Michael Ann DeVito, Tawanna R. Dillahunt, Madeleine Elish, Mary Gray, Rida Qadri, Noopur Raval, Melissa Valentine, and Elizabeth Anne Watkins. 2021. “This Seems to Work”: Designing Technological Systems with The Algorithmic Imaginations of Those Who Labor. In Extended abstracts of the 2021 CHI conference on human factors in computing systems. 1–5.",
      "doi": ""
    },
    {
      "text": "Valerie A Canady. 2022. Psychiatrists collaborate with YouTube to develop MH content. Mental Health Weekly 32, 20 (2022), 7–7.",
      "doi": ""
    },
    {
      "text": "Juan Carlos Alvarez de la Vega, Marta E. Cecchinato, and John Rooksby. 2021. “Why lose control?” A Study of Freelancers’ Experiences with Gig Economy Platforms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445305"
    },
    {
      "text": "Florian Cech. 2021. Tackling Algorithmic Transparency in Communal Energy Accounting through Participatory Design. In C&T’21: Proceedings of the 10th International Conference on Communities & Technologies-Wicked Problems in the Age of Tech. 258–268.",
      "doi": "10.1145/3461564.3461577"
    },
    {
      "text": "Eshwar Chandrasekharan, Chaitrali Gandhi, Matthew Wortley Mustelier, and Eric Gilbert. 2019. Crossmod: A cross-community learning-based system to assist reddit moderators. Proceedings of the ACM on human-computer interaction 3, CSCW(2019), 1–30.",
      "doi": "10.1145/3359276"
    },
    {
      "text": "Eric Cook, Stephanie D Teasley, and Mark S Ackerman. 2009. Contribution, commercialization & audience: understanding participation in an online creative community. In Proceedings of the ACM 2009 international conference on Supporting group work. 41–50.",
      "doi": "10.1145/1531674.1531681"
    },
    {
      "text": "Oscar Coromina, Ariadna Matamoros-Fernández, and Bernhard Rieder. 2020. Follow the Money: a Large-scale Investigation of Monetization and Optimization on YouTube. AoIR Selected Papers of Internet Research(2020).",
      "doi": ""
    },
    {
      "text": "Kelley Cotter. 2019. Playing the visibility game: How digital influencers and algorithms negotiate influence on Instagram. New Media & Society 21, 4 (2019), 895–913.",
      "doi": ""
    },
    {
      "text": "Stuart Cunningham and David Craig. 2019. Social media entertainment. New York University Press.",
      "doi": ""
    },
    {
      "text": "Stuart Cunningham, David Craig, and Jon Silver. 2016. YouTube, multichannel networks and the accelerated evolution of the new screen ecology. Convergence 22, 4 (2016), 376–391.",
      "doi": ""
    },
    {
      "text": "Fernando Delgado, Solon Barocas, and Karen Levy. 2022. An Uncommon Task: Participatory Design in Legal AI. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–23.",
      "doi": "10.1145/3512898"
    },
    {
      "text": "Michael A DeVito, Jeremy Birnholtz, Jeffery T Hancock, Megan French, and Sunny Liu. 2018. How people form folk theories of social media feeds and what it means for how we study self-presentation. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3173694"
    },
    {
      "text": "Michael A. DeVito, Jeremy Birnholtz, Jeffery T. Hancock, Megan French, and Sunny Liu. 2018. How People Form Folk Theories of Social Media Feeds and What It Means for How We Study Self-Presentation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173694",
      "doi": "10.1145/3173574.3173694"
    },
    {
      "text": "Michael A DeVito, Darren Gergle, and Jeremy Birnholtz. 2017. \"Algorithms ruin everything\" # RIPTwitter, Folk Theories, and Resistance to Algorithmic Change in Social Media. In Proceedings of the 2017 CHI conference on human factors in computing systems. 3163–3174.",
      "doi": "10.1145/3025453.3025659"
    },
    {
      "text": "Alicia DeVos, Aditi Dhabalia, Hong Shen, Kenneth Holstein, and Motahhare Eslami. 2022. Toward User-Driven Algorithm Auditing: Investigating users’ strategies for uncovering harmful algorithmic behavior. In CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3491102.3517441"
    },
    {
      "text": "Berkeley J Dietvorst, Joseph P Simmons, and Cade Massey. 2015. Algorithm aversion: people erroneously avoid algorithms after seeing them err.Journal of Experimental Psychology: General 144, 1 (2015), 114.",
      "doi": ""
    },
    {
      "text": "Karlijn Dinnissen. 2022. Improving Fairness and Transparency for Artists in Music Recommender Systems. In Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval. 3498–3498.",
      "doi": "10.1145/3477495.3531681"
    },
    {
      "text": "Emory James Edwards and Tom Boellstorff. 2021. Migration, non-use, and the ‘Tumblrpocalypse’: Towards a unified theory of digital exodus. Media, Culture & Society 43, 3 (2021), 582–592.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I\" like\" it, then I hide it: Folk Theories of Social Feeds. In Proceedings of the 2016 CHI conference on human factors in computing systems. 2371–2382.",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Kristy Beers Fägersten. 2017. The role of swearing in creating an online persona: The case of YouTuber PewDiePie. Discourse, context & media 18 (2017), 1–10.",
      "doi": ""
    },
    {
      "text": "Megan French and Jeff Hancock. 2017. What’s the folk theory? Reasoning about cyber-social systems. Reasoning About Cyber-Social Systems (February 2, 2017) (2017).",
      "doi": ""
    },
    {
      "text": "Yiqing Hua, Manoel Horta Ribeiro, Thomas Ristenpart, Robert West, and Mor Naaman. 2022. Characterizing alternative monetization strategies on YouTube. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–30.",
      "doi": "10.1145/3555174"
    },
    {
      "text": "Nura Jabagi, Anne-Marie Croteau, Luc K Audebrand, and Josianne Marsan. 2019. Gig-workers’ motivation: Thinking beyond carrots and sticks. Journal of Managerial Psychology(2019).",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Yoni Karpfen, and Judd Antin. 2018. Algorithmic anxiety and coping strategies of Airbnb hosts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173995"
    },
    {
      "text": "Nadia Karizat, Dan Delmonaco, Motahhare Eslami, and Nazanin Andalibi. 2021. Algorithmic folk theories and identity: How TikTok users co-produce Knowledge of identity and engage in algorithmic resistance. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–44.",
      "doi": "10.1145/3476046"
    },
    {
      "text": "Melissa G Keith, Peter D Harms, and Alexander C Long. 2020. Worker health and well-being in the gig economy: A proposed framework and research agenda. Entrepreneurial and Small Business Stressors, Experienced Stress, and Well-Being 18(2020), 1–33.",
      "doi": ""
    },
    {
      "text": "Jin Kim. 2012. The institutionalization of YouTube: From user-generated content to professionally generated content. Media, culture & society 34, 1 (2012), 53–67.",
      "doi": ""
    },
    {
      "text": "Daniel Klug, Yiluo Qin, Morgan Evans, and Geoff Kaufman. 2021. Trick and Please. A Mixed-Method Study On User Assumptions About the TikTok Algorithm. In 13th ACM Web Science Conference 2021. 84–92.",
      "doi": "10.1145/3447535.3462512"
    },
    {
      "text": "Sneha R Krishna Kumaran, Wenxuan Wendy Shi, and Brian P Bailey. 2021. Am I Ready to Get Feedback? A Taxonomy of Factors Creators Consider Before Seeking Feedback on In-Progress Creative Work. In Creativity and Cognition. 1–10.",
      "doi": ""
    },
    {
      "text": "Sangeet Kumar. 2019. The algorithmic dance: YouTube’s Adpocalypse and the gatekeeping of cultural content on digital platforms. Internet Policy Review 8, 2 (2019), 1–21.",
      "doi": ""
    },
    {
      "text": "Angela Y Lee, Hannah Mieczkowski, Nicole B Ellison, and Jeffrey T Hancock. 2022. The Algorithmic Crystal: Conceptualizing the Self through Algorithmic Personalization on TikTok. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–22.",
      "doi": "10.1145/3555601"
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Anson Kahng, Ji Tae Kim, Xinran Yuan, Allissa Chan, Daniel See, Ritesh Noothigattu, Siheon Lee, Alexandros Psomas, 2019. WeBuildAI: Participatory framework for algorithmic governance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–35.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with machines: The impact of algorithmic and data-driven management on human workers. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1603–1612.",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Frederike Lichtenstein. 2017. Is Vidme the ‘NewTube’? Why video creators are changing sides and how they feel about it. Masters of Media (2017).",
      "doi": ""
    },
    {
      "text": "Phoebe Lin and Jessica Van Brummelen. 2021. Engaging teachers to Co-design integrated AI curriculum for K-12 classrooms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445377"
    },
    {
      "text": "Renkai Ma and Yubo Kou. 2021. \"How advertiser-friendly is my video?\": YouTuber’s Socioeconomic Interactions with Algorithmic Content Moderation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": "10.1145/3479573"
    },
    {
      "text": "Stephanie McNeal. 2022. Workers demand gig economy companies explain their algorithms. https://www.buzzfeednews.com/article/stephaniemcneal/youtube-mcbrooms-quitting-david-dobrik",
      "doi": ""
    },
    {
      "text": "Karim Nader and Min Kyung Lee. 2022. Folk Theories and User Strategies on Dating Apps. In International Conference on Information. Springer, 445–458.",
      "doi": ""
    },
    {
      "text": "Victoria O’Meara. 2019. Weapons of the chic: Instagram influencer engagement pods as practices of resistance to Instagram platform labor. Social Media+ Society 5, 4 (2019), 2056305119879671.",
      "doi": ""
    },
    {
      "text": "Joon Sung Park, Lindsay Popowski, Carrie Cai, Meredith Ringel Morris, Percy Liang, and Michael S Bernstein. 2022. Social Simulacra: Creating Populated Prototypes for Social Computing Systems. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. 1–18.",
      "doi": "10.1145/3526113.3545616"
    },
    {
      "text": "Aaron Pressman and Danielle Abril. 2021. YouTube creator economy flourishes with $30 billion payments. https://fortune.com/2021/06/02/youtube-creator-economy-advertising-revenue-war-for-talent-yt-influencers/",
      "doi": ""
    },
    {
      "text": "Aruna Ranganathan and Alan Benson. 2020. A numbers game: Quantification of work, auto-gamification, and worker productivity. American Sociological Review 85, 4 (2020), 573–609.",
      "doi": ""
    },
    {
      "text": "Alex Rosenblat and Luke Stark. 2016. Algorithmic labor and information asymmetries: A case study of Uber’s drivers. International journal of communication 10 (2016), 27.",
      "doi": ""
    },
    {
      "text": "Elizabeth B-N Sanders and Pieter Jan Stappers. 2012. Convivial toolbox: Generative research for the front end of design. Bis.",
      "doi": ""
    },
    {
      "text": "Saiph Savage, Chun Wei Chiang, Susumu Saito, Carlos Toxtli, and Jeffrey Bigham. 2020. Becoming the super turker: Increasing wages via a strategy from high earning workers. In Proceedings of The Web Conference 2020. 1241–1252.",
      "doi": "10.1145/3366423.3380200"
    },
    {
      "text": "Saiph Savage and Mohammad H Jarrahi. 2020. Solidarity and AI for Transitioning to Crowd Work during COVID-19. In The New Future of Work Symposium 2020.",
      "doi": ""
    },
    {
      "text": "Tanusree Sharma, Zhixuan Zhou, Yun Huang, and Yang Wang. 2022. \" It’s A Blessing and A Curse\": Unpacking Creators’ Practices with Non-Fungible Tokens (NFTs) and Their Communities. arXiv preprint arXiv:2201.13233(2022).",
      "doi": ""
    },
    {
      "text": "Hong Shen, Alicia DeVos, Motahhare Eslami, and Kenneth Holstein. 2021. Everyday algorithm auditing: Understanding the power of everyday users in surfacing harmful algorithmic behaviors. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–29.",
      "doi": "10.1145/3479577"
    },
    {
      "text": "Beth Singler. 2020. “Blessed by the algorithm”: Theistic conceptions of artificial intelligence in online discourse. AI & society 35, 4 (2020), 945–955.",
      "doi": ""
    },
    {
      "text": "Chris Stokel-Walker. 2018. Why YouTubers are feeling the burn. https://www.theguardian.com/technology/2018/aug/12/youtubers-feeling-burn-video-stars-crumbling-under-pressure-of-producing-new-content",
      "doi": ""
    },
    {
      "text": "TechPostPlus. 2022. YouTube video categories List (complete guide). https://techpostplus.com/youtube-video-categories-list-faqs-and-solutions/",
      "doi": ""
    },
    {
      "text": "Anna M Turri, Karen H Smith, and Elyria Kemp. 2013. Developing affective brand commitment through social media. Journal of Electronic Commerce Research 14, 3 (2013).",
      "doi": ""
    },
    {
      "text": "Kristen Vaccaro, Ziang Xiao, Kevin Hamilton, and Karrie Karahalios. 2021. Contestability For Content Moderation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–28.",
      "doi": "10.1145/3476059"
    },
    {
      "text": "José Van Dijck. 2013. The culture of connectivity: A critical history of social media. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Susann Wagenknecht, Min Lee, Caitlin Lustig, Jacki O’Neill, and Himanshu Zade. 2016. Algorithms at work: empirical diversity, analytic vocabularies, design implications. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion. 536–543.",
      "doi": "10.1145/2818052.2855519"
    },
    {
      "text": "Philip Weber, Thomas Ludwig, Sabrina Brodesser, and Laura Grönewald. 2021. “It’s a Kind of Art!”: Understanding Food Influencers as Influential Content Creators. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445607"
    },
    {
      "text": "Eva Yiwei Wu, Emily Pedersen, and Niloufar Salehi. 2019. Agent, gatekeeper, drug dealer: How content creators craft algorithmic personas. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359321"
    },
    {
      "text": "Young Entrepreneur Council (YEC) Yec. 2022. Make the most of the creator economy. https://www.forbes.com/sites/theyec/2022/07/18/make-the-most-of-the-creator-economy/?sh=7565921916e9",
      "doi": ""
    },
    {
      "text": "Daisy Yoo, Alina Huldtgren, Jill Palzkill Woelfer, David G Hendry, and Batya Friedman. 2013. A value sensitive action-reflection model: evolving a co-design space with stakeholder and designer prompts. In Proceedings of the SIGCHI conference on human factors in computing systems. 419–428.",
      "doi": "10.1145/2470654.2470715"
    },
    {
      "text": "Brita Ytre-Arne and Hallvard Moe. 2021. Folk theories of algorithms: Understanding digital irritation. Media, Culture & Society 43, 5 (2021), 807–824.",
      "doi": ""
    },
    {
      "text": "Angie Zhang, Alexander Boltz, Chun Wei Wang, and Min Kyung Lee. 2022. Algorithmic management reimagined for workers and by workers: Centering worker well-being in gig work. In CHI Conference on Human Factors in Computing Systems. 1–20.",
      "doi": "10.1145/3491102.3501866"
    },
    {
      "text": "Haiyi Zhu, Bowen Yu, Aaron Halfaker, and Loren Terveen. 2018. Value-sensitive algorithm design: Method, case study, and lessons. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–23.",
      "doi": "10.1145/3274463"
    },
    {
      "text": "Douglas Zytko, Pamela J. Wisniewski, Shion Guha, Eric PS Baumer, and Min Kyung Lee. 2022. Participatory Design of AI Systems: Opportunities and Challenges Across Diverse Users, Relationships, and Application Domains. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–4.",
      "doi": "10.1145/3491101.3516506"
    }
  ]
}