{
  "doi": "10.1145/3544548.3580746",
  "title": "Tuning Endpoint-variability Parameters by Observed Error Rates to Obtain Better Prediction Accuracy of Pointing Misses",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Error rates (ERs) in target-pointing tasks are typically modelled in two steps: predicting the click-point variability (σ) based on target sizes and then computing the probability that a click falls outside a target. This is an indirect approach if the researcher’s purpose is to achieve the accurate prediction of ERs because the model coefficients are optimized to predict σ accurately in the first step. We compared the prediction accuracies of this method with a more direct technique in which the coefficients used for σ are determined in such a way as to optimize the closeness between observed and predicted ERs. Our re-analysis of eight datasets from mouse- and touch-based pointing studies showed that the latter approach consistently outperforms the conventional one if the starting values for the parameter search are appropriate (which can be achieved by hyperparameter optimization), thus enabling the interface configuration on the basis of accurately predicted ERs.",
  "authors": [
    {
      "name": "Shota Yamanaka",
      "institution": "Yahoo Japan Corporation, Japan",
      "img": "",
      "acmid": "83059053057",
      "orcid": "0000-0001-9807-120X"
    },
    {
      "name": "Hiroki Usuba",
      "institution": "Yahoo Japan Corporation, Japan",
      "img": "",
      "acmid": "99659309372",
      "orcid": "0000-0001-7192-7231"
    }
  ],
  "references": [
    {
      "text": "Amina Adadi and Mohammed Berrada. 2018. Peeking Inside the Black-Box: A Survey on Explainable Artificial Intelligence (XAI). IEEE Access 6(2018), 52138–52160. https://doi.org/10.1109/ACCESS.2018.2870052",
      "doi": ""
    },
    {
      "text": "Takuya Akiba, Shotaro Sano, Toshihiko Yanase, Takeru Ohta, and Masanori Koyama. 2019. Optuna: A Next-Generation Hyperparameter Optimization Framework. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining(Anchorage, AK, USA) (KDD ’19). Association for Computing Machinery, New York, NY, USA, 2623–2631. https://doi.org/10.1145/3292500.3330701",
      "doi": "10.1145/3292500.3330701"
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-Computer Interaction with Mobile Devices and Services (San Francisco, California, USA) (MobileHCI ’12). Association for Computing Machinery, New York, NY, USA, 251–260. https://doi.org/10.1145/2371574.2371612",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Duncan P. Brumby, and Andrew Howes. 2014. Model of Visual Search and Selection Time in Linear Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3865–3874. https://doi.org/10.1145/2556288.2557093",
      "doi": "10.1145/2556288.2557093"
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Timo Kötzing, and Sabrina Hoppe. 2013. MenuOptimizer: Interactive Optimization of Menu Systems. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). ACM, New York, NY, USA, 331–342. https://doi.org/10.1145/2501988.2502024",
      "doi": "10.1145/2501988.2502024"
    },
    {
      "text": "Nikola Banovic, Ticha Sethapakdi, Yasasvi Hari, Anind K. Dey, and Jennifer Mankoff. 2019. The Limits of Expert Text Entry Speed on Mobile Keyboards with Autocorrect. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 15, 12 pages. https://doi.org/10.1145/3338286.3340126",
      "doi": "10.1145/3338286.3340126"
    },
    {
      "text": "Nikola Banovic, Ticha Sethapakdi, Yasasvi Hari, Anind K. Dey, and Jennifer Mankoff. 2019. The Limits of Expert Text Entry Speed on Mobile Keyboards with Autocorrect. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 15, 12 pages. https://doi.org/10.1145/3338286.3340126",
      "doi": "10.1145/3338286.3340126"
    },
    {
      "text": "James Bergstra, Rémi Bardenet, Yoshua Bengio, and Balázs Kégl. 2011. Algorithms for Hyper-Parameter Optimization. In Proceedings of the 24th International Conference on Neural Information Processing Systems (Granada, Spain) (NIPS’11, Vol. 24), J. Shawe-Taylor, R. Zemel, P. Bartlett, F. Pereira, and K. Q. Weinberger (Eds.). Curran Associates, Inc., Red Hook, NY, USA, 2546–2554. https://proceedings.neurips.cc/paper/2011/file/86e8f7ab32cfd12577bc2619bc635690-Paper.pdf",
      "doi": "10.5555/2986459.2986743"
    },
    {
      "text": "James Bergstra and Yoshua Bengio. 2012. Random Search for Hyper-Parameter Optimization. Journal of Machine Learning Research 13, 1 (feb 2012), 281–305.",
      "doi": "10.5555/2188385.2188395"
    },
    {
      "text": "Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts Law: Modeling Finger Touch with Fitts’ Law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). ACM, New York, NY, USA, 1363–1372. https://doi.org/10.1145/2470654.2466180",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Xiaojun Bi, Barton A. Smith, and Shumin Zhai. 2010. Quasi-Qwerty Soft Keyboard Optimization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 283–286. https://doi.org/10.1145/1753326.1753367",
      "doi": "10.1145/1753326.1753367"
    },
    {
      "text": "Xiaojun Bi and Shumin Zhai. 2013. Bayesian touch: a statistical criterion of target selection with finger touch. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST ’13). ACM, New York, NY, USA, 51–60. https://doi.org/10.1145/2501988.2502058",
      "doi": "10.1145/2501988.2502058"
    },
    {
      "text": "Xiaojun Bi and Shumin Zhai. 2016. Predicting Finger-Touch Accuracy Based on the Dual Gaussian Distribution Model. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). ACM, New York, NY, USA, 313–319. https://doi.org/10.1145/2984511.2984546",
      "doi": "10.1145/2984511.2984546"
    },
    {
      "text": "Renaud Blanch and Michael Ortega. 2011. Benchmarking Pointing Techniques with Distractors: Adding a Density Factor to Fitts’ Pointing Paradigm. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 1629–1638. https://doi.org/10.1145/1978942.1979180",
      "doi": "10.1145/1978942.1979180"
    },
    {
      "text": "Stuart K Card. 1984. Visual search of computer command menus. Lawrence Erlbaum, London, Chapter 6, 97–108.",
      "doi": ""
    },
    {
      "text": "Olivier Chapuis and Pierre Dragicevic. 2011. Effects of Motor Scale, Visual Scale, and Quantization on Small Target Acquisition Difficulty. ACM Trans. Comput.-Hum. Interact. 18, 3, Article 13 (Aug. 2011), 32 pages. https://doi.org/10.1145/1993060.1993063",
      "doi": "10.1145/1993060.1993063"
    },
    {
      "text": "Minsu Cho and Chinmay Hegde. 2019. Reducing The Search Space For Hyperparameter Optimization Using Group Sparsity. arxiv:1904.11095 [cs.LG]",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Saul Greenberg. 2007. A Predictive Model of Menu Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 627–636. https://doi.org/10.1145/1240624.1240723",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "Edward R.F.W. Crossman. 1956. The measurement of perceptual load in manual operations. Ph. D. Dissertation. University of Birmingham.",
      "doi": ""
    },
    {
      "text": "Jan Eggers, Dominique Feillet, Steffen Kehl, Marc Oliver Wagner, and Bernard Yannou. 2003. Optimization of the keyboard arrangement problem using an Ant Colony algorithm. European Journal of Operational Research 148, 3 (2003), 672–686. https://doi.org/10.1016/S0377-2217(02)00489-7",
      "doi": ""
    },
    {
      "text": "Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (1954), 381–391. https://doi.org/10.1037/h0055392",
      "doi": ""
    },
    {
      "text": "Niels Henze, Enrico Rukzio, and Susanne Boll. 2011. 100,000,000 Taps: Analysis and Improvement of Touch Performance in the Large. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (Stockholm, Sweden) (MobileHCI ’11). ACM, New York, NY, USA, 133–142. https://doi.org/10.1145/2037373.2037395",
      "doi": "10.1145/2037373.2037395"
    },
    {
      "text": "Morten Hertzum and Kasper Hornbæk. 2010. How Age Affects Pointing With Mouse and Touchpad: A Comparison of Young, Adult, and Elderly Users. International Journal of Human-Computer Interaction 26, 7(2010), 703–734. https://doi.org/10.1080/10447318.2010.487198",
      "doi": ""
    },
    {
      "text": "Keita Higuchi, Shotaro Sano, and Takeo Igarashi. 2021. Interactive Hyperparameter Optimization with Paintable Timelines. Association for Computing Machinery, New York, NY, USA, 1518–1528. https://doi.org/10.1145/3461778.3462077",
      "doi": "10.1145/3461778.3462077"
    },
    {
      "text": "Errol R. Hoffmann and Ilyas H. Sheikh. 1994. Effect of varying target height in a Fitts’ movement task. Ergonomics 37, 6 (1994), 1071–1088. https://doi.org/10.1080/00140139408963719",
      "doi": ""
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2011. Understanding Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 2501–2510. https://doi.org/10.1145/1978942.1979308",
      "doi": "10.1145/1978942.1979308"
    },
    {
      "text": "Jin Huang and Byungjoo Lee. 2019. Modeling Error Rates in Spatiotemporal Moving Target Selection. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, Article LBW2411, 6 pages. https://doi.org/10.1145/3290607.3313077",
      "doi": "10.1145/3290607.3313077"
    },
    {
      "text": "Jin Huang, Feng Tian, Xiangmin Fan, Huawei Tu, Hao Zhang, Xiaolan Peng, and Hongan Wang. 2020. Modeling the Endpoint Uncertainty in Crossing-Based Moving Target Selection. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376336",
      "doi": "10.1145/3313831.3376336"
    },
    {
      "text": "Jin Huang, Feng Tian, Xiangmin Fan, Xiaolong (Luke) Zhang, and Shumin Zhai. 2018. Understanding the Uncertainty in 1D Unidirectional Moving Target Selection. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 237, 12 pages. https://doi.org/10.1145/3173574.3173811",
      "doi": "10.1145/3173574.3173811"
    },
    {
      "text": "Jin Huang, Feng Tian, Nianlong Li, and Xiangmin Fan. 2019. Modeling the Uncertainty in 2D Moving Target Selection. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1031–1043. https://doi.org/10.1145/3332165.3347880",
      "doi": "10.1145/3332165.3347880"
    },
    {
      "text": "IBM. 2022. IBM SPSS Regression 28 Document. https://www.ibm.com/docs/en/SSLVMB_28.0.0/pdf/IBM_SPSS_Regression.pdf Pages 17. Retrieved April 1, 2022.",
      "doi": ""
    },
    {
      "text": "Toshiya Isomoto, Shota Yamanaka, and Buntarou Shizuki. 2020. Gaze-based Command Activation Technique Robust Against Unintentional Activation using Dwell-then-Gesture. In Proceedings of Graphics Interface 2020(University of Toronto) (GI 2020). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 256 – 266. https://doi.org/10.20380/GI2020.26",
      "doi": ""
    },
    {
      "text": "Toshiya Isomoto, Shota Yamanaka, and Buntarou Shizuki. 2022. Dwell Selection with ML-Based Intent Prediction Using Only Gaze Data. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 3, Article 120 (sep 2022), 21 pages. https://doi.org/10.1145/3550301",
      "doi": "10.1145/3550301"
    },
    {
      "text": "Yu-Jung Ko, Hang Zhao, Yoonsang Kim, IV Ramakrishnan, Shumin Zhai, and Xiaojun Bi. 2020. Modeling Two Dimensional Touch Pointing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 858–868. https://doi.org/10.1145/3379337.3415871",
      "doi": "10.1145/3379337.3415871"
    },
    {
      "text": "Per-Ola Kristensson and Shumin Zhai. 2004. SHARK2: A Large Vocabulary Shorthand Writing System for Pen-Based Computers. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (Santa Fe, NM, USA) (UIST ’04). Association for Computing Machinery, New York, NY, USA, 43–52. https://doi.org/10.1145/1029632.1029640",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Gierad Laput and Chris Harrison. 2019. Sensing Fine-Grained Hand Activity with Smartwatches. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300568",
      "doi": "10.1145/3290605.3300568"
    },
    {
      "text": "Byungjoo Lee, Sunjun Kim, Antti Oulasvirta, Jong-In Lee, and Eunji Park. 2018. Moving Target Selection: A Cue Integration Model. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 230, 12 pages. https://doi.org/10.1145/3173574.3173804",
      "doi": "10.1145/3173574.3173804"
    },
    {
      "text": "Byungjoo Lee and Antti Oulasvirta. 2016. Modelling Error Rates in Temporal Pointing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 1857–1868. https://doi.org/10.1145/2858036.2858143",
      "doi": "10.1145/2858036.2858143"
    },
    {
      "text": "Injung Lee, Sunjun Kim, and Byungjoo Lee. 2019. Geometrically Compensating Effect of End-to-End Latency in Moving-Target Selection Games. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300790",
      "doi": "10.1145/3290605.3300790"
    },
    {
      "text": "Yang Li. 2010. Protractor: A Fast and Accurate Gesture Recognizer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 2169–2172. https://doi.org/10.1145/1753326.1753654",
      "doi": "10.1145/1753326.1753654"
    },
    {
      "text": "Yang Li, Samy Bengio, and Gilles Bailly. 2018. Predicting Human Performance in Vertical Menu Selection Using Deep Learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3173574.3173603",
      "doi": "10.1145/3173574.3173603"
    },
    {
      "text": "Shengmei Liu, Mark Claypool, Andy Cockburn, Ragnhild Eg, Carl Gutwin, and Kjetil Raaen. 2021. Datasets: Moving Target Selection with Delay. Association for Computing Machinery, New York, NY, USA, 320–326. https://doi.org/10.1145/3458305.3478455",
      "doi": "10.1145/3458305.3478455"
    },
    {
      "text": "Yan Ma, Shumin Zhai, IV Ramakrishnan, and Xiaojun Bi. 2021. Modeling Touch Point Distribution with Rotational Dual Gaussian Model. In The 34th Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, 1197–1209. https://doi.org/10.1145/3472749.3474816",
      "doi": "10.1145/3472749.3474816"
    },
    {
      "text": "I. Scott MacKenzie. 1992. Fitts’ law as a research and design tool in human-computer interaction. Human-Computer Interaction 7, 1 (1992), 91–139. https://doi.org/10.1207/s15327051hci0701_3",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Akash Mehra, Jerome R. Bellegarda, Ojas Bapat, Partha Lal, and Xin Wang. 2020. Leveraging GANs to Improve Continuous Path Keyboard Input Models. In ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, New York, NY, USA, 8174–8178. https://doi.org/10.1109/ICASSP40776.2020.9052978",
      "doi": ""
    },
    {
      "text": "David E. Meyer, Richard A. Abrams, Sylvan Kornblum, Charles E. Wright, and J. E. Keith Smith. 1988. Optimality in human motor performance: ideal control of rapid aimed movements. Psychological Review 95, 3 (1988), 340–370. https://doi.org/10.1037/0033-295X.95.3.340",
      "doi": ""
    },
    {
      "text": "Christoph Molnar. 2022. Interpretable Machine Learning(2 ed.). Christoph Molnar, DE-80339 Munich. https://christophm.github.io/interpretable-ml-book",
      "doi": ""
    },
    {
      "text": "Sameera Palipana, Dariush Salami, Luis A. Leiva, and Stephan Sigg. 2021. Pantomime: Mid-Air Gesture Recognition with Sparse Millimeter-Wave Radar Point Clouds. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 1, Article 27 (mar 2021), 27 pages. https://doi.org/10.1145/3448110",
      "doi": "10.1145/3448110"
    },
    {
      "text": "Eunji Park and Byungjoo Lee. 2020. An Intermittent Click Planning Model. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376725",
      "doi": "10.1145/3313831.3376725"
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2018. Modeling Gesture-Typing Movements. Human-Computer Interaction 33, 3 (2018), 234–280. https://doi.org/10.1080/07370024.2016.1215922",
      "doi": ""
    },
    {
      "text": "Jochen Rick. 2010. Performance Optimizations of Virtual Keyboards for Stroke-Based Text Entry on a Touch-Based Tabletop. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (New York, New York, USA) (UIST ’10). Association for Computing Machinery, New York, NY, USA, 77–86. https://doi.org/10.1145/1866029.1866043",
      "doi": "10.1145/1866029.1866043"
    },
    {
      "text": "Jaime Ruiz, Yang Li, and Edward Lank. 2011. User-Defined Motion Gestures for Mobile Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 197–206. https://doi.org/10.1145/1978942.1978971",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "Shokrya Saleh. 2014. MODEL SELECTION VIA ROBUST VERSION OF R-SQUARED. Journal of Mathematics and Statistics 10 (Oct 2014), 414–420. https://doi.org/10.3844/jmssp.2014.414.420",
      "doi": ""
    },
    {
      "text": "Minitab Statistical Software. 2022. Methods and starting values for Nonlinear Regression. https://support.minitab.com/en-us/minitab/18/help-and-how-to/modeling-statistics/regression/how-to/nonlinear-regression/interpret-the-results/all-statistics-and-graphs/methods-and-starting-values/ Retrieved April 1, 2022.",
      "doi": ""
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 1995. Theoretical upper and lower bounds on typing speed using a stylus and a soft keyboard. Behaviour & Information Technology 14, 6 (1995), 370–379. https://doi.org/10.1080/01449299508914656",
      "doi": ""
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 1995. Theoretical upper and lower bounds on typing speed using a stylus and a soft keyboard. Behaviour & Information Technology 14, 6 (1995), 370–379. https://doi.org/10.1080/01449299508914656",
      "doi": ""
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts’ law research in HCI. International Journal of Human-Computer Studies 61, 6 (2004), 751–789. https://doi.org/10.1016/j.ijhcs.2004.09.001",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Robert J. Teather, Andriy Pavlovych, Wolfgang Stuerzlinger, and I. Scott MacKenzie. 2009. Effects of Tracking Technology, Latency, and Spatial Jitter on Object Movement. In Proceedings of the 2009 IEEE Symposium on 3D User Interfaces(3DUI ’09). IEEE Computer Society, Washington, DC, USA, 43–50. https://doi.org/10.1109/3DUI.2009.4811204",
      "doi": "10.1109/3DUI.2009.4811204"
    },
    {
      "text": "Hiroki Usuba, Shota Yamanaka, and Homei Miyashita. 2021. Modeling Movement Times and Success Rates for Acquisition of One-Dimensional Targets with Uncertain Touchable Sizes. Proc. ACM Hum.-Comput. Interact. 5, ISS, Article 487 (nov 2021), 15 pages. https://doi.org/10.1145/3486953",
      "doi": "10.1145/3486953"
    },
    {
      "text": "Hiroki Usuba, Shota Yamanaka, Junichi Sato, and Homei Miyashita. 2022. Predicting Touch Accuracy for Rectangular Targets by Using One-Dimensional Task Results. Proc. ACM Hum.-Comput. Interact. 6, ISS, Article 579 (nov 2022), 13 pages. https://doi.org/10.1145/3567732",
      "doi": "10.1145/3567732"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2018. $Q: A Super-Quick, Articulation-Invariant Stroke-Gesture Recognizer for Low-Resource Devices. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 23, 12 pages. https://doi.org/10.1145/3229434.3229465",
      "doi": "10.1145/3229434.3229465"
    },
    {
      "text": "Eduardo Velloso, Flavio Luiz Coutinho, Andrew Kurauchi, and Carlos H Morimoto. 2018. Circular Orbits Detection for Gaze Interaction Using 2D Correlation and Profile Matching Algorithms. In Proceedings of the 2018 ACM Symposium on Eye Tracking Research & Applications (Warsaw, Poland) (ETRA ’18). Association for Computing Machinery, New York, NY, USA, Article 25, 9 pages. https://doi.org/10.1145/3204493.3204524",
      "doi": "10.1145/3204493.3204524"
    },
    {
      "text": "Mélodie Vidal, Andreas Bulling, and Hans Gellersen. 2013. Pursuits: Spontaneous Interaction with Displays Based on Smooth Pursuit Eye Movement and Moving Targets. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Zurich, Switzerland) (UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 439–448. https://doi.org/10.1145/2493432.2493477",
      "doi": "10.1145/2493432.2493477"
    },
    {
      "text": "Paolo Viviani and Tamar Flash. 1995. Minimum-jerk, two-thirds power law, and isochrony: converging approaches to movement planning. Journal of Experimental Psychology: Human Perception and Performance 21, 1(1995), 32–53. https://doi.org/10.1037/0096-1523.21.1.32",
      "doi": ""
    },
    {
      "text": "Michael Wang, HANG ZHAO, Xiaolei Zhou, Xiangshi Ren, and Xiaojun Bi. 2021. Variance and Distribution Models for Steering Tasks. Association for Computing Machinery, New York, NY, USA, 1122–1143. https://doi.org/10.1145/3472749.3474811",
      "doi": "10.1145/3472749.3474811"
    },
    {
      "text": "A.T. Welford, A.H. Norris, and N.W. Shock. 1969. Speed and accuracy of movement and their changes with age. Acta Psychologica 30(1969), 3–15. https://doi.org/10.1016/0001-6918(69)90034-1",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Edward Cutrell, Susumu Harada, and I. Scott MacKenzie. 2008. An Error Model for Pointing Based on Fitts’ Law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). ACM, New York, NY, USA, 1613–1622. https://doi.org/10.1145/1357054.1357306",
      "doi": "10.1145/1357054.1357306"
    },
    {
      "text": "Jacob O. Wobbrock, Alex Jansen, and Kristen Shinohara. 2011. Modeling and Predicting Pointing Errors in Two Dimensions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 1653–1656. https://doi.org/10.1145/1978942.1979183",
      "doi": "10.1145/1978942.1979183"
    },
    {
      "text": "Jason Wu, Chris Harrison, Jeffrey P. Bigham, and Gierad Laput. 2020. Automated Class Discovery and One-Shot Interactions for Acoustic Activity Recognition. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376875",
      "doi": "10.1145/3313831.3376875"
    },
    {
      "text": "Shota Yamanaka. 2018. Effect of Gaps with Penal Distractors Imposing Time Penalty in Touch-pointing Tasks. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). ACM, New York, NY, USA, 8 pages. https://doi.org/10.1145/3229434.3229435",
      "doi": "10.1145/3229434.3229435"
    },
    {
      "text": "Shota Yamanaka. 2021. Comparing Performance Models for Bivariate Pointing through a Crowdsourced Experiment. In Human-Computer Interaction – INTERACT 2021. Springer International Publishing, Gewerbestr, Switzerland, 76–92. https://doi.org/10.1007/978-3-030-85616-8_6 The error-rate dataset was obtained via personal communication..",
      "doi": "10.1007/978-3-030-85616-8_6"
    },
    {
      "text": "Shota Yamanaka. 2021. Utility of Crowdsourced User Experiments for Measuring the Central Tendency of User Performance to Evaluate Error-Rate Models on GUIs. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 9, 1 (Oct. 2021), 155–165.",
      "doi": ""
    },
    {
      "text": "Shota Yamanaka. 2022. A model to calculate success rates of tap operations: Usability estimation in UI design. https://techblog.yahoo.co.jp/entry/2021120930233778",
      "doi": ""
    },
    {
      "text": "Shota Yamanaka. 2023. Error-rate Prediction for Mouse-based Rectangular-target Pointing with no Knowledge of Movement Angles. arXiv.",
      "doi": ""
    },
    {
      "text": "Shota Yamanaka and Hiroki Usuba. 2020. Rethinking the Dual Gaussian Distribution Model for Predicting Touch Accuracy in On-Screen-Start Pointing Tasks. Proc. ACM Hum.-Comput. Interact. 4, ISS, Article 205 (Nov. 2020), 20 pages. https://doi.org/10.1145/3427333",
      "doi": "10.1145/3427333"
    },
    {
      "text": "Shota Yamanaka and Hiroki Usuba. 2022. Computing Touch-Point Ambiguity on Mobile Touchscreens for Modeling Target Selection Times. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 4, Article 186 (dec 2022), 21 pages. https://doi.org/10.1145/3494976",
      "doi": "10.1145/3494976"
    },
    {
      "text": "Shota Yamanaka, Hiroki Usuba, Haruki Takahashi, and Homei Miyashita. 2020. Servo-Gaussian Model to Predict Success Rates in Manual Tracking: Path Steering and Pursuit of 1D Moving Target. Association for Computing Machinery, New York, NY, USA, 844–857. https://doi.org/10.1145/3379337.3415896",
      "doi": "10.1145/3379337.3415896"
    },
    {
      "text": "Difeng Yu, Hai-Ning Liang, Xueshi Lu, Kaixuan Fan, and Barrett Ens. 2019. Modeling Endpoint Distribution of Pointing Selection Tasks in Virtual Reality Environments. ACM Trans. Graph. 38, 6, Article 218 (nov 2019), 13 pages. https://doi.org/10.1145/3355089.3356544",
      "doi": "10.1145/3355089.3356544"
    },
    {
      "text": "Ziyue Zhang, Jin Huang, and Feng Tian. 2020. Modeling the Uncertainty in Pointing of Moving Targets with Arbitrary Shapes. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3334480.3382875",
      "doi": "10.1145/3334480.3382875"
    }
  ]
}