{
  "doi": "10.1145/3544548.3580738",
  "title": "The Effects of Body Location and Biosignal Feedback Modality on Performance and Workload Using Electromyography in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Using biosignals through electromyography (EMG) and rendering them as feedback for hands-free interaction finally migrates to engaging virtual reality (VR) experiences for health and fitness-related applications. Previous work proposes various body locations as input sources and different output modalities for creating effective biofeedback loops. However, it is currently unknown which muscles and sensory modalities can provide optimal real-time interaction regarding the performance and perceived workload of the users. In two VR studies (N=18 and N=40) based on a Fitts’ law target selection task, we explored sensor placement at different body locations and investigate auditory, tactile, and visual feedback modalities. Objective and subjective results indicate that input performance can be improved by presenting muscle tension as simultaneous tactile and visual feedback. We contribute with recommendations for registration of isometric muscle contraction at different body locations and conclude that reproducing physiological feedback through multimodal channels can assist users interacting with EMG devices.",
  "tags": [
    "Physiological Sensing",
    "Electromyography",
    "Accessibility",
    "Biofeedback",
    "Virtual Reality"
  ],
  "authors": [
    {
      "name": "Jessica Sehrt",
      "institution": "Frankfurt University of Applied Sciences, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660574390",
      "orcid": "0000-0002-1187-2731"
    },
    {
      "name": "Tim Wißmann",
      "institution": "Frankfurt University of Applied Sciences, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781065",
      "orcid": "0000-0002-6790-8959"
    },
    {
      "name": "Jan Breitenbach",
      "institution": "Frankfurt University of Applied Sciences, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782183",
      "orcid": "0000-0002-7064-8369"
    },
    {
      "name": "Valentin Schwind",
      "institution": "Frankfurt University of Applied Sciences, Germany",
      "img": "/do/10.1145/contrib-99658638249/rel-imgonly/foto-256x256.jpg",
      "acmid": "99658638249",
      "orcid": "0000-0002-5072-8775"
    }
  ],
  "references": [
    {
      "text": "Md. Rezwanul Ahsan, Muhammad Ibn Ibrahimy, and Othman O. Khalifa. 2011. Electromygraphy (EMG) signal based hand gesture recognition using artificial neural network (ANN). In 2011 4th International Conference on Mechatronics (ICOM). 1–6. https://doi.org/10.1109/ICOM.2011.5937135",
      "doi": ""
    },
    {
      "text": "Adel Al-Jumaily and Ricardo A. Olivares. 2009. Electromyogram (EMG) Driven System Based Virtual Reality for Prosthetic and Rehabilitation Devices. In Proceedings of the 11th International Conference on Information Integration and Web-Based Applications and Services (Kuala Lumpur, Malaysia) (iiWAS ’09). Association for Computing Machinery, New York, NY, USA, 582–586. https://doi.org/10.1145/1806338.1806448",
      "doi": "10.1145/1806338.1806448"
    },
    {
      "text": "M. R. Al-Mulla, F. Sepulveda, M. Colley, and A. Kattan. 2009. Classification of localized muscle fatigue with genetic programming on sEMG during isometric contraction. In 2009 Annual International Conference of the IEEE Engineering in Medicine and Biology Society. 2633–2638. https://doi.org/10.1109/IEMBS.2009.5335368",
      "doi": ""
    },
    {
      "text": "Christoph Amma, Thomas Krings, Jonas Böer, and Tanja Schultz. 2015. Advancing Muscle-Computer Interfaces with High-Density Electromyography. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 929–938. https://doi.org/10.1145/2702123.2702501",
      "doi": "10.1145/2702123.2702501"
    },
    {
      "text": "Panagiotis K. Artemiadis and Kostas J. Kyriakopoulos. 2011. A Switching Regime Model for the EMG-Based Control of a Robot Arm. IEEE Transactions on Systems, Man, and Cybernetics, Part B (Cybernetics) 41, 1(2011), 53–63. https://doi.org/10.1109/TSMCB.2010.2045120",
      "doi": "10.1109/TSMCB.2010.2045120"
    },
    {
      "text": "Woodrow Barfield and Thomas Caudell. 2001. Basic concepts in wearable computers and augmented reality. In Fundamentals of wearable computers and augmented reality. CRC Press, 19–42.",
      "doi": ""
    },
    {
      "text": "John V Basmajian. 1988. Research foundations of EMG biofeedback in rehabilitation. Biofeedback and Self-regulation 13, 4 (1988), 275–298.",
      "doi": ""
    },
    {
      "text": "Karnika Biswas, Oishee Mazumder, and Ananda Sankar Kundu. 2012. Multichannel fused EMG based biofeedback system with virtual reality for gait rehabilitation. In 2012 4th International Conference on Intelligent Human Computer Interaction (IHCI). 1–6. https://doi.org/10.1109/IHCI.2012.6481834",
      "doi": ""
    },
    {
      "text": "Claudio Castellini and Patrick Van Der Smagt. 2009. Surface EMG in advanced hand prosthetics. Biological cybernetics 100, 1 (2009), 35–47.",
      "doi": ""
    },
    {
      "text": "Aniruddha Chatterjee, Vikram Aggarwal, Ander Ramos-Murguialday, Soumyadipta Acharya, and N.v Thakor. 2007. A brain-computer interface with vibrotactile biofeedback for haptic information. Journal of neuroengineering and rehabilitation 4 (02 2007), 40. https://doi.org/10.1186/1743-0003-4-40",
      "doi": ""
    },
    {
      "text": "Po-Jung Chen, I-Wen Penn, Shun-Hwa Wei, Long-Ren Chuang, and Wen-Hsu Sung. 2020. Augmented reality-assisted training with selected Tai-Chi movements improves balance control and increases lower limb muscle strength in older adults: A prospective randomized trial. Journal of Exercise Science & Fitness 18, 3 (2020), 142–147. https://doi.org/10.1016/j.jesf.2020.05.003",
      "doi": ""
    },
    {
      "text": "Kyung Yun Choi and Hiroshi Ishii. 2020. AmbienBeat: Wrist-Worn Mobile Tactile Biofeedback for Heart Rate Rhythmic Regulation. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (Sydney NSW, Australia) (TEI ’20). Association for Computing Machinery, New York, NY, USA, 17–30. https://doi.org/10.1145/3374920.3374938",
      "doi": "10.1145/3374920.3374938"
    },
    {
      "text": "Yun Lak Choi, Bo Kyung Kim, Yong Pil Hwang, Ok Kon Moon, and Wan Suk Choi. 2015. Effects of isometric exercise using biofeedback on maximum voluntary isometric contraction, pain, and muscle thickness in patients with knee osteoarthritis. Journal of physical therapy science 27, 1 (2015), 149–153.",
      "doi": ""
    },
    {
      "text": "Rubana Chowdhury, Mamun Bin Ibne Reaz, Ahmad Ashrif A Bakar, and Sharif Hasan. 2013. Muscle Contraction: The Subtle Way of Human Computer Interaction. Research Journal of Applied Sciences, Engineering and Technology 6 (07 2013), 2192–2196.",
      "doi": ""
    },
    {
      "text": "Jan Pieter Clarys and Jan Cabri. 1993. Electromyography and the study of sports movements: A review. Journal of Sports Sciences 11, 5 (1993), 379–448. https://doi.org/10.1080/02640419308730010 arXiv:https://doi.org/10.1080/02640419308730010PMID: 8301704.",
      "doi": ""
    },
    {
      "text": "Bret Contreras, Andrew D Vigotsky, Brad J Schoenfeld, Chris Beardsley, and John Cronin. [n. d.]. A comparison of two gluteus maximus EMG maximum voluntary isometric contraction positions - PubMed — pubmed.ncbi.nlm.nih.gov. https://pubmed.ncbi.nlm.nih.gov/26417543/. [Accessed 09-Sep-2022].",
      "doi": ""
    },
    {
      "text": "Enrico Costanza, Samuel A. Inverso, and Rebecca Allen. 2005. Toward Subtle Intimate Interfaces for Mobile Devices Using an EMG Controller(CHI ’05). Association for Computing Machinery, New York, NY, USA, 481–489. https://doi.org/10.1145/1054972.1055039",
      "doi": "10.1145/1054972.1055039"
    },
    {
      "text": "Enrico Costanza, Samuel A. Inverso, Rebecca Allen, and Pattie Maes. 2007. Intimate Interfaces in Action: Assessing the Usability and Subtlety of Emg-Based Motionless Gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 819–828. https://doi.org/10.1145/1240624.1240747",
      "doi": "10.1145/1240624.1240747"
    },
    {
      "text": "Marion Cousineau, Laurent Demany, and Daniel Pressnitzer. 2009. What makes a melody: The perceptual singularity of pitch sequences. The Journal of the Acoustical Society of America 126, 6 (2009), 3179–3187. https://doi.org/10.1121/1.3257206 arXiv:https://doi.org/10.1121/1.3257206",
      "doi": ""
    },
    {
      "text": "Jeffrey R Cram, Glenn S Kasman, and Jonathan Holtz. 1998. Introduction to surface electromyography. Aspen publishers.",
      "doi": ""
    },
    {
      "text": "Ronald V Croce. 1986. The effects of EMG biofeedback on strength acquisition. Biofeedback and Self-regulation 11, 4 (1986), 299–310.",
      "doi": ""
    },
    {
      "text": "Darpan Dhawan, Michael Barlow, and Erandi Lakshika. 2019. Prosthetic Rehabilitation Training in Virtual Reality. In 2019 IEEE 7th International Conference on Serious Games and Applications for Health (SeGAH). 1–8. https://doi.org/10.1109/SeGAH.2019.8882455",
      "doi": ""
    },
    {
      "text": "Andy Fields. 2013. Discovering statistics using IBM SPSS statistics. Thousand Oaks, CA (2013).",
      "doi": ""
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement.Journal of experimental psychology 47, 6 (1954), 381.",
      "doi": ""
    },
    {
      "text": "Ana Belén Gámez, Juan José Hernandez Morante, José Luis Martínez Gil, Francisco Esparza, and Carlos Manuel Martínez. 2019. The effect of surface electromyography biofeedback on the activity of extensor and dorsiflexor muscles in elderly adults: a randomized trial. Scientific reports 9, 1 (2019), 1–9.",
      "doi": ""
    },
    {
      "text": "Nadia Garcia-Hernandez, Karen Garza-Martinez, and Vicente Parra-Vega. 2018. Electromyography Biofeedback Exergames to Enhance Grip Strength and Motivation. Games for Health Journal 7, 1 (2018), 75–82. https://doi.org/10.1089/g4h.2017.0054 arXiv:https://doi.org/10.1089/g4h.2017.0054PMID: 29227162.",
      "doi": ""
    },
    {
      "text": "Marco Gazzoni and Giacinto Luigi Cerone. 2021. Augmented Reality Biofeedback for Muscle Activation Monitoring: Proof of Concept. 143–150. https://doi.org/10.1007/978-3-030-64610-3_17",
      "doi": ""
    },
    {
      "text": "Christopher Gilbert and Donald Moss. 2003. Biofeedback and biological monitoring. Handbook of mind-body medicine in primary care: Behavioral and physiological tools (2003), 109–122.",
      "doi": ""
    },
    {
      "text": "Alberto Greco, Gaetano Valenza, Antonio Bicchi, Matteo Bianchi, and Enzo Pasquale Scilingo. 2019. Assessment of muscle fatigue during isometric contraction using autonomic nervous system correlates. Biomedical Signal Processing and Control 51 (2019), 42–49. https://doi.org/10.1016/j.bspc.2019.02.007",
      "doi": ""
    },
    {
      "text": "José Guerreiro, Raul Martins, Hugo Plácido da Silva, Andre Lourenco, and Ana Fred. 2013. BITalino: A Multimodal Platform for Physiological Computing. ICINCO 2013 - Proceedings of the 10th International Conference on Informatics in Control, Automation and Robotics 1.",
      "doi": ""
    },
    {
      "text": "John Paulin Hansen, Vijay Rajanna, I. Scott MacKenzie, and Per Bækgaard. 2018. A Fitts’ Law Study of Click and Dwell Interaction by Gaze, Head and Mouse with a Head-Mounted Display. In Proceedings of the Workshop on Communication by Gaze Interaction (Warsaw, Poland) (COGAIN ’18). Association for Computing Machinery, New York, NY, USA, Article 7, 5 pages. https://doi.org/10.1145/3206343.3206344",
      "doi": "10.1145/3206343.3206344"
    },
    {
      "text": "Faizan Haque, Mathieu Nancel, and Daniel Vogel. 2015. Myopoint: Pointing and Clicking Using Forearm Mounted Electromyography and Inertial Motion Sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3653–3656. https://doi.org/10.1145/2702123.2702133",
      "doi": "10.1145/2702123.2702133"
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9(2006), 904–908. https://doi.org/10.1177/154193120605000909 arXiv:https://doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Donald Olding Hebb. 2005. The organization of behavior: A neuropsychological theory. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Hj Hermens, Bart Freriks, Roberto Merletti, Dick F. Stegeman, Joleen H. Blok, Gunter Rau, C. Disselhorst Klug, Gg Hägg, W. J. Blok, and Hermanus J. Hermens. 1999. European recommendations for surface electromyography: Results of the SENIAM Project.",
      "doi": ""
    },
    {
      "text": "Uganet Hernández Rosa, Jorge Velásquez Tlapanco, Catalina Lara Maya, Enrique Villarreal Ríos, Lidia Martínez González, Emma Rosa Vargas Daza, and Liliana Galicia Rodríguez. 2012. Comparison of the Effectiveness of Isokinetic vs Isometric Therapeutic Exercise in Patients With Osteoarthritis of Knee. Reumatología Clínica (English Edition) 8, 1 (2012), 10–14. https://doi.org/10.1016/j.reumae.2011.08.003",
      "doi": ""
    },
    {
      "text": "A Hirsch. 1862. Chronoscopic experiments on the speed of different senses and nerve transmission. Bulletin de la Société des Sciences de Neuchâtel 6 (1862), 100–14.",
      "doi": ""
    },
    {
      "text": "David Hryvniak, Robert P. Wilder, Jeffrey Jenkins, and Siobhan M. Statuta. 2021. 15 - Therapeutic Exercise. In Braddom’s Physical Medicine and Rehabilitation (Sixth Edition) (sixth edition ed.), David X. Cifu (Ed.). Elsevier, Philadelphia, 291–315.e4. https://doi.org/10.1016/B978-0-323-62539-5.00015-1",
      "doi": ""
    },
    {
      "text": "Xiaoling Hu, Kai Y. Tong, Rong Song, Vincent S. Tsang, Penny O. Leung, and Le Li. 2007. Variation of Muscle Coactivation Patterns in Chronic Stroke During Robot-Assisted Elbow Training. Archives of Physical Medicine and Rehabilitation 88, 8(2007), 1022–1029. https://doi.org/10.1016/j.apmr.2007.05.006",
      "doi": ""
    },
    {
      "text": "He Huang, Steven L Wolf, and Jiping He. 2006. Recent developments in biofeedback for neuromotor rehabilitation. Journal of neuroengineering and rehabilitation 3, 1(2006), 1–12.",
      "doi": ""
    },
    {
      "text": "Jianli Huang, Meiai Lin, Jianming Fu, Ya Sun, and Qiang Fang. 2021. An Immersive Motor Imagery Training System for Post-Stroke Rehabilitation Combining VR and EMG-based Real-Time Feedback. In 2021 43rd Annual International Conference of the IEEE Engineering in Medicine & Biology Society (EMBC). IEEE, 7590–7593.",
      "doi": ""
    },
    {
      "text": "Tadaaki Ikehara and Kazuyuki Kojima. 2020. Development of Biofeedback Device Using Optimal EMG Frequency Band for Prevention Muscle Fatigue. In 2020 IEEE 9th Global Conference on Consumer Electronics (GCCE). 808–809. https://doi.org/10.1109/GCCE50665.2020.9291801",
      "doi": ""
    },
    {
      "text": "ISO. 2012. 9241–411 Ergonomics of human-system interaction–Part 411: Evaluation methods for the design of physical input devices. International Organization for Standardization (2012).",
      "doi": ""
    },
    {
      "text": "Thomas W. Jackson and Pourya Farzaneh. 2012. Theory-based model of factors affecting information overload. International Journal of Information Management 32, 6(2012), 523–532. https://doi.org/10.1016/j.ijinfomgt.2012.04.006",
      "doi": ""
    },
    {
      "text": "Muhammad Jamal. 2012. Signal Acquisition Using Surface EMG and Circuit Design Considerations for Robotic Prosthesis. https://doi.org/10.5772/52556",
      "doi": ""
    },
    {
      "text": "Jakob Karolus, Felix Bachmann, Thomas Kosch, Albrecht Schmidt, and Paweł W. Woźniak. 2021. Facilitating Bodily Insights Using Electromyography-Based Biofeedback during Physical Activity. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction (Toulouse & Virtual, France) (MobileHCI ’21). Association for Computing Machinery, New York, NY, USA, Article 14, 15 pages. https://doi.org/10.1145/3447526.3472027",
      "doi": "10.1145/3447526.3472027"
    },
    {
      "text": "Jonghwa Kim, Stephan Mastnik, and Elisabeth André. 2008. EMG-based hand gesture recognition for realtime biosignal interfacing. In Proceedings of the 13th international conference on Intelligent user interfaces. 30–39.",
      "doi": "10.1145/1378773.1378778"
    },
    {
      "text": "David T. Kluger, Janell S. Joyner, Suzanne M. Wendelken, Tyler S. Davis, Jacob A. George, David M. Page, Douglas T. Hutchinson, Heather L. Benz, and Gregory A. Clark. 2019. Virtual Reality Provides an Effective Platform for Functional Evaluations of Closed-Loop Neuromyoelectric Control. IEEE Transactions on Neural Systems and Rehabilitation Engineering 27, 5(2019), 876–886. https://doi.org/10.1109/TNSRE.2019.2908817",
      "doi": ""
    },
    {
      "text": "Jarrod Knibbe, Paul Strohmeier, Sebastian Boring, and Kasper Hornbæk. 2017. Automatic Calibration of High Density Electric Muscle Stimulation. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 68 (sep 2017), 17 pages. https://doi.org/10.1145/3130933",
      "doi": "10.1145/3130933"
    },
    {
      "text": "Martin Kocur, Lukas Jackermeier, Valentin Schwind, and Niels Henze. 2023. The Effects of Avatar and Environment on Thermal Perception and Skin Temperature in Virtual Reality. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (CHI ’23), April 23-28, 2023, Hamburg, Germany, Vol. 1. Association for Computing Machinery, 1–23. https://doi.org/10.1145/3544548.3580668",
      "doi": "10.1145/3544548.3580668"
    },
    {
      "text": "Thomas Kosch, Mariam Hassib, and Albrecht Schmidt. 2016. The Brain Matters: A 3D Real-Time Visualization to Examine Brain Source Activation Leveraging Neurofeedback(CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 1570–1576. https://doi.org/10.1145/2851581.2892484",
      "doi": "10.1145/2851581.2892484"
    },
    {
      "text": "Zuzana Koudelkova, Roman Jasek, and Martina Zabcikova. 2020. Communication Tool for Disabled People Based on Surface Electromyography. In Proceedings of the 4th International Conference on Medical and Health Informatics (Kamakura City, Japan) (ICMHI 2020). Association for Computing Machinery, New York, NY, USA, 86–89. https://doi.org/10.1145/3418094.3418110",
      "doi": "10.1145/3418094.3418110"
    },
    {
      "text": "Hiroki Kurosawa, Daisuke Sakamoto, and Tetsuo Ono. 2018. MyoTilt: A Target Selection Method for Smartwatches Using the Tilting Operation and Electromyography. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 43, 11 pages. https://doi.org/10.1145/3229434.3229457",
      "doi": "10.1145/3229434.3229457"
    },
    {
      "text": "Junjie Lai, Yun Zhao, Yanjian Liao, Wensheng Hou, Ying Chen, Yao Zhang, Guanglin Li, and Xiaoying Wu. 2017. Design of a multi-degree-of-freedom virtual hand bench for myoelectrical prosthesis. In 2017 2nd International Conference on Advanced Robotics and Mechatronics (ICARM). 345–350. https://doi.org/10.1109/ICARM.2017.8273186",
      "doi": ""
    },
    {
      "text": "Benjamin CY Lee and Stuart M McGill. 2015. Effect of long-term isometric training on core/torso stiffness. The Journal of Strength & Conditioning Research 29, 6 (2015), 1515–1526.",
      "doi": ""
    },
    {
      "text": "Benjamin CY Lee and Stuart M McGill. 2015. Effect of long-term isometric training on core/torso stiffness. The Journal of Strength & Conditioning Research 29, 6 (2015), 1515–1526.",
      "doi": ""
    },
    {
      "text": "Sueyoon Lee, Abdallah El Ali, Maarten Wijntjes, and Pablo Cesar. 2022. Understanding and Designing Avatar Biosignal Visualizations for Social Virtual Reality Entertainment. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 425, 15 pages. https://doi.org/10.1145/3491102.3517451",
      "doi": "10.1145/3491102.3517451"
    },
    {
      "text": "Sojung Lee, Siyeon Kim, Daeyoung Lim, Dong-Eun Kim, and Wonyoung Jeong. 2021. Analysis of EMG Electrode Locations Using 3D Body Scanning for Digital Pattern Construction of a Smart EMG Suit. Sustainability 13, 5 (2021). https://doi.org/10.3390/su13052654",
      "doi": ""
    },
    {
      "text": "Yurong Li, Jun Chen, and Yuan Yang. 2019. A Method for Suppressing Electrical Stimulation Artifacts from Electromyography. International Journal of Neural Systems 29, 06 (2019), 1850054. https://doi.org/10.1142/S0129065718500545 arXiv:https://doi.org/10.1142/S0129065718500545PMID: 30646793.",
      "doi": ""
    },
    {
      "text": "Yu Liang, Dalei Wu, Dakila Ledesma, Chris Davis, Robert Slaughter, and Zibin Guo. 2018. Virtual Tai-Chi System: A smart-connected modality for rehabilitation. Smart Health 9-10(2018), 232–249. https://doi.org/10.1016/j.smhl.2018.07.021 CHASE 2018 Special Issue.",
      "doi": ""
    },
    {
      "text": "Lizheng Liu, Jianjun Cui, Jian Niu, Na Duan, Xianjia Yu, Qingqing Li, Shih-Ching Yeh, and Li-Rong Zheng. 2020. Design of Mirror Therapy System Base on Multi-Channel Surface-Electromyography Signal Pattern Recognition and Mobile Augmented Reality. Electronics 9, 12 (2020). https://doi.org/10.3390/electronics9122142",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Lewis L Chuang, and Pattie Maes. 2021. Physiological I/O. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 161, 4 pages. https://doi.org/10.1145/3411763.3450407",
      "doi": "10.1145/3411763.3450407"
    },
    {
      "text": "Joseph A Lucca and Susan Jean Recchiuti. 1983. Effect of electromyographic biofeedback on an isometric strengthening program. Physical therapy 63, 2 (1983), 200–203.",
      "doi": ""
    },
    {
      "text": "Mingxing Lyu, Wei-Hai Chen, Xilun Ding, Jianhua Wang, Zhongcai Pei, and Baochang Zhang. 2019. Development of an EMG-Controlled Knee Exoskeleton to Assist Home Rehabilitation in a Game Context. Frontiers in Neurorobotics 13 (2019). https://doi.org/10.3389/fnbot.2019.00067",
      "doi": ""
    },
    {
      "text": "Sha Ma, Martin Varley, Lik-Kwan Shark, and Jim Richards. 2010. EMG Biofeedback Based VR System for Hand Rotation and Grasping Rehabilitation. In 2010 14th International Conference Information Visualisation. 479–484. https://doi.org/10.1109/IV.2010.73",
      "doi": "10.1109/IV.2010.73"
    },
    {
      "text": "I. Scott MacKenzie and William Buxton. 1992. Extending Fitts’ Law to Two-Dimensional Tasks(CHI ’92). Association for Computing Machinery, New York, NY, USA, 219–226. https://doi.org/10.1145/142750.142794",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "Oishee Mazumder and Ananda Sankar Kundu. 2012. EMG Based Multichannel Human Computer Interface for Rehabilitation Training. In 8th National Conference on Medical Informatics.",
      "doi": ""
    },
    {
      "text": "Dennis J. McFarland and Anthony T. Cacace. 1992. Aspects of Short-Term Acoustic Recognition Memory: Modality and Serial Position Effects. Audiology 31, 6 (1992), 342–352. https://doi.org/10.3109/00206099209072922 arXiv:https://www.tandfonline.com/doi/pdf/10.3109/00206099209072922",
      "doi": ""
    },
    {
      "text": "Roberto Merletti and Dario Farina. 2016. Biophysics of the Generation of EMG Signals. 1–24. https://doi.org/10.1002/9781119082934.ch02",
      "doi": ""
    },
    {
      "text": "Philip J Millar, Cheri L McGowan, Véronique A Cornelissen, Claudio G Araujo, and Ian L Swaine. 2014. Evidence for the role of isometric exercise training in reducing blood pressure: potential mechanisms and future directions. Sports Medicine 44, 3 (2014), 345–356.",
      "doi": ""
    },
    {
      "text": "Clara Moge, Katherine Wang, and Youngjun Cho. 2022. Shared User Interfaces of Physiological Data: Systematic Review of Social Biofeedback Systems and Contexts in HCI. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 301, 16 pages. https://doi.org/10.1145/3491102.3517495",
      "doi": "10.1145/3491102.3517495"
    },
    {
      "text": "Inhyuk Moon, Myungjoon Lee, Junuk Chu, and Museong Mun. 2005. Wearable EMG-based HCI for Electric-Powered Wheelchair Users with Motor Disabilities. In Proceedings of the 2005 IEEE International Conference on Robotics and Automation. 2649–2654. https://doi.org/10.1109/ROBOT.2005.1570513",
      "doi": ""
    },
    {
      "text": "Fabricio Muri, Celina Carbajal, Ana M Echenique, Hugo Fernández, and Natalia M López. 2013. Virtual reality upper limb model controlled by EMG signals. Journal of Physics: Conference Series 477 (dec 2013), 012041. https://doi.org/10.1088/1742-6596/477/1/012041",
      "doi": ""
    },
    {
      "text": "Lennart Erik Nacke, Michael Kalyn, Calvin Lough, and Regan Lee Mandryk. 2011. Biofeedback Game Design: Using Direct and Indirect Physiological Control to Enhance Game Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 103–112. https://doi.org/10.1145/1978942.1978958",
      "doi": "10.1145/1978942.1978958"
    },
    {
      "text": "Go Nakamura, Taro Shibanoki, Futoshi Mizobe, Akito Masuda, Yuichiro Honda, Takaaki Chin, and Toshio Tsuji. 2016. A High-Fidelity Virtual Training System for Myoelectric Prostheses Using an Immersive HMD. In Proceedings of the International Convention on Rehabilitation Engineering & Assistive Technology(i-CREATe 2016). Singapore Therapeutic, Assistive & Rehabilitative Technologies (START) Centre, Midview City, SGP, Article 18, 4 pages.",
      "doi": "10.5555/3014393.3014416"
    },
    {
      "text": "Nurhazimah Nazmi, Mohd Azizi Abdul Rahman, Shin-Ichiroh Yamamoto, Siti Anom Ahmad, Hairi Zamzuri, and Saiful Amri Mazlan. 2016. A review of classification techniques of EMG signals during isotonic and isometric contractions. Sensors 16, 8 (2016), 1304.",
      "doi": ""
    },
    {
      "text": "Jun Nishida and Kenji Suzuki. 2017. BioSync: A Paired Wearable Device for Blending Kinesthetic Experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3316–3327. https://doi.org/10.1145/3025453.3025829",
      "doi": "10.1145/3025453.3025829"
    },
    {
      "text": "Dustin J. Oranchuk, Adam G. Storey, André R. Nelson, and John B. Cronin. 2019. Isometric training and long-term adaptations: Effects of muscle length, intensity, and intent: A systematic review. Scandinavian Journal of Medicine & Science in Sports 29, 4 (2019), 484–503. https://doi.org/10.1111/sms.13375 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/sms.13375",
      "doi": ""
    },
    {
      "text": "Yun Suen Pai, Tilman Dingler, and Kai Kunze. 2019. Assessing hands-free interactions for VR using eye gaze and electromyography. Virtual Reality 23, 2 (2019), 119–131.",
      "doi": "10.1007/s10055-018-0371-2"
    },
    {
      "text": "Francesca Palermo, Matteo Cognolato, Ivan Eggel, Manfredo Atzori, and Henning Müller. 2019. An Augmented Reality Environment to Provide Visual Feedback to Amputees During SEMG Data Acquisitions. In Towards Autonomous Robotic Systems: 20th Annual Conference, TAROS 2019, London, UK, July 3–5, 2019, Proceedings, Part II(London, United Kingdom). Springer-Verlag, Berlin, Heidelberg, 3–14. https://doi.org/10.1007/978-3-030-25332-5_1",
      "doi": "10.1007/978-3-030-25332-5_1"
    },
    {
      "text": "Francesca Palermo, Matteo Cognolato, Ivan Eggel, Manfredo Atzori, and Henning Müller. 2019. An Augmented Reality Environment to Provide Visual Feedback to Amputees During SEMG Data Acquisitions. In Towards Autonomous Robotic Systems: 20th Annual Conference, TAROS 2019, London, UK, July 3–5, 2019, Proceedings, Part II(London, United Kingdom). Springer-Verlag, Berlin, Heidelberg, 3–14. https://doi.org/10.1007/978-3-030-25332-5_1",
      "doi": "10.1007/978-3-030-25332-5_1"
    },
    {
      "text": "Arrigo Palumbo, Patrizia Vizza, Barbara Calabrese, and Nicola Ielpo. 2021. Biopotential Signal Monitoring Systems in Rehabilitation: A Review. Sensors 21, 21 (2021). https://doi.org/10.3390/s21217172",
      "doi": ""
    },
    {
      "text": "Erik Peper, Richard Harvey, and Naoki TAKEBAYASHI. 2009. Biofeedback an evidence based approach in clinical practice. Japanese Journal of Biofeedback Research 36, 1 (2009), 3–10. https://doi.org/10.20595/jjbf.36.1_3",
      "doi": ""
    },
    {
      "text": "Ivan Phelan, Madelynne Arden, Maria Matsangidou, Alicia Carrion-Plaza, and Shirley Lindley. 2021. Designing a Virtual Reality Myoelectric Prosthesis Training System for Amputees. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems(Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 49, 7 pages. https://doi.org/10.1145/3411763.3443454",
      "doi": "10.1145/3411763.3443454"
    },
    {
      "text": "Nicolas Place, Boris Matkowski, Alain Martin, and Romuald Lepers. 2006. Synergists activation pattern of the quadriceps muscle differs when performing sustained isometric contractions with different EMG biofeedback. Experimental brain research 174, 4 (2006), 595–603.",
      "doi": ""
    },
    {
      "text": "Matthew S. Prewett, Liuquin Yang, Frederick R. B. Stilson, Ashley A. Gray, Michael D. Coovert, Jennifer Burke, Elizabeth Redden, and Linda R. Elliot. 2006. The Benefits of Multimodal Information: A Meta-Analysis Comparing Visual and Visual-Tactile Feedback. In Proceedings of the 8th International Conference on Multimodal Interfaces (Banff, Alberta, Canada) (ICMI ’06). Association for Computing Machinery, New York, NY, USA, 333–338. https://doi.org/10.1145/1180995.1181057",
      "doi": "10.1145/1180995.1181057"
    },
    {
      "text": "Jennifer Reed and Jimmy D Bowen. 2008. Chapter 33 - Principles of Sports Rehabilitation. In The Sports Medicine Resource Manual, Peter H. Seidenberg and Anthony I. Beutler (Eds.). W.B. Saunders, Philadelphia, 431–436. https://doi.org/10.1016/B978-141603197-0.10033-3",
      "doi": ""
    },
    {
      "text": "Holger Regenbrecht, Joerg Hauber, Ralph Schoenfelder, and Andreas Maegerlein. 2005. Virtual Reality Aided Assembly with Directional Vibro-Tactile Feedback(GRAPHITE ’05). Association for Computing Machinery, New York, NY, USA, 381–387. https://doi.org/10.1145/1101389.1101464",
      "doi": "10.1145/1101389.1101464"
    },
    {
      "text": "Lorcan Reidy, Dennis Chan, Charles Nduka, and Hatice Gunes. 2020. Facial Electromyography-Based Adaptive Virtual Reality Gaming for Cognitive Training. In Proceedings of the 2020 International Conference on Multimodal Interaction (Virtual Event, Netherlands) (ICMI ’20). Association for Computing Machinery, New York, NY, USA, 174–183. https://doi.org/10.1145/3382507.3418845",
      "doi": "10.1145/3382507.3418845"
    },
    {
      "text": "Alejandro Lopez Rincon, Hiroshi Yamasaki, and Shingo Shimoda. 2016. Design of a video game for rehabilitation using motion capture, EMG analysis and virtual reality. In 2016 International Conference on Electronics, Communications and Computers (CONIELECOMP). 198–204. https://doi.org/10.1109/CONIELECOMP.2016.7438575",
      "doi": ""
    },
    {
      "text": "Aidan D Roche, Ben Lakey, Irene Mendez, Ivan Vujaklija, Dario Farina, and Oskar C Aszmann. 2019. Clinical perspectives in upper limb prostheses: An update. Current Surgery Reports 7, 3 (2019), 1–10.",
      "doi": ""
    },
    {
      "text": "Aidan D Roche, Hubertus Rehbaum, Dario Farina, and Oskar C Aszmann. 2014. Prosthetic myoelectric control strategies: a clinical perspective. Current Surgery Reports 2, 3 (2014), 1–11.",
      "doi": ""
    },
    {
      "text": "Javier San Agustin, John Paulin Hansen, Dan Witzner Hansen, and Henrik Skovsgaard. 2009. Low-Cost Gaze Pointing and EMG Clicking. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems (Boston, MA, USA) (CHI EA ’09). Association for Computing Machinery, New York, NY, USA, 3247–3252. https://doi.org/10.1145/1520340.1520466",
      "doi": "10.1145/1520340.1520466"
    },
    {
      "text": "Mirella Santos Pessoa de Melo, José Gomes da Silva Neto, João Marcelo Xavier Natario Teixeira, Alana Elza Fontes Da Gama, and Veronica Teichrieb. 2019. An EMG-Based Virtual Reality Application for Motor Rehabilitation. In 2019 21st Symposium on Virtual and Augmented Reality (SVR). 170–177. https://doi.org/10.1109/SVR.2019.00041",
      "doi": ""
    },
    {
      "text": "T Scott Saponas, Desney S. Tan, Dan Morris, and Ravin Balakrishnan. 2008. Demonstrating the Feasibility of Using Forearm Electromyography for Muscle-Computer Interfaces(CHI ’08). Association for Computing Machinery, New York, NY, USA, 515–524. https://doi.org/10.1145/1357054.1357138",
      "doi": "10.1145/1357054.1357138"
    },
    {
      "text": "T. Scott Saponas, Desney S. Tan, Dan Morris, Jim Turner, and James A. Landay. 2010. Making Muscle-Computer Interfaces More Practical. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 851–854. https://doi.org/10.1145/1753326.1753451",
      "doi": "10.1145/1753326.1753451"
    },
    {
      "text": "Steven L Schandler and William W Grings. 1974. A system for providing tactile EMG biofeedback. Behavior Research Methods & Instrumentation 6, 6(1974), 541–542.",
      "doi": ""
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Nico Haas, and Niels Henze. 2019. Using Presence Questionnaires in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300590",
      "doi": "10.1145/3290605.3300590"
    },
    {
      "text": "Jessica Sehrt, Bent Braams, Niels Henze, and Valentin Schwind. 2022. Social Acceptability in Context: Stereotypical Perception of Shape, Body Location, and Usage of Wearable Devices. Big Data and Cognitive Computing 6, 4 (2022). https://doi.org/10.3390/bdcc6040100",
      "doi": ""
    },
    {
      "text": "Aaron R. Seitz. 2013. Cognitive Neuroscience: Targeting Neuroplasticity with Neural Decoding and Biofeedback. Current Biology 23, 5 (2013), R210–R212. https://doi.org/10.1016/j.cub.2013.01.015",
      "doi": ""
    },
    {
      "text": "Da Shuhan, Hirofumi Tanabe, Yoshifumi Morita, and Zhou Peichen. 2019. Effect of Introducing EMG Biofeedback to a Finger Extensor Facilitation Training Device for Hemiplegic Patients after Strokes. In 2019 19th International Conference on Control, Automation and Systems (ICCAS). 184–187. https://doi.org/10.23919/ICCAS47443.2019.8971742",
      "doi": "10.23919/ICCAS47443.2019.8971742"
    },
    {
      "text": "A. N. Silva, K. L. Nogueira, M. B. Silva, A. Cardoso, E. A. Lamounier, and A. B. Soares. 2013. A virtual electro myographic biofeedback environment for motor rehabilitation therapies. In 2013 ISSNIP Biosignals and Biorobotics Conference: Biosignals and Robotics for Better and Safer Living (BRC). 1–4. https://doi.org/10.1109/BRC.2013.6487541",
      "doi": ""
    },
    {
      "text": "Stanislaw Solnik, Paul DeVita, Patrick Rider, Ben Long, and Tibor Hortobagyi. 2008. Teager–Kaiser Operator improves the accuracy of EMG onset detection independent of signal-to-noise ratio. Acta of bioengineering and biomechanics / Wrocław University of Technology 10 (02 2008), 65–8.",
      "doi": ""
    },
    {
      "text": "James P Stannard, Andrew H Schmidt, Andreas Wentzensen, Florian Gebhard, Paul Alfred Grützner, Steffen Ruchholtz, and Ulrich Stöckle. 2021. Spezielle Unfallchirurgie. Thieme.",
      "doi": ""
    },
    {
      "text": "Catriona Steele. 2012. Applications of EMG in clinical and sports medicine. BoD–Books on Demand.",
      "doi": ""
    },
    {
      "text": "Kotaro Takeda, Genichi Tanino, and Hiroyuki Miyasaka. 2017. Review of devices used in neuromuscular electrical stimulation for stroke rehabilitation. Medical devices (Auckland, NZ) 10 (2017), 207.",
      "doi": ""
    },
    {
      "text": "Atau Tanaka and R. Benjamin Knapp. 2002. Multimodal Interaction in Music Using the Electromyogram and Relative Position Sensing(NIME ’02). National University of Singapore, SGP, 1–6.",
      "doi": ""
    },
    {
      "text": "Drew Tiene. 2000. Sensory Mode and \"Information Load\": Examining the Effects of Timing on Multisensory Processing. International Journal of Instructional Media 27 (01 2000), 183–198.",
      "doi": ""
    },
    {
      "text": "Tomáš Tisančín, Adam J. Sporka, and Ondřej Poláček. 2014. EMG Sensors as Virtual Input Devices. In Proceedings of the 2014 Mulitmedia, Interaction, Design and Innovation International Conference on Multimedia, Interaction, Design and Innovation (Warsaw, Poland) (MIDI ’14). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/2643572.2643591",
      "doi": "10.1145/2643572.2643591"
    },
    {
      "text": "Cinthya Lourdes Toledo-Peral, Gabriel Vega-Martínez, Jorge Airy Mercado-Gutiérrez, Gerardo Rodríguez-Reyes, Arturo Vera-Hernández, Lorenzo Leija-Salas, and Josefina Gutiérrez-Martínez. 2022. Virtual/Augmented Reality for Rehabilitation Applications Using Electromyography as Control/Biofeedback: Systematic Literature Review. Electronics 11, 14 (2022). https://doi.org/10.3390/electronics11142271",
      "doi": ""
    },
    {
      "text": "Yasunori Tsubouchi and Kenji Suzuki. 2010. BioTones: A wearable device for EMG auditory biofeedback. In 2010 Annual International Conference of the IEEE Engineering in Medicine and Biology. 6543–6546. https://doi.org/10.1109/IEMBS.2010.5627097",
      "doi": ""
    },
    {
      "text": "Laia Turmo Vidal, Hui Zhu, and Abraham Riego-Delgado. 2020. BodyLights: Open-Ended Augmented Feedback to Support Training Towards a Correct Exercise Execution. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376268",
      "doi": "10.1145/3313831.3376268"
    },
    {
      "text": "Angela Vujic, Christopher Krause, Georgette Tso, Jiaqi Lin, Bicheng Han, and Pattie Maes. 2019. Gut-Brain Computer Interfacing (GBCI) : Wearable Monitoring of Gastric Myoelectric Activity. In 2019 41st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). 5886–5889. https://doi.org/10.1109/EMBC.2019.8856568",
      "doi": ""
    },
    {
      "text": "Qian Wang, Xiang Chen, Ruizhi Chen, Yuwei Chen, and Xu Zhang. 2013. Electromyography-Based Locomotion Pattern Recognition and Personal Positioning Toward Improved Context-Awareness Applications. IEEE Transactions on Systems, Man, and Cybernetics: Systems 43, 5(2013), 1216–1227. https://doi.org/10.1109/TSMC.2013.2256857",
      "doi": ""
    },
    {
      "text": "Joseph P. Weigel and Darryl Millis. 2014. 24 - Biomechanics of Physical Rehabilitation and Kinematics of Exercise. In Canine Rehabilitation and Physical Therapy (Second Edition) (second edition ed.), Darryl Millis and David Levine (Eds.). W.B. Saunders, St. Louis, 401–430. https://doi.org/10.1016/B978-1-4377-0309-2.00024-7",
      "doi": ""
    },
    {
      "text": "Jay M Weiss, Lyn D Weiss, and Julie K Silver. 2021. Easy EMG-E-Book: A Guide to Performing Nerve Conduction Studies and Electromyography. Elsevier Health Sciences.",
      "doi": ""
    },
    {
      "text": "Christopher Wickens. 2008. Multiple Resources and Mental Workload. Human factors 50 (07 2008), 449–55. https://doi.org/10.1518/001872008X288394",
      "doi": ""
    },
    {
      "text": "Yukang Yan, Chun Yu, Xin Yi, and Yuanchun Shi. 2018. HeadGesture: Hands-Free Input Approach Leveraging Head Movements for HMD Devices. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 4, Article 198 (dec 2018), 23 pages. https://doi.org/10.1145/3287076",
      "doi": "10.1145/3287076"
    },
    {
      "text": "Caglar Yildirim. 2022. Point and Select: Effects of Multimodal Feedback on Text Entry Performance in Virtual Reality. International Journal of Human–Computer Interaction 0, 0(2022), 1–15. https://doi.org/10.1080/10447318.2022.2107330 arXiv:https://doi.org/10.1080/10447318.2022.2107330",
      "doi": ""
    },
    {
      "text": "Ji Yoo, Dong Lee, Yon Sim, Joshua You, and Cheol Kim. 2014. Effects of innovative virtual reality game and EMG biofeedback on neuromotor control in cerebral palsy. Bio-medical materials and engineering 24 (09 2014), 3613–8. https://doi.org/10.3233/BME-141188",
      "doi": ""
    },
    {
      "text": "Bin Yu, Mathias Funk, Jun Hu, and Loe Feijs. 2018. Unwind: a musical biofeedback for relaxation assistance. Behaviour & Information Technology 37, 8 (2018), 800–814. https://doi.org/10.1080/0144929X.2018.1484515 arXiv:https://doi.org/10.1080/0144929X.2018.1484515",
      "doi": ""
    },
    {
      "text": "TNST Zawawi, AR Abdullah, MH Jopri, T Sutikno, NM Saad, and R Sudirman. 2018. A review of electromyography signal analysis techniques for musculoskeletal disorders. Indonesian Journal of Electrical Engineering and Computer Science 11, 3(2018), 1136–1146.",
      "doi": ""
    },
    {
      "text": "Xu Zhang, Xiang Chen, Yun Li, Vuokko Lantz, Kongqiao Wang, and Jihai Yang. 2011. A Framework for Hand Gesture Recognition Based on Accelerometer and EMG Sensors. IEEE Transactions on Systems, Man, and Cybernetics - Part A: Systems and Humans 41, 6 (2011), 1064–1076. https://doi.org/10.1109/TSMCA.2011.2116004",
      "doi": "10.1109/TSMCA.2011.2116004"
    },
    {
      "text": "Yang Zhou, Chaoyang Chen, Mark Cheng, Sreten Franovic, Stephanie Muh, and Stephen Lemos. 2020. Real-Time Surface EMG Pattern Recognition for Shoulder Motions Based on Support Vector Machine. In Proceedings of the 2020 9th International Conference on Computing and Pattern Recognition (Xiamen, China) (ICCPR 2020). Association for Computing Machinery, New York, NY, USA, 63–66. https://doi.org/10.1145/3436369.3437434",
      "doi": "10.1145/3436369.3437434"
    },
    {
      "text": "Yu Zhuang, Shaowei Yao, Chenming Ma, and Rong Song. 2019. Admittance Control Based on EMG-Driven Musculoskeletal Model Improves the Human–Robot Synchronization. IEEE Transactions on Industrial Informatics 15, 2 (2019), 1211–1218. https://doi.org/10.1109/TII.2018.2875729",
      "doi": ""
    }
  ]
}