{
  "doi": "10.1145/3544548.3580885",
  "title": "Embodying the Algorithm: Exploring Relationships with Large Language Models Through Artistic Performance",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2023,
  "badges": [],
  "abstract": "Despite the proliferation of research on how people engage with and experience algorithmic systems, the materiality and physicality of these experiences is often overlooked. We tend to forget about bodies. The Embodying the Algorithm1 project worked with artists to explore the experience of translating algorithmically produced performance instructions through human bodies. As performers interpreted the rules of engagement produced by GPT-3, they struggled with the lack of consideration the rules showed for the limits of the human body. Performers made sense of their experience through personification, reflexivity, and interpretation, which gave rise to three modes of relating with the algorithm – agonistic, perfunctory, and agreeable. We demonstrate that collaboration with algorithmic systems is ultimately impossible as people can only relate to algorithmic systems (a one-way relation) due to the material limitations of algorithmic systems for reciprocity, understanding, and consideration for the human body.",
  "tags": [
    "Human-Computer Interaction",
    "Embodiment",
    "Algorithms",
    "GPT-3"
  ],
  "authors": [
    {
      "name": "Mirabelle Jones",
      "institution": "Department of Computer Science, University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660579298",
      "orcid": "0000-0001-5029-9344"
    },
    {
      "name": "Christina Neumayer",
      "institution": "Department of Communication, University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779226",
      "orcid": "0000-0003-0450-2983"
    },
    {
      "name": "Irina Shklovski",
      "institution": "Department of Computer Science, University of Copenhagen, Denmark and Department of Communication, University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81100288406/rel-imgonly/portraits_2019-2020_colour1.jpeg",
      "acmid": "81100288406",
      "orcid": "0000-0003-1874-0958"
    }
  ],
  "references": [
    {
      "text": "Shilpi Aggarwal, Dipanjan Goswami, Madhurima Hooda, Amirta Chakravarty, Arpan Kar, and Vasudha. 2020. Recommendation Systems for Interactive Multimedia Entertainment. In Data Visualization and Knowledge Engineering: Spotting Data Points with Artificial Intelligence, Jude Hemanth, Madhulika Bhatia and Oana Geman (eds.). Springer International Publishing, Cham, 23–48. DOI:https://doi.org/10.1007/978-3-030-25797-2_2",
      "doi": ""
    },
    {
      "text": "Quickchat AI. 2022. Quickchat AI | Technology to build AI Assistants that talk like a Human. Retrieved December 5, 2022 from https://www.quickchat.ai/",
      "doi": ""
    },
    {
      "text": "Arifa Akbar. 2021. Rise of the robo-drama: Young Vic creates new play using artificial intelligence. The Guardian. Retrieved September 13, 2022 from https://www.theguardian.com/stage/2021/aug/24/rise-of-the-robo-drama-young-vic-creates-new-play-using-artificial-intelligence",
      "doi": ""
    },
    {
      "text": "Algolia. 2022. Site Search & Discovery powered by AI. Algolia. Retrieved December 5, 2022 from https://www.algolia.com/",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib. 2021. To Live in Their Utopia: Why Algorithmic Systems Create Absurd Outcomes. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA, 1–9. DOI:https://doi.org/10.1145/3411764.3445740",
      "doi": "10.1145/3411764.3445740"
    },
    {
      "text": "Mike Ananny. 2016. Toward an Ethics of Algorithms: Convening, Observation, Probability, and Timeliness. Science, Technology, & Human Values 41, 1 (January 2016), 93–117. DOI:https://doi.org/10.1177/0162243915606523",
      "doi": ""
    },
    {
      "text": "Kristina Andersen, Laura Devendorf, James Pierce, Ron Wakkary, and Daniela K. Rosner. 2018. Disruptive Improvisations: Making Use of Non-Deterministic Art Practices in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA ’18), Association for Computing Machinery, New York, NY, USA, 1–8. DOI:https://doi.org/10.1145/3170427.3170630",
      "doi": "10.1145/3170427.3170630"
    },
    {
      "text": "Paolo Atzori and Kirk Woolford. 2022. Extended-Body: Interview with Stelarc. Retrieved December 13, 2022 from https://web.stanford.edu/dept/HPS/stelarc/a29-extended_body.html",
      "doi": ""
    },
    {
      "text": "Jascha Bareis and Christian Katzenbach. 2022. Talking AI into Being: The Narratives and Imaginaries of National AI Strategies and Their Performative Politics. Science, Technology, & Human Values 47, 5 (September 2022), 855–881. DOI:https://doi.org/10.1177/01622439211030007",
      "doi": ""
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Trans. Comput.-Hum. Interact. 12, 2 (June 2005), 149–173. DOI:https://doi.org/10.1145/1067860.1067862",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Emily M. Bender, Timnit Gebru, Angelina McMillan-Major, and Shmargaret Shmitchell. 2021. On the Dangers of Stochastic Parrots: Can Language Models Be Too Big? In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (FAccT ’21), Association for Computing Machinery, New York, NY, USA, 610–623. DOI:https://doi.org/10.1145/3442188.3445922",
      "doi": "10.1145/3442188.3445922"
    },
    {
      "text": "Emily M. Bender and Alexander Koller. 2020. Climbing towards NLU: On Meaning, Form, and Understanding in the Age of Data. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, Association for Computational Linguistics, Online, 5185–5198. DOI:https://doi.org/10.18653/v1/2020.acl-main.463",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12), Association for Computing Machinery, New York, NY, USA, 2005–2014. DOI:https://doi.org/10.1145/2207676.2208347",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Steve Benford, Richard Ramchurn, Joe Marshall, Max L. Wilson, Matthew Pike, Sarah Martindale, Adrian Hazzard, Chris Greenhalgh, Maria Kallionpää, Paul Tennent, and Brendan Walker. 2021. Contesting control: journeys through surrender, self-awareness and looseness of control in embodied interaction. Human–Computer Interaction 36, 5–6 (October 2021), 361–389. DOI:https://doi.org/10.1080/07370024.2020.1754214",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin. 2019. Race after technology: abolitionist tools for the new Jim code. Polity, Medford, MA.",
      "doi": ""
    },
    {
      "text": "Josh Berson. 2015. Computable Bodies: Instrumented Life and the Human Somatic Niche (1st ed.). Bloomsbury Publishing, New York, NY.",
      "doi": ""
    },
    {
      "text": "Andy Beta. 2019. Inside the the World's First Mainstream Album Made With AI. Vulture. Retrieved November 23, 2022 from https://www.vulture.com/2019/11/holly-herndon-on-proto-an-album-made-with-ai.html",
      "doi": ""
    },
    {
      "text": "Sophie Bishop. 2018. Anxiety, panic and self-optimization: Inequalities and the YouTube algorithm. Convergence 24, 1 (February 2018), 69–84. DOI:https://doi.org/10.1177/1354856517736978",
      "doi": ""
    },
    {
      "text": "Henk Bogdorff. 2010. The production of knowledge in artistic research. In The Routledge Companion to Research in the Arts. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Gwern Branwen. 2020. GPT-3 Creative Fiction. (June 2020). Retrieved October 18, 2021 from https://www.gwern.net/GPT-3",
      "doi": ""
    },
    {
      "text": "Kristopher Brooks. 2022. Twitter kills automatic photo-cropping feature after complaints of racial bias. Retrieved September 10, 2022 from https://www.cbsnews.com/news/twitter-kills-its-automatic-cropping-feature-after-complaints/",
      "doi": ""
    },
    {
      "text": "Tom B. Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel M. Ziegler, Jeffrey Wu, Clemens Winter, Christopher Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. arXiv:2005.14165 [cs] (July 2020). Retrieved May 2, 2021 from http://arxiv.org/abs/2005.14165",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2017. The algorithmic imaginary: exploring the ordinary affects of Facebook algorithms. Information, Communication & Society 20, 1 (January 2017), 30–44. DOI:https://doi.org/10.1080/1369118X.2016.1154086",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2018. If ... Then: Algorithmic Power and Politics. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini. 2022. Gender Shades. MIT Media Lab. Retrieved August 18, 2022 from https://www.media.mit.edu/publications/full-gender-shades-thesis-17/",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2016. How the machine ‘thinks’: Understanding opacity in machine learning algorithms. Big Data & Society 3, 1 (June 2016), 2053951715622512. DOI:https://doi.org/10.1177/2053951715622512",
      "doi": ""
    },
    {
      "text": "Jenna Burrell and Marion Fourcade. 2021. The Society of Algorithms. Annual Review of Sociology 47, 1 (2021), null. DOI:https://doi.org/10.1146/annurev-soc-090820-020800",
      "doi": ""
    },
    {
      "text": "Ángel Alexander Cabrera, Marco Tulio Ribeiro, Bongshin Lee, Rob DeLine, Adam Perer, and Steven M. Drucker. 2022. What Did My AI Learn? How Data Scientists Make Sense of Model Behavior. ACM Trans. Comput.-Hum. Interact. (May 2022). DOI:https://doi.org/10.1145/3542921",
      "doi": "10.1145/3542921"
    },
    {
      "text": "Alexander Campolo and Kate Crawford. 2020. Enchanted Determinism: Power without Responsibility in Artificial Intelligence. Engaging Science, Technology, and Society 6, (January 2020), 1. DOI:https://doi.org/10.17351/ests2020.277",
      "doi": ""
    },
    {
      "text": "Stuart K. Card, Allen Newell, and Thomas P. Moran. 1983. The Psychology of Human-Computer Interaction. L. Erlbaum Associates Inc., USA.",
      "doi": "10.5555/578027"
    },
    {
      "text": "Leonardo De Cosmo. 2022. Google Engineer Claims AI Chatbot Is Sentient: Why That Matters. Scientific American. Retrieved September 9, 2022 from https://www.scientificamerican.com/article/google-engineer-claims-ai-chatbot-is-sentient-why-that-matters/",
      "doi": ""
    },
    {
      "text": "Kate Crawford. 2016. Can an Algorithm be Agonistic? Ten Scenes from Life in Calculated Publics. Science, Technology, & Human Values 41, 1 (January 2016), 77–92. DOI:https://doi.org/10.1177/0162243915589635",
      "doi": ""
    },
    {
      "text": "Kate Crawford. 2021. Atlas of AI: power, politics, and the planetary costs of artificial intelligence. Yale University Press, New Haven.",
      "doi": ""
    },
    {
      "text": "Emmelyn A. J. Croes and Marjolijn L. Antheunis. 2021. Can we be friends with Mitsuku? A longitudinal study on the process of relationship formation between humans and a social chatbot. Journal of Social and Personal Relationships 38, 1 (January 2021), 279–300. DOI:https://doi.org/10.1177/0265407520959463",
      "doi": ""
    },
    {
      "text": "Cristina Demaria. 2004. The Performative Body of Marina Abramović: Rerelating (in) Time and Space. European Journal of Women's Studies 11, 3 (August 2004), 295–307. DOI:https://doi.org/10.1177/1350506804044464",
      "doi": ""
    },
    {
      "text": "GPT-3 Demo. 2022. Email Generation | GPT-3 Demo. Retrieved December 5, 2022 from https://gpt3demo.com/category/email-generation",
      "doi": ""
    },
    {
      "text": "Emily Denton, Ian Kivlichan, Vinodkumar Prabhakaran, and Mark Diaz. 2021. Whose Ground Truth? Accounting for Individual and Collective Identities Underlying Dataset Annotation. Retrieved November 22, 2022 from https://www.researchgate.net/publication/356920614_Whose_Ground_Truth_Accounting_for_Individual_and_Collective_Identities_Underlying_Dataset_Annotation",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. arXiv:1810.04805 [cs] (May 2019). Retrieved October 18, 2021 from http://arxiv.org/abs/1810.04805",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial design. MIT Press, Cambridge, Mass.",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Paul Dourish. 2001. Where the Action Is: The Foundations of Embodied Interaction. MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Paul Dourish. 2017. The Stuff of Bits: An Essay on the Materialities of Information. DOI:https://doi.org/10.7551/mitpress/10999.001.0001",
      "doi": ""
    },
    {
      "text": "Claudia Grigg Edo. 2017. Interview // Orlan: ‘This Is My Body, This Is My Software.’ Berlin Art Link. Retrieved December 13, 2022 from https://www.berlinartlink.com/2017/07/05/interview-orlan-this-is-my-body-this-is-my-software/",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David Chatting, Michael Duggan, Andrew Carl Dwyer, and Pip Thornton. 2022. Zoom Obscura: Counterfunctional Design for Video-Conferencing. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–17. DOI:https://doi.org/10.1145/3491102.3501973",
      "doi": "10.1145/3491102.3501973"
    },
    {
      "text": "A. Erdbrink, J. Michael, R. Kortmann, M. Hamel, K. Van Eijck, and A. Verbraeck. 2021. Listening Space: An Exploratory Case Study on a Persuasive Game Designed to Enrich the Experience of Classical Music Concerts. J. Comput. Cult. Herit. 14, 4 (December 2021), 1–20. DOI:https://doi.org/10.1145/3458677",
      "doi": "10.1145/3458677"
    },
    {
      "text": "William Fedus, Barret Zoph, and Noam Shazeer. 2021. Switch Transformers: Scaling to Trillion Parameter Models with Simple and Efficient Sparsity. arXiv:2101.03961 [cs] (January 2021). Retrieved October 8, 2021 from http://arxiv.org/abs/2101.03961",
      "doi": ""
    },
    {
      "text": "Luciano Floridi and Massimo Chiriatti. 2020. GPT-3: Its Nature, Scope, Limits, and Consequences. Minds & Machines 30, 4 (December 2020), 681–694. DOI:https://doi.org/10.1007/s11023-020-09548-1",
      "doi": "10.1007/s11023-020-09548-1"
    },
    {
      "text": "Giorgio Franceschelli and Mirco Musolesi. 2021. Creativity and Machine Learning: A Survey. arXiv:2104.02726 [cs] (April 2021). Retrieved May 1, 2021 from http://arxiv.org/abs/2104.02726",
      "doi": ""
    },
    {
      "text": "Ursula M. Franklin. 1999. The Real World of Technology. Anansi.",
      "doi": ""
    },
    {
      "text": "Yang Gao, Zhengyu Pan, Honghao Wang, and Guanling Chen. 2018. Alexa, My Love: Analyzing Reviews of Amazon Echo. In 2018 IEEE SmartWorld, Ubiquitous Intelligence Computing, Advanced Trusted Computing, Scalable Computing Communications, Cloud Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI), 372–380. DOI:https://doi.org/10.1109/SmartWorld.2018.00094",
      "doi": ""
    },
    {
      "text": "GPT-3. 2020. A robot wrote this entire article. Are you scared yet, human? | GPT-3. the Guardian. Retrieved May 4, 2021 from http://www.theguardian.com/commentisfree/2020/sep/08/robot-wrote-this-article-gpt-3",
      "doi": ""
    },
    {
      "text": "David Graeber. 2015. The Utopia of Rules: On Technology, Stupidity, and the Secret Joys of Bureaucracy. Melville House.",
      "doi": ""
    },
    {
      "text": "Tristan Greene. 2020. GPT-3’s bigotry is exactly why devs shouldn't use the internet to train AI. TNW | Neural. Retrieved May 20, 2021 from https://thenextweb.com/news/gpt-3s-bigotry-is-exactly-why-devs-shouldnt-use-the-internet-to-train-ai",
      "doi": ""
    },
    {
      "text": "Erik Gronvall, Jonas Fritsch, and Anna Vallgårda. 2016. FeltRadio: Sensing and Making Sense of Wireless Traffic. Proceedings of the 2016 ACM Conference on Designing Interactive Systems (June 2016), 829–840. DOI:https://doi.org/10.1145/2901790.2901818",
      "doi": "10.1145/2901790.2901818"
    },
    {
      "text": "Nour Hammad, Elaheh Sanoubari, Patrick Finn, Sowmya Somanath, James E. Young, and Ehud Sharlin. 2019. Mutation: Leveraging Performing Arts Practices in Cyborg Transitioning. In Proceedings of the 2019 on Creativity and Cognition, ACM, San Diego CA USA, 53–59. DOI:https://doi.org/10.1145/3325480.3325508",
      "doi": "10.1145/3325480.3325508"
    },
    {
      "text": "Mika Hannula, Juha Suoranta, and Tere Vadén. 2014. Artistic Research Methodology. Peter Lang US. DOI:https://doi.org/10.3726/978-1-4539-1308-6",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. Feminist Studies 14, 3 (1988), 575–599. DOI:https://doi.org/10.2307/3178066",
      "doi": ""
    },
    {
      "text": "Joshua James Hatherley. 2020. Limits of trust in medical AI. Journal of Medical Ethics 46, 7 (July 2020), 478–481. DOI:https://doi.org/10.1136/medethics-2019-105935",
      "doi": ""
    },
    {
      "text": "Julia Hirschberg and Christopher D Manning. Advances in natural language processing. ARTIFICIAL INTELLIGENCE, 7.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Eva Hornecker. 2011. The role of physicality in tangible and embodied interactions. interactions 18, 2 (March 2011), 19–23. DOI:https://doi.org/10.1145/1925820.1925826",
      "doi": "10.1145/1925820.1925826"
    },
    {
      "text": "Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI ’99), Association for Computing Machinery, New York, NY, USA, 159–166. DOI:https://doi.org/10.1145/302979.303030",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Khari Johnson. 2022. The Efforts to Make Text-Based AI Less Racist and Terrible. Wired. Retrieved September 13, 2022 from https://www.wired.com/story/efforts-make-text-ai-less-racist-terrible/",
      "doi": ""
    },
    {
      "text": "Merel Keijsers, Christoph Bartneck, and Friederike Eyssel. 2021. What's to bullying a bot?: Correlates between chatbot humanlikeness and abuse. Interaction Studies 22, 1 (September 2021), 55–80. DOI:https://doi.org/10.1075/is.20002.kei",
      "doi": ""
    },
    {
      "text": "Pranav Khadpe, Ranjay Krishna, Li Fei-Fei, Jeffrey T. Hancock, and Michael S. Bernstein. 2020. Conceptual Metaphors Impact Perceptions of Human-AI Collaboration. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (October 2020), 163:1-163:26. DOI:https://doi.org/10.1145/3415234",
      "doi": "10.1145/3415234"
    },
    {
      "text": "Robert E. Kraut. Technology and the Transformation of White-Collar Work. Psychology Press, Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Chuncheng Liu and Ross Graham. 2021. Making sense of algorithms: Relational perception of contact tracing and risk assessment during COVID-19. Big Data & Society 8, 1 (January 2021), 2053951721995218. DOI:https://doi.org/10.1177/2053951721995218",
      "doi": ""
    },
    {
      "text": "Christopher Manning. 2016. Understanding Human Language: Can NLP and Deep Learning Help? In Proceedings of the 39th International ACM SIGIR conference on Research and Development in Information Retrieval (SIGIR ’16), Association for Computing Machinery, New York, NY, USA, 1. DOI:https://doi.org/10.1145/2911451.2926732",
      "doi": "10.1145/2911451.2926732"
    },
    {
      "text": "Georgios Marentakis, David Pirrò, and Marian Weger. 2017. Creative Evaluation. In Proceedings of the 2017 Conference on Designing Interactive Systems, ACM, Edinburgh United Kingdom, 853–864. DOI:https://doi.org/10.1145/3064663.3064710",
      "doi": "10.1145/3064663.3064710"
    },
    {
      "text": "Kory Mathewson and Piotr Mirowski. 2017. Improvised Theatre Alongside Artificial Intelligences. AIIDE 13, 1 (September 2017). Retrieved March 13, 2021 from https://ojs.aaai.org/index.php/AIIDE/article/view/12926",
      "doi": ""
    },
    {
      "text": "Jeff Larson Mattu Julia Angwin,Lauren Kirchner,Surya. 2022. How We Analyzed the COMPAS Recidivism Algorithm. ProPublica. Retrieved September 14, 2022 from https://www.propublica.org/article/how-we-analyzed-the-compas-recidivism-algorithm",
      "doi": ""
    },
    {
      "text": "Cade Metz. 2020. Meet GPT-3. It Has Learned to Code (and Blog and Argue). The New York Times. Retrieved September 13, 2022 from https://www.nytimes.com/2020/11/24/science/artificial-intelligence-ai-gpt3.html",
      "doi": ""
    },
    {
      "text": "Michael Muller and Justin Weisz. 2022. Extending a Human-AI Collaboration Framework with Dynamism and Sociality. In 2022 Symposium on Human-Computer Interaction for Work (CHIWORK 2022), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3533406.3533407",
      "doi": "10.1145/3533406.3533407"
    },
    {
      "text": "Hye Yeon Nam and Michael Nitsche. 2014. Interactive installations as performance: inspiration for HCI. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI ’14), Association for Computing Machinery, New York, NY, USA, 189–196. DOI:https://doi.org/10.1145/2540930.2540976",
      "doi": "10.1145/2540930.2540976"
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of oppression: how search engines reinforce racism. New York University Press, New York.",
      "doi": ""
    },
    {
      "text": "Cathy O'Neil. 2016. Weapons of math destruction: how big data increases inequality and threatens democracy (First edition ed.). Crown, New York.",
      "doi": ""
    },
    {
      "text": "OpenAI. 2020. OpenAI API. OpenAI. Retrieved May 4, 2021 from https://openai.com/blog/openai-api/",
      "doi": ""
    },
    {
      "text": "OpenAI. 2022. Aligning Language Models to Follow Instructions. OpenAI. Retrieved December 4, 2022 from https://openai.com/blog/instruction-following/",
      "doi": ""
    },
    {
      "text": "Aura Pon, Eric Pattison, Lawrence Fyfe, Laurie Radford, and Sheelagh Carpendale. 2017. Torrent: Integrating Embodiment, Physicalization and Musification in Music-Making. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction, ACM, Yokohama Japan, 209–216. DOI:https://doi.org/10.1145/3024969.3024974",
      "doi": "10.1145/3024969.3024974"
    },
    {
      "text": "Amon Rapp, Lorenzo Curti, and Arianna Boldi. 2021. The human side of human-chatbot interaction: A systematic literature review of ten years of research on text-based chatbots. International Journal of Human-Computer Studies 151, (July 2021), 102630. DOI:https://doi.org/10.1016/j.ijhcs.2021.102630",
      "doi": ""
    },
    {
      "text": "Juan Rebanal. 2021. XAlgo: a Design Probe of Explaining Algorithms’ Internal States via Question-Answering. (2021), 11.",
      "doi": ""
    },
    {
      "text": "Johan Redström. 2017. Making design theory. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Rob Reich. 2022. Now AI can write students’ essays for them, will everyone become a cheat? The Guardian. Retrieved December 5, 2022 from https://www.theguardian.com/commentisfree/2022/nov/28/ai-students-essays-cheat-teachers-plagiarism-tech",
      "doi": ""
    },
    {
      "text": "Reply.io. 2022. Improve your emails with GPT-3. Retrieved December 5, 2022 from https://support.reply.io/en/articles/4694125-improve-your-emails-with-gpt-3",
      "doi": ""
    },
    {
      "text": "Rudolf Rosa, Tomáš Musil, Ondřej Dušek, Dominik Jurko, Patrícia Schmidtová, David Mareček, Ondřej Bojar, Tom Kocmi, Daniel Hrbek, David Košťák, Martina Kinská, Marie Nováková, Josef Doležal, Klára Vosecká, Tomáš Studeník, and Petr Žabka. 2021. THEaiTRE 1.0: Interactive generation of theatre play scripts. arXiv:2102.08892 [cs] (February 2021). Retrieved April 15, 2022 from http://arxiv.org/abs/2102.08892",
      "doi": ""
    },
    {
      "text": "Minna Ruckenstein. 2022. Time to re-humanize algorithmic systems. AI & Soc (May 2022). DOI:https://doi.org/10.1007/s00146-022-01444-9",
      "doi": ""
    },
    {
      "text": "Minna Ruckenstein and Julia Granroth. 2020. Algorithms, advertising and the intimacy of surveillance. Journal of Cultural Economy 13, 1 (January 2020), 12–24. DOI:https://doi.org/10.1080/17530350.2019.1574866",
      "doi": ""
    },
    {
      "text": "Hanns Holger Rutz. 2020. A pattern system for sound processes. In Proceedings of the 15th International Conference on Audio Mostly, ACM, Graz Austria, 93–100. DOI:https://doi.org/10.1145/3411109.3411151",
      "doi": "10.1145/3411109.3411151"
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. “Hey Alexa, What's Up?”: A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS ’18), Association for Computing Machinery, New York, NY, USA, 857–868. DOI:https://doi.org/10.1145/3196709.3196772",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "James C. Scott. 1998. Seeing Like a State: How Certain Schemes to Improve the Human Condition Have Failed. Yale University Press. DOI:https://doi.org/10.2307/j.ctvxkn7ds",
      "doi": ""
    },
    {
      "text": "Lara Shalson. 2018. Performing Endurance: Art and Politics since 1960. Cambridge University Press, Cambridge. DOI:https://doi.org/10.1017/9781108551007",
      "doi": ""
    },
    {
      "text": "Ben Sheehan, Hyun Seung Jin, and Udo Gottlieb. 2020. Customer service chatbots: Anthropomorphism and adoption. Journal of Business Research 115, (July 2020), 14–24. DOI:https://doi.org/10.1016/j.jbusres.2020.04.030",
      "doi": ""
    },
    {
      "text": "Irina Shklovski and Erik Grönvall. 2020. CreepyLeaks: Participatory Speculation Through Demos. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society, ACM, Tallinn Estonia, 1–12. DOI:https://doi.org/10.1145/3419249.3420168",
      "doi": "10.1145/3419249.3420168"
    },
    {
      "text": "Vygandas Simbelis and Kristina Höök. 2013. Metaphone: an artistic exploration of biofeedback and machine aesthetics. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems on - CHI EA ’13, ACM Press, Paris, France, 2995. DOI:https://doi.org/10.1145/2468356.2479593",
      "doi": "10.1145/2468356.2479593"
    },
    {
      "text": "Michael Skirpan, Maggie Oates, Daragh Byrne, Robert Cunningham, and Lorrie Faith Cranor. 2022. Is a privacy crisis experienced, a privacy crisis avoided? Commun. ACM 65, 3 (February 2022), 26–29. DOI:https://doi.org/10.1145/3512325",
      "doi": "10.1145/3512325"
    },
    {
      "text": "Michael Warren Skirpan, Jacqueline Cameron, and Tom Yeh. 2018. More Than a Show: Using Personalized Immersive Theater to Educate and Engage the Public in Technology Ethics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3173574.3174038",
      "doi": "10.1145/3173574.3174038"
    },
    {
      "text": "Marita Skjuve, Asbjørn Følstad, Knut Inge Fostervold, and Petter Bae Brandtzaeg. 2021. My Chatbot Companion - a Study of Human-Chatbot Relationships. International Journal of Human-Computer Studies 149, (May 2021), 102601. DOI:https://doi.org/10.1016/j.ijhcs.2021.102601",
      "doi": ""
    },
    {
      "text": "Irene Solaiman and Christy Dennison. Process for Adapting Language Models to Society (PALMS) with Values-Targeted Datasets. 43.",
      "doi": ""
    },
    {
      "text": "David Spiegelhalter. 2020. Should We Trust Algorithms? Harvard Data Science Review 2, 1 (January 2020). DOI:https://doi.org/10.1162/99608f92.cb91a35a",
      "doi": ""
    },
    {
      "text": "G. Stahl. 2003. Meaning and Interpretation in Collaboration. In Designing for Change in Networked Learning Environments: Proceedings of the International Conference on Computer Support for Collaborative Learning 2003, Barbara Wasson, Sten Ludvigsen and Ulrich Hoppe (eds.). Springer Netherlands, Dordrecht, 523–532. DOI:https://doi.org/10.1007/978-94-017-0195-2_62",
      "doi": ""
    },
    {
      "text": "Marc Steen. 2015. Upon Opening the Black Box and Finding It Full: Exploring the Ethics in Design Practices. Science, Technology, & Human Values 40, 3 (May 2015), 389–420. DOI:https://doi.org/10.1177/0162243914547645",
      "doi": ""
    },
    {
      "text": "Lucy A. Suchman. 1987. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press.",
      "doi": "10.5555/38407"
    },
    {
      "text": "S Shyam Sundar. 2020. Rise of Machine Agency: A Framework for Studying the Psychology of Human–AI Interaction (HAII). Journal of Computer-Mediated Communication 25, 1 (March 2020), 74–88. DOI:https://doi.org/10.1093/jcmc/zmz026",
      "doi": ""
    },
    {
      "text": "Joëlle Swart. 2021. Experiencing Algorithms: How Young People Understand, Feel About, and Engage With Algorithmic News Selection on Social Media. Social Media + Society 7, 2 (April 2021), 20563051211008828. DOI:https://doi.org/10.1177/20563051211008828",
      "doi": ""
    },
    {
      "text": "Daniel Terdiman. 2018. Here's How People Say Google Home And Alexa Impact Their Lives. Fast Company. Retrieved April 27, 2022 from https://www.fastcompany.com/40513721/heres-how-people-say-google-home-and-alexa-impact-their-lives",
      "doi": ""
    },
    {
      "text": "Mariya Toneva and Leila Wehbe. 2019. Interpreting and improving natural-language processing (in machines) with natural language-processing (in the brain). In Advances in Neural Information Processing Systems, Curran Associates, Inc. Retrieved September 15, 2022 from https://proceedings.neurips.cc/paper/2019/hash/749a8e6c231831ef7756db230b4359c8-Abstract.html",
      "doi": ""
    },
    {
      "text": "Charlotte Triebus, Ivana Druzetic, Bastian Dewitz, Calvin Huhn, Paul Kretschel, and Christian Geiger. 2021. is a rose – A Performative Installation between the Tangible and the Digital. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, Salzburg Austria, 1–4. DOI:https://doi.org/10.1145/3430524.3444640",
      "doi": "10.1145/3430524.3444640"
    },
    {
      "text": "Amrita S. Tulshan and Sudhir Namdeorao Dhage. 2019. Survey on Virtual Assistant: Google Assistant, Siri, Cortana, Alexa. In Advances in Signal Processing and Intelligent Recognition Systems (Communications in Computer and Information Science), Springer, Singapore, 190–201. DOI:https://doi.org/10.1007/978-981-13-5758-9_17",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Elizabeth Churchill, Pattie Maes, Xiangmin Fan, Ben Shneiderman, Yuanchun Shi, and Qianying Wang. 2020. From Human-Human Collaboration to Human-AI Collaboration: Designing AI Systems That Can Work Together with People. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), Association for Computing Machinery, New York, NY, USA, 1–6. DOI:https://doi.org/10.1145/3334480.3381069",
      "doi": "10.1145/3334480.3381069"
    },
    {
      "text": "Karl E. Weick, Kathleen M. Sutcliffe, and David Obstfeld. 2005. Organizing and the Process of Sensemaking. Organization Science 16, 4 (August 2005), 409–421. DOI:https://doi.org/10.1287/orsc.1050.0133",
      "doi": "10.1287/orsc.1050.0133"
    },
    {
      "text": "Laura Weidinger, John Mellor, Maribeth Rauh, Conor Griffin, Jonathan Uesato, Po-Sen Huang, Myra Cheng, Mia Glaese, Borja Balle, Atoosa Kasirzadeh, Zac Kenton, Sasha Brown, Will Hawkins, Tom Stepleton, Courtney Biles, Abeba Birhane, Julia Haas, Laura Rimell, Lisa Anne Hendricks, William Isaac, Sean Legassick, Geoffrey Irving, and Iason Gabriel. 2021. Ethical and social risks of harm from Language Models. DOI:https://doi.org/10.48550/arXiv.2112.04359",
      "doi": ""
    },
    {
      "text": "Joseph Weizenbaum. 1983. ELIZA — a computer program for the study of natural language communication between man and machine. Commun. ACM 26, 1 (January 1983), 23–28. DOI:https://doi.org/10.1145/357980.357991",
      "doi": "10.1145/357980.357991"
    },
    {
      "text": "Terry Winograd. 1990. Thinking machines: Can there be? Are we? In The Foundations of Artificial Intelligence: A Sourcebook, Derek Partridge and Yorick Wilks (eds.). Cambridge University Press, Cambridge, 167–189. DOI:https://doi.org/10.1017/CBO9780511663116.017",
      "doi": ""
    },
    {
      "text": "Eva Yiwei Wu, Emily Pedersen, and Niloufar Salehi. 2019. Agent, Gatekeeper, Drug Dealer: How Content Creators Craft Algorithmic Personas. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 219:1-219:27. DOI:https://doi.org/10.1145/3359321",
      "doi": "10.1145/3359321"
    },
    {
      "text": "Tianling Xie and Iryna Pentina. 2022. Attachment Theory as a Framework to Understand Relationships with Social Chatbots: A Case Study of Replika. DOI:https://doi.org/10.24251/HICSS.2022.258",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Alex Zavalny. 2022. Generating Emails with GPT3. Retrieved December 5, 2022 from https://github.com/thelazyaz/gpt3-email-generator",
      "doi": ""
    },
    {
      "text": "Tasos Zembylas and Tasos Zembylas (Eds.). 2014. Artistic practices: social interactions and cultural dynamics. Routledge, Taylor & francis Group, London; New York.",
      "doi": ""
    },
    {
      "text": "2016. Sunspring | A Sci-Fi Short Film Starring Thomas Middleditch. Retrieved November 23, 2022 from https://www.youtube.com/watch?v=LY7x2Ihqjmc",
      "doi": ""
    },
    {
      "text": "2021. Trustworthy Artificial Intelligence. Mozilla Foundation. Retrieved May 30, 2021 from https://foundation.mozilla.org/en/internet-health/trustworthy-artificial-intelligence/",
      "doi": ""
    },
    {
      "text": "2022. Replika. replika.com. Retrieved September 15, 2022 from https://replika.com",
      "doi": ""
    },
    {
      "text": "2022. Copy.ai: Write better marketing copy and content with AI. Retrieved December 5, 2022 from https://www.copy.ai/",
      "doi": ""
    }
  ]
}