{
  "doi": "10.1145/3544548.3580813",
  "title": "3D Printable Play-Dough: New Biodegradable Materials and Creative Possibilities for Digital Fabrication",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Play-dough is a brightly-colored, easy-to-make, and familiar material. We have developed and tested custom play-dough materials that can be employed in 3D printers designed for clay. This paper introduces a set of recipes for 3D printable play-dough along with an exploration of these materials’ print characteristics. We explore the design potential of play-dough as a sustainable fabrication material, highlighting its recyclability, compostability, and repairability. We demonstrate how custom-color prints can be designed and constructed and describe how play-dough can be used as a support material for clay 3D prints. We also present a set of example artifacts made from play-dough and discuss opportunities for future research.",
  "authors": [
    {
      "name": "Leah Buechley",
      "institution": "Hand and Machine, Department of Computer Science, University of New Mexico, United States",
      "img": "/do/10.1145/contrib-81309510031/rel-imgonly/leahb_2.jpg",
      "acmid": "81309510031",
      "orcid": "0000-0003-2661-2761"
    },
    {
      "name": "Ruby Ta",
      "institution": "Hand and Machine, Department of Computer Science, University of New Mexico, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778347",
      "orcid": "0000-0003-1024-1492"
    }
  ],
  "references": [
    {
      "text": "[n. d.]. The Stanford 3D Scanning Repository. http://graphics.stanford.edu/data/3Dscanrep/",
      "doi": ""
    },
    {
      "text": "3D Potter. 2022. 3D Potter - Real Clay 3D Ceramic Printers. https://3dpotter.com",
      "doi": ""
    },
    {
      "text": "Harold Abelson and Andrea diSessa. 1980. Turtle Geometry: The Computer as a Medium for Exploring Mathematics. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Manfred Amann and Oliver Minge. 2012. Biodegradability of Poly(vinyl acetate) and Related Polymers. Advances in Polymer Science 245 (Jan. 2012), 137–172. https://doi.org/10.1007/12-2011-153",
      "doi": ""
    },
    {
      "text": "Amazon. 2022. HFBTE AGY-15 Digital Fruit Hardness Tester. https://www.amazon.com/HFBTE-Penetrometer-Strawberries-Sclerometer-Measurement/dp/B07X9L61PV/ref=sr_1_7?crid=23LG8S5YACL59&keywords=digital+penetrometer&qid=1663321693&sprefix=digital+penetromete%2Caps%2C168&sr=8-7&ufe=app_do%3Aamzn1.fos.304cacc1-b508-45fb-a37f-a2c47c48c32f",
      "doi": ""
    },
    {
      "text": "F. A. Andrade, H. A. Al-Qureshi, and D. Hotza. 2011. Measuring the plasticity of clays: A review. Applied Clay Science 51, 1 (Jan. 2011), 1–7. https://doi.org/10.1016/j.clay.2010.10.028",
      "doi": ""
    },
    {
      "text": "Fiona Bell, Netta Ofer, and Mirela Alistar. 2022. ReClaym our Compost: Biodegradable Clay for Intimate Making. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3491102.3517711",
      "doi": "10.1145/3491102.3517711"
    },
    {
      "text": "Leah Buechley and Franklin Pezutti-Dyer. 2022. Extruder Turtle Online Reference. https://handandmachine.org/projects/extruder_turtle_rhino/",
      "doi": ""
    },
    {
      "text": "Cameo. 2022. Elmer’s Glue-All - CAMEO. https://cameo.mfa.org/wiki/Elmer%27s_Glue-All",
      "doi": ""
    },
    {
      "text": "Shareen S.L. Chan, Ryan M. Pennings, Lewis Edwards, and George V. Franks. 2020. 3D printing of clay for decorative architectural applications: Effect of solids volume fraction on rheology and printability. Additive Manufacturing 35 (Oct. 2020), 101335. https://doi.org/10.1016/j.addma.2020.101335",
      "doi": ""
    },
    {
      "text": "Zhangwei Chen, Ziyong Li, Junjie Li, Chengbo Liu, Changshi Lao, Yuelong Fu, Changyong Liu, Yang Li, Pei Wang, and Yi He. 2019. 3D printing of ceramics: A review. Journal of the European Ceramic Society 39, 4 (April 2019), 661–687. https://doi.org/10.1016/j.jeurceramsoc.2018.11.013",
      "doi": ""
    },
    {
      "text": "Czibesz, Bryan. 2021. Bryan Czibesz. https://bryanczibesz.com",
      "doi": ""
    },
    {
      "text": "Cláudio de Oliveira Modesto and Adriano Michael Bernardin. 2008. Determination of clay plasticity: Indentation method versus Pfefferkorn method. Applied Clay Science 40, 1 (June 2008), 15–19. https://doi.org/10.1016/j.clay.2007.06.007",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Timea Tihanyi. 2019. ListeningCups: A Case of Data Tactility and Data Stories. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 147–160. https://doi.org/10.1145/3322276.3323694",
      "doi": "10.1145/3322276.3323694"
    },
    {
      "text": "Shelby Doyle. 2022. ISU CCL – Iowa State University Computation + Construction Lab. https://ccl.design.iastate.edu/",
      "doi": ""
    },
    {
      "text": "Chad Duty, Christine Ajinjeru, Vidya Kishore, Brett Compton, Nadim Hmeidat, Xun Chen, Peng Liu, Ahmed Arabi Hassen, John Lindahl, and Vlastimil Kunc. 2018. What makes a material printable? A viscoelastic model for extrusion-based 3D printing of polymers. Journal of Manufacturing Processes 35 (Oct. 2018), 526–537. https://doi.org/10.1016/j.jmapro.2018.08.008",
      "doi": ""
    },
    {
      "text": "Eazao. 2022. Eazao Zero - Eazao. https://www.eazao.com/product/eazao-zero/",
      "doi": ""
    },
    {
      "text": "H. Faridi and J. M. Faubion (Eds.). 2011. Dough Rheology and Baked Product Texture (1990th edition ed.). Springer, Boston, MA.",
      "doi": ""
    },
    {
      "text": "Awatif Fetouhi, Leila Benatallah, Agnieszka Nawrocka, Monika Szymańska-Chargot, Abdallah Bouasla, Marta Tomczyńska-Mleko, Mohammed Nasreddine Zidoune, and Agnieszka Sujak. 2019. Investigation of viscoelastic behaviour of rice-field bean gluten-free dough using the biophysical characterization of proteins and starch: a FT-IR study. Journal of Food Science and Technology 56, 3 (March 2019), 1316–1327. https://doi.org/10.1007/s13197-019-03602-2",
      "doi": ""
    },
    {
      "text": "Kate Fitz Gibbon and Andrew Hale. 1997. Ikat: Silks of Central Asia. Laurence King Pub, London.",
      "doi": ""
    },
    {
      "text": "Matea Habuš, Petra Golubić, Tomislava Vukušić Pavičić, Nikolina Čukelj Mustač, Bojana Voučko, Zoran Herceg, Duška Ćurić, and Dubravka Novotni. 2021. Influence of Flour Type, Dough Acidity, Printing Temperature and Bran Pre-processing on Browning and 3D Printing Performance of Snacks. Food and Bioprocess Technology 14, 12 (Dec. 2021), 2365–2379. https://doi.org/10.1007/s11947-021-02732-w",
      "doi": ""
    },
    {
      "text": "Nadim S. Hmeidat, James W. Kemp, and Brett G. Compton. 2018. High-strength epoxy nanocomposites for 3D printing. Composites Science and Technology 160 (May 2018), 9–20. https://doi.org/10.1016/j.compscitech.2018.03.008",
      "doi": ""
    },
    {
      "text": "Monika Hospodiuk, Madhuri Dey, Donna Sosnoski, and Ibrahim T. Ozbolat. 2017. The bioink: A comprehensive review on bioprintable materials. Biotechnology Advances 35, 2 (2017), 217–239. https://doi.org/10.1016/j.biotechadv.2016.12.006",
      "doi": ""
    },
    {
      "text": "Hyrel3D. 2021. Hyrel3D: Materials. https://www.hyrel3d.com/materials/",
      "doi": ""
    },
    {
      "text": "Ile Kauppila. 2022. Full-Color 3D Printing – The Ultimate Guide. https://all3dp.com/1/full-color-3d-printing-multicolor/",
      "doi": ""
    },
    {
      "text": "Keep, Jonathan. 2020. Drop Spike | Overview. https://wikifactory.com/@jonathankeep/jk-drop-spike",
      "doi": ""
    },
    {
      "text": "Kill-A-Watt. 2022. Amazon.com: P3 P4400 Kill A Watt Electricity Usage Monitor : Electronics. https://www.amazon.com/P3-P4400-Electricity-Usage-Monitor/dp/B00009MDBU?th=1",
      "doi": ""
    },
    {
      "text": "Tim Kuipers, Willemijn Elkhuizen, Jouke Verlinden, and Eugeni Doubrovski. 2018. Hatching for 3D prints: Line-based halftoning for dual extrusion fused deposition modeling. Computers & Graphics 74 (Aug. 2018), 23–32. https://doi.org/10.1016/j.cag.2018.04.006",
      "doi": ""
    },
    {
      "text": "Eldy S. Lazaro Vasquez, Hao-Chuan Wang, and Katia Vega. 2020. Introducing the Sustainable Prototyping Life Cycle for Digital Fabrication to Designers. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). Association for Computing Machinery, New York, NY, USA, 1301–1312. https://doi.org/10.1145/3357236.3395510",
      "doi": "10.1145/3357236.3395510"
    },
    {
      "text": "Alain Le-Bail, Bianca Chieregato Maniglia, and Patricia Le-Bail. 2020. Recent advances and future perspective in additive manufacturing of foods based on 3D printing. Current Opinion in Food Science 35 (Oct. 2020), 54–64. https://doi.org/10.1016/j.cofs.2020.01.009",
      "doi": ""
    },
    {
      "text": "Eammon Littler, Bo Zhu, and Wojciech Jarosz. 2022. Automated Filament Inking for Multi-color FFF 3D Printing. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology(UIST ’22). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3526113.3545654",
      "doi": "10.1145/3526113.3545654"
    },
    {
      "text": "Yaowen Liu, Xue Liang, Ahmed Saeed, Weijie Lan, and Wen Qin. 2019. Properties of 3D printed dough and optimization of printing parameters. Innovative Food Science & Emerging Technologies 54 (June 2019), 9–18. https://doi.org/10.1016/j.ifset.2019.03.008",
      "doi": ""
    },
    {
      "text": "Adrián Matas, Marta Igual, Purificación García-Segovia, and Javier Martínez-Monzó. 2022. Application of 3D Printing in the Design of Functional Gluten-Free Dough. Foods 11, 11 (Jan. 2022), 1555. https://doi.org/10.3390/foods11111555 Number: 11 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Jackson O’Connell and Amir Bohlooli. 2021. Is PLA Actually Biodegrable?https://all3dp.com/2/is-pla-biodegradable-what-you-really-need-to-know/",
      "doi": ""
    },
    {
      "text": "Franklin Pezutti-Dyer and Leah Buechley. 2022. Extruder-Turtle: A Library for 3D Printing Delicate, Textured, and Flexible Objects. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’22). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3490149.3501312",
      "doi": "10.1145/3490149.3501312"
    },
    {
      "text": "Ron Rael and Virginia San Fratello. 2022. Bad Ombres v.2 | Emerging Objects. http://emergingobjects.com/project/bad-ombres-v-2/",
      "doi": ""
    },
    {
      "text": "Eva Sanchez-Rexach, Trevor G. Johnston, Coralie Jehanno, Haritz Sardon, and Alshakim Nelson. 2020. Sustainable Materials and Chemical Processes for Additive Manufacturing. Chemistry of Materials 32, 17 (Sept. 2020), 7105–7119. https://doi.org/10.1021/acs.chemmater.0c02008 Publisher: American Chemical Society.",
      "doi": ""
    },
    {
      "text": "Haichuan Song, Jonàs Martínez, Pierre Bedell, Noémie Vennin, and Sylvain Lefebvre. 2019. Colored Fused Filament Fabrication. ACM Transactions on Graphics 38, 5 (June 2019), 141:1–141:11. https://doi.org/10.1145/3183793",
      "doi": "10.1145/3183793"
    },
    {
      "text": "Katherine W Song, Aditi Maheshwari, Eric M Gallo, Andreea Danielescu, and Eric Paulos. 2022. Towards Decomposable Interactive Systems: Design of a Backyard-Degradable Wireless Heating Interface. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3491102.3502007",
      "doi": "10.1145/3491102.3502007"
    },
    {
      "text": "StoneFlower. 2022. ceramic 3D Printer StoneFlower. https://www.stoneflower3d.com/store/3d-printer-stoneflower/",
      "doi": ""
    },
    {
      "text": "Haruki Takahashi and Homei Miyashita. 2017. Expressive Fused Deposition Modeling by Controlling Extruder Height and Extrusion Amount. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 5065–5074. https://doi.org/10.1145/3025453.3025933",
      "doi": "10.1145/3025453.3025933"
    },
    {
      "text": "Ye Tao, Youngwook Do, Humphrey Yang, Yi-Chin Lee, Guanyun Wang, Catherine Mondoa, Jianxun Cui, Wen Wang, and Lining Yao. 2019. Morphlour: Personalized Flour-based Morphing Food Induced by Dehydration or Hydration Method. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(UIST ’19). Association for Computing Machinery, New York, NY, USA, 329–340. https://doi.org/10.1145/3332165.3347949",
      "doi": "10.1145/3332165.3347949"
    },
    {
      "text": "Tomislava Vukušić Pavičić, Tomislava Grgić, Mia Ivanov, Dubravka Novotni, and Zoran Herceg. 2021. Influence of Flour and Fat Type on Dough Rheology and Technological Characteristics of 3D-Printed Cookies. Foods 10, 1 (Jan. 2021), 193. https://doi.org/10.3390/foods10010193 Number: 1 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Piotr Wasniowski. 2022. Piotr Waśniowski (@piotr_wasniowski) • Instagram photos and videos. https://www.instagram.com/piotr_wasniowski/",
      "doi": ""
    },
    {
      "text": "WASP. 2022. Clay 3d printer | Delta WASP 2040 Clay. https://www.3dwasp.com/en/clay-3d-printer-delta-wasp-2040-clay/",
      "doi": ""
    },
    {
      "text": "Shanel Wu and Laura Devendorf. 2020. Unfabricate: Designing Smart Textiles for Disassembly. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376227",
      "doi": "10.1145/3313831.3376227"
    },
    {
      "text": "Fan Yang, Min Zhang, Zhongxiang Fang, and Yaping Liu. 2019. Impact of processing parameters and post-treatment on the shape accuracy of 3D-printed baking dough. International Journal of Food Science & Technology 54, 1(2019), 68–74. https://doi.org/10.1111/ijfs.13904 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/ijfs.13904.",
      "doi": ""
    },
    {
      "text": "Zhihao Yuan, Rajat Nag, and Enda Cummins. 2022. Ranking of potential hazards from microplastics polymers in the marine environment. Journal of Hazardous Materials 429 (May 2022), 128399. https://doi.org/10.1016/j.jhazmat.2022.128399",
      "doi": ""
    }
  ]
}