{
  "doi": "10.1145/3544548.3580710",
  "title": "Accessibility of Profile Pictures: Alt Text and Beyond to Express Identity Online",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Profile pictures can convey rich social signals that are often inaccessible to blind and low vision screen reader users. Although there have been efforts to understand screen reader users’ preferences for alternative (alt) text descriptions when encountering images online, profile pictures evoke distinct information needs. We conducted semi-structured interviews with 16 screen reader users to understand their preferences for various styles of profile picture image descriptions in different social contexts. We also interviewed seven sighted individuals to explore their thoughts on authoring alt text for profile pictures. Our findings suggest that detailed image descriptions and user narrated alt text can provide screen reader users enjoyable and informative experiences when exploring profile pictures. We also identified mismatches between how sighted individuals would author alt text with what screen reader users prefer to know about profile pictures. We discuss the implications of our findings for social applications that support profile pictures.",
  "authors": [
    {
      "name": "Martez E Mott",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81472645021/rel-imgonly/mott_headshot_2019.jpg",
      "acmid": "81472645021",
      "orcid": "0000-0003-4711-7268"
    },
    {
      "name": "John Tang",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81405592014/rel-imgonly/johntang_v2_cropped.jpg",
      "acmid": "81405592014",
      "orcid": "0000-0003-0603-3877"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    }
  ],
  "references": [
    {
      "text": "Stijn Baert. 2018. Facebook profile picture appearance affects recruiters’ first hiring decisions. New Media & Society 20, 3: 1220–1239. https://doi.org/10.1177/1461444816687294",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Jane E, Martez E. Mott, Edward Cutrell, and Meredith Ringel Morris. 2018. How teens with visual impairments take, edit, and share photos on social media. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI ’18), 76:1-76:12. https://doi.org/10.1145/3173574.3173650",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Cynthia L. Bennett, Cole Gleason, Morgan Klaus Scheuerman, Jeffrey P. Bigham, Anhong Guo, and Alexandra To. 2021. “It's Complicated”: Negotiating Accessibility and (Mis)Representation in Image Descriptions of Race, Gender, and Disability. In Proceedings of the ACM Conference on Human Factors in Computing Systems, 1–19. Retrieved November 3, 2021 from https://doi.org/10.1145/3411764.3445498",
      "doi": "10.1145/3411764.3445498"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P. Bigham. 2013. Visual challenges in the everyday lives of blind people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 2117–2126. https://doi.org/10.1145/2470654.2481291",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Michele A. Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P. Bigham, and Amy Hurst. 2012. Crowdsourcing subjective fashion advice using VizWiz: challenges and opportunities. In Proceedings of the ACM SIGACCESS Conference on Computers and accessibility (ASSETS ’12), 135–142. https://doi.org/10.1145/2384916.2384941",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Denae Ford, Mahnaz Behroozi, Alexander Serebrenik, and Chris Parnin. 2019. Beyond the Code Itself: How Programmers Really Look at Pull Requests. In IEEE/ACM International Conference on Software Engineering: Software Engineering in Society (ICSE-SEIS), 51–60. https://doi.org/10.1109/ICSE-SEIS.2019.00014",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Amy Pavel, Xingyu Liu, Patrick Carrington, Lydia B. Chilton, and Jeffrey P. Bigham. 2019. Making Memes Accessible. In Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’19), 367–376. https://doi.org/10.1145/3308561.3353792",
      "doi": "10.1145/3308561.3353792"
    },
    {
      "text": "Cole Gleason, Amy Pavel, Emma McCamey, Christina Low, Patrick Carrington, Kris M. Kitani, and Jeffrey P. Bigham. 2020. Twitter A11y: A Browser Extension to Make Twitter Images Accessible. In Proceedings of the ACM Conference on Human Factors in Computing Systems, 1–12. Retrieved January 12, 2022 from https://doi.org/10.1145/3313831.3376728",
      "doi": "10.1145/3313831.3376728"
    },
    {
      "text": "Erving Goffman. 1959. The Presentation of Self in Everyday Life. Anchor.",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 1988. Why CSCW applications fail: Problems in the design and evaluationof organizational interfaces. In Proceedings of the ACM Conference on Computer-supported cooperative work (CSCW ’88), 85–93. https://doi.org/10.1145/62266.62273",
      "doi": "10.1145/62266.62273"
    },
    {
      "text": "Darren Guinness, Edward Cutrell, and Meredith Ringel Morris. 2018. Caption Crawler: Enabling Reusable Alternative Text Descriptions using Reverse Image Search. In Proceedings of the ACM Conference on Human Factors in Computing Systems, 1–11. Retrieved January 16, 2022 from https://doi.org/10.1145/3173574.3174092",
      "doi": "10.1145/3173574.3174092"
    },
    {
      "text": "Jeffrey T. Hancock and Catalina L. Toma. 2009. Putting Your Best Face Forward: The Accuracy of Online Dating Photographs. Journal of Communication 59, 2: 367–386. https://doi.org/10.1111/j.1460-2466.2009.01420.x",
      "doi": ""
    },
    {
      "text": "Margot Hanley, Solon Barocas, Karen Levy, Shiri Azenkot, and Helen Nissenbaum. 2021. Computer Vision and Conflicting Values: Describing People with Automated Alt Text. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society (AIES ’21), 543–554. https://doi.org/10.1145/3461702.3462620",
      "doi": "10.1145/3461702.3462620"
    },
    {
      "text": "Noelle J. Hum, Perrin E. Chamberlin, Brittany L. Hambright, Anne C. Portwood, Amanda C. Schat, and Jennifer L. Bevan. 2011. A picture is worth a thousand words: A content analysis of Facebook profile photographs. Computers in Human Behavior 27, 5: 1828–1833. https://doi.org/10.1016/j.chb.2011.04.003",
      "doi": ""
    },
    {
      "text": "Ju Yeon Jung, Tom Steinberger, Junbeom Kim, and Mark S. Ackerman. 2022. “So What? What's That to Do With Me?” Expectations of People With Visual Impairments for Image Descriptions in Their Personal Photo Activities. In Designing Interactive Systems Conference (DIS ’22), 1893–1906. https://doi.org/10.1145/3532106.3533522",
      "doi": "10.1145/3532106.3533522"
    },
    {
      "text": "Leqi Liu, Daniel Preotiuc-Pietro, Zahra Riahi Samani, Mohsen E. Moghaddam, and Lyle Ungar. 2016. Analyzing Personality through Social Media Profile Picture Choice. Proceedings of the International AAAI Conference on Web and Social Media 10, 1: 211–220. https://doi.org/10.1609/icwsm.v10i1.14738",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Edward Cutrell, Bongshin Lee, and Meredith Ringel Morris. 2021. Designing Tools for High-Quality Alt Text Authoring. In Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility, 1–14. https://doi.org/10.1145/3441852.3471207",
      "doi": "10.1145/3441852.3471207"
    },
    {
      "text": "Haley MacLeod, Cynthia L. Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding blind people's experiences with computer-generated captions of social media images. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI ’17), 5988–5999. https://doi.org/10.1145/3025453.3025814",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Valerie S. Morash, Yue-Ting Siu, Joshua A. Miele, Lucia Hasty, and Steven Landau. 2015. Guiding Novice Web Workers in Making Image Descriptions Using Templates. ACM Transactions on Accessible Computing 7, 4: 12:1-12:21. https://doi.org/10.1145/2764916",
      "doi": "10.1145/2764916"
    },
    {
      "text": "Meredith Ringel Morris, Jazette Johnson, Cynthia L. Bennett, and Edward Cutrell. 2018. Rich Representations of Visual Content for Screen Reader Users. In Proceedings of the ACM Conference on Human Factors in Computing Systems, 1–11. Retrieved January 15, 2022 from https://doi.org/10.1145/3173574.3173633",
      "doi": "10.1145/3173574.3173633"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. “With most of it being pictures now, I rarely use it”: Understanding Twitter's evolving accessibility to blind users. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI ’16), 5506–5516. https://doi.org/10.1145/2858036.2858116",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Helen Petrie, Chandra Harrison, and Sundeep Dev. 2005. Describing images on the web: A survey of current practice and prospects for the future. In Proceedings of Human Computer Interaction International (HCII), 71.",
      "doi": ""
    },
    {
      "text": "Michael V. Reiss and Milena Tsvetkova. 2020. Perceiving education from Facebook profile pictures. New Media & Society 22, 3: 550–570. https://doi.org/10.1177/1461444819868678",
      "doi": ""
    },
    {
      "text": "Elliot Salisbury, Ece Kamar, and Meredith Morris. 2017. Toward Scalable Social Alt Text: Conversational Crowdsourcing as a Tool for Refining Vision-to-Language Technology for the Blind. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 5: 147–156.",
      "doi": ""
    },
    {
      "text": "Abigale J. Stangl, Esha Kothari, Suyog D. Jain, Tom Yeh, Kristen Grauman, and Danna Gurari. 2018. BrowseWithMe: An Online Clothes Shopping Assistant for People with Visual Impairments. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’18), 107–118. https://doi.org/10.1145/3234695.3236337",
      "doi": "10.1145/3234695.3236337"
    },
    {
      "text": "Abigale Stangl, Meredith Ringel Morris, and Danna Gurari. 2020. “Person, Shoes, Tree. Is the Person Naked?” What People with Vision Impairments Want in Image Descriptions. In Proceedings of the ACM Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3313831.3376404",
      "doi": "10.1145/3313831.3376404"
    },
    {
      "text": "Abigale Stangl, Nitin Verma, Kenneth R. Fleischmann, Meredith Ringel Morris, and Danna Gurari. 2021. Going Beyond One-Size-Fits-All Image Descriptions to Satisfy the Information Wants of People Who are Blind or Have Low Vision. In Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’21), 1–15. https://doi.org/10.1145/3441852.3471233",
      "doi": "10.1145/3441852.3471233"
    },
    {
      "text": "TJ Thomson and Keith Greenwood. 2020. Profile Pictures Across Platforms: How Identity Visually Manifests Itself among Social Media Accounts. Handbook of Visual Communication. 349–363.",
      "doi": ""
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How Blind People Interact with Visual Content on Social Networking Services. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW ’16), 1584–1595. https://doi.org/10.1145/2818048.2820013",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making design probes work. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI ’13), 3441–3450. https://doi.org/10.1145/2470654.2466473",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Julie Schiller. 2017. Automatic Alt-text: Computer-generated Image Descriptions for Blind Users on a Social Network Service. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17), 1180–1192. https://doi.org/10.1145/2998181.2998364",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Lotus Zhang, Lucy Jiang, Nicole Washington, Augustina Ao Liu, Jingyao Shao, Adam Fourney, Meredith Ringel Morris, and Leah Findlater. 2021. Social Media through Voice: Synthesized Voice Qualities and Self-presentation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1: 161:1-161:21. https://doi.org/10.1145/3449235",
      "doi": "10.1145/3449235"
    },
    {
      "text": "Chen Zhao and Gonglue Jiang. 2011. Cultural differences on visual self-presentation through social networking site profile images. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI ’11), 1129–1132. https://doi.org/10.1145/1978942.1979110",
      "doi": "10.1145/1978942.1979110"
    },
    {
      "text": "Yuhang Zhao, Shaomei Wu, Lindsay Reynolds, and Shiri Azenkot. 2017. The Effect of Computer-Generated Descriptions on Photo-Sharing Experiences of People with Visual Impairments. Proceedings of the ACM on Human-Computer Interaction 1, CSCW: 121:1-121:22. https://doi.org/10.1145/3134756",
      "doi": "10.1145/3134756"
    },
    {
      "text": "How to Meet WCAG (Quickref Reference). Retrieved from https://www.w3.org/WAI/WCAG21/quickref/?versions=2.0#text-alternatives",
      "doi": ""
    },
    {
      "text": "Accessible Digital Media Guidelines – Guideline A: Images. Accessible Digital Media Guidelines. Retrieved from https://www.wgbh.org/foundation/ncam/guidelines/accessible-digital-media-guidelines-guideline-a-images",
      "doi": ""
    },
    {
      "text": "Seeing AI App from Microsoft. Retrieved from https://www.microsoft.com/en-us/ai/seeing-ai",
      "doi": ""
    }
  ]
}