{
  "doi": "10.1145/3544548.3580646",
  "title": "Jamming-as-exploration: Creating and Playing Games to Explore Gender Identity",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Games can be powerful vehicles for gender identity exploration and self-reflection but are often subject to designers' biases including gender representation, limiting such opportunities. Using a game jam as a research-through-design method, alongside qualitative interviews with the creators, this paper explores how the process of creating games and the games themselves can facilitate exploration of and reflection on gender identity. We highlight aspects of identity people want to explore; how different game elements can support processes of exploring these, and what aspects are missing in games. Further, the process of creating and playing helped participants reflect on and reframe their understanding of gender regardless of their identity/experience. Finally, we reflect on the process of designing an inclusive jam around the topic of gender identity, which can be sensitive and divisive. Our work results in implications for the design of games and other potential tools for gender exploration.",
  "authors": [
    {
      "name": "Leya George",
      "institution": "UCL Interaction Centre, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659555087",
      "orcid": "0000-0002-0020-6178"
    },
    {
      "name": "Aneesha Singh",
      "institution": "UCL Interaction Centre, University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81502753265/rel-imgonly/aneeshalinkedinphoto.jpg",
      "acmid": "81502753265",
      "orcid": "0000-0003-0835-5802"
    },
    {
      "name": "Nadia Berthouze",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585889",
      "orcid": "0000-0001-8921-0044"
    },
    {
      "name": "Lorna Hobbs",
      "institution": "UCL Medical School, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782676",
      "orcid": "0000-0002-9554-0573"
    },
    {
      "name": "Jo Gibbs",
      "institution": "Institute for Global Health, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259197357",
      "orcid": "0000-0001-5696-0260"
    }
  ],
  "references": [
    {
      "text": "Kai Baldwin. 2019. Virtual avatars: Trans experiences of ideal selves through gaming. Markets, Globalization & Development Review 3, 3 (2019).",
      "doi": ""
    },
    {
      "text": "Ditte Amund Basballe and Kim Halskov. 2012. Dynamics of research through design. 58–67.",
      "doi": ""
    },
    {
      "text": "A Tece Bayrak. 2017. Jamming as a design approach. Power of jamming for creative iteration. The Design Journal 20, sup1 (2017), S3945–S3953.",
      "doi": ""
    },
    {
      "text": "Sandra Lipsitz Bem. 1981. Gender schema theory: A cognitive account of sex typing. Psychological review 88, 4 (1981), 354.",
      "doi": ""
    },
    {
      "text": "Ian Bogost. 2016. Play anything: The pleasure of limits, the uses of boredom, and the secret of games. Basic Books.",
      "doi": ""
    },
    {
      "text": "Braun, V., & Clarke, V. (2012). Thematic analysis. American Psychological Association..",
      "doi": ""
    },
    {
      "text": "Judith Butler. 2011. Bodies that matter: On the discursive limits of sex. routledge.",
      "doi": ""
    },
    {
      "text": "Judith Butler and Gender Trouble. 1990. Feminism and the Subversion of Identity. Gender trouble 3, 1 (1990).",
      "doi": ""
    },
    {
      "text": "Sally Jo Cunningham and Matt Jones. 2005. Autoethnography: a tool for practice and education. 1–8.",
      "doi": ""
    },
    {
      "text": "Menno Deen, Robert Cercos, Alan Chatman, Amani Naseem, Regina Bernhaupt, Allan Fowler, Ben Schouten, and Florian Mueller. 2014. Game jam: [4 research]. In CHI’14 Extended Abstracts on Human Factors in Computing Systems. 25–28.",
      "doi": ""
    },
    {
      "text": "Menno Deen, Frank Nack, and Mata Haggis. 2015. Diversity through specificity: design lessons learned from the Games [4Diversity] Jams. 1–10.",
      "doi": ""
    },
    {
      "text": "Menno Deen, Ben Schouten, and Tilde Bekker. 2015. Playful identity in game design and open-ended play. Playful Identities (2015), 111.",
      "doi": ""
    },
    {
      "text": "Sabina Dirks, Menno van Pelt-Deen, and Eline Muijres. 2018. Playing with refugees and other minorities during the Games [4Diversity] Jam. 34–38.",
      "doi": ""
    },
    {
      "text": "Charlie Ecenbarger. 2014. The impact of video games on identity construction. Pennsylvania Communication Annual 70, 3 (2014), 34–50.",
      "doi": ""
    },
    {
      "text": "Susan K Egan and David G Perry. 2001. Gender identity: a multidimensional analysis with implications for psychosocial adjustment. Developmental psychology 37, 4 (2001), 451.",
      "doi": ""
    },
    {
      "text": "Malte Elson, Johannes Breuer, James D Ivory, and Thorsten Quandt. 2014. More than stories with buttons: Narrative, mechanics, and context as determinants of player experience in digital games. Journal of Communication 64, 3 (2014), 521–542.",
      "doi": ""
    },
    {
      "text": "Jeanette Falk, Michael Mose Biskjaer, Kim Halskov, and Annakaisa Kultima. 2021. How Organisers Understand and Promote Participants’ Creativity in Game Jams. 12–21.",
      "doi": ""
    },
    {
      "text": "Cláudia Ferraz and Kiev Gama. 2019. A case study about gender issues in a game jam. 1–8.",
      "doi": ""
    },
    {
      "text": "Freeman, G., Bardzell, J., Bardzell, S., & Herring, S. C. (2015, February). Simulating marriage: Gender roles and emerging intimacy in an online game. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (pp. 1191-1200)..",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, Lynn Dombrowski, and Gillian R Hayes. 2015. Disclosure, stress, and support during gender transition on Facebook. 1176–1190.",
      "doi": ""
    },
    {
      "text": "Christina Harrington and Tawanna R Dillahunt. 2021. Eliciting tech futures among Black young adults: A case study of remote speculative co-design. 1–15.",
      "doi": ""
    },
    {
      "text": "Johan Huizinga. 2014. Homo ludens: A study of the play-element in culture. Routledge.",
      "doi": ""
    },
    {
      "text": "Jeroen Jansz. 2015. 14. Playing out identities and emotions. Playful identities (2015), 267.",
      "doi": ""
    },
    {
      "text": "Helen W Kennedy. 2018. Game jam as feminist methodology: The affective labors of intervention in the ludic economy. Games and Culture 13, 7 (2018), 708–727.",
      "doi": ""
    },
    {
      "text": "Rilla Khaled. 2018. Questions over answers: Reflective game design. In Playful disruption of digital media. Springer, 3–27.",
      "doi": ""
    },
    {
      "text": "Lawrence A Kohlberg. 1966. A cognitive-developmental analysis of children's sex role concepts and attitudes. The development of sex differences (1966), 82–173.",
      "doi": ""
    },
    {
      "text": "Esther MacCallum-Stewart. 2008. Real boys carry girly epics: Normalising gender bending in online games. Eludamos: Journal for Computer Game Culture 2, 1 (2008), 27–40.",
      "doi": ""
    },
    {
      "text": "Elisa D Mekler, Ioanna Iacovides, and Julia Ayumi Bopp. 2018. “ A Game that Makes You Question...” Exploring the Role of Reflection for the Player Experience. 315–327.",
      "doi": ""
    },
    {
      "text": "Jos de Mul. 2015. The game of life: Narrative and ludic identity formation in computer games. In Representations of Internarrative Identity. Springer, 159–187.",
      "doi": ""
    },
    {
      "text": "Danielle Nielsen. 2015. Identity performance in roleplaying games. Computers and Composition 38, (2015), 45–56.",
      "doi": ""
    },
    {
      "text": "Aisling Ann O'Kane, Yvonne Rogers, and Ann E Blandford. 2014. Gaining empathy for non-routine mobile device use through autoethnography. 987–990.",
      "doi": ""
    },
    {
      "text": "Dayanne Oliveira, Rafa Prado, Kiev Gama, and George Valença. 2021. An Exploratory Study on the participation of LGBTQIA+ people in the Global Game Jam 2021. 47–54.",
      "doi": ""
    },
    {
      "text": "Owain Pedgley. 2007. Capturing and analysing own design activity. Design studies 28, 5 (2007), 463–483.",
      "doi": ""
    },
    {
      "text": "Paul Ricoeur. 1985. Narrated time. Philosophy Today 29, 4 (1985), 259–272.",
      "doi": ""
    },
    {
      "text": "Barbara J Risman. 2018. Gender as a social structure. In Handbook of the Sociology of Gender. Springer, 19–43.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M Branham, and Foad Hamidi. 2018. Safe spaces and safe places: Unpacking technology-mediated experiences of safety and harm with transgender people. Proceedings of the ACM on Human-computer Interaction 2, CSCW (2018), 1–27.",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Rainforest Scully-Blaker. 2014. A practiced practice: Speedrunning through space with de Certeau and Virilio. Game Studies 14, 1 (2014).",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph'Jofish’ Kaye. 2005. Reflective design. 49–58.",
      "doi": ""
    },
    {
      "text": "Katta Spiel. 2021. ” Why are they all obsessed with Gender?”—(Non) binary Navigations through Technological Infrastructures. 478–494.",
      "doi": ""
    },
    {
      "text": "Velvet Spors and Imo Kaufman. 2021. Respawn, Reload, Relate: Exploring the Self-Care Possibilities for Mental Health in Games through a Humanistic Lens. Proceedings of the ACM on Human-Computer Interaction 5, CHI PLAY (2021), 1–31.",
      "doi": "10.1145/3474690"
    },
    {
      "text": "Ana Tajadura-Jiménez, Joseph Newbold, Linge Zhang, Patricia Rick, and Nadia Bianchi-Berthouze. 2019. As light as you aspire to be: changing body perception with sound to support physical activity. 1–14.",
      "doi": ""
    },
    {
      "text": "Desiree D Tobin, Meenakshi Menon, Madhavi Menon, Brooke C Spatta, Ernest VE Hodges, and David G Perry. 2010. The intrapsychics of gender: a model of self-socialization. Psychological review 117, 2 (2010), 601.",
      "doi": ""
    },
    {
      "text": "Kellie Vella, Daniel Johnson, and Leanne Hides. 2015. Playing alone, playing with others: Differences in player experience and indicators of wellbeing. 3–12.",
      "doi": ""
    },
    {
      "text": "Emma Westecott. 2016. Playing with Gender: Promoting Representational Diversity with Dress-Up, Cross- Dressing and Drag in Games. Diversifying Barbie and Mortal Combat: Intersectional Perspectives and Inclusive Designs in Gaming (2016), 234–246.",
      "doi": ""
    },
    {
      "text": "Arcelus, J., Bouman, W. P., Jones, B. A., Richards, C., Jimenez-Murcia, S., & Griffiths, M. D. (2016). Video gaming and gaming addiction in transgender people: An exploratory study. Journal of Behavioral Addictions, 6(1), 21-29.",
      "doi": ""
    }
  ]
}