{
  "doi": "10.1145/3544548.3581037",
  "title": "Surface I/O: Creating Devices with Functional Surface Geometry for Haptics and User Input",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2023,
  "badges": [],
  "abstract": "Surface I/O is a novel interface approach that functionalizes the exterior surface of devices to provide haptic and touch sensing without dedicated mechanical components. Achieving this requires a unique combination of surface features spanning the macro-scale (5cm ∼ 1mm), meso-scale (1mm ∼ 200μm), and micro-scale (<200μm). This approach simplifies interface creation, allowing designers to iterate on form geometry, haptic feeling, and sensing functionality without the limitations of mechanical mechanisms. We believe this can contribute to the concept of \"invisible ubiquitous interactivity at scale\", where the simplicity and easy implementation of the technique allows it to blend with objects around us. While we prototyped our designs using 3D printers and laser cutters, our technique is applicable to mass production methods, including injection molding and stamping, enabling passive goods with new levels of interactivity.",
  "tags": [
    "design",
    "tangible interfaces",
    "input devices",
    "haptics"
  ],
  "authors": [
    {
      "name": "Yuran Ding",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99660779850/rel-imgonly/img_4886_3.jpg",
      "acmid": "99660779850",
      "orcid": "0000-0003-0664-4731"
    },
    {
      "name": "Craig Shultz",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83058740657",
      "orcid": "0000-0003-0469-8760"
    },
    {
      "name": "Chris Harrison",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "Continental AG. 2018. Continental Automotive. http://www.continental-automotive.com/en-gl/Passenger-Cars/User-Experience/Display-Solutions/Flat-New/3D-touch-Surface-Display",
      "doi": ""
    },
    {
      "text": "Roland Aigner, Mira Alida Haberfellner, and Michael Haller. 2022. spaceR: Knitting Ready-Made, Tactile, and Highly Responsive Spacer-Fabric Force Sensors for Continuous Input. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology(UIST ’22). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3526113.3545694",
      "doi": "10.1145/3526113.3545694"
    },
    {
      "text": "Jason Alexander, Anne Roudaut, Jürgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand Challenges in Shape-Changing Interface Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173873",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Cagatay Basdogan, Frederic Giraud, Vincent Levesque, and Seungmoon Choi. 2020. A Review of Surface Haptics: Enabling Tactile Effects on Touch Surfaces. IEEE Transactions on Haptics 13, 3 (July 2020), 450–470. https://doi.org/10.1109/TOH.2020.2990712 Conference Name: IEEE Transactions on Haptics.",
      "doi": ""
    },
    {
      "text": "Olivier Bau, Uros Petrevski, and Wendy Mackay. 2009. BubbleWrap: a textile-based electromagnetic haptic display. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’09). Association for Computing Machinery, New York, NY, USA, 3607–3612. https://doi.org/10.1145/1520340.1520542",
      "doi": "10.1145/1520340.1520542"
    },
    {
      "text": "Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: electrovibration for touch surfaces. In Proceedings of the 23nd annual ACM symposium on User interface software and technology(UIST ’10). Association for Computing Machinery, New York, NY, USA, 283–292. https://doi.org/10.1145/1866029.1866074",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Hrvoje Benko, Andrew D. Wilson, and Ravin Balakrishnan. 2008. Sphere: multi-touch interactions on a spherical display. In Proceedings of the 21st annual ACM symposium on User interface software and technology(UIST ’08). Association for Computing Machinery, New York, NY, USA, 77–86. https://doi.org/10.1145/1449715.1449729",
      "doi": "10.1145/1449715.1449729"
    },
    {
      "text": "Sliman BensmaÏa, Mark Hollins, and Jeffrey Yau. 2005. Vibrotactile intensity and frequency information in the Pacinian system: A psychophysical model. Perception & Psychophysics 67, 5 (July 2005), 828–841. https://doi.org/10.3758/BF03193536",
      "doi": ""
    },
    {
      "text": "David T. Blake, Steven S. Hsiao, and Kenneth O. Johnson. 1997. Neural Coding Mechanisms in Tactile Pattern Recognition: The Relative Contributions of Slowly and Rapidly Adapting Mechanoreceptors to Perceived Roughness. Journal of Neuroscience 17, 19 (Oct. 1997), 7480–7489. https://doi.org/10.1523/JNEUROSCI.17-19-07480.1997 Publisher: Society for Neuroscience Section: Articles.",
      "doi": ""
    },
    {
      "text": "S Bolanowski, George Gescheider, R Verrillo, and C Checkosky. 1988. Four channels mediate the mechanical aspects of touch. The Journal of the Acoustical Society of America 84 (Dec. 1988), 1680–94. https://doi.org/10.1121/1.397184",
      "doi": ""
    },
    {
      "text": "Stefan Josef Breitschaft and Claus-Christian Carbon. 2021. Function Follows Form: Using the Aesthetic Association Principle to Enhance Haptic Interface Design. Frontiers in Psychology 12 (2021). https://www.frontiersin.org/articles/10.3389/fpsyg.2021.646986",
      "doi": ""
    },
    {
      "text": "Stefan Josef Breitschaft, Stella Clarke, and Claus-Christian Carbon. 2019. A Theoretical Framework of Haptic Processing in Automotive User Interfaces and Its Implications on Design and Engineering. Frontiers in Psychology 10 (2019). https://www.frontiersin.org/articles/10.3389/fpsyg.2019.01470",
      "doi": ""
    },
    {
      "text": "Anke M. Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2015. Interactivity Improves Usability of Geographic Maps for Visually Impaired People. Human–Computer Interaction 30, 2 (March 2015), 156–194. https://doi.org/10.1080/07370024.2014.924412",
      "doi": ""
    },
    {
      "text": "Craig Brown and Amy Hurst. 2012. VizTouch: automatically generated tactile visualizations of coordinate spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction(TEI ’12). Association for Computing Machinery, New York, NY, USA, 131–138. https://doi.org/10.1145/2148131.2148160",
      "doi": "10.1145/2148131.2148160"
    },
    {
      "text": "Patrick Bruns, Carlos J. Camargo, Humberto Campanella, Jaume Esteve, Hubert R. Dinse, and Brigitte Röder. 2014. Tactile Acuity Charts: A Reliable Measure of Spatial Acuity. PLOS ONE 9, 2 (Feb. 2014), e87384. https://doi.org/10.1371/journal.pone.0087384",
      "doi": ""
    },
    {
      "text": "David Arthur Burns, Roberta L. Klatzky, Michael A. Peshkin, and J. Edward Colgate. 2021. Spatial perception of textures depends on length-scale. In 2021 IEEE World Haptics Conference (WHC). 415–420. https://doi.org/10.1109/WHC49131.2021.9517265",
      "doi": ""
    },
    {
      "text": "Lightmotif B.V.2022. Lightmotif — Mold texturing. https://www.lightmotif.nl/mold-texturing",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho, Hiroshi Ishii, and Pattie Maes. 2008. Surflex: a programmable surface for the design of tangible interfaces. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’08). Association for Computing Machinery, New York, NY, USA, 3429–3434. https://doi.org/10.1145/1358628.1358869",
      "doi": "10.1145/1358628.1358869"
    },
    {
      "text": "Marcelo Coelho and Pattie Maes. 2008. Sprout I/O: a texturally rich interface. In Proceedings of the 2nd international conference on Tangible and embedded interaction(TEI ’08). Association for Computing Machinery, New York, NY, USA, 221–222. https://doi.org/10.1145/1347390.1347440",
      "doi": "10.1145/1347390.1347440"
    },
    {
      "text": "Julie Ducasse, Anke M. Brock, and Christophe Jouffrais. 2018. Accessible Interactive Maps for Visually Impaired Users. In Mobility of Visually Impaired People: Fundamentals and ICT Assistive Technologies, Edwige Pissaloux and Ramiro Velazquez (Eds.). Springer International Publishing, Cham, 537–584. https://doi.org/10.1007/978-3-319-54446-5_17",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation. In Proceedings of the 26th annual ACM symposium on User interface software and technology(UIST ’13). Association for Computing Machinery, New York, NY, USA, 417–426. https://doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Giovanni Fusco and Valerie S. Morash. 2015. The Tactile Graphics Helper: Providing Audio Clarification for Tactile Graphics Using Machine Vision. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility(ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 97–106. https://doi.org/10.1145/2700648.2809868",
      "doi": "10.1145/2700648.2809868"
    },
    {
      "text": "Cagatay Goncu, Simone Marinai, and Kim Marriott. 2014. Generation of accessible graphics. In 22nd Mediterranean Conference on Control and Automation. 169–174. https://doi.org/10.1109/MED.2014.6961366",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang ’Anthony’ Chen, Tom Yeh, Scott E. Hudson, Jennifer Mankoff, and Jeffrey P. Bigham. 2017. Facade: Auto-generating Tactile Interfaces to Appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 5826–5838. https://doi.org/10.1145/3025453.3025845",
      "doi": "10.1145/3025453.3025845"
    },
    {
      "text": "Timo Götzelmann. 2016. LucentMaps: 3D Printed Audiovisual Tactile Maps for Blind and Visually Impaired People. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’16). Association for Computing Machinery, New York, NY, USA, 81–90. https://doi.org/10.1145/2982142.2982163",
      "doi": "10.1145/2982142.2982163"
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2008. Scratch input: creating large, inexpensive, unpowered and mobile finger input surfaces. In Proceedings of the 21st annual ACM symposium on User interface software and technology(UIST ’08). Association for Computing Machinery, New York, NY, USA, 205–208. https://doi.org/10.1145/1449715.1449747",
      "doi": "10.1145/1449715.1449747"
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2009. Providing dynamically changeable physical buttons on a visual display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Boston MA USA, 299–308. https://doi.org/10.1145/1518701.1518749",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Chris Harrison, Julia Schwarz, and Scott E. Hudson. 2011. TapSense: enhancing finger interaction on touch surfaces. In Proceedings of the 24th annual ACM symposium on User interface software and technology(UIST ’11). Association for Computing Machinery, New York, NY, USA, 627–636. https://doi.org/10.1145/2047196.2047279",
      "doi": "10.1145/2047196.2047279"
    },
    {
      "text": "Chris Harrison, Robert Xiao, and Scott Hudson. 2012. Acoustic barcodes: passive, durable and inexpensive notched identification tags. In Proceedings of the 25th annual ACM symposium on User interface software and technology(UIST ’12). Association for Computing Machinery, New York, NY, USA, 563–568. https://doi.org/10.1145/2380116.2380187",
      "doi": "10.1145/2380116.2380187"
    },
    {
      "text": "Stefan Heijboer, Josef Schumann, Erik Tempelman, and Pim Groen. 2019. Physical fights back: introducing a model for bridging analog digital interactions. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings(AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 93–98. https://doi.org/10.1145/3349263.3351510",
      "doi": "10.1145/3349263.3351510"
    },
    {
      "text": "Megan Hofmann, Kelly Mack, Jessica Birchfield, Jerry Cao, Autumn G Hughes, Shriya Kurpad, Kathryn J Lum, Emily Warnock, Anat Caspi, Scott E Hudson, and Jennifer Mankoff. 2022. Maptimizer: Using Optimization to Tailor Tactile Maps to Users Needs. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3491102.3517436",
      "doi": "10.1145/3491102.3517436"
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible Maps for the Blind: Comparing 3D Printed Models with Tactile Graphics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173772",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Charles Hudin and Sabrina Panëels. 2018. Localisation of Vibrotactile Stimuli with Spatio-Temporal Inverse Filtering. In Haptics: Science, Technology, and Applications(Lecture Notes in Computer Science), Domenico Prattichizzo, Hiroyuki Shinoda, Hong Z. Tan, Emanuele Ruffaldi, and Antonio Frisoli (Eds.). Springer International Publishing, Cham, 338–350. https://doi.org/10.1007/978-3-319-93399-3_30",
      "doi": ""
    },
    {
      "text": "ASTM International. 2010. Standard Test Method for Determining the Actuation Force and Contact Force of a Membrane Switch (Withdrawn 2008). https://www.astm.org/f1597-02.html",
      "doi": ""
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura. 2001. Project FEELEX: adding haptic surface to graphics. In Proceedings of the 28th annual conference on Computer graphics and interactive techniques(SIGGRAPH ’01). Association for Computing Machinery, New York, NY, USA, 469–476. https://doi.org/10.1145/383259.383314",
      "doi": "10.1145/383259.383314"
    },
    {
      "text": "Ryosuke Kawakatsu and Shigeyuki Hirai. 2018. Rubbinput: An Interaction Technique for Wet Environments Utilizing Squeak Sounds Caused by Finger-Rubbing. In 2018 IEEE International Conference on Pervasive Computing and Communications Workshops (PerCom Workshops). 512–517. https://doi.org/10.1109/PERCOMW.2018.8480335",
      "doi": ""
    },
    {
      "text": "Dagmar Kern and Bastian Pfleging. 2013. Supporting interaction through haptic feedback in automotive user interfaces. Interactions 20, 2 (March 2013), 16–21. https://doi.org/10.1145/2427076.2427081",
      "doi": "10.1145/2427076.2427081"
    },
    {
      "text": "Dagmar Kern and Albrecht Schmidt. 2009. Design space for driver-based automotive user interfaces. In Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’09). Association for Computing Machinery, New York, NY, USA, 3–10. https://doi.org/10.1145/1620509.1620511",
      "doi": "10.1145/1620509.1620511"
    },
    {
      "text": "Jeeeun Kim, Hyunjoo Oh, and Tom Yeh. 2015. A Study to Empower Children to Design Movable Tactile Pictures for Children with Visual Impairments. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’15). Association for Computing Machinery, New York, NY, USA, 703–708. https://doi.org/10.1145/2677199.2688815",
      "doi": "10.1145/2677199.2688815"
    },
    {
      "text": "KraussMaffei Company Ltd.2019. Generation of sophisticated surfaces via injection molding and dynamic mold heating. https://www.youtube.com/watch?v=pcmyc_NZ7u0",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 1987. Hand movements: A window into haptic object recognition. Cognitive Psychology 19, 3 (July 1987), 342–368. https://doi.org/10.1016/0010-0285(87)90008-9",
      "doi": ""
    },
    {
      "text": "S. J. Lederman and R. L. Klatzky. 2009. Haptic perception: A tutorial. Attention, Perception, & Psychophysics 71, 7 (Oct. 2009), 1439–1459. https://doi.org/10.3758/APP.71.7.1439",
      "doi": ""
    },
    {
      "text": "Daniel Leithinger and Hiroshi Ishii. 2010. Relief: a scalable actuated shape display. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction(TEI ’10). Association for Computing Machinery, New York, NY, USA, 221–222. https://doi.org/10.1145/1709886.1709928",
      "doi": "10.1145/1709886.1709928"
    },
    {
      "text": "Vincent Levesque, Louise Oram, Karon MacLean, Andy Cockburn, Nicholas D. Marchuk, Dan Johnson, J. Edward Colgate, and Michael A. Peshkin. 2011. Enhancing physicality in touch interaction with programmable friction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 2481–2490. https://doi.org/10.1145/1978942.1979306",
      "doi": "10.1145/1978942.1979306"
    },
    {
      "text": "Pedro A. Lopes, Alfredo Ferreira, and J. A. Madeiras Pereira. 2010. Multitouch interactive DJing surface. In Proceedings of the 7th International Conference on Advances in Computer Entertainment Technology(ACE ’10). Association for Computing Machinery, New York, NY, USA, 28–31. https://doi.org/10.1145/1971630.1971639",
      "doi": "10.1145/1971630.1971639"
    },
    {
      "text": "Louise R. Manfredi, Hannes P. Saal, Kyler J. Brown, Mark C. Zielinski, John F. Dammann, Vicky S. Polashock, and Sliman J. Bensmaia. 2014. Natural scenes in tactile texture. Journal of Neurophysiology 111, 9 (May 2014), 1792–1802. https://doi.org/10.1152/jn.00680.2013 Publisher: American Physiological Society.",
      "doi": ""
    },
    {
      "text": "Sara Mlakar, Mira Alida Haberfellner, Hans-Christian Jetter, and Michael Haller. 2021. Exploring Affordances of Surface Gestures on Textile User Interfaces. In Designing Interactive Systems Conference 2021(DIS ’21). Association for Computing Machinery, New York, NY, USA, 1159–1170. https://doi.org/10.1145/3461778.3462139",
      "doi": "10.1145/3461778.3462139"
    },
    {
      "text": "Sara Mlakar and Michael Haller. 2020. Design Investigation of Embroidered Interactive Elements on Non-Wearable Textile Interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376692",
      "doi": "10.1145/3313831.3376692"
    },
    {
      "text": "Roderick Murray-Smith, John Williamson, Stephen Hughes, Torben Quaade, and Steven Strachan. 2008. Rub the stane. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’08). Association for Computing Machinery, New York, NY, USA, 2355–2360. https://doi.org/10.1145/1358628.1358683",
      "doi": "10.1145/1358628.1358683"
    },
    {
      "text": "Mathias Müller, Anja Knöfel, Thomas Gründer, Ingmar Franke, and Rainer Groh. 2014. FlexiWall: Exploring Layered Data with Elastic Displays. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces(ITS ’14). Association for Computing Machinery, New York, NY, USA, 439–442. https://doi.org/10.1145/2669485.2669529",
      "doi": "10.1145/2669485.2669529"
    },
    {
      "text": "Don Norman. 2013. The Design of Everyday Things: Revised and Expanded Edition. Basic Books. Google-Books-ID: nVQPAAAAQBAJ.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Oliver Nowak, René Schäfer, Anke Brocker, Philipp Wacker, and Jan Borchers. 2022. Shaping Textile Sliders: An Evaluation of Form Factors and Tick Marks for Textile Sliders. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3491102.3517473",
      "doi": "10.1145/3491102.3517473"
    },
    {
      "text": "D. T. Pham, Z. Ji, O. Peyroutet, M. Yang, Z. Wang, and M. Al-kutubi. 2006. - Localisation of impacts on solid objects using the Wavelet Transform and Maximum Likelihood Estimation. In Intelligent Production Machines and Systems, D. T. Pham, E. E. Eldukhri, and A. J. Soroka (Eds.). Elsevier Science Ltd, Oxford, 541–547. https://doi.org/10.1016/B978-008045157-2/50095-X",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 4216–4227. https://doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-changing interfaces: a review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). Association for Computing Machinery, New York, NY, USA, 735–744. https://doi.org/10.1145/2207676.2207781",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Anne Roudaut, Henning Pohl, and Patrick Baudisch. 2011. Touch input on curved surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 1011–1020. https://doi.org/10.1145/1978942.1979094",
      "doi": "10.1145/1978942.1979094"
    },
    {
      "text": "Craig Shultz, Daehwa Kim, Karan Ahuja, and Chris Harrison. 2022. TriboTouch: Micro-Patterned Surfaces for Low Latency Touchscreens. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3491102.3502069",
      "doi": "10.1145/3491102.3502069"
    },
    {
      "text": "Craig Shultz, Michael Peshkin, and J. Edward Colgate. 2018. The Application of Tactile, Audible, and Ultrasonic Forces to Human Fingertips Using Broadband Electroadhesion. IEEE Transactions on Haptics 11, 2 (April 2018), 279–290. https://doi.org/10.1109/TOH.2018.2793867 Conference Name: IEEE Transactions on Haptics.",
      "doi": ""
    },
    {
      "text": "St. Paul Engraving, Inc.2016. Laser Texturing. https://www.youtube.com/watch?v=bB47_QzyuxQ",
      "doi": ""
    },
    {
      "text": "Abigale Stangl, Chia-Lo Hsu, and Tom Yeh. 2015. Transcribing Across the Senses: Community Efforts to Create 3D Printable Accessible Tactile Pictures for Young Children with Visual Impairments. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility(ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 127–137. https://doi.org/10.1145/2700648.2809854",
      "doi": "10.1145/2700648.2809854"
    },
    {
      "text": "Ryo Suzuki, Abigale Stangl, Mark D. Gross, and Tom Yeh. 2017. FluxMarker: Enhancing Tactile Graphics with Dynamic Tactile Markers. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 190–199. https://doi.org/10.1145/3132525.3132548",
      "doi": "10.1145/3132525.3132548"
    },
    {
      "text": "Brandon T. Taylor, Anind K. Dey, Dan P. Siewiorek, and Asim Smailagic. 2015. TactileMaps.net: A Web Interface for Generating Customized 3D-Printable Tactile Maps. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility(ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 427–428. https://doi.org/10.1145/2700648.2811336",
      "doi": "10.1145/2700648.2811336"
    },
    {
      "text": "U-NICA Solutions AG. 2023. intraGRAM®. https://www.u-nica.com/solutions/intragram",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21st century. ACM SIGMOBILE Mobile Computing and Communications Review 3, 3 (July 1999), 3–11. https://doi.org/10.1145/329124.329126",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Michael Wiertlewski, José Lozada, and Vincent Hayward. 2011. The Spatial Spectrum of Tangential Skin Displacement Can Encode Tactual Texture. IEEE Transactions on Robotics 27, 3 (June 2011), 461–472. https://doi.org/10.1109/TRO.2011.2132830 Conference Name: IEEE Transactions on Robotics.",
      "doi": "10.1109/TRO.2011.2132830"
    },
    {
      "text": "Laura Winfield, John Glassmire, J. Edward Colgate, and Michael Peshkin. 2007. T-PaD: Tactile Pattern Display through Variable Friction Reduction. In Second Joint EuroHaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems (WHC’07). 421–426. https://doi.org/10.1109/WHC.2007.105",
      "doi": "10.1109/WHC.2007.105"
    },
    {
      "text": "Jung-Han Woo and Jeong-Guon Ih. 2015. Vibration rendering on a thin plate with actuator array at the periphery. Journal of Sound and Vibration 349 (Aug. 2015), 150–162. https://doi.org/10.1016/j.jsv.2015.03.031",
      "doi": ""
    }
  ]
}