{
  "doi": "10.1145/3544548.3581548",
  "title": "“Finding the Magic Sauce”: Exploring Perspectives of Recruiters and Job Seekers on Recruitment Bias and Automated Tools",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Automated recruitment tools are proliferating. While having the promise of improving efficiency, various risks, including bias, challenges the potential of these tools. An in-depth understanding of the perceived risk factors and needs from the perspective of both recruiters and job seekers is needed. We address this through an interview study in the high-tech industry to compare and contrast the concerns of these two roles. We found that the importance of clarifying position requirements and assessing candidates as “whole individuals” are commonly discussed by both recruiters and job seekers. In contrast, while recruiters tended to be more aware of cognitive bias and desired more tool support during interviews, job seekers voiced more desire towards a healthy candidate-company relationship. Additionally, both roles considered the uncertainty of the current technology capability and reduced human contact as concerns for using automated tools. Based on these results, we provided design implications for automated recruitment tools and related decision-support technologies.",
  "authors": [
    {
      "name": "Mitra Lashkari",
      "institution": "Polytechnique Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783684",
      "orcid": "0000-0002-0153-4229"
    },
    {
      "name": "Jinghui Cheng",
      "institution": "Polytechnique Montreal, Canada",
      "img": "/do/10.1145/contrib-81548783656/rel-imgonly/profile2.png",
      "acmid": "81548783656",
      "orcid": "0000-0002-8474-5290"
    }
  ],
  "references": [
    {
      "text": "Giovanni Abramo, Ciriaco Andrea D’Angelo, and Francesco Rosati. 2016. Gender bias in academic recruitment. Scientometrics 106, 1 (2016), 119–141. https://doi.org/10.1007/s11192-015-1783-3",
      "doi": "10.1007/s11192-015-1783-3"
    },
    {
      "text": "Chiara Acciarini, Federica Brunetta, and Paolo Boccardelli. 2020. Cognitive biases and decision-making strategies in times of change: a systematic literature review. Management Decision 59, 3 (2020), 638–652.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 675–684. https://doi.org/10.1145/1978942.1979041",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Geoffrey Beattie and Patrick Johnson. 2012. Possible unconscious bias in recruitment and promotion and the need to promote equality. Perspectives: Policy and Practice in Higher Education 16, 1 (2012), 7–13. https://doi.org/10.1080/13603108.2011.611833 arXiv:https://doi.org/10.1080/13603108.2011.611833",
      "doi": ""
    },
    {
      "text": "Sven Charleer, Francisco Gutiérrez, and Katrien Verbert. 2019. Supporting Job Mediator and Job Seeker through an Actionable Dashboard. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 121–131. https://doi.org/10.1145/3301275.3302312",
      "doi": "10.1145/3301275.3302312"
    },
    {
      "text": "Celina M. Chatman and William von Hippel. 2001. Attributional Mediation of In-Group Bias. Journal of Experimental Social Psychology 37, 3 (2001), 267–272. https://doi.org/10.1006/jesp.2000.1457",
      "doi": ""
    },
    {
      "text": "Phoebe K. Chua and Melissa Mazmanian. 2020. Are You One of Us? Current Hiring Practices Suggest the Potential for Class Biases in Large Tech Companies. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 143 (oct 2020), 20 pages. https://doi.org/10.1145/3415214",
      "doi": "10.1145/3415214"
    },
    {
      "text": "Brian W Collins. 2007. Tackling unconscious bias in hiring practices: The plight of the Rooney rule. NYUL Rev. 82(2007), 870.",
      "doi": ""
    },
    {
      "text": "Jeffrey Dastin. 2018. Amazon scraps secret AI recruiting tool that showed bias against women. https://www.reuters.com/article/us-amazon-com-jobs-automation-insight-idUSKCN1MK08G",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt and Joey Chiao-Yin Hsiao. 2020. Positive Feedback and Self-Reflection: Features to Support Self-Efficacy among Underrepresented Job Seekers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376717",
      "doi": "10.1145/3313831.3376717"
    },
    {
      "text": "Tawanna R. Dillahunt, Jason Lam, Alex Lu, and Earnest Wheeler. 2018. Designing Future Employment Applications for Underserved Job Seekers: A Speed Dating Study. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 33–44. https://doi.org/10.1145/3196709.3196770",
      "doi": "10.1145/3196709.3196770"
    },
    {
      "text": "Nathanael J. Fast, Niro Sivanathan, Nicole D. Mayer, and Adam D. Galinsky. 2012. Power and overconfident decision-making. Organizational Behavior and Human Decision Processes 117, 2(2012), 249–260. https://doi.org/10.1016/j.obhdp.2011.11.009",
      "doi": ""
    },
    {
      "text": "Mauricio Noris Freire and Leandro Nunes de Castro. 2021. e-Recruitment recommender systems: a systematic review. Knowledge and Information Systems 63, 1 (2021), 1–20. https://doi.org/10.1007/s10115-020-01522-8",
      "doi": "10.1007/s10115-020-01522-8"
    },
    {
      "text": "Anikó Hannák, Claudia Wagner, David Garcia, Alan Mislove, Markus Strohmaier, and Christo Wilson. 2017. Bias in Online Freelance Marketplaces: Evidence from TaskRabbit and Fiverr. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1914–1933. https://doi.org/10.1145/2998181.2998327",
      "doi": "10.1145/2998181.2998327"
    },
    {
      "text": "Martie G. Haselton, Daniel Nettle, and Damian R. Murray. 2015. The Evolution of Cognitive Bias. John Wiley & Sons, Ltd, Chapter 41, 1–20. https://doi.org/10.1002/9781119125563.evpsych241 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/9781119125563.evpsych241",
      "doi": ""
    },
    {
      "text": "Mark Haugaard. 2021. The four dimensions of power: conflict and democracy. Journal of Political Power 14, 1 (2021), 153–175. https://doi.org/10.1080/2158379X.2021.1878411 arXiv:https://doi.org/10.1080/2158379X.2021.1878411",
      "doi": ""
    },
    {
      "text": "David G Hendry, Jill Palzkill Woelfer, and Thuy Duong. 2017. U-District Job Co-op: constructing a future vision for homeless young people and employment. Information Technology & People 30, 3 (2017), 602–628.",
      "doi": ""
    },
    {
      "text": "Sami Koivunen, Thomas Olsson, Ekaterina Olshannikova, and Aki Lindberg. 2019. Understanding Decision-Making in Recruitment: Opportunities and Challenges for Information Technology. Proc. ACM Hum.-Comput. Interact. 3, GROUP, Article 242 (dec 2019), 22 pages. https://doi.org/10.1145/3361123",
      "doi": "10.1145/3361123"
    },
    {
      "text": "Markus Langer, Cornelius J. König, and Maria Papathanasiou. 2019. Highly automated job interviews: Acceptance under the influence of stakes. International Journal of Selection and Assessment 27, 3(2019), 217–234. https://doi.org/10.1111/ijsa.12246 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/ijsa.12246",
      "doi": ""
    },
    {
      "text": "Weiwen Leung, Zheng Zhang, Daviti Jibuti, Jinhao Zhao, Maximilian Klein, Casey Pierce, Lionel Robert, and Haiyi Zhu. 2020. Race, Gender and Beauty: The Effect of Information Provision on Online Hiring Biases. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3313831.3376874",
      "doi": "10.1145/3313831.3376874"
    },
    {
      "text": "Karmela Liebkind, Liisa Larja, and Asteria Brylka. 2016. Ethnic and Gender Discrimination in Recruitment: Experimental Evidence From Finland. Journal of Social and Political Psychology 4, 1 (Jun. 2016), 403–426. https://doi.org/10.5964/jspp.v4i1.433",
      "doi": ""
    },
    {
      "text": "Jennifer Nickel and Heike Schaumburg. 2004. Electronic Privacy, Trust and Self-Disclosure in e-Recruitment. In CHI ’04 Extended Abstracts on Human Factors in Computing Systems (Vienna, Austria) (CHI EA ’04). Association for Computing Machinery, New York, NY, USA, 1231–1234. https://doi.org/10.1145/985921.986031",
      "doi": "10.1145/985921.986031"
    },
    {
      "text": "Andi Peng, Besmira Nushi, Emre Kıcıman, Kori Inkpen, Siddharth Suri, and Ece Kamar. 2019. What You See Is What You Get? The Impact of Representation Criteria on Human Bias in Hiring. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 7, 1 (Oct. 2019), 125–134. https://ojs.aaai.org/index.php/HCOMP/article/view/5281",
      "doi": ""
    },
    {
      "text": "Manish Raghavan, Solon Barocas, Jon Kleinberg, and Karen Levy. 2020. Mitigating Bias in Algorithmic Hiring: Evaluating Claims and Practices. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 469–481. https://doi.org/10.1145/3351095.3372828",
      "doi": "10.1145/3351095.3372828"
    },
    {
      "text": "Sophia Diana Rozario, Sitalakshmi Venkatraman, and Adil Abbas. 2019. Challenges in recruitment and selection process: An empirical study. Challenges 10, 2 (2019), 35.",
      "doi": ""
    },
    {
      "text": "Javier Sánchez-Monedero, Lina Dencik, and Lilian Edwards. 2020. What Does It Mean to ’solve’ the Problem of Discrimination in Hiring? Social, Technical and Legal Perspectives from the UK on Automated Hiring Systems. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency(Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 458–468. https://doi.org/10.1145/3351095.3372849",
      "doi": "10.1145/3351095.3372849"
    },
    {
      "text": "Celina Sołek-Borowska and Maja Wilczewska. 2018. New technologies in the recruitment process. Economics and Culture 15, 2 (2018), 25–33.",
      "doi": ""
    },
    {
      "text": "Hung-Yue Suen, Mavis Yi-Ching Chen, and Shih-Hao Lu. 2019. Does the use of synchrony and artificial intelligence in video interviews affect interview ratings and applicant attitudes?Computers in Human Behavior 98 (2019), 93–101. https://doi.org/10.1016/j.chb.2019.04.012",
      "doi": "10.1016/j.chb.2019.04.012"
    },
    {
      "text": "Mojtaba Vaismoradi, Hannele Turunen, and Terese Bondas. 2013. Content analysis and thematic analysis: Implications for conducting a qualitative descriptive study. Nursing & Health Sciences 15, 3 (2013), 398–405. https://doi.org/10.1111/nhs.12048",
      "doi": ""
    },
    {
      "text": "Ari Visa, Jarno Einolander, and Hannu Vanharanta. 2015. New tools to help in the recruitment process. Procedia Manufacturing 3(2015), 653–659.",
      "doi": ""
    },
    {
      "text": "Emily Wall, John Stasko, and Alex Endert. 2019. Toward a Design Space for Mitigating Cognitive Bias in Vis. In 2019 IEEE Visualization Conference (VIS). IEEE, 111–115. https://doi.org/10.1109/VISUAL.2019.8933611",
      "doi": ""
    },
    {
      "text": "Sheridan Wall and Hilke Schellmann. 2021. We tested AI interview tools. Here’s what we found. https://www.technologyreview.com/2021/07/07/1027916/we-tested-ai-interview-tools/",
      "doi": ""
    },
    {
      "text": "Zara Whysall. 2018. Cognitive Biases in Recruitment, Selection, and Promotion: The Risk of Subconscious Discrimination. In Hidden Inequalities in the Workplace: A Guide to the Current Challenges, Issues and Business Solutions, Valerie Caven and Stefanos Nachmias (Eds.). Springer International Publishing, Cham, 215–243. https://doi.org/10.1007/978-3-319-59686-0_9",
      "doi": ""
    },
    {
      "text": "Sue Williamson and Meraiah Foley. 2018. Unconscious Bias Training: The ‘Silver Bullet’ for Gender Equity?Australian Journal of Public Administration 77, 3 (2018), 355–359. https://doi.org/10.1111/1467-8500.12313 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/1467-8500.12313",
      "doi": ""
    },
    {
      "text": "Yunfeng Zhang, Rachel K.E. Bellamy, and Wendy A. Kellogg. 2015. Designing Information for Remediating Cognitive Biases in Decision-Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2211–2220. https://doi.org/10.1145/2702123.2702239",
      "doi": "10.1145/2702123.2702239"
    }
  ]
}