{
  "doi": "10.1145/3544548.3581354",
  "title": "Stakeholder-Centered AI Design: Co-Designing Worker Tools with Gig Workers through Data Probes",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "AI technologies continue to advance from digital assistants to assisted decision-making. However, designing AI remains a challenge given its unknown outcomes and uses. One way to expand AI design is by centering stakeholders in the design process. We conduct co-design sessions with gig workers to explore the design of gig worker-centered tools as informed by their driving patterns, decisions, and personal contexts. Using workers’ own data as well as city-level data, we create probes—interactive data visuals—that participants explore to surface the well-being and positionalities that shape their work strategies. We describe participant insights and corresponding AI design considerations surfaced from data probes about: 1) workers’ well-being trade-offs and positionality constraints, 2) factors that impact well-being beyond those in the data probes, and 3) instances of unfair algorithmic management. We discuss the implications for designing data probes and using them to elevate worker-centered AI design as well as for worker advocacy.",
  "authors": [
    {
      "name": "Angie Zhang",
      "institution": "School of Information, University of Texas at Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659846565",
      "orcid": "0000-0002-9850-2783"
    },
    {
      "name": "Alexander Boltz",
      "institution": "School of Information, University of Texas at Austin, United States and Dept. of Human Centered Design and Engineering, University of Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235965",
      "orcid": "0000-0003-2666-1838"
    },
    {
      "name": "Jonathan Lynn",
      "institution": "School of Information, University of Texas at Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781340",
      "orcid": "0000-0002-2682-0424"
    },
    {
      "name": "Chun-Wei Wang",
      "institution": "School of Information, University of Texas at Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240002",
      "orcid": "0000-0001-8898-9084"
    },
    {
      "name": "Min Kyung Lee",
      "institution": "School of Information, University of Texas at Austin, United States",
      "img": "/do/10.1145/contrib-81414592368/rel-imgonly/mklee.png",
      "acmid": "81414592368",
      "orcid": "0000-0002-2696-6546"
    }
  ],
  "references": [
    {
      "text": "2022. Tracking Chicago’s carjackings. CBS News (Apr 2022). https://www.cbsnews.com/chicago/news/carjacking/",
      "doi": ""
    },
    {
      "text": "Ifeoma Ajunwa. 2018. Algorithms at work: productivity monitoring applications and wearable technology as the new data-centric research agenda for employment and labor law. . Louis ULJ 63(2018), 21.",
      "doi": ""
    },
    {
      "text": "Ifeoma Ajunwa, Kate Crawford, and Jason Schultz. 2017. Limitless worker surveillance. Calif. L. Rev. 105(2017), 735.",
      "doi": ""
    },
    {
      "text": "Juan Carlos Alvarez de la Vega, Marta E Cecchinato, and John Rooksby. 2022. Design Opportunities for Freelancing Platforms: Online Freelancers’ Views on a Worker-Centred Design Fiction. In 2022 Symposium on Human-Computer Interaction for Work. 1–19.",
      "doi": ""
    },
    {
      "text": "Monica Anderson, Colleen McClain, Michelle Faverio, and Risa Gelles-Watnick. 2021. The state of gig work in 2021. (2021).",
      "doi": ""
    },
    {
      "text": "Cecilia Aragon, Shion Guha, Marina Kogan, Michael Muller, and Gina Neff. 2022. Human-Centered Data Science: An Introduction. MIT Press.",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Katarzyna Stawarz, Dmitri Katz, Paul Marshall, Taku Yamagata, Raúl Santos-Rodríguez, Peter Flach, and Aisling Ann O’Kane. 2021. Machine Learning Explanations as Boundary Objects: How AI Researchers Explain and Non-Experts Perceive Machine Learning. (2021).",
      "doi": ""
    },
    {
      "text": "Petter Bae Bae Brandtzæg, Marita Skjuve, Kim Kristoffer Kristoffer Dysthe, and Asbjørn Følstad. 2021. When the Social Becomes Non-Human: Young People’s Perception of Social Support in Chatbots. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445318"
    },
    {
      "text": "Oliver Bates, Carolynne Lord, Hayley Alter, Adrian Friday, and Ben Kirman. 2021. Lessons from one future of work: opportunities to flip the gig economy. IEEE Pervasive Computing 20, 4 (2021), 26–34.",
      "doi": "10.1109/MPRV.2021.3113825"
    },
    {
      "text": "Tina Bellon. 2022. Washington governor signs uber, lyft driver pay guarantee into law. https://www.reuters.com/business/autos-transportation/washington-gov-signs-state-wide-uber-lyft-driver-pay-guarantee-into-law-2022-04-01/",
      "doi": ""
    },
    {
      "text": "Sander Bogers, Joep Frens, Janne Van Kollenburg, Eva Deckers, and Caroline Hummels. 2016. Connected baby bottle: A design case study towards a framework for data-enabled design. In Proceedings of the 2016 ACM conference on designing interactive systems. 301–311.",
      "doi": "10.1145/2901790.2901855"
    },
    {
      "text": "Cécile Boulard-Masson, Tommaso Colombino, and Antonietta Grasso. 2018. Analysis of ‘Quantified-Self Technologies’: An Explanation of Failure. In Congress of the International Ergonomics Association. Springer, 579–583.",
      "doi": ""
    },
    {
      "text": "James Brasuell and Brian Minkoff. 2018. Uber and lyft reveal Seattle-area trip data. https://www.planetizen.com/news/2018/11/101400-uber-and-lyft-reveal-seattle-area-trip-data",
      "doi": ""
    },
    {
      "text": "Anna Brown, Alexandra Chouldechova, Emily Putnam-Hornstein, Andrew Tobin, and Rhema Vaithianathan. 2019. Toward algorithmic accountability in public services: A qualitative study of affected community perspectives on algorithmic decision-making in child welfare services. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300271"
    },
    {
      "text": "Dan Calacci and Alex Pentland. 2022. Bargaining with the Black-Box: Designing and Deploying Worker-Centric Tools to Audit Algorithmic Management. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–24.",
      "doi": "10.1145/3570601"
    },
    {
      "text": "Alexia Fernández Campbell. 2018. New York City passes nation’s first minimum pay rate for Uber and Lyft drivers. Vox. December 5(2018), 2018.",
      "doi": ""
    },
    {
      "text": "Ana Caraban, Evangelos Karapanos, Daniel Gonçalves, and Pedro Campos. 2019. 23 ways to nudge: A review of technology-mediated nudging in human-computer interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300733"
    },
    {
      "text": "Long Chen, Piyushimita Vonu Thakuriah, and Konstantinos Ampountolas. 2021. Short-term prediction of demand for ride-hailing services: A deep learning approach. Journal of Big Data Analytics in Transportation 3, 2(2021), 175–195.",
      "doi": ""
    },
    {
      "text": "Janghee Cho, Tian Xu, Abigail Zimmermann-Niefield, and Stephen Voida. 2022. Reflection in Theory and Reflection in Practice: An Exploration of the Gaps in Reflection Support among Personal Informatics Apps. In CHI Conference on Human Factors in Computing Systems. 1–23.",
      "doi": "10.1145/3491102.3501991"
    },
    {
      "text": "Felicia Cordeiro, Daniel A Epstein, Edison Thomaz, Elizabeth Bales, Arvind K Jagannathan, Gregory D Abowd, and James Fogarty. 2015. Barriers and negative nudges: Exploring challenges in food journaling. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1159–1162.",
      "doi": "10.1145/2702123.2702155"
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Jackie Davalos and Drake Bennett. 2022. Gamification in the Gig Economy: Who Really Wins?https://www.bloomberg.com/news/features/2022-05-27/how-uber-and-lyft-gamify-the-gig-economy?leadSource=uverify%20wall",
      "doi": ""
    },
    {
      "text": "Catherine D’ignazio and Lauren F Klein. 2020. Data feminism. MIT press.",
      "doi": ""
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX design innovation: Challenges for working with machine learning as a design material. In Proceedings of the 2017 chi conference on human factors in computing systems. 278–288.",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Michael Dunn. 2020. Making gigs work: digital platforms, job quality and worker motivations. New Technology, Work and Employment 35, 2 (2020), 232–249.",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A Munson. 2016. Beyond abandonment to next steps: understanding and designing for life after personal informatics tool use. In Proceedings of the 2016 CHI conference on human factors in computing systems. 1109–1113.",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Gabe Ets-Hokin. 2022. Mileage tracker review - the best free apps to Track Your Miles [updated for 2022]. https://therideshareguy.com/day-5-what-are-the-best-apps-to-track-your-mileage/",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: cultural probes. interactions 6, 1 (1999), 21–29.",
      "doi": ""
    },
    {
      "text": "Rebecca Gulotta, Aisling Kelliher, and Jodi Forlizzi. 2017. Digital systems and the experience of legacy. In Proceedings of the 2017 Conference on Designing Interactive Systems. 663–674.",
      "doi": "10.1145/3064663.3064731"
    },
    {
      "text": "Eloanni Hickok, Ann Skeet, Christina Colclough, Jonnie Penn, and Richard Zuroff. 2022. Framework for Promoting Workforce Well-being in the AI-Integrated Workplace. (2022).",
      "doi": ""
    },
    {
      "text": "Lars Erik Holmquist. 2017. Intelligence on tap: artificial intelligence as a new design material. interactions 24, 4 (2017), 28–33.",
      "doi": "10.1145/3085571"
    },
    {
      "text": "Kenneth Holstein, Erik Harpstead, Rebecca Gulotta, and Jodi Forlizzi. 2020. Replay enactments: Exploring possible futures through historical data. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 1607–1618.",
      "doi": "10.1145/3357236.3395427"
    },
    {
      "text": "Kenneth Holstein, Bruce M McLaren, and Vincent Aleven. 2019. Co-designing a real-time classroom orchestration tool to support teacher–AI complementarity. Journal of Learning Analytics 6, 2 (2019).",
      "doi": ""
    },
    {
      "text": "Mohammad Hossein Jarrahi, Gemma Newlands, Min Kyung Lee, Christine T Wolf, Eliscia Kinder, and Will Sutherland. 2021. Algorithmic management in a work context. Big Data & Society 8, 2 (2021), 20539517211020332.",
      "doi": ""
    },
    {
      "text": "Darla Benton Kearney. 2022. 4.2: Positionality and Intersectionality. https://ecampusontario.pressbooks.pub/universaldesign/chapter/positionality-intersectionality/#: :text=Positionality%20refers%20to%20the%20personal,dynamics%20of%20power%20and%20privilege.",
      "doi": ""
    },
    {
      "text": "Daniel S Kermany, Michael Goldbaum, Wenjia Cai, Carolina CS Valentim, Huiying Liang, Sally L Baxter, Alex McKeown, Ge Yang, Xiaokang Wu, Fangbing Yan, 2018. Identifying medical diagnoses and treatable diseases by image-based deep learning. Cell 172, 5 (2018), 1122–1131.",
      "doi": ""
    },
    {
      "text": "Vera Khovanskaya, Lynn Dombrowski, Jeffrey Rzeszotarski, and Phoebe Sengers. 2019. The Tools of Management: Adapting Historical Union Tactics to Platform-Mediated Labor. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3359310"
    },
    {
      "text": "John Kildea, John Battista, Briana Cabral, Laurie Hendren, David Herrera, Tarek Hijal, Ackeem Joseph, 2019. Design and development of a person-centered patient portal using participatory stakeholder co-design. Journal of medical Internet research 21, 2 (2019), e11371.",
      "doi": ""
    },
    {
      "text": "Sage Lazzaro. 2016. Uber Drivers Plan Boycott After Fare Cuts Slash Their Earnings to Below Minimum Wage. Observer 19(2016), 2016.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Anson Kahng, Ji Tae Kim, Xinran Yuan, Allissa Chan, Daniel See, Ritesh Noothigattu, Siheon Lee, Alexandros Psomas, 2019. WeBuildAI: Participatory framework for algorithmic governance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–35.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with machines: The impact of algorithmic and data-driven management on human workers. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1603–1612.",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Min Kyung Lee, Ishan Nigam, Angie Zhang, Joel Afriyie, Zhizhen Qin, and Sicun Gao. 2021. Participatory algorithmic management: Elicitation methods for worker well-being models. In Proceedings of the 2021 AAAI/ACM Conference on AI, Ethics, and Society. 715–726.",
      "doi": "10.1145/3461702.3462628"
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, and Yun Huang. 2020. Designing a chatbot as a mediator for promoting deep self-disclosure to a real mental health professional. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–27.",
      "doi": "10.1145/3392836"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI conference on human factors in computing systems. 557–566.",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Phoebe Lin and Jessica Van Brummelen. 2021. Engaging teachers to Co-design integrated AI curriculum for K-12 classrooms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445377"
    },
    {
      "text": "Daria Loi, Christine T Wolf, Jeanette L Blomberg, Raphael Arar, and Margot Brereton. 2019. Co-designing AI futures: Integrating AI ethics, social computing, and design. In Companion publication of the 2019 on designing interactive systems conference 2019 companion. 381–384.",
      "doi": ""
    },
    {
      "text": "Caitlin Lustig, Artie Konrad, and Jed R Brubaker. 2022. Designing for the Bittersweet: Improving Sensitive Experiences with Recommender Systems. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": ""
    },
    {
      "text": "Kim Lyons. 2020. Uber and lyft roll out new benefits for California drivers under Prop 22. https://www.theverge.com/2020/12/14/22174600/uber-lyft-new-benefits-california-drivers-prop-22-gig-economy",
      "doi": ""
    },
    {
      "text": "Frank Manzo and Robert Bruno. 2021.. https://illinoisepi.files.wordpress.com/2021/01/ilepi-pmcr-on-demand-workers-sub-minimum-wages-final.pdf",
      "doi": ""
    },
    {
      "text": "Aarian Marshall. 2020. Seattle’s Uber and lyft drivers make $23.25 an hour-or $9.73. https://www.wired.com/story/seattles-uber-lyft-drivers-make-2325-hour-973/",
      "doi": ""
    },
    {
      "text": "Marieke Möhlmann and Lior Zalmanson. 2017. Hands on the wheel: Navigating algorithmic management and Uber drivers’. In Autonomy’, in proceedings of the international conference on information systems (ICIS), Seoul South Korea. 10–13.",
      "doi": ""
    },
    {
      "text": "Jimmy Moore, Pascal Goffin, Jason Wiese, and Miriah Meyer. 2021. Exploring the Personal Informatics Analysis Gap:“There’s a Lot of Bacon”. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 96–106.",
      "doi": "10.1109/TVCG.2021.3114798"
    },
    {
      "text": "DZ Morris. 2017. New York City Says Uber Must Share Ride Data. Fortune.",
      "doi": ""
    },
    {
      "text": "Sean Munson. 2012. Mindfulness, reflection, and persuasion in personal informatics. (2012).",
      "doi": ""
    },
    {
      "text": "Kun Niu, Cheng Cheng, Jielin Chang, Huiyang Zhang, and Tong Zhou. 2018. Real-time taxi-passenger prediction with L-CNN. IEEE Transactions on Vehicular Technology 68, 5 (2018), 4122–4129.",
      "doi": ""
    },
    {
      "text": "Lesley-Ann Noel and Marcelo Paiva. 2021. Learning to recognize exclusion. Journal of Usability Studies 16, 2 (2021), 63–72.",
      "doi": "10.5555/3532753.3532754"
    },
    {
      "text": "City of Chicago. 2022. Violence and victimization trends. https://www.chicago.gov/city/en/sites/vrd/home/violence-victimization.html",
      "doi": ""
    },
    {
      "text": "Fatih Kursat Ozenc, Miso Kim, John Zimmerman, Stephen Oney, and Brad Myers. 2010. How to support designers in getting hold of the immaterial material of software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2513–2522.",
      "doi": "10.1145/1753326.1753707"
    },
    {
      "text": "Menghai Pan, Yanhua Li, Xun Zhou, Zhenming Liu, Rui Song, Hui Lu, and Jun Luo. 2019. Dissecting the learning curve of taxi drivers: A data-driven approach. In Proceedings of the 2019 SIAM International Conference on Data Mining. SIAM, 783–791.",
      "doi": ""
    },
    {
      "text": "Hyanghee Park, Daehwan Ahn, Kartik Hosanagar, and Joonhwan Lee. 2022. Designing Fair AI in Human Resource Management: Understanding Tensions Surrounding Algorithmic Evaluation and Envisioning Stakeholder-Centered Solutions. In CHI Conference on Human Factors in Computing Systems. 1–22.",
      "doi": ""
    },
    {
      "text": "James A Parrott and Michael Reich. 2018. An earnings standard for new york city’s app-based drivers. New York: The New School: Center for New York City Affairs (2018).",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 2014. Qualitative research & evaluation methods: Integrating theory and practice. Sage publications.",
      "doi": ""
    },
    {
      "text": "Kyrill Potapov and Paul Marshall. 2020. LifeMosaic: Co-design of a personal informatics tool for youth. In Proceedings of the interaction design and children conference. 519–531.",
      "doi": ""
    },
    {
      "text": "David Roeder. 2022. Contractor status keeps Rideshare Drivers’ pay below minimum wage, report says. https://chicago.suntimes.com/2022/3/14/22973357/contractor-employee-rideshare-drivers-transportation-lyft-uber-pay",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI conference on human factors in computing systems. 1163–1172.",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Alex Rosenblat and Luke Stark. 2016. Algorithmic labor and information asymmetries: A case study of Uber’s drivers. International journal of communication 10 (2016), 27.",
      "doi": ""
    },
    {
      "text": "Carolyn Said. 2019. Uber Must Share Data with San Francisco, Appeals Court Rules. San Francisco Chronicle(2019).",
      "doi": ""
    },
    {
      "text": "Rachel Sandler. 2020. Microsoft’s New ‘Productivity Score’ Lets Your Boss Monitor How Often You Use Email and Attend Video Meetings.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2022. Human-Centered AI. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Faiz Siddiqui. 2019. Uber and Lyft drivers strike for pay transparency—after algorithms made it harder to understand. Washington Post (2019).",
      "doi": ""
    },
    {
      "text": "Aaron Smith. 2016. Gig work, online selling and home sharing. (2016).",
      "doi": ""
    },
    {
      "text": "Logan Stapleton, Min Hun Lee, Diana Qing, Marya Wright, Alexandra Chouldechova, Ken Holstein, Zhiwei Steven Wu, and Haiyi Zhu. 2022. Imagining new futures beyond predictive systems in child welfare: A qualitative study with impacted stakeholders. In 2022 ACM Conference on Fairness, Accountability, and Transparency. 1162–1177.",
      "doi": "10.1145/3531146.3533177"
    },
    {
      "text": "Hariharan Subramonyam, Colleen Seifert, and Eytan Adar. 2021. Towards a process model for co-creating AI experiences. In Designing Interactive Systems Conference 2021. 1529–1543.",
      "doi": ""
    },
    {
      "text": "Krishnan Vasudevan and Ngai Keung Chan. 2022. Gamification and work games: Examining consent and resistance among Uber drivers. new media & society 24, 4 (2022), 866–886.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C Wright, and Patrick Olivier. 2013. Making design probes work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3441–3450.",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Greg Walsh and Jennifer Golbeck. 2014. StepCity: a preliminary investigation of a personal informatics-based social game on behavior change. In CHI’14 Extended Abstracts on Human Factors in Computing Systems. 2371–2376.",
      "doi": ""
    },
    {
      "text": "Christine T Wolf, Haiyi Zhu, Julia Bullard, Min Kyung Lee, and Jed R Brubaker. 2018. The changing contours of\" participation\" in data-driven, algorithmic ecosystems: Challenges, tactics, and an agenda. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. 377–384.",
      "doi": "10.1145/3272973.3273005"
    },
    {
      "text": "Wei Xu. 2019. Toward human-centered AI: a perspective from human-computer interaction. interactions 26, 4 (2019), 42–46.",
      "doi": ""
    },
    {
      "text": "Chiwei Yan, Helin Zhu, Nikita Korolko, and Dawn Woodard. 2020. Dynamic pricing and matching in ride-hailing platforms. Naval Research Logistics (NRL) 67, 8 (2020), 705–724.",
      "doi": ""
    },
    {
      "text": "Qian Yang. 2018. Machine learning as a UX design material: how can we imagine beyond automation, recommenders, and reminders?. In AAAI Spring Symposia.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Justin Cranshaw, Saleema Amershi, Shamsi T Iqbal, and Jaime Teevan. 2019. Sketching nlp: A case study of exploring the right things to design with language intelligence. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300415"
    },
    {
      "text": "Qian Yang, Alex Scuito, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld. 2018. Investigating how experienced UX designers effectively work with machine learning. In Proceedings of the 2018 designing interactive systems conference. 585–596.",
      "doi": "10.1145/3196709.3196730"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-examining whether, why, and how human-AI interaction is uniquely difficult to design. In Proceedings of the 2020 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Smirity Kaushik, and Yang Wang. 2019. Defending my castle: A co-design study of privacy mechanisms for smart homes. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300428"
    },
    {
      "text": "Nur Yildirim, Alex Kass, Teresa Tung, Connor Upton, Donnacha Costello, Robert Giusti, Sinem Lacin, Sara Lovic, James M O’Neill, Rudi O’Reilly Meehan, 2022. How Experienced Designers of Enterprise Applications Engage AI as a Design Material. In CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3491102.3517491"
    },
    {
      "text": "Chuang-Wen You, Chien Wen Yuan, Nanyi Bi, Min-Wei Hung, Po-Chun Huang, and Hao-Chuan Wang. 2021. Go Gig or Go Home: Enabling Social Sensing to Share Personal Data with Intimate Partner for the Health and Wellbeing of Long-Hour workers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445278"
    },
    {
      "text": "Angie Zhang, Alexander Boltz, Chun Wei Wang, and Min Kyung Lee. 2022. Algorithmic management reimagined for workers and by workers: Centering worker well-being in gig work. In CHI Conference on Human Factors in Computing Systems. 1–20.",
      "doi": "10.1145/3491102.3501866"
    },
    {
      "text": "Angie Zhang, Olympia Walker, Kaci Nguyen, Jiajun Dai, Anqing Chen, and Min Kyung Lee. 2023. Deliberating with AI: Improving Decision-Making for the Future through Participatory AI Design and Stakeholder Deliberation. Proceedings of the ACM on Human-Computer Interaction 7, CSCW1(2023), 1–33.",
      "doi": "10.1145/3579601"
    },
    {
      "text": "Haiyi Zhu, Bowen Yu, Aaron Halfaker, and Loren Terveen. 2018. Value-sensitive algorithm design: Method, case study, and lessons. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–23.",
      "doi": "10.1145/3274463"
    }
  ]
}