{
  "doi": "10.1145/3544548.3581093",
  "title": "Through Their Eyes and In Their Shoes: Providing Group Awareness During Collaboration Across Virtual Reality and Desktop Platforms",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Many collaborative data analysis situations benefit from collaborators utilizing different platforms. However, maintaining group awareness between team members using diverging devices is difficult, not least because common ground diminishes. A person using head-mounted VR cannot physically see a user on a desktop computer even while co-located, and the desktop user cannot easily relate to the VR user’s 3D workspace. To address this, we propose the “eyes-and-shoes” principles for group awareness and abstract them into four levels of techniques. Furthermore, we evaluate these principles with a qualitative user study of 6 participant pairs synchronously collaborating across distributed desktop and VR head-mounted devices. In this study, we vary the group awareness techniques between participants and explore two visualization contexts within participants. The results of this study indicate that the more visual metaphors and views of participants diverge, the greater the level of group awareness is needed. A copy of this paper, the study preregistration, and all supplemental materials required to reproduce the study are available on OSF (link).",
  "tags": [
    "virtual reality",
    "immersive analytics",
    "Asymmetric collaboration",
    "ubiquitous analytics."
  ],
  "authors": [
    {
      "name": "David Saffo",
      "institution": "Khoury College of Computer Sciences, Northeastern University, United States and GT Applied Research, JPMorgan Chase Bank, N.A., USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526566",
      "orcid": "0000-0001-9515-048X"
    },
    {
      "name": "Andrea Batch",
      "institution": "College of Information Studies, University of Maryland, College Park, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528248",
      "orcid": "0000-0002-7450-9542"
    },
    {
      "name": "Cody Dunne",
      "institution": "Northeastern University, United States",
      "img": "/do/10.1145/contrib-81384605317/rel-imgonly/cody_dunne_2016_ccis_photo_shoot_small.jpg",
      "acmid": "81384605317",
      "orcid": "0000-0002-1609-9776"
    },
    {
      "name": "Niklas Elmqvist",
      "institution": "College of Information Studies, University of Maryland, College Park, United States",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    }
  ],
  "references": [
    {
      "text": "Sriram Karthik Badam and Niklas Elmqvist. 2014. PolyChrome: A Cross-Device Framework for Collaborative Web Visualization. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (Dresden, Germany) (ITS ’14). Association for Computing Machinery, New York, NY, USA, 109–118. https://doi.org/10.1145/2669485.2669518",
      "doi": "10.1145/2669485.2669518"
    },
    {
      "text": "Sriram Karthik Badam, Andreas Mathisen, Roman Rädle, Clemens N. Klokmose, and Niklas Elmqvist. 2019. Vistrates: A Component Model for Ubiquitous Analytics. IEEE Transactions on Visualization and Computer Graphics 25, 1(2019), 586–596. https://doi.org/10.1109/TVCG.2018.2865144",
      "doi": "10.1109/TVCG.2018.2865144"
    },
    {
      "text": "Ronald M. Baecker. 1993. Readings in Groupware and Computer-Supported Cooperative Work. Morgan Kaufmann Publishers, San Francisco.",
      "doi": ""
    },
    {
      "text": "Andrea Batch, Andrew Cunningham, Maxime Cordeil, Niklas Elmqvist, Tim Dwyer, Bruce H. Thomas, and Kim Marriott. 2020. There Is No Spoon: Evaluating Performance, Space Use, and Presence with Expert Domain Users in Immersive Analytics. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 536–546. https://doi.org/10.1109/TVCG.2019.2934803",
      "doi": ""
    },
    {
      "text": "Szymon Bobek, Sławomir K. Tadeja, Łukasz Struski, Przemysław Stachura, Timoleon Kipouros, Jacek Tabor, Grzegorz J. Nalepa, and Per Ola Kristensson. 2022. Virtual Reality-Based Parallel Coordinates Plots Enhanced with Explainable AI and Data-Science Analytics for Decision-Making Processes. Applied Sciences 12, 1 (2022), 13 pages. https://doi.org/10.3390/app12010331",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12(2011), 2301–2309. https://doi.org/10.1109/TVCG.2011.185",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Matthew Brehmer and Tamara Munzner. 2013. A Multi-Level Typology of Abstract Visualization Tasks. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2376–2385. https://doi.org/10.1109/TVCG.2013.124",
      "doi": "10.1109/TVCG.2013.124"
    },
    {
      "text": "Simon Butscher, Sebastian Hubenschmid, Jens Müller, Johannes Fuchs, and Harald Reiterer. 2018. Clusters, Trends, and Outliers: How Immersive Technologies Can Facilitate the Collaborative Analysis of Multidimensional Data. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173664",
      "doi": "10.1145/3173574.3173664"
    },
    {
      "text": "Herbert H. Clark and Susan E. Brennan. 1991. Grounding in Communication. In Perspectives on Socially Shared Cognition, L. B. Resnick, J. M. Levine, and S. D. Teasley (Eds.). American Psychological Association, Washington, DC, USA, 127–149. https://doi.org/10.1037/10096-006",
      "doi": ""
    },
    {
      "text": "Maxime Cordeil, Andrew Cunningham, Tim Dwyer, Bruce H. Thomas, and Kim Marriott. 2017. ImAxes: Immersive Axes as Embodied Affordances for Interactive Multivariate Data Visualisation. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 71–83. https://doi.org/10.1145/3126594.3126613",
      "doi": "10.1145/3126594.3126613"
    },
    {
      "text": "Maxime Cordeil, Tim Dwyer, Karsten Klein, Bireswar Laha, Kim Marriott, and Bruce H. Thomas. 2017. Immersive Collaborative Analysis of Network Connectivity: CAVE-style or Head-Mounted Display?IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 441–450. https://doi.org/10.1109/TVCG.2016.2599107",
      "doi": "10.1109/TVCG.2016.2599107"
    },
    {
      "text": "Ciro Donalek, S. G. Djorgovski, Alex Cioc, Anwell Wang, Jerry Zhang, Elizabeth Lawler, Stacy Yeh, Ashish Mahabal, Matthew Graham, Andrew Drake, Scott Davidoff, Jeffrey S. Norris, and Giuseppe Longo. 2014. Immersive and collaborative data visualization using virtual reality platforms. In Proceedings of the IEEE International Conference on Big Data. IEEE, Los Alamitos, CA, USA, 609–614. https://doi.org/10.1109/BigData.2014.7004282",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Benjamin Bach, Maxime Cordeil, Ulrich Engelke, Marcos Serrano, Wesley Willett, Arnaud Prouzeau, Christoph Anthes, Wolfgang Büschel, Cody Dunne, Tim Dwyer, Jens Grubert, Jason H. Haga, Nurit Kirshenbaum, Dylan Kobayashi, Tica Lin, Monsurat Olaosebikan, Fabian Pointecker, David Saffo, Nazmus Saquib, Dieter Schmalstieg, Danielle Albers Szafir, Matt Whitlock, and Yalong Yang. 2021. Grand Challenges in Immersive Analytics. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 459:1–459:17. https://doi.org/10.1145/3411764.3446866",
      "doi": "10.1145/3411764.3446866"
    },
    {
      "text": "James D. Foley, Andries van Dam, Steven Feiner, and John Hughes. 1990. Computer Graphics: Principles and Practice(second ed.). Addison-Wesley, Reading, MA, USA.",
      "doi": "10.5555/83821"
    },
    {
      "text": "Bernhard Fröhler, Christoph Anthes, Fabian Pointecker, Judith Friedl, Daniel Schwajda, Andreas Riegler, Shailesh Tripathi, Clemens Holzmann, Manuel Brunner, Herbert Jodlbauer, Hans-Christian Jetter, and Christoph Heinzl. 2022. A Survey on Cross-Virtuality Analytics. Computer Graphics Forum 41, 1 (2022), 465–494. https://doi.org/10.1111/cgf.14447",
      "doi": ""
    },
    {
      "text": "Danilo Gasques, Janet G. Johnson, Tommy Sharkey, Yuanyuan Feng, Ru Wang, Zhuoqun Robin Xu, Enrique Zavala, Yifei Zhang, Wanze Xie, Xinming Zhang, Konrad Davis, Michael Yip, and Nadir Weibel. 2021. ARTEMIS: A Collaborative Mixed-Reality System for Immersive Surgical Telementoring. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 662:1–662:14. https://doi.org/10.1145/3411764.3445576",
      "doi": "10.1145/3411764.3445576"
    },
    {
      "text": "Sohaib Ghani and Niklas Elmqvist. 2011. Improving Revisitation in Graphs through Static Spatial Features. In Proceedings of Graphics Interface. Canadian Human-Computer Communications Society, Waterloo, ON, Canada, 175–182.",
      "doi": ""
    },
    {
      "text": "Adam M. Grant and James W. Berry. 2011. The Necessity of Others is The Mother of Invention: Intrinsic and Prosocial Motivations, Perspective Taking, and Creativity. Academy of Management Journal 54, 1 (2011), 73–96. https://doi.org/10.5465/amj.2011.59215085 arXiv:https://doi.org/10.5465/amj.2011.59215085",
      "doi": ""
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 1998. Design for Individuals, Design for Groups: Tradeoffs between Power and Workspace Awareness. In Proceedings of the ACM Conference on Computer-Supported Collaborative Work. ACM, New York, NY, USA, 207–216. https://doi.org/10.1145/289444.289495",
      "doi": "10.1145/289444.289495"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 1998. Effects of Awareness Support on Groupware Usability. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 511–518. https://doi.org/10.1145/274644.274713",
      "doi": "10.1145/274644.274713"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Computer Supported Cooperative Work 11, 3-4 (2002), 411–446. https://doi.org/10.1023/A:1021271517844",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Carl Gutwin, Saul Greenberg, and Mark Roseman. 1996. Workspace Awareness in Real-Time Distributed Groupware: Framework, Widgets, and Evaluation. In Proceedings of the British HCI Conference. Springer, London, UK, 281–298. https://doi.org/10.1007/978-1-4471-3588-3_18",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Mark Roseman, and Saul Greenberg. 1996. A Usability Study of Awareness Widgets in a Shared Workspace Groupware System. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work. ACM, New York, NY, USA, 258–267. https://doi.org/10.1145/240080.240298",
      "doi": "10.1145/240080.240298"
    },
    {
      "text": "Jeffrey Heer and Maneesh Agrawala. 2008. Design considerations for collaborative visual analytics. Information Visualization 7, 1 (2008), 49–62. https://doi.org/10.1057/palgrave.ivs.9500167",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer, Fernanda Viégas, and Martin Wattenberg. 2007. Voyagers and Voyeurs: Supporting Asynchronous Collaborative Information Visualization. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1029–1038. https://doi.org/10.1145/1435417.1435439",
      "doi": "10.1145/1435417.1435439"
    },
    {
      "text": "William C. Hill and James D. Hollan. 1991. Deixis and the Future of Visualization Excellence. In Proceedings of the IEEE Visualization Conference. IEEE, Los Alamitos, CA, USA, 314–320. https://doi.org/10.1109/VISUAL.1991.175820",
      "doi": ""
    },
    {
      "text": "Tom Horak, Sriram Karthik Badam, Niklas Elmqvist, and Raimund Dachselt. 2018. When David Meets Goliath: Combining Smartwatches with a Large Vertical Display for Visual Data Exploration. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173593",
      "doi": "10.1145/3173574.3173593"
    },
    {
      "text": "Sebastian Hubenschmid, Jonathan Wieland, Daniel Immanuel Fink, Andrea Batch, Johannes Zagermann, Niklas Elmqvist, and Harald Reiterer. 2022. ReLive: Bridging In-Situ and Ex-Situ Visual Analytics for Analyzing Mixed Reality User Studies. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 24:1–24:20. https://doi.org/10.1145/3491102.3517550",
      "doi": "10.1145/3491102.3517550"
    },
    {
      "text": "Sebastian Hubenschmid, Johannes Zagermann, Simon Butscher, and Harald Reiterer. 2021. STREAM: Exploring the Combination of Spatially-Aware Tablets with Augmented Reality Head-Mounted Displays for Immersive Analytics. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 469:1–469:14. https://doi.org/10.1145/3411764.3445298",
      "doi": "10.1145/3411764.3445298"
    },
    {
      "text": "Petra Isenberg, Niklas Elmqvist, Jean Scholtz, Daniel Cernea, Kwan-Liu Ma, and Hans Hagen. 2011. Collaborative visualization: definition, challenges, and research agenda. Information Visualization 10, 4 (2011), 310–326. https://doi.org/10.1177/1473871611412817",
      "doi": "10.1177/1473871611412817"
    },
    {
      "text": "Janet G. Johnson, Danilo Gasques, Tommy Sharkey, Evan Schmitz, and Nadir Weibel. 2021. Do You Really Need to Know Where \"That\" Is? Enhancing Support for Referencing in Collaborative Mixed Reality Environments. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 514:1–514:14. https://doi.org/10.1145/3411764.3445246",
      "doi": "10.1145/3411764.3445246"
    },
    {
      "text": "KyungTae Kim, Waqas Javed, Cary Williams, Niklas Elmqvist, and Pourang Irani. 2010. Hugin: A Framework for Awareness and Coordination in Mixed-Presence Collaborative Information Visualization. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, New York, NY, USA, 231–240. https://doi.org/10.1145/1936652.1936694",
      "doi": "10.1145/1936652.1936694"
    },
    {
      "text": "Matthias Kraus, Johannes Fuchs, Björn Sommer, Karsten Klein, Ulrich Engelke, Daniel Keim, and Falk Schreiber. 2022. Immersive Analytics with Abstract 3D Visualizations: A Survey. Computer Graphics Forum 41, 1 (2022), 201–229. https://doi.org/10.1111/cgf.14430",
      "doi": ""
    },
    {
      "text": "László Laufer, Péter Halácsy, and Adam Somlai-Fischer. 2011. Prezi meeting: collaboration in a zoomable canvas based environment. In Extended Abstracts of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 749–752. https://doi.org/10.1145/1979742.1979673",
      "doi": "10.1145/1979742.1979673"
    },
    {
      "text": "Gun A. Lee, Theophilus Teo, Seungwon Kim, and Mark Billinghurst. 2018. A User Study on MR Remote Collaboration Using Live 360 Video. In Proceedings of the IEEE International Symposium on Mixed and Augmented Reality. IEEE, Los Alamitos, CA, USA, 153–164. https://doi.org/10.1109/ISMAR.2018.00051",
      "doi": ""
    },
    {
      "text": "Alexandre Maes, Xavier Martinez, Karen Druart, Benoist Laurent, Sean Guégan, Christophe H. Marchand, Stéphane D. Lemaire, and Marc Baaden. 2018. MinOmics, an Integrative and Immersive Tool for Multi-Omics Analysis. Journal of Integrative Bioinformatics 15, 2 (2018), 20180006. https://doi.org/10.1515/jib-2018-0006",
      "doi": ""
    },
    {
      "text": "Kim Marriott, Jian Chen, Marcel Hlawatsch, Takayuki Itoh, Miguel A. Nacenta, Guido Reina, and Wolfgang Stuerzlinger. 2018. Immersive Analytics: Time to Reconsider the Value of 3D for Information Visualisation. In Immersive Analytics. Lecture Notes in Computer Science, Vol. 11190. Springer, Cham, Germany, 25–55. https://doi.org/10.1007/978-3-030-01388-2_2",
      "doi": ""
    },
    {
      "text": "Kim Marriott, Falk Schreiber, Tim Dwyer, Karsten Klein, Nathalie Henry Riche, Takayuki Itoh, Wolfgang Stuerzlinger, and Bruce H. Thomas (Eds.). 2018. Immersive Analytics. Lecture Notes in Computer Science, Vol. 11190. Springer International Publishing, New York, NY, USA. https://doi.org/10.1007/978-3-030-01388-2",
      "doi": ""
    },
    {
      "text": "Will McGrath, Brian Bowman, David C. McCallum, Juan David Hincapié-Ramos, Niklas Elmqvist, and Pourang Irani. 2012. Branch-explore-merge: facilitating real-time revision control in collaborative visual exploration. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, New York, NY, USA, 235–244. https://doi.org/10.1145/2396636.2396673",
      "doi": "10.1145/2396636.2396673"
    },
    {
      "text": "Paul Milgram, Haruo Takemura, Akira Utsumi, and Fumio Kishino. 1995. Augmented reality: a class of displays on the reality-virtuality continuum. In Telemanipulator and Telepresence Technologies, Vol. 2351. SPIE, Bellingham, WA, USA, 282–292. https://doi.org/10.1117/12.197321",
      "doi": ""
    },
    {
      "text": "Jens Müller, Johannes Zagermann, Jonathan Wieland, Ulrike Pfeil, and Harald Reiterer. 2019. A Qualitative Comparison Between Augmented and Virtual Reality Collaboration with Handheld Devices. In Proceedings of Mensch und Computer. ACM, New York, NY, USA, 399–410. https://doi.org/10.1145/3340764.3340773",
      "doi": "10.1145/3340764.3340773"
    },
    {
      "text": "Nico Reski, Aris Alissandrakis, and Andreas Kerren. 2022. An Empirical Evaluation of Asymmetric Synchronous Collaboration Combining Immersive and Non-Immersive Interfaces Within the Context of Immersive Analytics. Frontiers in Virtual Reality 2, Article 743445(2022), 29 pages. https://doi.org/10.3389/frvir.2021.743445",
      "doi": ""
    },
    {
      "text": "Andreas Riegler, Christoph Anthes, Hans-Christian Jetter, Christoph Heinzl, Clemens Holzmann, Herbert Jodlbauer, Manuel Brunner, Stefan Auer, Judith Friedl, Bernhard Fröhler, Christina Leitner, Fabian Pointecker, Daniel Schwajda, and Shailesh Tripathi. 2020. Cross-Virtuality Visualization, Interaction and Collaboration. In Proceedings of the International Workshop on Cross-Reality Interaction. CEUR Workshop Proceedings, Aachen, Germany, Article 1, 4 pages. http://ceur-ws.org/Vol-2779/paper1.pdf",
      "doi": ""
    },
    {
      "text": "David Saffo, Sara Di Bartolomeo, Caglar Yildirim, and Cody Dunne. 2021. Remote and Collaborative Virtual Reality Experiments via Social VR Platforms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 523, 15 pages. https://doi.org/10.1145/3411764.3445426",
      "doi": "10.1145/3411764.3445426"
    },
    {
      "text": "Hinako Sassa, Maxime Cordeil, Mitsuo Yoshida, and Takayuki Itoh. 2021. Visual Linking of Feature Values in Immersive Graph Visualization Environment. In Proceedings of the 14th International Symposium on Visual Information Communication and Interaction (Potsdam, Germany) (VINCI ’21). Association for Computing Machinery, New York, NY, USA, Article 13, 6 pages. https://doi.org/10.1145/3481549.3481555",
      "doi": "10.1145/3481549.3481555"
    },
    {
      "text": "Ralph Schroeder, Anthony Steed, Ann-Sofie Axelsson, Ilona Heldal, Åsa Abelin, Josef Wideström, Alexander Nilsson, and Mel Slater. 2001. Collaborating in networked immersive spaces: as good as being there together?Computer Graphics 25, 5 (2001), 781–788. https://doi.org/10.1016/S0097-8493(01)00120-0",
      "doi": ""
    },
    {
      "text": "Michail Schwab, David Saffo, Yixuan Zhang, Shash Sinha, Cristina Nita-Rotaru, James Tompkin, Cody Dunne, and Michelle A. Borkin. 2021. VisConnect: Distributed Event Synchronization for Collaborative Visualization. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 347–357. https://doi.org/10.1109/TVCG.2020.3030366",
      "doi": ""
    },
    {
      "text": "Mickael Sereno, Xiyao Wang, Lonni Besançon, Michael J. McGuffin, and Tobias Isenberg. 2022. Collaborative Work in Augmented Reality: A Survey. IEEE Transactions on Visualization and Computer Graphics 28, 6(2022), 2530–2549. https://doi.org/10.1109/TVCG.2020.3032761",
      "doi": "10.1109/TVCG.2020.3032761"
    },
    {
      "text": "Aaron Stafford, Wayne Piekarski, and Bruce H. Thomas. 2006. Implementation of god-like interaction techniques for supporting collaboration between outdoor AR and indoor tabletop users. In Proceedings of the IEEE/ACM International Symposium on Mixed and Augmented Reality. ACM, New York, NY, USA, 165–172. https://doi.org/10.1109/ISMAR.2006.297809",
      "doi": "10.1109/ISMAR.2006.297809"
    },
    {
      "text": "Slawomir Konrad Tadeja, Timoleon Kipouros, and Per Ola Kristensson. 2019. Exploring Parallel Coordinates Plots in Virtual Reality. In Extended Abstracts of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313068",
      "doi": "10.1145/3290607.3313068"
    },
    {
      "text": "Slawomir K. Tadeja, Timoleon Kipouros, and Per Ola Kristensson. 2020. IPCP: Immersive Parallel Coordinates Plots for Engineering Design Processes. In AIAA Scitech Forum. American Institute of Aeronautics and Astronautics, Reston, VA, USA, 20 pages. https://doi.org/10.2514/6.2020-0324",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Michael Boyle, and Saul Greenberg. 2005. Understanding and Mitigating Display and Presence Disparity in Mixed Presence Groupware. Journal of Research and Practice in Information Technology 37, 2(2005), 71–88.",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Carmen Neustaedter, and Saul Greenberg. 2006. VideoArms: embodiments for mixed presence groupware. In Proceedings of the British HCI Conference, Vol. 20. Springer, London, UK, 85–102. https://doi.org/10.1007/978-1-84628-664-3_8",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative coupling over tabletop displays. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1181–1190. https://doi.org/10.1145/1124772.1124950",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "James J. Thomas and Kristin A. Cook (Eds.). 2005. Illuminating the Path: The Research and Development Agenda for Visual Analytics. IEEE Computer Society, Los Alamitos, CA, USA.",
      "doi": ""
    },
    {
      "text": "Wai Tong, Meng Xia, Kam Kwai Wong, Doug A. Bowman, Ting-Chuen Pong, Huamin Qu, and Yalong Yang. 2023. Towards an Understanding of Distributed Asymmetric Collaborative Visualization on Problem-solving. In 2023 IEEE Conference on Virtual Reality and 3D User Interfaces (VR).",
      "doi": ""
    },
    {
      "text": "Philip Tuddenham and Peter Robinson. 2007. Distributed Tabletops: Supporting Remote and Mixed-Presence Tabletop Collaboration. In Proceedings of IEEE Tabletop. IEEE, Los Alamitos, CA, USA, 19–26. https://doi.org/10.1109/TABLETOP.2007.15",
      "doi": ""
    },
    {
      "text": "Philip Tuddenham and Peter Robinson. 2009. Territorial coordination and workspace awareness in remote tabletop collaboration. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2139–2148. https://doi.org/10.1145/1518701.1519026",
      "doi": "10.1145/1518701.1519026"
    },
    {
      "text": "Xiyao Wang, Lonni Besançon, David Rousseau, Mickaël Sereno, Mehdi Ammi, and Tobias Isenberg. 2020. Towards an Understanding of Augmented Reality Extensions for Existing 3D Data Analysis Tools. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376657",
      "doi": "10.1145/3313831.3376657"
    },
    {
      "text": "Matt Whitlock, Stephen Smart, and Danielle Albers Szafir. 2020. Graphical Perception for Immersive Analytics. In Proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces. IEEE, Los Alamitos, CA, USA, 616–625. https://doi.org/10.1109/VR46266.2020.00084",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium (W3C). 2022. WebXR Device API (working draft). https://www.w3.org/TR/webxr/.",
      "doi": ""
    },
    {
      "text": "Ji Soo Yi, Youn ah Kang, John Stasko, and Julie A. Jacko. 2007. Toward a Deeper Understanding of the Role of Interaction in Information Visualization. IEEE Transactions on Visualization and Computer Graphics 13, 6(2007), 1224–1231. https://doi.org/10.1109/TVCG.2007.70515",
      "doi": "10.1109/TVCG.2007.70515"
    }
  ]
}