{
  "doi": "10.1145/3544548.3581046",
  "title": "Train as you Fight: Evaluating Authentic Cybersecurity Training in Cyber Ranges",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Humans can play a decisive role in detecting and mitigating cyber attacks if they possess sufficient cybersecurity skills and knowledge. Realizing this potential requires effective cybersecurity training. Cyber range exercises (CRXs) represent a novel form of cybersecurity training in which trainees can experience realistic cyber attacks in authentic environments. Although evaluation is undeniably essential for any learning environment, it has been widely neglected in CRX research. Addressing this issue, we propose a taxonomy-based framework to facilitate a comprehensive and structured evaluation of CRXs. To demonstrate the applicability and potential of the framework, we instantiate it to evaluate Iceberg CRX, a training we recently developed to improve cybersecurity education at our university. For this matter, we conducted a user study with 50 students to identify both strengths and weaknesses of the CRX.",
  "tags": [
    "cybersecurity exercise",
    "cyber range",
    "cyber defense exercise",
    "evaluation method"
  ],
  "authors": [
    {
      "name": "Magdalena Glas",
      "institution": "Chair of Information Systems, University of Regensburg, Germany",
      "img": "/do/10.1145/contrib-99660074859/rel-imgonly/5t2a4769c.jpg",
      "acmid": "99660074859",
      "orcid": "0000-0003-0239-7526"
    },
    {
      "name": "Manfred Vielberth",
      "institution": "Chair of Information Systems, University of Regensburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659559184",
      "orcid": "0000-0002-1119-4715"
    },
    {
      "name": "Guenther Pernul",
      "institution": "Chair of Information Systems, Universität Regensburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593537",
      "orcid": "0000-0003-1338-9003"
    }
  ],
  "references": [
    {
      "text": "Jonas Almroth and Tommy Gustafsson. 2020. CRATE Exercise Control – A cyber defense exercise management and support tool. In 2020 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). 37–45. https://doi.org/10.1109/EuroSPW51379.2020.00014",
      "doi": ""
    },
    {
      "text": "Mauro Andreolini, Vincenzo Giuseppe Colacino, Michele Colajanni, and Mirco Marchetti. 2020. A Framework for the Evaluation of Trainee Performance in Cyber Range Exercises. Mobile Networks and Applications 25, 1 (2020), 236–247. https://doi.org/10.1007/s11036-019-01442-0",
      "doi": "10.1007/s11036-019-01442-0"
    },
    {
      "text": "Markos Antonopoulos, Giorgos Drainakis, Eletherios Ouzounoglou, Giorgos Papavassiliou, and Angelos Amditis. 2022. Design and proof of concept of a prediction engine for decision support during cyber range attack simulations in the maritime domain. In 2022 IEEE International Conference on Cyber Security and Resilience (CSR). 305–310. https://doi.org/10.1109/CSR54599.2022.9850280",
      "doi": ""
    },
    {
      "text": "Sobia Arshad, Masoom Alam, Saif Al-Kuwari, and Muhammad Haider Ali Khan. 2021. Attack Specification Language: Domain Specific Language for Dynamic Training in Cyber Range. In 2021 IEEE Global Engineering Education Conference (EDUCON). 873–879. https://doi.org/10.1109/EDUCON46332.2021.9454094",
      "doi": ""
    },
    {
      "text": "Victor R Basili. 1994. Goal question metric paradigm. Encyclopedia of software engineering(1994), 528–532.",
      "doi": ""
    },
    {
      "text": "Giorgio Bernardinetti, Stefano Iafrate, and Giuseppe Bianchi. 2021. Nautilus: A Tool For Automated Deployment And Sharing Of Cyber Range Scenarios. In The 16th International Conference on Availability, Reliability and Security (Vienna, Austria) (ARES 2021). Association for Computing Machinery, New York, NY, USA, Article 146, 7 pages. https://doi.org/10.1145/3465481.3469182",
      "doi": "10.1145/3465481.3469182"
    },
    {
      "text": "Razvan Beuran, Takuya Inoue, Yasuo Tan, and Yoichi Shinoda. 2019. Realistic Cybersecurity Training via Scenario Progression Management. In 2019 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). 67–76. https://doi.org/10.1109/EuroSPW.2019.00014",
      "doi": ""
    },
    {
      "text": "Razvan Beuran, Dat Tang, Cuong Pham, Ken ichi Chinen, Yasuo Tan, and Yoichi Shinoda. 2018. Integrated framework for hands-on cybersecurity training: CyTrONE. Computers & Security 78(2018), 43–59. https://doi.org/10.1016/j.cose.2018.06.001",
      "doi": ""
    },
    {
      "text": "Razvan Beuran, Zhe Zhang, and Yasuo Tan. 2022. AWS EC2 Public Cloud Cyber Range Deployment. In 2022 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). 433–441. https://doi.org/10.1109/EuroSPW55150.2022.00051",
      "doi": ""
    },
    {
      "text": "Chiara Braghin, Stelvio Cimato, Ernesto Damiani, Fulvio Frati, Elvinia Riccobene, and Sadegh Astaneh. 2020. Towards the Monitoring and Evaluation of Trainees’ Activities in Cyber Ranges. In Model-driven Simulation and Training Environments for Cybersecurity, George Hatzivasilis and Sotiris Ioannidis (Eds.). Springer International Publishing, Cham, 79–91.",
      "doi": ""
    },
    {
      "text": "Norbou Buchler, Prashanth Rajivan, Laura R. Marusich, Lewis Lightner, and Cleotilde Gonzalez. 2018. Sociometrics and observational assessment of teaming and leadership in a cyber security defense competition. Computers & Security 73(2018), 114–136. https://doi.org/10.1016/j.cose.2017.10.013",
      "doi": ""
    },
    {
      "text": "Francesco Caturano, Nicola d’Ambrosio, Gaetano Perrone, Luigi Previdente, and Simon Pietro Romano. 2022. ExploitWP2Docker: a Platform for Automating the Generation of Vulnerable WordPress Environments for Cyber Ranges. In 2022 International Conference on Electrical, Computer and Energy Technologies (ICECET). 1–7. https://doi.org/10.1109/ICECET55527.2022.9872859",
      "doi": ""
    },
    {
      "text": "Francesco Caturano, Gaetano Perrone, and Simon Pietro Romano. 2020. Capturing flags in a dynamically deployed microservices-based heterogeneous environment. In 2020 Principles, Systems and Applications of IP Telecommunications (IPTComm). 1–7. https://doi.org/10.1109/IPTComm50535.2020.9261519",
      "doi": ""
    },
    {
      "text": "Tianying Chen, Jessica Hammer, and Laura Dabbish. 2019. Self-Efficacy-Based Game Design to Encourage Security Behavior Online. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312935",
      "doi": "10.1145/3290607.3312935"
    },
    {
      "text": "Nabin Chowdhury and Vasileios Gkioulos. 2021. Cyber security training for critical infrastructure protection: A literature review. Computer Science Review 40 (2021), 100361. https://doi.org/10.1016/j.cosrev.2021.100361",
      "doi": "10.1016/j.cosrev.2021.100361"
    },
    {
      "text": "Nabin Chowdhury, Sokratis Katsikas, and Vasileios Gkioulos. 2022. Modeling effective cybersecurity training frameworks: A delphi method-based study. Computers & Security 113 (2022), 102551. https://doi.org/10.1016/j.cose.2021.102551",
      "doi": "10.1016/j.cose.2021.102551"
    },
    {
      "text": "Paul Cichonski, Tom Millar, Tim Grance, and Karen Scarfone. 2012. Computer security incident handling guide. Technical Report 61. 1–147pages.",
      "doi": ""
    },
    {
      "text": "Lizzie Coles-Kemp, Rikke Bjerg Jensen, and Claude P. R. Heath. 2020. Too Much Information: Questioning Security in a Post-Digital Society. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376214",
      "doi": "10.1145/3313831.3376214"
    },
    {
      "text": "Michael Collins, Alefiya Hussain, and Stephen Schwab. 2022. Towards an Operations-Aware Experimentation Methodology. In 2022 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). 384–393. https://doi.org/10.1109/EuroSPW55150.2022.00046",
      "doi": ""
    },
    {
      "text": "Melissa Dark and Jelena Mirkovic. 2015. Evaluation Theory and Practice Applied to Cybersecurity Education. IEEE Security & Privacy 13, 2 (2015), 75–80. https://doi.org/10.1109/MSP.2015.27",
      "doi": "10.1109/MSP.2015.27"
    },
    {
      "text": "Thibault Debatty and Wim Mees. 2019. Building a Cyber Range for training CyberDefense Situation Awareness. In 2019 International Conference on Military Communications and Information Systems (ICMCIS). 1–6. https://doi.org/10.1109/ICMCIS.2019.8842802",
      "doi": ""
    },
    {
      "text": "Gary M. Deckard. 2018. Cybertropolis: breaking the paradigm of cyber-ranges and testbeds. In 2018 IEEE International Symposium on Technologies for Homeland Security (HST). 1–4. https://doi.org/10.1109/THS.2018.8574134",
      "doi": ""
    },
    {
      "text": "R. F. . DeVellis. 1992. Scale development: Theory and applications. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Anastasia Efklides. 2011. Interactions of metacognition with motivation and affect in self-regulated learning: The MASRL model. Educational psychologist 46, 1 (2011), 6–25.",
      "doi": ""
    },
    {
      "text": "Demitrius Fenton, Terry Traylor, Guy Hokanson, and Jeremy Straub. 2019. Integrating Cyber Range Technologies and Certification Programs to Improve Cybersecurity Training Programs. In The Challenges of the Digital Transformation in Education, Michael E. Auer and Thrasyvoulos Tsiatsos (Eds.). Springer International Publishing, Cham, 632–643.",
      "doi": ""
    },
    {
      "text": "Massimo Ficco and Francesco Palmieri. 2019. Leaf: An open-source cybersecurity training platform for realistic edge-IoT scenarios. Journal of Systems Architecture 97 (2019), 107–129. https://doi.org/10.1016/j.sysarc.2019.04.004",
      "doi": "10.1016/j.sysarc.2019.04.004"
    },
    {
      "text": "Dorota Filipczuk, Charles Mason, and Stephen Snow. 2019. Using a Game to Explore Notions of Responsibility for Cyber Security in Organisations. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312846",
      "doi": "10.1145/3290607.3312846"
    },
    {
      "text": "Sabrina Friedl, Magdalena Glas, Ludwig Englbrecht, Fabian Böhm, and Günther Pernul. 2022. ForCyRange: An Educational IoT Cyber Range for Live Digital Forensics. In Information Security Education - Adapting to the Fourth Industrial Revolution, Lynette Drevin, Natalia Miloslavskaya, Wai Sze Leung, and Suné von Solms (Eds.). Springer International Publishing, Cham, 77–91.",
      "doi": ""
    },
    {
      "text": "Magdalena Glas, Manfred Vielberth, Tobias Reittinger, Fabian Böhm, and Günther Pernul. 2022. Visual Programming in Cyber Range Training to Improve Skill Development. In Human Aspects of Information Security and Assurance, Nathan Clarke and Steven Furnell (Eds.). Springer International Publishing, Cham, 3–13.",
      "doi": ""
    },
    {
      "text": "Magdalena Granåsen and Dennis Andersson. 2016. Measuring team effectiveness in cyber-defense exercises: a cross-disciplinary case study. Cognition, Technology & Work 18, 1 (2016), 121–143.",
      "doi": "10.1007/s10111-015-0350-2"
    },
    {
      "text": "Tommy Gustafsson and Jonas Almroth. 2021. Cyber Range Automation Overview with a Case Study of CRATE. In Secure IT Systems, Mikael Asplund and Simin Nadjm-Tehrani (Eds.). Springer International Publishing, Cham, 192–209.",
      "doi": ""
    },
    {
      "text": "George Hatzivasilis, Sotiris Ioannidis, Michail Smyrlis, George Spanoudakis, Fulvio Frati, Chiara Braghin, Ernesto Damiani, Hristo Koshutanski, George Tsakirakis, Torsten Hildebrandt, Ludger Goeke, Sebastian Pape, Oleg Blinder, Michael Vinov, George Leftheriotis, Martin Kunc, Fotis Oikonomou, Giovanni Magilo, Vito Petrarolo, Antonio Chieti, and Robert Bordianu. 2021. The THREAT-ARREST Cyber Range Platform. In 2021 IEEE International Conference on Cyber Security and Resilience (CSR). 422–427. https://doi.org/10.1109/CSR51186.2021.9527963",
      "doi": ""
    },
    {
      "text": "Olivier Jacq, Pablo Giménez Salazar, Kamban Parasuraman, Jarkko Kuusijärvi, Andriana Gkaniatsou, Evangelia Latsa, and Angelos Amditis. 2021. The Cyber-MAR Project: First Results and Perspectives on the Use of Hybrid Cyber Ranges for Port Cyber Risk Assessment. In 2021 IEEE International Conference on Cyber Security and Resilience (CSR). 409–414. https://doi.org/10.1109/CSR51186.2021.9527968",
      "doi": ""
    },
    {
      "text": "Mika Karjalainen and Tero Kokkonen. 2020. Comprehensive Cyber Arena; The Next Generation Cyber Range. In 2020 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). 11–16. https://doi.org/10.1109/EuroSPW51379.2020.00011",
      "doi": ""
    },
    {
      "text": "Georgios Kavallieratos, Sokratis K Katsikas, and Vasileios Gkioulos. 2019. Towards a cyber-physical range. In Proceedings of the 5th on Cyber-Physical System Security Workshop. 25–34.",
      "doi": "10.1145/3327961.3329532"
    },
    {
      "text": "John M Keller. 1987. Development and use of the ARCS model of instructional design. Journal of instructional development 10, 3 (1987), 2–10.",
      "doi": ""
    },
    {
      "text": "Donald L. Kirkpatrick. 1967. Training and Development Handbook. American Society for Training and Development, New York: McGraw-Hill Book Company, Chapter Evaluation of Training.",
      "doi": ""
    },
    {
      "text": "Stela Kucek and Maria Leitner. 2020. Training the Human-in-the-Loop in Industrial Cyber Ranges. In Digital Transformation in Semiconductor Manufacturing, Sophia Keil, Rainer Lasch, Fabian Lindner, and Jacob Lohmer (Eds.). Springer International Publishing, Cham, 107–118.",
      "doi": ""
    },
    {
      "text": "Dennis Kundisch, Jan Muntermann, Anna Maria Oberländer, Daniel Rau, Maximilian Röglinger, Thorsten Schoormann, and Daniel Szopinski. 2021. An Update for Taxonomy Designers. Business & Information Systems Engineering(2021), 1–19.",
      "doi": ""
    },
    {
      "text": "Claire La Fleur, Blaine Hoffman, C. Benjamin Gibson, and Norbou Buchler. 2021. Team performance in a series of regional and national US cybersecurity defense competitions: Generalizable effects of training and functional role specialization. Computers & Security 104 (2021), 102229. https://doi.org/10.1016/j.cose.2021.102229",
      "doi": "10.1016/j.cose.2021.102229"
    },
    {
      "text": "Xabier Larrucea and Alberto Molinuevo. 2020. An ICS Based Scenario Generator for Cyber Ranges. In Systems, Software and Services Process Improvement, Murat Yilmaz, Jörg Niemann, Paul Clarke, and Richard Messnarz (Eds.). Springer International Publishing, Cham, 543–554.",
      "doi": ""
    },
    {
      "text": "Maria Leitner, Maximilian Frank, Wolfgang Hotwagner, Gregor Langner, Oliver Maurhart, Timea Pahi, Lenhard Reuter, Florian Skopik, Paul Smith, and Manuel Warum. 2020. AIT Cyber Range: Flexible Cyber Security Environment for Exercises, Training and Research. In Proceedings of the European Interdisciplinary Cybersecurity Conference (Rennes, France) (EICC 2020). Association for Computing Machinery, New York, NY, USA, Article 2, 6 pages. https://doi.org/10.1145/3424954.3424959",
      "doi": "10.1145/3424954.3424959"
    },
    {
      "text": "Stephen Lineberry. 2007. The human element: The weakest link in information security. Journal of Accountancy 204, 5 (2007), 44.",
      "doi": ""
    },
    {
      "text": "Kaie Maennel, Rain Ottis, and Olaf Maennel. 2017. Improving and Measuring Learning Effectiveness at Cyber Defense Exercises. In Secure IT Systems, Helger Lipmaa, Aikaterini Mitrokotsa, and Raimundas Matulevičius (Eds.). Springer International Publishing, Cham, 123–138.",
      "doi": ""
    },
    {
      "text": "Rasmi-Vlad Mahmoud, Egon Kidmose, Ahmet Turkmen, Olga Pilawka, and Jens Myrup Pedersen. 2021. DefAtt - Architecture of Virtual Cyber Labs for Research and Education. In 2021 International Conference on Cyber Situational Awareness, Data Analytics and Assessment (CyberSA). 1–7. https://doi.org/10.1109/CyberSA52016.2021.9478236",
      "doi": ""
    },
    {
      "text": "Notis Mengidis, Maya Bozhilova, Cyril Ceresola, Consuelo Colabuono, Michael Cooke, Gregory Depaix, Angel Genchev, Georgi Koykov, Wim Mees, Matteo Merialdo, Antonis Voulgaridis, Theodora Tsikrika, Konstantinos Votis, and Stefanos Vrochidis. 2022. Leveraging Cyber Ranges for Prototyping, Certification and Training: The ECHO case. In 2022 IEEE International Conference on Cyber Security and Resilience (CSR). 299–304. https://doi.org/10.1109/CSR54599.2022.9850278",
      "doi": ""
    },
    {
      "text": "Ryotaro Nakata and Akira Otsuka. 2021. CyExec*: A High-Performance Container-Based Cyber Range With Scenario Randomization. IEEE Access 9(2021), 109095–109114. https://doi.org/10.1109/ACCESS.2021.3101245",
      "doi": ""
    },
    {
      "text": "National Initiative for Cybersecurity Education (NICE). 2020. The Cyber Range: A Guide. Technical Report.",
      "doi": ""
    },
    {
      "text": "Nikos Oikonomou, Notis Mengidis, Minas Spanopoulos-Karalexidis, Antonis Voulgaridis, Matteo Merialdo, Ivo Raisr, Kaarel Hanson, Paloma de La Vallee, Theodora Tsikrika, Stefanos Vrochidis, and Konstantinos Votis. 2021. ECHO Federated Cyber Range: Towards Next-Generation Scalable Cyber Ranges. In 2021 IEEE International Conference on Cyber Security and Resilience (CSR). 403–408. https://doi.org/10.1109/CSR51186.2021.9527985",
      "doi": ""
    },
    {
      "text": "Vittorio Orbinato. 2021. A next-generation platform for Cyber Range-as-a-Service. In 2021 IEEE International Symposium on Software Reliability Engineering Workshops (ISSREW). 314–318. https://doi.org/10.1109/ISSREW53611.2021.00094",
      "doi": ""
    },
    {
      "text": "Radek Ošlejšek, Jan Vykopal, Karolína Burská, and Vít Rusňák. 2018. Evaluation of Cyber Defense Exercises Using Visual Analytics Process. In 2018 IEEE Frontiers in Education Conference (FIE). 1–9. https://doi.org/10.1109/FIE.2018.8659299",
      "doi": "10.1109/FIE.2018.8659299"
    },
    {
      "text": "Victor-Valeriu Patriciu and Adrian Constantin Furtuna. 2009. Guide for designing cyber security exercises. In Proceedings of the 8th WSEAS International Conference on E-Activities and information security and privacy. World Scientific and Engineering Academy and Society (WSEAS), 172–177.",
      "doi": "10.5555/1736186.1736216"
    },
    {
      "text": "Adamantini Peratikou, Constantinos Louca, Stavros Shiaeles, and Stavros Stavrou. 2021. On Federated Cyber Range Network Interconnection. In Selected Papers from the 12th International Networking Conference, Bogdan Ghitaand Stavros Shiaeles (Eds.). Springer International Publishing, Cham, 117–128.",
      "doi": ""
    },
    {
      "text": "Cuong Pham, Dat Tang, Ken-ichi Chinen, and Razvan Beuran. 2016. CyRIS: A Cyber Range Instantiation System for Facilitating Security Training. In Proceedings of the Seventh Symposium on Information and Communication Technology (Ho Chi Minh City, Vietnam) (SoICT ’16). Association for Computing Machinery, New York, NY, USA, 251–258. https://doi.org/10.1145/3011077.3011087",
      "doi": "10.1145/3011077.3011087"
    },
    {
      "text": "Mauno Pihelgas and Markus Kont. 2021. Frankenstack: Real-time Cyberattack Detection and Feedback System for Technical Cyber Exercises. In 2021 IEEE International Conference on Cyber Security and Resilience (CSR). 396–402. https://doi.org/10.1109/CSR51186.2021.9527923",
      "doi": ""
    },
    {
      "text": "Georgios Potamos, Adamantini Peratikou, and Stavros Stavrou. 2021. Towards a Maritime Cyber Range training environment. In 2021 IEEE International Conference on Cyber Security and Resilience (CSR). 180–185. https://doi.org/10.1109/CSR51186.2021.9527904",
      "doi": ""
    },
    {
      "text": "Maxime Puys, Pierre-Henri Thevenon, and Stéphane Mocanu. 2021. Hardware-In-The-Loop Labs for SCADA Cybersecurity Awareness and Training. In The 16th International Conference on Availability, Reliability and Security (Vienna, Austria) (ARES 2021). Association for Computing Machinery, New York, NY, USA, Article 147, 10 pages. https://doi.org/10.1145/3465481.3469185",
      "doi": "10.1145/3465481.3469185"
    },
    {
      "text": "Basili V. R.1994. Goal Question Metric Paradigm. Encyclopedia of Software Engineering(1994), 528–532.",
      "doi": ""
    },
    {
      "text": "Martina A. Rau, Vincent Aleven, Nikol Rummel, and Stacie Rohrbach. 2013. Why Interactive Learning Environments Can Have It All: Resolving Design Conflicts between Competing Goals. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 109–118. https://doi.org/10.1145/2470654.2470670",
      "doi": "10.1145/2470654.2470670"
    },
    {
      "text": "Elaine M. Raybourn, Michael Kunz, David Fritz, and Vince Urias. 2018. A Zero-Entry Cyber Range Environment for Future Learning Ecosystems. Springer International Publishing, Cham, 93–109. https://doi.org/10.1007/978-3-319-98935-8_5",
      "doi": ""
    },
    {
      "text": "Filippo Rebecchi, Antonio Pastor, Alberto Mozo, Chiara Lombardo, Roberto Bruschi, Ilias Aliferis, Roberto Doriguzzi-Corin, Panagiotis Gouvas, Antonio Alvarez Romero, Anna Angelogianni, Ilias Politis, and Christos Xenakis. 2022. A Digital Twin for the 5G Era: the SPIDER Cyber Range. In 2022 IEEE 23rd International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM). 567–572. https://doi.org/10.1109/WoWMoM54355.2022.00088",
      "doi": ""
    },
    {
      "text": "Lena Reinfelder, Robert Landwirth, and Zinaida Benenson. 2019. Security Managers Are Not The Enemy Either. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3290605.3300663",
      "doi": "10.1145/3290605.3300663"
    },
    {
      "text": "Andrew Roberts, Olaf Maennel, and Nikita Snetkov. 2021. Cybersecurity Test Range for Autonomous Vehicle Shuttles. In 2021 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). 239–248. https://doi.org/10.1109/EuroSPW54576.2021.00031",
      "doi": ""
    },
    {
      "text": "Enrico Russo, Gabriele Costa, and Alessandro Armando. 2020. Building next generation Cyber Ranges with CRACK. Computers & Security 95(2020), 101837. https://doi.org/10.1016/j.cose.2020.101837",
      "doi": ""
    },
    {
      "text": "Martina Angela Sasse, Sacha Brostoff, and Dirk Weirich. 2001. Transforming the ‘weakest link’—a human/computer interaction approach to usable and effective security. BT technology journal 19, 3 (2001), 122–131.",
      "doi": ""
    },
    {
      "text": "Ahmad Zia Sharifi, Vajirasak Vanijja, Debajyoti Pal, and Watcharee Anantasabkit. 2021. CyberIoT: An Initial Conceptualization of a Web-based Cyber Range for IoT. In 2021 International Conference on Computational Performance Evaluation (ComPE). 091–096. https://doi.org/10.1109/ComPE53109.2021.9752401",
      "doi": ""
    },
    {
      "text": "Siddhant Shrivastava, Francisco Furtado, Mark Goh, and Aditya Mathur. 2022. The Design of Cyber-Physical Exercises (CPXS). In 2022 14th International Conference on Cyber Conflict: Keep Moving! (CyCon), Vol. 700. 348–366. https://doi.org/10.23919/CyCon55549.2022.9811000",
      "doi": ""
    },
    {
      "text": "Michail Smyrlis, Konstantinos Fysarakis, George Spanoudakis, and George Hatzivasilis. 2020. Cyber Range Training Programme Specification Through Cyber Threat and Training Preparation Models. In Model-driven Simulation and Training Environments for Cybersecurity, George Hatzivasilisand Sotiris Ioannidis (Eds.). Springer International Publishing, Cham, 22–37.",
      "doi": ""
    },
    {
      "text": "Iason Somarakis, Michail Smyrlis, Konstantinos Fysarakis, and George Spanoudakis. 2020. Model-Driven Cyber Range Training: A Cyber Security Assurance Perspective. In Computer Security, Apostolos P. Fournaris, Manos Athanatos, Konstantinos Lampropoulos, Sotiris Ioannidis, George Hatzivasilis, Ernesto Damiani, Habtamu Abie, Silvio Ranise, Luca Verderame, Alberto Siena, and Joaquin Garcia-Alfaro (Eds.). Springer International Publishing, Cham, 172–184.",
      "doi": ""
    },
    {
      "text": "Dat Tang, Cuong Pham, Ken-ichi Chinen, and Razvan Beuran. 2017. Interactive cybersecurity defense training inspired by web-based learning theory. In 2017 IEEE 9th International Conference on Engineering Education (ICEED). 90–95. https://doi.org/10.1109/ICEED.2017.8251171",
      "doi": ""
    },
    {
      "text": "Zhihong Tian, Yu Cui, Lun An, Shen Su, Xiaoxia Yin, Lihua Yin, and Xiang Cui. 2018. A Real-Time Correlation of Host-Level Events in Cyber Range Service for Smart Campus. IEEE Access 6(2018), 35355–35364. https://doi.org/10.1109/ACCESS.2018.2846590",
      "doi": ""
    },
    {
      "text": "Elochukwu Ukwandu, Mohamed Amine Ben Farah, Hanan Hindy, David Brosset, Dimitris Kavallieros, Robert Atkinson, Christos Tachtatzis, Miroslav Bures, Ivan Andonovic, and Xavier Bellekens. 2020. A review of cyber-ranges and test-beds: Current and future trends. Sensors 20, 24 (2020), 7148.",
      "doi": ""
    },
    {
      "text": "Stanislav Vakaruk, Alberto Mozo, Antonio Pastor, and Diego R. López. 2021. A Digital Twin Network for Security Training in 5G Industrial Environments. In 2021 IEEE 1st International Conference on Digital Twins and Parallel Intelligence (DTPI). 395–398. https://doi.org/10.1109/DTPI52967.2021.9540146",
      "doi": ""
    },
    {
      "text": "Komal Bhupendra Vekaria, Prasad Calyam, Songjie Wang, Ramya Payyavula, Matthew Rockey, and Nafis Ahmed. 2021. Cyber Range for Research-Inspired Learning of “Attack Defense by Pretense” Principle and Practice. IEEE Transactions on Learning Technologies 14, 3 (2021), 322–337. https://doi.org/10.1109/TLT.2021.3091904",
      "doi": ""
    },
    {
      "text": "Manfred Vielberth, Fabian Böhm, Ines Fichtinger, and Günther Pernul. 2020. Security Operations Center: A Systematic Study and Open Challenges. IEEE Access 8(2020), 227756–227779. https://doi.org/10.1109/ACCESS.2020.3045514",
      "doi": ""
    },
    {
      "text": "Manfred Vielberth, Magdalena Glas, Marietheres Dietz, Stylianos Karagiannis, Emmanouil Magkos, and Günther Pernul. 2021. A Digital Twin-Based Cyber Range for SOC Analysts. In Data and Applications Security and Privacy XXXV, Ken Barker and Kambiz Ghazinour (Eds.). Springer International Publishing, Cham, 293–311.",
      "doi": ""
    },
    {
      "text": "Valdemar Švábenský, Jan Vykopal, Milan Cermak, and Martin Laštovička. 2018. Enhancing Cybersecurity Skills by Creating Serious Games. In Proceedings of the 23rd Annual ACM Conference on Innovation and Technology in Computer Science Education(Larnaca, Cyprus) (ITiCSE 2018). Association for Computing Machinery, New York, NY, USA, 194–199. https://doi.org/10.1145/3197091.3197123",
      "doi": "10.1145/3197091.3197123"
    },
    {
      "text": "Valdemar Švábenský, Richard Weiss, Jack Cook, Jan Vykopal, Pavel Čeleda, Jens Mache, Radoslav Chudovský, and Ankur Chattopadhyay. 2022. Evaluating Two Approaches to Assessing Student Progress in Cybersecurity Exercises. In Proceedings of the 53rd ACM Technical Symposium on Computer Science Education V. 1 (Providence, RI, USA) (SIGCSE 2022). Association for Computing Machinery, New York, NY, USA, 787–793. https://doi.org/10.1145/3478431.3499414",
      "doi": "10.1145/3478431.3499414"
    },
    {
      "text": "Jan Vykopal, Martin Vizvary, Radek Oslejsek, Pavel Celeda, and Daniel Tovarnak. 2017. Lessons learned from complex hands-on defence exercises in a cyber range. In 2017 IEEE Frontiers in Education Conference (FIE). 1–8. https://doi.org/10.1109/FIE.2017.8190713",
      "doi": "10.1109/FIE.2017.8190713"
    },
    {
      "text": "Jan Vykopal, Pavel Čeleda, Pavel Seda, Valdemar Švábenský, and Daniel Tovarňák. 2021. Scalable Learning Environments for Teaching Cybersecurity Hands-on. In 2021 IEEE Frontiers in Education Conference (FIE). 1–9. https://doi.org/10.1109/FIE49875.2021.9637180",
      "doi": "10.1109/FIE49875.2021.9637180"
    },
    {
      "text": "Muhammad Mudassar Yamin and Basel Katt. 2022. Modeling and executing cyber security exercise scenarios in cyber ranges. Computers & Security 116 (2022), 102635. https://doi.org/10.1016/j.cose.2022.102635",
      "doi": "10.1016/j.cose.2022.102635"
    },
    {
      "text": "Muhammad Mudassar Yamin and Basel Katt. 2022. Use of cyber attack and defense agents in cyber ranges: A case study. Computers & Security 122 (2022), 102892. https://doi.org/10.1016/j.cose.2022.102892",
      "doi": "10.1016/j.cose.2022.102892"
    },
    {
      "text": "Muhammad Mudassar Yamin, Basel Katt, and Vasileios Gkioulos. 2020. Cyber ranges and security testbeds: Scenarios, functions, tools and architecture. Computers & Security 88(2020), 101636.",
      "doi": "10.1016/j.cose.2019.101636"
    },
    {
      "text": "Muhammad Mudassar Yamin, Basel Katt, and Mariusz Nowostawski. 2021. Serious games as a tool to model attack and defense scenarios for cyber-security exercises. Computers & Security 110 (2021), 102450. https://doi.org/10.1016/j.cose.2021.102450",
      "doi": "10.1016/j.cose.2021.102450"
    },
    {
      "text": "Keiichi Yonemura, Hideyuki Kobayashi, Jun Sato, Hisashi Taketani, Shinya Oyama, Satoru Yamada, Satoru Izumi, Hiroyuki Okamoto, Youichi Fujimoto, Yoshinori Sakamoto, Kentaro Noguchi, and Seiichi Kishimoto. 2021. Cybersecurity Teaching Expert Development Project by KOSEN Security Educational Community. In 2021 IEEE Global Engineering Education Conference (EDUCON). 468–477. https://doi.org/10.1109/EDUCON46332.2021.9453958",
      "doi": ""
    },
    {
      "text": "Keiichi Yonemura, Shinya Oyama, Hideyuki Kobayashi, Satoru Yamada, Keiichi Shiraishi, Satoru Izumi, Tatsuki Fukuda, Hiroyuki Okamoto, Manabu Hirano, Youichi Fujimoto, Hideaki Moriyama, Yoshinori Sakamoto, Jun Sato, Kentaro Noguchi, Hisashi Taketani, and Seiichi Kishimoto. 2022. Teaching Expert Development Project by KOSEN Security Educational Community. In 2022 IEEE Global Engineering Education Conference (EDUCON). 1643–1651. https://doi.org/10.1109/EDUCON52537.2022.9766560",
      "doi": ""
    },
    {
      "text": "Alessandro Zanasi, Daniele Cristofori, and Graziano Giorgi. 2021. The European Commission contribution to cybersecurity through the ECHO project. In 2021 14th CMI International Conference - Critical ICT Infrastructures and Platforms (CMI). 1–8. https://doi.org/10.1109/CMI53512.2021.9663786",
      "doi": ""
    },
    {
      "text": "Verena Zimmermann and Karen Renaud. 2019. Moving from a ‘human-as-problem” to a ‘human-as-solution” cybersecurity mindset. International Journal of Human-Computer Studies 131 (2019), 169–187.",
      "doi": "10.1016/j.ijhcs.2019.05.005"
    }
  ]
}