{
  "doi": "10.1145/3544548.3581099",
  "title": "Understanding and Supporting Debugging Workflows in Multiverse Analysis",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Multiverse analysis—a paradigm for statistical analysis that considers all combinations of reasonable analysis choices in parallel—promises to improve transparency and reproducibility. Although recent tools help analysts specify multiverse analyses, they remain difficult to use in practice. In this work, we identify debugging as a key barrier due to the latency from running analyses to detecting bugs and the scale of metadata processing needed to diagnose a bug. To address these challenges, we prototype a command-line interface tool, Multiverse Debugger, which helps diagnose bugs in the multiverse and propagate fixes. In a qualitative lab study (n=13), we use Multiverse Debugger as a probe to develop a model of debugging workflows and identify specific challenges, including difficulty in understanding the multiverse’s composition. We conclude with design implications for future multiverse analysis authoring systems.",
  "tags": [
    "Multiverse analysis",
    "analysis authoring",
    "debugging",
    "statistical analysis",
    "workflows"
  ],
  "authors": [
    {
      "name": "Ken Gu",
      "institution": "Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779890",
      "orcid": "0000-0002-4343-1578"
    },
    {
      "name": "Eunice Jun",
      "institution": "Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131304",
      "orcid": "0000-0002-4050-4284"
    },
    {
      "name": "Tim Althoff",
      "institution": "Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/do/10.1145/contrib-81549260356/rel-imgonly/tim_headshot_infolab_2016_zoom_250.jpg",
      "acmid": "81549260356",
      "orcid": "0000-0003-4793-2289"
    }
  ],
  "references": [
    {
      "text": "2006. Approximation Algorithms. In Combinatorial Optimization: Theory and Algorithms. Springer, Berlin, Heidelberg, 377–413. https://doi.org/10.1007/3-540-29297-7_16",
      "doi": ""
    },
    {
      "text": "2022. difflib — Helpers for computing deltas — Python 3.10.7 documentation. https://docs.python.org/3/library/difflib.html",
      "doi": ""
    },
    {
      "text": "2022. Introduction — statsmodels. https://www.statsmodels.org/",
      "doi": ""
    },
    {
      "text": "2022. pandas - Python Data Analysis Library. https://pandas.pydata.org/",
      "doi": ""
    },
    {
      "text": "2022. SPSS Software. https://www.ibm.com/analytics/spss-statistics-software",
      "doi": ""
    },
    {
      "text": "2022. Stack Overflow - Where Developers Learn, Share, and Build Careers. https://stackoverflow.com/",
      "doi": ""
    },
    {
      "text": "2022. Statistical software for data science | Stata. https://www.stata.com/",
      "doi": ""
    },
    {
      "text": "Abdulaziz Alaboudi and Thomas D. LaToza. 2021. An Exploratory Study of Debugging Episodes. http://arxiv.org/abs/2105.02162 arXiv:2105.02162 [cs].",
      "doi": ""
    },
    {
      "text": "Monya Baker. 2016. 1,500 scientists lift the lid on reproducibility. Nature 533, 7604 (May 2016), 452–454. https://doi.org/10.1038/533452a Number: 7604 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Moritz Beller, Niels Spruit, Diomidis Spinellis, and Andy Zaidman. 2018. On the dichotomy of debugging behavior among programmers. In Proceedings of the 40th International Conference on Software Engineering. ACM, Gothenburg Sweden, 572–583. https://doi.org/10.1145/3180155.3180175",
      "doi": "10.1145/3180155.3180175"
    },
    {
      "text": "Chris van den Berg. 2020. String Grouper. https://github.com/Bergvca/string_grouper",
      "doi": ""
    },
    {
      "text": "Robert V. Binder. 1999. Testing Object-Oriented Systems: Models, Patterns, and Tools. Addison-Wesley Longman Publishing Co., Inc., USA.",
      "doi": "10.5555/338330"
    },
    {
      "text": "Paul Alexander Bloom. 2022. Into the Multiverse: Methods for Studying Developmental Neuroscience. Ph.D. Columbia University, United States – New York. https://www.proquest.com/docview/2656195811/abstract/673E811D3C8B4B71PQ/1ISBN: 9798426817869.",
      "doi": ""
    },
    {
      "text": "Zack Bobbitt. 2022. Python Guides. https://www.statology.org/python-guides/",
      "doi": ""
    },
    {
      "text": "Zack Bobbitt. 2022. R Guides. https://www.statology.org/r-guides/",
      "doi": ""
    },
    {
      "text": "Richard Border, Emma C. Johnson, Luke M. Evans, Andrew Smolen, Noah Berley, Patrick F. Sullivan, and Matthew C. Keller. 2019. No Support for Historical Candidate Gene or Candidate Gene-by-Interaction Hypotheses for Major Depression Across Multiple Large Samples. American Journal of Psychiatry 176, 5 (May 2019), 376–387. https://doi.org/10.1176/appi.ajp.2018.18070881",
      "doi": ""
    },
    {
      "text": "Nate Breznau, Eike Mark Rinke, Alexander Wuttke, Hung H. V. Nguyen, Muna Adem, Jule Adriaans, Amalia Alvarez-Benjumea, Henrik K. Andersen, Daniel Auer, Flavio Azevedo, Oke Bahnsen, Dave Balzer, Gerrit Bauer, Paul C. Bauer, Markus Baumann, Sharon Baute, Verena Benoit, Julian Bernauer, Carl Berning, Anna Berthold, Felix S. Bethke, Thomas Biegert, Katharina Blinzler, Johannes N. Blumenberg, Licia Bobzien, Andrea Bohman, Thijs Bol, Amie Bostic, Zuzanna Brzozowska, Katharina Burgdorf, Kaspar Burger, Kathrin B. Busch, Juan Carlos-Castillo, Nathan Chan, Pablo Christmann, Roxanne Connelly, Christian S. Czymara, Elena Damian, Alejandro Ecker, Achim Edelmann, Maureen A. Eger, Simon Ellerbrock, Anna Forke, Andrea Forster, Chris Gaasendam, Konstantin Gavras, Vernon Gayle, Theresa Gessler, Timo Gnambs, Amélie Godefroidt, Max Grömping, Martin Groß, Stefan Gruber, Tobias Gummer, Andreas Hadjar, Jan Paul Heisig, Sebastian Hellmeier, Stefanie Heyne, Magdalena Hirsch, Mikael Hjerm, Oshrat Hochman, Andreas Hövermann, Sophia Hunger, Christian Hunkler, Nora Huth, Zsófia S. Ignácz, Laura Jacobs, Jannes Jacobsen, Bastian Jaeger, Sebastian Jungkunz, Nils Jungmann, Mathias Kauff, Manuel Kleinert, Julia Klinger, Jan-Philipp Kolb, Marta Kołczyńska, John Kuk, Katharina Kunißen, Dafina Kurti Sinatra, Alexander Langenkamp, Philipp M. Lersch, Lea-Maria Löbel, Philipp Lutscher, Matthias Mader, Joan E. Madia, Natalia Malancu, Luis Maldonado, Helge Marahrens, Nicole Martin, Paul Martinez, Jochen Mayerl, Oscar J. Mayorga, Patricia McManus, Kyle McWagner, Cecil Meeusen, Daniel Meierrieks, Jonathan Mellon, Friedolin Merhout, Samuel Merk, Daniel Meyer, Leticia Micheli, Jonathan Mijs, Cristóbal Moya, Marcel Neunhoeffer, Daniel Nüst, Olav Nygård, Fabian Ochsenfeld, Gunnar Otte, Anna O. Pechenkina, Christopher Prosser, Louis Raes, Kevin Ralston, Miguel R. Ramos, Arne Roets, Jonathan Rogers, Guido Ropers, Robin Samuel, Gregor Sand, Ariela Schachter, Merlin Schaeffer, David Schieferdecker, Elmar Schlueter, Regine Schmidt, Katja M. Schmidt, Alexander Schmidt-Catran, Claudia Schmiedeberg, Jürgen Schneider, Martijn Schoonvelde, Julia Schulte-Cloos, Sandy Schumann, Reinhard Schunck, Jürgen Schupp, Julian Seuring, Henning Silber, Willem Sleegers, Nico Sonntag, Alexander Staudt, Nadia Steiber, Nils Steiner, Sebastian Sternberg, Dieter Stiers, Dragana Stojmenovska, Nora Storz, Erich Striessnig, Anne-Kathrin Stroppe, Janna Teltemann, Andrey Tibajev, Brian Tung, Giacomo Vagni, Jasper Van Assche, Meta van der Linden, Jolanda van der Noll, Arno Van Hootegem, Stefan Vogtenhuber, Bogdan Voicu, Fieke Wagemans, Nadja Wehl, Hannah Werner, Brenton M. Wiernik, Fabian Winter, Christof Wolf, Yuki Yamada, Nan Zhang, Conrad Ziller, Stefan Zins, and Tomasz Żółtak. 2022. Observing many researchers using the same data and hypothesis reveals a hidden universe of uncertainty. Proceedings of the National Academy of Sciences 119, 44 (Nov. 2022), e2203150119. https://doi.org/10.1073/pnas.2203150119 Publisher: Proceedings of the National Academy of Sciences.",
      "doi": ""
    },
    {
      "text": "Joseph Cesario, David J. Johnson, and William Terrill. 2019. Is There Evidence of Racial Disparity in Police Use of Deadly Force? Analyses of Officer-Involved Fatal Shootings in 2015–2016. Social Psychological and Personality Science 10, 5 (July 2019), 586–595. https://doi.org/10.1177/1948550618775108 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Egon Dejonckheere, Merijn Mestdagh, Marlies Houben, Yasemin Erbas, Madeline Pe, Peter Koval, Annette Brose, Brock Bastian, and Peter Kuppens. 2018. The bipolarity of affect and depressive symptoms. Journal of Personality and Social Psychology 114, 2 (Feb. 2018), 323–341. https://doi.org/10.1037/pspp0000186",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic, Yvonne Jansen, Abhraneel Sarma, Matthew Kay, and Fanny Chevalier. 2019. Increasing the Transparency of Research Papers with Explorable Multiverse Analyses. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–15. https://doi.org/10.1145/3290605.3300295",
      "doi": "10.1145/3290605.3300295"
    },
    {
      "text": "Jean-Rémy Falleri, Floréal Morandat, Xavier Blanc, Matias Martinez, and Martin Monperrus. 2014. Fine-grained and Accurate Source Code Differencing. In Proceedings of the International Conference on Automated Software Engineering. Västeras, Sweden, 313–324. https://doi.org/10.1145/2642937.2642982",
      "doi": "10.1145/2642937.2642982"
    },
    {
      "text": "Jean-Rémy Falleri, Floréal Morandat, Xavier Blanc, Matias Martinez, and Martin Monperrus. 2014. Fine-grained and Accurate Source Code Differencing. In Proceedings of the International Conference on Automated Software Engineering. Västeras, Sweden, 313–324. https://doi.org/10.1145/2642937.2642982",
      "doi": "10.1145/2642937.2642982"
    },
    {
      "text": "Kiran Gadhave, Jochen Görtler, Zach Tyler Cutler, Carolina Nobre, Oliver Deussen, Miriah Meyer, Jeff Phillips, and Alexander Lex. 2020. Predicting Intent Behind Selections in Scatterplot Visualizations. https://doi.org/10.31219/osf.io/mq2rk",
      "doi": ""
    },
    {
      "text": "Joachim Gassen. 2022. Researcher Degrees of Freedom Analysis. https://joachim-gassen.github.io/rdfanalysis/index.html",
      "doi": ""
    },
    {
      "text": "Brian D. Hall, Yang Liu, Yvonne Jansen, Pierre Dragicevic, Fanny Chevalier, and Matthew Kay. 2022. A Survey of Tasks and Visualizations in Multiverse Analysis Reports. Computer Graphics Forum 41, 1 (2022), 402–426. https://doi.org/10.1111/cgf.14443 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.14443.",
      "doi": ""
    },
    {
      "text": "Eunice Jun, Maureen Daum, Jared Roesch, Sarah E. Chasins, Emery D. Berger, Rene Just, and Katharina Reinecke. 2019. Tea: A High-level Language and Runtime System for Automating Statistical Analysis. Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (Oct. 2019), 591–603. https://doi.org/10.1145/3332165.3347940 arXiv:1904.05387.",
      "doi": "10.1145/3332165.3347940"
    },
    {
      "text": "Eunice Jun, Audrey Seo, Jeffrey Heer, and René Just. 2022. Tisane: Authoring Statistical Models via Formal Reasoning from Conceptual and Data Relationships. arXiv:2201.02705 [cs, stat] (Jan. 2022). https://doi.org/10.1145/3491102.3501888 arXiv:2201.02705.",
      "doi": "10.1145/3491102.3501888"
    },
    {
      "text": "Kiju Jung, Sharon Shavitt, Madhu Viswanathan, and Joseph M. Hilbe. 2014. Female hurricanes are deadlier than male hurricanes. Proceedings of the National Academy of Sciences 111, 24 (June 2014), 8782–8787. https://doi.org/10.1073/pnas.1402786111",
      "doi": ""
    },
    {
      "text": "Alex Kale, Matthew Kay, and Jessica Hullman. 2019. Decision-Making Under Uncertainty in Research Synthesis: Designing for the Garden of Forking Paths. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300432",
      "doi": "10.1145/3290605.3300432"
    },
    {
      "text": "Elise K. Kalokerinos, Yasemin Erbas, Eva Ceulemans, and Peter Kuppens. 2019. Differentiate to Regulate: Low Negative Emotion Differentiation Is Associated With Ineffective Use but Not Selection of Emotion-Regulation Strategies. Psychological Science 30, 6 (June 2019), 863–879. https://doi.org/10.1177/0956797619838763 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Richard M. Karp. 1972. Reducibility among Combinatorial Problems. In Complexity of Computer Computations: Proceedings of a symposium on the Complexity of Computer Computations, held March 20–22, 1972, at the IBM Thomas J. Watson Research Center, Yorktown Heights, New York, and sponsored by the Office of Naval Research, Mathematics Program, IBM World Trade Corporation, and the IBM Research Mathematical Sciences Department, Raymond E. Miller, James W. Thatcher, and Jean D. Bohlinger (Eds.). Springer US, Boston, MA, 85–103. https://doi.org/10.1007/978-1-4684-2001-2_9",
      "doi": ""
    },
    {
      "text": "Mary Beth Kery, Amber Horvath, and Brad Myers. 2017. Variolite: Supporting Exploratory Programming by Data Scientists. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 1265–1276. https://doi.org/10.1145/3025453.3025626",
      "doi": "10.1145/3025453.3025626"
    },
    {
      "text": "Mary Beth Kery and Brad A. Myers. 2018. Interactions for Untangling Messy History in a Computational Notebook. In 2018 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 147–155. https://doi.org/10.1109/VLHCC.2018.8506576 ISSN: 1943-6106.",
      "doi": ""
    },
    {
      "text": "Ruben Kleiman, Mike Brayshaw, Marc Eisenstadt, and Marc Eisenstadt. 1993. Tales of Debugging from The Front Lines.",
      "doi": ""
    },
    {
      "text": "Amy J. Ko, Brad A. Myers, Michael J. Coblenz, and Htet Htet Aung. 2006. An Exploratory Study of How Developers Seek, Relate, and Collect Relevant Information during Software Maintenance Tasks. IEEE Transactions on Software Engineering 32, 12 (Dec. 2006), 971–987. https://doi.org/10.1109/TSE.2006.116",
      "doi": "10.1109/TSE.2006.116"
    },
    {
      "text": "Qisheng Li, Meredith Ringel Morris, Adam Fourney, Kevin Larson, and Katharina Reinecke. 2019. The Impact of Web Browser Reader Views on Reading Speed and User Experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300754",
      "doi": "10.1145/3290605.3300754"
    },
    {
      "text": "Yang Liu, Tim Althoff, and Jeffrey Heer. 2020. Paths Explored, Paths Omitted, Paths Obscured: Decision Points & Selective Reporting in End-to-End Data Analysis. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376533",
      "doi": "10.1145/3313831.3376533"
    },
    {
      "text": "Yang Liu, Alex Kale, Tim Althoff, and Jeffrey Heer. 2021. Boba: Authoring and Visualizing Multiverse Analyses. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb. 2021), 1753–1763. https://doi.org/10.1109/TVCG.2020.3028985 arXiv:2007.05551.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2022. Monaco Editor. https://microsoft.github.io/monaco-editor/",
      "doi": ""
    },
    {
      "text": "Roberto Minelli, Andrea Mocci, and Michele Lanza. 2015. I Know What You Did Last Summer - An Investigation of How Developers Spend Their Time. In 2015 IEEE 23rd International Conference on Program Comprehension. 25–35. https://doi.org/10.1109/ICPC.2015.12 ISSN: 1092-8138.",
      "doi": "10.1109/ICPC.2015.12"
    },
    {
      "text": "Guiomar Niso, Rotem Botvinik-Nezer, Stefan Appelhoff, Alejandro De La Vega, Oscar Esteban, Joset A. Etzel, Karolina Finc, Melanie Ganz, Remi Gau, Yaroslav O. Halchenko, Peer Herholz, Agah Karakuzu, David Keator, Camille Maumet, Christopher J. Markiewicz, Dr Cyril Pernet, Franco Pestilli, Nazek Queder, Tina Schmitt, Weronika Sójka, Adina Svenja Wagner, Kirstie Whitaker, and Jochem Rieger. 2022. Open and reproducible neuroimaging: from study inception to publication. https://doi.org/10.31219/osf.io/pu5vb",
      "doi": ""
    },
    {
      "text": "OPEN SCIENCE COLLABORATION. 2015. Estimating the reproducibility of psychological science. Science 349, 6251 (Aug. 2015), aac4716. https://doi.org/10.1126/science.aac4716 Publisher: American Association for the Advancement of Science.",
      "doi": ""
    },
    {
      "text": "Mark Otto and Jacob Thornton. 2022. Bootstrap. https://getbootstrap.com/",
      "doi": ""
    },
    {
      "text": "Chirag J. Patel, Belinda Burford, and John P. A. Ioannidis. 2015. Assessment of vibration of effects due to model specification can demonstrate the instability of observational associations. Journal of Clinical Epidemiology 68, 9 (Sept. 2015), 1046–1058. https://doi.org/10.1016/j.jclinepi.2015.05.029",
      "doi": ""
    },
    {
      "text": "Gregory J Poarch, Jan Vanhove, and Raphael Berthele. 2019. The effect of bidialectalism on executive function. International Journal of Bilingualism 23, 2 (April 2019), 612–628. https://doi.org/10.1177/1367006918763132 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "James R. Rae, Selin Gülgöz, Lily Durwood, Madeleine DeMeules, Riley Lowe, Gabrielle Lindquist, and Kristina R. Olson. 2019. Predicting Early-Childhood Gender Transitions. Psychological Science 30, 5 (May 2019), 669–681. https://doi.org/10.1177/0956797619830649 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Armin Ronacher. 2022. Welcome to Flask — Flask Documentation (2.2.x). https://flask.palletsprojects.com/en/2.2.x/",
      "doi": ""
    },
    {
      "text": "Abhraneel Sarma, Alexander Kale, Michael Jongho Moon, Nathan Taback, Fanny Chevalier, Jessica Hullman, and Matthew Kay. 2021. multiverse: Multiplexing Alternative Data Analyses in R Notebooks. Technical Report. OSF Preprints. https://doi.org/10.31219/osf.io/yfbwm type: article.",
      "doi": ""
    },
    {
      "text": "Tal Schuster, Ashwin Kalyan, Alex Polozov, and Adam Kalai. 2021. Programming Puzzles. Proceedings of the Neural Information Processing Systems Track on Datasets and Benchmarks 1 (Dec. 2021). https://datasets-benchmarks-proceedings.neurips.cc/paper/2021/hash/3988c7f88ebcb58c6ce932b957b6f332-Abstract-round1.html",
      "doi": ""
    },
    {
      "text": "Martin Schweinsberg, Michael Feldman, Nicola Staub, Olmo R. van den Akker, Robbie C.M. van Aert, Marcel A.L.M. van Assen, Yang Liu, Tim Althoff, Jeffrey Heer, Alex Kale, Zainab Mohamed, Hashem Amireh, Vaishali Venkatesh Prasad, Abraham Bernstein, Emily Robinson, Kaisa Snellman, S. Amy Sommer, Sarah M.G. Otner, David Robinson, Nikhil Madan, Raphael Silberzahn, Pavel Goldstein, Warren Tierney, Toshio Murase, Benjamin Mandl, Domenico Viganola, Carolin Strobl, Catherine B.C. Schaumans, Stijn Kelchtermans, Chan Naseeb, S. Mason Garrison, Tal Yarkoni, C.S. Richard Chan, Prestone Adie, Paulius Alaburda, Casper Albers, Sara Alspaugh, Jeff Alstott, Andrew A. Nelson, Eduardo Ariño de la Rubia, Adbi Arzi, Štěpán Bahník, Jason Baik, Laura Winther Balling, Sachin Banker, David AA Baranger, Dale J. Barr, Brenda Barros-Rivera, Matt Bauer, Enuh Blaise, Lisa Boelen, Katerina Bohle Carbonell, Robert A. Briers, Oliver Burkhard, Miguel-Angel Canela, Laura Castrillo, Timothy Catlett, Olivia Chen, Michael Clark, Brent Cohn, Alex Coppock, Natàlia Cugueró-Escofet, Paul G. Curran, Wilson Cyrus-Lai, David Dai, Giulio Valentino Dalla Riva, Henrik Danielsson, Rosaria de F.S.M. Russo, Niko de Silva, Curdin Derungs, Frank Dondelinger, Carolina Duarte de Souza, B. Tyson Dube, Marina Dubova, Ben Mark Dunn, Peter Adriaan Edelsbrunner, Sara Finley, Nick Fox, Timo Gnambs, Yuanyuan Gong, Erin Grand, Brandon Greenawalt, Dan Han, Paul H.P. Hanel, Antony B. Hong, David Hood, Justin Hsueh, Lilian Huang, Kent N. Hui, Keith A. Hultman, Azka Javaid, Lily Ji Jiang, Jonathan Jong, Jash Kamdar, David Kane, Gregor Kappler, Erikson Kaszubowski, Christopher M. Kavanagh, Madian Khabsa, Bennett Kleinberg, Jens Kouros, Heather Krause, Angelos-Miltiadis Krypotos, Dejan Lavbič, Rui Ling Lee, Timothy Leffel, Wei Yang Lim, Silvia Liverani, Bianca Loh, Dorte Lønsmann, Jia Wei Low, Alton Lu, Kyle MacDonald, Christopher R. Madan, Lasse Hjorth Madsen, Christina Maimone, Alexandra Mangold, Adrienne Marshall, Helena Ester Matskewich, Kimia Mavon, Katherine L. McLain, Amelia A. McNamara, Mhairi McNeill, Ulf Mertens, David Miller, Ben Moore, Andrew Moore, Eric Nantz, Ziauddin Nasrullah, Valentina Nejkovic, Colleen S Nell, Andrew Arthur Nelson, Gustav Nilsonne, Rory Nolan, Christopher E. O’Brien, Patrick O’Neill, Kieran O’Shea, Toto Olita, Jahna Otterbacher, Diana Palsetia, Bianca Pereira, Ivan Pozdniakov, John Protzko, Jean-Nicolas Reyt, Travis Riddle, Amal (Akmal) Ridhwan Omar Ali, Ivan Ropovik, Joshua M. Rosenberg, Stephane Rothen, Michael Schulte-Mecklenbeck, Nirek Sharma, Gordon Shotwell, Martin Skarzynski, William Stedden, Victoria Stodden, Martin A. Stoffel, Scott Stoltzman, Subashini Subbaiah, Rachael Tatman, Paul H. Thibodeau, Sabina Tomkins, Ana Valdivia, Gerrieke B. Druijff-van de Woestijne, Laura Viana, Florence Villesèche, W. Duncan Wadsworth, Florian Wanders, Krista Watts, Jason D Wells, Christopher E. Whelpley, Andy Won, Lawrence Wu, Arthur Yip, Casey Youngflesh, Ju-Chi Yu, Arash Zandian, Leilei Zhang, Chava Zibman, and Eric Luis Uhlmann. 2021. Same data, different conclusions: Radical dispersion in empirical results when independent analysts operationalize and test the same hypothesis. Organizational Behavior and Human Decision Processes 165 (July 2021), 228–249. https://doi.org/10.1016/j.obhdp.2021.02.003",
      "doi": ""
    },
    {
      "text": "R. Silberzahn, E. L. Uhlmann, D. P. Martin, P. Anselmi, F. Aust, E. Awtrey, Š. Bahník, F. Bai, C. Bannard, E. Bonnier, R. Carlsson, F. Cheung, G. Christensen, R. Clay, M. A. Craig, A. Dalla Rosa, L. Dam, M. H. Evans, I. Flores Cervantes, N. Fong, M. Gamez-Djokic, A. Glenz, S. Gordon-McKeon, T. J. Heaton, K. Hederos, M. Heene, A. J. Hofelich Mohr, F. Högden, K. Hui, M. Johannesson, J. Kalodimos, E. Kaszubowski, D. M. Kennedy",
      "doi": ""
    },
    {
      "text": "Uri Simonsohn, Joseph P. Simmons, and Leif D. Nelson. 2019. Specification Curve: Descriptive and Inferential Statistics on All Reasonable Specifications. https://doi.org/10.2139/ssrn.2694998",
      "doi": ""
    },
    {
      "text": "Uri Simonsohn, Joseph P. Simmons, and Leif D. Nelson. 2020. Specification curve analysis. Nature Human Behaviour 4, 11 (Nov. 2020), 1208–1214. https://doi.org/10.1038/s41562-020-0912-z",
      "doi": ""
    },
    {
      "text": "Gary Smith. 2022. Full moons and forking paths. Significance 19, 4 (2022), 32–35. https://doi.org/10.1111/1740-9713.01672 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/1740-9713.01672.",
      "doi": ""
    },
    {
      "text": "Sara Steegen, Francis Tuerlinckx, Andrew Gelman, and Wolf Vanpaemel. 2016. Increasing Transparency Through a Multiverse Analysis. Perspectives on Psychological Science 11, 5 (Sept. 2016), 702–712. https://doi.org/10.1177/1745691616658637 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Wolf Vanpaemel, Sara Steegen, Francis Tuerlinckx, and Andrew Gelman. 2016. multiverse analysis. (May 2016). https://osf.io/zj68b/ Publisher: OSF.",
      "doi": ""
    },
    {
      "text": "Xin Xia, Lingfeng Bao, David Lo, Zhenchang Xing, Ahmed E. Hassan, and Shanping Li. 2018. Measuring Program Comprehension: A Large-Scale Field Study with Professionals. IEEE Transactions on Software Engineering 44, 10 (Oct. 2018), 951–976. https://doi.org/10.1109/TSE.2017.2734091 Conference Name: IEEE Transactions on Software Engineering.",
      "doi": "10.1109/TSE.2017.2734091"
    }
  ]
}