{
  "doi": "10.1145/3544548.3580860",
  "title": "Home Is Where the Smart Is: Development and Validation of the Cybersecurity Self-Efficacy in Smart Homes (CySESH) Scale",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "The ubiquity of devices connected to the internet raises concerns about the security and privacy of smart homes. The effectiveness of interventions to support secure user behaviors is limited by a lack of validated instruments to measure relevant psychological constructs, such as self-efficacy – the belief that one is able to perform certain behaviors. We developed and validated the Cybersecurity Self-Efficacy in Smart Homes (CySESH) scale, a 12-item unidimensional measure of domain-specific self-efficacy beliefs, across five studies (N = 1247). Three pilot studies generated and refined an item pool. We report evidence from one initial and one major, preregistered validation study for (1) excellent reliability (α = 0.90), (2) convergent validity with self-efficacy in information security (rSEIS = 0.64, p < .001), and (3) discriminant validity with outcome expectations (rOE = 0.26, p < .001), self-esteem (rRSE = 0.17, p < .001), and optimism (rLOT-R = 0.18, p < .001). We discuss CySESH’s potential to advance future HCI research on cybersecurity, practitioner user assessments, and implications for consumer protection policy.",
  "authors": [
    {
      "name": "Nele Borgert",
      "institution": "Faculty of Psychology, Ruhr University Bochum, Germany and Horst Görtz Institute for IT Security, Ruhr University Bochum, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659962489",
      "orcid": "0000-0002-0255-5822"
    },
    {
      "name": "Oliver D. Reithmaier",
      "institution": "Usable Security & Privacy Group, Leibniz University Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781567",
      "orcid": "0000-0001-7565-7435"
    },
    {
      "name": "Luisa Jansen",
      "institution": "Faculty of Psychology, Ruhr University Bochum, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780885",
      "orcid": "0000-0001-8126-1306"
    },
    {
      "name": "Larina Hillemann",
      "institution": "Faculty of Psychology, Ruhr University Bochum, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778159",
      "orcid": "0000-0003-1694-4009"
    },
    {
      "name": "Ian Hussey",
      "institution": "Faculty of Psychology, Ruhr University Bochum, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778860",
      "orcid": "0000-0001-8906-7559"
    },
    {
      "name": "Malte Elson",
      "institution": "Faculty of Psychology, Ruhr University Bochum, Germany and Horst Görtz Institute for IT Security, Ruhr University Bochum, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658761046",
      "orcid": "0000-0001-7806-9583"
    }
  ],
  "references": [
    {
      "text": "Manfred Amelang and Lothar Schmidt-Atzert. 2006. Psychologische Diagnostik und Intervention(4 ed.). Springer, Heidelberg, Germany. https://doi.org/10.1007/3-540-28507-5",
      "doi": ""
    },
    {
      "text": "American Psychological Association. 1954. Technical recommendations for psychological tests and diagnostic techniques. Psychological Bulletin 51, 2:2 (1954), 1–38. https://doi.org/10.1037/h0053479",
      "doi": ""
    },
    {
      "text": "Mohd Anwar, Wu He, Ivan Ash, Xiaohong Yuan, Ling Li, and Li Xu. 2017. Gender difference and employees’ cybersecurity behaviors. Computers in Human Behavior 69, 4 (2017), 437–443. https://doi.org/10.1016/j.chb.2016.12.040",
      "doi": "10.1016/j.chb.2016.12.040"
    },
    {
      "text": "Noah Apthorpe, Dillon Reisman, Srikanth Sundaresan, Arvind Narayanan, and Nick Feamster. 2017. Spying on the Smart Home: Privacy Attacks and Defenses on Encrypted IoT Traffic: arXiv preprint. https://arxiv.org/abs/1708.05044",
      "doi": ""
    },
    {
      "text": "Renana Arizon-Peretz, Irit Hadar, and Gil Luria. 2021. The Importance of Security is in the Eye of the Beholder: Cultural, Organizational, and Personal Factors Affecting the Implementation of Security by Design. IEEE Transactions on Software Engineering 48, 11 (2021), 4433–4446. https://doi.org/10.1109/TSE.2021.3119721",
      "doi": ""
    },
    {
      "text": "Kregg Aytes and Terry Conolly. 2003. A Research Model for Investigating Human Behavior Related to Computer Security. In AMCIS 2003 Proceedings, Association for Information Systems (Ed.). AIS Electronic Library, Tampa, FL, United States, 206. https://aisel.aisnet.org/amcis2003/260",
      "doi": ""
    },
    {
      "text": "Nazmiye Balta-Ozkan, Rosemary Davidson, Martha Bicket, and Lorraine Whitmarsh. 2013. Social barriers to the adoption of smart homes. Energy Policy 63, 12 (2013), 363–374. https://doi.org/10.1016/j. enpol.2013.08.043",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1977. Self-efficacy: Toward a unifying theory of behavioral change. Psychological Review 84, 2 (1977), 191–215. https://doi.org/10.1037/0033-295X.84.2.191",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1982. Self-efficacy mechanism in human agency. American Psychologist 37, 2 (1982), 122–147. https://doi.org/10.1037/0003-066X.37.2.122",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1986. Social foundations of thought and action: A social cognitive theory. Prentice-Hall, Englewood Cliffs, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1997. Self-efficacy: The exercise of control. W H Freeman/Times Books/ Henry Holt & Co, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2006. Guide for constructing self-efficacy scales. In Self-efficacy beliefs of adolescents, Frank Pajares and Timothy C. Urdan (Eds.). IAP - Information Age Pub. Inc, Greenwich, CT, USA, 307–337.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2010. Self-Efficacy. In The Corsini Encyclopedia of Psychology, Irving B. Weiner and W. Edward Craighead (Eds.). John Wiley & Sons, Inc, Hoboken, NJ, USA. https://doi.org/10.1002/9780470479216. corpsy0836",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2012. On the Functional Properties of Perceived Self-Efficacy Revisited. Journal of Management 38, 1 (2012), 9–44. https://doi.org/10.1177/0149206311410606",
      "doi": ""
    },
    {
      "text": "Albert Bandura and Edwin A. Locke. 2003. Negative self-efficacy and goal effects revisited. The Journal of applied psychology 88, 1 (2003), 87–99. https://doi.org/10.1037/0021-9010.88.1.87",
      "doi": ""
    },
    {
      "text": "Godfred O. Boateng, Torsten B. Neilands, Edward A. Frongillo, Hugo R. Melgar-Quiñonez, and Sera L. Young. 2018. Best Practices for Developing and Validating Scales for Health, Social, and Behavioral Research: A Primer. Frontiers in public health 6 (2018), 149. https://doi.org/10.3389/fpubh.2018.00149",
      "doi": ""
    },
    {
      "text": "Andrew Booth, Diana Papaioannou, and Anthea Sutton. 2012. Systematic approaches to a successful literature review. Sage, Los Angeles, Calif.",
      "doi": ""
    },
    {
      "text": "Nele Borgert, Jennifer Friedauer, Imke Böse, Angela M. Sasse, and Malte Elson. 2021. The Study of Cybersecurity Self-Efficacy: A Systematic Literature Review of Methodology. In USENIX Symposium on Usable Privacy and Security (SOUPS) 2021. USENIX Association, Virtual Conference, 1–4. https://www.usenix.org/system/files/soups21-abstract-poster56-borgert.pdf",
      "doi": ""
    },
    {
      "text": "Nele Borgert, Luisa Jansen, Imke Böse, Jennifer Friedauer, M. Angela Sasse, and Malte Elson. 2023. A Decade of Dividedness: A Preregistered Systematic Review of the Cybersecurity Self-efficacy Methods. arxiv:10.31234/osf.io/ybec9",
      "doi": ""
    },
    {
      "text": "Frank Breitinger, Ryan Tully-Doyle, and Courtney Hassenfeldt. 2020. A survey on smartphone user’s security choices, awareness and education. Computers & Security 88 (2020), 101647. https://doi.org/10.1016/j. cose.2019.101647",
      "doi": ""
    },
    {
      "text": "Robert L. Brennan. 2001. An Essay on the History and Future of Reliability from the Perspective of Replications. Journal of Educational Measurement 38, 4 (2001), 295–317. https://doi.org/10.1111/j.1745-3984.2001.tb01129.x",
      "doi": ""
    },
    {
      "text": "Timothy A. Brown. 2015. Confirmatory factor analysis for applied research. The Guilford Press, New York and London. https://fid.fachportal-paedagogik.de/ebscoProxySearch/login.aspx?direct=true&scope=site&db=nlebk&db=nlabk&AN=831411",
      "doi": ""
    },
    {
      "text": "Burcu Bulgurcu, Hasan Cavusoglu, and Izak Benbasat. 2010. Information security policy compliance: An empirical study of rationality-based beliefs and information security awareness. MIS Quarterly 34, 3 (2010), 523–548. https://doi.org/10.2307/25750690",
      "doi": ""
    },
    {
      "text": "Matthias Burisch. 1984. Approaches to personality inventory construction: A comparison of merits. American Psychologist 39, 3 (1984), 214–227. https://doi.org/10.1037/0003-066X.39.3.214",
      "doi": ""
    },
    {
      "text": "Kevin L. Burke, A. Barry Joyner, Daniel R. Czech, and Matthew J. Wilson. 2000. An investigation of concurrent validity between two optimism/pessimism questionnaires: The life orientation test-revised and the optimism/pessimism scale. Current Psychology 19, 2 (2000), 129–136. https://doi.org/10.1007/s12144-000-1009-5",
      "doi": ""
    },
    {
      "text": "Jennifer D. Campbell and Loraine F. Lavallee. 1993. Who am I? The Role of Self-Concept Confusion in Understanding the Behavior of People with Low Self-Esteem. In Self-Esteem, Roy F. Baumeister (Ed.). Springer, Boston, MA, USA, 3–20. https://doi.org/10.1007/978-1-4684-8956-9 _1",
      "doi": ""
    },
    {
      "text": "George Chalhoub, Ivan Flechais, Norbert Nthala, and Ruba Abu-Salma. 2020. Innovation Inaction or In Action? The Role of User Experience in the Security and Privacy Design of Smart Home Cameras. In USENIX Symposium on Usable Privacy and Security (SOUPS) 2020. USENIX Association, Virtual Conference, 185–204.",
      "doi": ""
    },
    {
      "text": "Mark Chan, Irene Woon, and Atreyi Kankanhalli. 2005. Perceptions of Information Security in the Workplace: Linking Information Security Climate to Compliant Behavior. Journal of Information Privacy and Security 1, 3 (2005), 18–41. https://doi.org/10.1080/15536548.2005.10855772",
      "doi": ""
    },
    {
      "text": "Nick Charalambides. 2021. We recently went viral on TikTok - here’s what we learned. https://www.prolific.co/blog/we-recently-went-viral-on-tiktok-heres-what-we-learned",
      "doi": ""
    },
    {
      "text": "Francesca Chiesi, Silvia Galli, Caterina Primi, Paolo Innocenti Borgi, and Andrea Bonacchi. 2013. The accuracy of the Life Orientation Test-Revised (LOT-R) in measuring dispositional optimism: evidence from item response theory analyses. Journal of personality assessment 95, 5 (2013), 523–529. https://doi.org/10.1080/00223891.2013.781029",
      "doi": ""
    },
    {
      "text": "Lian-Hwang Chiu. 1988. Measures of Self-Esteem for School-Age Children. Journal of Counseling & Development 66, 6 (1988), 298–301. https://doi.org/10.1002/j.1556-6676.1988.tb00874.x",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1992. Quantitative methods in psychology: A power primer. Psychological Bulletin 112, 1 (1992), 153–159.",
      "doi": ""
    },
    {
      "text": "Consumers International and Internet Society. 2019. The Trust Opportunity: Exploring Consumer attitudes to the Internet of Things. https://www.internetsociety.org/resources/doc/2019/trust-opportunity-exploring-consumer-attitudes-to-iot/",
      "doi": ""
    },
    {
      "text": "Rick Crandall. 1973. The measurement of self-esteem and related constructs. In Measures of Social Psychological Attitudes, John P. Robinson and Phillip R. Shaver (Eds.). The University of Michigan, Ann Arbor, MI, USA, 45–167.",
      "doi": ""
    },
    {
      "text": "Lee J. Cronbach. 1971. Test Validation. In Educational Measurement, Robert L. Thorndike (Ed.). American Council on Education, Washington DC, USA, 443–507.",
      "doi": ""
    },
    {
      "text": "Lee J. Cronbach and Paul E. Meehl. 1955. Construct validity in psychological tests. Psychological Bulletin 52 (1955), 281–302.",
      "doi": ""
    },
    {
      "text": "Robert E. Crossler. 2010. Protection Motivation Theory: Understanding Determinants to Backing Up Personal Data. In 48th Hawaii International Conference on System Sciences (Hicss). IEEE, Kauai, HI, USA, 1–10. https://doi.org/10.1109/HICSS.2010.311",
      "doi": "10.1109/HICSS.2010.311"
    },
    {
      "text": "Robert F. DeVellis. 2012. Scale Development: Theory and Application. SAGE Publications, Los Angeles, CA, USA.",
      "doi": ""
    },
    {
      "text": "Charlette Donalds and Kweku-Muata Osei-Bryson. 2020. Cybersecurity compliance behavior: Exploring the influences of individual decision style and other antecedents. International Journal of Information Management 51 (2020), 102056. https://doi.org/10.1016/j. ijinfomgt.2019.102056",
      "doi": ""
    },
    {
      "text": "Malte Elson. 2019. Examining Psychological Science Through Systematic Meta-Method Analysis: A Call for Research. Advances in Methods and Practices in Psychological Science 2, 4(2019), 350–363. https://doi.org/10.1177/2515245919863296",
      "doi": ""
    },
    {
      "text": "ENISA. 2019. Cybersecurity culture guidelines: Behavioural aspects of cybersecurity: European Union Agency For Network and Information Security Report 2019. https://doi.org/10.2824/324042",
      "doi": ""
    },
    {
      "text": "Ulrike Fasbender. 2020. Outcome Expectancies. In Encyclopedia of personality and individual differences, Virgil Zeigler-Hill (Ed.). Springer International Publishing, Cham, 3377–3379. https://doi.org/10.1007/978-3-319-24612-3_1802",
      "doi": ""
    },
    {
      "text": "Faith B. Fatokun, Suraya Hamid, Azah Anir Norman, and Johnson O. Fatokun. 2019. The Impact of Age, Gender, and Educational level on the Cybersecurity Behaviors of Tertiary Institution Students: An Empirical investigation on Malaysian Universities. Journal of Physics: Conference Series 1339, 1 (2019), 012098. https://doi.org/10.1088/1742-6596/1339/1/012098",
      "doi": ""
    },
    {
      "text": "Massimo Ficco and Francesco Palmieri. 2019. Leaf: An open-source cybersecurity training platform for realistic edge-IoT scenarios. Journal of Systems Architecture 97 (2019), 107–129. https://doi.org/10.1016/j. sysarc.2019.04.004",
      "doi": ""
    },
    {
      "text": "Andy P. Field. 2001. Meta-analysis of correlation coefficients: A Monte Carlo comparison of fixed- and random-effects methods. Psychological methods 6, 2 (2001), 161–180. https://doi.org/10.1037/1082-989X.6.2.161",
      "doi": ""
    },
    {
      "text": "Jessica Kay Flake, Ian J. Davidson, Octavia Wong, and Jolynn Pek. 2022. Construct validity and the validity of replication studies: A systematic review. The American psychologist 77, 4 (2022), 576–588. https://doi.org/10.1037/amp0001006",
      "doi": ""
    },
    {
      "text": "Jessica Kay Flake and Eiko I. Fried. 2020. Measurement Schmeasurement: Questionable Measurement Practices and How to Avoid Them. Advances in Methods and Practices in Psychological Science 3, 4(2020), 456–465. https://doi.org/10.1177/2515245920952393",
      "doi": ""
    },
    {
      "text": "Santos M. Galvez, Joshua D. Shackman, Indira R. Guzman, and Shuyuan M. Ho. 2015. Factors Affecting Individual Information Security Practices. In Proceedings of the 2015 ACM SIGMIS Conference on Computers and People Research(ACM Digital Library), Diana Burley (Ed.). ACM, New York, NY, USA, 135–144. https://doi.org/10.1145/2751957.2751966",
      "doi": "10.1145/2751957.2751966"
    },
    {
      "text": "Radhika Garg, Hua Cui, Spencer Seligson, Bo Zhang, Martin Porcheron, Leigh Clark, Benjamin R. Cowan, and Erin Beneteau. 2022. The Last Decade of HCI Research on Children and Voice-based Conversational Agents. In CHI Conference on Human Factors in Computing Systems(ACM Digital Library), Simone Barbosa (Ed.). Association for Computing Machinery, New York, NY, USA, 1–19. https://doi.org/10.1145/3491102.3502016",
      "doi": "10.1145/3491102.3502016"
    },
    {
      "text": "Stacey George, Michael Clark, and Maria Crotty. 2007. Development of the Adelaide driving self-efficacy scale. Clinical rehabilitation 21, 1 (2007), 56–61. https://doi.org/10.1177/0269215506071284",
      "doi": ""
    },
    {
      "text": "Heide Glaesmer, Winfried Rief, Alexandra Martin, Ricarda Mewes, Elmar Brähler, Markus Zenger, and Andreas Hinz. 2012. Psychometric properties and population-based norms of the Life Orientation Test Revised (LOT-R). British journal of health psychology 17, 2 (2012), 432–445. https://doi.org/10.1111/j.2044-8287.2011.02046.x",
      "doi": ""
    },
    {
      "text": "Dan Goodin. 2021. Home alarm tech backdoored security cameras to spy on customers having sex: Employee for ADT accessed 200 customer cams on more than 9,600 occasions. https://arstechnica.com/information-technology/2021/01/home-alarm-tech-backdoored-security-cameras-to-spy-on-customers-having-sex/",
      "doi": ""
    },
    {
      "text": "James M. Graham. 2006. Congeneric and (Essentially) Tau-Equivalent Estimates of Score Reliability. Educational and Psychological Measurement 66, 6 (2006), 930–944. https://doi.org/10.1177/0013164406288165",
      "doi": ""
    },
    {
      "text": "Eliza M. Grames, Andrew N. Stillman, Morgan W. Tingley, and Chris S. Elphick. 2019. An automated approach to identifying search terms for systematic reviews using keyword co–occurrence networks. Methods in Ecology and Evolution 10, 10 (2019), 1645–1654. https://doi.org/10.1111/2041-210X.13268",
      "doi": ""
    },
    {
      "text": "Nadine Guhr, Oliver Werth, Philip Peter Hermann Blacha, and Michael H. Breitner. 2020. Privacy concerns in the smart home context. SN Applied Sciences 2, 2 (2020), 247. https://doi.org/10.1007/s42452-020-2025-8",
      "doi": ""
    },
    {
      "text": "Tzipora Halevi, Nasir Memon, James Lewis, Ponnurangam Kumaraguru, Sumit Arora, Nikita Dagar, Fadi Aloul, and Jay Chen. 2016. Cultural and psychological factors in cyber-security. In Proceedings of the 18th International Conference on Information Integration and Web-based Applications and Services(ACM Digital Library), Gabriele Anderst-Kotsis (Ed.). ACM, New York, NY, USA, 318–324. https://doi.org/10.1145/3011141.3011165",
      "doi": "10.1145/3011141.3011165"
    },
    {
      "text": "Ronald K. Hambleton and Daniel R. Eignor. 1979. A Practitioner’s Guide to Criterion-Referenced Test Development, Validation, and Test Score Usage(2 ed.). University of Massachusetts, School of Educacation, Laboratory of Psychometric and Evaluative Research, Amherst, MA, USA.",
      "doi": ""
    },
    {
      "text": "Bartlomiej Hanus and Yu “Andy” Wu. 2016. Impact of Users’ Security Awareness on Desktop Security Behavior: A Protection Motivation Theory Perspective. Information Systems Management 33, 1 (2016), 2–16. https://doi.org/10.1080/10580530.2015.1117842",
      "doi": "10.1080/10580530.2015.1117842"
    },
    {
      "text": "Tom Hargreaves, Charlie Wilson, and Richard Hauxwell-Baldwin. 2018. Learning to live in a smart home. Building Research & Information 46, 1 (2018), 127–139. https://doi.org/10.1080/09613218.2017.1286882",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes and Jacob J. Coutts. 2020. Use Omega Rather than Cronbach’s Alpha for Estimating Reliability. But…. Communication Methods and Measures 14, 1 (2020), 1–24. https://doi.org/10.1080/19312458.2020.1718629",
      "doi": ""
    },
    {
      "text": "Todd F. Heatherton and Carrie L. Wyland. 2009. Assessing self-esteem. In Positive psychological assessment, Shane J. Lopez and C. R. Snyder (Eds.). American Psychological Assoc, Washington, DC, 219–233. https://doi.org/10.1037/10612-014",
      "doi": ""
    },
    {
      "text": "Gordon Hodson. 2021. Construct jangle or construct mangle? Thinking straight about (nonredundant) psychological constructs. Journal of Theoretical Social Psychology 592, 4 (2021), 258. https://doi.org/10.1002/jts5.120",
      "doi": ""
    },
    {
      "text": "Val Hooper and Chris Blunt. 2020. Factors influencing the information security behaviour of IT employees. Behaviour & Information Technology 39, 8 (2020), 862–874. https://doi.org/10.1080/0144929X.2019.1623322",
      "doi": ""
    },
    {
      "text": "Angel Hsing-Chi Hwang and Andrea Stevenson Won. 2022. AI in Your Mind: Counterbalancing Perceived Agency and Experience in Human-AI Interaction. In CHI Conference on Human Factors in Computing Systems Extended Abstracts(ACM Digital Library), Simone Barbosa (Ed.). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3491101.3519833",
      "doi": "10.1145/3491101.3519833"
    },
    {
      "text": "Ge Jin, Manghui Tu, Tae-Hoon Kim, Justin Heffron, and Jonathan White. 2018. Game based Cybersecurity Training for High School Students. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education(ACM Conferences), Tiffany Barnes (Ed.). ACM, New York, NY, USA, 68–73. https://doi.org/10.1145/3159450.3159591",
      "doi": "10.1145/3159450.3159591"
    },
    {
      "text": "Timothy A. Judge, Christine L. Jackson, John C. Shaw, Brent A. Scott, and Bruce L. Rich. 2007. Self-efficacy and work-related performance: The integral role of individual differences.Journal of Applied Psychology 92, 1 (2007), 107–127. https://doi.org/10.1037/0021-9010.92.1.107",
      "doi": ""
    },
    {
      "text": "Kyongseok Kim and Jooyoung Kim. 2011. Third-party Privacy Certification as an Online Advertising Strategy: An Investigation of the Factors Affecting the Relationship between Third-party Certification and Initial Trust. Journal of Interactive Marketing 25, 3 (2011), 145–158. https://doi.org/10.1016/j. intmar.2010.09.003",
      "doi": ""
    },
    {
      "text": "Spyros Kokolakis. 2017. Privacy attitudes and privacy behaviour: A review of current research on the privacy paradox phenomenon. Computers & Security 64 (2017), 122–134. https://doi.org/10.1016/j. cose.2015.07.002",
      "doi": ""
    },
    {
      "text": "Daniel Koloseni, Chong Yee Lee, and Gan Ming Lee. 2018. Security policy compliance in public institutions: An integrative approach. Journal of Applied Structural Equation Modeling 2, 1 (2018), 13–28. https://doi.org/10.47263/jasem.2(1)03",
      "doi": ""
    },
    {
      "text": "W. Kristof. 1983. Klassische Testtheorie und Testkonstruktion. In Messen und Testen, Hubert Feger and Jürgen Bredenkamp (Eds.). Springer, Göttingen, Germany, 544–603.",
      "doi": ""
    },
    {
      "text": "Daniël Lakens. 2014. Performing high-powered studies efficiently with sequential analyses. European Journal of Social Psychology 44, 7 (2014), 701–710. https://doi.org/10.1002/ejsp.2023 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/ejsp.2023.",
      "doi": ""
    },
    {
      "text": "Jeremiah Lasquety-Reyes. 2021. Number of Smart Homes forecast in the World from 2017 to 2025. https://www.statista.com/forecasts/887613/number-of-smart-homes-in-the-smart-home-market-in-the-world",
      "doi": ""
    },
    {
      "text": "Zachary E. Lee and K. Max Zhang. 2022. Unintended consequences of smart thermostats in the transition to electrified heating. Applied Energy 322(2022), 119384. https://doi.org/10.1016/j.apenergy.2022.119384",
      "doi": ""
    },
    {
      "text": "Cheng-Hsien Li. 2016. Confirmatory factor analysis with ordinal data: Comparing robust maximum likelihood and diagonally weighted least squares. Behavior research methods 48, 3 (2016), 936–949. https://doi.org/10.3758/s13428-015-0619-7",
      "doi": ""
    },
    {
      "text": "Jiunn-Woei Lian. 2021. Understanding cloud-based BYOD information security protection behaviour in smart business: in perspective of perceived value. Enterprise Information Systems 15, 9 (2021), 1216–1237. https://doi.org/10.1080/17517575.2020.1791966",
      "doi": ""
    },
    {
      "text": "Scott O. Lilienfeld and Adele N. Strother. 2020. Psychological measurement and the replication crisis: Four sacred cows. Canadian Psychology/Psychologie canadienne 61, 4 (2020), 281–288. https://doi.org/10.1037/cap0000236",
      "doi": ""
    },
    {
      "text": "Sonia Lippke. 2020. Outcome Expectation. In Encyclopedia of personality and individual differences, Virgil Zeigler-Hill (Ed.). Springer International Publishing, Cham, 3379–3381. https://doi.org/10.1007/978-3-319-24612-3_1145",
      "doi": ""
    },
    {
      "text": "Jean M. Lown. 2011. Development and Validation of a Financial Self-Efficacy Scale. Journal of Financial Counseling and Planning 22, 2 (2011), 54–63. https://ssrn.com/abstract=2006665",
      "doi": ""
    },
    {
      "text": "J. E. Maddux and J. T. Gosselin. 2012. Self-efficacy. In Handbook of self and identity, M. R. Leary and J. P. Tangney (Eds.). The Guilford Press, New York, NY, USA, 198–224.",
      "doi": ""
    },
    {
      "text": "James E. Maddux, Larry W. Norton, and Cal D. Stoltenberg. 1986. Self-efficacy expectancy, outcome expectancy, and outcome value: Relative effects on behavioral intentions. Journal of Personality and Social Psychology 51, 4(1986), 783–789. https://doi.org/10.1037/0022-3514.51.4.783",
      "doi": ""
    },
    {
      "text": "Philip R. Magaletta and Joan M. Oliver. 1999. The hope construct, will, and ways: Their relations with self-efficacy, optimism, and general well-being. Journal of Clinical Psychology 55, 5 (1999), 539–551. https://doi.org/10.1002/(SICI)1097-4679(199905)55:5<539::AID-JCLP2>3.0.CO;2-G",
      "doi": ""
    },
    {
      "text": "Arunesh Mathur, Gunes Acar, Michael J. Friedman, Eli Lucherini, Jonathan Mayer, Marshini Chetty, and Arvind Narayanan. 2019. Dark Patterns at Scale. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–32. https://doi.org/10.1145/3359183",
      "doi": "10.1145/3359183"
    },
    {
      "text": "Jeffrey E. McGee, Mark Peterson, Stephen L. Mueller, and Jennifer M. Sequeira. 2009. Entrepreneurial Self–Efficacy: Refining the Measure. Entrepreneurship Theory and Practice 33, 4 (2009), 965–988. https://doi.org/10.1111/j.1540-6520.2009.00304.x",
      "doi": ""
    },
    {
      "text": "Tanya McGill and Nik Thompson. 2018. Gender Differences in Information Security Perceptions and Behaviour. In Australasian Conference on Information Systems 2018. University of Technology, Sydney, Australia, Sydney, Australia. https://doi.org/10.5130/acis2018.co",
      "doi": ""
    },
    {
      "text": "Diana Mîndrilă. 2010. Maximum Likelihood (ML) and Diagonally Weighted Least Squares (DWLS) Estimation Procedures: A Comparison of Estimation Bias with Ordinal and Multivariate Non-Normal Data. International Journal of Digital Society 1, 1 (2010), 60–66.",
      "doi": ""
    },
    {
      "text": "Erica M. Mitchell. 2020. Cyber Security at Home: The Effect of Home User Perceptions of Personal Security Performance on Household IoT Security Intentions: Dissertation. ProQuest LLC, Ann Arbor, MI, USA.",
      "doi": ""
    },
    {
      "text": "Helfried Moosbrugger and Augustin Kelava (Eds.). 2020. Testtheorie und Fragebogenkonstruktion. Springer, Berlin, Heidelberg, Germany. https://doi.org/10.1007/978-3-662-61532-4",
      "doi": ""
    },
    {
      "text": "Lily Hay Newman. 2016. The Botnet That Broke the Internet Isn’t Going Away. https://www.wired.com/2016/12/botnet-broke-internet-isnt-going-away/",
      "doi": ""
    },
    {
      "text": "Patricia A. Norberg, Daniel R. Horne, and David A. Horne. 2007. The Privacy Paradox: Personal Information Disclosure Intentions versus Behaviors. Journal of Consumer Affairs 41, 1 (2007), 100–126. https://doi.org/10.1111/j.1745-6606.2006.00070.x",
      "doi": ""
    },
    {
      "text": "Amy Orben and Daniël Lakens. 2020. Crud (Re)Defined. Advances in Methods and Practices in Psychological Science 3, 2(2020), 238–247. https://doi.org/10.1177/2515245920917961 arXiv:https://doi.org/10.1177/2515245920917961PMID: 33103054.",
      "doi": ""
    },
    {
      "text": "Dorottya Papp, Kristóf Tamás, and Levente Buttyán. 2019. IoT Hacking – A Primer. Infocommunications journal 6, 2 (2019), 2–13. https://doi.org/10.36244/ICJ.2019.2.1",
      "doi": ""
    },
    {
      "text": "Delroy L. Paulhus. 1991. Measurement and Control of Response Bias. In Measures of personality and social psychological attitudes, John P. Robinson, Phillip R. Shaver, and Lawrence S. Wrightsman (Eds.). Academic Press, San Diego, CA, USA, 17–59. https://doi.org/10.1016/B978-0-12-590241-0.50006-X",
      "doi": ""
    },
    {
      "text": "Robert A. Peterson. 2000. A Meta-Analysis of Variance Accounted for and Factor Loadings in Exploratory Factor Analysis. Marketing Letters 11, 3 (2000), 261–275.",
      "doi": ""
    },
    {
      "text": "Hiep Cong Pham, Linda Brennan, and Steven Furnell. 2019. Information security burnout: Identification of sources and mitigating factors from security demands and resources. Journal of Information Security and Applications 46 (2019), 96–107. https://doi.org/10.1016/j. jisa.2019.03.012",
      "doi": ""
    },
    {
      "text": "Robert Pinka. 2021. Synthetic Deliberation: Can Emulated Imagination Enhance Machine Ethics?Minds and Machines 31, 1 (2021), 121–136. https://doi.org/10.1007/s11023-020-09531-w",
      "doi": "10.1007/s11023-020-09531-w"
    },
    {
      "text": "William James Popham. 1978. Criterion-referenced measurement. Prentice-Hall, Englewood Cliffs, NJ, USA.",
      "doi": ""
    },
    {
      "text": "William T. Powers. 1991. Comment on Bandura’s “human agency.”. American Psychologist 46, 2 (1991), 151–153. https://doi.org/10.1037/0003-066X.46.2.151.b",
      "doi": ""
    },
    {
      "text": "Tenko. Raykov and George A. Marcoulides. 2011. Introduction to psychometric theory. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Byron Reeves and Clifford Nass. 1996. The media equation: How people treat computers, television, and new media like real people. Cambridge University Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Hyeun-Suk Rhee, Cheongtag Kim, and Young U. Ryu. 2009. Self-efficacy in information security: Its influence on end users’ information security practice behavior. Computers & Security 28, 8 (2009), 816–826. https://doi.org/10.1016/j. cose.2009.05.008",
      "doi": ""
    },
    {
      "text": "Morris Rosenberg. 1965. Rosenberg self-esteem scale (RSE). Acceptance and commitment therapy. Measures package 61, 52 (1965), 18.",
      "doi": ""
    },
    {
      "text": "Morris Rosenberg. 1979. Conceiving the Self. Basic Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Regner Sabillon, Jordi Serra-Ruiz, Victor Cavaller, and Jeimy J. Cano M. 2021. An Effective Cybersecurity Training Model to Support an Organizational Awareness Program. In Research anthology on artificial intelligence applications in security, Information Resources Management Association (Ed.). IGI Global, Hershey, PA, USA, 174–188. https://doi.org/10.4018/978-1-7998-7705-9.ch008",
      "doi": ""
    },
    {
      "text": "M. Angela Sasse, Jonas Hielscher, Jennifer Friedauer, and Annalina Buckmann. 2022. Rebooting IT-Security: How Organisations Can Encourage and Sustain Secure Behaviours. In 27th European Symposium on Research in Computer Security. Springer, Copenhagen, Denmark, 1–18.",
      "doi": ""
    },
    {
      "text": "Sergio Sayago, Barbara Barbosa Neves, and Benjamin R. Cowan. 2019. Voice assistants and older people. In Proceedings of the 1st International Conference on Conversational User Interfaces(ACM Digital Library), Benjamin R. Cowan (Ed.). Association for Computing Machinery, New York, NY, USA, 1–3. https://doi.org/10.1145/3342775.3342803",
      "doi": "10.1145/3342775.3342803"
    },
    {
      "text": "Michael F. Scheier and Charles S. Carver. 1985. Optimism, coping, and health: Assessment and implications of generalized outcome expectancies. Health Psychology 4, 3 (1985), 219–247. https://doi.org/10.1037/0278-6133.4.3.219",
      "doi": ""
    },
    {
      "text": "Michael F. Scheier, Charles S. Carver, and Michael W. Bridges. 1994. Distinguishing optimism from neuroticism (and trait anxiety, self-mastery, and self-esteem): A reevaluation of the Life Orientation Test. Journal of Personality and Social Psychology 67, 6(1994), 1063–1078. https://doi.org/10.1037/0022-3514.67.6.1063",
      "doi": ""
    },
    {
      "text": "Michael F. Scheier, Charles S. Carver, and Michael W. Bridges. 2002. Optimism, pessimism, and psychological well-being. In Optimism & pessimism, Edward C. Chang and Edward Chin-Ho Chang (Eds.). American Psychological Association, Washington, D.C., USA, 189–216. https://doi.org/10.1037/10385-009",
      "doi": ""
    },
    {
      "text": "Inger Schou-Bredal, Trond Heir, Laila Skogstad, Tore Bonsaksen, Anners Lerdal, Tine Grimholt, and Øivind Ekeberg. 2017. Population-based norms of the Life Orientation Test-Revised (LOT-R). International journal of clinical and health psychology : IJCHP 17, 3(2017), 216–224. https://doi.org/10.1016/j. ijchp.2017.07.005",
      "doi": ""
    },
    {
      "text": "Ahmad Bakhtiyari Shahri, Zuraini Ismail, and Shahram Mohanna. 2016. The Impact of the Security Competency on \"Self-Efficacy in Information Security\" for Effective Health Information Security in Iran. Journal of medical systems 40, 11 (2016), 241. https://doi.org/10.1007/s10916-016-0591-5",
      "doi": "10.1007/s10916-016-0591-5"
    },
    {
      "text": "Hawal Shamon and Carl Clemens Berning. 2020. Attention Check Items and Instructions in Online Surveys: Boon or Bane for Data Quality?Survey Research Methods 14, 1 (2020), 55–77. https://doi.org/10.18148/srm/2020.v14i1.7374",
      "doi": ""
    },
    {
      "text": "Mark Sherer, James E. Maddux, Blaise Mercandante, Steven Prentice-Dunn, Beth Jacobs, and Ronald W. Rogers. 1982. The Self-Efficacy Scale: Construction and Validation. Psychological Reports 51, 2 (1982), 663–671. https://doi.org/10.2466/pr0.1982.51.2.663",
      "doi": ""
    },
    {
      "text": "Katherine P. Strater and Heather Richter Lipford. 2008. Strategies and Struggles with Privacy in an Online Social Networking Community. In People and Computers XXII Culture, Creativity, Interaction (HCI)(Electronic Workshops in Computing). BCS Learning & Development, Liverpool, UK, 111–119. https://doi.org/10.14236/ewic/HCI2008.11",
      "doi": ""
    },
    {
      "text": "Hyewon Suh, Nina Shahriaree, Eric B. Hekler, and Julie A. Kientz. 2016. Developing and Validating the User Burden Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(ACM Digital Library), Jofish Kaye (Ed.). ACM, New York, NY, USA, 3988–3999. https://doi.org/10.1145/2858036.2858448",
      "doi": "10.1145/2858036.2858448"
    },
    {
      "text": "Yan Sun and Reenay Rogers. 2021. Development and validation of the Online Learning Self-efficacy Scale (OLSS): A structural equation modeling approach. American Journal of Distance Education 35, 3 (2021), 184–199. https://doi.org/10.1080/08923647.2020.1831357",
      "doi": ""
    },
    {
      "text": "Ahn Sungyong. 2021. Symmetrifying Smart Home: Topological Power and the New Governmentality of the Internet of Things. Media Theory 5, 1 (2021), 89–114.",
      "doi": ""
    },
    {
      "text": "Wei Tang, Ying Cui, and Oksana Babenko. 2014. Internal Consistency: Do We Really Know What It Is and How to Assess It?Journal of Psychology and Behavioral Science 2, 2 (2014), 205–220.",
      "doi": ""
    },
    {
      "text": "Robert L. Thorndike and Elizabeth P. Hagen. 1977. Measurement and evaluation in education and psychology (4 ed.). Wiley, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Italo Trizano-Hermosilla and Jesús M. Alvarado. 2016. Best Alternatives to Cronbach’s Alpha Reliability in Realistic Conditions: Congeneric and Asymmetrical Measurements. Frontiers in psychology 7 (2016), 769. https://doi.org/10.3389/fpsyg.2016.00769",
      "doi": ""
    },
    {
      "text": "Emily L. Tuthill, Jacqueline M. McGrath, Melanie Graber, Regina M. Cusson, and Sera L. Young. 2016. Breastfeeding Self-efficacy: A Critical Review of Available Instruments. Journal of human lactation 32, 1 (2016), 35–45. https://doi.org/10.1177/0890334415599533",
      "doi": ""
    },
    {
      "text": "Anna-Sophie Ulfert-Blank and Isabelle Schmidt. 2022. Assessing digital self-efficacy: Review and scale development. Computers & Education 191, 1 (2022), 104626. https://doi.org/10.1016/j. compedu.2022.104626",
      "doi": ""
    },
    {
      "text": "Tommy van Steen and Julia R. A. Deeleman. 2021. Successful Gamification of Cybersecurity Training. Cyberpsychology, behavior and social networking 24, 9(2021), 593–598. https://doi.org/10.1089/cyber.2020.0526",
      "doi": ""
    },
    {
      "text": "Silas Formunyuy Verkijika. 2019. “If you know what to do, will you take action to avoid mobile phishing attacks”: Self-efficacy, anticipated regret, and gender. Computers in Human Behavior 101 (2019), 286–296. https://doi.org/10.1016/j.chb.2019.07.034",
      "doi": ""
    },
    {
      "text": "Neil Vigdor. 2019. Somebody’s Watching: Hackers Breach Ring Home Security Cameras. https://www.nytimes.com/2019/12/15/us/Hacked-ring-home-security-cameras.html",
      "doi": ""
    },
    {
      "text": "Daniel Votipka, Desiree Abrokwa, and Michelle L. Mazurek. 2020. Building and Validating a Scale for Secure Software Development Self-Efficacy. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(ACM Digital Library), Regina Bernhaupt (Ed.). Association for Computing Machinery, New York, NY, USA, 1–20. https://doi.org/10.1145/3313831.3376754",
      "doi": "10.1145/3313831.3376754"
    },
    {
      "text": "Aaron C. Weidman, Conor M. Steckler, and Jessica L. Tracy. 2017. The jingle and jangle of emotion assessment: Imprecise measurement, casual scale usage, and conceptual fuzziness in emotion research. Emotion 17, 2 (2017), 267–295. https://doi.org/10.1037/emo0000226",
      "doi": ""
    },
    {
      "text": "Maor Weinberger, Maayan Zhitomirsky-Geffet, and Dan Bouhnik. 2017. Factors affecting users’ online privacy literacy among students in Israel. Online Information Review 41, 5 (2017), 655–671. https://doi.org/10.1108/OIR-05-2016-0127",
      "doi": ""
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Oriana Rosata Mcdonough, and Yang Wang. 2019. Privacy Perceptions and Designs of Bystanders in Smart Homes. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24. https://doi.org/10.1145/3359161",
      "doi": "10.1145/3359161"
    },
    {
      "text": "Seounmi Youn. 2009. Determinants of Online Privacy Concern and Its Influence on Privacy Protection Behaviors Among Young Adolescents. Journal of Consumer Affairs 43, 3 (2009), 389–418. https://doi.org/10.1111/j.1745-6606.2009.01146.x",
      "doi": ""
    },
    {
      "text": "Ross McD Young, Tian P. S. Oei, and Gabrielle M. Crook. 1991. Development of a drinking self-efficacy questionnaire. Journal of Psychopathology and Behavioral Assessment 13, 1(1991), 1–15. https://doi.org/10.1007/BF00960735",
      "doi": ""
    },
    {
      "text": "Brahim Zarouali, Karolien Poels, Koen Ponnet, and Michel Walrave. 2018. “Everything under control?”: Privacy control salience influences both critical processing and perceived persuasiveness of targeted advertising among adolescents. Cyberpsychology Journal of Psychosocial Research on Cyberspace 12, 1(2018), 5. https://doi.org/10.5817/cp2018-1-5",
      "doi": ""
    },
    {
      "text": "Eric Zeng, Shrirang Mare, and Franziska Roesner. 2017. End User Security & Privacy Concerns with Smart Homes. In USENIX Symposium on Usable Privacy and Security (SOUPS) 2017(SOUPS ’17). USENIX Association, USA, 65–80.",
      "doi": ""
    },
    {
      "text": "Serena Zheng, Noah Apthorpe, Marshini Chetty, and Nick Feamster. 2018. User Perceptions of Smart Home IoT Privacy. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–20. https://doi.org/10.1145/3274469",
      "doi": "10.1145/3274469"
    }
  ]
}