{
  "doi": "10.1145/3544548.3581306",
  "title": "Towards a Metaverse Workspace: Opportunities, Challenges, and Design Implications",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [],
  "abstract": "Both enterprises and their employees have globally experienced remote work at an unprecedented scale since the outbreak of COVID-19. As the pandemic becomes less of a threat, some companies have called their employees back to a physical office, citing issues related to working remotely, but many employees have refused to return. Thus, working in the metaverse has gained much attention as an alternative that could complement the weaknesses of completely remote work or even offline work. However, we do not know yet what benefits and drawbacks the metaverse has as a legitimate workspace, because there are few real cases of 1) working in the metaverse and 2) working remotely at such an unprecedented scale. Thus, this paper aims to identify real challenges and opportunities the metaverse workspace presents when compared to remote work by conducting semi-structured interviews and participatory workshops with various employees and company stakeholders (e.g., HR managers and CEOs) who have experienced at least two of three work types: working in a physical office, remotely, or in the metaverse. Consequently, we identified 1) advantages and disadvantages of remote work and 2) opportunities and challenges of the metaverse. We further discuss design implications that may overcome the identified challenges of working in the metaverse.",
  "authors": [
    {
      "name": "Hyanghee Park",
      "institution": "Human-Computer Interaction+Design Lab., Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659063493",
      "orcid": "0000-0002-4607-2988"
    },
    {
      "name": "Daehwan Ahn",
      "institution": "Department of Financial Planning, Housing and Consumer Economics, University of Georgia, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783822",
      "orcid": "0000-0002-0886-6381"
    },
    {
      "name": "Joonhwan Lee",
      "institution": "Human-Computer Interaction+Design Lab., Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502746040",
      "orcid": "0000-0002-3115-4024"
    }
  ],
  "references": [
    {
      "text": "Balazs Aczel, Marton Kovacs, Tanja van der Lippe, and Barnabas Szaszi. 2021. Researchers working from home: Benefits and challenges. PLOS ONE 16, 3: e0249127. https://doi.org/10.1371/journal.pone.0249127",
      "doi": ""
    },
    {
      "text": "Yoana Ahmetoglu, Anna L Cox, and Duncan P Brumby. A Longitudinal Interview Study on Work Planning During COVID-19 Lockdown. 10.",
      "doi": ""
    },
    {
      "text": "Tammy D. Allen, Timothy D. Golden, and Kristen M. Shockley. 2015. How Effective Is Telecommuting? Assessing the Status of Our Scientific Findings. Psychological Science in the Public Interest 16, 2: 40–68. https://doi.org/10.1177/1529100615593273",
      "doi": ""
    },
    {
      "text": "Diane E. Bailey and Nancy B. Kurland. 2002. A review of telework research: findings, new directions, and lessons for the study of modern work. Journal of Organizational Behavior 23, 4: 383–400. https://doi.org/10.1002/job.144",
      "doi": ""
    },
    {
      "text": "Gary Bente. 2008. Avatar-Mediated Networking: Increasing Social Presence and Interpersonal Trust in Net-Based Collaborations. Human Communication Research: 37.",
      "doi": ""
    },
    {
      "text": "Verena Biener, Snehanjali Kalamkar, Negar Nouri, Eyal Ofek, Michel Pahud, John J. Dudley, Jinghui Hu, Per Ola Kristensson, Maheshya Weerasinghe, Klen Čopič Pucihar, Matjaž Kljun, Stephan Streuber, and Jens Grubert. 2022. Quantifying the Effects of Working in VR for One Week. Retrieved July 18, 2022 from http://arxiv.org/abs/2206.03189",
      "doi": ""
    },
    {
      "text": "Anna Bleakley, Daniel Rough, Justin Edwards, Philip Doyle, Odile Dumbleton, Leigh Clark, Sean Rintel, Vincent Wade, and Benjamin R. Cowan. 2021. Bridging social distance during social distancing: exploring social talk and remote collegiality in video conferencing. Human–Computer Interaction 0, 0: 1–29. https://doi.org/10.1080/07370024.2021.1994859",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2013. Successful qualitative research: A practical guide for beginners. sage.",
      "doi": ""
    },
    {
      "text": "Carrie J Cai, Michelle Carney, Nida Zada, and Michael Terry. 2021. Breakdowns and Breakthroughs: Observing Musicians’ Responses to the COVID-19 Pandemic. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3411764.3445192",
      "doi": "10.1145/3411764.3445192"
    },
    {
      "text": "Wayne F. Cascio. 2000. Managing a virtual workplace. Academy of Management Perspectives 14, 3: 81–90.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Liska Belgrave. 2012. Qualitative interviewing and grounded theory analysis. The SAGE handbook of interview research: The complexity of the craft 2: 347–365.",
      "doi": ""
    },
    {
      "text": "Janghee Cho, Samuel Beck, and Stephen Voida. 2022. Topophilia, Placemaking, and Boundary Work: Exploring the Psycho-Social Impact of the COVID-19 Work-From-Home Experience. Proceedings of the ACM on Human-Computer Interaction 6, GROUP: 1–33. https://doi.org/10.1145/3492843",
      "doi": "10.1145/3492843"
    },
    {
      "text": "Hyoung-Yong Choi. 2022. Working in the Metaverse: Does Telework in a Metaverse Office Have the Potential to Reduce Population Pressure in Megacities? Evidence from Young Adults in Seoul, South Korea. Sustainability 14, 6: 3629. https://doi.org/10.3390/su14063629",
      "doi": ""
    },
    {
      "text": "John W. Creswell and Cheryl N. Poth. 2016. Qualitative inquiry and research design: Choosing among five approaches. Sage publications.",
      "doi": ""
    },
    {
      "text": "Daniel Thomas. 2021. Facebook changes its name to Meta in major rebrand. BBC News. Retrieved September 13, 2022 from https://www.bbc.com/news/technology-59083601",
      "doi": ""
    },
    {
      "text": "Dahyar Daraba, Hillman Wirawan, Rudi Salam, and Muhammad Faisal. 2021. Working from home during the corona pandemic: Investigating the role of authentic leadership, psychological capital, and gender on employee performance. Cogent Business & Management 8, 1: 1885573. https://doi.org/10.1080/23311975.2021.1885573",
      "doi": ""
    },
    {
      "text": "Vittorio Di Martino and Linda Wirth. 1990. Telework: A New Way of Working and Living. International Labour Review 129, 5: 529–554.",
      "doi": ""
    },
    {
      "text": "Drew DeSilver. 2020. Working from home was a luxury for the relatively affluent before coronavirus - not any more. World Economic Forum. Retrieved September 1, 2022 from https://www.weforum.org/agenda/2020/03/working-from-home-coronavirus-workers-future-of-work/",
      "doi": ""
    },
    {
      "text": "Thomas Erickson, N. Sadat Shami, Wendy A. Kellogg, and David W. Levine. 2011. Synchronous interaction among hundreds: an evaluation of a conference in an avatar-based virtual environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), 503–512. https://doi.org/10.1145/1978942.1979013",
      "doi": "10.1145/1978942.1979013"
    },
    {
      "text": "Steven Feiner, Blair MacIntyre, Marcus Haupt, and Eliot Solomon. 1993. Windows on the world: 2D windows for 3D augmented reality. In Proceedings of the 6th annual ACM symposium on User interface software and technology (UIST ’93), 145–155. https://doi.org/10.1145/168642.168657",
      "doi": "10.1145/168642.168657"
    },
    {
      "text": "Alan Felstead and Golo Henseke. 2017. Assessing the growth of remote working and its consequences for effort, well-being and work-life balance. New Technology, Work and Employment 32, 3: 195–212. https://doi.org/10.1111/ntwe.12097",
      "doi": ""
    },
    {
      "text": "Nadia Fereydooni and Bruce N Walker. Virtual Reality as a Remote Workspace Platform: Opportunities and Challenges. 8.",
      "doi": ""
    },
    {
      "text": "Kathryn L. Fonner and Lara C. Stache. 2012. All in a day's work, at home: teleworkers’ management of micro role transitions and the work–home boundary. New Technology, Work and Employment 27, 3: 242–257. https://doi.org/10.1111/j.1468-005X.2012.00290.x",
      "doi": ""
    },
    {
      "text": "Mark Granovetter. 1983. The Strength of Weak Ties: A Network Theory Revisited. Sociological Theory 1: 201–233. https://doi.org/10.2307/202051",
      "doi": ""
    },
    {
      "text": "Christine A. Grant, Louise M. Wallace, and Peter C. Spurgeon. 2013. An exploration of the psychological factors affecting remote e‐worker's job effectiveness, well‐being and work‐life balance. Employee Relations 35, 5: 527–546. https://doi.org/10.1108/ER-08-2012-0059",
      "doi": ""
    },
    {
      "text": "Gunnar Harboe and Elaine M. Huang. 2015. Real-World Affinity Diagramming Practices: Bridging the Paper-Digital Gap. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 95–104. https://doi.org/10.1145/2702123.2702561",
      "doi": "10.1145/2702123.2702561"
    },
    {
      "text": "E. Jeffrey Hill, Alan J. Hawkins, and Brent C. Miller. 1996. Work and Family in the Virtual Office: Perceived Influences of Mobile Telework. Family Relations 45, 3: 293–301. https://doi.org/10.2307/585501",
      "doi": ""
    },
    {
      "text": "Erzhen Hu, Md Aashikur Rahman Azim, and Seongkook Heo. 2022. FluidMeet: Enabling Frictionless Transitions Between In-Group, Between-Group, and Private Conversations During Virtual Breakout Meetings. In CHI Conference on Human Factors in Computing Systems, 1–17. https://doi.org/10.1145/3491102.3517558",
      "doi": "10.1145/3491102.3517558"
    },
    {
      "text": "Xinlan Emily Hu, Rebecca Hinds, Melissa Valentine, and Michael S. Bernstein. 2022. A\" Distance Matters\" Paradox: Facilitating Intra-Team Collaboration Can Harm Inter-Team Collaboration. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1: 1–36.",
      "doi": ""
    },
    {
      "text": "Youjin Hwang, Donghoon Shin, Jinsu Eun, Bongwon Suh, and Joonhwan Lee. 2021. Design Guidelines of a Computer-Based Intervention for Computer Vision Syndrome: Focus Group Study and Real-World Deployment. Journal of Medical Internet Research 23, 3: e22099. https://doi.org/10.2196/22099",
      "doi": ""
    },
    {
      "text": "Anne Kaduk, Katie Genadek, Erin L. Kelly, and Phyllis Moen. 2019. Involuntary vs. voluntary flexible work: insights for scholars and stakeholders. Community, Work & Family 22, 4: 412–442. https://doi.org/10.1080/13668803.2019.1616532",
      "doi": ""
    },
    {
      "text": "Yoojung Kim, Arpita Bhattacharya, Julie A. Kientz, and Jin Ha Lee. 2020. “It Should Be a Game for Fun, Not Exercise”: Tensions in Designing Health-Related Features for Pokémon GO. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–13. https://doi.org/10.1145/3313831.3376830",
      "doi": "10.1145/3313831.3376830"
    },
    {
      "text": "Kathrin Kirchner, Christine Ipsen, and John Paulin Hansen. 2021. COVID-19 leadership challenges in knowledge work. Knowledge Management Research & Practice 19, 4: 493–500.",
      "doi": ""
    },
    {
      "text": "Benjamin Koehne, Patrick C. Shih, and Judith S. Olson. 2012. Remote and alone: coping with being the remote member on the team. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work - CSCW ’12, 1257. https://doi.org/10.1145/2145204.2145393",
      "doi": "10.1145/2145204.2145393"
    },
    {
      "text": "Udo Konradt, Guido Hertel, and Renate Schmook. 2003. Quality of management by objectives, task-related stressors, and non-task-related stressors as predictors of stress and job satisfaction among teleworkers. European Journal of Work and Organizational Psychology 12, 1: 61–79. https://doi.org/10.1080/13594320344000020",
      "doi": ""
    },
    {
      "text": "Ellen Ernst Kossek and Brenda A. Lautsch. 2018. Work–life flexibility for whom? Occupational status and work–life inequality in upper, middle, and lower level jobs. Academy of Management Annals 12, 1: 5–36.",
      "doi": ""
    },
    {
      "text": "Laurent M. Lapierre, Elianne F. van Steenbergen, Maria C. W. Peeters, and Esther S. Kluwer. 2016. Juggling work and family responsibilities when involuntarily working more from home: A multiwave study of financial sales professionals. Journal of Organizational Behavior 37, 6: 804–822. https://doi.org/10.1002/job.2075",
      "doi": ""
    },
    {
      "text": "Lik-Hang Lee, Tristan Braud, Pengyuan Zhou, Lin Wang, Dianlei Xu, Zijun Lin, Abhishek Kumar, Carlos Bermejo, and Pan Hui. 2021. All One Needs to Know about Metaverse: A Complete Survey on Technological Singularity, Virtual Ecosystem, and Research Agenda. arXiv:2110.05352 [cs]. Retrieved October 31, 2021 from http://arxiv.org/abs/2110.05352",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee. 2018. Understanding perception of algorithmic decisions: Fairness, trust, and emotion in response to algorithmic management. Big Data & Society 5, 1: 205395171875668. https://doi.org/10.1177/2053951718756684",
      "doi": ""
    },
    {
      "text": "Minha Lee, Wonyoung Park, Sunok Lee, and Sangsu Lee. 2022. Distracting Moments in Videoconferencing: A Look Back at the Pandemic Period. In CHI Conference on Human Factors in Computing Systems, 1–21. https://doi.org/10.1145/3491102.3517545",
      "doi": "10.1145/3491102.3517545"
    },
    {
      "text": "Q. Vera Liao, Werner Geyer, Muhammed Mas-ud Hussain, Praveen Chandar, Matthew Davis, Yasaman Khazaeni, Marco Patricio Crasso, Dakuo Wang, Michael Muller, and N. Sadat Shami. 2018. All Work and No Play? In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, 1–13. https://doi.org/10.1145/3173574.3173577",
      "doi": "10.1145/3173574.3173577"
    },
    {
      "text": "Yuhan Luo, Bongshin Lee, Donghee Yvette Wohn, Amanda L. Rebar, David E. Conroy, and Eun Kyoung Choe. 2018. Time for Break: Understanding Information Workers’ Sedentary Behavior Through a Break Prompting System. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3173574.3173701",
      "doi": "10.1145/3173574.3173701"
    },
    {
      "text": "Jon C. Messenger and Lutz Gschwind. 2016. Three generations of Telework: New ICTs and the (R)evolution from Home Office to Virtual Office. New Technology, Work and Employment 31, 3: 195–208. https://doi.org/10.1111/ntwe.12073",
      "doi": ""
    },
    {
      "text": "Gary M. Olson and Judith S. Olson. 2000. Distance Matters. Human–Computer Interaction 15, 2–3: 139–178. https://doi.org/10.1207/S15327051HCI1523_4",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Hyanghee Park, Daehwan Ahn, Kartik Hosanagar, and Joonhwan Lee. 2021. Human-AI Interaction in Human Resource Management: Understanding Why Employees Resist Algorithmic Evaluation at Workplaces and How to Mitigate Burdens. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–15. https://doi.org/10.1145/3411764.3445304",
      "doi": "10.1145/3411764.3445304"
    },
    {
      "text": "Hyanghee Park, Daehwan Ahn, Kartik Hosanagar, and Joonhwan Lee. 2022. Designing Fair AI in Human Resource Management: Understanding Tensions Surrounding Algorithmic Evaluation and Envisioning Stakeholder-Centered Solutions. In CHI Conference on Human Factors in Computing Systems (CHI ’22), 1–22. https://doi.org/10.1145/3491102.3517672",
      "doi": "10.1145/3491102.3517672"
    },
    {
      "text": "Sang-Min Park and Young-Gab Kim. 2022. A Metaverse: Taxonomy, Components, Applications, and Open Challenges. IEEE Access 10: 4209–4251. https://doi.org/10.1109/ACCESS.2021.3140175",
      "doi": ""
    },
    {
      "text": "Kim Parker, Juliana Menasce Horowitz, and Rachel Minkin. 2022. COVID-19 Pandemic Continues To Reshape Work in America. Pew Research Center's Social & Demographic Trends Project. Retrieved September 5, 2022 from https://www.pewresearch.org/social-trends/2022/02/16/covid-19-pandemic-continues-to-reshape-work-in-america/",
      "doi": ""
    },
    {
      "text": "Rachel Pelta. 2021. FlexJobs Survey Finds Remote Work Remains in Demand | FlexJobs. FlexJobs Job Search Tips and Blog. Retrieved September 5, 2022 from https://www.flexjobs.com/blog/post/flexjobs-survey-finds-employees-want-remote-work-post-pandemic/",
      "doi": ""
    },
    {
      "text": "Jeanne Sahadi. Employers take note: Most remote workers don't want to go back to the office. CNN. Retrieved September 5, 2022 from https://www.cnn.com/2022/02/16/success/pew-survey-covid-affect-on-work-from-home/index.html",
      "doi": ""
    },
    {
      "text": "Scott Schieman, Philip J. Badawy, Melissa A. Milkie, and Alex Bierman. 2021. Work-Life Conflict During the COVID-19 Pandemic. Socius 7: 2378023120982856. https://doi.org/10.1177/2378023120982856",
      "doi": ""
    },
    {
      "text": "M. Joseph Sirgy and Dong-Jin Lee. 2018. Work-life balance: An integrative review. Applied Research in Quality of Life 13, 1: 229–254.",
      "doi": ""
    },
    {
      "text": "Jaeyoon Song, Christoph Riedl, and Thomas W. Malone. 2021. Online Mingling: Supporting Ad Hoc, Private Conversations at Virtual Conferences. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–10. https://doi.org/10.1145/3411764.3445776",
      "doi": "10.1145/3411764.3445776"
    },
    {
      "text": "Frank Steinicke and Gerd Bruder. 2014. A self-experimentation report about long-term use of fully-immersive technology. In Proceedings of the 2nd ACM symposium on Spatial user interaction, 66–69. https://doi.org/10.1145/2659766.2659767",
      "doi": "10.1145/2659766.2659767"
    },
    {
      "text": "John P. Trougakos, Nitya Chawla, and Julie M. McCarthy. 2020. Working in a pandemic: Exploring the impact of COVID-19 health anxiety on work, family, and health outcomes. Journal of Applied Psychology 105, 11: 1234–1245. https://doi.org/10.1037/apl0000739",
      "doi": ""
    },
    {
      "text": "Emily Tseng, Diana Freed, Kristen Engel, Thomas Ristenpart, and Nicola Dell. 2021. A Digital Safety Dilemma: Analysis of Computer-Mediated Computer Security Interventions for Intimate Partner Violence During COVID-19. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–17. https://doi.org/10.1145/3411764.3445589",
      "doi": "10.1145/3411764.3445589"
    },
    {
      "text": "Vassileios Vescoukis, Anastasia Stratigea, and Maria Giaoutzi. 2012. Teleworking: From a technology potential to a social evolution. Regional Science Inquiry 4, 3: 37–50.",
      "doi": ""
    },
    {
      "text": "Lena Waizenegger, Brad McKenna, Wenjie Cai, and Taino Bendz. 2020. An affordance perspective of team collaboration and enforced working from home during COVID-19. European Journal of Information Systems 29, 4: 429–442.",
      "doi": ""
    },
    {
      "text": "Bin Wang, Yukun Liu, Jing Qian, and Sharon K. Parker. 2021. Achieving Effective Remote Working During the COVID-19 Pandemic: A Work Design Perspective. Applied Psychology 70, 1: 16–59. https://doi.org/10.1111/apps.12290",
      "doi": ""
    },
    {
      "text": "Theo Wayt. 2022. Apple engineer who quit over return-to-office policy joins Google. New York Post. Retrieved September 13, 2022 from https://nypost.com/2022/05/18/apple-engineer-who-quit-over-return-to-office-policy-joins-google/",
      "doi": ""
    },
    {
      "text": "Steve Whittaker. 2005. Supporting Collaborative Task Management in E-mail. Human–Computer Interaction 20, 1–2: 49–88. https://doi.org/10.1080/07370024.2005.9667361",
      "doi": ""
    },
    {
      "text": "Elizabeth Wilhoit Larson. 2021. Creating home at work: humanistic geography and placemaking in organizations. Culture and Organization 27, 6: 437–455. https://doi.org/10.1080/14759551.2020.1861453",
      "doi": ""
    },
    {
      "text": "John R. Wilson and Mirabelle D'Cruz. 2006. Virtual and interactive environments for work of the future. International Journal of Human-Computer Studies 64, 3: 158–169. https://doi.org/10.1016/j.ijhcs.2005.08.007",
      "doi": "10.1016/j.ijhcs.2005.08.007"
    },
    {
      "text": "Longqi Yang, David Holtz, Sonia Jaffe, Siddharth Suri, Shilpi Sinha, Jeffrey Weston, Connor Joyce, Neha Shah, Kevin Sherman, Brent Hecht, and Jaime Teevan. 2022. The effects of remote work on collaboration among information workers. Nature Human Behaviour 6, 1: 43–54. https://doi.org/10.1038/s41562-021-01196-4",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Xin Gao, Allison Marie Hishikawa, Alexis Lim, Laura Meng, Romaine Flor Ofiana, Justin Park, and Alexis Hiniker. 2019. Laughing is Scary, but Farting is Cute: A Conceptual Model of Children's Perspectives of Creepy Technologies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, 1–15. https://doi.org/10.1145/3290605.3300303",
      "doi": "10.1145/3290605.3300303"
    },
    {
      "text": "2021. Can We Work in the Metaverse? UC Today. Retrieved July 18, 2022 from https://www.uctoday.com/collaboration/can-we-work-in-the-metaverse/",
      "doi": ""
    },
    {
      "text": "2022. 25 Companies Offering Interns Top Dollar Pay in 2022 - Glassdoor. Glassdoor Economic Research. Retrieved July 19, 2022 from https://www.glassdoor.com/research/highest-paying-internships-2022/",
      "doi": ""
    },
    {
      "text": "PwC's US Remote Work Survey (2020). Retrieved from https://www.pwc.com/us/en/library/covid-19/assets/pwc-return-to-work-survey.pdf",
      "doi": ""
    },
    {
      "text": "Microsoft Mesh (Preview) overview. Retrieved July 19, 2022 from https://docs.microsoft.com/en-us/mesh/overview",
      "doi": ""
    },
    {
      "text": "Metaverse: Open for business? MIT Technology Review. Retrieved July 19, 2022 from https://www.technologyreview.com/2022/06/27/1054974/metaverse-open-for-business/",
      "doi": ""
    },
    {
      "text": "Metaverse Roadmap Overview. Retrieved September 3, 2022 from https://www.metaverseroadmap.org/overview/",
      "doi": ""
    }
  ]
}