{
  "doi": "10.1145/3544548.3580937",
  "title": "Virtual Collaboration Tools for Mixed-Ability Workspaces: A Cross Disability Solidarity Case from Turkey",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2023,
  "badges": [],
  "abstract": "A growing body of literature on mixed-ability teams within HCI investigates how disabled and non-disabled people collaborate. Still, how different disabilities can interact in a mixed-ability team is underexplored, especially for long commitments and in non-western contexts. As an emerging perspective in accessibility studies in HCI, disability justice emphasizes the importance of cross-disability collaborations. Collaborative access, interdependence, and cross-disability dialogue are keys to building accessible mixed-ability interactions. We conducted ten in-depth interviews with the members of a unique mixed-ability team (which includes people with different physical disabilities) using the same workspace with cross-disability interactions in Turkey. We aim to understand the requirements for an accessible mixed-ability virtual workspace and to identify practical design considerations for cross-disability solidarity-oriented virtual collaboration tools. To ensure equal access in virtual workspaces, we suggest implications for centering collective access, balancing external power dynamics, and supporting language and cultural diversities.",
  "tags": [
    "Disability justice",
    "Mixed-Ability Teams",
    "Collaborative accessibility",
    "Cross-Disability Solidarity"
  ],
  "authors": [
    {
      "name": "Zeynep Yildiz",
      "institution": "Futurewell: Co-Creation and Wellbeing Lab, Koç University, Turkey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659442402",
      "orcid": "0000-0002-2264-3408"
    },
    {
      "name": "Ozge Subasi",
      "institution": "Futurewell: CoCreation and Wellbeing Lab, Media and Visual Arts, Koc University, Turkey",
      "img": "/do/10.1145/contrib-81421602640/rel-imgonly/ozge-subasicopy.jpg",
      "acmid": "81421602640",
      "orcid": "0000-0001-6094-1361"
    }
  ],
  "references": [
    {
      "text": "Jane Anderson, John C Bricout, and Michael D West. 2001. Telecommuting: Meeting the needs of businesses and employees with disabilities. Journal of Vocational Rehabilitation 16, 2 (2001), 97–104.",
      "doi": ""
    },
    {
      "text": "Mark S Baldwin, Sen H Hirano, Jennifer Mankoff, and Gillian R Hayes. 2019. Design in the public square: Supporting assistive technology design through public mixed-ability cooperation. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3359257"
    },
    {
      "text": "Cynthia L Bennett, Erin Brady, and Stacy M Branham. 2018. Interdependence as a frame for assistive technology research and design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 161–173.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Sanem Berkün. 2013. Ev Esaslı Uzaktan Çalışma: Bursa’da Engelli Belediye Çalışanlarının Algıları. İnsan Hakları Yıllığı 31 (2013), 15–62.",
      "doi": ""
    },
    {
      "text": "Denise A Bonebright. 2010. 40 years of storming: a historical review of Tuckman’s model of small group development. Human Resource Development International 13, 1 (2010), 111–120.",
      "doi": ""
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. Collaborative accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2373–2382.",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. The invisible work of accessibility: how blind employees manage accessibility in mixed-ability workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 163–171.",
      "doi": "10.1145/2700648.2809864"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Francesco Cafaro, Erin Brady, Sowmya Chandra, Ulka Patil, and Abhijeet Saxena. 2021. E Pluribus Unum: Using Conceptual Metaphor Theory to Explore and Support Mixed-Ability Workplaces. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–31.",
      "doi": "10.1145/3479528"
    },
    {
      "text": "Funda ÇONDUR, Aslı YENİPAZARLI, and Necmiye CÖMERTLER. 2020. ENGELLİ İSTİHDAMININ DÜNYA’DA VE TÜRKİYE’DEKİ GÖRÜNÜMÜ. Avrasya Sosyal ve Ekonomi Araştırmaları Dergisi 7, 5(2020), 347–362.",
      "doi": ""
    },
    {
      "text": "Mauro Conti, Roberto Di Pietro, Luigi V. Mancini, and Alessandro Mei. 2009. (old) Distributed data source verification in wireless sensor networks. Inf. Fusion 10, 4 (2009), 342–353. https://doi.org/10.1016/j.inffus.2009.01.002",
      "doi": "10.1016/j.inffus.2009.01.002"
    },
    {
      "text": "Clare Cullen and Oussama Metatla. 2019. Co-designing inclusive multisensory story mapping with children with mixed visual abilities. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. 361–373.",
      "doi": "10.1145/3311927.3323146"
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. \" It doesn’t win you friends\" Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": ""
    },
    {
      "text": "Maitraye Das, John Tang, Kathryn E Ringland, and Anne Marie Piper. 2021. Towards accessible remote work: Understanding work-from-home practices of neurodivergent professionals. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–30.",
      "doi": "10.1145/3449282"
    },
    {
      "text": "Martyn Edwards, Dave Darwent, and Charly Irons. 2016. That blasted facebook page: Supporting trainee-teachers professional learning through social media. ACM SIGCAS Computers and Society 45, 3 (2016), 420–426.",
      "doi": "10.1145/2874239.2874301"
    },
    {
      "text": "Elizabeth Ellcessor. 2016. Restricted access: Media, disability, and the politics of participation. Vol. 6. NYU Press.",
      "doi": ""
    },
    {
      "text": "B Aubrey Fisher. 1970. Decision emergence: Phases in group decision-making. Communications Monographs 37, 1 (1970), 53–66.",
      "doi": ""
    },
    {
      "text": "Connie JG Gersick. 1988. Time and transition in work teams: Toward a new model of group development. Academy of Management journal 31, 1 (1988), 9–41.",
      "doi": ""
    },
    {
      "text": "David Gonçalves, André Rodrigues, Mike L Richardson, Alexandra A de Sousa, Michael J Proulx, and Tiago Guerreiro. 2021. Exploring asymmetric roles in mixed-ability gaming. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445494"
    },
    {
      "text": "Aimi Hamraie. 2016. Beyond Accommodation: Disability, Feminist Philosophy, and the Design of Everyday Academic Life. Philosophia 6, 2 (2016), 259–271.",
      "doi": ""
    },
    {
      "text": "Bradford W Hesse. 1995. Curb cuts in the virtual community: Telework and persons with disabilities. In Proceedings of the Twenty-Eighth Annual Hawaii International Conference on System Sciences, Vol. 4. IEEE, 418–425.",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L Bennett. 2020. Living disability theory: Reflections on access, research, and design. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Sins Invalid. 2017. Skin, tooth, and bone–the basis of movement is our people: a disability justice primer.",
      "doi": ""
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P Bigham. 2011. Supporting blind photography. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility. 203–210.",
      "doi": "10.1145/2049536.2049573"
    },
    {
      "text": "Sooyeon Lee, Bjorn Hubert-Wallander, Molly Stevens, and John M Carroll. 2019. Understanding and designing for deaf or hard of hearing drivers on Uber. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300759"
    },
    {
      "text": "Maureen Linden and Karen Milchus. 2014. Teleworkers with disabilities: Characteristics and accommodation use. Work 47, 4 (2014), 473–483.",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Maitraye Das, Dhruv Jain, Danielle Bragg, John Tang, Andrew Begel, Erin Beneteau, Josh Urban Davis, Abraham Glasser, Joon Sung Park, 2021. Mixed Abilities and Varied Experiences: a group autoethnography of a virtual summer internship. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": "10.1145/3441852.3471199"
    },
    {
      "text": "Reeti Mathur and Erin Brady. 2018. Mixed-Ability Collaboration for Accessible Photo Sharing. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. 370–372.",
      "doi": "10.1145/3234695.3240994"
    },
    {
      "text": "Mia Mingus. 2010. Reflections from Detroit: Reflections on an opening: Disability Justice and creating collective access in Detroit. https://incite-national.org/2010/08/23/reflections-from-detroit-reflections-on-an-opening-disability-justice-and-creating-collective-access-in-detroit/",
      "doi": ""
    },
    {
      "text": "ŞEN Mustafa. 2018. Türkiye’de engellilere yönelik istihdam politikaları: sorunlar ve öneriler. SGD-Sosyal Güvenlik Dergisi 8, 2 (2018), 129–152.",
      "doi": ""
    },
    {
      "text": "Shotaro Omori and Ikuko Eguchi Yairi. 2013. Collaborative music application for visually impaired people with tangible objects on table. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. 1–2.",
      "doi": "10.1145/2513383.2513403"
    },
    {
      "text": "Leah Lakshmi Piepzna-Samarasinha. 2018. Care work: Dreaming disability justice. arsenal pulp press Vancouver.",
      "doi": ""
    },
    {
      "text": "Marshall Scott Poole and Jonelle Roth. 1989. Decision development in small groups IV: A typology of group decision paths. Human communication research 15, 3 (1989), 323–356.",
      "doi": ""
    },
    {
      "text": "Christian Siregar, Murty Magda Pane, and Yustinus Suhardi Ruman. 2018. The virtual team performance in solving teamwork conflict problems. In Proceedings of the 2018 International Conference on Distance Education and Learning. 1–5.",
      "doi": "10.1145/3231848.3231850"
    },
    {
      "text": "Katta Spiel, Kathrin Gerling, Cynthia L Bennett, Emeline Brulé, Rua M Williams, Jennifer Rode, and Jennifer Mankoff. 2020. Nothing about us without us: Investigating the role of critical disability studies in HCI. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3334480.3375150"
    },
    {
      "text": "Kevin M Storer, Tejinder K Judge, and Stacy M Branham. 2020. \" All in the Same Boat\": Tradeoffs of Voice Assistant Ownership for Mixed-Visual-Ability Families. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376225"
    },
    {
      "text": "Molly Follette Story. 2001. Principles of universal design. Universal design handbook(2001).",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research techniques. (1998).",
      "doi": ""
    },
    {
      "text": "Cella M Sum, Rahaf Alharbi, Franchesca Spektor, Cynthia L Bennett, Christina N Harrington, Katta Spiel, and Rua Mae Williams. 2022. Dreaming Disability Justice in HCI. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–5.",
      "doi": ""
    },
    {
      "text": "John Tang. 2021. Understanding the telework experience of people with disabilities. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–27.",
      "doi": "10.1145/3449104"
    },
    {
      "text": "Anja Thieme, Cynthia L Bennett, Cecily Morrison, Edward Cutrell, and Alex S Taylor. 2018. I can do everything but see!–How People with Vision Impairments Negotiate their Abilities in Social Contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 203.",
      "doi": "10.1145/3173574.3173777"
    },
    {
      "text": "Bruce W Tuckman. 1965. Developmental sequence in small groups.Psychological bulletin 63, 6 (1965), 384.",
      "doi": ""
    },
    {
      "text": "Emily Q Wang and Anne Marie Piper. 2018. Accessibility in action: Co-located collaboration among deaf and hearing professionals. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–25.",
      "doi": "10.1145/3274449"
    },
    {
      "text": "Sarah Wille and Daphne Sajous-Brady. 2018. The inclusive and accessible workplace. Commun. ACM 61, 2 (2018), 24–26.",
      "doi": "10.1145/3176410"
    },
    {
      "text": "Michele A Williams, Caroline Galbraith, Shaun K Kane, and Amy Hurst. 2014. \" just let the cane hit it\" how the blind and sighted see navigation differently. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. 217–224.",
      "doi": "10.1145/2661334.2661380"
    },
    {
      "text": "Jacob O Wobbrock. 2019. Situationally aware mobile devices for overcoming situational impairments. In Proceedings of the ACM SIGCHI Symposium on Engineering Interactive Computing Systems. ACM, 1.",
      "doi": "10.1145/3319499.3330292"
    },
    {
      "text": "Chien Wen Yuan, Benjamin V Hanrahan, Sooyeon Lee, Mary Beth Rosson, and John M Carroll. 2017. I didn’t know that you knew I knew: Collaborative shopping practices between people with visual impairment and people with vision. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–18.",
      "doi": "10.1145/3134753"
    },
    {
      "text": "Annuska Zolyomi, Anne Spencer Ross, Arpita Bhattacharya, Lauren Milne, and Sean A Munson. 2018. Values, identity, and social translucence: Neurodiverse student teams in higher education. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174073"
    }
  ]
}