{
  "doi": "10.1145/3544548.3581127",
  "title": "DRAVA: Aligning Human Concepts with Machine Learning Latent Dimensions for the Visual Exploration of Small Multiples",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Latent vectors extracted by machine learning (ML) are widely used in data exploration (e.g., t-SNE) but suffer from a lack of interpretability. While previous studies employed disentangled representation learning (DRL) to enable more interpretable exploration, they often overlooked the potential mismatches between the concepts of humans and the semantic dimensions learned by DRL. To address this issue, we propose Drava, a visual analytics system that supports users in 1) relating the concepts of humans with the semantic dimensions of DRL and identifying mismatches, 2) providing feedback to minimize the mismatches, and 3) obtaining data insights from concept-driven exploration. Drava provides a set of visualizations and interactions based on visual piles to help users understand and refine concepts and conduct concept-driven exploration. Meanwhile, Drava employs a concept adaptor model to fine-tune the semantic dimensions of DRL based on user refinement. The usefulness of Drava is demonstrated through application scenarios and experimental validation.",
  "authors": [
    {
      "name": "Qianwen Wang",
      "institution": "Biomedical Informatics, Harvard Medical School, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660288667",
      "orcid": "0000-0003-1728-4102"
    },
    {
      "name": "Sehi L'Yi",
      "institution": "Biomedical Informatics, Harvard Medical School, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658637823",
      "orcid": "0000-0001-7720-2848"
    },
    {
      "name": "Nils Gehlenborg",
      "institution": "Biomedical Informatics, Harvard Medical School, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314488890",
      "orcid": "0000-0003-0327-8297"
    }
  ],
  "references": [
    {
      "text": "Hervé Abdi and Lynne J Williams. 2010. Principal component analysis. Wiley interdisciplinary reviews: computational statistics 2, 4(2010), 433–459.",
      "doi": "10.1002/wics.101"
    },
    {
      "text": "Saleema Amershi, Maya Cakmak, William Bradley Knox, and Todd Kulesza. 2014. Power to the people: The role of humans in interactive machine learning. AI Magazine 35, 4 (2014), 105–120.",
      "doi": ""
    },
    {
      "text": "Lin An, Tao Yang, Jiahao Yang, Johannes Nuebler, Guanjue Xiang, Ross C Hardison, Qunhua Li, and Yu Zhang. 2019. OnTAD: hierarchical domain structure reveals the divergence of activity among TADs and boundaries. Genome Biology 20, 1 (2019), 1–16.",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Nathalie Henry-Riche, Tim Dwyer, Tara Madhyastha, J-D Fekete, and Thomas Grabowski. 2015. Small MultiPiles: Piling time to explore temporal patterns in dynamic networks. In Computer Graphics Forum, Vol. 34. Wiley Online Library, NJ, USA, 31–40.",
      "doi": ""
    },
    {
      "text": "Michael Behrisch, Fatih Korkmaz, Lin Shao, and Tobias Schreck. 2014. Feedback-driven interactive exploration of large multidimensional data supported by visual classifier. In 2014 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, NY, USA, 43–52.",
      "doi": ""
    },
    {
      "text": "Michael Behrisch, Robert Krueger, Fritz Lekschas, Tobias Schreck, Nils Gehlenborg, and Hanspeter Pfister. 2018. Visual Pattern-Driven Exploration of Big Data. In International Symposium on Big Data Visual and Immersive Analytics(BDVA 18). IEEE, NY, USA, 1–11.",
      "doi": ""
    },
    {
      "text": "Angie Boggust, Brandon Carter, and Arvind Satyanarayan. 2022. Embedding comparator: Visualizing differences in global structure and local neighborhoods via small multiples. In 27th International Conference on Intelligent User Interfaces. ACM, NY, USA, 746–766.",
      "doi": "10.1145/3490099.3511122"
    },
    {
      "text": "Christopher P Burgess, Irina Higgins, Arka Pal, Loic Matthey, Nick Watters, Guillaume Desjardins, and Alexander Lerchner. 2017. Understanding disentangling in beta-VAE. In International Conference on Machine Learning (ICLR). International Machine Learning Society, Sydney, Australia, 10 pages.",
      "doi": ""
    },
    {
      "text": "Tal Burt, KS Button, HHZ Thom, RJ Noveck, and Marcus R Munafò. 2017. The Burden of the “False-Negatives” in Clinical Development: Analyses of Current and Alternative Scenarios and Corrective Measures. Clinical and Translational Science 10, 6 (2017), 470–479.",
      "doi": ""
    },
    {
      "text": "Carrie J Cai, Emily Reif, Narayan Hegde, Jason Hipp, Been Kim, Daniel Smilkov, Martin Wattenberg, Fernanda Viegas, Greg S Corrado, and Martin C Stumpe. 2019. Human-centered tools for coping with imperfect algorithms during medical decision-making. In Proceedings of the 2019 CHI conference on Human Factors in Computing Systems. ACM, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300234"
    },
    {
      "text": "Ricky TQ Chen, Xuechen Li, Roger B Grosse, and David K Duvenaud. 2018. Isolating sources of disentanglement in variational autoencoders. Advances in Neural Information Processing Systems 31 (2018), 11 pages.",
      "doi": ""
    },
    {
      "text": "Xi Chen, Yan Duan, Rein Houthooft, John Schulman, Ilya Sutskever, and Pieter Abbeel. 2016. Infogan: Interpretable representation learning by information maximizing generative adversarial nets. Advances in Neural Information Processing Systems 29 (2016), 10 pages.",
      "doi": ""
    },
    {
      "text": "Furui Cheng, Mark S Keller, Huamin Qu, Nils Gehlenborg, and Qianwen Wang. 2023. Polyphony: an Interactive Transfer Learning Framework for Single-Cell Data Analysis. IEEE Transactions on Visualization and Computer Graphics 29, 1(2023), 591–601.",
      "doi": ""
    },
    {
      "text": "Zach Cutler, Kiran Gadhave, and Alexander Lex. 2020. Trrack: A library for provenance-tracking in web-based visualizations. In 2020 IEEE Visualization Conference (VIS). IEEE, NY, USA, 116–120.",
      "doi": ""
    },
    {
      "text": "Frederik L Dennig, Tom Polk, Zudi Lin, Tobias Schreck, Hanspeter Pfister, and Michael Behrisch. 2019. FDive: Learning relevance models using pattern-based similarity measures. In 2019 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, NY, USA, 69–80.",
      "doi": ""
    },
    {
      "text": "K Eckelt, A Hinterreiter, P Adelberger, C Walchshofer, V Dhanoa, C Humer, M Heckmann, C Steinparz, and M Streit. 2022. Visual Exploration of Relationships and Structure in Low-Dimensional Embeddings.. In OSF Preprint, Vol. 10.31219/osf.io/ujbrs. Open Society Foundation, SA, 15 pages.",
      "doi": ""
    },
    {
      "text": "Facebook. 2014. React.js. https://github.com/facebook/react.",
      "doi": ""
    },
    {
      "text": "Liang Gou, Lincan Zou, Nanxiang Li, Michael Hofmann, Arvind Kumar Shekar, Axel Wendt, and Liu Ren. 2020. VATLD: a visual analytics system to assess, understand and improve traffic light detection. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 261–271.",
      "doi": ""
    },
    {
      "text": "Miguel Grinberg. 2018. Flask web development: developing web applications with python. O’Reilly Media, Inc., USA.",
      "doi": ""
    },
    {
      "text": "Wenbin He, Lincan Zou, Arvind Kumar Shekar, Liang Gou, and Liu Ren. 2021. Where Can We Help? A Visual Analytics Approach to Diagnosing and Improving Semantic Segmentation of Movable Objects. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 1040–1050.",
      "doi": "10.1109/TVCG.2021.3114855"
    },
    {
      "text": "Irina Higgins, David Amos, David Pfau, Sebastien Racaniere, Loic Matthey, Danilo Rezende, and Alexander Lerchner. 2018. Towards a definition of disentangled representations. In arXiv preprint, Vol. arXiv:1812.02230. Cornell University, USA, 25 pages.",
      "doi": ""
    },
    {
      "text": "Irina Higgins, Loic Matthey, Arka Pal, Christopher Burgess, Xavier Glorot, Matthew Botvinick, Shakir Mohamed, and Alexander Lerchner. 2016. beta-vae: Learning basic visual concepts with a constrained variational framework. In International Conference on Machine Learning (ICLR). International Machine Learning Society, NY, USA, 12 pages.",
      "doi": ""
    },
    {
      "text": "Shichao Jia, Zeyu Li, Nuo Chen, and Jiawan Zhang. 2021. Towards visual explainable active learning for zero-shot classification. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 791–801.",
      "doi": "10.1109/TVCG.2021.3114793"
    },
    {
      "text": "Zhihua Jin, Yong Wang, Qianwen Wang, Yao Ming, Tengfei Ma, and Huamin Qu. 2020. GNNLens: A Visual Analytics Approach for Prediction Error Diagnosis of Graph Neural Networks. In arXiv preprint, Vol. arXiv:2011.11048. Cornell University, USA, 17 pages.",
      "doi": ""
    },
    {
      "text": "Minsuk Kahng, Pierre Y Andrews, Aditya Kalro, and Duen Horng Chau. 2017. Activis: Visual exploration of industry-scale deep neural network models. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 88–97.",
      "doi": ""
    },
    {
      "text": "Been Kim, Martin Wattenberg, Justin Gilmer, Carrie Cai, James Wexler, Fernanda Viegas, 2018. Interpretability beyond feature attribution: Quantitative testing with concept activation vectors (tcav). In International conference on machine learning. PMLR, Stockholm, Sweden, 2668–2677.",
      "doi": ""
    },
    {
      "text": "Hannah Kim, Jaegul Choo, Haesun Park, and Alex Endert. 2015. Interaxis: Steering scatterplot axes via observation-level interaction. IEEE transactions on visualization and computer graphics 22, 1(2015), 131–140.",
      "doi": ""
    },
    {
      "text": "Hyunjik Kim and Andriy Mnih. 2018. Disentangling by factorising. In International Conference on Machine Learning. PMLR, Stockholm, Sweden, 2649–2658.",
      "doi": ""
    },
    {
      "text": "Bum Chul Kwon, Hannah Kim, Emily Wall, Jaegul Choo, Haesun Park, and Alex Endert. 2016. Axisketcher: Interactive nonlinear axis mapping of visualizations through user drawings. IEEE transactions on visualization and computer graphics 23, 1(2016), 221–230.",
      "doi": ""
    },
    {
      "text": "Fritz Lekschas, Benjamin Bach, Peter Kerpedjiev, Nils Gehlenborg, and Hanspeter Pfister. 2017. HiPiler: visual exploration of large genome interaction matrices with interactive small multiples. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 522–531.",
      "doi": ""
    },
    {
      "text": "Fritz Lekschas, Michael Behrisch, Benjamin Bach, Peter Kerpedjiev, Nils Gehlenborg, and Hanspeter Pfister. 2020. Pattern-Driven Navigation in 2D Multiscale Visualizations with Scalable Insets. IEEE Transactions on Visualization and Computer Graphics 26, 1 (1 1 2020), 611–621.",
      "doi": ""
    },
    {
      "text": "Fritz Lekschas, Brant Peterson, Daniel Haehn, Eric Ma, Nils Gehlenborg, and Hanspeter Pfister. 2020. Peax: Interactive visual pattern search in sequential data using unsupervised deep representation learning. In Computer Graphics Forum, Vol. 39–3. Wiley Online Library, USA, 167–179.",
      "doi": ""
    },
    {
      "text": "Fritz Lekschas, Xinyi Zhou, Wei Chen, Nils Gehlenborg, Benjamin Bach, and Hanspeter Pfister. 2021. A Generic Framework and Library for Exploration of Small Multiples through Interactive Piling. IEEE Transactions on Visualization and Computer Graphics 27, 2 (1 2 2021), 358–368.",
      "doi": ""
    },
    {
      "text": "Mengchen Liu, Shixia Liu, Hang Su, Kelei Cao, and Jun Zhu. 2018. Analyzing the noise robustness of deep neural networks. In 2018 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, NY, USA, 60–71.",
      "doi": ""
    },
    {
      "text": "Shusen Liu, Peer-Timo Bremer, Jayaraman J Thiagarajan, Vivek Srikumar, Bei Wang, Yarden Livnat, and Valerio Pascucci. 2017. Visual exploration of semantic relationships in neural word embeddings. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 553–562.",
      "doi": ""
    },
    {
      "text": "Xiao Liu, Pedro Sanchez, Spyridon Thermos, Alison Q O’Neil, and Sotirios A Tsaftaris. 2022. Learning disentangled representations in the imaging domain. Medical Image Analysis 80 (2022), 102516.",
      "doi": ""
    },
    {
      "text": "Yang Liu, Eunice Jun, Qisheng Li, and Jeffrey Heer. 2019. Latent space cartography: Visual analysis of vector space embeddings. In Computer Graphics Forum, Vol. 38. Wiley Online Library, NY, USA, 67–78.",
      "doi": ""
    },
    {
      "text": "Ziwei Liu, Ping Luo, Xiaogang Wang, and Xiaoou Tang. 2015. Deep Learning Face Attributes in the Wild. In Proceedings of International Conference on Computer Vision (ICCV). IEEE, USA, 3730–3738.",
      "doi": "10.1109/ICCV.2015.425"
    },
    {
      "text": "Sehi L’Yi, Qianwen Wang, Fritz Lekschas, and Nils Gehlenborg. 2021. Gosling: A Grammar-based Toolkit for Scalable and Interactive Genomics Data Visualization. IEEE Transactions on Visualization and Computer Graphics 28, 1 (1 10 2021), 140–150.",
      "doi": ""
    },
    {
      "text": "Loic Matthey, Irina Higgins, Demis Hassabis, and Alexander Lerchner. 2017. dSprites: Disentanglement testing Sprites dataset. https://github.com/deepmind/dsprites-dataset/.",
      "doi": ""
    },
    {
      "text": "Leland McInnes, John Healy, Nathaniel Saul, and Lukas Großberger. 2018. UMAP: Uniform Manifold Approximation and Projection. Journal of Open Source Software 3, 29 (2018), 861.",
      "doi": ""
    },
    {
      "text": "Yao Ming, Shaozu Cao, Ruixiang Zhang, Zhen Li, Yuanzhe Chen, Yangqiu Song, and Huamin Qu. 2017. Understanding hidden memories of recurrent neural networks. In 2017 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, NY, USA, 13–24.",
      "doi": ""
    },
    {
      "text": "Paul Mooney. 2017. Breast Histopathology Images. https://www.kaggle.com/datasets/paultimothymooney/breast-histopathology-images.",
      "doi": ""
    },
    {
      "text": "Giulio Mori, Fabio Paternò, and Carmen Santoro. 2002. CTTE: support for developing and analyzing task models for interactive system design. IEEE Transactions on software engineering 28, 8 (2002), 797–813.",
      "doi": "10.1109/TSE.2002.1027801"
    },
    {
      "text": "Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, Alban Desmaison, Andreas Kopf, Edward Yang, Zachary DeVito, Martin Raison, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. 2019. PyTorch: An Imperative Style, High-Performance Deep Learning Library. In Advances in Neural Information Processing Systems 32, H. Wallach, H. Larochelle, A. Beygelzimer, F. d'Alché-Buc, E. Fox, and R. Garnett (Eds.). Curran Associates, Inc., NY, USA, 8024–8035.",
      "doi": "10.5555/3454287.3455008"
    },
    {
      "text": "Nicola Pezzotti, Thomas Höllt, Jan Van Gemert, Boudewijn PF Lelieveldt, Elmar Eisemann, and Anna Vilanova. 2017. Deepeyes: Progressive visual analytics for designing deep neural networks. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 98–108.",
      "doi": ""
    },
    {
      "text": "Meg Pirrung, Nathan Hilliard, Artëm Yankov, Nancy O’Brien, Paul Weidert, Courtney D Corley, and Nathan O Hodas. 2018. Sharkzor: Interactive deep learning for image triage, sort and summary. In arXiv preprint, Vol. arXiv:1802.05316. Cornell University, USA, 4 pages.",
      "doi": ""
    },
    {
      "text": "Suhas SP Rao, Miriam H Huntley, Neva C Durand, Elena K Stamenova, Ivan D Bochkov, James T Robinson, Adrian L Sanborn, Ido Machol, Arina D Omer, Eric S Lander, 2014. A 3D map of the human genome at kilobase resolution reveals principles of chromatin looping. Cell 159, 7 (2014), 1665–1680.",
      "doi": ""
    },
    {
      "text": "Pengzhen Ren, Yun Xiao, Xiaojun Chang, Po-Yao Huang, Zhihui Li, Brij B Gupta, Xiaojiang Chen, and Xin Wang. 2021. A survey of deep active learning. Comput. Surveys 54, 9 (2021), 1–40.",
      "doi": ""
    },
    {
      "text": "Olga Russakovsky, Jia Deng, Hao Su, Jonathan Krause, Sanjeev Satheesh, Sean Ma, Zhiheng Huang, Andrej Karpathy, Aditya Khosla, Michael Bernstein, Alexander C. Berg, and Li Fei-Fei. 2015. ImageNet Large Scale Visual Recognition Challenge. International Journal of Computer Vision (IJCV) 115, 3 (2015), 211–252. https://doi.org/10.1007/s11263-015-0816-y",
      "doi": "10.1007/s11263-015-0816-y"
    },
    {
      "text": "Daniel Smilkov, Nikhil Thorat, Charles Nicholson, Emily Reif, Fernanda B Viégas, and Martin Wattenberg. 2016. Embedding projector: Interactive visualization and interpretation of embeddings. In arXiv preprint, Vol. arXiv:1611.05469. Cornell University, USA, 4 pages.",
      "doi": ""
    },
    {
      "text": "Karthick Sothivelr. 2020. Breast Cancer Classification With PyTorch and Deep Learning. https://medium.com/swlh/.",
      "doi": ""
    },
    {
      "text": "Jost Tobias Springenberg, Alexey Dosovitskiy, Thomas Brox, and Martin Riedmiller. 2014. Striving for simplicity: The all convolutional net. In ICLR (workshop track). International Machine Learning Society, USA, 14 pages.",
      "doi": ""
    },
    {
      "text": "Hendrik Strobelt, Sebastian Gehrmann, Hanspeter Pfister, and Alexander M Rush. 2017. Lstmvis: A tool for visual analysis of hidden state dynamics in recurrent neural networks. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 667–676.",
      "doi": ""
    },
    {
      "text": "Alistair Sutcliffe. 2000. On the effective use and reuse of HCI knowledge. ACM Transactions on Computer-Human Interaction (TOCHI) 7, 2(2000), 197–221.",
      "doi": "10.1145/353485.353488"
    },
    {
      "text": "Alistair G Sutcliffe and John M Carroll. 1999. Designing claims for reuse in interactive systems design. International Journal of Human-Computer Studies 50, 3 (1999), 213–241.",
      "doi": "10.1006/ijhc.1999.0245"
    },
    {
      "text": "Edward R Tufte, Nora Hillman Goeler, and Richard Benson. 1990. Envisioning information. Vol. 126. Graphics press, Cheshire, CT.",
      "doi": ""
    },
    {
      "text": "Laurens Van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of Machine Learning Research 9, 11 (2008), 2579–2605.",
      "doi": "10.1007/s10846-008-9235-4"
    },
    {
      "text": "Junpeng Wang, Wei Zhang, and Hao Yang. 2020. SCANViz: Interpreting the symbol-concept association captured by deep neural networks through visual analytics. In 2020 IEEE Pacific Visualization Symposium (PacificVis). IEEE, NY, USA, 51–60.",
      "doi": ""
    },
    {
      "text": "Qianwen Wang, William Alexander, Jack Pegg, Huamin Qu, and Min Chen. 2020. HypoML: Visual analysis for hypothesis-based evaluation of machine learning models. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 1417–1426.",
      "doi": ""
    },
    {
      "text": "Qianwen Wang, Zhutian Chen, Yong Wang, and Huamin Qu. 2021. A Survey on ML4VIS: Applying MachineLearning Advances to Data Visualization. IEEE Transactions on Visualization and Computer Graphics 28, 12(2021), 5134–5153.",
      "doi": "10.1109/TVCG.2021.3106142"
    },
    {
      "text": "Qianwen Wang, Zhen Li, Siwei Fu, Weiwei Cui, and Huamin Qu. 2019. Narvis: Authoring Narrative Slideshows for Introducing Data Visualization Designs. IEEE Transactions on Visualization and Computer Graphics 25, 1 (jan 2019), 779–788.",
      "doi": "10.1109/TVCG.2018.2865232"
    },
    {
      "text": "Qianwen Wang, Tali Mazor, Theresa A Harbig, Ethan Cerami, and Nils Gehlenborg. 2021. ThreadStates: State-based Visual Analysis of Disease Progression. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 238–247.",
      "doi": "10.1109/TVCG.2021.3114840"
    },
    {
      "text": "Qianwen Wang, Yao Ming, Zhihua Jin, Qiaomu Shen, Dongyu Liu, Micah J Smith, Kalyan Veeramachaneni, and Huamin Qu. 2019. Atmseer: Increasing transparency and controllability in automated machine learning. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300911"
    },
    {
      "text": "Qianwen Wang, Zhenhua Xu, Zhutian Chen, Yong Wang, Shixia Liu, and Huamin Qu. 2020. Visual analysis of discrimination in machine learning. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 1470–1480.",
      "doi": ""
    },
    {
      "text": "Yinqiao Wang, Lu Chen, Jaemin Jo, and Yunhai Wang. 2021. Joint t-SNE for Comparable Projections of Multiple High-Dimensional Datasets. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 623–632.",
      "doi": "10.1109/TVCG.2021.3114765"
    },
    {
      "text": "Jun Yuan, Changjian Chen, Weikai Yang, Mengchen Liu, Jiazhi Xia, and Shixia Liu. 2021. A survey of visual analytics techniques for machine learning. Computational Visual Media 7, 1 (2021), 3–36.",
      "doi": ""
    },
    {
      "text": "Zhenge Zhao, Panpan Xu, Carlos Scheidegger, and Liu Ren. 2021. Human-in-the-loop Extraction of Interpretable Concepts in Deep Learning Models. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 780–790.",
      "doi": "10.1109/TVCG.2021.3114837"
    }
  ]
}