{
  "doi": "10.1145/3544548.3580847",
  "title": "CiteSee: Augmenting Citations in Scientific Papers with Persistent and Personalized Historical Context",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [
    "Best Paper"
  ],
  "abstract": "When reading a scholarly article, inline citations help researchers contextualize the current article and discover relevant prior work. However, it can be challenging to prioritize and make sense of the hundreds of citations encountered during literature reviews. This paper introduces CiteSee, a paper reading tool that leverages a user’s publishing, reading, and saving activities to provide personalized visual augmentations and context around citations. First, CiteSee connects the current paper to familiar contexts by surfacing known citations a user had cited or opened. Second, CiteSee helps users prioritize their exploration by highlighting relevant but unknown citations based on saving and reading history. We conducted a lab study that suggests CiteSee is significantly more effective for paper discovery than three baselines. A field deployment study shows CiteSee helps participants keep track of their explorations and leads to better situational awareness and increased paper discovery via inline citation when conducting real-world literature reviews.",
  "authors": [
    {
      "name": "Joseph Chee Chang",
      "institution": "Allen Institute for AI, United States",
      "img": "/do/10.1145/contrib-99659020706/rel-imgonly/me.jpeg",
      "acmid": "99659020706",
      "orcid": "0000-0002-0798-4351"
    },
    {
      "name": "Amy X. Zhang",
      "institution": "University of Washington and Allen Institute for AI, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640424",
      "orcid": "0000-0001-9462-9835"
    },
    {
      "name": "Jonathan Bragg",
      "institution": "Allen Institute for AI, United States",
      "img": "/do/10.1145/contrib-81456631418/rel-imgonly/headshot.jpeg",
      "acmid": "81456631418",
      "orcid": "0000-0001-5460-9047"
    },
    {
      "name": "Andrew Head",
      "institution": "University of Pennsylvania, United States",
      "img": "/do/10.1145/contrib-99658703835/rel-imgonly/img_13703.jpg",
      "acmid": "99658703835",
      "orcid": "0000-0002-1523-3347"
    },
    {
      "name": "Kyle Lo",
      "institution": "Allen Institute for AI, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702069",
      "orcid": "0000-0002-1804-2853"
    },
    {
      "name": "Doug Downey",
      "institution": "Allen Institute for AI, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100228264",
      "orcid": "0000-0002-4737-8444"
    },
    {
      "name": "Daniel S. Weld",
      "institution": "Allen Institute for AI & University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659376950",
      "orcid": "0000-0002-3255-0109"
    }
  ],
  "references": [
    {
      "text": "2019. CHI ’19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk). Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Sriram Karthik Badam, Zhicheng Liu, and Niklas Elmqvist. 2019. Elastic Documents: Coupling Text and Tables through Contextual Visualizations for Enhanced Document Reading. IEEE Transactions on Visualization and Computer Graphics 25 (2019), 661–671.",
      "doi": "10.1109/TVCG.2018.2865119"
    },
    {
      "text": "Xiaomei Bai, Mengyang Wang, Ivan Lee, Zhuo Yang, Xiangjie Kong, and Feng Xia. 2019. Scientific Paper Recommendation: A Survey. IEEE Access 7(2019), 9324–9339.",
      "doi": ""
    },
    {
      "text": "CHARLES BAZERMAN. 1985. Physicists Reading Physics: Schema-Laden Purposes and Purpose-Laden Schema. Written Communication 2, 1, 3–23.",
      "doi": ""
    },
    {
      "text": "Iz Beltagy, Kyle Lo, and Arman Cohan. 2019. SciBERT: A Pretrained Language Model for Scientific Text. In EMNLP.",
      "doi": ""
    },
    {
      "text": "Andrea Bianchi, So-Ryang Ban, and Ian Oakley. 2015. Designing a Physical Aid to Support Active Reading on Tablets. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015).",
      "doi": "10.1145/2702123.2702303"
    },
    {
      "text": "Richard E. Boyatzis. 1998. Transforming Qualitative Information: Thematic Analysis and Code Development.",
      "doi": ""
    },
    {
      "text": "Rollin Brant. 1990. Assessing Proportionality in the Proportional Odds Model for Ordinal Logistic Regression. Biometrics 46, 4 (1990), 1171–1178. http://www.jstor.org/stable/2532457",
      "doi": ""
    },
    {
      "text": "Isabel Cachola, Kyle Lo, Arman Cohan, and Daniel S. Weld. 2020. TLDR: Extreme Summarization of Scientific Documents. In FINDINGS.",
      "doi": ""
    },
    {
      "text": "Arie Cattan, Sophie Johnson, Daniel Weld, Ido Dagan, Iz Beltagy, Doug Downey, and Tom Hope. 2021. SciCo: Hierarchical Cross-Document Coreference for Scientific Concepts. arXiv preprint arXiv:2104.08809(2021).",
      "doi": ""
    },
    {
      "text": "Joseph Chee Chang, Nathan Hahn, and Aniket Kittur. 2016. Supporting mobile sensemaking through intentionally uncertain highlighting. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 61–68.",
      "doi": "10.1145/2984511.2984538"
    },
    {
      "text": "Duen Horng Chau, Aniket Kittur, Jason I. Hong, and Christos Faloutsos. 2011. Apolo: making sense of large network data by combining rich user interaction and machine learning. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2011).",
      "doi": "10.1145/1978942.1978967"
    },
    {
      "text": "Daniel K. Y. Chen, Jean-Baptiste Chossat, and Peter B. Shull. 2019. HaptiVec: Presenting Haptic Feedback Vectors in Handheld Controllers using Embedded Tactile Pin Arrays. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019).",
      "doi": "10.1145/3290605.3300401"
    },
    {
      "text": "Rune Haubo B Christensen. 2018. Cumulative link models for ordinal regression with the R package ordinal. Submitted in J. Stat. Software 35 (2018).",
      "doi": ""
    },
    {
      "text": "Victoria Clarke and Virginia Braun. 2013. Successful qualitative research: A practical guide for beginners. Successful Qualitative Research(2013), 1–400.",
      "doi": ""
    },
    {
      "text": "Arman Cohan, Waleed Ammar, Madeleine van Zuylen, and Field Cady. 2019. Structural Scaffolds for Citation Intent Classification in Scientific Publications. In NAACL.",
      "doi": ""
    },
    {
      "text": "Arman Cohan, Sergey Feldman, Iz Beltagy, Doug Downey, and Daniel S. Weld. 2020. SPECTER: Document-level Representation Learning using Citation-informed Transformers. ArXiv abs/2004.07180(2020).",
      "doi": ""
    },
    {
      "text": "Lynne M. Connelly. 2013. Grounded theory.Medsurg nursing : official journal of the Academy of Medical-Surgical Nurses 22 2(2013), 124, 127.",
      "doi": ""
    },
    {
      "text": "david nicholas, peter williams, ian rowlands, and hamid r. jamali. 2010. researchers’ e-journal use and information seeking behaviour. journal of information science 36 (2010), 494 – 516.",
      "doi": ""
    },
    {
      "text": "Graham Dove and Anne-Laure Fayard. 2020. Monsters, Metaphors, and Machine Learning. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (2020).",
      "doi": "10.1145/3313831.3376275"
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX Design Innovation: Challenges for Working with Machine Learning as a Design Material. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017).",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Markus Eberts and Adrian Ulges. 2020. Span-based Joint Entity and Relation Extraction with Transformer Pre-training. ArXiv abs/1909.07755(2020).",
      "doi": ""
    },
    {
      "text": "James A. Evans. 2008. Electronic Publication and the Narrowing of Science and Scholarship. Science 321(2008), 395 – 399.",
      "doi": ""
    },
    {
      "text": "Marco Gori and Augusto Pucci. 2006. Research Paper Recommender Systems: A Random-Walk Based Approach. 2006 IEEE/WIC/ACM International Conference on Web Intelligence (WI 2006 Main Conference Proceedings)(WI’06)(2006), 778–781.",
      "doi": ""
    },
    {
      "text": "Han L Han, Junhang Yu, Raphael Bournet, Alexandre Ciorascu, Wendy E Mackay, and Michel Beaudouin-Lafon. 2022. Passages: Interacting with Text Across Documents. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": ""
    },
    {
      "text": "Jiangen He, Q. Ping, Wen Lou, and Chaomei Chen. 2019. PaperPoles: Facilitating adaptive visual exploration of scientific publications by citation links. Journal of the Association for Information Science and Technology 70 (2019).",
      "doi": ""
    },
    {
      "text": "Andrew Head, Kyle Lo, Dongyeop Kang, Raymond Fok, Sam Skjonsberg, Daniel S. Weld, and Marti A. Hearst. 2021. Augmenting Scientific Papers with Just-in-Time, Position-Sensitive Definitions of Terms and Symbols. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (2021).",
      "doi": "10.1145/3411764.3445648"
    },
    {
      "text": "Terje Hillesund. 2010. Digital Reading Spaces: How Expert Readers handle Books, the Web and Electronic Paper. First Monday 15(2010).",
      "doi": ""
    },
    {
      "text": "Zan Huang, Wingyan Chung, Thian-Huat Ong, and Hsinchun Chen. 2002. A graph-based recommender system for digital library. In JCDL ’02.",
      "doi": ""
    },
    {
      "text": "Hyeonsu Kang, Joseph Chee Chang, Yongsung Kim, and Aniket Kittur. 2022. Threddy: An Interactive System for Personalized Thread-based Exploration and Organization of Scientific Literature. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. 1–15.",
      "doi": "10.1145/3526113.3545660"
    },
    {
      "text": "Hyeonsu B. Kang, Rafal Kocielnik, Andrew Head, Jiangjiang Yang, Matt Latzke, Aniket Kittur, Daniel S. Weld, Doug Downey, and Jonathan Bragg. 2022. From Who You Know to What You Read: Augmenting Scientific Recommendations with Implicit Social Networks. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2022).",
      "doi": "10.1145/3491102.3517470"
    },
    {
      "text": "Dae Hyun Kim, Enamul Hoque, Juho Kim, and Maneesh Agrawala. 2018. Facilitating Document Reading by Linking Text and Tables. Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (2018).",
      "doi": "10.1145/3242587.3242617"
    },
    {
      "text": "Donald W. King, Carol Tenopir, Songphan Choemprayong, and Lei Wu. 2009. Scholarly journal information‐seeking and reading patterns of faculty at five US universities. Learned Publishing 22(2009).",
      "doi": ""
    },
    {
      "text": "Nicholas Kong, Marti A. Hearst, and Maneesh Agrawala. 2014. Extracting references between text and charts via crowdsourcing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2014).",
      "doi": "10.1145/2556288.2557241"
    },
    {
      "text": "Andrew Kuznetsov, Joseph Chee Chang, Nathan Hahn, Napol Rachatasumrit, Bradley Breneisen, Julina Coupland, and Aniket Kittur. 2022. Fuse: In-Situ Sensemaking Support in the Browser. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. 1–15.",
      "doi": "10.1145/3526113.3545693"
    },
    {
      "text": "Patrice Lopez. 2009. GROBID: Combining automatic bibliographic data recognition and term extraction for scholarship publications. In International conference on theory and practice of digital libraries. Springer, 473–474.",
      "doi": ""
    },
    {
      "text": "Yi Luan, Luheng He, Mari Ostendorf, and Hannaneh Hajishirzi. 2018. Multi-Task Identification of Entities, Relations, and Coreference for Scientific Knowledge Graph Construction. In EMNLP.",
      "doi": ""
    },
    {
      "text": "Jock D. Mackinlay, Ramana Rao, and Stuart K. Card. 1995. An organic user interface for searching citation links. In CHI ’95.",
      "doi": ""
    },
    {
      "text": "Gary Marchionini. 2006. Exploratory Search: From Finding to Understanding.",
      "doi": ""
    },
    {
      "text": "Catherine C. Marshall, Morgan N. Price, Gene Golovchinsky, and Bill N. Schilit. 1999. Introducing a digital library reading appliance into a reading group. In DL ’99.",
      "doi": ""
    },
    {
      "text": "Kenton P. O’Hara. 1998. Rank Xerox Research Centre Cambridge Laboratory Towards a Typology of Reading Goals RXRC Affordances of Paper Project.",
      "doi": ""
    },
    {
      "text": "Srishti Palani, Zijian Ding, Austin Nguyen, Andrew Chuang, Stephen MacNeil, and Steven P Dow. 2021. CoNotate: Suggesting Queries Based on Notes Promotes Knowledge Discovery. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445618"
    },
    {
      "text": "Srishti Palani, Yingyi Zhou, Sheldon Zhu, and Steven P Dow. 2022. InterWeave: Presenting Search Suggestions in Context Scaffolds Information Search and Synthesis. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. 1–16.",
      "doi": "10.1145/3526113.3545696"
    },
    {
      "text": "Carole L Palmer, Lauren C Teffeau, and Carrie M Pirmann. 2009. Scholarly information practices in the online environment. Report commissioned by OCLC Research. Published online at: www. oclc. org/programs/publications/reports/2009-02. pdf (2009).",
      "doi": ""
    },
    {
      "text": "Simon Philip, Peter Bamidele Shola, and Abari Ovye John. 2014. Application of Content-Based Approach in Research Paper Recommendation System for a Digital Library. International Journal of Advanced Computer Science and Applications 5 (2014).",
      "doi": ""
    },
    {
      "text": "Peter Pirolli and Stuart K. Card. 1995. Information foraging in information access environments. In CHI ’95.",
      "doi": ""
    },
    {
      "text": "Antoine Ponsard, Francisco Escalona, and Tamara Munzner. 2016. PaperQuest: A Visualization Tool to Support Literature Review. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(2016).",
      "doi": "10.1145/2851581.2892334"
    },
    {
      "text": "Brett Powley, R. Dale, and Ilya Anisimoff. 2009. Enriching a document collection by integrating information extraction and PDF annotation. In Electronic Imaging.",
      "doi": ""
    },
    {
      "text": "Napol Rachatasumrit, Jonathan Bragg, Amy X. Zhang, and Daniel S. Weld. 2022. CiteRead: Integrating Localized Citation Contexts into Scientific Paper Reading. 27th International Conference on Intelligent User Interfaces (2022).",
      "doi": "10.1145/3490099.3511162"
    },
    {
      "text": "Napol Rachatasumrit, Gonzalo Ramos, Jina Suh, Rachel S. Ng, and Christopher Meek. 2021. ForSense: Accelerating Online Research Through Sensemaking Integration and Machine Research Support. 26th International Conference on Intelligent User Interfaces (2021).",
      "doi": ""
    },
    {
      "text": "Daniel M. Russell, Mark Stefik, Peter Pirolli, and Stuart K. Card. 1993. The cost structure of sensemaking. Proceedings of the INTERACT ’93 and CHI ’93 Conference on Human Factors in Computing Systems (1993).",
      "doi": "10.1145/169059.169209"
    },
    {
      "text": "Jeffrey M Rzeszotarski and Aniket Kittur. 2011. Instrumenting the crowd: using implicit behavioral measures to predict task performance. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 13–22.",
      "doi": "10.1145/2047196.2047199"
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. Transcalibur: A Weight Shifting Virtual Reality Controller for 2D Shape Rendering based on Computational Perception Model. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019).",
      "doi": "10.1145/3290605.3300241"
    },
    {
      "text": "Kazunari Sugiyama and Min-Yen Kan. 2010. Scholarly paper recommendation via user’s recent research interests. In JCDL ’10.",
      "doi": ""
    },
    {
      "text": "Yuqian Sun, Shigeo Yoshida, Takuji Narumi, and Michitaka Hirose. 2019. PaCaPa: A Handheld VR Device for Rendering Size, Shape, and Stiffness of Virtual Objects in Tool-based Interactions. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019).",
      "doi": "10.1145/3290605.3300682"
    },
    {
      "text": "Craig S. Tashman and W. Keith Edwards. 2011. Active reading and its discontents: the situations, problems and ideas of readers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2011).",
      "doi": "10.1145/1978942.1979376"
    },
    {
      "text": "Craig S. Tashman and W. Keith Edwards. 2011. LiquidText: a flexible, multitouch environment to support active reading. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2011).",
      "doi": "10.1145/1978942.1979430"
    },
    {
      "text": "Carol Tenopir and Donald W. King. 2008. Electronic Journals and Changes in Scholarly Article Seeking and Reading Patterns. D-lib Magazine 14(2008).",
      "doi": ""
    },
    {
      "text": "Carol Tenopir, Rachel Volentine, and Donald W. King. 2012. Scholarly Reading and the Value of Academic Library Collections: Results of A Study in Six UK Universities. Insights: The UKSG Journal 25 (2012), 130–149.",
      "doi": ""
    },
    {
      "text": "Marco Valenzuela, Vu A. Ha, and Oren Etzioni. 2015. Identifying Meaningful Citations. In AAAI Workshop: Scholarly Big Data.",
      "doi": ""
    },
    {
      "text": "Francesco Vitale, Izabelle Janzen, and Joanna McGrenere. 2018. Hoarding and minimalism: Tendencies in digital data preservation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174161"
    },
    {
      "text": "Chong Wang and David M. Blei. 2011. Collaborative topic modeling for recommending scientific articles. In KDD.",
      "doi": ""
    },
    {
      "text": "Feng Xia, Haifeng Liu, Ivan Lee, and Longbing Cao. 2016. Scientific Article Recommendation: Exploiting Common Author Relations and Historical Preferences. IEEE Transactions on Big Data 2 (2016), 101–G112.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Alex Sciuto, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld. 2018. Investigating How Experienced UX Designers Effectively Work with Machine Learning. Proceedings of the 2018 Designing Interactive Systems Conference (2018).",
      "doi": "10.1145/3196709.3196730"
    },
    {
      "text": "Houjin Yu, Xianling Mao, Zewen Chi, Wei Wei, and Heyan Huang. 2020. A Robust and Domain-Adaptive Approach for Low-Resource Named Entity Recognition. 2020 IEEE International Conference on Knowledge Graph (ICKG) (2020), 297–304.",
      "doi": ""
    }
  ]
}