{
  "doi": "10.1145/3544548.3581137",
  "title": "The tactile dimension: a method for physicalizing touch behaviors",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Traces of touch provide valuable insight into how we interact with the physical world. Measuring touch behavior, however, is expensive and imprecise. Utilizing a fluorescent UV tracer powder, we developed a low-cost analog method to capture persistent, high-contrast touch records on arbitrary objects. We describe our process for selecting a tracer, methods for capturing, enhancing, and aggregating traces, and approaches to examining qualitative aspects of the user experience. Three user studies demonstrate key features of this method. First, we show that it provides clear and durable traces on objects representative of scientific visualization, physicalization, and product design. Second, we demonstrate how this method could be used to study touch perception, by measuring how task and narrative framing elicit different touch behaviors on the same object. Third, we demonstrate how this method can be used to evaluate data physicalizations by observing how participants touch two different physicalizations of COVID-19 time-series data.",
  "authors": [
    {
      "name": "Laura J Perovich",
      "institution": "Art+Design, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557052556",
      "orcid": "0000-0001-5890-6487"
    },
    {
      "name": "Bernice Rogowitz",
      "institution": "Visual Perspectives Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100592157",
      "orcid": "0000-0002-8660-8652"
    },
    {
      "name": "Victoria Crabb",
      "institution": "Art+Design, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782131",
      "orcid": "0000-0003-3685-4684"
    },
    {
      "name": "Jack Vogelsang",
      "institution": "Art+Design, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779144",
      "orcid": "0000-0002-0385-8497"
    },
    {
      "name": "Sara Hartleben",
      "institution": "Art+Design, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780635",
      "orcid": "0000-0001-5414-5174"
    },
    {
      "name": "Dietmar Offenhuber",
      "institution": "Art + Design, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779835",
      "orcid": "0000-0002-8434-7786"
    }
  ],
  "references": [
    {
      "text": "Shirley Agostinho, Sharon Tindall-Ford, Paul Ginns, Steven J. Howard, Wayne Leahy, and Fred Paas. 2015. Giving Learning a Helping Hand: Finger Tracing of Temperature Graphs on an iPad. Educ Psychol Rev 27, 3 (Sept. 2015), 427–443. https://doi.org/10.1007/s10648-015-9315-5",
      "doi": ""
    },
    {
      "text": "Albert J Ahumada. 1993. Computational image quality metrics: A review. SID Digest 24(1993), 305–308.",
      "doi": ""
    },
    {
      "text": "Jay Belsky and Robert K. Most. 1981. From Exploration to Play: A Cross-Sectional Study of Infant Free Play Behavior.Developmental psychology 17, 5 (1981), 630.",
      "doi": ""
    },
    {
      "text": "Kurtis Danyluk, Teoman Tomo Ulusoy, Wei Wei, and Wesley Willett. 2020. Touch and beyond: Comparing Physical and Virtual Reality Visualizations. IEEE Transactions on Visualization and Computer Graphics (2020).",
      "doi": ""
    },
    {
      "text": "Adam Drogemuller, Andrew Cunningham, James A. Walsh, James Baumeister, Ross T. Smith, and Bruce H. Thomas. 2021. Haptic and Visual Comprehension of a 2D Graph Layout Through Physicalisation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445704"
    },
    {
      "text": "Polly Edman. 1992. Tactile Graphics. American Foundation for the Blind.",
      "doi": ""
    },
    {
      "text": "Tom Foulsham. 2019. Scenes, saliency maps and scanpaths. In Eye Movement Research. Springer, 197–238.",
      "doi": ""
    },
    {
      "text": "C. Gardiner, J. Veall, and S. Lockhart. 2020. The Use of UV Fluorescent Powder for COVID-19 Airway Management Simulation Training. Anaesthesia (April 2020), 10.1111/anae.15089. https://doi.org/10.1111/anae.15089",
      "doi": ""
    },
    {
      "text": "Bridger Herman, Maxwell Omdal, Stephanie Zeller, Clara A. Richter, Francesca Samsel, Greg Abram, and Daniel F. Keefe. 2021. Multi-Touch Querying on Data Physicalizations in Immersive AR. Proceedings of the ACM on Human-Computer Interaction 5, ISS(2021), 1–20.",
      "doi": "10.1145/3488542"
    },
    {
      "text": "Ken Hinckley, Michel Pahud, Hrvoje Benko, Pourang Irani, François Guimbretière, Marcel Gavriliu, Xiang’Anthony’ Chen, Fabrice Matulic, William Buxton, and Andrew Wilson. 2014. Sensing Techniques for Tablet+ Stylus Interaction. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology. 605–614.",
      "doi": "10.1145/2642918.2647379"
    },
    {
      "text": "Toshiki Hosoi, Kazuki Takashima, Tomoaki Adachi, Yuichi Itoh, and Yoshifumi Kitamura. 2014. A-Blocks: Recognizing and Assessing Child Building Processes during Play with Toy Blocks. In SIGGRAPH Asia 2014 Emerging Technologies. 1–2.",
      "doi": ""
    },
    {
      "text": "Fabian Hutmacher and Christof Kuhbandner. 2018. Long-Term Memory for Haptically Explored Objects: Fidelity, Durability, Incidental Encoding, and Cross-Modal Transfer. Psychol Sci 29, 12 (Dec. 2018), 2031–2038. https://doi.org/10/gfssc8",
      "doi": ""
    },
    {
      "text": "Petra Isenberg, Tobias Isenberg, Tobias Hesselmann, Bongshin Lee, Ulrich Von Zadow, and Anthony Tang. 2013. Data Visualization on Interactive Surfaces: A Research Agenda. IEEE Computer Graphics and Applications 33, 2 (2013), 16–24.",
      "doi": "10.1109/MCG.2013.24"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems. 234–241.",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, and Jean-Daniel Fekete. 2013. Evaluating the Efficiency of Physical Visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2593–2602. https://doi.org/10/gf65hg",
      "doi": "10.1145/2470654.2481359"
    },
    {
      "text": "Merel M. Jung, Ronald Poppe, Mannes Poel, and Dirk KJ Heylen. 2014. Touching the Void–Introducing CoST: Corpus of Social Touch. In Proceedings of the 16th International Conference on Multimodal Interaction. 120–127.",
      "doi": "10.1145/2663204.2663242"
    },
    {
      "text": "David Kirsh. 2010. Thinking with External Representations. AI & SOCIETY 25, 4 (Nov. 2010), 441–454. https://doi.org/10/dpxbtj",
      "doi": ""
    },
    {
      "text": "Joseph R Lakowicz. 1999. Fluorescence sensing. In Principles of fluorescence spectroscopy. Springer, 531–572.",
      "doi": ""
    },
    {
      "text": "Eric Larson, Gabe Cohn, Sidhant Gupta, Xiaofeng Ren, Beverly Harrison, Dieter Fox, and Shwetak Patel. 2011. HeatWave: Thermal Imaging for Surface User Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver BC Canada, 2565–2574. https://doi.org/10.1145/1978942.1979317",
      "doi": "10.1145/1978942.1979317"
    },
    {
      "text": "Mathieu Le Goc, Pierre Dragicevic, Samuel Huron, Jeremy Boy, and Jean-Daniel Fekete. 2015. Smarttokens: Embedding Motion and Grip Sensing in Small Tangible Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 357–362.",
      "doi": "10.1145/2807442.2807488"
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 1987. Hand movements: A window into haptic object recognition. Cognitive psychology 19, 3 (1987), 342–368.",
      "doi": ""
    },
    {
      "text": "Dan Lockton, Laura Forlano, John Fass, and Lisa Brawley. 2020. Thinking with Things: Landscapes, Connections, and Performances as Modes of Building Shared Understanding. IEEE Computer Graphics and Applications 40, 6 (2020), 38–50.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2017. Feeling Your Data: Touch and Making Sense of Personal Digital Data. New media & society 19, 10 (2017), 1599–1614.",
      "doi": ""
    },
    {
      "text": "Joyce Ma, Lisa Sindorf, Isaac Liao, and Jennifer Frazier. 2015. Using a tangible versus a multi-touch graphical user interface to support data exploration at a museum exhibit. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. 33–40.",
      "doi": "10.1145/2677199.2680555"
    },
    {
      "text": "Jessica Maitland, Renee Boyer, Dan Gallagher, Susan Duncan, Nate Bauer, Janell Kause, and Joseph Eifert. 2013. Tracking Cross-Contamination Transfer Dynamics at a Mock Retail Deli Market Using GloGerm. Journal of Food Protection 76, 2 (Feb. 2013), 272–282. https://doi.org/10.4315/0362-028X.JFP-12-271",
      "doi": ""
    },
    {
      "text": "David Merrill, Jeevan Kalanithi, and Pattie Maes. 2007. Siftables: Towards Sensor Network User Interfaces. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction. 75–78.",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Andrew Vande Moere. 2008. Beyond the Tyranny of the Pixel: Exploring the Physicality of Information Visualization. IEEE International Conference on Information Visualisation (IV’08), London, UK (2008), 469–474.",
      "doi": ""
    },
    {
      "text": "John D Mollon, Jenny M Bosten, David H Peterzell, and Michael A Webster. 2017. Individual differences in visual science: What can be learned and what is good experimental practice?Vision Research 141(2017), 4–15.",
      "doi": ""
    },
    {
      "text": "Magdalena Novak and Stephan Schwan. 2020. Does Touching Real Objects Affect Learning?Educ Psychol Rev (Aug. 2020). https://doi.org/10/ghk9x7",
      "doi": ""
    },
    {
      "text": "Dietmar Offenhuber. 2019. Data by Proxy — Material Traces as Autographic Visualizations. IEEE transactions on visualization and computer graphics (2019). https://doi.org/10/gf649f",
      "doi": ""
    },
    {
      "text": "Kathryn Osei-Bonsu, Nadia Masroor, Kaila Cooper, Christopher Doern, Kimberly K. Jefferson, Yvette Major, Savion Adamson, Justin Thomas, Ian Lovern, Heather Albert, Michael P. Stevens, Gordon Archer, Gonzalo Bearman, and Michelle Doll. 2019. Alternative Doffing Strategies of Personal Protective Equipment to Prevent Self-Contamination in the Health Care Setting. American Journal of Infection Control 47, 5 (May 2019), 534–539. https://doi.org/10.1016/j.ajic.2018.11.003",
      "doi": ""
    },
    {
      "text": "Joann Peck and Terry L. Childers. 2003. Individual Differences in Haptic Information Processing: The “Need for Touch” Scale. Journal of Consumer Research 30, 3 (2003), 430–442.",
      "doi": ""
    },
    {
      "text": "Sylvia C Pont, Astrid ML Kappers, and Jan J Koenderink. 1999. Similar mechanisms underlie curvature comparison by static and dynamic touch. Perception & Psychophysics 61, 5 (1999), 874–894.",
      "doi": ""
    },
    {
      "text": "Kris Rogers, Janet Wiles, Scott Heath, Kristyn Hensby, and Jonathon Taufatofua. 2016. Discovering Patterns of Touch: A Case Study for Visualization-Driven Analysis in Human-Robot Interaction. In 2016 11th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 499–500.",
      "doi": ""
    },
    {
      "text": "Bernice Rogowitz, Laura J Perovich, Yuke Li, Bjorn Kierulf, and Dietmar Offenhuber. 2021. Touching Art - A Method for Visualizing Tactile Experience.alt.VIS workshop, IEEE VIS 2021(2021).",
      "doi": ""
    },
    {
      "text": "Kim Sauvé, David Verweij, Jason Alexander, and Steven Houben. 2021. Reconfiguration Strategies with Composite Data Physicalizations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3411764.3445746"
    },
    {
      "text": "Christopher Shooner and Kathy T Mullen. 2022. Linking perceived to physical contrast: Comparing results from discrimination and difference-scaling experiments. Journal of Vision 22, 1 (2022), 13–13.",
      "doi": ""
    },
    {
      "text": "Faisal Taher, Yvonne Jansen, Jonathan Woodruff, John Hardy, Kasper Hornbæk, and Jason Alexander. 2016. Investigating the Use of a Dynamic Physical Bar Chart for Data Exploration and Presentation. IEEE transactions on visualization and computer graphics 23, 1(2016), 451–460.",
      "doi": ""
    },
    {
      "text": "Feng Tian, Xiangmin Fan, Junjun Fan, Yicheng Zhu, Jing Gao, Dakuo Wang, Xiaojun Bi, and Hongan Wang. 2019. What Can Gestures Tell? Detecting Motor Impairment in Early Parkinson’s from Common Touch Gestural Interactions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300313",
      "doi": "10.1145/3290605.3300313"
    },
    {
      "text": "Barbara Tversky. 2019. Mind in Motion: How Action Shapes Thought (1 edition ed.). Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Eugene Webb and Karl E. Weick. 1979. Unobtrusive Measures in Organizational Theory: A Reminder. Administrative Science Quarterly 24, 4 (Dec. 1979), 650. https://doi.org/10/chnvg9",
      "doi": ""
    },
    {
      "text": "Eugene J. Webb, Donald T. Campbell, Richard D. Schwartz, and Lee Sechrest. 1966. Unobtrusive Measures. Sage Publications, Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Andrew D. Wilson. 2010. Using a Depth Camera as a Touch Sensor. In ACM International Conference on Interactive Tabletops and Surfaces - ITS ’10. ACM Press, Saarbrucken, Germany, 69. https://doi.org/10.1145/1936652.1936665",
      "doi": "10.1145/1936652.1936665"
    },
    {
      "text": "Alfred L. Yarbus. 1965. Role of Eye Movements in the Visual Process.(1965).",
      "doi": ""
    },
    {
      "text": "Alfred L. Yarbus. 1967. Eye Movements and Vision. Plenum Press.",
      "doi": ""
    },
    {
      "text": "Steve Yohanan and Karon E. MacLean. 2012. The Role of Affective Touch in Human-Robot Interaction: Human Intent and Expectations in Touching the Haptic Creature. International Journal of Social Robotics 4, 2 (2012), 163–180.",
      "doi": ""
    },
    {
      "text": "Emanuel Zgraggen, Robert Zeleznik, and Steven M. Drucker. 2014. PanoramicData: Data Analysis through Pen & Touch. IEEE transactions on visualization and computer graphics 20, 12(2014), 2112–2121.",
      "doi": ""
    },
    {
      "text": "Chang Long Zhu, Harshit Agrawal, and Pattie Maes. 2015. Data-Objects: Re-designing Everyday Objects as Tactile Affective Interfaces. In 2015 International Conference on Affective Computing and Intelligent Interaction (ACII). IEEE, 322–326.",
      "doi": "10.1109/ACII.2015.7344590"
    }
  ]
}