{
  "doi": "10.1145/3544548.3581292",
  "title": "Tangible Immersive Trauma Simulation: Is Mixed Reality the next level of medical skills training?",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "In medical simulation training two approaches are currently rather disjunct: realistic manikins are used to teach physical skills and procedures and VR systems are used to train situation assessment and decision making. We propose a mixed reality approach, which allows trainees to use real tools and their hands when interacting with a physical manikin overlaid with a responsive virtual avatar. In close exchange with first responder organizations, we developed and evaluated an MR training scenario. In the scenario, users can talk to injured people in a car accident, assess the threat of the environment, and utilize real medical equipment. Participants experienced high levels of physical- and self-presence, increased stress levels, and reported a high technology acceptance. The proposed main requirements of first responders regarding haptic multi-sensory skill training in MR and the lessons learned from the workshop aim to guide the design of training solutions for medical training in MR.",
  "authors": [
    {
      "name": "Jakob Carl Uhl",
      "institution": "Center for Technology Experience, AIT Austrian Institute of Technology, Austria and PLUS University of Salzburg, Austria",
      "img": "/do/10.1145/contrib-99660647557/rel-imgonly/prfile.jpg",
      "acmid": "99660647557",
      "orcid": "0000-0002-2178-7987"
    },
    {
      "name": "Helmut Schrom-Feiertag",
      "institution": "AIT Austrian Institute of Technology, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440617163",
      "orcid": "0000-0002-5327-2494"
    },
    {
      "name": "Georg Regal",
      "institution": "Center for Technology Experience, AIT Austrian Institute of Technology GmbH, Austria",
      "img": "/do/10.1145/contrib-82659079657/rel-imgonly/citations.jpg",
      "acmid": "82659079657",
      "orcid": "0000-0003-4483-7710"
    },
    {
      "name": "Katja Gallhuber",
      "institution": "Center for Technology Experience, AIT Austrian Institute of Technology, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783844",
      "orcid": "0000-0003-2736-814X"
    },
    {
      "name": "Manfred Tscheligi",
      "institution": "PLUS University of Salzburg, Austria and Center for Technology Experience, AIT Austrian Institute of Technology, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548016789",
      "orcid": "0000-0001-6056-7285"
    }
  ],
  "references": [
    {
      "text": "Andrea F Abate, Mariano Guida, Paolo Leoncini, Michele Nappi, and Stefano Ricciardi. 2009. A haptic-based approach to virtual training for aerospace industry. Journal of Visual Languages & Computing 20, 5 (2009), 318–325.",
      "doi": "10.1016/j.jvlc.2009.07.003"
    },
    {
      "text": "NARMEEN N. AL-HIYARI and SHAIDAH S. JUSOH. 2021. Healthcare Training Application: 3D First Aid Virtual Reality. In International Conference on Data Science, E-Learning and Information Systems 2021 (Ma’an, Jordan) (DATA’21). Association for Computing Machinery, New York, NY, USA, 107–116. https://doi.org/10.1145/3460620.3460741",
      "doi": "10.1145/3460620.3460741"
    },
    {
      "text": "Seyed Amir Hossein Aqajari, Emad Kasaeyan Naeini, Milad Asgari Mehrabadi, Sina Labbaf, Amir M Rahmani, and Nikil Dutt. 2020. Gsr analysis for stress: Development and validation of an open source tool for noisy naturalistic gsr data. arXiv preprint arXiv:2005.01834(2020).",
      "doi": ""
    },
    {
      "text": "Andrés Ayala, Graciela Guerrero, Juan Mateu, Laura Casades, and Xavier Alamán. 2015. Virtual touch FlyStick and PrimBox: Two case studies of mixed reality for teaching geometry. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 9454 (2015), 309–320. https://doi.org/10.1007/978-3-319-26401-1_29",
      "doi": ""
    },
    {
      "text": "Frank Biocca, Chad Harms, and Judee K Burgoon. 2003. Toward a more robust theory and measure of social presence: Review and suggested criteria. Presence: Teleoperators & virtual environments 12, 5(2003), 456–480.",
      "doi": ""
    },
    {
      "text": "Cyril Bossard, Gilles Kermarrec, Cédric Buche, and Jacques Tisseau. 2008. Transfer of learning in virtual environments: a new challenge?Virtual Reality 12, 3 (2008), 151–161.",
      "doi": ""
    },
    {
      "text": "Kristina Bucher, Tim Blome, Stefan Rudolph, and Sebastian von Mammen. 2019. VReanimate II: training first aid and reanimation in virtual reality. Journal of Computers in Education 6, 1 (2019), 53–78.",
      "doi": ""
    },
    {
      "text": "Patrick Carlson, Anicia Peters, Stephen B Gilbert, Judy M Vance, and Andy Luse. 2015. Virtual training: Learning transfer of assembly tasks. IEEE transactions on visualization and computer graphics 21, 6(2015), 770–782.",
      "doi": ""
    },
    {
      "text": "Said Chehabeddine, Muhammad Hassan Jamil, Wanjoo Park, Dianne L. Sefo, Peter M. Loomer, and Mohamad Eid. 2021. Bi-Manual Haptic-Based Periodontal Simulation with Finger Support and Vibrotactile Feedback. ACM Trans. Multimedia Comput. Commun. Appl. 17, 1, Article 28 (apr 2021), 17 pages. https://doi.org/10.1145/3421765",
      "doi": "10.1145/3421765"
    },
    {
      "text": "Long Chen, Thomas W Day, Wen Tang, and Nigel W John. 2017. Recent developments and future challenges in medical mixed reality. In 2017 IEEE international symposium on mixed and augmented reality (ISMAR). IEEE, 123–135.",
      "doi": ""
    },
    {
      "text": "Vuthea Chheang, Patrick Saalfeld, Fabian Joeres, Christian Boedecker, Tobias Huber, Florentine Huettl, Hauke Lang, Bernhard Preim, and Christian Hansen. 2021. A Collaborative Virtual Reality Environment for Liver Surgery Planning. Comput. Graph. 99, C (oct 2021), 234–246. https://doi.org/10.1016/j.cag.2021.07.009",
      "doi": "10.1016/j.cag.2021.07.009"
    },
    {
      "text": "Barney Dalgarno and Mark J W Lee. 2010. What are the learning affordances of 3-D virtual environments?British Journal of Educational Technology 41, 1 (2010), 10–32. https://doi.org/10.1111/j.1467-8535.2009.01038.x",
      "doi": ""
    },
    {
      "text": "David Escobar-Castillejos, Julieta Noguez, Luis Neri, Alejandra Magana, and Bedrich Benes. 2016. A Review of Simulators with Haptic Devices for Medical Training. J. Med. Syst. 40, 4 (apr 2016), 1–22. https://doi.org/10.1007/s10916-016-0459-8",
      "doi": "10.1007/s10916-016-0459-8"
    },
    {
      "text": "Danilo Gasques Rodrigues, Ankur Jain, Steven R. Rick, Liu Shangley, Preetham Suresh, and Nadir Weibel. 2017. Exploring Mixed Reality in Specialized Surgical Environments. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 2591–2598. https://doi.org/10.1145/3027063.3053273",
      "doi": "10.1145/3027063.3053273"
    },
    {
      "text": "Nirit Gavish, Teresa Gutiérrez, Sabine Webel, Jorge Rodríguez, Matteo Peveri, Uli Bockholt, and Franco Tecchia. 2015. Evaluating virtual reality and augmented reality training for industrial maintenance and assembly tasks. Interactive Learning Environments 23, 6 (2015), 778–798.",
      "doi": ""
    },
    {
      "text": "Andrzej Grabowski and Jarosław Jankowski. 2015. Virtual reality-based pilot training for underground coal miners. Safety science 72(2015), 310–314.",
      "doi": ""
    },
    {
      "text": "Sang-Won Han, Su-Kyung Sung, Byeong-Seok Shin, and Ashish Bagwari. 2022. Virtual Reality Simulation of High Tibial Osteotomy for Medical Training. Mob. Inf. Syst. 2022 (jan 2022), 9 pages. https://doi.org/10.1155/2022/3055898",
      "doi": ""
    },
    {
      "text": "David Harborth and Sebastian Pape. 2018. German translation of the unified theory of acceptance and use of technology 2 (UTAUT2) questionnaire. Available at SSRN 3147708(2018).",
      "doi": ""
    },
    {
      "text": "Cuan M Harrington, Dara O Kavanagh, John F Quinlan, Donncha Ryan, Patrick Dicker, Dara O’Keeffe, Oscar Traynor, and Sean Tierney. 2018. Development and evaluation of a trauma decision-making simulator in Oculus virtual reality. The American Journal of Surgery 215, 1 (2018), 42–47.",
      "doi": ""
    },
    {
      "text": "Dongjin Huang, Pengbin Tang, Xianglong Wang, Tao Ruan Wan, and Wen Tang. 2019. New Haptic Syringe Device for Virtual Angiography Training. Comput. Graph. 80, C (may 2019), 97–103. https://doi.org/10.1016/j.cag.2019.03.012",
      "doi": "10.1016/j.cag.2019.03.012"
    },
    {
      "text": "Hsiu-Mei Huang, Ulrich Rauch, and Shu-Sheng Liaw. 2010. Investigating learners’ attitudes toward virtual reality learning environments: Based on a constructivist approach. Computers & Education 55, 3 (2010), 1171–1182.",
      "doi": "10.1016/j.compedu.2010.05.014"
    },
    {
      "text": "Santiago González Izard and Juan Antonio Juanes Méndez. 2016. Virtual Reality Medical Training System. In Proceedings of the Fourth International Conference on Technological Ecosystems for Enhancing Multiculturality (Salamanca, Spain) (TEEM ’16). Association for Computing Machinery, New York, NY, USA, 479–485. https://doi.org/10.1145/3012430.3012560",
      "doi": "10.1145/3012430.3012560"
    },
    {
      "text": "Filip Jaśkiewicz, Krystyna Teresa Frydrysiak, Katarzyna Starosta-Głowińska, and Dariusz Timler. 2019. The applicability of virtual reality in cardiopulmonary resuscitation training-opinion of medical prefessionals and students. Emergency Medical Service. Ratownictwo Medyczne 6, 1 (2019), 32–36.",
      "doi": ""
    },
    {
      "text": "Joshua Benjamin Kaplan, Aaron L Bergman, Michael Christopher, Sarah Bowen, and Matthew Hunsinger. 2017. Role of resilience in mindfulness training for first responders. Mindfulness 8, 5 (2017), 1373–1380.",
      "doi": ""
    },
    {
      "text": "Stamos Katsigiannis and Naeem Ramzan. 2017. DREAMER: A database for emotion recognition through EEG and ECG signals from wireless low-cost off-the-shelf devices. IEEE journal of biomedical and health informatics 22, 1(2017), 98–107.",
      "doi": ""
    },
    {
      "text": "Hannes Götz Kenngott, Anas Amin Preukschas, Martin Wagner, Felix Nickel, Michael Müller, Nadine Bellemann, Christian Stock, Markus Fangerau, Boris Radeleff, Hans-Ulrich Kauczor, 2018. Mobile, real-time, and point-of-care augmented reality is robust, accurate, and feasible: a prospective pilot study. Surgical endoscopy 32, 6 (2018), 2958–2967.",
      "doi": ""
    },
    {
      "text": "George Koutitas, Scott Smith, Grayson Lawrence, and Keith Noble. 2020. Smart responders for smart cities: A VR/AR training approach for next generation first responders. In Smart Cities in Application. Springer, 49–66.",
      "doi": ""
    },
    {
      "text": "Yeram Kwon, Sungwon Lee, Jihoon Jeong, and Wonjoon Kim. 2014. HeartiSense: A Novel Approach to Enable Effective Basic Life Support Training without an Instructor. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 1699–1704. https://doi.org/10.1145/2559206.2581284",
      "doi": "10.1145/2559206.2581284"
    },
    {
      "text": "Glyn Lawson, Davide Salanitri, and Brian Waterfield. 2016. Future directions for the development of virtual reality within an automotive manufacturer. Applied ergonomics 53(2016), 323–330.",
      "doi": ""
    },
    {
      "text": "Kwan Min Lee. 2004. Presence, explicated. Communication theory 14, 1 (2004), 27–50.",
      "doi": ""
    },
    {
      "text": "Jie Li, Guo Chen, Huib de Ridder, and Pablo Cesar. 2020. Designing a Social VR Clinic for Medical Consultations. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382836",
      "doi": "10.1145/3334480.3382836"
    },
    {
      "text": "Wei Liu, Adrian David Cheok, Charissa Kim Mei-Ling, and Yin Leng Theng. 2008. New teaching and learning experience with mixed reality technologies. International Journal of Arts and Technology 1, 2 (2008), 173–197. https://doi.org/10.1504/IJART.2008.021926",
      "doi": ""
    },
    {
      "text": "Cristian Lorenzini, Claudia Faita, Marcello Carrozzino, Franco Tecchia, and Massimo Bergamasco. 2015. VR-Based Serious Game Designed for Medical Ethics Training. In Proceedings of the Second International Conference on Augmented and Virtual Reality - Volume 9254. Springer-Verlag, Berlin, Heidelberg, 220–232. https://doi.org/10.1007/978-3-319-22888-4_16",
      "doi": "10.1007/978-3-319-22888-4_16"
    },
    {
      "text": "Le Luo, Dongdong Weng, Ni Ding, Jie Hao, and Ziqi Tu. 2022. The effect of avatar facial expressions on trust building in social virtual reality. The Visual Computer (2022), 1–14.",
      "doi": ""
    },
    {
      "text": "Elhassan Makled, Amal Yassien, Passant Elagroudy, Mohamed Magdy, Slim Abdennadher, and Nabila Hamdi. 2019. PathoGenius VR: VR Medical Training. In Proceedings of the 8th ACM International Symposium on Pervasive Displays (Palermo, Italy) (PerDis ’19). Association for Computing Machinery, New York, NY, USA, Article 31, 2 pages. https://doi.org/10.1145/3321335.3329694",
      "doi": "10.1145/3321335.3329694"
    },
    {
      "text": "Guido Makransky, Lau Lilleholt, and Anders Aaby. 2017. Development and validation of the Multimodal Presence Scale for virtual reality environments: A confirmatory factor analysis and item response theory approach. Computers in Human Behavior 72 (2017), 276–285.",
      "doi": "10.1016/j.chb.2017.02.066"
    },
    {
      "text": "Matteo Marucci, Gianluca Di Flumeri, Gianluca Borghini, Nicolina Sciaraffa, Michele Scandola, Enea Francesco Pavone, Fabio Babiloni, Viviana Betti, and Pietro Aricò. 2021. The impact of multisensory integration and perceptual load in virtual reality settings on performance, workload and presence. Scientific Reports 11, 1 (2021), 1–15.",
      "doi": ""
    },
    {
      "text": "Markus Murtinger, Emma Jaspaert, Helmut Schrom-Feiertag, and Sebastian Egger-Lampl. 2021. CBRNe training in virtual environments: SWOT analysis & practical guidelines. International Journal of Safety and Security Engineering 11, 4(2021), 295–303.",
      "doi": ""
    },
    {
      "text": "Markus Murtinger, Jakob Uhl, Helmut Schrom-Feiertag, Quynh Nguyen, Birgit Harthum, and Manfred Tscheligi. 2022. Assist the VR Trainer–Real-Time Dashboard and After-Action Review for Police VR Training. In 2022 IEEE International Conference on Metrology for Extended Reality, Artificial Intelligence and Neural Engineering (MetroXRAINE). IEEE, 69–74.",
      "doi": ""
    },
    {
      "text": "Quynh Nguyen, Emma Jaspaert, Markus Murtinger, Helmut Schrom-Feiertag, Sebastian Egger-Lampl, and Manfred Tscheligi. 2021. Stress Out: Translating Real-World Stressors into Audio-Visual Stress Cues in VR for Police Training. In IFIP Conference on Human-Computer Interaction – INTERACT 2021. Springer, Cham, 551–561. https://doi.org/10.1007/978-3-030-85616-8_32",
      "doi": "10.1007/978-3-030-85616-8_32"
    },
    {
      "text": "Felix Nickel, Julia A Brzoska, Matthias Gondan, Henriette M Rangnick, Jackson Chu, Hannes G Kenngott, Georg R Linke, Martina Kadmon, Lars Fischer, and Beat P Müller-Stich. 2015. Virtual reality training versus blended learning of laparoscopic cholecystectomy: a randomized controlled trial with laparoscopic novices. Medicine 94, 20 (2015).",
      "doi": ""
    },
    {
      "text": "Federica Pallavicini, Luca Argenton, Nicola Toniazzi, Luciana Aceti, and Fabrizia Mantovani. 2016. Virtual reality applications for stress management training in the military. Aerospace medicine and human performance 87, 12 (2016), 1021–1030.",
      "doi": ""
    },
    {
      "text": "Zhigeng Pan, Tianren Luo, Mingmin Zhang, Ning Cai, Yongheng Li, Jinda Miao, Zheng Li, Zhipeng Pan, Yuze Shen, and Jijian Lu. 2022. MagicChem: a MR system based on needs theory for chemical experiments. Virtual Reality 26, 1 (mar 2022), 279–294. https://doi.org/10.1007/s10055-021-00560-z",
      "doi": "10.1007/s10055-021-00560-z"
    },
    {
      "text": "George Papagiannakis, Paul Zikas, Nick Lydatakis, Steve Kateros, Mike Kentros, Efstratios Geronikolakis, Manos Kamarianakis, Ioanna Kartsonaki, and Giannis Evangelou. 2020. MAGES 3.0: Tying the Knot of Medical VR. In ACM SIGGRAPH 2020 Immersive Pavilion (Virtual Event, USA) (SIGGRAPH ’20). Association for Computing Machinery, New York, NY, USA, Article 6, 2 pages. https://doi.org/10.1145/3388536.3407888",
      "doi": "10.1145/3388536.3407888"
    },
    {
      "text": "Georg Regal, Helmut Schrom-Feiertag, Massimo Migliorini, Massimiliano Guarneri, Daniele Di Giovanni, Andrea D’Angelo, and Markus Murtinger. 2022. Challenges in Virtual Reality Training for CRBN Events. In International Conference on Extended Reality. Springer, 79–88.",
      "doi": ""
    },
    {
      "text": "Georg Regal, Helmut Schrom-Feiertag, Quynh Nguyen, Marco Aust, Markus Murtinger, Dorothé Smit, Manfred Tscheligi, and Mark Billinghurst. 2022. VR [we are] Training-Workshop on Collaborative Virtual Training for Challenging Contexts. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–6.",
      "doi": "10.1145/3491101.3503710"
    },
    {
      "text": "Georg Regal, Jakob Carl Uhl, Anna Gerhardus, Stefan Suette, Elisabeth Frankus, Julia Schmid, Simone Kriglstein, and Manfred Tscheligi. 2022. Marcus or Mira - Investigating the Perception of Virtual Agent Gender in Virtual Reality Role Play-Training. In Proceedings of the 28th ACM Symposium on Virtual Reality Software and Technology (Tsukuba, Japan) (VRST ’22). Association for Computing Machinery, New York, NY, USA, Article 10, 11 pages. https://doi.org/10.1145/3562939.3565629",
      "doi": "10.1145/3562939.3565629"
    },
    {
      "text": "Maximilian Rettinger, Niklas Müller, Christopher Holzmann-Littig, Marjo Wijnen-Meijer, Gerhard Rigoll, and Christoph Schmaderer. 2021. VR-Based Equipment Training for Health Professionals. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 252, 6 pages. https://doi.org/10.1145/3411763.3451766",
      "doi": "10.1145/3411763.3451766"
    },
    {
      "text": "David Scherfgen and Jonas Schild. 2021. Estimating the Pose of a Medical Manikin for Haptic Augmentation of a Virtual Patient in Mixed Reality Training. In Symposium on Virtual and Augmented Reality(Virtual Event, Brazil) (SVR’21). Association for Computing Machinery, New York, NY, USA, 33–41. https://doi.org/10.1145/3488162.3488166",
      "doi": "10.1145/3488162.3488166"
    },
    {
      "text": "Helmut Schrom-Feiertag, Volker Settgast, and Stefan Seer. 2017. Evaluation of indoor guidance systems using eye tracking in an immersive virtual environment. Spatial Cognition & Computation 17, 1-2 (2017), 163–183.",
      "doi": ""
    },
    {
      "text": "Stephanie Schwarz, Georg Regal, Marina Kempf, and Raimund Schatz. 2020. Learning Success in Immersive Virtual Reality Training Environments: Practical Evidence from Automotive Assembly. ACM, New York, NY, USA. https://doi.org/10.1145/3419249.3420182",
      "doi": "10.1145/3419249.3420182"
    },
    {
      "text": "Federico Semeraro, Antonio Frisoli, Massimo Bergamasco, and Erga L. Cerchiari. 2009. Virtual reality enhanced mannequin (VREM) that is well received by resuscitation experts. Resuscitation 80, 4 (2009), 489–492. https://doi.org/10.1016/j.resuscitation.2008.12.016",
      "doi": ""
    },
    {
      "text": "Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (2009), 3549–3557.",
      "doi": ""
    },
    {
      "text": "Ana Margarida Sousa and Teresa Romão. 2021. Encouraging Chemistry Learning Through an Augmented Reality Magic Game. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 12934 LNCS (2021), 12–21. https://doi.org/10.1007/978-3-030-85613-7_2",
      "doi": "10.1007/978-3-030-85613-7_2"
    },
    {
      "text": "Paweł M Strojny, Natalia Dużmańska-Misiarczyk, Natalia Lipp, and Agnieszka Strojny. 2020. Moderators of social facilitation effect in virtual reality: Co-presence and realism of virtual agents. Frontiers in psychology 11 (2020), 1252.",
      "doi": ""
    },
    {
      "text": "Jakob C Uhl, Markus Murtinger, Olivia Zechner, and Manfred Tscheligi. 2022. Threat Assessment in Police VR Training: Multi-Sensory Cues for Situation Awareness. In 2022 IEEE International Conference on Metrology for Extended Reality, Artificial Intelligence and Neural Engineering (MetroXRAINE). IEEE, 432–437.",
      "doi": ""
    },
    {
      "text": "EA Van Wyk and MR De Villiers. 2019. An evaluation framework for virtual reality safety training systems in the South African mining industry. Journal of the Southern African Institute of Mining and Metallurgy 119, 5(2019), 427–436.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh, James YL Thong, and Xin Xu. 2012. Consumer acceptance and use of information technology: extending the unified theory of acceptance and use of technology. MIS quarterly (2012), 157–178.",
      "doi": ""
    },
    {
      "text": "Torben Volkmann, Daniel Wessel, Nicole Jochems, and Thomas Franke. 2018. German Translation of the Multimodal Presence Scale. Mensch und Computer 2018-Tagungsband(2018).",
      "doi": ""
    },
    {
      "text": "Xiangyu Wang and Phillip S Dunston. 2013. Tangible mixed reality for remote design review: a study understanding user perception and acceptance. Visualization in Engineering 1, 1 (2013), 1–15.",
      "doi": ""
    },
    {
      "text": "Paul Zikas, Manos Kamarianakis, Ioanna Kartsonaki, Nick Lydatakis, Steve Kateros, Mike Kentros, Efstratios Geronikolakis, Giannis Evangelou, Achilles Apostolou, Paolo Alejandro Alejandro Catilo, and George Papagiannakis. 2021. Covid-19 - VR Strikes Back: Innovative Medical VR Training. In ACM SIGGRAPH 2021 Immersive Pavilion (Virtual Event, USA) (SIGGRAPH ’21). Association for Computing Machinery, New York, NY, USA, Article 11, 2 pages. https://doi.org/10.1145/3450615.3464546",
      "doi": "10.1145/3450615.3464546"
    }
  ]
}