{
  "doi": "10.1145/3544548.3581261",
  "title": "Coding Together: On Co-located and Remote Collaboration between Children with Mixed-Visual Abilities",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Collaborative coding environments foster learning, social skills, computational thinking training, and supportive relationships. In the context of inclusive education, these environments have the potential to promote inclusive learning activities for children with mixed-visual abilities. However, there is limited research focusing on remote collaborative environments, despite the opportunity to design new modes of access and control of content to promote more equitable learning experiences. We investigated the tradeoffs between remote and co-located collaboration through a tangible coding kit. We asked ten pairs of mixed-visual ability children to collaborate in an interdependent and asymmetric coding game. We contribute insights on six dimensions - effectiveness, computational thinking, accessibility, communication, cooperation, and engagement - and reflect on differences, challenges, and advantages between collaborative settings related to communication, workspace awareness, and computational thinking training. Lastly, we discuss design opportunities of tangibles, audio, roles, and tasks to create inclusive learning activities in remote and co-located settings.",
  "tags": [
    "Collaboration",
    "Accessible",
    "Children",
    "Visually impaired",
    "Tangible",
    "Mixed-visual ability",
    "Robot",
    "Computational thinking"
  ],
  "authors": [
    {
      "name": "Filipa Rocha",
      "institution": "LASIGE, Faculdade de Ciências, Universidade de Lisboa, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659542490",
      "orcid": "0000-0002-8521-7318"
    },
    {
      "name": "Filipa Correia",
      "institution": "ITI, LARSYS, Instituto Superior Técnico, Universidade de Lisboa, Portugal",
      "img": "/do/10.1145/contrib-99658994028/rel-imgonly/filipa_small.png",
      "acmid": "99658994028",
      "orcid": "0000-0002-1592-9694"
    },
    {
      "name": "Isabel Neto",
      "institution": "INESC-ID, University of Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659542051",
      "orcid": "0000-0003-2515-0446"
    },
    {
      "name": "Ana Cristina Pires",
      "institution": "ITI, LARSYS, Instituto Superior Técnico, Universidade de Lisboa, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196344",
      "orcid": "0000-0001-7747-7112"
    },
    {
      "name": "João Guerreiro",
      "institution": "LASIGE, Faculdade de Ciências, Universidade de Lisboa, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467649970",
      "orcid": "0000-0002-0952-8368"
    },
    {
      "name": "Tiago Guerreiro",
      "institution": "LASIGE, Faculdade de Ciências, Universidade de Lisboa, Portugal",
      "img": "/do/10.1145/contrib-81350573788/rel-imgonly/aa.jpg",
      "acmid": "81350573788",
      "orcid": "0000-0002-0333-5792"
    },
    {
      "name": "Hugo Nicolau",
      "institution": "ITI, LARSYS, Universidade de Lisboa, Portugal",
      "img": "/do/10.1145/contrib-81416594384/rel-imgonly/me_small.png",
      "acmid": "81416594384",
      "orcid": "0000-0002-8176-7638"
    }
  ],
  "references": [
    {
      "text": "Khaled Albusays, Stephanie Ludi, and Matt Huenerfauth. 2017. Interviews and Observation of Blind Software Developers at Work to Understand Code Navigation Challenges. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 91–100. https://doi.org/10.1145/3132525.3132550",
      "doi": "10.1145/3132525.3132550"
    },
    {
      "text": "Stefanie Angelia, Naohisa Ohta, and Kazunori Sugiura. 2015. Design and Evaluation of Educational Kinesthetic Game to Encourage Collaboration for Kindergarten Children. In Proceedings of the 12th International Conference on Advances in Computer Entertainment Technology (Iskandar, Malaysia) (ACE ’15). Association for Computing Machinery, New York, NY, USA, Article 19, 5 pages. https://doi.org/10.1145/2832932.2832967",
      "doi": "10.1145/2832932.2832967"
    },
    {
      "text": "Cristiana Antunes, Isabel Neto, Filipa Correia, Ana Paiva, and Hugo Nicolau. 2022. Inclusive’R’Stories: An Inclusive Storytelling Activity with an Emotional Robot. In Proceedings of the 2022 ACM/IEEE International Conference on Human-Robot Interaction. 90–100.",
      "doi": ""
    },
    {
      "text": "Lucia Gabriela Caguana Anzoategui, Maria Isabel Alves Rodrigues Pereira, and Monica del Carmen Solís Jarrín. 2017. Cubetto for preschoolers: Computer programming code to code. In 2017 International Symposium on Computers in Education (SIIE). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence as a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility(Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 161–173. https://doi.org/10.1145/3234695.3236348",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Marina Umaschi Bers. 2017. Coding as a Playground. Routledge. https://doi.org/10.4324/9781315398945",
      "doi": ""
    },
    {
      "text": "Marina Umaschi Bers. 2018. Coding, playgrounds and literacy in early childhood education: The development of KIBO robotics and ScratchJr. In 2018 IEEE global engineering education conference (EDUCON). IEEE, 2094–2102.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4, 589–597. https://doi.org/10.1080/2159676X.2019.1628806 arXiv:https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Erik Brynjolfsson, John J Horton, Adam Ozimek, Daniel Rock, Garima Sharma, and Hong-Yi TuYe. 2020. COVID-19 and remote work: An early look at US data. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Logan B Caraco, Sebastian Deibel, Yufan Ma, and Lauren R Milne. 2019. Making the blockly library accessible via touchscreen. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 648–650.",
      "doi": "10.1145/3308561.3354589"
    },
    {
      "text": "Gonçalo Cardoso, Ana Cristina Pires, Lúcia Verónica Abreu, Filipa Rocha, and Tiago Guerreiro. 2021. LEGOWorld: Repurposing Commodity Tools & Technologies to Create an Accessible and Customizable Programming Environment. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 273, 6 pages. https://doi.org/10.1145/3411763.3451710",
      "doi": "10.1145/3411763.3451710"
    },
    {
      "text": "Quentin Chibaudel, Wafa Johal, Bernard Oriola, Marc J-M Macé, Pierre Dillenbourg, Valérie Tartas, and Christophe Jouffrais. 2020. \"If You’ve Gone Straight, Now, You Must Turn Left\" - Exploring the Use of a Tangible Interface in a Collaborative Treasure Hunt for People with Visual Impairments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility(Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 19, 10 pages. https://doi.org/10.1145/3373625.3417020",
      "doi": "10.1145/3373625.3417020"
    },
    {
      "text": "Clare Cullen and Oussama Metatla. 2019. Co-Designing Inclusive Multisensory Story Mapping with Children with Mixed Visual Abilities. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (Boise, ID, USA) (IDC ’19). Association for Computing Machinery, New York, NY, USA, 361–373. https://doi.org/10.1145/3311927.3323146",
      "doi": "10.1145/3311927.3323146"
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. \"It Doesn’t Win You Friends\": Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 191 (nov 2019), 26 pages. https://doi.org/10.1145/3359293",
      "doi": "10.1145/3359293"
    },
    {
      "text": "Maitraye Das, Anne Marie Piper, and Darren Gergle. 2022. Design and Evaluation of Accessible Collaborative Writing Techniques for People with Vision Impairments. ACM Trans. Comput.-Hum. Interact. 29, 2, Article 9 (jan 2022), 42 pages. https://doi.org/10.1145/3480169",
      "doi": "10.1145/3480169"
    },
    {
      "text": "Paul Dourish and Victoria Bellotti. 1992. Awareness and Coordination in Shared Workspaces. In Proceedings of the 1992 ACM Conference on Computer-Supported Cooperative Work (Toronto, Ontario, Canada) (CSCW ’92). Association for Computing Machinery, New York, NY, USA, 107–114. https://doi.org/10.1145/143457.143468",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Caitlin Duncan, Tim Bell, and Steve Tanimoto. 2014. Should your 8-year-old learn coding?. In Proceedings of the 9th Workshop in Primary and Secondary Computing Education. 60–69.",
      "doi": "10.1145/2670757.2670774"
    },
    {
      "text": "Ralph J Erickson. 1985. PLAY CONTRIBUTES TO THE FULL EMOTIONAL DEVELOPMENT OF THE CHILD.Education 105(1985), 261. Issue 3. https://search.ebscohost.com/login.aspx?direct=true&db=a9h&AN=4731911&lang=pt-pt&site=eds-live&scope=site",
      "doi": ""
    },
    {
      "text": "Katherine G. Franceschi, Ronald M. Lee, and David Hinds. 2008. Engaging E-Learning in Virtual Worlds: Supporting Group Collaboration. In Proceedings of the 41st Annual Hawaii International Conference on System Sciences (HICSS 2008). 7–7. https://doi.org/10.1109/HICSS.2008.146",
      "doi": "10.1109/HICSS.2008.146"
    },
    {
      "text": "Neil Fraser. 2015. Ten things we’ve learned from Blockly. In 2015 IEEE Blocks and Beyond Workshop (Blocks and Beyond). IEEE, 49–50.",
      "doi": "10.1109/BLOCKS.2015.7369000"
    },
    {
      "text": "Vinitha Gadiraju, Annika Muehlbradt, and Shaun K. Kane. 2020. BrailleBlocks: Computational Braille Toys for Collaborative Learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376295",
      "doi": "10.1145/3313831.3376295"
    },
    {
      "text": "Franca Garzotto. 2007. Investigating the Educational Effectiveness of Multiplayer Online Games for Children. In Proceedings of the 6th International Conference on Interaction Design and Children (Aalborg, Denmark) (IDC ’07). Association for Computing Machinery, New York, NY, USA, 29–36. https://doi.org/10.1145/1297277.1297284",
      "doi": "10.1145/1297277.1297284"
    },
    {
      "text": "Anuradha Gokhale. 1995. Collaborative learning enhances critical thinking. Journal of Technology education 7, 1 (1995).",
      "doi": ""
    },
    {
      "text": "David Gonçalves, André Rodrigues, Mike L Richardson, Alexandra A de Sousa, Michael J Proulx, and Tiago Guerreiro. 2021. Exploring asymmetric roles in mixed-ability gaming. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445494"
    },
    {
      "text": "Google. [n.d.]. Google’s Blockly. https://github.com/google/blockly-experimental.",
      "doi": ""
    },
    {
      "text": "Monica Gori, Giulia Cappagli, Alessia Tonelli, Gabriel Baud-Bovy, and Sara Finocchietti. 2016. Devices for visually impaired people: High technological devices with low user acceptance and no adaptability for children. Neuroscience & Biobehavioral Reviews 69 (2016), 79–88. https://doi.org/10.1016/j.neubiorev.2016.06.043",
      "doi": ""
    },
    {
      "text": "Shuchi Grover. 2020. Designing an Assessment for Introductory Programming Concepts in Middle School Computer Science. In Proceedings of the 51st ACM Technical Symposium on Computer Science Education (Portland, OR, USA) (SIGCSE ’20). Association for Computing Machinery, New York, NY, USA, 678–684. https://doi.org/10.1145/3328778.3366896",
      "doi": "10.1145/3328778.3366896"
    },
    {
      "text": "Shuchi Grover and Roy Pea. 2013. Computational thinking in K–12: A review of the state of the field. Educational researcher 42, 1 (2013), 38–43.",
      "doi": ""
    },
    {
      "text": "Arzu Güneysu Özgür, Hala Khodr, Mehdi Akeddar, Michael Roust, and Pierre Dillenbourg. 2022. Designing Online Multiplayer Games with Haptically and Virtually Linked Tangible Robots to Enhance Social Interaction in Therapy. 31st IEEE International Conference on Robot & Human Interactive Communication (RO-MAN).",
      "doi": ""
    },
    {
      "text": "Alex Hadwen-Bennett, Sue Sentance, and Cecily Morrison. 2018. Making Programming Accessible to Learners with Visual Impairments: A Literature Review. International Journal of Computer Science Education in Schools 2 (05 2018). https://doi.org/10.21585/ijcses.v2i2.25",
      "doi": ""
    },
    {
      "text": "Kathy Hirsh-Pasek, Jennifer M. Zosh, Roberta Michnick Golinkoff, James H. Gray, Michael B. Robb, and Jordy Kaufman. 2015. Putting Education in “Educational” Apps: Lessons From the Science of Learning. Psychological Science in the Public Interest 16, 1 (2015), 3–34. https://doi.org/10.1177/1529100615569721 arXiv:https://doi.org/10.1177/1529100615569721PMID: 25985468.",
      "doi": ""
    },
    {
      "text": "Felix Hu, Ariel Zekelman, Michael Horn, and Frances Judd. 2015. Strawbies: Explorations in Tangible Programming. In Proceedings of the 14th International Conference on Interaction Design and Children (Boston, Massachusetts) (IDC ’15). Association for Computing Machinery, New York, NY, USA, 410–413. https://doi.org/10.1145/2771839.2771866",
      "doi": "10.1145/2771839.2771866"
    },
    {
      "text": "Rie Kamikubo, Naoya Kato, Keita Higuchi, Ryo Yonetani, and Yoichi Sato. 2020. Support Strategies for Remote Guides in Assisting People with Visual Impairments for Effective Indoor Navigation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376823",
      "doi": "10.1145/3313831.3376823"
    },
    {
      "text": "Shaun K. Kane and Jeffrey P. Bigham. 2014. Tracking @stemxcomet: Teaching Programming to Blind Students via 3D Printing, Crisis Management, and Twitter. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (Atlanta, Georgia, USA) (SIGCSE ’14). Association for Computing Machinery, New York, NY, USA, 247–252. https://doi.org/10.1145/2538862.2538975",
      "doi": "10.1145/2538862.2538975"
    },
    {
      "text": "Varsha Koushik, Darren Guinness, and Shaun K. Kane. 2019. StoryBlocks: A Tangible Programming Game To Create Accessible Audio Stories. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300722",
      "doi": "10.1145/3290605.3300722"
    },
    {
      "text": "Marjan Laal and Seyed Mohammad Ghodsi. 2012. Benefits of collaborative learning. Procedia-social and behavioral sciences 31 (2012), 486–490.",
      "doi": ""
    },
    {
      "text": "Bobby Law. 2016. Puzzle games: a metaphor for computational thinking. In Proceedings of the 10th European Conference on Games Based Learning, Thomas Connolly and Liz Boyle (Eds.). Academic Conferences and Publishing International Limited, 344–353. Check first pub date; not available online (query to publisher 20-1-17; used 31-10-16 as publisher gave date of Oct16, see email 2-2-17) AAM provided 18/1/17; contacted publisher re permissions (rc’d email 31-1-17 about another paper from same publisher) Link to ToC for proceedings: http://toc.proceedings.com/31939webtoc.pdf.",
      "doi": ""
    },
    {
      "text": "Cheuk Yin Phipson Lee, Zhuohao Zhang, Jaylin Herskovitz, JooYoung Seo, and Anhong Guo. 2022. CollabAlly: Accessible Collaboration Awareness in Document Editing. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 596, 17 pages. https://doi.org/10.1145/3491102.3517635",
      "doi": "10.1145/3491102.3517635"
    },
    {
      "text": "Jessica Lipnack and Jeffrey Stamps. 1999. Virtual teams: The new way to work. Strategy & Leadership(1999).",
      "doi": ""
    },
    {
      "text": "Muhanad S. Manshad, Enrico Pontelli, and Shakir J. Manshad. 2013. Exploring Tangible Collaborative Distance Learning Environments for the Blind and Visually Impaired. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 55–60. https://doi.org/10.1145/2468356.2468367",
      "doi": "10.1145/2468356.2468367"
    },
    {
      "text": "Nancy L. McElwain and Brenda L. Volling. 2005. Preschool children’s interactions with friends and older siblings: relationship specificity and joint contributions to problem behavior.Journal of Family Psychology 19 (2005), 486–496. Issue 4. https://doi.org/10.1037/0893-3200.19.4.486",
      "doi": ""
    },
    {
      "text": "Daniel Mendes, Sofia Reis, João Guerreiro, and Hugo Nicolau. 2020. Collaborative tabletops for blind people: The effect of auditory design on workspace awareness. Proceedings of the ACM on Human-Computer Interaction 4, ISS(2020), 1–19.",
      "doi": "10.1145/3427325"
    },
    {
      "text": "Oussama Metatla. 2016. Workspace awareness in collaborative audio-only interaction with diagrams. In Proceedings of the First African Conference on Human Computer Interaction. 165–169.",
      "doi": "10.1145/2998581.2998598"
    },
    {
      "text": "Oussama Metatla, Sandra Bardot, Clare Cullen, Marcos Serrano, and Christophe Jouffrais. 2020. Robots for Inclusive Play: Co-Designing an Educational Game With Visually Impaired and Sighted Children. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376270",
      "doi": "10.1145/3313831.3376270"
    },
    {
      "text": "Oussama Metatla, Alison Oldfield, Taimur Ahmed, Antonis Vafeas, and Sunny Miglani. 2019. Voice User Interfaces in Schools: Co-Designing for Inclusion with Visually-Impaired and Sighted Pupils. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300608",
      "doi": "10.1145/3290605.3300608"
    },
    {
      "text": "Lauren R Milne and Richard E Ladner. 2018. Blocks4All: Overcoming Accessibility Barriers to Blocks Programming for Children with Visual Impairments. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018), 69:1–69:10. https://doi.org/10.1145/3173574.3173643",
      "doi": "10.1145/3173574.3173643"
    },
    {
      "text": "Jonas Moll and Eva-Lotta Sallnäs Pysander. 2013. A Haptic Tool for Group Work on Geometrical Concepts Engaging Blind and Sighted Pupils. ACM Trans. Access. Comput. 4, 4, Article 14 (jul 2013), 37 pages. https://doi.org/10.1145/2493171.2493172",
      "doi": "10.1145/2493171.2493172"
    },
    {
      "text": "Francesco Mondada, Michael Bonani, Fanny Riedo, Manon Briod, Léa Pereyre, Philippe Rétornaz, and Stéphane Magnenat. 2017. Bringing robotics to formal education: The thymio open-source hardware robot. IEEE Robotics & Automation Magazine 24, 1 (2017), 77–85.",
      "doi": ""
    },
    {
      "text": "Cecily Morrison, Nicolas Villar, Anja Thieme, Zahra Ashktorab, Eloise Taysom, Oscar Salandin, Daniel Cletheroe, Greg Saul, Alan F Blackwell, Darren Edge, Martin Grayson, and Haiyan Zhang. 2018. Torino: A Tangible Programming Language Inclusive of Children with Visual Disabilities. Human–Computer Interaction 35, 3, 191–239. https://doi.org/10.1080/07370024.2018.1512413 arXiv:https://doi.org/10.1080/07370024.2018.1512413",
      "doi": ""
    },
    {
      "text": "Aboubakar Mountapmbeme and Stephanie Ludi. 2021. How Teachers of the Visually Impaired Compensate with the Absence of Accessible Block-Based Languages. The 23rd International ACM SIGACCESS Conference on Computers and Accessibility, 1–10. https://doi.org/10.1145/3441852.3471221",
      "doi": "10.1145/3441852.3471221"
    },
    {
      "text": "Aboubakar Mountapmbeme, Obianuju Okafor, and Stephanie Ludi. 2022. Addressing Accessibility Barriers in Programming for People with Visual Impairments: A Literature Review. ACM Transactions on Accessible Computing 15 (3 2022), 1–26. Issue 1. https://doi.org/10.1145/3507469",
      "doi": "10.1145/3507469"
    },
    {
      "text": "Isabel Neto, Wafa Johal, Marta Couto, Hugo Nicolau, Ana Paiva, and Arzu Guneysu. 2020. Using Tabletop Robots to Promote Inclusive Classroom Experiences. In Proceedings of the Interaction Design and Children Conference (London, United Kingdom) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 281–292. https://doi.org/10.1145/3392063.3394439",
      "doi": "10.1145/3392063.3394439"
    },
    {
      "text": "Isabel Neto, Hugo Nicolau, and Ana Paiva. 2021. Community Based Robot Design for Classrooms with Mixed Visual Abilities Children. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445135"
    },
    {
      "text": "Osmo. [n.d.]. Coding Starter Kit. https://www.playosmo.com/en/shopping/kits/coding/.",
      "doi": ""
    },
    {
      "text": "Ozobot. [n.d.]. Ozobot Evo. https://shop.ozobot.com.",
      "doi": ""
    },
    {
      "text": "A. D. Pellegrini and Peter K. Smith. 1998. Physical Activity Play: The Nature and Function of a Neglected Aspect of Play. Child Development 69 (6 1998), 577–598. Issue 3. https://doi.org/10.1111/j.1467-8624.1998.tb06226.x",
      "doi": ""
    },
    {
      "text": "Ana Cristina Pires, Filipa Rocha, Antonio José de Barros Neto, Hugo Simão, Hugo Nicolau, and Tiago Guerreiro. 2020. Exploring Accessible Programming with Educators and Visually Impaired Children. In Proceedings of the Interaction Design and Children Conference (London, United Kingdom) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 148–160. https://doi.org/10.1145/3392063.3394437",
      "doi": "10.1145/3392063.3394437"
    },
    {
      "text": "Venkatesh Potluri, Maulishree Pandey, Andrew Begel, Michael Barnett, and Scott Reitherman. 2022. CodeWalk: Facilitating Shared Awareness in Mixed-Ability Collaborative Software Development. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility (Athens, Greece) (ASSETS ’22). Association for Computing Machinery, New York, NY, USA, Article 20, 16 pages. https://doi.org/10.1145/3517428.3544812",
      "doi": "10.1145/3517428.3544812"
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, 2009. Scratch: programming for all. Commun. ACM 52, 11 (2009), 60–67.",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Filipa Rocha, Ana Cristina Pires, Isabel Neto, Hugo Nicolau, and Tiago Guerreiro. 2021. Accembly at Home: Accessible Spatial Programming for Children with Visual Impairments and Their Families. In Interaction Design and Children (Athens, Greece) (IDC ’21). Association for Computing Machinery, New York, NY, USA, 100–111. https://doi.org/10.1145/3459990.3460699",
      "doi": "10.1145/3459990.3460699"
    },
    {
      "text": "Zhiyi Rong, Ngo Fung Chan, Taizhou Chen, and Kening Zhu. 2020. CodeRhythm: A Tangible Programming Toolkit for Visually Impaired Students. In The eighth International Workshop of Chinese CHI. 57–60.",
      "doi": ""
    },
    {
      "text": "Eva-Lotta Sallnäs, Kajsa Bjerstedt-Blom, Fredrik Winberg, and Kerstin Severinson Eklundh. 2006. Navigation and control in haptic applications shared by blind and sighted users. In International Workshop on Haptic and Audio Interaction Design. Springer, 68–80.",
      "doi": "10.1007/11821731_7"
    },
    {
      "text": "Magy Seif El-Nasr, Bardia Aghabeigi, David Milam, Mona Erfani, Beth Lameman, Hamid Maygoli, and Sang Mah. 2010. Understanding and Evaluating Cooperative Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 253–262. https://doi.org/10.1145/1753326.1753363",
      "doi": "10.1145/1753326.1753363"
    },
    {
      "text": "Amanda Strawhacker and Marina Umaschi Bers. 2019. What they learn when they learn coding: investigating cognitive domains and computer programming knowledge in young children. Educational Technology Research and Development 67, 3(2019), 541–575.",
      "doi": ""
    },
    {
      "text": "Judith E Terpstra and Ronald Tamura. 2008. Effective social interaction strategies for inclusive settings. Early Childhood Education Journal 35, 5 (2008), 405–411.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Cecily Morrison, Nicolas Villar, Martin Grayson, and Siân Lindley. 2017. Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 739–752. https://doi.org/10.1145/3064663.3064689",
      "doi": "10.1145/3064663.3064689"
    },
    {
      "text": "Thingiverse. [n.d.]. 3D crate. https://www.thingiverse.com/thing:2975591.",
      "doi": ""
    },
    {
      "text": "Thingiverse. [n.d.]. 3D Ozobot pusher. https://www.thingiverse.com/thing:2218396.",
      "doi": ""
    },
    {
      "text": "Nicolas Villar, Cecily Morrison, Daniel Cletheroe, Tim Regan, Anja Thieme, and Greg Saul. 2019. Physical Programming for Blind and Low Vision Children at Scale. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3290607.3313241",
      "doi": "10.1145/3290607.3313241"
    },
    {
      "text": "Mirza Waqar, Muhammad Aslam, and Muhammad Farhan. 2019. An Intelligent and Interactive Interface to Support Symmetrical Collaborative Educational Writing among Visually Impaired and Sighted Users. Symmetry 11, 2 (Feb 2019), 238. https://doi.org/10.3390/sym11020238",
      "doi": ""
    },
    {
      "text": "David Weintrop and Uri Wilensky. 2015. To block or not to block, that is the question: students’ perceptions of blocks-based programming. In Proceedings of the 14th international conference on interaction design and children. 199–208.",
      "doi": "10.1145/2771839.2771860"
    },
    {
      "text": "Cameron Wilson, Leigh Ann Sudol, Chris Stephenson, and Mark Stehlik. 2010. Running on empty: The failure to teach k–12 computer science in the digital age. ACM.",
      "doi": ""
    },
    {
      "text": "Fredrik Winberg and John Bowers. 2004. Assembling the senses: towards the design of cooperative interfaces for visually impaired users. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. 332–341.",
      "doi": "10.1145/1031607.1031662"
    },
    {
      "text": "Jeannette M. Wing. 2006. Computational Thinking. Commun. ACM 49, 3 (March 2006), 33–35. https://doi.org/10.1145/1118178.1118215",
      "doi": "10.1145/1118178.1118215"
    },
    {
      "text": "Jeannette M Wing. 2014. Computational thinking benefits society. 40th anniversary blog of social issues in computing 2014 (2014), 26.",
      "doi": ""
    },
    {
      "text": "Junnan Yu, Chenke Bai, and Ricarose Roque. 2020. Considering Parents in Coding Kit Design: Understanding Parents’ Perspectives and Roles. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376130",
      "doi": "10.1145/3313831.3376130"
    },
    {
      "text": "Junnan Yu, Clement Zheng, Mariana Aki Tamashiro, Christopher Gonzalez-millan, and Ricarose Roque. 2020. CodeAttach: engaging children in computational thinking through physical play activities. In Proceedings of the fourteenth international conference on tangible, embedded, and embodied interaction. 453–459.",
      "doi": "10.1145/3374920.3374972"
    },
    {
      "text": "Zhuohao Zhang, Zhilin Zhang, Haolin Yuan, Natã M Barbosa, Sauvik Das, and Yang Wang. 2021. {WebAlly}: Making Visual Task-based {CAPTCHAs} Transferable for People with Visual Impairments. In Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021). 281–298.",
      "doi": ""
    }
  ]
}