{
  "doi": "10.1145/3544548.3580888",
  "title": "Induce a Blink of the Eye: Evaluating Techniques for Triggering Eye Blinks in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2023,
  "badges": [],
  "abstract": "As more and more virtual reality (VR) headsets support eye tracking, recent techniques started to use eye blinks to induce unnoticeable manipulations to the virtual environment, e.g., to redirect users’ actions. However, to exploit their full potential, more control over users’ blinking behavior in VR is required. To this end, we propose a set of reflex-based blink triggers that are suited specifically for VR. In accordance with blink-based techniques for redirection, we formulate (i) effectiveness, (ii) efficiency, (iii) reliability, and (iv) unobtrusiveness as central requirements for successful triggers. We implement the soft- and hardware-based methods and compare the four most promising approaches in a user study. Our results highlight the pros and cons of the tested triggers, and show those based on the menace, corneal, and dazzle reflexes to perform best. From these results, we derive recommendations that help choosing suitable blink triggers for VR applications.",
  "authors": [
    {
      "name": "André Zenner",
      "institution": "Saarland University, Saarland Informatics Campus, Germany and German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Germany",
      "img": "/do/10.1145/contrib-87958809157/rel-imgonly/bild-andre-zenner-klein.jpg",
      "acmid": "87958809157",
      "orcid": "0000-0003-3386-1635"
    },
    {
      "name": "Kristin Ullmann",
      "institution": "Saarland University, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781701",
      "orcid": "0000-0003-4084-8543"
    },
    {
      "name": "Oscar Ariza",
      "institution": "Universität Hamburg, Germany",
      "img": "/do/10.1145/contrib-81319487799/rel-imgonly/81319487799.png",
      "acmid": "81319487799",
      "orcid": "0000-0001-8130-840X"
    },
    {
      "name": "Frank Steinicke",
      "institution": "Universität Hamburg, Germany",
      "img": "/do/10.1145/contrib-81313483772/rel-imgonly/steinicke-sit2-sm.jpg",
      "acmid": "81313483772",
      "orcid": "0000-0001-9879-7414"
    },
    {
      "name": "Antonio Krüger",
      "institution": "Saarland University, Saarland Informatics Campus, Germany and German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi and Sean Follmer. 2018. Visuo-Haptic Illusions for Improving the Perceived Performance of Shape Displays. In Proceedings of the ACM Conference on Human Factors in Computing Systems(CHI’18). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173724",
      "doi": "10.1145/3173574.3173724"
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the ACM Conference on Human Factors in Computing Systems(CHI’16). ACM, New York, NY, USA, 1968–1979. https://doi.org/10.1145/2858036.2858226",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Benjamin Bolte and Markus Lappe. 2015. Subliminal Reorientation and Repositioning in Immersive Virtual Environments using Saccadic Suppression. IEEE Transactions on Visualization and Computer Graphics 21, 4(2015), 545–552. https://doi.org/10.1109/TVCG.2015.2391851",
      "doi": "10.1109/TVCG.2015.2391851"
    },
    {
      "text": "Davina Bristow, John-Dylan Haynes, Richard Sylvester, Christopher D. Frith, and Geraint Rees. 2005. Blinking Suppresses the Neural Response to Unchanging Retinal Stimulation. Current Biology 15, 14 (July 2005), 1296–1300. https://doi.org/10.1016/j.cub.2005.06.025",
      "doi": ""
    },
    {
      "text": "Jack Brookes, Matthew Warburton, Mshari Alghadier, Mark Mon-Williams, and Faisal Mushtaq. 2020. Studying Human Behavior with Virtual Reality: The Unity Experiment Framework. Behavior Research Methods 52, 2 (2020), 455––463. https://doi.org/10.3758/s13428-019-01242-0",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D. Wilson. 2017. Sparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive Prop. In Proceedings of the ACM Conference on Human Factors in Computing Systems(CHI’17). ACM, New York, NY, USA, 3718–3728. https://doi.org/10.1145/3025453.3025753",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Aldrich Clarence, Jarrod Knibbe, Maxime Cordeil, and Michael Wybrow. 2021. Unscripted Retargeting: Reach Prediction for Haptic Retargeting in Virtual Reality. In Proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces(VR’21). IEEE, New York, NY, USA, 150–159. https://doi.org/10.1109/VR50410.2021.00036",
      "doi": ""
    },
    {
      "text": "Tarik Crnovrsanin, Yang Wang, and Kwan-Liu Ma. 2014. Stimulating a Blink: Reduction of Eye Fatigue with Visual Stimulus. In Proceedings of the ACM Conference on Human Factors in Computing Systems(CHI’14). ACM, New York, NY, USA, 2055–2064. https://doi.org/10.1145/2556288.2557129",
      "doi": "10.1145/2556288.2557129"
    },
    {
      "text": "Artem Dementyev and Christian Holz. 2017. DualBlink: A Wearable Device to Continuously Detect, Track, and Actuate Blinking For Alleviating Dry Eyes and Computer Vision Syndrome. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 1 (March 2017), 1–19. https://doi.org/10.1145/3053330",
      "doi": "10.1145/3053330"
    },
    {
      "text": "Mark S. Dennison, A. Zachary Wisti, and Michael D’Zmura. 2016. Use of Physiological Signals to Predict Cybersickness. Displays 44(2016), 42–52. https://doi.org/10.1016/j.displa.2016.07.002",
      "doi": ""
    },
    {
      "text": "Michael J. Doughty. 2002. Further Assessment of Gender- and Blink Pattern-Related Differences in the Spontaneous Eyeblink Activity in Primary Gaze in Young Adult Humans. Optometry and Vision Science 79, 7 (2002), 439–447. https://doi.org/10.1097/00006324-200207000-00013",
      "doi": ""
    },
    {
      "text": "Martin Feick, Niko Kleer, Anthony Tang, and Antonio Krüger. 2020. The Virtual Reality Questionnaire Toolkit. In Adjunct Publication of the ACM Symposium on User Interface Software and Technology(UIST’20 Adjunct). ACM, New York, NY, USA, 68–69. https://doi.org/10.1145/3379350.3416188",
      "doi": "10.1145/3379350.3416188"
    },
    {
      "text": "Janet Fitzakerley. 2015. Online Resource: Eyelid Movements. University of Minnesota Medical School Duluth. Retrieved July 20, 2022 from https://www.d.umn.edu/ jfitzake/Lectures/DMED/Vision/Optics/Blinking.html",
      "doi": ""
    },
    {
      "text": "Eric J. Gonzalez, Parastoo Abtahi, and Sean Follmer. 2020. REACH+: Extending the Reachability of Encountered-Type Haptics Devices through Dynamic Redirection in VR. In Proceedings of the ACM Symposium on User Interface Software and Technology(UIST’20). ACM, New York, NY, USA, 236–248. https://doi.org/10.1145/3379337.3415870",
      "doi": "10.1145/3379337.3415870"
    },
    {
      "text": "John Grimes. 1996. On the Failure to Detect Changes in Scenes across Saccades. In Perception, Elizabeth Akins (Ed.). Oxford University Press, New York, Chapter 4, 89––110. https://doi.org/10.1093/acprof:oso/9780195084627.003.0004",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, Amsterdam, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator Sickness Questionnaire: An Enhanced Method for Quantifying Simulator Sickness. International Journal of Aviation Psychology 3, 3 (1993), 203–220. https://doi.org/10.1207/s15327108ijap0303_3",
      "doi": ""
    },
    {
      "text": "Luv Kohli. 2013. Redirected Touching. Ph. D. Dissertation. University of North Carolina at Chapel Hill. http://www.cs.unc.edu/techreports/13-002.pdf",
      "doi": ""
    },
    {
      "text": "A. Krekhov, S. Cmentowski, A. Waschk, and J. Krüger. 2020. Deadeye Visualization Revisited: Investigation of Preattentiveness and Applicability in Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 26, 1 (Jan. 2020), 547–557. https://doi.org/10.1109/TVCG.2019.2934370",
      "doi": ""
    },
    {
      "text": "Eike Langbehn, Frank Steinicke, Markus Lappe, Gregory F. Welch, and Gerd Bruder. 2018. In the Blink of an Eye: Leveraging Blink-Induced Suppression for Imperceptible Position and Orientation Redirection in Virtual Reality. ACM Transactions on Graphics 37, 4 (July 2018), 66:1–66:11. https://doi.org/10.1145/3197517.3201335",
      "doi": "10.1145/3197517.3201335"
    },
    {
      "text": "Karen A. Manning, Lorrin A. Riggs, and Julieane K. Komenda. 1983. Reflex Eyeblinks and Visual Suppression. Perception & Psychophysics 34, 3 (May 1983), 250–256. https://doi.org/10.3758/BF03202953",
      "doi": ""
    },
    {
      "text": "Anh Nguyen and Andreas Kunz. 2018. Discrete Scene Rotation during Blinks and Its Effect on Redirected Walking Algorithms. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology(VRST’18). ACM, New York, NY, USA, 1–10. https://doi.org/10.1145/3281505.3281515",
      "doi": "10.1145/3281505.3281515"
    },
    {
      "text": "Niels Christian Nilsson, Tabitha Peck, Gerd Bruder, Eri Hodgson, Stefania Serafin, Mary Whitton, Frank Steinicke, and Evan Suma Rosenberg. 2018. 15 Years of Research on Redirected Walking in Immersive Virtual Environments. IEEE Computer Graphics and Applications 38, 2 (March 2018), 44–56. https://doi.org/10.1109/MCG.2018.111125628",
      "doi": "10.1109/MCG.2018.111125628"
    },
    {
      "text": "Niels Christian Nilsson, André Zenner, and Adalberto L. Simeone. 2021. Propping Up Virtual Reality With Haptic Proxies. IEEE Computer Graphics and Applications 41, 05 (Sept. 2021), 104–112. https://doi.org/10.1109/MCG.2021.3097671",
      "doi": ""
    },
    {
      "text": "J. Kevin O’Regan, Heiner Deubel, James J. Clark, and Ronald A. Rensink. 2000. Picture Changes During Blinks: Looking Without Seeing and Seeing Without Looking. Visual Cognition 7, 1-3 (2000), 191–211. https://doi.org/10.1080/135062800394766",
      "doi": ""
    },
    {
      "text": "Sudi Patel, Ross Henderson, L. Bradley, B. Galloway, and L. Hunter. 1991. Effect of Visual Display Unit Use on Blink Rate and Tear Stability. Optometry and Vision Science 68, 11 (1991), 888–892. https://doi.org/10.1097/00006324-199111000-00010",
      "doi": ""
    },
    {
      "text": "Ronald A. Rensink, J. Kevin O’Regan, and James J. Clark. 1997. To See or not to See: The Need for Attention to Perceive Changes in Scenes. Psychological Science 8, 5 (1997), 368–373. https://doi.org/10.1111/j.1467-9280.1997.tb00427.x",
      "doi": ""
    },
    {
      "text": "Geoffrey Rushworth. 1962. Observations on Blink Reflexes. Journal of Neurology, Neurosurgery & Psychiatry 25, 2(1962), 93–108. https://doi.org/10.1136/jnnp.25.2.93",
      "doi": ""
    },
    {
      "text": "Daniel J. Simons and Daniel T. Levin. 1997. Change Blindness. Trends in Cognitive Sciences 1, 7 (1997), 261–267. https://doi.org/10.1016/S1364-6613(97)01080-2",
      "doi": ""
    },
    {
      "text": "Mel Slater. 2009. Place Illusion and Plausibility Can Lead to Realistic Behaviour in Immersive Virtual Environments. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (2009), 3549–3557. https://doi.org/10.1098/rstb.2009.0138 arXiv:https://royalsocietypublishing.org/doi/pdf/10.1098/rstb.2009.0138",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of Presence in Virtual Environments. Presence: Teleoperators and Virtual Environments 3, 2(1994), 130–144. https://doi.org/10.1162/pres.1994.3.2.130",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Albertine Eline Smit. 2009. Blinking and the Brain: Pathways and Pathology. Ph. D. Dissertation. Erasmus University Rotterdam. http://hdl.handle.net/1765/14477",
      "doi": ""
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Klaus Hinrichs, and Pete Willemsen. 2010. Change Blindness Phenomena for Stereoscopic Projection Systems. In Proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces(VR’10). IEEE, New York, NY, USA, 187–194. https://doi.org/10.1109/VR.2010.5444790",
      "doi": "10.1109/VR.2010.5444790"
    },
    {
      "text": "Evan A. Suma, Seth Clark, David Krum, Samantha Finkelstein, Mark Bolas, and Zachary Warte. 2011. Leveraging Change Blindness for Redirection in Virtual Environments. In Proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces(VR’11). IEEE, New York, NY, USA, 159–166. https://doi.org/10.1109/VR.2011.5759455",
      "doi": ""
    },
    {
      "text": "Qi Sun, Anjul Patney, Li-Yi Wei, Omer Shapira, Jingwan Lu, Paul Asente, Suwen Zhu, Morgan Mcguire, David Luebke, and Arie Kaufman. 2018. Towards Virtual Reality Infinite Walking: Dynamic Saccadic Redirection. ACM Transactions on Graphics 37, 4 (July 2018), 67:1–67:13. https://doi.org/10.1145/3197517.3201294",
      "doi": "10.1145/3197517.3201294"
    },
    {
      "text": "W. Säring and D. von Cramon. 1981. The Acoustic Blink Reflex: Stimulus Dependence, Excitability and Localizing Value. Journal of Neurology 224, 4 (1981), 243–252. https://doi.org/10.1007/BF00313287",
      "doi": ""
    },
    {
      "text": "Frans VanderWerf, Peter Brassinga, Dik Reits, Majid Aramideh, and Bram Ongerboer de Visser. 2003. Eyelid Movements: Behavioral Studies of Blinking in Humans Under Different Stimulus Conditions. Journal of Neurophysiology 89, 5 (2003), 2784–2796. https://doi.org/10.1152/jn.00557.2002 arXiv:https://doi.org/10.1152/jn.00557.2002",
      "doi": ""
    },
    {
      "text": "Frances C. Volkmann. 1986. Human Visual Suppression. Vision Research 26, 9 (1986), 1401–1416. https://doi.org/10.1016/0042-6989(86)90164-1",
      "doi": ""
    },
    {
      "text": "André Zenner, Hannah Maria Kriegler, and Antonio Krüger. 2021. HaRT – The Virtual Reality Hand Redirection Toolkit. In Extended Abstracts of the ACM Conference on Human Factors in Computing Systems(CHI EA’21). ACM, New York, NY, USA, 1–7. https://doi.org/10.1145/3411763.3451814",
      "doi": "10.1145/3411763.3451814"
    },
    {
      "text": "André Zenner and Antonio Krüger. 2019. Estimating Detection Thresholds for Desktop-Scale Hand Redirection in Virtual Reality. In Proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces(VR’19). IEEE, New York, NY, USA, 47–55. https://doi.org/10.1109/VR.2019.8798143",
      "doi": ""
    },
    {
      "text": "André Zenner, Kora Persephone Regitz, and Antonio Krüger. 2021. Blink-Suppressed Hand Redirection. In Proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces(VR’21). IEEE, New York, NY, USA, 75–84. https://doi.org/10.1109/VR50410.2021.00028",
      "doi": ""
    }
  ]
}