{
  "doi": "10.1145/3544548.3581100",
  "title": "FakeForward: Using Deepfake Technology for Feedforward Learning",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Videos are commonly used to support learning of new skills, to improve existing skills, and as a source of motivation for training. Video self-modelling (VSM) is a learning technique that improves performance and motivation by showing a user a video of themselves performing a skill at a level they have not yet achieved. Traditional VSM is very data and labour intensive: a lot of video footage needs to be collected and manually edited in order to create an effective self-modelling video. We address this by presenting FakeForward – a method which uses deepfakes to create self-modelling videos from videos of other people. FakeForward turns videos of better-performing people into effective, personalised training tools by replacing their face with the user’s. We investigate how FakeForward can be effectively applied and demonstrate its efficacy in rapidly improving performance in physical exercises, as well as confidence and perceived competence in public speaking.",
  "tags": [
    "Videos",
    "Training",
    "Public Speaking",
    "Skill Acquisition",
    "Physical Exercise",
    "Fitness",
    "Deepfake",
    "Feedforward"
  ],
  "authors": [
    {
      "name": "Christopher Clarke",
      "institution": "University of Bath, United Kingdom",
      "img": "/do/10.1145/contrib-99658704149/rel-imgonly/headshot-smile-small.jpg",
      "acmid": "99658704149",
      "orcid": "0000-0003-3916-7708"
    },
    {
      "name": "Jingnan Xu",
      "institution": "Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779819",
      "orcid": "0000-0003-1798-423X"
    },
    {
      "name": "Ye Zhu",
      "institution": "University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782382",
      "orcid": "0000-0002-1188-5612"
    },
    {
      "name": "Karan Dharamshi",
      "institution": "University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781508",
      "orcid": "0000-0003-0335-8326"
    },
    {
      "name": "Harry McGill",
      "institution": "University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779275",
      "orcid": "0000-0002-2734-2049"
    },
    {
      "name": "Stephen Black",
      "institution": "University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783852",
      "orcid": "0000-0002-2628-4641"
    },
    {
      "name": "Christof Lutteroth",
      "institution": "Computer Science, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100238140",
      "orcid": "0000-0003-0634-7569"
    }
  ],
  "references": [
    {
      "text": "Marwan Albahar and Jameel Almalki. 2019. Deepfakes: Threats and countermeasures systematic review. Journal of Theoretical and Applied Information Technology 97, 22(2019), 3242–3250.",
      "doi": ""
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: enhancing movement training with an augmented reality mirror. In Proceedings of the 26th annual ACM symposium on User interface software and technology. 311–320.",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "Albert Bandura. 1977. Self-efficacy: toward a unifying theory of behavioral change.Psychological review 84, 2 (1977), 191.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1986. Social foundations of thought and action: A social cognitive theory. New Jersey: Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1997. The anatomy of stages of change.American journal of health promotion: AJHP 12, 1 (1997), 8–10.",
      "doi": ""
    },
    {
      "text": "Albert Bandura, WH Freeman, and Richard Lightsey. 1999. Self-efficacy: The exercise of control.",
      "doi": ""
    },
    {
      "text": "Albert Bandura, Dorothea Ross, and Sheila A Ross. 1961. Transmission of aggression through imitation of aggressive models.The Journal of Abnormal and Social Psychology 63, 3(1961), 575.",
      "doi": ""
    },
    {
      "text": "Soumya C Barathi, Daniel J Finnegan, Matthew Farrow, Alexander Whaley, Pippa Heath, Jude Buckley, Peter W Dowrick, Burkhard C Wuensche, James LJ Bilzon, Eamonn O’Neill, 2018. Interactive feedforward for improving performance and maintaining intrinsic motivation in VR exergaming. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3173982"
    },
    {
      "text": "Norman J Barry and Phyllis B Overmann. 1977. Comparison of the effectiveness of adult and peer models with EMR children.American Journal of Mental Deficiency(1977).",
      "doi": ""
    },
    {
      "text": "Demis Basso and Marta Olivetti Belardinelli. 2006. The role of the feedforward paradigm in cognitive psychology. Cognitive Processing 7, 2 (2006), 73–88.",
      "doi": ""
    },
    {
      "text": "Glenna Batson. 2013. Exercise-induced central fatigue: A review of the literature with implications for dance science research. Journal of Dance Medicine & Science 17, 2 (2013), 53–62.",
      "doi": ""
    },
    {
      "text": "David G Behm and Tori B Carter. 2021. Empathetic Factors and Influences on Physical Performance: A Topical Review. Frontiers in Psychology 12 (2021).",
      "doi": ""
    },
    {
      "text": "Scott Bellini and Jennifer Akullian. 2007. A meta-analysis of video modeling and video self-modeling interventions for children and adolescents with autism spectrum disorders. Exceptional children 73, 3 (2007), 264–287.",
      "doi": ""
    },
    {
      "text": "Janine Bolger. 2014. Video self-modelling and its impact on the development of communication skills within social work education. Journal of Social Work 14, 2 (2014), 196–212.",
      "doi": ""
    },
    {
      "text": "Cynthia J Brame. 2016. Effective educational videos: Principles and guidelines for maximizing student learning from video content. CBE—Life Sciences Education 15, 4 (2016), es6.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Douglas Brooks. 2001. Effective strength training: Analysis and technique for upper-body, lower-body, and trunk exercises. Human Kinetics.",
      "doi": ""
    },
    {
      "text": "Tom Buggey. 2005. Video self-modeling applications with students with autism spectrum disorder in a small private school setting. Focus on autism and other developmental disabilities 20, 1(2005), 52–63.",
      "doi": ""
    },
    {
      "text": "Tom Buggey, Grace Hoomes, Mary Elizabeth Sherberger, and Sarah Williams. 2011. Facilitating social initiations of preschoolers with autism spectrum disorders using video self-modeling. Focus on Autism and Other Developmental Disabilities 26, 1(2011), 25–36.",
      "doi": ""
    },
    {
      "text": "Tom Buggey and Lindsey Ogle. 2012. Video self-modeling. Psychology in the Schools 49, 1 (2012), 52–70.",
      "doi": ""
    },
    {
      "text": "Tom Buggey, Kristina Toombs, Pia Gardener, and Michele Cervetti. 1999. Training responding behaviors in students with autism: Using videotaped self-modeling. Journal of Positive Behavior Interventions 1, 4 (1999), 205–214.",
      "doi": ""
    },
    {
      "text": "Cami E Burton, Darlene H Anderson, Mary Anne Prater, and Tina T Dyches. 2013. Video self-modeling on an iPad to teach functional math skills to adolescents with autism and intellectual disability. Focus on Autism and Other Developmental Disabilities 28, 2(2013), 67–77.",
      "doi": ""
    },
    {
      "text": "Katherine S Cennamo. 1993. Learning from video: Factors influencing learners’ preconceptions and invested mental effort. Educational Technology Research and Development 41, 3(1993), 33–45.",
      "doi": ""
    },
    {
      "text": "Caroline Chan, Shiry Ginosar, Tinghui Zhou, and Alexei A Efros. 2019. Everybody dance now. In Proceedings of the IEEE/CVF International Conference on Computer Vision. 5933–5942.",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Anh Truong, Oliver Wang, Maneesh Agrawala, and Juho Kim. 2019. How to design voice based navigation for how-to videos. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300931"
    },
    {
      "text": "Marjorie H Charlop and Janice P Milstein. 1989. Teaching autistic children conversational speech using video modeling. Journal of applied behavior analysis 22, 3 (1989), 275–285.",
      "doi": ""
    },
    {
      "text": "Pei-Yu Chi, Joyce Liu, Jason Linder, Mira Dontcheva, Wilmot Li, and Bjoern Hartmann. 2013. Democut: generating concise instructional videos for physical demonstrations. In Proceedings of the 26th annual ACM symposium on User interface software and technology. 141–150.",
      "doi": "10.1145/2501988.2502052"
    },
    {
      "text": "Rachel B Clancy, Matthew P Herring, and Mark J Campbell. 2017. Motivation Measures in Sport: A Critical Review and Bibliometric Analysis. Frontiers in Psychology 8 (2017).",
      "doi": ""
    },
    {
      "text": "Shannon E Clark and Diane M Ste-Marie. 2007. The impact of self-as-a-model interventions on children’s self-regulation of learning and swimming performance. Journal of sports sciences 25, 5 (2007), 577–586.",
      "doi": ""
    },
    {
      "text": "Christopher Clarke, Doga Cavdir, Patrick Chiu, Laurent Denoue, and Don Kimber. 2020. Reactive Video: Adaptive Video Playback Based on User Motion for Supporting Physical Activity. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 196–208.",
      "doi": "10.1145/3379337.3415591"
    },
    {
      "text": "Melissa A Collier-Meek, Lindsay M Fallon, Austin H Johnson, Lisa MH Sanetti, and Marisa A Delcampo. 2012. Constructing self-modeling videos: Procedures and technology. Psychology in the Schools 49, 1 (2012), 3–14.",
      "doi": ""
    },
    {
      "text": "Catherine Coyle and Peter Cole. 2004. A videotaped self-modelling and self-monitoring treatment program to decrease off-task behaviour in children with autism. Journal of Intellectual and Developmental disability 29, 1(2004), 3–16.",
      "doi": ""
    },
    {
      "text": "Emily S Cross, Antonia F de C Hamilton, and Scott T Grafton. 2006. Building a motor simulation de novo: observation of dance by dancers. Neuroimage 31, 3 (2006), 1257–1267.",
      "doi": ""
    },
    {
      "text": "Alessandro D’Ausilio, Eleonora Bartoli, and Laura Maffongelli. 2015. Grasping synergies: a motor-control approach to the mirror neuron mechanism. Physics of life reviews 12 (2015), 91–103.",
      "doi": ""
    },
    {
      "text": "Paul R Davidson and Daniel M Wolpert. 2005. Widespread access to predictive models in the motor system: a short review. Journal of neural engineering 2, 3 (2005), S313.",
      "doi": ""
    },
    {
      "text": "J Mark Davis and Stephen P Bailey. 1997. Possible mechanisms of central nervous system fatigue during exercise.Medicine and science in sports and exercise 29, 1 (1997), 45–57.",
      "doi": ""
    },
    {
      "text": "DeepFaceLab. 2022. DeepFaceLab Github page. Retrieved September 3, 2022 from https://github.com/iperov/DeepFaceLab",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos and Deborah Johnson. 2021. Anticipating and addressing the ethical implications of deepfakes in the context of elections. New Media & Society 23, 7 (2021), 2072–2098.",
      "doi": ""
    },
    {
      "text": "Malaria Must Die. 2019. David Beckham speaks nine languages to launch Malaria Must Die Voice Petition. Retrieved August 20, 2021 from https://www.youtube.com/watch?v=QiiSAvKJIHo",
      "doi": ""
    },
    {
      "text": "Michael Domjan, Brian Cusato, and Ronald Villarreal. 2000. Pavlovian feed-forward mechanisms in the control of social behavior. Behavioral and Brain Sciences 23, 2 (2000), 235–249.",
      "doi": ""
    },
    {
      "text": "Mary Jo Dondlinger. 2007. Educational video game design: A review of the literature. Journal of applied educational technology 4, 1 (2007), 21–31.",
      "doi": ""
    },
    {
      "text": "Edward Downs, Nicholas D Bowman, and Jaime Banks. 2019. A polythetic model of player-avatar identification: Synthesizing multiple mechanisms.Psychology of Popular Media Culture 8, 3 (2019), 269.",
      "doi": ""
    },
    {
      "text": "PW Dowrick and M Hood. 1978. Transfer of talking behaviors across settings using faked films. In Proceedings of New Zealand conference for research in applied behavior analysis. 78–87.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick. 1999. A Review of Self Modeling and Related Interventions. Applied and Preventive Psychology 8, 1 (1999), 23–39.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick. 2012. Self model theory: Learning from the future. Wiley Interdisciplinary Reviews: Cognitive Science 3, 2 (2012), 215–230.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick. 2012. Self Modeling: Expanding the Theories of Learning. Psychology in the Schools 49, 1 (2012), 30–41.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick and Simon J Biggs. 1984. Using video: Psychological and social applications. Wiley.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick and Cynthia Dove. 1980. The use of self-modeling to improve the swimming performance of spina bifida children. Journal of Applied Behavior Analysis 13, 1 (1980), 51–56.",
      "doi": ""
    },
    {
      "text": "Peter W Dowrick and Karen M Ward. 1997. Video feedforward in the support of a man with intellectual disability and inappropriate sexual behaviour. Journal of Intellectual and Developmental Disability 22, 3(1997), 147–160.",
      "doi": ""
    },
    {
      "text": "Peter Duffy. 2008. Using Youtube: Strategies for using new media in teaching and learning. In Enhancing learning through technology: research on emerging technologies and pedagogies. World Scientific, 31–43.",
      "doi": ""
    },
    {
      "text": "Michele P Dyson, Lisa Hartling, Jocelyn Shulhan, Annabritt Chisholm, Andrea Milne, Purnima Sundar, Shannon D Scott, and Amanda S Newton. 2016. A systematic review of social media use to discuss and view deliberate self-harm acts. PloS one 11, 5 (2016), e0155813.",
      "doi": ""
    },
    {
      "text": "ROGER M Enoka and Douglas G Stuart. 1992. Neurobiology of muscle fatigue. Journal of applied physiology 72, 5 (1992), 1631–1648.",
      "doi": ""
    },
    {
      "text": "Faceswap. 2021. Faceswap - Faceswap is the leading free and Open Source multi-platform Deepfakes software. Retrieved August 20, 2021 from https://faceswap.dev/",
      "doi": ""
    },
    {
      "text": "Matthew Farrow, Christof Lutteroth, Peter C Rouse, and James LJ Bilzon. 2019. Virtual-reality exergaming improves performance during high-intensity interval training. European journal of sport science 19, 6 (2019), 719–727.",
      "doi": ""
    },
    {
      "text": "Forbes. 2019. Chinese Deepfake App ZAO Goes Viral, Privacy Of Millions ’At Risk’. Retrieved August 20, 2021 from https://www.forbes.com/sites/zakdoffman/2019/09/02/chinese-best-ever-deepfake-app-zao-sparks-huge-faceapp-like-privacy-storm/",
      "doi": ""
    },
    {
      "text": "Forbes. 2020. Why Deepfakes Are a Net Positive for Humanity. Retrieved August 20, 2021 from https://www.forbes.com/sites/simonchandler/2020/03/09/why-deepfakes-are-a-net-positive-for-humanity/",
      "doi": ""
    },
    {
      "text": "Ian M Franks and LAWRENCE J Maile. 1991. The use of video in sport skill acquisition. Practical guide to using video in the behavioral sciences (1991), 231–243.",
      "doi": ""
    },
    {
      "text": "Simon C Gandevia. 2001. Spinal and supraspinal factors in human muscle fatigue. Physiological reviews(2001).",
      "doi": ""
    },
    {
      "text": "Anne W Garcia and Abby C King. 1991. Predicting long-term adherence to aerobic exercise: A comparison of two models. Journal of Sport and Exercise Psychology 13, 4 (1991), 394–410.",
      "doi": ""
    },
    {
      "text": "Thomas Graven-Nielsen, Peter Svensson, and Lars Arendt-Nielsen. 1997. Effects of experimental muscle pain on muscle activity and co-ordination during static and dynamic motor function. Electroencephalography and Clinical Neurophysiology/Electromyography and Motor Control 105, 2 (1997), 156–164.",
      "doi": ""
    },
    {
      "text": "David Güera and Edward J Delp. 2018. Deepfake video detection using recurrent neural networks. In 2018 15th IEEE international conference on advanced video and signal based surveillance (AVSS). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Grenita Hall, Deepika R Laddu, Shane A Phillips, Carl J Lavie, and Ross Arena. 2021. A tale of two pandemics: How will COVID-19 and global trends in physical inactivity and sedentary behavior affect one another?Progress in cardiovascular diseases 64 (2021), 108.",
      "doi": ""
    },
    {
      "text": "Thomas G Haring, Craig H Kennedy, Mary J Adams, and Valerie Pitts-Conway. 1987. Teaching generalization of purchasing skills across community settings to autistic youth using videotape modeling. Journal of applied behavior analysis 20, 1 (1987), 89–96.",
      "doi": ""
    },
    {
      "text": "Douglas Harris. 2018. Deepfakes: False pornography is here and the law cannot protect you. Duke L. & Tech. Rev. 17(2018), 99.",
      "doi": ""
    },
    {
      "text": "Haya R Hasan and Khaled Salah. 2019. Combating deepfake videos using blockchain and smart contracts. Ieee Access 7(2019), 41596–41606.",
      "doi": ""
    },
    {
      "text": "Seongkook Heo, Michelle Annett, Benjamin J Lafreniere, Tovi Grossman, and George W Fitzmaurice. 2017. No Need to Stop What You’re Doing: Exploring No-Handed Smartwatch Interaction.. In Graphics Interface. 107–114.",
      "doi": ""
    },
    {
      "text": "Caryl H Hitchcock, Peter W Dowrick, and Mary Anne Prater. 2003. Video self-modeling intervention in school-based settings: A review. Remedial and Special Education 24, 1 (2003), 36–45.",
      "doi": ""
    },
    {
      "text": "Nicola J Hodges and Ian M Franks. 2002. Modelling coaching practice: the role of instruction and demonstration. Journal of sports sciences 20, 10 (2002), 793–811.",
      "doi": ""
    },
    {
      "text": "Ray E Hosford. 1981. Self-as-a-model: A cognitive social learning technique. The Counseling Psychologist 9, 1 (1981), 45–62.",
      "doi": ""
    },
    {
      "text": "Christos Ioannou, Patrick Archard, Eamonn O’neill, and Christof Lutteroth. 2019. Virtual performance augmentation in an immersive jump & run exergame. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3290605.3300388"
    },
    {
      "text": "Phillip Isola, Jun-Yan Zhu, Tinghui Zhou, and Alexei A Efros. 2017. Image-to-image translation with conditional adversarial networks. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1125–1134.",
      "doi": ""
    },
    {
      "text": "Susan A Jackson, Patrick R Thomas, Herbert W Marsh, and Christopher J Smethurst. 2001. Relationships between flow, self-concept, psychological skills, and performance. Journal of applied sport psychology 13, 2 (2001), 129–153.",
      "doi": ""
    },
    {
      "text": "Gaurav Jaswal, Amit Kaul, and Ravinder Nath. 2016. Knuckle print biometrics and fusion schemes–overview, challenges, and solutions. ACM Computing Surveys (CSUR) 49, 2 (2016), 1–46.",
      "doi": "10.1145/2938727"
    },
    {
      "text": "Cameron T Jennings, Peter Reaburn, and Steven B Rynne. 2013. The effect of a self-modelling video intervention on motor skill acquisition and retention of a novice track cyclist’s standing start performance. International Journal of Sports Science & Coaching 8, 3 (2013), 467–480.",
      "doi": ""
    },
    {
      "text": "Thomas J Kehle, Steven V Owen, and Elizabeth T Cressy. 1990. The use of self-modeling as an intervention in school psychology: A case study of an elective mute. School Psychology Review 19, 1 (1990), 115–121.",
      "doi": ""
    },
    {
      "text": "Lee Kern-Dunlap, Glen Dunlap, Shelley Clarke, Karen E Childs, Ronnie L White, and Mary Pat Stewart. 1992. Effects of a videotape feedback package on the peer interactions of children with serious behavioral and emotional challenges. Journal of Applied Behavior Analysis 25, 2 (1992), 355–364.",
      "doi": ""
    },
    {
      "text": "Juho Kim, Philip J Guo, Carrie J Cai, Shang-Wen Li, Krzysztof Z Gajos, and Robert C Miller. 2014. Data-driven interaction techniques for improving navigation of educational videos. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 563–572.",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Marino Kimura and Yuko Yotsumoto. 2018. Auditory traits of\" own voice\". PloS one 13, 6 (2018), e0199443.",
      "doi": ""
    },
    {
      "text": "Jordan Koulouris, Zoe Jeffery, James Best, Eamonn O’neill, and Christof Lutteroth. 2020. Me vs. Super (wo) man: Effects of Customization and Identification in a VR Exergame. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3313831.3376661"
    },
    {
      "text": "Yousef Kowsar, Masud Moshtaghi, Eduardo Velloso, Lars Kulik, and Christopher Leckie. 2016. Detecting unseen anomalies in weight training exercises. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. 517–526.",
      "doi": "10.1145/3010915.3010941"
    },
    {
      "text": "Victor AF Lamme and Pieter R Roelfsema. 2000. The distinct modes of vision offered by feedforward and recurrent processing. Trends in neurosciences 23, 11 (2000), 571–579.",
      "doi": ""
    },
    {
      "text": "Patricia G Lange. 2019. Informal learning on YouTube. The international encyclopedia of media literacy (2019), 1–11.",
      "doi": ""
    },
    {
      "text": "Mark R Leary. 2013. Social Anxiety, Shyness, and related constructs. Measures of personality and social psychological attitudes: Measures of social psychological attitudes 1 (2013), 161–176.",
      "doi": ""
    },
    {
      "text": "Yuezun Li and Siwei Lyu. 2018. Exposing deepfake videos by detecting face warping artifacts. arXiv preprint arXiv:1811.00656(2018).",
      "doi": ""
    },
    {
      "text": "Yuezun Li, Xin Yang, Pu Sun, Honggang Qi, and Siwei Lyu. 2020. Celeb-df: A large-scale challenging dataset for deepfake forensics. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 3207–3216.",
      "doi": ""
    },
    {
      "text": "Jeff Lieberman and Cynthia Breazeal. 2007. TIKL: Development of a wearable vibrotactile feedback suit for improved human motor learning. IEEE Transactions on Robotics 23, 5 (2007), 919–926.",
      "doi": "10.1109/TRO.2007.907481"
    },
    {
      "text": "Jonathon Love, Ravi Selker, Maarten Marsman, Tahira Jamil, Damian Dropmann, Josine Verhagen, Alexander Ly, Quentin F Gronau, Martin Šmíra, Sacha Epskamp, 2019. JASP: Graphical statistical software for common statistical designs. Journal of Statistical Software 88 (2019), 1–17.",
      "doi": ""
    },
    {
      "text": "Stephen E Lucas. 2009. The art of public speaking 11th edition. Boston. Mc. Graw Hill.",
      "doi": ""
    },
    {
      "text": "Tímea Magyaródi, Henriett Nagy, Péter Soltész, Tamás Mózes, and Attila Oláh. 2013. Psychometric Properties of a Newly Established Flow State Questionnaire. The Journal of Happiness & Well-Being 1, 2 (2013), 85–96.",
      "doi": ""
    },
    {
      "text": "Marie-Helen Maras and Alex Alexandrou. 2019. Determining authenticity of video evidence in the age of artificial intelligence and in the wake of deepfake videos. The International Journal of Evidence & Proof 23, 3 (2019), 255–262.",
      "doi": ""
    },
    {
      "text": "Diogo L Marques, Henrique P Neiva, Luis B Fail, Maria H Gil, and Mario C Marques. 2019. Acute effects of low and high-volume resistance training on hemodynamic, metabolic and neuromuscular parameters in older adults. Experimental gerontology 125 (2019), 110685.",
      "doi": ""
    },
    {
      "text": "Kathleen A Martin, Sandra E Moritz, and Craig R Hall. 1999. Imagery use in sport: A literature review and applied model. The sport psychologist 13, 3 (1999), 245–268.",
      "doi": ""
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V Tammen. 1989. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting: A Confirmatory Factor Analysis. Research Quarterly for Exercise and Sport 60, 1 (1989), 48–58.",
      "doi": ""
    },
    {
      "text": "M McGraw-Hunter, GD Faw, and PK Davis. 2006. The use of video self-modelling and feedback to teach cooking skills to individuals with traumatic brain injury: A pilot study. Brain Injury 20, 10 (2006), 1061–1068.",
      "doi": ""
    },
    {
      "text": "Stephen S Meharg and Lee E Lipsker. 1992. Parent training using videotape self-modeling. Child & Family Behavior Therapy 13, 4 (1992), 1–27.",
      "doi": ""
    },
    {
      "text": "Stephen S Meharg and Mitchel A Woltersdorf. 1990. Therapeutic use of videotape self-modeling: A review. Advances in Behaviour Research and Therapy 12, 2 (1990), 85–99.",
      "doi": ""
    },
    {
      "text": "Edvinas Meskys, Aidas Liaudanskas, Julija Kalpokiene, and Paulius Jurcys. 2020. Regulating deep fakes: legal and ethical considerations. Journal of Intellectual Property Law & Practice 15, 1 (2020), 24–31.",
      "doi": ""
    },
    {
      "text": "Alexander Michael and Christof Lutteroth. 2020. Race Yourselves: A Longitudinal Exploration of Self-Competition Between Past, Present, and Future Performances in a VR Exergame. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3313831.3376256"
    },
    {
      "text": "Microsoft. 2020. Kinect for Windows. Retrieved August 20, 2021 from https://developer.microsoft.com/en-us/windows/kinect/",
      "doi": ""
    },
    {
      "text": "Simon Middlemas and Chris Harwood. 2020. A pre-match video self-modeling intervention in elite youth football. Journal of Applied Sport Psychology 32, 5 (2020), 450–475.",
      "doi": ""
    },
    {
      "text": "Sedigheh Moghavvemi, Ainin Sulaiman, Noor Ismawati Jaafar, and Nafisa Kasem. 2018. Social media as a complementary learning tool for teaching and learning: The case of youtube. The International Journal of Management Education 16, 1 (2018), 37–42.",
      "doi": ""
    },
    {
      "text": "Richard D Morey 2008. Confidence intervals from normalized data: A correction to Cousineau (2005). Tutorials in Quantitative Methods for Psychology 4, 2 (2008), 61–64.",
      "doi": ""
    },
    {
      "text": "Masahiro Mori. 1970. On the Uncanny Valley. Energy 7, 4 (1970). https://ci.nii.ac.jp/naid/10027463083/",
      "doi": ""
    },
    {
      "text": "Solène Neyret, Xavi Navarro, Alejandro Beacco, Ramon Oliva, Pierre Bourdin, Jose Valenzuela, Itxaso Barberia, and Mel Slater. 2020. An embodied perspective as a victim of sexual harassment in virtual reality reduces action conformity in a later milgram obedience scenario. Scientific reports 10, 1 (2020), 1–18.",
      "doi": ""
    },
    {
      "text": "Nintendo. 2020. Wii Fit. Retrieved August 20, 2021 from https://www.nintendo.co.uk/Games/Wii/Wii-Fit-283894.html",
      "doi": ""
    },
    {
      "text": "The University of Vermont. [n.d.]. Public Speaking Evaluation/Criteria. https://www.uvm.edu/sites/default/files/media/eval-public-speaking.pdf",
      "doi": ""
    },
    {
      "text": "Carl Öhman. 2020. Introducing the pervert’s dilemma: a contribution to the critique of Deepfake Pornography. Ethics and Information Technology 22, 2 (2020), 133–140.",
      "doi": "10.1007/s10676-019-09522-1"
    },
    {
      "text": "World Health Organization. 2020. Physical activity. Retrieved August 20, 2021 from https://www.who.int/news-room/fact-sheets/detail/physical-activity",
      "doi": ""
    },
    {
      "text": "Armin H Paravlic, Maamer Slimani, David Tod, Uros Marusic, Zoran Milanovic, and Rado Pisot. 2018. Effects and dose–response relationships of motor imagery practice on strength development in healthy adult populations: a systematic review and meta-analysis. Sports Medicine 48, 5 (2018), 1165–1187.",
      "doi": ""
    },
    {
      "text": "Gordon L Paul. 1966. Insight vs. desensitization in psychotherapy: An experiment in anxiety reduction. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Ivan Perov, Daiheng Gao, Nikolay Chervoniy, Kunlin Liu, Sugasa Marangonda, Chris Umé, Mr Dpfks, Carl Shift Facenheim, Luis RP, Jian Jiang, 2020. DeepFaceLab: Integrated, flexible and extensible face-swapping framework. arXiv preprint arXiv:2005.05535(2020).",
      "doi": ""
    },
    {
      "text": "Timothy R Pineau, Carol R Glass, Keith A Kaufman, and Darren R Bernal. 2014. Self-and team-efficacy beliefs of rowers and their relation to mindfulness and flow. Journal of Clinical Sport Psychology 8, 2 (2014), 142–158.",
      "doi": ""
    },
    {
      "text": "Jan L Plass, Bruce D Homer, and Charles K Kinzer. 2014. Playful learning: An integrated design framework. White paper 2(2014), 2014.",
      "doi": ""
    },
    {
      "text": "Mary Anne Prater, Nari Carter, Caryl Hitchcock, and Peter Dowrick. 2012. Video self-modeling to improve academic performance: A literature review. Psychology in the Schools 49, 1 (2012), 71–81.",
      "doi": ""
    },
    {
      "text": "Mitchell J Prinstein, Nicole Heilbron, John D Guerry, Joseph C Franklin, Diana Rancourt, Valerie Simon, and Anthony Spirito. 2010. Peer influence and nonsuicidal self injury: Longitudinal results in community and clinically-referred adolescent samples. Journal of abnormal child psychology 38, 5 (2010), 669–682.",
      "doi": ""
    },
    {
      "text": "Charles B Pull. 2012. Current status of knowledge on public-speaking anxiety. Current opinion in psychiatry 25, 1 (2012), 32–38.",
      "doi": ""
    },
    {
      "text": "Helen Regan and Julia Howe. 2017. Video self-modelling: an intervention for children with behavioural difficulties. Educational Psychology in Practice 33, 1 (2017), 93–102.",
      "doi": ""
    },
    {
      "text": "Jennifer R Richardson and Timothy D Lee. 1999. The effects of proactive and retroactive demonstrations on learning signed letters. Acta Psychologica 101, 1 (1999), 79–90.",
      "doi": ""
    },
    {
      "text": "Cathy Robson, Neville Blampied, and Lawrence Walker. 2015. Effects of feedforward video self-modelling on reading fluency and comprehension. Behaviour Change 32, 1 (2015), 46–58.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan. 1982. Control and Information in the Intrapersonal Sphere: An Extension of Cognitive Evaluation Theory. Journal of Personality and Social Psychology 43, 3(1982), 450–461.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Intrinsic and extrinsic motivations: Classic definitions and new directions. Contemporary educational psychology 25, 1 (2000), 54–67.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being.American psychologist 55, 1 (2000), 68.",
      "doi": ""
    },
    {
      "text": "Dale H Schunk. 1987. Peer models and children’s behavioral change. Review of educational research 57, 2 (1987), 149–174.",
      "doi": ""
    },
    {
      "text": "Dale H Schunk and Antoinette R Hanson. 1989. Influence of peer-model attributes on children’s beliefs and learning.Journal of Educational Psychology 81, 3 (1989), 431.",
      "doi": ""
    },
    {
      "text": "Dale H Schunk and Antoinette R Hanson. 1989. Self-modeling and children’s cognitive skill learning.Journal of Educational Psychology 81, 2 (1989), 155.",
      "doi": ""
    },
    {
      "text": "Dale H Schunk, Antoinette R Hanson, and Paula D Cox. 1987. Peer-model attributes and children’s achievement behaviors.Journal of educational psychology 79, 1 (1987), 54.",
      "doi": ""
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Cagri Tasci, Patrick Franczak, Nico Haas, and Niels Henze. 2017. \" These are not my hands!\" Effect of Gender on the Perception of Avatar Hands in Virtual Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1577–1582.",
      "doi": "10.1145/3025453.3025602"
    },
    {
      "text": "Dale E Seborg, Thomas F Edgar, Duncan A Mellichamp, and Francis J Doyle III. 2016. Process dynamics and control. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Ben Sidaway and M Jerome Hand. 1993. Frequency of modeling effects on the acquisition and retention of a motor skill. Research quarterly for exercise and sport 64, 1 (1993), 122–126.",
      "doi": ""
    },
    {
      "text": "Roland Sigrist, Georg Rauter, Robert Riener, and Peter Wolf. 2013. Augmented visual, auditory, haptic, and multimodal feedback in motor learning: a review. Psychonomic bulletin & review 20, 1 (2013), 21–53.",
      "doi": ""
    },
    {
      "text": "Joanna Starek and Penny McCullagh. 1999. The effect of self-modeling on the performance of beginning swimmers. The Sport Psychologist 13, 3 (1999), 269–287.",
      "doi": ""
    },
    {
      "text": "Diane M Ste-Marie, Kelly Vertes, Amanda M Rymal, and Rose Martini. 2011. Feedforward self-modeling enhances skill acquisition in children learning trampoline skills. Frontiers in psychology 2 (2011), 155.",
      "doi": ""
    },
    {
      "text": "Kylie A Steel, Roger D Adams, Susan E Coulson, Colleen G Canning, and Holly J Hawtin. 2013. Video self-model training of punt kicking. International Journal of Sport and Health Science (2013), 201233.",
      "doi": ""
    },
    {
      "text": "Cassidy R Sugimoto, Mike Thelwall, Vincent Larivière, Andrew Tsou, Philippe Mongeon, and Benoit Macaluso. 2013. Scientists popularizing science: characteristics and impact of TED talk presenters. PloS one 8, 4 (2013), e62403.",
      "doi": ""
    },
    {
      "text": "Supasorn Suwajanakorn, Steven M Seitz, and Ira Kemelmacher-Shlizerman. 2017. Synthesizing obama: learning lip sync from audio. ACM Transactions on Graphics (ToG) 36, 4 (2017), 1–13.",
      "doi": "10.1145/3072959.3073640"
    },
    {
      "text": "Elaine Tan. 2013. Informal learning on YouTube: Exploring digital literacy in independent online learning. Learning, Media and Technology 38, 4 (2013), 463–477.",
      "doi": ""
    },
    {
      "text": "Richard Tang, Xing-Dong Yang, Scott Bateman, Joaquim Jorge, and Anthony Tang. 2015. Physio@ Home: Exploring visual guidance and feedback techniques for physiotherapy exercises. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 4123–4132.",
      "doi": "10.1145/2702123.2702401"
    },
    {
      "text": "Justus Thies, Michael Zollhofer, Marc Stamminger, Christian Theobalt, and Matthias Nießner. 2016. Face2face: Real-time face capture and reenactment of rgb videos. In Proceedings of the IEEE conference on computer vision and pattern recognition. 2387–2395.",
      "doi": "10.1145/2929464.2929475"
    },
    {
      "text": "Milka Trajkova and Mexhid Ferati. 2015. Usability evaluation of kinect-based system for ballet movements. In International Conference of Design, User Experience, and Usability. Springer, 464–472.",
      "doi": "10.1007/978-3-319-20898-5_45"
    },
    {
      "text": "Cristian Vaccari and Andrew Chadwick. 2020. Deepfakes and disinformation: Exploring the impact of synthetic political video on deception, uncertainty, and trust in news. Social Media+ Society 6, 1 (2020), 2056305120903408.",
      "doi": ""
    },
    {
      "text": "Jan Van Looy, Cédric Courtois, Melanie De Vocht, and Lieven De Marez. 2012. Player identification in online games: Validation of a scale for measuring identification in MMOGs. Media Psychology 15, 2 (2012), 197–221.",
      "doi": ""
    },
    {
      "text": "Kelly A Vertes and Diane M Ste-Marie. 2013. Trampolinists’ self-controlled use of a feedforward self-modeling video in competition. Journal of Applied Sport Psychology 25, 4 (2013), 463–477.",
      "doi": ""
    },
    {
      "text": "Maureen R Weiss, Vicki Ebbeck, and Diane M Wiese-Bjornstal. 1993. Developmental and psychological factors related to children’s observational learning of physical skills. Pediatric Exercise Science 5, 4 (1993), 301–317.",
      "doi": ""
    },
    {
      "text": "Maureen R Weiss, Penny McCullagh, Alan L Smith, and Anthony R Berlant. 1998. Observational learning and the fearful child: Influence of peer models on swimming skill performance and psychological responses. Research Quarterly for Exercise and Sport 69, 4 (1998), 380–394.",
      "doi": ""
    },
    {
      "text": "Barbara Yingling Wert and John T Neisworth. 2003. Effects of video self-modeling on spontaneous requesting in children with autism. Journal of Positive Behavior Interventions 5, 1 (2003), 30–34.",
      "doi": ""
    },
    {
      "text": "HTA Whiting, MJ Bijlard, and BPLM Den Brinker. 1987. The effect of the availability of a dynamic model on the acquisition of a complex cyclical action. The Quarterly Journal of Experimental Psychology Section A 39, 1(1987), 43–59.",
      "doi": ""
    },
    {
      "text": "Sara Wilcox, Patricia A Sharpe, Brent Hutto, and Michelle L Granner. 2005. Psychometric properties of the self-efficacy for exercise questionnaire in a diverse sample of men and women. Journal of Physical Activity and Health 2, 3 (2005), 285–297.",
      "doi": ""
    },
    {
      "text": "Carolee J Winstein and Richard A Schmidt. 1990. Reduced frequency of knowledge of results enhances motor skill learning.Journal of Experimental Psychology: Learning, Memory, and Cognition 16, 4(1990), 677.",
      "doi": ""
    },
    {
      "text": "Wired. 2021. The messy legal scrap to bring celebrities back from the dead. Retrieved August 20, 2021 from https://www.wired.co.uk/article/james-dean-dead-actors-rights",
      "doi": ""
    },
    {
      "text": "Ungyeon Yang and Gerard Jounghyun Kim. 2002. Implementation and evaluation of “just follow me”: An immersive, VR-based, motion-training system. Presence: Teleoperators & Virtual Environments 11, 3(2002), 304–323.",
      "doi": "10.1162/105474602317473240"
    },
    {
      "text": "Cheryl A Young-Pelton and Samantha L Bushman. 2015. Using video self-modelling to increase active learning responses during small-group reading instruction for primary school pupils with social emotional and mental health difficulties. Emotional and Behavioural Difficulties 20, 3 (2015), 277–288.",
      "doi": ""
    },
    {
      "text": "Jun-Yan Zhu, Taesung Park, Phillip Isola, and Alexei A Efros. 2017. Unpaired image-to-image translation using cycle-consistent adversarial networks. In Proceedings of the IEEE international conference on computer vision. 2223–2232.",
      "doi": ""
    }
  ]
}