{
  "doi": "10.1145/3544548.3581253",
  "title": "Overcoming Algorithm Aversion: A Comparison between Process and Outcome Control",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-27",
  "year": 2023,
  "badges": [],
  "abstract": "Algorithm aversion occurs when humans are reluctant to use algorithms despite their superior performance. Studies show that giving users outcome control by providing agency over how models’ predictions are incorporated into decision-making mitigates algorithm aversion. We study whether algorithm aversion is mitigated by process control, wherein users can decide what input factors and algorithms to use in model training. We conduct a replication study of outcome control, and test novel process control study conditions on Amazon Mechanical Turk (MTurk) and Prolific. Our results partly confirm prior findings on the mitigating effects of outcome control, while also forefronting reproducibility challenges. We find that process control in the form of choosing the training algorithm mitigates algorithm aversion, but changing inputs does not. Furthermore, giving users both outcome and process control does not reduce algorithm aversion more than outcome or process control alone. This study contributes to design considerations around mitigating algorithm aversion.",
  "authors": [
    {
      "name": "Lingwei Cheng",
      "institution": "Heinz College, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660643572",
      "orcid": "0000-0002-1827-4697"
    },
    {
      "name": "Alexandra Chouldechova",
      "institution": "Heinz College, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553917956",
      "orcid": "0000-0002-2337-9610"
    }
  ],
  "references": [
    {
      "text": "Mike Ananny and Kate Crawford. 2018. Seeing without knowing: Limitations of the transparency ideal and its application to algorithmic accountability. New Media & Society 20, 3 (2018), 973–989. https://doi.org/10.1177/1461444816676645 arXiv:https://doi.org/10.1177/1461444816676645",
      "doi": ""
    },
    {
      "text": "Monya Baker. 2015. Over half of psychology studies fail reproducibility test. Nature News 27(2015).",
      "doi": ""
    },
    {
      "text": "Adam J. Berinsky, Gregory A. Huber, and Gabriel S. Lenz. 2012. Evaluating Online Labor Markets for Experimental Research: Amazon.com’s Mechanical Turk. Political Analysis 20, 3 (2012), 351–368. https://doi.org/10.1093/pan/mpr057",
      "doi": ""
    },
    {
      "text": "Robert J. Bies, Christopher L. Martin, and Joel Brockner. 1993. Just laid off, but still a “good citizen?” only if the process is fair. Employee Responsibilities and Rights Journal 6 (9 1993). Issue 3. https://doi.org/10.1007/BF01419446",
      "doi": ""
    },
    {
      "text": "Emily Adlin Bosk. 2018. What counts? quantification, worker judgment, and divergence in child welfare decision making. Human Service Organizations: Management, Leadership & Governance 42, 2(2018), 205–224. https://doi.org/10.1080/23303131.2017.1422068 arXiv:https://doi.org/10.1080/23303131.2017.1422068",
      "doi": ""
    },
    {
      "text": "Jordan L. Boyd-Graber, Sonya S. Nikolova, Karyn A. Moffatt, Kenrick C. Kin, Joshua Y. Lee, Lester W. Mackey, Marilyn M. Tremaine, and Maria M. Klawe. 2006. Participatory Design with Proxies: Developing a Desktop-PDA System to Support People with Aphasia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 151–160. https://doi.org/10.1145/1124772.1124797",
      "doi": "10.1145/1124772.1124797"
    },
    {
      "text": "Jason W. Burton, Mari-Klara Stein, and Tina Blegind Jensen. 2020. A systematic review of algorithm aversion in augmented decision making. Journal of Behavioral Decision Making 33, 2 (2020), 220–239. https://doi.org/10.1002/bdm.2155 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/bdm.2155",
      "doi": ""
    },
    {
      "text": "Logan S Casey, Jesse Chandler, Adam Seth Levine, Andrew Proctor, and Dara Z Strolovitch. 2017. Intertemporal differences among MTurk workers: Time-based sample variations and implications for online data collection. SAGE Open 7, 2 (2017), 2158244017712774.",
      "doi": ""
    },
    {
      "text": "Noah Castelo, Maarten W. Bos, and Donald R. Lehmann. 2019. Task-Dependent Algorithm Aversion. Journal of Marketing Research 56, 5 (2019), 809–825. https://doi.org/10.1177/0022243719851788 arXiv:https://doi.org/10.1177/0022243719851788",
      "doi": ""
    },
    {
      "text": "Hao-Fei Cheng, Logan Stapleton, Anna Kawakami, Venkatesh Sivaraman, Yanghuidi Cheng, Diana Qing, Adam Perer, Kenneth Holstein, Zhiwei Steven Wu, and Haiyi Zhu. 2022. How Child Welfare Workers Reduce Racial Disparities in Algorithmic Decisions(CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 162, 22 pages. https://doi.org/10.1145/3491102.3501831",
      "doi": "10.1145/3491102.3501831"
    },
    {
      "text": "Lingwei Cheng and Alexandra Chouldechova. 2022. Heterogeneity in Algorithm-Assisted Decision-Making: A Case Study in Child Abuse Hotline Screening. Proc. ACM Hum.-Comput. Interact. 6, CSCW2, Article 376 (nov 2022), 33 pages. https://doi.org/10.1145/3555101",
      "doi": "10.1145/3555101"
    },
    {
      "text": "RM Dawes, D Faust, and PE Meehl. 1989. Clinical versus actuarial judgment. Science 243, 4899 (1989), 1668–1674. https://doi.org/10.1126/science.2648573 arXiv:https://science.sciencemag.org/content/243/4899/1668.full.pdf",
      "doi": ""
    },
    {
      "text": "Robyn M Dawes. 1979. The robust beauty of improper linear models in decision making.American psychologist 34, 7 (1979), 571.",
      "doi": ""
    },
    {
      "text": "Karen Day, Gayl Humphrey, and Sophie Cockcroft. 2017. How do the design features of health hackathons contribute to participatory medicine?Australasian Journal of Information Systems 21 (Mar. 2017). https://doi.org/10.3127/ajis.v21i0.1383",
      "doi": ""
    },
    {
      "text": "Maria De-Arteaga, Riccardo Fogliato, and Alexandra Chouldechova. 2020. A Case for Humans-in-the-Loop: Decisions in the Presence of Erroneous Algorithmic Scores. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376638",
      "doi": "10.1145/3313831.3376638"
    },
    {
      "text": "Daniel Clement Dennett. 1987. The intentional stance. MIT press.",
      "doi": ""
    },
    {
      "text": "Berkeley J. Dietvorst, Joseph P. Simmons, and Cade Massey. 2015. Algorithm aversion: People erroneously avoid algorithms after seeing them err.Journal of Experimental Psychology: General 144 (2015), 220–239. Issue 1. https://doi.org/10.1037/xge0000033",
      "doi": ""
    },
    {
      "text": "Berkeley J. Dietvorst, Joseph P. Simmons, and Cade Massey. 2018. Overcoming Algorithm Aversion: People Will Use Imperfect Algorithms If They Can (Even Slightly) Modify Them. Management Science 64, 3 (2018), 1155–1170. https://doi.org/10.1287/mnsc.2016.2643 arXiv:https://doi.org/10.1287/mnsc.2016.2643",
      "doi": "10.1287/mnsc.2016.2643"
    },
    {
      "text": "Florian Echtler and Maximilian Häußler. 2018. Open Source, Open Science, and the Replication Crisis in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3170427.3188395",
      "doi": "10.1145/3170427.3188395"
    },
    {
      "text": "Hossein Estiri, Terri Lovins, Nader Afzalan, and Kari Stephens. 2016. Applying a Participatory Design Approach to Define Objectives and Properties of a \"Data Profiling\" Tool for Electronic Health Data. AMIA Joint Summits on Translational Science proceedings. AMIA Summit on Translational Science 2016 (07 2016), 60–7.",
      "doi": ""
    },
    {
      "text": "Daniele Fanelli. 2018. Is science really facing a reproducibility crisis, and do we need it to?Proceedings of the National Academy of Sciences 115, 11(2018), 2628–2631.",
      "doi": ""
    },
    {
      "text": "Riccardo Fogliato, Alexandra Chouldechova, and Zachary Lipton. 2021. The Impact of Algorithmic Risk Assessments on Human Predictions and Its Analysis via Crowdsourcing Studies. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 428 (oct 2021), 24 pages. https://doi.org/10.1145/3479572",
      "doi": "10.1145/3479572"
    },
    {
      "text": "Department for Education. 2020. GCSE and A level students to receive centre assessment grades. https://www.gov.uk/government/news/gcse-and-a-level-students-to-receive-centre-assessment-grades",
      "doi": ""
    },
    {
      "text": "Craig Fowler, Jian Jiao, and Margaret Pitts. 2022. Frustration and ennui among Amazon MTurk workers. Behavior Research Methods(2022), 1–17.",
      "doi": ""
    },
    {
      "text": "Shantanu Godbole and Sunita Sarawagi. 2004. Discriminative Methods for Multi-labeled Classification. In Advances in Knowledge Discovery and Data Mining, Honghua Dai, Ramakrishnan Srikant, and Chengqi Zhang (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 22–30.",
      "doi": ""
    },
    {
      "text": "Peter Leo Gorski, Yasemin Acar, Luigi Lo Iacono, and Sascha Fahl. 2020. Listen to Developers! A Participatory Design Study on Security Warnings for Cryptographic APIs. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376142",
      "doi": "10.1145/3313831.3376142"
    },
    {
      "text": "Nina Grgić-Hlača, Muhammad Bilal Zafar, Krishna P. Gummadi, and Adrian Weller. 2018. Beyond Distributive Fairness in Algorithmic Decision Making: Feature Selection for Procedurally Fair Learning. Proceedings of the AAAI Conference on Artificial Intelligence 32, 1 (Apr. 2018). https://ojs.aaai.org/index.php/AAAI/article/view/11296",
      "doi": ""
    },
    {
      "text": "Daniel Hepperle, Tobias Dienlin, and Matthias Wölfel. 2021. Reducing the Human Factor in Virtual Reality Research to Increase Reproducibility and Replicability. https://doi.org/10.48550/ARXIV.2110.15687",
      "doi": ""
    },
    {
      "text": "Mitchel N. Herian, Joseph A. Hamm, Alan J. Tomkins, and Lisa M. Pytlik Zillig. 2012. Public Participation, Procedural Fairness, and Evaluations of Local Governance: The Moderating Role of Uncertainty. Journal of Public Administration Research and Theory 22, 4 (01 2012), 815–840. https://doi.org/10.1093/jopart/mur064 arXiv:https://academic.oup.com/jpart/article-pdf/22/4/815/2779202/mur064.pdf",
      "doi": ""
    },
    {
      "text": "Katja Herrmanny and Helma Torkamaan. 2021. Towards a User Integration Framework for Personal Health Decision Support and Recommender Systems. In Proceedings of the 29th ACM Conference on User Modeling, Adaptation and Personalization. 65–76.",
      "doi": "10.1145/3450613.3456816"
    },
    {
      "text": "Hendrik Heuer and Elena Leah Glassman. 2022. A Comparative Evaluation of Interventions Against Misinformation: Augmenting the WHO Checklist. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 241, 21 pages. https://doi.org/10.1145/3491102.3517717",
      "doi": "10.1145/3491102.3517717"
    },
    {
      "text": "Yoyo Tsung-Yu Hou and Malte F. Jung. 2021. Who is the Expert? Reconciling Algorithm Aversion and Algorithm Appreciation in AI-Supported Decision Making. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 477 (oct 2021), 25 pages. https://doi.org/10.1145/3479864",
      "doi": "10.1145/3479864"
    },
    {
      "text": "Pauline Houlden, Stephen LaTour, Laurens Walker, and John Thibaut. 1978. Preference for modes of dispute resolution as a function of process and decision control. Journal of Experimental Social Psychology 14, 1 (1978), 13–30. https://doi.org/10.1016/0022-1031(78)90057-4",
      "doi": ""
    },
    {
      "text": "John PA Ioannidis. 2005. Why most published research findings are false. PLoS medicine 2, 8 (2005), e124.",
      "doi": ""
    },
    {
      "text": "Ekaterina Jussupow, Izak Benbasat, and Armin Heinzl. 2020. Why are we averse towards algorithms? A comprehensive literature review on algorithm aversion.",
      "doi": ""
    },
    {
      "text": "Kaggle. 2022. House prices - advanced regression techniques. https://www.kaggle.com/c/house-prices-advanced-regression-techniques",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman, Jack L Knetsch, and Richard H Thaler. 1991. Anomalies: The endowment effect, loss aversion, and status quo bias. Journal of Economic perspectives 5, 1 (1991), 193–206.",
      "doi": ""
    },
    {
      "text": "P. M. Krafft, Meg Young, Michael Katell, Jennifer E. Lee, Shankar Narayan, Micah Epstein, Dharma Dailey, Bernease Herman, Aaron Tam, Vivian Guetler, Corinne Bintz, Daniella Raz, Pa Ousman Jobe, Franziska Putz, Brian Robick, and Bissan Barghouti. 2021. An Action-Oriented AI Policy Toolkit for Technology Audits by Community Advocates and Activists. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 772–781. https://doi.org/10.1145/3442188.3445938",
      "doi": "10.1145/3442188.3445938"
    },
    {
      "text": "Min Kyung Lee, Anuraag Jain, Hea Jin Cha, Shashank Ojha, and Daniel Kusbit. 2019. Procedural Justice in Algorithmic Fairness: Leveraging Transparency and Outcome Control for Fair Algorithmic Mediation. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 182 (Nov. 2019), 26 pages. https://doi.org/10.1145/3359284",
      "doi": "10.1145/3359284"
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Anson Kahng, Ji Tae Kim, Xinran Yuan, Allissa Chan, Daniel See, Ritesh Noothigattu, Siheon Lee, Alexandros Psomas, and Ariel D. Procaccia. 2019. WeBuildAI: Participatory Framework for Algorithmic Governance. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 181 (Nov. 2019), 35 pages. https://doi.org/10.1145/3359283",
      "doi": "10.1145/3359283"
    },
    {
      "text": "Benedikt Loepp, Katja Herrmanny, and Jürgen Ziegler. 2015. Blended Recommending: Integrating Interactive Information Filtering and Algorithmic Recommender Techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 975–984. https://doi.org/10.1145/2702123.2702496",
      "doi": "10.1145/2702123.2702496"
    },
    {
      "text": "Jennifer Marie Logg. 2017. Theory of machine: When do people rely on algorithms?Harvard Business School working paper series# 17-086 (2017).",
      "doi": ""
    },
    {
      "text": "Jennifer M. Logg, Julia A. Minson, and Don A. Moore. 2019. Algorithm appreciation: People prefer algorithmic to human judgment. Organizational Behavior and Human Decision Processes 151 (2019), 90–103. https://doi.org/10.1016/j.obhdp.2018.12.005",
      "doi": ""
    },
    {
      "text": "Lorraine Mazerolle, Emma Antrobus, Sarah Bennett, and Tom R. Tyler. 2013. Shaping Citizen Perceptions of Police Legitimacy: A Randomized Field Trial of Procedural Justice. Criminology 51, 1 (2013), 33–63. https://doi.org/10.1111/j.1745-9125.2012.00289.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1745-9125.2012.00289.x",
      "doi": ""
    },
    {
      "text": "Maria D Molina and S Shyam Sundar. 2022. When AI moderates online content: effects of human collaboration and interactive transparency on user trust. Journal of Computer-Mediated Communication 27, 4 (07 2022). https://doi.org/10.1093/jcmc/zmac010 arXiv:https://academic.oup.com/jcmc/article-pdf/27/4/zmac010/45048191/zmac010.pdfzmac010.",
      "doi": ""
    },
    {
      "text": "Ramal Moonesinghe, Muin J Khoury, and A Cecile J W Janssens. 2007. Most published research findings are false—but a little replication goes a long way. PLoS medicine 4, 2 (2007), e28.",
      "doi": ""
    },
    {
      "text": "Ziad Obermeyer, Brian Powers, Christine Vogeli, and Sendhil Mullainathan. 2019. Dissecting racial bias in an algorithm used to manage the health of populations. Science 366, 6464 (2019), 447–453. https://doi.org/10.1126/science.aax2342 arXiv:https://science.sciencemag.org/content/366/6464/447.full.pdf",
      "doi": ""
    },
    {
      "text": "MIT OpenCourseWare. 2017. Reading Test Scores. https://ocw.mit.edu/courses/15-071-the-analytics-edge-spring-2017/pages/linear-regression/assignment-2/reading-test-scores/",
      "doi": ""
    },
    {
      "text": "Samir Passi and Solon Barocas. 2019. Problem formulation and fairness. In Proceedings of the conference on fairness, accountability, and transparency. 39–48.",
      "doi": "10.1145/3287560.3287567"
    },
    {
      "text": "Andrew Prahl and Lyn Van Swol. 2017. Understanding algorithm aversion: When is advice from automation discounted?Journal of Forecasting 36, 6 (2017), 691–702. https://doi.org/10.1002/for.2464 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/for.2464",
      "doi": ""
    },
    {
      "text": "Lisa M PytlikZillig, Myiah J Hutchens, Peter Muhlberger, Frank J Gonzalez, and Alan J Tomkins. 2018. Deliberative public engagement with science: An empirical investigation. Springer Nature.",
      "doi": ""
    },
    {
      "text": "Rehab Qarout, Alessandro Checco, Gianluca Demartini, and Kalina Bontcheva. 2019. Platform-Related Factors in Repeatability and Reproducibility of Crowdsourcing Tasks. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 7, 1 (Oct. 2019), 135–143. https://doi.org/10.1609/hcomp.v7i1.5264",
      "doi": ""
    },
    {
      "text": "Jorge Ramírez, Burcu Sayin, Marcos Baez, Fabio Casati, Luca Cernuzzi, Boualem Benatallah, and Gianluca Demartini. 2021. On the State of Reporting in Crowdsourcing Experiments and a Checklist to Aid Current Practices. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 387 (oct 2021), 34 pages. https://doi.org/10.1145/3479531",
      "doi": "10.1145/3479531"
    },
    {
      "text": "Michael Sanders, Emma Stockdale, Susannah Hume, and Peter John. 2021. Loss aversion fails to replicate in the coronavirus pandemic: Evidence from an online experiment. Economics letters 199(2021), 109433.",
      "doi": ""
    },
    {
      "text": "Devansh Saxena, Karla Badillo-Urquiola, Pamela J. Wisniewski, and Shion Guha. 2020. A Human-Centered Review of Algorithms Used within the U.S. Child Welfare System. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376229",
      "doi": "10.1145/3313831.3376229"
    },
    {
      "text": "Devansh Saxena and Shion Guha. 2020. Conducting Participatory Design to Improve Algorithms in Public Services: Lessons and Challenges. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing (Virtual Event, USA) (CSCW ’20 Companion). Association for Computing Machinery, New York, NY, USA, 383–388. https://doi.org/10.1145/3406865.3418331",
      "doi": "10.1145/3406865.3418331"
    },
    {
      "text": "Ric Simmons. 2020. Big Data and Procedural Justice: Legitimizing Algorithms in the Criminal Justice System. Ohio State Journal of Criminal Law 144 (July 2020). https://doi.org/10.2139/ssrn.3659347",
      "doi": ""
    },
    {
      "text": "S Shyam Sundar. 2008. The MAIN model: A heuristic approach to understanding technology effects on credibility. MacArthur Foundation Digital Media and Learning Initiative Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Jason Sunshine and Tom R. Tyler. 2003. The Role of Procedural Justice and Legitimacy in Shaping Public Support for Policing. Law & Society Review 37, 3 (2003), 513–548. http://www.jstor.org/stable/1555077",
      "doi": ""
    },
    {
      "text": "Tom R. Tyler, Phillip Atiba Goff, and Robert J. MacCoun. 2015. The Impact of Psychological Science on Policing in the United States: Procedural Justice, Legitimacy, and Effective Law Enforcement. Psychological Science in the Public Interest 16, 3 (2015), 75–109. https://doi.org/10.1177/1529100615617791 arXiv:https://doi.org/10.1177/1529100615617791PMID: 26635334.",
      "doi": ""
    },
    {
      "text": "Kristen Vaccaro, Dylan Huang, Motahhare Eslami, Christian Sandvig, Kevin Hamilton, and Karrie Karahalios. 2018. The illusion of control: Placebo effects of control settings. In CHI 2018 - Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(Conference on Human Factors in Computing Systems - Proceedings). Association for Computing Machinery. https://doi.org/10.1145/3173574.3173590",
      "doi": "10.1145/3173574.3173590"
    },
    {
      "text": "Jiaxuan Wang, Jeeheh Oh, Haozhu Wang, and Jenna Wiens. 2018. Learning Credible Models. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining (London, United Kingdom) (KDD ’18). Association for Computing Machinery, New York, NY, USA, 2417–2426. https://doi.org/10.1145/3219819.3220070",
      "doi": "10.1145/3219819.3220070"
    },
    {
      "text": "Zijie J. Wang, Dongjin Choi, Shenyu Xu, and Diyi Yang. 2021. Putting Humans in the Natural Language Processing Loop: A Survey. https://doi.org/10.48550/ARXIV.2103.04044",
      "doi": ""
    },
    {
      "text": "Max LL Wilson, Paul Resnick, David Coyle, and Ed H Chi. 2013. Replichi: the workshop. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 3159–3162.",
      "doi": "10.1145/2468356.2479636"
    },
    {
      "text": "Huichuan Xia. 2022. Tragedy of the Commons-A Critical Study of Data Quality and Validity Issues in Crowd Work-Based Research. In Proceedings of the 55th Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Qian Yang, John Zimmerman, Aaron Steinfeld, Lisa Carey, and James F. Antaki. 2016. Investigating the Heart Pump Implant Decision Process: Opportunities for Decision Support Tools to Help. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4477–4488. https://doi.org/10.1145/2858036.2858373",
      "doi": "10.1145/2858036.2858373"
    },
    {
      "text": "Eldad Yechiam. 2019. Acceptable losses: The debatable origins of loss aversion. Psychological research 83, 7 (2019), 1327–1339.",
      "doi": ""
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna Wallach. 2019. Understanding the Effect of Accuracy on Trust in Machine Learning Models. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300509",
      "doi": "10.1145/3290605.3300509"
    },
    {
      "text": "Sonja K. Ötting and Günter W. Maier. 2018. The importance of procedural justice in Human–Machine Interactions: Intelligent systems as new decision agents in organizations. Computers in Human Behavior 89 (2018), 27 – 39. https://doi.org/10.1016/j.chb.2018.07.022",
      "doi": "10.1016/j.chb.2018.07.022"
    }
  ]
}