{
  "doi": "10.1145/3544548.3580788",
  "title": "“The World is Designed for Fluent People”: Benefits and Challenges of Videoconferencing Technologies for People Who Stutter",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "This work studies the experiences of people who stutter (PWS) with videoconferencing (VC) and VC technologies. Our interview study with 13 adults who stutter uncovers extra challenges introduced by current VC platforms to people who stutter. While some of the challenges are a direct result of the characteristics of stuttering (e.g. people/systems mistaking pauses as end of turn), a bigger yet less visible challenge comes with the significant amount of emotional and cognitive effort required to manage one’s speech and identity over VC, in which people’s existing communication strategies - such as body language and eye contact - are under-supported and their biggest discomfort - such as seeing oneself stutter - are exacerbated by preset features like self view. Overall, our work sheds light on the structural barriers and the opportunities for PWS to engage and enjoy virtual communications via VC technologies.",
  "authors": [
    {
      "name": "Shaomei Wu",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780939",
      "orcid": "0000-0003-1104-4116"
    }
  ],
  "references": [
    {
      "text": "Sadeen Alharbi, Madina Hasan, Anthony J. H. Simons, Shelagh Brumfitt, and Phil D. Green. 2020. Sequence labeling to detect stuttering events in read speech. Comput. Speech Lang. 62(2020), 101052.",
      "doi": "10.1016/j.csl.2019.101052"
    },
    {
      "text": "Sadeen Alharbi, Anthony J H Simons, Shelagh Brumfitt, and Phil Green. 2017. Automatic recognition of children’s read speech for stuttering application. In Proc. 6th Workshop on Child Computer Interaction (WOCCI 2017). 1–6. https://doi.org/10.21437/WOCCI.2017-1",
      "doi": ""
    },
    {
      "text": "Joel S. Angiolillo, Harry E. Blanchard, and Edmond W. Israelski. 1993. Video Telephony. AT&T Technical Journal 72, 3 (1993), 7–20. https://doi.org/10.1002/j.1538-7305.1993.tb00536.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/j.1538-7305.1993.tb00536.x",
      "doi": ""
    },
    {
      "text": "Chiara Baiano, Gennaro Raimo, Isa Zappullo, Marialaura Marra, Roberta Cecere, Luigi Trojano, and Massimiliano Conson. 2022. Empathy through the Pandemic: Changes of Different Emphatic Dimensions during the COVID-19 Outbreak. International Journal of Environmental Research and Public Health 19, 4(2022), 2435.",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson. 2021. Nonverbal Overload: A Theoretical Argument for the Causes of Zoom Fatigue. Technology, Mind, and Behavior 2, 1 (feb 23 2021). https://tmb.apaopen.org/pub/nonverbal-overload.",
      "doi": ""
    },
    {
      "text": "Anna Bleakley, Daniel Rough, Abi Roper, Stephen Lindsay, Martin Porcheron, Minha Lee, Stuart Alan Nicholson, Benjamin R Cowan, and Leigh Clark. 2022. Exploring Smart Speaker User Experience for People Who Stammer. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility. 1–10.",
      "doi": "10.1145/3517428.3544823"
    },
    {
      "text": "O. Bloodstein, N.B. Ratner, and S.B. Brundage. 2021. A Handbook on Stuttering, Seventh Edition. Plural Publishing, Incorporated. https://books.google.com/books?id=Abw0EAAAQBAJ",
      "doi": ""
    },
    {
      "text": "John Van Borsel, Marie Brepoels, and Janne De Coene. 2011. Stuttering, attractiveness, and romantic relationships: The perception of adolescents and young adults. Journal of Fluency Disorders 36, 1 (2011), 41–50.",
      "doi": ""
    },
    {
      "text": "Michael P Boyle. 2013. Psychological characteristics and perceptions of stuttering of adults who stutter with and without support group experience. Journal of fluency disorders 38, 4 (2013), 368–381.",
      "doi": ""
    },
    {
      "text": "Michael P. Boyle and Rodney M. Gabel. 2020. “Openness and progress with communication and confidence have all gone hand in hand”: Reflections on the experience of transitioning between concealment and openness among adults who stutter. Journal of Fluency Disorders 65 (2020), 105781. https://doi.org/10.1016/j.jfludis.2020.105781",
      "doi": ""
    },
    {
      "text": "Michael P Boyle, Kathryn M Milewski, and Carolina Beita-Ell. 2018. Disclosure of stuttering and quality of life in people who stutter. Journal of fluency disorders 58 (2018), 1–10.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on Shared Experiences: Moving beyond the Camera in Video Communication. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 96–105. https://doi.org/10.1145/2317956.2317973",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Philip Burnard. 1991. A method of analysing interview transcripts in qualitative research. Nurse education today 11, 6 (1991), 461–466.",
      "doi": ""
    },
    {
      "text": "Clare Butler. 2014. Wanted – straight talkers: stammering and aesthetic labour. Work Employment & Society 28 (10 2014). https://doi.org/10.1177/0950017013501956",
      "doi": ""
    },
    {
      "text": "C. T. Byrd, M. McGill, Z. Gkalitsiou, and C. Cappellini. 2017. The effects of self-disclosure on male and female perceptions of individuals who stutter. American Journal of Speech-Language Pathology 26, 1 (2017), 69–80.",
      "doi": ""
    },
    {
      "text": "P. Campbell, C. Constantino, and S. Simpson. 2019. Stammering Pride and Prejudice: Difference Not Defect. J & R Press Limited. https://books.google.com/books?id=a947yQEACAAJ",
      "doi": ""
    },
    {
      "text": "Julie Cattiau. 2021. A communication tool for people with non-standard speech. https://blog.google/outreach-initiatives/accessibility/project-relate/. Accessed on 12/08/2022..",
      "doi": ""
    },
    {
      "text": "C. Cheasman, R. Everard, and S. Simpson. 2013. Stammering Therapy from the Inside: New Perspectives on Working with Young People and Adults. J & R Press. https://books.google.com/books?id=QZVdMwEACAAJ",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Benjamin R Cowan, Abi Roper, Stephen Lindsay, and Owen Sheers. 2020. Speech diversity and speech interfaces: Considering an inclusive future through stammering. In Proceedings of the 2nd Conference on Conversational User Interfaces. 1–3.",
      "doi": "10.1145/3405755.3406139"
    },
    {
      "text": "Christopher Constantino, Patrick Campbell, and Sam Simpson. 2022. Stuttering and the social model. Journal of Communication Disorders 96 (2022), 106200. https://doi.org/10.1016/j.jcomdis.2022.106200",
      "doi": ""
    },
    {
      "text": "Christopher Dominick Constantino, Naomi Eichorn, Eugene H. Buder, J. Gayle Beck, and Walter H. Manning. 2020. The Speaker’s Experience of Stuttering: Measuring Spontaneity. Journal of Speech, Language, and Hearing Research 63 (2020), 983–1001. Issue 4.",
      "doi": ""
    },
    {
      "text": "Christopher D Constantino, Paula Leslie, Robert W Quesal, and J Scott Yaruss. 2016. A preliminary investigation of daily variability of stuttering in adults. Journal of Communication Disorders 60 (2016), 39–50.",
      "doi": ""
    },
    {
      "text": "C. D. Constantino, W. H. Manning, and S. N. Nordstrom. 2017. Rethinking covert stuttering. Journal of Fluency Disorders 53 (2017), 26–40.",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1989. Demarginalizing the Intersection of Race and Sex: A Black Feminist Critique of Antidiscrimination Doctrine, Feminist Theory and Antiracist Politics. The University of Chicago Legal Forum 140 (1989), 139–167.",
      "doi": ""
    },
    {
      "text": "S. Davis, P. Howell, and F. Cooke. 2002. Sociodynamic relationships between children who stutter and their non-stuttering classmates. Journal of Child Psychology and Psychiatry, and Allied Disciplines 43, 7(2002), 939–947.",
      "doi": ""
    },
    {
      "text": "Iva Demarin, Ljubica Leko, Maja Škrobo, Helena Germano, Patrícia Macedo, and Rui Neves Madeira. 2015. The Impact of Stuttering;: How Can a Mobile App Help?. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers and Accessibility (Lisbon, Portugal) (ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 399–400. https://doi.org/10.1145/2700648.2811389",
      "doi": "10.1145/2700648.2811389"
    },
    {
      "text": "Janine Diehl, Michael P. Robb, John G. Lewis, and Tika Ormond. 2019. Situational speaking anxiety in adults who stutter. Speech, Language and Hearing 22, 2 (2019), 100–110. https://doi.org/10.1080/2050571X.2018.1441782 arXiv:https://doi.org/10.1080/2050571X.2018.1441782",
      "doi": ""
    },
    {
      "text": "A. M. Ferguson, J. M. Roche, and H. S. Arnold. 2019. Social judgments of digitally manipulated stuttered speech: An evaluation of self-disclosure on cognition. Journal of Speech, Language, and Hearing Research 62, 11 (2019), 3986–4000. https://doi.org/10.1044/2019_jslhr-s-19-0088",
      "doi": ""
    },
    {
      "text": "Kathleen E Finn. 1997. Video-mediated communication. L. Erlbaum Associates Inc.",
      "doi": ""
    },
    {
      "text": "Autumm Gaine. 2020. The Zoom Gaze. https://reallifemag.com/the-zoom-gaze/, note=Online; accessed 2022-08-16.",
      "doi": ""
    },
    {
      "text": "Hope Gerlach-Houck and Christopher D. Constantino. 2022. Interrupting Ableism in Stuttering Therapy and Research: Practical Suggestions. Perspectives of the ASHA Special Interest Groups 7, 2 (2022), 357–374.",
      "doi": ""
    },
    {
      "text": "Bhavya Ghai and Klaus Mueller. 2021. Fluent: An AI Augmented Writing Tool for People Who Stutter. In Proceedings of the 23rd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, USA) (ASSETS ’21). Association for Computing Machinery, New York, NY, USA, Article 26, 8 pages. https://doi.org/10.1145/3441852.3471211",
      "doi": "10.1145/3441852.3471211"
    },
    {
      "text": "David M Grayson and Andrew F Monk. 2003. Are you looking at me? Eye contact and desktop video conferencing. ACM Transactions on Computer-Human Interaction (TOCHI) 10, 3(2003), 221–243.",
      "doi": "10.1145/937549.937552"
    },
    {
      "text": "Gerlach H, Totty E, Subramanian A, and Zebrowski P.2018. Stuttering and Labor Market Outcomes in the United States. J Speech Lang Hear Res. 61, 7 (2018), 1649–1663. https://doi.org/10.1044/2018_JSLHR-S-17-0353 https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6195060/.",
      "doi": ""
    },
    {
      "text": "Peter A. Heeman, Rebecca Lunsford, Andy McMillin, and J. Scott Yaruss. 2016. Using Clinician Annotations to Improve Automatic Speech Recognition of Stuttered Speech. In INTERSPEECH.",
      "doi": ""
    },
    {
      "text": "Peter Howell. 2004. Effects of delayed auditory feedback and frequency-shifted feedback on speech control and some potentials for future development of prosthetic aids for stammering. Stammering research: an on-line journal published by the British Stammering Association 1, 1 (2004), 31.",
      "doi": ""
    },
    {
      "text": "Peter Howell, Stephen Davis, and Jon Bartrip. 2009. The university college london archive of stuttered speech (uclass). (2009).",
      "doi": ""
    },
    {
      "text": "RUTH IGIELNIK. 2022. As telework continues for many U.S. workers, no sign of widespread ‘Zoom fatigue’. https://www.pewresearch.org/fact-tank/2022/05/04/as-telework-continues-for-many-u-s-workers-no-sign-of-widespread-zoom-fatigue/.",
      "doi": ""
    },
    {
      "text": "Ellen A Isaacs and John C Tang. 1993. What video can and can’t do for collaboration: a case study. In Proceedings of the first ACM International Conference on Multimedia. 199–206.",
      "doi": "10.1145/166266.166289"
    },
    {
      "text": "Lisa Iverach and Ronald M. Rapee. 2014. Social anxiety disorder and stuttering: Current status and future directions. Journal of Fluency Disorders 40 (2014), 69–82. https://doi.org/10.1016/j.jfludis.2013.08.003 Anxiety and stuttering.",
      "doi": ""
    },
    {
      "text": "Kelly F. Jackson. 2011. Derald Wing Sue, Microaggressions in Everyday Life: Race, Gender, and Sexual Orientation. Social Service Review 85, 3 (2011), 519–521. https://doi.org/10.1086/663007 arXiv:https://doi.org/10.1086/663007",
      "doi": ""
    },
    {
      "text": "Sarah E James, Shelagh M Brumfitt, and Peter A Cudd. 1999. Communicating by telephone: Views of a group of people with stuttering impairment. Journal of Fluency Discorders 24, 4 (1999), 299–312.",
      "doi": ""
    },
    {
      "text": "Matthew K. Miller, Martin Johannes Dechant, and Regan L. Mandryk. 2021. Meeting You, Seeing Me: The Role of Social Anxiety, Visual Feedback, and Interface Layout in a Get-to-Know-You Task via Video Chat.. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": ""
    },
    {
      "text": "Alison Kafer. 2019. Crip Kin, Manifesting. Catalyst: Feminism, Theory, Technoscience 5 (04 2019), 1–37. https://doi.org/10.28968/cftt.v5i1.29618",
      "doi": ""
    },
    {
      "text": "Joseph Kalinowski and Tim Saltuklaroglu. 2003. Choral speech: The amelioration of stuttering via imitation and the mirror neuronal system. Neuroscience and biobehavioral reviews 27 (10 2003), 339–47. https://doi.org/10.1016/S0149-7634(03)00063-0",
      "doi": ""
    },
    {
      "text": "Hiroaki Kawashima, Takeshi Nishikawa, and Takashi Matsuyama. 2008. Visual filler: facilitating smooth turn-taking in video conferencing with transmission delay. In CHI’08 Extended Abstracts on Human Factors in Computing Systems. 3585–3590.",
      "doi": ""
    },
    {
      "text": "Tedd Kourkounakis, Amirhossein Hajavi, and Ali Etemad. 2019. Detecting Multiple Speech Disfluencies Using a Deep Residual Network with Bidirectional Long Short-Term Memory. ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)(2019), 6089–6093.",
      "doi": ""
    },
    {
      "text": "Tedd Kourkounakis, Amirhossein Hajavi, and Ali Etemad. 2021. Fluentnet: End-to-end detection of stuttered speech disfluencies with deep learning. IEEE/ACM Transactions on Audio, Speech, and Language Processing 29 (2021), 2986–2999.",
      "doi": "10.1109/TASLP.2021.3110146"
    },
    {
      "text": "Raja S. Kushalnagar and Christian Vogler. 2020. Teleconference Accessibility and Guidelines for Deaf and Hard of Hearing Users. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility(Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 9, 6 pages. https://doi.org/10.1145/3373625.3417299",
      "doi": "10.1145/3373625.3417299"
    },
    {
      "text": "Colin Lea, Vikramjit Mitra, Aparna Joshi, Sachin Kajarekar, and Jeffrey Bigham. 2021. Sep-28k: A Dataset for Stuttering Event Detection from Podcasts with People Who Stutter. https://arxiv.org/pdf/2102.12394.pdf",
      "doi": ""
    },
    {
      "text": "Minha Lee, Wonyoung Park, Sunok Lee, and Sangsu Lee. 2022. Distracting Moments in Videoconferencing: A Look Back at the Pandemic Period. Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (2022).",
      "doi": "10.1145/3491102.3517545"
    },
    {
      "text": "Franklin Mingzhe Li, Franchesca Spektor, Meng Xia, Mina Huh, Peter Cederberg, Yuqi Gong, Kristen Shinohara, and Patrick Carrington. 2022. “It Feels Like Taking a Gamble”: Exploring Perceptions, Practices, and Challenges of Using Makeup and Cosmetics for People with Visual Impairments. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 266, 15 pages. https://doi.org/10.1145/3491102.3517490",
      "doi": "10.1145/3491102.3517490"
    },
    {
      "text": "Geert Lovink. 2020. The anatomy of Zoom fatigue. https://www.eurozine.com/ the-anatomy-of-zoom-fatigue/. Online; accessed 2022-08-16.",
      "doi": ""
    },
    {
      "text": "Robert L. MacDonald, Pan-Pan Jiang, Julie Cattiau, Rus Heywood, Richard Cave, Katie Seaver, Marilyn A. Ladewig, Jimmy Tobin, Michael P. Brenner, Philip C. Nelson, Jordan R. Green, and Katrin Tomanek. 2021. Disordered Speech Data Collection: Lessons Learned at 1 Million Utterances from Project Euphonia. In Proc. Interspeech 2021. 4833–4837. https://doi.org/10.21437/Interspeech.2021-697",
      "doi": ""
    },
    {
      "text": "Roisin McNaney, Christopher Bull, Lynne Mackie, Floriane Dahman, Helen Stringer, Dan Richardson, and Daniel Welsh. 2018. StammerApp: Designing a Mobile Application to Support Self-Reflection and Goal Setting for People Who Stammer. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173841",
      "doi": "10.1145/3173574.3173841"
    },
    {
      "text": "Vikramjit Mitra, Zifang Huang, Colin Lea, Lauren Tooley, Panayiotis Georgiou, Sachin Kajarekar, and Jefferey Bigham. 2021. Analysis and Tuning of a Voice Assistant System for Dysfluent Speech. https://arxiv.org/pdf/2106.11759.pdf",
      "doi": ""
    },
    {
      "text": "Timothy Neate, Vasiliki Kladouchou, Stephanie Wilson, and Shehzmani Shams. 2022. “Just Not Together”: The Experience of Videoconferencing for People with Aphasia during the Covid-19 Pandemic. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 606, 16 pages. https://doi.org/10.1145/3491102.3502017",
      "doi": "10.1145/3491102.3502017"
    },
    {
      "text": "National Institute on Deafness and Other Communication Disorders. 2016. NIDCD Factsheet: Stuttering. https://www.nidcd.nih.gov/health/stuttering. Retrieved on April 19th, 2022..",
      "doi": ""
    },
    {
      "text": "Laura Plexico, Walter H. Manning, and Anthony DiLollo. 2005. A phenomenological understanding of successful stuttering management. Journal of Fluency Disorders 30, 1 (2005), 1–22. https://doi.org/10.1016/j.jfludis.2004.12.001",
      "doi": ""
    },
    {
      "text": "Manish K Rami, Joseph Kalinowski, Michael P Rastatter, Donald Holbert, and Mark Allen. 2005. Choral reading with filtered speech: Effect on stuttering. Perceptual and Motor Skills 100, 2 (2005), 421–431.",
      "doi": ""
    },
    {
      "text": "Ronald M. Rapee and Richard G. Heimberg. 1997. A cognitive-behavioral model of anxiety in social phobia. Behaviour Research and Therapy 35, 8 (1997), 741–756. https://doi.org/10.1016/S0005-7967(97)00022-3",
      "doi": ""
    },
    {
      "text": "Rabindra Ratan, Dave B. Miller, and Jeremy N. Bailenson. 2022. Facial Appearance Dissatisfaction Explains Differences in Zoom Fatigue. Cyberpsychology, Behavior, and Social Networking 25, 2(2022), 124–129. https://doi.org/10.1089/cyber.2021.0112 arXiv:https://doi.org/10.1089/cyber.2021.0112PMID: 34842445.",
      "doi": ""
    },
    {
      "text": "Nan Bernstein Ratner and Brian MacWhinney. 2018. Fluency Bank: A new resource for fluency research and practice. Journal of fluency disorders 56 (2018), 69–80.",
      "doi": ""
    },
    {
      "text": "James Robinson. 2022. I Stutter. This Is What You’re Not Hearing. The New York Times. https://www.nytimes.com/video/opinion/100000008048545/stutter-speech-listening.html.",
      "doi": ""
    },
    {
      "text": "Adam D Rubin, Veeraphol Praneetvatakul, Shirley Gherson, Cheryl A Moyer, and Robert T Sataloff. 2006. Laryngeal hyperfunction during whispering: reality or myth?Journal of voice 20, 1 (2006), 121–127.",
      "doi": ""
    },
    {
      "text": "Jazz Rui Xia Ang, Ping Liu, Emma McDonnell, and Sarah Coppola. 2022. “In This Online Environment, We’re Limited”: Exploring Inclusive Video Conferencing Design for Signers. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 609, 16 pages. https://doi.org/10.1145/3491102.3517488",
      "doi": "10.1145/3491102.3517488"
    },
    {
      "text": "Stephanie R Seitz and Ai Leen Choo. 2022. Stuttering: Stigma and perspectives of (dis) ability in organizational communication. Human Resource Management Review 32, 4 (2022), 100875.",
      "doi": ""
    },
    {
      "text": "Abigail Sellen, Bill Buxton, and John Arnott. 1992. Using Spatial Cues to Improve Videoconferencing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 651–652. https://doi.org/10.1145/142750.143070",
      "doi": "10.1145/142750.143070"
    },
    {
      "text": "J.G. Sheehan. 1970. Stuttering: Research and Therapy. Harper & Row. https://books.google.com/books?id=0KhrAAAAMAAJ",
      "doi": ""
    },
    {
      "text": "Shakeel Ahmad Sheikh, Md. Sahidullah, Fabrice Hirsch, and Slim Ouni. 2021. StutterNet: Stuttering Detection Using Time Delay Neural Network. 2021 29th European Signal Processing Conference (EUSIPCO) (2021), 426–430.",
      "doi": ""
    },
    {
      "text": "Lei Shi, Brianna J Tomlinson, John Tang, Edward Cutrell, Daniel McDuff, Gina Venolia, Paul Johns, and Kael Rowan. 2019. Accessible video calling: Enabling nonvisual perception of visual conversation cues. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3359233"
    },
    {
      "text": "Olabanji Shonibare, Xiaosu Tong, and Venkatesh Ravichandran. 2022. Enhancing ASR for Stuttered Speech with Limited Data Using Detect and Pass. ArXiv abs/2202.05396(2022).",
      "doi": ""
    },
    {
      "text": "Stamma. 2022. How Many Adults Stammer?https://stamma.org/news-features/how-many-adults-stammer. Online; accessed 2022-11-30.",
      "doi": ""
    },
    {
      "text": "Andrew Stuart, Shixiong Xia, Yining Jiang, Tao Jiang, Joseph Kalinowski, and Michael P Rastatter. 2003. Self-contained in-the-ear device to deliver altered auditory feedback: Applications for stuttering. Annals of Biomedical Engineering 31, 2 (2003), 233–237.",
      "doi": ""
    },
    {
      "text": "John Tang. 2021. Understanding the telework experience of people with disabilities. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–27.",
      "doi": "10.1145/3449104"
    },
    {
      "text": "Glen Tellis. 2002. Multicultural Aspects of Stuttering. Perspectives on Communication Disorders and Sciences in Culturally and Linguistically Diverse Populations 8 (07 2002), 8–11. https://doi.org/10.1044/cds8.2.8",
      "doi": ""
    },
    {
      "text": "Seth E. Tichenor and J. Scott Yaruss. 2019. Stuttering as Defined by Adults Who Stutter. Journal of Speech, Language, and Hearing Research 62 (2019), 4356–4369. https://doi.org/10.1044/2019_JSLHR-19-00137",
      "doi": ""
    },
    {
      "text": "Seth E Tichenor and J Scott Yaruss. 2021. Variability of stuttering: Behavior and impact. American Journal of Speech-Language Pathology 30, 1 (2021), 75–88.",
      "doi": ""
    },
    {
      "text": "Christian Vogler, Paula Tucker, and Norman Williams. 2013. Mixed Local and Remote Participation in Teleconferences from a Deaf and Hard of Hearing Perspective. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (Bellevue, Washington) (ASSETS ’13). Association for Computing Machinery, New York, NY, USA, Article 30, 5 pages. https://doi.org/10.1145/2513383.2517035",
      "doi": "10.1145/2513383.2517035"
    },
    {
      "text": "Shirley Weitz. 1976. Visual Behavior: ",
      "doi": ""
    },
    {
      "text": "Kevin Wheeler. 2018. Why voice assistants don’t understand people who stutter. Curbed. https://archive.curbed.com/2018/12/12/18135195/alexa-google-home-tech-stuttering.",
      "doi": ""
    },
    {
      "text": "Whispp. 2022. How does it work?https://whispp.com/how-does-it-work/?lang=en. Accessed on 12/08/2022..",
      "doi": ""
    },
    {
      "text": "Robert A. Wicklund. 1975. Objective Self-Awareness11Much of the research reported in this paper as well as the writing of this paper were supported by NSF Grant GS-31890. Sharon S. Brehm, William J. Ickes, Michael F. Scheier, and Melvin L. Snyder are acknowledged for their suggestions and insightful criticisms.Advances in Experimental Social Psychology, Vol. 8. Academic Press, 233–275. https://doi.org/10.1016/S0065-2601(08)60252-X",
      "doi": ""
    },
    {
      "text": "Nicola Woods. 1989. Talking shop: Sex and status as determinants of floor apportionment in a work setting. Women in their speech communities(1989), 141–157.",
      "doi": ""
    },
    {
      "text": "Patricia M. Zebrowski. 2016. The High Cost of Stuttering. The ASHA Leader 21, 7 (2016), 6–7.",
      "doi": ""
    },
    {
      "text": "Don H Zimmerman and Candace West. 1975. Sex Roles, Interruptions and Silences in Conversation: In Thorne, B. & Henley, N.(Eds.), Language and sex: Difference and Dominance (pp. 105-129).",
      "doi": ""
    },
    {
      "text": "Annuska Zolyomi, Andrew Begel, Jennifer Frances Waldern, John Tang, Michael Barnett, Edward Cutrell, Daniel McDuff, Sean Andrist, and Meredith Ringel Morris. 2019. Managing stress: the needs of autistic adults in video calling. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–29.",
      "doi": "10.1145/3359236"
    }
  ]
}