{
  "doi": "10.1145/3544548.3580828",
  "title": "DataHalo: A Customizable Notification Visualization System for Personalized and Longitudinal Interactions",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2023,
  "badges": [],
  "abstract": "People struggle with the overflow of smartphone notifications but often face two challenges: (1) prioritizing the informative notifications as they wish and (2) retaining the delivered information as long as they want to utilize it. In this paper, we present DataHalo, a customizable notification visualization system that represents notifications as prolonged ambient visualizations on the home screen. DataHalo supports keyword-based filtering and categorization, and draws graphical marks based on time-varying importance model to enable longitudinal interaction with the notifications. We evaluated DataHalo through a usability study (N = 17), from which we improved the interface. We then conducted a three-week deployment study (N = 12) to assess how people use DataHalo in their domestic contexts. Our study revealed that people generated various visualization settings for different kinds of apps. Drawing on both quantitative and qualitative findings, we discussed implications for supporting effective notification management through customizable ambient visualizations.",
  "tags": [
    "smartphone notifications",
    "personalization",
    "ambient information visualization"
  ],
  "authors": [
    {
      "name": "Guhyun Han",
      "institution": "Department of Computer Science and Engineering, Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778202",
      "orcid": "0000-0002-5940-2034"
    },
    {
      "name": "Jaehun Jung",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780555",
      "orcid": "0000-0002-0292-3074"
    },
    {
      "name": "Young-Ho Kim",
      "institution": "NAVER AI Lab, Korea, Republic of",
      "img": "/do/10.1145/contrib-99659022154/rel-imgonly/kim_portrait_2021.jpg",
      "acmid": "99659022154",
      "orcid": "0000-0002-2681-2774"
    },
    {
      "name": "Jinwook Seo",
      "institution": "Department of Computer Science and Engineering, Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100413624",
      "orcid": "0000-0002-7734-822X"
    }
  ],
  "references": [
    {
      "text": "Jonas Auda, Dominik Weber, Alexandra Voit, and Stefan Schneegass. 2018. Understanding User Preferences Towards Rule-based Notification Deferral. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). ACM, New York, NY, USA, Article LBW584, 6 pages. https://doi.org/10.1145/3170427.3188688",
      "doi": "10.1145/3170427.3188688"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. J. Usability Studies 4, 3 (May 2009), 114–123. http://dl.acm.org/citation.cfm?id=2835587.2835589",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Jared S. Bauer, Sunny Consolvo, Benjamin Greenstein, Jonathan Schooler, Eric Wu, Nathaniel F. Watson, and Julie Kientz. 2012. ShutEye: Encouraging Awareness of Healthy Sleep Recommendations with a Mobile, Peripheral Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). ACM, New York, NY, USA, 1401–1410. https://doi.org/10.1145/2207676.2208600",
      "doi": "10.1145/2207676.2208600"
    },
    {
      "text": "Pulse (by Maeil Business News Korea. 2020. KakaoTalk in its 10th year has nearly all S. Korean population connected. https://pulsenews.co.kr/view.php?year=2020&no=218180 Last accessed 12 December 2022.",
      "doi": ""
    },
    {
      "text": "Seyma Kucukozer Cavdar, Tugba Taskaya-Temizel, Mirco Musolesi, and Peter Tino. 2020. A Multi-Perspective Analysis of Social Context and Personal Factors in Office Settings for the Design of an Effective Mobile Notification System. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1, Article 15 (mar 2020), 38 pages. https://doi.org/10.1145/3381000",
      "doi": "10.1145/3381000"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, Daniel Avrahami, Jon Froehlich, Louis LeGrand, Ryan Libby, Keith Mosher, and James A. Landay. 2008. Flowers or a Robot Army?: Encouraging Awareness & Activity with Personal, Mobile Displays. In Proceedings of the 10th International Conference on Ubiquitous Computing (Seoul, Korea) (UbiComp ’08). ACM, New York, NY, USA, 54–63. https://doi.org/10.1145/1409635.1409644",
      "doi": "10.1145/1409635.1409644"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, and James A. Landay. 2014. Designing for Healthy Lifestyles: Design Considerations for Mobile Technologies to Encourage Consumer Health and Wellness. Found. Trends Hum.-Comput. Interact. 6, 3–4 (apr 2014), 167–315. https://doi.org/10.1561/1100000040",
      "doi": "10.1561/1100000040"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). ACM, New York, NY, USA, 1797–1806. https://doi.org/10.1145/1357054.1357335",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "data.ai. 2019. 2017 Retrospective: A Monumental Year for the App Economy. https://www.data.ai/en/insights/market-data/app-annie-2017-retrospective/. Last accessed 15 August 2022.",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 731–742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "James Fogarty, Jodi Forlizzi, and Scott E. Hudson. 2001. Aesthetic Information Collages: Generating Decorative Displays That Contain Information. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (Orlando, Florida) (UIST ’01). ACM, New York, NY, USA, 141–150. https://doi.org/10.1145/502348.502369",
      "doi": "10.1145/502348.502369"
    },
    {
      "text": "Google. 2021. Firebase Realtime Database. https://firebase.google.com/docs/database. Last accessed 15 August 2021.",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Fábio Pereira, Evangelos Karapanos, Sean A. Munson, and Marc Hassenzahl. 2016. Exploring the Design Space of Glanceable Feedback for Physical Activity Trackers. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Heidelberg, Germany) (UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 144–155. https://doi.org/10.1145/2971648.2971754",
      "doi": "10.1145/2971648.2971754"
    },
    {
      "text": "Dandan Huang, Melanie Tory, Bon Adriel Aseniero, Lyn Bartram, Scott Bateman, Sheelagh Carpendale, Anthony Tang, and Robert Woodbury. 2015. Personal Visualization and Personal Visual Analytics. IEEE Transactions on Visualization and Computer Graphics 21, 3 (March 2015), 420–433. https://doi.org/10.1109/TVCG.2014.2359887",
      "doi": "10.1109/TVCG.2014.2359887"
    },
    {
      "text": "Samuel Huron, Sheelagh Carpendale, Alice Thudt, Anthony Tang, and Michael Mauerer. 2014. Constructive Visualization. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 433–442. https://doi.org/10.1145/2598510.2598566",
      "doi": "10.1145/2598510.2598566"
    },
    {
      "text": "Minhyung Kim, Inyeop Kim, and Uichin Lee. 2021. Beneficial Neglect: Instant Message Notification Handling Behaviors and Academic Performance. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 1, Article 18 (mar 2021), 26 pages. https://doi.org/10.1145/3448089",
      "doi": "10.1145/3448089"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (Santa Clara, California, USA) (CHI ’16). ACM, New York, NY, USA, 272–283. https://doi.org/10.1145/2858036.2858428",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Kostadin Kushlev, Jason Proulx, and Elizabeth W. Dunn. 2016. \"Silence Your Phones\": Smartphone Notifications Increase Inattention and Hyperactivity Symptoms. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1011–1020. https://doi.org/10.1145/2858036.2858359",
      "doi": "10.1145/2858036.2858359"
    },
    {
      "text": "Jan Kučera, James Scott, Nicholas Chen, Patrick Olivier, and Steve Hodges. 2017. Towards Calm Displays: Matching Ambient Illumination in Bedrooms. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 16 (jun 2017), 21 pages. https://doi.org/10.1145/3090081",
      "doi": "10.1145/3090081"
    },
    {
      "text": "Kyung-Ryong Lee, Geon-il Goh, and Young-Woo Park. 2017. Quietto: An Interactive Timepiece Molded in Concrete and Milled Wood. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2988–2992. https://doi.org/10.1145/3025453.3025670",
      "doi": "10.1145/3025453.3025670"
    },
    {
      "text": "Kyung-Ryong Lee, Somi Ju, Temirlan Dzhoroev, Geonil Goh, Moon-Hwan Lee, and Young-Woo Park. 2020. DayClo: An Everyday Table Clock Providing Interaction with Personal Schedule Data for Self-Reflection. Association for Computing Machinery, New York, NY, USA, 1793–1806. https://doi.org/10.1145/3357236.3395439",
      "doi": "10.1145/3357236.3395439"
    },
    {
      "text": "Moon-Hwan Lee, Yea-Kyung Row, Oosung Son, Uichin Lee, Jaejeung Kim, Jungi Jeong, Seungryoul Maeng, and Tek-Jin Nam. 2018. Flower-Pop: Facilitating Casual Group Conversations With Multiple Mobile Devices. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 150 (jan 2018), 24 pages. https://doi.org/10.1145/3161170",
      "doi": "10.1145/3161170"
    },
    {
      "text": "Yu-Kang Lee, Chun-Tuan Chang, You Lin, and Zhao-Hong Cheng. 2014. The dark side of smartphone usage: Psychological traits, compulsive behavior and technostress.Computers in Human Behavior 31 (2014), 373–383. https://doi.org/10.1016/j.chb.2013.10.047",
      "doi": "10.1016/j.chb.2013.10.047"
    },
    {
      "text": "Tzu-Chieh Lin, Yu-Shao Su, Emily Helen Yang, Yun Han Chen, Hao-Ping Lee, and Yung-Ju Chang. 2021. “Put It on the Top, I’ll Read It Later”: Investigating Users’ Desired Display Order for Smartphone Notifications. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 520, 13 pages. https://doi.org/10.1145/3411764.3445384",
      "doi": "10.1145/3411764.3445384"
    },
    {
      "text": "Jennifer Mankoff, Anind K. Dey, Gary Hsieh, Julie Kientz, Scott Lederer, and Morgan Ames. 2003. Heuristic Evaluation of Ambient Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI ’03). ACM, New York, NY, USA, 169–176. https://doi.org/10.1145/642611.642642",
      "doi": "10.1145/642611.642642"
    },
    {
      "text": "Tara Matthews. 2006. Designing and Evaluating Glanceable Peripheral Displays. In Proceedings of the 6th Conference on Designing Interactive Systems (University Park, PA, USA) (DIS ’06). Association for Computing Machinery, New York, NY, USA, 343–345. https://doi.org/10.1145/1142405.1142457",
      "doi": "10.1145/1142405.1142457"
    },
    {
      "text": "Tara Matthews, Tye Rattenbury, and Scott Carter. 2007. Defining, Designing, and Evaluating Peripheral Displays: An Analysis Using Activity Theory. Hum.-Comput. Interact. 22, 1 (May 2007), 221–261. http://dl.acm.org/citation.cfm?id=1466595.1466602",
      "doi": "10.5555/1466595.1466602"
    },
    {
      "text": "Abhinav Mehrotra, Robert Hendley, and Mirco Musolesi. 2016. PrefMiner: Mining User’s Preferences for Intelligent Mobile Notification Management. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Heidelberg, Germany) (UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 1223–1234. https://doi.org/10.1145/2971648.2971747",
      "doi": "10.1145/2971648.2971747"
    },
    {
      "text": "Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing Content-Driven Intelligent Notification Mechanisms for Mobile Applications. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 813–824. https://doi.org/10.1145/2750858.2807544",
      "doi": "10.1145/2750858.2807544"
    },
    {
      "text": "Gonzalo Gabriel Méndez, Uta Hinrichs, and Miguel A. Nacenta. 2017. Bottom-up vs. Top-down: Trade-Offs in Efficiency, Understanding, Freedom and Creativity with InfoVis Tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 841–852. https://doi.org/10.1145/3025453.3025942",
      "doi": "10.1145/3025453.3025942"
    },
    {
      "text": "Carol Moser, Sarita Y. Schoenebeck, and Katharina Reinecke. 2016. Technology at the Table: Attitudes About Mobile Phone Use at Mealtimes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 1881–1892. https://doi.org/10.1145/2858036.2858357",
      "doi": "10.1145/2858036.2858357"
    },
    {
      "text": "mydloch’s dev team. 2021. Notification History. https://play.google.com/store/apps/details?id=com.myd.android.nhistory2. Last accessed 15 August 2022.",
      "doi": ""
    },
    {
      "text": "Chunjong Park, Junsung Lim, Juho Kim, Sung-Ju Lee, and Dongman Lee. 2017. Don’T Bother Me. I’m Socializing!: A Breakpoint-Based Smartphone Notification System. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). ACM, New York, NY, USA, 541–554. https://doi.org/10.1145/2998181.2998189",
      "doi": "10.1145/2998181.2998189"
    },
    {
      "text": "Martin Pielot, Bruno Cardoso, Kleomenis Katevas, Joan Serrà, Aleksandar Matic, and Nuria Oliver. 2017. Beyond Interruptibility: Predicting Opportune Moments to Engage Mobile Phone Users. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 91 (sep 2017), 25 pages. https://doi.org/10.1145/3130956",
      "doi": "10.1145/3130956"
    },
    {
      "text": "Martin Pielot, Karen Church, and Rodrigo de Oliveira. 2014. An In-situ Study of Mobile Phone Notifications. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (Toronto, ON, Canada) (MobileHCI ’14). ACM, New York, NY, USA, 233–242. https://doi.org/10.1145/2628363.2628364",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Martin Pielot and Luz Rello. 2017. Productive, Anxious, Lonely: 24 Hours Without Push Notifications. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (Vienna, Austria) (MobileHCI ’17). ACM, New York, NY, USA, Article 11, 11 pages. https://doi.org/10.1145/3098279.3098526",
      "doi": "10.1145/3098279.3098526"
    },
    {
      "text": "Martin Pielot, Amalia Vradi, and Souneil Park. 2018. Dismissed!: A Detailed Exploration of How Mobile Phone Users Handle Push Notifications. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). ACM, New York, NY, USA, Article 3, 11 pages. https://doi.org/10.1145/3229434.3229445",
      "doi": "10.1145/3229434.3229445"
    },
    {
      "text": "Zachary Pousman and John Stasko. 2006. A Taxonomy of Ambient Information Systems: Four Patterns of Design. In Proceedings of the Working Conference on Advanced Visual Interfaces (Venezia, Italy) (AVI ’06). ACM, New York, NY, USA, 67–74. https://doi.org/10.1145/1133265.1133277",
      "doi": "10.1145/1133265.1133277"
    },
    {
      "text": "Zachary Pousman, John Stasko, and Michael Mateas. 2007. Casual Information Visualization: Depictions of Data in Everyday Life. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov 2007), 1145–1152. https://doi.org/10.1109/TVCG.2007.70541",
      "doi": "10.1109/TVCG.2007.70541"
    },
    {
      "text": "Counterpoint Research. 2022. Smartphone Market Share of South Korea in 2021 (in Korean).https://korea.counterpointresearch.com/2022%eb%85%84-%ea%b5%ad%eb%82%b4-%ec%8a%a4%eb%a7%88%ed%8a%b8%ed%8f%b0-%ec%8b%9c%ec%9e%a5-1680%eb%a7%8c%eb%8c%80-%ec%98%88%ec%83%81-%ec%a0%84%eb%85%84%eb%8c%80%eb%b9%84-%ec%86%8c%ed%8f%ad-%ec%83%81/. Last accessed 21 June 2022.",
      "doi": ""
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-scale Assessment of Mobile Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 3055–3064. https://doi.org/10.1145/2556288.2557189",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "In-geon Shin, Jin-min Seok, and Youn-kyung Lim. 2018. Too Close and Crowded: Understanding Stress on Mobile Instant Messengers Based on Proxemics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 615, 12 pages. https://doi.org/10.1145/3173574.3174189",
      "doi": "10.1145/3173574.3174189"
    },
    {
      "text": "Tobias Skog. 2004. Activity Wallpaper: Ambient Visualization of Activity Information. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (Cambridge, MA, USA) (DIS ’04). Association for Computing Machinery, New York, NY, USA, 325–328. https://doi.org/10.1145/1013115.1013171",
      "doi": "10.1145/1013115.1013171"
    },
    {
      "text": "Tobias Skog, Sara Ljungblad, and Lars Erik Holmquist. 2003. Between Aesthetics and Utility: Designing Ambient Information Visualizations. In Proceedings of the Ninth Annual IEEE Conference on Information Visualization (Seattle, Washington) (INFOVIS’03). IEEE Computer Society, Washington, DC, USA, 233–240. http://dl.acm.org/citation.cfm?id=1947368.1947410",
      "doi": ""
    },
    {
      "text": "Dominik Weber, Alexandra Voit, Jonas Auda, Stefan Schneegass, and Niels Henze. 2018. Snooze!: Investigating the User-defined Deferral of Mobile Notifications. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). ACM, New York, NY, USA, Article 2, 13 pages. https://doi.org/10.1145/3229434.3229436",
      "doi": "10.1145/3229434.3229436"
    },
    {
      "text": "Dominik Weber, Alexandra Voit, and Niels Henze. 2018. Notification Log: An Open-Source Framework for Notification Research on Mobile Devices. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers (Singapore, Singapore) (UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 1271–1278. https://doi.org/10.1145/3267305.3274118",
      "doi": "10.1145/3267305.3274118"
    },
    {
      "text": "Dominik Weber, Alexandra Voit, Gisela Kollotzek, and Niels Henze. 2019. Annotif: A System for Annotating Mobile Notifcations in User Studies. In Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia(Pisa, Italy) (MUM ’19). Association for Computing Machinery, New York, NY, USA, Article 24, 12 pages. https://doi.org/10.1145/3365610.3365611",
      "doi": "10.1145/3365610.3365611"
    },
    {
      "text": "Mark Weiser and John Seely Brown. 1996. Designing Calm Technology. POWERGRID JOURNAL 1(1996).",
      "doi": ""
    },
    {
      "text": "Amir Zaidi. 2019. Rootless Pixel Launcher. https://github.com/amirzaidi/Launcher3.",
      "doi": ""
    },
    {
      "text": "Leizhong Zhang, Nan Tu, and Dave Vronay. 2005. Info-lotus: A Peripheral Visualization for Email Notification. In CHI ’05 Extended Abstracts on Human Factors in Computing Systems (Portland, OR, USA) (CHI EA ’05). ACM, New York, NY, USA, 1901–1904. https://doi.org/10.1145/1056808.1057051",
      "doi": "10.1145/1056808.1057051"
    }
  ]
}