{
  "doi": "10.1145/3544548.3581002",
  "title": "MechCircuit: Augmenting Laser-Cut Objects with Integrated Electronics, Mechanical Structures and Magnets",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Laser cutting revolutionizes the creation of personal-fabricated prototypes. These objects can have transformable properties by adopting different materials and be interactive by integrating electronic circuits. However, circuits in laser-cut objects always have limited movements, which refrains laser cutting from achieving interactive prototypes with more complex movable functions like mechanisms. We propose MechCircuit, a design and fabrication pipeline for making mechanical-electronical objects with laser cutting. We leverage the neodymium magnet’s natures of magnetism and conductivity to integrate electronics and mechanical structure joints into prototypes. We conduct the evaluation to explore technological parameters and assess the practical feasibility of the fabrication pipeline. And we organized a user-observing workshop for non-expert users. Through the outcoming prototypes, the result demonstrates the feasibility of MechCircuit as a useful and inspiring prototyping method.",
  "authors": [
    {
      "name": "Shuyue Feng",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780488",
      "orcid": "0000-0002-6720-5356"
    },
    {
      "name": "Cheng Yao",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87258818557",
      "orcid": "0000-0001-6572-0242"
    },
    {
      "name": "Weijia Lin",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233368",
      "orcid": "0000-0003-2463-7092"
    },
    {
      "name": "Jiayu Yao",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234266",
      "orcid": "0000-0001-7388-1695"
    },
    {
      "name": "Chao Zhang",
      "institution": "Zhejiang University, China",
      "img": "/do/10.1145/contrib-99659701295/rel-imgonly/avatar.jpg",
      "acmid": "99659701295",
      "orcid": "0000-0003-4286-8468"
    },
    {
      "name": "Zhongyu Jia",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780700",
      "orcid": "0000-0003-1144-6078"
    },
    {
      "name": "Lijuan Liu",
      "institution": "Zhejiang University City College, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262011",
      "orcid": "0000-0002-1456-5163"
    },
    {
      "name": "Masulani Bokola",
      "institution": "School of Design, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778737",
      "orcid": "0000-0003-1681-4394"
    },
    {
      "name": "Hangyue Chen",
      "institution": "Hangzhou Dianzi University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782567",
      "orcid": "0000-0002-8367-905X"
    },
    {
      "name": "Fangtian Ying",
      "institution": "Macau University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474669644",
      "orcid": "0000-0001-9047-0257"
    },
    {
      "name": "Guanyun Wang",
      "institution": "Zhejiang University, China",
      "img": "/do/10.1145/contrib-87258679957/rel-imgonly/20201100____v6.jpg",
      "acmid": "87258679957",
      "orcid": "0000-0002-7904-1504"
    }
  ],
  "references": [
    {
      "text": "Muhammad Abdullah, Romeo Sommerfeld, Laurenz Seidel, Jonas Noack, Ran Zhang, Thijs Roumen, and Patrick Baudisch. 2021. Roadkill: Nesting Laser-Cut Objects for Fast Assembly. In The 34th Annual ACM Symposium on User Interface Software and Technology. 972–984.",
      "doi": ""
    },
    {
      "text": "[2] Arduino.July 28, 2022. https://www.arduino.cc/",
      "doi": ""
    },
    {
      "text": "Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-Ting Chen, and Patrick Baudisch. 2015. Platener: Low-fidelity fabrication of 3D objects by substituting 3D print with laser-cut plates. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1799–1806.",
      "doi": "10.1145/2702123.2702225"
    },
    {
      "text": "Roger Boldu, Sambhav Jain, Juan Pablo Forero Cortes, Haimo Zhang, and Suranga Nanayakkara. 2019. M-Hair: Creating novel tactile feedback by augmenting the body hair to respond to magnetic field. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 323–328.",
      "doi": "10.1145/3332165.3347955"
    },
    {
      "text": "Jesse Burstyn, Nicholas Fellion, Paul Strohmeier, and Roel Vertegaal. 2015. Printput: Resistive and capacitive input widgets for interactive 3D prints. In IFIP Conference on Human-Computer Interaction. Springer, 332–339.",
      "doi": "10.1007/978-3-319-22701-6_25"
    },
    {
      "text": "Jacques Calì, Dan A Calian, Cristina Amati, Rebecca Kleinberger, Anthony Steed, Jan Kautz, and Tim Weyrich. 2012. 3D-printing of non-assembly, articulated models. ACM Transactions on Graphics (TOG) 31, 6 (2012), 1–8.",
      "doi": "10.1145/2366145.2366149"
    },
    {
      "text": "Perumal Varun Chadalavada and Daniel J Wigdor. 2016. Foldem: Heterogeneous Object Fabrication via Selective Ablation of Multi-Material Sheets.. In CHI. 5765–5775.",
      "doi": ""
    },
    {
      "text": "Li Ding, Shouhu Xuan, Jiabin Feng, and Xinglong Gong. 2017. Magnetic/conductive composite fibre: A multifunctional strain sensor with magnetically driven property. Composites Part A: Applied Science and Manufacturing 100 (2017), 97–105.",
      "doi": ""
    },
    {
      "text": "Daniel Groeger and Jürgen Steimle. 2019. LASEC: Instant Fabrication of Stretchable Circuits Using a Laser Cutter. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300929"
    },
    {
      "text": "Rui Guo, Xuyang Sun, Bo Yuan, Hongzhang Wang, and Jing Liu. 2019. Magnetic liquid metal (Fe-EGaIn) based multifunctional electronics for remote self-healing materials, degradable electronics, and thermal transfer printing. Advanced Science 6, 20 (2019), 1901478.",
      "doi": ""
    },
    {
      "text": "Ollie Hanton, Michael Wessely, Stefanie Mueller, Mike Fraser, and Anne Roudaut. 2020. ProtoSpray: Combining 3D printing and spraying to create interactive displays with arbitrary shapes. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376543"
    },
    {
      "text": "Liang He, Huaishu Peng, Michelle Lin, Ravikanth Konjeti, François Guimbretière, and Jon E Froehlich. 2019. Ondulé: Designing and controlling 3D printable springs. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 739–750.",
      "doi": "10.1145/3332165.3347951"
    },
    {
      "text": "Freddie Hong, Connor Myant, and David E Boyle. 2021. Thermoformed Circuit Boards: Fabrication of highly conductive freeform 3D printed circuit boards with heat bending. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3411764.3445469"
    },
    {
      "text": "Meng-Ju Hsieh, Rong-Hao Liang, Da-Yuan Huang, Jheng-You Ke, and Bing-Yu Chen. 2018. RFIBricks: Interactive building blocks based on RFID. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–10.",
      "doi": "10.1145/3173574.3173763"
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial mechanisms. In Proceedings of the 29th annual symposium on user interface software and technology. 529–539.",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Alexandra Ion, Robert Kovacs, Oliver S Schneider, Pedro Lopes, and Patrick Baudisch. 2018. Metamaterial textures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173910"
    },
    {
      "text": "Ayaka Ishii, Kunihiro Kato, Kaori Ikematsu, Yoshihiro Kawahara, and Itiro Siio. 2022. CircWood: Laser Printed Circuit Boards and Sensors for Affordable DIY Woodworking. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–11.",
      "doi": ""
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2016. 3d printed physical interfaces that can extend touch devices. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 47–49.",
      "doi": "10.1145/2984751.2985700"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S Cook, Cheng Zhang, and Gregory D Abowd. 2013. Instant inkjet circuits: lab-based inkjet printing to support rapid prototyping of UbiComp devices. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. 363–372.",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Arshad Khan, Joan Sol Roo, Tobias Kraus, and Jürgen Steimle. 2019. Soft inkjet circuits: rapid multi-material fabrication of soft circuits using a commodity inkjet printer. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 341–354.",
      "doi": "10.1145/3332165.3347892"
    },
    {
      "text": "Han-Jong Kim, Yunwoo Jeong, Ju-Whan Kim, and Tek-Jin Nam. 2016. M. Sketch: Prototyping tool for linkage-based mechanism design. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 75–77.",
      "doi": "10.1145/2984751.2985709"
    },
    {
      "text": "Danny Leen, Nadya Peek, and Raf Ramakers. 2020. Lamifold: fabricating objects with integrated mechanisms using a laser cutter lamination workflow. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 304–316.",
      "doi": "10.1145/3379337.3415885"
    },
    {
      "text": "Simon J Leigh, Robert J Bradley, Christopher P Purssell, Duncan R Billson, and David A Hutchins. 2012. A simple, low-cost conductive composite material for 3D printing of electronic sensors. PloS one 7, 11 (2012), e49365.",
      "doi": ""
    },
    {
      "text": "Jiajie Liang, Yanfei Xu, Dong Sui, Long Zhang, Yi Huang, Yanfeng Ma, Feifei Li, and Yongsheng Chen. 2010. Flexible, magnetic, and electrically conductive graphene/Fe3O4 paper and its application for magnetic-controlled switches. The Journal of Physical Chemistry C 114, 41 (2010), 17465–17471.",
      "doi": ""
    },
    {
      "text": "Rong-Hao Liang, Liwei Chan, Hung-Yu Tseng, Han-Chih Kuo, Da-Yuan Huang, De-Nian Yang, and Bing-Yu Chen. 2014. GaussBricks: magnetic building blocks for constructive tangible interactions on portable displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3153–3162.",
      "doi": "10.1145/2556288.2557105"
    },
    {
      "text": "Lijuan Liu, Jiahao Guo, Chao Zhang, Zhangzhi Wang, Pinqi Zhu, Tuo Fang, Junwu Wang, Cheng Yao, and Fangtian Ying. 2021. ElectroPaper: Design and Fabrication of Paper-Based Electronic Interfaces for the Water Environment. Electronics 10, 5 (2021), 604.",
      "doi": ""
    },
    {
      "text": "Eric Markvicka, Guanyun Wang, Yi-Chin Lee, Gierad Laput, Carmel Majidi, and Lining Yao. 2019. Electrodermis: Fully untethered, stretchable, and highly-customizable electronic bandages. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3290605.3300862"
    },
    {
      "text": "James McCrae, Nobuyuki Umetani, and Karan Singh. 2014. FlatFitFab: interactive modeling with planar sections. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 13–22.",
      "doi": "10.1145/2642918.2647388"
    },
    {
      "text": "Ankur M Mehta and Daniela Rus. 2014. An end-to-end system for designing mechanical structures for print-and-fold robots. In 2014 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 1460–1465.",
      "doi": ""
    },
    {
      "text": "Rafael Morales González, Caroline Appert, Gilles Bailly, and Emmanuel Pietriga. 2017. Passive yet expressive touchtokens. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3741–3745.",
      "doi": "10.1145/3025453.3025894"
    },
    {
      "text": "Martin Nisser, Christina Chen Liao, Yuchen Chai, Aradhana Adhikari, Steve Hodges, and Stefanie Mueller. 2021. LaserFactory: a laser cutter-based electromechanical assembly and fabrication platform to make functional devices & robots. In Proceedings of the 2021 CHI Conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3411764.3445692"
    },
    {
      "text": "Masa Ogata. 2018. Magneto-haptics: Embedding magnetic force feedback for physical interactions. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 737–743.",
      "doi": "10.1145/3242587.3242615"
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio: Digital fabrication of interactive and shape-changing objects with foldable printed electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 223–232.",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "Emmanuel Rodriguez, Georges-Pierre Bonneau, Stefanie Hahmann, and Mélina Skouras. 2022. Computational Design of Laser-Cut Bending-Active Structures. Computer-Aided Design(2022), 103335.",
      "doi": ""
    },
    {
      "text": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B Goldman, Gautham Mysore, and Wilmot Li. 2015. Lamello: Passive acoustic sensing for tangible input components. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1277–1280.",
      "doi": "10.1145/2702123.2702207"
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A fabrication pipeline to design and 3D print capacitive touch sensors for interactive objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 253–258.",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Martin Schmitz, Jan Riemann, Florian Müller, Steffen Kreis, and Max Mühlhäuser. 2021. Oh, Snap! A Fabrication Pipeline to Magnetically Connect Conventional and 3D-Printed Electronics. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3411764.3445641"
    },
    {
      "text": "Madlaina Signer, Alexandra Ion, and Olga Sorkine-Hornung. 2021. Developable Metamaterials: Mass-fabricable Metamaterials by Laser-Cutting Elastic Structures. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445666"
    },
    {
      "text": "Paul Strohmeier and Jess McIntosh. 2020. Novel Input and Output opportunities using an Implanted Magnet. In Proceedings of the Augmented Humans International Conference. 1–5.",
      "doi": "10.1145/3384657.3384785"
    },
    {
      "text": "Saiganesh Swaminathan, Kadri Bugra Ozutemiz, Carmel Majidi, and Scott E Hudson. 2019. Fiberwire: Embedding electronic function into 3d printed mechanically strong, lightweight carbon fiber composite objects. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300797"
    },
    {
      "text": "Yichao Tang, Gaojian Lin, Lin Han, Songgang Qiu, Shu Yang, and Jie Yin. 2015. Design of hierarchically cut hinges for highly stretchable and reconfigurable metamaterials with enhanced strength. Advanced Materials 27, 44 (2015), 7181–7190.",
      "doi": ""
    },
    {
      "text": "Ye Tao, Guanyun Wang, Caowei Zhang, Nannan Lu, Xiaolian Zhang, Cheng Yao, and Fangtian Ying. 2017. Weavemesh: A low-fidelity and low-cost prototyping approach for 3d models created by flexible assembly. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 509–518.",
      "doi": "10.1145/3025453.3025699"
    },
    {
      "text": "Udayan Umapathi, Hsiang-Ting Chen, Stefanie Mueller, Ludwig Wall, Anna Seufert, and Patrick Baudisch. 2015. LaserStacker: Fabricating 3D objects by laser cutting and welding. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 575–582.",
      "doi": "10.1145/2807442.2807512"
    },
    {
      "text": "Guanyun Wang, Fang Qin, Haolin Liu, Ye Tao, Yang Zhang, Yongjie Jessica Zhang, and Lining Yao. 2020. Morphingcircuit: An integrated design, simulation, and fabrication workflow for self-morphing electronics. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 4 (2020), 1–26.",
      "doi": "10.1145/3432200"
    },
    {
      "text": "Michael Wessely, Ticha Sethapakdi, Carlos Castillo, Jackson C Snowden, Ollie Hanton, Isabel PS Qamar, Mike Fraser, Anne Roudaut, and Stefanie Mueller. 2020. Sprayable user interfaces: Prototyping large-scale interactive surfaces with sensors and displays. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376249"
    },
    {
      "text": "Katrin Wolf and Peter D Bennett. 2013. Haptic cues: texture as a guide for non-visual tangible interaction. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 1599–1604.",
      "doi": ""
    },
    {
      "text": "Junichi Yamaoka, Mustafa Doga Dogan, Katarina Bulovic, Kazuya Saito, Yoshihiro Kawahara, Yasuaki Kakehi, and Stefanie Mueller. 2019. FoldTronics: Creating 3D objects with integrated electronics using foldable honeycomb structures. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3290605.3300858"
    },
    {
      "text": "Junichi Yamaoka, Kazunori Nozawa, Shion Asada, Ryuma Niiyama, Yoshihiro Kawahara, and Yasuaki Kakehi. 2018. AccordionFab: Fabricating Inflatable 3D Objects by Laser Cutting and Welding Multi-Layered Sheets. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings. 160–162.",
      "doi": "10.1145/3266037.3271636"
    },
    {
      "text": "Cheng Yao, Ye Tao, Ting Zhang, Guanyun Wang, and Fangtian Ying. 2017. A Programming Cutting System to Enhance Productivity with Individualities. In International Conference on Distributed, Ambient, and Pervasive Interactions. Springer, 561–571.",
      "doi": "10.1007/978-3-319-58697-7_42"
    },
    {
      "text": "Kentaro Yasu. 2019. Magnetact: magnetic-sheet-based haptic interfaces for touch devices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290605.3300470"
    },
    {
      "text": "Kentaro Yasu. 2020. MagneLayer: Force Field Fabrication by Layered Magnetic Sheets. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3313831.3376552"
    },
    {
      "text": "Yan Zhao, Yuta Sugiura, Mitsunori Tada, and Jun Mitani. 2017. InsTangible: A Tangible User Interface Combining Pop-up Cards with Conductive Ink Printing. In International Conference on Entertainment Computing. Springer, 72–80.",
      "doi": ""
    },
    {
      "text": "Clement Zheng, Jeeeun Kim, Daniel Leithinger, Mark D Gross, and Ellen Yi-Luen Do. 2019. Mechamagnets: Designing and fabricating haptic and functional physical inputs with embedded magnets. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction. 325–334.",
      "doi": "10.1145/3294109.3295622"
    },
    {
      "text": "Clement Zheng, HyunJoo Oh, Laura Devendorf, and Ellen Yi-Luen Do. 2019. Sensing kirigami. In Proceedings of the 2019 on Designing Interactive Systems Conference. 921–934.",
      "doi": "10.1145/3322276.3323689"
    },
    {
      "text": "Clement Zheng, Zhen Zhou Yong, Hongnan Lin, HyunJoo Oh, and Ching Chiuan Yen. 2022. Shape-Haptics: Planar & Passive Force Feedback Mechanisms for Physical Interfaces. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    }
  ]
}