{
  "doi": "10.1145/3544548.3581213",
  "title": "Understanding How Low Vision People Read Using Eye Tracking",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "While being able to read with screen magnifiers, low vision people have slow and unpleasant reading experiences. Eye tracking has the potential to improve their experience by recognizing fine-grained gaze behaviors and providing more targeted enhancements. To inspire gaze-based low vision technology, we investigate the suitable method to collect low vision users’ gaze data via commercial eye trackers and thoroughly explore their challenges in reading based on their gaze behaviors. With an improved calibration interface, we collected the gaze data of 20 low vision participants and 20 sighted controls who performed reading tasks on a computer screen; low vision participants were also asked to read with different screen magnifiers. We found that, with an accessible calibration interface and data collection method, commercial eye trackers can collect gaze data of comparable quality from low vision and sighted people. Our study identified low vision people’s unique gaze patterns during reading, building upon which, we propose design implications for gaze-based low vision technology.",
  "tags": [
    "Accessibility",
    "gaze pattern",
    "low vision",
    "eye tracking",
    "reading"
  ],
  "authors": [
    {
      "name": "Ru Wang",
      "institution": "Department of Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782063",
      "orcid": "0000-0003-3907-2370"
    },
    {
      "name": "Linxiu Zeng",
      "institution": "Department of Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783284",
      "orcid": "0000-0001-7400-3843"
    },
    {
      "name": "Xinyong Zhang",
      "institution": "Renmin University of China, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309486006",
      "orcid": "0000-0002-4336-9954"
    },
    {
      "name": "Sanbrita Mondal",
      "institution": "School of Medicine and Public Health, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781449",
      "orcid": "0000-0003-4454-8978"
    },
    {
      "name": "Yuhang Zhao",
      "institution": "Department of Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/do/10.1145/contrib-81472651606/rel-imgonly/img_2060.jpg",
      "acmid": "81472651606",
      "orcid": "0000-0003-3686-695X"
    }
  ],
  "references": [
    {
      "text": "Carlos Aguilar and Eric Castet. 2017. Evaluation of a gaze-controlled vision enhancement system for reading in visually impaired people. PLoS One 12, 4 (2017), e0174910.",
      "doi": ""
    },
    {
      "text": "Sonia J Ahn and Gordon E Ledge. 1995. Psychophysics of reading—XIII. Predictors of magnifier-aided reading speed in low vision. Vision Research 35, 13 (1995), 1931–1938.",
      "doi": ""
    },
    {
      "text": "Apple. 2022. How to zoom in or out on Mac. Available online at: https://support.apple.com/en-us/HT210978, last accessed on 8/23/2022.",
      "doi": ""
    },
    {
      "text": "Kazunori Asada. 2016. Brighter and Bigger. Available online at: http://asada.website/brighterandbigger/e/index.html, last accessed on 12/06/2022.",
      "doi": ""
    },
    {
      "text": "Stephen Bax. 2013. The cognitive processing of candidates during reading tests: Evidence from eye-tracking. Language Testing 30, 4 (2013), 441–465.",
      "doi": ""
    },
    {
      "text": "Alex R Bowers, Jan E Lovie-Kitchin, Russell L Woods, 2001. Eye movements and reading with large print and optical magnifiers in macular disease. Optometry and Vision Science 78, 5 (2001), 325–334.",
      "doi": ""
    },
    {
      "text": "Norick R Bowers and Martina Poletti. 2017. Microsaccades during reading. PloS one 12, 9 (2017), e0185180.",
      "doi": ""
    },
    {
      "text": "James V Bradley. 1958. Complete counterbalancing of immediate sequential effects in a Latin square design. J. Amer. Statist. Assoc. 53, 282 (1958), 525–528.",
      "doi": ""
    },
    {
      "text": "Brian Brown, Anthony J Adams, Arthur Jampolsky, and Michael Muegge. 1977. A clinically useful eye movement recording system.American Journal of Optometry and Physiological Optics 54, 1(1977), 56–60.",
      "doi": ""
    },
    {
      "text": "Hugo Bruggeman and Gordon E Legge. 2002. Psychophysics of reading. XIX. Hypertext search and retrieval with low vision. Proc. IEEE 90, 1 (2002), 94–103.",
      "doi": ""
    },
    {
      "text": "Mark A Bullimore and Ian L Bailey. 1995. Reading and eye movements in age-related maculopathy. Optometry and Vision Science 72, 2 (1995), 125–138.",
      "doi": ""
    },
    {
      "text": "Alpha Cephei. 2022. VOSK Offline Speech Recognition API. Available online at: https://alphacephei.com/vosk/, last accessed on 12/11/2022.",
      "doi": ""
    },
    {
      "text": "Shiwei Cheng, Zhiqiang Sun, Lingyun Sun, Kirsten Yee, and Anind K Dey. 2015. Gaze-based annotations for reading comprehension. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1569–1572.",
      "doi": "10.1145/2702123.2702271"
    },
    {
      "text": "Allen MY Cheong, Gordon E Legge, Mary G Lawrence, Sing-Hang Cheung, and Mary A Ruff. 2007. Relationship between slow visual processing and reading speed in people with macular degeneration. Vision research 47, 23 (2007), 2943–2955.",
      "doi": ""
    },
    {
      "text": "Allen MY Cheong, Gordon E Legge, Mary G Lawrence, Sing-Hang Cheung, and Mary A Ruff. 2008. Relationship between visual span and reading performance in age-related macular degeneration. Vision research 48, 4 (2008), 577–588.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 2013. Statistical power analysis for the behavioral sciences. Routledge.",
      "doi": ""
    },
    {
      "text": "Scott Crossley, Aron Heintz, Joon Suh Choi, Jordan Batchelor, Mehrnoush Karimi, and Agnes Malatinszky. 2022. A large-scaled corpus for assessing text readability. Behavior Research Methods(2022), 1–17.",
      "doi": ""
    },
    {
      "text": "Asim H Dar, Adina S Wagner, and Michael Hanke. 2021. REMoDNaV: robust eye-movement classification for dynamic stimulation. Behavior research methods 53, 1 (2021), 399–414.",
      "doi": ""
    },
    {
      "text": "AC Durand and GEORGE M GOULD. 1910. A method of determining ocular dominance. Journal of the American Medical Association 55, 5 (1910), 369–370.",
      "doi": ""
    },
    {
      "text": "Lisa A Elkin, Matthew Kay, James J Higgins, and Jacob O Wobbrock. 2021. An aligned rank transform procedure for multifactor contrast tests. In The 34th Annual ACM Symposium on User Interface Software and Technology. 754–768.",
      "doi": "10.1145/3472749.3474784"
    },
    {
      "text": "Ralf Engbert and Reinhold Kliegl. 2003. Microsaccades uncover the orientation of covert attention. Vision research 43, 9 (2003), 1035–1045.",
      "doi": ""
    },
    {
      "text": "Envision. 2022. Envision App. Available online at: https://www.letsenvision.com/app, last accessed on 12/06/2022.",
      "doi": ""
    },
    {
      "text": "Frederick L Ferris III, Aaron Kassoff, George H Bresnick, and Ian Bailey. 1982. New visual acuity charts for clinical research. American journal of ophthalmology 94, 1 (1982), 91–96.",
      "doi": ""
    },
    {
      "text": "Flask. 2022. Flask Documentation. Available online at: https://flask.palletsprojects.com/en/2.2.x/, last accessed on 9/4/2022.",
      "doi": ""
    },
    {
      "text": "Rudolph Flesch. 1948. A new readability yardstick.Journal of applied psychology 32, 3 (1948), 221.",
      "doi": ""
    },
    {
      "text": "Agostino Gibaldi, Mauricio Vanegas, Peter J Bex, and Guido Maiello. 2017. Evaluation of the Tobii EyeX Eye tracking controller and Matlab toolkit for research. Behavior research methods 49, 3 (2017), 923–946.",
      "doi": ""
    },
    {
      "text": "Tersia Gowases, Roman Bednarik, and Markku Tukiainen. 2011. Text highlighting improves user experience for reading with magnified displays. In CHI’11 Extended Abstracts on Human Factors in Computing Systems. 1891–1896.",
      "doi": ""
    },
    {
      "text": "Elias Daniel Guestrin and Moshe Eizenman. 2006. General theory of remote gaze estimation using the pupil center and corneal reflections. IEEE Transactions on biomedical engineering 53, 6 (2006), 1124–1133.",
      "doi": ""
    },
    {
      "text": "Elyse C Hallett. 2015. Reading without bounds: How different magnification methods affect the performance of students with low vision. California State University, Long Beach.",
      "doi": ""
    },
    {
      "text": "Elyse C Hallett, Wayne Dick, Tom Jewett, and Kim-Phuong L Vu. 2017. How screen magnification with and without word-wrapping affects the user experience of adults with low vision. In International Conference on Applied Human Factors and Ergonomics. Springer, 665–674.",
      "doi": ""
    },
    {
      "text": "Stephen Harland, Gordon E Legge, and Andrew Luebker. 1998. Psychophysics of reading. XVII. Low-vision performance with four types of electronically magnified text. Optometry and Vision Science 75, 3 (1998), 183–190.",
      "doi": ""
    },
    {
      "text": "Halszka Jarodzka and Saskia Brand-Gruwel. 2017. Tracking the reading eye: Towards a model of real-world reading., 193–201 pages.",
      "doi": ""
    },
    {
      "text": "Anuradha Kar and Peter Corcoran. 2017. A review and analysis of eye-gaze estimation systems, algorithms and performance evaluation methods in consumer platforms. IEEE Access 5(2017), 16495–16519.",
      "doi": ""
    },
    {
      "text": "J Peter Kincaid, Robert P Fishburne Jr, Richard L Rogers, and Brad S Chissom. 1975. Derivation of new readability formulas (automated readability index, fog count and flesch reading ease formula) for navy enlisted personnel. Technical Report. Naval Technical Training Command Millington TN Research Branch.",
      "doi": ""
    },
    {
      "text": "CC Krischer, M Stein-Arsic, R Meissen, and J Zihl. 1985. Visual performance and reading capacity of partially sighted persons in a rehabilitation center.American journal of optometry and physiological optics 62, 1(1985), 52–58.",
      "doi": ""
    },
    {
      "text": "MiYoung Kwon, Anirvan S Nandy, and Bosco S Tjan. 2013. Rapid and persistent adaptability of human oculomotor control in response to simulated central vision loss. Current Biology 23, 17 (2013), 1663–1669.",
      "doi": ""
    },
    {
      "text": "Gordon E Legge, Sonia J Ahn, Timothy S Klitz, and Andrew Luebker. 1997. Psychophysics of reading—XVI. The visual span in normal and low vision. Vision Research 37, 14 (1997), 1999–2010.",
      "doi": ""
    },
    {
      "text": "Gordon E Legge, Gary S Rubin, Denis G Pelli, and Mary M Schleske. 1985. Psychophysics of reading—II. Low vision. Vision research 25, 2 (1985), 253–265.",
      "doi": ""
    },
    {
      "text": "SR Research Ltd.2012. EyeLink 1000 Quotation. Available online at: https://techfee.fau.edu/approvedproposals/Download.cfm?sid=7&pid=44, last accessed on 9/15/2022.",
      "doi": ""
    },
    {
      "text": "Sina Masnadi, Brian Williamson, Andrés N Vargas González, and Joseph J LaViola. 2020. Vriassist: An eye-tracked virtual reality low vision assistance tool. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 808–809.",
      "doi": ""
    },
    {
      "text": "Natalie Maus, Dalton Rutledge, Sedeeq Al-Khazraji, Reynold Bailey, Cecilia Ovesdotter Alm, and Kristen Shinohara. 2020. Gaze-guided Magnification for Individuals with Vision Impairments. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": ""
    },
    {
      "text": "G Harry Mc Laughlin. 1969. SMOG grading-a new readability formula. Journal of reading 12, 8 (1969), 639–646.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2022. Use Magnifier to make things on the screen easier to see. Available online at: https://support.microsoft.com/en-us/windows/use-magnifier-to-make-things-on-the-screen-easier-to-see-414948ba-8b1c-d3bd-8615-0e5e32204198#WindowsVersion=Windows_11, last accessed on 8/23/2022.",
      "doi": ""
    },
    {
      "text": "Kirk Moffitt. 1980. Evaluation of the fixation duration in visual search. Perception & Psychophysics 27, 4 (1980), 370–372.",
      "doi": ""
    },
    {
      "text": "Lourdes Moreno, Xabier Valencia, J Eduardo Pérez, and Myriam Arrue. 2021. An exploratory study of web adaptation techniques for people with low vision. Universal access in the information society 20, 2 (2021), 223–237.",
      "doi": ""
    },
    {
      "text": "Yasuyuki Murai, Masaji Kawahara, Hisayuki Tatsumi, Iwao Sekita, and Masahiro Miyakawa. 2010. Eye tracking for low vision aids-toward guiding of gaze. In International conference on computers for handicapped persons. Springer, 308–315.",
      "doi": ""
    },
    {
      "text": "NIH. 2020. Low Vision - National Eye Institute. Available online at: https://www.nei.nih.gov/learn-about-eye-health/eye-conditions-and-diseases/low-vision, last accessed on 8/23/2022.",
      "doi": ""
    },
    {
      "text": "Roberta A Pagon. 1981. Ocular coloboma. Survey of ophthalmology 25, 4 (1981), 223–236.",
      "doi": ""
    },
    {
      "text": "Krishnamachari S Prahalad and Daniel R Coates. 2020. Asymmetries of reading eye movements in simulated central vision loss. Vision research 171(2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Tobii Pro. 2021. Tobii Pro Fusion Field Metrics Test Report. Available online at: https://www.tobiipro.com/siteassets/tobii-pro/products/hardware/fusion/tobii-pro-fusion-field-metrics-test-report.pdf, last accessed on 9/4/2022.",
      "doi": ""
    },
    {
      "text": "Tobii Pro. 2022. Performing a calibration and validation in Pro Lab. Available online at: https://www.tobiipro.com/learn-and-support/learn/steps-in-an-eye-tracking-study/run/performing-a-calibration-and-validation-in-pro-lab/, last accessed on 9/7/2022.",
      "doi": ""
    },
    {
      "text": "Tobii Pro. 2022. Screen-based eye tracker for research | Tobii Pro Fusion. Available online at: https://www.tobiipro.com/product-listing/fusion/, last accessed on 9/7/2022.",
      "doi": ""
    },
    {
      "text": "Tobii Pro. 2022. Tobii Pro Lab. Available online at: https://www.tobiipro.com/product-listing/tobii-pro-lab/, last accessed on 9/7/2022.",
      "doi": ""
    },
    {
      "text": "Tobii Pro. 2022. Tobii Pro SDK. Available online at: https://www.tobiipro.com/product-listing/tobii-pro-sdk/, last accessed on 9/7/2022.",
      "doi": ""
    },
    {
      "text": "L Racette, M Fischer, H Bebie, G Holló, CA Johnson, and C Matsumoto. 2016. Visual field digest: A guide to perimetry and the Octopus perimeter. Köniz, Switzerland: Haag-Streit AG 289 (2016).",
      "doi": ""
    },
    {
      "text": "Keith Rayner. 1998. Eye movements in reading and information processing: 20 years of research.Psychological bulletin 124, 3 (1998), 372.",
      "doi": ""
    },
    {
      "text": "Keith Rayner. 2009. The 35th Sir Frederick Bartlett Lecture: Eye movements and attention in reading, scene perception, and visual search. Quarterly journal of experimental psychology 62, 8(2009), 1457–1506.",
      "doi": ""
    },
    {
      "text": "Keith Rayner, Alexander Pollatsek, Jane Ashby, and Charles Clifton Jr. 2012. Psychology of reading. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Keith Rayner, Timothy J Slattery, and Nathalie N Bélanger. 2010. Eye movements, the perceptual span, and reading speed. Psychonomic bulletin & review 17, 6 (2010), 834–839.",
      "doi": ""
    },
    {
      "text": "Erik D Reichle, Keith Rayner, and Alexander Pollatsek. 2003. The EZ Reader model of eye-movement control in reading: Comparisons to other models. Behavioral and brain sciences 26, 4 (2003), 445–476.",
      "doi": ""
    },
    {
      "text": "Laura Renninger and Anna Ma-Wyatt. 2011. Recalibration of eye and hand reference frames in age-related macular degeneration. Journal of Vision 11, 11 (2011), 954–954.",
      "doi": ""
    },
    {
      "text": "David A Robinson. 1963. A method of measuring eye movemnent using a scieral search coil in a magnetic field. IEEE Transactions on bio-medical electronics 10, 4(1963), 137–145.",
      "doi": ""
    },
    {
      "text": "Gary S Rubin and Mary Feely. 2009. The role of eye movements during reading in patients with age-related macular degeneration (AMD). Neuro-Ophthalmology 33, 3 (2009), 120–126.",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2021. The coding manual for qualitative researchers. The coding manual for qualitative researchers (2021), 1–440.",
      "doi": ""
    },
    {
      "text": "Dario D Salvucci and Joseph H Goldberg. 2000. Identifying fixations and saccades in eye-tracking protocols. In Proceedings of the 2000 symposium on Eye tracking research & applications. 71–78.",
      "doi": "10.1145/355017.355028"
    },
    {
      "text": "Natela M Shanidze and Anca Velisar. 2020. Eye, head, and gaze contributions to smooth pursuit in macular degeneration. Journal of Neurophysiology 124, 1 (2020), 134–144.",
      "doi": ""
    },
    {
      "text": "HJ Simonsz and LJ Bour. 1991. Covering one eye in fixation-disparity measurement causes slight movement of fellow eye. Documenta Ophthalmologica 78, 3 (1991), 141–152.",
      "doi": ""
    },
    {
      "text": "Meta Open Source. 2022. React - A JavaScript library for building user interfaces. Available online at: https://reactjs.org, last accessed on 9/7/2022.",
      "doi": ""
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How people with low vision access computing devices: Understanding challenges and opportunities. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. 171–180.",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Preeti Verghese, Cécile Vullings, and Natela Shanidze. 2021. Eye Movements in Macular Degeneration. Annual Review of Vision Science 7 (2021), 773–791.",
      "doi": ""
    },
    {
      "text": "Joan N Vickers. 2009. Advances in coupling perception and action: the quiet eye as a bidirectional link between gaze, attention, and action. Progress in brain research 174 (2009), 279–288.",
      "doi": ""
    },
    {
      "text": "W3C. 2022. Web Content Accessibility Guidelines (WCAG) 2.1. Available online at: https://www.w3.org/TR/WCAG21/#text-spacing, last accessed on 9/7/2022.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle, and James J Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI conference on human factors in computing systems. 143–146.",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Daniela Zambarbieri and Elena Carniglia. 2012. Eye movement analysis of reading from computer displays, eReaders and printed books. Ophthalmic and Physiological Optics 32, 5 (2012), 390–396.",
      "doi": ""
    },
    {
      "text": "Xucong Zhang, Seonwook Park, and Anna Maria Feit. 2021. Eye Gaze Estimation and Its Applications. In Artificial Intelligence for Human Computer Interaction: A Modern Approach. Springer, 99–130.",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Michele Hu, Shafeka Hashash, and Shiri Azenkot. 2017. Understanding low vision people’s visual perception on commercial augmented reality glasses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4170–4181.",
      "doi": "10.1145/3025453.3025949"
    },
    {
      "text": "Yuhang Zhao, Sarit Szpiro, and Shiri Azenkot. 2015. Foresee: A customizable head-mounted vision enhancement system for people with low vision. In Proceedings of the 17th international ACM SIGACCESS conference on computers & accessibility. 239–249.",
      "doi": "10.1145/2700648.2809865"
    },
    {
      "text": "Zhiwei Zhu and Qiang Ji. 2007. Novel eye gaze tracking techniques under natural head movement. IEEE Transactions on biomedical engineering 54, 12 (2007), 2246–2260.",
      "doi": ""
    }
  ]
}