{
  "doi": "10.1145/3544548.3581408",
  "title": "AutomataStage: an AR-mediated Creativity Support Tool for Hands-on Multidisciplinary Learning",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "The creativity support tools can enhance the hands-on multidisciplinary learning experience by drawing interest in the process of creating the outcome. We present AutomataStage, an AR-mediated creativity support tool for hands-on multidisciplinary learning. AutomataStage utilizes a video see-through interface to support the creation of Interactive Automata. The combination of building blocks and low-cost materials increases the expressiveness. The generative design method and one-to-one guide support the idea development process. It also provides a hardware see-through feature with which inside parts and circuits can be seen and an operational see-through feature that shows the operation in real-time. The visual programming method with a state transition diagram supports the iterative process during the creation process. A user study shows that AutomataStage enabled the students to create diverse Interactive Automata within 40-minute sessions. By creating Interactive Automata, the participants could learn the basic concepts of components. See-through features allowed active exploration with interest while integrating the components. We discuss the implications of hands-on tools with interactive and kinetic content beyond multidisciplinary learning.",
  "authors": [
    {
      "name": "Yunwoo Jeong",
      "institution": "Department of Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659079011",
      "orcid": "0000-0002-2000-1524"
    },
    {
      "name": "Hyungjun Cho",
      "institution": "Department of Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659760332",
      "orcid": "0000-0001-9666-8387"
    },
    {
      "name": "Taewan Kim",
      "institution": "Department of Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233660",
      "orcid": "0000-0002-5474-3438"
    },
    {
      "name": "Tek-Jin Nam",
      "institution": "Department of Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100320511",
      "orcid": "0000-0002-7942-0766"
    }
  ],
  "references": [
    {
      "text": "Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2017. Trigger-action-circuits: Leveraging generative design to enable novices to design and build circuitry. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 331–342.",
      "doi": "10.1145/3126594.3126637"
    },
    {
      "text": "Michelle Annett, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2015. MoveableMaker: facilitating the design, generation, and assembly of moveable papercraft. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 565–574.",
      "doi": "10.1145/2807442.2807483"
    },
    {
      "text": "Ayah Bdeir. 2009. Electronics as material: littleBits. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction. 397–400.",
      "doi": "10.1145/2148131.2148220"
    },
    {
      "text": "Tracey Booth, Simone Stumpf, Jon Bird, and Sara Jones. 2016. Crossed wires: Investigating the problems of end-user developers in a physical computing task. In Proceedings of the 2016 CHI conference on human factors in computing systems. 3485–3497.",
      "doi": "10.1145/2858036.2858533"
    },
    {
      "text": "James S Catterall and Kylie A Peppler. 2007. Learning in the visual arts and the worldviews of young children. Cambridge Journal of Education 37, 4 (2007), 543–560.",
      "doi": ""
    },
    {
      "text": "Duygu Ceylan, Wilmot Li, Niloy J Mitra, Maneesh Agrawala, and Mark Pauly. 2013. Designing and fabricating mechanical automata from mocap sequences. ACM Transactions on Graphics (TOG) 32, 6 (2013), 1–11.",
      "doi": "10.1145/2508363.2508400"
    },
    {
      "text": "Fiona Collins. 1999. The use of traditional storytelling in education to the learning of literacy skills. Early Child Development and Care 152, 1 (1999), 77–108.",
      "doi": ""
    },
    {
      "text": "Andy Connor, Sangeeta Karmokar, and Chris Whittington. 2015. From STEM to STEAM: Strategies for enhancing engineering & technology education. (2015).",
      "doi": ""
    },
    {
      "text": "Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational design of mechanical characters. ACM Transactions on Graphics (TOG) 32, 4 (2013), 1–12.",
      "doi": "10.1145/2461912.2461953"
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2012. Tangible 3D tabletops: combining tangible tabletop interaction and 3D projection. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. 109–118.",
      "doi": "10.1145/2399016.2399033"
    },
    {
      "text": "Mary Dell’Erba. 2019. Preparing Students for Learning, Work and Life through STEAM Education. Policy Brief.Education Commission of the States(2019).",
      "doi": ""
    },
    {
      "text": "John Dewey. 1986. Experience and education. In The educational forum, Vol. 50. Taylor & Francis, 241–252.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, David Carr, Emily Lovell, and Hiroshi Ishii. 2010. CopyCAD: remixing physical objects with copy and paste from the real world. In Adjunct proceedings of the 23nd annual ACM symposium on User interface software and technology. 381–382.",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. Shapeclip: towards rapid prototyping with shape-changing displays for designers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 19–28.",
      "doi": "10.1145/2702123.2702599"
    },
    {
      "text": "Michael S Horn and Robert JK Jacob. 2007. Designing tangible programming languages for classroom use. In Proceedings of the 1st international conference on Tangible and embedded interaction. 159–162.",
      "doi": "10.1145/1226969.1227003"
    },
    {
      "text": "Yunwoo Jeong, Han-Jong Kim, Hyungjun Cho, and Tek-Jin Nam. 2020. M. Integrator: a maker’s tool for integrating kinetic mechanisms and sensors. International Journal on Interactive Design and Manufacturing (IJIDeM) 14, 1(2020), 271–283.",
      "doi": ""
    },
    {
      "text": "Yunwoo Jeong, Han-Jong Kim, and Tek-Jin Nam. 2018. Mechanism perfboard: An augmented reality environment for linkage mechanism design and fabrication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3173574.3173985"
    },
    {
      "text": "Yunwoo Jeong, Han-Jong Kim, Gyeongwon Yun, and Tek-Jin Nam. 2020. WIKA: A projected augmented reality workbench for interactive kinetic art. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 999–1009.",
      "doi": "10.1145/3379337.3415880"
    },
    {
      "text": "Joanna Jesionkowska, Fridolin Wild, and Yann Deval. 2020. Active learning augmented reality for STEAM education—A case study. Education Sciences 10, 8 (2020), 198.",
      "doi": ""
    },
    {
      "text": "Seokbin Kang, Leyla Norooz, Elizabeth Bonsignore, Virginia Byrne, Tamara Clegg, and Jon E Froehlich. 2019. PrototypAR: Prototyping and Simulating Complex Systems with Paper Craft and Augmented Reality. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. 253–266.",
      "doi": "10.1145/3311927.3323135"
    },
    {
      "text": "Seokbin Kang, Ekta Shokeen, Virginia L Byrne, Leyla Norooz, Elizabeth Bonsignore, Caro Williams-Pierce, and Jon E Froehlich. 2020. ARMath: augmenting everyday life with math learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376252"
    },
    {
      "text": "Majeed Kazemitabaar, Jason McPeak, Alexander Jiao, Liang He, Thomas Outing, and Jon E Froehlich. 2017. Makerwear: A tangible approach to interactive wearable creation for children. In Proceedings of the 2017 chi conference on human factors in computing systems. 133–145.",
      "doi": "10.1145/3025453.3025887"
    },
    {
      "text": "Han-Jong Kim, Yunwoo Jeong, Ju-Whan Kim, and Tek-Jin Nam. 2018. A prototyping tool for kinetic mechanism design and fabrication: Developing and deploying M. Sketch for science, technology, engineering, the arts, and mathematics education. Advances in Mechanical Engineering 10, 12 (2018), 1687814018804104.",
      "doi": ""
    },
    {
      "text": "Han-Jong Kim, Ju-Whan Kim, and Tek-Jin Nam. 2016. Ministudio: Designers’ tool for prototyping ubicomp space with interactive miniature. In Proceedings of the 2016 CHI Conference on human factors in computing systems. 213–224.",
      "doi": "10.1145/2858036.2858180"
    },
    {
      "text": "Yoonji Kim, Youngkyung Choi, Hyein Lee, Geehyuk Lee, and Andrea Bianchi. 2019. VirtualComponent: a mixed-reality tool for designing and tuning breadboarded circuits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300407"
    },
    {
      "text": "David A Kolb. 1984. The process of experiential learning. Experiential learning: Experience as the source of learning and development (1984), 20–38.",
      "doi": ""
    },
    {
      "text": "Varsha Koushik, Darren Guinness, and Shaun K Kane. 2019. Storyblocks: A tangible programming game to create accessible audio stories. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300722"
    },
    {
      "text": "KK Lamberty, Audrey Le Meur, Paul Friederichsen, and Joseph Moonan Walbran. 2021. Pandemic Pivot: Designing a Participatory Simulation to Support Social Distancing and Remote Learning. In Interaction Design and Children. 577–582.",
      "doi": ""
    },
    {
      "text": "Nicola Leonardi, Marco Manca, Fabio Paternò, and Carmen Santoro. 2019. Trigger-action programming for personalising humanoid robot behaviour. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300675"
    },
    {
      "text": "Jiahao Li, Jeeeun Kim, and Xiang’Anthony’ Chen. 2019. Robiot: A design tool for actuating everyday objects with automatically generated 3D printable mechanisms. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 673–685.",
      "doi": "10.1145/3332165.3347894"
    },
    {
      "text": "Joanne Lo, Cesar Torres, Isabel Yang, Jasper O’Leary, Danny Kaufman, Wilmot Li, Mira Dontcheva, and Eric Paulos. 2016. Aesthetic electronics: Designing, sketching, and fabricating circuits through digital exploration. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 665–676.",
      "doi": "10.1145/2984511.2984579"
    },
    {
      "text": "Vittorio Megaro, Bernhard Thomaszewski, Damien Gauge, Eitan Grinspun, Stelian Coros, and Markus H Gross. 2014. ChaCra: An Interactive Design System for Rapid Character Crafting.. In Symposium on Computer Animation. 123–130.",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Udayan Umapathi, Daniel Leithinger, and Hiroshi Ishii. 2017. AnimaStage: hands-on animated craft on pin-based shape displays. In Proceedings of the 2017 Conference on Designing Interactive Systems. 1093–1097.",
      "doi": "10.1145/3064663.3064670"
    },
    {
      "text": "Hyunjoo Oh, Sherry Hsi, Michael Eisenberg, and Mark D Gross. 2018. Paper mechatronics: present and future. In Proceedings of the 17th ACM Conference on Interaction Design and Children. 389–395.",
      "doi": "10.1145/3202185.3202761"
    },
    {
      "text": "Hyunjoo Oh, Jeeeun Kim, Cory Morales, Mark Gross, Michael Eisenberg, and Sherry Hsi. 2017. FoldMecha: Exploratory design and engineering of mechanical papercraft. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction. 131–139.",
      "doi": "10.1145/3024969.3024991"
    },
    {
      "text": "Eun Young Park. 2016. LINKKI: A planar linkage-based kinetic toy as a tool for education and design. In Proceedings of the 6th Annual Conference on Creativity and Fabrication in Education. 86–89.",
      "doi": "10.1145/3003397.3003411"
    },
    {
      "text": "Louise Phillips. 1999. The Role of Storytelling in Early Literacy Development.(1999).",
      "doi": ""
    },
    {
      "text": "Hayes Solos Raffle, Amanda J Parkes, and Hiroshi Ishii. 2004. Topobo: a constructive assembly system with kinetic memory. In Proceedings of the SIGCHI conference on Human factors in computing systems. 647–654.",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: an integrated approach for embedding electronics in paper designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2457–2466.",
      "doi": ""
    },
    {
      "text": "Matt Ratto. 2011. Critical making: Conceptual and material studies in technology and social life. The information society 27, 4 (2011), 252–260.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, 2009. Scratch: programming for all. Commun. ACM 52, 11 (2009), 60–67.",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Ben Shneiderman, Gerhard Fischer, Mary Czerwinski, Mitch Resnick, Brad Myers, Linda Candy, Ernest Edmonds, Mike Eisenberg, Elisa Giaccardi, Tom Hewett, 2006. Creativity support tools: Report from a US National Science Foundation sponsored workshop. International Journal of Human-Computer Interaction 20, 2(2006), 61–77.",
      "doi": ""
    },
    {
      "text": "Daniel Tetteroo, Iris Soute, and Panos Markopoulos. 2013. Five key challenges in end-user development for tangible and embodied interaction. In Proceedings of the 15th ACM on International conference on multimodal interaction. 247–254.",
      "doi": "10.1145/2522848.2522887"
    },
    {
      "text": "Bernhard Thomaszewski, Stelian Coros, Damien Gauge, Vittorio Megaro, Eitan Grinspun, and Markus Gross. 2014. Computational design of linkage-based characters. ACM Transactions on Graphics (TOG) 33, 4 (2014), 1–9.",
      "doi": "10.1145/2601097.2601143"
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. 1999. Urp: a luminous-tangible workbench for urban planning and design. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 386–393.",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Ana Villanueva, Zhengzhe Zhu, Ziyi Liu, Kylie Peppler, Thomas Redick, and Karthik Ramani. 2020. Meta-AR-app: an authoring platform for collaborative augmented reality in STEM classrooms. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3313831.3376146"
    },
    {
      "text": "Ana M Villanueva, Ziyi Liu, Zhengzhe Zhu, Xin Du, Joey Huang, Kylie A Peppler, and Karthik Ramani. 2021. Robotar: An augmented reality compatible teleconsulting robotics toolkit for augmented makerspace experiences. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445726"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W Gellersen. 2014. MixFab: a mixed-reality environment for personal fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3855–3864.",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Xinhao Xu and Fengfeng Ke. 2016. Designing a virtual-reality-based, gamelike math learning environment. American Journal of Distance Education 30, 1 (2016), 27–38.",
      "doi": ""
    },
    {
      "text": "Iddo Yehoshua Wald and Oren Zuckerman. 2021. Magnetform: a Shape-change Display Toolkit for Material-oriented Designers. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–14.",
      "doi": "10.1145/3430524.3446066"
    },
    {
      "text": "Chao Zhang, Cheng Yao, Jiayi Wu, Weijia Lin, Lijuan Liu, Ge Yan, and Fangtian Ying. 2022. StoryDrawer: A Child–AI Collaborative Drawing System to Support Children’s Creative Visual Storytelling. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    },
    {
      "text": "Yunbo Zhang, Wei Gao, Luis Paredes, and Karthik Ramani. 2016. Cardboardizer: Creatively customize, articulate and fold 3d mesh models. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 897–907.",
      "doi": "10.1145/2858036.2858362"
    },
    {
      "text": "Lifeng Zhu, Weiwei Xu, John Snyder, Yang Liu, Guoping Wang, and Baining Guo. 2012. Motion-guided mechanical toy modeling. ACM Transactions on Graphics (TOG) 31, 6 (2012), 1–10.",
      "doi": "10.1145/2366145.2366146"
    }
  ]
}