{
  "doi": "10.1145/3544548.3581466",
  "title": "NFTDisk: Visual Detection of Wash Trading in NFT Markets",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "With the growing popularity of Non-Fungible Tokens (NFT), a new type of digital assets, various fraudulent activities have appeared in NFT markets. Among them, wash trading has become one of the most common frauds in NFT markets, which attempts to mislead investors by creating fake trading volumes. Due to the sophisticated patterns of wash trading, only a subset of them can be detected by automatic algorithms, and manual inspection is usually required. We propose NFTDisk, a novel visualization for investors to identify wash trading activities in NFT markets, where two linked visualization modules are presented: a radial visualization module with a disk metaphor to overview NFT transactions and a flow-based visualization module to reveal detailed NFT flows at multiple levels. We conduct two case studies and an in-depth user interview with 14 NFT investors to evaluate NFTDisk. The results demonstrate its effectiveness in exploring wash trading activities in NFT markets.",
  "authors": [
    {
      "name": "Xiaolin Wen",
      "institution": "Sichuan University, China and School of Computing and Information Systems, Singapore Management University, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782522",
      "orcid": "0000-0002-8562-7640"
    },
    {
      "name": "Yong Wang",
      "institution": "School of Computing and Information Systems, Singapore Management University, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702112",
      "orcid": "0000-0002-0092-0793"
    },
    {
      "name": "Xuanwu Yue",
      "institution": "Baiont Technology, China and Sinovation Ventures AI Institute, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659829923",
      "orcid": "0000-0002-9714-6545"
    },
    {
      "name": "Feida Zhu",
      "institution": "Singapore Management University, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81313483490",
      "orcid": "0000-0001-6077-4356"
    },
    {
      "name": "Min Zhu",
      "institution": "College of Computer Science, Sichuan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442612444",
      "orcid": "0000-0002-5664-1558"
    }
  ],
  "references": [
    {
      "text": "Mansoor Ahmed, Ilia Shumailov, and Ross Anderson. 2018. Tendrils of Crime: Visualizing the Diffusion of Stolen Bitcoins. In Proceedings of International Workshop on Graphical Models for Security. Springer, 1–12.",
      "doi": ""
    },
    {
      "text": "Lennart Ante. 2022. Non-fungible Token (NFT) Markets on the Ethereum Blockchain: Temporal Development, Cointegration and Interrelations. Economics of Innovation and New Technology(2022), 1–19.",
      "doi": ""
    },
    {
      "text": "Hong Bao and David Roubaud. 2022. baoNon-Fungible Token: A Systematic Review and Research Agenda. Journal of Risk and Financial Management 15, 5 (2022), 215.",
      "doi": ""
    },
    {
      "text": "Ziv Bar-Joseph, David K Gifford, and Tommi S Jaakkola. 2001. Fast Optimal Leaf Ordering for Hierarchical Clustering. Bioinformatics 17, suppl_1 (2001), S22–S29.",
      "doi": ""
    },
    {
      "text": "Stefano Bistarelli and Francesco Santini. 2017. Go with the-Bitcoin-Flow, with Visual Analytics. In Proceedings of the 12th International Conference on Availability, Reliability and Security. Association for Computing Machinery, 1–6.",
      "doi": "10.1145/3098954.3098972"
    },
    {
      "text": "Andreas Bogner. 2017. Seeing is Understanding: Anomaly Detection in Blockchains with Visualized Features. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. 5–8.",
      "doi": "10.1145/3123024.3123157"
    },
    {
      "text": "Yi Cao, Yuhua Li, Sonya Coleman, Ammar Belatreche, and Thomas Martin McGinnity. 2015. Detecting Wash Trade in Financial Market Using Digraphs and Dynamic Programming. IEEE Transactions on Neural Networks and Learning Systems 27, 11(2015), 2351–2363.",
      "doi": ""
    },
    {
      "text": "Sudarshan Chawathe. 2018. Monitoring Blockchains with Self-organizing Maps. In Proceedings of 2018 17th IEEE International Conference on Trust, Security and Privacy in Computing and Communications/12th IEEE International Conference on Big Data Science and Engineering (TrustCom/BigDataSE). IEEE, 1870–1875.",
      "doi": ""
    },
    {
      "text": "Jialan Chen, Dan Lin, and Jiajing Wu. 2022. Do Cryptocurrency Exchanges Fake Trading Volumes? An Empirical Analysis of Wash Trading based on Data Mining. Physica A: Statistical Mechanics and its Applications 586 (2022), 126405.",
      "doi": ""
    },
    {
      "text": "Pietro Manganelli Conforti, Matteo Emanuele, Pietro Nardelli, Giuseppe Santucci, and Marco Angelini. 2022. CryptoComparator: A Visual Analytics Environment for Cryptocurrencies Analysis. In Proceedings of EuroVis Workshop on Visual Analytics (EuroVA). The Eurographics Association, 43–475.",
      "doi": ""
    },
    {
      "text": "Lin William Cong, Xi Li, Ke Tang, and Yang Yang. 2021. Crypto Wash Trading. arXiv preprint arXiv:2108.10984(2021).",
      "doi": ""
    },
    {
      "text": "Lin William Cong, Xi Li, Ke Tang, and Yang Yang. 2022. Detecting and Quantifying Crypto Wash Trading. In Proceedings of 3rd International Conference on Blockchain Economics, Security and Protocols (Tokenomics 2021). Schloss Dagstuhl – Leibniz-Zentrum für Informatik, 10:1–10:6.",
      "doi": ""
    },
    {
      "text": "Dipanjan Das, Priyanka Bose, Nicola Ruaro, Christopher Kruegel, and Giovanni Vigna. 2021. Understanding Security Issues in the NFT Ecosystem. arXiv preprint arXiv:2111.08893(2021).",
      "doi": ""
    },
    {
      "text": "Giuseppe Di Battista, Valentino Di Donato, Maurizio Patrignani, Maurizio Pizzonia, Vincenzo Roselli, and Roberto Tamassia. 2015. Bitconeview: Visualization of Flows in the Bitcoin Transaction Graph. In Proceedings of 2015 IEEE Symposium on Visualization for Cyber Security (VizSec). IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Michael Dowling. 2022. Is Non-fungible Token Pricing Driven by Cryptocurrencies?Finance Research Letters 44 (2022), 102097.",
      "doi": ""
    },
    {
      "text": "Felix Eigelshoven, Andre Ullrich, and Douglas A Parry. 2021. Cryptocurrency Market Manipulation: A Systematic Literature Review. In Proceedings of International Conference on Information Systems.",
      "doi": ""
    },
    {
      "text": "Jean-Daniel Fekete. 2015. Reorder.js: A Javascript Library to Reorder Tables and Networks. In Proceedings of IEEE VIS 2015.",
      "doi": ""
    },
    {
      "text": "Peter Fratrič, Giovanni Sileno, Sander Klous, and Tom van Engers. 2022. Manipulation of the Bitcoin Market: an Agent-based Study. Financial Innovation 8, 1 (2022), 1–29.",
      "doi": ""
    },
    {
      "text": "Petra Isenberg, Christoph Kinkeldey, and Jean-Daniel Fekete. 2017. Exploring Entity Behavior on the Bitcoin Blockchain. In Proceedings of IEEE Conference on Visualization (VIS). 1–2.",
      "doi": ""
    },
    {
      "text": "Aleksandra Jordanoska. 2021. The Exciting World of NFTs: a Consideration of Regulatory and Financial Crime Risks. Butterworths Journal of International Banking and Financial Law 10 (2021), 716.",
      "doi": ""
    },
    {
      "text": "Michael Jünger, Gerhard Reinelt, and Giovanni Rinaldi. 1995. The Traveling Salesman Problem. Handbooks in Operations Research and Management Science 7 (1995), 225–330.",
      "doi": ""
    },
    {
      "text": "Franziska B Keller, David Schoch, Sebastian Stier, and JungHwan Yang. 2020. Political Astroturfing on Twitter: How to Coordinate a Disinformation Campaign. Political Communication 37, 2 (2020), 256–280.",
      "doi": ""
    },
    {
      "text": "Christoph Kinkeldey, Jean-Daniel Fekete, and Petra Isenberg. 2017. Bitconduite: Visualizing and Analyzing Activity on the Bitcoin Network. In Proceedings of EuroVis 2017 Eurographics Conference on Visualization, Posters Track. 3.",
      "doi": ""
    },
    {
      "text": "Massimo La Morgia, Alessandro Mei, Francesco Sassi, and Julinda Stefa. 2020. Pump and Dumps in the Bitcoin Era: Real Time Detection of Cryptocurrency Market Manipulations. In Proceedings of 2020 29th International Conference on Computer Communications and Networks (ICCCN). IEEE, 1–9.",
      "doi": ""
    },
    {
      "text": "James R Lewis. 1992. Psychometric Evaluation of the Post-study System Usability Questionnaire: The PSSUQ. In Proceedings of the human factors society annual meeting, Vol. 36. Sage Publications Sage CA: Los Angeles, CA, 1259–1260.",
      "doi": ""
    },
    {
      "text": "Claudio DG Linhares, Bruno AN Travençolo, Jose Gustavo S Paiva, and Luis EC Rocha. 2017. DyNetVis: A System for Visualization of Dynamic Networks. In Proceedings of the Symposium on Applied Computing. Association for Computing Machinery, 187–194.",
      "doi": "10.1145/3019612.3019686"
    },
    {
      "text": "Dan McGinn, David Birch, David Akroyd, Miguel Molina-Solana, Yike Guo, and William J Knottenbelt. 2016. Visualizing Dynamic Bitcoin Transaction Patterns. Big Data 4, 2 (2016), 109–119.",
      "doi": ""
    },
    {
      "text": "Robert Norvill, Beltran Borja Fiz Pontiveros, Radu State, and Andrea Cullen. 2018. Visual Emulation for Ethereum’s Virtual Machine. In Proceedings of NOMS 2018-2018 IEEE/IFIP Network Operations and Management Symposium. IEEE, 1–4.",
      "doi": "10.1109/NOMS.2018.8406332"
    },
    {
      "text": "Patrick Ocheja, Brendan Flanagan, Hiroaki Ogata, and Solomon Sunday Oyelere. 2022. Visualization of Education Blockchain Data: Trends and Challenges. Interactive Learning Environments(2022), 1–25.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2003. The Eyes have It: A Task by Data Type Taxonomy for Information Visualizations. In the Craft of Information Visualization. Elsevier, 364–371.",
      "doi": ""
    },
    {
      "text": "Jinha Song, Jongho Nang, and Juwook Jang. 2018. Design of Anomaly Detection and Visualization Tool for IOT Blockchain. In Proceedings of 2018 International Conference on Computational Science and Computational Intelligence (CSCI). IEEE, 1464–1465.",
      "doi": ""
    },
    {
      "text": "Dong Sun, Zezheng Feng, Yuanzhe Chen, Yong Wang, Jia Zeng, Mingxuan Yuan, Ting-Chuen Pong, and Huamin Qu. 2020. DFSeer: A visual Analytics Approach to Facilitate Model Selection for Demand Forecasting. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376866"
    },
    {
      "text": "Yujing Sun, Hao Xiong, Siu Ming Yiu, and Kwok Yan Lam. 2019. Bitvis: An Interactive Visualization System for Bitcoin Accounts Analysis. In Proceedings of 2019 Crypto Valley Conference on Blockchain Technology (CVCBT). IEEE, 21–25.",
      "doi": ""
    },
    {
      "text": "Yujing Sun, Hao Xiong, Siu Ming Yiu, and Kwok Yan Lam. 2022. BitAnalysis: A Visualization System for Bitcoin Wallet Investigation. IEEE Transactions on Big Data(2022), 1–16.",
      "doi": ""
    },
    {
      "text": "Tri Sundara, Ideva Gaputra, and Siska Aulia. 2017. Study on Blockchain Visualization. International Journal on Informatics Visualization (JOIV) 1, 3(2017), 76–82.",
      "doi": ""
    },
    {
      "text": "Syed Ahzam Tariq and Imtiaz Sifat. 2022. Suspicious Trading in Nonfungible Tokens (Nfts): Evidence from Wash Trading. Available at SSRN 4097642(2022).",
      "doi": ""
    },
    {
      "text": "Natkamon Tovanich, Nicolas Heulot, Jean-Daniel Fekete, and Petra Isenberg. 2019. Visualization of Blockchain Data: A Systematic Review. IEEE Transactions on Visualization and Computer Graphics 27, 7(2019), 3135–3152.",
      "doi": "10.1109/TVCG.2019.2963018"
    },
    {
      "text": "Natkamon Tovanich, Nicolas Soulié, Nicolas Heulot, and Petra Isenberg. 2021. MiningVis: Visual Analytics of the Bitcoin Mining Economy. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 868–878.",
      "doi": "10.1109/TVCG.2021.3114821"
    },
    {
      "text": "Stef van den Elzen, Danny Holten, Jorik Blaas, and Jarke J van Wijk. 2013. Dynamic Network Visualization Withextended Massive Sequence Views. IEEE Transactions on Visualization and Computer Graphics 20, 8(2013), 1087–1099.",
      "doi": "10.1109/TVCG.2013.263"
    },
    {
      "text": "Friedhelm Victor and Andrea Marie Weintraud. 2021. Detecting and Quantifying Wash Trading on Decentralized Cryptocurrency Exchanges. In Proceedings of the Web Conference 2021. Association for Computing Machinery, 23–32.",
      "doi": "10.1145/3442381.3449824"
    },
    {
      "text": "Victor von Wachter, Johannes Rude Jensen, Ferdinand Regner, and Omri Ross. 2022. NFT Wash Trading: Quantifying Suspicious Behaviour in NFT Markets. arXiv preprint arXiv:2202.03866(2022).",
      "doi": ""
    },
    {
      "text": "Qin Wang, Rujia Li, Qi Wang, and Shiping Chen. 2021. Non-fungible Token (NFT): Overview, Evaluation, Opportunities and Challenges. arXiv preprint arXiv:2105.07447(2021).",
      "doi": ""
    },
    {
      "text": "Gavin Wood 2014. Ethereum: A Secure Decentralised Generalised Transaction Ledger. Ethereum Project Yellow Paper 151, 2014 (2014), 1–32.",
      "doi": ""
    },
    {
      "text": "Jia-zhi Xia, Yu-hong Zhang, Hui Ye, Ying Wang, Guang Jiang, Ying Zhao, Cong Xie, Xiao-yan Kui, Sheng-hui Liao, and Wei-ping Wang. 2020. SuPoolVisor: A visual Analytics System for Mining Pool Surveillance. Frontiers of Information Technology & Electronic Engineering 21, 4(2020), 507–523.",
      "doi": ""
    },
    {
      "text": "Laixin Xie, Ziming Wu, Peng Xu, Wei Li, Xiaojuan Ma, and Quan Li. 2022. RoleSeer: Understanding Informal Social Role Changes in MMORPGs via Visual Analytics. In Proceedings of CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3491102.3517712"
    },
    {
      "text": "Xuanwu Yue, Xinhuan Shu, Xinyu Zhu, Xinnan Du, Zheqing Yu, Dimitrios Papadopoulos, and Siyuan Liu. 2018. Bitextract: Interactive Visualization for Extracting Bitcoin Exchange Intelligence. IEEE Transactions on Visualization and Computer Graphics 25, 1(2018), 162–171.",
      "doi": "10.1109/TVCG.2018.2864814"
    },
    {
      "text": "Jerry Zhang, Darrell Carpenter, and Myung Ko. 2013. Online astroturfing: A theoretical perspective. (2013).",
      "doi": ""
    },
    {
      "text": "Zengsheng Zhong, Shuirun Wei, Yeting Xu, Ying Zhao, Fangfang Zhou, Feng Luo, and Ronghua Shi. 2020. SilkViser: A visual Explorer of Blockchain-based Cryptocurrency Transaction Data. In Proceedings of 2020 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, 95–106.",
      "doi": ""
    }
  ]
}