{
  "doi": "10.1145/3544548.3581441",
  "title": "Personalized Quest and Dialogue Generation in Role-Playing Games: A Knowledge Graph- and Language Model-based Approach",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [],
  "abstract": "Procedural content generation (PCG) in video games offers unprecedented opportunities for customization and user engagement. Working within the specialized context of role-playing games (RPGs), we introduce a novel framework for quest and dialogue generation that places the player at the core of the generative process. Drawing on a hand-crafted knowledge base, our method grounds generated content with in-game context while simultaneously employing a large-scale language model to create fluent, unique, accompanying dialogue. Through human evaluation, we confirm that quests generated using this method can approach the performance of hand-crafted quests in terms of fluency, coherence, novelty, and creativity; demonstrate the enhancement to the player experience provided by greater dynamism; and provide a novel, automated metric for the relevance between quest and dialogue. We view our contribution as a critical step toward dynamic, co-creative narrative frameworks in which humans and AI systems jointly collaborate to create unique and user-specific playable experiences.",
  "authors": [
    {
      "name": "Trevor Ashby",
      "institution": "Brigham Young University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783330",
      "orcid": "0000-0001-8712-5233"
    },
    {
      "name": "Braden K Webb",
      "institution": "Department of Computer Science, Brigham Young University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782913",
      "orcid": "0000-0001-5194-7008"
    },
    {
      "name": "Gregory Knapp",
      "institution": "Brigham Young University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781035",
      "orcid": "0000-0002-0157-6509"
    },
    {
      "name": "Jackson Searle",
      "institution": "DRAGN Labs, Brigham Young University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778704",
      "orcid": "0000-0002-6721-2708"
    },
    {
      "name": "Nancy Fulda",
      "institution": "Department of Computer Science, Brigham Young University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443596956",
      "orcid": "0000-0001-9391-8301"
    }
  ],
  "references": [
    {
      "text": "Espen Aarseth. 2005. From Hunt the Wumpus to EverQuest: Introduction to Quest Theory. In Entertainment Computing - ICEC 2005(Lecture Notes in Computer Science), Fumio Kishino, Yoshifumi Kitamura, Hirokazu Kato, and Noriko Nagata (Eds.). Springer, Berlin, Heidelberg, 496–506. https://doi.org/10.1007/11558651_48",
      "doi": "10.1007/11558651_48"
    },
    {
      "text": "Alberto Alvarez, Steve Dahlskog, Jose Font, Johan Holmberg, Chelsi Nolasco, and Axel Österman. 2018. Fostering creativity in the mixed-initiative evolutionary dungeon designer. In Proceedings of the 13th International Conference on the Foundations of Digital Games(FDG ’18). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3235765.3235815",
      "doi": "10.1145/3235765.3235815"
    },
    {
      "text": "Alberto Alvarez, Eric Grevillius, Elin Olsson, and Jose Font. 2021. Questgram [Qg]: Toward a Mixed-Initiative Quest Generation Tool. In The 16th International Conference on the Foundations of Digital Games(FDG ’21). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3472538.3472544",
      "doi": "10.1145/3472538.3472544"
    },
    {
      "text": "Prithviraj Ammanabrolu, William Broniec, Alex Mueller, Jeremy Paul, and Mark Riedl. 2019. Toward Automated Quest Generation in Text-Adventure Games. In Proceedings of the 4th Workshop on Computational Creativity in Language Generation. Association for Computational Linguistics, Tokyo, Japan, 1–12. https://aclanthology.org/2019.ccnlg-1.1",
      "doi": ""
    },
    {
      "text": "Prithviraj Ammanabrolu and Mark O. Riedl. 2021. Learning Knowledge Graph-based World Models of Textual Environments. https://doi.org/10.48550/ARXIV.2106.09608",
      "doi": ""
    },
    {
      "text": "Alexander Baldwin, Steve Dahlskog, Jose M. Font, and Johan Holmberg. 2017. Towards pattern-based mixed-initiative dungeon generation. In Proceedings of the 12th International Conference on the Foundations of Digital Games(FDG ’17). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3102071.3110572",
      "doi": "10.1145/3102071.3110572"
    },
    {
      "text": "Sid Black, Leo Gao, Phil Wang, Connor Leahy, and Stella Biderman. 2021. GPT-Neo: Large Scale Autoregressive Language Modeling with Mesh-Tensorflow. EleutherAI. https://doi.org/10.5281/zenodo.5297715",
      "doi": ""
    },
    {
      "text": "Barbaros Bostan (Ed.). 2022. Games and Narrative: Theory and Practice (1 ed.). Springer Cham, Berlin, Germany. https://link.springer.com/book/10.1007/978-3-030-81538-7",
      "doi": ""
    },
    {
      "text": "Vincent Breault, Sébastien Ouellet, and Jim Davies. 2021. Let CONAN tell you a story: Procedural quest generation. Entertainment Computing 38 (May 2021), 100422. https://doi.org/10.1016/j.entcom.2021.100422",
      "doi": ""
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel Ziegler, Jeffrey Wu, Clemens Winter, Chris Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. In Advances in Neural Information Processing Systems, Vol. 33. Curran Associates, Inc., Vancouver, Canada, 1877–1901. https://proceedings.neurips.cc/paper/2020/hash/1457c0d6bfcb4967418bfb8ac142f64a-Abstract.html",
      "doi": ""
    },
    {
      "text": "Zachary Brown, Nathaniel Robinson, David Wingate, and Nancy Fulda. 2020. Towards Neural Programming Interfaces. In Advances in Neural Information Processing Systems, Vol. 33. Curran Associates, Inc., Vancouver, Canada, 17416–17428. https://proceedings.neurips.cc/paper/2020/hash/c9f06bc7b46d0247a91c8fc665c13d0e-Abstract.html",
      "doi": ""
    },
    {
      "text": "Ashmore Calvin and Nitsche Michael. 2007. The Quest in a Generated World. In DiGRA 3907 - Proceedings of the 2007 DiGRA International Conference: Situated Play. The University of Tokyo, Tokyo, Japan, 503–509. http://www.digra.org/wp-content/uploads/digital-library/07311.20228.pdf",
      "doi": ""
    },
    {
      "text": "Marc Cavazza and Fred Charles. 2005. Dialogue generation in character-based interactive storytelling. In Proceedings of the First AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment(AIIDE’05). AAAI Press, Marina del Rey, California, 21–26.",
      "doi": "10.5555/3022473.3022478"
    },
    {
      "text": "Xiaojun Chen, Shengbin Jia, and Yang Xiang. 2020. A review: Knowledge reasoning over knowledge graph. Expert Systems with Applications 141 (2020), 112948. https://doi.org/10.1016/j.eswa.2019.112948",
      "doi": "10.1016/j.eswa.2019.112948"
    },
    {
      "text": "Tom Cole and Marco Gillies. 2022. Emotional Exploration and the Eudaimonic Gameplay Experience: A Grounded Theory. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3491102.3502002",
      "doi": "10.1145/3491102.3502002"
    },
    {
      "text": "Kevin Dai. 2020. Multi-Context Dependent Natural Text Generation for More Robust NPC Dialogue. Ph. D. Dissertation. Harvard College. https://nrs.harvard.edu/URN-3:HUL.INSTREPOS:37364681",
      "doi": ""
    },
    {
      "text": "Richard Davies, Nathan Dewell, and Carlo Harvey. 2021. A framework for interactive, autonomous and semantic dialogue generation in games. In Proceedings of the 1st Games Technology Summit. 1st Games Technology Summit, Cologne, Germany, 16–28. https://opus.bibliothek.uni-wuerzburg.de/frontdoor/index/index/docId/24602",
      "doi": ""
    },
    {
      "text": "Jonathon Doran and Ian Parberry. 2010. Towards procedural quest generation: A structural analysis of RPG quests. Dept. Comput. Sci. Eng., Univ. North Texas, Tech. Rep. LARC-2010 2 (2010), 42 pages.",
      "doi": ""
    },
    {
      "text": "Jonathon Doran and Ian Parberry. 2011. A prototype quest generator based on a structural analysis of quests from four MMORPGs. In Proceedings of the 2nd International Workshop on Procedural Content Generation in Games(PCGames ’11). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/2000919.2000920",
      "doi": "10.1145/2000919.2000920"
    },
    {
      "text": "Joris Dormans and Sander Bakkes. 2011. Generating Missions and Spaces for Adaptable Play Experiences. IEEE Transactions on Computational Intelligence and AI in Games 3, 3 (Sept. 2011), 216–228. https://doi.org/10.1109/TCIAIG.2011.2149523",
      "doi": ""
    },
    {
      "text": "Blizzard Entertainment. 2004. World of Warcraft. Game [PC]. Blizzard Entertainment, Irvine, California, US.",
      "doi": ""
    },
    {
      "text": "Ken Hartsook, Alexander Zook, Sauvik Das, and Mark O. Riedl. 2011. Toward supporting stories with procedurally generated game worlds. In 2011 IEEE Conference on Computational Intelligence and Games (CIG’11). IEEE, Seoul, Korea (South), 297–304. https://doi.org/10.1109/CIG.2011.6032020",
      "doi": ""
    },
    {
      "text": "Mark Hendrikx, Sebastiaan Meijer, Joeri Van Der Velden, and Alexandru Iosup. 2013. Procedural content generation for games: A survey. ACM Transactions on Multimedia Computing, Communications, and Applications 9, 1 (Feb. 2013), 1:1–1:22. https://doi.org/10.1145/2422956.2422957",
      "doi": "10.1145/2422956.2422957"
    },
    {
      "text": "Matthew Honnibal and Ines Montani. 2017. spaCy 2: Natural language understanding with Bloom embeddings, convolutional neural networks and incremental parsing. (2017).",
      "doi": ""
    },
    {
      "text": "Jeff Howard. 2022. Quests: Design, theory, and history in games and narratives. CRC Press, Boca Raton, Florida.",
      "doi": ""
    },
    {
      "text": "Mika Hämäläinen and Khalid Alnajjar. 2019. Creative contextual dialog adaptation in an open world RPG. In Proceedings of the 14th International Conference on the Foundations of Digital Games(FDG ’19). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3337722.3341865",
      "doi": "10.1145/3337722.3341865"
    },
    {
      "text": "Jesper Juul. 2011. Half-real: Video games between real rules and fictional worlds. MIT press, Cambridge, Massachusetts.",
      "doi": "10.5555/1076823"
    },
    {
      "text": "A. Kalbiyev. 2022. Affective dialogue generation for video games. Master’s thesis. University of Twente. http://essay.utwente.nl/89325/",
      "doi": ""
    },
    {
      "text": "Christopher Kerr and Duane Szafron. 2009. Supporting Dialogue Generation for Story-Based Games. Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment 5, 1 (Oct. 2009), 154–160. https://ojs.aaai.org/index.php/AIIDE/article/view/12371",
      "doi": ""
    },
    {
      "text": "Max Kreminski, Melanie Dickinson, and Michael Mateas. 2021. Winnow: A Domain-Specific Language for Incremental Story Sifting. In Artificial Intelligence and Interactive Digital Entertainment Conference. AAAI, Palo Alto, California, 156–163. https://doi.org/10.1609/aiide.v17i1.18903",
      "doi": ""
    },
    {
      "text": "Max Kreminski, Melanie Dickinson, Michael Mateas, and Noah Wardrip-Fruin. 2020. Why Are We Like This?: The AI Architecture of a Co-Creative Storytelling Game. In Proceedings of the 15th International Conference on the Foundations of Digital Games(Bugibba, Malta) (FDG ’20). Association for Computing Machinery, New York, NY, USA, Article 13, 4 pages. https://doi.org/10.1145/3402942.3402953",
      "doi": "10.1145/3402942.3402953"
    },
    {
      "text": "K Yu Kristen, Nathan R Sturtevant, and Matthew Guzdial. 2020. What is a Quest?. In AIIDE Workshops. AIIDE, Worcester, MA, 8.",
      "doi": ""
    },
    {
      "text": "Young-Seol Lee and Sung-Bae Cho. 2012. Dynamic quest plot generation using Petri net planning. In Proceedings of the Workshop at SIGGRAPH Asia(WASA ’12). Association for Computing Machinery, New York, NY, USA, 47–52. https://doi.org/10.1145/2425296.2425304",
      "doi": "10.1145/2425296.2425304"
    },
    {
      "text": "Jonathan Lessard, Etienne Brunelle-Leclerc, Timothy Gottschalk, Marc-Antoine Jetté-Léger, Odile Prouveur, and Christopher Tan. 2017. Striving for author-friendly procedural dialogue generation. In Proceedings of the 12th International Conference on the Foundations of Digital Games(FDG ’17). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3102071.3116219",
      "doi": "10.1145/3102071.3116219"
    },
    {
      "text": "Boyang Li and Mark Riedl. 2010. An Offline Planning Approach to Game Plotline Adaptation. Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment 6, 1 (Oct. 2010), 45–50. https://ojs.aaai.org/index.php/AIIDE/article/view/12394",
      "doi": ""
    },
    {
      "text": "Junyi Li, Tianyi Tang, Wayne Xin Zhao, and Ji-Rong Wen. 2021. Pretrained Language Models for Text Generation: A Survey. https://doi.org/10.48550/arXiv.2105.10311",
      "doi": ""
    },
    {
      "text": "Paul Pu Liang, Chiyu Wu, Louis-Philippe Morency, and Ruslan Salakhutdinov. 2021. Towards Understanding and Mitigating Social Biases in Language Models. https://doi.org/10.48550/ARXIV.2106.13219",
      "doi": ""
    },
    {
      "text": "Lara Jean Martin. 2021. Neurosymbolic automated story generation. Ph. D. Dissertation. Georgia Institute of Technology. https://smartech.gatech.edu/handle/1853/64643",
      "doi": ""
    },
    {
      "text": "Moin Nadeem, Anna Bethke, and Siva Reddy. 2020. StereoSet: Measuring stereotypical bias in pretrained language models. https://doi.org/10.48550/arXiv.2004.09456",
      "doi": ""
    },
    {
      "text": "Long Ouyang, Jeff Wu, Xu Jiang, Diogo Almeida, Carroll L. Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, John Schulman, Jacob Hilton, Fraser Kelton, Luke Miller, Maddie Simens, Amanda Askell, Peter Welinder, Paul Christiano, Jan Leike, and Ryan Lowe. 2022. Training language models to follow instructions with human feedback. https://doi.org/10.48550/ARXIV.2203.02155",
      "doi": ""
    },
    {
      "text": "Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, Ilya Sutskever, 2019. Language models are unsupervised multitask learners. OpenAI blog 1, 8 (2019), 9. https://d4mucfpksywv.cloudfront.net/better-language-models/language-models.pdf",
      "doi": ""
    },
    {
      "text": "Aaron A. Reed. 2012. Sharing Authoring with Algorithms: Procedural Generation of Satellite Sentences in Text-Based Interactive Stories. In Proceedings of the The Third Workshop on Procedural Content Generation in Games (Raleigh, NC, USA) (PCG’12). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/2538528.2538540",
      "doi": "10.1145/2538528.2538540"
    },
    {
      "text": "Simão Reis, Luís Paulo Reis, and Nuno Lau. 2019. Player Engagement Enhancement with Video Games. In New Knowledge in Information Systems and Technologies(Advances in Intelligent Systems and Computing), Álvaro Rocha, Hojjat Adeli, Luís Paulo Reis, and Sandra Costanzo (Eds.). Springer International Publishing, Cham, 263–272. https://doi.org/10.1007/978-3-030-16184-2_26",
      "doi": ""
    },
    {
      "text": "James Ryan, Michael Mateas, and Noah Wardrip-Fruin. 2016. Characters Who Speak Their Minds: Dialogue Generation in Talk of the Town. Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment 12, 1 (2016), 204–210. https://ojs.aaai.org/index.php/AIIDE/article/view/12877",
      "doi": ""
    },
    {
      "text": "Noor Shaker, Julian Togelius, and Mark J. Nelson. 2016. Procedural Content Generation in Games. Springer International Publishing, Midtown Manhattan, New York City. https://doi.org/10.1007/978-3-319-42716-4",
      "doi": ""
    },
    {
      "text": "Wai Man Si, Prithviraj Ammanabrolu, and Mark O. Riedl. 2021. Telling Stories through Multi-User Dialogue by Modeling Character Relations. In Proceedings of the 22nd Annual Meeting of the Special Interest Group on Discourse and Dialogue. Association for Computational Linguistics, Singapore and Online, 269–275. https://aclanthology.org/2021.sigdial-1.30",
      "doi": ""
    },
    {
      "text": "Gillian Smith. 2014. Understanding procedural content generation: a design-centric analysis of the role of PCG in games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 917–926. https://doi.org/10.1145/2556288.2557341",
      "doi": "10.1145/2556288.2557341"
    },
    {
      "text": "Edirlei Soares de Lima, Bruno Feijó, and Antonio L. Furtado. 2019. Procedural Generation of Quests for Games Using Genetic Algorithms and Automated Planning. In 2019 18th Brazilian Symposium on Computer Games and Digital Entertainment (SBGames). IEEE, Rio de Janeiro, Brazil, 144–153. https://doi.org/10.1109/SBGames.2019.00028",
      "doi": ""
    },
    {
      "text": "Mojang Studios. 2011. Minecraft. Game [PC]. Mojang Studios, Stockholm, Sweden.",
      "doi": ""
    },
    {
      "text": "Anne Sullivan. 2009. Gender-inclusive quest design in massively multiplayer online role-playing games. In Proceedings of the 4th International Conference on Foundations of Digital Games(FDG ’09). Association for Computing Machinery, New York, NY, USA, 354–356. https://doi.org/10.1145/1536513.1536581",
      "doi": "10.1145/1536513.1536581"
    },
    {
      "text": "Anne Sullivan, Michael Mateas, and Noah Wardrip–Fruin. 2009. Questbrowser: Making quests playable with computer-assisted design. UC Irvine: Digital Arts and Culture 2009 (2009), 8. https://eis.ucsc.edu/papers/0011_sullivan.pdf",
      "doi": ""
    },
    {
      "text": "Jonathan Teutenberg and Julie Porteous. 2015. Incorporating Global and Local Knowledge in Intentional Narrative Planning. In 14th International Conference on Autonomous Agents and Multiagent Systems. AAMAS, Istanbul, Turkey, 8. https://www.ifaamas.org/Proceedings/aamas2015/aamas/p1539.pdf",
      "doi": ""
    },
    {
      "text": "Michael Toy, Glenn Wichman, Ken Arnold, and Jon Lane. 1980. Rogue.",
      "doi": ""
    },
    {
      "text": "Marcus Trenton, Duane Szafron, Josh Friesen, and Curtis Onuczko. 2010. Quest Patterns for Story-Based Computer Games. Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment 6, 1 (Oct. 2010), 204–209. https://ojs.aaai.org/index.php/AIIDE/article/view/12408",
      "doi": ""
    },
    {
      "text": "Anders Tychsen, Susana Tosca, and Thea Brolund. 2006. Personalizing the Player Experience in MMORPGs. In Technologies for Interactive Digital Storytelling and Entertainment(Lecture Notes in Computer Science), Stefan Göbel, Rainer Malkewitz, and Ido Iurgel (Eds.). Springer, Berlin, Heidelberg, 253–264. https://doi.org/10.1007/11944577_26",
      "doi": "10.1007/11944577_26"
    },
    {
      "text": "Judith van Stegeren and Jakub Myśliwiec. 2021. Fine-tuning GPT-2 on annotated RPG quests for NPC dialogue generation. In The 16th International Conference on the Foundations of Digital Games (FDG) 2021(FDG’21). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3472538.3472595",
      "doi": "10.1145/3472538.3472595"
    },
    {
      "text": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. 2017. Attention is All you Need. In Advances in Neural Information Processing Systems, I. Guyon, U. Von Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett (Eds.). Vol. 30. Curran Associates, Inc., Long Beach, California, 11. https://proceedings.neurips.cc/paper/2017/file/3f5ee243547dee91fbd053c1c4a845aa-Paper.pdf",
      "doi": ""
    },
    {
      "text": "Hao Wang. 2014. Automatic Narratives in MMORPGs. In Handbook of Digital Games. John Wiley & Sons, Ltd, Hoboken, New Jersey. https://doi.org/10.1002/9781118796443",
      "doi": ""
    },
    {
      "text": "Georgios N Yannakakis, Antonios Liapis, and Constantine Alexopoulos. 2014. Mixed-initiative co-creativity. In Proceedings of the 9th Conference on the Foundations of Digital Games. FDG, Liberty of the Seas, Caribbean, 8. http://www.fdg2014.org/papers/fdg2014_paper_37.pdf",
      "doi": ""
    },
    {
      "text": "Kristen K. Yu, Nathan R. Sturtevant, and Matthew Guzdial. 2021. Towards Disambiguating Quests as a Technical Term. In The 16th International Conference on the Foundations of Digital Games (FDG) 2021(FDG’21). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3472538.3472543",
      "doi": "10.1145/3472538.3472543"
    },
    {
      "text": "Wenhao Yu, Chenguang Zhu, Zaitang Li, Zhiting Hu, Qingyun Wang, Heng Ji, and Meng Jiang. 2022. A Survey of Knowledge-Enhanced Text Generation. ACM Comput. Surv. 54, 11s, Article 227 (nov 2022), 38 pages. https://doi.org/10.1145/3512467",
      "doi": "10.1145/3512467"
    },
    {
      "text": "Hanqing Zhang, Haolin Song, Shaoyu Li, Ming Zhou, and Dawei Song. 2022. A Survey of Controllable Text Generation using Transformer-based Pre-trained Language Models. https://doi.org/10.48550/arXiv.2201.05337",
      "doi": ""
    }
  ]
}