{
  "doi": "10.1145/3544548.3581274",
  "title": "Towards Critical Heritage in the wild: Analysing Discomfort through Collaborative Autoethnography",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "As we engaged in designing digital interventions for intercultural dialogues around public cultural heritage sites, we saw an opportunity to surface multiple interpretations and points of view of history and shine a critical lens on current societal issues. To do so, we present the results of a collaborative auto-ethnography of alternative tours accompanied by intercultural guides, to explore sensory and embodied engagements with cultural heritage sites in a southern European capital. By focusing on the differences in how we experienced the heritage sites, we analyse the duality of discomfort, a common concept in HCI, in that it can both be deployed as a resource for designing systems that can transform people’s understanding of history or it can be a hindrance for engagement, having an unequal effect on individuals.",
  "tags": [
    "ethnography",
    "intercultural dialogues",
    "cultural heritage"
  ],
  "authors": [
    {
      "name": "Paulo Bala",
      "institution": "ITI / LARSyS, Instituto Superior Técnico - U. Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701809",
      "orcid": "0000-0003-1743-0261"
    },
    {
      "name": "Pedro Sanches",
      "institution": "ITI / LARSyS, Instituto Superior Técnico - U. Lisbon, Portugal and Department of Informatics, Umeå University, Sweden",
      "img": "/do/10.1145/contrib-81384620808/rel-imgonly/pedro_cropped.png",
      "acmid": "81384620808",
      "orcid": "0000-0001-5620-6305"
    },
    {
      "name": "Vanessa Cesário",
      "institution": "ITI, LARSyS, Instituto Superior Técnico - U. Lisbon, Portugal",
      "img": "/do/10.1145/contrib-99659057862/rel-imgonly/vanessa_-_pic.jpg",
      "acmid": "99659057862",
      "orcid": "0000-0002-0938-9476"
    },
    {
      "name": "Sarah Leão",
      "institution": "Instituto Superior Técnico - U. Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780449",
      "orcid": "0000-0003-3793-9866"
    },
    {
      "name": "Catarina Rodrigues",
      "institution": "Instituto Superior Técnico - U. Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660610724",
      "orcid": "0000-0002-7598-9576"
    },
    {
      "name": "Nuno Jardim Nunes",
      "institution": "ITI / LARSyS, Instituto Superior Técnico - U. Lisbon, Portugal",
      "img": "/do/10.1145/contrib-81100452353/rel-imgonly/njn2010_2.jpg",
      "acmid": "81100452353",
      "orcid": "0000-0002-2498-0643"
    },
    {
      "name": "Valentina Nisi",
      "institution": "ITI / LARSyS, Instituto Superior Técnico - U. Lisbon, Portugal",
      "img": "/do/10.1145/contrib-81442614375/rel-imgonly/img_0490.jpg",
      "acmid": "81442614375",
      "orcid": "0000-0002-8051-3230"
    }
  ],
  "references": [
    {
      "text": "Veronica Abebe, Gagik Amaryan, Marina Beshai, Ilene, Ali Ekin Gurgen, Wendy Ho, Naaji R. Hylton, Daniel Kim, Christy Lee, Carina Lewandowski, Katherine T. Miller, Lindsey A. Moore, Rachel Sylwester, Ethan Thai, Frelicia N. Tucker, Toussaint Webb, Dorothy Zhao, Haicheng Charles Zhao, and Janet Vertesi. 2022. Anti-Racist HCI: notes on an emerging critical technical practice. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. ACM, New Orleans LA USA, 1–12. https://doi.org/10.1145/3491101.3516382",
      "doi": "10.1145/3491101.3516382"
    },
    {
      "text": "Sara Ahmed. 2007. A phenomenology of whiteness. Feminist Theory 8, 2 (Aug. 2007), 149–168. https://doi.org/10.1177/1464700107078139",
      "doi": ""
    },
    {
      "text": "Miquel Alfaras, Vasiliki Tsaknaki, Pedro Sanches, Charles Windlin, Muhammad Umair, Corina Sas, and Kristina Höök. 2020. From Biodata to Somadata. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376684",
      "doi": "10.1145/3313831.3376684"
    },
    {
      "text": "Flora Amato, Vincenzo Moscato, Antonio Picariello, Francesco Colace, Massimo De Santo, Fabio A. Schreiber, and Letizia Tanca. 2017. Big Data Meets Digital Cultural Heritage: Design and Implementation of SCRABS, A Smart Context-awaRe Browsing Assistant for Cultural EnvironmentS. Journal on Computing and Cultural Heritage 10, 1 (April 2017), 1–23. https://doi.org/10.1145/3012286",
      "doi": "10.1145/3012286"
    },
    {
      "text": "Kristina Andersen and Ron Wakkary. 2019. The Magic Machine Workshops: Making Personal Design Knowledge. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300342",
      "doi": "10.1145/3290605.3300342"
    },
    {
      "text": "Hannah Arendt. 1989. Lectures on Kant’s political philosophy. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Kevin Baker and Steven Verstockt. 2017. Cultural Heritage Routing: A Recreational Navigation-based Approach in Exploring Cultural Heritage. Journal on Computing and Cultural Heritage 10, 4 (Oct. 2017), 1–20. https://doi.org/10.1145/3040200",
      "doi": "10.1145/3040200"
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 1709–1718. https://doi.org/10.1145/2702123.2702328",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Karen Barad. 2014. Diffracting Diffraction: Cutting Together-Apart. Parallax 20, 3 (July 2014), 168–187. https://doi.org/10.1080/13534645.2014.927623",
      "doi": ""
    },
    {
      "text": "Karen Michelle Barad. 2007. Meeting the universe halfway: quantum physics and the entanglement of matter and meaning. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"critical\" about critical design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 3297–3306. https://doi.org/10.1145/2470654.2466451",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver BC Canada, 675–684. https://doi.org/10.1145/1978942.1979041",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Natchee Barnd. 2016. Constructing a Social Justice Tour: Pedagogy, Race, and Student Learning through Geography. Journal of Geography 115, 5 (Sept. 2016), 212–223. https://doi.org/10.1080/00221341.2016.1153132",
      "doi": ""
    },
    {
      "text": "Mafkereseb Kassahun Bekele, Roberto Pierdicca, Emanuele Frontoni, Eva Savina Malinverni, and James Gain. 2018. A Survey of Augmented, Virtual, and Mixed Reality for Cultural Heritage. Journal on Computing and Cultural Heritage 11, 2 (June 2018), 1–36. https://doi.org/10.1145/3145534",
      "doi": "10.1145/3145534"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Bob Anderson, Rachel Jacobs, Mike Golembewski, Marina Jirotka, Bernd Carsten Stahl, Job Timmermans, Gabriella Giannachi, Matt Adams, Ju Row Farr, Nick Tandavanitj, and Kirsty Jennings. 2015. The Ethical Implications of HCI’s Turn to the Cultural. ACM Transactions on Computer-Human Interaction 22, 5 (Sept. 2015), 1–37. https://doi.org/10.1145/2775107",
      "doi": "10.1145/2775107"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Austin Texas USA, 2005–2014. https://doi.org/10.1145/2207676.2208347",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2013. Uncomfortable user experience. Commun. ACM 56, 9 (Sept. 2013), 66–73. https://doi.org/10.1145/2500468.2500889",
      "doi": "10.1145/2500468.2500889"
    },
    {
      "text": "Black Brown Berlin. 2021. Walking Tour: Colonialism and Anticolonialism in Berlin. https://www.blackbrownberlin.com/eventlisting-1/Walking-Tour%3A-Colonialism-and-Anticolonialism-in-Berlin",
      "doi": ""
    },
    {
      "text": "Gert Biesta and Gillian Cowell. 2012. How is community done? Understanding civic learning through psychogeographic mapping. International Journal of Lifelong Education 31, 1 (Feb. 2012), 47–61. https://doi.org/10.1080/02601370.2012.636587",
      "doi": ""
    },
    {
      "text": "Jeanette Blomberg and Helena Karasti. 2013. Reflections on 25 Years of Ethnography in CSCW. Computer Supported Cooperative Work (CSCW) 22, 4-6 (Aug. 2013), 373–423. https://doi.org/10.1007/s10606-012-9183-1",
      "doi": "10.1007/s10606-012-9183-1"
    },
    {
      "text": "Mark Blythe. 2014. Research through design fiction: narrative in real and imaginary abstracts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 703–712. https://doi.org/10.1145/2556288.2557098",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-Solutionist Strategies: Seriously Silly Design Fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 4968–4978. https://doi.org/10.1145/2858036.2858482",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Simona Bodo. 2012. Museums as intercultural spaces. Museums, equality and social justice(2012), 181–191. Publisher: Routledge: London, UK.",
      "doi": ""
    },
    {
      "text": "Nina Boulus-Rødje. 2018. Stuck With My Body at Qalandiya Checkpoint: Reflections Upon Conducting Fieldwork in an Uncertain Field Site. SAGE Research Methods Cases (01 2018). https://doi.org/10.4135/9781526437839",
      "doi": ""
    },
    {
      "text": "Barry Brown and Matthew Chalmers. 2003. Tourism and mobile technology. In ECSCW 2003. Springer Netherlands, Dordrecht, 335–354. https://doi.org/10.1007/978-94-010-0068-0_18",
      "doi": ""
    },
    {
      "text": "Richard Byrne, Joe Marshall, and Florian ‘Floyd’ Mueller. 2020. Designing Digital Vertigo Experiences. ACM Transactions on Computer-Human Interaction 27, 3 (June 2020), 1–30. https://doi.org/10.1145/3387167",
      "doi": "10.1145/3387167"
    },
    {
      "text": "Amalia Campos-Delgado. 2018. Counter-mapping migration: irregular migrants’ stories through cognitive mapping. Mobilities 13, 4 (July 2018), 488–504. https://doi.org/10.1080/17450101.2017.1421022",
      "doi": ""
    },
    {
      "text": "Gustavo Candela, Pilar Escobar, and Manuel Marco-Such. 2017. Semantic Enrichment on Cultural Heritage collections: A case study using geographic information. In Proceedings of the 2nd International Conference on Digital Access to Textual Cultural Heritage. ACM, Göttingen Germany, 169–174. https://doi.org/10.1145/3078081.3078090",
      "doi": "10.1145/3078081.3078090"
    },
    {
      "text": "Rachelle Chadwick. 2021. On the politics of discomfort. Feminist Theory 22, 4 (Dec. 2021), 556–574. https://doi.org/10.1177/1464700120987379",
      "doi": ""
    },
    {
      "text": "Alan Chamberlain, Mads Bødker, and Konstantinos Papangelis. 2017. Mapping Media and Meaning: Autoethnography as an Approach to Designing Personal Heritage Soundscapes. In Proceedings of the 12th International Audio Mostly Conference on Augmented and Participatory Sound and Music Experiences. ACM, London United Kingdom, 1–4. https://doi.org/10.1145/3123514.3123536",
      "doi": "10.1145/3123514.3123536"
    },
    {
      "text": "Heewon Chang, Faith Wambura Ngunjiri, and Kathy-Ann C. Hernandez. 2013. Collaborative autoethnography. Number 8 in Developing qualitative inquiry. Left Coast Press, Walnut Creek, Calif.",
      "doi": ""
    },
    {
      "text": "Wendy Cheng, Laura Barraclough, and Laura Pulido. 2010. Radicalising teaching and tourism: A People’s Guide as active and activist history. Left History: An Interdisciplinary Journal of Historical Inquiry and Debate 15, 1(2010).",
      "doi": ""
    },
    {
      "text": "Michael F. Christie and Peter A. Mason. 2003. Transformative Tour Guiding: Training Tour Guides to be Critically Reflective Practitioners. Journal of Ecotourism 2, 1 (March 2003), 1–16. https://doi.org/10.1080/14724040308668130",
      "doi": ""
    },
    {
      "text": "Caroline Claisse, Luigina Ciolfi, and Daniela Petrelli. 2017. Containers of Stories: using co-design and digital augmentation to empower the museum community and create novel experiences of heritage at a house museum. The Design Journal 20, sup1 (July 2017), S2906–S2918. https://doi.org/10.1080/14606925.2017.1352801",
      "doi": ""
    },
    {
      "text": "Caroline Claisse, Daniela Petrelli, Luigina Ciolfi, Nick Dulake, Mark T. Marshall, and Abigail C. Durrant. 2020. Crafting Critical Heritage Discourses into Interactive Exhibition Design. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376689",
      "doi": "10.1145/3313831.3376689"
    },
    {
      "text": "Communarts. 2022. The Whole Story Project AR app. https://www.commarts.com/project/11275/the-whole-story-project-ar-app",
      "doi": ""
    },
    {
      "text": "Counter Cartographies Collective, Craig Dalton, and Liz Mason-Deese. 2012. Counter (Mapping) Actions: Mapping as Militant Research. ACME: An International Journal for Critical Geographies 11, 3 (Dec. 2012). https://www.acme-journal.org/index.php/acme/article/view/941",
      "doi": ""
    },
    {
      "text": "Areti Damala, Merel van der Vaart, Loraine Clarke, Eva Hornecker, Gabriela Avram, Hub Kockelkorn, and Ian Ruthven. 2016. Evaluating tangible and multisensory museum visiting experiences: Lessons learned from the meSch project. In Museums and the Web. 1–18.",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, Hong Kong China, 753–764. https://doi.org/10.1145/3196709.3196781",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "Laura Devendorf, Kristina Andersen, and Aisling Kelliher. 2020. Making Design Memoirs: Understanding and Honoring Difficult Experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–12. https://doi.org/10.1145/3313831.3376345",
      "doi": "10.1145/3313831.3376345"
    },
    {
      "text": "Claudia Dolezal and Jayni Gudka. 2019. London’s ‘Unseen Tours’: Slumming or Social Tourism?In Destination London: The Expansion of the Visitor Economy, University of Westminster, GB, Andrew Smith, Anne Graham, and University of Westminster, GB (Eds.). University of Westminster Press, 141–163. https://doi.org/10.16997/book35.g",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the Action Is: The Foundations of Embodied Interaction.Cambridge: MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Mauro Dragoni, Sara Tonelli, and Giovanni Moretti. 2017. A Knowledge Management Architecture for Digital Cultural Heritage. Journal on Computing and Cultural Heritage 10, 3 (Aug. 2017), 1–18. https://doi.org/10.1145/3012289",
      "doi": "10.1145/3012289"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. The MIT Press, Cambridge, Massachusetts ; London.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2021. Critical Design FAQ. http://dunneandraby.co.uk/content/bydandr/13/0",
      "doi": ""
    },
    {
      "text": "Carolyn Ellis, Tony E. Adams, and Arthur P. Bochner. 2011. Autoethnography: an overview. Historical Social Research 36, 4 (2011), 273–290. https://doi.org/10.12759/hsr.36.2011.4.273-290",
      "doi": ""
    },
    {
      "text": "Europarat (Ed.). 2006. Council of Europe Framework Convention on the Value of Cultural Heritage for Society: Faro, 27. 10. 2005. Number 199 in Council of Europe treaty series. Council of Europe Publ, Strasbourg.",
      "doi": ""
    },
    {
      "text": "Europarat (Ed.). 2010. White Paper on Intercultural Dialogue: \"Living together as equals in dignity\". Council of Europe Publ, Strasbourg.",
      "doi": ""
    },
    {
      "text": "Samuel Fernando and Mark Stevenson. 2012. Adapting wikification to cultural heritage. In Proceedings of the 6th Workshop on Language Technology for Cultural Heritage, Social Sciences, and Humanities. 101–106.",
      "doi": "10.5555/2390357.2390371"
    },
    {
      "text": "Alessandro E. Foni, George Papagiannakis, and Nadia Magnenat-Thalmann. 2010. A taxonomy of visualization strategies for cultural heritage applications. Journal on Computing and Cultural Heritage 3, 1 (June 2010), 1–21. https://doi.org/10.1145/1805961.1805962",
      "doi": "10.1145/1805961.1805962"
    },
    {
      "text": "Lesley Fosh, Steve Benford, Stuart Reeves, Boriana Koleva, and Patrick Brundell. 2013. see me, feel me, touch me, hear me: trajectories and interpretation in a sculpture garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 149–158. https://doi.org/10.1145/2470654.2470675",
      "doi": "10.1145/2470654.2470675"
    },
    {
      "text": "Christopher Frauenberger. 2020. Entanglement HCI The Next Wave?ACM Transactions on Computer-Human Interaction 27, 1 (Jan. 2020), 1–27. https://doi.org/10.1145/3364998",
      "doi": "10.1145/3364998"
    },
    {
      "text": "Areti Galani and Jenny Kidd. 2019. Evaluating Digital Cultural Heritage ‘In the Wild’: The Case For Reflexivity. Journal on Computing and Cultural Heritage 12, 1 (Feb. 2019), 1–15. https://doi.org/10.1145/3287272",
      "doi": "10.1145/3287272"
    },
    {
      "text": "Areti Galani, Katie Markham, and Rhiannon Mason. 2019. Problematising digital and dialogic heritage practices in Europe. In European Heritage, Dialogue and Digital Practices (1 ed.), Areti Galani, Rhiannon Mason, and Gabi Arrigoni (Eds.). Routledge, 9–36. https://doi.org/10.4324/9780429053511-2",
      "doi": ""
    },
    {
      "text": "Lisanne Gibson and John R Pendlebury. 2016. Valuing historic environments. Routledge, London; New York. https://www.taylorfrancis.com/books/e/9781317002659",
      "doi": ""
    },
    {
      "text": "Donald Gillies. 2016. Visiting good company: Arendt and the development of the reflective practitioner. Journal of Educational Administration and History 48, 2 (April 2016), 148–159. https://doi.org/10.1080/00220620.2016.1144576",
      "doi": ""
    },
    {
      "text": "Chad Phoenix Rose Gowler and Ioanna Iacovides. 2019. \"Horror, guilt and shame\" – Uncomfortable Experiences in Digital Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, Barcelona Spain, 325–337. https://doi.org/10.1145/3311350.3347179",
      "doi": "10.1145/3311350.3347179"
    },
    {
      "text": "Roots Guide. 2021. Roots Guide, Reflect. Connect. Explore. Share.https://rootsguide.org/",
      "doi": ""
    },
    {
      "text": "Helen Halbert and Lisa P. Nathan. 2014. Designing for negative affect and critical reflection. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 2569–2574. https://doi.org/10.1145/2559206.2581241",
      "doi": "10.1145/2559206.2581241"
    },
    {
      "text": "Helen Halbert and Lisa P. Nathan. 2015. Designing for Discomfort: Supporting Critical Reflection through Interactive Tools. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, Vancouver BC Canada, 349–360. https://doi.org/10.1145/2675133.2675162",
      "doi": "10.1145/2675133.2675162"
    },
    {
      "text": "Nancy Hansen and Chris Philo. 2007. The normality of doing things differently: Bodies, spaces and disability geography. Tijdschrift voor Economische en Sociale Geografie 98, 4 (Sept. 2007), 493–506. https://doi.org/10.1111/j.1467-9663.2007.00417.x",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Feminist studies 14, 3 (1988), 575–599.",
      "doi": ""
    },
    {
      "text": "Sandra G. Harding (Ed.). 2004. The feminist standpoint theory reader: intellectual and political controversies. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Rodney Harrison. 2010. What is heritage. Understanding the politics of heritage(2010), 5–42. Publisher: Manchester: Manchester University Press in association with the Open University.",
      "doi": ""
    },
    {
      "text": "Rodney Harrison, Nadia Bartolini, Caitlin DeSilvey, Cornelius Holtorf, Antony Lyons, Sharon Macdonald, Sarah F. May, Jennie Morgan, and Sefryn Penrose. 2016. Heritage Futures. Archaeology International (Dec. 2016). https://doi.org/10.5334/ai.1912",
      "doi": ""
    },
    {
      "text": "Karey Helms. 2022. A Speculative Ethics for Designing with Bodily Fluids. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. ACM, New Orleans LA USA, 1–11. https://doi.org/10.1145/3491101.3516395",
      "doi": "10.1145/3491101.3516395"
    },
    {
      "text": "Sarah Homewood, Marika Hedemyr, Maja Fagerberg Ranten, and Susan Kozel. 2021. Tracing Conceptions of the Body in HCI: From User to More-Than-Human. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–12. https://doi.org/10.1145/3411764.3445656",
      "doi": "10.1145/3411764.3445656"
    },
    {
      "text": "Kristina Höök. 2010. Transferring Qualities from Horseback Riding to Design. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (Reykjavik, Iceland) (NordiCHI ’10). Association for Computing Machinery, New York, NY, USA, 226–235. https://doi.org/10.1145/1868914.1868943",
      "doi": "10.1145/1868914.1868943"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the body: Somaesthetic interaction design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Noura Howell, Audrey Desjardins, and Sarah Fox. 2021. Cracks in the Success Narrative: Rethinking Failure in Design Research through a Retrospective Trioethnography. ACM Transactions on Computer-Human Interaction 28, 6 (Dec. 2021), 1–31. https://doi.org/10.1145/3462447",
      "doi": "10.1145/3462447"
    },
    {
      "text": "Chih-Hong Huang and Yi-Ting Huang. 2013. An Annales School-Based Serious Game Creation Framework for Taiwanese Indigenous Cultural Heritage. J. Comput. Cult. Herit. 6, 2, Article 9 (May 2013), 31 pages. https://doi.org/10.1145/2460376.2460380",
      "doi": "10.1145/2460376.2460380"
    },
    {
      "text": "Serena Iervolino. 2013. Museums, migrant communities, and intercultural dialogue in Italy. Bloomsbury, 113–129.",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, Atlanta, Georgia, USA, 1311. https://doi.org/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Lilly C. Irani and Paul Dourish. 2009. Postcolonial interculturality. In Proceedings of the 2009 international workshop on Intercultural collaboration(IWIC ’09). Association for Computing Machinery, New York, NY, USA, 249–252. https://doi.org/10.1145/1499224.1499268",
      "doi": "10.1145/1499224.1499268"
    },
    {
      "text": "Judith C. Lapadat. 2017. Ethics in Autoethnography and Collaborative Autoethnography. Qualitative Inquiry 23, 8 (Oct. 2017), 589–603. https://doi.org/10.1177/1077800417704462",
      "doi": ""
    },
    {
      "text": "Eric K Layland, Garrett A Stone, J Tom Mueller, and Camilla J Hodge. 2018. Injustice in mobile leisure: A conceptual exploration of Pokémon Go. Leisure sciences 40, 4 (2018), 288–306.",
      "doi": ""
    },
    {
      "text": "Zhicong Lu, Michelle Annett, Mingming Fan, and Daniel Wigdor. 2019. \"I feel it is my responsibility to stream\": Streaming and Engaging with Intangible Cultural Heritage through Livestreaming. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–14. https://doi.org/10.1145/3290605.3300459",
      "doi": "10.1145/3290605.3300459"
    },
    {
      "text": "Deborah Lupton and and Ash Watson. 2020. Towards more-than-human digital data studies: developing research-creation methods. Qualitative Research (July 2020), 146879412093923. https://doi.org/10.1177/1468794120939235",
      "doi": ""
    },
    {
      "text": "Marco Martiniello and Jan Rath. 2010. Introduction: Migration and ethnic studies in Europe. Selected studies in international migration and immigrant incorporation (2010), 7–18.",
      "doi": ""
    },
    {
      "text": "Rob McMahon, Amanda Almond, Greg Whistance-Smith, Diana Steinhauer, Stewart Steinhauer, and Diane P Janes. 2019. Sweetgrass AR: Exploring augmented reality as a resource for Indigenous–settler relations. International Journal of Communication 13 (2019), 23.",
      "doi": ""
    },
    {
      "text": "Migrantour. 2021. Migrantour, co-funded by European Union. http://www.mygrantour.org/en/",
      "doi": ""
    },
    {
      "text": "Marios Mouratidis, Sarah Rüller, Konstantin Aal, Shaimaa Lazem, Anicia Peters, Nina Boulus-Rødje, Simon Holdermann, Vasilis Vlachokyriakos, Ann Light, Dave Randall, and Volker Wulf. 2021. Coping with Messiness in Ethnography: Authority, Bias and Immersion in ethnographic Fieldwork in the non-Western World. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–5. https://doi.org/10.1145/3411763.3441328",
      "doi": "10.1145/3411763.3441328"
    },
    {
      "text": "Florian Floyd Mueller, Pedro Lopes, Paul Strohmeier, Wendy Ju, Caitlyn Seim, Martin Weigel, Suranga Nanayakkara, Marianna Obrist, Zhuying Li, Joseph Delfa, Jun Nishida, Elizabeth M. Gerber, Dag Svanaes, Jonathan Grudin, Stefan Greuter, Kai Kunze, Thomas Erickson, Steven Greenspan, Masahiko Inami, Joe Marshall, Harald Reiterer, Katrin Wolf, Jochen Meyer, Thecla Schiphorst, Dakuo Wang, and Pattie Maes. 2020. Next Steps for Human-Computer Integration. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–15. https://doi.org/10.1145/3313831.3376242",
      "doi": "10.1145/3313831.3376242"
    },
    {
      "text": "Karin Murris and Vivienne Bozalek. 2019. Diffracting diffractive readings of texts as methodology: Some propositions. Educational Philosophy and Theory 51, 14 (2019), 1504–1517. https://doi.org/10.1080/00131857.2019.1570843",
      "doi": ""
    },
    {
      "text": "Pierluigi Musarò and Melissa Moralli. 2021. What is the role of responsible tourism in building stronger and intercultural communities? Two case studies from Italy. 21–35. https://doi.org/10.4324/9780367201777-3",
      "doi": ""
    },
    {
      "text": "Joe Norris, Richard Sawyer, and Darren E. Lund (Eds.). 2012. Duoethnography: dialogic methods for social, health, and educational research. Number v. 7 in Developing qualitative inquiry. Left Coast Press, Walnut Creek, CA.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Meghann Ormond and Francesco Vietti. 2021. Beyond multicultural ‘tolerance’: guided tours and guidebooks as transformative tools for civic learning. Journal of Sustainable Tourism (March 2021), 1–17. https://doi.org/10.1080/09669582.2021.1901908",
      "doi": ""
    },
    {
      "text": "Ulrich Oslender. 2021. Decolonizing cartography and ontological conflict: Counter-mapping in Colombia and “cartographies otherwise”. Political Geography 89 (Aug. 2021), 102444. https://doi.org/10.1016/j.polgeo.2021.102444",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Esko Kurvinen, and Tomi Kankainen. 2003. Understanding contexts by being there: case studies in bodystorming. Personal and ubiquitous computing 7, 2 (2003), 125–134.",
      "doi": ""
    },
    {
      "text": "W. Gerrod Parrott (Ed.). 2014. The positive side of negative emotions. The Guilford Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Ross Parry. 2005. Digital heritage and the rise of theory in museum computing. Museum Management and Curatorship 20, 4 (Jan. 2005), 333–348. https://doi.org/10.1080/09647770500802004",
      "doi": ""
    },
    {
      "text": "Daniela Petrelli, Luigina Ciolfi, Dick van Dijk, Eva Hornecker, Elena Not, and Albrecht Schmidt. 2013. Integrating material and digital: a new way for cultural heritage. Interactions 20, 4 (July 2013), 58–63. https://doi.org/10.1145/2486227.2486239",
      "doi": "10.1145/2486227.2486239"
    },
    {
      "text": "James Pierce and Eric Paulos. 2014. Counterfunctional things: exploring possibilities in designing digital limitations. In Proceedings of the 2014 conference on Designing interactive systems. ACM, Vancouver BC Canada, 375–384. https://doi.org/10.1145/2598510.2598522",
      "doi": "10.1145/2598510.2598522"
    },
    {
      "text": "Beryl Plimmer, Liang He, Tariq Zaman, Kasun Karunanayaka, Alvin W. Yeo, Garen Jengan, Rachel Blagojevic, and Ellen Yi-Luen Do. 2015. New Interaction Tools for Preserving an Old Language. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 3493–3502. https://doi.org/10.1145/2702123.2702339",
      "doi": "10.1145/2702123.2702339"
    },
    {
      "text": "Daniele Quercia, Rossano Schifanella, and Luca Maria Aiello. 2014. The shortest path to happiness: recommending beautiful, quiet, and happy routes in the city. In Proceedings of the 25th ACM conference on Hypertext and social media. ACM, Santiago Chile, 116–125. https://doi.org/10.1145/2631775.2631799",
      "doi": "10.1145/2631775.2631799"
    },
    {
      "text": "Querstadtein. 2021. querstadtein. https://querstadtein.org/en/",
      "doi": ""
    },
    {
      "text": "Shalini Randeria and Evangelos Karagiannis. 2020. The Migrant Position: Dynamics of Political and Cultural Exclusion. Theory, Culture & Society 37, 7-8 (Dec. 2020), 219–231. https://doi.org/10.1177/0263276420957733",
      "doi": ""
    },
    {
      "text": "Amon Rapp. 2018. Autoethnography in Human-Computer Interaction: Theory and Practice. In New Directions in Third Wave Human-Computer Interaction: Volume 2 - Methodologies, Michael Filimowicz and Veronika Tzankova (Eds.). Springer International Publishing, Cham, 25–42. https://doi.org/10.1007/978-3-319-73374-6_3 Series Title: Human–Computer Interaction Series.",
      "doi": ""
    },
    {
      "text": "Yvette Reisinger. 2013. Transformational tourism: tourist perspectives. CAB International, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers. 2012. HCI Theory: Classical, Modern, and Contemporary. Synthesis Lectures on Human-Centered Informatics 5, 2 (May 2012), 1–129. https://doi.org/10.2200/S00418ED1V01Y201205HCI014",
      "doi": ""
    },
    {
      "text": "Maria Roussou, Sara Perry, Akrivi Katifori, Stavros Vassos, Angeliki Tzouganatou, and Sierra McKinney. 2019. Transformation through Provocation?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300857",
      "doi": "10.1145/3290605.3300857"
    },
    {
      "text": "Pedro Sanches, Noura Howell, Vasiliki Tsaknaki, Tom Jenkins, and Karey Helms. 2022. Diffraction-in-action: Designerly Explorations of Agential Realism Through Lived Data. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–18. https://doi.org/10.1145/3491102.3502029",
      "doi": "10.1145/3491102.3502029"
    },
    {
      "text": "Joy Sather-Wagstaff. 2016. Making polysense of the world: affect, memory, heritage. In Heritage, Affect and Emotion. Routledge.",
      "doi": ""
    },
    {
      "text": "Richard Sawyer and Joe Norris. 2015. Duoethnography: A Retrospective 10 Years After. International Review of Qualitative Research 8, 1 (Feb. 2015), 1–4. https://doi.org/10.1525/irqr.2015.8.1.1",
      "doi": ""
    },
    {
      "text": "Richard D. Sawyer and Joe Norris. 2013. Duoethnography. Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Nicolai Scherle and Almut Nonnenmann. 2008. Swimming in cultural flows: Conceptualising tour guides as intercultural mediators and cosmopolitans. Journal of Tourism and Cultural Change 6, 2 (2008), 120–137.",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. Association for Computing Machinery, New York, NY, USA, 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Tom Schofield, Daniel Foster Smith, Gönül Bozoglu, and Christopher Whitehead. 2019. Design and Plural Heritages: Composing Critical Futures. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300236",
      "doi": "10.1145/3290605.3300236"
    },
    {
      "text": "Tom Schofield, Daniel Foster-Smith, Gönül Bozoğlu, and Chris Whitehead. 2018. Co-Producing Collections: Re-imagining a Polyvocal Past with Cultural Probes. Open Library of Humanities 4 (June 2018). https://doi.org/10.16995/olh.296",
      "doi": ""
    },
    {
      "text": "M. schraefel and M. Jones. 2021. Discomfort: a New Material for Interaction Design. ArXiv abs/2105.04015(2021).",
      "doi": ""
    },
    {
      "text": "m.c. schraefel, Aaron Tabor, and Elizabeth Murnane. 2020. Discomfort design. Interactions 27, 2 (Feb. 2020), 40–45. https://doi.org/10.1145/3381875",
      "doi": "10.1145/3381875"
    },
    {
      "text": "Christin Seifert, Werner Bailer, Thomas Orgel, Louis Gantner, Roman Kern, Hermann Ziak, Albin Petit, Jörg Schlötterer, Stefan Zwicklbauer, and Michael Granitzer. 2017. Ubiquitous Access to Digital Cultural Heritage. J. Comput. Cult. Herit. 10, 1, Article 4 (April 2017), 27 pages. https://doi.org/10.1145/3012284",
      "doi": "10.1145/3012284"
    },
    {
      "text": "Rafael M. L. Silva, Erica Principe Cruz, Daniela K. Rosner, Dayton Kelly, Andrés Monroy-Hernández, and Fannie Liu. 2022. Understanding AR Activism: An Interview Study with Creators of Augmented Reality Experiences for Social Change. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–15. https://doi.org/10.1145/3491102.3517605",
      "doi": "10.1145/3491102.3517605"
    },
    {
      "text": "Laurajane Smith. 2012. Discourses of heritage : implications for archaeological community practice.Nuevo mundo mundos nuevos (Oct. 2012). https://doi.org/10.4000/nuevomundo.64148",
      "doi": ""
    },
    {
      "text": "Laurajane Smith. 2014. Uses of Heritage. In Encyclopedia of Global Archaeology, Claire Smith (Ed.). Springer, New York, NY, 7578–7582. https://doi.org/10.1007/978-1-4419-0465-2_1937",
      "doi": ""
    },
    {
      "text": "Katta Spiel. 2021. The Bodies of TEI – Investigating Norms and Assumptions in the Design of Embodied Interaction. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Salzburg Austria, 1–19. https://doi.org/10.1145/3430524.3440651",
      "doi": "10.1145/3430524.3440651"
    },
    {
      "text": "Anna Ståhl, Madeline Balaam, Rob Comber, Pedro Sanches, and Kristina Höök. 2022. Making New Worlds – Transformative Becomings with Soma Design. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 176, 17 pages. https://doi.org/10.1145/3491102.3502018",
      "doi": "10.1145/3491102.3502018"
    },
    {
      "text": "Anselm Strauss and Juliet M Corbin. 1997. Grounded theory in practice. Sage.",
      "doi": ""
    },
    {
      "text": "Paul Tennent, Kristina Höök, Steve Benford, Vasiliki Tsaknaki, Anna Ståhl, Claudia Dauden Roquet, Charles Windlin, Pedro Sanches, Joe Marshall, Christine Li, 2021. Articulating Soma Experiences using Trajectories. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3411764.3445482",
      "doi": "10.1145/3411764.3445482"
    },
    {
      "text": "Peter Tolmie. 2020. Orienting to the Wild. In Into the Wild: Beyond the Design Research Lab, Alan Chamberlainand Andy Crabtree (Eds.). Vol. 48. Springer International Publishing, Cham, 195–235. https://doi.org/10.1007/978-3-030-18020-1_10",
      "doi": ""
    },
    {
      "text": "African Lisbon Tour. 2021. African Lisbon Tour. https://africanlisbontour.com/",
      "doi": ""
    },
    {
      "text": "Shades Tours. 2021. Alternative tours in Vienna and Graz with SHADES TOURS. https://shades-tours.com/en/home/",
      "doi": ""
    },
    {
      "text": "Unseen Tours. 2021. Walking Tours & Virtual Quizzes supporting the homeless. https://unseentours.org.uk/",
      "doi": ""
    },
    {
      "text": "Mark Tschaepe. 2021. Somaesthetics of Discomfort: Enhancing Awareness and Inquiry. European Journal of Pragmatism and American Philosophy XIII, 1 (April 2021). https://doi.org/10.4000/ejpap.2264",
      "doi": ""
    },
    {
      "text": "Violeta Tsenova, Gavin Wood, Andrea Dolfini, Annie Tindley, and David Kirk. 2020. Un-Authorised View: Leveraging Volunteer Expertise in Heritage. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376558",
      "doi": "10.1145/3313831.3376558"
    },
    {
      "text": "J. E. Tunbridge and G. J. Ashworth. 1996. Dissonant heritage: the management of the past as a resource in conflict. J. Wiley, Chichester ; New York.",
      "doi": ""
    },
    {
      "text": "John Urry. 2002. The tourist gaze (2nded.). Sage Publications, London ; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Jude Walker and Vimbiso Ngara Manyamba. 2020. Towards an emotion-focused, discomfort-embracing transformative tourism education. Journal of Hospitality, Leisure, Sport & Tourism Education 26 (June 2020), 100213. https://doi.org/10.1016/j.jhlste.2019.100213",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Cosmin Munteanu, Hilary Davis, Anja Thieme, Stacy Branham, Wendy Moncur, Roisin McNaney, and John Vines. 2017. Ethical Encounters in HCI: Implications for Research in Sensitive Settings. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, Denver Colorado USA, 518–525. https://doi.org/10.1145/3027063.3027089",
      "doi": "10.1145/3027063.3027089"
    },
    {
      "text": "Wikidata. 2021. Igreja de São Domingos. https://www.wikidata.org/wiki/Q1977280",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Anna Vallgårda, and Oscar Tomico. 2017. Embodied Design Ideation Methods: Analysing the Power of Estrangement. Association for Computing Machinery, New York, NY, USA, 5158–5170. https://doi.org/10.1145/3025453.3025873",
      "doi": "10.1145/3025453.3025873"
    },
    {
      "text": "Rua M. Williams, Kathryn Ringland, Amelia Gibson, Mahender Mandala, Arne Maibaum, and Tiago Guerreiro. 2021. Articulations toward a crip HCI. Interactions 28, 3 (May 2021), 28–37. https://doi.org/10.1145/3458453",
      "doi": "10.1145/3458453"
    },
    {
      "text": "Heike Winschiers-Theophilus and Nicola J. Bidwell. 2013. Toward an Afro-Centric Indigenous HCI Paradigm. International Journal of Human–Computer Interaction 29, 4 (March 2013), 243–255. https://doi.org/10.1080/10447318.2013.765763",
      "doi": ""
    },
    {
      "text": "Tim Winter. 2013. Clarifying the critical in critical heritage studies. International Journal of Heritage Studies 19, 6 (Sept. 2013), 532–545. https://doi.org/10.1080/13527258.2012.720997",
      "doi": ""
    }
  ]
}