{
  "doi": "10.1145/3544548.3581104",
  "title": "Pick Me Up Before You Go-Go: Sociotechnical Strategies for Waste in Music Festival Campsites",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Multi-day music festivals have a waste problem with much of it centred around patron campgrounds. Interviews and co-design workshops were conducted with festival patrons (N = 19) and professionals (N = 9). The interviews indicated the factors impacting festival campground waste including the proliferation of cheap items, the continuity of management decisions, highly social camping practices, the land, and interactions between these. Co-design workshops explored these to produce sociotechnical strategies using the festival timeline as a frame, with one of these, a patron planning tool chosen for further development. This paper contributes new insights on how information and communication technologies might enhance sustainable practices by facilitating relational change through better organisation, evaluation, and feedback. It concludes with examination of the challenges and opportunities for Sustainable HCI, including how to carve out a design response to a wicked problem by situating relations, meaning making, telling invisible stories, and finding leverage points.",
  "authors": [
    {
      "name": "Kellie Vella",
      "institution": "Queensland University of Technology (QUT), Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503685970",
      "orcid": "0000-0002-1125-5530"
    }
  ],
  "references": [
    {
      "text": "AGF. 2018. A Greener Festival. Retrieved 1 February, 2022 from https://www.agreenerfestival.com",
      "doi": ""
    },
    {
      "text": "Bawaka Country, Sarah Wright, Sandie Suchet-Pearson, Kate Lloyd, Laklak Burarrwanga, Ritjilili Ganambarr, Merrkiyawuy Ganambarr-Stubbs, Banbapuy Ganambarr, Djawundil Maymuru. 2014. Working with and learning from Country: decentring human author-ity. Cult. Geogr. 22, 2: 269-283. http://dx.doi.org/10.1177/1474474014539248",
      "doi": ""
    },
    {
      "text": "Virginia Braun, Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qual Res Sport Exerc Health. 11, 4: 589-597. http://dx.doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Christina Bremer, Bran Knowles, Adrian Friday. 2022. Have we taken on too much?: A critical review of the Sustainable HCI landscape. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems, New Orleans, LA, USA. Article 41. http://dx.doi.org/10.1145/3491102.3517609",
      "doi": "10.1145/3491102.3517609"
    },
    {
      "text": "Alison L. Browne, Tullia Jack, Russell Hitchings. 2019. ‘Already existing’ sustainability experiments: Lessons on water demand, cleanliness practices and climate adaptation from the UK camping music festival. Geoforum. 103, 16-25. http://dx.doi.org/10.1016/j.geoforum.2019.01.021",
      "doi": ""
    },
    {
      "text": "Nicholas Carah, Daniel Angus. 2018. Algorithmic brand culture: participatory labour, machine learning and branding on social media. Media Cult Soc. 40, 2: 178-194. http://dx.doi.org/10.1177/0163443718754648",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Atlanta, Georgia, USA. 1975–1984. http://dx.doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems, Aarhus, Denmark. 1–10. http://dx.doi.org/10.1145/1858171.1858173",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "[Steve Easterbrook. 2014. From computational thinking to systems thinking: A conceptual toolkit for sustainability computing. In Proceedings of the ICT for Sustainability 2014 (ICT4S'14), 235-244. http://dx.doi.org/10.2991/ict4s-14.2014.28",
      "doi": ""
    },
    {
      "text": "Johanne Mose Entwistle, Mia Kruse Rasmussen, Nervo Verdezoto, Robert S. Brewer, Mads Schaarup Andersen. 2015. Beyond the individual: The Contextual Wheel of Practice as a research framework for Sustainable HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, Seoul, Republic of Korea. 1125–1134. http://dx.doi.org/10.1145/2702123.2702232",
      "doi": "10.1145/2702123.2702232"
    },
    {
      "text": "Thomas Hylland Eriksen, Elisabeth Schober. 2017. Waste and the superfluous: an introduction. Soc Anthropol. 25, 3: 282-287. https://doi.org/10.1111/1469-8676.12422",
      "doi": ""
    },
    {
      "text": "Green Music Australia. 2019. Festival Littering. from https://www.greenmusic.org.au/cleaner_campsites_research",
      "doi": ""
    },
    {
      "text": "Green Music Australia. 2019. Party With The Planet. Retrieved 1 November, 2020 from https://www.partywiththeplanet.org",
      "doi": ""
    },
    {
      "text": "Murray R. Gregory. 2009. Environmental implications of plastic debris in marine settings—entanglement, ingestion, smothering, hangers-on, hitch-hiking and alien invasions. Philos. Trans. R. Soc. Lond., B, Biol. Sci. 364, 1526: 2013-2025. http://dx.doi.org/10.1098/rstb.2008.0265",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Fem Stud. 14, 3: 575-599. http://dx.doi.org/10.2307/3178066",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 2016. Staying with the Trouble: Making Kin in the Chthulucene. Duke University Press. Durham, NC http://dx.doi.org/10.1215/9780822373780",
      "doi": ""
    },
    {
      "text": "Dewi Jaimangal-Jones, Annette Pritchard, Nigel Morgan. 2010. Going the distance: locating journey, liminality and rites of passage in dance music experiences. 29, 3: 253-268. http://dx.doi.org/10.1080/02614361003749793",
      "doi": ""
    },
    {
      "text": "Giles Rhys Jones. 2015. Human Friendly Coordinates. 18, 5: 10-12.",
      "doi": ""
    },
    {
      "text": "Phillip Jones, North Byron Parklands Cultural Events Site: Environmental Impact Statement, 2017, pjep environmental planning pty ltd.",
      "doi": ""
    },
    {
      "text": "Bran Knowles, Oliver Bates, Maria Håkansson. 2018. This changes Sustainable HCI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, Montreal QC, Canada. Paper 471. http://dx.doi.org/10.1145/3173574.3174045",
      "doi": "10.1145/3173574.3174045"
    },
    {
      "text": "Kari Kuutti, Liam J. Bannon. 2014. The turn to practice in HCI: towards a research agenda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Toronto, Ontario, Canada. 3543-3552. http://dx.doi.org/10.1145/2556288.2557111",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Jennifer Laing, Warwick Frost. 2010. How green was my festival: Exploring challenges and opportunities associated with staging green events. Int J Hosp Manag. 29, 2: 261-267. https://doi.org/10.1016/j.ijhm.2009.10.009",
      "doi": ""
    },
    {
      "text": "Ann Light, Eric Kasper, Sabine Hielscher. 2020. Wicked solutions: SDGs, research design and the “unfinishedness” of sustainability. SocArXiv. http://dx.doi.org/10.31235/osf.io/m948c",
      "doi": ""
    },
    {
      "text": "Ann Light, Alison Powell, Irina Shklovski. 2017. Design for existential crisis in the Anthropocene age. In Proceedings of the 8th International Conference on Communities and Technologies, Troyes, France. 270–279. http://dx.doi.org/10.1145/3083671.3083688",
      "doi": "10.1145/3083671.3083688"
    },
    {
      "text": "macrotrends. 2022. Live Nation Entertainment Net Worth 2010-2022 | LYV. Retrieved 9 September, 2022 from https://www.macrotrends.net/stocks/charts/LYV/live-nation-entertainment/net-worth",
      "doi": ""
    },
    {
      "text": "Judith Mair, Jennifer Laing. 2012. The greening of music festivals: motivations, barriers and outcomes. Applying the Mair and Jago model. J Sustain Tour. 20, 5: 683-700. http://dx.doi.org/10.1080/09669582.2011.636819",
      "doi": ""
    },
    {
      "text": "Simone Manfredi, Davide Tonini, Thomas H. Christensen, Heijo Scharff. 2009. Landfilling of waste: accounting of greenhouse gases and global warming contributions. Waste Manag Res. 27, 8: 825-836. http://dx.doi.org/10.1177/0734242X09348529",
      "doi": ""
    },
    {
      "text": "Marco Martuzzi, Francesco Mitis, Francesco Forastiere. 2010. Inequalities, inequities, environmental justice in waste management and health. Eur J Public Health. 20, 1: 21-26. http://dx.doi.org/10.1093/eurpub/ckp216",
      "doi": ""
    },
    {
      "text": "Teresa Moore. 2019. Campsite Waste – A Single-Use Plastics Problem. Retrieved 2 February 2021 from https://www.festivalinsights.com/2019/02/campsite-waste-single-use-plastics-problem/",
      "doi": ""
    },
    {
      "text": "Mullum Cares. 2016. Mullum Cares. from https://mullumcares.com.au/",
      "doi": ""
    },
    {
      "text": "María Puig de la Bellacasa. 2017. Matters of Care: Speculative Ethics in More than Human Worlds. University of Minnesota Press. Minneapolis",
      "doi": ""
    },
    {
      "text": "Tomoyuki Shibata, James L. Wilson, Lindsey M. Watson, Ivan V. Nikitin, Ansariadi, Ruslan La Ane, Alimin Maidin. 2015. Life in a landfill slum, children's health, and the Millennium Development Goals. Sci Total Environ. 536, 408-418. https://doi.org/10.1016/j.scitotenv.2015.05.137",
      "doi": ""
    },
    {
      "text": "M. Six Silberman, Lisa Nathan, Bran Knowles, Roy Bendor, Adrian Clear, Maria Håkansson, Tawanna Dillahunt, Jennifer Mankoff. 2014. Next steps for sustainable HCI. interactions. 21, 5: 66–69. http://dx.doi.org/10.1145/2651820",
      "doi": "10.1145/2651820"
    },
    {
      "text": "Yolande Strengers. 2014. Smart energy in everyday life: are you designing for resource man? Interactions. 21, 4: 24–31. http://dx.doi.org/10.1145/2621931",
      "doi": "10.1145/2621931"
    },
    {
      "text": "Lucy A. Suchman. 2002. Practice-based design of information systems: Notes from the hyperdeveloped world. The Information Society. 18, 2: 139-144. http://dx.doi.org/10.1080/01972240290075066",
      "doi": ""
    },
    {
      "text": "Robin Tennant-Wood. 2003. Going for zero: A comparative critical analysis of zero waste events in southern New South Wales. Australas J Environ Manag. 10, 1: 46-55. http://dx.doi.org/10.1080/14486563.2003.10648572",
      "doi": ""
    },
    {
      "text": "The Planting Festival. 2018. The Planting. Retrieved 10 September, 2021 from https://theplantingfestival.com/the-festival/about/",
      "doi": ""
    },
    {
      "text": "Daniel Welch. 2017. Behaviour change and theories of practice: Contributions, limitations and developments Social Business. 7, 3-4: 241-261. http://dx.doi.org/10.1362/204440817X15108539431488",
      "doi": ""
    }
  ]
}