{
  "doi": "10.1145/3544548.3581415",
  "title": "Take My Hand: Automated Hand-Based Spatial Guidance for the Visually Impaired",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Tasks that involve locating objects and then moving hands to those specific locations, such as using touchscreens or grabbing objects on a desk, are challenging for the visually impaired. Over the years, audio guidance and haptic feedback have been a staple in hand navigation based assistive technologies. However, these methods require the user to interpret the generated directional cues and then manually perform the hand motions. In this paper, we present automated hand-based spatial guidance to bridge the gap between guidance and execution, allowing visually impaired users to move their hands between two points automatically, without any manual effort. We implement this concept through FingerRover, an on-finger miniature robot that carries the user’s finger to target points. We demonstrate the potential applications that can benefit from automated hand-based spatial guidance. Our user study shows the potential of our technique in improving the interaction capabilities of people with visual impairments.",
  "tags": [
    "visual impairment",
    "spatial guidance",
    "accessibility",
    "miniature guiding robot",
    "automated guidance"
  ],
  "authors": [
    {
      "name": "Adil Rahman",
      "institution": "Department of Computer Science, University of Virginia, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660629409",
      "orcid": "0000-0002-1620-5268"
    },
    {
      "name": "Md Aashikur Rahman Azim",
      "institution": "Department of Computer Science, University of Virginia, United States",
      "img": "/do/10.1145/contrib-99660232890/rel-imgonly/imgs5207.jpg",
      "acmid": "99660232890",
      "orcid": "0000-0001-9744-8263"
    },
    {
      "name": "Seongkook Heo",
      "institution": "Department of Computer Science, University of Virginia, United States",
      "img": "/do/10.1145/contrib-81484643096/rel-imgonly/81484643096.jpg",
      "acmid": "81484643096",
      "orcid": "0000-0003-2004-4812"
    }
  ],
  "references": [
    {
      "text": "Dragan Ahmetovic, Cole Gleason, Chengxiong Ruan, Kris Kitani, Hironobu Takagi, and Chieko Asakawa. 2016. NavCog: a navigational cognitive assistant for the blind. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 90–99. https://doi.org/10.1145/2935334.2935361",
      "doi": "10.1145/2935334.2935361"
    },
    {
      "text": "Dragan Ahmetovic, Daisuke Sato, Uran Oh, Tatsuya Ishihara, Kris Kitani, and Chieko Asakawa. 2020. ReCog: Supporting Blind People in Recognizing Personal Objects. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376143",
      "doi": "10.1145/3313831.3376143"
    },
    {
      "text": "Ahmad H. Alghadir, Abdullah Z. Alotaibi, and Zaheen A. Iqbal. 2019. Postural stability in people with visual impairment. Brain and Behavior 9, 11 (2019), e01436. https://doi.org/10.1002/brb3.1436 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/brb3.1436.",
      "doi": ""
    },
    {
      "text": "Toshio Asano and Yutaka Ishibashi. 2007. A remote haptic painting lesson system. In Multimedia Systems and Applications X, Vol. 6777. SPIE, Boston, MA, USA, 295–302. https://doi.org/10.1117/12.746340",
      "doi": ""
    },
    {
      "text": "Sandra Bardot, Marcos Serrano, and Christophe Jouffrais. 2016. From Tactile to Virtual: Using a Smartwatch to Improve Spatial Map Exploration for Visually Impaired Users. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 100–111. https://doi.org/10.1145/2935334.2935342",
      "doi": "10.1145/2935334.2935342"
    },
    {
      "text": "Ulf Berglund and Birgitta Berglund. 1970. Adaptation and recovery in vibrotactile perception. Perceptual and motor skills 30, 3 (1970), 843–853.",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: Nearly Real-Time Answers to Visual Questions. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (New York, New York, USA) (UIST ’10). Association for Computing Machinery, New York, NY, USA, 333–342. https://doi.org/10.1145/1866029.1866080",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Anke Brock, Slim Kammoun, Marc Macé, and Christophe Jouffrais. 2014. Using wrist vibrations to guide hand movement and whole body navigation. i-com 13, 3 (2014), 19–28.",
      "doi": ""
    },
    {
      "text": "Z. Cao, G. Hidalgo, T. Simon, S. Wei, and Y. Sheikh. 2021. OpenPose: Realtime Multi-Person 2D Pose Estimation Using Part Affinity Fields. IEEE Transactions on Pattern Analysis & Machine Intelligence 43, 01 (jan 2021), 172–186. https://doi.org/10.1109/TPAMI.2019.2929257",
      "doi": "10.1109/TPAMI.2019.2929257"
    },
    {
      "text": "Elyse D. Z. Chase, Alexa Fay Siu, Abena Boadi-Agyemang, Gene S-H Kim, Eric J Gonzalez, and Sean Follmer. 2020. PantoGuide: A Haptic and Audio Guidance System To Support Tactile Graphics Exploration. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’20). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3373625.3418023",
      "doi": "10.1145/3373625.3418023"
    },
    {
      "text": "SeungA Chung, Kyungyeon Lee, and Uran Oh. 2020. Investigating three-dimensional directional guidance with nonvisual feedback for target pointing task. In 2020 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). IEEE, IEEE, Recife, Brazil, 206–210.",
      "doi": ""
    },
    {
      "text": "Akansel Cosgun, E. Akin Sisbot, and Henrik I. Christensen. 2014. Evaluation of rotational and directional vibration patterns on a tactile belt for guiding visually impaired people. In 2014 IEEE Haptics Symposium (HAPTICS). IEEE, Houston, TX, USA, 367–370. https://doi.org/10.1109/HAPTICS.2014.6775483 ISSN: 2324-7355.",
      "doi": ""
    },
    {
      "text": "Artem Dementyev, Hsin-Liu (Cindy) Kao, Inrak Choi, Deborah Ajilo, Maggie Xu, Joseph A. Paradiso, Chris Schmandt, and Sean Follmer. 2016. Rovables: Miniature On-Body Robots as Mobile Wearables. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 111–120. https://doi.org/10.1145/2984511.2984531",
      "doi": "10.1145/2984511.2984531"
    },
    {
      "text": "Julie Ducasse, Marc Macé, Bernard Oriola, and Christophe Jouffrais. 2018. BotMap: Non-visual panning and zooming with an actuated tabletop tangible interface. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 4(2018), 1–42.",
      "doi": "10.1145/3204460"
    },
    {
      "text": "Tim Duente, Max Pfeiffer, and Michael Rohs. 2017. Zap++: A 20-Channel Electrical Muscle Stimulation System for Fine-Grained Wearable Force Feedback. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (Vienna, Austria) (MobileHCI ’17). Association for Computing Machinery, New York, NY, USA, Article 1, 13 pages. https://doi.org/10.1145/3098279.3098546",
      "doi": "10.1145/3098279.3098546"
    },
    {
      "text": "Shirin Feiz, Syed Masum Billah, Vikas Ashok, Roy Shilkrot, and IV Ramakrishnan. 2019. Towards Enabling Blind People to Independently Write on Printed Forms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300530",
      "doi": "10.1145/3290605.3300530"
    },
    {
      "text": "Sergio Garrido-Jurado, Rafael Muñoz-Salinas, Francisco José Madrid-Cuevas, and Manuel Jesús Marín-Jiménez. 2014. Automatic generation and detection of highly reliable fiducial markers under occlusion. Pattern Recognition 47, 6 (June 2014), 2280–2292. https://doi.org/10.1016/j.patcog.2014.01.005",
      "doi": "10.1016/j.patcog.2014.01.005"
    },
    {
      "text": "Simon L. Gay, Edwige Pissaloux, Katerine Romeo, and Ngoc-Tan Truong. 2021. F2T: A Novel Force-Feedback Haptic Architecture Delivering 2D Data to Visually Impaired People. IEEE Access 9(2021), 94901–94911. https://doi.org/10.1109/ACCESS.2021.3091441",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Xiang ’Anthony’ Chen, Haoran Qi, Samuel White, Suman Ghosh, Chieko Asakawa, and Jeffrey P. Bigham. 2016. VizLens: A Robust and Interactive Screen Reader for Interfaces in the Real World. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(UIST ’16). Association for Computing Machinery, New York, NY, USA, 651–664. https://doi.org/10.1145/2984511.2984518",
      "doi": "10.1145/2984511.2984518"
    },
    {
      "text": "Anhong Guo, Junhan Kong, Michael Rivera, Frank F. Xu, and Jeffrey P. Bigham. 2019. StateLens: A Reverse Engineering Solution for Making Existing Dynamic Touchscreens Accessible. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 371–385. https://doi.org/10.1145/3332165.3347873",
      "doi": "10.1145/3332165.3347873"
    },
    {
      "text": "Jonggi Hong, Alisha Pradhan, Jon E. Froehlich, and Leah Findlater. 2017. Evaluating Wrist-Based Haptic Feedback for Non-Visual Target Finding and Path Tracing on a 2D Surface. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 210–219. https://doi.org/10.1145/3132525.3132538",
      "doi": "10.1145/3132525.3132538"
    },
    {
      "text": "Jonggi Hong, Lee Stearns, Jon Froehlich, David Ross, and Leah Findlater. 2016. Evaluating Angular Accuracy of Wrist-based Haptic Directional Guidance for Hand Movement. In Proceedings of the 42nd Graphics Interface Conference(GI ’16). Canadian Human-Computer Communications Society, Waterloo, CAN, 195–200.",
      "doi": "10.5555/3076132.3076170"
    },
    {
      "text": "Samantha Horvath, John Galeotti, Bing Wu, Roberta Klatzky, Mel Siegel, and George Stetten. 2014. FingerSight: Fingertip Haptic Sensing of the Visual Environment. IEEE Journal of Translational Engineering in Health and Medicine 2 (2014), 1–9. https://doi.org/10.1109/JTEHM.2014.2309343 Conference Name: IEEE Journal of Translational Engineering in Health and Medicine.",
      "doi": ""
    },
    {
      "text": "Felix Huppert, Gerold Hoelzl, and Matthias Kranz. 2021. GuideCopter - A Precise Drone-Based Haptic Guidance Interface for Blind or Visually Impaired People. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 218, 14 pages. https://doi.org/10.1145/3411764.3445676",
      "doi": "10.1145/3411764.3445676"
    },
    {
      "text": "Hyunki In, Brian Byunghyun Kang, MinKi Sin, and Kyu-Jin Cho. 2015. Exo-Glove: A Wearable Robot for the Hand with a Soft Tendon Routing System. IEEE Robotics Automation Magazine 22, 1 (March 2015), 97–105. https://doi.org/10.1109/MRA.2014.2362863 Conference Name: IEEE Robotics Automation Magazine.",
      "doi": ""
    },
    {
      "text": "Yutaka Ishibashi and Toshio Asano. 2007. Media synchronization control with prediction in a remote haptic calligraphy system. In Proceedings of the international conference on Advances in computer entertainment technology(ACE ’07). Association for Computing Machinery, New York, NY, USA, 79–86. https://doi.org/10.1145/1255047.1255063",
      "doi": "10.1145/1255047.1255063"
    },
    {
      "text": "Shaun K. Kane, Jeffrey P. Bigham, and Jacob O. Wobbrock. 2008. Slide rule: making mobile touch screens accessible to blind people using multi-touch interaction techniques. In Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility(Assets ’08). Association for Computing Machinery, New York, NY, USA, 73–80. https://doi.org/10.1145/1414471.1414487",
      "doi": "10.1145/1414471.1414487"
    },
    {
      "text": "Roberta L. Klatzky, James R. Marston, Nicholas A. Giudice, Reginald G. Golledge, and Jack M. Loomis. 2006. Cognitive load of navigating without vision when guided by virtual sound versus spatial language. Journal of Experimental Psychology: Applied 12, 4 (2006), 223–232. https://doi.org/10.1037/1076-898X.12.4.223 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Masaki Kuribayashi, Seita Kayukawa, Hironobu Takagi, Chieko Asakawa, and Shigeo Morishima. 2021. LineChaser: A Smartphone-Based Navigation System for Blind People to Stand in Lines. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 33, 13 pages. https://doi.org/10.1145/3411764.3445451",
      "doi": "10.1145/3411764.3445451"
    },
    {
      "text": "Guanhong Liu, Tianyu Yu, Chun Yu, Haiqing Xu, Shuchang Xu, Ciyuan Yang, Feng Wang, Haipeng Mi, and Yuanchun Shi. 2021. Tactile Compass: Enabling Visually Impaired People to Follow a Path with Continuous Directional Feedback. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 28, 13 pages. https://doi.org/10.1145/3411764.3445644",
      "doi": "10.1145/3411764.3445644"
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++: Allowing Objects to Communicate Dynamic Use. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2515–2524. https://doi.org/10.1145/2702123.2702128",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "Microsoft. 2010. Kinect for Windows - Windows apps. https://docs.microsoft.com/en-us/windows/apps/design/devices/kinect-for-windows",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, and Hiroshi Ishii. 2015. LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 333–339. https://doi.org/10.1145/2807442.2807452",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Romain Nith, Shan-Yuan Teng, Pengyu Li, Yujie Tao, and Pedro Lopes. 2021. DextrEMS: Increasing Dexterity in Electrical Muscle Stimulation by Combining It with Brakes. In The 34th Annual ACM Symposium on User Interface Software and Technology(Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 414–430. https://doi.org/10.1145/3472749.3474759",
      "doi": "10.1145/3472749.3474759"
    },
    {
      "text": "Joseph Redmon, Santosh Kumar Divvala, Ross B. Girshick, and Ali Farhadi. 2016. You Only Look Once: Unified, Real-Time Object Detection. In 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). IEEE Computer Society, Los Alamitos, CA, USA, 779–788. https://doi.org/10.1109/CVPR.2016.91",
      "doi": ""
    },
    {
      "text": "Izabela Rutkowska, Grzegorz Bednarczuk, Bartosz Molik, Natalia Morgulec-Adamowicz, Jolanta Marszałek, Kalina Kaźmierska-Kowalewska, and Krzysztof Koc. 2015. Balance Functional Assessment in People with Visual Impairment. Journal of Human Kinetics 48 (Jan. 2015), 99–109. https://doi.org/10.1515/hukin-2015-0096",
      "doi": ""
    },
    {
      "text": "Oscar Sandoval-Gonzalez, Juan Jacinto-Villegas, Ignacio Herrera-Aguilar, Otniel Portillo-Rodiguez, Paolo Tripicchio, Miguel Hernandez-Ramos, Agustín Flores-Cuautle, and Carlo Avizzano. 2016. Design and Development of a Hand Exoskeleton Robot for Active and Passive Rehabilitation. International Journal of Advanced Robotic Systems 13, 2 (March 2016), 66. https://doi.org/10.5772/62404 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Micaela Schmid, Antonio Nardone, Alessandro Marco De Nunzio, Monica Schmid, and Marco Schieppati. 2007. Equilibrium during static and dynamic tasks in blind subjects: no evidence of cross-modal plasticity. Brain 130, 8 (Aug. 2007), 2097–2107. https://doi.org/10.1093/brain/awm157",
      "doi": ""
    },
    {
      "text": "Meng-Li Shih, Yi-Chun Chen, Chia-Yu Tung, Cheng Sun, Ching-Ju Cheng, Liwei Chan, Srenivas Varadarajan, and Min Sun. 2018. Dlwv2: A deep learning-based wearable vision-system with vibrotactile-feedback for visually impaired people to reach objects. In 2018 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, IEEE, Madrid, Spain, 1–9.",
      "doi": "10.1109/IROS.2018.8593711"
    },
    {
      "text": "Roy Shilkrot, Jochen Huber, Wong Meng Ee, Pattie Maes, and Suranga Chandima Nanayakkara. 2015. FingerReader: A Wearable Device to Explore Printed Text on the Go. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 2363–2372. https://doi.org/10.1145/2702123.2702421",
      "doi": "10.1145/2702123.2702421"
    },
    {
      "text": "Mathieu Simonnet, Anke M Brock, Antonio Serpa, Bernard Oriola, and Christophe Jouffrais. 2019. Comparing interaction techniques to help blind people explore maps on small tactile devices. Multimodal Technologies and Interaction 3, 2 (2019), 27.",
      "doi": ""
    },
    {
      "text": "Patrick Slade, Arjun Tambe, and Mykel J. Kochenderfer. 2021. Multimodal sensing and intuitive steering assistance improve navigation and mobility for people with impaired vision. Science Robotics 6, 59 (2021), eabg6594. https://doi.org/10.1126/scirobotics.abg6594 arXiv:https://www.science.org/doi/pdf/10.1126/scirobotics.abg6594",
      "doi": ""
    },
    {
      "text": "Sony. 2022. Toy platform toio™ / Stories / Sony Design / Sony. https://www.sony.com/en/SonyInfo/design/stories/toio/ Online; accessed Aug 2022.",
      "doi": ""
    },
    {
      "text": "Lee Stearns, Ruofei Du, Uran Oh, Catherine Jou, Leah Findlater, David A. Ross, and Jon E. Froehlich. 2016. Evaluating Haptic and Auditory Directional Guidance to Assist Blind People in Reading Printed Text Using Finger-Mounted Cameras. ACM Transactions on Accessible Computing 9, 1 (Oct. 2016), 1:1–1:38. https://doi.org/10.1145/2914793",
      "doi": "10.1145/2914793"
    },
    {
      "text": "Ryo Suzuki, Clement Zheng, Yasuaki Kakehi, Tom Yeh, Ellen Yi-Luen Do, Mark D. Gross, and Daniel Leithinger. 2019. ShapeBots: Shape-Changing Swarm Robots. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 493–505. https://doi.org/10.1145/3332165.3347911",
      "doi": "10.1145/3332165.3347911"
    },
    {
      "text": "Saiganesh Swaminathan, Thijs Roumen, Robert Kovacs, David Stangl, Stefanie Mueller, and Patrick Baudisch. 2016. Linespace: A Sensemaking Platform for the Blind. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2175–2185. https://doi.org/10.1145/2858036.2858245",
      "doi": "10.1145/2858036.2858245"
    },
    {
      "text": "Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. 2011. PossessedHand: Techniques for Controlling Human Hands Using Electrical Muscles Stimuli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 543–552. https://doi.org/10.1145/1978942.1979018",
      "doi": "10.1145/1978942.1979018"
    },
    {
      "text": "Yudai Tanaka, Jun Nishida, and Pedro Lopes. 2022. Electrical Head Actuation: Enabling Interactive Systems to Directly Manipulate Head Orientation. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 262, 15 pages. https://doi.org/10.1145/3491102.3501910",
      "doi": "10.1145/3491102.3501910"
    },
    {
      "text": "Sensable Technologies. 2003. “Phantom Omni” – 6 DOF master device | Delft Haptics Lab. https://delfthapticslab.nl/device/phantom-omni/ Online; accessed Aug 2022.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2018. Unity’s AR Foundation Framework | Cross platform augmented reality development software | Unity. https://unity.com/unity/features/arfoundation",
      "doi": ""
    },
    {
      "text": "Kaveri Thakoor, Nii Mante, Carey Zhang, Christian Siagian, James Weiland, Laurent Itti, and Gérard Medioni. 2015. A System for Assisting the Visually Impaired in Localization and Grasp of Desired Objects. In Computer Vision - ECCV 2014 Workshops(Lecture Notes in Computer Science), Lourdes Agapito, Michael M. Bronstein, and Carsten Rother (Eds.). Springer International Publishing, Cham, 643–657. https://doi.org/10.1007/978-3-319-16199-0_45",
      "doi": ""
    },
    {
      "text": "Nelson Daniel Troncoso Aldas, Sooyeon Lee, Chonghan Lee, Mary Beth Rosson, John M. Carroll, and Vijaykrishnan Narayanan. 2020. AIGuide: An Augmented Reality Hand Guidance Application for People with Visual Impairments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3373625.3417028",
      "doi": "10.1145/3373625.3417028"
    },
    {
      "text": "Ultraleap. 2013. Tracking | Leap Motion Controller | Ultraleap. https://www.ultraleap.com/product/leap-motion-controller/ Online; accessed Aug 2022.",
      "doi": ""
    },
    {
      "text": "Bernhard Weber, Simon Schätzle, Thomas Hulin, Carsten Preusche, and Barbara Deml. 2011. Evaluation of a vibrotactile feedback device for spatial guidance. In 2011 IEEE World Haptics Conference. IEEE, Istanbul, Turkey, 349–354. https://doi.org/10.1109/WHC.2011.5945511",
      "doi": ""
    },
    {
      "text": "Zihan Wu, Chun Yu, Xuhai Xu, Tong Wei, Tianyuan Zou, Ruolin Wang, and Yuanchun Shi. 2021. LightWrite: Teach Handwriting to The Visually Impaired with A Smartphone. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 32, 15 pages. https://doi.org/10.1145/3411764.3445322",
      "doi": "10.1145/3411764.3445322"
    },
    {
      "text": "Zhixuan Yu, Samantha J. Horvath, Alexandra Delazio, Jihang Wang, Rebeka Almasi, Roberta Klatzky, John Galeotti, and George D. Stetten. 2016. PalmSight: an assistive technology helping the blind to locate and grasp objects. Technical Report CMU-RI-TR-16-59. Carnegie Mellon University, Pittsburgh, PA.",
      "doi": ""
    },
    {
      "text": "Fan Zhang, Valentin Bazarevsky, Andrey Vakunov, Andrei Tkachenka, George Sung, Chuo-Ling Chang, and Matthias Grundmann. 2020. MediaPipe Hands: On-device Real-time Hand Tracking. arxiv:2006.10214 [cs.CV]",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Elizabeth Kupferstein, Hathaitorn Rojnirun, Leah Findlater, and Shiri Azenkot. 2020. The Effectiveness of Visual and Audio Wayfinding Guidance on Smartglasses for People with Low Vision. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376516",
      "doi": "10.1145/3313831.3376516"
    },
    {
      "text": "Peter A Zientara, Sooyeon Lee, Gus H Smith, Rorry Brenner, Laurent Itti, Mary B Rosson, John M Carroll, Kevin M Irick, and Vijaykrishnan Narayanan. 2017. Third eye: A shopping assistant for the visually impaired. Computer 50, 2 (2017), 16–24.",
      "doi": "10.1109/MC.2017.36"
    }
  ]
}