{
  "doi": "10.1145/3544548.3581381",
  "title": "ChameleonControl: Teleoperating Real Human Surrogates through Mixed Reality Gestural Guidance for Remote Hands-on Classrooms",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "We present ChameleonControl, a real-human teleoperation system for scalable remote instruction in hands-on classrooms. In contrast to existing video or AR/VR-based remote hands-on education, ChameleonControl uses a real human as a surrogate of a remote instructor. Building on existing human-based telepresence approaches, we contribute a novel method to teleoperate a human surrogate through synchronized mixed reality hand gestural navigation and verbal communication. By overlaying the remote instructor’s virtual hands in the local user’s MR view, the remote instructor can guide and control the local user as if they were physically present. This allows the local user/surrogate to synchronize their hand movements and gestures with the remote instructor, effectively teleoperating a real human. We deploy and evaluate our system in classrooms of physiotherapy training, as well as other application domains such as mechanical assembly, sign language and cooking lessons. The study results confirm that our approach can increase engagement and the sense of co-presence, showing potential for the future of remote hands-on classrooms.",
  "tags": [
    "Remote Guidance",
    "Human Surrogates",
    "Telepresence",
    "Remote Collaboration",
    "Visual Cue",
    "Hands-on Training",
    "Mixed Reality"
  ],
  "authors": [
    {
      "name": "Mehrad Faridan",
      "institution": "University of Calgary, Canada and MaKami College, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660630087",
      "orcid": "0000-0001-6699-0455"
    },
    {
      "name": "Bheesha Kumari",
      "institution": "University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778403",
      "orcid": "0000-0002-1136-1747"
    },
    {
      "name": "Ryo Suzuki",
      "institution": "University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659155646",
      "orcid": "0000-0003-3294-9555"
    }
  ],
  "references": [
    {
      "text": "Sigurdur Orn Adalgeirsson and Cynthia Breazeal. 2010. MeBot: A robotic platform for socially embodied telepresence. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 15–22.",
      "doi": ""
    },
    {
      "text": "Matt Adcock, Stuart Anderson, and Bruce Thomas. 2013. RemoteFusion: real time depth camera fusion for remote collaboration on physical tasks. In Proceedings of the 12th ACM SIGGRAPH international conference on virtual-reality continuum and its applications in industry. 235–242.",
      "doi": "10.1145/2534329.2534331"
    },
    {
      "text": "Huidong Bai, Prasanth Sasikumar, Jing Yang, and Mark Billinghurst. 2020. A user study on mixed reality remote collaboration with eye gaze and hand gesture sharing. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376550"
    },
    {
      "text": "Dawi Karomati Baroroh, Chih-Hsing Chu, and Lihui Wang. 2021. Systematic literature review on augmented reality in smart manufacturing: Collaboration between human and computational intelligence. Journal of Manufacturing Systems 61 (2021), 696–711.",
      "doi": ""
    },
    {
      "text": "Minghao Cai, Soh Masuko, and Jiro Tanaka. 2018. Shopping together: a remote co-shopping system utilizing spatial gesture interaction. In International Conference on Human-Computer Interaction. Springer, 219–232.",
      "doi": "10.1007/978-3-319-91250-9_17"
    },
    {
      "text": "Minghao Cai and Jiro Tanaka. 2019. Go together: providing nonverbal awareness cues to enhance co-located sensation in remote communication. Human-centric computing and information sciences 9, 1 (2019), 1–25.",
      "doi": ""
    },
    {
      "text": "Yuanzhi Cao, Anna Fuste, and Valentin Heun. 2022. MobileTutAR: a Lightweight Augmented Reality Tutorial System using Spatially Situated Human Segmentation Videos. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–8.",
      "doi": "10.1145/3491101.3519639"
    },
    {
      "text": "Yuanzhi Cao, Xun Qian, Tianyi Wang, Rachel Lee, Ke Huo, and Karthik Ramani. 2020. An exploratory study of augmented reality presence for tutoring machine tasks. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376688"
    },
    {
      "text": "Sicheng Chen, Miao Chen, Andreas Kunz, Asim Evren Yantaç, Mathias Bergmark, Anders Sundin, and Morten Fjeld. 2013. SEMarbeta: mobile sketch-gesture-video remote support for car drivers. In Proceedings of the 4th Augmented Human International Conference. 69–76.",
      "doi": "10.1145/2459236.2459249"
    },
    {
      "text": "Subramanian Chidambaram, Hank Huang, Fengming He, Xun Qian, Ana M Villanueva, Thomas S Redick, Wolfgang Stuerzlinger, and Karthik Ramani. 2021. Processar: An augmented reality-based tool to create in-situ procedural 2d/3d ar instructions. In Designing Interactive Systems Conference 2021. 234–249.",
      "doi": "10.1145/3461778.3462126"
    },
    {
      "text": "Hasan Shahid Ferdous, Thuong Hoang, Zaher Joukhadar, Martin N Reinoso, Frank Vetere, David Kelly, and Louisa Remedios. 2019. \"What’s Happening at that Hip?\" Evaluating an On-body Projection based Augmented Reality System for Physiotherapy Classroom. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300464"
    },
    {
      "text": "Charith Lasantha Fernando, Masahiro Furukawa, Tadatoshi Kurogi, Sho Kamuro, Kouta Minamizawa, Susumu Tachi, 2012. Design of TELESAR V for transferring bodily consciousness in telexistence. In 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 5112–5118.",
      "doi": ""
    },
    {
      "text": "Markus Funk, Thomas Kosch, and Albrecht Schmidt. 2016. Interactive worker assistance: comparing the effects of in-situ projection, head-mounted displays, tablet, and paper instructions. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 934–939.",
      "doi": "10.1145/2971648.2971706"
    },
    {
      "text": "Markus Funk, Lars Lischke, Sven Mayer, Alireza Sahami Shirazi, and Albrecht Schmidt. 2018. Teach me how! interactive assembly instructions using demonstration and in-situ projection. In Assistive Augmentation. Springer, 49–73.",
      "doi": ""
    },
    {
      "text": "David Furió, Stéphanie Fleck, Bruno Bousquet, Jean-Paul Guillet, Lionel Canioni, and Martin Hachet. 2017. Hobit: Hybrid optical bench for innovative teaching. In Proceedings of the 2017 chi conference on human factors in computing systems. 949–959.",
      "doi": "10.1145/3025453.3025789"
    },
    {
      "text": "Susan R Fussell, Robert E Kraut, and Jane Siegel. 2000. Coordination of communication: Effects of shared visual context on collaborative work. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. 21–30.",
      "doi": "10.1145/358916.358947"
    },
    {
      "text": "Susan R Fussell, Leslie D Setlock, and Robert E Kraut. 2003. Effects of head-mounted and scene-oriented video systems on remote collaboration on physical tasks. In Proceedings of the SIGCHI conference on Human factors in computing systems. 513–520.",
      "doi": "10.1145/642611.642701"
    },
    {
      "text": "Lei Gao, Huidong Bai, Mark Billinghurst, and Robert W Lindeman. 2020. User Behaviour Analysis of Mixed Reality Remote Collaboration with a Hybrid View Interface. In 32nd Australian Conference on Human-Computer Interaction. 629–638.",
      "doi": "10.1145/3441000.3441038"
    },
    {
      "text": "Danilo Gasques, Janet G Johnson, Tommy Sharkey, Yuanyuan Feng, Ru Wang, Zhuoqun Robin Xu, Enrique Zavala, Yifei Zhang, Wanze Xie, Xinming Zhang, 2021. ARTEMIS: A collaborative mixed-reality system for immersive surgical telementoring. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445576"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Höllerer. 2014. In touch with the remote world: Remote collaboration with augmented reality drawings and virtual navigation. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology. 197–205.",
      "doi": "10.1145/2671015.2671016"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Höllerer. 2014. World-stabilized annotations and virtual scene navigation for remote collaboration. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 449–459.",
      "doi": "10.1145/2642918.2647372"
    },
    {
      "text": "Ken Goldberg, Dezhen Song, Y Khor, David Pescovitz, Anthony Levandowski, J Himmelstein, Janice Shih, Annamarie Ho, Eric Paulos, and J Donath. 2002. Collaborative online teleoperation with spatial dynamic voting and a human\" Tele-Actor\". In Proceedings 2002 IEEE International Conference on Robotics and Automation (Cat. No. 02CH37292), Vol. 2. IEEE, 1179–1184.",
      "doi": ""
    },
    {
      "text": "Jiangtao Gong, Teng Han, Siling Guo, Jiannan Li, Siyu Zha, Liuxin Zhang, Feng Tian, Qianying Wang, and Yong Rui. 2021. HoloBoard: a Large-format Immersive Teaching Board based on pseudo HoloGraphics. In The 34th Annual ACM Symposium on User Interface Software and Technology. 441–456.",
      "doi": "10.1145/3472749.3474761"
    },
    {
      "text": "Kunal Gupta, Gun A Lee, and Mark Billinghurst. 2016. Do you see what I see? The effect of gaze tracking on task space remote collaboration. IEEE transactions on visualization and computer graphics 22, 11(2016), 2413–2422.",
      "doi": "10.1109/TVCG.2016.2593778"
    },
    {
      "text": "Ping-Hsuan Han, Yang-Sheng Chen, Yilun Zhong, Han-Lei Wang, and Yi-Ping Hung. 2017. My Tai-Chi coaches: an augmented-learning tool for practicing Tai-Chi Chuan. In Proceedings of the 8th Augmented Human International Conference. 1–4.",
      "doi": "10.1145/3041164.3041194"
    },
    {
      "text": "Shin Hanagata and Yasuaki Kakehi. 2018. Paralogue: A remote conversation system using a hand avatar which postures are controlled with electrical muscle stimulation. In Proceedings of the 9th Augmented Human International Conference. 1–3.",
      "doi": "10.1145/3174910.3174951"
    },
    {
      "text": "Daniel Hawkins and Carman Neustaedter. 2016. The limitations of video-based telemedicine systems.",
      "doi": ""
    },
    {
      "text": "Zhenyi He, Ruofei Du, and Ken Perlin. 2020. Collabovr: A reconfigurable framework for creative collaboration in virtual reality. In 2020 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 542–554.",
      "doi": ""
    },
    {
      "text": "Steven J Henderson and Steven K Feiner. 2007. Augmented reality for maintenance and repair (armar). Technical Report. Columbia Univ New York Dept of Computer Science.",
      "doi": ""
    },
    {
      "text": "Keita Higuch, Ryo Yonetani, and Yoichi Sato. 2016. Can eye help you? Effects of visualizing eye fixations on remote collaboration scenarios for physical tasks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5180–5190.",
      "doi": "10.1145/2858036.2858438"
    },
    {
      "text": "Ronan Hinchet, Velko Vechev, Herbert Shea, and Otmar Hilliges. 2018. Dextres: Wearable haptic feedback for grasping in vr via a thin form-factor electrostatic brake. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 901–912.",
      "doi": "10.1145/3242587.3242657"
    },
    {
      "text": "Thuong Hoang, Martin Reinoso, Zaher Joukhadar, Frank Vetere, and David Kelly. 2017. Augmented studio: Projection mapping on moving body for physiotherapy education. In Proceedings of the 2017 CHI conference on human factors in computing systems. 1419–1430.",
      "doi": "10.1145/3025453.3025860"
    },
    {
      "text": "Gaoping Huang, Xun Qian, Tianyi Wang, Fagun Patel, Maitreya Sreeram, Yuanzhi Cao, Karthik Ramani, and Alexander J Quinn. 2021. Adaptutar: An adaptive tutoring system for machine tasks in augmented reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445283"
    },
    {
      "text": "Weidong Huang, Leila Alem, Franco Tecchia, and Henry Been-Lirn Duh. 2018. Augmented 3D hands: a gesture-based mixed reality system for distributed collaboration. Journal on Multimodal User Interfaces 12, 2 (2018), 77–89.",
      "doi": ""
    },
    {
      "text": "Weidong Huang, Seungwon Kim, Mark Billinghurst, and Leila Alem. 2019. Sharing hand gesture and sketch cues in remote collaboration. Journal of Visual Communication and Image Representation 58 (2019), 428–438.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Minoru Kobayashi. 1992. Clearboard: A seamless medium for shared drawing and conversation with eye contact. In Proceedings of the SIGCHI conference on Human factors in computing systems. 525–532.",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Shahram Jalaliniya, Thomas Pederson, and Steven Houben. 2014. Wearable laser pointer versus head-mounted display for tele-guidance applications?. In Proceedings of the 2014 ACM International Symposium on Wearable Computers: Adjunct Program. 193–200.",
      "doi": "10.1145/2641248.2641354"
    },
    {
      "text": "Brennan Jones, Yaying Zhang, Priscilla NY Wong, and Sean Rintel. 2020. Vroom: virtual robot overlay for online meetings. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3334480.3382820"
    },
    {
      "text": "Brennan Jones, Yaying Zhang, Priscilla NY Wong, and Sean Rintel. 2021. Belonging there: VROOM-ing into the uncanny valley of XR telepresence. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–31.",
      "doi": "10.1145/3449133"
    },
    {
      "text": "Shunichi Kasahara and Jun Rekimoto. 2015. JackIn head: immersive visual telepresence system with omnidirectional wearable camera for remote collaboration. In Proceedings of the 21st ACM symposium on virtual reality software and technology. 217–225.",
      "doi": "10.1145/2821592.2821608"
    },
    {
      "text": "Tadakazu Kashiwabara, Hirotaka Osawa, Kazuhiko Shinozawa, and Michita Imai. 2012. TEROOS: a wearable avatar to enhance joint activities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2001–2004.",
      "doi": "10.1145/2207676.2208345"
    },
    {
      "text": "Seungwon Kim, Allison Jing, Hanhoon Park, Soo-hyung Kim, Gun Lee, and Mark Billinghurst. 2020. Use of Gaze and Hand Pointers in Mixed Reality Remote Collaboration. In The 9th International Conference on Smart Media and Applications. SMA, Jeju, Republic of Korea. 1–6.",
      "doi": ""
    },
    {
      "text": "Seungwon Kim, Gun Lee, Mark Billinghurst, and Weidong Huang. 2020. The combination of visual communication cues in mixed reality remote collaboration. Journal on Multimodal User Interfaces 14, 4 (2020), 321–335.",
      "doi": ""
    },
    {
      "text": "Seungwon Kim, Gun Lee, Weidong Huang, Hayun Kim, Woontack Woo, and Mark Billinghurst. 2019. Evaluating the combination of visual communication cues for HMD-based mixed reality remote collaboration. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300403"
    },
    {
      "text": "David Kirk, Tom Rodden, and Danaë Stanton Fraser. 2007. Turn it this way: grounding collaborative action with remote gestures. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 1039–1048.",
      "doi": "10.1145/1240624.1240782"
    },
    {
      "text": "Hideaki Kuzuoka, Toshio Kosuge, and Masatomo Tanaka. 1994. GestureCam: A video communication system for sympathetic remote collaboration. In Proceedings of the 1994 ACM conference on Computer supported cooperative work. 35–43.",
      "doi": "10.1145/192844.192866"
    },
    {
      "text": "Hideaki Kuzuoka, Shinya Oyama, Keiichi Yamazaki, Kenji Suzuki, and Mamoru Mitsuishi. 2000. GestureMan: A mobile robot that embodies a remote instructor’s actions. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. 155–162.",
      "doi": "10.1145/358916.358986"
    },
    {
      "text": "Khanh-Duy Le, Kening Zhu, and Morten Fjeld. 2017. MirrorTablet: exploring a low-cost mobile system for capturing unmediated hand gestures in remote collaboration. In Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia. 79–89.",
      "doi": "10.1145/3152832.3152838"
    },
    {
      "text": "Gun A Lee, Seungjun Ahn, William Hoff, and Mark Billinghurst. 2020. Enhancing first-person view task instruction videos with augmented reality cues. In 2020 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 498–508.",
      "doi": ""
    },
    {
      "text": "Gun A Lee, Theophilus Teo, Seungwon Kim, and Mark Billinghurst. 2017. Mixed reality collaboration through sharing a live panorama. In SIGGRAPH Asia 2017 Mobile Graphics & Interactive Applications. 1–4.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee and Leila Takayama. 2011. \"Now, i have a body\" uses and social norms for mobile remote presence in the workplace. In Proceedings of the SIGCHI conference on human factors in computing systems. 33–42.",
      "doi": "10.1145/1978942.1978950"
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal, and Hiroshi Ishii. 2014. Physical telepresence: shape capture and display for embodied, computer-mediated remote collaboration. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 461–470.",
      "doi": "10.1145/2642918.2647377"
    },
    {
      "text": "Jiannan Li, Maurício Sousa, Chu Li, Jessie Liu, Yan Chen, Ravin Balakrishnan, and Tovi Grossman. 2022. ASTEROIDS: Exploring Swarms of Mini-Telepresence Robots for Physical Skill Demonstration. In CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++ allowing objects to communicate dynamic use. In Proceedings of the 33rd annual acm conference on human factors in computing systems. 2515–2524.",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "Akira Matsuda, Kazunori Nozawa, Kazuki Takata, Atsushi Izumihara, and Jun Rekimoto. 2020. HapticPointer: A neck-worn device that presents direction by vibrotactile feedback for remote collaboration tasks. In Proceedings of the Augmented Humans International Conference. 1–10.",
      "doi": "10.1145/3384657.3384777"
    },
    {
      "text": "Kana Misawa, Yoshio Ishiguro, and Jun Rekimoto. 2012. Livemask: A telepresence surrogate system with a face-shaped screen for supporting nonverbal communication. In Proceedings of the international working conference on advanced visual interfaces. 394–397.",
      "doi": "10.1145/2254556.2254632"
    },
    {
      "text": "Kana Misawa and Jun Rekimoto. 2015. Chameleonmask: Embodied physical and social telepresence using human surrogates. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 401–411.",
      "doi": "10.1145/2702613.2732506"
    },
    {
      "text": "Kana Misawa and Jun Rekimoto. 2015. Wearing another’s personality: A human-surrogate system with a telepresence face. In Proceedings of the 2015 ACM International Symposium on Wearable Computers. 125–132.",
      "doi": "10.1145/2802083.2808392"
    },
    {
      "text": "Kana Misawa and Jun Rekimoto. 2016. Who am I Touching? User Study of Remote Handshaking with a Telepresence Face. In Proceedings of the Fourth International Conference on Human Agent Interaction. 163–170.",
      "doi": "10.1145/2974804.2974821"
    },
    {
      "text": "Hideyuki Nakanishi, Kei Kato, and Hiroshi Ishiguro. 2011. Zoom cameras and movable displays enhance social telepresence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 63–72.",
      "doi": "10.1145/1978942.1978953"
    },
    {
      "text": "Michael Nebeling, Shwetha Rajaram, Liwei Wu, Yifei Cheng, and Jaylin Herskovitz. 2021. Xrstudio: A virtual production and live streaming system for immersive instructional experiences. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445323"
    },
    {
      "text": "Jun Nishida and Kenji Suzuki. 2017. BioSync: A paired wearable device for blending kinesthetic experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3316–3327.",
      "doi": "10.1145/3025453.3025829"
    },
    {
      "text": "Kohei Ogawa, Shuichi Nishio, Kensuke Koda, Giuseppe Balistreri, Tetsuya Watanabe, and Hiroshi Ishiguro. 2011. Exploring the natural reaction of young and aged person with telenoid in a real world.J. Adv. Comput. Intell. Intell. Informatics 15, 5 (2011), 592–597.",
      "doi": ""
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L Davidson, Sameh Khamis, Mingsong Dou, 2016. Holoportation: Virtual 3d teleportation in real-time. In Proceedings of the 29th annual symposium on user interface software and technology. 741–754.",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Eimei Oyama, Kohei Tokoi, Ryo Suzuki, Sousuke Nakamura, Naoji Shiroma, Norifumi Watanabe, Arvin Agah, Hiroyuki Okada, and Takashi Omori. 2021. Augmented reality and mixed reality behavior navigation system for telexistence remote assistance. Advanced Robotics 35, 20 (2021), 1223–1241.",
      "doi": ""
    },
    {
      "text": "Eimei Oyama, Motoki Yodowatari, Sousuke Nakamura, Kohei Tokoi, Arvin Agah, Hiroyuki Okada, and Takashi Omori. 2021. Integrating AR/MR/DR technology in remote seal to maintain confidentiality of information. Advanced Robotics 35, 11 (2021), 704–714.",
      "doi": ""
    },
    {
      "text": "Tomislav Pejsa, Julian Kantor, Hrvoje Benko, Eyal Ofek, and Andrew Wilson. 2016. Room2room: Enabling life-size telepresence in a projected augmented reality environment. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. 1716–1725.",
      "doi": "10.1145/2818048.2819965"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A Lee, Jonathon D Hart, Barrett Ens, Robert W Lindeman, Bruce H Thomas, and Mark Billinghurst. 2018. Mini-me: An adaptive avatar for mixed reality remote collaboration. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "Iulian Radu, Tugce Joy, and Bertrand Schneider. 2021. Virtual makerspaces: merging AR/VR/MR to enable remote collaborations in physical maker activities. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–5.",
      "doi": "10.1145/3411763.3451561"
    },
    {
      "text": "Irene Rae, Bilge Mutlu, and Leila Takayama. 2014. Bodies in motion: mobility, presence, and task awareness in telepresence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2153–2162.",
      "doi": "10.1145/2556288.2557047"
    },
    {
      "text": "Daisuke Sakamoto, Takayuki Kanda, Tetsuo Ono, Hiroshi Ishiguro, and Norihiro Hagita. 2007. Android as a telecommunication medium with a human-like presence. In 2007 2nd ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 193–200.",
      "doi": "10.1145/1228716.1228743"
    },
    {
      "text": "Mose Sakashita, Tatsuya Minagawa, Amy Koike, Ippei Suzuki, Keisuke Kawahara, and Yoichi Ochiai. 2017. You as a puppet: evaluation of telepresence user interface for puppetry. In Proceedings of the 30th annual ACM symposium on user Interface software and technology. 217–228.",
      "doi": "10.1145/3126594.3126608"
    },
    {
      "text": "Danny Schott, Patrick Saalfeld, Gerd Schmidt, Fabian Joeres, Christian Boedecker, Florentine Huettl, Hauke Lang, Tobias Huber, Bernhard Preim, and Christian Hansen. 2021. A vr/ar environment for multi-user liver anatomy education. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). IEEE, 296–305.",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Eyal Ofek, Mike Sinclair, Daniel Leithinger, and Mar Gonzalez-Franco. 2021. HapticBots: Distributed Encountered-type Haptics for VR with Multiple Shape-changing Mobile Robots. In The 34th Annual ACM Symposium on User Interface Software and Technology. 1269–1281.",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Niloufar Salehi, Michelle S Lam, Juan C Marroquin, and Michael S Bernstein. 2016. Atelier: Repurposing expert crowdsourcing tasks as micro-internships. In Proceedings of the 2016 CHI conference on human factors in computing systems. 2645–2656.",
      "doi": "10.1145/2858036.2858121"
    },
    {
      "text": "Kazuma Takada, Midori Kawaguchi, Akira Uehara, Yukiya Nakanishi, Mark Armstrong, Adrien Verhulst, Kouta Minamizawa, and Shunichi Kasahara. 2022. Parallel Ping-Pong: Exploring Parallel Embodiment through Multiple Bodies by a Single User. In Augmented Humans 2022. 121–130.",
      "doi": "10.1145/3519391.3519408"
    },
    {
      "text": "Yudai Tanaka, Jun Nishida, and Pedro Lopes. 2022. Electrical Head Actuation: Enabling Interactive Systems to Directly Manipulate Head Orientation. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3491102.3501910"
    },
    {
      "text": "Theophilus Teo, Gun A Lee, Mark Billinghurst, and Matt Adcock. 2018. Hand gestures and visual annotation in live 360 panorama-based mixed reality remote collaboration. In Proceedings of the 30th Australian Conference on Computer-Human Interaction. 406–410.",
      "doi": "10.1145/3292147.3292200"
    },
    {
      "text": "Theophilus Teo, Gun A Lee, Mark Billinghurst, and Matt Adcock. 2019. Investigating the use of different visual cues to improve social presence within a 360 mixed reality remote collaboration. In The 17th International Conference on Virtual-Reality Continuum and its Applications in Industry. 1–9.",
      "doi": "10.1145/3359997.3365687"
    },
    {
      "text": "Jakob Tholander, Chiara Rossitto, Asreen Rostami, Yoshio Ishiguro, Takashi Miyaki, and Jun Rekimoto. 2021. Design in Action: Unpacking the Artists’ Role in Performance-Led Research. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445056"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Fraser Anderson, George Fitzmaurice, Bjoern Hartmann, and Tovi Grossman. 2019. Loki: Facilitating remote instruction of physical tasks using bi-directional mixed-reality telepresence. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 161–174.",
      "doi": "10.1145/3332165.3347872"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Cuong Nguyen, Stephen DiVerdi, and Bjoern Hartmann. 2020. TransceiVR: Bridging asymmetrical communication between VR users and external collaborators. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 182–195.",
      "doi": "10.1145/3379337.3415827"
    },
    {
      "text": "Ana Villanueva, Zhengzhe Zhu, Ziyi Liu, Feiyang Wang, Subramanian Chidambaram, and Karthik Ramani. 2022. ColabAR: A Toolkit for Remote Collaboration in Tangible Augmented Reality Laboratories. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–22.",
      "doi": "10.1145/3512928"
    },
    {
      "text": "Ana M Villanueva, Ziyi Liu, Zhengzhe Zhu, Xin Du, Joey Huang, Kylie A Peppler, and Karthik Ramani. 2021. Robotar: An augmented reality compatible teleconsulting robotics toolkit for augmented makerspace experiences. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445726"
    },
    {
      "text": "Peng Wang, Xiaoliang Bai, Mark Billinghurst, Shusheng Zhang, Dechuan Han, Mengmeng Sun, Zhuo Wang, Hao Lv, and Shu Han. 2020. Haptic feedback helps me? A VR-SAR remote collaborative system with tangible interaction. International Journal of Human–Computer Interaction 36, 13(2020), 1242–1257.",
      "doi": ""
    },
    {
      "text": "Peng Wang, Xiaoliang Bai, Mark Billinghurst, Shusheng Zhang, Xiangyu Zhang, Shuxia Wang, Weiping He, Yuxiang Yan, and Hongyu Ji. 2021. AR/MR remote collaboration on physical tasks: A review. Robotics and Computer-Integrated Manufacturing 72 (2021), 102071.",
      "doi": "10.1016/j.rcim.2020.102071"
    },
    {
      "text": "Tzu-Yang Wang, Mai Otsuki, and Hideaki Kuzuoka. 2022. Evaluating Workload in One-to-Many Remote Collaboration. In Proceedings of the 15th International Conference on PErvasive Technologies Related to Assistive Environments. 296–297.",
      "doi": "10.1145/3529190.3534717"
    },
    {
      "text": "Zhuo Wang, Yang Wang, Xiaoliang Bai, Xiangyu Huo, Weiping He, Shuo Feng, Jie Zhang, Yueqing Zhang, and Jinzhao Zhou. 2021. SHARIDEAS: a smart collaborative assembly platform based on augmented reality supporting assembly intention recognition. The International Journal of Advanced Manufacturing Technology 115, 1(2021), 475–486.",
      "doi": ""
    },
    {
      "text": "Takayoshi Yamada, Kelvin Cheng, Soh Masuko, and Keiichi Zempo. 2022. “This” and “That” in Teleshopping with Possessive Telepresence Systems using 5G Mobile Networks. In Augmented Humans 2022. 326–329.",
      "doi": ""
    },
    {
      "text": "Xiangyu Zhang, Xiaoliang Bai, Shusheng Zhang, Weiping He, Peng Wang, Zhuo Wang, Yuxiang Yan, and Quan Yu. 2022. Real-time 3D video-based MR remote collaboration using gesture cues and virtual replicas. The International Journal of Advanced Manufacturing Technology (2022), 1–23.",
      "doi": ""
    },
    {
      "text": "Zhenning Zhang, Zhigeng Pan, Weiqing Li, and Zhiyong Su. 2022. Imitative Collaboration: A mirror-neuron inspired mixed reality collaboration method with remote hands and local replicas. Journal of Visual Communication and Image Representation (2022), 103600.",
      "doi": ""
    }
  ]
}