{
  "doi": "10.1145/3544548.3581526",
  "title": "The Intricacies of Social Robots: Secondary Analysis of Fictional Documentaries to Explore the Benefits and Challenges of Robots in Complex Social Settings",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "In the design of social robots, the focus is often on the robot itself rather than on the intricacies of possible application scenarios. In this paper, we examine eight fictional documentaries about social robots, such as SEYNO, a robot that promotes respect between passengers in trains, or PATO, a robot to watch movies with. Overall, robots were conceptualized either (1) to substitute humans in relationships or (2) to mediate relationships (human-human-robot-interaction). While the former is basis of many current approaches to social robotics, the latter is less common, but particularly interesting. For instance, the mediation perspective fundamentally impacts the role a robot takes (e.g., role model, black sheep, ally, opponent, moralizer) and thus its potential function and form. From the substitution perspective, robots are expected to mimic human emotions; from the mediation perspective, robots can be positive precisely because they remain objective and are neither emotional nor empathic.",
  "tags": [
    "Social robots",
    "sociability",
    "human-robot-interaction",
    "otherware",
    "design fiction"
  ],
  "authors": [
    {
      "name": "Judith Dörrenbächer",
      "institution": "Ubiquitous Design / Experience & Interaction, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366946",
      "orcid": "0000-0002-3968-461X"
    },
    {
      "name": "Ronda Ringfort-Felner",
      "institution": "Ubiquitous Design / Experience & Interaction, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659958611",
      "orcid": "0000-0002-3607-9596"
    },
    {
      "name": "Marc Hassenzahl",
      "institution": "Ubiquitous Design / Experience & Interaction, University of Siegen, Germany",
      "img": "/do/10.1145/contrib-81452610719/rel-imgonly/hassenzahl.jpg",
      "acmid": "81452610719",
      "orcid": "0000-0001-9798-1762"
    }
  ],
  "references": [
    {
      "text": "Naseem Ahmadpour, Sonja Pedell, Angeline Mayasari, and Jeanie Beh. 2019. Co-creating and Assessing Future Wellbeing Technology Using Design Fiction. She Ji 5, 3: 209–230. https://doi.org/10.1016/j.sheji.2019.08.003",
      "doi": ""
    },
    {
      "text": "Amazon. 2021. Introducing Amazon Astro – Household Robot for Home Monitoring, with Alexa. Youtube. Retrieved from https://www.youtube.com/watch?v=sj1t3msy8dc",
      "doi": ""
    },
    {
      "text": "Aloha Hufana Ambe, Margot Brereton, Alessandro Soro, Laurie Buys, and Paul Roe. 2019. The Adventures of Older Authors: Exploring Futures through Co-Cesign Fictions. In Proceedings of the Conference on Human Factors in Computing Systems (CHI ’19), 1–16. https://doi.org/10.1145/3290605.3300588",
      "doi": "10.1145/3290605.3300588"
    },
    {
      "text": "James Auger. 2013. Speculative design: Crafting the speculation. Digital Creativity 24, 1: 11–35. https://doi.org/10.1080/14626268.2013.767276",
      "doi": ""
    },
    {
      "text": "James Auger. 2014. Living With Robots: A Speculative Design Approach. Journal of Human-Robot Interaction 3, 1: 20. https://doi.org/10.5898/jhri.3.1.auger",
      "doi": "10.5898/jhri.3.1.auger"
    },
    {
      "text": "Karen Barad. 2012. Agentieller Realismus. Suhrkamp.",
      "doi": ""
    },
    {
      "text": "Christoph Bartneck, Dana Kulić, Elizabeth Croft, and Susana Zoghbi. 2009. Measurement instruments for the anthropomorphism, animacy, likeability, perceived intelligence, and perceived safety of robots. International Journal of Social Robotics 1, 1: 71–81. https://doi.org/10.1007/s12369-008-0001-3",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Dominic Furniss, and Stephann Makri. 2016. Qualitative HCI research: Going behind the scenes. Synthesis Lectures on Human-Centered Informatics 9, 1: 1–115.",
      "doi": ""
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A short essay on design, science, fact and fiction. Near Future Laboratory.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal. 2002. Designing Sociable Robots. MIT Press.",
      "doi": "10.5555/515422"
    },
    {
      "text": "Citation Briggs, Pam Briggs, Mark Blythe, John Vines, Stephen Lindsay, Paul Dunphy, and James Nicholson. 2012. Invisible Design: Exploring Insights and Ideas through Ambiguous Film Scenarios. In Proceedings of the designing interactive systems conference (DIS'12), 534-543",
      "doi": "10.1145/2317956.2318036"
    },
    {
      "text": "Jacob Buur and Preben Friis. 2015. Object Theatre in Design Education. In Nordic Design Research Society Conference (NORDES ’15), 1–8.",
      "doi": ""
    },
    {
      "text": "Stuart Candy and Jake Dunagan. 2017. Designing an experiential scenario: The People Who Vanished. Futures 86: 136–153. https://doi.org/10.1016/j.futures.2016.05.006",
      "doi": ""
    },
    {
      "text": "Eunjeong Cheon and Norman Makoto Su. 2018. Futuristic Autobiographies: Weaving Participant Narratives to Elicit Values around Robots. In International Conference on Human-Robot Interaction (HRI ’18), 388–397. https://doi.org/10.1145/3171221.3171244",
      "doi": "10.1145/3171221.3171244"
    },
    {
      "text": "Patricia Ciobanu. 2019. Designing for and with Care in Multispecies Kinship: Exploring Methods of Decentering the Human in Design. Retrieved from https://kth.diva-portal.org/smash/get/diva2:1337125/FULLTEXT01.pdf",
      "doi": ""
    },
    {
      "text": "Aykut Coskun, Nazli Cila, Iohanna Nicenboim, Christopher Frauenberger, Ron Wakkary, Marc Hassenzahl, Clara Mancini, Elisa Giaccardi, and Laura Forlano. 2022. More-than-human Concepts, Methodologies, and Practices in HCI. In Conference on Human Factors in Computing Systems (CHI'22) – Extended Abstracts. https://doi.org/10.1145/3491101.3516503",
      "doi": "10.1145/3491101.3516503"
    },
    {
      "text": "Paul Coulton and Joseph Galen Lindley. 2019. More-Than Human Centred Design: Considering Other Things. The Design Journal 22, 4: 1–19. https://doi.org/10.1080/14606925.2019.1614320",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Abigail de Kosnik, Kate Mattingly, and Kimiko Ryokai. 2016. Probing the potential of post-anthropocentric 3D printing. Proceedings of the Conference on Designing Interactive Systems (DIS'16), 170–181. https://doi.org/10.1145/2901790.2901879",
      "doi": "10.1145/2901790.2901879"
    },
    {
      "text": "Carl Disalvo and Jonathan Lukens. 2011. Nonanthropocentrism and the Nonhuman in Design: Possibilities for Designing New Forms of Engagement with and through Technology. In From Social Butterfly to Engaged Citizen: Urban Informatics, Social Media, Ubiquitous Computing, and Mobile Technology to Support Citizen Engagement, Marcus Foth, Laura Forlano, Christine Satchell and Martin Gibbs (eds.). The MIT Press, 421–435.",
      "doi": ""
    },
    {
      "text": "Judith Dörrenbächer. 2022. Distanz durch Nähe. Animistische Praktiken für kritisches Design. Birkhäuser, Basel.",
      "doi": ""
    },
    {
      "text": "Judith Dörrenbächer, Marc Hassenzahl, Robin Neuhaus, and Ronda Ringfort-Felner. 2022. Towards Designing Meaningful Relationships with Robots. In Meaningful Futures with Robots. Designing a New Coexistence, Judith Dörrenbächer, Ronda Ringfort-Felner, Robin Neuhaus and Marc Hassenzahl (eds.). Taylor & Francis, 4–29",
      "doi": ""
    },
    {
      "text": "Judith Dörrenbächer, Matthias Laschke, Diana Löffler, Ronda Ringfort, Sabrina Großkopp, and Marc Hassenzahl. 2020. Experiencing Utopia. A Positive Approach to Design Fiction. In Workshoppaper submitted for CHI’20.",
      "doi": ""
    },
    {
      "text": "Judith Dörrenbächer, Diana Löffler, and Marc Hassenzahl. 2020. Becoming a Robot - Overcoming Anthropomorphism with Techno-Mimesis. Proceedings of the Conference on Human Factors in Computing Systems (CHI ’20), 1–12. https://doi.org/10.1145/3313831.3376507",
      "doi": "10.1145/3313831.3376507"
    },
    {
      "text": "Judith Dörrrenbächer and Marc Hassenzahl. 2020. Intra-aktionsdesign. Über den Neuen Materialismus im Design und die Notwendigkeit, Haltung zu beziehen. In Matters of Communication – Formen und Materialitäten gestalteter Kommunikation, Sabine; Foraita, Bianca; Herlo and Axel Vogelsang (eds.). transcript, 175–188.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything: Design, Fiction and Social Dreaming. MIT Press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C. Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S. Kirk. 2017. On speculative enactments. In Proceedings of the Conference on Human Factors in Computing Systems (CHI '17), 5386–5399. https://doi.org/10.1145/3025453.3025503",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Chris Elsden, Abigail Durrant, David Chatting, David Green, and David Kirk. 2017. Abacus Datagraphy: A Speculative Enactment. In Proceedings of the Research Through Design Conference (RTD'17), 148–162. https://doi.org/10.6084/m9.figshare.4746961",
      "doi": ""
    },
    {
      "text": "Julia Fink, Valérie Bauwens, Frédéric Kaplan, and Pierre Dillenbourg. 2013. Living with a Vacuum Cleaning Robot: A 6-month Ethnographic Study. International Journal of Social Robotics 5, 3: 389–408. https://doi.org/10.1007/s12369-013-0190-2",
      "doi": ""
    },
    {
      "text": "Laura Forlano. 2017. Posthumanism and Design. She Ji 3, 1: 16–29. https://doi.org/10.1016/j.sheji.2017.08.001",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger. 2019. Entanglement HCI the next wave? ACM Transactions on Computer-Human Interaction 27, 1. https://doi.org/10.1145/3364998",
      "doi": "10.1145/3364998"
    },
    {
      "text": "Christopher Frauenberger. 2020. Nomadic Practices: A Posthuman Theory for Knowing Design. International Journal of Design 14, 3: 117–128. Retrieved from www.ijdesign.org",
      "doi": ""
    },
    {
      "text": "Christopher Frayling. 1993. Research in Art and Design (Royal College of Art Research Papers, vol 1, no 1, 1993/4).",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi and Johan Redström. 2020. Technology and More-Than-Human Design. Design Issues 36, 4: 33–44. https://doi.org/10.1162/desi_a_00612",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi, Chris Speed, Nazli Cila, and Melissa L Caldwell. 2016. Things as Co-ethnographers: Implications of a Thing Perspective for Design and Anthrolopogy. In Design Anthropological Futures, Rachel C. Smith, Kasper T. Vaskilde, Mette G. Kjaersgaard, Ton Otto, Joachim Halse and Thomas Binder (eds.). Bloomsbury Academic, 235–248. https://doi.org/10.5040/9781474280617.ch-015",
      "doi": ""
    },
    {
      "text": "Kenneth R. Hanson and Chloé C. Locatelli. 2022. From Sex Dolls to Sex Robots and Beyond: A Narrative Review of Theoretical and Empirical Research on Human-like and Personified Sex Tech. Current Sexual Health Reports 14, 3: 106–117. https://doi.org/10.1007/s11930-022-00331-0",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Jan Borchers, Susanne Boll, Astrid Rosenthal-von der Pütten, and Volker Wulf. 2020. Otherware: How to Best interact with Autonomous Systems. Interact 28, 1: 54–57.",
      "doi": "10.1145/3436942"
    },
    {
      "text": "Don Ihde. 1990. Technology and the Lifeworld: From Garden to Earth. Indiana University Press, Indianapolis.",
      "doi": ""
    },
    {
      "text": "Malte Jung and Pamela Hinds. 2018. Robots in the Wild: A Time for More Robust Theories of Human-Robot Interaction. ACM Transactions on Human-Robot Interaction 7, 1: 1–5.",
      "doi": "10.1145/3208975"
    },
    {
      "text": "Timo Kaerlein. 2022. Social Robots Should Mediate, Not Replace, Social Interaction. In Meaningful Futures with Robots. Designing a New Coexistence, Judith Dörrenbächer, Ronda Ringfort-Felner, Robin Neuhaus and Marc Hassenzahl (eds.). Taylor & Francis, 54–57.",
      "doi": ""
    },
    {
      "text": "David Kirby. 2010. The future is now: Diegetic prototypes and the role of popular films in generating real-world technological development. Social Studies of Science 40, 1: 41–70. https://doi.org/10.1177/0306312709338325",
      "doi": ""
    },
    {
      "text": "Lenneke Kuijer and Elisa Giaccardi. 2018. Co-performance: Conceptualizing the Role of Artificial Agency in the Design of Everyday Life. In Proceedings of the Conference on Human Factors in Computing Systems (CHI ’19), 1–14. https://doi.org/10.1145/3173574.3173699",
      "doi": "10.1145/3173574.3173699"
    },
    {
      "text": "Joseph Lindley. 2015. A Pragmatics Framework for Design Fiction. In Proceedings of the European Academy of Design Conference (EAD’15). https://doi.org/10.7190/ead/2015/69",
      "doi": ""
    },
    {
      "text": "Joseph Lindley and Dhruv Sharma. 2014. An Ethnography of the Future. Strangers in Strange Lands. Retrieved from https://www.kent.ac.uk/sac/news/?view=1477",
      "doi": ""
    },
    {
      "text": "Joseph Lindley, Dhruv Sharma, and Robert Potts. 2014. Anticipatory Ethnography: Design Fiction as an Input to Design Ethnography. In Proceedings of the Ethnographic Praxis in Industry (EPIC'14), 237–253. https://doi.org/10.1111/1559-8918.01030",
      "doi": ""
    },
    {
      "text": "Joseph Lindley, Dhruv Sharma, and Robert Potts. 2015. Operationalizing Design Fiction with Anticipatory Ethnography. In Proceedings of the Conference of Ethnographic Praxis in Industry (EPIC ’15), 58–71. https://doi.org/10.1111/1559-8918.2015.01040",
      "doi": ""
    },
    {
      "text": "Larissa Vivian Nägele, Merja Ryöppy, and Danielle Wilde. 2018. PDFI: Participatory design fiction with vulnerable users. In Proceedings of the Nordic Conference on Human-Computer Interaction (NordiCHI'18), 819–831. https://doi.org/10.1145/3240167.3240272",
      "doi": "10.1145/3240167.3240272"
    },
    {
      "text": "Iohanna Nicenboim, Elisa Giaccardi, Marie Louise Juul Søndergaard, Anuradha Venugopal Reddy, Yolande Strengers, James Pierce, and Johan Redström. 2020. More-than-human design and AI: In conversation with agents. Companion publication of the designing interactive systems conference (DIS'20): 397–400. https://doi.org/10.1145/3393914.3395912",
      "doi": "10.1145/3393914.3395912"
    },
    {
      "text": "William Odom, John Zimmerman, Scott Davidoff, Jodi Forlizzi, Anind K. Dey, and Min Kyung Lee. 2012. A fieldwork of the future with user enactments. In Proceedings of the Designing Interactive Systems Conference (DIS ’12), 338–347. https://doi.org/10.1145/2317956.2318008",
      "doi": "10.1145/2317956.2318008"
    },
    {
      "text": "Linda Onnasch and Eileen Roesler. 2019. Anthropomorphizing Robots: The Effect of Framing in Human-Robot Collaboration. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 1311–1315. https://doi.org/10.1177/1071181319631209",
      "doi": ""
    },
    {
      "text": "Ann M. Pendleton-Jullian and John Seely Brown. 2018. Design unbound: Designing for emergence in a white water world. MIT Press.",
      "doi": ""
    },
    {
      "text": "Anuradha Reddy, Iohanna Nicenboim, James Pierce, and Elisa Giaccardi. 2021. Encountering ethics through design: a workshop with nonhuman participants. AI and Society 36, 3: 853–861. https://doi.org/10.1007/s00146-020-01088-7",
      "doi": "10.1007/s00146-020-01088-7"
    },
    {
      "text": "Johan Redström and Heather Wiltse. 2019. Changing Things. Bloomsbury Publishing Plc. https://doi.org/10.5040/9781350004368",
      "doi": ""
    },
    {
      "text": "Marco C. Rozendaal, Boudewijn Boon, and Victor Kaptelinin. 2019. Objects with intent: Designing everyday things as collaborative partners. ACM Transactions on Computer-Human Interaction 26, 4: 1–33. https://doi.org/10.1145/3325277",
      "doi": "10.1145/3325277"
    },
    {
      "text": "Merja Ryöppy, Salu Ylirisku, Preben Friis, and Jacob Buur. 2016. Postdramatic theatre in smart city design. In Proceedings of the International Academic Mindtrek Conference (AcademicMindtrek'16): 462–465. https://doi.org/10.1145/2994310.2994361",
      "doi": "10.1145/2994310.2994361"
    },
    {
      "text": "Johanna Schmeer. 2019. Xenodesignerly Ways of Knowing. Journal of Design and Science, 5: 1–21.",
      "doi": ""
    },
    {
      "text": "Sarah Sebo, Brett Stoll, Brian Scassellati, and Malte F. Jung. 2020. Robots in Groups and Teams: A Literature Review. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2. https://doi.org/10.1145/3415247",
      "doi": "10.1145/3415247"
    },
    {
      "text": "Adalberto L. Simeone, Robbe Cools, Stan Depuydt, João Maria Gomes, Piet Goris, Joseph Grocott, Augusto Esteves, and Kathrin Gerling. 2022. Immersive Speculative Enactments: Bringing Future Scenarios and Technology to Life Using Virtual Reality. In Proceedings of the Conference on Human Factors in Computing Systems (CHI'22), 1-20. https://doi.org/10.1145/3491102.3517492",
      "doi": "10.1145/3491102.3517492"
    },
    {
      "text": "Nancy Smith, Shaowen Bardzell, and Jeffrey Bardzell. 2017. Designing for Cohabitation. In Proceedings of the Conference on Human Factors in Computing Systems (CHI'17), 1714–1725. https://doi.org/10.1145/3025453.3025948",
      "doi": "10.1145/3025453.3025948"
    },
    {
      "text": "Lucy Suchman. 2007. Human-machine reconfigurations: Plans and situated actions. Cambridge University Press.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Ron Wakkary. 2021. Things We Could Design – For More Than Human-Centered Worlds. MIT Press.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary, William Odom, Sabrina Hauser, Garnet Hertz, and Henry Lin. 2015. Material Speculation: Actual Artifacts for Critical Inquiry. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives, 97–108. https://doi.org/10.7146/aahcc.v1i1.21299",
      "doi": "10.7146/aahcc.v1i1.21299"
    },
    {
      "text": "Kendall L. Walton. 1990. Mimesis as Make-Believe. On the Foundations of the Representational Arts. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Julika Welge and Marc Hassenzahl. 2016. Better Than Human: About the Psychological Superpowers of Robots. In International Conference on Social Robotics (ICSR ’16), 993–1002. https://doi.org/10.1007/978-3-319-47437-3",
      "doi": ""
    },
    {
      "text": "Danielle Wilde and Anna Vallgårda. 2017. Embodied Design Ideation Methods: analysing the power of estrangement. In Proceedings of the Conference on Human Factors in Computing Systems (CHI'17), 5158–5170",
      "doi": "10.1145/3025453.3025873"
    }
  ]
}