{
  "doi": "10.1145/3544548.3581464",
  "title": "\"I Am a Mirror Dweller\": Probing the Unique Strategies Users Take to Communicate in the Context of Mirrors in Social Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Increasingly popular social virtual reality (VR) platforms like VRChat created new ways for people to interact with each other, generating dedicated user communities with unique idioms of socializing in an alternative world. In VRChat, users frequently gather in front of mirrors en masse during online interactions. Understanding how user communities deal with the mirror’s unique interactions can generate insights for supporting communication in social VR. In this study, we investigated the mirror’s synergistic effect with avatars on behaviors and dedicated user conversational performance. Qualitative findings indicate that avatar-mediated communication through mirrors provides functions like ensuring synchronization of incarnations, increasing immersion, and enhancing idealized embodiment to express bolder behaviors anonymously. Quantitative studies show that while mirrors improve self-perception, it has a potentially adverse effect on conversational performance, similar to the role of self-viewing in video conferencing. Studying how users interact with mirrors in an immersive environment allows us to explore how digital environments affect spatialized interactions when transported from physical to digital domains.",
  "authors": [
    {
      "name": "Kexue Fu",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783254",
      "orcid": "0000-0002-2929-2663"
    },
    {
      "name": "Yixin Chen",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780417",
      "orcid": "0000-0001-9032-5244"
    },
    {
      "name": "Jiaxun Cao",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782408",
      "orcid": "0000-0002-1167-2801"
    },
    {
      "name": "Xin Tong",
      "institution": "missing",
      "img": "/do/10.1145/contrib-99658689004/rel-imgonly/profile_1.jpeg",
      "acmid": "99658689004",
      "orcid": "0000-0002-8037-6301"
    },
    {
      "name": "RAY LC",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659502245",
      "orcid": "0000-0001-7310-8790"
    }
  ],
  "references": [
    {
      "text": "2017. Away From Keyboard (AFK). https://www.techopedia.com/definition/17509/away-from-keyboard-afk Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "2019. Why VRChat Players Love Looking At Themselves In VRChat-Based Mirrors. https://nwn.blogs.com/nwn/2019/06/vrchat-mirrors-social-vr-comic.html Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "2020. I don’t understand mirror crowds.https://steamcommunity.com/app/438100/discussions/0/4015478340406137599/ Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "2020. \"Mirror Dwellers\": VRChat General Discussions. https://steamcommunity.com/app/438100/discussions/0/2573193828656123620/ Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "2020. Statistical Power Analyses tools. http://www.gpower.hhu.de Accessed: 2022-11-15.",
      "doi": ""
    },
    {
      "text": "2021. I ask mirror dwellers why they dwell in mirrors.https://www.youtube.com/watch?v=3x-e0ypztRU Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "2021. Virtual Reality: VR Chat.https://www.tapatalk.com/groups/crossdreamlife/virtual-reality-vr-chat-t3803.html Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "2021. VRchat Mirror Dwellers. https://www.youtube.com/watch?v=Jz-5pSCp_bQ Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "2022. Demographics of users in vrchat.com. https://www.similarweb.com/zh/website/vrchat.com/#overview Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "Olga Abramova, Margarita Gladkaya, and Hanna Krasnova. 2021. An Unusual Encounter with Oneself: Exploring the Impact of Self-view on Online Meeting Outcomes. (2021).",
      "doi": ""
    },
    {
      "text": "Anne Adams and Anna L Cox. 2008. Questionnaires, in-depth interviews and focus groups. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Akira. 2021. VRCHAT Mirror Examples: LQ, HQ, Global, Local. https://www.youtube.com/watch?v=nGPJRX-n_3c Accessed: 2022-9-1.",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson and Andrew C. Beall. 1970. Transformed social interaction: Exploring the digital plasticity of Avatars. https://link.springer.com/chapter/10.1007/1-4020-3898-4_1",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Nick Yee, Dan Merget, and Ralph Schroeder. 2006. The effect of behavioral realism and form realism of real-time avatar faces on verbal disclosure, nonverbal disclosure, emotion recognition, and copresence in dyadic interaction. Presence: Teleoperators and Virtual Environments 15, 4(2006), 359–372.",
      "doi": "10.1162/pres.15.4.359"
    },
    {
      "text": "Steven Baker, Ryan M Kelly, Jenny Waycott, Romina Carrasco, Thuong Hoang, Frances Batchelor, Elizabeth Ozanne, Briony Dow, Jeni Warburton, and Frank Vetere. 2019. Interrogating social virtual reality as a communication medium for older adults. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359251"
    },
    {
      "text": "Steven Baker, Jenny Waycott, Romina Carrasco, Ryan M Kelly, Anthony John Jones, Jack Lilley, Briony Dow, Frances Batchelor, Thuong Hoang, and Frank Vetere. 2021. Avatar-mediated communication in social VR: an in-depth exploration of older adult interaction in an emerging communication platform. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445752"
    },
    {
      "text": "Guillermo Bernal and Pattie Maes. 2017. Emotional beasts: visually expressing emotions through avatars in VR. In Proceedings of the 2017 CHI conference extended abstracts on human factors in computing systems. 2395–2402.",
      "doi": "10.1145/3027063.3053207"
    },
    {
      "text": "Judith Bessant, Melody Devries, and Rob Watts. 2021. Rise of the Far Right: Technologies of Recruitment and Mobilization. Rowman & Littlefield.",
      "doi": ""
    },
    {
      "text": "Frank Biocca. 1997. The cyborg’s dilemma: Progressive embodiment in virtual environments. Journal of computer-mediated communication 3, 2 (1997), JCMC324.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in Social Virtual Reality: Challenges for Platform Governance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 100:1–100:25. https://doi.org/10.1145/3359202",
      "doi": "10.1145/3359202"
    },
    {
      "text": "Susan M Bögels, Wendy Rijsemus, and Peter J De Jong. 2002. Self-focused attention and social anxiety: The effects of experimentally heightened self-awareness on fear, blushing, cognitions, and social skills. Cognitive Therapy and Research 26, 4 (2002), 461–472.",
      "doi": ""
    },
    {
      "text": "Liudmila Bredikhina, Takayuki Kameoka, Shogo Shimbo, and Akihiko Shirai. 2020. Avatar driven VR society trends in Japan. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 497–503.",
      "doi": ""
    },
    {
      "text": "Jas Brooks. 2019. Promises of the virtual museum. XRDS: Crossroads, The ACM Magazine for Students 25, 2 (2019), 46–50.",
      "doi": "10.1145/3301483"
    },
    {
      "text": "Katia Buchhop, Laura Edel, Sabrin Kenaan, Ulrike Raab, Patricia Böhm, and Daniel Isemann. 2017. In-Vehicle Touchscreen Interaction: Can a Head-Down Display Give a Heads-Up on Obstacles on the Road?. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 21–30.",
      "doi": "10.1145/3122986.3123001"
    },
    {
      "text": "Pramujiono Cahyadi, Daffa Indra Arya Wardhana, Wildan Isa Ansori, and Rafika Rabba Farah. 2022. Enhancing Students’ English Speaking Ability Through VRChat Game as Learning Media. Journal of Research on Language Education 3, 2 (2022), 54–61.",
      "doi": ""
    },
    {
      "text": "Charles S Carver and Michael F Scheier. 1978. Self-focusing effects of dispositional self-consciousness, mirror presence, and audience presence.Journal of Personality and Social Psychology 36, 3(1978), 324.",
      "doi": ""
    },
    {
      "text": "Charles S Carver and Michael F Scheier. 2012. Attention and self-regulation: A control-theory approach to human behavior. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Lei Chen, Gary Feng, Jilliam Joe, Chee Wee Leong, Christopher Kitchen, and Chong Min Lee. 2014. Towards automated assessment of public speaking skills using multimodal cues. In Proceedings of the 16th International Conference on Multimodal Interaction. 200–203.",
      "doi": "10.1145/2663204.2663265"
    },
    {
      "text": "Jacob Cohen. 1988. Statistical power analysis for the behavioral sciences. Lawrence Erlbaum Associates. Hillsdale, NJ (1988), 20–26.",
      "doi": ""
    },
    {
      "text": "Jose Eurico de Vasconcelos Filho, Kori M Inkpen, and Mary Czerwinski. 2009. Image, appearance and vanity in the use of media spaces and video conference systems. In Proceedings of the ACM 2009 international conference on Supporting group work. 253–262.",
      "doi": "10.1145/1531674.1531712"
    },
    {
      "text": "Gwyneth Doherty-Sneddon, Anne Anderson, Claire O’malley, Steve Langton, Simon Garrod, and Vicki Bruce. 1997. Face-to-face and video-mediated communication: A comparison of dialogue structure and task performance.Journal of experimental psychology: applied 3, 2 (1997), 105.",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut, Ming-Hui Wen, Nicholas Yee, and Greg Wadley. 2009. Body and mind: a study of avatar personalization in three virtual worlds. In Proceedings of the SIGCHI conference on human factors in computing systems. 1151–1160.",
      "doi": "10.1145/1518701.1518877"
    },
    {
      "text": "Shelley Duval and Robert A Wicklund. 1972. A theory of objective self awareness.(1972).",
      "doi": ""
    },
    {
      "text": "Stephen R Ellis. 1994. What are virtual environments?IEEE Computer Graphics and Applications 14, 1 (1994), 17–22.",
      "doi": "10.1109/38.250914"
    },
    {
      "text": "Guo Freeman and Divine Maloney. 2021. Body, avatar, and me: The presentation and perception of self in social virtual reality. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–27.",
      "doi": "10.1145/3432938"
    },
    {
      "text": "Guo Freeman, Divine Maloney, Dane Acena, and Catherine Barwulor. 2022. (Re)discovering the Physical Body Online: Strategies and Challenges to Approach Non-Cisgender Identity in Social Virtual Reality. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3491102.3502082",
      "doi": "10.1145/3491102.3502082"
    },
    {
      "text": "Guo Freeman, Samaneh Zamanifard, Divine Maloney, and Dane Acena. 2022. Disturbing the Peace: Experiencing and Mitigating Emerging Harassment in Social Virtual Reality. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–30.",
      "doi": "10.1145/3512932"
    },
    {
      "text": "Guo Freeman, Samaneh Zamanifard, Divine Maloney, and Alexandra Adkins. 2020. My Body, My Avatar: How People Perceive Their Avatars in Social Virtual Reality. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382923",
      "doi": "10.1145/3334480.3382923"
    },
    {
      "text": "Markus Friedl. 2003. Online game interactivity theory. Vol. 1. Charles River Media Hingham.",
      "doi": ""
    },
    {
      "text": "Jane Gallop. 1982. Lacan’s \"Mirror Stage\": Where to Begin. SubStance 11/12(1982), 118–128. http://www.jstor.org/stable/3684185",
      "doi": ""
    },
    {
      "text": "Gordon G Gallup Jr, James R Anderson, and Daniel J Shillito. 2002. The mirror test. The cognitive animal: Empirical and theoretical perspectives on animal cognition (2002), 325–333.",
      "doi": ""
    },
    {
      "text": "Valerie Geller and Phillip Shaver. 1976. Cognitive consequences of self-awareness. Journal of experimental social psychology 12, 1 (1976), 99–108.",
      "doi": ""
    },
    {
      "text": "E Goffman 1978. The presentation of self in everyday life: Harmondsworth London. (1978).",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco and Tabitha C Peck. 2018. Avatar embodiment. towards a standardized questionnaire. Frontiers in Robotics and AI 5 (2018), 74.",
      "doi": ""
    },
    {
      "text": "Mar González-Franco, Daniel Pérez-Marcos, Bernhard Spanlang, and Mel Slater. 2010. The contribution of real-time mirror reflections of motor actions on virtual body ownership in an immersive virtual environment. In 2010 IEEE Virtual Reality Conference (VR). 111–114. https://doi.org/10.1109/VR.2010.5444805",
      "doi": "10.1109/VR.2010.5444805"
    },
    {
      "text": "Paul Greenbank. 2003. The role of values in educational research: The case for reflexivity. British educational research journal 29, 6 (2003), 791–801.",
      "doi": ""
    },
    {
      "text": "Arvid Guterstam, Giovanni Gentile, and H Henrik Ehrsson. 2013. The invisible hand illusion: multisensory integration leads to the embodiment of a discrete volume of empty space. Journal of cognitive neuroscience 25, 7 (2013), 1078–1099.",
      "doi": "10.5555/2491625.2491626"
    },
    {
      "text": "Andrew Gary Darwin Holmes. 2020. Researcher Positionality–A Consideration of Its Influence and Place in Qualitative Research–A New Researcher Guide.Shanlax International Journal of Education 8, 4 (2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Adrian H Hoppe, Florian van de Camp, and Rainer Stiefelhagen. 2021. Shisha: enabling shared perspective with face-to-face collaboration using redirected avatars in virtual reality. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–22.",
      "doi": "10.1145/3432950"
    },
    {
      "text": "Marcel Jonas, Steven Said, Daniel Yu, Chris Aiello, Nicholas Furlo, and Douglas Zytko. 2019. Towards a Taxonomy of Social VR Application Design. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts(CHI PLAY ’19 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 437–444. https://doi.org/10.1145/3341215.3356271",
      "doi": "10.1145/3341215.3356271"
    },
    {
      "text": "Sarah Jones. 2017. Disrupting the narrative: immersive journalism in virtual reality. Journal of media practice 18, 2-3 (2017), 171–185.",
      "doi": ""
    },
    {
      "text": "Sophie Jörg, Jessica Hodgins, and Carol O’Sullivan. 2010. The perception of finger motions. In Proceedings of the 7th Symposium on Applied Perception in Graphics and Visualization. 129–133.",
      "doi": "10.1145/1836248.1836273"
    },
    {
      "text": "Matthew K. Miller, Martin Johannes Dechant, and Regan L. Mandryk. 2021. Meeting You, Seeing Me: The Role of Social Anxiety, Visual Feedback, and Interface Layout in a Get-to-Know-You Task via Video Chat.. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Ilias Bergstrom, and Mel Slater. 2013. Drumming in immersive virtual reality: the body shapes the way we play. IEEE transactions on visualization and computer graphics 19, 4(2013), 597–605.",
      "doi": ""
    },
    {
      "text": "Anya Kolesnichenko, Joshua McVeigh-Schultz, and Katherine Isbister. 2019. Understanding Emerging Design Practices for Avatar Systems in the Commercial Social VR Ecology. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 241–252. https://doi.org/10.1145/3322276.3322352",
      "doi": "10.1145/3322276.3322352"
    },
    {
      "text": "Kristine M Kuhn. 2022. The constant mirror: Self-view and attitudes to virtual meetings. Computers in Human Behavior 128 (2022), 107110.",
      "doi": "10.1016/j.chb.2021.107110"
    },
    {
      "text": "Abdi M Kusow. 2003. Beyond indigenous authenticity: Reflections on the insider/outsider debate in immigration research. Symbolic Interaction 26, 4 (2003), 591–599.",
      "doi": ""
    },
    {
      "text": "Jie Li, Yiping Kong, Thomas Röggla, Francesca De Simone, Swamy Ananthanarayan, Huib De Ridder, Abdallah El Ali, and Pablo Cesar. 2019. Measuring and understanding photo sharing experiences in social virtual reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300897"
    },
    {
      "text": "Dougal Mackay. 1997. Social Phobia: Diagnosis, Assessment and Treatment Edited by Richard G. Heimberg, Michael R. Liebowitz, Debra A. Hope and Franklin R. Schneier. New York: Guilford Press. 1995. 435 pp. £34.50 (hb). British Journal of Psychiatry 171, 1 (1997), 99–99. https://doi.org/10.1192/s0007125000147543",
      "doi": ""
    },
    {
      "text": "I Scott MacKenzie. 2013. Designing HCI experiments. Human-computer interaction: an empirical research perspective (2013), 176.",
      "doi": ""
    },
    {
      "text": "Divine Maloney and Guo Freeman. 2020. Falling Asleep Together: What Makes Activities in Social Virtual Reality Meaningful to Users. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 510–521. https://doi.org/10.1145/3410404.3414266",
      "doi": "10.1145/3410404.3414266"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2020. A Virtual Space for All: Exploring Children’s Experience in Social Virtual Reality. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 472–483. https://doi.org/10.1145/3410404.3414268",
      "doi": "10.1145/3410404.3414268"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2021. Social virtual reality: ethical considerations and future directions for an emerging research space. In 2021 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 271–277.",
      "doi": ""
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Donghee Yvette Wohn. 2020. \"Talking without a Voice\": Understanding Non-verbal Communication in Social Virtual Reality. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2 (Oct. 2020), 1–25. https://doi.org/10.1145/3415246",
      "doi": "10.1145/3415246"
    },
    {
      "text": "Tony Manninen and Tomi Kujanpää. 2007. The value of virtual assets: the role of game characters in MMOGs. International Journal of Business Science & Applied Management (IJBSAM) 2, 1(2007), 21–33.",
      "doi": ""
    },
    {
      "text": "Maozhu Mao. 2021. How People Social in VR: A Behavior Mapping Study in Virtual Environments. 1–15. https://doi.org/10.22492/issn.2187-4743.2021.1",
      "doi": ""
    },
    {
      "text": "Tim May and Beth Perry. 2017. Reflexivity: The essential guide. Sage.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on human-computer interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300794",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Joshua McVeigh-Schultz, Elena Márquez Segura, Nick Merrill, and Katherine Isbister. 2018. What’s It Mean to \"Be Social\" in VR? Mapping the Social VR Design Ecology. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems(DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 289–294. https://doi.org/10.1145/3197391.3205451",
      "doi": "10.1145/3197391.3205451"
    },
    {
      "text": "Justine Mercer. 2007. The challenges of insider research in educational institutions: Wielding a double-edged sword and resolving delicate dilemmas. Oxford review of education 33, 1 (2007), 1–17.",
      "doi": ""
    },
    {
      "text": "Fares Moustafa and Anthony Steed. 2018. A longitudinal study of small group interaction in social virtual reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology. 1–10.",
      "doi": "10.1145/3281505.3281527"
    },
    {
      "text": "Clive Opie. 2004. Doing educational research. Doing Educational Research(2004), 1–264.",
      "doi": ""
    },
    {
      "text": "Lisa Orii, Nami Ogawa, Yuji Hatada, and Takuji Narumi. 2022. Designing for Speech Practice Systems: How Do User-Controlled Voice Manipulation and Model Speakers Impact Self-Perceptions of Voice?. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–14. https://doi.org/10.1145/3491102.3502093",
      "doi": "10.1145/3491102.3502093"
    },
    {
      "text": "SA Osimo, R Pizarro, B Spanlang, and M Slater. 2015. Conversations between self and self as Sigmund Freud—A virtual body ownership paradigm for self counselling. Sci Rep. 2015; 5: 13899. Technical Report. Epub 2015/09/12. doi: 10.1038/srep13899 srep13899 [pii]. PMID: 26354311.",
      "doi": ""
    },
    {
      "text": "Tabitha C Peck, Sofia Seinfeld, Salvatore M Aglioti, and Mel Slater. 2013. Putting yourself in the skin of a black avatar reduces implicit racial bias. Consciousness and cognition 22, 3 (2013), 779–787.",
      "doi": ""
    },
    {
      "text": "Thomas L Rodebaugh and Dianne L Chambless. 2002. The effects of video feedback on self-perception of performance: A replication and extension. Cognitive Therapy and Research 26, 5 (2002), 629–644.",
      "doi": ""
    },
    {
      "text": "Lisa M Schreiber, Gregory D Paul, and Lisa R Shibley. 2012. The development and test of the public speaking competence rubric. Communication Education 61, 3 (2012), 205–233.",
      "doi": ""
    },
    {
      "text": "Ralph Schroeder. 2001. The social life of avatars: Presence and interaction in shared virtual environments. Springer Science & Business Media.",
      "doi": "10.5555/505799"
    },
    {
      "text": "Lawrence W Sherman and Heather Strang. 2004. Experimental ethnography: the marriage of qualitative and quantitative research. The Annals of the American Academy of Political and Social Science 595, 1(2004), 204–222.",
      "doi": ""
    },
    {
      "text": "John Scott Siri Jr, Hamna Khalid, Luong Nguyen, and Donghee Yvette Wohn. 2018. Screen-viewing Practices in Social Virtual Reality. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. 173–176.",
      "doi": ""
    },
    {
      "text": "Richard Skarbez, Solene Neyret, Frederick P Brooks, Mel Slater, and Mary C Whitton. 2017. A psychophysical experiment regarding components of the plausibility illusion. IEEE transactions on visualization and computer graphics 23, 4(2017), 1369–1378.",
      "doi": "10.1109/TVCG.2017.2657158"
    },
    {
      "text": "Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (2009), 3549–3557.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Bernhard Spanlang, and David Corominas. 2010. Simulating virtual environments within virtual environments as the basis for a psychophysics of presence. ACM transactions on graphics (TOG) 29, 4 (2010), 1–9.",
      "doi": ""
    },
    {
      "text": "Harrison Jesse Smith and Michael Neff. 2018. Communication behavior in embodied virtual reality. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3173863"
    },
    {
      "text": "Misha Sra, Aske Mottelson, and Pattie Maes. 2018. Your Place and Mine: Designing a Shared VR Experience for Remotely Located Users. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, Hong Kong China, 85–97. https://doi.org/10.1145/3196709.3196788",
      "doi": "10.1145/3196709.3196788"
    },
    {
      "text": "Jan E Stets and Peter J Burke. 2000. Identity theory and social identity theory. Social psychology quarterly(2000), 224–237.",
      "doi": ""
    },
    {
      "text": "Jason Tham, Ann Hill Duin, Laura Gee, Nathan Ernst, Bilal Abdelqader, and Megan McGrath. 2018. Understanding Virtual Reality: Presence, Embodiment, and Professional Practice. IEEE Transactions on Professional Communication 61, 2 (June 2018), 178–195. https://doi.org/10.1109/TPC.2018.2804238 Conference Name: IEEE Transactions on Professional Communication.",
      "doi": ""
    },
    {
      "text": "Muhammad Usman, Brandon Haworth, Glen Berseth, Mubbasir Kapadia, and Petros Faloutsos. 2017. Understanding spatial perception and visual modes in the review of architectural designs. In Proceedings of the ACM SIGGRAPH/Eurographics Symposium on Computer Animation. 1–2.",
      "doi": "10.1145/3099564.3108164"
    },
    {
      "text": "Robin R Vallacher. 1978. Objective self awareness and the perception of others. Personality and Social Psychology Bulletin 4, 1 (1978), 63–67.",
      "doi": ""
    },
    {
      "text": "Xiaoying Wei, Xiaofu Jin, and Mingming Fan. 2022. Communication in Immersive Social Virtual Reality: A Systematic Review of 10 Years’ Studies. arXiv preprint arXiv:2210.01365(2022).",
      "doi": ""
    },
    {
      "text": "T Well. 2018. Why is seeing your own reflection so important. Psychol. Today (2018).",
      "doi": ""
    },
    {
      "text": "Tara Well. 2022. Mirror Meditation: The Power of Neuroscience and Self-Reflection to Overcome Self-Criticism, Gain Confidence, and See Yourself with Compassion. New Harbinger Publications.",
      "doi": ""
    },
    {
      "text": "Nick Yee and Jeremy Bailenson. 2007. The Proteus effect: The effect of transformed self-representation on behavior. Human communication research 33, 3 (2007), 271–290.",
      "doi": ""
    },
    {
      "text": "Nick Yee and Jeremy N Bailenson. 2006. Walk a mile in digital shoes: The impact of embodied perspective-taking on the reduction of negative stereotyping in immersive virtual environments. Proceedings of PRESENCE 24 (2006), 26.",
      "doi": ""
    },
    {
      "text": "Nick Yee, Jeremy N Bailenson, and Nicolas Ducheneaut. 2009. The Proteus effect: Implications of transformed digital self-representation on online and offline behavior. Communication Research 36, 2 (2009), 285–312.",
      "doi": ""
    },
    {
      "text": "Cagri Hakan Zaman, Asiya Yakhina, and Federico Casalegno. 2015. nroom: An immersive virtual environment for collaborative spatial design. In Proceedings of the International HCI and UX Conference in Indonesia. 10–17.",
      "doi": "10.1145/2742032.2742034"
    },
    {
      "text": "Samaneh Zamanifard and Guo Freeman. 2019. \"The Togetherness that We Crave\": Experiencing Social VR in Long Distance Relationships. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing(CSCW ’19). Association for Computing Machinery, New York, NY, USA, 438–442. https://doi.org/10.1145/3311957.3359453",
      "doi": "10.1145/3311957.3359453"
    },
    {
      "text": "Qinping Zhao. 2009. A survey on virtual reality. Science in China Series F: Information Sciences 52, 3 (2009), 348–400.",
      "doi": ""
    }
  ]
}