{
  "doi": "10.1145/3544548.3581153",
  "title": "Scripted Vicarious Dialogues: Educational Video Augmentation Method for Increasing Isolated Students’ Engagement",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-25",
  "year": 2023,
  "badges": [],
  "abstract": "Videos are convenient resources for asynchronous learning, but they lack interpersonal interactions found in synchronous classrooms. Due to missed social connectedness, the isolated video-based learners experience low emotional, behavioral, and cognitive engagement. This work presents \"Scripted Vicarious Dialogues\" (SVD), a technique for engaging students in a pseudo-social experience of witnessing scripted dialogues between virtual characters (teaching assistants and students) around a video. We conducted a participatory design study to derive design guidelines for SVD. The findings indicate the need to distinguish the virtual components and to give students control of the dialogue’s pace. We then implemented an interactive prototype of SVD and evaluated it (N=40) against a non-social, direct-learning baseline. The results show that the preference for SVD versus the baseline is polarized (25 of 40 preferred SVD; no neutral preferences), and those who preferred SVD had significantly higher emotional and behavioral engagement with SVD compared to the baseline.",
  "tags": [
    "vicarious learning",
    "learner engagement",
    "video-based learning",
    "augmented learning environment"
  ],
  "authors": [
    {
      "name": "Thitaree Tanprasert",
      "institution": "Computer Science, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659350609",
      "orcid": "0000-0002-5606-2433"
    },
    {
      "name": "Sidney S Fels",
      "institution": "Electrical and Computer Engineering, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327488395",
      "orcid": "0000-0001-9279-9021"
    },
    {
      "name": "Luanne Sinnamon",
      "institution": "School of Information, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659680507",
      "orcid": "0000-0001-9063-5699"
    },
    {
      "name": "Dongwook Yoon",
      "institution": "Computer Science, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659515794",
      "orcid": "0000-0002-7838-8311"
    }
  ],
  "references": [
    {
      "text": "Oqab Alrashidi, Huy P Phan, and Bing H Ngu. 2016. Academic Engagement: An Overview of Its Definitions, Dimensions, and Major Conceptualisations.International Education Studies 9, 12 (2016), 41–52.",
      "doi": ""
    },
    {
      "text": "Patrícia Alves-Oliveira, Pedro Sequeira, Francisco S Melo, Ginevra Castellano, and Ana Paiva. 2019. Empathic robot for group learning: A field study. ACM Transactions on Human-Robot Interaction (THRI) 8, 1 (2019), 1–34.",
      "doi": "10.1145/3300188"
    },
    {
      "text": "Ryan S Baker and Aaron Hawn. 2022. Algorithmic bias in education. International Journal of Artificial Intelligence in Education 32, 4(2022), 1052–1092.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2001. Social cognitive theory: An agentic perspective. Annual review of psychology 52, 1 (2001), 1–26.",
      "doi": ""
    },
    {
      "text": "Jack Barokas, Markus Ketterl, and Christopher Brooks. 2010. Lecture capture: student perceptions, expectations, and behaviors. In E-Learn: World Conference on E-Learning in Corporate, Government, Healthcare, and Higher Education. Association for the Advancement of Computing in Education (AACE), 424–431.",
      "doi": ""
    },
    {
      "text": "Romiro Gordo Bautista. 2015. Optimizing classroom instruction through self-paced learning prototype. Journal of Technology and Science Educaton (JOTSE) 5, 3 (2015), 184–193.",
      "doi": ""
    },
    {
      "text": "Mobina Beheshti, Ata Taspolat, Omer Sami Kaya, and Hamza Fatih Sapanca. 2018. Characteristics of Instructional Videos.World Journal on Educational Technology: Current Issues 10, 1(2018), 61–69.",
      "doi": ""
    },
    {
      "text": "Gautam Biswas, Krittaya Leelawong, Daniel Schwartz, Nancy Vye, and The Teachable Agents Group at Vanderbilt. 2005. Learning by teaching: A new agent paradigm for educational software. Applied Artificial Intelligence 19, 3-4 (2005), 363–392.",
      "doi": ""
    },
    {
      "text": "YANG Bo. 2020. Online Learning Interaction in Danmaku Videos: A Pilot Study. In EdMedia+ Innovate Learning. Association for the Advancement of Computing in Education (AACE), 1262–1270.",
      "doi": ""
    },
    {
      "text": "Aaron W Calhoun, May CM Pian-Smith, Robert D Truog, David M Gaba, and Elaine C Meyer. 2015. Deception and simulation education: issues, concepts, and commentary. Simulation in Healthcare 10, 3 (2015), 163–169.",
      "doi": ""
    },
    {
      "text": "Ang Chen, Paul W Darst, and Robert P Pangrazi. 1999. What constitutes situational interest? Validating a construct in physical education. Measurement in physical education and exercise science 3, 3(1999), 157–XXX.",
      "doi": ""
    },
    {
      "text": "Chih-Ming Chen and Chung-Hsin Wu. 2015. Effects of different video lecture types on sustained attention, emotion, cognitive load, and learning performance. Computers & Education 80 (2015), 108–121.",
      "doi": "10.1016/j.compedu.2014.08.015"
    },
    {
      "text": "Gwo-Dong Chen, Jih-Hsien Lee, Chin-Yeh Wang, Po-Yao Chao, Liang-Yi Li, and Tzung-Yi Lee. 2012. An empathic avatar in a computer-aided learning program to encourage and persuade learners. Journal of Educational Technology & Society 15, 2 (2012), 62–72.",
      "doi": ""
    },
    {
      "text": "Yue Chen, Qin Gao, and Pei-Luen Patrick Rau. 2017. Watching a movie alone yet together: understanding reasons for watching Danmaku videos. International Journal of Human–Computer Interaction 33, 9(2017), 731–743.",
      "doi": ""
    },
    {
      "text": "Michelene TH Chi and Ruth Wylie. 2014. The ICAP framework: Linking cognitive engagement to active learning outcomes. Educational psychologist 49, 4 (2014), 219–243.",
      "doi": ""
    },
    {
      "text": "Konstantinos Chorianopoulos. 2018. A taxonomy of asynchronous instructional video styles. International Review of Research in Open and Distributed Learning 19, 1(2018).",
      "doi": ""
    },
    {
      "text": "M Dewan, Mahbub Murshed, and Fuhua Lin. 2019. Engagement detection in online learning: a review. Smart Learning Environments 6, 1 (2019), 1–20.",
      "doi": ""
    },
    {
      "text": "Brian Dorn, Larissa B Schroeder, and Adam Stankiewicz. 2015. Piloting TrACE: Exploring spatiotemporal anchored collaboration in asynchronous learning. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 393–403.",
      "doi": "10.1145/2675133.2675178"
    },
    {
      "text": "Patrick E Downes, Eean R Crawford, Scott E Seibert, Adam C Stoverink, and Elizabeth M Campbell. 2021. Referents or role models? The self-efficacy and job performance effects of perceiving higher performing peers.Journal of Applied Psychology 106, 3 (2021), 422.",
      "doi": ""
    },
    {
      "text": "Ilana Dubovi and Iris Tabak. 2020. An empirical analysis of knowledge co-construction in YouTube comments. Computers & Education 156 (2020), 103939.",
      "doi": ""
    },
    {
      "text": "Evren Eryilmaz, Brian Thoms, Justin Mary, Rosemary Kim, and Jakko van der Pol. 2015. Instructor versus peer attention guidance in online learning conversations. AIS Transactions on Human-Computer Interaction 7, 4(2015), 234–268.",
      "doi": ""
    },
    {
      "text": "Jennifer A Fredricks, Phyllis C Blumenfeld, and Alison H Paris. 2004. School engagement: Potential of the concept, state of the evidence. Review of educational research 74, 1 (2004), 59–109.",
      "doi": ""
    },
    {
      "text": "Anne C Frenzel, Thomas Goetz, Oliver Lüdtke, Reinhard Pekrun, and Rosemary E Sutton. 2009. Emotional transmission in the classroom: Exploring the relationship between teacher and student enjoyment.Journal of educational psychology 101, 3 (2009), 705.",
      "doi": ""
    },
    {
      "text": "Meredith D Gall. 1970. The use of questions in teaching. Review of educational research 40, 5 (1970), 707–721.",
      "doi": ""
    },
    {
      "text": "Maia Garau, Mel Slater, Vinoba Vinayagamoorthy, Andrea Brogni, Anthony Steed, and M Angela Sasse. 2003. The impact of avatar realism and eye gaze control on perceived quality of communication in a shared immersive virtual environment. In Proceedings of the SIGCHI conference on Human factors in computing systems. 529–536.",
      "doi": "10.1145/642611.642703"
    },
    {
      "text": "Barbara A Greene. 2015. Measuring cognitive engagement with self-report scales: Reflections from over 20 years of research. Educational Psychologist 50, 1 (2015), 14–30.",
      "doi": ""
    },
    {
      "text": "Philip J Guo, Juho Kim, and Rob Rubin. 2014. How video production affects student engagement: An empirical study of MOOC videos. In Proceedings of the first ACM conference on Learning@ scale conference. 41–50.",
      "doi": "10.1145/2556325.2566239"
    },
    {
      "text": "Yi-Chen Huang, Chih-Ming Chen, and Jian-Cheng Guo. 2016. Effects of attention monitoring and alarm mechanism on promoting e-Learning performance. In ICEL: Proceedings of International Conference on e-Learning. 229–237.",
      "doi": ""
    },
    {
      "text": "Eugene Hwang and Jeongmi Lee. 2021. Attention Guidance Technique Using Visual Subliminal Cues And Its Application On Videos. In ACM International Conference on Interactive Media Experiences. 167–177.",
      "doi": ""
    },
    {
      "text": "Sanna Järvelä. 1998. Socioemotional aspects of students’ learning in a cognitive-apprenticeship environment. Instructional science 26, 6 (1998), 439–472.",
      "doi": ""
    },
    {
      "text": "Shane R Jimerson, Emily Campos, and Jennifer L Greif. 2003. Toward an understanding of definitions and measures of school engagement and related terms. The California School Psychologist 8, 1 (2003), 7–27.",
      "doi": ""
    },
    {
      "text": "Adam N Joinson. 2007. Disinhibition and the Internet. In Psychology and the Internet. Elsevier, 75–92.",
      "doi": ""
    },
    {
      "text": "Ji-Youn Jung, Sihang Qiu, Alessandro Bozzon, and Ujwal Gadiraju. 2022. Great Chain of Agents: The Role of Metaphorical Representation of Agents in Conversational Crowdsourcing. In CHI Conference on Human Factors in Computing Systems. 1–22.",
      "doi": ""
    },
    {
      "text": "Judita Kasperiuniene, Meet Jariwala, Egidijus Vaskevicius, and Saulius Satkauskas. 2016. Affective engagement to virtual and live lectures. In International Conference on Information and Software Technologies. Springer, 499–508.",
      "doi": ""
    },
    {
      "text": "Kangsoo Kim, Luke Boelling, Steffen Haesler, Jeremy Bailenson, Gerd Bruder, and Greg F Welch. 2018. Does a digital assistant need a body? The influence of visual embodiment and social behavior on the perception of intelligent virtual agents in AR. In 2018 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 105–114.",
      "doi": ""
    },
    {
      "text": "Yanghee Kim and Amy L Baylor. 2006. A social-cognitive framework for pedagogical agents as learning companions. Educational technology research and development 54, 6(2006), 569–596.",
      "doi": ""
    },
    {
      "text": "Yelim Kim, Mohi Reza, Joanna McGrenere, and Dongwook Yoon. 2021. Designers characterize naturalness in voice user interfaces: their goals, practices, and challenges. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445579"
    },
    {
      "text": "Xi Lin, Mingyu Huang, and Leslie Cordie. 2018. An exploratory study: using Danmaku in online video-based lectures. Educational Media International 55, 3 (2018), 273–286.",
      "doi": ""
    },
    {
      "text": "Ati Suci Dian Martha and Harry B Santoso. 2019. The design and impact of the pedagogical agent: A systematic literature review.Journal of Educators Online 16, 1 (2019), n1.",
      "doi": ""
    },
    {
      "text": "Jeffrey D Marx and Karen Cummings. 2007. Normalized change. American Journal of Physics 75, 1 (2007), 87–91.",
      "doi": ""
    },
    {
      "text": "J Terry Mayes. 2015. Still to learn from vicarious learning. E-Learning and Digital Media 12, 3-4 (2015), 361–371.",
      "doi": ""
    },
    {
      "text": "Caitlin Mills, Nigel Bosch, Kristina Krasich, and Sidney K D’Mello. 2019. Reducing mind-wandering during vicarious learning from an intelligent tutoring system. In International Conference on Artificial Intelligence in Education. Springer, 296–307.",
      "doi": ""
    },
    {
      "text": "Ari Nugraha, Izhar Almizan Wahono, Jianpeng Zhanghe, Tomoyuki Harada, and Tomoo Inoue. 2020. Creating Dialogue Between a Tutee Agent and a Tutor in a Lecture Video Improves Students’ Attention. In International Conference on Collaboration Technologies and Social Computing. Springer, 96–111.",
      "doi": "10.1007/978-3-030-58157-2_7"
    },
    {
      "text": "John O’Donoghue, Gurmak Singh, and Charmaine Green. 2004. A comparison of the advantages and disadvantages of IT based education and the implication upon students. Digital Education Review9 (2004), 63–76.",
      "doi": ""
    },
    {
      "text": "George Palaigeorgiou and Anthea Papadopoulou. 2019. Promoting self-paced learning in the elementary classroom with interactive video, an online course platform and tablets. Education and Information Technologies 24, 1 (2019), 805–823.",
      "doi": "10.1007/s10639-018-9804-5"
    },
    {
      "text": "Cecilia Panigutti, Andrea Beretta, Fosca Giannotti, and Dino Pedreschi. 2022. Understanding the impact of explanations on advice-taking: a user study for AI-based clinical Decision Support Systems. In CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3491102.3502104"
    },
    {
      "text": "Christine Pleines. 2020. Understanding vicarious participation in online language learning. Distance Education 41, 4 (2020), 453–471.",
      "doi": ""
    },
    {
      "text": "Louise Pouliot and Paul S Cowen. 2007. Does perceived realism really matter in media effects?Media Psychology 9, 2 (2007), 241–259.",
      "doi": ""
    },
    {
      "text": "Susen Rabold, Stuart Anderson, John Lee, and Neil Mayo. 2008. YouTute: Online social networking for vicarious learning. In Proceedings of the ICL2008. Kassel University Press, 1–14.",
      "doi": ""
    },
    {
      "text": "Angélique Remacle, Stéphane Bouchard, Anne-Marie Etienne, Marie-Christine Rivard, and Dominique Morsomme. 2021. A virtual classroom can elicit teachers’ speech characteristics: evidence from acoustic measurements during in vivo and in virtuo lessons, compared to a free speech control situation. Virtual Reality 25, 4 (2021), 935–944.",
      "doi": "10.1007/s10055-020-00491-1"
    },
    {
      "text": "Deborah Richards and Virginia Dignum. 2019. Supporting and challenging learners through pedagogical agents: Addressing ethical issues through designing for values. British Journal of Educational Technology 50, 6 (2019), 2885–2901.",
      "doi": ""
    },
    {
      "text": "Joni Salminen, Soon-gyo Jung, and Bernard J Jansen. 2021. Suggestions for Online User Studies. In International Conference on Human-Computer Interaction. Springer, 127–146.",
      "doi": ""
    },
    {
      "text": "Kerstin Schankweiler. 2020. Reaction Images and Metawitnessing. Parallax 26, 3 (2020), 254–270.",
      "doi": ""
    },
    {
      "text": "Laura Scheepmaker, Kay Kender, Christopher Frauenberger, and Geraldine Fitzpatrick. 2021. Leaving the field: Designing a socio-material toolkit for teachers to continue to design technology with children. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445462"
    },
    {
      "text": "Umair Uddin Shaikh, Shakir Karim, and Zaheeruddin Asif. 2017. Re-Thinking Vygotsky: Applying social constructivism to asynchronous online courses utilizing the power of crowdsourcing. (2017).",
      "doi": ""
    },
    {
      "text": "Ellen Skinner, Carrie Furrer, Gwen Marchand, and Thomas Kindermann. 2008. Engagement and disaffection in the classroom: Part of a larger motivational dynamic?Journal of educational psychology 100, 4 (2008), 765.",
      "doi": ""
    },
    {
      "text": "Matthijs Smakman, Paul Vogt, and Elly A Konijn. 2021. Moral considerations on social robots in education: A multi-stakeholder perspective. Computers & Education 174 (2021), 104317.",
      "doi": "10.1016/j.compedu.2021.104317"
    },
    {
      "text": "Gail M Sullivan and Anthony R Artino Jr. 2013. Analyzing and interpreting data from Likert-type scales. Journal of graduate medical education 5, 4 (2013), 541–542.",
      "doi": ""
    },
    {
      "text": "Leah A Sutton. 2001. The principle of vicarious interaction in computer-mediated communications. International Journal of Educational Telecommunications 7, 3(2001), 223–242.",
      "doi": ""
    },
    {
      "text": "Lauren Szczurek, Benoît Monin, and James J Gross. 2012. The stranger effect: The rejection of affective deviants. Psychological science 23, 10 (2012), 1105–1111.",
      "doi": ""
    },
    {
      "text": "Keith S Taber. 2015. Meeting educational objectives in the affective and cognitive domains: Personal and social constructivist perspectives on enjoyment, motivation and learning chemistry. In Affective dimensions in chemistry education. Springer, 3–27.",
      "doi": ""
    },
    {
      "text": "Mohammad Tahaei and Kami Vaniea. 2022. Recruiting Participants With Programming Skills: A Comparison of Four Crowdsourcing Platforms and a CS Student Mailing List. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3491102.3501957"
    },
    {
      "text": "Yassin Taskin, Tobias Hecking, H Ulrich Hoppe, Vania Dimitrova, and Antonija Mitrovic. 2019. Characterizing comment types and levels of engagement in video-based learning as a basis for adaptive nudging. In European Conference on Technology Enhanced Learning. Springer, 362–376.",
      "doi": "10.1007/978-3-030-29736-7_27"
    },
    {
      "text": "Yi-Miau Tsai, Mareike Kunter, Oliver Lüdtke, Ulrich Trautwein, and Richard M Ryan. 2008. What makes lessons interesting? The role of situational and individual factors in three school subjects.Journal of Educational Psychology 100, 2 (2008), 460.",
      "doi": ""
    },
    {
      "text": "Cristian Vaccari and Andrew Chadwick. 2020. Deepfakes and disinformation: Exploring the impact of synthetic political video on deception, uncertainty, and trust in news. Social Media+ Society 6, 1 (2020), 2056305120903408.",
      "doi": ""
    },
    {
      "text": "Kati Vasalampi, Joona Muotka, Sanni Pöysä, Marja-Kristiina Lerkkanen, Anna-Maija Poikkeus, and Jari-Erik Nurmi. 2016. Assessment of students’ situation-specific classroom engagement by an InSitu Instrument. Learning and Individual Differences 52 (2016), 46–52.",
      "doi": ""
    },
    {
      "text": "Lev Semenovich Vygotsky and Michael Cole. 1978. Mind in society: Development of higher psychological processes. Harvard university press.",
      "doi": ""
    },
    {
      "text": "Xu Wang, Miaomiao Wen, and Carolyn P Rosé. 2016. Towards triggering higher-order thinking behaviors in MOOCs. In Proceedings of the Sixth International Conference on Learning Analytics & Knowledge. 398–407.",
      "doi": "10.1145/2883851.2883964"
    },
    {
      "text": "Justin D Weisz, Sara Kiesler, Hui Zhang, Yuqing Ren, Robert E Kraut, and Joseph A Konstan. 2007. Watching together: integrating text chat with video. In Proceedings of the SIGCHI conference on Human factors in computing systems. 877–886.",
      "doi": "10.1145/1240624.1240756"
    },
    {
      "text": "James V Wertsch. 1993. Voices of the mind: Sociocultural approach to mediated action. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Qunfang Wu, Yisi Sang, and Yun Huang. 2019. Danmaku: a new paradigm of social interaction via online videos. ACM Transactions on Social Computing 2, 2 (2019), 1–24.",
      "doi": "10.1145/3329485"
    },
    {
      "text": "Yabo Zhang, Aiping Qian, Zhongling Pi, and Jiumin Yang. 2019. Danmaku related to video content facilitates learning. Journal of Educational Technology Systems 47, 3 (2019), 359–372.",
      "doi": ""
    }
  ]
}