{
  "doi": "10.1145/3544548.3580966",
  "title": "You spin me right round, baby, right round: Examining the Impact of Multi-Sensory Self-Motion Cues on Motion Sickness During a VR Reading Task",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Motion sickness is a problem for many in everyday travel and will become more prevalent with the rise of automated vehicles. Virtual Reality (VR) headsets have shown significant promise in-transit, enabling passengers to engage in immersive entertainment and productivity experiences. In a controlled multi-session motion sickness study using an actuated rotating chair, we examine the potential of multi-sensory visual and auditory motion cues, presented during a VR reading task, for mitigating motion sickness. We found that visual cues are most efficient in reducing symptoms, with auditory cues showing some beneficial effects when combined with the visual. Motion sickness had negative effects on presence as well as task performance, and despite the cognitive demand and multi-sensory cues, motion sickness still reached problematic levels. Our work emphasises the need for effective mitigations and the design of stronger multi-sensory motion cues if VR is to fulfil its potential for passengers.",
  "tags": [
    "motion sickness",
    "automated vehicles",
    "rotation",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Katharina Margareta Theresa Pöhlmann",
      "institution": "Computing Science, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660569947",
      "orcid": "0000-0003-1989-3411"
    },
    {
      "name": "Gang Li",
      "institution": "Psychology, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660569431",
      "orcid": "0000-0002-5251-7445"
    },
    {
      "name": "Mark Mcgill",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442594051",
      "orcid": "0000-0002-8333-5687"
    },
    {
      "name": "Reuben Markoff",
      "institution": "Computing Science, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780768",
      "orcid": "0000-0002-9477-7958"
    },
    {
      "name": "Stephen Anthony Brewster",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    }
  ],
  "references": [
    {
      "text": "2022. About the University Clinical Aptitude Test (UCAT). https://www.ucat.ac.uk/",
      "doi": ""
    },
    {
      "text": "2022. Adding thrill to every ride. https://www.holoride.com/en",
      "doi": ""
    },
    {
      "text": "2022. Vive United Kingdom: Discover virtual reality beyond imagination. https://www.vive.com/uk/",
      "doi": ""
    },
    {
      "text": "Jonathan Z Bakdash and Laura R Marusich. 2017. Repeated measures correlation. Frontiers in psychology 8 (2017), 456.",
      "doi": ""
    },
    {
      "text": "Marcel Bastiaansen, Monique Oosterholt, Ondrej Mitas, Danny Han, and Xander Lub. 2022. An emotional roller coaster: Electrophysiological evidence of emotional engagement during a roller-coaster ride with virtual reality add-on. Journal of Hospitality & Tourism Research 46, 1 (2022), 29–54.",
      "doi": ""
    },
    {
      "text": "Daniel R Berger, Jörg Schulte-Pelkum, and Heinrich H Bülthoff. 2010. Simulating believable forward accelerations on a stewart motion platform. ACM Transactions on Applied Perception (TAP) 7, 1 (2010), 1–27.",
      "doi": "10.1145/1658349.1658354"
    },
    {
      "text": "Alain Berthoz, Bernard Pavard, and Laurence R Young. 1975. Perception of linear horizontal self-motion induced by peripheral vision (linearvection) basic characteristics and visual-vestibular interactions. Experimental brain research 23, 5 (1975), 471–489.",
      "doi": ""
    },
    {
      "text": "Juffrizal Bin Karjanto, Nidzamuddin Md. Yusof, Chow Wang, Frank Delbressine, Matthias Rauterberg, Jacques Terken, and Alberto Martini. 2017. Situation awareness and motion sickness in automated vehicle driving experience: a preliminary study of peripheral visual information. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct. 57–61.",
      "doi": "10.1145/3131726.3131745"
    },
    {
      "text": "Frederick Bonato and Andrea Bubka. 2006. Chromaticity, spatial complexity, and self-motion perception. Perception 35, 1 (2006), 53–64.",
      "doi": ""
    },
    {
      "text": "Jelte E Bos. 2015. Less sickness with more motion and/or mental distraction. Journal of Vestibular Research 25, 1 (2015), 23–33.",
      "doi": ""
    },
    {
      "text": "Jelte E Bos, Scott N MacKinnon, and Anthony Patterson. 2005. Motion sickness symptoms in a ship motion simulator: effects of inside, outside, and no view. Aviation, space, and environmental medicine 76, 12 (2005), 1111–1118.",
      "doi": ""
    },
    {
      "text": "Th Brandt, Johannes Dichgans, and Ellen Koenig. 1973. Differential effects of central versus peripheral vision on egocentric and exocentric motion perception. Experimental brain research 16, 5 (1973), 476–491.",
      "doi": ""
    },
    {
      "text": "Malcolm Burt and Candice Louw. 2019. Virtual reality enhanced roller coasters and the future of entertainment–audience expectations. World Leisure Journal 61, 3 (2019), 183–199.",
      "doi": ""
    },
    {
      "text": "Hyung-jun Cho and Gerard J Kim. 2020. Roadvr: Mitigating the effect of vection and sickness by distortion of pathways for in-car virtual reality. In 26th ACM Symposium on Virtual Reality Software and Technology. 1–3.",
      "doi": ""
    },
    {
      "text": "Hyung-Jun Cho and Gerard J Kim. 2022. RideVR: Reducing Sickness for In-Car Virtual Reality by Mixed-in Presentation of Motion Flow Information. IEEE Access 10(2022), 34003–34011.",
      "doi": ""
    },
    {
      "text": "Natalia Cooper, Ferdinando Milella, Carlo Pinto, Iain Cant, Mark White, and Georg Meyer. 2018. The effects of substitute multisensory feedback on task performance and the sense of presence in a virtual reality environment. PloS one 13, 2 (2018), e0191846.",
      "doi": ""
    },
    {
      "text": "Natalia Cooper, Ferdinando Millela, Iain Cant, Mark D White, and Georg Meyer. 2021. Transfer of training—Virtual reality training with augmented multisensory cues improves user experience during training and task performance in the real world. PloS one 16, 3 (2021), e0248225.",
      "doi": ""
    },
    {
      "text": "Joakim Dahlman, Anna Sjörs, Johan Lindström, Torbjörn Ledin, and Torbjörn Falkmer. 2009. Performance and autonomic responses during motion sickness. Human factors 51, 1 (2009), 56–66.",
      "doi": ""
    },
    {
      "text": "Abhraneil Dam and Myounghoon Jeon. 2021. A Review of Motion Sickness in Automated Vehicles. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 39–48.",
      "doi": "10.1145/3409118.3475146"
    },
    {
      "text": "Ksander N de Winkel, Paolo Pretto, Suzanne AE Nooij, Iris Cohen, and Heinrich H Bülthoff. 2021. Efficacy of augmented visual environments for reducing sickness in autonomous vehicles. Applied Ergonomics 90(2021), 103282.",
      "doi": ""
    },
    {
      "text": "André Delorme and Christian Martin. 1986. Roles of retinal periphery and depth periphery in linear vection and visual control of standing in humans.Canadian Journal of Psychology/Revue canadienne de psychologie 40, 2(1986), 176.",
      "doi": ""
    },
    {
      "text": "Johannes Dichgans and Thomas Brandt. 1978. Visual-vestibular interaction: Effects on self-motion perception and postural control. In Perception. Springer, 755–804.",
      "doi": ""
    },
    {
      "text": "Cyriel Diels. 2014. Will autonomous vehicles make us sick. Contemporary ergonomics and human factors(2014), 301–307.",
      "doi": ""
    },
    {
      "text": "Cyriel Diels and Jelte Bos. 2021. Great expectations: On the design of predictive motion cues to alleviate carsickness. In International Conference on Human-Computer Interaction. Springer, 240–251.",
      "doi": "10.1007/978-3-030-78358-7_16"
    },
    {
      "text": "Cyriel Diels and Jelte E Bos. 2015. User interface considerations to prevent self-driving carsickness. In Adjunct proceedings of the 7th international conference on automotive user interfaces and interactive vehicular applications. 14–19.",
      "doi": "10.1145/2809730.2809754"
    },
    {
      "text": "Cyriel Diels and Jelte E Bos. 2016. Self-driving carsickness. Applied ergonomics 53(2016), 374–382.",
      "doi": ""
    },
    {
      "text": "Cyriel Diels, Jelte E Bos, Katharina Hottelart, and Patrice Reilhac. 2016. The impact of display position on motion sickness in automated vehicles: an on-road study.",
      "doi": ""
    },
    {
      "text": "Cyriel Diels, Jelte E Bos, Katharina Hottelart, and Patrice Reilhac. 2016. Motion sickness in automated vehicles: the elephant in the room. In Road Vehicle Automation 3. Springer, 121–129.",
      "doi": ""
    },
    {
      "text": "Ivo Manuel Neves Rodrigues dos Santos. 2019. Auditory Induced Vection: Exploring Angular Acceleration Of Sound Sources. (2019).",
      "doi": ""
    },
    {
      "text": "Sarah D’Amour, Jelte E Bos, and Behrang Keshavarz. 2017. The efficacy of airflow and seat vibration on reducing visually induced motion sickness. Experimental brain research 235, 9 (2017), 2811–2820.",
      "doi": ""
    },
    {
      "text": "Egibson@tuc.org.uk. 2019. Annual commuting time is up 21 hours compared to a decade ago, finds tuc. https://www.tuc.org.uk/news/annual-commuting-time-21-hours-compared-decade-ago-finds-tuc",
      "doi": ""
    },
    {
      "text": "Benjamin Gardner and Charles Abraham. 2007. What drives car use? A grounded theory analysis of commuters’ reasons for driving. Transportation Research Part F: Traffic Psychology and Behaviour 10, 3(2007), 187–200.",
      "doi": ""
    },
    {
      "text": "James J Gibson. 1950. The perception of the visual world.(1950).",
      "doi": ""
    },
    {
      "text": "James Jerome Gibson and Leonard Carmichael. 1966. The senses considered as perceptual systems. Vol. 2. Houghton Mifflin Boston.",
      "doi": ""
    },
    {
      "text": "John F Golding. 1998. Motion sickness susceptibility questionnaire revised and its relationship to other forms of sickness. Brain research bulletin 47, 5 (1998), 507–516.",
      "doi": ""
    },
    {
      "text": "John F Golding. 2016. Motion sickness. Handbook of clinical neurology 137 (2016), 371–390.",
      "doi": ""
    },
    {
      "text": "Rebecca Hainich, Uwe Drewitz, Klas Ihme, Jan Lauermann, Mathias Niedling, and Michael Oehl. 2021. Evaluation of a Human–Machine Interface for Motion Sickness Mitigation Utilizing Anticipatory Ambient Light Cues in a Realistic Automated Driving Setting. Information 12, 4 (2021), 176.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "David Hecht, Miriam Reiner, and Gad Halevy. 2005. Multi-Modal Stimulation, Response Time, and Presence. In Proceedings of the 8th Annual International Workshop on Presence. 269–274.",
      "doi": ""
    },
    {
      "text": "Philipp Hock, Sebastian Benedikter, Jan Gugenheimer, and Enrico Rukzio. 2017. Carvr: Enabling in-car virtual reality entertainment. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4034–4044.",
      "doi": "10.1145/3025453.3025665"
    },
    {
      "text": "Philipp Hock, Sebastian Benedikter, Jan Gugenheimer, and Enrico Rukzio. 2017. CarVR: Enabling In-Car Virtual Reality Entertainment. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4034–4044. https://doi.org/10.1145/3025453.3025665",
      "doi": "10.1145/3025453.3025665"
    },
    {
      "text": "Ian P Howard and Thomas Heckmann. 1989. Circular vection as a function of the relative sizes, distances, and positions of two competing visual displays. Perception 18, 5 (1989), 657–665.",
      "doi": ""
    },
    {
      "text": "Julie Iskander, Mohammed Attia, Khaled Saleh, Darius Nahavandi, Ahmed Abobakr, Shady Mohamed, Houshyar Asadi, Abbas Khosravi, Chee Peng Lim, and Mohammed Hossny. 2019. From car sickness to autonomous car sickness: A review. Transportation research part F: traffic psychology and behaviour 62 (2019), 716–726.",
      "doi": ""
    },
    {
      "text": "Bill Kapralos, Daniel Zikovitz, Michael R Jenkin, and Laurence R Harris. 2004. Auditory cues in the perception of self motion. In Audio Engineering Society Convention 116. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Mohamed Kari, Tobias Grosse-Puppendahl, Alexander Jagaciak, David Bethge, Reinhard Schütte, and Christian Holz. 2021. SoundsRide: Affordance-Synchronized Music Mixing for In-Car Audio Augmented Reality. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 118–133. https://doi.org/10.1145/3472749.3474739",
      "doi": "10.1145/3472749.3474739"
    },
    {
      "text": "Juffrizal Karjanto, Nidzamuddin Md Yusof, Chao Wang, Jacques Terken, Frank Delbressine, and Matthias Rauterberg. 2018. The effect of peripheral visual feedforward system in enhancing situation awareness and mitigating motion sickness in fully automated driving. Transportation research part F: traffic psychology and behaviour 58 (2018), 678–692.",
      "doi": ""
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203–220.",
      "doi": ""
    },
    {
      "text": "Robert S Kennedy, Kay M Stanney, and William P Dunlap. 2000. Duration and exposure to virtual environments: sickness curves during and across sessions. Presence: Teleoperators & Virtual Environments 9, 5(2000), 463–472.",
      "doi": "10.1162/105474600566952"
    },
    {
      "text": "Behrang Keshavarz and Heiko Hecht. 2014. Pleasant music as a countermeasure against visually induced motion sickness. Applied ergonomics 45, 3 (2014), 521–527.",
      "doi": ""
    },
    {
      "text": "Behrang Keshavarz, Lawrence J Hettinger, Robert S Kennedy, and Jennifer L Campos. 2014. Demonstrating the potential for dynamic auditory stimulation to contribute to motion sickness. PloS one 9, 7 (2014), e101016.",
      "doi": ""
    },
    {
      "text": "Behrang Keshavarz, Lawrence J Hettinger, Daniel Vena, and Jennifer L Campos. 2014. Combined effects of auditory and visual cues on the perception of vection. Experimental brain research 232, 3 (2014), 827–836.",
      "doi": ""
    },
    {
      "text": "Behrang Keshavarz, Aaron Emile Philipp-Muller, Wanja Hemmerich, Bernhard E Riecke, and Jennifer L Campos. 2019. The effect of visual motion stimulus characteristics on vection and visually induced motion sickness. Displays 58(2019), 71–81.",
      "doi": ""
    },
    {
      "text": "Behrang Keshavarz, Daniela Stelzmann, Aurore Paillard, and Heiko Hecht. 2015. Visually induced motion sickness can be alleviated by pleasant odors. Experimental brain research 233, 5 (2015), 1353–1364.",
      "doi": ""
    },
    {
      "text": "Young Youn Kim, Hyun Ju Kim, Eun Nam Kim, Hee Dong Ko, and Hyun Taek Kim. 2005. Characteristic changes in the physiological components of cybersickness. Psychophysiology 42, 5 (2005), 616–625.",
      "doi": ""
    },
    {
      "text": "Lars Kooijman, Houshyar Asadi, Shady Mohamed, and Saeid Nahavandi. 2021. A Systematic Review on the Elicitation and Enhancement of Vection Through Tactile Stimulation. (2021).",
      "doi": ""
    },
    {
      "text": "Lars Kooijman, Houshyar Asadi, Shady Mohamed, and Saeid Nahavandi. 2022. Does A Secondary Task Inhibit Vection in Virtual Reality?(2022).",
      "doi": ""
    },
    {
      "text": "Wesley WO Krueger. 2011. Controlling motion sickness and spatial disorientation and enhancing vestibular rehabilitation with a user-worn see-through display. The Laryngoscope 121, S2 (2011), S17–S35.",
      "doi": ""
    },
    {
      "text": "Ouren X Kuiper, Jelte E Bos, and Cyriel Diels. 2018. Looking forward: In-vehicle auxiliary display positioning affects carsickness. Applied Ergonomics 68(2018), 169–175.",
      "doi": ""
    },
    {
      "text": "Ouren X Kuiper, Jelte E Bos, Eike A Schmidt, Cyriel Diels, and Stefan Wolter. 2020. knowing what’s coming: unpredictable motion causes more motion sickness. Human Factors 62, 8 (2020), 1339–1348.",
      "doi": ""
    },
    {
      "text": "James R Lackner. 1977. Induction of illusory self-rotation and nystagmus by a rotating sound-field.Aviation, space, and environmental medicine(1977).",
      "doi": ""
    },
    {
      "text": "Pontus Larsson, Daniel Vastfjall, and Mendel Kleiner. 2002. Better presence and performance in virtual environments by improved binaural sound rendering. In Audio Engineering Society Conference: 22nd International Conference: Virtual, Synthetic, and Entertainment Audio. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Pontus Larsson, Daniel Västfjäll, and Mendel Kleiner. 2004. Perception of self-motion and presence in auditory virtual environments. In Proceedings of seventh annual workshop presence, Vol. 2004. 252–258.",
      "doi": ""
    },
    {
      "text": "Jingyi Li, Ceenu George, Andrea Ngao, Kai Holländer, Stefan Mayer, and Andreas Butz. 2020. An Exploration of Users’ Thoughts on Rear-Seat Productivity in Virtual Reality. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 92–95.",
      "doi": ""
    },
    {
      "text": "Jingyi Li, Ceenu George, Andrea Ngao, Kai Holländer, Stefan Mayer, and Andreas Butz. 2021. Rear-seat productivity in virtual reality: Investigating vr interaction in the confined space of a car. Multimodal Technologies and Interaction 5, 4 (2021), 15.",
      "doi": ""
    },
    {
      "text": "Jingyi Li, Ceenu George, Andrea Ngao, Kai Holländer, Stefan Mayer, and Andreas Butz. 2021. Rear-Seat Productivity in Virtual Reality: Investigating VR Interaction in the Confined Space of a Car. Multimodal Technologies and Interaction 5, 4 (2021). https://doi.org/10.3390/mti5040015",
      "doi": ""
    },
    {
      "text": "Panagiotis Matsangas, Michael E McCauley, and William Becker. 2014. The effect of mild motion sickness and sopite syndrome on multitasking cognitive performance. Human factors 56, 6 (2014), 1124–1135.",
      "doi": ""
    },
    {
      "text": "Mark McGill, Stephen Brewster, David McGookin, and Graham Wilson. 2020. Acoustic Transparency and the Changing Soundscape of Auditory Mixed Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376702",
      "doi": "10.1145/3313831.3376702"
    },
    {
      "text": "Mark Mcgill, Aidan Kehoe, Euan Freeman, and Stephen Brewster. 2020. Expanding the bounds of seated virtual workspaces. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 3(2020), 1–40.",
      "doi": "10.1145/3380959"
    },
    {
      "text": "Mark McGill, Gang Li, Alex Ng, Laura Bajorunaite, Julie Williamson, Frank Pollick, and Stephen Brewster. 2022. Augmented, Virtual and Mixed Reality Passenger Experiences. In User Experience Design in the Era of Automated Driving. Springer, 445–475.",
      "doi": ""
    },
    {
      "text": "Mark McGill, Alexander Ng, and Stephen Brewster. 2017. I am the passenger: how visual motion cues can influence sickness for in-car VR. In Proceedings of the 2017 chi conference on human factors in computing systems. 5655–5668.",
      "doi": "10.1145/3025453.3026046"
    },
    {
      "text": "Mark McGill, Julie Williamson, Alexander Ng, Frank Pollick, and Stephen Brewster. 2020. Challenges in passenger use of mixed reality headsets in cars and other transportation. Virtual Reality 24, 4 (2020), 583–603.",
      "doi": "10.1007/s10055-019-00420-x"
    },
    {
      "text": "Mark McGill, Graham Wilson, Daniel Medeiros, and Stephen Brewster. 2022. PassengXR: A Low Cost Platform for Any-Car, Multi-User, Motion-Based Passenger XR Experiences. (2022).",
      "doi": ""
    },
    {
      "text": "Meaghan McManus, Sarah D’Amour, and Laurence R Harris. 2017. Using optic flow in the far peripheral field. Journal of vision 17, 8 (2017), 3–3.",
      "doi": ""
    },
    {
      "text": "Nidzamuddin Md. Yusof, Juffrizal Karjanto, Shivam Kapoor, Jacques Terken, Frank Delbressine, and Matthias Rauterberg. 2017. Experimental setup of motion sickness and situation awareness in automated vehicle riding experience. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct. 104–109.",
      "doi": ""
    },
    {
      "text": "Daniel Medeiros, Mark McGill, Alexander Ng, Robert McDermid, Nadia Pantidi, Julie Williamson, and Stephen Brewster. 2022. From Shielding to Avoidance: Passenger Augmented Reality and the Layout of Virtual Displays for Productivity in Shared Transit. IEEE Transactions on Visualization and Computer Graphics (2022).",
      "doi": ""
    },
    {
      "text": "Shinji Nakamura. 2006. Effects of depth, eccentricity and size of additional static stimulus on visually induced self-motion perception. Vision Research 46, 15 (2006), 2344–2353.",
      "doi": ""
    },
    {
      "text": "Shinji Nakamura. 2008. Effects of stimulus eccentricity on vection reevaluated with a binocularly defined depth 1. Japanese Psychological Research 50, 2 (2008), 77–86.",
      "doi": ""
    },
    {
      "text": "Shinji Nakamura and Shinsuke Shimojo. 1999. Critical role of foreground stimuli in perceiving visually induced self-motion (vection). Perception 28, 7 (1999), 893–902.",
      "doi": ""
    },
    {
      "text": "Alexander Ng, Daniel Medeiros, Mark McGill, Julie Williamson, and Stephen Brewster. 2021. The Passenger Experience of Mixed Reality Virtual Display Layouts in Airplane Environments. In 2021 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 265–274.",
      "doi": ""
    },
    {
      "text": "Suzanne AE Nooij, Christopher J Bockisch, Heinrich H Bülthoff, and Dominik Straumann. 2021. Beyond sensory conflict: The role of beliefs and perception in motion sickness. PLoS One 16, 1 (2021), e0245295.",
      "doi": ""
    },
    {
      "text": "Masao Ohmi, Ian P Howard, and Jack P Landolt. 1987. Circular vection as a function of foreground-background relationships. Perception 16, 1 (1987), 17–22.",
      "doi": ""
    },
    {
      "text": "Stephen Palmisano, Robert S Allison, Mark M Schira, and Robert J Barry. 2015. Future challenges for vection research: definitions, functional significance, measures, and neural bases. Frontiers in psychology 6 (2015), 193.",
      "doi": ""
    },
    {
      "text": "Pablo E Paredes, Stephanie Balters, Kyle Qian, Elizabeth L Murnane, Francisco Ordóñez, Wendy Ju, and James A Landay. 2018. Driving with the fishes: Towards calming and mindful virtual reality experiences for the car. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–21.",
      "doi": "10.1145/3287062"
    },
    {
      "text": "Andrew Paroz and Leigh Ellen Potter. 2017. Cybersickness and migraine triggers: exploring common ground. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. 417–421.",
      "doi": "10.1145/3152771.3156148"
    },
    {
      "text": "Merle G Paule, John J Chelonis, Donna J Blake, and John L Dornhoffer. 2004. Effects of drug countermeasures for space motion sickness on working memory in humans. Neurotoxicology and teratology 26, 6 (2004), 825–837.",
      "doi": ""
    },
    {
      "text": "Katharina MT Pohlmann, Julia Focker, Patrick Dickinson, Adrian Parke, and Louise O’Hare. 2021. The Effect of Motion Direction and Eccentricity on Vection and Cybersickness in Virtual Reality-an EEG study. In PERCEPTION, Vol. 50. SAGE PUBLICATIONS LTD 1 OLIVERS YARD, 55 CITY ROAD, LONDON EC1Y 1SP, ENGLAND, 94–95.",
      "doi": ""
    },
    {
      "text": "Katharina Margareta Theresa Pöhlmann, Marc Stephan Kurt Auf Der Heyde, Gang Li, Frans Verstraten, Stephen Anthony Brewster, and Mark McGill. 2022. Can Visual Motion Presented in a VR Headset Reduce Motion Sickness for Vehicle Passengers?. In Adjunct Proceedings of the 14th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 114–118.",
      "doi": ""
    },
    {
      "text": "Katharina MT Pöhlmann, Marc Auf der Heyde, Gang Li, Frans Verstraten, Stephen Brewster, and Mark McGill. 2022. Can Visual Motion Presented in a VR Headset Reduce Motion Sickness for Vehicle Passengers?. In ACM.",
      "doi": ""
    },
    {
      "text": "James T Reason. 1978. Motion sickness adaptation: a neural mismatch model. Journal of the Royal Society of Medicine 71, 11 (1978), 819–829.",
      "doi": ""
    },
    {
      "text": "James T Reason and Joseph John Brand. 1975. Motion sickness.Academic press.",
      "doi": ""
    },
    {
      "text": "Bernhard E Riecke. 2011. Compelling self-motion through virtual environments without actual self-motion: using self-motion illusions (“vection”) to improve user experience in VR. Virtual reality 8, 1 (2011), 149–178.",
      "doi": ""
    },
    {
      "text": "Bernhard E Riecke. 2016. Using spatialized sound to enhance self-motion perception in virtual environments and beyond: auditory and multi-modal contributions. Canadian Acoustics 44, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Bernhard E Riecke. 2016. Using spatialized sound to enhance self-motion perception in virtual environments and beyond: auditory and multi-modal contributions. Canadian Acoustics 44, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Bernhard E Riecke, Daniel Feuereissen, and John J Rieser. 2009. Auditory self-motion simulation is facilitated by haptic and vibrational cues suggesting the possibility of actual motion. ACM Transactions on Applied Perception (TAP) 6, 3 (2009), 1–22.",
      "doi": "10.1145/1577755.1577763"
    },
    {
      "text": "Bernhard E Riecke, Jörg Schulte-Pelkum, Marios N Avraamides, Markus Von Der Heyde, and Heinrich H Bülthoff. 2006. Cognitive factors can influence self-motion perception (vection) in virtual reality. ACM Transactions on Applied Perception (TAP) 3, 3 (2006), 194–216.",
      "doi": "10.1145/1166087.1166091"
    },
    {
      "text": "Bernhard E Riecke, Jörg Schulte-Pelkum, Franck Caniard, and Heinrich H Bülthoff. 2005. Spatialized auditory cues enhance the visually-induced self-motion illusion (circular vection) in Virtual Reality. (2005).",
      "doi": ""
    },
    {
      "text": "Bernhard E Riecke, Aleksander Väljamäe, and Jörg Schulte-Pelkum. 2009. Moving sounds enhance the visually-induced self-motion illusion (circular vection) in virtual reality. ACM Transactions on Applied Perception (TAP) 6, 2 (2009), 1–27.",
      "doi": "10.1145/1577755.1577763"
    },
    {
      "text": "Bernhard E Riecke, Daniel Västfjäll, Pontus Larsson, and Jörg Schulte-Pelkum. 2005. Top-down and multi-modal influences on self-motion perception in virtual reality. In Proceedings of HCI international 2005. 1–10.",
      "doi": ""
    },
    {
      "text": "Angus H Rupert and Ognyan I Kolev. 2008. The use of tactile cues to modify the perception of self-motion. Technical Report. ARMY AEROMEDICAL RESEARCH LAB FORT RUCKER AL.",
      "doi": ""
    },
    {
      "text": "Shuichi Sakamoto, Yusuke Osada, Yôiti Suzuki, and Jiro Gyoba. 2004. The effects of linearly moving sound images on self-motion perception. Acoustical Science and Technology 25, 1 (2004), 100–102.",
      "doi": ""
    },
    {
      "text": "Spencer Salter, Doug Thake, Stratis Kanarachos, and Cyriel Diels. 2019. Motion sickness prediction device for automated vehicles. International Journal of Mechanical and Production Engineering 7, 2(2019), 68–74.",
      "doi": ""
    },
    {
      "text": "Thomas Schubert, Frank Friedmann, and Holger Regenbrecht. 2001. The experience of presence: Factor analytic insights. Presence: Teleoperators & Virtual Environments 10, 3(2001), 266–281.",
      "doi": "10.1162/105474601300343603"
    },
    {
      "text": "J Schulte-Pelkum, BE Riecke, and HH Bülthoff. 2004. Vibrational cues enhance believability of ego-motion simulation. In 5th International Multisensory Research Forum (IMRF 2004).",
      "doi": ""
    },
    {
      "text": "Takeharu Seno, Emi Hasuo, Hiroyuki Ito, and Yoshitaka Nakajima. 2012. Perceptually plausible sounds facilitate visually induced self-motion perception (vection). Perception 41, 5 (2012), 577–593.",
      "doi": ""
    },
    {
      "text": "Takeharu Seno, Hiroyuki Ito, and Shoji Sunaga. 2009. The object and background hypothesis for vection. Vision research 49, 24 (2009), 2973–2982.",
      "doi": ""
    },
    {
      "text": "Takeharu Seno, Hiroyuki Ito, and Shoji Sunaga. 2012. Vection can be induced in the absence of explicit motion stimuli. Experimental brain research 219, 2 (2012), 235–244.",
      "doi": ""
    },
    {
      "text": "Takeharu Seno, Kayoko Murata, Yoshitaka Fujii, Hidetoshi Kanaya, Masaki Ogawa, Kousuke Tokunaga, and Stephen Palmisano. 2018. Vection is enhanced by increased exposure to optic flow. i-Perception 9, 3 (2018), 2041669518774069.",
      "doi": ""
    },
    {
      "text": "Takeharu Seno, Masaki Ogawa, Hiroyuki Ito, and Shoji Sunaga. 2011. Consistent air flow to the face facilitates vection. Perception 40, 10 (2011), 1237–1240.",
      "doi": ""
    },
    {
      "text": "Yasuhiro Seya, Takayuki Tsuji, and Hiroyuki Shinoda. 2014. Effect of depth order on linear vection with optical flows. i-Perception 5, 7 (2014), 630–640.",
      "doi": ""
    },
    {
      "text": "Joseph Smyth, Stewart Birrell, Alex Mouzakitis, and Paul Jennings. 2018. Motion sickness and human performance–exploring the impact of driving simulator user trials. In International Conference on Applied Human Factors and Ergonomics. Springer, 445–457.",
      "doi": ""
    },
    {
      "text": "Kay M Stanney. 2014. Visually induced motion sickness: causes, characteristics, and countermeasures. In Handbook of virtual environments. CRC Press, 677–728.",
      "doi": ""
    },
    {
      "text": "Kay M Stanney, Kelly S Hale, Isabelina Nahmens, and Robert S Kennedy. 2003. What to expect from immersive virtual environment exposure: Influences of gender, body mass index, and past experience. Human factors 45, 3 (2003), 504–520.",
      "doi": ""
    },
    {
      "text": "Jonathan Steuer. 1992. Defining virtual reality: Dimensions determining telepresence. Journal of communication 42, 4 (1992), 73–93.",
      "doi": "10.1111/j.1460-"
    },
    {
      "text": "Yasuaki Tamada and Takeharu Seno. 2015. Roles of size, position, and speed of stimulus in vection with stimuli projected on a ground surface. Aerospace medicine and human performance 86, 9 (2015), 794–802.",
      "doi": ""
    },
    {
      "text": "Shigehito Tanahashi, Kaoru Ashihara, and Hiroyasu Ujike. 2015. Effects of auditory information on self-motion perception during simultaneous presentation of visual shearing motion. Frontiers in psychology 6 (2015), 749.",
      "doi": ""
    },
    {
      "text": "Laura Telford and Barrie J Frost. 1993. Factors affecting the onset and magnitude of linear vection. Perception & psychophysics 53, 6 (1993), 682–692.",
      "doi": ""
    },
    {
      "text": "Angelica M Tinga, Chris Jansen, Maarten J van der Smagt, Tanja CW Nijboer, and Jan BF van Erp. 2018. Inducing circular vection with tactile stimulation encircling the waist. Acta psychologica 182(2018), 32–38.",
      "doi": ""
    },
    {
      "text": "Henry Togwell, Mark McGill, Graham Wilson, Daniel Medeiros, and Stephen Anthony Brewster. 2022. In-cAR Gaming: Exploring the use of AR headsets to Leverage Passenger Travel Environments for Mixed Reality Gameplay. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–7.",
      "doi": "10.1145/3491101.3519741"
    },
    {
      "text": "Aleksander Väljamäe. 2009. Auditorily-induced illusory self-motion: A review. Brain research reviews 61, 2 (2009), 240–255.",
      "doi": ""
    },
    {
      "text": "Aleksander Väljamäe, Pontus Larsson, Daniel Västfjäll, and Mendel Kleiner. 2009. Auditory landmarks enhance circular vection in multimodal virtual reality. Journal of the Audio Engineering Society 57, 3 (2009), 111–120.",
      "doi": ""
    },
    {
      "text": "Aleksander Väljamäe and Sara Sell. 2014. The influence of imagery vividness on cognitive and perceptual cues in circular auditorily-induced vection. Frontiers in psychology 5 (2014), 1362.",
      "doi": ""
    },
    {
      "text": "Séamas Weech, Sophie Kenny, and Michael Barnett-Cowan. 2019. Presence and cybersickness in virtual reality are negatively related: a review. Frontiers in psychology 10 (2019), 158.",
      "doi": ""
    },
    {
      "text": "Christopher D Wickens. 2008. Multiple resources and mental workload. Human factors 50, 3 (2008), 449–455.",
      "doi": ""
    },
    {
      "text": "Carolin Wienrich, Christine Katharina Weidner, Celina Schatto, David Obremski, and Johann Habakuk Israel. 2018. A virtual nose as a rest-frame-the impact on simulator sickness and game experience. In 2018 10th international conference on virtual worlds and games for serious applications (VS-Games). IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Graham Wilson and Stephen A Brewster. 2017. Multi-moji: Combining thermal, vibrotactile & visual stimuli to expand the affective range of feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1743–1755.",
      "doi": "10.1145/3025453.3025614"
    },
    {
      "text": "Dohyeon Yeo, Gwangbin Kim, and SeungJun Kim. 2019. MAXIM: Mixed-reality Automotive Driving XIMulation. In 2019 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). 460–464. https://doi.org/10.1109/ISMAR-Adjunct.2019.00124",
      "doi": ""
    },
    {
      "text": "Myeung-Sook Yoh. 2001. The reality of virtual reality. In Proceedings seventh international conference on virtual systems and multimedia. IEEE, 666–674.",
      "doi": "10.5555/882502.884873"
    },
    {
      "text": "Nidzamuddin Md Yusof, Juffrizal Karjanto, Nakul Shetty, Jacques Terken, and Matthias Rauterberg. 2019. Motion sickness mitigation in autonomous vehicles by calming effect through vibration. Proceedings of Mechanical Engineering Research Day 2019 2019 (2019), 101–103.",
      "doi": ""
    },
    {
      "text": "Celina Zhou, Clara Luisa Bryan, Evan Wang, N Sertac Artan, and Ziqian Dong. 2019. Cognitive distraction to improve cybersickness in virtual reality environment. In 2019 IEEE 16th International Conference on Mobile Ad Hoc and Sensor Systems Workshops (MASSW). IEEE, 72–76.",
      "doi": ""
    }
  ]
}