{
  "doi": "10.1145/3544548.3581286",
  "title": "Community-Driven Information Accessibility: Online Sign Language Content Creation within d/Deaf Communities",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2023,
  "badges": [],
  "abstract": "Information access is one of the most significant challenges faced by d/Deaf signers due to a lack of sign language information. Given the challenges in machine-driven solutions, we seek to understand how d/Deaf communities can support the growth of sign language content. Based on interviews with 12 d/Deaf people in China, we found that d/Deaf videos, i.e., sign language videos created by and for d/Deaf people, can be crucial information sources and educational materials. Combining content analysis of 360 d/Deaf videos to better understand this type of video, we show how d/Deaf communities co-create information accessibility through collaboration in content creation online. We uncover two major challenges that creators need to address, e.g., difficulties in interpretation and inconsistent content qualities. We propose potential design opportunities and future research directions to support d/Deaf people’s needs for sign language content through collaboration within d/Deaf communities.",
  "authors": [
    {
      "name": "Xinru Tang",
      "institution": "University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660644270",
      "orcid": "0000-0001-6426-1363"
    },
    {
      "name": "Xiang Chang",
      "institution": "Sichuan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783559",
      "orcid": "0000-0003-1450-646X"
    },
    {
      "name": "Nuoran Chen",
      "institution": "Engineering School, University of California, Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783695",
      "orcid": "0000-0002-2659-659X"
    },
    {
      "name": "Yingjie (MaoMao) Ni",
      "institution": "Sign Access (Guangzhou) Service Co., Ltd., China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782864",
      "orcid": "0000-0001-6478-3081"
    },
    {
      "name": "RAY LC",
      "institution": "School of Creative Media, City University of Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659502245",
      "orcid": "0000-0001-7310-8790"
    },
    {
      "name": "Xin Tong",
      "institution": "Duke Kunshan University, China",
      "img": "/do/10.1145/contrib-99658689004/rel-imgonly/profile_1.jpeg",
      "acmid": "99658689004",
      "orcid": "0000-0002-8037-6301"
    }
  ],
  "references": [
    {
      "text": "RCN Almeida, RS Schiaffino, and VM Rumjanek. 2014. Access and comprehension of information by profound deaf youngsters in Brazil. Journal of media and communication studies 6, 11 (2014), 174–178.",
      "doi": ""
    },
    {
      "text": "Oliver Alonzo, Matthew Seita, Abraham Glasser, and Matt Huenerfauth. 2020. Automatic text simplification tools for deaf and hard of hearing adults: Benefits of lexical simplification and providing users with autonomy. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376563"
    },
    {
      "text": "Kuaishou. Retrieved November, 2022. Kuaishou Technology Announces First Quarter 2022 Financial Results. https://ir.kuaishou.com/news-releases/news-release-details/kuaishou-technology-announces-first-quarter-2022-financial.",
      "doi": ""
    },
    {
      "text": "Ministry of Education of of the People’s Republic of China (中华人民共和国教育部). Retrieved December, 2022. Lexicon of Common Expressions in Chinese National Sign Language (国家通用手语常用词表). http://www.moe.gov.cn/jyb_sjzl/ziliao/A19/201807/t20180725_343691.html.",
      "doi": ""
    },
    {
      "text": "National Bureau of Statistics. Retrieved June, 2022. Results of the second national sample survey of people with disabilities were officially released (第二次全国残疾人抽样调查结果正式发布 [Note from the authors: In China, people still often use the term \"CanJi\"残疾, i.e., deficient and having a disease, to refer to disabled people. We maintained the original Chinese word \"CanJi\" in references to ensure that readers can relate to the original text.]). http://www.stats.gov.cn/tjgz/tjdt/200612/t20061205_16908.html.",
      "doi": ""
    },
    {
      "text": "Statista. Retrieved December, 2022. Number of monthly active users of popular short video apps in China as of July 2022. https://www.statista.com/statistics/910633/china-monthly-active-users-across-leading-short-video-apps/.",
      "doi": ""
    },
    {
      "text": "Statista. Retrieved November, 2022. Number of monthly active users of Weibo Corporation from 1st quarter of 2018 to 1st quarter of 2022. https://www.statista.com/statistics/795303/china-mau-of-sina-weibo/.",
      "doi": ""
    },
    {
      "text": "Statista. Retrieved November, 2022. Number of monthly active users of Xiaohongshu app in China from December 2020 to June 2022. https://www.statista.com/statistics/1327421/china-xiaohongshu-monthly-active-users/.",
      "doi": ""
    },
    {
      "text": "Statista. Retrieved November, 2022. Number of monthly active WeChat users from 2nd quarter 2011 to 1st quarter 2022. https://www.statista.com/statistics/255778/number-of-active-wechat-messenger-accounts/.",
      "doi": ""
    },
    {
      "text": "Wang Lianzhang. Retrieved August, 2022. China’s Only Sign Language Lawyer. https://www.sixthtone.com/news/1003204/chinas-only-sign-language-lawyer.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Retrieved August, 2022. Chinese Sign Language. https://en.wikipedia.org/wiki/Chinese_Sign_Language.",
      "doi": ""
    },
    {
      "text": "XueZhu from Guokr (雪竹果壳) . Retrieved August, 2022. Strange Sign Language: 90% of d/Deaf people cannot understand the sign language used by sign language interpreters | in-depth report (吊诡的手语：手语翻译打的手语，九成聋人看不懂 |深度). https://mp.weixin.qq.com/s/ERI05cuX9QpmpzumXCREaw.",
      "doi": ""
    },
    {
      "text": "Zheng Xuan. Retrieved August, 2022. Post-Coronavirus, China Should Listen to Its Deaf Community. https://www.sixthtone.com/news/1005865/post-coronavirus%2C-china-should-listen-to-its-deaf-community.",
      "doi": ""
    },
    {
      "text": "Yufuko Takashima (高嶋由布子). 2020. Japanese Sign Language as a Endangered Language(危機言語としての日本手話). NINJAL Research Papers (国立国語研究所論集) 18(2020), 121–148.",
      "doi": ""
    },
    {
      "text": "Seigou Uenou (上農正剛). 2020. Issues of Japanese Sign Language and Signed Japanese in d/Deaf Education: Real-world Discussion (聾教育における手話と書記日本語の問題現実の中で議論するために). Japanese Journal for Sign Language Studies(手話学研究) 29, 2 (2020), 74–93.",
      "doi": ""
    },
    {
      "text": "Ursula Bellugi and Susan Fischer. 1972. A comparison of sign language and spoken language. Cognition 1, 2-3 (1972), 173–200.",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett, Erin Brady, and Stacy M Branham. 2018. Interdependence as a frame for assistive technology research and design. In Proceedings of the 20th international acm sigaccess conference on computers and accessibility. 161–173.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. Vizwiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. 333–342.",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Jeffrey P Bigham, Richard E Ladner, and Yevgen Borodin. 2011. The design of human-powered access technology. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility. 3–10.",
      "doi": "10.1145/2049536.2049540"
    },
    {
      "text": "Judith Borghouts, Martha Neary, Kristina Palomares, Cinthia De Leon, Stephen M Schueller, Margaret Schneider, Nicole Stadnick, Dana B Mukamel, Dara H Sorkin, Dakota Brown, Shannon McCleerey-Hooper, Gloria Moriarty, and Elizabeth V Eikey. 2022. Understanding the Potential of Mental Health Apps to Address Mental Health Needs of the Deaf and Hard of Hearing Community: Mixed Methods Study. JMIR human factors 9, 2 (2022), e35641.",
      "doi": ""
    },
    {
      "text": "Katya Borgos-Rodriguez, Kathryn E Ringland, and Anne Marie Piper. 2019. Myautsomefamilylife: Analyzing parents of children with developmental disabilities on YouTube. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": "10.1145/3359196"
    },
    {
      "text": "Ted K Bradshaw. 2008. The post-place community: Contributions to the debate about the definition of community. Community Development 39, 1 (2008), 5–16.",
      "doi": ""
    },
    {
      "text": "Danielle Bragg, Naomi Caselli, Julie A Hochgesang, Matt Huenerfauth, Leah Katz-Hernandez, Oscar Koller, Raja Kushalnagar, Christian Vogler, and Richard E Ladner. 2021. The FATE Landscape of Sign Language AI Datasets: An Interdisciplinary Perspective. ACM Transactions on Accessible Computing (TACCESS) 14, 2 (2021), 1–45.",
      "doi": "10.1145/3461700"
    },
    {
      "text": "Danielle Bragg, Abraham Glasser, Fyodor Minakov, Naomi Caselli, and William Thies. 2022. Exploring Collection of Sign Language Videos through Crowdsourcing. 6, CSCW2, Article 514 (2022), 24 pages. https://doi.org/10.1145/3555627",
      "doi": "10.1145/3555627"
    },
    {
      "text": "Danielle Bragg, Oscar Koller, Mary Bellard, Larwan Berke, Patrick Boudreault, Annelies Braffort, Naomi Caselli, Matt Huenerfauth, Hernisa Kacorri, Tessa Verhoef, Christian Vogler, and Meredith Ringel Morris. 2019. Sign language recognition, generation, and translation: An interdisciplinary perspective. In The 21st international ACM SIGACCESS conference on computers and accessibility. 16–31.",
      "doi": "10.1145/3308561.3353774"
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. Collaborative accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2373–2382.",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Jan Branson and Don Miller. 2004. The cultural construction of linguistic incompetence through schooling: Deaf education and the transformation of the linguistic environment in Bali, Indonesia. Sign Language Studies 5, 1 (2004), 6–38.",
      "doi": ""
    },
    {
      "text": "Anna Cavender, Shari Trewin, and Vicki Hanson. Retrieved December, 2022. Accessible Writing Guide. https://www.sigaccess.org/welcome-to-sigaccess/resources/accessible-writing-guide/.",
      "doi": ""
    },
    {
      "text": "Anna C Cavender, Daniel S Otero, Jeffrey P Bigham, and Richard E Ladner. 2010. Asl-stem forum: enabling sign language to grow through online collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2075–2078.",
      "doi": "10.1145/1753326.1753642"
    },
    {
      "text": "Ngai Keung Chan. 2019. \"Becoming an expert in driving for Uber\": Uber driver/bloggers’ performance of expertise and self-presentation on YouTube. New Media & Society 21, 9 (2019), 2048–2067.",
      "doi": ""
    },
    {
      "text": "Yaqing Chen and Qunhu Gong. 2020. Dialects or languages: a corpus-based quantitative approach to lexical variation in common signs in Chinese Sign Language (CSL). Lingua 248(2020), 102944.",
      "doi": ""
    },
    {
      "text": "China Disabled Persons Federation(中国残疾人联合会网站). Retrieved July, 2022. Practical Evaluation Standards for Disability in China (中国残疾人实用评定标准). http://www.gov.cn/ztzl/gacjr/content_459939.htm.",
      "doi": ""
    },
    {
      "text": "Lan Ni (倪兰). 2022. Chinese Sign Language: Intermediate(中国手语教程：中级). Fudan University Press (复旦大学出版社).",
      "doi": ""
    },
    {
      "text": "Yamauchi, Kazuhiro-Third Special Investigation Office, House of Councillors of Japan (山内一宏-参議院　第三特別調査室). Retrieved December, 2022. Japanese and Japanese Sign Language – Toward a History of Conflict and Symbiosis – (日本語と日本手話ー相克の歴史と共生に向けてー). https://www.sangiin.go.jp/japanese/annai/chousa/rippou_chousa/backnumber/2017pdf/20170301101ss.pdf.",
      "doi": ""
    },
    {
      "text": "Mairian Corker. 1998. Deaf and disabled, or deafness disabled?: towards a human rights perspective. Open University Press.",
      "doi": ""
    },
    {
      "text": "Michael Crabb, Rhianne Jones, Mike Armstrong, and Chris J Hughes. 2015. Online news videos: the UX of subtitle position. In Proceedings of the 17th international ACM SIGACCESS conference on Computers & accessibility. 215–222.",
      "doi": "10.1145/2700648.2809866"
    },
    {
      "text": "ONNO Crasborn and TONY Bloem. 2009. Linguistic variation as a challenge for sign language interpreters and sign language interpreter education in the Netherlands. International perspectives on sign language interpreter education 4 (2009), 77–95.",
      "doi": ""
    },
    {
      "text": "John W Creswell and Cheryl N Poth. 2016. Qualitative inquiry and research design: Choosing among five approaches. Sage publications.",
      "doi": ""
    },
    {
      "text": "Ruikai Dai and Luanjiao Hu. 2022. Inclusive communications in COVID-19: a virtual ethnographic study of disability support network in China. Disability & Society 37, 1 (2022), 3–21.",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Katya Borgos-Rodriguez, and Anne Marie Piper. 2020. Weaving by touch: A case analysis of accessible making. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376477"
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. \" It doesn’t win you friends\" Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Thomas Barlow McHugh, Anne Marie Piper, and Darren Gergle. 2022. Co11ab: Augmenting Accessibility in Synchronous Collaborative Writing for People with Vision Impairments. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3491102.3501918"
    },
    {
      "text": "Maitraye Das, John Tang, Kathryn E Ringland, and Anne Marie Piper. 2021. Towards accessible remote work: Understanding work-from-home practices of neurodivergent professionals. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–30.",
      "doi": "10.1145/3449282"
    },
    {
      "text": "Maartje De Meulder, Joseph J Murray, and Rachel L McKee. 2019. The legal recognition of sign languages: Advocacy and outcomes around the world. Multilingual Matters.",
      "doi": ""
    },
    {
      "text": "Xianghua Ding, Yubo Kou, Yiwen Xu, and Peng Zhang. 2022. \"As Uploaders, We Have the Responsibility\": Individualized Professionalization of Bilibili Uploaders. In CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3491102.3517509"
    },
    {
      "text": "Bryan Dosono and Bryan Semaan. 2019. Moderation practices as emotional labor in sustaining online communities: The case of AAPI identity work on Reddit. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300372"
    },
    {
      "text": "Steven C Fedorowicz. 2020. Deaf Bodies: Toward a Holistic Ethnography of Deaf People in Japan. Journal of Inquiry and Research 111 (2020), 269–286.",
      "doi": ""
    },
    {
      "text": "Johannes Fellinger, Daniel Holzinger, and Robert Pollard. 2012. Mental health of deaf people. The Lancet 379, 9820 (2012), 1037–1044.",
      "doi": ""
    },
    {
      "text": "Emma Ferguson-Coleman, Alice Johnston, Alys Young, Fiona Brown, Ruth de Sainte Croix, and Paul Redfern. 2020. How do we know what we don’t know? Exploring Deaf people’s experiences of supporting their Deaf family member living with dementia. Dementia 19, 5 (2020), 1381–1396.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. Retrieved December, 2022. Disability Impacts All of Us. https://www.cdc.gov/ncbddd/disabilityandhealth/infographic-disability-impacts-all.html.",
      "doi": ""
    },
    {
      "text": "Alexandre G Silva, Tiago Batista, Felipe Giraud, Andrea Giraud, Flavio Eduardo Pinto-Silva, Julia Barral, Juan Nascimento Guimarães, and Vivian rumjanek. 2020. Science communication for the Deaf in the pandemic period: absences and pursuit of information. Journal of Science Communication 19, 5 (2020), A05.",
      "doi": ""
    },
    {
      "text": "Sarah A Gilbert. 2020. \"I run the world’s largest historical outreach project and it’s on a cesspool of a website.\" Moderating a Public Scholarship Site on Reddit: A Case Study of r/AskHistorians. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–27.",
      "doi": "10.1145/3392822"
    },
    {
      "text": "Abraham Glasser, Fyodor Minakov, and Danielle Bragg. 2022. ASL Wiki: An Exploratory Interface for Crowdsourcing ASL Translations. In The 24th International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": ""
    },
    {
      "text": "Kotaro Hara, Shiri Azenkot, Megan Campbell, Cynthia L Bennett, Vicki Le, Sean Pannella, Robert Moore, Kelly Minckler, Rochelle H Ng, and Jon E Froehlich. 2015. Improving public transit accessibility for blind riders by crowdsourcing bus stop landmark locations with google street view: An extended analysis. ACM Transactions on Accessible Computing (TACCESS) 6, 2 (2015), 1–23.",
      "doi": "10.1145/2717513"
    },
    {
      "text": "Erin Moriarty Harrelson. 2019. Deaf people with \"no language\": Mobility and flexible accumulation in languaging practices of deaf people in Cambodia. Applied Linguistics Review 10, 1 (2019), 55–72.",
      "doi": ""
    },
    {
      "text": "Sharon Heung, Mahika Phutane, Shiri Azenkot, Megh Marathe, and Aditya Vashistha. 2022. Nothing Micro About It: Examining Ableist Microaggressions on Social Media. In The 24th International ACM SIGACCESS Conference on Computers and Accessibility. 1–14.",
      "doi": ""
    },
    {
      "text": "Haruto Hiraoka Asahi News Digital (平岡春人朝日新聞デジタル). Retrieved December, 2022. A 3rd Grade Boy at d/Deaf School Sues His Teacher to Sapporo District Court for Unable to Use Japanese Sign Language (担任に「日本手話」が通じない　ろう学校の小3男児が北海道を提訴). https://www.asahi.com/articles/ASQ7W6QLFQ7WIIPE01Q.html.",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L Bennett. 2020. Living disability theory: Reflections on access, research, and design. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Rachel E Hommes, Amy I Borash, Kari Hartwig, and Donna DeGracia. 2018. American Sign Language interpreters perceptions of barriers to healthcare communication in deaf and hard of hearing patients. Journal of community health 43, 5 (2018), 956–961.",
      "doi": ""
    },
    {
      "text": "Sung-Eun Hong, Hyunhwa Lee, Mi-Hye Lee, and Seung-Il Byun. 2019. The Korean Sign Language Act. Recogninzing Sign Languages: An International Overview of National Campaigns for Sign Language Legislation and their Outcomes. Multilingual Matters (2019).",
      "doi": ""
    },
    {
      "text": "Hsiu-Fang Hsieh and Sarah E Shannon. 2005. Three approaches to qualitative content analysis. Qualitative health research 15, 9 (2005), 1277–1288.",
      "doi": ""
    },
    {
      "text": "Lijiao Huang. 2019. A SURVEY OF DEAF CULTURE AWARENESS IN CHINA. New Dimensions Toward Education, Advocacy and Collaboration for Individuals with Special Needs (2019), 43.",
      "doi": ""
    },
    {
      "text": "Gabrielle A Jones, Dawei Ni, and Wei Wang. 2021. Nothing about us without us: Deaf education and sign language access in China. Deafness & Education International 23, 3 (2021), 179–200.",
      "doi": ""
    },
    {
      "text": "Jong Sup Jun. 2001. Korean \"Standard Sign Language\" Is Not a Sign Language. Journal of cognitive science 2 (2001).",
      "doi": ""
    },
    {
      "text": "Sushant Kafle and Matt Huenerfauth. 2017. Evaluating the usability of automatically generated captions for people who are deaf or hard of hearing. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 165–174.",
      "doi": "10.1145/3132525.3132542"
    },
    {
      "text": "Elizabeth Karras and Lance S Rintamaki. 2012. An examination of online health information seeking by deaf people. Health Communication 27, 2 (2012), 194–204.",
      "doi": ""
    },
    {
      "text": "Saba Kawas, George Karalis, Tzu Wen, and Richard E Ladner. 2016. Improving real-time captioning experiences for deaf and hard of hearing students. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. 15–23.",
      "doi": "10.1145/2982142.2982164"
    },
    {
      "text": "Arjun Kharpal. Retrieved August, 2022. Everything you need to know about WeChat - China’s billion-user messaging app. https://www.cnbc.com/2019/02/04/what-is-wechat-china-biggest-messaging-app.html.",
      "doi": ""
    },
    {
      "text": "Klaus Krippendorff. 2011. Computing Krippendorff’s alpha-reliability. (2011).",
      "doi": ""
    },
    {
      "text": "Raja S Kushalnagar and Christian Vogler. 2020. Teleconference accessibility and guidelines for deaf and hard of hearing users. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–6.",
      "doi": "10.1145/3373625.3417299"
    },
    {
      "text": "Cheuk Yin Phipson Lee, Zhuohao Zhang, Jaylin Herskovitz, JooYoung Seo, and Anhong Guo. 2022. CollabAlly: Accessible Collaboration Awareness in Document Editing. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": ""
    },
    {
      "text": "Franklin Mingzhe Li, Di Laura Chen, Mingming Fan, and Khai N Truong. 2021. \"I Choose Assistive Devices That Save My Face\" A Study on Perceptions of Accessibility and Assistive Technology Use Conducted in China. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445321"
    },
    {
      "text": "Dongxiao Li (李东晓). 2013. The current situation of accessibility in China’s TV media, problems and suggestions (我国电视媒体的无障碍发展现状, 问题兼及建议). Modern Communication: Journal of Communication University of China(现代传播: 中国传媒大学学报)5(2013), 7–13.",
      "doi": ""
    },
    {
      "text": "Zihao Lin. 2021. Writing down our happiness and dreams: essay contest and the statist narratives of deaf identity in China. Disability & Society 36, 1 (2021), 38–57.",
      "doi": ""
    },
    {
      "text": "Yanhong Liu (刘艳虹), Dingqian Gu (顾定倩), Li Cheng (程黎), and Dan Wei (魏丹). 2013. A study of the current situation of sign language use in China (我国手语使用状况的调查研究). Applied Linguistics (语言文字应用)2(2013), 35–41.",
      "doi": ""
    },
    {
      "text": "Yunyi Ma. 2020. A Study of Lexical Variation, Comprehension and Language Attitudes in Deaf Users of Chinese Sign Language (CSL) from Beijing and Shanghai. Ph. D. Dissertation. UCL (University College London).",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Danielle Bragg, Meredith Ringel Morris, Maarten W Bos, Isabelle Albi, and Andrés Monroy-Hernández. 2020. Social app accessibility for deaf signers. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–31.",
      "doi": "10.1145/3415196"
    },
    {
      "text": "Kelly Mack, Maitraye Das, Dhruv Jain, Danielle Bragg, John Tang, Andrew Begel, Erin Beneteau, Josh Urban Davis, Abraham Glasser, Joon Sung Park, and Venkatesh Potluri. 2021. Mixed Abilities and Varied Experiences: a group autoethnography of a virtual summer internship. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": "10.1145/3441852.3471199"
    },
    {
      "text": "Kelly Mack, Emma McDonnell, Dhruv Jain, Lucy Lu Wang, Jon E. Froehlich, and Leah Findlater. 2021. What do we mean by \"accessibility research\"? A literature survey of accessibility papers in CHI and ASSETS from 1994 to 2019. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3411764.3445412"
    },
    {
      "text": "Shruti Mahajan, Khulood Alkhudaidi, Rachel Boll, Jeanne Reis, and Erin Solovey. 2022. Role of Technology in Increasing Representation of Deaf Individuals in Future STEM Workplaces. In 2022 Symposium on Human-Computer Interaction for Work. 1–6.",
      "doi": ""
    },
    {
      "text": "Michella Maiorana-Basas and Claudia M Pagliaro. 2014. Technology use among adults who are deaf and hard of hearing: A national survey. Journal of deaf studies and deaf education(2014), 400–410.",
      "doi": ""
    },
    {
      "text": "James R Mallory, Michael Stinson, Lisa Elliot, and Donna Easton. 2017. Personal perspectives on using automatic speech recognition to facilitate communication between deaf students and hearing customers. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 419–421.",
      "doi": "10.1145/3132525.3134779"
    },
    {
      "text": "Helen Margellos-Anast, Melanie Estarziau, and Gary Kaufman. 2006. Cardiovascular disease knowledge among culturally Deaf patients in Chicago. Preventive medicine 42, 3 (2006), 235–239.",
      "doi": ""
    },
    {
      "text": "Martin N Marshall. 1996. Sampling for qualitative research. Family practice 13, 6 (1996), 522–526.",
      "doi": ""
    },
    {
      "text": "Emma J McDonnell, Ping Liu, Steven M Goodman, Raja Kushalnagar, Jon E Froehlich, and Leah Findlater. 2021. Social, environmental, and technical: Factors at play in the current use and future design of small-group captioning. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": "10.1145/3479578"
    },
    {
      "text": "Guy McIlroy and Claudine Storbeck. 2011. Development of deaf identity: An ethnographic study. The Journal of Deaf Studies and Deaf Education 16, 4 (2011), 494–511.",
      "doi": ""
    },
    {
      "text": "Michael M McKee, Michael K Paasche-Orlow, Paul C Winters, Kevin Fiscella, Philip Zazove, Ananda Sen, and Thomas Pearson. 2015. Assessing health literacy in deaf American sign language users. Journal of health communication 20, sup2 (2015), 92–100.",
      "doi": ""
    },
    {
      "text": "Rachel McKee, Josefina Safar, and Sara Pivac Alexander. 2021. Form, frequency and sociolinguistic variation in depicting signs in New Zealand Sign Language. Language & Communication 79 (2021), 95–117.",
      "doi": ""
    },
    {
      "text": "Christopher J Moreland, Raylene Paludneviciene, Jung Hyun Park, Michael McKee, and Poorna Kushalnagar. 2021. Deaf adults at higher risk for severe illness: COVID-19 information preference and perceived health consequences. Patient Education and Counseling 104, 11 (2021), 2830–2833.",
      "doi": ""
    },
    {
      "text": "Soya Mori and Atsubumi Sugimoto. 2019. Progress and problems in the campaign for Sign language recognition in Japan. The legal recognition of sign languages: Advocacy and outcomes around the world (2019), 104–118.",
      "doi": ""
    },
    {
      "text": "Joseph J Murray. 2019. American Sign Language legislation in the USA. The legal recognition of sign languages: Advocacy and outcomes around the world (2019), 119–128.",
      "doi": ""
    },
    {
      "text": "Karen Nakamura. 2006. Deaf in Japan: Signing and the politics of identity. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "United Nations. Retrieved September, 2022. We Sign for Human Rights. https://www.un.org/en/observances/sign-languages-day.",
      "doi": ""
    },
    {
      "text": "NHK. Retrieved January, 2023. NHK CORPORATE INFORMATION. https://www.nhk.or.jp/corporateinfo/.",
      "doi": ""
    },
    {
      "text": "Magda Nikolaraizi and Maria Makri. 2004. Deaf and hearing individuals’ beliefs about the capabilities of deaf people. American Annals of the Deaf 149, 5 (2004), 404–414.",
      "doi": ""
    },
    {
      "text": "World Federation of the Deaf. Retrieved December, 2022. The Legal Recognition of National Sign Languages. https://wfdeaf.org/news/the-legal-recognition-of-national-sign-languages/.",
      "doi": ""
    },
    {
      "text": "World Federation of the Deaf. Retrieved July, 2022. Our Work. https://wfdeaf.org/our-work/.",
      "doi": ""
    },
    {
      "text": "Mike Oliver. 2013. The social model of disability: Thirty years on. Disability & society 28, 7 (2013), 1024–1026.",
      "doi": ""
    },
    {
      "text": "World Health Organization. Retrieved June, 2022. Deafness and hearing loss. https://www.who.int/news-room/fact-sheets/detail/deafness-and-hearing-loss.",
      "doi": ""
    },
    {
      "text": "Carol Padden and Tom Humphries. 1988. Deaf in America: Voices from a culture. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Carol Padden and Tom Humphries. 2009. Inside deaf culture. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Nick Palfreyman. 2019. Variation in Indonesian sign language. In Variation in Indonesian sign language. De Gruyter Mouton.",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper and James D Hollan. 2008. Supporting medical conversations between deaf and hearing individuals with tabletop displays. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. 147–156.",
      "doi": "10.1145/1460563.1460587"
    },
    {
      "text": "Robert Q Pollard Jr and Steven Barnett. 2009. Health-related vocabulary knowledge among deaf adults.Rehabilitation Psychology 54, 2 (2009), 182.",
      "doi": ""
    },
    {
      "text": "Venkatesh Potluri, Maulishree Pandey, Andrew Begel, Michael Barnett, and Scott Reitherman. 2022. CodeWalk: Facilitating Shared Awareness in Mixed-Ability Collaborative Software Development. In The 24th International ACM SIGACCESS Conference on Computers and Accessibility. 1–16.",
      "doi": ""
    },
    {
      "text": "Liza Potts and Angela Harrison. 2013. Interfaces as rhetorical constructions: reddit and 4chan during the boston marathon bombings. In Proceedings of the 31st ACM international conference on Design of communication. 143–150.",
      "doi": "10.1145/2507065.2507079"
    },
    {
      "text": "Ljubica Pribanić. 2006. Sign language and deaf education: A new tradition. Sign Language & Linguistics 9, 1-2 (2006), 233–254.",
      "doi": ""
    },
    {
      "text": "Renée Punch. 2016. Employment and adults who are deaf or hard of hearing: Current status and experiences of barriers, accommodations, and stress in the workplace. American annals of the deaf 161, 3 (2016), 384–397.",
      "doi": ""
    },
    {
      "text": "Sen Qi and Ross E Mitchell. 2012. Large-scale academic achievement testing of deaf and hard-of-hearing students: Past, present, and future. Journal of deaf studies and deaf education 17, 1 (2012), 1–18.",
      "doi": ""
    },
    {
      "text": "Reddit. Retrieved August, 2022. How do I get user flair?https://reddit.zendesk.com/hc/en-us/articles/205242695-How-do-I-get-user-flair-.",
      "doi": ""
    },
    {
      "text": "Kathryn E Ringland, Christine T Wolf, LouAnne E Boyd, Mark S Baldwin, and Gillian R Hayes. 2016. Would you be mine: Appropriating minecraft as an assistive technology for youth with autism. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. 33–41.",
      "doi": "10.1145/2982142.2982172"
    },
    {
      "text": "Dolors Rodríguez-Martín, Catalina Rodríguez-García, and Anna Falcó-Pegueroles. 2018. Ethnographic analysis of communication and the deaf community’s rights in the clinical context. Contemporary nurse 54, 2 (2018), 126–138.",
      "doi": ""
    },
    {
      "text": "Jazz Rui Xia Ang, Ping Liu, Emma McDonnell, and Sarah Coppola. 2022. \"In this online environment, we’re limited\": Exploring Inclusive Video Conferencing Design for Signers. In CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3491102.3517488"
    },
    {
      "text": "Abir Saha and Anne Marie Piper. 2020. Understanding audio production practices of people with vision impairments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": "10.1145/3373625.3416993"
    },
    {
      "text": "Brenda Schick. 2003. The development of American Sign Language and manually coded English systems. Oxford handbook of deaf studies, language, and education (2003), 219–231.",
      "doi": ""
    },
    {
      "text": "Elizabeth Schniedewind, Ryan Lindsay, and Steven Snow. 2020. Ask and ye shall not receive: Interpreter-related access barriers reported by Deaf users of American sign language. Disability and Health Journal 13, 4 (2020), 100932.",
      "doi": ""
    },
    {
      "text": "Michael A Schwartz and Brent C Elder. 2018. Deaf access to justice in Northern Ireland: Rethinking ’reasonable adjustment’ in the disability discrimination act. Disability & Society 33, 7 (2018), 1003–1024.",
      "doi": ""
    },
    {
      "text": "Joseph Seering. 2020. Reconsidering community self-moderation: the role of research in supporting community-based models for online content moderation. Proceedings of the ACM on Human-Computer Interaction 4 (2020), 107.",
      "doi": "10.1145/3415178"
    },
    {
      "text": "Joseph Seering, Tony Wang, Jina Yoon, and Geoff Kaufman. 2019. Moderator engagement and community development in the age of algorithms. New Media & Society 21, 7 (2019), 1417–1443.",
      "doi": ""
    },
    {
      "text": "Matthew Seita, Sooyeon Lee, Sarah Andrew, Kristen Shinohara, and Matt Huenerfauth. 2022. Remotely Co-Designing Features for Communication Applications using Automatic Captioning with Deaf and Hearing Pairs. In CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3491102.3501843"
    },
    {
      "text": "Brent N Shiver and Rosalee J Wolfe. 2015. Evaluating alternatives for better deaf accessibility to selected web-based multimedia. In Proceedings of the 17th international ACM SIGACCESS conference on computers & accessibility. 231–238.",
      "doi": "10.1145/2700648.2809857"
    },
    {
      "text": "Jenny L Singleton, Gabrielle Jones, and Shilpa Hanumantha. 2014. Toward ethical research practice with deaf participants. Journal of Empirical Research on Human Research Ethics 9, 3(2014), 59–66.",
      "doi": ""
    },
    {
      "text": "Per Koren Solvang and Hilde Haualand. 2014. Accessibility and diversity: Deaf space in action. Scandinavian Journal of Disability Research 16, 1 (2014), 1–13.",
      "doi": ""
    },
    {
      "text": "Abdelhadi Soudi, Kristof Van Laerhoven, and Elmostafa Bou-Souf. 2019. AfricaSign–a crowd-sourcing platform for the documentation of STEM vocabulary in African sign languages. In The 21st international ACM SIGACCESS conference on computers and accessibility. 658–660.",
      "doi": "10.1145/3308561.3354592"
    },
    {
      "text": "Klaas-Jan Stol, Paul Ralph, and Brian Fitzgerald. 2016. Grounded theory in software engineering research: a critical review and guidelines. In Proceedings of the 38th International Conference on Software Engineering. 120–131.",
      "doi": "10.1145/2884781.2884833"
    },
    {
      "text": "John Tang. 2021. Understanding the telework experience of people with disabilities. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–27.",
      "doi": "10.1145/3449104"
    },
    {
      "text": "Elena Tomasuolo, Tiziana Gulli, Virginia Volterra, and Sabina Fontana. 2021. The Italian Deaf community at the time of Coronavirus. Frontiers in Sociology(2021), 125.",
      "doi": ""
    },
    {
      "text": "Filippo Trevisan. 2020. “Do You Want to Be a Well-Informed Citizen, or Do You Want to Be Sane?” Social Media, Disability, Mental Health, and Political Marginality. Social Media+ Society 6, 1 (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Bonnie Poitras Tucker. 1997. The ADA and deaf culture: Contrasting precepts, conflicting results. The Annals of the American Academy of Political and Social Science 549, 1(1997), 24–36.",
      "doi": ""
    },
    {
      "text": "Janet Ubido, Janet Huntington, and Diane Warburton. 2002. Inequalities in access to healthcare faced by women who are deaf. Health & Social Care in the Community 10, 4 (2002), 247–253.",
      "doi": ""
    },
    {
      "text": "Gill Valentine and Tracey Skelton. 2007. The right to be heard: Citizenship and language. Political Geography 26, 2 (2007), 121–140.",
      "doi": ""
    },
    {
      "text": "Gill Valentine and Tracey Skelton. 2008. Changing spaces: the role of the internet in shaping Deaf geographies. Social & Cultural Geography 9, 5 (2008), 469–485.",
      "doi": ""
    },
    {
      "text": "Gill Valentine and Tracey Skelton. 2009. ’AN UMBILICAL CORD TO THE WORLD’ The role of the Internet in D/deaf people’s information and communication practices. Information, Communication & Society 12, 1 (2009), 44–65.",
      "doi": ""
    },
    {
      "text": "Clayton Valli and Ceil Lucas. 2000. Linguistics of American sign language: An introduction. Gallaudet University Press.",
      "doi": ""
    },
    {
      "text": "Emily Q Wang and Anne Marie Piper. 2018. Accessibility in action: Co-located collaboration among deaf and hearing professionals. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–25.",
      "doi": "10.1145/3274449"
    },
    {
      "text": "Jennifer Ella Wehrmeyer. 2013. A critical investigation of Deaf comprehension of signed TV news interpretation. Ph. D. Dissertation. University of South Africa.",
      "doi": ""
    },
    {
      "text": "Etienne Wenger. 1999. Communities of practice: Learning, meaning, and identity. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Retrieved August, 2022. Fa Ziying and Lao Rongzhi. https://en.wikipedia.org/wiki/Fa_Ziying_and_Lao_Rongzhi.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Retrieved November, 2022. Sina Weibo. https://en.wikipedia.org/wiki/Sina_Weibo.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Retrieved November, 2022. Xiaohongshu. https://en.wikipedia.org/wiki/Xiaohongshu.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Retrieved September, 2022. China Central Television. https://en.wikipedia.org/wiki/China_Central_Television.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Retrieved September, 2022. Chinese city tier system. https://en.wikipedia.org/wiki/Chinese_city_tier_system.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Retrieved September, 2022. Kuaishou. https://en.wikipedia.org/wiki/Kuaishou.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Retrieved September, 2022. TikTok. https://en.wikipedia.org/wiki/TikTok.",
      "doi": ""
    },
    {
      "text": "Yiying Wu, Xianghua Ding, Xuelan Dai, Peng Zhang, Tun Lu, and Ning Gu. 2022. Alignment Work for Urban Accessibility: A Study of How Wheelchair Users Travel in Urban Spaces. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–22.",
      "doi": "10.1145/3555165"
    },
    {
      "text": "Xiaoyan Xiao and Feiyan Li. 2018. Sign language interpreting on Chinese TV: a survey on user perspectives. In Chinese Translation Studies in the 21st Century. Routledge, 303–319.",
      "doi": ""
    },
    {
      "text": "Di Xu, Chu Yan, Ziqing Zhao, Jiaying Weng, and Shiwen Ma. 2021. External Communication Barriers among Elderly Deaf and Hard of Hearing People in China during the COVID-19 Pandemic Emergency Isolation: A Qualitative Study. International Journal of Environmental Research and Public Health 18, 21(2021), 11519.",
      "doi": ""
    },
    {
      "text": "Kayo Yin, Amit Moryossef, Julie Hochgesang, Yoav Goldberg, and Malihe Alikhani. 2021. Including Signed Languages in Natural Language Processing. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers). 7347–7360.",
      "doi": ""
    },
    {
      "text": "Alys Young, Emma Ferguson-Coleman, and John Keady. 2016. Understanding dementia: effective information access from the deaf community’s perspective. Health & Social Care in the Community 24, 1 (2016), 39–47.",
      "doi": ""
    },
    {
      "text": "Alys Young and Ros Hunt. 2011. Research with d/Deaf people. (2011).",
      "doi": ""
    }
  ]
}