{
  "doi": "10.1145/3544548.3581174",
  "title": "Characteristics of Deep and Skim Reading on Smartphones vs. Desktop: A Comparative Study",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Deep reading fosters text comprehension, memory, and critical thinking. The growing prevalance of digital reading on mobile interfaces raises concerns that deep reading is being replaced by skimming and sifting through information, but this is currently unmeasured. Traditionally, reading quality is assessed using comprehension tests, which require readers to explicitly answer a set of carefully composed questions. To quantify and understand reading behaviour in natural settings and at scale, however, implicit measures are needed of deep versus skim reading across desktop and mobile devices, the most prominent digital reading platforms. In this paper, we present an approach to systematically induce deep and skim reading and subsequently train classifiers to discriminate these two reading styles based on eye movement patterns and interaction data. Based on a user study with 29 participants, we created models that detect deep reading on both devices with up to 0.82 AUC. We present the characteristics of deep reading and discuss how our models can be used to measure the effect of reading UI design and monitor long-term changes in reading behaviours.",
  "tags": [
    "Deep reading",
    "Eye tracking",
    "Digital Devices",
    "Gaze features",
    "Reading mode classification"
  ],
  "authors": [
    {
      "name": "Xiuge Chen",
      "institution": "School of Computing and Information Systems, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781731",
      "orcid": "0000-0002-2342-5795"
    },
    {
      "name": "Namrata Srivastava",
      "institution": "Department of Data Science & AI, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658972661",
      "orcid": "0000-0003-4194-318X"
    },
    {
      "name": "Rajiv Jain",
      "institution": "Adobe Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700708",
      "orcid": "0000-0002-5322-9074"
    },
    {
      "name": "Jennifer Healey",
      "institution": "Adobe Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100203125",
      "orcid": "0000-0002-5700-4921"
    },
    {
      "name": "Tilman Dingler",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/do/10.1145/contrib-81472653974/rel-imgonly/lichtbild.jpg",
      "acmid": "81472653974",
      "orcid": "0000-0001-6180-7033"
    }
  ],
  "references": [
    {
      "text": "Yomna Abdelrahman, Anam Ahmad Khan, Joshua Newn, Eduardo Velloso, Sherine Ashraf Safwat, James Bailey, Andreas Bulling, Frank Vetere, and Albrecht Schmidt. 2019. Classifying Attention Types with Thermal Imaging and Eye Tracking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–27. https://doi.org/10.1145/3351227",
      "doi": "10.1145/3351227"
    },
    {
      "text": "Peter Afflerbach. 2015. Handbook of Individual Differences in Reading: Reader, Text, and Context. Routledge. https://doi.org/10.4324/9780203075562",
      "doi": ""
    },
    {
      "text": "Seoyoung Ahn, Conor Kelton, Aruna Balasubramanian, and Greg Zelinsky. 2020. Towards Predicting Reading Comprehension From Gaze Behavior. In ACM Symposium on Eye Tracking Research and Applications. 1–5. https://doi.org/10.1145/3379156.3391335",
      "doi": "10.1145/3379156.3391335"
    },
    {
      "text": "J Alonzo, G Tindal, K Ulmer, and A Glasgow. 2006. EasyCBM Online Progress Monitoring Assessment System. Eugene, OR: Center for Educational Assessment Accountability (2006).",
      "doi": ""
    },
    {
      "text": "Mary DeKonty Applegate, Kathleen Benson Quinn, and Anthony J Applegate. 2002. Levels of Thinking Required by Comprehension Questions in Informal Reading Inventories. The Reading Teacher 56, 2 (2002), 174–180. https://www.jstor.org/stable/20205171",
      "doi": ""
    },
    {
      "text": "Deni Basaraba, Paul Yovanoff, Julie Alonzo, and Gerald Tindal. 2013. Examining the Structure of Reading Comprehension: Do Literal, Inferential, and Evaluative Comprehension Truly Exist?Reading and Writing 26, 3 (2013), 349–379. https://doi.org/10.1007/s11145-012-9372-9",
      "doi": ""
    },
    {
      "text": "Ralf Biedert, Jörn Hees, Andreas Dengel, and Georg Buscher. 2012. A Robust Realtime Reading-skimming Classifier. In Proceedings of the Symposium on Eye Tracking Research and Applications. 123–130. https://doi.org/10.1145/2168556.2168575",
      "doi": "10.1145/2168556.2168575"
    },
    {
      "text": "Mark R Blair, Marcus R Watson, R Calen Walshe, and Fillip Maj. 2009. Extremely Selective Attention: Eye-tracking Studies of the Dynamic Allocation of Attention to Stimulus Features in Categorization.Journal of Experimental Psychology: Learning, Memory, and Cognition 35, 5(2009), 1196. https://doi.org/10.1037/a0016272",
      "doi": ""
    },
    {
      "text": "Andreas Bulling, Jamie A Ward, Hans Gellersen, and Gerhard Tröster. 2010. Eye Movement Analysis for Activity Recognition Using Electrooculography. IEEE transactions on pattern analysis and machine intelligence 33, 4(2010), 741–753. https://doi.org/10.1109/TPAMI.2010.86",
      "doi": "10.1109/TPAMI.2010.86"
    },
    {
      "text": "Douglas Carnine, Jerry Silbert, Edward J Kameenui, and Sara G Tarver. 1997. Direct Instruction Reading. (1997).",
      "doi": ""
    },
    {
      "text": "Ronald P Carver. 1990. Reading Rate: A Review of Research and Theory. Academic Press.",
      "doi": ""
    },
    {
      "text": "Gavin C Cawley and Nicola LC Talbot. 2010. On Over-fitting in Model Selection and Subsequent Selection Bias in Performance Evaluation. The Journal of Machine Learning Research 11 (2010), 2079–2107.",
      "doi": "10.5555/1756006.1859921"
    },
    {
      "text": "Chih-Ming Chen and Yu-Ju Lin. 2016. Effects of Different Text Display Types on Reading Comprehension, Sustained Attention and Cognitive Load in Mobile Reading Contexts. Interactive Learning Environments 24, 3 (2016), 553–571. https://doi.org/10.1080/10494820.2014.891526",
      "doi": ""
    },
    {
      "text": "Leana Copeland and Tom Gedeon. 2013. Measuring Reading Comprehension Using Eye Movements. In 2013 IEEE 4th International Conference on Cognitive Infocommunications (CogInfoCom). IEEE, 791–796. https://doi.org/10.1109/CogInfoCom.2013.6719207",
      "doi": ""
    },
    {
      "text": "Leana Copeland, Tom Gedeon, and B Sumudu U Mendis. 2014. Predicting Reading Comprehension Scores from Eye Movements Using Artificial Neural Networks and Fuzzy Output Error. Artif. Intell. Res. 3, 3 (2014), 35–48. http://dx.doi.org/10.5430/air.v3n3p35",
      "doi": ""
    },
    {
      "text": "Leana Copeland, Tom Gedeon, and Sumudu Mendis. 2014. Fuzzy Output Error as the Performance Function for Training Artificial Neural Networks to Predict Reading Comprehension from Eye Gaze. In International Conference on Neural Information Processing. Springer, 586–593. https://doi.org/10.1007/978-3-319-12637-1_73",
      "doi": ""
    },
    {
      "text": "Mary C Dyson. 2004. How Physical Text Layout Affects Reading from Screen. Behaviour & information technology 23, 6 (2004), 377–393. https://doi.org/10.1080/01449290410001715714",
      "doi": ""
    },
    {
      "text": "Ralf Engbert and Reinhold Kliegl. 2003. Microsaccades Uncover the Orientation of Covert Attention. Vision research 43, 9 (2003), 1035–1045. https://doi.org/10.1016/S0042-6989(03)00084-1",
      "doi": ""
    },
    {
      "text": "Maureen P Hall, Aminda O’Hare, Nicholas Santavicca, and Libby Falk Jones. 2015. The Power of Deep Reading and Mindful Literacy: An Innovative Approach in Contemporary Education. Innovación educativa (México, DF) 15, 67 (2015), 49–60.",
      "doi": ""
    },
    {
      "text": "Harold L Herber. 1978. Teaching Reading in Content Areas. Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Edmund Burke Huey. 1908. The Psychology and Pedagogy of Reading: With A Review of The History of Reading and Writing and of Methods, Texts, and Hygiene in Reading. (1908).",
      "doi": ""
    },
    {
      "text": "Shoya Ishimaru, Kensuke Hoshika, Kai Kunze, Koichi Kise, and Andreas Dengel. 2017. Towards Reading Trackers in The Wild: Detecting Reading Activities by EOG Glasses and Deep Neural Networks. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. 704–711. https://doi.org/10.1145/3123024.3129271",
      "doi": "10.1145/3123024.3129271"
    },
    {
      "text": "Halszka Jarodzka and Saskia Brand-Gruwel. 2017. Tracking The Reading Eye: Towards A Model of Real-world Reading. https://doi.org/10.1111/jcal.12189",
      "doi": ""
    },
    {
      "text": "Marcel A Just and Patricia A Carpenter. 1980. A Theory of Reading: From Eye Fixations to Comprehension. Psychological review 87, 4 (1980), 329. https://doi.org/10.1037/0033-295X.87.4.329",
      "doi": ""
    },
    {
      "text": "Shian-Ru Ke, Hoang Le Uyen Thuc, Yong-Jin Lee, Jenq-Neng Hwang, Jang-Hee Yoo, and Kyoung-Ho Choi. 2013. A Review on Video-Based Human Activity Recognition. Computers 2, 2 (2013), 88–131. https://doi.org/10.3390/computers2020088",
      "doi": ""
    },
    {
      "text": "Conor Kelton, Zijun Wei, Seoyoung Ahn, Aruna Balasubramanian, Samir R Das, Dimitris Samaras, and Gregory Zelinsky. 2019. Reading Detection in Real-time. In Proceedings of the 11th ACM Symposium on Eye Tracking Research & Applications. 1–5. https://doi.org/10.1145/3314111.3319916",
      "doi": "10.1145/3314111.3319916"
    },
    {
      "text": "Peter Kiefer, Ioannis Giannopoulos, and Martin Raubal. 2013. Using Eye Movements to Recognize Activities on Cartographic Maps. In Proceedings of the 21st ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems. 488–491. https://doi.org/10.1145/2525314.2525467",
      "doi": "10.1145/2525314.2525467"
    },
    {
      "text": "Reinhold Kliegl, Antje Nuthmann, and Ralf Engbert. 2006. Tracking The Mind During Reading: The Influence of Past, Present, and Future Words on Fixation Durations. Journal of experimental psychology: General 135, 1 (2006), 12. https://doi.org/10.1037/0096-3445.135.1.12",
      "doi": ""
    },
    {
      "text": "Kai Kunze, Yuzuko Utsumi, Yuki Shiga, Koichi Kise, and Andreas Bulling. 2013. I Know What You Are Reading: Recognition of Document Types Using Mobile Eye Tracking. In Proceedings of the 2013 international symposium on wearable computers. 113–116. https://doi.org/10.1145/2493988.2494354",
      "doi": "10.1145/2493988.2494354"
    },
    {
      "text": "Silvia Makowski, Lena A Jäger, Ahmed Abdelwahab, Niels Landwehr, and Tobias Scheffer. 2018. A Discriminative Model for Identifying Readers and Assessing Text Comprehension from Eye Movements. In Joint European Conference on Machine Learning and Knowledge Discovery in Databases. Springer, 209–225. https://doi.org/10.1007/978-3-030-10925-7_13",
      "doi": ""
    },
    {
      "text": "Sandra McCormick. 1992. Disabled Readers’ Erroneous Responses to Inferential Comprehension Questions: Description and Analysis. Reading Research Quarterly(1992), 55–77. https://doi.org/10.2307/747833",
      "doi": ""
    },
    {
      "text": "Aliaksei Miniukovich, Antonella De Angeli, Simone Sulpizio, and Paola Venuti. 2017. Design Guidelines for Web Readability. In Proceedings of the 2017 Conference on Designing Interactive Systems. 285–296. https://doi.org/10.1145/3064663.3064711",
      "doi": "10.1145/3064663.3064711"
    },
    {
      "text": "Aliaksei Miniukovich, Michele Scaltritti, Simone Sulpizio, and Antonella De Angeli. 2019. Guideline-Based Evaluation of Web Readability. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3290605.3300738",
      "doi": "10.1145/3290605.3300738"
    },
    {
      "text": "Tobii Pro. 2021. Tobii Pro Lab. https://www.tobiipro.com/product-listing/tobii-pro-lab/",
      "doi": ""
    },
    {
      "text": "Gary E Raney, Spencer J Campbell, and Joanna C Bovee. 2014. Using Eye Movements to Evaluate the Cognitive Processes Involved in Text Comprehension. Journal of visualized experiments: JoVE83 (2014). https://doi.org/10.3791/50780",
      "doi": ""
    },
    {
      "text": "Keith Rayner. 1998. Eye Movements in Reading and Information Processing: 20 Years of Research. Psychological bulletin 124, 3 (1998), 372. https://doi.org/10.1037/0033-2909.124.3.372",
      "doi": ""
    },
    {
      "text": "Keith Rayner, Alexander Pollatsek, Jane Ashby, and Charles Clifton Jr. 2012. Psychology of Reading. (2012). https://doi.org/10.4324/9780203155158",
      "doi": ""
    },
    {
      "text": "Keith Rayner, Elizabeth R Schotter, Michael EJ Mason, Mary C Potter, and Rebecca Treiman. 2016. So Much to Read, So Little Time: How Do We Read, and Can Speed Reading Help?Psychological Science in the Public Interest 17, 1 (2016), 4–34. https://doi.org/10.1177/1529100615623267",
      "doi": ""
    },
    {
      "text": "David Robert Reich, Paul Prasse, Chiara Tschirner, Patrick Haller, Frank Goldhammer, and Lena A Jäger. 2022. Inferring Native and Non-Native Human Reading Comprehension and Subjective Text Difficulty from Scanpaths in Reading. In 2022 Symposium on Eye Tracking Research and Applications. 1–8.",
      "doi": "10.1145/3517031.3529639"
    },
    {
      "text": "Luz Rello and Mari-Carmen Marcos. 2012. An Eye Tracking Study on Text Customization for User Performance and Preference. In 2012 Eighth Latin American Web Congress. IEEE, 64–70. https://doi.org/10.1109/LA-WEB.2012.13",
      "doi": "10.1109/LA-WEB.2012.13"
    },
    {
      "text": "Luz Rello, Martin Pielot, and Mari-Carmen Marcos. 2016. Make It Big!: The Effect of Font Size and Line Spacing on Online Readability. In Proceedings of the 2016 CHI conference on Human Factors in Computing Systems. 3637–3648. https://doi.org/10.1145/2858036.2858204",
      "doi": "10.1145/2858036.2858204"
    },
    {
      "text": "Judith C Roberts and Keith A Roberts. 2008. Deep Reading, Cost/benefit, and The Construction of Meaning: Enhancing Reading Comprehension and Deep Learning in Sociology Courses. Teaching Sociology 36, 2 (2008), 125–140. https://doi.org/10.1177/0092055X0803600203",
      "doi": ""
    },
    {
      "text": "Ellen Rose. 2011. The Phenomenology of On-screen Reading: University Students’ Lived Experience of Digitised Text. British Journal of Educational Technology 42, 3 (2011), 515–526. https://doi.org/10.1111/j.1467-8535.2009.01043.x",
      "doi": ""
    },
    {
      "text": "Ladislao Salmerón, Johannes Naumann, Victoria García, and Inmaculada Fajardo. 2017. Scanning and Deep Processing of Information in Hypertext: An Eye Tracking and Cued Retrospective Think-aloud Study. Journal of Computer Assisted Learning 33, 3 (2017), 222–233. https://doi.org/10.1111/jcal.12152",
      "doi": ""
    },
    {
      "text": "Laura Silver, Aaron Smith, Courtney Johnson, Jingjing Jiang, Monica Anderson, and Lee Rainie. 2019. Use of Smartphones and Social Media is Common Across Most Emerging Economies. https://www.pewresearch.org/internet/2019/03/07/use-of-smartphones-and-social-media-is-common-across-most-emerging-economies/",
      "doi": ""
    },
    {
      "text": "VE Snider. 1988. The Role of Prior Knowledge in Reading Comprehension: A Test with LD Adolescents. Direct Instruction News 611 (1988).",
      "doi": ""
    },
    {
      "text": "Catherine Snow. 2002. Reading for Understanding: Toward an R&D Program in Reading Comprehension. Rand Corporation.",
      "doi": ""
    },
    {
      "text": "Rosy Southwell, Julie Gregg, Robert Bixler, and Sidney K D’Mello. 2020. What eye movements reveal about later comprehension of long connected texts. Cognitive Science 44, 10 (2020), e12905.",
      "doi": ""
    },
    {
      "text": "Namrata Srivastava, Joshua Newn, and Eduardo Velloso. 2018. Combining Low and Mid-Level Gaze Features for Desktop Activity Recognition. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–27. https://doi.org/10.1145/3287067",
      "doi": "10.1145/3287067"
    },
    {
      "text": "Alexander Strukelj and Diederick C Niehorster. 2018. One Page of Text: Eye Movements During Regular and Thorough Reading, Skimming, and Spell Checking. Journal of Eye Movement Research 11, 1 (2018). https://doi.org/10.16910/jemr.11.1.1",
      "doi": ""
    },
    {
      "text": "Geoffrey Underwood, Alison Hubbard, and Howard Wilkinson. 1990. Eye Fixations Predict Reading Comprehension: The Relationships between Reading Skill, Reading Speed, and Visual Inspection. Language and speech 33, 1 (1990), 69–81. https://doi.org/10.1177/002383099003300105",
      "doi": ""
    },
    {
      "text": "Boris M. Velichkovsky and John Paulin Hansen. 1996. New Technological Windows into Mind: There is More in Eyes and Brains for Human-Computer Interaction. Association for Computing Machinery, New York, NY, USA, 496–503. https://doi.org/10.1145/238386.238619",
      "doi": "10.1145/238386.238619"
    },
    {
      "text": "Titus von der Malsburg. 2015. Saccades: An R package for detecting fixations in raw eye tracking data.",
      "doi": ""
    },
    {
      "text": "Maryanne Wolf. 2018. Reader Come Home: The Reading Brain in a Digital World. Harper New York, NY.",
      "doi": ""
    },
    {
      "text": "Maryanne Wolf, Mirit Barzillai, and John Dunne. 2009. The Importance of Deep Reading. Challenging the whole child: reflections on best practices in learning, teaching, and leadership 130(2009), 21.",
      "doi": ""
    },
    {
      "text": "Xianmin Yang, Xinshuo Zhao, Xuesong Tian, and Beibei Xing. 2021. Effects of Environment and Posture on the Concentration and Achievement of Students in Mobile Learning. Interactive Learning Environments 29, 3 (2021), 400–413. https://doi.org/10.1080/10494820.2019.1707692",
      "doi": ""
    }
  ]
}