{
  "doi": "10.1145/3544548.3581271",
  "title": "Dirty Data in the Newsroom: Comparing Data Preparation in Journalism and Data Science",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The work involved in gathering, wrangling, cleaning, and otherwise preparing data for analysis is often the most time consuming and tedious aspect of data work. Although many studies describe data preparation within the context of data science workflows, there has been little research on data preparation in data journalism. We address this gap with a hybrid form of thematic analysis that combines deductive codes derived from existing accounts of data science workflows and inductive codes arising from an interview study with 36 professional data journalists. We extend a previous model of data science work to incorporate detailed activities of data preparation. We synthesize 60 dirty data issues from 16 taxonomies on dirty data and our interview data, and we provide a novel taxonomy to characterize these dirty data issues as discrepancies between mental models. We also identify four challenges faced by journalists: diachronic, regional, fragmented, and disparate data sources.",
  "tags": [
    "data wrangling",
    "data cleaning",
    "thematic analysis",
    "data journalism",
    "data science"
  ],
  "authors": [
    {
      "name": "Stephen Kasica",
      "institution": "Department of Computer Science, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778415",
      "orcid": "0000-0002-9775-9720"
    },
    {
      "name": "Charles Berret",
      "institution": "Department of Science and Technology, Linköping University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659453487",
      "orcid": "0000-0002-2796-6820"
    },
    {
      "name": "Tamara Munzner",
      "institution": "Department of Computer Science, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047885",
      "orcid": "0000-0002-3294-3869"
    }
  ],
  "references": [
    {
      "text": "Timo Aho, Outi Sievi-Korte, Terhi Kilamo, Sezin Yaman, and Tommi Mikkonen. 2020. Demystifying Data Science Projects: A Look on the People and Process of Data Science Today. In International Conference on Product-Focused Software Process Improvement (Turin, Italy) (PROFES ’20). Springer, New York, NY, USA, 153–167. https://doi.org/10.1007/978-3-030-64148-1_10",
      "doi": "10.1007/978-3-030-64148-1_10"
    },
    {
      "text": "Sara Alspaugh, Nava Zokaei, Andrea Liu, Cindy Jin, and Marti A. Hearst. 2019. Futzing and Moseying: Interviews with Professional Data Analysts on Exploration Practices. Transactions Visualization and Computer Graphics 25, 1 (Jan. 2019), 22–31. https://doi.org/10.1109/TVCG.2018.2865040",
      "doi": "10.1109/TVCG.2018.2865040"
    },
    {
      "text": "Ángel Arrese. 2022. \"In the Beginning Were the Data\": Economic Journalism as/and Data Journalism. Journalism Studies 23, 4 (Feb. 2022), 487–505. https://doi.org/10.1080/1461670X.2022.2032803",
      "doi": ""
    },
    {
      "text": "José Barateiro and Helena Galhardas. 2005. A Survey of Data Quality Tools. Datenbank-Spektrum 4, 14 (Aug. 2005), 15–21. http://dc-pubs.dbs.uni-leipzig.de/files/Barateiro2005ASurveyofDataQuality.pdf",
      "doi": ""
    },
    {
      "text": "Andrea Batch and Niklas Elmqvist. 2018. The Interactive Visualization Gap in Initial Exploratory Data Analysis. Transactions Visualization and Computer Graphics 24, 1 (Jan. 2018), 278–287. https://doi.org/10.1109/TVCG.2017.2743990",
      "doi": ""
    },
    {
      "text": "Leilani Battle and Jeffrey Heer. 2019. Characterizing Exploratory Visual Analysis: A Literature Review and Evaluation of Analytic Provenance in Tableau. Computer Graphics Forum 38, 3 (July 2019), 145–159. https://doi.org/10.1111/cgf.13678",
      "doi": ""
    },
    {
      "text": "Charles Berret and Cheryl Phillips. 2016. Teaching Data and Computational Journalism. Columbia Journalism School, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Eddy Borges-Rey. 2021. Journalism with Machines? From Computational Thinking to Distributed Cognition. Amsterdam University Press, Amsterdam, Netherlands. 92–95 pages. https://doi.org/10.1515/9789048542079-023",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming Qualitative Information: Thematic analysis and code development. SAGE, Thousand Oaks, California.",
      "doi": ""
    },
    {
      "text": "Paul Bradshaw. 2011. The Inverted Pyramid of Data Journalism. Retrieved Aug. 13, 2021 from https://onlinejournalismblog.com/2011/07/07/the-inverted-pyramid-of-data-journalism",
      "doi": ""
    },
    {
      "text": "Suzana Guedes Cardoso. 2022. The Practice of Data Journalism and Changes in the Professional Profile of Journalists in Newsrooms in the United States, United Kingdom, and Brazil. Springer International Publishing, New York, NY, USA. 17–29 pages. https://doi.org/10.1007/978-3-030-74428-1_2",
      "doi": ""
    },
    {
      "text": "Abhirup Chatterjee and Arie Segev. 1991. Data Manipulation in Heterogeneous Databases. ACM SIGMOD Record 20, 4 (Dec. 1991), 64–68. https://doi.org/10.1145/141356.141385",
      "doi": "10.1145/141356.141385"
    },
    {
      "text": "Fanny Chevalier, Melanie Tory, Bongshin Lee, Jarke van Wijk, Giuseppe Santucci, Marian Dörk, and Jessica Hullman. 2018. From Analysis to Communication: Supporting the Lifecycle of a Story. In Data-Driven Storytelling. CRC Press, Boca Raton, FL, USA, 151–183. https://doi.org/10.1201/9781315281575-7",
      "doi": ""
    },
    {
      "text": "Sarah Cohen, James T. Hamilton, and Fred Turner. 2011. Computational Journalism. Commun. ACM 54, 10 (Oct. 2011), 66–71. https://doi.org/10.1145/2001269.2001288",
      "doi": "10.1145/2001269.2001288"
    },
    {
      "text": "Anamaria Crisan and Brittany Fiore-Gartland. 2021. Fits and Starts: Enterprise Use of AutoML and the Role of Humans in the Loop. In Proceedings of the CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3411764.3445775",
      "doi": "10.1145/3411764.3445775"
    },
    {
      "text": "Anamaria Crisan, Brittany Fiore-Gartland, and Melanie Tory. 2020. Passing the Data Baton: A Retrospective Analysis on Data Science Work and Workers. Transactions Visualization and Computer Graphics 27, 2 (Oct. 2020), 1860–1870. https://doi.org/10.1109/TVCG.2020.3030340",
      "doi": ""
    },
    {
      "text": "Theordore Dasu, Tamraparni & Johnson. 2003. Exploratory Data Mining and Data Cleaning. John Wiley & Sons, Hoboken, NJ, USA.",
      "doi": "10.5555/861869"
    },
    {
      "text": "Wesley Gongora de Almeida, Rafael Timóteo de Sousa, Flávio Elias de Deus, Georges Daniel Amvame Nze, and Fábio Lúcio Lopes de Mendonça. 2013. Taxonomy of Data Quality Problems in Multidimensional Data Warehouse Models. In Proceedings 8th Iberian Conference on Information Systems and Technologies (Lisbon, Portugal) (CISTI ’13). IEEE, New York, NY, USA, 1–7. https://ieeexplore.ieee.org/document/6615784",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Lauren F. Klein. 2020. Data Feminism. MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "David Donoho. 2017. 50 Years of Data Science. Journal of Computational and Graphical Statistics 26, 4 (Oct. 2017), 745–766. https://doi.org/10.1080/10618600.2017.1384734",
      "doi": ""
    },
    {
      "text": "Shari L. Dworkin. 2012. Sample Size Policy for Qualitative Studies Using In-Depth Interviews. Archives Sexual Behavior 41, 6 (Sept. 2012), 1319–1320. https://doi.org/10.1007/s10508-012-0016-6",
      "doi": ""
    },
    {
      "text": "Marc A Feldman. 2020. Data Quality: Dimensions, Measurement, Strategy, Management, and Governance. Quality Progress 53, 2 (2020), 54–54.",
      "doi": ""
    },
    {
      "text": "U.M. Feyyad. 1996. Data Mining and Knowledge Discovery: Making Sense Out of Data. Expert 11, 5 (Oct. 1996), 20–25. https://doi.org/10.1109/64.539013",
      "doi": "10.1109/64.539013"
    },
    {
      "text": "Katherine Fink and C. W. Anderson. 2015. Data Journalism in the United States. Journalism Studies 16, 4 (July 2015), 467–481. https://doi.org/10.1080/1461670X.2014.939852",
      "doi": ""
    },
    {
      "text": "Bruce Frey (Ed.). 2018. The SAGE Encyclopedia of Educational Research, Measurement, and Evaluation. SAGE, Thousand Oaks, California. https://doi.org/10.4135/9781506326139",
      "doi": ""
    },
    {
      "text": "Garrett Grolemund and Hadley Wickham. 2014. A Cognitive Interpretation of Data Analysis: A Cognitive Interpretation of Data Analysis. International Statistical Review 82, 2 (Aug. 2014), 184–204. https://doi.org/10.1111/insr.12028",
      "doi": ""
    },
    {
      "text": "Theresia Gschwandtner, Johannes Gärtner, Wolfgang Aigner, and Silvia Miksch. 2012. A Taxonomy of Dirty Time-Oriented Data. In Multidisciplinary Research and Practice for Information Systems (Prague, Czech Republic) (CD-ARES ’12). Springer, New York, NY, USA, 58–72. https://doi.org/10.1007/978-3-642-32498-7_5",
      "doi": ""
    },
    {
      "text": "Joseph M Hellerstein. 2008. Quantitative Data Cleaning for Large Databases. Technical Report. University of California, Berkeley, Geneva, Switzerland.",
      "doi": ""
    },
    {
      "text": "Bahareh Heravi, Kathryn Cassidy, Edie Davis, and Natalie Harrower. 2022. Preserving Data Journalism: A Systematic Literature Review. Journalism Practice 16, 10 (March 2022), 2083–2105. https://doi.org/10.1080/17512786.2021.1903972",
      "doi": ""
    },
    {
      "text": "Karen Holtzblatt and Hugh Beyer. 2015. Contextual Design: Evolved. Spinger Nature, Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "Sarah Hutchins. 2020. Data Dive: School’s Out. The Investigative Reporters & Editors Journal 43, 1 (Feb. 2020), 6–7.",
      "doi": ""
    },
    {
      "text": "Kaggle. 2019. State of Data Science and Machine Learning. Kaggle. Retrieved May 15, 2022 from https://www.kaggle.com/kaggle-survey-2019",
      "doi": ""
    },
    {
      "text": "Sean Kandel, Jeffrey Heer, Catherine Plaisant, Jessie Kennedy, Frank van Ham, Nathalie Henry Riche, Chris Weaver, Bongshin Lee, Dominique Brodbeck, and Paolo Puono. 2011. Research Directions in Data Wrangling: Visualizations and Transformations for Usable and Credible Data. Information Visualization 10, 4 (Oct. 2011), 271–288. https://doi.org/10.1177/1473871611415994",
      "doi": "10.1177/1473871611415994"
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer. 2011. Wrangler: Interactive Visual Specification of Data Transformation Scripts. In Proceedings of the CHI Conference on Human Factors in Computing Systems(CHI ’11). ACM, Vancouver, Canada, 3363–3372. http://dl.acm.org/citation.cfm?doid=1978942.1979444",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph M. Hellerstein, and Jeffrey Heer. 2012. Enterprise Data Analysis and Visualization: An Interview Study. Transactions Visualization and Computer Graphics 18, 12 (Dec. 2012), 2917–2926. https://doi.org/10.1109/TVCG.2012.219",
      "doi": "10.1109/TVCG.2012.219"
    },
    {
      "text": "Sean Kandel, Ravi Parikh, Andreas Paepcke, Joseph M. Hellerstein, and Jeffrey Heer. 2012. Profiler: Integrated Statistical Analysis and Visualization for Data Quality Assessment. In Proceedings of the International Working Conference on Advanced Visual Interfaces (Capri Island, Italy) (AVI ’12). ACM, New York, NY, USA, 547–554. https://doi.org/10.1145/2254556.2254659",
      "doi": "10.1145/2254556.2254659"
    },
    {
      "text": "Eser Kandogan, Aruna Balakrishnan, Eben M. Haber, and Jeffrey S. Pierce. 2014. From Data to Insight: Work Practices of Analysts in the Enterprise. Computer Graphics and Applications 34, 5 (Sept. 2014), 42–50. https://doi.org/10.1109/MCG.2014.62",
      "doi": ""
    },
    {
      "text": "H. Kang, L. Getoor, B. Shneiderman, M. Bilgic, and L. Licamele. 2008. Interactive Entity Resolution in Relational Data: A Visual Analytic Tool and Its Evaluation. Transactions Visualization and Computer Graphics 14, 5 (Sept. 2008), 999–1014. https://doi.org/10.1109/TVCG.2008.55",
      "doi": "10.1109/TVCG.2008.55"
    },
    {
      "text": "Stephen Kasica, Charles Berret, and Tamara Munzner. 2020. Table Scraps: An Actionable Framework for Multi-Table Data Wrangling From An Artifact Study of Computational Journalism. Transactions Visualization and Computer Graphics 27, 2 (2020), 957–966. https://doi.org/10.1109/TVCG.2020.3030462",
      "doi": ""
    },
    {
      "text": "Miryung Kim, Thomas Zimmermann, Robert DeLine, and Andrew Begel. 2016. The Emerging Role of Data Scientists on Software Development Teams. In Proceedings of the 38th International Conference on Software Engineering(Austin, Texas) (ICSE ’16). ACM, New York, NY, USA, 96–107. https://doi.org/10.1145/2884781.2884783",
      "doi": "10.1145/2884781.2884783"
    },
    {
      "text": "Miryung Kim, Thomas Zimmermann, Robert DeLine, and Andrew Begel. 2018. Data Scientists in Software Teams: State of the Art and Challenges. Transactions Software Engineering 44, 11 (Nov. 2018), 1024–1038. https://doi.org/10.1109/TSE.2017.2754374",
      "doi": ""
    },
    {
      "text": "Won Kim, Byoung-Ju Choi, Eui-Kyeong Hong, Soo-Kyung Kim, and Doheon Lee. 2003. A Taxonomy of Dirty Data. Data Mining and Knowledge Discovery 7, 1 (Jan. 2003), 81–99. https://doi.org/10.1023/A:1021564703268",
      "doi": "10.1023/A%3A1021564703268"
    },
    {
      "text": "Won Kim and Jungyun Seo. 1991. Classifying Schematic and Data Heterogeneity in Multidatabase Systems. Computer 24 (Dec. 1991), 12–18. https://doi.org/10.1109/2.116884",
      "doi": "10.1109/2.116884"
    },
    {
      "text": "Lin Li, Taoxin Peng, and Jessie Kennedy. 2011. A Rule Based Taxonomy of Dirty Data. International Journal of Computing 1, 2 (Feb. 2011), 140–148.",
      "doi": ""
    },
    {
      "text": "Yang Liu, Tim Althoff, and Jeffrey Heer. 2020. Paths Explored, Paths Omitted, Paths Obscured: Decision Points & Selective Reporting in End-to-End Data Analysis. In Proceedings of the CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376533",
      "doi": "10.1145/3313831.3376533"
    },
    {
      "text": "Yaoli Mao, Dakuo Wang, Michael Muller, Kush R. Varshney, Ioana Baldini, Casey Dugan, and Aleksandra Mojsilović. 2019. How Data Scientists Work Together With Domain Experts in Scientific Collaborations: To Find The Right Answer Or To Ask The Right Question?Proceedings of the ACM on Human-Computer Interaction 3, GROUP (Dec. 2019), 1–23. https://doi.org/10.1145/3361118",
      "doi": "10.1145/3361118"
    },
    {
      "text": "Hilary Mason and Chris Wiggins. 2010. A Taxonomy of Data Science. Retrieved February 9, 2021 from https://sites.google.com/a/isim.net.in/datascience_isim/taxonomy",
      "doi": ""
    },
    {
      "text": "Marcus Messner and Bruce Garrison. 2017. Journalism’s \"Dirty Data\" Below Researchers’ Radar. Newspaper Research Journal 28, 4 (Aug. 2017), 88–100. https://doi.org/10.1177/073953290702800408",
      "doi": ""
    },
    {
      "text": "Philip Meyer. 2002. Precision Journalism: A Reporter’s Introduction to Social Science Methods (4thed.). Rowman & Littlefield, Lanham, MD, USA.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2017. What is the Team Data Science Process?https://docs.microsoft.com/en-us/azure/architecture/data-science-process/overview",
      "doi": ""
    },
    {
      "text": "Microsoft. 2022. Schema Drift in Mapping Data Flow. https://learn.microsoft.com/en-us/azure/data-factory/concepts-data-flow-schema-drift",
      "doi": ""
    },
    {
      "text": "Alessandra Maciel Pax Milani, Fernando V Paulovich, and Isabel Herb Manssour. 2020. Visualization in the Preprocessing Phase: Getting Insights From Enterprise Professionals. Information Visualization 19, 4 (Jan. 2020), 273–287. https://doi.org/10.1177/1473871619896101",
      "doi": ""
    },
    {
      "text": "Michael Muller, Lange Ingrid, Dakuo Wang, David Piorkowski, Jason Tsay, Q. Vera Liao, Casey Dugan, and Thomas Erickson. 2019. How Data Science Workers Work with Data: Discovery, Capture, Curation, Design, Creation. In Proceedings of the CHI Conference on Human Factors in Computing Systems (Glasgow, UK) (CHI ’19). ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300356",
      "doi": "10.1145/3290605.3300356"
    },
    {
      "text": "Tamara Munzner. 2014. Visualization Analysis and Design. CRC Press, Boca Raton, FL, USA.",
      "doi": ""
    },
    {
      "text": "Heiko Müller and Johann-Christoph Freytag. 2003. Problems, Methods, and Challenges in Comprehensive Data Cleansing. Technical Report. Humboldt Universität, Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 2013. The Design of Everyday Things. Basic Books, New York, NY, USA.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Adegboyega Ojo and Bahareh Heravi. 2018. Patterns in Award Winning Data Storytelling. Digital Journalism 6, 6 (Nov. 2018), 693–718. https://doi.org/10.1080/21670811.2017.1403291",
      "doi": ""
    },
    {
      "text": "Paulo Oliveira, Fátima Rodrigues, and Pedro Henriques. 2005. A Formal Definition of Data Quality Problems. In Proceedings of the International Conference Information Quality (Cambridge, MA, USA) (ICIQ ’05). MIT, Cambridge, MA, USA, 14. http://mitiq.mit.edu/ICIQ/Documents/IQ%20Conference%202005/Papers/AFormalDefinitionofDQProblems.pdf",
      "doi": ""
    },
    {
      "text": "Paulo Oliveira, Fátima Rodrigues, Pedro Henriques, and Helena Galhardas. 2005. A Taxonomy of Data Quality Problems. Instituto de Engenharia de Sistemas e Computadores - Investigação e Desenvolvimento. Retrieved April 6, 2022 from https://www.inesc-id.pt/ficheiros/publicacoes/2455.pdf",
      "doi": ""
    },
    {
      "text": "Sylvain Parasie. 2022. Computing the News: Data Journalism and the Search for Objectivity. Columbia University Press, New York, New York, USA.",
      "doi": ""
    },
    {
      "text": "Ryan Pitts and Lindsay Muscato. 2021. Open-Source Coding Practices in Data Journalism. Amsterdam University Press, Amsterdam, Netherlands. 191–193 pages. https://doi.org/10.1017/9789048542079.041",
      "doi": ""
    },
    {
      "text": "Erhard Rahm and Philip A. Bernstein. 2001. A Survey of Approaches to Automatic Schema Matching. The International Journal on Very Large Data Bases 10 (Dec. 2001), 334–350. https://doi.org/10.1007/s007780100057",
      "doi": "10.1007/s007780100057"
    },
    {
      "text": "Erhard Rahm and Hong Hai Do. 2000. Data Cleaning: Problems and Current Approaches. IEEE Data Eng. Bull. 23, 4 (2000), 3–13.",
      "doi": ""
    },
    {
      "text": "Sabbir M Rashid, James P McCusker, Paulo Pinheiro, Marcello P Bax, Henrique O Santos, Jeanette A Stingone, Amar K Das, and Deborah L McGuinness. 2020. The Semantic Data Dictionary: An Approach for Describing and Annotating Data. Data Intelligence 2, 4 (Oct. 2020), 443–486. https://doi.org/10.1162/dint_a_00058",
      "doi": ""
    },
    {
      "text": "Rebecca S. Robinson. 2014. Purposive Sampling. In Encyclopedia of Quality of Life and Well-Being Research, Alex C. Michalos (Ed.). Springer, New York, NY, USA, 5243–5245. https://doi.org/10.1007/978-94-007-0753-5_2337",
      "doi": ""
    },
    {
      "text": "Jan Roeder, Jan Muntermann, and Thomas Kneib. 2021. Towards a Taxonomy of Data Heterogeneity. Band-1 1, 1 (July 2021), 16. https://doi.org/10.30844/wi_2020_c6-roeder",
      "doi": ""
    },
    {
      "text": "Simon Rogers. 2013. Data Journalism Broken Down: What We Do to the Data Before You See It. The Guardian. Retrieved August 16, 2022 from https://www.theguardian.com/news/datablog/2011/apr/07/data-journalism-workflow",
      "doi": ""
    },
    {
      "text": "Simon Rogers, Jonathan Schwabish, and Dainelle Bowers. 2017. Data Journalism in 2017: The Current State and Challenges Facing the Field Today. Technical Report. Google News Lab, Mountain View, CA, USA.",
      "doi": ""
    },
    {
      "text": "Adam Rule, Aurélien Tabard, and James D. Hollan. 2018. Exploration and Explanation in Computational Notebooks. In Proceedings of the CHI Conference on Human Factors in Computing Systems (Montréal, Canada) (CHI ’18). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173606",
      "doi": "10.1145/3173574.3173606"
    },
    {
      "text": "Nithya Sambasivan, Shivani Kapania, Hannah Highfill, Diana Akrong, Praveen Paritosh, and Lora M Aroyo. 2021. \"Everyone Wants to do the Model Work, not the data work\": Data Cascades in High-Stakes AI. In Proceedings of the CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3411764.3445518",
      "doi": "10.1145/3411764.3445518"
    },
    {
      "text": "Dilruba Showkat and Eric PS Baumer. 2021. Where do Stories Come From? Examining the Exploration Process in Investigative Data Journalism. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–31. https://doi.org/10.1145/3479534",
      "doi": "10.1145/3479534"
    },
    {
      "text": "Tableau Software. 2018. Tableau Prep Builder. https://www.tableau.com/products/prep",
      "doi": ""
    },
    {
      "text": "Daniele R de Souza, Lorenzo P Leuck, Caroline Q Santos, Milene S Silveira, Isabel H Manssour, and Roberto Tietzmann. 2018. Interacting with Data to Create Journalistic Stories: A Systematic review. In International Conference on Human Interface and the Management of Information(Las Vegas, NV, USA) (HCII ’18). Springer, New York, NY, USA, 685–704. https://doi.org/10.1007/978-3-319-92043-6_54",
      "doi": "10.1007/978-3-319-92043-6_54"
    },
    {
      "text": "Jonathan Stray. 2017. Making NLP Work for Investigative Journalism. Retrieved November 13, 2021 from https://www.youtube.com/watch?v=yRP9DL8E36A",
      "doi": ""
    },
    {
      "text": "Jonathan Stray. 2019. Making Artificial Intelligence Work for Investigative Journalism. Digital Journalism 7, 8 (July 2019), 1076–1097. https://doi.org/10.1080/21670811.2019.1630289",
      "doi": ""
    },
    {
      "text": "Jonathan Stray. 2021. Making Algorithms Work for Reporting. Amsterdam University Press, Amsterdam, Netherlands. 90–91 pages.",
      "doi": ""
    },
    {
      "text": "Jon Swain. 2018. A Hybrid Approach to Thematic Analysis in Qualitative Research: Using a Practical Example. SAGE, Thousand Oaks, FA, United States. https://doi.org/10.4135/9781526435477",
      "doi": ""
    },
    {
      "text": "April Yi Wang, Anant Mittal, Christopher Brooks, and Steve Oney. 2019. How Data Scientists Use Computational Notebooks for Real-Time Collaboration. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 1–30. https://doi.org/10.1145/3359141",
      "doi": "10.1145/3359141"
    },
    {
      "text": "Dakuo Wang, Justin D. Weisz, Michael Muller, Parikshit Ram, Werner Geyer, Casey Dugan, Yla Tausczik, Horst Samulowitz, and Alexander Gray. 2019. Human-AI Collaboration in Data Science: Exploring Data Scientists’ Perceptions of Automated AI. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 1–24. https://doi.org/10.1145/3359313",
      "doi": "10.1145/3359313"
    },
    {
      "text": "Hadley Wickham. 2014. Tidy Data. Journal of Statistical Software 59, 10 (Sept. 2014), 1–23. https://doi.org/10.18637/jss.v059.i10",
      "doi": ""
    },
    {
      "text": "Rüdiger Wirth and Jochen Hipp. 2000. CRISP-DM: Towards a Standard Process Model for Data Mining. In Proceedings of the Fourth International Conference on the Practical Application of Knowledge Discovery and Data Mining (Manchester, UK) (PAKDDM ’00). Practical Application Company, Lancashire, UK, 29–39. http://cs.unibo.it/ danilo.montesi/CBD/Beatriz/10.1.1.198.5133.pdf",
      "doi": ""
    },
    {
      "text": "Kanit Wongsuphasawat, Yang Liu, and Jeffrey Heer. 2019. Goals, Process, and Challenges of Exploratory Data Analysis: An Interview Study. arXiv 1, 1 (2019), 10 pages. https://doi.org/10.48550/arXiv.1911.00568 arXiv:arXiv:1911.00568",
      "doi": ""
    },
    {
      "text": "Mary S Woodley. 2008. Crosswalks, Metadata Harvesting, Federated Searching, Metasearching: Using Metadata to Connect Users and Information(3rd ed.). Getty Research Institute, Los Angeles, CA, USA.",
      "doi": ""
    },
    {
      "text": "Amy X. Zhang, Michael Muller, and Dakuo Wang. 2020. How do Data Science Workers Collaborate? Roles, Workflows, and Tools. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1 (May 2020), 1–23. https://doi.org/10.1145/3392826",
      "doi": "10.1145/3392826"
    }
  ]
}