{
  "doi": "10.1145/3544548.3580848",
  "title": "Changes in Research Ethics, Openness, and Transparency in Empirical Studies between CHI 2017 and CHI 2022",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-23",
  "year": 2023,
  "badges": [
    "Best Paper"
  ],
  "abstract": "In recent years, various initiatives from within and outside the HCI field have encouraged researchers to improve research ethics, openness, and transparency in their empirical research. We quantify how the CHI literature might have changed in these three aspects by analyzing samples of 118 CHI 2017 and 127 CHI 2022 papers—randomly drawn and stratified across conference sessions. We operationalized research ethics, openness, and transparency into 45  criteria and manually annotated the sampled papers. The results show that the CHI 2022 sample was better in 18 criteria, but in the rest of the criteria, it has no improvement. The most noticeable improvements were related to research transparency (10 out of 17 criteria). We also explored the possibility of assisting the verification process by developing a proof-of-concept screening system. We tested this tool with eight criteria. Six of them achieved high accuracy and F1 score. We discuss the implications for future research practices and education.  This paper and all supplementary materials are freely available at https://doi.org/10.17605/osf.io/n25d6.",
  "authors": [
    {
      "name": "Kavous Salehzadeh Niksirat",
      "institution": "Department of Information Systems, University of Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-99659163243/rel-imgonly/img_2795.jpg",
      "acmid": "99659163243",
      "orcid": "0000-0003-4438-3544"
    },
    {
      "name": "Lahari Goswami",
      "institution": "Department of Information Systems, University of Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-99660780596/rel-imgonly/dsc_3312.png",
      "acmid": "99660780596",
      "orcid": "0000-0002-8975-5885"
    },
    {
      "name": "Pooja S. B. Rao",
      "institution": "Department of Information Systems, University of Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-99660631671/rel-imgonly/portrait.jpg",
      "acmid": "99660631671",
      "orcid": "0000-0003-3346-2749"
    },
    {
      "name": "James Tyler",
      "institution": "Department of Information Systems, University of Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-99660782051/rel-imgonly/james-150x150.jpg",
      "acmid": "99660782051",
      "orcid": "0000-0001-8102-962X"
    },
    {
      "name": "Alessandro Silacci",
      "institution": "Persuasive Technology Lab, University of Lausanne, Switzerland and Digital Business Center, HES-SO, Universities of Applied Sciences and Arts Western Switzerland, Switzerland",
      "img": "/do/10.1145/contrib-99660782071/rel-imgonly/img_8177_corrected.png",
      "acmid": "99660782071",
      "orcid": "0000-0001-8121-3013"
    },
    {
      "name": "Sadiq Aliyu",
      "institution": "Department of Information Systems, University of Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-99660780733/rel-imgonly/whatsapp_image_2023-05-09_at_10.00.08.jpeg",
      "acmid": "99660780733",
      "orcid": "0000-0002-5090-920X"
    },
    {
      "name": "Annika Aebli",
      "institution": "Department of Information Systems, University of Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-99660778243/rel-imgonly/bild_0009_dsc_085331.jpg",
      "acmid": "99660778243",
      "orcid": "0000-0002-8209-9950"
    },
    {
      "name": "Chat Wacharamanotham",
      "institution": "Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-81484657903/rel-imgonly/chat150x200-201604.png",
      "acmid": "81484657903",
      "orcid": "0000-0003-4831-2516"
    },
    {
      "name": "Mauro Cherubini",
      "institution": "Department of Information Systems, University of Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-99659582359/rel-imgonly/cherubini_photo_small.png",
      "acmid": "99659582359",
      "orcid": "0000-0002-1860-6110"
    }
  ],
  "references": [
    {
      "text": "Jacob Abbott, Haley MacLeod, Novia Nurain, Gustave Ekobe, and Sameer Patil. 2019. Local Standards for Anonymization Practices in Health, Wellness, Accessibility, and Aging Research at CHI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300692",
      "doi": "10.1145/3290605.3300692"
    },
    {
      "text": "ACM. 2019. ACM Policy on Submission, Hosting, Access, and Ownership of Digital Artifacts. https://www.acm.org/publications/policies/digital-artifacts",
      "doi": ""
    },
    {
      "text": "ACM. 2019. Permanent Access. https://www.acm.org/publications/policies/permanent-access",
      "doi": ""
    },
    {
      "text": "ACM. 2022. Open Access Publication & ACM. https://www.acm.org/publications/openaccess",
      "doi": ""
    },
    {
      "text": "Balazs Aczel, Barnabas Szaszi, Alexandra Sarafoglou, Zoltan Kekecs, Šimon Kucharský, Daniel Benjamin, Christopher D. Chambers, Agneta Fisher, Andrew Gelman, Morton A. Gernsbacher, John P. Ioannidis, Eric Johnson, Kai Jonas, Stavroula Kousta, Scott O. Lilienfeld, D. Stephen Lindsay, Candice C. Morey, Marcus Munafò, Benjamin R. Newell, Harold Pashler, David R. Shanks, Daniel J. Simons, Jelte M. Wicherts, Dolores Albarracin, Nicole D. Anderson, John Antonakis, Hal R. Arkes, Mitja D. Back, George C. Banks, Christopher Beevers, Andrew A. Bennett, Wiebke Bleidorn, Ty W. Boyer, Cristina Cacciari, Alice S. Carter, Joseph Cesario, Charles Clifton, Ronán M. Conroy, Mike Cortese, Fiammetta Cosci, Nelson Cowan, Jarret Crawford, Eveline A. Crone, John Curtin, Randall Engle, Simon Farrell, Pasco Fearon, Mark Fichman, Willem Frankenhuis, Alexandra M. Freund, M. Gareth Gaskell, Roger Giner-Sorolla, Don P. Green, Robert L. Greene, Lisa L. Harlow, Fernando Hoces de la Guardia, Derek Isaacowitz, Janet Kolodner, Debra Lieberman, Gordon D. Logan, Wendy B. Mendes, Lea Moersdorf, Brendan Nyhan, Jeffrey Pollack, Christopher Sullivan, Simine Vazire, and Eric-Jan Wagenmakers. 2020. A Consensus-Based Transparency Checklist. Nature Human Behaviour 4, 1 (Jan. 2020), 4–6. https://doi.org/10.1038/s41562-019-0772-6",
      "doi": ""
    },
    {
      "text": "Lena Fanya Aeschbach, Sebastian A.C. Perrig, Lorena Weder, Klaus Opwis, and Florian Brühlmann. 2021. Transparency in Measurement Reporting: A Systematic Literature Review of CHI PLAY. Proceedings of the ACM on Human-Computer Interaction 5, CHI PLAY (Oct. 2021), 233:1–233:21. https://doi.org/10.1145/3474660",
      "doi": "10.1145/3474660"
    },
    {
      "text": "Alan Agresti. 2011. Score and Pseudo-Score Confidence Intervals for Categorical Data Analysis. Statistics in Biopharmaceutical Research 3, 2 (May 2011), 163–172. https://doi.org/10.1198/sbr.2010.09053",
      "doi": ""
    },
    {
      "text": "Herman Aguinis and Angelo M. Solarino. 2019. Transparency and Replicability in Qualitative Research: The Case of Interviews with Elite Informants. Strategic Management Journal 40, 8 (2019), 1291–1315. https://doi.org/10.1002/smj.3015",
      "doi": ""
    },
    {
      "text": "Alissa N. Antle. 2017. The Ethics of Doing Research with Vulnerable Populations. Interactions 24, 6 (Oct. 2017), 74–77. https://doi.org/10.1145/3137107",
      "doi": "10.1145/3137107"
    },
    {
      "text": "APA. 2020. Publication Manual of the American Psychological Association, Seventh Edition. American Psychological Association (APA), IL, USA. https://apastyle.apa.org/products/publication-manual-7th-edition",
      "doi": ""
    },
    {
      "text": "Nick Ballou, Vivek R. Warriar, and Sebastian Deterding. 2021. Are You Open? A Content Analysis of Transparency and Openness Guidelines in HCI Journals. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3411764.3445584",
      "doi": "10.1145/3411764.3445584"
    },
    {
      "text": "Anita Bandrowski and Martijn Roelandse. 2022. SciScore, a Tool That Can Measure Rigor Criteria Presence or Absence in a Biomedical Study. In The 1st International Conference on Drug Repurposing. ScienceOpen, Maastricht, Netherlands, 2. https://doi.org/10.14293/S2199-1006.1.SOR-.PPPXBQN6.v1",
      "doi": ""
    },
    {
      "text": "Iz Beltagy, Kyle Lo, and Arman Cohan. 2019. SciBERT: A Pretrained Language Model for Scientific Text. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). Association for Computational Linguistics, Hong Kong, China, 3615–3620. https://doi.org/10.18653/v1/D19-1371",
      "doi": ""
    },
    {
      "text": "Pernille Bjorn, Casey Fiesler, Michael Muller, Jessica Pater, and Pamela Wisniewski. 2018. Research Ethics Town Hall Meeting. In Proceedings of the 2018 ACM Conference on Supporting Groupwork(GROUP ’18). Association for Computing Machinery, New York, NY, USA, 393–396. https://doi.org/10.1145/3148330.3154523",
      "doi": "10.1145/3148330.3154523"
    },
    {
      "text": "Ángel Borrego and Francesc Garcia. 2013. Provision of Supplementary Materials in Library and Information Science Scholarly Journals. Aslib Proceedings: New Information Perspectives 65, 5 (Jan. 2013), 503–514. https://doi.org/10.1108/AP-10-2012-0083",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Barry Brown, Alexandra Weilenmann, Donald McMillan, and Airi Lampinen. 2016. Five Provocations for Ethical HCI Research. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 852–863. https://doi.org/10.1145/2858036.2858313",
      "doi": "10.1145/2858036.2858313"
    },
    {
      "text": "Amy S. Bruckman, Casey Fiesler, Jeff Hancock, and Cosmin Munteanu. 2017. CSCW Research Ethics Town Hall: Working Towards Community Norms. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17 Companion). Association for Computing Machinery, New York, NY, USA, 113–115. https://doi.org/10.1145/3022198.3022199",
      "doi": "10.1145/3022198.3022199"
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 981–992. https://doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Paul Cairns. 2007. HCI... Not as It Should Be: Inferential Statistics in HCI Research. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...but Not as We Know It - Volume 1(BCS-HCI ’07). BCS Learning & Development Ltd., Swindon, GBR, 195–201.",
      "doi": ""
    },
    {
      "text": "Paul Cairns. 2019. Doing Better Statistics in Human-Computer Interaction. Cambridge University Press, Cambridge. https://doi.org/10.1017/9781108685139",
      "doi": ""
    },
    {
      "text": "Peter Celec. 2004. Open Access and Those Lacking Funds. Science 303, 5663 (March 2004), 1467–1467. https://doi.org/10.1126/science.303.5663.1467c",
      "doi": ""
    },
    {
      "text": "Christopher D. Chambers. 2013. Registered Reports: A New Publishing Initiative at Cortex. Cortex 49, 3 (March 2013), 609–610. https://doi.org/10.1016/j.cortex.2012.12.016",
      "doi": ""
    },
    {
      "text": "Mauro Cherubini, Kavous Salehzadeh Niksirat, Marc-Olivier Boldi, Henri Keopraseuth, Jose M. Such, and Kévin Huguenin. 2021. When Forcing Collaboration Is the Most Sensible Choice: Desirability of Precautionary and Dissuasive Mechanisms to Manage Multiparty Privacy Conflicts. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1 (April 2021), 53:1–53:36. https://doi.org/10.1145/3449127",
      "doi": "10.1145/3449127"
    },
    {
      "text": "Lewis L. Chuang and Ulrike Pfeil. 2018. Transparency and Openness Promotion Guidelines for HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3170427.3185377",
      "doi": "10.1145/3170427.3185377"
    },
    {
      "text": "James Clifford (Ed.). 1990. Notes on (Field) Notes. Cornell University Press, NY, USA. https://www.jstor.org/stable/10.7591/j.ctvv4124m",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Alan Dix. 2018. HARK No More: On the Preregistration of CHI Experiments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173715",
      "doi": "10.1145/3173574.3173715"
    },
    {
      "text": "Douglas Curran-Everett and Dale J. Benos. 2004. Guidelines for Reporting Statistics in Journals Published by the American Physiological Society. Physiological Genomics 18, 3 (Aug. 2004), 249–251. https://doi.org/10.1152/physiolgenomics.00155.2004",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair Statistical Communication in HCI. In Modern Statistical Methods for HCI, Judy Robertson and Maurits Kaptein (Eds.). Springer International Publishing, Cham, 291–330. https://doi.org/10.1007/978-3-319-26633-6_13",
      "doi": ""
    },
    {
      "text": "Nathalie Percie du Sert, Amrita Ahluwalia, Sabina Alam, Marc T. Avey, Monya Baker, William J. Browne, Alejandra Clark, Innes C. Cuthill, Ulrich Dirnagl, Michael Emerson, Paul Garner, Stephen T. Holgate, David W. Howells, Viki Hurst, Natasha A. Karp, Stanley E. Lazic, Katie Lidster, Catriona J. MacCallum, Malcolm Macleod, Esther J. Pearl, Ole H. Petersen, Frances Rawle, Penny Reynolds, Kieron Rooney, Emily S. Sena, Shai D. Silberberg, Thomas Steckler, and Hanno Würbel. 2020. Reporting Animal Research: Explanation and Elaboration for the ARRIVE Guidelines 2.0. PLOS Biology 18, 7 (July 2020), e3000411. https://doi.org/10.1371/journal.pbio.3000411",
      "doi": ""
    },
    {
      "text": "Florian Echtler and Maximilian Häußler. 2018. Open Source, Open Science, and the Replication Crisis in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3170427.3188395",
      "doi": "10.1145/3170427.3188395"
    },
    {
      "text": "Morten W Fagerland, Stian Lydersen, and Petter Laake. 2015. Recommended Confidence Intervals for Two Independent Binomial Proportions. Statistical Methods in Medical Research 24, 2 (April 2015), 224–254. https://doi.org/10.1177/0962280211415469",
      "doi": ""
    },
    {
      "text": "Franz Faul, Edgar Erdfelder, Albert-Georg Lang, and Axel Buchner. 2007. G*Power 3: A Flexible Statistical Power Analysis Program for the Social, Behavioral, and Biomedical Sciences. Behavior Research Methods 39, 2 (May 2007), 175–191. https://doi.org/10.3758/bf03193146",
      "doi": ""
    },
    {
      "text": "Sebastian S. Feger, Cininta Pertiwi, and Enrico Bonaiuti. 2022. Research Data Management Commitment Drivers: An Analysis of Practices, Training, Policies, Infrastructure, and Motivation in Global Agricultural Science. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2 (Nov. 2022), 322:1–322:36. https://doi.org/10.1145/3555213",
      "doi": "10.1145/3555213"
    },
    {
      "text": "Sebastian S. Feger, Paweł W. Wozniak, Lars Lischke, and Albrecht Schmidt. 2020. ’Yes, I Comply!’: Motivations and Practices around Research Data Management and Reuse across Scientific Fields. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2 (Oct. 2020), 141:1–141:26. https://doi.org/10.1145/3415212",
      "doi": "10.1145/3415212"
    },
    {
      "text": "Casey Fiesler, Christopher Frauenberger, Michael Muller, Jessica Vitak, and Michael Zimmer. 2022. Research Ethics in HCI: A SIGCHI Community Discussion. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems(CHI EA ’22). Association for Computing Machinery, New York, NY, USA, 1–3. https://doi.org/10.1145/3491101.3516400",
      "doi": "10.1145/3491101.3516400"
    },
    {
      "text": "Casey Fiesler, Jeff Hancock, Amy Bruckman, Michael Muller, Cosmin Munteanu, and Melissa Densmore. 2018. Research Ethics for HCI: A Roundtable Discussion. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/3170427.3186321",
      "doi": "10.1145/3170427.3186321"
    },
    {
      "text": "Christopher Frauenberger, Amy S. Bruckman, Cosmin Munteanu, Melissa Densmore, and Jenny Waycott. 2017. Research Ethics in HCI: A Town Hall Meeting. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 1295–1299. https://doi.org/10.1145/3027063.3051135",
      "doi": "10.1145/3027063.3051135"
    },
    {
      "text": "John Furler, Parker Magin, Marie Pirotta, and Mieke van Driel. 2012. Participant Demographics Reported in \"Table 1\" of Randomised Controlled Trials: A Case of \"Inverse Evidence\"?International Journal for Equity in Health 11, 1 (March 2012), 14. https://doi.org/10.1186/1475-9276-11-14",
      "doi": ""
    },
    {
      "text": "Aakash Gautam, Chandani Shrestha, Andrew Kulak, Steve Harrison, and Deborah Tatar. 2018. Participatory Tensions in Working with a Vulnerable Population. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial - Volume 2(PDC ’18). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/3210604.3210629",
      "doi": "10.1145/3210604.3210629"
    },
    {
      "text": "Clifford Geertz. 1976. The Religion of Java. University of Chicago Press, Chicago, IL. https://press.uchicago.edu/ucp/books/book/chicago/R/bo3627129.html",
      "doi": ""
    },
    {
      "text": "{CHI guideline contributors in alphabetical order}, Pernille Bjørn, Fanny Chevalier, Pierre Dragicevic, Shion Guha, Steve Haroz, Helen Ai He, Elaine M. Huang, Matthew Kay, Ulrik Lyngs, Joanna McGrenere, Christian Remy, Poorna Talkad Sukumar, and Chat Wacharamanotham. 2019. Proposal for Changes to the CHI Reviewing Guidelines. Technical Report. Zenodo. https://doi.org/10.5281/zenodo.5566172",
      "doi": ""
    },
    {
      "text": "Tamarinde L. Haven, Timothy M. Errington, Kristian Skrede Gleditsch, Leonie van Grootel, Alan M. Jacobs, Florian G. Kern, Rafael Piñeiro, Fernando Rosenblatt, and Lidwine B. Mokkink. 2020. Preregistering Qualitative Research: A Delphi Study. International Journal of Qualitative Methods 19 (Jan. 2020), 1–13. https://doi.org/10.1177/1609406920976417",
      "doi": ""
    },
    {
      "text": "Constance Holman, Sophie K. Piper, Ulrike Grittner, Andreas Antonios Diamantaras, Jonathan Kimmelman, Bob Siegerink, and Ulrich Dirnagl. 2016. Where Have All the Rodents Gone? The Effects of Attrition in Experimental Research on Cancer and Stroke. PLOS Biology 14, 1 (Jan. 2016), 1–12. https://doi.org/10.1371/journal.pbio.1002331",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk, Søren S. Sander, Javier Andrés Bargas-Avila, and Jakob Grue Simonsen. 2014. Is Once Enough? On the Extent and Content of Replications in Human-Computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 3523–3532. https://doi.org/10.1145/2556288.2557004",
      "doi": "10.1145/2556288.2557004"
    },
    {
      "text": "Hamid R. Jamali. 2017. Copyright Compliance and Infringement in ResearchGate Full-Text Journal Articles. Scientometrics 112, 1 (July 2017), 241–254. https://doi.org/10.1007/s11192-017-2291-4",
      "doi": "10.1007/s11192-017-2291-4"
    },
    {
      "text": "David W. Jamieson and Kenneth W. Thomas. 1974. Power and Conflict in the Student-Teacher Relationship. The Journal of Applied Behavioral Science 10, 3 (July 1974), 321–336. https://doi.org/10.1177/002188637401000304",
      "doi": ""
    },
    {
      "text": "Nathalie Japkowicz and Mohak Shah. 2011. Evaluating Learning Algorithms: A Classification Perspective. Cambridge University Press, Cambridge, England.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Steve Haroz, Shion Guha, and Pierre Dragicevic. 2016. Special Interest Group on Transparent Statistics in HCI. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 1081–1084. https://doi.org/10.1145/2851581.2886442",
      "doi": "10.1145/2851581.2886442"
    },
    {
      "text": "Matthew Kay, Steve Haroz, Shion Guha, Pierre Dragicevic, and Chat Wacharamanotham. 2017. Moving Transparent Statistics Forward at CHI. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 534–541. https://doi.org/10.1145/3027063.3027084",
      "doi": "10.1145/3027063.3027084"
    },
    {
      "text": "Juho Kim, Haoqi Zhang, Paul André, Lydia B. Chilton, Wendy Mackay, Michel Beaudouin-Lafon, Robert C. Miller, and Steven P. Dow. 2013. Cobi: A Community-Informed Conference Scheduling Tool. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology(UIST ’13). Association for Computing Machinery, New York, NY, USA, 173–182. https://doi.org/10.1145/2501988.2502034",
      "doi": "10.1145/2501988.2502034"
    },
    {
      "text": "Michal Krawczyk and Ernesto Reuben. 2012. (Un)Available upon Request: Field Experiment on Researchers’ Willingness to Share Supplementary Materials. Accountability in Research 19, 3 (May 2012), 175–186. https://doi.org/10.1080/08989621.2012.678688",
      "doi": ""
    },
    {
      "text": "Daniël Lakens. 2022. Sample Size Justification. Collabra: Psychology 8, 1 (March 2022), 33267. https://doi.org/10.1525/collabra.33267",
      "doi": ""
    },
    {
      "text": "Tom Lang and Douglas Altman. 2016. Statistical Analyses and Methods in the Published Literature: The SAMPL Guidelines. Medical Writing 25 (Sept. 2016), 31–36. https://journal.emwa.org/statistics/statistical-analyses-and-methods-in-the-published-literature-the-sampl-guidelines/",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research Methods in Human-Computer Interaction - 2nd Edition. Morgan Kaufmann, MA, USA. https://www.elsevier.com/books/research-methods-in-human-computer-interaction/lazar/978-0-12-805390-4",
      "doi": ""
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How WEIRD Is CHI?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3411764.3445488",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "Florian Mann, Benedikt von Walter, Thomas Hess, and Rolf T. Wigand. 2009. Open Access Publishing in Science. Commun. ACM 52, 3 (March 2009), 135–139. https://doi.org/10.1145/1467247.1467279",
      "doi": "10.1145/1467247.1467279"
    },
    {
      "text": "Nora McDonald, Karla Badillo-Urquiola, Morgan G. Ames, Nicola Dell, Elizabeth Keneski, Manya Sleeper, and Pamela J. Wisniewski. 2020. Privacy and Power: Acknowledging the Importance of Privacy Research and Design for Vulnerable Populations. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3375174",
      "doi": "10.1145/3334480.3375174"
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 72:1–72:23. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Joe Menke, Martijn Roelandse, Burak Ozyurt, Maryann Martone, and Anita Bandrowski. 2020. The Rigor and Transparency Index Quality Metric for Assessing Biological and Medical Science Methods. iScience 23, 11 (Nov. 2020), 101698. https://doi.org/10.1016/j.isci.2020.101698",
      "doi": ""
    },
    {
      "text": "Matthew B. Miles, A. Michael Huberman, and Johnny Saldana. 2022. Qualitative Data Analysis: A Methods Sourcebook. SAGE, CA, USA. https://us.sagepub.com/en-us/nam/qualitative-data-analysis/book246128",
      "doi": ""
    },
    {
      "text": "Andrew Moravcsik. 2014. Transparency: The Revolution in Qualitative Research. PS: Political Science & Politics 47, 1 (Jan. 2014), 48–53. https://doi.org/10.1017/S1049096513001789",
      "doi": ""
    },
    {
      "text": "Gaia Mosconi, Dave Randall, Helena Karasti, Saja Aljuneidi, Tong Yu, Peter Tolmie, and Volkmar Pipek. 2022. Designing a Data Story: A Storytelling Approach to Curation, Sharing and Data Reuse in Support of Ethnographically-driven Research. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2 (Nov. 2022), 289:1–289:23. https://doi.org/10.1145/3555180",
      "doi": "10.1145/3555180"
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O’Donnell, and John Vines. 2015. Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 105–114. https://doi.org/10.1145/2702123.2702481",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "B. A. Nosek, G. Alter, G. C. Banks, D. Borsboom, S. D. Bowman, S. J. Breckler, S. Buck, C. D. Chambers, G. Chin, G. Christensen, M. Contestabile, A. Dafoe, E. Eich, J. Freese, R. Glennerster, D. Goroff, D. P. Green, B. Hesse, M. Humphreys, J. Ishiyama, D. Karlan, A. Kraut, A. Lupia, P. Mabry, T. Madon, N. Malhotra, E. Mayo-Wilson, M. McNutt, E. Miguel, E. Levy Paluck, U. Simonsohn, C. Soderberg, B. A. Spellman, J. Turitto, G. VandenBos, S. Vazire, E. J. Wagenmakers, R. Wilson, and T. Yarkoni. 2015. Promoting an Open Research Culture. Science 348, 6242 (June 2015), 1422–1425. https://doi.org/10.1126/science.aab2374",
      "doi": ""
    },
    {
      "text": "Giovanna Nunes Vilaza, Kevin Doherty, Darragh McCashin, David Coyle, Jakob Bardram, and Marguerite Barry. 2022. A Scoping Review of Ethics Across SIGCHI. In Designing Interactive Systems Conference(DIS ’22). Association for Computing Machinery, New York, NY, USA, 137–154. https://doi.org/10.1145/3532106.3533511",
      "doi": "10.1145/3532106.3533511"
    },
    {
      "text": "Bridget C. O’Brien, Ilene B. Harris, Thomas J. Beckman, Darcy A. Reed, and David A. Cook. 2014. Standards for Reporting Qualitative Research: A Synthesis of Recommendations. Academic Medicine 89, 9 (Sept. 2014), 1245–1251. https://doi.org/10.1097/ACM.0000000000000388",
      "doi": ""
    },
    {
      "text": "Yuren Pang, Katharina Reinecke, and René Just. 2022. Apéritif: Scaffolding Preregistrations to Automatically Generate Analysis Code and Methods Descriptions. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3491102.3517707",
      "doi": "10.1145/3491102.3517707"
    },
    {
      "text": "Van L. Parsons. 2017. Stratified Sampling. In Wiley StatsRef: Statistics Reference Online. John Wiley & Sons, Ltd, NY, USA, 1–11. https://doi.org/10.1002/9781118445112.stat05999.pub2",
      "doi": ""
    },
    {
      "text": "Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, Alban Desmaison, Andreas Köpf, Edward Yang, Zach DeVito, Martin Raison, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. 2019. PyTorch: An Imperative Style, High-Performance Deep Learning Library. https://doi.org/10.48550/arXiv.1912.01703 arxiv:1912.01703 [cs, stat]",
      "doi": ""
    },
    {
      "text": "Jessica Pater, Amanda Coupe, Rachel Pfafman, Chanda Phelan, Tammy Toscos, and Maia Jacobs. 2021. Standardizing Reporting of Participant Compensation in HCI: A Systematic Literature Review and Recommendations for the Field. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3411764.3445734",
      "doi": "10.1145/3411764.3445734"
    },
    {
      "text": "Prasad Patil, Roger D. Peng, and Jeffrey T. Leek. 2016. A Statistical Definition for Reproducibility and Replicability. Preprint. bioRxiv. https://doi.org/10.1101/066803",
      "doi": ""
    },
    {
      "text": "George Peat, Richard D. Riley, Peter Croft, Katherine I. Morley, Panayiotis A. Kyzas, Karel G. M. Moons, Pablo Perel, Ewout W. Steyerberg, Sara Schroter, Douglas G. Altman, Harry Hemingway, and for the PROGRESS Group. 2014. Improving the Transparency of Prognosis Research: The Role of Reporting, Data Sharing, Registration, and Protocols. PLOS Medicine 11, 7 (July 2014), e1001671. https://doi.org/10.1371/journal.pmed.1001671",
      "doi": ""
    },
    {
      "text": "Marco Perugini, Marcello Gallucci, and Giulio Costantini. 2018. A Practical Primer To Power Analysis for Simple Experimental Designs. International Review of Social Psychology 31, 1 (July 2018), 20. https://doi.org/10.5334/irsp.181",
      "doi": ""
    },
    {
      "text": "Kenneth D. Pimple. 2002. Six Domains of Research Ethics. Science and Engineering Ethics 8, 2 (June 2002), 191–205. https://doi.org/10.1007/s11948-002-0018-1",
      "doi": ""
    },
    {
      "text": "Denise F. Polit. 2011. Blinding during the Analysis of Research Data. International Journal of Nursing Studies 48, 5 (May 2011), 636–641. https://doi.org/10.1016/j.ijnurstu.2011.02.010",
      "doi": ""
    },
    {
      "text": "David .M.W Powers. 2011. Evaluation: From Precision, Recall and F-measure to ROC, Informedness, Markedness and Correlation. Journal of Machine Learning Technologies 2, 1 (Dec. 2011), 37–63. https://doi.org/10.48550/arXiv.2010.16061",
      "doi": ""
    },
    {
      "text": "Lumpapun Punchoojit and Nuttanont Hongwarittorrn. 2015. Research Ethics in Human-Computer Interaction: A Review of Ethical Concerns in the Past Five Years. In 2015 2nd National Foundation for Science and Technology Development Conference on Information and Computer Science (NICS). IEEE, Ho Chi Minh City, Vietnam, 180–185. https://doi.org/10.1109/NICS.2015.7302187",
      "doi": ""
    },
    {
      "text": "Camille R. Quinn. 2015. General Considerations for Research with Vulnerable Populations: Ten Lessons for Success. Health & Justice 3, 1 (Jan. 2015), 1. https://doi.org/10.1186/s40352-014-0013-z",
      "doi": ""
    },
    {
      "text": "Judy Robertson and Maurits Kaptein (Eds.). 2016. Modern Statistical Methods for HCI. Springer International Publishing, Cham. https://doi.org/10.1007/978-3-319-26633-6",
      "doi": ""
    },
    {
      "text": "Susan L. Rose and Charles E. Pietri. 2002. Workers as Research Subjects: A Vulnerable Population. Journal of Occupational and Environmental Medicine 44, 9 (2002), 801–805. https://doi.org/10.1097/00043764-200209000-00001",
      "doi": ""
    },
    {
      "text": "Victor Sanh, Lysandre Debut, Julien Chaumond, and Thomas Wolf. 2020. DistilBERT, a Distilled Version of BERT: Smaller, Faster, Cheaper and Lighter. https://doi.org/10.48550/arXiv.1910.01108 arxiv:1910.01108 [cs]",
      "doi": ""
    },
    {
      "text": "Ralph Scherer. 2018. PropCIs: Various Confidence Interval Methods for Proportions. https://CRAN.R-project.org/package=PropCIs",
      "doi": ""
    },
    {
      "text": "Council for International Organizations of Medical Sciences. 2017. International Ethical Guidelines for Health-Related Research Involving Humans. World Health Organization, Geneva, CH. https://www.cabdirect.org/cabdirect/abstract/20173377536",
      "doi": ""
    },
    {
      "text": "Joanna Smith and Jill Firth. 2011. Qualitative Data Analysis: The Framework Approach. Nurse Researcher 18, 2 (2011), 52–62. https://doi.org/10.7748/nr2011.01.18.2.52.c8284",
      "doi": ""
    },
    {
      "text": "Martin Spann, Lucas Stich, and Klaus M. Schmidt. 2017. Pay What You Want as a Pricing Model for Open Access Publishing?Commun. ACM 60, 11 (Oct. 2017), 29–31. https://doi.org/10.1145/3140822",
      "doi": "10.1145/3140822"
    },
    {
      "text": "Jose M. Such, Joel Porter, Sören Preibusch, and Adam Joinson. 2017. Photo Privacy Conflicts in Social Media: A Large-scale Empirical Study. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 3821–3832. https://doi.org/10.1145/3025453.3025668",
      "doi": "10.1145/3025453.3025668"
    },
    {
      "text": "Poorna Talkad Sukumar, Ignacio Avellino, Christian Remy, Michael A. DeVito, Tawanna R. Dillahunt, Joanna McGrenere, and Max L. Wilson. 2020. Transparency in Qualitative Research: Increasing Fairness in the CHI Review Process. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3334480.3381066",
      "doi": "10.1145/3334480.3381066"
    },
    {
      "text": "Allison Tong, Peter Sainsbury, and Jonathan Craig. 2007. Consolidated Criteria for Reporting Qualitative Research (COREQ): A 32-Item Checklist for Interviews and Focus Groups. International Journal for Quality in Health Care 19, 6 (Dec. 2007), 349–357. https://doi.org/10.1093/intqhc/mzm042",
      "doi": ""
    },
    {
      "text": "UNESCO. 2021. UNESCO Recommendation on Open Science. https://unesdoc.unesco.org/ark:/48223/pf0000379949.locale=en",
      "doi": ""
    },
    {
      "text": "Alicia VandeVusse, Jennifer Mueller, and Sebastian Karcher. 2022. Qualitative Data Sharing: Participant Understanding, Motivation, and Consent. Qualitative Health Research 32, 1 (Jan. 2022), 182–191. https://doi.org/10.1177/10497323211054058",
      "doi": ""
    },
    {
      "text": "Timothy H. Vines, Arianne Y. K. Albert, Rose L. Andrew, Florence Débarre, Dan G. Bock, Michelle T. Franklin, Kimberly J. Gilbert, Jean-Sébastien Moore, Sébastien Renaut, and Diana J. Rennison. 2014. The Availability of Research Data Declines Rapidly with Article Age. Current Biology 24, 1 (Jan. 2014), 94–97. https://doi.org/10.1016/j.cub.2013.11.014",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Katie Shilton, and Zahra Ashktorab. 2016. Beyond the Belmont Principles: Ethical Challenges, Practices, and Beliefs in the Online Data Research Community. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing(CSCW ’16). Association for Computing Machinery, New York, NY, USA, 941–953. https://doi.org/10.1145/2818048.2820078",
      "doi": "10.1145/2818048.2820078"
    },
    {
      "text": "Jan B. Vornhagen, April Tyack, and Elisa D. Mekler. 2020. Statistical Significance Testing at CHI PLAY: Challenges and Opportunities for More Transparency. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, New York, NY, USA, 4–18. https://doi.org/10.1145/3410404.3414229",
      "doi": "10.1145/3410404.3414229"
    },
    {
      "text": "Chat Wacharamanotham, Lukas Eisenring, Steve Haroz, and Florian Echtler. 2020. Transparency of CHI Research Artifacts: Results of a Self-Reported Survey. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376448",
      "doi": "10.1145/3313831.3376448"
    },
    {
      "text": "Chat Wacharamanotham, Fumeng Yang, Xiaoying Pu, Abhraneel Sarma, and Lace Padilla. 2022. Transparent Practices for Quantitative Empirical Research. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems(CHI EA ’22). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/3491101.3503760",
      "doi": "10.1145/3491101.3503760"
    },
    {
      "text": "Ashley Marie Walker, Yaxing Yao, Christine Geeng, Roberto Hoyle, and Pamela Wisniewski. 2019. Moving beyond ’One Size Fits All’: Research Considerations for Working with Vulnerable Populations. Interactions 26, 6 (Oct. 2019), 34–39. https://doi.org/10.1145/3358904",
      "doi": "10.1145/3358904"
    },
    {
      "text": "Dan S. Wallach. 2011. Rebooting the CS Publication Process. Commun. ACM 54, 10 (Oct. 2011), 32–35. https://doi.org/10.1145/2001269.2001283",
      "doi": "10.1145/2001269.2001283"
    },
    {
      "text": "Shirley Wheeler. 2003. Comparing Three IS Codes of Ethics - ACM, ACS and BCS. PACIS 2003 Proceedings 107 (Dec. 2003), 1576–1589. https://aisel.aisnet.org/pacis2003/107",
      "doi": ""
    },
    {
      "text": "Jelte M. Wicherts, Coosje L. S. Veldkamp, Hilde E. M. Augusteijn, Marjan Bakker, Robbie C. M. van Aert, and Marcel A. L. M. van Assen. 2016. Degrees of Freedom in Planning, Running, Analyzing, and Reporting Psychological Studies: A Checklist to Avoid p-Hacking. Frontiers in Psychology 7 (2016), 12. https://doi.org/10.3389/fpsyg.2016.01832",
      "doi": ""
    },
    {
      "text": "Mark D. Wilkinson, Michel Dumontier, IJsbrand Jan Aalbersberg, Gabrielle Appleton, Myles Axton, Arie Baak, Niklas Blomberg, Jan-Willem Boiten, Luiz Bonino da Silva Santos, Philip E. Bourne, Jildau Bouwman, Anthony J. Brookes, Tim Clark, Mercè Crosas, Ingrid Dillo, Olivier Dumon, Scott Edmunds, Chris T. Evelo, Richard Finkers, Alejandra Gonzalez-Beltran, Alasdair J. G. Gray, Paul Groth, Carole Goble, Jeffrey S. Grethe, Jaap Heringa, Peter A. C. ’t Hoen, Rob Hooft, Tobias Kuhn, Ruben Kok, Joost Kok, Scott J. Lusher, Maryann E. Martone, Albert Mons, Abel L. Packer, Bengt Persson, Philippe Rocca-Serra, Marco Roos, Rene van Schaik, Susanna-Assunta Sansone, Erik Schultes, Thierry Sengstag, Ted Slater, George Strawn, Morris A. Swertz, Mark Thompson, Johan van der Lei, Erik van Mulligen, Jan Velterop, Andra Waagmeester, Peter Wittenburg, Katherine Wolstencroft, Jun Zhao, and Barend Mons. 2016. The FAIR Guiding Principles for Scientific Data Management and Stewardship. Scientific Data 3, 1 (March 2016), 160018. https://doi.org/10.1038/sdata.2016.18",
      "doi": ""
    },
    {
      "text": "Adina Williams, Nikita Nangia, and Samuel Bowman. 2018. A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long Papers). Association for Computational Linguistics, New Orleans, Louisiana, 1112–1122. https://doi.org/10.18653/v1/N18-1101",
      "doi": ""
    },
    {
      "text": "Günter Wilms. 2019. Guide on Good Data Protection Practice in Research. https://www.eui.eu/documents/servicesadmin/deanofstudies/researchethics/guide-data-protection-research.pdf",
      "doi": ""
    },
    {
      "text": "Max Wilson, Wendy Mackay, Ed Chi, Michael Bernstein, and Jeffrey Nichols. 2012. RepliCHI SIG: From a Panel to a New Submission Venue for Replication. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’12). Association for Computing Machinery, New York, NY, USA, 1185–1188. https://doi.org/10.1145/2212776.2212419",
      "doi": "10.1145/2212776.2212419"
    },
    {
      "text": "Max L. Wilson, Ed H. Chi, Stuart Reeves, and David Coyle. 2014. RepliCHI: The Workshop II. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 33–36. https://doi.org/10.1145/2559206.2559233",
      "doi": "10.1145/2559206.2559233"
    },
    {
      "text": "Max L. Wilson, Wendy Mackay, Ed Chi, Michael Bernstein, Dan Russell, and Harold Thimbleby. 2011. RepliCHI - CHI Should Be Replicating and Validating Results More: Discuss. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 463–466. https://doi.org/10.1145/1979742.1979491",
      "doi": "10.1145/1979742.1979491"
    },
    {
      "text": "Max L. L. Wilson, Paul Resnick, David Coyle, and Ed H. Chi. 2013. RepliCHI: The Workshop. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 3159–3162. https://doi.org/10.1145/2468356.2479636",
      "doi": "10.1145/2468356.2479636"
    },
    {
      "text": "Jacob O. Wobbrock and Julie A. Kientz. 2016. Research Contributions in Human-Computer Interaction. Interactions 23, 3 (April 2016), 38–44. https://doi.org/10.1145/2907069",
      "doi": "10.1145/2907069"
    },
    {
      "text": "Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pierric Cistac, Tim Rault, Rémi Louf, Morgan Funtowicz, Joe Davison, Sam Shleifer, Patrick von Platen, Clara Ma, Yacine Jernite, Julien Plu, Canwen Xu, Teven Le Scao, Sylvain Gugger, Mariama Drame, Quentin Lhoest, and Alexander M. Rush. 2020. HuggingFace’s Transformers: State-of-the-art Natural Language Processing. https://doi.org/10.48550/arXiv.1910.03771",
      "doi": ""
    },
    {
      "text": "Koji Yatani. 2016. Effect Sizes and Power Analysis in HCI. In Modern Statistical Methods for HCI, Judy Robertson and Maurits Kaptein (Eds.). Springer International Publishing, Cham, 87–110. https://doi.org/10.1007/978-3-319-26633-6_5",
      "doi": ""
    },
    {
      "text": "Wenpeng Yin, Jamaal Hay, and Dan Roth. 2019. Benchmarking Zero-shot Text Classification: Datasets, Evaluation and Entailment Approach. https://doi.org/10.48550/arXiv.1909.00161",
      "doi": ""
    },
    {
      "text": "Tianyi Zhang, Varsha Kishore, Felix Wu, Kilian Q. Weinberger, and Yoav Artzi. 2020. BERTScore: Evaluating Text Generation with BERT. https://doi.org/10.48550/arXiv.1904.09675",
      "doi": ""
    },
    {
      "text": "Kelly H. Zou, Julia R. Fielding, Stuart G. Silverman, and Clare M. C. Tempany. 2003. Hypothesis Testing I: Proportions. Radiology 226, 3 (March 2003), 609–613. https://doi.org/10.1148/radiol.2263011500",
      "doi": ""
    }
  ]
}