{
  "doi": "10.1145/3544548.3581301",
  "title": "Understanding People’s Perception and Usage of Plug-in Electric Hybrids",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2023,
  "badges": [],
  "abstract": "Electrification is an important first step toward reducing the greenhouse emissions of passenger vehicles. However, how drivers drive, charge, and operate their electrified vehicles can have a large impact on their emissions, particularly for Plug-in Hybrid Electric vehicles (PHEVs) that combine all-electric driving with an internal combustion engine. In this paper, we investigate how and why drivers use their PHEVs and uncover design opportunities for interfaces that can support the efficient use of PHEVs. We used a mixed-method approach combining quantitative, qualitative, and concept elicitation methods with PHEV owners in the US. While past findings indicate that PHEV drivers are not motivated to charge regularly, our work contradicts this with evidence of (1) regular charging with home infrastructure, (2) high cost sensitivity, and (3) preference for driving in all-electric mode. Our results indicate that the most critical problem is inadequate user support for navigating poor charging infrastructure.",
  "tags": [
    "automobiles",
    "plug-in",
    "phev",
    "prototyping",
    "carbon",
    "behavioral science",
    "hybrid"
  ],
  "authors": [
    {
      "name": "Matthew L Lee",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660049684",
      "orcid": "0000-0003-2620-2623"
    },
    {
      "name": "Scott Carter",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238112",
      "orcid": "0000-0002-2942-972X"
    },
    {
      "name": "Rumen Iliev",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660571008",
      "orcid": "0000-0002-9619-4166"
    },
    {
      "name": "Nayeli Suseth Bravo",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660569252",
      "orcid": "0000-0001-9238-9831"
    },
    {
      "name": "Monica P Van",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779933",
      "orcid": "0000-0001-7028-3462"
    },
    {
      "name": "Laurent Denoue",
      "institution": "Toyota Research Institute, United States",
      "img": "/do/10.1145/contrib-81100521493/rel-imgonly/ldenoue.jpg",
      "acmid": "81100521493",
      "orcid": "0000-0002-9846-2582"
    },
    {
      "name": "Everlyne Kimani",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319517",
      "orcid": "0000-0002-0532-4114"
    },
    {
      "name": "Alexandre L. S. Filipowicz",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660049505",
      "orcid": "0000-0002-1311-386X"
    },
    {
      "name": "David A. Shamma",
      "institution": "Toyota Research Institute, United States",
      "img": "/do/10.1145/contrib-81100288295/rel-imgonly/me.jpg",
      "acmid": "81100288295",
      "orcid": "0000-0003-2399-9374"
    },
    {
      "name": "Kate A Sieck",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778974",
      "orcid": "0000-0003-4536-5751"
    },
    {
      "name": "Candice Hogan",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783626",
      "orcid": "0000-0002-3240-2560"
    },
    {
      "name": "Charlene C. Wu",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778634",
      "orcid": "0000-0002-7791-8050"
    }
  ],
  "references": [
    {
      "text": "Simone Avolicino, Marianna Di Gregorio, Marco Romano, Monica Sebillo, Genoveffa Tortora, and Giuliana Vitiello. 2022. EcoGO: Combining eco-feedback and gamification to improve the sustainability of driving style. In Proceedings of the 2022 International Conference on Advanced Visual Interfaces. 1–5.",
      "doi": "10.1145/3531073.3531127"
    },
    {
      "text": "John Beshears, James J Choi, David Laibson, and Brigitte C Madrian. 2008. How are preferences revealed?Journal of public economics 92, 8-9 (2008), 1787–1794.",
      "doi": ""
    },
    {
      "text": "Daniel Boston and Alyssa Werthman. 2016. Plug-in Vehicle Behaviors: An analysis of charging and driving behavior of Ford plug-in electric vehicles in the real world. World Electric Vehicle Journal 8, 4 (2016), 926–935.",
      "doi": ""
    },
    {
      "text": "Michael Braun, Florian Weber, and Florian Alt. 2021. Affective Automotive User Interfaces–Reviewing the State of Driver Affect Research and Emotion Regulation in the Car. ACM Comput. Surv. 54, 7, Article 137 (2021), 26 pages.",
      "doi": ""
    },
    {
      "text": "Abby Brown, Stephen Lommele, Alexis Schayowitz, and Emily Klotz. 2021. Electric Vehicle Charging Infrastructure Trends from the Alternative Fueling Station Locator: Third Quarter 2020. Technical Report. National Renewable Energy Lab.(NREL), Golden, CO.",
      "doi": ""
    },
    {
      "text": "A. J. Bernheim Brush, John Krumm, Sidhant Gupta, and Shwetak Patel. 2015. EVHomeShifter: Evaluating Intelligent Techniques for Using Electrical Vehicle Batteries to Shift When Homes Draw Energy from the Grid. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 1077–1088.",
      "doi": "10.1145/2750858.2804274"
    },
    {
      "text": "John L Campbell, Charles Quincy, Jordan Osserman, and Ove K Pedersen. 2013. Coding In-depth Semistructured Interviews: Problems of Unitization and Intercoder Reliability and Agreement. Sociol. Methods Res. 42, 3 (Aug. 2013), 294–320.",
      "doi": ""
    },
    {
      "text": "CarGurus. 2021. Electric Vehicle Sentiment Survey. Technical Report. CarGurus, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Scott Carter, Jennifer Mankoff, Scott R. Klemmer, and Tara Matthews. 2008. Exiting the cleanroom: On ecological validity and ubiquitous computing. Human–Computer Interaction 23, 1 (2008), 47–99.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2021. Gen Z, Millennials Stand Out for Climate Change Activism, Social Media Engagement With Issue. Technical Report. Pew Research Center, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Debapriya Chakraborty, Scott Hardman, and Gil Tal. 2020. Why do some consumers not charge their plug-in hybrid vehicles? Evidence from Californian plug-in hybrid owners. Environmental Research Letters 15, 8 (2020), 084031.",
      "doi": ""
    },
    {
      "text": "SAE International Hybrid-EV Committee 2010. J2841: Utility Factor Definitions for Plug-In Hybrid Electric Vehicles Using Travel Survey Data. SAE International: Warrendale, PA, USA(2010).",
      "doi": ""
    },
    {
      "text": "ConsumerReports. 2020. Electric Vehicles and Fuel Economy: A Nationally Representative Multi-Mode Survey. Technical Report. Consumer Reports, New York, NY.",
      "doi": ""
    },
    {
      "text": "Electric Vehicle Council. 2021. EV Consumer Behavior. Technical Report. Fuels Institute, Alexandria, VA.",
      "doi": ""
    },
    {
      "text": "André Dahlinger, Felix Wortmann, Benjamin Ryder, and Bernhard Gahr. 2018. The Impact of Abstract vs. Concrete Feedback Design on Behavior Insights from a Large Eco-Driving Field Experiment. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3173574.3173953"
    },
    {
      "text": "DeDoose 2022. DeDoose. https://www.dedoose.com. Accessed April 27, 2022.",
      "doi": ""
    },
    {
      "text": "[17] Department of Energy.2022. https://www.energy.gov/eere/vehicles/articles/fotw-1221-january-17-2022-model-year-2021-all-electric-vehicles-had-median.",
      "doi": ""
    },
    {
      "text": "Monique Dittrich. 2021. Why Drivers Feel the Way they Do: An On-the-Road Study Using Self-Reports and Geo-Tagging. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 116–125.",
      "doi": "10.1145/3409118.3475130"
    },
    {
      "text": "EV-Volumes 2022. EV-Volumes–The Electric Vehicle World Sales Database. https://www.ev-volumes.com/. Accessed December 11, 2022.",
      "doi": ""
    },
    {
      "text": "EVmatch 2022. EVmatch. https://www.evmatch.com/. Accessed April 27, 2022.",
      "doi": ""
    },
    {
      "text": "Thomas Franke, Daniel Görges, and Matthias G Arend. 2019. The energy interface challenge. towards designing effective energy efficiency interfaces for electric vehicles. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 35–48.",
      "doi": "10.1145/3342197.3344526"
    },
    {
      "text": "Thomas Friedrichs, Shadan Sadeghian Borojeni, Wilko Heuten, Andreas Lüdtke, and Susanne Boll. 2016. PlatoonPal: User-Centered Development and Evaluation of an Assistance System for Heavy-Duty Truck Platooning. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 269–276.",
      "doi": "10.1145/3003715.3005449"
    },
    {
      "text": "David Gohlke, Yan Zhou, Xinyi Wu, and Calista Courtney. 2022. Assessment of light-duty plug-in electric vehicles in the United States, 2010–2021. Technical Report. Energy Systems and Infrastructure Analysis Division, Argonne National Laboratory.",
      "doi": ""
    },
    {
      "text": "Pia Grahn, Joakim Munkhammar, Joakim Widén, Karin Alvehag, and Lennart Söder. 2013. PHEV home-charging model based on residential activity patterns. IEEE Transactions on power Systems 28, 3 (2013), 2507–2515.",
      "doi": ""
    },
    {
      "text": "Karim Hamza, Kenneth P Laberteaux, and Kang-Ching Chu. 2021. On Modeling the Cost of Ownership of Plug-In Vehicles. World Electric Vehicle Journal 12, 1 (2021), 39.",
      "doi": ""
    },
    {
      "text": "Scott Hardman and Gil Tal. 2021. Understanding discontinuance among California’s electric vehicle owners. Nature Energy 6, 5 (2021), 538–545.",
      "doi": ""
    },
    {
      "text": "HERE 2022. HERE. https://developer.here.com/documentation/charging-stations/dev_guide/topics/overview.html. Accessed April 27, 2022.",
      "doi": ""
    },
    {
      "text": "Stephanie Houde and Charles Hill. 1997. What do prototypes prototype?In Handbook of human-computer interaction. Elsevier, 367–381.",
      "doi": ""
    },
    {
      "text": "Diana Ivanova, John Barrett, Dominik Wiedenhofer, Biljana Macura, Max Callaghan, and Felix Creutzig. 2020. Quantifying the potential for climate change mitigation of consumption options. Environmental Research Letters 15, 9 (2020), 093001.",
      "doi": ""
    },
    {
      "text": "Diana Ivanova, Konstantin Stadler, Kjartan Steen-Olsen, Richard Wood, Gibran Vita, Arnold Tukker, and Edgar G Hertwich. 2016. Environmental impact assessment of household consumption. Journal of Industrial Ecology 20, 3 (2016), 526–536.",
      "doi": ""
    },
    {
      "text": "Wei Ji and Gil Tal. 2020. Scenarios for transitioning cars from ICEV to BEVs and PHEVs using household level GPS travel data. Transportation Research Part D: Transport and Environment 88 (2020), 102555.",
      "doi": ""
    },
    {
      "text": "Wenjian Jia and T Donna Chen. 2021. Are Individuals’ stated preferences for electric vehicles (EVs) consistent with real-world EV ownership patterns?Transportation Research Part D: Transport and Environment 93 (2021), 102728.",
      "doi": ""
    },
    {
      "text": "Malte F Jung, David Sirkin, Turgut M Gür, and Martin Steinert. 2015. Displayed uncertainty improves driving experience and behavior: The case of range anxiety in an electric car. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2201–2210.",
      "doi": "10.1145/2702123.2702479"
    },
    {
      "text": "Anna Krajinska, Julia Poliscanova, Lucien Mathieu, and Ambel Carlos Calvo. 2020. Plug-in Hybrids: Is Europe heading for a new dieselgate?Technical Report. European Federation for Transport and Environment.",
      "doi": ""
    },
    {
      "text": "G Krishna. 2021. Understanding and identifying barriers to electric vehicle adoption through thematic analysis. Transportation Research Interdisciplinary Perspectives 10 (2021), 100364.",
      "doi": ""
    },
    {
      "text": "Alexander Kunze, Stephen J Summerskill, Russell Marshall, and Ashleigh J Filtness. 2019. Conveying uncertainties using peripheral awareness displays in the context of automated driving. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 329–341.",
      "doi": "10.1145/3342197.3344537"
    },
    {
      "text": "Kenneth S Kurani, Jonn Axsen, Nicolette Caperello, Jamie Davies, and Tai Stillwater. 2009. Learning from Consumers: Plug-In Hybrid Electric Vehicle (PHEV) Demonstration and Consumer Education, Outreach, and Market Research Program. Technical Report. Institute of Transportation Studies, UC Davis.",
      "doi": ""
    },
    {
      "text": "Kenneth P Laberteaux, Karim Hamza, and John Willard. 2019. Optimizing the electric range of plug-in vehicles via fuel economy simulations of real-world driving in California. Transportation Research Part D: Transport and Environment 73 (2019), 15–33.",
      "doi": ""
    },
    {
      "text": "Phillippa Lally, Cornelia HM Van Jaarsveld, Henry WW Potts, and Jane Wardle. 2010. How are habits formed: Modelling habit formation in the real world. European Journal of Social Psychology 40, 6 (2010), 998–1009.",
      "doi": ""
    },
    {
      "text": "Sabine Langlois. 2013. ADAS HMI using peripheral vision. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 74–81.",
      "doi": "10.1145/2516540.2516558"
    },
    {
      "text": "Dongwon Lee, Anandasivam Gopal, and Dokyun Lee. 2017. Micro-giving: On the use of mobile devices and monetary subsidies in charitable giving. Available at SSRN 3280553(2017).",
      "doi": ""
    },
    {
      "text": "Stephen Lee, Srinivasan Iyengar, David Irwin, and Prashant Shenoy. 2016. Shared solar-powered EV charging stations: Feasibility and benefits. In 2016 Seventh International Green and Sustainable Computing Conference (IGSC). 1–8.",
      "doi": ""
    },
    {
      "text": "Tyron Louw, Ruth Madigan, Yee Mun Lee, Cinzia De Marco, Jorge Lorente Mallada, and Natasha Merat. 2021. Don’t Worry, I’m in Control! Is Users’ Trust in Automated Driving Different When Using a Continuous Ambient Light HMI Compared to an Auditory HMI?. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 220–222.",
      "doi": "10.1145/3473682.3481875"
    },
    {
      "text": "Catherine MacPhail, Nomhle Khoza, Laurie Abler, and Meghna Ranganathan. 2016. Process guidelines for establishing Intercoder Reliability in qualitative studies. Qual. Res. 16, 2 (April 2016), 198–212.",
      "doi": ""
    },
    {
      "text": "Jennifer Mankoff, Anind K Dey, Gary Hsieh, Julie Kientz, Scott Lederer, and Morgan Ames. 2003. Heuristic evaluation of ambient displays. In Proceedings of the SIGCHI conference on Human factors in computing systems. 169–176.",
      "doi": "10.1145/642611.642642"
    },
    {
      "text": "Loren McDonald. 2022. US EV Sales Share Reaches 7% in Q2 2022. https://evadoption.com/us-ev-sales-share-reaches-7-in-q2-2022-new-data-now-available/. Accessed: 2022-12-11.",
      "doi": ""
    },
    {
      "text": "Mercedes-Benz. 2022. The EQ Ready App. https://www.mercedes-benz.com/en/innovation/eq-ready/. Accessed April 27, 2022.",
      "doi": ""
    },
    {
      "text": "Jeremie Metrailler and Marc Muller. 2022. Etude sur la consommation des véhicules hybrides rechargeables en topographie valaisanne. Technical Report. Impact Living.",
      "doi": ""
    },
    {
      "text": "Vikram Mohanty, Alexandre Filipowicz, Nayeli Bravo, Rumin Iliev, Scott Carter, and David A. Shamma. 2022. Pick Your CARbon: User Perceptions of Equivalencies for Carbon Emissions when Selecting Rideshares. In Adjunct Proceedings of the 14th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. Association for Computing Machinery, 48–52.",
      "doi": "10.1145/3544999.3552530"
    },
    {
      "text": "Michael J Muller. 2007. Participatory Design: The Third Space in HCI. CRC press.",
      "doi": ""
    },
    {
      "text": "Niantic, Inc.2022. Pokémon GO. https://pokemongolive.com/en/.",
      "doi": ""
    },
    {
      "text": "Michael Nicholas and Gil Tal. 2013. Dynamics of workplace charging for plug-in electric vehicles: How much is needed and at what speed?World Electric Vehicle Journal 6, 4 (2013), 819–828.",
      "doi": ""
    },
    {
      "text": "Michael A Nicholas, Gil Tal, and Thomas S Turrentine. 2017. Advanced plug-in electric vehicle travel and charging behavior interim report. Technical Report. Institute of Transportation Studies, UC Davis.",
      "doi": ""
    },
    {
      "text": "Benjamin Pichler and Andreas Riener. 2015. Evaluation of historical electric vehicle (EV) driving data to suggest improvements in driving efficiency. In Adjunct proceedings of the 7th international conference on automotive user interfaces and interactive vehicular applications. 130–135.",
      "doi": "10.1145/2809730.2809756"
    },
    {
      "text": "Patrick Plötz, Cornelius Moll, George Biecker, Peter Mock, and Yaoming Li. 2020. Real-world usage of plug-in hybrid electric vehicles: Fuel consumption, electric driving, and CO2 emissions. Technical Report. The International Council on Clean Transportation.",
      "doi": ""
    },
    {
      "text": "Patrick Plötz, Cornelius Moll, Georg Bieker, and Peter Mock. 2021. From lab-to-road: Real-world fuel consumption and CO2 emissions of plug-in hybrid electric vehicles. Environmental Research Letters 16, 5 (2021), 054078.",
      "doi": ""
    },
    {
      "text": "PlugShare 2022. PlugShare. https://developer.plugshare.com/docs/. Accessed April 27, 2022.",
      "doi": ""
    },
    {
      "text": "Benjamin Preston. 2020. EVs offer big savings over traditional gas-powered cars. Consumer Reports (2020).",
      "doi": ""
    },
    {
      "text": "Md Mamunur Rahman, Yuan Zhou, Jamie Rogers, Victoria Chen, Melanie Sattler, and Kate Hyun. 2021. A comparative assessment of CO2 emission between gasoline, electric, and hybrid vehicles: A Well-To-Wheel perspective using agent-based modeling. Journal of Cleaner Production 321 (2021), 128931.",
      "doi": ""
    },
    {
      "text": "Renault. 2022. Z.E. Explore App. https://m.apkpure.com/z-e-explore/com.renault.renaultze. Accessed April 27, 2022.",
      "doi": ""
    },
    {
      "text": "Marc Rettig. 1994. Prototyping for tiny fingers. Commun. ACM 37, 4 (1994), 21–27.",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "Tom Richards and Lyn Richards. 1995. Using hierarchical categories in qualitative data analysis. In Computer-aided qualitative data analysis: Theory, methods and practice, Udo And Katherine, Kelle (Ed.). Sage London, 80–95.",
      "doi": ""
    },
    {
      "text": "Michael Schrage. 1999. Serious play: How the world’s best companies simulate to innovate. Harvard Business Press.",
      "doi": ""
    },
    {
      "text": "Gondia Sokhna Seck, Emmanuel Hache, and Charlène Barnet. 2022. Potential bottleneck in the energy transition: The case of cobalt in an accelerating electro-mobility world. Resources Policy 75(2022), 102516.",
      "doi": ""
    },
    {
      "text": "Ehsan Shafiei, Roland Dauphin, and Marta Yugo. 2022. Optimal electrification level of passenger cars in Europe in a battery-constrained future. Transportation Research Part D: Transport and Environment 102 (2022), 103132.",
      "doi": ""
    },
    {
      "text": "David A. Shamma, Matthew L. Lee, Alexandre L. S. Filipowicz, Laurent Denoue, Kate Glazko, Kalani Murakami, and Kent Lyons. 2022. EV Life: A Counterfactual Dashboard Towards Reducing Carbon Emissions of Automotive Behaviors. In 27th International Conference on Intelligent User Interfaces. 46–49.",
      "doi": ""
    },
    {
      "text": "John Smart, Thomas Bradley, and Shawn Salisbury. 2014. Actual versus estimated utility factor of a large set of privately owned Chevrolet Volts. SAE International Journal of Alternative Powertrains 3, 1(2014), 30–35.",
      "doi": ""
    },
    {
      "text": "SmartCar API 2022. SmartCar API. https://www.smartcar.com. Accessed April 27, 2022.",
      "doi": ""
    },
    {
      "text": "Carolyn Snyder. 2003. Paper prototyping: The fast and easy way to design and refine user interfaces. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Timothy Sohn, Kevin A Li, Gunny Lee, Ian Smith, James Scott, and William G Griswold. 2005. Place-its: A study of location-based reminders on mobile phones. In International Conference on Ubiquitous Computing. Springer, 232–250.",
      "doi": "10.1007/11551201_14"
    },
    {
      "text": "Jamie Speirs, Marcello Contestabile, Yassine Houari, and Robert Gross. 2014. The future of lithium availability for electric vehicle batteries. Renewable and Sustainable Energy Reviews 35 (2014), 183–193.",
      "doi": ""
    },
    {
      "text": "[72] Strava.2022. https://www.strava.com/.",
      "doi": ""
    },
    {
      "text": "Claire Sugihara, Katrina Sutton, Adam Davis, Vaishnavi Karanam, and Gil Tal. 2021. From sport to eco: A case study of driver inputs on electric vehicle efficiency. Transp. Res. Part F Traffic Psychol. Behav. 82 (Oct. 2021), 412–428.",
      "doi": ""
    },
    {
      "text": "Carlito Baltazar Tabelin, Jessica Dallas, Sophia Casanova, Timothy Pelech, Ghislain Bournival, Serkan Saydam, and Ismet Canbulat. 2021. Towards a low-carbon society: A review of lithium resource availability, challenges and innovations in mining, extraction and recycling, and future perspectives. Minerals Engineering 163(2021), 106743.",
      "doi": ""
    },
    {
      "text": "Gil Tal, Vaishnavi Chaitanya Karanam, Matthew P Favetti, Katrina May Sutton, Jade Motayo Ogunmayin, Seshadri Srinivasa Raghavan, Christopher Nitta, Debapriya Chakraborty, Adam Davis, and Dahlia Garas. 2021. Emerging Technology Zero Emission Vehicle Household Travel and Refueling Behavior. Technical Report. UC Davis: Plug-In Hybrid & Electric Vehicle Research Center.",
      "doi": ""
    },
    {
      "text": "Gil Tal, Michael A Nicholas, Jamie Davies, and Justin Woodjack. 2014. Charging behavior impacts on electric vehicle miles traveled: who is not plugging in?Transportation Research Record 2454, 1 (2014), 53–60.",
      "doi": ""
    },
    {
      "text": "Gil Tal, Seshadri Srinivasa Raghavan, Vaishnavi Chaitanya Karanam, Matthew P Favetti, Katrina May Sutton, J H Lee, C Nitta, D Chakraborty, M Nicholas, and T Turrentine. 2020. Advanced plug-in electric vehicle travel and charging behavior final report. Technical Report. UC Davis Institute of Transportation Studies. 12–319 pages.",
      "doi": ""
    },
    {
      "text": "Bas Verplanken and Sheina Orbell. 2003. Reflections on past behavior: a self-report index of habit strength 1. Journal of applied social psychology 33, 6 (2003), 1313–1330.",
      "doi": ""
    },
    {
      "text": "VoltStats 2022. VoltStats. https://www.voltstats.net/. Accessed April 27, 2022.",
      "doi": ""
    },
    {
      "text": "Steffen P Walz and Sebastian Deterding. 2014. Gamifying Green: Gamification and Environmental Sustainability. In The Gameful World: Approaches, Issues, Applications. MIT Press, 563–596.",
      "doi": ""
    },
    {
      "text": "Peter C Wright and Andrew F Monk. 1991. The use of think-aloud evaluation methods in design. ACM SIGCHI Bulletin 23, 1 (1991), 55–57.",
      "doi": "10.1145/122672.122685"
    },
    {
      "text": "Xing Wu, Md Aviquzzaman, and Zhenhong Lin. 2015. Analysis of plug-in hybrid electric vehicles’ utility factors using GPS-based longitudinal travel data. Transportation Research Part C: Emerging Technologies 57 (2015), 1–12.",
      "doi": ""
    }
  ]
}