{
  "doi": "10.1145/3544548.3580985",
  "title": "The Influence of Human Factors on the Intention to Report Phishing Emails",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Phishing attacks are a main threat to organizations and individuals. Current widespread defenses based on spam filters and domain blacklisting are unfortunately insufficient. Prior work identifies phishing reporting as a key, largely untapped resource to mitigate phishing threats. Yet, its practice suffers from very low reporting rates and generally too low an uptake from users. Whereas it is known that phishing reporting behavior is affected by a number of ‘human factors’, a comprehensive view of the different theories and their effects on (intent to) report is not yet developed. To address this gap, we evaluate theories and factors analyzed in the extant literature, build a cohesive theoretical view of their effects and constructs, and develop, model, and empirically evaluate (by means of an online questionnaire, n=284) the resulting hypothesis structure. We discuss both theoretical implications of our findings and research directions for practice at a research and organizational level.",
  "authors": [
    {
      "name": "Ioana Andreea Marin",
      "institution": "Mathematics and Computer Science, Technical University Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782888",
      "orcid": "0000-0002-6464-5209"
    },
    {
      "name": "Pavlo Burda",
      "institution": "Mathematics and Computer Science, Technical University Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659458113",
      "orcid": "0000-0003-4554-5410"
    },
    {
      "name": "Nicola Zannone",
      "institution": "Mathematics and Computer Science, Technical University Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319504902",
      "orcid": "0000-0002-9081-5996"
    },
    {
      "name": "Luca Allodi",
      "institution": "Mathematics and Computer Science, Technical University Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488668051",
      "orcid": "0000-0003-1600-0868"
    }
  ],
  "references": [
    {
      "text": "Icek Ajzen. 1991. The theory of planned behavior. Organizational Behavior and Human Decision Processes 50, 2 (1991), 179–211.",
      "doi": ""
    },
    {
      "text": "Luca Allodi, Tzouliano Chotza, Ekaterina Panina, and Nicola Zannone. 2020. The Need for New Antiphishing Measures Against Spear-Phishing Attacks. IEEE Security Privacy 18, 2 (2020), 23–34.",
      "doi": ""
    },
    {
      "text": "Kholoud Althobaiti, Adam D G Jenkins, and Kami Vaniea. 2021. A Case Study of Phishing Incident Response in an Educational Organization. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2, Article 338 (2021), 32 pages.",
      "doi": ""
    },
    {
      "text": "Teresa Amabile, Elizabeth Schatzel, Giovanni Moneta, and Steven Kramer. 2004. Leader Behaviors and the Work Environment for Creativity: Perceived Leader Support. The Leadership Quarterly 17 (2004), 5–32.",
      "doi": ""
    },
    {
      "text": "Amazon. 2022. Amazon Mechanical Turk. Retrieved September 12, 2022 from https://www.mturk.com/",
      "doi": ""
    },
    {
      "text": "Gaurav Bansal. 2018. Got Phished! Role of Top Management Support in Creating Phishing Safe Organizations. MWAIS 2018 Proceedings(2018).",
      "doi": ""
    },
    {
      "text": "Murray R. Barrick and Michael K. Mount. 1991. The Big Five Personality Dimensions and Job Performance A Meta-Analysis. Personnel Psychology 44, 1 (1991), 1–26.",
      "doi": ""
    },
    {
      "text": "Pavlo Burda, Luca Allodi, and Nicola Zannone. 2020. Don’t Forget the Human: a Crowdsourced Approach to Automate Response and Containment Against Spear Phishing Attacks. In European Symposium on Security and Privacy Workshops (EuroS&PW). IEEE, 471–476.",
      "doi": ""
    },
    {
      "text": "Marcus Butavicius, Kathryn Parsons, Malcolm Pattinson, and Agata McCormac. 2015. Breaching the Human Firewall: Social engineering in Phishing and Spear-Phishing Emails. ACIS 2015 Proceedings 98(2015), 11.",
      "doi": ""
    },
    {
      "text": "Robert Colosi. 2005. Negatively Worded Questions Cause Respondent Confusion. Proceedings of the Survey Research Methods Section (2005), 2896–2903.",
      "doi": ""
    },
    {
      "text": "Rachel Christine Dreibelbis. 2016. It’s More Than Just Changing Your Password: Exploring the Nature and Antecedents of Cyber-Security Behaviors. USF Tampa Graduate Theses and Dissertations(2016).",
      "doi": ""
    },
    {
      "text": "FBI Internet Crime Complaint Centre. 2020. Internet Crime Report 2020.",
      "doi": ""
    },
    {
      "text": "R. A. Fisher. 1992. Statistical Methods for Research Workers. In Breakthroughs in Statistics: Methodology and Distribution. Springer, New York, NY, 66–70.",
      "doi": ""
    },
    {
      "text": "A.V. Gershman, J.F. McCarthy, and A.E. Fano. 1999. Situated computing: bridging the gap between intention and action. In International Symposium on Wearable Computers. IEEE, 3–9.",
      "doi": ""
    },
    {
      "text": "Lewis R. Goldberg. 1999. A broad-bandwidth, public-domain, personality inventory measuring the lower-level facets of several five-factor models. Personality Psychology in Europe 7 (1999), 7––28.",
      "doi": ""
    },
    {
      "text": "Ken H. Guo. 2013. Security-related behavior in using information systems in the workplace: A review and synthesis. Computers & Security 32(2013), 242–251.",
      "doi": "10.1016/j.cose.2012.10.003"
    },
    {
      "text": "Kim Jong Hae. 2019. Multicollinearity and misleading statistical results. Korean J Anesthesiol 72, 6 (2019), 558–569.",
      "doi": ""
    },
    {
      "text": "Tzipora Halevi, Nasir Memon, James Lewis, Ponnurangam Kumaraguru, Sumit Arora, Nikita Dagar, Fadi Aloul, and Jay Chen. 2016. Cultural and Psychological Factors in Cyber-Security. In International Conference on Information Integration and Web-based Applications & Services. ACM, New York, NY, USA, 43–56.",
      "doi": ""
    },
    {
      "text": "Tzipora Halevi, Nasir Memon, and Oded Nov. 2015. Spear-Phishing in the Wild: A Real-World Study of Personality, Phishing Self-Efficacy and Vulnerability to Spear-Phishing Attacks. SSRN Scholarly Paper. Social Science Research Network. https://doi.org/10.2139/ssrn.2544742",
      "doi": ""
    },
    {
      "text": "Graeme D Hutcheson. 2011. Ordinary least-squares regression. In The SAGE dictionary of quantitative management research. SAGE Knowledge, 224–228.",
      "doi": ""
    },
    {
      "text": "IBM Corp.[n. d.]. IBM SPSS Statistics for Windows.",
      "doi": ""
    },
    {
      "text": "Nadim Jahangir, Mohammad Muzahid Akbar, and Mahmudul Haq. 2004. Organisational Citizenship Behavior: Its Nature and Antecedents. BRAC University Journal 1, 2 (2004), 75–85.",
      "doi": ""
    },
    {
      "text": "Mohammad S. Jalali, Maike Bruckes, Daniel Westmattelmann, and Gerhard Schewe. 2020. Why Employees (Still) Click on Phishing Links: Investigation in Hospitals. Journal of Medical Internet Research 22, 1 (2020), e16775.",
      "doi": ""
    },
    {
      "text": "Matthew L. Jensen, Ryan T. Wright, Alexandra Durcikova, and Shamya Karumbaiah. 2022. Improving Phishing Reporting Using Security Gamification. Journal of Management Information Systems 39, 3 (2022), 793–823.",
      "doi": ""
    },
    {
      "text": "Leon Kersten, Pavlo Burda, Luca Allodi, and Nicola Zannone. 2022. Investigating the Effect of Phishing Believability on Phishing Reporting. In European Symposium on Security and Privacy Workshops (EuroS&PW). IEEE, 117–128.",
      "doi": ""
    },
    {
      "text": "Sabina Kleitman, Marvin K. H. Law, and Judy Kay. 2018. It’s the deceiver and the receiver: Individual differences in phishing susceptibility and false positives with item profiling. PLOS ONE 13, 10 (2018), 1–29.",
      "doi": ""
    },
    {
      "text": "P. Kline. 1993. The Handbook of Psychological Testing (2nd ed.). Routledge. 66–70 pages.",
      "doi": ""
    },
    {
      "text": "Igor Knez, Daniel Hjärpe, and Mari Bryngelsson. 2019. Predicting Organizational Citizenship Behavior: The Role of Work-Related Self. SAGE Open 9(2019), 215824401985483.",
      "doi": ""
    },
    {
      "text": "Jon A. Krosnick and Stanley Presser. 2010. Question and questionnaire design. In Handbook of survey research. Emerald, 263–314.",
      "doi": ""
    },
    {
      "text": "Youngsun Kwak, Seyoung Lee, Amanda Damiano, and Arun Vishwanath. 2020. Why Do Users Not Report Spear Phishing Emails?Telematics and Informatics 48 (2020), 101343.",
      "doi": ""
    },
    {
      "text": "Daniele Lain, Kari Kostiainen, and Srdjan Čapkun. 2022. Phishing in Organizations: Findings from a Large-Scale and Long-Term Study. In Symposium on Security and Privacy. IEEE, 842–859.",
      "doi": ""
    },
    {
      "text": "Yphtach Lelkes and Rebecca Weiss. 2015. Much ado about acquiescence: The relative validity and reliability of construct-specific and agree–disagree questions. Research & Politics 2, 3 (2015).",
      "doi": ""
    },
    {
      "text": "Jeffrey LePine, Amir Erez, and Diane Johnson. 2002. The Nature and Dimensionality of Organizational Citizenship Behavior: A Critical Review and Meta-Analysis. The Journal of applied psychology 87 (2002), 52–65.",
      "doi": ""
    },
    {
      "text": "Jeovany Martínez-Mesa, David González-Chica, João Bastos, Renan Bonamigo, and Rodrigo Duquia. 2014. Sample size: how many participants do I need in my research?Anais brasileiros de dermatologia 89 (2014), 609–615.",
      "doi": ""
    },
    {
      "text": "Peter Mayer, Alexandra Kunz, and Melanie Volkamer. 2017. Reliable Behavioural Factors in the Information Security Context. In International Conference on Availability, Reliability and Security. ACM, New York, NY, USA, Article 9, 10 pages.",
      "doi": ""
    },
    {
      "text": "Robert R. McCrae and Paul T. Costa. 1987. Validation of the Five-Factor Model of Personality Across Instruments and Observers. Journal of Personality and Social Psychology 52, 1(1987), 81–90.",
      "doi": ""
    },
    {
      "text": "Rosana Montañez, Edward Golob, and Shouhuai Xu. 2020. Human Cognition Through the Lens of Social Engineering Cyberattacks. Frontiers in Psychology 11 (2020).",
      "doi": ""
    },
    {
      "text": "Tjai M. Nielsen, Daniel G. Bachrach, Eric Sundstrom, and Terry R. Halfhill. 2012. Utility of OCB: Organizational Citizenship Behavior and Group Performance in a Resource Allocation Framework. Journal of Management 38, 2 (2012), 668–694.",
      "doi": ""
    },
    {
      "text": "W. T. Norman. 1963. Toward an adequate taxonomy of personality attributes: replicated factors structure in peer nomination personality ratings. Journal of abnormal and social psychology 66 (1963), 574–583.",
      "doi": ""
    },
    {
      "text": "Dennis Organ. 1997. Organizational Citizenship Behavior: It’s Construct Clean-Up Time. Human Performance 10(1997), 85–97.",
      "doi": ""
    },
    {
      "text": "Dennis W Organ. 1988. Organizational citizenship behavior: The good soldier syndrome.Lexington Books/DC Heath and Com.",
      "doi": ""
    },
    {
      "text": "Kathryn Parsons, Agata McCormac, Malcolm Pattinson, Marcus Butavicius, and Cate Jerram. 2013. Phishing for the Truth: A Scenario-Based Experiment of Users’ Behavioural Response to Emails. In Security and Privacy Protection in Information Processing Systems(IFIP Advances in Information and Communication Technology). Springer, 366–378.",
      "doi": ""
    },
    {
      "text": "Malcolm Pattinson, Cate Jerram, Kathryn Parsons, Agata McCormac, and Marcus Butavicius. 2012. Why do some people manage phishing e-mails better than others?Information Management & Computer Security 20, 1 (2012), 18–28.",
      "doi": ""
    },
    {
      "text": "Philip M. Podsakoff, Scott B. MacKenzie, Robert H. Moorman, and Richard Fetter. 1990. Transformational leader behaviors and their effects on followers’ trust in leader, satisfaction, and organizational citizenship behaviors. The Leadership Quarterly 1, 2 (1990), 107–142.",
      "doi": ""
    },
    {
      "text": "Samuel Pond III, Rupert Nacoste, Monique Mohr, and Christopher Rodriguez. 2006. The Measurement of Organizational Citizenship Behavior: Are We Assuming Too Much?Journal of Applied Social Psychology 27 (2006), 1527–1544.",
      "doi": ""
    },
    {
      "text": "Clay Posey, Tom L. Roberts, and Paul Benjamin Lowry. 2015. The Impact of Organizational Commitment on Insiders’ Motivation to Protect Organizational Information Assets. Journal of Management Information Systems 32, 4 (2015), 179–214.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Yasemin Gülsüm Acar, Sascha Fahl, and Michelle L. Mazurek. 2017. A Summary of Survey Methodology Best Practices for Security and Privacy Researchers. Technical Reports of the Computer Science DepartmentCS-TR-5055. University of Maryland.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2019. How Well Do My Results Generalize? Comparing Security and Privacy Survey Results from MTurk, Web, and Telephone Samples. In Symposium on Security and Privacy. IEEE, 1326–1343.",
      "doi": ""
    },
    {
      "text": "Sandra L. Robinson. 1996. Trust and Breach of the Psychological Contract. Administrative Science Quarterly 41 (1996), 574–599.",
      "doi": ""
    },
    {
      "text": "Ronald W. Rogers. 1975. A Protection Motivation Theory of Fear Appeals and Attitude Change1. The Journal of Psychology 91, 1 (1975), 93–114.",
      "doi": ""
    },
    {
      "text": "Noor Romaiha, Fatin Maulud, Wan Musyirah, Arnida Jahya, Nurul Fahana, and Aini Harun. 2019. The Determinants of Organizational Citizenship Behaviour (OCB). International Journal of Academic Research in Business and Social Sciences 9 (2019), 124––133.",
      "doi": ""
    },
    {
      "text": "Edgar Schein. 2010. Organizational Culture and Leadership. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Hamidreza Shahbaznezhad, Farzan Kolini, and Mona Rashidirad. 2020. Employees Behavior in Phishing Attacks What Individual Organizational and Technological Factors Matter. Journal of Computer Information Systems 61, 6 (2020), 539–550.",
      "doi": ""
    },
    {
      "text": "Steve Sheng, Mandy Lanyon, Ponnurangam Kumaraguru, Lorrie Cranor, and Julie Downs. 2010. Who falls for phish? A demographic analysis of phishing susceptibility and effectiveness of interventions. In SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 373–382.",
      "doi": "10.1145/1753326.1753383"
    },
    {
      "text": "Mikko Siponen, M. Adam Mahmood, and Seppo Pahnila. 2014. Employees’ adherence to information security policies: An exploratory field study. Information & Management 51, 2 (2014), 217–224.",
      "doi": "10.1016/j.im.2013.08.006"
    },
    {
      "text": "Barbara Sypniewska. 2020. Counterproductive Work Behavior and Organizational Citizenship Behavior. Advances in Cognitive Psychology 16 (2020), 321–328.",
      "doi": ""
    },
    {
      "text": "Jenny Tang, Eleanor Birrell, and Ada Lerner. 2022. Replication: How Well Do My Results Generalize Now? The External Validity of Online Privacy and Security Surveys. In Symposium on Usable Privacy and Security (SOUPS 2022). USENIX Association, Boston, MA, 367–385.",
      "doi": ""
    },
    {
      "text": "US Department of Labor. 2022. Minimum wage.",
      "doi": ""
    },
    {
      "text": "Wade M. Vagias. 2006. Likert-Type Scale Response Anchors. Technical Report. Clemson University.",
      "doi": ""
    },
    {
      "text": "Verizon. 2021. 2021 Data Breach Investigations Report.",
      "doi": ""
    },
    {
      "text": "Verizon. 2022. 2022 Data Breach Investigations Report.",
      "doi": ""
    },
    {
      "text": "Bas Verplanken, Henk Aarts, Ad van Knippenberg, and Anja Moonen. 1998. Habit versus planned behaviour: A field experiment. British Journal of Social Psychology 37, 1 (1998), 111–128.",
      "doi": ""
    },
    {
      "text": "Arun Vishwanath. 2015. Examining the Distinct Antecedents of E-Mail Habits and its Influence on the Outcomes of a Phishing Attack. Journal of Computer-Mediated Communication 20, 5 (2015), 570–584.",
      "doi": "10.1111/jcc4.12126"
    },
    {
      "text": "Arun Vishwanath, Tejaswini Herath, Rui Chen, Jingguo Wang, and H. Raghav Rao. 2011. Why do people get phished? Testing individual differences in phishing vulnerability within an integrated, information processing model. Decision Support Systems 51, 3 (2011), 576–586.",
      "doi": "10.1016/j.dss.2011.03.002"
    },
    {
      "text": "Larry J. Williams and Stella E. Anderson. 1991. Job Satisfaction and Organizational Commitment as Predictors of Organizational Citizenship and In-Role Behaviors. Journal of Management 17, 3 (1991), 601–617.",
      "doi": ""
    },
    {
      "text": "Ryan Wright and Kent Marett. 2010. The Influence of Experiential and Dispositional Factors in Phishing: An Empirical Investigation of the Deceived. Journal of Management Information Systems 27 (2010), 273–303.",
      "doi": "10.2753/MIS0742-1222270111"
    }
  ]
}