{
  "doi": "10.1145/3544548.3580672",
  "title": "Don’t Just Tell Me, Ask Me: AI Systems that Intelligently Frame Explanations as Questions Improve Human Logical Discernment Accuracy over Causal AI explanations",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Critical thinking is an essential human skill. Despite the importance of critical thinking, research reveals that our reasoning ability suffers from personal biases and cognitive resource limitations, leading to potentially dangerous outcomes. This paper presents the novel idea of AI-framed Questioning that turns information relevant to the AI classification into questions to actively engage users’ thinking and scaffold their reasoning process. We conducted a study with 204 participants comparing the effects of AI-framed Questioning on a critical thinking task; discernment of logical validity of socially divisive statements. Our results show that compared to no feedback and even causal AI explanations of an always correct system, AI-framed Questioning significantly increase human discernment of logically flawed statements. Our experiment exemplifies a future style of Human-AI co-reasoning system, where the AI becomes a critical thinking stimulator rather than an information teller.",
  "tags": [
    "AI Explanation",
    "Explainable AI",
    "Human-AI Interaction",
    "Language Model",
    "Logic",
    "Reasoning",
    "AI"
  ],
  "authors": [
    {
      "name": "Valdemar Danry",
      "institution": "MIT Media Lab, Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659538820",
      "orcid": "0000-0001-5225-0077"
    },
    {
      "name": "Pat Pataranutaporn",
      "institution": "MIT Media Lab, Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659198696",
      "orcid": "0000-0002-1879-7340"
    },
    {
      "name": "Yaoli Mao",
      "institution": "Human Development, Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659487073",
      "orcid": "0000-0002-2059-3734"
    },
    {
      "name": "Pattie Maes",
      "institution": "MIT Media Lab, Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319638",
      "orcid": "0000-0002-7722-6038"
    }
  ],
  "references": [
    {
      "text": "Tariq Alhindi, Savvas Petridis, and Smaranda Muresan. 2018. Where is your Evidence: Improving Fact-checking by Justification Modeling. In Proceedings of the First Workshop on Fact Extraction and VERification (FEVER). 85–90.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Tongshuang Wu, Joyce Zhou, Raymond Fok, Besmira Nushi, Ece Kamar, Marco Tulio Ribeiro, and Daniel Weld. 2021. Does the whole exceed its parts? the effect of ai explanations on complementary team performance. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445717"
    },
    {
      "text": "John A Bargh. 1994. The four horsemen of automaticity: Intention, awareness, efficiency, and control as separate issues. (1994).",
      "doi": ""
    },
    {
      "text": "Oscar Barrera, Sergei Guriev, Emeric Henry, and Ekaterina Zhuravskaya. 2020. Facts, alternative facts, and fact checking in times of post-truth politics. Journal of public economics 182 (2020), 104123.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, 2020. Language models are few-shot learners. Advances in neural information processing systems 33 (2020), 1877–1901.",
      "doi": ""
    },
    {
      "text": "Zana Buçinca, Maja Barbara Malaya, and Krzysztof Z Gajos. 2021. To trust or to think: cognitive forcing functions can reduce overreliance on AI in AI-assisted decision-making. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–21.",
      "doi": "10.1145/3449287"
    },
    {
      "text": "Michelene TH Chi, Nicholas De Leeuw, Mei-Hung Chiu, and Christian LaVancher. 1994. Eliciting self-explanations improves understanding. Cognitive science 18, 3 (1994), 439–477.",
      "doi": ""
    },
    {
      "text": "Roberto Confalonieri, Tarek R Besold, Tillman Weyde, Kathleen Creel, Tania Lombrozo, Shane Mueller, and Patrick Shafto. 2019. What makes a good explanation? Cognitive dimensions of explaining intelligent machines. CogSci 2019: Creativity+ Cognition+ Computation (2019).",
      "doi": ""
    },
    {
      "text": "John W Creswell and J David Creswell. 2017. Research design: Qualitative, quantitative, and mixed methods approaches. Sage publications.",
      "doi": ""
    },
    {
      "text": "Valdemar Danry, Pat Pataranutaporn, Yaoli Mao, and Pattie Maes. 2020. Wearable Reasoner: towards enhanced human rationality through a wearable device with an explainable AI assistant. In Proceedings of the Augmented Humans International Conference. 1–12.",
      "doi": "10.1145/3384657.3384799"
    },
    {
      "text": "Ziv Epstein, Nicolo Foppiani, Sophie Hilgard, Sanjana Sharma, Elena Glassman, and David Rand. 2022. Do explanations increase the effectiveness of AI-crowd generated fake news warnings?. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 16. 183–193.",
      "doi": ""
    },
    {
      "text": "Shane Frederick. 2005. Cognitive reflection and decision making. Journal of Economic perspectives 19, 4 (2005), 25–42.",
      "doi": ""
    },
    {
      "text": "Artur d’Avila Garcez and Luis C Lamb. 2020. Neurosymbolic AI: The 3rd Wave. arXiv preprint arXiv:2012.05876(2020).",
      "doi": ""
    },
    {
      "text": "Gerd Gigerenzer and Reinhard Selten. 2002. Bounded rationality: The adaptive toolbox. MIT press.",
      "doi": ""
    },
    {
      "text": "Edward M Glaser. 1985. Educating for responsible citizenship in a democracy. In National Forum, Vol. 65. Honor Society of Phi Kappa Phi, 24.",
      "doi": ""
    },
    {
      "text": "Matthew Groh, Ziv Epstein, Chaz Firestone, and Rosalind Picard. 2022. Deepfake detection by human crowds, machines, and machine-informed crowds. Proceedings of the National Academy of Sciences 119, 1 (2022), e2110013119.",
      "doi": ""
    },
    {
      "text": "Matthew Groh, Aruna Sankaranarayanan, and Rosalind Picard. 2022. Human detection of political deepfakes across transcripts, audio, and video. arXiv preprint arXiv:2202.12883(2022).",
      "doi": ""
    },
    {
      "text": "Ivan Habernal, Raffael Hannemann, Christian Pollak, Christopher Klamm, Patrick Pauli, and Iryna Gurevych. 2017. Argotario: Computational argumentation meets serious games. arXiv preprint arXiv:1707.06002(2017).",
      "doi": ""
    },
    {
      "text": "Jonathan Haidt. 2001. The emotional dog and its rational tail: a social intuitionist approach to moral judgment.Psychological review 108, 4 (2001), 814.",
      "doi": ""
    },
    {
      "text": "Steven R Haynes, Mark A Cohen, and Frank E Ritter. 2009. Designs for explaining intelligent agents. International Journal of Human-Computer Studies 67, 1 (2009), 90–110.",
      "doi": "10.1016/j.ijhcs.2008.09.008"
    },
    {
      "text": "Jonathan Howard. 2019. Hasty Generalization, Survival Bias, Special Pleading, and Burden of Proof. In Cognitive Errors and Diagnostic Mistakes. Springer, 211–246.",
      "doi": ""
    },
    {
      "text": "Eyke Hüllermeier. 2020. Towards analogy-based explanations in machine learning. In International Conference on Modeling Decisions for Artificial Intelligence. Springer, 205–217.",
      "doi": "10.1007/978-3-030-57524-3_17"
    },
    {
      "text": "Daniel Kahneman. 2011. Thinking, fast and slow. Macmillan.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman, Stewart Paul Slovic, Paul Slovic, and Amos Tversky. 1982. Judgment under uncertainty: Heuristics and biases. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Mark T Keane and Barry Smyth. 2020. Good counterfactuals and where to find them: A case-based technique for generating counterfactuals for explainable ai (xai). In International Conference on Case-Based Reasoning. Springer, 163–178.",
      "doi": "10.1007/978-3-030-58342-2_11"
    },
    {
      "text": "Emily R Lai. 2011. Critical thinking: A literature review. Pearson’s Research Reports 6, 1 (2011), 40–41.",
      "doi": ""
    },
    {
      "text": "Vivian Lai and Chenhao Tan. 2019. On human predictions with explanations and predictions of machine learning models: A case study on deception detection. In Proceedings of the conference on fairness, accountability, and transparency. 29–38.",
      "doi": "10.1145/3287560.3287590"
    },
    {
      "text": "Himabindu Lakkaraju and Osbert Bastani. 2020. \" How do I fool you?\" Manipulating User Trust via Misleading Black Box Explanations. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society. 79–85.",
      "doi": "10.1145/3375627.3375833"
    },
    {
      "text": "David MJ Lazer, Matthew A Baum, Yochai Benkler, Adam J Berinsky, Kelly M Greenhill, Filippo Menczer, Miriam J Metzger, Brendan Nyhan, Gordon Pennycook, David Rothschild, Michael Schudson, Steven A. Sloman, Cass R. Sunstein, Emily A. Thorson, Duncan J. Watts, and Jonathan L. Zittrain. 2018. The science of fake news. Science 359, 6380 (2018), 1094–1096.",
      "doi": ""
    },
    {
      "text": "Nguyen-Thinh Le and Laura Wartschinski. 2018. A cognitive assistant for improving human reasoning skills. International Journal of Human-Computer Studies 117 (2018), 45–54.",
      "doi": ""
    },
    {
      "text": "Jennifer S Lerner and Philip E Tetlock. 1999. Accounting for the effects of accountability.Psychological bulletin 125, 2 (1999), 255.",
      "doi": ""
    },
    {
      "text": "Q Vera Liao, Daniel Gruen, and Sarah Miller. 2020. Questioning the AI: informing design practices for explainable AI user experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376590"
    },
    {
      "text": "Matthew D Lieberman. 2000. Intuition: a social cognitive neuroscience approach.Psychological bulletin 126, 1 (2000), 109.",
      "doi": ""
    },
    {
      "text": "Matthew D Lieberman, Ruth Gaunt, Daniel T Gilbert, and Yaacov Trope. 2002. Reflexion and reflection: a social cognitive neuroscience approach to attributional inference.(2002).",
      "doi": ""
    },
    {
      "text": "Tania Lombrozo. 2016. Explanatory preferences shape learning and inference. Trends in Cognitive Sciences 20, 10 (2016), 748–759.",
      "doi": ""
    },
    {
      "text": "Zilin Ma and Krzysztof Z Gajos. 2022. Not Just a Preference: Reducing Biased Decision-making on Dating Websites. In CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3491102.3517587"
    },
    {
      "text": "Prashan Madumal, Tim Miller, Frank Vetere, and Liz Sonenberg. 2018. Towards a grounded dialog model for explainable artificial intelligence. arXiv preprint arXiv:1806.08055(2018).",
      "doi": ""
    },
    {
      "text": "Scott E Maxwell, Harold D Delaney, and Ken Kelley. 2017. Designing experiments and analyzing data: A model comparison perspective. Routledge.",
      "doi": ""
    },
    {
      "text": "Roger C Mayer, James H Davis, and F David Schoorman. 1995. An integrative model of organizational trust. Academy of management review 20, 3 (1995), 709–734.",
      "doi": ""
    },
    {
      "text": "Mark McCaffrey, Paige Hayes, Jason Wagner, and Matt Hobbs. 2018. Consumer Intelligence Series: Prepare for the voice revolution. pwc. com (2018).",
      "doi": ""
    },
    {
      "text": "Divyam Mehta, Aniket Dwivedi, Arunabha Patra, and M Anand Kumar. 2021. A transformer-based architecture for fake news classification. Social network analysis and mining 11, 1 (2021), 1–12.",
      "doi": ""
    },
    {
      "text": "Shane T Mueller, Robert R Hoffman, William Clancey, Abigail Emrey, and Gary Klein. 2019. Explanation in human-AI systems: A literature meta-review, synopsis of key ideas and publications, and bibliography for explainable AI. arXiv preprint arXiv:1902.01876(2019).",
      "doi": ""
    },
    {
      "text": "R Paul and L Elder. 2006. The art of socratic questioning. Dillon beach, CA: foundation for critical thinking. Psychology, Monograph Series II 3 (2006), 107–127.",
      "doi": ""
    },
    {
      "text": "Richard Paul and Linda Elder. 2007. Critical thinking: The art of Socratic questioning. Journal of developmental education 31, 1 (2007), 36.",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook, Ziv Epstein, Mohsen Mosleh, Antonio A Arechar, Dean Eckles, and David G Rand. 2021. Shifting attention to accuracy can reduce misinformation online. Nature 592, 7855 (2021), 590–595.",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook and David G Rand. 2019. Lazy, not biased: Susceptibility to partisan fake news is better explained by lack of reasoning than by motivated reasoning. Cognition 188(2019), 39–50.",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook and David G Rand. 2020. Who falls for fake news? The roles of bullshit receptivity, overclaiming, familiarity, and analytic thinking. Journal of personality 88, 2 (2020), 185–200.",
      "doi": ""
    },
    {
      "text": "Ruty Rinott, Lena Dankin, Carlos Alzate Perez, Mitesh M. Khapra, Ehud Aharoni, and Noam Slonim. 2015. Show Me Your Evidence - an Automatic Method for Context Dependent Evidence Detection. In Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, Lisbon, Portugal, 440–450. https://doi.org/10.18653/v1/D15-1050",
      "doi": ""
    },
    {
      "text": "Herbert A Simon. 1956. Rational choice and the structure of the environment.Psychological review 63, 2 (1956), 129.",
      "doi": ""
    },
    {
      "text": "Herbert Alexander Simon. 1997. Models of bounded rationality: Empirically grounded economic reason. Vol. 3. MIT press.",
      "doi": ""
    },
    {
      "text": "Dominik Stammbach and Elliott Ash. 2020. e-fever: Explanations and summaries for automated fact checking. Proceedings of the 2020 Truth and Trust Online (TTO 2020) (2020), 32–43.",
      "doi": ""
    },
    {
      "text": "Keith E Stanovich and Richard F West. 2008. On the failure of cognitive ability to predict myside and one-sided thinking biases. Thinking & Reasoning 14, 2 (2008), 129–167.",
      "doi": ""
    },
    {
      "text": "Keith E Stanovich, Richard F West, and Maggie E Toplak. 2016. The rationality quotient: Toward a test of rational thinking. MIT press.",
      "doi": ""
    },
    {
      "text": "Maggie E Toplak, Richard F West, and Keith E Stanovich. 2014. Assessing miserly information processing: An expansion of the Cognitive Reflection Test. Thinking & Reasoning 20, 2 (2014), 147–168.",
      "doi": ""
    },
    {
      "text": "Jay J Van Bavel and Andrea Pereira. 2018. The partisan brain: An Identity-based model of political belief. Trends in cognitive sciences 22, 3 (2018), 213–224.",
      "doi": ""
    },
    {
      "text": "Soroush Vosoughi, Deb Roy, and Sinan Aral. 2018. The spread of true and false news online. science 359, 6380 (2018), 1146–1151.",
      "doi": ""
    },
    {
      "text": "Nathan Walter, Jonathan Cohen, R Lance Holbert, and Yasmin Morag. 2020. Fact-checking: A meta-analysis of what works and for whom. Political Communication 37, 3 (2020), 350–375.",
      "doi": ""
    },
    {
      "text": "Darrell M West. 2018. The future of work: Robots, AI, and automation. Brookings Institution Press.",
      "doi": ""
    },
    {
      "text": "Joachim S Wiewiura and Vincent F Hendricks. 2018. Informational pathologies and interest bubbles: Exploring the structural mobilization of knowledge, ignorance, and slack. New Media & Society 20, 3 (2018), 1123–1138.",
      "doi": ""
    },
    {
      "text": "Cassandra Xia. 2014. A game-based intervention for the reduction of statistical cognitive biases. Ph. D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Yifan Xu. 2022. Dialogue Explanation With Reasoning for AI. In Proceedings of the 2022 AAAI/ACM Conference on AI, Ethics, and Society. 918–918.",
      "doi": "10.1145/3514094.3539522"
    },
    {
      "text": "Rowan Zellers, Ari Holtzman, Hannah Rashkin, Yonatan Bisk, Ali Farhadi, Franziska Roesner, and Yejin Choi. 2019. Defending against neural fake news. Advances in neural information processing systems 32 (2019).",
      "doi": ""
    },
    {
      "text": "Xia Zeng, Amani S Abumansour, and Arkaitz Zubiaga. 2021. Automated fact-checking: A survey. Language and Linguistics Compass 15, 10 (2021), e12438.",
      "doi": ""
    },
    {
      "text": "Qiaoning Zhang, Matthew L Lee, and Scott Carter. 2022. You Complete Me: Human-AI Teams and Complementary Expertise. In CHI Conference on Human Factors in Computing Systems. 1–28.",
      "doi": ""
    }
  ]
}