{
  "doi": "10.1145/3544548.3581168",
  "title": "Troubling Collaboration: Matters of Care for Visualization Design Study",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "A common research process in visualization is for visualization researchers to collaborate with domain experts to solve particular applied data problems. While there is existing guidance and expertise around how to structure collaborations to strengthen research contributions, there is comparatively little guidance on how to navigate the implications of, and power produced through the socio-technical entanglements of collaborations. In this paper, we qualitatively analyze reflective interviews of past participants of collaborations from multiple perspectives: visualization graduate students, visualization professors, and domain collaborators. We juxtapose the perspectives of these individuals, revealing tensions about the tools that are built and the relationships that are formed — a complex web of competing motivations. Through the lens of matters of care, we interpret this web, concluding with considerations that both trouble and necessitate reformation of current patterns around collaborative work in visualization design studies to promote more equitable, useful, and care-ful outcomes.",
  "authors": [
    {
      "name": "Derya Akbaba",
      "institution": "Dept. of Science & Technology, Linköping University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781395",
      "orcid": "0000-0001-9419-3402"
    },
    {
      "name": "Devin Lange",
      "institution": "University of Utah, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660321638",
      "orcid": "0000-0002-3467-0294"
    },
    {
      "name": "Michael Correll",
      "institution": "Tableau Research, Tableau Software, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502658789",
      "orcid": "0000-0001-7902-3907"
    },
    {
      "name": "Alexander Lex",
      "institution": "University of Utah, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440622806",
      "orcid": "0000-0001-6930-5468"
    },
    {
      "name": "Miriah Meyer",
      "institution": "Linköping University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502641674",
      "orcid": "0000-0002-8971-6245"
    }
  ],
  "references": [
    {
      "text": "Karen S. Baker and Helena Karasti. 2018. Data Care and Its Politics: Designing for Local Collective Data Management as a Neglected Thing. In Proceedings of the 15th Participatory Design Conference: Full Papers - Volume 1 (Hasselt and Genk, Belgium) (PDC ’18). Association for Computing Machinery, New York, NY, USA, Article 10, 12 pages. https://doi.org/10.1145/3210586.3210587",
      "doi": "10.1145/3210586.3210587"
    },
    {
      "text": "Madeline Balaam, Rob Comber, Rachel E. Clarke, Charles Windlin, Anna Ståhl, Kristina Höök, and Geraldine Fitzpatrick. 2019. Emotion Work in Experience-Centered Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300832",
      "doi": "10.1145/3290605.3300832"
    },
    {
      "text": "Karen Barad. 2007. Meeting the Universe Halfway: Quantum Physics and the Entanglement of Matter and Meaning. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2014. Diffracting Diffraction: Cutting Together-Apart. Parallax 20, 3 (2014), 168–187. https://doi.org/10.1080/13534645.2014.927623",
      "doi": ""
    },
    {
      "text": "Eric P. S. Baumer, Mahmood Jasim, Ali Sarvghad, and Narges Mahyar. 2022. Of Course it’s Political! A Critical Inquiry into Underemphasized Dimensions in Civic Text Visualization. Computer Graphics Forum 41, 3 (2022), 1–14. https://doi.org/10.1111/cgf.14518 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.14518",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett and Daniela K. Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the \"Other\". In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300528",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Patricia Hill Collins. 1990. Black feminist thought in the matrix of domination. Black feminist thought: Knowledge, consciousness, and the politics of empowerment 138, 1990 (1990), 221–238.",
      "doi": ""
    },
    {
      "text": "Michael Correll. 2019. Ethical Dimensions of Visualization Research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300418",
      "doi": "10.1145/3290605.3300418"
    },
    {
      "text": "Michael Correll. 2020. What Do We Actually Learn from Evaluations in the “Heroic Era” of Visualization? : Position Paper. In 2020 IEEE Workshop on Evaluation and Beyond - Methodological Approaches to Visualization (BELIV). 48–54. https://doi.org/10.1109/BELIV51497.2020.00013",
      "doi": ""
    },
    {
      "text": "Anamaria Crisan, Jennifer L. Gardy, and Tamara Munzner. 2016. On regulatory and organizational constraints in visualization design and evaluation. ACM Int. Conf. Proceeding Ser. 24-October (2016), 1–9. https://doi.org/10.1145/2993901.2993911 arxiv:1610.10056",
      "doi": "10.1145/2993901.2993911"
    },
    {
      "text": "Catherine D’ignazio and Lauren F Klein. 2020. Data Feminism. MIT press.",
      "doi": ""
    },
    {
      "text": "Marian Dörk, Patrick Feng, Christopher Collins, and Sheelagh Carpendale. 2013. Critical InfoVis: Exploring the Politics of Visualization. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 2189–2198. https://doi.org/10.1145/2468356.2468739",
      "doi": "10.1145/2468356.2468739"
    },
    {
      "text": "Johanna Drucker. 2021. Sustainability and complexity: Knowledge and authority in the digital humanities. Digit. Scholarsh. Humanit. 36, Supplement_2 (nov 2021), ii86–ii94. https://doi.org/10.1093/llc/fqab025",
      "doi": ""
    },
    {
      "text": "F. Ehmel, V. Brüggemann, and M Dörk. 2021. Topography of Violence: Considerations for Ethical and Collaborative Visualization Design. Comput. Graph. Forum 40, 3 (2021), 13–24. https://doi.org/10.1111/cgf.14285",
      "doi": ""
    },
    {
      "text": "Jean-Daniel Fekete, Jarke J. van Wijk, John T. Stasko, and Chris North. 2008. The Value of Information Visualization. Springer Berlin Heidelberg, Berlin, Heidelberg, 1–18. https://doi.org/10.1007/978-3-540-70956-5_1",
      "doi": "10.1007/978-3-540-70956-5_1"
    },
    {
      "text": "Danyel Fisher and Miriah Meyer. 2017. Making data visual: a practical guide to using visualization for insight. \" O’Reilly Media, Inc.\".",
      "doi": ""
    },
    {
      "text": "Carol Gilligan. 1977. In a different voice: Women’s conceptions of self and of morality. Harvard educational review 47, 4 (1977), 481–517.",
      "doi": ""
    },
    {
      "text": "Carol Gilligan. 1993. In a different voice: Psychological theory and women’s development. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Hua Guo, Steven R. Gomez, Caroline Ziemkiewicz, and David H. Laidlaw. 2016. A Case Study Using Visualization Interaction Logs and Insight Metrics to Understand How Analysts Arrive at Insights. IEEE Transactions on Visualization and Computer Graphics 22, 1(2016), 51–60. https://doi.org/10.1109/TVCG.2015.2467613",
      "doi": "10.1109/TVCG.2015.2467613"
    },
    {
      "text": "Kyle Wm. Hall, Adam J. Bradley, Uta Hinrichs, Samuel Huron, Jo Wood, Christopher Collins, and Sheelagh Carpendale. 2020. Design by Immersion: A Transdisciplinary Approach to Problem-Driven Visualizations. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 109–118. https://doi.org/10.1109/TVCG.2019.2934790",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. Fem. Stud. 14, 3 (1988), 575–599. https://doi.org/10.2307/3178066",
      "doi": ""
    },
    {
      "text": "Donna J Haraway. 2016. Staying with the trouble: Making kin in the Chthulucene. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1608–1619. https://doi.org/10.1145/2858036.2858059",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Dorothy Howard and Lilly Irani. 2019. Ways of knowing when research subjects care. Conf. Hum. Factors Comput. Syst. - Proc.(2019), 1–16. https://doi.org/10.1145/3290605.3300327",
      "doi": "10.1145/3290605.3300327"
    },
    {
      "text": "Samuel Huron, Pauline Gourlet, Uta Hinrichs, Trevor Hogan, and Yvonne Jansen. 2017. Let’s Get Physical: Promoting Data Physicalization in Workshop Formats. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 1409–1422. https://doi.org/10.1145/3064663.3064798",
      "doi": "10.1145/3064663.3064798"
    },
    {
      "text": "Benjamin Karer, Hans Hagen, and Dirk J. Lehmann. 2021. Insight Beyond Numbers: The Impact of Qualitative Factors on Visual Data Analysis. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 1011–1021. https://doi.org/10.1109/TVCG.2020.3030376",
      "doi": ""
    },
    {
      "text": "Helen Kennedy, Rosemary Lucy Hill, Giorgia Aiello, and William Allen. 2016. The work that visualisation conventions do. Information, Communication & Society 19, 6 (2016), 715–735. https://doi.org/10.1080/1369118X.2016.1153126",
      "doi": ""
    },
    {
      "text": "E. Kerzner, A. Lex, C.L. Sigulinsky, T. Urness, B.W. Jones, R.E. Marc, and M. Meyer. 2017. Graffinity: Visualizing Connectivity in Large Graphs. Computer Graphics Forum 36, 3 (2017), 251–260. https://doi.org/10.1111/cgf.13184 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.13184",
      "doi": "10.1111/cgf.13184"
    },
    {
      "text": "Cayla Key, Fiona Browne, Nick Taylor, and Jon Rogers. 2021. Proceed with Care: Reimagining Home IoT Through a Care Perspective. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–15. https://doi.org/10.1145/3411764.3445602",
      "doi": "10.1145/3411764.3445602"
    },
    {
      "text": "Lauren Klein. 2022. What Data Visualization Reveals: Elizabeth Palmer Peabody and the Work of Knowledge Production. Harvard Data Science Review 4, 2 (apr 28 2022). https://hdsr.mitpress.mit.edu/pub/oraonikr.",
      "doi": ""
    },
    {
      "text": "Max Krüger, Anne Weibert, Débora de Castro Leal, Dave Randall, and Volker Wulf. 2021. It takes more than one hand to clap: On the role of ’care’ in maintaining design results. Conf. Hum. Factors Comput. Syst. - Proc.(2021). https://doi.org/10.1145/3411764.3445389",
      "doi": "10.1145/3411764.3445389"
    },
    {
      "text": "Amanda Lazar, Ben Jelen, Alisha Pradhan, and Katie A. Siek. 2021. Adopting Diffractive Reading to Advance HCI Research: A Case Study on Technology for Aging. ACM Trans. Comput.-Hum. Interact. 28, 5, Article 32 (aug 2021), 29 pages. https://doi.org/10.1145/3462326",
      "doi": "10.1145/3462326"
    },
    {
      "text": "Crystal Lee, Tanya Yang, Gabrielle D Inchoco, Graham M. Jones, and Arvind Satyanarayan. 2021. Viral Visualizations: How Coronavirus Skeptics Use Orthodox Data Practices to Promote Unorthodox Science Online. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 607, 18 pages. https://doi.org/10.1145/3411764.3445211",
      "doi": "10.1145/3411764.3445211"
    },
    {
      "text": "Alexander Lex, Nils Gehlenborg, Hendrik Strobelt, Romain Vuillemot, and Hanspeter Pfister. 2014. UpSet: Visualization of Intersecting Sets. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 1983–1992. https://doi.org/10.1109/TVCG.2014.2346248",
      "doi": ""
    },
    {
      "text": "Ann Light and Yoko Akama. 2014. Structuring Future Social Relations: The Politics of Care in Participatory Practice. In Proceedings of the 13th Participatory Design Conference on Research Papers - PDC ’14. ACM Press, Windhoek, Namibia, 151–160. https://doi.org/10.1145/2661435.2661438",
      "doi": "10.1145/2661435.2661438"
    },
    {
      "text": "Alan Lundgard, Crystal Lee, and Arvind Satyanarayan. 2019. Sociotechnical Considerations for Accessible Visualization Design. In 2019 IEEE Visualization Conference (VIS). 16–20. https://doi.org/10.1109/VISUAL.2019.8933762",
      "doi": ""
    },
    {
      "text": "Giorgia Lupi. 2017. Data humanism: the revolutionary future of data visualization. Print Magazine 30, 3 (2017).",
      "doi": ""
    },
    {
      "text": "Aryn Martin, Natasha Myers, and Ana Viseu. 2015. The politics of care in technoscience. Soc. Stud. Sci. 45, 5 (2015), 625–641. https://doi.org/10.1177/0306312715602073",
      "doi": ""
    },
    {
      "text": "Nina McCurdy, Jason Dykes, and Miriah Meyer. 2016. Action design research and visualization design. ACM Int. Conf. Proceeding Ser. 24-October (2016), 10–18. https://doi.org/10.1145/2993901.2993916",
      "doi": "10.1145/2993901.2993916"
    },
    {
      "text": "Sean McKenna, Dominika Mazur, James Agutter, and Miriah Meyer. 2014. Design Activity Framework for Visualization Design. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 2191–2200. https://doi.org/10.1109/TVCG.2014.2346331",
      "doi": ""
    },
    {
      "text": "Miriah Meyer and Jason Dykes. 2019. Criteria for Rigor in Visualization Design Study. IEEE Trans. Vis. Comput. Graph. 26, 1 (2019), 1–1. https://doi.org/10.1109/TVCG.2019.2934539 arXiv:1907.08495",
      "doi": ""
    },
    {
      "text": "Miriah Meyer, Michael Sedlmair, P Samuel Quinan, and Tamara Munzner. 2015. The nested blocks and guidelines model. Information Visualization 14, 3 (2015), 234–249. https://doi.org/10.1177/1473871613510429",
      "doi": ""
    },
    {
      "text": "Javier Monforte and Joan Úbeda-Colomer. 2021. Tinkering with the two-to-one interview: Reflections on the use of two interviewers in qualitative constructionist inquiry. Methods Psychol. 5 (oct 2021), 100082. https://doi.org/10.1016/j.metip.2021.100082",
      "doi": ""
    },
    {
      "text": "Jimmy Moore, Pascal Goffin, Jason Wiese, and Miriah Meyer. 2022. An Interview Method for Engaging Personal Data. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 4, Article 173 (dec 2022), 28 pages. https://doi.org/10.1145/3494964",
      "doi": "10.1145/3494964"
    },
    {
      "text": "Tamara Munzner. 2009. A Nested Model for Visualization Design and Validation. IEEE Transactions on Visualization and Computer Graphics 15, 6(2009), 921–928. https://doi.org/10.1109/TVCG.2009.111",
      "doi": "10.1109/TVCG.2009.111"
    },
    {
      "text": "Michelle Murphy. 2015. Unsettling care: Troubling transnational itineraries of care in feminist health practices. Social Studies of Science 45, 5 (2015), 717–737. https://doi.org/10.1177/0306312715589136",
      "doi": ""
    },
    {
      "text": "Giovanna Nunes Vilaza, Kevin Doherty, Darragh McCashin, David Coyle, Jakob Bardram, and Marguerite Barry. 2022. A Scoping Review of Ethics Across SIGCHI. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 137–154. https://doi.org/10.1145/3532106.3533511",
      "doi": "10.1145/3532106.3533511"
    },
    {
      "text": "Georgia Panagiotidou, Sinem Görücü, Eslam Nofal, Müge Akkar Ercan, and Andrew Vande Moere. 2022. Co-gnito: A Participatory Physicalization Game for Urban Mental Mapping. In Creativity and Cognition (Venice, Italy) (C&C ’22). Association for Computing Machinery, New York, NY, USA, 284–297. https://doi.org/10.1145/3527927.3532803",
      "doi": "10.1145/3527927.3532803"
    },
    {
      "text": "Paul Parsons. 2022. Understanding Data Visualization Design Practice. IEEE Transactions on Visualization and Computer Graphics 28, 1(2022), 665–675. https://doi.org/10.1109/TVCG.2021.3114959",
      "doi": "10.1109/TVCG.2021.3114959"
    },
    {
      "text": "Evan M. Peck, Sofia E. Ayuso, and Omar El-Etr. 2019. Data is Personal: Attitudes and Perceptions of Data Visualization in Rural Pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300474",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Maria Puig de la Bellacasa. 2011. Matters of care in technoscience: Assembling neglected things. Soc. Stud. Sci. 41, 1 (2011), 85–106. https://doi.org/10.1177/0306312710380301",
      "doi": ""
    },
    {
      "text": "Jonathan C. Roberts, Chris Headleand, and Panagiotis D. Ritsos. 2016. Sketching Designs Using the Five Design-Sheet Methodology. IEEE Transactions on Visualization and Computer Graphics 22, 1(2016), 419–428. https://doi.org/10.1109/TVCG.2015.2467271",
      "doi": "10.1109/TVCG.2015.2467271"
    },
    {
      "text": "Samar Sabie and Tapan Parikh. 2019. Cultivating Care through Ambiguity: Lessons from a Service Learning Course. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300507",
      "doi": "10.1145/3290605.3300507"
    },
    {
      "text": "P. Saraiya, C. North, and K. Duca. 2005. An insight-based methodology for evaluating bioinformatics visualizations. IEEE Transactions on Visualization and Computer Graphics 11, 4(2005), 443–456. https://doi.org/10.1109/TVCG.2005.53",
      "doi": "10.1109/TVCG.2005.53"
    },
    {
      "text": "Michael Sedlmair. 2016. Design Study Contributions Come in Different Guises: Seven Guiding Scenarios. In Proceedings of the Sixth Workshop on Beyond Time and Errors on Novel Evaluation Methods for Visualization (Baltimore, MD, USA) (BELIV ’16). Association for Computing Machinery, New York, NY, USA, 152–161. https://doi.org/10.1145/2993901.2993913",
      "doi": "10.1145/2993901.2993913"
    },
    {
      "text": "Michael Sedlmair, Miriah Meyer, and Tamara Munzner. 2012. Design Study Methodology: Reflections from the Trenches and the Stacks. IEEE Transactions on Visualization and Computer Graphics 18, 12(2012), 2431–2440. https://doi.org/10.1109/TVCG.2012.213",
      "doi": "10.1109/TVCG.2012.213"
    },
    {
      "text": "Paul Shannon, Andrew Markiel, Owen Ozier, Nitin S Baliga, Jonathan T Wang, Daniel Ramage, Nada Amin, Benno Schwikowski, and Trey Ideker. 2003. Cytoscape: a software environment for integrated models of biomolecular interaction networks. Genome research 13, 11 (2003), 2498–2504. https://doi.org/10.1101/gr.1239303",
      "doi": ""
    },
    {
      "text": "Ben Rydal Shapiro, Amanda Meng, Cody O’Donnell, Charlotte Lou, Edwin Zhao, Bianca Dankwa, and Andrew Hostetler. 2020. Re-Shape: A Method to Teach Data Ethics for Data Science Education. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376251",
      "doi": "10.1145/3313831.3376251"
    },
    {
      "text": "Crystal L. Sigulinsky, James R. Anderson, Ethan Kerzner, Christopher N. Rapp, Rebecca L. Pfeiffer, Taryn M. Rodman, Daniel P. Emrich, Kevin D. Rapp, Noah T. Nelson, J. Scott Lauritzen, Miriah Meyer, Robert E. Marc, and Bryan W. Jones. 2020. Network Architecture of Gap Junctional Coupling among Parallel Processing Channels in the Mammalian Retina. Journal of Neuroscience 40, 23 (2020), 4483–4511. https://doi.org/10.1523/JNEUROSCI.1810-19.2020",
      "doi": ""
    },
    {
      "text": "John Stasko. 2014. Value-Driven Evaluation of Visualizations. In Proceedings of the Fifth Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization (Paris, France) (BELIV ’14). Association for Computing Machinery, New York, NY, USA, 46–53. https://doi.org/10.1145/2669557.2669579",
      "doi": "10.1145/2669557.2669579"
    },
    {
      "text": "Lucy Suchman. 2002. Located Accountabilities in Technology Production. Scandinavian journal of information systems 14, 2 (2002), 91–105.",
      "doi": "10.5555/782686.782694"
    },
    {
      "text": "Uzma Haque Syeda, Prasanth Murali, Lisa Roe, Becca Berkey, and Michelle A. Borkin. 2020. Design Study \"Lite\" Methodology: Expediting Design Studies and Enabling the Synergy of Visualization Pedagogy and Social Good. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376829",
      "doi": "10.1145/3313831.3376829"
    },
    {
      "text": "Austin Toombs, Shad Gross, Shaowen Bardzell, and Jeffrey Bardzell. 2017. From Empathy to Care: A Feminist Care Ethics Perspective on Long-Term Researcher–Participant Relations. Interacting with Computers 29, 1 (2017), 45–57. https://doi.org/10.1093/iwc/iww010",
      "doi": ""
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 629–638. https://doi.org/10.1145/2702123.2702522",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Rosa van Koningsbruggen, Hannes Waldschütz, and Eva Hornecker. 2022. What is Data? - Exploring the Meaning of Data in Data Physicalisation Teaching. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction(Daejeon, Republic of Korea) (TEI ’22). Association for Computing Machinery, New York, NY, USA, Article 13, 21 pages. https://doi.org/10.1145/3490149.3501319",
      "doi": "10.1145/3490149.3501319"
    },
    {
      "text": "J.J. van Wijk. 2005. The value of visualization. In VIS 05. IEEE Visualization, 2005.79–86. https://doi.org/10.1109/VISUAL.2005.1532781",
      "doi": ""
    },
    {
      "text": "Jagoda Walny, Sheelagh Carpendale, Nathalie Henry Riche, Gina Venolia, and Philip Fawcett. 2011. Visual Thinking In Action: Visualizations As Used On Whiteboards. IEEE Transactions on Visualization and Computer Graphics 17, 12(2011), 2508–2517. https://doi.org/10.1109/TVCG.2011.251",
      "doi": "10.1109/TVCG.2011.251"
    },
    {
      "text": "J. Walny, S. Huron, and S. Carpendale. 2015. An Exploratory Study of Data Sketching for Visual Representation. Computer Graphics Forum 34, 3 (2015), 231–240. https://doi.org/10.1111/cgf.12635 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.12635",
      "doi": ""
    },
    {
      "text": "Gunther H Weber, Sheelagh Carpendale, David Ebert, Brian Fisher, Hans Hagen, Ben Shneiderman, and Anders Ynnerman. 2017. Apply or Die: On the Role and Assessment of Application Papers in Visualization. IEEE Comput. Graph. Appl. 37, 3 (2017), 96–104. https://doi.org/10.1109/MCG.2017.51",
      "doi": "10.1109/MCG.2017.51"
    },
    {
      "text": "Caroline Whitbeck. 1996. Ethics as design: Doing justice to moral problems. Hastings Center Report 26, 3 (1996), 9–16. https://doi.org/10.2307/3527925",
      "doi": ""
    },
    {
      "text": "Katy Williams, Alex Bigelow, and Kate Isaacs. 2020. Visualizing a Moving Target: A Design Study on Task Parallel Programs in the Presence of Evolving Data and Concerns. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 1118–1128. https://doi.org/10.1109/TVCG.2019.2934285",
      "doi": ""
    },
    {
      "text": "Aoyu Wu, Dazhen Deng, Furui Cheng, Yingcai Wu, Shixia Liu, and Huamin Qu. 2022. In Defence of Visual Analytics Systems: Replies to Critics. IEEE Transactions on Visualization and Computer Graphics (2022), 1–11. https://doi.org/10.1109/TVCG.2022.3209360",
      "doi": ""
    },
    {
      "text": "Andromeda Yelton. 2021. Twitter Thread. https://twitter.com/ThatAndromeda/status/1458445616409939971?s=20.",
      "doi": ""
    }
  ]
}