{
  "doi": "10.1145/3544548.3581010",
  "title": "“Who is the right homeless client?”: Values in Algorithmic Homelessness Service Provision and Machine Learning Research",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2023,
  "badges": [],
  "abstract": "Homelessness presents a long-standing problem worldwide. Like other welfare services, homeless services have gained increased traction in Machine Learning (ML) research. Unhoused persons are vulnerable and using their data in the ML pipeline raises serious concerns about the unintended harms and consequences of prioritizing different ML values. To address this, we conducted a critical analysis of 40 research papers identified through a systematic literature review in ML homelessness service provision research. We found that the values of novelty, performance, and identifying limitations were uplifted in these papers, whereas (in)efficiency, (low/high) cost, fast, (violated) privacy, and (homeless condition) reproducibility valuescollapse. Consequently, unhoused persons were lost (i.e., humans were deprioritized) at multi-level ML abstraction of predictors, categories, and algorithms. Our findings illuminate potential pathways forward at the intersection of data science, HCI and STS by situating humans at the center to support this vulnerable community.",
  "tags": [
    "Homelessness and Algorithms",
    "Homelessness",
    "Machine Learning (ML) Values",
    "Values Collapse",
    "ML Values Collapse in Homelessness"
  ],
  "authors": [
    {
      "name": "Dilruba Showkat",
      "institution": "Khoury College of Computer Science, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321513",
      "orcid": "0000-0003-3362-5800"
    },
    {
      "name": "Angela D. R. Smith",
      "institution": "School of Information, University of Texas at Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529450",
      "orcid": "0000-0001-5546-5452"
    },
    {
      "name": "Wang Lingqing",
      "institution": "Department of Industrial Engineering, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783309",
      "orcid": "0000-0001-5888-3545"
    },
    {
      "name": "Alexandra To",
      "institution": "Art + Design and Khoury College of Computer Science, Northeastern University, United States",
      "img": "/do/10.1145/contrib-99658642648/rel-imgonly/ato_2021_squarec.jpg",
      "acmid": "99658642648",
      "orcid": "0000-0001-7298-7607"
    }
  ],
  "references": [
    {
      "text": "Substance Abuse and Mental Health Service Administration. 2022. Child Homelessness: A Growing Crisis. https://www.samhsa.gov/homelessness-programs-resources/hpr-resources/child-homelessness-growing-crisis Accessed: 2022-12-11.",
      "doi": ""
    },
    {
      "text": "Sina Aghaei, Mohammad Javad Azizi, and Phebe Vayanos. 2019. Learning optimal and fair decision trees for non-discriminative decision-making. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. ACM, New York, NY, USA, 1418–1426. https://doi.org/10.1609/aaai.v33i01.3301622",
      "doi": "10.1609/aaai.v33i01.3301622"
    },
    {
      "text": "Evgeni Aizenberg and Jeroen Van Den Hoven. 2020. Designing for human rights in AI. Big Data & Society 7, 2 (2020), 2053951720949566. https://doi.org/10.1177/2053951720949566",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib and Michael Bernstein. 2019. Street-level algorithms: A theory at the gaps between policy and decisions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300760",
      "doi": "10.1145/3290605.3300760"
    },
    {
      "text": "Cecilia Aragon, Shion Guha, Marina Kogan, Michael Muller, and Gina Neff. 2022. Human-Centered Data Science: An Introduction. MIT Press, USA.",
      "doi": ""
    },
    {
      "text": "Mohammad Javad Azizi, Phebe Vayanos, Bryan Wilder, Eric Rice, and Milind Tambe. 2018. Designing fair, efficient, and interpretable policies for prioritizing homeless youth for housing resources. In International Conference on the Integration of Constraint Programming, Artificial Intelligence, and Operations Research. Springer, Cham, 35–51. https://doi.org/10.1007/978-3-319-93031-2_3",
      "doi": ""
    },
    {
      "text": "Caroline Balagot, Hector Lemus, Megan Hartrick, Tamera Kohler, and Suzanne P Lindsay. 2019. The homeless Coordinated Entry System: the VI-SPDAT and other predictors of establishing eligibility for services for single homeless adults. Journal of Social Distress and the Homeless 28, 2 (2019), 149–157. https://doi.org/10.1080/10530789.2019.1622858",
      "doi": ""
    },
    {
      "text": "Solon Barocas, Asia J Biega, Benjamin Fish, Jędrzej Niklas, and Luke Stark. 2020. When not to design, build, or deploy. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. ACM, New York, NY, USA, 695–695. https://doi.org/10.1145/3351095.3375691",
      "doi": "10.1145/3351095.3375691"
    },
    {
      "text": "Eric PS Baumer and M Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2271–2274. https://doi.org/10.1145/1978942.1979275",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Abeba Birhane, Pratyusha Kalluri, Dallas Card, William Agnew, Ravit Dotan, and Michelle Bao. 2022. The values encoded in machine learning research. In 2022 ACM Conference on Fairness, Accountability, and Transparency. ACM, New York, NY, USA, 173–184. https://doi.org/10.1145/3531146.3533083",
      "doi": "10.1145/3531146.3533083"
    },
    {
      "text": "Abeba Birhane, Pratyusha Kalluri, Dallas Card, William Agnew, Ravit Dotan, and Michelle Bao. 2022. The Values Encoded in Machine Learning Research. https://github.com/wagnew3/The-Values-Encoded-in-Machine-Learning-Research Accessed: 2022-05-09.",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-solutionist strategies: Seriously silly design fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 4968–4978. https://doi.org/10.1145/2858036.2858482",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Chris Bopp, Ellie Harmon, and Amy Voida. 2017. Disempowered by data: Nonprofits, social enterprises, and the consequences of data-driven work. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 3608–3619. https://doi.org/10.1145/3025453.3025694",
      "doi": "10.1145/3025453.3025694"
    },
    {
      "text": "Danah Boyd and Kate Crawford. 2012. Critical questions for big data: Provocations for a cultural, technological, and scholarly phenomenon. Information, communication & society 15, 5 (2012), 662–679. https://doi.org/10.1080/1369118X.2012.678878",
      "doi": ""
    },
    {
      "text": "Karen L Boyd. 2021. Datasheets for Datasets help ML Engineers Notice and Understand Ethical Issues in Training Data. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–27. https://doi.org/10.1145/3479582",
      "doi": "10.1145/3479582"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis.American Psychological Association, USA.",
      "doi": ""
    },
    {
      "text": "Anna Brown, Alexandra Chouldechova, Emily Putnam-Hornstein, Andrew Tobin, and Rhema Vaithianathan. 2019. Toward algorithmic accountability in public services: A qualitative study of affected community perspectives on algorithmic decision-making in child welfare services. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300271",
      "doi": "10.1145/3290605.3300271"
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, 2020. Language models are few-shot learners. Advances in neural information processing systems 33 (2020), 1877–1901. https://proceedings.neurips.cc/paper/2020/file/1457c0d6bfcb4967418bfb8ac142f64a-Paper.pdf",
      "doi": ""
    },
    {
      "text": "Kristy Buccieri and Gina Molleson. 2015. Empowering homeless youth: Building capacity through the development of mobile technology. Journal of Community Practice 23, 2 (2015), 238–254. https://doi.org/10.1080/10705422.2015.1027802",
      "doi": ""
    },
    {
      "text": "Thomas Byrne, Travis Baggett, Thomas Land, Dana Bernson, Maria-Elena Hood, Cheryl Kennedy-Perez, Rodrigo Monterrey, David Smelson, Marc Dones, and Monica Bharel. 2020. A classification model of homelessness using integrated administrative data: Implications for targeting interventions to improve the housing status, health and well-being of a highly vulnerable population. PloS one 15, 8 (2020), e0237905. https://doi.org/10.1371/journal.pone.0237905",
      "doi": ""
    },
    {
      "text": "Thomas Byrne, Dan Treglia, Dennis P Culhane, John Kuhn, and Vincent Kane. 2016. Predictors of homelessness among families and single adults after exit from homelessness prevention and Rapid Re-Housing Programs: Evidence from the Department of Veterans Affairs Supportive Services for Veteran Families program. Housing Policy Debate 26, 1 (2016), 252–275. https://doi.org/10.1080/10511482.2015.1060249",
      "doi": ""
    },
    {
      "text": "Hau Chan, Eric Rice, Phebe Vayanos, Milind Tambe, and Matthew Morton. 2017. Evidence from the past: AI decision aids to improve housing systems for homeless youth. In 2017 AAAI Fall Symposium Series. ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Hau Chan, Long Tran-Thanh, Bryan Wilder, Eric Rice, Phebe Vayanos, and Milind Tambe. 2018. Utilizing housing resources for homeless youth through the lens of multiple multi-dimensional knapsacks. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society. ACM, New York, NY, USA, 41–47. https://doi.org/10.1145/3278721.3278757",
      "doi": "10.1145/3278721.3278757"
    },
    {
      "text": "Stevie Chancellor, Eric PS Baumer, and Munmun De Choudhury. 2019. Who is the\" human\" in human-centered machine learning: The case of predicting mental health from social media. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–32. https://doi.org/10.1145/3359249",
      "doi": "10.1145/3359249"
    },
    {
      "text": "Rashmi Chandra and Dhaval Vyas. 2021. Critical Moments: Supporting Homeless Journeys Through Design. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3411763.3451790",
      "doi": "10.1145/3411763.3451790"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. sage, UK.",
      "doi": ""
    },
    {
      "text": "Charalampos Chelmis, Wenting Qi, and Wonhyung Lee. 2021. Challenges and opportunities in using data science for homelessness service provision. In Companion Proceedings of the Web Conference 2021. ACM, New York, NY, USA, 128–135. https://doi.org/10.1145/3442442.3453454",
      "doi": "10.1145/3442442.3453454"
    },
    {
      "text": "Charalampos Chelmis, Wenting Qi, Wonhyung Lee, and Stephanie Duncan. 2021. Smart homelessness service provision with machine learning. Procedia Computer Science 185 (2021), 9–18. https://doi.org/10.1016/j.procs.2021.05.002",
      "doi": ""
    },
    {
      "text": "Charalampos Chelmis and Khandker Sadia Rahman. 2021. Peeking through the homelessness system with a network science lens. In Proceedings of the 2021 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining. ACM, New York, NY, USA, 69–73. https://doi.org/10.1145/3487351.3488321",
      "doi": "10.1145/3487351.3488321"
    },
    {
      "text": "Janet X Chen, Allison McDonald, Yixin Zou, Emily Tseng, Kevin A Roundy, Acar Tamersoy, Florian Schaub, Thomas Ristenpart, and Nicola Dell. 2022. Trauma-Informed Computing: Towards Safer Technology Experiences for All. In CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–20. https://doi.org/10.1145/3491102.3517475",
      "doi": "10.1145/3491102.3517475"
    },
    {
      "text": "Patricia Hill Collins. 2002. Black feminist thought: Knowledge, consciousness, and the politics of empowerment. routledge, USA.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. The MIT Press, USA.",
      "doi": ""
    },
    {
      "text": "Dennis P Culhane and Randall Kuhn. 1998. Patterns and determinants of public shelter utilization among homeless adults in New York City and Philadelphia. Journal of Policy Analysis and Management: The Journal of the Association for Public Policy Analysis and Management 17, 1 (1998), 23–43. https://doi.org/10.1002/(SICI)1520-6688(199824)17:1<23::AID-PAM2>3.0.CO;2-J",
      "doi": ""
    },
    {
      "text": "Jenny L Davis, Apryl Williams, and Michael W Yang. 2021. Algorithmic reparation. Big Data & Society 8, 2 (2021), 20539517211044808. https://doi.org/10.1177/20539517211044808",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Lauren F. Klein. 2020. Seven intersectional feminist principles for equitable and actionable COVID-19 data. Big data & society 7, 2 (2020), 2053951720942544. https://doi.org/10.1177/2053951720942544",
      "doi": ""
    },
    {
      "text": "Catherine D’ignazio and Lauren F Klein. 2020. Data feminism. MIT press, USA.",
      "doi": ""
    },
    {
      "text": "Graham T DiGuiseppi, Jordan P Davis, Daniel Leightley, and Eric Rice. 2020. Predictors of adolescents’ first episode of homelessness following substance use treatment. Journal of Adolescent Health 66, 4 (2020), 408–415. https://doi.org/10.1016/j.jadohealth.2019.11.312",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt, Xinyi Wang, Earnest Wheeler, Hao Fei Cheng, Brent Hecht, and Haiyi Zhu. 2017. The sharing economy in computing: A systematic literature review. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–26. https://doi.org/10.1145/3134673",
      "doi": "10.1145/3134673"
    },
    {
      "text": "Markéta Dolejšová and Tereza Lišková. 2017. StreetSauce: Nurturing speculation in service design. Interactions 24, 5 (2017), 34–39. https://doi.org/10.1145/3121346",
      "doi": "10.1145/3121346"
    },
    {
      "text": "Zi-Yi Dou, Anamika Barman-Adhikari, Fei Fang, and Amulya Yadav. 2021. Harnessing Social Media to Identify Homeless Youth At-Risk of Substance Use. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 35. ACM, New York, NY, USA, 14748–14756. https://doi.org/10.1609/aaai.v35i17.17732",
      "doi": ""
    },
    {
      "text": "Hannah Dreyfus. 2021. States Are Hoarding 5.2 Billion in Welfare Funds Even as the Need for Aid Grows. https://www.propublica.org/article/states-are-hoarding-52-billion-in-welfare-funds-even-as-the-need-for-aid-grows Accessed: 2022-03-14.",
      "doi": ""
    },
    {
      "text": "Virginia Eubanks. 2018. Automating inequality: How high-tech tools profile, police, and punish the poor. St. Martin’s Press, USA.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Melanie Feinberg, Will Sutherland, Sarah Beth Nelson, Mohammad Hossein Jarrahi, and Arcot Rajasekar. 2020. The new reality of reproducibility: The role of data work in scientific research. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–22. https://doi.org/10.1145/3392840",
      "doi": "10.1145/3392840"
    },
    {
      "text": "Andrew Fisher, Bart Gajderowicz, Eric Latimer, Tim Aubry, and Vijay Mago. 2022. BEAUT: An ExplainaBle Deep LEarning Model for Agent-Based PopUlations With Poor DaTa. Knowledge-Based Systems 248 (2022), 108836. https://doi.org/10.1016/j.knosys.2022.108836",
      "doi": "10.1016/j.knosys.2022.108836"
    },
    {
      "text": "Andrew Fisher, Vijay Mago, and Eric Latimer. 2020. Simulating the evolution of homeless populations in canada using modified deep q-learning (mdql) and modified neural fitted q-iteration (mnfq) algorithms. IEEE Access 8(2020), 92954–92968. https://doi.org/10.1109/ACCESS.2020.2994519",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter H Kahn, Alan Borning, and Alina Huldtgren. 2013. Value sensitive design and information systems. In Early engagement and new technologies: Opening up the laboratory. Springer, USA, 55–95. https://link.springer.com/chapter/10.1007/978-94-007-7844-3_4",
      "doi": ""
    },
    {
      "text": "Batya Friedman and Helen Nissenbaum. 1996. Bias in computer systems. ACM Transactions on information systems (TOIS) 14, 3 (1996), 330–347. https://doi.org/10.1145/230538.230561",
      "doi": "10.1145/230538.230561"
    },
    {
      "text": "Yuan Gao, Sanmay Das, and Patrick Fowler. 2017. Homelessness service provision: a data science perspective. In Workshops at the Thirty-First AAAI Conference on Artificial Intelligence. ACM, New York, NY, USA. https://cs.gmu.edu/ sanmay/papers/hsp-dsp.pdf",
      "doi": ""
    },
    {
      "text": "Bill Gaver and Heather Martin. 2000. Alternatives: exploring information appliances through conceptual design proposals. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, New York, NY, USA, 209–216. https://doi.org/10.1145/332040.332433",
      "doi": "10.1145/332040.332433"
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé Iii, and Kate Crawford. 2021. Datasheets for datasets. Commun. ACM 64, 12 (2021), 86–92. https://doi.org/10.1145/3458723",
      "doi": "10.1145/3458723"
    },
    {
      "text": "Greg A Greenberg, Jennifer Hoblyn, Catherine Seibyl, and Robert Rosenheck. 2006. Housing outcomes for hospitalized homeless veterans. Journal of health care for the poor and underserved 17, 2(2006), 425–440. https://doi.org/10.1353/hpu.2006.0061",
      "doi": ""
    },
    {
      "text": "Andrew L Greer, Marybeth Shinn, Jonathan Kwon, and Sara Zuiderveen. 2016. Targeting services to individuals most likely to enter shelter: Evaluating the efficiency of homelessness prevention. Social Service Review 90, 1 (2016), 130–155. https://doi.org/10.1086/686466",
      "doi": ""
    },
    {
      "text": "Philip Guo. OCTOBER 30, 2013. Data Science Workflow: Overview and Challenges. https://cacm.acm.org/blogs/blog-cacm/169199-data-science-workflow-overview-and-challenges/fulltext Accessed: 2020-08-22.",
      "doi": ""
    },
    {
      "text": "Jane E Hamilton, Robert Suchting, Tina E Thomas, and David S Buck. 2022. Risk factor assessment of homelessness at psychiatric hospital admission: A machine learning approach. Journal of Social Distress and Homelessness 31, 1 (2022), 81–95. https://doi.org/10.1080/10530789.2021.1892930",
      "doi": ""
    },
    {
      "text": "CT HMIS. 2022. VI-SPDAT (Vulnerability Index - Service Prioritization Decision Assistance Tool). https://www.cthmis.com/info/detail/vi-spdat/13 Accessed: 2022-03-03.",
      "doi": ""
    },
    {
      "text": "Naja Holten Møller, Irina Shklovski, and Thomas T Hildebrandt. 2020. Shifting concepts of value: Designing algorithmic decision-support systems for public services. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3419249.3420149",
      "doi": "10.1145/3419249.3420149"
    },
    {
      "text": "Boyeong Hong, Awais Malik, Jack Lundquist, Ira Bellach, and Constantine E Kontokosta. 2018. Applications of machine learning methods to predict readmission and length-of-stay for homeless families: The case of win shelters in new york city. Journal of Technology in Human Services 36, 1 (2018), 89–104.",
      "doi": ""
    },
    {
      "text": "Andrea Hu, Stevie Chancellor, and Munmun De Choudhury. 2019. Characterizing homelessness discourse on social media. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313057",
      "doi": "10.1145/3290607.3313057"
    },
    {
      "text": "Cornell Law Legal Institute. 2022. 42 U.S. Code § 11302 - General definition of homeless individual. https://www.law.cornell.edu/uscode/text/42/11302 Accessed: 2022-02-09.",
      "doi": ""
    },
    {
      "text": "Caleb John and Geoffrey G. Messier. 2022. A Rule Search Framework for the Early Identification of Chronic Emergency Homeless Shelter Clients. https://doi.org/10.48550/ARXIV.2205.09883",
      "doi": ""
    },
    {
      "text": "Surya Mattu Julia Angwin, Jeff Larson and Lauren Kirchner. 2016. Machine Bias. https://www.propublica.org/article/machine-bias-risk-assessments-in-criminal-sentencing Accessed: 2020-07-08.",
      "doi": ""
    },
    {
      "text": "Dimitar Karadzhov. 2021. Expanding the methodological repertoire of participatory research into homelessness: The utility of the mobile phone diary. Qualitative Social Work 20, 3 (2021), 813–831. https://doi.org/10.1177/1473325020913904",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, Jennifer Wilson, Phebe Vayanos, and Eric Rice. 2019. Street-level realities of data practices in homeless services provision. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23. https://doi.org/10.1145/3359286",
      "doi": "10.1145/3359286"
    },
    {
      "text": "Seunghyun Kim, Afsaneh Razi, Gianluca Stringhini, Pamela J Wisniewski, and Munmun De Choudhury. 2021. A Human-Centered Systematic Literature Review of Cyberbullying Detection Algorithms. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–34. https://doi.org/10.1145/3476066",
      "doi": "10.1145/3476066"
    },
    {
      "text": "Jes A Koepfler and Kenneth R Fleischmann. 2012. Studying the values of hard-to-reach populations: content analysis of tweets by the 21st century homeless. In Proceedings of the 2012 iConference. ACM, New York, NY, USA, 48–55. https://doi.org/10.1145/2132176.2132183",
      "doi": "10.1145/2132176.2132183"
    },
    {
      "text": "Jes A Koepfler, Katie Shilton, and Kenneth R Fleischmann. 2013. A stake in the issue of homelessness: Identifying values of interest for design in online communities. In Proceedings of the 6th International Conference on Communities and Technologies. ACM, New York, NY, USA, 36–45. https://doi.org/10.1145/2482991.2482994",
      "doi": "10.1145/2482991.2482994"
    },
    {
      "text": "Marina Kogan, Aaron Halfaker, Shion Guha, Cecilia Aragon, Michael Muller, and Stuart Geiger. 2020. Mapping out human-centered data science: Methods, approaches, and best practices. In Companion of the 2020 ACM International Conference on Supporting Group Work. ACM, New York, NY, USA, 151–156. https://doi.org/10.1145/3323994.3369898",
      "doi": "10.1145/3323994.3369898"
    },
    {
      "text": "Amanda Kube, Sanmay Das, and Patrick J Fowler. 2019. Allocating interventions based on predicted outcomes: A case study on homelessness services. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. ACM, New York, NY, USA, 622–629.",
      "doi": "10.1609/aaai.v33i01.3301622"
    },
    {
      "text": "Amanda Kube, Sanmay Das, Patrick J Fowler, and Yevgeniy Vorobeychik. 2022. Just Resource Allocation? How Algorithmic Predictions and Human Notions of Justice Interact. In Proceedings of the 23rd ACM Conference on Economics and Computation. ACM, New York, NY, USA, 1184–1242. https://doi.org/10.1145/3490486.3538305",
      "doi": "10.1145/3490486.3538305"
    },
    {
      "text": "Randall Kuhn and Dennis P Culhane. 1998. Applying cluster analysis to test a typology of homelessness by pattern of shelter utilization: Results from the analysis of administrative data. American journal of community psychology 26, 2 (1998), 207–232. https://doi.org/10.1023/a:1022176402357",
      "doi": ""
    },
    {
      "text": "Paulina Lanz, Todd Cunningham, Hoan Nguyen, Pete White, and François Bar. 2021. Skid Row Power Now! A participatory co-design project to power up digital devices in Skid Row. In C&T’21: Proceedings of the 10th International Conference on Communities & Technologies-Wicked Problems in the Age of Tech. ACM, New York, NY, USA, 121–127. https://doi.org/10.1145/3461564.3461595",
      "doi": "10.1145/3461564.3461595"
    },
    {
      "text": "Mary E Larimer, Daniel K Malone, Michelle D Garner, David C Atkins, Bonnie Burlingham, Heather S Lonczak, Kenneth Tanzer, Joshua Ginzler, Seema L Clifasefi, William G Hobson, 2009. Health care and public service use and costs before and after provision of housing for chronically homeless persons with severe alcohol problems. Jama 301, 13 (2009), 1349–1357. https://doi.org/10.1001/jama.2009.414.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec and W Keith Edwards. 2008. Designs on dignity: perceptions of technology among the homeless. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, New York, NY, USA, 627–636. https://doi.org/10.1145/1357054.1357155",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Christopher A Le Dantec, Robert G Farrell, Jim E Christensen, Mark Bailey, Jason B Ellis, Wendy A Kellogg, and W Keith Edwards. 2011. Publics in practice: Ubiquitous computing at a shelter for homeless mothers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1687–1696. https://doi.org/10.1145/1978942.1979189",
      "doi": "10.1145/1978942.1979189"
    },
    {
      "text": "Christopher A Le Dantec, Erika Shehan Poole, and Susan P Wyche. 2009. Values as lived experience: evolving value sensitive design in support of value discovery. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, New York, NY, USA, 1141–1150. https://doi.org/10.1145/1518701.1518875",
      "doi": "10.1145/1518701.1518875"
    },
    {
      "text": "Karen Levy, Kyla E Chasalow, and Sarah Riley. 2021. Algorithms and decision-making in the public sector. Annual Review of Law and Social Science 17 (2021), 309–334. https://ssrn.com/abstract=3861841",
      "doi": ""
    },
    {
      "text": "Rachel M. Dennis, Dania N. Najjar, Melody J. Haak, and Rachel C. Miller. 2022. VolunteerSpot: Helping connect organizations in need of help with those seeking to give.. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3491101.3514486",
      "doi": "10.1145/3491101.3514486"
    },
    {
      "text": "Yaoli Mao, Dakuo Wang, Michael Muller, Kush R Varshney, Ioana Baldini, Casey Dugan, and Aleksandra Mojsilović. 2019. How Data Scientists Work Together With Domain Experts in Scientific Collaborations: To Find The Right Answer Or To Ask The Right Question?Proceedings of the ACM on Human-Computer Interaction 3, GROUP(2019), 1–23. https://doi.org/10.1145/3361118",
      "doi": "10.1145/3361118"
    },
    {
      "text": "Geoffrey Messier, Caleb John, and Ayush Malik. 2022. Predicting chronic homelessness: The importance of comparing algorithms using client histories. Journal of Technology in Human Services 40, 2 (2022), 122–133. https://doi.org/10.1080/15228835.2021.1972502",
      "doi": ""
    },
    {
      "text": "Milagros Miceli, Tianling Yang, Adriana Alvarado Garcia, Julian Posada, Sonja Mei Wang, Marc Pohl, and Alex Hanna. 2022. Documenting Data Production Processes: A Participatory Approach for Data Work. Proc. ACM Hum.-Comput. Interact. 6, CSCW2, Article 510 (nov 2022), 34 pages. https://doi.org/10.1145/3555623",
      "doi": "10.1145/3555623"
    },
    {
      "text": "Margaret Mitchell, Simone Wu, Andrew Zaldivar, Parker Barnes, Lucy Vasserman, Ben Hutchinson, Elena Spitzer, Inioluwa Deborah Raji, and Timnit Gebru. 2019. Model cards for model reporting. In Proceedings of the conference on fairness, accountability, and transparency. ACM, New York, NY, USA, 220–229. https://doi.org/10.1145/3287560.3287596",
      "doi": "10.1145/3287560.3287596"
    },
    {
      "text": "Ann Elizabeth Montgomery, Jamison D Fargo, Thomas H Byrne, Vincent R Kane, and Dennis P Culhane. 2013. Universal screening for homelessness and risk for homelessness in the Veterans Health Administration. American Journal of Public Health 103, S2 (2013), S210–S211. https://doi.org/10.2105/AJPH.2013.301398",
      "doi": ""
    },
    {
      "text": "Matthew H Morton, Amy Dworsky, Jennifer L Matjasko, Susanna R Curry, David Schlueter, Raúl Chávez, and Anne F Farrell. 2018. Prevalence and correlates of youth homelessness in the United States. Journal of Adolescent Health 62, 1 (2018), 14–21. https://doi.org/10.1016/j.jadohealth.2017.10.006",
      "doi": ""
    },
    {
      "text": "Michael Muller. 2014. Curiosity, creativity, and surprise as analytic tools: Grounded theory method. In Ways of Knowing in HCI. Springer, USA, 25–48.",
      "doi": ""
    },
    {
      "text": "Michael Muller, Ingrid Lange, Dakuo Wang, David Piorkowski, Jason Tsay, Q Vera Liao, Casey Dugan, and Thomas Erickson. 2019. How data science workers work with data: Discovery, capture, curation, design, creation. In Proceedings of the 2019 CHI conference on human factors in computing systems. ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300356",
      "doi": "10.1145/3290605.3300356"
    },
    {
      "text": "Michael Muller and Angelika Strohmayer. 2022. Forgetting Practices in the Data Sciences. In CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–19. https://doi.org/10.1145/3491102.3517644",
      "doi": "10.1145/3491102.3517644"
    },
    {
      "text": "Michael J Muller. 2007. Participatory design: the third space in HCI. CRC press, USA. https://doi.org/10.5555/772072.772138",
      "doi": "10.5555/772072.772138"
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of oppression. In Algorithms of Oppression. New York University Press, New York, USA.",
      "doi": ""
    },
    {
      "text": "HUD’s Definition of Homelessness: Resourcesand Guidance. 2019. United States Department of Housing and Urban Development. https://www.hud.gov/ Accessed: 2022-01-09.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Kentaro Toyama, and Tawanna R Dillahunt. 2019. Towards an effective digital literacy intervention to assist returning citizens with job search. In Proceedings of the 2019 CHI conference on Human factors in computing systems. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300315",
      "doi": "10.1145/3290605.3300315"
    },
    {
      "text": "Cathy O’neil. 2016. Weapons of math destruction: How big data increases inequality and threatens democracy. Broadway books, USA.",
      "doi": ""
    },
    {
      "text": "Samir Passi and Steven Jackson. 2017. Data vision: Learning to see through algorithmic abstraction. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. ACM, New York, NY, USA, 2436–2447. https://doi.org/10.1145/2998181.2998331",
      "doi": "10.1145/2998181.2998331"
    },
    {
      "text": "Samir Passi and Steven J Jackson. 2018. Trust in data science: Collaboration, translation, and accountability in corporate data science projects. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–28. https://doi.org/10.1145/3274405",
      "doi": "10.1145/3274405"
    },
    {
      "text": "F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825–2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "James J Pierce, Ashley E Engelhardt, and Jung Youn Yim. 2008. Homeless HealthShare: connecting health professionals and the homeless. In CHI’08 Extended Abstracts on Human Factors in Computing Systems. ACM, New York, NY, USA, 3861–3866. https://doi.org/10.1145/1358628.1358944",
      "doi": "10.1145/1358628.1358944"
    },
    {
      "text": "Jennifer Pierre, Roderic Crooks, Morgan Currie, Britt Paris, and Irene Pasquetto. 2021. Getting Ourselves Together: Data-centered participatory design research & epistemic burden. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–11. https://doi.org/10.1145/3411764.3445103",
      "doi": "10.1145/3411764.3445103"
    },
    {
      "text": "Aida Rahmattalabi, Phebe Vayanos, Kathryn Dullerud, and Eric Rice. 2022. Learning Resource Allocation Policies from Observational Data with an Application to Homeless Services Delivery. In 2022 ACM Conference on Fairness, Accountability, and Transparency (Seoul, Republic of Korea) (FAccT ’22). Association for Computing Machinery, New York, NY, USA, 1240–1256. https://doi.org/10.1145/3531146.3533181",
      "doi": "10.1145/3531146.3533181"
    },
    {
      "text": "Nithya Sambasivan and Rajesh Veeraraghavan. 2022. The Deskilling of Domain Expertise in AI Development. In CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3491102.3517578",
      "doi": "10.1145/3491102.3517578"
    },
    {
      "text": "Abigail Santiago and Dr Anne Bowen. 2022. Investigating Bias in Resource Allocation for Homelessness Prevention and Intervention. In Practice and Experience in Advanced Research Computing. ACM, New York, NY, USA, 1–2. https://doi.org/10.1145/3491418.3535154",
      "doi": "10.1145/3491418.3535154"
    },
    {
      "text": "Devansh Saxena, Karla Badillo-Urquiola, Pamela J Wisniewski, and Shion Guha. 2020. A human-centered review of algorithms used within the US child welfare system. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376229",
      "doi": "10.1145/3313831.3376229"
    },
    {
      "text": "Devansh Saxena, Karla Badillo-Urquiola, Pamela J Wisniewski, and Shion Guha. 2021. A framework of high-stakes algorithmic decision-making for the public sector developed through a case study of child-welfare. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–41. https://doi.org/10.1145/3476089",
      "doi": "10.1145/3476089"
    },
    {
      "text": "Devansh Saxena, Erhardt Graeff, Shion Guha, EunJeong Cheon, Pedro Reynolds-Cuéllar, Dawn Walker, Christoph Becker, and Kenneth R Fleischmann. 2020. Collective Organizing and Social Responsibility at CSCW. In conference companion publication of the 2020 on computer supported cooperative work and social computing. ACM, New York, NY, USA, 503–509. https://doi.org/10.1145/3406865.3418593",
      "doi": "10.1145/3406865.3418593"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph’Jofish’ Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility. ACM, New York, NY, USA, 49–58. https://doi.org/10.1145/1094562.1094569",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Katherine H Shelton, Pamela J Taylor, Adrian Bonner, and Marianne Van Den Bree. 2009. Risk factors for homelessness: Evidence from a population-based study. Psychiatric Services 60, 4 (2009), 465–472. https://doi.org/10.1176/ps.2009.60.4.465",
      "doi": ""
    },
    {
      "text": "Marybeth Shinn, Andrew L Greer, Jay Bainbridge, Jonathan Kwon, and Sara Zuiderveen. 2013. Efficient targeting of homelessness prevention services for families. American journal of public health 103, S2 (2013), S324–S330. https://doi.org/10.2105/AJPH.2013.301468",
      "doi": ""
    },
    {
      "text": "Marybeth Shinn, Beth C Weitzman, Daniela Stojanovic, James R Knickman, Lucila Jimenez, Lisa Duchon, Susan James, and David H Krantz. 1998. Predictors of homelessness among families in New York City: from shelter request to housing stability.American Journal of Public Health 88, 11 (1998), 1651–1657. https://doi.org/10.2105/ajph.88.11.1651",
      "doi": ""
    },
    {
      "text": "Dilruba Showkat and Eric P. S. Baumer. 2022. “It’s Like the Value System in the Loop”: Domain Experts’ Values Expectations for NLP Automation. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 100–122. https://doi.org/10.1145/3532106.3533483",
      "doi": "10.1145/3532106.3533483"
    },
    {
      "text": "Dilruba Showkat, Shereen Bellamy, and Alexandra To. 2022. Fair and Trustworthy Welfare Systems: Rethinking Explainable AI in the Public Sector. In 2nd CHI HC-XAI Workshop. ACM, USA. https://doi.org/10.13140/RG.2.2.23902.72001",
      "doi": ""
    },
    {
      "text": "Stephen C Slota, Kenneth R Fleischmann, Min Kyung Lee, Sherri R Greenberg, Ishan Nigam, Tara Zimmerman, Sarah Rodriguez, and James Snow. 2022. A feeling for the data: How government and nonprofit stakeholders negotiate value conflicts in data science approaches to ending homelessness. Journal of the Association for Information Science and Technology n/a, n/a(2022). https://doi.org/10.1002/asi.24715",
      "doi": "10.1002/asi.24715"
    },
    {
      "text": "Angela D. R. Smith. 2021. There’s Hope in the System: Towards a Strength-Driven Design Approach to Support the Information Work of Sheltered Emerging Adults. Ph. D. Dissertation. Northwestern University.",
      "doi": ""
    },
    {
      "text": "Wonyoung So, Pranay Lohia, Rakesh Pimplikar, AE Hosoi, and Catherine D’Ignazio. 2022. Beyond Fairness: Reparative Algorithms to Address Historical Injustices of Housing Discrimination in the US. In 2022 ACM Conference on Fairness, Accountability, and Transparency. ACM, USA, 988–1004. https://doi.org/10.1145/3531146.3533160",
      "doi": "10.1145/3531146.3533160"
    },
    {
      "text": "Spencer Soper. 2021. Fired by Bot at Amazon: ‘It’s You Against the Machine’. https://www.bloomberg.com/news/features/2021-06-28/fired-by-bot-amazon-turns-to-machine-managers-and-workers-are-losing-out?sref=EJ3iffSv Accessed: 2021-06-30.",
      "doi": ""
    },
    {
      "text": "Clay Spinuzzi. 2005. The methodology of participatory design. Technical communication 52, 2 (2005), 163–174. https://www.proquest.com/scholarly-journals/methodology-participatory-design/docview/220962011/se-2",
      "doi": ""
    },
    {
      "text": "Angelika Strohmayer, Rob Comber, and Madeline Balaam. 2015. Exploring learning ecologies among people experiencing homelessness. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2275–2284. https://doi.org/10.1145/2702123.2702157",
      "doi": "10.1145/2702123.2702157"
    },
    {
      "text": "Maryam Tabar, Heesoo Park, Stephanie Winkler, Dongwon Lee, Anamika Barman-Adhikari, and Amulya Yadav. 2020. Identifying Homeless Youth At-Risk of Substance Use Disorder: Data-Driven Insights for Policymakers. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. ACM, New York, NY, USA, 3092–3100. https://doi.org/10.1145/3394486.3403360",
      "doi": "10.1145/3394486.3403360"
    },
    {
      "text": "Sanna J Thompson, Kimberly A Bender, Carol M Lewis, and Rita Watkins. 2008. Runaway and pregnant: Risk factors associated with pregnancy in a national sample of runaway/homeless female adolescents. Journal of Adolescent Health 43, 2 (2008), 125–132. https://doi.org/10.1016/j.jadohealth.2007.12.015",
      "doi": ""
    },
    {
      "text": "Halil Toros and Daniel Flaming. 2018. Prioritizing homeless assistance using predictive algorithms: An evidence-based approach. Cityscape 20, 1 (2018), 117–146. https://ssrn.com/abstract=3202479",
      "doi": ""
    },
    {
      "text": "Halil Toros, Daniel Flaming, and Patrick Burns. 2019. Early intervention to prevent persistent homelessness: Predictive models for identifying unemployed workers and young adults who become persistently homeless. Available at SSRN 3370634 n/a, n/a (2019). https://doi.org/10.2139/ssrn.3370634",
      "doi": ""
    },
    {
      "text": "Anh-Ton Tran, Ashley Boone, Christopher A. Le Dantec, and Carl DiSalvo. 2022. Careful Data Tinkering. Proc. ACM Hum.-Comput. Interact. 6, CSCW2, Article 431 (nov 2022), 29 pages. https://doi.org/10.1145/3555532",
      "doi": "10.1145/3555532"
    },
    {
      "text": "Kimberly A Tyler, Lisa A Kort-Butler, and Alexis Swendener. 2014. The effect of victimization, mental health, and protective factors on crime and illicit drug use among homeless young adults. Violence and victims 29, 2 (2014), 348–362. https://doi.org/10.1891/0886-6708.vv-d-12-00091r1",
      "doi": ""
    },
    {
      "text": "Blake VanBerlo, Matthew AS Ross, Jonathan Rivard, and Ryan Booker. 2021. Interpretable machine learning approaches to prediction of chronic homelessness. Engineering Applications of Artificial Intelligence 102 (2021), 104243. https://doi.org/10.1016/j.engappai.2021.104243",
      "doi": ""
    },
    {
      "text": "Michael Veale and Reuben Binns. 2017. Fairer machine learning in the real world: Mitigating discrimination without collecting sensitive data. Big Data & Society 4, 2 (2017), 2053951717743530. https://doi.org/10.1177/2053951717743530",
      "doi": ""
    },
    {
      "text": "Michael Veale, Max Van Kleek, and Reuben Binns. 2018. Fairness and accountability design needs for algorithmic support in high-stakes public sector decision-making. In Proceedings of the 2018 chi conference on human factors in computing systems. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174014",
      "doi": "10.1145/3173574.3174014"
    },
    {
      "text": "Amy Voida, Ellie Harmon, and Ban Al-Ani. 2011. Homebrew databases: Complexities of everyday information management in nonprofit organizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 915–924. https://doi.org/10.1145/1978942.1979078",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "Till Von Wachter, Marianne Bertrand, Harold Pollack, Janey Rountree, and Brian Blackwell. 2019. Predicting and preventing homelessness in Los Angeles. California Policy Lab and University of Chicago Poverty Lab n/a, n/a(2019). https://www.capolicylab.org/wp-content/uploads/2019/12/Predicting_and_Preventing_Homelessness_in_Los_Angeles.pdf",
      "doi": ""
    },
    {
      "text": "Donna L Washington, Elizabeth M Yano, James McGuire, Vivian Hines, Martin Lee, and Lillian Gelberg. 2010. Risk factors for homelessness among women veterans. Journal of health care for the poor and underserved 21, 1(2010), 82–91. https://doi.org/10.1353/hpu.0.0237",
      "doi": ""
    },
    {
      "text": "Bryan Wilder, Laura Onasch-Vera, Graham Diguiseppi, Robin Petering, Chyna Hill, Amulya Yadav, Eric Rice, and Milind Tambe. 2021. Clinical trial of an AI-augmented intervention for HIV prevention in youth experiencing homelessness. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 35. ACM, New York, NY, USA, 14948–14956.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock and Julie A Kientz. 2016. Research contributions in human-computer interaction. interactions 23, 3 (2016), 38–44. https://doi.org/10.1145/2907069",
      "doi": "10.1145/2907069"
    },
    {
      "text": "Jill Palzkill Woelfer and David G Hendry. 2011. Homeless young people and technology: ordinary interactions, extraordinary circumstances. interactions 18, 6 (2011), 70–73. https://doi.org/10.1145/2029976.2029994",
      "doi": "10.1145/2029976.2029994"
    },
    {
      "text": "Amulya Yadav, Roopali Singh, Nikolas Siapoutis, Anamika Barman-Adhikari, and Yu Liang. 2021. Optimal and non-discriminative rehabilitation program design for opioid addiction among homeless youth. In Proceedings of the Twenty-Ninth International Conference on International Joint Conferences on Artificial Intelligence. ACM, New York, NY, USA, 4389–4395. https://doi.org/10.24963/ijcai.2020/605",
      "doi": ""
    },
    {
      "text": "Amy X Zhang, Michael Muller, and Dakuo Wang. 2020. How do data science workers collaborate? roles, workflows, and tools. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–23. https://doi.org/10.1145/3392826",
      "doi": "10.1145/3392826"
    },
    {
      "text": "Haiyi Zhu, Bowen Yu, Aaron Halfaker, and Loren Terveen. 2018. Value-sensitive algorithm design: Method, case study, and lessons. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–23. https://doi.org/10.1145/3274463",
      "doi": "10.1145/3274463"
    }
  ]
}