{
  "doi": "10.1145/3544548.3580745",
  "title": "CoilCAM: Enabling Parametric Design for Clay 3D Printing Through an Action-Oriented Toolpath Programming System",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Clay 3D printing provides the benefits of digital fabrication automation and reconfigurability through a method that evokes manual clay coiling. Existing design technologies for clay 3D printing reflect the general 3D printing workflow in which solid forms are designed in CAD and then converted into a toolpath. In contrast, in hand-coiling, form is determined by the actions taken by the artist’s hands through space in response to the material. We theorized that an action-oriented approach for clay 3D printing could allow creators to design digital fabrication toolpaths that reflect clay material properties. We present CoilCAM, a domain-specific CAM programming system that supports the integrated generation of parametric forms and surface textures through mathematically defined toolpath operations. We developed CoilCAM in collaboration with ceramics professionals and evaluated CoilCAM’s relevance to manual ceramics by reinterpreting hand-made ceramic vessels. This process revealed the importance of iterative variation and embodied experience in action-oriented workflows.",
  "tags": [
    "Clay 3D Printing",
    "Computer-Aided Machining",
    "Artist Residency",
    "Digital Fabrication"
  ],
  "authors": [
    {
      "name": "Samuelle Bourgault",
      "institution": "Media Arts and Technology, University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701248",
      "orcid": "0000-0001-7085-8326"
    },
    {
      "name": "Pilar Wiley",
      "institution": "Pilar Wiley Studio, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780932",
      "orcid": "0000-0002-7326-1944"
    },
    {
      "name": "Avi Farber",
      "institution": "Avi Farber Studio, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778899",
      "orcid": "0000-0002-8976-0887"
    },
    {
      "name": "Jennifer Jacobs",
      "institution": "Media Arts and Technology, University of California Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556713956",
      "orcid": "0000-0001-8666-8527"
    }
  ],
  "references": [
    {
      "text": "Kristina Andersen, Ron Wakkary, Laura Devendorf, and Alex McLean. 2019. Digital crafts-machine-ship: creative collaborations with machines. Interactions 27, 1 (Dec. 2019), 30–35. https://doi.org/10.1145/3373644",
      "doi": "10.1145/3373644"
    },
    {
      "text": "Mario Cucinella Architects. 2021. TECLA house. https://www.mcarchitects.it/project/tecla-2",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch and Stephanie Mueller. 2017. Personal Fabrication. Now Publishers. https://books.google.com/books?id=3UL_vQEACAAJ",
      "doi": ""
    },
    {
      "text": "Jane Bennett. 2010. Vibrant Matter: A Political Ecology of Things. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Sarah Rosalena Brady. 2020. transposing a form. https://www.sarahrosalena.com/transposing-a-form",
      "doi": ""
    },
    {
      "text": "Leah Buechley and Franklin Pezutti-Dyer. 2022. Extruder Turtle. https://handandmachine.org/index.php/2020/10/23/extruder-turtle/",
      "doi": ""
    },
    {
      "text": "Amy Cheatle and Steven J. Jackson. 2015. Digital Entanglements: Craft, Computation and Collaboration in Fine Art Furniture Production. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, Vancouver BC Canada, 958–968. https://doi.org/10.1145/2675133.2675291",
      "doi": "10.1145/2675133.2675291"
    },
    {
      "text": "Paulo J.S. Cruz, Ulrich Knaack, Bruno Figueiredo, and Dennis de Witte. 2017. Ceramic 3D printing–The future of brick architecture. In Proceedings of IASS Annual Symposia, Vol. 2017. International Association for Shell and Spatial Structures (IASS), 1–10.",
      "doi": ""
    },
    {
      "text": "Bryan Czibesz. 2022. Bryan Czibesz Curves Stacks Pottery Collection. https://bryanczibesz.com/",
      "doi": ""
    },
    {
      "text": "Scott Davidson. 2007. Grasshopper. http://www.grasshopper3d.com.",
      "doi": ""
    },
    {
      "text": "Department of Asian Art. 2002. Jomon Culture (ca. 10,500–ca. 300 B.C.). https://www.metmuseum.org/toah/hd/jomo/hd_jomo.htm",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Timea Tihanyi. 2019. ListeningCups: A Case of Data Tactility and Data Stories. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 147–160. https://doi.org/10.1145/3322276.3323694",
      "doi": "10.1145/3322276.3323694"
    },
    {
      "text": "Laura Devendorf, Katya Arquilla, Sandra Wirtanen, Allison Anderson, and Steven Frost. 2020. Craftspeople as Technical Collaborators: Lessons Learned through an Experimental Weaving Residency. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376820",
      "doi": "10.1145/3313831.3376820"
    },
    {
      "text": "Laura Devendorf and Daniela K. Rosner. 2017. Beyond Hybrids: Metaphors and Margins in Design. In Proceedings of the 2017 Conference on Designing Interactive Systems(DIS ’17). Association for Computing Machinery, New York, NY, USA, 995–1000. https://doi.org/10.1145/3064663.3064705",
      "doi": "10.1145/3064663.3064705"
    },
    {
      "text": "Laura Devendorf and Kimiko Ryokai. 2015. Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, Seoul, Republic of Korea, 2477–2486. https://doi.org/10.1145/2702123.2702547",
      "doi": "10.1145/2702123.2702547"
    },
    {
      "text": "Nir Dick, Naama Glauber, Adi Yehezkeli, Moran Mizrahi, Shani Reches, Maiayn Ben-Yona, Anna Carmi, and Amit Zoran. 2018. Design with Minimal Intervention: Drawing with Light and Cracks. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). Association for Computing Machinery, New York, NY, USA, 1107–1120. https://doi.org/10.1145/3196709.3196814",
      "doi": "10.1145/3196709.3196814"
    },
    {
      "text": "Shelby Doyle, Erin Hunt, and Kelly Devitt. 2018. WAFT. https://ccl.design.iastate.edu/2018/11/04/waft/",
      "doi": ""
    },
    {
      "text": "Emerging Objects. 2020. POTTERWARE. https://www.potterware.com/",
      "doi": ""
    },
    {
      "text": "Matthew Flagg and James M. Rehg. 2006. Projector-guided painting. In Proceedings of the 19th annual ACM symposium on User interface software and technology(UIST ’06). Association for Computing Machinery, New York, NY, USA, 235–244. https://doi.org/10.1145/1166253.1166290",
      "doi": "10.1145/1166253.1166290"
    },
    {
      "text": "Jacob Foran and Phirak Suon. 2022. ForanSuon Porcelain Collection. https://www.foransuon.com/porcelain-collection",
      "doi": ""
    },
    {
      "text": "Jack Forman, Mustafa Doga Dogan, Hamilton Forsythe, and Hiroshi Ishii. 2020. DefeXtiles: 3D Printing Quasi-Woven Fabric via Under-Extrusion. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, 1222–1233. https://doi.org/10.1145/3379337.3415876",
      "doi": "10.1145/3379337.3415876"
    },
    {
      "text": "Frikk Fossdal, Rogardt Heldal, and Nadya Peek. 2021. Interactive Digital Fabrication Machine Control Directly Within a CAD Environment. In Symposium on Computational Fabrication(SCF ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3485114.3485120",
      "doi": "10.1145/3485114.3485120"
    },
    {
      "text": "Erich Gamma, Richard Helm, Ralph Johnson, and John Vlissides. 1994. Design Patterns: Elements of Reusable Object-Oriented Software. Pearson Education.",
      "doi": "10.5555/186897"
    },
    {
      "text": "Kathleen Hajash, Bjorn Sparrman, Christophe Guberan, Jared Laucks, and Skylar Tibbits. 2017. Large-Scale Rapid Liquid Printing. 3D Printing and Additive Manufacturing 4, 3 (Sept. 2017), 123–132. https://doi.org/10.1089/3dp.2017.0037",
      "doi": ""
    },
    {
      "text": "Ryan Hoover. 2016. Xylinius. http://www.ryanhoover.org/rd/xylinus.php",
      "doi": ""
    },
    {
      "text": "Melody Horn, Amy Traylor, and Leah Buechley. 2022. Slabforge: Design Software for Slab-Based Ceramics. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3491102.3517663",
      "doi": "10.1145/3491102.3517663"
    },
    {
      "text": "Tim Ingold. 2010. The Textility of Making. https://doi.org/10.1093/cje/bep042",
      "doi": ""
    },
    {
      "text": "Jennifer Jacobs, Joel Brandt, Radomír Mech, and Mitchel Resnick. 2018. Extending Manual Drawing Practices with Artist-Centric Programming Tools. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174164",
      "doi": "10.1145/3173574.3174164"
    },
    {
      "text": "Jennifer Jacobs and Leah Buechley. 2013. Codeable objects: computational design and digital fabrication for novice programmers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 1589–1598. https://doi.org/10.1145/2470654.2466211",
      "doi": "10.1145/2470654.2466211"
    },
    {
      "text": "Jennifer Jacobs, David Mellis, Amit Zoran, Cesar Torres, Joel Brandt, and Theresa Jean Tanenbaum. 2016. Digital Craftsmanship: HCI Takes on Technology as an Expressive Medium. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems. ACM, Brisbane QLD Australia, 57–60. https://doi.org/10.1145/2908805.2913018",
      "doi": "10.1145/2908805.2913018"
    },
    {
      "text": "Jonathan Keep. 2022. Jonathan Keep. Home Page. http://www.keep-art.co.uk/",
      "doi": ""
    },
    {
      "text": "Shiran Magrisso, Moran Mizrahi, and Amit Zoran. 2018. Digital Joinery For Hybrid Carpentry. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–11. https://doi.org/10.1145/3173574.3173741",
      "doi": "10.1145/3173574.3173741"
    },
    {
      "text": "MicroPlus Technologies, Inc. 2022. Clayon. https://www.clayontec.com/en/",
      "doi": ""
    },
    {
      "text": "Ashish Mohite, Mariia Kochneva, and Toni Kotnik. 2018. Material Agency in CAM of Undesignable Textural Effects - The study of correlation between material properties and textural formation engendered by experimentation with G-code of 3D printer. https://aaltodoc.aalto.fi:443/handle/123456789/34987",
      "doi": ""
    },
    {
      "text": "Michael Muller and Allison Druin. 2002. Participatory Design: The Third Space in HCI. Handbook of HCI (Jan. 2002).",
      "doi": ""
    },
    {
      "text": "Brad A. Myers. 1990. Taxonomies of visual programming and program visualization. Journal of Visual Languages & Computing 1, 1 (March 1990), 97–123. https://doi.org/10.1016/S1045-926X(05)80036-9",
      "doi": "10.1016/S1045-926X%2805%2980036-9"
    },
    {
      "text": "David F. Noble. 1984. Forces of production: a social history of industrial automation (1st ed.). Knopf, New York.",
      "doi": ""
    },
    {
      "text": "Huaishu Peng, Rundong Wu, Steve Marschner, and François Guimbretière. 2016. On-The-Fly Print: Incremental Printing While Modelling. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 887–896. https://doi.org/10.1145/2858036.2858106",
      "doi": "10.1145/2858036.2858106"
    },
    {
      "text": "Franklin Pezutti-Dyer and Leah Buechley. 2022. Extruder-Turtle: A Library for 3D Printing Delicate, Textured, and Flexible Objects. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’22). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3490149.3501312",
      "doi": "10.1145/3490149.3501312"
    },
    {
      "text": "David Pye. 1971. The nature and art of workmanship. London, Studio Vista; New York, Van Nostrand Reinhold. http://archive.org/details/natureartofwor00pyed",
      "doi": ""
    },
    {
      "text": "Ronald Rael and Virginia San Fratello. 2017. Clay Bodies: Crafting the Future with 3D Printing. Architectural Design 87, 6 (2017), 92–97. https://doi.org/10.1002/ad.2243 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/ad.2243",
      "doi": ""
    },
    {
      "text": "Roy Shilkrot, Pattie Maes, Joseph A. Paradiso, and Amit Zoran. 2015. Augmented Airbrush for Computer Aided Painting (CAP). ACM Transactions on Graphics 34, 2 (March 2015), 19:1–19:11. https://doi.org/10.1145/2699649",
      "doi": "10.1145/2699649"
    },
    {
      "text": "Blair Subbaraman and Nadya Peek. 2022. p5.fab: Direct Control of Digital Fabrication Machines from a Creative Coding Environment. In Designing Interactive Systems Conference(DIS ’22). Association for Computing Machinery, New York, NY, USA, 1148–1161. https://doi.org/10.1145/3532106.3533496",
      "doi": "10.1145/3532106.3533496"
    },
    {
      "text": "Yasaman Tahouni, Tiffany Cheng, Dylan Wood, Renate Sachse, Rebecca Thierer, Manfred Bischoff, and Achim Menges. 2020. Self-shaping Curved Folding: A 4D-printing method for fabrication of self-folding curved crease structures. In Symposium on Computational Fabrication(SCF ’20). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3424630.3425416",
      "doi": "10.1145/3424630.3425416"
    },
    {
      "text": "Haruki Takahashi, Parinya Punpongsanon, and Jeeeun Kim. 2020. Programmable Filament: Printed Filaments for Multi-material 3D Printing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. ACM, Virtual Event USA, 1209–1221. https://doi.org/10.1145/3379337.3415863",
      "doi": "10.1145/3379337.3415863"
    },
    {
      "text": "Timea Tihanyi. 2020. Textile Traditions. https://www.timeatihanyi.com/textile-traditions",
      "doi": ""
    },
    {
      "text": "Hannah Twigg-Smith, Jasper Tran O’Leary, and Nadya Peek. 2021. Tools, Tricks, and Hacks: Exploring Novel Digital Fabrication Workflows on #PlotterTwitter. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3411764.3445653",
      "doi": "10.1145/3411764.3445653"
    },
    {
      "text": "Unfold Design Studio. 2009. Ceramic 3d Printing. http://unfold.be/pages/ceramic-3d-printing.html",
      "doi": ""
    },
    {
      "text": "Olivier van Herpt. 2022. Olivier van Herpt. https://oliviervanherpt.com",
      "doi": ""
    },
    {
      "text": "Claire Warnier, Dries Verbruggen, Sven Ehmann, and Robert Klanten. 2014. Printing Things: Visions and Essentials for 3D Printing. Prestel Pub.",
      "doi": ""
    },
    {
      "text": "Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2010. Interactive fabrication: new interfaces for digital fabrication. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction(TEI ’11). Association for Computing Machinery, New York, NY, USA, 69–72. https://doi.org/10.1145/1935701.1935716",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "Humphrey Yang, Danli Luo, Kuanren Qian, and Lining Yao. 2021. Freeform Fabrication of Fluidic Edible Materials. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3411764.3445097",
      "doi": "10.1145/3411764.3445097"
    },
    {
      "text": "Clement Zheng and Michael Nitsche. 2017. Combining Practices in Craft and Design. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’17). Association for Computing Machinery, New York, NY, USA, 331–340. https://doi.org/10.1145/3024969.3024973",
      "doi": "10.1145/3024969.3024973"
    },
    {
      "text": "John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An analysis and critique of Research through Design: towards a formalization of a research approach. In Proceedings of the 8th ACM Conference on Designing Interactive Systems(DIS ’10). Association for Computing Machinery, New York, NY, USA, 310–319. https://doi.org/10.1145/1858171.1858228",
      "doi": "10.1145/1858171.1858228"
    },
    {
      "text": "Amit Zoran and Leah Buechley. 2013. Hybrid Reassemblage: An Exploration of Craft, Digital Fabrication and Artifact Uniqueness. Leonardo 46, 1 (Feb. 2013), 4–10. https://doi.org/10.1162/LEON_a_00477",
      "doi": ""
    },
    {
      "text": "Amit Zoran, Roy Shilkrot, Suranga Nanyakkara, and Joseph Paradiso. 2014. The Hybrid Artisans: A Case Study in Smart Tools. ACM Transactions on Computer-Human Interaction 21, 3 (June 2014), 15:1–15:29. https://doi.org/10.1145/2617570",
      "doi": "10.1145/2617570"
    }
  ]
}