{
  "doi": "10.1145/3544548.3581501",
  "title": "“Awesomely freaky!” The impact of type on children's social-emotional perceptions of virtual reality characters",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2023,
  "badges": [],
  "abstract": "While VR, through decades of research, has shown to successfully improve young children's lives, more research needs to examine the appropriateness of VR for children, including its design. The type of character in combination with the perceptual realism of virtual reality (VR) may influence children's perceptions of VR experiences. A within-participant experiment examined 5- to 9-year-old children's (N = 25) perceptions of three different character types in VR (i.e., human, animal, and anthropomorphized creature) based on their level of social realism. Results showed that character type impacted children's (a) social-emotional descriptions of the VR experience, (b) if VR's realism was an asset or a hindrance, and (c) primed thoughts about fantasy versus reality. However, children experienced the embodiment and personification of the characters similarly across all character types. Finally, children recalled the salient aspects of the characters they remembered and identified elements to improve the VR characters’ design.",
  "authors": [
    {
      "name": "Jakki O. Bailey",
      "institution": "School of Information, University of Texas at Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659755705",
      "orcid": "0000-0002-3506-2362"
    },
    {
      "name": "Isabella Schloss",
      "institution": "School of Information, University of Texas at Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659768602",
      "orcid": "0000-0002-3764-2299"
    }
  ],
  "references": [
    {
      "text": "Linda F. Alwitt, Daniel R. Anderson, Elizabeth Pugzles Lorch, and Stephen R. Levin. 1980. Preschool children's visual attention to attributes of television. Human Communication Research 7, 1 (September 1980), 52–67. DOI:https://doi.org/10.1111/j.1468-2958.1980.tb00550.x",
      "doi": ""
    },
    {
      "text": "Naser Asl Aminabadi, Leila Erfanparast, Azin Sohrabi, Sina Ghertasi Oskouei, and Armaghan Naghili. 2012. The impact of virtual reality distraction on pain and anxiety during dental treatment in 4-6 year-old children: A randomized controlled clinical trial. Journal of Dental Research, Dental Clinics, Dental Prospects 6, 4 (November 2012), 117–124.",
      "doi": ""
    },
    {
      "text": "Daniel R. Anderson and Heather L. Kirkorian. 2013. Attention and television. In Psychology of Entertainment, Jennings Bryant and Peter Vorderer (eds.). Routledge, Mahwah, NJ, 35–51.",
      "doi": ""
    },
    {
      "text": "Paola Araiza-Alba, Therese Keane, Won Sun Chen, and Jordy Kaufman. 2021. Immersive virtual reality as a tool to learn problem-solving skills. Computers & Education 164, (April 2021), 104121. DOI:https://doi.org/10.1016/j.compedu.2020.104121",
      "doi": ""
    },
    {
      "text": "Jakki O. Bailey, Jeremy N. Bailenson, Jelena Obradović, and Naomi R. Aguiar. 2019. Virtual reality's effect on children's inhibitory control, social compliance, and sharing. Journal of Applied Developmental Psychology 64, (July 2019), 101052. DOI:https://doi.org/10.1016/j.appdev.2019.101052",
      "doi": ""
    },
    {
      "text": "Corey J. Bohil, Bradly Alicea, and Frank A. Biocca. 2011. Virtual reality in neuroscience research and therapy. Nat Rev Neurosci 12, 12 (December 2011), 752–762. DOI:https://doi.org/10.1038/nrn3122",
      "doi": ""
    },
    {
      "text": "Bradley J. Bond and Sandra L. Calvert. 2014. A model and measure of US parents’ perceptions of young children's parasocial relationships. Journal of Children and Media 8, 3 (July 2014), 286–304. DOI:https://doi.org/10.1080/17482798.2014.890948",
      "doi": ""
    },
    {
      "text": "D. A. Bowman and R. P. McMahan. 2007. Virtual reality: How much immersion is enough? Computer 40, 7 (July 2007), 36–43. DOI:https://doi.org/10.1109/MC.2007.257",
      "doi": "10.1109/MC.2007.257"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (January 2006), 77–101. DOI:https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Kimberly A. Brink, Kurt Gray, and Henry M. Wellman. 2019. Creepiness creeps in: Uncanny valley feelings are acquired in childhood. Child Development 90, 4 (2019), 1202–1214. DOI:https://doi.org/10.1111/cdev.12999",
      "doi": ""
    },
    {
      "text": "Laura L. Brock, Sara E. Rimm-Kaufman, Lori Nathanson, and Kevin J. Grimm. 2009. The contributions of ‘hot’ and ‘cool’ executive function to children's academic achievement, learning-related behaviors, and engagement in kindergarten. Early Childhood Research Quarterly 24, 3 (rd 2009), 337–349. DOI:https://doi.org/10.1016/j.ecresq.2009.06.001",
      "doi": ""
    },
    {
      "text": "Kaitlin L. Brunick, Marisa M. Putnam, Lauren E. McGarry, Melissa N. Richards, and Sandra L. Calvert. 2016. Children's future parasocial relationships with media characters: The age of intelligent characters. Journal of Children and Media 10, 2 (April 2016), 181–190. DOI:https://doi.org/10.1080/17482798.2015.1127839",
      "doi": ""
    },
    {
      "text": "Robin Burgess-Limerick, Mark Mon-Williams, and Vanessa L. Coppard. 2000. Visual display height. Hum Factors 42, 1 (March 2000), 140–150. DOI:https://doi.org/10.1518/001872000779656598",
      "doi": ""
    },
    {
      "text": "Lénaïc B. Cadet and Hanna Chainay. 2021. How preadolescents and adults remember and experience virtual reality: The role of avatar incarnation, emotion, and sense of presence. International Journal of Child-Computer Interaction 29, (September 2021), 100299. DOI:https://doi.org/10.1016/j.ijcci.2021.100299",
      "doi": "10.1016/j.ijcci.2021.100299"
    },
    {
      "text": "Lénaïc B. Cadet, Emanuelle Reynaud, and Hanna Chainay. 2022. Memory for a virtual reality experience in children and adults according to image quality, emotion, and sense of presence. Virtual Real 26, 1 (2022), 55–75. DOI:https://doi.org/10.1007/s10055-021-00537-y",
      "doi": "10.1007/s10055-021-00537-y"
    },
    {
      "text": "Sandra L. Calvert, Marisa M. Putnam, Naomi R. Aguiar, Rebecca M. Ryan, Charlotte A. Wright, Yi Hui Angella Liu, and Evan Barba. 2020. Young children's mathematical learning from intelligent characters. Child Development 91, 5 (2020), 1491–1508. DOI:https://doi.org/10.1111/cdev.13341",
      "doi": ""
    },
    {
      "text": "James J. Cummings and Jeremy N. Bailenson. 2016. How immersive is enough? A meta-analysis of the effect of immersive technology on user presence. Media Psychology 19, 2 (April 2016), 272–309. DOI:https://doi.org/10.1080/15213269.2015.1015740",
      "doi": ""
    },
    {
      "text": "Simon Davis, Keith Nesbitt, and Eugene Nalivaiko. 2014. A systematic review of cybersickness. In Proceedings of the 2014 Conference on Interactive Entertainment (IE2014), Association for Computing Machinery, Newcastle, NSW, Australia, 1–9. DOI:https://doi.org/10.1145/2677758.2677780",
      "doi": "10.1145/2677758.2677780"
    },
    {
      "text": "Robin Eijlers, Elisabeth M. W. J. Utens, Lonneke M. Staals, Pieter F. A. de Nijs, Johan M. Berghmans, René M. H. Wijnen, Manon H. J. Hillegers, Bram Dierckx, and Jeroen S. Legerstee. 2019. Systematic review and meta-analysis of virtual reality in pediatrics: Effects on pain and anxiety. Anesth Analg 129, 5 (November 2019), 1344–1353. DOI:https://doi.org/10.1213/ANE.0000000000004165",
      "doi": ""
    },
    {
      "text": "James H. Gray, Emily Reardon, and Jennifer A. Kotler. 2017. Designing for parasocial relationships and learning: Linear video, interactive media, and artificial intelligence. In Proceedings of the 2017 Conference on Interaction Design and Children, ACM, Stanford California USA, 227–237. DOI:https://doi.org/10.1145/3078072.3079736",
      "doi": "10.1145/3078072.3079736"
    },
    {
      "text": "Lynsey Gregg and Nicholas Tarrier. 2007. Virtual reality in mental health: A review of the literature. Social Psychiatry & Psychiatric Epidemiology 42, 5 (May 2007), 343–354.",
      "doi": ""
    },
    {
      "text": "Nic Healey. Mattel View-Master review: Family-friendly augmented and virtual reality wrapped in a retro brand. CNET. Retrieved December 3, 2022 from https://www.cnet.com/reviews/mattel-new-view-master-review/",
      "doi": ""
    },
    {
      "text": "Raegan M. Hoeft, Jennifer Vogel, and Clint A. Bowers. 2003. Kids get sick too: A proposed child simulator sickness questionnaire. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 47, 20 (October 2003), 2137–2141. DOI:https://doi.org/10.1177/154193120304702013",
      "doi": ""
    },
    {
      "text": "Aletha C. Huston, John C. Wright, Ellen Wartella, Mabel L. Rice, Bruce A. Watkins, Toni Campbell, and Richard Potts. 1981. Communicating more than content: Formal features of children's television programs. Journal of Communication 31, 3 (1981), 32–48. DOI:https://doi.org/10.1111/j.1460-2466.1981.tb00426.x",
      "doi": ""
    },
    {
      "text": "Jari Kätsyri, Klaus Förger, Meeri Mäkäräinen, and Tapio Takala. 2015. A review of empirical evidence on different uncanny valley hypotheses: Support for perceptual mismatch as one road to the valley of eeriness. Front. Psychol. 6, (2015). DOI:https://doi.org/10.3389/fpsyg.2015.00390",
      "doi": ""
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The International Journal of Aviation Psychology 3, 3 (July 1993), 203–220. DOI:https://doi.org/10.1207/s15327108ijap0303_3",
      "doi": ""
    },
    {
      "text": "Peter Kozulin, Shelly L. Ames, and Neville A. McBrien. 2009. Effects of a head-mounted display on the oculomotor system of children. Optometry and Vision Science 86, 7 (July 2009), 845–856. DOI:https://doi.org/10.1097/OPX.0b013e3181adff42",
      "doi": ""
    },
    {
      "text": "Annie Lang, Kulijinder Dhillon, and Qingwen Dong. 1995. The effects of emotional arousal and valence on television viewers’ cognitive capacity and memory. Journal of Broadcasting & Electronic Media 39, 3 (June 1995), 313–327. DOI:https://doi.org/10.1080/08838159509364309",
      "doi": ""
    },
    {
      "text": "Joseph J. LaViola. 2000. A discussion of cybersickness in virtual environments. SIGCHI Bull. 32, 1 (January 2000), 47–56. DOI:https://doi.org/10.1145/333329.333344",
      "doi": "10.1145/333329.333344"
    },
    {
      "text": "Karl F. MacDorman, Robert D. Green, Chin-Chang Ho, and Clinton T. Koch. 2009. Too real for comfort? Uncanny responses to computer generated faces. Computers in Human Behavior 25, 3 (May 2009), 695–710. DOI:https://doi.org/10.1016/j.chb.2008.12.026",
      "doi": "10.1016/j.chb.2008.12.026"
    },
    {
      "text": "Masahiro Mori, Karl F. MacDorman, and Norri Kageki. 2012. The uncanny valley [from the field]. IEEE Robotics Automation Magazine 19, 2 (June 2012), 98–100. DOI:https://doi.org/10.1109/MRA.2012.2192811",
      "doi": ""
    },
    {
      "text": "Charles Neveu, Ted Blackmon, and Lawrence Stark. 1998. Evaluation of the effects of a head-mounted display on ocular accommodation. Presence: Teleoperators and Virtual Environments 7, 3 (June 1998), 278–289. DOI:https://doi.org/10.1162/105474698565712",
      "doi": "10.1162/105474698565712"
    },
    {
      "text": "Sarah Parsons. 2015. Learning to work together: Designing a multi-user virtual reality game for social collaboration and perspective-taking for children with autism. International Journal of Child-Computer Interaction 6, (December 2015), 28–38. DOI:https://doi.org/10.1016/j.ijcci.2015.12.002",
      "doi": "10.1016/j.ijcci.2015.12.002"
    },
    {
      "text": "Lukasz Piwek, Lawrie S. McKay, and Frank E. Pollick. 2014. Empirical evaluation of the uncanny valley hypothesis fails to confirm the predicted effect of motion. Cognition 130, 3 (March 2014), 271–277. DOI:https://doi.org/10.1016/j.cognition.2013.11.001",
      "doi": ""
    },
    {
      "text": "R Core Team. 2015. R: A language and environment for statistical computing. Retrieved from http://www.R-project.org/",
      "doi": ""
    },
    {
      "text": "Margaret Rhodes. 2016. McDonald's is transforming happy meal boxes into vr headsets. WIRED. Retrieved from https://www.wired.com/2016/03/mcdonalds-transforming-happy-meal-boxes-vr-headsets/",
      "doi": ""
    },
    {
      "text": "Sarah F. Rosaen and Jayson L. Dibble. 2008. Investigating the relationships among child's age, parasocial interactions, and the social realism of favorite television characters. Communication Research Reports 25, 2 (March 2008), 145–154. DOI:https://doi.org/10.1080/08824090802021806",
      "doi": ""
    },
    {
      "text": "Kimiko Ryokai, C. Vaucelle, and Justine Cassell. 2003. Virtual peers as partners in storytelling and literacy learning. Journal of Computer Assisted Learning 19, 2 (2003), 195–208. DOI:https://doi.org/10.1046/j.0266-4909.2003.00020.x",
      "doi": ""
    },
    {
      "text": "Anastasia Schmitz, Richard Joiner, and Paul Golds. 2020. Is seeing believing? The effects of virtual reality on young children's understanding of possibility and impossibility. Journal of Children and Media 14, 2 (April 2020), 158–172. DOI:https://doi.org/10.1080/17482798.2019.1684964",
      "doi": ""
    },
    {
      "text": "Kathryn Y. Segovia and Jeremy N. Bailenson. 2009. Virtually true: Children's acquisition of false memories in virtual reality. Media Psychology 12, 4 (November 2009), 371–393. DOI:https://doi.org/10.1080/15213260903287267",
      "doi": ""
    },
    {
      "text": "Megan Strait, Heather L. Urry, and Paul Muentener. 2019. Children's responding to humanlike agents reflects an uncanny valley. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI), 506–515. DOI:https://doi.org/10.1109/HRI.2019.8673088",
      "doi": ""
    },
    {
      "text": "Andrea Tartaro and Justine Cassell. 2008. Playing with virtual peers: Bootstrapping contingent discourse in children with autism. In Proceedings of the 8th International Conference on International Conference for the Learning Sciences - Volume 2 (ICLS’08), International Society of the Learning Sciences, 382–389. Retrieved April 24, 2019 from http://dl.acm.org/citation.cfm?id=1599871.1599919",
      "doi": ""
    },
    {
      "text": "Angela Tinwell and Robin J. S. Sloan. 2014. Children's perception of uncanny human-like virtual characters. Computers in Human Behavior 36, (July 2014), 286–296. DOI:https://doi.org/10.1016/j.chb.2014.03.073",
      "doi": "10.1016/j.chb.2014.03.073"
    },
    {
      "text": "Siao Hui Toh, Pieter Coenen, Erin K. Howie, and Leon M. Straker. 2017. The associations of mobile touch screen device use with musculoskeletal symptoms and exposures: A systematic review. PLoS One 12, 8 (August 2017). DOI:https://doi.org/10.1371/journal.pone.0181220",
      "doi": ""
    },
    {
      "text": "Riva Tukachinsky, Nathan Walter, and Camille J Saucier. 2020. Antecedents and effects of parasocial relationships: A meta-analysis. Journal of Communication 70, 6 (December 2020), 868–894. DOI:https://doi.org/10.1093/joc/jqaa034",
      "doi": ""
    },
    {
      "text": "James W. Varni, Michael Seid, and Paul S. Kurtin. 2001. PedsQLTM 4.0: Reliability and validity of the pediatric quality of life inventoryTM version 4.0 generic core scales in healthy and patient populations. Medical Care 39, 8 (2001), 800–812.",
      "doi": ""
    },
    {
      "text": "Andrea Stevenson Won, Jakki Bailey, Jeremy Bailenson, Christine Tataru, Isabel A. Yoon, and Brenda Golianu. 2017. Immersive virtual reality for pediatric pain. Children 4, 7 (July 2017), 52. DOI:https://doi.org/10.3390/children4070052",
      "doi": ""
    },
    {
      "text": "Jacqueline D. Woolley and Maliki E. Ghossainy. 2013. Revisiting the fantasy–reality distinction: Children as naïve skeptics. Child Dev 84, 5 (September 2013), 1496–1510. DOI:https://doi.org/10.1111/cdev.12081",
      "doi": ""
    },
    {
      "text": "Dylan Yamada-Rice, Faisal Mushtaq, Adam Woodgate, D. Bosmans, A. Douthwaite, I. Douthwaite, W. Harris, R. Holt, D. Kleeman, J. Marsh, E. Milovidov, M. Mon Williams, B. Parry, A. Riddler, P. Robinson, D. Rodrigues, S. Thompson, and S. Whitley. 2017. Children and virtual reality: Emerging possibilities and challenges. Dubit. Retrieved December 3, 2022 from http://digilitey.eu/wp-content/uploads/2015/09/CVR-Final-PDF-reduced-size.pdf",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Xin Gao, Allison Marie Hishikawa, Alexis Lim, Laura Meng, Romaine Flor Ofiana, Justin Park, and Alexis Hiniker. 2019. Laughing is scary, but farting is cute: A conceptual model of children's perspectives of creepy technologies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–15. DOI:https://doi.org/10.1145/3290605.3300303",
      "doi": "10.1145/3290605.3300303"
    }
  ]
}