{
  "doi": "10.1145/3544548.3581532",
  "title": "Exploring Chart Question Answering for Blind and Low Vision Users",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Data visualizations can be complex or involve numerous data points, making them impractical to navigate using screen readers alone. Question answering (QA) systems have the potential to support visualization interpretation and exploration without overwhelming blind and low vision (BLV) users. To investigate if and how QA systems can help BLV users in working with visualizations, we conducted a Wizard of Oz study with 24 BLV people where participants freely posed queries about four visualizations. We collected 979 queries and mapped them to popular analytic task taxonomies. We found that retrieving value and finding extremum were the most common tasks, participants often made complex queries and used visual references, and the data topic notably influenced the queries. We compile a list of design considerations for accessible chart QA systems and make our question corpus publicly available to guide future research and development.",
  "tags": [
    "Question Answering",
    "Accessibility",
    "Design Considerations",
    "Visualization",
    "Human-Subjects Qualitative Studies"
  ],
  "authors": [
    {
      "name": "Jiho Kim",
      "institution": "Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780225",
      "orcid": "0000-0002-2289-0927"
    },
    {
      "name": "Arjun Srinivasan",
      "institution": "Tableau Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196818",
      "orcid": "0000-0001-8901-1256"
    },
    {
      "name": "Nam Wook Kim",
      "institution": "Computer Science, Boston College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701264",
      "orcid": "0000-0003-4899-6671"
    },
    {
      "name": "Yea-Seul Kim",
      "institution": "Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240335",
      "orcid": "0000-0003-1854-1537"
    }
  ],
  "references": [
    {
      "text": "Asma Ben Abacha and Pierre Zweigenbaum. 2015. MEANS: A medical question-answering system combining NLP techniques and semantic Web technologies. Information processing & management 51, 5 (2015), 570–594.",
      "doi": ""
    },
    {
      "text": "Shanza Abbas, Muhammad Umair Khan, Scott Uk-Jin Lee, Asad Abbas, and Ali Kashif Bashir. 2022. A Review of NLIDB with Deep Learning: Findings, Challenges and Open Issues. IEEE Access (2022).",
      "doi": ""
    },
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Stacy M Branham. 2018. “Siri Talks at You” An Empirical Investigation of Voice-Activated Personal Assistant (VAPA) Usage by Individuals Who Are Blind. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 249–258.",
      "doi": "10.1145/3234695.3236344"
    },
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-level components of analytic activity in information visualization. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005. (Minneapolis, MN, USA). IEEE, 111–117.",
      "doi": ""
    },
    {
      "text": "Peter Anderson, Xiaodong He, Chris Buehler, Damien Teney, Mark Johnson, Stephen Gould, and Lei Zhang. 2018. Bottom-up and top-down attention for image captioning and visual question answering. In Proceedings of the IEEE conference on computer vision and pattern recognition (Salt Lake City, UT, USA). IEEE, 6077–6086.",
      "doi": ""
    },
    {
      "text": "Stanislaw Antol, Aishwarya Agrawal, Jiasen Lu, Margaret Mitchell, Dhruv Batra, C Lawrence Zitnick, and Devi Parikh. 2015. Vqa: Visual question answering. In Proceedings of the IEEE international conference on computer vision (Santiago, Chile). IEEE, 2425–2433.",
      "doi": "10.1109/ICCV.2015.279"
    },
    {
      "text": "H. K. Ault, J. W. Deloge, R. W. Lapp, M. J. Morgan, and J. R. Barnett. 2002. Evaluation of Long Descriptions of Statistical Graphics for Blind and Low Vision Web Users. In Computers Helping People with Special Needs(Lecture Notes in Computer Science), Klaus Miesenberger, Joachim Klaus, and Wolfgang Zagler (Eds.). Springer, Berlin, Heidelberg, 517–526. https://doi.org/10.1007/3-540-45491-8_99",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Nicole B Lee. 2013. Exploring the use of speech input by blind people on mobile devices. In Proceedings of the 15th international ACM SIGACCESS conference on computers and accessibility. ACM, New York, NY, USA, 1–8.",
      "doi": "10.1145/2513383.2513440"
    },
    {
      "text": "Cristian Bernareggi, Dragan Ahmetovic, and Sergio Mascetti. 2019. μGraph: Haptic Exploration and Editing of 3D Chemical Diagrams. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 312–317.",
      "doi": "10.1145/3308561.3353811"
    },
    {
      "text": "Stacy M Branham and Antony Rishin Mukkath Roy. 2019. Reading between the guidelines: How commercial voice assistant guidelines hinder accessibility for blind users. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 446–458.",
      "doi": "10.1145/3308561.3353797"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Craig Brown and Amy Hurst. 2012. VizTouch: automatically generated tactile visualizations of coordinate spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction. ACM, New York, NY, USA, 131–138.",
      "doi": "10.1145/2148131.2148160"
    },
    {
      "text": "Davide Cervone, Peter Krautzberger, and Volker Sorge. 2016. New accessibility features in MathJax. J Technol Pers Disabil 4(2016), 167–175.",
      "doi": ""
    },
    {
      "text": "Jinho Choi, Sanghun Jung, Deok Gun Park, Jaegul Choo, and Niklas Elmqvist. 2019. Visualizing for the Non-Visual: Enabling the Visually Impaired to Use Visualization. Computer Graphics Forum 38, 3 (2019), 249–260. https://doi.org/10.1111/cgf.13686 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.13686",
      "doi": ""
    },
    {
      "text": "Albert T Corbett and Frederick R Chang. 1983. Pronoun disambiguation: Accessing potential antecedents. Memory & Cognition 11, 3 (1983), 283–294.",
      "doi": ""
    },
    {
      "text": "Nils Dahlbäck, Arne Jönsson, and Lars Ahrenberg. 1993. Wizard of Oz studies—why and how. Knowledge-based systems 6, 4 (1993), 258–266.",
      "doi": ""
    },
    {
      "text": "Phong-Khac Do, Huy-Tien Nguyen, Chien-Xuan Tran, Minh-Tien Nguyen, and Minh-Le Nguyen. 2017. Legal question answering using ranking SVM and deep convolutional neural network. arXiv preprint arXiv:1703.05320(2017).",
      "doi": ""
    },
    {
      "text": "Pierre Dognin, Igor Melnyk, Youssef Mroueh, Inkit Padhi, Mattia Rigotti, Jarret Ross, Yair Schiff, Richard A Young, and Brian Belgodere. 2020. Image captioning as an assistive technology: Lessons learned from vizwiz 2020 challenge. arXiv preprint arXiv:2012.11696(2020).",
      "doi": ""
    },
    {
      "text": "Zohar Eitan, Eitan Ornoy, and Roni Y Granot. 2012. Listening in the dark: Congenital and early blindness and cross-domain mappings in music.Psychomusicology: Music, Mind, and Brain 22, 1 (2012), 33.",
      "doi": ""
    },
    {
      "text": "Niklas Elmqvist and Ji Soo Yi. 2015. Patterns for visualization evaluation. Information Visualization 14, 3 (2015), 250–269.",
      "doi": ""
    },
    {
      "text": "Christin Engel, Emma Franziska Müller, and Gerhard Weber. 2019. SVGPlott: an accessible tool to generate highly adaptable, accessible audio-tactile charts for and from blind and visually impaired people. In Proceedings of the 12th ACM International Conference on PErvasive Technologies Related to Assistive Environments. ACM, New York, NY, USA, 186–195.",
      "doi": "10.1145/3316782.3316793"
    },
    {
      "text": "Leo Ferres, Gitte Lindgaard, Livia Sumegi, and Bruce Tsuji. 2013. Evaluating a Tool for Improving Accessibility to Charts and Graphs. ACM Transactions on Computer-Human Interaction 20, 5(2013), 28:1–28:32. https://doi.org/10.1145/2533682.2533683",
      "doi": "10.1145/2533682.2533683"
    },
    {
      "text": "Leo Ferres, Petro Verkhogliad, Gitte Lindgaard, Louis Boucher, Antoine Chretien, and Martin Lachance. 2007. Improving accessibility to statistical graphs: the iGraph-Lite system. In Proceedings of the 9th international ACM SIGACCESS conference on Computers and accessibility(Assets ’07). Association for Computing Machinery, New York, NY, USA, 67–74. https://doi.org/10.1145/1296843.1296857",
      "doi": "10.1145/1296843.1296857"
    },
    {
      "text": "American Foundation for the Blind. [n. d.]. Key Employment Statistics for People Who Are Blind or Visually Impaired.https://www. afb.org/research-and-initiatives/statistics/key-employment-statistics Accessed June 1, 2021.",
      "doi": ""
    },
    {
      "text": "Tong Gao, Mira Dontcheva, Eytan Adar, Zhicheng Liu, and Karrie G. Karahalios. 2015. DataTone: Managing Ambiguity in Natural Language Interfaces for Data Visualization. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, Charlotte NC USA, 489–500. https://doi.org/10.1145/2807442.2807478",
      "doi": "10.1145/2807442.2807478"
    },
    {
      "text": "A. Jonathan R. Godfrey, Paul Murrell, and Volker Sorge. 2018. An Accessible Interaction Model for Data Visualisation in Statistics. In Computers Helping People with Special Needs(Lecture Notes in Computer Science), Klaus Miesenberger and Georgios Kouroupetroglou (Eds.). Springer International Publishing, Cham, 590–597. https://doi.org/10.1007/978-3-319-94277-3_92",
      "doi": ""
    },
    {
      "text": "Jiangtao Gong, Wenyuan Yu, Long Ni, Yang Jiao, Ye Liu, Xiaolan Fu, and Yingqing Xu. 2020. “I can’t name it, but I can perceive it” Conceptual and Operational Design of” Tactile Accuracy” Assisting Tactile Image Cognition. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 1–12.",
      "doi": ""
    },
    {
      "text": "Darren Guinness, Annika Muehlbradt, Daniel Szafir, and Shaun K Kane. 2019. Robographics: Dynamic tactile graphics powered by mobile robots. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 318–328.",
      "doi": "10.1145/3308561.3353804"
    },
    {
      "text": "Danna Gurari, Qing Li, Abigale J Stangl, Anhong Guo, Chi Lin, Kristen Grauman, Jiebo Luo, and Jeffrey P Bigham. 2018. Vizwiz grand challenge: Answering visual questions from blind people. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (Salt Lake City, UT, USA). IEEE, 3608–3617.",
      "doi": ""
    },
    {
      "text": "Highcharts 2022. Highcharts accessibility module. https://www.highcharts.com/docs/accessibility/accessibility-module",
      "doi": ""
    },
    {
      "text": "Enamul Hoque, Parsa Kavehzadeh, and Ahmed Masry. 2022. Chart Question Answering: State of the Art and Future Directions. arXiv preprint arXiv:2205.03966(2022).",
      "doi": ""
    },
    {
      "text": "Shakila C Joyner, Amalia Riegelhuth, Kathleen Garrity, Yea-Seul Kim, and Nam Wook Kim. 2022. Visualization Accessibility in the Wild: Challenges Faced by Visualization Designers. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 19.",
      "doi": "10.1145/3491102.3517630"
    },
    {
      "text": "Crescentia Jung, Shubham Mehta, Atharva Kulkarni, Yuhang Zhao, and Yea-Seul Kim. 2022. Communicating Visualizations without Visuals: Investigation of Visualization Alternative Text for People with Visual Impairments. IEEE Transactions on Visualization and Computer Graphics 28, 1 (Jan. 2022), 1095–1105. https://doi.org/10.1109/TVCG.2021.3114846",
      "doi": "10.1109/TVCG.2021.3114846"
    },
    {
      "text": "Daekyoung Jung, Wonjae Kim, Hyunjoo Song, Jeong-in Hwang, Bongshin Lee, Bohyoung Kim, and Jinwook Seo. 2017. Chartsense: Interactive data extraction from chart images. In Proceedings of the 2017 chi conference on human factors in computing systems. 6706–6717.",
      "doi": "10.1145/3025453.3025957"
    },
    {
      "text": "Kushal Kafle, Brian Price, Scott Cohen, and Christopher Kanan. 2018. Dvqa: Understanding data visualizations via question answering. In Proceedings of the IEEE conference on computer vision and pattern recognition (Salt Lake City, UT, USA). IEEE, 5648–5656.",
      "doi": ""
    },
    {
      "text": "Kushal Kafle, Robik Shrestha, Scott Cohen, Brian Price, and Christopher Kanan. 2020. Answering questions about data visualizations using efficient bimodal fusion. In Proceedings of the IEEE/CVF Winter conference on applications of computer vision (Snowmass, CO, USA). IEEE, 1498–1507.",
      "doi": ""
    },
    {
      "text": "Samira Ebrahimi Kahou, Adam Atkinson, Vincent Michalski, Ákos Kádár, Adam Trischler, and Yoshua Bengio. 2017. FigureQA: An Annotated Figure Dataset for Visual Reasoning. CoRR abs/1710.07300(2017). arXiv:1710.07300http://arxiv.org/abs/1710.07300",
      "doi": ""
    },
    {
      "text": "Samira Ebrahimi Kahou, Vincent Michalski, Adam Atkinson, Akos Kadar, Adam Trischler, and Yoshua Bengio. 2018. FigureQA: An Annotated Figure Dataset for Visual Reasoning. arXiv:1710.07300 [cs] (Feb. 2018). http://arxiv.org/abs/1710.07300 arXiv:1710.07300.",
      "doi": ""
    },
    {
      "text": "Dae Hyun Kim, Enamul Hoque, and Maneesh Agrawala. 2020. Answering Questions about Charts and Generating Visual Explanations(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376467",
      "doi": "10.1145/3313831.3376467"
    },
    {
      "text": "N. W. Kim, S. C. Joyner, A. Riegelhuth, and Y. Kim. 2021. Accessible Visualization: Design Space, Opportunities, and Challenges. Computer Graphics Forum 40, 3 (2021), 173–188. https://doi.org/10.1111/cgf.14298 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.14298.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Aaron Allen, Jason Kleinman, and Chris Malarkey. 2007. What Frustrates Screen Reader Users on the Web: A Study of 100 Blind Users. International Journal of Human–Computer Interaction 22, 3(2007), 247–269. https://doi.org/10.1080/10447310709336964 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/10447310709336964.",
      "doi": ""
    },
    {
      "text": "Bongshin Lee, Eun Kyoung Choe, Petra Isenberg, Kim Marriott, and John Stasko. 2020. Reaching Broader Audiences With Data Visualization. IEEE Computer Graphics and Applications 40, 2 (March 2020), 82–90. https://doi.org/10.1109/MCG.2020.2968244 Conference Name: IEEE Computer Graphics and Applications.",
      "doi": "10.1109/MCG.2020.2968244"
    },
    {
      "text": "Bongshin Lee, Nathalie Henry Riche, Petra Isenberg, and Sheelagh Carpendale. 2015. More than telling a story: Transforming data into visually shared stories. IEEE computer graphics and applications 35, 5 (2015), 84–90.",
      "doi": ""
    },
    {
      "text": "Jie Lei, Licheng Yu, Mohit Bansal, and Tamara L Berg. 2018. Tvqa: Localized, compositional video question answering. arXiv preprint arXiv:1809.01696(2018).",
      "doi": ""
    },
    {
      "text": "Jie Lei, Licheng Yu, Tamara L. Berg, and Mohit Bansal. 2019. TVQA+: Spatio-Temporal Grounding for Video Question Answering. CoRR abs/1904.11574(2019). arXiv:1904.11574http://arxiv.org/abs/1904.11574",
      "doi": ""
    },
    {
      "text": "Zhengliang Liu, R. Jordan Crouser, and Alvitta Ottley. 2020. Survey on Individual Differences in Visualization. Computer Graphics Forum 39, 3 (2020), 693–712. https://doi.org/10.1111/cgf.14033 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.14033.",
      "doi": ""
    },
    {
      "text": "Jiasen Lu, Jianwei Yang, Dhruv Batra, and Devi Parikh. 2016. Hierarchical question-image co-attention for visual question answering. Advances in neural information processing systems 29 (2016).",
      "doi": ""
    },
    {
      "text": "Alan Lundgard and Arvind Satyanarayan. 2022. Accessible Visualization via Natural Language Descriptions: A Four-Level Model of Semantic Content. (Jan. 2022). https://doi.org/10.1109/TVCG.2021.3114770",
      "doi": "10.1109/TVCG.2021.3114770"
    },
    {
      "text": "Kim Marriott, Bongshin Lee, Matthew Butler, Ed Cutrell, Kirsten Ellis, Cagatay Goncu, Marti Hearst, Kathleen McCoy, and Danielle Albers Szafir. 2021. Inclusive data visualization for people with disabilities: a call to action. Interactions 28, 3 (2021), 47–51.",
      "doi": "10.1145/3457875"
    },
    {
      "text": "Nitesh Methani, Pritha Ganguly, Mitesh M Khapra, and Pratyush Kumar. 2020. Plotqa: Reasoning over scientific plots. In Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (Snowmass, CO, USA). IEEE, 1527–1536.",
      "doi": ""
    },
    {
      "text": "Valerie S Morash, Yue-Ting Siu, Joshua A Miele, Lucia Hasty, and Steven Landau. 2015. Guiding novice web workers in making image descriptions using templates. ACM Transactions on Accessible Computing (TACCESS) 7, 4 (2015), 1–21.",
      "doi": "10.1145/2764916"
    },
    {
      "text": "Tomas Murillo-Morales and Klaus Miesenberger. 2017. Non-visually performing analytical tasks on statistical charts. In Harnessing the Power of Technology to Improve Lives. IOS Press, 339–346.",
      "doi": ""
    },
    {
      "text": "Linyong Nan, Chiachun Hsieh, Ziming Mao, Xi Victoria Lin, Neha Verma, Rui Zhang, Wojciech Kryściński, Nick Schoelkopf, Riley Kong, Xiangru Tang, 2022. FeTaQA: Free-form Table Question Answering. Transactions of the Association for Computational Linguistics 10 (2022), 35–49.",
      "doi": ""
    },
    {
      "text": "Arpit Narechania, Arjun Srinivasan, and John Stasko. 2021. NL4DV: A Toolkit for Generating Analytic Specifications for Data Visualization from Natural Language Queries. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb. 2021), 369–379. https://doi.org/10.1109/TVCG.2020.3030378 tex.ids= narechania2021a arXiv: 2008.10723.",
      "doi": ""
    },
    {
      "text": "John Neuhoff. 2019. Is Sonification Doomed to Fail?International Conference on Auditory Display 52, 327–330. https://doi.org/10.21785/icad2019.069",
      "doi": ""
    },
    {
      "text": "Panupong Pasupat and Percy Liang. 2015. Compositional semantic parsing on semi-structured tables. arXiv preprint arXiv:1508.00305(2015).",
      "doi": ""
    },
    {
      "text": "Revanth Reddy, Rahul Ramesh, Ameet Deshpande, and Mitesh M Khapra. 2019. Figurenet: A deep learning model for question-answering on scientific plots. In 2019 International Joint Conference on Neural Networks (IJCNN) (Budapest, Hungary). IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Melanie A Revilla, Willem E Saris, and Jon A Krosnick. 2014. Choosing the number of categories in agree–disagree scales. Sociological methods & research 43, 1 (2014), 73–97.",
      "doi": ""
    },
    {
      "text": "L Penny Rosenblum, Li Cheng, Kim Zebehazy, Robert Wall Emerson, and Carole R Beal. 2020. Teachers’ descriptions of mathematics graphics for students with visual impairments: A preliminary investigation. Journal of Visual Impairment & Blindness 114, 3 (2020), 231–236.",
      "doi": ""
    },
    {
      "text": "[60] Doug Schepers.2022. http://diagramcenter.org/the-future-of-accessible-charts.html.",
      "doi": ""
    },
    {
      "text": "Ather Sharif, Sanjana Shivani Chintalapati, Jacob O Wobbrock, and Katharina Reinecke. 2021. Understanding Screen-Reader Users’ Experiences with Online Data Visualizations. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 1–16.",
      "doi": ""
    },
    {
      "text": "Ather Sharif and Babak Forouraghi. 2018. evoGraphs — A jQuery plugin to create web accessible graphs. In 2018 15th IEEE Annual Consumer Communications & Networking Conference (CCNC). 1–4. https://doi.org/10.1109/CCNC.2018.8319239",
      "doi": "10.1109/CCNC.2018.8319239"
    },
    {
      "text": "Ather Sharif, Olivia H. Wang, and Alida T. Muongchan. 2022. “What Makes Sonification User-Friendly?” Exploring Usability and User-Friendliness of Sonified Responses. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility (Athens, Greece) (ASSETS ’22). Association for Computing Machinery, New York, NY, USA, Article 45, 5 pages. https://doi.org/10.1145/3517428.3550360",
      "doi": "10.1145/3517428.3550360"
    },
    {
      "text": "Ather Sharif, Olivia H. Wang, Alida T. Muongchan, Katharina Reinecke, and Jacob O. Wobbrock. 2022. VoxLens: Making Online Data Visualizations Accessible with an Interactive JavaScript Plug-In. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 478, 19 pages. https://doi.org/10.1145/3491102.3517431",
      "doi": "10.1145/3491102.3517431"
    },
    {
      "text": "Ather Sharif, Andrew Mingwei Zhang, Anna Shih, Jacob O. Wobbrock, and Katharina Reinecke. 2022. Understanding and Improving Information Extraction From Online Geospatial Data Visualizations for Screen-Reader Users. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility (Athens, Greece) (ASSETS ’22). Association for Computing Machinery, New York, NY, USA, Article 61, 5 pages. https://doi.org/10.1145/3517428.3550363",
      "doi": "10.1145/3517428.3550363"
    },
    {
      "text": "Monika Sharma, Shikha Gupta, Arindam Chowdhury, and Lovekesh Vig. 2019. Chartnet: Visual reasoning over statistical charts using mac-networks. In 2019 International Joint Conference on Neural Networks (IJCNN). IEEE, 1–7.",
      "doi": ""
    },
    {
      "text": "Leixian Shen, Enya Shen, Yuyu Luo, Xiaocong Yang, Xuming Hu, Xiongshuai Zhang, Zhiwei Tai, and Jianmin Wang. 2022. Towards Natural Language Interfaces for Data Visualization: A Survey. IEEE Transactions on Visualization and Computer Graphics (2022), 1–1. https://doi.org/10.1109/TVCG.2022.3148007",
      "doi": ""
    },
    {
      "text": "Danqing Shi, Xinyue Xu, Fuling Sun, Yang Shi, and Nan Cao. 2021. Calliope: Automatic Visual Data Story Generation from a Spreadsheet. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb. 2021), 453–463. https://doi.org/10.1109/TVCG.2020.3030403 Conference Name: IEEE Transactions on Visualization and Computer Graphics.",
      "doi": ""
    },
    {
      "text": "Hrituraj Singh and Sumit Shekhar. 2020. STL-CQA: Structure-based Transformers with Localization and Encoding for Chart Question Answering. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP). Association for Computational Linguistics, Online, 3275–3284. https://doi.org/10.18653/v1/2020.emnlp-main.264",
      "doi": ""
    },
    {
      "text": "Alexa F. Siu, Danyang Fan, Gene S-H Kim, Hrishikesh V. Rao, Xavier Vazquez, Sile O’Modhrain, and Sean Follmer. 2021. COVID-19 highlights the issues facing blind and visually impaired people in accessing data on the web. In Proceedings of the 18th International Web for All Conference(W4A ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3430263.3452432",
      "doi": "10.1145/3430263.3452432"
    },
    {
      "text": "Arjun Srinivasan and Vidya Setlur. 2021. Snowy: Recommending Utterances for Conversational Visual Analysis. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 864–880. https://doi.org/10.1145/3472749.3474792",
      "doi": "10.1145/3472749.3474792"
    },
    {
      "text": "Abigale Stangl, Nitin Verma, Kenneth R Fleischmann, Meredith Ringel Morris, and Danna Gurari. 2021. Going Beyond One-Size-Fits-All Image Descriptions to Satisfy the Information Wants of People Who are Blind or Have Low Vision. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 1–15.",
      "doi": "10.1145/3441852.3471233"
    },
    {
      "text": "Huan Sun, Hao Ma, Xiaodong He, Wen-tau Yih, Yu Su, and Xifeng Yan. 2016. Table cell search for question answering. In Proceedings of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 771–782.",
      "doi": "10.1145/2872427.2883080"
    },
    {
      "text": "Visa Chart 2022. Visa Chart Components. https://github.com/visa/visa-chart-components",
      "doi": ""
    },
    {
      "text": "Data visualization guidelines CFPB Design System. 2020. CFPB Design System. https://cfpb.github.io/design-system/guidelines/data-visualization-guidelines.",
      "doi": ""
    },
    {
      "text": "Alexandra Vtyurina, Adam Fourney, Meredith Ringel Morris, Leah Findlater, and Ryen W White. 2019. Verse: Bridging screen readers and voice assistants for enhanced eyes-free web search. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. ACM, New York, NY, USA, 414–426.",
      "doi": "10.1145/3308561.3353773"
    },
    {
      "text": "B. N. Walker and L. M. Mauney. 2010. Universal design of auditory graphs: A comparison of sonification mappings for visually impaired and sighted listeners. ACM Transactions on Accessible Computing 2, 3 (2010), 1–16. https://doi.org/10.1145/1714458.1714459",
      "doi": "10.1145/1714458.1714459"
    },
    {
      "text": "Steven Wall and Stephen Brewster. 2006. Feeling what you hear: tactile feedback for navigation of audio graphs. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, New York, NY, USA, 1123–1132.",
      "doi": "10.1145/1124772.1124941"
    },
    {
      "text": "David L Waltz. 1978. An English language question answering system for a large relational database. Commun. ACM 21, 7 (1978), 526–539.",
      "doi": "10.1145/359545.359550"
    },
    {
      "text": "Ruobin Wang, Crescentia Jung, and Yea-Seul Kim. 2022. Seeing Through Sounds: Mapping Auditory Dimensions to Data and Charts for People with Visual Impairments. Computer Graphics Forum 41, 3 (2022), 71–83. https://doi.org/10.1111/cgf.14523",
      "doi": ""
    },
    {
      "text": "WebAIM 2018. WebAIM: Survey of Users with Low Vision #2 Results. https://webaim.org/projects/lowvisionsurvey2/#types",
      "doi": ""
    },
    {
      "text": "Dunwei Wen, John Cuzzola, Lorna Brown, and Dr Kinshuk. 2012. Instructor-aided asynchronous question answering system for online education and distance learning. International Review of Research in Open and Distributed Learning 13, 5(2012), 102–125.",
      "doi": ""
    },
    {
      "text": "Markus Weninger, Gerald Ortner, Tobias Hahn, Olaf Drümmer, and Klaus Miesenberger. 2015. ASVG Accessible Scalable Vector Graphics: intention trees to make charts more accessible and usable. Journal of Assistive Technologies 9, 4 (Jan. 2015), 239–246. https://doi.org/10.1108/JAT-10-2015-0027 Publisher: Emerald Group Publishing Limited.",
      "doi": ""
    },
    {
      "text": "Ericksonm William, Camille Lee, and Sarah von Schrader. [n. d.]. Disability Statistics from the 2011 American Community Survey (ACS).www.disabilitystatistics.org. Accessed June 1, 2021.",
      "doi": ""
    },
    {
      "text": "WolframAlpha 2022. WolframAlpha. https://www.wolframalpha.com/",
      "doi": ""
    },
    {
      "text": "Qi Wu, Damien Teney, Peng Wang, Chunhua Shen, Anthony Dick, and Anton van den Hengel. 2017. Visual question answering: A survey of methods and datasets. Computer Vision and Image Understanding 163 (2017), 21–40.",
      "doi": "10.1016/j.cviu.2017.05.001"
    },
    {
      "text": "Hongyang Xue, Zhou Zhao, and Deng Cai. 2017. Unifying the video and question attentions for open-ended video question answering. IEEE Transactions on Image Processing 26, 12 (2017), 5656–5666.",
      "doi": "10.1109/TIP.2017.2746267"
    },
    {
      "text": "Wei Yang, Yuqing Xie, Aileen Lin, Xingyu Li, Luchen Tan, Kun Xiong, Ming Li, and Jimmy Lin. 2019. End-to-end open-domain question answering with bertserini. arXiv preprint arXiv:1902.01718(2019).",
      "doi": ""
    },
    {
      "text": "Yalong Yang, Kim Marriott, Matthew Butler, Cagatay Goncu, and Leona Holloway. 2020. Tactile presentation of network data: Text, matrix or diagram?. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376367"
    },
    {
      "text": "Victor Zhong, Caiming Xiong, and Richard Socher. 2017. Seq2SQL: Generating Structured Queries from Natural Language using Reinforcement Learning. CoRR abs/1709.00103(2017). arXiv:1709.00103http://arxiv.org/abs/1709.00103",
      "doi": ""
    },
    {
      "text": "Jonathan Zong, Crystal Lee, Alan Lundgard, JiWoong Jang, Daniel Hajas, and Arvind Satyanarayan. 2022. Rich Screen Reader Experiences for Accessible Data Visualization. arXiv preprint arXiv:2205.04917(2022).",
      "doi": ""
    }
  ]
}