{
  "doi": "10.1145/3544548.3580722",
  "title": "Boards Hit Back: Reflecting on Martial Arts Practices Through Soma Design",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "There is an increasing interest in the HCI community in designing for bodily practices. We report on a soma design process for martial arts and the resulting artifact – an interactive wooden dummy. Through a detailed account of the design process, we show how it enriched and revamped the bodily practice, but also how it changed the martial arts expert in the design team. Based on a phenomenological account of his experiences, we argue that the estrangement methods in soma design may allow practitioners engaging as soma designers, to cultivate and create new artistic habits fused with thought and feeling, changing themselves and their practice in directions they seek.",
  "tags": [
    "Soma Design",
    "Design",
    "Bodily Practices",
    "Embodied Interaction",
    "Martial Arts"
  ],
  "authors": [
    {
      "name": "Yoav Luft",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659741557",
      "orcid": "0000-0001-5755-7721"
    },
    {
      "name": "Pavel Karpashevich",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-99659120383/rel-imgonly/ld0soyoo_yy.jpg",
      "acmid": "99659120383",
      "orcid": "0000-0003-0874-3338"
    },
    {
      "name": "Kristina Höök",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    }
  ],
  "references": [
    {
      "text": "A. Al-Ibadi, S. Nefti-Meziani, and S. Davis. 2017. Novel models for the extension pneumatic muscle actuator performances. In 2017 23rd International Conference on Automation and Computing (ICAC). 1–6. https://doi.org/10.23919/IConAC.2017.8081973",
      "doi": ""
    },
    {
      "text": "Catarina Allen d’Ávila Silveira, Ozgun Kilic Afsar, and Sarah Fdili Alaoui. 2022. Wearable Choreographer: Designing Soft-Robotics for Dance Practice. In Designing Interactive Systems Conference(DIS ’22). Association for Computing Machinery, New York, NY, USA, 1581–1596. https://doi.org/10.1145/3532106.3533499",
      "doi": "10.1145/3532106.3533499"
    },
    {
      "text": "Arnold Baca, Peter Dabnichki, Mario Heller, and Philipp Kornfeind. 2009. Ubiquitous computing in sports: A review and analysis. Journal of Sports Sciences 27, 12 (Oct. 2009), 1335–1346. https://doi.org/10.1080/02640410903277427 Publisher: Routledge.",
      "doi": ""
    },
    {
      "text": "Angela Benitez Santiago and Raymond G. Miltenberger. 2016. Using Video Feedback to Improve Martial Arts Performance. Behavioral Interventions 31, 1 (2016), 12–27. https://doi.org/10.1002/bin.1424 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/bin.1424.",
      "doi": ""
    },
    {
      "text": "Janne Mascha Beuthel and Danielle Wilde. 2017. Wear.x: Developing Wearables that Embody Felt Experience. In Proceedings of the 2017 Conference on Designing Interactive Systems - DIS ’17. ACM Press, Edinburgh, United Kingdom, 915–927. https://doi.org/10.1145/3064663.3064799",
      "doi": "10.1145/3064663.3064799"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa Publisher: Routledge _eprint: https://www.tandfonline.com/doi/pdf/10.1191/1478088706qp063oa.",
      "doi": ""
    },
    {
      "text": "E. H. Chi. 2005. Introducing wearable force sensors in martial arts. IEEE Pervasive Computing 4, 3 (July 2005), 47–53. https://doi.org/10.1109/MPRV.2005.67 Conference Name: IEEE Pervasive Computing.",
      "doi": "10.1109/MPRV.2005.67"
    },
    {
      "text": "Ed H. Chi, Jin Song, and Greg Corbin. 2004. \"Killer App\" of wearable computing: wireless force sensing body protectors for martial arts. In Proceedings of the 17th annual ACM symposium on User interface software and technology(UIST ’04). Association for Computing Machinery, Santa Fe, NM, USA, 277–285. https://doi.org/10.1145/1029632.1029680",
      "doi": "10.1145/1029632.1029680"
    },
    {
      "text": "Philo Tan Chua, R. Crivella, B. Daly, Ning Hu, R. Schaaf, D. Ventura, T. Camill, J. Hodgins, and R. Pausch. 2003. Training for physical tasks in virtual environments: Tai Chi. In IEEE Virtual Reality, 2003. Proceedings.IEEE Comput. Soc, Los Angeles, CA, USA, 87–94. https://doi.org/10.1109/VR.2003.1191125",
      "doi": ""
    },
    {
      "text": "Einat Bar-On Cohen. 2006. Kime and the Moving Body: Somatic Codes in Japanese Martial Arts. Body & Society 12, 4 (Dec. 2006), 73–93. https://doi.org/10.1177/1357034X06070885 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Kelsey Cotton, Ozgun Kilic Afsar, Yoav Luft, Priyanka Syal, and Fehmi Ben Abdesslem. 2021. SymbioSinging: Robotically transposing singing experi- ence across singing and non-singing bodies.. In Proceedings of Creativity and Cognition 2021. ACM, Virtual Event, Italy., 5 pages.",
      "doi": "10.1145/3450741.3466718"
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). Association for Computing Machinery, New York, NY, USA, 753–764. https://doi.org/10.1145/3196709.3196781",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "William Dvorine. 1979. Kendo: A Safer Martial Art. Physician and Sport Medicine 7, 12 (1979), 4.",
      "doi": ""
    },
    {
      "text": "Sara Eriksson, Kristina Höök, Richard Shusterman, Dag Svanes, Carl Unander-Scharin, and Åsa Unander-Scharin. 2020. Ethics in Movement: Shaping and Being Shaped in Human-Drone Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376678",
      "doi": "10.1145/3313831.3376678"
    },
    {
      "text": "Sara Eriksson, Åsa Unander-Scharin, Vincent Trichon, Carl Unander-Scharin, Hedvig Kjellström, and Kristina Höök. 2019. Dancing With Drones: Crafting Novel Artistic Expressions Through Intercorporeality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300847",
      "doi": "10.1145/3290605.3300847"
    },
    {
      "text": "Sarah Fdili Alaoui. 2019. Making an Interactive Dance Piece: Tensions in Integrating Technology in Art. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 1195–1208. https://doi.org/10.1145/3322276.3322289",
      "doi": "10.1145/3322276.3322289"
    },
    {
      "text": "Eberhard Graether and Florian Mueller. 2012. Joggobot: a flying robot as jogging companion. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’12). Association for Computing Machinery, Austin, Texas, USA, 1063–1066. https://doi.org/10.1145/2212776.2212386",
      "doi": "10.1145/2212776.2212386"
    },
    {
      "text": "Masaaki Hatsumi. 1988. Essence of ninjutsu: the nine traditions. Contemporary Books, Chicago.",
      "doi": ""
    },
    {
      "text": "Masaaki Hatsumi. 1988. The grandmaster’s book of ninja training. Contemporary Books, Chicago.",
      "doi": ""
    },
    {
      "text": "Cornelius Herstatt and Eric von Hippel. 1992. Developing New Product Concepts Via the Lead User Method: A Case Study in a \"Low Tech\" Field\",. Journal of Product Innovation Management9 (1992), 213–221.",
      "doi": ""
    },
    {
      "text": "Leo Holsti, Tuukka Takala, Aki Martikainen, Raine Kajastila, and Perttu Hämäläinen. 2013. Body-controlled trampoline training games based on computer vision. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 1143–1148. https://doi.org/10.1145/2468356.2468560",
      "doi": "10.1145/2468356.2468560"
    },
    {
      "text": "Sampsa Hyysalo. 2010. Health Technology Development and Use (0 ed.). Routledge. https://doi.org/10.4324/9780203849156",
      "doi": ""
    },
    {
      "text": "Perttu Hämäläinen. 2004. Interactive video mirrors for sports training. In Proceedings of the third Nordic conference on Human-computer interaction(NordiCHI ’04). Association for Computing Machinery, New York, NY, USA, 199–202. https://doi.org/10.1145/1028014.1028044",
      "doi": "10.1145/1028014.1028044"
    },
    {
      "text": "Perttu Hämäläinen, Tommi Ilmonen, Johanna Höysniemi, Mikko Lindholm, and Ari Nykänen. 2005. Martial arts in artificial reality. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’05). Association for Computing Machinery, Portland, Oregon, USA, 781–790. https://doi.org/10.1145/1054972.1055081",
      "doi": "10.1145/1054972.1055081"
    },
    {
      "text": "Kristina Höök. 2010. Transferring qualities from horseback riding to design. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction Extending Boundaries - NordiCHI ’10. ACM Press, Reykjavik, Iceland, 226. https://doi.org/10.1145/1868914.1868943",
      "doi": "10.1145/1868914.1868943"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Steve Benford, Paul Tennent, Vasiliki Tsaknaki, Miquel Alfaras, Juan Martinez Avila, Christine Li, Joseph Marshall, Claudia Daudén Roquet, Pedro Sanches, Anna Ståhl, Muhammad Umair, Charles Windlin, and Feng Zhou. 2021. Unpacking Non-Dualistic Design: The Soma Design Case. ACM Transactions on Computer-Human Interaction 28, 6 (Nov. 2021), 40:1–40:36. https://doi.org/10.1145/3462448",
      "doi": "10.1145/3462448"
    },
    {
      "text": "Kristina Höök, Sara Eriksson, Marie Louise Juul Søndergaard, Marianela Ciolfi Felice, Nadia Campo Woytuk, Ozgun Kilic Afsar, Vasiliki Tsaknaki, and Anna Ståhl. 2019. Soma Design and Politics of the Body. In Proceedings of the Halfway to the Future Symposium 2019(HTTF 2019). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3363384.3363385",
      "doi": "10.1145/3363384.3363385"
    },
    {
      "text": "Kristina Höök, Caroline Hummels, Katherine Isbister, Patrizia Marti, Elena Márquez Segura, Martin Jonsson, Florian ’Floyd’ Mueller, Pedro A.N. Sanches, Thecla Schiphorst, Anna Ståhl, Dag Svanaes, Ambra Trotto, Marianne Graves Petersen, and Youn-kyung Lim. 2017. Soma-Based Design Theory. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 550–557. https://doi.org/10.1145/3027063.3027082",
      "doi": "10.1145/3027063.3027082"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 3131–3142. https://doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Irena Martinkova and Jim Parry. 2016. The paradox of martial arts– safe combat. Ido Movement for Culture. Journal of Martial Arts Anthropology 16, 4(2016), 4–10. https://doi.org/10.14589/ido.15.3.1",
      "doi": ""
    },
    {
      "text": "Annkatrin Jung. 2020. Exploring Breathing-Based Interactions through Deep Touch Pressure. Master’s thesis. Royal Institute of Technology (KTH), Stockholm, Sweden.",
      "doi": ""
    },
    {
      "text": "Raine Kajastila, Leo Holsti, and Perttu Hämäläinen. 2016. The Augmented Climbing Wall: High-Exertion Proximity Interaction on a Wall-Sized Interactive Surface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 758–769. https://doi.org/10.1145/2858036.2858450",
      "doi": "10.1145/2858036.2858450"
    },
    {
      "text": "Victor Kaptelinin. 2013. Activity Theory (2nded.). Interaction Design Foundation. https://www.interaction-design.org/literature/book/the-encyclopedia-of-human-computer-interaction-2nd-ed/activity-theory",
      "doi": ""
    },
    {
      "text": "Pavel Karpashevich, Eva Hornecker, Michaela Honauer, and Pedro Sanches. 2018. Reinterpreting Schlemmer’s Triadic Ballet: Interactive Costume for Unthinkable Movements. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–13. https://doi.org/10.1145/3173574.3173635",
      "doi": "10.1145/3173574.3173635"
    },
    {
      "text": "Pavel Karpashevich, Pedro Sanches, Rachael Garrett, Yoav Luft, Kelsey Cotton, Vasiliki Tsaknaki, and Kristina Höök. 2022. Touching Our Breathing through Shape-Change: Monster, Organic Other, or Twisted Mirror. ACM Trans. Comput.-Hum. Interact. 29, 3, Article 22 (feb 2022), 40 pages. https://doi.org/10.1145/3490498",
      "doi": "10.1145/3490498"
    },
    {
      "text": "Joseph La Delfa, Mehmet Aydin Baytas, Rakesh Patibanda, Hazel Ngari, Rohit Ashok Khot, and Florian ’Floyd’ Mueller. 2020. Drone Chi: Somaesthetic Human-Drone Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376786",
      "doi": "10.1145/3313831.3376786"
    },
    {
      "text": "Joseph La Delfa, Robert Jarvis, Rohit Ashok Khot, and Florian ’Floyd’ Mueller. 2018. Tai Chi In The Clouds: Using Micro UAV’s To Support Tai Chi Practice. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts(CHI PLAY ’18 Extended Abstracts). Association for Computing Machinery, Melbourne, VIC, Australia, 513–519. https://doi.org/10.1145/3270316.3271511",
      "doi": "10.1145/3270316.3271511"
    },
    {
      "text": "Wanyu Liu, Artem Dementyev, Diemo Schwarz, Emmanuel Flety, Wendy E. Mackay, Michel Beaudouin-Lafon, and Frederic Bevilacqua. 2021. SonicHoop: Using Interactive Sonification to Support Aerial Hoop Practices. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3411764.3445539",
      "doi": "10.1145/3411764.3445539"
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and making strange: An embodied approach to movement-based interaction design. ACM Transactions on Computer-Human Interaction 20, 1 (March 2013), 1–25. https://doi.org/10.1145/2442106.2442113",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Joe Marshall, Conor Linehan, and Adrian Hazzard. 2016. Designing brutal multiplayer video games. (May 2016). https://nottingham-repository.worktribe.com/output/790999",
      "doi": ""
    },
    {
      "text": "F. Michahelles and B. Schiele. 2005. Sensing and monitoring professional skiers. IEEE Pervasive Computing 4, 3 (July 2005), 40–45. https://doi.org/10.1109/MPRV.2005.66 Conference Name: IEEE Pervasive Computing.",
      "doi": "10.1109/MPRV.2005.66"
    },
    {
      "text": "Florian Mueller, Rohit Ashok Khot, Kathrin Gerling, and Regan Mandryk. 2016. Exertion Games. Foundations and Trends in Human-Computer Interaction 10, 1 (Dec. 2016), 1–86. https://doi.org/10.1561/1100000041",
      "doi": "10.1561/1100000041"
    },
    {
      "text": "Florian Mueller and Matthew Muirhead. 2014. Understanding the design of a flying jogging companion. In Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology(UIST’14 Adjunct). Association for Computing Machinery, Honolulu, Hawaii, USA, 81–82. https://doi.org/10.1145/2658779.2658786",
      "doi": "10.1145/2658779.2658786"
    },
    {
      "text": "Florian ’Floyd’ Mueller, Martin Gibbs, Frank Vetere, Stefan Agamanolis, and Darren Edge. 2014. Designing mediated combat play. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction(TEI ’14). Association for Computing Machinery, New York, NY, USA, 149–156. https://doi.org/10.1145/2540930.2540937",
      "doi": "10.1145/2540930.2540937"
    },
    {
      "text": "Florian ’Floyd’ Mueller and Matthew Muirhead. 2015. Jogging with a Quadcopter. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, Seoul, Republic of Korea, 2023–2032. https://doi.org/10.1145/2702123.2702472",
      "doi": "10.1145/2702123.2702472"
    },
    {
      "text": "Michael J. Muller and Sarah Kuhn. 1993. Participatory design. Commun. ACM 36, 6 (June 1993), 24–28. https://doi.org/10.1145/153571.255960",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Eric C. Mullis. 2013. Martial Somaesthetics. The Journal of Aesthetic Education 47, 3 (2013), 96–115. https://doi.org/10.5406/jaesteduc.47.3.0096 Publisher: University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Musashi, Miyamoto, Wilson, William Scott, and Matsumoto, Michihiro. 2009. The Book of Five Rings. Kodansha Intl.OCLC: 674429805, trans. Wilson, Matsumoto.",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami, and Annika Waern. 2016. Embodied Sketching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, San Jose, California, USA, 6014–6027. https://doi.org/10.1145/2858036.2858486",
      "doi": "10.1145/2858036.2858486"
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical design in HCI research: designing and learning through use-it-yourself. In Proceedings of the Designing Interactive Systems Conference(DIS ’12). Association for Computing Machinery, Newcastle Upon Tyne, United Kingdom, 514–523. https://doi.org/10.1145/2317956.2318034",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Stina Nylander and Jakob Tholander. 2014. Designing for Movement: the Case of Sports. In Proceedings of the 2014 International Workshop on Movement and Computing(MOCO ’14). Association for Computing Machinery, Paris, France, 130–135. https://doi.org/10.1145/2617995.2618018",
      "doi": "10.1145/2617995.2618018"
    },
    {
      "text": "Stina Nylander, Jakob Tholander, Florian Mueller, and Joe Marshall. 2014. HCI and sports. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’14). Association for Computing Machinery, Toronto, Ontario, Canada, 115–118. https://doi.org/10.1145/2559206.2559223",
      "doi": "10.1145/2559206.2559223"
    },
    {
      "text": "Kim Oakes, Katie A. Siek, and Haley MacLeod. 2015. MuscleMemory: identifying the scope of wearable technology in high intensity exercise communities. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare(PervasiveHealth ’15). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), Brussels, BEL, 193–200.",
      "doi": ""
    },
    {
      "text": "Katja Pettinen. 2014. Somatic Skill Transmission as Storytelling: The Role of Embodied Judgment in Taijutsu Practice. PhaenEx 9, 2 (Dec. 2014), 136–155. https://doi.org/10.22329/p.v9i2.4285 Number: 2.",
      "doi": ""
    },
    {
      "text": "Sebastiaan Pijnappel and Florian Mueller. 2013. 4 design themes for skateboarding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 1271–1274. https://doi.org/10.1145/2470654.2466165",
      "doi": "10.1145/2470654.2466165"
    },
    {
      "text": "Sebastiaan Pijnappel and Florian Mueller. 2013. Copy paste skate. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 2863–2864. https://doi.org/10.1145/2468356.2479550",
      "doi": "10.1145/2468356.2479550"
    },
    {
      "text": "Johan Redström. 2017. Making design theory. The MIT Press, Cambridge, Massachusetts. OCLC: ocn967727636.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst. 2011. Self-evidence: applying somatic connoisseurship to experience design. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 145–160. https://doi.org/10.1145/1979742.1979640",
      "doi": "10.1145/1979742.1979640"
    },
    {
      "text": "Maxine Sheets-Johnstone. 2011. The Primacy of Movement: Expanded second edition. John Benjamins Publishing.",
      "doi": ""
    },
    {
      "text": "Maxine Sheets-Johnstone. 2015. The Corporeal Turn: An Interdisciplinary Reader. Andrews UK Limited.",
      "doi": ""
    },
    {
      "text": "Ali Shtarbanov. 2021. FlowIO Development Platform - the Pneumatic \"Raspberry Pi\" for Soft Robotics. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems(CHI EA ’21). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3411763.3451513",
      "doi": "10.1145/3411763.3451513"
    },
    {
      "text": "Richard Shusterman. 2008. Body Consciousness: A Philosophy of Mindfulness and Somaesthetics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Madeline Balaam, Rob Comber, Pedro Sanches, and Kristina Höök. 2022. Making New Worlds– Transformative Becomings with Soma Design. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3491102.3502018",
      "doi": "10.1145/3491102.3502018"
    },
    {
      "text": "Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, Kristina Höök, and Eva-Carin Banka Johnson. 2016. The Soma Mat and Breathing Light. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 305–308. https://doi.org/10.1145/2851581.2889464",
      "doi": "10.1145/2851581.2889464"
    },
    {
      "text": "Anna Ståhl, Jakob Tholander, Jarmo Laaksolahti, and Elsa Kosmack-Vaara. 2017. Being, Bringing and Bridging: Three Aspects of Sketching with Nature. In Proceedings of the 2017 Conference on Designing Interactive Systems - DIS ’17. ACM Press, Edinburgh, United Kingdom, 1309–1320. https://doi.org/10.1145/3064663.3064764",
      "doi": "10.1145/3064663.3064764"
    },
    {
      "text": "Yngve Sundblad. 2011. UTOPIA: Participatory Design from Scandinavia to the World. In History of Nordic Computing 3(IFIP Advances in Information and Communication Technology), John Impagliazzo, Per Lundin, and Benkt Wangler (Eds.). Springer, Berlin, Heidelberg, 176–186. https://doi.org/10.1007/978-3-642-23315-9_20",
      "doi": ""
    },
    {
      "text": "Sekien Toriyama. 1805. Hyakki tsurezurebukuro. Edo : Maekawa Yahei. http://archive.org/details/HyakkitsurezureV2Tori",
      "doi": ""
    },
    {
      "text": "Vasiliki Tsaknaki, Kelsey Cotton, Pavel Karpashevich, and Pedro Sanches. 2021. “Feeling the Sensor Feeling you”: A Soma Design Exploration on Sensing Non-habitual Breathing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–16. https://doi.org/10.1145/3411764.3445628",
      "doi": "10.1145/3411764.3445628"
    },
    {
      "text": "Luca Turchet. 2018. Smart Mandolin: autobiographical design, implementation, use cases, and lessons learned. In Proceedings of the Audio Mostly 2018 on Sound in Immersion and Emotion(AM’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3243274.3243280",
      "doi": "10.1145/3243274.3243280"
    },
    {
      "text": "Laia Turmo Vidal. 2021. Designing for Intercorporeality : An Interaction Design Approach to Technology-Supported Movement Learning. Doctornal Dissertation. Uppsala University. http://urn.kb.se/resolve?urn=urn:nbn:se:uu:diva-452038Publisher: Department of Informatics and Media.",
      "doi": ""
    },
    {
      "text": "Laia Turmo Vidal, Elena Márquez Segura, Christopher Boyer, and Annika Waern. 2019. Enlightened Yoga: Designing an Augmented Class with Wearable Lights to Support Instruction. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 1017–1031. https://doi.org/10.1145/3322276.3322338",
      "doi": "10.1145/3322276.3322338"
    },
    {
      "text": "Laia Turmo Vidal, Elena Márquez Segura, Luis Parrilla Bel, and Annika Waern. 2018. Exteriorizing Body Alignment in Collocated Physical Training. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188685",
      "doi": "10.1145/3170427.3188685"
    },
    {
      "text": "Laia Turmo Vidal, Hui Zhu, and Abraham Riego-Delgado. 2020. BodyLights: Open-Ended Augmented Feedback to Support Training Towards a Correct Exercise Execution. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376268",
      "doi": "10.1145/3313831.3376268"
    },
    {
      "text": "Laia Turmo Vidal, Hui Zhu, Annika Waern, and Elena Márquez Segura. 2021. The Design Space of Wearables for Sports and Fitness Practices. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3411764.3445700",
      "doi": "10.1145/3411764.3445700"
    },
    {
      "text": "Eric Von Hippel. 1986. Lead Users: A Source of Novel Product Concepts. Management Science 32, 7 (1986), 791–805. http://www.jstor.org/stable/2631761 Publisher: INFORMS.",
      "doi": ""
    },
    {
      "text": "John Wellbelove. 2022. Embedded Template Library. https://www.etlcpp.com/home.html",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Anna Vallgårda, and Oscar Tomico. 2017. Embodied Design Ideation Methods: Analysing the Power of Estrangement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17. ACM Press, Denver, Colorado, USA, 5158–5170. https://doi.org/10.1145/3025453.3025873",
      "doi": "10.1145/3025453.3025873"
    }
  ]
}