{
  "doi": "10.1145/3544548.3581034",
  "title": "SkinPaper: Exploring Opportunities for Woven Paper as a Wearable Material for On-Skin Interactions",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Paper circuitry has been extensively explored by HCI researchers as a means of creating interactive objects. However, these approaches focus on creating desktop or handheld objects, and paper as a wearable material remains under-explored. We present SkinPaper, a fabrication approach using silicone-treated washi paper to weave lightweight and easy-to-fabricate on-skin interactions. We adopt techniques from paper weaving and basketry weaving practices to create paper-woven structures that can conform to the body. Our approach uses off-the-shelf materials to facilitate a highly customizable fabrication process. We showcase eight case studies to illustrate our approach’s two to three-dimensional forms. To understand the expressiveness of the design space, we conducted a workshop study in which weavers created paper-woven on-skin interactions. We draw insights from the studies to understand the opportunities for paper-woven on-skin interactions.",
  "authors": [
    {
      "name": "Jingwen Zhu",
      "institution": "Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660668918",
      "orcid": "0000-0002-7336-1427"
    },
    {
      "name": "Nadine El Nesr",
      "institution": "Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782847",
      "orcid": "0000-0003-2042-7995"
    },
    {
      "name": "Nola Rettenmaier",
      "institution": "Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781037",
      "orcid": "0000-0002-5449-5227"
    },
    {
      "name": "Cindy Hsin-Liu Kao",
      "institution": "Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779455",
      "orcid": "0000-0003-1316-4170"
    }
  ],
  "references": [
    {
      "text": "Alli. 2021. Paper Weaving Craft For Kids - Step By Step Fun Paper Craft. https://www.madewithhappy.com/paper-weaving/.",
      "doi": ""
    },
    {
      "text": "Henrik A. Andersson, Anatoliy Manuilskiy, Stefan Haller, Magnus Hummelgård, Johan Sidén, Christine Hummelgård, Håkan Olin, and Hans-Erik Nilsson. 2014. Assembling Surface Mounted Components on Ink-Jet Printed Double Sided Paper Circuit Board. Nanotechnology 25, 9 (Feb. 2014), 094002. https://doi.org/10.1088/0957-4484/25/9/094002",
      "doi": ""
    },
    {
      "text": "Sylvie Begot. 2020. Creative Basket Weaving: Basket Designs, Plus Wall Hangings, Trays, and Other Decorative Home Items. Stackpole Books, Mechanicsburg, PA.",
      "doi": ""
    },
    {
      "text": "Deborah Chandler. 1995. Learning to Weave. Interweave Press, Loveland, Colorado.",
      "doi": ""
    },
    {
      "text": "Zekun Chang, Tung D. Ta, Koya Narumi, Heeju Kim, Fuminori Okuya, Dongchi Li, Kunihiro Kato, Jie Qi, Yoshinobu Miyamoto, Kazuya Saito, and Yoshihiro Kawahara. 2020. Kirigami Haptic Swatches: Design Methods for Cut-and-Fold Haptic Feedback Mechanisms. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). ACM, Honolulu, HI, USA, 1–12. https://doi.org/10.1145/3313831.3376655",
      "doi": "10.1145/3313831.3376655"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing Grounded Theory. Sage Publications, London, UK.",
      "doi": ""
    },
    {
      "text": "Christopher Chen, David Howard, Steven L. Zhang, Youngwook Do, Sienna Sun, Tingyu Cheng, Zhong Lin Wang, Gregory D. Abowd, and HyunJoo Oh. 2020. SPIN (Self-powered Paper Interfaces): Bridging Triboelectric Nanogenerator with Folding Paper Creases. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’20). ACM, Sydney NSW Australia, 431–442. https://doi.org/10.1145/3374920.3374946",
      "doi": "10.1145/3374920.3374946"
    },
    {
      "text": "Tingyu Cheng, Koya Narumi, Youngwook Do, Yang Zhang, Tung D. Ta, Takuya Sasatani, Eric Markvicka, Yoshihiro Kawahara, Lining Yao, Gregory D. Abowd, and HyunJoo Oh. 2020. Silver Tape: Inkjet-Printed Circuits Peeled-and-Transferred on Versatile Substrates. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 1 (March 2020), 1–17. https://doi.org/10.1145/3381013",
      "doi": "10.1145/3381013"
    },
    {
      "text": "Bare Conductive. 2011. Bare Conductive. https://www.bareconductive.com/.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Sasha de Koninck, and Etta Sandry. 2022. An Introduction to Weave Structure for HCI: A How-to and Reflection on Modes of Exchange. In Designing Interactive Systems Conference(DIS ’22). Association for Computing Machinery, New York, NY, USA, 629–642. https://doi.org/10.1145/3532106.3534567",
      "doi": "10.1145/3532106.3534567"
    },
    {
      "text": "Laura Devendorf and Chad Di Lauro. 2019. Adapting Double Weaving and Yarn Plying Techniques for Smart Textiles Applications. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’19). ACM, New York, NY, USA, 77–85. https://doi.org/10.1145/3294109.3295625",
      "doi": "10.1145/3294109.3295625"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I Don’t Want to Wear a Screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 6028–6039. https://doi.org/10.1145/2858036.2858192",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Irene Emery. 2009. The Primary Structures of Fabrics: An Illustrated Classification. Thames & Hudson, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What Should We Expect from Research through Design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). ACM, Austin Texas USA, 937–946. https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Nur Al-huda Hamdan, Adrian Wagner, Simon Voelker, Jürgen Steimle, and Jan Borchers. 2019. Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–14. https://doi.org/10.1145/3290605.3300718",
      "doi": "10.1145/3290605.3300718"
    },
    {
      "text": "Steve Hodges, Nicolas Villar, Nicholas Chen, Tushar Chugh, Jie Qi, Diana Nowacka, and Yoshihiro Kawahara. 2014. Circuit Stickers: Peel-and-Stick Construction of Interactive Electronic Prototypes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, Toronto, Ontario, Canada, 1743–1746. https://doi.org/10.1145/2556288.2557150",
      "doi": "10.1145/2556288.2557150"
    },
    {
      "text": "Kunpeng Huang, Ruojia Sun, Ximeng Zhang, Md. Tahmidul Islam Molla, Margaret Dunne, Francois Guimbretiere, and Cindy Hsin-Liu Kao. 2021. WovenProbe: Probing Possibilities for Weaving Fully-Integrated On-Skin Systems Deployable in the Field. In Designing Interactive Systems Conference 2021(DIS ’21). ACM, New York, NY, USA, 1143–1158. https://doi.org/10.1145/3461778.3462105",
      "doi": "10.1145/3461778.3462105"
    },
    {
      "text": "Cindy Hsin-Liu Kao, Bichlien Nguyen, Asta Roseway, and Michael Dickey. 2017. EarthTones: Chemical Sensing Powders to Detect and Display Environmental Hazards through Color Variation. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). ACM, Denver, CO, USA, 872–883. https://doi.org/10.1145/3027063.3052754",
      "doi": "10.1145/3027063.3052754"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Miren Bamforth, David Kim, and Chris Schmandt. 2018. Skinmorph: Texture-Tunable on-Skin Interface through Thin, Programmable Gel. In Proceedings of the 2018 ACM International Symposium on Wearable Computers(ISWC ’18). ACM, Singapore, Singapore, 196–203. https://doi.org/10.1145/3267242.3267262",
      "doi": "10.1145/3267242.3267262"
    },
    {
      "text": "Hsin-Liu Cindy Kao, Abdelkareem Bedri, and Kent Lyons. 2018. SkinWire: Fabricating a Self-Contained On-Skin PCB for the Hand. IMWUT 2, 3 (2018), 1–23. https://doi.org/10.1145/3264926",
      "doi": "10.1145/3264926"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. 2016. DuoSkin: Rapidly Prototyping on-Skin User Interfaces Using Skin-Friendly Materials. In Proceedings of the 2016 ACM International Symposium on Wearable Computers(ISWC ’16). ACM, Heidelberg, Germany, 16–23. https://doi.org/10.1145/2971763.2971777",
      "doi": "10.1145/2971763.2971777"
    },
    {
      "text": "Kunihiro Kato, Kaori Ikematsu, Yuki Igarashi, and Yoshihiro Kawahara. 2022. Paper-Woven Circuits: Fabrication Approach for Papercraft-based Electronic Devices. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’22). ACM, Daejeon, Republic of Korea, 1–11. https://doi.org/10.1145/3490149.3502253",
      "doi": "10.1145/3490149.3502253"
    },
    {
      "text": "Keiko Katsuragawa, Ju Wang, Ziyang Shan, Ningshan Ouyang, Omid Abari, and Daniel Vogel. 2019. Tip-Tap: Battery-free Discrete 2D Fingertip Input. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(UIST ’19). Association for Computing Machinery, New York, NY, USA, 1045–1057. https://doi.org/10.1145/3332165.3347907",
      "doi": "10.1145/3332165.3347907"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-Based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’13). ACM, Zurich Switzerland, 363–372. https://doi.org/10.1145/2493432.2493486",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Arshad Khan, Joan Sol Roo, Tobias Kraus, and Jürgen Steimle. 2019. Soft Inkjet Circuits: Rapid Multi-Material Fabrication of Soft Circuits Using a Commodity Inkjet Printer. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(UIST ’19). ACM, New Orleans, LA, USA, 341–354. https://doi.org/10.1145/3332165.3347892",
      "doi": "10.1145/3332165.3347892"
    },
    {
      "text": "Yuichiro Kinoshita, Kentaro Go, Reiji Kozono, and Kohei Kaneko. 2014. Origami Tessellation Display: Interaction Techniques Using Origami-Based Deformable Surfaces. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 1837–1842. https://doi.org/10.1145/2559206.2581172",
      "doi": "10.1145/2559206.2581172"
    },
    {
      "text": "Pin-Sung Ku, Kunpeng Huang, and Cindy Hsin-Liu Kao. 2022. Patch-O: Deformable Woven Patches for On-body Actuation. In CHI Conference on Human Factors in Computing Systems(CHI ’22). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3491102.3517633",
      "doi": "10.1145/3491102.3517633"
    },
    {
      "text": "Robert J. Lang. 2009. Computational Origami: From Flapping Birds to Space Telescopes. In Proceedings of the 25th Annual Symposium on Computational Geometry - SCG ’09. ACM Press, Aarhus, Denmark, 159–162. https://doi.org/10.1145/1542362.1542363",
      "doi": "10.1145/1542362.1542363"
    },
    {
      "text": "Xin Liu, Katia Vega, Pattie Maes, and Joe A. Paradiso. 2016. Wearability Factors for Skin Interfaces. In Proceedings of the 7th Augmented Human International Conference 2016(AH ’16). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/2875194.2875248",
      "doi": "10.1145/2875194.2875248"
    },
    {
      "text": "Joanne Lo, Doris Jung Lin Lee, Nathan Wong, David Bui, and Eric Paulos. 2016. Skintillates: Designing and Creating Epidermal Interactions. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). ACM, Brisbane, QLD, Australia, 853–864. https://doi.org/10.1145/2901790.2901885",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Eric Markvicka, Guanyun Wang, Yi Chin Lee, Gierad Laput, Carmel Majidi, and Lining Yao. 2019. ElectroDermis: Fully Untethered, Stretchable, and Highly-Customizable Electronic Bandages. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, Glasgow, Scotland, UK, 1–10. https://doi.org/10.1145/3290605.3300862",
      "doi": "10.1145/3290605.3300862"
    },
    {
      "text": "Yuka Matsumoto. 2008. DigitalCommons @ University of Nebraska - Lincoln Weaving Cloth from Tosa-washi (Japanese Paper from Kochi in Shikoku, Japan): Connection and Expansion of Area and People. In Textile Society of America Symposium Proceedings. University of Nebraska - Lincoln, Lincoln, NE, 114.",
      "doi": ""
    },
    {
      "text": "Meher McArthur and Hollis Goodall. 2021. Washi Transformed: New Expressions in Japanese Paper. Scala, London, UK.",
      "doi": ""
    },
    {
      "text": "Dorothy McGuinness. 2021. The Art of Contemporary Woven Paper Basketry: Explorations in Diagonal Twill. Schiffer Publishing, Limited, Atglen, PA.",
      "doi": ""
    },
    {
      "text": "David A. Mellis, Sam Jacoby, Leah Buechley, Hannah Perner-Wilson, and Jie Qi. 2013. Microcontrollers as Material: Crafting Circuits with Paper, Conductive Ink, Electronic Components, and an \"Untoolkit\". In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction(TEI ’13). Association for Computing Machinery, New York, NY, USA, 83–90. https://doi.org/10.1145/2460625.2460638",
      "doi": "10.1145/2460625.2460638"
    },
    {
      "text": "Daphne Mohajer va Pesaran. 2018. People and Placelessness: Paper Clothing in Japan. Fashion Practice 10, 2 (May 2018), 236–255. https://doi.org/10.1080/17569370.2018.1458498",
      "doi": ""
    },
    {
      "text": "Brad Myers, Scott E. Hudson, and Randy Pausch. 2000. Past, Present, and Future of User Interface Software Tools. ACM Transactions on Computer-Human Interaction 7, 1 (March 2000), 3–28. https://doi.org/10.1145/344949.344959",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Koya Narumi, Xinyang Shi, Steve Hodges, Yoshihiro Kawahara, Shinya Shimizu, and Tohru Asami. 2015. Circuit Eraser: A Tool for Iterative Design with Conductive Ink. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 2307–2312. https://doi.org/10.1145/2702613.2732876",
      "doi": "10.1145/2702613.2732876"
    },
    {
      "text": "Aditya Shekhar Nittala, Anusha Withana, Narjes Pourjafarian, and Jürgen Steimle. 2018. Multi-Touch Skin: A Thin and Flexible Multi-Touch Sensor for On-Skin Input. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18, Vol. 2018-April). ACM, Montréal, QC, Canada, 1–12. https://doi.org/10.1145/3173574.3173607",
      "doi": "10.1145/3173574.3173607"
    },
    {
      "text": "Derrick Njobuenwu, Esio Oboho, and Rhoda Gumus. 2007. Determination of Contact Angle from Contact Area of Liquid Droplet Spreading on Solid Substrate. Leonardo Electronic Journal of Practices and Technologies 6 (Jan. 2007), 29–38.",
      "doi": ""
    },
    {
      "text": "Masaya Nogi, Natsuki Komoda, Kanji Otsuka, and Katsuaki Suganuma. 2013. Foldable Nanopaper Antennas for Origami Electronics. Nanoscale 5, 10 (May 2013), 4395–4399. https://doi.org/10.1039/C3NR00231D",
      "doi": ""
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio: Digital Fabrication of Interactive and Shape-Changing Objects With Foldable Printed Electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(UIST ’15). ACM, Charlotte, NC, USA, 223–232. https://doi.org/10.1145/2807442.2807494",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: Fabricating Highly Customizable Thin-Film Touch-Displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(UIST ’14). ACM, Honolulu, HI, USA, 281–290. https://doi.org/10.1145/2642918.2647413",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Maggie Orth, J. R. Smith, E. R. Post, J. A. Strickon, and E. B. Cooper. 1998. Musical Jacket. In ACM SIGGRAPH 98 Electronic Art and Animation Catalog(SIGGRAPH ’98). ACM, New York, NY, USA, 38. https://doi.org/10.1145/281388.281456",
      "doi": "10.1145/281388.281456"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 4216–4227. https://doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Narjes Pourjafarian, Marion Koelle, and Bruno Fruchard. 2021. BodyStylus: Freehand On-Body Design and Fabrication of Epidermal Interfaces. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21, 1). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3411764.3445475",
      "doi": "10.1145/3411764.3445475"
    },
    {
      "text": "Narjes Pourjafarian, Marion Koelle, Fjolla Mjaku, Paul Strohmeier, and Jürgen Steimle. 2022. Print-A-Sketch: A Handheld Printer for Physical Sketching of Circuits and Sensors on Everyday Surfaces. In CHI Conference on Human Factors in Computing Systems(CHI ’22). ACM, New Orleans, LA, USA, 1–17. https://doi.org/10.1145/3491102.3502074",
      "doi": "10.1145/3491102.3502074"
    },
    {
      "text": "Emmi Pouta and Jussi Ville Mikkonen. 2022. Woven eTextiles in HCI — a Literature Review. In Designing Interactive Systems Conference(DIS ’22). ACM, Virtual Event, Australia, 1099–1118. https://doi.org/10.1145/3532106.3533566",
      "doi": "10.1145/3532106.3533566"
    },
    {
      "text": "Jie Qi. 2016. Paper Electronics : Circuits on Paper for Learning and Self-Expression. Thesis. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Jie Qi and Leah Buechley. 2012. Animating Paper Using Shape Memory Alloys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). Association for Computing Machinery, New York, NY, USA, 749–752. https://doi.org/10.1145/2207676.2207783",
      "doi": "10.1145/2207676.2207783"
    },
    {
      "text": "Jie Qi and Leah Buechley. 2014. Sketching in Circuits: Designing and Building Electronics on Paper. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’14). ACM, Toronto, Ontario, Canada, 1713–1722. https://doi.org/10.1145/2556288.2557391",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Jie Qi, Leah Buechley, Andrew \"bunnie\" Huang, Patricia Ng, Sean Cross, and Joseph A. Paradiso. 2018. Chibitronics in the Wild: Engaging New Communities in Creating Technology with Paper Electronics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173826",
      "doi": "10.1145/3173574.3173826"
    },
    {
      "text": "Jie Qi, Andrew \"bunnie\" Huang, and Joseph Paradiso. 2015. Crafting Technology with Circuit Stickers. In Proceedings of the 14th International Conference on Interaction Design and Children(IDC ’15). Association for Computing Machinery, New York, NY, USA, 438–441. https://doi.org/10.1145/2771839.2771873",
      "doi": "10.1145/2771839.2771873"
    },
    {
      "text": "Mitchel Resnick and Brian Silverman. 2005. Some Reflections on Designing Construction Kits for Kids. In Proceedings of the 2005 Conference on Interaction Design and Children(IDC ’05). Association for Computing Machinery, New York, NY, USA, 117–122. https://doi.org/10.1145/1109540.1109556",
      "doi": "10.1145/1109540.1109556"
    },
    {
      "text": "Behnam Sadri, Debkalpa Goswami, and Ramses Martinez. 2018. Rapid Fabrication of Epidermal Paper-Based Electronic Devices Using Razor Printing. Micromachines 9, 9 (Aug. 2018), 420. https://doi.org/10.3390/mi9090420",
      "doi": ""
    },
    {
      "text": "Behnam Sadri, Debkalpa Goswami, Marina Sala de Medeiros, Aniket Pal, Beatriz Castro, Shihuan Kuang, and Ramses V. Martinez. 2018. Wearable and Implantable Epidermal Paper-Based Electronics. ACS Applied Materials & Interfaces 10, 37 (Sept. 2018), 31061–31068. https://doi.org/10.1021/acsami.8b11020",
      "doi": ""
    },
    {
      "text": "Anna Schepper and Lene Schepper. 2015. The Art of Paper Weaving: 46 Colorful, Dimensional Projects–Includes Full-Size Templates Inside & Online Plus Practice Paper for One Project. Quarry Books, Beverly, MA, USA.",
      "doi": ""
    },
    {
      "text": "Norihisa Segawa, Kunihiro Kato, and Hiroyuki Manabe. 2019. Rapid Prototyping of Paper Electronics Using a Metal Leaf and Laser Printer. In The Adjunct Publication of the 32nd Annual ACM Symposium on User Interface Software and Technology(UIST ’19). ACM, New Orleans, LA, USA, 99–101. https://doi.org/10.1145/3332167.3356885",
      "doi": "10.1145/3332167.3356885"
    },
    {
      "text": "Ben Shneiderman. 2007. Creativity Support Tools: Accelerating Discovery and Innovation. Commun. ACM 50, 12 (Dec. 2007), 20–32. https://doi.org/10.1145/1323688.1323689",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Ruojia Sun, Ryosuke Onose, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). ACM, New York, NY, USA, 365–377. https://doi.org/10.1145/3357236.3395548",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Ye Tao, Guanyun Wang, Xiaolian Zhang, Cheng Yao, and Fangtian Ying. 2015. A Weaving Creation System for Bamboo Craft-Design Collaborations. In SIGGRAPH Asia 2015 Posters(SA ’15). Association for Computing Machinery, New York, NY, USA, 1. https://doi.org/10.1145/2820926.2820959",
      "doi": "10.1145/2820926.2820959"
    },
    {
      "text": "Marc Teyssier, Gilles Bailly, Catherine Pelachaud, Eric Lecolinet, Andrew Conn, and Anne Roudaut. 2019. Skin-On Interfaces: A Bio-Driven Approach for Artificial Skin Design to Cover Interactive Devices. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(UIST ’19). ACM, New Orleans, LA, USA, 307–322. https://doi.org/10.1145/3332165.3347943",
      "doi": "10.1145/3332165.3347943"
    },
    {
      "text": "Cesar Torres, Jasper O’Leary, Molly Nicholas, and Eric Paulos. 2017. Illumination Aesthetics: Light as a Creative Material within Computational Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 6111–6122. https://doi.org/10.1145/3025453.3025466",
      "doi": "10.1145/3025453.3025466"
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, and Lining Yao. 2018. Printed Paper Actuator: A Low-cost Reversible Actuation and Sensing Method for Shape Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, Montreal QC Canada, 1–12. https://doi.org/10.1145/3173574.3174143",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "Yanan Wang, Shijian Luo, Yujia Lu, Hebo Gong, Yexing Zhou, Shuai Liu, and Preben Hansen. 2017. AnimSkin: Fabricating Epidermis with Interactive, Functional and Aesthetic Color Animation. In Proceedings of the 2017 Conference on Designing Interactive Systems(DIS ’17). ACM, Edinburgh, United Kingdom, 397–401. https://doi.org/10.1145/3064663.3064687",
      "doi": "10.1145/3064663.3064687"
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, Seoul, Republic of Korea, 2991–3000. https://doi.org/10.1145/2702123.2702391",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jürgen Steimle. 2017. SkinMarks: Enabling Interactions on Body Landmarks Using Conformal Skin Electronics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, Denver, CO, USA, 3095–3105. https://doi.org/10.1145/3025453.3025704",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Anusha Withana, Daniel Groeger, and Jürgen Steimle. 2018. Tacttoo: A Thin and Feel-Through Tattoo for On-Skin Tactile Output. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(UIST ’18). ACM, Berlin, Germany, 365–378. https://doi.org/10.1145/3242587.3242645",
      "doi": "10.1145/3242587.3242645"
    },
    {
      "text": "Yadong Xu, Qihui Fei, Margaret Page, Ganggang Zhao, Yun Ling, Samuel B. Stoll, and Zheng Yan. 2021. Paper-Based Wearable Electronics. iScience 24, 7 (2021), 102736. https://doi.org/10.1016/j.isci.2021.102736",
      "doi": ""
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2018. Pulp Nonfiction: Low-Cost Touch Tracking for Paper. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, Montreal, QC, Canada, 1–11. https://doi.org/10.1145/3173574.3173691",
      "doi": "10.1145/3173574.3173691"
    },
    {
      "text": "Clement Zheng, Peter Gyory, and Ellen Yi Luen Do. 2020. Tangible Interfaces with Printed Paper Markers. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). Association for Computing Machinery, New York, NY, USA, 909–923. https://doi.org/10.1145/3357236.3395578",
      "doi": "10.1145/3357236.3395578"
    },
    {
      "text": "Clement Zheng, HyunJoo Oh, Laura Devendorf, and Ellen Yi-Luen Do. 2019. Sensing Kirigami. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). ACM, San Diego, CA, USA, 921–934. https://doi.org/10.1145/3322276.3323689",
      "doi": "10.1145/3322276.3323689"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through Design as a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). Association for Computing Machinery, New York, NY, USA, 493–502. https://doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}