{
  "doi": "10.1145/3544548.3581275",
  "title": "How Language Formality in Security and Privacy Interfaces Impacts Intended Compliance",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2023,
  "badges": [],
  "abstract": "Strong end-user security practices benefit both the user and hosting platform, but it is not well understood how companies communicate with their users to encourage these practices. This paper explores whether web companies and their platforms use different levels of language formality in these communications and tests the hypothesis that higher language formality leads to users’ increased intention to comply. We contribute a dataset and systematic analysis of 1,817 English language strings in web security and privacy interfaces across 13 web platforms, showing strong variations in language. An online study with 512 participants further demonstrated that people perceive differences in the language formality across platforms and that a higher language formality is associated with higher self-reported intention to comply. Our findings suggest that formality can be an important factor in designing effective security and privacy prompts. We discuss implications of these results, including how to balance formality with platform language style. In addition to being the first piece of work to analyze language formality in user security, these findings provide valuable insights into how platforms can best communicate with users about account security.",
  "authors": [
    {
      "name": "Jackson Stokes",
      "institution": "Paul G. Allen School of Computer Science and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100521408",
      "orcid": "0000-0003-2449-2372"
    },
    {
      "name": "Tal August",
      "institution": "Paul G. Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260385",
      "orcid": "0000-0001-6726-4009"
    },
    {
      "name": "Robert A Marver",
      "institution": "Paul G. Allen School of Computer Science and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778539",
      "orcid": "0000-0002-0688-5079"
    },
    {
      "name": "Alexei Czeskis",
      "institution": "ID.me, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381605379",
      "orcid": "0000-0002-9048-0460"
    },
    {
      "name": "Franziska Roesner",
      "institution": "Paul G. Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467642436",
      "orcid": "0000-0001-8735-4810"
    },
    {
      "name": "Tadayoshi Kohno",
      "institution": "Paul G. Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100058677",
      "orcid": "0000-0002-4899-226X"
    },
    {
      "name": "Katharina Reinecke",
      "institution": "Paul G. Allen School of Computer Science and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583575",
      "orcid": "0000-0001-7897-9325"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, Yang Wang, and Shomir Wilson. 2017. Nudges for Privacy and Security: Understanding and Assisting Users’ Choices Online. ACM Comput. Surv. 50, 3, Article 44 (2017), 41 pages. https://doi.org/10.1145/3054926",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Tal August, Dallas Card, Gary Hsieh, Noah A. Smith, and Katharina Reinecke. 2020. Explain like I Am a Scientist: The Linguistic Barriers of Entry to r/Science. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376524",
      "doi": "10.1145/3313831.3376524"
    },
    {
      "text": "Tal August and Katharina Reinecke. 2019. Pay Attention, Please: Formal Language Improves Attention in Volunteer and Paid Online Experiments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300478",
      "doi": "10.1145/3290605.3300478"
    },
    {
      "text": "Cristian Bravo-Lillo, Lorrie Faith Cranor, Julie Downs, and Saranga Komanduri. 2011. Bridging the Gap in Computer Security Warnings: A Mental Model Approach. IEEE Security and Privacy 9, 2 (2011), 18–26. https://doi.org/10.1109/MSP.2010.198",
      "doi": "10.1109/MSP.2010.198"
    },
    {
      "text": "Penelope E. Brown and S. Levinson. 1987. Politeness: some universals in language usage.",
      "doi": ""
    },
    {
      "text": "Moira Burke and Robert Kraut. 2008. Mind Your Ps and Qs: The Impact of Politeness and Rudeness in Online Communities. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work(CSCW ’08). Association for Computing Machinery, New York, NY, USA, 281–284. https://doi.org/10.1145/1460563.1460609",
      "doi": "10.1145/1460563.1460609"
    },
    {
      "text": "Ana Caraban, Evangelos Karapanos, Daniel Gonçalves, and Pedro Campos. 2019. 23 Ways to Nudge: A Review of Technology-Mediated Nudging in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300733",
      "doi": "10.1145/3290605.3300733"
    },
    {
      "text": "Jessica Colnago, Summer Devlin, Maggie Oates, Chelse Swoopes, Lujo Bauer, Lorrie Cranor, and Nicolas Christin. 2018. “It’s Not Actually That Horrible”: Exploring Adoption of Two-Factor Authentication at a University. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174030",
      "doi": "10.1145/3173574.3174030"
    },
    {
      "text": "Robert Cudeck. 1996. Mixed-effects Models in the Study of Individual Differences with Repeated Measures Data.Multivariate behavioral research 31 3 (1996), 371–403.",
      "doi": ""
    },
    {
      "text": "Cristian Danescu-Niculescu-Mizil, Moritz Sudhof, Dan Jurafsky, Jure Leskovec, and Christopher Potts. 2013. A computational approach to politeness with application to social factors. In Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, Sofia, Bulgaria, 250–259. https://www.aclweb.org/anthology/P13-1025",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Adam D.I. Kramer, Laura A. Dabbish, and Jason I. Hong. 2014. Increasing Security Sensitivity With Social Proof: A Large-Scale Experimental Confirmation. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (Scottsdale, Arizona, USA). Association for Computing Machinery, New York, NY, USA, 739–749. https://doi.org/10.1145/2660267.2660271",
      "doi": "10.1145/2660267.2660271"
    },
    {
      "text": "James Price Dillard and Michael Pfau. 2002. The Persuasion Handbook: Developments in Theory and Practice.",
      "doi": ""
    },
    {
      "text": "Jonathan Dutson, Danny Allen, Dennis Eggett, and Kent Seamons. 2019. Don’t Punish all of us: Measuring User Attitudes about Two-Factor Authentication. In 2019 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). IEEE, IEEE, EuroS, 119–128.",
      "doi": ""
    },
    {
      "text": "Cori Faklaris, Laura Dabbish, and Jason I. Hong. 2019. A Self-Report Measure of End-User Security Attitudes (SA-6). In Proceedings of the Fifteenth USENIX Conference on Usable Privacy and Security (Santa Clara, CA, USA) (SOUPS’19). USENIX Association, USA, 61–77.",
      "doi": "10.5555/3361476.3361481"
    },
    {
      "text": "Adrienne Porter Felt, Alex Ainslie, Robert W. Reeder, Sunny Consolvo, Somas Thyagaraja, Alan Bettes, Helen Harris, and Jeff Grimes. 2015. Improving SSL Warnings: Comprehension and Adherence. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2893–2902. https://doi.org/10.1145/2702123.2702442",
      "doi": "10.1145/2702123.2702442"
    },
    {
      "text": "Adrienne Porter Felt, Robert W. Reeder, Alex Ainslie, Helen Harris, Max Walker, Christopher Thompson, Mustafa Embre Acer, Elisabeth Morant, and Sunny Consolvo. 2016. Rethinking Connection Security Indicators. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). USENIX Association, Denver, CO, 1–14. https://www.usenix.org/conference/soups2016/technical-sessions/presentation/porter-felt",
      "doi": ""
    },
    {
      "text": "S. M. Furnell, P. Bryant, and A. D. Phippen. 2007. Assessing the Security Perceptions of Personal Internet Users. Comput. Secur. 26, 5 (2007), 410–417. https://doi.org/10.1016/j.cose.2007.03.001",
      "doi": "10.1016/j.cose.2007.03.001"
    },
    {
      "text": "Maximilian Golla, Grant Ho, Marika Lohmus, Monica Pulluri, and Elissa M. Redmiles. 2021. Driving 2FA Adoption at Scale: Optimizing Two-Factor Authentication Notification Design Patterns. In 30th USENIX Security Symposium (USENIX Security 21). USENIX Association, usenix, 109–126. https://www.usenix.org/conference/usenixsecurity21/presentation/golla",
      "doi": ""
    },
    {
      "text": "Maximilian Golla, Grant Ho, Marika Lohmus, Monica Pulluri, and Elissa M Redmiles. 2021. Driving 2FA Adoption at Scale: Optimizing Two-Factor Authentication Notification Design Patterns. In 30th {USENIX} Security Symposium ({USENIX} Security 21). USENIX Association, usenix, 109–126.",
      "doi": ""
    },
    {
      "text": "Marian Harbach, Markus Hettig, Susanne Weber, and Matthew Smith. 2014. Using Personal Examples to Improve Risk Communication for Security and Privacy Decisions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2647–2656. https://doi.org/10.1145/2556288.2556978",
      "doi": "10.1145/2556288.2556978"
    },
    {
      "text": "Marian Harbach, Emanuel Von Zezschwitz, Andreas Fichtner, Alexander De Luca, and Matthew Smith. 2014. It’s a Hard Lock Life: A Field Study of Smartphone (Un)Locking Behavior and Risk Perception. In Proceedings of the Tenth USENIX Conference on Usable Privacy and Security (Menlo Park, CA). USENIX Association, USA, 213–230.",
      "doi": ""
    },
    {
      "text": "Andrew Head, Kyle Lo, Dongyeop Kang, Raymond Fok, Sam Skjonsberg, Daniel S. Weld, and Marti A. Hearst. 2021. Augmenting Scientific Papers with Just-in-Time, Position-Sensitive Definitions of Terms and Symbols. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems 1(2021), 1 pages.",
      "doi": "10.1145/3411764.3445648"
    },
    {
      "text": "Francis Heylighen and Jean-Marc Dewaele. 1999. Formality of language: definition, measurement and behavioral determinants. Interner Bericht, Center “Leo Apostel”, Vrije Universiteit Brüssel 4 (1999), 1.",
      "doi": ""
    },
    {
      "text": "Francis Heylighen and Jean-Marc Dewaele. 2002. Variation in the contextuality of language: An empirical measure. Foundations of science 7, 3 (2002), 293–340.",
      "doi": ""
    },
    {
      "text": "Mitch Holmes and Jacques Ophoff. 2019. Online security behaviour: factors influencing intention to adopt two-factor authentication. In Proceedings of the 14th International conference on cyber warfare and security, ICCWS 2019(Proceedings), Noelle van der Waag-Cowling and Louise Leenen (Eds.). Academic Conferences and Publishing International Limited, ACPIL, 123–132. 14th International Conference on Cyber Warfare and Security, ICCWS 2019 ; Conference date: 28-02-2019 Through 01-03-2019.",
      "doi": ""
    },
    {
      "text": "Iulia Ion, Rob Reeder, and Sunny Consolvo. 2015. \"...No One Can Hack My Mind\": Comparing Expert and Non-Expert Security Practices. In Proceedings of the Eleventh USENIX Conference on Usable Privacy and Security (Ottawa, Canada) (SOUPS ’15). USENIX Association, USA, 327–346.",
      "doi": ""
    },
    {
      "text": "Eshin Jolly. 2018. Pymer4: Connecting R and Python for Linear Mixed Modeling. Journal of Open Source Software 3, 31 (2018), 862. https://doi.org/10.21105/joss.00862",
      "doi": ""
    },
    {
      "text": "Shibamouli Lahiri. 2015. SQUINKY! A Corpus of Sentence-level Formality, Informativeness, and Implicature. arXiv 1(2015), 1. arxiv:1506.02306https://arxiv.org/pdf/1506.02306.pdf http://arxiv.org/abs/1506.02306",
      "doi": ""
    },
    {
      "text": "Shizuka Lauwereyns. 2002. Hedges in Japanese conversation: The influence of age, sex, and formality. Language Variation and Change 14, 2 (2002), 239–259.",
      "doi": ""
    },
    {
      "text": "Jo Mackiewicz and Rachel Moeller. 2004. Why people perceive typefaces to have different personalities. In International Professional Communication Conference, 2004. IPCC 2004. Proceedings.IEEE, IPCC, 304–313.",
      "doi": ""
    },
    {
      "text": "J. C. Marquié, L. Jourdan-Boddaert, and N. Huet. 2002. Do older adults underestimate their actual computer knowledge?Behaviour & Information Technology 21, 4 (2002), 273–280.",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Kerwell Liao, Anna Turner, Marianne Berkovich, Robert Reeder, and Sunny Consolvo. 2016. \"She’ll Just Grab Any Device That’s Closer\": A Study of Everyday Device and Account Sharing in Households. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5921–5932. https://doi.org/10.1145/2858036.2858051",
      "doi": "10.1145/2858036.2858051"
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-Rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 72 (nov 2019), 23 pages. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Rand DG Mosleh M, Pennycook G. 2020. Self-reported willingness to share political news articles in online surveys correlates with actual sharing on Twitter. PLoS ONE 1(2020), 1. https://doi.org/10.1371/journal.pone.0228882",
      "doi": ""
    },
    {
      "text": "Ellie Pavlick and Joel Tetreault. 2016. An Empirical Analysis of Formality in Online Communication. Transactions of the Association for Computational Linguistics 4 (2016), 61–74. https://doi.org/10.1162/tacl_a_00083",
      "doi": ""
    },
    {
      "text": "Kelly Peterson, Matt Hohensee, and Fei Xia. 2011. Email Formality in the Workplace: A Case Study on the Enron Corpus. In Proceedings of the Workshop on Language in Social Media (LSM 2011). Association for Computational Linguistics, Portland, Oregon, 86–95. https://www.aclweb.org/anthology/W11-0711",
      "doi": ""
    },
    {
      "text": "Sarah Prange, Niklas Thiem, Michael Fröhlich, and Florian Alt. 2022. “Secure settings are quick and easy!” – Motivating End-Users to Choose Secure Smart Home Configurations. Proceedings of the 2022 International Conference on Advanced Visual Interfaces 1(2022), 1.",
      "doi": "10.1145/3531073.3531089"
    },
    {
      "text": "Anabel Quan-Haase and Dennis Ho. 2020. Online privacy concerns and privacy protection strategies among older adults in East York, Canada. Journal of the Association for Information Science and Technology 71 (2020), 1. https://doi.org/10.1002/asi.24364",
      "doi": "10.1002/asi.24364"
    },
    {
      "text": "Sudha Rao and Joel Tetreault. 2018. Dear Sir or Madam, May I introduce the YAFC Corpus: Corpus, Benchmarks and Metrics for Formality Style Transfer. CoRR abs/1803.06535(2018), 1. arXiv:1803.06535http://arxiv.org/abs/1803.06535",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Michelle L. Mazurek, and John P. Dickerson. 2018. Dancing Pigs or Externalities? Measuring the Rationality of Security Decisions. In Proceedings of the 2018 ACM Conference on Economics and Computation (Ithaca, NY, USA). Association for Computing Machinery, New York, NY, USA, 215–232. https://doi.org/10.1145/3219166.3219185",
      "doi": "10.1145/3219166.3219185"
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z. Gajos. 2015. LabintheWild: Conducting Large-Scale Online Experiments With Uncompensated Samples. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1364–1378. https://doi.org/10.1145/2675133.2675246",
      "doi": "10.1145/2675133.2675246"
    },
    {
      "text": "Kristina M Rennekamp and Patrick D Witz. 2020. Linguistic Formality and Audience Engagement: Investors’ Reactions to Characteristics of Social Media Disclosures. Contemporary Accounting Research 1 (2020), 1.",
      "doi": ""
    },
    {
      "text": "Navdeep S. Sahni, S. Wheeler, and Pradeep Chintagunta. 2018. Personalization in Email Marketing: The Role of Noninformative Advertising Content. Mark. Sci. 37(2018), 236–258.",
      "doi": "10.1287/mksc.2017.1066"
    },
    {
      "text": "Yukiko Sawaya, Mahmood Sharif, Nicolas Christin, Ayumu Kubota, Akihiro Nakarai, and Akira Yamada. 2017. Self-Confidence Trumps Knowledge: A Cross-Cultural Study of Security Behavior. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA). Association for Computing Machinery, New York, NY, USA, 2202–2214. https://doi.org/10.1145/3025453.3025926",
      "doi": "10.1145/3025453.3025926"
    },
    {
      "text": "Skipper Seabold and Josef Perktold. 2010. statsmodels: Econometric and statistical modeling with python. In 9th Python in Science Conference, Stéfan van der Waltand Jarrod Millman (Eds.). scipy, North Carolina Chapel Hill, 92 – 96. https://doi.org/10.25080/Majora-92bf1922-011",
      "doi": ""
    },
    {
      "text": "Brian Stanton, Mary Theofanos, Sandra Prettyman, and Susanne Furman. 2016. Security Fatigue. IT Professional 18(2016), 26–32. https://doi.org/10.1109/MITP.2016.84",
      "doi": ""
    },
    {
      "text": "Patricia Valdez and Albert Mehrabian. 1994. Effects of color on emotions.Journal of experimental psychology: General 123, 4 (1994), 394.",
      "doi": ""
    },
    {
      "text": "Paul van Schaik, Debora Jeske, Joseph Onibokun, Lynne Coventry, Jurjen Jansen, and Petko Kusev. 2017. Risk perceptions of cyber-security and precautionary behaviour. Computers in Human Behavior 75 (2017), 547–559.",
      "doi": "10.1016/j.chb.2017.05.038"
    },
    {
      "text": "Zhao Wang and Aron Culotta. 2018. When Do Words Matter? Understanding the Impact of Lexical Choice on Audience Perception Using Individual Treatment Effect Estimation. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. AAAI, AAAI, 7233–7240.",
      "doi": ""
    },
    {
      "text": "Rick Wash, Emilee Rader, Ruthie Berman, and Zac Wellmer. 2016. Understanding Password Choices: How Frequently Entered Passwords Are Re-Used across Websites. In Proceedings of the Twelfth USENIX Conference on Usable Privacy and Security(SOUPS ’16). USENIX Association, USA, 175–188.",
      "doi": ""
    },
    {
      "text": "Alma Whitten and J Doug Tygar. 1998. Usability of security: A case study. Technical Report. CARNEGIE-MELLON UNIV PITTSBURGH PA DEPT OF COMPUTER SCIENCE.",
      "doi": ""
    },
    {
      "text": "Jiaheng Xie, Bin Zhang, Susan Brown, and Daniel Zeng. 2021. Write Like a Pro or an Amateur? Effect of Medical Language Formality. ACM Trans. Manage. Inf. Syst. 12, 3, Article 24(2021), 25 pages. https://doi.org/10.1145/3458752",
      "doi": "10.1145/3458752"
    },
    {
      "text": "Yixin Zou, Kevin Roundy, Acar Tamersoy, Saurabh Shintre, Johann Roturier, and Florian Schaub. 2020. Examining the Adoption and Abandonment of Security, Privacy, and Identity Theft Protection Practices. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376570",
      "doi": "10.1145/3313831.3376570"
    }
  ]
}