{
  "doi": "10.1145/3544548.3581071",
  "title": "Positional Variance Profiles (PVPs): A New Take on the Speed-Accuracy Trade-off",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Fitts’ law is a behavioral model, used to design protocols and analyze data from pointing experiments. These are usually conducted in HCI to evaluate input performance. We recently proposed an alternative method to characterize input performance, called the method of PVPs in 1D, based on 1) a dual-minimization protocol, and 2) an analysis of the variability of entire trajectories. We extend the method in 2D; our contributions include new metrics, a new protocol, and a Python library. We also present the results of a controlled experiment where the new method is validated using three devices (mouse, touchpad, controller): effect sizes in the 2D case replicate those previously found. We also propose a comparison between Fitts’ law and our novel evaluation: the method of PVPs provides more information than Fitts’ law, and can predict its parameters. We discuss how this new method may relieve open problems of Fitts’ law.",
  "tags": [
    "pointing",
    "PVP",
    "evaluation",
    "Fitts’ law"
  ],
  "authors": [
    {
      "name": "Julien Gori",
      "institution": "ISIR, CNRS, Sorbonne Université, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160990",
      "orcid": "0000-0002-3272-9176"
    },
    {
      "name": "Quentin Bellut",
      "institution": "Sorbonne Université, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781444",
      "orcid": "0000-0002-2608-4594"
    }
  ],
  "references": [
    {
      "text": "Johnny Accot and Shumin Zhai. 2003. Refining Fitts’ law models for bivariate pointing. In Proceedings of the SIGCHI conference on Human factors in computing systems. 193–200.",
      "doi": "10.1145/642611.642646"
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using lme4. Journal of Statistical Software 67, 1 (2015), 1–48. https://doi.org/10.18637/jss.v067.i01",
      "doi": ""
    },
    {
      "text": "Bastien Berret, Adrien Conessa, Nicolas Schweighofer, and Etienne Burdet. 2021. Stochastic optimal feedforward-feedback control determines timing and variability of arm movements with or without vision. PLOS Computational Biology 17, 6 (2021), e1009047.",
      "doi": ""
    },
    {
      "text": "S. K. Card, W. K. English, and B. J. Burr. 1978. Evaluation of mouse, rate-controlled isometric joystick, step keys, and text keys for text selection on a CRT. Ergonomics 21, 8 (1978), 601–613. https://doi.org/10.1080/00140137808931762",
      "doi": ""
    },
    {
      "text": "E. R. F. W. Crossman. 1957. The speed and accuracy of simple hand movements. Technical Report.  .",
      "doi": ""
    },
    {
      "text": "E. R. F. W. Crossman and P. J. Goodeve. 1983. Feedback control of hand-movement and Fitts’ law. The Quarterly Journal of Experimental Psychology 35, 2(1983), 251–278.",
      "doi": ""
    },
    {
      "text": "H. Drewes. 2010. Only One Fitts’ Law Formula Please!. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI EA ’10). ACM, New York, NY, USA, 2813–2822. https://doi.org/10.1145/1753846.1753867",
      "doi": "10.1145/1753846.1753867"
    },
    {
      "text": "Iddo Eliazar. 2015. How random is a random vector?Annals of Physics 363(2015), 164–184.",
      "doi": ""
    },
    {
      "text": "Digby Elliott, Steve Hansen, Lawrence EM Grierson, James Lyons, Simon J Bennett, and Spencer J Hayes. 2010. Goal-directed aiming: two components but multiple processes.Psychological bulletin 136, 6 (2010), 1023.",
      "doi": ""
    },
    {
      "text": "Digby Elliott, Werner F Helsen, and Romeo Chua. 2001. A century later: Woodworth’s (1899) two-component model of goal-directed aiming.Psychological bulletin 127, 3 (2001), 342. https://doi.org/10.1037/0033-2909.127.3.342",
      "doi": ""
    },
    {
      "text": "Digby Elliott, James Lyons, Spencer J Hayes, James J Burkitt, James W Roberts, Lawrence EM Grierson, Steve Hansen, and Simon J Bennett. 2017. The multiple process model of goal-directed reaching revisited. Neuroscience & Biobehavioral Reviews 72 (2017), 95–110. https://doi.org/10.1016/j.neubiorev.2016.11.016",
      "doi": ""
    },
    {
      "text": "P. M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement.Journal of experimental psychology 47, 6 (1954), 381. https://doi.org/10.1037/h0045689",
      "doi": ""
    },
    {
      "text": "Paul M Fitts and James R Peterson. 1964. Information capacity of discrete motor responses.Journal of experimental psychology 67, 2 (1964), 103. https://doi.org/10.1037/h0045689",
      "doi": ""
    },
    {
      "text": "K. Gan and E. R. Hoffmann. 1988. Geometrical conditions for ballistic and visually controlled movements. Ergonomics 31, 5 (1988), 829–839.",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and Jennifer Hill. 2006. Data analysis using regression and multilevel/hierarchical models. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Julien Gori and Olivier Rioul. 2020. A feedback information-theoretic transmission scheme (FITTS) for modeling trajectory variability in aimed movements. Biological Cybernetics 114, 6 (2020), 621–641.",
      "doi": ""
    },
    {
      "text": "J. Gori, O. Rioul, and Y. Guiard. 2017. To Miss is Human: Information-Theoretic Rationale for Target Misses in Fitts’ Law. In CHI’17: Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems. ACM, Denver, USA, 5.",
      "doi": ""
    },
    {
      "text": "J. Gori, O. Rioul, and Y. Guiard. 2018. Speed-Accuracy Tradeoff: A Formal Information-Theoretic Transmission Scheme (FITTS). ACM Trans. Comput.-Hum. Interact. 25, 5, Article 27 (Sept. 2018), 33 pages. https://doi.org/10.1145/3231595",
      "doi": "10.1145/3231595"
    },
    {
      "text": "Julien Gori, Olivier Rioul, and Yves Guiard. 2018. Speed-accuracy tradeoff: A formal information-theoretic transmission scheme (fitts). ACM Transactions on Computer-Human Interaction (TOCHI) 25, 5(2018), 1–33.",
      "doi": "10.1145/3231595"
    },
    {
      "text": "Peter Green and Catriona J. MacLeod. 2016. simr: an R package for power analysis of generalised linear mixed models by simulation. Methods in Ecology and Evolution 7, 4 (2016), 493–498. https://doi.org/10.1111/2041-210X.12504",
      "doi": ""
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2005. A probabilistic approach to modeling two-dimensional pointing. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 3(2005), 435–459.",
      "doi": "10.1145/1096737.1096741"
    },
    {
      "text": "Yves Guiard. 2019. Polar and Cartesian Structure in the Data of Fitts’s (1954) Classic Experiments-With a Criterion for Distinguishing a Strong and a Weak Version of Fitts’ Law. Journal of Motor Behavior  ,   (2019), 1–23.",
      "doi": ""
    },
    {
      "text": "Y. Guiard and H. B. Olafsdottir. 2011. On the measurement of movement difficulty in the standard approach to Fitts’ law. PloS one 6, 10 (2011), e24389. https://doi.org/10.1371/journal.pone.0024389",
      "doi": ""
    },
    {
      "text": "Yves Guiard, Halla B Olafsdottir, and Simon T Perrault. 2011. Fitt’s law as an explicit time/error trade-off. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 1619–1628. https://doi.org/10.1145/1978942.1979179",
      "doi": "10.1145/1978942.1979179"
    },
    {
      "text": "Y. Guiard and O. Rioul. 2015. A mathematical description of the speed/accuracy trade-off of aimed movement. In Proceedings of the 2015 British HCI Conference. ACM, New York, 91–100.",
      "doi": ""
    },
    {
      "text": "Peter A Hancock and Karl M Newell. 1985. The movement speed-accuracy relationship in space-time. In Motor Behavior. Springer,  , 153–188.",
      "doi": ""
    },
    {
      "text": "E. R. Hoffmann. 2013. Which version/variation of Fitts’ law? A critique of information-theory models. Journal of motor behavior 45, 3 (2013), 205–215. https://doi.org/10.1080/00222895.2013.778815",
      "doi": ""
    },
    {
      "text": "Richard J Jagacinski and Donald L Monk. 1985. Fitts’ Law in Two dimensions with hand and head movements movements. Journal of motor behavior 17, 1 (1985), 77–95.",
      "doi": ""
    },
    {
      "text": "I. S. MacKenzie. 1989. A note on the information-theoretic basis for Fitts’ law. Journal of motor behavior 21, 3 (1989), 323–330. https://doi.org/10.1080/00222895.1989.10735486",
      "doi": ""
    },
    {
      "text": "I. S. Mackenzie. 1992. Fitts’ law as a performance model in human-computer interaction. Ph. D. Dissertation. University of Toronto.",
      "doi": "10.5555/143848"
    },
    {
      "text": "I. S. MacKenzie and W. Buxton. 1992. Extending Fitts’ law to two-dimensional tasks. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, New York, 219–226.",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Antti Oulasvirta, and Roderick Murray-Smith. 2017. Control theoretic models of pointing. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 4(2017), 27. https://doi.org/10.1145/3121431",
      "doi": "10.1145/3121431"
    },
    {
      "text": "Davy Paindaveine. 2008. A canonical definition of shape. Statistics & probability letters 78, 14 (2008), 2240–2247.",
      "doi": ""
    },
    {
      "text": "R. Plamondon and A. M. Alimi. 1997. Speed/accuracy trade-offs in target-directed movements. Behavioral and Brain Sciences 20, 02 (1997), 279–303. https://doi.org/10.1017/S0140525X97001441",
      "doi": ""
    },
    {
      "text": "Hiroaki Sakoe and Seibi Chiba. 1978. Dynamic programming algorithm optimization for spoken word recognition. IEEE transactions on acoustics, speech, and signal processing 26, 1(1978), 43–49.",
      "doi": ""
    },
    {
      "text": "R. A. Schmidt, H. Zelaznik, B. Hawkins, James S. F., and J. T. Quinn Jr. 1979. Motor-output variability: a theory for the accuracy of rapid motor acts.Psychological review 86, 5 (1979), 415.",
      "doi": ""
    },
    {
      "text": "R William Soukoreff and I Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts’ law research in HCI. International journal of human-computer studies 61, 6 (2004), 751–789. https://doi.org/10.1016/j.ijhcs.2004.09.001",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Emanuel Todorov. 2004. Optimality principles in sensorimotor control. Nature neuroscience 7, 9 (2004), 907–915.",
      "doi": ""
    },
    {
      "text": "J. O. Wobbrock, K. Shinohara, and A. Jansen. 2011. The effects of task dimensionality, endpoint deviation, throughput calculation, and experiment design on pointing measures and models. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, ACM,  , 1639–1648.",
      "doi": ""
    },
    {
      "text": "R. S. Woodworth. 1899. Accuracy of voluntary movement.The Psychological Review: Monograph Supplements 3, 3(1899), i.",
      "doi": ""
    },
    {
      "text": "S. Zhai. 2004. Characterizing computer input with Fitts’ law parameters—the information and non-information aspects of pointing. International Journal of Human-Computer Studies 61, 6 (2004), 791–809.",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    },
    {
      "text": "S. Zhai, J. Kong, and X. Ren. 2004. Speed–accuracy tradeoff in Fitts’ law tasks—on the equivalency of actual and nominal pointing precision. International journal of human-computer studies 61, 6 (2004), 823–856.",
      "doi": ""
    }
  ]
}