{
  "doi": "10.1145/3544548.3581107",
  "title": "A Literature Review of Video-Sharing Platform Research in HCI",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [],
  "abstract": "Video-sharing platforms (VSPs) such as YouTube, TikTok, and Twitch have grown rapidly in recent years and attracted millions of users. Research topics such as online communities, video interactions, and recommendation algorithms have drawn increasing attention. Group and community dynamics were also examined with live streaming and short-form videos. However, HCI literature lacks a holistic picture of video-sharing research themes, methods, and findings that summarizes the diverse topics on interaction modalities and communities. Prior reviews on VSPs were about a particular platform or reviewed as a part of social media. This paper contributes a scoping review of 106 articles on video-sharing published in HCI literature from 2012 to June 2022. We identified six research themes through grounded theory analysis and encoded five HCI research methods in VSP studies. We concluded a framework with five components to structure findings in video-sharing research, with which we reflect on future directions on this topic.",
  "authors": [
    {
      "name": "Ava Bartolome",
      "institution": "Computer Science and Engineering, University of Minnesota, United States and Computer Science, Clark University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702364",
      "orcid": "0000-0002-3867-994X"
    },
    {
      "name": "Shuo Niu",
      "institution": "Computer Science, Clark University, United States",
      "img": "/do/10.1145/contrib-81548540456/rel-imgonly/photo-r.jpg",
      "acmid": "81548540456",
      "orcid": "0000-0002-8316-4785"
    }
  ],
  "references": [
    {
      "text": "Kholoud Khalil Aldous, Jisun An, and Bernard J Jansen. 2022. Measuring 9 Emotions of News Posts from 8 News Organizations across 4 Social Media Platforms for 8 Months. Trans. Soc. Comput. 4, 4 (3 2022). https://doi.org/10.1145/3516491",
      "doi": "10.1145/3516491"
    },
    {
      "text": "Oscar Alvarado, Hendrik Heuer, Vero Vanden Abeele, Andreas Breiter, and Katrien Verbert. 2020. Middle-Aged Video Consumers’ Beliefs About Algorithmic Recommendations on YouTube. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (10 2020). https://doi.org/10.1145/3415192",
      "doi": "10.1145/3415192"
    },
    {
      "text": "Katrina Paola B Alvarez and Vivian Hsueh Hua Chen. 2021. Community and Capital: Experiences of Women Game Streamers in Southeast Asia. Trans. Soc. Comput. 4, 3 (10 2021). https://doi.org/10.1145/3481888",
      "doi": "10.1145/3481888"
    },
    {
      "text": "Hana Anber, Akram I Salah, A A Abd El-Aziz, and A A Abd El-Aziz. 2016. A Literature Review on Twitter Data Analysis. International Journal of Computer and Electrical Engineering 8, 3(2016), 241–249.",
      "doi": ""
    },
    {
      "text": "Michael Angrosino. 2007. Doing ethnographic and observational research. Sage.",
      "doi": ""
    },
    {
      "text": "Laurensia Anjani, Terrance Mok, Anthony Tang, Lora Oehlberg, and Wooi Boon Goh. 2020. Why Do People Watch Others Eat Food? An Empirical Study on the Motivations and Practices of Mukbang Viewers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376567",
      "doi": "10.1145/3313831.3376567"
    },
    {
      "text": "Brooke Auxier and Monica Anderson. 2021. Social media use in 2021. https://www.pewresearch.org/internet/2021/04/07/social-media-use-in-2021/",
      "doi": ""
    },
    {
      "text": "Thomas Barnett, Shruti Jain, Usha Andra, and Taru Khurana. 2018. Cisco visual networking index (vni) complete forecast update, 2017–2022. Americas/EMEAR Cisco Knowledge Network (CKN) Presentation (2018), 1–30.",
      "doi": ""
    },
    {
      "text": "Kristen Barta and Nazanin Andalibi. 2021. Constructing Authenticity on TikTok: Social Norms and Social Support on the \"Fun\" Platform. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (10 2021). https://doi.org/10.1145/3479574",
      "doi": "10.1145/3479574"
    },
    {
      "text": "Ralph Barthel, Shaaron Ainsworth, and Mike Sharples. 2013. Collaborative knowledge building with shared video representations. International Journal of Human-Computer Studies 71, 1 (2013), 59–75. https://doi.org/10.1016/j.ijhcs.2012.02.006",
      "doi": "10.1016/j.ijhcs.2012.02.006"
    },
    {
      "text": "Corey H Basch, Zoe Meleo-Erwin, Joseph Fera, Christie Jaime, and Charles E Basch. 2021. A global pandemic in the time of viral memes: COVID-19 vaccine misinformation and disinformation on TikTok. Human Vaccines & Immunotherapeutics 17, 8 (8 2021), 2373–2377. https://doi.org/10.1080/21645515.2021.1894896",
      "doi": ""
    },
    {
      "text": "Mohamed Ben Moussa. 2019. Rap it up, share it up: Identity politics of youth “social” movement in Moroccan online rap music. New Media & Society 21, 5 (5 2019), 1043–1064. https://doi.org/10.1177/1461444818821356",
      "doi": ""
    },
    {
      "text": "P Bhattacharya, R K Gupta, and Y Yang. 2021. Exploring the contextual factors affecting multimodal emotion recognition in videos. IEEE Transactions on Affective Computing(2021), 1. https://doi.org/10.1109/TAFFC.2021.3071503",
      "doi": ""
    },
    {
      "text": "Md Momen Bhuiyan, Carlos Augusto Bautista Isaza, Tanushree Mitra, and Sang Won Lee. 2022. OtherTube: Facilitating Content Discovery and Reflection by Exchanging YouTube Recommendations with Strangers. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3502028",
      "doi": "10.1145/3491102.3502028"
    },
    {
      "text": "GMI Blogger. 2022. YouTube User Statistics 2022. https://www.globalmediainsight.com/blog/youtube-users-statistics/",
      "doi": ""
    },
    {
      "text": "Katya Borgos-Rodriguez, Kathryn E Ringland, and Anne Marie Piper. 2019. MyAutsomeFamilyLife: Analyzing Parents of Children with Developmental Disabilities on YouTube. Proc. ACM Hum.-Comput. Interact. 3, CSCW (11 2019). https://doi.org/10.1145/3359196",
      "doi": "10.1145/3359196"
    },
    {
      "text": "Benjamin T Bowyer, Joseph E Kahne, and Ellen Middaugh. 2015. Youth comprehension of political messages in YouTube videos. New Media & Society 19, 4 (10 2015), 522–541. https://doi.org/10.1177/1461444815611593",
      "doi": ""
    },
    {
      "text": "Cody Buntain, Richard Bonneau, Jonathan Nagler, and Joshua A Tucker. 2021. YouTube Recommendations and Effects on Sharing Across Online Social Platforms. Proc. ACM Hum.-Comput. Interact. 5, CSCW1 (4 2021). https://doi.org/10.1145/3449085",
      "doi": "10.1145/3449085"
    },
    {
      "text": "Jean Burgess and Joshua Green. 2018. YouTube: Online video and participatory culture. John Wiley & Sons, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Ralf Caers, Tim De Feyter, Marijke De Couck, Talia Stough, Claudia Vigna, Cind Du Bois, Tim De Feyter, Marijke De Couck, Talia Stough, Claudia Vigna, and Cind Du Bois. 2013. Facebook: A literature review. New Media \\& Society 15, 6 (9 2013), 982–1002. https://doi.org/10.1177/1461444813488061",
      "doi": ""
    },
    {
      "text": "Jie Cai and Donghee Yvette Wohn. 2021. After Violation But Before Sanction: Understanding Volunteer Moderators’ Profiling Processes Toward Violators in Live Streaming Communities. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (10 2021). https://doi.org/10.1145/3479554",
      "doi": "10.1145/3479554"
    },
    {
      "text": "Jie Cai and Donghee Yvette Wohn. 2022. Coordination and Collaboration: How Do Volunteer Moderators Work as a Team in Live Streaming Communities?. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3517628",
      "doi": "10.1145/3491102.3517628"
    },
    {
      "text": "Minsuk Chang, Mina Huh, and Juho Kim. 2021. RubySlippers: Supporting Content-Based Voice Navigation for How-to Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445131",
      "doi": "10.1145/3411764.3445131"
    },
    {
      "text": "Minsuk Chang, Anh Truong, Oliver Wang, Maneesh Agrawala, and Juho Kim. 2019. How to Design Voice Based Navigation for How-To Videos. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300931",
      "doi": "10.1145/3290605.3300931"
    },
    {
      "text": "Clement Chau. 2010. YouTube as a participatory culture. New Directions for Youth Development 2010, 128 (2010), 65–74. https://doi.org/10.1002/yd.376",
      "doi": ""
    },
    {
      "text": "Xianhui Che, Barry Ip, and Ling Lin. 2015. A Survey of Current YouTube Video Characteristics. IEEE MultiMedia 22, 2 (2015), 56–63. https://doi.org/10.1109/MMUL.2015.34",
      "doi": "10.1109/MMUL.2015.34"
    },
    {
      "text": "Chun-Der Chen, Qun Zhao, and Jin-Long Wang. 2022. How livestreaming increases product sales: role of trust transfer and elaboration likelihood model. Behaviour & Information Technology 41, 3 (2 2022), 558–573. https://doi.org/10.1080/0144929X.2020.1827457",
      "doi": ""
    },
    {
      "text": "Di (Laura) Chen, Dustin Freeman, and Ravin Balakrishnan. 2019. Integrating Multimedia Tools to Enrich Interactions in Live Streaming for Language Learning. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300668",
      "doi": "10.1145/3290605.3300668"
    },
    {
      "text": "Judy Chen, Paul Dourish, Gillian R. Hayes, and Melissa Mazmanian. 2014. From interaction to performance with public displays. Personal and Ubiquitous Computing 18, 7 (2014), 1617–1629. https://doi.org/10.1007/s00779-014-0764-5",
      "doi": "10.1007/s00779-014-0764-5"
    },
    {
      "text": "Kaiping Chen, June Jeon, and Yanxi Zhou. 2021. A critical appraisal of diversity in digital knowledge production: Segregated inclusion on YouTube. New Media & Society (8 2021), 14614448211034846. https://doi.org/10.1177/14614448211034846",
      "doi": ""
    },
    {
      "text": "X Chen, L Niu, A Veeraraghavan, and A Sabharwal. 2022. FaceEngage: Robust Estimation of Gameplay Engagement from User-Contributed (YouTube) Videos. IEEE Transactions on Affective Computing 13, 2 (2022), 651–665. https://doi.org/10.1109/TAFFC.2019.2945014",
      "doi": ""
    },
    {
      "text": "Yue Chen, Qin Gao, and Pei-Luen Patrick Rau. 2017. Watching a Movie Alone yet Together: Understanding Reasons for Watching Danmaku Videos. International Journal of Human–Computer Interaction 33, 9 (9 2017), 731–743. https://doi.org/10.1080/10447318.2017.1282187",
      "doi": ""
    },
    {
      "text": "Yan Chen, Walter S Lasecki, and Tao Dong. 2021. Towards Supporting Programming Education at Scale via Live Streaming. Proc. ACM Hum.-Comput. Interact. 4, CSCW3 (1 2021). https://doi.org/10.1145/3434168",
      "doi": "10.1145/3434168"
    },
    {
      "text": "Jaeho Cho, Saifuddin Ahmed, Martin Hilbert, Billy Liu, and Jonathan Luu. 2020. Do Search Algorithms Endanger Democracy? An Experimental Investigation of Algorithm Effects on Political Polarization. Journal of Broadcasting & Electronic Media 64, 2 (5 2020), 150–172. https://doi.org/10.1080/08838151.2020.1757365",
      "doi": ""
    },
    {
      "text": "Dasom Choi, Uichin Lee, and Hwajung Hong. 2022. “It’s not wrong, but I’m quite disappointed”: Toward an Inclusive Algorithmic Experience for Content Creators with Disabilities. In CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": ""
    },
    {
      "text": "Shih-Wei Chou and Guan-Ying Lu. 2021. Content creation intention in digital participation based on identity management on Twitch. Behaviour & Information Technology (8 2021), 1–18. https://doi.org/10.1080/0144929X.2021.1937318",
      "doi": ""
    },
    {
      "text": "Chia-Fang Chung, Elena Agapie, Jessica Schroeder, Sonali Mishra, James Fogarty, and Sean A Munson. 2017. When Personal Tracking Becomes Social: Examining the Use of Instagram for Healthy Eating. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 1674–1687. https://doi.org/10.1145/3025453.3025747",
      "doi": "10.1145/3025453.3025747"
    },
    {
      "text": "John Joon Young Chung, Hijung Valentina Shin, Haijun Xia, Li-yi Wei, and Rubaiat Habib Kazi. 2021. Beyond Show of Hands: Engaging Viewers via Expressive and Scalable Visual Communication in Live Streaming. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445419",
      "doi": "10.1145/3411764.3445419"
    },
    {
      "text": "Cédric Courtois, Peter Mechant, Valerie Ostyn, and Lieven De Marez. 2013. Uploaders’ definition of the networked public on YouTube and their feedback preferences: a multi-method approach. Behaviour & Information Technology 32, 6 (6 2013), 612–624. https://doi.org/10.1080/0144929X.2011.586727",
      "doi": ""
    },
    {
      "text": "Pedro Cuesta-Valiño, Pablo Gutiérrez-Rodríguez, and Patricia Durán-Álamo. 2022. Why do people return to video platforms? Millennials and centennials on TikTok. Media and Communication 10, 1 (2022), 198–207.",
      "doi": ""
    },
    {
      "text": "Emily Dao, Andreea Muresan, Kasper Hornb\\aek, and Jarrod Knibbe. 2021. Bad Breakdowns, Useful Seams, and Face Slapping: Analysis of VR Fails on YouTube. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445435",
      "doi": "10.1145/3411764.3445435"
    },
    {
      "text": "Pierre de Bérail, Marlène Guillon, and Catherine Bungener. 2019. The relations between YouTube addiction, social anxiety and parasocial relationships with YouTubers: A moderated-mediation model based on a cognitive-behavioral framework. Computers in Human Behavior 99 (2019), 190–204. https://doi.org/10.1016/j.chb.2019.05.007",
      "doi": "10.1016/j.chb.2019.05.007"
    },
    {
      "text": "Michael A DeVito, Jeremy Birnholtz, Jeffery T Hancock, Megan French, and Sunny Liu. 2018. How People Form Folk Theories of Social Media Feeds and What It Means for How We Study Self-Presentation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173694",
      "doi": "10.1145/3173574.3173694"
    },
    {
      "text": "N Dimitrova, Hong-Jiang Zhang, B Shahraray, I Sezan, T Huang, and A Zakhor. 2002. Applications of video-content analysis and retrieval. IEEE MultiMedia 9, 3 (2002), 42–55. https://doi.org/10.1109/MMUL.2002.1022858",
      "doi": "10.1109/MMUL.2002.1022858"
    },
    {
      "text": "Xianghua(Sharon) Ding, Yubo Kou, Yiwen Xu, and Peng Zhang. 2022. “As Uploaders, We Have the Responsibility”: Individualized Professionalization of Bilibili Uploaders. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3517509",
      "doi": "10.1145/3491102.3517509"
    },
    {
      "text": "S. Dixon. 2022. Biggest social media platforms 2022. https://www.statista.com/statistics/272014/global-social-networks-ranked-by-number-of-users/",
      "doi": ""
    },
    {
      "text": "S. Dixon. 2022. Number of worldwide social network users 2027. https://www.statista.com/statistics/278414/number-of-worldwide-social-network-users/",
      "doi": ""
    },
    {
      "text": "Nicola Döring and M Rohangis Mohseni. 2020. Gendered hate speech in YouTube and YouNow comments: Results of two content analyses. SCM Studies in Communication and Media 9, 1 (2020), 62–88. https://doi.org/10.5771/2192-4007-2020-1-62",
      "doi": ""
    },
    {
      "text": "Rodney Duffett, Dana-Mihaela Petroșanu, Iliuta-Costel Negricea, and Tudor Edu. 2019. Effect of YouTube Marketing Communication on Converting Brand Liking into Preference among Millennials Regarding Brands in General and Sustainable Offers in Particular. Evidence from South Africa and Romania. https://doi.org/10.3390/su11030604",
      "doi": ""
    },
    {
      "text": "Jared Duval, Ferran Altarriba Bertran, Siying Chen, Melissa Chu, Divya Subramonian, Austin Wang, Geoffrey Xiang, Sri Kurniawan, and Katherine Isbister. 2021. Chasing Play on TikTok from Populations with Disabilities to Inspire Playful and Inclusive Technology Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445303",
      "doi": "10.1145/3411764.3445303"
    },
    {
      "text": "Katharina Emmerich, Andrey Krekhov, Sebastian Cmentowski, and Jens Krueger. 2021. Streaming VR Games to the Broad Audience: A Comparison of the First-Person and Third-Person Perspectives. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445515",
      "doi": "10.1145/3411764.3445515"
    },
    {
      "text": "Travis Faas, Lynn Dombrowski, Alyson Young, and Andrew D Miller. 2018. Watch Me Code: Programming Mentorship Communities on Twitch.Tv. Proc. ACM Hum.-Comput. Interact. 2, CSCW (11 2018). https://doi.org/10.1145/3274319",
      "doi": "10.1145/3274319"
    },
    {
      "text": "Murat Ferhat Ferhatoglu, Abdulcabbar Kartal, Ugur Ekici, and Alp Gurkan. 2019. Evaluation of the Reliability, Utility, and Quality of the Information in Sleeve Gastrectomy Videos Shared on Open Access Video Sharing Platform YouTube. Obesity Surgery 29, 5 (2019), 1477–1484. https://doi.org/10.1007/s11695-019-03738-2",
      "doi": ""
    },
    {
      "text": "Susan M Ferreira, Sergio Sayago, and Josep Blat. 2017. Older people’s production and appropriation of digital videos: an ethnographic study. Behaviour & Information Technology 36, 6 (6 2017), 557–574. https://doi.org/10.1080/0144929X.2016.1265150",
      "doi": ""
    },
    {
      "text": "C Ailie Fraser, Joy O Kim, Hijung Valentina Shin, Joel Brandt, and Mira Dontcheva. 2020. Temporal Segmentation of Creative Live Streams. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376437",
      "doi": "10.1145/3313831.3376437"
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2020. Streaming your Identity: Navigating the Presentation of Gender and Sexuality through Live Streaming. Computer Supported Cooperative Work (CSCW) 29, 6 (2020), 795–825. https://doi.org/10.1007/s10606-020-09386-w",
      "doi": "10.1007/s10606-020-09386-w"
    },
    {
      "text": "Cerise L Glenn. 2015. Activism or “Slacktivism?”: Digital Media and Organizing for Social Change. Communication Teacher 29, 2 (4 2015), 81–85. https://doi.org/10.1080/17404622.2014.1003310",
      "doi": ""
    },
    {
      "text": "Google. 2022. History of Monetization at YouTube - YouTube5Year. https://sites.google.com/a/pressatgoogle.com/youtube5year/home/history-of-monetization-at-youtube",
      "doi": ""
    },
    {
      "text": "Michael Green, Ania Bobrowicz, and Chee Siang Ang. 2015. The lesbian, gay, bisexual and transgender community online: discussions of bullying and self-disclosure in YouTube videos. Behaviour & Information Technology 34, 7 (7 2015), 704–712. https://doi.org/10.1080/0144929X.2015.1012649",
      "doi": ""
    },
    {
      "text": "Daniel Gros, Brigitta Wanner, Anna Hackenholt, Piotr Zawadzki, and Kathrin Knautz. 2017. World of Streaming. Motivation and Gratification on Twitch, Gabriele Meiselwitz (Ed.). Springer International Publishing, Cham, 44–57.",
      "doi": ""
    },
    {
      "text": "Y Güçlütürk, U Güçlü, X Baró, H J Escalante, I Guyon, S Escalera, M A J van Gerven, and R van Lier. 2018. Multimodal First Impression Analysis with Deep Residual Networks. IEEE Transactions on Affective Computing 9, 3 (2018), 316–329. https://doi.org/10.1109/TAFFC.2017.2751469",
      "doi": "10.1109/TAFFC.2017.2751469"
    },
    {
      "text": "Lei Guo and Summer Harlow. 2014. User-Generated Racism: An Analysis of Stereotypes of African Americans, Latinos, and Asians in YouTube Videos. Howard Journal of Communications 25, 3 (7 2014), 281–302. https://doi.org/10.1080/10646175.2014.925413",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson and John C Tang. 2017. What Makes Live Events Engaging on Facebook Live, Periscope, and Snapchat. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 48–60. https://doi.org/10.1145/3025453.3025642",
      "doi": "10.1145/3025453.3025642"
    },
    {
      "text": "William A Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on Twitch: Fostering Participatory Communities of Play within Live Mixed Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 1315–1324. https://doi.org/10.1145/2556288.2557048",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "Gunnar Harboe and Elaine M Huang. 2015. Real-World Affinity Diagramming Practices: Bridging the Paper-Digital Gap. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 95–104. https://doi.org/10.1145/2702123.2702561",
      "doi": "10.1145/2702123.2702561"
    },
    {
      "text": "Changyang He, Lu He, Tun Lu, and Bo Li. 2021. Beyond Entertainment: Unpacking Danmaku and Comments’ Role of Information Sharing and Sentiment Expression in Online Crisis Videos. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (10 2021). https://doi.org/10.1145/3479555",
      "doi": "10.1145/3479555"
    },
    {
      "text": "Mingyi Hou. 2018. Social media celebrity and the institutionalization of YouTube. Convergence 25, 3 (1 2018), 534–553. https://doi.org/10.1177/1354856517750368",
      "doi": ""
    },
    {
      "text": "Yiqing Hua, Manoel Horta Ribeiro, Robert West, Thomas Ristenpart, and Mor Naaman. 2022. Characterizing Alternative Monetization Strategies on YouTube. arXiv preprint arXiv:2203.10143(2022).",
      "doi": ""
    },
    {
      "text": "Yun Huang, Yifeng Huang, Na Xue, and Jeffrey P Bigham. 2017. Leveraging Complementary Contributions of Different Workers for Efficient Crowdsourcing of Video Captions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 4617–4626. https://doi.org/10.1145/3025453.3026032",
      "doi": "10.1145/3025453.3026032"
    },
    {
      "text": "Jina Huh, Leslie S Liu, Tina Neogi, Kori Inkpen, and Wanda Pratt. 2014. Health Vlogs as Social Support for Chronic Illness Management. ACM Trans. Comput.-Hum. Interact. 21, 4 (8 2014). https://doi.org/10.1145/2630067",
      "doi": "10.1145/2630067"
    },
    {
      "text": "L Humpe, S Friedrich Murillo, J Muires, and P Gloor. 2021. The Rhythm of Flow: Detecting Facial Expressions of Flow Experiences Using CNNs. IEEE Transactions on Affective Computing(2021), 1. https://doi.org/10.1109/TAFFC.2021.3087222",
      "doi": ""
    },
    {
      "text": "Eslam Hussein, Prerna Juneja, and Tanushree Mitra. 2020. Measuring Misinformation in Video Search Platforms: An Audit Study on YouTube. Proc. ACM Hum.-Comput. Interact. 4, CSCW1 (5 2020). https://doi.org/10.1145/3392854",
      "doi": "10.1145/3392854"
    },
    {
      "text": "Samireh Jalali and Claes Wohlin. 2012. Systematic Literature Studies: Database Searches vs. Backward Snowballing. In Proceedings of the ACM-IEEE International Symposium on Empirical Software Engineering and Measurement(ESEM ’12). Association for Computing Machinery, New York, NY, USA, 29–38. https://doi.org/10.1145/2372251.2372257",
      "doi": "10.1145/2372251.2372257"
    },
    {
      "text": "Shagun Jhaver, Quan Ze Chen, Detlef Knauss, and Amy X Zhang. 2022. Designing Word Filter Tools for Creator-Led Comment Moderation. In CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3517505",
      "doi": "10.1145/3491102.3517505"
    },
    {
      "text": "Mark R Johnson. 2019. Inclusion and exclusion in the digital economy: disability and mental health as a live streamer on Twitch.tv. Information, Communication & Society 22, 4 (3 2019), 506–520. https://doi.org/10.1080/1369118X.2018.1476575",
      "doi": ""
    },
    {
      "text": "Andreas Jungherr. 2016. Twitter use in election campaigns: A systematic literature review. Journal of Information Technology \\& Politics 13, 1 (1 2016), 72–91. https://doi.org/10.1080/19331681.2015.1132401",
      "doi": ""
    },
    {
      "text": "Andreas M Kaplan and Michael Haenlein. 2010. Users of the world, unite! The challenges and opportunities of Social Media. Business Horizons 53, 1 (2010), 59–68. https://doi.org/10.1016/j.bushor.2009.09.003",
      "doi": ""
    },
    {
      "text": "Kawaljeet Kaur Kapoor, Kuttimani Tamilmani, Nripendra P. Rana, Pushp Patil, Yogesh K. Dwivedi, and Sridhar Nerur. 2018. Advances in Social Media Research: Past, Present and Future. Information Systems Frontiers 20, 3 (2018), 531–558. https://doi.org/10.1007/s10796-017-9810-y",
      "doi": "10.1007/s10796-017-9810-y"
    },
    {
      "text": "Amir Karami, Morgan Lundy, Frank Webb, and Yogesh K Dwivedi. 2020. Twitter and Research: A Systematic Literature Review Through Text Mining. IEEE Access 8(2020), 67698–67717. https://doi.org/10.1109/ACCESS.2020.2983656",
      "doi": ""
    },
    {
      "text": "Nadia Karizat, Dan Delmonaco, Motahhare Eslami, and Nazanin Andalibi. 2021. Algorithmic Folk Theories and Identity: How TikTok Users Co-Produce Knowledge of Identity and Engage in Algorithmic Resistance. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (10 2021). https://doi.org/10.1145/3476046",
      "doi": "10.1145/3476046"
    },
    {
      "text": "Susie Khamis, Lawrence Ang, and Raymond Welling. 2017. Self-branding, ‘micro-celebrity’ and the rise of Social Media Influencers. Celebrity Studies 8, 2 (4 2017), 191–208. https://doi.org/10.1080/19392397.2016.1218292",
      "doi": ""
    },
    {
      "text": "M Laeeq Khan. 2017. Social media engagement: What motivates user participation and consumption on YouTube?Computers in Human Behavior 66 (2017), 236–247. https://doi.org/10.1016/j.chb.2016.09.024",
      "doi": "10.1016/j.chb.2016.09.024"
    },
    {
      "text": "Amro Khasawneh, Kapil Chalil Madathil, Heidi Zinzow, Pamela Wisniewski, Amal Ponathil, Hunter Rogers, Sruthy Agnisarman, Rebecca Roth, and Meera Narasimhan. 2021. An Investigation of the Portrayal of Social Media Challenges on YouTube and Twitter. Trans. Soc. Comput. 4, 1 (3 2021). https://doi.org/10.1145/3444961",
      "doi": "10.1145/3444961"
    },
    {
      "text": "Juho Kim, Philip J Guo, Carrie J Cai, Shang-Wen (Daniel) Li, Krzysztof Z Gajos, and Robert C Miller. 2014. Data-Driven Interaction Techniques for Improving Navigation of Educational Videos. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(UIST ’14). Association for Computing Machinery, New York, NY, USA, 563–572. https://doi.org/10.1145/2642918.2647389",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Woojoo Kim, Shuping Xiong, and Zhuoqian Liang. 2017. Effect of Loading Symbol of Online Video on Perception of Waiting Time. International Journal of Human–Computer Interaction 33, 12 (12 2017), 1001–1009. https://doi.org/10.1080/10447318.2017.1305051",
      "doi": ""
    },
    {
      "text": "Aida Komkaite, Liga Lavrinovica, Maria Vraka, and Mikael B Skov. 2019. Underneath the Skin: An Analysis of YouTube Videos to Understand Insertable Device Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300444",
      "doi": "10.1145/3290605.3300444"
    },
    {
      "text": "Thomas B Ksiazek, Limor Peer, and Kevin Lessard. 2014. User engagement with online news: Conceptualizing interactivity and exploring the relationship between online news videos and user comments. New Media & Society 18, 3 (8 2014), 502–520. https://doi.org/10.1177/1461444814545073",
      "doi": ""
    },
    {
      "text": "Akshi Kumar and Arunima Jaiswal. 2020. Systematic literature review of sentiment analysis on Twitter using soft computing techniques. Concurrency and Computation: Practice and Experience 32, 1 (1 2020), e5107. https://doi.org/10.1002/cpe.5107",
      "doi": ""
    },
    {
      "text": "Kate Szer Kurtin, Nina O’Brien, Deya Roy, and Linda Dam. 2018. The Development of Parasocial Interaction Relationships on YouTube. The Journal of Social Media in Society; Vol 7, No 1 (2018): The Journal of Social Media in Society 7 (5 2018), 233–252. https://www.thejsms.org/index.php/TSMRI/article/view/304",
      "doi": ""
    },
    {
      "text": "Charles Lamontagne, Sylvain Sénécal, Marc Fredette, Élise Labonté-LeMoyne, and Pierre-Majorique Léger. 2021. The effect of the segmentation of video tutorials on User’s training experience and performance. Computers in Human Behavior Reports 3 (2021), 100071. https://doi.org/10.1016/j.chbr.2021.100071",
      "doi": ""
    },
    {
      "text": "Effie Le Moignan, Shaun Lawson, Duncan A Rowland, Jamie Mahoney, and Pam Briggs. 2017. Has Instagram Fundamentally Altered the ’Family Snapshot’?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 4935–4947. https://doi.org/10.1145/3025453.3025928",
      "doi": "10.1145/3025453.3025928"
    },
    {
      "text": "Mark Ledwich and Anna Zaitsev. 2020. Algorithmic extremism: Examining YouTube’s rabbit hole of radicalization. First Monday 25, 3 (2020). https://doi.org/10.5210/fm.v25i3.10419",
      "doi": ""
    },
    {
      "text": "Yoonjoo Lee, John Joon Young Chung, Jean Y Song, Minsuk Chang, and Juho Kim. 2021. Personalizing Ambience and Illusionary Presence: How People Use “Study with Me” Videos to Create Effective Studying Environments. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445222",
      "doi": "10.1145/3411764.3445222"
    },
    {
      "text": "Rebecca Lewis. 2019. “This Is What the News Won’t Show You”: YouTube Creators and the Reactionary Politics of Micro-celebrity. Television & New Media 21, 2 (10 2019), 201–217. https://doi.org/10.1177/1527476419879919",
      "doi": ""
    },
    {
      "text": "Franklin Mingzhe Li, Franchesca Spektor, Meng Xia, Mina Huh, Peter Cederberg, Yuqi Gong, Kristen Shinohara, and Patrick Carrington. 2022. “It Feels Like Taking a Gamble”: Exploring Perceptions, Practices, and Challenges of Using Makeup and Cosmetics for People with Visual Impairments. In CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3517490",
      "doi": "10.1145/3491102.3517490"
    },
    {
      "text": "Jie Li, Xinning Gui, Yubo Kou, and Yukun Li. 2019. Live Streaming as Co-Performance: Dynamics between Center and Periphery in Theatrical Engagement. Proc. ACM Hum.-Comput. Interact. 3, CSCW (11 2019). https://doi.org/10.1145/3359166",
      "doi": "10.1145/3359166"
    },
    {
      "text": "Lingyuan Li, Jirassaya Uttarapong, Guo Freeman, and Donghee Yvette Wohn. 2020. Spontaneous, Yet Studious: Esports Commentators’ Live Performance and Self-Presentation Practices. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (10 2020). https://doi.org/10.1145/3415174",
      "doi": "10.1145/3415174"
    },
    {
      "text": "Yao Li, Yubo Kou, Je Seok Lee, and Alfred Kobsa. 2018. Tell Me Before You Stream Me: Managing Information Disclosure in Video Game Live Streaming. Proc. ACM Hum.-Comput. Interact. 2, CSCW (11 2018). https://doi.org/10.1145/3274376",
      "doi": "10.1145/3274376"
    },
    {
      "text": "Yi Li and Yi Peng. 2021. What Drives Gift-giving Intention in Live Streaming? The Perspectives of Emotional Attachment and Flow Experience. International Journal of Human–Computer Interaction 37, 14 (8 2021), 1317–1329. https://doi.org/10.1080/10447318.2021.1885224",
      "doi": ""
    },
    {
      "text": "Trisha T C Lin. 2019. Why Do People Watch Multiscreen Videos and Use Dual Screening? Investigating Users’ Polychronicity, Media Multitasking Motivation, and Media Repertoire. International Journal of Human–Computer Interaction 35, 18 (11 2019), 1672–1680. https://doi.org/10.1080/10447318.2018.1561813",
      "doi": ""
    },
    {
      "text": "Matthew Tingchi Liu, Yongdan Liu, and Lida L Zhang. 2019. Vlog and brand evaluations: the influence of parasocial interaction. Asia Pacific Journal of Marketing and Logistics 31, 2 (1 2019), 419–436. https://doi.org/10.1108/APJML-01-2018-0021",
      "doi": ""
    },
    {
      "text": "Xingyu Liu, Patrick Carrington, Xiang ’Anthony’ Chen, and Amy Pavel. 2021. What Makes Videos Accessible to Blind and Visually Impaired People?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445233",
      "doi": "10.1145/3411764.3445233"
    },
    {
      "text": "Diana Löffler, Lennart Giron, and Jörn Hurtienne. 2017. Night Mode, Dark Thoughts: Background Color Influences the Perceived Sentiment of Chat Messages, Regina Bernhaupt, Girish Dalvi, Anirudha Joshi, Devanuj K. Balkrishan, Jacki O’Neill, and Marco Winckler (Eds.). Springer International Publishing, Cham, 184–201.",
      "doi": ""
    },
    {
      "text": "Quan Long and Alec C Tefertiller. 2020. China’s New Mania for Live Streaming: Gender Differences in Motives and Uses of Social Live Streaming Services. International Journal of Human–Computer Interaction 36, 14 (8 2020), 1314–1324. https://doi.org/10.1080/10447318.2020.1746060",
      "doi": ""
    },
    {
      "text": "Zhicong Lu, Michelle Annett, Mingming Fan, and Daniel Wigdor. 2019. \"I Feel It is My Responsibility to Stream\": Streaming and Engaging with Intangible Cultural Heritage through Livestreaming. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300459",
      "doi": "10.1145/3290605.3300459"
    },
    {
      "text": "Zhicong Lu, Michelle Annett, and Daniel Wigdor. 2019. Vicariously Experiencing It All Without Going Outside: A Study of Outdoor Livestreaming in China. Proc. ACM Hum.-Comput. Interact. 3, CSCW (11 2019). https://doi.org/10.1145/3359127",
      "doi": "10.1145/3359127"
    },
    {
      "text": "Zhicong Lu, Seongkook Heo, and Daniel J Wigdor. 2018. StreamWiki: Enabling Viewers of Knowledge Sharing Live Streams to Collaboratively Generate Archival Documentation for Effective In-Stream and Post Hoc Learning. Proc. ACM Hum.-Comput. Interact. 2, CSCW (11 2018). https://doi.org/10.1145/3274381",
      "doi": "10.1145/3274381"
    },
    {
      "text": "Zhicong Lu, Rubaiat Habib Kazi, Li-yi Wei, Mira Dontcheva, and Karrie Karahalios. 2021. StreamSketch: Exploring Multi-Modal Interactions in Creative Live Streams. Proc. ACM Hum.-Comput. Interact. 5, CSCW1 (4 2021). https://doi.org/10.1145/3449132",
      "doi": "10.1145/3449132"
    },
    {
      "text": "Zhicong Lu, Chenxinran Shen, Jiannan Li, Hong Shen, and Daniel Wigdor. 2021. More Kawaii than a Real-Person Live Streamer: Understanding How the Otaku Community Engages with and Perceives Virtual YouTubers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445660",
      "doi": "10.1145/3411764.3445660"
    },
    {
      "text": "Zhicong Lu, Haijun Xia, Seongkook Heo, and Daniel Wigdor. 2018. You Watch, You Give, and You Engage: A Study of Live Streaming Practices in China. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174040",
      "doi": "10.1145/3173574.3174040"
    },
    {
      "text": "Kai Lukoff, Ulrik Lyngs, Himanshu Zade, J Vera Liao, James Choi, Kaiyue Fan, Sean A Munson, and Alexis Hiniker. 2021. How the Design of YouTube Influences User Sense of Agency. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445467",
      "doi": "10.1145/3411764.3445467"
    },
    {
      "text": "Mufan Luo, Tiffany W Hsu, Joon Sung Park, and Jeffrey T Hancock. 2020. Emotional Amplification During Live-Streaming: Evidence from Comments During and After News Events. Proc. ACM Hum.-Comput. Interact. 4, CSCW1 (5 2020). https://doi.org/10.1145/3392853",
      "doi": "10.1145/3392853"
    },
    {
      "text": "Renkai Ma and Yubo Kou. 2021. \"How Advertiser-Friendly is My Video?\": YouTuber’s Socioeconomic Interactions with Algorithmic Content Moderation. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (10 2021). https://doi.org/10.1145/3479573",
      "doi": "10.1145/3479573"
    },
    {
      "text": "Thomas W L MacDonald. 2021. “How it actually works”: Algorithmic lore videos as market devices. New Media & Society (6 2021), 14614448211021404. https://doi.org/10.1177/14614448211021404",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Danielle Bragg, Meredith Ringel Morris, Maarten W Bos, Isabelle Albi, and Andrés Monroy-Hernández. 2020. Social App Accessibility for Deaf Signers. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (10 2020). https://doi.org/10.1145/3415196",
      "doi": "10.1145/3415196"
    },
    {
      "text": "Kapil Chalil Madathil, A Joy Rivera-Rodriguez, Joel S Greenstein, and Anand K Gramopadhye. 2014. Healthcare information on YouTube: A systematic review. Health Informatics Journal 21, 3 (3 2014), 173–194. https://doi.org/10.1177/1460458213512220",
      "doi": ""
    },
    {
      "text": "Keri Mallari, Spencer Williams, and Gary Hsieh. 2021. Understanding Analytics Needs of Video Game Streamers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445320",
      "doi": "10.1145/3411764.3445320"
    },
    {
      "text": "Enrico Mariconti, Guillermo Suarez-Tangil, Jeremy Blackburn, Emiliano De Cristofaro, Nicolas Kourtellis, Ilias Leontiadis, Jordi Luque Serrano, and Gianluca Stringhini. 2019. \"You Know What to Do\": Proactive Detection of YouTube Videos Targeted by Coordinated Hate Attacks. Proc. ACM Hum.-Comput. Interact. 3, CSCW (11 2019). https://doi.org/10.1145/3359309",
      "doi": "10.1145/3359309"
    },
    {
      "text": "Alice E Marwick. 2015. You May Know Me from YouTube: (Micro-)Celebrity in Social Media., 333–350 pages. https://doi.org/10.1002/9781118475089.ch18",
      "doi": ""
    },
    {
      "text": "Arunesh Mathur, Arvind Narayanan, and Marshini Chetty. 2018. Endorsements on Social Media: An Empirical Study of Affiliate Marketing Disclosures on YouTube and Pinterest. Proc. ACM Hum.-Comput. Interact. 2, CSCW (11 2018). https://doi.org/10.1145/3274388",
      "doi": "10.1145/3274388"
    },
    {
      "text": "Byrd McDaniel. 2020. Popular music reaction videos: Reactivity, creator labor, and the performance of listening online. New Media & Society 23, 6 (6 2020), 1624–1641. https://doi.org/10.1177/1461444820918549",
      "doi": ""
    },
    {
      "text": "David W McMillan and David M Chavis. 1986. Sense of community: A definition and theory. Journal of Community Psychology 14, 1 (1 1986), 6–23. https://doi.org/10.1002/1520-6629(198601)14:1<6::AID-JCOP2290140103>3.0.CO;2-I",
      "doi": ""
    },
    {
      "text": "Sarah McRoberts, Haiwei Ma, Andrew Hall, and Svetlana Yarosh. 2017. Share First, Save Later: Performance of Self through Snapchat Stories. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 6902–6911. https://doi.org/10.1145/3025453.3025771",
      "doi": "10.1145/3025453.3025771"
    },
    {
      "text": "Alexey N Medvedev, Renaud Lambiotte, and Jean-Charles Delvenne. 2019. The Anatomy of Reddit: An Overview of Academic Research. In Dynamics On and Of Complex Networks III, Fakhteh Ghanbarnejad, Rishiraj Saha Roy, Fariba Karimi, Jean-Charles Delvenne, and Bivas Mitra (Eds.). Springer International Publishing, Cham, 183–204.",
      "doi": ""
    },
    {
      "text": "Nayan Mehta, Suraj Pai, and Sanjay Singh. 2020. Automated 3D sign language caption generation for video. Universal Access in the Information Society 19, 4 (2020), 725–738. https://doi.org/10.1007/s10209-019-00668-9",
      "doi": "10.1007/s10209-019-00668-9"
    },
    {
      "text": "Keira Shuyang Meng and Louis Leung. 2021. Factors influencing TikTok engagement behaviors in China: An examination of gratifications sought, narcissism, and the Big Five personality traits. Telecommunications Policy 45, 7 (2021), 102172. https://doi.org/10.1016/j.telpol.2021.102172",
      "doi": ""
    },
    {
      "text": "Matthew K Miller, John C Tang, Gina Venolia, Gerard Wilkinson, and Kori Inkpen. 2017. Conversational Chat Circles: Being All Here Without Having to Hear It All. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 2394–2404. https://doi.org/10.1145/3025453.3025621",
      "doi": "10.1145/3025453.3025621"
    },
    {
      "text": "Max Morris and Eric Anderson. 2015. ‘Charlie Is So Cool Like’: Authenticity, Popularity and Inclusive Masculinity on YouTube. Sociology 49, 6 (2 2015), 1200–1217. https://doi.org/10.1177/0038038514562852",
      "doi": ""
    },
    {
      "text": "Joel M Moskowitz. 1983. Preventing adolescent substance abuse through drug education. NIDA research monograph 47 (1983), 233–249. http://europepmc.org/abstract/MED/6419117",
      "doi": ""
    },
    {
      "text": "Ashwini Nadkarni and Stefan G Hofmann. 2012. Why do people use Facebook?Personality and Individual Differences 52, 3 (2012), 243–249. https://doi.org/10.1016/j.paid.2011.11.007",
      "doi": ""
    },
    {
      "text": "Azadeh Nematzadeh, Giovanni Luca Ciampaglia, Yong-Yeol Ahn, and Alessandro Flammini. 2022. Information overload in group communication: from conversation to cacophony in the Twitch chat. Royal Society Open Science 6, 10 (8 2022), 191412. https://doi.org/10.1098/rsos.191412",
      "doi": ""
    },
    {
      "text": "Shuo Niu, Ava Bartolome, Nguyen Binh Ha, and Keegan Veazey. 2022. Close-up and Whispering: An Understanding of Multimodal and Parasocial Interactions in YouTube ASMR videos. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA.",
      "doi": "10.1145/3491102.3517563"
    },
    {
      "text": "Shuo Niu, Ava Bartolome, Cat Mai, and Ha B Nguyen. 2021. #Stayhome #Withme: How do YouTubers Help with COVID-19 Loneliness?. In Conference on Human Factors in Computing Systems - Proceedings. 15. https://doi.org/10.1145/3411764.3445397",
      "doi": "10.1145/3411764.3445397"
    },
    {
      "text": "Shuo Niu, Cat Mai, Katherine G McKim, and D Scott McCrickard. 2021. #TeamTrees: Investigating How YouTubers Participate in a Social Media Campaign. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (10 2021). https://doi.org/10.1145/3479593",
      "doi": "10.1145/3479593"
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Trans. Comput.-Hum. Interact. 22, 6 (12 2015). https://doi.org/10.1145/2803173",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Jonathan A Obar and Steven S Wildman. 2015. Social Media Definition and the Governance Challenge: An Introduction to the Special Issue. Internal Communications \\& Organizational Behavior eJournal 9, 39(2015), 745–750.",
      "doi": ""
    },
    {
      "text": "Dragoș M Obreja. 2021. Toward a multidimensional streaming: A thematic case study of two Twitch channels. New Media & Society (6 2021), 14614448211020692. https://doi.org/10.1177/14614448211020692",
      "doi": ""
    },
    {
      "text": "Bahiyah Omar and Wang Dequan. 2020. Watch, Share or Create: The Influence of Personality Traits and User Motivation on TikTok Mobile Video Usage. https://www.learntechlib.org/p/216454",
      "doi": ""
    },
    {
      "text": "Yeimer Ortiz-Martinez, Wael Ali-Salloum, Fernando González-Ferreira, and Joel Molinas-Argüello. 2017. HIV videos on YouTube: helpful or harmful?Sexually Transmitted Infections 93, 7 (11 2017), 481 LP – 481. https://doi.org/10.1136/sextrans-2017-053197",
      "doi": ""
    },
    {
      "text": "Jeni Paay, Jesper Kjeldskov, Mikael B Skov, and Kenton O’Hara. 2013. F-Formations in Cooking Together: A Digital Ethnography Using YouTube, Paula Kotzé, Gary Marsden, Gitte Lindgaard, Janet Wesson, and Marco Winckler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 37–54.",
      "doi": ""
    },
    {
      "text": "Hye-Jin Paek, Sookyong Kim, Thomas Hove, and Jung Yoon Huh. 2014. Reduced Harm or Another Gateway to Smoking? Source, Message, and Information Characteristics of E-Cigarette Videos on YouTube. Journal of Health Communication 19, 5 (5 2014), 545–560. https://doi.org/10.1080/10810730.2013.821560",
      "doi": ""
    },
    {
      "text": "Ambarish Pandey, Nivedita Patni, Mansher Singh, Akshay Sood, and Gayatri Singh. 2010. YouTube As a Source of Information on the H1N1 Influenza Pandemic. American Journal of Preventive Medicine 38, 3 (3 2010), e1–e3. https://doi.org/10.1016/j.amepre.2009.11.007",
      "doi": ""
    },
    {
      "text": "Kostantinos Papadamou, Savvas Zannettou, Jeremy Blackburn, Emiliano De Cristofaro, Gianluca Stringhini, and Michael Sirivianos. 2021. \"How over is It?\" Understanding the Incel Community on YouTube. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (10 2021). https://doi.org/10.1145/3479556",
      "doi": "10.1145/3479556"
    },
    {
      "text": "Anthony J Pellicone and June Ahn. 2017. The Game of Performing Play: Understanding Streaming as Cultural Production. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 4863–4874. https://doi.org/10.1145/3025453.3025854",
      "doi": "10.1145/3025453.3025854"
    },
    {
      "text": "Andrew Perrin and Monica Anderson. 2019. Share of U.S. adults using social media, including Facebook, is mostly unchanged since 2018.",
      "doi": ""
    },
    {
      "text": "Micah D J Peters, Casey Marnie, Andrea C Tricco, Danielle Pollock, Zachary Munn, Lyndsay Alexander, Patricia McInerney, Christina M Godfrey, and Hanan Khalil. 2020. Updated methodological guidance for the conduct of scoping reviews. JBI Evidence Synthesis 18, 10 (2020). https://journals.lww.com/jbisrir/Fulltext/2020/10000/Updated_methodological_guidance_for_the_conduct_of.4.aspx",
      "doi": ""
    },
    {
      "text": "Chelsea Peterson-Salahuddin. 2022. “Pose”: Examining moments of “digital” dark sousveillance on TikTok. New Media & Society (4 2022), 14614448221080480. https://doi.org/10.1177/14614448221080480",
      "doi": ""
    },
    {
      "text": "Sari Piittinen. 2018. Morality in Let’s Play narrations: Moral evaluations of Gothic monsters in gameplay videos of Fallout 3. New Media & Society 20, 12 (6 2018), 4671–4688. https://doi.org/10.1177/1461444818779754",
      "doi": ""
    },
    {
      "text": "Nicholas Proferes, Naiyan Jones, Sarah Gilbert, Casey Fiesler, and Michael Zimmer. 2021. Studying Reddit: A Systematic Overview of Disciplines, Approaches, Methods, and Ethics. Social Media + Society 7, 2 (4 2021), 20563051211019004. https://doi.org/10.1177/20563051211019004",
      "doi": ""
    },
    {
      "text": "Leslie Rasmussen. 2018. Parasocial Interaction in the Digital Age: An Examination of Relationship Building and the Effectiveness of YouTube Celebrities. The Journal of Social Media in Society 7, 1 (2018), 280–294.",
      "doi": ""
    },
    {
      "text": "Tobias Raun. 2018. Capitalizing intimacy: New subcultural forms of micro-celebrity strategies and affective labour on YouTube. Convergence 24, 1 (1 2018), 99–113. https://doi.org/10.1177/1354856517736983",
      "doi": ""
    },
    {
      "text": "Raquel Breejon Robinson, Ricardo Rheeder, Madison Klarkowski, and Regan L Mandryk. 2022. ”Chat Has No Chill”: A Novel Physiological Interaction For Engaging Live Streaming Audiences. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3501934",
      "doi": "10.1145/3491102.3501934"
    },
    {
      "text": "Markus Rohde, Konstantin Aal, Kaoru Misaki, Dave Randall, Anne Weibert, and Volker Wulf. 2016. Out of Syria: Mobile Media in Use at the Time of Civil War. International Journal of Human–Computer Interaction 32, 7 (7 2016), 515–531. https://doi.org/10.1080/10447318.2016.1177300",
      "doi": ""
    },
    {
      "text": "Dana Rotman and Jennifer Preece. 2010. The’WeTube’in YouTube–creating an online community through video sharing. International Journal of Web Based Communities 6, 3(2010), 317–333.",
      "doi": "10.1504/IJWBC.2010.033755"
    },
    {
      "text": "Dana Rotman, Sarah Vieweg, Sarita Yardi, Ed Chi, Jenny Preece, Ben Shneiderman, Peter Pirolli, and Tom Glaisyer. 2011. From Slacktivism to Activism: Participatory Culture in the Age of Social Media. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 819–822. https://doi.org/10.1145/1979742.1979543",
      "doi": "10.1145/1979742.1979543"
    },
    {
      "text": "Carsten Schwemmer and Sandra Ziewiecki. 2018. Social Media Sellout: The Increasing Role of Product Promotion on YouTube. Social Media + Society 4, 3 (7 2018), 2056305118786720. https://doi.org/10.1177/2056305118786720",
      "doi": ""
    },
    {
      "text": "Kristen M Scott, Simone Ashby, and Julian Hanna. 2020. \"Human, All Too Human\": NOAA Weather Radio and the Emotional Impact of Synthetic Voices. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3313831.3376338",
      "doi": "10.1145/3313831.3376338"
    },
    {
      "text": "Joseph Seering, Juan Pablo Flores, Saiph Savage, and Jessica Hammer. 2018. The Social Roles of Bots: Evaluating Impact of Bots on Discussions in Online Communities. Proc. ACM Hum.-Comput. Interact. 2, CSCW (11 2018). https://doi.org/10.1145/3274426",
      "doi": "10.1145/3274426"
    },
    {
      "text": "Joseph Seering, Jessica Hammer, Geoff Kaufman, and Diyi Yang. 2020. Proximate Social Factors in First-Time Contribution to Online Communities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376151",
      "doi": "10.1145/3313831.3376151"
    },
    {
      "text": "Prince Kwame Senyo, Kecheng Liu, and John Effah. 2019. Digital business ecosystem: Literature review and a framework for future research. International Journal of Information Management 47 (2019), 52–64. https://doi.org/10.1016/j.ijinfomgt.2019.01.002",
      "doi": "10.1016/j.ijinfomgt.2019.01.002"
    },
    {
      "text": "Woosuk Seo and Hyunggu Jung. 2021. Understanding the Community of Blind or Visually Impaired Vloggers on YouTube. Universal Access in the Information Society 20, 1 (2021), 31–44. https://doi.org/10.1007/s10209-019-00706-6",
      "doi": "10.1007/s10209-019-00706-6"
    },
    {
      "text": "G Sharma, A Dhall, and J Cai. 2021. Audio-visual Automatic Group Affect Analysis. IEEE Transactions on Affective Computing(2021), 1. https://doi.org/10.1109/TAFFC.2021.3104170",
      "doi": ""
    },
    {
      "text": "Jeff T Sheng and Sanjay R Kairam. 2020. From Virtual Strangers to IRL Friends: Relationship Development in Livestreaming Communities on Twitch. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (10 2020). https://doi.org/10.1145/3415165",
      "doi": "10.1145/3415165"
    },
    {
      "text": "Stephen Tsung-Han Sher and Norman Makoto Su. 2019. Speedrunning for Charity: How Donations Gather Around a Live Streamed Couch. Proc. ACM Hum.-Comput. Interact. 3, CSCW (11 2019). https://doi.org/10.1145/3359150",
      "doi": "10.1145/3359150"
    },
    {
      "text": "Yuya Shibuya, Andrea Hamm, and Teresa Cerratto Pargman. 2022. Mapping HCI research methods for studying social media interaction: A systematic literature review. Computers in Human Behavior 129 (2022), 107131. https://doi.org/10.1016/j.chb.2021.107131",
      "doi": "10.1016/j.chb.2021.107131"
    },
    {
      "text": "Irina Shklovski, Leysia Palen, and Jeannette Sutton. 2008. Finding Community through Information and Communication Technology in Disaster Response. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work(CSCW ’08). Association for Computing Machinery, New York, NY, USA, 127–136. https://doi.org/10.1145/1460563.1460584",
      "doi": "10.1145/1460563.1460584"
    },
    {
      "text": "Ellen Simpson and Bryan Semaan. 2021. For You, or For\"You\"? Everyday LGBTQ+ Encounters with TikTok. Proc. ACM Hum.-Comput. Interact. 4, CSCW3 (1 2021). https://doi.org/10.1145/3432951",
      "doi": "10.1145/3432951"
    },
    {
      "text": "Max Sjöblom and Juho Hamari. 2017. Why do people watch others play video games? An empirical study on the motivations of Twitch users. Computers in Human Behavior 75 (2017), 985–996. https://doi.org/10.1016/j.chb.2016.10.019",
      "doi": "10.1016/j.chb.2016.10.019"
    },
    {
      "text": "Naomi Smith and Anne-Marie Snider. 2019. ASMR, affect and digitally-mediated intimacy. Emotion, Space and Society 30 (2019), 41–48. https://doi.org/10.1016/j.emospa.2018.11.002",
      "doi": ""
    },
    {
      "text": "Chareen Snelson. 2011. YouTube across the disciplines: A review of the literature. MERLOT Journal of Online Learning and Teaching (2011).",
      "doi": ""
    },
    {
      "text": "Chareen Snelson. 2013. Vlogging about school on YouTube: An exploratory study. New Media & Society 17, 3 (9 2013), 321–339. https://doi.org/10.1177/1461444813504271",
      "doi": ""
    },
    {
      "text": "Chareen Snelson, Kerry Rice, and Constance Wyzard. 2012. Research priorities for YouTube and video-sharing technologies: A Delphi study. British Journal of Educational Technology 43, 1 (1 2012), 119–129. https://doi.org/10.1111/j.1467-8535.2010.01168.x",
      "doi": ""
    },
    {
      "text": "Chareen L Snelson. 2016. Qualitative and Mixed Methods Social Media Research: A Review of the Literature. International Journal of Qualitative Methods 15, 1 (3 2016), 1609406915624574. https://doi.org/10.1177/1609406915624574",
      "doi": ""
    },
    {
      "text": "Statista. 2022. Bilibili: average MAUs 2022. https://www.statista.com/statistics/1109108/bilibili-average-monthly-active-users/",
      "doi": ""
    },
    {
      "text": "Statista. 2022. TikTok MAU 2021. https://www.statista.com/statistics/1267892/tiktok-global-mau/",
      "doi": ""
    },
    {
      "text": "Alina Striner, Andrew M Webb, Jessica Hammer, and Amy Cook. 2021. Mapping Design Spaces for Audience Participation in Game Live Streaming. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445511",
      "doi": "10.1145/3411764.3445511"
    },
    {
      "text": "Michael Swart, Ylana Lopez, Arunesh Mathur, and Marshini Chetty. 2020. Is This An Ad?: Automatically Disclosing Online Endorsements On YouTube With AdIntuition. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376178",
      "doi": "10.1145/3313831.3376178"
    },
    {
      "text": "Lee Taber and Steve Whittaker. 2018. Personality Depends on The Medium: Differences in Self-Perception on Snapchat, Facebook and Offline. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174181",
      "doi": "10.1145/3173574.3174181"
    },
    {
      "text": "John Tang, Gina Venolia, Kori Inkpen, Charles Parker, Robert Gruen, and Alicia Pelton. 2017. Crowdcasting: Remotely Participating in Live Events Through Multiple Live Streams. Proc. ACM Hum.-Comput. Interact. 1, CSCW (12 2017). https://doi.org/10.1145/3134733",
      "doi": "10.1145/3134733"
    },
    {
      "text": "John C Tang, Gina Venolia, and Kori M Inkpen. 2016. Meerkat and Periscope: I Stream, You Stream, Apps Stream for Live Streams. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 4770–4780. https://doi.org/10.1145/2858036.2858374",
      "doi": "10.1145/2858036.2858374"
    },
    {
      "text": "Lu Tang, Kayo Fujimoto, Muhammad (Tuan) Amith, Rachel Cunningham, Rebecca A Costantini, Felicia York, Grace Xiong, Julie A Boom, and Cui Tao. 2021. “Down the Rabbit Hole” of Vaccine Misinformation on YouTube: Network Exposure Study. J Med Internet Res 23, 1 (2021), e23262. https://doi.org/10.2196/23262",
      "doi": ""
    },
    {
      "text": "Ningjing Tang, Lei Tao, Bo Wen, and Zhicong Lu. 2022. Dare to Dream, Dare to Livestream: How E-Commerce Livestreaming Empowers Chinese Rural Women. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3517634",
      "doi": "10.1145/3491102.3517634"
    },
    {
      "text": "L Teijeiro-Mosquera, J Biel, J L Alba-Castro, and D Gatica-Perez. 2015. What Your Face Vlogs About: Expressions of Emotion and Big-Five Traits Impressions in YouTube. IEEE Transactions on Affective Computing 6, 2 (2015), 193–205. https://doi.org/10.1109/TAFFC.2014.2370044",
      "doi": "10.1109/TAFFC.2014.2370044"
    },
    {
      "text": "Hibby Thach, Samuel Mayworm, Daniel Delmonaco, and Oliver Haimson. 2022. (In)visible moderation: A digital ethnography of marginalized users and content moderation on Twitch and Reddit. New Media & Society (7 2022), 14614448221109804. https://doi.org/10.1177/14614448221109804",
      "doi": ""
    },
    {
      "text": "Kurt Thomas, Patrick Gage Kelley, Sunny Consolvo, Patrawat Samermit, and Elie Bursztein. 2022. “It’s Common and a Part of Being a Content Creator”: Understanding How Creators Experience and Cope with Hate and Harassment Online. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3501879",
      "doi": "10.1145/3491102.3501879"
    },
    {
      "text": "Verity Anne Trott. 2020. ‘Gillette: The best a beta can get’: Networking hegemonic masculinity in the digital sphere. New Media & Society 24, 6 (12 2020), 1417–1434. https://doi.org/10.1177/1461444820978293",
      "doi": ""
    },
    {
      "text": "Anh Truong, Peggy Chi, David Salesin, Irfan Essa, and Maneesh Agrawala. 2021. Automatic Generation of Two-Level Hierarchical Tutorials from Instructional Makeup Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445721",
      "doi": "10.1145/3411764.3445721"
    },
    {
      "text": "Jirassaya Uttarapong, Jie Cai, and Donghee Yvette Wohn. 2021. Harassment Experiences of Women and LGBTQ Live Streamers and How They Handled Negativity. In ACM International Conference on Interactive Media Experiences(IMX ’21). Association for Computing Machinery, New York, NY, USA, 7–19. https://doi.org/10.1145/3452918.3458794",
      "doi": "10.1145/3452918.3458794"
    },
    {
      "text": "José Van Dijck. 2013. The culture of connectivity: A critical history of social media. Oxford University Press, New York, NY. 110 – 132 pages.",
      "doi": ""
    },
    {
      "text": "Jorge Vázquez-Herrero, María-Cruz Negreira-Rey, and Xosé López-García. 2020. Let’s dance the news! How the news media are adapting to the logic of TikTok. Journalism 23, 8 (10 2020), 1717–1735. https://doi.org/10.1177/1464884920969092",
      "doi": ""
    },
    {
      "text": "Bryan Wang, Meng Yu Yang, and Tovi Grossman. 2021. Soloist: Generating Mixed-Initiative Tutorials from Existing Guitar Instructional Videos Through Audio Processing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445162",
      "doi": "10.1145/3411764.3445162"
    },
    {
      "text": "Dennis Wang, Yi-Chieh Lee, and Wai-Tat Fu. 2019. \"I Love the Feeling of Being on Stage, but I Become Greedy\": Exploring the Impact of Monetary Incentives on Live Streamers’ Social Interactions and Streaming Content. Proc. ACM Hum.-Comput. Interact. 3, CSCW (11 2019). https://doi.org/10.1145/3359194",
      "doi": "10.1145/3359194"
    },
    {
      "text": "Yujia Wang, Wei Liang, Haikun Huang, Yongqi Zhang, Dingzeyu Li, and Lap-Fai Yu. 2021. Toward Automatic Audio Description Generation for Accessible Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445347",
      "doi": "10.1145/3411764.3445347"
    },
    {
      "text": "Richard D Waters and Paul M Jones. 2011. Using Video to Build an Organization’s Identity and Brand: A Content Analysis of Nonprofit Organizations’ YouTube Videos. Journal of Nonprofit & Public Sector Marketing 23, 3 (7 2011), 248–268. https://doi.org/10.1080/10495142.2011.594779",
      "doi": ""
    },
    {
      "text": "Julia K Weiss and Elizabeth L Cohen. 2019. Clicking for change: the role of empathy and negative affect on engagement with a charitable social media campaign. Behaviour & Information Technology 38, 12 (12 2019), 1185–1193. https://doi.org/10.1080/0144929X.2019.1578827",
      "doi": ""
    },
    {
      "text": "F Weninger, J Krajewski, A Batliner, and B Schuller. 2012. The Voice of Leadership: Models and Performances of Automatic Analysis in Online Speeches. IEEE Transactions on Affective Computing 3, 4 (2012), 496–508. https://doi.org/10.1109/T-AFFC.2012.15",
      "doi": "10.1109/T-AFFC.2012.15"
    },
    {
      "text": "Johann Wentzel, Sasa Junuzovic, James Devine, John Porter, and Martez Mott. 2022. Understanding How People with Limited Mobility Use Multi-Modal Input. In CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3491102.3517458",
      "doi": "10.1145/3491102.3517458"
    },
    {
      "text": "Robert E Wilson, Samuel D Gosling, and Lindsay T Graham. 2012. A Review of Facebook Research in the Social Sciences. Perspectives on Psychological Science 7, 3 (5 2012), 203–220. https://doi.org/10.1177/1745691612442904",
      "doi": ""
    },
    {
      "text": "Jason Wise. 2022. Twitch Statistics 2022: How Many People Use Twitch?https://earthweb.com/twitch-statistics/",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn. 2019. Volunteer Moderators in Twitch Micro Communities: How They Get Involved, the Roles They Play, and the Emotional Labor They Experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300390",
      "doi": "10.1145/3290605.3300390"
    },
    {
      "text": "Donghee Yvette Wohn and Guo Freeman. 2020. Audience Management Practices of Live Streamers on Twitch. In ACM International Conference on Interactive Media Experiences(IMX ’20). Association for Computing Machinery, New York, NY, USA, 106–116. https://doi.org/10.1145/3391614.3393653",
      "doi": "10.1145/3391614.3393653"
    },
    {
      "text": "Donghee Yvette Wohn, Guo Freeman, and Caitlin McLaughlin. 2018. Explaining Viewers’ Emotional, Instrumental, and Financial Support Provision for Live Streamers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174048",
      "doi": "10.1145/3173574.3174048"
    },
    {
      "text": "Joost F Wolfswinkel, Elfi Furtmueller, and Celeste P M Wilderom. 2013. Using grounded theory as a method for rigorously reviewing literature. European Journal of Information Systems 22, 1 (1 2013), 45–55. https://doi.org/10.1057/ejis.2011.51",
      "doi": ""
    },
    {
      "text": "Lindsey Wotanis and Laurie McMillan. 2014. Performing Gender on YouTube. Feminist Media Studies 14, 6 (11 2014), 912–928. https://doi.org/10.1080/14680777.2014.882373",
      "doi": ""
    },
    {
      "text": "Eva Yiwei Wu, Emily Pedersen, and Niloufar Salehi. 2019. Agent, Gatekeeper, Drug Dealer: How Content Creators Craft Algorithmic Personas. Proc. ACM Hum.-Comput. Interact. 3, CSCW (11 2019). https://doi.org/10.1145/3359321",
      "doi": "10.1145/3359321"
    },
    {
      "text": "Qunfang Wu, Yisi Sang, Shan Zhang, and Yun Huang. 2018. Danmaku vs. Forum Comments: Understanding User Participation and Knowledge Sharing in Online Videos. In Proceedings of the 2018 ACM Conference on Supporting Groupwork(GROUP ’18). Association for Computing Machinery, New York, NY, USA, 209–218. https://doi.org/10.1145/3148330.3148344",
      "doi": "10.1145/3148330.3148344"
    },
    {
      "text": "Siqi Wu, Marian-Andrei Rizoiu, and Lexing Xie. 2019. Estimating Attention Flow in Online Video Networks. Proc. ACM Hum.-Comput. Interact. 3, CSCW (11 2019). https://doi.org/10.1145/3359285",
      "doi": "10.1145/3359285"
    },
    {
      "text": "Tim Wulf, Frank M Schneider, and Stefan Beckert. 2018. Watching Players: An Exploration of Media Enjoyment on Twitch. Games and Culture 15, 3 (7 2018), 328–346. https://doi.org/10.1177/1555412018788161",
      "doi": ""
    },
    {
      "text": "Ying Xiang and Seong Wook Chae. 2022. Influence of Perceived Interactivity on Continuous Use Intentions on the Danmaku Video Sharing Platform: Belongingness Perspective. International Journal of Human–Computer Interaction 38, 6 (4 2022), 573–593. https://doi.org/10.1080/10447318.2021.1952803",
      "doi": ""
    },
    {
      "text": "Haibo Yang and Mary Tate. 2009. Where are we at with cloud computing?: a descriptive literature review. (2009). https://doi.org/10.17705/1CAIS.03102",
      "doi": ""
    },
    {
      "text": "Saelyne Yang, Changyoon Lee, Hijung Valentina Shin, and Juho Kim. 2020. Snapstream: Snapshot-Based Interaction in Live Streaming for Visual Art. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376390",
      "doi": "10.1145/3313831.3376390"
    },
    {
      "text": "Matin Yarmand, Dongwook Yoon, Samuel Dodson, Ido Roll, and Sidney S Fels. 2019. \"Can You Believe [1:21]?!\": Content and Time-Based Reference Patterns in Video Comments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300719",
      "doi": "10.1145/3290605.3300719"
    },
    {
      "text": "Jina H Yoo and Junghyun Kim. 2012. Obesity in the New Media: A Content Analysis of Obesity Videos on YouTube. Health Communication 27, 1 (1 2012), 86–97. https://doi.org/10.1080/10410236.2011.569003",
      "doi": ""
    },
    {
      "text": "Feng Zhou, X Jessie Yang, and Xin Zhang. 2020. Takeover Transition in Autonomous Vehicles: A YouTube Study. International Journal of Human–Computer Interaction 36, 3 (2 2020), 295–306. https://doi.org/10.1080/10447318.2019.1634317",
      "doi": ""
    },
    {
      "text": "Maria Zimmermann and Regina Jucks. 2019. With a View to the Side: YouTube’s Sidebar and YouTuber’s Linguistic Style as Hints for Trust-Related Evaluations. International Journal of Human–Computer Interaction 35, 14 (8 2019), 1279–1291. https://doi.org/10.1080/10447318.2018.1519165",
      "doi": ""
    }
  ]
}