{
  "doi": "10.1145/3544548.3581505",
  "title": "Self-Tracking to Do Less: An Autoethnography of Long COVID That Informs the Design of Pacing Technologies",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Long COVID is a post-viral illness where symptoms are still experienced more than three months after an infection of COVID 19. In line with a recent shift within HCI and research on self-tracking towards first-person methodologies, I present the results of an 18-month long autoethnographic study of using a Fitbit fitness tracker whilst having long COVID. In contrast to its designed intentions, I misused my Fitbit to do less in order to pace and manage my illness. My autoethnography illustrates three modes of using fitness tracking technologies to do less and points to the new design space of technologies for reducing, rather than increasing, activity in order to manage chronic illnesses where over-exertion would lead to a worsening of symptoms. I propose that these “pacing technologies” should acknowledge the interoceptive and fluctuating nature of the user's body and support user's decision-making when managing long-term illness and maintaining quality of life.",
  "authors": [
    {
      "name": "Sarah Homewood",
      "institution": "Department of Computer Science, University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-99659021355/rel-imgonly/edity.jpg",
      "acmid": "99659021355",
      "orcid": "0000-0003-1389-8246"
    }
  ],
  "references": [
    {
      "text": "48 hours of Blood Sugar Tracking - Quantified Self / Self Experimentation - Quantified Self Forum: https://forum.quantifiedself.com/t/48-hours-of-blood-sugar-tracking/7743. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "A clinical case definition of post COVID-19 condition by a Delphi consensus, 6 October 2021: 2021. https://www.who.int/publications/i/item/WHO-2019-nCoV-Post_COVID-19_condition-Clinical_case_definition-2021.1. Accessed: 2021-11-25.",
      "doi": ""
    },
    {
      "text": "About Chronic Diseases | CDC: https://www.cdc.gov/chronicdisease/about/index.htm. Accessed: 2022-09-14.",
      "doi": ""
    },
    {
      "text": "Andersen, T.O. 2022. Patient Data Work with Consumer Self-Tracking: Exploring Affective and Temporal Dimensions in Chronic Self-Care. Proceedings of the 16th EAI International Conference on Pervasive Computing Technologies for Healthcare. (2022).",
      "doi": ""
    },
    {
      "text": "Ayobi, A. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. (2018), To appear. DOI:https://doi.org/10.1145/3173574.3173602.",
      "doi": "10.1145/3173574.3173602"
    },
    {
      "text": "Ayobi, A. 2017. Quantifying the body and caring for the mind: Self-tracking in multiple sclerosis. Conference on Human Factors in Computing Systems - Proceedings (May 2017), 6889–6901.",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Ayobi, A. 2016. Reflections on 5 Years of Personal Informatics. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’16. (2016), 2774–2781. DOI:https://doi.org/10.1145/2851581.2892406.",
      "doi": "10.1145/2851581.2892406"
    },
    {
      "text": "Ayobi, A. 2020. Trackly: A Customisable and Pictorial Self-Tracking App to Support Agency in Multiple Sclerosis Self-Care. Conference on Human Factors in Computing Systems - Proceedings (Apr. 2020).",
      "doi": "10.1145/3313831.3376809"
    },
    {
      "text": "Balaam, M. 2019. Emotion work in experience-centred design. Conference on Human Factors in Computing Systems - Proceedings. (2019). DOI:https://doi.org/10.1145/3290605.3300832.",
      "doi": "10.1145/3290605.3300832"
    },
    {
      "text": "Barad, K. 1996. Meeting the universe halfway: Realism and social constructivism without contradiction. Feminism, Science and the Philosophy of Science.",
      "doi": ""
    },
    {
      "text": "Brown, D.A. and O'Brien, K.K. 2021. Conceptualising Long COVID as an episodic health condition. BMJ Global Health. 6, 9 (Sep. 2021), e007004. DOI:https://doi.org/10.1136/BMJGH-2021-007004.",
      "doi": ""
    },
    {
      "text": "Bussone, A. 2016. “It Feels Like I'm Managing Myself”: HIV + People Tracking Their Personal Health Information. Proceedings of the 9th Nordic Conference on Human-Computer Interaction (2016).",
      "doi": "10.1145/2971485.2971542"
    },
    {
      "text": "Campo Woytuk, N. 2020. Touching and Being in Touch with the Menstruating Body. Proceedings of the 2020 ACM Designing Interactive Systems Conference (2020), 1–14.",
      "doi": ""
    },
    {
      "text": "Carel, H. 2016. Phenomenology of illness. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Carrington, P. 2015. “But, I don't take steps”: Examining the inaccessibility of fitness trackers for wheelchair athletes. ASSETS 2015 - Proceedings of the 17th International ACM SIGACCESS Conference on Computers and Accessibility (Oct. 2015), 193–201.",
      "doi": "10.1145/2700648.2809845"
    },
    {
      "text": "Cifor, M. and Garcia, P. 2019. Inscribing gender: A duoethnographic examination of gendered values and practices in fitness tracker design. Proceedings of the Annual Hawaii International Conference on System Sciences (2019), 2132–2141.",
      "doi": ""
    },
    {
      "text": "Clawson, J. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. ACM International Joint Conference on Pervasive and Ubiquitous Computing. (2015), 647–658. DOI:https://doi.org/10.1145/2750858.2807554.",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Consolvo, S. 2008. Activity Sensing in the Wild: A Field Trial of UbiFit Garden. Proc. of CHI 2008. (2008), 1797–1806. DOI:https://doi.org/10.1145/1357054.1357335.",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Consolvo, S. 2006. Design Requirements for Technologies that Encourage Physical Activity. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. (2006). DOI:https://doi.org/10.1145/1124772.",
      "doi": "10.1145/1124772"
    },
    {
      "text": "Cosley, D. 2017. Introduction to This Special Issue on the Lived Experience of Personal Informatics. Human-Computer Interaction. 32, 5–6 (2017), 197–207. DOI:https://doi.org/10.1080/07370024.2017.1324787.",
      "doi": "10.1080/07370024.2017.1324787"
    },
    {
      "text": "Couzin-Frankel, J. and Mastin, A. 2022. Clues to long COVID. Science. 376, 6599 (Jun. 2022), 1261–1265. DOI:https://doi.org/10.1126/SCIENCE.ADD4297.",
      "doi": ""
    },
    {
      "text": "Davies, T. 2019. Patient perspectives on self-management technologies for chronic fatigue syndrome. Conference on Human Factors in Computing Systems - Proceedings. (May 2019). DOI:https://doi.org/10.1145/3290605.3300452.",
      "doi": "10.1145/3290605.3300452"
    },
    {
      "text": "Desjardins, A. 2021. Introduction to the Special Issue on First-Person Methods in HCI. ACM Transactions on Computer-Human Interaction. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Desjardins, A. and Ball, A. 2018. Revealing tensions in autobiographical design in HCI. DIS 2018 - Proceedings of the 2018 Designing Interactive Systems Conference. (2018), 753–764. DOI:https://doi.org/10.1145/3196709.3196781.",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "D'ignazio, C. and Klein, L. 2020. Data feminism. MIT press.",
      "doi": ""
    },
    {
      "text": "Dourish, P. 2013. Epilogue: Where the Action Was , Wasn ’t , Should Have Been and Migh Yet Be. ACM Transactions on Computer-Human Interaction. 20, 1 (2013), 10–13. DOI:https://doi.org/10.1145/2442106.2442108.",
      "doi": "10.1145/2442106.2442108"
    },
    {
      "text": "Dourish, P. 2001. Where The Action Is: The Foundations Of Embodied Interaction. MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Ellis, Carolyn & Bochner, A.P. 2000. Autoethnography, personal narrative, reflexivity: Researcher as subject. Handbook of Qualitative Research. January 2000 (2000), 733–768. DOI:https://doi.org/10.1017/CBO9781107415324.004.",
      "doi": ""
    },
    {
      "text": "Epstein, D.A. 2015. A lived informatics model of personal informatics. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’15. (2015), 731–742. DOI:https://doi.org/10.1145/2750858.2804250.",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Epstein, D.A. 2016. Beyond Abandonment to Next Steps: Understanding and Designing for Life after Personal Informatics Tool Use. Chi’16. (2016), 1109–1113. DOI:https://doi.org/10.1145/2858036.2858045.",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Fatigue | Your COVID Recovery: https://www.yourcovidrecovery.nhs.uk/managing-the-effects/effects-on-your-body/fatigue/. Accessed: 2022-06-20.",
      "doi": ""
    },
    {
      "text": "Feehan, L.M. 2018. Accuracy of Fitbit Devices: Systematic Review and Narrative Syntheses of Quantitative Data. JMIR Mhealth Uhealth 2018;6(8):e10527 https://mhealth.jmir.org/2018/8/e10527. 6, 8 (Aug. 2018), e10527. DOI:https://doi.org/10.2196/10527.",
      "doi": ""
    },
    {
      "text": "Fitbit Trackers: 2021. https://www.fitbit.com/global/se/products/trackers. Accessed: 2021-12-07.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. 2002. Persuasive technology. Ubiquity. 2002, December (Dec. 2002), 2. DOI:https://doi.org/10.1145/764008.763957.",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Forlano, L. 2017. Data Rituals in Intimate Infrastructures: Crip Time and the Disabled Cyborg Body as an Epistemic Site of Feminist Science. 3, 2 (2017), 1–28.",
      "doi": ""
    },
    {
      "text": "Fritz, T. 2014. Persuasive Technology in the Real World: A Study of Long-Term Use of Activity Sensing Devices for Fitness. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. (2014), 487–496. DOI:https://doi.org/10.1145/2556288.2557383.",
      "doi": "10.1145/2556288.2557383"
    },
    {
      "text": "Garcia, P. and Cifor, M. 2019. Expanding our reflexive toolbox: Collaborative possibilities for examining socio-technical systems using duoethnography. Proceedings of the ACM on Human-Computer Interaction. 3, CSCW (Nov. 2019). DOI:https://doi.org/10.1145/3359292.",
      "doi": "10.1145/3359292"
    },
    {
      "text": "General Info and Specifications | Fitbit Sense User Manual: https://help.fitbit.com/manuals/sense/Content/manuals/html/General%20Info%20and%20Specifications.htm. Accessed: 2022-08-18.",
      "doi": ""
    },
    {
      "text": "Gorm, N. and Shklovski, I. 2017. Participant Driven Photo Elicitation for Understanding Episodic Activity Tracking: Benefits and Limitations. CSCW2017. (2017), 1350–1361. DOI:https://doi.org/10.1145/2998181.2998214.",
      "doi": "10.1145/2998181.2998214"
    },
    {
      "text": "Goudsmit, E.M. 2012. Pacing as a strategy to improve energy management in myalgic encephalomyelitis/chronic fatigue syndrome: A consensus document. Disability and Rehabilitation. 34, 13 (2012), 1140–1147. DOI:https://doi.org/10.3109/09638288.2011.635746.",
      "doi": ""
    },
    {
      "text": "Grosz, E. 1994. Volatile Bodies: Toward a Corporeal Feminism. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Hallnäs, L. and Redström, J. 2001. Slow technology–designing for reflection. Personal and Ubiquitous Computing. (2001), 5:201-212.",
      "doi": ""
    },
    {
      "text": "Hartle, M. 2021. Dissecting the nature of post-exertional malaise. Fatigue: Biomedicine, Health and Behavior. 9, 1 (2021), 33–44. DOI:https://doi.org/10.1080/21641846.2021.1905415.",
      "doi": ""
    },
    {
      "text": "Holtzman, C.S. 2019. Assessment of post-exertional malaise (PEM) in patients with myalgic encephalomyelitis (ME) and chronic fatigue syndrome (CFS): A patient-driven survey. Diagnostics. 9, 1 (Mar. 2019). DOI:https://doi.org/10.3390/diagnostics9010026.",
      "doi": ""
    },
    {
      "text": "Homewood, S. 2019. Inaction as a design decision: Reflections on not designing self-tracking tools for menopause. Conference on Human Factors in Computing Systems - Proceedings. (May 2019), 10. DOI:https://doi.org/10.1145/3290607.3310430.",
      "doi": "10.1145/3290607.3310430"
    },
    {
      "text": "Homewood, S. 2018. Reframing Design Problems Within Women's Health. Proceedings of DRS2018 Design Research Society International Conference (2018).",
      "doi": ""
    },
    {
      "text": "Homewood, S. 2020. Removal as a Method: a Fourth Wave HCI Approach to Understanding the Experience of Self-Tracking. Proceedings of the 2020 ACM Designing Interactive Systems Conference. (2020). DOI:https://doi.org/10.1145/3357236.",
      "doi": "10.1145/3357236"
    },
    {
      "text": "Homewood, S. 2021. Tracing Conceptions of the Body in HCI: From User to More-Than-Human. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. (2021). DOI:https://doi.org/10.1145/3411764.",
      "doi": "10.1145/3411764"
    },
    {
      "text": "Homewood, S. and Vallgårda, A. 2020. Putting phenomenological theories to work in the design of self-tracking technologies. DIS 2020 - Proceedings of the 2020 ACM Designing Interactive Systems Conference. (Jul. 2020), 1833–1846. DOI:https://doi.org/10.1145/3357236.3395550.",
      "doi": "10.1145/3357236.3395550"
    },
    {
      "text": "Höök, K. 2018. Designing with the Body - Somaesthetic Interaction Design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Höök, K. 2010. Transferring qualities from horseback riding to design. Proceedings of the 6th Nordic Conference on Human-Computer Interaction Extending Boundaries - NordiCHI ’10. (2010), 226. DOI:https://doi.org/10.1145/1868914.1868943.",
      "doi": "10.1145/1868914.1868943"
    },
    {
      "text": "Howell, N. 2021. Cracks in the Success Narrative: Rethinking Failure in Design Research through a Retrospective Trioethnography. ACM Transactions on Computer-Human Interaction. 28, 6 (Dec. 2021). DOI:https://doi.org/10.1145/3462447.",
      "doi": "10.1145/3462447"
    },
    {
      "text": "Huckaby, M.F. and Weinburgh, M.H. 2015. “Spark like a Dialectic.” International Review of Qualitative Research. 8, 1 (Feb. 2015), 49–67. DOI:https://doi.org/10.1525/irqr.2015.8.1.49.",
      "doi": ""
    },
    {
      "text": "Is Long COVID Really Chronic Fatigue Syndrome by Another Name? | Columbia Public Health: https://www.publichealth.columbia.edu/public-health-now/news/long-covid-really-chronic-fatigue-syndrome-another-name. Accessed: 2022-06-20.",
      "doi": ""
    },
    {
      "text": "JafariNaimi, N. and Pollock, A. 2018. Heart Sense: experiments in design as a catalyst for feminist reflections on embodiment. DRS2018: Catalyst. 2, June (2018). DOI:https://doi.org/10.21606/drs.2018.409.",
      "doi": ""
    },
    {
      "text": "JM Reagle Jnr 2019. Hacking life: Systematized living and its discontents. MIT Press.",
      "doi": ""
    },
    {
      "text": "Leder, D. 2018. Inside Insights: A Phenomenology of Interoception. The Interoceptive Mind: From Homeostasis to Awareness,. M. Tsakiris and H. Preester De, eds. Oxford University Press. 307.",
      "doi": ""
    },
    {
      "text": "Leder, D. 1990. The Absent Body. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Leder, D. 2016. The Distressed Body: Rethinking Illness, Imprisonment, and Healing. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Lin, J.J. 2006. Fish'n’Steps: Encouraging Physical Activity with an Interactive Computer Game. International conference on ubiquitous computing (pp. 261-278). Springer, Berlin, Heidelberg. 4206, (2006), 261–278.",
      "doi": ""
    },
    {
      "text": "Loke, L. and Robertson, T. 2011. The lived body in design. Proceedings of the 23rd Australian Computer-Human Interaction Conference on - OzCHI ’11 (2011), 181–184.",
      "doi": ""
    },
    {
      "text": "Lucero, A. 2019. A Sample of One: First-Person Research Methods in HCI. Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion (DIS ’19 Companion): June 23–28, 2019, San Diego, CA, USA. ACM, New York, NY, USA, pp. 385-388. ISBN 9781450362702 Published (2019).",
      "doi": "10.1145/3301019.3319996"
    },
    {
      "text": "Lupton, D. 2017. How does health feel? Towards research on the affective atmospheres of digital health. Digital Health. 3, (2017), 205520761770127. DOI:https://doi.org/10.1177/2055207617701276.",
      "doi": ""
    },
    {
      "text": "Lupton, D. 2015. Quantified sex: a critical analysis of sexual and reproductive self-tracking using apps. Culture, health & sexuality. 17, 4 (2015), 440–453. DOI:https://doi.org/10.1080/13691058.2014.920528.",
      "doi": ""
    },
    {
      "text": "Lupton, D. 2013. The digitally engaged patient: Self-monitoring and self-care in the digital health era. Social Theory and Health. 11, 3 (Aug. 2013), 256–270. DOI:https://doi.org/10.1057/sth.2013.10.",
      "doi": ""
    },
    {
      "text": "Lupton, D. 2016. The Quantified Self. John Wiley and Sons.",
      "doi": "10.5555/3052450"
    },
    {
      "text": "Lupton, D. and Maslen, S. 2018. The Senses and Society The more-than-human sensorium: sensory engagements with digital self-tracking technologies. (2018). DOI:https://doi.org/10.1080/17458927.2018.1480177.",
      "doi": ""
    },
    {
      "text": "Mansoor, G.A. 2006. Orthostatic Hypotension Due to Autonomic Disorders in the Hypertension Clinic. American Journal of Hypertension. 19, 3 (Mar. 2006), 319–326. DOI:https://doi.org/10.1016/J.AMJHYPER.2005.09.019.",
      "doi": ""
    },
    {
      "text": "McKillop, M. 2018. Designing in the Dark: Eliciting Self-Tracking Dimensions for Understanding Enigmatic Diseases. ACM SIGCHI conference on Human Factors in Computing Systems, CHI 2018. (2018), 1–15. DOI:https://doi.org/10.1145/3173574.3174139.",
      "doi": "10.1145/3173574.3174139"
    },
    {
      "text": "Merleau-Ponty, M. 1962. Phenomenology of perception. Routledge.",
      "doi": ""
    },
    {
      "text": "Merleau-ponty, M. 1968. The Visible and the Invisible. Northern University Press.",
      "doi": ""
    },
    {
      "text": "Mishra, S.R. 2019. Supporting coping with Parkinson's disease through self-tracking. Conference on Human Factors in Computing Systems - Proceedings (May 2019).",
      "doi": "10.1145/3290605.3300337"
    },
    {
      "text": "My Disability Is Dynamic. Maybe you think all disabilities are… | by Brianne Benness | Age of Awareness | Medium: https://medium.com/age-of-awareness/my-disability-is-dynamic-bc2a619fcc1. Accessed: 2022-08-16.",
      "doi": ""
    },
    {
      "text": "Nafus, D. and Sherman, J. 2014. This one does not go up to 11: The quantified self movement as an alternative big data practice. International Journal of Communication. 8, 1 (2014), 1784–1794. DOI:https://doi.org/10.4018/978-1-4666-4309-3.ch012.",
      "doi": ""
    },
    {
      "text": "Neustaedter, C. and Sengers, P. 2012. Autobiographical Design in HCI Research: Designing and Learning through Use-It-Yourself. Proceedings of the Designing Interactive Systems Conference, DIS ’12. (2012), 514–523. DOI:https://doi.org/10.1145/2317956.2318034.",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Odom, W. 2018. Attending to Slowness and temporality with Olly and Slow Game: A design inquiry into supporting longer-term relations with everyday computational objects. Conference on Human Factors in Computing Systems - Proceedings. 2018-April, (2018), 1–13. DOI:https://doi.org/10.1145/3173574.3173651.",
      "doi": "10.1145/3173574.3173651"
    },
    {
      "text": "Odom, W. 2019. Investigating slowness as a frame to design longer-term experiences with personal data: A field study of olly. Conference on Human Factors in Computing Systems - Proceedings (2019).",
      "doi": "10.1145/3290605.3300264"
    },
    {
      "text": "O'Kane, A.A. 2014. Gaining Empathy for Non-Routine Mobile Device Use Through Autoethnography. Conference on Human Factors in Computing Systems - Proceedings (2014), 987–990.",
      "doi": ""
    },
    {
      "text": "Orji, R. and Moffatt, K. 2018. Persuasive technology for health and wellness: State-of-the-art and emerging trends. Health Informatics Journal. 24, 1 (Mar. 2018), 66–91. DOI:https://doi.org/10.1177/1460458216650979.",
      "doi": ""
    },
    {
      "text": "Our Science - Clinically Validated | Cardiogram by ilumivu: https://cardiogram.com/science/. Accessed: 2022-08-25.",
      "doi": ""
    },
    {
      "text": "Pacing and energy management | Action for ME: https://www.actionforme.org.uk/get-information/managing-your-symptoms/pacing-and-energy-management/. Accessed: 2023-01-26.",
      "doi": ""
    },
    {
      "text": "Postural tachycardia syndrome (PoTS) - NHS: https://www.nhs.uk/conditions/postural-tachycardia-syndrome/. Accessed: 2022-09-05.",
      "doi": ""
    },
    {
      "text": "Pretorius, E. 2021. Persistent clotting protein pathology in Long COVID/Post-Acute Sequelae of COVID-19 (PASC) is accompanied by increased levels of antiplasmin. Cardiovascular Diabetology. 20, 1 (Dec. 2021), 1–18. DOI:https://doi.org/10.1186/S12933-021-01359-7/FIGURES/7.",
      "doi": ""
    },
    {
      "text": "Purpura, S. 2011. Fit4Life: The design of a persuasive technology promoting healthy behavior and ideal weight. Conference on Human Factors in Computing Systems - Proceedings. (2011), 423–432. DOI:https://doi.org/10.1145/1978942.1979003.",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Redström, J. 2008. RE:Definitions of use. Design Studies. 29, 4 (Jul. 2008), 410–423. DOI:https://doi.org/10.1016/J.DESTUD.2008.05.001.",
      "doi": ""
    },
    {
      "text": "Rooksby, J. 2014. Personal tracking as lived informatics. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. (2014), 1163–1172. DOI:https://doi.org/10.1145/2556288.2557039.",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Rose, N. 2001. The Politics of Life Itself. 18, 6 (2001), 1–30.",
      "doi": ""
    },
    {
      "text": "Sanches, P. 2022. Diffraction-in-action: Designerly Explorations of Agential Realism Through Lived Data. CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2022), 1–18.",
      "doi": ""
    },
    {
      "text": "Schiphorst, T. and Loke, L. 2018. The Somatic Turn in Human-Computer Interaction. Interactions.",
      "doi": ""
    },
    {
      "text": "Shildrick, M. 1997. Leaky Bodies and Boundaries: Feminism, Postmodernism and (Bio) Ethics. Routledge.",
      "doi": ""
    },
    {
      "text": "Smartwatches with Fitness and Health Tracking | Garmin: https://www.garmin.com/en-US/c/sports-fitness/activity-fitness-trackers/. Accessed: 2022-09-12.",
      "doi": ""
    },
    {
      "text": "Smith, G.J.D. and Vonthethoff, B. 2017. Health by numbers? Exploring the practice and experience of datafied health. Health Sociology Review. 26, 1 (2017). DOI:https://doi.org/10.1080/14461242.2016.1196600.",
      "doi": ""
    },
    {
      "text": "Spiel, K. 2018. Fitter, happier, more productive? The normative ontology of fitness trackers. Conference on Human Factors in Computing Systems - Proceedings (Apr. 2018).",
      "doi": ""
    },
    {
      "text": "Svenaeus, F. 2000. The Hermeneutics of Medicine and the Phenomenology of Health. Springer Netherlands.",
      "doi": ""
    },
    {
      "text": "Taquet, M. 2021. Incidence, co-occurrence, and evolution of long-COVID features: A 6-month retrospective cohort study of 273,618 survivors of COVID-19. PLoS Medicine. 18, 9 (Sep. 2021). DOI:https://doi.org/10.1371/JOURNAL.PMED.1003773.",
      "doi": ""
    },
    {
      "text": "Turner, S. 2021. It was hard to find the words: Using an Autoethnographic Diary Study to Understand the Difficulties of Smart Home Cyber Security Practices. CHI Conference on Human Factors in Computing Systems Extended Abstracts (pp. 1-8). (Dec. 2021).",
      "doi": ""
    },
    {
      "text": "Unfit-Bits: http://www.unfitbits.com/. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Visible | Tracking & Pacing for invisible illness.: 2021. https://makevisible.co/. Accessed: 2021-12-10.",
      "doi": ""
    },
    {
      "text": "Watch – Apple (DK): https://www.apple.com/dk/watch/?afid=p238%7CsItQ1yXqO-dc_mtid_187079nc38483_pcrid_620501724697_pgrid_39067084759_pntwk_g_pchan__pexid__&cid=aos-dk-kwgo-watch–slid–bran-product-. Accessed: 2022-09-12.",
      "doi": ""
    },
    {
      "text": "Watch your step: why the 10,000 daily goal is built on bad science | Health & wellbeing | The Guardian: https://www.theguardian.com/lifeandstyle/2018/sep/03/watch-your-step-why-the-10000-daily-goal-is-built-on-bad-science. Accessed: 2022-09-12.",
      "doi": ""
    },
    {
      "text": "What is Quantified Self? - Quantified Self: 2019. https://quantifiedself.com/about/what-is-quantified-self/. Accessed: 2020-09-09.",
      "doi": ""
    },
    {
      "text": "Williams, K. 2015. An Anxious Alliance. Aarhus Series on Human Centered Computing. 1, 1 (2015), 121–132. DOI:https://doi.org/10.7146/aahcc.v1i1.21146.",
      "doi": "10.7146/aahcc.v1i1.21146"
    },
    {
      "text": "Wong, C.K. 2018. The bit doesn't fit: Evaluation of a commercial activity-tracker at slower walking speeds. Gait and Posture. 59, (Jan. 2018), 177–181. DOI:https://doi.org/10.1016/J.GAITPOST.2017.10.010.",
      "doi": ""
    }
  ]
}