{
  "doi": "10.1145/3544548.3581445",
  "title": "Toward a Multilingual Conversational Agent: Challenges and Expectations of Code-mixing Multilingual Users",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Multilingual speakers tend to interleave two or more languages when communicating. This communication strategy is called code-mixing, and it has surged with today’s ever-increasing linguistic and cultural diversity. Because of their communication style, multilinguals who use conversational agents have specific needs and expectations which are currently not being met by conversational systems. While research has been undertaken on code-mixing conversational systems, previous works have rarely focused on the code-mixing users themselves to discover their genuine needs. This work furthers our understanding of the challenges faced by code-mixing users in conversational agent interaction, unveils the key factors that users consider in code-mixing scenarios, and explores expectations that users have for future conversational agents capable of code-mixing. This study discusses the design implications of our findings and provides a guide on how to alleviate the challenges faced by multilingual users and how to improve the conversational agent user experience for multilingual users.",
  "authors": [
    {
      "name": "Yunjae J. Choi",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779262",
      "orcid": "0000-0002-0102-9513"
    },
    {
      "name": "Minha Lee",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702543",
      "orcid": "0000-0003-2460-3810"
    },
    {
      "name": "Sangsu Lee",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/do/10.1145/contrib-81416594796/rel-imgonly/profile.jpg",
      "acmid": "81416594796",
      "orcid": "0000-0002-3793-6801"
    }
  ],
  "references": [
    {
      "text": "Ivana Acocella. 2012. The focus groups in social research: advantages and disadvantages. Quality & Quantity 46, 4 (2012), 1125–1136.",
      "doi": ""
    },
    {
      "text": "Emily Ahn, Cecilia Jimenez, Yulia Tsvetkov, and Alan W Black. 2020. What code-switching strategies are effective in dialog systems?. In Proceedings of the Society for Computation in Linguistics 2020. 254–264.",
      "doi": ""
    },
    {
      "text": "Apple. Jun 07, 2021. Use multiple languages to speak to Siri in India. https://support.apple.com/en-in/HT212537.",
      "doi": ""
    },
    {
      "text": "JC Peter Auer. 2003. A conversation analytic approach to code-switching and transfer. In The bilingualism reader. Routledge, 167–187.",
      "doi": ""
    },
    {
      "text": "Peter Auer. 2005. A postscript: Code-switching and social identity. Journal of pragmatics 37, 3 (2005), 403–410.",
      "doi": ""
    },
    {
      "text": "So Hee Bae. 2013. The pursuit of multilingualism in transnational educational migration: Strategies of linguistic investment among Korean jogi yuhak families in Singapore. Language and Education 27, 5 (2013), 415–431.",
      "doi": ""
    },
    {
      "text": "Anshul Bawa, Pranav Khadpe, Pratik Joshi, Kalika Bali, and Monojit Choudhury. 2020. Do Multilingual Users Prefer Chat-bots that Code-mix? Let’s Nudge and Find Out!Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–23.",
      "doi": ""
    },
    {
      "text": "Izak Benbasat and Weiquan Wang. 2005. Trust in and adoption of online recommendation agents. Journal of the association for information systems 6, 3 (2005), 4.",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottridge. 2018. Understanding the Long-Term Use of Smart Speaker Assistants. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3, Article 91 (sep 2018), 24 pages. https://doi.org/10.1145/3264901",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Apoorva Bhalla. 2018. An Exploratory Study Understanding the Appropriated Use of Voice-Based Search and Assistants. In Proceedings of the 9th Indian Conference on Human Computer Interaction (Bangalore, India) (IndiaHCI’18). Association for Computing Machinery, New York, NY, USA, 90–94. https://doi.org/10.1145/3297121.3297136",
      "doi": "10.1145/3297121.3297136"
    },
    {
      "text": "Anna Bleakley, Daniel Rough, Abi Roper, Stephen Lindsay, Martin Porcheron, Minha Lee, Stuart Alan Nicholson, Benjamin R Cowan, and Leigh Clark. 2022. Exploring Smart Speaker User Experience for People Who Stammer. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility. 1–10.",
      "doi": "10.1145/3517428.3544823"
    },
    {
      "text": "Susanne Bodker. 1999. Scenarios in user-centred design-setting the stage for reflection and action. In Proceedings of the 32nd Annual Hawaii International Conference on Systems Sciences. 1999. HICSS-32. Abstracts and CD-ROM of Full Papers. IEEE, 11–pp.",
      "doi": ""
    },
    {
      "text": "Adrien Bousseau, Theophanis Tsandilas, Lora Oehlberg, and Wendy E Mackay. 2016. How novices sketch and prototype hand-fabricated objects. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 397–408.",
      "doi": "10.1145/2858036.2858159"
    },
    {
      "text": "Holly P Branigan, Martin J Pickering, Jamie Pearson, and Janet F McLean. 2010. Linguistic alignment between people and computers. Journal of pragmatics 42, 9 (2010), 2355–2368.",
      "doi": ""
    },
    {
      "text": "Manuel Bronstein. Aug 30, 2018. Meet the bilingual Google Assistant with new smart home devices. https://www.blog.google/products/assistant/meet-bilingual-google-assistant-new-smart-home-devices/.",
      "doi": ""
    },
    {
      "text": "A Suresh Canagarajah and Adrian J Wurr. 2011. Multilingual communication and language acquisition: New research directions. The reading matrix 11, 1 (2011).",
      "doi": ""
    },
    {
      "text": "Devon W Carbado and Mitu Gulati. 1999. Working identity. Cornell L. Rev. 85(1999), 1259.",
      "doi": ""
    },
    {
      "text": "Justine Cassell and Kristinn R Thorisson. 1999. The power of a nod and a glance: Envelope vs. emotional feedback in animated conversational agents. Applied Artificial Intelligence 13, 4-5 (1999), 519–538.",
      "doi": ""
    },
    {
      "text": "Özlem Çetinoğlu, Sarah Schulz, and Ngoc Thang Vu. 2016. Challenges of computational processing of code-switching. arXiv preprint arXiv:1610.02213(2016).",
      "doi": ""
    },
    {
      "text": "Sharanya Chakravarthy, Anjana Umapathy, and Alan W Black. 2020. Detecting Entailment in Code-Mixed Hindi-English Conversations. In Proceedings of the Sixth Workshop on Noisy User-generated Text (W-NUT 2020). Association for Computational Linguistics, Online, 165–170. https://doi.org/10.18653/v1/2020.wnut-1.22",
      "doi": ""
    },
    {
      "text": "Hyojin Chin, Lebogang Wame Molefi, and Mun Yong Yi. 2020. Empathy is all you need: How a conversational agent should respond to verbal abuse. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376461"
    },
    {
      "text": "Byung-Eun Cho. 2004. Issues concerning Korean learners of English: English education in Korea and some common difficulties of Korean students. The East Asian Learner 1, 2 (2004), 31–36.",
      "doi": ""
    },
    {
      "text": "Minji Cho, Sang-su Lee, and Kun-Pyo Lee. 2019. Once a kind friend is now a thing: Understanding how conversational agents at home are forgotten. In Proceedings of the 2019 on Designing Interactive Systems Conference. 1557–1569.",
      "doi": "10.1145/3322276.3322332"
    },
    {
      "text": "Dasom Choi, Daehyun Kwak, Minji Cho, and Sangsu Lee. 2020. \" Nobody speaks that fast!\" An empirical study of speech rate in conversational agents for people with vision impairments. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376569"
    },
    {
      "text": "Leigh Clark. 2018. Social boundaries of appropriate speech in HCI: A politeness perspective. In The 32nd International BCS Human Computer Interaction Conference (HCI 2018), Belfast, United Kingdom, 4-6 July 2018. BCS Learning and Development.",
      "doi": "10.14236/ewic/HCI2018.76"
    },
    {
      "text": "Leigh Clark, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane, Emer Gilmartin, Christine Murad, Cosmin Munteanu, 2019. What makes a good conversation? Challenges in designing truly conversational agents. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300705"
    },
    {
      "text": "Elisia Cohen. 2014. Relational and identity processes in communication: A contextual and meta-analytical review of communication accommodation theory. Communication yearbook 38(2014), 131–168.",
      "doi": ""
    },
    {
      "text": "Kevin Corti and Alex Gillespie. 2016. Co-constructing intersubjectivity with artificial conversational agents: people are more likely to initiate repairs of misunderstandings with agents represented as human. Computers in Human Behavior 58 (2016), 431–442.",
      "doi": "10.1016/j.chb.2015.12.039"
    },
    {
      "text": "Brock Craft and Paul Cairns. 2009. Sketching sketching: outlines of a collaborative design method. People and Computers XXIII Celebrating People and Technology (2009), 65–72.",
      "doi": ""
    },
    {
      "text": "Keqi Deng, Songjun Cao, and Long Ma. 2021. Improving accent identification and accented speech recognition under a framework of self-supervised learning. arXiv preprint arXiv:2109.07349(2021).",
      "doi": ""
    },
    {
      "text": "Munjal Desai, Kristen Stubbs, Aaron Steinfeld, and Holly Yanco. 2009. Creating trustworthy robots: Lessons and inspirations from automated systems. (2009).",
      "doi": ""
    },
    {
      "text": "Laurence Devillers, Sophie Rosset, Guillaume Dubuisson Duplessis, Lucile Bechade, Yucel Yemez, Bekir B Turker, Metin Sezgin, Engin Erzin, Kevin El Haddad, Stephane Dupont, 2018. Multifaceted engagement in social interaction with a machine: The joker project. In 2018 13th IEEE International Conference on Automatic Face & Gesture Recognition (FG 2018). IEEE, 697–701.",
      "doi": "10.1109/FG.2018.00110"
    },
    {
      "text": "Jean-Marc Dewaele and Wei Li. 2014. Intra- and inter-individual variation in self-reported code-switching patterns of adult multilinguals. International Journal of Multilingualism 11, 2 (2014), 225–246. https://doi.org/10.1080/14790718.2013.878347 arXiv:https://doi.org/10.1080/14790718.2013.878347",
      "doi": ""
    },
    {
      "text": "A Seza Doğruöz, Sunayana Sitaram, Barbara E Bullock, and Almeida Jacqueline Toribio. 2021. A survey of code-switching: Linguistic and social perspectives for language technologies. In The Joint Conference of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP 2021). Association for Computational Linguistics.",
      "doi": ""
    },
    {
      "text": "William Downes and Senior Fellow William Downes. 1998. Language and society. Vol. 10. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. \" Hey Google is it ok if I eat you?\" Initial explorations in child-agent interaction. In Proceedings of the 2017 conference on interaction design and children. 595–600.",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Irene Eleta and Jennifer Golbeck. 2014. Multilingual use of Twitter: Social networks at the language frontier. Computers in Human Behavior 41 (2014), 424–432.",
      "doi": "10.1016/j.chb.2014.05.005"
    },
    {
      "text": "Joshua A Fishman. 2020. Who speaks what language to whom and when?In The bilingualism reader. Routledge, 55–70.",
      "doi": ""
    },
    {
      "text": "William W Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI conference on Human factors in computing systems. 233–240.",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Graham R Gibbs. 2007. Thematic coding and categorizing. Analyzing qualitative data 703 (2007), 38–56.",
      "doi": ""
    },
    {
      "text": "Howard Giles, Nikolas Coupland, and Justine Coupland. 1991. 1. Accommodation theory: Communication, context, and contexts of accommodation., 68 pages.",
      "doi": ""
    },
    {
      "text": "Eun Go and S Shyam Sundar. 2019. Humanizing chatbots: The effects of visual, identity and conversational cues on humanness perceptions. Computers in Human Behavior 97 (2019), 304–316.",
      "doi": "10.1016/j.chb.2019.01.020"
    },
    {
      "text": "John J Gumperz. 1982. Discourse strategies. Number 1. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Khyatti Gupta, Meghana Joshi, Ankush Chatterjee, Sonam Damani, Kedhar Nath Narahari, and Puneet Agrawal. 2019. Insights from building an open-ended conversational agent. In Proceedings of the First Workshop on NLP for Conversational AI. 106–112.",
      "doi": ""
    },
    {
      "text": "Josiane F Hamers, Michel Blanc, Michel HA Blanc, Josiane F Hamers, 2000. Bilinguality and bilingualism. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Christina N Harrington, Radhika Garg, Amanda Woodward, and Dimitri Williams. 2022. “It’s Kind of Like Code-Switching”: Black Older Adults’ Experiences with a Voice Assistant for Health Information Seeking. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    },
    {
      "text": "Drew Harwell. July 19, 2018. The Accent Gap. https://www.washingtonpost.com/graphics/2018/business/alexa-does-not-understand-your-accent/?utm_term=.e7a5cfb619e4.",
      "doi": ""
    },
    {
      "text": "Robert D Hisrich and Michael P Peters. 1982. Focus groups: an innovative marketing research technique.Hospital & health services administration 27, 4 (1982), 8–21.",
      "doi": ""
    },
    {
      "text": "Shafquat Hussain, Omid Ameri Sianaki, and Nedal Ababneh. 2019. A survey on conversational agents/chatbots classification and design techniques. In Workshops of the International Conference on Advanced Information Networking and Applications. Springer, 946–956.",
      "doi": ""
    },
    {
      "text": "Ohad Inbar and Joachim Meyer. 2019. Politeness counts: Perceptions of peacekeeping robots. IEEE Transactions on Human-Machine Systems 49, 3 (2019), 232–240.",
      "doi": ""
    },
    {
      "text": "Ganesh Jawahar, El Moatez Billah Nagoudi, Muhammad Abdul-Mageed, and Laks VS Lakshmanan. 2021. Exploring text-to-text transformers for english to hinglish machine translation with synthetic code-mixing. arXiv preprint arXiv:2105.08807(2021).",
      "doi": ""
    },
    {
      "text": "Nkonko Mudipanu Kamwangamalu. 1989. Code-mixing and modernization. World Englishes 8, 3 (1989), 321–332.",
      "doi": ""
    },
    {
      "text": "Amanda Kann. 2022. Voice Assistants Have a Plurilingualism Problem. In Proceedings of the 4th Conference on Conversational User Interfaces. 1–5.",
      "doi": "10.1145/3543829.3544526"
    },
    {
      "text": "ZACHARY KEW-DENNISS. Sept 21, 2021. Google Assistant is stepping up its bilingual efforts with a new Spanish accent. https://www.androidpolice.com/2021/09/21/is-google-assistant-getting-better-at-pronouncing-spanish-words-claro-que-si/.",
      "doi": ""
    },
    {
      "text": "Sara Kiesler, Aaron Powers, Susan R Fussell, and Cristen Torrey. 2008. Anthropomorphic interactions with a robot and robot–like agent. Social Cognition 26, 2 (2008), 169–181.",
      "doi": ""
    },
    {
      "text": "Eunhee Kim. 2006. Reasons and motivations for code-mixing and code-switching. Issues in EFL 4, 1 (2006), 43–61.",
      "doi": ""
    },
    {
      "text": "Hyeji Kim, Inchan Jung, and Youn-kyung Lim. 2022. Understanding the Negative Aspects of User Experience in Human-likeness of Voice-based Conversational Agents. In Designing Interactive Systems Conference. 1418–1427.",
      "doi": ""
    },
    {
      "text": "Nicole C Krämer, Astrid von der Pütten, and Sabrina Eimler. 2012. Human-agent and human-robot interaction theory: Similarities to and differences from human-human interaction. In Human-computer interaction: The agency perspective. Springer, 215–240.",
      "doi": ""
    },
    {
      "text": "Richard A Krueger. 2014. Focus groups: A practical guide for applied research. Sage publications.",
      "doi": ""
    },
    {
      "text": "Jaemyung Lee, Wonyoung Park, and Sangsu Lee. 2021. Discovering the Design Challenges of Autonomous Vehicles through Exploring Scenarios via an Immersive Design Workshop. In Designing Interactive Systems Conference 2021. 322–338.",
      "doi": "10.1145/3461778.3462119"
    },
    {
      "text": "Minha Lee, Wonyoung Park, Sunok Lee, and Sangsu Lee. 2022. Distracting Moments in Videoconferencing: A Look Back at the Pandemic Period. In CHI Conference on Human Factors in Computing Systems. 1–21.",
      "doi": "10.1145/3491102.3517545"
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, Jodi Forlizzi, Siddhartha Srinivasa, and Paul Rybski. 2010. Gracefully mitigating breakdowns in robotic services. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 203–210.",
      "doi": ""
    },
    {
      "text": "Sunok Lee, Sungbae Kim, and Sangsu Lee. 2019. \"What Does Your Agent Look like?\": A Drawing Study to Understand Users’ Perceived Persona of Conversational Agent. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312796",
      "doi": "10.1145/3290607.3312796"
    },
    {
      "text": "Sang-Su Lee, Jeonghun Chae, Hyunjeong Kim, Youn-kyung Lim, and Kun-pyo Lee. 2013. Towards more natural digital content manipulation via user freehand gestural interaction in a living room. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. 617–626.",
      "doi": "10.1145/2493432.2493480"
    },
    {
      "text": "Sang-su Lee, Jaemyung Lee, and Kun-pyo Lee. 2017. Designing intelligent assistant through user participations. In Proceedings of the 2017 conference on designing interactive systems. 173–177.",
      "doi": "10.1145/3064663.3064733"
    },
    {
      "text": "Jiwei Li, Michel Galley, Chris Brockett, Georgios Spithourakis, Jianfeng Gao, and Bill Dolan. 2016. A Persona-Based Neural Conversation Model. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, Berlin, Germany, 994–1003. https://doi.org/10.18653/v1/P16-1094",
      "doi": ""
    },
    {
      "text": "Chenjun Ling, Ben Steichen, and Alexander G Choulos. 2018. A comparative user study of interactive multilingual search interfaces. In Proceedings of the 2018 conference on human information interaction & retrieval. 211–220.",
      "doi": "10.1145/3176349.3176383"
    },
    {
      "text": "Gesa A Linnemann and Regina Jucks. 2016. As in the question, so in the answer? Language style of human and machine speakers affects interlocutors’ convergence on wordings. Journal of Language and Social Psychology 35, 6 (2016), 686–697.",
      "doi": ""
    },
    {
      "text": "Michal Luria, Samantha Reig, Xiang Zhi Tan, Aaron Steinfeld, Jodi Forlizzi, and John Zimmerman. 2019. Re-Embodiment and Co-Embodiment: Exploration of social presence for robots and conversational agents. In Proceedings of the 2019 on Designing Interactive Systems Conference. 633–644.",
      "doi": "10.1145/3322276.3322340"
    },
    {
      "text": "Michal Luria, Samantha Reig, Xiang Zhi Tan, Aaron Steinfeld, Jodi Forlizzi, and John Zimmerman. 2019. Re-Embodiment and Co-Embodiment: Exploration of social presence for robots and conversational agents. In Proceedings of the 2019 on Designing Interactive Systems Conference. 633–644.",
      "doi": "10.1145/3322276.3322340"
    },
    {
      "text": "Michal Luria, Rebecca Zheng, Bennett Huffman, Shuangni Huang, John Zimmerman, and Jodi Forlizzi. 2020. Social boundaries for personal agents in the interpersonal space of the home. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3313831.3376311"
    },
    {
      "text": "Kamini Malhotra and Anu Khosla. 2008. Automatic identification of gender & accent in spoken Hindi utterances with regional Indian accents. In 2008 IEEE Spoken Language Technology Workshop. IEEE, 309–312.",
      "doi": ""
    },
    {
      "text": "André F. T. Martins, Joao Graca, Paulo Dimas, Helena Moniz, and Graham Neubig. 2020. Project MAIA: Multilingual AI Agent Assistant. In Proceedings of the 22nd Annual Conference of the European Association for Machine Translation. European Association for Machine Translation, Lisboa, Portugal, 495–496. https://aclanthology.org/2020.eamt-1.68",
      "doi": ""
    },
    {
      "text": "Dominic W Massaro, Ying Liu, Trevor H Chen, and Charles Perfetti. 2006. A multilingual embodied conversational agent for tutoring speech and language learning. In Ninth International Conference on Spoken Language Processing.",
      "doi": ""
    },
    {
      "text": "Barry McLaughlin. 2013. Second language acquisition in childhood: Volume 2: School-age Children. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Gonçalo Melo and Luísa Coheur. 2020. Towards a conversational agent with “character”. In International Conference on Computational Processing of the Portuguese Language. Springer, 420–424.",
      "doi": "10.1007/978-3-030-41505-1_41"
    },
    {
      "text": "Roger K Moore. 2017. Is spoken language all-or-nothing? Implications for future speech-based human-machine interaction. In Dialogues with Social Robots. Springer, 281–291.",
      "doi": ""
    },
    {
      "text": "David E Morrison and David E Morrison. 1998. The search for a method: Focus groups and the development of mass communication research. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Barbara CN Müller, Rick B van Baaren, Daniël H van Someren, and Ap Dijksterhuis. 2014. A present for Pinocchio: on when non-biological agents become real. Social Cognition 32, 4 (2014), 381.",
      "doi": ""
    },
    {
      "text": "Laya Muralidharan, Ewart J de Visser, and Raja Parasuraman. 2014. The effects of pitch contour and flanging on trust in speaking cognitive agents. In CHI’14 Extended Abstracts on Human Factors in Computing Systems. 2167–2172.",
      "doi": ""
    },
    {
      "text": "Pieter Muysken 2000. Bilingual speech: A typology of code-mixing. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. 72–78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Clifford Ivar Nass and Scott Brave. 2005. Wired for speech: How voice activates and advances the human-computer relationship. MIT press Cambridge.",
      "doi": "10.5555/1088925"
    },
    {
      "text": "Thomas Niesler and Febe De Wet. 2008. Accent identification in the presence of code-mixing.. In Odyssey. 27.",
      "doi": ""
    },
    {
      "text": "Tatsuya Nomura, Takayuki Kanda, Tomohiro Suzuki, and Kensuke Kato. 2008. Prediction of human behavior in human–robot interaction using psychological scales for anxiety and negative attitudes toward robots. IEEE transactions on robotics 24, 2 (2008), 442–451.",
      "doi": "10.1109/TRO.2007.914004"
    },
    {
      "text": "Richard L Oliver. 1980. A cognitive model of the antecedents and consequences of satisfaction decisions. Journal of marketing research 17, 4 (1980), 460–469.",
      "doi": ""
    },
    {
      "text": "Debajyoti Pal, Chonlameth Arpnikanondt, Suree Funilkul, and Vijayakumar Varadarajan. 2019. User experience with smart voice assistants: the accent perspective. In 2019 10th International Conference on Computing, Communication and Networking Technologies (ICCCNT). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Adam Palanica, Anirudh Thommandram, Andrew Lee, Michael Li, and Yan Fossat. 2019. Do you understand the words that are comin outta my mouth? Voice assistant comprehension of medication names. NPJ digital medicine 2, 1 (2019), 1–6.",
      "doi": ""
    },
    {
      "text": "Hae In Park. 2020. How do Korean–English bilinguals speak and think about motion events? Evidence from verbal and non-verbal tasks. Bilingualism: Language and Cognition 23, 3 (2020), 483–499. https://doi.org/10.1017/S1366728918001074",
      "doi": ""
    },
    {
      "text": "Sayhyon Park. 1991. Analysis of Korean intonation. University of Hawai’i at Manoa.",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice interfaces in everyday life. In proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "François Portet, Michel Vacher, Caroline Golanski, Camille Roux, and Brigitte Meillon. 2013. Design and evaluation of a smart home voice interface for the elderly: acceptability and objection aspects. Personal and Ubiquitous Computing 17, 1 (2013), 127–144.",
      "doi": "10.1007/s00779-011-0470-5"
    },
    {
      "text": "Amanda Purington, Jessie G Taft, Shruti Sannon, Natalya N Bazarova, and Samuel Hardman Taylor. 2017. \" Alexa is my new BFF\" Social Roles, User Satisfaction, and Personification of the Amazon Echo. In Proceedings of the 2017 CHI conference extended abstracts on human factors in computing systems. 2853–2859.",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "William C Ritchie and Tej K Bhatia. 2012. Social and psychological factors in language mixing. The handbook of bilingualism and multilingualism (2012), 375–390.",
      "doi": ""
    },
    {
      "text": "Mary Beth Rosson and John M Carroll. 2002. Usability engineering: scenario-based development of human-computer interaction. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Mary Beth Rosson and John M Carroll. 2009. Scenario-based design. In Human-computer interaction. CRC Press, 161–180.",
      "doi": ""
    },
    {
      "text": "Roland T Rust and Tuck Siong Chung. 2006. Marketing models of service and relationships. Marketing science 25, 6 (2006), 560–580.",
      "doi": ""
    },
    {
      "text": "Kristin E Schaefer, Jessie YC Chen, James L Szalma, and Peter A Hancock. 2016. A meta-analysis of factors influencing the development of trust in automation: Implications for understanding autonomy in future systems. Human factors 58, 3 (2016), 377–400.",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I Hong. 2018. \" Hey Alexa, What’s Up?\" A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 designing interactive systems conference. 857–868.",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Chen Shani, Alexander Libov, Sofia Tolmach, Liane Lewin-Eytan, Yoelle Maarek, and Dafna Shahaf. 2022. “Alexa, Do You Want to Build a Snowman?”Characterizing Playful Requests to Conversational Agents. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–7.",
      "doi": ""
    },
    {
      "text": "Sarah J Shin and Lesley Milroy. 2000. Conversational codeswitching among Korean-English bilingual children. International journal of Bilingualism 4, 3 (2000), 351–383.",
      "doi": ""
    },
    {
      "text": "Heung-Yeung Shum, Xiao-dong He, and Di Li. 2018. From Eliza to XiaoIce: challenges and opportunities with social chatbots. Frontiers of Information Technology & Electronic Engineering 19, 1(2018), 10–26.",
      "doi": ""
    },
    {
      "text": "Sunayana Sitaram, Khyathi Raghavi Chandu, Sai Krishna Rallabandi, and Alan W Black. 2019. A survey of code-switched speech and language processing. arXiv preprint arXiv:1904.00784(2019).",
      "doi": ""
    },
    {
      "text": "Amy K Smith, Ruth N Bolton, and Janet Wagner. 1999. A model of customer satisfaction with service encounters involving failure and recovery. Journal of marketing research 36, 3 (1999), 356–372.",
      "doi": ""
    },
    {
      "text": "Brendan Spillane, Emer Gilmartin, Christian Saam, Ketong Su, Benjamin R Cowan, Séamus Lawless, and Vincent Wade. 2017. Introducing adele: A personalized intelligent companion. In Proceedings of the 1st ACM SIGCHI International Workshop on Investigating Social Interactions with Artificial Agents. 43–44.",
      "doi": "10.1145/3139491.3139492"
    },
    {
      "text": "Amazon Staff. Dec 17, 2020. How Alexa is bringing multilingual households closer together. https://www.aboutamazon.com/news/devices/how-alexa-is-bringing-multilingual-households-closer-together.",
      "doi": ""
    },
    {
      "text": "Miriam Sturdee, Aluna Everitt, Joseph Lindley, Paul Coulton, and Jason Alexander. 2019. Visual methods for the design of shape-changing interfaces. In IFIP Conference on Human-Computer Interaction. Springer, 337–358.",
      "doi": "10.1007/978-3-030-29387-1_19"
    },
    {
      "text": "Miriam Sturdee and Joseph Lindley. 2019. Sketching & drawing as future inquiry in HCI. In Proceedings of the Halfway to the Future Symposium 2019. 1–10.",
      "doi": "10.1145/3363384.3363402"
    },
    {
      "text": "Samson Tan and Shafiq Joty. 2021. Code-mixing on sesame street: Dawn of the adversarial polyglots. arXiv preprint arXiv:2103.09593(2021).",
      "doi": ""
    },
    {
      "text": "Mary WJ Tay. 1989. Code switching and code mixing as a communicative strategy in multilingual discourse. World Englishes 8, 3 (1989), 407–417.",
      "doi": ""
    },
    {
      "text": "Lennox Thomas, Julia MacMillan, Emilly McColl, C Hale, and S Bond. 1995. Comparison of focus group and individual interview methodology in examining patient satisfaction with nursing care. Social Sciences in Health 1, 4 (1995), 206–220.",
      "doi": ""
    },
    {
      "text": "Maryam Tohidi, William Buxton, Ronald Baecker, and Abigail Sellen. 2006. User sketches: a quick, inexpensive, and effective way to elicit more reflective user feedback. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles. 105–114.",
      "doi": "10.1145/1182475.1182487"
    },
    {
      "text": "Giasemi N Vavoula and Mike Sharples. 2007. Future technology workshop: A collaborative method for the design of new learning technologies and activities. International Journal of Computer-Supported Collaborative Learning 2, 4(2007), 393–419.",
      "doi": ""
    },
    {
      "text": "Adam Waytz, Joy Heafner, and Nicholas Epley. 2014. The mind in the machine: Anthropomorphism increases trust in an autonomous vehicle. Journal of experimental social psychology 52 (2014), 113–117.",
      "doi": ""
    },
    {
      "text": "Philip Weber and Thomas Ludwig. 2020. (Non-) Interacting with conversational agents: perceptions and motivations of using chatbots and voice assistants. In Proceedings of the Conference on Mensch und Computer. 321–331.",
      "doi": "10.1145/3404983.3405513"
    },
    {
      "text": "Li Wei. 2005. Starting from the right place: introduction to the special issue on Conversational Code-Switching. Journal of Pragmatics 37, 3 (2005), 275–279.",
      "doi": ""
    },
    {
      "text": "Jacqueline M Kory Westlund, Hae Won Park, Randi Williams, and Cynthia Breazeal. 2018. Measuring young children’s long-term relationships with social robots. In Proceedings of the 17th ACM conference on interaction design and children. 207–218.",
      "doi": "10.1145/3202185.3202732"
    },
    {
      "text": "Genta Indra Winata, Samuel Cahyawijaya, Zhaojiang Lin, Zihan Liu, Peng Xu, and Pascale Fung. 2020. Meta-transfer learning for code-switched speech recognition. arXiv preprint arXiv:2004.14228(2020).",
      "doi": ""
    },
    {
      "text": "Genta Indra Winata, Samuel Cahyawijaya, Zihan Liu, Zhaojiang Lin, Andrea Madotto, Peng Xu, and Pascale Fung. 2020. Learning fast adaptation on cross-accented speech recognition. arXiv preprint arXiv:2003.01901(2020).",
      "doi": ""
    },
    {
      "text": "Jordan Wirfs-Brock, Sarah Mennicken, and Jennifer Thom. 2020. Giving voice to silent data: Designing with personal music listening history. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3313831.3376493"
    },
    {
      "text": "Yunhan Wu, Martin Porcheron, Philip Doyle, Justin Edwards, Daniel Rough, Orla Cooney, Anna Bleakley, Leigh Clark, and Benjamin Cowan. 2022. Comparing Command Construction in Native and Non-Native Speaker IPA Interaction through Conversation Analysis. In Proceedings of the 4th Conference on Conversational User Interfaces. 1–12.",
      "doi": "10.1145/3543829.3543839"
    },
    {
      "text": "Linda Wulf, Markus Garschall, Julia Himmelsbach, and Manfred Tscheligi. 2014. Hands free-care free: elderly people taking advantage of speech-only interaction. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational. 203–206.",
      "doi": "10.1145/2639189.2639251"
    },
    {
      "text": "Xi Yang and Marco Aurisicchio. 2021. Designing conversational agents: A self-determination theory approach. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445445"
    },
    {
      "text": "Google Yaniv Leviathan. May 8, 2018. Google Duplex: An AI System for Accomplishing Real-World Tasks Over the Phone. https://ai.googleblog.com/2018/05/duplex-ai-system-for-natural-conversation.html.",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh, Stryker Thompson, Kathleen Watson, Alice Chase, Ashwin Senthilkumar, Ye Yuan, and AJ Bernheim Brush. 2018. Children asking questions: speech interface reformulations and personification preferences. In Proceedings of the 17th ACM conference on interaction design and children. 300–312.",
      "doi": "10.1145/3202185.3202207"
    },
    {
      "text": "Saizheng Zhang, Emily Dinan, Jack Urbanek, Arthur Szlam, Douwe Kiela, and Jason Weston. 2018. Personalizing dialogue agents: I have a dog, do you have pets too?arXiv preprint arXiv:1801.07243(2018).",
      "doi": ""
    }
  ]
}