{
  "doi": "10.1145/3544548.3580868",
  "title": "Governor: Turning Open Government Data Portals into Interactive Databases",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "The launch of open governmental data portals (OGDPs) has popularized the open data movement of last decade. Although the amount of data in OGDPs is increasing, their functionalities are limited to finding datasets with titles/descriptions and downloading the actual files. This hinders the end users, especially those without technical skills, to find the open data tables and make use of them. We present Governor, an open-sourced[17] web application developed to make OGDPs more accessible to end users by facilitating searching actual records in the tables, previewing them directly without downloading, and suggesting joinable and unionable tables to users based on their latest working tables. Governor also manages the provenance of integrated tables allowing users and their collaborators to easily trace back to the original tables in OGDP. We evaluate Governor with a two-part user study and the results demonstrate its value and effectiveness in finding and integrating tables in OGDP.",
  "tags": [
    "database",
    "user interface",
    "open data",
    "data integration"
  ],
  "authors": [
    {
      "name": "Chang Liu",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779009",
      "orcid": "0000-0002-3105-9174"
    },
    {
      "name": "Arif Usta",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658615442",
      "orcid": "0000-0001-6713-6621"
    },
    {
      "name": "Jian Zhao",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/do/10.1145/contrib-99659468860/rel-imgonly/jian_zhao.jpg",
      "acmid": "99659468860",
      "orcid": "0000-0001-5008-4319"
    },
    {
      "name": "Semih Salihoglu",
      "institution": "School of Computer Science, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490654486",
      "orcid": "0000-0002-8112-4501"
    }
  ],
  "references": [
    {
      "text": "2022. Apache Arrow https://arrow.apache.org/.",
      "doi": ""
    },
    {
      "text": "2022. Apache Parquet https://parquet.apache.org/.",
      "doi": ""
    },
    {
      "text": "2022. CKAN https://ckan.org/.",
      "doi": ""
    },
    {
      "text": "2022. Data.gov https://data.gov/.",
      "doi": ""
    },
    {
      "text": "2022. Data.gov.sg https://data.gov.sg/.",
      "doi": ""
    },
    {
      "text": "2022. data.gov.uk https://data.gov/.",
      "doi": ""
    },
    {
      "text": "2022. Elasticsearch https://www.elastic.co/.",
      "doi": ""
    },
    {
      "text": "2022. Magda https://magda.io//.",
      "doi": ""
    },
    {
      "text": "2022. MongoDB https://mongodb.com/.",
      "doi": ""
    },
    {
      "text": "2022. Open Data Principles https://open.canada.ca/en/open-data-principles.",
      "doi": ""
    },
    {
      "text": "2022. Socrata https://socrata.com/.",
      "doi": ""
    },
    {
      "text": "2022. SQLite compiled to JavaScript https://github.com/sql-js/sql.js/.",
      "doi": ""
    },
    {
      "text": "2022. Tableau https://www.tableau.com/.",
      "doi": ""
    },
    {
      "text": "2022. tidb-wasm https://github.com/tidb-incubator/tidb-wasm.",
      "doi": ""
    },
    {
      "text": "2022. Vue.js https://vuejs.org/.",
      "doi": ""
    },
    {
      "text": "2022. WebAssembly https://webassembly.org/.",
      "doi": ""
    },
    {
      "text": "2023. Governor Web Application Source Code. https://github.com/mewim/GovernorApp.",
      "doi": ""
    },
    {
      "text": "Omar Benjelloun, Shiyu Chen, and Natasha Noy. 2020. Google dataset search by the numbers. In International Semantic Web Conference. Springer, 667–682.",
      "doi": "10.1007/978-3-030-62466-8_41"
    },
    {
      "text": "Alex Bogatu, Alvaro A. A. Fernandes, Norman W. Paton, and Nikolaos Konstantinou. 2020. Dataset Discovery in Data Lakes. In Proceedings of the 2020 IEEE 36th International Conference on Data Engineering (ICDE). IEEE. https://doi.org/10.1109/icde48307.2020.00067",
      "doi": ""
    },
    {
      "text": "Alex Bogatu, Norman W. Paton, Mark Douthwaite, and Andre Freitas. 2022. Voyager: Data Discovery and Integration for Data Science. Journal of Data and Information Quality (jul 2022). https://doi.org/10.48786/edbt.2022.47",
      "doi": ""
    },
    {
      "text": "Dan Brickley, Matthew Burgess, and Natasha Noy. 2019. Google Dataset Search: Building a Search Engine for Datasets in an Open Web Ecosystem. In The World Wide Web Conference. https://doi.org/10.1145/3308558.3313685",
      "doi": "10.1145/3308558.3313685"
    },
    {
      "text": "Steven P. Callahan, Juliana Freire, Emanuele Santos, Carlos E. Scheidegger, Cláudio T. Silva, and Huy T. Vo. 2006. VisTrails: Visualization Meets Data Management. In Proceedings of the 2006 ACM SIGMOD international conference on Management of data - SIGMOD '06. https://doi.org/10.1145/1142473.1142574",
      "doi": "10.1145/1142473.1142574"
    },
    {
      "text": "Sonia Castelo, Rémi Rampin, Aécio Santos, Aline Bessa, Fernando Chirigati, and Juliana Freire. 2021. Auctus: A Dataset Search Engine for Data Discovery and Augmentation. Proceedings of the VLDB Endowment 14, 12 (jul 2021), 2791–2794. https://doi.org/10.14778/3476311.3476346",
      "doi": "10.14778/3476311.3476346"
    },
    {
      "text": "Raul Castro Fernandez, Jisoo Min, Demitri Nava, and Samuel Madden. 2019. Lazo: A Cardinality-Based Method for Coupled Estimation of Jaccard Similarity and Containment. In Proceedings of the 2019 IEEE 35th International Conference on Data Engineering (ICDE). IEEE. https://doi.org/10.1109/icde.2019.00109",
      "doi": ""
    },
    {
      "text": "Adriane Chapman, Elena Simperl, Laura Koesten, George Konstantinidis, Luis-Daniel Ibáñez, Emilia Kacprzak, and Paul Groth. 2020. Dataset search: a survey. The VLDB Journal 29, 1 (2020), 251–272.",
      "doi": "10.1007/s00778-019-00564-x"
    },
    {
      "text": "Ran Chen, Di Weng, Yanwei Huang, Xinhuan Shu, Jiayi Zhou, Guodao Sun, and Yingcai Wu. 2022. Rigel: Transforming Tabular Data by Declarative Mapping. IEEE Transactions on Visualization and Computer Graphics (2022), 1–11. https://doi.org/10.1109/TVCG.2022.3209385",
      "doi": ""
    },
    {
      "text": "Michael Correll. 2019. Ethical Dimensions of Visualization Research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3290605.3300418",
      "doi": "10.1145/3290605.3300418"
    },
    {
      "text": "Ian Drosos, Titus Barik, Philip J. Guo, Robert DeLine, and Sumit Gulwani. 2020. Wrex: A Unified Programming-by-Example Interaction for Synthesizing Readable Code for Data Scientists. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3313831.3376442",
      "doi": "10.1145/3313831.3376442"
    },
    {
      "text": "Alon Y. Halevy. 2001. Answering queries using views: A survey. The VLDB Journal 10, 4 (dec 2001), 270–294. https://doi.org/10.1007/s007780100054",
      "doi": "10.1007/s007780100054"
    },
    {
      "text": "Jeffrey Heer, Jock Mackinlay, Chris Stolte, and Maneesh Agrawala. 2008. Graphical Histories for Visualization: Supporting Analysis, Communication, and Evaluation. IEEE Transactions on Visualization and Computer Graphics (2008), 1189–1196.",
      "doi": ""
    },
    {
      "text": "Ahmed Helal, Mossad Helali, Khaled Ammar, and Essam Mansour. 2021. A Demonstration of KGLac: A Data Discovery and Enrichment Platform for Data Science. Proceedings of the VLDB Endowment 14, 12 (jul 2021), 2675–2678. https://doi.org/10.14778/3476311.3476317",
      "doi": "10.14778/3476311.3476317"
    },
    {
      "text": "Jeff Johnson, Matthijs Douze, and Hervé Jégou. 2019. Billion-scale similarity search with GPUs. IEEE Transactions on Big Data 7, 3 (2019), 535–547.",
      "doi": ""
    },
    {
      "text": "Sean Kandel, Jeffrey Heer, Catherine Plaisant, Jessie Kennedy, Frank van Ham, Nathalie Henry Riche, Chris Weaver, Bongshin Lee, Dominique Brodbeck, and Paolo Buono. 2011. Research Directions in Data Wrangling: Visuatizations and Transformations for Usable and Credible Data. Information Visualization 10, 4 (oct 2011), 271–288.",
      "doi": "10.1177/1473871611415994"
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer. 2011. Wrangler: Interactive visual specification of data transformation scripts. In Proceedings of the sigchi conference on human factors in computing systems. 3363–3372.",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "Laura M. Koesten, Emilia Kacprzak, Jenifer F. A. Tennison, and Elena Simperl. 2017. The Trials and Tribulations of Working with Structured Data: -A Study on Information Seeking Behaviour. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). 1277–1289. https://doi.org/10.1145/3025453.3025838",
      "doi": "10.1145/3025453.3025838"
    },
    {
      "text": "André Kohn, Dominik Moritz, Mark Raasveldt, Hannes Mühleisen, and Thomas Neumann. 2022. DuckDB-Wasm: Fast Analytical Processing for the Web. Proceedings of the VLDB Endowment 15, 12 (aug 2022), 3574–3577. https://doi.org/10.14778/3554821.3554847",
      "doi": "10.14778/3554821.3554847"
    },
    {
      "text": "Christos Koutras, George Siachamis, Andra Ionescu, Kyriakos Psarakis, Jerry Brons, Marios Fragkoulis, Christoph Lofi, Angela Bonifati, and Asterios Katsifodimos. 2021. Valentine: Evaluating Matching Techniques for Dataset Discovery. In Proceedings of the 2021 IEEE 37th International Conference on Data Engineering (ICDE). IEEE. https://doi.org/10.1109/icde51399.2021.00047",
      "doi": ""
    },
    {
      "text": "Fatemeh Nargesian, Erkang Zhu, Ken Q. Pu, and Renée J. Miller. 2018. Table Union Search on Open Data. Proceedings of the VLDB Endowment 11, 7 (mar 2018), 813–825. https://doi.org/10.14778/3192965.3192973",
      "doi": "10.14778/3192965.3192973"
    },
    {
      "text": "Sebastian Neumaier, Jürgen Umbrich, and Axel Polleres. 2016. Automated Quality Assessment of Metadata across Open Data Portals. J. Data and Information Quality 8, 1, Article 2 (oct 2016), 29 pages. https://doi.org/10.1145/2964909",
      "doi": "10.1145/2964909"
    },
    {
      "text": "Ouellette, Paul and Sciortino, Aidan and Nargesian, Fatemeh and Bashardoost, Bahar Ghadiri and Zhu, Erkang and Pu, Ken Q. and Miller, Renée J.2021. RONIN: Data Lake Exploration. Proceedings of the VLDB Endowment 14, 12 (jul 2021), 2863–2866. https://doi.org/10.14778/3476311.3476364",
      "doi": "10.14778/3476311.3476364"
    },
    {
      "text": "Eric D. Ragan, Alex Endert, Jibonananda Sanyal, and Jian Chen. 2016. Characterizing Provenance in Visualization and Data Analysis: An Organizational Framework of Provenance Types and Purposes. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan. 2016), 31–40. https://doi.org/10.1109/TVCG.2015.2467551",
      "doi": "10.1109/TVCG.2015.2467551"
    },
    {
      "text": "El Kindi Rezig, Anshul Bhandari, Anna Fariha, Benjamin Price, Allan Vanterpool, Vijay Gadepally, and Michael Stonebraker. 2021. DICE: Data Discovery by Example. Proceedings of the VLDB Endowment 14, 12 (jul 2021), 2819–2822. https://doi.org/10.14778/3476311.3476353",
      "doi": "10.14778/3476311.3476353"
    },
    {
      "text": "Nischal Shrestha, Titus Barik, and Chris Parnin. 2021. Unravel: A Fluent Code Explorer for Data Wrangling. In The 34th Annual ACM Symposium on User Interface Software and Technology. https://doi.org/10.1145/3472749.3474744",
      "doi": "10.1145/3472749.3474744"
    },
    {
      "text": "Avi Silberschatz, Henry F. Korth, and S. Sudarshan. 2020. Chapter 7: Relational Database Design. In Database System Concepts, Seventh Edition. McGraw-Hill Book Company, 303–360.",
      "doi": ""
    },
    {
      "text": "Monica Swamiraj and Luanne Freund. 2015. Facilitating the discovery of open government datasets through an exploratory data search interface.",
      "doi": ""
    },
    {
      "text": "Marcin Wylot, Manfred Hauswirth, Philippe Cudré-Mauroux, and Sherif Sakr. 2018. RDF Data Storage and Query Processing Schemes: A Survey. Comput. Surveys 51, 4, Article 84 (jul 2018), 36 pages. https://doi.org/10.1145/3177850",
      "doi": "10.1145/3177850"
    },
    {
      "text": "Siyuan Xia, Nafisa Anzum, Semih Salihoglu, and Jian Zhao. 2021. KTabulator: Interactive Ad hoc Table Creation using Knowledge Graphs. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 100:1–14. https://doi.org/10.1145/3411764.3445227",
      "doi": "10.1145/3411764.3445227"
    },
    {
      "text": "Kai Xiong, Siwei Fu, Guoming Ding, Zhongsu Luo, Rong Yu, Wei Chen, Hujun Bao, and Yingcai Wu. 2022. Visualizing the Scripts of Data Wrangling with SOMNUS. IEEE Transactions on Visualization and Computer Graphics (2022).",
      "doi": ""
    },
    {
      "text": "Kai Xu, Alvitta Ottley, Conny Walchshofer, Marc Streit, Remco Chang, and John Wenskovitch. 2020. Survey on the Analysis of User Interactions and Visualization Provenance. Computer Graphics Forum 39, 3 (2020), 757–783. https://doi.org/10.1111/cgf.14035",
      "doi": ""
    },
    {
      "text": "Zhang, Yi and Ives, Zachary G.2020. Finding Related Tables in Data Lakes for Interactive Data Science. In Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data. https://doi.org/10.1145/3318464.3389726",
      "doi": "10.1145/3318464.3389726"
    },
    {
      "text": "Erkang Zhu, Dong Deng, Fatemeh Nargesian, and Renée J. Miller. 2019. JOSIE: Overlap Set Similarity Search for Finding Joinable Tables in Data Lakes. In Proceedings of the 2019 International Conference on Management of Data. https://doi.org/10.1145/3299869.3300065",
      "doi": "10.1145/3299869.3300065"
    },
    {
      "text": "Erkang Zhu, Yeye He, and Surajit Chaudhuri. 2017. Auto-Join: Joining Tables by Leveraging Transformations. Proceedings of the VLDB Endowment 10, 10 (jun 2017), 1034–1045. https://doi.org/10.14778/3115404.3115409",
      "doi": "10.14778/3115404.3115409"
    },
    {
      "text": "Erkang Zhu, Fatemeh Nargesian, Ken Q. Pu, and Renée J. Miller. 2016. LSH Ensemble: Internet-Scale Domain Search. Proceedings of the VLDB Endowment 9, 12 (aug 2016), 1185–1196. https://doi.org/10.14778/2994509.2994534",
      "doi": "10.14778/2994509.2994534"
    },
    {
      "text": "Erkang Zhu, Ken Q. Pu, Fatemeh Nargesian, and Renée J. Miller. 2017. Interactive Navigation of Open Data Linkages. Proceedings of the VLDB Endowment 10, 12 (aug 2017), 1837–1840. https://doi.org/10.14778/3137765.3137788",
      "doi": "10.14778/3137765.3137788"
    }
  ]
}