{
  "doi": "10.1145/3544548.3580773",
  "title": "Less is Not More: Improving Findability and Actionability of Privacy Controls for Online Behavioral Advertising",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-33",
  "year": 2023,
  "badges": [],
  "abstract": "Tech companies that rely on ads for business argue that users have control over their data via ad privacy settings. However, these ad settings are often hidden. This work aims to inform the design of findable ad controls and study their impact on users’ behavior and sentiment. We iteratively designed ad control interfaces that varied in the setting’s (1) entry point (within ads, at the feed’s top) and (2) level of actionability, with high actionability directly surfacing links to specific advertisement settings, and low actionability pointing to general settings pages (which is reminiscent of companies’ current approach to ad controls). We built a Chrome extension that augments Facebook with our experimental ad control interfaces and conducted a between-subjects online experiment with 110 participants. Results showed that entry points within ads or at the feed’s top, and high actionability interfaces, both increased Facebook ad settings’ findability and discoverability, as well as participants’ perceived usability of them. High actionability also reduced users’ effort in finding ad settings. Participants perceived high and low actionability as equally usable, which shows it is possible to design more actionable ad controls without overwhelming users. We conclude by emphasizing the importance of regulation to provide specific and research-informed requirements to companies on how to design usable ad controls.",
  "tags": [
    "consent.",
    "social platforms",
    "usability",
    "user interface",
    "advertising",
    "social media",
    "ad settings",
    "Privacy"
  ],
  "authors": [
    {
      "name": "Jane Im",
      "institution": "School of Information & Division of Computer Science and Engineering, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320250",
      "orcid": "0000-0002-9614-6535"
    },
    {
      "name": "Ruiyi Wang",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782062",
      "orcid": "0000-0002-6195-2510"
    },
    {
      "name": "Weikun Lyu",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783714",
      "orcid": "0000-0002-7021-0375"
    },
    {
      "name": "Nick Cook",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780018",
      "orcid": "0000-0002-0422-2677"
    },
    {
      "name": "Hana Habib",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019881",
      "orcid": "0000-0003-3743-7858"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Nikola Banovic",
      "institution": "Electrical Engineering and Computer Science, University of Michigan, United States",
      "img": "/do/10.1145/contrib-81490690455/rel-imgonly/nikola_banovic_portrait_2018_small.jpg",
      "acmid": "81490690455",
      "orcid": "0000-0002-2790-3264"
    },
    {
      "name": "Florian Schaub",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548024188",
      "orcid": "0000-0003-1039-7155"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, 2017. Nudges for privacy and security: Understanding and assisting users’ choices online. ACM Computing Surveys (CSUR) 50, 3 (2017), 1–41.",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Muhammad Ali, Angelica Goetzen, Piotr Sapiezynski, Elissa Redmiles, and Alan Mislove. 2022. All Things Unequal: Measuring Disparity of Potentially Harmful Ads on Facebook. In Proceedings of the Workshop on Technology and Consumer Protection (ConPro’22). San Francisco, CA, USA.",
      "doi": ""
    },
    {
      "text": "Digital Advertising Alliance. 2022. YourAdChoices. https://optout.aboutads.info.",
      "doi": ""
    },
    {
      "text": "Athanasios Andreou, Giridhari Venkatadri, Oana Goga, Krishna Gummadi, Patrick Loiseau, and Alan Mislove. 2018. Investigating ad transparency mechanisms in social media: A case study of Facebook’s explanations. In NDSS 2018-Network and Distributed System Security Symposium. 1–15.",
      "doi": ""
    },
    {
      "text": "Joshua Asplund, Motahhare Eslami, Hari Sundaram, Christian Sandvig, and Karrie Karahalios. 2020. Auditing race and gender discrimination in online housing markets. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. 24–35.",
      "doi": ""
    },
    {
      "text": "Brooke Auxier, Lee Rainie, Monica Anderson, Andrew Perrin, Madhu Kumar, and Erica Turner. 2019. Americans and privacy: Concerned, confused and feeling lack of control over their personal information. (2019).",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. 2012. Triggering Triggers and Burying Barriers to Customizing Software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2717–2726. https://doi.org/10.1145/2207676.2208666",
      "doi": "10.1145/2207676.2208666"
    },
    {
      "text": "Natã M Barbosa, Gang Wang, Blase Ur, and Yang Wang. 2021. Who Am I? A Design Probe Exploring Real-Time Transparency about Online and Offline User Profiling Underlying Targeted Ads. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 3 (2021), 1–32.",
      "doi": "10.1145/3478122"
    },
    {
      "text": "Md Momen Bhuiyan, Michael Horning, Sang Won Lee, and Tanushree Mitra. 2021. NudgeCred: Supporting News Credibility Assessment on Social Media Through Nudges. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 427 (oct 2021), 30 pages. https://doi.org/10.1145/3479571",
      "doi": "10.1145/3479571"
    },
    {
      "text": "John Brooke. 1995. SUS: A quick and dirty usability scale. Usability Eval. Ind. 189 (11 1995).",
      "doi": ""
    },
    {
      "text": "Shea Brown, Jovana Davidovic, and Ali Hasan. 2021. The algorithm audit: Scoring the algorithms that score us. Big Data & Society 8, 1 (2021), 2053951720983865.",
      "doi": ""
    },
    {
      "text": "Fred H Cate. 2006. The failure of fair information practice principles. Consumer protection in the age of the information economy (2006).",
      "doi": ""
    },
    {
      "text": "Facebook Help Center. 2022. How Ads Work on Facebook. https://www.facebook.com/help/516147308587266/?helpref=hc_fnav.",
      "doi": ""
    },
    {
      "text": "Patrali Chatterjee. 2008. Are Unclicked Ads Wasted? Enduring Effects of Banner and Pop-Up Ad Exposures on Brand Memory and Attitudes.Journal of electronic commerce Research 9, 1 (2008).",
      "doi": ""
    },
    {
      "text": "Jessica Colnago, Lorrie Faith Cranor, Alessandro Acquisti, and Kate Hazel Jain. 2022. Is it a concern or a preference? An investigation into the ability of privacy scales to capture and distinguish granular privacy constructs. In Eighteenth Symposium on Usable Privacy and Security (SOUPS 2022). 331–346.",
      "doi": ""
    },
    {
      "text": "Kovila PL Coopamootoo, Maryam Mehrnezhad, and Ehsan Toreini. 2022. \" I feel invaded, annoyed, anxious and I may protect myself\": Individuals’ Feelings about Online Tracking and their Protective Behaviour across Gender and Country. arXiv preprint arXiv:2202.04682(2022).",
      "doi": ""
    },
    {
      "text": "Claire Dolin, Ben Weinshel, Shawn Shan, Chang Min Hahn, Euirim Choi, Michelle L Mazurek, and Blase Ur. 2018. Unpacking perceptions of data-driven inferences underlying online targeting and personalization. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3174067"
    },
    {
      "text": "Lisa A Elkin, Matthew Kay, James J Higgins, and Jacob O Wobbrock. 2021. An aligned rank transform procedure for multifactor contrast tests. In The 34th Annual ACM Symposium on User Interface Software and Technology. 754–768.",
      "doi": "10.1145/3472749.3474784"
    },
    {
      "text": "Nel Escher and Nikola Banovic. 2020. Exposing Error in Poverty Management Technology: A Method for Auditing Government Benefits Screening Tools. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–20.",
      "doi": "10.1145/3392874"
    },
    {
      "text": "Motahhare Eslami, Sneha R Krishna Kumaran, Christian Sandvig, and Karrie Karahalios. 2018. Communicating algorithmic process in online behavioral advertising. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174006"
    },
    {
      "text": "Florian M Farke, David G Balash, Maximilian Golla, Markus Dürmuth, and Adam J Aviv. 2021. Are Privacy Dashboards Good for End Users? Evaluating User Perceptions and Reactions to Google’s My Activity. In 30th USENIX Security Symposium (USENIX Security 21). 483–500.",
      "doi": ""
    },
    {
      "text": "Lisa Farman, Maria Leonora Comello, and Jeffrey R Edwards. 2020. Are consumers put off by retargeted ads on social media? Evidence for perceptions of marketing surveillance and decreased ad effectiveness. Journal of Broadcasting & Electronic Media 64, 2 (2020), 298–319.",
      "doi": ""
    },
    {
      "text": "Yuanyuan Feng, Yaxing Yao, and Norman Sadeh. 2021. A design space for privacy choices: Towards meaningful privacy control in the internet of things. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445148"
    },
    {
      "text": "Sheera Frenkel and Cecilia Kang. 2021. An ugly truth: Inside Facebook’s battle for domination. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Colin M Gray, Cristiana Santos, Nataliia Bielova, Michael Toth, and Damian Clifford. 2021. Dark patterns and the legal requirements of consent banners: An interaction criticism perspective. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3411764.3445779"
    },
    {
      "text": "Gabriel Grill. 2021. Future protest made risky: Examining social media based civil unrest prediction research and products. Computer Supported Cooperative Work (CSCW) 30, 5 (2021), 811–839.",
      "doi": "10.1007/s10606-021-09409-0"
    },
    {
      "text": "Dorota Głowacka and Karolina Iwańska. 2021. Algorithms of trauma: new case study shows that Facebook doesn’t give users real control over disturbing surveillance ads. Retrieved December 9, 2022 from https://en.panoptykon.org/algorithms-of-trauma",
      "doi": ""
    },
    {
      "text": "Hana Habib and Lorrie Faith Cranor. 2022. Evaluating the usability of privacy choice mechanisms. In Eighteenth Symposium on Usable Privacy and Security (SOUPS 2022). 273–289.",
      "doi": ""
    },
    {
      "text": "Hana Habib, Sarah Pearman, Ellie Young, Ishika Saxena, Robert Zhang, and Lorrie FaIth Cranor. 2022. Identifying User Needs for Advertising Controls on Facebook. Proc. ACM Hum.-Comput. Interact. 6, CSCW1, Article 59 (apr 2022), 42 pages. https://doi.org/10.1145/3512906",
      "doi": "10.1145/3512906"
    },
    {
      "text": "Hana Habib, Yixin Zou, Aditi Jannu, Neha Sridhar, Chelse Swoopes, Alessandro Acquisti, Lorrie Faith Cranor, Norman Sadeh, and Florian Schaub. 2019. An Empirical Analysis of Data Deletion and {Opt-Out} Choices on 150 Websites. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019). 387–406.",
      "doi": ""
    },
    {
      "text": "Hana Habib, Yixin Zou, Yaxing Yao, Alessandro Acquisti, Lorrie Cranor, Joel Reidenberg, Norman Sadeh, and Florian Schaub. 2021. Toggles, dollar signs, and triangles: How to (in) effectively convey privacy choices with icons and link texts. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–25.",
      "doi": "10.1145/3411764.3445387"
    },
    {
      "text": "Brittan Heller and Avi Bar-Zeev. 2021. The problems with immersive advertising: in AR/VR, nobody knows you are an ad. Journal of Online Trust and Safety 1, 1 (2021).",
      "doi": ""
    },
    {
      "text": "Anne Helmond, David B Nieborg, and Fernando N van der Vlist. 2017. The political economy of social data: a historical analysis of platform-industry partnerships. In Proceedings of the 8th international conference on social media & society. 1–5.",
      "doi": "10.1145/3097286.3097324"
    },
    {
      "text": "Henning Hohnhold, Deirdre O’Brien, and Diane Tang. 2015. Focusing on the long-term: It’s good for users and business. In Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. 1849–1858.",
      "doi": "10.1145/2783258.2788583"
    },
    {
      "text": "Silas Hsu, Kristen Vaccaro, Yin Yue, Aimee Rickman, and Karrie Karahalios. 2020. Awareness, navigation, and use of feed control settings online. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376583"
    },
    {
      "text": "Jane Im, Jill Dimond, Melody Berton, Una Lee, Katherine Mustelier, Mark S. Ackerman, and Eric Gilbert. 2021. Yes: Affirmative Consent as a Theoretical Framework for Understanding and Imagining Social Platforms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 403, 18 pages. https://doi.org/10.1145/3411764.3445778",
      "doi": "10.1145/3411764.3445778"
    },
    {
      "text": "Jane Im, Sonali Tandon, Eshwar Chandrasekharan, Taylor Denby, and Eric Gilbert. 2020. Synthesized Social Signals: Computationally-Derived Social Signals from Account Histories. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376383",
      "doi": "10.1145/3313831.3376383"
    },
    {
      "text": "Network Advertising Initiative. 2022. NAI Consumer Opt Out. https://optout.networkadvertising.org/.",
      "doi": ""
    },
    {
      "text": "Yucheng Jin, Karsten Seipp, Erik Duval, and Katrien Verbert. 2016. Go with the flow: effects of transparency and user control on targeted advertising using flow charts. In Proceedings of the international working conference on advanced visual interfaces. 68–75.",
      "doi": "10.1145/2909132.2909269"
    },
    {
      "text": "Michael Kretschmer, Jan Pennekamp, and Klaus Wehrle. 2021. Cookie banners and privacy policies: Measuring the impact of the GDPR on the web. ACM Transactions on the Web (TWEB) 15, 4 (2021), 1–42.",
      "doi": "10.1145/3466722"
    },
    {
      "text": "Yabing Liu, Krishna P. Gummadi, Balachander Krishnamurthy, and Alan Mislove. 2011. Analyzing Facebook Privacy Settings: User Expectations vs. Reality. In Proceedings of the 2011 ACM SIGCOMM Conference on Internet Measurement Conference (Berlin, Germany) (IMC ’11). Association for Computing Machinery, New York, NY, USA, 61–70. https://doi.org/10.1145/2068816.2068823",
      "doi": "10.1145/2068816.2068823"
    },
    {
      "text": "Natasha Lomas. 2021. UK privacy watchdog warns adtech the end of tracking is nigh. https://techcrunch.com/2021/11/25/ico-adtech-reform-opinion/",
      "doi": ""
    },
    {
      "text": "Natasha Lomas. 2022. Give users genuine control over ad targeting, MEPs urged. https://techcrunch.com/2022/01/13/joint-statement-surveillance-ads-inferred-data/",
      "doi": ""
    },
    {
      "text": "Mary Madden, Michele Gilman, Karen Levy, and Alice Marwick. 2017. Privacy, poverty, and big data: A matrix of vulnerabilities for poor Americans. Wash. UL Rev. 95(2017), 53.",
      "doi": ""
    },
    {
      "text": "Miguel Malheiros, Charlene Jennett, Snehalee Patel, Sacha Brostoff, and Martina Angela Sasse. 2012. Too Close for Comfort: A Study of the Effectiveness and Acceptability of Rich-Media Personalized Advertising. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 579–588. https://doi.org/10.1145/2207676.2207758",
      "doi": "10.1145/2207676.2207758"
    },
    {
      "text": "Aleecia McDonald and Lorrie Faith Cranor. 2010. Beliefs and behaviors: Internet users’ understanding of behavioral advertising. Tprc.",
      "doi": ""
    },
    {
      "text": "Aleecia M McDonald and Lorrie Faith Cranor. 2008. The cost of reading privacy policies. Isjlp 4(2008), 543.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1995. How to conduct a heuristic evaluation. Nielsen Norman Group 1, 1 (1995), 8.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2011. A contextual approach to privacy online. Daedalus 140, 4 (2011), 32–48.",
      "doi": ""
    },
    {
      "text": "Midas Nouwens, Ilaria Liccardi, Michael Veale, David Karger, and Lalana Kagal. 2020. Dark patterns after the GDPR: Scraping consent pop-ups and demonstrating their influence. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376321"
    },
    {
      "text": "Jonathan A Obar and Anne Oeldorf-Hirsch. 2020. The biggest lie on the internet: Ignoring the privacy policies and terms of service policies of social networking services. Information, Communication & Society 23, 1 (2020), 128–147.",
      "doi": ""
    },
    {
      "text": "Eugenia Politou, Efthimios Alepis, and Constantinos Patsakis. 2018. Forgetting personal data and revoking consent under the GDPR: Challenges and proposed solutions. Journal of Cybersecurity 4, 1 (2018), tyy001.",
      "doi": ""
    },
    {
      "text": "Emilee Rader. 2014. Awareness of behavioral tracking and information privacy concern in facebook and google. In 10th Symposium On Usable Privacy and Security (SOUPS 2014). 51–67.",
      "doi": ""
    },
    {
      "text": "Joel R Reidenberg, Travis Breaux, Lorrie Faith Cranor, Brian French, Amanda Grannis, James T Graves, Fei Liu, Aleecia McDonald, Thomas B Norton, and Rohan Ramanath. 2015. Disagreeable privacy policies: Mismatches between meaning and users’ understanding. Berkeley Tech. LJ 30(2015), 39.",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, and Lorrie Faith Cranor. 2017. Designing effective privacy notices and controls. IEEE Internet Computing 21, 3 (2017), 70–77.",
      "doi": "10.1109/MIC.2017.75"
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, Adam L Durity, and Lorrie Faith Cranor. 2015. A design space for effective privacy notices. In Eleventh symposium on usable privacy and security (SOUPS 2015). 1–17.",
      "doi": "10.5555/3235866.3235868"
    },
    {
      "text": "Florian Schaub and Lorrie Cranor. 2020. Usable and Useful Privacy Interfaces. IAPP.",
      "doi": ""
    },
    {
      "text": "Paul M Schwartz. 1999. Internet privacy and the state. Conn. L. Rev. 32(1999), 815.",
      "doi": ""
    },
    {
      "text": "Daniel J Solove. 2012. Introduction: Privacy self-management and the consent dilemma. Harv. L. Rev. 126(2012), 1880.",
      "doi": ""
    },
    {
      "text": "Michael Carl Tschantz, Serge Egelman, Jaeyoung Choi, Nicholas Weaver, and Gerald Friedland. 2018. The accuracy of the demographic inferences shown on Google’s Ad Settings. In Proceedings of the 2018 Workshop on Privacy in the Electronic Society. 33–41.",
      "doi": "10.1145/3267323.3268962"
    },
    {
      "text": "Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, useful, scary, creepy: perceptions of online behavioral advertising. In proceedings of the eighth symposium on usable privacy and security. 1–15.",
      "doi": "10.1145/2335356.2335362"
    },
    {
      "text": "Fernando N Van der Vlist and Anne Helmond. 2021. How partners mediate platform power: Mapping business and data partnerships in the social media ecosystem. Big Data & Society 8, 1 (2021), 20539517211025061.",
      "doi": ""
    },
    {
      "text": "José Van Dijck, David Nieborg, and Thomas Poell. 2019. Reframing platform power. Internet Policy Review 8, 2 (2019), 1–18.",
      "doi": ""
    },
    {
      "text": "Ari Ezra Waldman. 2021. Industry unbound: The inside story of privacy, data, and corporate Power. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Miranda Wei, Madison Stamos, Sophie Veys, Nathan Reitinger, Justin Goodman, Margot Herman, Dorota Filipczuk, Ben Weinshel, Michelle L Mazurek, and Blase Ur. 2020. What Twitter knows: Characterizing ad targeting practices, user perceptions, and ad explanations through users’ own Twitter data. In 29th USENIX Security Symposium (USENIX Security 20). 145–162.",
      "doi": ""
    },
    {
      "text": "Ben Weinshel, Miranda Wei, Mainack Mondal, Euirim Choi, Shawn Shan, Claire Dolin, Michelle L Mazurek, and Blase Ur. 2019. Oh, the places you’ve been! User reactions to longitudinal transparency about third-party web tracking and inferencing. In Proceedings of the 2019 ACM SIGSAC Conference on Computer and Communications Security. 149–166.",
      "doi": "10.1145/3319535.3363200"
    },
    {
      "text": "James Wilson and Daniel Rosenberg. 1988. Rapid prototyping for user interface design. Elsevier, 859–875.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle, and James J Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI conference on human factors in computing systems. 143–146.",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Yaxing Yao, Davide Lo Re, and Yang Wang. 2017. Folk models of online behavioral advertising. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 1957–1969.",
      "doi": "10.1145/2998181.2998316"
    },
    {
      "text": "Mark Zuckerberg. 2019. The Facts About Facebook. https://www.wsj.com/articles/the-facts-about-facebook-11548374613",
      "doi": ""
    }
  ]
}