{
  "doi": "10.1145/3544548.3580657",
  "title": "Infrastructural Work Behind The Scene: A Study of Formalized Peer-support Practices for Mental Health",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Peer-support has long been recognized as valuable for mental health, and has been commonly practiced online over the Internet. However, it is often reported that peer exchange online can have harmful effects, and there has been limited research on how to ensure its effectiveness and safety. Our ethnographic study of formalized mental health peer-support practices in Scotland uncovers the infrastructural work involved when setting up and managing conditions upon which peer-support can take place in an effective and safe way. We illustrate that peer-support for mental health is not only about bringing peers together to interact with each other, but also about ensuring availability, timeliness, proactive care, positivity and safety of peer-support as a service, by weaving various social, spatial and technical elements together and managing groups and their boundaries. Our findings illuminate the work behind these peer-support practices, and suggest design implications.",
  "tags": [
    "infrastructural work",
    "mental health",
    "Peer-support"
  ],
  "authors": [
    {
      "name": "Xianghua(Sharon) Ding",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81539424156/rel-imgonly/81539424156.png",
      "acmid": "81539424156",
      "orcid": "0000-0001-8122-6252"
    },
    {
      "name": "Linda Tran",
      "institution": "University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782743",
      "orcid": "0000-0003-3850-7168"
    },
    {
      "name": "Yanling Liu",
      "institution": "University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660784079",
      "orcid": "0000-0002-1417-5931"
    },
    {
      "name": "Conor O'Neill",
      "institution": "University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780582",
      "orcid": "0000-0001-7182-6537"
    },
    {
      "name": "Stephen Lindsay",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384616016",
      "orcid": "0000-0001-6063-3676"
    }
  ],
  "references": [
    {
      "text": "William A Anthony. 1993. Recovery from mental illness: the guiding vision of the mental health service system in the 1990s.Psychosocial rehabilitation journal 16, 4 (1993), 11.",
      "doi": ""
    },
    {
      "text": "Sairam Balani and Munmun De Choudhury. 2015. Detecting and characterizing mental health related self-disclosure in social media. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 1373–1378.",
      "doi": "10.1145/2702613.2732733"
    },
    {
      "text": "Simon Bradstreet. 2006. Harnessing the’lived experience’: formalising peer support approaches to promote recovery. The Mental Health Review 11, 2 (2006), 33.",
      "doi": ""
    },
    {
      "text": "Simon Bradstreet and Rona McBrierty. 2012. Recovery in Scotland: beyond service development., 64–69 pages.",
      "doi": ""
    },
    {
      "text": "Eliška Černá and Alice Gojová. 2022. Peer Support Workers as Equal Team Members. A Case Study of Peer Support in Glasgow Housing First. The British Journal of Social Work(2022).",
      "doi": ""
    },
    {
      "text": "Tianying Chen, Kristy Zhang, Robert E Kraut, and Laura Dabbish. 2021. Scaffolding the Online Peer-support Experience: Novice Supporters’ Strategies and Challenges. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–30.",
      "doi": "10.1145/3479510"
    },
    {
      "text": "Matthew J Chinman, Robert Rosenheck, Julie A Lam, and Larry Davidson. 2000. Comparing consumer and nonconsumer provided case management services for homeless persons with serious mental illness. The Journal of nervous and mental disease 188, 7 (2000), 446–453.",
      "doi": ""
    },
    {
      "text": "LOUISE Christie. 2016. Peer support roles in mental health services. Iriss: Insight 31(2016).",
      "doi": ""
    },
    {
      "text": "Catherine J Crompton, Sonny Hallett, Harriet Axbey, Christine McAuliffe, and Katie Cebula. 2022. ‘Someone like-minded in a big place’: Autistic young adults’ attitudes towards autistic peer support in mainstream education. Autism (2022), 13623613221081189.",
      "doi": ""
    },
    {
      "text": "Mafalda da Silva Bento, Felipe Natan Alves Barbosa Carvalho, Inês Beatriz Antunes, and Giselle Carpi Olmo. 2022. Digital Peer Support for People With Severe Mental Illness: Key Concepts and Findings Overview. In Digital Therapies in Psychosocial Rehabilitation and Mental Health. IGI Global, 72–92.",
      "doi": ""
    },
    {
      "text": "Larry Davidson, Kimberly Guy, 2012. Peer support among persons with severe mental illnesses: a review of evidence and experience. World psychiatry 11, 2 (2012), 123–128.",
      "doi": ""
    },
    {
      "text": "Kathryn P Davison, James W Pennebaker, and Sally S Dickerson. 2000. Who talks? The social psychology of illness support groups.American Psychologist 55, 2 (2000), 205.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental health discourse on reddit: Self-disclosure, social support, and anonymity. In Eighth international AAAI conference on weblogs and social media.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering shifts to suicidal ideation from mental health content in social media. In Proceedings of the 2016 CHI conference on human factors in computing systems. 2098–2110.",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Gavin Doherty, David Coyle, and John Sharry. 2012. Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1421–1430.",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "Robert E Drake, Kim T Mueser, Mary F Brunette, and Gregory J McHugo. 2004. A review of treatments for people with severe mental illnesses and co-occurring substance use disorders.Psychiatric rehabilitation journal 27, 4 (2004), 360.",
      "doi": ""
    },
    {
      "text": "Katherine Easton, Jacob Diggle, Mabel Ruethi-Davis, Megan Holmes, Darian Byron-Parker, Jessica Nuttall, Chris Blackmore, 2017. Qualitative exploration of the potential for adverse events when using an online peer support network for mental health: cross-sectional survey. JMIR mental health 4, 4 (2017), e8168.",
      "doi": ""
    },
    {
      "text": "Ricky Ellis, Tim Goodacre, Neil Mortensen, Rachel S Oeppen, and Peter A Brennan. 2022. The application of Human Factors at Hybrid meetings: facilitating productivity and inclusivity. British Journal of Oral and Maxillofacial Surgery (2022).",
      "doi": ""
    },
    {
      "text": "Health Education England. 2017. Stepping forward to 2020/21: The mental health workforce plan for England.",
      "doi": ""
    },
    {
      "text": "Alison Faulkner and Jayasree Kalathil. 2012. The freedom to be, the chance to dream: preserving user-led peer support. London: Together for Mental Wellbeing(2012).",
      "doi": ""
    },
    {
      "text": "Vasudha Gidugu, E Sally Rogers, Steven Harrington, Mihoko Maru, Gene Johnson, Julie Cohee, and Jennifer Hinkel. 2015. Individual peer support: A qualitative study of mechanisms of its effectiveness. Community mental health journal 51, 4 (2015), 445–452.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1955. On face-work: An analysis of ritual elements in social interaction. Psychiatry 18, 3 (1955), 213–231.",
      "doi": ""
    },
    {
      "text": "Jacki Gordon and Simon Bradstreet. 2015. So if we like the idea of peer workers, why aren’t we seeing more?World Journal of Psychiatry 5, 2 (2015), 160–166.",
      "doi": ""
    },
    {
      "text": "Robert A Gould and George A Clum. 1993. A meta-analysis of self-help treatment approaches. Clinical psychology review 13, 2 (1993), 169–186.",
      "doi": ""
    },
    {
      "text": "Kathleen Margaret Griffiths, Alison L Calear, and Michelle Banfield. 2009. Systematic review on Internet Support Groups (ISGs) and depression (1): Do ISGs reduce depressive symptoms?Journal of medical Internet research 11, 3 (2009), e1270.",
      "doi": ""
    },
    {
      "text": "Andrea Hartzler and Wanda Pratt. 2011. Managing the Personal Side of Health: How Patient Expertise Differs from the Expertise of Clinicians. J Med Internet Res 13, 3 (16 Aug 2011), e62. https://doi.org/10.2196/jmir.1728",
      "doi": ""
    },
    {
      "text": "Benjamin T. Kaveladze, George I. Kaveladze, Elad Yom-Tov, and Stephen M. Schueller. 2022. Building a Tool that Draws from the Collective Wisdom of the Internet to Help Users Respond Effectively to Anxiety-Related Questions. In Pervasive Computing Technologies for Healthcare, Hadas Lewy and Refael Barkan (Eds.). Springer International Publishing, Cham, 15–27.",
      "doi": ""
    },
    {
      "text": "Alan E Kazdin and Stacey L Blase. 2011. Rebooting psychotherapy research and practice to reduce the burden of mental illness. Perspectives on psychological science 6, 1 (2011), 21–37.",
      "doi": ""
    },
    {
      "text": "Malene Lue Kessing. 2022. Doing peer work in mental health services: Unpacking different enactments of lived experiences. Health Sociology Review 31, 1 (2022), 32–46.",
      "doi": ""
    },
    {
      "text": "Alicia Jean King and Magenta Bender Simmons. 2022. “The Best of Both Worlds”: Experiences of young people attending groups co-facilitated by peer workers and clinicians in a youth mental health service. Early Intervention in Psychiatry(2022).",
      "doi": ""
    },
    {
      "text": "Rachel Kornfield, Renwen Zhang, Jennifer Nicholas, Stephen M Schueller, Scott A Cambo, David C Mohr, and Madhu Reddy. 2020. \" Energy is a Finite Resource\": Designing Technology to Support Individuals across Fluctuating Symptoms of Depression. In Proceedings of the 2020 CHI Conference on Human factors in Computing systems. 1–17.",
      "doi": "10.1145/3313831.3376309"
    },
    {
      "text": "Kaylee Payne Kruzan, Natalya N. Bazarova, and Janis Whitlock. 2021. Investigating Self-Injury Support Solicitations and Responses on a Mobile Peer Support Application. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 354 (oct 2021), 23 pages. https://doi.org/10.1145/3479498",
      "doi": "10.1145/3479498"
    },
    {
      "text": "Daniel Lambton-Howard, Emma Simpson, Kim Quimby, Ahmed Kharrufa, Heidi Hoi Ming Ng, Emma Foster, and Patrick Olivier. 2021. Blending into everyday life: designing a social media-based peer support system. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445079"
    },
    {
      "text": "Aideen Lawlor and Jurek Kirakowski. 2014. Online support groups for mental health: a space for challenging self-stigma or a means of social avoidance?Computers in Human Behavior 32 (2014), 152–161.",
      "doi": ""
    },
    {
      "text": "Reeva Lederman, Greg Wadley, John Gleeson, Sarah Bendall, and Mario Álvarez-Jiménez. 2014. Moderated online social therapy: Designing and evaluating technology for mental health. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 1(2014), 1–26.",
      "doi": "10.1145/2513179"
    },
    {
      "text": "Hua Li, Alana Glecia, Arlene Kent-Wilkinson, Donald Leidl, Manal Kleib, and Tracie Risling. 2021. Transition of mental health service delivery to telepsychiatry in response to COVID-19: a literature review. Psychiatric Quarterly(2021), 1–17.",
      "doi": ""
    },
    {
      "text": "Douglas W Maynard and Steven E Clayman. 1991. The diversity of ethnomethodology. Annual review of sociology(1991), 385–418.",
      "doi": ""
    },
    {
      "text": "Shery Mead, David Hilton, and Laurie Curtis. 2001. Peer support: a theoretical perspective.Psychiatric rehabilitation journal 25, 2 (2001), 134.",
      "doi": ""
    },
    {
      "text": "Carol T Mowbray, DP Moxley, S Thrasher, D Bybee, and S Harris. 1996. Consumers as community support providers: Issues created by role innovation. Community mental health journal 32, 1 (1996), 47–67.",
      "doi": ""
    },
    {
      "text": "John A Naslund, Kelly A Aschbrenner, Lisa A Marsch, and Stephen J Bartels. 2016. The future of mental health care: peer-to-peer support and social media. Epidemiology and psychiatric sciences 25, 2 (2016), 113–122.",
      "doi": ""
    },
    {
      "text": "John A Naslund, Stuart W Grande, Kelly A Aschbrenner, and Glyn Elwyn. 2014. Naturally occurring peer support through social media: the experiences of individuals with severe mental illness using YouTube. PLOS one 9, 10 (2014), e110171.",
      "doi": ""
    },
    {
      "text": "Mark W Newman, Debra Lauterbach, Sean A Munson, Paul Resnick, and Margaret E Morris. 2011. It’s not that I don’t have problems, I’m just not putting them on Facebook: challenges and opportunities in using online social networks for health. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. 341–350.",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Jennifer Nicholas, Imogen H Bell, Andrew Thompson, Lee Valentine, Pinar Simsir, Holly Sheppard, and Sophie Adams. 2021. Implementation lessons from the transition to telehealth during COVID-19: a survey of clinicians and young people from youth mental health services. Psychiatry Research 299(2021), 113848.",
      "doi": ""
    },
    {
      "text": "Kathleen O’Leary, Arpita Bhattacharya, Sean A Munson, Jacob O Wobbrock, and Wanda Pratt. 2017. Design opportunities for mental health peer support technologies. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 1470–1484.",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Kathleen O’Leary, Stephen M Schueller, Jacob O Wobbrock, and Wanda Pratt. 2018. “Suddenly, we got to become therapists for each other” Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "World Health Organization. 2022. World mental health report: transforming mental health for all. https://www.who.int/publications/i/item/9789240049338.",
      "doi": ""
    },
    {
      "text": "Anna Pagano, Sindhu Hosakote, Kwinoja Kapiteni, Elana R Straus, Jessie Wong, and Joseph R Guydish. 2021. Impacts of COVID-19 on residential treatment programs for substance use disorder. Journal of Substance Abuse Treatment 123 (2021), 108255.",
      "doi": ""
    },
    {
      "text": "Sun Young Park. 2018. Social support mosaic: Understanding mental health management practice on college campus. In Proceedings of the 2018 Designing Interactive Systems Conference. 121–133.",
      "doi": "10.1145/3196709.3196787"
    },
    {
      "text": "Claire E Peck, Michelle H Lim, Melanie Purkiss, Fiona Foley, Liza Hopkins, and Neil Thomas. 2020. Development of a lived experience-based digital resource for a digitally-assisted peer support program for young people experiencing psychosis. Frontiers in Psychiatry 11 (2020), 635.",
      "doi": ""
    },
    {
      "text": "Sachin R Pendse, Faisal M Lalani, Munmun De Choudhury, Amit Sharma, and Neha Kumar. 2020. \" Like Shock Absorbers\": understanding the human infrastructures of technology-mediated mental health support. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376465"
    },
    {
      "text": "Zhenhui Peng, Qingyu Guo, Ka Wing Tsang, and Xiaojuan Ma. 2020. Exploring the effects of technological writing assistance for support providers in online mental health community. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376695"
    },
    {
      "text": "Brian Perron. 2002. Online support for caregivers of people with a mental illness.Psychiatric Rehabilitation Journal 26, 1 (2002), 70.",
      "doi": ""
    },
    {
      "text": "Julian Rappaport. 1993. Narrative studies, personal stories, and identity transformation in the mutual help context. The journal of applied behavioral science 29, 2 (1993), 239–256.",
      "doi": ""
    },
    {
      "text": "Julie Repper and Tim Carter. 2011. A review of the literature on peer support in mental health services. Journal of mental health 20, 4 (2011), 392–411.",
      "doi": ""
    },
    {
      "text": "Zlatka Russinova, E Sally Rogers, Karon F Cook, Marsha Langer Ellison, and Asya Lyass. 2013. Conceptualization and measurement of mental health providers’ recovery-promoting competence: The Recovery Promoting Relationships Scale (RPRS).Psychiatric Rehabilitation Journal 36, 1 (2013), 7.",
      "doi": ""
    },
    {
      "text": "Banu Saatçi, Roman Rädle, Sean Rintel, Kenton O’Hara, and Clemens Nylandsted Klokmose. 2019. Hybrid meetings in the modern workplace: stories of success and failure. In International Conference on Collaboration and Technology. Springer, 45–61.",
      "doi": ""
    },
    {
      "text": "Kjeld Schmidt. 2011. The concept of‘work’in CSCW. Computer Supported Cooperative Work (CSCW) 20, 4 (2011), 341–401.",
      "doi": "10.1007/s10606-011-9146-y"
    },
    {
      "text": "Scotland and Dawn Griesbach. 2010. Evaluation of the Scottish Recovery Network. Scottish Government Social Research Edinburgh.",
      "doi": ""
    },
    {
      "text": "Dave Sells, Ryan Black, Larry Davidson, and Michael Rowe. 2008. Beyond generic support: incidence and impact of invalidation in peer services for clients with severe mental illness. Psychiatric Services 59, 11 (2008), 1322–1327.",
      "doi": ""
    },
    {
      "text": "William H Sledge, Martha Lawless, David Sells, Melissa Wieland, Maria J O’Connell, and Larry Davidson. 2011. Effectiveness of peer support in reducing readmissions of persons with multiple psychiatric hospitalizations. Psychiatric services 62, 5 (2011), 541–544.",
      "doi": ""
    },
    {
      "text": "Phyllis Solomon. 2004. Peer support/peer provided services underlying processes, benefits, and critical ingredients.Psychiatric rehabilitation journal 27, 4 (2004), 392.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star. 1999. The ethnography of infrastructure. American behavioral scientist 43, 3 (1999), 377–391.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Karen Ruhleder. 1994. Steps towards an ecology of infrastructure: complex problems in design and access for large-scale collaborative systems. In Proceedings of the 1994 ACM conference on Computer supported cooperative work. 253–264.",
      "doi": "10.1145/192844.193021"
    },
    {
      "text": "Anselm Strauss. 1985. Work and the division of labor. Sociological quarterly 26, 1 (1985), 1–19.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1996. Supporting articulation work.",
      "doi": ""
    },
    {
      "text": "James Opie Urmson. 1970. Polymorphous concepts. In Ryle. Springer, 249–266.",
      "doi": ""
    },
    {
      "text": "Mike Watts and Agnes Higgins. 2016. Narratives of recovery from mental illness: The role of peer support. Routledge.",
      "doi": ""
    },
    {
      "text": "Caroline Zangani, Edoardo G Ostinelli, Katharine A Smith, James SW Hong, Orla Macdonald, Gurpreet Reen, Katherine Reid, Charles Vincent, Rebecca Syed Sheriff, Paul J Harrison, 2022. Impact of the COVID-19 pandemic on the global delivery of mental health services and telemental health: systematic review. JMIR mental health 9, 8 (2022), e38600.",
      "doi": ""
    }
  ]
}