{
  "doi": "10.1145/3544548.3581380",
  "title": "Collaborative Creativity in TikTok Music Duets",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "On the social media platform TikTok, users are able to engage with each other’s content by using the Duet feature, which allows them to re-share another user’s video while also layering on additional content to the original video. Through this, the affordances of the Duet feature facilitate a distributed and collaborative creative process, in which we can observe the evolution of cultural artifacts through the different versions that are produced from user contributions. As a result, the open-ended nature of these collaborations positions engagement as both a creative and social act. In this paper, we identify the ways in which the Duet feature supports decentralized co-creativity and engagement between users. We find that the cumulative nature of an artifact’s creative evolution, along with the ability for multiple iterations of an artifact to develop in parallel, facilitates development of diverse creative artifacts.",
  "authors": [
    {
      "name": "Katherine O'Toole",
      "institution": "Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782173",
      "orcid": "0000-0001-6653-1486"
    }
  ],
  "references": [
    {
      "text": "Piotr D. Adamczyk, Kevin Hamilton, Michael B. Twidale, and Brian P. Bailey. 2007. Tools in support of creative collaboration. In Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition(C&C ’07). Association for Computing Machinery, New York, NY, USA, 273–274. https://doi.org/10.1145/1254960.1255010",
      "doi": "10.1145/1254960.1255010"
    },
    {
      "text": "Ali Algarni. 2019. Exploring Neuroscience of Creativity Theories in designing Co-creative Agents. In Proceedings of the 2019 on Creativity and Cognition(C&C ’19). Association for Computing Machinery, New York, NY, USA, 686–690. https://doi.org/10.1145/3325480.3326559",
      "doi": "10.1145/3325480.3326559"
    },
    {
      "text": "Jeff Alstott, Ed Bullmore, and Dietmar Plenz. 2014. powerlaw: A Python Package for Analysis of Heavy-Tailed Distributions. PLOS ONE 9, 1 (Jan. 2014), e85777. https://doi.org/10.1371/journal.pone.0085777 Publisher: Public Library of Science.",
      "doi": ""
    },
    {
      "text": "Teresa M. Amabile and Julianna Pillemer. 2012. Perspectives on the Social Psychology of Creativity. The Journal of Creative Behavior 46, 1 (2012), 3–15. https://doi.org/10.1002/jocb.001 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/jocb.001.",
      "doi": ""
    },
    {
      "text": "Andre Antunes. 2022. If System of a Down were from India. https://www.youtube.com/watch?v=mi106DZJhuQ",
      "doi": ""
    },
    {
      "text": "Berkeley Andrus and Nancy Fulda. 2022. A Data-Driven Architecture for Social Behavior in Creator Networks. In Proceedings of the 13th International Conference on Computational Creativity (ICCC). pages 339–348.",
      "doi": ""
    },
    {
      "text": "Noah Askin and Michael Mauskapf. 2014. Cultural Attributes and their Influence on Consumption Patterns in Popular Music. In (eds) Social Informatics. SocInfo 2014, Luca Maria Aiello and Daniel McFarland (Eds.). Lecture Notes in Computer Science, Vol. 8851. Springer International Publishing, Cham, 508–530. https://doi.org/10.1007/978-3-319-13734-6$_$36",
      "doi": ""
    },
    {
      "text": "Albert-László Barabási. 2005. The origin of bursts and heavy tails in human dynamics. Nature 435, 7039 (May 2005), 207–211. https://doi.org/10.1038/nature03459 arXiv:cond-mat/0505371.",
      "doi": ""
    },
    {
      "text": "Álvaro Barbosa. 2003. Displaced Soundscapes: A Survey of Network Systems for Music and Sonic Art Creation. Leonardo Music Journal 13 (Dec. 2003), 53–59. https://doi.org/10.1162/096112104322750791",
      "doi": ""
    },
    {
      "text": "Raiyan Abdul Baten, Daryl Bagley, Ashely Tenesaca, Famous Clark, James P Bagrow, Gourab Ghoshal, and Ehsan Hoque. 2020. Creativity in temporal social networks: how divergent thinking is impacted by one’s choice of peers. J. R. Soc. Interface 17, 171 (Oct. 2020), 11. https://doi.org/10.1098/rsif.2020.0667",
      "doi": ""
    },
    {
      "text": "Yochai Benkler. 2006. The wealth of networks: how social production transforms markets and freedom. Yale University Press, New Haven [Conn.]. OCLC: ocm61881089.",
      "doi": ""
    },
    {
      "text": "Thierry Bertin-Mahieux. 2013. Large-Scale Pattern Discovery in Music. Ph. D. Dissertation. Columbia University. https://doi.org/10.7916/D8NC67CT",
      "doi": ""
    },
    {
      "text": "Tina Blaine and Sidney Fels. 2017. 2003: Contexts of Collaborative Musical Experiences. In A NIME Reader, Alexander Refsum Jensenius and Michael J. Lyons (Eds.). Vol. 3. Springer International Publishing, Cham, 71–87. https://doi.org/10.1007/978-3-319-47214-0_6 Series Title: Current Research in Systematic Musicology.",
      "doi": ""
    },
    {
      "text": "Norbert Blenn and Piet Van Mieghem. 2016. Are human interactivity times lognormal?arXiv:1607.02952 [physics] (July 2016). https://doi.org/10.48550/arXiv.1607.02952 arXiv:1607.02952.",
      "doi": ""
    },
    {
      "text": "Margaret A. Boden. 2004. The Creative Mind: Myths and Mechanisms. Routledge.",
      "doi": "10.5555/940309"
    },
    {
      "text": "Maximilian Boeker and Aleksandra Urman. 2022. An Empirical Investigation of Personalization Factors on TikTok. In Proceedings of the ACM Web Conference 2022(WWW ’22). Association for Computing Machinery, New York, NY, USA, 2298–2309. https://doi.org/10.1145/3485447.3512102",
      "doi": "10.1145/3485447.3512102"
    },
    {
      "text": "Sylvie Le Bomin, Guillaume Lecointre, and Evelyne Heyer. 2016. The Evolution of Musical Diversity: The Key Role of Vertical Transmission. PLOS ONE 11, 3 (March 2016), e0151570. https://doi.org/10.1371/journal.pone.0151570 Publisher: Public Library of Science.",
      "doi": ""
    },
    {
      "text": "Jean-François Boujut and Eric Blanco. 2003. Intermediary Objects as a Means to Foster Co-operation in Engineering Design. Computer Supported Cooperative Work (CSCW) 12, 2 (June 2003), 205–219. https://doi.org/10.1023/A:1023980212097",
      "doi": "10.1023/A%3A1023980212097"
    },
    {
      "text": "Albert S. Bregman. 1994. Auditory Scene Analysis: The Perceptual Organization of Sound. MIT Press. Google-Books-ID: jI8muSpAC5AC.",
      "doi": ""
    },
    {
      "text": "Melanie S. Brucks and Jonathan Levav. 2022. Virtual communication curbs creative idea generation. Nature (April 2022), 1–5. https://doi.org/10.1038/s41586-022-04643-y Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Nick Bryan-Kinns. 2013. Mutual engagement and collocation with shared representations. International Journal of Human-Computer Studies 71, 1 (Jan. 2013), 76–90. https://doi.org/10.1016/j.ijhcs.2012.02.004",
      "doi": "10.1016/j.ijhcs.2012.02.004"
    },
    {
      "text": "Ronald S Burt. 2021. SOCIAL NETWORK AND CREATIVITY. In Handbook of Research on Creativity and Innovation. Edward Elgar Publishing, pp82–104. https://www.e-elgar.com/shop/usd/handbook-of-research-on-creativity-and-innovation-9781788977265.html",
      "doi": ""
    },
    {
      "text": "Ana Caraban, Evangelos Karapanos, Daniel Gonçalves, and Pedro Campos. 2019. 23 Ways to Nudge: A Review of Technology-Mediated Nudging in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300733",
      "doi": "10.1145/3290605.3300733"
    },
    {
      "text": "Keunwoo Choi, George Fazekas, and Mark Sandler. 2016. Automatic tagging using deep convolutional neural networks. https://doi.org/10.48550/arXiv.1606.00298 arXiv:1606.00298 [cs].",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Colleen Stuart, Jason Tsay, and Jim Herbsleb. 2012. Social coding in GitHub: transparency and collaboration in an open software repository. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work(CSCW ’12). Association for Computing Machinery, New York, NY, USA, 1277–1286. https://doi.org/10.1145/2145204.2145396",
      "doi": "10.1145/2145204.2145396"
    },
    {
      "text": "Marija Mitrović Dankulov, Roderick Melnik, and Bosiljka Tadić. 2015. The dynamics of meaningful social interactions and the emergence of collective knowledge. Scientific Reports 5, 1 (July 2015), 12197. https://doi.org/10.1038/srep12197 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Nicholas Davis, Ellen Yi-Luen Do, Pramod Gupta, and Shruti Gupta. 2011. Computing harmony with PerLogicArt: perceptual logic inspired collaborative art. In Proceedings of the 8th ACM conference on Creativity and cognition(C&C ’11). Association for Computing Machinery, New York, NY, USA, 185–194. https://doi.org/10.1145/2069618.2069650",
      "doi": "10.1145/2069618.2069650"
    },
    {
      "text": "N. Davis, C. Hsiao, K. Y. Singh, B. Lin, and B. Magerko. 2017. Quantifying Collaboration with a Co-Creative Drawing Agent. ACM Transactions on Interactive Intelligent Systems 7, 4 (Dec. 2017), 19:1–19:25. https://doi.org/10.1145/3009981",
      "doi": "10.1145/3009981"
    },
    {
      "text": "Nicholas Davis, Chih-Pin Hsiao, Kunwar Yashraj Singh, Brenda Lin, and Brian Magerko. 2017. Creative Sense-Making: Quantifying Interaction Dynamics in Co-Creation. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition(C&C ’17). Association for Computing Machinery, New York, NY, USA, 356–366. https://doi.org/10.1145/3059454.3059478",
      "doi": "10.1145/3059454.3059478"
    },
    {
      "text": "Brandon Doyle. 2022. TikTok Statistics - Everything You Need to Know [Aug 2022 Update]. https://wallaroomedia.com/blog/social-media/tiktok-statistics/",
      "doi": ""
    },
    {
      "text": "Shufei Duan, Jinglan Zhang, Paul Roe, and Michael Towsey. 2014. A survey of tagging techniques for music, speech and environmental sound. Artificial Intelligence Review 42, 4 (Dec. 2014), 637–661. https://doi.org/10.1007/s10462-012-9362-y",
      "doi": "10.1007/s10462-012-9362-y"
    },
    {
      "text": "Anders Friberg, Erwin Schoonderwaldt, Anton Hedblad, Marco Fabiani, and Anders Elowsson. 2014. Using perceptually defined music features in music information retrieval. arXiv:1403.7923 [cs] (March 2014). https://doi.org/10.48550/arXiv.1403.7923",
      "doi": ""
    },
    {
      "text": "Liane Gabora and Maryam Saberi. 2011. An agent-based model of the cognitive mechanisms underlying the origins of creative cultural evolution. In Proceedings of the 8th ACM conference on Creativity and cognition(C&C ’11). Association for Computing Machinery, New York, NY, USA, 299–306. https://doi.org/10.1145/2069618.2069667",
      "doi": "10.1145/2069618.2069667"
    },
    {
      "text": "Andrea Gaggioli, Elvis Mazzoni, Martina Benvenuti, Carlo Galimberti, Antonio Bova, Eleonora Brivio, Pietro Cipresso, Giuseppe Riva, and Alice Chirico. 2020. Networked Flow in Creative Collaboration: A Mixed Method Study. Creativity Research Journal 32, 1 (Jan. 2020), 41–54. https://doi.org/10.1080/10400419.2020.1712160 Publisher: Routledge _eprint: https://doi.org/10.1080/10400419.2020.1712160.",
      "doi": ""
    },
    {
      "text": "Vlad Petre Glăveanu. 2014. Distributed Creativity: What Is It?In Distributed Creativity: Thinking Outside the Box of the Creative Individual, Vlad Petre Glăveanu (Ed.). Springer International Publishing, Cham, 1–13. https://doi.org/10.1007/978-3-319-05434-6_1",
      "doi": ""
    },
    {
      "text": "Dejan Grba. 2020. Alpha Version, Delta Signature: Cognitive Aspects of Artefactual Creativity. Journal of Science and Technology of the Arts 12, 3 (Dec. 2020), 63–83. https://doi.org/10.34632/jsta.2020.9491 Number: 3.",
      "doi": ""
    },
    {
      "text": "Igor Zakhlebin and Emoke-Agnes Horvat. 2020. Diffusion of Scientific Articles across Online Platforms. In Proceedings of the Fourteenth International AAAI Conference on Web and Social Media, Vol. 14. 762–773. https://doi.org/10.1609/icwsm.v14i1.7341",
      "doi": ""
    },
    {
      "text": "ImprovisedHarmony. 2022. r/ImprovisedHarmony. https://www.reddit.com/r/ImprovisedHarmony/",
      "doi": ""
    },
    {
      "text": "Nanna Inie and Peter Dalsgaard. 2020. How Interaction Designers Use Tools to Manage Ideas. ACM Transactions on Computer-Human Interaction 27, 2 (March 2020), 7:1–7:26. https://doi.org/10.1145/3365104",
      "doi": "10.1145/3365104"
    },
    {
      "text": "Myra Interiano, Kamyar Kazemi, Lijia Wang, Jienian Yang, Zhaoxia Yu, and Natalia L. Komarova. 2018. Musical trends and predictability of success in contemporary songs in and out of the top charts. Royal Society Open Science 5, 5 (May 2018), 171274. https://doi.org/10.1098/rsos.171274 Publisher: Royal Society.",
      "doi": ""
    },
    {
      "text": "Gerardo Iñiguez, János Török, Taha Yasseri, Kimmo Kaski, and János Kertész. 2014. Modeling social dynamics in a collaborative environment. EPJ Data Science 3, 1 (Dec. 2014), 1–20. https://doi.org/10.1140/epjds/s13688-014-0007-z Number: 1 Publisher: SpringerOpen.",
      "doi": ""
    },
    {
      "text": "Ray Jackendoff and Fred Lerdahl. 2006. The capacity for music: What is it, and what’s special about it?Cognition 100, 1 (May 2006), 33–72. https://doi.org/10.1016/j.cognition.2005.11.005",
      "doi": ""
    },
    {
      "text": "Sergi Jordà. 1999. Faust Music On Line: An Approach to Real-Time Collective Composition on the Internet. Leonardo Music Journal 9 (Dec. 1999), 5–12. https://doi.org/10.1162/096112199750316730",
      "doi": ""
    },
    {
      "text": "D. Bondy Valdovinos Kaye. 2022. Please Duet This: Collaborative Music Making in Lockdown on TikTok. Networking Knowledge: Journal of the MeCCSA Postgraduate Network 15, 1 (Feb. 2022). https://ojs.meccsa.org.uk/index.php/netknow/article/view/654 Number: 1.",
      "doi": ""
    },
    {
      "text": "Christopher Kelty and Seth Erickson. 2018. Two modes of participation: A conceptual analysis of 102 cases of Internet and social media participation from 2005–2015. The Information Society 34, 2 (March 2018), 71–87. https://doi.org/10.1080/01972243.2017.1414092 Publisher: Routledge _eprint: https://doi.org/10.1080/01972243.2017.1414092.",
      "doi": ""
    },
    {
      "text": "Ailbhe Kenny. 2014. ‘Collaborative creativity’ within a jazz ensemble as a musical and social practice. Thinking Skills and Creativity 13 (Sept. 2014), 1–8. https://doi.org/10.1016/j.tsc.2014.02.002",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The future of crowd work. In Proceedings of the 2013 conference on Computer supported cooperative work(CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1301–1318. https://doi.org/10.1145/2441776.2441923",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Daniel J. Levitin. 2006. This is Your Brain on Music : The Science of a Human Obsession. Dutton/Penguin Books.",
      "doi": ""
    },
    {
      "text": "Maruša Levstek, Rubie Mai Barnby, Katherine L. Pocock, and Robin Banerjee. 2021. “It All Makes Us Feel Together”: Young People’s Experiences of Virtual Group Music-Making During the COVID-19 Pandemic. Frontiers in Psychology 12 (2021). https://www.frontiersin.org/articles/10.3389/fpsyg.2021.703892",
      "doi": ""
    },
    {
      "text": "J C R Licklider and Robert W Taylor. 1986. The Computer as a Communication Device. Science and Technology 76 (1986), 21–31. http://memex.org/licklider.pdf",
      "doi": ""
    },
    {
      "text": "Chen Ling, Jeremy Blackburn, Emiliano De Cristofaro, and Gianluca Stringhini. 2022. Slapping Cats, Bopping Heads, and Oreo Shakes: Understanding Indicators of Virality in TikTok Short Videos. In 14th ACM Web Science Conference 2022(WebSci ’22). Association for Computing Machinery, New York, NY, USA, 164–173. https://doi.org/10.1145/3501247.3531551",
      "doi": "10.1145/3501247.3531551"
    },
    {
      "text": "S. Lippens, J.P. Martens, and T. De Mulder. 2004. A comparison of human and automatic musical genre classification. In 2004 IEEE International Conference on Acoustics, Speech, and Signal Processing. Montreal, QC, Canada, iv–iv. https://doi.org/10.1109/ICASSP.2004.1326806 ISSN: 1520-6149.",
      "doi": ""
    },
    {
      "text": "Philipp Lorenz-Spreen, Bjarke Mørch Mønsted, Philipp Hövel, and Sune Lehmann. 2019. Accelerating dynamics of collective attention. Nature Communications 10, 1 (April 2019), 1759. https://doi.org/10.1038/s41467-019-09311-w",
      "doi": ""
    },
    {
      "text": "Kurt Luther, Kelly Caine, Kevin Ziegler, and Amy Bruckman. 2010. Why it works (when it works): success factors in online creative collaboration. In Proceedings of the 16th ACM international conference on Supporting group work(GROUP ’10). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/1880071.1880073",
      "doi": "10.1145/1880071.1880073"
    },
    {
      "text": "Thomas W. Malone, Robert Laubacher, and Chrysanthos Dellarocas. 2009. Harnessing Crowds: Mapping the Genome of Collective Intelligence. SSRN Scholarly Paper ID 1381502. Social Science Research Network, Rochester, NY. https://doi.org/10.2139/ssrn.1381502",
      "doi": ""
    },
    {
      "text": "Matthias Mauch, Robert M. MacCallum, Mark Levy, and Armand M. Leroi. 2015. The evolution of popular music: USA 1960–2010. Royal Society Open Science 2, 5 (May 2015), 150081. https://doi.org/10.1098/rsos.150081 Publisher: Royal Society.",
      "doi": ""
    },
    {
      "text": "Michael Mauskapf, Eric Quintane, Noah Askin, and Joeri M. Mol. 2017. Embeddedness and the Production of Novelty in Music: A Multi-Dimensional Perspective. Academy of Management Proceedings 2017, 1 (Aug. 2017), 16678. https://doi.org/10.5465/AMBPP.2017.2",
      "doi": ""
    },
    {
      "text": "Thomas Barlow McHugh, Abir Saha, David Bar-El, Marcelo Worsley, and Anne Marie Piper. 2021. Towards Inclusive Streaming: Building Multimodal Music Experiences for the Deaf and Hard of Hearing. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems(CHI EA ’21). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3411763.3451690",
      "doi": "10.1145/3411763.3451690"
    },
    {
      "text": "Liang Men and Nick Bryan-Kinns. 2019. LeMo: Exploring Virtual Space for Collaborative Creativity. In Proceedings of the 2019 on Creativity and Cognition. ACM, San Diego CA USA, 71–82. https://doi.org/10.1145/3325480.3325495",
      "doi": "10.1145/3325480.3325495"
    },
    {
      "text": "Gary M. Olson and Judith S. Olson. 2000. Distance Matters. Human–Computer Interaction 15, 2-3 (Sept. 2000), 139–178. https://doi.org/10.1207/S15327051HCI1523_4 Publisher: Taylor & Francis _eprint: https://doi.org/10.1207/S15327051HCI1523_4.",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Judith S. Olson, Dakuo Wang, Gary M. Olson, and Jingwen Zhang. 2017. How People Write Together Now: Beginning the Investigation with Advanced Undergraduates in a Project Course. ACM Transactions on Computer-Human Interaction 24, 1 (March 2017), 4:1–4:40. https://doi.org/10.1145/3038919",
      "doi": "10.1145/3038919"
    },
    {
      "text": "Doheum Park, Juhan Nam, and Juyong Park. 2020. Novelty and influence of creative works, and quantifying patterns of advances based on probabilistic references networks. EPJ Data Science 9, 1 (Dec. 2020), 1–15. https://doi.org/10.1140/epjds/s13688-019-0214-8 Number: 1 Publisher: SpringerOpen.",
      "doi": ""
    },
    {
      "text": "Laura Lucia Parolin and Carmen Pellegrinelli. 2020. Where does it come from? Collaborative emergence in creative work practices. New Ideas in Psychology 59 (Dec. 2020), 100800. https://doi.org/10.1016/j.newideapsych.2020.100800",
      "doi": ""
    },
    {
      "text": "Jill E. Perry-Smith and Christina E. Shalley. 2003. The Social Side of Creativity: A Static and Dynamic Social Network Perspective. The Academy of Management Review 28, 1 (2003), 89–106. https://doi.org/10.2307/30040691 Publisher: Academy of Management.",
      "doi": ""
    },
    {
      "text": "David Pinelle and Carl Gutwin. 2005. A groupware design framework for loosely coupled workgroups. In Proceedings of the ninth conference on European Conference on Computer Supported Cooperative Work(ECSCW’05). Springer-Verlag, Berlin, Heidelberg, 65–82.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece and Ben Shneiderman. 2009. The Reader-to-Leader Framework: Motivating Technology-Mediated Social Participation. AIS Transactions on Human-Computer Interaction 1, 1 (March 2009), 13–32. https://doi.org/10.17705/1thci.00005",
      "doi": ""
    },
    {
      "text": "Matthew Prockup, Andreas F Ehmann, Fabien Gouyon, Erik M Schmidt, Oscar Celma, and Youngmoo E Kim. 2015. Modeling Genre with the Music Genome Project: Comparing Human-Labeled Attributes and Audio Features.. In Proceedings of the 16th ISMIR Conference. Malaga, Spain, 7.",
      "doi": ""
    },
    {
      "text": "Christoph Riedl and Anita Williams Woolley. 2017. Teams vs. Crowds: A Field Test of the Relative Contribution of Incentives, Member Ability, and Emergent Collaboration to Crowd-Based Problem Solving Performance. Academy of Management Discoveries 3, 4 (Dec. 2017), 382–403. https://doi.org/10.5465/amd.2015.0097",
      "doi": ""
    },
    {
      "text": "Mark A. Runco and Garrett J. Jaeger. 2012. The Standard Definition of Creativity. Creativity Research Journal 24, 1 (Jan. 2012), 92–96. https://doi.org/10.1080/10400419.2012.650092 Publisher: Routledge _eprint: https://doi.org/10.1080/10400419.2012.650092.",
      "doi": ""
    },
    {
      "text": "Babak Saleh, Kanako Abe, Ravneet Singh Arora, and Ahmed Elgammal. 2016. Toward automated discovery of artistic influence. Multimedia Tools and Applications 75, 7 (April 2016), 3565–3591. https://doi.org/10.1007/s11042-014-2193-x",
      "doi": "10.1007/s11042-014-2193-x"
    },
    {
      "text": "R. Sawyer and Stacy Lee Dezutter. 2009. Distributed creativity: How collective creations emerge from collaboration.undefined (2009). /paper/Distributed-creativity%3A-How-collective-creations-Sawyer-Dezutter/bd5e034dfae4054552bce7f0c43b60514370a750",
      "doi": ""
    },
    {
      "text": "Jimmy Secretan, Nicholas Beato, David B. D Ambrosio, Adelein Rodriguez, Adam Campbell, and Kenneth O. Stanley. 2008. Picbreeder: evolving pictures collaboratively online. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). Association for Computing Machinery, New York, NY, USA, 1759–1768. https://doi.org/10.1145/1357054.1357328",
      "doi": "10.1145/1357054.1357328"
    },
    {
      "text": "Joan Serrà, Alvaro Corral, Marián Boguñá, Martín Haro, and Josep Ll Arcos. 2012. Measuring the Evolution of Contemporary Western Popular Music. Scientific Reports 2, 1 (July 2012), 521. https://doi.org/10.1038/srep00521 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Pao Siangliulue, Kenneth C. Arnold, Krzysztof Z. Gajos, and Steven P. Dow. 2015. Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). Association for Computing Machinery, New York, NY, USA, 937–945. https://doi.org/10.1145/2675133.2675239",
      "doi": "10.1145/2675133.2675239"
    },
    {
      "text": "Spotify. 2022. Soundtrap - Make music online. https://www.soundtrap.com/",
      "doi": ""
    },
    {
      "text": "Shweta Suran, Vishwajeet Pattanaik, and Dirk Draheim. 2020. Frameworks for Collective Intelligence: A Systematic Literature Review. Comput. Surveys 53, 1 (Feb. 2020), 14:1–14:36. https://doi.org/10.1145/3368986",
      "doi": "10.1145/3368986"
    },
    {
      "text": "Ana Tamayo. 2022. Sign Languages, Translation, and Interpreting: Creative Practices in Audiovisual Content. Sign Language Studies 22, 3 (2022), 484–519. https://doi.org/10.1353/sls.2022.0003 Publisher: Gallaudet University Press.",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative coupling over tabletop displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Montréal Québec Canada, 1181–1190. https://doi.org/10.1145/1124772.1124950",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "The BandLab Team. 2015. Forks – An exciting way to inspire and be inspired - From the Team. https://blog.bandlab.com/forks-an-exciting-way-to-inspire-and-be-inspired/",
      "doi": ""
    },
    {
      "text": "TikTok. 2022. TikTok - Make Your Day. https://www.tiktok.com/",
      "doi": ""
    },
    {
      "text": "Chetan Walia. 2019. A Dynamic Definition of Creativity. Creativity Research Journal 31, 3 (July 2019), 237–247. https://doi.org/10.1080/10400419.2019.1641787 Publisher: Routledge _eprint: https://doi.org/10.1080/10400419.2019.1641787.",
      "doi": ""
    },
    {
      "text": "Ian Wallace. 2014. The History of the Found Object in Art. http://www.artspace.com/magazine/art_101/the-history-of-the-found-object-in-art",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Judith S. Olson, Jingwen Zhang, Trung Nguyen, and Gary M. Olson. 2015. DocuViz: Visualizing Collaborative Writing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 1865–1874. https://doi.org/10.1145/2702123.2702517",
      "doi": "10.1145/2702123.2702517"
    },
    {
      "text": "Dakuo Wang, Haodan Tan, and Tun Lu. 2017. Why Users Do Not Want to Write Together When They Are Writing Together: Users’ Rationales for Today’s Collaborative Writing Practices. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (Dec. 2017), 107:1–107:18. https://doi.org/10.1145/3134742",
      "doi": "10.1145/3134742"
    },
    {
      "text": "Christof Weiß, Matthias Mauch, Simon Dixon, and Meinard Müller. 2019. Investigating style evolution of Western classical music: A computational approach. Musicae Scientiae 23, 4 (Dec. 2019), 486–507. https://doi.org/10.1177/1029864918757595",
      "doi": ""
    },
    {
      "text": "The Wellermen. 2022. The Wellermen on TikTok. https://www.tiktok.com/@thewellermen/video/7112521194460482822",
      "doi": ""
    },
    {
      "text": "Minz Won, Sanghyuk Chun, Oriol Nieto, and Xavier Serrc. 2020. Data-Driven Harmonic Filters for Audio Representation Learning. In ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, Barcelona, Spain, 536–540. https://doi.org/10.1109/ICASSP40776.2020.9053669",
      "doi": ""
    },
    {
      "text": "Minz Won, Andres Ferraro, Dmitry Bogdanov, and Xavier Serra. 2020. Evaluation of CNN-based Automatic Music Tagging Models. https://doi.org/10.48550/arXiv.2006.00751 arXiv:2006.00751 [cs, eess].",
      "doi": ""
    },
    {
      "text": "Fang Wu and Bernardo A. Huberman. 2007. Novelty and collective attention. Proceedings of the National Academy of Sciences 104, 45 (Nov. 2007), 17599–17601. https://doi.org/10.1073/pnas.0704916104 Publisher: Proceedings of the National Academy of Sciences.",
      "doi": ""
    },
    {
      "text": "Anna Xambó, Eva Hornecker, Paul Marshall, Sergi Jordà, Chris Dobbyn, and Robin Laney. 2013. Let’s jam the reactable: Peer learning during musical improvisation with a tabletop tangible interface. ACM Transactions on Computer-Human Interaction 20, 6 (Dec. 2013), 1–34. https://doi.org/10.1145/2530541",
      "doi": "10.1145/2530541"
    },
    {
      "text": "Lixiu Yu and Jeffrey V. Nickerson. 2011. Combining concept maps to catalyze creativity. In Proceedings of the 8th ACM conference on Creativity and cognition(C&C ’11). Association for Computing Machinery, New York, NY, USA, 13–20. https://doi.org/10.1145/2069618.2069623",
      "doi": "10.1145/2069618.2069623"
    },
    {
      "text": "Lixiu Yu and Jeffrey V. Nickerson. 2011. Cooks or cobblers? crowd creativity through combination. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 1393–1402. https://doi.org/10.1145/1978942.1979147",
      "doi": "10.1145/1978942.1979147"
    }
  ]
}