{
  "doi": "10.1145/3544548.3581443",
  "title": "TurnAhead: Designing 3-DoF Rotational Haptic Cues to Improve First-person Viewing (FPV) Experiences",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "First-Person View (FPV) drone is a recently developed category of drones designed for precision flying and for capturing exhilarating experiences that could not be captured before, such as navigating through tight indoor spaces and flying extremely close to subjects of interest. FPV viewing experiences, while exhilarating, typically have frequent rotations that can lead to visually induced discomfort. We present TurnAhead, which uses 3-DoF rotational haptic cues that correspond to camera rotations to improve the comfort, immersion, and enjoyment of FPV experiences. It uses headset-mounted air jets to provide ungrounded rotational forces and is the first device to support rotation around all 3 axes: yaw, pitch, and roll. We conducted a series of perception and formative studies to explore the design space of timing and intensity of haptic cues, followed by user experience evaluation, for a combined total of 44 participants (n=12, 8, 6, 18). Results showed that TurnAhead significantly improved overall comfort, immersion, and enjoyment, and was preferred by 89% of participants.",
  "authors": [
    {
      "name": "Bo-Cheng Ke",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781698",
      "orcid": "0000-0002-7403-0144"
    },
    {
      "name": "Min-Han Li",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780786",
      "orcid": "0000-0002-3793-8305"
    },
    {
      "name": "Yu Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780413",
      "orcid": "0000-0002-9033-7904"
    },
    {
      "name": "Chia-Yu Cheng",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779986",
      "orcid": "0000-0002-5908-0477"
    },
    {
      "name": "Chiao-Ju Chang",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780246",
      "orcid": "0000-0001-5190-1640"
    },
    {
      "name": "Yun-Fang Li",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783210",
      "orcid": "0000-0002-1554-3601"
    },
    {
      "name": "Shun-Yu Wang",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779777",
      "orcid": "0000-0003-1234-1737"
    },
    {
      "name": "Chiao Fang",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783005",
      "orcid": "0000-0003-0834-6033"
    },
    {
      "name": "Mike Y. Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-81460645188/rel-imgonly/mikebiophotosmall.jpg",
      "acmid": "81460645188",
      "orcid": "0000-0001-5410-652X"
    }
  ],
  "references": [
    {
      "text": "Kazuma Aoyama, Hiroyuki Iizuka, Hideyuki Ando, and Taro Maeda. 2015. Four-pole galvanic vestibular stimulation causes body sway about three axes. Scientific reports 5, 1 (2015), 1–8.",
      "doi": ""
    },
    {
      "text": "Daelonik Artworks. 2022. SciFi Platform City. https://assetstore.unity.com/packages/3d/environments/sci-fi/scifi-platform-city-111073",
      "doi": ""
    },
    {
      "text": "Hong-Yu Chang, Wen-Jie Tseng, Chia-En Tsai, Hsin-Yu Chen, Roshan Lalintha Peiris, and Liwei Chan. 2018. Facepush: Introducing normal force on face with head-mounted displays. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 927–935.",
      "doi": "10.1145/3242587.3242588"
    },
    {
      "text": "Jay Christensen. 2021. The Quack Attack is Back. AirVūz. https://www.airvuz.com/video/The-Quack-Attack-is-Back?id=6089755ca2211232261fd940&ccid=5ec8a885dbedf4000709a707",
      "doi": ""
    },
    {
      "text": "Cyriel Diels and Jelte E Bos. 2016. Self-driving carsickness. Applied ergonomics 53(2016), 374–382.",
      "doi": ""
    },
    {
      "text": "F. Gabbiani and S.J. Cox. 2017. Mathematics for Neuroscientists. Elsevier Science, USA. https://books.google.com.tw/books?id=giI8vgAACAAJ",
      "doi": ""
    },
    {
      "text": "Germán Gálvez-García, Marion Hay, and Catherine Gabaude. 2015. Alleviating simulator sickness with galvanic cutaneous stimulation. Human factors 57, 4 (2015), 649–657.",
      "doi": ""
    },
    {
      "text": "John F Golding. 1998. Motion sickness susceptibility questionnaire revised and its relationship to other forms of sickness. Brain research bulletin 47, 5 (1998), 507–516.",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Eythor R Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. Gyrovr: Simulating inertia in virtual reality using head worn flywheels. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 227–232.",
      "doi": "10.1145/2984511.2984535"
    },
    {
      "text": "Hakan Gurocak, Sankar Jayaram, Benjamin Parrish, and, and Uma Jayaram. 2003. Weight sensation in virtual environments using a haptic device with air jets. J. Comput. Inf. Sci. Eng. 3, 2 (2003), 130–135.",
      "doi": ""
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor’s hammer: An ungrounded force feedback device utilizing propeller-induced propulsive force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–11.",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Matthias Hoppe, Daria Oskina, Albrecht Schmidt, and Thomas Kosch. 2021. Odin’s Helmet: A Head-Worn Haptic Feedback Device to Simulate G-Forces on the Human Body in Virtual Reality. Proceedings of the ACM on Human-Computer Interaction 5, EICS(2021), 1–15.",
      "doi": "10.1145/3461734"
    },
    {
      "text": "Mike Israel. 2015. AirVūz. AirVūz. https://www.airvuz.com/",
      "doi": ""
    },
    {
      "text": "Seungwoo Je, Hyelip Lee, Myung Jin Kim, and Andrea Bianchi. 2018. Wind-blaster: A wearable propeller-based prototype that provides ungrounded force-feedback. In ACM SIGGRAPH 2018 Emerging Technologies. ACM, New York, NY, USA, 1–2.",
      "doi": "10.1145/3214907.3214915"
    },
    {
      "text": "Behrang Keshavarz, Bernhard E Riecke, Lawrence J Hettinger, and Jennifer L Campos. 2015. Vection and visually induced motion sickness: how are they related?Frontiers in psychology 6 (2015), 472.",
      "doi": ""
    },
    {
      "text": "Yuki Kon, Takuto Nakamura, and Hiroyuki Kajimoto. 2017. HangerOVER: HMD-embedded haptics display with hanger reflex. In ACM SIGGRAPH 2017 Emerging Technologies. ACM, New York, NY, USA, 1–2.",
      "doi": "10.1145/3084822.3084842"
    },
    {
      "text": "Bigna Lenggenhager, Christophe Lopez, and Olaf Blanke. 2008. Influence of galvanic vestibular stimulation on egocentric and object-based mental transformations. Experimental Brain Research 184, 2 (2008), 211–221.",
      "doi": ""
    },
    {
      "text": "Shi-Hong Liu, Pai-Chien Yen, Yi-Hsuan Mao, Yu-Hsin Lin, Erick Chandra, and Mike Y Chen. 2020. HeadBlaster: a wearable approach to simulating motion perception using head-mounted air propulsion jets. ACM Transactions on Graphics (TOG) 39, 4 (2020), 84–1.",
      "doi": "10.1145/3386569.3392482"
    },
    {
      "text": "Shi-Hong Liu, Neng-Hao Yu, Liwei Chan, Yi-Hao Peng, Wei-Zen Sun, and Mike Y Chen. 2019. Phantomlegs: Reducing virtual reality sickness using head-worn haptic devices. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, IEEE, Osaka, Japan, 817–826.",
      "doi": ""
    },
    {
      "text": "N. A. Macmillan and C. D. Creelman. 1991. Detection theory: A user’s guide. Cambridge University Press, UK.",
      "doi": ""
    },
    {
      "text": "Taro Maeda, Hideyuki Ando, and Maki Sugimoto. 2005. Virtual acceleration with galvanic vestibular stimulation in a virtual reality environment. In IEEE Proceedings. VR 2005. Virtual Reality, 2005.IEEE, IEEE, Bonn, Germany, 289–290.",
      "doi": ""
    },
    {
      "text": "Su Han Park, Bin Han, and Gerard Jounghyun Kim. 2022. Mixing in reverse optical flow to mitigate vection and simulation sickness in virtual reality. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans, LA, USA, 1–11.",
      "doi": "10.1145/3491102.3501847"
    },
    {
      "text": "Yi-Hao Peng, Carolyn Yu, Shi-Hong Liu, Chung-Wei Wang, Paul Taele, Neng-Hao Yu, and Mike Y Chen. 2020. Walkingvibe: Reducing virtual reality sickness and improving realism while walking in vr using unobtrusive head-mounted vibrotactile feedback. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376847"
    },
    {
      "text": "Universal Pictures. 2022. Flying Camera! AMBULANCE FPV Drone Featurette. Youtube. https://www.youtube.com/watch?v=Y7fOHLDN8Y4&t=49s",
      "doi": ""
    },
    {
      "text": "Porsche. 2021. Drive2Extremes: Taycan Cross Turismo x Johnny FPV. Youtube. https://youtu.be/CBRwF0LU3Ys?t=97",
      "doi": ""
    },
    {
      "text": "Arnon Rolnick and RE Lubow. 1991. Why is the driver rarely motion sick? The role of controllability in motion sickness. Ergonomics 34, 7 (1991), 867–879.",
      "doi": ""
    },
    {
      "text": "Joseph M Romano and Katherine J Kuchenbecker. 2009. The AirWand: Design and characterization of a large-workspace haptic device. In 2009 IEEE International Conference on Robotics and Automation. IEEE, IEEE, Kobe, Japan, 1461–1466.",
      "doi": ""
    },
    {
      "text": "Robert Rosenthal, Harris Cooper, Larry Hedges, 1994. Parametric measures of effect size. The handbook of research synthesis 621, 2 (1994), 231–244.",
      "doi": ""
    },
    {
      "text": "Tomoya Sasaki, Richard Sahala Hartanto, Kao-Hua Liu, Keitarou Tsuchiya, Atsushi Hiyama, and Masahiko Inami. 2018. Leviopole: mid-air haptic interactions using multirotor. In ACM SIGGRAPH 2018 Emerging Technologies. ACM, New York, NY, USA, 1–2.",
      "doi": "10.1145/3214907.3214913"
    },
    {
      "text": "Misha Sra, Abhinandan Jain, and Pattie Maes. 2019. Adding proprioceptive feedback to virtual reality experiences using galvanic vestibular stimulation. In Proceedings of the 2019 CHI conference on human factors in computing systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300905"
    },
    {
      "text": "Sandro T. 2019. Flooded Grounds. https://assetstore.unity.com/packages/3d/environments/flooded-grounds-48529",
      "doi": ""
    },
    {
      "text": "Sandro T. 2019. Sun Temple. https://assetstore.unity.com/packages/3d/environments/sun-temple-115417",
      "doi": ""
    },
    {
      "text": "Yudai Tanaka, Jun Nishida, and Pedro Lopes. 2022. Electrical Head Actuation: Enabling Interactive Systems to Directly Manipulate Head Orientation. In CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15.",
      "doi": "10.1145/3491102.3501910"
    },
    {
      "text": "Tesla. 2022. Flying Through Giga Berlin. Youtube. https://www.youtube.com/watch?v=7-4yOx1CnXE&t=1s&ab_channel=Tesla",
      "doi": ""
    },
    {
      "text": "Ching-Yi Tsai, I-Lun Tsai, Chao-Jung Lai, Derrek Chow, Lauren Wei, Lung-Pan Cheng, and Mike Y Chen. 2022. AirRacket: Perceptual Design of Ungrounded, Directional Force Feedback to Improve Virtual Racket Sports Experiences. In CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15.",
      "doi": "10.1145/3491102.3502034"
    },
    {
      "text": "Chi Wang, Da-Yuan Huang, Shuo-wen Hsu, Chu-En Hou, Yeu-Luen Chiu, Ruei-Che Chang, Jo-Yu Lo, and Bing-Yu Chen. 2019. Masque: Exploring lateral skin stretch feedback on the face with head-mounted displays. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New Orleans, LA, USA, 439–451.",
      "doi": "10.1145/3332165.3347898"
    },
    {
      "text": "Yu-Wei Wang, Yu-Hsin Lin, Pin-Sung Ku, Yōko Miyatake, Yi-Hsuan Mao, Po Yu Chen, Chun-Miao Tseng, and Mike Y Chen. 2021. JetController: High-speed Ungrounded 3-DoF Force Feedback Controllers using Air Propulsion Jets. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3411764.3445549"
    },
    {
      "text": "Koki Watanabe, Fumihiko Nakamura, Kuniharu Sakurada, Theophilus Teo, and Maki Sugimoto. 2022. An Integrated Ducted Fan-Based Multi-Directional Force Feedback with a Head Mounted Display. In ICAT-EGVE 2022 - International Conference on Artificial Reality and Telexistence and Eurographics Symposium on Virtual Environments, Hideaki Uchiyama and Jean-Marie Normand (Eds.). The Eurographics Association, Europe, 55–63. https://doi.org/10.2312/egve.20221276",
      "doi": ""
    },
    {
      "text": "Séamas Weech, Jae Moon, and Nikolaus F Troje. 2018. Influence of bone-conducted vibration on simulator sickness in virtual reality. PloS one 13, 3 (2018), e0194137.",
      "doi": ""
    },
    {
      "text": "Séamas Weech and Nikolaus F Troje. 2017. Vection latency is reduced by bone-conducted vibration and noisy galvanic vestibular stimulation. Multisensory Research 30, 1 (2017), 65–90.",
      "doi": ""
    },
    {
      "text": "Ben Yip and Jesse S Jin. 2004. Determination of pivot point of a human head from the front. In Proceedings of 2004 International Symposium on Intelligent Multimedia, Video and Speech Processing, 2004.IEEE, IEEE, Hong Kong, China, 362–365.",
      "doi": ""
    }
  ]
}