{
  "doi": "10.1145/3544548.3581419",
  "title": "Squeez’In: Private Authentication on Smartphones based on Squeezing Gestures",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "In this paper, we proposed Squeez’In, a technique on smartphones that enabled private authentication by holding and squeezing the phone with a unique pattern. We first explored the design space of practical squeezing gestures for authentication by analyzing the participants’ self-designed gestures and squeezing behavior. Results showed that varying-length gestures with two levels of touch pressure and duration were the most natural and unambiguous. We then implemented Squeez’In on an off-the-shelf capacitive sensing smartphone, and employed an SVM-GBDT model for recognizing gestures and user-specific behavioral patterns, achieving 99.3% accuracy and 0.93 F1-score when tested on 21 users. A following 14-day study validated the memorability and long-term stability of Squeez’In. During usability evaluation, compared with gesture and pin code, Squeez’In achieved significantly faster authentication speed and higher user preference in terms of privacy and security.",
  "tags": [
    "touch pressure",
    "capacitive sensing",
    "motion-based authentication"
  ],
  "authors": [
    {
      "name": "Xin Yi",
      "institution": "Institute for Network Sciences and Cyberspace, Tsinghua University, China and Zhongguancun Laboratory, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658762070",
      "orcid": "0000-0001-8041-7962"
    },
    {
      "name": "Shuning Zhang",
      "institution": "Tsinghua University, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783803",
      "orcid": "0000-0002-4145-117X"
    },
    {
      "name": "Ziqi Pan",
      "institution": "Department of Computer Science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781451",
      "orcid": "0000-0002-5562-8685"
    },
    {
      "name": "Louisa Shi",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782669",
      "orcid": "0000-0003-4099-1235"
    },
    {
      "name": "Fengyan Han",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782451",
      "orcid": "0000-0001-5761-2524"
    },
    {
      "name": "Yan Kong",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780478",
      "orcid": "0000-0002-4187-3559"
    },
    {
      "name": "Hewu Li",
      "institution": "Tsinghua University, China and Zhongguancun Laboratory, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659759798",
      "orcid": "0000-0002-6331-6542"
    },
    {
      "name": "Yuanchun Shi",
      "institution": "Department of Computer science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647319",
      "orcid": "0000-0003-2273-6927"
    }
  ],
  "references": [
    {
      "text": "Tousif Ahmed, Roberto Hoyle, Kay Connelly, David Crandall, and Apu Kapadia. 2015. Privacy Concerns and Behaviors of People with Visual Impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3523–3532. https://doi.org/10.1145/2702123.2702334",
      "doi": "10.1145/2702123.2702334"
    },
    {
      "text": "Adnan Bin Amanat Ali, Vasaki Ponnusamy, and Anbuselvan Sangodiah. 2019. User behaviour-based mobile authentication system. In Advances in Computer Communication and Computational Sciences. Springer, 461–472.",
      "doi": ""
    },
    {
      "text": "Panagiotis Andriotis, Theo Tryfonas, and George Oikonomou. 2014. Complexity metrics and user strength perceptions of the pattern-lock graphical authentication method. In International conference on human aspects of information security, privacy, and trust. Springer, 115–126.",
      "doi": "10.1007/978-3-319-07620-1_11"
    },
    {
      "text": "Ahmed Arif, Michel Pahud, Ken Hinckley, and WIlliam Buxton. 2013. A Tap and Gesture Hybrid Method for Authenticating Smartphone Users. In Proceedings of the 15th International Conference on Human-Computer Interaction with Mobile Devices and Services (Munich, Germany) (MobileHCI ’13). Association for Computing Machinery, New York, NY, USA, 486–491. https://doi.org/10.1145/2493190.2494435",
      "doi": "10.1145/2493190.2494435"
    },
    {
      "text": "Mozhgan Azimpourkivi, Umut Topkara, and Bogdan Carbunar. 2017. Camera Based Two Factor Authentication Through Mobile and Wearable Devices. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 35 (sep 2017), 37 pages. https://doi.org/10.1145/3131904",
      "doi": "10.1145/3131904"
    },
    {
      "text": "Uladzislau Barayeu, Nastassya Horlava, Arno Libert, and Marc Van Hulle. 2020. Robust Single-Trial EEG-Based Authentication Achieved with a 2-Stage Classifier. Biosensors 10, 9 (2020), 124.",
      "doi": ""
    },
    {
      "text": "Tobias Boceck, Sascha Sprott, Huy Viet Le, and Sven Mayer. 2019. Force Touch Detection on Capacitive Sensors Using Deep Neural Networks. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 42, 6 pages. https://doi.org/10.1145/3338286.3344389",
      "doi": "10.1145/3338286.3344389"
    },
    {
      "text": "Mario Parreño Centeno, Yu Guan, and Aad van Moorsel. 2018. Mobile Based Continuous Authentication Using Deep Features. In Proceedings of the 2nd International Workshop on Embedded and Mobile Deep Learning (Munich, Germany) (EMDL’18). Association for Computing Machinery, New York, NY, USA, 19–24. https://doi.org/10.1145/3212725.3212732",
      "doi": "10.1145/3212725.3212732"
    },
    {
      "text": "Alexander De Luca, Alina Hang, Frederik Brudy, Christian Lindner, and Heinrich Hussmann. 2012. Touch Me Once and i Know It’s You! Implicit Authentication Based on Touch Screen Patterns. Association for Computing Machinery, New York, NY, USA, 987–996. https://doi.org/10.1145/2207676.2208544",
      "doi": "10.1145/2207676.2208544"
    },
    {
      "text": "Tao Feng, Ziyi Liu, Kyeong-An Kwon, Weidong Shi, Bogdan Carbunar, Yifei Jiang, and Nhung Nguyen. 2012. Continuous mobile authentication using touchscreen gestures. In 2012 IEEE Conference on Technologies for Homeland Security (HST). 451–456. https://doi.org/10.1109/THS.2012.6459891",
      "doi": ""
    },
    {
      "text": "Neil Zhenqiang Gong, Mathias Payer, Reza Moazzezi, and Mario Frank. 2016. Forgery-Resistant Touch-Based Authentication on Mobile Devices. In Proceedings of the 11th ACM on Asia Conference on Computer and Communications Security (Xi’an, China) (ASIA CCS ’16). Association for Computing Machinery, New York, NY, USA, 499–510. https://doi.org/10.1145/2897845.2897908",
      "doi": "10.1145/2897845.2897908"
    },
    {
      "text": "Anhong Guo, Robert Xiao, and Chris Harrison. 2015. CapAuth: Identifying and Differentiating User Handprints on Commodity Capacitive Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (Madeira, Portugal) (ITS ’15). Association for Computing Machinery, New York, NY, USA, 59–62. https://doi.org/10.1145/2817721.2817722",
      "doi": "10.1145/2817721.2817722"
    },
    {
      "text": "Christian Holz, Senaka Buthpitiya, and Marius Knaust. 2015. Bodyprint: Biometric User Identification on Mobile Devices Using the Capacitive Touchscreen to Scan Body Parts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3011–3014. https://doi.org/10.1145/2702123.2702518",
      "doi": "10.1145/2702123.2702518"
    },
    {
      "text": "Feng Hong, Meiyu Wei, Shujuan You, Yuan Feng, and Zhongwen Guo. 2015. Waving Authentication: Your Smartphone Authenticate You on Motion Gesture. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 263–266. https://doi.org/10.1145/2702613.2725444",
      "doi": "10.1145/2702613.2725444"
    },
    {
      "text": "Safaa Hriez, Nadim Obeid, and Arafat Awajan. 2019. User Authentication on Smartphones Using Keystroke Dynamics. In Proceedings of the Second International Conference on Data Science, E-Learning and Information Systems (Dubai, United Arab Emirates) (DATA ’19). Association for Computing Machinery, New York, NY, USA, Article 34, 4 pages. https://doi.org/10.1145/3368691.3368725",
      "doi": "10.1145/3368691.3368725"
    },
    {
      "text": "Kaori Ikematsu and Shota Yamanaka. 2020. ScraTouch: Extending Touch Interaction Technique Using Fingernail on Capacitive Touch Surfaces. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3334480.3382858"
    },
    {
      "text": "Toshiki Iso, Tsutomu Horikoshi, Masakatsu Tsukamoto, and Takeshi Higuchi. 2012. Personal Feature Extraction via Grip Force Sensors Mounted on a Mobile Phone: Authenticating the User during Key-Operation. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (Ulm, Germany) (MUM ’12). Association for Computing Machinery, New York, NY, USA, Article 30, 4 pages. https://doi.org/10.1145/2406367.2406404",
      "doi": "10.1145/2406367.2406404"
    },
    {
      "text": "Ryo Izuta, Kazuya Murao, Tsutomu Terada, Toshiki Iso, Hiroshi Inamura, and Masahiko Tsukamoto. 2016. Screen Unlocking Method Using Behavioral Characteristics When Taking Mobile Phone from Pocket. In Proceedings of the 14th International Conference on Advances in Mobile Computing and Multi Media (Singapore, Singapore) (MoMM ’16). Association for Computing Machinery, New York, NY, USA, 110–114. https://doi.org/10.1145/3007120.3007162",
      "doi": "10.1145/3007120.3007162"
    },
    {
      "text": "Minpyo Kang, Jejung Kim, Bongkyun Jang, Youngcheol Chae, Jae-Hyun Kim, and Jong-Hyun Ahn. 2017. Graphene-Based Three-Dimensional Capacitive Touch Sensor for Wearable Electronics. ACS Nano 11, 8 (2017), 7950–7957. https://doi.org/10.1021/acsnano.7b02474 arXiv:https://doi.org/10.1021/acsnano.7b02474PMID: 28727414.",
      "doi": ""
    },
    {
      "text": "David Kim, Paul Dunphy, Pam Briggs, Jonathan Hook, John W. Nicholson, James Nicholson, and Patrick Olivier. 2010. Multi-Touch Authentication on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1093–1102. https://doi.org/10.1145/1753326.1753489",
      "doi": "10.1145/1753326.1753489"
    },
    {
      "text": "Sowndarya Krishnamoorthy, Luis Rueda, Sherif Saad, and Haytham Elmiligi. 2018. Identification of User Behavioral Biometrics for Authentication Using Keystroke Dynamics and Machine Learning. In Proceedings of the 2018 2nd International Conference on Biometric Engineering and Applications (Amsterdam, Netherlands) (ICBEA ’18). Association for Computing Machinery, New York, NY, USA, 50–57. https://doi.org/10.1145/3230820.3230829",
      "doi": "10.1145/3230820.3230829"
    },
    {
      "text": "Katharina Krombholz, Thomas Hupperich, and Thorsten Holz. 2016. Use the Force: Evaluating Force-Sensitive Authentication for Mobile Devices. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). USENIX Association, Denver, CO, 207–219. https://www.usenix.org/conference/soups2016/technical-sessions/presentation/krombholz",
      "doi": "10.5555/3235895.3235913"
    },
    {
      "text": "Masashi Kudo and Hayato Yamana. 2018. Active Authentication on Smartphone Using Touch Pressure. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (Berlin, Germany) (UIST ’18 Adjunct). Association for Computing Machinery, New York, NY, USA, 96–98. https://doi.org/10.1145/3266037.3266113",
      "doi": "10.1145/3266037.3266113"
    },
    {
      "text": "Yantao Li, Hailong Hu, and Gang Zhou. 2018. Using data augmentation in continuous authentication on smartphones. IEEE Internet of Things Journal 6, 1 (2018), 628–640.",
      "doi": ""
    },
    {
      "text": "Chen Liang, Chun Yu, Xiaoying Wei, Xuhai Xu, Yongquan Hu, Yuntao Wang, and Yuanchun Shi. 2021. Auth+Track: Enabling Authentication Free Interaction on Smartphone by Continuous User Tracking. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445624",
      "doi": "10.1145/3411764.3445624"
    },
    {
      "text": "Markus Löchtefeld, Christoph Hirtz, and Sven Gehring. 2013. Evaluation of Hybrid Front- and Back-of-Device Interaction on Mobile Devices. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia(Luleå, Sweden) (MUM ’13). Association for Computing Machinery, New York, NY, USA, Article 17, 4 pages. https://doi.org/10.1145/2541831.2541865",
      "doi": "10.1145/2541831.2541865"
    },
    {
      "text": "Sven Mayer, Huy Viet Le, and Niels Henze. 2017. Estimating the Finger Orientation on Capacitive Touchscreens Using Convolutional Neural Networks. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (Brighton, United Kingdom) (ISS ’17). Association for Computing Machinery, New York, NY, USA, 220–229. https://doi.org/10.1145/3132272.3134130",
      "doi": "10.1145/3132272.3134130"
    },
    {
      "text": "Weizhi Meng, Duncan S Wong, Steven Furnell, and Jianying Zhou. 2014. Surveying the development of biometric user authentication on mobile phones. IEEE Communications Surveys & Tutorials 17, 3 (2014), 1268–1293.",
      "doi": "10.1109/COMST.2014.2386915"
    },
    {
      "text": "Zhangyu Meng, Jun Kong, and Juan Li. 2021. Utilizing binary code to improve usability of pressure-based authentication. Computers & Security 103 (2021), 102187. https://doi.org/10.1016/j.cose.2021.102187",
      "doi": ""
    },
    {
      "text": "Kazuya Murao, Hayami Tobise, Tsutomu Terada, Toshiki Iso, Masahiko Tsukamoto, and Tsutomu Horikoshi. 2014. Mobile Phone User Authentication with Grip Gestures Using Pressure Sensors. In Proceedings of the 12th International Conference on Advances in Mobile Computing and Multimedia(Kaohsiung, Taiwan) (MoMM ’14). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/2684103.2684116",
      "doi": "10.1145/2684103.2684116"
    },
    {
      "text": "Hyoungsik Nam, Ki-Hyuk Seol, Junhee Lee, Hyeonseong Cho, and Sang Won Jung. 2021. Review of capacitive touchscreen technologies: Overview, research trends, and machine learning approaches. Sensors 21, 14 (2021), 4776.",
      "doi": ""
    },
    {
      "text": "Matei Negulescu, Jaime Ruiz, Yang Li, and Edward Lank. 2012. Tap, Swipe, or Move: Attentional Demands for Distracted Smartphone Input. In Proceedings of the International Working Conference on Advanced Visual Interfaces (Capri Island, Italy) (AVI ’12). Association for Computing Machinery, New York, NY, USA, 173–180. https://doi.org/10.1145/2254556.2254589",
      "doi": "10.1145/2254556.2254589"
    },
    {
      "text": "KENNEDY OKOKPUJIE, ABERE REUBEN, JOYCE C OFOCHE, BASUO J BIOBELEMOYE, and IMHADE PRINCESS OKOKPUJIE. 2021. A COMPARATIVE ANALYSIS PERFORMANCE OF DATA AUGMENTATION ON AGE-INVARIANT FACE RECOGNI-TION USING PRETRAINED RESIDUAL NEURAL NETWORK. Journal of Theoretical and Applied Information Technology 99, 6(2021).",
      "doi": ""
    },
    {
      "text": "Changhyun Pang, Ja Hoon Koo, Amanda Nguyen, Jeffrey M Caves, Myung-Gil Kim, Alex Chortos, Kwanpyo Kim, Paul J Wang, Jeffrey B-H Tok, and Zhenan Bao. 2015. Highly skin-conformal microhairy sensor for pulse signal amplification. Advanced materials 27, 4 (2015), 634–640.",
      "doi": ""
    },
    {
      "text": "Kang Ryoung Park. 2011. Finger vein recognition by combining global and local features based on SVM. Computing and Informatics 30, 2 (2011), 295–309.",
      "doi": ""
    },
    {
      "text": "Pramuditha Perera and Vishal M Patel. 2018. Dual-minimax probability machines for one-class mobile active authentication. In 2018 IEEE 9th International Conference on Biometrics Theory, Applications and Systems (BTAS). IEEE, 1–8.",
      "doi": "10.1109/BTAS.2018.8698603"
    },
    {
      "text": "Philip Quinn, Seungyon Claire Lee, Melissa Barnhart, and Shumin Zhai. 2019. Active Edge: Designing Squeeze Gestures for the Google Pixel 2. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300504",
      "doi": "10.1145/3290605.3300504"
    },
    {
      "text": "Hanae Rateau, Yosra Rekik, Edward Lank, and Keiko Katsuragawa. 2021. EdgeMark Menu: A 1D Menu for Curved Edge Display Smartphones. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3447526.3472017",
      "doi": "10.1145/3447526.3472017"
    },
    {
      "text": "Christian Rendl, Patrick Greindl, Kathrin Probst, Martin Behrens, and Michael Haller. 2014. Presstures: Exploring Pressure-Sensitive Multi-Touch Gestures on Trackpads. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 431–434. https://doi.org/10.1145/2556288.2557146",
      "doi": "10.1145/2556288.2557146"
    },
    {
      "text": "Mohamed Azard Rilvan, Jedrik Chao, and Md Shafaeat Hossain. 2020. Capacitive Swipe Gesture Based Smartphone User Authentication and Identification. In 2020 IEEE Conference on Cognitive and Computational Aspects of Situation Management (CogSIMA). 1–8. https://doi.org/10.1109/CogSIMA49017.2020.9215998",
      "doi": ""
    },
    {
      "text": "Mohamed Azard Rilvan, Kolby Isiah Lacy, Md Shafaeat Hossain, and Bing Wang. 2016. User authentication and identification on smartphones by incorporating capacitive touchscreen. In 2016 IEEE 35th International Performance Computing and Communications Conference (IPCCC). IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Baljit Singh Saini, Parminder Singh, Anand Nayyar, Navdeep Kaur, Kamaljit Singh Bhatia, Shaker El-Sappagh, and Jong-Wan Hu. 2020. A Three-Step Authentication Model for Mobile Phone User Using Keystroke Dynamics. IEEE Access 8(2020), 125909–125922.",
      "doi": ""
    },
    {
      "text": "Roland Schlöglhofer and Johannes Sametinger. 2012. Secure and Usable Authentication on Mobile Devices. In Proceedings of the 10th International Conference on Advances in Mobile Computing & Multimedia (Bali, Indonesia) (MoMM ’12). Association for Computing Machinery, New York, NY, USA, 257–262. https://doi.org/10.1145/2428955.2429004",
      "doi": "10.1145/2428955.2429004"
    },
    {
      "text": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, and Max Mühlhäuser. 2017. Flexibles: Deformation-Aware 3D-Printed Tangibles for Capacitive Touchscreens. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1001–1014. https://doi.org/10.1145/3025453.3025663",
      "doi": "10.1145/3025453.3025663"
    },
    {
      "text": "Sougata Sen and Kartik Muralidharan. 2014. Putting ‘pressure’ on mobile authentication. In 2014 Seventh International Conference on Mobile Computing and Ubiquitous Networking (ICMU). 56–61. https://doi.org/10.1109/ICMU.2014.6799058",
      "doi": ""
    },
    {
      "text": "Shaikh Shawon Arefin Shimon, Sarah Morrison-Smith, Noah John, Ghazal Fahimi, and Jaime Ruiz. 2015. Exploring User-Defined Back-Of-Device Gestures for Mobile Devices. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (Copenhagen, Denmark) (MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 227–232. https://doi.org/10.1145/2785830.2785890",
      "doi": "10.1145/2785830.2785890"
    },
    {
      "text": "Sung-Ho Shin, Sangyoon Ji, Seiho Choi, Kyoung-Hee Pyo, Byeong Wan An, Jihun Park, Joohee Kim, Ju-Young Kim, Ki-Suk Lee, Soon-Yong Kwon, 2017. Integrated arrays of air-dielectric graphene transistors as transparent active-matrix pressure sensors for wide pressure ranges. Nature communications 8, 1 (2017), 1–8.",
      "doi": ""
    },
    {
      "text": "Chen Sun, Yang Wang, and Jun Zheng. 2014. Dissecting pattern unlock: The effect of pattern strength meter on pattern selection. Journal of Information Security and Applications 19, 4-5(2014), 308–320.",
      "doi": "10.1016/j.jisa.2014.10.009"
    },
    {
      "text": "José Torres, Sergio de los Santos, Efthimios Alepis, and Constantinos Patsakis. 2019. Behavioral Biometric Authentication in Android Unlock Patterns through Machine Learning.. In ICISSP. 146–154.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2022. Clarifying Agreement Calculations and Analysis for End-User Elicitation Studies. ACM Trans. Comput.-Hum. Interact. 29, 1, Article 5 (jan 2022), 70 pages. https://doi.org/10.1145/3476101",
      "doi": "10.1145/3476101"
    },
    {
      "text": "Emanuel von Zezschwitz, Malin Eiband, Daniel Buschek, Sascha Oberhuber, Alexander De Luca, Florian Alt, and Heinrich Hussmann. 2016. On Quantifying the Effective Password Space of Grid-Based Unlock Gestures. In Proceedings of the 15th International Conference on Mobile and Ubiquitous Multimedia(Rovaniemi, Finland) (MUM ’16). Association for Computing Machinery, New York, NY, USA, 201–212. https://doi.org/10.1145/3012709.3012729",
      "doi": "10.1145/3012709.3012729"
    },
    {
      "text": "Kensuke Wagata and Andrew Beng Jin Teoh. 2022. Few-Shot Continuous Authentication for Mobile-Based Biometrics. Applied Sciences 12, 20 (2022), 10365.",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Stephen Brewster, and Martin Halvey. 2013. Towards utilising one-handed multi-digit pressure input. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 1317–1322.",
      "doi": ""
    },
    {
      "text": "Cong Wu, Kun He, Jing Chen, Ruiying Du, and Yang Xiang. 2020. CaIAuth: Context-Aware Implicit Authentication When the Screen Is Awake. IEEE Internet of Things Journal 7, 12 (2020), 11420–11430.",
      "doi": ""
    },
    {
      "text": "Xin Yi, Chen Wang, Xiaojun Bi, and Yuanchun Shi. 2020. PalmBoard: Leveraging Implicit Touch Pressure in Statistical Decoding for Indirect Text Entry. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376441",
      "doi": "10.1145/3313831.3376441"
    },
    {
      "text": "Mingyuan Zhong, Chun Yu, Q. Wang, Xuhai Xu, and Y. Shi. 2018. ForceBoard: Subtle Text Entry Leveraging Pressure. Proceedings of the 2018 CHI Conferen10.1145/3266037.3266113ce on Human Factors in Computing Systems(2018).",
      "doi": ""
    },
    {
      "text": "Wen Zhu, Nancy Zeng, Ning Wang, 2010. Sensitivity, specificity, accuracy, associated confidence interval and ROC analysis with practical SAS implementations. NESUG proceedings: health care and life sciences, Baltimore, Maryland 19 (2010), 67.",
      "doi": ""
    }
  ]
}