{
  "doi": "10.1145/3544548.3580948",
  "title": "PopBlends: Strategies for Conceptual Blending with Large Language Models",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Pop culture is an important aspect of communication. On social media people often post pop culture reference images that connect an event, product or other entity to a pop culture domain. Creating these images is a creative challenge that requires finding a conceptual connection between the users’ topic and a pop culture domain. In cognitive theory, this task is called conceptual blending. We present a system called PopBlends that automatically suggests conceptual blends. The system explores three approaches that involve both traditional knowledge extraction methods and large language models. Our annotation study shows that all three methods provide connections with similar accuracy, but with very different characteristics. Our user study shows that people found twice as many blend suggestions as they did without the system, and with half the mental demand. We discuss the advantages of combining large language models with knowledge bases for supporting divergent and convergent thinking.",
  "authors": [
    {
      "name": "Sitong Wang",
      "institution": "Computer Science Department, Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660609674",
      "orcid": "0000-0002-1401-1371"
    },
    {
      "name": "Savvas Petridis",
      "institution": "Computer Science Department, Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314011",
      "orcid": "0000-0002-4944-8477"
    },
    {
      "name": "Taeahn Kwon",
      "institution": "Computer Science Department, Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239177",
      "orcid": "0000-0003-0847-8415"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    },
    {
      "name": "Lydia B Chilton",
      "institution": "Computer Science Department, Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480701",
      "orcid": "0000-0002-1737-1276"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. AI Dungeon. https://aidungeon.io/. Accessed: 2022-04-07.",
      "doi": ""
    },
    {
      "text": "Maneesh Agrawala, Wilmot Li, and Floraine Berthouzoz. 2011. Design Principles for Visual Communication. Commun. ACM 54, 4 (April 2011), 60–69. https://doi.org/10.1145/1924421.1924439",
      "doi": "10.1145/1924421.1924439"
    },
    {
      "text": "Maneesh Agrawala, Doantam Phan, Julie Heiser, John Haymaker, Jeff Klingner, Pat Hanrahan, and Barbara Tversky. 2003. Designing Effective Step-by-step Assembly Instructions. ACM Trans. Graph. 22, 3 (July 2003), 828–837. https://doi.org/10.1145/882262.882352",
      "doi": "10.1145/882262.882352"
    },
    {
      "text": "Maneesh Agrawala and Chris Stolte. 2001. Rendering Effective Route Maps: Improving Usability Through Generalization. In Proceedings of the 28th Annual Conference on Computer Graphics and Interactive Techniques(SIGGRAPH ’01). ACM, New York, NY, USA, 241–249. https://doi.org/10.1145/383259.383286",
      "doi": "10.1145/383259.383286"
    },
    {
      "text": "Salvatore Andolina, Khalil Klouche, Diogo Cabral, Tuukka Ruotsalo, and Giulio Jacucci. 2015. InspirationWall: Supporting Idea Generation Through Automatic Information Exploration. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (Glasgow, United Kingdom) (C&C ’15). Association for Computing Machinery, New York, NY, USA, 103–106. https://doi.org/10.1145/2757226.2757252",
      "doi": "10.1145/2757226.2757252"
    },
    {
      "text": "Suyun Sandra Bae, Oh-Hyun Kwon, Senthil Chandrasegaran, and Kwan-Liu Ma. 2020. Spinneret: Aiding Creative Ideation through Non-Obvious Concept Associations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376746",
      "doi": "10.1145/3313831.3376746"
    },
    {
      "text": "Margaret A. Boden. 1998. Creativity and artificial intelligence. Artificial Intelligence 103, 1 (1998), 347–356. https://doi.org/10.1016/S0004-3702(98)00055-1 Artificial Intelligence 40 years later.",
      "doi": "10.1016/S0004-3702%2898%2900055-1"
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel Ziegler, Jeffrey Wu, Clemens Winter, Chris Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. In Advances in Neural Information Processing Systems, H. Larochelle, M. Ranzato, R. Hadsell, M.F. Balcan, and H. Lin (Eds.). Vol. 33. Curran Associates, Inc., 1877–1901. https://proceedings.neurips.cc/paper/2020/file/1457c0d6bfcb4967418bfb8ac142f64a-Paper.pdf",
      "doi": ""
    },
    {
      "text": "Joel Chan, Joseph Chee Chang, Tom Hope, Dafna Shahaf, and Aniket Kittur. 2018. SOLVENT: A Mixed Initiative System for Finding Analogies between Research Papers. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 31 (nov 2018), 21 pages. https://doi.org/10.1145/3274300",
      "doi": "10.1145/3274300"
    },
    {
      "text": "Peggy Chi, Nathan Frey, Katrina Panovich, and Irfan Essa. 2021. Automatic Instructional Video Creation from a Markdown-Formatted Tutorial. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 677–690. https://doi.org/10.1145/3472749.3474778",
      "doi": "10.1145/3472749.3474778"
    },
    {
      "text": "Lydia B Chilton, Ecenaz Jen Ozmen, Sam H Ross, and Vivian Liu. 2021. VisiFit: Structuring Iterative Improvement for Novice Designers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 574, 14 pages. https://doi.org/10.1145/3411764.3445089",
      "doi": "10.1145/3411764.3445089"
    },
    {
      "text": "Lydia B. Chilton, Savvas Petridis, and Maneesh Agrawala. 2019. VisiBlends: A Flexible Workflow for Visual Blends. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300402",
      "doi": "10.1145/3290605.3300402"
    },
    {
      "text": "John Joon Young Chung, Wooseok Kim, Kang Min Yoo, Hwaran Lee, Eytan Adar, and Minsuk Chang. 2022. TaleBrush: Sketching Stories with Generative Pretrained Language Models. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 209, 19 pages. https://doi.org/10.1145/3491102.3501819",
      "doi": "10.1145/3491102.3501819"
    },
    {
      "text": "Peter Claridge. 2019. How Brands Celebrate Star Wars Day on May 4th. https://blog.unmetric.com/how-brands-celebrate-star-wars-day-on-may-4th Last accessed 19 November 2022.",
      "doi": ""
    },
    {
      "text": "Simon De Deyne, Danielle J Navarro, Amy Perfors, Marc Brysbaert, and Gert Storms. 2019. The “Small World of Words” English word association norms for over 12,000 cue words. Behavior research methods 51, 3 (2019), 987–1006.",
      "doi": ""
    },
    {
      "text": "Simon De Deyne, Amy Perfors, and Daniel J Navarro. 2016. Predicting human similarity judgments with distributional models: The value of word associations.. In Proceedings of COLING 2016, the 26th International Conference on Computational Linguistics: Technical Papers. The COLING 2016 Organizing Committee, Osaka, Japan, 1861–1870. https://aclanthology.org/C16-1175",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). Association for Computational Linguistics, Minneapolis, Minnesota, 4171–4186. https://doi.org/10.18653/v1/N19-1423",
      "doi": ""
    },
    {
      "text": "Steven Dow, Julie Fortuna, Dan Schwartz, Beth Altringer, Daniel Schwartz, and Scott Klemmer. 2011. Prototyping Dynamics: Sharing Multiple Designs Improves Exploration, Group Rapport, and Results. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2807–2816. https://doi.org/10.1145/1978942.1979359",
      "doi": "10.1145/1978942.1979359"
    },
    {
      "text": "Manfred Eppe, Ewen Maclean, Roberto Confalonieri, Oliver Kutz, Marco Schorlemmer, Enric Plaza, and Kai-Uwe Kühnberger. 2018. A computational framework for conceptual blending. Artificial Intelligence 256 (2018), 105–129. https://doi.org/10.1016/j.artint.2017.11.005",
      "doi": ""
    },
    {
      "text": "Brian Falkenhainer, Kenneth D. Forbus, and Dedre Gentner. 1989. The Structure-Mapping Engine: Algorithm and Examples. Artificial Intelligence 41 (1989), 1–63.",
      "doi": "10.1016/0004-3702%2889%2990077-5"
    },
    {
      "text": "Gilles Fauconnier and Mark Turner. 1998. Conceptual integration networks. Cognitive Science 22, 2 (1998), 133–187. https://doi.org/10.1016/S0364-0213(99)80038-X",
      "doi": ""
    },
    {
      "text": "Matt Gardner, Joel Grus, Mark Neumann, Oyvind Tafjord, Pradeep Dasigi, Nelson F. Liu, Matthew Peters, Michael Schmitz, and Luke Zettlemoyer. 2018. AllenNLP: A Deep Semantic Natural Language Processing Platform. In Proceedings of Workshop for NLP Open Source Software (NLP-OSS). Association for Computational Linguistics, Melbourne, Australia, 1–6. https://doi.org/10.18653/v1/W18-2501",
      "doi": ""
    },
    {
      "text": "Katy Ilonka Gero and Lydia B. Chilton. 2019. Metaphoria: An Algorithmic Companion for Metaphor Creation. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300526",
      "doi": "10.1145/3290605.3300526"
    },
    {
      "text": "Katy Ilonka Gero, Vivian Liu, and Lydia B. Chilton. 2021. Sparks: Inspiration for Science Writing using Language Models. CoRR abs/2110.07640(2021). arXiv:2110.07640https://arxiv.org/abs/2110.07640",
      "doi": ""
    },
    {
      "text": "Katy Ilonka Gero, Vivian Liu, Sarah Huang, Jennifer Lee, and Lydia B. Chilton. 2021. What Makes Tweetorials Tick: How Experts Communicate Complex Topics on Twitter. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 422 (oct 2021), 26 pages. https://doi.org/10.1145/3479566",
      "doi": "10.1145/3479566"
    },
    {
      "text": "Sandra G Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. Sage publications Sage CA: Los Angeles, CA, 904–908.",
      "doi": ""
    },
    {
      "text": "Zaeem Hussain, Mingda Zhang, Xiaozhong Zhang, Keren Ye, Christopher Thomas, Zuha Agha, Nathan Ong, and Adriana Kovashka. 2017. Automatic understanding of image and video advertisements. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 1705–1715.",
      "doi": ""
    },
    {
      "text": "Youngseung Jeon, Seungwan Jin, Patrick C. Shih, and Kyungsik Han. 2021. FashionQ: An AI-Driven Creativity Support Tool for Facilitating Ideation in Fashion Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 576, 18 pages. https://doi.org/10.1145/3411764.3445093",
      "doi": "10.1145/3411764.3445093"
    },
    {
      "text": "Peter H. Kahn, Nathan G. Freier, Takayuki Kanda, Hiroshi Ishiguro, Jolina H. Ruckert, Rachel L. Severson, and Shaun K. Kane. 2008. Design Patterns for Sociality in Human-robot Interaction. In Proceedings of the 3rd ACM/IEEE International Conference on Human Robot Interaction (Amsterdam, The Netherlands) (HRI ’08). ACM, New York, NY, USA, 97–104. https://doi.org/10.1145/1349822.1349836",
      "doi": "10.1145/1349822.1349836"
    },
    {
      "text": "Youwen Kang, Zhida Sun, Sitong Wang, Zeyu Huang, Ziming Wu, and Xiaojuan Ma. 2021. MetaMap: Supporting Visual Metaphor Ideation through Multi-Dimensional Example-Based Exploration. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445325",
      "doi": "10.1145/3411764.3445325"
    },
    {
      "text": "Joy Kim, Mira Dontcheva, Wilmot Li, Michael S. Bernstein, and Daniela Steinsapir. 2015. Motif: Supporting Novice Creativity Through Expert Patterns. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 1211–1220. https://doi.org/10.1145/2702123.2702507",
      "doi": "10.1145/2702123.2702507"
    },
    {
      "text": "Yui Kita and Jun Rekimoto. 2018. V8 Storming: How Far Should Two Ideas Be?. In Proceedings of the 9th Augmented Human International Conference (Seoul, Republic of Korea) (AH ’18). Association for Computing Machinery, New York, NY, USA, Article 14, 8 pages. https://doi.org/10.1145/3174910.3174937",
      "doi": "10.1145/3174910.3174937"
    },
    {
      "text": "Janin Koch, Andrés Lucero, Lena Hegemann, and Antti Oulasvirta. 2019. May AI? Design Ideation with Cooperative Contextual Bandits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 633, 12 pages. https://doi.org/10.1145/3290605.3300863",
      "doi": "10.1145/3290605.3300863"
    },
    {
      "text": "Mackenzie Leake, Abe Davis, Anh Truong, and Maneesh Agrawala. 2017. Computational Video Editing for Dialogue-driven Scenes. ACM Trans. Graph. 36, 4, Article 130 (July 2017), 14 pages. https://doi.org/10.1145/3072959.3073653",
      "doi": "10.1145/3072959.3073653"
    },
    {
      "text": "Kenton Lee, Luheng He, and Luke Zettlemoyer. 2018. Higher-Order Coreference Resolution with Coarse-to-Fine Inference. In North American Chapter of the Association for Computational Linguistics.",
      "doi": ""
    },
    {
      "text": "Douglas Lenat. 1995. CYC: A Large-Scale Investment in Knowledge Infrastructure. Commun. ACM 38, 11 (November 1995), 33–38.",
      "doi": "10.1145/219717.219745"
    },
    {
      "text": "Vivian Liu, Han Qiao, and Lydia Chilton. 2022. Opal: Multimodal Image Generation for News Illustration. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology (Bend, OR, USA) (UIST ’22). Association for Computing Machinery, New York, NY, USA, Article 73, 17 pages. https://doi.org/10.1145/3526113.3545621",
      "doi": "10.1145/3526113.3545621"
    },
    {
      "text": "Edward Loper and Steven Bird. 2002. NLTK: The Natural Language Toolkit. CoRR cs.CL/0205028(2002). http://dblp.uni-trier.de/db/journals/corr/corr0205.html#cs-CL-0205028",
      "doi": "10.3115/1118108.1118117"
    },
    {
      "text": "Paul Merrell, Eric Schkufza, Zeyang Li, Maneesh Agrawala, and Vladlen Koltun. 2011. Interactive Furniture Layout Using Interior Design Guidelines. In ACM SIGGRAPH 2011 Papers(Vancouver, British Columbia, Canada) (SIGGRAPH ’11). ACM, New York, NY, USA, Article 87, 10 pages. https://doi.org/10.1145/1964921.1964982",
      "doi": "10.1145/1964921.1964982"
    },
    {
      "text": "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems. 3111–3119.",
      "doi": ""
    },
    {
      "text": "Hiroyuki Osone, Jun-Li Lu, and Yoichi Ochiai. 2021. BunCho: AI Supported Story Co-Creation via Unsupervised Multitask Learning to Increase Writers’ Creativity in Japanese. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3450391",
      "doi": "10.1145/3411763.3450391"
    },
    {
      "text": "Frank Pallotta. 2016. ’Star Wars Day’ is a force with brands on Twitter. https://money.cnn.com/2016/05/04/media/star-wars-day-2016-tweets-may-the-fourth-be-with-you/index.html Last accessed 19 November 2022.",
      "doi": ""
    },
    {
      "text": "Paul B Paulus, Mary T Dzindolet, George Poletes, and L Mabel Camacho. 1993. Perception of performance in group brainstorming: The illusion of group productivity. Personality and Social Psychology Bulletin 19, 1 (1993), 78–89.",
      "doi": ""
    },
    {
      "text": "Jeffrey Pennington, Richard Socher, and Christopher D Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532–1543.",
      "doi": ""
    },
    {
      "text": "Cmara Pereira and Francisco. 2007. Creativity and Artificial Intelligence: A Conceptual Blending Approach (1st ed.). Walter de Gruyter, USA.",
      "doi": ""
    },
    {
      "text": "Matthew E Peters, Waleed Ammar, Chandra Bhagavatula, and Russell Power. 2017. Semi-supervised sequence tagging with bidirectional language models. arXiv preprint arXiv:1705.00108(2017).",
      "doi": ""
    },
    {
      "text": "Savvas Petridis, Hijung Valentina Shin, and Lydia B. Chilton. 2021. Symbol-Finder: Brainstorming Diverse Symbols Using Local Semantic Networks. In Proceedings of the 34th Annual ACM Symposium on User Interface Software and Technology(UIST ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3472749.3474757",
      "doi": "10.1145/3472749.3474757"
    },
    {
      "text": "Fabio Petroni, Tim Rocktäschel, Sebastian Riedel, Patrick Lewis, Anton Bakhtin, Yuxiang Wu, and Alexander Miller. 2019. Language Models as Knowledge Bases?. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). Association for Computational Linguistics, Hong Kong, China, 2463–2473. https://doi.org/10.18653/v1/D19-1250",
      "doi": ""
    },
    {
      "text": "Alec Radford and Karthik Narasimhan. 2018. Improving Language Understanding by Generative Pre-Training.",
      "doi": ""
    },
    {
      "text": "Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, and Ilya Sutskever. 2018. Language Models are Unsupervised Multitask Learners. (2018). https://d4mucfpksywv.cloudfront.net/better-language-models/language-models.pdf",
      "doi": ""
    },
    {
      "text": "Aditya Ramesh, Mikhail Pavlov, Gabriel Goh, Scott Gray, Chelsea Voss, Alec Radford, Mark Chen, and Ilya Sutskever. 2021. Zero-shot text-to-image generation. In International Conference on Machine Learning. PMLR, 8821–8831.",
      "doi": ""
    },
    {
      "text": "Juan Ramos 2003. Using tf-idf to determine word relevance in document queries. In Proceedings of the first instructional conference on machine learning, Vol. 242. Citeseer, 29–48.",
      "doi": ""
    },
    {
      "text": "Simon Razniewski, Andrew Yates, Nora Kassner, and Gerhard Weikum. 2021. Language models as or for knowledge bases. arXiv preprint arXiv:2110.04888(2021).",
      "doi": ""
    },
    {
      "text": "Nils Reimers and Iryna Gurevych. 2019. Sentence-BERT: Sentence Embeddings using Siamese BERT-Networks. CoRR abs/1908.10084(2019). arXiv:1908.10084http://arxiv.org/abs/1908.10084",
      "doi": ""
    },
    {
      "text": "Omer Sagi and Lior Rokach. 2018. Ensemble learning: A survey. Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery 8, 4(2018), e1249.",
      "doi": ""
    },
    {
      "text": "Maarten Sap, Ronan Le Bras, Emily Allaway, Chandra Bhagavatula, Nicholas Lourie, Hannah Rashkin, Brendan Roof, Noah A. Smith, and Yejin Choi. 2019. ATOMIC: An Atlas of Machine Commonsense for If-Then Reasoning. In The Thirty-Third AAAI Conference on Artificial Intelligence, AAAI 2019, The Thirty-First Innovative Applications of Artificial Intelligence Conference, IAAI 2019, The Ninth AAAI Symposium on Educational Advances in Artificial Intelligence, EAAI 2019, Honolulu, Hawaii, USA, January 27 - February 1, 2019. AAAI Press, 3027–3035. https://doi.org/10.1609/aaai.v33i01.33013027",
      "doi": "10.1609/aaai.v33i01.33013027"
    },
    {
      "text": "Allison Sauppé and Bilge Mutlu. 2014. Design Patterns for Exploring and Prototyping Human-robot Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 1439–1448. https://doi.org/10.1145/2556288.2557057",
      "doi": "10.1145/2556288.2557057"
    },
    {
      "text": "Yang Shi, Yang Wang, Ye Qi, John Chen, Xiaoyao Xu, and Kwan-Liu Ma. 2017. IdeaWall: Improving Creative Collaboration through Combinatorial Visual Stimuli. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 594–603. https://doi.org/10.1145/2998181.2998208",
      "doi": "10.1145/2998181.2998208"
    },
    {
      "text": "Amit Singhal. 2012. Introducing the knowledge graph: Things, not strings. https://blog.google/products/search/introducing-knowledge-graph-things-not/",
      "doi": ""
    },
    {
      "text": "Barbara Tversky and Juliet Chou. 2010. Creativity: Depth and Breadth. https://doi.org/10.1007/978-0-85729-224-7_27",
      "doi": ""
    },
    {
      "text": "Tony Veale. 2019. From Conceptual Mash-ups to Badass Blends: A Robust Computational Model of Conceptual Blending. Springer International Publishing, Cham, 71–89. https://doi.org/10.1007/978-3-319-43610-4_4",
      "doi": ""
    },
    {
      "text": "Tony Veale, Diarmuid O’Donoghue, and Mark Keane. 2000. Computation and Blending. Cognitive Linguistics 11 (01 2000), 253–281. https://doi.org/10.1515/cogl.2001.016,",
      "doi": ""
    },
    {
      "text": "Chenguang Wang, Xiao Liu, and Dawn Song. 2020. Language models are open knowledge graphs. arXiv preprint arXiv:2010.11967(2020).",
      "doi": ""
    },
    {
      "text": "Hao-Chuan Wang, Dan Cosley, and Susan R. Fussell. 2010. Idea Expander: Supporting Group Brainstorming with Conversationally Triggered Visual Thinking Stimuli. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (Savannah, Georgia, USA) (CSCW ’10). Association for Computing Machinery, New York, NY, USA, 103–106. https://doi.org/10.1145/1718918.1718938",
      "doi": "10.1145/1718918.1718938"
    },
    {
      "text": "Hao-Chuan Wang, Susan R. Fussell, and Dan Cosley. 2011. From Diversity to Creativity: Stimulating Group Brainstorming with Cultural Differences and Conversationally-Retrieved Pictures. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (Hangzhou, China) (CSCW ’11). Association for Computing Machinery, New York, NY, USA, 265–274. https://doi.org/10.1145/1958824.1958864",
      "doi": "10.1145/1958824.1958864"
    },
    {
      "text": "Wenhui Wang, Furu Wei, Li Dong, Hangbo Bao, Nan Yang, and Ming Zhou. 2020. Minilm: Deep self-attention distillation for task-agnostic compression of pre-trained transformers. Advances in Neural Information Processing Systems 33 (2020), 5776–5788.",
      "doi": ""
    },
    {
      "text": "Tongshuang Wu, Michael Terry, and Carrie J. Cai. 2021. AI Chains: Transparent and Controllable Human-AI Interaction by Chaining Large Language Model Prompts. CoRR abs/2110.01691(2021). arXiv:2110.01691https://arxiv.org/abs/2110.01691",
      "doi": ""
    },
    {
      "text": "Haijun Xia. 2020. Crosspower: Bridging Graphics and Linguistics. Association for Computing Machinery, New York, NY, USA, 722–734. https://doi.org/10.1145/3379337.3415845",
      "doi": "10.1145/3379337.3415845"
    },
    {
      "text": "Haijun Xia, Jennifer Jacobs, and Maneesh Agrawala. 2020. Crosscast: Adding Visuals to Audio Travel Podcasts. Association for Computing Machinery, New York, NY, USA, 735–746. https://doi.org/10.1145/3379337.3415882",
      "doi": "10.1145/3379337.3415882"
    },
    {
      "text": "Lixiu Yu, Aniket Kittur, and Robert E. Kraut. 2014. Distributed Analogical Idea Generation: Inventing with Crowds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 1245–1254. https://doi.org/10.1145/2556288.2557371",
      "doi": "10.1145/2556288.2557371"
    },
    {
      "text": "Lixiu Yu, Aniket Kittur, and Robert E. Kraut. 2014. Searching for Analogical Ideas with Crowds. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 1225–1234. https://doi.org/10.1145/2556288.2557378",
      "doi": "10.1145/2556288.2557378"
    },
    {
      "text": "Ann Yuan, Andy Coenen, Emily Reif, and Daphne Ippolito. 2022. Wordcraft: Story Writing With Large Language Models. In 27th International Conference on Intelligent User Interfaces (Helsinki, Finland) (IUI ’22). Association for Computing Machinery, New York, NY, USA, 841–852. https://doi.org/10.1145/3490099.3511105",
      "doi": "10.1145/3490099.3511105"
    },
    {
      "text": "Nanxuan Zhao, Nam Wook Kim, Laura Mariah Herman, Hanspeter Pfister, Rynson W.H. Lau, Jose Echevarria, and Zoya Bylinskii. 2020. ICONATE: Automatic Compound Icon Generation and Ideation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376618",
      "doi": "10.1145/3313831.3376618"
    }
  ]
}