{
  "doi": "10.1145/3544548.3580696",
  "title": "Selecting Real-World Objects via User-Perspective Phone Occlusion",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Perceiving the region of interest (ROI) and target object by smartphones from the user’s first-person perspective can enable diverse spatial interactions. In this paper, we propose a novel ROI input method and a target selecting method for smartphones by utilizing the user-perspective phone occlusion. This concept of turning the phone into real-world physical cursor benefits from the proprioception, gets rid of the constraint of camera preview, and allows users to rapidly and accurately select the target object. Meanwhile, our method can provide a resizable and rotatable rectangular ROI to disambiguate dense targets. We implemented the prototype system by positioning the user’s iris with the front camera and estimating the rectangular area blocked by the phone with the rear camera simultaneously, followed by a target prediction algorithm with the distance-weighted Jaccard index. We analyzed the behavioral models of using our method and evaluated our prototype system’s pointing accuracy and usability. Results showed that our method is well-accepted by the users for its convenience, accuracy, and efficiency.",
  "authors": [
    {
      "name": "Yue Qin",
      "institution": "Department of Computer Science and Technology, Tsinghua University, China",
      "img": "/do/10.1145/contrib-99659366320/rel-imgonly/__-__-___.jpg",
      "acmid": "99659366320",
      "orcid": "0000-0003-1351-5284"
    },
    {
      "name": "Chun Yu",
      "institution": "Department of Computer science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467660483",
      "orcid": "0000-0003-2591-7993"
    },
    {
      "name": "Wentao Yao",
      "institution": "Department of Computer Science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779549",
      "orcid": "0000-0002-4117-941X"
    },
    {
      "name": "Jiachen Yao",
      "institution": "Zhili College, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780286",
      "orcid": "0000-0001-7655-7831"
    },
    {
      "name": "Chen Liang",
      "institution": "Department of Computer Science and Technology, Tsinghua University, China",
      "img": "/do/10.1145/contrib-99659365185/rel-imgonly/20250674.png",
      "acmid": "99659365185",
      "orcid": "0000-0003-0579-2716"
    },
    {
      "name": "Yueting Weng",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366113",
      "orcid": "0000-0003-1649-8221"
    },
    {
      "name": "Yukang Yan",
      "institution": "Department of Computer Science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161020",
      "orcid": "0000-0001-7515-3755"
    },
    {
      "name": "Yuanchun Shi",
      "institution": "Department of Computer science and Technology, Tsinghua University, China and Qinghai University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647319",
      "orcid": "0000-0003-2273-6927"
    }
  ],
  "references": [
    {
      "text": "Artsiom Ablavatski, Andrey Vakunov, Ivan Grishchenko, Karthik Raveendran, and Matsvei Zhdanovich. 2020. Real-time Pupil Tracking from Monocular Video for Digital Puppetry. https://doi.org/10.48550/ARXIV.2006.11341",
      "doi": ""
    },
    {
      "text": "Heikki Ailisto, Lauri Pohjanheimo, Pasi Välkkynen, Esko Strömmer, Timo Tuomisto, and Ilkka Korhonen. 2006. Bridging the physical and virtual worlds by local connectivity-based physical selection. Personal and Ubiquitous Computing 10, 6 (2006), 333–344.",
      "doi": "10.1007/s00779-005-0057-0"
    },
    {
      "text": "Amr Alanwar, Moustafa Alzantot, Bo-Jhang Ho, Paul Martin, and Mani Srivastava. 2017. SeleCon: Scalable IoT Device Selection and Control Using Hand Gestures. In Proceedings of the Second International Conference on Internet-of-Things Design and Implementation(Pittsburgh, PA, USA) (IoTDI ’17). Association for Computing Machinery, New York, NY, USA, 47–58. https://doi.org/10.1145/3054977.3054981",
      "doi": "10.1145/3054977.3054981"
    },
    {
      "text": "Daniel Andersen, Voicu Popescu, Chengyuan Lin, Maria Eugenia Cabrera, Aditya Shanghavi, and Juan Wachs. 2016. A Hand-Held, Self-Contained Simulated Transparent Display. In 2016 IEEE International Symposium on Mixed and Augmented Reality (ISMAR-Adjunct). IEEE, Piscataway, NJ, USA, 96–101. https://doi.org/10.1109/ISMAR-Adjunct.2016.0049",
      "doi": ""
    },
    {
      "text": "Ferran Argelaguet and Carlos Andujar. 2013. A survey of 3D object selection techniques for virtual environments. Computers & Graphics 37, 3 (2013), 121–136.",
      "doi": "10.1016/j.cag.2012.12.003"
    },
    {
      "text": "Huidong Bai, Li Zhang, Jing Yang, and Mark Billinghurst. 2021. Bringing full-featured mobile phone interaction into virtual reality. Computers & Graphics 97(2021), 42–53. https://doi.org/10.1016/j.cag.2021.04.004",
      "doi": "10.1016/j.cag.2021.04.004"
    },
    {
      "text": "Amartya Banerjee, Jesse Burstyn, Audrey Girouard, and Roel Vertegaal. 2012. MultiPoint: Comparing laser and manual pointing as remote input in large display interactions. International Journal of Human-Computer Studies 70, 10 (2012), 690–702. https://doi.org/10.1016/j.ijhcs.2012.05.009 Special issue on Developing, Evaluating and Deploying Multi-touch Systems.",
      "doi": "10.1016/j.ijhcs.2012.05.009"
    },
    {
      "text": "Domagoj Baričević, Cha Lee, Matthew Turk, Tobias Höllerer, and Doug A. Bowman. 2012. A hand-held AR magic lens with user-perspective rendering. In 2012 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, Piscataway, NJ, USA, 197–206. https://doi.org/10.1109/ISMAR.2012.6402557",
      "doi": "10.1109/ISMAR.2012.6402557"
    },
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton, and Tony D. DeRose. 1993. Toolglass and Magic Lenses: The See-through Interface. In Proceedings of the 20th Annual Conference on Computer Graphics and Interactive Techniques (Anaheim, CA) (SIGGRAPH ’93). Association for Computing Machinery, New York, NY, USA, 73–80. https://doi.org/10.1145/166117.166126",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Alexey Bochkovskiy, Chien-Yao Wang, and Hong-Yuan Mark Liao. 2020. YOLOv4: Optimal Speed and Accuracy of Object Detection. https://doi.org/10.48550/ARXIV.2004.10934",
      "doi": ""
    },
    {
      "text": "Richard A. Bolt. 1980. “Put-That-There”: Voice and Gesture at the Graphics Interface. SIGGRAPH Comput. Graph. 14, 3 (July 1980), 262–270. https://doi.org/10.1145/965105.807503",
      "doi": "10.1145/965105.807503"
    },
    {
      "text": "Sebastian Boring, Dominikus Baur, Andreas Butz, Sean Gustafson, and Patrick Baudisch. 2010. Touch Projector: Mobile Interaction through Video. Association for Computing Machinery, New York, NY, USA, 2287–2296. https://doi.org/10.1145/1753326.1753671",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "John Brooke 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4–7.",
      "doi": ""
    },
    {
      "text": "Yuxuan Cai. 2020. YOLObile: Real-time object detection on mobile devices via compression-compilation co-design. Ph.D. Dissertation. Northeastern University.",
      "doi": ""
    },
    {
      "text": "Kaifei Chen, Jonathan Fürst, John Kolb, Hyung-Sin Kim, Xin Jin, David E. Culler, and Randy H. Katz. 2018. SnapLink: Fast and Accurate Vision-Based Appliance Control in Large Commercial Buildings. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 129 (Jan. 2018), 27 pages. https://doi.org/10.1145/3161173",
      "doi": "10.1145/3161173"
    },
    {
      "text": "Yifei Cheng, Yukang Yan, Xin Yi, Yuanchun Shi, and David Lindlbauer. 2021. SemanticAdapt: Optimization-Based Adaptation of Mixed Reality Layouts Leveraging Virtual-Physical Semantic Connections. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 282–297. https://doi.org/10.1145/3472749.3474750",
      "doi": "10.1145/3472749.3474750"
    },
    {
      "text": "Adrian A. de Freitas, Michael Nebeling, Xiang ’Anthony’ Chen, Junrui Yang, Akshaye Shreenithi Kirupa Karthikeyan Ranithangam, and Anind K. Dey. 2016. Snap-To-It: A User-Inspired Platform for Opportunistic Device Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5909–5920. https://doi.org/10.1145/2858036.2858177",
      "doi": "10.1145/2858036.2858177"
    },
    {
      "text": "William Delamare, Céline Coutrix, and Laurence Nigay. 2013. Mobile Pointing Task in the Physical World: Balancing Focus and Performance While Disambiguating. In Proceedings of the 15th International Conference on Human-Computer Interaction with Mobile Devices and Services (Munich, Germany) (MobileHCI ’13). Association for Computing Machinery, New York, NY, USA, 89–98. https://doi.org/10.1145/2493190.2493232",
      "doi": "10.1145/2493190.2493232"
    },
    {
      "text": "Kaiwen Duan, Song Bai, Lingxi Xie, Honggang Qi, Qingming Huang, and Qi Tian. 2019. Centernet: Keypoint triplets for object detection. In Proceedings of the IEEE/CVF International Conference on Computer Vision. IEEE, Piscataway, NJ, USA, 6569–6578.",
      "doi": ""
    },
    {
      "text": "Andrew Forsberg, Kenneth Herndon, and Robert Zeleznik. 1996. Aperture Based Selection for Immersive Virtual Environments. In Proceedings of the 9th Annual ACM Symposium on User Interface Software and Technology (Seattle, Washington, USA) (UIST ’96). Association for Computing Machinery, New York, NY, USA, 95–96. https://doi.org/10.1145/237091.237105",
      "doi": "10.1145/237091.237105"
    },
    {
      "text": "Ross Girshick. 2015. Fast r-cnn. In Proceedings of the IEEE international conference on computer vision. IEEE, Piscataway, NJ, USA, 1440–1448.",
      "doi": "10.1109/ICCV.2015.169"
    },
    {
      "text": "Taesik Gong, Hyunsung Cho, Bowon Lee, and Sung-Ju Lee. 2019. Knocker: Vibroacoustic-Based Object Recognition with Smartphones. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 3, Article 82 (sep 2019), 21 pages. https://doi.org/10.1145/3351240",
      "doi": "10.1145/3351240"
    },
    {
      "text": "Google. 2020. MediaPipe Iris. Website. https://google.github.io/mediapipe/solutions/iris.",
      "doi": ""
    },
    {
      "text": "Google. 2020. MediaPipe Iris: Real-time Iris Tracking & Depth Estimation. Website. https://ai.googleblog.com/2020/08/mediapipe-iris-real-time-iris-tracking.html.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2005. The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor’s Activation Area. Association for Computing Machinery, New York, NY, USA, 281–290. https://doi.org/10.1145/1054972.1055012",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2006. The Design and Evaluation of Selection Techniques for 3D Volumetric Displays. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology(Montreux, Switzerland) (UIST ’06). Association for Computing Machinery, New York, NY, USA, 3–12. https://doi.org/10.1145/1166253.1166257",
      "doi": "10.1145/1166253.1166257"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index) : Results of Empirical and Theoretical Research. Advances in Psychology 52, 6 (1988), 139–183.",
      "doi": ""
    },
    {
      "text": "Jeremy Hartmann and Daniel Vogel. 2018. An Evaluation of Mobile Phone Pointing in Spatial Augmented Reality. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188535",
      "doi": "10.1145/3170427.3188535"
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. A Survey of Design Issues in Spatial Input. In Proceedings of the 7th Annual ACM Symposium on User Interface Software and Technology (Marina del Rey, California, USA) (UIST ’94). Association for Computing Machinery, New York, NY, USA, 213–222. https://doi.org/10.1145/192426.192501",
      "doi": "10.1145/192426.192501"
    },
    {
      "text": "Rachel Huang, Jonathan Pedoeem, and Cuixian Chen. 2018. YOLO-LITE: A Real-Time Object Detection Algorithm Optimized for Non-GPU Computers. In 2018 IEEE International Conference on Big Data (Big Data). IEEE, Piscataway, NJ, USA, 2503–2510. https://doi.org/10.1109/BigData.2018.8621865",
      "doi": ""
    },
    {
      "text": "Ltd. Huawei Device Co.2021. This Button Can Do More Things Than Expected. Website. https://consumer.huawei.com/za/support/article-list/article-detail/en-us15759678/.",
      "doi": ""
    },
    {
      "text": "Runchang Kang, Anhong Guo, Gierad Laput, Yang Li, and Xiang ’Anthony’ Chen. 2019. Minuet: Multimodal Interaction with an Internet of Things. In Symposium on Spatial User Interaction(New Orleans, LA, USA) (SUI ’19). Association for Computing Machinery, New York, NY, USA, Article 2, 10 pages. https://doi.org/10.1145/3357251.3357581",
      "doi": "10.1145/3357251.3357581"
    },
    {
      "text": "Mohamed Khamis, Florian Alt, and Andreas Bulling. 2018. The Past, Present, and Future of Gaze-Enabled Handheld Mobile Devices: Survey and Lessons Learned. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 38, 17 pages. https://doi.org/10.1145/3229434.3229452",
      "doi": "10.1145/3229434.3229452"
    },
    {
      "text": "Mikko Kytö, Barrett Ens, Thammathip Piumsomboon, Gun A. Lee, and Mark Billinghurst. 2018. Pinpointing: Precise Head- and Eye-Based Target Selection for Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173655",
      "doi": "10.1145/3173574.3173655"
    },
    {
      "text": "Cha Lee, Scott Bonebrake, Tobias Hollerer, and Doug A. Bowman. 2009. A replication study testing the validity of AR simulation in VR for controlled experiments. In 2009 8th IEEE International Symposium on Mixed and Augmented Reality. IEEE, Piscataway, NJ, USA, 203–204. https://doi.org/10.1109/ISMAR.2009.5336464",
      "doi": "10.1109/ISMAR.2009.5336464"
    },
    {
      "text": "SangYoon Lee, Jinseok Seo, Gerard Jounghyun Kim, and Chan-Mo Park. 2003. Evaluation of pointing techniques for ray casting selection in virtual environments. In Third International Conference on Virtual Reality and Its Application in Industry, Zhigeng Pan and Jiaoying Shi (Eds.). Vol. 4756. International Society for Optics and Photonics, SPIE, Bellingham, WA, USA, 38 – 44. https://doi.org/10.1117/12.497665",
      "doi": ""
    },
    {
      "text": "Jiandong Liang and Mark Green. 1993. Geometric modeling using six degrees of freedom input devices., 217–222 pages.",
      "doi": ""
    },
    {
      "text": "Tsung-Yi Lin, Piotr Dollár, Ross Girshick, Kaiming He, Bharath Hariharan, and Serge Belongie. 2017. Feature pyramid networks for object detection. In Proceedings of the IEEE conference on computer vision and pattern recognition. IEEE, Piscataway, NJ, USA, 2117–2125.",
      "doi": ""
    },
    {
      "text": "Julian Looser, Mark Billinghurst, and Andy Cockburn. 2004. Through the Looking Glass: The Use of Lenses as an Interface Tool for Augmented Reality Interfaces. In Proceedings of the 2nd International Conference on Computer Graphics and Interactive Techniques in Australasia and South East Asia (Singapore) (GRAPHITE ’04). Association for Computing Machinery, New York, NY, USA, 204–211. https://doi.org/10.1145/988834.988870",
      "doi": "10.1145/988834.988870"
    },
    {
      "text": "Julian Looser, Mark Billinghurst, Raphaël Grasset, and Andy Cockburn. 2007. An Evaluation of Virtual Lenses for Object Selection in Augmented Reality. In Proceedings of the 5th International Conference on Computer Graphics and Interactive Techniques in Australia and Southeast Asia (Perth, Australia) (GRAPHITE ’07). Association for Computing Machinery, New York, NY, USA, 203–210. https://doi.org/10.1145/1321261.1321297",
      "doi": "10.1145/1321261.1321297"
    },
    {
      "text": "Yiqin Lu, Chun Yu, and Yuanchun Shi. 2020. Investigating bubble mechanism for ray-casting to improve 3d target acquisition in virtual reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Piscataway, NJ, USA, 35–43.",
      "doi": ""
    },
    {
      "text": "Diako Mardanbegi, Benedikt Mayer, Ken Pfeuffer, Shahram Jalaliniya, Hans Gellersen, and Alexander Perzl. 2019. EyeSeeThrough: Unifying Tool Selection and Application in Virtual Environments. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Piscataway, NJ, USA, 474–483. https://doi.org/10.1109/VR.2019.8797988",
      "doi": ""
    },
    {
      "text": "Sven Mayer, Gierad Laput, and Chris Harrison. 2020. Enhancing Mobile Voice Assistants with WorldGaze. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376479",
      "doi": "10.1145/3313831.3376479"
    },
    {
      "text": "Sven Mayer, Valentin Schwind, Robin Schweigert, and Niels Henze. 2018. The Effect of Offset Correction and Cursor on Mid-Air Pointing in Real and Virtual Environments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174227",
      "doi": "10.1145/3173574.3174227"
    },
    {
      "text": "Sven Mayer, Katrin Wolf, Stefan Schneegass, and Niels Henze. 2015. Modeling Distant Pointing for Compensating Systematic Displacements. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 4165–4168. https://doi.org/10.1145/2702123.2702332",
      "doi": "10.1145/2702123.2702332"
    },
    {
      "text": "Mark R Mine. 1995. Virtual environment interaction techniques.",
      "doi": ""
    },
    {
      "text": "Kai Nickel and Rainer Stiefelhagen. 2003. Pointing Gesture Recognition Based on 3D-Tracking of Face, Hands and Head Orientation. In Proceedings of the 5th International Conference on Multimodal Interfaces (Vancouver, British Columbia, Canada) (ICMI ’03). Association for Computing Machinery, New York, NY, USA, 140–146. https://doi.org/10.1145/958432.958460",
      "doi": "10.1145/958432.958460"
    },
    {
      "text": "Dan R. Olsen and Travis Nielsen. 2001. Laser Pointer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, USA) (CHI ’01). Association for Computing Machinery, New York, NY, USA, 17–22. https://doi.org/10.1145/365024.365030",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "Jeffrey S. Pierce, Andrew S. Forsberg, Matthew J. Conway, Seung Hong, Robert C. Zeleznik, and Mark R. Mine. 1997. Image Plane Interaction Techniques in 3D Immersive Environments. In Proceedings of the 1997 Symposium on Interactive 3D Graphics (Providence, Rhode Island, USA) (I3D ’97). Association for Computing Machinery, New York, NY, USA, 39–ff.https://doi.org/10.1145/253284.253303",
      "doi": "10.1145/253284.253303"
    },
    {
      "text": "Yue Qin, Chun Yu, Zhaoheng Li, Mingyuan Zhong, Yukang Yan, and Yuanchun Shi. 2021. ProxiMic: Convenient Voice Activation via Close-to-Mic Speech Detected by a Single Microphone. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 8, 12 pages. https://doi.org/10.1145/3411764.3445687",
      "doi": "10.1145/3411764.3445687"
    },
    {
      "text": "Joseph Redmon, Santosh Divvala, Ross Girshick, and Ali Farhadi. 2016. You only look once: Unified, real-time object detection. In Proceedings of the IEEE conference on computer vision and pattern recognition. IEEE, Piscataway, NJ, USA, 779–788.",
      "doi": ""
    },
    {
      "text": "Jie Ren, Yueting Weng, Chengchi Zhou, Chun Yu, and Yuanchun Shi. 2020. Understanding Window Management Interactions in AR Headset + Smartphone Interface. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382812",
      "doi": "10.1145/3334480.3382812"
    },
    {
      "text": "Shaoqing Ren, Kaiming He, Ross Girshick, and Jian Sun. 2015. Faster r-cnn: Towards real-time object detection with region proposal networks. Advances in neural information processing systems 28 (2015), 91–99.",
      "doi": ""
    },
    {
      "text": "Michael Rohs and Antti Oulasvirta. 2008. Target Acquisition with Camera Phones When Used as Magic Lenses. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1409–1418. https://doi.org/10.1145/1357054.1357275",
      "doi": "10.1145/1357054.1357275"
    },
    {
      "text": "Michael Rohs, Antti Oulasvirta, and Tiia Suomalainen. 2011. Interaction with Magic Lenses: Real-World Validation of a Fitts’ Law Model. Association for Computing Machinery, New York, NY, USA, 2725–2728. https://doi.org/10.1145/1978942.1979343",
      "doi": "10.1145/1978942.1979343"
    },
    {
      "text": "Robin Schweigert, Valentin Schwind, and Sven Mayer. 2019. EyePointing: A Gaze-Based Selection Technique. In Proceedings of Mensch Und Computer 2019 (Hamburg, Germany) (MuC’19). Association for Computing Machinery, New York, NY, USA, 719–723. https://doi.org/10.1145/3340764.3344897",
      "doi": "10.1145/3340764.3344897"
    },
    {
      "text": "Ke Sun, Chun Yu, and Yuanchun Shi. 2019. Exploring Low-Occlusion Qwerty Soft Keyboard Using Spatial Landmarks. ACM Trans. Comput.-Hum. Interact. 26, 4, Article 20 (June 2019), 33 pages. https://doi.org/10.1145/3318141",
      "doi": "10.1145/3318141"
    },
    {
      "text": "Yuko Unuma, Takehiro Niikura, and Takashi Komuro. 2014. See-through Mobile AR System for Natural 3D Interaction. In Proceedings of the Companion Publication of the 19th International Conference on Intelligent User Interfaces (Haifa, Israel) (IUI Companion ’14). Association for Computing Machinery, New York, NY, USA, 17–20. https://doi.org/10.1145/2559184.2559198",
      "doi": "10.1145/2559184.2559198"
    },
    {
      "text": "Pasi Välkkynen, Marketta Niemelä, and Timo Tuomisto. 2006. Evaluating Touching and Pointing with a Mobile Terminal for Physical Browsing. In Proceedings of the 4th Nordic Conference on Human-Computer Interaction: Changing Roles(Oslo, Norway) (NordiCHI ’06). Association for Computing Machinery, New York, NY, USA, 28–37. https://doi.org/10.1145/1182475.1182479",
      "doi": "10.1145/1182475.1182479"
    },
    {
      "text": "Klen Čopič Pucihar, Paul Coulton, and Jason Alexander. 2013. Evaluating Dual-View Perceptual Issues in Handheld Augmented Reality: Device vs. User Perspective Rendering. In Proceedings of the 15th ACM on International Conference on Multimodal Interaction (Sydney, Australia) (ICMI ’13). Association for Computing Machinery, New York, NY, USA, 381–388. https://doi.org/10.1145/2522848.2522885",
      "doi": "10.1145/2522848.2522885"
    },
    {
      "text": "John Viega, Matthew J. Conway, George Williams, and Randy Pausch. 1996. 3D Magic Lenses. In Proceedings of the 9th Annual ACM Symposium on User Interface Software and Technology (Seattle, Washington, USA) (UIST ’96). Association for Computing Machinery, New York, NY, USA, 51–58. https://doi.org/10.1145/237091.237098",
      "doi": "10.1145/237091.237098"
    },
    {
      "text": "Thomas Vincent, Laurence Nigay, and Takeshi Kurata. 2013. Precise Pointing Techniques for Handheld Augmented Reality. In Human-Computer Interaction – INTERACT 2013, Paula Kotzé, Gary Marsden, Gitte Lindgaard, Janet Wesson, and Marco Winckler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 122–139.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Robert Xiao, Gierad Laput, Yang Zhang, and Chris Harrison. 2017. Deus EM Machina: On-Touch Contextual Functionality for Smart IoT Appliances. Association for Computing Machinery, New York, NY, USA, 4000–4008. https://doi.org/10.1145/3025453.3025828",
      "doi": "10.1145/3025453.3025828"
    },
    {
      "text": "Yukang Yan, Yingtian Shi, Chun Yu, and Yuanchun Shi. 2020. HeadCross: Exploring Head-Based Crossing Selection on Head-Mounted Displays. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1, Article 35 (March 2020), 22 pages. https://doi.org/10.1145/3380983",
      "doi": "10.1145/3380983"
    },
    {
      "text": "Yukang Yan, Chun Yu, Yingtian Shi, and Minxing Xie. 2019. PrivateTalk: Activating Voice Input with Hand-On-Mouth Gesture Detected by Bluetooth Earphones. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1013–1020. https://doi.org/10.1145/3332165.3347950",
      "doi": "10.1145/3332165.3347950"
    },
    {
      "text": "Zhican Yang, Chun Yu, Fengshi Zheng, and Yuanchun Shi. 2019. ProxiTalk: Activate Speech Input by Bringing Smartphone to the Mouth. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 3, Article 118 (Sept. 2019), 25 pages. https://doi.org/10.1145/3351276",
      "doi": "10.1145/3351276"
    },
    {
      "text": "Jibin Yin, Chengyao Fu, Xiangliang Zhang, and Tao Liu. 2019. Precise Target Selection Techniques in Handheld Augmented Reality Interfaces. IEEE Access 7(2019), 17663–17674. https://doi.org/10.1109/ACCESS.2019.2895219",
      "doi": ""
    },
    {
      "text": "Shumin Zhai, Carlos Morimoto, and Steven Ihde. 1999. Manual and Gaze Input Cascaded (MAGIC) Pointing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Pittsburgh, Pennsylvania, USA) (CHI ’99). Association for Computing Machinery, New York, NY, USA, 246–253. https://doi.org/10.1145/302979.303053",
      "doi": "10.1145/302979.303053"
    },
    {
      "text": "Ben Zhang, Yu-Hsiang Chen, Claire Tuna, Achal Dave, Yang Li, Edward Lee, and Björn Hartmann. 2014. HOBS: Head Orientation-Based Selection in Physical Spaces. In Proceedings of the 2nd ACM Symposium on Spatial User Interaction (Honolulu, Hawaii, USA) (SUI ’14). Association for Computing Machinery, New York, NY, USA, 17–25. https://doi.org/10.1145/2659766.2659773",
      "doi": "10.1145/2659766.2659773"
    }
  ]
}