{
  "doi": "10.1145/3544548.3580808",
  "title": "Visual Belief Elicitation Reduces the Incidence of False Discovery",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Visualization supports exploratory data analysis (EDA), but EDA frequently presents spurious charts, which can mislead people into drawing unwarranted conclusions. We investigate interventions to prevent false discovery from visualized data. We evaluate whether eliciting analyst beliefs helps guard against the over-interpretation of noisy visualizations. In two experiments, we exposed participants to both spurious and ‘true’ scatterplots, and assessed their ability to infer data-generating models that underlie those samples. Participants who underwent prior belief elicitation made 21% more correct inferences along with 12% fewer false discoveries. This benefit was observed across a variety of sample characteristics, suggesting broad utility to the intervention. However, additional interventions to highlight counterevidence and sample uncertainty did not provide significant advantage. Our findings suggest that lightweight, belief-driven interactions can yield a reliable, if moderate, reduction in false discovery. This work also suggests future directions to improve visual inference and reduce bias.",
  "authors": [
    {
      "name": "Ratanond Koonchanok",
      "institution": "Indiana University-Purdue University Indianapolis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702620",
      "orcid": "0000-0002-8860-6183"
    },
    {
      "name": "Gauri Yatindra Tawde",
      "institution": "Indiana University-Purdue University Indianapolis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659536920",
      "orcid": "0000-0001-8813-8327"
    },
    {
      "name": "Gokul Ragunandhan Narayanasamy",
      "institution": "Indiana University-Purdue University Indianapolis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781979",
      "orcid": "0000-0002-4117-7772"
    },
    {
      "name": "Shalmali Walimbe",
      "institution": "Indiana University-Purdue University Indianapolis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781794",
      "orcid": "0000-0002-0930-4233"
    },
    {
      "name": "Khairi Reda",
      "institution": "Indiana University-Purdue University Indianapolis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81552730756",
      "orcid": "0000-0002-8096-658X"
    }
  ],
  "references": [
    {
      "text": "Andrew D Althouse. 2016. Adjust for multiple comparisons? It’s not that simple. The Annals of Thoracic Surgery 101, 5 (2016), 1644–1645.",
      "doi": ""
    },
    {
      "text": "Leilani Battle and Jeffrey Heer. 2019. Characterizing exploratory visual analysis: A literature review and evaluation of analytic provenance in tableau. In Computer Graphics Forum, Vol. 38. Wiley Online Library, 145–159.",
      "doi": ""
    },
    {
      "text": "Roger Beecham, Jason Dykes, Wouter Meulemans, Aidan Slingsby, Cagatay Turkay, and Jo Wood. 2016. Map lineups: effects of spatial structure on graphical inference. IEEE Transactions on Visualization and Computer Graphics 23, 1(2016), 391–400.",
      "doi": "10.1109/TVCG.2016.2598862"
    },
    {
      "text": "Sarah Belia, Fiona Fidler, Jennifer Williams, and Geoff Cumming. 2005. Researchers misunderstand confidence intervals and standard error bars.Psychological Methods 10, 4 (2005), 389.",
      "doi": ""
    },
    {
      "text": "Daniel J Benjamin, Matthew Rabin, and Collin Raymond. 2016. A model of nonbelief in the law of large numbers. Journal of the European Economic Association 14, 2(2016), 515–544.",
      "doi": ""
    },
    {
      "text": "Yoav Benjamini and Yosef Hochberg. 1995. Controlling the false discovery rate: a practical and powerful approach to multiple testing. Journal of the Royal Statistical Society: series B (Methodological) 57, 1(1995), 289–300.",
      "doi": ""
    },
    {
      "text": "Kiran Bisra, Qing Liu, John C Nesbit, Farimah Salimi, and Philip H Winne. 2018. Inducing self-explanation: A meta-analysis. Educational Psychology Review 30, 3 (2018), 703–725.",
      "doi": ""
    },
    {
      "text": "Larry Buchanan, Haeyoun Park, and Adam Pearce. 2017. You draw it: What got better or worse during Obama’s presidency. The New York Times 15(2017).",
      "doi": ""
    },
    {
      "text": "Andreas Buja, Dianne Cook, Heike Hofmann, Michael Lawrence, Eun-Kyung Lee, Deborah F Swayne, and Hadley Wickham. 2009. Statistical inference for exploratory data analysis and model diagnostics. Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences 367, 1906 (2009), 4361–4383.",
      "doi": ""
    },
    {
      "text": "Andreas Buja, Catherine Hurley, and Johnalan McDonald. 1987. A data viewer for multivariate data. In Colorado State Univ, Computer Science and Statistics. Proceedings of the 18 th Symposium on the Interface p 171-174(SEE N 89-13901 05-60).",
      "doi": ""
    },
    {
      "text": "Stuart Card, Jock Mackinlay, and Ben Shneiderman. 1999. Readings in information visualization: using vision to think. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Peter Cassey, Guy E Hawkins, Chris Donkin, and Scott D Brown. 2016. Using alien coins to test whether simple inference is Bayesian.Journal of Experimental Psychology: Learning, Memory, and Cognition 42, 3(2016), 497.",
      "doi": ""
    },
    {
      "text": "In Kwon Choi, Taylor Childers, Nirmal Kumar Raveendranath, Swati Mishra, Kyle Harris, and Khairi Reda. 2019. Concept-driven visual analytics: an exploratory study of model-and hypothesis-based reasoning with visualizations. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300298"
    },
    {
      "text": "In Kwon Choi, Nirmal Kumar Raveendranath, Jared Westerfield, and Khairi Reda. 2019. Visual (dis)confirmation: Validating models and hypotheses with visualizations. In 2019 23rd International Conference in Information Visualization–Part II. IEEE, 116–121.",
      "doi": ""
    },
    {
      "text": "Dianne Cook, Nancy Reid, and Emi Tanaka. 2021. The foundation is available for thinking about data visualization inferentially. (2021).",
      "doi": ""
    },
    {
      "text": "Geoff Cumming. 2014. The new statistics: Why and how. Psychological Science 25, 1 (2014), 7–29.",
      "doi": ""
    },
    {
      "text": "Pedram Daee, Tomi Peltola, Aki Vehtari, and Samuel Kaski. 2018. User modelling for avoiding overfitting in interactive knowledge elicitation for prediction. In 23rd International Conference on Intelligent User Interfaces. 305–310.",
      "doi": "10.1145/3172944.3172989"
    },
    {
      "text": "Kevin Dunbar. 2001. What scientific thinking reveals about the nature of cognition. Designing for science: Implications from everyday, classroom, and professional settings (2001), 115–140.",
      "doi": ""
    },
    {
      "text": "Mi Feng, Evan Peck, and Lane Harrison. 2018. Patterns and pace: Quantifying diverse exploration behavior with visualizations on the web. IEEE Transactions on Visualization and Computer Graphics 25, 1(2018), 501–511.",
      "doi": "10.1109/TVCG.2018.2865117"
    },
    {
      "text": "Andrew Gelman. 2003. A Bayesian formulation of exploratory data analysis and goodness-of-fit testing. International Statistical Review 71, 2 (2003), 369–382.",
      "doi": ""
    },
    {
      "text": "David Robert Grimes, Chris T Bauch, and John PA Ioannidis. 2018. Modelling science trustworthiness under publish or perish pressure. Royal Society Open Science 5, 1 (2018), 171511.",
      "doi": ""
    },
    {
      "text": "Vida Groznik, Matej Guid, Aleksander Sadikov, Martin Možina, Dejan Georgiev, Veronika Kragelj, Samo Ribarič, Zvezdan Pirtošek, and Ivan Bratko. 2013. Elicitation of neurological knowledge with argument-based machine learning. Artificial Intelligence in Medicine 57, 2 (2013), 133–144.",
      "doi": "10.1016/j.artmed.2012.08.003"
    },
    {
      "text": "Megan L Head, Luke Holman, Rob Lanfear, Andrew T Kahn, and Michael D Jennions. 2015. The extent and consequences of p-hacking in science. PLoS biology 13, 3 (2015), e1002106.",
      "doi": ""
    },
    {
      "text": "Jeremy Heyer, Nirmal Kumar Raveendranath, and Khairi Reda. 2020. Pushing the (visual) narrative: the effects of prior knowledge elicitation in provocative topics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376887"
    },
    {
      "text": "Jessica Hullman and Andrew Gelman. 2021. Designing for Interactive Exploratory Data Analysis Requires Theories of Graphical Inference. Harvard Data Science Review 3, 3 (jul 30 2021). https://hdsr.mitpress.mit.edu/pub/w075glo6.",
      "doi": ""
    },
    {
      "text": "John PA Ioannidis. 2005. Why most published research findings are false. PLoS medicine 2, 8 (2005), e124.",
      "doi": ""
    },
    {
      "text": "Robert M Kaplan and Veronica L Irvin. 2015. Likelihood of null effects of large NHLBI clinical trials has increased over time. PloS one 10, 8 (2015), e0132382.",
      "doi": ""
    },
    {
      "text": "Alireza Karduni, Douglas Markant, Ryan Wesslen, and Wenwen Dou. 2020. A Bayesian cognition approach for belief updating of correlation judgement through uncertainty visualizations. 27, 2 (2020), 978–988.",
      "doi": ""
    },
    {
      "text": "Norbert L Kerr. 1998. HARKing: Hypothesizing after the results are known. Personality and Social Psychology Review 2, 3 (1998), 196–217.",
      "doi": ""
    },
    {
      "text": "Ava Kiai. 2019. To protect credibility in science, banish “publish or perish”. Nature human behaviour 3, 10 (2019), 1017–1018.",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Paula Kayongo, Madeleine Grunde-McLaughlin, and Jessica Hullman. 2020. Bayesian-assisted inference from visualized data. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 989–999.",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Katharina Reinecke, and Jessica Hullman. 2017. Explaining the gap: Visualizing one’s predictions improves recall and comprehension of data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1375–1386.",
      "doi": "10.1145/3025453.3025592"
    },
    {
      "text": "David Klahr and Kevin Dunbar. 1988. Dual space search during scientific reasoning. Cognitive science 12, 1 (1988), 1–48.",
      "doi": ""
    },
    {
      "text": "Gary Klein, Brian Moon, and Robert R Hoffman. 2006. Making sense of sensemaking 2: A macrocognitive model. IEEE Intelligent systems 21, 5 (2006), 88–92.",
      "doi": ""
    },
    {
      "text": "Gary Klein, Jennifer K Phillips, Erica L Rall, and Deborah A Peluso. 2007. A data-frame theory of sensemaking. In Expertise out of context: Proceedings of the 6th International Conference on Naturalistic Decision Making, Vol. 113. Lawrence Erlbaum Associates New York.",
      "doi": ""
    },
    {
      "text": "Ratanond Koonchanok, Parul Baser, Abhinav Sikharam, Nirmal Kumar Raveendranath, and Khairi Reda. 2021. Data prophecy: Exploring the effects of belief elicitation in visual analytics. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445798"
    },
    {
      "text": "Zhicheng Liu and Jeffrey Heer. 2014. The effects of interactive latency on exploratory visual analysis. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 2122–2131.",
      "doi": ""
    },
    {
      "text": "Jennifer M Logg and Charles A Dorison. 2021. Pre-registration: Weighing costs and benefits for researchers. Organizational Behavior and Human Decision Processes 167 (2021), 18–27.",
      "doi": ""
    },
    {
      "text": "Richard Lowry. 2014. Concepts and Applications of Inferential Statistics.",
      "doi": ""
    },
    {
      "text": "Shambhavi Mahajan, Bonnie Chen, Alireza Karduni, Yea-Seul Kim, and Emily Wall. 2022. VIBE: A Design Space for VIsual Belief Elicitation in Data Journalism. In Computer Graphics Forum, Vol. 41. Wiley Online Library, 477–488.",
      "doi": ""
    },
    {
      "text": "Mahbubul Majumder, Heike Hofmann, and Dianne Cook. 2013. Validation of visual statistical inference, applied to linear models. J. Amer. Statist. Assoc. 108, 503 (2013), 942–956.",
      "doi": ""
    },
    {
      "text": "Mary L McHugh. 2012. Interrater reliability: the kappa statistic. Biochemia medica 22, 3 (2012), 276–282.",
      "doi": ""
    },
    {
      "text": "Marcus R Munafò, Brian A Nosek, Dorothy VM Bishop, Katherine S Button, Christopher D Chambers, Nathalie Percie du Sert, Uri Simonsohn, Eric-Jan Wagenmakers, Jennifer J Ware, and John Ioannidis. 2017. A manifesto for reproducible science. Nature human behaviour 1, 1 (2017), 1–9.",
      "doi": ""
    },
    {
      "text": "Chris North, Purvi Saraiya, and Karen Duca. 2011. A comparison of benchmark task and insight evaluation methods for information visualization. Information Visualization 10, 3 (2011), 162–181.",
      "doi": "10.1177/1473871611415989"
    },
    {
      "text": "Brian A Nosek, Emorie D Beck, Lorne Campbell, Jessica K Flake, Tom E Hardwicke, David T Mellor, Anna E van’t Veer, and Simine Vazire. 2019. Preregistration is hard, and worthwhile. Trends in cognitive sciences 23, 10 (2019), 815–818.",
      "doi": ""
    },
    {
      "text": "Brian A Nosek, Charles R Ebersole, Alexander C DeHaven, and David T Mellor. 2018. The preregistration revolution. Proceedings of the National Academy of Sciences 115, 11(2018), 2600–2606.",
      "doi": ""
    },
    {
      "text": "Joseph P Simmons, Leif D Nelson, and Uri Simonsohn. 2021. Pre-registration: Why and how. Journal of Consumer Psychology 31, 1 (2021), 151–162.",
      "doi": ""
    },
    {
      "text": "Xiaoying Pu and Matthew Kay. 2018. The garden of forking paths in visualization: A design space for reliable exploratory visual analytics: Position paper. In 2018 IEEE Evaluation and Beyond-Methodological Approaches for Visualization (BELIV). IEEE, 37–45.",
      "doi": ""
    },
    {
      "text": "Khairi Reda, Andrew E Johnson, Michael E Papka, and Jason Leigh. 2015. Effects of display size and resolution on user behavior and insight acquisition in visual exploration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2759–2768.",
      "doi": "10.1145/2702123.2702406"
    },
    {
      "text": "Khairi Reda, Andrew E Johnson, Michael E Papka, and Jason Leigh. 2016. Modeling and evaluating user behavior in exploratory visual analysis. Information Visualization 15, 4 (2016), 325–339.",
      "doi": ""
    },
    {
      "text": "Bethany Rittle-Johnson and Abbey M Loehr. 2017. Eliciting explanations: Constraints on when self-explanation aids learning. Psychonomic Bulletin & Review 24, 5 (2017), 1501–1510.",
      "doi": ""
    },
    {
      "text": "Purvi Saraiya, Chris North, and Karen Duca. 2005. An insight-based methodology for evaluating bioinformatics visualizations. IEEE Transactions on Visualization and Computer Graphics 11, 4(2005), 443–456.",
      "doi": "10.1109/TVCG.2005.53"
    },
    {
      "text": "Rafael Savvides, Andreas Henelius, Emilia Oikarinen, and Kai Puolamäki. 2019. Significance of patterns in data visualisations. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. 1509–1517.",
      "doi": "10.1145/3292500.3330994"
    },
    {
      "text": "Rafael Savvides, Andreas Henelius, Emilia Oikarinen, and Kai Puolamaki. 2022. Visual Data Exploration as a Statistical Testing Procedure: Within-view and Between-view Multiple Comparisons. IEEE Transactions on Visualization and Computer Graphics (2022).",
      "doi": ""
    },
    {
      "text": "Sean Tauber, Daniel J Navarro, Amy Perfors, and Mark Steyvers. 2017. Bayesian models of cognition revisited: Setting optimality aside and letting data drive psychological theory.Psychological Review 124, 4 (2017), 410.",
      "doi": ""
    },
    {
      "text": "James J Thomas and Kristin A Cook. 2006. A visual analytics agenda. IEEE Computer Graphics and Applications 26, 1 (2006), 10–13.",
      "doi": "10.1109/MCG.2006.5"
    },
    {
      "text": "John W Tukey. 1977. Exploratory data analysis. Vol. 2. Reading, MA.",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1971. Belief in the law of small numbers.Psychological Bulletin 76, 2 (1971), 105.",
      "doi": ""
    },
    {
      "text": "Kurt VanLehn, Randolph M Jones, and Michelene TH Chi. 1992. A model of the self-explanation effect. The Journal of the Learning Sciences 2, 1 (1992), 1–59.",
      "doi": ""
    },
    {
      "text": "Tyler Vigen. 2015. Spurious correlations. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Leland Wilkinson, Anushka Anand, and Robert Grossman. 2005. Graph-theoretic scagnostics. In Information Visualization, IEEE Symposium on. IEEE Computer Society, 21–21.",
      "doi": ""
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2015. Voyager: Exploratory analysis via faceted browsing of visualization recommendations. IEEE Transactions on Visualization and Computer Graphics 22, 1(2015), 649–658.",
      "doi": "10.1109/TVCG.2015.2467191"
    },
    {
      "text": "Yuki Yamada. 2018. How to crack pre-registration: Toward transparent and open science. Frontiers in Psychology 9 (2018), 1831.",
      "doi": ""
    },
    {
      "text": "Itai Yanai and Martin Lercher. 2020. A hypothesis is a liability. Genome Biology 21, 1 (2020), 1–5.",
      "doi": ""
    },
    {
      "text": "Emanuel Zgraggen, Zheguang Zhao, Robert Zeleznik, and Tim Kraska. 2018. Investigating the effect of the multiple comparisons problem in visual analysis. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174053"
    },
    {
      "text": "Zheguang Zhao, Lorenzo De Stefani, Emanuel Zgraggen, Carsten Binnig, Eli Upfal, and Tim Kraska. 2017. Controlling false discoveries during interactive data exploration. In Proceedings of the 2017 ACM International Conference on Management of Data. 527–540.",
      "doi": "10.1145/3035918.3064019"
    }
  ]
}