{
  "doi": "10.1145/3544548.3581182",
  "title": "Meeting Your Virtual Twin: Effects of Photorealism and Personalization on Embodiment, Self-Identification and Perception of Self-Avatars in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Embodying virtual twins – photorealistic and personalized avatars – will soon be easily achievable in consumer-grade VR. For the first time, we explored how photorealism and personalization impact self-identification, as well as embodiment, avatar perception and presence. Twenty participants were individually scanned and, in a two-hour session, embodied four avatars (high photorealism personalized, low photorealism personalized, high photorealism generic, low photorealism generic). Questionnaire responses revealed stronger mid-immersion body ownership for the high photorealism personalized avatars compared to all other avatar types, and stronger embodiment for high photorealism compared to low photorealism avatars and for personalized compared to generic avatars. In a self-other face distinction task, participants took significantly longer to pause the face morphing videos of high photorealism personalized avatars, suggesting a stronger self-identification bias with these avatars. Photorealism and personalization were perceptually positive features; how employing these avatars in VR applications impacts users over time requires longitudinal investigation.",
  "tags": [
    "photorealism",
    "virtual reality",
    "personalization",
    "self-identification"
  ],
  "authors": [
    {
      "name": "Anca Salagean",
      "institution": "Department of Psychology, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659925259",
      "orcid": "0000-0001-9465-1223"
    },
    {
      "name": "Eleanor Crellin",
      "institution": "The Centre for the Analysis of Motion, Entertainment Research and Applications (CAMERA), University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659909099",
      "orcid": "0000-0001-9407-4868"
    },
    {
      "name": "Martin Parsons",
      "institution": "The Centre for the Analysis of Motion, Entertainment Research and Applications (CAMERA), University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659909136",
      "orcid": "0000-0002-4197-6857"
    },
    {
      "name": "Darren Cosker",
      "institution": "Microsoft Research, United Kingdom and The Centre for the Analysis of Motion, Entertainment Research and Applications (CAMERA), University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100369482",
      "orcid": "0000-0001-5177-4741"
    },
    {
      "name": "Danaë Stanton Fraser",
      "institution": "Department of Psychology, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436596733",
      "orcid": "0000-0002-3062-731X"
    }
  ],
  "references": [
    {
      "text": "Jascha Achenbach, Thomas Waltemate, Marc Erich Latoschik, and Mario Botsch. 2017. Fast generation of realistic virtual humans. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (VRST '17). Association for Computing Machinery, New York, NY, USA, Article 12, 1–10. https://doi.org/10.1145/3139131.3139154",
      "doi": "10.1145/3139131.3139154"
    },
    {
      "text": "K. Carrie Armel and Vilayanur S. Ramachandran. 2003. Projecting sensations to external objects: evidence from skin conductance response. Proceedings of the Royal Society of London. Series B: Biological Sciences 270, 1523 (July 2003), 1499-1506. https://doi.org/10.1098/rspb.2003.2364",
      "doi": ""
    },
    {
      "text": "Laura Aymerich-Franch and Jeremy N. Bailenson. 2014. The use of doppelgangers in virtual reality to treat public speaking anxiety: a gender comparison. In Proceedings of the International Society for Presence Research Annual Conference, March 17-19, 2014, Vienna, Austria. Citeseer, 173-186.",
      "doi": ""
    },
    {
      "text": "Laura Aymerich-Franch, René F Kizilcec, and Jeremy N. Bailenson. 2014. The relationship between virtual self similarity and social anxiety. Frontiers in Human Neuroscience, 8 (Nov. 2014), 944. https://doi.org/10.3389/fnhum.2014.00944",
      "doi": ""
    },
    {
      "text": "Domna Banakou, Sameer Kishore, and Mel Slater. 2018. Virtually being Einstein results in an improvement in cognitive task performance and a decrease in age bias. Frontiers in Psychology, 9 (June 2018), 917. https://doi.org/10.3389/fpsyg.2018.00917",
      "doi": ""
    },
    {
      "text": "Andrea Bartl, Stephan Wenninger, Erik Wolf, Mario Botsch, and Marc Erich Latoschik. 2021. Affordable but not cheap: A case study of the effects of two 3D-reconstruction methods of virtual humans. Frontiers in Virtual Reality, 2 (Sept. 2021), 18. https://doi.org/10.3389/frvir.2021.694617",
      "doi": ""
    },
    {
      "text": "María J. Blanca, Rafael Alarcón, Jaume Arnau, Roser Bono, and Rebecca Bendayan. 2017. Non-normal data: Is ANOVA still a valid option? Psicothema 29, 4 (June 2017), 552–557. https://10.7334/psicothema2016.383",
      "doi": ""
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands “feel” touch that eyes see. Nature 391, 6669 (Feb. 1998), 756. https://10.1038/35784",
      "doi": ""
    },
    {
      "text": "Jason J. Braithwaite, Derrick G. Watson, Robert Jones, and Mickey Rowe. 2015. A guide for analysing electrodermal activity (EDA) & skin conductance responses (SCRs) for psychological experiments. Psychophysiology 49, 1 (2015), 1017–1034.",
      "doi": ""
    },
    {
      "text": "Dan Casas, Oleg Alexander, Andrew W. Feng, Graham Fyffe, Ryosuke Ichikari, Paul Debevec, Rhuizhe Wang, Evan Suma, and Ari Shapiro. 2015. Rapid photorealistic blendshapes from commodity RGB-D sensors. In Proceedings of the 19th Symposium on Interactive 3D Graphics and Games (i3D '15). Association for Computing Machinery, New York, NY, USA, 134. https://doi.org/10.1145/2699276.2721398",
      "doi": "10.1145/2699276.2721398"
    },
    {
      "text": "Anya Chakraborty and Bhismadev Chakrabarti. 2018. Looking at my own face: Visual processing strategies in self–other face recognition. Frontiers in Psychology, 9 (Feb. 2018), 121. https://10.3389/fpsyg.2018.00121.",
      "doi": ""
    },
    {
      "text": "Michael E. Dawson, Anne M. Schell, and Diane L. Filion. 2007. The electrodermal system. In Handbook of Psychophysiology. J. Cacioppo, L. G. Tassinary, and G. G. Berntson (Eds.), Cambridge University Press, New York, 200–223.",
      "doi": ""
    },
    {
      "text": "Frederique De Vignemont. 2007. Habeas corpus: The sense of ownership of one's own body. Mind Lang. 22, 4 (Aug. 2007), 427–449. https://10.1111/j.1468-0017.2007.00315.x",
      "doi": ""
    },
    {
      "text": "Georgiana Cristina Dobre, Marta Wilczkowiak, Marco Gillies, Xueni Pan, and Sean Rintel. 2022. Nice is different than good: Longitudinal Communicative effects of realistic and cartoon avatars in real mixed reality work meetings. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (CHI EA '22). Association for Computing Machinery, New York, NY, USA, Article 437, 1–7. https://doi.org/10.1145/3491101.3519628",
      "doi": "10.1145/3491101.3519628"
    },
    {
      "text": "Martin Dobricki and Betty J. Mohler. 2015. Self-Identification with another's body alters self-other face distinction. Perception 44, 7 (Jul. 2015), 814-820. https://doi.org/10.1177/0301006615594697",
      "doi": ""
    },
    {
      "text": "Nina Döllinger, Erik Wolf, David Mal, Stephan Wenninger, Mario Botsch, Marc Erich Latoschik, and Carolin Wienrich. 2022. Resize me! Exploring the user experience of embodied realistic modulatable avatars for body image intervention in virtual reality. arXiv preprint arXiv:2203.05060. https://10.3389/frvir. 2022.935449",
      "doi": ""
    },
    {
      "text": "Alejandro J. Estudillo and Markus Bindemann. 2016. Can gaze-contingent mirror-feedback from unfamiliar faces alter self-recognition? The Quarterly Journal of Experimental Psychology 70, 5 (May 2016), 944-958. https://doi.org/10.1080/17470218.2016.1166253",
      "doi": ""
    },
    {
      "text": "Alejandro J. Estudillo and Markus Bindemann. 2016. Multisensory stimulation with other-race faces and the reduction of racial prejudice. Consciousness and Cognition 1, 42 (May 2016), 325-339. https://doi.org/10.1016/j.concog.2016.04.006",
      "doi": ""
    },
    {
      "text": "Harry Farmer, Ana Tajadura-Jiménez, and Manos Tsakiris. 2012. Beyond the colour of my skin: How skin colour affects the sense of body-ownership. Conscious. Cogn. 21, 3 (Sept. 2012), 1242–1256. https://10.1016/j.concog.2012.04.011",
      "doi": ""
    },
    {
      "text": "Thomas B. Fitzpatrick. 1988. The validity and practicality of sun-reactive skin types i through vi. Archives of Dermatology 124, 6 (June 1988), 869–871. htpps://10.1001/archderm.1988.01670060015008.",
      "doi": ""
    },
    {
      "text": "Matthew C. Fysh, Iliyana V. Trifonova, John Allen, Cade McCall, A. Mike Burton, and Markus Bindemann. 2022. Avatars with faces of real people: A construction method for scientific experiments in virtual reality. Behavior Research Methods 54, 3 (Sept. 2022), 1461-1475. https://doi.org/10.3758/s13428-021-01676-5",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco, Anna I. Bellido, Kristopher J.  Blom, Mel Slater, and Antoni Rodriguez-Fornells. 2016. The neurological traces of look-alike avatars. Frontiers in Human Neuroscience, 10 (Aug. 2016), 392. https://doi.org/10.3389/fnhum.2016.00392",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco and Tabitha C. Peck. 2018. Avatar embodiment. Towards a standardized questionnaire. Frontiers in Robotics and AI, 5 (June 2018), 74. https://doi.org/10.3389/frobt.2018.00074",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco, Daniel Perez-Marcos, Bernhard Spanlang, and Mel Slater. 2010. The contribution of real-time mirror reflections of motor actions on virtual body ownership in an immersive virtual environment. In 2010 IEEE Virtual Reality Conference (VR), March 20-24, 2010, Boston, MA, USA. IEEE, 111-114.",
      "doi": "10.1109/VR.2010.5444805"
    },
    {
      "text": "Mar Gonzalez-Franco, Anthony Steed, Steve Hoogendyk, and Eyal Ofek. 2020. Using Facial Animation to Increase the Enfacement Illusion and Avatar SelfIdentification. IEEE Transactions on Visualization and Computer Graphics 26, 5 (May 2020), 2023–2029. https://doi.org/10.1109/TVCG.2020.2973075",
      "doi": ""
    },
    {
      "text": "Geoffrey Gorisse, Olivier Christmann, Samory Houzangbe, and Simon Richir. 2019. From robot to virtual doppelganger: Impact of visual fidelity of avatars controlled in third-person perspective on embodiment and behavior in immersive virtual environments. Frontiers in Robotics and AI, 6 (Feb. 2019), 8. https://doi.org/10.3389/frobt.2019.00008",
      "doi": ""
    },
    {
      "text": "Karin Hägni, Kynan Eng, Marie-Claude Hepp-Reymond, Lisa Holper, Birgit Keisker, Ewa Siekierka, and Daniel C. Kiper. 2008. Observing virtual arms that you imagine are yours increases the galvanic skin response to an unexpected threat. PloS One 3, 8 (Aug. 2008), e3082. https://doi.org/10.1371/journal.pone.0003082",
      "doi": ""
    },
    {
      "text": "Nicolas Haverkamp and André Beauducel. 2017. Violation of the sphericity assumption and its effect on type-I error rates in repeated measures ANOVA and multi-level linear models (MLM). Frontiers in Psychology, 8 (Oct. 2017), 1841. https://doi.org/10.3389/fpsyg.2017.01841",
      "doi": ""
    },
    {
      "text": "Darragh Higgins, Donal Egan, Rebecca Fribourg, Benjamin R. Cowan, and Rachel McDonnell. 2018. Ascending from the valley: Can state-of-the-art photorealism avoid the uncanny?. In SAP ’21: ACM Symposium on Applied Perception, September 16–17, 2021, Rennes, France. ACM, New York, NY, USA, 5 pages. https://doi.org/10.1145/1122445.1122456",
      "doi": ""
    },
    {
      "text": "Andreas Kalckert and Henrik H. Ehrsson. 2014. The moving rubber hand illusion revisited: comparing movements and visuotactile stimulation to induce illusory ownership. Conscious. Cogn. 26 (May 2014), 117–132. https://10.1016/j.concog.2014.02.003",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Raphaela Groten, and Mel Slater. 2012. The sense of embodiment in virtual reality. Presence: Teleoper. Virtual Environ. 21, 4 (Nov. 2012), 373–387. https://10.1162/PRES_a_00124",
      "doi": "10.1162/PRES_a_00124"
    },
    {
      "text": "Konstantina Kilteni, Antonella Maselli, Konrad P. Kording, and Mel Slater. 2015. Over my fake body: body ownership illusions for studying the multisensory basis of own-body perception. Frontiers in Human Neuroscience, 9 (Mar. 2015), 141. https://doi.org/10.3389/fnhum.2015.00141",
      "doi": ""
    },
    {
      "text": "Marc Erich Latoschik, Jean-Luc Lugrin, and Daniel Roth. 2016. FakeMi: A fake mirror system for avatar embodiment studies. In Proceedings of the 22Nd ACM Conference on Virtual Reality Software and Technology (VRST ’16). ACM, New York, NY, USA, 73–76. https://doi.org/10.1145/2993369.2993399",
      "doi": "10.1145/2993369.2993399"
    },
    {
      "text": "Marc Erich Latoschik, Daniel Roth, Dominik Gall, Jascha Achenbach, Thomas Waltemate, and Mario Botsch. 2017. The effect of avatar realism in immersive social virtual realities. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (VRST ’17). ACM, New York, NY, USA, Article 39, 1-10. DOI: http://dx.doi.org/10.1145/3139131.3139156",
      "doi": "10.1145/3139131.3139156"
    },
    {
      "text": "Matthew R. Longo, Friederike Schüür, Marjolein P. M. Kammers, Manos Tsakiris, and Patrick Haggard. 2008. What is embodiment? A psychometric approach. Cognition 107, 3 (Jun. 2008), 978–998. https://10.1016/j.cognition.2007.12.004",
      "doi": ""
    },
    {
      "text": "Jean Luc Lugrin, Johanna Latt, and Marc Erich Latoschik. 2015. Avatar anthropomorphism and illusion of body ownership in VR. In Proceedings of the IEEE Conference on Virtual Reality (IEEE VR ’15). 229–230. http://dx.doi.org/10.1109/VR.2015.7223379",
      "doi": ""
    },
    {
      "text": "Fang Ma and Xueni Pan. 2022. Visual fidelity effects on expressive self-avatar in virtual reality: First impressions matter. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR), March 12-16, 2022, Christchurch, New Zealand, 57-65. https://0.1109/VR51125.2022.00023.",
      "doi": ""
    },
    {
      "text": "Rachel McDonnell, Martin Breidt, and Heinrich Buelthoff. 2012. Render me real Investigating the effect of render style on the perception of animated virtual humans. ACM Trans. Graph. 31, 4 (July 2012), 91:1–91:11. http://doi.acm.org/10.1145/2185520.2185587.",
      "doi": "10.1145/2185520.2185587"
    },
    {
      "text": "Masahiro Mori, Karl F. MacDorman, and Norri Kageki. 2012. The Uncanny Valley [from the field]. IEEE Robotics Automation Magazine 19, 2 (June 2012), 98–100. https://doi.org/10.1109/MRA.2012.2192811",
      "doi": ""
    },
    {
      "text": "Masahiro Mori. 1970. Bukimi no tani gensho [the uncanny valley]. Energy 7, 4 (1970), 33–35.",
      "doi": ""
    },
    {
      "text": "Richard C. Oldfield. 1971. The assessment and analysis of handedness: the Edinburgh inventory. Neuropsychologia 9, 1 (Mar. 1971), 97-113. https://doi.org/10.1016/0028-3932(71)90067-4",
      "doi": ""
    },
    {
      "text": "Maria-Paola Paladino, Mara Mazzurega, Francesco Pavani, and Thomas W. Schubert. 2010. Synchronous multisensory stimulation blurs self-other boundaries. Psychological Science 21, 9 (Aug. 2010), 1202-1207. https://doi.org/10.1177/095679761037923",
      "doi": ""
    },
    {
      "text": "Achille Pasqualotto and Michael J. Proulx. 2015. Two-dimensional rubber-hand illusion: The Dorian Gray hand illusion. Multisensory Research 28, 1-2 (Jan. 2015), 101-110. https://10.1163/22134808-00002473",
      "doi": ""
    },
    {
      "text": "Tabitha C. Peck and Mar Gonzalez-Franco. 2021. Avatar embodiment. A standardized questionnaire. Frontiers in Virtual Reality, 1 (Feb. 2021), 1–12. https://doi.org/10.3389/frvir.2020.575943",
      "doi": ""
    },
    {
      "text": "Giuseppina Porciello, Ilaria Bufalari, Ilaria Minio-Paluello, Enrico Di Pace, & Salvatore M. Aglioti. 2018. The ‘Enfacement’ illusion: a window on the plasticity of the self. Cortex, 104 (July 2018), 261-275. https://doi.org/10.1016/j.cortex.2018.01.007",
      "doi": ""
    },
    {
      "text": "Daniel Roth, Jean-Luc Lugrin, Dmitri Galakhov, Arvid Hofmann, Gary Bente, Marc Erich Latoschik, and Arnulph Fuhrmann. 2016. Avatar realism and social interaction quality in virtual reality. In Proc. IEEE Conf. on Virtual Reality and 3D User Interfaces (VR), March 19-23, 2016, Greenville, SC, USA. IEEE, 277–278. https://doi.org/10.1109/VR.2016.7504761",
      "doi": ""
    },
    {
      "text": "Anca Salagean, Jacob Hadnett-Hunter, Daniel J. Finnegan, Alexandra A. De Sousa, and Michael J. Proulx. 2022. A virtual reality application of the rubber hand illusion induced by ultrasonic mid-air haptic stimulation. ACM Transactions on Applied Perception (TAP) 19, 1, Article 3 (Jan. 2022), 1-9. https://doi.org/10.1145/3487563",
      "doi": "10.1145/3487563"
    },
    {
      "text": "Maria V. Sanchez-Vives and Slater Mel. 2005. Opinion: From presence to consciousness through virtual reality. Nature Rev. Neurosci., 6 (Apr. 2005), 332–339. https://10.1038/nrn1651",
      "doi": ""
    },
    {
      "text": "Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philos. Trans. Roy. Soc. B: Biol. Sci., 364 (Dec. 2009), 3549–3557. https://10.1098/rstb.2009.0138",
      "doi": ""
    },
    {
      "text": "Mel Slater and Maria V. Sanchez-Vives. 2016. Enhancing our lives with immersive virtual reality. Front. Robot. AI, 3 (Dec. 2016), 74. https://10. 3389/frobt.2016.00074",
      "doi": ""
    },
    {
      "text": "Mel Slater and Sylvia Wilbur. 1997. A framework for immersive virtual environments (FIVE): Speculations on the role of presence in virtual environments. Presence: Teleoperators and Virtual Environments 6, 6 (Dec. 1997), 603–616. https://doi.org/10.1162/pres.1997.6.6.603",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "William Steptoe, Anthony Steed and Mel Slater. 2013. Human tails: ownership and control of extended humanoid avatars. IEEE Transactions on Visualization and Computer Graphics 19, 4 (Apr. 2013), 583-590. https://10.1109/TVCG.2013.32.",
      "doi": ""
    },
    {
      "text": "Jie Sui and Glyn W. Humphreys. 2017. The ubiquitous self: What the properties of self‐bias tell us about the self. Annals of the New York Academy of Sciences 1396, 1 (May 2017), 222-235. https://doi.org/10.1111/nyas.13197",
      "doi": ""
    },
    {
      "text": "Ana Tajadura-Jiménez, Ludovica Lorusso, and Manos Tsakiris. 2013. Active and passive-touch during interpersonal multisensory stimulation change self–other boundaries. Consciousness and Cognition 22, 4 (Dec. 2013), 1352-1360. https://doi.org/10.1016/j.concog.2013.09.002",
      "doi": ""
    },
    {
      "text": "Manos Tsakiris. 2008. Looking for myself: current multisensory input alters self-face recognition. PloS One 3, 12 (Dec. 2008), e4040. https://doi.org/10.1371/journal.pone.0004040",
      "doi": ""
    },
    {
      "text": "Martin Usoh, Ernest Catena, Sima Arman, and Mel Slater. 2000. Using presence questionnaires in reality. Presence: Teleoper. Virtual Environ. 9, 5 (Oct. 2000), 497–503. https://doi.org/10.1162/105474600566989",
      "doi": "10.1162/105474600566989"
    },
    {
      "text": "Thomas Waltemate, Dominik Gall, Daniel Roth, Mario Botsch, and Marc Erich Latoschik. 2018. The impact of avatar personalization and immersion on virtual body ownership, presence, and emotional response. IEEE Transactions on Visualization and Computer Graphics 24, 4(2018), 1643–1652. https://10.1109/TVCG.2018.2794629.",
      "doi": "10.1109/TVCG.2018.2794629"
    },
    {
      "text": "Bob G. Witmer and Michael J. Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence: Teleoper. Virtual Environ. 7, 3 (June 1998), 225–240. https://dx.doi.org/10.1162/105474698565686",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Erik Wolf, Nathalie Merdan, Nina Dölinger, David Mal, Carolin Wienrich, Mario Botsch, and Marc Erich Latoschik. 2021. The embodiment of photorealistic avatars influences female body weight perception in virtual reality. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR), March 27 – April 1, 2021, Lisbon, Portugal, 65-74. IEEE. https://10.1109/VR50410.2021.00027.",
      "doi": ""
    },
    {
      "text": "Eduard Zell, Carlos Aliaga, Adrian Jarabo, Katja Zibrek, Diego Gutierrez, Rachel McDonnell, and Mario Botsch. 2015. To stylize or not to stylize?: the effect of shape and material stylization on the perception of computer-generated faces. ACM Transactions on Graphics (TOG) 34, 6 (2015), 184. https://doi.org/10.1145/2816795.2818126",
      "doi": "10.1145/2816795.2818126"
    },
    {
      "text": "Eduard Zell, Katja Zibrek, and Rachel McDonnell. 2019. Perception of virtual characters. In ACM SIGGRAPH 2019 Courses (SIGGRAPH '19). Association for Computing Machinery, New York, NY, USA, Article 21, 1-17. https://doi.org/10.1145/3305366.3328101",
      "doi": "10.1145/3305366.3328101"
    },
    {
      "text": "Jing Zhang, Ke Ma, and Bernhard Hommel. 2015. The virtual hand illusion is moderated by context-induced spatial reference frames. Frontiers in Psychology, 6 (Oct. 2015), 1659. https://doi.org/10.3389/fpsyg.2015.01659",
      "doi": ""
    },
    {
      "text": "Katja Zibrek, Sean Martin, and Rachel McDonnell. 2019. Is photorealism important for perception of expressive virtual humans in virtual reality? ACM Trans. Appl. Percept. 16, 3, Article 14 (Sept. 2019), 1-19. https://doi.org/10.1145/3349609",
      "doi": "10.1145/3349609"
    },
    {
      "text": "Katja Zibrek and Rachel McDonnell. 2019. Social presence and place illusion are affected by photorealism in embodied VR. In Motion, Interaction and Games (MIG ’19), October 28-30, 2019, Newcastle upon Tyne, UK. Association for Computing Machinery, New York, NY, USA, Article 13, 1-7. https://doi.org/10.1145/3359566.3360064.",
      "doi": "10.1145/3359566.3360064"
    }
  ]
}