{
  "doi": "10.1145/3544548.3581547",
  "title": "Flat Panel Haptics: Embedded Electroosmotic Pumps for Scalable Shape Displays",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Flat touch interfaces, with or without screens, pervade the modern world. However, their haptic feedback is minimal, prompting much research into haptic and shape-changing display technologies which are self-contained, fast acting, and offer millimeters of displacement while only being only millimeters thick. We present a new, miniaturizable type of shape-changing display using embedded electroosmotic pumps (EEOPs). Our pumps, controlled and powered directly by applied voltage, are 1.5mm in thickness, and allow complete stackups under 5mm. Nonetheless, they can move their entire volume’s worth of fluid in 1 second, and generate pressures of +/-50kPa, enough to create dynamic, millimeter-scale tactile features on a surface that can withstand typical interaction forces (<1N). These are the requisite technical ingredients to enable, for example, a pop-up keyboard on a flat smartphone. We experimentally quantify the mechanical and psychophysical performance of our displays and conclude with a set of example interfaces.",
  "tags": [
    "Microfluidics",
    "Haptics",
    "Shape-changing displays"
  ],
  "authors": [
    {
      "name": "Craig Shultz",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83058740657",
      "orcid": "0000-0003-0469-8760"
    },
    {
      "name": "Chris Harrison",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "2010. Electroosmosis. In Micro- and Nanoscale Fluid Mechanics: Transport in Microfluidic Devices, Brian J. Kirby (Ed.). Cambridge University Press, Cambridge, 131–152. https://doi.org/10.1017/CBO9780511760723.008",
      "doi": ""
    },
    {
      "text": "Jason Alexander, Anne Roudaut, Jürgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand Challenges in Shape-Changing Interface Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–14. https://doi.org/10.1145/3173574.3173873",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Ankit, Terence Yan King Ho, Amoolya Nirmal, Mohit Rameshchandra Kulkarni, Dino Accoto, and Nripan Mathews. 2022. Soft Actuator Materials for Electrically Driven Haptic Interfaces. Advanced Intelligent Systems 4, 2 (2022), 2100061. https://doi.org/10.1002/aisy.202100061",
      "doi": ""
    },
    {
      "text": "Ankit, Naveen Tiwari, Mayank Rajput, Nguyen Anh Chien, and Nripan Mathews. 2018. Highly Transparent and Integrable Surface Texture Change Device for Localized Tactile Feedback. Small 14, 1 (2018), 1702312. https://doi.org/10.1002/smll.201702312",
      "doi": ""
    },
    {
      "text": "Olivier Bau, Uros Petrevski, and Wendy Mackay. 2009. BubbleWrap: a textile-based electromagnetic haptic display. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’09). Association for Computing Machinery, New York, NY, USA, 3607–3612. https://doi.org/10.1145/1520340.1520542",
      "doi": "10.1145/1520340.1520542"
    },
    {
      "text": "Nadine Besse, Samuel Rosset, Juan Jose Zarate, and Herbert Shea. 2017. Flexible Active Skin: Large Reconfigurable Arrays of Individually Addressed Shape Memory Polymer Actuators. Advanced Materials Technologies 2, 10 (2017), 1700102. https://doi.org/10.1002/admt.201700102",
      "doi": ""
    },
    {
      "text": "Shantonu Biswas and Yon Visell. 2019. Emerging Material Technologies for Haptics. Advanced Materials Technologies 4, 4 (2019), 1900042. https://doi.org/10.1002/admt.201900042",
      "doi": ""
    },
    {
      "text": "S Bolanowski, George Gescheider, R Verrillo, and C Checkosky. 1988. Four channels mediate the mechanical aspects of touch. The Journal of the Acoustical Society of America 84 (Dec. 1988), 1680–94. https://doi.org/10.1121/1.397184",
      "doi": ""
    },
    {
      "text": "C. R. Buie, D. Kim, S. Litster, and J. G. Santiago. 2007. An Electro-osmotic Fuel Pump for Direct Methanol Fuel Cells. Electrochem. Solid-State Lett. 10, 11 (Aug. 2007), B196. https://doi.org/10.1149/1.2772083",
      "doi": ""
    },
    {
      "text": "Lingxin Chen, Jaebum Choo, and Bing Yan. 2007. The microfabricated electrokinetic pump: a potential promising drug delivery technique. Expert Opinion on Drug Delivery 4, 2 (March 2007), 119–129. https://doi.org/10.1517/17425247.4.2.119",
      "doi": ""
    },
    {
      "text": "Craig Michael Ciesla and Micah B. Yairi. 2012. User interface system.",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho, Hiroshi Ishii, and Pattie Maes. 2008. Surflex: a programmable surface for the design of tangible interfaces. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’08). Association for Computing Machinery, New York, NY, USA, 3429–3434. https://doi.org/10.1145/1358628.1358869",
      "doi": "10.1145/1358628.1358869"
    },
    {
      "text": "Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-changing interfaces. Pers Ubiquit Comput 15, 2 (Feb. 2011), 161–173. https://doi.org/10.1007/s00779-010-0311-y",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Giulia Corniani and Hannes P. Saal. 2020. Tactile innervation densities across the whole body. Journal of Neurophysiology 124, 4 (Oct. 2020), 1229–1240. https://doi.org/10.1152/jn.00313.2020",
      "doi": ""
    },
    {
      "text": "Heather Culbertson, Samuel B. Schorr, and Allison M. Okamura. 2018. Haptics: The Present and Future of Artificial Touch Sensation. Annu. Rev. Control Robot. Auton. Syst. 1, 1 (May 2018), 385–409. https://doi.org/10.1146/annurev-control-060117-105043",
      "doi": ""
    },
    {
      "text": "Thanh Nho Do, Hung Phan, Thuc-Quyen Nguyen, and Yon Visell. 2018. Miniature Soft Electromagnetic Actuators for Robotic Applications. Advanced Functional Materials 28, 18 (2018), 1800244. https://doi.org/10.1002/adfm.201800244",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation. In Proceedings of the 26th annual ACM symposium on User interface software and technology(UIST ’13). Association for Computing Machinery, New York, NY, USA, 417–426. https://doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Karmen Franinović and Luke Franzke. 2019. Shape Changing Surfaces and Structures: Design Tools and Methods for Electroactive Polymers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300355",
      "doi": "10.1145/3290605.3300355"
    },
    {
      "text": "Juri Fujii, Satoshi Nakamaru, and Yasuaki Kakehi. 2021. LayerPump: Rapid Prototyping of Functional 3D Objects with Built-in Electrohydrodynamics Pumps Based on Layered Plates. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Salzburg Austria, 1–7. https://doi.org/10.1145/3430524.3442453",
      "doi": "10.1145/3430524.3442453"
    },
    {
      "text": "James J. Gibson. 1962. Observations on active touch.Psychological Review 69, 6 (Nov. 1962), 477–491. https://doi.org/10.1037/h0046962",
      "doi": ""
    },
    {
      "text": "Jesse T. Gonzalez and Scott E. Hudson. 2022. Layer by Layer, Patterned Valves Enable Programmable Soft Surfaces. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 1 (March 2022), 12:1–12:25. https://doi.org/10.1145/3517251",
      "doi": "10.1145/3517251"
    },
    {
      "text": "Nur Al-huda Hamdan, Adrian Wagner, Simon Voelker, Jürgen Steimle, and Jan Borchers. 2019. Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300718",
      "doi": "10.1145/3290605.3300718"
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2009. Providing dynamically changeable physical buttons on a visual display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Boston MA USA, 299–308. https://doi.org/10.1145/1518701.1518749",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Brian Iverson and Suresh Garimella. 2008. Recent Advances in Microscale Pumping Technologies: A Review and Evaluation. Research Publications 5 (Aug. 2008). https://doi.org/10.1007/s10404-008-0266-8",
      "doi": ""
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura. 2001. Project FEELEX: adding haptic surface to graphics. In Proceedings of the 28th annual conference on Computer graphics and interactive techniques(SIGGRAPH ’01). Association for Computing Machinery, New York, NY, USA, 469–476. https://doi.org/10.1145/383259.383314",
      "doi": "10.1145/383259.383314"
    },
    {
      "text": "Sungjune Jang, Lawrence H. Kim, Kesler Tanner, Hiroshi Ishii, and Sean Follmer. 2016. Haptic Edge Display for Mobile Tactile Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 3706–3716. https://doi.org/10.1145/2858036.2858264",
      "doi": "10.1145/2858036.2858264"
    },
    {
      "text": "Linan Jiang, J. Mikkelsen, Jae-Mo Koo, D. Huber, Shuhuai Yao, Lian Zhang, Peng Zhou, J.G. Maveety, R. Prasher, J.G. Santiago, T.W. Kenny, and K.E. Goodson. 2002. Closed-loop electroosmotic microchannel cooling system for VLSI circuits. IEEE Transactions on Components and Packaging Technologies 25, 3 (Sept. 2002), 347–355. https://doi.org/10.1109/TCAPT.2002.800599",
      "doi": ""
    },
    {
      "text": "Roland Johansson and John Flanagan. 2009. Coding and use of tactile signals from the fingertips in object manipulation tasks. Nature reviews. Neuroscience 10 (May 2009), 345–59. https://doi.org/10.1038/nrn2621",
      "doi": ""
    },
    {
      "text": "Daejoong Kim, Jonathan D. Posner, and Juan G. Santiago. 2008. High flow rate per power electroosmotic pumping using low ion density solvents. Sensors and Actuators A: Physical 141, 1 (Jan. 2008), 201–212. https://doi.org/10.1016/j.sna.2007.07.023",
      "doi": ""
    },
    {
      "text": "D.J. Laser and Juan Santiago. 2004. A Review of Micro Pumps. Journal of Micromechanics and Microengineering 14 (April 2004), R35. https://doi.org/10.1088/0960-1317/14/6/R01",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 1987. Hand movements: A window into haptic object recognition. Cognitive Psychology 19, 3 (July 1987), 342–368. https://doi.org/10.1016/0010-0285(87)90008-9",
      "doi": ""
    },
    {
      "text": "Daniel Leithinger and Hiroshi Ishii. 2010. Relief: a scalable actuated shape display. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction(TEI ’10). Association for Computing Machinery, New York, NY, USA, 221–222. https://doi.org/10.1145/1709886.1709928",
      "doi": "10.1145/1709886.1709928"
    },
    {
      "text": "Edouard Leroy, Ronan Hinchet, and Herbert Shea. 2020. Multimode Hydraulically Amplified Electrostatic Actuators for Wearable Haptics. Advanced Materials 32, 36 (2020), 2002564. https://doi.org/10.1002/adma.202002564",
      "doi": ""
    },
    {
      "text": "Lin Li, Xiayan Wang, Qiaosheng Pu, and Shaorong Liu. 2019. Advancement of electroosmotic pump in microflow analysis: A review. Analytica Chimica Acta 1060 (July 2019), 1–16. https://doi.org/10.1016/j.aca.2019.02.004",
      "doi": ""
    },
    {
      "text": "Jennifer Mankoff, Anind K. Dey, Gary Hsieh, Julie Kientz, Scott Lederer, and Morgan Ames. 2003. Heuristic evaluation of ambient displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’03). Association for Computing Machinery, New York, NY, USA, 169–176. https://doi.org/10.1145/642611.642642",
      "doi": "10.1145/642611.642642"
    },
    {
      "text": "Takafumi Morita, Yu Kuwajima, Ayato Minaminosono, Shingo Maeda, and Yasuaki Kakehi. 2022. HydroMod : Constructive Modules for Prototyping Hydraulic Physical Interfaces. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3491102.3502096",
      "doi": "10.1145/3491102.3502096"
    },
    {
      "text": "Masashi Nakatani, Hiroyuki Kajimoto, Dairoku Sekiguchi, Naoki Kawakami, and Susumu Tachi. 2003. 3D Form Display with Shape Memory Alloy.",
      "doi": ""
    },
    {
      "text": "Xuan-Truc Nguyen, Ariel A. Calderón, Alberto Rigo, Joey Z. Ge, and Néstor O. Pérez-Arancibia. 2020. SMALLBug: A 30-mg Crawling Robot Driven by a High-Frequency Flexible SMA Microactuator. IEEE Robotics and Automation Letters 5, 4 (Oct. 2020), 6796–6803. https://doi.org/10.1109/LRA.2020.3015457",
      "doi": ""
    },
    {
      "text": "J Pasquero and Vincent Hayward. 2003. STRESS: A practical tactile display system with one millimeter spatial resolution and 700 Hz refresh rate. 94–110.",
      "doi": ""
    },
    {
      "text": "D. T. V. Pawluk and R. D. Howe. 1999. Dynamic Contact of the Human Fingerpad Against a Flat Surface. Journal of Biomechanical Engineering 121, 6 (Dec. 1999), 605–611. https://doi.org/10.1115/1.2800860",
      "doi": ""
    },
    {
      "text": "Victor Pretorius, B. J. Hopkins, and J. D. Schieke. 1974. Electro-osmosis: A new concept for high-speed liquid chromatography. Journal of Chromatography A 99 (Jan. 1974), 23–30. https://doi.org/10.1016/S0021-9673(00)90842-2",
      "doi": ""
    },
    {
      "text": "Purnendu, Sasha M Novack, Eric Acome, Christoph Keplinger, Mirela Alistar, Mark D Gross, Carson Bruns, and Daniel Leithinger. 2021. Electriflow: Soft Electrohydraulic Building Blocks for Prototyping Shape-changing Interfaces. In Designing Interactive Systems Conference 2021. ACM, Virtual Event USA, 1280–1290. https://doi.org/10.1145/3461778.3462093",
      "doi": "10.1145/3461778.3462093"
    },
    {
      "text": "Khaled S. Ramadan, D. Sameoto, and S. Evoy. 2014. A review of piezoelectric polymers as functional materials for electromechanical transducers. Smart Mater. Struct. 23, 3 (Jan. 2014), 033001. https://doi.org/10.1088/0964-1726/23/3/033001 Publisher: IOP Publishing.",
      "doi": ""
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-changing interfaces: a review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). Association for Computing Machinery, New York, NY, USA, 735–744. https://doi.org/10.1145/2207676.2207781",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Alexander Russomanno, R. Brent Gillespie, Sile O’Modhrain, and Mark Burns. 2015. The design of pressure-controlled valves for a refreshable tactile display. In 2015 IEEE World Haptics Conference (WHC). 177–182. https://doi.org/10.1109/WHC.2015.7177710",
      "doi": ""
    },
    {
      "text": "Alex Russomanno, Zhentao Xu, Sile O’Modhrain, and Brent Gillespie. 2017. A pneu shape display: Physical buttons with programmable touch response. In 2017 IEEE World Haptics Conference (WHC). 641–646. https://doi.org/10.1109/WHC.2017.7989976",
      "doi": ""
    },
    {
      "text": "Yitian Shao, Siyuan Ma, Sang Ho Yoon, Yon Visell, and James Holbery. 2020. SurfaceFlow: Large Area Haptic Display via Compliant Liquid Dielectric Actuators. In 2020 IEEE Haptics Symposium (HAPTICS). 815–820. https://doi.org/10.1109/HAPTICS45997.2020.ras.HAP20.23.0f334629",
      "doi": ""
    },
    {
      "text": "Andrew A. Stanley and Allison M. Okamura. 2015. Controllable Surface Haptics via Particle Jamming and Pneumatics. IEEE Transactions on Haptics 8, 1 (Jan. 2015), 20–30. https://doi.org/10.1109/TOH.2015.2391093",
      "doi": "10.1109/TOH.2015.2391093"
    },
    {
      "text": "F. Steiner and M. Hassel. 2000. Nonaqueous capillary electrophoresis: a versatile completion of electrophoretic separation techniques. Electrophoresis 21, 18 (Dec. 2000), 3994–4016. https://doi.org/10.1002/1522-2683(200012)21:18<3994::AID-ELPS3994>3.0.CO;2-T",
      "doi": ""
    },
    {
      "text": "Miriam Sturdee and Jason Alexander. 2018. Analysis and Classification of Shape-Changing Interfaces for Design and Application-based Research. ACM Comput. Surv. 51, 1 (Jan. 2018), 2:1–2:32. https://doi.org/10.1145/3143559",
      "doi": "10.1145/3143559"
    },
    {
      "text": "Giovanni Maria Troiano, Esben Warming Pedersen, and Kasper Hornbæk. 2014. User-defined gestures for elastic, deformable displays. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces(AVI ’14). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/2598153.2598184",
      "doi": "10.1145/2598153.2598184"
    },
    {
      "text": "Xiaosong Wu, Seong-Hyok Kim, Haihong Zhu, Chang-Hyeon Ji, and Mark G. Allen. 2012. A Refreshable Braille Cell Based on Pneumatic Microbubble Actuators. Journal of Microelectromechanical Systems 21, 4 (Aug. 2012), 908–916. https://doi.org/10.1109/JMEMS.2012.2190043",
      "doi": ""
    },
    {
      "text": "Tae-Heon Yang, Sang-Youn Kim, Chong Hui Kim, Dong-Soo Kwon, and Wayne J. Book. 2009. Development of a miniature pin-array tactile module using elastic and electromagnetic force for mobile devices. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. 13–17. https://doi.org/10.1109/WHC.2009.4810818",
      "doi": "10.1109/WHC.2009.4810818"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology(UIST ’13). Association for Computing Machinery, New York, NY, USA, 13–22. https://doi.org/10.1145/2501988.2502037",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Junwen Zhong, Yuan Ma, Yu Song, Qize Zhong, Yao Chu, Ilbey Karakurt, David B. Bogy, and Liwei Lin. 2019. A Flexible Piezoelectret Actuator/Sensor Patch for Mechanical Human–Machine Interfaces. ACS Nano 13, 6 (June 2019), 7107–7116. https://doi.org/10.1021/acsnano.9b02437",
      "doi": ""
    },
    {
      "text": "Juan José Zárate and Herbert Shea. 2017. Using Pot-Magnets to Enable Stable and Scalable Electromagnetic Tactile Displays. IEEE Transactions on Haptics 10, 1 (Jan. 2017), 106–112. https://doi.org/10.1109/TOH.2016.2591951",
      "doi": "10.1109/TOH.2016.2591951"
    }
  ]
}