{
  "doi": "10.1145/3544548.3581259",
  "title": "Going, Going, Gone: Exploring Intention Communication for Multi-User Locomotion in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Exploring virtual worlds together with others adds a social component to the Virtual Reality (VR) experience that increases connectedness. In the physical world, joint locomotion comes naturally through implicit intention communication and subsequent adjustments of the movement patterns. In VR, however, discrete locomotion techniques such as point&teleport come without prior intention communication, hampering the collective experience. Related work proposes fixed groups, with a single person controlling the group movement, resulting in the loss of individual movement capabilities. To close the gap and mediate between these two extremes, we introduce three intention communication methods and explore them with two baseline methods. We contribute the results of a controlled experiment (n=20) investigating these methods from the perspective of a leader and a follower in a dyadic locomotion task. Our results suggest shared visualizations support the understanding of movement intentions, increasing the group feeling while maintaining individual freedom of movement.",
  "authors": [
    {
      "name": "Julian Rasch",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-99660692002/rel-imgonly/jr_round.png",
      "acmid": "99660692002",
      "orcid": "0000-0002-9981-6952"
    },
    {
      "name": "Vladislav Dmitrievic Rusakov",
      "institution": "LMU Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779564",
      "orcid": "0000-0002-7668-1012"
    },
    {
      "name": "Martin Schmitz",
      "institution": "Saarland Informatics Campus, Saarland University, Germany",
      "img": "/do/10.1145/contrib-87958634757/rel-imgonly/martin_foto.jpg",
      "acmid": "87958634757",
      "orcid": "0000-0002-7332-3287"
    },
    {
      "name": "Florian Müller",
      "institution": "LMU Munich, Germany",
      "img": "/do/10.1145/contrib-81464642529/rel-imgonly/flo_small.jpg",
      "acmid": "81464642529",
      "orcid": "0000-0002-9621-6214"
    }
  ],
  "references": [
    {
      "text": "Ferran Argelaguet, Carlos Andujar, and Ramon Trueba. 2008. Overcoming eye-hand visibility mismatch in 3D pointing selection. In Proceedings of the 2008 ACM symposium on Virtual reality software and technology - VRST ’08. ACM Press, Bordeaux, France, 43. https://doi.org/10.1145/1450579.1450588",
      "doi": "10.1145/1450579.1450588"
    },
    {
      "text": "Arthur Aron, Elaine N. Aron, and Danny Smollan. 1992. Inclusion of Other in the Self Scale and the structure of interpersonal closeness.Journal of Personality and Social Psychology 63, 4 (Oct. 1992), 596–612. https://doi.org/10.1037/0022-3514.63.4.596",
      "doi": ""
    },
    {
      "text": "Mahdi Azmandian, Timofey Grechkin, and Evan Suma Rosenberg. 2017. An evaluation of strategies for two-user redirected walking in shared physical spaces. In 2017 IEEE Virtual Reality (VR). IEEE, Los Angeles, CA, USA, 91–98. https://doi.org/10.1109/VR.2017.7892235",
      "doi": ""
    },
    {
      "text": "Roger Bakeman. 2005. Recommended effect size statistics for repeated measures designs. Behavior Research Methods 37, 3 (Aug. 2005), 379–384. https://doi.org/10.3758/BF03192707",
      "doi": ""
    },
    {
      "text": "Stephan Beck, Andre Kunert, Alexander Kulik, and Bernd Froehlich. 2013. Immersive Group-to-Group Telepresence. IEEE Transactions on Visualization and Computer Graphics 19, 4 (April 2013), 616–625. https://doi.org/10.1109/TVCG.2013.33",
      "doi": "10.1109/TVCG.2013.33"
    },
    {
      "text": "Costas Boletsis. 2017. The New Era of Virtual Reality Locomotion: A Systematic Literature Review of Techniques and a Proposed Typology. Multimodal Technologies and Interaction 1, 4 (Sept. 2017), 24. https://doi.org/10.3390/mti1040024",
      "doi": ""
    },
    {
      "text": "Costas Boletsis and Dimitra Chasanidou. 2022. A Typology of Virtual Reality Locomotion Techniques. (2022), 14.",
      "doi": ""
    },
    {
      "text": "D.A. Bowman, D. Koller, and L.F. Hodges. 1997. Travel in immersive virtual environments: an evaluation of viewpoint motion control techniques. In Proceedings of IEEE 1997 Annual International Symposium on Virtual Reality. IEEE Comput. Soc. Press, Albuquerque, NM, USA, 45–52,. https://doi.org/10.1109/VRAIS.1997.583043",
      "doi": ""
    },
    {
      "text": "Evren Bozgeyikli, Andrew Raij, Srinivas Katkoori, and Rajiv Dubey. 2016. Point & Teleport Locomotion Technique for Virtual Reality. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. ACM, Austin Texas USA, 205–216. https://doi.org/10.1145/2967934.2968105",
      "doi": "10.1145/2967934.2968105"
    },
    {
      "text": "Marcello Carrozzino, Giovanni Avveduto, Franco Tecchia, Pavel Gurevich, and Benjamin Cohen. 2014. Navigating immersive virtual environments through a foot controller. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology - VRST ’14. ACM Press, Edinburgh, Scotland, 23–26. https://doi.org/10.1145/2671015.2671121",
      "doi": "10.1145/2671015.2671121"
    },
    {
      "text": "Chris G. Christou and Poppy Aristidou. 2017. Steering Versus Teleport Locomotion for Head Mounted Displays. In Augmented Reality, Virtual Reality, and Computer Graphics, Lucio Tommaso De Paolis, Patrick Bourdot, and Antonio Mongelli (Eds.). Vol. 10325. Springer International Publishing, Cham, 431–446. https://doi.org/10.1007/978-3-319-60928-7_37 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 2013. Statistical Power Analysis for the Behavioral Sciences (0 ed.). Routledge. https://doi.org/10.4324/9780203771587",
      "doi": ""
    },
    {
      "text": "Lisa A. Elkin, Matthew Kay, James J. Higgins, and Jacob O. Wobbrock. 2021. An Aligned Rank Transform Procedure for Multifactor Contrast Tests. In The 34th Annual ACM Symposium on User Interface Software and Technology. ACM, Virtual Event USA, 754–768. https://doi.org/10.1145/3472749.3474784",
      "doi": "10.1145/3472749.3474784"
    },
    {
      "text": "Julian Frommel, Sven Sonntag, and Michael Weber. 2017. Effects of controller-based locomotion on player experience in a virtual reality exploration game. In Proceedings of the 12th International Conference on the Foundations of Digital Games. ACM, Hyannis Massachusetts, 1–6. https://doi.org/10.1145/3102071.3102082",
      "doi": "10.1145/3102071.3102082"
    },
    {
      "text": "Markus Funk, Florian Müller, Marco Fendrich, Megan Shene, Moritz Kolvenbach, Niclas Dobbertin, Sebastian Günther, and Max Mühlhäuser. 2019. Assessing the Accuracy of Point & Teleport Locomotion with Orientation Indication for Virtual Reality using Curved Trajectories. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300377",
      "doi": "10.1145/3290605.3300377"
    },
    {
      "text": "Lawrence J. Hettinger, Kevin S. Berbaum, Robert S. Kennedy, William P. Dunlap, and Margaret D. Nolan. 1990. Vection and Simulator Sickness. Military Psychology 2, 3 (Sept. 1990), 171–181. https://doi.org/10.1207/s15327876mp0203_4",
      "doi": ""
    },
    {
      "text": "Michael J. Hove and Jane L. Risen. 2009. It’s All in the Timing: Interpersonal Synchrony Increases Affiliation. Social Cognition 27, 6 (Dec. 2009), 949–960. https://doi.org/10.1521/soco.2009.27.6.949",
      "doi": ""
    },
    {
      "text": "Wijnand A IJsselsteijn, Yvonne AW De Kort, and Karolien Poels. 2013. The game experience questionnaire. Technical Report. Technische Universiteit Eindhoven.",
      "doi": ""
    },
    {
      "text": "M. P. Jacob Habgood, David Moore, David Wilson, and Sergio Alapont. 2018. Rapid, Continuous Movement Between Nodes as an Accessible Virtual Reality Locomotion Technique. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Reutlingen, 371–378. https://doi.org/10.1109/VR.2018.8446130",
      "doi": ""
    },
    {
      "text": "Behrang Keshavarz and Heiko Hecht. 2011. Validating an Efficient Method to Quantify Motion Sickness. Human Factors: The Journal of the Human Factors and Ergonomics Society 53, 4 (Aug. 2011), 415–426. https://doi.org/10.1177/0018720811403736",
      "doi": ""
    },
    {
      "text": "Anya Kolesnichenko, Joshua McVeigh-Schultz, and Katherine Isbister. 2019. Understanding Emerging Design Practices for Avatar Systems in the Commercial Social VR Ecology. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego CA USA, 241–252. https://doi.org/10.1145/3322276.3322352",
      "doi": "10.1145/3322276.3322352"
    },
    {
      "text": "Daniël Lakens. 2010. Movement synchrony and perceived entitativity. Journal of Experimental Social Psychology 46, 5 (Sept. 2010), 701–708. https://doi.org/10.1016/j.jesp.2010.03.015",
      "doi": ""
    },
    {
      "text": "Jacques Launay, Roger T. Dean, and Freya Bailes. 2013. Synchronization Can Influence Trust Following Virtual Interaction. Experimental Psychology 60, 1 (Oct. 2013), 53–63. https://doi.org/10.1027/1618-3169/a000173",
      "doi": ""
    },
    {
      "text": "Jacques Launay, Roger T. Dean, and Freya Bailes. 2014. Synchronising movements with the sounds of a virtual partner enhances partner likeability. Cognitive Processing 15, 4 (Nov. 2014), 491–501. https://doi.org/10.1007/s10339-014-0618-0",
      "doi": ""
    },
    {
      "text": "Andreas Linn. 2017. Gaze Teleportation in Virtual Reality. Ph. D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Donghee Yvette Wohn. 2020. \"Talking without a Voice\": Understanding Non-verbal Communication in Social Virtual Reality. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2 (Oct. 2020), 1–25. https://doi.org/10.1145/3415246",
      "doi": "10.1145/3415246"
    },
    {
      "text": "Andrii Matviienko, Florian Müller, Martin Schmitz, Marco Fendrich, and Max Mühlhäuser. 2022. SkyPort: Investigating 3D Teleportation Methods in Virtual Environments. In CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3491102.3501983"
    },
    {
      "text": "Sven Mayer, Valentin Schwind, Robin Schweigert, and Niels Henze. 2018. The Effect of Offset Correction and Cursor on Mid-Air Pointing in Real and Virtual Environments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–13. https://doi.org/10.1145/3173574.3174227",
      "doi": "10.1145/3173574.3174227"
    },
    {
      "text": "Morgan McCullough, Hong Xu, Joel Michelson, Matthew Jackoski, Wyatt Pease, William Cobb, William Kalescky, Joshua Ladd, and Betsy Williams. 2015. Myo arm: swinging to explore a VE. In Proceedings of the ACM SIGGRAPH Symposium on Applied Perception. ACM, Tübingen Germany, 107–113. https://doi.org/10.1145/2804408.2804416",
      "doi": "10.1145/2804408.2804416"
    },
    {
      "text": "Florian Müller, Arantxa Ye, Dominik Schön, and Julian Rasch. 2023. Undo-Port: Exploring the Influence of Undo-Actions for Locomotion in Virtual Reality on the Efficiency, Spatial Understanding and User Experience.. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. ACM, Hamburg, Germany, 1–14. https://doi.org/10.1145/3544548.3581557",
      "doi": "10.1145/3544548.3581557"
    },
    {
      "text": "Niels Christian Nilsson, Tabitha Peck, Gerd Bruder, Eri Hodgson, Stefania Serafin, Mary Whitton, Frank Steinicke, and Evan Suma Rosenberg. 2018. 15 Years of Research on Redirected Walking in Immersive Virtual Environments. IEEE Computer Graphics and Applications 38, 2 (March 2018), 44–56. https://doi.org/10.1109/MCG.2018.111125628",
      "doi": "10.1109/MCG.2018.111125628"
    },
    {
      "text": "Andrzej Nowak, Robin R. Vallacher, Michal Zochowski, and Agnieszka Rychwalska. 2017. Functional Synchronization: The Emergence of Coordinated Activity in Human Systems. Frontiers in Psychology 8 (June 2017), 945. https://doi.org/10.3389/fpsyg.2017.00945",
      "doi": ""
    },
    {
      "text": "Sharif Razzaque. 2005. Redirected walking. The University of North Carolina at Chapel Hill.",
      "doi": "10.5555/1124097"
    },
    {
      "text": "Paul Reddish, Ronald Fischer, and Joseph Bulbulia. 2013. Let’s Dance Together: Synchrony, Shared Intentionality and Cooperation. PLoS ONE 8, 8 (Aug. 2013), e71182. https://doi.org/10.1371/journal.pone.0071182",
      "doi": ""
    },
    {
      "text": "Raquel Breejon Robinson, Elizabeth Reid, Ansgar E. Depping, Regan Mandryk, James Collin Fey, and Katherine Isbister. 2019. ’In the Same Boat’,: A Game of Mirroring Emotions for Enhancing Social Play. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–4. https://doi.org/10.1145/3290607.3313268",
      "doi": "10.1145/3290607.3313268"
    },
    {
      "text": "Holger Salzmann and Bernd Froehlich. 2008. The Two-User Seating Buck: Enabling Face-to-Face Discussions of Novel Car Interface Concepts. In 2008 IEEE Virtual Reality Conference. IEEE, Reno, NV, USA, 75–82. https://doi.org/10.1109/VR.2008.4480754",
      "doi": ""
    },
    {
      "text": "Mel Slater and Martin Usoh. 1994. Body centred interaction in immersive virtual environments. Artificial life and virtual reality 1, 1994 (1994), 125–148.",
      "doi": ""
    },
    {
      "text": "B. Tarr, M. Slater, and E. Cohen. 2018. Synchrony and social connection in immersive Virtual Reality. Scientific Reports 8, 1 (Dec. 2018), 3693. https://doi.org/10.1038/s41598-018-21765-4",
      "doi": ""
    },
    {
      "text": "Julius von Willich, Martin Schmitz, Florian Müller, Daniel Schmitt, and Max Mühlhäuser. 2020. Podoportation: Foot-Based Locomotion in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376626",
      "doi": "10.1145/3313831.3376626"
    },
    {
      "text": "Weijia Wang, Steven Baker, and Andrew Irlitti. 2020. Exploring the Effects of User Control on Social Engagement in Virtual Reality. In 32nd Australian Conference on Human-Computer Interaction. ACM, Sydney NSW Australia, 253–262. https://doi.org/10.1145/3441000.3441076",
      "doi": "10.1145/3441000.3441076"
    },
    {
      "text": "Tim Weissker, Pauline Bimberg, and Bernd Froehlich. 2020. Getting There Together: Group Navigation in Distributed Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 26, 5 (May 2020), 1860–1870. https://doi.org/10.1109/TVCG.2020.2973474",
      "doi": ""
    },
    {
      "text": "Tim Weissker, Pauline Bimberg, and Bernd Froehlich. 2021. An Overview of Group Navigation in Multi-User Virtual Reality. In 2021 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, Lisbon, Portugal, 363–369. https://doi.org/10.1109/VRW52623.2021.00073",
      "doi": ""
    },
    {
      "text": "Tim Weissker, Pauline Bimberg, Ankith Kodanda, and Bernd Froehlich. 2022. Holding Hands for Short-Term Group Navigation in Social Virtual Reality. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, Christchurch, New Zealand, 728–729. https://doi.org/10.1109/VRW55335.2022.00215",
      "doi": ""
    },
    {
      "text": "Tim Weissker and Bernd Froehlich. 2021. Group Navigation for Guided Tours in Distributed Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 27, 5 (May 2021), 2524–2534. https://doi.org/10.1109/TVCG.2021.3067756",
      "doi": ""
    },
    {
      "text": "Tim Weissker, Alexander Kulik, and Bernd Froehlich. 2019. Multi-Ray Jumping: Comprehensible Group Navigation for Collocated Users in Immersive Virtual Reality. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Osaka, Japan, 136–144. https://doi.org/10.1109/VR.2019.8797807",
      "doi": ""
    },
    {
      "text": "Robin Welsch, Christoph von Castell, and Heiko Hecht. 2019. The anisotropy of personal space. PLOS ONE 14, 6 (June 2019), e0217587. https://doi.org/10.1371/journal.pone.0217587",
      "doi": ""
    },
    {
      "text": "Scott S. Wiltermuth and Chip Heath. 2009. Synchrony and Cooperation. Psychological Science 20, 1 (Jan. 2009), 1–5. https://doi.org/10.1111/j.1467-9280.2008.02253.x",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver BC Canada, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Dennis Wolf, Katja Rogers, Christoph Kunder, and Enrico Rukzio. 2020. JumpVR: Jump-Based Locomotion Augmentation for Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–12. https://doi.org/10.1145/3313831.3376243",
      "doi": "10.1145/3313831.3376243"
    }
  ]
}