{
  "doi": "10.1145/3544548.3581257",
  "title": "Attached to “The Algorithm”: Making Sense of Algorithmic Precarity on Instagram",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "This work explores how users navigate the opaque and ever-changing algorithmic processes that dictate visibility on Instagram through the lens of Attachment Theory. We conducted thematic analysis on 1,100 posts and comments on r/Instagram to understand how users engage in collective sensemaking with regards to Instagram’s algorithms, user-perceived punishments, and strategies to counteract algorithmic precarity. We found that the unpredictability in how Instagram rewards or punishes a user can lead to distress, hypervigilance, and a need to appease “the algorithm’’. We therefore frame these findings through Attachment Theory, drawing upon the metaphor of Instagram as an unreliable paternalistic figure that inconsistently rewards users [74]. User experiences are then contextualized through the lens of anxious, avoidant, disorganized, and secure attachment. We conclude by making suggestions for fostering secure attachment towards the Instagram algorithm, by suggesting potential strategies to help users successfully cope with uncertainty.",
  "tags": [
    "algorithmic precarity",
    "thematic analysis",
    "social media and mental health",
    "social media algorithms",
    "Instagram",
    "folk theorization",
    "algorithmic transparency",
    "Attachment Theory",
    "content moderation"
  ],
  "authors": [
    {
      "name": "Yim Register",
      "institution": "Information School, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659571171",
      "orcid": "0000-0002-9206-2692"
    },
    {
      "name": "Lucy Qin",
      "institution": "Brown University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778670",
      "orcid": "0000-0002-7925-7620"
    },
    {
      "name": "Amanda Baughan",
      "institution": "Paul G. Allen School of Computer Science and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527940",
      "orcid": "0000-0003-2217-6974"
    },
    {
      "name": "Emma S. Spiro",
      "institution": "Information School, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442615955",
      "orcid": "0000-0002-6792-3390"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Nala Cat. https://www.instagram.com/nala_cat/?hl=en",
      "doi": ""
    },
    {
      "text": "Adam Mosseri. 2021. Shedding More Light on How Instagram Works. https://about.instagram.com/blog/announcements/shedding-more-light-on-how-instagram-works",
      "doi": ""
    },
    {
      "text": "Allison McDonald, Catherine Barwulor, Michelle L. Mazurek, Florian Schaub, and Elissa Redmiles. 2021. \"It’s stressful having all these phones\": Investigating Sex Workers’ Safety Goals, Risks, and Practices Online. In Proceedings of the 30th USENIX Security Symposium (USENIX Security 21). USENIX Association. https://www.usenix.org/conference/usenixsecurity21/presentation/mcdonald",
      "doi": ""
    },
    {
      "text": "Andrew Hutchinson. 2020. Instagram Looks to Crackdown on Bots with New Review and ID Process. Social Media Today (Aug. 2020). https://www.socialmediatoday.com/news/instagram-looks-to-crackdown-on-bots-with-new-review-and-id-process/583491/",
      "doi": ""
    },
    {
      "text": "Carolina Are. 2021. The Shadowban Cycle: an autoethnography of pole dancing, nudity and censorship on Instagram. Feminist Media Studies(2021), 1–18.",
      "doi": ""
    },
    {
      "text": "Christy Ashley and Tracy Tuten. 2015. Creative strategies in social media marketing: An exploratory study of branded social content and consumer engagement. Psychology & Marketing 32, 1 (2015), 15–27.",
      "doi": ""
    },
    {
      "text": "Kim Bartholomew. 1993. From childhood to adult relationships: Attachment theory and research.(1993).",
      "doi": ""
    },
    {
      "text": "Kim Bartholomew and Leonard M Horowitz. 1991. Attachment styles among young adults: a test of a four-category model.Journal of personality and social psychology 61, 2(1991), 226.",
      "doi": ""
    },
    {
      "text": "Sophie Bishop. 2018. Anxiety, panic and self-optimization: Inequalities and the YouTube algorithm. Convergence 24, 1 (2018), 69–84.",
      "doi": ""
    },
    {
      "text": "Sophie Bishop. 2019. Managing visibility on YouTube through algorithmic gossip. New media & society 21, 11-12 (2019), 2589–2606.",
      "doi": ""
    },
    {
      "text": "Sophie Bishop. 2020. Algorithmic experts: Selling algorithmic lore on YouTube. Social Media+ Society 6, 1 (2020), 2056305119897323.",
      "doi": ""
    },
    {
      "text": "Roz Boustead and Mal Flack. 2021. Moderated-mediation analysis of problematic social networking use: The role of anxious attachment orientation, fear of missing out and satisfaction with life. Addictive Behaviors 119(2021), 106938.",
      "doi": ""
    },
    {
      "text": "Inge Bretherton. 1985. Attachment theory: Retrospect and prospect. Monographs of the society for research in child development (1985), 3–35.",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2012. Want to be on the top? Algorithmic power and the threat of invisibility on Facebook. New media & society 14, 7 (2012), 1164–1180.",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2017. The algorithmic imaginary: exploring the ordinary affects of Facebook algorithms. Information, communication & society 20, 1 (2017), 30–44.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2016. How the machine ‘thinks’: Understanding opacity in machine learning algorithms. Big Data & Society 3, 1 (2016), 2053951715622512.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell, Zoe Kahn, Anne Jonas, and Daniel Griffin. 2019. When Users Control the Algorithms: Values Expressed in Practices on Twitter. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–20.",
      "doi": "10.1145/3359240"
    },
    {
      "text": "Joseph A Calandrino, Ann Kilzer, Arvind Narayanan, Edward W Felten, and Vitaly Shmatikov. 2011. \" You might also like:\" Privacy risks of collaborative filtering. In 2011 IEEE symposium on security and privacy. IEEE, 231–246.",
      "doi": "10.1109/SP.2011.40"
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer Visibility: Supporting LGBT+ Selective Visibility on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–12. https://doi.org/10.1145/3173574.3173824",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Casey Newton. 2016. Here’s how Twitter’s new algorithmic timeline is going to work. The Verge (Feb. 2016). https://www.theverge.com/2016/2/6/10927874/twitter-algorithmic-timeline",
      "doi": ""
    },
    {
      "text": "Janet X Chen, Allison McDonald, Yixin Zou, Emily Tseng, Kevin A Roundy, Acar Tamersoy, Florian Schaub, Thomas Ristenpart, and Nicola Dell. 2022. Trauma-Informed Computing: Towards Safer Technology Experiences for All. In CHI Conference on Human Factors in Computing Systems. 1–20.",
      "doi": ""
    },
    {
      "text": "Mingming Cheng and Carmel Foley. 2019. Algorithmic management: The case of Airbnb. International Journal of Hospitality Management 83 (Oct. 2019), 33–36. https://doi.org/10.1016/j.ijhm.2019.04.009",
      "doi": ""
    },
    {
      "text": "Kelley Cotter. 2019. Playing the visibility game: How digital influencers and algorithms negotiate influence on Instagram. New Media & Society 21, 4 (2019), 895–913.",
      "doi": ""
    },
    {
      "text": "Kelley Cotter. 2021. “Shadowbanning is not a thing”: black box gaslighting and the power to independently know and credibly critique algorithms. Information, Communication & Society(2021), 1–18.",
      "doi": ""
    },
    {
      "text": "Kelley Marie Cotter. 2020. Critical Algorithmic Literacy: Power, Epistemology, and Platforms. Michigan State University.",
      "doi": ""
    },
    {
      "text": "Rachael A Dansby Olufowote, Stephen T Fife, Cydney Schleiden, and Jason B Whiting. 2020. How can I become more secure?: A grounded theory of earning secure attachment. Journal of Marital and Family Therapy 46, 3 (2020), 489–506.",
      "doi": ""
    },
    {
      "text": "Michael Ann DeVito. 2021. Adaptive folk theorization as a path to algorithmic literacy on changing platforms. (2021).",
      "doi": ""
    },
    {
      "text": "Michael A DeVito, Darren Gergle, and Jeremy Birnholtz. 2017. \" Algorithms ruin everything\" # RIPTwitter, Folk Theories, and Resistance to Algorithmic Change in Social Media. In Proceedings of the 2017 CHI conference on human factors in computing systems. 3163–3174.",
      "doi": "10.1145/3025453.3025659"
    },
    {
      "text": "Alicia DeVos, Aditi Dhabalia, Hong Shen, Kenneth Holstein, and Motahhare Eslami. 2022. Toward User-Driven Algorithm Auditing: Investigating users’ strategies for uncovering harmful algorithmic behavior. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–19. https://doi.org/10.1145/3491102.3517441",
      "doi": "10.1145/3491102.3517441"
    },
    {
      "text": "Lisa M Diamond. 2001. Contributions of psychophysiology to research on adult attachment: Review and recommendations. Personality and Social Psychology Review 5, 4 (2001), 276–295.",
      "doi": ""
    },
    {
      "text": "Brooke Erin Duffy, Annika Pinch, Shruti Sannon, and Megan Sawey. 2021. The nested precarities of creative labor on social media. Social Media+ Society 7, 2 (2021), 20563051211021368.",
      "doi": ""
    },
    {
      "text": "Maria Chiara D’Arienzo, Valentina Boursier, and Mark D Griffiths. 2019. Addiction to social media and attachment styles: a systematic literature review. International Journal of Mental Health and Addiction 17, 4 (2019), 1094–1118.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. \" I always assumed that I wasn’t really that close to [her]\" Reasoning about Invisible Algorithms in News Feeds. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 153–162.",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Motahhare Eslami, Kristen Vaccaro, Min Kyung Lee, Amit Elazari Bar On, Eric Gilbert, and Karrie Karahalios. 2019. User attitudes towards algorithmic opacity and transparency in online reviewing platforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300724"
    },
    {
      "text": "Fatemeh Alizadeh and Gunnar Stevens. 2020. Think like a Human, Act like a Bot: Explaining Instagram’s Automatic Ban Decisions. In Conference on Human Factors in Computing Systems Extended Abstracts 2020. ACM, Honolulu, Hawaii.",
      "doi": ""
    },
    {
      "text": "Gretchen Faust. 2017. Hair, blood and the nipple. In Digital Environments. transcript-Verlag, 159–170.",
      "doi": ""
    },
    {
      "text": "RM Pasco Fearon and Glenn I Roisman. 2017. Attachment theory: progress and future directions. Current Opinion in Psychology 15 (2017), 131–136.",
      "doi": ""
    },
    {
      "text": "Ted Fleming. 2008. A Secure Base for Adult Learning: Attachment Theory and Adult Education.adult learner: the Irish journal of adult and community education 33 (2008), 53.",
      "doi": ""
    },
    {
      "text": "Patricia I Fusch Ph D and Lawrence R Ness. 2015. Are we there yet? Data saturation in qualitative research. (2015).",
      "doi": ""
    },
    {
      "text": "Ysabel Gerrard. 2018. Beyond the hashtag: Circumventing content moderation on social media. New Media & Society 20, 12 (2018), 4492–4511.",
      "doi": ""
    },
    {
      "text": "Isabel Goodwin. 2003. The relevance of attachment theory to the philosophy, organization, and practice of adult mental health care. Clinical Psychology Review 23, 1 (2003), 35–56.",
      "doi": ""
    },
    {
      "text": "Jami Grich. 2001. Earned secure attachment in young adulthood: Adjustment and relationship satisfaction. Texas A&M University.",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Daniel Delmonaco, Peipei Nie, and Andrea Wegner. 2021. Disproportionate Removals and Differing Content Moderation Experiences for Conservative, Transgender, and Black Social Media Users: Marginalization and Moderation Gray Areas. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–35.",
      "doi": "10.1145/3479610"
    },
    {
      "text": "Elizabeth Harlow. 2021. Attachment theory: Developments, debates and recent applications in social work, social care and education. Journal of Social Work Practice 35, 1 (2021), 79–91.",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010. Most people are not WEIRD. Nature 466, 7302 (2010), 29–29.",
      "doi": ""
    },
    {
      "text": "Eelco Herder and Boping Zhang. 2019. Unexpected and unpredictable: Factors that make personalized advertisements creepy. In Proceedings of the 23rd International Workshop on Personalization and Recommendation on the Web and Beyond. 1–6.",
      "doi": "10.1145/3345002.3349285"
    },
    {
      "text": "Alexis Hiniker, Sungsoo Hong, Tadayoshi Kohno, and Julie A Kientz. 2016. MyTime: designing and evaluating an intervention for smartphone non-use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4746–4757.",
      "doi": "10.1145/2858036.2858403"
    },
    {
      "text": "Robert Hinson, Henry Boateng, Anne Renner, and John Paul Basewe Kosiba. 2019. Antecedents and consequences of customer engagement on Facebook: An attachment theory perspective. Journal of Research in Interactive Marketing (2019).",
      "doi": ""
    },
    {
      "text": "David Howe. 1995. Attachment theory for social work practice. Macmillan International Higher Education.",
      "doi": ""
    },
    {
      "text": "Hubspot. 2022. Instagram Marketing. https://www.hubspot.com/instagram-marketing",
      "doi": ""
    },
    {
      "text": "Instagram. 2016. See Posts you Care About First in your Feed. https://about.instagram.com/blog/announcements/see-posts-you-care-about-first-in-your-feed",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Darren Scott Appling, Eric Gilbert, and Amy Bruckman. 2019. \"Did You Suspect the Post Would be Removed?\": Understanding User Reactions to Content Removals on Reddit. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 1–33. https://doi.org/10.1145/3359294",
      "doi": "10.1145/3359294"
    },
    {
      "text": "Shagun Jhaver, Yoni Karpfen, and Judd Antin. 2018. Algorithmic Anxiety and Coping Strategies of Airbnb Hosts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–12. https://doi.org/10.1145/3173574.3173995",
      "doi": "10.1145/3173574.3173995"
    },
    {
      "text": "Nadia Karizat, Dan Delmonaco, Motahhare Eslami, and Nazanin Andalibi. 2021. Algorithmic Folk Theories and Identity: How TikTok Users Co-Produce Knowledge of Identity and Engage in Algorithmic Resistance. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2 (Oct. 2021), 1–44. https://doi.org/10.1145/3476046",
      "doi": "10.1145/3476046"
    },
    {
      "text": "Celeste Kidd, Holly Palmeri, and Richard N Aslin. 2013. Rational snacking: Young children’s decision-making on the marshmallow task is moderated by beliefs about environmental reliability. Cognition 126, 1 (2013), 109–114.",
      "doi": ""
    },
    {
      "text": "Eunhyang Kim and Eunyoung Koh. 2018. Avoidant attachment and smartphone addiction in college students: The mediating effects of anxiety and self-esteem. Computers in Human Behavior 84 (2018), 264–271.",
      "doi": "10.1016/j.chb.2018.02.037"
    },
    {
      "text": "Thomas David Knestrict. 2002. A post-modern critique of attachment theory: Moving towards a socially just ecological framework. University of Cincinnati.",
      "doi": ""
    },
    {
      "text": "Vladimir J Konečni. 2010. Responsible behavioral science generalizations and applications require much more than non-WEIRD samples. Behavioral and Brain Sciences 33, 2-3 (2010), 98–99.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 1603–1612. https://doi.org/10.1145/2702123.2702548",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Renkai Ma and Yubo Kou. 2021. \" How advertiser-friendly is my video?\": YouTuber’s Socioeconomic Interactions with Algorithmic Content Moderation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": "10.1145/3479573"
    },
    {
      "text": "Kelly Mack, Emma McDonnell, Dhruv Jain, Lucy Lu Wang, Jon E. Froehlich, and Leah Findlater. 2021. What do we mean by “accessibility research”? A literature survey of accessibility papers in CHI and ASSETS from 1994 to 2019. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3411764.3445412"
    },
    {
      "text": "Mary Main, Judith Solomon, 1990. Procedures for identifying infants as disorganized/disoriented during the Ainsworth Strange Situation. Attachment in the preschool years: Theory, research, and intervention 1 (1990), 121–160.",
      "doi": ""
    },
    {
      "text": "Brandeis Marshall. 2021. Algorithmic misogynoir in content moderation practice. Technical Report. Technical Report. Heinrich-Böll-Stiftung.",
      "doi": ""
    },
    {
      "text": "Ally McCrow-Young. 2021. Approaching Instagram data: reflections on accessing, archiving and anonymising visual social media. Communication Research and Practice 7, 1 (2021), 21–34.",
      "doi": ""
    },
    {
      "text": "Lachlan A McWilliams and Gordon JG Asmundson. 2007. The relationship of adult attachment dimensions to pain-related fear, hypervigilance, and catastrophizing. Pain 127, 1-2 (2007), 27–34.",
      "doi": ""
    },
    {
      "text": "Robert T Muller. 2009. Trauma and dismissing (avoidant) attachment: Intervention strategies in individual psychotherapy.Psychotherapy: Theory, Research, Practice, Training 46, 1 (2009), 68.",
      "doi": ""
    },
    {
      "text": "Tyler Musgrave, Alia Cummings, and Sarita Schoenebeck. 2022. Experiences of Harm, Healing, and Joy among Black Women and Femmes on Social Media. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–17. https://doi.org/10.1145/3491102.3517608",
      "doi": "10.1145/3491102.3517608"
    },
    {
      "text": "Sarah Myers West. 2018. Censored, suspended, shadowbanned: User interpretations of content moderation on social media platforms. New Media & Society 20, 11 (2018), 4366–4383.",
      "doi": ""
    },
    {
      "text": "Lorelli S Nowell, Jill M Norris, Deborah E White, and Nancy J Moules. 2017. Thematic analysis: Striving to meet the trustworthiness criteria. International journal of qualitative methods 16, 1 (2017), 1609406917733847.",
      "doi": ""
    },
    {
      "text": "Thiago Dias Oliva, Dennys Marcelo Antonialli, and Alessandra Gomes. 2021. Fighting hate speech, silencing drag queens? artificial intelligence in content moderation and risks to lgbtq voices online. Sexuality & Culture 25, 2 (2021), 700–732.",
      "doi": ""
    },
    {
      "text": "Ramona L Paetzold, W Steven Rholes, and Jamie L Kohn. 2015. Disorganized attachment in adulthood: Theory, measurement, and implications for romantic relationships. Review of General Psychology 19, 2 (2015), 146–156.",
      "doi": ""
    },
    {
      "text": "Laurie Anne Pearlman and Christine A Courtois. 2005. Clinical applications of the attachment framework: Relational treatment of complex trauma. Journal of Traumatic Stress: Official Publication of The International Society for Traumatic Stress Studies 18, 5 (2005), 449–459.",
      "doi": ""
    },
    {
      "text": "Jane L Pearson, Deborah A Cohn, Philip A Cowan, and Carolyn Pape Cowan. 1994. Earned-and continuous-security in adult attachment: Relation to depressive symptomatology and parenting style. Development and psychopathology 6, 2 (1994), 359–373.",
      "doi": ""
    },
    {
      "text": "Caitlin Petre, Brooke Erin Duffy, and Emily Hund. 2019. “Gaming the system”: Platform paternalism and the politics of algorithmic visibility. Social Media+ Society 5, 4 (2019), 2056305119879995.",
      "doi": ""
    },
    {
      "text": "Michael I Posner and Mary K Rothbart. 2000. Developing mechanisms of self-regulation. Development and psychopathology 12, 3 (2000), 427–441.",
      "doi": ""
    },
    {
      "text": "Pushshift. 2019. Pushshift. https://github.com/pushshift/api",
      "doi": ""
    },
    {
      "text": "Lauren Rouse and Anastasia Salter. 2021. Cosplay on demand? Instagram, OnlyFans, and the gendered fantrepreneur. Social Media+ Society 7, 3 (2021), 20563051211042397.",
      "doi": ""
    },
    {
      "text": "Pat Sable. 1994. Anxious attachment in adulthood: Therapeutic implications. Journal of Analytic Social Work 2, 1 (1994), 5–24.",
      "doi": ""
    },
    {
      "text": "Pat Sable. 1995. Attachment theory and post-traumatic stress disorder. Journal of Analytic Social Work 2, 4 (1995), 89–109.",
      "doi": ""
    },
    {
      "text": "Sapna Maheshwari. 2018. Uncovering Instagram Bots With a New Kind of Detective Work. The New York Times (March 2018). https://www.nytimes.com/2018/03/12/business/media/instagram-bots.html?searchResultPosition=1",
      "doi": ""
    },
    {
      "text": "Rachel Saunders, Deborah Jacobvitz, Maria Zaccagnino, Lauren M Beverung, and Nancy Hazen. 2011. Pathways to earned-security: The role of alternative support figures. Attachment & human development 13, 4 (2011), 403–420.",
      "doi": ""
    },
    {
      "text": "Ilene Schecter. 2013. A secure place: Attachment patterns and socioeconomic status. (2013).",
      "doi": ""
    },
    {
      "text": "Phillip R Shaver and Mario Mikulincer. 2002. Attachment-related psychodynamics. Attachment & human development 4, 2 (2002), 133–161.",
      "doi": ""
    },
    {
      "text": "Jack P Shonkoff. 2003. From neurons to neighborhoods: old and new challenges for developmental and behavioral pediatrics. Journal of Developmental & Behavioral Pediatrics 24, 1(2003), 70–76.",
      "doi": ""
    },
    {
      "text": "Bret L Simmons, Janaki Gooty, Debra L Nelson, and Laura M Little. 2009. Secure attachment: Implications for hope, trust, burnout, and performance. Journal of Organizational Behavior: The International Journal of Industrial, Occupational and Organizational Psychology and Behavior 30, 2(2009), 233–247.",
      "doi": ""
    },
    {
      "text": "Jeffry A Simpson and W Steven Rholes. 2017. Adult attachment, stress, and romantic relationships. Current opinion in psychology 13 (2017), 19–24.",
      "doi": ""
    },
    {
      "text": "Lynne Marie Stöven and Philipp Yorck Herzberg. 2021. Relationship 2.0: A systematic review of associations between the use of social network sites and attachment style. Journal of Social and Personal Relationships 38, 3(2021), 1103–1128.",
      "doi": ""
    },
    {
      "text": "PO Svanberg, Lisa Mennet, and Susan Spieker. 2010. Promoting a secure attachment: A primary prevention practice model. Clinical Child Psychology and Psychiatry 15, 3 (2010), 363–378.",
      "doi": ""
    },
    {
      "text": "The Instagram Team. [n.d.]. Community Guidelines. https://help.instagram.com/477434105621119",
      "doi": ""
    },
    {
      "text": "Kim Toffoletti, Holly Thorpe, Adele Pavlidis, Rebecca Olive, and Claire Moran. 2021. Visibility and vulnerability on Instagram: negotiating safety in women’s online-offline fitness spaces. Leisure Sciences (2021), 1–19.",
      "doi": ""
    },
    {
      "text": "M-P Vaillancourt-Morel, M-È Daspe, Y Lussier, and C Giroux-Benoît. 2020. For the love of being liked: a moderated mediation model of attachment, likes-seeking behaviors, and problematic Facebook use. Addiction Research & Theory 28, 5 (2020), 397–405.",
      "doi": ""
    },
    {
      "text": "Rebecca A VanMeter, Douglas B Grisaffe, and Lawrence B Chonko. 2015. Of “likes” and “pins”: The effects of consumers’ attachment to social media. Journal of Interactive Marketing 32 (2015), 70–88.",
      "doi": ""
    },
    {
      "text": "Robert J Waldinger, Marc S Schulz, Arthur J Barsky, and David K Ahern. 2006. Mapping the road from childhood trauma to adult somatization: the role of attachment. Psychosomatic medicine 68, 1 (2006), 129–135.",
      "doi": ""
    },
    {
      "text": "Jing Zeng and D Bondy Valdovinos Kaye. 2022. From content moderation to visibility moderation: A case study of platform governance on TikTok. Policy & Internet 14, 1 (2022), 79–95.",
      "doi": ""
    }
  ]
}