{
  "doi": "10.1145/3544548.3580951",
  "title": "Tactilient: Turbulence resilient tactile icons for pilot feedback",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Given the high attentional demand in aircraft cockpits, tactons can be used to deliver information without overloading the visual and auditory channels. However, aircraft are subject to turbulence that interfere with vibrotactile feedback. To investigate the impact of turbulence on tacton identification, 18 participants tried to identify 9 tactons with varying intensity and rhythm, while experiencing uncomfortable and very uncomfortable levels of mechanical vibration defined in ISO 2631-1. The results show that the effectiveness of tactile communication decreases with the rhythm identification performance as the level of turbulence increases. In our study, an RMS acceleration delta of 0.70 Grms between two consecutive tactons guaranteed near zero confusion. Based on their experience performing the study, participants built tactons that included 4 pulses, lasted for at least 350 ms and vibrated at no less than 1.25 Grms to be comfortably perceived. Our results will support practitioners for designing tactons that can be more resilient to turbulence.",
  "authors": [
    {
      "name": "Dong-Bach Vo",
      "institution": "ENAC, Université de Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444596443",
      "orcid": "0000-0002-2391-5583"
    },
    {
      "name": "Sylvain Pauchet",
      "institution": "ENAC, Université de Toulouse, France",
      "img": "/do/10.1145/contrib-99659122644/rel-imgonly/ident.jpg",
      "acmid": "99659122644",
      "orcid": "0000-0001-7752-1101"
    },
    {
      "name": "Isabelle Jolly",
      "institution": "ENAC, Université de Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780283",
      "orcid": "0000-0002-4619-3456"
    },
    {
      "name": "Florine Simon",
      "institution": "ENAC, Université de Toulouse, France",
      "img": "/do/10.1145/contrib-99659366457/rel-imgonly/31394675_1623089604485661_1459836030915872511_n.jpg",
      "acmid": "99659366457",
      "orcid": "0000-0003-2852-4423"
    },
    {
      "name": "Anke M. Brock",
      "institution": "ENAC, Université de Toulouse, France",
      "img": "/do/10.1145/contrib-81479641265/rel-imgonly/ankebrock3-cutout.jpg",
      "acmid": "81479641265",
      "orcid": "0000-0002-0017-396X"
    },
    {
      "name": "Jérémie Garcia",
      "institution": "ENAC, Université de Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502729419",
      "orcid": "0000-0001-7076-6229"
    }
  ],
  "references": [
    {
      "text": "Huseyin Avsar, Joel E. Fischer, and Tom Rodden. 2016. Designing touch screen user interfaces for future flight deck operations. In 2016 IEEE/AIAA 35th Digital Avionics Systems Conference (DASC). IEEE, Sacramento, CA, USA, 1–9. https://doi.org/10.1109/DASC.2016.7777976",
      "doi": ""
    },
    {
      "text": "M. Azadi and L. Jones. 2013. Identification of vibrotactile patterns: building blocks for tactons. In 2013 World Haptics Conference (WHC). IEEE, Daejeon, 347–352. https://doi.org/10.1109/WHC.2013.6548433",
      "doi": ""
    },
    {
      "text": "Mojtaba Azadi and Lynette A. Jones. 2014. Evaluating Vibrotactile Dimensions for the Design of Tactons. IEEE Transactions on Haptics 7, 1 (Jan. 2014), 14–23. https://doi.org/10.1109/TOH.2013.2296051",
      "doi": "10.1109/TOH.2013.2296051"
    },
    {
      "text": "Stephen Brewster and Lorna M. Brown. 2004. Tactons: Structured Tactile Messages for Non-Visual Information Display. In Proceedings of the Fifth Conference on Australasian User Interface - Volume 28 (Dunedin, New Zealand) (AUIC ’04). Australian Computer Society, Inc., AUS, 15–23.",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "A. J. Brisben, S. S. Hsiao, and K. O. Johnson. 1999. Detection of Vibration Transmitted Through an Object Grasped in the Hand. Journal of Neurophysiology 81, 4 (apr 1999), 1548–1558. https://doi.org/10.1152/jn.1999.81.4.1548",
      "doi": ""
    },
    {
      "text": "L.M. Brown, S.A. Brewster, and H.C. Purchase. 2005. A First Investigation into the Effectiveness of Tactons. In First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 167–176. https://doi.org/10.1109/WHC.2005.6",
      "doi": "10.1109/WHC.2005.6"
    },
    {
      "text": "Lorna M. Brown, Stephen A. Brewster, and Helen C. Purchase. 2006. Multidimensional tactons for non-visual information presentation in mobile devices. ACM International Conference Proceeding Series 159 (2006), 231–238. https://doi.org/10.1145/1152215.1152265",
      "doi": "10.1145/1152215.1152265"
    },
    {
      "text": "Alma Cantu, Jean-luc Vinot, Catherine Letondal, Sylvain Pauchet, and Mickaël Causse. 2021. Does folding improve the usability of interactive surfaces in future airliner cockpits An evaluation under turbulent conditions and varying cognitive load. In 32e Conférence Francophone sur l’Interaction Homme-Machine. ACM, New York, NY, USA, 1–10. https://doi.org/10.1145/3450522.3451246",
      "doi": "10.1145/3450522.3451246"
    },
    {
      "text": "Eric T. Chancey, J. Christopher Brill, Adam Sitz, Ulrike Schmuntzsch, and James P. Bliss. 2014. Vibrotactile Stimuli Parameters on Detection Reaction Times. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 58, 1 (sep 2014), 1701–1705. https://doi.org/10.1177/1541931214581355",
      "doi": ""
    },
    {
      "text": "Hsiang-Yu Chen, Jaeyoung Park, Steve Dai, and Hong Z. Tan. 2011. Design and Evaluation of Identifiable Key-Click Signals for Mobile Devices. IEEE Transactions on Haptics 4, 4 (oct 2011), 229–241. https://doi.org/10.1109/TOH.2011.21",
      "doi": "10.1109/TOH.2011.21"
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, Philippe Palanque, Yannick Deleris, Catherine Trask, Ashley Coveney, Marcus Yung, and Karon MacLean. 2017. Turbulent Touch: Touchscreen Input for Cockpit Flight Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). ACM, New York, NY, USA, 6742–6753. https://doi.org/10.1145/3025453.3025584",
      "doi": "10.1145/3025453.3025584"
    },
    {
      "text": "Giulia Corniani and Hannes P. Saal. 2020. Tactile innervation densities across the whole body. Journal of Neurophysiology 124, 4 (oct 2020), 1229–1240. https://doi.org/10.1152/jn.00313.2020",
      "doi": ""
    },
    {
      "text": "Louise V. Coutts, Katherine L. Plant, Mark Smith, Luke Bolton, Katie J. Parnell, James Arnold, and Neville A. Stanton. 2019. Future technology on the flight deck: assessing the use of touchscreens in vibration environments. Ergonomics 62, 2 (feb 2019), 286–304. https://doi.org/10.1080/00140139.2018.1552013",
      "doi": ""
    },
    {
      "text": "Sonia Dodd, Jeff Lancaster, Andrew Miranda, Steve Grothe, Bob DeMers, and Bill Rogers. 2014. Touch Screens on the Flight Deck: The Impact of Touch Target Size, Spacing, Touch Technology and Turbulence on Pilot Performance. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 58, 1 (Sept. 2014), 6–10. https://doi.org/10.1177/1541931214581002",
      "doi": ""
    },
    {
      "text": "Lisa A. Elkin, Matthew Kay, James J. Higgins, and Jacob O. Wobbrock. 2021. An Aligned Rank Transform Procedure for Multifactor Contrast Tests. In The 34th Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 754–768. https://doi.org/10.1145/3472749.3474784 arxiv:2102.11824",
      "doi": "10.1145/3472749.3474784"
    },
    {
      "text": "Lars Eriksson, Jan Van Erp, Otto Carlander, Britta Levin, Hendrik Van Veen, and Hans Veltman. 2006. Vibrotactile and visual threat cueing with high G threat intercept in dynamic flight simulation. Proceedings of the Human Factors and Ergonomics Society (2006), 1547–1551. https://doi.org/10.1177/154193120605001607",
      "doi": ""
    },
    {
      "text": "Khaled Fellah and Mohamed Guiatni. 2019. Tactile Display Design for Flight Envelope Protection and Situational Awareness. IEEE Transactions on Haptics 12, 1 (jan 2019), 87–98. https://doi.org/10.1109/TOH.2018.2865302",
      "doi": ""
    },
    {
      "text": "George A Guthrie. 1969. A study of the effectiveness of a vibrotactile warning signal during whole body vibration. Ph. D. Dissertation. Texas Tech University.",
      "doi": ""
    },
    {
      "text": "Ludlow B. Hallman. 1957. Communication Management for the Aircraft. IRE Transactions on Aeronautical and Navigational Electronics ANE-4, 2(1957), 48–51. https://doi.org/10.1109/TANE3.1957.4201510",
      "doi": ""
    },
    {
      "text": "ISO2631-1:1997 1997. Mechanical vibration and shock – Evaluation of human exposure to whole-body vibration. Standard. International Organization for Standardization, Geneva, CH.",
      "doi": ""
    },
    {
      "text": "Jonghyun Ryu, Jaemin Chun, Gunhyuk Park, Seungmoon Choi, and Sung H. Han. 2010. Vibrotactile Feedback for Information Delivery in the Vehicle. IEEE Transactions on Haptics 3, 2 (apr 2010), 138–149. https://doi.org/10.1109/TOH.2010.1",
      "doi": "10.1109/TOH.2010.1"
    },
    {
      "text": "Idin Karuei, Karon E. MacLean, Zoltan Foley-Fisher, Russell MacKenzie, Sebastian Koch, and Mohamed El-Zohairy. 2011. Detecting vibrations across the body in mobile contexts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 3267–3276. https://doi.org/10.1145/1978942.1979426",
      "doi": "10.1145/1978942.1979426"
    },
    {
      "text": "Marc A. Le Pape and Ravi K. Vatrapu. 2009. An experimental study of field dependency in altered Gz environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1255–1264. http://dl.acm.org/citation.cfm?id=1518890",
      "doi": ""
    },
    {
      "text": "Barbour Perry Lee and H. P. Birmingham. 1968. Joystick Dynamics. Human Factors 10, 4 (1968), 413–418. https://doi.org/10.1177/001872086801000411",
      "doi": ""
    },
    {
      "text": "Chiuhsiang Joe Lin, Chi No Liu, Chin Jung Chao, and Hung Jen Chen. 2010. The performance of computer input devices in a vibration environment. Ergonomics 53, 4 (April 2010), 478–490. https://doi.org/10.1080/00140130903528186",
      "doi": ""
    },
    {
      "text": "Loupedeck. 2022. Loupedeck CT. Retrieved September 12, 2022 from https://loupedeck.com/products/loupedeck-ct",
      "doi": ""
    },
    {
      "text": "Luis Lutnyk, David Rudi, Emanuel Meier, Peter Kiefer, and Martin Raubal. 2022. FlyBrate: Evaluating Vibrotactile Cues for Simulated Flight. International Journal of Human–Computer Interaction 0, 0(2022), 1–18. https://doi.org/10.1080/10447318.2022.2075627",
      "doi": ""
    },
    {
      "text": "Nina Malalan and Pavel Zikmund. 2019. Vibration feedbacks in pilot-aircraft haptic interaction. In 13th Research and Education in Aircraft Design: Conference proceedings. Fakulta strojniho inzenyrstvi VUT v Brne, Brno, 98–108. https://doi.org/10.13164/conf.read.2018.10",
      "doi": ""
    },
    {
      "text": "Neil J. Mansfield. 2004. Human Response to Vibration. CRC Press. https://doi.org/10.1201/b12481",
      "doi": ""
    },
    {
      "text": "Neil J Mansfield and Geetika Aggarwal. 2022. Whole-Body Vibration Experienced by Pilots, Passengers and Crew in Fixed-Wing Aircraft: A State-of-the-Science Review. Vibration 5, 1 (feb 2022), 110–120. https://doi.org/10.3390/vibration5010007",
      "doi": ""
    },
    {
      "text": "Sven Mayer, Huy Viet Le, Alessandro Nesti, Niels Henze, Heinrich H. Bülthoff, and Lewis L. Chuang. 2018. The Effect of Road Bumps on Touch Interaction in Cars. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, Toronto ON Canada, 85–93. https://doi.org/10.1145/3239060.3239071",
      "doi": "10.1145/3239060.3239071"
    },
    {
      "text": "Miyuki Morioka and Michael J. Griffin. 2006. Magnitude-dependence of equivalent comfort contours for fore-and-aft, lateral and vertical whole-body vibration. Journal of Sound and Vibration 298, 3 (2006), 755–772. https://doi.org/10.1016/j.jsv.2006.06.011",
      "doi": ""
    },
    {
      "text": "Stefano Papetti, Hanna Jarvelainen, Bruno L. Giordano, Sebastien Schiesser, and Martin Frohlich. 2017. Vibrotactile Sensitivity in Active Touch: Effect of Pressing Force. IEEE Transactions on Haptics 10, 1 (jan 2017), 113–122. https://doi.org/10.1109/TOH.2016.2582485",
      "doi": "10.1109/TOH.2016.2582485"
    },
    {
      "text": "Guy Peryer, Jan Noyes, Kit Pleydell-Pearce, and Nick Lieven. 2005. Auditory Alert Characteristics: A Survey of Pilot Views. The International Journal of Aviation Psychology 15, 3 (jul 2005), 233–250. https://doi.org/10.1207/s15327108ijap1503_2",
      "doi": ""
    },
    {
      "text": "Sara L. Riggs, Christopher D. Wickens, Nadine Sarter, Lisa C. Thomas, Mark I. Nikolic, and Angelia Sebok. 2017. Multimodal Information Presentation in Support of NextGen Operations. The International Journal of Aerospace Psychology 27, 1-2 (apr 2017), 29–43. https://doi.org/10.1080/10508414.2017.1365608",
      "doi": ""
    },
    {
      "text": "Carolina Rodriguez-Paras, Johnathan T. McKenzie, Pasakorn Choterungruengkorn, and Thomas K. Ferris. 2021. Severity-Mapped Vibrotactile Cues to Support Interruption Management with Weather Messaging in the General Aviation Cockpit. Atmosphere 12, 3 (mar 2021), 341. https://doi.org/10.3390/atmos12030341",
      "doi": ""
    },
    {
      "text": "A.H. Rupert. 2000. An instrumentation solution for reducing spatial disorientation mishaps. IEEE Engineering in Medicine and Biology Magazine 19, 2 (2000), 71–80. https://doi.org/10.1109/51.827409",
      "doi": ""
    },
    {
      "text": "AH Rupert, FE Guedry, and MF Reschke. 1994. The use of a tactile interface to convey position and motion perceptions. AGARD, Virtual Interfaces: Research and Applications (1994).",
      "doi": ""
    },
    {
      "text": "Paul M. Salmon, Michael G. Lenné, Tom Triggs, Natassia Goode, Miranda Cornelissen, and Victor Demczuk. 2011. The effects of motion on in-vehicle touch screen system operation: A battle management system case study. Transportation Research Part F: Traffic Psychology and Behaviour 14, 6 (Nov. 2011), 494–503. https://doi.org/10.1016/j.trf.2011.08.002",
      "doi": ""
    },
    {
      "text": "Yael Salzer, Tal Oron-Gilad, Adi Ronen, and Yisrael Parmet. 2011. Vibrotactile “On-Thigh” Alerting System in the Cockpit. Human Factors: The Journal of the Human Factors and Ergonomics Society 53, 2 (apr 2011), 118–131. https://doi.org/10.1177/0018720811403139",
      "doi": ""
    },
    {
      "text": "Günther Schlee, Diego Reckmann, and Thomas L. Milani. 2012. Whole body vibration training reduces plantar foot sensitivity but improves balance control of healthy subjects. Neuroscience Letters 506, 1 (jan 2012), 70–73. https://doi.org/10.1016/j.neulet.2011.10.051",
      "doi": ""
    },
    {
      "text": "Anna Schwendicke and M. Ercan Altinsoy. 2020. Frequency Masking Effects for Vertical Whole-Body Vibration for Seated Subjects. Vibration 3, 4 (oct 2020), 357–370. https://doi.org/10.3390/vibration3040024",
      "doi": ""
    },
    {
      "text": "Anna Schwendicke, Jing Dou, and M. Ercan Altinsoy. 2017. Temporal masking characteristics of whole body vibration perception. 2017 IEEE World Haptics Conference, WHC 2017 (2017), 478–483. https://doi.org/10.1109/WHC.2017.7989948",
      "doi": ""
    },
    {
      "text": "Feng Shao, Tianjiao Lu, Xiuchao Wang, Zhenfu Liu, Yuting Zhang, Xufeng Liu, and Shengjun Wu. 2021. The influence of pilot’s attention allocation on instrument reading during take-off: The mediating effect of attention span. Applied Ergonomics 90, September 2019 (jan 2021), 103245. https://doi.org/10.1016/j.apergo.2020.103245",
      "doi": ""
    },
    {
      "text": "Florine Simon, Lucia Alonso Duran, Xavier Carrau, Emeric Delacroix, Baptiste Guilbert, Jean-Paul IMBERT, Mickaël Causse, and Anke M. Brock. 2021. BLEXVFR: Designing a Mobile Assistant for Pilots. In Adjunct Publication of the 23rd International Conference on Mobile Human-Computer Interaction (Toulouse ; Virtual, France) (MobileHCI ’21 Adjunct). Association for Computing Machinery, New York, NY, USA, Article 6, 5 pages. https://doi.org/10.1145/3447527.3474852",
      "doi": "10.1145/3447527.3474852"
    },
    {
      "text": "Marieke Suijkerbuijk, Wilfred Rouwhorst, Ronald Verhoeven, and Roy Arents. 2017. Innovative cockpit touch screen HMI design using Direct Manipulation. In HFES Annual Conference. 15.",
      "doi": ""
    },
    {
      "text": "Hong Z. Tan, Charlotte M. Reed, and Nathaniel I. Durlach. 2010. Optimum information transfer rates for communication through haptic and other sensory modalities. IEEE Transactions on Haptics 3, 2 (2010), 98–108. https://doi.org/10.1109/TOH.2009.46",
      "doi": "10.1109/TOH.2009.46"
    },
    {
      "text": "David Ternes and Karon E. Maclean. 2008. Designing Large Sets of Haptic Icons with Rhythm. In Proceedings of the 6th International Conference on Haptics: Perception, Devices and Scenarios (Madrid, Spain) (EuroHaptics ’08). Springer-Verlag, Berlin, Heidelberg, 199–208. https://doi.org/10.1007/978-3-540-69057-3_24",
      "doi": "10.1007/978-3-540-69057-3_24"
    },
    {
      "text": "Kathryn G. Tippey, Trey Roady, Carolina Rodriguez-Paras, Lori J. Brown, William G. Rantz, and Thomas K. Ferris. 2017. General Aviation Weather Alerting: The Effectiveness of Different Visual and Tactile Display Characteristics in Supporting Weather-Related Decision Making. The International Journal of Aerospace Psychology 27, 3-4 (oct 2017), 121–136. https://doi.org/10.1080/24721840.2018.1443271",
      "doi": ""
    },
    {
      "text": "van Erp, Jan B. F. and Groen, Eric L. and Bos, Jelte E. and van Veen, Hendrik A. H. C.2006. A Tactile Cockpit Instrument Supports the Control of Self-Motion During Spatial Disorientation. Human Factors: The Journal of the Human Factors and Ergonomics Society 48, 2 (jun 2006), 219–228. https://doi.org/10.1518/001872006777724435",
      "doi": ""
    },
    {
      "text": "Henricus A. H. C. van Veen and Jan B. F. van Erp. 2001. Tactile information presentation in the cockpit. 2058 (2001), 174–181. https://doi.org/10.1007/3-540-44589-7_19 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "Vybronics. 2022. LV101040A - LRA Vibration Motor - VLV101040A | Vybronics. Retrieved September 12, 2022 from https://www.vybronics.com/linear-lra-vibration-motors/v-lv101040a",
      "doi": ""
    },
    {
      "text": "Vibration Motors | Coin SMD SMT LRA ERM Linear BLDC | Vybronics. 2022. Advanced Tactile Array Cueing. Retrieved September 12, 2022 from https://www.eaiinfo.com/tactor-landing/",
      "doi": ""
    },
    {
      "text": "Chundi Wang, Hu Deng, Yu Dong, Xuemin Zhang, and Da Hui Wang. 2021. The capacity and cognitive processing of vibrotactile working memory for frequency. Current PsychologyCowan 2010 (2021). https://doi.org/10.1007/s12144-021-02212-6",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle, and James J Higgins. 2011. The Aligned Rank Transform for nonparametric factorial analyses using only ANOVA procedures. In Conference on Human Factors in Computing Systems - Proceedings. ACM Press, New York, New York, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "X-SIM.de. 2022. X-SIM Motion Software, DIY Motion Simulator Community. Retrieved September 12, 2022 from https://x-sim.de/forum/portal.php",
      "doi": ""
    },
    {
      "text": "Yongjae Yoo, Juliette Regimbal, and Jeremy R. Cooperstock. 2021. Identification and Information Transfer of Multidimensional Tactons Presented by a Single Vibrotactile Actuator. In 2021 IEEE World Haptics Conference (WHC). IEEE, 7–12. https://doi.org/10.1109/WHC49131.2021.9517169",
      "doi": ""
    },
    {
      "text": "Pavel Zikmund, Miroslav Macik, Lukas Dubnicky, and Michaela Horpatzska. 2019. Comparison of Joystick guidance methods. In 2019 10th IEEE International Conference on Cognitive Infocommunications (CogInfoCom). IEEE, 265–270. https://doi.org/10.1109/CogInfoCom47531.2019.9089978",
      "doi": ""
    }
  ]
}