{
  "doi": "10.1145/3544548.3580897",
  "title": "FlowAR: How Different Augmented Reality Visualizations of Online Fitness Videos Support Flow for At-Home Yoga Exercises",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Online fitness video tutorials are an increasingly popular way to stay fit at home without a personal trainer. However, to keep the screen playing the video in view, users typically disrupt their balance and break the motion flow — two main pillars for the correct execution of yoga poses. While past research partially addressed this problem, these approaches supported only a limited view of the instructor and simple movements. To enable the fluid execution of complex full-body yoga exercises, we propose FlowAR, an augmented reality system for home workouts that shows training video tutorials as always-present virtual static and dynamic overlays around the user. We tested different overlay layouts in a study with 16 participants, using motion capture equipment for baseline performance. Then, we iterated the prototype and tested it in a furnished lab simulating home settings with 12 users. Our results highlight the advantages of different visualizations and the system’s general applicability.",
  "tags": [
    "home workouts",
    "fitness video",
    "yoga",
    "augmented reality"
  ],
  "authors": [
    {
      "name": "Hye-Young Jo",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700635",
      "orcid": "0000-0003-3847-3420"
    },
    {
      "name": "Laurenz Seidel",
      "institution": "Human Computer Interaction, Hasso Plattner Institute, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260084",
      "orcid": "0000-0003-3788-1545"
    },
    {
      "name": "Michel Pahud",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456607280",
      "orcid": "0000-0003-3924-1189"
    },
    {
      "name": "Mike Sinclair",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498872",
      "orcid": "0000-0003-4343-2332"
    },
    {
      "name": "Andrea Bianchi",
      "institution": "Industrial Design, KAIST, Korea, Republic of and School of Computing, KAIST, Korea, Republic of",
      "img": "/do/10.1145/contrib-81460654085/rel-imgonly/profile_web_hd2.jpg",
      "acmid": "81460654085",
      "orcid": "0000-0002-7500-7974"
    }
  ],
  "references": [
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: enhancing movement training with an augmented reality mirror. In Proceedings of the 26th annual ACM symposium on User interface software and technology. 311–320.",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "Valentin Bazarevsky, Ivan Grishchenko, Karthik Raveendran, Tyler Zhu, Fan Zhang, and Matthias Grundmann. 2020. Blazepose: On-device real-time body pose tracking. arXiv preprint arXiv:2006.10204(2020).",
      "doi": ""
    },
    {
      "text": "Richard Bellman and Robert Kalaba. 1959. On adaptive control processes. IRE Transactions on Automatic Control 4, 2 (1959), 1–9.",
      "doi": ""
    },
    {
      "text": "Christina Brown. 2017. The Modern Yoga Bible. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Richard P Brown and Patricia L Gerbarg. 2009. Yoga breathing, meditation, and longevity. Annals of the New York Academy of Sciences 1172, 1 (2009), 54–62.",
      "doi": ""
    },
    {
      "text": "Jacky CP Chan, Howard Leung, Jeff KT Tang, and Taku Komura. 2010. A virtual reality dance training system using motion capture technology. IEEE transactions on learning technologies 4, 2 (2010), 187–195.",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Mina Huh, and Juho Kim. 2021. Rubyslippers: Supporting content-based voice navigation for how-to videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445131"
    },
    {
      "text": "Hua-Tsung Chen, Yu-Zhen He, Chien-Li Chou, Suh-Yin Lee, Bao-Shuh P Lin, and Jen-Yu Yu. 2013. Computer-assisted self-training system for sports exercise using kinects. In 2013 IEEE International Conference on Multimedia and Expo Workshops (ICMEW). IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "Philo Tan Chua, Rebecca Crivella, Bo Daly, Ning Hu, Russ Schaaf, David Ventura, Todd Camill, Jessica Hodgins, and Randy Pausch. 2003. Training for physical tasks in virtual environments: Tai Chi. In IEEE Virtual Reality, 2003. Proceedings. IEEE, 87–94.",
      "doi": ""
    },
    {
      "text": "Rachel B Clancy, Matthew P Herring, and Mark J Campbell. 2017. Motivation measures in sport: A critical review and bibliometric analysis. Frontiers in psychology 8 (2017), 348.",
      "doi": ""
    },
    {
      "text": "Christopher Clarke, Doga Cavdir, Patrick Chiu, Laurent Denoue, and Don Kimber. 2020. Reactive Video: Adaptive Video Playback Based on User Motion for Supporting Physical Activity. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 196–208.",
      "doi": "10.1145/3379337.3415591"
    },
    {
      "text": "Maximilian Dürr, Rebecca Weber, Ulrike Pfeil, and Harald Reiterer. 2020. EGuide: Investigating different visual appearances and guidance techniques for egocentric guidance visualizations. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. 311–322.",
      "doi": "10.1145/3374920.3374945"
    },
    {
      "text": "Alicia Garcia-Falgueras. 2016. An introduction to proprioception concept in Pilates and yoga. British Journal of Medicine and Medical Research 15, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Graham R Gibbs. 2007. Thematic coding and categorizing. Analyzing qualitative data 703 (2007), 38–56.",
      "doi": ""
    },
    {
      "text": "Ivan Grishchenko, Valentin Bazarevsky, Andrei Zanfir, Eduard Gabriel Bazavan, Mihai Zanfir, Richard Yee, Karthik Raveendran, Matsvei Zhdanovich, Matthias Grundmann, and Cristian Sminchisescu. 2022. BlazePose GHUM Holistic: Real-time 3D Human Landmarks and Pose Estimation. arXiv preprint arXiv:2206.11678(2022).",
      "doi": ""
    },
    {
      "text": "Jiajing Guo and Susan R Fussell. 2022. \" It’s Great to Exercise Together on Zoom!\": Understanding the Practices and Challenges of Live Stream Group Fitness Classes. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–28.",
      "doi": "10.1145/3512918"
    },
    {
      "text": "Koaburo Hachimura, Hiromu Kato, and Hideyuki Tamura. 2004. A prototype dance training support system with motion capture and mixed reality technologies. In RO-MAN 2004. 13th IEEE International Workshop on Robot and Human Interactive Communication (IEEE Catalog No. 04TH8759). IEEE, 217–222.",
      "doi": ""
    },
    {
      "text": "Perttu Hämäläinen. 2004. Interactive video mirrors for sports training. In Proceedings of the third Nordic conference on Human-computer interaction. 199–202.",
      "doi": "10.1145/1028014.1028044"
    },
    {
      "text": "Natsuki Hamanishi and Jun Rekimoto. 2020. PoseAsQuery: Full-Body Interface for Repeated Observation of a Person in a Video with Ambiguous Pose Indexes and Performed Poses. In Proceedings of the Augmented Humans International Conference. 1–11.",
      "doi": "10.1145/3384657.3384658"
    },
    {
      "text": "Ping-Hsuan Han, Yang-Sheng Chen, Yilun Zhong, Han-Lei Wang, and Yi-Ping Hung. 2017. My Tai-Chi coaches: an augmented-learning tool for practicing Tai-Chi Chuan. In Proceedings of the 8th Augmented Human International Conference. 1–4.",
      "doi": "10.1145/3041164.3041194"
    },
    {
      "text": "S. G. Hart. 1986. NASA Task Load Index (TLX). Volume 1.0; Paper and Pencil Package.",
      "doi": ""
    },
    {
      "text": "Renate Häuslschmid, Benjamin Fritzsche, and Andreas Butz. 2018. Can a helmet-mounted display make motorcycling safer?. In 23rd International Conference on Intelligent User Interfaces. 467–476.",
      "doi": "10.1145/3172944.3172963"
    },
    {
      "text": "Tianyu He, Xiaoming Chen, Zhibo Chen, Ye Li, Sen Liu, Junhui Hou, and Ying He. 2017. Immersive and collaborative Taichi motion learning in various VR environments. In 2017 IEEE Virtual Reality (VR). IEEE, 307–308.",
      "doi": ""
    },
    {
      "text": "Thuong N Hoang, Martin Reinoso, Frank Vetere, and Egemen Tanin. 2016. Onebody: remote posture guidance system using first person view in virtual environment. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. 1–10.",
      "doi": "10.1145/2971485.2971521"
    },
    {
      "text": "Felix Hülsmann, Cornelia Frank, Irene Senna, Marc O Ernst, Thomas Schack, and Mario Botsch. 2019. Superimposed skilled performance in a virtual mirror improves motor performance and cognitive representation of a full body motor action. Frontiers in Robotics and AI 6 (2019), 43.",
      "doi": ""
    },
    {
      "text": "Atsuki Ikeda, Dong-Hyun Hwang, and Hideki Koike. 2019. A real-time projection system for golf training using virtual shadow. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 1527–1528.",
      "doi": ""
    },
    {
      "text": "Catalin Ionescu, Dragos Papava, Vlad Olaru, and Cristian Sminchisescu. 2013. Human3. 6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE transactions on pattern analysis and machine intelligence 36, 7(2013), 1325–1339.",
      "doi": ""
    },
    {
      "text": "Takahiro Iwaanaguchi, Mikio Shinya, Satoshi Nakajima, and Michio Shiraishi. 2015. Cyber tai chi-cg-based video materials for tai chi chuan self-study. In 2015 International Conference on Cyberworlds (CW). IEEE, 365–368.",
      "doi": "10.1109/CW.2015.13"
    },
    {
      "text": "Bellur Krishnamukar Sundara Iyengar. 1979. Light on yoga: the definitive guide to yoga practice. Schocken Books.",
      "doi": ""
    },
    {
      "text": "Susan A Jackson and Mihaly Csikszentmihalyi. 1999. Flow in sports. Human Kinetics.",
      "doi": ""
    },
    {
      "text": "Josée L Jarry, Felicia M Chang, and Loreana La Civita. 2017. Ashtanga yoga for psychological well-being: initial effectiveness study. Mindfulness 8, 5 (2017), 1269–1279.",
      "doi": ""
    },
    {
      "text": "Jijia. 2021. Home YogaVR. virtual reality application. Retrieved September 15, 2022 from https://www.oculus.com/experiences/quest/4828252637184827/",
      "doi": ""
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203–220.",
      "doi": ""
    },
    {
      "text": "Minseong Kim. 2022. How can I Be as attractive as a Fitness YouTuber in the era of COVID-19? The impact of digital attributes on flow experience, satisfaction, and behavioral intention. Journal of Retailing and Consumer Services 64 (2022), 102778.",
      "doi": ""
    },
    {
      "text": "Felix Kosmalla, Florian Daiber, Frederik Wiehr, and Antonio Krüger. 2017. Climbvis: Investigating in-situ visualizations for understanding climbing movements by demonstration. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces. 270–279.",
      "doi": "10.1145/3132272.3134119"
    },
    {
      "text": "Jordan Koulouris, Zoe Jeffery, James Best, Eamonn O’neill, and Christof Lutteroth. 2020. Me vs. Super (wo) man: Effects of Customization and Identification in a VR Exergame. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3313831.3376661"
    },
    {
      "text": "Matthew Kyan, Guoyu Sun, Haiyan Li, Ling Zhong, Paisarn Muneesawang, Nan Dong, Bruce Elder, and Ling Guan. 2015. An approach to ballet dance training through ms kinect and visualization in a cave virtual reality environment. ACM Transactions on Intelligent Systems and Technology (TIST) 6, 2(2015), 1–37.",
      "doi": "10.1145/2735951"
    },
    {
      "text": "Ray Long. 2009. The key muscles of yoga. Bandha Yoga Publications LLC.",
      "doi": ""
    },
    {
      "text": "Immerse Labs Ltd. 2022. Yogistream. virtual reality application. Retrieved September 15, 2022 from https://www.oculus.com/experiences/quest/4832913850073489/",
      "doi": ""
    },
    {
      "text": "Zhiqiang Luo, Weiting Yang, Zhong Qiang Ding, Lili Liu, I-Ming Chen, Song Huat Yeo, Keck Voon Ling, and Henry Been-Lirn Duh. 2011. “Left Arm Up!” Interactive Yoga Training in Virtual Environment. In 2011 IEEE virtual reality conference. IEEE, 261–262.",
      "doi": ""
    },
    {
      "text": "SK Maithel, L Villegas, N Stylopoulos, S Dawson, and DB Jones. 2005. Simulated laparoscopy using a head-mounted display vs traditional video monitor: an assessment of performance and muscle fatigue. Surgical Endoscopy And Other Interventional Techniques 19, 3(2005), 406–411.",
      "doi": ""
    },
    {
      "text": "Zoe Marquardt, João Beira, Natalia Em, Isabel Paiva, and Sebastian Kox. 2012. Super Mirror: a kinect interface for ballet dancers. In CHI’12 Extended Abstracts on Human Factors in Computing Systems. 1619–1624.",
      "doi": ""
    },
    {
      "text": "Alberto Menache. 2000. Understanding motion capture for computer animation and video games. Morgan kaufmann.",
      "doi": ""
    },
    {
      "text": "Paul Milgram, Haruo Takemura, Akira Utsumi, and Fumio Kishino. 1995. Augmented reality: A class of displays on the reality-virtuality continuum. In Telemanipulator and telepresence technologies, Vol. 2351. Spie, 282–292.",
      "doi": ""
    },
    {
      "text": "Sarah Mroz, Natalie Baddour, Connor McGuirk, Pascale Juneau, Albert Tu, Kevin Cheung, and Edward Lemaire. 2021. Comparing the Quality of Human Pose Estimation with BlazePose or OpenPose. In 2021 4th International Conference on Bio-Engineering for Smart Technologies (BioSMART). IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "Akio Nakamura, Sou Tabata, Tomoya Ueda, Shinichiro Kiyofuji, and Yoshinori Kuno. 2005. Dance training system with active vibro-devices and a mobile image display. In 2005 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 3075–3080.",
      "doi": ""
    },
    {
      "text": "Francesca M Nicosia, Nadra E Lisha, Margaret A Chesney, Leslee L Subak, Traci M Plaut, and Alison Huang. 2020. Strategies for evaluating self-efficacy and observed success in the practice of yoga postures for therapeutic indications: methods from a yoga intervention for urinary incontinence among middle-aged and older women. BMC complementary medicine and therapies 20, 1 (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Kate Parker, Riaz Uddin, Nicola D Ridgers, Helen Brown, Jenny Veitch, Jo Salmon, Anna Timperio, Shannon Sahlqvist, Samuel Cassar, Kim Toffoletti, 2021. The use of digital platforms for adults’ and adolescents’ physical activity during the COVID-19 pandemic (our life at home): Survey study. Journal of medical Internet research 23, 2 (2021), e23389.",
      "doi": ""
    },
    {
      "text": "Ashwin Ram and Shengdong Zhao. 2021. LSVP: Towards Effective On-the-go Video Learning Using Optical Head-Mounted Displays. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 1 (2021), 1–27.",
      "doi": "10.1145/3448118"
    },
    {
      "text": "David Riley. 2004. Hatha yoga and the treatment of illness. Alternative therapies in health and medicine 10, 2 (2004), 20–25.",
      "doi": ""
    },
    {
      "text": "Jannick P Rolland, Richard L Holloway, and Henry Fuchs. 1995. Comparison of optical and video see-through, head-mounted displays. In Telemanipulator and Telepresence Technologies, Vol. 2351. SPIE, 293–307.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan. 1982. Control and information in the intrapersonal sphere: An extension of cognitive evaluation theory.Journal of personality and social psychology 43, 3(1982), 450.",
      "doi": ""
    },
    {
      "text": "Paul Salmon, Elizabeth Lush, Megan Jablonski, and Sandra E Sephton. 2009. Yoga and mindfulness: Clinical aspects of an ancient mind/body practice. Cognitive and behavioral practice 16, 1 (2009), 59–72.",
      "doi": ""
    },
    {
      "text": "Krishanu Sarker, Mohamed Masoud, Saeid Belkasim, and Shihao Ji. 2018. Towards robust human activity recognition from rgb video stream with limited labeled data. In 2018 17th IEEE International Conference on Machine Learning and Applications (ICMLA). IEEE, 145–151.",
      "doi": ""
    },
    {
      "text": "Christian Schönauer, Kenichiro Fukushi, Alex Olwal, Hannes Kaufmann, and Ramesh Raskar. 2012. Multimodal motion guidance: techniques for adaptive and dynamic feedback. In Proceedings of the 14th ACM international conference on Multimodal interaction. 133–140.",
      "doi": "10.1145/2388676.2388706"
    },
    {
      "text": "Ari Shapiro, Andrew Feng, Ruizhe Wang, Hao Li, Mark Bolas, Gerard Medioni, and Evan Suma. 2014. Rapid avatar capture and simulation using commodity depth sensors. Computer Animation and Virtual Worlds 25, 3-4 (2014), 201–211.",
      "doi": "10.1002/cav.1579"
    },
    {
      "text": "Joon Gi Shin, Doheon Kim, Chaehan So, and Daniel Saakes. 2020. Body Follows Eye: Unobtrusive Posture Manipulation Through a Dynamic Content Position in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376794"
    },
    {
      "text": "Mohammad Shokoohi-Yekta, Bing Hu, Hongxia Jin, Jun Wang, and Eamonn Keogh. 2017. Generalizing DTW to the multi-dimensional case requires an adaptive approach. Data mining and knowledge discovery 31, 1 (2017), 1–31.",
      "doi": ""
    },
    {
      "text": "C Alexander Simpkins and Annellen M Simpkins. 2012. Yoga Basics: The Basic Poses and Routines you Need to be Healthy and Relaxed. Tuttle Publishing.",
      "doi": ""
    },
    {
      "text": "Rajinder Sodhi, Hrvoje Benko, and Andrew Wilson. 2012. LightGuide: projected visualizations for hand movement guidance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 179–188.",
      "doi": "10.1145/2207676.2207702"
    },
    {
      "text": "Karina Sokolova and Charles Perez. 2021. You follow fitness influencers on YouTube. But do you actually exercise? How parasocial relationships, and watching fitness influencers, relate to intentions to exercise. Journal of Retailing and Consumer Services 58 (2021), 102276.",
      "doi": ""
    },
    {
      "text": "Mark Stephens. 2012. Yoga sequencing: Designing transformative yoga classes. North Atlantic Books.",
      "doi": ""
    },
    {
      "text": "Soaring Roc Studio. 2021. Rhythm Yoga. virtual reality application. Retrieved September 15, 2022 from https://www.viveport.com/apps/70755b3a-4397-46a8-a33b-5abb9f832f32/",
      "doi": ""
    },
    {
      "text": "Adam Switonski, Henryk Josinski, and Konrad Wojciechowski. 2019. Dynamic time warping in classification and selection of motion capture data. Multidimensional Systems and Signal Processing 30, 3(2019), 1437–1468.",
      "doi": "10.1007/s11045-018-0611-3"
    },
    {
      "text": "Martijn Ten Bhömer and Hanxiao Du. 2018. Designing Personalized Movement-based Representations to Support Yoga. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems. 283–287.",
      "doi": "10.1145/3197391.3205450"
    },
    {
      "text": "Laia Turmo Vidal, Elena Márquez Segura, Christopher Boyer, and Annika Waern. 2019. Enlightened Yoga: Designing an Augmented Class with Wearable Lights to Support Instruction. In Proceedings of the 2019 on Designing Interactive Systems Conference. 1017–1031.",
      "doi": "10.1145/3322276.3322338"
    },
    {
      "text": "Manisha Verma, Sudhakar Kumawat, Yuta Nakashima, and Shanmuganathan Raman. 2020. Yoga-82: a new dataset for fine-grained classification of human poses. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition workshops. 1038–1039.",
      "doi": ""
    },
    {
      "text": "VirtuaLiron. 2019. VirtuaLiron. virtual reality application. Retrieved September 15, 2022 from https://www.viveport.com/cdb9dec4-1d00-40f0-958f-8e2075b2b27f",
      "doi": ""
    },
    {
      "text": "Elizabeth Whissell, Lin Wang, Pan Li, Jing Xian Li, and Zhen Wei. 2021. Biomechanical Characteristics on the Lower Extremity of Three Typical Yoga Manoeuvres. Applied Bionics and Biomechanics 2021 (2021).",
      "doi": ""
    },
    {
      "text": "Jason Wise. 2022. How many people do yoga in 2022? (yoga statistics). Retrieved Sep 15, 2022 from https://earthweb.com/how-many-people-do-yoga/",
      "doi": ""
    },
    {
      "text": "Erwin Wu, Florian Perteneder, Hideki Koike, and Takayuki Nozawa. 2019. How to vizski: Visualizing captured skier motion in a vr ski training simulator. In The 17th International Conference on Virtual-Reality Continuum and its Applications in Industry. 1–9.",
      "doi": "10.1145/3359997.3365698"
    },
    {
      "text": "Chengshuo Xia, Xinrui Fang, Riku Arakawa, and Yuta Sugiura. 2022. VoLearn: A Cross-Modal Operable Motion-Learning System Combined with Virtual Avatar and Auditory Feedback. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 6, 2 (2022), 1–26.",
      "doi": "10.1145/3555210"
    },
    {
      "text": "Shuo Yan, Gangyi Ding, Zheng Guan, Ningxiao Sun, Hongsong Li, and Longfei Zhang. 2015. Outsideme: Augmenting dancer’s external self-image by using a mixed reality system. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. 965–970.",
      "doi": "10.1145/2702613.2732759"
    },
    {
      "text": "Ungyeon Yang and Gerard Jounghyun Kim. 2002. Implementation and Evaluation of “Just Follow Me”: An Immersive, VR-Based, Motion-Training System. Presence 11, 3 (2002), 304–323. https://doi.org/10.1162/105474602317473240",
      "doi": "10.1162/105474602317473240"
    },
    {
      "text": "Yinghua Yang. 2018. YogAR. augmented reality application. Retrieved September 15, 2022 from https://www.microsoft.com/en-us/p/yogar/9p47cc593fh9?activetab=pivot:overviewtab",
      "doi": ""
    },
    {
      "text": "Jang W Yoon, Robert E Chen, Esther J Kim, Oluwaseun O Akinduro, Panagiotis Kerezoudis, Phillip K Han, Phong Si, William D Freeman, Roberto J Diaz, Ricardo J Komotar, 2018. Augmented reality for the surgeon: systematic review. The International Journal of Medical Robotics and Computer Assisted Surgery 14, 4(2018), e1914.",
      "doi": ""
    },
    {
      "text": "YouTube. 2021. Community Spotlight: Yoga. Retrieved Sep 14, 2022 from https://www.youtube.com/trends/articles/stay-home-workout-at-home/",
      "doi": ""
    },
    {
      "text": "Xingyao Yu, Katrin Angerbauer, Peter Mohr, Denis Kalkofen, and Michael Sedlmair. 2020. Perspective matters: Design implications for motion guidance in mixed reality. In 2020 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 577–587.",
      "doi": ""
    },
    {
      "text": "Amit Zoran, Roy Shilkrot, Suranga Nanyakkara, and Joseph Paradiso. 2014. The hybrid artisans: A case study in smart tools. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 3(2014), 1–29.",
      "doi": "10.1145/2617570"
    }
  ]
}