{
  "doi": "10.1145/3544548.3581027",
  "title": "HandAvatar: Embodying Non-Humanoid Virtual Avatars through Hands",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "We propose HandAvatar to enable users to embody non-humanoid avatars using their hands. HandAvatar leverages the high dexterity and coordination of users’ hands to control virtual avatars, enabled through our novel approach for automatically-generated joint-to-joint mappings. We contribute an observation study to understand users’ preferences on hand-to-avatar mappings on eight avatars. Leveraging insights from the study, we present an automated approach that generates mappings between users’ hands and arbitrary virtual avatars by jointly optimizing control precision, structural similarity, and comfort. We evaluated HandAvatar on static posing, dynamic animation, and creative exploration tasks. Results indicate that HandAvatar enables more precise control, requires less physical effort, and brings comparable embodiment compared to a state-of-the-art body-to-avatar control method. We demonstrate HandAvatar’s potential with applications including non-humanoid avatar based social interaction in VR, 3D animation composition, and VR scene design with physical proxies. We believe that HandAvatar unlocks new interaction opportunities, especially for usage in Virtual Reality, by letting users become the avatar in applications including virtual social interaction, animation, gaming, or education.",
  "tags": [
    "Mixed Reality",
    "virtual avatar",
    "embodiment",
    "gestural interaction"
  ],
  "authors": [
    {
      "name": "Yu Jiang",
      "institution": "Computer Science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660566736",
      "orcid": "0000-0001-7111-2374"
    },
    {
      "name": "Zhipeng Li",
      "institution": "Department of Computer Science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474122",
      "orcid": "0000-0001-6602-0176"
    },
    {
      "name": "Mufei He",
      "institution": "Department of Architecture, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779214",
      "orcid": "0000-0003-4045-0295"
    },
    {
      "name": "David Lindlbauer",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81558156356/rel-imgonly/userpic-3by4.jpg",
      "acmid": "81558156356",
      "orcid": "0000-0002-0809-9696"
    },
    {
      "name": "Yukang Yan",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161020",
      "orcid": "0000-0001-7515-3755"
    }
  ],
  "references": [
    {
      "text": "Karan Ahuja, Eyal Ofek, Mar Gonzalez-Franco, Christian Holz, and Andrew D. Wilson. 2021. CoolMoves: User Motion Accentuation in Virtual Reality. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 2, Article 52 (jun 2021), 23 pages. https://doi.org/10.1145/3463499",
      "doi": "10.1145/3463499"
    },
    {
      "text": "Andreas Aristidou, Joan Lasenby, Yiorgos Chrysanthou, and Ariel Shamir. 2018. Inverse Kinematics Techniques in Computer Graphics: A Survey. Computer Graphics Forum 37 (2018).",
      "doi": ""
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands ‘feel’touch that eyes see. Nature 391, 6669 (1998), 756–756.",
      "doi": ""
    },
    {
      "text": "Ian M Bullock, Raymond R Ma, and Aaron M Dollar. 2012. A hand-centric classification of human and robot dexterous manipulation. IEEE transactions on Haptics 6, 2 (2012), 129–144.",
      "doi": ""
    },
    {
      "text": "Jiawen Chen, Shahram Izadi, and Andrew Fitzgibbon. 2012. KinEtre: Animating the World with the Human Body. UIST’12 - Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology, 435–444. https://doi.org/10.1145/2380116.2380171",
      "doi": "10.1145/2380116.2380171"
    },
    {
      "text": "Farnaz Farahanipad, Harish Ram Nambiappan, Ashish Jaiswal, Maria Kyrarini, and Fillia Makedon. 2020. HAND-REHA: Dynamic Hand Gesture Recognition for Game-Based Wrist Rehabilitation. In Proceedings of the 13th ACM International Conference on PErvasive Technologies Related to Assistive Environments (Corfu, Greece) (PETRA ’20). Association for Computing Machinery, New York, NY, USA, Article 17, 9 pages.",
      "doi": "10.1145/3389189.3392608"
    },
    {
      "text": "Andreas Fender, Jörg Müller, and David Lindlbauer. 2015. Creature teacher: A performance-based animation system for creating cyclic movements. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction. 113–122.",
      "doi": "10.1145/2788940.2788944"
    },
    {
      "text": "Mary C. Hume, Harris Gellman, Harry McKellop, and Robert H. Brumfield. 1990. Functional range of motion of the joints of the hand. The Journal of Hand Surgery 15, 2 (1990), 240–243. https://doi.org/10.1016/0363-5023(90)90102-W",
      "doi": ""
    },
    {
      "text": "Edwin Hutchins, James Hollan, and Donald Norman. 1985. Direct Manipulation Interfaces. Human-computer Interaction 1 (12 1985), 311–338. https://doi.org/10.1207/s15327051hci0104_2",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Takeo Igarashi, Tomer Moscovich, and John F Hughes. 2005. As-rigid-as-possible shape manipulation. ACM transactions on Graphics (TOG) 24, 3 (2005), 1134–1141.",
      "doi": ""
    },
    {
      "text": "Umar Iqbal, Pavlo Molchanov, Thomas Breuel, Juergen Gall, and Jan Kautz. 2018. Hand Pose Estimation via Latent 2.5D Heatmap Regression. In Computer Vision – ECCV 2018, Vittorio Ferrari, Martial Hebert, Cristian Sminchisescu, and Yair Weiss (Eds.). Springer International Publishing, Cham, 125–143.",
      "doi": "10.1007/978-3-030-01252-6_8"
    },
    {
      "text": "Rubaiat Habib Kazi, Kien Chuan Chua, Shengdong Zhao, Richard Davis, and Kok-Lim Low. 2011. SandCanvas: A multi-touch art medium inspired by sand animation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1283–1292.",
      "doi": "10.1145/1978942.1979133"
    },
    {
      "text": "Konstantina Kilteni, Raphaela Groten, and Mel Slater. 2012. The sense of embodiment in virtual reality. Presence: Teleoperators and Virtual Environments 21, 4(2012), 373–387.",
      "doi": "10.1162/PRES_a_00124"
    },
    {
      "text": "Andrey Krekhov, Sebastian Cmentowski, and Jens Krüger. 2019. The illusion of animal body ownership and its potential for virtual reality games. In 2019 IEEE Conference on Games (CoG). IEEE, 1–8.",
      "doi": "10.1109/CIG.2019.8848005"
    },
    {
      "text": "Kyung-Sun Lee and Myung-Chul Jung. 2015. Ergonomic evaluation of biomechanical hand function. Safety and health at work 6, 1 (2015), 9–17.",
      "doi": ""
    },
    {
      "text": "Luís Leite and Veronica Orvalho. 2012. Shape your body: control a virtual silhouette using body motion. In CHI’12 Extended Abstracts on Human Factors in Computing Systems. 1913–1918.",
      "doi": ""
    },
    {
      "text": "Luis LEite and Veronica Orvalho. 2017. Mani-pull-action: Hand-based digital puppetry. Proceedings of the ACM on Human-Computer Interaction 1, EICS(2017), 1–16.",
      "doi": ""
    },
    {
      "text": "Zhipeng Li, Yu Jiang, Yihao Zhu, Ruijia Chen, Ruolin Wang, Yuntao Wang, Yukang Yan, and Yuanchun Shi. 2022. Modeling the Noticeability of User-Avatar Movement Inconsistency for Sense of Body Ownership Intervention. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 2, Article 64 (jul 2022), 26 pages. https://doi.org/10.1145/3534590",
      "doi": "10.1145/3534590"
    },
    {
      "text": "Hui Liang, Jian Chang, Shujie Deng, Can Chen, Ruofeng Tong, and Jianjun Zhang. 2015. Exploitation of novel multiplayer gesture-based interaction and virtual puppetry for digital storytelling to develop children’s narrative skills. In Proceedings of the 14th ACM SIGGRAPH International Conference on Virtual Reality Continuum and its Applications in Industry. 63–72.",
      "doi": "10.1145/2817675.2817680"
    },
    {
      "text": "Noah Lockwood and Karan Singh. 2012. Fingerwalking: motion editing with contact-based hand performance. In Proceedings of the 11th ACM SIGGRAPH/Eurographics conference on Computer Animation. 43–52.",
      "doi": ""
    },
    {
      "text": "Jean-Luc Lugrin, Johanna Latt, and Marc Erich Latoschik. 2015. Avatar anthropomorphism and illusion of body ownership in VR. In 2015 IEEE Virtual Reality (VR). 229–230. https://doi.org/10.1109/VR.2015.7223379",
      "doi": ""
    },
    {
      "text": "Zhiqiang Luo, Chih-Chung Lin, I Chen, Song Huat Yeo, Tsai-Yen Li, 2011. Puppet playing: An interactive character animation system with hand motion control. In Transactions on computational science XII. Springer, 19–35.",
      "doi": ""
    },
    {
      "text": "Matteo Martini. 2016. Real, rubber or virtual: The vision of “one’s own” body as a means for pain modulation. A narrative review. Consciousness and cognition 43 (2016), 143–151.",
      "doi": ""
    },
    {
      "text": "Marta Matamala-Gomez, Tony Donegan, Sara Bottiroli, Giorgio Sandrini, Maria V Sanchez-Vives, and Cristina Tassorelli. 2019. Immersive virtual reality and virtual embodiment for pain relief. Frontiers in human neuroscience 13 (2019), 279.",
      "doi": ""
    },
    {
      "text": "Jonas Mayer and Nicholas Katzakis. 2016. A Metric for Short-Term Hand Comfort and Discomfort: Exploring Hand Posture Evaluation(SUI ’16). Association for Computing Machinery, New York, NY, USA, 131–134. https://doi.org/10.1145/2983310.2985752",
      "doi": "10.1145/2983310.2985752"
    },
    {
      "text": "L Mcatamney and E Nigel Corlett. 1993. RULA: a survey method for the investigation of work-related upper limb disorders.Applied ergonomics 24 2(1993), 91–9.",
      "doi": ""
    },
    {
      "text": "Ali Momeni and Zachary Rispoli. 2016. Dranimate: Paper Becomes Tablet, Drawing Becomes Animation. 3735–3737. https://doi.org/10.1145/2851581.2890267",
      "doi": "10.1145/2851581.2890267"
    },
    {
      "text": "Ali Momeni and Zachary Rispoli. 2016. Dranimate: paper becomes tablet, drawing becomes animation. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3735–3737.",
      "doi": "10.1145/2851581.2890267"
    },
    {
      "text": "Jean-Marie Normand, Elias Giannopoulos, Bernhard Spanlang, and Mel Slater. 2011. Multisensory stimulation can induce an illusion of larger belly size in immersive virtual reality. PloS one 6, 1 (2011), e16128.",
      "doi": ""
    },
    {
      "text": "Sageev Oore, Demetri Terzopoulos, and Geoffrey Hinton. 2002. A desktop input device and interface for interactive 3d character animation. In Graphics Interface, Vol. 2. 133–140.",
      "doi": ""
    },
    {
      "text": "Masaki Oshita, Yuta Senju, and Syun Morishige. 2013. Character motion control interface with hand manipulation inspired by puppet mechanism. In Proceedings of the 12th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and Its Applications in Industry. 131–138.",
      "doi": "10.1145/2534329.2534360"
    },
    {
      "text": "Sofia Adelaide Osimo, Rodrigo Pizarro, Bernhard Spanlang, and Mel Slater. 2015. Conversations between self and self as Sigmund Freud—A virtual body ownership paradigm for self counselling. Scientific reports 5, 1 (2015), 1–14.",
      "doi": ""
    },
    {
      "text": "Siyou Pei, Alexander Chen, Jaewook Lee, and Yang Zhang. 2022. Hand Interfaces: Using Hands to Imitate Objects in AR/VR for Expressive Interactions. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 429, 16 pages. https://doi.org/10.1145/3491102.3501898",
      "doi": "10.1145/3491102.3501898"
    },
    {
      "text": "Valeria I Petkova, Mehrnoush Khoshnevis, and H Henrik Ehrsson. 2011. The perspective matters! Multisensory integration in ego-centric reference frames determines full-body ownership. Frontiers in psychology 2 (2011), 35.",
      "doi": ""
    },
    {
      "text": "Fernando Quivira, Toshiaki Koike-Akino, Ye Wang, and Deniz Erdogmus. 2018. Translating sEMG signals to continuous hand poses using recurrent neural networks. In 2018 IEEE EMBS International Conference on Biomedical & Health Informatics (BHI). 166–169. https://doi.org/10.1109/BHI.2018.8333395",
      "doi": ""
    },
    {
      "text": "Yeongho Seol, Carol O’Sullivan, and Jehee Lee. 2013. Creature features: online motion puppetry for non-human characters. In Proceedings of the 12th ACM SIGGRAPH/Eurographics Symposium on Computer Animation. 213–221.",
      "doi": "10.1145/2485895.2485903"
    },
    {
      "text": "Ben Shneiderman. 1984. The Future of Interactive Systems and the Emergence of Direct Manipulation. In Proc. of the NYU Symposium on User Interfaces on Human Factors and Interactive Computer Systems (New York, USA). Ablex Publishing Corp., USA, 1–28.",
      "doi": "10.5555/2092.2093"
    },
    {
      "text": "Mel Slater and Maria V Sanchez-Vives. 2016. Enhancing our lives with immersive virtual reality. Frontiers in Robotics and AI 3 (2016), 74.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Bernhard Spanlang, and David Corominas. 2010. Simulating Virtual Environments within Virtual Environments as the Basis for a Psychophysics of Presence. ACM Trans. Graph. 29, 4, Article 92 (jul 2010), 9 pages. https://doi.org/10.1145/1778765.1778829",
      "doi": "10.1145/1778765.1778829"
    },
    {
      "text": "William Steptoe, Anthony Steed, and Mel Slater. 2013. Human Tails: Ownership and Control of Extended Humanoid Avatars. IEEE Transactions on Visualization and Computer Graphics 19, 4(2013), 583–590. https://doi.org/10.1109/TVCG.2013.32",
      "doi": ""
    },
    {
      "text": "William Steptoe, Anthony Steed, and Mel Slater. 2013. Human tails: ownership and control of extended humanoid avatars. IEEE transactions on visualization and computer graphics 19, 4(2013), 583–590.",
      "doi": ""
    },
    {
      "text": "David Joel Sturman. 1992. Whole-hand input. Ph. D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "David J Sturman. 1998. Computer puppetry. IEEE Computer Graphics and Applications 18, 1 (1998), 38–45.",
      "doi": "10.1109/38.637269"
    },
    {
      "text": "Manos Tsakiris. 2010. My body in the brain: a neurocognitive model of body-ownership. Neuropsychologia 48, 3 (2010), 703–712.",
      "doi": ""
    },
    {
      "text": "Daniel Vogel, Paul Lubos, and Frank Steinicke. 2018. Animationvr-interactive controller-based animating in virtual reality. In 2018 IEEE 1st Workshop on Animation in Virtual and Augmented Environments (ANIVAE). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Der-Lor Way, Weng-Kei Lau, and Tzu Ying Huang. 2019. Glove puppetry cloud theater through a virtual reality network. In ACM SIGGRAPH 2019 Posters. 1–2.",
      "doi": "10.1145/3306214.3338564"
    },
    {
      "text": "Johann Wentzel, Greg d’Eon, and Daniel Vogel. 2020. Improving Virtual Reality Ergonomics Through Reach-Bounded Non-Linear Input Amplification. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376687",
      "doi": "10.1145/3313831.3376687"
    },
    {
      "text": "Katsu Yamane, Yuka Ariki, and Jessica Hodgins. 2010. Animating non-humanoid characters with human motion data. In Proceedings of the 2010 ACM SIGGRAPH/Eurographics Symposium on Computer Animation. 169–178.",
      "doi": "10.5555/1921427.1921453"
    },
    {
      "text": "Yukang Yan, Chun Yu, Xiaojuan Ma, Xin Yi, Ke Sun, and Yuanchun Shi. 2018. VirtualGrasp: Leveraging Experience of Interacting with Physical Objects to Facilitate Digital Object Retrieval. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173652",
      "doi": "10.1145/3173574.3173652"
    },
    {
      "text": "Ye Yuan and Anthony Steed. 2010. Is the rubber hand illusion induced by immersive virtual reality?. In 2010 IEEE Virtual Reality Conference (VR). 95–102. https://doi.org/10.1109/VR.2010.5444807",
      "doi": "10.1109/VR.2010.5444807"
    }
  ]
}