{
  "doi": "10.1145/3544548.3581454",
  "title": "Reality Rifts: Wonder-ful Interfaces by Disrupting Perceptual Causality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Reality Rifts are interfaces between the physical and the virtual reality, where incoherent observations of physical behavior lead users to imagine comprehensive and plausible end-to-end dynamics. Reality Rifts emerge in interactive physical systems that lack one or more components that are central to their operation, yet where the physical end-to-end interaction persists with plausible outcomes. Even in the presence of a Reality Rift, users can still interact with a system—much like they would with the unaltered and complete counterpart—leading them to implicitly infer the existence and imagine the behavior of the lacking components from observable phenomena and outcomes. Therefore, dynamic systems with Reality Rifts trigger doubt, curiosity, and rumination—a sense of wonder that users experience when observing a Reality Rift due to their innate curiosity.  In this paper, we explore how interactive systems can elicit and guide the user’s imagination by integrating Reality Rifts. We outline the design process for opening a Reality Rift in interactive physical systems, describe the resulting design space, and explore it through six characteristic prototypes. To understand to what extent and with which qualities these prototypes indeed induce a sense of wonder during an interaction, we evaluated Reality Rifts in the form of a field deployment with 50 participants. We discuss participants’ behavior and derive factors for the implementation of future wonder-ful experiences.",
  "tags": [
    "immersive experiences",
    "physical displays",
    "Mixed reality"
  ],
  "authors": [
    {
      "name": "Lung-Pan Cheng",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-81470651683/rel-imgonly/32956970-44d4-41fa-95c3-df5faf94a414_1_201_a.jpeg",
      "acmid": "81470651683",
      "orcid": "0000-0002-7712-8622"
    },
    {
      "name": "Yi Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659892690",
      "orcid": "0000-0002-8640-967X"
    },
    {
      "name": "Yi-Hao Peng",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-99659261824/rel-imgonly/me_hci_2.png",
      "acmid": "99659261824",
      "orcid": "0000-0002-6335-5904"
    },
    {
      "name": "Christian Holz",
      "institution": "Department of Computer Science, ETH Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    }
  ],
  "references": [
    {
      "text": "Peter Appelbaum and Stella Clark. 2001. Science! Fun? A critical analysis of design/content/evaluation. Journal of Curriculum Studies 33, 5 (2001), 583–600. https://doi.org/10.1080/00220270010023812",
      "doi": ""
    },
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction(Eindhoven, Netherlands) (TEI ’16). ACM, New York, NY, USA, 218–226. https://doi.org/10.1145/2839462.2839484",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Aristotle. 350BCE. Metaphysics. The Internet Classics Archive. http://classics.mit.edu/Aristotle/metaphysics.html",
      "doi": ""
    },
    {
      "text": "ART+COM. 2008. Kinetic Sculpture — The Shapes of Things to Come. Displayed in BMW Museum. https://artcom.de/en/?project=kinetic-sculpture Accessed: 2021-10-01.",
      "doi": ""
    },
    {
      "text": "Francis Bacon. 2013. The Advancement of Learning: Book I. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch, Henning Pohl, Stefanie Reinicke, Emilia Wittmers, Patrick Lühne, Marius Knaust, Sven Köhler, Patrick Schmidt, and Christian Holz. 2013. Imaginary Reality Gaming: Ball Games without a Ball. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 405–410. https://doi.org/10.1145/2501988.2502012",
      "doi": "10.1145/2501988.2502012"
    },
    {
      "text": "Rachel Carson. 2017. The sense of wonder : a celebration of nature for parents and children. Harper Perennial, New York, NY.",
      "doi": ""
    },
    {
      "text": "Dapeng Chen, Aiguo Song, Lei Tian, Liyue Fu, and Hong Zeng. 2019. FW-Touch: A Finger Wearable Haptic Interface with a MR Foam Actuator for Displaying Surface Material Properties on a Touch Screen. IEEE transactions on haptics(2019).",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Li Chang, Sebastian Marwecki, and Patrick Baudisch. 2018. iTurk: Turning Passive Haptics into Active Haptics by Making Users Reconfigure Props in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173663",
      "doi": "10.1145/3173574.3173663"
    },
    {
      "text": "Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic Turk: A Motion Platform Based on People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 3463–3472. https://doi.org/10.1145/2556288.2557101",
      "doi": "10.1145/2556288.2557101"
    },
    {
      "text": "Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Mutual Human Actuation. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). ACM, New York, NY, USA, 797–805. https://doi.org/10.1145/3126594.3126667",
      "doi": "10.1145/3126594.3126667"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D Wilson. 2017. Sparse haptic proxy: Touch feedback in virtual environments using a general passive prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3718–3728.",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, and Andrew D. Wilson. 2019. VRoamer: Generating On-The-Fly VR Experiences While Walking inside Large, Unknown Real-World Building Environments. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 359–366. https://doi.org/10.1109/VR.2019.8798074 ISSN: 2642-5254.",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, and Patrick Baudisch. 2015. TurkDeck: Physical Virtual Reality Based on People. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (Charlotte, NC, USA) (UIST ’15). ACM, New York, NY, USA, 417–426. https://doi.org/10.1145/2807442.2807463",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "Ahmad Reza Cheraghi, Sahdia Shahzad, and Kalman Graffi. 2022. Past, Present, and Future of Swarm Robotics. In Intelligent Systems and Applications, Kohei Arai (Ed.). Vol. 296. Springer International Publishing, Cham, 190–233. https://doi.org/10.1007/978-3-030-82199-9_13 Series Title: Lecture Notes in Networks and Systems.",
      "doi": ""
    },
    {
      "text": "Arthur C. Clarke. 1968. Clarke’s Third Law on UFO’s. Science 159, 3812 (Jan. 1968), 255–255. https://doi.org/10.1126/science.159.3812.255.c",
      "doi": ""
    },
    {
      "text": "The Walt Disney Company. 1955. Disneyland Park. https://disneyland.disney.go.com/.",
      "doi": ""
    },
    {
      "text": "Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W. Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational Design of Mechanical Characters. ACM Trans. Graph. 32, 4, Article 83 (July 2013), 12 pages. https://doi.org/10.1145/2461912.2461953",
      "doi": "10.1145/2461912.2461953"
    },
    {
      "text": "dECOi architects. 2011. HyperSurface. http://ww1.hyposurface.org",
      "doi": ""
    },
    {
      "text": "John V. Draper, David B. Kaber, and John M. Usher. 1998. Telepresence. Human Factors 40, 3 (1998), 354–375. https://doi.org/10.1518/001872098779591386 arXiv:https://doi.org/10.1518/001872098779591386PMID: 9849099.",
      "doi": ""
    },
    {
      "text": "Dreamscape. 2017. Dreamscape. https://dreamscapeimmersive.com/adventures/details/magicprojector01.",
      "doi": ""
    },
    {
      "text": "EscapeSF. 2019. Real time escape room. https://www.escapesf.net.",
      "doi": ""
    },
    {
      "text": "Rosemary Feasey. 2005. Creative Science: Achieving the WOW Factor with 5-11 Year Olds. David Fulton. https://books.google.com.tw/books?id=WXndQHiaC9EC",
      "doi": ""
    },
    {
      "text": "Andreas Rene Fender and Christian Holz. 2022. Causality-preserving Asynchronous Reality. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3491102.3501836",
      "doi": "10.1145/3491102.3501836"
    },
    {
      "text": "Dariel Fitzkee. 1945. Magic by Misdirection. Magic Limited. 227 pages. https://books.google.com.tw/books?id=Oo1xDwAAQBAJ",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In Uist, Vol. 13. 417–426.",
      "doi": ""
    },
    {
      "text": "William W. Gaver. 1991. Technology affordances. In Proceedings of the SIGCHI conference on Human factors in computing systems Reaching through technology - CHI ’91. ACM Press, New Orleans, Louisiana, United States, 79–84. https://doi.org/10.1145/108844.108856",
      "doi": "10.1145/108844.108856"
    },
    {
      "text": "S.C. Goldstein, J.D. Campbell, and T.C. Mowry. 2005. Programmable matter. Computer 38, 6 (May 2005), 99–101. https://doi.org/10.1109/MC.2005.198 Conference Name: Computer.",
      "doi": "10.1109/MC.2005.198"
    },
    {
      "text": "Howard E Gruber, Charles D Fink, and Vernon Damm. 1957. Effects of experience on perception of causality., 89–93 pages. https://doi.org/10.1037/h0048506",
      "doi": ""
    },
    {
      "text": "Sean Gustafson, Daniel Bierwirth, and Patrick Baudisch. 2010. Imaginary Interfaces: Spatial Interaction with Empty Hands and without Visual Feedback. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology(UIST ’10). Association for Computing Machinery, New York, NY, USA, 3–12. https://doi.org/10.1145/1866029.1866033",
      "doi": "10.1145/1866029.1866033"
    },
    {
      "text": "Jeremy Hartmann, Christian Holz, Eyal Ofek, and Andrew D. Wilson. 2019. RealityCheck: Blending Virtual Environments with Situated Physical Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 347, 12 pages. https://doi.org/10.1145/3290605.3300577",
      "doi": "10.1145/3290605.3300577"
    },
    {
      "text": "Zhenyi He, Fengyuan Zhu, and Ken Perlin. 2017. PhyShare: Sharing Physical Interaction in Virtual Reality. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). ACM, New York, NY, USA, 17–19. https://doi.org/10.1145/3131785.3131795",
      "doi": "10.1145/3131785.3131795"
    },
    {
      "text": "Peter Kivy. 1990. Music alone : philosophical reflections on the purely musical experience. Cornell University Press, Ithaca.",
      "doi": ""
    },
    {
      "text": "Leonard Koren. 2008. Wabi-sabi for artists, designers, poets & philosophers. Imperfect Publishing, Point Reyes, California.",
      "doi": ""
    },
    {
      "text": "Ellyssa Kroski. 2018. Escape Rooms and other immersive experiences in the library. American Library Association.",
      "doi": ""
    },
    {
      "text": "Gustav Kuhn, Jay A Olson, and Amir Raz. 2016. Editorial: The Psychology of Magic and the Magic of Psychology. Frontiers in Psychology 7 (2016), 1358. https://doi.org/10.3389/fpsyg.2016.01358",
      "doi": ""
    },
    {
      "text": "Shringi Kumari, Sebastian Deterding, and Gustav Kuhn. 2018. Why Game Designers Should Study Magic. In Proceedings of the 13th International Conference on the Foundations of Digital Games (Malmö, Sweden) (FDG ’18). Association for Computing Machinery, New York, NY, USA, Article 30, 8 pages. https://doi.org/10.1145/3235765.3235788",
      "doi": "10.1145/3235765.3235788"
    },
    {
      "text": "Marc Erich Latoschik and Carolin Wienrich. 2022. Congruence and Plausibility, Not Presence: Pivotal Conditions for XR Experiences and Effects, a Novel Approach. Frontiers in Virtual Reality 3 (jun 2022). https://doi.org/10.3389/frvir.2022.694433",
      "doi": ""
    },
    {
      "text": "Catherine L’Ecuyer. 2014. The Wonder Approach to learning. Frontiers in Human Neuroscience 8, OCT (2014), 1–8. https://doi.org/10.3389/fnhum.2014.00764",
      "doi": ""
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal, Samuel Luescher, Akimitsu Hogge, Jinha Lee, and Hiroshi Ishii. 2013. Sublimate: state-changing virtual and physical rendering to augment interaction with shape displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1441–1450.",
      "doi": "10.1145/2470654.2466191"
    },
    {
      "text": "A M Leslie. 1982. The perception of causality in infants.Perception 11, 2 (1982), 173–186. https://doi.org/10.1068/p110173",
      "doi": ""
    },
    {
      "text": "Jiabao Li, Honghao Deng, and Panagiotis Michalatos. 2017. CatEscape: An Asymmetrical Multiplatform Game Connecting Virtual, Augmented and Physical World. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 585–590. https://doi.org/10.1145/3130859.3130860",
      "doi": "10.1145/3130859.3130860"
    },
    {
      "text": "David Lindlbauer and Andy D. Wilson. 2018. Remixed Reality: Manipulating Space and Time in Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 129, 13 pages. https://doi.org/10.1145/3173574.3173703",
      "doi": "10.1145/3173574.3173703"
    },
    {
      "text": "A Michotte. 1963. The perception of causality.Basic Books, Oxford, England. xxii, 424–xxii, 424 pages.",
      "doi": ""
    },
    {
      "text": "Paul Milgram, Haruo Takemura, Akira Utsumi, and Fumio Kishino. 1995. Augmented Reality : A class of displays on the reality-virtuality continuum. Other Conferences (1995). https://doi.org/10.1117/12.197321",
      "doi": ""
    },
    {
      "text": "Ian Milne. 2010. A Sense of Wonder, aris Starting Point for Inquiry in Primary Science. Science Education International 21, 2 (2010), 102–115.",
      "doi": ""
    },
    {
      "text": "Vincent Mosco. 2005. The Digital Sublime: Myth, Power, and Cyberspace. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Christiane Moser, Verena Fuchsberger, and Manfred Tscheligi. 2012. Rapid Assessment of Game Experiences in Public Settings. In Proceedings of the 4th International Conference on Fun and Games (Toulouse, France) (FnG ’12). Association for Computing Machinery, New York, NY, USA, 73–82. https://doi.org/10.1145/2367616.2367625",
      "doi": "10.1145/2367616.2367625"
    },
    {
      "text": "oculus. 2019. oculus. https://www.oculus.com.",
      "doi": ""
    },
    {
      "text": "Masa Ogata. 2018. Magneto-Haptics: Embedding Magnetic Force Feedback for Physical Interactions. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(Berlin, Germany) (UIST ’18). ACM, New York, NY, USA, 737–743. https://doi.org/10.1145/3242587.3242615",
      "doi": "10.1145/3242587.3242615"
    },
    {
      "text": "Paul Martin Opdal. 2001. Curiosity, wonder and education seen as perspective development. Studies in Philosophy and Education 20, 4 (2001), 331–344. https://doi.org/10.1023/A:1011851211125",
      "doi": ""
    },
    {
      "text": "Rui Pan, Henry Lo, and Carman Neustaedter. 2017. Collaboration, Awareness, and Communication in Real-Life Escape Rooms. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). ACM, New York, NY, USA, 1353–1364. https://doi.org/10.1145/3064663.3064767",
      "doi": "10.1145/3064663.3064767"
    },
    {
      "text": "Howard L. Parsons. 1969. A Philosophy of Wonder. Philosophy and Phenomenological Research 30, 1 (1969), 84. https://doi.org/10.2307/2105923",
      "doi": ""
    },
    {
      "text": "Randy Pausch, Jon Snoddy, Robert Taylor, Scott Watson, and Eric Haseltine. 1996. Disney’s Aladdin: First Steps Toward Storytelling in Virtual Reality. In Proceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques(SIGGRAPH ’96). ACM, New York, NY, USA, 193–203. https://doi.org/10.1145/237170.237257",
      "doi": "10.1145/237170.237257"
    },
    {
      "text": "C. S. Pinhanez. 2000. Physically interactive story environments. IBM Systems Journal 39, 3-4 (2000), 438–454. https://doi.org/10.1147/sj.393.0438",
      "doi": "10.1147/sj.393.0438"
    },
    {
      "text": "Peter F Powesland. 1959. The effect of practice upon the perception of causality.Canadian Journal of Psychology/Revue canadienne de psychologie 13, 3(1959), 155–168. https://doi.org/10.1037/h0083773",
      "doi": ""
    },
    {
      "text": "Ronald A Rensink and Gustav Kuhn. 2015. A framework for using magic to study the mind. Frontiers in psychology 5 (feb 2015), 1508. https://doi.org/10.3389/fpsyg.2014.01508",
      "doi": ""
    },
    {
      "text": "Matthew Riley. 2016. Musical listening in the German Enlightenment : attention, wonder and astonishment. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Joan Sol Roo and Martin Hachet. 2017. One Reality: Augmenting How the Physical World is Experienced by Combining Multiple Mixed Reality Modalities. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). ACM, New York, NY, USA, 787–795. https://doi.org/10.1145/3126594.3126638",
      "doi": "10.1145/3126594.3126638"
    },
    {
      "text": "The Room. 2020. The Room Immersive Adventures. https://the-room-berlin.com/.",
      "doi": ""
    },
    {
      "text": "Maria V Sanchez-Vives and Mel Slater. 2005. From presence to consciousness through virtual reality. Nature Reviews Neuroscience 6, 4 (2005), 332–339.",
      "doi": ""
    },
    {
      "text": "Maria V. Sanchez-Vives and Mel Slater. 2005. From Presence to Consciousness Through Virtual Reality. Nature Reviews Neuroscience 6, 4 (2005), 332–339.",
      "doi": ""
    },
    {
      "text": "Makoto Sato. 2002. Development of string-based force display: SPIDAR. In 8th international conference on virtual systems and multimedia. Citeseer.",
      "doi": ""
    },
    {
      "text": "Eva Schaper. 1978. Fiction and the Suspension of Disbelief. British Journal of Aesthetics 18, 1 (1978), 31–44.",
      "doi": ""
    },
    {
      "text": "Anders Schinkel. 2018. Wonder and Moral Education. Educational Theory 68, 1 (2018), 31–48. https://doi.org/10.1111/edth.12287",
      "doi": ""
    },
    {
      "text": "Anders Schinkel. 2019. Wonder, Mystery, and Meaning. Philosophical Papers 48, 2 (2019), 293–319. https://doi.org/10.1080/05568641.2018.1462667",
      "doi": ""
    },
    {
      "text": "Anne Schlottmann. 1999. Seeingg it happen and knowing how it works: how children understand the relation between perceptual causality and underlying mechanism.Developmental Psychology(1999). https://doi.org/10.1037//0012-1649.35.1.303",
      "doi": ""
    },
    {
      "text": "Brian J Scholl and Patrice D Tremoulet. 2000. Perceptual causality and animacy. Trends in Cognitive Sciences 4, 8 (2000), 299 – 309. https://doi.org/10.1016/S1364-6613(00)01506-0",
      "doi": ""
    },
    {
      "text": "Alexander F Shand. 1914. The foundations of character: Being a study of the tendencies of the emotions and sentiments.MacMillan Co, New York, NY, US. xxxi, 562–xxxi, 562 pages. https://doi.org/10.1037/10666-000",
      "doi": ""
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. Transcalibur: A Weight Shifting Virtual Reality Controller for 2D Shape Rendering Based on Computational Perception Model. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 11, 11 pages. https://doi.org/10.1145/3290605.3300241",
      "doi": "10.1145/3290605.3300241"
    },
    {
      "text": "Alexa F Siu, Eric J Gonzalez, Shenli Yuan, Jason B Ginsberg, and Sean Follmer. 2018. Shapeshift: 2D spatial manipulation and self-actuation of tabletop shape displays for tangible and haptic interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 291.",
      "doi": "10.1145/3173574.3173865"
    },
    {
      "text": "Richard Skarbez, Frederick P. Brooks, and Mary C. Whitton. 2018. Immersion and coherence in a stressful virtual environment. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology(VRST ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3281505.3281530",
      "doi": "10.1145/3281505.3281530"
    },
    {
      "text": "Richard Skarbez, Solène Neyret, Frederick P. Brooks, Mel Slater, and Mary C. Whitton. 2017. A Psychophysical Experiment Regarding Components of the Plausibility Illusion. IEEE Transactions on Visualization and Computer Graphics 23, 4 (April 2017), 1369–1378. https://doi.org/10.1109/TVCG.2017.2657158 Conference Name: IEEE Transactions on Visualization and Computer Graphics.",
      "doi": "10.1109/TVCG.2017.2657158"
    },
    {
      "text": "Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (Dec. 2009), 3549–3557. https://doi.org/10.1098/rstb.2009.0138",
      "doi": ""
    },
    {
      "text": "Mel Slater and Sylvia Wilbur. 1997. A framework for immersive virtual environments (FIVE): Speculations on the role of presence in virtual environments. Presence: Teleoperators & Virtual Environments 6, 6(1997), 603–616.",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "Misha Sra, Dhruv Jain, Arthur Pitzer Caetano, Andres Calvo, Erwin Hilton, and Chris Schmandt. 2016. Resolving spatial variation and allowing spectator participation in multiplayer VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 221–222.",
      "doi": "10.1145/2984751.2984779"
    },
    {
      "text": "Christopher Stapleton, Charles Hughes, M. Moshell, M. Moshell, Paulius Micikevicius, P. Micikevicius, and M. Altman. 2002. Applying mixed reality to entertainment. IEEE Computer (2002). https://doi.org/10.1109/mc.2002.1106186",
      "doi": "10.1109/mc.2002.1106186"
    },
    {
      "text": "Benjamin Straube and Anjan Chatterjee. 2010. Space and Time in Perceptual Causality. Frontiers in Human Neuroscience 4 (April 2010), 28. https://doi.org/10.3389/fnhum.2010.00028",
      "doi": ""
    },
    {
      "text": "E. V. Subbotskiĭ. 2010. Magic and the mind : mechanisms, functions, and development of magical thinking and behavior. Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Ivan E. Sutherland. 1968. A Head-mounted Three Dimensional Display. In Proceedings of the December 9-11, 1968, Fall Joint Computer Conference, Part I (San Francisco, California) (AFIPS ’68 (Fall, part I)). ACM, New York, NY, USA, 757–764. https://doi.org/10.1145/1476589.1476686",
      "doi": "10.1145/1476589.1476686"
    },
    {
      "text": "Shan-Yuan Teng, Tzu-Sheng Kuo, Chi Wang, Chi-huan Chiang, Da-Yuan Huang, Liwei Chan, and Bing-Yu Chen. 2018. PuPoP: Pop-up Prop on Palm for Virtual Reality. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 5–17.",
      "doi": "10.1145/3242587.3242628"
    },
    {
      "text": "Bruce Tognazzini. 1993. Principles, Techniques, and Ethics of Stage Magic and Their Application to Human Interface Design. In Proceedings of the INTERACT ’93 and CHI ’93 Conference on Human Factors in Computing Systems (Amsterdam, The Netherlands) (CHI ’93). Association for Computing Machinery, New York, NY, USA, 355–362. https://doi.org/10.1145/169059.169284",
      "doi": "10.1145/169059.169284"
    },
    {
      "text": "tyffonium. 2017. tyffonium. https://www.tyffonium.com.",
      "doi": ""
    },
    {
      "text": "Sophia Vasalou. 2015. Wonder : a grammar. State University of New York Press, Albany.",
      "doi": ""
    },
    {
      "text": "vive. 2019. vive. http://www.vive.com.",
      "doi": ""
    },
    {
      "text": "The void. 2016. A virtual reality experience. https://www.thevoid.com.",
      "doi": ""
    },
    {
      "text": "Edited by Michael Waldmann (Ed.). 2017. The Oxford Handbook of Causal Reasoning. Oxford University Press, Oxford, New York.",
      "doi": ""
    },
    {
      "text": "Harald Warmelink, Igor Mayer, Jessika Weber, Bram Heijligers, Mata Haggis, Erwin Peters, and Max Louwerse. 2017. AMELIO: Evaluating the Team-Building Potential of a Mixed Reality Escape Room Game. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 111–123. https://doi.org/10.1145/3130859.3131436",
      "doi": "10.1145/3130859.3131436"
    },
    {
      "text": "Gareth White. 2012. On Immersive Theatre. Theatre Research International 37, 3 (2012), 221–235. https://doi.org/10.1017/S0307883312000880",
      "doi": ""
    },
    {
      "text": "Pieter Wouters, Herre van Oostendorp, Rudy Boonekamp, and Erik van der Spek. 2011. The role of Game Discourse Analysis and curiosity in creating engaging and effective serious games by implementing a back story and foreshadowing. Interacting with Computers 23, 4 (2011), 329 – 336. https://doi.org/10.1016/j.intcom.2011.05.001 Cognitive Ergonomics for Situated Human-Automation Collaboration.",
      "doi": ""
    },
    {
      "text": "Xiaoxing Xia, Christopher M. Spadaccini, and Julia R. Greer. 2022. Responsive materials architected in space and time. Nature Reviews Materials 7, 9 (Sept. 2022), 683–701. https://doi.org/10.1038/s41578-022-00450-z Number: 9 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Yasuyuki Yanagida, Takuya Nakano, and Kyuma Watanabe. 2019. Towards precise spatio-temporal control of scents and air for olfactory augmented reality. In 2019 IEEE International Symposium on Olfaction and Electronic Nose (ISOEN). 1–4. https://doi.org/10.1109/ISOEN.2019.8823180",
      "doi": ""
    },
    {
      "text": "Jackie Yang, Christian Holz, Eyal Ofek, and Andrew D Wilson. 2019. Dreamwalker: Substituting real-world walking experiences with a virtual reality. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 1093–1107.",
      "doi": "10.1145/3332165.3347875"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and Technology. ACM, 13–22.",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Andre Zenner and Antonio Krüger. 2017. Shifty: A weight-shifting dynamic passive haptic proxy to enhance object perception in virtual reality. IEEE transactions on visualization and computer graphics 23, 4(2017), 1285–1294.",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "Zirui Zhai, Yong Wang, and Hanqing Jiang. 2018. Origami-inspired, on-demand deployable and collapsible mechanical metamaterials with tunable stiffness. Proceedings of the National Academy of Sciences 115, 9 (2018), 2032–2037.",
      "doi": ""
    }
  ]
}