{
  "doi": "10.1145/3544548.3581110",
  "title": "Vim: Customizable, Decomposable Electrical Energy Storage",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Providing electrical power is essential for nearly all interactive technologies, yet it often remains an afterthought. Some designs handwave power altogether as an “exercise for later.” Others hastily string together batteries to meet the system’s electrical requirements, enclosing them in whatever box fits. Vim is a new approach – it elevates power as a first-class design element; it frees power from being a series of discrete elements, instead catering to exact requirements; it enables power to take on new, flexible forms; it is fabricated using low-cost, accessible materials and technologies; finally, it advances sustainability by being rechargeable, non-toxic, edible, and compostable. Vims are decomposable battery alternatives that rapidly charge and can power small applications for hours. We present Vims, detail their characteristics, offer design guidelines for their fabrication, and explore their use in applications spanning prototyping, fashion, and food, including novel systems that are entirely decomposable and edible.",
  "authors": [
    {
      "name": "Katherine Wei Song",
      "institution": "UC Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702382",
      "orcid": "0000-0001-7580-0035"
    },
    {
      "name": "Eric Paulos",
      "institution": "UC Berkeley, United States",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "S. Abdalla and A. A. Al-Ghamdi. 2011. Electrical energy from foods. Journal of Renewable and Sustainable Energy 3, 6 (2011), 063106. https://doi.org/10.1063/1.3659289 arXiv:https://doi.org/10.1063/1.3659289",
      "doi": ""
    },
    {
      "text": "Xavier Aeby, Alexandre Poulin, Gilberto Siqueira, Michael K. Hausmann, and Gustav Nyström. 2021. Fully 3D Printed and Disposable Paper Supercapacitors. Advanced Materials 33, 26 (2021), 2101328. https://doi.org/10.1002/adma.202101328 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adma.202101328",
      "doi": ""
    },
    {
      "text": "United States Environmental Protection Agency. 2021. An Analysis of Lithium-ion Battery Fires in Waste Management and Recycling. https://www.epa.gov/system/files/documents/2021-08/lithium-ion-battery-report-update-7.01_508.pdf",
      "doi": ""
    },
    {
      "text": "Nivedita Arora and Gregory D. Abowd. 2018. ZEUSSS: Zero Energy Ubiquitous Sound Sensing Surface Leveraging Triboelectric Nanogenerator and Analog Backscatter Communication. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (Berlin, Germany) (UIST ’18 Adjunct). Association for Computing Machinery, New York, NY, USA, 81–83. https://doi.org/10.1145/3266037.3266108",
      "doi": "10.1145/3266037.3266108"
    },
    {
      "text": "Nivedita Arora, Ali Mirzazadeh, Injoo Moon, Charles Ramey, Yuhui Zhao, Daniela C. Rodriguez, Gregory D. Abowd, and Thad Starner. 2021. MARS: Nano-Power Battery-Free Wireless Interfaces for Touch, Swipe and Speech Input. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 1305–1325. https://doi.org/10.1145/3472749.3474823",
      "doi": "10.1145/3472749.3474823"
    },
    {
      "text": "Nivedita Arora, Steven L. Zhang, Fereshteh Shahmiri, Diego Osorio, Yi-Cheng Wang, Mohit Gupta, Zhengjun Wang, Thad Starner, Zhong Lin Wang, and Gregory D. Abowd. 2018. SATURN: A Thin and Flexible Self-Powered Microphone Leveraging Triboelectric Nanogenerator. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 2, Article 60 (jul 2018), 28 pages. https://doi.org/10.1145/3214263",
      "doi": "10.1145/3214263"
    },
    {
      "text": "Vicente Arroyos, Maria L K Viitaniemi, Nicholas Keehn, Vaidehi Oruganti, Winston Saunders, Karin Strauss, Vikram Iyer, and Bichlien H Nguyen. 2022. A Tale of Two Mice: Sustainable Electronics Design and Prototyping. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 263, 10 pages. https://doi.org/10.1145/3491101.3519823",
      "doi": "10.1145/3491101.3519823"
    },
    {
      "text": "Akash Badshah, Sidhant Gupta, Gabe Cohn, Nicolas Villar, Steve Hodges, and Shwetak N. Patel. 2011. Interactive Generator: A Self-Powered Haptic Feedback Device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2051–2054. https://doi.org/10.1145/1978942.1979240",
      "doi": "10.1145/1978942.1979240"
    },
    {
      "text": "Fiona Bell, Latifa Al Naimi, Ella McQuaid, and Mirela Alistar. 2022. Designing with Alganyl. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction (Daejeon, Republic of Korea) (TEI ’22). Association for Computing Machinery, New York, NY, USA, Article 2, 14 pages. https://doi.org/10.1145/3490149.3501308",
      "doi": "10.1145/3490149.3501308"
    },
    {
      "text": "Fiona Bell, Netta Ofer, and Mirela Alistar. 2022. ReClaym Our Compost: Biodegradable Clay for Intimate Making. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 454, 15 pages. https://doi.org/10.1145/3491102.3517711",
      "doi": "10.1145/3491102.3517711"
    },
    {
      "text": "C. Betancourt-Aguilar, R. de Mello-Prado, L. Castellanos-Gonzáles, and N. Silva-Campos. 2016. Glycerin as byproduct of biodiesel production, its characteristics, applications and soil use.Cultivos Tropicales 37, 3 (2016), 7–14.",
      "doi": ""
    },
    {
      "text": "Dinesh Bharadia, Kiran Raj Joshi, Manikanta Kotaru, and Sachin Katti. 2015. BackFi: High Throughput WiFi Backscatter. In Proceedings of the 2015 ACM Conference on Special Interest Group on Data Communication (London, United Kingdom) (SIGCOMM ’15). Association for Computing Machinery, New York, NY, USA, 283–296. https://doi.org/10.1145/2785956.2787490",
      "doi": "10.1145/2785956.2787490"
    },
    {
      "text": "Sanket Bhoyate, Charith K. Ranaweera, Chunyang Zhang, Tucker Morey, Megan Hyatt, Pawan K. Kahol, Madhav Ghimire, Sanjay R. Mishra, and Ram K. Gupta. 2017. Eco-Friendly and High Performance Supercapacitors for Elevated Temperature Applications Using Recycled Tea Leaves. Global Challenges 1, 8 (2017), 1700063. https://doi.org/10.1002/gch2.201700063 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/gch2.201700063",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’07. ACM Press, San Jose, California, USA, 503–512. https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, Austin, Texas, USA, 947. https://doi.org/10.1145/2207676.2208539",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Leah Buechley and Michael Eisenberg. 2008. The LilyPad Arduino: Toward Wearable Engineering for Everyone. IEEE Pervasive Computing 7, 2 (2008), 12–15. https://doi.org/10.1109/MPRV.2008.38",
      "doi": "10.1109/MPRV.2008.38"
    },
    {
      "text": "Leah Buechley, Sue Hendrix, and Mike Eisenberg. 2009. Paints, Paper, and Programs: First Steps toward the Computational Sketchbook. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction(Cambridge, United Kingdom) (TEI ’09). Association for Computing Machinery, New York, NY, USA, 9–12. https://doi.org/10.1145/1517664.1517670",
      "doi": "10.1145/1517664.1517670"
    },
    {
      "text": "Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the Wild: How Hardware’s Long Tail is Supporting New Engineering and Design Communities. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (Aarhus, Denmark) (DIS ’10). Association for Computing Machinery, New York, NY, USA, 199–207. https://doi.org/10.1145/1858171.1858206",
      "doi": "10.1145/1858171.1858206"
    },
    {
      "text": "Leah Buechley and Hannah Perner-Wilson. 2012. Crafting Technology: Reimagining the Processes, Materials, and Cultures of Electronics. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 21 (oct 2012), 21 pages. https://doi.org/10.1145/2362364.2362369",
      "doi": "10.1145/2362364.2362369"
    },
    {
      "text": "Mengyu Cao. 2017. Lunhui: Upcycled Creations. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition (Singapore, Singapore) (C&C ’17). Association for Computing Machinery, New York, NY, USA, 269–271. https://doi.org/10.1145/3059454.3078710",
      "doi": "10.1145/3059454.3078710"
    },
    {
      "text": "chemicum. 2021. Supercapacitor - how to make, for a greener future. YouTube. https://www.youtube.com/watch?v=iQ3njhSnOA0",
      "doi": ""
    },
    {
      "text": "Tungpo Chen, Yichen Lin, Xiang Bi, and Yesong Gu. 2020. Conductive poly(3,4-ethylenedioxythiophene) is effectively degradable by hydrogen peroxide with iron (II) chloride. Materials Chemistry and Physics 242 (2020), 122509. https://doi.org/10.1016/j.matchemphys.2019.122509",
      "doi": ""
    },
    {
      "text": "Seokheun Choi. 2022. Electrogenic Bacteria Promise New Opportunities for Powering, Sensing, and Synthesizing. Small 18, 18 (2022), 2107902. https://doi.org/10.1002/smll.202107902 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/smll.202107902",
      "doi": ""
    },
    {
      "text": "Sharon Lynn Chu, Rebecca Schlegel, Francis Quek, Andrew Christy, and Kaiyuan Chen. 2017. ’I Make, Therefore I Am’: The Effects of Curriculum-Aligned Making on Children’s Self-Identity. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 109–120. https://doi.org/10.1145/3025453.3025458",
      "doi": "10.1145/3025453.3025458"
    },
    {
      "text": "Yieu Chyan, Ruquan Ye, Yilun Li, Swatantra Pratap Singh, Christopher J. Arnusch, and James M. Tour. 2018. Laser-Induced Graphene by Multiple Lasing: Toward Electronics on Cloth, Paper, and Food. ACS Nano 12, 3 (2018), 2176–2183. https://doi.org/10.1021/acsnano.7b08539 arXiv:https://doi.org/10.1021/acsnano.7b08539PMID: 29436816.",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho, Lyndl Hall, Joanna Berzowska, and Pattie Maes. 2009. Pulp-Based Computing: A Framework for Building Computers out of Paper. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems (Boston, MA, USA) (CHI EA ’09). Association for Computing Machinery, New York, NY, USA, 3527–3528. https://doi.org/10.1145/1520340.1520525",
      "doi": "10.1145/1520340.1520525"
    },
    {
      "text": "Jialin Deng, Ferran Altarriba Bertran, Lining Yao, Marianna Obrist, Koya Narumi, Humphrey Yang, Mako Miyatake, and Florian Mueller. 2022. Mapping FoodHCI Futures. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 166, 5 pages. https://doi.org/10.1145/3491101.3516401",
      "doi": "10.1145/3491101.3516401"
    },
    {
      "text": "Kristin N. Dew, Samantha Shorey, and Daniela Rosner. 2018. Making within limits: towards salvage fabrication. In Proceedings of the 2018 Workshop on Computing within Limits - LIMITS ’18. ACM Press, Toronto, Ontario, Canada, 1–11. https://doi.org/10.1145/3232617.3232626",
      "doi": "10.1145/3232617.3232626"
    },
    {
      "text": "Christine Dierk, Molly Jane Pearce Nicholas, and Eric Paulos. 2018. AlterWear: Battery-Free Wearable Displays for Opportunistic Interactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173794",
      "doi": "10.1145/3173574.3173794"
    },
    {
      "text": "Christine Dierk, Tomás Vega Gálvez, and Eric Paulos. 2017. AlterNail: Ambient, Batteryless, Stateful, Dynamic Displays at Your Fingertips. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6754–6759. https://doi.org/10.1145/3025453.3025924",
      "doi": "10.1145/3025453.3025924"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, Atlanta, Georgia, USA, 1975. https://doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Markéta Dolejšová, Danielle Wilde, Ferran Altarriba Bertran, and Hilary Davis. 2020. Disrupting (More-than-) Human-Food Interaction: Experimental Design, Tangibles and Food-Tech Futures. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 993–1004. https://doi.org/10.1145/3357236.3395437",
      "doi": "10.1145/3357236.3395437"
    },
    {
      "text": "Boris Dyatkin, Volker Presser, Min Heon, Maria R. Lukatskaya, Majid Beidaghi, and Yury Gogotsi. 2013. Development of a Green Supercapacitor Composed Entirely of Environmentally Friendly Materials. ChemSusChem 6, 12 (2013), 2269–2280. https://doi.org/10.1002/cssc.201300852 arXiv:https://chemistry-europe.onlinelibrary.wiley.com/doi/pdf/10.1002/cssc.201300852",
      "doi": ""
    },
    {
      "text": "Nejla B. Erdal and Minna Hakkarainen. 2022. Degradation of Cellulose Derivatives in Laboratory, Man-Made, and Natural Environments. Biomacromolecules 23, 7 (2022), 2713–2729. https://doi.org/10.1021/acs.biomac.2c00336 arXiv:https://doi.org/10.1021/acs.biomac.2c00336PMID: 35763720.",
      "doi": ""
    },
    {
      "text": "Piyum Fernando, Matthew Pandelakis, and Stacey Kuznetsov. 2016. Practicing DIYBiology In An HCI Setting. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 2064–2071. https://doi.org/10.1145/2851581.2892325",
      "doi": "10.1145/2851581.2892325"
    },
    {
      "text": "William Gaver, Andy Boucher, Michail Vanis, Andy Sheen, Dean Brown, Liliana Ovalle, Naho Matsuda, Amina Abbas-Nazari, and Robert Phillips. 2019. My Naturewatch Camera: Disseminating Practice Research with a Cheap and Easy DIY Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300532",
      "doi": "10.1145/3290605.3300532"
    },
    {
      "text": "Alex Golberg, Haim D. Rabinowitch, and Boris Rubinsky. 2010. Zn/Cu-vegetative batteries, bioelectrical characterizations, and primary cost analyses. Journal of Renewable and Sustainable Energy 2, 3 (2010), 033103. https://doi.org/10.1063/1.3427222 arXiv:https://doi.org/10.1063/1.3427222",
      "doi": ""
    },
    {
      "text": "Eduard Georges Groutars, Carmen Clarice Risseeuw, Colin Ingham, Raditijo Hamidjaja, Willemijn S. Elkhuizen, Sylvia C. Pont, and Elvin Karana. 2022. Flavorium: An Exploration of Flavobacteria’s Living Aesthetics for Living Color Interfaces. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 99, 19 pages. https://doi.org/10.1145/3491102.3517713",
      "doi": "10.1145/3491102.3517713"
    },
    {
      "text": "Charles Alan Hamilton, Gursel Alici, and Marc in het Panhuis. 2018. 3D printing Vegemite and Marmite: Redefining “breadboards”. Journal of Food Engineering 220 (2018), 83–88. https://doi.org/10.1016/j.jfoodeng.2017.01.008 3D Printed Food – Design and Technology.",
      "doi": ""
    },
    {
      "text": "Ollie Hanton, Zichao Shen, Mike Fraser, and Anne Roudaut. 2022. FabricatINK: Personal Fabrication of Bespoke Displays Using Electronic Ink from Upcycled E Readers. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 173, 15 pages. https://doi.org/10.1145/3491102.3501844",
      "doi": "10.1145/3491102.3501844"
    },
    {
      "text": "Helen H. Hsu, Ali Khosrozadeh, Bingyun Li, Gaoxing Luo, Malcolm Xing, and Wen Zhong. 2019. An Eco-Friendly, Nanocellulose/RGO/in Situ Formed Polyaniline for Flexible and Free-Standing Supercapacitors. ACS Sustainable Chemistry & Engineering 7, 5 (2019), 4766–4776. https://doi.org/10.1021/acssuschemeng.8b04947 arXiv:https://doi.org/10.1021/acssuschemeng.8b04947",
      "doi": ""
    },
    {
      "text": "Liangbing Hu, Jang Wook Choi, Yuan Yang, Sangmoo Jeong, Fabio La Mantia, Li-Feng Cui, and Yi Cui. 2009. Highly conductive paper for energy-storage devices. Proceedings of the National Academy of Sciences 106, 51(2009), 21490–21494. https://doi.org/10.1073/pnas.0908858106 arXiv:https://www.pnas.org/content/106/51/21490.full.pdf",
      "doi": ""
    },
    {
      "text": "Kunpeng Huang, Ruojia Sun, Ximeng Zhang, Md. Tahmidul Islam Molla, Margaret Dunne, Francois Guimbretiere, and Cindy Hsin-Liu Kao. 2021. WovenProbe: Probing Possibilities for Weaving Fully-Integrated On-Skin Systems Deployable in the Field. In Designing Interactive Systems Conference 2021(Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 1143–1158. https://doi.org/10.1145/3461778.3462105",
      "doi": "10.1145/3461778.3462105"
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering Individuals with Do-It-Yourself Assistive Technology. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility(Dundee, Scotland, UK) (ASSETS ’11). Association for Computing Machinery, New York, NY, USA, 11–18. https://doi.org/10.1145/2049536.2049541",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Ayaka Ishii, Kunihiro Kato, Kaori Ikematsu, Yoshihiro Kawahara, and Itiro Siio. 2021. Fabricating Wooden Circuit Boards by Laser Beam Machining. Association for Computing Machinery, New York, NY, USA, 109–111. https://doi.org/10.1145/3474349.3480191",
      "doi": "10.1145/3474349.3480191"
    },
    {
      "text": "Mitch Jacoby. 2019. It’s time to get serious about recycling lithium-ion batteries. https://cen.acs.org/materials/energy-storage/time-serious-recycling-lithium/97/i28",
      "doi": ""
    },
    {
      "text": "Jungho Jin, Daewon Lee, Hyeon-Gyun Im, Yun Cheol Han, Eun Gyo Jeong, Marco Rolandi, Kyung Cheol Choi, and Byeong-Soo Bae. 2016. Chitin Nanofiber Transparent Paper for Flexible Green Electronics. Advanced Materials 28, 26 (2016), 5169–5175. https://doi.org/10.1002/adma.201600336 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adma.201600336",
      "doi": ""
    },
    {
      "text": "Jincy Parayangattil Jyothibasu and Rong-Ho Lee. 2018. Facile, Scalable, Eco-Friendly Fabrication of High-Performance Flexible All-Solid-State Supercapacitors. Polymers 10, 11 (2018), 21 pages. https://doi.org/10.3390/polym10111247",
      "doi": ""
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. 2016. DuoSkin: Rapidly Prototyping on-Skin User Interfaces Using Skin-Friendly Materials. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (Heidelberg, Germany) (ISWC ’16). Association for Computing Machinery, New York, NY, USA, 16–23. https://doi.org/10.1145/2971763.2971777",
      "doi": "10.1145/2971763.2971777"
    },
    {
      "text": "Elvin Karana, Bahareh Barati, and Elisa Giaccardi. 2020. Living Artefacts: Conceptualizing Livingness as a Material Quality in Everyday Artefacts.International Journal of Design 14, 3 (2020), 17 pages.",
      "doi": ""
    },
    {
      "text": "Elvin Karana, Davine Blauwhoff, Erik-Jan Hultink, and Serena Camere. 2018. When the Material Grows: A Case Study on Designing (with) Mycelium-based Materials. International Journal of Design 12, 2 (2018), 18.",
      "doi": ""
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-Based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Zurich, Switzerland) (UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 363–372. https://doi.org/10.1145/2493432.2493486",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "John Keeling. 2017. Graphite: properties, uses and South Australian resources. MESA Journal 84(2017), 21–44. Issue 3. https://minedocs.com/17/Siviour_Deposit_2017.pdf",
      "doi": ""
    },
    {
      "text": "Michael Klements. 2021. Making An Ultra Low Power Arduino Pro. https://www.the-diy-life.com/making-an-ultra-low-power-arduino-pro/",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, Piyum Fernando, Emily Ritter, Cassandra Barrett, Jennifer Weiler, and Marissa Rohr. 2018. Screenprinting and TEI: Supporting Engagement with STEAM through DIY Fabrication of Smart Materials. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (Stockholm, Sweden) (TEI ’18). Association for Computing Machinery, New York, NY, USA, 211–220. https://doi.org/10.1145/3173225.3173253",
      "doi": "10.1145/3173225.3173253"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the Expert Amateur: DIY Projects, Communities, and Cultures. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries(Reykjavik, Iceland) (NordiCHI ’10). Association for Computing Machinery, New York, NY, USA, 295–304. https://doi.org/10.1145/1868914.1868950",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "lasersaber. 2015. Easy DIY Graphene SuperCapacitors. YouTube. https://www.youtube.com/watch?v=Ar3C5JgzhgE",
      "doi": ""
    },
    {
      "text": "Eldy S. Lazaro Vasquez, Hao-Chuan Wang, and Katia Vega. 2020. Introducing the Sustainable Prototyping Life Cycle for Digital Fabrication to Designers. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, Eindhoven Netherlands, 1301–1312. https://doi.org/10.1145/3357236.3395510",
      "doi": "10.1145/3357236.3395510"
    },
    {
      "text": "Rongfeng Li, Liu Wang, and Lan Yin. 2018. Materials and Devices for Biodegradable and Soft Biomedical Electronics. Materials 11, 11 (2018), 23 pages. https://doi.org/10.3390/ma11112108",
      "doi": ""
    },
    {
      "text": "Wenhui Li, Qian Liu, Yuniu Zhang, Chang’an Li, Zhenfei He, Wallace C. H. Choy, Paul J. Low, Prashant Sonar, and Aung Ko Ko Kyaw. 2020. Biodegradable Materials and Green Processing for Green Electronics. Advanced Materials 32, 33 (Aug. 2020), 2001591. https://doi.org/10.1002/adma.202001591",
      "doi": ""
    },
    {
      "text": "Shiying Lin, Feijun Wang, and Ziqiang Shao. 2021. Biomass applied in supercapacitor energy storage devices. Journal of Materials Science 56, 3 (Jan. 2021), 1943–1979. https://doi.org/10.1007/s10853-020-05356-1",
      "doi": ""
    },
    {
      "text": "Lin Liu, Maedeh Mohammadifar, Anwar Elhadad, Mehdi Tahernia, Yunxiang Zhang, Wenfeng Zhao, and Seokheun Choi. 2021. Spatial Engineering of Microbial Consortium for Long-Lasting, Self-Sustaining, and High-Power Generation in a Bacteria-Powered Biobattery. Advanced Energy Materials 11, 22 (2021), 2100713. https://doi.org/10.1002/aenm.202100713 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/aenm.202100713",
      "doi": ""
    },
    {
      "text": "Vincent Liu, Aaron Parks, Vamsi Talla, Shyamnath Gollakota, David Wetherall, and Joshua R. Smith. 2013. Ambient Backscatter: Wireless Communication out of Thin Air. SIGCOMM Comput. Commun. Rev. 43, 4 (aug 2013), 39–50. https://doi.org/10.1145/2534169.2486015",
      "doi": "10.1145/2534169.2486015"
    },
    {
      "text": "Joanne Lo, Doris Jung Lin Lee, Nathan Wong, David Bui, and Eric Paulos. 2016. Skintillates: Designing and Creating Epidermal Interactions. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 853–864. https://doi.org/10.1145/2901790.2901885",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Markus Lochtefeld, Anna Dagmar Bille Milthers, and Timothy Merritt. 2021. Staging Constructionist Learning about Energy for Children with Electrochromic Displays and Low-Cost Materials. In 20th International Conference on Mobile and Ubiquitous Multimedia (Leuven, Belgium) (MUM 2021). Association for Computing Machinery, New York, NY, USA, 73–83. https://doi.org/10.1145/3490632.3490654",
      "doi": "10.1145/3490632.3490654"
    },
    {
      "text": "Anders Lundström and Ylva Fernaeus. 2022. Making Crank-Powered Interactions: Methods, Demonstrators, Materials. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 913–924. https://doi.org/10.1145/3532106.3533453",
      "doi": "10.1145/3532106.3533453"
    },
    {
      "text": "Irene Maldini. 2016. Attachment, Durability and the Environmental Impact of Digital DIY. The Design Journal 19, 1 (2016), 141–157. https://doi.org/10.1080/14606925.2016.1085213 arXiv:https://doi.org/10.1080/14606925.2016.1085213",
      "doi": ""
    },
    {
      "text": "Libu Manjakkal, Fabiane Fantinelli Franco, Abhilash Pullanchiyodan, Mario González-Jiménez, and Ravinder Dahiya. 2021. Natural Jute Fibre-Based Supercapacitors and Sensors for Eco-Friendly Energy Autonomous Systems. Advanced Sustainable Systems 5, 3 (2021), 2000286. https://doi.org/10.1002/adsu.202000286 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adsu.202000286",
      "doi": ""
    },
    {
      "text": "Jennifer C. Mankoff, Eli Blevis, Alan Borning, Batya Friedman, Susan R. Fussell, Jay Hasbrouck, Allison Woodruff, and Phoebe Sengers. 2007. Environmental sustainability and interaction. In CHI ’07 extended abstracts on Human factors in computing systems - CHI ’07. ACM Press, San Jose, CA, USA, 2121. https://doi.org/10.1145/1240866.1240963",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Janis Lena Meissner, John Vines, Janice McLaughlin, Thomas Nappey, Jekaterina Maksimova, and Peter Wright. 2017. Do-It-Yourself Empowerment as Experienced by Novice Makers with Disabilities. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 1053–1065. https://doi.org/10.1145/3064663.3064674",
      "doi": "10.1145/3064663.3064674"
    },
    {
      "text": "David A. Mellis and Leah Buechley. 2014. Do-It-Yourself Cellphones: An Investigation into the Possibilities and Limits of High-Tech Diy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1723–1732. https://doi.org/10.1145/2556288.2557309",
      "doi": "10.1145/2556288.2557309"
    },
    {
      "text": "Jussi Mikkonen, Ramyah Gowrishankar, Miia Oksanen, Harri Raittinen, and Arto Kolinummi. 2014. OJAS: Open Source Bi-Directional Inductive Power Link. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1049–1058. https://doi.org/10.1145/2556288.2557041",
      "doi": "10.1145/2556288.2557041"
    },
    {
      "text": "Milica Milošević, Ana Krkobabić, Marija Radoičić, Zoran Šaponjić, Tamara Radetić, and Maja Radetić. 2017. Biodegradation of cotton and cotton/polyester fabrics impregnated with Ag/TiO2 nanoparticles in soil. Carbohydrate Polymers 158 (2017), 77–84. https://doi.org/10.1016/j.carbpol.2016.12.006",
      "doi": ""
    },
    {
      "text": "Rachel M. Miriani, Mohammad Reza Abidian, and Daryl R. Kipke. 2008. Cytotoxic analysis of the conducting polymer PEDOT using myocytes. In 2008 30th Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE, Vancouver, BC, Canada, 1841–1844. https://doi.org/10.1109/IEMBS.2008.4649538",
      "doi": ""
    },
    {
      "text": "Rafael Morales González, Asier Marzo, Euan Freeman, William Frier, and Orestis Georgiou. 2021. UltraPower: Powering Tangible & Wearable Devices with Focused Ultrasound. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (Salzburg, Austria) (TEI ’21). Association for Computing Machinery, New York, NY, USA, Article 1, 13 pages. https://doi.org/10.1145/3430524.3440620",
      "doi": "10.1145/3430524.3440620"
    },
    {
      "text": "Robert Murray-Smith. 2019. Build A Super Simple Supercapacitor Step by Step. YouTube. https://www.youtube.com/watch?v=FUw6cZTR9yM",
      "doi": ""
    },
    {
      "text": "Netta Ofer, Fiona Bell, and Mirela Alistar. 2021. Designing Direct Interactions with Bioluminescent Algae. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 1230–1241. https://doi.org/10.1145/3461778.3462090",
      "doi": "10.1145/3461778.3462090"
    },
    {
      "text": "Stefano Parisi, Valentina Rognoli, and Marieke Sonneveld. 2017. Material Tinkering. An inspirational approach for experiential learning and envisioning in product design education. The Design Journal 20, sup1 (2017), S1167–S1184. https://doi.org/10.1080/14606925.2017.1353059 arXiv:https://doi.org/10.1080/14606925.2017.1353059",
      "doi": ""
    },
    {
      "text": "Aaron N. Parks, Angli Liu, Shyamnath Gollakota, and Joshua R. Smith. 2014. Turbocharging Ambient Backscatter Communication. SIGCOMM Comput. Commun. Rev. 44, 4 (aug 2014), 619–630. https://doi.org/10.1145/2740070.2626312",
      "doi": "10.1145/2740070.2626312"
    },
    {
      "text": "Pat Pataranutaporn, Angela Vujic, David S. Kong, Pattie Maes, and Misha Sra. 2020. Living Bits: Opportunities and Challenges for Integrating Living Microorganisms in Human-Computer Interaction. In Proceedings of the Augmented Humans International Conference (Kaiserslautern, Germany) (AHs ’20). Association for Computing Machinery, New York, NY, USA, Article 30, 12 pages. https://doi.org/10.1145/3384657.3384783",
      "doi": "10.1145/3384657.3384783"
    },
    {
      "text": "M. Pershaanaa, Shahid Bashir, S. Ramesh, and K. Ramesh. 2022. Every bite of Supercap: A brief review on construction and enhancement of supercapacitor. Journal of Energy Storage 50 (2022), 104599. https://doi.org/10.1016/j.est.2022.104599",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2011. Second-hand interactions: investigating reacquisition and dispossession practices around domestic objects. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11. ACM Press, Vancouver, BC, Canada, 2385. https://doi.org/10.1145/1978942.1979291",
      "doi": "10.1145/1978942.1979291"
    },
    {
      "text": "Poonam, Kriti Sharma, Anmol Arora, and S.K. Tripathi. 2019. Review of supercapacitors: Materials and devices. Journal of Energy Storage 21 (2019), 801–825. https://doi.org/10.1016/j.est.2019.01.010",
      "doi": ""
    },
    {
      "text": "Thomas Preindl, Cedric Honnet, Andreas Pointner, Roland Aigner, Joseph A. Paradiso, and Michael Haller. 2020. Sonoflex: Embroidered Speakers Without Permanent Magnets. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 675–685. https://doi.org/10.1145/3379337.3415888",
      "doi": "10.1145/3379337.3415888"
    },
    {
      "text": "Jie Qi and Leah Buechley. 2014. Sketching in Circuits: Designing and Building Electronics on Paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1713–1722. https://doi.org/10.1145/2556288.2557391",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Jie Qi, Leah Buechley, Andrew \"bunnie\" Huang, Patricia Ng, Sean Cross, and Joseph A. Paradiso. 2018. Chibitronics in the Wild: Engaging New Communities in Creating Technology with Paper Electronics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173826",
      "doi": "10.1145/3173574.3173826"
    },
    {
      "text": "Omar Rana. 2018. Nature’s Recipe Book. materiom. https://materiom.org/",
      "doi": ""
    },
    {
      "text": "Nimesha Ranasinghe and Ellen Yi-Luen Do. 2016. Digital Lollipop: Studying Electrical Stimulation on the Human Tongue to Simulate Taste Sensations. ACM Trans. Multimedia Comput. Commun. Appl. 13, 1, Article 5 (oct 2016), 22 pages. https://doi.org/10.1145/2996462",
      "doi": "10.1145/2996462"
    },
    {
      "text": "Nimesha Ranasinghe, Gajan Suthokumar, Kuan-Yi Lee, and Ellen Yi-Luen Do. 2015. Digital Flavor: Towards Digitally Simulating Virtual Flavors. In Proceedings of the 2015 ACM on International Conference on Multimodal Interaction (Seattle, Washington, USA) (ICMI ’15). Association for Computing Machinery, New York, NY, USA, 139–146. https://doi.org/10.1145/2818346.2820761",
      "doi": "10.1145/2818346.2820761"
    },
    {
      "text": "Research and Markets. 2022. Ultra-low-power Microcontroller Market by Peripheral Device (Analog Devices and Digital Devices), Packaging Type (8-bit, 16-bit, and 32-bit), End-Use Application, & Region (North America, Europe, APAC, Rest of the World) - Global Forecast to 2027. https://www.researchandmarkets.com/reports/4848774/ultra-low-power-microcontroller-market-by",
      "doi": ""
    },
    {
      "text": "Atomik Research. 2020. PR Research: Oxfam – Fast Fashion. 4media group, inc. https://www.atomikresearch.co.uk/case-studies-archive/pr-research-oxfam-fast-fashion/",
      "doi": ""
    },
    {
      "text": "Valentina Rognoli, Massimo Bianchini, Stefano Maffei, and Elvin Karana. 2015. DIY materials. Materials & Design 86(2015), 692–702. https://doi.org/10.1016/j.matdes.2015.07.020",
      "doi": ""
    },
    {
      "text": "Corina Sas and Carman Neustaedter. 2017. Exploring DIY Practices of Complex Home Technologies. ACM Trans. Comput.-Hum. Interact. 24, 2, Article 16 (apr 2017), 29 pages. https://doi.org/10.1145/3057863",
      "doi": "10.1145/3057863"
    },
    {
      "text": "Prerna Sinha, Soma Banerjee, and Kamal K Kar. 2020. Activated carbon as electrode materials for supercapacitors. In Handbook of Nanocomposite Supercapacitor Materials II. Springer, Cham, Switzerland, 113–144.",
      "doi": ""
    },
    {
      "text": "Sowmya Somanath, Laura Morrison, Janette Hughes, Ehud Sharlin, and Mario Costa Sousa. 2016. Engaging ’At-Risk’ Students through Maker Culture Activities. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction(Eindhoven, Netherlands) (TEI ’16). Association for Computing Machinery, New York, NY, USA, 150–158. https://doi.org/10.1145/2839462.2839482",
      "doi": "10.1145/2839462.2839482"
    },
    {
      "text": "Katherine W Song, Christine Dierk, Szu Ting Tung, and Eric Paulos. 2023. Lotio: Lotion-Mediated Interaction with an Electronic Skin-Worn Display. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (Hamburg, Germany) (CHI ’23). Association for Computing Machinery, New York, NY, USA, 15 pages. https://doi.org/10.1145/3544548.3581098",
      "doi": "10.1145/3544548.3581098"
    },
    {
      "text": "Katherine W Song, Aditi Maheshwari, Eric M Gallo, Andreea Danielescu, and Eric Paulos. 2022. Towards Decomposable Interactive Systems: Design of a Backyard-Degradable Wireless Heating Interface. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 100, 12 pages. https://doi.org/10.1145/3491102.3502007",
      "doi": "10.1145/3491102.3502007"
    },
    {
      "text": "Katherine W Song and Eric Paulos. 2021. Unmaking: Enabling and Celebrating the Creative Material of Failure, Destruction, Decay, and Deformation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 429, 12 pages. https://doi.org/10.1145/3411764.3445529",
      "doi": "10.1145/3411764.3445529"
    },
    {
      "text": "Grant Stokke. 2017. Homemade Supercapacitor Demo. YouTube. https://www.youtube.com/watch?v=3CnmuIhgn4g",
      "doi": ""
    },
    {
      "text": "David Sumner. 1971. Measurement of electrical taste threshold. In Proceedings of the Royal Society of Medicine, Vol. 64. SAGE Publications, London, UK, 658–660.",
      "doi": ""
    },
    {
      "text": "Ryo Takahashi, Takuya Sasatani, Fuminori Okuya, Yoshiaki Narusue, and Yoshihiro Kawahara. 2018. Design of Cuttable Wireless Power Transfer Sheet. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers (Singapore, Singapore) (UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 456–459. https://doi.org/10.1145/3267305.3267570",
      "doi": "10.1145/3267305.3267570"
    },
    {
      "text": "Ryo Takahashi, Wakako Yukita, Tomoyuki Yokota, Takao Someya, and Yoshihiro Kawahara. 2022. Meander Coil++: A Body-Scale Wireless Power Transmission Using Safe-to-Body and Energy-Efficient Transmitter Coil. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 390, 12 pages. https://doi.org/10.1145/3491102.3502119",
      "doi": "10.1145/3491102.3502119"
    },
    {
      "text": "Ken Takaki, Takuya Sasatani, Hironobu Kasashima, Yoshihiro Kawahara, and Takeshi Naemura. 2020. Coil Design for Wireless Power Transfer and Communication over Hinges of Smart Glasses. In Proceedings of the 2020 International Symposium on Wearable Computers (Virtual Event, Mexico) (ISWC ’20). Association for Computing Machinery, New York, NY, USA, 79–83. https://doi.org/10.1145/3410531.3414299",
      "doi": "10.1145/3410531.3414299"
    },
    {
      "text": "Theresa Jean Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing Technology: Pleasure, Utility and Expressiveness in DIY and Maker Practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 2603–2612. https://doi.org/10.1145/2470654.2481360",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Hu Tao, Mark A. Brenckle, Miaomiao Yang, Jingdi Zhang, Mengkun Liu, Sean M. Siebert, Richard D. Averitt, Manu S. Mannoor, Michael C. McAlpine, John A. Rogers, David L. Kaplan, and Fiorenzo G. Omenetto. 2012. Silk-Based Conformal, Adhesive, Edible Food Sensors. Advanced Materials 24, 8 (2012), 1067–1072. https://doi.org/10.1002/adma.201103814 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adma.201103814",
      "doi": ""
    },
    {
      "text": "Daniel Tobjörk and Ronald Österbacka. 2011. Paper Electronics. Advanced Materials 23, 17 (2011), 1935–1961. https://doi.org/10.1002/adma.201004692 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adma.201004692",
      "doi": ""
    },
    {
      "text": "Eldy S. Lazaro Vasquez and Katia Vega. 2019. From plastic to biomaterials: prototyping DIY electronics with mycelium. In Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers - UbiComp/ISWC ’19. ACM Press, London, United Kingdom, 308–311. https://doi.org/10.1145/3341162.3343808",
      "doi": "10.1145/3341162.3343808"
    },
    {
      "text": "Eldy S. Lazaro Vasquez and Katia Vega. 2019. Myco-accessories: sustainable wearables with biodegradable materials. In Proceedings of the 23rd International Symposium on Wearable Computers - ISWC ’19. ACM Press, London, United Kingdom, 306–311. https://doi.org/10.1145/3341163.3346938",
      "doi": "10.1145/3341163.3346938"
    },
    {
      "text": "Nicolas Villar, Daniel Cletheroe, Greg Saul, Christian Holz, Tim Regan, Oscar Salandin, Misha Sra, Hui-Shyong Yeo, William Field, and Haiyan Zhang. 2018. Project Zanzibar: A Portable and Flexible Tangible Interaction Platform. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174089",
      "doi": "10.1145/3173574.3174089"
    },
    {
      "text": "Anandghan Waghmare, Qiuyue Xue, Dingtian Zhang, Yuhui Zhao, Shivan Mittal, Nivedita Arora, Ceara Byrne, Thad Starner, and Gregory D Abowd. 2020. UbiquiTouch: Self Sustaining Ubiquitous Touch Interfaces. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1, Article 27 (mar 2020), 22 pages. https://doi.org/10.1145/3380989",
      "doi": "10.1145/3380989"
    },
    {
      "text": "Anran Wang, Vikram Iyer, Vamsi Talla, Joshua R. Smith, and Shyamnath Gollakota. 2017. FM Backscatter: Enabling Connected Cities and Smart Fabrics. In Proceedings of the 14th USENIX Conference on Networked Systems Design and Implementation (Boston, MA, USA) (NSDI’17). USENIX Association, USA, 243–258.",
      "doi": ""
    },
    {
      "text": "Shan Wang, Aolin Lu, and Chuan-Jian Zhong. 2021. Hydrogen production from water electrolysis: role of catalysts. Nano Convergence 8, 1 (Feb. 2021), 4. https://doi.org/10.1186/s40580-021-00254-x",
      "doi": ""
    },
    {
      "text": "Xu Wang, Wenwen Xu, Prithwish Chatterjee, Cheng Lv, John Popovich, Zeming Song, Lenore Dai, M. Yashar S. Kalani, Shelley E. Haydel, and Hanqing Jiang. 2016. Food-Materials-Based Edible Supercapacitors. Advanced Materials Technologies 1, 3 (2016), 1600059. https://doi.org/10.1002/admt.201600059 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/admt.201600059",
      "doi": ""
    },
    {
      "text": "Yanan Wang, Shijian Luo, Yujia Lu, Hebo Gong, Yexing Zhou, Shuai Liu, and Preben Hansen. 2017. AnimSkin: Fabricating Epidermis with Interactive, Functional and Aesthetic Color Animation. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 397–401. https://doi.org/10.1145/3064663.3064687",
      "doi": "10.1145/3064663.3064687"
    },
    {
      "text": "Mary M. Warnock, Kaaron J. Davis, Duane C. Wolf, and Edward E. Gbur. 2009. Biodegradation of Three Cellulosic Fabrics in Soil. In Summaries of Arkansas Cotton Research. The Arkansas Agricultural Experiment Station, Fayetteville, AR, USA, 208–211.",
      "doi": ""
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jürgen Steimle. 2017. SkinMarks: Enabling Interactions on Body Landmarks Using Conformal Skin Electronics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3095–3105. https://doi.org/10.1145/3025453.3025704",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Jennifer Weiler, Piyum Fernando, Nipuni Siyambalapitiya, and Stacey Kuznetsov. 2019. Mycelium Artifacts: Exploring Shapeable and Accessible Biofabrication. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion - DIS ’19 Companion. ACM Press, San Diego, CA, USA, 69–72. https://doi.org/10.1145/3301019.3325156",
      "doi": "10.1145/3301019.3325156"
    },
    {
      "text": "Paul Worgan and Mike Fraser. 2017. CoilMove: An Actuated to-Body Energy Transfer System. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 791–795. https://doi.org/10.1145/3064663.3064693",
      "doi": "10.1145/3064663.3064693"
    },
    {
      "text": "Shanel Wu and Laura Devendorf. 2020. Unfabricate: Designing Smart Textiles for Disassembly. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376227",
      "doi": "10.1145/3313831.3376227"
    },
    {
      "text": "Peihua Yang, Jia Li, Seok Woo Lee, and Hong Jin Fan. 2022. Printed Zinc Paper Batteries. Advanced Science 9, 2 (2022), 2103894. https://doi.org/10.1002/advs.202103894 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/advs.202103894",
      "doi": ""
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. bioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, Seoul, Republic of Korea, 1–10. https://doi.org/10.1145/2702123.2702611",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Huizhong Ye, Chi-Jung Lee, Te-Yen Wu, Xing-Dong Yang, Bing-Yu Chen, and Rong-Hao Liang. 2022. Body-Centric NFC: Body-Centric Interaction with NFC Devices Through Near-Field Enabled Clothing. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 1626–1639. https://doi.org/10.1145/3532106.3534569",
      "doi": "10.1145/3532106.3534569"
    },
    {
      "text": "Lan Yin, Huanyu Cheng, Shimin Mao, Richard Haasch, Yuhao Liu, Xu Xie, Suk-Won Hwang, Harshvardhan Jain, Seung-Kyun Kang, Yewang Su, Rui Li, Yonggang Huang, and John A. Rogers. 2014. Dissolvable Metals for Transient Electronics. Advanced Functional Materials 24, 5 (2014), 645–658. https://doi.org/10.1002/adfm.201301847 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adfm.201301847",
      "doi": ""
    },
    {
      "text": "Pengyu Zhang, Dinesh Bharadia, Kiran Joshi, and Sachin Katti. 2016. HitchHike: Practical Backscatter Using Commodity WiFi. In Proceedings of the 14th ACM Conference on Embedded Network Sensor Systems CD-ROM (Stanford, CA, USA) (SenSys ’16). Association for Computing Machinery, New York, NY, USA, 259–271. https://doi.org/10.1145/2994551.2994565",
      "doi": "10.1145/2994551.2994565"
    },
    {
      "text": "Pengyu Zhang, Mohammad Rostami, Pan Hu, and Deepak Ganesan. 2016. Enabling Practical Backscatter Communication for On-Body Sensors. In Proceedings of the 2016 ACM SIGCOMM Conference (Florianopolis, Brazil) (SIGCOMM ’16). Association for Computing Machinery, New York, NY, USA, 370–383. https://doi.org/10.1145/2934872.2934901",
      "doi": "10.1145/2934872.2934901"
    },
    {
      "text": "Yang Zhang, Yasha Iravantchi, Haojian Jin, Swarun Kumar, and Chris Harrison. 2019. Sozu: Self-Powered Radio Tags for Building-Scale Activity Sensing. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 973–985. https://doi.org/10.1145/3332165.3347952",
      "doi": "10.1145/3332165.3347952"
    },
    {
      "text": "Mustafa Ergin Şahin, Frede Blaabjerg, and Ariya Sangwongwanich. 2022. A Comprehensive Review on Supercapacitor Applications and Developments. Energies 15, 3 (2022), 26 pages. https://doi.org/10.3390/en15030674",
      "doi": ""
    }
  ]
}