{
  "doi": "10.1145/3544548.3580836",
  "title": "Crafting Interactive Circuits on Glazed Ceramic Ware",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Glazed ceramic is a versatile material that we use every day. In this paper, we present a new approach that instruments existing glazed ceramic ware with interactive electronic circuits. We informed this work by collaborating with a ceramics designer and connected his craft practice to our experience in physical computing. From this partnership, we developed a systematic approach that begins with the subtractive fabrication of traces on glazed ceramic surfaces via the resist-blasting technique, followed by applying conductive ink into the inlaid traces. We capture and detail this approach through an annotated flowchart for others to refer to, as well as externalize the material insights we uncovered through ceramic and circuit swatches. We then demonstrate a range of interactive home applications built with this approach. Finally, we reflect on the process we took and discuss the importance of collaborating with craftspeople for material-driven research within HCI.",
  "authors": [
    {
      "name": "Clement Zheng",
      "institution": "Division of Industrial Design, National University of Singapore, Singapore and Keio-NUS CUTE Center, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659143831",
      "orcid": "0000-0003-0336-6430"
    },
    {
      "name": "Bo Han",
      "institution": "National University of Singapore, Singapore and Keio-NUS CUTE Center, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781437",
      "orcid": "0000-0002-5226-2163"
    },
    {
      "name": "Xin Liu",
      "institution": "Division of Industrial Design, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160301",
      "orcid": "0000-0002-4611-9790"
    },
    {
      "name": "Laura Devendorf",
      "institution": "ATLAS Institute & Information Science, University of Colorado Boulder, United States",
      "img": "/do/10.1145/contrib-81557677456/rel-imgonly/laura_devendorf14ga.jpg",
      "acmid": "81557677456",
      "orcid": "0000-0002-3656-7936"
    },
    {
      "name": "Hans Tan",
      "institution": "Division of Industrial Design, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659182756",
      "orcid": "0000-0002-1351-4700"
    },
    {
      "name": "Ching Chiuan Yen",
      "institution": "Division of Industrial Design, National University of Singapore, Singapore and Keio-NUS CUTE Center, National University of Singapore, Singapore",
      "img": "/do/10.1145/contrib-81493641324/rel-imgonly/img_9704-ts.jpg",
      "acmid": "81493641324",
      "orcid": "0000-0003-4325-1689"
    }
  ],
  "references": [
    {
      "text": "2023. Bare Conductive. https://www.bareconductive.com/",
      "doi": ""
    },
    {
      "text": "2023. Chibitronics. https://chibitronics.com/",
      "doi": ""
    },
    {
      "text": "Bahareh Barati and Elvin Karana. 2019. Affordances as Materials Potential: What Design Can Do for Materials Development. International Journal of Design 13, 3 (Dec. 2019), 105–123. http://www.ijdesign.org/index.php/IJDesign/article/view/3419/879",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 503–512. https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). ACM, New York, NY, USA, 423–432. https://doi.org/10.1145/1357054.1357123",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Leah Buechley and Hannah Perner-Wilson. 2012. Crafting technology: Reimagining the processes, materials, and cultures of electronics. ACM Trans. Comput.-Hum. Interact. 19, 3 (Oct. 2012), 21:1–21:21. https://doi.org/10.1145/2362364.2362369",
      "doi": "10.1145/2362364.2362369"
    },
    {
      "text": "Tingyu Cheng, Koya Narumi, Youngwook Do, Yang Zhang, Tung D. Ta, Takuya Sasatani, Eric Markvicka, Yoshihiro Kawahara, Lining Yao, Gregory D. Abowd, and HyunJoo Oh. 2020. Silver Tape: Inkjet-Printed Circuits Peeled-and-Transferred on Versatile Substrates. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1 (March 2020), 1–17. https://doi.org/10.1145/3381013",
      "doi": "10.1145/3381013"
    },
    {
      "text": "Manuel DeLanda. 2004. Material complexity. Digital tectonics 14(2004), 21. Publisher: West Sussex, UK: Wiley-Academy.",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Timea Tihanyi. 2019. ListeningCups: A Case of Data Tactility and Data Stories. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego CA USA, 147–160. https://doi.org/10.1145/3322276.3323694",
      "doi": "10.1145/3322276.3323694"
    },
    {
      "text": "Laura Devendorf, Katya Arquilla, Sandra Wirtanen, Allison Anderson, and Steven Frost. 2020. Craftspeople as Technical Collaborators: Lessons Learned through an Experimental Weaving Residency. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–13. https://doi.org/10.1145/3313831.3376820",
      "doi": "10.1145/3313831.3376820"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I Don’T Want to Wear a Screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 6028–6039. https://doi.org/10.1145/2858036.2858192",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Raune Frankjær and Peter Dalsgaard. 2018. Understanding Craft-Based Inquiry in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, Hong Kong China, 473–484. https://doi.org/10.1145/3196709.3196750",
      "doi": "10.1145/3196709.3196750"
    },
    {
      "text": "Shad Gross, Jeffrey Bardzell, and Shaowen Bardzell. 2014. Structures, forms, and stuff: the materiality and medium of interaction. Personal and Ubiquitous Computing 18, 3 (March 2014), 637–649. https://doi.org/10.1007/s00779-013-0689-4",
      "doi": "10.1007/s00779-013-0689-4"
    },
    {
      "text": "Cedric Honnet, Hannah Perner-Wilson, Marc Teyssier, Bruno Fruchard, Jürgen Steimle, Ana C. Baptista, and Paul Strohmeier. 2020. PolySense: Augmenting Textiles with Electrical Functionality using In-Situ Polymerization. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–13. https://doi.org/10.1145/3313831.3376841",
      "doi": "10.1145/3313831.3376841"
    },
    {
      "text": "Hiroshi Ishii. 2008. Tangible Bits: Beyond Pixels. In Proceedings of the 2Nd International Conference on Tangible and Embedded Interaction(TEI ’08). ACM, New York, NY, USA, xv–xxv. https://doi.org/10.1145/1347390.1347392",
      "doi": "10.1145/1347390.1347392"
    },
    {
      "text": "Jennifer Jacobs, David Mellis, Amit Zoran, Cesar Torres, Joel Brandt, and Theresa Jean Tanenbaum. 2016. Digital Craftsmanship: HCI Takes on Technology as an Expressive Medium. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems(Brisbane, QLD, Australia) (DIS ’16 Companion). Association for Computing Machinery, New York, NY, USA, 57–60. https://doi.org/10.1145/2908805.2913018",
      "doi": "10.1145/2908805.2913018"
    },
    {
      "text": "Lee Jones, Sara Nabil, Amanda McLeod, and Audrey Girouard. 2020. Wearable Bits: Scaffolding Creativity with a Prototyping Toolkit for Wearable E-textiles. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Sydney NSW Australia, 165–177. https://doi.org/10.1145/3374920.3374954",
      "doi": "10.1145/3374920.3374954"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. 2016. DuoSkin: rapidly prototyping on-skin user interfaces using skin-friendly materials. In Proceedings of the 2016 ACM International Symposium on Wearable Computers. ACM, Heidelberg Germany, 16–23. https://doi.org/10.1145/2971763.2971777",
      "doi": "10.1145/2971763.2971777"
    },
    {
      "text": "Elvin Karana, Bahareh Barati, Valentina Rognoli, Van Der Laan, Anouk Zeeuw, and others. 2015. Material driven design (MDD): A method to design for material experiences. (2015).",
      "doi": ""
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2015. ExtensionSticker: A Proposal for a Striped Pattern Sticker to Extend Touch Interfaces and its Assessment. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 1851–1854. https://doi.org/10.1145/2702123.2702500",
      "doi": "10.1145/2702123.2702500"
    },
    {
      "text": "Rohit Ashok Khot and Florian Mueller. 2019. Human-Food Interaction. HCI 12, 4 (Aug. 2019), 238–415. https://doi.org/10.1561/1100000074 Publisher: Now Publishers, Inc..",
      "doi": "10.1561/1100000074"
    },
    {
      "text": "Kyung-Ryong Lee, Somi Ju, Temirlan Dzhoroev, Geonil Goh, Moon-Hwan Lee, and Young-Woo Park. 2020. DayClo: An Everyday Table Clock Providing Interaction with Personal Schedule Data for Self-reflection. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). Association for Computing Machinery, New York, NY, USA, 1793–1806. https://doi.org/10.1145/3357236.3395439",
      "doi": "10.1145/3357236.3395439"
    },
    {
      "text": "Youn-Kyung Lim, Erik Stolterman, and Josh Tenenberg. 2008. The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas. ACM Trans. Comput.-Hum. Interact. 15, 2 (July 2008), 1–27. https://doi.org/10.1145/1375761.1375762",
      "doi": "10.1145/1375761.1375762"
    },
    {
      "text": "Henry Lin, Ron Wakkary, and Doenja Oogjes. 2019. The Tilting Bowl: Electronic Design for a Research Product. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 345–357. https://doi.org/10.1145/3322276.3323701",
      "doi": "10.1145/3322276.3323701"
    },
    {
      "text": "Rupert Meese, Shakir Ali, Emily-Clare Thorne, Steve D. Benford, Anthony Quinn, Richard Mortier, Boriana N. Koleva, Tony Pridmore, and Sharon L. Baurley. 2013. From codes to patterns: designing interactive decoration for tableware. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 931–940. https://doi.org/10.1145/2470654.2466119",
      "doi": "10.1145/2470654.2466119"
    },
    {
      "text": "Hedieh Moradi, Long N Nguyen, Quyen-Anh Valentina Nguyen, and Cesar Torres. 2022. Glaze Epochs: Understanding Lifelong Material Relationships within Ceramics Studios. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Daejeon Republic of Korea, 1–13. https://doi.org/10.1145/3490149.3501310",
      "doi": "10.1145/3490149.3501310"
    },
    {
      "text": "Sara Nabil, Aluna Everitt, Miriam Sturdee, Jason Alexander, Simon Bowen, Peter Wright, and David Kirk. 2018. ActuEating: Designing, Studying and Exploring Actuating Decorative Artefacts. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). Association for Computing Machinery, New York, NY, USA, 327–339. https://doi.org/10.1145/3196709.3196761",
      "doi": "10.1145/3196709.3196761"
    },
    {
      "text": "Sara Nabil and David Kirk. 2021. Decoraction: a Catalogue for Interactive Home Decor of the Nearest-Future. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’21). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3430524.3446074",
      "doi": "10.1145/3430524.3446074"
    },
    {
      "text": "Troy Nachtigall, Oscar Tomico, and Ron Wakkary. 2019. ONEDAY Shoes: A Maker Toolkit to Understand the Role of Co-Manufacturing in Personalization. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Tempe Arizona USA, 105–115. https://doi.org/10.1145/3294109.3295637",
      "doi": "10.1145/3294109.3295637"
    },
    {
      "text": "Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic Books (AZ).",
      "doi": "10.5555/2187809"
    },
    {
      "text": "William Odom, Ron Wakkary, Youn-kyung Lim, Audrey Desjardins, Bart Hengeveld, and Richard Banks. 2016. From Research Prototype to Research Product. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 2549–2561. https://doi.org/10.1145/2858036.2858447",
      "doi": "10.1145/2858036.2858447"
    },
    {
      "text": "Doenja Oogjes, Ron Wakkary, Henry Lin, and Omid Alemi. 2020. Fragile! Handle with Care: The Morse Things. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, Eindhoven Netherlands, 2149–2162. https://doi.org/10.1145/3357236.3395584",
      "doi": "10.1145/3357236.3395584"
    },
    {
      "text": "Minna Pakanen, Kasper Heiselberg, Troy Robert Nachtigall, Marie Broe, and Peter Gall Krogh. 2021. Crafting a Leather Self-tracking Device for Pollen Allergies. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3430524.3446072",
      "doi": "10.1145/3430524.3446072"
    },
    {
      "text": "Despina Papadopoulos. [n. d.]. From Thinking to Making: Weaving Technology in Everyday Life. http://www.tedxvilnius.com/2016/speakers/Despina-Papadopoulos",
      "doi": ""
    },
    {
      "text": "Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2011. Handcrafting Textile Interfaces from a Kit-of-no-parts. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’11). ACM, New York, NY, USA, 61–68. https://doi.org/10.1145/1935701.1935715",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "Hannah Perner-Wilson and Irene Posch. 2022. How Tangible is TEI? Exploring Swatches as a New Academic Publication Format. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Daejeon Republic of Korea, 1–4. https://doi.org/10.1145/3490149.3503668",
      "doi": "10.1145/3490149.3503668"
    },
    {
      "text": "Michael Polanyi and Amartya Sen. 2009. The Tacit Dimension. University of Chicago Press, Chicago ; London.",
      "doi": ""
    },
    {
      "text": "Irene Posch and Ebru Kurbak. 2016. CRAFTED LOGIC Towards Hand-Crafting a Computer. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, San Jose California USA, 3881–3884. https://doi.org/10.1145/2851581.2891101",
      "doi": "10.1145/2851581.2891101"
    },
    {
      "text": "Jie Qi and Leah Buechley. 2014. Sketching in circuits: designing and building electronics on paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 1713–1722. https://doi.org/10.1145/2556288.2557391",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Erica Robles and Mikael Wiberg. 2010. Texturing the \"material turn\" in interaction design. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction(TEI ’10). Association for Computing Machinery, New York, NY, USA, 137–144. https://doi.org/10.1145/1709886.1709911",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Daniela K Rosner, Miwa Ikemiya, and Tim Regan. 2015. Resisting Alignment: Code and Clay. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 181–188. https://dl.acm.org/citation.cfm?id=2680587",
      "doi": "10.1145/2677199.2680587"
    },
    {
      "text": "Michael Shorter, Jon Rogers, and John McGhee. 2014. Practical notes on paper circuits. In Proceedings of the 2014 conference on Designing interactive systems. ACM, Vancouver BC Canada, 483–492. https://doi.org/10.1145/2598510.2602965",
      "doi": "10.1145/2598510.2602965"
    },
    {
      "text": "Katherine W Song, Aditi Maheshwari, Eric M Gallo, Andreea Danielescu, and Eric Paulos. 2022. Towards Decomposable Interactive Systems: Design of a Backyard-Degradable Wireless Heating Interface. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–12. https://doi.org/10.1145/3491102.3502007",
      "doi": "10.1145/3491102.3502007"
    },
    {
      "text": "Ruojia Sun, Ryosuke Onose, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, Eindhoven Netherlands, 365–377. https://doi.org/10.1145/3357236.3395548",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Nađa Terzimehić, Renate Häuslschmid, Heinrich Hussmann, and m.c. schraefel. 2019. A Review & Analysis of Mindfulness Research in HCI: Framing Current Lines of Research and Future Opportunities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300687",
      "doi": "10.1145/3290605.3300687"
    },
    {
      "text": "Cesar Torres, Jessica Chang, Advaita Patel, and Eric Paulos. 2019. Phosphenes: Crafting Resistive Heaters within Thermoreactive Composites. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19. ACM Press, San Diego, CA, USA, 907–919. https://doi.org/10.1145/3322276.3322375",
      "doi": "10.1145/3322276.3322375"
    },
    {
      "text": "Vasiliki Tsaknaki, Ylva Fernaeus, and Mischa Schaub. 2014. Leather as a material for crafting interactive and physical artifacts. In Proceedings of the 2014 conference on Designing interactive systems. ACM Press, 5–14. https://doi.org/10.1145/2598510.2598574",
      "doi": "10.1145/2598510.2598574"
    },
    {
      "text": "Brygg Ullmer, Hiroshi Ishii, and Robert J. K. Jacob. 2005. Token+Constraint Systems for Tangible Interaction with Digital Information. ACM Trans. Comput.-Hum. Interact. 12, 1 (March 2005), 81–118. https://doi.org/10.1145/1057237.1057242",
      "doi": "10.1145/1057237.1057242"
    },
    {
      "text": "Anna Vallgårda and Johan Redström. 2007. Computational Composites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). ACM, New York, NY, USA, 513–522. https://doi.org/10.1145/1240624.1240706",
      "doi": "10.1145/1240624.1240706"
    },
    {
      "text": "Guanyun Wang, Fang Qin, Haolin Liu, Ye Tao, Yang Zhang, Yongjie Jessica Zhang, and Lining Yao. 2020. MorphingCircuit: An Integrated Design, Simulation, and Fabrication Workflow for Self-morphing Electronics. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4 (Dec. 2020), 1–26. https://doi.org/10.1145/3432232",
      "doi": "10.1145/3432232"
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21 st Century. Scientific American 265, 3 (1991), 94–105. https://www.jstor.org/stable/24938718",
      "doi": ""
    },
    {
      "text": "Mikael Wiberg, Hiroshi Ishii, Paul Dourish, Anna Vallgårda, Tobie Kerridge, Petra Sundström, Daniela Rosner, and Mark Rolston. 2013. Materiality matters—experience materials. interactions 20, 2 (March 2013), 54. https://doi.org/10.1145/2427076.2427087",
      "doi": "10.1145/2427076.2427087"
    },
    {
      "text": "Shanel Wu and Laura Devendorf. 2020. Unfabricate: Designing Smart Textiles for Disassembly. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376227",
      "doi": "10.1145/3313831.3376227"
    },
    {
      "text": "Clement Zheng and Michael Nitsche. 2017. Combining Practices in Craft and Design. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’17). ACM, New York, NY, USA, 331–340. https://doi.org/10.1145/3024969.3024973",
      "doi": "10.1145/3024969.3024973"
    },
    {
      "text": "Clement Zheng, HyunJoo Oh, Laura Devendorf, and Ellen Yi-Luen Do. 2019. Sensing Kirigami. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). ACM, New York, NY, USA, 921–934. https://doi.org/10.1145/3322276.3323689 event-place: San Diego, CA, USA.",
      "doi": "10.1145/3322276.3323689"
    }
  ]
}