{
  "doi": "10.1145/3544548.3581249",
  "title": "Hacking, Switching, Combining: Understanding and Supporting DIY Assistive Technology Design by Blind People",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Existing assistive technologies (AT) often fail to support the unique needs of blind and visually impaired (BVI) people. Thus, BVI people have become domain experts in customizing and ‘hacking’ AT, creatively suiting their needs. We aim to understand this behavior in depth, and how BVI people envision creating future DIY personalized AT. We conducted a multi-part qualitative study with 12 blind participants: an interview on unique uses of AT, a two-week diary study to log use cases, and a scenario-based design session to imagine creating future technologies. We found that participants work to design new AT both implicitly through creative use cases, and explicitly through regular ideation and development. Participants envisioned creating a variety of new technologies, and we summarize expected benefits and concerns of using a DIY technology approach. From our results, we present design considerations for future DIY technology systems to support existing customization and ‘hacking’ behaviors.",
  "authors": [
    {
      "name": "Jaylin Herskovitz",
      "institution": "Computer Science and Engineering, University of Michigan, United States",
      "img": "/do/10.1145/contrib-99659365819/rel-imgonly/me.jpeg",
      "acmid": "99659365819",
      "orcid": "0000-0002-9049-5056"
    },
    {
      "name": "Andi Xu",
      "institution": "Computer Science and Engineering, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779628",
      "orcid": "0000-0002-2739-5618"
    },
    {
      "name": "Rahaf Alharbi",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526942",
      "orcid": "0000-0003-4097-5331"
    },
    {
      "name": "Anhong Guo",
      "institution": "Computer Science and Engineering, University of Michigan, United States",
      "img": "/do/10.1145/contrib-99658635901/rel-imgonly/anhong_website.jpg",
      "acmid": "99658635901",
      "orcid": "0000-0002-4447-7818"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, William Easley, Michele Williams, Stacy Branham, and Amy Hurst. 2017. Embracing Errors: Examining How Context of Use Impacts Blind Individuals’ Acceptance of Navigation Aid Errors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 4158–4169. https://doi.org/10.1145/3025453.3025528",
      "doi": "10.1145/3025453.3025528"
    },
    {
      "text": "Dragan Ahmetovic, Cole Gleason, Chengxiong Ruan, Kris Kitani, Hironobu Takagi, and Chieko Asakawa. 2016. NavCog: A Navigational Cognitive Assistant for the Blind. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services(Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 90–99. https://doi.org/10.1145/2935334.2935361",
      "doi": "10.1145/2935334.2935361"
    },
    {
      "text": "Taslima Akter, Bryan Dosono, Tousif Ahmed, Apu Kapadia, and Bryan Semaan. 2020. “I am uncomfortable sharing what I can’t see”: Privacy Concerns of the Visually Impaired with Camera Based Assistive Applications. In 29th USENIX Security Symposium (USENIX Security 20). 1929–1948.",
      "doi": ""
    },
    {
      "text": "Khaled Albusays, Stephanie Ludi, and Matt Huenerfauth. 2017. Interviews and Observation of Blind Software Developers at Work to Understand Code Navigation Challenges. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 91–100. https://doi.org/10.1145/3132525.3132550",
      "doi": "10.1145/3132525.3132550"
    },
    {
      "text": "Apple. 2022. Create ML. https://developer.apple.com/machine-learning/create-ml/",
      "doi": ""
    },
    {
      "text": "Apple. 2022. Shortcuts User Guide. https://support.apple.com/guide/shortcuts/welcome/ios",
      "doi": ""
    },
    {
      "text": "Ameer Armaly, Paige Rodeghero, and Collin McMillan. 2017. A Comparison of Program Comprehension Strategies by Blind and Sighted Programmers. IEEE Transactions on Software Engineering(2017).",
      "doi": ""
    },
    {
      "text": "Mauro Avila, Katrin Wolf, Anke Brock, and Niels Henze. 2016. Remote Assistance for Blind Users in Daily Life: A Survey about Be My Eyes. In Proceedings of the 9th ACM International Conference on PErvasive Technologies Related to Assistive Environments. ACM, Corfu Island Greece, 1–2. https://doi.org/10.1145/2910674.2935839",
      "doi": "10.1145/2910674.2935839"
    },
    {
      "text": "Mauro Avila, Katrin Wolf, Anke Brock, and Niels Henze. 2016. Remote assistance for blind users in daily life: A survey about be my eyes. In Proceedings of the 9th ACM International Conference on PErvasive Technologies Related to Assistive Environments. 1–2.",
      "doi": "10.1145/2910674.2935839"
    },
    {
      "text": "Catherine M. Baker, Lauren R. Milne, and Richard E. Ladner. 2015. StructJumper: A Tool to Help Blind Programmers Navigate and Understand the Structure of Code. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 3043–3052. https://doi.org/10.1145/2702123.2702589",
      "doi": "10.1145/2702123.2702589"
    },
    {
      "text": "Catherine M Baker, Lauren R Milne, and Richard E Ladner. 2015. Structjumper: A Tool to Help Blind Programmers Navigate and Understand the Structure of Code.",
      "doi": "10.1145/2702123.2702589"
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence as a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, Galway Ireland, 161–173. https://doi.org/10.1145/3234695.3236348",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Cynthia L Bennett, Cole Gleason, Morgan Klaus Scheuerman, Jeffrey P Bigham, Anhong Guo, and Alexandra To. 2021. “It’s Complicated”: Negotiating Accessibility and (Mis) Representation in Image Descriptions of Race, Gender, and Disability. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445498"
    },
    {
      "text": "Cynthia L. Bennett, Daniela K. Rosner, and Alex S. Taylor. 2020. The Care Work of Access. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376568",
      "doi": "10.1145/3313831.3376568"
    },
    {
      "text": "Cynthia L. Bennett, Abigale Stangl, Alexa F. Siu, and Joshua A. Miele. 2019. Making Nonvisually: Lessons from the Field. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. ACM, Pittsburgh PA USA, 279–285. https://doi.org/10.1145/3308561.3355619",
      "doi": "10.1145/3308561.3355619"
    },
    {
      "text": "Michael S. Bernstein, Jaime Teevan, Susan Dumais, Daniel Liebling, and Eric Horvitz. 2012. Direct answers for search queries in the long tail. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Austin Texas USA, 237–246. https://doi.org/10.1145/2207676.2207710",
      "doi": "10.1145/2207676.2207710"
    },
    {
      "text": "Jeffrey P. Bigham, Jeremy T. Brudvik, and Bernie Zhang. 2010. Accessibility by demonstration: enabling end users to guide developers to web accessibility solutions. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility(ASSETS ’10). Association for Computing Machinery, New York, NY, USA, 35–42. https://doi.org/10.1145/1878803.1878812",
      "doi": "10.1145/1878803.1878812"
    },
    {
      "text": "Jeffrey P Bigham and Patrick Carrington. 2018. Learning from the front: People with disabilities as early adopters of AI. Proceedings of the 2018 HCIC Human-Computer Interaction Consortium (2018).",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Anna C. Cavender, Jeremy T. Brudvik, Jacob O. Wobbrock, and Richard E. Ladner. 2007. WebinSitu: a comparative analysis of blind and sighted browsing behavior. In Proceedings of the 9th international ACM SIGACCESS conference on Computers and accessibility(Assets ’07). Association for Computing Machinery, New York, NY, USA, 51–58. https://doi.org/10.1145/1296843.1296854",
      "doi": "10.1145/1296843.1296854"
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology(UIST ’10). Association for Computing Machinery, New York, NY, USA, 333–342. https://doi.org/10.1145/1866029.1866080",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Jeffrey P. Bigham and Richard E. Ladner. 2007. Accessmonkey: a collaborative scripting framework for web users and developers. In Proceedings of the 2007 international cross-disciplinary conference on Web accessibility (W4A)(W4A ’07). Association for Computing Machinery, New York, NY, USA, 25–34. https://doi.org/10.1145/1243441.1243452",
      "doi": "10.1145/1243441.1243452"
    },
    {
      "text": "Jeffrey P. Bigham, Richard E. Ladner, and Yevgen Borodin. 2011. The design of human-powered access technology. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility(ASSETS ’11). Association for Computing Machinery, New York, NY, USA, 3–10. https://doi.org/10.1145/2049536.2049540",
      "doi": "10.1145/2049536.2049540"
    },
    {
      "text": "Nilton Bila, Troy Ronda, Iqbal Mohomed, Khai N Truong, and Eyal De Lara. 2007. Pagetailor: reusable end-user customization for the mobile web. In Proceedings of the 5th international conference on Mobile systems, applications and services. 16–29.",
      "doi": "10.1145/1247660.1247666"
    },
    {
      "text": "Syed Masum Billah, Vikas Ashok, Donald E. Porter, and I.V. Ramakrishnan. 2017. Ubiquitous Accessibility for People with Visual Impairments: Are We There Yet?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 5862–5868. https://doi.org/10.1145/3025453.3025731",
      "doi": "10.1145/3025453.3025731"
    },
    {
      "text": "BlindSquare. 2022. BlindSquare. https://www.blindsquare.com/",
      "doi": ""
    },
    {
      "text": "Michael Bolin, Matthew Webber, Philip Rha, Tom Wilson, and Robert C. Miller. 2005. Automation and customization of rendered web pages. In Proceedings of the 18th annual ACM symposium on User interface software and technology(UIST ’05). Association for Computing Machinery, New York, NY, USA, 163–172. https://doi.org/10.1145/1095034.1095062",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P. Bigham. 2013. Visual challenges in the everyday lives of blind people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 2117–2126. https://doi.org/10.1145/2470654.2481291",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Danielle Bragg, Nicholas Huynh, and Richard E. Ladner. 2016. A Personalizable Mobile Sound Detector App Design for Deaf and Hard-of-Hearing Users. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’16). Association for Computing Machinery, New York, NY, USA, 3–13. https://doi.org/10.1145/2982142.2982171",
      "doi": "10.1145/2982142.2982171"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative Accessibility: How Blind and Sighted Companions Co-Create Accessible Home Spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 2373–2382. https://doi.org/10.1145/2702123.2702511",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern-based qualitative analytic approaches. Counselling and Psychotherapy Research 21, 1 (2021), 37–47.",
      "doi": ""
    },
    {
      "text": "Robin N. Brewer. 2018. Facilitating Discussion and Shared Meaning: Rethinking Co-Design Sessions with People with Vision Impairments. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare (New York, NY, USA) (PervasiveHealth ’18). Association for Computing Machinery, New York, NY, USA, 258–262. https://doi.org/10.1145/3240925.3240981",
      "doi": "10.1145/3240925.3240981"
    },
    {
      "text": "Erin Buehler, Stacy Branham, Abdullah Ali, Jeremy J. Chang, Megan Kelly Hofmann, Amy Hurst, and Shaun K. Kane. 2015. Sharing is Caring: Assistive Technology Designs on Thingiverse. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 525–534. https://doi.org/10.1145/2702123.2702525",
      "doi": "10.1145/2702123.2702525"
    },
    {
      "text": "Erin Buehler, Amy Hurst, and Megan Hofmann. 2014. Coming to grips: 3D printing for accessibility. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility(ASSETS ’14). Association for Computing Machinery, New York, NY, USA, 291–292. https://doi.org/10.1145/2661334.2661345",
      "doi": "10.1145/2661334.2661345"
    },
    {
      "text": "Michele A Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P Bigham, and Amy Hurst. 2012. Crowdsourcing subjective fashion advice using VizWiz: challenges and opportunities. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility. 135–142.",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Ann Chapman, Brian Kelly, Liddy Nevile, and Andy Heath. 2006. Personalization and accessibility: integration of library and web approaches. In Proceedings of the 15th international conference on World Wide Web(WWW ’06). Association for Computing Machinery, New York, NY, USA, 871–872. https://doi.org/10.1145/1135777.1135920",
      "doi": "10.1145/1135777.1135920"
    },
    {
      "text": "Google Cloud. 2022. AutoML. https://cloud.google.com/automl",
      "doi": ""
    },
    {
      "text": "Aira Tech Corp. 2022. Aira. https://aira.io/",
      "doi": ""
    },
    {
      "text": "Lynne Coventry, Graham Johnson, and Antonella De Angeli. 2002. Achieving accessibility through personalization. (Jan. 2002).",
      "doi": ""
    },
    {
      "text": "Dries De Roeck, Karin Slegers, Johan Criel, Marc Godon, Laurence Claeys, Katriina Kilpi, and An Jacobs. 2012. I would DiYSE for it! a manifesto for do-it-yourself internet-of-things creation. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design(NordiCHI ’12). Association for Computing Machinery, New York, NY, USA, 170–179. https://doi.org/10.1145/2399016.2399044",
      "doi": "10.1145/2399016.2399044"
    },
    {
      "text": "Disability Visibility Project 2015. Integrating the disability perspective: assistive technology, design, hackathons & makeathons. https://disabilityvisibilityproject.com/2015/08/05/integrating-the-disability-perspective-assistive-technology-design-hackathons-makeathons/",
      "doi": ""
    },
    {
      "text": "Be My Eyes. 2022. Be My Eyes. https://www.bemyeyes.com/",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger. 2015. Disability and Technology: A Critical Realist Perspective. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility(ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 89–96. https://doi.org/10.1145/2700648.2809851",
      "doi": "10.1145/2700648.2809851"
    },
    {
      "text": "Krzysztof Z. Gajos, Jacob O. Wobbrock, and Daniel S. Weld. 2007. Automatically generating user interfaces adapted to users’ motor and vision capabilities. In Proceedings of the 20th annual ACM symposium on User interface software and technology(UIST ’07). Association for Computing Machinery, New York, NY, USA, 231–240. https://doi.org/10.1145/1294211.1294253",
      "doi": "10.1145/1294211.1294253"
    },
    {
      "text": "Alejandra Garrido, Sergio Firmenich, Gustavo Rossi, Julián Grigera, Nuria Medina-Medina, and Ivana Harari. 2013. Personalized Web Accessibility using Client-Side Refactoring. IEEE Internet Computing 17 (July 2013), 58–66. https://doi.org/10.1109/MIC.2012.143",
      "doi": "10.1109/MIC.2012.143"
    },
    {
      "text": "Google. 2022. Lookout - Assisted Vision. https://play.google.com/store/apps/details?id=com.google.android.apps.accessibility.reveal",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Xiang ‘Anthony’ Chen, Haoran Qi, Samuel White, Suman Ghosh, Chieko Asakawa, and Jeffrey P Bigham. 2016. Vizlens: A robust and interactive screen reader for interfaces in the real world. In Proceedings of the 29th annual symposium on user interface software and technology. 651–664.",
      "doi": "10.1145/2984511.2984518"
    },
    {
      "text": "Anhong Guo, Ece Kamar, Jennifer Wortman Vaughan, Hanna Wallach, and Meredith Ringel Morris. 2020. Toward fairness in AI for people with disabilities: a research roadmap. ACM SIGACCESS Accessibility and Computing125 (2020), 1–1.",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang ‘Anthony’ Chen, Tom Yeh, Scott E. Hudson, Jennifer Mankoff, and Jeffrey P. Bigham. 2016. Facade: Auto-Generating Tactile Interfaces to Appliances. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility(Reno, Nevada, USA) (ASSETS ’16). Association for Computing Machinery, New York, NY, USA, 315–316. https://doi.org/10.1145/2982142.2982187",
      "doi": "10.1145/2982142.2982187"
    },
    {
      "text": "Foad Hamidi, Patrick Mbullo Owuor, Michaela Hynie, and Melanie Baljko. 2022. \"Knowledge Comes Through Participation\": Understanding Disability through the Lens of DIY Assistive Technology in Western Kenya. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1 (April 2022), 72:1–72:25. https://doi.org/10.1145/3512919",
      "doi": "10.1145/3512919"
    },
    {
      "text": "Foad Hamidi, Kellie Poneres, Aaron Massey, and Amy Hurst. 2018. Who Should Have Access to my Pointing Data? Privacy Tradeoffs of Adaptive Assistive Technologies. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 203–216. https://doi.org/10.1145/3234695.3239331",
      "doi": "10.1145/3234695.3239331"
    },
    {
      "text": "Megan Hofmann, Jeffrey Harris, Scott E. Hudson, and Jennifer Mankoff. 2016. Helping Hands: Requirements for a Prototyping Methodology for Upper-limb Prosthetics Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 1769–1780. https://doi.org/10.1145/2858036.2858340",
      "doi": "10.1145/2858036.2858340"
    },
    {
      "text": "Amber Horvath, Sachin Grover, Sihan Dong, Emily Zhou, Finn Voichick, Mary Beth Kery, Shwetha Shinju, Daye Nam, Mariann Nagy, and Brad Myers. 2019. The Long Tail: Understanding the Discoverability of API Functionality. In 2019 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 157–161. https://doi.org/10.1109/VLHCC.2019.8818681 ISSN: 1943-6106.",
      "doi": ""
    },
    {
      "text": "Amy Hurst and Shaun Kane. 2013. Making \"making\" accessible. In Proceedings of the 12th International Conference on Interaction Design and Children(IDC ’13). Association for Computing Machinery, New York, NY, USA, 635–638. https://doi.org/10.1145/2485760.2485883",
      "doi": "10.1145/2485760.2485883"
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering individuals with do-it-yourself assistive technology. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility(ASSETS ’11). Association for Computing Machinery, New York, NY, USA, 11–18. https://doi.org/10.1145/2049536.2049541",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Hernisa Kacorri, Kris M. Kitani, Jeffrey P. Bigham, and Chieko Asakawa. 2017. People with Visual Impairment Training Personal Object Recognizers: Feasibility and Challenges. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 5839–5849. https://doi.org/10.1145/3025453.3025899",
      "doi": "10.1145/3025453.3025899"
    },
    {
      "text": "Shaun K. Kane, Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. 2009. Freedom to roam: a study of mobile device adoption and accessibility for people with visual and motor disabilities. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility(Assets ’09). Association for Computing Machinery, New York, NY, USA, 115–122. https://doi.org/10.1145/1639642.1639663",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Shaun K. Kane, Varsha Koushik, and Annika Muehlbradt. 2018. Bonk: accessible programming for accessible audio games. In Proceedings of the 17th ACM Conference on Interaction Design and Children(IDC ’18). Association for Computing Machinery, New York, NY, USA, 132–142. https://doi.org/10.1145/3202185.3202754",
      "doi": "10.1145/3202185.3202754"
    },
    {
      "text": "Amy J. Ko, Robin Abraham, Laura Beckwith, Alan Blackwell, Margaret Burnett, Martin Erwig, Chris Scaffidi, Joseph Lawrance, Henry Lieberman, Brad Myers, Mary Beth Rosson, Gregg Rothermel, Mary Shaw, and Susan Wiedenbeck. 2011. The state of the art in end-user software engineering. Comput. Surveys 43, 3 (April 2011), 21:1–21:44. https://doi.org/10.1145/1922649.1922658",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the Expert Amateur: DIY Projects, Communities, and Cultures. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries(Reykjavik, Iceland) (NordiCHI ’10). Association for Computing Machinery, New York, NY, USA, 295–304. https://doi.org/10.1145/1868914.1868950",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Kyungjun Lee. 2020. Teachable Object Recognizers for the Blind: Using First-Person Vision. SIGACCESS Access. Comput.123, Article 3 (mar 2020), 1 pages. https://doi.org/10.1145/3386402.3386405",
      "doi": "10.1145/3386402.3386405"
    },
    {
      "text": "Kyungjun Lee, Jonggi Hong, Simone Pimento, Ebrima Jarjue, and Hernisa Kacorri. 2019. Revisiting blind photography in the context of teachable object recognizers. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 83–95.",
      "doi": "10.1145/3308561.3353799"
    },
    {
      "text": "Sooyeon Lee, Madison Reddie, Chun-Hua Tsai, Jordan Beck, Mary Beth Rosson, and John M. Carroll. 2020. The Emerging Professional Practice of Remote Sighted Assistance for People with Visual Impairments. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376591",
      "doi": "10.1145/3313831.3376591"
    },
    {
      "text": "Sooyeon Lee, Rui Yu, Jingyi Xie, Syed Masum Billah, and John M. Carroll. 2022. Opportunities for Human-AI Collaboration in Remote Sighted Assistance. In 27th International Conference on Intelligent User Interfaces(IUI ’22). Association for Computing Machinery, New York, NY, USA, 63–78. https://doi.org/10.1145/3490099.3511113",
      "doi": "10.1145/3490099.3511113"
    },
    {
      "text": "Helena Lindgren, Jayalakshmi Baskar, Esteban Guerrero, Juan Carlos Nieves, Ingeborg Nilsson, and Chunli Yan. 2016. Computer-Supported Assessment for Tailoring Assistive Technology. In Proceedings of the 6th International Conference on Digital Health Conference(DH ’16). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2896338.2896352",
      "doi": "10.1145/2896338.2896352"
    },
    {
      "text": "Google LLC. 2022. Google Assistant. https://play.google.com/store/apps/details?id=com.google.android.apps.googleassistant&hl=en_US&gl=US&pli=1",
      "doi": ""
    },
    {
      "text": "Janis Lena Meissner, John Vines, Janice McLaughlin, Thomas Nappey, Jekaterina Maksimova, and Peter Wright. 2017. Do-it-yourself empowerment as experienced by novice makers with disabilities. In Proceedings of the 2017 conference on designing interactive systems. 1053–1065.",
      "doi": "10.1145/3064663.3064674"
    },
    {
      "text": "Microsoft. 2021. Seeing AI. https://www.microsoft.com/en-us/ai/seeing-ai",
      "doi": ""
    },
    {
      "text": "Microsoft Research. 2021. Microsoft Soundscape – A map delivered in 3D sound. https://www.microsoft.com/en-us/research/product/soundscape/.",
      "doi": ""
    },
    {
      "text": "Lauren R. Milne and Richard E. Ladner. 2018. Blocks4All: Overcoming Accessibility Barriers to Blocks Programming for Children with Visual Impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173643",
      "doi": "10.1145/3173574.3173643"
    },
    {
      "text": "Kazunori Minatani. 2019. Smart Apps vs. Renovated Low-tech Devices with DIY Assistive Technology: A Case of a Banknote Identifier for Visually Impaired People. In Proceedings of the 5th EAI International Conference on Smart Objects and Technologies for Social Good(GoodTechs ’19). Association for Computing Machinery, New York, NY, USA, 96–101. https://doi.org/10.1145/3342428.3342673",
      "doi": "10.1145/3342428.3342673"
    },
    {
      "text": "Moovit. 2022. Moovit Inc.https://moovit.com/",
      "doi": ""
    },
    {
      "text": "Argyro Moraiti, Vero Vanden Abeele, Erwin Vanroye, and Luc Geurts. 2015. Empowering Occupational Therapists with a DIY-toolkit for Smart Soft Objects. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’15). Association for Computing Machinery, New York, NY, USA, 387–394. https://doi.org/10.1145/2677199.2680598",
      "doi": "10.1145/2677199.2680598"
    },
    {
      "text": "Aboubakar Mountapmbeme and Stephanie Ludi. 2020. Investigating Challenges Faced by Learners with Visual Impairments using Block-Based Programming/Hybrid Environments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’20). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3373625.3417998",
      "doi": "10.1145/3373625.3417998"
    },
    {
      "text": "Aboubakar Mountapmbeme and Stephanie Ludi. 2021. How Teachers of the Visually Impaired Compensate with the Absence of Accessible Block-Based Languages. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’21). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3441852.3471221",
      "doi": "10.1145/3441852.3471221"
    },
    {
      "text": "Brian J Nguyen, William S Chen, Allison J Chen, Andrew Utt, Emily Hill, Ryan Apgar, and Daniel L Chao. 2019. Large-scale assessment of needs in low vision individuals using the Aira assistive technology. Clinical Ophthalmology (Auckland, N.Z.) 13 (Sept. 2019), 1853–1868. https://doi.org/10.2147/OPTH.S215658",
      "doi": ""
    },
    {
      "text": "National Federation of the Blind. 2022. KNFB Reader (OneStep Reader). https://nfb.org/programs-services/knfb-reader",
      "doi": ""
    },
    {
      "text": "Johanna Okerlund and David Wilson. 2019. DIY Assistive Technology for Others: Considering Social Impacts and Opportunities to Leverage HCI Techniques. In Proceedings of FabLearn 2019(FL2019). Association for Computing Machinery, New York, NY, USA, 152–155. https://doi.org/10.1145/3311890.3311914",
      "doi": "10.1145/3311890.3311914"
    },
    {
      "text": "Maulishree Pandey, Sharvari Bondre, Sile O’Modhrain, and Steve Oney. 2022. Accessibility of UI Frameworks and Libraries for Programmers with Visual Impairments. (2022), 10.",
      "doi": ""
    },
    {
      "text": "Maulishree Pandey, Vaishnav Kameswaran, Hrishikesh V. Rao, Sile O’Modhrain, and Steve Oney. 2021. Understanding Accessibility and Collaboration in Programming for People with Visual Impairments. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1 (April 2021), 129:1–129:30. https://doi.org/10.1145/3449203",
      "doi": "10.1145/3449203"
    },
    {
      "text": "Joon Sung Park, Danielle Bragg, Ece Kamar, and Meredith Ringel Morris. 2021. Designing an Online Infrastructure for Collecting AI Data From People With Disabilities. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. ACM, Virtual Event Canada, 52–63. https://doi.org/10.1145/3442188.3445870",
      "doi": "10.1145/3442188.3445870"
    },
    {
      "text": "Venkatesh Potluri, Tadashi Grindeland, Jon E Froehlich, and Jennifer Mankoff. 2019. AI-Assisted UI Design for Blind and Low-Vision Creators.",
      "doi": ""
    },
    {
      "text": "Venkatesh Potluri, Liang He, Christine Chen, Jon E Froehlich, and Jennifer Mankoff. 2019. A Multi-Modal Approach for Blind and Visually Impaired Developers to Edit Webpage Designs. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 612–614.",
      "doi": "10.1145/3308561.3354626"
    },
    {
      "text": "Venkatesh Potluri, Priyan Vaithilingam, Suresh Iyengar, Y. Vidya, Manohar Swaminathan, and Gopal Srinivasa. 2018. CodeTalk: Improving Programming Environment Accessibility for Visually Impaired Developers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174192",
      "doi": "10.1145/3173574.3174192"
    },
    {
      "text": "Venkatesh Potluri, Priyan Vaithilingam, Suresh Iyengar, Y Vidya, Manohar Swaminathan, and Gopal Srinivasa. 2018. CodeTalk: Improving Programming Environment Accessibility for Visually Impaired Developers.",
      "doi": ""
    },
    {
      "text": "Alberto Monge Roffarello and Luigi De Russis. 2022. Understanding and Streamlining App Switching Experiences in Mobile Interaction. International Journal of Human-Computer Studies 158 (2022), 102735.",
      "doi": "10.1016/j.ijhcs.2021.102735"
    },
    {
      "text": "Emma Sadjo, Leah Findlater, and Abigale Stangl. 2021. Landscape Analysis of Commercial Visual Assistance Technologies. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, USA) (ASSETS ’21). Association for Computing Machinery, New York, NY, USA, Article 76, 4 pages. https://doi.org/10.1145/3441852.3476521",
      "doi": "10.1145/3441852.3476521"
    },
    {
      "text": "Daisuke Sato, Uran Oh, Kakuya Naito, Hironobu Takagi, Kris Kitani, and Chieko Asakawa. 2017. NavCog3: An Evaluation of a Smartphone-Based Blind Indoor Navigation Assistant with Semantic Features in a Large-Scale Environment. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 270–279. https://doi.org/10.1145/3132525.3132535",
      "doi": "10.1145/3132525.3132535"
    },
    {
      "text": "Ashrith Shetty, Ebrima Jarjue, and Huaishu Peng. 2020. Tangible web layout design for blind and visually impaired people: An initial investigation. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology. 37–39.",
      "doi": "10.1145/3379350.3416178"
    },
    {
      "text": "Robert M. Siegfried. 2006. Visual programming and the blind: the challenge and the opportunity. ACM SIGCSE Bulletin 38, 1 (March 2006), 275–278. https://doi.org/10.1145/1124706.1121427",
      "doi": "10.1145/1124706.1121427"
    },
    {
      "text": "David Sloan, Matthew Tylee Atkinson, Colin Machin, and Yunqiu Li. 2010. The potential of adaptive interfaces as an accessibility aid for older web users. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A)(W4A ’10). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/1805986.1806033",
      "doi": "10.1145/1805986.1806033"
    },
    {
      "text": "Abigale Stangl, Nitin Verma, Kenneth R. Fleischmann, Meredith Ringel Morris, and Danna Gurari. 2021. Going Beyond One-Size-Fits-All Image Descriptions to Satisfy the Information Wants of People Who are Blind or Have Low Vision. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3441852.3471233",
      "doi": "10.1145/3441852.3471233"
    },
    {
      "text": "Neil Stewart. 2021. Disability-first Dataset Creation: Lessons from Constructing a Dataset for Teachable Object Recognition with Blind and Low Vision Data Collectors. ASSETS (2021), 22.",
      "doi": ""
    },
    {
      "text": "Michele A. Williams, Amy Hurst, and Shaun K. Kane. 2013. \"Pray before you step out\": describing personal and situational blind navigation behaviors. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’13). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/2513383.2513449",
      "doi": "10.1145/2513383.2513449"
    },
    {
      "text": "Jeffrey Wong and Jason I. Hong. 2007. Making mashups with marmite: towards end-user programming for the web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). Association for Computing Machinery, New York, NY, USA, 1435–1444. https://doi.org/10.1145/1240624.1240842",
      "doi": "10.1145/1240624.1240842"
    }
  ]
}