{
  "doi": "10.1145/3544548.3581183",
  "title": "Social Support for Mobile Security: Comparing Close Connections and Community Volunteers in a Field Experiment",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "People regularly rely on social support from family, friends, and the public when mitigating security and privacy risks, even if mainstream technologies hardly support these interactions. In this paper, we evaluated Meerkat, a mobile application that allows users to receive support through screenshot capturing, marking, and messaging. In a field experiment (n = 65), we tested how Meerkat helps users face phishing attempts and examined it by receiving help from close social connections and community volunteers. Our findings show that while users could learn from both types of helpers, they were significantly more willing to rely on advice from close connections. We evaluate several criteria for successful support interactions, showing that learning is significantly correlated with specific properties of the support interaction, such as the length of the messages. We conclude the paper by discussing how our findings can be used to design community-based applications.",
  "tags": [
    "security",
    "mobile",
    "Social support",
    "phishing",
    "collective efficacy"
  ],
  "authors": [
    {
      "name": "Tamir Mendel",
      "institution": "Tandon School of Engineering, New York University, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130936",
      "orcid": "0000-0002-7127-0345"
    },
    {
      "name": "Eran Toch",
      "institution": "IWiT Lab, Tel Aviv University, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81341497538",
      "orcid": "0000-0001-6939-5870"
    }
  ],
  "references": [
    {
      "text": "Zaina Aljallad, Wentao Guo, Chhaya Chouhan, Christy Laperriere, Jess Kropczynski, Pamela Wisnewski, and Heather Lipford. 2019. Designing a Mobile Application to Support Social Processes for Privacy Decisions. February: 1–12. https://doi.org/10.14722/usec.2019.23016",
      "doi": ""
    },
    {
      "text": "A Bandura. 1982. Self-efficacy mechanism in human agency. Amer Psych 37, 2: 122–147.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1977. Self-efficacy: Toward a unifying theory of behavioral change. Psychological Review 84, 191–215. https://doi.org/10.1037/0033-295X.84.2.191",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1997. Self-efficacy: The Exercise of Control.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2000. Exercise of Human Agency Through Collective Efficacy. 75–78.",
      "doi": ""
    },
    {
      "text": "Abdul Basit, Maham Zafar, Xuan Liu, Abdul Rehman Javed, Zunera Jalil, and Kashif Kifayat. 2021. A comprehensive survey of AI-enabled phishing attacks detection techniques. Telecommunication Systems 76, 1: 139–154. https://doi.org/10.1007/s11235-020-00733-2",
      "doi": "10.1007/s11235-020-00733-2"
    },
    {
      "text": "Annie T. Chen, Shaoqing Ge, Susie Cho, Andrew K. Teng, Frances Chu, George Demiris, and Oleg Zaslavsky. 2021. Reactions to COVID-19, information and technology use, and social connectedness among older adults with pre-frailty and frailty. Geriatric Nursing 42, 1: 188–195. https://doi.org/10.1016/j.gerinurse.2020.08.001",
      "doi": ""
    },
    {
      "text": "Chhaya Chouhan, Christy M. Laperriere, Zaina Aljallad, Jess Kropczynski, Heather Lipford, and Pamela J. Wisniewski. 2019. Co-designing for community oversight: Helping people make privacy and security decisions together. Proceedings of the ACM on Human-Computer Interaction 3, CSCW. https://doi.org/10.1145/3359248",
      "doi": "10.1145/3359248"
    },
    {
      "text": "Doron Cohen, Or Naim, Eran Toch, and Irad Ben-Gal. 2021. Website categorization via design attribute learning. Computers and Security 107: 102312. https://doi.org/10.1016/j.cose.2021.102312",
      "doi": ""
    },
    {
      "text": "David Constant, Lee Sproull, and Sara Kiesler. 1996. The Kindness of Strangers: The Usefulness of Electronic Weak Ties for Technical Advice. Organization Science 7, 2: 119–135. https://doi.org/10.1287/orsc.7.2.119",
      "doi": "10.1287/orsc.7.2.119"
    },
    {
      "text": "Sauvik Das, Tiffany Hyun-Jin Kim, Laura A Dabbish, and Jason I Hong. 2014. The Effect of Social Influence on Security Sensitivity. SOUPS ’14: Proceedings of the Tenth Symposium On Usable Privacy and Security: 143–157. https://doi.org/10.1145/2660267.2660271",
      "doi": "10.1145/2660267.2660271"
    },
    {
      "text": "Giuseppe Desolda, Lauren S. Ferro, Andrea Marrella, Tiziana Catarci, and Maria Francesca Costabile. 2022. Human Factors in Phishing Attacks: A Systematic Literature Review. ACM Computing Surveys 54, 8. https://doi.org/10.1145/3469886",
      "doi": "10.1145/3469886"
    },
    {
      "text": "Rodrigo Mariano Díaz. 2020. Cybersecurity in the time of COVID-19 and the transition to cyberimmunity. Facilitation of Tansport and Trade in Latin America and the Caribbeanand, 6: 17. Retrieved from https://www.cfr.org/blog/cybersecurity-time-covid-19",
      "doi": ""
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015. Scaling the security wall: Developing a security behavior intentions scale (SeBIS). Conference on Human Factors in Computing Systems - Proceedings 2015-April: 2873–2882. https://doi.org/10.1145/2702123.2702249",
      "doi": "10.1145/2702123.2702249"
    },
    {
      "text": "Eszter Hargittai. 2005. Survey measures of web-oriented digital literacy. Social Science Computer Review 23, 3: 371–379. https://doi.org/10.1177/0894439305275911",
      "doi": "10.1177/0894439305275911"
    },
    {
      "text": "Eszter Hargittai and Yuli Patrick Hsieh. 2012. Succinct Survey Measures of Web-Use Skills. Social Science Computer Review 30, 1: 95–107. https://doi.org/10.1177/0894439310397146",
      "doi": "10.1177/0894439310397146"
    },
    {
      "text": "Brian Hilligoss and Soo Young Rieh. 2008. Developing a unifying framework of credibility assessment: Construct, heuristics, and interaction in context. Information Processing and Management 44, 4: 1467–1484. https://doi.org/10.1016/j.ipm.2007.10.001",
      "doi": "10.1016/j.ipm.2007.10.001"
    },
    {
      "text": "Amanda Hunsaker, Minh Hao Nguyen, Jaelle Fuchs, Gökçe Karaoglu, Teodora Djukaric, and Eszter Hargittai. 2020. Unsung helpers: older adults as a source of digital media support for their peers. Communication Review 23, 4: 309–330. https://doi.org/10.1080/10714421.2020.1829307",
      "doi": ""
    },
    {
      "text": "Ankit Kumar Jain and B. B. Gupta. 2022. A survey of phishing attack techniques, defence mechanisms and open research challenges. Enterprise Information Systems 16, 527–565. https://doi.org/10.1080/17517575.2021.1896786",
      "doi": ""
    },
    {
      "text": "Jess Kropczynski, Zaina Aljallad, Nathan Jeffrey Elrod, Heather Lipford, and Pamela J Wisniewski. 2021. Towards Building Community Collective Efficacy for Managing Digital Privacy and Security within Older Adult Communities. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3: 1–27. https://doi.org/10.1145/3432954",
      "doi": "10.1145/3432954"
    },
    {
      "text": "Jess Kropczynski, Reza Ghaiumy Anaraky, Mamtaj Akter, Amy J. Godfrey, Heather Lipford, and Pamela J. Wisniewski. 2021. Examining Collaborative Support for Privacy and Security in the Broader Context of Tech Caregiving. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2: 1–23. https://doi.org/10.1145/3479540",
      "doi": "10.1145/3479540"
    },
    {
      "text": "Celine Latulipe, Ronnie Dsouza, and Murray Cumbers. 2022. Unofficial Proxies: How Close Others Help Older Adults with Banking. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3491102.3501845",
      "doi": "10.1145/3491102.3501845"
    },
    {
      "text": "Chaiwoo Lee and Joseph F. Coughlin. 2015. PERSPECTIVE: Older Adults’ Adoption of Technology: An Integrated Approach to Identifying Determinants and Barriers. Journal of Product Innovation Management 32, 5: 747–759. https://doi.org/10.1111/jpim.12176",
      "doi": ""
    },
    {
      "text": "Steven McElwee, George Murphy, and Paul Shelton. 2018. Influencing Outcomes and Behaviors in Simulated Phishing Exercises. Conference Proceedings - IEEE SOUTHEASTCON 2018-April. https://doi.org/10.1109/SECON.2018.8479109",
      "doi": ""
    },
    {
      "text": "Tamir Mendel. 2019. Social help: developing methods to support older adults in mobile privacy and security. In Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers, 383–387. https://doi.org/10.1145/3341162.3349311",
      "doi": "10.1145/3341162.3349311"
    },
    {
      "text": "Tamir Mendel, Debin Gao, David Lo, and Eran Toch. 2021. An Exploratory Study of Social Support Systems to Help Older Adults in Managing Mobile Safety. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction, 1–13. https://doi.org/10.1145/3447526.3472047",
      "doi": "10.1145/3447526.3472047"
    },
    {
      "text": "Tamir Mendel, Roei Schuster, Eran Tromer, and Eran Toch. 2022. Toward Proactive Support for Older Adults: Predicting the Right Moment for Providing Mobile Safety Help. ACM Interact. Mob. Wearable Ubiquitous Technol 6, 1: 25. https://doi.org/doi.org/10.1145/35172491",
      "doi": ""
    },
    {
      "text": "Tamir Mendel and Eran Toch. 2017. Susceptibility to social influence of privacy behaviors: Peer versus authoritative sources. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, 581–593. https://doi.org/10.1145/2998181.2998323",
      "doi": "10.1145/2998181.2998323"
    },
    {
      "text": "Tamir Mendel and Eran Toch. 2019. My Mom was Getting this Popup: Understanding Motivations and Processes in Helping Older Relatives with Mobile Security and Privacy. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 4: 1–20. https://doi.org/10.1145/3369821",
      "doi": "10.1145/3369821"
    },
    {
      "text": "Tamir Mendel and Eran Toch. 2022. Meerkat: A Social Community Support Application for Older Adults. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3491101.3519909",
      "doi": "10.1145/3491101.3519909"
    },
    {
      "text": "Savanthi Murthy, Karthik S Bhat, Sauvik Das, and Neha Kumar. 2021. Individually Vulnerable, Collectively Safe: The Security and Privacy Practices of Households with Older Adults. 5, April: 1–24. Retrieved from https://doi.org/10.1145/3449212",
      "doi": "10.1145/3449212"
    },
    {
      "text": "Subigya Nepal, Weichen Wang, Vlado Vojdanovski, Jeremy F. Huckins, Alex Dasilva, Meghan Meyer, and Andrew Campbell. 2022. COVID Student Study: A Year in the Life of College Students during the COVID-19 Pandemic Through the Lens of Mobile Phone Sensing. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3491102.3502043",
      "doi": "10.1145/3491102.3502043"
    },
    {
      "text": "Novia Nurain, Chia Fang Chung, Clara Caldeira, and Kay Connelly. 2021. Hugging with a Shower Curtain: Older Adults’ Social Support Realities during the COVID-19 Pandemic. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2. https://doi.org/10.1145/3479607",
      "doi": "10.1145/3479607"
    },
    {
      "text": "Daniela Oliveira, Harold Rocha, Huizi Yang, Donovan Ellis, Sandeep Dommaraju, Melis Muradoglu, Devon Weir, Adam Soliman, Tian Lin, and Natalie Ebner. 2017. Dissecting spear phishing emails for older vs young adults: On the interplay of weapons of influence and life domains in predicting susceptibility to phishing. Conference on Human Factors in Computing Systems - Proceedings 2017-May: 6412–6424. https://doi.org/10.1145/3025453.3025831",
      "doi": "10.1145/3025453.3025831"
    },
    {
      "text": "Kane Pepi. 2015. Text Marketing Vs. Email Marketing: Which One Packs a Bigger Punch? business2community.",
      "doi": ""
    },
    {
      "text": "Erika Shehan Poole, Marshini Chetty, Tom Morgan, Rebecca E. Grinter, and W. Keith Edwards. 2009. Computer help at home: Methods and motivations for informal technical support. In Conference on Human Factors in Computing Systems - Proceedings, 739–748. https://doi.org/10.1145/1518701.1518816",
      "doi": "10.1145/1518701.1518816"
    },
    {
      "text": "Elissa M Redmiles, Sean Kross, and Michelle L Mazurek. 2016. How I learned to be secure: A census-representative survey of security advice sources and behavior. In Proceedings of the ACM Conference on Computer and Communications Security, 666–677. https://doi.org/10.1145/2976749.2978307",
      "doi": "10.1145/2976749.2978307"
    },
    {
      "text": "Elissa M. Redmiles, Amelia R. Malone, and Michelle L. Mazurek. 2016. I Think They're Trying to Tell Me Something: Advice Sources and Selection for Digital Security. Proceedings - 2016 IEEE Symposium on Security and Privacy, SP 2016: 272–288. https://doi.org/10.1109/SP.2016.24",
      "doi": ""
    },
    {
      "text": "Borja Sañudo, Curtis Fennell, and Antonio J. Sánchez-Oliver. 2020. Objectively-assessed physical activity, sedentary behavior, smartphone use, and sleep patterns preand during-COVID-19 quarantine in young adults from Spain. Sustainability (Switzerland) 12, 15: 1–12. https://doi.org/10.3390/SU12155890",
      "doi": ""
    },
    {
      "text": "Steve Sheng, Bryant Magnien, Ponnurangam Kumaraguru, Alessandro Acquisti, Lorrie Faith Cranor, Jason Hong, and Elizabeth Nunge. 2007. Anti-Phishing Phil. 88. https://doi.org/10.1145/1280680.1280692",
      "doi": "10.1145/1280680.1280692"
    },
    {
      "text": "Donghoon Shin, Subeen Park, Esther Hehsun Kim, Soomin Kim, Jinwook Seo, and Hwajung Hong. 2022. Exploring the Effects of AI-assisted Emotional Support Processes in Online Mental Health Community. Association for Computing Machinery. https://doi.org/10.1145/3491101.3519854",
      "doi": "10.1145/3491101.3519854"
    },
    {
      "text": "Alison Simpson. 2022. SafeUp: How one app is helping women feel safe in London. We Are the City. Retrieved August 16, 2022 from https://wearethecity.com/safeup-how-one-app-is-helping-women-feel-safe-in-london/",
      "doi": ""
    },
    {
      "text": "H. Jeff Smith, Sandra J. Milberg, and Sandra J. Burke. 1996. Information Privacy: Measuring Individuals’ Concerns about Organizational Practices. MIS Quarterly 20, 2: 167. https://doi.org/10.2307/249477",
      "doi": "10.2307/249477"
    },
    {
      "text": "Katta Spiel, Oliver Haimson, and Danielle Lottridge. 2019. How to do better with gender on surveys: A guide for HCI researchers. Interactions 26, 4: 62–65. https://doi.org/10.1145/3338283",
      "doi": "10.1145/3338283"
    },
    {
      "text": "Shaoxiong Sun, Amos A. Folarin, Yatharth Ranjan, Zulqarnain Rashid, Pauline Conde, Callum Stewart, Nicholas Cummins, Faith Matcham, Gloria Dalla Costa, Sara Simblett, Letizia Leocani, Femke Lamers, Per Soelberg Sørensen, Mathias Buron, Ana Zabalza, Ana Isabel Guerrero Pérez, Brenda W.J.H. Penninx, Sara Siddi, Josep Maria Haro, Inez Myin-Germeys, Aki Rintala, Til Wykes, Vaibhav A. Narayan, Giancarlo Comi, Matthew Hotopf, and Richard J.B. Dobson. 2020. Using smartphones and wearable devices to monitor behavioral changes during COVID-19. Journal of Medical Internet Research 22, 9: 1–19. https://doi.org/10.2196/19992",
      "doi": ""
    },
    {
      "text": "Zhiyuan Wan, Lingfeng Bao, Debin Gao, Eran Toch, X I N Xia, Tamir Mendel, and David Lo. 2019. AppMoD: Helping Older Adults Manage Mobile Security with Online Social Help. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 4: 23. https://doi.org/https://doi.org/10.1145/3369819",
      "doi": "10.1145/3369819"
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Kevin Scott, Xiaoxuan Chen, Alessandro Acquisti, and Lorrie Faith Cranor. 2013. Privacy nudges for social media: An exploratory facebook study. WWW 2013 Companion - Proceedings of the 22nd International Conference on World Wide Web: 763–770.",
      "doi": "10.1145/2487788.2488038"
    },
    {
      "text": "Hue Watson, Eyitemi Moju-Igbene, Akanksha Kumari, and Sauvik Das. 2020. “We Hold Each Other Accountable”: Unpacking How Social Groups Approach Cybersecurity and Privacy Together. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–12. https://doi.org/10.1145/3313831.3376605",
      "doi": "10.1145/3313831.3376605"
    },
    {
      "text": "Zikai Alex Wen, Zhiqiu Lin, Rowena Chen, and Erik Andersen. 2019. What.Hack: Engaging Anti-Phishing Training through a Role-playing Phishing Simulation Game. Conference on Human Factors in Computing Systems - Proceedings: 1–12. https://doi.org/10.1145/3290605.3300338",
      "doi": "10.1145/3290605.3300338"
    },
    {
      "text": "Yuxi Wu, W. Keith Edwards, and Sauvik Das. 2022. SoK: Social Cybersecurity. Proceedings - IEEE Symposium on Security and Privacy 2022-May: 1863–1879. https://doi.org/10.1109/SP46214.2022.9833757",
      "doi": ""
    },
    {
      "text": "2020. Check Point Research: COVID-19 Pandemic Drives Criminal and Political Cyber-Attacks Across Networks, Cloud and Mobile in H1 2020. Check Point Software Technologies Ltd. Retrieved August 12, 2022 from https://www.checkpoint.com/press/2020/check-point-research-covid-19-pandemic-drives-criminal-and-political-cyber-attacks-across-networks-cloud-and-mobile-in-h1-2020/",
      "doi": ""
    }
  ]
}