{
  "doi": "10.1145/3544548.3581045",
  "title": "The Halting problem: Video analysis of self-driving cars in traffic",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Using publicly uploaded videos of the Waymo and Tesla FSD self-driving cars, this paper documents how self-driving vehicles still struggle with some basics of road interaction. To drive safely self-driving cars need to interact in traffic with other road users. Yet traffic is a complex, long established social domain. We focus on one core element of road interaction: when road users yield for each other. Yielding – such as by slowing down for others in traffic – involves communication between different road users to decide who will ‘go’ and who will ‘yield’. Videos of the Waymo and Tesla FSD self-driving cars show how these systems fail to both yield for others, as well as failing to go when yielded to. In discussion, we explore how these ‘problems’ illustrate both the complexity of designing for road interaction, but also how the space of physical machine/human social interactions more broadly can be designed for.",
  "authors": [
    {
      "name": "Barry Brown",
      "institution": "DSV, Stockholm University, Sweden and Human Centred Computing, Department of Computer Science, University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100013375",
      "orcid": "0000-0002-9710-6607"
    },
    {
      "name": "Mathias Broth",
      "institution": "Department for Culture and Communication, Linköping University, Sweden",
      "img": "/do/10.1145/contrib-81460656296/rel-imgonly/web-12.jpg",
      "acmid": "81460656296",
      "orcid": "0000-0003-4004-5361"
    },
    {
      "name": "Erik Vinkhuyzen",
      "institution": "Work, Interaction and Technology Research Group, King's College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100089470",
      "orcid": "0000-0001-6589-8630"
    }
  ],
  "references": [
    {
      "text": "Claudia Ackermann, Matthias Beggiato, Luka-Franziska Bluhm, and Josef Krems. 2018. Vehicle movement and its potential as implicit communication signal for pedestrians and automated vehicles. In Proceedings of the 6th Humanist Conference. 1–7.",
      "doi": ""
    },
    {
      "text": "Mark Bergen. 2015. Meet the Companies Building Self-Driving Cars for Google and Tesla (And Maybe Apple). http://www.recode.net/2015/10/27/11620026/meet-the-companies-building-self-driving-cars-for-google-and-tesla",
      "doi": ""
    },
    {
      "text": "Neal E. Boudette. 2022. Tesla Recalls Cars With Full Self-Driving to Prevent Rolling Stops. The New York Times (Feb. 2022). https://www.nytimes.com/2022/02/01/business/tesla-recall.html",
      "doi": ""
    },
    {
      "text": "Mathias Broth, Jakob Cromdal, and Lena Levin. 2018. Showing where you’re going. Instructing the accountable use of the indicator in live traffic. International Journal of Applied Linguistics 28, 2(2018), 248–264.",
      "doi": ""
    },
    {
      "text": "Barry Brown and Eric Laurier. 2012. The normal natural troubles of driving with GPS. ACM, 1621–1630.",
      "doi": ""
    },
    {
      "text": "Barry Brown and Eric Laurier. 2017. The trouble with autopilots: Assisted and autonomous driving on the social road. In Proceedings of the 2017 CHI conference on human factors in computing systems. ACM Press, 416–429.",
      "doi": "10.1145/3025453.3025462"
    },
    {
      "text": "Barry Brown, Eric Laurier, and Erik Vinkhuyzen. 2023. Designing motion: Lessons for self-driving and robotic motion from human traffic interaction. Proceedings of the ACM on Human-Computer Interaction 7, GROUP(2023), 1–21. Publisher: ACM New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Moira McGregor, and Eric Laurier. 2013. iPhone in vivo: video analysis of mobile device use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1031–1040.",
      "doi": "10.1145/2470654.2466132"
    },
    {
      "text": "Cesar Cadena, Luca Carlone, Henry Carrillo, Yasir Latif, Davide Scaramuzza, Jose Neira, Ian D. Reid, and John J. Leonard. 2016. Past, Present, and Future of Simultaneous Localization And Mapping: Towards the Robust-Perception Age. IEEE Transactions on robotics 32, 6 (June 2016), 1309–1332. https://arxiv.org/abs/1606.05830v2",
      "doi": "10.1109/TRO.2016.2624754"
    },
    {
      "text": "Chia-Ming Chang, Koki Toda, Xinyue Gui, Stela H. Seo, and Takeo Igarashi. 2022. Can Eyes on a Car Reduce Traffic Accidents?. In Proceedings of the 14th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’22). Association for Computing Machinery, New York, NY, USA, 349–359. https://doi.org/10.1145/3543174.3546841",
      "doi": "10.1145/3543174.3546841"
    },
    {
      "text": "Mark Colley and Rukzio Rukzio. 2020. A Design Space for External Communication of Autonomous Vehicles. In Proceedings of the 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI’20). ACM Press, 212–222. https://doi.org/10.1145/3409120.3410646",
      "doi": "10.1145/3409120.3410646"
    },
    {
      "text": "Johnna Crider. 2022. Tesla began rolling out FSD Beta 10.69; solved Chuck’s Unprotected Left Turn. https://www.teslarati.com/tesla-fsd-beta-10-69-chucks-left-turn/",
      "doi": ""
    },
    {
      "text": "Elwys De Stefani. 2018. Formulating direction: Navigational instructions in driving lessons. International Journal of Applied Linguistics 28, 2(2018), 283–303.",
      "doi": ""
    },
    {
      "text": "Elwys De Stefani and Anne-Danièle Gazin. 2018. Learning to communicate: Managing multiple strands of participation in driving lessons. Language & Communication(2018).",
      "doi": ""
    },
    {
      "text": "Arnulf Deppermann. 2018. Instruction practices in German driving lessons: Differential uses of declaratives and imperatives. International Journal of Applied Linguistics 28, 2(2018), 265–282.",
      "doi": ""
    },
    {
      "text": "Arnulf Deppermann, Lorenza Mondada, and Simona Pekarek Doehler. 2021. Early Responses: An Introduction. Discourse Processes 58, 4 (April 2021), 293–307. https://doi.org/10.1080/0163853X.2021.1877516 Publisher: Routledge _eprint: https://doi.org/10.1080/0163853X.2021.1877516.",
      "doi": ""
    },
    {
      "text": "Ian Dersley and Anthony Wootton. 2000. Complaint sequences within antagonistic argument. Research on Language and Social Interaction 33, 4 (2000), 375–406.",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Azra Habibovic, Melanie Berger, Devanshi Bansal, Raymond H. Cuijpers, and Marieke Martens. 2022. Investigating the Need for Explicit Communication of Non-Yielding Intent through a Slow-Pulsing Light Band (SPLB) eHMI in AV-Pedestrian Interaction. In Proceedings of the 14th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’22). Association for Computing Machinery, New York, NY, USA, 307–318. https://doi.org/10.1145/3543174.3546086",
      "doi": "10.1145/3543174.3546086"
    },
    {
      "text": "Debargha Dey and Jacques Terken. 2017. Pedestrian interaction with vehicles: roles of explicit and implicit communication. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 109–113.",
      "doi": "10.1145/3122986.3123009"
    },
    {
      "text": "Kevin Drum. 2015. Was the California Stop really invented in California?Mother Jones (2015). https://www.motherjones.com/kevin-drum/2015/10/was-california-stop-really-invented-california/",
      "doi": ""
    },
    {
      "text": "The Economist. 2019. Driverless cars are stuck in a jam. The Economist (2019). https://www.economist.com/leaders/2019/10/12/driverless-cars-are-stuck-in-a-jam",
      "doi": ""
    },
    {
      "text": "Amir Efrati, Profile archive →, , and Follow Amir on Twitter. 2018. Waymo’s Big Ambitions Slowed by Tech Trouble. https://www.theinformation.com/articles/waymos-big-ambitions-slowed-by-tech-trouble",
      "doi": ""
    },
    {
      "text": "Jennifer Elias. 2022. Taking a driverless Waymo in Phoenix over the holidays was fun but unsettling. https://www.cnbc.com/2022/01/08/heres-what-it-was-like-to-ride-in-a-waymo-with-no-driver-in-phoenix.html",
      "doi": ""
    },
    {
      "text": "Hadas Erel, Tzachi Shem Tov, Yoav Kessler, and Oren Zuckerman. 2019. Robots are Always Social: Robotic Movements are Automatically Interpreted as Social Cues. In Extended abstracts of the 2019 CHI conference on human factors in computing systems. 1–6.",
      "doi": ""
    },
    {
      "text": "Stefanie M. Faas, Andrea C. Kao, and Martin Baumann. 2020. A longitudinal video study on communicating status and intent for self-driving vehicle–pedestrian interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376484"
    },
    {
      "text": "Grace de la Flor, Paul Luff, Marina Jirotka, John Pybus, Ruth Kirkham, and Annamaria Carusi. 2010. The Case of the Disappearing Ox: Seeing Through Digital Images to an Analysis of Ancient Texts. ACM, 1753397, 473–482. https://doi.org/10.1145/1753326.1753397",
      "doi": "10.1145/1753326.1753397"
    },
    {
      "text": "Andrew Gambino and S. Shyam Sundar. 2019. Acceptance of Self-Driving Cars: Does Their Posthuman Ability Make Them More Eerie or More Desirable?. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312870",
      "doi": "10.1145/3290607.3312870"
    },
    {
      "text": "Harold Garfinkel. 1967. Studies in Ethnomethodology. Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Azra Habibovic, Victor Malmsten Lundgren, Jonas Andersson, Maria Klingegård, Tobias Lagström, Anna Sirkka, Johan Fagerlönn, Claes Edgren, Rikard Fredriksson, Stas Krupenia, Dennis Saluäär, and Pontus Larsson. 2018. Communicating Intent of Automated Vehicles to Pedestrians. Frontiers in Psychology 9 (Aug. 2018). https://doi.org/10.3389/fpsyg.2018.01336",
      "doi": ""
    },
    {
      "text": "Pentti Haddington. 2012. Movement in action: Initiating social navigation in cars. Semiotica 2012, 191 (Jan. 2012), 137–167. https://doi.org/10.1515/sem-2012-0059",
      "doi": ""
    },
    {
      "text": "Pentti Haddington and Mirka Rauniomaa. 2014. Interaction between road users: offering space in traffic. Space and culture 17, 2 (2014), 176–190.",
      "doi": ""
    },
    {
      "text": "Dave Harley and Geraldine Fitzpatrick. 2009. YouTube and intergenerational communication: the case of Geriatric1927. Universal Access in the Information Society 8, 1 (April 2009), 5–20. https://doi.org/10.1007/s10209-008-0127-y",
      "doi": "10.1007/s10209-008-0127-y"
    },
    {
      "text": "Christian Heath, Jon Hindmarsh, and Paul Luff. 2010. Video in qualitative research: analysing social interaction in everyday life. Sage, London.",
      "doi": ""
    },
    {
      "text": "Christian Heath and Paul Luff. 2000. Technology in action. Cambridge university press.",
      "doi": "10.5555/556346"
    },
    {
      "text": "Nicholas J. Hetherington, Ryan Lee, Marlene Haase, Elizabeth A. Croft, and HF Machiel Van der Loos. 2021. Mobile Robot Yielding Cues for Human-Robot Spatial Interaction. In 2021 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, 3028–3033.",
      "doi": ""
    },
    {
      "text": "Juan Pablo Hourcade, Sarah L. Mascher, David Wu, and Luiza Pantoja. 2015. Look, My Baby Is Using an iPad! An Analysis of YouTube Videos of Infants and Toddlers Using Tablets. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 1915–1924. https://doi.org/10.1145/2702123.2702266",
      "doi": "10.1145/2702123.2702266"
    },
    {
      "text": "N. Jones and G. Raymond. 2012. \"The Camera Rolls\": Using Third-Party Video in Field Research. The ANNALS of the American Academy of Political and Social Science 642, 1 (July 2012), 109–123. https://doi.org/10.1177/0002716212438205",
      "doi": ""
    },
    {
      "text": "Wendy Ju. 2015. The design of implicit interactions. Vol. 8. Morgan & Claypool Publishers. http://www.morganclaypool.com/doi/abs/10.2200/S00619ED1V01Y201412HCI028",
      "doi": ""
    },
    {
      "text": "Hermann Kaindl, Jürgen Falb, and Cristian Bogdan. 2008. Multimodal communication involving movements of a robot. In CHI’08 Extended Abstracts on Human Factors in Computing Systems. ACM, 3213–3218.",
      "doi": ""
    },
    {
      "text": "Young Woo Kim, Jae Hyun Han, Yong Gu Ji, and Seul Chan Lee. 2020. Exploring the Effectiveness of External Human-Machine Interfaces on Pedestrians and Drivers. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 65–68.",
      "doi": ""
    },
    {
      "text": "Xiaoqiang Kong, Subasish Das, Yunlong Zhang, and Xiao Xiao. 2021. Lessons learned from pedestrian-driver communication and yielding patterns. Transportation research part F: traffic psychology and behaviour 79 (2021), 35–48. Publisher: Elsevier.",
      "doi": ""
    },
    {
      "text": "Eric Laurier. 2014. The Graphic Transcript: Poaching Comic Book Grammar for Inscribing the Visual, Spatial and Temporal Aspects of Action. Geography Compass 8, 4 (2014), 235–248. https://doi.org/10.1111/gec3.12123 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/gec3.12123.",
      "doi": ""
    },
    {
      "text": "Eric Laurier, Barry Brown, and Lorimer Hayden. 2012. What it means to change lanes: Actions, emotions and wayfinding in the family car. Semiotica 2012, 191 (Jan. 2012). https://doi.org/10.1515/sem-2012-0058",
      "doi": ""
    },
    {
      "text": "Eric Laurier and Hayden Lorimer. 2009. Other ways: landscapes of commuting. Landscape Research 37, 2 (2009), 207–224.",
      "doi": ""
    },
    {
      "text": "Eric Laurier, Hayden Lorimer, Barry Brown, Owain Jones, Oskar Juhlin, Allyson Noble, Mark Perry, Daniele Pica, Philippe Sormani, Ignaz Strebel, and others. 2008. Driving and ‘passengering’: Notes on the ordinary organization of car travel. Mobilities 3, 1 (2008), 1–23. http://www.tandfonline.com/doi/abs/10.1080/17450100701797273",
      "doi": ""
    },
    {
      "text": "Yee Mun Lee, Ruth Madigan, and Jorge Garcia. 2019. Understanding the Messages Conveyed by Automated Vehicles. In Proceedings of AutoUI 2019. 134–143. https://doi.org/10.1145/3342197.3344546",
      "doi": "10.1145/3342197.3344546"
    },
    {
      "text": "Gene Lerner and Celia Kitzinger. 2007. Extraction and aggregation in the repair of individual and collective self reference. Discourse Studies 9, 4 (2007), 526–557.",
      "doi": ""
    },
    {
      "text": "Stephanie Lowry, Niko Sunderhauf, Paul Newman, John J. Leonard, David Cox, Peter Corke, and Michael J. Milford. 2016. Visual Place Recognition: A Survey. IEEE Transactions on Robotics 32, 1 (Feb. 2016), 1–19. https://doi.org/10.1109/TRO.2015.2496823",
      "doi": "10.1109/TRO.2015.2496823"
    },
    {
      "text": "Karthik Mahadevan, Sowmya Somanath, and Ehud Sharlin. 2018. Communicating Awareness and Intent in Autonomous Vehicle-Pedestrian Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 429:1–429:12. https://doi.org/10.1145/3173574.3174003 event-place: Montreal QC, Canada.",
      "doi": "10.1145/3173574.3174003"
    },
    {
      "text": "G. Markkula, R. Madigan, D. Nathanael, E. Portouli, Y. M. Lee, A. Dietrich, J. Billington, A. Schieben, and N. Merat. 2020. Defining interactions: a conceptual framework for understanding interactive behaviour in human and automated road traffic. Theoretical Issues in Ergonomics Science 21, 6 (Nov. 2020), 728–752. https://doi.org/10.1080/1463922X.2020.1736686 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/1463922X.2020.1736686.",
      "doi": ""
    },
    {
      "text": "Markus Maurer, J. Christian Gerdes, Barbara Lenz, and Hermann Winner. 2016. Autonomous driving: technical, legal and social aspects. Springer. http://dl.acm.org/citation.cfm?id=2965082",
      "doi": ""
    },
    {
      "text": "Patrick McGee. 2021. Rolling out driverless cars is ‘extraordinary grind’, says Waymo boss. Financial Times (Jan. 2021).",
      "doi": ""
    },
    {
      "text": "Paul McIlvenny, Mathias Broth, and Pentti Haddington. 2014. Moving together: Mobile formations in interaction. Space and Culture 17, 2 (2014), 104–106.",
      "doi": ""
    },
    {
      "text": "Natasha Merat, Yee Mun Lee, Gustav Markkula, Jim Uttley, Fanta Camara, Charles Fox, André Dietrich, Florian Weber, and Anna Schieben. 2019. How Do We Study Pedestrian Interaction with Automated Vehicles? Preliminary Findings from the European interACT Project. In Road Vehicle Automation 6(Lecture Notes in Mobility), Gereon Meyer and Sven Beiker (Eds.). Springer International Publishing, 21–33.",
      "doi": ""
    },
    {
      "text": "Sara Merlino and Lorenza Mondada. 2018. Crossing the street: How pedestrians interact with cars. Language & Communication 65 (2018), 131–147.",
      "doi": ""
    },
    {
      "text": "Cade Metz. 2021. The Costly Pursuit of Self-Driving Cars Continues On. And On. And On.The New York Times (May 2021). https://www.nytimes.com/2021/05/24/technology/self-driving-cars-wait.html",
      "doi": ""
    },
    {
      "text": "Cade Metz. 2021. Tesla Sells ‘Full Self-Driving,’ but What Is It Really?The New York Times (Aug. 2021). https://www.nytimes.com/2021/08/20/technology/tesla-full-self-driving-fsd.html",
      "doi": ""
    },
    {
      "text": "Lorenza Mondada. 2009. Emergent focused interactions in public places: A systematic analysis of the multimodal achievement of a common interactional space. Journal of pragmatics 41, 10 (2009), 1977–1997. Publisher: Elsevier.",
      "doi": ""
    },
    {
      "text": "Lorenza Mondada. 2018. Driving instruction at high speed on a race circuit: Issues in action formation and sequence organization. International Journal of Applied Linguistics 28, 2(2018), 304–325.",
      "doi": ""
    },
    {
      "text": "Lorenza Mondada. 2018. Multiple Temporalities of Language and Body in Interaction: Challenges for Transcribing Multimodality. Research on Language and Social Interaction 51, 1 (Jan. 2018), 85–106. https://doi.org/10.1080/08351813.2018.1413878 Publisher: Routledge _eprint: https://doi.org/10.1080/08351813.2018.1413878.",
      "doi": ""
    },
    {
      "text": "Lorenza Mondada. 2021. How Early can Embodied Responses be? Issues in Time and Sequentiality. Discourse Processes 58, 4 (April 2021), 397–418. https://doi.org/10.1080/0163853X.2020.1871561 Publisher: Routledge _eprint: https://doi.org/10.1080/0163853X.2020.1871561.",
      "doi": ""
    },
    {
      "text": "Lars Müller, Malte Risto, and Colleen Emmenegger. 2016. The Social Behavior of Autonomous Vehicles. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct(UbiComp ’16). ACM, New York, NY, USA, 686–689. https://doi.org/10.1145/2968219.2968561 event-place: Heidelberg, Germany.",
      "doi": "10.1145/2968219.2968561"
    },
    {
      "text": "Amir Rasouli and John K. Tsotsos. 2019. Autonomous vehicles that interact with pedestrians: A survey of theory and practice. IEEE Transactions on Intelligent Transportation Systems 21, 3(2019), 900–918.",
      "doi": ""
    },
    {
      "text": "Jakob Reinhardt, Lorenz Prasch, and Klaus Bengler. 2021. Back-off: Evaluation of Robot Motion Strategies to Facilitate Human-Robot Spatial Interaction. ACM Transactions on Human-Robot Interaction (THRI) 10, 3 (2021), 1–25. Publisher: ACM New York, NY, USA.",
      "doi": "10.1145/3418303"
    },
    {
      "text": "Lindsay Reynolds, Samantha Gillette, Jason Marder, Zachary Miles, Pavel Vodenski, Ariella Weintraub, Jeremy Birnholtz, and Jeff Hancock. 2011. Contact stratification and deception: blackberry messenger versus SMS use among students. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 221–224. http://dl.acm.org/citation.cfm?id=1958857",
      "doi": "10.1145/1958824.1958857"
    },
    {
      "text": "Malte Risto, Colleen Emmenegger, Erik Vinkhuyzen, Melissa Cefkin, and Jim Hollan. 2017. Human-Vehicle Interfaces: The Power of Vehicle Movement Gestures in Human Road User Coordination. In Driving Assesment Conference, Vol. 9. University of Iowa. tex.ids: risto_human-vehicle_2017.",
      "doi": ""
    },
    {
      "text": "A. Lincoln Ryave and James N. Schenkein. 1974. Notes on the art of walking. In Ethnomethodology, R. Turner (Ed.). Penguin, Harmondsworth, 265–74.",
      "doi": ""
    },
    {
      "text": "Emanuel A. Schegloff. 1992. Repair After Next Turn: The Last Structurally Provided Defense of Intersubjectivity in Conversation. Amer. J. Sociology 97, 5 (1992), 1295–1345. https://www.jstor.org/stable/2781417",
      "doi": ""
    },
    {
      "text": "Emanuel A. Schegloff. 2007. Sequence Organization in Interaction: Volume 1: A Primer in Conversation Analysis. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "David Silverman. 1998. Harvey Sacks: social science and conversation analysis. Polity Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2007. Human-machine reconfigurations: plans and situated actions (2nd ed ed.). Cambridge University Press, Cambridge ; New York. OCLC: ocm64592145 tex.ids= suchman_human-machine_2007-1.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Sebastian Thrun, Michael Montemerlo, and Andrei Aron. 2006. Probabilistic Terrain Analysis For High-Speed Desert Driving.. In Robotics: Science and Systems. 16–19. http://robots.stanford.edu/papers/thrun.mapping-Stanley.pdf",
      "doi": ""
    },
    {
      "text": "Chris Urmson, Joshua Anhalt, Drew Bagnell, Christopher Baker, Robert Bittner, M. N. Clark, John Dolan, Dave Duggins, Tugrul Galatali, Chris Geyer, and others. 2008. Autonomous driving in urban environments: Boss and the urban challenge. Journal of Field Robotics 25, 8 (2008), 425–466. https://doi.org/10.15607/RSS.2006.II.021",
      "doi": ""
    },
    {
      "text": "Remo M.A. van der Heiden, Shamsi T. Iqbal, and Christian P. Janssen. 2017. Priming Drivers Before Handover in Semi-Autonomous Cars. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 392–404. https://doi.org/10.1145/3025453.3025507 event-place: Denver, Colorado, USA.",
      "doi": "10.1145/3025453.3025507"
    },
    {
      "text": "Marcel Walch, Kristin Lange, Martin Baumann, and Michael Weber. 2015. Autonomous Driving: Investigating the Feasibility of Car-driver Handover Assistance. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’15). ACM, New York, NY, USA, 11–18. https://doi.org/10.1145/2799250.2799268 event-place: Nottingham, United Kingdom.",
      "doi": "10.1145/2799250.2799268"
    },
    {
      "text": "Rod Watson. 1999. Driving in forests and mountains: A pure and applied ethnography. Ethnographic studies 3(1999), 50–60. https://doi.org/10.5449/idslu-001103654",
      "doi": ""
    }
  ]
}