{
  "doi": "10.1145/3544548.3581243",
  "title": "Understanding Context to Capture when Reconstructing Meaningful Spaces for Remote Instruction and Connecting in XR",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Recent technological advances are enabling HCI researchers to explore interaction possibilities for remote XR collaboration using high-fidelity reconstructions of physical activity spaces. However, creating these reconstructions often lacks user involvement with an overt focus on capturing sensory context that does not necessarily augment an informal social experience. This work seeks to understand social context that can be important for reconstruction to enable XR applications for informal instructional scenarios. Our study involved the evaluation of an XR remote guidance prototype by 8 intergenerational groups of closely related gardeners using reconstructions of personally meaningful spaces in their gardens. Our findings contextualize physical objects and areas with various motivations related to gardening and detail perceptions of XR that might affect the use of reconstructions for remote interaction. We discuss implications for user involvement to create reconstructions that better translate real-world experience, encourage reflection, incorporate privacy considerations, and preserve shared experiences with XR as a medium for informal intergenerational activities.",
  "tags": [
    "Extended Reality",
    "intergenerational study",
    "3D reconstruction",
    "contextual capture",
    "metaverse",
    "gardening",
    "remote instruction",
    "hobby activities"
  ],
  "authors": [
    {
      "name": "Hanuma Teja Maddali",
      "institution": "Department of Computer Science, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214433",
      "orcid": "0000-0002-3941-0336"
    },
    {
      "name": "Amanda Lazar",
      "institution": "College of Information Studies, University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262040",
      "orcid": "0000-0001-8110-4239"
    }
  ],
  "references": [
    {
      "text": "Karan Ahuja, Deval Shah, Sujeath Pareddy, Franceska Xhakaj, Amy Ogan, Yuvraj Agarwal, and Chris Harrison. 2021. Classroom Digital Twins with Instrumentation-Free Gaze Tracking. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA, 1–9. DOI:https://doi.org/10.1145/3411764.3445711",
      "doi": "10.1145/3411764.3445711"
    },
    {
      "text": "Sultan A. Alharthi, Katta Spiel, William A. Hamilton, Elizabeth Bonsignore, and Zachary O. Toups. 2018. Collaborative Mixed Reality Games. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’18), Association for Computing Machinery, New York, NY, USA, 447–454. DOI:https://doi.org/10.1145/3272973.3273013",
      "doi": "10.1145/3272973.3273013"
    },
    {
      "text": "Chris Baber, James Cross, Tariq Khaleel, and Russell Beale. 2008. Location-based photography as sense-making. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction - Volume 1 (BCS-HCI ’08), BCS Learning & Development Ltd., Swindon, GBR, 133–140.",
      "doi": ""
    },
    {
      "text": "Marc Badger, Yufu Wang, Adarsh Modh, Ammon Perkes, Nikos Kolotouros, Bernd G. Pfrommer, Marc F. Schmidt, and Kostas Daniilidis. 2020. 3D Bird Reconstruction: A Dataset, Model, and Shape Recovery from a Single View. In Computer Vision – ECCV 2020: 16th European Conference, Glasgow, UK, August 23–28, 2020, Proceedings, Part XVIII, Springer-Verlag, Berlin, Heidelberg, 1–17. DOI:https://doi.org/10.1007/978-3-030-58523-5_1",
      "doi": "10.1007/978-3-030-58523-5_1"
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the Implication is Not to Design (Technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), ACM, New York, NY, USA, 2271–2274. DOI:https://doi.org/10.1145/1978942.1979275",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Pieter J. Beers, Henny P. A. Boshuizen, Paul A. Kirschner, and Wim H. Gijselaers. 2006. Common Ground, Complex Problems and Decision Making. Group Decis Negot 15, 6 (November 2006), 529–556. DOI:https://doi.org/10.1007/s10726-006-9030-1",
      "doi": ""
    },
    {
      "text": "Peter Bennett, Mike Fraser, and Madeline Balaam. 2012. ChronoTape: tangible timelines for family history. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI ’12), Association for Computing Machinery, New York, NY, USA, 49–56. DOI:https://doi.org/10.1145/2148131.2148144",
      "doi": "10.1145/2148131.2148144"
    },
    {
      "text": "Peter Bennett, Heidi Hinder, Seana Kozar, Christopher Bowdler, Elaine Massung, Tim Cole, Helen Manchester, and Kirsten Cater. 2015. TopoTiles: Storytelling in Care Homes with Topographic Tangibles. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’15), Association for Computing Machinery, New York, NY, USA, 911–916. DOI:https://doi.org/10.1145/2702613.2732918",
      "doi": "10.1145/2702613.2732918"
    },
    {
      "text": "George R. Bent, David Pfaff, Mackenzie Brooks, Roxanne Radpour, and John Delaney. 2022. A practical workflow for the 3D reconstruction of complex historic sites and their decorative interiors: Florence As It Was and the church of Orsanmichele. Heritage Science 10, 1 (July 2022), 118. DOI:https://doi.org/10.1186/s40494-022-00750-1",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst and Hirokazu Kato. 2002. Collaborative Augmented Reality. Commun. ACM 45, 7 (July 2002), 64–70. DOI:https://doi.org/10.1145/514236.514265",
      "doi": "10.1145/514236.514265"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Margot Brereton, Alessandro Soro, Kate Vaisutis, and Paul Roe. 2015. The Messaging Kettle: Prototyping Connection over a Distance Between Adult Children and Older Parents. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), ACM, New York, NY, USA, 713–716. DOI:https://doi.org/10.1145/2702123.2702462",
      "doi": "10.1145/2702123.2702462"
    },
    {
      "text": "Rohan Chabra, Adrian Ilie, Nicholas Rewkowski, Young-Woon Cha, and Henry Fuchs. 2017. Optimizing placement of commodity depth cameras for known 3D dynamic scene capture. In 2017 IEEE Virtual Reality (VR), 157–166. DOI:https://doi.org/10.1109/VR.2017.7892243",
      "doi": ""
    },
    {
      "text": "Wen-Huei Chou, Yi-Chun Li, Ya-Fang Chen, Mieko Ohsuga, and Tsuyoshi Inoue. 2022. Empirical Study of Virtual Reality to Promote Intergenerational Communication: Taiwan Traditional Glove Puppetry as Example. Sustainability 14, 6 (January 2022), 3213. DOI:https://doi.org/10.3390/su14063213",
      "doi": ""
    },
    {
      "text": "Herbert H. Clark (Ed.). 1996. Common ground. In Using Language. Cambridge University Press, Cambridge, 92–122. DOI:https://doi.org/10.1017/CBO9780511620539.005",
      "doi": ""
    },
    {
      "text": "Sheri T. Dorn, Milton G. Newberry, Ellen M. Bauske, and Svoboda V. Pennisi. 2018. Extension Master Gardener Volunteers of the 21st Century: Educated, Prosperous, and Committed. HortTechnology 28, 2 (April 2018), 218–229. DOI:https://doi.org/10.21273/HORTTECH03998-18",
      "doi": ""
    },
    {
      "text": "Carmine Elvezio, Mengu Sukan, Ohan Oda, Steven Feiner, and Barbara Tversky. 2017. Remote collaboration in AR and VR using virtual replicas. In ACM SIGGRAPH 2017 VR Village (SIGGRAPH ’17), Association for Computing Machinery, New York, NY, USA, 1–2. DOI:https://doi.org/10.1145/3089269.3089281",
      "doi": "10.1145/3089269.3089281"
    },
    {
      "text": "Geraldine Fauville, Anna C. M. Queiroz, Linda Hambrick, Bryan A. Brown, and Jeremy N. Bailenson. 2020. Participatory research on using virtual reality to teach ocean acidification: a study in the marine education community. Environmental Education Research 0, 0 (2020), 1–25. DOI:https://doi.org/10.1080/13504622.2020.1803797",
      "doi": ""
    },
    {
      "text": "Lei Gao, Huidong Bai, Weiping He, Mark Billinghurst, and Robert W. Lindeman. 2018. Real-time visual representations for mobile mixed reality remote collaboration. In SIGGRAPH Asia 2018 Virtual & Augmented Reality (SA ’18), Association for Computing Machinery, New York, NY, USA, 1–2. DOI:https://doi.org/10.1145/3275495.3275515",
      "doi": "10.1145/3275495.3275515"
    },
    {
      "text": "Danilo Gasques, Janet G. Johnson, Tommy Sharkey, Yuanyuan Feng, Ru Wang, Zhuoqun Robin Xu, Enrique Zavala, Yifei Zhang, Wanze Xie, Xinming Zhang, Konrad Davis, Michael Yip, and Nadir Weibel. 2021. ARTEMIS: A Collaborative Mixed-Reality System for Immersive Surgical Telementoring. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. Retrieved October 24, 2021 from https://doi.org/10.1145/3411764.3445576",
      "doi": "10.1145/3411764.3445576"
    },
    {
      "text": "Jennifer A. Gonzalez. 1995. Autotopographies. Prosthetic territories: Politics and … (January 1995). Retrieved August 25, 2022 from https://www.academia.edu/2217199/Autotopographies",
      "doi": ""
    },
    {
      "text": "Elizabeth Goodman and Daniela Rosner. 2011. From Garments to Gardens: Negotiating Material Relationships Online and “by Hand.” In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), ACM, New York, NY, USA, 2257–2266. DOI:https://doi.org/10.1145/1978942.1979273",
      "doi": "10.1145/1978942.1979273"
    },
    {
      "text": "Maria Håkansson and Lalya Gaye. 2008. Bringing context to the foreground: designing for creative engagement in a novel still camera application. In Proceedings of the 7th ACM conference on Designing interactive systems (DIS ’08), Association for Computing Machinery, New York, NY, USA, 164–173. DOI:https://doi.org/10.1145/1394445.1394463",
      "doi": "10.1145/1394445.1394463"
    },
    {
      "text": "Maria Håkansson, Sara Ljungblad, Lalya Gaye, and Lars Erik Holmquist. 2006. Snapshots from a study of context photography. In CHI ’06 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’06), Association for Computing Machinery, New York, NY, USA, 333–338. DOI:https://doi.org/10.1145/1125451.1125525",
      "doi": "10.1145/1125451.1125525"
    },
    {
      "text": "Jennifer Healey, Duotun Wang, Curtis Wigington, Tong Sun, and Huaishu Peng. 2021. A Mixed-Reality System to Promote Child Engagement in Remote Intergenerational Storytelling. In 2021 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct), 274–279. DOI:https://doi.org/10.1109/ISMAR-Adjunct54149.2021.00063",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for Grassroots Urban Food-Growing Communities. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI ’13), Association for Computing Machinery, New York, NY, USA, 255–264. DOI:https://doi.org/10.1145/2541016.2541023",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Atsushi Hiyama, Hiroyuki Onimaru, Mariko Miyashita, Eikan Ebuchi, Masazumi Seki, and Michitaka Hirose. 2013. Augmented Reality System for Measuring and Learning Tacit Artisan Skills. In Human Interface and the Management of Information. Information and Interaction for Health, Safety, Mobility and Complex Environments, Springer Berlin Heidelberg, Berlin, Heidelberg, 85–91.",
      "doi": ""
    },
    {
      "text": "H.G. Hoffman. 1998. Physically touching virtual objects using tactile augmentation enhances the realism of virtual environments. In Proceedings. IEEE 1998 Virtual Reality Annual International Symposium (Cat. No.98CB36180), 59–63. DOI:https://doi.org/10.1109/VRAIS.1998.658423",
      "doi": ""
    },
    {
      "text": "Adrian Hon. 2020. Digital Sight Management, and the Mystery of the Missing Amazon Receipts. Retrieved August 30, 2022 from https://mssv.net/2020/08/16/digital-sight-management-and-the-mystery-of-the-missing-amazon-receipts/",
      "doi": ""
    },
    {
      "text": "Kevin Huang, Jiannan Li, Mauricio Sousa, and Tovi Grossman. 2022. immersivePOV: Filming How-To Videos with a Head-Mounted 360° Action Camera. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3491102.3517468",
      "doi": "10.1145/3491102.3517468"
    },
    {
      "text": "Lisa Brown Jaloza. 2019. Inside Facebook Reality Labs: Research updates and the future of social connection. Tech at Meta. Retrieved August 24, 2022 from https://tech.fb.com/ar-vr/2019/09/inside-facebook-reality-labs-research-updates-and-the-future-of-social-connection/",
      "doi": ""
    },
    {
      "text": "Shunichi Kasahara and Jun Rekimoto. 2015. JackIn head: immersive visual telepresence system with omnidirectional wearable camera for remote collaboration. In Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology (VRST ’15), Association for Computing Machinery, New York, NY, USA, 217–225. DOI:https://doi.org/10.1145/2821592.2821608",
      "doi": "10.1145/2821592.2821608"
    },
    {
      "text": "Eng Tat Khoo, Tim Merritt, and Adrian David Cheok. 2009. Designing physical and social intergenerational family entertainment. Interacting with Computers 21, 1–2 (January 2009), 76–87. DOI:https://doi.org/10.1016/j.intcom.2008.10.009",
      "doi": "10.1016/j.intcom.2008.10.009"
    },
    {
      "text": "Ryohei Komiyama, Takashi Miyaki, and Jun Rekimoto. 2017. JackIn Space: Designing a Seamless Transition Between First and Third Person View for Effective Telepresence Collaborations. In Proceedings of the 8th Augmented Human International Conference (AH ’17), ACM, New York, NY, USA, 14:1-14:9. DOI:https://doi.org/10.1145/3041164.3041183",
      "doi": "10.1145/3041164.3041183"
    },
    {
      "text": "Karol Kwiatek. 2012. How to preserve inspirational environments that once surrounded a poet? Immersive 360° video and the cultural memory of Charles Causley's poetry. In 2012 18th International Conference on Virtual Systems and Multimedia, 243–250. DOI:https://doi.org/10.1109/VSMM.2012.6365931",
      "doi": ""
    },
    {
      "text": "Cun Li, Jun Hu, Bart Hengeveld, and Caroline Hummels. 2019. Story-Me: Design of a System to Support Intergenerational Storytelling and Preservation for Older Adults. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion (DIS ’19 Companion), Association for Computing Machinery, New York, NY, USA, 245–250. DOI:https://doi.org/10.1145/3301019.3323902",
      "doi": "10.1145/3301019.3323902"
    },
    {
      "text": "Yifang Li, Nishant Vishwamitra, Hongxin Hu, and Kelly Caine. 2020. Towards A Taxonomy of Content Sensitivity and Sharing Preferences for Photos. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3313831.3376498",
      "doi": "10.1145/3313831.3376498"
    },
    {
      "text": "Stephen Lombardi, Jason Saragih, Tomas Simon, and Yaser Sheikh. 2018. Deep appearance models for face rendering. ACM Trans. Graph. 37, 4 (July 2018), 68:1-68:13. DOI:https://doi.org/10.1145/3197517.3201401",
      "doi": "10.1145/3197517.3201401"
    },
    {
      "text": "Peter Lyle, Jaz Hee-jeong Choi, and Marcus Foth. 2015. Growing Food in the City: Design Ideations for Urban Residential Gardeners. In Proceedings of the 7th International Conference on Communities and Technologies (C&T ’15), ACM, New York, NY, USA, 89–97. DOI:https://doi.org/10.1145/2768545.2768549",
      "doi": "10.1145/2768545.2768549"
    },
    {
      "text": "Hanuma Teja Maddali, Andrew Irlitti, and Amanda Lazar. 2022. Probing the Potential of Extended Reality to Connect Experts and Novices in the Garden. In ACM Hum.-Comput. Interact, 29. DOI:https://doi.org/10.1145/3555211",
      "doi": "10.1145/3555211"
    },
    {
      "text": "Hanuma Teja Maddali and Amanda Lazar. 2020. Sociality and Skill Sharing in the Garden. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3313831.3376246",
      "doi": "10.1145/3313831.3376246"
    },
    {
      "text": "Thomas M. Malaby. 2007. Beyond Play. Games and Culture 2, 2 (2007), 95. Retrieved September 2, 2022 from https://www.academia.edu/239795/Beyond_Play_A_New_Approach_to_Games",
      "doi": ""
    },
    {
      "text": "McGill and Mark. 2021. The IEEE Global Initiative on Ethics of Extended Reality (XR) Report–Extended Reality (XR) and the Erosion of Anonymity and Privacy. Extended Reality (XR) and the Erosion of Anonymity and Privacy - White Paper (November 2021), 1–24.",
      "doi": ""
    },
    {
      "text": "Vibhav Nanda, Hanuma Teja Maddali, and Amanda Lazar. 2022. Does XR introduce experience asymmetry in an intergenerational setting? ACM, Athens, Greece. DOI:https://doi.org/10.1145/3517428.3550373",
      "doi": "10.1145/3517428.3550373"
    },
    {
      "text": "Ohan Oda, Carmine Elvezio, Mengu Sukan, Steven Feiner, and Barbara Tversky. 2015. Virtual Replicas for Remote Assistance in Virtual and Augmented Reality. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST ’15), ACM, New York, NY, USA, 405–415. DOI:https://doi.org/10.1145/2807442.2807497",
      "doi": "10.1145/2807442.2807497"
    },
    {
      "text": "William Odom. 2010. “Mate, We Don't Need a Chip to Tell Us the Soil's Dry”: Opportunities for Designing Interactive Systems to Support Urban Food Production. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS ’10), ACM, New York, NY, USA, 232–235. DOI:https://doi.org/10.1145/1858171.1858211",
      "doi": "10.1145/1858171.1858211"
    },
    {
      "text": "Jason Orlosky, Misha Sra, Kenan Bektaş, Huaishu Peng, Jeeeun Kim, Nataliya Kos'myna, Tobias Höllerer, Anthony Steed, Kiyoshi Kiyokawa, and Kaan Akşit. 2021. Telelife: The Future of Remote Living. Frontiers in Virtual Reality 2, (2021). Retrieved August 18, 2022 from https://www.frontiersin.org/articles/10.3389/frvir.2021.763340",
      "doi": ""
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L. Davidson, Sameh Khamis, Mingsong Dou, Vladimir Tankovich, Charles Loop, Qin Cai, Philip A. Chou, Sarah Mennicken, Julien Valentin, Vivek Pradeep, Shenlong Wang, Sing Bing Kang, Pushmeet Kohli, Yuliya Lutchyn, Cem Keskin, and Shahram Izadi. 2016. Holoportation: Virtual 3D Teleportation in Real-time. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST ’16), ACM, New York, NY, USA, 741–754. DOI:https://doi.org/10.1145/2984511.2984517",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Sanela Osmanovic and Loretta Pecchioni. 2016. Beyond Entertainment: Motivations and Outcomes of Video Game Playing by Older Adults and Their Younger Family Members. Games and Culture 11, 1–2 (January 2016), 130–149. DOI:https://doi.org/10.1177/1555412015602819",
      "doi": ""
    },
    {
      "text": "Aswati Panicker, Kavya Basu, and Chia-Fang Chung. 2020. Changing Roles and Contexts: Symbolic Interactionism in the Sharing of Food and Eating Practices between Remote, Intergenerational Family Members. Proc. ACM Hum.-Comput. Interact. 4, CSCW1 (May 2020), 43:1-43:19. DOI:https://doi.org/10.1145/3392848",
      "doi": "10.1145/3392848"
    },
    {
      "text": "Tomislav Pejsa, Julian Kantor, Hrvoje Benko, Eyal Ofek, and Andrew Wilson. 2016. Room2Room: Enabling Life-Size Telepresence in a Projected Augmented Reality Environment. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW ’16), Association for Computing Machinery, New York, NY, USA, 1716–1725. DOI:https://doi.org/10.1145/2818048.2819965",
      "doi": "10.1145/2818048.2819965"
    },
    {
      "text": "Melissa Escamilla Perez, Stephanie T. Jones, Sarah Priscilla Lee, and Marcelo Worsley. 2020. Intergenerational Making with Young Children. In Proceedings of the FabLearn 2020 - 9th Annual Conference on Maker Education (FabLearn ’20), Association for Computing Machinery, New York, NY, USA, 68–73. DOI:https://doi.org/10.1145/3386201.3386225",
      "doi": "10.1145/3386201.3386225"
    },
    {
      "text": "Daniela Petrelli and Steve Whittaker. 2010. Family memories in the home: contrasting physical and digital mementos. Personal Ubiquitous Comput. 14, 2 (February 2010), 153–169. DOI:https://doi.org/10.1007/s00779-009-0279-7",
      "doi": "10.1007/s00779-009-0279-7"
    },
    {
      "text": "Daniela Petrelli, Steve Whittaker, and Jens Brockmeier. 2008. AutoTopography: what can physical mementos tell us about digital memories? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’08), Association for Computing Machinery, New York, NY, USA, 53–62. DOI:https://doi.org/10.1145/1357054.1357065",
      "doi": "10.1145/1357054.1357065"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A. Lee, Andrew Irlitti, Barrett Ens, Bruce H. Thomas, and Mark Billinghurst. 2019. On the Shoulder of the Giant: A Multi-Scale Mixed Reality Collaboration with 360 Video Sharing and Tangible Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), ACM, New York, NY, USA, 228:1-228:17. DOI:https://doi.org/10.1145/3290605.3300458",
      "doi": "10.1145/3290605.3300458"
    },
    {
      "text": "Christina Pollalis, Elizabeth Joanna Minor, Lauren Westendorf, Whitney Fahnbulleh, Isabella Virgilio, Andrew L. Kun, and Orit Shaer. 2018. Evaluating Learning with Tangible and Virtual Representations of Archaeological Artifacts. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’18), Association for Computing Machinery, New York, NY, USA, 626–637. DOI:https://doi.org/10.1145/3173225.3173260",
      "doi": "10.1145/3173225.3173260"
    },
    {
      "text": "Proximie. How technology is boosting peer-to-peer collaboration in surgery. Retrieved from https://www.proximie.com/how-technology-is-boosting-peer-to-peer-collaboration-in-surgery/",
      "doi": ""
    },
    {
      "text": "Iulian Radu, Tugce Joy, and Bertrand Schneider. 2021. Virtual Makerspaces: Merging AR/VR/MR to Enable Remote Collaborations in Physical Maker Activities. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–5. Retrieved October 31, 2021 from https://doi.org/10.1145/3411763.3451561",
      "doi": "10.1145/3411763.3451561"
    },
    {
      "text": "Hayes Raffle, Glenda Revelle, Koichi Mori, Rafael Ballagas, Kyle Buza, Hiroshi Horii, Joseph Kaye, Kristin Cook, Natalie Freed, Janet Go, and Mirjana Spasojevic. 2011. Hello, is grandma there? let's read! StoryVisit: family video chat and connected e-books. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), Association for Computing Machinery, New York, NY, USA, 1195–1204. DOI:https://doi.org/10.1145/1978942.1979121",
      "doi": "10.1145/1978942.1979121"
    },
    {
      "text": "Shwetha Rajaram, Franziska Roesner, and Michael Nebeling. 2021. Designing Privacy-Informed Sharing Techniques for Multi-User AR Experiences. VR4Sec: 1st International Workshop on Security for XR and XR for Security (January 2021). Retrieved August 18, 2022 from https://par.nsf.gov/biblio/10312789-designing-privacy-informed-sharing-techniques-multi-user-ar-experiences",
      "doi": ""
    },
    {
      "text": "Logan Reis, Kathryn Mercer, and Jennifer Boger. Technologies for fostering intergenerational connectivity and relationships: Scoping review and emergent concepts | Elsevier Enhanced Reader. DOI:https://doi.org/10.1016/j.techsoc.2020.101494",
      "doi": ""
    },
    {
      "text": "Selma Rizvic, Vensada Okanovic, Irfan Prazina, and Aida Sadzak. 2016. 4D Virtual Reconstruction of White Bastion Fortress. The Eurographics Association. DOI:https://doi.org/10.2312/gch20161387",
      "doi": ""
    },
    {
      "text": "Selma Rizvic and Irfan Prazina. 2015. Taslihan Virtual Reconstruction - Interactive Digital Story or a Serious Game. In 2015 7th International Conference on Games and Virtual Worlds for Serious Applications (VS-Games), 1–2. DOI:https://doi.org/10.1109/VS-GAMES.2015.7295786",
      "doi": ""
    },
    {
      "text": "Jim Scheibmeir. 2021. Quality Attributes of Digital Twins. PhD Thesis. Colorado State University.",
      "doi": ""
    },
    {
      "text": "Claudia Schlegel, Alain Geering, and Uwe Weber. 2021. Learning in virtual space: an intergenerational pilot project. GMS J Med Educ 38, 2 (February 2021), Doc37. DOI:https://doi.org/10.3205/zma001433",
      "doi": ""
    },
    {
      "text": "Minyeong Seo, Hansu Lee, Seungmi Choi, Suhyun Jo, Heejae Jung, Subin Park, and Hyunggu Jung. 2019. Exploring Experiences of Virtual Reality among Young and Older Adults in a Subway Fire Scenario: a Pilot Study. In 25th ACM Symposium on Virtual Reality Software and Technology (VRST ’19), Association for Computing Machinery, New York, NY, USA, 1–2. DOI:https://doi.org/10.1145/3359996.3364788",
      "doi": "10.1145/3359996.3364788"
    },
    {
      "text": "Elisa Serafinelli and Lauren Alex O'Hagan. 2022. Drone views: a multimodal ethnographic perspective. Visual Communication (May 2022), 14703572211065092. DOI:https://doi.org/10.1177/14703572211065093",
      "doi": ""
    },
    {
      "text": "Mike Shafto, M Conroy, R Doyle, E Glaessgen, C Kemp, J LeMoigne, and L Wang. 2010. Modeling, Simulation, Information Technology and Processing Roadmap.",
      "doi": ""
    },
    {
      "text": "Rita Shewbridge, Amy Hurst, and Shaun K. Kane. 2014. Everyday making: identifying future uses for 3D printing in the home. In Proceedings of the 2014 conference on Designing interactive systems (DIS ’14), Association for Computing Machinery, New York, NY, USA, 815–824. DOI:https://doi.org/10.1145/2598510.2598544",
      "doi": "10.1145/2598510.2598544"
    },
    {
      "text": "Adalberto L. Simeone and Eduardo Velloso. 2015. Substitutional reality: bringing virtual reality home. XRDS 22, 1 (November 2015), 24–29. DOI:https://doi.org/10.1145/2810044",
      "doi": "10.1145/2810044"
    },
    {
      "text": "Mike Sinclair, Eyal Ofek, Mar Gonzalez-Franco, and Christian Holz. 2019. CapstanCrunch: A Haptic VR Controller with User-supplied Force Feedback. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST ’19), Association for Computing Machinery, New York, NY, USA, 815–829. DOI:https://doi.org/10.1145/3332165.3347891",
      "doi": "10.1145/3332165.3347891"
    },
    {
      "text": "Harrison Jesse Smith and Michael Neff. 2018. Communication Behavior in Embodied Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), ACM, New York, NY, USA, 289:1-289:12. DOI:https://doi.org/10.1145/3173574.3173863",
      "doi": "10.1145/3173574.3173863"
    },
    {
      "text": "Misha Sra and Chris Schmandt. 2016. Bringing real objects, spaces, actions, and interactions into social VR. In 2016 IEEE Third VR International Workshop on Collaborative Virtual Environments (3DCVE), 16–17. DOI:https://doi.org/10.1109/3DCVE.2016.7563561",
      "doi": ""
    },
    {
      "text": "Scott Stein. Google 3D animals: How to conjure AR animals with Google search and more. CNET. Retrieved September 2, 2022 from https://www.cnet.com/tech/services-and-software/google-3d-animals-how-to-use-cool-ar-feature-at-home-list-of-objects/",
      "doi": ""
    },
    {
      "text": "Paul Strohmeier and Kasper Hornbæk. 2017. Generating Haptic Textures with a Vibrotactile Actuator. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), Association for Computing Machinery, New York, NY, USA, 4994–5005. DOI:https://doi.org/10.1145/3025453.3025812",
      "doi": "10.1145/3025453.3025812"
    },
    {
      "text": "Hongling Sun, Yue Liu, Zhenliang Zhang, Xiaoxu Liu, and Yongtian Wang. 2018. Employing Different Viewpoints for Remote Guidance in a Collaborative Augmented Environment. In Proceedings of the Sixth International Symposium of Chinese CHI (ChineseCHI ’18), Association for Computing Machinery, New York, NY, USA, 64–70. DOI:https://doi.org/10.1145/3202667.3202676",
      "doi": "10.1145/3202667.3202676"
    },
    {
      "text": "Anthony Tang, Omid Fakourfar, Carman Neustaedter, and Scott Bateman. 2017. Collaboration with 360° Videochat: Challenges and Opportunities. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS ’17), Association for Computing Machinery, New York, NY, USA, 1327–1339. DOI:https://doi.org/10.1145/3064663.3064707",
      "doi": "10.1145/3064663.3064707"
    },
    {
      "text": "Andre Taulien, Anika Paulsen, Tim Streland, Benedikt Jessen, Stefan Wittke, and Michael Teistler. 2019. A Mixed Reality Environmental Simulation to Support Learning about Maritime Habitats: An Approach to Convey Educational Knowledge With a Novel User Experience. In Proceedings of Mensch und Computer 2019 (MuC’19), Association for Computing Machinery, New York, NY, USA, 921–925. DOI:https://doi.org/10.1145/3340764.3345382",
      "doi": "10.1145/3340764.3345382"
    },
    {
      "text": "Theophilus Teo, Louise Lawrence, Gun A. Lee, Mark Billinghurst, and Matt Adcock. 2019. Mixed Reality Remote Collaboration Combining 360 Video and 3D Reconstruction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3290605.3300431",
      "doi": "10.1145/3290605.3300431"
    },
    {
      "text": "Theophilus Teo, Mitchell Norman, Gun A. Lee, Mark Billinghurst, and Matt Adcock. 2020. Exploring interaction techniques for 360 panoramas inside a 3D reconstructed scene for mixed reality remote collaboration. J Multimodal User Interfaces 14, 4 (December 2020), 373–385. DOI:https://doi.org/10.1007/s12193-020-00343-x",
      "doi": ""
    },
    {
      "text": "Arnout Terpstra, Alexander P. Schouten, Alwin de Rooij, and Ronald E. Leenes. 2019. Improving privacy choice through design: How designing for reflection could support privacy self-management. First Monday (June 2019). DOI:https://doi.org/10.5210/fm.v24i7.9358",
      "doi": ""
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Fraser Anderson, George Fitzmaurice, Bjoern Hartmann, and Tovi Grossman. 2019. Loki: Facilitating Remote Instruction of Physical Tasks Using Bi-Directional Mixed-Reality Telepresence. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST ’19), Association for Computing Machinery, New York, NY, USA, 161–174. DOI:https://doi.org/10.1145/3332165.3347872",
      "doi": "10.1145/3332165.3347872"
    },
    {
      "text": "Rundong Tian, Sarah Sterman, Ethan Chiou, Jeremy Warner, and Eric Paulos. 2018. MatchSticks: Woodworking through Improvisational Digital Fabrication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3173574.3173723",
      "doi": "10.1145/3173574.3173723"
    },
    {
      "text": "Priscilla Ulguim. 2018. Models and Metadata: The Ethics of Sharing Bioarchaeological 3D Models Online. Arch 14, 2 (August 2018), 189–228. DOI:https://doi.org/10.1007/s11759-018-9346-x",
      "doi": ""
    },
    {
      "text": "Cheng Yao Wang, Sandhya Sriram, and Andrea Stevenson Won. 2021. Shared Realities: Avatar Identification and Privacy Concerns in Reconstructed Experiences. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (October 2021), 337:1-337:25. DOI:https://doi.org/10.1145/3476078",
      "doi": "10.1145/3476078"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: a mixed-reality environment for personal fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’14), Association for Computing Machinery, New York, NY, USA, 3855–3864. DOI:https://doi.org/10.1145/2556288.2557090",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Maximiliane Windl, Niels Henze, Albrecht Schmidt, and Sebastian S. Feger. 2022. Automating Contextual Privacy Policies: Design and Evaluation of a Production Tool for Digital Consumer Privacy Awareness. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–18. DOI:https://doi.org/10.1145/3491102.3517688",
      "doi": "10.1145/3491102.3517688"
    },
    {
      "text": "Yufei Ye, Abhinav Gupta, and Shubham Tulsiani. 2022. What's in your hands? 3D Reconstruction of Generic Objects in Hands. (April 2022). DOI:https://doi.org/10.48550/arXiv.2204.07153",
      "doi": ""
    },
    {
      "text": "Xenophon Zabulis, Carlo Meghini, Nikolaos Partarakis, Cynthia Beisswenger, Arnaud Dubois, Maria Fasoula, Vito Nitti, Stavroula Ntoa, Ilia Adami, Antonios Chatziantoniou, Valentina Bartalesi, Daniele Metilli, Nikolaos Stivaktakis, Nikolaos Patsiouras, Paraskevi Doulgeraki, Effie Karuzaki, Evropi Stefanidi, Ammar Qammaz, Danae Kaplanidi, and George Galanakis. 2020. Representation and Preservation of Heritage Crafts. Sustainability 12, (February 2020), 1461. DOI:https://doi.org/10.3390/su12041461",
      "doi": ""
    },
    {
      "text": "Yaying Zhang, Brennan Jones, Sean Rintel, and Carman Neustaedter. 2021. XRmas: Extended Reality Multi-Agency Spaces for a Magical Remote Christmas. Retrieved from https://www.microsoft.com/en-us/research/publication/xrmas-extended-reality-multi-agency-spaces-for-a-magical-remote-christmas/",
      "doi": ""
    },
    {
      "text": "Z. Zhou, A.D. Cheok, S.P. Lee, L.N. Thang, C.K. Kok, W.Z. Ng, Y.K. Cher, M.L. Pung, and Y. Li. 2005. Age Invader: human media for natural social-physical inter-generational interaction with elderly and young. In Proceedings of the 2005 International Conference on Active Media Technology, 2005. (AMT 2005)., 203–204. DOI:https://doi.org/10.1109/AMT.2005.1505308",
      "doi": ""
    },
    {
      "text": "Jakob Zillner, Erick Mendez, and Daniel Wagner. 2018. Augmented Reality Remote Collaboration with Dense Reconstruction. In 2018 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct), 38–39. DOI:https://doi.org/10.1109/ISMAR-Adjunct.2018.00028",
      "doi": ""
    },
    {
      "text": "2014. NGA Garden to Table Report. National Gardening Association. Retrieved from https://garden.org/special/pdf/2014-NGA-Garden-to-Table.pdf",
      "doi": ""
    },
    {
      "text": "2015. Introducing YardMap: Citizen-Scientists Make a Difference. Retrieved December 12, 2022 from https://www.youtube.com/watch?v=-MFR20oN_5w",
      "doi": ""
    },
    {
      "text": "2018. Osso VR, Virtual Reality Surgical Training Platform. Retrieved from https://ossovr.com/",
      "doi": ""
    },
    {
      "text": "2018. Facebook 3D VR Reconstruction for Photo Memories. Retrieved September 6, 2022 from https://www.youtube.com/watch?v=Ur1Z72_LyTM",
      "doi": ""
    },
    {
      "text": "2019. XR Access Symposium Report. Retrieved from https://docs.google.com/document/d/131eLNGES3_2M5_roJacWlLhX-nHZqghNhwUgBF5lJaE/edit",
      "doi": ""
    },
    {
      "text": "2019. Facebook Reality Labs: LiveMaps | Oculus Connect 6. Retrieved August 30, 2022 from https://www.youtube.com/watch?v=JTa8zn0RNVM",
      "doi": ""
    },
    {
      "text": "2019. Voice guidance in Maps, built for people with impaired vision. Google. Retrieved August 30, 2022 from https://blog.google/products/maps/better-maps-for-people-with-vision-impairments/",
      "doi": ""
    },
    {
      "text": "2020. Remote Assist, Microsoft Dynamics 365. Retrieved from https://dynamics.microsoft.com/en-us/mixed-reality/remote-assist/",
      "doi": ""
    },
    {
      "text": "2021. An Era of Digital Humans: Pushing the Envelope of Photorealistic Digital Character Creation. NVIDIA Technical Blog. Retrieved September 11, 2022 from https://developer.nvidia.com/blog/an-era-of-digital-humans-pushing-the-envelope-of-photorealistic-digital-character-creation/",
      "doi": ""
    },
    {
      "text": "Building Mixed Reality with Presence Platform: A New Dimension for Work and Fun. Retrieved September 11, 2022 from https://www.oculus.com/blog/building-mixed-reality-with-presence-platform-a-new-dimension-for-work-and-fun/",
      "doi": ""
    },
    {
      "text": "Pushing state-of-the-art in 3D content understanding. Retrieved September 11, 2022 from https://ai.facebook.com/blog/pushing-state-of-the-art-in-3d-content-understanding/",
      "doi": ""
    },
    {
      "text": "Agisoft Metashape: Agisoft Metashape. Retrieved November 29, 2022 from https://www.agisoft.com/",
      "doi": ""
    },
    {
      "text": "networked-aframe/networked-aframe: A web framework for building multi-user virtual reality experiences. Retrieved September 10, 2022 from https://github.com/networked-aframe/networked-aframe",
      "doi": ""
    },
    {
      "text": "Introducing the Niantic Planet-Scale AR Alliance: Bringing the Mobile Industry Together Towards the 5G Future of Consumer AR. Retrieved August 30, 2022 from https://nianticlabs.com/news/niantic-planet-scale-ar-alliance-5g/",
      "doi": ""
    },
    {
      "text": "Ethical Considerations in Augmented Reality Applications - ProQuest. Retrieved September 7, 2022 from https://www.proquest.com/openview/563a017acbaddcfef2b659a9b6d3457f/1?cbl=1976356&pq-origsite=gscholar",
      "doi": ""
    },
    {
      "text": "Memento. Memento. Retrieved September 6, 2022 from https://www.mementovr.com",
      "doi": ""
    }
  ]
}