{
  "doi": "10.1145/3544548.3581171",
  "title": "An Examination of Motivation in Physical Therapy Through the Lens of Self-Determination Theory: Implications for Game Design",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "While it is widely assumed that games can engage patients in therapy through their inherent ‘motivational pull’, relatively little attention has been paid to what HCI games research can learn from strategies employed by therapists. We address this gap by leveraging Self-Determination Theory (SDT) and its mini-theories Basic Psychological Needs Theory and Organismic Integration Theory as a theoretical lens on physical therapy for children and adolescents. Results from in-depth interviews with twelve therapists show that they carefully adjust sessions to allow patients to experience competence, making more comprehensive adjustments than currently offered by games. Additionally, we highlight how therapists leverage their relationship with patients to support motivation, but struggle to reconcile meaningful experiences of autonomy with therapeutic goals. On this basis, we reflect on implications for researchers and designers who create games for physical therapy, and the potential of SDT to provide a foundation for game design and therapeutic practice.",
  "authors": [
    {
      "name": "Maria Aufheimer",
      "institution": "Karlsruhe Institute of Technology, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078429",
      "orcid": "0000-0003-2360-7799"
    },
    {
      "name": "Kathrin Gerling",
      "institution": "Karlsruhe Institute of Technology, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657431",
      "orcid": "0000-0002-8449-6124"
    },
    {
      "name": "T.C. Nicholas Graham",
      "institution": "Queen's University, Canada",
      "img": "/do/10.1145/contrib-81392599672/rel-imgonly/81392599672.png",
      "acmid": "81392599672",
      "orcid": "0000-0001-6723-1936"
    },
    {
      "name": "Mari Naaris",
      "institution": "KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779457",
      "orcid": "0000-0001-6984-1375"
    },
    {
      "name": "Marco J. Konings",
      "institution": "KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779271",
      "orcid": "0000-0003-1228-5261"
    },
    {
      "name": "Elegast Monbaliu",
      "institution": "KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781041",
      "orcid": "0000-0002-7070-9387"
    },
    {
      "name": "Hans Hallez",
      "institution": "KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351605263",
      "orcid": "0000-0003-2623-9055"
    },
    {
      "name": "Els Ortibus",
      "institution": "KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660274714",
      "orcid": "0000-0002-1020-4408"
    }
  ],
  "references": [
    {
      "text": "Nicole Adams, Todd D. Little, and Richard M. Ryan. 2017. Self-Determination Theory. Springer Netherlands, Dordrecht, 47–54. https://doi.org/10.1007/978-94-024-1042-6_4",
      "doi": ""
    },
    {
      "text": "Gazihan Alankus, Amanda Lazar, Matt May, and Caitlin Kelleher. 2010. Towards Customizable Games for Stroke Rehabilitation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 2113–2122. https://doi.org/10.1145/1753326.1753649",
      "doi": "10.1145/1753326.1753649"
    },
    {
      "text": "Thematic Analysis. [n.d.]. Thematic Analysis. http://thematicanalysis.net. Accessed: 2022-09-09.",
      "doi": ""
    },
    {
      "text": "Dennis Ang and Alex Mitchell. 2017. Comparing Effects of Dynamic Difficulty Adjustment Systems on Video Game Experience. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17). Association for Computing Machinery, New York, NY, USA, 317–327. https://doi.org/10.1145/3116595.3116623",
      "doi": "10.1145/3116595.3116623"
    },
    {
      "text": "Madeline Balaam, Stefan Rennick Egglestone, Geraldine Fitzpatrick, Tom Rodden, Ann-Marie Hughes, Anna Wilkinson, Thomas Nind, Lesley Axelrod, Eric Harris, Ian Ricketts, Susan Mawson, and Jane Burridge. 2011. Motivating Mobility: Designing for Lived Motivation in Stroke Rehabilitation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 3073–3082. https://doi.org/10.1145/1978942.1979397",
      "doi": "10.1145/1978942.1979397"
    },
    {
      "text": "N. Ben Itzhak, I. Franki, B. Jansen, K. Kostkova, J. Wagemans, and E. Ortibus. 2022. An Individualized and Adaptive Game-Based Therapy for Cerebral Visual Impairment: Design, Development, and Evaluation. International Journal of Child-Computer Interaction 31 (2022), 100437. https://doi.org/10.1016/j.ijcci.2021.100437",
      "doi": "10.1016/j.ijcci.2021.100437"
    },
    {
      "text": "Marte Bentzen and Linn Kristin Malmquist. 2022. Differences in Participation Across Physical Activity Contexts Between Adolescents with and without Disability over Three Years: A Self-Determination Theory Perspective. Disability and Rehabilitation 44, 9 (2022), 1660–1668. https://doi.org/10.1080/09638288.2021.1894489",
      "doi": ""
    },
    {
      "text": "Sam Blanchard and Phil Glasgow. 2014. A Theoretical Model to Describe Progressions and Regressions for Exercise Rehabilitation. Physical Therapy in Sport 15, 3 (2014), 131–135. https://doi.org/10.1016/j.ptsp.2014.05.001",
      "doi": ""
    },
    {
      "text": "Bruno Bonnechère, Bart Jansen, Lubos Omelina, Lucie Da Silva, Jennifer Mougeat, Valerie Heymans, Annick Vandeuren, Marcel Rooze, and Serge Van Sint Jan. 2013. Use of Serious gaming to increase motivation of cerebral palsy children during rehabilitation.",
      "doi": ""
    },
    {
      "text": "Bruno Bonnechère, Bart Jansen, Lubos Omelina, Serge Van Sint Jan, 2016. The use of commercial video games in rehabilitation: a systematic review. International journal of rehabilitation research 39, 4 (2016), 277–290.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Thematic Analysis: A Practical Guide. SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Stephanie P Brooks and Tania Bubela. 2020. Application of protection motivation theory to clinical trial enrolment for pediatric chronic conditions. BMC pediatrics 20, 1 (2020), 1–14.",
      "doi": ""
    },
    {
      "text": "Chantal Camden, Gabrielle Pratte, Florence Fallon, Mélanie Couture, Jade Berbari, and Michel Tousignant. 2020. Diversity of practices in telerehabilitation for children with disabilities and effective intervention characteristics: results from a systematic review. Disability and Rehabilitation 42, 24 (2020), 3424–3436. https://doi.org/10.1080/09638288.2019.1595750 arXiv:https://doi.org/10.1080/09638288.2019.1595750PMID: 30978110.",
      "doi": ""
    },
    {
      "text": "Sung Hyeon Cheon, Johnmarshall Reeve, Jaewon Lee, and Youngsun Lee. 2015. Giving and receiving autonomy support in a high-stakes sport context: A field-based experiment during the 2012 London Paralympic Games. Psychology of Sport and Exercise 19 (2015), 59–69. https://doi.org/10.1016/j.psychsport.2015.02.007",
      "doi": ""
    },
    {
      "text": "Sung Hyeon Cheon, Johnmarshall Reeve, and Ik Soo Moon. 2012. Experimentally Based, Longitudinally Designed, Teacher-Focused Intervention to Help Physical Education Teachers Be More Autonomy Supportive Toward Their Students. Journal of Sport and Exercise Psychology 34, 3 (2012), 365 – 396. https://doi.org/10.1123/jsep.34.3.365",
      "doi": ""
    },
    {
      "text": "Gabriele Cimolino, Sussan Askari, and T.C. Nicholas Graham. 2021. The Role of Partial Automation in Increasing the Accessibility of Digital Games. Proc. ACM Hum.-Comput. Interact. 5, CHI PLAY, Article 266 (oct 2021), 30 pages. https://doi.org/10.1145/3474693",
      "doi": "10.1145/3474693"
    },
    {
      "text": "Paul Comfort and Martyn Matthews. 2010. An Introduction to Periodisation. John Wiley & Sons, Ltd, Chapter 9, 143–161. https://doi.org/10.1002/9781118685150.ch9",
      "doi": ""
    },
    {
      "text": "Robin De Croon, Jonas Geuens, Katrien Verbert, and Vero Vanden Abeele. 2021. A systematic review of the effect of gamification on adherence across disciplines. In International Conference on Human-Computer Interaction. Springer, 168–184.",
      "doi": "10.1007/978-3-030-77277-2_14"
    },
    {
      "text": "Mihaly Csikszentmihalyi and Mihaly Csikzentmihaly. 1990. Flow: The psychology of optimal experience. Vol. 1990. Harper & Row New York.",
      "doi": ""
    },
    {
      "text": "Robin De Croon, Davina Wildemeersch, Joris Wille, Katrien Verbert, and Vero Vanden Abeele. 2018. Gamification and Serious Games in a Healthcare Informatics Context. In 2018 IEEE International Conference on Healthcare Informatics (ICHI). 53–63. https://doi.org/10.1109/ICHI.2018.00014",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 1985. Intrinsic Motivation and Self-Determination in Human Behavior. NY: Plenum.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2000. The “What” and “Why” of Goal Pursuits: Human Needs and the Self-Determination of Behavior. Psychological Inquiry 11, 4 (2000), 227–268. https://doi.org/10.1207/S15327965PLI1104_01",
      "doi": ""
    },
    {
      "text": "DeepL. [n.d.]. DeepL Translator. https://www.deepl.com/translator. Accessed: 2022-09-09.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding. 2016. Contextual Autonomy Support in Video Game Play: A Grounded Theory. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3931–3943. https://doi.org/10.1145/2858036.2858395",
      "doi": "10.1145/2858036.2858395"
    },
    {
      "text": "Eletha Flores, Gabriel Tobon, Ettore Cavallaro, Francesca I Cavallaro, Joel C Perry, and Thierry Keller. 2008. Improving patient motivation in game development for motor deficit rehabilitation. In Proceedings of the 2008 international conference on advances in computer entertainment technology. 381–384.",
      "doi": "10.1145/1501750.1501839"
    },
    {
      "text": "Julian Frommel, Claudia Schrader, and Michael Weber. 2018. Towards emotion-based adaptive games: Emotion recognition via input and performance features. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. 173–185.",
      "doi": "10.1145/3242671.3242672"
    },
    {
      "text": "Kathrin Gerling, Kieran Hicks, Olivier Szymanezyk, and Conor Linehan. 2019. Designing Interactive Manual Wheelchair Skills Training for Children. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 725–736. https://doi.org/10.1145/3322276.3322281",
      "doi": "10.1145/3322276.3322281"
    },
    {
      "text": "Kathrin Gerling, Ian Livingston, Lennart Nacke, and Regan Mandryk. 2012. Full-Body Motion-Based Game Interaction for Older Adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1873–1882. https://doi.org/10.1145/2207676.2208324",
      "doi": "10.1145/2207676.2208324"
    },
    {
      "text": "Kathrin M. Gerling, Regan L. Mandryk, and Conor Linehan. 2015. Long-Term Use of Motion-Based Video Games in Care Home Settings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1573–1582. https://doi.org/10.1145/2702123.2702125",
      "doi": "10.1145/2702123.2702125"
    },
    {
      "text": "Luc Geurts, Vero Vanden Abeele, Jelle Husson, Frederik Windey, Maarten Van Overveldt, Jan-Henk Annema, and Stef Desmet. 2010. Digital games for physical therapy: fulfilling the need for calibration and adaptation. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction. 117–124.",
      "doi": "10.1145/1935701.1935725"
    },
    {
      "text": "Birgitta Grahn, Carl Ekdahl, and Lars Borgquist. 2000. Motivation as a predictor of changes in quality of life and working ability in multidisciplinary rehabilitation. Disability and rehabilitation 22, 15 (2000), 639–654.",
      "doi": ""
    },
    {
      "text": "Emma J. Grindley and Samuel J. Zizzi. 2005. Using a Multidimensional Approach to Predict Motivation and Adherence to Rehabilitation in Older Adults. Topics in Geriatric Rehabilitation 21, 3 (Jul 2005), 182–193. https://doi.org/10.1097/00013614-200507000-00004",
      "doi": ""
    },
    {
      "text": "Emma J Grindley, Samuel J Zizzi, and Alan M Nasypany. 2008. Use of Protection Motivation Theory, Affect, and Barriers to Understand and Predict Adherence to Outpatient Rehabilitation. Physical Therapy 88, 12 (12 2008), 1529–1540. https://doi.org/10.2522/ptj.20070076 arXiv:https://academic.oup.com/ptj/article-pdf/88/12/1529/9984598/ptj1529.pdf",
      "doi": ""
    },
    {
      "text": "John Harris and Mark Hancock. 2019. To Asymmetry and Beyond! Improving Social Connectedness by Increasing Designed Interdependence in Cooperative Play. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300239",
      "doi": "10.1145/3290605.3300239"
    },
    {
      "text": "Hamilton A. Hernandez, Mallory Ketcheson, Adrian Schneider, Zi Ye, Darcy Fehlings, Lauren Switzer, Virginia Wright, Shelly K. Bursick, Chad Richards, and T.C. Nicholas Graham. 2014. Design and Evaluation of a Networked Game to Supportsocial Connection of Youth with Cerebral Palsy. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (Rochester, New York, USA) (ASSETS ’14). Association for Computing Machinery, New York, NY, USA, 161–168. https://doi.org/10.1145/2661334.2661370",
      "doi": "10.1145/2661334.2661370"
    },
    {
      "text": "Hamilton A. Hernandez, Zi Ye, T.C. Nicholas Graham, Darcy Fehlings, and Lauren Switzer. 2013. Designing Action-Based Exergames for Children with Cerebral Palsy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1261–1270. https://doi.org/10.1145/2470654.2466164",
      "doi": "10.1145/2470654.2466164"
    },
    {
      "text": "Christopher J. Holt, Carly D. McKay, Linda K. Truong, Christina Y. Le, Douglas P. Gross, and Jackie L. Whittaker. 2020. Sticking to It: A Scoping Review of Adherence to Exercise Therapy Interventions in Children and Adolescents With Musculoskeletal Conditions. Journal of Orthopaedic & Sports Physical Therapy 50, 9 (2020), 503–515. https://doi.org/10.2519/jospt.2020.9715",
      "doi": ""
    },
    {
      "text": "Kay Howell. 2005. Games for health conference 2004: issues, trends, and needs unique to games for health. Cyberpsychology & Behavior 8, 2 (2005), 103–109.",
      "doi": ""
    },
    {
      "text": "Susan Hwang, Adrian L. Jessup Schneider, Daniel Clarke, Alexander Macintosh, Lauren Switzer, Darcy Fehlings, and T.C. Nicholas Graham. 2017. How Game Balancing Affects Play: Player Adaptation in an Exergame for Children with Cerebral Palsy. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 699–710. https://doi.org/10.1145/3064663.3064664",
      "doi": "10.1145/3064663.3064664"
    },
    {
      "text": "Daniel Johnson, M John Gardner, and Ryan Perry. 2018. Validation of two game experience scales: the player experience of need satisfaction (PENS) and game experience questionnaire (GEQ). International Journal of Human-Computer Studies 118 (2018), 38–46.",
      "doi": ""
    },
    {
      "text": "Hee-Tae Jung, Taiwoo Park, Narges MAhyar, Sungji Park, Taekyeong Ryu, Yangsoo Kim, and Sunghoon Ivan Lee. 2020. Rehabilitation Games in Real-World Clinical Settings: Practices, Challenges, and Opportunities. ACM Trans. Comput.-Hum. Interact. 27, 6, Article 41 (nov 2020), 43 pages. https://doi.org/10.1145/3418197",
      "doi": "10.1145/3418197"
    },
    {
      "text": "Shaun K. Kane, Anhong Guo, and Meredith Ringel Morris. 2020. Sense and Accessibility: Understanding People with Physical Disabilities’ Experiences with Sensing Systems. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 42, 14 pages. https://doi.org/10.1145/3373625.3416990",
      "doi": "10.1145/3373625.3416990"
    },
    {
      "text": "Pamela M Kato. 2010. Video games in health care: Closing the gap. Review of general psychology 14, 2 (2010), 113–121.",
      "doi": ""
    },
    {
      "text": "Fares Kayali, Naemi Luckner, Peter Purgathofer, Katta Spiel, and Geraldine Fitzpatrick. 2018. Design Considerations towards Long-Term Engagement in Games for Health. In Proceedings of the 13th International Conference on the Foundations of Digital Games (Malmö, Sweden) (FDG ’18). Association for Computing Machinery, New York, NY, USA, Article 35, 8 pages. https://doi.org/10.1145/3235765.3235789",
      "doi": "10.1145/3235765.3235789"
    },
    {
      "text": "Marc-André K Lafrenière, Jérémie Verner-Filion, and Robert J Vallerand. 2012. Development and validation of the Gaming Motivation Scale (GAMS). Personality and individual differences 53, 7 (2012), 827–831.",
      "doi": ""
    },
    {
      "text": "Li Li and Dennis Moore. 1998. Acceptance of disability and its correlates. The Journal of social psychology 138, 1 (1998), 13–25.",
      "doi": ""
    },
    {
      "text": "Keith Lohse, Navid Shirzad, Alida Verster, Nicola Hodges, and HF Machiel Van der Loos. 2013. Video games and rehabilitation: using design principles to enhance engagement in physical therapy. Journal of Neurologic Physical Therapy 37, 4 (2013), 166–175.",
      "doi": ""
    },
    {
      "text": "Eugène Loos and Annemiek Zonneveld. 2016. Silver Gaming: Serious Fun for Seniors?. In Human Aspects of IT for the Aged Population. Healthy and Active Aging, Jia Zhouand Gavriel Salvendy (Eds.). Springer International Publishing, Cham, 330–341.",
      "doi": ""
    },
    {
      "text": "Niall Maclean, Pandora Pound, C Wolfe, A Rudd, 2000. A critical review of the concept of patient motivation in the literature on physical rehabilitation. Soc Sci Med 50, 4 (2000), 495–506.",
      "doi": ""
    },
    {
      "text": "Annette Majnemer, Keiko Shikako-Thomas, Lucy Lach, Michael Shevell, Mary Law, and Norbert Schmitz. 2013. Mastery Motivation in Adolescents with Cerebral Palsy. Research in Developmental Disabilities 34, 10 (2013), 3384–3392. https://doi.org/10.1016/j.ridd.2013.07.002",
      "doi": ""
    },
    {
      "text": "Mitchell McEwan, Cody Phillips, Peta Wyeth, and Daniel Johnson. 2020. Puppy Island: Theory-Driven Design of a Serious Game for Young Children with Cystic Fibrosis. In Proceedings of the Interaction Design and Children Conference (London, United Kingdom) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 532–540. https://doi.org/10.1145/3392063.3394435",
      "doi": "10.1145/3392063.3394435"
    },
    {
      "text": "Pieter Meyns, Tine Roman de Mettelinge, Judith van der Spank, Marieke Coussens, and Hilde Van Waelvelde. 2018. Motivation in Pediatric Motor Rehabilitation: A Systematic Search of the Literature Using the Self-Determination Theory as a Conceptual Framework. Developmental Neurorehabilitation 21, 6 (2018), 371–390. https://doi.org/10.1080/17518423.2017.1295286",
      "doi": ""
    },
    {
      "text": "Jeanne Nakamura and Mihaly Csikszentmihalyi. 2014. The Concept of Flow. Springer Netherlands, Dordrecht, 239–263. https://doi.org/10.1007/978-94-017-9088-8_16",
      "doi": ""
    },
    {
      "text": "Linda Nguyen, Andrea Cross, Peter Rosenbaum, and Jan Willem Gorter. 2021. Use of the International Classification of Functioning, Disability and Health to support goal-setting practices in pediatric rehabilitation: a rapid review of the literature. Disability and Rehabilitation 43, 6 (2021), 884–894.",
      "doi": ""
    },
    {
      "text": "Nikos Ntoumanis and Martyn Standage. 2009. Motivation in physical education classes: A self-determination theory perspective. Theory and research in education 7, 2 (2009), 194–202.",
      "doi": ""
    },
    {
      "text": "Manuel Pezzera and N. Alberto Borghese. 2020. Dynamic difficulty adjustment in exer-games for rehabilitation: a mixed approach. In 2020 IEEE 8th International Conference on Serious Games and Applications for Health (SeGAH). 1–7. https://doi.org/10.1109/SeGAH49190.2020.9201871",
      "doi": ""
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2020. Enemy within: Long-term motivation effects of deep player behavior models for dynamic difficulty adjustment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3313831.3376423"
    },
    {
      "text": "Michele Pirovano, Renato Mainetti, Gabriel Baud-Bovy, Pier Luca Lanzi, and Nunzio Alberto Borghese. 2012. Self-adaptive games for rehabilitation at home. In 2012 IEEE Conference on Computational Intelligence and Games (CIG). IEEE, 179–186.",
      "doi": ""
    },
    {
      "text": "Leslie Podlog, John Heil, and Stefanie Schulte. 2014. Psychosocial factors in sports injury rehabilitation and return to play. Physical Medicine and Rehabilitation Clinics 25, 4 (2014), 915–930.",
      "doi": ""
    },
    {
      "text": "Anne A. Poulsen, Sylvia Rodger, and Jenny M. Ziviani. 2006. Understanding Children’s Motivation from a Self-Determination Theoretical Perspective: Implications for Practice. Australian Occupational Therapy Journal 53, 2 (2006), 78–86. https://doi.org/10.1111/j.1440-1630.2006.00569.x",
      "doi": ""
    },
    {
      "text": "Brian A. Primack, Mary V. Carroll, Megan McNamara, Mary Lou Klem, Brandy King, Michael Rich, Chun W. Chan, and Smita Nayak. 2012. Role of Video Games in Improving Health-Related Outcomes: A Systematic Review. American Journal of Preventive Medicine 42, 6 (2012), 630–638.",
      "doi": ""
    },
    {
      "text": "B Rabin, G Burdea, J Hundal, D Roll, and F Damiani. 2011. Integrative motor, emotive and cognitive therapy for elderly patients chronic post-stroke A feasibility study of the BrightArm™ rehabilitation system. In 2011 International Conference on Virtual Rehabilitation. IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Rachel Jane Rahman, Joanne Hudson, Cecilie Thøgersen-Ntoumani, and Jonathan H. Doust. 2015. Motivational processes and well-being in cardiac rehabilitation: a self-determination theory perspective. Psychology, Health & Medicine 20, 5 (2015), 518–529. https://doi.org/10.1080/13548506.2015.1017509 arXiv:https://doi.org/10.1080/13548506.2015.1017509PMID: 25753948.",
      "doi": ""
    },
    {
      "text": "Johnmarshall Reeve. 2006. Teachers as Facilitators: What Autonomy‐Supportive Teachers Do and Why Their Students Benefit. The Elementary School Journal 106, 3 (2006), 225–236. https://doi.org/10.1086/501484 arXiv:https://doi.org/10.1086/501484",
      "doi": ""
    },
    {
      "text": "Ryan E Rhodes and Bonnie Fiala. 2009. Building motivation and sustainability into the prescription and recommendations for physical activity and exercise therapy: the evidence. Physiotherapy theory and practice 25, 5-6 (2009), 424–441.",
      "doi": ""
    },
    {
      "text": "Chad Richards and T.C. Nicholas Graham. 2016. Developing Compelling Repetitive-Motion Exergames by Balancing Player Agency with the Constraints of Exercise. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 911–923. https://doi.org/10.1145/2901790.2901824",
      "doi": "10.1145/2901790.2901824"
    },
    {
      "text": "Ronald W Rogers and Steven Prentice-Dunn. 1997. Protection motivation theory.(1997).",
      "doi": ""
    },
    {
      "text": "Shari A Rone-Adams, Debra F Stern, and Vicki Walker. 2004. Stress and compliance with a home exercise program among caregivers of children with disabilities. Pediatric physical therapy 16, 3 (2004), 140–148.",
      "doi": ""
    },
    {
      "text": "Peter Rosenbaum, Nigel Paneth, Alan Leviton, Murray Goldstein, Martin Bax, Diane Damiano, Bernard Dan, Bo Jacobsson, 2007. A report: The Definition and Classification of Cerebral Palsy April 2006. Dev Med Child Neurol Suppl. 109, suppl 109 (2007), 8–14.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. The Darker and Brighter Sides of Human Existence: Basic Psychological Needs as a Unifying Concept. Psychological Inquiry 11, 4 (2000), 319–338. https://doi.org/10.1207/S15327965PLI1104_03",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Intrinsic and Extrinsic Motivations: Classic Definitions and New Directions. Contemporary Educational Psychology 25, 1 (2000), 54–67. https://doi.org/10.1006/ceps.1999.1020",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Self-Determination Theory and the Facilitation of Intrinsic Motivation, Social Development, and Well-Being. American Psychologist 55, 1 (2000), 68–78. https://doi.org/10.1037/0003-066X.55.1.68",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2017. Self-determination theory: Basic psychological needs in motivation, development, and wellness.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4 (2006), 344–360. https://doi.org/10.1007/s11031-006-9051-8 The IMI items are available online under: http://selfdeterminationtheory.org/intrinsic-motivation-inventory/. Accessed: 09.09.2022.",
      "doi": ""
    },
    {
      "text": "Martin Saebu, Marit Sørensen, and Hallgeir Halvari. 2013. Motivation for physical activity in young adults with physical disabilities during a rehabilitation stay: a longitudinal test of self-determination theory. Journal of Applied Social Psychology 43, 3 (2013), 612–625. https://doi.org/10.1111/j.1559-1816.2013.01042.x",
      "doi": ""
    },
    {
      "text": "Joseph P Salisbury, Ted M Aronson, and Tony J Simon. 2020. At-home self-administration of an immersive virtual reality therapeutic game for post-stroke upper limb rehabilitation. In Extended abstracts of the 2020 annual symposium on computer-human interaction in play. 114–121.",
      "doi": ""
    },
    {
      "text": "Adrian L. Jessup Schneider, Kathy Keiver, Alison Pritchard Orr, James N. Reynolds, Neven Golubovich, and T.C. Nicholas Graham. 2020. Toward the Design of Enjoyable Games for Children with Fetal Alcohol Spectrum Disorder. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376480",
      "doi": "10.1145/3313831.3376480"
    },
    {
      "text": "Emmy M Sluijs, Gerjo J Kok, and Jouke van der Zee. 1993. Correlates of Exercise Compliance in Physical Therapy. Physical Therapy 73, 11 (11 1993), 771–782. https://doi.org/10.1093/ptj/73.11.771 arXiv:https://academic.oup.com/ptj/article-pdf/73/11/771/10760180/ptj0771.pdf",
      "doi": ""
    },
    {
      "text": "Jan David Smeddinck, Marc Herrlich, and Rainer Malaka. 2015. Exergames for Physiotherapy and Rehabilitation: A Medium-Term Situated Study of Motivational Aspects and Impact on Functional Reach. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 4143–4146. https://doi.org/10.1145/2702123.2702598",
      "doi": "10.1145/2702123.2702598"
    },
    {
      "text": "Alexander Streicher and Jan D Smeddinck. 2016. Personalized and adaptive serious games. In Entertainment computing and serious games. Springer, 332–377.",
      "doi": ""
    },
    {
      "text": "Pedro J Teixeira, Eliana V Carraça, David Markland, Marlene N Silva, and Richard M Ryan. 2012. Exercise, physical activity, and self-determination theory: a systematic review. International journal of behavioral nutrition and physical activity 9, 1(2012), 1–30.",
      "doi": ""
    },
    {
      "text": "April Tyack and Elisa D. Mekler. 2020. Self-Determination Theory in HCI Games Research: Current Uses and Open Questions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–22. https://doi.org/10.1145/3313831.3376723",
      "doi": "10.1145/3313831.3376723"
    },
    {
      "text": "Stephen Uzor and Lynne Baillie. 2019. Recov-R: evaluation of a home-based tailored exergame system to reduce fall risk in seniors. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 4(2019), 1–38.",
      "doi": "10.1145/3325280"
    },
    {
      "text": "Gabriela Villalobos-Zúñiga, Iyubanit Rodríguez, Anton Fedosov, and Mauro Cherubini. 2021. Informed Choices, Progress Monitoring and Comparison with Peers: Features to Support the Autonomy, Competence and Relatedness Needs, as Suggested by the Self-Determination Theory. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction (Toulouse & Virtual, France) (MobileHCI ’21). Association for Computing Machinery, New York, NY, USA, Article 13, 14 pages. https://doi.org/10.1145/3447526.3472039",
      "doi": "10.1145/3447526.3472039"
    },
    {
      "text": "Jenny Ziviani. 2015. Occupational Performance: A Case for Self-Determination. Australian Occupational Therapy Journal 62, 6 (2015), 393–400. https://doi.org/10.1111/1440-1630.12250",
      "doi": ""
    }
  ]
}