{
  "doi": "10.1145/3544548.3581533",
  "title": "Understanding Discussions Around Culture Within Courses Covering Topics on Accessibility and Disability at U.S. Universities",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Teaching accessibility is essential in training technologists and designers. However, the topics of accessibility and disability are vast and intersect with culture (social constructions). Since cultural background is an influential factor in design decisions, which could have implications for accessible design, we wanted to understand whether and how courses at U.S. institutions address the importance of cultural influences when teaching accessibility and disability topics. We surveyed 72 students from U.S. institutions and ran 14 follow-up interviews with students who took technical and non-technical courses. Using reflexive thematic analysis, we found similarities and differences in how technical and non-technical courses approach accessibility teaching. We found a lack of cultural focus in accessibility teaching in the technical courses, which can be improved by adopting teaching approaches from non-technical courses. We also make recommendations to improve course design, such as including people from different cultures and disabilities to help develop courses.",
  "tags": [
    "Accessibility Education",
    "Disability Studies",
    "Culture"
  ],
  "authors": [
    {
      "name": "Laleh Nourian",
      "institution": "Department of Computing and Information Sciences, Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660608977",
      "orcid": "0000-0002-5214-794X"
    },
    {
      "name": "Kristen Shinohara",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319501668",
      "orcid": "0000-0002-1157-6369"
    },
    {
      "name": "Garreth W. Tigwell",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659067691/rel-imgonly/img_20170512_13473021.09.44.jpg",
      "acmid": "99659067691",
      "orcid": "0000-0002-3123-6361"
    }
  ],
  "references": [
    {
      "text": "Sarah Andrew and Garreth W Tigwell. 2022. Accessible Design is Mediated by Job Support Structures and Knowledge Gained Through Design Career Pathways. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–24. https://doi.org/10.1145/3555588",
      "doi": "10.1145/3555588"
    },
    {
      "text": "Susan Baglieri, Jan W Valle, David J Connor, and Deborah J Gallagher. 2011. Disability studies in education: The need for a plurality of perspectives on disability. Remedial and special education 32, 4 (2011), 267–278. https://doi.org/10.1177/0741932510362200",
      "doi": ""
    },
    {
      "text": "Catherine M Baker, Yasmine N El-Glaly, and Kristen Shinohara. 2020. A systematic analysis of accessibility in computing education research. In Proceedings of the 51st ACM Technical Symposium on Computer Science Education. 107–113. https://doi.org/10.1145/3328778.3366843",
      "doi": "10.1145/3328778.3366843"
    },
    {
      "text": "Giulia Barbareschi, Norah Shitawa Kopi, Ben Oldfrey, and Catherine Holloway. 2021. What Difference Does Tech Make? Conceptualizations of Disability and Assistive Technology among Kenyan Youth: Conceptualizations of Disability and AT. In Proceedings of the 23rd International ACM SIGACCESS Conference on Computers and Accessibility(Virtual Event, USA) (ASSETS ’21). Association for Computing Machinery, New York, NY, USA, Article 18, 13 pages. https://doi.org/10.1145/3441852.3471226",
      "doi": "10.1145/3441852.3471226"
    },
    {
      "text": "Giulia Barbareschi, Manohar Swaminathan, Andre Pimenta Freire, and Catherine Holloway. 2021. Challenges and Strategies for Accessibility Research in the Global South: A Panel Discussion. In X Latin American Conference on Human Computer Interaction (Valparaiso, Chile) (CLIHC 2021). Association for Computing Machinery, New York, NY, USA, Article 20, 5 pages. https://doi.org/10.1145/3488392.3488412",
      "doi": "10.1145/3488392.3488412"
    },
    {
      "text": "John W Blake. 2019. Using Stories of Technology to Teach Technological and Engineering Literacy in Courses for Majors. In 2019 ASEE Annual Conference & Exposition. https://doi.org/10.18260/1-2–33518",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative research in sport, exercise and health 11, 4 (2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern-based qualitative analytic approaches. Counselling and Psychotherapy Research 21, 1 (2021), 37–47. https://doi.org/10.1002/capr.12360",
      "doi": ""
    },
    {
      "text": "Ewa Callahan. 2005. Cultural Similarities and Differences in the Design of University Web sites. Journal of Computer-Mediated Communication 11, 1 (07 2005), 239–273. https://doi.org/10.1111/j.1083-6101.2006.tb00312.x",
      "doi": ""
    },
    {
      "text": "Apala Lahiri Chavan. 2005. Another culture, another method. In Proceedings of the 11th International Conference on Human-Computer Interaction, Vol. 21. Erlbaum Mahwah, NJ. https://humanfactors.com/downloads/whitepapers/another-culture-another-method.pdf",
      "doi": ""
    },
    {
      "text": "Michael Crabb, Michael Heron, Rhianne Jones, Mike Armstrong, Hayley Reid, and Amy Wilson. 2019. Developing Accessible Services: Understanding Current Knowledge and Areas for Future Support. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300446",
      "doi": "10.1145/3290605.3300446"
    },
    {
      "text": "Dianne Cyr, Milena Head, and Hector Larios. 2010. Colour appeal in website design within and across cultures: A multi-method evaluation. International journal of human-computer studies 68, 1 (2010), 1–21. https://doi.org/10.1016/j.ijhcs.2009.08.005",
      "doi": "10.1016/j.ijhcs.2009.08.005"
    },
    {
      "text": "Dianne Cyr and Haizley Trevor-Smith. 2004. Localization of Web design: An empirical comparison of German, Japanese, and United States Web site characteristics. Journal of the American society for information science and technology 55, 13 (2004), 1199–1208. https://doi.org/10.1002/asi.20075",
      "doi": ""
    },
    {
      "text": "Dana Donohue and Juan Bornman. 2014. The challenges of realising inclusive education in South Africa. South African journal of education 34, 2 (2014). https://www.ajol.info/index.php/saje/article/view/105550",
      "doi": ""
    },
    {
      "text": "Maha El-Shinnawy and Ajay S Vinze. 1997. Technology, culture and persuasiveness: a study of choice-shifts in group settings. International Journal of Human-Computer Studies 47, 3 (1997), 473–496. https://doi.org/10.1006/ijhc.1997.0138",
      "doi": "10.1006/ijhc.1997.0138"
    },
    {
      "text": "Vanessa Evers and Donald Day. 1997. The Role of Culture in Interface Acceptance. In Proceedings of the IFIP TC13 Interantional Conference on Human-Computer Interaction(INTERACT ’97). Chapman & amp; Hall, Ltd., GBR, 260–267.",
      "doi": "10.5555/647403.723539"
    },
    {
      "text": "Mexhid Ferati and Bahtijar Vogel. 2020. Accessibility in Web Development Courses: A Case Study. Informatics 7, 1 (2020). https://doi.org/10.3390/informatics7010008",
      "doi": ""
    },
    {
      "text": "Yulia Goldenberg and Noam Tractinsky. 2021. Towards the Right Direction in BiDirectional User Interfaces. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 149, 13 pages. https://doi.org/10.1145/3411764.3445461",
      "doi": "10.1145/3411764.3445461"
    },
    {
      "text": "Yulia Goldenberg and Noam Tractinsky. 2022. Prioritizing UI Items for Bidirectional Design System Development: A Suggested Set of Criteria and Its Implementation(CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 340, 8 pages. https://doi.org/10.1145/3491101.3519868",
      "doi": "10.1145/3491101.3519868"
    },
    {
      "text": "Wakaba Hamamatsu, Maimi Hoshi, Mieko Nakagawa, and Kuniomi Shibata. 2020. Improving Web accessibility on a website for screen reader users and people who need the ruby element on each Kanji–. IEICE Technical Report; IEICE Tech. Rep. 120, 198 (2020), 1–6. https://ken.ieice.org/ken/paper/20201022JCAy/eng/",
      "doi": ""
    },
    {
      "text": "Chen Hao, Annemiek van Boeijen, and Pieter Jan Stappers. 2019. Cultura: A communication toolkit for designers to gain empathic insights across cultural boundaries. Design Discourse on Culture and Society: Re: Research, Volume 5 5 (2019), 3. https://doi.org/10.7945/C2SD5J",
      "doi": ""
    },
    {
      "text": "Pamela Hinds and Katharina Reinecke. 2014. Advancing Methodologies for Cross- Cultural Studies of Collaborative Systems. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW Companion ’14). Association for Computing Machinery, New York, NY, USA, 323–326. https://doi.org/10.1145/2556420.2558856",
      "doi": "10.1145/2556420.2558856"
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L Bennett. 2020. Living Disability Theory: Reflections on Access, Research, and Design. In Proceedings of the 22nd International ACM SIGACCESS Conference on Computers and Accessibility(Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 4, 13 pages. https://doi.org/10.1145/3373625.3416996",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. Association for Computing Machinery, New York, NY, USA, 1311–1320. https://doi.org/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Donna Kain and Elizabeth Wardle. 2005. Building context: Using activity theory to teach about genre in multi-major professional communication courses. Technical Communication Quarterly 14, 2 (2005), 113–139. https://doi.org/10.1207/s15427625tcq1402_1",
      "doi": ""
    },
    {
      "text": "Devva Kasnitz and Russell P Shuttleworth. 2001. Anthropology and disability studies. Semiotics and dis/ability: Interrogating categories of difference (2001), 19–41. https://dsq-sds.org/article/view/289/327",
      "doi": ""
    },
    {
      "text": "Saba Kawas, Laura Vonessen, and Amy J. Ko. 2019. Teaching Accessibility: A Design Exploration of Faculty Professional Development at Scale. In Proceedings of the 50th ACM Technical Symposium on Computer Science Education(SIGCSE ’19). Association for Computing Machinery, New York, NY, USA, 983–989. https://doi.org/10.1145/3287324.3287399",
      "doi": "10.1145/3287324.3287399"
    },
    {
      "text": "Julie Khaslavsky. 1998. Integrating Culture into Interface Design. In CHI 98 Conference Summary on Human Factors in Computing Systems(CHI ’98). Association for Computing Machinery, New York, NY, USA, 365–366. https://doi.org/10.1145/286498.286830",
      "doi": "10.1145/286498.286830"
    },
    {
      "text": "Ji Hye Kim and Kun Pyo Lee. 2005. Cultural Difference and Mobile Phone Interface Design: Icon Recognition According to Level of Abstraction. In Proceedings of the 7th International Conference on Human Computer Interaction with Mobile Devices & Services(MobileHCI ’05). Association for Computing Machinery, New York, NY, USA, 307–310. https://doi.org/10.1145/1085777.1085841",
      "doi": "10.1145/1085777.1085841"
    },
    {
      "text": "Andrew Kirkpatrick, Joshue O’Connor, Alastair Campbell, and Michael Cooper. 2018. Web Content Accessibility Guidelines (WCAG) 2.1. https://www.w3.org/TR/WCAG21/. Accessed: 2022-12-08.",
      "doi": ""
    },
    {
      "text": "Anett Kralisch and Bettina Berendt. 2004. Cultural Determinants of Search Behaviour on Websites.. In IWIPS 2004 Conference on Culture, Trust, and Design Innovation. Vancouver. 61–75. https://usj.edu.lb/moodle/stephane.bazan/obs_interculturelle/kralisch_berendt_IWIPS2004_to_appear.pdf",
      "doi": ""
    },
    {
      "text": "Anett Kralisch, Martin Eisend, and Bettina Berendt. 2005. The impact of culture on website navigation behaviour. In Proc. HCI-International. 1–9. https://people.cs.kuleuven.be/ bettina.berendt/Papers/kralisch_berendt_eisend_2005.pdf",
      "doi": ""
    },
    {
      "text": "John Krupczak and David Ollis. 2006. Technological Literacy And Engineering For Non Engineers: Lessons From Successful Courses.. In 2006 Annual Conference & Exposition. ASEE Conferences, Chicago, Illinois. https://strategy.asee.org/422",
      "doi": ""
    },
    {
      "text": "John Krupczak and David Ollis. 2008. Technology Courses for Undergraduates: Developing Standard Models. In 2008 Annual Conference & Exposition. 13–1188. https://doi.org/10.18260/1-2–3507",
      "doi": ""
    },
    {
      "text": "Ming-Mu Kuo and Cheng-Chieh Lai. 2006. Linguistics across Cultures: The Impact of Culture on Second Language Learning.Online Submission 1, 1 (2006). https://eric.ed.gov/?id=ED496079",
      "doi": ""
    },
    {
      "text": "Junchen Li, Garreth W. Tigwell, and Kristen Shinohara. 2021. Accessibility of High-Fidelity Prototyping Tools. In CHI Conference on Human Factors in Computing Systems (CHI ’21)(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445520",
      "doi": "10.1145/3411764.3445520"
    },
    {
      "text": "Stephanie Ludi, Matt Huenerfauth, Vicki Hanson, Nidhi Rajendra Palan, and Paula Conn. 2018. Teaching Inclusive Thinking to Undergraduate Students in Computing Programs. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education (Baltimore, Maryland, USA) (SIGCSE ’18). Association for Computing Machinery, New York, NY, USA, 717–722. https://doi.org/10.1145/3159450.3159512",
      "doi": "10.1145/3159450.3159512"
    },
    {
      "text": "Kelly Mack, Emma McDonnell, Dhruv Jain, Lucy Lu Wang, Jon E. Froehlich, and Leah Findlater. 2021. What Do We Mean by “Accessibility Research”? A Literature Survey of Accessibility Papers in CHI and ASSETS from 1994 to 2019. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445412",
      "doi": "10.1145/3411764.3445412"
    },
    {
      "text": "Jennifer Mankoff, Gillian R. Hayes, and Devva Kasnitz. 2010. Disability Studies as a Source of Critical Inquiry for the Field of Assistive Technology. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility (Orlando, Florida, USA) (ASSETS ’10). Association for Computing Machinery, New York, NY, USA, 3–10. https://doi.org/10.1145/1878803.1878807",
      "doi": "10.1145/1878803.1878807"
    },
    {
      "text": "Grace Mbipom and Simon Harper. 2011. The Interplay between Web Aesthetics and Accessibility. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility(Dundee, Scotland, UK) (ASSETS ’11). Association for Computing Machinery, New York, NY, USA, 147–154. https://doi.org/10.1145/2049536.2049564",
      "doi": "10.1145/2049536.2049564"
    },
    {
      "text": "Catherine Jane McAllister, Claire Louise Kelly, Katherine Elizabeth Manning, and Anthony John Holland. 2013. Participant experience of invasive research in adults with intellectual disability. Journal of Medical Ethics 39, 9 (2013), 594–597. https://doi.org/10.1136/medethics-2012-101077",
      "doi": ""
    },
    {
      "text": "Rachel Menzies, Garreth W. Tigwell, Mandar Tamhane, and Annalu Waller. 2019. Weaving Accessibility Through an Undergraduate Degree. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 526–529. https://doi.org/10.1145/3308561.3354611",
      "doi": "10.1145/3308561.3354611"
    },
    {
      "text": "Carlyn O Mueller. 2021. “I Didn’t Know People With Disabilities Could Grow Up to Be Adults”: Disability History, Curriculum, and Identity in Special Education. Teacher Education and Special Education 44, 3 (2021), 189–205. https://doi.org/10.1177/0888406421996069",
      "doi": ""
    },
    {
      "text": "Singh Nitish, Zhao Hongxin, and Hu Xiaorui. 2005. Analyzing the cultural content of web sites: A cross‐national comparision of China, India, Japan, and US. 22, 2 (2005), 129–146. https://doi.org/10.1108/02651330510593241",
      "doi": ""
    },
    {
      "text": "Laleh Nourian, Kristen Shinohara, and Garreth Tigwell. 2022. Digital Accessibility in Iran: An Investigation Focusing on Iran’s National Policies on Accessibility and Disability Support. In The 24th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’22), October 23–26, 2022, Athens, Greece. New York, NY, USA. https://doi.org/10.1145/3517428.3550385",
      "doi": "10.1145/3517428.3550385"
    },
    {
      "text": "Chioma Ohajunwa, Judith Mckenzie, and Theresa Lorenzo. 2015. Enabling disability inclusive practices within the University of Cape Town curriculum: A case study. African Journal of Disability 4, 1 (2015). https://doi.org/10.4102/ajod.v4i1.157",
      "doi": ""
    },
    {
      "text": "Helina Oladapo, Eric Owusu, and Joyram Chakraborty. 2021. Effects of culturally tailored user interface design. In International Conference on Applied Human Factors and Ergonomics. Springer, 845–853. https://doi.org/10.1007/978-3-030-80091-8_100",
      "doi": ""
    },
    {
      "text": "Patrick Parrish and Jennifer Linder-VanBerschot. 2010. Cultural Dimensions of Learning: Addressing the Challenges of Multicultural Instruction. International Review of Research in Open and Distance Learning 11 (05 2010). https://doi.org/10.19173/irrodl.v11i2.809",
      "doi": ""
    },
    {
      "text": "Rohan Patel, Pedro Breton, Catherine M. Baker, Yasmine N. El-Glaly, and Kristen Shinohara. 2020. Why Software is Not Accessible: Technology Professionals’ Perspectives and Challenges. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3383103",
      "doi": "10.1145/3334480.3383103"
    },
    {
      "text": "Neeraja Ravindran and Barbara J Myers. 2012. Cultural influences on perceptions of health, illness, and disability: A review and focus on autism. Journal of child and family studies 21, 2 (2012), 311–319. https://doi.org/10.1007/s10826-011-9477-9",
      "doi": ""
    },
    {
      "text": "Allison Ruby Reid-Cunningham. 2009. Anthropological theories of disability. Journal of human behavior in the social environment 19, 1(2009), 99–111. https://doi.org/10.1080/10911350802631644",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Abraham Bernstein. 2011. Improving Performance, Perceived Usability, and Aesthetics with Culturally Adaptive User Interfaces. ACM Trans. Comput.-Hum. Interact. 18, 2 (July 2011). https://doi.org/10.1145/1970378.1970382",
      "doi": "10.1145/1970378.1970382"
    },
    {
      "text": "Katharina Reinecke and Abraham Bernstein. 2013. Knowing What a User Likes: A Design Science Approach to Interfaces that Automatically Adapt to Culture. MIS Quarterly 37, 2 (2013), 427–453. http://www.jstor.org/stable/43825917",
      "doi": "10.25300/MISQ/2013/37.2.06"
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z. Gajos. 2014. Quantifying Visual Preferences around the World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 11–20. https://doi.org/10.1145/2556288.2557052",
      "doi": "10.1145/2556288.2557052"
    },
    {
      "text": "Katharina Reinecke, Minh Khoa Nguyen, Abraham Bernstein, Michael Näf, and Krzysztof Z. Gajos. 2013. Doodle around the World: Online Scheduling Behavior Reflects Cultural Differences in Time Perception and Group Decision-Making. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work(CSCW ’13). Association for Computing Machinery, New York, NY, USA, 45–54. https://doi.org/10.1145/2441776.2441784",
      "doi": "10.1145/2441776.2441784"
    },
    {
      "text": "John Reisel. 2022. An Approach for Engineering Curriculum Revision to Increase Coverage of Non-Technical Subjects. In 2022 ASEE Annual Conference & Exposition. https://strategy.asee.org/40518",
      "doi": ""
    },
    {
      "text": "Anne Spencer Ross, Xiaoyi Zhang, James Fogarty, and Jacob O. Wobbrock. 2017. Epidemiology as a Framework for Large-Scale Mobile Application Accessibility Assessment. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 2–11. https://doi.org/10.1145/3132525.3132547",
      "doi": "10.1145/3132525.3132547"
    },
    {
      "text": "Patricia Russo and Stephen Boor. 1993. How Fluent is Your Interface? Designing for International Users. In Proceedings of the INTERACT ’93 and CHI ’93 Conference on Human Factors in Computing Systems(CHI ’93). Association for Computing Machinery, New York, NY, USA, 342–347. https://doi.org/10.1145/169059.169274",
      "doi": "10.1145/169059.169274"
    },
    {
      "text": "Janette Ryan. 2005. Improving teaching and learning practices for international students. Teaching international students: Improving learning for all (2005), 92–100. https://doi.org/10.4324/9780203696132",
      "doi": ""
    },
    {
      "text": "Andrew Sears and Vicki Hanson. 2011. Representing Users in Accessibility Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2235–2238. https://doi.org/10.1145/1978942.1979268",
      "doi": "10.1145/1978942.1979268"
    },
    {
      "text": "Ather Sharif, Aedan Liam McCall, and Kianna Roces Bolante. 2022. Should I Say “Disabled People” or “People with Disabilities”? Language Preferences of Disabled People Between Identity- and Person-First Language. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility (Athens, Greece) (ASSETS ’22). Association for Computing Machinery, New York, NY, USA, Article 10, 18 pages. https://doi.org/10.1145/3517428.3544813",
      "doi": "10.1145/3517428.3544813"
    },
    {
      "text": "Kristen Shinohara, Cynthia L Bennett, Jacob O Wobbrock, and Wanda Pratt. 2017. Teaching accessibility in a technology design course. In Making a Difference: Prioritizing Equity and Access in CSCL, 12th International Conference on Computer Supported Collaborative Learning (CSCL) 2017, Vol. 1. Philadelphia, PA: International Society of the Learning Sciences.https://repository.isls.org//handle/1/237",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Saba Kawas, Amy J. Ko, and Richard E. Ladner. 2018. Who Teaches Accessibility? A Survey of U.S. Computing Faculty. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education(SIGCSE ’18). Association for Computing Machinery, New York, NY, USA, 197–202. https://doi.org/10.1145/3159450.3159484",
      "doi": "10.1145/3159450.3159484"
    },
    {
      "text": "Jaisie Sin, Rachel L. Franz, Cosmin Munteanu, and Barbara Barbosa Neves. 2021. Digital Design Marginalization: New Perspectives on Designing Inclusive Interfaces. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 380, 11 pages. https://doi.org/10.1145/3411764.3445180",
      "doi": "10.1145/3411764.3445180"
    },
    {
      "text": "Jaisie Sin, Cosmin Munteanu, Michael Nixon, Velian Pandeliev, Garreth Tigwell, Kristen Shinohara, Anthony Tang, and Steve Szigeti. 2022. Uncovering inclusivity gaps in design pedagogy through the digital design marginalization framework. Frontiers in Computer Science(2022), 91. https://doi.org/10.3389/fcomp.2022.822090",
      "doi": ""
    },
    {
      "text": "Robin M Smith, Deborah Gallagher, Valerie Owen, and Thomas M Skrtic. 2009. Disability studies in education: Guidelines and ethical practice for educators. In Social justice, peace, and environmental education. Routledge, 247–263. https://doi.org/10.4324/9780203879429",
      "doi": ""
    },
    {
      "text": "Helen Spencer-Oatey and Peter Franklin. 2012. What is culture. A compilation of quotations. GlobalPAD Core Concepts 1 (2012), 22. https://warwick.ac.uk/fac/soc/al/globalpad-rip/openhouse/interculturalskills_old/core_concept_compilations/global_pad_-_what_is_culture.pdf",
      "doi": ""
    },
    {
      "text": "Huatong Sun. 2001. Building a Culturally-Competent Corporate Web Site: An Exploratory Study of Cultural Markers in Multilingual Web Design. In Proceedings of the 19th Annual International Conference on Computer Documentation (Sante Fe, New Mexico, USA) (SIGDOC ’01). Association for Computing Machinery, New York, NY, USA, 95–102. https://doi.org/10.1145/501516.501536",
      "doi": "10.1145/501516.501536"
    },
    {
      "text": "David Swallow, Christopher Power, Helen Petrie, Anna Bramwell-Dicks, Lucy Buykx, Carlos A Velasco, Aidan Parr, and Joshue O Connor. 2014. Speaking the Language of Web Developers: Evaluation of a Web Accessibility Information Resource (WebAIR). In International Conference on Computers for Handicapped Persons. Springer, 348–355. https://doi.org/10.1007/978-3-319-08596-8_54",
      "doi": ""
    },
    {
      "text": "Pinyan Tang, Glyn Lawson, Xu Sun, and Sarah Sharples. 2022. Probing cultural differences in product design and consumer evaluation using repertory grid analysis. International Journal of Technology and Design Education 32, 3(2022), 1875–1894. https://doi.org/10.1007/s10798-021-09663-9",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell. 2021. Nuanced Perspectives Toward Disability Simulations from Digital Designers, Blind, Low Vision, and Color Blind People. In CHI Conference on Human Factors in Computing Systems (CHI ’21)(CHI ’21). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445620",
      "doi": "10.1145/3411764.3445620"
    },
    {
      "text": "Garreth W. Tigwell, David R. Flatla, and Neil D. Archibald. 2017. ACE: A Colour Palette Design Tool for Balancing Aesthetics and Accessibility. ACM Trans. Access. Comput. 9, 2 (Jan. 2017). https://doi.org/10.1145/3014588",
      "doi": "10.1145/3014588"
    },
    {
      "text": "Garreth W. Tigwell, Rachel Menzies, and David R. Flatla. 2018. Designing for Situational Visual Impairments: Supporting Early-Career Designers of Mobile Content. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). Association for Computing Machinery, New York, NY, USA, 387–399. https://doi.org/10.1145/3196709.3196760",
      "doi": "10.1145/3196709.3196760"
    },
    {
      "text": "Garreth W. Tigwell, Kristen Shinohara, and Michael McQuaid. 2021. If You Don’t Build It, They Won’t Come: HCI has an Inaccessibility Problem. In Human Computer Interaction Consortium (HCIC)(HCIC ’21). 5. https://www.researchgate.net/publication/352262053_If_You_Don%27t_Build_It_They_Won%27t_Come_HCI_has_an_Inaccessibility_Problem",
      "doi": ""
    },
    {
      "text": "Sarah J. Tracy. 2013. Qualitative Research Methods: Collecting Evidence, Crafting Analysis, Communicating Impact. Wiley-Blackwell.",
      "doi": ""
    },
    {
      "text": "AGC Van Boeijen and ISJ Zijlstra. 2020. Culture Sensitive Design: A guide to culture in practice. BIS Publishers. https://research.tudelft.nl/en/publications/culture-sensitive-design-a-guide-to-culture-in-practice-2",
      "doi": ""
    },
    {
      "text": "Gregg Vanderheiden. 2000. Fundamental Principles and Priority Setting for Universal Usability. In Proceedings on the 2000 Conference on Universal Usability(CUU ’00). ACM, New York, NY, USA, 32–37. https://doi.org/10.1145/355460.355469",
      "doi": "10.1145/355460.355469"
    },
    {
      "text": "Beat Vollenwyder, Serge Petralito, Glena H Iten, Florian Brühlmann, Klaus Opwis, and Elisa D Mekler. 2022. How compliance with web accessibility standards shapes the experiences of users with and without disabilities. International Journal of Human-Computer Studies (2022), 102956. https://doi.org/10.1016/j.ijhcs.2022.102956",
      "doi": "10.1016/j.ijhcs.2022.102956"
    },
    {
      "text": "Cynthia D. Waddell. 2006. Worldwide Accessibility Laws and Policies. Apress, Berkeley, CA, 547–579. https://doi.org/10.1007/978-1-4302-0188-5_17",
      "doi": ""
    },
    {
      "text": "Anne Waldschmidt. 2018. Disability–Culture–Society: Strengths and weaknesses of a cultural model of dis/ability. Alter 12, 2 (2018), 65–78. https://doi.org/10.1016/j.alter.2018.04.003",
      "doi": ""
    },
    {
      "text": "Kristin Walker. 2002. Theoretical foundations for website design courses. Technical communication quarterly 11, 1 (2002), 61–83. https://doi.org/10.1207/s15427625tcq1101_3",
      "doi": ""
    },
    {
      "text": "Marcelo Worsley and David Bar-El. 2022. Inclusive Making: designing tools and experiences to promote accessibility and redefine making. Computer Science Education 32, 2 (2022), 155–187. https://doi.org/10.1080/08993408.2020.1863705",
      "doi": ""
    },
    {
      "text": "Qiwen Zhao, Vaishnavi Mande, Paula Conn, Sedeeq Al-khazraji, Kristen Shinohara, Stephanie Ludi, and Matt Huenerfauth. 2020. Comparison of Methods for Teaching Accessibility in University Computing Courses. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’20). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3373625.3417013",
      "doi": "10.1145/3373625.3417013"
    }
  ]
}