{
  "doi": "10.1145/3544548.3580664",
  "title": "\"What else can I do?\" Examining the Impact of Community Data on Adaptation and Quality of Reflection in an Educational Game",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2023,
  "badges": [],
  "abstract": "Adaptation, or ability and willingness to consider an alternative approach, is a critical component of learning through reflection, especially in educational games, where there are often multiple avenues to success. As a domain, educational games have shown increased interest in using retrospective visualizations to promote and support reflection. Such visualizations, which can facilitate comparison with peer data, may also have an impact on adaptation in educational games. This has, however, not been empirically examined within the domain. In this work, we examine how comparison with other players’ data influenced adaptation, a part of reflection, in the context of a game that teaches parallel programming. Our results indicate that comparison with peers does significantly impact willingness to try a different approach, but suggest that there may also be other ways. We discuss what these results mean for future use of retrospective visualizations in educational games and present opportunities for future work.",
  "authors": [
    {
      "name": "Erica Kleinman",
      "institution": "University of California, Santa Cruz, United States, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658745782",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Villareale",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659461569",
      "orcid": "0000-0002-7315-3601"
    },
    {
      "name": "Murtuza N. Shergadwala",
      "institution": "University of California, Santa Cruz, United States, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659921626",
      "orcid": "missing"
    },
    {
      "name": "Zhaoqing Teng",
      "institution": "University of California, Santa Cruz, United States, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475051",
      "orcid": "missing"
    },
    {
      "name": "Andy Bryant",
      "institution": "University of California, Santa Cruz, United States, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474177",
      "orcid": "missing"
    },
    {
      "name": "Jichen Zhu",
      "institution": "IT University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488646953",
      "orcid": "0000-0001-6740-4550"
    },
    {
      "name": "Magy Seif El-Nasr",
      "institution": "University of California, Santa Cruz, United States, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488653825",
      "orcid": "0000-0002-7808-1686"
    }
  ],
  "references": [
    {
      "text": "Ana Paula Afonso, Maria Beatriz Carmo, Tiago Gonçalves, and Pedro Vieira. 2019. VisuaLeague: Player performance analysis using spatial-temporal data. Multimedia Tools and Applications 78, 23 (2019), 33069–33090.",
      "doi": ""
    },
    {
      "text": "Sarah L Ash and Patti H Clayton. 2004. The articulated learning: An approach to guided reflection and assessment. Innovative Higher Education 29, 2 (2004), 137–154.",
      "doi": ""
    },
    {
      "text": "Blitz.gg. 2021. Blitz App. https://blitz.gg/. (2021). Online; accessed April 15th 2021.",
      "doi": ""
    },
    {
      "text": "Robert Bodily, Judy Kay, Vincent Aleven, Ioana Jivet, Dan Davis, Franceska Xhakaj, and Katrien Verbert. 2018. Open learner models and learning analytics dashboards: a systematic review. In Proceedings of the 8th international conference on learning analytics and knowledge. 41–50.",
      "doi": "10.1145/3170358.3170409"
    },
    {
      "text": "Robert Bodily and Katrien Verbert. 2017. Review of research on student-facing learning analytics dashboards and educational recommender systems. IEEE Transactions on Learning Technologies 10, 4 (2017), 405–418.",
      "doi": "10.1109/TLT.2017.2740172"
    },
    {
      "text": "D Boud, R Keogh, and D Walker. 1985. Reflection: Turning Experience into Learning.",
      "doi": ""
    },
    {
      "text": "Brian Bowman, Niklas Elmqvist, and TJ Jankun-Kelly. 2012. Toward visualization for games: Theory, design space, and patterns. IEEE transactions on visualization and computer graphics 18, 11(2012), 1956–1968.",
      "doi": ""
    },
    {
      "text": "Sven Charleer, Kathrin Gerling, Francisco Gutiérrez, Hans Cauwenbergh, Bram Luycx, and Katrien Verbert. 2018. Real-time dashboards to support esports spectating. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. 59–71.",
      "doi": "10.1145/3242671.3242680"
    },
    {
      "text": "Sven Charleer, Joris Klerkx, Jose Luis Santos, and Erik Duval. 2013. Improving awareness and reflection through collaborative, interactive visualizations of badges.ARTEL@ EC-TEL 1103(2013), 69–81.",
      "doi": ""
    },
    {
      "text": "Zhi-Hong Chen, Howard Hao-Jan Chen, and Wan-Jhen Dai. 2018. Using narrative-based contextual games to enhance language learning: A case study. Journal of Educational Technology & Society 21, 3 (2018), 186–198.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A coefficient of agreement for nominal scales. Educational and psychological measurement 20, 1 (1960), 37–46.",
      "doi": ""
    },
    {
      "text": "Vania Dimitrova. 2003. STyLE-OLM: Interactive open learner modelling. International Journal of Artificial Intelligence in Education 13, 1(2003), 35–78.",
      "doi": "10.5555/1434812.1434818"
    },
    {
      "text": "Magy Seif El-Nasr, Shree Durga, Mariya Shiyko, and Carmen Sceppa. 2015. Data-driven retrospective interviewing (DDRI): a proposed methodology for formative evaluation of pervasive games. Entertainment Computing 11 (2015), 1–19.",
      "doi": ""
    },
    {
      "text": "Jose Esteves, Konstantina Valogianni, and Anita Greenhill. 2021. Online social games: The effect of social comparison elements on continuance behaviour. Information & Management 58, 4 (2021), 103452.",
      "doi": ""
    },
    {
      "text": "Logan Fiorella and Richard E Mayer. 2012. Paper-Based aids for learning with a computer-based game.Journal of Educational Psychology 104, 4 (2012), 1074.",
      "doi": ""
    },
    {
      "text": "Rowanne Fleck and Geraldine Fitzpatrick. 2010. Reflecting on reflection: framing a design landscape. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction. 216–223.",
      "doi": "10.1145/1952222.1952269"
    },
    {
      "text": "John Fritz. 2011. Classroom walls that talk: Using online course activity data of successful students to raise self-awareness of underperforming peers. The Internet and Higher Education 14, 2 (2011), 89–97.",
      "doi": ""
    },
    {
      "text": "Gowri Betrabet Gulwadi. 2009. Using reflective journals in a sustainable design studio. International Journal of Sustainability in Higher Education (2009).",
      "doi": ""
    },
    {
      "text": "Allyson Fiona Hadwin, Sanna Järvelä, and Mariel Miller. 2011. Self-regulated, co-regulated, and socially shared regulation of learning. Handbook of self-regulation of learning and performance 30 (2011), 65–84.",
      "doi": ""
    },
    {
      "text": "Neville Hatton and David Smith. 1995. Reflection in teacher education: Towards definition and implementation. Teaching and teacher education 11, 1 (1995), 33–49.",
      "doi": ""
    },
    {
      "text": "Erik Hazzard. 2014. Data Visualization in Games. http://erikhazzard.com/blog/game-development/data-visualization-in-games",
      "doi": ""
    },
    {
      "text": "Caitlin Holman, Stephen Aguilar, and Barry Fishman. 2013. GradeCraft: What can we learn from a game-inspired learning management system?. In Proceedings of the third international conference on learning analytics and knowledge. 260–264.",
      "doi": "10.1145/2460296.2460350"
    },
    {
      "text": "Danial Hooshyar, Emanuele Bardone, Nour El Mawas, and Yeongwook Yang. 2020. Transparent Player Model: Adaptive Visualization of Learner Model in Educational Games. In International Conference on Innovative Technologies and Learning. Springer, 349–357.",
      "doi": ""
    },
    {
      "text": "Danial Hooshyar, Margus Pedaste, Katrin Saks, Äli Leijen, Emanuele Bardone, and Minhong Wang. 2020. Open learner models in supporting self-regulated learning in higher education: A systematic literature review. Computers & Education 154 (2020), 103878.",
      "doi": ""
    },
    {
      "text": "I-Han Hsiao and Peter Brusilovsky. 2017. Guiding and motivating students through open social student modeling: Lessons learned. Teachers College Record 119, 3 (2017).",
      "doi": ""
    },
    {
      "text": "Gwo-Jen Hwang, Han-Yu Sung, Chun-Ming Hung, Iwen Huang, and Chin-Chung Tsai. 2012. Development of a personalized educational computer game based on students’ learning styles. Educational Technology Research and Development 60, 4(2012), 623–638.",
      "doi": ""
    },
    {
      "text": "Chaima Jemmali. 2016. May’s Journey: A serious game to teach middle and high school girls programming. (2016).",
      "doi": ""
    },
    {
      "text": "Jimoon Kang, June Seop Yoon, and Byungjoo Lee. 2022. How AI-Based Training Affected the Performance of Professional Go Players. In CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": ""
    },
    {
      "text": "Pavan Kantharaju, Katelyn Alderfer, Jichen Zhu, Bruce Char, Brian Smith, and Santiago Ontanón. 2019. Tracing player knowledge in a parallel programming educational game. arXiv preprint arXiv:1908.05632(2019).",
      "doi": ""
    },
    {
      "text": "Kristian Kiili, Harri Ketamo, and Timo Lainema. 2011. Reflective Thinking in Games: Triggers and Constraints. Leading Issues in Games Based Learning(2011), 178.",
      "doi": ""
    },
    {
      "text": "Erica Kleinman and Magy Seif El-Nasr. 2021. Using Data to\" Git Gud\": A Push for a Player-Centric approach tothe Use of Data in Esports. (2021).",
      "doi": ""
    },
    {
      "text": "Erica Kleinman, Nikitha Preetham, Zhaoqing Teng, Andy Bryant, and Magy Seif El-Nasr. 2021. \" What Happened Here!?\" A Taxonomy for User Interaction with Spatio-Temporal Game Data Visualization. Proceedings of the ACM on Human-Computer Interaction 5, CHI PLAY(2021), 1–27.",
      "doi": "10.1145/3474687"
    },
    {
      "text": "Erica Kleinman, Murtuza N Shergadwala, and Magy Seif El-Nasr. 2022. Kills, Deaths, and (Computational) Assists: Identifying Opportunities for Computational Support in Esport Learning. In CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3491102.3517654"
    },
    {
      "text": "Athanasios Vasileios Kokkinakis, Simon Demediuk, Isabelle Nölle, Oluseyi Olarewaju, Sagarika Patra, Justus Robertson, Peter York, Alan Pedrassoli Pedrassoli Chitayat, Alistair Coates, Daniel Slawson, 2020. DAX: Data-Driven Audience Experiences in Esports. In ACM International Conference on Interactive Media Experiences. 94–105.",
      "doi": ""
    },
    {
      "text": "Anne Krampe and Sonja Kuhnt. 2007. Bowker’s test for symmetry and modifications within the algebraic framework. Computational statistics & data analysis 51, 9 (2007), 4124–4142.",
      "doi": ""
    },
    {
      "text": "Ulrike-Marie Krause and Robin Stark. 2010. Reflection in example-and problem-based learning: Effects of reflection prompts, feedback and cooperative learning. Evaluation & research in education 23, 4 (2010), 255–272.",
      "doi": ""
    },
    {
      "text": "Yen-Ting Kuan, Yu-Shuen Wang, and Jung-Hong Chuang. 2017. Visualizing real-time strategy games: The example of starcraft ii. In 2017 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, 71–80.",
      "doi": ""
    },
    {
      "text": "J Richard Landis and Gary G Koch. 1977. The measurement of observer agreement for categorical data. biometrics (1977), 159–174.",
      "doi": ""
    },
    {
      "text": "Äli Leijen, Kai Valtna, Djuddah AJ Leijen, and Margus Pedaste. 2012. How to determine the quality of students’ reflections?Studies in Higher Education 37, 2 (2012), 203–217.",
      "doi": ""
    },
    {
      "text": "James C Lester, Hiller A Spires, John L Nietfeld, James Minogue, Bradford W Mott, and Eleni V Lobene. 2014. Designing game-based learning environments for elementary science education: A narrative-centered learning perspective. Information Sciences 264(2014), 4–18.",
      "doi": "10.1016/j.ins.2013.09.005"
    },
    {
      "text": "Ben Medler. 2011. Player dossiers: Analyzing gameplay data as a reward. Game Studies 11, 1 (2011).",
      "doi": ""
    },
    {
      "text": "Elisa D Mekler, Ioanna Iacovides, and Julia Ayumi Bopp. 2018. \" A Game that Makes You Question...\" Exploring the Role of Reflection for the Player Experience. In Proceedings of the 2018 annual symposium on computer-human interaction in play. 315–327.",
      "doi": "10.1145/3242671.3242691"
    },
    {
      "text": "Muhsin Menekse, Saira Anwar, and Zeynep Gonca Akdemir. 2022. How do different reflection prompts affect engineering students’ academic performance and engagement?The Journal of Experimental Education 90, 2 (2022), 261–279.",
      "doi": ""
    },
    {
      "text": "Jack Mezirow. 1981. A critical theory of adult learning and education. Adult education 32, 1 (1981), 3–24.",
      "doi": ""
    },
    {
      "text": "mobalytics. 2021. Mobalytics. https://app.mobalytics.gg/. (2021). Online; accessed 25 January 2021.",
      "doi": ""
    },
    {
      "text": "Truong-Huy D Nguyen, Magy Seif El-Nasr, and Alessandro Canossa. 2015. Glyph: Visualization Tool for Understanding Problem Solving Strategies in Puzzle Games.. In FDG.",
      "doi": ""
    },
    {
      "text": "John L Nietfeld. 2017. The role of self-regulated learning in digital games. In Handbook of self-regulation of learning and performance. Routledge, 271–284.",
      "doi": ""
    },
    {
      "text": "Harold F O’Neil, Gregory KWK Chung, Deirdre Kerr, Terry P Vendlinski, Rebecca E Buschang, and Richard E Mayer. 2014. Adding self-explanation prompts to an educational computer game. Computers in Human Behavior 30 (2014), 23–28.",
      "doi": "10.1016/j.chb.2013.07.025"
    },
    {
      "text": "Ernesto Panadero. 2017. A review of self-regulated learning: Six models and four directions for research. Frontiers in psychology 8 (2017), 422.",
      "doi": ""
    },
    {
      "text": "Yeonjeong Park and I-H Jo. 2015. Development of the learning analytics dashboard to support students’ learning performance. Journal of Universal Computer Science 21, 1 (2015), 110.",
      "doi": ""
    },
    {
      "text": "Jean H Powell. 1989. The reflective practitioner in nursing. Journal of Advanced Nursing 14, 10 (1989), 824–832.",
      "doi": ""
    },
    {
      "text": "Mladen Raković, Matthew L Bernacki, Jeffrey A Greene, Robert D Plumley, Kelly A Hogan, Kathleen M Gates, and Abigail T Panter. 2022. Examining the critical role of evaluation and adaptation in self-regulated learning. Contemporary Educational Psychology 68 (2022), 102027.",
      "doi": ""
    },
    {
      "text": "Valentin Riemer and Claudia Schrader. 2020. Playing to learn or to win? The role of students’ competition preference on self-monitoring and learning outcome when learning with a serious game. Interactive Learning Environments(2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Jonathan Rowe, Bradford Mott, Scott McQuiggan, Jennifer Robison, Sunyoung Lee, and James Lester. 2009. Crystal island: A narrative-centered learning environment for eighth grade microbiology. In workshop on intelligent educational games at the 14th international conference on artificial intelligence in education, Brighton, UK. 11–20.",
      "doi": ""
    },
    {
      "text": "Jennifer L Sabourin, Lucy R Shores, Bradford W Mott, and James C Lester. 2013. Understanding and predicting student self-regulated learning strategies in game-based learning environments. International Journal of Artificial Intelligence in Education 23, 1(2013), 94–114.",
      "doi": ""
    },
    {
      "text": "Jose Luis Santos, Katrien Verbert, and Erik Duval. 2012. Empowering students to reflect on their activity with StepUp!: Two case studies with engineering students.. In ARTEL@ EC-TEL. Citeseer, 73–86.",
      "doi": ""
    },
    {
      "text": "Jose Luis Santos, Katrien Verbert, Sten Govaerts, and Erik Duval. 2013. Addressing learner issues with StepUp! an evaluation. In Proceedings of the Third International Conference on Learning Analytics and Knowledge. 14–22.",
      "doi": "10.1145/2460296.2460301"
    },
    {
      "text": "Donald A Schon. 1984. The reflective practitioner: How professionals think in action. Vol. 5126. Basic books.",
      "doi": ""
    },
    {
      "text": "Dale H Schunk. 2012. Learning theories an educational perspective sixth edition. Pearson.",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr and Erica Kleinman. 2020. Data-Driven Game Development: Ethical Considerations. In International Conference on the Foundations of Digital Games. 1–10.",
      "doi": ""
    },
    {
      "text": "SENPAI.gg. 2021. SENPAI.gg. https://senpai.gg/. (2021). Online; accessed April 15th 2021.",
      "doi": ""
    },
    {
      "text": "Raja M Suleman, Riichiro Mizoguchi, and Mitsuru Ikeda. 2016. A new perspective of negotiation-based dialog to enhance metacognitive skills in the context of open learner models. International Journal of Artificial Intelligence in Education 26, 4(2016), 1069–1115.",
      "doi": ""
    },
    {
      "text": "Linda Valli. 1997. Listening to other voices: A description of teacher reflection in the United States. Peabody journal of Education 72, 1 (1997), 67–88.",
      "doi": ""
    },
    {
      "text": "Gerard Van den Boom, Fred Paas, and Jeroen JG Van Merrienboer. 2007. Effects of elicited reflections combined with tutor or peer feedback on self-regulated learning and learning outcomes. Learning and Instruction 17, 5 (2007), 532–548.",
      "doi": ""
    },
    {
      "text": "Gerard Van den Boom, Fred Paas, Jeroen JG Van Merrienboer, and Tamara Van Gog. 2004. Reflection prompts and tutor feedback in a web-based learning environment: Effects on students’ self-regulated learning competence. Computers in Human Behavior 20, 4 (2004), 551–567.",
      "doi": ""
    },
    {
      "text": "Jennifer Villareale, Colan F. Biemer, Magy Seif El-Nasr, and Jichen Zhu. 2020. Reflection in Game-Based Learning: A Survey of Programming Games. In International Conference on the Foundations of Digital Games. 1–9.",
      "doi": ""
    },
    {
      "text": "Guenter Wallner and Simone Kriglstein. 2016. Visualizations for retrospective analysis of battles in team-based combat games: A user study. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. 22–32.",
      "doi": "10.1145/2967934.2968093"
    },
    {
      "text": "Günter Wallner, Marnix Van Wijland, Regina Bernhaupt, and Simone Kriglstein. 2021. What Players Want: Information Needs of Players on Post-Game Visualizations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445174"
    },
    {
      "text": "Renee M Williams, Jean Wessel, Maryan Gemus, and Elaine Foster-Seargeant. 2002. Journal writing to promote reflection by physical therapy students during clinical placements. Physiotherapy Theory and Practice 18, 1 (2002), 5–15.",
      "doi": ""
    },
    {
      "text": "Jichen Zhu, Katelyn Alderfer, Anushay Furqan, Jessica Nebolsky, Bruce Char, Brian Smith, Jennifer Villareale, and Santiago Ontañón. 2019. Programming in game space: how to represent parallel programming concepts in an educational game. In Proceedings of the 14th International Conference on the Foundations of Digital Games. 1–10.",
      "doi": "10.1145/3337722.3337749"
    },
    {
      "text": "Jichen Zhu and Magy Seif El-Nasr. 2021. Open Player Modeling: Empowering Players through Data Transparency. arXiv preprint arXiv:2110.05810(2021).",
      "doi": ""
    },
    {
      "text": "Barry J Zimmerman and Adam R Moylan. 2009. Self-regulation: Where metacognition and motivation intersect.(2009).",
      "doi": ""
    },
    {
      "text": "Barry J Zimmerman and Manuel Martinez Pons. 1986. Development of a structured interview for assessing student use of self-regulated learning strategies. American educational research journal 23, 4 (1986), 614–628.",
      "doi": ""
    }
  ]
}