{
  "doi": "10.1145/3544548.3580899",
  "title": "Collocated Distance: A Fundamental Challenge for the Design of Hybrid Work Technologies",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "After the pandemic, it is urgently important to explore the special challenges which arise with hybrid work. Through cross-case analyses of published papers, we propose collocated distance as a design challenge uniquely relevant for hybrid cooperative technologies. We identify and conceptualize collocated distance as a design challenge that arises in hybrid work situations, where at least three actors are mutually dependent in their work while being located within fewer contexts than the number of actors. Collocated distance reminds us that when designing hybrid technologies, we must not only focus on creating technologies that support the work across geographical locations but equally pay attention to the relations and possible disconnections which exist locally between collocated actors. When designing cooperative technologies supporting distributed work, often focus is on the boundaries between geographical contexts – however, in hybrid work, we must not forget to pay attention to the collocated boundaries within the same context.",
  "authors": [
    {
      "name": "Melanie Duckert",
      "institution": "IT University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659770775",
      "orcid": "0000-0001-8079-8363"
    },
    {
      "name": "Louise Barkhuus",
      "institution": "IT University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331488921",
      "orcid": "0000-0003-1306-249X"
    },
    {
      "name": "Pernille Bjørn",
      "institution": "Human Centred Computing, Department of Computer Science, University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309489973",
      "orcid": "0000-0001-7049-1173"
    }
  ],
  "references": [
    {
      "text": "Anne P. Massey, Mitzi M. Montoya-Weiss, and Yu-Ting Hung. 2003. Because Time Matters: Temporal Coordination in Global Virtual Project Teams. J. Manag. Inf. Syst. 19, 4 (April 2003), 129–155. DOI:https://doi.org/10.1080/07421222.2003.11045742",
      "doi": ""
    },
    {
      "text": "Hilary Arksey and Lisa O'Malley. 2005. Scoping studies: Towards a methodological framework. Int. J. Soc. Res. Methodol. Theory Pract. 8, 1 (2005), 19–32. DOI:https://doi.org/10.1080/1364557032000119616",
      "doi": ""
    },
    {
      "text": "Gabriela Avram, Liam Bannon, John Bowers, Anne Sheehan, and Daniel K. Sullivan. 2009. Bridging, Patching and Keeping the Work Flowing: Defect Resolution in Distributed Software Development. Comput. Support. Coop. Work CSCW 18, 5–6 (December 2009), 477–507. DOI:https://doi.org/10.1007/s10606-009-9099-6",
      "doi": "10.1007/s10606-009-9099-6"
    },
    {
      "text": "Gagandeep Singh Bachhal and Amanjot Kaur Sandhu. 2013. Remote Patient Health Alert System. In Proceedings of the 11th Asia Pacific Conference on Computer Human Interaction (APCHI ’13), Association for Computing Machinery, New York, NY, USA, 167–173. DOI:https://doi.org/10.1145/2525194.2525282",
      "doi": "10.1145/2525194.2525282"
    },
    {
      "text": "Ellen Baker, John Geirland, Tom Fisher, and Annmarie Chandler. 1999. Media Production: Towards Creative Collaboration Using Communication Networks. Comput. Support. Coop. Work CSCW 8, 4 (December 1999), 303–332. DOI:https://doi.org/10.1023/A:1008616002814",
      "doi": "10.1023/A%3A1008616002814"
    },
    {
      "text": "Lyndsey L. Bakewell, Konstantina Vasileiou, Kiel S. Long, Mark Atkinson, Helen Rice, Manuela Barreto, Julie Barnett, Michael Wilson, Shaun Lawson, and John Vines. 2018. Everything We Do, Everything We Press: Data-Driven Remote Performance Management in a Mobile Workplace. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3173574.3173945",
      "doi": "10.1145/3173574.3173945"
    },
    {
      "text": "Aruna D. Balakrishnan, Susan R. Fussell, and Sara Kiesler. 2008. Do Visualizations Improve Synchronous Remote Collaboration? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’08), Association for Computing Machinery, New York, NY, USA, 1227–1236. DOI:https://doi.org/10.1145/1357054.1357246",
      "doi": "10.1145/1357054.1357246"
    },
    {
      "text": "Jakob E. Bardram and Claus Bossen. 2005. A web of coordinative artifacts: collaborative work at a hospital ward. In Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work (GROUP ’05), Association for Computing Machinery, New York, NY, USA, 168–176. DOI:https://doi.org/10.1145/1099203.1099235",
      "doi": "10.1145/1099203.1099235"
    },
    {
      "text": "Jakob E. Bardram, Thomas R. Hansen, and Mads Soegaard. 2006. AwareMedia: a shared interactive display supporting social, temporal, and spatial awareness in surgery. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW ’06), Association for Computing Machinery, New York, NY, USA, 109–118. DOI:https://doi.org/10.1145/1180875.1180892",
      "doi": "10.1145/1180875.1180892"
    },
    {
      "text": "Louise Barkhuus and Chiara Rossitto. 2016. Acting with Technology: Rehearsing for Mixed-Media Live Performances. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, San Jose California USA, 864–875. DOI:https://doi.org/10.1145/2858036.2858344",
      "doi": "10.1145/2858036.2858344"
    },
    {
      "text": "Petra Saskia Bayerl and Kristina Lauche. 2010. Technology Effects in Distributed Team Coordination—High-Interdependency Tasks in Offshore Oil Production. Comput. Support. Coop. Work CSCW 19, 2 (April 2010), 139–173. DOI:https://doi.org/10.1007/s10606-010-9107-x",
      "doi": "10.1007/s10606-010-9107-x"
    },
    {
      "text": "Gabrielle Benabdallah, Sam Bourgault, Nadya Peek, and Jennifer Jacobs. 2021. Remote Learners, Home Makers: How Digital Fabrication Was Taught Online During a Pandemic. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3411764.3445450",
      "doi": "10.1145/3411764.3445450"
    },
    {
      "text": "Pernille Bjørn. 2003. Re-negotiating protocols: a way to integrate groupware in collaborative learning settings - researchr publication. ECIS New Paradig. Organ. Mark. Soc. Proc. 11th Eur. Conf. Inf. Syst. Napoli (2003). Retrieved September 11, 2022 from https://researchr.org/publication/Rasmussen03%3A1",
      "doi": ""
    },
    {
      "text": "Pernille Bjørn. 2016. New fundamentals for CSCW research: from distance to politics. Interactions 23, 3 (April 2016), 50–53. DOI:https://doi.org/10.1145/2903753",
      "doi": "10.1145/2903753"
    },
    {
      "text": "Pernille Bjørn. 2019. Dark Agile: Perceiving People As Assets, Not Humans. In Rethinking Productivity in Software Engineering, Caitlin Sadowski and Thomas Zimmermann (eds.). Apress, Berkeley, CA, 125–134. DOI:https://doi.org/10.1007/978-1-4842-4221-6_11",
      "doi": ""
    },
    {
      "text": "Pernille Bjørn and Nina Boulus-Rødje. 2018. Infrastructural Inaccessibility: Tech Entrepreneurs in Occupied Palestine. ACM Trans. Comput.-Hum. Interact. 25, 5 (October 2018), 26:1-26:31. DOI:https://doi.org/10.1145/3219777",
      "doi": "10.1145/3219777"
    },
    {
      "text": "Pernille Bjørn and Morten Hertzum. 2011. Artefactual Multiplicity: A Study of Emergency-Department Whiteboards. Comput. Support. Coop. Work CSCW 20, 1 (April 2011), 93–121. DOI:https://doi.org/10.1007/s10606-010-9126-7",
      "doi": "10.1007/s10606-010-9126-7"
    },
    {
      "text": "Pernille Bjørn and Ojelanki Ngwenyama. 2009. Virtual team collaboration: building shared meaning, resolving breakdowns and creating translucence. Inf. Syst. J. 19, 3 (2009), 227–253. DOI:https://doi.org/10.1111/j.1365-2575.2007.00281.x",
      "doi": ""
    },
    {
      "text": "Pernille Bjørn and Ojelanki Ngwenyama. 2010. Technology Alignment: A New Area in Virtual Team Research. IEEE Trans. Prof. Commun. 53, 4 (December 2010), 382–400. DOI:https://doi.org/10.1109/TPC.2009.2034926",
      "doi": ""
    },
    {
      "text": "Pernille Bjorn, Ada Scupola, and Brian Fitzgerald. 2006. Expanding Technological Frames Towards Mediated Collaboration. 18, (2006), 41.",
      "doi": ""
    },
    {
      "text": "Pernille Bjørn, Anne-Marie Søderberg, and S Krishna. 2019. Translocality in Global Software Development: the Dark Side of Global Agile. Human–Computer Interact. 34, 2 (March 2019), 174–203. DOI:https://doi.org/10.1080/07370024.2017.1398092",
      "doi": ""
    },
    {
      "text": "Alexander Boden, Frank Rosswog, Gunnar Stevens, and Volker Wulf. 2014. Articulation spaces: bridging the gap between formal and informal coordination. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW ’14), Association for Computing Machinery, New York, NY, USA, 1120–1130. DOI:https://doi.org/10.1145/2531602.2531621",
      "doi": "10.1145/2531602.2531621"
    },
    {
      "text": "Erin Bradner and Gloria Mark. Why Distance Matters: Effects on Cooperation, Persuasion and Deception !",
      "doi": ""
    },
    {
      "text": "Boyd Branch, Christos Efstratiou, Piotr Mirowski, Kory W. Mathewson, and Paul Allain. 2021. Tele-Immersive Improv: Effects of Immersive Visualisations on Rehearsing and Performing Theatre Online. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3411764.3445310",
      "doi": "10.1145/3411764.3445310"
    },
    {
      "text": "Carrie J Cai, Michelle Carney, Nida Zada, and Michael Terry. 2021. Breakdowns and Breakthroughs: Observing Musicians’ Responses to the COVID-19 Pandemic. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3411764.3445192",
      "doi": "10.1145/3411764.3445192"
    },
    {
      "text": "Clara Caldeira, Cleidson R.B. de Souza, Letícia Machado, Marcelo Perin, and Pernille Bjørn. 2022. Crisis Readiness: Revisiting the Distance Framework During the COVID-19 Pandemic. Comput. Support. Coop. Work CSCW (April 2022). DOI:https://doi.org/10.1007/s10606-022-09427-6",
      "doi": ""
    },
    {
      "text": "Stefania Castellani, Antonietta Grasso, Jacki O'Neill, and Frederic Roulland. 2009. Designing Technology as an Embedded Resource for Troubleshooting. Comput. Support. Coop. Work CSCW 18, 2–3 (June 2009), 199–227. DOI:https://doi.org/10.1007/s10606-008-9088-1",
      "doi": "10.1007/s10606-008-9088-1"
    },
    {
      "text": "Lars Rune Christensen, Rasmus Eskild Jensen, and Pernille Bjørn. 2014. Relation Work in Collocated and Distributed Collaboration. In COOP 2014 - Proceedings of the 11th International Conference on the Design of Cooperative Systems, 27-30 May 2014, Nice (France). Springer International Publishing, 87–101. DOI:https://doi.org/10.1007/978-3-319-06498-7_6",
      "doi": ""
    },
    {
      "text": "Herbert H. Clark and Susan E. Brennan. 1991. Grounding in communication. In Perspectives on socially shared cognition. American Psychological Association, Washington, DC, US, 127–149. DOI:https://doi.org/10.1037/10096-006",
      "doi": ""
    },
    {
      "text": "Matthew Claudel, Emanuele Massaro, Paolo Santi, Fiona Murray, and Carlo Ratti. 2017. An exploration of collaborative scientific production at MIT through spatial organization and institutional affiliation. PLOS ONE 12, 6 (June 2017), e0179334. DOI:https://doi.org/10.1371/journal.pone.0179334",
      "doi": ""
    },
    {
      "text": "Catherine Durnell Cramton. 2001. The Mutual Knowledge Problem and Its Consequences for Dispersed Collaboration. Organ. Sci. 12, 3 (June 2001), 346–371. DOI:https://doi.org/10.1287/orsc.12.3.346.10098",
      "doi": "10.1287/orsc.12.3.346.10098"
    },
    {
      "text": "Gavin Doherty, Nikiforos Karamanis, and Saturnino Luz. 2012. Collaboration in Translation: The Impact of Increased Reach on Cross-organisational Work. Comput. Support. Coop. Work CSCW 21, 6 (December 2012), 525–554. DOI:https://doi.org/10.1007/s10606-012-9175-1",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Victoria Bellotti. 1992. Awareness and coordination in shared workspaces. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work - CSCW ’92, ACM Press, Toronto, Ontario, Canada, 107–114. DOI:https://doi.org/10.1145/143457.143468",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Paul Dourish and Sara Bly. 1992. Portholes: supporting awareness in a distributed work group. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’92), Association for Computing Machinery, New York, NY, USA, 541–547. DOI:https://doi.org/10.1145/142750.142982",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Catherine Durnell Cramton and Pamela J. Hinds. 2004. SUBGROUP DYNAMICS IN INTERNATIONALLY DISTRIBUTED TEAMS: ETHNOCENTRISM OR CROSS-NATIONAL LEARNING? Res. Organ. Behav. 26, (January 2004), 231–263. DOI:https://doi.org/10.1016/S0191-3085(04)26006-3",
      "doi": ""
    },
    {
      "text": "Arvid Engström, Oskar Juhlin, Mark Perry, and Mathias Broth. 2010. Temporal Hybridity: Mixing Live Video Footage with Instant Replay in Real Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’10), Association for Computing Machinery, New York, NY, USA, 1495–1504. DOI:https://doi.org/10.1145/1753326.1753550",
      "doi": "10.1145/1753326.1753550"
    },
    {
      "text": "Morten Esbensen, Paolo Tell, and Jakob E. Bardram. 2014. SideBar: Videoconferencing system supporting social engagement. In 10th IEEE International Conference on Collaborative Computing: Networking, Applications and Worksharing, 358–367. DOI:https://doi.org/10.4108/icst.collaboratecom.2014.257335",
      "doi": ""
    },
    {
      "text": "G. Fitzpatrick. 2003. The Locales Framework: Understanding and Designing for Wicked Problems. Springer Science & Business Media.",
      "doi": "10.5555/862186"
    },
    {
      "text": "Yumei Gan, Christian Greiffenhagen, and Stuart Reeves. 2020. Connecting Distributed Families: Camera Work for Three-party Mobile Video Calls. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3313831.3376704",
      "doi": "10.1145/3313831.3376704"
    },
    {
      "text": "Elihu M. Gerson. 2008. Reach, Bracket, and the Limits of Rationalized Coordination: Some Challenges for CSCW. In Resources, Co-Evolution and Artifacts. Springer London, London, 193–220. DOI:https://doi.org/10.1007/978-1-84628-901-9_8",
      "doi": ""
    },
    {
      "text": "Elihu M. Gerson and Susan Leigh Star. 1986. Analyzing due process in the workplace. ACM Trans. Inf. Syst. 4, 3 (July 1986), 257–270. DOI:https://doi.org/10.1145/214427.214431",
      "doi": "10.1145/214427.214431"
    },
    {
      "text": "Christina B. Gibson and Jennifer A. Manuel. 2003. Building trust: effective multicultural communication processes in virtual teams. Virtual Teams Work Creat. Cond. Virtual Team Eff. (2003).",
      "doi": ""
    },
    {
      "text": "Nitesh Goyal, Gilly Leshed, Dan Cosley, and Susan R. Fussell. 2014. Effects of Implicit Sharing in Collaborative Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’14), Association for Computing Machinery, New York, NY, USA, 129–138. DOI:https://doi.org/10.1145/2556288.2557229",
      "doi": "10.1145/2556288.2557229"
    },
    {
      "text": "Irene Greif. 2019. How we started CSCW. Nat. Electron. 2, 3 (March 2019), 132–132. DOI:https://doi.org/10.1038/s41928-019-0229-y",
      "doi": ""
    },
    {
      "text": "Rebecca E. Grinter. 1996. Supporting articulation work using software configuration management systems. Comput. Support. Coop. Work CSCW 5, 4 (December 1996), 447–465. DOI:https://doi.org/10.1007/BF00136714",
      "doi": "10.1007/BF00136714"
    },
    {
      "text": "Jens Emil Grønbæk, Banu Saatçi, Carla F. Griggio, and Clemens Nylandsted Klokmose. 2021. MirrorBlender: Supporting Hybrid Meetings with a Malleable Video-Conferencing System. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3411764.3445698",
      "doi": "10.1145/3411764.3445698"
    },
    {
      "text": "Tom Gross. 2013. Supporting Effortless Coordination: 25 Years of Awareness Research. Comput. Support. Coop. Work CSCW 22, 4–6 (August 2013), 425–474. DOI:https://doi.org/10.1007/s10606-013-9190-x",
      "doi": "10.1007/s10606-013-9190-x"
    },
    {
      "text": "Jonathan Grudin. 1994. Groupware and social dynamics: eight challenges for developers. Commun. ACM 37, 1 (January 1994), 92–105. DOI:https://doi.org/10.1145/175222.175230",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Comput. Support. Coop. Work CSCW 11, 3 (September 2002), 411–446. DOI:https://doi.org/10.1023/A:1021271517844",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Carl Gutwin, Reagan Penner, and Kevin Schneider. 2004. Group awareness in distributed software development. In Proceedings of the 2004 ACM conference on Computer supported cooperative work (CSCW ’04), Association for Computing Machinery, New York, NY, USA, 72–81. DOI:https://doi.org/10.1145/1031607.1031621",
      "doi": "10.1145/1031607.1031621"
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-place-ing space: the roles of place and space in collaborative systems. In Proceedings of the 1996 ACM conference on Computer supported cooperative work (CSCW ’96), Association for Computing Machinery, New York, NY, USA, 67–76. DOI:https://doi.org/10.1145/240080.240193",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Christian Heath and Paul Luff. 1992. Collaboration and controlCrisis management and multimedia technology in London Underground Line Control Rooms. Comput. Support. Coop. Work CSCW 1, 1–2 (March 1992), 69–94. DOI:https://doi.org/10.1007/BF00752451",
      "doi": ""
    },
    {
      "text": "Christian Heath and Paul Luff. 1996. Documents and professional practice: “bad” organisational reasons for “good” clinical records. In Proceedings of the 1996 ACM conference on Computer supported cooperative work (CSCW ’96), Association for Computing Machinery, New York, NY, USA, 354–363. DOI:https://doi.org/10.1145/240080.240342",
      "doi": "10.1145/240080.240342"
    },
    {
      "text": "J.D. Herbsleb, A. Mockus, T.A. Finholt, and R.E. Grinter. 2001. An empirical study of global software development: distance and speed. In Proceedings of the 23rd International Conference on Software Engineering. ICSE 2001, 81–90. DOI:https://doi.org/10.1109/ICSE.2001.919083",
      "doi": ""
    },
    {
      "text": "Erzhen Hu, Md Aashikur Rahman Azim, and Seongkook Heo. 2022. FluidMeet: Enabling Frictionless Transitions Between In-Group, Between-Group, and Private Conversations During Virtual Breakout Meetings. In CHI Conference on Human Factors in Computing Systems, ACM, New Orleans LA USA, 1–17. DOI:https://doi.org/10.1145/3491102.3517558",
      "doi": "10.1145/3491102.3517558"
    },
    {
      "text": "Edwin Hutchins. 1995. Cognition in the Wild. MIT Press.",
      "doi": ""
    },
    {
      "text": "Marleen Huysman, Charles Steinfield, Chyng-Yang Jang, Kenneth David, Mirjam Huis In ’t Veld, Jan Poot, and Ingrid Mulder. 2003. Virtual Teams and the Appropriation of Communication Technology: Exploring the Concept of Media Stickiness. Comput. Support. Coop. Work 12, (2003), 411–436.",
      "doi": "10.1023/A%3A1026145017609"
    },
    {
      "text": "Timothy Kayworth and Dorothy Leidner. 2000. The global virtual manager: a prescription for success. Eur. Manag. J. 18, 2 (April 2000), 183–194. DOI:https://doi.org/10.1016/S0263-2373(99)00090-0",
      "doi": ""
    },
    {
      "text": "Alexander Kipp, Lutz Schubert, Matthias Assel, and Terrence Fernando. 2008. Dynamism and Data Management in Distributed, Collaborative Working Environments. (2008). Retrieved September 13, 2022 from https://dl.eusset.eu/handle/20.500.12015/2810",
      "doi": ""
    },
    {
      "text": "Scott R. Klemmer, Katherine M. Everitt, and James A. Landay. 2008. Integrating Physical and Digital Interactions on Walls for Fluid Design Collaboration. Human–Computer Interact. 23, 2 (May 2008), 138–213. DOI:https://doi.org/10.1080/07370020802016399",
      "doi": ""
    },
    {
      "text": "Grete Helena Kütt, Kevin Lee, Ethan Hardacre, and Alexandra Papoutsaki. 2019. Eye-Write: Gaze Sharing for Collaborative Writing. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3290605.3300727",
      "doi": "10.1145/3290605.3300727"
    },
    {
      "text": "Charlotte P. Lee and Drew Paine. 2015. From the matrix to a model of coordinated action (MoCA): A conceptual framework of and for CSCW. In CSCW 2015 - Proceedings of the 2015 ACM International Conference on Computer-Supported Cooperative Work and Social Computing, Association for Computing Machinery, Inc, 179–194. DOI:https://doi.org/10.1145/2675133.2675161",
      "doi": "10.1145/2675133.2675161"
    },
    {
      "text": "Min Kyung Lee and Leila Takayama. 2011. “Now, i Have a Body”: Uses and Social Norms for Mobile Remote Presence in the Workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), Association for Computing Machinery, New York, NY, USA, 33–42. DOI:https://doi.org/10.1145/1978942.1978950",
      "doi": "10.1145/1978942.1978950"
    },
    {
      "text": "Minha Lee, Wonyoung Park, Sunok Lee, and Sangsu Lee. 2022. Distracting Moments in Videoconferencing: A Look Back at the Pandemic Period. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3491102.3517545",
      "doi": "10.1145/3491102.3517545"
    },
    {
      "text": "Thomas Ludwig, Oliver Stickel, Peter Tolmie, and Malte Sellmer. 2021. shARe-IT: Ad hoc Remote Troubleshooting through Augmented Reality. Comput. Support. Coop. Work CSCW 30, 1 (February 2021), 119–167. DOI:https://doi.org/10.1007/s10606-021-09393-5",
      "doi": ""
    },
    {
      "text": "Jandy Luik, Jenna Ng, and Jonathan Hook. 2019. Virtual Hubs: Understanding Relational Aspects and Remediating Incubation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3290605.3300471",
      "doi": "10.1145/3290605.3300471"
    },
    {
      "text": "Rowena Luk, Melissa Ho, and Paul M. Aoki. 2008. Asynchronous Remote Medical Consultation for Ghana. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’08), Association for Computing Machinery, New York, NY, USA, 743–752. DOI:https://doi.org/10.1145/1357054.1357173",
      "doi": "10.1145/1357054.1357173"
    },
    {
      "text": "Stephan Lukosch, Heide Lukosch, Dragoş Datcu, and Marina Cidota. 2015. Providing Information on the Spot: Using Augmented Reality for Situational Awareness in the Security Domain. Comput. Support. Coop. Work CSCW 24, 6 (December 2015), 613–664. DOI:https://doi.org/10.1007/s10606-015-9235-4",
      "doi": "10.1007/s10606-015-9235-4"
    },
    {
      "text": "Shiran Magrisso, Moran Mizrahi, and Amit Zoran. 2018. Digital Joinery For Hybrid Carpentry. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–11. DOI:https://doi.org/10.1145/3173574.3173741",
      "doi": "10.1145/3173574.3173741"
    },
    {
      "text": "Ann Majchrzak, Ronald E. Rice, Arvind Malhotra, Nelson King, and Sulin Ba. 2000. Technology Adaptation: The Case of a Computer-Supported Inter-Organizational Virtual Team. MIS Q. 24, 4 (2000), 569–600. DOI:https://doi.org/10.2307/3250948",
      "doi": "10.2307/3250948"
    },
    {
      "text": "Arvind Malhotra and Ann Majchrzak. 2004. Enabling knowledge creation in far‐flung teams: best practices for IT support and knowledge sharing. J. Knowl. Manag. 8, 4 (January 2004), 75–88. DOI:https://doi.org/10.1108/13673270410548496",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Steve Abrams, and Nayla Nassif. 2003. Group-to-Group Distance Collaboration: Examining the “Space Between.” In ECSCW 2003, Kari Kuutti, Eija Helena Karsten, Geraldine Fitzpatrick, Paul Dourish and Kjeld Schmidt (eds.). Springer Netherlands, Dordrecht, 99–118. DOI:https://doi.org/10.1007/978-94-010-0068-0_6",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Jonathan Grudin, and Steven E. Poltrock. 1999. Meeting at the Desktop: An Empirical Study of Virtually Collocated Teams. (1999), 12–16.",
      "doi": ""
    },
    {
      "text": "Stina Matthiesen and Pernille Bjørn. 2016. Let's Look Outside the Office: Analytical Lens Unpacking Collaborative Relationships in Global Work. In COOP 2016: Proceedings of the 12th International Conference on the Design of Cooperative Systems, 23-27 May 2016, Trento, Italy, Springer International Publishing, Cham, 107–122. DOI:https://doi.org/10.1007/978-3-319-33464-6_7",
      "doi": ""
    },
    {
      "text": "Stina Matthiesen and Pernille Bjørn. 2017. When Distribution of Tasks and Skills are Fundamentally Problematic: A Failure Story from Global Software Outsourcing. Proc. ACM Hum.-Comput. Interact. 1, CSCW (December 2017), 74:1-74:16. DOI:https://doi.org/10.1145/3139336",
      "doi": "10.1145/3139336"
    },
    {
      "text": "Stina Matthiesen, Pernille Bjørn, and Claus Trillingsgaard. Implicit bias and negative stereotyping in global software development and why it is time to move on! J. Softw. Evol. Process n/a, n/a , e2435. DOI:https://doi.org/10.1002/smr.2435",
      "doi": "10.1002/smr.2435"
    },
    {
      "text": "Moira McGregor, Nicola J. Bidwell, Vidya Sarangapani, Jonathan Appavoo, and Jacki O'Neill. 2019. Talking about Chat at Work in the Global South: An Ethnographic Study of Chat Use in India and Kenya. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–14. DOI:https://doi.org/10.1145/3290605.3300463",
      "doi": "10.1145/3290605.3300463"
    },
    {
      "text": "Helena M. Mentis, Yuanyuan Feng, Azin Semsar, and Todd A. Ponsky. 2020. Remotely Shaping the View in Surgical Telementoring. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. Retrieved from https://doi.org/10.1145/3313831.3376622",
      "doi": "10.1145/3313831.3376622"
    },
    {
      "text": "Kana Misawa and Jun Rekimoto. 2015. ChameleonMask: Embodied Physical and Social Telepresence Using Human Surrogates. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’15), Association for Computing Machinery, New York, NY, USA, 401–411. DOI:https://doi.org/10.1145/2702613.2732506",
      "doi": "10.1145/2702613.2732506"
    },
    {
      "text": "Bonnie A. Nardi, Allan Kuchinsky, Steve Whittaker, Robert Leichner, and Heinrich Schwarz. 1994. Video-as-data: Technical and social aspects of a collaborative multimedia application. Comput. Support. Coop. Work CSCW 4, 1 (1994), 73–100. DOI:https://doi.org/10.1007/BF00823364",
      "doi": "10.1007/BF00823364"
    },
    {
      "text": "Gary M. Olson and Judith S. Olson. 2000. Distance matters. Hum.-Comput. Interact. 15, 2–3 (2000), 139–178. DOI:https://doi.org/10.1207/S15327051HCI1523_4",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Judith S. Olson and Gary M. Olson. 2013. Working Together Apart: Collaboration over the Internet. Synth. Lect. Hum.-Centered Inform. 6, 5 (November 2013), 1–151. DOI:https://doi.org/10.2200/S00542ED1V01Y201310HCI020",
      "doi": ""
    },
    {
      "text": "Isabella Paoletti. 2009. Communication and Diagnostic Work in Medical Emergency Calls in Italy. Comput. Support. Coop. Work CSCW 18, 2–3 (June 2009), 229–250. DOI:https://doi.org/10.1007/s10606-009-9091-1",
      "doi": "10.1007/s10606-009-9091-1"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A. Lee, Jonathon D. Hart, Barrett Ens, Robert W. Lindeman, Bruce H. Thomas, and Mark Billinghurst. 2018. Mini-Me: An Adaptive Avatar for Mixed Reality Remote Collaboration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3173574.3173620",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "Irene Rae and Carman Neustaedter. 2017. Robotic Telepresence at Scale. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), Association for Computing Machinery, New York, NY, USA, 313–324. DOI:https://doi.org/10.1145/3025453.3025855",
      "doi": "10.1145/3025453.3025855"
    },
    {
      "text": "Poster Winifred Rebecca. 2007. Saying ‘Good Morning’ in the Night: The Reversal of Work Time in Global ICT Service Work. In Workplace Temporalities, Beth A. Rubin (ed.). Emerald Group Publishing Limited, 55–112. DOI:https://doi.org/10.1016/S0277-2833(07)17003-5",
      "doi": ""
    },
    {
      "text": "Mike Robinson. 1991. Double-level languages and co-operative working. AI Soc. 5, 1 (January 1991), 34–60. DOI:https://doi.org/10.1007/BF01891356",
      "doi": "10.1007/BF01891356"
    },
    {
      "text": "Karen Ruhleder and Brigitte Jordan. 1999. Meaning-Making Across Remote Sites: How Delays in Transmission Affect Interaction. (1999), 12–16.",
      "doi": ""
    },
    {
      "text": "Karen Ruhleder and Brigitte Jordan. 2001. Co-Constructing Non-Mutual Realities: Delay-Generated Trouble in Distributed Interaction. Comput. Support. Coop. Work CSCW 10, 1 (March 2001), 113–138. DOI:https://doi.org/10.1023/A:1011243905593",
      "doi": "10.1023/A%3A1011243905593"
    },
    {
      "text": "Banu Saatçi, Kaya Akyüz, Sean Rintel, and Clemens Nylandsted Klokmose. 2020. (Re)Configuring Hybrid Meetings: Moving from User-Centered Design to Meeting-Centered Design. Comput. Support. Coop. Work CSCW 29, 6 (December 2020), 769–794. DOI:https://doi.org/10.1007/s10606-020-09385-x",
      "doi": "10.1007/s10606-020-09385-x"
    },
    {
      "text": "Kjeld Schmidt. 1999. Of maps and scripts: The status of formal constructs in cooperative work [1999].Inf. Amp Softw. Technol. (January 1999). Retrieved September 11, 2022 from https://www.academia.edu/1760985/Of_maps_and_scripts_The_status_of_formal_constructs_in_cooperative_work_1999_",
      "doi": ""
    },
    {
      "text": "Kjeld Schmidt. 2002. The Problem with `Awareness’: Introductory Remarks on `Awareness in CSCW’. Comput. Support. Coop. Work CSCW 11, 3 (September 2002), 285–298. DOI:https://doi.org/10.1023/A:1021272909573",
      "doi": "10.1023/A%3A1021272909573"
    },
    {
      "text": "Kjeld Schmidt, Liam Bannon, Mike Robinson, and Lucy Suchman. 1992. Taking CSCW Seriously Supporting Articulation Work. Comput. Support. Coop. Work CSCW 1, (1992), 7–40.",
      "doi": ""
    },
    {
      "text": "Kjeld Schmidt and Ina Wagner. 2002. Coordinative artifacts in architectural practice. In In.",
      "doi": ""
    },
    {
      "text": "S. A. R. Scrivener, S. M. Clark, and N. Keen. 1993. The LookingGlass distributed shared workspace. Comput. Support. Coop. Work CSCW 2, 3 (September 1993), 137–157. DOI:https://doi.org/10.1007/BF00749012",
      "doi": ""
    },
    {
      "text": "Anne-Marie Søderberg, S. Krishna, and Pernille Bjørn. 2013. Global Software Development: Commitment, Trust and Cultural Sensitivity in Strategic Partnerships. J. Int. Manag. 19, 4 (December 2013), 347–361. DOI:https://doi.org/10.1016/j.intman.2013.04.004",
      "doi": ""
    },
    {
      "text": "Anselm Strauss. 1988. The Articulation of Project Work: An Organizational Process. Sociol. Q. 29, 2 (1988), 163–178. DOI:https://doi.org/10.1111/j.1533-8525.1988.tb01249.x",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Commun. ACM 38, 9 (September 1995), 56–64. DOI:https://doi.org/10.1145/223248.223263",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Lucy A. Suchman. 1983. Office procedure as practical action: models of work and system design. ACM Trans. Inf. Syst. 1, 4 (October 1983), 320–328. DOI:https://doi.org/10.1145/357442.357445",
      "doi": "10.1145/357442.357445"
    },
    {
      "text": "John C. Tang and Ellen Isaacs. 1992. Why do users like video?: Studies of multimedia-supported collaboration. Comput. Support. Coop. Work CSCW 1, 3 (September 1992), 163–196. DOI:https://doi.org/10.1007/BF00752437",
      "doi": ""
    },
    {
      "text": "Dylan Tutt, Jon Hindmarsh, Muneeb Shaukat, and Mike Fraser. 2007. The distributed work of local action: Interaction amongst virtually collocated research teams. In ECSCW 2007, Liam J. Bannon, Ina Wagner, Carl Gutwin, Richard H. R. Harper and Kjeld Schmidt (eds.). Springer London, London, 199–218. DOI:https://doi.org/10.1007/978-1-84800-031-5_11",
      "doi": ""
    },
    {
      "text": "Gina Venolia, John Tang, Ruy Cervantes, Sara Bly, George Robertson, Bongshin Lee, and Kori Inkpen. 2010. Embodied Social Proxy: Mediating Interpersonal Connection in Hub-and-Satellite Teams. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’10), Association for Computing Machinery, New York, NY, USA, 1049–1058. DOI:https://doi.org/10.1145/1753326.1753482",
      "doi": "10.1145/1753326.1753482"
    },
    {
      "text": "Mary Watson-Manheim, Katherine Chudoba, and Kevin Crowston. 2002. Discontinuities and Continuities: A New Way to Understand Virtual Work. IT People 15, (September 2002), 191–209. DOI:https://doi.org/10.1108/09593840210444746",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Shigemi Aoyagi, and Yoshinari Shirai. 2011. Supporting Fluid Tabletop Collaboration across Distances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), Association for Computing Machinery, New York, NY, USA, 2827–2836. DOI:https://doi.org/10.1145/1978942.1979362",
      "doi": "10.1145/1978942.1979362"
    },
    {
      "text": "Longqi Yang, David Holtz, Sonia Jaffe, Siddharth Suri, Shilpi Sinha, Jeffrey Weston, Connor Joyce, Neha Shah, Kevin Sherman, Brent Hecht, and Jaime Teevan. 2022. The effects of remote work on collaboration among information workers. Nat. Hum. Behav. 6, 1 (January 2022), 43–54. DOI:https://doi.org/10.1038/s41562-021-01196-4",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh and Gregory D. Abowd. 2011. Mediated parent-child contact in work-separated families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), Association for Computing Machinery, New York, NY, USA, 1185–1194. DOI:https://doi.org/10.1145/1978942.1979120",
      "doi": "10.1145/1978942.1979120"
    },
    {
      "text": "Pernille Bjørn and Lars Rune Christensen. 2011. Relation work: Creating socio-technical connections in global engineering. ECSCW 2011 Proc. 12th Eur. Conf. Comput. Support. Coop. Work 24-28 Sept. 2011 Aarhus Den. (2011), 133–152.",
      "doi": ""
    },
    {
      "text": "Melanie Duckert, Eve Hoggan, Louise Barkhuus, Pernille Bjørn, Nina Boulus-Rodje, Susanne Bødker, Naja Holten Møller, and Irina Shklovski. 2022. Work of the Future. In Adjunct Proceedings of the 2022 Nordic Human-Computer Interaction Conference (NordiCHI ’22), Association for Computing Machinery, New York, NY, USA, 1–4. DOI:https://doi.org/10.1145/3547522.3547707",
      "doi": "10.1145/3547522.3547707"
    },
    {
      "text": "Mehrdad Farzandipour, Ehsan Nabovati, and Reihane Sharif. 2023. The effectiveness of tele-triage during the COVID-19 pandemic: A systematic review and narrative synthesis. J. Telemed. Telecare (January 2023), 1357633X2211502. DOI:https://doi.org/10.1177/1357633X221150278",
      "doi": ""
    },
    {
      "text": "Vidar Hepsø and Elena Parmiggiani. 2022. From Integrated to Remote Operations: Digital Transformation in the Energy Industry as Infrastructuring. In Digital Transformation in Norwegian Enterprises, Patrick Mikalef and Elena Parmiggiani (eds.). Springer International Publishing, Cham, 21–41. DOI:https://doi.org/10.1007/978-3-031-05276-7_3",
      "doi": ""
    },
    {
      "text": "Rasmus Eskild Jensen and Pernille Bjørn. 2012. Divergence and Convergence in Global Software Development: Cultural Complexities as Social Worlds. (2012). Retrieved February 13, 2023 from https://dl.eusset.eu/handle/20.500.12015/2759",
      "doi": ""
    },
    {
      "text": "Junjie H. Xu, Yu Nakano, Lingrong Kong, and Kojiro Iizuka. 2023. CS-lol: a Dataset of Viewer Comment with Scene in E-sports Live-streaming. DOI:https://doi.org/10.1145/3576840.3578334",
      "doi": "10.1145/3576840.3578334"
    }
  ]
}