{
  "doi": "10.1145/3544548.3581431",
  "title": "Interface Design for Crowdsourcing Hierarchical Multi-Label Text Annotations",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Human data labeling is an important and expensive task at the heart of supervised learning systems. Hierarchies help humans understand and organize concepts. We ask whether and how concept hierarchies can inform the design of annotation interfaces to improve labeling quality and efficiency. We study this question through annotation of vaccine misinformation, where the labeling task is difficult and highly subjective. We investigate 6 user interface designs for crowdsourcing hierarchical labels by collecting over 18,000 individual annotations. Under a fixed budget, integrating hierarchies into the design improves crowdsource workers’ F1 scores. We attribute this to (1) Grouping similar concepts, improving F1 scores by +0.16 over random groupings, (2) Strong relative performance on high-difficulty examples (relative F1 score difference of +0.40), and (3) Filtering out obvious negatives, increasing precision by +0.07. Ultimately, labeling schemes integrating the hierarchy outperform those that do not — achieving mean F1 of 0.70.",
  "authors": [
    {
      "name": "Rickard Stureborg",
      "institution": "Computer Science, Duke University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781874",
      "orcid": "0000-0002-5337-9291"
    },
    {
      "name": "Bhuwan Dhingra",
      "institution": "Computer Science, Duke University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659229663",
      "orcid": "0000-0002-6874-9515"
    },
    {
      "name": "Jun Yang",
      "institution": "Computer Science, Duke University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659594292",
      "orcid": "0000-0003-0604-6790"
    }
  ],
  "references": [
    {
      "text": "Alberto Alemanno. 2018. How to counter fake news? A taxonomy of anti-fake news approaches. European journal of risk regulation 9, 1 (2018), 1–5.",
      "doi": ""
    },
    {
      "text": "Fatma Arslan, Josue Caraballo, Damian Jimenez, and Chengkai Li. 2020. Modeling Factual Claims with Semantic Frames. In Proceedings of the Twelfth Language Resources and Evaluation Conference. European Language Resources Association, Marseille, France, 2511–2520. https://aclanthology.org/2020.lrec-1.306",
      "doi": ""
    },
    {
      "text": "Fatma Arslan, Naeemul Hassan, Chengkai Li, and Mark Tremayne. 2020. A Benchmark Dataset of Check-Worthy Factual Claims. Proceedings of the International AAAI Conference on Web and Social Media 14 (May 2020), 821–829. https://ojs.aaai.org/index.php/ICWSM/article/view/7346",
      "doi": ""
    },
    {
      "text": "Natã M. Barbosa and Monchu Chen. 2019. Rehumanized Crowdsourcing: A Labeling Framework Addressing Bias and Ethics in Machine Learning. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300773",
      "doi": "10.1145/3290605.3300773"
    },
    {
      "text": "Samuel R. Bowman, Gabor Angeli, Christopher Potts, and Christopher D. Manning. 2015. A large annotated corpus for learning natural language inference. https://doi.org/10.48550/arXiv.1508.05326 arXiv:1508.05326 [cs].",
      "doi": ""
    },
    {
      "text": "Jonathan Bragg, Mausam, and Daniel Weld. 2013. Crowdsourcing Multi-Label Classification for Taxonomy Creation. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 1 (Nov. 2013), 25–33. https://ojs.aaai.org/index.php/HCOMP/article/view/13091",
      "doi": ""
    },
    {
      "text": "Mark Cartwright, Graham Dove, Ana Elisa Méndez Méndez, Juan P. Bello, and Oded Nov. 2019. Crowdsourcing Multi-label Audio Annotation Tasks with Citizen Scientists. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300522",
      "doi": "10.1145/3290605.3300522"
    },
    {
      "text": "Xiangyu Chen, Yadong Mu, Shuicheng Yan, and Tat-Seng Chua. 2010. Efficient large-scale image annotation by probabilistic collaborative multi-label propagation. In Proceedings of the 18th ACM international conference on Multimedia(MM ’10). Association for Computing Machinery, New York, NY, USA, 35–44. https://doi.org/10.1145/1873951.1873959",
      "doi": "10.1145/1873951.1873959"
    },
    {
      "text": "Lydia B. Chilton, Greg Little, Darren Edge, Daniel S. Weld, and James A. Landay. 2013. Cascade: crowdsourcing taxonomy creation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 1999–2008. https://doi.org/10.1145/2470654.2466265",
      "doi": "10.1145/2470654.2466265"
    },
    {
      "text": "Travis G. Coan, Constantine Boussalis, John Cook, and Mirjam O. Nanko. 2021. Computer-assisted classification of contrarian claims about climate change. Scientific Reports 11, 1 (Nov. 2021), 22320. https://doi.org/10.1038/s41598-021-01714-4 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "A. P. Dawid and A. M. Skene. 1979. Maximum Likelihood Estimation of Observer Error-Rates Using the EM Algorithm. Applied Statistics 28, 1 (1979), 20. https://doi.org/10.2307/2346806",
      "doi": ""
    },
    {
      "text": "Michaël Defferrard, Kirell Benzi, Pierre Vandergheynst, and Xavier Bresson. 2017. FMA: A Dataset For Music Analysis. https://doi.org/10.48550/arXiv.1612.01840 arXiv:1612.01840 [cs].",
      "doi": ""
    },
    {
      "text": "Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. 2009. ImageNet: A large-scale hierarchical image database. In 2009 IEEE Conference on Computer Vision and Pattern Recognition. 248–255. https://doi.org/10.1109/CVPR.2009.5206848",
      "doi": ""
    },
    {
      "text": "Jia Deng, Olga Russakovsky, Jonathan Krause, Michael S. Bernstein, Alex Berg, and Li Fei-Fei. 2014. Scalable multi-label annotation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 3099–3102. https://doi.org/10.1145/2556288.2557011",
      "doi": "10.1145/2556288.2557011"
    },
    {
      "text": "Alexandra Eveleigh, Charlene Jennett, Ann Blandford, Philip Brohan, and Anna L. Cox. 2014. Designing for dabblers and deterring drop-outs in citizen science. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 2985–2994. https://doi.org/10.1145/2556288.2557262",
      "doi": "10.1145/2556288.2557262"
    },
    {
      "text": "Leah Findlater, Joan Zhang, Jon E. Froehlich, and Karyn Moffatt. 2017. Differences in Crowdsourced vs. Lab-based Mobile and Desktop Input Performance Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 6813–6824. https://doi.org/10.1145/3025453.3025820",
      "doi": "10.1145/3025453.3025820"
    },
    {
      "text": "Association for Computing Machinery. 2023. The 2012 ACM Computing Classification System. https://www.acm.org/publications/class-2012",
      "doi": ""
    },
    {
      "text": "Jort F. Gemmeke, Daniel P. W. Ellis, Dylan Freedman, Aren Jansen, Wade Lawrence, R. Channing Moore, Manoj Plakal, and Marvin Ritter. 2017. Audio Set: An ontology and human-labeled dataset for audio events. In 2017 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). 776–780. https://doi.org/10.1109/ICASSP.2017.7952261 ISSN: 2379-190X.",
      "doi": "10.1109/ICASSP.2017.7952261"
    },
    {
      "text": "Raafat George Saadé and Camille Alexandre Otrakji. 2007. First impressions last a lifetime: effect of interface type on disorientation and cognitive load. Computers in Human Behavior 23, 1 (Jan. 2007), 525–535. https://doi.org/10.1016/j.chb.2004.10.035",
      "doi": ""
    },
    {
      "text": "Alon Halevy, Peter Norvig, and Fernando Pereira. 2009. The unreasonable effectiveness of data. IEEE intelligent systems 24, 2 (2009), 8–12.",
      "doi": "10.1109/MIS.2009.36"
    },
    {
      "text": "Eric Humphrey, Simon Durand, and Brian McFee. 2018. OpenMIC-2018: An Open Data-set for Multiple Instrument Recognition.. In ISMIR. 438–444.",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides, Charlene Jennett, Cassandra Cornish-Trestrail, and Anna L. Cox. 2013. Do games attract or sustain engagement in citizen science? a study of volunteer motivations. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 1101–1106. https://doi.org/10.1145/2468356.2468553",
      "doi": "10.1145/2468356.2468553"
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: interrupting worker invisibility in amazon mechanical turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 611–620. https://doi.org/10.1145/2470654.2470742",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Robert M. Jacobson, Paul V. Targonski, and Gregory A. Poland. 2007. A taxonomy of reasoning flaws in the anti-vaccine movement. Vaccine 25, 16 (April 2007), 3146–3152. https://doi.org/10.1016/j.vaccine.2007.01.046",
      "doi": ""
    },
    {
      "text": "Will Kay, Joao Carreira, Karen Simonyan, Brian Zhang, Chloe Hillier, Sudheendra Vijayanarasimhan, Fabio Viola, Tim Green, Trevor Back, Paul Natsev, Mustafa Suleyman, and Andrew Zisserman. 2017. The Kinetics Human Action Video Dataset. https://doi.org/10.48550/arXiv.1705.06950 arXiv:1705.06950 [cs].",
      "doi": ""
    },
    {
      "text": "Ashish Khetan and Sewoong Oh. 2017. Achieving Budget-optimality with Adaptive Schemes in Crowdsourcing. http://arxiv.org/abs/1602.03481 arXiv:1602.03481 [cs, stat].",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). Association for Computing Machinery, New York, NY, USA, 453–456. https://doi.org/10.1145/1357054.1357127",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Aniket Kittur, Boris Smus, and Robert Kraut. 2011. CrowdForge: crowdsourcing complex work. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 1801–1806. https://doi.org/10.1145/1979742.1979902",
      "doi": "10.1145/1979742.1979902"
    },
    {
      "text": "Ranjay Krishna, Kenji Hata, Stephanie Chen, Joshua Kravitz, David A. Shamma, Li Fei-Fei, and Michael S. Bernstein. 2016. Embracing Error to Enable Rapid Crowdsourcing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3167–3179. https://doi.org/10.1145/2858036.2858115 arXiv:1602.04506 [cs].",
      "doi": "10.1145/2858036.2858115"
    },
    {
      "text": "Alina Kuznetsova, Hassan Rom, Neil Alldrin, Jasper Uijlings, Ivan Krasin, Jordi Pont-Tuset, Shahab Kamali, Stefan Popov, Matteo Malloci, Alexander Kolesnikov, Tom Duerig, and Vittorio Ferrari. 2020. The Open Images Dataset V4. International Journal of Computer Vision 128, 7 (July 2020), 1956–1981. https://doi.org/10.1007/s11263-020-01316-z",
      "doi": ""
    },
    {
      "text": "Joey J. Lee, Eduard Matamoros, Rafael Kern, Jenna Marks, Christian de Luna, and William Jordan-Cooley. 2013. Greenify: fostering sustainable communities via gamification. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 1497–1502. https://doi.org/10.1145/2468356.2468623",
      "doi": "10.1145/2468356.2468623"
    },
    {
      "text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, Lubomir Bourdev, Ross Girshick, James Hays, Pietro Perona, Deva Ramanan, C. Lawrence Zitnick, and Piotr Dollár. 2015. Microsoft COCO: Common Objects in Context. https://doi.org/10.48550/arXiv.1405.0312 arXiv:1405.0312 [cs].",
      "doi": ""
    },
    {
      "text": "Chris J. Lintott, Kevin Schawinski, Anze Slosar, Kate Land, Steven Bamford, Daniel Thomas, M. Jordan Raddick, Robert C. Nichol, Alex Szalay, Dan Andreescu, Phil Murray, and Jan van den Berg. 2008. Galaxy Zoo : Morphologies derived from visual inspection of galaxies from the Sloan Digital Sky Survey. Monthly Notices of the Royal Astronomical Society 389, 3 (Sept. 2008), 1179–1189. https://doi.org/10.1111/j.1365-2966.2008.13689.x arXiv:0804.4483 [astro-ph].",
      "doi": ""
    },
    {
      "text": "Ziwei Liu, Ping Luo, Xiaogang Wang, and Xiaoou Tang. 2015. Deep Learning Face Attributes in the Wild. In 2015 IEEE International Conference on Computer Vision (ICCV). 3730–3738. https://doi.org/10.1109/ICCV.2015.425 ISSN: 2380-7504.",
      "doi": "10.1109/ICCV.2015.425"
    },
    {
      "text": "I. Scott MacKenzie and Colin Ware. 1993. Lag as a determinant of human performance in interactive systems. In Proceedings of the INTERACT ’93 and CHI ’93 Conference on Human Factors in Computing Systems(CHI ’93). Association for Computing Machinery, New York, NY, USA, 488–493. https://doi.org/10.1145/169059.169431",
      "doi": "10.1145/169059.169431"
    },
    {
      "text": "Akihiro Miyata, Yusaku Murayama, Akihiro Furuta, Kazuki Okugawa, Keihiro Ochiai, and Yuko Murayama. 2022. Gamification strategies to improve the motivation and performance in accessibility information collection. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems(CHI EA ’22). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3491101.3519783",
      "doi": "10.1145/3491101.3519783"
    },
    {
      "text": "Meredith Ringel Morris, Jeffrey P. Bigham, Robin Brewer, Jonathan Bragg, Anand Kulkarni, Jessie Li, and Saiph Savage. 2017. Subcontracting Microwork. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 1867–1876. https://doi.org/10.1145/3025453.3025687",
      "doi": "10.1145/3025453.3025687"
    },
    {
      "text": "Yixin Nie, Xiang Zhou, and Mohit Bansal. 2020. What Can We Learn from Collective Human Opinions on Natural Language Inference Data?arXiv:2010.03532 [cs] (Oct. 2020). http://arxiv.org/abs/2010.03532 arXiv:2010.03532.",
      "doi": ""
    },
    {
      "text": "May Honey Ohn and Khin-Maung Ohn. 2019. An evaluation study on gamified online learning experiences and its acceptance among medical students. Tzu-Chi Medical Journal 32, 2 (June 2019), 211–215. https://doi.org/10.4103/tcmj.tcmj_5_19",
      "doi": ""
    },
    {
      "text": "Sharon Oviatt. 2006. Human-centered design meets cognitive load theory: designing interfaces that help people think. In Proceedings of the 14th ACM international conference on Multimedia(MM ’06). Association for Computing Machinery, New York, NY, USA, 871–880. https://doi.org/10.1145/1180639.1180831",
      "doi": "10.1145/1180639.1180831"
    },
    {
      "text": "Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. 2016. SQuAD: 100,000+ Questions for Machine Comprehension of Text. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, Austin, Texas, 2383–2392. https://doi.org/10.18653/v1/D16-1264",
      "doi": ""
    },
    {
      "text": "Joni O. Salminen, Hind Almerekhi, Milica Milenkovic, Soon-Gyo Jung, Jisun An, Haewoon Kwak, and Bernard Jim Jansen. 2018. Anatomy of Online Hate: Developing a Taxonomy and Machine Learning Models for Identifying and Classifying Hate in Online News Media. In International Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Eunjin Seong and Seungjun Kim. 2020. Designing a Crowdsourcing System for the Elderly: A Gamified Approach to Speech Collection. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382999",
      "doi": "10.1145/3334480.3382999"
    },
    {
      "text": "Nihar B. Shah, Sivaraman Balakrishnan, and Martin J. Wainwright. 2021. A Permutation-based Model for Crowd Labeling: Optimal Estimation and Robustness. IEEE Transactions on Information Theory 67, 6 (June 2021), 4162–4184. https://doi.org/10.1109/TIT.2020.3045613 arXiv:1606.09632 [cs, math, stat].",
      "doi": ""
    },
    {
      "text": "Gunnar A. Sigurdsson, Olga Russakovsky, Ali Farhadi, Ivan Laptev, and Abhinav Gupta. 2016. Much Ado About Time: Exhaustive Annotation of Temporal Data. https://doi.org/10.48550/arXiv.1607.07429 arXiv:1607.07429 [cs].",
      "doi": ""
    },
    {
      "text": "Rickard Stureborg, Bhuwan Dhingra, Jun Yang, and Lavanya Vasudevan. 2023. Development and validation of VaxConcerns: a taxonomy for vaccine concerns with crowdsource-viability. http://rickard.stureborg.com/papers/vax_taxonomy",
      "doi": ""
    },
    {
      "text": "Alexandra Swanson, Margaret Kosmala, Chris Lintott, Robert Simpson, Arfon Smith, and Craig Packer. 2015. Snapshot Serengeti, high-frequency annotated camera trap images of 40 mammalian species in an African savanna. Scientific Data 2, 1 (June 2015), 150026. https://doi.org/10.1038/sdata.2015.26 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "John Sweller. 2011. CHAPTER TWO - Cognitive Load Theory. In Psychology of Learning and Motivation, Jose P. Mestre and Brian H. Ross (Eds.). Vol. 55. Academic Press, 37–76. https://doi.org/10.1016/B978-0-12-387691-1.00002-8",
      "doi": ""
    },
    {
      "text": "James Thorne, Andreas Vlachos, Christos Christodoulopoulos, and Arpit Mittal. 2018. FEVER: a large-scale dataset for Fact Extraction and VERification. arXiv:1803.05355 [cs] (Dec. 2018). http://arxiv.org/abs/1803.05355 arXiv:1803.05355.",
      "doi": ""
    },
    {
      "text": "Grant Van Horn, Oisin Mac Aodha, Yang Song, Yin Cui, Chen Sun, Alex Shepard, Hartwig Adam, Pietro Perona, and Serge Belongie. 2018. The inaturalist species classification and detection dataset. In Proceedings of the IEEE conference on computer vision and pattern recognition. 8769–8778.",
      "doi": ""
    },
    {
      "text": "Carl Vondrick, Donald Patterson, and Deva Ramanan. 2013. Efficiently Scaling up Crowdsourced Video Annotation. International Journal of Computer Vision 101, 1 (Jan. 2013), 184–204. https://doi.org/10.1007/s11263-012-0564-1",
      "doi": "10.1007/s11263-012-0564-1"
    },
    {
      "text": "Jacob Whitehill, Ting-fan Wu, Jacob Bergsma, Javier Movellan, and Paul Ruvolo. 2009. Whose Vote Should Count More: Optimal Integration of Labels from Labelers of Unknown Expertise. In Advances in Neural Information Processing Systems, Vol. 22. Curran Associates, Inc.https://papers.nips.cc/paper/2009/hash/f899139df5e1059396431415e770c6dd-Abstract.html",
      "doi": ""
    },
    {
      "text": "Wayne A. Wickelgren. 1977. Speed-accuracy tradeoff and information processing dynamics. Acta Psychologica 41, 1 (Feb. 1977), 67–85. https://doi.org/10.1016/0001-6918(77)90012-9",
      "doi": ""
    },
    {
      "text": "Adina Williams, Nikita Nangia, and Samuel Bowman. 2018. A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long Papers) (New Orleans, Louisiana). Association for Computational Linguistics, 1112–1122. http://aclweb.org/anthology/N18-1101",
      "doi": ""
    },
    {
      "text": "Fisher Yu, Ari Seff, Yinda Zhang, Shuran Song, Thomas Funkhouser, and Jianxiong Xiao. 2016. LSUN: Construction of a Large-scale Image Dataset using Deep Learning with Humans in the Loop. https://doi.org/10.48550/arXiv.1506.03365 arXiv:1506.03365 [cs] version: 3.",
      "doi": ""
    },
    {
      "text": "Jingpu Zhang, Zuping Zhang, Zixiang Wang, Yuting Liu, and Lei Deng. 2018. Ontological function annotation of long non-coding RNAs through hierarchical multi-label classification. Bioinformatics 34, 10 (May 2018), 1750–1757. https://doi.org/10.1093/bioinformatics/btx833",
      "doi": ""
    },
    {
      "text": "Mingrui Ray Zhang, Shumin Zhai, and Jacob O. Wobbrock. 2019. Text Entry Throughput: Towards Unifying Speed and Accuracy in a Single Performance Metric. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300866",
      "doi": "10.1145/3290605.3300866"
    },
    {
      "text": "Xiang Zhou, Yixin Nie, and Mohit Bansal. 2021. Distributed NLI: Learning to Predict Human Opinion Distributions for Language Reasoning. arXiv:2104.08676 [cs] (April 2021). http://arxiv.org/abs/2104.08676 arXiv:2104.08676.",
      "doi": ""
    }
  ]
}