{
  "doi": "10.1145/3544548.3581000",
  "title": "IntimaSea: Exploring Shared Stress Display in Close Relationships",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Automatic stress tracking has become increasingly available on wearable devices. Research has investigated its use for individual stress management, largely within the traditional data-as-care framing. However, its use for stress sharing in social relationships, particularly close relationships, is still under explored. Inspired by the idea of “caring-through-data”, which focuses on mediating the social and emotional experiences of the collective “us” with data, this paper presents a design study with a prototype called IntimaSea, a display featuring illustrative stress data in collective forms to be shared among close relationships. The field trials with nine groups of intimately-connected users (N=19) highlight its potential on stress awareness, interpretation and management, as well as intimacy promotion. We end by discussing sharing stress for social ways of stress management, stress data as a meaningful social cue mediating relationships, as well as design implications for caring-through-data.",
  "tags": [
    "Stress",
    "Shared Stress Display",
    "Intimacy",
    "Close Relationships",
    "Stress Tracking",
    "Caring-through-data"
  ],
  "authors": [
    {
      "name": "Yanqi Jiang",
      "institution": "School of Computer Science, Shanghai Key Laboratory of Data Science, Fudan University, China and School of Computer Science, Shanghai Key Laboratory of Data Science, Fudan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366232",
      "orcid": "0000-0001-9433-4500"
    },
    {
      "name": "Xianghua(Sharon) Ding",
      "institution": "School of Computing Science, University of Glasgow, United Kingdom and School of Computing Science, University of Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81539424156/rel-imgonly/81539424156.png",
      "acmid": "81539424156",
      "orcid": "0000-0001-8122-6252"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, Hong Kong and Hong Kong University of Science and Technology, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    },
    {
      "name": "Zhida Sun",
      "institution": "Hong Kong University of Science and Technology, Hong Kong and Hong Kong University of Science and Technology, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659090601",
      "orcid": "0000-0003-4689-986X"
    },
    {
      "name": "Ning Gu",
      "institution": "School of Computer Science, Shanghai Key Laboratory of Data Science, Fudan University, China and School of Computer Science, Shanghai Key Laboratory of Data Science, Fudan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100501434",
      "orcid": "0000-0002-2915-974X"
    }
  ],
  "references": [
    {
      "text": "U Rajendra Acharya, K Paul Joseph, Natarajan Kannathal, Choo Min Lim, and Jasjit S Suri. 2006. Heart rate variability: a review. Medical and biological engineering and computing 44, 12(2006), 1031–1051.",
      "doi": ""
    },
    {
      "text": "Petra Ahde and Jussi Mikkonen. 2008. Hello: Bracelets Communicating Nearby Presence of Friends. In Proceedings of the Tenth Anniversary Conference on Participatory Design 2008 (Bloomington, Indiana) (PDC ’08). Indiana University, USA, 324–325.",
      "doi": ""
    },
    {
      "text": "Fatema Akbar. 2021. Stress and Human-Computer Interaction at the Workplace: Unobtrusive Tracking With Wearable Sensors and Computer Logs. University of California, Irvine, Irvine, CA, USA.",
      "doi": ""
    },
    {
      "text": "Siham M Al-Momani. 2013. Informal social support: a collaborative stress management initiative for mothers of cancer children. International Journal of Psychological Studies 5, 2 (2013), 19.",
      "doi": ""
    },
    {
      "text": "Uddipana Baishya and Carman Neustaedter. 2017. In Your Eyes: Anytime, Anywhere Video and Audio Streaming for Couples. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 84–97. https://doi.org/10.1145/2998181.2998200",
      "doi": "10.1145/2998181.2998200"
    },
    {
      "text": "Lisa Feldman Barrett and Christiana Westlin. 2021. Navigating the science of emotion. In Emotion measurement. Elsevier, UK, 39–84.",
      "doi": ""
    },
    {
      "text": "Elin A Björling, Honson Ling, Simran Bhatia, and Kimberly Dziubinski. 2020. The Experience and Effect of Adolescent to Robot Stress Disclosure: A Mixed-Methods Exploration. In International Conference on Social Robotics. Springer, Springer-Verlag, Berlin, Heidelberg, 604–615.",
      "doi": "10.1007/978-3-030-62056-1_50"
    },
    {
      "text": "Guy Bodenmann. 1997. Dyadic coping-a systematic-transactional view of stress and coping among couples: Theory and empirical findings. European Review of Applied Psychology 47 (1997), 137–140.",
      "doi": ""
    },
    {
      "text": "Andrey Bogomolov, Bruno Lepri, Michela Ferron, Fabio Pianesi, and Alex (Sandy) Pentland. 2014. Daily Stress Recognition from Mobile Phone Data, Weather Conditions and Individual Traits. In Proceedings of the 22nd ACM International Conference on Multimedia (Orlando, Florida, USA) (MM ’14). Association for Computing Machinery, New York, NY, USA, 477–486. https://doi.org/10.1145/2647868.2654933",
      "doi": "10.1145/2647868.2654933"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Angela Chang, Sile O’Modhrain, Rob Jacob, Eric Gunther, and Hiroshi Ishii. 2002. ComTouch: design of a vibrotactile communication device. In Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques. Association for Computing Machinery, New York, NY, USA, 312–320.",
      "doi": "10.1145/778712.778755"
    },
    {
      "text": "Angela Chang, Ben Resner, Brad Koerner, XingChen Wang, and Hiroshi Ishii. 2001. LumiTouch: an emotional communication device. In CHI’01 extended abstracts on Human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 313–314.",
      "doi": ""
    },
    {
      "text": "Stephanie Cheung, Elizabeth Han, Azadeh Kushki, Evdokia Anagnostou, and Elaine Biddiss. 2016. Biomusic: An auditory interface for detecting physiological indicators of anxiety in children. Frontiers in neuroscience 10 (2016), 401.",
      "doi": ""
    },
    {
      "text": "Hyunsung Cho, Jinyoung Oh, Juho Kim, and Sung-Ju Lee. 2020. I share, you care: Private status sharing and sender-controlled notifications in mobile instant messaging. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–25.",
      "doi": "10.1145/3406865.3418571"
    },
    {
      "text": "Karen Anne Cochrane. 2019. Reconnecting the Body and the Mind: Technology to Support Mindfulness for Stress. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–6.",
      "doi": "10.1145/3290607.3299083"
    },
    {
      "text": "Sunny Consolvo, Ian E Smith, Tara Matthews, Anthony LaMarca, Jason Tabert, and Pauline Powledge. 2005. Location disclosure to social relations: why, when, & what people want to share. In Proceedings of the SIGCHI conference on Human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 81–90.",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "Scott Counts and Eric Fellheimer. 2004. Supporting social presence through lightweight photo sharing on and off the desktop. In Proceedings of the SIGCHI conference on Human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 599–606.",
      "doi": "10.1145/985692.985768"
    },
    {
      "text": "Franco Curmi, Maria Angela Ferrario, Jen Southern, and Jon Whittle. 2013. HeartLink: open broadcast of live biometric data to social networks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1749–1758.",
      "doi": "10.1145/2470654.2466231"
    },
    {
      "text": "Thomas Dalsgaard, Mikael B Skov, and Bo Ramsdahl Thomassen. 2007. eKISS: sharing experiences in families through a picture blog. In Proceedings of HCI 2007 The 21st British HCI Group Annual Conference University of Lancaster, UK 21. BCS Learning & Development Ltd., Swindon, GBR, 1–10.",
      "doi": ""
    },
    {
      "text": "Thecla Damianakis, Kimberley Wilson, and Elsa Marziali. 2018. Family caregiver support groups: spiritual reflections’ impact on stress management. Aging & mental health 22, 1 (2018), 70–76.",
      "doi": ""
    },
    {
      "text": "Kevin Daniels and Andrew Guppy. 1994. Occupational stress, social support, job control, and psychological well-being. Human Relations 47, 12 (1994), 1523–1544.",
      "doi": ""
    },
    {
      "text": "Anita DeLongis and Tess O’Brien. 2018. An interpersonal framework for stress and coping: An application to the families of Alzheimer’s patients. In Stress and coping in later-life families. Taylor & Francis, London, UK, 221–239.",
      "doi": ""
    },
    {
      "text": "Arindam Dey, Thammathip Piumsomboon, Youngho Lee, and Mark Billinghurst. 2017. Effects of sharing physiological states of players in a collaborative virtual reality gameplay. In Proceedings of the 2017 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 4045–4056.",
      "doi": "10.1145/3025453.3026028"
    },
    {
      "text": "Anind K Dey and Ed de Guzman. 2006. From awareness to connectedness: the design and deployment of presence displays. In Proceedings of the SIGCHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 899–908.",
      "doi": "10.1145/1124772.1124905"
    },
    {
      "text": "Suzanne Dikker, Sean Montgomery, and Suzan Tunca. 2019. Using synchrony-based neurofeedback in search of human connectedness. In Brain art. Springer, Cham, 161–206.",
      "doi": ""
    },
    {
      "text": "Xianghua Ding, Shuhan Wei, Xinning Gui, Ning Gu, and Peng Zhang. 2021. Data Engagement Reconsidered: A Study of Automatic Stress Tracking Technology in Use. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3411764.3445763"
    },
    {
      "text": "Francine Ducharme, Véronique Dubé, Louise Lévesque, Diane Saulnier, and Francine Giroux. 2011. An online stress management training program as a supportive nursing intervention for family caregivers of an elderly person. Canadian Journal of Nursing Informatics 6, 2 (2011), 1–19.",
      "doi": ""
    },
    {
      "text": "Veera Ehrlén. 2021. Tracking oneself for others: Communal and self-motivational value of sharing exercise data online. Leisure Studies 40, 4 (2021), 545–560.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Aisling O’Kane, Paul Marshall, Abigail Durrant, Rowanne Fleck, John Rooksby, and Deborah Lupton. 2017. Quantified data & social relationships. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 644–651.",
      "doi": "10.1145/3027063.3027065"
    },
    {
      "text": "Bernard T Engel and Ray A Chism. 1967. Effect of increases and decreases in breathing rate on heart rate and finger pulse volume. Psychophysiology 4, 1 (1967), 83–89.",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, Alan Borning, and James Fogarty. 2013. Fine-grained sharing of sensed physical activity: A value sensitive approach. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. Association for Computing Machinery, New York, NY, USA, 489–498.",
      "doi": "10.1145/2493432.2493433"
    },
    {
      "text": "Brian A Esterling, Michael H Antoni, Mary Ann Fletcher, Scott Margulies, and Neil Schneiderman. 1994. Emotional disclosure through writing or speaking modulates latent Epstein-Barr virus antibody titers.Journal of consulting and clinical psychology 62, 1(1994), 130.",
      "doi": ""
    },
    {
      "text": "Fabric.js. 2023. Fabric.js Javascript Canvas Library. http://fabricjs.com/. [Last accessed: January 19, 2023].",
      "doi": ""
    },
    {
      "text": "Julien Fatisson, Victor Oswald, and François Lalonde. 2016. Influence diagram of physiological and environmental factors affecting heart rate variability: an extended literature overview. Heart international 11, 1 (2016), e32—e40. https://doi.org/10.5301/heartint.5000232",
      "doi": ""
    },
    {
      "text": "Milou A Feijt, Joyce HDM Westerink, Yvonne AW De Kort, and Wijnand A IJsselsteijn. 2021. Sharing biosignals: An analysis of the experiential and communication properties of interpersonal psychophysiology. Human–Computer Interaction 38, 1 (2021), 1–30.",
      "doi": ""
    },
    {
      "text": "Edna B Foa, Laurie Cashman, Lisa Jaycox, and Kevin Perry. 1997. The validation of a self-report measure of posttraumatic stress disorder: the Posttraumatic Diagnostic Scale.Psychological assessment 9, 4 (1997), 445.",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Dane Acena. 2021. Hugging from A Distance: Building Interpersonal Relationships in Social Virtual Reality. In ACM International Conference on Interactive Media Experiences (Virtual Event, USA) (IMX ’21). Association for Computing Machinery, New York, NY, USA, 84–95. https://doi.org/10.1145/3452918.3458805",
      "doi": "10.1145/3452918.3458805"
    },
    {
      "text": "Jérémy Frey, May Grabli, Ronit Slyper, and Jessica R Cauchard. 2018. Breeze: Sharing biofeedback through wearable technologies. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3174219"
    },
    {
      "text": "Kasper Garnæs, Olga Grünberger, Jesper Kjeldskov, and Mikael B Skov. 2007. Designing technologies for presence-in-absence: illustrating the Cube and the Picture Frame. Personal and Ubiquitous Computing 11, 5 (2007), 403–408.",
      "doi": "10.1007/s00779-006-0072-9"
    },
    {
      "text": "William W Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI conference on Human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 233–240.",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Tom Gayler, Corina Sas, and Vaiva Kalnikaite. 2020. Material Food Probe: Personalized 3D Printed Flavors for Emotional Communication in Intimate Relationships. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 965–978.",
      "doi": "10.1145/3357236.3395533"
    },
    {
      "text": "Steven Gelineck. 2015. Evaluating Intimacy and Ludic Engagement with a Musical Interactive Art Installation that Explores Remote Abstract Communication. In International Conference on Universal Access in Human-Computer Interaction. Springer, Springer International Publishing, Cham, 53–64.",
      "doi": ""
    },
    {
      "text": "Renaud Gervais, Jérémy Frey, Alexis Gay, Fabien Lotte, and Martin Hachet. 2016. Tobe: Tangible out-of-body experience. In Proceedings of the TEI’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. Association for Computing Machinery, New York, NY, USA, 227–235.",
      "doi": "10.1145/2839462.2839486"
    },
    {
      "text": "Martin R Gibbs, Frank Vetere, Marcus Bunyan, and Steve Howard. 2005. SynchroMate: a phatic technology for mediating intimacy. In Proceedings of the 2005 conference on Designing for User eXperience. AIGA: American Institute of Graphic Arts, New York, NY, USA, 37–es.",
      "doi": ""
    },
    {
      "text": "Ashish Godbole and Waleed W Smari. 2006. A methodology and design process for system generated user interruption based on context, preferences, and situation awareness. In 2006 IEEE International Conference on Information Reuse & Integration. IEEE, IEEE, Waikoloa, HI, USA, 608–616.",
      "doi": ""
    },
    {
      "text": "Vishwa Goudar and Miodrag Potkonjak. 2014. Addressing biosignal data sharing security issues with robust watermarking. In 2014 Eleventh Annual IEEE International Conference on Sensing, Communication, and Networking (SECON). IEEE, IEEE, Singapore, 618–626.",
      "doi": ""
    },
    {
      "text": "Stefan Gradl, Markus Wirth, Robert Richer, Nicolas Rohleder, and Bjoern M Eskofier. 2019. An overview of the feasibility of permanent, real-time, unobtrusive stress measurement with current wearables. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare. Association for Computing Machinery, New York, NY, USA, 360–365.",
      "doi": "10.1145/3329189.3329233"
    },
    {
      "text": "Carla F Griggio, Arissa J Sato, Wendy E Mackay, and Koji Yatani. 2021. Mediating Intimacy with DearBoard: a Co-Customizable Keyboard for Everyday Messaging. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": "10.1145/3411764.3445757"
    },
    {
      "text": "Edward Twitchell Hall. 1976. Beyond culture. Anchor, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Lars Hallnäs and Johan Redström. 2001. Slow technology–designing for reflection. Personal and ubiquitous computing 5, 3 (2001), 201–212.",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Marc Hassenzahl, Stephanie Heidecker, Kai Eckoldt, Sarah Diefenbach, and Uwe Hillmann. 2012. All you need is love: Current strategies of mediating intimate relationships through technology. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 4(2012), 1–19.",
      "doi": "10.1145/2395131.2395137"
    },
    {
      "text": "Mariam Hassib, Daniel Buschek, Paweł W Wozniak, and Florian Alt. 2017. HeartChat: Heart rate augmented mobile chat to support empathy and awareness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2239–2251.",
      "doi": "10.1145/3025453.3025758"
    },
    {
      "text": "Mariam Hassib, Mohamed Khamis, Stefan Schneegass, Ali Sahami Shirazi, and Florian Alt. 2016. Investigating user needs for bio-sensing and affective wearables. In Proceedings of the 2016 CHI conference extended abstracts on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1415–1422.",
      "doi": "10.1145/2851581.2892480"
    },
    {
      "text": "Miriam I Hehlmann, Brian Schwartz, Teresa Lutz, Juan Martín Gómez Penedo, Julian A Rubel, and Wolfgang Lutz. 2021. The use of digitally assessed stress levels to model change processes in CBT-a feasibility study on seven case examples. Frontiers in Psychiatry 12 (2021), 258.",
      "doi": ""
    },
    {
      "text": "Noura Howell, John Chuang, Abigail De Kosnik, Greg Niemeyer, and Kimiko Ryokai. 2018. Emotional biosensing: Exploring critical alternatives. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–25.",
      "doi": "10.1145/3274338"
    },
    {
      "text": "Noura Howell, Laura Devendorf, Rundong Tian, Tomás Vega Galvez, Nan-Wei Gong, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. Biosignals as social cues: Ambiguity and emotional interpretation in social displays of skin conductance. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. Association for Computing Machinery, New York, NY, USA, 865–870.",
      "doi": "10.1145/2901790.2901850"
    },
    {
      "text": "Noura Howell, Greg Niemeyer, and Kimiko Ryokai. 2019. Life-affirming biosensing in public: Sounding heartbeats on a red bench. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": "10.1145/3290605.3300910"
    },
    {
      "text": "Garmin Inc.2023. Garmin. https://www.garmin.com/. [Last accessed: January 19, 2023].",
      "doi": ""
    },
    {
      "text": "Huawei Inc.2023. Huawei. https://consumer.huawei.com/en/wearables/. [Last accessed: January 19, 2023].",
      "doi": ""
    },
    {
      "text": "Samsung Inc.2023. Samsung Galaxy Watch5. https://www.samsung.com/global/galaxy/galaxy-watch5/. [Last accessed: January 19, 2023].",
      "doi": ""
    },
    {
      "text": "Joris H Janssen, Jeremy N Bailenson, Wijnand A IJsselsteijn, and Joyce HDM Westerink. 2010. Intimate heartbeats: Opportunities for affective communication technology. IEEE Transactions on Affective Computing 1, 2 (2010), 72–80.",
      "doi": "10.1109/T-AFFC.2010.13"
    },
    {
      "text": "Sukran Karaosmanoglu, Katja Rogers, Dennis Wolf, Enrico Rukzio, Frank Steinicke, and Lennart E. Nacke. 2021. Feels like Team Spirit: Biometric and Strategic Interdependence in Asymmetric Multiplayer VR Games. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 443, 15 pages. https://doi.org/10.1145/3411764.3445492",
      "doi": "10.1145/3411764.3445492"
    },
    {
      "text": "Joseph’Jofish’ Kaye, Mariah K Levitt, Jeffrey Nevins, Jessica Golden, and Vanessa Schmidt. 2005. Communicating intimacy one bit at a time. In CHI’05 extended abstracts on Human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1529–1532.",
      "doi": ""
    },
    {
      "text": "Karen Kayser, Lisa E Watson, and Joel T Andrade. 2007. Cancer as a\" we-disease\": Examining the process of coping from a relational perspective.Families, Systems, & Health 25, 4 (2007), 404.",
      "doi": ""
    },
    {
      "text": "Elizabeth Kaziunas, Mark S Ackerman, Silvia Lindtner, and Joyce M Lee. 2017. Caring through data: Attending to the social and emotional experiences of health datafication. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. Association for Computing Machinery, New York, NY, USA, 2260–2272.",
      "doi": "10.1145/2998181.2998303"
    },
    {
      "text": "Ryan Kelly, Daniel Gooch, Bhagyashree Patil, and Leon Watts. 2017. Demanding by design: Supporting effortful communication practices in close personal relationships. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. Association for Computing Machinery, New York, NY, USA, 70–83.",
      "doi": "10.1145/2998181.2998184"
    },
    {
      "text": "Ryan Kelly and Leon Watts. 2015. Characterising the inventive appropriation of emoji as relationally meaningful in mediated close personal relationships. Experiences of technology appropriation: Unanticipated users, usage, circumstances, and design 2(2015), 1–8.",
      "doi": ""
    },
    {
      "text": "Nicky Kern and Bernt Schiele. 2003. Context-Aware Notification for Wearable Computing. In Proceedings of the 7th IEEE International Symposium on Wearable Computers(ISWC ’03). IEEE Computer Society, USA, 223.",
      "doi": ""
    },
    {
      "text": "Elisabeth Kersten-van Dijk and Wijnand A IJsselsteijn. 2016. Design Beyond the Numbers: Sharing, Comparing, Storytelling and the Need for a Quantified Us.IxD&A 29(2016), 121–135.",
      "doi": ""
    },
    {
      "text": "Hye-Geum Kim, Eun-Jin Cheon, Dai-Seg Bai, Young Hwan Lee, and Bon-Hoon Koo. 2018. Stress and heart rate variability: a meta-analysis and review of the literature. Psychiatry investigation 15, 3 (2018), 235.",
      "doi": ""
    },
    {
      "text": "Jina Kim, Young-Woo Park, and Tek-Jin Nam. 2015. BreathingFrame: An inflatable frame for remote breath signal sharing. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. Association for Computing Machinery, New York, NY, USA, 109–112.",
      "doi": "10.1145/2677199.2680606"
    },
    {
      "text": "Megan Knittel, Faye Kollig, Abrielle Mason, and Rick Wash. 2021. Anyone else have this experience: Sharing the Emotional Labor of Tracking Data About Me. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–30.",
      "doi": "10.1145/3449153"
    },
    {
      "text": "Jan Kučera, James Scott, Siân Lindley, and Patrick Olivier. 2021. Bedtime Window: A Field Study Connecting Bedrooms of Long-Distance Couples Using a Slow Photo-Stream and Shared Real-Time Inking. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": ""
    },
    {
      "text": "Daniel Lambton-Howard, Patrick Olivier, Vasilis Vlachokyriakos, Hanna Celina, and Ahmed Kharrufa. 2020. Unplatformed Design: A Model for Appropriating Social Media Technologies for Coordinated Participation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376179",
      "doi": "10.1145/3313831.3376179"
    },
    {
      "text": "Hannakaisa Lansisalmi, Jose M Peiro, and Mika Kivimaki IV. 2000. Collective stress and coping in the context of organizational culture. European journal of work and organizational psychology 9, 4 (2000), 527–559.",
      "doi": ""
    },
    {
      "text": "Richard S Lazarus, Anita DeLongis, Susan Folkman, and Rand Gruen. 1985. Stress and adaptational outcomes: The problem of confounded measures.American Psychologist 40, 7 (1985), 770–779.",
      "doi": ""
    },
    {
      "text": "Paul M Lehrer, Evgeny Vaschillo, and Bronya Vaschillo. 2000. Resonant frequency biofeedback training to increase cardiac variability: Rationale and manual for training. Applied psychophysiology and biofeedback 25, 3 (2000), 177–191.",
      "doi": ""
    },
    {
      "text": "Stephen J Lepore and Joshua M Smyth. 2002. The writing cure: How expressive writing promotes health and emotional well-being.American Psychological Association, Washington, DC, USA.",
      "doi": ""
    },
    {
      "text": "Sharron SK Leung, Vico CL Chiang, Ying-yu Chui, Angel CK Lee, and Yim-wah Mak. 2011. Feasibility and potentials of online support for stress management among secondary school teachers. Stress and Health 27, 3 (2011), e282–e286.",
      "doi": ""
    },
    {
      "text": "Fenghua Li, Peida Xu, Shichun Zheng, Wenfeng Chen, Yang Yan, Suo Lu, and Zhengkui Liu. 2018. Photoplethysmography based psychological stress detection with pulse rate variability feature differences and elastic net. International Journal of Distributed Sensor Networks 14, 9 (2018), 1550147718803298.",
      "doi": ""
    },
    {
      "text": "Wan-Hua Lin, Dan Wu, Chunyue Li, Heye Zhang, and Yuan-Ting Zhang. 2014. Comparison of heart rate variability from PPG with that from ECG. In The international conference on health informatics. Springer, Springer, Cham, 213–215.",
      "doi": ""
    },
    {
      "text": "Kristen A Lindquist, Joshua Conrad Jackson, Joseph Leshin, Ajay B Satpute, and Maria Gendron. 2022. The cultural evolution of emotion. Nature Reviews Psychology 2022, 1 (2022), 1–13.",
      "doi": ""
    },
    {
      "text": "Honson Ling and Elin Björling. 2020. Sharing stress with a robot: what would a robot say?Human-Machine Communication 1 (2020), 133–159.",
      "doi": ""
    },
    {
      "text": "Fannie Liu. 2019. Expressive biosignals: Authentic social cues for social connection. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–5.",
      "doi": "10.1145/3290607.3299081"
    },
    {
      "text": "Fannie Liu, Laura Dabbish, and Geoff Kaufman. 2017. Can biosignals be expressive? how visualizations affect impression formation from shared brain activity. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–21.",
      "doi": ""
    },
    {
      "text": "Fannie Liu, Laura Dabbish, and Geoff Kaufman. 2017. Supporting social interactions with an expressive heart rate sharing application. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–26.",
      "doi": "10.1145/3134706"
    },
    {
      "text": "Fannie Liu, Chunjong Park, Yu Jiang Tham, Tsung-Yu Tsai, Laura Dabbish, Geoff Kaufman, and Andrés Monroy-Hernández. 2021. Significant Otter: Understanding the Role of Biosignals in Communication. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3411764.3445200"
    },
    {
      "text": "M Lynne Markus and Terry Connolly. 1990. Why CSCW applications fail: Problems in the adoption of interdependent work tools. In Proceedings of the 1990 ACM conference on Computer-supported cooperative work. Association for Computing Machinery, New York, NY, USA, 371–380.",
      "doi": "10.1145/99332.99368"
    },
    {
      "text": "Diana MacLean, Asta Roseway, and Mary Czerwinski. 2013. MoodWings: a wearable biofeedback device for real-time stress intervention. In Proceedings of the 6th international conference on Pervasive Technologies Related to Assistive Environments. Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": "10.1145/2504335.2504406"
    },
    {
      "text": "Marek Malik. 1996. Heart rate variability: Standards of measurement, physiological interpretation, and clinical use: Task force of the European Society of Cardiology and the North American Society for Pacing and Electrophysiology. Annals of Noninvasive Electrocardiology 1, 2 (1996), 151–181.",
      "doi": ""
    },
    {
      "text": "Adriana M Manago, Tamara Taylor, and Patricia M Greenfield. 2012. Me and my 400 friends: The anatomy of college students’ Facebook networks, their communication patterns, and well-being.Developmental psychology 48, 2 (2012), 369.",
      "doi": ""
    },
    {
      "text": "Nick Merrill and Coye Cheshire. 2017. Trust your heart: Assessing cooperation and trust with biosignals in computer-mediated interactions. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. Association for Computing Machinery, New York, NY, USA, 2–12.",
      "doi": "10.1145/2998181.2998286"
    },
    {
      "text": "Tina Marie Meyer. 2003. Life stress and emotional regulation strategies during a personal disclosure task: Health implications for patients with rheumatoid arthritis. Wayne State University, Detroit, MI, USA.",
      "doi": ""
    },
    {
      "text": "Clara Moge, Katherine Wang, and Youngjun Cho. 2022. Shared User Interfaces of Physiological Data: Systematic Review of Social Biofeedback Systems and Contexts in HCI. In CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": ""
    },
    {
      "text": "Stuart Moran, Nils Jäger, Holger Schnädelbach, and Kevin Glover. 2016. ExoPranayama: a biofeedback-driven actuated environment for supporting yoga breathing practices. Personal and Ubiquitous Computing 20, 2 (2016), 261–275.",
      "doi": "10.1007/s00779-016-0910-3"
    },
    {
      "text": "Daphna Sabo Mordechay, Bracha Nir, and Zohar Eviatar. 2019. Expressive writing-Who is it good for? Individual differences in the improvement of mental health resulting from expressive writing. Complementary therapies in clinical practice 37 (2019), 115–121.",
      "doi": ""
    },
    {
      "text": "Tuija Muhonen and Eva Torkelson. 2008. Collective and individualistic coping with stress at work. Psychological reports 102, 2 (2008), 450–458.",
      "doi": ""
    },
    {
      "text": "Elizabeth L Murnane, Xin Jiang, Anna Kong, Michelle Park, Weili Shi, Connor Soohoo, Luke Vink, Iris Xia, Xin Yu, John Yang-Sammataro, 2020. Designing ambient narrative-based interfaces to reflect and motivate physical activity. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376478"
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical design in HCI research: designing and learning through use-it-yourself. In Proceedings of the Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 514–523.",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Kenton P O’Hara, Michael Massimi, Richard Harper, Simon Rubens, and Jessica Morris. 2014. Everyday dwelling with WhatsApp. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. Association for Computing Machinery, New York, NY, USA, 1131–1143.",
      "doi": "10.1145/2531602.2531679"
    },
    {
      "text": "Yaakov Ophir. 2017. SOS on SNS: Adolescent distress on social network sites. Computers in Human Behavior 68 (2017), 51–55.",
      "doi": "10.1016/j.chb.2016.11.025"
    },
    {
      "text": "Olugbenga Oti, Iman Azimi, Arman Anzanpour, Amir M Rahmani, Anna Axelin, and Pasi Liljeberg. 2018. IoT-based healthcare system for real-time maternal stress monitoring. In Proceedings of the 2018 IEEE/ACM International Conference on Connected Health: Applications, Systems and Engineering Technologies. Association for Computing Machinery, New York, NY, USA, 57–62.",
      "doi": "10.1145/3278576.3278596"
    },
    {
      "text": "James W Pennebaker. 1993. Putting stress into words: Health, linguistic, and therapeutic implications. Behaviour research and therapy 31, 6 (1993), 539–548.",
      "doi": ""
    },
    {
      "text": "Laura Pina, Sang-Wha Sien, Clarissa Song, Teresa M. Ward, James Fogarty, Sean A. Munson, and Julie A. Kientz. 2020. DreamCatcher: Exploring How Parents and School-Age Children Can Track and Review Sleep Information Together. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 070 (may 2020), 25 pages. https://doi.org/10.1145/3392882",
      "doi": "10.1145/3392882"
    },
    {
      "text": "Sara Price, Nadia Bianchi-Berthouze, Carey Jewitt, Nikoleta Yiannoutsou, Katerina Fotopoulou, Svetlana Dajic, Juspreet Virdee, Yixin Zhao, Douglas Atkinson, and Frederik Brudy. 2022. The Making of Meaning through Dyadic Haptic Affective Touch. ACM Trans. Comput.-Hum. Interact. 29, 3, Article 21 (jan 2022), 42 pages. https://doi.org/10.1145/3490494",
      "doi": "10.1145/3490494"
    },
    {
      "text": "James Campbell Quick and Demetria F Henderson. 2016. Occupational stress: Preventing suffering, enhancing wellbeing. International journal of environmental research and public health 13, 5(2016), 459.",
      "doi": ""
    },
    {
      "text": "Clarissa ME Richardson and Kenneth G Rice. 2015. Self-critical perfectionism, daily stress, and disclosure of daily emotional events.Journal of counseling psychology 62, 4 (2015), 694.",
      "doi": ""
    },
    {
      "text": "Hugh Robertson. 2000. Is stress a sign of weakness?https://www.theguardian.com/society/2000/nov/09/publicsectorcareers.careers. [Last accessed: January 19, 2023].",
      "doi": ""
    },
    {
      "text": "Raquel Breejon Robinson, Elizabeth Reid, James Collin Fey, Ansgar E Depping, Katherine Isbister, and Regan L Mandryk. 2020. Designing and Evaluating’In the Same Boat’, A Game of Embodied Synchronization for Enhancing Social Play. In Proceedings of the 2020 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": ""
    },
    {
      "text": "Isabel Rodríguez, Malgorzata Wanda Kozusznik, José María Peiró, and Núria Tordera. 2019. Individual, co-active and collective coping and organizational stress: A longitudinal study. European Management Journal 37, 1 (2019), 86–98.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Elsa Vaara, Claus Weymann, Markus Bylund, Pedro Ferreira, Nathalie Peira, and Marie Sjölinder. 2010. Mind the body! Designing a mobile stress management application encouraging personal reflection. In Proceedings of the 8th ACM conference on designing interactive systems. Association for Computing Machinery, New York, NY, USA, 47–56.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst. 2006. Breath, skin and clothing: Using wearable technologies as an interface into ourselves. International Journal of Performance Arts and Digital Media 2, 2(2006), 171–186.",
      "doi": ""
    },
    {
      "text": "Hans Selye. 1965. The stress syndrome. The American Journal of Nursing 65, 3 (1965), 97–99.",
      "doi": ""
    },
    {
      "text": "Richard B Slatcher and James W Pennebaker. 2006. How do I love thee? Let me count the words: The social effects of expressive writing. Psychological Science 17, 8 (2006), 660–664.",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Joris Janssen, and Geraldine Fitzpatrick. 2012. Understanding heart rate sharing: towards unpacking physiosocial space. In Proceedings of the SIGCHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 859–868.",
      "doi": "10.1145/2207676.2208526"
    },
    {
      "text": "Jaime Snyder, Mark Matthews, Jacqueline Chien, Pamara F Chang, Emily Sun, Saeed Abdullah, and Geri Gay. 2015. Moodlight: Exploring personal and social implications of ambient display of biosensor data. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. Association for Computing Machinery, New York, NY, USA, 143–153.",
      "doi": "10.1145/2675133.2675191"
    },
    {
      "text": "Stefanie P Spera, Eric D Buhrfeind, and James W Pennebaker. 1994. Expressive writing and coping with job loss. Academy of management journal 37, 3 (1994), 722–733.",
      "doi": ""
    },
    {
      "text": "L Alan Sroufe. 1971. Effects of depth and rate of breathing on heart rate and heart rate variability. Psychophysiology 8, 5 (1971), 648–655.",
      "doi": ""
    },
    {
      "text": "Ekaterina R Stepanova, John Desnoyers-Stewart, Kristina Höök, and Bernhard E Riecke. 2022. Strategies for Fostering a Genuine Feeling of Connection in Technologically Mediated Systems. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–26.",
      "doi": "10.1145/3491102.3517580"
    },
    {
      "text": "Ekaterina R Stepanova, John Desnoyers-Stewart, Philippe Pasquier, and Bernhard E Riecke. 2020. JeL: breathing together to connect with others and nature. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 641–654.",
      "doi": "10.1145/3357236.3395532"
    },
    {
      "text": "Stefan Stepanovic, Vadym Mozgovoy, and Tobias Mettler. 2019. Designing Visualizations for Workplace Stress Management: Results of a Pilot Study at a Swiss Municipality. In International Conference on Electronic Government. Springer, Springer, Cham, 94–104.",
      "doi": "10.1007/978-3-030-27325-5_8"
    },
    {
      "text": "Rob Strong, Bill Gaver, 1996. Feather, scent and shaker: supporting simple intimacy. In Proceedings of CSCW, Vol. 96. Association for Computing Machinery, New York, NY, USA, 29–30.",
      "doi": ""
    },
    {
      "text": "Feng-Tso Sun, Cynthia Kuo, Heng-Tze Cheng, Senaka Buthpitiya, Patricia Collins, and Martin Griss. 2010. Activity-aware mental stress detection using physiological sensors. In International conference on Mobile computing, applications, and services. Springer, Springer, Berlin, Heidelberg, 282–301.",
      "doi": ""
    },
    {
      "text": "Zhida Sun, Manuele Reani, Quan Li, and Xiaojuan Ma. 2020. Fostering engagement in technology-mediated stress management: A comparative study of biofeedback designs. International Journal of Human-Computer Studies 140 (2020), 102430.",
      "doi": ""
    },
    {
      "text": "Kenji Suzuki and Shuji Hashimoto. 2004. Feellight: a communication device for distant nonverbal exchange. In Proceedings of the 2004 ACM SIGMM workshop on Effective telepresence. Association for Computing Machinery, New York, NY, USA, 40–44.",
      "doi": "10.1145/1026776.1026786"
    },
    {
      "text": "Chiew Seng Sean Tan, Johannes Schöning, Kris Luyten, and Karin Coninx. 2014. Investigating the effects of using biofeedback as visual stress indicator during video-mediated collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 71–80.",
      "doi": ""
    },
    {
      "text": "Himanshu Thapliyal, Vladislav Khalus, and Carson Labrado. 2017. Stress detection and management: A survey of wearable smart health devices. IEEE Consumer Electronics Magazine 6, 4 (2017), 64–69.",
      "doi": ""
    },
    {
      "text": "John W Thibaut and Harold H Kelley. 1959. The social psychology of groups(1st ed.). Routledge, UK.",
      "doi": ""
    },
    {
      "text": "Hitomi Tsujita, Itiro Siio, and Koji Tsukada. 2007. SyncDecor: appliances for sharing mutual awareness between lovers separated by distance. In CHI’07 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2699–2704.",
      "doi": ""
    },
    {
      "text": "AV Turankar, S Jain, SB Patel, SR Sinha, AD Joshi, BN Vallish, PR Mane, and SA Turankar. 2013. Effects of slow breathing exercise on cardiovascular functions, pulmonary functions & galvanic skin resistance in healthy human volunteers-a pilot study. The Indian journal of medical research 137, 5 (2013), 916.",
      "doi": ""
    },
    {
      "text": "Mengru Xue, Rong-Hao Liang, Jun Hu, and Loe Feijs. 2017. ClockViz: Designing public visualization for coping with collective stress in teamwork. In Proceedings of the Conference on Design and Semantics of Form and Movement-Sense and Sensitivity, DeSForM 2017. IntechOpen, IntechOpen, Rijeka, 67–78.",
      "doi": ""
    },
    {
      "text": "Mengru Xue, Rong-Hao Liang, Jun Hu, Bin Yu, and Loe Feijs. 2022. Understanding How Group Workers Reflect on Organizational Stress with a Shared, Anonymous Heart Rate Variability Data Visualization. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 27, 7 pages. https://doi.org/10.1145/3491101.3503576",
      "doi": "10.1145/3491101.3503576"
    },
    {
      "text": "Mengru Xue, Rong-Hao Liang, Bin Yu, Mathias Funk, Jun Hu, and Loe Feijs. 2019. AffectiveWall: Designing Collective Stress-Related Physiological Data Visualization for Reflection. IEEE Access 7(2019), 131289–131303.",
      "doi": ""
    },
    {
      "text": "Huizhong Ye, Zengrong Guo, and Rong-Hao Liang. 2021. Asynchronous Co-Dining: Enhancing the Intimacy in Remote Co-Dining Experience Through Audio Recordings. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. Association for Computing Machinery, New York, NY, USA, 1–6.",
      "doi": "10.1145/3430524.3442468"
    },
    {
      "text": "Bin Yu, Mathias Funk, Jun Hu, and Loe Feijs. 2017. StressTree: A metaphorical visualization for biofeedback-assisted stress management. In Proceedings of the 2017 conference on designing interactive systems. Association for Computing Machinery, New York, NY, USA, 333–337.",
      "doi": "10.1145/3064663.3064729"
    },
    {
      "text": "Samaneh Zamanifard and Guo Freeman. 2019. \"The Togetherness That We Crave\": Experiencing Social VR in Long Distance Relationships. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 438–442. https://doi.org/10.1145/3311957.3359453",
      "doi": "10.1145/3311957.3359453"
    },
    {
      "text": "Renwen Zhang, Natalya N. Bazarova, and Madhu Reddy. 2021. Distress disclosure across social media platforms during the COVID-19 pandemic: Untangling the effects of platforms, affordances, and audiences. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3411764.3445134"
    },
    {
      "text": "Bin Zhu, Anders Hedman, and Haibo Li. 2017. Designing digital mindfulness: Presence-in and presence-with versus presence-through. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2685–2695.",
      "doi": "10.1145/3025453.3025590"
    }
  ]
}