{
  "doi": "10.1145/3544548.3581020",
  "title": "Online Harassment in Majority Contexts: Examining Harms and Remedies across Countries",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Online harassment is a global problem. This article examines perceptions of harm and preferences for remedies associated with online harassment with nearly 4000 participants in 14 countries around the world. The countries in this work reflect a range of identities and values, with a focus on those outside of North American and European contexts. Results show that perceptions of harm are higher among participants from all countries studied compared to the United States. Non-consensual sharing of sexual photos is consistently rated as harmful in all countries, while insults and rumors are perceived as more harmful in non-U.S. countries, especially harm to family reputation. Lower trust in other people and lower trust in sense of safety in one’s neighborhood correlate with increased perceptions of harm of online harassment. In terms of remedies, participants in most countries prefer monetary compensation, apologies, and publicly revealing offender’s identities compared to the U.S. Social media platform design and policy must consider regional values and norms, which may depart from U.S. centric-approaches.",
  "authors": [
    {
      "name": "Sarita Schoenebeck",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658750237",
      "orcid": "0000-0002-8688-1595"
    },
    {
      "name": "Amna Batool",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658766961",
      "orcid": "0000-0001-5207-5352"
    },
    {
      "name": "Giang Do",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778376",
      "orcid": "0000-0002-6007-0671"
    },
    {
      "name": "Sylvia Darling",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780458",
      "orcid": "0000-0003-3009-3554"
    },
    {
      "name": "Gabriel Grill",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660083899",
      "orcid": "0000-0002-4879-0553"
    },
    {
      "name": "Daricia Wilkinson",
      "institution": "Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659069624",
      "orcid": "0000-0002-4611-3030"
    },
    {
      "name": "Mehtab Khan",
      "institution": "Yale University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781419",
      "orcid": "0000-0001-8723-3066"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    },
    {
      "name": "Louise Ashwell",
      "institution": "University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778323",
      "orcid": "0000-0002-5978-196X"
    }
  ],
  "references": [
    {
      "text": "2015. Troll or hero? The sex blogger who’s offending Muslims. (2015). https://www.bbc.com/news/blogs-trending-32515516",
      "doi": ""
    },
    {
      "text": "2020. This is how much Americans trust Facebook, Google, Apple, and other big tech companies: 2020. (2020). https://www.theverge.com/2020/3/2/21144680/verge-tech-survey-2020-trust-privacy-security-facebook-amazon-googleapple",
      "doi": ""
    },
    {
      "text": "2022. Twitter launches legal challenge in India over orders to block content. (2022). https://www.cnn.com/2022/07/06/tech/twitter-legal-action-india-government-blocked-content-intl-hnk/index.html",
      "doi": ""
    },
    {
      "text": "Abubakar Abid, Maheen Farooqi, and James Zou. 2021. Persistent anti-muslim bias in large language models. In Proceedings of the 2021 AAAI/ACM Conference on AI, Ethics, and Society. 298–306.",
      "doi": "10.1145/3461702.3462624"
    },
    {
      "text": "Sara Ahmed. 2021. Complaint!Duke University Press.",
      "doi": ""
    },
    {
      "text": "Ali J Al-Kandari, Ahmed A Al-Hunaiyyan, and Rana Al-Hajri. 2016. The influence of culture on instagram use. Journal of Advances in Information Technology, 7 (1), 54 57 (2016).",
      "doi": ""
    },
    {
      "text": "Lenhart Amanda, Ybarra Michele, Zickuhr Kathryn, and Myeshia Price-Feeney. 2016. Online harassment, digital abuse, and cyberstalking in America. Data and Society Research Institute(2016).",
      "doi": ""
    },
    {
      "text": "Yara Barrense-Dias, Christina Akre, Diane Auderset, Brigitte Leeners, Davide Morselli, and Joan-Carles Surís. 2020. Non-consensual sexting: Characteristics and motives of youths who share received-intimate content without consent. Sexual Health 17, 3 (2020), 270–278.",
      "doi": ""
    },
    {
      "text": "Samantha Bates. 2017. Revenge porn and mental health: A qualitative analysis of the mental health effects of revenge porn on female survivors. Feminist Criminology 12, 1 (2017), 22–42.",
      "doi": ""
    },
    {
      "text": "Laura-Kate Bernstein. 2016. Investigating and prosecuting swatting crimes. US Att’ys Bull. 64(2016), 51.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and its consequences for online harassment: Design insights from heartmob. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–19.",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Frank Bretz, Torsten Hothorn, and Peter Westfall. 2016. Multiple comparisons using R. Chapman and Hall/CRC.",
      "doi": ""
    },
    {
      "text": "Katharina Buchholz. 2022. How has the number of female CEOs in Fortune 500 companies changed over the last 20 years?(2022).",
      "doi": ""
    },
    {
      "text": "Melissa Burkett. 2015. Sex (t) talk: A qualitative analysis of young adults’ negotiations of the pleasures and perils of sexting. Sexuality & culture 19, 4 (2015), 835–863.",
      "doi": ""
    },
    {
      "text": "Bart Cammaerts and Robin Mansell. 2020. Digital platform policy and regulation: Toward a radical democratic turn. International journal of communication 14 (2020), 20.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2021. The State of Online Harassment. https://www.pewresearch.org/internet/2021/01/13/the-state-of-online-harassment/",
      "doi": ""
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Anirudh Srinivasan, and Eric Gilbert. 2017. The bag of communities: Identifying abusive behavior online with preexisting internet data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3175–3187.",
      "doi": "10.1145/3025453.3026018"
    },
    {
      "text": "Sarai Chisala-Tempelhoff and Monica Twesiime Kirya. 2016. Gender, law and revenge porn in Sub-Saharan Africa: a review of Malawi and Uganda. Palgrave Communications 2, 1 (2016), 1–9.",
      "doi": ""
    },
    {
      "text": "Danielle K Citron and Mary Anne Franks. 2019. Evaluating New York’s ‘Revenge Porn’Law: A missed opportunity to protect sexual privacy. Harvard Law Review Blog 19, 3 (2019).",
      "doi": ""
    },
    {
      "text": "Danielle Keats Citron and Daniel J Solove. 2021. Privacy harms. Available at SSRN (2021).",
      "doi": ""
    },
    {
      "text": "Danielle J Corple. 2016. Beyond the Gender Gap: Understanding Women’s Participation in Wikipedia. Ph. D. Dissertation. Purdue University.",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Tarleton Gillespie. 2016. What is a flag for? Social media reporting tools and the vocabulary of complaint. New Media & Society 18, 3 (2016), 410–428.",
      "doi": ""
    },
    {
      "text": "Dawn. 2013. Two girls, mother killed over family video. https://www.dawn.com/news/1020576/two-girlsmotherkilled-over-family-video",
      "doi": ""
    },
    {
      "text": "Isabel Debre and Fares Akram. 2021. Facebook’s language gaps weaken screening of hate, terrorism. (2021). https://apnews.com/article/the-facebook-papers-language-moderation-problems-392cb2d065f81980713f37384d07e61f",
      "doi": ""
    },
    {
      "text": "Dorothee M Dietrich and Jessica M Schuett. 2013. Culture of honor and attitudes toward intimate partner violence in Latinos. Sage Open 3, 2 (2013), 2158244013489685.",
      "doi": ""
    },
    {
      "text": "Jill P Dimond, Michaelanne Dye, Daphne LaRose, and Amy S Bruckman. 2013. Hollaback! The role of storytelling online in a social movement organization. In Proceedings of the 2013 conference on Computer supported cooperative work. 477–490.",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Karthik Dinakar, Birago Jones, Catherine Havasi, Henry Lieberman, and Rosalind Picard. 2012. Common sense reasoning for detection, prevention, and mitigation of cyberbullying. ACM Transactions on Interactive Intelligent Systems (TiiS) 2, 3(2012), 1–30.",
      "doi": "10.1145/2362394.2362400"
    },
    {
      "text": "Amy Shields Dobson and Jessica Ringrose. 2016. Sext education: pedagogies of sex, gender and shame in the schoolyards of Tagged and Exposed. Sex Education 16, 1 (2016), 8–21.",
      "doi": ""
    },
    {
      "text": "Evelyn Douek. 2020. Governing Online Speech: From’Posts-As-Trumps’ to Proportionality and Probability. Columbia Law Review 121, 1 (2020).",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017. Online harassment 2017. (2017). https://ncvc.dspacedirect.org/handle/20.500.11990/10",
      "doi": ""
    },
    {
      "text": "Stine Eckert and Jade Metzger-Riftkin. 2020. Doxxing. The international encyclopedia of gender, media, and communication (2020), 1–5.",
      "doi": ""
    },
    {
      "text": "Elizabeth Englander. 2015. Coerced sexting and revenge porn among teens. Bullying, teen aggression & social media 1, 2 (2015), 19–21.",
      "doi": ""
    },
    {
      "text": "Morten W Fagerland. 2012. t-tests, non-parametric tests, and large studies—a paradox of statistical practice?BMC medical research methodology 12, 1 (2012), 1–7.",
      "doi": ""
    },
    {
      "text": "Casey Fiesler, Cliff Lampe, and Amy S Bruckman. 2016. Reality and perception of copyright terms of service for online content creation. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. 1450–1461.",
      "doi": "10.1145/2818048.2819931"
    },
    {
      "text": "United Nations Entity for Gender Equalityand the Empowerment of Wome. 1994. Declaration on the Elimination of Violence against Women. https://www.un.org/womenwatch/daw/vaw/reports.htm#declaration",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Wai Yen Tang. 2017. Women’s experiences with general and sexual harassment in online video games: Rumination, organizational responsiveness, withdrawal, and coping strategies. New Media & Society 19, 8 (2017), 1290–1307.",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2018. Custodians of the Internet: Platforms, content moderation, and the hidden decisions that shape social media. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Carrie Goldberg. 2019. Nobody’s Victim: Fighting Psychos, Stalkers, Pervs, and Trolls. Plume.",
      "doi": ""
    },
    {
      "text": "Eric Goldman. 2021. Content Moderation Remedies. Michigan Technology Law Review, Forthcoming(2021).",
      "doi": ""
    },
    {
      "text": "Mark Griffiths. 2002. Occupational health issues concerning Internet use in the workplace. Work & Stress 16, 4 (2002), 283–286.",
      "doi": ""
    },
    {
      "text": "Tamy Guberek, Allison McDonald, Sylvia Simioni, Abraham H Mhaidli, Kentaro Toyama, and Florian Schaub. 2018. Keeping a low profile? Technology, risk and privacy among undocumented immigrants. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3173574.3173688"
    },
    {
      "text": "Pallavi Guha. 2021. Hear# metoo in India: News, Social Media, and Anti-Rape and Sexual Harassment Activism. Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "Vikram Gupta, Rini Sharon, Ramit Sawhney, and Debdoot Mukherjee. 2022. ADIMA: Abuse Detection In Multilingual Audio. In ICASSP 2022-2022 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 6172–6176.",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Daniel Delmonaco, Peipei Nie, and Andrea Wegner. 2021. Disproportionate removals and differing content moderation experiences for conservative, transgender, and black social media users: Marginalization and moderation gray areas. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–35.",
      "doi": "10.1145/3479610"
    },
    {
      "text": "Rebecca M Hayes and Molly Dragiewicz. 2018. Unsolicited dick pics: Erotica, exhibitionism or entitlement?. In Women’s Studies International Forum, Vol. 71. Pergamon, 114–120.",
      "doi": ""
    },
    {
      "text": "he Associated Press. 2019. Singer Goo Hara’s death shines light on harassment in the cutthroat K-pop industry. https://www.syracuse.com/us-news/2019/11/singer-goo-haras-death-shines-light-on-harassment-in-the-cutthroat-k-pop-industry.html",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010. The weirdest people in the world?Behavioral and Brain Sciences 33, 2-3 (2010), 61–83.",
      "doi": ""
    },
    {
      "text": "Hossein Hosseini, Sreeram Kannan, Baosen Zhang, and Radha Poovendran. 2017. Deceiving google’s perspective api built for detecting toxic comments. arXiv preprint arXiv:1702.08138(2017).",
      "doi": ""
    },
    {
      "text": "Huffpost. 2011. Facebook’s censorship problem. https://www.huffpost.com/entry/facebooks-censorship-prob_b_852001",
      "doi": ""
    },
    {
      "text": "Jane Im, Sarita Schoenebeck, Marilyn Iriarte, Gabriel Grill, Daricia Wilkinson, Amna Batool, Rahaf Alharbi, Audrey Funwie, Tergel Gankhuu, Eric Gilbert, 2022. Women’s Perspectives on Harm and Justice after Online Harassment. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–23.",
      "doi": "10.1145/3555775"
    },
    {
      "text": "Ronald Inglehart, Christian Haerpfer, Alejandro Moreno, Christian Welzel, Kseniya Kizilova, Jaime Diez-Medrano, Marta Lagos, Pippa Norris, Eduard Ponarin, Bi Puranen, 2014. World values survey: Round six-country-pooled datafile version. Madrid: JD Systems Institute(2014), 12.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Darren Scott Appling, Eric Gilbert, and Amy Bruckman. 2019. \" Did You Suspect the Post Would be Removed?\" Understanding User Reactions to Content Removals on Reddit. Proceedings of the ACM on human-computer interaction 3, CSCW(2019), 1–33.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Sucheta Ghoshal, Amy Bruckman, and Eric Gilbert. 2018. Online harassment and content moderation: The case of blocklists. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 2(2018), 1–33.",
      "doi": "10.1145/3185593"
    },
    {
      "text": "Jialun’Aaron’ Jiang, Skyler Middler, Jed R Brubaker, and Casey Fiesler. 2020. Characterizing community guidelines on social media platforms. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. 287–291.",
      "doi": "10.1145/3406865.3418312"
    },
    {
      "text": "Jialun Aaron Jiang, Morgan Klaus Scheuerman, Casey Fiesler, and Jed R Brubaker. 2021. Understanding international perceptions of the severity of harmful content online. PloS one 16, 8 (2021), e0256762.",
      "doi": ""
    },
    {
      "text": "KIM Jinsook. 2021. The Resurgence and Popularization of Feminism in South Korea: Key Issues and Challenges for Contemporary Feminist Activism. Korea Journal 61, 4 (2021), 75–101.",
      "doi": ""
    },
    {
      "text": "Olena Kaminska and Peter Lynn. 2017. Survey-based cross-country comparisons where countries vary in sample design: issues and solutions. Journal of Official Statistics 33, 1 (2017), 123–136.",
      "doi": ""
    },
    {
      "text": "Leslie Kish. 1994. Multipopulation survey designs: five types with seven shared aspects. International Statistical Review/Revue Internationale de Statistique (1994), 167–186.",
      "doi": ""
    },
    {
      "text": "Anti-Defamation League. 2019. More than one-third of Americans experience severe online hate and harassment, new ADL study finds. https://www.adl.org/news/ press-releases/more-than-one-third-of-americans-experience -severe-online-hate-and-harassment",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart, Michele Ybarra, Kathryn Zickuhr, and Myeshia Price-Feeney. 2016. Online harassment, digital abuse, and cyberstalking in America. Data and Society Research Institute.",
      "doi": ""
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How weird is CHI?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "Sophie Maddocks. 2018. From non-consensual pornography to image-based sexual abuse: Charting the course of a problem with many names. Australian Feminist Studies 33, 97 (2018), 345–361.",
      "doi": ""
    },
    {
      "text": "Carsten Maple, Emma Short, and Antony Brown. 2011. Cyberstalking in the United Kingdom: An analysis of the ECHO pilot survey. Technical Report. University of Bedfordshire.",
      "doi": ""
    },
    {
      "text": "Alice E Marwick. 2021. Morally motivated networked harassment as normative reinforcement. Social Media+ Society 7, 2 (2021), 20563051211021378.",
      "doi": ""
    },
    {
      "text": "J Nathan Matias. 2019. Preventing harassment and increasing group participation through social norms in 2,190 online science discussions. Proceedings of the National Academy of Sciences 116, 20(2019), 9785–9789.",
      "doi": ""
    },
    {
      "text": "Peter Mayer, Yixin Zou, Florian Schaub, and Adam J Aviv. 2021. \" Now I’m a bit {angry:}\" Individuals’ Awareness, Perception, and Responses to Data Breaches that Affected Them. In 30th USENIX Security Symposium (USENIX Security 21). 393–410.",
      "doi": ""
    },
    {
      "text": "Meta. 2022. Principles that guide Meta’s stakeholder engagement: Transparency center. (2022). https://transparency.fb.com/policies/improving/principles-guide-our-stakeholder-engagement/",
      "doi": ""
    },
    {
      "text": "Microsoft. 2002. Digital Civility Index.",
      "doi": ""
    },
    {
      "text": "Anja Mohorko, Edith de Leeuw, and Joop Hox. 2013. Internet Coverage and Coverage Bias in Europe: Developments Across Countries and Over Time.Journal of Official Statistics (JOS) 29, 4 (2013).",
      "doi": ""
    },
    {
      "text": "Tyler Musgrave, Alia Cummings, and Sarita Schoenebeck. 2022. Experiences of Harm, Healing, and Joy among Black Women and Femmes on Social Media. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3491102.3517608"
    },
    {
      "text": "United Nations Department of Economic and Social Affairs. 2019. 2019 Revision of World Population Prospects. (2019).",
      "doi": ""
    },
    {
      "text": "Lindsey L Osterman and Ryan P Brown. 2011. Culture of honor and violence against the self. Personality and social psychology bulletin 37, 12 (2011), 1611–1623.",
      "doi": ""
    },
    {
      "text": "Sanjana Pampati, Richard Lowry, Megan A Moreno, Catherine N Rasberry, and Riley J Steiner. 2020. Having a sexual photo shared without permission and associated health risks: a snapshot of nonconsensual sexting. JAMA pediatrics 174, 6 (2020), 618–619.",
      "doi": ""
    },
    {
      "text": "Jessica A Pater, Moon K Kim, Elizabeth D Mynatt, and Casey Fiesler. 2016. Characterizations of online harassment: Comparing policies across social media platforms. In Proceedings of the 19th international conference on supporting group work. 369–374.",
      "doi": "10.1145/2957276.2957297"
    },
    {
      "text": "Michael L Pittaro. 2007. Cyber stalking: An analysis of online harassment and intimidation. International journal of cyber criminology 1, 2 (2007), 180–197.",
      "doi": ""
    },
    {
      "text": "Emily Poole. 2015. Fighting back against non-consensual pornography. USFL Rev. 49(2015), 181.",
      "doi": ""
    },
    {
      "text": "Alison Powell. 2013. Argument-by-technology: How technical activism contributes to Internet governance. In Research handbook on governance of the Internet. Edward Elgar Publishing.",
      "doi": ""
    },
    {
      "text": "Anastasia Powell and Nicola Henry. 2014. Blurred lines? Responding to ‘sexting’and gender-based violence among young people. Children Australia 39, 2 (2014), 119–124.",
      "doi": ""
    },
    {
      "text": "Melanie Randall and Vasanthi Venkatesh. 2015. Criminalizing Sexual Violence against Women in Intimate Relationships: State Obligations under Human Rights Law. American Journal of International Law 109 (2015), 189–196.",
      "doi": ""
    },
    {
      "text": "Reuters. 2019. Brother found guilty of murdering Pakistani model Qandeel Baloch in ’honor killing’. https://www.nbcnews.com/news/world/brother-found-guilty-murdering-pakistani-model-qandeel-baloch-honor-killing-n1059431",
      "doi": ""
    },
    {
      "text": "Sarah T Roberts. 2019. Behind the screen. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Patricia M Rodriguez Mosquera, Agneta H Fischer, Antony SR Manstead, and Ruud Zaalberg. 2008. Attack, disapproval, or withdrawal? The role of honour in anger and shame responses to being insulted. Cognition and Emotion 22, 8 (2008), 1471–1498.",
      "doi": ""
    },
    {
      "text": "Wan Rosalili Wan Rosli, Zaiton Hamin, Ahmad Ridhwan Abd Rani, Saslina Kamaruddin, and Rafizah Abu Hassan. 2021. Non-Criminalisation of Cyberstalking and Its Impact on Justice for Victims: Some Evidence from Malaysia. International Journal of Academic Research in Business and Social Sciences 11, 6(2021), 1257–1266.",
      "doi": ""
    },
    {
      "text": "David Ryan. 2018. European remedial coherence in the regulation of non-consensual disclosures of sexual images. Computer law & security review 34, 5 (2018), 1053–1076.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Amna Batool, Nova Ahmed, Tara Matthews, Kurt Thomas, Laura Sanely Gaytán-Lugo, David Nemer, Elie Bursztein, Elizabeth Churchill, and Sunny Consolvo. 2019. \" They Don’t Leave Us Alone Anywhere We Go\" Gender and Digital Abuse in South Asia. In proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300232"
    },
    {
      "text": "Willem Saris, Melanie Revilla, Jon A Krosnick, and Eric M Shaeffer. 2010. Comparing questions with agree/disagree response options to questions with construct-specific response options. Survey Research Methods. 2010; 4 (1): 61-79. DOI: 10.18148/srm/2010. v4i1. 2682 (2010).",
      "doi": ""
    },
    {
      "text": "Sarita Schoenebeck and Lindsay Blackwell. 2020. Reimagining social media governance: Harm, accountability, and repair. Yale JL & Tech. 23(2020), 113.",
      "doi": ""
    },
    {
      "text": "Sarita Schoenebeck, Oliver L Haimson, and Lisa Nakamura. 2020. Drawing from justice theories to support targets of online harassment. new media & society(2020), 1461444820913122.",
      "doi": ""
    },
    {
      "text": "Sarita Schoenebeck, Oliver L Haimson, and Lisa Nakamura. 2021. Drawing from justice theories to support targets of online harassment. new media & society 23, 5 (2021), 1278–1300.",
      "doi": ""
    },
    {
      "text": "Sarita Schoenebeck, Carol F Scott, Emma Grace Hurley, Tammy Chang, and Ellen Selkie. 2021. Youth Trust in Social Media Companies and Expectations of Justice: Accountability and Repair after Online Harassment. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–18.",
      "doi": "10.1145/3449076"
    },
    {
      "text": "Frances Shaw. 2016. “Bitch I said hi”: The Bye Felipe campaign and discursive activism in mobile dating apps. Social Media+ Society 2, 4 (2016), 2056305116672889.",
      "doi": ""
    },
    {
      "text": "Shawna N Smith, Stephen D Fisher, and Anthony Heath. 2011. Opportunities and challenges in the expansion of cross-national survey research. International Journal of Social Research Methodology 14, 6(2011), 485–502.",
      "doi": ""
    },
    {
      "text": "Jose M Such, Joel Porter, Sören Preibusch, and Adam Joinson. 2017. Photo privacy conflicts in social media: A large-scale empirical study. In Proceedings of the 2017 CHI conference on human factors in computing systems. 3821–3832.",
      "doi": "10.1145/3025453.3025668"
    },
    {
      "text": "Sharifa Sultana, Mitrasree Deb, Ananya Bhattacharjee, Shaid Hasan, SM Raihanul Alam, Trishna Chakraborty, Prianka Roy, Samira Fairuz Ahmed, Aparna Moitra, M Ashraful Amin, 2021. ‘Unmochon’: A Tool to Combat Online Sexual Harassment over Facebook Messenger. (2021).",
      "doi": ""
    },
    {
      "text": "Kurt Thomas, Devdatta Akhawe, Michael Bailey, Dan Boneh, Elie Bursztein, Sunny Consolvo, Nicola Dell, Zakir Durumeric, Patrick Gage Kelley, Deepak Kumar, 2021. Sok: Hate, harassment, and the changing landscape of online abuse. In 2021 IEEE Symposium on Security and Privacy (SP). IEEE, 247–267.",
      "doi": ""
    },
    {
      "text": "Kea Tijdens and Stephanie Steinmetz. 2016. Is the web a promising tool for data collection in developing countries? An analysis of the sample bias of 10 web and face-to-face surveys from Africa, Asia, and South America. International Journal of Social Research Methodology 19, 4(2016), 461–479.",
      "doi": ""
    },
    {
      "text": "The World Organization Against Torture. 2004. Violence Against Women in Colombia: A Report to the Committee on Torture. (2004).",
      "doi": ""
    },
    {
      "text": "The Express Tribune. 2020. Most Pakistanis are in the dark about digital rights, says Nighat Dad. (2020). https://tribune.com.pk/story/2268627/most-pakistanis-are-in-the-dark-about-digital-rights-says-nighat-dad",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying women’s experiences with and strategies for mitigating negative effects of online harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 1231–1245.",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "Laura Vitis and Fairleigh Gilmour. 2017. Dick pics on blast: A woman’s resistance to online sexual harassment using humour, art and Instagram. Crime, media, culture 13, 3 (2017), 335–355.",
      "doi": ""
    },
    {
      "text": "Ashley Marie Walker and Michael A DeVito. 2020. \"’More gay’fits in better\": Intracommunity Power Dynamics and Harms in Online LGBTQ+ Spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376497"
    },
    {
      "text": "Kate Walker and Emma Sleath. 2017. A systematic review of the current knowledge regarding revenge pornography and non-consensual sharing of sexually explicit media. Aggression and violent behavior 36 (2017), 9–24.",
      "doi": ""
    },
    {
      "text": "wikipedia. 2009. Killing of Neda Agha Soltan. https://en.wikipedia.org/wiki/Killing_of_Neda_Agha-Soltan",
      "doi": ""
    },
    {
      "text": "Daricia Wilkinson and Bart Knijnenburg. 2022. Many Islands, Many Problems: An Empirical Examination of Online Safety Behaviors in the Caribbean. In CHI Conference on Human Factors in Computing Systems. 1–25.",
      "doi": ""
    },
    {
      "text": "Janis Wolak and David Finkelhor. 2016. Sextortion: Findings from a survey of 1,631 victims. (2016).",
      "doi": ""
    },
    {
      "text": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Ex machina: Personal attacks seen at scale. In Proceedings of the 26th international conference on world wide web. 1391–1399.",
      "doi": ""
    },
    {
      "text": "Sijia Xiao, Coye Cheshire, and Niloufar Salehi. 2022. Sensemaking, Support, Safety, Retribution, Transformation: A Restorative Justice Approach to Understanding Adolescents’ Needs for Addressing Online Harm. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3491102.3517614"
    },
    {
      "text": "Michele L Ybarra and Kimberly J Mitchell. 2008. How risky are social networking sites? A comparison of places online where youth sexual solicitation and harassment occurs. Pediatrics 121, 2 (2008), e350–e357.",
      "doi": ""
    },
    {
      "text": "Dawei Yin, Zhenzhen Xue, Liangjie Hong, Brian D Davison, April Kontostathis, and Lynne Edwards. 2009. Detection of harassment on web 2.0. Proceedings of the Content Analysis in the WEB 2 (2009), 1–7.",
      "doi": ""
    },
    {
      "text": "Jillian C York. 2021. Silicon Values: The Future of Free Speech Under Surveillance Capitalism. Verso Books.",
      "doi": ""
    }
  ]
}