{
  "doi": "10.1145/3544548.3580994",
  "title": "CrowdSurfer: Seamlessly Integrating Crowd-Feedback Tasks into Everyday Internet Surfing",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Crowd feedback overcomes scalability issues of feedback collection on interactive website designs. However, collecting feedback on crowdsourcing platforms decouples the feedback provider from the context of use. This creates more effort for crowdworkers to immerse into such context in crowdsourcing tasks. In this paper, we present CrowdSurfer, a browser extension that seamlessly integrates design feedback collection in crowdworkers’ everyday internet surfing. This enables the scalable collection of in situ feedback and, in parallel, allows crowdworkers to flexibly integrate their work into their daily activities. In a field study, we compare the CrowdSurfer against traditional feedback collection. Our qualitative and quantitative results reveal that, while in situ feedback with the CrowdSurfer is not necessarily better, crowdworkers appreciate the effortless, enjoyable, and innovative method to conduct feedback tasks. We contribute with our findings on in situ feedback collection and provide recommendations for the integration of crowdworking tasks in everyday internet surfing.",
  "tags": [
    "Crowd-feedback system",
    "crowdsourcing",
    "browser extension",
    "design feedback"
  ],
  "authors": [
    {
      "name": "Saskia Haug",
      "institution": "Human-Centered Systems Lab, Karlsruhe Insititute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659884165",
      "orcid": "0000-0001-8532-7181"
    },
    {
      "name": "Ivo Benke",
      "institution": "Human-Centered Systems Lab, Karlsruhe Insititute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588770",
      "orcid": "0000-0002-3165-7131"
    },
    {
      "name": "Daniel Fischer",
      "institution": "Human-Centered Systems Lab, Karlsruhe Institute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783112",
      "orcid": "0000-0001-9019-5187"
    },
    {
      "name": "Alexander Maedche",
      "institution": "Human-Centered Systems Lab, Karlsruhe Institute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100465867",
      "orcid": "0000-0001-6546-4816"
    }
  ],
  "references": [
    {
      "text": "Tahir Abbas and Ujwal Gadiraju. 2022. Goal-Setting Behavior of Workers on Crowdsourcing Platforms: An Exploratory Study on MTurk and Prolific. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 10, 1 (10 2022), 2–13. https://doi.org/10.1609/HCOMP.V10I1.21983",
      "doi": ""
    },
    {
      "text": "M Almaliki, C Ncube, and R Ali. 2014. The Design of Adaptive Acquisition of Users Feedback: An Empirical Study. In 2014 IEEE Eighth International Conference on Research Challenges in Information Science (RCIS). IEEE, New York, NY, USA, 1–12. https://doi.org/10.1109/RCIS.2014.6861076",
      "doi": ""
    },
    {
      "text": "Paul Alpar and Lars Osterbrink. 2018. Antecedents of Perceived Fairness in Pay for Microtask Crowdwork. In 26th European Conference on Information Systems, ECIS 2018. Association for Information Systems (AIS), New York, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Oshrat Ayalon and Eran Toch. 2018. Crowdsourcing Privacy Design Critique: An Empirical Evaluation of Framing Effects. In Proceedings of the Annual Hawaii International Conference on System Sciences, Vol. 2018-Janua. Association for Computing Machinery (ACM), New York, NY, USA, 4752–4761. https://doi.org/10.24251/hicss.2018.598",
      "doi": ""
    },
    {
      "text": "Oshrat Ayalon and Eran Toch. 2019. A/P(rivacy) Testing: Assessing Applications for Social and Institutional Privacy. In Extended Abstracts of the 2019 CHI Conference. Association for Computing Machinery (ACM), New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312972",
      "doi": "10.1145/3290607.3312972"
    },
    {
      "text": "Janine Berg. 2016. Income security in the On-Demand Economy: Findings and Policy Lessons from a Survey of Crowdworkers. Comparative Labor Law and Policy Journal 37, 3 (2016), 27.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Wen Chih Chiou, Chin Chao Lin, and Chyuan Perng. 2010. A Strategic Framework for Website Evaluation based on a Review of the Literature from 1995-2006. Information and Management 47, 5-6 (8 2010), 282–290. https://doi.org/10.1016/j.im.2010.06.002",
      "doi": "10.1016/j.im.2010.06.002"
    },
    {
      "text": "Cristiano Codagnone, Fabienne Abadie, and Federico Biagi. 2017. The Future of Work in the Sharing Economyy. Market Efficiency and Equitable Opportunities or Unfair Precarisation?SSRN Electronic Journal JRC101280 (2017), 96. https://doi.org/10.2139/ssrn.2784774",
      "doi": ""
    },
    {
      "text": "James R. Detert, Linda Klebe Treviño, and Vicki L. Sweitzer. 2008. Moral Disengagement in Ethical Decision Making: A Study of Antecedents and Outcomes. Journal of Applied Psychology 93, 2 (3 2008), 374–391. https://doi.org/10.1037/0021-9010.93.2.374",
      "doi": ""
    },
    {
      "text": "Alek Felstiner. 2011. Working the Crowd: Employment and Labor Law in the Crowdsourcing Industry. Berkeley Journal of Employment and Labor Law 32, 1 (8 2011), 19–24. https://doi.org/10.3109/9780203490891-6",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Mike Y. Chen, Sunny Consolvo, Beverly Harrison, and James A. Landay. 2007. MyExperience: A system for In Situ Tracing and Capturing of User Feedback on Mobile Phones. In MobiSys’07: Proceedings of the 5th International Conference on Mobile Systems, Applications and Services. Association for Computing Machinery (ACM), New York, NY, USA, 57–70. https://doi.org/10.1145/1247660.1247670",
      "doi": "10.1145/1247660.1247670"
    },
    {
      "text": "Jorge Goncalves, Denzil Ferreira, Simo Hosio, Yong Liu, Jakob Rogstadius, Hannu Kukka, and Vassilis Kostakos. 2013. Crowdsourcing on the Spot: Altruistic Use of Public Displays, Feasibility, Performance, and Behaviours. In UbiComp 2013 - Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing. Association for Computing Machinery (ACM), New York, NY, USA, 753–762. https://doi.org/10.1145/2493432.2493481",
      "doi": "10.1145/2493432.2493481"
    },
    {
      "text": "Jorge Goncalves, Simo Hosio, Jakob Rogstadius, Evangelos Karapanos, and Vassilis Kostakos. 2015. Motivating participation and improving quality of contribution in ubiquitous crowdsourcing. Computer Networks 90(2015), 34–48. https://doi.org/10.1016/j.comnet.2015.07.002",
      "doi": "10.1016/j.comnet.2015.07.002"
    },
    {
      "text": "Pamela Grimm. 2010. Social Desirability Bias. In Wiley International Encyclopedia of Marketing. John Wiley & Sons, Ltd. https://doi.org/10.1002/9781444316568.wiem02057",
      "doi": ""
    },
    {
      "text": "Nathan Hahn, Shamsi T. Iqbal, and Jaime Teevan. 2019. Casual Microtasking: Embedding Microtasks in Facebook. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3290605.3300249",
      "doi": "10.1145/3290605.3300249"
    },
    {
      "text": "Joe F. Hair, Marko Sarstedt, Lucas Hopkins, and Volker G. Kuppelwieser. 2014. Partial Least Squares Structural Equation Modeling (PLS-SEM): An Emerging Tool in Business Research., 106–121 pages. https://doi.org/10.1108/EBR-10-2013-0128",
      "doi": ""
    },
    {
      "text": "Kotaro Hara, Abigail Adams, Kristy Milland, Saiph Savage, Chris Callison-Burch, and Jeffrey P Bigham. 2018. A Data-Driven Analysis of Workers’ Earnings on Amazon Mechanical Turk. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574",
      "doi": "10.1145/3173574"
    },
    {
      "text": "Kotaro Hara, Kristy Milland, Benjamin V. Hanrahan, Chris Callison-Burch, Abigail Adams, Saiph Savage, and Jeffrey P. Bigham. 2019. Worker Demographics and Earnings on Amazon Mechanical Turk: An Exploratory Analysis. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312970",
      "doi": "10.1145/3290607.3312970"
    },
    {
      "text": "Saskia Haug, Ivo Benke, and Alexander Maedche. 2023. Aligning Crowdworker Perspectives and Feedback Outcomes in Crowd-Feedback System Design. Proceedings of the ACM on Human-Computer Interaction 7, CSCW(2023), 1–28. https://doi.org/10.1145/3579456",
      "doi": "10.1145/3579456"
    },
    {
      "text": "Saskia Haug and Alexander Maedche. 2021. Crowd-Feedback in Information Systems Development: A State-of-the-Art Review. In Proceedings of the 42nd International Conference on Information Systems (ICIS) 2021. Association for Information Systems (AIS), New York, NY, USA, 17. https://aisel.aisnet.org/icis2021/is_design/is_design/4",
      "doi": ""
    },
    {
      "text": "Saskia Haug and Alexander Maedche. 2021. Feeasy: An Interactive Crowd-Feedback System. In Adjunct Publication of the 34th Annual ACM Symposium on User Interface Software and Technology, UIST 2021. Association for Computing Machinery (ACM), New York, NY, USA, 41–43. https://doi.org/10.1145/3474349.3480224",
      "doi": "10.1145/3474349.3480224"
    },
    {
      "text": "Danula Hettiachchi, Senuri Wijenayake, Simo Hosio, Vassilis Kostakos, and Jorge Goncalves. 2020. How Context Influences Cross-Device Task Acceptance in Crowd Work. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 8 (10 2020), 53–62. https://doi.org/10.1609/hcomp.v8i1.7463",
      "doi": ""
    },
    {
      "text": "Lilly C Irani and M. Six Silberman. 2013. Turkopticon: Interrupting worker invisibility in Amazon Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association of Computing Machinery (ACM), New York, NY, USA, 611–620. https://doi.org/10.1145/2470654.2470742",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Blake Ives and Margrethe H. Olson. 1984. User Involvement and MIS Success: A Review of Research. http://dx.doi.org/10.1287/mnsc.30.5.586 30, 5 (5 1984), 586–603. https://doi.org/10.1287/MNSC.30.5.586",
      "doi": "10.1287/mnsc.30.5.586"
    },
    {
      "text": "Toni Kaplan, Susumu Saito, Kotaro Hara, and Jeffrey Bigham. 2018. Striving to Earn More: A Survey of Work Strategies and Tool Use Among Crowd Workers. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing. AAAI, 70–78. https://doi.org/10.1609/hcomp.v6i1.13327",
      "doi": ""
    },
    {
      "text": "Anna Kasunic, Chun Wei Chiang, Geoff Kaufman, and Saiph Savage. 2019. Turker Tales: Integrating Tangential Play into Crowd Work. In DIS 2019 - Proceedings of the 2019 ACM Designing Interactive Systems Conference. ACM, New York, NY, USA, 21–34. https://doi.org/10.1145/3322276.3322359",
      "doi": "10.1145/3322276.3322359"
    },
    {
      "text": "Mehmet Kokoç. 2019. Flexibility in e-Learning: Modelling Its Relation to Behavioural Engagement and Academic Performance., 16 pages.",
      "doi": ""
    },
    {
      "text": "Ellen Ernst Kossek, Marian N Ruderman, Phillip W Braddy, and Kelly M Hannum. 2012. Work–nonwork boundary management profiles: A person-centered approach. Journal of Vocational Behavior 81, 1 (2012), 112–128. https://doi.org/10.1016/j.jvb.2012.04.003",
      "doi": ""
    },
    {
      "text": "Laura Lascău, Sandy J.J. J Gould, Duncan P. Brumby, Anna L. 2022 Cox, Anna L. 2022 Cox, Laura Lascau, Sandy J.J. J Gould, Duncan P. Brumby, and Anna L. 2022 Cox. 2022. Crowdworkers’ Temporal Flexibility is Being Traded for the Convenience of Requesters Through 19 ’Invisible Mechanisms’ Employed by Crowdworking Platforms. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–8. https://doi.org/10.1145/3491101.3519629",
      "doi": "10.1145/3491101.3519629"
    },
    {
      "text": "Kurt Luther, Jari Lee Tolentino, Wei Wu, Amy Pavel, Brian P Bailey, Maneesh Agrawala, Björn Hartmann, and Steven P Dow. 2015. Structuring, Aggregating, and Evaluating Crowdsourced Design Critique. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. Association for Computing Machinery (ACM), New York, NY, USA, 473–485. https://doi.org/10.1145/2675133.2675283",
      "doi": "10.1145/2675133.2675283"
    },
    {
      "text": "Walid Maalej and Dennis Pagano. 2011. On the Socialness of Software. In Proceedings - IEEE 9th International Conference on Dependable, Autonomic and Secure Computing, DASC 2011. IEEE, New York, NY, USA, 864–871. https://doi.org/10.1109/DASC.2011.146",
      "doi": "10.1109/DASC.2011.146"
    },
    {
      "text": "James D McKeen and Tor Guimaraes. 1997. Successful Strategies for User Participation in Systems Development. Journal of Management Information Systems 14, 2 (1997), 133–150. http://www.jstor.org/stable/40398269",
      "doi": "10.1080/07421222.1997.11518168"
    },
    {
      "text": "Jonas Oppenlaender, Elina Kuosmanen, Andrés Lucero, and Simo Hosio. 2021. Hardhats and Bungaloos: Comparing Crowdsourced Design Feedback with Peer Design Feedback in the Classroom. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery (ACM), New York, NY, USA, 1–14. https://doi.org/10.1145/3411764.3445380",
      "doi": "10.1145/3411764.3445380"
    },
    {
      "text": "Jonas Oppenlaender, Thanassis Tiropanis, and Simo Hosio. 2020. CrowdUI: Supporting Web Design with the Crowd. Proceedings of the ACM on Human-Computer Interaction 4, EICS(2020), 1–28. https://doi.org/10.1145/3394978",
      "doi": "10.1145/3394978"
    },
    {
      "text": "Dennis. Pagano. 2013. PORTNEUF - A Framework for Continuous User Involvement. Ph. D. Dissertation. Technical University Munich.",
      "doi": ""
    },
    {
      "text": "Amy L. Richman, Janet T. Civian, Laurie L. Shannon, E. Jeffrey Hill, and Robert T. Brennan. 2008. The Relationship of Perceived Flexibility, Supportive Work-Life Policies, and Use of Formal Flexible Arrangements and Occasional Flexibility to Employee Engagement and Expected Retention. Community, Work and Family 11, 2 (5 2008), 183–197. https://doi.org/10.1080/13668800802050350",
      "doi": ""
    },
    {
      "text": "Susumu Saito, Teppei Nakano, Chun Wei Chiang, Tetsunori Kobayashi, Saiph Savage, and Jeffrey P. Bigham. 2019. TurkScanner: Predicting the Hourly Wage of Microtasks. In The Web Conference 2019 - Proceedings of the World Wide Web Conference, WWW 2019. Association for Computing Machinery (ACM), New York, NY, USA, 3187–3193. https://doi.org/10.1145/3308558.3313716",
      "doi": "10.1145/3308558.3313716"
    },
    {
      "text": "Hanna Schneider, Katharina Frison, Julie Wagner, and Andras Butz. 2016. CrowdUX: A Case for Using Widespread and Lightweight Tools in the Quest for UX. In DIS 2016 - Proceedings of the 2016 ACM Conference on Designing Interactive Systems. Association for Computing Machinery (ACM), New York, NY, USA, 415–425. https://doi.org/10.1145/2901790.2901814",
      "doi": "10.1145/2901790.2901814"
    },
    {
      "text": "Thimo Schulze, Martin Schader, and Simone Krug. 2012. Workers’ Task Choice in Crowdsourcing and Human Computation Markets. In International Conference on Information Systems, ICIS 2012, Vol. 4. Association for Information Systems (AIS), New York, NY, USA, 3551–3561.",
      "doi": ""
    },
    {
      "text": "Norbert Seyff, Florian Graf, and Neil Maiden. 2010. Using Mobile RE Tools to Give End-Users their Own Voice. In Proceedings of the 2010 18th IEEE International Requirements Engineering Conference, RE2010. IEEE, New York, NY, USA, 37–46. https://doi.org/10.1109/RE.2010.15",
      "doi": "10.1109/RE.2010.15"
    },
    {
      "text": "Norbert Seyff, Gregor Ollmann, and Manfred Bortenschlager. 2014. AppEcho: A User-Driven, In Situ Feedback Approach for Mobile Platforms and Applications. In Proceedings of the 1st International Conference on Mobile Software Engineering and Systems. Association for Computing Machinery (ACM), New York, NY, USA, 99–108. https://doi.org/10.1145/2593902.2593927",
      "doi": "10.1145/2593902.2593927"
    },
    {
      "text": "Nada Sherief, Nan Jiang, Mahmood Hosseini, Keith Phalp, and Raian Ali. 2014. Crowdsourcing Software Evaluation. In Proceedings of the 18th International Conference on Evaluation and Assessment in Software Engineering. Association for Computing Machinery (ACM), New York, NY, USA, 1–4. https://doi.org/10.1145/2601248.2601300",
      "doi": "10.1145/2601248.2601300"
    },
    {
      "text": "Melanie Stade, Marc Oriol, Oscar Cabrera, Farnaz Fotrousi, Ronnie Schaniel, Norbert Seyff, and Oleg Schmidt. 2017. Providing a User Forum is not Enough: First Experiences of a Software Company with CrowdRE. In Proceedings - 2017 IEEE 25th International Requirements Engineering Conference Workshops, REW 2017. IEEE, New York, NY, USA, 164–169. https://doi.org/10.1109/REW.2017.21",
      "doi": ""
    },
    {
      "text": "Ralf A.L.F. van Griethuijsen, Michiel W. van Eijck, Helen Haste, Perry J. den Brok, Nigel C. Skinner, Nasser Mansour, Ayse Savran Gencer, and Saouma BouJaoude. 2015. Global Patterns in Students’ Views of Science and Interest in Science. Research in Science Education 45, 4 (8 2015), 581–603. https://doi.org/10.1007/s11165-014-9438-6",
      "doi": ""
    },
    {
      "text": "Karel Vredenburg, Ji Ye Mao, Paul W. Smith, and Tom Carey. 2002. A Survey of User-Centered Design Practice. In Proceedings of the 2002 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery (ACM), New York, NY, USA, 471–478. https://doi.org/10.1145/503376.503460",
      "doi": "10.1145/503376.503460"
    },
    {
      "text": "Helen Wauck, Yu-Chun Yen, Wai-Tat Fu, Elizabeth Gerber, Steven P Dow, and Brian P Bailey. 2017. From in the Class or in the Wild?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery (ACM), New York, NY, USA, 5580–5591. https://doi.org/10.1145/3025453.3025477",
      "doi": "10.1145/3025453.3025477"
    },
    {
      "text": "Mark E. Whiting, Grant Hugh, and Michael S. Bernstein. 2019. Fair Work: Crowd Work Minimum Wage with One Line of Code. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 7 (10 2019), 197–206. https://ojs.aaai.org/index.php/HCOMP/article/view/5283",
      "doi": ""
    },
    {
      "text": "Alex C. Williams, Gloria Mark, Kristy Milland, Edward Lank, and Edith Law. 2019. The Perpetual Work Life of Crowdworkers: How Tooling Practices Increase Fragmentation in Crowdwork. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (11 2019), 1–28. https://doi.org/10.1145/3359126",
      "doi": "10.1145/3359126"
    },
    {
      "text": "Anbang Xu, Shih-Wen Wen Huang, Brian P. Bailey, and Alejandra Duque-Estrada. 2014. Voyant: Generating Structured Feedback on Visual Designs Using a Crowd of Non-Experts. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work and Social Computing 24, 74 (2014), 1433–1444. https://doi.org/10.1145/2531602.2531604",
      "doi": "10.1145/2531602.2531604"
    },
    {
      "text": "Alvin Yuan, Kurt Luther, Markus Krause, Sophie Isabel Vennix, Steven P Dow, and Björn Bjorn Hartmann. 2016. Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, Vol. 27. Association for Computing Machinery (ACM), New York, NY, USA, 1005–1017. https://doi.org/10.1145/2818048.2819953",
      "doi": "10.1145/2818048.2819953"
    }
  ]
}