{
  "doi": "10.1145/3544548.3581228",
  "title": "Responsible Innovation of Touchless Haptics: A Prospective Design Exploration in Social Interaction",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "The rapid development of touchless systems has introduced many innovations in social interaction scenarios in recent years. People now can interact with touchless systems in social applications that are aimed to be used in everyday situations in the future. This accelerated development makes us ask, what will the next generation of touchless systems be like? How can we responsibly develop new touchless technologies in the future? To answer the first question, we brought together 20 experts to ideate, speculate, and evaluate possible touchless applications for social interactions. A total of 48 ideas were generated from two consecutive workshops. Then, to answer the second question, we critically analyzed those ideas through a thematic analysis using a responsible innovation (RI) framework, and identified key ethical considerations to guide developers, practitioners when designing future touchless systems. We argue that the social scenarios described, and the RI framework proposed in this paper are a useful starting point for responsibly designing the next generation of touchless systems.",
  "tags": [
    "touchless interaction",
    "social interaction",
    "responsible innovation",
    "ethics",
    "mid-air haptics"
  ],
  "authors": [
    {
      "name": "Patricia Cornelio",
      "institution": "Ultraleap, United Kingdom and Computer Science, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778108",
      "orcid": "0000-0001-7807-0410"
    },
    {
      "name": "Stephen Hughes",
      "institution": "Science and Technology Studies, UCL, United Kingdom",
      "img": "/do/10.1145/contrib-81100163569/rel-imgonly/steve.jpg",
      "acmid": "81100163569",
      "orcid": "0000-0002-9295-8480"
    },
    {
      "name": "Orestis Georgiou",
      "institution": "Ultraleap, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210320",
      "orcid": "0000-0003-2303-6754"
    },
    {
      "name": "William Frier",
      "institution": "Ultraleap, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659079629",
      "orcid": "0000-0002-0311-720X"
    },
    {
      "name": "Martin Maunsbach",
      "institution": "Human-Centred Computing, University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659308973",
      "orcid": "0000-0001-9605-1491"
    },
    {
      "name": "Madhan Kumar Vasudevan",
      "institution": "Computer Science, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660002738",
      "orcid": "0000-0002-9947-0824"
    },
    {
      "name": "Marianna Obrist",
      "institution": "Computer Science, University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81328489919/rel-imgonly/mariannaobrist.jpg",
      "acmid": "81328489919",
      "orcid": "0000-0002-4009-1627"
    }
  ],
  "references": [
    {
      "text": "Damien Ablart, Carlos Velasco, and Marianna Obrist. 2017. Integrating Mid-Air Haptics into Movie Experiences. In Proceedings of the 2017 ACM International Conference on Interactive Experiences for TV and Online Video(Hilversum, The Netherlands) (TVX ’17). Association for Computing Machinery, New York, NY, USA, 77–84. https://doi.org/10.1145/3077548.3077551",
      "doi": "10.1145/3077548.3077551"
    },
    {
      "text": "Christine Aicardi, Michael Reinsborough, and Nikolas Rose. 2018. The integrated ethics and society programme of the Human Brain Project: reflecting on an ongoing experience. Journal of Responsible Innovation 5, 1 (2018), 13–37. https://doi.org/10.1080/23299460.2017.1331101",
      "doi": ""
    },
    {
      "text": "Isaac Asimov. 1950. Runaround. I, Robot (The Isaac Asimov Collection ed.). New York City: Doubleday.(first published 1942) (1950).",
      "doi": ""
    },
    {
      "text": "David Evans Bailey. 2017. The potential for immersive technology combined with online dating. Journal of Telecommunications and the Digital Economy 5, 4 (2017), 125–135.",
      "doi": ""
    },
    {
      "text": "Daniel Barben, Erik Fisher, Cynthia Selin, and David H Guston. 2008. 38 Anticipatory Governance of Nanotechnology: Foresight, Engagement, and Integration. The handbook of science and technology studies 979 (2008).",
      "doi": ""
    },
    {
      "text": "Monika Barton, Jana Müllerova, and Ivana Svobodova. 2012. Disney strategy in management-inspiration from arts and creative industries. Zborníky - Aktuálne problémy podnikovej sféry (2012), 15.",
      "doi": ""
    },
    {
      "text": "Oliver Bates and Mike Hazas. 2013. Exploring the Hidden Impacts of HomeSys: Energy and Emissions of Home Sensing and Automation. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication (Zurich, Switzerland) (UbiComp ’13 Adjunct). Association for Computing Machinery, New York, NY, USA, 809–814. https://doi.org/10.1145/2494091.2497322",
      "doi": "10.1145/2494091.2497322"
    },
    {
      "text": "Oliver Bates, Kathy New, Samantha Mitchell-Finnigan, Matthew Louis Mauriello, Christian Remy, Roy Bendor, Samuel Mann, Simran Chopra, Adrian K. Clear, and Chris Preist. 2019. Towards a Responsible Innovation Agenda for HCI. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299017",
      "doi": "10.1145/3290607.3299017"
    },
    {
      "text": "Andrew Di Battista. 2022. Safety of High-Intensity Ultrasound. Springer, 347–362. https://doi.org/10.1007/978-3-031-04043-6_16",
      "doi": ""
    },
    {
      "text": "David Beattie, William Frier, Orestis Georgiou, Benjamin Long, and Damien Ablart. 2020. Incorporating the Perception of Visual Roughness into the Design of Mid-Air Haptic Textures. In ACM Symposium on Applied Perception 2020 (Virtual Event, USA) (SAP ’20). Association for Computing Machinery, New York, NY, USA, Article 4, 10 pages. https://doi.org/10.1145/3385955.3407927",
      "doi": "10.1145/3385955.3407927"
    },
    {
      "text": "Sven A Beiker. 2012. Legal aspects of autonomous driving. Santa Clara L. Rev. 52(2012), 1145.",
      "doi": ""
    },
    {
      "text": "Lauren Berlant. 2011. Cruel optimism. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Jodi K Biber, Dennis Doverspike, Daniel Baznik, Alana Cober, and Barbara A Ritter. 2002. Sexual harassment in online communications: Effects of gender and discourse medium. CyberPsychology & Behavior 5, 1 (2002), 33–42. https://doi.org/10.1089/109493102753685863",
      "doi": ""
    },
    {
      "text": "Abeba Birhane. 2021. Algorithmic injustice: a relational ethics approach. Patterns 2, 2 (2021), 100205. https://doi.org/10.1016/j.patter.2021.100205",
      "doi": ""
    },
    {
      "text": "Abeba Birhane and Jelle van Dijk. 2020. Robot Rights? Let’s Talk about Human Welfare Instead. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society (New York, NY, USA) (AIES ’20). Association for Computing Machinery, New York, NY, USA, 207–213. https://doi.org/10.1145/3375627.3375855",
      "doi": "10.1145/3375627.3375855"
    },
    {
      "text": "Julian Bleecker. 2022. Design fiction: A short essay on design, science, fact, and fiction. Machine Learning and the City: Applications in Architecture and Urban Design (2022), 561–578. https://doi.org/10.1002/9781119815075.ch47",
      "doi": ""
    },
    {
      "text": "Nick Bostrom and Eliezer Yudkowsky. 2018. The ethics of artificial intelligence. Chapman and Hall/CRC, 57–69.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern‐based qualitative analytic approaches. Counselling and Psychotherapy Research 21, 1 (2021), 37–47. https://doi.org/10.1002/capr.12360",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. One size fits all? What counts as quality practice in (reflexive) thematic analysis?Qualitative research in psychology 18, 3 (2021), 328–352. https://doi.org/10.1080/14780887.2020.1769238",
      "doi": ""
    },
    {
      "text": "Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: Multi-Point Mid-Air Haptic Feedback for Touch Surfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 505–514. https://doi.org/10.1145/2501988.2502018",
      "doi": "10.1145/2501988.2502018"
    },
    {
      "text": "Constance Classen. 2020. The book of touch. Routledge.",
      "doi": ""
    },
    {
      "text": "David Collingridge. 1980. The social control of technology. St. Martin, New York (1980).",
      "doi": ""
    },
    {
      "text": "Patricia Cornelio, Carlos Velasco, and Marianna Obrist. 2021. Multisensory integration as per technological advances: A review. Frontiers in Neuroscience 15 (2021). https://doi.org/10.3389/fnins.2021.652611",
      "doi": ""
    },
    {
      "text": "Seán Cronin and Gavin Doherty. 2019. Touchless computer interfaces in hospitals: A review. Health informatics journal 25, 4 (2019), 1325–1342. https://doi.org/10.1177/1460458217748342",
      "doi": ""
    },
    {
      "text": "Paul A David. 2001. Path dependence, its critics and the. Evolution and path dependence in economic ideas: Past and present (2001), 15. https://doi.org/10.4337/9781781950227.00006",
      "doi": ""
    },
    {
      "text": "Julian De Freitas, Andrea Censi, Bryant Walker Smith, Luigi Di Lillo, Sam E Anthony, and Emilio Frazzoli. 2021. From driverless dilemmas to more practical commonsense tests for automated vehicles. Proceedings of the National Academy of Sciences 118, 11(2021). https://doi.org/10.1073/pnas.2010202118",
      "doi": ""
    },
    {
      "text": "Maria Puig de La Bellacasa. 2011. Matters of care in technoscience: Assembling neglected things. Social studies of science 41, 1 (2011), 85–106. https://doi.org/10.1177/0306312710380301",
      "doi": ""
    },
    {
      "text": "Andrew Di Battista. 2019. The effect of 40 kHz ultrasonic noise exposure on human hearing. Universitätsbibliothek der RWTH Aachen.",
      "doi": ""
    },
    {
      "text": "Robert Dilts. 1994. Strategies of Genius, Capitola. CA: Meta Publications 5(1994), 1–3.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Mohamad A. Eid and Hussein Al Osman. 2016. Affective Haptics: Current Research and Future Directions. IEEE Access 4(2016), 26–40. https://doi.org/10.1109/ACCESS.2015.2497316",
      "doi": ""
    },
    {
      "text": "Ben Falchuk, Shoshana Loeb, and Ralph Neff. 2018. The social metaverse: Battle for privacy. IEEE Technology and Society Magazine 37, 2 (2018), 52–61. https://doi.org/10.1109/MTS.2018.2826060",
      "doi": ""
    },
    {
      "text": "Ulrike Felt, Daniel Barben, Alan Irwin, Pierre-Benoit Joly, Arie Rip, Andy Stirling, and Tereza Stöckelová. 2013. Science in Society: caring for our futures in turbulent times. Policy briefing 50(2013).",
      "doi": ""
    },
    {
      "text": "Leonor Fermoselle, Simon Gunkel, Frank ter ter Haar, Sylvie Dijkstra-Soudarissanane, Alexander Toet, Omar Niamut, and Nanda van van der Stap. 2020. Let’s Get in Touch! Adding Haptics to Social VR. In ACM International Conference on Interactive Media Experiences (Cornella, Barcelona, Spain) (IMX ’20). Association for Computing Machinery, New York, NY, USA, 174–179. https://doi.org/10.1145/3391614.3399396",
      "doi": "10.1145/3391614.3399396"
    },
    {
      "text": "Euan Freeman, Julie Williamson, Sriram Subramanian, and Stephen Brewster. 2018. Point-and-Shake: Selecting from Levitating Object Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173592",
      "doi": "10.1145/3173574.3173592"
    },
    {
      "text": "Batya Friedman, David G Hendry, and Alan Borning. 2017. A survey of value sensitive design methods. Foundations and Trends® in Human–Computer Interaction 11, 2(2017), 63–125. https://doi.org/10.1561/1100000015",
      "doi": "10.1561/1100000015"
    },
    {
      "text": "Elia Gatti, Elena Calzolari, Emanuela Maggioni, and Marianna Obrist. 2018. Emotional ratings and skin conductance response to visual, auditory and haptic stimuli. Scientific data 5, 1 (2018), 1–12. https://doi.org/10.1038/sdata.2018.120",
      "doi": ""
    },
    {
      "text": "Vito Gentile, Ali Adjorlu, Stefania Serafin, Davide Rocchesso, and Salvatore Sorce. 2019. Touch or Touchless? Evaluating Usability of Interactive Displays for Persons with Autistic Spectrum Disorders. In Proceedings of the 8th ACM International Symposium on Pervasive Displays (Palermo, Italy) (PerDis ’19). Association for Computing Machinery, New York, NY, USA, Article 10, 7 pages. https://doi.org/10.1145/3321335.3324946",
      "doi": "10.1145/3321335.3324946"
    },
    {
      "text": "Hyunjae Gil, Hyungki Son, Jin Ryong Kim, and Ian Oakley. 2018. Whiskers: Exploring the Use of Ultrasonic Haptic Cues on the Face. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174232",
      "doi": "10.1145/3173574.3174232"
    },
    {
      "text": "Carina S. González-González, Rosa M. Gil Iranzo, Patricia Paderewski, and Natalia Padilla-Zea. 2018. Gender Design Methods for Engineering, Responsible Innovation and Interaction. In Proceedings of the XIX International Conference on Human Computer Interaction (Palma, Spain) (Interacción ’18). Association for Computing Machinery, New York, NY, USA, Article 40, 2 pages. https://doi.org/10.1145/3233824.3233868",
      "doi": "10.1145/3233824.3233868"
    },
    {
      "text": "Christopher Groves. 2015. Logic of choice or logic of care? Uncertainty, technological mediation and responsible innovation. NanoEthics 9, 3 (2015), 321–333. https://doi.org/10.1007/s11569-015-0238-x",
      "doi": ""
    },
    {
      "text": "Greg Guest and Eleanor McLellan. 2003. Distinguishing the trees from the forest: Applying cluster analysis to thematic qualitative data. Field methods 15, 2 (2003), 186–201. https://doi.org/10.1177/1525822X03015002005",
      "doi": ""
    },
    {
      "text": "Daniel Hajas, Damien Ablart, Oliver Schneider, and Marianna Obrist. 2020. I can feel it moving: science communicators talking about the potential of mid-air haptics. Frontiers in Computer Science 2 (2020), 534974. https://doi.org/10.3389/fcomp.2020.534974",
      "doi": ""
    },
    {
      "text": "David Harel, Assaf Marron, and Joseph Sifakis. 2020. Autonomics: In search of a foundation for next-generation autonomous systems. Proceedings of the National Academy of Sciences 117, 30(2020), 17491–17498. https://doi.org/10.1073/pnas.2003162117",
      "doi": ""
    },
    {
      "text": "Ryuji Hirayama, Diego Martinez Plasencia, Nobuyuki Masuda, and Sriram Subramanian. 2019. A volumetric display for visual, tactile and audio presentation using acoustic trapping. Nature 575, 7782 (2019), 320–323. https://doi.org/10.1038/s41586-019-1739-5",
      "doi": ""
    },
    {
      "text": "Paul Hoggett. 2019. Climate psychology: On indifference to disaster. Springer.",
      "doi": ""
    },
    {
      "text": "Chris Holder, Vikram Khurana, Faye Harrison, and Louisa Jacobs. 2016. Robotics and law: Key legal and regulatory implications of the robotics age (Part I of II). Computer law & security review 32, 3 (2016), 383–402. https://doi.org/10.1016/j.clsr.2016.03.001",
      "doi": ""
    },
    {
      "text": "Takayuki Hoshi. 2022. Ultrasound Exposure in Mid-Air Haptics. Springer, 363–383. https://doi.org/10.1007/978-3-031-04043-6_17",
      "doi": ""
    },
    {
      "text": "Shaoyan Huang, Sakthi P B Ranganathan, and Isaac Parsons. 2020. To Touch or Not to Touch? Comparing Touch, Mid-Air Gesture, Mid-Air Haptics for Public Display in Post COVID-19 Society. In SIGGRAPH Asia 2020 Posters (Virtual Event, Republic of Korea) (SA ’20). Association for Computing Machinery, New York, NY, USA, Article 5, 2 pages. https://doi.org/10.1145/3415264.3425438",
      "doi": "10.1145/3415264.3425438"
    },
    {
      "text": "Muhammad Zahid Iqbal and Abraham Campbell. 2020. The emerging need for touchless interaction technologies. Interactions 27, 4 (2020), 51–52. https://doi.org/10.1145/3406100",
      "doi": "10.1145/3406100"
    },
    {
      "text": "Takayuki Iwamoto, Mari Tatezono, and Hiroyuki Shinoda. 2008. Non-contact Method for Producing Tactile Sensation Using Airborne Ultrasound. In Haptics: Perception, Devices and Scenarios, Manuel Ferre (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 504–513. https://doi.org/10.1007/978-3-540-69057-3_64",
      "doi": "10.1007/978-3-540-69057-3_64"
    },
    {
      "text": "Sheila Jasanoff. 2005. Technologies of humility: Citizen participation in governing science. Springer, 370–389. https://doi.org/10.1007/978-3-322-80692-5_17",
      "doi": ""
    },
    {
      "text": "Carey Jewitt, Kerstin Leder Mackley, and Sara Price. 2019. Digital touch for remote personal communication: An emergent sociotechnical imaginary. New Media & Society 23, 1 (2019), 99–120. https://doi.org/10.1177/1461444819894304",
      "doi": ""
    },
    {
      "text": "Carey Jewitt, Sara Price, Jürgen Steimle, Gijs Huisman, Lili Golmohammadi, Narges Pourjafarian, William Frier, Thomas Howard, Sima Ipakchian Askari, and Michela Ornati. 2021. Manifesto for digital social touch in crisis. Frontiers in Computer Science(2021), 97. https://doi.org/10.3389/fcomp.2021.754050",
      "doi": ""
    },
    {
      "text": "Marina Jirotka, Barbara Grimpe, Bernd Stahl, Grace Eden, and Mark Hartswood. 2017. Responsible research and innovation in the digital age. Commun. ACM 60, 5 (2017), 62–68. https://doi.org/10.1145/3064940",
      "doi": "10.1145/3064940"
    },
    {
      "text": "Jennifer Johung. 2016. Speculative Life: Art, Synthetic Biology and Blueprints for the Unknown. Theory, Culture & Society 33, 3 (2016), 175–188. https://doi.org/10.1177/0263276415619016",
      "doi": ""
    },
    {
      "text": "Cédric Kervegant, Félix Raymond, Delphine Graeff, and Julien Castet. 2017. Touch Hologram in Mid-Air. In ACM SIGGRAPH 2017 Emerging Technologies (Los Angeles, California) (SIGGRAPH ’17). Association for Computing Machinery, New York, NY, USA, Article 23, 2 pages. https://doi.org/10.1145/3084822.3084824",
      "doi": "10.1145/3084822.3084824"
    },
    {
      "text": "Jin Ryong Kim, Stephanie Chan, Xiangchao Huang, Kenneth Ng, Limin Paul Fu, and Chen Zhao. 2019. Demonstration of Refinity: An Interactive Holographic Signage for New Retail Shopping Experience. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3290607.3313269",
      "doi": "10.1145/3290607.3313269"
    },
    {
      "text": "Panayiotis Koutsabasis and Panagiotis Vogiatzidakis. 2019. Empirical research in mid-air interaction: A systematic review. International Journal of Human–Computer Interaction 35, 18(2019), 1747–1768. https://doi.org/10.1080/10447318.2019.1572352",
      "doi": ""
    },
    {
      "text": "David R Large, Kyle Harrington, Gary Burnett, and Orestis Georgiou. 2019. Feel the noise: Mid-air ultrasound haptics as a novel human-vehicle interaction paradigm. Applied ergonomics 81(2019), 102909. https://doi.org/10.1016/j.apergo.2019.102909",
      "doi": ""
    },
    {
      "text": "Madelaine Ley and Nathan Rambukkana. 2021. Touching at a Distance: Digital Intimacies, Haptic Platforms, and the Ethics of Consent. Science and Engineering Ethics 27, 5 (2021), 1–17. https://doi.org/10.1007/s11948-021-00338-1",
      "doi": ""
    },
    {
      "text": "Hannah Limerick, Richard Hayden, David Beattie, Orestis Georgiou, and Jörg Müller. 2019. User Engagement for Mid-Air Haptic Interactions with Digital Signage. In Proceedings of the 8th ACM International Symposium on Pervasive Displays (Palermo, Italy) (PerDis ’19). Association for Computing Machinery, New York, NY, USA, Article 15, 7 pages. https://doi.org/10.1145/3321335.3324944",
      "doi": "10.1145/3321335.3324944"
    },
    {
      "text": "Joseph Lindley, Paul Coulton, and Miriam Sturdee. 2017. Implications for Adoption. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 265–277. https://doi.org/10.1145/3025453.3025742",
      "doi": "10.1145/3025453.3025742"
    },
    {
      "text": "Line S. Löken, Johan Wessberg, India Morrison, Francis McGlone, and Håkan Olausson. 2009. Coding of pleasant touch by unmyelinated afferents in humans. Nature Neuroscience 12, 5 (2009), 547–548. https://doi.org/10.1038/nn.2312",
      "doi": ""
    },
    {
      "text": "Shaun Alexander Macdonald, Euan Freeman, Stephen Brewster, and Frank Pollick. 2021. User Preferences for Calming Affective Haptic Stimuli in Social Settings. In Proceedings of the 2021 International Conference on Multimodal Interaction (Montréal, QC, Canada) (ICMI ’21). Association for Computing Machinery, New York, NY, USA, 387–396. https://doi.org/10.1145/3462244.3479903",
      "doi": "10.1145/3462244.3479903"
    },
    {
      "text": "Phil Macnaghten and Jason Chilvers. 2014. The future of science governance: publics, policies, practices. Environment and Planning C: Government and Policy 32, 3 (2014), 530–548. https://doi.org/10.1068/c1245j",
      "doi": ""
    },
    {
      "text": "Yasutoshi Makino, Yoshikazu Furuyama, Seki Inoue, and Hiroyuki Shinoda. 2016. HaptoClone (Haptic-Optical Clone) for Mutual Tele-Environment by Real-Time 3D Image Transfer with Midair Force Feedback. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1980–1990. https://doi.org/10.1145/2858036.2858481",
      "doi": "10.1145/2858036.2858481"
    },
    {
      "text": "Boaz Miller. 2021. Is technology value-neutral?Science, Technology, & Human Values 46, 1 (2021), 53–80. https://doi.org/10.1177/0162243919900965",
      "doi": ""
    },
    {
      "text": "Clark A Miller and Ira Bennett. 2008. Thinking longer term about technology: is there value in science fiction-inspired approaches to constructing futures?Science and Public Policy 35, 8 (2008), 597–606. https://doi.org/10.3152/030234208X370666",
      "doi": ""
    },
    {
      "text": "Roberto A. Montano Murillo, Sriram Subramanian, and Diego Martinez Plasencia. 2017. Erg-O: Ergonomic Optimization of Immersive Virtual Environments. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 759–771. https://doi.org/10.1145/3126594.3126605",
      "doi": "10.1145/3126594.3126605"
    },
    {
      "text": "Soumen Mukherjee and Leslie Ramos Salazar. 2022. SCRUTINIZING SEXUAL PERSECUTION IN DIGITAL COMMUNICATION THROUGH THE FIELD OF HAPTICS. Gender Violence, Social Media, and Online Environments: When the Virtual Becomes Real (2022).",
      "doi": ""
    },
    {
      "text": "Jaime Muñoz-Arteaga, Huizilopoztli Luna García, César A. Collazos, and Antoni Granollers. 2022. Impact of Human-Computer Interaction in the Global Sustainable Development Goals. Springer International Publishing, Cham, 37–48. https://doi.org/10.1007/978-3-030-97344-5_3",
      "doi": ""
    },
    {
      "text": "Marianna Obrist, Sriram Subramanian, Elia Gatti, Benjamin Long, and Thomas Carter. 2015. Emotions Mediated Through Mid-Air Haptics. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2053–2062. https://doi.org/10.1145/2702123.2702361",
      "doi": "10.1145/2702123.2702361"
    },
    {
      "text": "Kenton O’Hara, Gerardo Gonzalez, Abigail Sellen, Graeme Penney, Andreas Varnavas, Helena Mentis, Antonio Criminisi, Robert Corish, Mark Rouncefield, Neville Dastur, and Tom Carrell. 2014. Touchless Interaction in Surgery. Commun. ACM 57, 1 (jan 2014), 70–77. https://doi.org/10.1145/2541883.2541899",
      "doi": "10.1145/2541883.2541899"
    },
    {
      "text": "Viktorija Paneva, Sofia Seinfeld, Michael Kraiczi, and Jörg Müller. 2020. HaptiRead: Reading Braille as Mid-Air Haptic Information. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 13–20. https://doi.org/10.1145/3357236.3395515",
      "doi": "10.1145/3357236.3395515"
    },
    {
      "text": "David Parisi. 2018. Archaeologies of touch: Interfacing with haptics from electricity to computing. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Olivia Petit, Carlos Velasco, and Charles Spence. 2019. Digital sensory marketing: Integrating new technologies into multisensory online experience. Journal of Interactive Marketing 45 (2019), 42–61. https://doi.org/10.1016/j.intmar.2018.07.004",
      "doi": ""
    },
    {
      "text": "Valentina Piccoli, Andrea Carnaghi, Michele Grassi, Marta Stragà, and Mauro Bianchi. 2020. Cyberbullying through the lens of social influence: Predicting cyberbullying perpetration from perceived peer-norm, cyberspace regulations and ingroup processes. Computers in human behavior 102 (2020), 260–273. https://doi.org/10.1016/j.chb.2019.09.001",
      "doi": "10.1016/j.chb.2019.09.001"
    },
    {
      "text": "Dario Pittera, Orestis Georgiou, Abdenaceur Abdouni, and William Frier. 2022. “I Can Feel It Coming in the Hairs Tonight”: Characterising Mid-Air Haptics on the Hairy Parts of the Skin. IEEE Transactions on Haptics 15, 1 (2022), 188–199. https://doi.org/10.1109/TOH.2021.3110722",
      "doi": ""
    },
    {
      "text": "Diego Martinez Plasencia, Ryuji Hirayama, Roberto Montano-Murillo, and Sriram Subramanian. 2020. GS-PAT: High-Speed Multi-Point Sound-Fields for Phased Arrays of Transducers. ACM Trans. Graph. 39, 4, Article 138 (aug 2020), 12 pages. https://doi.org/10.1145/3386569.3392492",
      "doi": "10.1145/3386569.3392492"
    },
    {
      "text": "Sara Price, Carey Jewitt, and Nikoleta Yiannoutsou. 2021. Conceptualising touch in VR. Virtual Reality 25, 3 (2021), 863–877. https://doi.org/10.1007/s10055-020-00494-y",
      "doi": "10.1007/s10055-020-00494-y"
    },
    {
      "text": "Touchless EU Horizon 2020 project. 2020. Next-generation of touchless haptic technologies. https://www.touchlessai.eu/ February 14, 2023.",
      "doi": ""
    },
    {
      "text": "María Puig de la Bellacasa. 2009. Touching technologies, touching visions. The reclaiming of sensorial experience and the politics of speculative thinking. Subjectivity 28, 1 (2009), 297–315. https://doi.org/10.1057/sub.2009.17",
      "doi": ""
    },
    {
      "text": "Ismo Rakkolainen, Euan Freeman, Antti Sand, Roope Raisamo, and Stephen Brewster. 2020. A Survey of Mid-Air Ultrasound Haptics and Its Applications. IEEE Transactions on Haptics(2020). https://doi.org/10.1109/TOH.2020.3018754",
      "doi": ""
    },
    {
      "text": "Ted Romanus, Sam Frish, Mykola Maksymenko, William Frier, Loïc Corenthy, and Orestis Georgiou. 2019. Mid-Air Haptic Bio-Holograms in Mixed Reality. In 2019 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). 348–352. https://doi.org/10.1109/ISMAR-Adjunct.2019.00-14",
      "doi": ""
    },
    {
      "text": "Kimiko Ryokai, Nicole Marie Bulalacao, Sandra Jacobo, Prasad Boradkar, and Kelly Dobson. 2022. Shifting Design Perspectives: Touch, Co-Location, and Sharing Objects during the Pandemic. Multimodal Technologies and Interaction 6, 9 (2022), 74. https://doi.org/10.3390/mti6090074",
      "doi": ""
    },
    {
      "text": "Antti Sand, Ismo Rakkolainen, Poika Isokoski, Jari Kangas, Roope Raisamo, and Karri Palovuori. 2015. Head-Mounted Display with Mid-Air Tactile Feedback. In Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology (Beijing, China) (VRST ’15). Association for Computing Machinery, New York, NY, USA, 51–58. https://doi.org/10.1145/2821592.2821593",
      "doi": "10.1145/2821592.2821593"
    },
    {
      "text": "Johan Schot and Arie Rip. 1997. The past and future of constructive technology assessment. Technological forecasting and social change 54, 2-3 (1997), 251–268. https://doi.org/10.1016/S0040-1625(96)00180-1",
      "doi": ""
    },
    {
      "text": "Wendy L Schultz. 2006. The cultural contradictions of managing change: using horizon scanning in an evidence‐based policy context. Foresight (2006). https://doi.org/10.1108/14636680610681996",
      "doi": ""
    },
    {
      "text": "Sofia Seinfeld, Ivette Schmidt, and Jörg Müller. 2022. Evoking realistic affective touch experiences in virtual reality. https://doi.org/10.48550/ARXIV.2202.13389",
      "doi": ""
    },
    {
      "text": "Gözel Shakeri, John H. Williamson, and Stephen Brewster. 2018. May the Force Be with You: Ultrasound Haptic Feedback for Mid-Air Gesture Interaction in Cars. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3239060.3239081",
      "doi": "10.1145/3239060.3239081"
    },
    {
      "text": "Vivian Shen, Craig Shultz, and Chris Harrison. 2022. Mouth Haptics in VR Using a Headset Ultrasound Phased Array. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 275, 14 pages. https://doi.org/10.1145/3491102.3501960",
      "doi": "10.1145/3491102.3501960"
    },
    {
      "text": "Katie Shilton. 2018. Values and ethics in human-computer interaction. Foundations and Trends® in Human–Computer Interaction 12, 2(2018), 107–171. https://doi.org/10.1561/1100000073",
      "doi": "10.1561/1100000073"
    },
    {
      "text": "Tanay Singhal and Mahika Phutane. 2021. Elevating Haptics: An Accessible and Contactless Elevator Concept with Tactile Mid-Air Controls. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 193, 4 pages. https://doi.org/10.1145/3411763.3451574",
      "doi": "10.1145/3411763.3451574"
    },
    {
      "text": "Jack Stilgoe, Richard Owen, and Phil Macnaghten. 2013. Developing a framework for responsible innovation. Research Policy 42, 9 (2013), 1568–1580. https://doi.org/10.1016/j.respol.2013.05.008",
      "doi": ""
    },
    {
      "text": "Jack Stilgoe, Richard Owen, and Phil Macnaghten. 2020. Developing a framework for responsible innovation. Routledge, 347–359.",
      "doi": ""
    },
    {
      "text": "Miriam Sturdee, Joseph Lindley, Conor Linehan, Chris Elsden, Neha Kumar, Tawanna Dillahunt, Regan Mandryk, and John Vines. 2021. Consequences, Schmonsequences! Considering the Future as Part of Publication and Peer Review in Computing Research. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 95, 4 pages. https://doi.org/10.1145/3411763.3441330",
      "doi": "10.1145/3411763.3441330"
    },
    {
      "text": "Kai Tsumoto, Tao Morisaki, Masahiro Fujiwara, Yasutoshi Makino, and Hiroyuki Shinoda. 2021. Presentation of Tactile Pleasantness Using Airborne Ultrasound. In 2021 IEEE World Haptics Conference (WHC). 602–606. https://doi.org/10.1109/WHC49131.2021.9517249",
      "doi": ""
    },
    {
      "text": "Ibo van de Poel. 2020. Embedding values in artificial intelligence (AI) systems. Minds and Machines 30, 3 (2020), 385–409. https://doi.org/10.1007/s11023-020-09537-4",
      "doi": "10.1007/s11023-020-09537-4"
    },
    {
      "text": "Lawrence Van den Bogaert, David Geerts, and Isa Rutten. 2019. Grasping the Future: Identifying Potential Applications for Mid-Air Haptics in the Home. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312911",
      "doi": "10.1145/3290607.3312911"
    },
    {
      "text": "Chi Thanh Vi, Damien Ablart, Elia Gatti, Carlos Velasco, and Marianna Obrist. 2017. Not just seeing, but also feeling art: Mid-air haptic experiences integrated in a multisensory art exhibition. International Journal of Human-Computer Studies 108 (2017), 1–14. https://doi.org/10.1016/j.ijhcs.2017.06.004",
      "doi": "10.1016/j.ijhcs.2017.06.004"
    },
    {
      "text": "Chi Thanh Vi, Asier Marzo, Damien Ablart, Gianluca Memoli, Sriram Subramanian, Bruce Drinkwater, and Marianna Obrist. 2017. TastyFloats: A Contactless Food Delivery System. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (Brighton, United Kingdom) (ISS ’17). Association for Computing Machinery, New York, NY, USA, 161–170. https://doi.org/10.1145/3132272.3134123",
      "doi": "10.1145/3132272.3134123"
    },
    {
      "text": "Panagiotis Vogiatzidakis and Panayiotis Koutsabasis. 2018. Gesture elicitation studies for mid-air interaction: A review. Multimodal Technologies and Interaction 2, 4 (2018), 65. https://doi.org/10.3390/mti2040065",
      "doi": ""
    },
    {
      "text": "Margaret Wetherell. 2011. The winds of change: Some challenges in reconfiguring social psychology for the future. British Journal of Social Psychology 50, 3 (2011), 399–404. https://doi.org/10.1111/j.2044-8309.2011.02038.x",
      "doi": ""
    },
    {
      "text": "Elizabeth Whittaker and Robin M Kowalski. 2015. Cyberbullying via social media. Journal of school violence 14, 1 (2015), 11–29. https://doi.org/10.1080/15388220.2014.949377",
      "doi": ""
    },
    {
      "text": "Damien Patrick Williams. 2020. Fitting the description: historical and sociotechnical elements of facial recognition and anti-black surveillance. Journal of Responsible Innovation 7, sup1 (2020), 74–83. https://doi.org/10.1080/23299460.2020.1831365",
      "doi": ""
    },
    {
      "text": "Langdon Winner. 1980. Do artifacts have politics?Daedalus (1980), 121–136. https://www.jstor.org/stable/20024652",
      "doi": ""
    },
    {
      "text": "Yiying Wu, Sus Lyckvi, and Virpi Roto. 2019. \"What is Fair Shipping, Anyway?\": Using Design Fiction to Raise Ethical Awareness in an Industrial Context. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300666",
      "doi": "10.1145/3290605.3300666"
    },
    {
      "text": "Emad Yaghmaei. 2016. Addressing Responsible Research and Innovation to Industry: Introduction of a Conceptual Framework. SIGCAS Comput. Soc. 45, 3 (jan 2016), 294–300. https://doi.org/10.1145/2874239.2874282",
      "doi": "10.1145/2874239.2874282"
    }
  ]
}