{
  "doi": "10.1145/3544548.3581553",
  "title": "Unsettling Care Infrastructures: From the Individual to the Structural in a Digital Maternal and Child Health Intervention",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Information services for maternal and child health are increasingly being implemented at scale and integrated into public health infrastructures in Global South countries. These services often disseminate tailored health information and provide channels for families to ask questions to health workers. With increasing uptake, these services are intervening into a highly gendered space and shaping care work and information-seeking in new ways. We present a study of a patient education program and associated WhatsApp-based information service deployed across multiple states in India, drawing on observations, interviews, and analysis of chat records. Building on notions of “unsettling care” [63], we examine what it means to deploy such an intervention in inequitable, fragmented health systems. We find that even as the intervention focuses on individual behavior change, it also runs up against structural issues, such as the overburden of health workers, an illegible health system, and gendered power dynamics that extend beyond the realm of the home. We use our findings to unsettle notions of how the intervention provides care, and to reframe how we might think about the design and implementation of health information services to also engage with structural issues.",
  "tags": [
    "care",
    "chat",
    "India",
    "future of work",
    "maternal and child health"
  ],
  "authors": [
    {
      "name": "Naveena Karusala",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163160",
      "orcid": "0000-0003-0355-3041"
    },
    {
      "name": "Victoria G",
      "institution": "Aurora Health Innovations LLP, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783845",
      "orcid": "0000-0003-2182-6285"
    },
    {
      "name": "Shirley Yan",
      "institution": "Noora Health, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780331",
      "orcid": "0000-0001-7233-8674"
    },
    {
      "name": "Richard Anderson",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371591530",
      "orcid": "0000-0002-7283-7219"
    }
  ],
  "references": [
    {
      "text": "Mafruha Alam, Cathy Banwell, Anna Olsen, Kamalini Lokuge, 2019. Patients’ and doctors’ perceptions of a mobile phone–based consultation service for maternal, neonatal, and infant health care in Bangladesh: a mixed-methods study. JMIR mHealth and uHealth 7, 4 (2019), e11842.",
      "doi": ""
    },
    {
      "text": "Ira Anjali Anwar, Joyojeet Pal, and Julie Hui. 2021. Watched, but moving: Platformization of beauty work and its gendered mechanisms of control. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–20.",
      "doi": "10.1145/3432949"
    },
    {
      "text": "Asad L Asad and Tamara Kay. 2014. Theorizing the relationship between NGOs and the state in medical humanitarian development projects. Social science & medicine 120 (2014), 325–333.",
      "doi": ""
    },
    {
      "text": "Naveen Bagalkot, Syeda Zainab Akbar, Swati Sharma, Nicola Mackintosh, Deirdre Harrington, Paula Griffiths, Judith Angelitta Noronha, and Nervo Verdezoto. 2022. Embodied negotiations, practices and experiences interacting with pregnancy care infrastructures in South India. In CHI Conference on Human Factors in Computing Systems. 1–21.",
      "doi": "10.1145/3491102.3501950"
    },
    {
      "text": "Naveen Bagalkot, Nervo Verdezoto, Anushri Ghode, Shipra Purohit, Lakshmi Murthy, Nicola Mackintosh, and Paula Griffiths. 2020. Beyond Health Literacy: Navigating Boundaries and Relationships During High-Risk Pregnancies: Challenges and Opportunities for Digital Health in North-West India. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. 1–15.",
      "doi": "10.1145/3419249.3420126"
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A location-mapping mobile application for breastfeeding women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1709–1718.",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Peter Barron, Joanne Peter, Amnesty E LeFevre, Jane Sebidi, Marcha Bekker, Robert Allen, Annie Neo Parsons, Peter Benjamin, and Yogan Pillay. 2018. Mobile health messaging service and helpdesk for South African mothers (MomConnect): history, successes and challenges. BMJ global health 3, Suppl 2 (2018), e000559.",
      "doi": ""
    },
    {
      "text": "Rama V Baru and Malu Mohan. 2018. Globalisation and neoliberalism as structural drivers of health inequities. Health research policy and systems 16, 1 (2018), 1–8.",
      "doi": ""
    },
    {
      "text": "Amna Batool, Samia Razaq, Maham Javaid, Beenish Fatima, and Kentaro Toyama. 2017. Maternal complications: Nuances in mobile interventions for maternal health in urban Pakistan. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. 1–12.",
      "doi": "10.1145/3136560.3136573"
    },
    {
      "text": "Karthik S Bhat, Mohit Jain, and Neha Kumar. 2021. Infrastructuring Telehealth in (In) Formal Patient-Doctor Contexts. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–28.",
      "doi": "10.1145/3476064"
    },
    {
      "text": "Karthik S Bhat and Neha Kumar. 2020. Sociocultural dimensions of tracking health and taking care. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24.",
      "doi": "10.1145/3415200"
    },
    {
      "text": "Tithi Bhattacharya. 2017. Social reproduction theory: Remapping class, recentering oppression. (2017).",
      "doi": ""
    },
    {
      "text": "Nicola J Bidwell. 2020. Women and the sustainability of rural community networks in the global south. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–13.",
      "doi": "10.1145/3392561.3394649"
    },
    {
      "text": "Lorena Carlo, Valeria Carpio, Nervo Verdezoto, Parisa Eslambolchilar, Eduardo Cruz, Frank Malo, and Danilo Espinosa. 2020. Healthcare infrastructures in Ecuador: challenges, reflections and opportunities for digital health. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–6.",
      "doi": "10.1145/3392561.3397578"
    },
    {
      "text": "Dipanjan Chakraborty, Akshay Gupta, and Aaditeshwar Seth. 2019. Experiences from a mobile-based behaviour change campaign on maternal and child nutrition in rural India. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/3287098.3287110"
    },
    {
      "text": "Rajesh Chandwani and Neha Kumar. 2018. Stitching infrastructures to facilitate telemedicine for low-resource environments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173958"
    },
    {
      "text": "Huan Chen, Yanling Chai, Le Dong, Wenyi Niu, Puhong Zhang, 2018. Effectiveness and appropriateness of mHealth interventions for maternal and child health: systematic review. JMIR mHealth and uHealth 6, 1 (2018), e8998.",
      "doi": ""
    },
    {
      "text": "Janet X Chen, Allison McDonald, Yixin Zou, Emily Tseng, Kevin A Roundy, Acar Tamersoy, Florian Schaub, Thomas Ristenpart, and Nicola Dell. 2022. Trauma-Informed Computing: Towards Safer Technology Experiences for All. In CHI Conference on Human Factors in Computing Systems. 1–20.",
      "doi": ""
    },
    {
      "text": "Xianghua Ding, Yunan Chen, Zhaofei Ding, and Yiwen Xu. 2019. Boundary negotiation for patient-provider communication via wechat in china. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359259"
    },
    {
      "text": "Emma Dowling. 2022. The care crisis: What caused it and how can we end it?Verso Books.",
      "doi": ""
    },
    {
      "text": "Marie Ennis-O’Connor. 2018. What Does It Mean To Be An Empowered Patient?(2018).",
      "doi": ""
    },
    {
      "text": "Berenice Fisher and Joan Tronto. 1990. Toward a feminist theory of caring. Circles of care: Work and identity in women’s lives (1990), 35–62.",
      "doi": ""
    },
    {
      "text": "Pin Sym Foong, Charis Anne Lim, Joshua Wong, Chang Siang Lim, Simon Tangi Perrault, and Gerald CH Koh. 2020. \" You Cannot Offer Such a Suggestion\" Designing for Family Caregiver Input in Home Care Systems. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376607"
    },
    {
      "text": "Jennifer Franz-Vasdeki, Beth Anne Pratt, Martha Newsome, and Stefan Germann. 2015. Taking mHealth solutions to scale: enabling environments and successful implementation. Journal of Mobile Technology in Medicine 4, 1 (2015), 35–38.",
      "doi": ""
    },
    {
      "text": "RB Ghooi and SR Deshpande. 2012. Patients’ rights in India: an ethical perspective. Indian J Med Ethics 9, 4 (2012), 277–81.",
      "doi": ""
    },
    {
      "text": "Evelyn Nakano Glenn. 2010. Forced to care: Coercion and caregiving in America. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Xinning Gui and Yunan Chen. 2019. Making healthcare infrastructure work: Unpacking the infrastructuring work of individuals. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300688"
    },
    {
      "text": "Xinning Gui, Yunan Chen, and Kathleen H Pine. 2018. Navigating the Healthcare Service “Black Box” Individual Competence and Fragmented System. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–26.",
      "doi": ""
    },
    {
      "text": "Gilhwan Hwang, Jeewon Lee, Cindy Yoonjung Oh, and Joonhwan Lee. 2019. It sounds like a woman: Exploring gender stereotypes in South Korean voice assistants. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3290607.3312915"
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2018. Engaging Solidarity in Data Collection Practices for Community Health. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 76.",
      "doi": "10.1145/3274345"
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2021. AI in global health: the view from the front lines. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–21.",
      "doi": "10.1145/3411764.3445130"
    },
    {
      "text": "Azra Ismail, Deepika Yadav, Meghna Gupta, Kirti Dabas, Pushpendra Singh, and Neha Kumar. 2022. Imagining Caring Futures for Frontline Health Work. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–30.",
      "doi": "10.1145/3555581"
    },
    {
      "text": "Maia Jacobs, Jeremy Johnson, and Elizabeth D Mynatt. 2018. MyPath: Investigating breast cancer patients’ use of personalized health information. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–21.",
      "doi": "10.1145/3274347"
    },
    {
      "text": "Mohit Jain, Pratyush Kumar, Ishita Bhansali, Q. Vera Liao, Khai Truong, and Shwetak Patel. 2018. FarmChat: A Conversational Agent to Answer Farmer Queries. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 4, Article 170 (dec 2018), 22 pages. https://doi.org/10.1145/3287048",
      "doi": "10.1145/3287048"
    },
    {
      "text": "Mohit Jain, Pratyush Kumar, Ramachandra Kota, and Shwetak N. Patel. 2018. Evaluating and Informing the Design of Chatbots. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 895–906. https://doi.org/10.1145/3196709.3196735",
      "doi": "10.1145/3196709.3196735"
    },
    {
      "text": "Aastha Kant. 2014. Experiencing pregnancy: Negotiating cultural and biomedical knowledge. Sociological bulletin 63, 2 (2014), 247–262.",
      "doi": ""
    },
    {
      "text": "Shivani Kapania, Oliver Siy, Gabe Clapper, Azhagu Meena SP, and Nithya Sambasivan. 2022. ” Because AI is 100% right and safe”: User Attitudes and Sources of AI Authority in India. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, Azra Ismail, Karthik S Bhat, Aakash Gautam, Sachin R Pendse, Neha Kumar, Richard Anderson, Madeline Balaam, Shaowen Bardzell, Nicola J Bidwell, 2021. The future of care work: towards a radical politics of care in CSCW research and practice. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing. 338–342.",
      "doi": "10.1145/3462204.3481734"
    },
    {
      "text": "Naveena Karusala, David Odhiambo Seeh, Cyrus Mugo, Brandon Guthrie, Megan A Moreno, Grace John-Stewart, Irene Inwani, Richard Anderson, and Keshet Ronen. 2021. “That courage to encourage”: Participation and Aspirations in Chat-based Peer Support for Youth Living with HIV. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3411764.3445313"
    },
    {
      "text": "Naveena Karusala, Ding Wang, and Jacki O’Neill. 2020. Making chat at home in the hospital: Exploring chat use by nurses. In Proceedings of the 2020 chi conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3313831.3376166"
    },
    {
      "text": "Elizabeth Kaziunas, Michael S Klinkman, and Mark S Ackerman. 2019. Precarious interventions: Designing for ecologies of care. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359215"
    },
    {
      "text": "Elizabeth Kaziunas, Silvia Lindtner, Mark S Ackerman, and Joyce M Lee. 2018. Lived data: tinkering with bodies, code, and care work. Human–Computer Interaction 33, 1 (2018), 49–92.",
      "doi": ""
    },
    {
      "text": "Junhan Kim, Jana Muhic, Lionel Peter Robert, and Sun Young Park. 2022. Designing Chatbots with Black Americans with Chronic Conditions: Overcoming Challenges against COVID-19. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3491102.3502116"
    },
    {
      "text": "Joan Marie Kraft, Karin Gwinn Wilkins, Guiliana J Morales, Monique Widyono, and Susan E Middlestadt. 2014. An evidence review of gender-integrated interventions in reproductive and maternal-child health. Journal of health communication 19, sup1 (2014), 122–141.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J Anderson. 2015. Mobile phones for maternal health in rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 427–436.",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Neha Kumar, Naveena Karusala, Azra Ismail, and Anupriya Tuli. 2020. Taking the long, holistic, and intersectional view to women’s wellbeing. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 4(2020), 1–32.",
      "doi": "10.1145/3397159"
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, 2015. Projecting health: community-led video education for maternal health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. 1–10.",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Simiran Lalvani and Joyojeet Pal. 2022. The moral orders of matchmaking work: Digitization of matrimonial services and the future of work. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–23.",
      "doi": "10.1145/3512968"
    },
    {
      "text": "Amanda Lazar, Hilaire J Thompson, Shih-Yin Lin, and George Demiris. 2018. Negotiating relation work with telehealth home care companionship technologies that support aging in place. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–19.",
      "doi": "10.1145/3274372"
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, and Yun Huang. 2020. Designing a Chatbot as a Mediator for Promoting Deep Self-Disclosure to a Real Mental Health Professional. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 31 (may 2020), 27 pages. https://doi.org/10.1145/3392836",
      "doi": "10.1145/3392836"
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, Yun Huang, and Wai Fu. 2020. \"I Hear You, I Feel You\": Encouraging Deep Self-Disclosure through a Chatbot. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376175",
      "doi": "10.1145/3313831.3376175"
    },
    {
      "text": "Alex Jiahong Lu, Tawanna R Dillahunt, Gabriela Marcu, and Mark S Ackerman. 2021. Data work in education: Enacting and negotiating care and control in teachers’ use of data-driven classroom surveillance technology. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–26.",
      "doi": "10.1145/3479596"
    },
    {
      "text": "Xiaojuan Ma, Xinning Gui, Jiayue Fan, Mingqian Zhao, Yunan Chen, and Kai Zheng. 2018. Professional Medical Advice at your Fingertips: An empirical study of an online\" Ask the Doctor\" platform. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–22.",
      "doi": "10.1145/3274385"
    },
    {
      "text": "Wookjae Maeng and Joonhwan Lee. 2021. Designing a Chatbot for Survivors of Sexual Violence: Exploratory Study for Hybrid Approach Combining Rule-based Chatbot and ML-based Chatbot. In Asian CHI Symposium 2021. 160–166.",
      "doi": "10.1145/3429360.3468203"
    },
    {
      "text": "Christine W Mburu, Chelsea-Joy Wardle, Yaseen Joolay, and Melissa Densmore. 2018. Co-designing with mothers and neonatal unit staff: use of technology to support mothers of preterm infants. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities. 1–10.",
      "doi": "10.1145/3283458.3283487"
    },
    {
      "text": "Indrani Medhi Thies, Nandita Menon, Sneha Magapu, Manisha Subramony, and Jacki O’neill. 2017. How do you want your chatbot? An exploratory Wizard-of-Oz study with young, urban Indians. In IFIP conference on human-computer interaction. Springer, 441–459.",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam. 2002. Qualitative research in practice: Examples for discussion and analysis. Jossey-Bass Inc Pub.",
      "doi": ""
    },
    {
      "text": "Sonali R Mishra, Shefali Haldar, Ari H Pollack, Logan Kendall, Andrew D Miller, Maher Khelifi, and Wanda Pratt. 2016. \"Not Just a Receiver\" Understanding Patient Behavior in the Hospital Environment. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3103–3114.",
      "doi": "10.1145/2858036.2858167"
    },
    {
      "text": "Diwakar Mohan, Kerry Scott, Neha Shah, Jean Juste Harrisson Bashingwa, Arpita Chakraborty, Osama Ummer, Anna Godfrey, Priyanka Dutt, Sara Chamberlain, and Amnesty Elizabeth LeFevre. 2021. Can health information through mobile phones close the divide in health behaviours among the marginalised? An equity analysis of Kilkari in Madhya Pradesh, India. BMJ Global Health 6, Suppl 5 (2021), e005512.",
      "doi": ""
    },
    {
      "text": "Maletsabisa Molapo and Gary Marsden. 2013. Health education in rural communities with locally produced and locally relevant multimedia content. In Proceedings of the 3rd ACM Symposium on Computing for Development. 1–2.",
      "doi": "10.1145/2442882.2442913"
    },
    {
      "text": "Eman Mubarak, Tooba Shahid, Maryam Mustafa, and Mustafa Naseem. 2020. Does Gender and Accent of Voice Matter? An Interactive Voice Response (IVR) experiment. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–5.",
      "doi": ""
    },
    {
      "text": "Fidele Kanyimbu Mukinda, Sara Van Belle, Asha George, and Helen Schneider. 2020. The crowded space of local accountability for maternal, newborn and child health: a case study of the South African health system. Health policy and planning 35, 3 (2020), 279–290.",
      "doi": ""
    },
    {
      "text": "Michelle Murphy. 2015. Unsettling care: Troubling transnational itineraries of care in feminist health practices. Social studies of science 45, 5 (2015), 717–737.",
      "doi": ""
    },
    {
      "text": "Nirmala Murthy, Subhashini Chandrasekharan, Muthu Perumal Prakash, Nadi N Kaonga, Joanne Peter, Aakash Ganju, and Patricia N Mechael. 2019. The impact of an mHealth voice message service (mMitra) on infant care knowledge, and practices among low-income women in India: findings from a Pseudo-Randomized controlled trial. Maternal and child health journal 23, 12 (2019), 1658–1669.",
      "doi": ""
    },
    {
      "text": "Maryam Mustafa, Amna Batool, Beenish Fatima, Fareeda Nawaz, Kentaro Toyama, and Agha Ali Raza. 2020. Patriarchy, maternal health and spiritual healing: designing maternal health interventions in Pakistan. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376294"
    },
    {
      "text": "Tom Newton-Lewis, Wolfgang Munar, and Tata Chanturidze. 2021. Performance management in complex adaptive systems: a conceptual framework for health systems. BMJ Global Health 6, 7 (2021), e005582.",
      "doi": ""
    },
    {
      "text": "Don Nutbeam and Ilona Kickbusch. 1998. Health promotion glossary. Health promotion international 13, 4 (1998), 349–364.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2019. Maternal mortality: evidence brief. Technical Report. World Health Organization.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2020. Strategies toward ending preventable maternal mortality. Geneva; 2015.",
      "doi": ""
    },
    {
      "text": "Geraldine I Oribhabor, Maxine L Nelson, Keri-Ann R Buchanan-Peart, and Ivan Cancarevic. 2020. A mother’s cry: a race to eliminate the influence of racial disparities on maternal morbidity and mortality rates among Black women in America. Cureus 12, 7 (2020).",
      "doi": ""
    },
    {
      "text": "Andrea Parker, Vasudhara Kantroo, Hee Rin Lee, Miguel Osornio, Mansi Sharma, and Rebecca Grinter. 2012. Health promotion as activism: building community capacity to effect social change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 99–108.",
      "doi": "10.1145/2207676.2207692"
    },
    {
      "text": "Dilisha Patel, Ann Blandford, Mark Warner, Jill Shawe, and Judith Stephenson. 2019. \" I feel like only half a man\" Online Forums as a Resource for Finding a\" New Normal\" for Men Experiencing Fertility Issues. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–20.",
      "doi": ""
    },
    {
      "text": "Sachin R Pendse, Naveena Karusala, Divya Siddarth, Pattie Gonsalves, Seema Mehrotra, John A Naslund, Mamta Sood, Neha Kumar, and Amit Sharma. 2019. Mental health in the global south: challenges and opportunities in HCI for development. In Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies. 22–36.",
      "doi": "10.1145/3314344.3332483"
    },
    {
      "text": "Sachin R Pendse, Faisal M Lalani, Munmun De Choudhury, Amit Sharma, and Neha Kumar. 2020. \" Like Shock Absorbers\": understanding the human infrastructures of technology-mediated mental health support. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376465"
    },
    {
      "text": "Sachin R Pendse, Amit Sharma, Aditya Vashistha, Munmun De Choudhury, and Neha Kumar. 2021. “Can I Not Be Suicidal on a Sunday?”: Understanding Technology-Mediated Pathways to Mental Health Support. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445410"
    },
    {
      "text": "Trevor Perrier, Nicola Dell, Brian DeRenzi, Richard Anderson, John Kinuthia, Jennifer Unger, and Grace John-Stewart. 2015. Engaging pregnant women in Kenya with a hybrid computer-human SMS communication system. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1429–1438.",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Trevor Perrier, Elizabeth K Harrington, Keshet Ronen, Daniel Matemo, John Kinuthia, Grace John-Stewart, Richard Anderson, and Jennifer A Unger. 2018. Male partner engagement in family planning SMS conversations at Kenyan health clinics. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. 1–11.",
      "doi": "10.1145/3209811.3209857"
    },
    {
      "text": "Joanne Peter. 2018. Achieving scale, sustainability and impact: a donor perspective on a mobile health messaging service and help desk (MomConnect) for South African mothers. BMJ Global Health 3, Suppl 2 (2018), e000562.",
      "doi": ""
    },
    {
      "text": "James Pfeiffer, Wendy Johnson, Meredith Fort, Aaron Shakow, Amy Hagopian, Steve Gloyd, and Kenneth Gimbel-Sherr. 2008. Strengthening health systems in poor countries: a code of conduct for nongovernmental organizations. American journal of public health 98, 12 (2008), 2134–2140.",
      "doi": ""
    },
    {
      "text": "Bernd Ploderer, Jonathon Stuart, Vivian Tran, Theresa L Green, and Jennifer Muller. 2017. The transition of stroke survivors from hospital to home: understanding work and design opportunities. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. 1–9.",
      "doi": "10.1145/3152771.3152772"
    },
    {
      "text": "Ari H Pollack, Uba Backonja, Andrew D Miller, Sonali R Mishra, Maher Khelifi, Logan Kendall, and Wanda Pratt. 2016. Closing the gap: supporting patients’ transition to self-management after hospitalization. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5324–5336.",
      "doi": "10.1145/2858036.2858240"
    },
    {
      "text": "Anthony Poon, Vaidehi Hussain, Julia Loughman, Ariel C Avgar, Madeline Sterling, and Nicola Dell. 2021. Computer-Mediated Peer Support Needs of Home Care Workers: Emotional Labor & the Politics of Professionalism. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–32.",
      "doi": "10.1145/3476077"
    },
    {
      "text": "Imrana Qadeer, Kasturi Sen, and Kesavan Rajasekharan Nayar. 2001. Public health and the poverty of reforms: The South Asian predicament. SAGE Publications Pvt. Limited.",
      "doi": ""
    },
    {
      "text": "Radhika Radhakrishnan. 2021. Experiments with Social Good: Feminist Critiques of Artificial Intelligence in Healthcare in India. Catalyst: Feminism, Theory, Technoscience 7, 2 (2021).",
      "doi": ""
    },
    {
      "text": "Rifat Rahman, Md Rishadur Rahman, Nafis Irtiza Tripto, Mohammed Eunus Ali, Sajid Hasan Apon, and Rifat Shahriyar. 2021. AdolescentBot: Understanding Opportunities for Chatbots in Combating Adolescent Sexual and Reproductive Health Problems in Bangladesh. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445694"
    },
    {
      "text": "Noopur Raval and Joyojeet Pal. 2019. Making a\" Pro\":’professionalism’after platforms in beauty-work. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–17.",
      "doi": ""
    },
    {
      "text": "Fujiko Robledo Yamamoto, Amy Voida, and Stephen Voida. 2021. From Therapy to Teletherapy: Relocating Mental Health Services Online. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–30.",
      "doi": "10.1145/3479508"
    },
    {
      "text": "Nithya Sambasivan and Thomas Smyth. 2010. The human infrastructure of ICTD. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. 1–9.",
      "doi": "10.1145/2369220.2369258"
    },
    {
      "text": "Linda Sanneving, Nadja Trygg, Deepak Saxena, Dileep Mavalankar, and Sarah Thomsen. 2013. Inequity in India: the case of maternal and reproductive health. Global health action 6, 1 (2013), 19145.",
      "doi": ""
    },
    {
      "text": "Nanna Schneidermann. 2020. Texting Like a State. Media Practices and Changing African Socialities: Non-media-centric Perspectives 9(2020), 125.",
      "doi": ""
    },
    {
      "text": "Mariacristina Sciannamblo, Marisa Leavitt Cohn, Peter Lyle, and Maurizio Teli. 2021. Caring and commoning as cooperative work: A case study in Europe. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–26.",
      "doi": "10.1145/3449200"
    },
    {
      "text": "Kerry Scott, Osama Ummer, Aashaka Shinde, Manjula Sharma, Shalini Yadav, Anushree Jairath, Nikita Purty, Neha Shah, Diwakar Mohan, Sara Chamberlain, 2021. Another voice in the crowd: the challenge of changing family planning and child feeding practices through mHealth messaging in rural central India. BMJ Global Health 6, Suppl 5 (2021), e005868.",
      "doi": ""
    },
    {
      "text": "Katie Seaborn and Alexa Frank. 2022. What pronouns for Pepper? A critical review of gender/ing in research. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3491102.3501996"
    },
    {
      "text": "Christopher Seebregts, Pierre Dane, Annie Neo Parsons, Thomas Fogwill, Debbie Rogers, Marcha Bekker, Vincent Shaw, and Peter Barron. 2018. Designing for scale: optimising the health information system architecture for mobile maternal health messaging in South Africa (MomConnect). BMJ global health 3, Suppl 2 (2018), e000563.",
      "doi": ""
    },
    {
      "text": "Gaurav Sharma, Loveday Penn-Kekana, Kaveri Halder, and Véronique Filippi. 2019. An investigation into mistreatment of women during labour and childbirth in maternity care facilities in Uttar Pradesh, India: a mixed methods study. Reproductive health 16, 1 (2019), 1–16.",
      "doi": ""
    },
    {
      "text": "Rachel Simon-Kumar. 2007. Neo-liberal development and reproductive health in India: The making of the personal and the political. Indian Journal of Gender Studies 14, 3 (2007), 355–385.",
      "doi": ""
    },
    {
      "text": "Anubha Singh and Tina Park. 2022. Automating Care: Online Food Delivery Work During the CoVID-19 Crisis in India. In 2022 ACM Conference on Fairness, Accountability, and Transparency. 160–172.",
      "doi": ""
    },
    {
      "text": "Donald Skinner, Peter Delobelle, Michele Pappin, Desiree Pieterse, Tonya Marianne Esterhuizen, Peter Barron, and Lilian Dudley. 2018. User assessments and the use of information from MomConnect, a mobile phone text-based information service, by pregnant women and new mothers in South Africa. BMJ global health 3, Suppl 2 (2018), e000561.",
      "doi": ""
    },
    {
      "text": "Piya Sorcar, Benjamin Strauber, Prashant Loyalka, Neha Kumar, and Shelley Goldman. 2017. Sidestepping the elephant in the classroom: Using culturally localized technology to teach around taboos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2792–2804.",
      "doi": "10.1145/3025453.3025958"
    },
    {
      "text": "Azhagu Meena SP, Palashi Vaghela, and Joyojeet Pal. 2022. Counting to be Counted: Anganwadi Workers and Digital Infrastructures of Ambivalent Care. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–36.",
      "doi": ""
    },
    {
      "text": "Laura Subramanian, Seema Murthy, Prasad Bogam, Shirley D Yan, Megan Marx Delaney, Christian DG Goodwin, Lauren Bobanski, Arjun S Rangarajan, Anindita Bhowmik, Sehj Kashyap, 2020. Just-in-time postnatal education programmes to improve newborn care practices: needs and opportunities in low-resource settings. BMJ global health 5, 7 (2020), e002660.",
      "doi": ""
    },
    {
      "text": "Andrea Taylor, Angus Aitken, David Godden, and Judith Colligan. 2011. Group pulmonary rehabilitation delivered to the home via the Internet: feasibility and patient perception. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3083–3092.",
      "doi": "10.1145/1978942.1979398"
    },
    {
      "text": "Angelique Taylor, Hee Rin Lee, Alyssa Kubota, and Laurel D Riek. 2019. Coordinating clinical teams: Using robots to empower nurses to stop the line. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–30.",
      "doi": "10.1145/3359323"
    },
    {
      "text": "Karen Thorpe, Susan Danby, Ceridwen Cromack, and Danielle Gallegos. 2020. Supporting, failing to support and undermining breastfeeding self-efficacy: Analysis of helpline calls. Maternal & child nutrition 16, 2 (2020), e12919.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2011. Technology as amplifier in international development. In Proceedings of the 2011 iConference. 75–82.",
      "doi": "10.1145/1940761.1940772"
    },
    {
      "text": "Emily Tseng, Fabian Okeke, Madeline Sterling, and Nicola Dell. 2020. \" We can learn. Why not?\" Designing Technologies to Engender Equity for Home Health Aides. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376633"
    },
    {
      "text": "Aditya Vashistha, Neha Kumar, Anil Mishra, and Richard Anderson. 2017. Examining localization approaches for community health. In Proceedings of the 2017 Conference on Designing Interactive Systems. 357–368.",
      "doi": "10.1145/3064663.3064754"
    },
    {
      "text": "Nervo Verdezoto, Naveen Bagalkot, Syeda Zainab Akbar, Swati Sharma, Nicola Mackintosh, Deirdre Harrington, and Paula Griffiths. 2021. The invisible work of maintenance in community health: challenges and opportunities for digital health to support frontline health workers in Karnataka, South India. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–31.",
      "doi": "10.1145/3449165"
    },
    {
      "text": "Nervo Verdezoto, Naveen Bagalkot, Zainab Syeda, Swati Sharma, Paula Griffiths, Nicola Mackintosh, and Deidre Harrington. 2019. Infrastructural Artefacts in Community Health: A Case Study of Pregnancy Care Infrastructures in South India.(2019).",
      "doi": ""
    },
    {
      "text": "Nervo Verdezoto, Francisca Carpio-Arias, Valeria Carpio-Arias, Nicola Mackintosh, Parisa Eslambolchilar, Verónica Delgado, Catherine Andrade, and Galo Vásconez. 2020. Indigenous women managing pregnancy complications in rural ecuador: Barriers and opportunities to enhance antenatal care. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. 1–9.",
      "doi": "10.1145/3419249.3420141"
    },
    {
      "text": "Ina Wagner. 1995. The Politics of Women’s Work in Computerized Environments. European Journal of Women’s Studies 2, 3 (1995), 295–314.",
      "doi": ""
    },
    {
      "text": "Ding Wang, Santosh D Kale, and Jacki O’Neill. 2020. Please call the specialism: Using WeChat to support patient care in China. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376274"
    },
    {
      "text": "Rebecca Jane Williams. 2014. Storming the citadels of poverty: Family planning under the emergency in India, 1975–1977. The Journal of Asian Studies 73, 2 (2014), 471–492.",
      "doi": ""
    },
    {
      "text": "Deepika Yadav, Kirti Dabas, Prerna Malik, Anushka Bhandari, and Pushpendra Singh. 2022. “Should I visit the clinic”: Analyzing WhatsApp-mediated Online Health Support for Expectant and New Mothers in Rural India. In CHI Conference on Human Factors in Computing Systems. 1–20.",
      "doi": ""
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding opportunities for chatbots in breastfeeding education of women in india. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–30.",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Renwen Zhang, Jordan Eschler, and Madhu Reddy. 2018. Online support groups for depression in China: Culturally shaped interactions and motivations. Computer Supported Cooperative Work (CSCW) 27, 3 (2018), 327–354.",
      "doi": "10.1007/s10606-018-9322-4"
    }
  ]
}