{
  "doi": "10.1145/3544548.3580673",
  "title": "\"My Perfect Platform Would Be Telepathy\" - Reimagining the Design of Social Media with Autistic Adults",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "In this paper, we critically examine the design of mainstream social media platforms from the point of view of autistic experiences and perspectives, drawing inspiration from the neurodiversity movement, the notion of autism as neurodivergence, and the concept of autistic sociality. We conducted 12 participatory design sessions with 20 autistic adult collaborators. Through thematic analysis of qualitative data, we identify seven challenges our participants experienced when using social media, and a set of imagined features that represent their vision of how design could better support their social media use. We discuss how mainstream social media platforms are primarily designed to address neurotypical sensitivities, and fail autistic adults through lack of user control, inadequate mechanisms for expressing tone and intention, and an orientation towards phatic interactions. To close, we outline how autistic sociality can inspire the design of kinder and more considerate social media platforms.",
  "authors": [
    {
      "name": "Belén Barros Pena",
      "institution": "Centre for HCI Design, City, University of London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659547217",
      "orcid": "0000-0003-4035-1860"
    },
    {
      "name": "Nelya Koteyko",
      "institution": "Queen Mary, University of London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658634577",
      "orcid": "0000-0003-2548-8877"
    },
    {
      "name": "Martine Van Driel",
      "institution": "University of Birmingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781568",
      "orcid": "0000-0002-9873-8999"
    },
    {
      "name": "Andrea Delgado",
      "institution": "autistica, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781907",
      "orcid": "0000-0001-9594-9566"
    },
    {
      "name": "John Vines",
      "institution": "University of Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "Suhaib Aslam, Jelle van Dijk, and Edwin Dertien. 2019. CoCoCo: Co-designing a co-design toolkit for co-bots to empower autistic adults’. In Proceedings of the 4th Biennial Research Through Design Conference(RTD ’19). Delft and Rotterdam, The Netherlands, 1–16. https://doi.org/10.6084/m9.figshare.7855904.v1",
      "doi": ""
    },
    {
      "text": "autistica. n.d. What is autism?Retrieved September 2, 2022 from https://www.autistica.org.uk/what-is-autism/what-is-autism",
      "doi": ""
    },
    {
      "text": "Christopher Barber. 2017. Social media and autism spectrum conditions. Practice Nursing 28, 7 (2017), 292–298. https://doi.org/10.12968/pnur.2017.28.7.292",
      "doi": ""
    },
    {
      "text": "Ben Belek. 2018. Autism and the Proficiency of Social Ineptitude: Probing the Rules of “Appropriate” Behavior. Ethos 46, 2 (2018), 161–179. https://doi.org/10.1111/etho.12202",
      "doi": ""
    },
    {
      "text": "Hanna Bertilsdotter Rosqvist. 2019. Doing things together: Exploring meanings of different forms of sociality among autistic people in an autistic work space. Alter 13, 3 (2019), 168–178. https://doi.org/10.1016/j.alter.2019.03.003",
      "doi": ""
    },
    {
      "text": "Nomy Bitman. 2022. “Authentic” digital inclusion? Dis/ability performances on social media by users with concealable communicative disabilities. new media & society 24, 2 (2022), 401–419. https://doi.org/10.1177/14614448211063183",
      "doi": ""
    },
    {
      "text": "Janet Borgerson and Daniel Miller. 2016. Scalable sociality and “How the world changed social media”: conversation with Daniel Miller. Consumption Markets & Culture 19, 6 (2016), 520–533. https://doi.org/10.1080/10253866.2015.1120980",
      "doi": ""
    },
    {
      "text": "Kristen Bottema-Beutel, Steven K. Kapp, Jessica Nina Lester, Noah J. Sasson, and Brittany N. Hand. 2021. Avoiding Ableist Language: Suggestions for Autism Researchers. Autism in Adulthood 3, 1 (2021), 18–29. https://doi.org/10.1089/aut.2020.0014",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2020. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern-based qualitative analytic approaches. Counselling & Psychotherapy Research 21, 1 (2020), 37–47. https://doi.org/10.1002/capr.12360",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. One size fits all? What counts as quality practice in (reflexive) thematic analysis?Qualitative Research in Psychology 18, 3 (2021), 328–352. https://doi.org/10.1080/14780887.2020.1769238",
      "doi": ""
    },
    {
      "text": "Melissa Brough, Ioana Literat, and Amanda Ikin. 2020. “Good Social Media?”: Underrepresented Youth Perspectives on the Ethical and Equitable Design of Social Media Platforms. Social Media + Society 6, 2 (2020). https://doi.org/10.1177/2056305120928488 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Moira Burke, Robert Kraut, and Diane Williams. 2010. Social use of computer-mediated communication by adults on the autism spectrum. In Proceedings of the 2010 ACM conference on Computer supported cooperative work(CSCW ’10). 425–434. https://doi.org/10.1145/1718918.1718991",
      "doi": "10.1145/1718918.1718991"
    },
    {
      "text": "Alexander Cho. 2018. Default publicness: Queer youth of color, social media, and being outed by the machine. New Media & Society 20, 9 (2018), 3183–3200. https://doi.org/10.1177/1461444817744784 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Catherine J Crompton, Danielle Ropar, Claire VM Evans-Williams, Emma G Flynn, and Sue Fletcher-Watson. 2020. Autistic peer-to-peer information transfer is highly effective. Autism 24, 7 (2020), 1704–1712. https://doi.org/10.1177/1362361320919286",
      "doi": ""
    },
    {
      "text": "Nicholas Sheep Dalton. 2013. Neurodiversity & HCI. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2295–2304. https://doi.org/10.1145/2468356.2468752",
      "doi": "10.1145/2468356.2468752"
    },
    {
      "text": "Joyce Davidson. 2008. Autistic culture online: virtual communication and cultural expression on the spectrum. Social & Cultural Geography 9, 7 (2008), 791–806. https://doi.org/10.1080/14649360802382586",
      "doi": ""
    },
    {
      "text": "Hanne De Jaegher. 2013. Embodiment and sense-making in autism. Frontiers in Integrative Neuroscience 7 (2013). https://doi.org/10.3389/fnint.2013.00015",
      "doi": ""
    },
    {
      "text": "Cat Drew. 2016. Exploring the evidence. Retrieved November 16, 2022 from https://openpolicy.blog.gov.uk/2016/03/07/exploring-the-evidence/",
      "doi": ""
    },
    {
      "text": "Marc Fabri, Penny C.S. Andrews, and Heta Pukki. 2016. Using Design Thinking to engage autistic students in participatory design of an online toolkit to help with transition into higher education. Journal of Assistive Technologies 10, 2 (2016). https://doi.org/10.1108/JAT-02-2016-0008",
      "doi": ""
    },
    {
      "text": "National Institute for Health and Care Research (NIHR). 2018. Reward and recognition for public contributors - a guide to the payment of fees and expenses. Retrieved September 7, 2022 from https://www.nihr.ac.uk/documents/reward-and-recognition-for-public-contributors-a-guide-to-the-payment-of-fees-and-expenses/12248",
      "doi": ""
    },
    {
      "text": "Katie Gaudion, Ashley Hall, Jeremy Myerson, and Liz Pellicano. 2015. A designer’s approach: how can autistic adults with learning disabilities be involved in the design process?CoDesign 11, 1 (2015), 49–69. https://doi.org/10.1080/15710882.2014.997829",
      "doi": ""
    },
    {
      "text": "Kristen Gillespie-Lynch, Steven K. Kapp, Christina Shane-Simpson, David Shane Smith, and Ted Hutman. 2014. Intersections Between the Autism Spectrum and the Internet: Perceived Benefits and Preferred Functions of Computer-Mediated Communication. Intellectual and Developmental Disabilities 52, 6 (2014), 456–469. https://doi.org/10.1352/1934-9556-52.6.456",
      "doi": ""
    },
    {
      "text": "Judith Good, Mark Brosnan, Nicola Yuill, Lisa Austin, and Sarah Parsons. 2016. Putting Technology Design into the Hands of the Users with the ASCmeI.T. App. In Autism and Technology: Beyond Assistance & Interventions - A workshop at #CHI2016. http://igw.tuwien.ac.at/chi16-autismtechnology/attachments/GoodEtAl.pdf",
      "doi": ""
    },
    {
      "text": "Florian Grond, M. Ariel Cascio, Rossio Motta-Ochoa, Tamar Tembeck, Dan Ten Veen, and Stefanie Blain-Moraes. 2019. Participatory design of biomusic with users on the autism spectrum. In 8th International Conference on Affective Computing and Intelligent Interaction(ACII ’19). https://doi.org/10.1109/ACII.2019.8925484",
      "doi": ""
    },
    {
      "text": "Kim Halskov and Peter Dalsgård. 2006. Inspiration card workshops. In Proceedings of the 6th conference on Designing Interactive systems(DIS ’06). ACM, New York, NY, USA, 2–11. https://doi.org/10.1145/1142405.1142409",
      "doi": "10.1145/1142405.1142409"
    },
    {
      "text": "Brett Heasman and Alex Gillespie. 2019. Neurodivergent intersubjectivity: Distinctive features of how autistic people create shared understanding. Autism 23, 4 (2019), 910–921. https://doi.org/10.1177/1362361318785172",
      "doi": ""
    },
    {
      "text": "Pier Jaarsma and Stellan Welin. 2012. Autism as a Natural Human Variation: Reflections on the Claims of the Neurodiversity Movement. Health Care Analysis 20, 1 (2012), 20–30. https://doi.org/10.1007/s10728-011-0169-9",
      "doi": ""
    },
    {
      "text": "Bogoan Kim, Daehyoung Lee, Aehong Min, Seungwon Paik, Georgia Frey, Scott Bellini, Kyungsik Han, and Patrick C. Shih. 2020. PuzzleWalk: A theory-driven iterative design inquiry of a mobile game for promoting physical activity in adults with autism spectrum disorder. PLoS ONE 15, 9 (2020). https://doi.org/10.1371/journal.pone.0237966",
      "doi": ""
    },
    {
      "text": "Emma Kinnaird, Catherine Stewart, and Kate Tchanturia. 2019. Investigating alexithymia in autism: A systematic review and meta-analysis. European Psychiatry 55(2019), 80–89. https://doi.org/10.1016/j.eurpsy.2018.09.004",
      "doi": ""
    },
    {
      "text": "Nelya Koteyko, Martine van Driel, and John Vines. 2022. Autistic sociality on Twitter: Enacted affordances and affiliation strategies. Discourse & Communication 16, 4 (2022), 385–402. https://doi.org/10.1177/17504813211070655",
      "doi": ""
    },
    {
      "text": "Andrés Lucero, Peter Dalsgaard, Kim Halskov, and Jacob Buur. 2016. Designing with Cards. In Collaboration in Creative Design, Panos Markopoulos, Jean-Bernard Martens, Julian Malins, Karin Coninx, and Aggelos Liapis (Eds.). Springer International Publishing, 75–95. https://doi.org/10.1007/978-3-319-29155-0_5",
      "doi": ""
    },
    {
      "text": "Ulrik Lyngs, Kai Lukoff, Petr Slovak, Reuben Binns, Adam Slack, Michael Inzlicht, Max Van Kleek, and Nigel Shadbolt. 2019. Self-Control in Cyberspace: Applying Dual Systems Theory to a Review of Digital Self-Control Tools. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3290605.3300361",
      "doi": "10.1145/3290605.3300361"
    },
    {
      "text": "Ulrik Lyngs, Kai Lukoff, Petr Slovak, William Seymour, Helena Webb, Marina Jirotka, Jun Zhao, Max Van Kleek, and Nigel Shadbolt. 2020. ’I Just Want to Hack Myself to Not Get Distracted’: Evaluating Design Interventions for Self-Control on Facebook. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3313831.3376672",
      "doi": "10.1145/3313831.3376672"
    },
    {
      "text": "Miriam Madsen, Rana el Kaliouby, Micah Eckhardt, Mohammed E. Hoque, Matthew S. Goodwin, and Rosalind Picard. 2009. Lessons from participatory design with adolescents on the autism spectrum. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems(CHI ’09). Association for Computing Machinery, New York, NY, USA, 3835–3840. https://doi.org/10.1145/1520340.1520580",
      "doi": "10.1145/1520340.1520580"
    },
    {
      "text": "Rachael Maun, Marc Fabri, and Pip Trevorrow. 2021. Adapting Participatory Design Activities for Autistic Adults: A Review. In Design, User Experience, and Usability: Design for Diversity, Well-being, and Social Development, Marcelo M. Soares, Elizabeth Rosenzweig, and Aaron Marcus (Eds.). Springer International Publishing, Cham, 300–314. https://doi.org/10.1007/978-3-030-78224-5_21",
      "doi": "10.1007/978-3-030-78224-5_21"
    },
    {
      "text": "Micah O. Mazurek. 2013. Social media use among adults with autism spectrum disorders. Computers in Human Behavior 29, 4 (2013), 1709–1714. https://doi.org/10.1016/j.chb.2013.02.004",
      "doi": "10.1016/j.chb.2013.02.004"
    },
    {
      "text": "Vincent Miller. 2008. New Media, Networking and Phatic Culture:. Convergence 14, 4 (2008), 387–400. https://doi.org/10.1177/1354856508094659",
      "doi": ""
    },
    {
      "text": "Damian E.M. Milton. 2012. On the ontological status of autism: the ‘double empathy problem’. Disability & Society 27, 6 (2012), 883–887. https://doi.org/10.1080/09687599.2012.710008",
      "doi": ""
    },
    {
      "text": "Damian E.M. Milton. 2014. Autistic expertise: A critical reflection on the production of knowledge in autism studies. Autism 18, 7 (2014), 794–802. https://doi.org/10.1177/1362361314525281",
      "doi": ""
    },
    {
      "text": "Elinor Ochs and Olga Solomon. 2010. Autistic Sociality. Ethos 38, 1 (2010), 69–92. https://doi.org/10.1111/j.1548-1352.2009.01082.x",
      "doi": ""
    },
    {
      "text": "Xinru Page, Andrew Capener, Spring Cullen, Tao Wang, Monica Garfield, and Pamela J. Wisniewski. 2022. Perceiving Affordances Differently: The Unintended Consequences When Young Autistic Adults Engage with Social Media. In CHI Conference on Human Factors in Computing Systems(CHI ’22). ACM New York, NY. https://doi.org/10.1145/3491102.3517596",
      "doi": "10.1145/3491102.3517596"
    },
    {
      "text": "Sarah Parsons, Nicola Yuill, Judith Good, Mark Brosnan, Lisa Austin, Clarence Singleton, Benoit Bossavit, and Barnabear. 2016. What Technology for Autism Needs to be Invented? Idea Generation from the Autism Community via the ASCmeI.T. App. In Computers Helping People with Special Needs. ICCHP 2016(Lecture Notes in Computer Science, Vol. 9759), Penaz P. Miesenberger K., Buhler C. (Ed.). Springer, Cham.https://doi.org/10.1007/978-3-319-41267-2_49",
      "doi": ""
    },
    {
      "text": "Amon Rapp, Federica Cena, Claudio Mattutino, Guido Boella, Claudio Schifanella, Roberto Keller, and Stefania Brighenti. 2019. Designing an Urban Support for Autism. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’19). ACM New York, NY, USA, 1–6. https://doi.org/10.1145/3338286.3344390",
      "doi": "10.1145/3338286.3344390"
    },
    {
      "text": "Ginny Russell, Steven K. Kapp, Daisy Elliott, Chris Elphick, Ruth Gwernan-Jones, and Christabel Owens. 2019. Mapping the Autistic Advantage from the Accounts of Adults Diagnosed with Autism: A Qualitative Study. Autism in Adulthood 1, 2 (2019). https://doi.org/10.1089/aut.2018.0035",
      "doi": ""
    },
    {
      "text": "Will Simm, Maria Angela Ferrario, Adrian Gradinar, and Jon Whittle. 2014. Prototyping ’clasp’: implications for designing digital technology for and with adults with autism. In Proceedings of the 2014 conference on Designing interactive systems(DIS ’14). Association for Computing Machinery, 345–354. https://doi.org/10.1145/2598510.2600880",
      "doi": "10.1145/2598510.2600880"
    },
    {
      "text": "Judy Singer. 1999. ’Why can’t you be normal for once in your life?’ From a ’problem with no name’ to the emergence of a new category of difference. In Disability Discourse, Mairian Corker and Sally French (Eds.). Open University Press, Buckingham - Philadelphia, 57–67.",
      "doi": ""
    },
    {
      "text": "Judy Singer. 2017. NeuroDiversity: The Birth of an Idea. Judy Singer.",
      "doi": ""
    },
    {
      "text": "Anne Fleur Spaa. 2022. Understanding the role of design in supporting reflective practice in evidence-based policymaking. Ph.D. Northumbria University. http://nrl.northumbria.ac.uk/id/eprint/49196/",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Os Keyes, and Geraldine Fitzpatrick. 2019. Agency of Autistic Children in Technology Research—A Critical Literature Review. ACM Transactions on Computer-Human Interaction 26, 6(2019), 38:1–38:40. https://doi.org/10.1145/3344919",
      "doi": "10.1145/3344919"
    },
    {
      "text": "Deborah Sturm, Michael Kholodovsky, Rayan Arab, David Shane Smith, Pavel Asanov, and Kristen Gillespie-Lynch. 2019. Participatory Design of a Hybrid Kinect Game to Promote Collaboration between Autistic Players and Their Peers. International Journal of Human–Computer Interaction 35, 8(2019), 706–723. https://doi.org/10.1080/10447318.2018.1550180",
      "doi": ""
    },
    {
      "text": "Paraskevi Triantafyllopoulou, Charlotte Clark-Hughes, and Peter E. Langdon. 2021. Social Media and Cyber-Bullying in Autistic Adults. Journal of Autism and Developmental Disorders (2021). https://doi.org/10.1007/s10803-021-05361-6",
      "doi": ""
    },
    {
      "text": "Piia Varis and Jan Blommaert. 2015. Conviviality and collectives on social media: Virality, memes, and new social structures. Multilingual Margins: A journal of multilingualism from the periphery 2, 1(2015), 31–31. https://doi.org/10.14426/mm.v2i1.55",
      "doi": ""
    },
    {
      "text": "John Vines, Mark Blythe, Stephen Lindsay, Paul Dunphy, Andrew Monk, and Patrick Olivier. 2012. Questionable Concepts: Critique as a Resource for Designing with Eighty Somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). ACM New York, NY, USA, Austin, Texas, USA, 1169–1178. https://doi.org/10.1145/2207676.2208567",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "Tao Wang, Monica Garfield, Pamela Wisniewski, and Xinru Page. 2020. Benefits and Challenges for Social Media Users on the Autism Spectrum. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing(CSCW ’20). Association for Computing Machinery, New York, NY, USA, 419–424. https://doi.org/10.1145/3406865.3418322",
      "doi": "10.1145/3406865.3418322"
    },
    {
      "text": "Deborah M. Ward, Karen E. Dill-Shackleford, and Micah O. Mazurek. 2018. Social Media Use and Happiness in Adults with Autism Spectrum Disorder. Cyberpsychology, Behavior, and Social Networking 21, 3(2018). https://doi.org/10.1089/cyber.2017.0331",
      "doi": ""
    },
    {
      "text": "Jinan Zeidan, Eric Fombonne, Julie Scorah, Alaa Ibrahim, Maureen S. Durkin, Shekhar Saxena, Afiqah Yusuf, Andy Shih, and Mayada Elsabbagh. 2022. Global prevalence of autism: A systematic review update. Autism Research 15, 5 (2022), 778–790. https://doi.org/10.1002/aur.2696",
      "doi": ""
    },
    {
      "text": "Annuska Zolyomi and Jaime Snyder. 2021. Social-Emotional-Sensory Design Map for Affective Computing Informed by Neurodivergent Experiences. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 77:1–77:37. https://doi.org/10.1145/3449151",
      "doi": "10.1145/3449151"
    }
  ]
}