{
  "doi": "10.1145/3544548.3581009",
  "title": "Dementia Eyes: Co-Design and Evaluation of a Dementia Education Augmented Reality Experience for Medical Workers",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Dementia describes a syndrome of cognitive degeneration, and Behavioural and Psychological Symptoms of Dementia (BPSD) is the non-cognitive symptom. BPSD can be improved by care services. To aid better care service, we explore the potential of using Augmented Reality (AR) to support dementia education for medical workers in three steps: (1) We explore medical workers’ perspective on dementia care lived experience and XR, (2) we co-design an educational experience containing an AR-based application and a 5-min activity with medical workers, (3) we evaluate the effectiveness of the system through a mixed method study. Our result shows that the AR experience successfully touches participants, and motivates them to reflect on the provision of care service. On this basis, we discuss the elements and challenges of designing XR-enabled dementia education for users unfamiliar with novel technology, and the potential of using XR in clinical education.",
  "authors": [
    {
      "name": "Ximing Shen",
      "institution": "Keio University Graduate School of Media Design, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659919765",
      "orcid": "0000-0003-4272-0068"
    },
    {
      "name": "Yun Suen Pai",
      "institution": "Keio University Graduate School of Media Design, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659048587",
      "orcid": "0000-0002-6090-2837"
    },
    {
      "name": "Dai Kiuchi",
      "institution": "Mediva Inc, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659919349",
      "orcid": "0000-0001-6072-8923"
    },
    {
      "name": "Kehan Bao",
      "institution": "Mediva Inc., Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659919545",
      "orcid": "0000-0003-3089-8774"
    },
    {
      "name": "Tomomi Aoki",
      "institution": "Mediva Inc., Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659919916",
      "orcid": "0000-0003-0182-8910"
    },
    {
      "name": "Hikari Meguro",
      "institution": "Mediva Inc., Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782208",
      "orcid": "0000-0002-8337-2365"
    },
    {
      "name": "Kanoko Oishi",
      "institution": "Mediva Inc., Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659920127",
      "orcid": "0000-0002-1157-7310"
    },
    {
      "name": "Ziyue Wang",
      "institution": "Keio University Graduate School of Media Design, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660533519",
      "orcid": "0000-0002-7785-8887"
    },
    {
      "name": "Sohei Wakisaka",
      "institution": "Keio University Graduate School of Media Design, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557875156",
      "orcid": "0000-0002-8738-8540"
    },
    {
      "name": "Kouta Minamizawa",
      "institution": "Keio University Graduate School of Media Design, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331499667",
      "orcid": "0000-0002-6303-5791"
    }
  ],
  "references": [
    {
      "text": "2009. Learning, teaching, and scholarship in a Digital age. Educational Researcher 38 (2009). https://doi.org/10.3102/0013189x09336671",
      "doi": ""
    },
    {
      "text": "2009. Living well with dementia: A national dementia strategy. Department of Health and Social Care, United Kingdom.",
      "doi": ""
    },
    {
      "text": "2013. National Plan to Address Alzheimer’s Disease: 2013 Update. U.S. Dept. of Health and Human Services.",
      "doi": ""
    },
    {
      "text": "2018. World Alzheimer Report 2018: The state of the art of dementia research: New frontiers. Alzheimer’s Disease International. https://www.alzint.org/u/WorldAlzheimerReport2018.pdf",
      "doi": ""
    },
    {
      "text": "2019. A National Dementia Strategy for Canada: Together We Aspire. Public Health Agency of Canada.",
      "doi": ""
    },
    {
      "text": "2021. Alzheimer’s & Dementia: The Journal of the Alzheimer’s Association 17, 3 (Mar 2021), 327–406. https://doi.org/10.1002/alz.12328",
      "doi": ""
    },
    {
      "text": "Arinola Adefila, Sean Graham, Lynn Clouder, Patricia Bluteau, and Steven Ball. 2016. MyShoes – the future of experiential dementia training?The Journal of Mental Health Training, Education and Practice 11, 2(2016), 91–101. https://doi.org/10.1108/jmhtep-10-2015-0048",
      "doi": ""
    },
    {
      "text": "R. Aggarwal, O. T. Mytton, M. Derbrew, D. Hananel, M. Heydenburg, B. Issenberg, C. MacAulay, M. E. Mancini, T. Morimoto, N. Soper, and et al.2010. Training and simulation for patient safety. Quality and Safety in Health Care 19, Suppl 2 (2010), i34–i43. https://doi.org/10.1136/qshc.2009.038562",
      "doi": ""
    },
    {
      "text": "Jessica Alber, Danielle Goldfarb, Louisa I. Thompson, Edmund Arthur, Kimberly Hernandez, Derrick Cheng, Delia Cabrera DeBuc, Francesca Cordeiro, Leonardo Provetti-Cunha, Jurre den Haan, Gregory P. Van Stavern, Stephen P. Salloway, Stuart Sinoff, and Peter J. Snyder. 2020. Developing retinal biomarkers for the earliest stages of Alzheimer’s disease: What we know, what we don’t, and how to move forward. Alzheimer’s & Dementia 16, 1 (2020), 229–243. https://doi.org/10.1002/alz.12006",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Rachel E. Clarke, Charles Windlin, Anna Ståhl, Kristina Höök, and Geraldine Fitzpatrick. 2019. Emotion Work in Experience-Centered Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300832",
      "doi": "10.1145/3290605.3300832"
    },
    {
      "text": "Roger Bemelmans, Gert Jan Gelderblom, Pieter Jonker, and Luc de Witte. 2012. Socially assistive robots in elderly care: A systematic review into effects and effectiveness. Journal of the American Medical Directors Association 13, 2(2012). https://doi.org/10.1016/j.jamda.2010.10.002",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett and Daniela K. Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the “Other”. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300528",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Michael W. Bentley, Rohan Kerr, Margaret Ginger, and Jacob Karagoz. 2019. Behavioural change in primary care professionals undertaking online education in Dementia Care in general practice. Australian Journal of Primary Health 25 (2019), 244. https://doi.org/10.1071/py18079",
      "doi": ""
    },
    {
      "text": "R. Bhat and K. Rockwood. 2007. Delirium as a disorder of consciousness. Journal of Neurology, Neurosurgery & Psychiatry 78, 11(2007), 1167–1170. https://doi.org/10.1136/jnnp.2007.115998",
      "doi": ""
    },
    {
      "text": "Filip Bircanin, Margot Brereton, Laurianne Sitbon, Bernd Ploderer, Andrew Azaabanye Bayor, and Stewart Koplick. 2021. Including Adults with Severe Intellectual Disabilities in Co-Design through Active Support. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3411764.3445057",
      "doi": "10.1145/3411764.3445057"
    },
    {
      "text": "Margaret M. Bradley and Peter J. Lang. 1994. Measuring emotion: The self-assessment manikin and the semantic differential. Journal of Behavior Therapy and Experimental Psychiatry 25, 1(1994), 49–59. https://doi.org/10.1016/0005-7916(94)90063-9",
      "doi": "10.1016/0005-"
    },
    {
      "text": "Rita Maldonado Branco, Joana Quental, and Óscar Ribeiro. 2016. Playing with personalisation and openness in a codesign project involving people with dementia. In Proceedings of the 14th Participatory Design Conference: Full papers - Volume 1(PDC ’16). Association for Computing Machinery, New York, NY, USA, 61–70. https://doi.org/10.1145/2940299.2940309",
      "doi": "10.1145/2940299.2940309"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2022. Thematic analysis: A practical guide. SAGE.",
      "doi": ""
    },
    {
      "text": "Abraham A. Brody and James E. Galvin. 2013. A review of interprofessional dissemination and education interventions for recognizing and managing dementia. Gerontology & Geriatrics Education 34, 3 (2013), 225–256. https://doi.org/10.1080/02701960.2013.801342",
      "doi": ""
    },
    {
      "text": "Marion Buchenau and Jane Fulton Suri. 2000. Experience prototyping(DIS ’00). Association for Computing Machinery, New York, NY, USA, 424–433. https://doi.org/10.1145/347642.347802",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "J. Cerejeira, L. Lagarto, and E. B. Mukaetova-Ladinska. 2012. Behavioral and Psychological Symptoms of Dementia. Frontiers in Neurology 3 (May 2012). https://doi.org/10.3389/fneur.2012.00073",
      "doi": ""
    },
    {
      "text": "D.-C. Chan, J. D. Kasper, B. S. Black, and P. V. Rabins. 2003. Presence of behavioral and psychological symptoms predicts nursing home placement in community-dwelling elders with cognitive impairment in univariate but not multivariate analysis. The Journals of Gerontology Series A: Biological Sciences and Medical Sciences 58, 6 (2003). https://doi.org/10.1093/gerona/58.6.m548",
      "doi": ""
    },
    {
      "text": "Hui-Chen Chao, Merrie Kaas, Ying-Hwa Su, Mei-Feng Lin, Mei-Chih Huang, and Jing-Jy Wang. 2016. Effects of the advanced innovative internet-based communication education program on promoting communication between nurses and patients with dementia. Journal of Nursing Research 24, 2 (2016), 163–172. https://doi.org/10.1097/jnr.0000000000000109",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for caregivers: designing for integrality. In Proceedings of the 2013 conference on Computer supported cooperative work(CSCW ’13). Association for Computing Machinery, New York, NY, USA, 91–102. https://doi.org/10.1145/2441776.2441789",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Pratik S. Chougule, Raymond P. Najjar, Maxwell T. Finkelstein, Nagaendran Kandiah, and Dan Milea. 2019. Light-Induced Pupillary Responses in Alzheimer’s Disease. Frontiers in Neurology 10 (2019). https://doi.org/10.3389/fneur.2019.00360",
      "doi": ""
    },
    {
      "text": "Changui Chun, Byungho Park, and Chungkon Shi. 2020. Re-Living Suspense: Emotional and Cognitive Responses During Repeated Exposure to Suspenseful Film. Frontiers in Psychology 11 (2020). https://www.frontiersin.org/articles/10.3389/fpsyg.2020.558234",
      "doi": ""
    },
    {
      "text": "Alice Cronin‐Golomb, Suzanne Corkin, Joseph F. Rizzo, Jennifer Cohen, John H. Growdon, and Kathleen S. Banks. 1991. Visual dysfunction in Alzheimer’s disease: Relation to normal aging. Annals of Neurology 29, 1 (1991), 41–52. https://doi.org/10.1002/ana.410290110",
      "doi": ""
    },
    {
      "text": "Rajal Devshi, Sarah Shaw, Jordan Elliott-King, Eef Hogervorst, Avinash Hiremath, Latha Velayudhan, Satheesh Kumar, Sarah Baillon, and Stephan Bandelow. 2015. Prevalence of behavioural and psychological symptoms of dementia in individuals with learning disabilities. Diagnostics 5, 4 (2015), 564–576. https://doi.org/10.3390/diagnostics5040564",
      "doi": ""
    },
    {
      "text": "Giada Di Stefano, Francesca Gino, Gary P. Pisano, and Bradley R. Staats. 2014. Learning by thinking: How reflection aids performance. SSRN Electronic Journal(2014). https://doi.org/10.2139/ssrn.2414478",
      "doi": ""
    },
    {
      "text": "Helen Durgante, Milena Lucía Contreras, Tamara Backhouse, Angelique Mavrodaris, Michele Gomes Ferreira, Debora Lee Paulo, Marcus Vinicius Alves, Larissa da Serelli, Leonardo Cruz Souza, Naoko Kishita, and et al.2020. Challenges in dementia care: Comparing key issues from Brazil and the United Kingdom. Dementia & Neuropsychologia 14, 3 (2020), 216–222. https://doi.org/10.1590/1980-57642020dn14-030003",
      "doi": ""
    },
    {
      "text": "James Elliman, Michael Loizou, and Fernando Loizides. 2016. Virtual reality simulation training for student nurse education. 2016 8th International Conference on Games and Virtual Worlds for Serious Applications (VS-GAMES)(2016). https://doi.org/10.1109/vs-games.2016.7590377",
      "doi": ""
    },
    {
      "text": "Melina Evripidou, Andreas Charalambous, Nicos Middleton, and Evridiki Papastavrou. 2018. Nurses’ knowledge and attitudes about Dementia Care: Systematic Literature Review. Perspectives in Psychiatric Care 55, 1 (2018), 48–60. https://doi.org/10.1111/ppc.12291",
      "doi": ""
    },
    {
      "text": "DAVID P. FARRINGTON. 1991. Longitudinal Research Strategies: Advantages, problems, and prospects. Journal of the American Academy of Child & Adolescent Psychiatry 30, 3(1991), 369–374. https://doi.org/10.1097/00004583-199105000-00003",
      "doi": ""
    },
    {
      "text": "Franz Faul, Edgar Erdfelder, Albert-Georg Lang, and Axel Buchner. 2007. G*Power 3: A flexible statistical power analysis program for the social, behavioral, and biomedical sciences. Behavior Research Methods 39, 2 (May 2007), 175–191. https://doi.org/10.3758/BF03193146",
      "doi": ""
    },
    {
      "text": "Seth A. Gale, Diler Acar, and Kirk R. Daffner. 2018. Dementia. The American Journal of Medicine 131, 10 (2018), 1161–1169. https://doi.org/10.1016/j.amjmed.2018.01.022",
      "doi": ""
    },
    {
      "text": "Joseph E Gaugler, Rachel Zmora, Lauren L Mitchell, Jessica M Finlay, Colleen M Peterson, Hayley McCarron, and Eric Jutkowitz. 2018. Six-month effectiveness of remote activity monitoring for persons living with dementia and their family caregivers: An experimental mixed methods study. The Gerontologist 59, 1 (2018), 78–89. https://doi.org/10.1093/geront/gny078",
      "doi": ""
    },
    {
      "text": "Kathrin Gerling, Patrick Dickinson, Kieran Hicks, Liam Mason, Adalberto L. Simeone, and Katta Spiel. 2020. Virtual Reality Games for People Using Wheelchairs. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3313831.3376265",
      "doi": "10.1145/3313831.3376265"
    },
    {
      "text": "Justyna Gerłowska, Urszula Skrobas, Katarzyna Grabowska-Aleksandrowicz, Agnieszka Korchut, Sebastian Szklener, Dorota Szczęśniak-Stańczyk, Dimitrios Tzovaras, and Konrad Rejdak. 2018. Assessment of perceived attractiveness, usability, and societal impact of a multimodal robotic assistant for aging patients with memory impairments. Frontiers in Neurology 9(2018). https://doi.org/10.3389/fneur.2018.00392",
      "doi": ""
    },
    {
      "text": "Clarissa Giebel. 2020. “Current dementia care: what are the difficulties and how can we advance care globally?”. BMC Health Services Research 20, 1 (2020). https://doi.org/10.1186/s12913-020-05307-1",
      "doi": ""
    },
    {
      "text": "Neil S. Gittings and James L. Fozard. 1986. Age related changes in visual acuity. Experimental Gerontology 21, 4-5 (1986), 423–433. https://doi.org/10.1016/0531-5565(86)90047-1",
      "doi": ""
    },
    {
      "text": "Veer B. Gupta, Nitin Chitranshi, Jurre den Haan, Mehdi Mirzaei, Yuyi You, Jeremiah KH. Lim, Devaraj Basavarajappa, Angela Godinez, Silvia Di Angelantonio, Perminder Sachdev, Ghasem H. Salekdeh, Femke Bouwman, Stuart Graham, and Vivek Gupta. 2021. Retinal changes in Alzheimer’s disease— integrated prospects of imaging, functional and molecular advances. Progress in Retinal and Eye Research 82 (May 2021), 100899. https://doi.org/10.1016/j.preteyeres.2020.100899",
      "doi": ""
    },
    {
      "text": "Matthew Allan Hamilton, Anthony Paul Beug, Howard John Hamilton, and Wil James Norton. 2021. Augmented Reality Technology for People Living with Dementia and their Care Partners. In 2021 the 5th International Conference on Virtual and Augmented Reality Simulations. ACM, Melbourne VIC Australia, 21–30. https://doi.org/10.1145/3463914.3463918",
      "doi": "10.1145/3463914.3463918"
    },
    {
      "text": "Ann Helms, Kathryn Denson, Diane Brown, and Deborah Simpson. 2009. One specialty at a time: Achieving competency in geriatrics through an e-learning neurology clerkship module. Academic Medicine 84, Supplement (2009). https://doi.org/10.1097/acm.0b013e3181b37a38",
      "doi": ""
    },
    {
      "text": "Nicole T.M. Hill, Loren Mowszowski, Sharon L. Naismith, Verity L. Chadwick, Michael Valenzuela, and Amit Lampit. 2017. Computerized cognitive training in older adults with mild cognitive impairment or dementia: A systematic review and meta-analysis. American Journal of Psychiatry 174, 4 (2017), 329–340. https://doi.org/10.1176/appi.ajp.2016.16030360",
      "doi": ""
    },
    {
      "text": "Ladson Hinton, Carol E. Franz, Geetha Reddy, Yvette Flores, Richard L. Kravitz, and Judith C. Barker. 2007. Practice constraints, behavioral problems, and dementia care: Primary care physicians’ perspectives. Journal of General Internal Medicine 22, 11 (2007), 1487–1492. https://doi.org/10.1007/s11606-007-0317-y",
      "doi": ""
    },
    {
      "text": "Tomoki Hiramatsu, Masaya Kamei, Daiji Inoue, Akihiro Kawamura, Qi An, and Ryo Kurazume. 2020. Development of dementia care training system based on augmented reality and whole body wearable tactile sensor. In 2020 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 4148–4154. https://doi.org/10.1109/IROS45743.2020.9341039",
      "doi": "10.1109/IROS45743.2020.9341039"
    },
    {
      "text": "John V. Hobday, Kay Savik, and Joseph E. Gaugler. 2010. An internet-based multimedia education prototype to enhance late-stage dementia care: Formative research results. Geriatric Nursing 31, 6 (2010), 402–411. https://doi.org/10.1016/j.gerinurse.2010.06.001",
      "doi": ""
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Gail Kenning, Inge Bongers, and Berry Eggen. 2022. Designing for Everyday Sounds at Home with People with Dementia and their Partners. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3491102.3501993",
      "doi": "10.1145/3491102.3501993"
    },
    {
      "text": "Kuo-Ting Huang, Christopher Ball, Jessica Francis, Rabindra Ratan, Josephine Boumis, and Joseph Fordham. 2019. Augmented Versus Virtual Reality in Education: An Exploratory Study Examining Science Knowledge Retention When Using Augmented Reality/Virtual Reality Mobile Applications. Cyberpsychology, Behavior and Social Networking 22, 2 (Feb 2019), 105–110. https://doi.org/10.1089/cyber.2018.0150",
      "doi": ""
    },
    {
      "text": "A. Blair Irvine, Michelle Bourgeois, Molly Billow, and John R. Seeley. 2007. Internet training for nurse aides to prevent resident aggression. Journal of the American Medical Directors Association 8, 8(2007), 519–526. https://doi.org/10.1016/j.jamda.2007.05.002",
      "doi": ""
    },
    {
      "text": "Lasse Jensen and Flemming Konradsen. 2018. A review of the use of virtual reality head-mounted displays in education and training. Education and Information Technologies 23, 4 (Jul 2018), 1515–1529. https://doi.org/10.1007/s10639-017-9676-0",
      "doi": "10.1007/s10639-017-9676-0"
    },
    {
      "text": "Cindy Jones, Daniel Khalil, Karanjot Mander, Alexandra Yeoh, and Christian Moro. 2022. Providing dementia education with augmented reality: a health sciences and medicine feasibility pilot study. Research in Learning Technology 30 (May 2022). https://doi.org/10.25304/rlt.v30.2668",
      "doi": ""
    },
    {
      "text": "Linda Helena Jütten, Ruth Elaine Mark, Ben Wilhelmus Maria Janssen, Jan Rietsema, Rose-Marie Dröes, and Margriet Maria Sitskoorn. 2017. Testing the effectivity of the mixed virtual reality training into d’mentia for informal caregivers of people with dementia: Protocol for a longitudinal, quasi-experimental study. BMJ Open 7, 8 (2017). https://doi.org/10.1136/bmjopen-2016-015702",
      "doi": ""
    },
    {
      "text": "Simeon Keates and Peter Olaf Looms. 2014. The role of simulation in designing for Universal Access. Universal Access in Human-Computer Interaction. Design and Development Methods for Universal Access(2014), 54–63. https://doi.org/10.1007/978-3-319-07437-5_6",
      "doi": ""
    },
    {
      "text": "Lori I. Kidd, Samantha J. Knisley, and Karyn I. Morgan. 2012. Effectiveness of a Second Life® Simulation as a Teaching Strategy for Undergraduate Mental Health Nursing Students. Journal of Psychosocial Nursing and Mental Health Services 50, 7(2012), 28–37. https://doi.org/10.3928/02793695-20120605-04",
      "doi": ""
    },
    {
      "text": "Gary Kiger. 1992. Disability Simulations: logical methodological and ethical issues. Disability, Handicap & Society 7, 1 (Mar 1992), 71–78. https://doi.org/10.1080/02674649266780061",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. Supporting People with Dementia in Digital Social Sharing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 2149–2162. https://doi.org/10.1145/3025453.3025586",
      "doi": "10.1145/3025453.3025586"
    },
    {
      "text": "Goo Joo Lee, Heui Je Bang, Kyoung Moo Lee, Hyun Ho Kong, Hyeun Suk Seo, Minwoo Oh, and Miyeon Bang. 2018. A comparison of the effects between 2 computerized cognitive training programs, Bettercog and COMCOG, on elderly patients with MCI and mild dementia. Medicine 97, 45 (2018). https://doi.org/10.1097/md.0000000000013007",
      "doi": ""
    },
    {
      "text": "Shaun Wen Lee and Pei-Lee Teh. 2020. “suiting up” to enhance empathy toward aging: A randomized controlled study. Frontiers in Public Health 8 (2020). https://doi.org/10.3389/fpubh.2020.00376",
      "doi": ""
    },
    {
      "text": "Jennifer Leo and Donna Goodwin. 2014. Negotiated Meanings of Disability Simulations in an Adapted Physical Activity Course: Learning From Student Reflections. Adapted Physical Activity Quarterly 31, 2 (Apr 2014), 144–161.",
      "doi": ""
    },
    {
      "text": "Connie Lethin, Lottie Giertz, Emme-Li Vingare, and Ingalill Rahm Hallberg. 2018. Dementia care and service systems – a mapping system tested in nine Swedish municipalities. BMC Health Services Research 18, 1 (Oct 2018). https://doi.org/10.1186/s12913-018-3592-x",
      "doi": ""
    },
    {
      "text": "Frank R. Lin, E. Jeffrey Metter, Richard J. O’Brien, Susan M. Resnick, Alan B. Zonderman, and Luigi Ferrucci. 2011. Hearing Loss and Incident Dementia. Archives of Neurology 68, 2 (Feb 2011), 214–220. https://doi.org/10.1001/archneurol.2010.362",
      "doi": ""
    },
    {
      "text": "Rianne M. Linde, Tom Dening, Fiona E. Matthews, and Carol Brayne. 2013. Grouping of behavioural and psychological symptoms of dementia. International Journal of Geriatric Psychiatry 29, 6(2013), 562–568. https://doi.org/10.1002/gps.4037",
      "doi": ""
    },
    {
      "text": "Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. In Proceedings of the SIGCHI conference on Human factors in computing systems. 521–530.",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Gill Livingston, Jonathan Huntley, Andrew Sommerlad, David Ames, Clive Ballard, Sube Banerjee, Carol Brayne, Alistair Burns, Jiska Cohen-Mansfield, Claudia Cooper, and et al.2020. Dementia prevention, intervention, and care: 2020 report of The Lancet Commission. The Lancet 396, 10248 (2020), 413–446. https://doi.org/10.1016/s0140-6736(20)30367-6",
      "doi": ""
    },
    {
      "text": "Francesca Luconi. 2008. Exploring rural family physicians’ learning from a web-based continuing medical education program on alzheimer’s disease: A pilot study. Ph. D. Dissertation. Department of Educational and Counselling Psychology.",
      "doi": ""
    },
    {
      "text": "Alicia López-de Eguileta, Carmen Lage, Sara López-García, Ana Pozueta, María García-Martínez, Martha Kazimierczak, María Bravo, María de Arcocha-Torres, Ignacio Banzo, Julio Jimenez-Bonilla, Andrea Cerveró, Eloy Rodríguez-Rodríguez, Pascual Sánchez-Juan, and Alfonso Casado. 2019. Ganglion cell layer thinning in prodromal Alzheimer’s disease defined by amyloid PET. Alzheimer’s & Dementia: Translational Research & Clinical Interventions 5 (Oct 2019), 570–578. https://doi.org/10.1016/j.trci.2019.08.008",
      "doi": ""
    },
    {
      "text": "Moira Maguire and Brid Delahunt. 2017. Doing a thematic analysis: A practical, step-by-step guide for learning and teaching scholars.All Ireland Journal of Higher Education 9, 33 (Oct 2017). https://ojs.aishe.org/index.php/aishe-j/article/view/335",
      "doi": ""
    },
    {
      "text": "Rod A. Martin, Glen E. Berry, Tobi Dobranski, Marilyn Horne, and Philip G. Dodgson. 1996. Emotion Perception Threshold: Individual Differences in Emotional Sensitivity. Journal of Research in Personality 30, 2 (Jun 1996), 290–305. https://doi.org/10.1006/jrpe.1996.0019",
      "doi": ""
    },
    {
      "text": "Jiří Masopust, Dita Protopopová, Martin Vališ, Zbyšek Pavelek, and Blanka Klímová. 2018. Treatment of behavioral and psychological symptoms of dementias with psychopharmaceuticals: A Review. Neuropsychiatric Disease and Treatment Volume 14 (2018), 1211–1220. https://doi.org/10.2147/ndt.s163842",
      "doi": ""
    },
    {
      "text": "W Mittenberg. 1994. Impaired depth perception discriminates Alzheimer’s dementia from aging and major depression. Archives of Clinical Neuropsychology 9, 1 (1994), 71–79. https://doi.org/10.1016/0887-6177(94)90015-9",
      "doi": ""
    },
    {
      "text": "Wendy Moyle. 2019. The promise of technology in the future of Dementia Care. Nature Reviews Neurology 15, 6 (2019), 353–359. https://doi.org/10.1038/s41582-019-0188-y",
      "doi": ""
    },
    {
      "text": "Wendy Moyle, Cindy Jones, Marie Cooke, Siobhan O’Dwyer, Billy Sung, and Suzie Drummond. 2014. Connecting the person with dementia and family: A feasibility study of a telepresence robot. BMC Geriatrics 14, 1 (2014). https://doi.org/10.1186/1471-2318-14-7",
      "doi": ""
    },
    {
      "text": "Kevin Muirhead, Leah Macaden, Keith Smyth, Colin Chandler, Charlotte Clarke, Rob Polson, and Chris O’Malley. 2022. The characteristics of effective technology-enabled Dementia Education: A systematic review and mixed research synthesis. Systematic Reviews 11, 1 (2022). https://doi.org/10.1186/s13643-021-01866-4",
      "doi": ""
    },
    {
      "text": "Michelle R. Nario-Redmond, Dobromir Gospodinov, and Angela Cobb. 2017. Crip for a day: The unintended negative consequences of disability simulations. Rehabilitation Psychology 62, 3 (Aug 2017), 324–333. https://doi.org/10.1037/rep0000127",
      "doi": ""
    },
    {
      "text": "Emma Nichols, Jaimie D Steinmetz, Stein Emil Vollset, Kai Fukutaki, Julian Chalek, Foad Abd-Allah, Amir Abdoli, Ahmed Abualhasan, Eman Abu-Gharbieh, Tayyaba Tayyaba Akram, and et al.2022. Estimation of the global prevalence of dementia in 2019 and forecasted prevalence in 2050: An analysis for the global burden of disease study 2019. The Lancet Public Health 7, 2 (2022). https://doi.org/10.1016/s2468-2667(21)00249-8",
      "doi": ""
    },
    {
      "text": "F. Nourhashémi, S. Andrieu, N. Sastres, J. L. Ducassé, D. Lauque, A. J. Sinclair, J. L. Albaréde, and B. J. Vellas. 2001. Descriptive Analysis of Emergency Hospital admissions of patients with alzheimer disease. Alzheimer Disease and Associated Disorders 15, 1 (2001), 21–25. https://doi.org/10.1097/00002093-200101000-00003",
      "doi": ""
    },
    {
      "text": "Vistolina Nuuyoma. 2017. The group-based assessment approach in Nursing Education: The perspective of nursing students on group-based ssessment process at a Namibian University. International Journal of Higher Education 6, 3 (2017), 91. https://doi.org/10.5430/ijhe.v6n3p91",
      "doi": ""
    },
    {
      "text": "Yukihiro Ohno, Naofumi Kunisawa, and Saki Shimizu. 2019. Antipsychotic treatment of behavioral and psychological symptoms of dementia (BPSD): Management of Extrapyramidal Side effects. Frontiers in Pharmacology 10 (2019). https://doi.org/10.3389/fphar.2019.01045",
      "doi": ""
    },
    {
      "text": "Yoshitaka Ouchi, Kenichi Meguro, Kyoko Akanuma, Yuriko Kato, and Satoshi Yamaguchi. 2015. Normal hearing ability but impaired auditory selective attention associated with prediction of response to Donepezil in patients with alzheimer’s disease. Behavioural Neurology 2015 (2015), 1–6. https://doi.org/10.1155/2015/540348",
      "doi": ""
    },
    {
      "text": "Cecilia M. Patino, Roberta McKean-Cowdin, Stanley P. Azen, Jessica Chung Allison, Farzana Choudhury, and Rohit Varma. 2010. Central and Peripheral Visual Impairment and the Risk of Falls and Falls with Injury. Ophthalmology 117, 2 (2010). https://doi.org/10.1016/j.ophtha.2009.06.063",
      "doi": ""
    },
    {
      "text": "Charles A. Poynton. 2007. Digital Video and HDTV: Algorithms and interfaces. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Mohammad Rababa and Dina Masha’al. 2020. Using branching path simulations in critical thinking of pain management among nursing students: Experimental study. Nurse Education Today 86(2020), 104323. https://doi.org/10.1016/j.nedt.2019.104323",
      "doi": ""
    },
    {
      "text": "R. Raja and P. C. Nagasubramani. 2018. Impact of modern technology in Education. Journal of Applied and Advanced Research(2018). https://doi.org/10.21839/jaar.2018.v3is1.165",
      "doi": ""
    },
    {
      "text": "Jill Rasmussen and Haya Langerman. 2019. Alzheimer’s Disease – Why We Need Early Diagnosis. Degenerative Neurological and Neuromuscular Disease Volume 9 (Dec 2019), 123–130. https://doi.org/10.2147/dnnd.s228939",
      "doi": ""
    },
    {
      "text": "Andrew Robinson, Claire Eccleston, Michael Annear, Kate-Ellen Elliott, Sharon Andrews, Christine Stirling, Michael Ashby, Catherine Donohue, Susan Banks, Christine Toye, and et al.2014. Who knows, who cares? dementia knowledge among nurses, care workers, and family members of people living with dementia. Journal of Palliative Care 30, 3 (2014), 158–165. https://doi.org/10.1177/082585971403000305",
      "doi": ""
    },
    {
      "text": "R. Rosdinom, M.Z.N. Zarina, M.S. Zanariah, M. Marhani, and W. Suzaily. 2013. Behavioural and psychological symptoms of dementia, cognitive impairment and caregiver burden in patients with dementia. Preventive Medicine 57(2013). https://doi.org/10.1016/j.ypmed.2012.12.025",
      "doi": ""
    },
    {
      "text": "Reiko Sakashita. 2018. Features of women’s leadership and nursing in Japanese culture. Asian/Pacific Island Nursing Journal 3, 2 (2018), 50–55. https://doi.org/10.31372/20180302.1081",
      "doi": ""
    },
    {
      "text": "Mariko Sakka, Jun Goto, Sachiko Kita, Iori Sato, Takafumi Soejima, and Kiyoko Kamibeppu. 2018. Associations among behavioral and psychological symptoms of dementia, care burden, and family‐to‐work conflict of employed family caregivers. Geriatrics & Gerontology International(2018). https://doi.org/10.1111/ggi.13556",
      "doi": ""
    },
    {
      "text": "Elena Salobrar-García, Rosa de Hoz, Ana I. Ramírez, Inés López-Cuenca, Pilar Rojas, Ravi Vazirani, Carla Amarante, Raquel Yubero, Pedro Gil, María D. Pinazo-Durán, Juan J. Salazar, and José M. Ramírez. 2019. Changes in visual function and retinal structure in the progression of Alzheimer’s disease. PLoS ONE 14, 8 (Aug 2019), e0220535. https://doi.org/10.1371/journal.pone.0220535",
      "doi": ""
    },
    {
      "text": "Cláudia Y. Santos, Lenworth N. Johnson, Stuart E. Sinoff, Elena K. Festa, William C. Heindel, and Peter J. Snyder. 2018. Change in retinal structural anatomy during the preclinical stage of alzheimer’s disease. Alzheimer’s & Dementia: Diagnosis, Assessment & Disease Monitoring 10, 1(2018), 196–209. https://doi.org/10.1016/j.dadm.2018.01.003",
      "doi": ""
    },
    {
      "text": "Cara Sass, Natasha Burnley, Michelle Drury, Jan Oyebode, and Claire Surr. 2019. Factors associated with successful dementia education for practitioners in primary care: An in-depth case study. BMC Medical Education 19, 1 (2019). https://doi.org/10.1186/s12909-019-1833-2",
      "doi": ""
    },
    {
      "text": "Shosuke Satake. 2018. Kihon checklist and frailty. Nippon Ronen Igakkai Zasshi. Japanese Journal of Geriatrics 55, 3(2018), 319–328. https://doi.org/10.3143/geriatrics.55.319",
      "doi": ""
    },
    {
      "text": "Raphael Schlembach and Nicola Clewer. 2021. ‘Forced empathy’: Manipulation, trauma and affect in virtual reality film. International Journal of Cultural Studies 24, 5 (Sep 2021), 827–843. https://doi.org/10.1177/13678779211007863",
      "doi": ""
    },
    {
      "text": "Sascha G Schmidt, Martin N Dichter, Rebecca Palm, and Hans Martin Hasselhorn. 2012. Distress experienced by nurses in response to the challenging behaviour of residents - evidence from German nursing homes. Journal of Clinical Nursing 21, 21-22 (2012), 3134–3142. https://doi.org/10.1111/jocn.12066",
      "doi": ""
    },
    {
      "text": "Michael Schwenk, Klaus Hauer, Tania Zieschang, Stefan Englert, Jane Mohler, and Bijan Najafi. 2014. Sensor-derived physical activity parameters can predict future falls in people with dementia. Gerontology 60, 6 (2014), 483–492. https://doi.org/10.1159/000363136",
      "doi": ""
    },
    {
      "text": "Michael A. Seropian, Kimberly Brown, Jesika Samuelson Gavilanes, and Bonnie Driggers. 2004. An approach to simulation program development. Journal of Nursing Education 43, 4 (2004), 170–174. https://doi.org/10.3928/01484834-20040401-02",
      "doi": ""
    },
    {
      "text": "Xianwen Shang, Zhuoting Zhu, Yu Huang, Xueli Zhang, Wei Wang, Danli Shi, Yu Jiang, Xiaohong Yang, and Mingguang He. 2021. Associations of ophthalmic and systemic conditions with incident dementia in the UK Biobank. The British Journal of Ophthalmology (Sep 2021), bjophthalmol–2021–319508. https://doi.org/10.1136/bjophthalmol-2021-319508",
      "doi": ""
    },
    {
      "text": "Lijiang Shen. 2010. On a scale of state empathy during message processing. Western Journal of Communication 74, 5 (2010), 504–524. https://doi.org/10.1080/10570314.2010.512278",
      "doi": ""
    },
    {
      "text": "Mel Slater, Cristina Gonzalez-Liencres, Patrick Haggard, Charlotte Vinkers, Rebecca Gregory-Clarke, Steve Jelley, Zillah Watson, Graham Breen, Raz Schwarz, William Steptoe, Dalila Szostak, Shivashankar Halan, Deborah Fox, and Jeremy Silver. 2020. The Ethics of Realism in Virtual and Augmented Reality. Frontiers in Virtual Reality 1 (2020). https://www.frontiersin.org/articles/10.3389/frvir.2020.00001",
      "doi": ""
    },
    {
      "text": "Mel Slater, Pankaj Khanna, Jesper Mortensen, and Insu Yu. 2009. Visual Realism Enhances Realistic Response in an Immersive Virtual Environment. IEEE Computer Graphics and Applications 29, 3 (May 2009), 76–84. https://doi.org/10.1109/MCG.2009.55",
      "doi": ""
    },
    {
      "text": "Peter J. Smith. 2003. Workplace Learning and Flexible Delivery. Review of Educational Research 73, 1 (2003), 53–88. https://doi.org/10.3102/00346543073001053",
      "doi": ""
    },
    {
      "text": "Elizabeth Stowell, Yixuan Zhang, Carmen Castaneda-Sceppa, Margie Lachman, and Andrea G. Parker. 2019. Caring for Alzheimer’s Disease Caregivers: A Qualitative Study Investigating Opportunities for Exergame Innovation. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 130:1–130:27. https://doi.org/10.1145/3359232",
      "doi": "10.1145/3359232"
    },
    {
      "text": "Claire A. Surr, Cara Gates, Donna Irving, Jan Oyebode, Sarah Jane Smith, Sahdia Parveen, Michelle Drury, and Alison Dennison. 2017. Effective dementia education and training for the Health and Social Care Workforce: A systematic review of the literature. Review of Educational Research 87, 5 (2017), 966–1002. https://doi.org/10.3102/0034654317723305",
      "doi": ""
    },
    {
      "text": "Yukiko Suzuki, Hiroaki Kazui, Kenji Yoshiyama, Shingo Azuma, Hideki Kanemoto, Shunsuke Sato, Takashi Suehiro, and Manabu Ikeda. 2018. Advantages of different care services for reducing neuropsychiatric symptoms in dementia patients. Psychogeriatrics 18, 4 (2018), 252–258. https://doi.org/10.1111/psyg.12317",
      "doi": ""
    },
    {
      "text": "Dag Svanaes and Gry Seland. 2004. Putting the users center stage: role playing and low-fi prototyping enable end users to design mobile systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’04). Association for Computing Machinery, New York, NY, USA, 479–486. https://doi.org/10.1145/985692.985753",
      "doi": "10.1145/985692.985753"
    },
    {
      "text": "Zaldy S. Tan, Lee Jennings, and David Reuben. 2014. Coordinated Care Management For Dementia In A Large Academic Health System. Health Affairs 33, 4 (Apr 2014), 619–625. https://doi.org/10.1377/hlthaff.2013.1294",
      "doi": ""
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, and Luc Geurts. 2022. Virtual feed: Design and evaluation of a virtual reality simulation addressing the lived experience of breastfeeding. CHI Conference on Human Factors in Computing Systems (2022). https://doi.org/10.1145/3491102.3517620",
      "doi": "10.1145/3491102.3517620"
    },
    {
      "text": "Myrte Thoolen, Francesca Toso, Sebastiaan T.M. Peek, Yuan Lu, and Rens Brankaert. 2022. LivingMoments: Bespoke Social Communication for People living with Dementia and their Relatives. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3491102.3517430",
      "doi": "10.1145/3491102.3517430"
    },
    {
      "text": "Olivier Pierre Tible, Florian Riese, Egemen Savaskan, and Armin von Gunten. 2017. Best practice in the management of behavioural and psychological symptoms of dementia. Therapeutic Advances in Neurological Disorders 10, 8 (2017), 297–309. https://doi.org/10.1177/1756285617712979",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell. 2021. Nuanced Perspectives Toward Disability Simulations from Digital Designers, Blind, Low Vision, and Color Blind People. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3411764.3445620",
      "doi": "10.1145/3411764.3445620"
    },
    {
      "text": "Suzanne Timmons, Emma O’Shea, Desmond O’Neill, Paul Gallagher, Anna de Siún, Denise McArdle, Patricia Gibbons, and Sean Kennelly. 2016. Acute Hospital Dementia Care: Results from a national audit. BMC Geriatrics 16, 1 (2016). https://doi.org/10.1186/s12877-016-0293-3",
      "doi": ""
    },
    {
      "text": "Alison Warren. 2022. Behavioral and psychological symptoms of dementia as a means of communication: Considerations for reducing stigma and promoting person-centered care. Frontiers in Psychology 13 (2022). https://doi.org/10.3389/fpsyg.2022.875246",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Ryan M. Kelly, Steven Baker, Barbara Barbosa Neves, Kong Saoane Thach, and Reeva Lederman. 2022. The Role of Staff in Facilitating Immersive Virtual Reality for Enrichment in Aged Care: An Ethic of Care Perspective. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3491102.3501956",
      "doi": "10.1145/3491102.3501956"
    },
    {
      "text": "Eva M. Wijma, Marjolein A. Veerbeek, Marleen Prins, Anne Margriet Pot, and Bernadette M. Willemse. 2017. A virtual reality intervention to improve the understanding and empathy for people with dementia in informal caregivers: Results of a pilot study. Aging & Mental Health 22, 9 (2017), 1121–1129. https://doi.org/10.1080/13607863.2017.1348470",
      "doi": ""
    },
    {
      "text": "Dennis Wolf, Daniel Besserer, Karolina Sejunaite, Matthias Riepe, and Enrico Rukzio. 2018. cARe: An Augmented Reality Support System for Dementia Patients. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings. ACM, Berlin Germany, 42–44. https://doi.org/10.1145/3266037.3266095",
      "doi": "10.1145/3266037.3266095"
    },
    {
      "text": "Dieter Wolke, Andrea Waylen, Muthanna Samara, Colin Steer, Robert Goodman, Tamsin Ford, and Koen Lamberts. 2009. Selective drop-out in longitudinal studies and non-biased prediction of behaviour disorders. The British Journal of Psychiatry 195, 3 (Sep 2009), 249–256. https://doi.org/10.1192/bjp.bp.108.053751",
      "doi": ""
    },
    {
      "text": "Hyeon Jeong Yoon, Hyun Sik Moon, Mi Sun Sung, Sang Woo Park, and Hwan Heo. 2021. Effects of prolonged use of virtual reality smartphone-based head-mounted display on visual parameters: a randomised controlled trial. Scientific Reports 11, 11 (Jul 2021), 15382. https://doi.org/10.1038/s41598-021-94680-w",
      "doi": ""
    },
    {
      "text": "Insu Yu, Jesper Mortensen, Pankaj Khanna, Bernhard Spanlang, and Mel Slater. 2012. Visual Realism Enhances Realistic Response in an Immersive Virtual Environment - Part 2. IEEE Computer Graphics and Applications 32, 6 (Nov 2012), 36–45. https://doi.org/10.1109/MCG.2012.121",
      "doi": "10.1109/MCG.2012.121"
    }
  ]
}