{
  "doi": "10.1145/3544548.3580667",
  "title": "Family Negotiation in Joint Media Engagement with Creative Computing",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "HCI researchers have been investigating family dynamics with new and emerging technologies during joint media engagement (JME) experiences. However, most studies describe family dynamics from parents’ perspectives, such as their roles and mediation practices, while the roles and agency of other family members are less understood. In this paper, we examine family dynamics through the lens of negotiation between family members. Our study is located within an informal learning program called Family Creative Learning, where families from non-dominant groups were invited to participate in a series of workshops to create with a programming app called ScratchJr. Through analysis of data that included process, artifact, and reflective data, we identify negotiation practices of family members as they advocate for device and creative control. We further discuss how the lens of negotiation expands the meaning of productive JME in family contexts and highlight design considerations to facilitate engaging joint family experiences with educational technologies.",
  "tags": [
    "negotiation",
    "joint media engagement",
    "family",
    "creative making"
  ],
  "authors": [
    {
      "name": "Junnan Yu",
      "institution": "School of Design, The Hong Kong Polytechnic University, China",
      "img": "/do/10.1145/contrib-99659276681/rel-imgonly/cute_kittens-wide.jpg",
      "acmid": "99659276681",
      "orcid": "0000-0002-0869-0304"
    },
    {
      "name": "Sari Widman",
      "institution": "School of Education, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659122316",
      "orcid": "0000-0002-2883-6024"
    },
    {
      "name": "Ricarose Roque",
      "institution": "Department of Information Science, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502704620",
      "orcid": "0000-0003-3100-2466"
    }
  ],
  "references": [
    {
      "text": "Sanne F. Akkerman and Arthur Bakker. 2011. Boundary Crossing and Boundary Objects. Review of Educational Research 81 (6 2011), 132–169. Issue 2. https://doi.org/10.3102/0034654311404435",
      "doi": ""
    },
    {
      "text": "Rafael Ballagas, Thérèse E. Dugan, Glenda Revelle, Kochi Mori, Maria Sandberg, Janet Go, Emily Reardon, and Mirjana Spasojevic. 2013. Electric agents: Fostering sibling joint media engagement through interactive television and augmented reality. CSCW ’13: Proceedings of the 2013 conference on Computer supported cooperative work, 225–235. https://doi.org/10.1145/2441776.2441803",
      "doi": "10.1145/2441776.2441803"
    },
    {
      "text": "Rahul Banerjee, Leanne Liu, Kiley Sobel, Caroline Pitt, Kung Jin Lee, Meng Wang, Sijin Chen, Lydia Davison, Jason C. Yip, Andrew J. Ko, and Zoran Popović. 2018. Empowering families facing English literacy challenges to jointly engage in computer programming. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18) 2018-April, 1–13. https://doi.org/10.1145/3173574.3174196",
      "doi": "10.1145/3173574.3174196"
    },
    {
      "text": "Megan Bang, Ananda Marin, Lori Faber, and Eli S Suzukovich III. 2013. Repatriating indigenous technologies in an urban Indian community. Urban Education 48, 5 (2013), 705–733.",
      "doi": ""
    },
    {
      "text": "Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as Learning Partners in the Development of Technological Fluency. International Journal of Learning and Media 1 (2009), 55–77. Issue 2. https://doi.org/10.1162/ijlm.2009.0021",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Olivia K Richards, Mingrui Zhang, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication Breakdowns Between Families and Alexa. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3290605.3300473",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Samantha Worzalla Bindman, Kiley Sobel, Sara M Behbakht, Riddhi A Divanji, Ella Shahn, and Mike Scanlon. 2021. “Let’s Draw Chocolate Milk Together”: Supports and Challenges for Families’ Joint Engagement with Artistic Tablet Apps. Interaction Design and Children, 183–195. https://doi.org/10.1145/3459990.3460693",
      "doi": "10.1145/3459990.3460693"
    },
    {
      "text": "Jamika D Burge and Deborah Tatar. 2009. Affect and dyads: Conflict across different technological media. In Media space 20+ years of mediated life. Springer, 123–144.",
      "doi": ""
    },
    {
      "text": "Yi Cheng, Kate Yen, Yeqi Chen, Sijin Chen, and Alexis Hiniker. 2018. Why Doesn’t It Work? Voice-Driven Interfaces and Young Children’s Communication Repair Strategies. Proceedings of the 17th ACM Conference on Interaction Design and Children, 337–348. https://doi.org/10.1145/3202185.3202749",
      "doi": "10.1145/3202185.3202749"
    },
    {
      "text": "Drew Cingel and Anne Marie Piper. 2017. How Parents Engage Children in Tablet-Based Reading Experiences: An Exploration of Haptic Feedback. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, 505–510. https://doi.org/10.1145/2998181.2998240",
      "doi": "10.1145/2998181.2998240"
    },
    {
      "text": "Lynn Schofield Clark. 2011. Parental Mediation Theory for the Digital Age. Communication Theory 21(2011), 323–343. Issue 4. https://doi.org/10.1111/j.1468-2885.2011.01391.x",
      "doi": ""
    },
    {
      "text": "Tobias Drey, Patrick Albus, Simon der Kinderen, Maximilian Milo, Thilo Segschneider, Linda Chanzab, Michael Rietzler, Tina Seufert, and Enrico Rukzio. 2022. Towards Collaborative Learning in Virtual Reality: A Comparison of Co-Located Symmetric and Asymmetric Pair-Learning. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 610, 19 pages. https://doi.org/10.1145/3491102.3517641",
      "doi": "10.1145/3491102.3517641"
    },
    {
      "text": "Stefania Druga, Fee Lia Christoph, and Amy J Ko. 2022. Family as a Third Space for AI Literacies: How Do Children and Parents Learn about AI Together?CHI Conference on Human Factors in Computing Systems (CHI ’22), 1–17. https://doi.org/10.1145/3491102.3502031",
      "doi": "10.1145/3491102.3502031"
    },
    {
      "text": "Abigail Durrant, David Frohlich, Abigail Sellen, and Evanthia Lyons. 2009. Home curation versus teenage photography: Photo displays in the family home. International Journal of Human-Computer Studies 67, 12 (2009), 1005–1023.",
      "doi": "10.1016/j.ijhcs.2009.09.005"
    },
    {
      "text": "Matthew S Eastin, Bradley S Greenberg, and Linda Hofschire. 2006. Parenting the Internet. Journal of Communication 56 (2006), 486–504. Issue 3. https://doi.org/10.1111/j.1460-2466.2006.00297.x",
      "doi": ""
    },
    {
      "text": "Carrie A. Ewin, Andrea E. Reupert, Louise A. McLean, and Christopher J. Ewin. 2021. The impact of joint media engagement on parent–child interactions: A systematic review. Human Behavior and Emerging Technologies 3 (2021), 230–254. Issue 2. https://doi.org/10.1002/hbe2.203",
      "doi": ""
    },
    {
      "text": "Hasan Shahid Ferdous, Frank Vetere, Hilary Davis, Bernd Ploderer, Kenton O’Hara, Rob Comber, and Geremy Farr-Wharton. 2017. Celebratory Technology to Orchestrate the Sharing of Devices and Stories during Family Mealtimes. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6960–6972. https://doi.org/10.1145/3025453.3025492",
      "doi": "10.1145/3025453.3025492"
    },
    {
      "text": "Louise P. Flannery, Brian Silverman, Elizabeth R. Kazakoff, Marina Umaschi Bers, Paula Bontá, and Mitchel Resnick. 2013. Designing ScratchJr: Support for Early Childhood Learning through Computer Programming. In Proceedings of the 12th International Conference on Interaction Design and Children (New York, New York, USA) (IDC ’13). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2485760.2485785",
      "doi": "10.1145/2485760.2485785"
    },
    {
      "text": "Geneva Gay. 2018. Culturally responsive teaching: Theory, research, and practice. teachers college press.",
      "doi": ""
    },
    {
      "text": "Yiannis Georgiou and Andri Ioannou. 2019. Embodied learning in a digital world: A systematic review of empirical research in K-12 education. Learning in a digital world(2019), 155–177.",
      "doi": ""
    },
    {
      "text": "Janet Go, Rafael Ballagas, and Mirjana Spasojevic. 2012. Brothers and Sisters at Play: Exploring Game Play with Siblings. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, 739–748. https://doi.org/10.1145/2145204.2145316",
      "doi": "10.1145/2145204.2145316"
    },
    {
      "text": "Kris D Gutiérrez and Barbara Rogoff. 2003. Cultural ways of learning: Individual traits or repertoires of practice. Educational researcher 32, 5 (2003), 19–25.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Bongshin Lee, Julie A Kientz, and Jenny S Radesky. 2018. Let’s Play! Digital and Analog Play Patterns between Preschoolers and Parents. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3173574.3174233",
      "doi": "10.1145/3173574.3174233"
    },
    {
      "text": "Helen H. Hu and Clif Kussmaul. 2021. Improving Online Collaborative Learning with POGIL Practices. In Proceedings of the 52nd ACM Technical Symposium on Computer Science Education (Virtual Event, USA) (SIGCSE ’21). Association for Computing Machinery, New York, NY, USA, 1330. https://doi.org/10.1145/3408877.3439600",
      "doi": "10.1145/3408877.3439600"
    },
    {
      "text": "Tim Ingold. 2009. The textility of making. Cambridge Journal of Economics 34 (2009), 91–102. Issue 1. https://doi.org/10.1093/cje/bep042",
      "doi": ""
    },
    {
      "text": "Heisawn Jeong, Cindy E Hmelo-Silver, and Kihyun Jo. 2019. Ten years of computer-supported collaborative learning: A meta-analysis of CSCL in STEM education during 2005–2014. Educational research review 28 (2019), 100284.",
      "doi": ""
    },
    {
      "text": "Hee Jhee Jiow, Sun Sun Lim, and Julian Lin. 2017. Level Up! Refreshing Parental Mediation Theory for Our Digital Media Landscape. Communication Theory 27(2017), 309–328. Issue 3. https://doi.org/10.1111/comt.12109",
      "doi": ""
    },
    {
      "text": "David W Johnson and Roger T Johnson. 2009. An educational psychology success story: Social interdependence theory and cooperative learning. Educational researcher 38, 5 (2009), 365–379.",
      "doi": ""
    },
    {
      "text": "Vikki S. Katz and Carmen Gonzalez. 2016. Community Variations in Low-Income Latino Families’ Technology Adoption and Integration. American Behavioral Scientist 60, 1 (2016), 59–80.",
      "doi": ""
    },
    {
      "text": "Vikki S. Katz, Meghan B. Moran, and Carmen Gonzalez. 2018. Connecting with technology in lower-income US families. New Media and Society 20(2018), 2509–2533. Issue 7. https://doi.org/10.1177/1461444817726319",
      "doi": ""
    },
    {
      "text": "Saba Kawas, Nicole S. Kuhn, Kyle Sorstokke, Emily Bascom, Alexis Hiniker, and Katie Davis. 2021. When Screen Time Isn’t Screen Time: Tensions and Needs Between Tweens and Their Parents During Nature-Based Exploration. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3411764.3445142",
      "doi": "10.1145/3411764.3445142"
    },
    {
      "text": "Danielle Teodora Keifert. 2021. Family culture as context for learning through inquiry. Cognition and instruction 39, 3 (2021), 242–274.",
      "doi": ""
    },
    {
      "text": "Ingo Kollar, Frank Fischer, and Friedrich W Hesse. 2006. Collaboration scripts–a conceptual analysis. Educational Psychology Review 18, 2 (2006), 159–185.",
      "doi": ""
    },
    {
      "text": "J P Lantolf. 2000. Introducing sociocultural theory. Sociocultural theory and second language learning (2000), 1–26.",
      "doi": ""
    },
    {
      "text": "James P. Lantolf and Matthew E. Poehner. 2012. Sociocultural Theory. The Encyclopedia of Applied Linguistics(2012), 1–10. https://doi.org/10.1002/9781405198431.wbeal1084",
      "doi": ""
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press. 138 pages.",
      "doi": ""
    },
    {
      "text": "Amber Maria Levinson and Brigid Barron. 2018. Latino immigrant families learning with digital media across settings and generations. Digital Education Review33 (2018), 150–169.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone and Ellen J. Helsper. 2008. Parental mediation of children’s internet use. Journal of Broadcasting and Electronic Media 52 (2008), 581–599. Issue 4. https://doi.org/10.1080/08838150802437396",
      "doi": ""
    },
    {
      "text": "Jesse J Martinez, Travis W Windleharth, Qisheng Li, Arpita Bhattacharya, Katy E Pearce, Jason Yip, and Jin Ha Lee. 2022. Joint Media Engagement in Families Playing Animal Crossing: New Horizons during the COVID-19 Pandemic. Proc. ACM Hum.-Comput. Interact. 6 (4 2022). Issue CSCW1. https://doi.org/10.1145/3512947",
      "doi": "10.1145/3512947"
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3 (2019). Issue CSCW. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Edward F Melcer. 2018. Learning with the body: understanding the design space of embodied educational technology. Ph. D. Dissertation. New York University Tandon School of Engineering.",
      "doi": ""
    },
    {
      "text": "Diego Muñoz, Bernd Ploderer, and Margot Brereton. 2018. Towards Design for Renegotiating the Parent-Adult Child Relationship after Children Leave Home. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (Melbourne, Australia) (OzCHI ’18). Association for Computing Machinery, New York, NY, USA, 303–313. https://doi.org/10.1145/3292147.3292149",
      "doi": "10.1145/3292147.3292149"
    },
    {
      "text": "Diego Muñoz, Bernd Ploderer, and Margot Brereton. 2019. Position Exchange Workshops: A Method to Design for Each Other in Families. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300339",
      "doi": "10.1145/3290605.3300339"
    },
    {
      "text": "Geoff Musick, Guo Freeman, and Nathan J McNeese. 2021. Gaming as Family Time: Digital Game Co-Play in Modern Parent-Child Relationships. Proc. ACM Hum.-Comput. Interact. 5 (10 2021). Issue CHI PLAY. https://doi.org/10.1145/3474678",
      "doi": "10.1145/3474678"
    },
    {
      "text": "Na’ilah Suad Nasir and Victoria M. Hand. 2006. Exploring sociocultural perspectives on race, culture, and learning. Review of Educational Research 76 (2006), 449–475. Issue 4. https://doi.org/10.3102/00346543076004449",
      "doi": ""
    },
    {
      "text": "Carson Ohland, Hoda Ehsan, and Monica E. Cardella. 2019. Parental Influence on Children’s Computational Thinking in an Informal Setting (Fundamental Research). 2019 ASEE Annual Conference & Exposition, 1–14. https://doi.org/10.18260/1-2–33157",
      "doi": ""
    },
    {
      "text": "Seymour Papert. 1980. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, Inc. 244 pages.",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Django Paris. 2012. Culturally sustaining pedagogy: A needed change in stance, terminology, and practice. Educational researcher 41, 3 (2012), 93–97.",
      "doi": ""
    },
    {
      "text": "William R. Penuel. 2019. Infrastructuring as a Practice of Design-Based Research for Supporting and Studying Equitable Implementation and Sustainability of Innovations. Journal of the Learning Sciences 28 (10 2019), 659–677. Issue 4-5. https://doi.org/10.1080/10508406.2018.1552151",
      "doi": ""
    },
    {
      "text": "William R. Penuel, Anna Ruth Allen, Cynthia E. Coburn, and Caitlin Farrell. 2015. Conceptualizing Research–Practice Partnerships as Joint Work at Boundaries. Journal of Education for Students Placed at Risk (JESPAR) 20 (4 2015), 182–197. Issue 1-2. https://doi.org/10.1080/10824669.2014.988334",
      "doi": ""
    },
    {
      "text": "Amanda Phillips, Gillian Smith, Michael Cook, and Tanya Short. 2016. Feminism and procedural content generation: toward a collaborative politics of computational creativity. Digital Creativity 27, 1 (2016), 82–97.",
      "doi": ""
    },
    {
      "text": "Laura R. Pina, Carmen Gonzalez, Carolina Nieto, Wendy Roldan, Edgar Onofre, and Jason C. Yip. 2018. How Latino children in the U.S. engage in collaborative online information problem solving with their families. Proceedings of the ACM on Human-Computer Interaction 2 (2018). Issue CSCW. https://doi.org/10.1145/3274409",
      "doi": "10.1145/3274409"
    },
    {
      "text": "Naomi Polinsky, Brian Andrus, Michael Horn, and David Uttal. 2021. Symbolic Relations in Collaborative Coding: How Children and Parents Map Across Symbol Systems While Coding Robots. Interaction Design and Children, 294–304. https://doi.org/10.1145/3459990.3460713",
      "doi": "10.1145/3459990.3460713"
    },
    {
      "text": "Hayes Raffle, Glenda Revelle, Koichi Mori, Rafael Ballagas, Kyle Buza, Hiroshi Horii, Jofish Kaye, Kristin Cook, Natalie Freed, Janet Go, and Mirjana Spasojevic. 2011. Hello, is grandma there? Let’s read!: StoryVisit: Family video chat and connected e-books. CHI ’11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1195–1204. https://doi.org/10.1145/1978942.1979121",
      "doi": "10.1145/1978942.1979121"
    },
    {
      "text": "Emily Relkin, Madhu Govind, Jaclyn Tsiang, and Marina Bers. 2020. How Parents Support Children’s Informal Learning Experiences with Robots. Journal of Research in STEM Education 6 (2020), 39–51. Issue 1. https://doi.org/10.51355/jstem.2020.87",
      "doi": ""
    },
    {
      "text": "Heraldo V Richards, Ayanna F Brown, and Timothy B Forde. 2007. Addressing diversity in schools: Culturally responsive pedagogy. Teaching exceptional children 39, 3 (2007), 64–68.",
      "doi": ""
    },
    {
      "text": "Filipa Rocha, Ana Cristina Pires, Isabel Neto, Hugo Nicolau, and Tiago Guerreiro. 2021. Accembly at Home: Accessible Spatial Programming for Children with Visual Impairments and Their Families. Interaction Design and Children, 100–111. https://doi.org/10.1145/3459990.3460699",
      "doi": "10.1145/3459990.3460699"
    },
    {
      "text": "Barbara Rogoff. 1994. Developing Understanding of the Idea of Communities of Learners. Mind, Culture, and Activity 1 (9 1994), 209–229. Issue 4. https://doi.org/10.1080/10749039409524673",
      "doi": ""
    },
    {
      "text": "Ricarose Roque. 2016. Family creative learning. In Makeology. Routledge, 47–63.",
      "doi": ""
    },
    {
      "text": "Ricarose Roque. 2020. Building projects, building relationships: Designing for family learning. Designing Constructionist Futures: The Art, Theory, and Practice of Learning Designs (2020).",
      "doi": ""
    },
    {
      "text": "Ricarose Roque, Karina Lin, and Richard Liuzzi. 2016. \"I’m Not Just a Mom\": Parents Developing Multiple Roles in Creative Computing. 12th International Conference of the Learning Sciences, 663–671. Issue 2.",
      "doi": ""
    },
    {
      "text": "Ricarose Roque, Mariana Aki Tamashiro, Kathryn Mcconnell, and Julisa Granados. 2021. Opportunities and Limitations of Construction Kits in Culturally Responsive Computing Contexts: Lessons from ScratchJr and Family Creative Learning. Interaction Design and Children, 246–256. https://doi.org/10.1145/3459990.3460728",
      "doi": "10.1145/3459990.3460728"
    },
    {
      "text": "Wonsun Shin and Jisu Huh. 2011. Parental mediation of teenagers’ video game playing: Antecedents and consequences. New Media & Society 13(2011), 945–962. Issue 6.",
      "doi": ""
    },
    {
      "text": "Kiley Sobel, Arpita Bhattacharya, Alexis Hiniker, Jin Ha Lee, Julie A. Kiemtz, and Jason C. Yip. 2017. \"It wasn’t really about the Pokémon\": Parents’ Perspectives on a Location-Based Mobile Game. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 1483–1496. https://doi.org/10.1145/3025453.3025761",
      "doi": "10.1145/3025453.3025761"
    },
    {
      "text": "Kiley Sobel, Kate Yen, Yi Cheng, Yeqi Chen, and Alexis Hiniker. 2019. No touch pig! Investigating child-parent use of a system for training executive function. Proceedings of the 18th ACM International Conference on Interaction Design and Children, IDC 2019, 339–351. https://doi.org/10.1145/3311927.3323132",
      "doi": "10.1145/3311927.3323132"
    },
    {
      "text": "Lori Takeuchi and Reed Stevens. 2011. The New Coviewing: Designing for Learning through Joint-Media Engagement., 75 pages. https://www.joanganzcooneycenter.org/wp-content/uploads/2011/12/jgc_coviewing_desktop.pdf",
      "doi": ""
    },
    {
      "text": "Patti M Valkenburg, Marina Krcmar, Allerd L Peeters, and Nies M Marseille. 1999. Developing a scale to assess three styles of television mediation: “Instructive mediation,” “restrictive mediation,” and “social coviewing”. Journal of Broadcasting & Electronic Media 43 (1999), 52–66. Issue 1. https://doi.org/10.1080/08838159909364474",
      "doi": ""
    },
    {
      "text": "Thiemo Wambsganss, Tobias Kueng, Matthias Soellner, and Jan Marco Leimeister. 2021. ArgueTutor: An Adaptive Dialog-Based Learning System for Argumentation Skills. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 683, 13 pages. https://doi.org/10.1145/3411764.3445781",
      "doi": "10.1145/3411764.3445781"
    },
    {
      "text": "Shang Wang and Erin Walker. 2021. Providing Adaptive Feedback in Concept Mapping to Improve Reading Comprehension. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 677, 11 pages. https://doi.org/10.1145/3411764.3445554",
      "doi": "10.1145/3411764.3445554"
    },
    {
      "text": "Sari Widman, Ronni Hayden, Kristina Stamatis, and Ricarose Roque. 2022. Disruptions, dissent, and discontinuities: What tensions in intergenerational learning dynamics reveal about learning design. In International Collaboration toward Educational Innovation for All: Overarching Research, Development, and Practices (ICLS).",
      "doi": ""
    },
    {
      "text": "Margaret Wilson. 2002. Six views of embodied cognition. Psychonomic bulletin & review 9, 4 (2002), 625–636.",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Haiyan Jia, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. “Preventative” vs. “Reactive”: How Parental Mediation Influences Teens’ Social Media Privacy Behaviors. CSCW 2015 - Proceedings of the 2015 ACM International Conference on Computer-Supported Cooperative Work and Social Computing, 302–316. https://doi.org/10.1145/2675133.2675293",
      "doi": "10.1145/2675133.2675293"
    },
    {
      "text": "Marisol Wong-villacres, Neha Kumar, and Betsy Disalvo. 2019. The Parenting Actor-Network of Latino Immigrants in the United States. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). ACM, Glasgow, Scotland, UK, 1–12.",
      "doi": ""
    },
    {
      "text": "Sarita Yardi and Amy Bruckman. 2011. Social and technical challenges in parenting teens’ social media use. CHI ’11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3237–3246. https://doi.org/10.1145/1978942.1979422",
      "doi": "10.1145/1978942.1979422"
    },
    {
      "text": "Kate Yen, Alexis Hiniker, Yiran Ni, Yeqi Chen, Sijin Chen, Ying-Yu Chen, and Yi Cheng. 2018. Joint Media Engagement between Parents and Preschoolers in the U.S., China, and Taiwan. Proceedings of the ACM on Human-Computer Interaction - CSCW 2 (2018), 1–19. Issue CSCW. https://doi.org/10.1145/3274461",
      "doi": "10.1145/3274461"
    },
    {
      "text": "Samantha Yglesias, Deborah Tatar, Steve Harrison, and Joon Suk Lee. 2016. Balancing Behaviors: Design-Relevant Phenomena in Couples’ Argumentation via Different Media. In Emotions, Technology, and Behaviors. Elsevier, 123–142.",
      "doi": ""
    },
    {
      "text": "Junnan Yu, Chenke Bai, and Ricarose Roque. 2020. Considering Parents in Coding Kit Design: Understanding Parents’ Perspectives and Roles. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–14. https://doi.org/10.1145/3313831.3376130",
      "doi": "10.1145/3313831.3376130"
    },
    {
      "text": "Junnan Yu, Andrea DeVore, and Ricarose Roque. 2021. Parental Mediation for Young Children’s Use of Educational Media: A Case Study with Computational Toys and Kits. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–12. https://doi.org/10.1145/3411764.3445427",
      "doi": "10.1145/3411764.3445427"
    }
  ]
}