{
  "doi": "10.1145/3544548.3581151",
  "title": "“We Speak Visually”: User-Generated Icons for Better Video-Mediated Mixed-Group Communications Between Deaf and Hearing Participants",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Since the outbreak of the COVID-19 pandemic, videoconferencing technology has been widely adopted as a convenient, powerful, and fundamental tool that has simplified many day-to-day tasks. However, video communication is dependent on audible conversation and can be strenuous for those who are Hard of Hearing. Communication methods used by the Deaf and Hard of Hearing community differ significantly from those used by the hearing community, and a distinct language gap is evident in workspaces that accommodate workers from both groups. Therefore, we integrated users in both groups to explore ways to alleviate obstacles in mixed-group videoconferencing by implementing user-generated icons. A participatory design methodology was employed to investigate how the users overcome language differences. We observed that individuals utilized icons within video-mediated meetings as a universal language to reinforce comprehension. Herein, we present design implications from these findings, along with recommendations for future icon systems to enhance and support mixed-group conversations.",
  "tags": [
    "Deaf and Hard of hearing",
    "Accessibility",
    "Videoconferencing"
  ],
  "authors": [
    {
      "name": "Yeon Soo Kim",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660532856",
      "orcid": "0000-0002-8316-8954"
    },
    {
      "name": "Hyeonjeong Im",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701616",
      "orcid": "0000-0002-2233-7283"
    },
    {
      "name": "Sunok Lee",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367308",
      "orcid": "0000-0002-8518-7315"
    },
    {
      "name": "Haena Cho",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701933",
      "orcid": "0000-0002-7325-5472"
    },
    {
      "name": "Sangsu Lee",
      "institution": "Industrial Design, KAIST, Korea, Republic of",
      "img": "/do/10.1145/contrib-81416594796/rel-imgonly/profile.jpg",
      "acmid": "81416594796",
      "orcid": "0000-0002-3793-6801"
    }
  ],
  "references": [
    {
      "text": "Tousif S. Ahmed. 2017. Real Time American Sign Language Video Captioning using Deep Neural Networks. https://on-demand.gputechconf.com/gtc/2017/presentation/s7346-syed-ahmed-real-time-american-sign-language-video-caption.pdf",
      "doi": ""
    },
    {
      "text": "Ken Anderson. 2009. Ethnographic research: A key to strategy. Harvard business review 87, 3 (2009), 24.",
      "doi": ""
    },
    {
      "text": "Shirin D Antia, Darrell L Sabers, and Michael S Stinson. 2007. Validity and reliability of the classroom participation questionnaire with deaf and hard of hearing students in public schools. Journal of deaf studies and deaf education 12, 2 (2007), 158–171.",
      "doi": ""
    },
    {
      "text": "Ashley Ashley. 2022. The difference between co-design and participatory design. https://uxdesign.cc/difference-between-co-design-participatory-design-df4376666816#: :text=Participation%20allows%20for%20more%20input,the%20project%20goals%20and%20outcomes.",
      "doi": ""
    },
    {
      "text": "Liam J Bannon and Pelle Ehn. 2012. Design: design matters in Participatory Design. Routledge, Routledge. 57–83 pages.",
      "doi": ""
    },
    {
      "text": "Janet Beavin Bavelas and Nicole Chovil. 2006. Nonverbal and Verbal Communication: Hand Gestures and Facial Displays as Part of Language Use in Face-to-face Dialogue.The Sage handbook of nonverbal communication 6, 11026(2006), 97-115.",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Daniela K. Rosner, and Alex S. Taylor. 2020. The Care Work of Access. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376568",
      "doi": "10.1145/3313831.3376568"
    },
    {
      "text": "Jamie Berke. 2022. How you receive a name sign within the Deaf Community. https://www.verywellhealth.com/using-name-signs-for-personal-names-1048725",
      "doi": ""
    },
    {
      "text": "Larwan Berke, Christopher Caulfield, and Matt Huenerfauth. 2017. Deaf and Hard-of-Hearing Perspectives on Imperfect Automatic Speech Recognition for Captioning One-on-One Meetings. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 155–164. https://doi.org/10.1145/3132525.3132541",
      "doi": "10.1145/3132525.3132541"
    },
    {
      "text": "Gary R Bettger and Timothy J Pearson. 1989. Accommodating deaf and hard-of-hearing persons on public transportation systems in Massachusetts. Transportation research record 1209 (1989), 16–18. http://dx.doi.org/",
      "doi": ""
    },
    {
      "text": "David Braddock, Mary C Rizzolo, Micah Thompson, and Rodney Bell. 2004. Emerging technologies and cognitive disability. Journal of Special Education Technology 19, 4 (2004), 49–56.",
      "doi": ""
    },
    {
      "text": "Diane Brentari and Petra Eccarius. 2010. Handshape contrasts in sign language phonology. Eccarius, Eccarius.",
      "doi": ""
    },
    {
      "text": "Anna C. Cavender, Jeffrey P. Bigham, and Richard E. Ladner. 2009. ClassInFocus: Enabling Improved Visual Attention Strategies for Deaf and Hard of Hearing Students. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, Pennsylvania, USA) (Assets ’09). Association for Computing Machinery, New York, NY, USA, 67–74. https://doi.org/10.1145/1639642.1639656",
      "doi": "10.1145/1639642.1639656"
    },
    {
      "text": "National Deaf Center. 2020. Deaf at work during the pandemic: Making gains with flexibility, optimism, and resilience. https://www.nationaldeafcenter.org/news/deaf-work-during-pandemic-making-gains-flexibility-optimism-and-resilience",
      "doi": ""
    },
    {
      "text": "Haena Cho, Hyeonjeong Im, Sunok Lee, and Sangsu Lee. 2021. “I Want More than ” User-Generated Icons for Better Video-Mediated Communications on the Collaborative Design Process. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 348, 6 pages. https://doi.org/10.1145/3411763.3453655",
      "doi": "10.1145/3411763.3453655"
    },
    {
      "text": "WebMD Editorial Contributors. 2021. How bad is my hearing loss?https://www.webmd.com/a-to-z-guides/how-bad-is-my-hearing-loss",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-Intended Functions of Emojis in US Messaging. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 504–509. https://doi.org/10.1145/2935334.2935370",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Maitraye Das, John Tang, Kathryn E. Ringland, and Anne Marie Piper. 2021. Towards Accessible Remote Work: Understanding Work-from-Home Practices of Neurodivergent Professionals. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 183 (apr 2021), 30 pages. https://doi.org/10.1145/3449282",
      "doi": "10.1145/3449282"
    },
    {
      "text": "Maria De Leon. 2020. Total Communication Approach & Other Strategies for Non-Verbal Children. https://napacenter.org/nonverbal-communication/",
      "doi": ""
    },
    {
      "text": "Daantje Derks, Arjan ER Bos, and Jasper Von Grumbkow. 2008. Emoticons in computer-mediated communication: Social motives and social context. Cyberpsychology & behavior 11, 1 (2008), 99–101.",
      "doi": ""
    },
    {
      "text": "Matthew W Dye, Peter C Hauser, and Daphne Bavelier. 2008. Visual attention in deaf children and adults. Oxford University Press, Oxford University Press. 250–263 pages.",
      "doi": ""
    },
    {
      "text": "Graham R Gibbs. 2007. Thematic coding and categorizing. Analyzing qualitative data 703 (2007), 38–56.",
      "doi": ""
    },
    {
      "text": "Google. 2022. Speech-to-text: Automatic speech recognition & google cloud. https://cloud.google.com/speech-to-text",
      "doi": ""
    },
    {
      "text": "GoogleMeet. Accessed 2021. Real-time meetings by Google. https://meet.google.com/.",
      "doi": ""
    },
    {
      "text": "Richard S Hallam and Roslyn Corney. 2014. Conversation tactics in persons with normal hearing and hearing-impairment. International journal of audiology 53, 3 (2014), 174–181.",
      "doi": ""
    },
    {
      "text": "Shawn Lawton Henry, C Law, and K Barnicle. 2001. Adapting the design process to address more customers in more situations.",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L Bennett. 2020. Living Disability Theory: Reflections on Access, Research, and Design. In Proceedings of the 22nd International ACM SIGACCESS Conference on Computers and Accessibility(Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 4, 13 pages. https://doi.org/10.1145/3373625.3416996",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Chandria Jones, Jocelyn Newsome, Kerry Levin, Amanda Wilmot, J.A. McNulty, and Teresa Kline. 2018. Friends or Strangers? A Feasibility Study of an Innovative Focus Group Methodology. Qualitative Report 23 (01 2018), 98–112. https://doi.org/10.46743/2160-3715/2018.2940",
      "doi": ""
    },
    {
      "text": "Ronald R. Kelly. 2015. The Employment and Career Growth of Deaf and Hard of Hearing Individuals.http://www.raisingandeducatingdeafchildren.org/2015/01/12/the-employment-and-career-growth-of-deaf-and-hard-of-hearing-individuals/",
      "doi": ""
    },
    {
      "text": "Ronald R Kelly. 2015. The Employment and Career Growth of Deaf and Hard of Hearing Individuals. Raising and Educating Deaf Children: Foundations for Policy, Practice, and Outcomes.",
      "doi": ""
    },
    {
      "text": "Hyesook Kim. 2018. Understanding the Life and Communication of the Deaf and Hard of Hearing for Designing SoundAlert. Archives of Design Research 31, 4 (nov 2018), 137–153. https://doi.org/10.15187/adr.2018.11.31.4.137",
      "doi": ""
    },
    {
      "text": "Su-Hyeon Kim, Kyeong-Ju Kim, and Eui-tay Jung. 2017. Visualization of everyday noise for the hearing impaired. In KSDS Spring International Conference & DSUS(KSDS ’17). Korea Society of Design Science, Korea, 136–137.",
      "doi": ""
    },
    {
      "text": "Yeon Soo Kim, Sunok Lee, and Sangsu Lee. 2022. A Participatory Design Approach to Explore Design Directions for Enhancing Videoconferencing Experience for Non-Signing Deaf and Hard of Hearing Users. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility(Athens, Greece) (ASSETS ’22). Association for Computing Machinery, New York, NY, USA, Article 47, 4 pages. https://doi.org/10.1145/3517428.3550375",
      "doi": "10.1145/3517428.3550375"
    },
    {
      "text": "Philippe Kimura-Thollander and Neha Kumar. 2019. Examining the \"Global\" Language of Emojis: Designing for Cultural Representation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300725",
      "doi": "10.1145/3290605.3300725"
    },
    {
      "text": "Lucas Kohnke and Benjamin Luke Moorhouse. 2020. Facilitating synchronous online language learning through Zoom. RELC Journal 53, 1 (2020), 0033688220937235.",
      "doi": ""
    },
    {
      "text": "Ilpo Koskinen, Katja Battarbee, and Tuuli Mattelmeaki. 2003. Empathic design. IT press, Helsinki.",
      "doi": ""
    },
    {
      "text": "Raja S. Kushalnagar and Christian Vogler. 2020. Teleconference Accessibility and Guidelines for Deaf and Hard of Hearing Users. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility(Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 9, 6 pages. https://doi.org/10.1145/3373625.3417299",
      "doi": "10.1145/3373625.3417299"
    },
    {
      "text": "Susan Lacke. 2020. Do all deaf people use sign language?https://www.accessibility.com/blog/do-all-deaf-people-use-sign-language",
      "doi": ""
    },
    {
      "text": "A. Lancaster. 2004. Paper Prototyping: The Fast and Easy Way to Design and Refine User Interfaces. IEEE Transactions on Professional Communication 47, 4(2004), 335–336. https://doi.org/10.1109/tpc.2004.837973",
      "doi": ""
    },
    {
      "text": "Jolanta Lapiak. 2020. Non-manual signals used in sign language. https://www.handspeak.com/learn/index.php?id=158#: :text=Non%2Dmanual%20signals%20or%20NMS,ASL%20sign%20for%20NMS.",
      "doi": ""
    },
    {
      "text": "Minha Lee, Wonyoung Park, Sunok Lee, and Sangsu Lee. 2022. Distracting Moments in Videoconferencing: A Look Back at the Pandemic Period. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 141, 21 pages. https://doi.org/10.1145/3491102.3517545",
      "doi": "10.1145/3491102.3517545"
    },
    {
      "text": "Weijian Li, Yuxiao Chen, Tianran Hu, and Jiebo Luo. 2018. Mining the Relationship between Emoji Usage Patterns and Personality. Proceedings of the International AAAI Conference on Web and Social Media 12, 1 (Jun. 2018), na. https://doi.org/10.1609/icwsm.v12i1.15054",
      "doi": ""
    },
    {
      "text": "[43] K. Linder.2019. https://www.rit.edu/advance/sites/rit.edu.advance/files/docs/Communicating%20with%20People%20Who%20Are%20DHH-Audism%2026JUL2019.pdf",
      "doi": ""
    },
    {
      "text": "Shao-Kang Lo. 2008. The nonverbal communication functions of emoticons in computer-mediated communication. CyberPsychology & Behavior 11, 5 (2008), 595–597.",
      "doi": ""
    },
    {
      "text": "Xuan Lu, Wei Ai, Xuanzhe Liu, Qian Li, Ning Wang, Gang Huang, and Qiaozhu Mei. 2016. Learning from the Ubiquitous Language: An Empirical Analysis of Emoji Usage of Smartphone Users. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Heidelberg, Germany) (UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 770–780. https://doi.org/10.1145/2971648.2971724",
      "doi": "10.1145/2971648.2971724"
    },
    {
      "text": "Kelly Mack, Danielle Bragg, Meredith Ringel Morris, Maarten W Bos, Isabelle Albi, and Andrés Monroy-Hernández. 2020. Social app accessibility for deaf signers. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–31.",
      "doi": "10.1145/3415196"
    },
    {
      "text": "Kelly Mack, Maitraye Das, Dhruv Jain, Danielle Bragg, John Tang, Andrew Begel, Erin Beneteau, Josh Urban Davis, Abraham Glasser, Joon Sung Park, and Venkatesh Potluri. 2021. Mixed Abilities and Varied Experiences: A Group Autoethnography of a Virtual Summer Internship. In Proceedings of the 23rd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, USA) (ASSETS ’21). Association for Computing Machinery, New York, NY, USA, Article 21, 13 pages. https://doi.org/10.1145/3441852.3471199",
      "doi": "10.1145/3441852.3471199"
    },
    {
      "text": "James R. Mallory, Michael Stinson, Lisa Elliot, and Donna Easton. 2017. Personal Perspectives on Using Automatic Speech Recognition to Facilitate Communication between Deaf Students and Hearing Customers. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 419–421. https://doi.org/10.1145/3132525.3134779",
      "doi": "10.1145/3132525.3134779"
    },
    {
      "text": "Emma J. McDonnell, Ping Liu, Steven M. Goodman, Raja Kushalnagar, Jon E. Froehlich, and Leah Findlater. 2021. Social, Environmental, and Technical: Factors at Play in the Current Use and Future Design of Small-Group Captioning. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 434 (oct 2021), 25 pages. https://doi.org/10.1145/3479578",
      "doi": "10.1145/3479578"
    },
    {
      "text": "Hannah Miller, Jacob Thebault-Spieker, Shuo Chang, Isaac Johnson, Loren Terveen, and Brent Hecht. 2021. “Blissfully Happy” or “Ready toFight”: Varying Interpretations of Emoji. Proceedings of the International AAAI Conference on Web and Social Media 10, 1 (Aug. 2021), 259–268. https://doi.org/10.1609/icwsm.v10i1.14757",
      "doi": ""
    },
    {
      "text": "Timothy Neate, Vasiliki Kladouchou, Stephanie Wilson, and Shehzmani Shams. 2022. “Just Not Together”: The Experience of Videoconferencing for People with Aphasia during the Covid-19 Pandemic. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 606, 16 pages. https://doi.org/10.1145/3491102.3502017",
      "doi": "10.1145/3491102.3502017"
    },
    {
      "text": "Katja Neureiter, Martin Murer, Verena Fuchsberger, and Manfred Tscheligi. 2013. Hand and Eyes: How Eye Contact is Linked to Gestures in Video Conferencing. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 127–132. https://doi.org/10.1145/2468356.2468380",
      "doi": "10.1145/2468356.2468380"
    },
    {
      "text": "Petrus Ng. 2019. Work Experience of People Who are Deaf or Hard of Hearing in Hong Kong. JADARA 32, 3 (2019), 7.",
      "doi": ""
    },
    {
      "text": "Stephen Nover. 1995. Politics and language: American Sign Language and English in deaf education. Sociolinguistics in deaf communities 1 (1995), 109–163.",
      "doi": ""
    },
    {
      "text": "Kiri O’Brien. 2020. How coronavirus is making life harder for deaf workers. https://www.drutherssearch.com/how-coronavirus-is-making-life-harder-for-deaf-workers/",
      "doi": ""
    },
    {
      "text": "Angela M O’Donnell. 2006. The Role of Peers and Group Learning.Lawrence Erlbaum Associates Publishers, Mahwah, NJ, US.",
      "doi": ""
    },
    {
      "text": "U.S. Department of Education. 2023. National Deaf Center. https://www.nationaldeafcenter.org/",
      "doi": ""
    },
    {
      "text": "Sushil K. Oswal. 2014. Participatory Design: Barriers and Possibilities. Commun. Des. Q. Rev 2, 3 (may 2014), 14–19. https://doi.org/10.1145/2644448.2644452",
      "doi": "10.1145/2644448.2644452"
    },
    {
      "text": "John Oswald. 2020. I’m deaf, and this is what happens when I get on a zoom call. https://www.fastcompany.com/90565930/im-deaf-and-this-is-what-happens-when-i-get-on-a-zoom-call",
      "doi": ""
    },
    {
      "text": "Otter.ai. 2021. Otter.ai. https://Otter.ai.",
      "doi": ""
    },
    {
      "text": "Ila Parasnis (Ed.). 1996. Cultural and Language Diversity and the Deaf Experience. Cambridge University Press, Cambridge, UK. https://doi.org/10.1017/CBO9781139163804",
      "doi": ""
    },
    {
      "text": "Yoo Jung Park, Myeong Hee Choi, Sang-a Park, and Jong Hoon Yoon. 2020. A Proposal of AI-based Sign Language Interpretation and Hand-ticon for Communication between the Hearing-Impaired and the Non-disabled. In 2020 KSDS Spring International Conference. Korea Society of Design Science, Gyeonggi-do, Korea, 240–241.",
      "doi": ""
    },
    {
      "text": "Yi-Hao Peng, Ming-Wei Hsi, Paul Taele, Ting-Yu Lin, Po-En Lai, Leon Hsu, Tzu-chuan Chen, Te-Yen Wu, Yu-An Chen, Hsien-Hui Tang, and Mike Y. Chen. 2018. SpeechBubbles: Enhancing Captioning Experiences for Deaf and Hard-of-Hearing People in Group Conversations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173867",
      "doi": "10.1145/3173574.3173867"
    },
    {
      "text": "Leah Lakshmi Piepzna-Samarasinha. 2018. Care work: Dreaming disability justice. arsenal pulp press, Vancouver, British Columbia.",
      "doi": ""
    },
    {
      "text": "Fatemeh Rabiee. 2004. Focus-group interview and data analysis. Proceedings of the nutrition society 63, 4 (2004), 655–660.",
      "doi": ""
    },
    {
      "text": "David Rodrigues, Diniz Lopes, Marília Prada, Dominic Thompson, and Margarida V Garrido. 2017. A frown emoji can be worth a thousand words: Perceptions of emoji use in text messages exchanged between romantic partners. Telematics and Informatics 34, 8 (2017), 1532–1543.",
      "doi": "10.1016/j.tele.2017.07.001"
    },
    {
      "text": "Filipa M Rodrigues, Ana Maria Abreu, Ingela Holmström, and Ana Mineiro. 2022. E-learning is a burden for the deaf and hard of hearing. Scientific Reports 12, 1 (2022), 9346. https://doi.org/10.1038/s41598-022-13542-1",
      "doi": ""
    },
    {
      "text": "Jazz Rui Xia Ang, Ping Liu, Emma McDonnell, and Sarah Coppola. 2022. “In This Online Environment, We’re Limited”: Exploring Inclusive Video Conferencing Design for Signers. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 609, 16 pages. https://doi.org/10.1145/3491102.3517488",
      "doi": "10.1145/3491102.3517488"
    },
    {
      "text": "Matthew Seita, Khaled Albusays, Sushant Kafle, Michael Stinson, and Matt Huenerfauth. 2018. Behavioral Changes in Speakers Who Are Automatically Captioned in Meetings with Deaf or Hard-of-Hearing Peers. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 68–80. https://doi.org/10.1145/3234695.3236355",
      "doi": "10.1145/3234695.3236355"
    },
    {
      "text": "Matthew Seita, Sarah Andrew, and Matt Huenerfauth. 2021. Deaf and Hard-of-Hearing Users’ Preferences for Hearing Speakers’ Behavior during Technology-Mediated in-Person and Remote Conversations. In Proceedings of the 18th International Web for All Conference (Ljubljana, Slovenia) (W4A ’21). Association for Computing Machinery, New York, NY, USA, Article 25, 12 pages. https://doi.org/10.1145/3430263.3452430",
      "doi": "10.1145/3430263.3452430"
    },
    {
      "text": "Matthew Seita and Matt Huenerfauth. 2020. Deaf Individuals’ Views on Speaking Behaviors of Hearing Peers When Using an Automatic Captioning App. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3383083",
      "doi": "10.1145/3334480.3383083"
    },
    {
      "text": "Matthew Seita, Sooyeon Lee, Sarah Andrew, Kristen Shinohara, and Matt Huenerfauth. 2022. Remotely Co-Designing Features for Communication Applications Using Automatic Captioning with Deaf and Hearing Pairs. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 460, 13 pages. https://doi.org/10.1145/3491102.3501843",
      "doi": "10.1145/3491102.3501843"
    },
    {
      "text": "Karin Slegers, Pieter Duysburgh, Helma van Rijn, and Niels Hendriks. 2012. Participatory Design for Users with Impairments Affecting Cognitive Functions and Communication Skills. In Proceedings of the 12th Participatory Design Conference: Exploratory Papers, Workshop Descriptions, Industry Cases - Volume 2 (Roskilde, Denmark) (PDC ’12). Association for Computing Machinery, New York, NY, USA, 141–142. https://doi.org/10.1145/2348144.2348190",
      "doi": "10.1145/2348144.2348190"
    },
    {
      "text": "Jeongseop Son and Eunsil Yi. 2018. A study on a warning pictogram system for the hearing-impaired - focusing on disaster and safety accident situations. Archives of Design Research 31, 3 (2018), 151–163. https://doi.org/10.15187/adr.2018.08.31.3.151",
      "doi": ""
    },
    {
      "text": "Jeongseop Son and Eunsil Yi. 2022. The Application of Motion Graphics to Disaster Safety Pictograms for the Hearing-Impaired. Archives of Design Research 35, 4 (2022), 175–193.",
      "doi": ""
    },
    {
      "text": "Claudine Storbeck. 2011. Language diversity in deaf education. Gallaudet University Press, Washington, D.C. USA. 132–145 pages.",
      "doi": ""
    },
    {
      "text": "Donald Taylor, Paul Berry, and Clifford Block. 1958. Does Group Participation When Using Brainstorming Facilitate or Inhibit Active Thinking. Administrative Science Quarterly 3 (06 1958), 23. https://doi.org/10.2307/2390603",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell and David R. Flatla. 2016. Oh That’s What You Meant! Reducing Emoji Misunderstanding. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 859–866. https://doi.org/10.1145/2957265.2961844",
      "doi": "10.1145/2957265.2961844"
    },
    {
      "text": "Louis Turmel. 2020. Meeting statistics - stats on costs & time spent in meetings. https://bettermeetings.expert/meeting-statistics/",
      "doi": ""
    },
    {
      "text": "Nancy Tye-Murray, Suzanne C Purdy, and George G Woodworth. 1992. Reported use of communication strategies by SHHH members: Client, talker, and situational variables. Journal of Speech, Language, and Hearing Research 35, 3 (1992), 708–717.",
      "doi": ""
    },
    {
      "text": "Clayton Valli and Ceil Lucas. 2000. Linguistics of American sign language: An introduction. Gallaudet University Press, Washington, D.C. USA.",
      "doi": ""
    },
    {
      "text": "Christian Vogler, Tina Childress, Michael McKee, Christopher Moreland, Robert Roth, and Chad Ruffin. 2020. Accessible webinars for deaf and hard of hearing people. http://www.deafhhtech.org/rerc/webinar-accessibility-for-deaf-and-hard-of-hearing-people/",
      "doi": ""
    },
    {
      "text": "Gerard G Walter. 2010. Deaf and hard-of-hearing students in transition: Demographics with an emphasis on STEM education. National Technical Institute for the Deaf, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther and Kyle P D’addario. 2001. The impacts of emoticons on message interpretation in computer-mediated communication. Social science computer review 19, 3 (2001), 324–347.",
      "doi": ""
    },
    {
      "text": "Colin Ware. 2010. Visual thinking for design. Elsevier, Amsterdam, Netherlands.",
      "doi": ""
    },
    {
      "text": "Elissa Weeden and Sharon Mason. 2020. An Initial Survey of Deaf and Hard-of-Hearing Student Use of a Composite Screen Solution Utilizing Web Conferencing Software. In Proceedings of the 21st Annual Conference on Information Technology Education (Virtual Event, USA) (SIGITE ’20). Association for Computing Machinery, New York, NY, USA, 46–49. https://doi.org/10.1145/3368308.3415459",
      "doi": "10.1145/3368308.3415459"
    },
    {
      "text": "Sarah Wiseman and Sandy J. J. Gould. 2018. Repurposing Emoji for Personalised Communication: Why Pizza Means “I Love You”. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173726",
      "doi": "10.1145/3173574.3173726"
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye Text, Hello Emoji: Mobile Communication on WeChat in China. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 748–759. https://doi.org/10.1145/3025453.3025800",
      "doi": "10.1145/3025453.3025800"
    },
    {
      "text": "Zoom. 2021. Video conferencing. http://zoom.us/.",
      "doi": ""
    }
  ]
}