{
  "doi": "10.1145/3544548.3580955",
  "title": "This Watchface Fits with my Tattoos: Investigating Customisation Needs and Preferences in Personal Tracking",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "People engage in self-tracking with diverse data collection and visualisation needs and preferences. Customisable self-tracking tools offer the potential to support individualized preferences by letting people make changes to the aesthetics and functionality of tracker displays. In this paper, we use the customisation options offered by the displays of commercial fitness smartwatches as a lens to investigate when, why and how 386 self-trackers engage in customisations in their daily lives. We find that people largely customise their trackers’ display frequently, multiple times a day, or not at all, with frequent customisations reflecting situational data, aesthetic and personal meaning needs. We discuss implications for the design of tracking tools aiming to support customisation and discuss the utility of customisations towards goal scaffolding and maintaining interest in tracking.",
  "tags": [
    "physical activity",
    "customisation",
    "smartwatch",
    "personal informatics"
  ],
  "authors": [
    {
      "name": "Rúben Gouveia",
      "institution": "University of Twente, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558575156",
      "orcid": "0000-0001-5042-6198"
    },
    {
      "name": "Daniel A. Epstein",
      "institution": "Informatics, University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-83458899257/rel-imgonly/img_3258a_square.jpg",
      "acmid": "83458899257",
      "orcid": "0000-0002-2657-6345"
    }
  ],
  "references": [
    {
      "text": "2017. Percentage of Mobile Medical Application Categories Used by U.S. Adults at Least Once as of 2017. https://www.statista.com/statistics/378850/top-mobile-health-application-categories-used-by-us-consumers/",
      "doi": ""
    },
    {
      "text": "2020. Changing Views on Healthcare and Digital Health Tools - GlobalWebIndex. https://www.gwi.com/reports/digital-healthcare",
      "doi": ""
    },
    {
      "text": "2022. Charge3. https://staticcs.fitbit.com/content/assets/help/manuals/manual_charge_3_en_US.pdf",
      "doi": ""
    },
    {
      "text": "2022. Connect IQ Store. https://apps.garmin.com/en-US/",
      "doi": ""
    },
    {
      "text": "2022. Discover Smartwatch Clock Faces. https://gallery.fitbit.com/clocks",
      "doi": ""
    },
    {
      "text": "2022. Explore the Face Gallery on Apple Watch. https://support.apple.com/guide/watch/explore-the-face-gallery-apdd909455f0/watchos",
      "doi": ""
    },
    {
      "text": "2022. Fitbit Features. https://smartwatchchart.com/smartwatches-category/list-of-fitbit-smartwatches-and-trackers/",
      "doi": ""
    },
    {
      "text": "2022. Fitbit SDK. https://dev.fitbit.com/",
      "doi": ""
    },
    {
      "text": "2022. FitFace. https://fitface.xyz/",
      "doi": ""
    },
    {
      "text": "2022. InspireHR. https://staticcs.fitbit.com/content/assets/help/manuals/manual_inspire_hr_en_US.pdf",
      "doi": ""
    },
    {
      "text": "2022. Ionic. https://staticcs.fitbit.com/content/assets/help/manuals/manual_ionic_en_US.pdf",
      "doi": ""
    },
    {
      "text": "2022. Lite. https://help.fitbit.com/manuals/manual_sense_en_US.pdf",
      "doi": ""
    },
    {
      "text": "2022. Personalize your iPhone Lock Screen. https://support.apple.com/guide/iphone/personalize-your-iphone-lock-screen-iph4d0e6c351/ios",
      "doi": ""
    },
    {
      "text": "2022. Sense. https://help.fitbit.com/manuals/manual_sense_en_US.pdf",
      "doi": ""
    },
    {
      "text": "2022. Versa. https://staticcs.fitbit.com/content/assets/help/manuals/manual_versa_en_US.pdf",
      "doi": ""
    },
    {
      "text": "2022. Versa2. https://staticcs.fitbit.com/content/assets/help/manuals/manual_versa_2_en_US.pdf",
      "doi": ""
    },
    {
      "text": "2022. Versa3. https://help.fitbit.com/manuals/manual_versa_3_en_US.pdf",
      "doi": ""
    },
    {
      "text": "Parastoo Abtahi, Victoria Ding, Anna C Yang, Tommy Bruzzese, Alyssa B Romanos, Elizabeth L Murnane, Sean Follmer, and James A Landay. 2020. Understanding physical practices and the role of technology in manual self-tracking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 4 (2020), 1–24.",
      "doi": "10.1145/3432236"
    },
    {
      "text": "Elena Agapie, Patricia A. Areán, Gary Hsieh, and Sean A. Munson. 2022. A Longitudinal Goal Setting Model for Addressing Complex Personal Problems in Mental Health. (2022).",
      "doi": ""
    },
    {
      "text": "Fereshteh Amini, Khalad Hasan, Andrea Bunt, and Pourang Irani. 2017. Data representations for in-situ exploration of health and fitness data. In Proceedings of the 11th EAI international conference on pervasive computing technologies for healthcare. 163–172.",
      "doi": "10.1145/3154862.3154879"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, and Anna L Cox. 2020. Trackly: A customisable and pictorial self-tracking app to support agency in multiple sclerosis self-care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376809"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L Cox, and Yunan Chen. 2017. Quantifying the body and caring for the mind: self-tracking in multiple sclerosis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6889–6901.",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L Cox. 2018. Flexible and mindful self-tracking: Design implications from paper bullet journals. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3173602"
    },
    {
      "text": "Tanja Blascheck, Frank Bentley, Eun Kyoung Choe, Tom Horak, and Petra Isenberg. 2021. Characterizing Glanceable Visualizations: From Perception to Behavior Change. In Mobile Data Visualization. Chapman and Hall/CRC, 151–176.",
      "doi": ""
    },
    {
      "text": "Marta E Cecchinato, Anna L Cox, and Jon Bird. 2017. Always on (line)? User experience of smartwatches and their role within multi-device ecologies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3557–3568.",
      "doi": "10.1145/3025453.3025538"
    },
    {
      "text": "Eun Kyoung Choe, Saeed Abdullah, Mashfiqui Rabbi, Edison Thomaz, Daniel A Epstein, Felicia Cordeiro, Matthew Kay, Gregory D Abowd, Tanzeem Choudhury, James Fogarty, 2017. Semi-automated tracking: a balanced approach for self-monitoring applications. IEEE Pervasive Computing 16, 1 (2017), 74–84.",
      "doi": "10.1109/mprv.2017.18"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B Lee, Bongshin Lee, Wanda Pratt, and Julie A Kientz. 2014. Understanding quantified-selfers’ practices in collecting and exploring personal data. In Proceedings of the SIGCHI conference on human factors in computing systems. 1143–1152.",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Victoria Clarke and Virginia Braun. 2013. Successful qualitative research: A practical guide for beginners. Successful Qualitative Research(2013), 1–400.",
      "doi": ""
    },
    {
      "text": "James Clawson, Jessica A Pater, Andrew D Miller, Elizabeth D Mynatt, and Lena Mamykina. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. In Proceedings of the 2015 ACM international joint conference on pervasive and ubiquitous computing. 647–658.",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Sunny Consolvo, Katherine Everitt, Ian Smith, and James A Landay. 2006. Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 457–466.",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W McDonald, Daniel Avrahami, Jon Froehlich, Louis LeGrand, Ryan Libby, Keith Mosher, and James A Landay. 2008. Flowers or a robot army? Encouraging awareness & activity with personal, mobile displays. In Proceedings of the 10th international conference on Ubiquitous computing. 54–63.",
      "doi": "10.1145/1409635.1409644"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W McDonald, James A Landay, 2014. Designing for healthy lifestyles: Design considerations for mobile technologies to encourage consumer health and wellness. Foundations and Trends® in Human–Computer Interaction 6, 3–4(2014), 167–315.",
      "doi": ""
    },
    {
      "text": "Mayara Costa Figueiredo, Clara Caldeira, Elizabeth Victoria Eikey, Melissa Mazmanian, and Yunan Chen. 2018. Engaging with health data: The interplay between self-tracking activities and emotions in fertility struggles. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–20.",
      "doi": "10.1145/3274309"
    },
    {
      "text": "Mayara Costa Figueiredo, Clara Caldeira, Tera L Reynolds, Sean Victory, Kai Zheng, and Yunan Chen. 2017. Self-tracking for fertility care: collaborative support for a highly personalized problem. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–21.",
      "doi": "10.1145/3134671"
    },
    {
      "text": "Mayara Costa Figueiredo, Thu Huynh, Anna Takei, Daniel A Epstein, and Yunan Chen. 2021. Goals, life events, and transitions: examining fertility apps for holistic health tracking. JAMIA open 4, 1 (2021), ooab013.",
      "doi": ""
    },
    {
      "text": "Nediyana Daskalova, Eindra Kyi, Kevin Ouyang, Arthur Borem, Sally Chen, Sung Hyun Park, Nicole Nugent, and Jeff Huang. 2021. Self-e: Smartphone-supported guidance for customizable self-experimentation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445100"
    },
    {
      "text": "Tina Ekhtiar, Rúben Gouveia, Armağan Karahanoğlu, and Geke Ludden. 2022. Reflection during goal setting: An analysis of popular personal informatics apps. DRS2022: Bilbao 25(2022).",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, Tanja Blascheck, Sheelagh Carpendale, Raimund Dachselt, and Jo Vermeulen. 2021. Challenges in Everyday Use of Mobile Visualizations. In Mobile Data Visualization. Chapman and Hall/CRC, 209–240.",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, Clara Caldeira, Mayara Costa Figueiredo, Xi Lu, Lucas M Silva, Lucretia Williams, Jong Ho Lee, Qingyang Li, Simran Ahuja, Qiuer Chen, 2020. Mapping and taking stock of the personal informatics literature. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 4 (2020), 1–38.",
      "doi": "10.1145/3432231"
    },
    {
      "text": "Daniel A Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A Munson. 2016. Beyond abandonment to next steps: understanding and designing for life after personal informatics tool use. In Proceedings of the 2016 CHI conference on human factors in computing systems. 1109–1113.",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Daniel A. Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean A. Munson. 2014. Taming data complexity in lifelogs: exploring visual cuts of personal informatics data. In Proceedings of the 2014 conference on Designing interactive systems. 667–676.",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Daniel A Epstein, Nicole B Lee, Jennifer H Kang, Elena Agapie, Jessica Schroeder, Laura R Pina, James Fogarty, Julie A Kientz, and Sean Munson. 2017. Examining menstrual tracking to inform the design of personal informatics tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6876–6888.",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Daniel A Epstein, An Ping, James Fogarty, and Sean A Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM international joint conference on pervasive and ubiquitous computing. 731–742.",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Catrin Feron, Tina Ekhtiar, and Ruben Gouveia. 2022. Transitions in Personal Informatics: Investigating Self-Tracking During Moments of Change. In Adjunct Proceedings of the 2022 Nordic Human-Computer Interaction Conference. 1–5.",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How do we engage with activity trackers? A longitudinal study of Habito. In Proceedings of the 2015 ACM international joint conference on pervasive and ubiquitous computing. 1305–1316.",
      "doi": "10.1145/2750858.2804290"
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2018. Activity Tracking in Vivo. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173936",
      "doi": "10.1145/3173574.3173936"
    },
    {
      "text": "Rúben Gouveia, Fábio Pereira, Evangelos Karapanos, Sean A. Munson, and Marc Hassenzahl. 2016. Exploring the Design Space of Glanceable Feedback for Physical Activity Trackers. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Heidelberg, Germany) (UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 144–155. https://doi.org/10.1145/2971648.2971754",
      "doi": "10.1145/2971648.2971754"
    },
    {
      "text": "Rebecca Gulotta, Jodi Forlizzi, Rayoung Yang, and Mark Wah Newman. 2016. Fostering engagement with personal informatics systems. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 286–300.",
      "doi": "10.1145/2901790.2901803"
    },
    {
      "text": "Jungmin Han and Hyeon-Jeong Suk. 2019. Do users perceive the same image differently? Comparison of OLED and LCD in mobile HMDs and smartphones. Journal of Information Display 20, 1 (2019), 31–38.",
      "doi": ""
    },
    {
      "text": "Daniel Harrison, Paul Marshall, Nadia Bianchi-Berthouze, and Jon Bird. 2015. Activity tracking: barriers, workarounds and customisation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 617–621.",
      "doi": "10.1145/2750858.2805832"
    },
    {
      "text": "Alaul Islam, Ranjini Aravind, Tanja Blascheck, Anastasia Bezerianos, and Petra Isenberg. 2022. Preferences and Effectiveness of Sleep Data Visualizations for Smartwatches and Fitness Bands. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": ""
    },
    {
      "text": "Alaul Islam, Anastasia Bezerianos, Bongshin Lee, Tanja Blascheck, and Petra Isenberg. 2020. Visualizing information on watch faces: A survey with smartwatch users. In 2020 IEEE Visualization Conference (VIS). IEEE, 156–160.",
      "doi": ""
    },
    {
      "text": "Hayeon Jeong, Heepyung Kim, Rihun Kim, Uichin Lee, and Yong Jeong. 2017. Smartwatch wearing behavior analysis: a longitudinal study. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–31.",
      "doi": "10.1145/3131892"
    },
    {
      "text": "Eunkyung Jo, Austin L Toombs, Colin M Gray, and Hwajung Hong. 2020. Understanding Parenting Stress through Co-designed Self-Trackers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376359"
    },
    {
      "text": "Oskar Juhlin, Yanqing Zhang, Jinyi Wang, and Anders Andersson. 2016. Fashionable services for wearables: Inventing and investigating a new design path for smart watches. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. 1–10.",
      "doi": "10.1145/2971485.2971505"
    },
    {
      "text": "Jin Kang, Jomara Binda, Pratik Agarwal, Bruno Saconi, and Eun Kyoung Choe. 2017. Fostering user engagement: Improving sense of identity through cosmetic customization in wearable trackers. In Proceedings of the 11th EAI international conference on pervasive computing technologies for healthcare. 11–20.",
      "doi": "10.1145/3154862.3154878"
    },
    {
      "text": "Armağan Karahanoğlu, Rúben Gouveia, Jasper Reenalda, and Geke Ludden. 2021. How are sports-trackers used by runners? Running-related data, personal goals, and self-tracking in running. Sensors 21, 11 (2021), 3687.",
      "doi": ""
    },
    {
      "text": "Evangelos Karapanos, Rúben Gouveia, Marc Hassenzahl, and Jodi Forlizzi. 2016. Wellbeing in the making: peoples’ experiences with wearable activity trackers. Psychology of well-being 6, 1 (2016), 1–17.",
      "doi": ""
    },
    {
      "text": "Ravi Karkar, Jessica Schroeder, Daniel A Epstein, Laura R Pina, Jeffrey Scofield, James Fogarty, Julie A Kientz, Sean A Munson, Roger Vilardaga, and Jasmine Zia. 2017. Tummytrials: a feasibility study of using self-experimentation to detect individualized food triggers. In Proceedings of the 2017 CHI conference on human factors in computing systems. 6850–6863.",
      "doi": "10.1145/3025453.3025480"
    },
    {
      "text": "Dmitri S Katz, Blaine A Price, Simon Holland, and Nicholas Sheep Dalton. 2018. Data, data everywhere, and still too hard to link: Insights from user interactions with diabetes apps. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174077"
    },
    {
      "text": "Nam Wook Kim, Hyejin Im, Nathalie Henry Riche, Alicia Wang, Krzysztof Gajos, and Hanspeter Pfister. 2019. Dataselfie: Empowering people to design personalized visuals to represent their data. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300309"
    },
    {
      "text": "Sung-In Kim, Eunkyung Jo, Myeonghan Ryu, Inha Cha, Young-Ho Kim, Heejung Yoo, and Hwajung Hong. 2019. Toward becoming a better self: Understanding self-tracking experiences of adolescents with autism spectrum disorder using custom trackers. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare. 169–178.",
      "doi": "10.1145/3329189.3329209"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Bongshin Lee, Eun Kyoung Choe, and Jinwook Seo. 2017. OmniTrack: A flexible self-tracking approach leveraging semi-automated tracking. Proceedings of the ACM on interactive, mobile, wearable and ubiquitous technologies 1, 3 (2017), 1–28.",
      "doi": "10.1145/3130930"
    },
    {
      "text": "Amanda Lazar, Christian Koehler, Theresa Jean Tanenbaum, and David H Nguyen. 2015. Why we use and abandon smart devices. In Proceedings of the 2015 ACM international joint conference on pervasive and ubiquitous computing. 635–646.",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Bongshin Lee, Eun Kyoung Choe, Petra Isenberg, Kim Marriott, and John Stasko. 2020. Reaching broader audiences with data visualization. IEEE Computer Graphics and Applications 40, 2 (2020), 82–90.",
      "doi": "10.1109/MCG.2020.2968244"
    },
    {
      "text": "Bongshin Lee, Raimund Dachselt, Petra Isenberg, and Eun Kyoung Choe. 2021. Mobile Data Visualization. CRC Press.",
      "doi": ""
    },
    {
      "text": "Jong Ho Lee, Jessica Schroeder, and Daniel A. Epstein. 2022. Understanding and Supporting Self-Tracking App Selection. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 4, Article 166 (dec 2022), 25 pages. https://doi.org/10.1145/3494980",
      "doi": "10.1145/3494980"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI conference on human factors in computing systems. 557–566.",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "James J Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B Strub. 2006. Fish’n’Steps: Encouraging physical activity with an interactive computer game. In International conference on ubiquitous computing. Springer, 261–278.",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Yuhan Luo, Peiyi Liu, and Eun Kyoung Choe. 2019. Co-Designing food trackers with dietitians: Identifying design opportunities for food tracker customization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300822"
    },
    {
      "text": "Zhenyue Luo and Shin-Tson Wu. 2015. OLED versus LCD: Who wins. Opt. Photonics News 2015(2015), 19–21.",
      "doi": ""
    },
    {
      "text": "Lucas M. Silva and Daniel A. Epstein. 2021. Investigating preferred food description practices in digital food journaling. In Designing Interactive Systems Conference 2021. 589–605.",
      "doi": ""
    },
    {
      "text": "Wendy E Mackay. 1991. Triggers and barriers to customizing software. In Proceedings of the SIGCHI conference on Human factors in computing systems. 153–160.",
      "doi": "10.1145/108844.108867"
    },
    {
      "text": "Donald McMillan, Barry Brown, Airi Lampinen, Moira McGregor, Eve Hoggan, and Stefania Pizza. 2017. Situating wearables: Smartwatch use in context. In Proceedings of the 2017 chi conference on human factors in computing systems. 3582–3594.",
      "doi": "10.1145/3025453.3025993"
    },
    {
      "text": "Jochen Meyer, Judy Kay, Daniel A Epstein, Parisa Eslambolchilar, and Lie Ming Tang. 2020. A life of data: characteristics and challenges of very long term self-tracking for health and wellness. ACM Transactions on Computing for Healthcare 1, 2 (2020), 1–4.",
      "doi": "10.1145/3373719"
    },
    {
      "text": "Elizabeth L Murnane, Xin Jiang, Anna Kong, Michelle Park, Weili Shi, Connor Soohoo, Luke Vink, Iris Xia, Xin Yu, John Yang-Sammataro, 2020. Designing ambient narrative-based interfaces to reflect and motivate physical activity. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376478"
    },
    {
      "text": "Ali Neshati, Launa Leboe-Mcgowan, Jason Leboe-Mcgowan, Marcos Serrano, Pourang Irani, 2019. G-sparks: Glanceable sparklines on smartwatches. In 45th Conference on Graphics Interface (GI 2019). 1–9.",
      "doi": ""
    },
    {
      "text": "Jasmin Niess, Kristina Knaving, Alina Kolb, and Paweł W Woźniak. 2020. Exploring fitness tracker visualisations to avoid rumination. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–11.",
      "doi": "10.1145/3379503.3405662"
    },
    {
      "text": "Jasmin Niess and Paweł W Woźniak. 2018. Supporting meaningful personal fitness: The tracker goal evolution model. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3173745"
    },
    {
      "text": "Jasmin Niess, Paweł W Woźniak, Yomna Abdelrahman, Passant ElAgroudy, Yasmeen Abdrabou, Caroline Eckerth, Sarah Diefenbach, and Kristina Knaving. 2021. ‘I Don’t Need a Goal’: Attitudes and Practices in Fitness Tracking beyond WEIRD User Groups. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction. 1–14.",
      "doi": "10.1145/3447526.3472062"
    },
    {
      "text": "Stefania Pizza, Barry Brown, Donald McMillan, and Airi Lampinen. 2016. Smartwatch in vivo. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5456–5469.",
      "doi": "10.1145/2858036.2858522"
    },
    {
      "text": "Kyrill Potapov and Paul Marshall. 2020. LifeMosaic: Co-design of a personal informatics tool for youth. In Proceedings of the interaction design and children conference. 519–531.",
      "doi": ""
    },
    {
      "text": "Amon Rapp and Federica Cena. 2016. Personal informatics for everyday life: How users without prior self-tracking experience engage with personal data. International Journal of Human-Computer Studies 94 (2016), 1–17.",
      "doi": "10.1016/j.ijhcs.2016.05.006"
    },
    {
      "text": "Amon Rapp, Alessandro Marcengo, Luca Buriano, Giancarlo Ruffo, Mirko Lai, and Federica Cena. 2018. Designing a personal informatics system for users without experience in self-tracking: a case study. Behaviour & Information Technology 37, 4 (2018), 335–366.",
      "doi": ""
    },
    {
      "text": "Hugo Romat, Nathalie Henry Riche, Christophe Hurter, Steven Drucker, Fereshteh Amini, and Ken Hinckley. 2020. Dear pictograph: Investigating the role of personalization and immersion for consuming and enjoying visualizations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376348"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI conference on human factors in computing systems. 1163–1172.",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Vivien Morris, Magy Seif El-Nasr, and Andrea G Parker. 2020. Storywell: designing for family fitness app motivation by using social rewards and reflection. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376686"
    },
    {
      "text": "Jessica Schroeder, Chia-Fang Chung, Daniel A Epstein, Ravi Karkar, Adele Parsons, Natalia Murinova, James Fogarty, and Sean A Munson. 2018. Examining self-tracking by people with migraine: goals, needs, and opportunities in a chronic health condition. In Proceedings of the 2018 designing interactive systems conference. 135–148.",
      "doi": "10.1145/3196709.3196738"
    },
    {
      "text": "Jessica Schroeder, Ravi Karkar, Natalia Murinova, James Fogarty, and Sean A. Munson. 2019. Examining Opportunities for Goal-Directed Self-Tracking to Support Chronic Condition Management. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 4, Article 151 (dec 2019), 26 pages. https://doi.org/10.1145/3369809",
      "doi": "10.1145/3369809"
    },
    {
      "text": "S Shyam Sundar, Jeeyun Oh, Saraswathi Bellur, Haiyan Jia, and Hyang-Sook Kim. 2012. Interactivity as self-expression: A field experiment with customization and blogging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 395–404.",
      "doi": "10.1145/2207676.2207731"
    },
    {
      "text": "Jakob Tholander and Stina Nylander. 2015. Snot, sweat, pain, mud, and snow: Performance and experience in the use of sports watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2913–2922.",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "Jason Wiese, Sauvik Das, Jason I Hong, and John Zimmerman. 2017. Evolving the ecosystem of personal behavioral data. Human–Computer Interaction 32, 5-6 (2017), 447–510.",
      "doi": ""
    },
    {
      "text": "Clint Zeagler. 2017. Where to wear it: functional, technical, and social considerations in on-body location for wearable technology 20 years of designing for wearability. In Proceedings of the 2017 ACM International Symposium on Wearable Computers. 150–157.",
      "doi": "10.1145/3123021.3123042"
    }
  ]
}