{
  "doi": "10.1145/3544548.3580705",
  "title": "Analyzing the Use of Public and In-house Secure Development Guidelines in U.S. and Japanese Industries",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Secure development guidelines contribute to improving software security from the development stage by making developers aware of the risks to be assumed, the necessary security countermeasures, and how to implement them. In this study, we investigated the actual utilization of guidelines and their usability in the industry through a survey of software development professionals in the U.S. and Japan (N=396 in the U.S. and N=474 in Japan). Our quantitative analysis revealed that “in-house” guidelines not examined in most existing studies are in fact widely utilized in the industry and also clarified how they are related to the use of public guidelines. In addition, we found that the practices for implementing guidelines recommended by existing studies are difficult for software development professionals with certain attributes, e.g., those who are working on small projects. The findings demonstrate the need for lightweight recommended practices taking into account organizational issues at industrial development sites that are easy for developers to implement.",
  "tags": [
    "Secure programming",
    "Survey",
    "Security",
    "HCI for development"
  ],
  "authors": [
    {
      "name": "Fumihiro Kanei",
      "institution": "NTT, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659177876",
      "orcid": "0000-0002-5212-9274"
    },
    {
      "name": "Ayako A. Hasegawa",
      "institution": "NICT, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659484393",
      "orcid": "0000-0002-5527-5306"
    },
    {
      "name": "Eitaro Shioji",
      "institution": "NTT, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81552556656",
      "orcid": "0000-0001-8743-9101"
    },
    {
      "name": "Mitsuaki Akiyama",
      "institution": "NTT, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331487777",
      "orcid": "0000-0001-7052-8562"
    }
  ],
  "references": [
    {
      "text": "Yasemin Acar, Michael Backes, Sascha Fahl, Doowon Kim, Michelle L Mazurek, and Christian Stransky. 2016. You Get Where You’re Looking for: The Impact of Information Sources on Code Security. In Proceedings of the 2016 IEEE Symposium on Security and Privacy(S&P ’16). IEEE, 289–305.",
      "doi": ""
    },
    {
      "text": "Yasemin Acar, Sascha Fahl, and Michelle L. Mazurek. 2016. You are Not Your Developer, Either: A Research Agenda for Usable Security and Privacy Research Beyond End Users. In Proceedings of the 2016 IEEE Cybersecurity Development(SecDev ’16). IEEE, 3–8.",
      "doi": ""
    },
    {
      "text": "Yasemin Acar, Christian Stransky, Dominik Wermke, Charles Weir, Michelle L. Mazurek, and Sascha Fahl. 2017. Developers Need Support, Too: A Survey of Security Advice for Software Developers. In Proceedings of the 2017 IEEE Cybersecurity Development(SecDev ’17). IEEE.",
      "doi": ""
    },
    {
      "text": "Emad Aghajani, Csaba Nagy, Mario Linares-Vásquez, Laura Moreno, Gabriele Bavota, Michele Lanza, and David C. Shepherd. 2020. Software Documentation: The Practitioners’ Perspective. In Proceedings of the 42nd International Conference on Software Engineering(ICSE ’20). IEEE, 590–601.",
      "doi": "10.1145/3377811.3380405"
    },
    {
      "text": "Emad Aghajani, Csaba Nagy, Olga Lucero Vega-Márquez, Mario Linares-Vásquez, Laura Moreno, Gabriele Bavota, and Michele Lanza. 2019. Software Documentation Issues Unveiled. In Proceedings of the 41st International Conference on Software Engineering(ICSE ’19). IEEE, 1199–1210.",
      "doi": "10.1109/ICSE.2019.00122"
    },
    {
      "text": "Hala Assal and Sonia Chiasson. 2018. Security in the Software Development Lifecycle. In Proceedings of the 14th Symposium on Usable Privacy and Security(SOUPS ’18). USENIX Association, 281–296.",
      "doi": ""
    },
    {
      "text": "Hala Assal and Sonia Chiasson. 2019. “Think Secure from the Beginning”: A Survey with Software Developers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, 1–13.",
      "doi": "10.1145/3290605.3300519"
    },
    {
      "text": "Wei Bai, Omer Akgul, and Michelle L Mazurek. 2019. A Qualitative Investigation of Insecure Code Propagation from Online Forums. In Proceedings of the 2019 IEEE Cybersecurity Development(SecDev ’19). IEEE, 34–48.",
      "doi": ""
    },
    {
      "text": "Bailey, Michael and Dittrich, David and Kenneally, Erin and Maughan, Doug. 2012. The Menlo Report. IEEE Security and Privacy 10, 2 (Mar 2012), 71–75.",
      "doi": ""
    },
    {
      "text": "Ashley A. Bush, Amrit Tiwana, and Hiroshi Tsuji. 2008. An empirical investigation of the drivers of software outsourcing decisions in Japanese organizations. Information and Software Technology 50, 6 (2008), 499–510. https://doi.org/10.1016/j.infsof.2007.08.006",
      "doi": "10.1016/j.infsof.2007.08.006"
    },
    {
      "text": "Carnegie Mellon University. 2022. SEI CERT Coding Standards - CERT Secure Coding - Confluence. https://wiki.sei.cmu.edu/confluence/display/seccode",
      "doi": ""
    },
    {
      "text": "Dennis Child. 1990. The Essentials of Factor Analysis. Cassell Educational.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A Coefficient of Agreement for Nominal Scales. Educational and psychological measurement 20, 1 (1960), 37–46.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 2013. Statistical power analysis for the behavioral sciences. Routledge.",
      "doi": ""
    },
    {
      "text": "Jens Dibbern, Tim Goles, Rudy Hirschheim, and Bandula Jayatilaka. 2004. Information Systems Outsourcing: A Survey and Analysis of the Literature. SIGMIS Database 35, 4 (2004), 6–102.",
      "doi": "10.1145/1035233.1035236"
    },
    {
      "text": "Tiago Espinha Gasiba, Ulrike Lechner, Maria Pinto-Albuquerque, and Daniel Mendez Fernandez. 2020. Awareness of Secure Coding Guidelines in the Industry - A First Data Analysis. In Proceedings of the 2020 IEEE 19th International Conference on Trust, Security and Privacy in Computing and Communications(TrustCom ’20). IEEE, 345–352.",
      "doi": ""
    },
    {
      "text": "Tiago Espinha Gasiba, Ulrike Lechner, Maria Pinto-Albuquerque, and Daniel Méndez. 2021. Is Secure Coding Education in the Industry Needed? An Investigation Through a Large Scale Survey. In Proceedings of the 2021 IEEE/ACM 43rd International Conference on Software Engineering: Software Engineering Education and Training(ICSE-JSEET ’21). IEEE, 241–252.",
      "doi": "10.1109/ICSE-SEET52601.2021.00034"
    },
    {
      "text": "Leandre R Fabrigar, Duane T Wegener, Robert C MacCallum, and Erin J Strahan. 1999. Evaluating the use of exploratory factor analysis in psychological research. Psychological methods 4, 3 (1999), 272.",
      "doi": ""
    },
    {
      "text": "Felix Fischer, Konstantin Böttinger, Huang Xiao, Christian Stransky, Yasemin Acar, Michael Backes, and Sascha Fahl. 2017. Stack Overflow Considered Harmful? The Impact of Copy&Paste on Android Application Security. In Proceedings of the 2017 IEEE Symposium on Security and Privacy(S&P ’17). IEEE, 121–136.",
      "doi": ""
    },
    {
      "text": "Flynn Wolf and Adam J. Aviv and Ravi Kuber. 2021. Security Obstacles and Motivations for Small Businesses from a CISO’s Perspective. In Proceedings of the 30th USENIX Security Symposium(SEC ’21). USENIX Association, 1199–1216.",
      "doi": ""
    },
    {
      "text": "Peter Leo Gorski, Luigi Lo Iacono, Dominik Wermke, Christian Stransky, Sebastian Moeller, Yasemin Acar, and Sascha Fahl. 2018. Developers Deserve Security Warnings, Too: On the Effect of Integrated Security Advice on Cryptographic API Misuse. In Proceedings of the 14th Symposium on Usable Privacy and Security(SOUPS ’18). USENIX Association, 265–281.",
      "doi": ""
    },
    {
      "text": "Matthew Green and Matthew Smith. 2016. Developers are Not the Enemy!: The Need for Usable Security APIs. IEEE Security & Privacy 14, 5 (2016), 40–46.",
      "doi": "10.1109/MSP.2016.111"
    },
    {
      "text": "Marco Gutfleisch, Jan H Klemmer, Niklas Busch, Yasemin Acar, M Angela Sasse, Sascha Fahl, Dominik Wermke, Nicolas Huaman, Christian Stransky, and Alexander Krause. 2022. How Does Usable Security (Not) End Up in Software Products? Results From a Qualitative Interview Study. In Proceedings of the 43rd IEEE Symposium on Security and Privacy, IEEE S&P(S&P ’22). 22–26.",
      "doi": ""
    },
    {
      "text": "Julie M Haney, Mary Theofanos, Yasemin Acar, and Sandra Spickard Prettyman. 2018. “We make it a big deal in the company”: Security Mindsets in Organizations that Develop Cryptographic Products. In Proceedings of the Fourteenth Symposium on Usable Privacy and Security(SOUPS ’18). 357–373.",
      "doi": ""
    },
    {
      "text": "Brent Dale Hill. 2011. Sequential Kaiser-meyer-olkin Procedure as an Alternative for Determining the Number of Factors in Common-factor Analysis: a Monte Carlo Simulation. Ph. D. Dissertation. Oklahoma State University.",
      "doi": ""
    },
    {
      "text": "Luigi Lo Iacono and Peter Leo Gorski. 2017. I Do and I Understand. Not Yet True for Security APIs. So Sad. In Proceedings of the 2nd European Workshop on Usable Security(EuroUSEC ’17).",
      "doi": ""
    },
    {
      "text": "Fumihiro Kanei, Ayako Akiyama Hasegawa, Eitaro Shioji, and Mitsuaki Akiyama. 2021. A Cross-Role and Bi-National Analysis on Security Efforts and Constraints of Software Development Projects. In Proceedings of the Annual Computer Security Applications Conference(ACSAC ’21). ACM, 349–364.",
      "doi": "10.1145/3485832.3485922"
    },
    {
      "text": "J Richard Landis and Gary G Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics (1977), 159–174.",
      "doi": ""
    },
    {
      "text": "Tamara Lopez, Helen Sharp, Thein Tun, Arosha Bandara, Mark Levine, and Bashar Nuseibeh. 2019. “Hopefully We Are Mostly Secure”: Views on Secure Code in Professional Practice. In Proceedings of the 12th International Workshop on Cooperative and Human Aspects of Software Engineering(CHASE ’19). 61–68.",
      "doi": "10.1109/CHASE.2019.00023"
    },
    {
      "text": "Macromill Group. 2020.. https://group.macromill.com/",
      "doi": ""
    },
    {
      "text": "Ministry of Internal Affairs and Communications. 2018. (In Japanese). https://www.soumu.go.jp/johotsusintokei/whitepaper/ja/h30/html/nd113110.html",
      "doi": ""
    },
    {
      "text": "Daniela Seabra Oliveira, Tian Lin, Muhammad Sajidur Rahman, Rad Akefirad, Donovan Ellis, Eliany Perez, Rahul Bobhate, Lois A. DeLong, Justin Cappos, Yuriy Brun, and Natalie C. Ebner. 2018. API Blindspots: Why Experienced Developers Write Vulnerable Code. In Proceedings of the 14th Symposium on Usable Privacy and Security(SOUPS ’18). USENIX Association, 315–328.",
      "doi": ""
    },
    {
      "text": "Open Web Application Security Project. 2022. OWASP Application Security Verification Standard. https://owasp.org/www-project-application-security-verification-standard/",
      "doi": ""
    },
    {
      "text": "OWASP. 2022. OWASP SAMM. https://owaspsamm.org/",
      "doi": ""
    },
    {
      "text": "Hernan Palombo, Armin Ziaie Tabari, Daniel Lende, Jay Ligatti, and Xinming Ou. 2020. An Ethnographic Understanding of Software (In)Security and a Co-Creation Model to Improve Secure Software Development. In Proceedings of the 16th Symposium on Usable Privacy and Security(SOUPS ’20). USENIX Association, 205–220.",
      "doi": ""
    },
    {
      "text": "Nikhil Patnaik, Joseph Hallett, and Awais Rashid. 2019. Usability Smells: An Analysis of Developers’ Struggle with Crypto Libraries. In Proceedings of the 15th Symposium on Usable Privacy and Security(SOUPS ’19). USENIX Association, 245–257.",
      "doi": ""
    },
    {
      "text": "Peter Peduzzi, John Concato, Elizabeth Kemper, Theodore R Holford, and Alvan R Feinstein. 1996. A Simulation Study of the Number of Events per Variable in Logistic Regression Analysis. Journal of clinical epidemiology 49, 12 (1996), 1373–1379.",
      "doi": ""
    },
    {
      "text": "Andreas Poller, Laura Kocksch, Sven Türpe, Felix Anand Epp, and Katharina Kinder-Kurlanda. 2017. Can Security Become a Routine?: A Study of Organizational Change in an Agile Software Development Group. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing(CSCW ’17). 2489–2503.",
      "doi": "10.1145/2998181.2998191"
    },
    {
      "text": "D. Rodríguez, M. A. Sicilia, E. García, and R. Harrison. 2012. Empirical Findings on Team Size and Productivity in Software Development. Journal of Systems and Software 85, 3 (2012), 562–570.",
      "doi": "10.1016/j.jss.2011.09.009"
    },
    {
      "text": "Yukiko Sawaya, Mahmood Sharif, Nicolas Christin, Ayumu Kubota, Akihiro Nakarai, and Akira Yamada. 2017. Self-Confidence Trumps Knowledge: A Cross-Cultural Study of Security Behavior. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17).",
      "doi": "10.1145/3025453.3025926"
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How WEIRD is CHI?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). ACM, Article 143, 14 pages.",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "Mohammad Tahaei and Kami Vaniea. 2019. A Survey on Developer-Centred Security. In Proceedings of the 4th European Workshop on Usable Security(EuroUSEC ’19). IEEE, 129–138.",
      "doi": ""
    },
    {
      "text": "Mohammad Tahaei and Kami Vaniea. 2022. Recruiting Participants With Programming Skills: A Comparison of Four Crowdsourcing Platforms and a CS Student Mailing List. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI’22).",
      "doi": "10.1145/3491102.3501957"
    },
    {
      "text": "Mohammad Tahaei, Kami Vaniea, Konstantin Beznosov, and Maria K Wolters. 2021. Security Notifications in Static Analysis Tools: Developers’ Attitudes, Comprehension, and Ability to Act on Them. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). ACM, Article 691.",
      "doi": "10.1145/3411764.3445616"
    },
    {
      "text": "Tyler W. Thomas, Madiha Tabassum, Bill Chu, and Heather Lipford. 2018. Security During Application Development: An Application Security Expert Perspective. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, 1–12.",
      "doi": "10.1145/3173574.3173836"
    },
    {
      "text": "Anwesh Tuladhar, Daniel Lende, Jay Ligatti, and Xinming Ou. 2021. An Analysis of the Role of Situated Learning in Starting a Security Culture in a Software Company. In Proceedings of the 16th Symposium on Usable Privacy and Security(SOUPS ’21). USENIX Association, 617–632.",
      "doi": ""
    },
    {
      "text": "Martin Ukrop and Vashek Matyas. 2018. Why Johnny the Developer Can’t Work with Public Key Certificates: An Experimental Study of OpenSSL Usability. In Topics in Cryptology – CT-RSA 2018: The Cryptographers’ Track at the RSA Conference 2018. Springer, 45–64.",
      "doi": ""
    },
    {
      "text": "Eric Vittinghoff and Charles E McCulloch. 2007. Relaxing the Rule of Ten Events per Variable in Logistic and Cox Regression. American journal of epidemiology 165, 6 (2007), 710–718.",
      "doi": ""
    },
    {
      "text": "Marley W Watkins. 2018. Exploratory Factor Analysis: A Guide to Best Practice. Journal of Black Psychology 44, 3 (2018), 219–246.",
      "doi": ""
    },
    {
      "text": "Charles Weir, Ingolf Becker, and Lynne Blair. 2021. A Passion for Security: Intervening to Help Software Developers. In 2021 IEEE/ACM 43rd International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP). 21–30. https://doi.org/10.1109/ICSE-SEIP52600.2021.00011",
      "doi": "10.1109/ICSE-SEIP52600.2021.00011"
    },
    {
      "text": "Jim Witschey, Olga Zielinska, Allaire Welk, Emerson Murphy-Hill, Chris Mayhorn, and Thomas Zimmermann. 2015. Quantifying Developers’ Adoption of Security Tools. In Proceedings of the 2015 10th Joint Meeting on Foundations of Software Engineering(ESEC/FSE ’15). ACM, 260–271.",
      "doi": "10.1145/2786805.2786816"
    },
    {
      "text": "Shundan Xiao, Jim Witschey, and Emerson Murphy-Hill. 2014. Social Influences on Secure Development Tool Adoption: Why Security Tools Spread. In Proceedings of the 2014 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’14). ACM, 1095–1106.",
      "doi": "10.1145/2531602.2531722"
    },
    {
      "text": "Jing Xie, Heather Richter Lipford, and Bill Chu. 2011. Why do programmers make security errors?. In Proceedings of the 2011 IEEE Symposium on Visual Languages and Human-Centric Computing(VL/HCC ’11). IEEE.",
      "doi": ""
    },
    {
      "text": "Xin-Li Yang, David Lo, Xin Xia, Zhi-Yuan Wan, and Jian-Ling Sun. 2016. What Security Questions Do Developers Ask? A Large-Scale Study of Stack Overflow Posts. Journal of Computer Science and Technology 31, 5 (2016), 910–924.",
      "doi": ""
    },
    {
      "text": "Tianyi Zhang, Ganesha Upadhyaya, Anastasia Reinhardt, Hridesh Rajan, and Miryung Kim. 2018. Are Online Code Examples Reliable ? An Empirical Study of API Misuse on Stack Overflow. In Proceedings of the 2018 IEEE/ACM 40th International Conference on Software Engineering(ICSE ’18). IEEE, 886–896.",
      "doi": ""
    }
  ]
}