{
  "doi": "10.1145/3544548.3580875",
  "title": "Felt Ethics: Cultivating Ethical Sensibility in Design Practice",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "We theoretically develop the ethical positions implicit in somaesthetic interaction design and, using the case study of a water faucet, illustrate our conceptual understanding of ethical sensibilities in design. We apply four lenses – the felt self, intercorporeal self, socio-cultural and political self, and entangled self – to show how our selves and ethical sensibilities are fundamentally constituted by a socially, materially, and technologically entwined world. Further, we show how ethical sensibilities are cultivated in the practice of somaesthetic interaction design. We contribute felt ethics as an approach to cultivating ethical sensibilities in design practice. The felt ethics approach is comprised of (i) a processual cultivation of ethical sensibility through analytical, pragmatic, and practical engagement, (ii) an ongoing critical attentiveness to the limits of our own bodies and lived experiences, and (iii) the rendering visible of our ethical practices as a matter of care.",
  "authors": [
    {
      "name": "Rachael Garrett",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-99660009110/rel-imgonly/rachaelg-6.jpg",
      "acmid": "99660009110",
      "orcid": "0000-0002-4162-9206"
    },
    {
      "name": "Kristina Popova",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236614",
      "orcid": "0000-0002-4320-4578"
    },
    {
      "name": "Claudia Núñez-Pacheco",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758692457",
      "orcid": "0000-0001-7454-8659"
    },
    {
      "name": "Thorhildur Asgeirsdottir",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660566202",
      "orcid": "0000-0001-6640-2254"
    },
    {
      "name": "Airi Lampinen",
      "institution": "Department of Computer and Systems Sciences, Stockholm University, Sweden",
      "img": "/do/10.1145/contrib-81430677521/rel-imgonly/2014-09-1710.28.00.jpg",
      "acmid": "81430677521",
      "orcid": "0000-0002-9100-3826"
    },
    {
      "name": "Kristina Höök",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    }
  ],
  "references": [
    {
      "text": "Tony E Adams, Carolyn Ellis, and Stacy Holman Jones. 2017. Autoethnography. The international encyclopedia of communication research methods (2017), 1–11.",
      "doi": ""
    },
    {
      "text": "Sara Ahmed. 2017. Living a Feminist Life. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Cheryl Akner-Koler and Parivash Ranjbar. 2016. Integrating Sensitizing Labs in an Educational Design Process for Haptic Interaction. FormAkademisk 9, 2 (2016).",
      "doi": ""
    },
    {
      "text": "Stacy Alaimo. 2018. Trans-corporeality. Posthuman glossary (2018), 435–438.",
      "doi": ""
    },
    {
      "text": "Miquel Alfaras, Vasiliki Tsaknaki, Pedro Sanches, Charles Windlin, Muhammad Umair, Corina Sas, and Kristina Höök. 2020. From biodata to somadata. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376684"
    },
    {
      "text": "Elizabeth Anderson. 2019. Dewey’s Moral Philosophy. In The Stanford Encyclopedia of Philosophy (Winter 2019 ed.), Edward N. Zalta (Ed.). Metaphysics Research Lab, Stanford University.",
      "doi": ""
    },
    {
      "text": "Thorhildur Asgeirsdottir and Rob Comber. 2023. Making Energy Matter: Soma Design for Ethical Relations in Energy Systems. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3544548.3581160"
    },
    {
      "text": "Madeline Balaam, Rob Comber, Rachel E Clarke, Charles Windlin, Anna Ståhl, Kristina Höök, and Geraldine Fitzpatrick. 2019. Emotion work in experience-centered design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300832"
    },
    {
      "text": "Karen Barad. 2007. Meeting the universe halfway: Quantum physics and the entanglement of matter and meaning. duke university Press.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is\" critical\" about critical design?. In Proceedings of the SIGCHI conference on human factors in computing systems. 3297–3306.",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Marian Barnes. 2012. Care in everyday life: An ethic of care in practice. Policy Press.",
      "doi": ""
    },
    {
      "text": "Robert C Bartlett, Susan D Collins, 2011. Aristotle’s Nicomachean ethics. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2(2005), 149–173.",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the sigchi conference on human factors in computing systems. 2005–2014.",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Ruha Benjamin. 2019. Race after technology: Abolitionist tools for the new jim code. Social forces (2019).",
      "doi": ""
    },
    {
      "text": "Jane Bennett. 2010. Vibrant matter: A political ecology of things. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Renato Bernasconi. 2022. Emancipatory Ways of Feeling (the Body as a Subversive Project). Diseña20(2022), Editorial–Editorial.",
      "doi": ""
    },
    {
      "text": "Michel Bitbol and Claire Petitmengin. 2017. Neurophenomenology and the microphenomenological interview. The Blackwell companion to consciousness 2 (2017), 726–739.",
      "doi": ""
    },
    {
      "text": "Pierre Bourdieu. 1979. Distinction. Routledge & Kegan Paul Ltd.",
      "doi": ""
    },
    {
      "text": "Glynis M Breakwell. 2006. Using self-recording: Diary and narrative methods. Research methods in psychology 3 (2006), 254–272.",
      "doi": ""
    },
    {
      "text": "William Bristow. 2017. Enlightenment. In The Stanford Encyclopedia of Philosophy (Fall 2017 ed.), Edward N. Zalta (Ed.). Metaphysics Research Lab, Stanford University.",
      "doi": ""
    },
    {
      "text": "Richard Buchanan. 1992. Wicked problems in design thinking. Design issues 8, 2 (1992), 5–21.",
      "doi": ""
    },
    {
      "text": "Karen Anne Cochrane, Kristina Mah, Anna Ståhl, Claudia Núñez-Pacheco, Madeline Balaam, Naseem Ahmadpour, and Lian Loke. 2022. Body Maps: A Generative Tool for Soma-based Design. ACM International Conference Proceeding Series. https://doi.org/10.1145/3490149.3502262",
      "doi": "10.1145/3490149.3502262"
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Kate Crawford. 2021. The atlas of AI: Power, politics, and the planetary costs of artificial intelligence. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Antonio R Damasio. 2006. Descartes’ error. Random House.",
      "doi": ""
    },
    {
      "text": "Maria Puig de La Bellacasa. 2017. Matters of care: Speculative ethics in more than human worlds. Vol. 41. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "John Dewey. 1958. Experience and nature. Vol. 471. Courier Corporation.",
      "doi": ""
    },
    {
      "text": "John Dewey. 2005. Art as experience. Penguin.",
      "doi": ""
    },
    {
      "text": "Paul Dourish, Janet Finlay, Phoebe Sengers, and Peter Wright. 2004. Reflective HCI: Towards a critical technical practice. In CHI’04 extended abstracts on Human factors in computing systems. 1727–1728.",
      "doi": ""
    },
    {
      "text": "Joanne Entwistle. 2015. The fashioned body: Fashion, dress and social theory. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Sara Eriksson, Kristina Höök, Richard Shusterman, Dag Svanes, Carl Unander-Scharin, and Åsa Unander-Scharin. 2020. Ethics in Movement: Shaping and Being Shaped in Human-Drone Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376678"
    },
    {
      "text": "Sara Eriksson, Åsa Unander-Scharin, Vincent Trichon, Carl Unander-Scharin, Hedvig Kjellström, and Kristina Höök. 2019. Dancing with drones: Crafting novel artistic expressions through intercorporeality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300847"
    },
    {
      "text": "Arturo Escobar. 2018. Designs for the Pluriverse. In Designs for the Pluriverse. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. 2008. The interaction design research triangle of design practice, design studies, and design exploration. Design issues 24, 3 (2008), 4–18.",
      "doi": ""
    },
    {
      "text": "Silvia Federici. 2011. Feminism and the politics of the commons. na.",
      "doi": ""
    },
    {
      "text": "Laura Forlano. 2016. Hacking the feminist body. Journal of Peer Production 8 (2016).",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 1990. The history of sexuality: An introduction. Vintage.",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 2012. The birth of the clinic. Routledge.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger. 2019. Entanglement HCI the next wave?ACM Transactions on Computer-Human Interaction (TOCHI) 27, 1(2019), 1–27.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Marjo Rauhala, and Geraldine Fitzpatrick. 2017. In-action ethics. Interacting with Computers 29, 2 (2017), 220–236.",
      "doi": ""
    },
    {
      "text": "Eugene T Gendlin. 1986. Process ethics and the political question. In The Moral Sense in the Communal Significance of Life. Springer, 265–275.",
      "doi": ""
    },
    {
      "text": "Maliheh Ghajargar, Jeffrey Bardzell, Alison Smith Renner, Peter Gall Krogh, Kristina Höök, David Cuartielles, Laurens Boer, and Mikael Wiberg. 2021. From” explainable ai” to” graspable ai”. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–4.",
      "doi": "10.1145/3430524.3442704"
    },
    {
      "text": "Maliheh Ghajargar, Jeffrey Bardzell, Alison Marie Smith-Renner, Kristina Höök, and Peter Gall Krogh. 2022. Graspable AI: Physical Forms as Explanation Modality for Explainable AI. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–4.",
      "doi": "10.1145/3490149.3503666"
    },
    {
      "text": "Carol Gilligan. 1993. In a different voice: Psychological theory and women’s development. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Colin M Gray and Elizabeth Boling. 2016. Inscribing ethics and values in designs for learning: a problematic. Educational technology research and development 64, 5(2016), 969–1001.",
      "doi": ""
    },
    {
      "text": "Elizabeth Grosz. 1994. Volatile bodies : toward a corporeal feminism. Allen and Unwin St. Leonards, N.S.W.",
      "doi": ""
    },
    {
      "text": "Elizabeth Grosz. 2020. Sexual subversions. Routledge.",
      "doi": ""
    },
    {
      "text": "Garry Hagberg. 2014. Wittgenstein’s Aesthetics. In The Stanford Encyclopedia of Philosophy (Fall 2014 ed.), Edward N. Zalta (Ed.). Metaphysics Research Lab, Stanford University.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2020. Situated knowledges: The science question in feminism and the privilege of partial perspective. In Feminist theory reader. Routledge, 303–310.",
      "doi": ""
    },
    {
      "text": "Donna J Haraway. 2016. Staying with the trouble: Making kin in the Chthulucene. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Virginia Held 2006. The ethics of care: Personal, political, and global. Oxford University Press on Demand.",
      "doi": ""
    },
    {
      "text": "Karey Helms. 2022. A Speculative Ethics for Designing with Bodily Fluids. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–11.",
      "doi": "10.1145/3491101.3516395"
    },
    {
      "text": "Karey Helms and Ylva Fernaeus. 2021. Troubling Care: Four Orientations for Wickedness in Design. In Designing Interactive Systems Conference 2021. 789–801.",
      "doi": ""
    },
    {
      "text": "Arlie Russell Hochschild. 2015. The managed heart. In Working in America. Routledge, 47–54.",
      "doi": ""
    },
    {
      "text": "Sarah Homewood, Marika Hedemyr, Maja Fagerberg Ranten, and Susan Kozel. 2021. Tracing conceptions of the body in HCI: From user to more-than-human. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445656"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the body: Somaesthetic interaction design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Steve Benford, Paul Tennent, Vasiliki Tsaknaki, Miquel Alfaras, Juan Martinez Avila, Christine Li, Joseph Marshall, Claudia Daudén Roquet, Pedro Sanches, 2021. Unpacking non-dualistic design: The soma design case. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 6(2021), 1–36.",
      "doi": "10.1145/3462448"
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline CM Hummels, Katherine Isbister, Martin Jonsson, George Khut, 2018. Embracing first-person perspectives in soma-based design. In Informatics, Vol. 5. MDPI, 8.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Sara Eriksson, Marie Louise Juul Søndergaard, Marianela Ciolfi Felice, Nadia Campo Woytuk, Ozgun Kilic Afsar, Vasiliki Tsaknaki, and Anna Ståhl. 2019. Soma Design and Politics of the Body. In Proceedings of the Halfway to the Future Symposium 2019. Association for Computing Machinery.",
      "doi": "10.1145/3363384.3363385"
    },
    {
      "text": "Kristina Höök, Martin Jonsson, Anna Ståhl, Jakob Tholander, Toni Robertson, Patrizia Marti, Dag Svanaes, Marianne Graves Petersen, Jodi Forlizzi, Thecla Schiphorst, 2016. Move to be Moved. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3301–3308.",
      "doi": "10.1145/2851581.2856470"
    },
    {
      "text": "Kristina Höök, Martin P Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic appreciation design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3131–3142.",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Noura Howell, Audrey Desjardins, and Sarah Fox. 2021. Cracks in the success narrative: Rethinking failure in design research through a retrospective trioethnography. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 6(2021), 1–31.",
      "doi": "10.1145/3462447"
    },
    {
      "text": "Tim Ingold and Jo Lee Vergunst. 2008. Ways of walking: Ethnography and practice on foot. Ashgate Publishing, Ltd.",
      "doi": ""
    },
    {
      "text": "Asle H Kiran. 2015. Four dimensions of technological mediation. Postphenomenological investigations 123 (2015), 123–140.",
      "doi": ""
    },
    {
      "text": "Paul Komesaroff. 2008. Experiments in love and death: medicine, postmodernism, microethics and the body. Melbourne Univ. Publishing.",
      "doi": ""
    },
    {
      "text": "Joseph La Delfa, Mehmet Aydin Baytas, Rakesh Patibanda, Hazel Ngari, Rohit Ashok Khot, and Florian’Floyd’ Mueller. 2020. Drone chi: Somaesthetic human-drone interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376786"
    },
    {
      "text": "Wonjun Lee, Youn-kyung Lim, and Richard Shusterman. 2014. Practicing somaesthetics: exploring its impact on interactive product design ideation. In Proceedings of the 2014 conference on Designing interactive systems. 1055–1064.",
      "doi": "10.1145/2598510.2598561"
    },
    {
      "text": "Lian Loke and Claudia Núñez-Pacheco. 2018. Developing somatic sensibilities for practices of discernment in interaction design. The Senses and Society 13, 2 (2018), 219–231. https://doi.org/10.1080/17458927.2018.1468690 arXiv:https://doi.org/10.1080/17458927.2018.1468690",
      "doi": ""
    },
    {
      "text": "Jonas Löwgren and Erik Stolterman. 2004. Thoughtful interaction design: A design perspective on information technology. Mit Press.",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Maurice Merleau-Ponty. 1968. The visible and the invisible: Followed by working notes. Northwestern University Press.",
      "doi": ""
    },
    {
      "text": "Maurice Merleau-Ponty. 2013. Phenomenology of perception. Routledge.",
      "doi": ""
    },
    {
      "text": "Christian Meyer, Jürgen Streeck, and J Scott Jordan. 2017. Intercorporeality: Emerging socialities in interaction. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O’Donnell, and John Vines. 2015. Situational ethics: Re-thinking approaches to formal ethics requirements for human-computer interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 105–114.",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "Harold G Nelson and Erik Stolterman. 2014. The design way: Intentional change in an unpredictable world. MIT press.",
      "doi": "10.5555/2380996"
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical design in HCI research: designing and learning through use-it-yourself. In Proceedings of the Designing Interactive Systems Conference. 514–523.",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Claudia Núñez-Pacheco and Lian Loke. 2022. Focusing for Interaction Design: An Introspective Somatic Method. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbæk. 2022. Counterfactual thinking: What theories do in design. International Journal of Human–Computer Interaction 38, 1(2022), 78–92.",
      "doi": ""
    },
    {
      "text": "Michael Polanyi. 1967. The tacit dimension. Garden City, New York 217 (1967).",
      "doi": ""
    },
    {
      "text": "Kristina Popova, Rachael Garrett, Claudia Núñez-Pacheco, Airi Lampinen, and Kristina Höök. 2022. Vulnerability as an ethical stance in soma design processes. In CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3491102.3501994"
    },
    {
      "text": "Johan Redstrom. 2017. Making design theory. MIT Press.",
      "doi": ""
    },
    {
      "text": "Robert Rosenberger and Peter PCC Verbeek. 2015. Postphenomenological investigations: essays on human-technology relations. Lexington Books.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Noura Howell, Vasiliki Tsaknaki, Tom Jenkins, and Karey Helms. 2022. Diffraction-in-action: Designerly Explorations of Agential Realism Through Lived Data. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst. 2011. Self-evidence: applying somatic connoisseurship to experience design. In CHI’11 extended abstracts on human factors in computing systems. 145–160.",
      "doi": ""
    },
    {
      "text": "Donald A Schon. 1979. The reflective practitioner. New York (1979).",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph’Jofish’ Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility. 49–58.",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Phoebe Sengers, John McCarthy, and Paul Dourish. 2006. Reflective HCI: articulating an agenda for critical practice. In CHI’06 extended abstracts on Human factors in computing systems. 1683–1686.",
      "doi": ""
    },
    {
      "text": "Maxine Sheets-Johnstone. 2008. The roots of morality. Penn State Press.",
      "doi": ""
    },
    {
      "text": "Maxine Sheets-Johnstone. 2011. The primacy of movement. Vol. 82. John Benjamins Publishing.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2008. Body consciousness: A philosophy of mindfulness and somaesthetics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2012. Thinking through the body: Essays in somaesthetics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2018. Performing live. In Performing Live. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Emeline Brulé, Christopher Frauenberger, Gilles Bailly, and Geraldine Fitzpatrick. 2018. Micro-ethics for participatory design with marginalised children. In Proceedings of the 15th Participatory Design Conference: Full Papers-Volume 1. 1–12.",
      "doi": "10.1145/3210586.3210603"
    },
    {
      "text": "Anna Ståhl, Madeline Balaam, Rob Comber, Pedro Sanches, and Kristina Höök. 2022. Making New Worlds–Transformative Becomings with Soma Design. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3491102.3502018"
    },
    {
      "text": "Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, Kristina Höök, and Eva-Carin Banka Johnson. 2016. The soma mat and breathing light. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 305–308.",
      "doi": "10.1145/2851581.2889464"
    },
    {
      "text": "Anna Ståhl, Vasiliki Tsaknaki, and Madeline Balaam. 2021. Validity and Rigour in Soma Design-Sketching with the Soma. ACM Trans. Comput.-Hum. Interact. 28, 6, Article 38 (dec 2021), 36 pages. https://doi.org/10.1145/3470132",
      "doi": "10.1145/3470132"
    },
    {
      "text": "Lucy Suchman and Lucy A Suchman. 2007. Human-machine reconfigurations: Plans and situated actions. Cambridge university press.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Dag Svanæs and Louise Barkhuus. 2020. The designer’s body as resource in design: Exploring combinations of point-of-view and tense. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376430"
    },
    {
      "text": "Dag Svanaes and Martin Solheim. 2016. Wag your tail and flap your ears: The kinesthetic user experience of extending your body. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3778–3779.",
      "doi": "10.1145/2851581.2890268"
    },
    {
      "text": "Paul Tennent, Kristina Höök, Steve Benford, Vasiliki Tsaknaki, Anna Ståhl, Claudia Dauden Roquet, Charles Windlin, Pedro Sanches, Joe Marshall, Christine Li, 2021. Articulating Soma Experiences using Trajectories. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445482"
    },
    {
      "text": "Benjamin R Tilghman. 1991. Wittgenstein, ethics, and aesthetics: The view from eternity. SUNY Press.",
      "doi": ""
    },
    {
      "text": "Joan C Tronto. 1995. Women and Caring: What Can Feminists Learn About Morality from Caring?[1989]. In Justice and care. Routledge, 101–116.",
      "doi": ""
    },
    {
      "text": "Joan C Tronto. 1998. An Ethic of Care. Generations: Journal of the American Society on Aging 22, 3 (1998), 15–20. http://www.jstor.org/stable/44875693",
      "doi": ""
    },
    {
      "text": "Joan C Tronto. 2020. Moral boundaries: A political argument for an ethic of care. Routledge.",
      "doi": ""
    },
    {
      "text": "Vasiliki Tsaknaki, Madeline Balaam, Anna Ståhl, Pedro Sanches, Charles Windlin, Pavel Karpashevich, and Kristina Höök. 2019. Teaching soma design. In Proceedings of the 2019 on Designing Interactive Systems Conference. 1237–1249.",
      "doi": "10.1145/3322276.3322327"
    },
    {
      "text": "Francisco J Varela. 1999. Ethical know-how: Action, wisdom, and cognition. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2008. Cyborg intentionality: Rethinking the phenomenology of human–technology relations. Phenomenology and the Cognitive Sciences 7, 3 (2008), 387–395.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2008. Morality in design: Design ethics and the morality of technological artifacts. In Philosophy and design. Springer, 91–103.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary. 2021. Things we could design: For more than human-centered worlds. MIT press.",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Anna Vallgårda, and Oscar Tomico. 2017. Embodied design ideation methods: analysing the power of estrangement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5158–5170.",
      "doi": "10.1145/3025453.3025873"
    },
    {
      "text": "Langdon Winner. 1980. Do Artifacts Have Politics?Daedalus 109, 1 (1980), 121–136.",
      "doi": ""
    },
    {
      "text": "Ludwig Wittgenstein. 1966. Lectures & conversations on aesthetics, psychology, and religious belief. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Ludwig Wittgenstein. 2013. Tractatus logico-philosophicus. Routledge.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems. 493–502.",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}