{
  "doi": "10.1145/3544548.3581302",
  "title": "ImageAssist: Tools for Enhancing Touchscreen-Based Image Exploration Systems for Blind and Low Vision Users",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Blind and low vision (BLV) users often rely on alt text to understand what a digital image is showing. However, recent research has investigated how touch-based image exploration on touchscreens can supplement alt text. Touchscreen-based image exploration systems allow BLV users to deeply understand images while granting a strong sense of agency. Yet, prior work has found that these systems require a lot of effort to use, and little work has been done to explore these systems’ bottlenecks on a deeper level and propose solutions to these issues. To address this, we present ImageAssist, a set of three tools that assist BLV users through the process of exploring images by touch — scaffolding the exploration process. We perform a series of studies with BLV users to design and evaluate ImageAssist, and our findings reveal several implications for image exploration tools for BLV users.",
  "authors": [
    {
      "name": "Vishnu Nair",
      "institution": "Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659587472",
      "orcid": "0000-0002-2071-9595"
    },
    {
      "name": "Hanxiu 'Hazel' Zhu",
      "institution": "Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780619",
      "orcid": "0000-0003-0777-6090"
    },
    {
      "name": "Brian A. Smith",
      "institution": "Columbia University, United States",
      "img": "/do/10.1145/contrib-99659562550/rel-imgonly/brian_a_smith__small_.png",
      "acmid": "99659562550",
      "orcid": "0000-0003-2540-0839"
    }
  ],
  "references": [
    {
      "text": "Dragan Ahmetovic, Nahyun Kwon, Uran Oh, Cristian Bernareggi, and Sergio Mascetti. 2021. Touch Screen Exploration of Visual Artwork for Blind People. In Proceedings of the Web Conference 2021(WWW ’21). Association for Computing Machinery, New York, NY, USA, 2781–2791. https://doi.org/10.1145/3442381.3449871",
      "doi": "10.1145/3442381.3449871"
    },
    {
      "text": "Cynthia L. Bennett, Cole Gleason, Morgan Klaus Scheuerman, Jeffrey P. Bigham, Anhong Guo, and Alexandra To. 2021. “It’s Complicated”: Negotiating Accessibility and (Mis)Representation in Image Descriptions of Race, Gender, and Disability. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–19. https://doi.org/10.1145/3411764.3445498",
      "doi": "10.1145/3411764.3445498"
    },
    {
      "text": "Shuhan Chen, Xiuli Tan, Ben Wang, Huchuan Lu, Xuelong Hu, and Yun Fu. 2020. Reverse Attention-Based Residual Network for Salient Object Detection. IEEE Transactions on Image Processing 29 (2020), 3763–3776. https://doi.org/10.1109/TIP.2020.2965989",
      "doi": "10.1109/TIP.2020.2965989"
    },
    {
      "text": "Devin Coldeway. 2022. Dot Pad Tactile Display Makes Images Touchable for Visually Impaired Users. https://techcrunch.com/2022/03/10/dot-pad-tactile-display-makes-images-touchable-for-visually-impaired-users/.",
      "doi": ""
    },
    {
      "text": "W3 Consortium. 2016. Non-Text Content | Understanding Success Criterion 1.1.1. https://www.w3.org/TR/UNDERSTANDING-WCAG20/text-equiv-all.html.",
      "doi": ""
    },
    {
      "text": "Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. 2009. ImageNet: A Large-Scale Hierarchical Image Database. In 2009 IEEE Conference on Computer Vision and Pattern Recognition. 248–255. https://doi.org/10.1109/CVPR.2009.5206848",
      "doi": ""
    },
    {
      "text": "Julie Ducasse, Anke M. Brock, and Christophe Jouffrais. 2018. Accessible Interactive Maps for Visually Impaired Users. In Mobility of Visually Impaired People: Fundamentals and ICT Assistive Technologies, Edwige Pissaloux and Ramiro Velazquez (Eds.). Springer International Publishing, Cham, 537–584. https://doi.org/10.1007/978-3-319-54446-5_17",
      "doi": ""
    },
    {
      "text": "François-Guillaume Fernandez. 2021. TorchCAM: Class Activation Explorer.",
      "doi": ""
    },
    {
      "text": "Michael Figurnov, Maxwell D. Collins, Yukun Zhu, Li Zhang, Jonathan Huang, Dmitry Vetrov, and Ruslan Salakhutdinov. 2017. Spatially Adaptive Computation Time for Residual Networks. https://doi.org/10.48550/arXiv.1612.02297 arxiv:1612.02297 [cs]",
      "doi": ""
    },
    {
      "text": "John A. Gardner. 1996. Tactile Graphics: An Overview and Resource Guide. Information Technology and Disabilities 3, 4 (Oct. 1996).",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Patrick Carrington, Cameron Cassidy, Meredith Ringel Morris, Kris M. Kitani, and Jeffrey P. Bigham. 2019. “It’s Almost like They’re Trying to Hide It”: How User-Provided Image Descriptions Have Failed to Make Twitter Accessible. In The World Wide Web Conference(WWW ’19). Association for Computing Machinery, New York, NY, USA, 549–559. https://doi.org/10.1145/3308558.3313605",
      "doi": "10.1145/3308558.3313605"
    },
    {
      "text": "Cole Gleason, Amy Pavel, Xingyu Liu, Patrick Carrington, Lydia B. Chilton, and Jeffrey P. Bigham. 2019. Making Memes Accessible. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 367–376. https://doi.org/10.1145/3308561.3353792",
      "doi": "10.1145/3308561.3353792"
    },
    {
      "text": "Cole Gleason, Amy Pavel, Emma McCamey, Christina Low, Patrick Carrington, Kris M. Kitani, and Jeffrey P. Bigham. 2020. Twitter A11y: A Browser Extension to Make Twitter Images Accessible. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376728",
      "doi": "10.1145/3313831.3376728"
    },
    {
      "text": "Cagatay Goncu and Kim Marriott. 2011. GraVVITAS: Generic Multi-touch Presentation of Accessible Graphics. In Human-Computer Interaction – INTERACT 2011(Lecture Notes in Computer Science), Pedro Campos, Nicholas Graham, Joaquim Jorge, Nuno Nunes, Philippe Palanque, and Marco Winckler (Eds.). Springer, Berlin, Heidelberg, 30–48. https://doi.org/10.1007/978-3-642-23774-4_5",
      "doi": ""
    },
    {
      "text": "Google. 2019. Firebase App Distribution. https://firebase.google.com/docs/app-distribution",
      "doi": ""
    },
    {
      "text": "João Guerreiro, Dragan Ahmetovic, Kris M. Kitani, and Chieko Asakawa. 2017. Virtual Navigation for Blind People: Building Sequential Representations of the Real-World. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 280–289. https://doi.org/10.1145/3132525.3132545",
      "doi": "10.1145/3132525.3132545"
    },
    {
      "text": "Richa Gupta, M. Balakrishnan, and P.V.M. Rao. 2017. Tactile Diagrams for the Visually Impaired. IEEE Potentials 36, 1 (Jan. 2017), 14–18. https://doi.org/10.1109/MPOT.2016.2614754",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in Psychology. Vol. 52. Elsevier, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Eric Hasper, Rogier A. Windhorst, Terri Hedgpeth, Leanne Van Tuyl, Ashleigh Gonzales, Britta Martinez, Hongyu Yu, Zoltan Farkas, and Debra P. Baluch. 2015. Methods for Creating and Evaluating 3D Tactile Images to Teach STEM Courses to the Visually Impaired. Journal of College Science Teaching 44, 6 (2015), 92–99.",
      "doi": ""
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2015. Deep Residual Learning for Image Recognition. https://doi.org/10.48550/arXiv.1512.03385 arxiv:1512.03385 [cs]",
      "doi": ""
    },
    {
      "text": "Xiaodong He and Li Deng. 2017. Deep Learning for Image-to-Text Generation: A Technical Overview. IEEE Signal Processing Magazine 34, 6 (Nov. 2017), 109–116. https://doi.org/10.1109/MSP.2017.2741510",
      "doi": ""
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible Maps for the Blind: Comparing 3D Printed Models with Tactile Graphics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173772",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Mihail Ivanchev, Francis Zinke, and Ulrike Lucke. 2014. Pre-Journey Visualization of Travel Routes for the Blind on Refreshable Interactive Tactile Displays. In Computers Helping People with Special Needs(Lecture Notes in Computer Science), Klaus Miesenberger, Deborah Fels, Dominique Archambault, Petr Peňáz, and Wolfgang Zagler (Eds.). Springer International Publishing, Cham, 81–88. https://doi.org/10.1007/978-3-319-08599-9_13",
      "doi": ""
    },
    {
      "text": "N. W. Kim, S. C. Joyner, A. Riegelhuth, and Y. Kim. 2021. Accessible Visualization: Design Space, Opportunities, and Challenges. Computer Graphics Forum 40, 3 (2021), 173–188. https://doi.org/10.1111/cgf.14298",
      "doi": ""
    },
    {
      "text": "Matthias Kümmerer, Lucas Theis, and Matthias Bethge. 2015. Deep Gaze I: Boosting Saliency Prediction with Feature Maps Trained on ImageNet. https://doi.org/10.48550/arXiv.1411.1045 arxiv:1411.1045 [cs, q-bio, stat]",
      "doi": ""
    },
    {
      "text": "Jaewook Lee, Jaylin Herskovitz, Yi-Hao Peng, and Anhong Guo. 2022. ImageExplorer: Multi-Layered Touch Exploration to Encourage Skepticism Towards Imperfect AI-Generated Image Captions. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans, LA, USA, 1–15. https://doi.org/10.1145/3491102.3501966",
      "doi": "10.1145/3491102.3501966"
    },
    {
      "text": "Oliver Libaw. 2018. Powered by AI: Automatic Alt Text to Help the Blind ‘See’ Facebook. https://tech.fb.com/artificial-intelligence/2018/06/using-artificial-intelligence-to-help-blind-people-see-facebook/.",
      "doi": ""
    },
    {
      "text": "Siqi Liu, Zhenhai Zhu, Ning Ye, Sergio Guadarrama, and Kevin Murphy. 2017. Improved Image Captioning via Policy Gradient Optimization of SPIDEr. In Proceedings of the IEEE International Conference on Computer Vision. 873–881.",
      "doi": ""
    },
    {
      "text": "Ying Lv, Wujie Zhou, Jingsheng Lei, Lv Ye, and Ting Luo. 2019. Attention-Based Fusion Network for Human Eye-Fixation Prediction in 3D Images. Optics Express 27, 23 (Nov. 2019), 34056–34066. https://doi.org/10.1364/OE.27.034056",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Edward Cutrell, Bongshin Lee, and Meredith Ringel Morris. 2021. Designing Tools for High-Quality Alt Text Authoring. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’21). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3441852.3471207",
      "doi": "10.1145/3441852.3471207"
    },
    {
      "text": "Haley MacLeod, Cynthia L. Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding Blind People’s Experiences with Computer-Generated Captions of Social Media Images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 5988–5999. https://doi.org/10.1145/3025453.3025814",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Karen McCall and Beverly Chagnon. 2022. Rethinking Alt Text to Improve Its Effectiveness. In Computers Helping People with Special Needs(Lecture Notes in Computer Science), Klaus Miesenberger, Georgios Kouroupetroglou, Katerina Mavrou, Roberto Manduchi, Mario Covarrubias Rodriguez, and Petr Penáz (Eds.). Springer International Publishing, Cham, 26–33. https://doi.org/10.1007/978-3-031-08645-8_4",
      "doi": "10.1007/978-3-031-08645-8_4"
    },
    {
      "text": "Tom McEwan and Ben Weerts. 2007. ALT Text and Basic Accessibility. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...but Not as We Know It - Volume 2(BCS-HCI ’07). BCS Learning & Development Ltd., Swindon, GBR, 71–74.",
      "doi": ""
    },
    {
      "text": "Chiara Meneghetti, Erika Borella, Irene Grasso, and Rossana De Beni. 2012. Learning a Route Using a Map and/or Description in Young and Older Adults. Journal of Cognitive Psychology 24, 2 (March 2012), 165–178. https://doi.org/10.1080/20445911.2011.603694",
      "doi": ""
    },
    {
      "text": "Microsoft. 2017. Seeing AI. https://www.microsoft.com/en-us/ai/seeing-ai",
      "doi": ""
    },
    {
      "text": "Valerie S. Morash, Yue-Ting Siu, Joshua A. Miele, Lucia Hasty, and Steven Landau. 2015. Guiding Novice Web Workers in Making Image Descriptions Using Templates. ACM Transactions on Accessible Computing 7, 4 (Nov. 2015), 12:1–12:21. https://doi.org/10.1145/2764916",
      "doi": "10.1145/2764916"
    },
    {
      "text": "Meredith Ringel Morris, Jazette Johnson, Cynthia L. Bennett, and Edward Cutrell. 2018. Rich Representations of Visual Content for Screen Reader Users. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal, QC, Canada, 1–11. https://doi.org/10.1145/3173574.3173633",
      "doi": "10.1145/3173574.3173633"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. \"With Most of It Being Pictures Now, I Rarely Use It\": Understanding Twitter’s Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 5506–5516. https://doi.org/10.1145/2858036.2858116",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Vishnu Nair, Jay L Karp, Samuel Silverman, Mohar Kalra, Hollis Lehv, Faizan Jamil, and Brian A. Smith. 2021. NavStick: Making Video Games Blind-Accessible via the Ability to Look Around. In The 34th Annual ACM Symposium on User Interface Software and Technology(UIST ’21). Association for Computing Machinery, New York, NY, USA, 538–551. https://doi.org/10.1145/3472749.3474768",
      "doi": "10.1145/3472749.3474768"
    },
    {
      "text": "Vishnu Nair, Shao-en Ma, Ricardo E. Gonzalez Penuela, Yicheng He, Karen Lin, Mason Hayes, Hannah Huddleston, Matthew Donnelly, and Brian A. Smith. 2022. Uncovering Visually Impaired Gamers’ Preferences for Spatial Awareness Tools Within Video Games. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’22). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3517428.3544802",
      "doi": "10.1145/3517428.3544802"
    },
    {
      "text": "Uran Oh, Hwayeon Joh, and YunJung Lee. 2021. Image Accessibility for Screen Reader Users: A Systematic Review and a Road Map. Electronics 10, 8 (Jan. 2021), 953. https://doi.org/10.3390/electronics10080953",
      "doi": ""
    },
    {
      "text": "Daniel Omeiza, Skyler Speakman, Celia Cintas, and Komminist Weldermariam. 2019. Smooth Grad-CAM++: An Enhanced Inference Level Visualization Technique for Deep Convolutional Neural Network Models. https://doi.org/10.48550/arXiv.1908.01224 arxiv:1908.01224 [cs]",
      "doi": ""
    },
    {
      "text": "Hariprasath Palani, Uro Giudice, and Nicholas A. Giudice. 2016. Evaluation of Non-visual Zooming Operations on Touchscreen Devices. In Universal Access in Human-Computer Interaction. Interaction Techniques and Environments(Lecture Notes in Computer Science), Margherita Antona and Constantine Stephanidis (Eds.). Springer International Publishing, Cham, 162–174. https://doi.org/10.1007/978-3-319-40244-4_16",
      "doi": ""
    },
    {
      "text": "Hari Prasath Palani and Nicholas A. Giudice. 2017. Principles for Designing Large-Format Refreshable Haptic Graphics Using Touchscreen Devices: An Evaluation of Nonvisual Panning Methods. ACM Transactions on Accessible Computing 9, 3 (Feb. 2017), 9:1–9:25. https://doi.org/10.1145/3035537",
      "doi": "10.1145/3035537"
    },
    {
      "text": "Benjamin Poppinga, Charlotte Magnusson, Martin Pielot, and Kirsten Rassmus-Gröhn. 2011. TouchOver Map: Audio-Tactile Exploration of Interactive Maps. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services(MobileHCI ’11). Association for Computing Machinery, New York, NY, USA, 545–550. https://doi.org/10.1145/2037373.2037458",
      "doi": "10.1145/2037373.2037458"
    },
    {
      "text": "Krishnan Ramnath, Simon Baker, Lucy Vanderwende, Motaz El-Saban, Sudipta N. Sinha, Anitha Kannan, Noran Hassan, Michel Galley, Yi Yang, Deva Ramanan, Alessandro Bergamo, and Lorenzo Torresani. 2014. AutoCaption: Automatic Caption Generation for Personal Photos. In IEEE Winter Conference on Applications of Computer Vision. 1050–1057. https://doi.org/10.1109/WACV.2014.6835988",
      "doi": ""
    },
    {
      "text": "Microsoft Research. 2018. Microsoft Soundscape. https://www.microsoft.com/en-us/research/product/soundscape/",
      "doi": ""
    },
    {
      "text": "Jonathan Rowell and Simon Ungar. 2005. Feeling Our Way: Tactile Map User Requirements-a Survey. In International Cartographic Conference. A Coruna, Spain.",
      "doi": ""
    },
    {
      "text": "Elliot Salisbury, Ece Kamar, and Meredith Morris. 2017. Toward Scalable Social Alt Text: Conversational Crowdsourcing as a Tool for Refining Vision-to-Language Technology for the Blind. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 5 (Sept. 2017), 147–156.",
      "doi": ""
    },
    {
      "text": "Lei Shi, Ross McLachlan, Yuhang Zhao, and Shiri Azenkot. 2016. Magic Touch: Interacting with 3D Printed Graphics. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’16). Association for Computing Machinery, New York, NY, USA, 329–330. https://doi.org/10.1145/2982142.2982153",
      "doi": "10.1145/2982142.2982153"
    },
    {
      "text": "Abigale Stangl, Meredith Ringel Morris, and Danna Gurari. 2020. \"Person, Shoes, Tree. Is the Person Naked?\" What People with Vision Impairments Want in Image Descriptions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376404",
      "doi": "10.1145/3313831.3376404"
    },
    {
      "text": "Abigale Stangl, Nitin Verma, Kenneth R. Fleischmann, Meredith Ringel Morris, and Danna Gurari. 2021. Going Beyond One-Size-Fits-All Image Descriptions to Satisfy the Information Wants of People Who Are Blind or Have Low Vision. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3441852.3471233",
      "doi": "10.1145/3441852.3471233"
    },
    {
      "text": "Brian W. Stone, Donovan Kay, and Anthony Reynolds. 2019. Teaching Visually Impaired College Students in Introductory Statistics. Journal of Statistics Education 27, 3 (Sept. 2019), 225–237. https://doi.org/10.1080/10691898.2019.1677199",
      "doi": ""
    },
    {
      "text": "Hao Su, Jia Deng, and Li Fei-Fei. 2012. Crowdsourcing Annotations for Visual Object Detection. In Workshops at the Twenty-Sixth AAAI Conference on Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Jing Su, Alyssa Rosenzweig, Ashvin Goel, Eyal de Lara, and Khai N. Truong. 2010. Timbremap: Enabling the Visually-Impaired to Use Maps on Touch-Enabled Devices. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services(MobileHCI ’10). Association for Computing Machinery, New York, NY, USA, 17–26. https://doi.org/10.1145/1851600.1851606",
      "doi": "10.1145/1851600.1851606"
    },
    {
      "text": "PyTorch Team. 2017. ResNet. https://www.pytorch.org.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2020. Unity. Unity Technologies.",
      "doi": ""
    },
    {
      "text": "Leonard Elia van Dyck, Roland Kwitt, Sebastian Jochen Denzler, and Walter Roland Gruber. 2021. Comparing Object Recognition in Humans and Deep Convolutional Neural Networks—An Eye Tracking Study. Frontiers in Neuroscience 15 (Oct 2021), 750639. https://doi.org/10.3389/fnins.2021.750639",
      "doi": ""
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How Blind People Interact with Visual Content on Social Networking Services. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing(CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1584–1595. https://doi.org/10.1145/2818048.2820013",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "WebAIM. 2021. WebAIM: Alternative Text. https://webaim.org/techniques/alttext/.",
      "doi": ""
    },
    {
      "text": "Greg J. Williams, Ting Zhang, Alex Lo, Ashleigh Gonzales, Debra Page Baluch, and Bradley S. Duerstock. 2014. 3D Printing Tactile Graphics for the Blind: Application to Histology. In Annual Rehabilitation Engineering Society of North America Conference 2014. Rehabilitation Engineering and Assistive Technology Society of North America.",
      "doi": ""
    },
    {
      "text": "J. Wilson, B. N. Walker, J. Lindsay, C. Cambias, and F. Dellaert. 2007. SWAN: System for Wearable Audio Navigation. In 2007 11th IEEE International Symposium on Wearable Computers. 91–98. https://doi.org/10.1109/ISWC.2007.4373786",
      "doi": "10.1109/ISWC.2007.4373786"
    },
    {
      "text": "Shaomei Wu and Lada A. Adamic. 2014. Visually Impaired Users on an Online Social Network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 3133–3142. https://doi.org/10.1145/2556288.2557415",
      "doi": "10.1145/2556288.2557415"
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Julie Schiller. 2017. Automatic Alt-text: Computer-generated Image Descriptions for Blind Users on a Social Network Service. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1180–1192. https://doi.org/10.1145/2998181.2998364",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Naihui Zhou, Zachary D. Siegel, Scott Zarecor, Nigel Lee, Darwin A. Campbell, Carson M. Andorf, Dan Nettleton, Carolyn J. Lawrence-Dill, Baskar Ganapathysubramanian, Jonathan W. Kelly, and Iddo Friedberg. 2018. Crowdsourcing Image Analysis for Plant Phenomics to Generate Ground Truth Data for Machine Learning. PLOS Computational Biology 14, 7 (July 2018), e1006337. https://doi.org/10.1371/journal.pcbi.1006337",
      "doi": ""
    },
    {
      "text": "Yimin Zhou, Yiwei Sun, and Vasant Honavar. 2019. Improving Image Captioning by Leveraging Knowledge Graphs. In 2019 IEEE Winter Conference on Applications of Computer Vision (WACV). 283–293. https://doi.org/10.1109/WACV.2019.00036",
      "doi": ""
    }
  ]
}