{
  "doi": "10.1145/3544548.3581311",
  "title": "Understanding the Online Social Support Dynamics for Postpartum Depression",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Postpartum depression (PPD) is one of the most prevalent mental health disorder following childbirth. Mothers utilize social media and online forums throughout postpartum to seek mental health support. In this paper, we aim to gain a comprehensive understanding of the topics of naturally occurring online discussions and the online social support dynamics associated with PPD. We qualitatively analyze posts and comments from three postpartum depression support communities corresponding to well-known online social platforms (Reddit, What to expect, and Babycenter). We discovered that the three communities share common themes of discussion that include the causes, stressors, symptoms, and coping mechanisms for PPD. Seeking both informational and emotional support through venting and storytelling was prevalent, and emotional support seeking was more common in Reddit than the other two communities. We provide recommendations for future postpartum depression research and design considerations based on pervasive help-seeking approaches.",
  "authors": [
    {
      "name": "Farhat Tasnim Progga",
      "institution": "Department of Computer Science, Marquette University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660665333",
      "orcid": "0000-0002-8261-5345"
    },
    {
      "name": "Avanthika Senthil Kumar",
      "institution": "Social and Ethical Computing Lab, Marquette University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778812",
      "orcid": "0000-0002-8900-3181"
    },
    {
      "name": "Sabirat Rubya",
      "institution": "Department of Computer Science, Marquette University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86158922757",
      "orcid": "0000-0001-5878-0976"
    }
  ],
  "references": [
    {
      "text": "2020. Depression Among Women | Depression | Reproductive Health | CDC. https://www.cdc.gov/reproductivehealth/depression/index.htm",
      "doi": ""
    },
    {
      "text": "2021. Reddit Statistics For 2022: Eye-Opening Usage & Traffic Data. https://foundationinc.co/lab/reddit-statistics/",
      "doi": ""
    },
    {
      "text": "Phil Adams, Eric PS Baumer, and Geri Gay. 2014. Staccato Social Support in Mobile Health Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 653–662. https://doi.org/10.1145/2556288.2557297",
      "doi": "10.1145/2556288.2557297"
    },
    {
      "text": "Lígia Moreira Almeida, Cristina Costa-Santos, José Peixoto Caldas, Sónia Dias, and Diogo Ayres-de Campos. 2016. The impact of migration on women’s mental health in the postpartum period. Revista de Saúde Pública 50 (2016), 35.",
      "doi": ""
    },
    {
      "text": "Patrícia Alvarenga and Giana Bitencourt Frizzo. 2017. Stressful Life Events and Women’s Mental Health During Pregnancy and Postpartum Period1. Paidéia (Ribeirão Preto) 27 (2017), 51–59.",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari, Sarita Schoenebeck, and Daniel Romero. 2019. Self-Declared Throwaway Accounts on Reddit: How Platform Affordances and Shared Norms Enable Parenting Disclosure and Support. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 135 (nov 2019), 30 pages. https://doi.org/10.1145/3359237",
      "doi": "10.1145/3359237"
    },
    {
      "text": "Telake Azale, Abebaw Fekadu, and Charlotte Hanlon. 2016. Treatment gap and help-seeking for postpartum depression in a rural African setting. BMC Psychiatry 16, 1 (Dec. 2016), 196. https://doi.org/10.1186/s12888-016-0892-8",
      "doi": ""
    },
    {
      "text": "Amit Baumel, Stephen M Schueller, 2016. Adjusting an available online peer support platform in a program to supplement the treatment of perinatal depression and anxiety. JMIR mental health 3, 1 (2016), e5335.",
      "doi": ""
    },
    {
      "text": "Amit Baumel, Amanda Tinkelman, Nandita Mathur, and John M. Kane. 2018. Digital Peer-Support Platform (7Cups) as an Adjunct Treatment for Women With Postpartum Depression: Feasibility, Acceptability, and Preliminary Efficacy Study. JMIR mHealth and uHealth 6, 2 (Feb. 2018), e9482. https://doi.org/10.2196/mhealth.9482 Company: JMIR mHealth and uHealth Distributor: JMIR mHealth and uHealth Institution: JMIR mHealth and uHealth Label: JMIR mHealth and uHealth Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Amit Baumel, Amanda Tinkelman, Nandita Mathur, John M Kane, 2018. Digital peer-support platform (7Cups) as an adjunct treatment for women with postpartum depression: feasibility, acceptability, and preliminary efficacy study. JMIR mHealth and uHealth 6, 2 (2018), e9482.",
      "doi": ""
    },
    {
      "text": "A-C Bernard-Bonnin, Canadian Paediatric Society, and Mental Health and Developmental Disabilities Committee. 2004. Maternal depression and child development. Paediatrics & Child Health 9, 8 (Oct. 2004), 575–583. https://doi.org/10.1093/pch/9.8.575",
      "doi": ""
    },
    {
      "text": "Joan R. Bloom. 1990. The relationship of social support and health. Social Science & Medicine 30, 5 (Jan. 1990), 635–637. https://doi.org/10.1016/0277-9536(90)90162-L",
      "doi": ""
    },
    {
      "text": "Susan Bodnar-Deren, EKT Benn, Amy Balbierz, and EA Howell. 2017. Stigma and postpartum depression treatment acceptability among black and white women in the first six-months postpartum. Maternal and child health journal 21, 7 (2017), 1457–1468.",
      "doi": ""
    },
    {
      "text": "Bryce Boe. 2016. Python reddit api wrapper (PRAW). Bryce Boe (2016).",
      "doi": ""
    },
    {
      "text": "Lauren Britton, Louise Barkhuus, and Bryan Semaan. 2019. \" Mothers as Candy Wrappers\": Critical infrastructure supporting the transition into motherhood. Proceedings of the ACM on Human-Computer Interaction 3, GROUP(2019), 1–21.",
      "doi": "10.1145/3361113"
    },
    {
      "text": "Matthew A. Broom, Amy S. Ladley, Elizabeth A. Rhyne, and Donna R. Halloran. 2015. Feasibility and Perception of Using Text Messages as an Adjunct Therapy for Low-Income, Minority Mothers With Postpartum Depression. JMIR Mental Health 2, 1 (March 2015), e4074. https://doi.org/10.2196/mental.4074 Company: JMIR Mental Health Distributor: JMIR Mental Health Institution: JMIR Mental Health Label: JMIR Mental Health Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Nancy Byatt, Kathleen Biebel, Liz Friedman, Gifty Debordes-Jackson, Douglas Ziedonis, and Lori Pbert. 2013. Patient’s views on depression care in obstetric settings: how do they compare to the views of perinatal health care professionals?General Hospital Psychiatry 35, 6 (Nov. 2013), 598–604. https://doi.org/10.1016/j.genhosppsych.2013.07.011",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor and Munmun De Choudhury. 2020. Methods in predictive techniques for mental health status on social media: a critical review. NPJ digital medicine 3, 1 (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Andrea Hu, and Munmun De Choudhury. 2018. Norms matter: contrasting social support around behavior change in online weight loss communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3174240"
    },
    {
      "text": "Langtao Chen, Aaron Baird, and Detmar Straub. 2020. A linguistic signaling model of social support exchange in online health communities. Decision Support Systems 130 (2020), 113233.",
      "doi": "10.1016/j.dss.2019.113233"
    },
    {
      "text": "Xi Chen, MingXue Sun, Dong Wu, and Xiao Yu Song. 2019. Information-sharing behavior on WeChat moments: the role of anonymity, familiarity, and intrinsic motivation. Frontiers in psychology 10 (2019), 2540.",
      "doi": ""
    },
    {
      "text": "Yixin Chen and Yang Xu. 2021. Social Support is Contagious: Exploring the Effect of Social Support in Online Mental Health Communities. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3411763.3451644"
    },
    {
      "text": "Ching-Yu Cheng and Rita H. Pickler. 2009. Effects of stress and social support on postpartum health of Chinese mothers in the United States. Research in Nursing & Health 32, 6 (2009), 582–591. https://doi.org/10.1002/nur.20356 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/nur.20356.",
      "doi": ""
    },
    {
      "text": "Hahyeon Cho, Kyeongmin Lee, Eunji Choi, Ha Na Cho, Boyoung Park, Mina Suh, Yumie Rhee, and Kui Son Choi. 2022. Association between social support and postpartum depression. Scientific reports 12, 1 (2022), 1–9.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity. In Eighth International AAAI Conference on Weblogs and Social Media. https://www.aaai.org/ocs/index.php/ICWSM/ICWSM14/paper/view/8075",
      "doi": ""
    },
    {
      "text": "Sanchari Chowdhuri, Sidnei McCrea, Dina Demner Fushman, and Casey Overby Taylor. 2019. Extracting Biomedical Terms from Postpartum Depression Online Health Communities. AMIA Summits on Translational Science Proceedings 2019 (May 2019), 592–601. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6568056/",
      "doi": ""
    },
    {
      "text": "Sanchari Chowdhuri, Sidnei McCrea, Dina Demner Fushman, and Casey Overby Taylor. 2019. Extracting biomedical terms from postpartum depression online health communities. AMIA Summits on Translational Science Proceedings 2019 (2019), 592.",
      "doi": ""
    },
    {
      "text": "Catherine P. Corrigan, Andrea N. Kwasky, and Carla J. Groh. 2015. Social Support, Postpartum Depression, and Professional Assistance: A Survey of Mothers in the Midwestern United States. The Journal of Perinatal Education 24, 1 (2015), 48–60. https://doi.org/10.1891/1058-1243.24.1.48",
      "doi": ""
    },
    {
      "text": "Tiago Cunha, Ingmar Weber, and Gisele Pappa. 2017. A warm welcome matters! the link between social feedback and weight loss in/r/loseit. In Proceedings of the 26th International Conference on World Wide Web Companion. 1063–1072.",
      "doi": ""
    },
    {
      "text": "Carolyn E Cutrona and Julie A Suhr. 1992. Controllability of stressful events and satisfaction with spouse support behaviors. Communication research 19, 2 (1992), 154–174.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J. Horvitz, and Aaron Hoff. 2014. Characterizing and predicting postpartum depression from shared facebook data. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). Association for Computing Machinery, New York, NY, USA, 626–638. https://doi.org/10.1145/2531602.2531675",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Munmun De Choudhury and Emre Kiciman. 2017. The language of social support in social media and its effect on suicidal ideation risk. In Eleventh International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Cindy-Lee Dennis. 2003. Peer support within a health care context: a concept analysis. International journal of nursing studies 40, 3 (2003), 321–332.",
      "doi": ""
    },
    {
      "text": "Cindy-Lee Dennis. 2010. Postpartum depression peer support: maternal perceptions from a randomized controlled trial. International journal of nursing studies 47, 5 (2010), 560–568.",
      "doi": ""
    },
    {
      "text": "Marilyn Evans, Lorie Donelle, and Laurie Hume-Loveland. 2012. Social support and online postpartum depression discussion groups: A content analysis. Patient Education and Counseling 87, 3 (June 2012), 405–410. https://doi.org/10.1016/j.pec.2011.09.011",
      "doi": ""
    },
    {
      "text": "Jenifer O Fahey and Edmond Shenassa. 2013. Understanding and meeting the needs of women in the postpartum period: the perinatal maternal health promotion model. Journal of midwifery & women’s health 58, 6 (2013), 613–621.",
      "doi": ""
    },
    {
      "text": "Iram Fatima, Burhan Ud Din Abbasi, Sharifullah Khan, Majed Al-Saeed, Hafiz Farooq Ahmad, and Rafia Mumtaz. 2019. Prediction of postpartum depression using machine learning techniques from social media text. Expert Systems 36, 4 (2019), e12409. https://doi.org/10.1111/exsy.12409 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/exsy.12409.",
      "doi": ""
    },
    {
      "text": "Shanna Fealy, Sally Chan, Olivia Wynne, Eileen Dowse, Lyn Ebert, Roger Ho, Melvyn WB Zhang, and Donovan Jones. 2019. The support for new mums project: a protocol for a pilot randomized controlled trial designed to test a postnatal psychoeducation smartphone application. Journal of Advanced Nursing 75, 6 (2019), 1347–1359.",
      "doi": ""
    },
    {
      "text": "Nancy Feeley, Linda Bell, Barbara Hayton, Phyllis Zelkowitz, and Marie-Eve Carrier. 2016. Care for Postpartum Depression: What Do Women and Their Partners Prefer?Perspectives in Psychiatric Care 52, 2 (2016), 120–130. https://doi.org/10.1111/ppc.12107 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/ppc.12107.",
      "doi": ""
    },
    {
      "text": "Emily L Ferrell, Sarah E Russin, and Rachel M Hardy. 2019. Informal caregiving experiences in posttraumatic stress disorder: A content analysis of an online community. Journal of community psychology 47, 4 (2019), 757–771.",
      "doi": ""
    },
    {
      "text": "Ana Fonseca, Stephanie Alves, Fabiana Monteiro, Ricardo Gorayeb, and Maria Cristina Canavarro. 2020. Be a Mom, a Web-Based Intervention to Prevent Postpartum Depression: Results From a Pilot Randomized Controlled Trial. Behavior Therapy 51, 4 (July 2020), 616–633. https://doi.org/10.1016/j.beth.2019.09.007",
      "doi": ""
    },
    {
      "text": "D. K. Gjerdingen, D. G. Froberg, and P. Fontaine. 1991. The effects of social support on women’s health during pregnancy, labor and delivery, and the postpartum period. Family medicine 23, 5 (July 1991), 370–375.",
      "doi": ""
    },
    {
      "text": "George Gkotsis, Anika Oellrich, Tim Hubbard, Richard Dobson, Maria Liakata, Sumithra Velupillai, and Rina Dutta. 2016. The language of mental health problems in social media. In Proceedings of the third workshop on computational linguistics and clinical psychology. 63–73.",
      "doi": ""
    },
    {
      "text": "Sara Green-Hamann, Kristen Campbell Eichhorn, and John C Sherblom. 2011. An exploration of why people participate in Second Life social support groups. Journal of Computer-Mediated Communication 16, 4 (2011), 465–491.",
      "doi": ""
    },
    {
      "text": "Brittany G. Grissette, Regena Spratling, and Dawn M. Aycock. 2018. Barriers to Help-Seeking Behavior Among Women With Postpartum Depression. Journal of Obstetric, Gynecologic & Neonatal Nursing 47, 6 (2018), 812–819. https://doi.org/10.1016/j.jogn.2018.09.006",
      "doi": ""
    },
    {
      "text": "Austin Gu and Casey Overby Taylor. 2018. Differences in Engagement Among BabyCenter.com Community Forum Contributors: A Pilot Study. In Proceedings of the 2018 ACM International Conference on Bioinformatics, Computational Biology, and Health Informatics(BCB ’18). Association for Computing Machinery, New York, NY, USA, 513. https://doi.org/10.1145/3233547.3233621",
      "doi": "10.1145/3233547.3233621"
    },
    {
      "text": "Xinning Gui, Yu Chen, Yubo Kou, Katie Pine, and Yunan Chen. 2017. Investigating Support Seeking from Peers for Pregnancy in Online Health Communities. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (Dec. 2017), 50:1–50:19. https://doi.org/10.1145/3134685",
      "doi": "10.1145/3134685"
    },
    {
      "text": "Jerry Guintivano, Karen T Putnam, Patrick F Sullivan, and Samantha Meltzer-Brody. 2020. Clinical phenotypes of peripartum depression and time of onset: the PACT Consortium. In Biomarkers of Postpartum Psychiatric Disorders. Elsevier, 1–14.",
      "doi": ""
    },
    {
      "text": "Silje Marie Haga, Patricia Kinser, Tore Wentzel-Larsen, Carina Lisøy, Susan Garthus-Niegel, Kari Slinning, and Filip Drozd. 2020. Mamma Mia – A randomized controlled trial of an internet intervention to enhance subjective well-being in perinatal women. The Journal of Positive Psychology 0, 0 (March 2020), 1–9. https://doi.org/10.1080/17439760.2020.1738535 Publisher: Routledge _eprint: https://doi.org/10.1080/17439760.2020.1738535.",
      "doi": ""
    },
    {
      "text": "Jennifer Hahn-Holbrook, Taylor Cornwell-Hinrichs, and Itzel Anaya. 2018. Economic and health predictors of national postpartum depression prevalence: a systematic review, meta-analysis, and meta-regression of 291 studies from 56 countries. Frontiers in psychiatry 8 (2018), 248.",
      "doi": ""
    },
    {
      "text": "Aleesha Hamid, Rabiah Arshad, and Suleman Shahid. 2022. What are you thinking?: Using CBT and Storytelling to Improve Mental Health Among College Students. In CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3491102.3517603"
    },
    {
      "text": "Julie Hannan. 2016. Older mothers’ experiences of postnatal depression. British Journal of Midwifery 24, 1 (Jan. 2016), 28–36. https://doi.org/10.12968/bjom.2016.24.1.28 Publisher: Mark Allen Group.",
      "doi": ""
    },
    {
      "text": "Erin J. Henshaw, Kristine M. Durkin, and Rita J. Snell. 2016. First-time parents’ shared representation of postpartum depressive symptoms: A qualitative analysis. Social Science & Medicine 160 (July 2016), 102–110. https://doi.org/10.1016/j.socscimed.2016.05.025",
      "doi": ""
    },
    {
      "text": "Mette Terp Høybye, Christoffer Johansen, and Tine Tjørnhøj-Thomsen. 2005. Online interaction. Effects of storytelling in an internet breast cancer support group. Psycho-Oncology: Journal of the Psychological, Social and Behavioral Dimensions of Cancer 14, 3 (2005), 211–220.",
      "doi": ""
    },
    {
      "text": "Jina Huh and Wanda Pratt. 2014. Weaving Clinical Expertise in Online Health Communities. Proceedings of the SIGCHI conference on human factors in computing systems CHI Conference 2014(2014), 1355–1364. https://doi.org/10.1145/2556288.2557293",
      "doi": "10.1145/2556288.2557293"
    },
    {
      "text": "Chich-Hsiu Hung and Hsin-Hsin Chung. 2001. The effects of postpartum stress and social support on postpartum women’s health status. Journal of Advanced Nursing 36, 5 (2001), 676–684. https://doi.org/10.1046/j.1365-2648.2001.02032.x _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1046/j.1365-2648.2001.02032.x.",
      "doi": ""
    },
    {
      "text": "Nazanin Jannati, Shahrzad Mazhari, Leila Ahmadian, and Moghaddameh Mirzaee. 2020. Effectiveness of an app-based cognitive behavioral therapy program for postpartum depression in primary care: A randomized controlled trial. International Journal of Medical Informatics 141 (Sept. 2020), 104145. https://doi.org/10.1016/j.ijmedinf.2020.104145",
      "doi": ""
    },
    {
      "text": "Seth C Kalichman, KJ Sikkema, and A Somlai. 1996. People living with HIV infection who attend and do not attend support groups: a pilot study of needs, characteristics and experiences. AIDS care 8, 5 (1996), 589–600.",
      "doi": ""
    },
    {
      "text": "David A. Kalmbach, Philip Cheng, Louise M. O’Brien, Leslie M. Swanson, Roopina Sangha, Srijan Sen, Constance Guille, Andrea Cuamatzi-Castelan, Alasdair L. Henry, Thomas Roth, and Christopher L. Drake. 2020. A randomized controlled trial of digital cognitive behavioral therapy for insomnia in pregnant women. Sleep Medicine 72 (Aug. 2020), 82–92. https://doi.org/10.1016/j.sleep.2020.03.016",
      "doi": ""
    },
    {
      "text": "Dawn Kingston, Marie-Paule Austin, Maureen Heaman, Sheila McDonald, Gerri Lasiuk, Wendy Sword, Rebecca Giallo, Kathy Hegadoren, Lydia Vermeyden, Sander Veldhuyzen van Zanten, Joshua Kingston, Karly Jarema, and Anne Biringer. 2015. Barriers and facilitators of mental health screening in pregnancy. Journal of Affective Disorders 186 (Nov. 2015), 350–357. https://doi.org/10.1016/j.jad.2015.06.029",
      "doi": ""
    },
    {
      "text": "Richard Kumi and Rajiv Sabherwal. 2019. Knowledge sharing behavior in online discussion communities: Examining behavior motivation from social and individual perspectives. Knowledge and Process Management 26, 2 (2019), 110–122.",
      "doi": ""
    },
    {
      "text": "J. Richard Landis and Gary G. Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics 33, 1 (1977), 159–174. https://doi.org/10.2307/2529310 Publisher: [Wiley, International Biometric Society].",
      "doi": ""
    },
    {
      "text": "Patricia Leahy-Warren, Geraldine McCarthy, and Paul Corcoran. 2012. First-time mothers: social support, maternal parental self-efficacy and postnatal depression. Journal of Clinical Nursing 21, 3-4 (Feb. 2012), 388–397. https://doi.org/10.1111/j.1365-2702.2011.03701.x",
      "doi": ""
    },
    {
      "text": "Foteini Lekka, Giorgos Efstathiou, and Anastasia Kalantzi-Azizi. 2015. The effect of counselling-based training on online peer support. British Journal of Guidance & Counselling 43, 1 (2015), 156–170.",
      "doi": ""
    },
    {
      "text": "N Letourneau, L Duffett-Leger, C-L Dennis, M Stewart, and PD Tryphonopoulos. 2011. Identifying the support needs of fathers affected by post-partum depression: a pilot study. Journal of psychiatric and mental health nursing 18, 1 (2011), 41–47.",
      "doi": ""
    },
    {
      "text": "Han Li, Robert E Kraut, and Haiyi Zhu. 2021. Technical Features of Asynchronous and Synchronous Community Platforms and their Effects on Community Cohesion: A Comparative Study of Forum-based and Chat-based Online Mental Health Communities. Journal of Computer-Mediated Communication 26, 6 (2021), 403–421.",
      "doi": ""
    },
    {
      "text": "Yu-Hong Li, Ting-Yu Mu, Liu Zhang, Cheng-Lu Zhang, Dan Wu, Jin-Ju Chen, and Fang Wang. 2020. Internet-based intervention for postpartum depression in China (“Mommy go”): Protocol for a randomized controlled trial. Journal of Advanced Nursing 76, 9 (2020), 2416–2425. https://doi.org/10.1111/jan.14436 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/jan.14436.",
      "doi": ""
    },
    {
      "text": "Siobhan A. Loughnan, Jill M. Newby, Hila Haskelberg, Alison Mahoney, Natalie Kladnitski, Jessica Smith, Emma Black, Christopher Holt, Jeannette Milgrom, Marie-Paule Austin, and Gavin Andrews. 2018. Internet-based cognitive behavioural therapy (iCBT) for perinatal anxiety and depression versus treatment as usual: study protocol for two randomised controlled trials. Trials 19 (Jan. 2018), 56. https://doi.org/10.1186/s13063-017-2422-5",
      "doi": ""
    },
    {
      "text": "Nayra Anna Martin-Key, Benedetta Spadaro, Thea Sofie Schei, and Sabine Bahn. 2021. Proof-of-Concept Support for the Development and Implementation of a Digital Assessment for Perinatal Mental Health: Mixed Methods Study. Journal of Medical Internet Research 23, 6 (June 2021), e27132. https://doi.org/10.2196/27132",
      "doi": ""
    },
    {
      "text": "December Maxwell, Regina T. Praetorius, Craig Keaton, and Komal Alam. 2020. Beyond bath bombs: partner’s response to postpartum depression. Journal of Family Studies 0, 0 (Nov. 2020), 1–13. https://doi.org/10.1080/13229400.2020.1827007 Publisher: Routledge _eprint: https://doi.org/10.1080/13229400.2020.1827007.",
      "doi": ""
    },
    {
      "text": "December Maxwell, Sarah R. Robinson, and Kelli Rogers. 2019. “I keep it to myself”: A qualitative meta-interpretive synthesis of experiences of postpartum depression among marginalised women. Health & Social Care in the Community 27, 3 (2019), e23–e36. https://doi.org/10.1111/hsc.12645 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/hsc.12645.",
      "doi": ""
    },
    {
      "text": "Donna Moore, Nicholas Drey, and Susan Ayers. 2017. Use of Online Forums for Perinatal Mental Illness, Stigma, and Disclosure: An Exploratory Model. JMIR Mental Health 4, 1 (Feb. 2017), e5926. https://doi.org/10.2196/mental.5926 Company: JMIR Mental Health Distributor: JMIR Mental Health Institution: JMIR Mental Health Label: JMIR Mental Health Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Mako Morikawa, Takashi Okada, Masahiko Ando, Branko Aleksic, Shohko Kunimoto, Yukako Nakamura, Chika Kubota, Yota Uno, Ai Tamaji, Norika Hayakawa, Kaori Furumura, Tomoko Shiino, Tokiko Morita, Naoko Ishikawa, Harue Ohoka, Hinako Usui, Naomi Banno, Satomi Murase, Setsuko Goto, Atsuko Kanai, Tomoko Masuda, and Norio Ozaki. 2015. Relationship between social support during pregnancy and postpartum depressive state: a prospective cohort study. Scientific Reports 5, 1 (May 2015), 10520. https://doi.org/10.1038/srep10520 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Saba Mughal, Yusra Azhar, and Waquar Siddiqui. 2022. Postpartum Depression. In StatPearls. StatPearls Publishing, Treasure Island (FL). http://www.ncbi.nlm.nih.gov/books/NBK519070/",
      "doi": ""
    },
    {
      "text": "Heidi Murkoff. 2016. What to expect when you’re expecting. Workman Publishing.",
      "doi": ""
    },
    {
      "text": "Rennie Negron, Anika Martin, Meital Almog, Amy Balbierz, and Elizabeth A. Howell. 2013. Social Support During the Postpartum Period: Mothers’ Views on Needs, Expectations, and Mobilization of Support. Maternal and Child Health Journal 17, 4 (May 2013), 616–623. https://doi.org/10.1007/s10995-012-1037-4",
      "doi": ""
    },
    {
      "text": "Ann Oakley. 1992. Social support in pregnancy: Methodology and findings of a 1-year follow-up study. Journal of Reproductive and Infant Psychology 10, 4(1992), 219–231.",
      "doi": ""
    },
    {
      "text": "Kathleen O’Leary, Arpita Bhattacharya, Sean A Munson, Jacob O Wobbrock, and Wanda Pratt. 2017. Design opportunities for mental health peer support technologies. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 1470–1484.",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "OsmaJorge, BarreraAlinne Z, and RamphosEleni. 2016. Are Pregnant and Postpartum Women Interested in Health-Related Apps? Implications for the Prevention of Perinatal Depression. Cyberpsychology, Behavior, and Social Networking (June 2016). https://doi.org/10.1089/cyber.2015.0549 Publisher: Mary Ann Liebert, Inc. 140 Huguenot Street, 3rd Floor New Rochelle, NY 10801 USA.",
      "doi": ""
    },
    {
      "text": "Christine Pao, Jerry Guintivano, Hudson Santos, and Samantha Meltzer-Brody. 2019. Postpartum Depression and Social Support in a Racially and Ethnically Diverse Population of Women. Archives of women’s mental health 22, 1 (Feb. 2019), 105–114. https://doi.org/10.1007/s00737-018-0882-6",
      "doi": ""
    },
    {
      "text": "Albert Park, Mike Conway, and Annie T Chen. 2018. Examining thematic similarity, difference, and membership in three online mental health communities from Reddit: a text mining and visualization approach. Computers in human behavior 78 (2018), 98–112.",
      "doi": ""
    },
    {
      "text": "Umashanthi Pavalanathan and Munmun De Choudhury. 2015. Identity Management and Mental Health Discourse in Social Media. In Proceedings of the 24th International Conference on World Wide Web (Florence, Italy) (WWW ’15 Companion). Association for Computing Machinery, New York, NY, USA, 315–321. https://doi.org/10.1145/2740908.2743049",
      "doi": "10.1145/2740908.2743049"
    },
    {
      "text": "Jodi L. Pawluski, Joseph S. Lonstein, and Alison S. Fleming. 2017. The Neurobiology of Postpartum Anxiety and Depression. Trends in Neurosciences 40, 2 (Feb. 2017), 106–120. https://doi.org/10.1016/j.tins.2016.11.009",
      "doi": ""
    },
    {
      "text": "Sachin R Pendse, Kate Niederhoffer, and Amit Sharma. 2019. Cross-Cultural Differences in the Use of Online Mental Health Support Forums. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–29.",
      "doi": "10.1145/3359169"
    },
    {
      "text": "Annu Sible Prabhakar, Lucia Guerra-Reyes, Anne Effron, Vanessa M. Kleinschmidt, Maggie Driscoll, Charles Peters, Vanessa Pereira, Majdah Alshehri, Tom Ongwere, and Katie A. Siek. 2017. \"let me know if you need anything\": support realities of new mothers. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare(PervasiveHealth ’17). Association for Computing Machinery, New York, NY, USA, 31–40. https://doi.org/10.1145/3154862.3154863",
      "doi": "10.1145/3154862.3154863"
    },
    {
      "text": "Claudette Pretorius, Darragh McCashin, Naoise Kavanagh, and David Coyle. 2020. Searching for mental health: a mixed-methods study of young people’s online help-seeking. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376328"
    },
    {
      "text": "Yada Pruksachatkun, Sachin R Pendse, and Amit Sharma. 2019. Moments of change: Analyzing peer-based cognitive support in online mental health forums. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300294"
    },
    {
      "text": "Stephen A Rains and Valerie Young. 2009. A meta-analysis of research on formal computer-mediated support groups: Examining group characteristics and health outcomes. Human communication research 35, 3 (2009), 309–336.",
      "doi": ""
    },
    {
      "text": "Keshia M. Reid and Miles G. Taylor. 2015. Social support, stress, and maternal postpartum depression: A comparison of supportive relationships. Social Science Research 54 (Nov. 2015), 246–262. https://doi.org/10.1016/j.ssresearch.2015.08.009",
      "doi": ""
    },
    {
      "text": "Julie Repper and Tim Carter. 2011. A review of the literature on peer support in mental health services. Journal of mental health 20, 4 (2011), 392–411.",
      "doi": ""
    },
    {
      "text": "Eva Sharma and Munmun De Choudhury. 2018. Mental health support and its relationship to linguistic accommodation in online communities. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174215"
    },
    {
      "text": "Leann E. Smith and Kimberly S. Howard. 2008. Continuity of Paternal Social Support and Depressive Symptoms among New Mothers. Journal of family psychology : JFP : journal of the Division of Family Psychology of the American Psychological Association (Division 43) 22, 5 (Oct. 2008), 763–773. https://doi.org/10.1037/a0013581",
      "doi": ""
    },
    {
      "text": "Alexandru Stana and Alanna R Miller. 2019. “Being a mom= having all the feels”: social support in a postpartum depression online support group. Atlantic Journal of Communication 27, 5 (2019), 297–310.",
      "doi": ""
    },
    {
      "text": "Yaoyao Sun, Yanyan Li, Juan Wang, Qingyi Chen, Alessandra N. Bazzano, and Fenglin Cao. 2021. Effectiveness of Smartphone-Based Mindfulness Training on Maternal Perinatal Depression: Randomized Controlled Trial. Journal of Medical Internet Research 23, 1 (Jan. 2021), e23410. https://doi.org/10.2196/23410 Company: Journal of Medical Internet Research Distributor: Journal of Medical Internet Research Institution: Journal of Medical Internet Research Label: Journal of Medical Internet Research Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Dominique Teaford, Susan McNiesh, and Deepika Goyal. 2019. New Mothers’ Experiences with Online Postpartum Forums. MCN: The American Journal of Maternal/Child Nursing 44, 1 (Feb. 2019), 40–45. https://doi.org/10.1097/NMC.0000000000000489",
      "doi": ""
    },
    {
      "text": "Dominique Teaford, Susan McNiesh, and Deepika Goyal. 2019. New mothers’ experiences with online postpartum forums. MCN: The American Journal of Maternal/Child Nursing 44, 1 (2019), 40–45.",
      "doi": ""
    },
    {
      "text": "Ashton Shalene Tranmer 2013. Barriers to care for women with postpartum depression: an integrative review of the qualitative literature. (2013).",
      "doi": ""
    },
    {
      "text": "Amanda J Wagg, Margie M Callanan, and Alexander Hassett. 2019. Online social support group use by breastfeeding mothers: A content analysis. Heliyon 5, 3 (2019), e01245.",
      "doi": ""
    },
    {
      "text": "Joan Webster, Catherine Nicholas, Catherine Velacott, Noelle Cridland, and Lisa Fawcett. 2011. Quality of life and depression following childbirth: impact of social support. Midwifery 27, 5 (Oct. 2011), 745–749. https://doi.org/10.1016/j.midw.2010.05.014",
      "doi": ""
    },
    {
      "text": "Bo Xie. 2008. Multimodal computer-mediated communication and social support among older Chinese internet users. Journal of Computer-Mediated Communication 13, 3 (2008), 728–750.",
      "doi": ""
    },
    {
      "text": "Hye Sun Yun, Matias Volonte, and Timothy Bickmore. 2022. Motivating health behavior change with a storytelling virtual agent. In Proceedings of the 22nd ACM International Conference on Intelligent Virtual Agents. 1–3.",
      "doi": "10.1145/3514197.3549684"
    },
    {
      "text": "Michael Zimmer. 2010. “But the data is already public”: on the ethics of research in Facebook. Ethics and information technology 12, 4 (2010), 313–325.",
      "doi": ""
    },
    {
      "text": "Alexandra Zingg, Tavleen Singh, and Sahiti Myneni. 2021. Analysis of Online Peripartum Depression Communities: Application of Multilabel Text Classification Techniques to Inform Digitally-Mediated Prevention and Management. Frontiers in Digital Health 3 (2021).",
      "doi": ""
    },
    {
      "text": "Pedro Fonseca Zuccolo, Mariana O. Xavier, Alicia Matijasevich, Guilherme Polanczyk, and Daniel Fatori. 2021. A smartphone-assisted brief online cognitive-behavioral intervention for pregnant women with depression: a study protocol of a randomized controlled trial. Trials 22, 1 (March 2021), 1–19. https://doi.org/10.1186/s13063-021-05179-8",
      "doi": ""
    }
  ]
}