{
  "doi": "10.1145/3544548.3580733",
  "title": "Independence for Whom? A Critical Discourse Analysis of Onboarding a Home Health Monitoring System for Older Adult Care",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Home health monitoring systems (HHMS) are presented as a cost-effective solution that will assist with collaborative care of older adults. However, instead of care recipients feeling like collaborators, such systems often disempower them. In this paper, we examine the dissemination, onboarding, and initial use of an HHMS to see how the discourse used by developers and participants affects users’ collaborative care efforts. We found that the textual information provided often contrasted with how our participants managed their care. Instead of providing participants with ‘independence,’ ‘safety,’ and ‘peace of mind,’ care recipients were placed in a more dependent, less proactive role, and care providers were pressured to take on more responsibilities. We position HHMS, as they are currently marketed and onboarded, as normalizing pseudo-institutionalization. As an alternative we advocate that the discourse and design of such systems should reflect and re-enforce the varied roles care recipients take in managing their care.",
  "tags": [
    "accessibility",
    "onboarding",
    "critical discourse analysis",
    "older adults"
  ],
  "authors": [
    {
      "name": "Elaine Czech",
      "institution": "Bristol Interaction Group, University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-99659366816/rel-imgonly/chi-monday-student-47.jpg",
      "acmid": "99659366816",
      "orcid": "0000-0002-8923-0085"
    },
    {
      "name": "Ewan Soubutts",
      "institution": "Bristol Interaction Group, University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659758980",
      "orcid": "0000-0002-2018-0569"
    },
    {
      "name": "Rachel Eardley",
      "institution": "University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81320489242/rel-imgonly/me.png",
      "acmid": "81320489242",
      "orcid": "0000-0002-4838-3413"
    },
    {
      "name": "Aisling Ann O'Kane",
      "institution": "University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81484657437/rel-imgonly/headshot.jpg",
      "acmid": "81484657437",
      "orcid": "0000-0001-8219-8126"
    }
  ],
  "references": [
    {
      "text": "Rikke Aarhus and Stinne Aaløkke Ballegaard. 2010. Negotiating Boundaries: Managing Disease at Home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1223–1232. https://doi.org/10.1145/1753326.1753509",
      "doi": "10.1145/1753326.1753509"
    },
    {
      "text": "Rikke Aarhus, Stinne Aaløkke Ballegaard, and Thomas Riisgaard Hansen. 2009. The eDiary: Bridging home and hospital through healthcare technology. In ECSCW 2009. Springer, London, 63–83.",
      "doi": ""
    },
    {
      "text": "Juan C Aceros, Jeannette Pols, and Miquel Domènech. 2015. Where is grandma? Home telecare, good aging and the domestication of later life. Technological Forecasting and Social Change 93 (2015), 102–111.",
      "doi": ""
    },
    {
      "text": "Zahid Ahmed, Jian Zhang, Khalid Ahmed, Muhammad Farrukh, and Muhammad Nauman Irshad. 2019. Manipulation of Pakistani Women through Skin-Whitening Advertising Discourse. In Proceedings of the 2019 3rd International Conference on Management Engineering, Software Engineering and Service Sciences (Wuhan, China) (ICMSS 2019). Association for Computing Machinery, New York, NY, USA, 107–111. https://doi.org/10.1145/3312662.3312705",
      "doi": "10.1145/3312662.3312705"
    },
    {
      "text": "Rene Albertus, Ojelanki Ngwenyama, and Irwin Brown. 2015. A Critical Discourse Analysis of Governance Issues Affecting Public Private Partnership Contracting for Information Systems Implementations: A South African Case Study. In Proceedings of the 2015 Annual Research Conference on South African Institute of Computer Scientists and Information Technologists (Stellenbosch, South Africa) (SAICSIT ’15). Association for Computing Machinery, New York, NY, USA, Article 4, 10 pages. https://doi.org/10.1145/2815782.2815800",
      "doi": "10.1145/2815782.2815800"
    },
    {
      "text": "Amazon. 2022. Alexa Together. https://us.amazon.com/Alexa-Together/b?node=21390531011",
      "doi": ""
    },
    {
      "text": "Hilary Arksey and Caroline Glendinning. 2007. Choice in the context of informal care-giving. Health & Social Care in the Community 15, 2 (2007), 165–175.",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Paul Marshall, and Anna L Cox. 2020. Trackly: A customisable and pictorial self-tracking app to support agency in multiple sclerosis self-care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3313831.3376809"
    },
    {
      "text": "Mark S Baldwin, Sen H Hirano, Jennifer Mankoff, and Gillian R Hayes. 2019. Design in the public square: Supporting assistive technology design through public mixed-ability cooperation. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3359257"
    },
    {
      "text": "Belén Barros Pena, Rachel E Clarke, Lars Erik Holmquist, and John Vines. 2021. Circumspect users: Older adults as critical adopters and resistors of technology. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3411764.3445128"
    },
    {
      "text": "Vince Bartle, Janice Lyu, Freesoul El Shabazz-Thompson, Yunmin Oh, Angela Anqi Chen, Yu-Jan Chang, Kenneth Holstein, and Nicola Dell. 2022. “A Second Voice”: Investigating Opportunities and Challenges for Interactive Voice Assistants to Support Home Health Aides. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 45, 17 pages. https://doi.org/10.1145/3491102.3517683",
      "doi": "10.1145/3491102.3517683"
    },
    {
      "text": "John Bell, Gerald Dziekan, Charles Pollack, and Varocha Mahachai. 2016. Self-care in the twenty first century: a vital role for the pharmacist. Advances in Therapy 33, 10 (2016), 1691–1703.",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence as a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility(Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 161–173. https://doi.org/10.1145/3234695.3236348",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Andrew BL Berry, Catherine Lim, Andrea L Hartzler, Tad Hirsch, Edward H Wagner, Evette Ludman, and James D Ralston. 2017. How values shape collaboration between patients with multiple chronic conditions and spousal caregivers. In Proceedings of the 2017 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 5257–5270.",
      "doi": "10.1145/3025453.3025923"
    },
    {
      "text": "Cini Bhanu, Christina Avgerinou, Kalpa Kharicha, Yehudit Bauernfreund, Helen Croker, Ann Liljas, Jennifer Rea, Maggie Kirby-Barr, Jane Hopkins, and Kate Walters. 2020. ‘I’ve never drunk very much water and I still don’t, and I see no reason to do so’: a qualitative study of the views of community-dwelling older people and carers on hydration in later life. Age and ageing 49, 1 (2020), 111–118.",
      "doi": ""
    },
    {
      "text": "Karthik S Bhat and Neha Kumar. 2020. Sociocultural dimensions of tracking health and taking care. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24.",
      "doi": "10.1145/3415200"
    },
    {
      "text": "Birdie. 2022. All-in-one homecare software: Built as one. http://www.birdie.care/",
      "doi": ""
    },
    {
      "text": "Jeremy Birnholtz and McKenzie Jones-Rounds. 2010. Independence and interaction: understanding seniors’ privacy and awareness needs for aging in place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 143–152.",
      "doi": "10.1145/1753326.1753349"
    },
    {
      "text": "Linda Boise, Katherine Wild, Nora Mattek, Mary Ruhl, Hiroko H Dodge, and Jeffrey Kaye. 2013. Willingness of older adults to share data and privacy concerns after exposure to unobtrusive in-home monitoring. Gerontechnology: international journal on the fundamental aspects of technology to serve the ageing society 11, 3 (2013), 428.",
      "doi": ""
    },
    {
      "text": "Birgit Burböck, Viktoria Kubli, Anita Maček, and Vito Bobek. 2019. Effects of different types of framing in advertising messages on human decision behaviour. International Journal of Diplomacy and Economy 5, 1 (2019), 27–41.",
      "doi": ""
    },
    {
      "text": "Camille Burnett, Marilyn Ford-Gilboe, Helene Berman, Cathy Ward-Griffin, and Nadine Wathen. 2015. A critical discourse analysis of provincial policies impacting shelter service delivery to women exposed to violence. Policy, Politics, & Nursing Practice 16, 1-2 (2015), 5–16.",
      "doi": ""
    },
    {
      "text": "Alison Burrows, Rachael Gooberman-Hill, and David Coyle. 2016. Shared language and the design of home healthcare technology. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3584–3594.",
      "doi": "10.1145/2858036.2858496"
    },
    {
      "text": "Robert N Butler. 1980. Ageism: A foreword.Journal of social issues 36, 2 (1980), 147–154.",
      "doi": ""
    },
    {
      "text": "Clara Caldeira, Matthew Bietz, Marisol Vidauri, and Yunan Chen. 2017. Senior care for aging in place: balancing assistance and independence. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. Association for Computing Machinery, New York, NY, USA, 1605–1617.",
      "doi": "10.1145/2998181.2998206"
    },
    {
      "text": "[25] Cera Care.2021. http://www.cerahq.com/",
      "doi": ""
    },
    {
      "text": "Chen Chen, Janet G Johnson, Kemeberly Charles, Alice Lee, Ella T Lifset, Michael Hogarth, Alison A Moore, Emilia Farcas, and Nadir Weibel. 2021. Understanding Barriers and Design Opportunities to Improve Healthcare and QOL for Older Adults through Voice Assistants. In Proceedings of the 23rd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, USA) (ASSETS ’21). Association for Computing Machinery, New York, NY, USA, Article 9, 16 pages. https://doi.org/10.1145/3441852.3471218",
      "doi": "10.1145/3441852.3471218"
    },
    {
      "text": "Yanjie Chen and Hui Jia. 2022. A Corpus-Based Critical Discourse Analysis of COP 26 in Chinese and Western Media. In Proceedings of the 5th International Conference on Big Data and Education (Shanghai, China) (ICBDE ’22). Association for Computing Machinery, New York, NY, USA, 379–386. https://doi.org/10.1145/3524383.3524418",
      "doi": "10.1145/3524383.3524418"
    },
    {
      "text": "Jiamin Dai and Karyn Moffatt. 2021. Surfacing the voices of people with dementia: Strategies for effective inclusion of proxy stakeholders in qualitative research. In Proceedings of the 2021 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3411764.3445756"
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. \" It doesn’t win you friends\" Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": ""
    },
    {
      "text": "Emma Dixon, Anne Marie Piper, and Amanda Lazar. 2021. “Taking care of myself as long as I can”: How People with Dementia Configure Self-Management Systems. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3411764.3445225"
    },
    {
      "text": "Docobo. 2022. Remote Patient Monitoring and Demand Analytics for clinicians. http://www.docobo.co.uk/",
      "doi": ""
    },
    {
      "text": "Julie Doyle, Niamh Caprani, and Rodd Bond. 2015. Older adults’ attitudes to self-management of health and wellness through smart home data. In 2015 9th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth). IEEE, New York, New York, 129–136. https://doi.org/10.4108/icst.pervasivehealth.2015.259279",
      "doi": ""
    },
    {
      "text": "Rachel Eardley, Sue Mackinnon, Emma L Tonkin, Ewan Soubutts, Amid Ayobi, Jess Linington, Gregory JL Tourte, Zoe Banks Gross, David J Bailey, Russell Knights, 2022. A Case Study Investigating a User-Centred and Expert Informed’Companion Guide’for a Complex Sensor-based Platform. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 6, 2 (2022), 1–23.",
      "doi": "10.1145/3534625"
    },
    {
      "text": "Norman Fairclough. 2013. Critical discourse analysis: The critical study of language. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Monique Ferry. 2005. Strategies for ensuring good hydration in the elderly. Nutrition reviews 63, suppl_1 (2005), S22–S29.",
      "doi": ""
    },
    {
      "text": "Mads Frost, Afsaneh Doryab, Maria Faurholt-Jepsen, Lars Vedel Kessing, and Jakob E Bardram. 2013. Supporting disease insight through data analysis: refinements of the monarca self-assessment system. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. Association for Computing Machinery, New York, NY, USA, 133–142.",
      "doi": "10.1145/2493432.2493507"
    },
    {
      "text": "Katharine Fuchigami, Colleen McGrath, Jordana Bengall, Stephanie Kim, and Debbie Laliberte Rudman. 2022. Assistive Technology Use among Older Adults with Vision Loss: A Critical Discourse Analysis of Canadian Newspapers. Canadian Journal on Aging/La Revue canadienne du vieillissement 41, 2(2022), 154–163.",
      "doi": ""
    },
    {
      "text": "Christine Geeng and Franziska Roesner. 2019. Who’s in control? Interactions in multi-user smart homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Shreenita Ghosh and Ritomaitree Sarkar. 2017. Comparing Civility and Inclusivity of E-Discussion Forum and Radio Talk Platform: A Critical Discourse Analysis of User Comments on the Newest and Oldest ’Faceless’, Mediated Discursive Spaces. In Proceedings of the 8th International Conference on Social Media & Society (Toronto, ON, Canada) (SMSociety17). Association for Computing Machinery, New York, NY, USA, Article 34, 5 pages. https://doi.org/10.1145/3097286.3097320",
      "doi": "10.1145/3097286.3097320"
    },
    {
      "text": "Veronica Greco and Derek Roger. 2003. Uncertainty, stress, and health. Personality and Individual differences 34, 6 (2003), 1057–1068.",
      "doi": ""
    },
    {
      "text": "Trisha Greenhalgh, Rosamund Snow, Sara Ryan, Sian Rees, and Helen Salisbury. 2015. Six ‘biases’ against patients and carers in evidence-based medicine. BMC medicine 13, 1 (2015), 1–11.",
      "doi": ""
    },
    {
      "text": "Connie Guan, Anya Bouzida, Ramzy M Oncy-Avila, Sanika Moharana, and Laurel D Riek. 2021. Taking an (embodied) cue from community health: Designing dementia caregiver support technology to advance health equity. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": "10.1145/3411764.3445559"
    },
    {
      "text": "Francisco J. Gutierrez and Sergio F. Ochoa. 2017. It Takes at Least Two to Tango: Understanding the Cooperative Nature of Elderly Caregiving in Latin America. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1618–1630. https://doi.org/10.1145/2998181.2998314",
      "doi": "10.1145/2998181.2998314"
    },
    {
      "text": "Maria Haak, Agneta Fänge, Susanne Iwarsson, and Synneve Dahlin Ivanoff. 2007. Home as a signification of independence and autonomy: experiences among very old Swedish people. Scandinavian journal of occupational therapy 14, 1 (2007), 16–24.",
      "doi": ""
    },
    {
      "text": "Michael Alexander Kirkwood Halliday and Christian MIM Matthiessen. 2013. Halliday’s introduction to functional grammar. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Larissa Hjorth and Deborah Lupton. 2021. Digitised caring intimacies: more-than-human intergenerational care in Japan. International Journal of Cultural Studies 24, 4 (2021), 584–602.",
      "doi": ""
    },
    {
      "text": "Michael Jeffrey Daniel Hoefer, Lucy Van Kleunen, Cassandra Goodby, Lanea Blyss Blackburn, Priyanka Panati, and Stephen Voida. 2021. The Multiplicative Patient and the Clinical Workflow: Clinician Perspectives on Social Interfaces for Self-Tracking and Managing Bipolar Disorder. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 907–925. https://doi.org/10.1145/3461778.3461995",
      "doi": "10.1145/3461778.3461995"
    },
    {
      "text": "Amy S Hwang, Piper Jackson, Andrew Sixsmith, Louise Nygård, Arlene Astell, Khai N Truong, and Alex Mihailidis. 2020. Exploring how persons with dementia and care partners collaboratively appropriate information and communication technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 6(2020), 1–38.",
      "doi": "10.1145/3389377"
    },
    {
      "text": "Netta Iivari, Marianne Kinnula, and Leena Kuure. 2015. With best intentions: A Foucauldian examination on children’s genuine participation in ICT design. Information Technology & People 28, 2 (2015), 246–280.",
      "doi": ""
    },
    {
      "text": "Hilary Janks. 1997. Critical discourse analysis as a research tool. Discourse: studies in the cultural politics of education 18, 3(1997), 329–342.",
      "doi": ""
    },
    {
      "text": "Florence Jusot, Zeynep Or, and Nicolas Sirven. 2012. Variations in preventive care utilisation in Europe. European Journal of Ageing 9, 1 (2012), 15–25.",
      "doi": ""
    },
    {
      "text": "Elizabeth Kaziunas, Mark S. Ackerman, Silvia Lindtner, and Joyce M. Lee. 2017. Caring through Data: Attending to the Social and Emotional Experiences of Health Datafication. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 2260–2272. https://doi.org/10.1145/2998181.2998303",
      "doi": "10.1145/2998181.2998303"
    },
    {
      "text": "Betty M Kennedy, Matloob Rehman, William D Johnson, Michelle B Magee, Robert Leonard, and Peter T Katzmarzyk. 2017. Healthcare providers versus patients’ understanding of health beliefs and values. Patient experience journal 4, 3 (2017), 29.",
      "doi": ""
    },
    {
      "text": "Cayla Key, Fiona Browne, Nick Taylor, and Jon Rogers. 2021. Proceed with Care: Reimagining Home IoT Through a Care Perspective. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 166, 15 pages. https://doi.org/10.1145/3411764.3445602",
      "doi": "10.1145/3411764.3445602"
    },
    {
      "text": "Bethany Kon, Alex Lam, and Jonathan Chan. 2017. Evolution of Smart Homes for the Elderly. In Proceedings of the 26th International Conference on World Wide Web Companion (Perth, Australia) (WWW ’17 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 1095–1101. https://doi.org/10.1145/3041021.3054928",
      "doi": "10.1145/3041021.3054928"
    },
    {
      "text": "Pranav Kulkarni, Orla Duffy, Jonathan Synnott, W George Kernohan, Roisin McNaney, 2022. Speech and Language Practitioners’ Experiences of Commercially Available Voice-Assisted Technology: Web-Based Survey Study. JMIR Rehabilitation and Assistive Technologies 9, 1(2022), e29249.",
      "doi": ""
    },
    {
      "text": "Mark S Lachs and Karl Pillemer. 2004. Elder abuse. The Lancet 364, 9441 (2004), 1263–1272.",
      "doi": ""
    },
    {
      "text": "Emily LaRosa and David Danks. 2018. Impacts on Trust of Healthcare AI. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (New Orleans, LA, USA) (AIES ’18). Association for Computing Machinery, New York, NY, USA, 210–215. https://doi.org/10.1145/3278721.3278771",
      "doi": "10.1145/3278721.3278771"
    },
    {
      "text": "Amanda Lazar, Hilaire J Thompson, Shih-Yin Lin, and George Demiris. 2018. Negotiating relation work with telehealth home care companionship technologies that support aging in place. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–19.",
      "doi": "10.1145/3274372"
    },
    {
      "text": "Lilli. 2022. The Future of Independent Living. https://www.intelligentlilli.com/",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2021. “Sharing Is Caring:” Australian self-trackers’ concepts and practices of personal data sharing and privacy. Frontiers in Digital Health 3 (2021), 15.",
      "doi": ""
    },
    {
      "text": "Cora Lyndon. 2021. Dorset Council pilot AI tech for social care teams. https://www.digitalhealth.net/2021/08/dorset-council-pilot-ai-tech/",
      "doi": ""
    },
    {
      "text": "Kevin M. Storer and Stacy M. Branham. 2021. Deinstitutionalizing Independence: Discourses of Disability and Housing in Accessible Computing. In Proceedings of the 23rd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, USA) (ASSETS ’21). Association for Computing Machinery, New York, NY, USA, Article 31, 14 pages. https://doi.org/10.1145/3441852.3471213",
      "doi": "10.1145/3441852.3471213"
    },
    {
      "text": "Greg Marston. 2002. Critical discourse analysis and policy-orientated housing research. Housing, Theory and Society 19, 2 (2002), 82–91.",
      "doi": ""
    },
    {
      "text": "Niharika Mathur, Kunal Dhodapkar, Tamara Zubatiy, Jiachen Li, Brian Jones, and Elizabeth Mynatt. 2022. A Collaborative Approach to Support Medication Management in Older Adults with Mild Cognitive Impairment Using Conversational Assistants (CAs). In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility (Athens, Greece) (ASSETS ’22). Association for Computing Machinery, New York, NY, USA, Article 42, 14 pages. https://doi.org/10.1145/3517428.3544830",
      "doi": "10.1145/3517428.3544830"
    },
    {
      "text": "Carol C McDonough. 2016. The effect of ageism on the digital divide among older adults. J. Gerontol. Geriatr. Med 2, 008 (2016), 1–7.",
      "doi": ""
    },
    {
      "text": "Dana McKay and Charlynn Miller. 2021. Standing in the Way of Control: A Call to Action to Prevent Abuse through Better Design of Smart Technologies. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 332, 14 pages. https://doi.org/10.1145/3411764.3445114",
      "doi": "10.1145/3411764.3445114"
    },
    {
      "text": "Merriam-Webster. 2022. Keep. https://www.merriam-webster.com/dictionary/keep",
      "doi": ""
    },
    {
      "text": "Annemarie Mol. 2009. Living with diabetes: care beyond choice and control. The Lancet 373, 9677 (2009), 1756–1757.",
      "doi": ""
    },
    {
      "text": "Maggie Mort, Celia Roberts, Jeannette Pols, Miquel Domenech, Ingunn Moser, and EFORTT investigators. 2015. Ethical implications of home telecare for older people: a framework derived from a multisited participative study. Health Expectations 18, 3 (2015), 438–449.",
      "doi": ""
    },
    {
      "text": "Louis Neven and Alexander Peine. 2017. From triple win to triple sin: How a problematic future discourse is shaping the way people age with technology. Societies 7, 3 (2017), 26.",
      "doi": ""
    },
    {
      "text": "Willem F Nieuwenhuizen, Hugo Weenen, Paul Rigby, and Marion M Hetherington. 2010. Older adults and patients in need of nutritional support: review of current treatment options and factors influencing nutritional intake. Clinical nutrition 29, 2 (2010), 160–169.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-care technologies in HCI: Trends, tensions, and opportunities. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 6(2015), 1–45.",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Leysan Nurgalieva, Alisa Frik, Francesco Ceschel, Serge Egelman, and Maurizio Marchese. 2019. Information Design in An Aged Care Context: Views of Older Adults on Information Sharing in a Care Triad. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare (Trento, Italy) (PervasiveHealth’19). Association for Computing Machinery, New York, NY, USA, 101–110. https://doi.org/10.1145/3329189.3329211",
      "doi": "10.1145/3329189.3329211"
    },
    {
      "text": "World Health Organization. 2014. Active ageing: A policy framework. World Health Organization, Geneva, Switzerland.",
      "doi": ""
    },
    {
      "text": "Marjo Outila and Hilla Kiuru. 2020. “Picturephone in My Home”: Actor-Network Theory and Foucauldian Discourse Analysis on Northern Finnish Older Adults Starting to Use a Video Conferencing Service. Journal of Technology in Human Services 39, 2 (2020), 163–192.",
      "doi": ""
    },
    {
      "text": "Geunhye Park, Erin L. Robinson, Shradha Shalini, Marjorie Skubic, Brianna Markway, Amanda Hill, Kari Lane, and Marilyn Rantz. 2021. Integrating Voice-Assisted Technology with an In-Home Sensor System: Exploring the Development of a Participant-Based Design Study. In Proceedings of the 14th EAI International Conference on Pervasive Computing Technologies for Healthcare(Atlanta, GA, USA) (PervasiveHealth ’20). Association for Computing Machinery, New York, NY, USA, 375–379. https://doi.org/10.1145/3421937.3421949",
      "doi": "10.1145/3421937.3421949"
    },
    {
      "text": "Subriena Persaud, Liz Grauerholz, and Amanda Koontz Anthony. 2018. Gendered representations and portrayals in technology advertisements: Exploring variations by age, race and ethnicity. Gender Issues 35, 2 (2018), 137–152.",
      "doi": ""
    },
    {
      "text": "A. Pollock, C. Leys, and D. Rowland. 2005. NHS Plc: The Privatisation of Our Health Care. Verso, London. https://books.google.co.uk/books?id=eT_9EynhnDoC",
      "doi": ""
    },
    {
      "text": "Anne Margriet Pot, Bernadette M Willemse, and Sarah Horjus. 2012. A pilot study on the use of tracking technology: feasibility, acceptability, and benefits for people in early stages of dementia and their informal caregivers. Aging & mental health 16, 1 (2012), 127–134.",
      "doi": ""
    },
    {
      "text": "Sheridan T Read, Christine Toye, and Dianne Wynaden. 2017. Experiences and expectations of living with dementia: A qualitative study. Collegian 24, 5 (2017), 427–432.",
      "doi": ""
    },
    {
      "text": "Joel Michael Reynolds. 2018. The extended body: on aging, disability, and well-being. Hastings Center Report 48 (2018), S31–S36.",
      "doi": ""
    },
    {
      "text": "Mary Ryan and Greer Johnson. 2009. Negotiating multiple identities between school and the outside world: A critical discourse analysis. Critical Studies in Education 50, 3 (2009), 247–260.",
      "doi": ""
    },
    {
      "text": "Jessica Schroeder, Jane Hoffswell, Chia-Fang Chung, James Fogarty, Sean Munson, and Jasmine Zia. 2017. Supporting Patient-Provider Collaboration to Identify Individual Triggers Using Food and Symptom Journals. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1726–1739. https://doi.org/10.1145/2998181.2998276",
      "doi": "10.1145/2998181.2998276"
    },
    {
      "text": "Mark Schurgin, Mark Schlager, Laura Vardoulakis, Laura R. Pina, and Lauren Wilcox. 2021. Isolation in Coordination: Challenges of Caregivers in the USA. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 652, 14 pages. https://doi.org/10.1145/3411764.3445413",
      "doi": "10.1145/3411764.3445413"
    },
    {
      "text": "National Health Service. 2021. £36 million boost for AI technologies to revolutionise NHS care. https://www.gov.uk/government/news/36-million-boost-for-ai-technologies-to-revolutionise-nhs-care",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, Laurianne Sitbon, Aloha Hufana Ambe, Jennyfer Lawrence Taylor, and Cara Wilson. 2020. Beyond Independence: Enabling Richer Participation through Relational Technologies. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction (Fremantle, WA, Australia) (OZCHI’19). Association for Computing Machinery, New York, NY, USA, 149–160. https://doi.org/10.1145/3369457.3369470",
      "doi": "10.1145/3369457.3369470"
    },
    {
      "text": "Ewan Soubutts, Amid Ayobi, Rachel Eardley, Kirsten Cater, and Aisling Ann O’Kane. 2021. Aging in Place Together: The Journey Towards Adoption and Acceptance of Stairlifts in Multi-Resident Homes. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–26.",
      "doi": "10.1145/3476061"
    },
    {
      "text": "Ewan Soubutts, Amid Ayobi, Rachel Eardley, Roisin McNaney, Kirsten Cater, and Aisling Ann O’Kane. 2022. Amazon Echo Show as a Multimodal Human-to-Human Care Support Tool within Self-Isolating Older UK Households, In Proceedings of the ACM on Human-Computer Interaction (PACMHCI). Proc. ACM Hum.-Comput. Interact. 6, CSCW2, Article 302, 31 pages. https://doi.org/10.1145/3555193",
      "doi": "10.1145/3555193"
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, and Geraldine Fitzpatrick. 2017. Experiences of autistic children with technologies. International Journal of Child-Computer Interaction 11 (2017), 50–61.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Eva Hornecker, and Geraldine Fitzpatrick. 2017. When Empathy Is Not Enough: Assessing the Experiences of Autistic Children with Technologies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2853–2864. https://doi.org/10.1145/3025453.3025785",
      "doi": "10.1145/3025453.3025785"
    },
    {
      "text": "Katarzyna Stawarz, Anna L. Cox, and Ann Blandford. 2015. Beyond Self-Tracking and Reminders: Designing Smartphone Apps That Support Habit Formation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2653–2662. https://doi.org/10.1145/2702123.2702230",
      "doi": "10.1145/2702123.2702230"
    },
    {
      "text": "Jina Suh, Spencer Williams, Jesse R. Fann, James Fogarty, Amy M. Bauer, and Gary Hsieh. 2020. Parallel Journeys of Patients with Cancer and Depression: Challenges and Opportunities for Technology-Enabled Collaborative Care. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 38 (may 2020), 36 pages. https://doi.org/10.1145/3392843",
      "doi": "10.1145/3392843"
    },
    {
      "text": "RP Symonds, K Lord, AJ Mitchell, and D Raghavan. 2012. Recruitment of ethnic minorities into cancer clinical trials: experience from the front lines. British journal of cancer 107, 7 (2012), 1017–1021.",
      "doi": ""
    },
    {
      "text": "Gill R Toms, Catherine Quinn, Daniel E Anderson, and Linda Clare. 2015. Help yourself: perspectives on self-management from people with dementia and their caregivers. Qualitative health research 25, 1 (2015), 87–98.",
      "doi": ""
    },
    {
      "text": "Tammy Toscos, Kay Connelly, and Yvonne Rogers. 2012. Best Intentions: Health Monitoring Technology and Children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1431–1440. https://doi.org/10.1145/2207676.2208603",
      "doi": "10.1145/2207676.2208603"
    },
    {
      "text": "Yvette Vermeer, Paul Higgs, and Georgina Charlesworth. 2018. Marketing of surveillance technology in three ageing countries. Quality in Ageing and Older Adults 20, 1 (2018), 20–33.",
      "doi": ""
    },
    {
      "text": "Beatrice Vincenzi, Alex S Taylor, and Simone Stumpf. 2021. Interdependence in Action: People with Visual Impairments and Their Guides Co-Constituting Common Spaces. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–33.",
      "doi": "10.1145/3449143"
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An age-old problem: Examining the discourses of ageing in HCI and strategies for future research. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 1(2015), 1–27.",
      "doi": "10.1145/2696867"
    },
    {
      "text": "Alex Wennberg, Henrik Åhman, and Anders Hedman. 2018. The Intuitive in HCI: A Critical Discourse Analysis. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). Association for Computing Machinery, New York, NY, USA, 505–514. https://doi.org/10.1145/3240167.3240202",
      "doi": "10.1145/3240167.3240202"
    },
    {
      "text": "Langdon Winner. 1980. Do Artifacts Have Politics?Daedalus 109, 1 (1980), 121–136. http://www.jstor.org/stable/20024652",
      "doi": ""
    },
    {
      "text": "Ruth Wodak and Michael Meyer. 2009. Critical discourse analysis: History, agenda, theory and methodology. Methods of critical discourse analysis 2 (2009), 1–33.",
      "doi": ""
    },
    {
      "text": "Karen Wotton, Karina Crannitch, and Rebecca Munt. 2008. Prevalence, risk factors and strategies to prevent dehydration in older adults. Contemporary nurse 31, 1 (2008), 44–56.",
      "doi": ""
    },
    {
      "text": "Wanyu Xi, Xin Zhang, and Liat Ayalon. 2022. The framing effect of intergenerational comparison of technologies on technophobia among older adults. The Journals of Gerontology: Series B 77, 7 (2022), 1179–1185.",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Takashi Kudo, Keiji Hirata, Eiji Aramaki, and Kazuki Hattori. 2018. How Information Sharing about Care Recipients by Family Caregivers Impacts Family Communication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173796",
      "doi": "10.1145/3173574.3173796"
    },
    {
      "text": "Yue You, Yubo Kou, Xianghua(Sharon) Ding, and Xinning Gui. 2021. The Medical Authority of AI: A Study of AI-Enabled Consumer-Facing Health Technology. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 207, 16 pages. https://doi.org/10.1145/3411764.3445657",
      "doi": "10.1145/3411764.3445657"
    }
  ]
}