{
  "doi": "10.1145/3544548.3580946",
  "title": "What’s the Norm Around Here? Individuals’ Responses Can Mitigate the Effects of Misinformation Prevalence in Shaping Perceptions of a Community",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-27",
  "year": 2023,
  "badges": [],
  "abstract": "Social norms play a significant role in how conspiratorial content and related misinformation impact online communities. However, less is understood about the mechanisms by which particular aspects of a community may drive perceptions of social norms in the community. Using anti-vaccine conspiracies as a testbed, this paper experimentally examines three such features and their relationships : prevalence of conspiratorial content, community response, and explicit community rules. Results show that prevalence of content has a significant effect on norm perceptions, while the results did not support the effects of explicit rule on norm perceptions. However, these effects can be mitigated by the way a community responds to such content. Furthermore, perceived norms also influence other expectations about the community, from escalated behaviors to belief in other conspiracy theories. The paper concludes by highlighting the implications of these findings for online platform design, for community governance, and for future research about the relationships among conspiratorial content and norm perceptions.",
  "tags": [
    "Social Norms",
    "Perceived Norms",
    "Conspiracy Theories",
    "Anti-vaccine",
    "Online Communities",
    "Misleading Content",
    "Misinformation"
  ],
  "authors": [
    {
      "name": "Zhila Aghajari",
      "institution": "Computer Science and Engineering, Lehigh University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781410",
      "orcid": "0000-0003-2982-564X"
    },
    {
      "name": "Eric P. S. Baumer",
      "institution": "Computer Science & Engineering, Lehigh University, United States",
      "img": "/do/10.1145/contrib-81311485671/rel-imgonly/dsc_3664-edit-square.png",
      "acmid": "81311485671",
      "orcid": "0000-0001-5338-4421"
    },
    {
      "name": "Dominic DiFranzo",
      "institution": "Computer Science and Engineering, Lehigh University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655026",
      "orcid": "0000-0001-6039-1806"
    }
  ],
  "references": [
    {
      "text": "2017. Fact-checking fake news on Facebook works - just too slowly.https://apnews.com/article/north-america-technology-business-fake-news-ap-fact-check-e03283b4169f4d8c8a7e51042d61bcb5.",
      "doi": ""
    },
    {
      "text": "2017. The Truman Platform. https://socialmedialab.cornell.edu/the-truman-platform/",
      "doi": ""
    },
    {
      "text": "2018. How whatsapp helped turn an Indian village into a lynch mob. https://www.bbc.com/news/world-asia-india-44856910",
      "doi": ""
    },
    {
      "text": "2020. Expanding Facebook’s U.S. Fact-Checking Program and Supporting the Fact-Checking Ecosystem. https://www.facebook.com/journalismproject/fact-checking-expansion-and-investment-2020",
      "doi": ""
    },
    {
      "text": "2021. Twitter launches crowd-sourced fact-checking project. https://apnews.com/article/twitter-launch-crowd-sourced-fact-check-589809d4c9a7eceda1ea8293b0a14af2",
      "doi": ""
    },
    {
      "text": "2022. Latent variable analysis [R package lavaan version 0.6-12]. https://cran.r-project.org/web/packages/lavaan/",
      "doi": ""
    },
    {
      "text": "Zhila Aghajari, Eric P. S. Baumer, and Dominic DiFranzo. 2023. Reviewing Interventions to Address Misinformation: The Need to Expand Our Vision Beyond an Individualistic Focus. Proceedings of the ACM on Human-Computer Interaction 7, CSCW1(2023).",
      "doi": "10.1145/3579520"
    },
    {
      "text": "Zhila Aghajari, Eric P. S. Baumer, Jess Hohenstein, Malte F. Jung, and Dominic DiFranzo. 2023. Methodological Middle Spaces: Addressing the Need for Methodological Innovation to Achieve Simultaneous Realism, Control, and Scalability in Experimental Studies of AI-Mediated Communication. Proceedings of the ACM on Human-Computer Interaction 7, CSCW1(2023).",
      "doi": "10.1145/3579506"
    },
    {
      "text": "Kimberley R Allison, Kay Bussey, and Naomi Sweller. 2019. ’I’m going to hell for laughing at this’ Norms, Humour, and the Neutralisation of Aggression in Online Communities. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": ""
    },
    {
      "text": "Ashley A Anderson, Sara K Yeo, Dominique Brossard, Dietram A Scheufele, and Michael A Xenos. 2018. Toxic talk: How online incivility can undermine perceptions of media. International Journal of Public Opinion Research 30, 1 (2018), 156–168.",
      "doi": ""
    },
    {
      "text": "Simge Andı and Jesper Akesson. 2020. Nudging Away False News: Evidence from a Social Norms Experiment. Digital Journalism 9, 1 (2020), 106–125.",
      "doi": ""
    },
    {
      "text": "Nicolas M Anspach. 2017. The new personal influence: How our Facebook friends influence the news we read. Political Communication 34, 4 (2017), 590–606.",
      "doi": ""
    },
    {
      "text": "Charles K Atkin. 1985. Informational utility and selective exposure to entertainment media. Selective exposure to communication(1985), 63–91.",
      "doi": ""
    },
    {
      "text": "Stef Aupers. 2012. ‘Trust no one’: Modernization, paranoia and conspiracy culture. European Journal of Communication 27, 1 (2012), 22–34.",
      "doi": ""
    },
    {
      "text": "Rakesh Bal, Sayan Sinha, Swastika Dutta, Rishabh Joshi, Sayan Ghosh, and Ritam Dutt. 2020. Analysing the extent of misinformation in cancer related tweets. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. 924–928.",
      "doi": ""
    },
    {
      "text": "John A Bargh, Katelyn YA McKenna, 2004. The Internet and social life. Annual review of psychology 55, 1 (2004), 573–590.",
      "doi": ""
    },
    {
      "text": "Melisa Basol, Jon Roozenbeek, and Sander van der Linden. 2020. Good news about bad news: Gamified inoculation boosts confidence and cognitive immunity against fake news. Journal of cognition 3, 1 (2020).",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer, Xiaotong Xu, Christine Chu, Shion Guha, and Geri K Gay. 2017. When subjects interpret the data: Social media non-use as a case for adapting the Delphi Method to CSCW. In Proceedings of the 2017 acm conference on computer supported cooperative work and social computing. 1527–1543.",
      "doi": "10.1145/2998181.2998182"
    },
    {
      "text": "Ian Maynard Begg, Ann Anas, and Suzanne Farinacci. 1992. Dissociation of processes in belief: Source recollection, statement familiarity, and the illusion of truth.Journal of Experimental Psychology: General 121, 4 (1992), 446.",
      "doi": ""
    },
    {
      "text": "Md Momen Bhuiyan, Michael Horning, Sang Won Lee, and Tanushree Mitra. 2021. NudgeCred: Supporting News Credibility Assessment on Social Media Through Nudges. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–30.",
      "doi": "10.1145/3479571"
    },
    {
      "text": "Cristina Bicchieri. 2005. The grammar of society: The nature and dynamics of social norms. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Cristina Bicchieri, Enrique Fatas, Abraham Aldama, Andrés Casas, Ishwari Deshpande, Mariagiulia Lauro, Cristina Parilli, Max Spohn, Paula Pereira, and Ruiling Wen. 2021. In science we (should) trust: Expectations and compliance across nine countries during the COVID-19 pandemic. PloS one 16, 6 (2021), e0252892.",
      "doi": ""
    },
    {
      "text": "Cristina Bicchieri and Ryan Muldoon. 2011. Social norms. (2011).",
      "doi": ""
    },
    {
      "text": "Martin Bruder and Laura Kunert. 2022. The conspiracy hoax? Testing key hypotheses about the correlates of generic beliefs in conspiracy theories during the COVID-19 pandemic. International Journal of Psychology 57, 1 (2022), 43–48.",
      "doi": ""
    },
    {
      "text": "Cody Buntain, Richard Bonneau, Jonathan Nagler, and Joshua A Tucker. 2021. YouTube recommendations and effects on sharing across online social platforms. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–26.",
      "doi": "10.1145/3449085"
    },
    {
      "text": "Leonardo Bursztyn, Georgy Egorov, and Stefano Fiorin. 2020. From extreme to mainstream: The erosion of social norms. American Economic Review 110, 11 (2020), 3522–48.",
      "doi": ""
    },
    {
      "text": "Damon Centola, Joshua Becker, Devon Brackbill, and Andrea Baronchelli. 2018. Experimental evidence for tipping points in social convention. Science 360, 6393 (2018), 1116–1119.",
      "doi": ""
    },
    {
      "text": "Justin Cheng, Michael Bernstein, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2017. Anyone can become a troll: Causes of trolling behavior in online discussions. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 1217–1230.",
      "doi": "10.1145/2998181.2998213"
    },
    {
      "text": "Dennis Chong. 1994. Tolerance and social adjustment to new norms and practices. Political Behavior 16, 1 (1994), 21–53.",
      "doi": ""
    },
    {
      "text": "Adrienne Chung and Rajiv N Rimal. 2016. Social norms: A review. Review of Communication Research 4 (2016), 1–28.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini and Noah J Goldstein. 2004. Social influence: Compliance and conformity. Annual review of psychology 55, 1 (2004), 591–621.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini, Carl A Kallgren, and Raymond R Reno. 1991. A focus theory of normative conduct: A theoretical refinement and reevaluation of the role of norms in human behavior. In Advances in experimental social psychology. Vol. 24. Elsevier, 201–234.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini, Raymond R Reno, and Carl A Kallgren. 1990. A focus theory of normative conduct: Recycling the concept of norms to reduce littering in public places.Journal of personality and social psychology 58, 6(1990), 1015.",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini and Melanie R Trost. 1998. Social influence: Social norms, conformity and compliance.(1998).",
      "doi": ""
    },
    {
      "text": "Justin T Clapp, Jody A Roberts, Britt Dahlberg, Lee Sullivan Berry, Lisa M Jacobs, Edward A Emmett, and Frances K Barg. 2016. Realities of environmental toxicity and their ramifications for community engagement. Social Science & Medicine 170 (2016), 143–151.",
      "doi": ""
    },
    {
      "text": "Kevin Coe, Kate Kenski, and Stephen A Rains. 2014. Online and uncivil? Patterns and determinants of incivility in newspaper website comments. Journal of Communication 64, 4 (2014), 658–679.",
      "doi": ""
    },
    {
      "text": "Jonas Colliander. 2019. “This is fake news”: Investigating the role of conformity to other users’ views when commenting on and spreading disinformation in social media. Computers in Human Behavior 97 (2019), 202–215.",
      "doi": "10.1016/j.chb.2019.03.032"
    },
    {
      "text": "Marios Constantinou, Anthony Kagialis, and Maria Karekla. 2020. COVID-19 scientific facts vs. conspiracy theories: 0–1: science fails to convince even highly educated individuals. (2020).",
      "doi": ""
    },
    {
      "text": "Darel Cookson, Daniel Jolley, Robert C Dempsey, and Rachel Povey. 2021. “If they believe, then so shall I”: Perceived beliefs of the in-group predict conspiracy theory belief. Group Processes & Intergroup Relations 24, 5 (2021), 759–782.",
      "doi": ""
    },
    {
      "text": "Yvonne AW De Kort, L Teddy McCalley, and Cees JH Midden. 2008. Persuasive trash cans: Activation of littering norms by design. Environment and Behavior 40, 6 (2008), 870–891.",
      "doi": ""
    },
    {
      "text": "Michela Del Vicario, Alessandro Bessi, Fabiana Zollo, Fabio Petroni, Antonio Scala, Guido Caldarelli, H Eugene Stanley, and Walter Quattrociocchi. 2016. The spreading of misinformation online. Proceedings of the National Academy of Sciences 113, 3 (2016), 554–559.",
      "doi": ""
    },
    {
      "text": "David Detmer. 2003. Challenging postmodernism: Philosophy and the politics of truth. (2003).",
      "doi": ""
    },
    {
      "text": "Morton Deutsch and Harold B Gerard. 1955. A study of normative and informational social influences upon individual judgment.The journal of abnormal and social psychology 51, 3(1955), 629.",
      "doi": ""
    },
    {
      "text": "Dominic DiFranzo, Samuel Hardman Taylor, Franccesca Kazerooni, Olivia D Wherry, and Natalya N Bazarova. 2018. Upstanding by design: Bystander intervention in cyberbullying. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3173785"
    },
    {
      "text": "Karen M Douglas and Robbie M Sutton. 2015. Climate change: Why the conspiracy theories are dangerous. Bulletin of the Atomic Scientists 71, 2 (2015), 98–106.",
      "doi": ""
    },
    {
      "text": "Karen M. Douglas, Robbie M. Sutton, and Aleksandra Cichocka. 2017. The Psychology of Conspiracy Theories. Current Directions in Psychological Science 26, 6 (Dec. 2017), 538–542. https://doi.org/10.1177/0963721417718261",
      "doi": ""
    },
    {
      "text": "Mark Dredze, David A Broniatowski, and Karen M Hilyard. 2016. Zika vaccine misconceptions: A social media analysis. Vaccine 34, 30 (2016), 3441.",
      "doi": ""
    },
    {
      "text": "Brianna Dym and Casey Fiesler. 2018. Vulnerable and online: Fandom’s case for stronger privacy norms and tools. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. 329–332.",
      "doi": "10.1145/3272973.3274089"
    },
    {
      "text": "Motahhare Eslami, Kristen Vaccaro, Min Kyung Lee, Amit Elazari Bar On, Eric Gilbert, and Karrie Karahalios. 2019. User attitudes towards algorithmic opacity and transparency in online reviewing platforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300724"
    },
    {
      "text": "Andrej Findor, Matej Hruška, John A Gould, Roman Hlatky, Zuzana Tomková, and Miroslav Sirota. 2021. Framing Effects, Social Norm Perception, and Tolerance of Lesbian and Gay Individuals: Experimental Evidence from Slovakia. Journal of Homosexuality(2021), 1–25.",
      "doi": ""
    },
    {
      "text": "Thomas E Ford, Erin R Wentzel, and Joli Lorion. 2001. Effects of exposure to sexist humor on perceptions of normative tolerance of sexism. European Journal of Social Psychology 31, 6 (2001), 677–691.",
      "doi": ""
    },
    {
      "text": "Christine Geeng, Savanna Yee, and Franziska Roesner. 2020. Fake News on Facebook and Twitter: Investigating How People (Don’t) Investigate. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3313831.3376784"
    },
    {
      "text": "Henner Gimpel, Sebastian Heger, Christian Olenberger, and Lena Utz. 2021. The effectiveness of social norms in fighting fake news on social media. Journal of Management Information Systems 38, 1 (2021), 196–221.",
      "doi": ""
    },
    {
      "text": "Ted Goertzel. 1994. Belief in conspiracy theories. Political psychology(1994), 731–742.",
      "doi": ""
    },
    {
      "text": "Anatoliy Gruzd and Philip Mai. 2020. Going viral: How a single tweet spawned a COVID-19 conspiracy theory on Twitter. Big Data & Society 7, 2 (2020), 2053951720938405.",
      "doi": ""
    },
    {
      "text": "Lynn Hasher, David Goldstein, and Thomas Toppino. 1977. Frequency and the conference of referential validity. Journal of verbal learning and verbal behavior 16, 1 (1977), 107–112.",
      "doi": ""
    },
    {
      "text": "Alfred Hermida, Fred Fletcher, Darryl Korell, and Donna Logan. 2012. Share, like, recommend: Decoding the social media news consumer. Journalism studies 13, 5-6 (2012), 815–824.",
      "doi": ""
    },
    {
      "text": "Dirk Hovy and Diyi Yang. 2021. The importance of modeling social factors of language: Theory and practice. In The 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics.",
      "doi": ""
    },
    {
      "text": "Joop J Hox and Timo M Bechger. 1998. An introduction to structural equation modeling. (1998).",
      "doi": ""
    },
    {
      "text": "Roland Imhoff and Martin Bruder. 2014. Speaking (un–) truth to power: Conspiracy mentality as a generalised political attitude. European Journal of Personality 28, 1 (2014), 25–43.",
      "doi": ""
    },
    {
      "text": "Roland Imhoff and Martin Bruder. 2014. Speaking (un–) truth to power: Conspiracy mentality as a generalised political attitude. European Journal of Personality 28, 1 (2014), 25–43.",
      "doi": ""
    },
    {
      "text": "Jeong-woo Jang, Eun-Ju Lee, and Soo Yun Shin. 2019. What debunking of misinformation does and doesn’t. Cyberpsychology, Behavior, and Social Networking 22, 6(2019), 423–427.",
      "doi": ""
    },
    {
      "text": "Daniel Jolley and Karen M Douglas. 2014. The effects of anti-vaccine conspiracy theories on vaccination intentions. PloS one 9, 2 (2014), e89177.",
      "doi": ""
    },
    {
      "text": "Daniel Jolley and Karen M Douglas. 2017. Prevention is better than cure: Addressing anti-vaccine conspiracy theories. Journal of Applied Social Psychology 47, 8 (2017), 459–469.",
      "doi": ""
    },
    {
      "text": "Anna Kata. 2010. A postmodern Pandora’s box: anti-vaccination misinformation on the Internet. Vaccine 28, 7 (2010), 1709–1716.",
      "doi": ""
    },
    {
      "text": "Franccesca Kazerooni, Samuel Hardman Taylor, Natalya N Bazarova, and Janis Whitlock. 2018. Cyberbullying bystander intervention: The number of offenders and retweeting predict likelihood of helping a cyberbullying victim. Journal of Computer-Mediated Communication 23, 3 (2018), 146–162.",
      "doi": ""
    },
    {
      "text": "Harold H Kelley. 1955. Salience of membership and resistance to change of group-anchored attitudes. Human Relations 8, 3 (1955), 275–289.",
      "doi": ""
    },
    {
      "text": "Jan Kirchner and Christian Reuter. 2020. Countering fake news: A comparison of possible solutions regarding user acceptance and effectiveness. Proceedings of the ACM on Human-computer Interaction 4, CSCW2(2020), 1–27.",
      "doi": "10.1145/3415211"
    },
    {
      "text": "Esther Michelsen Kjeldahl and Vincent F Hendricks. 2018. The sense of social influence: pluralistic ignorance in climate change: social factors play key roles in human behavior. Individuals tend to underestimate how much others worry about climate change. This may inhibit them from taking collective climate action. EMBO reports 19, 11 (2018), e47185.",
      "doi": ""
    },
    {
      "text": "Alex Zhi-Xiong Koo, Min-Hsin Su, SangWon Lee, So-Yun Ahn, and Hernando Rojas. 2021. What Motivates People to Correct Misinformation? Examining the Effects of Third-person Perceptions and Perceived Norms. Journal of Broadcasting & Electronic Media(2021), 1–24.",
      "doi": ""
    },
    {
      "text": "Yubo Kou, Xinning Gui, Yunan Chen, and Kathleen Pine. 2017. Conspiracy talk on social media: collective sensemaking during a public health crisis. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–21.",
      "doi": "10.1145/3134696"
    },
    {
      "text": "Maria Knight Lapinski and Rajiv N Rimal. 2005. An explication of social norms. Communication theory 15, 2 (2005), 127–147.",
      "doi": ""
    },
    {
      "text": "David Lazer, Matthew Baum, Nir Grinberg, Lisa Friedland, Kenneth Joseph, Will Hobbs, and Carolina Mattsson. 2017. Combating fake news: An agenda for research and action. (2017).",
      "doi": ""
    },
    {
      "text": "Anna Levinsson, Diana Miconi, Zhiyin Li, Rochelle L Frounfelker, and Cécile Rousseau. 2021. Conspiracy theories, psychological distress, and sympathy for violent radicalization in young adults during the COVID-19 pandemic: A cross-sectional study. International journal of environmental research and public health 18, 15(2021), 7846.",
      "doi": ""
    },
    {
      "text": "Leo Levy. 1960. Studies in conformity behavior: a methodological note. The Journal of Psychology 50, 1 (1960), 39–41.",
      "doi": ""
    },
    {
      "text": "Stephan Lewandowsky, Ullrich KH Ecker, Colleen M Seifert, Norbert Schwarz, and John Cook. 2012. Misinformation and its correction: Continued influence and successful debiasing. Psychological science in the public interest 13, 3 (2012), 106–131.",
      "doi": ""
    },
    {
      "text": "Björn Lindström, Simon Jangard, Ida Selbing, and Andreas Olsson. 2018. The role of a “common is moral” heuristic in the stability and change of moral norms.Journal of Experimental Psychology: General 147, 2 (2018), 228.",
      "doi": ""
    },
    {
      "text": "Sahil Loomba, Alexandre de Figueiredo, Simon J Piatek, Kristen de Graaf, and Heidi J Larson. 2021. Measuring the impact of COVID-19 vaccine misinformation on vaccination intent in the UK and USA. Nature human behaviour 5, 3 (2021), 337–348.",
      "doi": ""
    },
    {
      "text": "Diane M Mackie. 1986. Social identification effects in group polarization.Journal of Personality and Social Psychology 50, 4(1986), 720.",
      "doi": ""
    },
    {
      "text": "Gina M Masullo and Jiwon Kim. 2021. Exploring “angry” and “like” reactions on uncivil Facebook comments that correct misinformation in the news. Digital Journalism 9, 8 (2021), 1103–1122.",
      "doi": ""
    },
    {
      "text": "Philipp K Masur, Dominic James DiFranzo, and Natalya Natalie Bazarova. 2021. Behavioral Contagion on Social Media: Effects of Social Norms, Design Interventions, and Critical Media Literacy on Self-Disclosure. (2021).",
      "doi": ""
    },
    {
      "text": "J Nathan Matias. 2019. Preventing harassment and increasing group participation through social norms in 2,190 online science discussions. Proceedings of the National Academy of Sciences 116, 20(2019), 9785–9789.",
      "doi": ""
    },
    {
      "text": "Scott E Maxwell, Harold D Delaney, and Ken Kelley. 2017. Designing experiments and analyzing data: A model comparison perspective. Routledge.",
      "doi": ""
    },
    {
      "text": "John McAlaney, Bridgette Bewick, and Clarissa Hughes. 2011. The international development of the ‘Social Norms’ approach to drug education and prevention. Drugs: education, prevention and policy 18, 2 (2011), 81–89.",
      "doi": ""
    },
    {
      "text": "Shaheed N Mohammed. 2019. Conspiracy theories and flat-earth videos on YouTube. The Journal of Social Media in Society 8, 2 (2019), 84–102.",
      "doi": ""
    },
    {
      "text": "Patricia Moravec, Randall Minas, and Alan R Dennis. 2018. Fake news on social media: People believe what they want to believe when it makes no sense at all. Kelley School of Business Research Paper18-87 (2018).",
      "doi": ""
    },
    {
      "text": "Luke Munn. 2020. Angry by design: toxic communication and technical architectures. Humanities and Social Sciences Communications 7, 1(2020), 1–11.",
      "doi": ""
    },
    {
      "text": "A Conrad Nied, Leo Stewart, Emma Spiro, and Kate Starbird. 2017. Alternative narratives of crisis events: Communities and social botnets engaged on social media. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 263–266.",
      "doi": "10.1145/3022198.3026307"
    },
    {
      "text": "HUBERT J O’GORMAN. 1975. Pluralistic ignorance and white estimates of white support for racial segregation. Public Opinion Quarterly 39, 3 (1975), 313–330.",
      "doi": ""
    },
    {
      "text": "Hubert J O’Gorman and Stephen L Garry. 1976. Pluralistic ignorance—A replication and extension. Public Opinion Quarterly 40, 4 (1976), 449–458.",
      "doi": ""
    },
    {
      "text": "R Scott Olds and Dennis L Thombs. 2001. The relationship of adolescent perceptions of peer norms and parent involvement to cigarette and alcohol use. Journal of School Health 71, 6 (2001), 223–228.",
      "doi": ""
    },
    {
      "text": "James M Olson and Mark P Zanna. 1979. A new look at selective exposure. Journal of Experimental Social Psychology 15, 1 (1979), 1–15.",
      "doi": ""
    },
    {
      "text": "Ton Oostveen, Ronald Knibbe, and Hein De Vries. 1996. Social influences on young adults’ alcohol consumption: norms, modeling, pressure, socializing, and conformity. Addictive behaviors 21, 2 (1996), 187–197.",
      "doi": ""
    },
    {
      "text": "J Milošević Đorđević, S Mari, M Vdović, and A Milošević. 2021. Links between conspiracy beliefs, vaccine knowledge, and trust: Anti-vaccine behavior of Serbian adults. Social Science & Medicine 277 (2021), 113930.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2020. Immunizing the public against misinformation. Geneva: World Health Organization 25 (2020).",
      "doi": ""
    },
    {
      "text": "Ilona M Otto, Jonathan F Donges, Roger Cremades, Avit Bhowmik, Richard J Hewitt, Wolfgang Lucht, Johan Rockström, Franziska Allerberger, Mark McCaffrey, Sylvanus SP Doe, 2020. Social tipping dynamics for stabilizing Earth’s climate by 2050. Proceedings of the National Academy of Sciences 117, 5 (2020), 2354–2365.",
      "doi": ""
    },
    {
      "text": "Clifton M Oyamot Jr, Melinda S Jackson, Emily L Fisher, Grace Deason, and Eugene Borgida. 2017. Social norms and egalitarian values mitigate authoritarian intolerance toward sexual minorities. Political Psychology 38, 5 (2017), 777–794.",
      "doi": ""
    },
    {
      "text": "Hee Sun Park and Sandi W Smith. 2007. Distinctiveness and influence of subjective norms, personal descriptive and injunctive norms, and societal descriptive and injunctive norms on behavioral intent: A case of two behaviors critical to organ donation. Human Communication Research 33, 2 (2007), 194–218.",
      "doi": ""
    },
    {
      "text": "Namkee Park, Hyun Sook Oh, and Naewon Kang. 2012. Factors influencing intention to upload content on Wikipedia in South Korea: The effects of social norms and individual differences. Computers in Human Behavior 28, 3 (2012), 898–905.",
      "doi": "10.1016/j.chb.2011.12.010"
    },
    {
      "text": "Josh Pasek. 2018. Don’t trust the scientists! Rejecting the scientific consensus “conspiracy.”. Conspiracy theories and the people who believe them (2018), 201–213.",
      "doi": ""
    },
    {
      "text": "H Wesley Perkins and Alan D Berkowitz. 1986. Perceiving the community norms of alcohol use among students: Some research implications for campus alcohol education programming. International journal of the Addictions 21, 9-10 (1986), 961–976.",
      "doi": ""
    },
    {
      "text": "Shruti Phadke, Mattia Samory, and Tanushree Mitra. 2021. What Makes People Join Conspiracy Communities? Role of Social Factors in Conspiracy Engagement. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–30.",
      "doi": ""
    },
    {
      "text": "Sunthud Pornprasertmanit, Patrick Miller, Alexander Schoemann, Yves Rosseel, C Quick, M Garnier-Villarreal, 2013. semTools: Useful tools for structural equation modeling. R package version 0.4-6. Retrieved July 17(2013), 2013.",
      "doi": ""
    },
    {
      "text": "Deborah A Prentice and Dale T Miller. 1996. Pluralistic ignorance and the perpetuation of social norms by unwitting actors. In Advances in experimental social psychology. Vol. 28. Elsevier, 161–209.",
      "doi": ""
    },
    {
      "text": "Lotte Pummerer, Robert Böhm, Lau Lilleholt, Kevin Winter, Ingo Zettler, and Kai Sassenberg. 2022. Conspiracy theories and their societal effects during the COVID-19 pandemic. Social Psychological and Personality Science 13, 1 (2022), 49–59.",
      "doi": ""
    },
    {
      "text": "Ankita Rao. 2021. Guardian News and Media. (2021, January 5). US pharmacist who tried to ruin Covid vaccine doses is a conspiracy THEORIST, police say.https://www.theguardian.com/us-news/2021/jan/04/wisconsin-pharmacist-covid-19-vaccine-doses-steven-brandenburg.",
      "doi": ""
    },
    {
      "text": "Yasmeen Rashidi, Apu Kapadia, Christena Nippert-Eng, and Norman Makoto Su. 2020. \" It’s easier than causing confrontation\": Sanctioning Strategies to Maintain Social Norms and Privacy on Social Media. Proceedings of the ACM on human-computer interaction 4, CSCW1(2020), 1–25.",
      "doi": "10.1145/3392827"
    },
    {
      "text": "Susan M Reiter and William Samuel. 1980. Littering as a function of prior litter and the presence or absence of prohibitive signs 1. Journal of Applied Social Psychology 10, 1 (1980), 45–55.",
      "doi": ""
    },
    {
      "text": "Rajiv N Rimal and Maria K Lapinski. 2015. A re-explication of social norms, ten years later. Communication Theory 25, 4 (2015), 393–409.",
      "doi": ""
    },
    {
      "text": "Rajiv N Rimal, Maria K Lapinski, Rachel J Cook, and Kevin Real. 2005. Moving toward a theory of normative influences: How perceived benefits and similarity moderate the impact of descriptive norms on behaviors. Journal of health communication 10, 5 (2005), 433–450.",
      "doi": ""
    },
    {
      "text": "Rajiv N Rimal and Kevin Real. 2003. Understanding the influence of perceived norms on behaviors. Communication Theory 13, 2 (2003), 184–203.",
      "doi": ""
    },
    {
      "text": "Nathaniel Rodriguez, Johan Bollen, and Yong-Yeol Ahn. 2016. Collective dynamics of belief evolution under cognitive coherence and social conformity. PLoS one 11, 11 (2016), e0165910.",
      "doi": ""
    },
    {
      "text": "Daniel Romer and Kathleen Hall Jamieson. 2020. Conspiracy theories as barriers to controlling the spread of COVID-19 in the US. Social science & medicine 263 (2020), 113356.",
      "doi": ""
    },
    {
      "text": "Jon Roozenbeek, Claudia R Schneider, Sarah Dryhurst, John Kerr, Alexandra LJ Freeman, Gabriel Recchia, Anne Marthe Van Der Bles, and Sander Van Der Linden. 2020. Susceptibility to misinformation about COVID-19 around the world. Royal Society open science 7, 10 (2020), 201199.",
      "doi": ""
    },
    {
      "text": "Jon Roozenbeek and Sander van der Linden. 2019. Fake news game confers psychological resistance against online misinformation. Palgrave Communications 5, 1 (2019), 1–10.",
      "doi": ""
    },
    {
      "text": "Yves Rosseel. [n.d.]. Lavaan: An R package for structural equation modeling. https://www.jstatsoft.org/article/view/v048i02",
      "doi": ""
    },
    {
      "text": "Marten Scheffer, Denny Borsboom, Sander Nieuwenhuis, and Frances Westley. 2022. Belief traps: Tackling the inertia of harmful beliefs. Proceedings of the National Academy of Sciences 119, 32(2022), e2203149119.",
      "doi": ""
    },
    {
      "text": "Dietram A Scheufele and Nicole M Krause. 2019. Science audiences, misinformation, and fake news. Proceedings of the National Academy of Sciences 116, 16(2019), 7662–7669.",
      "doi": ""
    },
    {
      "text": "Christine M Schroeder and Deborah A Prentice. 1998. Exposing pluralistic ignorance to reduce alcohol use among college students 1. Journal of Applied Social Psychology 28, 23 (1998), 2150–2180.",
      "doi": ""
    },
    {
      "text": "Steven Sloman, Steven A Sloman, and Philip Fernbach. 2018. The knowledge illusion: Why we never think alone. Penguin.",
      "doi": ""
    },
    {
      "text": "Joanne R Smith, Michael A Hogg, Robin Martin, and Deborah J Terry. 2007. Uncertainty and the influence of group norms in the attitude–behaviour relationship. British Journal of Social Psychology 46, 4 (2007), 769–792.",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein and Adrian Vermeule. 2009. Conspiracy theories: Causes and cures. Journal of Political Philosophy 17, 2 (2009), 202–227.",
      "doi": ""
    },
    {
      "text": "Robbie M Sutton and Karen M Douglas. 2022. Agreeing to disagree: reports of the popularity of Covid-19 conspiracy theories are greatly exaggerated. Psychological medicine 52, 4 (2022), 791–793.",
      "doi": ""
    },
    {
      "text": "Briony Swire, Ullrich KH Ecker, and Stephan Lewandowsky. 2017. The role of familiarity in correcting inaccurate information.Journal of experimental psychology: learning, memory, and cognition 43, 12(2017), 1948.",
      "doi": ""
    },
    {
      "text": "Briony Swire-Thompson and David Lazer. 2019. Public health and online misinformation: challenges and recommendations.Annual review of public health 41 (2019), 433–451.",
      "doi": ""
    },
    {
      "text": "Piotr Tarka. 2018. An overview of structural equation modeling: its beginnings, historical development, usefulness and controversies in the social sciences. Quality & quantity 52, 1 (2018), 313–354.",
      "doi": ""
    },
    {
      "text": "Samuel Hardman Taylor, Dominic DiFranzo, Yoon Hyung Choi, Shruti Sannon, and Natalya N Bazarova. 2019. Accountability and empathy by design: Encouraging bystander intervention to cyberbullying on social media. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": "10.1145/3359220"
    },
    {
      "text": "The YouTube Team. 2019. Continuing our work to improve recommendations on YouTube. https://blog.youtube/news-and-events/continuing-our-work-to-improve/",
      "doi": ""
    },
    {
      "text": "Hanneke A Teunissen, Renske Spijkerman, Mitchell J Prinstein, Geoffrey L Cohen, Rutger CME Engels, and Ron HJ Scholte. 2012. Adolescents’ conformity to their peers’ pro-alcohol and anti-alcohol norms: The power of popularity. Alcoholism: Clinical and experimental research 36, 7 (2012), 1257–1267.",
      "doi": ""
    },
    {
      "text": "Emily Thorson. 2015. Identifying and correcting policy misperceptions. Unpublished Paper, George Washington University. (2015). http://www.americanpressinstitute.org/wp-content/uploads/2015/04/Project-2-Thorson-2015-Identifying-Political-Misperceptions-UPDATED-4-24.pdf",
      "doi": ""
    },
    {
      "text": "Sabine Trepte and Leonard Reinecke. 2011. Privacy online: Perspectives on privacy and self-disclosure in the social web. Springer.",
      "doi": ""
    },
    {
      "text": "Irfan Ullah, Kiran Shafiq Khan, Muhammad Junaid Tahir, Ali Ahmed, and Harapan Harapan. 2021. Myths and conspiracy theories on vaccines and COVID-19: potential effect on global vaccine refusals. Vacunas 22, 2 (2021), 93–97.",
      "doi": ""
    },
    {
      "text": "Sander van Der Linden, Jon Roozenbeek, and Josh Compton. 2020. Inoculating against fake news about COVID-19. Frontiers in psychology 11 (2020), 2928.",
      "doi": ""
    },
    {
      "text": "Jan-Willem van Prooijen. 2022. Injustice Without Evidence: The Unique Role of Conspiracy Theories in Social Justice Research. Social justice research 35, 1 (2022), 88–106.",
      "doi": ""
    },
    {
      "text": "Jan-Willem Van Prooijen, Giuliana Spadaro, and Haiyan Wang. 2022. Suspicion of institutions: How distrust and conspiracy theories deteriorate social relationships. Current opinion in psychology 43 (2022), 65–69.",
      "doi": ""
    },
    {
      "text": "Emily K Vraga and Leticia Bode. 2020. Correction as a solution for health misinformation on social media., S278–S280 pages.",
      "doi": ""
    },
    {
      "text": "Eva Walther, Herbert Bless, Fritz Strack, Patsy Rackstraw, Doris Wagner, and Lioba Werth. 2002. Conformity effects in memory as a function of group size, dissenters and uncertainty. Applied Cognitive Psychology: The Official Journal of the Society for Applied Research in Memory and Cognition 16, 7 (2002), 793–810.",
      "doi": ""
    },
    {
      "text": "Wei Wei. 2018. The normalization project: The progress and limitations of promoting LGBTQ research and teaching in mainland China. Journal of homosexuality(2018).",
      "doi": ""
    },
    {
      "text": "Magdalena Wojcieszak, Stephan Winter, and Xudong Yu. 2020. Social norms and selectivity: Effects of norms of open-mindedness on content selection and affective polarization. Mass Communication and Society 23, 4 (2020), 455–483.",
      "doi": ""
    },
    {
      "text": "Michael J Wood. 2018. Propagating and debunking conspiracy theories on Twitter during the 2015–2016 Zika virus outbreak. Cyberpsychology, behavior, and social networking 21, 8(2018), 485–490.",
      "doi": ""
    },
    {
      "text": "Sijia Xiao, Coye Cheshire, and Amy Bruckman. 2021. Sensemaking and the Chemtrail Conspiracy on the Internet: Insights from Believers and Ex-believers. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–28.",
      "doi": "10.1145/3479598"
    },
    {
      "text": "Amos Yong. 2004. The Spirit bears witness: pneumatology, truth, and the religions. Scottish journal of theology 57, 1 (2004), 14–38.",
      "doi": ""
    }
  ]
}