{
  "doi": "10.1145/3544548.3581317",
  "title": "Climate Coach: A Dashboard for Open-Source Maintainers to Overview Community Dynamics",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Open-source software projects have become an integral part of our daily life, supporting virtually every software we use today. Since open-source software forms the digital infrastructure, maintaining them is of utmost importance. We present Climate Coach, a dashboard that helps open-source project maintainers monitor the health of their community in terms of team climate and inclusion. Through a literature review and an exploratory survey (N=18), we identified important signals that can reflect a project’s health, and display them on a dashboard. We evaluated and refined our dashboard through two rounds of think-aloud studies (N=19). We then conducted a two-week longitudinal diary study (N=10) to test the usefulness of our dashboard. We found that displaying signals that are related to a project’s inclusion help improve maintainers’ management strategies.",
  "tags": [],
  "authors": [
    {
      "name": "Huilian Sophie Qiu",
      "institution": "School of Computer Science, Carnegie Mellon University, United States and Kellogg School of Management, Northwestern University, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659433165",
      "orcid": "0000-0002-6089-7003"
    },
    {
      "name": "Anna Lieb",
      "institution": "Wellesley College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779229",
      "orcid": "0000-0002-5493-0487"
    },
    {
      "name": "Jennifer Chou",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782856",
      "orcid": "0000-0003-3258-4250"
    },
    {
      "name": "Megan Carneal",
      "institution": "The University of Alabama, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782846",
      "orcid": "0000-0003-1153-2064"
    },
    {
      "name": "Jasmine Mok",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781589",
      "orcid": "0000-0001-5150-045X"
    },
    {
      "name": "Emily Amspoker",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782109",
      "orcid": "0000-0002-2220-5491"
    },
    {
      "name": "Bogdan Vasilescu",
      "institution": "School of Computer Science, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81485658533/rel-imgonly/bogdan2013bw.jpg",
      "acmid": "81485658533",
      "orcid": "0000-0003-4418-5783"
    },
    {
      "name": "Laura Dabbish",
      "institution": "School of Computer Science, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100650586",
      "orcid": "0000-0001-9489-4188"
    }
  ],
  "references": [
    {
      "text": "Omar Alonso, Premkumar T Devanbu, and Michael Gertz. 2008. Expertise identification and visualization from CVS. In International Conference on Mining Software Repositories (MSR). 125–128.",
      "doi": "10.1145/1370750.1370780"
    },
    {
      "text": "Hirohisa Aman, Aji Ery Burhandenny, Sousuke Amasaki, Tomoyuki Yokogawa, and Minoru Kawahara. 2017. A Health Index of Open Source Projects Focusing on Pareto Distribution of Developer’s Contribution. In 2017 8th International Workshop on Empirical Software Engineering in Practice (IWESEP). 29–34. https://doi.org/10.1109/IWESEP.2017.14",
      "doi": ""
    },
    {
      "text": "Joop Aué, Michiel Haisma, Kristín Fjóla Tómasdóttir, and Alberto Bacchelli. 2016. Social Diversity and Growth Levels of Open Source Software Projects on GitHub. In International Symposium on Empirical Software Engineering and Measurement (ESEM). ACM, 1–6.",
      "doi": ""
    },
    {
      "text": "Guilherme Avelino, Eleni Constantinou, Marco Tulio Valente, and Alexander Serebrenik. 2019. On the abandonment and survival of open source projects: An empirical investigation. In International Symposium on Empirical Software Engineering and Measurement (ESEM). IEEE, 1–12.",
      "doi": ""
    },
    {
      "text": "Jacob T Biehl, Mary Czerwinski, Greg Smith, and George G Robertson. 2007. FASTDash: a visual dashboard for fostering awareness in software teams. In SIGCHI Conference on Human Factors in Computing Systems (CHI). 1313–1322.",
      "doi": "10.1145/1240624.1240823"
    },
    {
      "text": "Erling Bjögvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Design things and design thinking: Contemporary participatory design challenges. Design issues 28, 3 (2012), 101–116.",
      "doi": ""
    },
    {
      "text": "Kelly Blincoe, Jyoti Sheoran, Sean Goggins, Eva Petakovic, and Daniela Damian. 2016. Understanding the popular users: Following, affiliation influence and leadership on GitHub. Information and Software Technology 70 (2016), 30–39.",
      "doi": "10.1016/j.infsof.2015.10.002"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Margaret Burnett, Anicia Peters, Charles Hill, and Noha Elarief. 2016. Finding gender-inclusiveness software issues with GenderMag: a field investigation. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems(CHI). ACM, 2586–2598.",
      "doi": "10.1145/2858036.2858274"
    },
    {
      "text": "Ronald Burt. 1992. Structural Holes: The Social Structure of Competition. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Andrea Capiluppi, Alexander Serebrenik, and Leif Singer. 2013. Assessing technical candidates on the social web. IEEE Software 30, 1 (2013), 45–51.",
      "doi": "10.1109/MS.2012.169"
    },
    {
      "text": "Elian Carsenat. 2019. Inferring gender from names in any region, language, or alphabet. Unpublished 10(2019).",
      "doi": ""
    },
    {
      "text": "Amanda Casari, Katie McLaughlin, Milo Z Trujillo, Jean-Gabriel Young, James P Bagrow, and Laurent Hébert-Dufresne. 2021. Open source ecosystems need equitable credit across contributions. Nature Computational Science 1, 1 (2021), 2–2.",
      "doi": ""
    },
    {
      "text": "Maëlick Claes, Mika Mäntylä, Miikka Kuutila, and Umar Farooq. 2018. Towards automatically identifying paid open source developers. In International Conference on Mining Software Repositories (MSR). 437–441.",
      "doi": "10.1145/3196398.3196447"
    },
    {
      "text": "Maëlick Claes, Tom Mens, and Philippe Grosjean. 2014. maintaineR: A web-based dashboard for maintainers of CRAN packages. In International Conference on Software Maintenance and Evolution (ICSME). IEEE, 597–600.",
      "doi": "10.1109/ICSME.2014.104"
    },
    {
      "text": "Jailton Coelho and Marco Tulio Valente. 2017. Why modern open source projects fail. In Joint Meeting on the Foundations of Software Engineering (ESEC/FSE). 186–196.",
      "doi": "10.1145/3106237.3106246"
    },
    {
      "text": "James S Coleman. 1990. Foundations of social theory. Belknap.",
      "doi": ""
    },
    {
      "text": "Valerio Cosentino, Javier Luis Cánovas Izquierdo, and Jordi Cabot. 2015. Assessing the bus factor of Git repositories. In 2015 IEEE 22nd International Conference on Software Analysis, Evolution, and Reengineering (SANER). 499–503. https://doi.org/10.1109/SANER.2015.7081864",
      "doi": ""
    },
    {
      "text": "Valerio Cosentino, Javier Luis Cánovas Izquierdo, and Jordi Cabot. 2018. Gitana: A software project inspector. Science of Computer Programming 153 (2018), 30–33.",
      "doi": ""
    },
    {
      "text": "Kevin Crowston. 2003. Defining Open Source Software Project Success. In International Conference on Information Systems (ICIS).",
      "doi": ""
    },
    {
      "text": "Kevin Crowston, James Howison, and Hala Annabi. 2006. Information systems success in free and open source software development: theory and measures. Software Process: Improvement and Practice 11, 2 (2006), 123–148.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Colleen Stuart, Jason Tsay, and Jim Herbsleb. 2012. Social coding in GitHub: transparency and collaboration in an open software repository. In Proceedings of the ACM Conference on Computer Supported Cooperative Work(CSCW). ACM, 1277–1286.",
      "doi": "10.1145/2145204.2145396"
    },
    {
      "text": "Tapajit Dey, Sara Mousavi, Eduardo Ponce, Tanner Fry, Bogdan Vasilescu, Anna Filippova, and Audris Mockus. 2020. Detecting and Characterizing Bots That Commit Code. ACM, New York, NY, USA, 209–219. https://doi.org/10.1145/3379597.3387478",
      "doi": "10.1145/3379597.3387478"
    },
    {
      "text": "Santiago Dueñas, Valerio Cosentino, Jesus M Gonzalez-Barahona, Alvaro del Castillo San Felix, Daniel Izquierdo-Cortazar, Luis Cañas-Díaz, and Alberto Pérez García-Plaza. 2021. GrimoireLab: A toolset for software development analytics. PeerJ Computer Science 7(2021), e601.",
      "doi": ""
    },
    {
      "text": "Santiago Dueñas, Valerio Cosentino, Gregorio Robles, and Jesus M Gonzalez-Barahona. 2018. Perceval: software project data at your will. In International Conference on Software Engineering: Companion Proceeedings. 1–4.",
      "doi": "10.1145/3183440.3183475"
    },
    {
      "text": "Carolyn D Egelman, Emerson Murphy-Hill, Elizabeth Kammer, Margaret Morrow Hodges, Collin Green, Ciera Jaspan, and James Lin. 2020. Predicting developers’ negative feelings about code review. In 2020 IEEE/ACM 42nd International Conference on Software Engineering (ICSE). IEEE, 174–185.",
      "doi": "10.1145/3377811.3380414"
    },
    {
      "text": "Nadia Eghbal. 2016. Roads and Bridges: The Unseen Labor Behind Our Digital Infrastructure. Ford Foundation.",
      "doi": ""
    },
    {
      "text": "Fabio Ferreira, Luciana Lourdes Silva, and Marco Tulio Valente. 2020. Turnover in Open-Source Projects: The Case of Core Developers. In Brazilian Symposium on Software Engineering (SBES). 447–456.",
      "doi": "10.1145/3422392.3422433"
    },
    {
      "text": "Isabella Ferreira, Jinghui Cheng, and Bram Adams. 2021. The “Shut the f** k up” Phenomenon: Characterizing Incivility in Open Source Code Review Discussions. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–35.",
      "doi": "10.1145/3479497"
    },
    {
      "text": "Anna Filippova and Hichang Cho. 2015. Mudslinging and manners: Unpacking conflict in free and open source software. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1393–1403.",
      "doi": "10.1145/2675133.2675254"
    },
    {
      "text": "Oscar Franco-Bedoya, David Ameller, Dolors Costal, and Xavier Franch. 2017. Open source software ecosystems: A Systematic mapping. Information and Software Technology 91 (2017), 160–185.",
      "doi": ""
    },
    {
      "text": "GitHub. 2017. Open Source Survey. http://opensourcesurvey.org/2017/.",
      "doi": ""
    },
    {
      "text": "Sean Goggins, Kevin Lumbard, and Matt Germonprez. 2021. Open source community health: Analytical metrics and their corresponding narratives. In International Workshop on Software Health in Projects, Ecosystems and Communities (SoHeal). IEEE.",
      "doi": ""
    },
    {
      "text": "Sean P Goggins, Matt Germonprez, and Kevin Lumbard. 2021. Making open source project health transparent. Computer 54, 08 (2021), 104–111.",
      "doi": ""
    },
    {
      "text": "Mariam Guizani, Tom Zimmermann, Anita Sarma, and Denae Ford Robinson. 2022. Attracting and Retaining OSS contributors with a Maintainer Dashboard. In International Conference on Software Engineering, Software Engineering in Society Track (ICSE SEIS 2022). ACM.",
      "doi": ""
    },
    {
      "text": "Jack Jamieson, Eureka Foong, and Naomi. Yamashita. 2022. Maintaining Values: Navigating Diverse Perspectives in Value-Charged Discussions in Open Source Development. In Proceedings of the ACM on Human-Computer Interaction(CSCW).",
      "doi": "10.1145/3555550"
    },
    {
      "text": "Joselito Mota Jr, Railana Santana, and Ivan Machado. 2021. GrumPy: an automated approach to simplify issue data analysis for newcomers. In Brazilian Symposium on Software Engineering (SBES). 33–38.",
      "doi": "10.1145/3474624.3476012"
    },
    {
      "text": "Helena Karasti, Karen S Baker, and Florence Millerand. 2010. Infrastructure time: Long-term matters in collaborative development. Computer Supported Cooperative Work (CSCW) 19, 3 (2010), 377–415.",
      "doi": "10.1007/s10606-010-9113-z"
    },
    {
      "text": "Karim R Lakhani and Robert G Wolf. 2003. Why hackers do what they do: Understanding motivation and effort in free/open source software projects. https://ssrn.com/abstract=443040.",
      "doi": ""
    },
    {
      "text": "Amanda Lee and Jeffrey C Carver. 2019. FLOSS participants’ perceptions about gender and inclusiveness: a survey. In International Conference on Software Engineering (ICSE). IEEE, 677–687.",
      "doi": "10.1109/ICSE.2019.00077"
    },
    {
      "text": "Michael J Lee, Bruce Ferwerda, Junghong Choi, Jungpil Hahn, Jae Yun Moon, and Jinwoo Kim. 2013. GitHub developers use rockstars to overcome overflow of news. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI). ACM, 133–138.",
      "doi": "10.1145/2468356.2468381"
    },
    {
      "text": "Renee Li, Pavitthra Pandurangan, Hana Frluckaj, and Laura Dabbish. 2021. Code of conduct conversations in open source software projects on Github. Proceedings of the ACM on Human-computer Interaction 5, CSCW1(2021), 1–31.",
      "doi": "10.1145/3449093"
    },
    {
      "text": "Johan Linåker, Efi Papatheocharous, and Thomas Olsson. 2022. How to characterize the health of an Open Source Software project? A snowball literature review of an emerging practice. In International Symposium on Open Collaboration (OpenSym). 1–12.",
      "doi": "10.1145/3555051.3555067"
    },
    {
      "text": "M Lynne Markus. 2007. The governance of free/open source software projects: monolithic, multidimensional, or configurational?Journal of Management & Governance 11, 2 (2007), 151–163.",
      "doi": ""
    },
    {
      "text": "Jennifer Marlow and Laura Dabbish. 2013. Activity traces and signals in software developer recruitment and hiring. In ACM Conference on Computer Supported Cooperative Work (CSCW). ACM, 145–156.",
      "doi": "10.1145/2441776.2441794"
    },
    {
      "text": "Jennifer Marlow, Laura Dabbish, and Jim Herbsleb. 2013. Impression formation in online peer production: activity traces and personal profiles in GitHub. In ACM Conference on Computer Supported Cooperative Work (CSCW). ACM, 117–128.",
      "doi": "10.1145/2441776.2441792"
    },
    {
      "text": "Christopher Mendez, Hema Susmita Padala, Zoe Steine-Hanson, Claudia Hilderbrand, Amber Horvath, Charles Hill, Logan Simpson, Nupoor Patil, Anita Sarma, and Margaret Burnett. 2018. Open source barriers to entry, revisited: A sociotechnical perspective. In International Conference on Software Engineering (ICSE). 1004–1015.",
      "doi": "10.1145/3180155.3180241"
    },
    {
      "text": "Vishal Midha and Prashant Palvia. 2012. Factors affecting the success of Open Source Software. Journal of Systems and Software 85, 4 (2012), 895–905.",
      "doi": "10.1016/j.jss.2011.11.010"
    },
    {
      "text": "Courtney Miller, Sophie Cohen, Daniel Klug, Bogdan Vasilescu, and Christian Kästner. 2022. “Did You Miss My Comment or What?” Understanding Toxicity in Open Source Discussions. In International Conference on Software Engineering (ICSE).",
      "doi": "10.1145/3510003.3510111"
    },
    {
      "text": "Courtney Miller, Sophie Cohen, Daniel Klug, Bodgan Vasilescu, and Christian Kästner. 2022. “Did You Miss My Comment or What?” Understanding Toxicity in Open Source Discussions. In International Conference on Software Engineering(ICSE). ACM.",
      "doi": "10.1145/3510003.3510111"
    },
    {
      "text": "Courtney Miller, David Gray Widder, Christian Kästner, and Bogdan Vasilescu. 2019. Why do people give up flossing? a study of contributor disengagement in open source. In International Conference on Open Source Systems (OSS). Springer, 116–129.",
      "doi": ""
    },
    {
      "text": "Audris Mockus, Roy T Fielding, and James D Herbsleb. 2002. Two case studies of open source software development: Apache and Mozilla. ACM Transactions on Software Engineering and Methodology (TOSEM) 11, 3(2002), 309–346.",
      "doi": "10.1145/567793.567795"
    },
    {
      "text": "Dawn Nafus. 2012. ‘Patches don’t have gender’: What is not open in open source software. New Media & Society 14, 4 (2012), 669–683.",
      "doi": ""
    },
    {
      "text": "Michael Ogawa, Kwan-Liu Ma, Christian Bird, Premkumar Devanbu, and Alex Gourley. 2007. Visualizing social interaction in open source software projects. In International Asia-Pacific Symposium on Visualization. IEEE, 25–32.",
      "doi": ""
    },
    {
      "text": "Sandra Ohly, Sabine Sonnentag, Cornelia Niessen, and Dieter Zapf. 2010. Diary studies in organizational research: An introduction and some practical recommendations. First publ. in: Journal of Personnel Psychology 9 (2010), 2, pp. 79-93 9 (01 2010).",
      "doi": ""
    },
    {
      "text": "Siobhán O’Mahony. 2007. The governance of open source initiatives: what does it mean to be community managed?Journal of Management & Governance 11, 2 (2007), 139–150.",
      "doi": ""
    },
    {
      "text": "Javier Pérez, Romuald Deshayes, Mathieu Goeminne, and Tom Mens. 2012. Seconda: Software ecosystem analysis dashboard. In European Conference on Software Maintenance and Reengineering (CSMR). IEEE, 527–530.",
      "doi": "10.1109/CSMR.2012.69"
    },
    {
      "text": "Jessica Perrie, Jing Xie, Maleknaz Nayebi, Marios Fokaefs, Kelly Lyons, and Eleni Stroulia. 2019. City on the river: visualizing temporal collaboration. In International Conference on Computer Science and Software Engineering. 82–91.",
      "doi": ""
    },
    {
      "text": "Gede Artha Azriadi Prana, Denae Ford, Ayushi Rastogi, David Lo, Rahul Purandare, and Nachiappan Nagappan. 2021. Including everyone, everywhere: Understanding opportunities and challenges of geographic gender-inclusion in OSS. IEEE Transactions on Software Engineering(2021).",
      "doi": ""
    },
    {
      "text": "Huilian Sophie Qiu, Yucen Lily Li, Susmita Padala, Anita Sarma, and Bogdan Vasilescu. 2019. The signals that potential contributors look for when choosing open-source projects. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–29.",
      "doi": "10.1145/3359224"
    },
    {
      "text": "Huilian Sophie Qiu, Alexander Nolte, Anita Brown, Alexander Serebrenik, and Bogdan Vasilescu. 2019. Going Farther Together: The Impact of Social Capital on Sustained Participation in Open Source. In International Conference on Software Engineering(ICSE). IEEE, 688–699. https://doi.org/10.1109/ICSE.2019.00078",
      "doi": "10.1109/ICSE.2019.00078"
    },
    {
      "text": "Huilian Sophie Qiu, Bogdan Vasilescu, Christian Kästner, Carolyn Egelman, Ciera Jaspan, and Emerson Murphy-Hill. 2022. Detecting Interpersonal Conflict in Issues and Code Review: Cross Pollinating Open-and Closed-Source Approaches. In International Conference on Software Engineering, Software Engineering in Society (ICSE-SEIS). IEEE, 41–55.",
      "doi": ""
    },
    {
      "text": "Huilian Sophie* Qiu, Zihe H* Zhao, Tielin Katy Yu, Justin Wang, Alexander Ma, Hongbo Fang, Laura Dabbish, and Bogdan Vasilescu. 2023. Gender Representation Among Contributors to Open-Source Infrastructure - An Analysis of 20 Package Manager Ecosystems. In International Conference on Software Engineering - Software Engineering in Society(ICSE SEIS). ACM.",
      "doi": ""
    },
    {
      "text": "Naveen Raman, Minxuan Cao, Yulia Tsvetkov, Christian Kästner, and Bogdan Vasilescu. 2020. Stress and Burnout in Open Source: Toward Finding, Understanding, and Mitigating Unhealthy Interactions. In International Conference on Software Engineering, New Ideas and Emerging Results(ICSE). ACM, 57–60.",
      "doi": "10.1145/3377816.3381732"
    },
    {
      "text": "Dirk Riehle, Philipp Riemer, Carsten Kolassa, and Michael Schmidt. 2014. Paid vs. volunteer work in open source. In Hawaii International Conference on System Sciences (HICSS). IEEE, 3286–3295.",
      "doi": "10.1109/HICSS.2014.407"
    },
    {
      "text": "Gregorio Robles, Jesus M Gonzalez-Barahona, and Martin Michlmayr. 2005. Evolution of volunteer participation in libre software projects: evidence from Debian. In International Conference on Open Source Systems (OSS). 100–107.",
      "doi": ""
    },
    {
      "text": "Davide Rossi and Stefano Zacchiroli. 2022. Worldwide gender differences in public code contributions: and how they have been affected by the COVID-19 pandemic. In International Conference on Software Engineering, Software Engineering in Society (ICSE-SEIS). 172–183.",
      "doi": "10.1145/3510458.3513011"
    },
    {
      "text": "Samiha Samrose, Daniel McDuff, Robert Sim, Jina Suh, Kael Rowan, Javier Hernandez, Sean Rintel, Kevin Moynihan, and Mary Czerwinski. 2021. Meetingcoach: An intelligent dashboard for supporting effective & inclusive meetings. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": ""
    },
    {
      "text": "Anita Sarma, Larry Maccherone, Patrick Wagstrom, and James Herbsleb. 2009. Tesseract: Interactive visual exploration of socio-technical relationships in software development. In International Conference on Software Engineering (ICSE). IEEE, 23–33.",
      "doi": "10.1109/ICSE.2009.5070505"
    },
    {
      "text": "Pratyush N Sharma, John Hulland, and Sherae Daniel. 2012. Examining turnover in open source software projects using logistic hierarchical linear modeling approach. In IFIP International Conference on Open Source Systems (OSS). Springer, 331–337.",
      "doi": ""
    },
    {
      "text": "Jyoti Sheoran, Kelly Blincoe, Eirini Kalliamvakou, Daniela Damian, and Jordan Ell. 2014. Understanding watchers on GitHub. In Proceedings of the International Conference on Mining Software Repositories (MSR). ACM, 336–339.",
      "doi": "10.1145/2597073.2597114"
    },
    {
      "text": "Ben Shneiderman and Catherine Plaisant. 2006. Strategies for evaluating information visualization tools: multi-dimensional in-depth long-term case studies. In Proceedings of the 2006 AVI workshop on BEyond time and errors: novel evaluation methods for information visualization. 1–7.",
      "doi": "10.1145/1168149.1168158"
    },
    {
      "text": "Dan Sholler, Igor Steinmacher, Denae Ford, Mara Averick, Mike Hoye, and Greg Wilson. 2019. Ten simple rules for helping newcomers become contributors to open projects. PLoS Computational Biology 15, 9 (2019), e1007296.",
      "doi": ""
    },
    {
      "text": "Vandana Singh, Brice Bongiovanni, and William Brandon. 2022. Codes of conduct in Open Source Software—for warm and fuzzy feelings or equality in community?Software Quality Journal 30, 2 (2022), 581–620.",
      "doi": ""
    },
    {
      "text": "Davide Spadini, Maurício Aniche, and Alberto Bacchelli. 2018. Pydriller: Python framework for mining software repositories. In Joint Meeting on the Foundations of Software Engineering (ESEC/FSE). 908–911.",
      "doi": "10.1145/3236024.3264598"
    },
    {
      "text": "Ștefan Stănciulescu, Likang Yin, and Vladimir Filkov. 2022. Code, quality, and process metrics in graduated and retired ASFI projects. In Joint Meeting on the Foundations of Software Engineering (ESEC/FSE). 495–506.",
      "doi": "10.1145/3540250.3549132"
    },
    {
      "text": "Igor Steinmacher, Tayana Conte, Marco Aurélio Gerosa, and David Redmiles. 2015. Social barriers faced by newcomers placing their first contribution in open source software projects. In ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW). 1379–1392.",
      "doi": "10.1145/2675133.2675215"
    },
    {
      "text": "Igor Steinmacher, Tayana Uchoa Conte, Christoph Treude, and Marco Aurélio Gerosa. 2016. Overcoming open source project entry barriers with a portal for newcomers. In International Conference on Software Engineering (ICSE). 273–284.",
      "doi": "10.1145/2884781.2884806"
    },
    {
      "text": "Igor Steinmacher, Marco Aurélio Gerosa, and David Redmiles. 2014. Attracting, onboarding, and retaining newcomer developers in open source software projects. In Workshop on Global Software Development in a CSCW Perspective.",
      "doi": ""
    },
    {
      "text": "Igor Steinmacher, Gustavo Pinto, Igor Scaliante Wiese, and Marco Aurélio Gerosa. 2018. Almost there: A study on quasi-contributors in open-source software projects. In 2018 IEEE/ACM 40th International Conference on Software Engineering (ICSE). IEEE, 256–266.",
      "doi": "10.1145/3180155.3180208"
    },
    {
      "text": "Igor Steinmacher, Marco Aurelio Graciotto Silva, Marco Aurelio Gerosa, and David F Redmiles. 2015. A systematic literature review on the barriers faced by newcomers to open source software projects. Information and Software Technology 59 (2015), 67–85.",
      "doi": "10.1016/j.infsof.2014.11.001"
    },
    {
      "text": "Igor Steinmacher, Igor Wiese, Ana Paula Chaves, and Marco Aurélio Gerosa. 2013. Why do newcomers abandon open source software projects?. In 2013 6th International Workshop on Cooperative and Human Aspects of Software Engineering (CHASE). IEEE, 25–32.",
      "doi": ""
    },
    {
      "text": "Igor Steinmacher, Igor Scaliante Wiese, Tayana Conte, Marco Aurélio Gerosa, and David Redmiles. 2014. The hard life of open source software project newcomers. In Proceedings of the 7th international workshop on cooperative and human aspects of software engineering. 72–78.",
      "doi": "10.1145/2593702.2593704"
    },
    {
      "text": "Chandrasekar Subramaniam, Ravi Sen, and Matthew L Nelson. 2009. Determinants of open source software project success: A longitudinal study. Decision Support Systems 46, 2 (2009), 576–585.",
      "doi": "10.1016/j.dss.2008.10.005"
    },
    {
      "text": "Josh Terrell, Andrew Kofink, Justin Middleton, Clarissa Rainear, Emerson Murphy-Hill, Chris Parnin, and Jon Stallings. 2017. Gender differences and bias in open source: Pull request acceptance of women versus men. PeerJ Comp Sci 3(2017), e111.",
      "doi": ""
    },
    {
      "text": "Ferdian Thung, Tegawende F Bissyande, David Lo, and Lingxiao Jiang. 2013. Network structure of social coding in GitHub. In European Conference on Software Maintenance and Reengineering (CSMR). IEEE, 323–326.",
      "doi": "10.1109/CSMR.2013.41"
    },
    {
      "text": "Marco Torchiano, Filippo Ricca, and Alessandro Marchetto. 2011. Is My Project’s Truck Factor Low? Theoretical and Empirical Considerations about the Truck Factor Threshold. In Proceedings of the 2nd International Workshop on Emerging Trends in Software Metrics (Waikiki, Honolulu, HI, USA) (WETSoM ’11). Association for Computing Machinery, New York, NY, USA, 12–18. https://doi.org/10.1145/1985374.1985379",
      "doi": "10.1145/1985374.1985379"
    },
    {
      "text": "Bianca Trinkenreich, Igor Wiese, Anita Sarma, Marco Gerosa, and Igor Steinmacher. 2022. Women’s participation in open source software: A survey of the literature. ACM Transactions on Software Engineering and Methodology (TOSEM) 31, 4(2022), 1–37.",
      "doi": "10.1145/3510460"
    },
    {
      "text": "Asher Trockman, Shurui Zhou, Christian Kästner, and Bogdan Vasilescu. 2018. Adding Sparkle to Social Coding: An Empirical Study of Repository Badges in the npm Ecosystem. In Proceedings of the International Conference on Software Engineering(ICSE). ACM, 511–522.",
      "doi": "10.1145/3180155.3180209"
    },
    {
      "text": "Marat Valiev, Bogdan Vasilescu, and James Herbsleb. 2018. Ecosystem-level determinants of sustained activity in open-source projects: A case study of the PyPI ecosystem. In Joint Meeting on the Foundations of Software Engineering (ESEC/FSE). 644–655.",
      "doi": "10.1145/3236024.3236062"
    },
    {
      "text": "Jari Varsaluoma and Farrukh Sahar. 2014. Usefulness of long-term user experience evaluation to product development: Practitioners’ views from three case studies. In Proceedings of the 8th Nordic conference on human-Computer interaction: Fun, Fast, Foundational. 79–88.",
      "doi": "10.1145/2639189.2641218"
    },
    {
      "text": "Bogdan Vasilescu, Daryl Posnett, Baishakhi Ray, Mark G.J. van den Brand, Alexander Serebrenik, Premkumar Devanbu, and Vladimir Filkov. 2015. Gender and Tenure Diversity in GitHub Teams. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3789–3798. https://doi.org/10.1145/2702123.2702549",
      "doi": "10.1145/2702123.2702549"
    },
    {
      "text": "Mairieli Wessel, Bruno Mendes De Souza, Igor Steinmacher, Igor S Wiese, Ivanilton Polato, Ana Paula Chaves, and Marco A Gerosa. 2018. The power of bots: Characterizing and understanding bots in oss projects. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–19.",
      "doi": "10.1145/3274451"
    },
    {
      "text": "Diego Winter, Guilherme Avelino, and Charles Miranda. 2022. HealthyEnv: a tool to assist in health assessment of software repositories. In Brazilian Symposium on Software Engineering (SBES). 382–387.",
      "doi": "10.1145/3555228.3555279"
    },
    {
      "text": "Jean-Gabriel Young, Amanda Casari, Katie McLaughlin, Milo Z Trujillo, Laurent Hébert-Dufresne, and James P Bagrow. 2021. Which contributions count? Analysis of attribution in open source. In International Conference on Mining Software Repositories (MSR). IEEE, 242–253.",
      "doi": ""
    },
    {
      "text": "Stefano Zacchiroli. 2020. Gender differences in public code contributions: a 50-year perspective. IEEE Software 38, 2 (2020), 45–50.",
      "doi": "10.1109/MS.2020.3038765"
    },
    {
      "text": "Jierui Zhang, Liang Wang, Zhiwen Zheng, and Xianping Tao. 2022. Social Community Evolution Analysis and Visualization in Open Source Software Projects. In International Conference on Web Information Systems Engineering. Springer, 38–45.",
      "doi": ""
    }
  ]
}