{
  "doi": "10.1145/3544548.3580642",
  "title": "Drawing Transforms: A Unifying Interaction Primitive to Procedurally Manipulate Graphics across Style, Space, and Time",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Procedural functionality enables visual creators to rapidly edit, explore alternatives, and fine-tune artwork in many domains including illustration, motion graphics, and interactive animation. Symbolic procedural tools, such as textual programming languages, are highly expressive but often limit directly manipulating concrete artwork; whereas direct manipulation tools support some procedural expression but limit creators to pre-defined behaviors and inputs. Inspired by visions of using geometric input to create procedural relationships, we identify an opportunity to use vector geometry from artwork to specify expressive user-defined procedural functions. We present Drawing Transforms (DTs), a technique that enables the use of any drawing to procedurally transform the stylistic, spatial, and temporal properties of target artwork. We apply DTs in a prototype motion graphics system to author continuous and discrete transformations, modify multiple elements in a composition simultaneously, create animations, and control fine-grained procedural instantiation. We discuss how DTs can unify procedural authoring through direct manipulation across visual media domains.",
  "tags": [
    "procedural art",
    "creativity support tools",
    "direct manipulation"
  ],
  "authors": [
    {
      "name": "Sonia Hashim",
      "institution": "Computer Science, University of California Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702541",
      "orcid": "0000-0003-3173-5344"
    },
    {
      "name": "Tobias Höllerer",
      "institution": "Computer Science, University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100002957",
      "orcid": "0000-0002-6240-0291"
    },
    {
      "name": "Jennifer Jacobs",
      "institution": "Media Arts and Technology, University of California Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556713956",
      "orcid": "0000-0001-8666-8527"
    }
  ],
  "references": [
    {
      "text": "Michel Beaudouin-Lafon. 2000. Instrumental Interaction: An Interaction Model for Designing Post-WIMP User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI ’00). Association for Computing Machinery, New York, NY, USA, 446–453. https://doi.org/10.1145/332040.332473",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2019. UIST 2019 Visions - A World Without Apps. https://www.youtube.com/watch?v=ntaudUum06E",
      "doi": ""
    },
    {
      "text": "John Berger. 2008. Drawing. In Selected Essays of John Berger, Geoff Dyer (Ed.). Knopf Doubleday Publishing Group.",
      "doi": ""
    },
    {
      "text": "Samuelle Bourgault and Jennifer Jacobs. 2021. Preserving Hand-Drawn Qualities in Audiovisual Performance Through Sketch-Based Interaction. In 2021 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 1–10. https://doi.org/10.1109/VL/HCC51201.2021.9576315",
      "doi": ""
    },
    {
      "text": "Marianela Ciolfi Felice, Nolwenn Maudet, Wendy E. Mackay, and Michel Beaudouin-Lafon. 2016. Beyond Snapping: Persistent, Tweakable Alignment and Distribution with StickyLines. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 133–144. https://doi.org/10.1145/2984511.2984577",
      "doi": "10.1145/2984511.2984577"
    },
    {
      "text": "Andy Cockburn and Andrew Bryant. 2001. Leogo: An Equal Opportunity User Interface for Programming. Journal of Visual Languages & Computing 8 (01 2001). https://doi.org/10.1006/jvlc.1997.0152",
      "doi": ""
    },
    {
      "text": "Thomas O Ellis, John F Heafner, and William L Sibley. 1969. The GRAIL Project: An experiment in man-machine communications. Technical Report. RAND CORP SANTA MONICA CA.",
      "doi": ""
    },
    {
      "text": "Tong Ge, Bongshin Lee, and Yunhai Wang. 2021. CAST: Authoring Data-Driven Chart Animations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 24, 15 pages. https://doi.org/10.1145/3411764.3445452",
      "doi": "10.1145/3411764.3445452"
    },
    {
      "text": "Stanley Gill. 2003. Stored Program Concept. John Wiley and Sons Ltd., GBR, 1691–1693.",
      "doi": ""
    },
    {
      "text": "Grasshopper 2007. Grasshopper. http://www.grasshopper3d.com.",
      "doi": ""
    },
    {
      "text": "M. D. Gross. 2009. Visual Languages and Visual Thinking: Sketch Based Interaction and Modeling. In Proceedings of the 6th Eurographics Symposium on Sketch-Based Interfaces and Modeling (New Orleans, Louisiana) (SBIM ’09). Association for Computing Machinery, New York, NY, USA, 7–11. https://doi.org/10.1145/1572741.1572743",
      "doi": "10.1145/1572741.1572743"
    },
    {
      "text": "Experimental Media Research Group. 2004. NodeBox. http://www.nodebox.net.",
      "doi": ""
    },
    {
      "text": "Brian Hempel, Justin Lubin, and Ravi Chugh. 2019. Sketch-n-Sketch: Output-Directed Programming for SVG. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 281–292. https://doi.org/10.1145/3332165.3347925",
      "doi": "10.1145/3332165.3347925"
    },
    {
      "text": "Christopher F Herot. 1976. Graphical input through machine recognition of sketches. In Proceedings of the 3rd annual conference on Computer graphics and interactive techniques. 97–102.",
      "doi": "10.1145/563274.563294"
    },
    {
      "text": "Raphaël Hoarau and Stéphane Conversy. 2012. Augmenting the Scope of Interactions with Implicit and Explicit Graphical Structures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1937–1946. https://doi.org/10.1145/2207676.2208337",
      "doi": "10.1145/2207676.2208337"
    },
    {
      "text": "Enamul Hoque and Maneesh Agrawala. 2020. Searching the Visual Style and Structure of D3 Visualizations. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 1236–1245. https://doi.org/10.1109/TVCG.2019.2934431",
      "doi": ""
    },
    {
      "text": "Houdini 2022. Houdini. https://www.sidefx.com/products/houdini/.",
      "doi": ""
    },
    {
      "text": "Cuttle Labs Inc.2022. Cuttle: A design tool for digital cutting machines. https://cuttle.xyz/",
      "doi": ""
    },
    {
      "text": "Jennifer Jacobs, Joel Brandt, Radomír Mech, and Mitchel Resnick. 2018. Extending Manual Drawing Practices with Artist-Centric Programming Tools. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174164",
      "doi": "10.1145/3173574.3174164"
    },
    {
      "text": "Jennifer Jacobs, Sumit Gogia, Radomír Mĕch, and Joel R. Brandt. 2017. Supporting Expressive Procedural Art Creation Through Direct Manipulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 6330–6341. https://doi.org/10.1145/3025453.3025927",
      "doi": "10.1145/3025453.3025927"
    },
    {
      "text": "Gabe Johnson, Mark Gross, Ellen Yi-Luen Do, and Jason Hong. 2012. Sketch It, Make It: Sketching Precise Drawings for Laser Cutting. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems (Austin, Texas, USA) (CHI EA ’12). Association for Computing Machinery, New York, NY, USA, 1079–1082. https://doi.org/10.1145/2212776.2212390",
      "doi": "10.1145/2212776.2212390"
    },
    {
      "text": "Gabe Johnson, Mark Gross, Jason Hong, and Ellen Do. 2009. Computational Support for Sketching in Design: A Review. Foundations and Trends in Human-Computer Interaction 2 (01 2009), 1–93. https://doi.org/10.1561/1100000013",
      "doi": "10.1561/1100000013"
    },
    {
      "text": "Jonathan Puckey Jürg Lehni. 2021. Paper.js, The Swiss Army Knife of Vector Graphics Scripting. Retrieved April 7, 2022 from http://paperjs.org/",
      "doi": ""
    },
    {
      "text": "Alan C. Kay. 1990. User Interface: A Personal View. Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. 2014. Kitty: Sketching Dynamic and Interactive Illustrations. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (Honolulu, Hawaii, USA) (UIST ’14). ACM, New York, NY, USA, 11 pages.",
      "doi": "10.1145/2642918.2647375"
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, Shengdong Zhao, and George Fitzmaurice. 2014. Draco: Bringing Life to Illustrations with Kinetic Textures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 351–360. https://doi.org/10.1145/2556288.2556987",
      "doi": "10.1145/2556288.2556987"
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Hyunmin Cheong, Ali Hashemi, and George Fitzmaurice. 2017. DreamSketch: Early Stage 3D Design Explorations with Sketching and Generative Design. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 401–414. https://doi.org/10.1145/3126594.3126662",
      "doi": "10.1145/3126594.3126662"
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Nobuyuki Umetani, and George Fitzmaurice. 2016. SKUID: Sketching Dynamic Drawings Using the Principles of 2D Animation. In ACM SIGGRAPH 2016 Talks (Anaheim, California) (SIGGRAPH ’16). ACM, New York, NY, USA, Article 84, 1 pages. https://doi.org/10.1145/2897839.2927410",
      "doi": "10.1145/2897839.2927410"
    },
    {
      "text": "Nam Wook Kim, Eston Schweickart, Zhicheng Liu, Mira Dontcheva, Wilmot Li, Jovan Popovic, and Hanspeter Pfister. 2017. Data-Driven Guides: Supporting Expressive Design for Information Graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 491–500. https://doi.org/10.1109/TVCG.2016.2598620",
      "doi": "10.1109/TVCG.2016.2598620"
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. ",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Cheryl Lao, Haijun Xia, Daniel Wigdor, and Fanny Chevalier. 2021. Attribute Spaces: Supporting Design Space Exploration in Virtual Reality. In Symposium on Spatial User Interaction (Virtual Event, USA) (SUI ’21). Association for Computing Machinery, New York, NY, USA, Article 11, 11 pages. https://doi.org/10.1145/3485279.3485290",
      "doi": "10.1145/3485279.3485290"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3173574.3173610",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "G. Levin and T. Brain. 2021. Code as Creative Medium: A Handbook for Computational Art and Design. MIT Press. https://books.google.com/books?id=hs_tDwAAQBAJ",
      "doi": ""
    },
    {
      "text": "Jingyi Li, Joel Brandt, Radomír Mech, Maneesh Agrawala, and Jennifer Jacobs. 2020. Supporting Visual Artists in Programming through Direct Inspection and Control of Program Execution. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376765",
      "doi": "10.1145/3313831.3376765"
    },
    {
      "text": "Jingyi Li, Sonia Hashim, and Jennifer Jacobs. 2021. What We Can Learn From Visual Artists About Software Development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, 14 pages. https://doi.org/10.1145/3411764.3445682",
      "doi": "10.1145/3411764.3445682"
    },
    {
      "text": "Zhicheng Liu, John Thompson, Alan Wilson, Mira Dontcheva, James Delorey, Sam Grigg, Bernard Kerr, and John Stasko. 2018. Data Illustrator: Augmenting Vector Design Tools with Lazy Data Binding for Expressive Visualization Authoring. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173697",
      "doi": "10.1145/3173574.3173697"
    },
    {
      "text": "Jiaju Ma, Li-Yi Wei, and Rubaiat Habib Kazi. 2022. To Appear: A Layered Authoring Tool for Creating Stylized 3D Animations. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA.",
      "doi": "10.1145/3491102.3501894"
    },
    {
      "text": "M. McCullough. 1996. Abstracting Craft: The Practiced Digital Hand. The MIT Press, Cambridge, Massachusetts.",
      "doi": "10.5555/521472"
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 639–648. https://doi.org/10.1145/2702123.2702175",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "Dan R. Olsen. 2007. Evaluating User Interface Systems Research. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (Newport, Rhode Island, USA) (UIST ’07). Association for Computing Machinery, New York, NY, USA, 251–258. https://doi.org/10.1145/1294211.1294256",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "Stephen Oney, Brad Myers, and Joel Brandt. 2014. InterState: A Language and Environment for Expressing Interface Behavior. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 263–272. https://doi.org/10.1145/2642918.2647358",
      "doi": "10.1145/2642918.2647358"
    },
    {
      "text": "Ken Perlin. 2017. Introduction to Chalktalk. https://github.com/kenperlin/chalktalk",
      "doi": ""
    },
    {
      "text": "C. Reas and B. Fry. 2004. Processing. http://processing.org.",
      "doi": ""
    },
    {
      "text": "Toby Schachman. 2012. Alternative Programming Interfaces for Alternative Programmers. In Proceedings of the ACM International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software (Tucson, Arizona, USA) (Onward! 2012). ACM, New York, NY, USA.",
      "doi": "10.1145/2384592.2384594"
    },
    {
      "text": "Ben Shneiderman. 1997. Direct manipulation for comprehensible, predictable and controllable user interfaces. In Proceedings of the 2nd international conference on Intelligent user interfaces. 33–39.",
      "doi": "10.1145/238218.238281"
    },
    {
      "text": "Ivan E. Sutherland. 1964. Sketchpad a Man-Machine Graphical Communication System. Transactions of the Society for Computer Simulation 2, 5 (1964), R–3–R–20. https://doi.org/10.1177/003754976400200514",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Rubaiat Habib Kazi, Li-Yi Wei, Stephen DiVerdi, Wilmot Li, and Daniel Leithinger. 2021. RealitySketch: Augmented Reality Sketching for Real-Time Embedded and Responsive Visualizations. In SIGGRAPH Asia 2021 Real-Time Live! (Tokyo, Japan) (SA ’21). Association for Computing Machinery, New York, NY, USA, Article 5, 1 pages. https://doi.org/10.1145/3478511.3491313",
      "doi": "10.1145/3478511.3491313"
    },
    {
      "text": "Unity Technologies. 2022. Develop Gameplay Mechanics with Visual Scripting in Unity. https://unity.com/products/unity-visual-scripting.",
      "doi": ""
    },
    {
      "text": "Theophanis Tsandilas. 2021. StructGraphics: Flexible Visualization Design through Data-Agnostic and Reusable Graphical Structures. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 315–325. https://doi.org/10.1109/TVCG.2020.3030476",
      "doi": ""
    },
    {
      "text": "Theophanis Tsandilas, Anastasia Bezerianos, and Thibaut Jacob. 2015. SketchSliders: Sketching Widgets for Visual Exploration on Wall Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3255–3264. https://doi.org/10.1145/2702123.2702129",
      "doi": "10.1145/2702123.2702129"
    },
    {
      "text": "B. Victor. 2011. Dynamic Pictures. http://worrydream.com/DynamicPicturesMotivation.",
      "doi": ""
    },
    {
      "text": "B. Victor. 2012. Inventing on Principle. In Proc. of the Canadian University Software Engineering Conference.",
      "doi": ""
    },
    {
      "text": "B. Victor. 2012. Learnable Programing: Designing a programming system for understanding programs. (2012). http://worrydream.com/LearnableProgramming/",
      "doi": ""
    },
    {
      "text": "B. Victor. 2012. Stop Drawing Dead Fish. In ACM SIGGRAPH 2012 Talks(SIGGRAPH ’12).",
      "doi": ""
    },
    {
      "text": "B. Victor. 2013. Drawing Dynamic Data Visualizations (Talk). http://vimeo.com/66085662.",
      "doi": ""
    },
    {
      "text": "[56] Dave Whyte.2017. Retrieved April 7, 2022 from https://www.instagram.com/p/BVAb1LuhNBz/",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Bruno Araujo, Tovi Grossman, and Daniel Wigdor. 2016. Object-Oriented Drawing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (Santa Clara, California, USA) (CHI ’16). ACM, New York, NY, USA, 4610–4621. https://doi.org/10.1145/2858036.2858075",
      "doi": "10.1145/2858036.2858075"
    },
    {
      "text": "Haijun Xia, Nathalie Henry Riche, Fanny Chevalier, Bruno De Araujo, and Daniel Wigdor. 2018. DataInk: Direct and Creative Data-Oriented Drawing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173797",
      "doi": "10.1145/3173574.3173797"
    },
    {
      "text": "Jun Xing, Rubaiat Habib Kazi, Tovi Grossman, Li-Yi Wei, Jos Stam, and George Fitzmaurice. 2016. Energy-Brushes: Interactive Tools for Illustrating Stylized Elemental Dynamics. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 755–766. https://doi.org/10.1145/2984511.2984585",
      "doi": "10.1145/2984511.2984585"
    }
  ]
}