{
  "doi": "10.1145/3544548.3581435",
  "title": "Automatic Improper Loading Posture Detection and Correction Utilizing Electrical Muscle Stimulation",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Chronic lower back pain due to improper lifting techniques poses a major workplace safety hazard. The major risk factors for improper loading posture (ILP) include overloading, and improper loading of the lumbar muscles, ligaments, and vertebrae due to repetitive mechanical stresses exerted upon them. The current intervention technology relies on the users’ intent and willingness to self-correct ILP through alert-based feedback or involves wearing bulky lift assist devices to prevent ILP. We address these issues with a physiological feedback system that utilizes IMU sensors for ILP detection and Electrical Muscle Stimulation (EMS) for automatic dynamic ILP correction for restoring ideal lifting angles for torso inclination and knee bend. In a user study involving 36 participants, our automatic approach delivered significantly faster correction and outperformed alternative feedback mechanisms (Audio and Vibro-tactile) and was perceived to be interesting, comfortable and a potential commercial product.",
  "tags": [
    "Posture correction",
    "Wearable",
    "Lifting",
    "Preventive Healthcare",
    "Biological feedback",
    "Electrical Muscle Stimulation"
  ],
  "authors": [
    {
      "name": "Ravi Kiran Kattoju",
      "institution": "Interactive Systems and User Experience Lab, University of Central Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782865",
      "orcid": "0000-0002-5616-5483"
    },
    {
      "name": "Ryan Ghamandi",
      "institution": "Interactive Systems and User Experience Lab, University of Central Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238676",
      "orcid": "0000-0003-4654-839X"
    },
    {
      "name": "Eugene Matthew Taranta",
      "institution": "Interactive Systems and User Experience Lab, University of Central Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89558635157",
      "orcid": "0000-0001-5615-2597"
    },
    {
      "name": "Joseph J. Laviola",
      "institution": "University of Central Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100283513",
      "orcid": "0000-0003-1186-4130"
    }
  ],
  "references": [
    {
      "text": "Mohammad Abdoli-E, Michael J Agnew, and Joan M Stevenson. 2006. An on-body personal lift augmentation device (PLAD) reduces EMG amplitude of erector spinae during lifting tasks. Clinical Biomechanics 21, 5 (2006), 456–465.",
      "doi": ""
    },
    {
      "text": "Mohammad Abdoli-e and Joan M Stevenson. 2008. The effect of on-body lift assistive device on the lumbar 3D dynamic moments and EMG during asymmetric freestyle lifting. Clinical Biomechanics 23, 3 (2008), 372–380.",
      "doi": ""
    },
    {
      "text": "Mohammad Abdoli-Eramaki, Joan M Stevenson, Susan A Reid, and Timothy J Bryant. 2007. Mathematical and empirical proof of principle for an on-body personal lift augmentation device (PLAD). Journal of biomechanics 40, 8 (2007), 1694–1700.",
      "doi": ""
    },
    {
      "text": "Michael A Adams, Brian JC Freeman, Helen P Morrison, Ian W Nelson, and Patricia Dolan. 2000. Mechanical initiation of intervertebral disc degeneration. Spine 25, 13 (2000), 1625–1636.",
      "doi": ""
    },
    {
      "text": "Takamitsu Aida, Hirokazu Nozaki, and Hiroshi Kobayashi. 2009. Development of muscle suit and application to factory laborers. In 2009 International Conference on Mechatronics and Automation. IEEE, 1027–1032.",
      "doi": ""
    },
    {
      "text": "Bruce P Bernard and Vern Putz-Anderson. 1997. Musculoskeletal disorders and workplace factors; a critical review of epidemiologic evidence for work-related musculoskeletal disorders of the neck, upper extremity, and low back. (1997).",
      "doi": ""
    },
    {
      "text": "Nikolai Bogduk. 2005. Clinical anatomy of the lumbar spine and sacrum. Elsevier Health Sciences.",
      "doi": ""
    },
    {
      "text": "Magdo Bortole, Anusha Venkatakrishnan, Fangshi Zhu, Juan C Moreno, Gerard E Francisco, Jose L Pons, and Jose L Contreras-Vidal. 2015. The H2 robotic exoskeleton for gait rehabilitation after stroke: early findings from a clinical study. Journal of neuroengineering and rehabilitation 12, 1(2015), 54.",
      "doi": ""
    },
    {
      "text": "Mikkel Brandt, Pascal Madeleine, Afshin Samani, Markus Due Jakobsen, Sebastian Skals, Jonas Vinstrup, and Lars Louis Andersen. 2018. Accuracy of identification of low or high risk lifting during standardised lifting situations. Ergonomics 61, 5 (2018), 710–719.",
      "doi": ""
    },
    {
      "text": "Don B Chaffin and KYUNG S PARK. 1973. A longitudinal study of low-back pain as associated with occupational weight lifting factors. American Industrial Hygiene Association Journal 34, 12 (1973), 513–525.",
      "doi": ""
    },
    {
      "text": "Pieter Coenen, Idsart Kingma, Cécile RL Boot, Jos WR Twisk, Paulien M Bongers, and Jaap H van Dieën. 2013. Cumulative low back load at work as a risk factor of low back pain: a prospective cohort study. Journal of occupational rehabilitation 23, 1 (2013), 11–18.",
      "doi": ""
    },
    {
      "text": "Ilaria Conforti, Ilaria Mileti, Zaccaria Del Prete, and Eduardo Palermo. 2020. Measuring biomechanical risk in lifting load tasks through wearable system and machine-learning approach. Sensors 20, 6 (2020), 1557.",
      "doi": ""
    },
    {
      "text": "Matthew A Davis. 2012. Where the United States spends its spine dollars: expenditures on different ambulatory services for the management of back and neck conditions. Spine 37, 19 (2012), 1693.",
      "doi": ""
    },
    {
      "text": "Michiel P De Looze, Tim Bosch, Frank Krause, Konrad S Stadler, and Leonard W O’Sullivan. 2016. Exoskeletons for industrial application and their potential effects on physical work load. Ergonomics 59, 5 (2016), 671–681.",
      "doi": ""
    },
    {
      "text": "Cristiano De Marchis, Thiago Santos Monteiro, Cristina Simon-Martinez, Silvia Conforto, and Alireza Gharabaghi. 2016. Multi-contact functional electrical stimulation for hand opening: electrophysiologically driven identification of the optimal stimulation site. Journal of neuroengineering and rehabilitation 13, 1(2016), 22.",
      "doi": ""
    },
    {
      "text": "Jeffrey Delpresto, Chuhong Duan, Lara M Layiktez, Eyitemi G Moju-Igbene, Matthew B Wood, and Peter A Beling. 2013. Safe lifting: An adaptive training system for factory workers using the Microsoft Kinect. In 2013 IEEE Systems and Information Engineering Design Symposium. IEEE, 64–69.",
      "doi": ""
    },
    {
      "text": "R Deyo. 1994. Back Pain Patient Outcomes Assessment Team (BOAT). US Department of Health & Human Services-Agency of Healthcare Research (1994).",
      "doi": ""
    },
    {
      "text": "P Dolan and MA Adams. 1998. Repetitive lifting tasks fatigue the back muscles and increase the bending moment acting on the lumbar spine. Journal of biomechanics 31, 8 (1998), 713–721.",
      "doi": ""
    },
    {
      "text": "Francesco Durante, Michele Gabrio Antonelli, and Pierluigi Beomonte Zobel. 2018. Development of an active exoskeleton for assisting back movements in lifting weights. Int. J. Mech. Eng. Robot. Res 7, 4 (2018), 353–360.",
      "doi": ""
    },
    {
      "text": "Ann M Ekes, Jerald D Krister, Arin E Loseth, and Carrie L McKenzie. 1995. Reliability of Lift Alert™ as a feedback device for detecting changes in body position. Journal of occupational rehabilitation 5, 1 (1995), 17–25.",
      "doi": ""
    },
    {
      "text": "Stuart J Gordon, King H Yang, Philip J Mayer, ANDREW H Mace Jr, VINCENT L Kish, and Eric L Radin. 1991. Mechanism of disc rupture. A preliminary report.Spine 16, 4 (1991), 450–456.",
      "doi": ""
    },
    {
      "text": "Maja Goršič, Boyi Dai, and Domen Novak. 2020. Load Position and Weight Classification during Carrying Gait Using Wearable Inertial and Electromyographic Sensors. Sensors 20, 17 (2020), 4963.",
      "doi": ""
    },
    {
      "text": "Runyu L Greene, Ming-Lun Lu, Menekse Salar Barim, Xuan Wang, Marie Hayden, Yu Hen Hu, and Robert G Radwin. 2020. Estimating Trunk Angle Kinematics During Lifting Using a Computationally Efficient Computer Vision Method. Human Factors (2020), 0018720820958840.",
      "doi": ""
    },
    {
      "text": "Mariam Hassib, Max Pfeiffer, Stefan Schneegass, Michael Rohs, and Florian Alt. 2017. Emotion actuator: Embodied emotional feedback through electroencephalography and electrical muscle stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6133–6146.",
      "doi": "10.1145/3025453.3025953"
    },
    {
      "text": "Damian Hoy, Paul Brooks, Fiona Blyth, and Rachelle Buchbinder. 2010. The epidemiology of low back pain. Best practice & research Clinical rheumatology 24, 6(2010), 769–781.",
      "doi": ""
    },
    {
      "text": "Kazuo Kadota, Masao Akai, Kenji Kawashima, and Toshiharu Kagawa. 2009. Development of Power-Assist Robot Arm using pneumatic rubbermuscles with a balloon sensor. In RO-MAN 2009-The 18th IEEE International Symposium on Robot and Human Interactive Communication. IEEE, 546–551.",
      "doi": ""
    },
    {
      "text": "Nabilla Sofia Mohd Kamil and Siti Zawiah Md Dawal. 2015. Effect of postural angle on back muscle activities in aging female workers performing computer tasks. Journal of physical therapy science 27, 6 (2015), 1967–1970.",
      "doi": ""
    },
    {
      "text": "Shunichi Kasahara, Jun Nishida, and Pedro Lopes. 2019. Preemptive Action: Accelerating Human Reaction using Electrical Muscle Stimulation Without Compromising Agency. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300873"
    },
    {
      "text": "Shunichi Kasahara, Kazuma Takada, Jun Nishida, Kazuhisa Shibata, Shinsuke Shimojo, and Pedro Lopes. 2021. Preserving Agency During Electrical Muscle Stimulation Training Speeds up Reaction Time Directly After Removing EMS. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3411764.3445147"
    },
    {
      "text": "Ravi Kiran Kattoju, Corey Richard Pittman, Joseph LaViola, 2020. Automatic Slouching Detection and Correction Utilizing Electrical Muscle Stimulation. In Graphics Interface 2021.",
      "doi": ""
    },
    {
      "text": "Ravi Kiran Kattoju, Eugene M Taranta, Ryan Ghamandi, and Joseph LaViola. 2021. Automatic Asymmetric Weight Distribution Detection and Correction Utilizing Electrical Muscle Stimulation. In Graphics Interface 2022.",
      "doi": ""
    },
    {
      "text": "Benjamin J Keeney, Deborah Fulton-Kehoe, Judith A Turner, Thomas M Wickizer, Kwun Chuen Gary Chan, and Gary M Franklin. 2013. Early predictors of lumbar spine surgery after occupational back injury: results from a prospective study of workers in Washington State. Spine 38, 11 (2013), 953.",
      "doi": ""
    },
    {
      "text": "Hiroshi Kobayashi, Takamitsu Aida, and Takuya Hashimoto. 2009. Muscle suit development and factory application. International Journal of Automation Technology 3, 6 (2009), 709–715.",
      "doi": ""
    },
    {
      "text": "Hiroshi Kobayashi and Hirokazu Nozaki. 2008. Development of support system for forward tilting of the upper body. In 2008 IEEE International Conference on Mechatronics and Automation. IEEE, 352–356.",
      "doi": ""
    },
    {
      "text": "Michinari Kono, Yoshio Ishiguro, Takashi Miyaki, and Jun Rekimoto. 2018. Design and study of a multi-channel electrical muscle stimulation toolkit for human augmentation. In Proceedings of the 9th Augmented Human International Conference. 1–8.",
      "doi": "10.1145/3174910.3174913"
    },
    {
      "text": "Michinari Kono, Takashi Miyaki, and Jun Rekimoto. 2018. In-pulse: inducing fear and pain in virtual experiences. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology. ACM, 40.",
      "doi": "10.1145/3281505.3281506"
    },
    {
      "text": "Jan Kuschan, Henning Schmidt, and Jörg Krüger. 2017. Analysis of ergonomic and unergonomic human lifting behaviors by using Inertial Measurement Units. Current Directions in Biomedical Engineering 3, 1(2017), 7–10.",
      "doi": ""
    },
    {
      "text": "Erik P Lamers, Aaron J Yang, and Karl E Zelik. 2017. Feasibility of a biomechanically-assistive garment to reduce low back loading during leaning and lifting. IEEE Transactions on Biomedical Engineering 65, 8 (2017), 1674–1680.",
      "doi": ""
    },
    {
      "text": "Xiangpan Li. 2013. Design of wearable power assist wear for low back support using pneumatic actuators. (2013).",
      "doi": ""
    },
    {
      "text": "Pedro Lopes. 2017. Interacting with Wearable computers by means of Functional Electrical Muscle Stimulation. In The First Biannual Neuroadaptive Technology Conference. 118.",
      "doi": ""
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. 2013. Muscle-propelled force feedback: bringing force feedback to mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2577–2580.",
      "doi": "10.1145/2470654.2481355"
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. 2017. Immense power in a tiny package: Wearables based on electrical muscle stimulation. IEEE Pervasive Computing 16, 3 (2017), 12–16.",
      "doi": "10.1109/MPRV.2017.2940953"
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. 2017. Interactive systems based on electrical muscle stimulation. Computer 50, 10 (2017), 28–35.",
      "doi": "10.1109/MC.2017.3641627"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating physical impact by combining tactile stimulation with electrical muscle stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 11–19.",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, Willi Mueller, Daniel Hoffmann, Patrik Jonell, and Patrick Baudisch. 2015. Proprioceptive interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 939–948.",
      "doi": "10.1145/2702123.2702461"
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++ Allowing Objects to Communicate Dynamic Use. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2515–2524.",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing haptics to walls & heavy objects in virtual reality by means of electrical muscle stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1471–1482.",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Pedro Lopes, Sijing You, Alexandra Ion, and Patrick Baudisch. 2018. Adding force feedback to mixed reality experiences and games using electrical muscle stimulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174020"
    },
    {
      "text": "Christy A Lotz, Michael J Agnew, Alison A Godwin, and Joan M Stevenson. 2009. The effect of an on-body personal lift assist device (PLAD) on fatigue during a repetitive lifting task. Journal of Electromyography and Kinesiology 19, 2 (2009), 331–340.",
      "doi": ""
    },
    {
      "text": "Chris C Martin, Dan C Burkert, Kyung R Choi, Nick B Wieczorek, Patrick M McGregor, Richard A Herrmann, and Peter A Beling. 2012. A real-time ergonomic monitoring system using the Microsoft Kinect. In 2012 IEEE Systems and Information Engineering Design Symposium. IEEE, 50–55.",
      "doi": ""
    },
    {
      "text": "Rahil Mehrizi, Xi Peng, Dimitris N Metaxas, Xu Xu, Shaoting Zhang, and Kang Li. 2019. Predicting 3-D lower back joint load in lifting: A deep pose estimation approach. IEEE Transactions on Human-Machine Systems 49, 1 (2019), 85–94.",
      "doi": ""
    },
    {
      "text": "Alice MK, MD Wong, Ming-Yih Lee, Jung-Kun Kuo, and Fuk-Tan Tang. 1997. The development and clinical evaluation of a standing biofeedback trainer. Development 34, 3 (1997), 322–327.",
      "doi": ""
    },
    {
      "text": "Yoshiki Muramatsu, Hideyuki Umehara, and Hiroshi Kobayashi. 2013. Improvement and quantitative performance estimation of the back support muscle suit. In 2013 35th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 2844–2849.",
      "doi": ""
    },
    {
      "text": "Alf L Nachemson. 1981. Disc pressure measurements.Spine 6, 1 (1981), 93–97.",
      "doi": ""
    },
    {
      "text": "Keitaro Naruse, Satoshi Kawai, and Takuji Kukichi. 2005. Three-dimensional lifting-up motion analysis for wearable power assist device of lower back support. In 2005 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 2959–2964.",
      "doi": ""
    },
    {
      "text": "Nipun D Nath, Reza Akhavian, and Amir H Behzadan. 2017. Ergonomic analysis of construction worker’s body postures using wearable mobile sensors. Applied ergonomics 62(2017), 107–117.",
      "doi": ""
    },
    {
      "text": "Jun Nishida, Shunichi Kasahara, and Pedro Lopes. 2019. Demonstrating preemptive reaction: accelerating human reaction using electrical muscle stimulation without compromising agency. In ACM SIGGRAPH 2019 Emerging Technologies. 1–2.",
      "doi": "10.1145/3305367.3327997"
    },
    {
      "text": "Jun Nishida, Kanako Takahashi, and Kenji Suzuki. 2015. A wearable stimulation device for sharing and augmenting kinesthetic feedback. In Proceedings of the 6th Augmented Human International Conference. ACM, 211–212.",
      "doi": "10.1145/2735711.2735775"
    },
    {
      "text": "Martin A O’Reilly, Darragh F Whelan, Tomas E Ward, Eamonn Delahunt, and Brian M Caulfield. 2017. Technology in strength and conditioning: assessing bodyweight squat technique with wearable sensors. The Journal of Strength & Conditioning Research 31, 8 (2017), 2303–2312.",
      "doi": ""
    },
    {
      "text": "Max Pfeiffer, Tim Dünte, Stefan Schneegass, Florian Alt, and Michael Rohs. 2015. Cruise control for pedestrians: Controlling walking direction using electrical muscle stimulation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2505–2514.",
      "doi": "10.1145/2702123.2702190"
    },
    {
      "text": "MR Popovic, A Curt, T Keller, and V Dietz. 2001. Functional electrical stimulation for grasping and walking: indications and limitations. Spinal cord 39, 8 (2001), 403–412.",
      "doi": ""
    },
    {
      "text": "Benjamin Riebold, Holger Nahrstaedt, Corinna Schultheiss, Rainer O Seidl, and Thomas Schauer. 2016. Multisensor classification system for triggering FES in order to support voluntary swallowing. European journal of translational myology 26, 4 (2016).",
      "doi": ""
    },
    {
      "text": "Devon I Rubin. 2007. Epidemiology and risk factors for spine pain. Neurologic clinics 25, 2 (2007), 353–371.",
      "doi": ""
    },
    {
      "text": "H Schechtman and DL Bader. 2002. Fatigue damage of human tendons. Journal of biomechanics 35, 3 (2002), 347–353.",
      "doi": ""
    },
    {
      "text": "Stefan Schneegass, Albrecht Schmidt, and Max Pfeiffer. 2016. Creating user interfaces with electrical muscle stimulation. interactions 24, 1 (2016), 74–77.",
      "doi": ""
    },
    {
      "text": "Albert Schultz, Gunnar Andersson, R Ortengren, K Haderspeck, and A Nachemson. 1982. Loads on the lumbar spine. Validation of a biomechanical analysis by measurements of intradiscal pressures and myoelectric signals.The Journal of bone and joint surgery. American volume 64, 5(1982), 713–720.",
      "doi": ""
    },
    {
      "text": "Primož Strojnik, Alojz Kralj, and I Ursic. 1979. Programmed six-channel electrical stimulator for complex stimulation of leg muscles during walking. IEEE Transactions on Biomedical Engineering2 (1979), 112–116.",
      "doi": ""
    },
    {
      "text": "Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. 2011. PossessedHand: techniques for controlling human hands using electrical muscles stimuli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 543–552.",
      "doi": "10.1145/1978942.1979018"
    },
    {
      "text": "S Tanaka, K Yamakoshi, and P Rolfe. 1994. New portable instrument for long-term ambulatory monitoring of posture change using miniature electro-magnetic inclinometers. Medical and Biological Engineering and Computing 32, 3 (1994), 357–360.",
      "doi": ""
    },
    {
      "text": "Waleed Umer, Heng Li, Grace Pui Yuk Szeto, and Arnold Yu Lok Wong. 2017. Identification of biomechanical risk factors for the development of lower-back disorders during manual rebar tying. Journal of Construction Engineering and Management 143, 1(2017), 04016080.",
      "doi": ""
    },
    {
      "text": "Michael Wehner, David Rempel, and Homayoon Kazerooni. 2009. Lower extremity exoskeleton reduces back forces in lifting. In Dynamic Systems and Control Conference, Vol. 48937. 49–56.",
      "doi": ""
    },
    {
      "text": "Michael Wells, Niels Da Vitoria, and Mubarak Shah. 2000. Automatic Visual Tracking for Analysis of Lifting. Citeseer.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle, and James J Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI conference on human factors in computing systems. 143–146.",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Wai Yin Wong and Man Sang Wong. 2008. Smart garment for trunk posture monitoring: A preliminary study. Scoliosis 3, 1 (2008), 1–9.",
      "doi": ""
    },
    {
      "text": "Xuzhong Yan, Heng Li, Angus R Li, and Hong Zhang. 2017. Wearable IMU-based real-time motion warning system for construction workers’ musculoskeletal disorders prevention. Automation in Construction 74 (2017), 2–11.",
      "doi": ""
    },
    {
      "text": "Wenbing Zhao and Roanna Lun. 2016. A Kinect-based system for promoting healthier living at home. In 2016 IEEE international conference on systems, man, and cybernetics (SMC). IEEE, 000258–000263.",
      "doi": "10.1109/SMC.2016.7844251"
    }
  ]
}