{
  "doi": "10.1145/3544548.3581406",
  "title": "CALVI: Critical Thinking Assessment for Literacy in Visualizations",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Visualization misinformation is a prevalent problem, and combating it requires understanding people’s ability to read, interpret, and reason about erroneous or potentially misleading visualizations, which lacks a reliable measurement: existing visualization literacy tests focus on well-formed visualizations. We systematically develop an assessment for this ability by: (1) developing a precise definition of misleaders (decisions made in the construction of visualizations that can lead to conclusions not supported by the data), (2) constructing initial test items using a design space of misleaders and chart types, (3) trying out the provisional test on 497 participants, and (4) analyzing the test tryout results and refining the items using Item Response Theory, qualitative analysis, a wrong-due-to-misleader score, and the content validity index. Our final bank of 45 items shows high reliability, and we provide item bank usage recommendations for future tests and different use cases. Related materials are available at: https://osf.io/pv67z/.",
  "tags": [
    "Information visualization",
    "Visualization literacy",
    "Psychometrics",
    "Visualization misinformation",
    "Measurement"
  ],
  "authors": [
    {
      "name": "Lily W. Ge",
      "institution": "Computer Science, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779470",
      "orcid": "0000-0003-2350-8686"
    },
    {
      "name": "Yuan Cui",
      "institution": "Computer Science, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783603",
      "orcid": "0000-0002-2681-6441"
    },
    {
      "name": "Matthew Kay",
      "institution": "Computer Science and Communication Studies, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659892041",
      "orcid": "0000-0001-9446-0419"
    }
  ],
  "references": [
    {
      "text": "R. Amar, J. Eagan, and J. Stasko. 2005. Low-level components of analytic activity in information visualization. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005.IEEE, Minneapolis, MN, USA, 111–117. https://doi.org/10.1109/INFVIS.2005.1532136",
      "doi": ""
    },
    {
      "text": "Kazuhiro Aoyama. 2007. Investigating a hierarchy of students’ interpretations of graphs. International Electronic Journal of Mathematics Education 2, 3(2007), 298–318.",
      "doi": ""
    },
    {
      "text": "Kazuhiro Aoyama and Max Stephens. 2003. Graph interpretation aspects of statistical literacy: A Japanese perspective. Mathematics Education Research Journal 15, 3 (2003), 207–225.",
      "doi": ""
    },
    {
      "text": "Ryan Best, Elena Mejía, Jasmine Mithani, Anna Wiederkehr, Julia Wolfe, and Yutong Yuan. 2020. The 40 Weirdest (And Best) Charts We Made In This Long, Strange Year. Retrieved August 26, 2022 from https://fivethirtyeight.com/features/the-40-weirdest-and-best-charts-we-made-in-2020/",
      "doi": ""
    },
    {
      "text": "R Darrell Bock and Robert D Gibbons. 2021. Item response theory. John Wiley & Sons, Hoboken, NJ.",
      "doi": ""
    },
    {
      "text": "Denny Borsboom, Gideon J Mellenbergh, and Jaap Van Heerden. 2004. The concept of validity.Psychological review 111, 4 (2004), 1061.",
      "doi": ""
    },
    {
      "text": "Jeremy Boy, Ronald A. Rensink, Enrico Bertini, and Jean-Daniel Fekete. 2014. A Principled Way of Assessing Visualization Literacy. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 1963–1972. https://doi.org/10.1109/TVCG.2014.2346984",
      "doi": ""
    },
    {
      "text": "Matthew Brehmer and Tamara Munzner. 2013. A Multi-Level Typology of Abstract Visualization Tasks. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2376–2385. https://doi.org/10.1109/TVCG.2013.124",
      "doi": "10.1109/TVCG.2013.124"
    },
    {
      "text": "Katy Börner, Andreas Bueckle, and Michael Ginda. 2019. Data visualization literacy: Definitions, conceptual frameworks, exercises, and assessments. Proceedings of the National Academy of Sciences 116, 6 (2019), 1857–1864. https://doi.org/10.1073/pnas.1807180116 arXiv:https://www.pnas.org/doi/pdf/10.1073/pnas.1807180116",
      "doi": ""
    },
    {
      "text": "Katy Börner, Adam Maltese, Russell Nelson Balliet, and Joe Heimlich. 2016. Investigating aspects of data visualization literacy using 20 information visualizations and 273 science museum visitors. Information Visualization 15, 3 (2016), 198–213. https://doi.org/10.1177/1473871615594652 arXiv:https://doi.org/10.1177/1473871615594652",
      "doi": "10.1177/1473871615594652"
    },
    {
      "text": "Paul-Christian Bürkner. 2021. Bayesian Item Response Modeling in R with brms and Stan. Journal of Statistical Software 100, 5 (2021), 1–54. https://doi.org/10.18637/jss.v100.i05",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 981–992. https://doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Jorge D. Camba, Pedro Company, and Vetria L. Byrd. 2022. Identifying Deception as a Critical Component of Visualization Literacy. IEEE Computer Graphics and Applications 42, 1 (2022), 116–122. https://doi.org/10.1109/MCG.2021.3132004",
      "doi": ""
    },
    {
      "text": "Ronald Jay Cohen, W. Joel Schneider, and Renée Tobin. 2022. Psychological Testing and Assessment(10th ed.). McGraw Hill LLC, New York, NY.",
      "doi": ""
    },
    {
      "text": "Michael Correll, Enrico Bertini, and Steven Franconeri. 2020. Truncating the Y-Axis: Threat or Menace?. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376222",
      "doi": "10.1145/3313831.3376222"
    },
    {
      "text": "Michael Correll and Jeffrey Heer. 2017. Black hat visualization. In Workshop on Dealing with Cognitive Biases in Visualisations (DECISIVe), IEEE VIS, Vol. 1. IEEE, Phoenix, Arizona, USA, 10.",
      "doi": ""
    },
    {
      "text": "Michael Correll and Jeffrey Heer. 2017. Surprise! Bayesian Weighting for De-Biasing Thematic Maps. IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 651–660. https://doi.org/10.1109/TVCG.2016.2598618",
      "doi": "10.1109/TVCG.2016.2598618"
    },
    {
      "text": "Lee J Cronbach. 1951. Coefficient alpha and the internal structure of tests. psychometrika 16, 3 (1951), 297–334.",
      "doi": ""
    },
    {
      "text": "Christine DeMars. 2010. Item Response Theory. Oxford University Press, Oxford, United Kingdom. https://doi.org/10.1093/acprof:oso/9780195377033.001.0001",
      "doi": ""
    },
    {
      "text": "Thomas J. Dunn, Thom Baguley, and Vivienne Brunsden. 2014. From alpha to omega: A practical solution to the pervasive problem of internal consistency estimation. British Journal of Psychology 105, 3 (2014), 399–412. https://doi.org/10.1111/bjop.12046 arXiv:https://bpspsychub.onlinelibrary.wiley.com/doi/pdf/10.1111/bjop.12046",
      "doi": ""
    },
    {
      "text": "Carla Evans. 2020. Measuring Student Success Skills: A Review of the Literature on Critical Thinking. 21st Century Success Skills.https://www.nciea.org/library/measuring-student-success-skills-a-review-of-the-literature-on-critical-thinking/",
      "doi": ""
    },
    {
      "text": "Arlen Fan, Yuxin Ma, Michelle Mancenido, and Ross Maciejewski. 2022. Annotating Line Charts for Addressing Deception. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 80, 12 pages. https://doi.org/10.1145/3491102.3502138",
      "doi": "10.1145/3491102.3502138"
    },
    {
      "text": "Iddo Gal. 2002. Adults’ Statistical Literacy: Meanings, Components, Responsibilities. International Statistical Review 70, 1 (2002), 1–25. https://doi.org/10.1111/j.1751-5823.2002.tb00336.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1751-5823.2002.tb00336.x",
      "doi": ""
    },
    {
      "text": "Thomas M. Haladyna. 1999. Developing and validating multiple-choice test items (2nd ed. ed.). L. Erlbaum Associates, Mahwah, N.J.",
      "doi": ""
    },
    {
      "text": "Won Kim, Byoung-Ju Choi, Eui-Kyeong Hong, Soo-Kyung Kim, and Doheon Lee. 2003. A Taxonomy of Dirty Data. Data Mining and Knowledge Discovery 7, 1 (Jan. 2003), 81–99. https://doi.org/10.1023/A:1021564703268",
      "doi": "10.1023/A%3A1021564703268"
    },
    {
      "text": "Gordon Kindlmann and Carlos Scheidegger. 2014. An Algebraic Process for Visualization Design. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 2181–2190. https://doi.org/10.1109/TVCG.2014.2346325",
      "doi": ""
    },
    {
      "text": "Ha-Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2019. Trust and Recall of Information across Varying Degrees of Title-Visualization Misalignment. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300576",
      "doi": "10.1145/3290605.3300576"
    },
    {
      "text": "Marc Lallanilla. 2014. Misleading Gun-Death Chart Draws Fire. Retrieved August 26, 2022 from https://www.livescience.com/45083-misleading-gun-death-chart.html",
      "doi": ""
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, and Bum Chul Kwon. 2017. VLAT: Development of a Visualization Literacy Assessment Test. IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 551–560. https://doi.org/10.1109/TVCG.2016.2598920",
      "doi": "10.1109/TVCG.2016.2598920"
    },
    {
      "text": "Leo Yu-Ho Lo, Ayush Gupta, Kento Shigyo, Aoyu Wu, Enrico Bertini, and Huamin Qu. 2022. Misinformed by Visualization: What Do We Learn From Misinformative Visualizations?Computer Graphics Forum 41, 3 (2022), 515–525. https://doi.org/10.1111/cgf.14559 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.14559",
      "doi": ""
    },
    {
      "text": "Morgan McFall-Johnsen. 2020. A ’cuckoo’ graph with no sense of time or place shows how Georgia bungled coronavirus data as it reopens. Retrieved August 26, 2022 from https://www.businessinsider.com/graph-shows-georgia-bungling-coronavirus-data-2020-5",
      "doi": ""
    },
    {
      "text": "Andrew McNutt, Gordon Kindlmann, and Michael Correll. 2020. Surfacing Visualization Mirages. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376420",
      "doi": "10.1145/3313831.3376420"
    },
    {
      "text": "Carlos Monteiro and Janet Ainley. 2007. Investigating the interpretation of media graphs among student teachers. International Electronic Journal of Mathematics Education 2, 3(2007), 187–207.",
      "doi": ""
    },
    {
      "text": "Anshul Vikram Pandey, Katharina Rall, Margaret L. Satterthwaite, Oded Nov, and Enrico Bertini. 2015. How Deceptive Are Deceptive Visualizations? An Empirical Analysis of Common Distortion Techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1469–1478. https://doi.org/10.1145/2702123.2702608",
      "doi": "10.1145/2702123.2702608"
    },
    {
      "text": "Denise F. Polit, Cheryl Tatano Beck, and Steven V. Owen. 2007. Is the CVI an acceptable indicator of content validity? Appraisal and recommendations. Research in Nursing & Health 30, 4 (2007), 459–467. https://doi.org/10.1002/nur.20199 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/nur.20199",
      "doi": ""
    },
    {
      "text": "Washington Post. 2022. Washington Post | FlowingData. https://flowingdata.com/tag/washington-post/",
      "doi": ""
    },
    {
      "text": "William Revelle and David M. Condon. 2019. Reliability from α to ω: A tutorial.Psychological Assessment 31, 12 (2019), 1395–1411. https://doi.org/10.1037/pas0000754 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "The New York Times. 2022. Graphics - The New York Times. https://www.nytimes.com/spotlight/graphics",
      "doi": ""
    },
    {
      "text": "Eliane R. A. Valiati, Marcelo S. Pimenta, and Carla M. D. S. Freitas. 2006. A Taxonomy of Tasks for Guiding the Evaluation of Multidimensional Visualizations. In Proceedings of the 2006 AVI Workshop on BEyond Time and Errors: Novel Evaluation Methods for Information Visualization (Venice, Italy) (BELIV ’06). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/1168149.1168169",
      "doi": "10.1145/1168149.1168169"
    },
    {
      "text": "VisLies. 2017. Vis Lies 2017 Gallery. Retrieved September 01, 2022 from https://www.vislies.org/2017/gallery/",
      "doi": ""
    },
    {
      "text": "VisLies. 2020. VisLies 2020. Retrieved August 26, 2022 from http://www.vislies.org/2020/",
      "doi": ""
    },
    {
      "text": "VisLies. 2021. VisLies 2021. Retrieved August 26, 2022 from https://www.vislies.org/2021/",
      "doi": ""
    },
    {
      "text": "Jane Watson and Rosemary Callingham. 2002. Statistical literacy: A complex hierarchical construct. Statistics Education Research Journal 2 (11 2002). https://doi.org/10.52041/serj.v2i2.553",
      "doi": ""
    }
  ]
}