{
  "doi": "10.1145/3544548.3580879",
  "title": "Collaborating Across Realities: Analytical Lenses for Understanding Dyadic Collaboration in Transitional Interfaces",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Transitional Interfaces are a yet underexplored, emerging class of cross-reality user interfaces that enable users to freely move along the reality-virtuality continuum during collaboration. To analyze and understand how such collaboration unfolds, we propose four analytical lenses derived from an exploratory study of transitional collaboration with 15 dyads. While solving a complex spatial optimization task, participants could freely switch between three contexts, each with different displays (desktop screens, tablet-based augmented reality, head-mounted virtual reality), input techniques (mouse, touch, handheld controllers), and visual representations (monoscopic and allocentric 2D/3D maps, stereoscopic egocentric views). Using the rich qualitative and quantitative data from our study, we evaluated participants’ perceptions of transitional collaboration and identified commonalities and differences between dyads. We then derived four lenses including metrics and visualizations to analyze key aspects of transitional collaboration: (1) place and distance, (2) temporal patterns, (3) group use of contexts, (4) individual use of contexts.",
  "authors": [
    {
      "name": "Jan-Henrik Schröder",
      "institution": "Institute for Multimedia and Interactive Systems, University of Lübeck, Germany",
      "img": "/do/10.1145/contrib-99659911308/rel-imgonly/compressed.jpg",
      "acmid": "99659911308",
      "orcid": "0000-0001-8771-3465"
    },
    {
      "name": "Daniel Schacht",
      "institution": "Institute for Multimedia and Interactive Systems, University of Lübeck, Germany",
      "img": "/do/10.1145/contrib-99660778102/rel-imgonly/daniel_portrait_sw.jpg",
      "acmid": "99660778102",
      "orcid": "0000-0002-1433-3127"
    },
    {
      "name": "Niklas Peper",
      "institution": "Institute for Multimedia and Interactive Systems, University of Lübeck, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778645",
      "orcid": "0000-0002-8956-9361"
    },
    {
      "name": "Anita Marie Hamurculu",
      "institution": "Institute for Multimedia and Interactive Systems, University of Lübeck, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778773",
      "orcid": "0000-0003-2112-0901"
    },
    {
      "name": "Hans-Christian Jetter",
      "institution": "Institute for Multimedia and Interactive Systems, University of Lübeck, Germany",
      "img": "/do/10.1145/contrib-81361609796/rel-imgonly/029_hanschristianjetterdr_6307_small.jpg",
      "acmid": "81361609796",
      "orcid": "0000-0001-6502-7114"
    }
  ],
  "references": [
    {
      "text": "Huidong Bai, Prasanth Sasikumar, Jing Yang, and Mark Billinghurst. 2020. A User Study on Mixed Reality Remote Collaboration with Eye Gaze and Hand Gesture Sharing. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376550",
      "doi": "10.1145/3313831.3376550"
    },
    {
      "text": "Mark Billinghurst, Hirokazu Kato, and Ivan Poupyrev. 2001. The magic book: A transitional AR interface. Computers & Graphics 25, 5 (2001), 745–753. https://doi.org/10.1016/S0097-8493(01)00117-0",
      "doi": ""
    },
    {
      "text": "Frederik Brudy, Joshua Kevin Budiman, Steven Houben, and Nicolai Marquardt. 2018. Investigating the Role of an Overview Device in Multi-Device Collaboration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173874",
      "doi": "10.1145/3173574.3173874"
    },
    {
      "text": "Felipe G. Carvalho, Daniela G. Trevisan, and Alberto Raposo. 2012. Toward the design of transitional interfaces: an exploratory study on a semi-immersive hybrid user interface. Virtual Reality 16, 4 (Nov. 2012), 271–288. https://doi.org/10.1007/s10055-011-0205-y",
      "doi": "10.1007/s10055-011-0205-y"
    },
    {
      "text": "Barrett Ens, Joel Lanir, Anthony Tang, Scott Bateman, Gun Lee, Thammathip Piumsomboon, and Mark Billinghurst. 2019. Revisiting collaboration through mixed reality: The evolution of groupware. International Journal of Human-Computer Studies 131 (Nov. 2019), 81–98. https://doi.org/10.1016/j.ijhcs.2019.05.011",
      "doi": "10.1016/j.ijhcs.2019.05.011"
    },
    {
      "text": "Thomas Franke, Christiane Attig, and Daniel Wessel. 2019. A Personal Resource for Technology Interaction: Development and Validation of the Affinity for Technology Interaction (ATI) Scale. International Journal of Human–Computer Interaction 35, 6 (April 2019), 456–467. https://doi.org/10.1080/10447318.2018.1456150",
      "doi": ""
    },
    {
      "text": "Bernhard Fröhler, C. Anthes, Christoph, Fabian Pointecker, Judith Friedl, D. Schwajda, A. Riegler, Andreas, Shailesh Tripathi, Clemens Holzmann, Manuel Brunner, Herbert Jodlbauer, Hans-Christian Jetter, and Christoph Heinzl. 2022. A Survey on Cross‐Virtuality Analytics. Computer Graphics Forum(2022), 465–494. https://doi.org/10.1111/cgf.14447",
      "doi": ""
    },
    {
      "text": "Alexander Gall, Bernhard Fröhler, Julia Maurer, Johann Kastner, and Christoph Heinzl. 2022. Cross-virtuality analysis of rich X-ray computed tomography data for materials science applications. Nondestructive Testing and Evaluation (May 2022), 1–16. https://doi.org/10.1080/10589759.2022.2075864",
      "doi": ""
    },
    {
      "text": "Jeronimo Gustavo Grandi, Henrique Galvan Debarba, and Anderson Maciel. 2019. Characterizing Asymmetric Collaborative Interactions in Virtual and Augmented Realities. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Osaka, Japan, 127–135. https://doi.org/10.1109/VR.2019.8798080",
      "doi": ""
    },
    {
      "text": "Raphael Grasset, Andreas Dunser, and Mark Billinghurst. 2008. Moving Between Contexts - A User Evaluation of a Transitional Interface. In 18th International Conference on Artificial Reality and Telexistence (ICAT 2008). Yokohama Japan, 137–143.",
      "doi": ""
    },
    {
      "text": "Raphael Grasset, Philip Lamb, and Mark Billinghurst. 2005. Evaluation of Mixed-Space Collaboration. In Proceedings of the 4th IEEE/ACM International Symposium on Mixed and Augmented Reality(ISMAR ’05). IEEE Computer Society, USA, 90–99. https://doi.org/10.1109/ISMAR.2005.30",
      "doi": "10.1109/ISMAR.2005.30"
    },
    {
      "text": "Raphael Grasset, Julian Looser, and Mark Billinghurst. 2006. Transitional interface: concept, issues and framework. In Proceedings of the 5th IEEE/ACM International Symposium on Mixed and Augmented Reality(ISMAR ’06). IEEE Computer Society, USA, 231–232. https://doi.org/10.1109/ismar.2006.297819",
      "doi": "10.1109/ismar.2006.297819"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 4021–4033. https://doi.org/10.1145/3025453.3025683",
      "doi": "10.1145/3025453.3025683"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Computer Supported Cooperative Work (CSCW) 11, 3-4 (Sept. 2002), 411–446. https://doi.org/10.1023/A:1021271517844",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in Psychology. Vol. 52. Elsevier, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Petra Isenberg, Danyel Fisher, Sharoda A. Paul, Meredith R. Morris, Kori Inkpen, and Mary Czerwinski. 2012. Co-Located Collaborative Visual Analytics around a Tabletop Display. IEEE Transactions on Visualization and Computer Graphics 18, 5 (May 2012), 689–702. https://doi.org/10.1109/TVCG.2011.287",
      "doi": "10.1109/TVCG.2011.287"
    },
    {
      "text": "Hans-Christian Jetter, Jan-Henrik Schröder, Jan Gugenheimer, Mark Billinghurst, Christoph Anthes, Mohamed Khamis, and Tiare Feuchtner. 2021. Transitional Interfaces in Mixed and Cross-Reality: A new frontier?. In Interactive Surfaces and Spaces(ISS ’21). Association for Computing Machinery, New York, NY, USA, 46–49. https://doi.org/10.1145/3447932.3487940",
      "doi": "10.1145/3447932.3487940"
    },
    {
      "text": "Robert Johansen. 1988. Groupware: computer support for business teams. Free Press ; Collier Macmillan, New York : London.",
      "doi": "10.5555/542298"
    },
    {
      "text": "S. Kullback and R. A. Leibler. 1951. On Information and Sufficiency. The Annals of Mathematical Statistics 22, 1 (March 1951), 79–86. https://doi.org/10.1214/aoms/1177729694",
      "doi": ""
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How WEIRD is CHI?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–14. https://doi.org/10.1145/3411764.3445488",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-device interaction via micro-mobility and f-formations. In Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST ’12. ACM Press, Cambridge, Massachusetts, USA, 13–22. https://doi.org/10.1145/2380116.2380121",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Frank Maurer, Craig Anslow, Joaquim Jorge, and Mauricio Sousa. 2022. Enhancing cross-reality applications and user experiences. In Proceedings of the 2022 International Conference on Advanced Visual Interfaces(AVI 2022). Association for Computing Machinery, New York, NY, USA, 1–3. https://doi.org/10.1145/3531073.3535256",
      "doi": "10.1145/3531073.3535256"
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A taxonomy of mixed reality visual displays. IEICE TRANSACTIONS on Information and Systems 77, 12 (1994), 1321–1329. Publisher: The Institute of Electronics, Information and Communication Engineers.",
      "doi": ""
    },
    {
      "text": "Thomas Neumayr, Hans-Christian Jetter, Mirjam Augstein, Judith Friedl, and Thomas Luger. 2018. Domino: A Descriptive Framework for Hybrid Collaboration and Coupling Styles in Partially Distributed Teams. Proc. ACM Hum.-Comput. Interact. 2, CSCW (Nov. 2018). https://doi.org/10.1145/3274397",
      "doi": "10.1145/3274397"
    },
    {
      "text": "Thammathip Piumsomboon, Youngho Lee, Gun Lee, and Mark Billinghurst. 2017. CoVAR: A Collaborative Virtual and Augmented Reality System for Remote Collaboration. In SIGGRAPH Asia 2017 Emerging Technologies(SA ’17). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3132818.3132822",
      "doi": "10.1145/3132818.3132822"
    },
    {
      "text": "Thomas Plank, Hans-Christian Jetter, Roman Rädle, Clemens N. Klokmose, Thomas Luger, and Harald Reiterer. 2017. Is Two Enough?!: Studying Benefits, Barriers, and Biases of Multi-Tablet Use for Collaborative Visualization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17. ACM Press, Denver, Colorado, USA, 4548–4560. https://doi.org/10.1145/3025453.3025537",
      "doi": "10.1145/3025453.3025537"
    },
    {
      "text": "Fabian Pointecker, Judith Friedl, Daniel Schwajda, Hans-Christian Jetter, and Christoph Anthes. 2022. Bridging the Gap Across Realities: Visual Transitions Between Virtual and Augmented Reality. In 2022 IEEE Interational Symposium on Mixed and Augmented Reality (ISMAR). Singapore. (to appear).",
      "doi": ""
    },
    {
      "text": "Fabian Pointecker, Hans-Christian Jetter, and Christoph Anthes. 2020. Exploration of Visual Transitions Between Virtual and Augmented Reality. In 4th Workshop on Immersive Analytics: Envisioning Future Productivity for Immersive Analytics // @CHI 2020 Honolulu. https://drive.google.com/file/d/1V1lXIk-DPjcfuJg2LgaS_UfYXQq-7e2k/view",
      "doi": ""
    },
    {
      "text": "Patrick Reipschläger and Raimund Dachselt. 2019. DesignAR: Immersive 3D-Modeling Combining Augmented Reality with Interactive Displays. In Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces(ISS ’19). ACM, New York, NY, USA, 29–42. https://doi.org/10.1145/3343055.3359718",
      "doi": "10.1145/3343055.3359718"
    },
    {
      "text": "Patrick Reipschläger, Severin Engert, and Raimund Dachselt. 2020. Augmented Displays: Seamlessly Extending Interactive Surfaces with Head-Mounted Augmented Reality. In Proceedings of the 2020 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, New York. https://doi.org/10.1145/3334480.3383138",
      "doi": "10.1145/3334480.3383138"
    },
    {
      "text": "Patrick Reipschläger, Tamara Flemisch, and Raimund Dachselt. 2021. Personal Augmented Reality for Information Visualization on Large Interactive Displays. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb. 2021), 1182–1192. https://doi.org/10.1109/TVCG.2020.3030460",
      "doi": ""
    },
    {
      "text": "Andreas Riegler, Christoph Anthes, Hans-Christian Jetter, Christoph Heinzl, Clemens Holzmann, Jodlbauer Herbert, Manuel Brunner, Stefan Auer, Judith Friedl, and Bernhard Fröhler. 2020. Cross-Virtuality Visualization, Interaction and Collaboration. In International Workshop on Cross-Reality (XR) Interaction co-located with 14th ACM International Conference on Interactive Surfaces and Spaces. http://ceur-ws.org/Vol-2779/paper1.pdf",
      "doi": ""
    },
    {
      "text": "Joan Sol Roo and Martin Hachet. 2017. One Reality: Augmenting How the Physical World is Experienced by combining Multiple Mixed Reality Modalities. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, Québec City QC Canada, 787–795. https://doi.org/10.1145/3126594.3126638",
      "doi": "10.1145/3126594.3126638"
    },
    {
      "text": "Stacey D. Scott, Carpendale Sheelagh, and Kori M. Inkpen. 2004. Territoriality in collaborative tabletop workspaces. In Proceedings of the 2004 ACM conference on Computer supported cooperative work - CSCW ’04. ACM Press, Chicago, Illinois, USA, 294. https://doi.org/10.1145/1031607.1031655",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "James Sellers, William S. Helton, Katharina Näswall, Gregory J. Funke, and Benjamin A. Knott. 2014. Development of the Team Workload Questionnaire (TWLQ). Proceedings of the Human Factors and Ergonomics Society Annual Meeting 58, 1 (Sept. 2014), 989–993. https://doi.org/10.1177/1541931214581207",
      "doi": ""
    },
    {
      "text": "Adalberto L. Simeone, Mohamed Khamis, Augusto Esteves, Florian Daiber, Matjaž Kljun, Klen Čopič Pucihar, Poika Isokoski, and Jan Gugenheimer. 2020. International Workshop on Cross-Reality (XR) Interaction. In Companion Proceedings of the 2020 Conference on Interactive Surfaces and Spaces(ISS ’20). Association for Computing Machinery, New York, NY, USA, 111–114. https://doi.org/10.1145/3380867.3424551",
      "doi": "10.1145/3380867.3424551"
    },
    {
      "text": "Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative Coupling over Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’06). Association for Computing Machinery, New York, NY, USA, 1181–1190. https://doi.org/10.1145/1124772.1124950",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "Philip Tuddenham and Peter Robinson. 2009. Territorial Coordination and Workspace Awareness in Remote Tabletop Collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’09). Association for Computing Machinery, New York, NY, USA, 2139–2148. https://doi.org/10.1145/1518701.1519026",
      "doi": "10.1145/1518701.1519026"
    },
    {
      "text": "Edward R. Tufte. 2001. The visual display of quantitative information (2nd ed.). Graphics Press, Cheshire, Conn.",
      "doi": ""
    }
  ]
}