{
  "doi": "10.1145/3544548.3580913",
  "title": "From Artifacts to Outcomes: Comparison of HMD VR, Desktop, and Slides Lectures for Food Microbiology Laboratory Instruction",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Despite the value of VR (Virtual Reality) for educational purposes, the instructional power of VR in Biology Laboratory education remains under-explored. Laboratory lectures can be challenging due to students’ low motivation to learn abstract scientific concepts and low retention rate. Therefore, we designed a VR-based lecture on fermentation and compared its effectiveness with lectures using PowerPoint slides and a desktop application. Grounded in the theory of distributed cognition and motivational theories, our study examined how learning happens in each condition from students’ learning outcomes, behaviors, and perceptions. Our result indicates that VR facilitates students’ long-term retention to learn by cultivating their longer visual attention and fostering a higher sense of immersion, though students’ short-term retention remains the same across all conditions. This study extends current research on VR studies by identifying the characteristics of each teaching artifact and providing design implications for integrating VR technology into higher education.",
  "tags": [
    "Immersive Visualization Design",
    "Laboratory Instruction",
    "Educational Technology",
    "Learning Theories",
    "Virtual Reality"
  ],
  "authors": [
    {
      "name": "Fei Xue",
      "institution": "University of California, Davis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659904692",
      "orcid": "0000-0002-2185-9450"
    },
    {
      "name": "Rongchen Guo",
      "institution": "The University of Texas at Austin, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778472",
      "orcid": "0000-0002-1870-6541"
    },
    {
      "name": "Siyuan Yao",
      "institution": "Computer Science and Engineering, University of Notre Dame, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778300",
      "orcid": "0000-0002-4093-193X"
    },
    {
      "name": "Luxin Wang",
      "institution": "Department of Food Science and Technology, University of California, Davis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783927",
      "orcid": "0000-0003-4959-6477"
    },
    {
      "name": "Kwan-Liu Ma",
      "institution": "Department of Computer Science, University of California, Davis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452595774",
      "orcid": "0000-0001-8086-0366"
    }
  ],
  "references": [
    {
      "text": "Eytan Adar and Elsie Lee. 2020. Communicative visualizations as a learning problem. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 946–956. https://doi.org/10.1109/TVCG.2020.3030375",
      "doi": ""
    },
    {
      "text": "Morana Alač and Edwin Hutchins. 2004. I see what you are saying: Action as cognition in fMRI brain mapping practice. Journal of cognition and culture 4, 3-4 (2004), 629–661.",
      "doi": ""
    },
    {
      "text": "Ashlyn E Anderson, Louis B Justement, and Heather A Bruns. 2020. Using real-world examples of the COVID-19 pandemic to increase student confidence in their scientific literacy skills. Biochemistry and Molecular Biology Education 48, 6 (2020), 678–684. https://doi.org/10.1002/bmb.21474",
      "doi": ""
    },
    {
      "text": "Sasha A Barab and Jonathan A Plucker. 2002. Smart people or smart contexts? Cognition, ability, and talent development in an age of situated approaches to knowing and learning. Educational psychologist 37, 3 (2002), 165–182. https://doi.org/10.1207/S15326985EP3703_3",
      "doi": ""
    },
    {
      "text": "Michael J Belotto. 2018. Data analysis methods for qualitative research: Managing the challenges of coding, interrater reliability, and thematic analysis. The Qualitative Report 23, 11 (2018), 2622–2633.",
      "doi": ""
    },
    {
      "text": "Andrew Brian Filmer and Ann Rosnida Md Deni. 2020. Powering Up Interactivity in the Use of PowerPoint within an Educational Context. In 2020 The 4th International Conference on Education and Multimedia Technology. 107–111. https://doi.org/10.1145/3416797.3416845",
      "doi": "10.1145/3416797.3416845"
    },
    {
      "text": "Graham Button. 1997. Cognition in the Wild, Edwin Hutchins. Dordrecht 6, 4 (Dec. 1997), 391–395.",
      "doi": ""
    },
    {
      "text": "Fabio Buttussi and Luca Chittaro. 2017. Effects of different types of virtual reality display on presence and learning in a safety training scenario. IEEE transactions on visualization and computer graphics 24, 2(2017), 1063–1076. https://doi.org/10.1109/TVCG.2017.2653117",
      "doi": ""
    },
    {
      "text": "Jason A Chen, M Shane Tutwiler, Shari J Metcalf, Amy Kamarainen, Tina Grotzer, and Chris Dede. 2016. A multi-user virtual environment to support students’ self-efficacy and interest in science: A latent growth model analysis. Learning and Instruction 41 (2016), 11–22. https://doi.org/10.1016/j.learninstruc.2015.09.007",
      "doi": ""
    },
    {
      "text": "Alan Cheng, Lei Yang, and Erik Andersen. 2017. Teaching language and culture with a virtual reality game. In Proceedings of the 2017 CHI conference on human factors in computing systems. 541–549. https://doi.org/10.1145/3025453.3025857",
      "doi": "10.1145/3025453.3025857"
    },
    {
      "text": "Xiangtong Chu, Xiao Xie, Shuainan Ye, Haolin Lu, Hongguang Xiao, Zeqing Yuan, Zhutian Chen, Hui Zhang, and Yingcai Wu. 2021. TIVEE: Visual exploration and explanation of badminton tactics in immersive visualizations. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 118–128. https://doi.org/10.1109/TVCG.2021.3114861",
      "doi": "10.1109/TVCG.2021.3114861"
    },
    {
      "text": "Jennifer Clark. 2008. PowerPoint and pedagogy: Maintaining student interest in university lectures. College teaching 56, 1 (2008), 39–44.",
      "doi": ""
    },
    {
      "text": "Amanda M Cottone and Susan Yoon. 2020. Improving the design of undergraduate biology courses toward the goal of retention: the case of real-world inquiry and active learning through metagenomics. Journal of microbiology & biology education 21, 1 (2020), 20. https://doi.org/10.1128/jmbe.v21i1.1965",
      "doi": ""
    },
    {
      "text": "Giovanni De Michell and Rajesh K Gupta. 1997. Hardware/software co-design. Proc. IEEE 85, 3 (1997), 349–365.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 2008. Self-determination theory: A macrotheory of human motivation, development, and health. Canadian Psychology/Psychologie canadienne 49, 3 (Aug. 2008), 182–185. https://doi.org/10.1037/a0012801",
      "doi": ""
    },
    {
      "text": "Chris Dede. 2009. Immersive interfaces for engagement and learning. science 323, 5910 (2009), 66–69. https://doi.org/10.1126/science.1167311",
      "doi": ""
    },
    {
      "text": "Edoardo Degli Innocenti, Michele Geronazzo, Diego Vescovi, Rolf Nordahl, Stefania Serafin, Luca Andrea Ludovico, and Federico Avanzini. 2019. Mobile virtual reality for musical genre learning in primary education. Computers & Education 139 (2019), 102–117.",
      "doi": "10.1016/j.compedu.2019.04.010"
    },
    {
      "text": "Anna Flavia Di Natale, Claudia Repetto, Giuseppe Riva, and Daniela Villani. 2020. Immersive virtual reality in K-12 and higher education: A 10-year systematic review of empirical research. British Journal of Educational Technology 51, 6 (2020), 2006–2033. https://doi.org/10.1111/bjet.13030",
      "doi": ""
    },
    {
      "text": "Cathi L Dunnagan, Devran A Dannenberg, Michael P Cuales, Arthur D Earnest, Richard M Gurnsey, and Maria T Gallardo-Williams. 2019. Production and evaluation of a realistic immersive virtual reality organic chemistry laboratory experience: infrared spectroscopy. https://doi.org/10.1021/acs.jchemed.9b00705",
      "doi": ""
    },
    {
      "text": "Jacquelynne S Eccles, Allan Wigfield, 2002. Motivational beliefs, values, and goals. Annual review of psychology 53, 1 (2002), 109–132.",
      "doi": ""
    },
    {
      "text": "Mohamed El Beheiry, Sébastien Doutreligne, Clément Caporal, Cécilia Ostertag, Maxime Dahan, and Jean-Baptiste Masson. 2019. Virtual reality: beyond visualization. Journal of molecular biology 431, 7 (2019), 1315–1321.",
      "doi": ""
    },
    {
      "text": "Marc Exposito, Vicky Zeamer, and Pattie Maes. 2017. Unobtrusive Note Taking: Enriching Digital Interpersonal Interactions Using Gestures. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 167–170. https://doi.org/10.1145/3022198.3026319",
      "doi": "10.1145/3022198.3026319"
    },
    {
      "text": "Michel Fayol. 1994. From declarative and procedural knowledge to the management of declarative and procedural knowledge. European journal of psychology of education 9, 3 (1994), 179–190.",
      "doi": ""
    },
    {
      "text": "Yan Feng. 2021. Do different types of VR influence pedestrian route choice behaviour? A comparison study of Desktop VR and HMD VR. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–7. https://doi.org/10.1145/3411763.3451516",
      "doi": "10.1145/3411763.3451516"
    },
    {
      "text": "Anna V Fisher, Karrie E Godwin, and Howard Seltman. 2014. Visual environment, attention allocation, and learning in young children: When too much of a good thing may be bad. Psychological science 25, 7 (2014), 1362–1370. https://doi.org/10.1177/09567976145338",
      "doi": ""
    },
    {
      "text": "Xinyi Fu, Yaxin Zhu, Zhijing Xiao, Yingqing Xu, and Xiaojuan Ma. 2020. RestoreVR: generating embodied knowledge and situated experience of dunhuang mural conservation via interactive virtual reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13. https://doi.org/10.1145/3313831.3376673",
      "doi": "10.1145/3313831.3376673"
    },
    {
      "text": "Hong Gao, Efe Bozkir, Lisa Hasenbein, Jens-Uwe Hahn, Richard Göllner, and Enkelejda Kasneci. 2021. Digital transformations of classrooms in virtual reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–10. https://doi.org/10.1145/3411764.3445596",
      "doi": "10.1145/3411764.3445596"
    },
    {
      "text": "Sarah Garcia, Ronald Kauer, Denis Laesker, Jason Nguyen, and Marvin Andujar. 2019. A virtual reality experience for learning languages. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–4. https://doi.org/10.1145/3290607.3313253",
      "doi": "10.1145/3290607.3313253"
    },
    {
      "text": "J Georgiou, K Dimitropoulos, and A Manitsaris. 2007. A virtual reality laboratory for distance education in chemistry. International Journal of Social Sciences 2, 1 (2007), 34–41.",
      "doi": ""
    },
    {
      "text": "Katy Ilonka Gero, Lydia Chilton, Chris Melancon, and Mike Cleron. 2022. Eliciting Gestures for Novel Note-taking Interactions. In Designing Interactive Systems Conference. 966–975. https://doi.org/10.1145/3532106.3533480",
      "doi": "10.1145/3532106.3533480"
    },
    {
      "text": "Jan Géryk. 2015. Using Visual Analytics Tool for Improving Data Comprehension.International Educational Data Mining Society (2015).",
      "doi": ""
    },
    {
      "text": "Gilakjani. 2012. Visual, auditory, kinaesthetic learning styles and their impacts on English language teaching. J. Stud. Educ. (2012).",
      "doi": ""
    },
    {
      "text": "Yu Han, Yu Miao, Jie Lu, Mei Guo, and Yi Xiao. 2022. Exploring Intervention Strategies for Distracted Students in VR Classrooms. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–7. https://doi.org/10.1145/3491101.3519627",
      "doi": "10.1145/3491101.3519627"
    },
    {
      "text": "Jordan Harold, Irene Lorenzoni, Thomas F Shipley, and Kenny R Coventry. 2016. Cognitive and psychological science insights to improve climate change data visualization. Nature Climate Change 6, 12 (2016), 1080–1089.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Christopher Healey and James Enns. 2011. Attention and visual memory in visualization and computer graphics. IEEE transactions on visualization and computer graphics 18, 7(2011), 1170–1188. https://doi.org/10.1109/TVCG.2011.127",
      "doi": "10.1109/TVCG.2011.127"
    },
    {
      "text": "Paula Hodgson, Vivian WY Lee, Johnson Chan, Agnes Fong, Cindi SY Tang, Leo Chan, and Cathy Wong. 2019. Immersive virtual reality (IVR) in higher education: Development and implementation. In Augmented reality and virtual reality. Springer, 161–173. https://doi.org/10.1007/978-3-030-06246-0_12",
      "doi": ""
    },
    {
      "text": "James Hollan, Edwin Hutchins, and David Kirsh. 2000. Distributed cognition: toward a new foundation for human-computer interaction research. ACM Transactions on Computer-Human Interaction (TOCHI) 7, 2(2000), 174–196. https://doi.org/10.1145/353485.353487",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Jan Hombeck, Monique Meuschke, Lennert Zyla, André-Joel Heuser, Justus Toader, Felix Popp, Christiane J Bruns, Christian Hansen, Rabi R Datta, and Kai Lawonn. 2022. Evaluating Perceptional Tasks for Medicine: A Comparative User Study Between a Virtual Reality and a Desktop Application. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 514–523. https://doi.org/DOI: 10.1109/VR51125.2022.00071",
      "doi": ""
    },
    {
      "text": "Tien-Chi Huang, Chia-Chen Chen, and Yu-Wen Chou. 2016. Animating eco-education: To see, feel, and discover in an augmented reality-based experiential learning environment. Computers & Education 96 (2016), 72–82. https://doi.org/10.1016/j.compedu.2016.02.008",
      "doi": "10.1016/j.compedu.2016.02.008"
    },
    {
      "text": "Yu-Chih Huang, Sheila J Backman, Kenneth F Backman, Francis A McGuire, and DeWayne Moore. 2019. An investigation of motivation and experience in virtual learning environments: A self-determination theory. Education and Information Technologies 24, 1 (2019), 591–611.",
      "doi": "10.1007/s10639-018-9784-5"
    },
    {
      "text": "Edwin Hutchins. 1991. The social organization of distributed cognition.American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Radhwan Hussein Ibrahim and Dhia-Alrahman Hussein. 2016. Assessment of visual, auditory, and kinesthetic learning style among undergraduate nursing students. Int J Adv Nurs Stud 5, 1 (2016), 1–4.",
      "doi": ""
    },
    {
      "text": "Crescent Jicol, Chun Hin Wan, Benjamin Doling, Caitlin H Illingworth, Jinha Yoon, Charlotte Headey, Christof Lutteroth, Michael J Proulx, Karin Petrini, and Eamonn O’Neill. 2021. Effects of emotion and agency on presence in virtual reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13. https://doi.org/10.1145/3411764.3445588",
      "doi": "10.1145/3411764.3445588"
    },
    {
      "text": "Qiao Jin, Yu Liu, Svetlana Yarosh, Bo Han, and Feng Qian. 2022. How Will VR Enter University Classrooms? Multi-stakeholders Investigation of VR in Higher Education. In CHI Conference on Human Factors in Computing Systems. 1–17. https://doi.org/10.1145/3491102.3517542",
      "doi": "10.1145/3491102.3517542"
    },
    {
      "text": "Elizabeth Johnston, Gerald Olivas, Patricia Steele, Cassandra Smith, and Liston Bailey. 2018. Exploring pedagogical foundations of existing virtual reality educational applications: A content analysis study. Journal of Educational Technology Systems 46, 4 (2018), 414–439. https://doi.org/10.1177/0047239517745560",
      "doi": ""
    },
    {
      "text": "John M Keller. 1987. IMMS: Instructional materials motivation survey. Florida State University(1987).",
      "doi": ""
    },
    {
      "text": "Mina Khan, Fernando Trujano, and Pattie Maes. 2018. Mathland: Constructionist mathematical learning in the real world using immersive mixed reality. In International Conference on Immersive Learning. Springer, 133–147. https://doi.org/10.1007/978-3-319-93596-6_9",
      "doi": ""
    },
    {
      "text": "Seunghyun Kim, Ryoun Heo, Yeonji Chung, Jung Min Kim, Michelle P Kwon, Sung Chul Seo, Gil-Hong Park, and Meyoung-Kon Kim. 2019. Virtual reality visualization model (VRVM) of the tricarboxylic acid (TCA) cycle of carbohydrate metabolism for medical biochemistry education. Journal of Science Education and Technology 28, 6 (2019), 602–612. https://doi.org/10.1007/s10956-019-09790-y",
      "doi": ""
    },
    {
      "text": "Pascal Knierim, Valentin Schwind, Anna Maria Feit, Florian Nieuwenhuizen, and Niels Henze. 2018. Physical keyboards in virtual reality: Analysis of typing performance and effects of avatar hands. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–9. https://doi.org/10.1145/3173574.3173919",
      "doi": "10.1145/3173574.3173919"
    },
    {
      "text": "Jordan Koulouris, Zoe Jeffery, James Best, Eamonn O’neill, and Christof Lutteroth. 2020. Me vs. Super (wo) man: Effects of Customization and Identification in a VR Exergame. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–17. https://doi.org/10.1145/3313831.3376661",
      "doi": "10.1145/3313831.3376661"
    },
    {
      "text": "Udo Kuckartz and Stefan Rädiker. 2019. Analyzing Qualitative Data with MAXQDA: Text, Audio, and Video. Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Oh-Hyun Kwon, Chris Muelder, Kyungwon Lee, and Kwan-Liu Ma. 2016. A study of layout, rendering, and interaction methods for immersive graph visualization. IEEE transactions on visualization and computer graphics 22, 7(2016), 1802–1815. https://doi.org/10.1109/TVCG.2016.2520921",
      "doi": "10.1109/TVCG.2016.2520921"
    },
    {
      "text": "Joseph J LaViola Jr, Ernst Kruijff, Ryan P McMahan, Doug Bowman, and Ivan P Poupyrev. 2017. 3D user interfaces: theory and practice. Addison-Wesley Professional.",
      "doi": ""
    },
    {
      "text": "Elinda Ai-Lim Lee, Kok Wai Wong, and Chun Che Fung. 2010. How does desktop virtual reality enhance learning outcomes? A structural equation modeling approach. Computers & Education 55, 4 (2010), 1424–1442. https://doi.org/10.1016/j.compedu.2010.06.006",
      "doi": "10.1016/j.compedu.2010.06.006"
    },
    {
      "text": "Jeonghaeng Lee, Woojae Kim, Jinwoo Kim, and Sanghoon Lee. 2021. A Study on Virtual Reality Sickness and Visual Attention. In 2021 Asia-Pacific Signal and Information Processing Association Annual Summit and Conference (APSIPA ASC). IEEE, 1465–1469.",
      "doi": ""
    },
    {
      "text": "Ruixue Liu, Lei Wang, Jing Lei, Qiu Wang, and Youqun Ren. 2020. Effects of an immersive virtual reality-based classroom on students’ learning performance in science lessons. British Journal of Educational Technology 51, 6 (2020), 2034–2049. https://doi.org/10.1111/bjet.13028",
      "doi": ""
    },
    {
      "text": "Zhicheng Liu, Nancy Nersessian, and John Stasko. 2008. Distributed cognition as a theoretical framework for information visualization. IEEE transactions on visualization and computer graphics 14, 6(2008), 1173–1180. https://doi.org/10.1109/TVCG.2008.121",
      "doi": "10.1109/TVCG.2008.121"
    },
    {
      "text": "Andreas Löcken, Carmen Golling, and Andreas Riener. 2019. How should automated vehicles interact with pedestrians? A comparative analysis of interaction concepts in virtual reality. In Proceedings of the 11th international conference on automotive user interfaces and interactive vehicular applications. 262–274. https://doi.org/10.1145/3342197.3344544",
      "doi": "10.1145/3342197.3344544"
    },
    {
      "text": "Michelle Lui, Rhonda McEwen, and Martha Mullally. 2020. Immersive virtual reality for supporting complex scientific knowledge: Augmenting our understanding with physiological monitoring. British Journal of Educational Technology 51, 6 (2020), 2181–2199. https://doi.org/10.1111/bjet.13022",
      "doi": ""
    },
    {
      "text": "Kwan-Liu Ma, I Liao, J Frazier, H Hauser, and H-N Kostis. 2012. Scientific Storytelling Using Visualization. IEEE Computer Graphics and Applications 32, 1 (2012), 12–19.",
      "doi": "10.1109/MCG.2012.24"
    },
    {
      "text": "Ulrike IE Magner, Rolf Schwonke, Vincent Aleven, Octav Popescu, and Alexander Renkl. 2014. Triggering situational interest by decorative illustrations both fosters and hinders learning in computer-based learning environments. Learning and instruction 29 (2014), 141–152. https://doi.org/10.1016/j.learninstruc.2012.07.002",
      "doi": ""
    },
    {
      "text": "Guido Makransky and Gustav Bøg Petersen. 2019. Investigating the process of learning with desktop virtual reality: A structural equation modeling approach. Computers & Education 134 (2019), 15–30. https://doi.org/10.1016/j.compedu.2019.02.002",
      "doi": "10.1016/j.compedu.2019.02.002"
    },
    {
      "text": "Guido Makransky and Gustav B Petersen. 2021. The cognitive affective model of immersive learning (CAMIL): A theoretical research-based model of learning in immersive virtual reality. Educational Psychology Review 33, 3 (2021), 937–958. https://doi.org/10.1007/s10648-020-09586-2",
      "doi": ""
    },
    {
      "text": "Katerina Mania, Dave Wooldridge, Matthew Coxon, and Andrew Robinson. 2006. The effect of visual and interaction fidelity on spatial cognition in immersive virtual environments. IEEE transactions on visualization and computer graphics 12, 3(2006), 396–404. https://doi.org/10.1109/TVCG.2006.55",
      "doi": "10.1109/TVCG.2006.55"
    },
    {
      "text": "David M Markowitz, Rob Laha, Brian P Perone, Roy D Pea, and Jeremy N Bailenson. 2018. Immersive virtual reality field trips facilitate learning about climate change. Frontiers in psychology 9 (2018), 2364. https://doi.org/10.3389/fpsyg.2018.02364",
      "doi": ""
    },
    {
      "text": "Stefan Marks, Javier E Estevez, and Andy M Connor. 2014. Towards the Holodeck: fully immersive virtual reality visualisation of scientific and engineering data. In Proceedings of the 29th International Conference on Image and Vision Computing New Zealand. 42–47. https://doi.org/10.1145/2683405.2683424",
      "doi": "10.1145/2683405.2683424"
    },
    {
      "text": "Richard E Mayer. 2005. Cognitive theory of multimedia learning. The Cambridge handbook of multimedia learning 41 (2005), 31–48.",
      "doi": ""
    },
    {
      "text": "Joan M Mazur and Cindy H Lio. 2004. Learner articulation in an immersive visualization environment. In CHI’04 Extended Abstracts on Human Factors in Computing Systems. 1355–1358. https://doi.org/10.1145/985921.986063",
      "doi": "10.1145/985921.986063"
    },
    {
      "text": "Huang Hsiu Mei and Liaw Shu Sheng. 2011. Applying situated learning in a virtual reality system to enhance learning motivation. International journal of information and education technology 1, 4(2011), 298–302.",
      "doi": ""
    },
    {
      "text": "Zahira Merchant, Ernest T Goetz, Lauren Cifuentes, Wendy Keeney-Kennicutt, and Trina J Davis. 2014. Effectiveness of virtual reality-based instruction on students’ learning outcomes in K-12 and higher education: A meta-analysis. Computers & Education 70 (2014), 29–40. https://doi.org/10.1016/j.compedu.2013.07.033",
      "doi": ""
    },
    {
      "text": "Susan Merkel and ASM Task Force on Curriculum Guidelines for Undergraduate Microbiology. 2012. The development of curricular guidelines for introductory microbiology that focus on understanding. Journal of Microbiology & Biology Education 13, 1 (2012), 32–38. https://doi.org/10.1128/jmbe.v13i1.363",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam and Elizabeth J Tisdell. 2015. Qualitative Research: A Guide to Design and Implementation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Oliver A Meyer, Magnus K Omdahl, and Guido Makransky. 2019. Investigating the effect of pre-training when learning through immersive virtual reality and video: A media and methods experiment. Computers & Education 140 (2019), 103603. https://doi.org/10.1016/j.compedu.2019.103603",
      "doi": "10.1016/j.compedu.2019.103603"
    },
    {
      "text": "Ilaria Montagni, Elie Guichard, and Tobias Kurth. 2016. Association of screen time with self-perceived attention problems and hyperactivity levels in French students: a cross-sectional study. BMJ open 6, 2 (2016), e009089. https://doi.org/10.1136/bmjopen-2015-009089",
      "doi": ""
    },
    {
      "text": "Joschka Mütterlein. 2018. The three pillars of virtual reality? Investigating the roles of immersion, presence, and interactivity. In Proceedings of the 51st Hawaii international conference on system sciences.",
      "doi": ""
    },
    {
      "text": "Pranathi Mylavarapu, Adil Yalcin, Xan Gregg, and Niklas Elmqvist. 2019. Ranked-list visualization: A graphical perception study. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3290605.3300422",
      "doi": "10.1145/3290605.3300422"
    },
    {
      "text": "Michael Narayan, Leo Waugh, Xiaoyu Zhang, Pradyut Bafna, and Doug Bowman. 2005. Quantifying the benefits of immersion for collaboration in virtual environments. In Proceedings of the ACM symposium on Virtual reality software and technology. 78–81.",
      "doi": "10.1145/1101616.1101632"
    },
    {
      "text": "Cuong Nguyen and Feng Liu. 2016. Gaze-based notetaking for learning from lecture videos. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2093–2097. https://doi.org/10.1145/2858036.2858137",
      "doi": "10.1145/2858036.2858137"
    },
    {
      "text": "Donald A Norman. 1988. The design of everything things. Currency Doubleday, USA(1988).",
      "doi": ""
    },
    {
      "text": "Max M North, Joseph Sessum, and Alex Zakalev. 2004. Immersive visualization tool for pedagogical practices of computer science concepts: A pilot study. Journal of Computing Sciences in Colleges 19, 3 (2004), 207–215.",
      "doi": "10.5555/948835.948856"
    },
    {
      "text": "Sebastian Oberdörfer, David Heidrich, and Marc Erich Latoschik. 2019. Usability of gamified knowledge learning in VR and desktop-3D. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13. https://doi.org/10.1145/3290605.3300405",
      "doi": "10.1145/3290605.3300405"
    },
    {
      "text": "Jocelyn Parong and Richard E Mayer. 2018. Learning science in immersive virtual reality.Journal of Educational Psychology 110, 6 (2018), 785. https://doi.org/a0.1037/edu0000241",
      "doi": ""
    },
    {
      "text": "Jocelyn Parong and Richard E Mayer. 2021. Learning about history in immersive virtual reality: does immersion facilitate learning?Educational Technology Research and Development 69, 3(2021), 1433–1451. https://doi.org/10.1007/s11423-021-09999-y",
      "doi": ""
    },
    {
      "text": "S Camille Peres, Tri Pham, and Ronald Phillips. 2013. Validation of the system usability scale (SUS) SUS in the wild. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 57. SAGE Publications Sage CA: Los Angeles, CA, 192–196. https://doi.org/10.1177/15419312135710",
      "doi": ""
    },
    {
      "text": "Johanna Pirker, Michael Holly, Isabel Lesjak, Johannes Kopf, and Christian Gütl. 2019. MaroonVR—An Interactive and Immersive Virtual Reality Physics Laboratory. In Learning in a Digital World. Springer, 213–238. https://doi.org/10.1007/978-981-13-8265-9_11",
      "doi": ""
    },
    {
      "text": "Aaron M Pleitner, Susan R Hammons, Emily McKenzie, Young-Hee Cho, and Haley F Oliver. 2014. Introduction of molecular methods into a food microbiology curriculum. Journal of Food Science Education 13, 4 (2014), 68–76. https://doi.org/10.1111/1541-4329.12042",
      "doi": ""
    },
    {
      "text": "Qualtrics, Provo, UT. 2020. Qualtrics | Analysis & Software. https://www.qualtrics.com. [Online; accessed 22-August-2022].",
      "doi": ""
    },
    {
      "text": "Jaziar Radianti, Tim A Majchrzak, Jennifer Fromm, and Isabell Wohlgenannt. 2020. A systematic review of immersive virtual reality applications for higher education: Design elements, lessons learned, and research agenda. Computers & Education 147 (2020), 103778.",
      "doi": "10.1016/j.compedu.2019.103778"
    },
    {
      "text": "Iulian Radu and Bertrand Schneider. 2019. What can we learn from augmented reality (AR)? Benefits and drawbacks of AR for inquiry-based learning of physics. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12. https://doi.org/10.1145/3290605.3300774",
      "doi": "10.1145/3290605.3300774"
    },
    {
      "text": "Stephen K Reed. 2006. Cognitive architectures for multimedia learning. Educational psychologist 41, 2 (2006), 87–98. https://doi.org/10.1207/s15326985ep4102_2",
      "doi": ""
    },
    {
      "text": "Yolanda Jacobs Reimer, Erin Brimhall, Chen Cao, and Kevin O’Reilly. 2009. Empirical user studies inform the design of an e-notetaking and information assimilation system for students in higher education. Computers & Education 52, 4 (2009), 893–913. https://doi.org/10.1016/j.compedu.2008.12.013",
      "doi": "10.1016/j.compedu.2008.12.013"
    },
    {
      "text": "Yann Riche, Nathalie Henry Riche, Ken Hinckley, Sheri Panabaker, Sarah Fuelling, and Sarah Williams. 2017. As We May Ink?: Learning from Everyday Analog Pen Use to Improve Digital Ink Experiences.(2017), 3241–3253. https://doi.org/10.1145/3025453.3025716",
      "doi": "10.1145/3025453.3025716"
    },
    {
      "text": "Maria Roussou. 2004. Learning by doing and learning through play: an exploration of interactivity in virtual environments for children. Computers in Entertainment (CIE) 2, 1 (2004), 10–10.",
      "doi": "10.1145/973801.973818"
    },
    {
      "text": "Puripant Ruchikachorn and Klaus Mueller. 2015. Learning visualizations by analogy: Promoting visual literacy through visualization morphing. IEEE transactions on visualization and computer graphics 21, 9(2015), 1028–1044. https://doi.org/10.1109/TVCG.2015.2413786",
      "doi": "10.1109/TVCG.2015.2413786"
    },
    {
      "text": "Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344–360. https://doi.org/10.1007/s11031-006-9051-8",
      "doi": ""
    },
    {
      "text": "Florian Schmidt-Weigand, Alfred Kohnert, and Ulrich Glowalla. 2010. A closer look at split visual attention in system-and self-paced instruction in multimedia learning. Learning and instruction 20, 2 (2010), 100–110.",
      "doi": ""
    },
    {
      "text": "Christian Schott and Stephen Marshall. 2018. Virtual reality and situated experiential education: A conceptualization and exploratory trial. Journal of computer assisted learning 34, 6 (2018), 843–852. https://doi.org/10.1111/jcal.12293",
      "doi": ""
    },
    {
      "text": "Jinsil Hwaryoung Seo, Brian Michael Smith, Margaret E Cook, Erica R Malone, Michelle Pine, Steven Leal, Zhikun Bai, and Jinkyo Suh. 2017. Anatomy builder VR: Embodied VR anatomy learning program to promote constructionist learning. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 2070–2075. https://doi.org/10.1145/3027063.3053148",
      "doi": "10.1145/3027063.3053148"
    },
    {
      "text": "Larry L Shirey and Ralph E Reynolds. 1988. Effect of interest on attention and learning.Journal of Educational Psychology 80, 2 (1988), 159.",
      "doi": ""
    },
    {
      "text": "Yu Shu, Yen-Zhang Huang, Shu-Hsuan Chang, and Mu-Yen Chen. 2019. Do virtual reality head-mounted displays make a difference? A comparison of presence and self-efficacy between head-mounted displays and desktop computer-facilitated virtual environments. Virtual Reality 23, 4 (2019), 437–446. https://doi.org/10.1007/s10055-018-0376-x",
      "doi": "10.1007/s10055-018-0376-x"
    },
    {
      "text": "Erica Southgate. 2019. Virtual reality for Deeper Learning: An exemplar from high school science. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 1633–1639. https://doi.org/10.1109/VR.2019.8797841",
      "doi": ""
    },
    {
      "text": "Marc Steen, Menno Manschot, and Nicole De Koning. 2011. Benefits of co-design in service design projects. International Journal of Design 5, 2 (2011).",
      "doi": ""
    },
    {
      "text": "Michal Takac. 2020. Application of Web-based Immersive Virtual Reality in Mathematics Education. In 2020 21th International Carpathian Control Conference (ICCC). IEEE, 1–6. https://doi.org/10.1109/ICCC49264.2020.9257276",
      "doi": ""
    },
    {
      "text": "P Truchly, M Medveckỳ, P Podhradskỳ, and M Vančo. 2018. Virtual reality applications in STEM education. In 2018 16th International Conference on Emerging eLearning Technologies and Applications (ICETA). IEEE, 597–602. https://doi.org/a0.1109/ICETA.2018.8572133",
      "doi": ""
    },
    {
      "text": "Huawei Tu, Susu Huang, Jiabin Yuan, Xiangshi Ren, and Feng Tian. 2019. Crossing-based selection with virtual reality head-mounted displays. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–14. https://doi.org/10.1145/3290605.3300848",
      "doi": "10.1145/3290605.3300848"
    },
    {
      "text": "Jarke J Van Wijk. 2006. Views on visualization. IEEE transactions on visualization and computer graphics 12, 4(2006), 421–432. https://doi.org/10.1109/TVCG.2006.80",
      "doi": "10.1109/TVCG.2006.80"
    },
    {
      "text": "Silvestro V Veneruso, Lauren S Ferro, Andrea Marrella, Massimo Mecella, and Tiziana Catarci. 2020. CyberVR: an interactive learning experience in virtual reality for cybersecurity related issues. In Proceedings of the International Conference on Advanced Visual Interfaces. 1–8. https://doi.org/10.1145/3399715.3399860",
      "doi": "10.1145/3399715.3399860"
    },
    {
      "text": "Maria Virvou and George Katsionis. 2008. On the usability and likeability of virtual reality games for education: The case of VR-ENGAGE. Computers & Education 50, 1 (2008), 154–178. https://doi.org/10.1016/j.compedu.2006.04.004",
      "doi": "10.1016/j.compedu.2006.04.004"
    },
    {
      "text": "YuLung Wu, Teyi Chan, BinShyan Jong, and TsongWuu Lin. 2003. A web-based virtual reality physics laboratory. In Proceedings 3rd IEEE International Conference on Advanced Technologies. IEEE, 455. https://doi.org/10.1109/ICALT.2003.1215178",
      "doi": ""
    },
    {
      "text": "Dongsong Zhang, J Leon Zhao, Lina Zhou, and Jay F Nunamaker Jr. 2004. Can e-learning replace classroom learning?Commun. ACM 47, 5 (2004), 75–79.",
      "doi": "10.1145/986213.986216"
    },
    {
      "text": "Lei Zhang, Doug A Bowman, and Caroline N Jones. 2019. Exploring effects of interactivity on learning with interactive storytelling in immersive virtual reality. In 2019 11th International Conference on Virtual Worlds and Games for Serious Applications (VS-Games). IEEE, 1–8. https://doi.org/10.1109/VS-Games.2019.8864531",
      "doi": ""
    },
    {
      "text": "Jiayan Zhao, Peter LaFemina, Julia Carr, Pejman Sajjadi, Jan Oliver Wallgrün, and Alexander Klippel. 2020. Learning in the field: Comparison of desktop, immersive virtual reality, and actual field trips for place-based STEM education. In 2020 IEEE conference on virtual reality and 3D user interfaces (VR). IEEE, 893–902. https://doi.org/10.1109/VR46266.2020.00012",
      "doi": ""
    },
    {
      "text": "Li-Huan Zhu, Long Chen, Shengsheng Yang, Daoming Liu, Jixue Zhang, Xianjin Cheng, and Weisheng Chen. 2013. Embryonic NOTES thoracic sympathectomy for palmar hyperhidrosis: results of a novel technique and comparison with the conventional VATS procedure. Surgical endoscopy 27, 11 (2013), 4124–4129.",
      "doi": ""
    }
  ]
}