{
  "doi": "10.1145/3544548.3581222",
  "title": "So, I Can Feel Normal: Participatory Design for Accessible Social Media Sites for Individuals with Traumatic Brain Injury",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Traumatic brain injury (TBI) can result in chronic sensorimotor, cognitive, psychosocial, and communication challenges that can limit social participation. Social media can be a useful outlet for social participation for individuals with TBI, but there are barriers to access. While research has drawn attention to the nature of access barriers, few studies have investigated technological solutions to address these barriers, particularly considering the perspectives of individuals with TBI. To address this gap in knowledge, we used a participatory approach to engage 10 adults with TBI in conceptualizing tools to address their challenges accessing Facebook. Participants described multifaceted challenges in using social media, including interface overload, social comparisons, and anxiety over self-presentation and communication after injury. They discussed their needs and preferences and generated ideas for design solutions. Our work contributes to designing assistive and accessibility technology to facilitate an equal access to the benefits of social media for individuals with TBI.",
  "authors": [
    {
      "name": "Hajin Lim",
      "institution": "Department of Computer Sciences, University of Wisconsin-Madison, United States and HCI+D Lab., Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781434",
      "orcid": "0000-0002-4746-2144"
    },
    {
      "name": "Lisa Kakonge",
      "institution": "Rehabilitation Science, McMaster University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780215",
      "orcid": "0000-0003-4164-6716"
    },
    {
      "name": "Yaxin Hu",
      "institution": "Department of Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659770408",
      "orcid": "0000-0003-4462-0140"
    },
    {
      "name": "Lyn Turkstra",
      "institution": "Rehabilitation Science, McMaster University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779586",
      "orcid": "0000-0002-6948-6921"
    },
    {
      "name": "Melissa Duff",
      "institution": "Department of Hearing and Speech Sciences, Vanderbilt University Medical Center, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780835",
      "orcid": "0000-0003-1759-3634"
    },
    {
      "name": "Catalina Toma",
      "institution": "Department of Communication Arts, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658986813",
      "orcid": "0000-0003-0714-312X"
    },
    {
      "name": "Bilge Mutlu",
      "institution": "Department of Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/do/10.1145/contrib-81310500023/rel-imgonly/mutlu.jpg",
      "acmid": "81310500023",
      "orcid": "0000-0002-9456-1495"
    }
  ],
  "references": [
    {
      "text": "Reihaneh Ahmadi, Hajin Lim, Bilge Mutlu, Melissa Duff, Catalina Toma, and Lyn Turkstra. 2022. Facebook Experiences of Users With Traumatic Brain Injury: A Think-Aloud Study. JMIR Rehabilitation and Assistive Technologies 9, 4: e39984.",
      "doi": ""
    },
    {
      "text": "Osman Ahmed, S John Sullivan, Anthony Schneiders, Sam Moon, and Paul McCrory. 2013. Exploring the opinions and perspectives of general practitioners towards the use of social networking sites for concussion management. Journal of primary health care 5, 1: 36–42.",
      "doi": ""
    },
    {
      "text": "Dasuni S. Alwis, Edwin B. Yan, Maria Cristina Morganti-Kossmann, and Ramesh Rajan. 2012. Sensory Cortex Underpinnings of Traumatic Brain Injury Deficits. PLOS ONE 7, 12: e52169. https://doi.org/10.1371/JOURNAL.PONE.0052169",
      "doi": ""
    },
    {
      "text": "Viviana Amati, Silvia Meggiolaro, Giulia Rivellini, and Susanna Zaccarin. 2018. Social relations and life satisfaction: the role of friends. Genus 74, 1: 7. https://doi.org/10.1186/s41118-018-0032-z",
      "doi": ""
    },
    {
      "text": "Helmut Appel, Alexander L Gerlach, and Jan Crusius. 2016. The interplay between Facebook use, social comparison, envy, and depression. Current opinion in psychology 9: 44–49.",
      "doi": ""
    },
    {
      "text": "Apple. 2022. Use predictive text on iPhone. Apple Inc. . Retrieved September 9, 2022 from https://support.apple.com/en-ca/guide/iphone/iphd4ea90231/ios",
      "doi": ""
    },
    {
      "text": "Malika Aubakirova and Mohit Bansal. 2016. Interpreting Neural Networks to Improve Politeness Comprehension.",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson. 2021. Nonverbal overload: A theoretical argument for the causes of Zoom fatigue. Technology, Mind, and Behavior 2, 1. https://doi.org/10.1037/tmb0000030",
      "doi": ""
    },
    {
      "text": "Christina Baker-Sparr, Tessa Hart, Thomas Bergquist, Jennifer Bogner, Laura Dreer, Shannon Juengst, David Mellick, Therese M. O'Neil-Pirozzi, Angelle M. Sander, and Gale G. Whiteneck. 2018. Internet and Social Media Use After Traumatic Brain Injury: A Traumatic Brain Injury Model Systems Study. Journal of Head Trauma Rehabilitation 33, 1: E9–E17. https://doi.org/10.1097/HTR.0000000000000305",
      "doi": ""
    },
    {
      "text": "Mark Theodore Bayley, Robyn Tate, Jacinta Mary Douglas, Lyn S. Turkstra, Jennie Ponsford, Mary Stergiou-Kita, Ailene Kua, and Peter Bragge. 2014. INCOG Guidelines for Cognitive Rehabilitation Following Traumatic Brain Injury. Journal of Head Trauma Rehabilitation 29, 4: 290–306. https://doi.org/10.1097/HTR.0000000000000070",
      "doi": ""
    },
    {
      "text": "Elizabeth Jane Beadle, Tamara Ownsworth, Jennifer Fleming, and David Shum. 2016. The Impact of Traumatic Brain Injury on Self-Identity. Journal of Head Trauma Rehabilitation 31, 2: E12–E25. https://doi.org/10.1097/HTR.0000000000000158",
      "doi": ""
    },
    {
      "text": "Roman Bednarik, Hana Vrzakova, and Michal Hradis. 2012. What do you want to do next: a novel approach for intent prediction in gaze-based interaction. In Proceedings of the symposium on eye tracking research and applications, 83–90.",
      "doi": "10.1145/2168556.2168569"
    },
    {
      "text": "Michael S. Bernstein, Greg Little, Robert C. Miller, Björn Hartmann, Mark S. Ackerman, David R. Karger, David Crowell, and Katrina Panovich. 2010. Soylent: A Word Processor with a Crowd Inside. In Proceedings of the 23rd annual ACM symposium on User interface software and technology, 313–322. https://doi.org/10.1145/1866029.1866078",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Cristina Bornhofen and Skye McDonald. 2008. Comparing Strategies for Treating Emotion Perception Deficits in Traumatic Brain Injury. Journal of Head Trauma Rehabilitation 23, 2: 103–115. https://doi.org/10.1097/01.HTR.0000314529.22777.43",
      "doi": ""
    },
    {
      "text": "Fernando H. F. Botelho. 2021. Accessibility to digital technology: Virtual barriers, real opportunities. Assistive Technology 33, sup1: 27–34. https://doi.org/10.1080/10400435.2021.1945705",
      "doi": ""
    },
    {
      "text": "Brain Injury Association of America. 2022. About Brain Injury: Brain Injury Overview. Brain Injury Association of America. Retrieved September 4, 2022 from https://www.biausa.org/brain-injury/about-brain-injury/basics/overview",
      "doi": ""
    },
    {
      "text": "Laura F Bright, Susan Bardi Kleiser, and Stacy Landreth Grau. 2015. Too much Facebook? An exploratory examination of social media fatigue. Computers in Human Behavior 44: 148–155.",
      "doi": "10.1016/j.chb.2014.11.048"
    },
    {
      "text": "Tom B. Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel M. Ziegler, Jeffrey Wu, Clemens Winter, Christopher Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners.",
      "doi": ""
    },
    {
      "text": "Melissa Brunner, Bronwyn Hemsley, Stuart Palmer, Stephen Dann, and Leanne Togher. 2015. Review of the literature on the use of social media by people with traumatic brain injury (TBI). Disability and Rehabilitation 37, 17: 1511–1521. https://doi.org/10.3109/09638288.2015.1045992",
      "doi": ""
    },
    {
      "text": "Melissa Brunner, Bronwyn Hemsley, Leanne Togher, and Stuart Palmer. 2017. Technology and its role in rehabilitation for people with cognitive-communication disability following a traumatic brain injury (TBI). Brain Injury 31, 8: 1028–1043. https://doi.org/10.1080/02699052.2017.1292429",
      "doi": ""
    },
    {
      "text": "Melissa Brunner, Stuart Palmer, Leanne Togher, Stephen Dann, and Bronwyn Hemsley. 2019. Content Analysis of Tweets by People with Traumatic Brain Injury (TBI): Implications for Rehabilitation and Social Media Goals. https://doi.org/10.24251/HICSS.2019.523",
      "doi": ""
    },
    {
      "text": "Melissa Brunner, Stuart Palmer, Leanne Togher, Stephen Dann, and Bronwyn Hemsley. 2020. “If I knew what I was doing on Twitter then I would use it more”: Twitter experiences and networks of people with traumatic brain injury (TBI). Brain Impairment 21, 1: 1–18. https://doi.org/10.1017/BrImp.2019.12",
      "doi": ""
    },
    {
      "text": "Melissa Brunner, Stuart Palmer, Leanne Togher, and Bronwyn Hemsley. 2019. ‘I kind of figured it out’: the views and experiences of people with traumatic brain injury (TBI) in using social media-self-determination for participation and inclusion online. International Journal of Language & Communication Disorders 54, 2: 221–233. https://doi.org/10.1111/1460-6984.12405",
      "doi": ""
    },
    {
      "text": "Melissa Brunner, Rachael Rietdijk, and Leanne Togher. 2022. Training Resources Targeting Social Media Skills to Inform Rehabilitation for People Who Have an Acquired Brain Injury: Scoping Review. Journal of Medical Internet Research 24, 4: e35595. https://doi.org/10.2196/35595",
      "doi": ""
    },
    {
      "text": "Melissa Brunner, Leanne Togher, Stuart Palmer, Stephen Dann, and Bronwyn Hemsley. 2021. Rehabilitation professionals’ views on social media use in traumatic brain injury rehabilitation: gatekeepers to participation. Disability and Rehabilitation 43, 14: 1955–1964. https://doi.org/10.1080/09638288.2019.1685604",
      "doi": ""
    },
    {
      "text": "Lindsey Byom and Lyn S. Turkstra. 2017. Cognitive task demands and discourse performance after traumatic brain injury. International Journal of Language & Communication Disorders 52, 4: 501–513. https://doi.org/10.1111/1460-6984.12289",
      "doi": ""
    },
    {
      "text": "Anneli Cassel, Skye McDonald, Michelle Kelly, and Leanne Togher. 2019. Learning from the minds of others: A review of social cognition treatments and their relevance to traumatic brain injury. Neuropsychological Rehabilitation 29, 1: 22–55. https://doi.org/10.1080/09602011.2016.1257435",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. 2021. Getting Better After a Mild TBI or Concussion. Retrieved September 9, 2022 from https://www.cdc.gov/traumaticbraininjury/concussion/getting-better.html",
      "doi": ""
    },
    {
      "text": "Jinghui Cheng, Dorian Anderson, Cynthia Putnam, and Jin Guo. 2017. Leveraging Design Patterns to Support Designer-Therapist Collaboration When Ideating Brain Injury Therapy Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play, 291–303. https://doi.org/10.1145/3116595.3116600",
      "doi": "10.1145/3116595.3116600"
    },
    {
      "text": "Mina Choi and Catalina L Toma. 2014. Social sharing through interpersonal media: Patterns and effects on emotional well-being. Computers in Human Behavior 36: 530–541.",
      "doi": "10.1016/j.chb.2014.04.026"
    },
    {
      "text": "Elliot Cole and Parto Dehdashti. 1990. Interface design as a prosthesis for an individual with a brain injury. ACM SIGCHI Bulletin 22, 1: 28–32. https://doi.org/10.1145/101288.101293",
      "doi": "10.1145/101288.101293"
    },
    {
      "text": "Aurora Constantin, Cristina Alexandru, Jessica Korte, Cara Wilson, Jerry Alan Fails, Gavin Sim, Janet C. Read, and Eva Eriksson. 2021. Distributing participation in design: Addressing challenges of a global pandemic. International Journal of Child-Computer Interaction 28: 100255. https://doi.org/10.1016/j.ijcci.2021.100255",
      "doi": "10.1016/j.ijcci.2021.100255"
    },
    {
      "text": "J. Conway, T. Flamini, S. Harton, and L. Gower. 2012. Staying connected through social media: connections for compassionate caring. In 10th Annual Conference on Brain Injury of the North American Brain Injury Society's, NABIS, E14-15.",
      "doi": ""
    },
    {
      "text": "Cynthia A. Dahlberg, Christopher P. Cusick, Lenore A. Hawley, Jody K. Newman, Clare E. Morey, Cynthia L. Harrison-Felix, and Gale G. Whiteneck. 2007. Treatment Efficacy of Social Communication Skills Training After Traumatic Brain Injury: A Randomized Treatment and Deferred Treatment Controlled Trial. Archives of Physical Medicine and Rehabilitation 88, 12: 1561–1573. https://doi.org/10.1016/j.apmr.2007.07.033",
      "doi": ""
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. “Yours is better!”: participant response bias in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1321–1330. https://doi.org/10.1145/2207676.2208589",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Fenne große Deters and Matthias R. Mehl. 2013. Does Posting Facebook Status Updates Increase or Decrease Loneliness? An Online Social Networking Experiment. Social Psychological and Personality Science 4, 5: 579–586. https://doi.org/10.1177/1948550612469233",
      "doi": ""
    },
    {
      "text": "Jacinta Douglas. 2020. Loss of friendship following traumatic brain injury: A model grounded in the experience of adults with severe injury. Neuropsychological Rehabilitation 30, 7: 1277–1302. https://doi.org/10.1080/09602011.2019.1574589",
      "doi": ""
    },
    {
      "text": "Andrew T Duchowski. 2018. Gaze-based interaction: A 30 year retrospective. Computers & Graphics 73: 59–69.",
      "doi": "10.1016/j.cag.2018.04.002"
    },
    {
      "text": "Eva Eggenberger, Katharina Heimerl, and Michael I. Bennett. 2013. Communication skills training in dementia care: a systematic review of effectiveness, training content, and didactic methods in different care settings. International Psychogeriatrics 25, 3: 345–358. https://doi.org/10.1017/S1041610212001664",
      "doi": ""
    },
    {
      "text": "M. Elepfandt and M. Grund. 2012. Move it there, or not? The design of voice commands for gaze with speech. In Proceedings of the 4th workshop on eye gaze in intelligent human machine interaction, 1–3.",
      "doi": ""
    },
    {
      "text": "Caroline S Ellis-Hill and Sandra Horn. 2000. Change in identity and self-concept: a new theoretical approach to recovery following a stroke. Clinical Rehabilitation 14, 3: 279–287. https://doi.org/10.1191/026921500671231410",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Jessica Vitak, Rebecca Gray, and Cliff Lampe. 2014. Cultivating Social Resources on Social Network Sites: Facebook Relationship Maintenance Behaviors and Their Role in Social Capital Processes. Journal of Computer-Mediated Communication 19, 4: 855–870. https://doi.org/10.1111/jcc4.12078",
      "doi": "10.1111/jcc4.12078"
    },
    {
      "text": "Margaret A. Flynn, Arianna Rigon, Rachel Kornfield, Bilge Mutlu, Melissa C. Duff, and Lyn S. Turkstra. 2019. Characterizing computer-mediated communication, friendship, and social participation in adults with traumatic brain injury. Brain Injury 33, 8: 1097–1104. https://doi.org/10.1080/02699052.2019.1616112",
      "doi": ""
    },
    {
      "text": "Shaoxiong Fu, Hongxiu Li, Yong Liu, Henri Pirkkalainen, and Markus Salo. 2020. Social media overload, exhaustion, and use discontinuance: Examining the effects of information overload, system feature overload, and social overload. Information Processing & Management 57, 6: 102307. https://doi.org/10.1016/j.ipm.2020.102307",
      "doi": ""
    },
    {
      "text": "Ryan Colin Gibson, Mark D. Dunlop, and Matt-Mouley Bouamrane. 2020. Lessons from Expert Focus Groups on how to Better Support Adults with Mild Intellectual Disabilities to Engage in Co-Design. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility, 1–12. https://doi.org/10.1145/3373625.3417008",
      "doi": "10.1145/3373625.3417008"
    },
    {
      "text": "Cole Gleason, Patrick Carrington, Lydia B. Chilton, Benjamin M. Gorman, Hernisa Kacorri, Andrés Monroy-Hernández, Meredith Ringel Morris, Garreth W. Tigwell, and Shaomei Wu. 2019. Addressing the Accessibility of Social Media. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing, 474–479. https://doi.org/10.1145/3311957.3359439",
      "doi": "10.1145/3311957.3359439"
    },
    {
      "text": "Amy L Gonzales and Jeffrey T Hancock. 2008. Identity shift in computer-mediated environments. Media Psychology 11, 2: 167–185.",
      "doi": ""
    },
    {
      "text": "Good Word Guide. 2021. Instant Dictionary by GoodWordGuide.com. Good Word Guide. Retrieved September 9, 2022 from https://chrome.google.com/webstore/detail/instant-dictionary-by-goo/mfembjnmeainjncdflaoclcjadfhpoim?hl=en",
      "doi": ""
    },
    {
      "text": "Fergus Gracey, Jonathan J. Evans, and Donna Malley. 2009. Capturing process and outcome in complex rehabilitation interventions: A “Y-shaped” model. Neuropsychological Rehabilitation 19, 6: 867–890. https://doi.org/10.1080/09602010903027763",
      "doi": ""
    },
    {
      "text": "Fergus Gracey, Katrina Vicentijevic, and Abigail Methley. 2021. The Y-Shaped model of psychological adaptation after brain injury: An acceptance and commitment perspective. In Acceptance and Commitment Therapy and Brain Injury: A Practical Guide for Clinicians (1st ed.), Willis Curvis and Abigail Methley (eds.). Routledge, 16–25. https://doi.org/10.4324/9781003024408-4",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Karin Slegers, and Pieter Duysburgh. 2015. Codesign with people living with cognitive or sensory impairments: a case for method stories and uniqueness. CoDesign 11, 1: 70–82. https://doi.org/10.1080/15710882.2015.1020316",
      "doi": ""
    },
    {
      "text": "IDEO. Design Kit. Retrieved September 12, 2022 from https://www.designkit.org/methods/3",
      "doi": ""
    },
    {
      "text": "A.K.M. Najmul Islam, Eoin Whelan, and Stoney Brooks. 2018. Social Media Overload and fatigue: the Moderating Role of Multitasking Computer Self-Efficacy. AMCIS 2018 Proceedings. Retrieved September 12, 2022 from https://aisel.aisnet.org/amcis2018/SocialComputing/Presentations/1",
      "doi": ""
    },
    {
      "text": "Walter D Johnson and Dylan P Griswold. 2017. Traumatic brain injury: a global challenge. The Lancet Neurology 16, 12: 949–950. https://doi.org/10.1016/S1474-4422(17)30362-9",
      "doi": ""
    },
    {
      "text": "Mary R.T Kennedy and Carl Coelho. 2005. Self-Regulation after Traumatic Brain Injury: A Framework for Intervention of Memory and Problem Solving. Seminars in Speech and Language 26, 04: 242–255. https://doi.org/10.1055/s-2005-922103",
      "doi": ""
    },
    {
      "text": "Jessica M. Ketchum, Mitch Sevigny, Tessa Hart, Therese M. O'Neil-Pirozzi, Angelle M. Sander, Shannon B. Juengst, Thomas F. Bergquist, Laura E. Dreer, and Gale G. Whiteneck. 2020. The Association Between Community Participation and Social Internet Use Among Adults With Traumatic Brain Injury. Journal of Head Trauma Rehabilitation 35, 4: 254–261. https://doi.org/10.1097/HTR.0000000000000566",
      "doi": ""
    },
    {
      "text": "Andrea M. Kilov, Leanne Togher, Emma Power, and Lyn Turkstra. 2010. Can teenagers with traumatic brain injury use Internet chatrooms? A systematic review of the literature and the Internet. Brain Injury 24, 10: 1135–1172. https://doi.org/10.3109/02699052.2010.490511",
      "doi": ""
    },
    {
      "text": "Giulio Lancioni, Lorenzo Desideri, Nirbhay Singh, Mark O'Reilly, and Jeff Sigafoos. 2021. Technology options to help people with dementia or acquired cognitive impairment perform multistep daily tasks: a scoping review. Journal of Enabling Technologies 15, 3: 208–223. https://doi.org/10.1108/JET-11-2020-0048",
      "doi": ""
    },
    {
      "text": "Edmund W J Lee, Shirley S Ho, and May O Lwin. 2017. Explicating problematic social network sites use: A review of concepts, theoretical frameworks, and future directions for communication theorizing. New Media & Society 19, 2: 308–326.",
      "doi": ""
    },
    {
      "text": "Hajin Lim. 2021. Designing to support sense making in cross-lingual computer-mediated communication using NLP techniques. Cornell University.",
      "doi": ""
    },
    {
      "text": "Hajin Lim, Dan Cosley, and Susan R Fussell. 2018. Beyond Translation: Design and Evaluation of an Emotional and Contextual Knowledge Interface for Foreign Language Social Media Posts. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3173574",
      "doi": "10.1145/3173574"
    },
    {
      "text": "Li-Fong Lin, Tsan-Hon Liou, Chaur-Jong Hu, Hon-Ping Ma, Ju-Chi Ou, Yung-Hsiao Chiang, Wen-Ta Chiu, Shin-Han Tsai, and Woei-Chyn Chu. 2015. Balance function and sensory integration after mild traumatic brain injury. Brain Injury 29, 1: 41–46. https://doi.org/10.3109/02699052.2014.955881",
      "doi": ""
    },
    {
      "text": "Sheila MacDonald. 2017. Introducing the model of cognitive-communication competence: A model to guide evidence-based communication interventions after brain injury. Brain Injury 31, 13–14: 1760–1780. https://doi.org/10.1080/02699052.2017.1379613",
      "doi": ""
    },
    {
      "text": "Theodore Macnow, Tess Curran, Courtney Tolliday, Kirsti Martin, Madeline McCarthy, Didem Ayturk, Kavita M. Babu, and Rebekah Mannix. 2021. Effect of Screen Time on Recovery From Concussion. JAMA Pediatrics 175, 11: 1124. https://doi.org/10.1001/jamapediatrics.2021.2782",
      "doi": ""
    },
    {
      "text": "Angela Mastrianni, Leah Kulp, and Aleksandra Sarcevic. 2021. Transitioning to Remote User-Centered Design Activities in the Emergency Medical Field During a Pandemic. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, 1–8. https://doi.org/10.1145/3411763.3443444",
      "doi": "10.1145/3411763.3443444"
    },
    {
      "text": "Meta. 2022. How do I adjust the text contrast of the Facebook? Meta. Retrieved September 9, 2022 from https://www.facebook.com/help/1091929780828042",
      "doi": ""
    },
    {
      "text": "Meta. 2022. Which screen reader should I use for Facebook? Meta. Retrieved September 9, 2022 from https://www.facebook.com/help/485531161504971",
      "doi": ""
    },
    {
      "text": "Meta. 2022. See and manage Favorites on your Facebook Feed. Meta. Retrieved September 9, 2022 from https://www.facebook.com/help/1634545223376778",
      "doi": ""
    },
    {
      "text": "Peter Meulenbroek, Bryan Ness, Rik Lemoncello, Lindsey Byom, Sheila MacDonald, Therese M. O'Neil-Pirozzi, and McKay Moore Sohlberg. 2019. Social communication following traumatic brain injury part 2: Identifying effective treatment ingredients. International Journal of Speech-Language Pathology 21, 2: 128–142. https://doi.org/10.1080/17549507.2019.1583281",
      "doi": ""
    },
    {
      "text": "Peter Meulenbroek and Lyn S. Turkstra. 2018. Response to text-based social cues in the formation of causal attributions in adults with traumatic brain injury. Brain Injury 32, 13–14: 1720–1724. https://doi.org/10.1080/02699052.2018.1532531",
      "doi": ""
    },
    {
      "text": "Microsoft. 2022. Make Windows easier to see . Microsoft. Retrieved September 9, 2022 from https://support.microsoft.com/en-us/windows/make-windows-easier-to-see-c97c2b0d-cadb-93f0-5fd1-59ccfe19345d",
      "doi": ""
    },
    {
      "text": "Claire Midgley, Sabrina Thai, Penelope Lockwood, Chloe Kovacheff, and Elizabeth Page-Gould. 2021. When every day is a high school reunion: Social media comparisons and self-esteem. Journal of Personality and Social Psychology 121, 2: 285.",
      "doi": ""
    },
    {
      "text": "Nathaniel v Mohatt, Carlee J Kreisel, and Lisa A Brenner. 2021. Engaging Those Living With Moderate to Severe TBI and Their Caregivers in Research. Journal of Patient Experience 8: 237437352199885. https://doi.org/10.1177/2374373521998852",
      "doi": ""
    },
    {
      "text": "Emily L Morrow, Fangyun Zhao, Lyn Turkstra, Catalina Toma, Bilge Mutlu, and Melissa C Duff. 2021. Computer-Mediated Communication in Adults With and Without Moderate-to-Severe Traumatic Brain Injury: Survey of Social Media Use. JMIR Rehabilitation and Assistive Technologies 8, 3: e26586. https://doi.org/10.2196/26586",
      "doi": ""
    },
    {
      "text": "M. v. Morton and P. Wehman. 1995. Psychosocial and emotional sequelae of individuals with traumatic brain injury: a literature review and recommendations. Brain Injury 9, 1: 81–92. https://doi.org/10.3109/02699059509004574",
      "doi": ""
    },
    {
      "text": "Debjani Mukherjee, Rebecca L. Levin, and Wendy Heller. 2006. The Cognitive, Emotional, and Social Sequelae of Stroke: Psychological and Ethical Concerns in Post-Stroke Adaptation. Topics in Stroke Rehabilitation 13, 4: 26–35. https://doi.org/10.1310/tsr1304-26",
      "doi": ""
    },
    {
      "text": "Michael Muller and Allison Druin. 2002. Participatory Design: The Third Space in HCI. Handbook of HCI.",
      "doi": ""
    },
    {
      "text": "Shruthi Muraleedharan. 2018. Keyword Snooze: A New Way to Help Control Your News Feed. Meta. Retrieved September 9, 2022 from https://about.fb.com/news/2018/06/keyword-snooze-a-new-way-to-help-control-your-news-feed/",
      "doi": ""
    },
    {
      "text": "David Nandigam, Judith Symonds, Nicola Kayes, and Kathryn McPherson. 2010. Mobile phone user interface design for patients with traumatic brain injury. In Proceedings of the 11th International Conference of the NZ Chapter of the ACM Special Interest Group on Human-Computer Interaction on ZZZ - CHINZ ’10, 69–72. https://doi.org/10.1145/1832838.1832850",
      "doi": "10.1145/1832838.1832850"
    },
    {
      "text": "NICHD - Eunice Kennedy Shriver National Institute of Child Health and Human Development. What are common symptoms of traumatic brain injury (TBI)? . Retrieved September 12, 2022 from https://www.nichd.nih.gov/health/topics/tbi/conditioninfo/symptoms",
      "doi": ""
    },
    {
      "text": "Nielson Norman Group. Using “How Might We” Questions to Ideate on the Right Problems. Retrieved September 12, 2022 from https://www.nngroup.com/articles/how-might-we-questions/",
      "doi": ""
    },
    {
      "text": "Julia DeBlasio Olsheski, Bruce N. Walker, and Jeff McCloud. 2011. In-vehicle assistive technology (IVAT) for drivers who have survived a traumatic brain injury. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility - ASSETS ’11, 257. https://doi.org/10.1145/2049536.2049595",
      "doi": "10.1145/2049536.2049595"
    },
    {
      "text": "Tamara Ownsworth and Catherine Haslam. 2016. Impact of rehabilitation on self-concept following traumatic brain injury: An exploratory systematic review of intervention methodology and efficacy. Neuropsychological Rehabilitation 26, 1: 1–35. https://doi.org/10.1080/09602011.2014.977924",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 2014. Qualitative research & evaluation methods: Integrating theory and practice. Sage publications.",
      "doi": ""
    },
    {
      "text": "Ellie Pavlick and Joel Tetreault. 2016. An Empirical Analysis of Formality in Online Communication. Transactions of the Association for Computational Linguistics 4: 61–74. https://doi.org/10.1162/tacl_a_00083",
      "doi": ""
    },
    {
      "text": "Stéphanie Pinard, Carolina Bottari, Catherine Laliberté, Hélène Pigot, Marisnel Olivares, Mélanie Couture, Sylvain Giroux, and Nathalie Bier. 2021. Design and usability evaluation of COOK, an assistive technology for meal preparation for persons with severe TBI. Disability and Rehabilitation: Assistive Technology 16, 7: 687–701. https://doi.org/10.1080/17483107.2019.1696898",
      "doi": ""
    },
    {
      "text": "Cecile J. Proctor and Lisa A. Best. 2019. Social and psychological influences on satisfaction with life after brain injury. Disability and Health Journal 12, 3: 387–393. https://doi.org/10.1016/j.dhjo.2019.01.001",
      "doi": ""
    },
    {
      "text": "Megan Reynolds, Simon Driver, and Monica Bennett. 2018. The social network – using social media to support individuals with traumatic brain injury participating in a pilot study weight-loss program. Brain Injury 32, 12: 1450–1454. https://doi.org/10.1080/02699052.2018.1496480",
      "doi": ""
    },
    {
      "text": "Gerard A. Riley and Barbara F. Hagger. 2015. Disclosure of a stigmatized identity: A qualitative study of the reasons why people choose to tell or not tell others about their traumatic brain injury. Brain Injury 29, 12: 1480–1489. https://doi.org/10.3109/02699052.2015.1071427",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. CoDesign 4, 1: 5–18. https://doi.org/10.1080/15710880701875068",
      "doi": ""
    },
    {
      "text": "D. Schuler and A. Namioka. 2017. Participatory Design  Principles and Practices. CRC Press.",
      "doi": ""
    },
    {
      "text": "Nilkantha Sen. 2017. An insight into the vision impairment following traumatic brain injury. Neurochemistry International 111: 103–107. https://doi.org/10.1016/j.neuint.2017.01.019",
      "doi": ""
    },
    {
      "text": "Joanna Shorland and Jacinta M. Douglas. 2010. Understanding the role of communication in maintaining and forming friendships following traumatic brain injury. Brain Injury 24, 4: 569–580. https://doi.org/10.3109/02699051003610441",
      "doi": ""
    },
    {
      "text": "Carmit-Noa Shpigelman and Carol J. Gill. 2014. Facebook Use by Persons with Disabilities. Journal of Computer-Mediated Communication 19, 3: 610–624. https://doi.org/10.1111/jcc4.12059",
      "doi": "10.1111/jcc4.12059"
    },
    {
      "text": "Geertje Slingerland, Maria Murray, Stephan Lukosch, John McCarthy, and Frances Brazier. 2022. Participatory Design Going Digital: Challenges and Opportunities for Distributed Place-Making. Computer Supported Cooperative Work (CSCW). https://doi.org/10.1007/s10606-022-09438-3",
      "doi": "10.1007/s10606-022-09438-3"
    },
    {
      "text": "McKay Moore Sohlberg and Catherine A. Mateer. 2001. Improving Attention and Managing Attentional Problems. Annals of the New York Academy of Sciences 931, 1: 359–375. https://doi.org/10.1111/J.1749-6632.2001.TB05790.X",
      "doi": ""
    },
    {
      "text": "C. Spinuzzi. 2005. The Methodology of Participatory Design. Technical Communication 52, 2: 163–174.",
      "doi": ""
    },
    {
      "text": "Stefan Stieglitz and Linh Dang-Xuan. 2013. Emotions and Information Diffusion in Social Media—Sentiment of Microblogs and Sharing Behavior. Journal of Management Information Systems 29, 4: 217–248. https://doi.org/10.2753/MIS0742-1222290408",
      "doi": ""
    },
    {
      "text": "Nino Stocchetti and Elisa R. Zanier. 2016. Chronic impact of traumatic brain injury on outcome and quality of life: a narrative review. Critical Care 20, 1: 148. https://doi.org/10.1186/s13054-016-1318-1",
      "doi": ""
    },
    {
      "text": "Catalina L Toma and Jeffrey T Hancock. 2013. Self-affirmation underlies Facebook use. Personality and Social Psychology Bulletin 39, 3: 321–331.",
      "doi": ""
    },
    {
      "text": "Madeline Toubiana and Charlene Zietsma. 2017. The Message is on the Wall? Emotions, Social Media and the Dynamics of Institutional Complexity. Academy of Management Journal 60, 3: 922–953. https://doi.org/10.5465/amj.2014.0208",
      "doi": ""
    },
    {
      "text": "Theodore Tsaousides, Yuka Matsuzawa, and Matthew Lebowitz. 2011. Familiarity and prevalence of Facebook use for social networking among individuals with traumatic brain injury. Brain Injury 25, 12: 1155–1162. https://doi.org/10.3109/02699052.2011.613086",
      "doi": ""
    },
    {
      "text": "L.S. Turkstra, R.S. Norman, B. Mutlu, and M.C. Duff. 2018. Impaired theory of mind in adults with traumatic brain injury: A replication and extension of findings. Neuropsychologia 111: 117–122. https://doi.org/10.1016/j.neuropsychologia.2018.01.016",
      "doi": ""
    },
    {
      "text": "Monica Vaccaro, Tessa Hart, John Whyte, and Regina Buchhofer. 2007. Internet use and interest among individuals with traumatic brain injury: A consumer survey. Disability and Rehabilitation: Assistive Technology 2, 2: 85–95. https://doi.org/10.1080/17483100601167586",
      "doi": ""
    },
    {
      "text": "Jennifer J. Vasterling, Shawna N. Jacob, and Ann Rasmusson. 2018. Traumatic Brain Injury and Posttraumatic Stress Disorder: Conceptual, Diagnostic, and Therapeutic Considerations in the Context of Co-Occurrence. The Journal of Neuropsychiatry and Clinical Neurosciences 30, 2: 91–100. https://doi.org/10.1176/appi.neuropsych.17090180",
      "doi": ""
    },
    {
      "text": "Erin A. Vogel, Jason P. Rose, Lindsay R. Roberts, and Katheryn Eckles. 2014. Social comparison, social media, and self-esteem. Psychology of Popular Media Culture 3, 4: 206–222. https://doi.org/10.1037/ppm0000047",
      "doi": ""
    },
    {
      "text": "Dian A. de Vries, A. Marthe Möller, Marieke S. Wieringa, Anniek W. Eigenraam, and Kirsten Hamelink. 2018. Social Comparison as the Thief of Joy: Emotional Consequences of Viewing Strangers’ Instagram Posts. Media Psychology 21, 2: 222–245. https://doi.org/10.1080/15213269.2016.1267647",
      "doi": ""
    },
    {
      "text": "W3C Web Accessibility Initiative. 2022. Cognitive Accessibility at W3C. W3C Web Accessibility Initiative (WAI). Retrieved September 4, 2022 from https://www.w3.org/WAI/cognitive/",
      "doi": ""
    },
    {
      "text": "W3C Web Accessibility Initiative. 2022. All Supplemental Guidance. Supplemental Guidance to WCAG 2. Retrieved September 9, 2022 from https://www.w3.org/WAI/WCAG2/supplemental/#cognitiveaccessibilityguidance",
      "doi": ""
    },
    {
      "text": "Joshua R Williams. 2019. The use of online social networking sites to nurture and cultivate bonding social capital: A systematic review of the literature from 1997 to 2018. New Media & Society 21, 11–12: 2710–2729.",
      "doi": ""
    },
    {
      "text": "Dana Wong, Kelly Sinclair, Elizabeth Seabrook, Adam McKay, and Jennie Ponsford. 2017. Smartphones as assistive technology following traumatic brain injury: a preliminary study of what helps and what hinders. Disability and Rehabilitation 39, 23: 2387–2394. https://doi.org/10.1080/09638288.2016.1226434",
      "doi": ""
    },
    {
      "text": "Yale University. 2022. Usability & Web Accessibility: Social Media . Accessibility at Yale University. Retrieved September 4, 2022 from https://usability.yale.edu/web-accessibility/articles/social-media",
      "doi": ""
    },
    {
      "text": "Chia‐chen Yang, Sean M. Holden, Mollie D.K. Carter, and Jessica J. Webb. 2018. Social media social comparison and identity distress at the college transition: A dual‐path model. Journal of Adolescence 69, 1: 92–102. https://doi.org/10.1016/j.adolescence.2018.09.007",
      "doi": ""
    },
    {
      "text": "Mark Ylvisaker and Timothy Feeney. 2000. Reconstruction of Identity After Brain Injury. Brain Impairment 1, 1: 12–28. https://doi.org/10.1375/brim.1.1.12",
      "doi": ""
    },
    {
      "text": "Mark Ylvisaker, Kathryn Mcpherson, Nicola Kayes, and Ellen Pellett. 2008. Metaphoric identity mapping: Facilitating goal setting and engagement in rehabilitation after traumatic brain injury. Neuropsychological Rehabilitation 18, 5–6: 713–741. https://doi.org/10.1080/09602010802201832",
      "doi": ""
    },
    {
      "text": "V. Youcha. 2010. Education and outreach in the 21st century: using friends, tweets, and peeps to build an online community. International Brain Injury Association's Eighth World Congress on Brain Injury. Brain Injury 24: 391–392.",
      "doi": ""
    },
    {
      "text": "Shuwei Zhang, Ling Zhao, Yaobin Lu, and Jun Yang. 2016. Do you get tired of socializing? An empirical explanation of discontinuous usage behaviour in social network services. Information & Management 53, 7: 904–914. https://doi.org/10.1016/j.im.2016.03.006",
      "doi": ""
    },
    {
      "text": "Fangyun Zhao, Hajin Lim, Emily L Morrow, Lyn S Turkstra, Melissa C Duff, and Bilge Mutlu. 2022. Designing evidence-based support aids for social media access for individuals with moderate-severe traumatic brain injury: A preliminary acceptability study. Frontiers in digital health 4.",
      "doi": ""
    },
    {
      "text": "Homero Gil de Zúñiga, Matthew Barnidge, and Andrés Scherman. 2017. Social Media Social Capital, Offline Social Capital, and Citizenship: Exploring Asymmetrical Social Capital Effects. Political Communication 34, 1: 44–68. https://doi.org/10.1080/10584609.2016.1227000",
      "doi": ""
    },
    {
      "text": "Google Jamboard. Retrieved September 12, 2022 from https://jamboard.google.com/",
      "doi": ""
    }
  ]
}