{
  "doi": "10.1145/3544548.3581476",
  "title": "Understanding Communication Strategies and Viewer Engagement with Science Knowledge Videos on Bilibili",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "As a popular form of online media, videos have been widely used to communicate scientific knowledge on video-sharing platforms. These science knowledge videos take advantage of rich and multi-modality information which has the potential to provoke public engagement with science knowledge and promote self-learning. However, how communicators strategically make science knowledge videos to engage viewers, and how specific communication strategies correlate with viewer engagement remain under-explored. In this paper, we first established a taxonomy of communication strategies currently used in science knowledge videos on Bilibili and then examined the correlations between communication strategies and viewers’ behavioral, emotional, and cognitive engagements measured by post-video comments. Our findings revealed the landscape of rich science communication strategies in science knowledge videos and further uncovered the correlations between these strategies and viewer engagements. We situated our results within prior research on science communication and HCI, and provided design implications for video-sharing platforms to support effective science communication.",
  "tags": [
    "Online video platforms",
    "Science communication"
  ],
  "authors": [
    {
      "name": "Yu Zhang",
      "institution": "Department of Computer Science, City University of Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781296",
      "orcid": "0000-0002-8574-111X"
    },
    {
      "name": "Changyang He",
      "institution": "Department of Computer Science and Engineering, Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659900877",
      "orcid": "0000-0001-6648-4456"
    },
    {
      "name": "Huanchen Wang",
      "institution": "Department of Computer Science, City University of Hong Kong, China and Department of Computer Science and Engineering, Southern University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779040",
      "orcid": "0000-0001-9339-1941"
    },
    {
      "name": "Zhicong Lu",
      "institution": "Department of Computer Science, City University of Hong Kong, China",
      "img": "/do/10.1145/contrib-99659162049/rel-imgonly/photo.jpg",
      "acmid": "99659162049",
      "orcid": "0000-0002-7761-6351"
    }
  ],
  "references": [
    {
      "text": "Joachim Allgaier. 2019. Science and environmental communication on YouTube: strategically distorted communications in online videos on climate change and climate engineering. Frontiers in Communication 4 (2019), 36.",
      "doi": ""
    },
    {
      "text": "Inoka Amarasekara and Will J Grant. 2019. Exploring the YouTube science communication gender gap: A sentiment analysis. Public Understanding of Science 28, 1 (2019), 68–84.",
      "doi": ""
    },
    {
      "text": "Ashley A Anderson, Dominique E Brossard, Dietram A Scheufele, and Michael A Xenos. 2012. Online talk: how exposure to disagreement in online comments affects beliefs in the promise of contro-versial science. Citizen voices: Performing public participation in science and environment communication. Bristol: Intellect(2012), 119–136.",
      "doi": ""
    },
    {
      "text": "Tal August, Dallas Card, Gary Hsieh, Noah A Smith, and Katharina Reinecke. 2020. Explain like I am a Scientist: The Linguistic Barriers of Entry to r/science. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376524"
    },
    {
      "text": "Alex Beutel, Wanhong Xu, Venkatesan Guruswami, Christopher Palow, and Christos Faloutsos. 2013. Copycatch: stopping group attacks by spotting lockstep behavior in social networks. In Proceedings of the 22nd international conference on World Wide Web. 119–130.",
      "doi": "10.1145/2488388.2488400"
    },
    {
      "text": "Bilibili. 2021. Report of the Ecological Environment of Content Creators on Bilibili 2021. Retrieved July 05, 2022 from https://www.bilibili.com/read/cv14332832/",
      "doi": ""
    },
    {
      "text": "Bilibili. 2022. About Us - Bilibili. Retrieved July 04, 2022 from https://www.bilibili.com/blackboard/aboutUs.html",
      "doi": ""
    },
    {
      "text": "Roderick J Brodie, Ana Ilic, Biljana Juric, and Linda Hollebeek. 2013. Consumer engagement in a virtual brand community: An exploratory analysis. Journal of business research 66, 1 (2013), 105–114.",
      "doi": ""
    },
    {
      "text": "Dominique Brossard. 2013. New media landscapes and the science information consumer. Proceedings of the National Academy of Sciences 110, supplement_3(2013), 14096–14101.",
      "doi": ""
    },
    {
      "text": "Michael Brüggemann, Ines Lörcher, and Stefanie Walter. 2020. Post-normal science communication: Exploring the blurring boundaries of science and journalism. Journal of Science Communication 19, 3 (2020), A02.",
      "doi": ""
    },
    {
      "text": "Terry W Burns, D John O’Connor, and Susan M Stocklmayer. 2003. Science communication: a contemporary definition. Public understanding of science 12, 2 (2003), 183–202.",
      "doi": ""
    },
    {
      "text": "Hung-Tao M Chen and Megan Thomas. 2020. Effects of lecture video styles on engagement and learning. Educational Technology Research and Development 68, 5(2020), 2147–2164.",
      "doi": ""
    },
    {
      "text": "Zhaodi Chen and Dali L Yang. 2022. Governing Generation Z in China: Bilibili, bidirectional mediation, and online community governace. The Information Society(2022), 1–16.",
      "doi": ""
    },
    {
      "text": "Jason Chilvers. 2010. Sustainable participation? Mapping out and reflecting on the field of public dialogue on science and technology. (2010).",
      "doi": ""
    },
    {
      "text": "V Cisco. 2018. Cisco visual networking index: Forecast and trends, 2017–2022. White paper 1, 1 (2018).",
      "doi": ""
    },
    {
      "text": "Isabelle M Côté and Emily S Darling. 2018. Scientists on Twitter: Preaching to the choir or singing from the rooftops?Facets 3, 1 (2018), 682–694.",
      "doi": ""
    },
    {
      "text": "Yiming Cui, Wanxiang Che, Ting Liu, Bing Qin, and Ziqing Yang. 2021. Pre-training with whole word masking for chinese bert. IEEE/ACM Transactions on Audio, Speech, and Language Processing 29 (2021), 3504–3514.",
      "doi": "10.1109/taslp.2021.3124365"
    },
    {
      "text": "Michael F Dahlstrom. 2014. Using narratives and storytelling to communicate science with nonexpert audiences. Proceedings of the National Academy of Sciences 111, Supplement 4(2014), 13614–13620.",
      "doi": ""
    },
    {
      "text": "GA Darlington. 2005. Dummy variables. Encyclopedia of biostatistics 3 (2005).",
      "doi": ""
    },
    {
      "text": "Sarah R Davies and Noriko Hara. 2017. Public science in a wired world: How online media are shaping science communication., 563–568 pages.",
      "doi": ""
    },
    {
      "text": "Sarah R Davies and Maja Horst. 2016. Science communication: Culture, identity and citizenship. Springer.",
      "doi": ""
    },
    {
      "text": "Rebecca Davis. 2020. China’s Streamer Bilibili Aims to Embrace a Wider Audience Without Alienating Its Fans. Retrieved July 05, 2022 from https://variety.com/2020/digital/features/china-streaming-bilibili-1234617963/",
      "doi": ""
    },
    {
      "text": "Robyn M Dawes and Bernard Corrigan. 1974. Linear models in decision making.Psychological bulletin 81, 2 (1974), 95.",
      "doi": ""
    },
    {
      "text": "Stéphane Debove, Tobias Füchslin, Tania Louis, and Pierre Masselot. 2021. French Science Communication on YouTube: A Survey of Individual and Institutional Communicators and Their Channel Characteristics. Frontiers in Communication 6 (2021).",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805(2018).",
      "doi": ""
    },
    {
      "text": "Xianghua Ding, Yubo Kou, Yiwen Xu, and Peng Zhang. 2022. “As Uploaders, We Have the Responsibility”: Individualized Professionalization of Bilibili Uploaders. In CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": ""
    },
    {
      "text": "Carsten F Dormann, Jane Elith, Sven Bacher, Carsten Buchmann, Gudrun Carl, Gabriel Carré, Jaime R García Marquéz, Bernd Gruber, Bruno Lafourcade, Pedro J Leitão, 2013. Collinearity: a review of methods to deal with it and a simulation study evaluating their performance. Ecography 36, 1 (2013), 27–46.",
      "doi": ""
    },
    {
      "text": "Ilana Dubovi and Iris Tabak. 2021. Interactions between emotional and cognitive engagement with science on YouTube. Public Understanding of Science 30, 6 (2021), 759–776.",
      "doi": ""
    },
    {
      "text": "John R Durant, Geoffrey A Evans, and Geoffrey P Thomas. 1989. The public understanding of science. Nature 340, 6228 (1989), 11–14.",
      "doi": ""
    },
    {
      "text": "Michelle L Edwards and Caden Ziegler. 2022. Examining science communication on Reddit: From an “Assembled” to a“Disassembling” approach. Public Understanding of Science 31, 4 (2022), 473–488.",
      "doi": ""
    },
    {
      "text": "Daniel Fernández Galeote, Nikoletta-Zampeta Legaki, and Juho Hamari. 2022. Avatar Identities and Climate Change Action in Video Games: Analysis of Mitigation and Adaptation Practices. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": ""
    },
    {
      "text": "Wiebke Finkler and Bienvenido León-Anguiano. 2019. The power of storytelling and video: a visual rhetoric for science communication. (2019).",
      "doi": ""
    },
    {
      "text": "Baruch Fischhoff. 2013. The sciences of science communication. Proceedings of the National Academy of Sciences 110, supplement_3(2013), 14033–14039.",
      "doi": ""
    },
    {
      "text": "Denae Ford, Kristina Lustig, Jeremy Banks, and Chris Parnin. 2018. \"We Don’t Do That Here\": How Collaborative Editing with Mentors Improves Engagement in Social Q&A Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174182",
      "doi": "10.1145/3173574.3174182"
    },
    {
      "text": "William Gardner, Edward P Mulvey, and Esther C Shaw. 1995. Regression analyses of counts and rates: Poisson, overdispersed Poisson, and negative binomial models.Psychological bulletin 118, 3 (1995), 392.",
      "doi": ""
    },
    {
      "text": "Katy Ilonka Gero, Vivian Liu, Sarah Huang, Jennifer Lee, and Lydia B Chilton. 2021. What Makes Tweetorials Tick: How Experts Communicate Complex Topics on Twitter. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–26.",
      "doi": "10.1145/3479566"
    },
    {
      "text": "Noriko Hara, Jessica Abbazio, and Kathryn Perkins. 2019. An emerging form of public engagement with science: Ask Me Anything (AMA) sessions on Reddit r/science. PloS one 14, 5 (2019), e0216789.",
      "doi": ""
    },
    {
      "text": "Changyang He, Lu He, Tun Lu, and Bo Li. 2021. Beyond Entertainment: Unpacking Danmaku and Comments’ Role of Information Sharing and Sentiment Expression in Online Crisis Videos. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–27.",
      "doi": "10.1145/3479555"
    },
    {
      "text": "Linda Hollebeek. 2011. Exploring customer brand engagement: definition and themes. Journal of strategic Marketing 19, 7 (2011), 555–573.",
      "doi": ""
    },
    {
      "text": "Tianle Huang and Will J Grant. 2020. A good story well told: Storytelling components that impact science video popularity on YouTube. Frontiers in Communication 5 (2020), 86.",
      "doi": ""
    },
    {
      "text": "Ridley Jones, Lucas Colusso, Katharina Reinecke, and Gary Hsieh. 2019. rscience: Challenges and opportunities in online science communication. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3290605.3300383"
    },
    {
      "text": "Marina Joubert, Lloyd Davis, and Jennifer Metcalfe. 2019. Storytelling: the soul of science communication., E pages.",
      "doi": ""
    },
    {
      "text": "Dan M Kahan. 2017. ‘Ordinary science intelligence’: A science-comprehension measure for study of risk and science communication, with notes on evolution and climate change. Journal of Risk Research 20, 8 (2017), 995–1016.",
      "doi": ""
    },
    {
      "text": "M Laeeq Khan. 2017. Social media engagement: What motivates user participation and consumption on YouTube?Computers in human behavior 66 (2017), 236–247.",
      "doi": "10.1016/j.chb.2016.09.024"
    },
    {
      "text": "Shahedul Huq Khandkar. 2009. Open coding. University of Calgary 23(2009), 2009.",
      "doi": ""
    },
    {
      "text": "Inna Kouper. 2010. Science blogs and public engagement with science: Practices, challenges, and opportunities. Journal of science communication 9, 1 (2010), A02.",
      "doi": ""
    },
    {
      "text": "Julie Letierce, Alexandre Passant, John Breslin, and Stefan Decker. 2010. Understanding how Twitter is used to spread scientific messages. (2010).",
      "doi": ""
    },
    {
      "text": "Petra J Lewis. 2016. Brain friendly teaching—reducing learner’s cognitive load. Academic radiology 23, 7 (2016), 877–880.",
      "doi": ""
    },
    {
      "text": "Yixuan Li, Oscar Martinez, Xing Chen, Yi Li, and John E Hopcroft. 2016. In a world that counts: Clustering and detecting fake social engagement at scale. In Proceedings of the 25th International Conference on World Wide Web. 111–120.",
      "doi": "10.1145/2872427.2882972"
    },
    {
      "text": "Steve Miller. 2001. Public understanding of science at the crossroads. Public understanding of science 10, 1 (2001), 115–120.",
      "doi": ""
    },
    {
      "text": "Jesús Muñoz Morcillo, Klemens Czurda, Andrea Geipel, and Caroline Y Trotha. 2019. Producers of Popular Science Web Videos. Between New Professionalism and Old Gender Issues. arXiv preprint arXiv:1908.05572(2019).",
      "doi": ""
    },
    {
      "text": "Jesús Muñoz Morcillo, Klemens Czurda, and Caroline Y Trotha. 2015. Typologies of the popular science web video. arXiv preprint arXiv:1506.06149(2015).",
      "doi": ""
    },
    {
      "text": "Vicki Moulder, Lorna R Boschman, Ron Wakkary, Carman Neustaedter, and Hiroki Hill Kobayashi. 2018. HCI interventions for science communication. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3170427.3174357"
    },
    {
      "text": "Arjun Mukherjee, Bing Liu, and Natalie Glance. 2012. Spotting fake reviewer groups in consumer reviews. In Proceedings of the 21st international conference on World Wide Web. 191–200.",
      "doi": "10.1145/2187836.2187863"
    },
    {
      "text": "Sophie A Nicholson-Cole. 2005. Representing climate change futures: a critique on the use of images for visual communication. Computers, environment and urban systems 29, 3 (2005), 255–273.",
      "doi": ""
    },
    {
      "text": "Kristian H Nielsen. 2013. Scientific communication and the nature of science. Science & Education 22, 9 (2013), 2067–2086.",
      "doi": ""
    },
    {
      "text": "Matthew C Nisbet and Dietram A Scheufele. 2009. What’s next for science communication? Promising directions and lingering distractions. American journal of botany 96, 10 (2009), 1767–1778.",
      "doi": ""
    },
    {
      "text": "Web of Science. 2022. Web of Science Core Collection Help. Retrieved Aug 15, 2022 from https://images.webofknowledge.com/images/help/WOS/hp_subject_category_terms_tasca.html",
      "doi": ""
    },
    {
      "text": "Nigini Oliveira, Michael Muller, Nazareno Andrade, and Katharina Reinecke. 2018. The exchange in StackExchange: Divergences between Stack Overflow and its culturally diverse participants. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–22.",
      "doi": "10.1145/3274399"
    },
    {
      "text": "Vineet Pandey, Amnon Amir, Justine Debelius, Embriette R Hyde, Tomasz Kosciolek, Rob Knight, and Scott Klemmer. 2017. Gut instinct: Creating scientific theories with online learners. In Proceedings of the 2017 CHI conference on human factors in computing systems. 6825–6836.",
      "doi": "10.1145/3025453.3025769"
    },
    {
      "text": "Vineet Pandey, Justine Debelius, Embriette R Hyde, Tomasz Kosciolek, Rob Knight, and Scott Klemmer. 2018. Docent: transforming personal intuitions to scientific hypotheses through content learning and process training. In Proceedings of the Fifth Annual ACM Conference on Learning at Scale. 1–10.",
      "doi": "10.1145/3231644.3231646"
    },
    {
      "text": "Mathieu Ranger and Karen Bultitude. 2016. ‘The kind of mildly curious sort of science interested person like me’: Science bloggers’ practices relating to audience recruitment. Public Understanding of Science 25, 3 (2016), 361–378.",
      "doi": ""
    },
    {
      "text": "Cathelijne M Reincke, Annelien L Bredenoord, and Marc HW van Mil. 2020. From deficit to dialogue in science communication: the dialogue communication model requires additional roles from scientists. EMBO reports 21, 9 (2020), e51278.",
      "doi": ""
    },
    {
      "text": "Fabiola Cristina Rodríguez Estradaand Lloyd Spencer Davis. 2015. Improving visual communication of science through the incorporation of graphic design theories and practices into science communication. Science Communication 37, 1 (2015), 140–148.",
      "doi": ""
    },
    {
      "text": "Alexander Romiszowski and Robin Mason. 2013. Computer-mediated communication. In Handbook of research on educational communications and technology. Routledge, 402–436.",
      "doi": ""
    },
    {
      "text": "Selina A Ruzi, Nicole M Lee, and Adrian A Smith. 2021. Testing how different narrative perspectives achieve communication objectives and goals in online natural science videos. PloS one 16, 10 (2021), e0257866.",
      "doi": ""
    },
    {
      "text": "Molly J Simis, Haley Madden, Michael A Cacciatore, and Sara K Yeo. 2016. The lure of rationality: Why does the deficit model persist in science communication?Public understanding of science 25, 4 (2016), 400–414.",
      "doi": ""
    },
    {
      "text": "Patrick Sturgis and Nick Allum. 2004. Science in society: re-evaluating the deficit model of public attitudes. Public understanding of science 13, 1 (2004), 55–74.",
      "doi": ""
    },
    {
      "text": "John Sweller. 1994. Cognitive load theory, learning difficulty, and instructional design. Learning and instruction 4, 4 (1994), 295–312.",
      "doi": ""
    },
    {
      "text": "Mike Thelwall, Pardeep Sud, and Farida Vis. 2012. Commenting on YouTube videos: From Guatemalan rock to el big bang. Journal of the American society for information science and technology 63, 3 (2012), 616–629.",
      "doi": "10.1002/asi.21679"
    },
    {
      "text": "Jean Trumbo. 1999. Visual literacy and science communication. Science communication 20, 4 (1999), 409–425.",
      "doi": ""
    },
    {
      "text": "Dustin J Welbourne and Will J Grant. 2016. Science communication on YouTube: Factors that affect channel and video popularity. Public understanding of science 25, 6 (2016), 706–718.",
      "doi": ""
    },
    {
      "text": "Spencer Williams and Gary Hsieh. 2021. The Effects of User Comments on Science News Engagement. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–29.",
      "doi": "10.1145/3449106"
    },
    {
      "text": "Spencer Williams, Ridley Jones, Katharina Reinecke, and Gary Hsieh. 2022. An HCI Research Agenda for Online Science Communication. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–22.",
      "doi": "10.1145/3555591"
    },
    {
      "text": "Stephan Winter and Nicole C. Krämer. 2016. Who’s right: The author or the audience? Effects of user comments and ratings on the perception of online science articles. Communications 41, 3 (2016), 339–360. https://doi.org/10.1515/commun-2016-0008",
      "doi": ""
    },
    {
      "text": "Qunfang Wu, Yisi Sang, Shan Zhang, and Yun Huang. 2018. Danmaku vs. forum comments: understanding user participation and knowledge sharing in online videos. In Proceedings of the 2018 ACM conference on supporting groupwork. 209–218.",
      "doi": "10.1145/3148330.3148344"
    },
    {
      "text": "Haijun Xia, Hui Xin Ng, Zhutian Chen, and James Hollan. 2022. Millions and Billions of Views: Understanding Popular Science and Knowledge Communication on Video-Sharing Platforms. In Proceedings of the Ninth ACM Conference on Learning@ Scale. 163–174.",
      "doi": "10.1145/3491140.3528279"
    },
    {
      "text": "Shiyu Yang, Dominique Brossard, Dietram A Scheufele, and Michael A Xenos. 2022. The science of YouTube: What factors influence user engagement with online science videos?Plos one 17, 5 (2022), e0267697.",
      "doi": ""
    },
    {
      "text": "Yang Yuyu and Zhang Pengyi. 2020. Social Tagging of ACG Video Contents and the Entertainment Tagging Trend: A Case Study of Bilibili. com. Library and Information Service 64, 8 (2020), 125.",
      "doi": ""
    },
    {
      "text": "Yiqiong Zhang, Susan Herring, and Suifu Gan. 2022. Graphicon Evolution on the Chinese Social Media Platform BiliBili. In Proceedings of the The Fifth International Workshop on Emoji Understanding and Applications in Social Media. 75–85.",
      "doi": ""
    }
  ]
}