{
  "doi": "10.1145/3544548.3580699",
  "title": "ReMotion: Supporting Remote Collaboration in Open Space with Automatic Robotic Embodiment",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Design activities, such as brainstorming or critique, often take place in open spaces combining whiteboards and tables to present artefacts. In co-located settings, peripheral awareness enables participants to understand each other’s locus of attention with ease. However, these spatial cues are mostly lost while using videoconferencing tools. Telepresence robots could bring back a sense of presence, but controlling them is distracting. To address this problem, we present ReMotion, a fully automatic robotic proxy designed to explore a new way of supporting non-collocated open-space design activities. ReMotion combines a commodity body tracker (Kinect) to capture a user’s location and orientation over a wide area with a minimally invasive wearable system (NeckFace) to capture facial expressions. Due to its omnidirectional platform, ReMotion embodiment can render a wide range of body movements. A formative evaluation indicated that our system enhances the sharing of attention and the sense of co-presence enabling seamless movement-in-space during a design review task.",
  "authors": [
    {
      "name": "Mose Sakashita",
      "institution": "Information Science, Cornell University, United States",
      "img": "/do/10.1145/contrib-99659050789/rel-imgonly/sakashita-mose-cropped.png",
      "acmid": "99659050789",
      "orcid": "0000-0003-4953-2027"
    },
    {
      "name": "Ruidong Zhang",
      "institution": "Information Science, Cornell University, United States",
      "img": "/do/10.1145/contrib-99659765664/rel-imgonly/profile_square_zoomin.jpg",
      "acmid": "99659765664",
      "orcid": "0000-0001-8329-0522"
    },
    {
      "name": "Xiaoyi Li",
      "institution": "Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783573",
      "orcid": "0000-0002-4734-6207"
    },
    {
      "name": "Hyunju Kim",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781826",
      "orcid": "0000-0001-8465-6442"
    },
    {
      "name": "Michael Russo",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783019",
      "orcid": "0000-0002-0069-5733"
    },
    {
      "name": "Cheng Zhang",
      "institution": "Computing and Information Science, Cornell University, United States",
      "img": "/do/10.1145/contrib-81488647680/rel-imgonly/cheng_pic.jpeg",
      "acmid": "81488647680",
      "orcid": "0000-0002-5079-5927"
    },
    {
      "name": "Malte F. Jung",
      "institution": "Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758949457",
      "orcid": "0000-0001-9359-7122"
    },
    {
      "name": "François Guimbretière",
      "institution": "Information Science, Cornell University, United States",
      "img": "/do/10.1145/contrib-81100301845/rel-imgonly/81100301845.jpg",
      "acmid": "81100301845",
      "orcid": "0000-0002-5510-6799"
    }
  ],
  "references": [
    {
      "text": "S. O. Adalgeirsson and C. Breazeal. 2010. MeBot: A robotic platform for socially embodied telepresence. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI). 15–22. https://doi.org/10.1109/HRI.2010.5453272",
      "doi": ""
    },
    {
      "text": "Ignacio Avellino, Cédric Fleury, Wendy E. Mackay, and Michel Beaudouin-Lafon. 2017. CamRay: Camera Arrays Support Remote Collaboration on Wall-Sized Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6718–6729. https://doi.org/10.1145/3025453.3025604",
      "doi": "10.1145/3025453.3025604"
    },
    {
      "text": "Michael Baker, Tia Hansen, Richard Joiner, and David Traum. 1999. The Role Of Grounding In Collaborative Learning Tasks.",
      "doi": ""
    },
    {
      "text": "Beam. 2023. Suitable Technologies Inc. Retrieved Feb 6, 2023 from https://suitabletech.com",
      "doi": ""
    },
    {
      "text": "S. Beck, A. Kunert, A. Kulik, and B. Froehlich. 2013. Immersive Group-to-Group Telepresence. IEEE Transactions on Visualization and Computer Graphics 19, 4 (April 2013), 616–625. https://doi.org/10.1109/TVCG.2013.33",
      "doi": "10.1109/TVCG.2013.33"
    },
    {
      "text": "Michael Beetz, Freek Stulp, Piotr Esden-Tempski, Andreas Fedrizzi, Ulrich Klank, Ingo Kresse, Alexis Maldonado, and Federico Ruiz-Ugalde. 2010. Generality and legibility in mobile manipulation. Autonomous Robots 28(2010), 21–44.",
      "doi": "10.1007/s10514-009-9152-9"
    },
    {
      "text": "Jacob T. Biehl, Daniel Avrahami, and Anthony Dunnigan. 2015. Not Really There: Understanding Embodied Communication Affordances in Team Perception and Participation. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). ACM, New York, NY, USA, 1567–1575. https://doi.org/10.1145/2675133.2675220",
      "doi": "10.1145/2675133.2675220"
    },
    {
      "text": "Frank Biocca, Chad Harms, and Jenn Gregg. 2001. The networked minds measure of social presence: Pilot test of the factor structure and concurrent validity. In 4th annual international workshop on presence, Philadelphia, PA. 1–9.",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2009. Mediaspace – Meaningspace – Meetingspace. Springer London, London, 217–231. https://doi.org/10.1007/978-1-84882-483-6_13",
      "doi": ""
    },
    {
      "text": "William A. S. Buxton. 1992. Telepresence: Integrating Shared Task and Person Spaces. In Proceedings of the Conference on Graphics Interface ’92 (Vancouver, British Columbia, Canada). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 123–129.",
      "doi": "10.5555/155294.155309"
    },
    {
      "text": "G. Campion, G. Bastin, and B. Dandrea-Novel. 1996. Structural properties and classification of kinematic and dynamic models of wheeled mobile robots. IEEE Transactions on Robotics and Automation 12, 1(1996), 47–62. https://doi.org/10.1109/70.481750",
      "doi": ""
    },
    {
      "text": "Tuochao Chen, Yaxuan Li, Songyun Tao, Hyunchul Lim, Mose Sakashita, Ruidong Zhang, Francois Guimbretiere, and Cheng Zhang. 2021. NeckFace: Continuously Tracking Full Facial Expressions on Neck-mounted Wearables. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5 (06 2021), 1–31. https://doi.org/10.1145/3463511",
      "doi": "10.1145/3463511"
    },
    {
      "text": "Munjal Desai, Katherine M. Tsui, Holly A. Yanco, and Chris Uhlik. 2011. Essential features of telepresence robots. In 2011 IEEE Conference on Technologies for Practical Robot Applications. 15–20. https://doi.org/10.1109/TEPRA.2011.5753474",
      "doi": ""
    },
    {
      "text": "N.J. Emery. 2000. The eyes have it: the neuroethology, function and evolution of social gaze. Neuroscience & Biobehavioral Reviews 24, 6 (2000), 581–604. https://doi.org/10.1016/S0149-7634(00)00025-7",
      "doi": ""
    },
    {
      "text": "Chris D Frith and Uta Frith. 2008. Implicit and explicit processes in social cognition. Neuron 60, 3 (2008), 503–510.",
      "doi": ""
    },
    {
      "text": "Guy Gafni, Justus Thies, Michael Zollhofer, and Matthias Niessner. 2021. Dynamic Neural Radiance Fields for Monocular 4D Facial Avatar Reconstruction. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). 8649–8658.",
      "doi": ""
    },
    {
      "text": "C. Gutwin and S. Greenberg. 2004. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Computer Supported Cooperative Work (CSCW) 11 (2004), 411–446.",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Carl Gutwin, Saul Greenberg, and Mark Roseman. 1996. Workspace Awareness in Real-Time Distributed Groupware: Framework, Widgets, and Evaluation. In People and Computers XI, Martina Angela Sasse, R. Jim Cunningham, and Russel L. Winder (Eds.). Springer London, London, 281–298.",
      "doi": ""
    },
    {
      "text": "Edmund T Hall and Edward Twitchell Hall. 1966. The hidden dimension. Vol. 609. Anchor.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Human mental workload 1, 3 (1988), 139–183.",
      "doi": ""
    },
    {
      "text": "Zhenyi He, Keru Wang, Brandon Yushan Feng, Ruofei Du, and Ken Perlin. 2021. GazeChat: Enhancing Virtual Conferences with Gaze-Aware 3D Photos. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 769–782. https://doi.org/10.1145/3472749.3474785",
      "doi": "10.1145/3472749.3474785"
    },
    {
      "text": "Yasamin Heshmat, Brennan Jones, Xiaoxuan Xiong, Carman Neustaedter, Anthony Tang, Bernhard E. Riecke, and Lillian Yang. 2018. Geocaching with a Beam: Shared Outdoor Activities through a Telepresence Robot with 360 Degree Viewing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173933",
      "doi": "10.1145/3173574.3173933"
    },
    {
      "text": "Keita Higuchi, Yinpeng Chen, Philip A. Chou, Zhengyou Zhang, and Zicheng Liu. 2015. ImmerseBoard: Immersive Telepresence Experience Using a Digital Whiteboard. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 2383–2392. https://doi.org/10.1145/2702123.2702160",
      "doi": "10.1145/2702123.2702160"
    },
    {
      "text": "Ryosuke Hori, Ryo Hachiuma, Hideo Saito, Mariko Isogawa, and Dan Mikami. 2021. Silhouette-Based Synthetic Data Generation For 3D Human Pose Estimation With A Single Wrist-Mounted 360° Camera. In 2021 IEEE International Conference on Image Processing (ICIP). IEEE, 1304–1308.",
      "doi": ""
    },
    {
      "text": "Dong-Hyun Hwang, Kohei Aso, Ye Yuan, Kris Kitani, and Hideki Koike. 2020. Monoeye: Multimodal human motion capture system using a single ultra-wide fisheye camera. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 98–111.",
      "doi": "10.1145/3379337.3415856"
    },
    {
      "text": "Xandex Inc.2023. KUBI Telepresence Robot. Retrieved Feb 6, 2023 from https://kubiconnect.com/",
      "doi": ""
    },
    {
      "text": "Zoom Video Communications Inc.2023. One platform to connect. Retrieved Feb 6, 2023 from https://zoom.us",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Minoru Kobayashi. 1992. ClearBoard: A Seamless Medium for Shared Drawing and Conversation with Eye Contact. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 525–532. https://doi.org/10.1145/142750.142977",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Brennan Jones, Yaying Zhang, Priscilla N. Y. Wong, and Sean Rintel. 2021. Belonging There: VROOM-Ing into the Uncanny Valley of XR Telepresence. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 59 (apr 2021), 31 pages. https://doi.org/10.1145/3449133",
      "doi": "10.1145/3449133"
    },
    {
      "text": "Wendy Ju, Lawrence Neeley, Terry Winograd, and Larry Leifer. 2006. Thinking with Erasable Ink: Ad-hoc Whiteboard Use in Collaborative Design. Technical Report.",
      "doi": ""
    },
    {
      "text": "Ikkaku Kawaguchi, Hideaki Kuzuoka, and Yusuke Suzuki. 2015. Study on Gaze Direction Perception of Face Image Displayed on Rotatable Flat Display. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 1729–1737. https://doi.org/10.1145/2702123.2702369",
      "doi": "10.1145/2702123.2702369"
    },
    {
      "text": "Terry K Koo and Mae Y Li. 2016. A guideline of selecting and reporting intraclass correlation coefficients for reliability research. Journal of chiropractic medicine 15, 2 (2016), 155–163.",
      "doi": ""
    },
    {
      "text": "Sven Kratz and Fred Rabelo Ferriera. 2016. Immersed remotely: Evaluating the use of Head Mounted Devices for remote collaboration in robotic telepresence. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). 638–645. https://doi.org/10.1109/ROMAN.2016.7745185",
      "doi": "10.1109/ROMAN.2016.7745185"
    },
    {
      "text": "Hideaki Kuzuoka, Shinya Oyama, Keiichi Yamazaki, Kenji Suzuki, and Mamoru Mitsuishi. 2000. GestureMan: A Mobile Robot That Embodies a Remote Instructor’s Actions. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (Philadelphia, Pennsylvania, USA) (CSCW ’00). Association for Computing Machinery, New York, NY, USA, 155–162. https://doi.org/10.1145/358916.358986",
      "doi": "10.1145/358916.358986"
    },
    {
      "text": "Min Kyung Lee and Leila Takayama. 2011. \"Now, I Have a Body\": Uses and Social Norms for Mobile Remote Presence in the Workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 33–42. https://doi.org/10.1145/1978942.1978950",
      "doi": "10.1145/1978942.1978950"
    },
    {
      "text": "Hyunchul Lim, Yaxuan Li, Matthew Dressa, Fang Hu, Jae Hoon Kim, Ruidong Zhang, and Cheng Zhang. 2022. BodyTrak: Inferring Full-Body Poses from Body Silhouettes Using a Miniature Camera on a Wristband. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 3, Article 154 (sep 2022), 21 pages. https://doi.org/10.1145/3552312",
      "doi": "10.1145/3552312"
    },
    {
      "text": "Lingjie Liu, Marc Habermann, Viktor Rudnev, Kripasindhu Sarkar, Jiatao Gu, and Christian Theobalt. 2021. Neural Actor: Neural Free-View Synthesis of Human Actors with Pose Control. ACM Trans. Graph. 40, 6, Article 219 (dec 2021), 16 pages. https://doi.org/10.1145/3478513.3480528",
      "doi": "10.1145/3478513.3480528"
    },
    {
      "text": "Douglas G. Macharet and Dinei A. Florencio. 2012. A collaborative control system for telepresence robots. In 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems. 5105–5111. https://doi.org/10.1109/IROS.2012.6385705",
      "doi": ""
    },
    {
      "text": "Evelyn Z. McClave. 2000. Linguistic functions of head movements in the context of speech. Journal of Pragmatics 32, 7 (2000), 855–878. https://doi.org/10.1016/S0378-2166(99)00079-X",
      "doi": ""
    },
    {
      "text": "Microsoft. 2023. Azure Kinect DK - develop AI models: Microsoft Azure. Retrieved Feb 6, 2023 from https://azure.microsoft.com/en-us/services/kinect-dk/",
      "doi": ""
    },
    {
      "text": "Mirror. 2023. Mirror Networking – Open Source Networking for Unity. Retrieved Feb 6, 2023 from https://mirror-networking.com/",
      "doi": ""
    },
    {
      "text": "Kana Misawa, Yoshio Ishiguro, and Jun Rekimoto. 2012. LiveMask: A Telepresence Surrogate System with a Face-Shaped Screen for Supporting Nonverbal Communication. In Proceedings of the International Working Conference on Advanced Visual Interfaces (Capri Island, Italy) (AVI ’12). Association for Computing Machinery, New York, NY, USA, 394–397. https://doi.org/10.1145/2254556.2254632",
      "doi": "10.1145/2254556.2254632"
    },
    {
      "text": "Pieter Moors, Filip Germeys, Iwona Pomianowska, and Karl Verfaillie. 2015. Perceiving where another person is looking: the integration of head and body information in estimating another person’s gaze. Frontiers in Psychology 6 (2015). https://doi.org/10.3389/fpsyg.2015.00909",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter, Gina Venolia, Jason Procyk, and Daniel Hawkins. 2016. To Beam or Not to Beam: A Study of Remote Telepresence Attendance at an Academic Conference. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 418–431. https://doi.org/10.1145/2818048.2819922",
      "doi": "10.1145/2818048.2819922"
    },
    {
      "text": "David Nguyen, John Canny, and John Canny. 2005. MultiView: Spatially Faithful Group Video Conferencing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Portland, Oregon, USA) (CHI ’05). ACM, New York, NY, USA, 799–808. https://doi.org/10.1145/1054972.1055084",
      "doi": "10.1145/1054972.1055084"
    },
    {
      "text": "Ken-Ichi Okada, Fumihiko Maeda, Yusuke Ichikawaa, and Yutaka Matsushita. 1994. Multiparty Videoconferencing at Virtual Social Distance: MAJIC Design. In Proceedings of the 1994 ACM Conference on Computer Supported Cooperative Work (Chapel Hill, North Carolina, USA) (CSCW ’94). ACM, New York, NY, USA, 385–393. https://doi.org/10.1145/192844.193054",
      "doi": "10.1145/192844.193054"
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L. Davidson, Sameh Khamis, Mingsong Dou, Vladimir Tankovich, Charles Loop, Qin Cai, Philip A. Chou, Sarah Mennicken, Julien Valentin, Vivek Pradeep, Shenlong Wang, Sing Bing Kang, Pushmeet Kohli, Yuliya Lutchyn, Cem Keskin, and Shahram Izadi. 2016. Holoportation: Virtual 3D Teleportation in Real-time. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). ACM, New York, NY, USA, 741–754. https://doi.org/10.1145/2984511.2984517",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "K. Otsuka. 2016. MMSpace: Kinetically-augmented telepresence for small group-to-group conversations. In 2016 IEEE Virtual Reality (VR). 19–28. https://doi.org/10.1109/VR.2016.7504684",
      "doi": ""
    },
    {
      "text": "Ye Pan and Anthony Steed. 2014. A Gaze-preserving Situated Multiview Telepresence System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 2173–2176. https://doi.org/10.1145/2556288.2557320",
      "doi": "10.1145/2556288.2557320"
    },
    {
      "text": "Eric Paulos and John Canny. 1998. PRoP: Personal Roving Presence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Los Angeles, California, USA) (CHI ’98). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 296–303. https://doi.org/10.1145/274644.274686",
      "doi": "10.1145/274644.274686"
    },
    {
      "text": "Tomislav Pejsa, Julian Kantor, Hrvoje Benko, Eyal Ofek, and Andrew Wilson. 2016. Room2Room: Enabling Life-Size Telepresence in a Projected Augmented Reality Environment. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). ACM, New York, NY, USA, 1716–1725. https://doi.org/10.1145/2818048.2819965",
      "doi": "10.1145/2818048.2819965"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A. Lee, Jonathon D. Hart, Barrett Ens, Robert W. Lindeman, Bruce H. Thomas, and Mark Billinghurst. 2018. Mini-Me: An Adaptive Avatar for Mixed Reality Remote Collaboration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 46, 13 pages. https://doi.org/10.1145/3173574.3173620",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "Thammathip Piumsomboon, Youngho Lee, Gun Lee, and Mark Billinghurst. 2017. CoVAR: A Collaborative Virtual and Augmented Reality System for Remote Collaboration. In SIGGRAPH Asia 2017 Emerging Technologies(Bangkok, Thailand) (SA ’17). Association for Computing Machinery, New York, NY, USA, Article 3, 2 pages. https://doi.org/10.1145/3132818.3132822",
      "doi": "10.1145/3132818.3132822"
    },
    {
      "text": "Irene Rae, Bilge Mutlu, and Leila Takayama. 2014. Bodies in Motion: Mobility, Presence, and Task Awareness in Telepresence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 2153–2162. https://doi.org/10.1145/2556288.2557047",
      "doi": "10.1145/2556288.2557047"
    },
    {
      "text": "Irene Rae, Leila Takayama, and Bilge Mutlu. 2012. One of the Gang: Supporting in-Group Behavior for Embodied Mediated Communication. Association for Computing Machinery, New York, NY, USA, 3091–3100. https://doi-org.proxy.library.cornell.edu/10.1145/2207676.2208723",
      "doi": ""
    },
    {
      "text": "Irene Rae, Leila Takayama, and Bilge Mutlu. 2013. The Influence of Height in Robot-mediated Communication. In Proceedings of the 8th ACM/IEEE International Conference on Human-robot Interaction (Tokyo, Japan) (HRI ’13). IEEE Press, Piscataway, NJ, USA, 1–8. http://dl.acm.org/citation.cfm?id=2447556.2447558",
      "doi": "10.5555/2447556.2447558"
    },
    {
      "text": "Lorenzo Riano, Christopher Burbridge, and TM McGinnity. 2011. A Study of Enhanced Robot Autonomy in Telepresence. In Unknown Host Publication. AICS, Ireland. Proceedings of Artificial Intelligence and Cognitive Systems, AICS ; Conference date: 01-01-2011.",
      "doi": ""
    },
    {
      "text": "Double Robotics. 2023. Telepresence Robot for the Hybrid Office. Retrieved Feb 6, 2023 from https://www.doublerobotics.com/",
      "doi": ""
    },
    {
      "text": "Mose Sakashita, E. Andy Ricci, Jatin Arora, and François Guimbretière. 2022. RemoteCoDe: Robotic Embodiment for Enhancing Peripheral Awareness in Remote Collaboration Tasks. Proc. ACM Hum.-Comput. Interact. 6, CSCW1, Article 63 (apr 2022), 22 pages. https://doi.org/10.1145/3512910",
      "doi": "10.1145/3512910"
    },
    {
      "text": "Avatar SDK. 2023. Realistic avatars for games, VR and AR. Lifelike avatars for the metaverse. Retrieved Feb 6, 2023 from https://avatarsdk.com/",
      "doi": ""
    },
    {
      "text": "Abigail J. Sellen. 1992. Speech Patterns in Video-mediated Conversations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). ACM, New York, NY, USA, 49–59. https://doi.org/10.1145/142750.142756",
      "doi": "10.1145/142750.142756"
    },
    {
      "text": "Stephen Siemonsma and Tyler Bell. 2022. HoloKinect: Holographic 3D Video Conferencing. Sensors 22, 21 (2022), 8118.",
      "doi": ""
    },
    {
      "text": "David Sirkin, Gina Venolia, John Tang, George Robertson, Taemie Kim, Kori Inkpen, Mara Sedlins, Bongshin Lee, and Mike Sinclair. 2011. Motion and Attention in a Kinetic Videoconferencing Proxy. In Proceedings of the 13th IFIP TC 13 International Conference on Human-computer Interaction - Volume Part I(Lisbon, Portugal) (INTERACT’11). Springer-Verlag, Berlin, Heidelberg, 162–180. http://dl.acm.org/citation.cfm?id=2042053.2042074",
      "doi": ""
    },
    {
      "text": "Brett Stoll, Samantha Reig, Lucy He, Ian Kaplan, Malte F. Jung, and Susan R. Fussell. 2018. Wait, Can You Move the Robot? Examining Telepresence Robot Use in Collaborative Teams. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (Chicago, IL, USA) (HRI ’18). Association for Computing Machinery, New York, NY, USA, 14–22. https://doi.org/10.1145/3171221.3171243",
      "doi": "10.1145/3171221.3171243"
    },
    {
      "text": "Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative Coupling over Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 1181–1190. https://doi.org/10.1145/1124772.1124950",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "John C. Tang and Scott Minneman. 1991. VideoWhiteboard: Video Shadows to Support Remote Collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New Orleans, Louisiana, USA) (CHI ’91). ACM, New York, NY, USA, 315–322. https://doi.org/10.1145/108844.108932",
      "doi": "10.1145/108844.108932"
    },
    {
      "text": "Richard M Taylor. 2017. Situational awareness rating technique (SART): The development of a tool for aircrew systems design. In Situational awareness. Routledge, 111–128.",
      "doi": ""
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Fraser Anderson, George Fitzmaurice, Bjoern Hartmann, and Tovi Grossman. 2019. Loki: Facilitating Remote Instruction of Physical Tasks Using Bi-Directional Mixed-Reality Telepresence. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 161–174. https://doi.org/10.1145/3332165.3347872",
      "doi": "10.1145/3332165.3347872"
    },
    {
      "text": "Tobii. 2022. Global leader in eye tracking for over 20 years. Retrieved Feb 6, 2023 from https://www.tobii.com/",
      "doi": ""
    },
    {
      "text": "Katherine M. Tsui and Holly A. Yanco. 2013. Design Challenges and Guidelines for Social Interaction Using Mobile Telepresence Robots. Reviews of Human Factors and Ergonomics 9, 1 (2013), 227–301. https://doi.org/10.1177/1557234X13502462 arXiv:https://doi.org/10.1177/1557234X13502462",
      "doi": ""
    },
    {
      "text": "Roel Vertegaal. 1999. The GAZE Groupware System: Mediating Joint Attention in Multiparty Communication and Collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Pittsburgh, Pennsylvania, USA) (CHI ’99). Association for Computing Machinery, New York, NY, USA, 294–301. https://doi.org/10.1145/302979.303065",
      "doi": "10.1145/302979.303065"
    },
    {
      "text": "Simon Voelker, Sebastian Hueber, Christian Holz, Christian Remy, and Nicolai Marquardt. 2020. GazeConduits: Calibration-Free Cross-Device Collaboration through Gaze and Touch. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376578",
      "doi": "10.1145/3313831.3376578"
    },
    {
      "text": "Wei-Chao Wen, H. Towles, L. Nyland, G. Welch, and H. Fuchs. 2000. Toward a compelling sensation of telepresence: demonstrating a portal to a distant (static) office. In Proceedings Visualization 2000. VIS 2000 (Cat. No.00CH37145). 327–333. https://doi.org/10.1109/VISUAL.2000.885712",
      "doi": ""
    },
    {
      "text": "Nicole Yankelovich, Nigel Simpson, Jonathan Kaplan, and Joe Provino. 2007. Porta-person: Telepresence for the Connected Conference Room. In CHI ’07 Extended Abstracts on Human Factors in Computing Systems (San Jose, CA, USA) (CHI EA ’07). ACM, New York, NY, USA, 2789–2794. https://doi.org/10.1145/1240866.1241080",
      "doi": "10.1145/1240866.1241080"
    },
    {
      "text": "Guangtao Zhang, John Paulin Hansen, Katsumi Minakata, Alexandre Alapetite, and Zhongyu Wang. 2019. Eye-Gaze-Controlled Telepresence Robots for People with Motor Disabilities. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI). 574–575. https://doi.org/10.1109/HRI.2019.8673093",
      "doi": ""
    },
    {
      "text": "Jakob Zillner, Christoph Rhemann, Shahram Izadi, and Michael Haller. 2014. 3D-Board: A Whole-Body Remote Collaborative Whiteboard. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 471–479. https://doi.org/10.1145/2642918.2647393",
      "doi": "10.1145/2642918.2647393"
    }
  ]
}