{
  "doi": "10.1145/3544548.3581571",
  "title": "AdaCAD: Parametric Design as a New Form of Notation for Complex Weaving",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Woven textiles are increasingly a medium through which HCI is inventing new technologies. Key challenges in integrating woven textiles in HCI include the high level of textile knowledge required to make effective use of the new possibilities they afford and the need for tools that bridge the concerns of textile designers and concerns of HCI researchers. This paper presents AdaCAD, a parametric design tool for designing woven textile structures. Through our design and evaluation of AdaCAD we found that parametric design helps weavers notate and explain the logics behind the complex structures they generate. We discuss these finding in relation to prior work in integrating craft and/or weaving in HCI, histories of woven notation, and boundary object theory to illuminate further possibilities for collaboration between craftspeople and HCI practitioners.",
  "authors": [
    {
      "name": "Laura Devendorf",
      "institution": "ATLAS Institute & Information Science, University of Colorado Boulder, United States",
      "img": "/do/10.1145/contrib-81557677456/rel-imgonly/laura_devendorf14ga.jpg",
      "acmid": "81557677456",
      "orcid": "0000-0002-3656-7936"
    },
    {
      "name": "Kathryn Walters",
      "institution": "The Swedish School of Textiles, University of Borås, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778112",
      "orcid": "0000-0003-0359-6738"
    },
    {
      "name": "Marianne Fairbanks",
      "institution": "Design Studies, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781795",
      "orcid": "0000-0002-8234-1970"
    },
    {
      "name": "Etta Sandry",
      "institution": "Concordia University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660481269",
      "orcid": "0000-0002-8866-4308"
    },
    {
      "name": "Emma R Goodwill",
      "institution": "Atlas Institute, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782770",
      "orcid": "0000-0002-5028-3120"
    }
  ],
  "references": [
    {
      "text": "2012. Complex Weavers – Encouraging curiosity, exploration, and innovation in weaving. https://www.complex-weavers.org/",
      "doi": ""
    },
    {
      "text": "2017. WeavePoint | Weaving software. http://www.weavepoint.com/",
      "doi": ""
    },
    {
      "text": "2018. Woven Signals. http://emeteuz.com/woven-signals/",
      "doi": ""
    },
    {
      "text": "2022. Arahne CAD/CAM for weaving | ArahWeave. https://www.arahne.si/products/arahweave/",
      "doi": ""
    },
    {
      "text": "2022. Fiberworks PCW, Weaving Software. http://www.fiberworks-pcw.com/",
      "doi": ""
    },
    {
      "text": "2022. Knitout. https://knit.work/knitout/",
      "doi": ""
    },
    {
      "text": "2022. notation | The Chicago School of Media Theory. https://lucian.uchicago.edu/blogs/mediatheory/keywords/notation/",
      "doi": ""
    },
    {
      "text": "2022. PEmbroider. https://github.com/CreativeInquiry/PEmbroider",
      "doi": ""
    },
    {
      "text": "2022. ScotWeave software for Dobby and Jacquard designers. http://www.scotweave.com",
      "doi": ""
    },
    {
      "text": "2022. Textile CAD Software - Weaving Program - Surface Printing - Pointcarre CAD. http://www.pointcarre.com/",
      "doi": ""
    },
    {
      "text": "2022. vvvv - a multipurpose toolkit. https://vvvv.org/documentation/vvvv-a-multipurpose-toolkit",
      "doi": ""
    },
    {
      "text": "2022. What is Max? | Cycling ’74. https://cycling74.com/products/max",
      "doi": ""
    },
    {
      "text": "2023. AdaCAD. https://github.com/UnstableDesign/AdaCAD original-date: 2018-10-04T21:34:26Z.",
      "doi": ""
    },
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. 2019. Digital Fabrication of Soft Actuated Objects by Machine Knitting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300414",
      "doi": "10.1145/3290605.3300414"
    },
    {
      "text": "Lea Albaugh, Scott E. Hudson, Lining Yao, and Laura Devendorf. 2020. Investigating Underdetermination Through Interactive Computational Handweaving. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). Association for Computing Machinery, New York, NY, USA, 1033–1046. https://doi.org/10.1145/3357236.3395538",
      "doi": "10.1145/3357236.3395538"
    },
    {
      "text": "Lea Albaugh, James McCann, Lining Yao, and Scott E. Hudson. 2021. Enabling Personal Computational Handweaving with a Low-Cost Jacquard Loom. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3411764.3445750",
      "doi": "10.1145/3411764.3445750"
    },
    {
      "text": "Anni Albers. 2017. On Weaving: New Expanded Edition. Princeton University Press. https://doi.org/10.1515/9781400889044 Publication Title: On Weaving.",
      "doi": ""
    },
    {
      "text": "Sharon Alderman. 2004. Mastering Weave Structures: Transforming Ideas into Great Cloth. Interweave Press, Loveland, CO.",
      "doi": ""
    },
    {
      "text": "Robert McNeel & Associates. 2022. Grasshopper - New in Rhino 6. https://www.rhino3d.com/6/new/grasshopper/",
      "doi": ""
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by Making Strange: Defamiliarization and the Design of Domestic Technologies. ACM Trans. Comput.-Hum. Interact. 12, 2 (jun 2005), 149–173. https://doi.org/10.1145/1067860.1067862",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Louise P. Brown. 2022. TexGen. In Advanced Weaving Technology, Yordan Kyosev and Francois Boussu (Eds.). Springer International Publishing, Cham, 253–291. https://doi.org/10.1007/978-3-030-91515-5_6",
      "doi": ""
    },
    {
      "text": "Dorothy K. Burnham. 1980. Warp and weft : a textile terminology. Toronto : Royal Ontario Museum. http://archive.org/details/warpwefttextilet0000burn",
      "doi": ""
    },
    {
      "text": "Alice Buso, Holly McQuillan, Kaspar Jansen, and Elvin Karana. 2022. The unfolding of textileness in animated textiles: An exploration of woven textile-forms. DRS Biennial Conference Series (June 2022). https://dl.designresearchsociety.org/drs-conference-papers/drs2022/researchpapers/208",
      "doi": ""
    },
    {
      "text": "Daniel Davis. 2013. A History of Parametric. https://www.danieldavis.com/a-history-of-parametric/",
      "doi": ""
    },
    {
      "text": "Himani Deshpande, Haruki Takahashi, and Jeeeun Kim. 2021. EscapeLoom: Fabricating New Affordances for Hand Weaving. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3411764.3445600",
      "doi": "10.1145/3411764.3445600"
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). ACM, New York, NY, USA, 753–764. https://doi.org/10.1145/3196709.3196781 event-place: Hong Kong, China.",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "Laura Devendorf. 2020. woven 2D position sensor. https://etextile-summercamp.org/swatch-exchange/woven-2d-position-sensor/",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Katya Arquilla, Sandra Wirtanen, Allison Anderson, and Steven Frost. 2020. Craftspeople as Technical Collaborators: Lessons Learned through an Experimental Weaving Residency. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376820",
      "doi": "10.1145/3313831.3376820"
    },
    {
      "text": "Laura Devendorf, Sasha de Koninck, and Etta Sandry. 2022. An Introduction to Weave Structure for HCI: A How-to and Reflection on Modes of Exchange. In Designing Interactive Systems Conference(DIS ’22). Association for Computing Machinery, New York, NY, USA, 629–642. https://doi.org/10.1145/3532106.3534567",
      "doi": "10.1145/3532106.3534567"
    },
    {
      "text": "Laura Devendorf and Chad Di Lauro. 2019. Adapting Double Weaving and Yarn Plying Techniques for Smart Textiles Applications. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’19). ACM, New York, NY, USA, 77–85. https://doi.org/10.1145/3294109.3295625 event-place: Tempe, Arizona, USA.",
      "doi": "10.1145/3294109.3295625"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I Don’t Want to Wear a Screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 6028–6039. https://doi.org/10.1145/2858036.2858192",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Nathan L. Ensmenger. 2012. The Computer Boys Take Over: Computers, Programmers, and the Politics of Technical Expertise. The MIT Press, Cambridge, Mass.",
      "doi": "10.5555/1941315"
    },
    {
      "text": "Ylva Fernaeus and Petra Sundström. 2012. The Material Move How Materials Matter in Interaction Design Research. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 486–495. https://doi.org/10.1145/2317956.2318029",
      "doi": "10.1145/2317956.2318029"
    },
    {
      "text": "Raune Frankjær and Peter Dalsgaard. 2018. Understanding Craft-Based Inquiry in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). Association for Computing Machinery, New York, NY, USA, 473–484. https://doi.org/10.1145/3196709.3196750",
      "doi": "10.1145/3196709.3196750"
    },
    {
      "text": "Mikhaila Friske, Shanel Wu, and Laura Devendorf. 2019. AdaCAD: Crafting Software For Smart Textiles Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 345:1–345:13. https://doi.org/10.1145/3290605.3300575 event-place: Glasgow, Scotland Uk.",
      "doi": "10.1145/3290605.3300575"
    },
    {
      "text": "Bruna Goveia da Rocha, Oscar Tomico, Panos Markopoulos, and Daniel Tetteroo. 2020. Crafting Research Products through Digital Machine Embroidery. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 341–350. https://doi.org/10.1145/3357236.3395443",
      "doi": "10.1145/3357236.3395443"
    },
    {
      "text": "David Griffiths and Alex McLean. 2017. Textility of Code: A Catalogue of Errors. TEXTILE 15, 2 (2017), 198–214. https://doi.org/10.1080/14759756.2017.1298308 arXiv:https://doi.org/10.1080/14759756.2017.1298308",
      "doi": ""
    },
    {
      "text": "Ellen Harlizius-Klück. 2017. Weaving as Binary Art and the Algebra of Patterns. TEXTILE 15, 2 (April 2017), 176–197. https://doi.org/10.1080/14759756.2017.1298239 Publisher: Routledge _eprint: https://doi.org/10.1080/14759756.2017.1298239.",
      "doi": ""
    },
    {
      "text": "Anja Hertenberger, Barbro Scholz, Beam Contrechoc, Becky Stewart, Ebru Kurbak, Hannah Perner-Wilson, Irene Posch, Isabel Cabral, Jie Qi, Katharina Childs, Kristi Kuusk, Lynsey Calder, Marina Toeters, Marta Kisand, Martijn ten Bhömer, Maurin Donneaud, Meg Grant, Melissa Coleman, Mika Satomi, Mili Tharakan, Pauline Vierne, Sara Robertson, Sarah Taylor, and Troy Robert Nachtigall. 2014. 2013 e-textile swatchbook exchange: the importance of sharing physical work. In Proceedings of the 2014 ACM International Symposium on Wearable Computers: Adjunct Program(ISWC ’14 Adjunct). Association for Computing Machinery, New York, NY, USA, 77–81. https://doi.org/10.1145/2641248.2641276",
      "doi": "10.1145/2641248.2641276"
    },
    {
      "text": "Julie Holyoke. 2021. Digital Jacquard Design. Bloomsbury Visual Arts.",
      "doi": ""
    },
    {
      "text": "T. Ingold. 2013. Making: Anthropology, Archaeology, Art and Architecture. Routledge. https://books.google.com/books?id=SUmrPwAACAAJ",
      "doi": ""
    },
    {
      "text": "Jennifer Jacobs, Joel Brandt, Radomír Mech, and Mitchel Resnick. 2018. Extending Manual Drawing Practices with Artist-Centric Programming Tools. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 590:1–590:13. https://doi.org/10.1145/3173574.3174164 event-place: Montreal QC, Canada.",
      "doi": "10.1145/3173574.3174164"
    },
    {
      "text": "Jennifer Jacobs and Leah Buechley. 2013. Codeable Objects: Computational Design and Digital Fabrication for Novice Programmers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). ACM, New York, NY, USA, 1589–1598. https://doi.org/10.1145/2470654.2466211 event-place: Paris, France.",
      "doi": "10.1145/2470654.2466211"
    },
    {
      "text": "Elvin Karana, Elisa Giaccardi, Niels Stamhuis, and Jasper Goossensen. 2016. The Tuning of Materials: A Designer’s Journey. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 619–631. https://doi.org/10.1145/2901790.2901909",
      "doi": "10.1145/2901790.2901909"
    },
    {
      "text": "Kobakant. 2018. Woven Pressure Sensor. https://www.kobakant.at/DIY/?p=6005",
      "doi": ""
    },
    {
      "text": "Shiran Magrisso, Moran Mizrahi, and Amit Zoran. 2018. Digital Joinery For Hybrid Carpentry. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173741",
      "doi": "10.1145/3173574.3173741"
    },
    {
      "text": "Alex McLean. 2022. Laura Devendorf: Weaving Algorithmic Patterns with AdaCAD. https://algorithmicpattern.org/events/laura-devendorf/",
      "doi": ""
    },
    {
      "text": "Holly McQuillan. 2020. Zero Waste Systems Thinking : Multimorphic Textile-Forms. (2020). http://urn.kb.se/resolve?urn=urn:nbn:se:hb:diva-23961 Publisher: Högskolan i Borås.",
      "doi": ""
    },
    {
      "text": "Holly McQuillan, Kathryn Walters, and Karin Peterson. 2021. Critical Textile Topologies X Planet City : The intersection of design practice and research. Research in Arts and Education(2021). http://urn.kb.se/resolve?urn=urn:nbn:se:hb:diva-24389",
      "doi": ""
    },
    {
      "text": "Elizabeth Meiklejohn, Felicita Devlin, John Dunnigan, Patricia Johnson, Joy Xiaoji Zhang, Steve Marschner, Brooks Hagan, and Joy Ko. 2022. Woven Behavior and Ornamentation: Simulation-Assisted Design and Application of Self-Shaping Woven Textiles. Proceedings of the ACM on Computer Graphics and Interactive Techniques 5, 4 (Sept. 2022), 37:1–37:12. https://doi.org/10.1145/3533682",
      "doi": "10.1145/3533682"
    },
    {
      "text": "Vidya Narayanan, Lea Albaugh, Jessica Hodgins, Stelian Coros, and James McCann. 2018. Automatic Machine Knitting of 3D Meshes. ACM Trans. Graph. 37, 3, Article 35 (Aug. 2018), 15 pages. https://doi.org/10.1145/3186265",
      "doi": "10.1145/3186265"
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical Design in HCI Research: Designing and Learning Through Use-it-yourself. In Proceedings of the Designing Interactive Systems Conference(DIS ’12). ACM, New York, NY, USA, 514–523. https://doi.org/10.1145/2317956.2318034",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Michael Nitsche and Anna Weisling. 2019. When is It Not Craft? Materiality and Mediation When Craft and Computing Meet. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (Tempe, Arizona, USA) (TEI ’19). Association for Computing Machinery, New York, NY, USA, 683–689. https://doi.org/10.1145/3294109.3295651",
      "doi": "10.1145/3294109.3295651"
    },
    {
      "text": "G. H. Oelsner. 2016. A Handbook of Weaves. Forgotten Books, Place of publication not identified.",
      "doi": ""
    },
    {
      "text": "Melanie J Olde. 2022. Creating Auxetic Structures in Three -Dimensional Weaving., 4 pages.",
      "doi": ""
    },
    {
      "text": "Doenja Oogjes and Ron Wakkary. 2022. Weaving Stories: Toward Repertoires for Designing Things. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–21. https://doi.org/10.1145/3491102.3501901",
      "doi": "10.1145/3491102.3501901"
    },
    {
      "text": "Daniëlle Ooms, Nick Voskuil, Kristina Andersen, and Hanna Ottilia Wallner. 2020. Ruta, a Loom for Making Sense of Industrial Weaving. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference(DIS’ 20 Companion). Association for Computing Machinery, New York, NY, USA, 337–340. https://doi.org/10.1145/3393914.3395815",
      "doi": "10.1145/3393914.3395815"
    },
    {
      "text": "Hannah Perner-Wilson and Irene Posch. 2022. How Tangible is TEI? Exploring Swatches as a New Academic Publication Format. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’22). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3490149.3503668",
      "doi": "10.1145/3490149.3503668"
    },
    {
      "text": "Virginia Postrel. 2021. Fabric of Civilization. Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Emmi Pouta and Jussi Mikkonen. 2019. Hand Puppet as Means for eTextile Synthesis. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’19). Association for Computing Machinery, New York, NY, USA, 415–421. https://doi.org/10.1145/3294109.3300987",
      "doi": "10.1145/3294109.3300987"
    },
    {
      "text": "Emmi Pouta and Jussi Ville Mikkonen. 2022. Woven eTextiles in HCI — a Literature Review. In Designing Interactive Systems Conference(DIS ’22). Association for Computing Machinery, New York, NY, USA, 1099–1118. https://doi.org/10.1145/3532106.3533566",
      "doi": "10.1145/3532106.3533566"
    },
    {
      "text": "A. Richards. 2012. Weaving Textiles That Shape Themselves. Crowood Press. https://books.google.com/books?id=ni_7ygAACAAJ",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Samantha Shorey, Brock R. Craft, and Helen Remick. 2018. Making Core Memory: Design Inquiry into Gendered Legacies of Engineering and Craftwork. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 531:1–531:13. https://doi.org/10.1145/3173574.3174105",
      "doi": "10.1145/3173574.3174105"
    },
    {
      "text": "Alice Schlein and Bhakti Ziek. 2006. The Woven Pixel: Designing for Jacquard and Dobby Looms Using Photoshop®. Bridgewater Press. Google-Books-ID: svK3PAAACAAJ.",
      "doi": ""
    },
    {
      "text": "Louis Serrure. 1920. ATLAS de 4000 Armures. http://www.weavinglibrary.org/2013/05/complete-4000-dobby-weaves-serrures.html",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and James R. Griesemer. 1989. Institutional Ecology, ’Translations’ and Boundary Objects: Amateurs and Professionals in Berkeley’s Museum of Vertebrate Zoology, 1907-39. Social Studies of Science 19, 3 (1989), 387–420. https://www.jstor.org/stable/285080 Publisher: Sage Publications, Ltd..",
      "doi": ""
    },
    {
      "text": "Ruojia Sun, Ryosuke Onose, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 365–377. https://doi.org/10.1145/3357236.3395548",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Peter-Paul Verbeek. 2011. Moralizing Technology: Understanding and Designing the Morality of Things. University Of Chicago Press, Chicago ; London.",
      "doi": ""
    },
    {
      "text": "R. Wakkary. 2021. Things We Could Design: For More Than Human-Centered Worlds. MIT Press. https://books.google.com/books?id=JRQLEAAAQBAJ",
      "doi": ""
    },
    {
      "text": "Kathryn Walters. 2021. Fibre, fabric, and form: Embedding transformative three-dimensionality in weaving. Nordes Conference Series (Aug. 2021). https://dl.designresearchsociety.org/nordes/nordes2021/researchpapers/8",
      "doi": ""
    },
    {
      "text": "Kathryn Walters. 2022. Emergent behaviour as a forming strategy in craft: The workmanship of risk applied to industrial-loom weaving. Craft Research 13, Craft Sciences (Sept. 2022), 327–348. https://doi.org/10.1386/crre_00082_1 Publisher: Intellect.",
      "doi": ""
    },
    {
      "text": "Rundong Wu, Joy Xiaoji Zhang, Jonathan Leaf, Xinru Hua, Ante Qu, Claire Harvey, Emily Holtzman, Joy Ko, Brooks Hagan, Doug James, François Guimbretière, and Steve Marschner. 2020. Weavecraft: an interactive design and simulation tool for 3D weaving. ACM Transactions on Graphics 39, 6 (Nov. 2020), 210:1–210:16. https://doi.org/10.1145/3414685.3417865",
      "doi": "10.1145/3414685.3417865"
    },
    {
      "text": "Shanel Wu and Laura Devendorf. 2020. Unfabricate: Designing Smart Textiles for Disassembly. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376227",
      "doi": "10.1145/3313831.3376227"
    },
    {
      "text": "Enrique Zeleny. 2013. Ada Deitz Polynomials for Handwoven Textiles. http://demonstrations.wolfram.com/AdaDeitzPolynomialsForHandwovenTextiles/",
      "doi": ""
    },
    {
      "text": "Clement Zheng, HyunJoo Oh, Laura Devendorf, and Ellen Yi-Luen Do. 2019. Sensing Kirigami. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 921–934. https://doi.org/10.1145/3322276.3323689",
      "doi": "10.1145/3322276.3323689"
    }
  ]
}