{
  "doi": "10.1145/3544548.3581011",
  "title": "Modeling Temporal Target Selection: A Perspective from Its Spatial Correspondence",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Temporal target selection requires users to wait and trigger the selection input within a bounded time window, with a selection cursor that is expected to be delayed. This task conceptualizes, for example, a variety of game scenarios such as determining the timing of shooting a projectile towards a moving object. In this work, we explore models that predict “when” users typically perform a selection (i.e., user selection distribution) and their selection error rates in such tasks. We hypothesize that users react to temporal factors including “distance”, “width”, and “delay” as how they treat the corresponding variables in spatial target selection. The derived models are evaluated in a controlled experiment and an MTurk-based online study. Our research contributes new knowledge on user behavior in temporal target selection tasks and its potential connection with its spatial correspondence. Our models and conclusions can benefit both users and designers of relevant interactive applications.",
  "authors": [
    {
      "name": "Difeng Yu",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/do/10.1145/contrib-99659366565/rel-imgonly/wechatimg51.jpeg",
      "acmid": "99659366565",
      "orcid": "0000-0002-7753-4591"
    },
    {
      "name": "Brandon Victor Syiem",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701253",
      "orcid": "0000-0002-3376-7879"
    },
    {
      "name": "Andrew Irlitti",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82858881857",
      "orcid": "0000-0003-2760-2995"
    },
    {
      "name": "Tilman Dingler",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/do/10.1145/contrib-81472653974/rel-imgonly/lichtbild.jpg",
      "acmid": "81472653974",
      "orcid": "0000-0001-6180-7033"
    },
    {
      "name": "Eduardo Velloso",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/do/10.1145/contrib-81488669445/rel-imgonly/profilepic.jpg",
      "acmid": "81488669445",
      "orcid": "0000-0003-4414-2249"
    },
    {
      "name": "Jorge Goncalves",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488650470",
      "orcid": "0000-0002-0117-0322"
    }
  ],
  "references": [
    {
      "text": "Axel Antoine, Sylvain Malacria, and Géry Casiez. 2018. Using High Frequency Accelerometer and Mouse to Compensate for End-to-End Latency in Indirect Interaction. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174183",
      "doi": "10.1145/3173574.3174183"
    },
    {
      "text": "James J Belisle. 1963. Accuracy, reliability, and refractoriness in a coincidence-anticipation task. Research Quarterly. American Association for Health, Physical Education and Recreation 34, 3 (1963), 271–281. https://doi.org/10.1080/10671188.1963.10613234",
      "doi": ""
    },
    {
      "text": "Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts law: modeling finger touch with fitts’ law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1363–1372. https://doi.org/10.1145/2470654.2466180",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Xiaojun Bi and Shumin Zhai. 2013. Bayesian Touch: A Statistical Criterion of Target Selection with Finger Touch. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). ACM, New York, NY, USA, 51–60. https://doi.org/10.1145/2501988.2502058",
      "doi": "10.1145/2501988.2502058"
    },
    {
      "text": "Xiaojun Bi and Shumin Zhai. 2016. Predicting Finger-Touch Accuracy Based on the Dual Gaussian Distribution Model. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). ACM, New York, NY, USA, 313–319. https://doi.org/10.1145/2984511.2984546",
      "doi": "10.1145/2984511.2984546"
    },
    {
      "text": "Rafal Bogacz, Eric Brown, Jeff Moehlis, Philip Holmes, and Jonathan D Cohen. 2006. The physics of optimal decision making: a formal analysis of models of performance in two-alternative forced-choice tasks.Psychological review 113, 4 (2006), 700. https://doi.org/10.1037/0033-295X.113.4.700",
      "doi": ""
    },
    {
      "text": "Mark Claypool. 2018. Game Input with Delay—Moving Target Selection with a Game Controller Thumbstick. ACM Trans. Multimedia Comput. Commun. Appl. 14, 3s, Article 57 (June 2018), 22 pages. https://doi.org/10.1145/3187288",
      "doi": "10.1145/3187288"
    },
    {
      "text": "Mark Claypool, Ragnhild Eg, and Kjetil Raaen. 2017. Modeling user performance for moving target selection with a delayed mouse. In International Conference on Multimedia Modeling. Springer, 226–237. https://doi.org/10.1007/978-3-319-51811-4_19",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1988. Statistical power analysis for the behavioral sciences. Routledge. https://doi.org/10.4324/9780203771587",
      "doi": ""
    },
    {
      "text": "Virginie Crollen, Stéphane Grade, Mauro Pesenti, and Valérie Dormal. 2013. A common metric magnitude system for the perception and production of numerosity, length, and duration. Frontiers in psychology 4 (2013), 449. https://doi.org/10.3389/fpsyg.2013.00449",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Mihaly Csikzentmihaly. 1990. Flow: The psychology of optimal experience. Vol. 1990. Harper & Row New York.",
      "doi": ""
    },
    {
      "text": "Tor-Salve Dalsgaard, Jarrod Knibbe, and Joanna Bergström. 2021. Modeling Pointing for 3D Target Selection in VR. In Proceedings of the 27th ACM Symposium on Virtual Reality Software and Technology (Osaka, Japan) (VRST ’21). Association for Computing Machinery, New York, NY, USA, Article 42, 10 pages. https://doi.org/10.1145/3489849.3489853",
      "doi": "10.1145/3489849.3489853"
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement.Journal of experimental psychology 47, 6 (1954), 381.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2005. A probabilistic approach to modeling two-dimensional pointing. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 3(2005), 435–459. https://doi.org/10.1145/1096737.1096741",
      "doi": "10.1145/1096737.1096741"
    },
    {
      "text": "Tovi Grossman, Nicholas Kong, and Ravin Balakrishnan. 2007. Modeling Pointing at Targets of Arbitrary Shapes. Association for Computing Machinery, New York, NY, USA, 463–472. https://doi.org/10.1145/1240624.1240700",
      "doi": "10.1145/1240624.1240700"
    },
    {
      "text": "Christoffer Holmgård, Michael Cerny Green, Antonios Liapis, and Julian Togelius. 2018. Automated playtesting with procedural personas through MCTS with evolved heuristics. IEEE Transactions on Games 11, 4 (2018), 352–362. https://doi.org/10.1109/TG.2018.2808198",
      "doi": ""
    },
    {
      "text": "Jin Huang and Byungjoo Lee. 2019. Modeling Error Rates in Spatiotemporal Moving Target Selection. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313077",
      "doi": "10.1145/3290607.3313077"
    },
    {
      "text": "Jin Huang, Feng Tian, Xiangmin Fan, Xiaolong (Luke) Zhang, and Shumin Zhai. 2018. Understanding the Uncertainty in 1D Unidirectional Moving Target Selection. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173811",
      "doi": "10.1145/3173574.3173811"
    },
    {
      "text": "Jin Huang, Feng Tian, Nianlong Li, and Xiangmin Fan. 2019. Modeling the Uncertainty in 2D Moving Target Selection. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1031–1043. https://doi.org/10.1145/3332165.3347880",
      "doi": "10.1145/3332165.3347880"
    },
    {
      "text": "Ricardo Jota, Albert Ng, Paul Dietz, and Daniel Wigdor. 2013. How Fast is Fast Enough? A Study of the Effects of Latency in Direct-Touch Pointing Tasks. Association for Computing Machinery, New York, NY, USA, 2291–2300. https://doi.org/10.1145/2470654.2481317",
      "doi": "10.1145/2470654.2481317"
    },
    {
      "text": "Yu-Jung Ko, Hang Zhao, Yoonsang Kim, IV Ramakrishnan, Shumin Zhai, and Xiaojun Bi. 2020. Modeling Two Dimensional Touch Pointing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 858–868. https://doi.org/10.1145/3379337.3415871",
      "doi": "10.1145/3379337.3415871"
    },
    {
      "text": "Steven Komarov, Katharina Reinecke, and Krzysztof Z. Gajos. 2013. Crowdsourcing Performance Evaluations of User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 207–216. https://doi.org/10.1145/2470654.2470684",
      "doi": "10.1145/2470654.2470684"
    },
    {
      "text": "Byungjoo Lee, Sunjun Kim, Antti Oulasvirta, Jong-In Lee, and Eunji Park. 2018. Moving Target Selection: A Cue Integration Model. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 230, 12 pages. https://doi.org/10.1145/3173574.3173804",
      "doi": "10.1145/3173574.3173804"
    },
    {
      "text": "Byungjoo Lee and Antti Oulasvirta. 2016. Modelling Error Rates in Temporal Pointing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1857–1868. https://doi.org/10.1145/2858036.2858143",
      "doi": "10.1145/2858036.2858143"
    },
    {
      "text": "Injung Lee, Hyunchul Kim, and Byungjoo Lee. 2021. Automated Playtesting with a Cognitive Model of Sensorimotor Coordination. In Proceedings of the 29th ACM International Conference on Multimedia (Virtual Event, China) (MM ’21). Association for Computing Machinery, New York, NY, USA, 4920–4929. https://doi.org/10.1145/3474085.3475429",
      "doi": "10.1145/3474085.3475429"
    },
    {
      "text": "Injung Lee, Sunjun Kim, and Byungjoo Lee. 2019. Geometrically Compensating Effect of End-to-End Latency in Moving-Target Selection Games. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300790",
      "doi": "10.1145/3290605.3300790"
    },
    {
      "text": "Jonna Loeffler, Rouwen Cañal-Bruland, Anna Schroeger, J Walter Tolentino-Castro, and Markus Raab. 2018. Interrelations between temporal and spatial cognition: The role of modality-specific processing. Frontiers in psychology 9 (2018), 2609. https://doi.org/10.3389/fpsyg.2018.02609",
      "doi": ""
    },
    {
      "text": "I Scott MacKenzie. 1992. Fitts’ law as a research and design tool in human-computer interaction. Human-computer interaction 7, 1 (1992), 91–139. https://doi.org/10.1207/s15327051hci0701_3",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Atsuo Murata. 1999. Extending effective target width in Fitts’ law to a two-dimensional pointing task. International journal of human-computer interaction 11, 2(1999), 137–152. https://doi.org/10.1207/S153275901102_4",
      "doi": ""
    },
    {
      "text": "Hiroki Nakamoto and Shiro Mori. 2012. Experts in fast-ball sports reduce anticipation timing cost by developing inhibitory control. Brain and cognition 80, 1 (2012), 23–32. https://doi.org/10.1016/j.bandc.2012.04.004",
      "doi": ""
    },
    {
      "text": "Eunji Park and Byungjoo Lee. 2020. An Intermittent Click Planning Model. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376725",
      "doi": "10.1145/3313831.3376725"
    },
    {
      "text": "Andriy Pavlovych and Carl Gutwin. 2012. Assessing Target Acquisition and Tracking Performance for Complex Moving Targets in the Presence of Latency and Jitter. In Proceedings of Graphics Interface 2012 (Toronto, Ontario, Canada) (GI ’12). Canadian Information Processing Society, CAN, 109–116.",
      "doi": "10.5555/2305276.2305295"
    },
    {
      "text": "Réjean Plamondon and Adel M Alimi. 1997. Speed/accuracy trade-offs in target-directed movements. Behavioral and brain sciences 20, 2 (1997), 279–303. https://doi.org/10.1017/S0140525X97001441",
      "doi": ""
    },
    {
      "text": "Richard A Schmidt, Howard Zelaznik, Brian Hawkins, James S Frank, and John T Quinn Jr. 1979. Motor-output variability: a theory for the accuracy of rapid motor acts.Psychological review 86, 5 (1979), 415.",
      "doi": ""
    },
    {
      "text": "Kilian Semmelmann and Sarah Weigelt. 2017. Online psychophysics: Reaction time effects in cognitive experiments. Behavior Research Methods 49, 4 (2017), 1241–1260. https://doi.org/10.3758/s13428-016-0783-4",
      "doi": ""
    },
    {
      "text": "R William Soukoreff and I Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts’ law research in HCI. International journal of human-computer studies 61, 6 (2004), 751–789. https://doi.org/10.1016/j.ijhcs.2004.09.001",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "SS Stevens and Hilda B Greenbaum. 1966. Regression effect in psychophysical judgment. Perception & Psychophysics 1, 5 (1966), 439–446. https://doi.org/10.3758/BF03207424",
      "doi": ""
    },
    {
      "text": "Robert Teghtsoonian and Martha Teghtsoonian. 1978. Range and regression effects in magnitude scaling. Perception & Psychophysics 24, 4 (1978), 305–314. https://doi.org/10.3758/BF03204247",
      "doi": ""
    },
    {
      "text": "Warren H Teichner. 1954. Recent studies of simple reaction time.Psychological Bulletin 51, 2 (1954), 128. https://doi.org/10.1037/h0060900",
      "doi": ""
    },
    {
      "text": "James R Tresilian. 2005. Hitting a moving target: perception and action in the timing of rapid interceptions. Perception & Psychophysics 67, 1 (2005), 129–149. https://doi.org/10.3758/BF03195017",
      "doi": ""
    },
    {
      "text": "Hiroki Usuba, Shota Yamanaka, and Homei Miyashita. 2018. User Performance by the Difference between Motor and Visual Widths for Small Target Pointing. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). Association for Computing Machinery, New York, NY, USA, 161–169. https://doi.org/10.1145/3240167.3240171",
      "doi": "10.1145/3240167.3240171"
    },
    {
      "text": "Hiroki Usuba, Shota Yamanaka, and Homei Miyashita. 2019. Touch Pointing Performance for Uncertain Touchable Sizes of 1D Targets. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 20, 8 pages. https://doi.org/10.1145/3338286.3340131",
      "doi": "10.1145/3338286.3340131"
    },
    {
      "text": "Vincent Walsh. 2003. A theory of magnitude: common cortical metrics of time, space and quantity. Trends in cognitive sciences 7, 11 (2003), 483–488. https://doi.org/0.1016/j.tics.2003.09.002",
      "doi": ""
    },
    {
      "text": "Alan Traviss Welford. 1968. Fundamentals of skill.(1968).",
      "doi": ""
    },
    {
      "text": "Alan M Wing and Alfred B Kristofferson. 1973. Response delays and the timing of discrete motor responses. Perception & Psychophysics 14, 1 (1973), 5–12. https://doi.org/10.3758/BF03198607",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Edward Cutrell, Susumu Harada, and I. Scott MacKenzie. 2008. An Error Model for Pointing Based on Fitts’ Law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1613–1622. https://doi.org/10.1145/1357054.1357306",
      "doi": "10.1145/1357054.1357306"
    },
    {
      "text": "David L Woods, John M Wyma, E William Yund, Timothy J Herron, and Bruce Reed. 2015. Factors influencing the latency of simple reaction time. Frontiers in human neuroscience 9 (2015), 131. https://doi.org/10.3389/fnhum.2015.00131",
      "doi": ""
    },
    {
      "text": "Shota Yamanaka and Hiroki Usuba. 2020. Rethinking the Dual Gaussian Distribution Model for Predicting Touch Accuracy in On-screen-start Pointing Tasks. Proceedings of the ACM on Human-Computer Interaction 4, ISS(2020), 1–20. https://doi.org/10.1145/3427333",
      "doi": "10.1145/3427333"
    },
    {
      "text": "Difeng Yu, Ruta Desai, Ting Zhang, Hrvoje Benko, Tanya R. Jonker, and Aakar Gupta. 2022. Optimizing the Timing of Intelligent Suggestion in Virtual Reality. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology (Bend, OR, USA) (UIST ’22). Association for Computing Machinery, New York, NY, USA, Article 6, 20 pages. https://doi.org/10.1145/3526113.3545632",
      "doi": "10.1145/3526113.3545632"
    },
    {
      "text": "Difeng Yu, Hai-Ning Liang, Xueshi Lu, Kaixuan Fan, and Barrett Ens. 2019. Modeling Endpoint Distribution of Pointing Selection Tasks in Virtual Reality Environments. ACM Trans. Graph. 38, 6, Article 218 (Nov. 2019), 13 pages. https://doi.org/10.1145/3355089.3356544",
      "doi": "10.1145/3355089.3356544"
    },
    {
      "text": "Difeng Yu, Qiushi Zhou, Benjamin Tag, Tilman Dingler, Eduardo Velloso, and Jorge Goncalves. 2020. Engaging Participants during Selection Studies in Virtual Reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE. https://doi.org/10.1109/VR46266.2020.00071",
      "doi": ""
    },
    {
      "text": "Ziyue Zhang, Jin Huang, and Feng Tian. 2020. Modeling the Uncertainty in Pointing of Moving Targets with Arbitrary Shapes. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). 1–7. https://doi.org/10.1145/3334480.3382875",
      "doi": "10.1145/3334480.3382875"
    }
  ]
}