{
  "doi": "10.1145/3544548.3580978",
  "title": "Location-Aware Adaptation of Augmented Reality Narratives",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "The recent popularity of augmented reality (AR) devices has enabled players to participate in interactive narratives through virtual events and characters populated in a real-world environment, where different actions may lead to different story branches. In this paper, we propose a novel approach to adapt narratives to real spaces for AR experiences. Our optimization-based approach automatically assigns contextually compatible locations to story events, synthesizing a navigation graph to guide players through different story branches while considering their walking experiences. We validated the effectiveness of our approach for adapting AR narratives to different scenes through experiments and user studies.",
  "authors": [
    {
      "name": "Wanwan Li",
      "institution": "George Mason University, United States and University of South Florida, United States",
      "img": "/do/10.1145/contrib-99659585710/rel-imgonly/me.png",
      "acmid": "99659585710",
      "orcid": "0000-0002-9425-2633"
    },
    {
      "name": "Changyang Li",
      "institution": "George Mason University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660532877",
      "orcid": "0000-0002-0074-3889"
    },
    {
      "name": "Minyoung Kim",
      "institution": "George Mason University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778478",
      "orcid": "0000-0003-4273-7118"
    },
    {
      "name": "Haikun Huang",
      "institution": "Computer Science Department, George Mason University, United States",
      "img": "/do/10.1145/contrib-99659254899/rel-imgonly/99659254899.png",
      "acmid": "99659254899",
      "orcid": "0000-0002-5962-0533"
    },
    {
      "name": "Lap-Fai Yu",
      "institution": "Computer Science, George Mason University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81487650310",
      "orcid": "0000-0002-2656-5654"
    }
  ],
  "references": [
    {
      "text": "Raphael Anderegg, Loïc Ciccone, and Robert W Sumner. 2018. PuppetPhone: puppeteering virtual characters using a smartphone. In Proceedings of the 11th Annual International Conference on Motion, Interaction, and Games. 1–6.",
      "doi": "10.1145/3274247.3274511"
    },
    {
      "text": "Biplab Banerjee, Francesca Bovolo, Avik Bhattacharya, Lorenzo Bruzzone, Subhasis Chaudhuri, and B Krishna Mohan. 2014. A new self-training-based unsupervised satellite image classification technique using cluster ensemble strategy. IEEE Geoscience and Remote Sensing Letters 12, 4 (2014), 741–745.",
      "doi": ""
    },
    {
      "text": "Arpita Bhattacharya, Travis W Windleharth, Rio Anthony Ishii, Ivy M Acevedo, Cecilia R Aragon, Julie A Kientz, Jason C Yip, and Jin Ha Lee. 2019. Group interactions in location-based gaming: A case study of raiding in pokémon go. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300817"
    },
    {
      "text": "Anne E Bowser, Derek L Hansen, Jocelyn Raphael, Matthew Reid, Ryan J Gamett, Yurong R He, Dana Rotman, and Jenny J Preece. 2013. Prototyping in PLACE: a scalable approach to developing location-based apps and games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1519–1528.",
      "doi": "10.1145/2470654.2466202"
    },
    {
      "text": "Manuel Braunschweiler, Steven Poulakos, Mubbasir Kapadia, and Robert W Sumner. 2018. A Two-Level Planning Framework for Mixed Reality Interactive Narratives with User Engagement. In 2018 IEEE International Conference on Artificial Intelligence and Virtual Reality (AIVR). IEEE, 100–107.",
      "doi": ""
    },
    {
      "text": "Ana María Cárdenas Gasca, Jennifer Mary Jacobs, Andrés Monroy-Hernández, and Michael Nebeling. 2022. AR Exhibitions for Sensitive Narratives: Designing an Immersive Exhibition for the Museum of Memory in Colombia. In Designing Interactive Systems Conference. 1698–1714.",
      "doi": "10.1145/3532106.3533549"
    },
    {
      "text": "Marc Cavazza, Fred Charles, and Steven J Mead. 2002. Planning characters’ behaviour in interactive storytelling. The Journal of Visualization and Computer Animation 13, 2 (2002), 121–131.",
      "doi": ""
    },
    {
      "text": "Long Chen, Wen Tang, Nigel John, Tao Ruan Wan, and Jian Jun Zhang. 2018. Context-aware mixed reality: A framework for ubiquitous interaction. arXiv preprint arXiv:1803.05541(2018).",
      "doi": ""
    },
    {
      "text": "Mengyu Chen, Andrés Monroy-Hernández, and Misha Sra. 2021. SceneAR: Scene-based Micro Narratives for Sharing and Remixing in Augmented Reality. In 2021 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 294–303.",
      "doi": ""
    },
    {
      "text": "Yifei Cheng, Yukang Yan, Xin Yi, Yuanchun Shi, and David Lindlbauer. 2021. SemanticAdapt: Optimization-based Adaptation of Mixed Reality Layouts Leveraging Virtual-Physical Semantic Connections. In UIST. 282–297.",
      "doi": ""
    },
    {
      "text": "Siddhartha Chib and Edward Greenberg. 1995. Understanding the metropolis-hastings algorithm. The american statistician 49, 4 (1995), 327–335.",
      "doi": ""
    },
    {
      "text": "John Joon Young Chung, Wooseok Kim, Kang Min Yoo, Hwaran Lee, Eytan Adar, and Minsuk Chang. 2022. TaleBrush: Sketching Stories with Generative Pretrained Language Models. In CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3491102.3501819"
    },
    {
      "text": "Ignacio X Domínguez, Rogelio E Cardona-Rivera, James K Vance, and David L Roberts. 2016. The mimesis effect: The effect of roles on player choice in interactive narrative role-playing games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3438–3449.",
      "doi": "10.1145/2858036.2858141"
    },
    {
      "text": "Magy Seif El-Nasr. 2007. Interaction, narrative, and drama: Creating an adaptive interactive narrative using performance arts theories. Interaction Studies 8, 2 (2007), 209–240.",
      "doi": ""
    },
    {
      "text": "Tian Feng, Quang-Trung Truong, Duc Thanh Nguyen, Jing Yu Koh, Lap-Fai Yu, Alexander Binder, and Sai-Kit Yeung. 2018. Urban zoning using higher-order markov random fields on multi-view imagery data. In Proceedings of the European Conference on Computer Vision (ECCV). 614–630.",
      "doi": "10.1007/978-3-030-01237-3_38"
    },
    {
      "text": "Robert W Floyd. 1962. Algorithm 97: shortest path. Commun. ACM 5, 6 (1962), 345.",
      "doi": "10.1145/367766.368168"
    },
    {
      "text": "Björn Fröhlich, Eric Bach, Irene Walde, Sören Hese, Christiane Schmullius, and Joachim Denzler. 2013. Land cover classification of satellite images using contextual information. ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences 3, W1 (2013), 1–6.",
      "doi": ""
    },
    {
      "text": "Ran Gal, Lior Shapira, Eyal Ofek, and Pushmeet Kohli. 2014. FLARE: Fast layout for augmented reality applications. In 2014 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 207–212.",
      "doi": ""
    },
    {
      "text": "Charles J Geyer. 1992. Practical markov chain monte carlo. Statistical science 7, 4 (1992), 473–483.",
      "doi": ""
    },
    {
      "text": "Terrell Glenn, Ananya Ipsita, Caleb Carithers, Kylie Peppler, and Karthik Ramani. 2020. StoryMakAR: Bringing stories to life with an augmented reality & physical prototyping toolkit for youth. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376790"
    },
    {
      "text": "Raphaël Grasset, Andreas Dünser, and Mark Billinghurst. 2008. Edutainment with a mixed reality book: a visually augmented illustrative childrens’ book. In Proceedings of the international conference on advances in computer entertainment technology. 292–295.",
      "doi": "10.1145/1501750.1501819"
    },
    {
      "text": "Anton Gustafsson, John Bichard, Liselott Brunnberg, Oskar Juhlin, and Marco Combetto. 2006. Believable environments: generating interactive storytelling in vast location-based pervasive games. In Proceedings of the 2006 ACM SIGCHI international conference on Advances in computer entertainment technology. 24–es.",
      "doi": "10.1145/1178823.1178852"
    },
    {
      "text": "Matthew Guzdial, Brent Harrison, Boyang Li, and Mark Riedl. 2015. Crowdsourcing Open Interactive Narrative.. In FDG.",
      "doi": ""
    },
    {
      "text": "Sehoon Ha, Jim McCann, C Karen Liu, and Jovan Popović. 2013. Physics storyboards. In Computer Graphics Forum, Vol. 32. Wiley Online Library, 133–142.",
      "doi": ""
    },
    {
      "text": "Fengming He, Xiyun Hu, Tianyi Wang, Ananya Ipsita, and Karthik Ramani. 2022. ScalAR: Authoring Semantically Adaptive Augmented Reality Experiences in Virtual Reality. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Mubbasir Kapadia, Jessica Falk, Fabio Zünd, Marcel Marti, Robert W Sumner, and Markus Gross. 2015. Computer-assisted authoring of interactive narratives. In Proceedings of the 19th Symposium on Interactive 3D Graphics and Games. 85–92.",
      "doi": "10.1145/2699276.2699279"
    },
    {
      "text": "Mubbasir Kapadia, Seth Frey, Alexander Shoulson, Robert W Sumner, and Markus H Gross. 2016. CANVAS: computer-assisted narrative animation synthesis.. In Symposium on Computer Animation. 199–209.",
      "doi": ""
    },
    {
      "text": "Bilal Kartal, John Koenig, and Stephen J Guy. 2014. User-driven narrative variation in large story domains using monte carlo tree search. In Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems. Citeseer, 69–76.",
      "doi": "10.5555/2615731.2615746"
    },
    {
      "text": "Diederik P. Kingma and Max Welling. 2014. Auto-Encoding Variational Bayes. In 2nd International Conference on Learning Representations, ICLR 2014, Banff, AB, Canada, April 14-16, 2014, Conference Track Proceedings, Yoshua Bengio and Yann LeCun (Eds.). http://arxiv.org/abs/1312.6114",
      "doi": ""
    },
    {
      "text": "Scott Kirkpatrick, C Daniel Gelatt, and Mario P Vecchi. 1983. Optimization by simulated annealing. science 220, 4598 (1983), 671–680.",
      "doi": ""
    },
    {
      "text": "Yining Lang, Wei Liang, and Lap-Fai Yu. 2019. Virtual Agent Positioning Driven by Scene Semantics in Mixed Reality. In IEEE Virtual Reality.",
      "doi": ""
    },
    {
      "text": "Changyang Li, Haikun Huang, Jyh-Ming Lien, and Lap-Fai Yu. 2021. Synthesizing scene-aware virtual reality teleport graphs. ACM Transactions on Graphics (TOG) 40, 6 (2021), 1–15.",
      "doi": "10.1145/3450626.3459766"
    },
    {
      "text": "Changyang Li, Wanwan Li, Haikun Huang, and Lap-Fai Yu. 2022. Interactive augmented reality storytelling guided by scene semantics. ACM Transactions on Graphics (TOG) 41, 4 (2022), 1–15.",
      "doi": "10.1145/3550454.3555429"
    },
    {
      "text": "Wei Liang, Xinzhe Yu, Rawan Alghofaili, Yining Lang, and Lap-Fai Yu. 2021. Scene-Aware Behavior Synthesis for Virtual Pets in Mixed Reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445532"
    },
    {
      "text": "Mei Yii Lim and Ruth Aylett. 2007. Narrative construction in a mobile tour guide. In International Conference on Virtual Storytelling. Springer, 51–62.",
      "doi": ""
    },
    {
      "text": "David Lindlbauer, Anna Maria Feit, and Otmar Hilliges. 2019. Context-aware online adaptation of mixed reality interfaces. In UIST. 147–160.",
      "doi": ""
    },
    {
      "text": "Andrew Macvean, Sanjeet Hajarnis, Brandon Headrick, Aziel Ferguson, Chinmay Barve, Devika Karnik, and Mark O Riedl. 2011. WeQuest: scalable alternate reality games through end-user content authoring. In Proceedings of the 8th international conference on advances in computer entertainment technology. 1–8.",
      "doi": "10.1145/2071423.2071450"
    },
    {
      "text": "Brian Magerko and John E Laird. 2004. Mediating the tension between plot and interaction. In AAAI Workshop Series: Challenges in Game Artificial Intelligence, Vol. 1. 4.",
      "doi": ""
    },
    {
      "text": "Stacey Mason, Ceri Stagg, and Noah Wardrip-Fruin. 2019. Lume: a system for procedural story generation. In Proceedings of the 14th International Conference on the Foundations of Digital Games. 1–9.",
      "doi": "10.1145/3337722.3337759"
    },
    {
      "text": "Joshua McCoy, Mike Treanor, Ben Samuel, Noah Wardrip-Fruin, and Michael Mateas. 2011. Comme il faut: A system for authoring playable social models. In Seventh Artificial Intelligence and Interactive Digital Entertainment Conference.",
      "doi": ""
    },
    {
      "text": "Benjamin Nuernberger, Eyal Ofek, Hrvoje Benko, and Andrew D Wilson. 2016. Snaptoreality: Aligning augmented reality to the real world. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1233–1244.",
      "doi": "10.1145/2858036.2858250"
    },
    {
      "text": "TeongJoo Ong and John J Leggett. 2004. A genetic algorithm approach to interactive narrative generation. In Proceedings of the fifteenth ACM conference on Hypertext and hypermedia. 181–182.",
      "doi": "10.1145/1012807.1012856"
    },
    {
      "text": "Steven Poulakos, Mubbasir Kapadia, Guido M Maiga, Fabio Zünd, Markus Gross, and Robert W Sumner. 2016. Evaluating accessible graphical interfaces for building story worlds. In International Conference on Interactive Digital Storytelling. Springer, 184–196.",
      "doi": "10.1007/978-3-319-48279-8_17"
    },
    {
      "text": "Alejandro Ramirez and Vadim Bulitko. 2014. Automated planning and player modeling for interactive storytelling. IEEE Transactions on Computational Intelligence and AI in Games 7, 4(2014), 375–386.",
      "doi": ""
    },
    {
      "text": "Mark Riedl, Boyang Li, Hua Ai, and Ashwin Ram. 2011. Robust and authorable multiplayer storytelling experiences. In Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment, Vol. 6.",
      "doi": ""
    },
    {
      "text": "Mark Owen Riedl and Vadim Bulitko. 2013. Interactive narrative: An intelligent systems approach. Ai Magazine 34, 1 (2013), 67–67.",
      "doi": ""
    },
    {
      "text": "Mark O Riedl and Robert Michael Young. 2006. From linear story generation to branching story graphs. IEEE Computer Graphics and Applications 26, 3 (2006), 23–31.",
      "doi": "10.1109/MCG.2006.56"
    },
    {
      "text": "Dariusz Rumiński and Krzysztof Walczak. 2013. Creation of interactive AR content on mobile devices. In International Conference on Business Information Systems. Springer, 258–269.",
      "doi": ""
    },
    {
      "text": "Alexander Shoulson, Max L Gilbert, Mubbasir Kapadia, and Norman I Badler. 2013. An event-centric planning approach for dynamic real-time narrative. In Proceedings of Motion on Games. 121–130.",
      "doi": "10.1145/2522628.2522629"
    },
    {
      "text": "Oliviero Stock, Massimo Zancanaro, Paolo Busetta, Charles Callaway, Antonio Krüger, Michael Kruppa, Tsvi Kuflik, Elena Not, and Cesare Rocchi. 2007. Adaptive, intelligent presentation of information for the museum visitor in PEACH. User Modeling and User-Adapted Interaction 17, 3 (2007), 257–304.",
      "doi": "10.1007/s11257-007-9029-6"
    },
    {
      "text": "Tomu Tahara, Takashi Seno, Gaku Narita, and Tomoya Ishikawa. 2020. Retargetable AR: Context-aware Augmented Reality in Indoor Scenes based on 3D Scene Graph. In 2020 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). IEEE, 249–255.",
      "doi": ""
    },
    {
      "text": "Pengcheng Wang, Jonathan P Rowe, Wookhee Min, Bradford W Mott, and James C Lester. 2017. Interactive Narrative Personalization with Deep Reinforcement Learning.. In IJCAI. 3852–3858.",
      "doi": ""
    },
    {
      "text": "Pengcheng Wang, Jonathan P Rowe, Wookhee Min, Bradford W Mott, and James C Lester. 2018. High-Fidelity Simulated Players for Interactive Narrative Planning.. In IJCAI. 3884–3890.",
      "doi": ""
    },
    {
      "text": "Tianyi Wang, Xun Qian, Fengming He, Xiyun Hu, Ke Huo, Yuanzhi Cao, and Karthik Ramani. 2020. CAPturAR: An augmented reality tool for authoring human-involved context-aware applications. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 328–341.",
      "doi": "10.1145/3379337.3415815"
    },
    {
      "text": "Hui Ye, Kin Chung Kwan, Wanchao Su, and Hongbo Fu. 2020. ARAnimator: in-situ character animation in mobile AR with user-defined motion gestures. ACM Transactions on Graphics 39, 4 (2020), 83–1.",
      "doi": "10.1145/3386569.3392404"
    },
    {
      "text": "Hong Yu and Mark O Riedl. 2012. A sequential recommendation approach for interactive personalized story generation.. In AAMAS, Vol. 12. 71–78.",
      "doi": ""
    },
    {
      "text": "Xun Zhang, Bhuvana C Inampudi, Norman I Badler, and Mubbasir Kapadia. 2017. Dynamic and Accelerated Partial Order Planning for Interactive Narratives. In Thirteenth Artificial Intelligence and Interactive Digital Entertainment Conference.",
      "doi": ""
    },
    {
      "text": "Zhenpeng Zhao, Sriram Karthik Badam, Senthil Chandrasegaran, Deok Gun Park, Niklas LE Elmqvist, Lorraine Kisselburgh, and Karthik Ramani. 2014. skWiki: a multimedia sketching system for collaborative creativity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1235–1244.",
      "doi": "10.1145/2556288.2557394"
    },
    {
      "text": "Zhiying Zhou, Adrian David Cheok, JiunHorng Pan, and Yu Li. 2004. Magic Story Cube: an interactive tangible interface for storytelling. In Proceedings of the International Conference on Advances in Computer Entertainment Technology. 364–365.",
      "doi": "10.1145/1067343.1067404"
    }
  ]
}