{
  "doi": "10.1145/3544548.3581150",
  "title": "Sustainability by Design. How to Encourage Users to Choose Energy-Saving Programs and Settings when Washing Laundry",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "One way to counteract anthropogenic climate change, is to reduce individual energy consumption. An especially energy-intensive everyday practice is doing the laundry. In Germany, laundry accounts for about 5% of domestic electricity consumption. In part, this is because users do not make use of the energy-saving programs offered by modern washing machines. Based on different principles of behavior change, we created four concepts for washing machine interfaces to encourage users to choose energy-saving programs and settings. These concepts were implemented as functional prototypes. An online experiment (N=400) showed that all concepts increased the choice of energy-saving programs compared to a standard machine. Especially effective was to interrupt impulsive actions and suggest alternative choices (concept B) and to restructure the entry of settings (concept E). This demonstrates how small changes in a standard interfaces can significantly increase the probability of energy conservation in a private setting.",
  "tags": [
    "laundry washing",
    "Behavior change",
    "empirical study",
    "sustainable interaction design",
    "sustainability",
    "sustainable HCI",
    "prototyping",
    "persuasive technology"
  ],
  "authors": [
    {
      "name": "Laura Grönewald",
      "institution": "Interaction Design for Sustainability and Transformation, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700597",
      "orcid": "0000-0002-2577-6951"
    },
    {
      "name": "Julian Weiblen",
      "institution": "Interaction Design for Sustainability and Transformation, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780325",
      "orcid": "0000-0002-9558-0612"
    },
    {
      "name": "Matthias Laschke",
      "institution": "Interaction Design for Sustainability and Transformation, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472655523",
      "orcid": "0000-0003-2714-4293"
    },
    {
      "name": "Lara Christoforakos",
      "institution": "Department Psychology, Ludwig-Maximilians-University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781925",
      "orcid": "0000-0002-6645-1707"
    },
    {
      "name": "Marc Hassenzahl",
      "institution": "Ubiquitous Design / Experience & Interaction, University of Siegen, Germany",
      "img": "/do/10.1145/contrib-81452610719/rel-imgonly/hassenzahl.jpg",
      "acmid": "81452610719",
      "orcid": "0000-0001-9798-1762"
    }
  ],
  "references": [
    {
      "text": "Icek Ajzen. 1991. The theory of planned behavior. Organizational Behavior and Human Decision Processes 50, 2 (dec 1991), 179–211. https://doi.org/10.1016/0749-5978(91)90020-t",
      "doi": ""
    },
    {
      "text": "Ernesto Arroyo, Leonardo Bonanni, and Ted Selker. 2005. Waterbot: exploring feedback and persuasive techniques at the sink. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/1054972.1055059",
      "doi": "10.1145/1054972.1055059"
    },
    {
      "text": "Albert Bandura. 1979. Self-referent mechanisms in social learning theory. American Psychologist 34, 5 (may 1979), 439–441. https://doi.org/10.1037/0003-066x.34.5.439.b",
      "doi": ""
    },
    {
      "text": "Mathias Blanz. 2015. Forschungsmethoden und Statistik für die Soziale Arbeit: Grundlagen und Anwendungen. Kohlhammer.",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable interaction design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Leonardo Bonanni, Ernesto Arroyo, Chia-Hsun Lee, and Ted Selker. 2005. Smart sinks: real-world opportunities for context-aware interaction. In CHI '05 Extended Abstracts on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/1056808.1056884",
      "doi": "10.1145/1056808.1056884"
    },
    {
      "text": "Jacky Bourgeois, Janet van der Linden, Gerd Kortuem, Blaine A. Price, and Christopher Rimmer. 2014. Conversations with my washing machine: an in-the-wild study of demand shifting with self-generated energy. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM. https://doi.org/10.1145/2632048.2632106",
      "doi": "10.1145/2632048.2632106"
    },
    {
      "text": "Jack Williams Brehm. 1966. A Theory of Psychological Reactance. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Christina Bremer, Bran Knowles, and Adrian Friday. 2022. Have We Taken On Too Much?: A Critical Review of the Sustainable HCI Landscape. In CHI Conference on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/3491102.3517609",
      "doi": "10.1145/3491102.3517609"
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/2207676.2208539",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Marshini Chetty, David Tran, and Rebecca E. Grinter. 2008. Getting to green: understanding resource consumption in the home. In Proceedings of the 10th international conference on Ubiquitous computing - UbiComp. ACM Press. https://doi.org/10.1145/1409635.1409668",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "Enrico Costanza, Joel E. Fischer, James A. Colley, Tom Rodden, Sarvapali D. Ramchurn, and Nicholas R. Jennings. 2014. Doing the laundry with agents: a field trial of a future smart energy system in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/2556288.2557167",
      "doi": "10.1145/2556288.2557167"
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 1985. Intrinsic Motivation and Self-Determination in Human Behavior. Springer US. https://doi.org/10.1007/978-1-4899-2271-7",
      "doi": ""
    },
    {
      "text": "BDEW Bundesverband der Energie-und Wasserwirtschaft e. V.2021. Stromverbrauch im Privathaushalt. https://www.stromspiegel.de/presse/material-zum-stromspiegel/.",
      "doi": ""
    },
    {
      "text": "Steven Dorrestijn and Peter P.C.C. Verbeek. 2013. Technology, Wellbeing, and Freedom: The Legacy of Utopian Design. International Journal of Design 7 (2013), 45–56.",
      "doi": ""
    },
    {
      "text": "Eurostat. 2022. Energy consumption in households. Retrieved September 13, 2022 from https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Energy_consumption_in_households#Energy_consumption_in_households_by_type_of_end-use",
      "doi": ""
    },
    {
      "text": "Corinna Fischer. 2008. Feedback on household electricity consumption: a tool for saving energy?Energy Efficiency 1, 1 (feb 2008), 79–104. https://doi.org/10.1007/s12053-008-9009-7",
      "doi": ""
    },
    {
      "text": "Brian J. Fogg. 1999. Persuasive Technologies. Commun. ACM 42, 5 (1999), 26–29.",
      "doi": "10.1145/301353.301396"
    },
    {
      "text": "Brian J. Fogg. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December (dec 2002), 2. https://doi.org/10.1145/764008.763957",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, Jennifer Mankoff, Sunny Consolvo, Beverly Harrison, and James A. Landay. 2009. UbiGreen. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/1518701.1518861",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Jon Froehlich, Leah Findlater, and James Landay. 2010. The design of eco-feedback technology. In Proceedings of the 28th international conference on Human factors in computing systems - CHI. ACM Press. https://doi.org/10.1145/1753326.1753629",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Peter M. Gollwitzer. 1999. Implementation intentions: Strong effects of simple plans.American Psychologist 54, 7 (1999), 493–503. https://doi.org/10.1037/0003-066x.54.7.493",
      "doi": ""
    },
    {
      "text": "Anton Gustafsson and Magnus Gyllenswärd. 2005. The power-aware cord: energy awareness through ambient information display. In CHI '05 Extended Abstracts on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/1056808.1056932",
      "doi": "10.1145/1056808.1056932"
    },
    {
      "text": "Lon Åke Erni Johannes Hansson, Teresa Cerratto Pargman, and Daniel Sapiens Pargman. 2021. A Decade of Sustainable HCI: Connecting SHCI to the Sustainable Development Goals. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/3411764.3445069",
      "doi": "10.1145/3411764.3445069"
    },
    {
      "text": "Marc Hassenzahl and Matthias Laschke. 2014. Pleasurable Troublemakers. MIT Press, Cambridge, MA, 167–195.",
      "doi": ""
    },
    {
      "text": "Petra Icha, Dr. Thomas Lauf, and Gunter Kuhs. 2022. Entwicklung der spezifischen Treibhausgas-Emissionen des deutschen Strommix in den Jahren 1990 - 2021. Climate Change 15(2022).",
      "doi": ""
    },
    {
      "text": "Rikke Hagensby Jensen, Jesper Kjeldskov, and Mikael B. Skov. 2016. HeatDial: Beyond User Scheduling in Eco-Interaction. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM. https://doi.org/10.1145/2971485.2971525",
      "doi": "10.1145/2971485.2971525"
    },
    {
      "text": "Rikke Hagensby Jensen, Dimitrios Raptis, Jesper Kjeldskov, and Mikael B. Skov. 2018. Washing with the Wind: A Study of Scripting towards Sustainability. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM. https://doi.org/10.1145/3196709.3196779",
      "doi": "10.1145/3196709.3196779"
    },
    {
      "text": "Karin Kappel and Thomas Grechenig. 2009. \"show-me\": water consumption at a glance to promote water conservation in the shower. In Proceedings of the 4th International Conference on Persuasive Technology - Persuasive '09. ACM Press. https://doi.org/10.1145/1541948.1541984",
      "doi": "10.1145/1541948.1541984"
    },
    {
      "text": "Heinz Walter Krohne, Boris Egloff, Carl-Walter Kohlmann, and Anja Tausch. 1996. Positive and Negative Affect Schedule–German Version. https://doi.org/10.1037/t49650-000",
      "doi": ""
    },
    {
      "text": "David Kroll, Frank Blume, and Felicitas Buck. 2020. Vergleich des CO2-Fußabdrucks von Mineral- und Trinkwasser. (2020).",
      "doi": ""
    },
    {
      "text": "Anke Kruschwitz, Anja Karle, Angelika Schmitz, and Rainer Stamminger. 2014. Consumer laundry practices in Germany. International Journal of Consumer Studies 38, 3 (March 2014), 265–277. https://doi.org/10.1111/ijcs.12091",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. UpStream: motivating water conservation with low-cost water flow sensing and persuasive displays. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press. https://doi.org/10.1145/1753326.1753604",
      "doi": "10.1145/1753326.1753604"
    },
    {
      "text": "Matthias Laschke, Sarah Diefenbach, and Marc Hassenzahl. 2012. “Annoying, but in a Nice Way”: An Inquiry into the Experience of Frictional Feedback. International Journal of Design 9, 2 (2012), 129–140.",
      "doi": ""
    },
    {
      "text": "Matthias Laschke, Sarah Diefenbach, Thies Schneider, and Marc Hassenzahl. 2014. Keymoment: initiating behavior change through friendly friction. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational. ACM. https://doi.org/10.1145/2639189.2670179",
      "doi": "10.1145/2639189.2670179"
    },
    {
      "text": "Matthias Laschke, Marc Hassenzahl, and Sarah Diefenbach. 2011. Things with attitude: Transformational Products.",
      "doi": ""
    },
    {
      "text": "Matthias Laschke, Marc Hassenzahl, Sarah Diefenbach, and Marius Tippkämper. 2011. With a little help from a friend: a shower calendar to save water. In Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems - CHI EA. ACM Press. https://doi.org/10.1145/1979742.1979659",
      "doi": "10.1145/1979742.1979659"
    },
    {
      "text": "Thomas C. Leonard. 2008. Richard H. Thaler, Cass R. Sunstein, Nudge: Improving decisions about health, wealth, and happiness. Constitutional Political Economy 19, 4 (aug 2008), 356–360. https://doi.org/10.1007/s10602-008-9056-2",
      "doi": ""
    },
    {
      "text": "Edwin A. Locke and Gary P. Latham. 1990. A theory of goal setting & task performance.Prentice-Hall, Inc.",
      "doi": ""
    },
    {
      "text": "Dan Lockton, David Harrison, and Neville A. Stanton. 2010. The Design with Intent Method: A design tool for influencing user behaviour. Applied Ergonomics 41, 3 (may 2010), 382–392. https://doi.org/10.1016/j.apergo.2009.09.001",
      "doi": ""
    },
    {
      "text": "Jennifer C. Mankoff, Eli Blevis, Alan Borning, Batya Friedman, Susan R. Fussell, Jay Hasbrouck, Allison Woodruff, and Phoebe Sengers. 2007. Environmental sustainability and interaction. In CHI. ACM. https://doi.org/10.1145/1240866.1240963",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Janet Metcalfe and Walter Mischel. 1999. A hot/cool-system analysis of delay of gratification: dynamics of willpower.Psychological review 106, 1 (1999), 3.",
      "doi": ""
    },
    {
      "text": "Mark Muraven and Roy F. Baumeister. 2000. Self-regulation and depletion of limited resources: Does self-control resemble a muscle?Psychological Bulletin 126, 2 (2000), 247–259. https://doi.org/10.1037/0033-2909.126.2.247",
      "doi": ""
    },
    {
      "text": "Publications Office of the European Union. 2021. COMMISSION REGULATION (EU) 2019/2023 of 1 October 2019 laying down ecodesign requirements for household washing machines and household washer-dryers pursuant to Directive 2009/125/EC of the European Parliament and of the Council, amending Commission Regulation (EC) No 1275/2008 and repealing Commission Regulation (EU) No 1015/2010. Retrieved June 17, 2022 from https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:02019R2023-20210501",
      "doi": ""
    },
    {
      "text": "Luc G. Pelletier, Kim M. Tuson, Isabelle Green-Demers, Kimberley Noels, and Ann M. Beaton. 1998. Why Are You Doing Things for the Environment? The Motivation Toward the Environment Scale (MTES). Journal of Applied Social Psychology 28, 5 (mar 1998), 437–468. https://doi.org/10.1111/j.1559-1816.1998.tb01714.x",
      "doi": ""
    },
    {
      "text": "Dane Petersen, Jay Steele, and Joe Wilkerson. 2009. WattBot: a residential electricity monitoring and feedback system. In CHI '09 Extended Abstracts on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/1520340.1520413",
      "doi": "10.1145/1520340.1520413"
    },
    {
      "text": "Petromil Petkov, Suparna Goswami, Felix Köbler, and Helmut Krcmar. 2012. Personalised eco-feedback as a design technique for motivating energy saving behaviour at home. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction Making Sense Through Design - NordiCHI '12. ACM Press. https://doi.org/10.1145/2399016.2399106",
      "doi": "10.1145/2399016.2399106"
    },
    {
      "text": "Majken K. Rasmussen, Mia Kruse Rasmussen, Nervo Verdezoto, Robert Brewer, Laura L. Nielsen, and Niels Olof Bouvin. 2017. Exploring the flexibility of everyday practices for shifting energy consumption through clockcast. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. ACM. https://doi.org/10.1145/3152771.3152803",
      "doi": "10.1145/3152771.3152803"
    },
    {
      "text": "Der Spiegel. 2022. Stromsparmodus von Waschmaschinen wird kaum genutzt. Retrieved September 13, 2022 from https://www.spiegel.de/wirtschaft/stromsparmodus-bei-waschmaschinen-kaum-genutzt-daten-von-hersteller-miele-a-c156d10e-4b1d-4459-b5f8-16884e150174",
      "doi": ""
    },
    {
      "text": "Fritz Strack and Roland Deutsch. 2004. Reflective and Impulsive Determinants of Social Behavior. Personality and Social Psychology Review 8, 3 (Aug. 2004), 220–247. https://doi.org/10.1207/s15327957pspr0803_1",
      "doi": ""
    },
    {
      "text": "Yolande A. A. Strengers. 2011. Designing eco-feedback systems for everyday life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. https://doi.org/10.1145/1978942.1979252",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Richard H. Thaler, Cass R. Sunstein, and John P. Balz. 2010. Choice Architecture. SSRN Electronic Journal(2010). https://doi.org/10.2139/ssrn.1583509",
      "doi": ""
    },
    {
      "text": "Bas Verplanken. 2017. Promoting Sustainability: Towards a Segmentation Model of Individual and Household Behaviour and Behaviour Change. Sustainable Development 26, 3 (aug 2017), 193–205. https://doi.org/10.1002/sd.1694",
      "doi": ""
    },
    {
      "text": "Bas Verplanken and Wendy Wood. 2006. Interventions to Break and Create Consumer Habits. Journal of Public Policy & Marketing 25, 1 (apr 2006), 90–103. https://doi.org/10.1509/jppm.25.1.90",
      "doi": ""
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: The PANAS scales.Journal of Personality and Social Psychology 54, 6(1988), 1063–1070. https://doi.org/10.1037/0022-3514.54.6.1063",
      "doi": ""
    }
  ]
}