{
  "doi": "10.1145/3544548.3580939",
  "title": "Building Positively Affective Location-Based Advertising: A Study of Pokémon GO Players",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "With the expanding popularity of Location-Based Games and the rise of advertising therein, there exists a need to comprehend the impact of Location-Based Game Advertising (LGA). This paper seeks to identify what makes positively affective LGA, leveraging Pokémon GO as a probe. Researchers conducted twenty-seven (n=27) semi-structured interviews with Pokémon GO players to reveal lived experiences regarding LGA. Our findings highlight the following direct implications for LGA: (1) LGA act as a digital billboard, conveying qualitative alongside locative information, and (2) well-received LGA enhances the player’s agency. We additionally identify findings that have auxiliary implications to LGA: (3) positive memorability occurs when points of interest match physical reality, and (4) ludic engagement is a mediating factor in the memorability of locations. This research demonstrates that LGA in Location-Based Games is surprisingly well-received. However, developers must provide extra consideration to the player’s agency for such techniques to be effective.",
  "tags": [
    "Pokémon GO",
    "Location-based Games",
    "COVID-19",
    "Advertising"
  ],
  "authors": [
    {
      "name": "John Dunham",
      "institution": "Niantic X RIT Geo Games and Media Research Lab, Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659701879/rel-imgonly/121150077_10158803748369804_123645061321882627_n.jpg",
      "acmid": "99659701879",
      "orcid": "0000-0001-9348-6983"
    },
    {
      "name": "Konstantinos Papangelis",
      "institution": "Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659162915/rel-imgonly/kp.jpg",
      "acmid": "99659162915",
      "orcid": "missing"
    },
    {
      "name": "Cati Boulanger",
      "institution": "Niantic Inc., United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659026705",
      "orcid": "0000-0002-3676-2571"
    },
    {
      "name": "Nicolas Lalone",
      "institution": "Information Systems and Quantitative Analysis, University of Nebraska at Omaha, United States",
      "img": "/do/10.1145/contrib-87259569357/rel-imgonly/me.jpg",
      "acmid": "87259569357",
      "orcid": "0000-0003-2254-2831"
    },
    {
      "name": "Evangelia [Lina Nika",
      "institution": "Department of Psychology, University of Sunderland, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782084",
      "orcid": "0000-0001-8445-2335"
    },
    {
      "name": "Michael Saker",
      "institution": "City University London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659492997",
      "orcid": "0000-0002-7414-2840"
    },
    {
      "name": "David Schwartz",
      "institution": "School of Interactive Games and Media, RIT, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238612",
      "orcid": "0000-0002-1675-9535"
    }
  ],
  "references": [
    {
      "text": "Paula Alavesa, Minna Pakanen, Timo Ojala, Matti Pouke, Hannu Kukka, Alexander Samodelkin, Alexander Voroshilov, and Mohamed Abdellatif. 2020. Embedding virtual environments into the physical world: memorability and co-presence in the context of pervasive location-based games. Multimedia Tools and Applications 79, 5 (Feb. 2020), 3285–3309. https://doi.org/10.1007/s11042-018-7077-z",
      "doi": ""
    },
    {
      "text": "Theophilus Azungah. 2018. Qualitative research: deductive and inductive approaches to data analysis. Qualitative Research Journal 18, 4 (2018), 383–400. https://doi.org/10.1108/QRJ-D-18-00035 Num Pages: 18 Place: Armidale, United Kingdom Publisher: Emerald Group Publishing Limited.",
      "doi": ""
    },
    {
      "text": "Christine Bauer and Christine Strauss. 2016. Location-based advertising on mobile devices: A literature review and analysis. Management Review Quarterly 66, 3 (June 2016), 159–194. https://doi.org/10.1007/s11301-015-0118-z",
      "doi": ""
    },
    {
      "text": "Steve Benford, Andy Crabtree, Stuart Reeves, Jennifer Sheridan, Alan Dix, Martin Flintham, and Adam Drozd. 2006. The Frame of the Game: Blurring the Boundary between Fiction and Reality in Mobile Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’06). Association for Computing Machinery, New York, NY, USA, 427–436. https://doi.org/10.1145/1124772.1124836",
      "doi": "10.1145/1124772.1124836"
    },
    {
      "text": "Steve Benford, Adam Drozd, Duncan Rowland, Nick Tandavanitj, Matt Adams, Ju Row-Farr, Amanda Oldroyd, Jon Sutton, and Adastral Park. 2004. Uncle Roy All Around You: Implicating the City in a Location-Based Performance. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (Singapore) (Proceedings of Conference on Advanced Computer Entertainment (ACE) (2004)). Association for Computing Machinery, New York, NY, USA, 11.",
      "doi": ""
    },
    {
      "text": "Arpita Bhattacharya, Travis W. Windleharth, Rio Anthony Ishii, Ivy M. Acevedo, Cecilia R. Aragon, Julie A. Kientz, Jason C. Yip, and Jin Ha Lee. 2019. Group Interactions in Location-Based Gaming: A Case Study of Raiding in Pokémon GO. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300817",
      "doi": "10.1145/3290605.3300817"
    },
    {
      "text": "Ian Bogost, Simon Ferrari, and Bobby Schweizer. 2012. Newsgames: Journalism at play. Mit Press, Cambridge, MA, USA.",
      "doi": "10.5555/2432119"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (04 2006), 77–101. https://ezproxy.rit.edu/login?url=https://www-proquest-com.ezproxy.rit.edu/scholarly-journals/using-thematic-analysis-psychology/docview/223135521/se-2?accountid=108 Copyright - © 2006 Arnold; Last updated - 2011-07-20.",
      "doi": ""
    },
    {
      "text": "Digital Café. 1996. Chex Quest. MS-DOS.",
      "doi": ""
    },
    {
      "text": "Calendly. 2022. Free Online Appointment Scheduling Software - Calendly. https://calendly.com",
      "doi": ""
    },
    {
      "text": "Craig Chapple. 2020. Pokémon GO Has Best Year Ever in 2019, Catching Nearly $900 Million in Player Spending. https://sensortower.com/blog/pokemon-go-has-best-year-ever-in-2019-catching-nearly-900m-usd-in-player-spending",
      "doi": ""
    },
    {
      "text": "Ruizhi Chen and Robert Guinness. 2014. Geospatial Computing in Mobile Devices. Artech House, Norwood, MA. Google-Books-ID: i7lTBAAAQBAJ.",
      "doi": ""
    },
    {
      "text": "Nicolette Conti, Charlene Jennett, José Maestre, and M. Angela Sasse. 2012. When Did My Mobile Turn Into A ‘Sellphone’? A study of consumer responses to tailored smartphone ads. In BCS-HCI ’12 Proceedings of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers, BCS-HCI 2012, 12-14 September 2012, Birmingham, UK. British Computer Society, Swindon, England, 221–226. https://doi.org/10.14236/ewic/HCI2012.27",
      "doi": ""
    },
    {
      "text": "Jean-Pierre Dubé, Zheng Fang, Nathan Fong, and Xueming Luo. 2017. Competitive Price Targeting with Smartphone Coupons. Marketing Science 36, 6 (Nov. 2017), 944–975. https://doi.org/10.1287/mksc.2017.1042",
      "doi": "10.1287/mksc.2017.1042"
    },
    {
      "text": "John Dunham, Konstantinos Papangelis, Samuli Laato, Nicolas LaLone, Jin Ha Lee, and Michael Saker. 2022. The Impacts of Covid-19 on Players of Pokémon GO. ACM Trans. Comput.-Hum. Interact. 1 (oct 2022), 24 pages. https://doi.org/10.1145/3569896 Just Accepted.",
      "doi": "10.1145/3569896"
    },
    {
      "text": "John Dunham, Jiangnan Xu, Konstantinos Papangelis, and David I Schwartz. 2022. Advertising in Location-Based Games: An Exploration in Pokémon GO. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 271, 6 pages. https://doi.org/10.1145/3491101.3519663",
      "doi": "10.1145/3491101.3519663"
    },
    {
      "text": "John Dunham, Jiangnan Xu, Konstantinos Papangelis, and David I Schwartz. 2022. Advertising in Location-Based Games: An Exploration in Pokémon GO. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 271, 6 pages. https://doi.org/10.1145/3491101.3519663",
      "doi": "10.1145/3491101.3519663"
    },
    {
      "text": "Patrick J. Ewell, Michelle C. Quist, Camilla S. Øverup, Heather Watkins, and Rosanna E. Guadagno. 2020. Catching more than pocket monsters: Pokémon Go’s social and psychological effects on players. The Journal of Social Psychology 160, 2 (2020), 131–136. https://doi.org/10.1080/00224545.2019.1629867",
      "doi": ""
    },
    {
      "text": "Mike Fahey. 2012. Steel Battalion: Heavy Armor Trades Its Massive Controller for Really Low Review Scores. https://kotaku.com/steel-battalion-heavy-armor-trades-its-massive-control-5920100",
      "doi": ""
    },
    {
      "text": "Jason Farman. 2015. The Materiality of Locative Media: On the Invisible Infrastructure of Mobile Networks. In Theories of the mobile Internet: Materialities and imaginaries. Routledge Press, New York, NY, 45–59.",
      "doi": ""
    },
    {
      "text": "FromSoftware. 2012. Steel Battalion: Heavy Armor. Game.",
      "doi": ""
    },
    {
      "text": "Anindya Ghose, Hyeokkoo Eric Kwon, Dongwon Lee, and Wonseok Oh. 2019. Seizing the Commuting Moment: Contextual Targeting Based on Mobile Transportation Apps. Information Systems Research 30, 1 (March 2019), 154–174. https://doi.org/10.1287/isre.2018.0792 Publisher: INFORMS.",
      "doi": ""
    },
    {
      "text": "Tathagata Ghosh, S. Sreejesh, and Yogesh K. Dwivedi. 2022. Brand logos versus brand names: A comparison of the memory effects of textual and pictorial brand elements placed in computer games. Journal of Business Research 147 (Aug. 2022), 222–235. https://doi.org/10.1016/j.jbusres.2022.04.017",
      "doi": ""
    },
    {
      "text": "Marvin Glass and Associates. 1983. Tapper. Game [Arcade].",
      "doi": ""
    },
    {
      "text": "Google. 2019. Rewarded Ads: a Win for Users, Developers, and Advertisers - Google AdMob. https://admob.google.com/home/resources/rewarded-ads-win-for-everyone/",
      "doi": ""
    },
    {
      "text": "Inc Groundspeak. 2000. Geocaching. Game [Internet].",
      "doi": ""
    },
    {
      "text": "Hong Guo, Xuying Zhao, Lin Hao, and De Liu. 2019. Economic Analysis of Reward Advertising. Production and Operations Management 28, 10 (2019), 2413–2430. https://doi.org/10.1111/poms.13015 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/poms.13015.",
      "doi": ""
    },
    {
      "text": "IAB. 2014. Games Advertising Ecosystem Guide. Technical Report. Interactive Advertising Bureau. 24pages. https://www.iab.com/wp-content/uploads/2015/10/IAB_Games_Ad_Eco_Guide.pdf",
      "doi": ""
    },
    {
      "text": "Stephanie C. Jennings. 2019. A Meta-Synthesis of Agency in Game Studies. Trends, Troubles, Trajectories. G|A|M|E Games as Art, Media, Entertainment 1, 8(2019), 85–106. https://www.gamejournal.it/a-meta-synthesis-of-agency-in-game-studies-trends-troubles-trajectories-s-c-jennings/ Publisher: Ludica Section: Journal.",
      "doi": ""
    },
    {
      "text": "Daniel Johnson. 2015. Animated Frustration or the Ambivalence of Player Agency. Games and Culture 10, 6 (Nov. 2015), 593–612. https://doi.org/10.1177/1555412014567229 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "KID. 1999. Pepsiman. Game [Atari 2600].",
      "doi": ""
    },
    {
      "text": "Dong Hoo Kim, Seoyeon Kim, and Doori Song. 2019. Can Pokémon GO catch brands? The fit effect of game characters and brands on efficacy of brand communications. Journal of Marketing Communications 25, 6 (Sept. 2019), 645–660. https://doi.org/10.1080/13527266.2018.1471614 Publisher: Routledge.",
      "doi": ""
    },
    {
      "text": "Samuli Laato, Bastian Kordyaka, A.K.M. Najmul Islam, and Konstantinos Papangelis. 2021. Landlords of the Digital World: How Territoriality and Social Identity Predict Playing Intensity in Location-based Games. ScholarSpace, Honolulu, Hawaii. https://doi.org/10.24251/HICSS.2021.091",
      "doi": ""
    },
    {
      "text": "Samuli Laato, Bastian Kordyaka, Sampsa Rauti, Sonja M. Hyrynsalmi, M. Hoikkala, Tarja Pietarinen, Teemu Laajala, Mauri Paloheimo, N. Inaba, and S. Hyrynsalmi. 2020. Do primal instincts explain engagement in location-based games? A hypothesis-forming focus group study on territorial behavior. In GamiFIN. –, –.",
      "doi": ""
    },
    {
      "text": "Joonghwa Lee, Hyojung Park, and Kevin Wise. 2014. Brand interactivity and its effects on the outcomes of advergame play. New Media & Society 16, 8 (Dec. 2014), 1268–1286. https://doi.org/10.1177/1461444813504267 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Anna-Karin Lindqvist, Darla Castelli, Josef Hallberg, and Stina Rutberg. 2018. The Praise and Price of Pokémon GO: A Qualitative Study of Children’s and Parents’ Experiences. JMIR Serious Games 6, 1 (2018), e1. https://doi.org/10.2196/games.8979 Company: JMIR Serious Games Distributor: JMIR Serious Games Institution: JMIR Serious Games Label: JMIR Serious Games Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Janne Lindqvist, Justin Cranshaw, Jason Wiese, Jason Hong, and John Zimmerman. 2011. I’m the mayor of my house: examining why people use foursquare - a social-driven location sharing application. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 2409–2418. https://doi.org/10.1145/1978942.1979295",
      "doi": "10.1145/1978942.1979295"
    },
    {
      "text": "3909 LLC. 2013. Papers, Please. Game.",
      "doi": ""
    },
    {
      "text": "Kevin Lynch. 1960. The Image of the City. MIT Press, Cambridge, MA. Google-Books-ID: _phRPWsSpAgC.",
      "doi": ""
    },
    {
      "text": "José Martí-Parreño, Jesús Bermejo-Berros, and Joaquín Aldás-Manzano. 2017. Product Placement in Video Games: The Effect of Brand Familiarity and Repetition on Consumers’ Memory. Journal of Interactive Marketing 38 (May 2017), 55–63. https://doi.org/10.1016/j.intmar.2016.12.001",
      "doi": ""
    },
    {
      "text": "Carolina Martínez. 2019. The struggles of everyday life: How children view and engage with advertising in mobile games. Convergence 25, 5-6 (Dec. 2019), 848–867. https://doi.org/10.1177/1354856517743665 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Mattel. 1983. Kool-Aid Man. Game [Atari 2600].",
      "doi": ""
    },
    {
      "text": "Lisa K. Militello, Nathan Hanna, and Claudio R. Nigg. 2018. Pokémon GO Within the Context of Family Health: Retrospective Study. JMIR Pediatrics and Parenting 1, 2 (Oct. 2018), e10679. https://doi.org/10.2196/10679 Company: JMIR Pediatrics and Parenting Distributor: JMIR Pediatrics and Parenting Institution: JMIR Pediatrics and Parenting Label: JMIR Pediatrics and Parenting Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Dominik Molitor, Martin Spann, Anindya Ghose, and Philipp Reichhart. 2020. Effectiveness of Location-Based Advertising and the Impact of Interface Design. Journal of Management Information Systems 37, 2 (April 2020), 431–456. https://doi.org/10.1080/07421222.2020.1759922 Publisher: Taylor & Francis Ltd.",
      "doi": ""
    },
    {
      "text": "John Montgomery. 1998. Making a city: Urbanity, vitality and urban design. Journal of Urban Design 3, 1 (Feb. 1998), 93–116. https://doi.org/10.1080/13574809808724418 Publisher: Routledge _eprint: https://doi.org/10.1080/13574809808724418.",
      "doi": ""
    },
    {
      "text": "Janet Horowitz Murray. 1997. Hamlet on the holodeck : the future of narrative in cyberspace. Cambridge, Mass. : MIT Press, Cambridge, Massachusetts. http://archive.org/details/hamletonholodeck00murr",
      "doi": ""
    },
    {
      "text": "Niantic. 2016. Pokémon GO. Game [Mobile].",
      "doi": ""
    },
    {
      "text": "Niantic. 2020. Local Business Recovery Initiative Nomination. https://web.archive.org/web/20220625234946/https://nianticlabs.com/en/nominate-local/",
      "doi": ""
    },
    {
      "text": "Niantic. 2021. Ingress. Game [Mobile].",
      "doi": ""
    },
    {
      "text": "Niantic. 2021. Pokémon GO - Sponsored Gifts. https://niantic.helpshift.com/a/pokemon-go/",
      "doi": ""
    },
    {
      "text": "Niantic. 2021. Sponsored Locations for Business. https://nianticlabs.com/en/sponsoredlocations/",
      "doi": ""
    },
    {
      "text": "Niantic. 2022. Sponsored Gifts — Pokémon GO Help Center. https://web.archive.org/web/20220516150507/https://niantic.helpshift.com/hc/en/6-pokemon-go/faq/2952-sponsored-gifts/",
      "doi": ""
    },
    {
      "text": "Fabrizio Palmas, Ramona Reinelt, and Gudrun Klinker. 2021. In-Game Advertising: Brand Integration and Player Involvement as Key Influencing Factors on Brand Recall. In HCI in Games: Experience Design and Game Mechanics(Lecture Notes in Computer Science), Xiaowen Fang (Ed.). Springer International Publishing, Cham, 352–367. https://doi.org/10.1007/978-3-030-77277-2_27",
      "doi": "10.1007/978-3-030-77277-2_27"
    },
    {
      "text": "pandas development team. 2022. pandas.DataFrame.sample — pandas 1.4.2 documentation. https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sample.html?highlight=sample#pandas.DataFrame.sample",
      "doi": ""
    },
    {
      "text": "Konstantinos Papangelis, Alan Chamberlain, Ioanna Lykourentzou, Vassilis-Javed Khan, Michael Saker, Hai-Ning Liang, Irwyn Sadien, and Ting Cao. 2020. Performing the Digital Self: Understanding Location-Based Social Networking, Territory, Space, and Identity in the City. ACM Transactions on Computer-Human Interaction 27, 1 (Jan. 2020), 1:1–1:26. https://doi.org/10.1145/3364997",
      "doi": "10.1145/3364997"
    },
    {
      "text": "Konstantinos Papangelis, Melvin Metzger, Yiyeng Sheng, Hai-Ning Liang, Alan Chamberlain, and Ting Cao. 2017. Conquering the City: Understanding perceptions of Mobility and Human Territoriality in Location-based Mobile Games. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (Sept. 2017), 90:1–90:24. https://doi.org/10.1145/3130955",
      "doi": "10.1145/3130955"
    },
    {
      "text": "Konstantinos Papangelis, Melvin Metzger, Yiyang Sheng, Hai-Ning Liang, Alan Chamberlain, and Vassilis-Javed Khan. 2017. \"Get Off My Lawn!\": Starting to Understand Territoriality in Location Based Mobile Games. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 1955–1961. https://doi.org/10.1145/3027063.3053154",
      "doi": "10.1145/3027063.3053154"
    },
    {
      "text": "Konstantinos Papangelis, Yiyang Sheng, Hai-Ning Liang, Alan Chamberlain, Vassilis-Javed Khan, and Ting Cao. 2017. Unfolding the interplay of self-identity and expressions of territoriality in location-based social networks. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. ACM, Maui Hawaii, 177–180. https://doi.org/10.1145/3123024.3123081",
      "doi": "10.1145/3123024.3123081"
    },
    {
      "text": "qsrinternational. 2022. Best Qualitative Data Analysis Software for Researchers | NVivo. https://www.qsrinternational.com/nvivo-qualitative-data-analysis-software/home",
      "doi": ""
    },
    {
      "text": "Qualtrics. 2022. Qualtrics XM - Experience Management Software. https://www.qualtrics.com/",
      "doi": ""
    },
    {
      "text": "Redacted. 2021. Redacted.",
      "doi": ""
    },
    {
      "text": "Michael Saker and Leighton Evans. 2016. Everyday life and locative play: an exploration of Foursquare and playful engagements with space and place. Media, Culture & Society 38, 8 (Nov. 2016), 1169–1183. https://doi.org/10.1177/0163443716643149 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Michael Saker and Leighton Evans. 2021. Intergenerational Locative Play. Emerald Publishing Limited, Howard House, Wagon Lane, Bingley BD16 1WA, UK. https://books.emeraldinsight.com/page/detail/Intergenerational-Locative-Play/?k=9781839091407",
      "doi": ""
    },
    {
      "text": "Adriana de Souza e Silva and Daniel M. Sutko. 2008. Playing Life and Living Play: How Hybrid Reality Games Reframe Space, Play, and the Ordinary. Critical Studies in Media Communication 25, 5 (Dec. 2008), 447–465. https://doi.org/10.1080/15295030802468081 Publisher: Routledge _eprint: https://doi.org/10.1080/15295030802468081.",
      "doi": ""
    },
    {
      "text": "Adriana de Souza e Silva and Daniel M. Sutko (Eds.). 2009. Digital cityscapes: merging digital and urban playspaces. Number v. 57 in Digital formations. Peter Lang, New York. OCLC: ocn313365398.",
      "doi": ""
    },
    {
      "text": "Statista. 2020. Global Pokémon Go users by region 2020. https://www.statista.com/statistics/665640/pokemon-go-global-android-apple-users/",
      "doi": ""
    },
    {
      "text": "Celina Steffen, Gunnar Mau, and Hanna Schramm-Klein. 2013. Who Is the Loser When I Lose the Game? Does Losing an Advergame Have a Negative Impact on the Perception of the Brand?Journal of Advertising 42, 2-3 (April 2013), 183–195. https://doi.org/10.1080/00913367.2013.774598 Publisher: Routledge _eprint: https://doi.org/10.1080/00913367.2013.774598.",
      "doi": ""
    },
    {
      "text": "Niantic Support. 2021. Pokémon GO. https://niantic.helpshift.com/a/pokemon-go/",
      "doi": ""
    },
    {
      "text": "Paul Tassi. 2016. ’Pokémon GO’ Might Be About To Use A Massive Starbucks Promotion To Launch Gen 2. https://www.forbes.com/sites/insertcoin/2016/12/06/pokemon-go-might-be-about-to-use-a-massive-starbucks-promotion-to-launch-gen-2/ Section: Games.",
      "doi": ""
    },
    {
      "text": "Ramaprasad Unni and Robert Harmon. 2007. Perceived Effectiveness of Push vs. Pull Mobile Location Based Advertising. Journal of Interactive Advertising 7, 2 (March 2007), 28–40. https://doi.org/10.1080/15252019.2007.10722129 Publisher: Routledge _eprint: https://doi.org/10.1080/15252019.2007.10722129.",
      "doi": ""
    },
    {
      "text": "Kellie Vella, Daniel Johnson, Vanessa Wan Sze Cheng, Tracey Davenport, Jo Mitchell, Madison Klarkowski, and Cody Phillips. 2019. A Sense of Belonging: Pokémon GO and Social Connectedness. Games and Culture 14, 6 (Sept. 2019), 583–603. https://doi.org/10.1177/1555412017719973 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Sarah Vizard. 2016. McDonald’s on Pokémon Go: ‘We are enjoying what it is doing for our business’. https://www.marketingweek.com/mcdonalds-on-pokemon-go-we-are-enjoying-what-it-is-doing-for-our-business/",
      "doi": ""
    },
    {
      "text": "Martin K.J. Waiguny, Michelle R. Nelson, and Bernhard Marko. 2013. How Advergame Content Influences Explicit and Implicit Brand Attitudes: When Violence Spills Over. Journal of Advertising 42, 2-3 (April 2013), 155–169. https://doi.org/10.1080/00913367.2013.774590 Publisher: Routledge _eprint: https://doi.org/10.1080/00913367.2013.774590.",
      "doi": ""
    },
    {
      "text": "Bo Kampmann Walther. 2011. Towards a theory of pervasive ludology: reflections on gameplay, rules, and space. Digital Creativity 22, 3 (Sept. 2011), 134–147. https://doi.org/10.1080/14626268.2011.603734 Publisher: Routledge _eprint: https://doi.org/10.1080/14626268.2011.603734.",
      "doi": ""
    },
    {
      "text": "Yihong Wang, Konstantinos Papangelis, Michael Saker, Ioanna Lykourentzou, Alan Chamberlain, and Vassilis-Javed Khan. 2020. Crowdsourcing in China: Exploring the Work Experiences of Solo Crowdworkers and Crowdfarm Workers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376473",
      "doi": "10.1145/3313831.3376473"
    },
    {
      "text": "Ying Wang and Shaojing Sun. 2010. Examining the role of beliefs and attitudes in online advertising: A comparison between the USA and Romania. International Marketing Review 27, 1 (Feb. 2010), 87–107. https://doi.org/10.1108/02651331011020410",
      "doi": ""
    },
    {
      "text": "Kazuhiro Watanabe, Norito Kawakami, Kotaro Imamura, Akiomi Inoue, Akihito Shimazu, Toru Yoshikawa, Hisanori Hiro, Yumi Asai, Yuko Odagiri, Etsuko Yoshikawa, 2017. Pokémon GO and psychological distress, physical complaints, and work performance among adult workers: a retrospective cohort study. Scientific reports 7, 1 (2017), 1–7.",
      "doi": ""
    },
    {
      "text": "Kazuhiro Watanabe, Norito Kawakami, Kotaro Imamura, Akiomi Inoue, Akihito Shimazu, Toru Yoshikawa, Hisanori Hiro, Yumi Asai, Yuko Odagiri, Etsuko Yoshikawa, and Akizumi Tsutsumi. 2017. Pokémon GO and psychological distress, physical complaints, and work performance among adult workers: a retrospective cohort study. Scientific Reports 7, 1 (Sept. 2017), 10758. https://doi.org/10.1038/s41598-017-11176-2 Number: 1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Orlando Woods. 2020. The territoriality of teams: Assembling power through the playing of Pokémon Go. Mobile Media & Communication 0, 0 (Nov. 2020), 2050157920968867. https://doi.org/10.1177/2050157920968867 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Linwan Wu and Matthew A. Stilwell. 2017. Exploring the marketing potential of location-based mobile games. Journal of Research in Interactive Marketing 12, 1 (Jan. 2017), 22–44. https://doi.org/10.1108/JRIM-06-2017-0041 Publisher: Emerald Publishing Limited.",
      "doi": ""
    },
    {
      "text": "Heng Xu, Lih-Bin Oh, and Hock-Hai Teo. 2009. Perceived effectiveness of text vs. multimedia Location-Based Advertising messaging. International Journal of Mobile Communications 7, 2 (Jan. 2009), 154–177. https://doi.org/10.1504/IJMC.2009.02244 Publisher: Inderscience Publishers.",
      "doi": ""
    },
    {
      "text": "Heng Xu, Hock-Hai Teo, Bernard C. Y. Tan, and Ritu Agarwal. 2009. The Role of Push-Pull Technology in Privacy Calculus: The Case of Location-Based Services. Journal of Management Information Systems 26, 3 (Dec. 2009), 135–174. https://doi.org/10.2753/MIS0742-1222260305",
      "doi": "10.2753/MIS0742-1222260305"
    },
    {
      "text": "Zhenzhen Zhao and Damien Renard. 2018. Viral Promotional Advergames: How Intrinsic Playfulness and the Extrinsic Value of Prizes Elicit Behavioral Responses. Journal of Interactive Marketing 41 (Feb. 2018), 94–103. https://doi.org/10.1016/j.intmar.2017.09.004",
      "doi": ""
    },
    {
      "text": "Inc Zoom Video Communications. 2022. Video Conferencing, Cloud Phone, Webinars, Chat, Virtual Events | Zoom. https://zoom.us/",
      "doi": ""
    },
    {
      "text": "Didem Özkul and Lee Humphreys. 2015. Record and remember: Memory and meaning-making practices through mobile media. Mobile Media & Communication 3, 3 (2015), 351–365. https://doi.org/10.1177/2050157914565846 _eprint: https://doi.org/10.1177/2050157914565846.",
      "doi": ""
    }
  ]
}