{
  "doi": "10.1145/3544548.3581156",
  "title": "Conformal, Seamless, Sustainable: Multimorphic Textile-forms as a Material-Driven Design Approach for HCI",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Technology embeddedness in HCI textiles has great potential for enabling novel interactions and enriched experiences, but unless carefully designed, could inadvertently worsen HCI’s sustainability problem. In an attempt to bridge sustainable debates and practical material-driven scholarship in HCI, we propose Multimorphic Textile-forms (MMTF), as a design approach developed through a lens of multiplicity and extended life cycles, that facilitate change in both design/production and use-time via the simultaneous thinking of the qualities and behaviour of material and form. We provide a number of cases, textile-form methods and vocabulary to enable exploration in this emerging design space. MMTF grants insights into textiles as complex material systems whose behaviour can be tuned across material, interaction and ecological scales for conformal, seamless, and sustainable outcomes.",
  "tags": [
    "HCI textiles",
    "Sustainability",
    "Multimorphic textile-forms",
    "Material-driven design",
    "Textile-form",
    "Materials experience."
  ],
  "authors": [
    {
      "name": "Holly McQuillan",
      "institution": "Industrial Design Engineering, Delft University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779313",
      "orcid": "0000-0002-3210-1696"
    },
    {
      "name": "Elvin Karana",
      "institution": "Industrial Design Engineering, Delft University of Technology, Netherlands",
      "img": "/do/10.1145/contrib-81508708476/rel-imgonly/elvinkarana.jpg",
      "acmid": "81508708476",
      "orcid": "0000-0001-9598-2753"
    }
  ],
  "references": [
    {
      "text": "Glenn Adamson. 2007. Craft and the Romance of the Studio. American Art 21, 1 (2007), 14–18.",
      "doi": ""
    },
    {
      "text": "Roya Aghighi. 2020. What if Our Clothes Were Alive and Photosynthesized?APRIA Journal 1, 1 (2020), 120–128.",
      "doi": ""
    },
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. 2019. Digital Fabrication of Soft Actuated Objects by Machine Knitting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300414",
      "doi": "10.1145/3290605.3300414"
    },
    {
      "text": "Lea Albaugh, James McCann, Scott E. Hudson, and Lining Yao. 2021. Engineering Multifunctional Spacer Fabrics Through Machine Knitting. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 498, 12 pages. https://doi.org/10.1145/3411764.3445564",
      "doi": "10.1145/3411764.3445564"
    },
    {
      "text": "Lea Albaugh, James McCann, Lining Yao, and Scott E. Hudson. 2021. Enabling Personal Computational Handweaving with a Low-Cost Jacquard Loom. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 497, 10 pages. https://doi.org/10.1145/3411764.3445750",
      "doi": "10.1145/3411764.3445750"
    },
    {
      "text": "Kristina Andersen and Ron Wakkary. 2019. The magic machine workshops: making personal design knowledge. In Proceedings of the 2019 CHI conference on human factors in computing systems. Association for Computing Machinery, 1–13.",
      "doi": "10.1145/3290605.3300342"
    },
    {
      "text": "Camilo Ayala-Garcia, Valentina Rognoli, and Elvin Karana. 2017. Five Kingdoms of DIY-Materials for Design. In EKSIG 2017 Alive Active Adaptive: International Conference on Experiential Knowledge and Emerging Materials. TU Delft Open, 222–234.",
      "doi": ""
    },
    {
      "text": "Mette Bak-Andersen. 2018. When matter leads to form: Material driven design for sustainability. Temes de disseny34(2018), 10–33.",
      "doi": ""
    },
    {
      "text": "Srikkanth Balasubramanian, Kui Yu, Anne S Meyer, Elvin Karana, and Marie-Eve Aubin-Tam. 2021. Bioprinting of regenerative photosynthetic living materials. Advanced Functional Materials 31, 31 (2021), 2011162.",
      "doi": ""
    },
    {
      "text": "Philip Ball. 2021. Animate materials. MRS Bulletin 46, 7 (2021), 553–559. https://doi.org/10.1557/s43577-021-00141-0",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2007. Meeting the universe halfway: Quantum physics and the entanglement of matter and meaning. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Bahareh Barati, Elisa Giaccardi, and Elvin Karana. 2018. The making of performativity in designing [with] smart material composites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, 1–11.",
      "doi": "10.1145/3173574.3173579"
    },
    {
      "text": "Jeffrey Bardzell, Tyler Pace, and Jennifer Terrell. 2010. Virtual fashion and avatar design: A survey of consumers and designers. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries. Association for Computing Machinery, 599–602.",
      "doi": "10.1145/1868914.1868983"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology. In SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery. https://doi.org/10.1145/1978942.1979041",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Eric PS Baumer and M Six Silberman. 2011. When the implication is not to design (technology). In CHI ’11. Association for Computing Machinery, 2271–2274.",
      "doi": ""
    },
    {
      "text": "Fiona Bell, Latifa Al Naimi, Ella McQuaid, and Mirela Alistar. 2022. Designing with Alganyl. In TEI ’22. Association for Computing Machinery. https://doi.org/10.1145/3490149.3501308",
      "doi": "10.1145/3490149.3501308"
    },
    {
      "text": "Fiona Bell, Alice Hong, Andreea Danielescu, Aditi Maheshwari, Ben Greenspan, Hiroshi Ishii, Laura Devendorf, and Mirela Alistar. 2021. Self-deStaining Textiles: Designing Interactive Systems with Fabric, Stains and Light. In CHI ‘21. Association for Computing Machinery. https://doi.org/10.1145/3411764.3445155",
      "doi": "10.1145/3411764.3445155"
    },
    {
      "text": "Jane Bennett. 2010. Vibrant matter: A political ecology of things. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Jane Bennett, Pheng Cheah, Melissa A Orlie, and Elizabeth Grosz. 2010. New materialisms: Ontology, agency, and politics. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Jenny Bergström, Brendon Clark, Alberto Frigo, Ramia Mazé, Johan Redström, and Anna Vallgårda. 2010. Becoming materials: material forms and forms of practice. Digital Creativity 21, 3 (2010), 155–172.",
      "doi": ""
    },
    {
      "text": "Elizabeth Esther Bigger and Luis Edgardo Fraguada. 2016. Programmable Plaid: The Search for Seamless Integration in Fashion and Technology.. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (Heidelberg, Germany) (UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 464–469. https://doi.org/10.1145/2968219.2971343",
      "doi": "10.1145/2968219.2971343"
    },
    {
      "text": "Manik Chandra Biswas, Samit Chakraborty, Abhishek Bhattacharjee, and Zaheeruddin Mohammed. 2021. 4D Printing of Shape Memory Materials for Textiles: Mechanism, Mathematical Modeling, and Challenges. Advanced Functional Materials 31, 19 (2021), 2100257. https://doi.org/10.1002/adfm.202100257",
      "doi": ""
    },
    {
      "text": "Alberto Boem and Giovanni Maria Troiano. 2019. Non-Rigid HCI: A Review of Deformable Interfaces and Input. In DIS ‘19. Association for Computing Machinery. https://doi.org/10.1145/3322276.3322347",
      "doi": "10.1145/3322276.3322347"
    },
    {
      "text": "Spyros Bofylatos. 2022. Upcycling Systems Design, Developing a Methodology through Design. Sustainability 14, 2 (2022), 600. https://doi.org/10.3390/su14020600",
      "doi": ""
    },
    {
      "text": "Ian Bogost and Nick Montfort. 2007. New media as material constraint: An introduction to platform studies. In Electronic techtonics: thinking at the interface. Proceedings of the first international HASTAC conference. 176–193.",
      "doi": ""
    },
    {
      "text": "Christina Bremer, Bran Knowles, and Adrian Friday. 2022. Have We Taken On Too Much?: A Critical Review of the Sustainable HCI Landscape. In CHI ’22. Association for Computing Machinery. https://doi.org/10.1145/3491102.3517609",
      "doi": "10.1145/3491102.3517609"
    },
    {
      "text": "Audrey Briot, Martin De Bie, Alice Giordani, Leon Denise, and Cedric Honnet. 2021. Topographie Digitale. In TEI ‘21. Association for Computing Machinery. https://doi.org/10.1145/3430524.3444641",
      "doi": "10.1145/3430524.3444641"
    },
    {
      "text": "Andrew Brooks, Kate Fletcher, Robert A Francis, Emma Dulcie Rigby, and Thomas Roberts. 2018. Fashion, sustainability, and the anthropocene. Utopian Studies 28, 3 (2018), 482–504.",
      "doi": ""
    },
    {
      "text": "S Brown. 2019. Consequence Scanning Manual, Version 1. London: Doteveryone (2019).",
      "doi": ""
    },
    {
      "text": "Leah Buechley, Daniela K. Rosner, Eric Paulos, and Amanda Williams. 2009. DIY for CHI. In CHI 2009. Association for Computing Machinery. https://doi.org/10.1145/1520340.1520750",
      "doi": "10.1145/1520340.1520750"
    },
    {
      "text": "Alice Buso, Holly McQuillan, Kaspar Jansen, and Elvin Karana. 2022. The Unfolding of Textileness in Animated Textiles: An Exploration of Woven Textile-Forms. In DRS ’22. Design Research Society. https://doi.org/10.1145/2702123.2702337",
      "doi": "10.1145/2702123.2702337"
    },
    {
      "text": "Luca Cera, Grant M. Gonzalez, Qihan Liu, Suji Choi, Christophe O. Chantre, Juncheol Lee, Rudy Gabardi, Myung Chul Choi, Kwanwoo Shin, and Kevin Kit Parker. 2021. A bioinspired and hierarchically structured shape-memory material. Nature Materials 20, 2 (2021), 242–249. https://doi.org/10.1038/s41563-020-0789-2",
      "doi": ""
    },
    {
      "text": "Samit Chakraborty and Manik Chandra Biswas. 2020. 3D printing technology of polymer-fiber composites in textile and fashion industry: A potential roadmap of concept to consumer. Composite Structures 248(2020), 112562.",
      "doi": ""
    },
    {
      "text": "Jonathan Chapman. 2005. Emotionally durable design: Objects, Experiences and Empathy. Vol. 2005. Earthscan, UK.",
      "doi": ""
    },
    {
      "text": "Jonathan Chapman. 2014. Designing Meaningful and Lasting User Experiences. Bloomsbury Academic, 137–148.",
      "doi": ""
    },
    {
      "text": "Hyung Woo Choi, Dong-Wook Shin, Jiajie Yang, Sanghyo Lee, Cátia Figueiredo, Stefano Sinopoli, Kay Ullrich, Petar Jovančić, Alessio Marrani, Roberto Momentè, João Gomes, Rita Branquinho, Umberto Emanuele, Hanleem Lee, Sang Yun Bang, Sung-Min Jung, Soo Deok Han, Shijie Zhan, William Harden-Chaters, Yo-Han Suh, Xiang-Bing Fan, Tae Hoon Lee, Mohamed Chowdhury, Youngjin Choi, Salvatore Nicotera, Andrea Torchia, Francesc Mañosa Moncunill, Virginia Garcia Candel, Nelson Durães, Kiseok Chang, Sunghee Cho, Chul-Hong Kim, Marcel Lucassen, Ahmed Nejim, David Jiménez, Martijn Springer, Young-Woo Lee, Seungnam Cha, Jung Inn Sohn, Rui Igreja, Kyungmin Song, Pedro Barquinha, Rodrigo Martins, Gehan A. J. Amaratunga, Luigi G. Occhipinti, Manish Chhowalla, and Jong Min Kim. 2022. Smart textile lighting/display system with multifunctional fibre devices for large scale smart home and IoT applications. Nature Communications 13, 1 (2022). https://doi.org/10.1038/s41467-022-28459-6",
      "doi": ""
    },
    {
      "text": "Carole Collet. 2017. Grow-made textiles. In EKSIG 2017: Alive. Active. Adaptive.",
      "doi": ""
    },
    {
      "text": "Rob Comber, Shaowen Bardzell, Jeffrey Bardzell, Mike Hazas, and Michael Muller. 2020. Announcing a new CHI subcommittee. Interactions 27, 4 (2020), 101–103. https://doi.org/10.1145/3407228",
      "doi": "10.1145/3407228"
    },
    {
      "text": "Andy Crabtree and Tom Rodden. 2008. Hybrid ecologies: understanding cooperative interaction in emerging physical-digital environments. Personal and Ubiquitous Computing 12, 7 (2008), 481–493.",
      "doi": "10.1007/s00779-007-0142-7"
    },
    {
      "text": "Linda Dekhla. 2018. Weaving Dress: Exploring wholegarment weaving as a method to create expressive dress. Master’s thesis. MA thesis. University of Borås.",
      "doi": ""
    },
    {
      "text": "Designboom. 2010. Suzanne Lee: Biocouture Growing Textiles. Retrieved May 12, 2022 from https://www.designboom.com/design/suzanne-lee-biocouture-growing-textiles/",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Katya Arquilla, Sandra Wirtanen, Allison Anderson, and Steven Frost. 2020. Craftspeople as Technical Collaborators: Lessons Learned through an Experimental Weaving Residency. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376820"
    },
    {
      "text": "Laura Devendorf, Sasha De Koninck, and Etta Sandry. 2022. An Introduction to Weave Structure for HCI: A How-to and Reflection on Modes of Exchange. In DIS ‘22. Association for Computing Machinery. https://doi.org/10.1145/3532106.3534567",
      "doi": "10.1145/3532106.3534567"
    },
    {
      "text": "Laura Devendorf and Chad Di Lauro. 2019. Adapting double weaving and yarn plying techniques for smart textiles applications. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction. 77–85.",
      "doi": "10.1145/3294109.3295625"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I don’t Want to Wear a Screen\". In CHI ’16. Association for Computing Machinery. https://doi.org/10.1145/2858036.2858192",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Laura Devendorf and Kimiko Ryokai. 2015. Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication. In CHI 2015. Association for Computing Machinery. https://doi.org/10.1145/2702123.2702547",
      "doi": "10.1145/2702123.2702547"
    },
    {
      "text": "[47] Kristin N Dew.2019. Exploring Sustainable Materials through Interaction Design Practice. Thesis.",
      "doi": ""
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2019. Designing with Waste. In DIS ‘19. Association for Computing Machinery. https://doi.org/10.1145/3322276.3322320",
      "doi": "10.1145/3322276.3322320"
    },
    {
      "text": "Carl F. DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2010).",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability. In DIS 2010. Association for Computing Machinery. https://doi.org/10.1145/1858171.1858173",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Paul Dourish and Melissa Mazmanian. 2011. Media as material: Information representations as material foundations for organizational practice. In Third international symposium on process organization studies, Vol. 92.",
      "doi": ""
    },
    {
      "text": "Johanne Mose Entwistle, Mia Kruse Rasmussen, Nervo Verdezoto, Robert S. Brewer, and Mads Schaarup Andersen. 2015. Beyond the Individual: The Contextual Wheel of Practice as a Research Framework for Sustainable HCI. In CHI ’15. Association for Computing Machinery. https://doi.org/10.1145/2702123.2702232",
      "doi": "10.1145/2702123.2702232"
    },
    {
      "text": "Jack Forman, Mustafa Doga Dogan, Hamilton Forsythe, and Hiroshi Ishii. 2020. DefeXtiles: 3D printing Quasi-Woven fabric via under-extrusion. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, 1222–1233.",
      "doi": "10.1145/3379337.3415876"
    },
    {
      "text": "Raune Frankjær and Peter Dalsgaard. 2018. Understanding Craft-Based Inquiry in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 473–484. https://doi.org/10.1145/3196709.3196750",
      "doi": "10.1145/3196709.3196750"
    },
    {
      "text": "Mikhaila Friske, Shanel Wu, and Laura Devendorf. 2019. AdaCAD: Crafting Software For Smart Textiles Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300575",
      "doi": "10.1145/3290605.3300575"
    },
    {
      "text": "Verena Fuchsberger, Martin Murer, Thomas Meneweger, and Manfred Tscheligi. 2014. Capturing the in-between of interactive artifacts and users: a materiality-centered approach. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational. 451–460.",
      "doi": "10.1145/2639189.2639219"
    },
    {
      "text": "Verena Fuchsberger, Martin Murer, Manfred Tscheligi, Silvia Lindtner, Shaowen Bardzell, Jeffrey Bardzell, Andreas Reiter, and Pernille Bjorn. 2016. Fabrication and HCI. In CHI ‘16. Association for Computing Machinery. https://doi.org/10.1145/2851581.2856491",
      "doi": "10.1145/2851581.2856491"
    },
    {
      "text": "Elisa Giaccardi and Elvin Karana. 2015. Foundations of Materials Experience. In CHI ’15. Association for Computing Machinery. https://doi.org/10.1145/2702123.2702337",
      "doi": "10.1145/2702123.2702337"
    },
    {
      "text": "Elisa Giaccardi, Elvin Karana, Holly Robbins, and Patrizia D’Olivo. 2014. Growing traces on objects of daily use. In DIS ‘14. Association for Computing Machinery. https://doi.org/10.1145/2598510.2602964",
      "doi": "10.1145/2598510.2602964"
    },
    {
      "text": "Bruna Goveia Da Rocha, Johannes M. L. Van Der Kolk, and Kristina Andersen. 2021. Exquisite Fabrication. In CHI ‘21. Association for Computing Machinery. https://doi.org/10.1145/3411764.3445236",
      "doi": "10.1145/3411764.3445236"
    },
    {
      "text": "Ramyah Gowrishankar, Katharina Bredies, and Salu Ylirisku. 2017. A strategy for Material-Specific e-Textile interaction design. In Smart Textiles. Springer, 233–257.",
      "doi": ""
    },
    {
      "text": "Shad Gross, Jeffrey Bardzell, and Shaowen Bardzell. 2014. Structures, forms, and stuff: the materiality and medium of interaction. Personal and Ubiquitous Computing 18, 3 (2014), 637–649.",
      "doi": "10.1007/s00779-013-0689-4"
    },
    {
      "text": "Eduard Georges Groutars, Carmen Clarice Risseeuw, Colin Ingham, Raditijo Hamidjaja, Willemijn S Elkhuizen, Sylvia C Pont, and Elvin Karana. 2022. Flavorium: An Exploration of Flavobacteria’s Living Aesthetics for Living Color Interfaces. In CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": ""
    },
    {
      "text": "Li Guo, Tariq Bashir, Erik Bresky, and N-K Persson. 2016. Electroconductive textiles and textile-based electromechanical sensors—integration in as an approach for smart textiles. Elsevier, 657–693.",
      "doi": ""
    },
    {
      "text": "Yang Guo, Qian Ye, Xiaopeng Zheng, Shikui Chen, Na Lei, Yuanqi Zhang, and David Xianfeng Gu. 2020. Computational generation and conformal fabrication of woven fabric structures by harmonic foliation. Computer Methods in Applied Mechanics and Engineering 363 (2020), 112874.",
      "doi": ""
    },
    {
      "text": "Katharina Halusa. 2022. Braided Textiles. Retrieved May 12, 2022 from https://braidedtextiles.com/",
      "doi": ""
    },
    {
      "text": "Foad Hamidi and Melanie Baljko. 2014. Rafigh: a living media interface for speech intervention. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1817–1820.",
      "doi": "10.1145/2556288.2557402"
    },
    {
      "text": "Lon Åke Erni Johannes Hansson, Teresa Cerratto Pargman, and Daniel Sapiens Pargman. 2021. A Decade of Sustainable HCI: Connecting SHCI to the Sustainable Development Goals. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (2021).",
      "doi": "10.1145/3411764.3445069"
    },
    {
      "text": "Claire Harvey, Emily Holtzman, Joy Ko, Brooks Hagan, Rundong Wu, Steve Marschner, and David Kessler. 2019. Weaving objects: spatial design and functionality of 3D-woven textiles. Leonardo 52, 4 (2019), 381–388.",
      "doi": ""
    },
    {
      "text": "Aniela Hoitink. 2022. MycoTEX. Retrieved May 12, 2022 from https://www.mycotex.nl/",
      "doi": ""
    },
    {
      "text": "Lars Erik Holmquist, Albrecht Schmidt, and Brygg Ullmer. 2004. Tangible interfaces in perspective., 291–293 pages.",
      "doi": ""
    },
    {
      "text": "Elaine M. Huang and Khai N. Truong. 2008. Breaking the disposable technology paradigm. In CHI ‘08. Association for Computing Machinery Press. https://doi.org/10.1145/1357054.1357110",
      "doi": "10.1145/1357054.1357110"
    },
    {
      "text": "Kunpeng Huang, Ruojia Sun, Ximeng Zhang, Md Tahmidul Islam Molla, Margaret Dunne, Francois Guimbretiere, and Cindy Hsin-Liu Kao. 2021. WovenProbe: Probing Possibilities for Weaving Fully-Integrated On-Skin Systems Deployable in the Field. In DIS ‘21. Association for Computing Machinery. https://doi.org/10.1145/3461778.3462105",
      "doi": "10.1145/3461778.3462105"
    },
    {
      "text": "Tim Ingold. 2013. Making: Anthropology, archaeology, art and architecture. Routledge.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical atoms: beyond tangible bits, toward transformable materials. interactions 19, 1 (2012), 38–51.",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. Association for Computing Machinery, 234–241.",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Lee Jones. 2021. The E-Darning Sampler: Exploring E-Textile Repair with Darning Looms. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–5.",
      "doi": "10.1145/3430524.3444700"
    },
    {
      "text": "Hella Jongerius. 2021. Pliable Architecture.",
      "doi": ""
    },
    {
      "text": "Rosemary Joyce. 2011. Traces of the Human Presence: Antecedents and Precedents. In annual an-tropological association meeting (AAA), Montreal.",
      "doi": ""
    },
    {
      "text": "Veronika Kapsali and Cathryn Hall. 2022. Sustainable approaches to textile design: Lessons from biology. In DRS ’22. Design Research Society. https://doi.org/10.21606/drs.2022.199",
      "doi": ""
    },
    {
      "text": "Elvin Karana, Bahareh Barati, Valentina Rognoli, and Anouk Zeeuw van der Laan. 2015. Material driven design (MDD): A method to design for material experiences. International Journal of Design 9, 2 (2015), 35–54.",
      "doi": ""
    },
    {
      "text": "Elvin Karana, Elisa Giaccardi, and Valentina Rognoli. 2017. Materially yours. Routledge, 206–221.",
      "doi": ""
    },
    {
      "text": "Jin Hee Kim, Kunpeng Huang, Simone White, Melissa Conroy, and Cindy Hsin-Liu Kao. 2021. KnitDermis: Fabricating tactile on-body interfaces through machine knitting. In Designing Interactive Systems Conference 2021. 1183–1200.",
      "doi": ""
    },
    {
      "text": "Pin-Sung Ku, Kunpeng Huang, and Cindy Hsin-Liu Kao. 2022. Patch-O: Deformable Woven Patches for On-body Actuation. In CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, 1–12.",
      "doi": ""
    },
    {
      "text": "Andreas R Köhler. 2013. Challenges for eco-design of emerging technologies: The case of electronic textiles. Materials and Design 51(2013), 51–60.",
      "doi": ""
    },
    {
      "text": "Andreas R. Köhler, Lorenz M. Hilty, and Conny Bakker. 2011. Prospective Impacts of Electronic Textiles on Recycling and Disposal. Journal of Industrial Ecology 15, 4 (2011), 496–511. https://doi.org/10.1111/j.1530-9290.2011.00358.x",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2005. Reassembling the social. Política y Sociedad 43, 3 (2005), 127–130.",
      "doi": ""
    },
    {
      "text": "Eldy S Lazaro Vasquez, Netta Ofer, Shanel Wu, Mary Etta West, Mirela Alistar, and Laura Devendorf. 2022. Exploring Biofoam as a Material for Tangible Interaction. In DIS ‘22. Association for Computing Machinery. https://doi.org/10.1145/3532106.3533494",
      "doi": "10.1145/3532106.3533494"
    },
    {
      "text": "Eldy S Lazaro Vasquez and Katia Vega. 2019. From plastic to biomaterials: prototyping DIY electronics with mycelium. In Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers. Association for Computing Machinery, 308–311.",
      "doi": ""
    },
    {
      "text": "Eldy S Lazaro Vasquez and Katia Vega. 2019. Myco-accessories: sustainable wearables with biodegradable materials. In Proceedings of the 23rd International Symposium on Wearable Computers. 306–311.",
      "doi": "10.1145/3341163.3346938"
    },
    {
      "text": "Eldy S Lazaro Vasquez, Hao-Chuan Wang, and Katia Vega. 2020. Introducing the sustainable prototyping life cycle for digital fabrication to designers. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, 1301–1312.",
      "doi": "10.1145/3357236.3395510"
    },
    {
      "text": "Jacqueline Lefferts. 2016. Gestalt process. Master’s thesis. MA thesis. Royal College of Arts.",
      "doi": ""
    },
    {
      "text": "Ann Light, Irina Shklovski, and Alison Powell. 2017. Design for Existential Crisis. In CHI 2017. Association for Computing Machinery. https://doi.org/10.1145/3027063.3052760",
      "doi": "10.1145/3027063.3052760"
    },
    {
      "text": "Szu-Yu Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2019. Symbiotic Encounters: HCI and Sustainable Agriculture. In CHI ’19. Association for Computing Machinery. https://doi.org/10.1145/3290605.3300547",
      "doi": "10.1145/3290605.3300547"
    },
    {
      "text": "Gabriel Loke, Tural Khudiyev, Brian Wang, Stephanie Fu, Syamantak Payra, Yorai Shaoul, Johnny Fung, Ioannis Chatziveroglou, Pin-Wen Chou, Itamar Chinn, Wei Yan, Anna Gitelson-Kahn, John Joannopoulos, and Yoel Fink. 2021. Digital electronics in fibres enable fabric-based machine-learning inference. Nature Communications 12, 1 (2021). https://doi.org/10.1038/s41467-021-23628-5",
      "doi": ""
    },
    {
      "text": "Yiyue Luo, Yunzhu Li, Pratyusha Sharma, Wan Shou, Kui Wu, Michael Foshey, Beichen Li, Tomás Palacios, Antonio Torralba, and Wojciech Matusik. 2021. Learning human–environment interactions using conformal tactile textiles. Nature Electronics 4, 3 (2021), 193–201. https://doi.org/10.1038/s41928-021-00558-0",
      "doi": ""
    },
    {
      "text": "Yiyue Luo, Kui Wu, Tomás Palacios, and Wojciech Matusik. 2021. KnitUI: Fabricating Interactive and Sensing Textiles with Machine Knitting. In CHI ‘21. Association for Computing Machinery. https://doi.org/10.1145/3411764.3445780",
      "doi": "10.1145/3411764.3445780"
    },
    {
      "text": "Yiyue Luo, Kui Wu, Andrew Spielberg, Michael Foshey, Daniela Rus, Tomás Palacios, and Wojciech Matusik. 2022. Digital Fabrication of Pneumatic Actuators with Integrated Sensing by Machine Knitting. In CHI ‘22. Association for Computing Machinery. https://doi.org/10.1145/3491102.3517577",
      "doi": "10.1145/3491102.3517577"
    },
    {
      "text": "Ellen MacArthur. 2013. Towards the circular economy. Journal of Industrial Ecology 2 (2013), 23–44.",
      "doi": ""
    },
    {
      "text": "Jennifer C. Mankoff, Eli Blevis, Alan Borning, Batya Friedman, Susan R. Fussell, Jay Hasbrouck, Allison Woodruff, and Phoebe Sengers. 2007. Environmental Sustainability and Interaction. In CHI ’07 (San Jose, CA, USA) (CHI EA ’07). Association for Computing Machinery, New York, NY, USA, 2121–2124. https://doi.org/10.1145/1240866.1240963",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Ezio Manzini. 1994. Design, Environment and Social Quality: From\" Existenzminimum\" to\" Quality Maximum\". Design Issues 10, 1 (1994), 37–43.",
      "doi": ""
    },
    {
      "text": "Jose Francisco Martinez Castro, Alice Buso, Jun Wu, and Elvin Karana. 2022. TEX(alive): A Toolkit To Explore Temporal Expressions In Shape-Changing Textile Interfaces. In DIS ‘22. Association for Computing Machinery. https://doi.org/10.1145/3532106.3533515",
      "doi": "10.1145/3532106.3533515"
    },
    {
      "text": "James McCann, Lea Albaugh, Vidya Narayanan, April Grow, Wojciech Matusik, Jennifer Mankoff, and Jessica Hodgins. 2016. A compiler for 3D machine knitting. ACM Transactions on Graphics (TOG) 35, 4 (2016), 1–11.",
      "doi": "10.1145/2897824.2925940"
    },
    {
      "text": "Holly McQuillan. 2019. Hybrid zero waste design practices. Zero waste pattern cutting for composite garment weaving and its implications. The Design Journal 22, sup1 (2019), 803–819.",
      "doi": ""
    },
    {
      "text": "[105] Holly McQuillan.2020. Zero Waste Systems Thinking: Multimorphic Textile-Forms. Thesis.",
      "doi": ""
    },
    {
      "text": "Holly McQuillan, Kathryn Walters, and Karin Peterson. 2021. Critical Textile Topologies X Planet City: The intersection of design practice and research. Research in Arts and Education 1 (2021).",
      "doi": ""
    },
    {
      "text": "David Mellis, Sean Follmer, Björn Hartmann, Leah Buechley, and Mark D Gross. 2013. FAB at CHI: digital fabrication tools, design, and community. 3307–3310.",
      "doi": ""
    },
    {
      "text": "Modern-synthesis.com. 2022. This is GMO. Retrieved May 12, 2022 from https://modern-synthesis.com/this-is-gmo",
      "doi": ""
    },
    {
      "text": "Annika Muehlbradt, Gregory Whiting, Shaun Kane, and Laura Devendorf. 2022. Knitting Access: Exploring Stateful Textiles with People with Disabilities. In DIS ‘22. Association for Computing Machinery. https://doi.org/10.1145/3532106.3533551",
      "doi": "10.1145/3532106.3533551"
    },
    {
      "text": "Martin Murer, John Fass, Kevin Walker, Anna Vallgarda, Verena Fuchsberger, and Manfred Tscheligi. 2015. Critical Ways of Making: Design Artefacts, De-Computation and Un-Crafting. (2015).",
      "doi": ""
    },
    {
      "text": "Martin Murer, Anna Vallgårda, Mattias Jacobsson, and Manfred Tscheligi. 2015. Un-crafting: Exploring tangible practices for deconstruction in interactive system design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. 469–472.",
      "doi": "10.1145/2677199.2683582"
    },
    {
      "text": "Vidya Narayanan, Lea Albaugh, Jessica Hodgins, Stelian Coros, and James McCann. 2018. Automatic Machine Knitting of 3D Meshes. ACM Transactions on Graphics 37, 3 (2018), 1–15. https://doi.org/10.1145/3186265",
      "doi": "10.1145/3186265"
    },
    {
      "text": "Vidya Narayanan, Kui Wu, Cem Yuksel, and James McCann. 2019. Visual knitting machine programming. ACM Transactions on Graphics (TOG) 38, 4 (2019), 1–13.",
      "doi": "10.1145/3306346.3322995"
    },
    {
      "text": "Audrey Ng. 2017. Grown microbial 3D fiber art, Ava: Fusion of Traditional Art with Technology. In ISWC ‘17. Association for Computing Machinery. https://doi.org/10.1145/3123021.3123069",
      "doi": "10.1145/3123021.3123069"
    },
    {
      "text": "Peter Q Nguyen, Noémie-Manuelle Dorval Courchesne, Anna Duraj-Thatte, Pichet Praveschotinunt, and Neel S Joshi. 2018. Engineered living materials: prospects and challenges for using biological systems to direct the assembly of smart materials. Advanced Materials 30, 19 (2018), 1704847.",
      "doi": ""
    },
    {
      "text": "Kirsi Niinimäki, Greg Peters, Helena Dahlbo, Patsy Perry, Timo Rissanen, and Alison Gwilt. 2020. The environmental price of fast fashion. Nature Reviews Earth and Environment 1, 4 (2020), 189–200.",
      "doi": ""
    },
    {
      "text": "Nithikul Nimkulrat. 2012. Hands-on intellect: Integrating craft practice into design research. International Journal of Design 6, 3 (2012), 1–14.",
      "doi": ""
    },
    {
      "text": "Aditya Shekhar Nittala, Arshad Khan, Klaus Kruttwig, Tobias Kraus, and Jürgen Steimle. 2020. PhysioSkin: Rapid Fabrication of Skin-Conformal Physiological Interfaces. In CHI ‘20. Association for Computing Machinery. https://doi.org/10.1145/3313831.3376366",
      "doi": "10.1145/3313831.3376366"
    },
    {
      "text": "Keisuke Ono, Shinichiro Iwamura, Akira Ogie, Tetsuaki Baba, and Paul Haimes. 2017. Textile++. In ACM SIGGRAPH 2017 Studio. Association for Computing Machinery. https://doi.org/10.1145/3084863.3084868",
      "doi": "10.1145/3084863.3084868"
    },
    {
      "text": "Simon Ozbek, Md Tahmidul Islam Molla, Crystal Compton, and Brad Holschuh. 2018. Novel manufacturing of advanced smart garments: Knitting with Spatially-Varying, Multi-Material Monofilament. In ISWC ’18. Association for Computing Machinery. https://doi.org/10.1145/3267242.3267278",
      "doi": "10.1145/3267242.3267278"
    },
    {
      "text": "Victor J Papanek. 1995. The green imperative: Natural design for the real world. Thames and Hudson.",
      "doi": ""
    },
    {
      "text": "Stefano Parisi, Valentina Rognoli, and Camilo Ayala Garcia. 2016. Designing materials experiences through passing of time: Material driven design method applied to mycelium-based composites. In 10th International Conference on Design and Emotion, D and E 2016. The Design and Emotion Society, 239–255.",
      "doi": ""
    },
    {
      "text": "Stefano Parisi, Valentina Rognoli, and Marieke Sonneveld. 2017. Material Tinkering. An inspirational approach for experiential learning and envisioning in product design education. The Design Journal 20, sup1 (2017), S1167–S1184. https://doi.org/10.1080/14606925.2017.1353059",
      "doi": ""
    },
    {
      "text": "Pat Pataranutaporn, Angela Vujic, David S Kong, Pattie Maes, and Misha Sra. 2020. Living bits: Opportunities and challenges for integrating living microorganisms in human-computer interaction. In Proceedings of the Augmented Humans International Conference. 1–12.",
      "doi": "10.1145/3384657.3384783"
    },
    {
      "text": "Karin Peterson. 2022. Form-defining systems of reverse crafting. Ph. D. Dissertation. Högskolan i Borås.",
      "doi": ""
    },
    {
      "text": "James Pierce, Yolande A. A. Strengers, Phoebe Sengers, and Susanne Bødker. 2013. Introduction to the special issue on practice-oriented approaches to sustainable HCI. ACM Transactions on Computer-Human Interaction (TOCHI) 20 (2013), 1 – 8.",
      "doi": "10.1145/2494260"
    },
    {
      "text": "Anna Piper and Katherine Townsend. 2015. Crafting the Composite Garment: The role of hand weaving in digital creation. Journal of Textile Design Research and Practice 3 (2015), 3–26. https://doi.org/10.1080/20511787.2015.1127037",
      "doi": ""
    },
    {
      "text": "Ana Piñeyro. 2019. Kinetic morphologies. Revealing opportunity from mistake. The Design Journal 22, sup1 (2019), 1871–1882.",
      "doi": ""
    },
    {
      "text": "Irene Posch and Geraldine Fitzpatrick. 2021. The Matter of Tools: Designing, Using and Reflecting on New Tools for Emerging ETextile Craft Practices. ACM Trans. Comput.-Hum. Interact. 28, 1, Article 4 (feb 2021), 38 pages. https://doi.org/10.1145/3426776",
      "doi": "10.1145/3426776"
    },
    {
      "text": "Irene Posch and Ebru Kurbak. 2016. CRAFTED LOGIC Towards Hand-Crafting a Computer. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 3881–3884. https://doi.org/10.1145/2851581.2891101",
      "doi": "10.1145/2851581.2891101"
    },
    {
      "text": "Irene Posch, Liza Stark, and Geraldine Fitzpatrick. 2019. eTextiles: Reviewing a Practice trough its Tool/Kits. In ISWC ’19. Association for Computing Machinery. https://doi.org/10.1145/3341163.3347738",
      "doi": "10.1145/3341163.3347738"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E Robinson. 2016. Project Jacquard: interactive digital textiles at scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4216–4227.",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Emmi Pouta and Jussi Ville Mikkonen. 2022. Woven eTextiles in HCI — a Literature Review. In Designing Interactive Systems Conference 2022. Association for Computing Machinery. https://doi.org/10.1145/3532106.3533566",
      "doi": "10.1145/3532106.3533566"
    },
    {
      "text": "Emmi Pouta, Riia Vidgren, Jaana Vapaavuori, and Mithila Mohan. 2022. Intertwining Material Science and Textile Thinking: Aspects of Contrast and Collaboration. In The Design Research Society Conference (DRS2022). Design Research Society.",
      "doi": ""
    },
    {
      "text": "Majken K Rasmussen, Esben W Pedersen, Marianne G Petersen, and Kasper Hornbæk. 2012. Shape-changing interfaces: a review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 735–744.",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Kate Raworth. 2017. Doughnut economics: seven ways to think like a 21st-century economist. Chelsea Green Publishing.",
      "doi": ""
    },
    {
      "text": "Christian Remy, Oliver Bates, Alan Dix, Vanessa Thomas, Mike Hazas, Adrian Friday, and Elaine M. Huang. 2018. Evaluation Beyond Usability: Validating Sustainable HCI Research. In CHI 2018. Association for Computing Machinery. https://doi.org/10.1145/3173574.3173790",
      "doi": "10.1145/3173574.3173790"
    },
    {
      "text": "Christian Remy, Silke Gegenbauer, and Elaine M. Huang. 2015. Bridging the Theory-Practice Gap. In CHI ’15. Association for Computing Machinery. https://doi.org/10.1145/2702123.2702567",
      "doi": "10.1145/2702123.2702567"
    },
    {
      "text": "Miriam Ribul, Kate Goldsworthy, and Carole Collet. 2021. Material-Driven Textile Design (MDTD): A methodology for designing circular material-driven fabrication and finishing processes in the materials science laboratory. Sustainability 13, 3 (2021), 1268.",
      "doi": ""
    },
    {
      "text": "[140] Timo Rissanen.2013. Zero-Waste Fashion Design: A Study at the Intersection of Cloth, Fashion Design and Pattern Cutting. Thesis.",
      "doi": ""
    },
    {
      "text": "Timo Rissanen and Holly McQuillan. 2016. Zero Waste Fashion Design. Bloomsbury Academic, London, UK.",
      "doi": ""
    },
    {
      "text": "Michael L. Rivera, Jack Forman, Scott E. Hudson, and Lining Yao. 2020. Hydrogel-Textile Composites. In CHI ‘20. Association for Computing Machinery. https://doi.org/10.1145/3334480.3382788",
      "doi": "10.1145/3334480.3382788"
    },
    {
      "text": "Michael L Rivera, Melissa Moukperian, Daniel Ashbrook, Jennifer Mankoff, and Scott E Hudson. 2017. Stretching the bounds of 3D printing with embedded textiles. In Proceedings of the 2017 CHI conference on human factors in computing systems. 497–508.",
      "doi": "10.1145/3025453.3025460"
    },
    {
      "text": "Holly Robbins, Elisa Giaccardi, and Elvin Karana. 2016. Traces as an Approach to Design for Focal Things and Practices. Association for Computing Machinery. https://doi.org/10.1145/2971485.2971538",
      "doi": "10.1145/2971485.2971538"
    },
    {
      "text": "Erica Robles and Mikael Wiberg. 2010. Texturing the \"material turn\" in interaction design. In TEI ‘10. Association for Computing Machinery. https://doi.org/10.1145/1709886.1709911",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Valentina Rognoli, Massimo Bianchini, Stefano Maffei, and Elvin Karana. 2015. DIY materials. Materials and Design 86(2015), 692–702.",
      "doi": ""
    },
    {
      "text": "Valentina Rognoli and Elvin Karana. 2014. Toward a new materials aesthetic based on imperfection and graceful aging. Elsevier, 145–154.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Miwa Ikemiya, Diana Kim, and Kristin Koch. 2013. Designing with traces. Association for Computing Machinery. https://doi.org/10.1145/2470654.2466218",
      "doi": "10.1145/2470654.2466218"
    },
    {
      "text": "Rebecca R. Ruckdashel, Dhanya Venkataraman, and Jay Hoon Park. 2021. Smart textiles: A toolkit to fashion the future. Journal of Applied Physics 129, 13 (2021), 130903. https://doi.org/10.1063/5.0024006",
      "doi": ""
    },
    {
      "text": "Yuriko Saito. 2007. Everyday aesthetics. Oxford University Press on Demand.",
      "doi": ""
    },
    {
      "text": "Victoria Elizabeth Salmon. 2020. Dynamic Folding Knits: Play, Interact, Explore. Master’s thesis. MA thesis. University of Borås.",
      "doi": ""
    },
    {
      "text": "Giuseppe Salvia, Francesca Ostuzzi, Valentina Rognoli, and Marinella Levi. 2010. The value of imperfection in sustainable design. Sustainability in Design: Now(2010), 1573–1589.",
      "doi": ""
    },
    {
      "text": "Gustav Sandin, Sandra Roos, Björn Spak, Bahareh Zamani, and Greg Peters. 2019. Environmental assessment of Swedish clothing consumption—six garments, Sustainable Futures. Report. MISTRA.",
      "doi": ""
    },
    {
      "text": "Diana Scherer. 2022. Grown Plantrootsculpture. Retrieved May 12, 2022 from https://dianascherer.nl",
      "doi": ""
    },
    {
      "text": "Karsten Schischke, Nils F. Nissen, and Martin Schneider-Ramelow. 2020. Flexible, stretchable, conformal electronics, and smart textiles: environmental life cycle considerations for emerging applications. MRS Communications 10, 1 (2020), 69–82. https://doi.org/10.1557/mrc.2019.157",
      "doi": ""
    },
    {
      "text": "Magdalena Schmid, Sonja Rümelin, and Hendrik Richter. 2013. Empowering materiality: inspiring the design of tangible interactions. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction. 91–98.",
      "doi": "10.1145/2460625.2460639"
    },
    {
      "text": "Jane Scott. 2017. Programmable Knitting: An Environmentally Responsive, Shape-Changing Textile System. MIT Press.",
      "doi": ""
    },
    {
      "text": "Jane Scott. 2018. Responsive Knit: the evolution of a programmable material system. In Proceedings of DRS2018, Vol. 4. Design Research Society, 1800–1811.",
      "doi": ""
    },
    {
      "text": "Jidong Shi, Su Liu, Lisha Zhang, Bao Yang, Lin Shu, Ying Yang, Ming Ren, Yang Wang, Jiewei Chen, and Wei Chen. 2020. Smart textile‐integrated microelectronic systems for wearable applications. Advanced materials 32, 5 (2020), 1901958.",
      "doi": ""
    },
    {
      "text": "Madlaina Signer, Alexandra Ion, and Olga Sorkine-Hornung. 2021. Developable Metamaterials: Mass-fabricable Metamaterials by Laser-Cutting Elastic Structures. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445666"
    },
    {
      "text": "M. Six Silberman, Lisa Nathan, Bran Knowles, Roy Bendor, Adrian Clear, Maria Håkansson, Tawanna Dillahunt, and Jennifer Mankoff. 2014. Next steps for sustainable HCI. Interactions 21, 5 (2014), 66–69. https://doi.org/10.1145/2651820",
      "doi": "10.1145/2651820"
    },
    {
      "text": "Walter R Stahel and Ellen MacArthur. 2019. The circular economy: A user’s guide. Routledge.",
      "doi": ""
    },
    {
      "text": "Ruojia Sun, Ryosuke Onose, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu Kao. 2020. Weaving a second skin: exploring opportunities for crafting on-skin interfaces through weaving. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, 365–377.",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Nervous System. 2016. Kinematics Dress 6. Retrieved May 12, 2022 from https://n-e-r-v-o-u-s.com/projects/sets/kinematics-dress/",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard, Ozgun Kilic Afsar, Marianela Ciolfi Felice, Nadia Campo Woytuk, and Madeline Balaam. 2020. Designing with Intimate Materials and Movements: Making\" Menarche Bits\". In Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, 587–600.",
      "doi": "10.1145/3357236.3395592"
    },
    {
      "text": "Haruki Takahashi and Jeeeun Kim. 2019. 3D printed fabric: techniques for design and 3D weaving programmable textiles. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, 43–51.",
      "doi": "10.1145/3332165.3347896"
    },
    {
      "text": "Letícia Faria Teixeira, Juliana De Vilhena Rodrigues, Lauro Arthur Farias Paiva Cohen, and Nubia Suely Silva Santos. 2022. A Material-Driven Design Approach Methodology in 3D Printing Waste Recycling. Springer International Publishing, 105–129. https://doi.org/10.1007/978-3-030-75235-4_6",
      "doi": ""
    },
    {
      "text": "Lavender Tessmer, Carmel Dunlap, Bjorn Sparrman, Schendy Kernizan, Jared Laucks, and Skylar Tibbits. 2019. Active Textile Tailoring. In SIGGRAPH ’19: Emerging Technologies. Association for Computing Machinery, 6:1–6:2. https://doi.org/10.1145/3305367.3327995",
      "doi": "10.1145/3305367.3327995"
    },
    {
      "text": "Skylar Tibbits. 2021. Designed for Change: Active products that adapt to fit users’ needs can he stronger, cheaper, and more comfortable than traditional, static objects. American Scientist 109(2021), 304+. https://link.gale.com/apps/doc/A675175310/AONE?u=anon 34eb0ad4&sid=googleScholar&xid=a277581e",
      "doi": ""
    },
    {
      "text": "Skylar Tibbits. 2021. Things Fall Together: A Guide to the New Materials Revolution. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Manel Torres. 2000. Fabrican. Retrieved May 12, 2022 from https://www.fabricanltd.com/",
      "doi": ""
    },
    {
      "text": "Riikka Townsend, Anne Louise Bang, and Jussi Mikkonen. 2020. Textile Designer Perspective on Haptic Interface Design: A Sensorial Platform for Conversation Between Discipline. Springer International Publishing, 110–127. https://doi.org/10.1007/978-3-030-50344-4_9",
      "doi": "10.1007/978-3-030-50344-4_9"
    },
    {
      "text": "Vasiliki Tsaknaki. 2021. The Breathing Wings: An Autobiographical Soma Design Exploration of Touch Qualities through Shape-Change Materials. In DIS ‘21. Association for Computing Machinery. https://doi.org/10.1145/3461778.3462054",
      "doi": "10.1145/3461778.3462054"
    },
    {
      "text": "Sander Valk, Yuning Chen, Mimi Nguyen, Tuukka Toivonen, and Celine Mougenot. 2022. Ideation and Consequence Scanning Beyond Human Perspectives in Biodesign. (2022).",
      "doi": ""
    },
    {
      "text": "Anna Vallgårda and Johan Redström. 2007. Computational composites. In CHI 2007. Association for Computing Machinery. https://doi.org/10.1145/1240624.1240706",
      "doi": "10.1145/1240624.1240706"
    },
    {
      "text": "Anna Vallgårda and Tomas Sokoler. 2010. A material strategy: Exploring material properties of computers. International Journal of Design 4, 3 (2010), 1–14.",
      "doi": ""
    },
    {
      "text": "Anna Vallgårda, Morten Winther, Nina Mørch, and Edit E Vizer. 2015. Temporal form in interaction design. International Journal of Design 9, 3 (2015).",
      "doi": ""
    },
    {
      "text": "Ed Van Hinte. 1997. Eternally Yours: visions on product endurance. 010 Publishers.",
      "doi": ""
    },
    {
      "text": "Susanna Vogel, Nathalia Campreguer França, Eleni Economidou, Bernhard Maurer, and Manfred Tscheligi. 2020. Circular HCI: Tools for Embedding Circular Thinking in Material-Driven Design. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, 233–237.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary. 2021. Things we could design: For more than human-centered worlds. MIT press.",
      "doi": ""
    },
    {
      "text": "Stuart Walker. 1997. Conscientious objects: product aesthetics in the context of sustainability. (1997).",
      "doi": ""
    },
    {
      "text": "Kathryn Walters. 2018. Form from flat: Exploring emergent behaviour in woven textiles. Master’s thesis. MA thesis. University of Borås.",
      "doi": ""
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jürgen Steimle. 2017. Skinmarks: Enabling interactions on body landmarks using conformal skin electronics. In proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3095–3105.",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21st Century. Scientific american 265, 3 (1991), 94–105.",
      "doi": ""
    },
    {
      "text": "Margaret Wertheim and Christine Wertheim. 2015. Crochet coral reef. Institute For Figuring Los Angeles, CA.",
      "doi": ""
    },
    {
      "text": "Mikael Wiberg. 2018. The materiality of interaction: Notes on the materials of interaction design. MIT press.",
      "doi": "10.5555/3275306"
    },
    {
      "text": "Mikael Wiberg and Erica Robles. 2010. Computational compositions: Aesthetics, materials, and interaction design. International Journal of Design 4, 2 (2010), 65–76.",
      "doi": ""
    },
    {
      "text": "Martin Woolley. 2003. Choreographing obsolescence-ecodesign: the pleasure/dissatisfaction cycle. In Proceedings of the 2003 international conference on Designing pleasurable products and interfaces. 77–81.",
      "doi": "10.1145/782896.782916"
    },
    {
      "text": "Rundong Wu, Joy Xiaoji Zhang, Jonathan Leaf, Xinru Hua, Ante Qu, Claire Harvey, Emily Holtzman, Joy Ko, Brooks Hagan, Doug James, François Guimbretière, and Steve Marschner. 2020. Weavecraft. ACM Transactions on Graphics 39, 6 (2020), 1–16. https://doi.org/10.1145/3414685.3417865",
      "doi": "10.1145/3414685.3417865"
    },
    {
      "text": "Shanel Wu and Laura Devendorf. 2020. Unfabricate: Designing Smart Textiles for Disassembly. In CHI ’20. Association for Computing Machinery. https://doi.org/10.1145/3313831.3376227",
      "doi": "10.1145/3313831.3376227"
    },
    {
      "text": "Yunyun Wu, Sara S. Mechael, and Tricia Breen Carmichael. 2021. Wearable E-Textiles Using a Textile-Centric Design Approach. Accounts of Chemical Research 54, 21 (2021), 4051–4064. https://doi.org/10.1021/acs.accounts.1c00433",
      "doi": ""
    },
    {
      "text": "www.shimaseiki.com. 2022. WholeGarment. Retrieved May 12, 2022 from https://www.shimaseiki.com/wholegarment/",
      "doi": ""
    },
    {
      "text": "[193] www.stoll.com. 2022. Retrieved May 12, 2022 from https://www.stoll.com/en/machines/knitwear/",
      "doi": ""
    },
    {
      "text": "www.studiohilo.com. 2022. HILO. Retrieved May 12, 2022 from https://www.studiohilo.com/",
      "doi": ""
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. BioLogic: natto cells as nanoactuators for shape changing interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, 1–10.",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Lining Yao, Helene Steiner, Wen Wang, Guanyun Wang, Chin-Yi Cheng, Jifei Ou, and Hiroshi Ishii. 2016. Second skin: Biological garment powered by and adapting to body in motion. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 13–13.",
      "doi": "10.1145/2851581.2889437"
    },
    {
      "text": "Seyed Javad Zafarmand, Kazuo Sugiyama, and Makoto Watanabe. 2003. Aesthetic and sustainability: The aesthetic attributes promoting product sustainability. The Journal of Sustainable Product Design 3, 3 (2003), 173–186.",
      "doi": ""
    },
    {
      "text": "Wanqing Zhang, Ling Zhang, Yabin Liao, and Huanyu Cheng. 2021. Conformal manufacturing of soft deformable sensors on the curved surface. International Journal of Extreme Manufacturing 3, 4(2021), 042001. https://doi.org/10.1088/2631-7990/ac1158",
      "doi": ""
    },
    {
      "text": "Tianyong Zheng, Shengxian Li, Shujuan Jing, and Ya Ou. 2013. Designing of 3D woven integrated T-joint tube. Textile Research Journal 83, 11 (2013), 1143–1155. https://doi.org/10.1177/0040517512467062",
      "doi": ""
    },
    {
      "text": "Jiwei Zhou, Bahareh Barati, Jun Wu, Diana Scherer, and Elvin Karana. 2021. Digital biofabrication to realize the potentials of plant roots for product design. Bio-Design and Manufacturing 4, 1 (2021), 111–122. https://doi.org/10.1007/s42242-020-00088-2",
      "doi": ""
    }
  ]
}