{
  "doi": "10.1145/3544548.3581413",
  "title": "The Impact of Navigation Aids on Search Performance and Object Recall in Wide-Area Augmented Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Head-worn augmented reality (AR) is a hotly pursued and increasingly feasible contender paradigm for replacing or complementing smartphones and watches for continual information consumption. Here, we compare three different AR navigation aids (on-screen compass, on-screen radar and in-world vertical arrows) in a wide-area outdoor user study (n=24) where participants search for hidden virtual target items amongst physical and virtual objects. We analyzed participants’ search task performance, movements, eye-gaze, survey responses and object recall. There were two key findings. First, all navigational aids enhanced search performance relative to a control condition, with some benefit and strongest user preference for in-world arrows. Second, users recalled fewer physical objects than virtual objects in the environment, suggesting reduced awareness of the physical environment. Together, these findings suggest that while navigational aids presented in AR can enhance search task performance, users may pay less attention to the physical environment, which could have undesirable side-effects.",
  "authors": [
    {
      "name": "Radha Kumaran",
      "institution": "Computer Science, University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659622573",
      "orcid": "0000-0001-7161-3048"
    },
    {
      "name": "You-Jin Kim",
      "institution": "Media Arts and Technology, University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783438",
      "orcid": "0000-0003-0903-8999"
    },
    {
      "name": "Anne E Milner",
      "institution": "Psychological and Brain Sciences, University of California, Santa Barbara, United States and Institute of Collaborative Biotechnologies, University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780942",
      "orcid": "0000-0002-5654-298X"
    },
    {
      "name": "Tom Bullock",
      "institution": "Psychological and Brain Sciences, University of California, Santa Barbara, United States and Institute of Collaborative Biotechnologies, University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659146058",
      "orcid": "0000-0002-8551-905X"
    },
    {
      "name": "Barry Giesbrecht",
      "institution": "Psychological and Brain Sciences, University of California, Santa Barbara, United States and Institute of Collaborative Biotechnologies, University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318489001",
      "orcid": "0000-0002-1976-1251"
    },
    {
      "name": "Tobias Höllerer",
      "institution": "Computer Science, University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100002957",
      "orcid": "0000-0002-6240-0291"
    }
  ],
  "references": [
    {
      "text": "Benjamin Avery, Christian Sandor, and Bruce H Thomas. 2009. Improving spatial perception for augmented reality x-ray vision. In 2009 IEEE Virtual Reality Conference (Lafayette, LA, USA). IEEE, 79–82.",
      "doi": ""
    },
    {
      "text": "Samantha Aziz and Oleg Komogortsev. 2022. An Assessment of the Eye Tracking Signal Quality Captured in the HoloLens 2. In 2022 Symposium on Eye Tracking Research and Applications (Seattle, WA, USA) (ETRA ’22). Association for Computing Machinery, New York, NY, USA, Article 5, 6 pages. https://doi.org/10.1145/3517031.3529626",
      "doi": "10.1145/3517031.3529626"
    },
    {
      "text": "Mark Billinghurst and Hirokazu Kato. 1999. Collaborative mixed reality. In Proceedings of the first international symposium on mixed reality. 261–284.",
      "doi": ""
    },
    {
      "text": "Frank Biocca, Charles Owen, Arthur Tang, and Corey Bohil. 2007. Attention Issues in Spatial Information Systems: Directing Mobile Users’ Visual Attention Using Augmented Reality. J. of Management Information Systems 23 (05 2007), 163–184. https://doi.org/10.2753/MIS0742-1222230408",
      "doi": "10.2753/MIS0742-1222230408"
    },
    {
      "text": "Frank Biocca, Arthur Tang, Charles Owen, and Fan Xiao. 2006. Attention Funnel: Omnidirectional 3D Cursor for Mobile Augmented Reality Platforms. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 1115–1122. https://doi.org/10.1145/1124772.1124939",
      "doi": "10.1145/1124772.1124939"
    },
    {
      "text": "Felix Bork, Christian Schnelzer, Ulrich Eck, and Nassir Navab. 2018. Towards Efficient Visual Guidance in Limited Field-of-View Head-Mounted Displays. IEEE Transactions on Visualization and Computer Graphics 24, 11(2018), 2983–2992. https://doi.org/10.1109/TVCG.2018.2868584",
      "doi": ""
    },
    {
      "text": "Volkert Buchmann, Mark Billinghurst, and Andy Cockburn. 2008. Directional Interfaces for Wearable Augmented Reality. In Proceedings of the 9th ACM SIGCHI New Zealand Chapter’s International Conference on Human-Computer Interaction: Design Centered HCI (Wellington, New Zealand) (CHINZ ’08). Association for Computing Machinery, New York, NY, USA, 47–54. https://doi.org/10.1145/1496976.1496983",
      "doi": "10.1145/1496976.1496983"
    },
    {
      "text": "Stefano Burigat and Luca Chittaro. 2007. Navigation in 3D Virtual Environments: Effects of User Experience and Location-Pointing Navigation Aids. International Journal of Human-Computer Studies 65, 11 (nov 2007), 945–958. https://doi.org/10.1016/j.ijhcs.2007.07.003",
      "doi": "10.1016/j.ijhcs.2007.07.003"
    },
    {
      "text": "Adrian David Cheok, Kok Hwee Goh, Wei Liu, Farzam Farbiz, Siew Wan Fong, Sze Lee Teo, Yu Li, and Xubo Yang. 2004. Human Pacman: a mobile, wide-area entertainment system based on physical, social, and ubiquitous computing. Personal and ubiquitous computing 8, 2 (2004), 71–81.",
      "doi": ""
    },
    {
      "text": "Luca Chittaro and Stefano Burigat. 2004. 3D Location-Pointing as a Navigation Aid in Virtual Environments. In Proceedings of the Working Conference on Advanced Visual Interfaces (Gallipoli, Italy) (AVI ’04). Association for Computing Machinery, New York, NY, USA, 267–274. https://doi.org/10.1145/989863.989910",
      "doi": "10.1145/989863.989910"
    },
    {
      "text": "SeungA Chung, Hwayeon Joh, Eunji Lee, and Uran Oh. 2021. PanoCue: An Efficient Visual Cue With a Omnidirectional Panoramic View for Finding a Target in 3D Space. In 2021 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct) (Bari, Italy). IEEE, 218–223. https://doi.org/10.1109/ISMAR-Adjunct54149.2021.00052",
      "doi": ""
    },
    {
      "text": "R.P. Darken and H. Cevik. 1999. Map Usage in Virtual Environments: Orientation Issues. In Proceedings IEEE Virtual Reality (Cat. No. 99CB36316). IEEE, 133–140. https://doi.org/10.1109/VR.1999.756944",
      "doi": ""
    },
    {
      "text": "Miguel P Eckstein. 2011. Visual search: A retrospective. Journal of vision 11, 5 (2011), 14–14.",
      "doi": ""
    },
    {
      "text": "Roman Egger and Larissa Neuburger. 2020. Augmented, virtual, and mixed reality in tourism. Handbook of e-Tourism(2020), 1–25.",
      "doi": ""
    },
    {
      "text": "Steven Feiner, Blair MacIntyre, Tobias Höllerer, and Anthony Webster. 1997. A touring machine: Prototyping 3D mobile augmented reality systems for exploring the urban environment. Personal Technologies 1, 4 (1997), 208–217.",
      "doi": ""
    },
    {
      "text": "Sickscore Games. 2020. HUD Navigation System. https://assetstore.unity.com/packages/tools/gui/hud-navigation-system-103056. Accessed: September 2022.",
      "doi": ""
    },
    {
      "text": "While Fun Games. 2019. Deluxe Compass Bar. https://assetstore.unity.com/packages/templates/systems/deluxe-compass-bar-53856. Accessed: September 2022.",
      "doi": ""
    },
    {
      "text": "Juan Garzón and Juan Acevedo. 2019. Meta-analysis of the impact of Augmented Reality on students’ learning gains. Educational Research Review 27 (2019), 244–260.",
      "doi": ""
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Höllerer. 2014. World-Stabilized Annotations and Virtual Scene Navigation for Remote Collaboration. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 449–459. https://doi.org/10.1145/2642918.2647372",
      "doi": "10.1145/2642918.2647372"
    },
    {
      "text": "Uwe Gruenefeld, Dag Ennenga, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2017. EyeSee360: Designing a Visualization Technique for out-of-View Objects in Head-Mounted Augmented Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (Brighton, United Kingdom) (SUI ’17). Association for Computing Machinery, New York, NY, USA, 109–118. https://doi.org/10.1145/3131277.3132175",
      "doi": "10.1145/3131277.3132175"
    },
    {
      "text": "Uwe Gruenefeld, Ilja Koethe, Daniel Lange, Sebastian Weiß, and Wilko Heuten. 2019. Comparing techniques for visualizing moving out-of-view objects in head-mounted virtual reality. In 2019 IEEE conference on virtual reality and 3D user interfaces (VR) (Osaka, Japan). IEEE, 742–746.",
      "doi": ""
    },
    {
      "text": "Uwe Gruenefeld, Daniel Lange, Lasse Hammer, Susanne Boll, and Wilko Heuten. 2018. FlyingARrow: Pointing Towards Out-of-View Objects on Augmented Reality Devices. In Proceedings of the 7th ACM International Symposium on Pervasive Displays (Munich, Germany) (PerDis ’18). Association for Computing Machinery, New York, NY, USA, Article 20, 6 pages. https://doi.org/10.1145/3205873.3205881",
      "doi": "10.1145/3205873.3205881"
    },
    {
      "text": "Tobias Höllerer and Steve Feiner. 2004. Mobile augmented reality. Telegeoinformatics: Location-based computing and services 21 (2004).",
      "doi": ""
    },
    {
      "text": "Tobias Höllerer, Steven Feiner, and John Pavlik. 1999. Situated documentaries: Embedding multimedia presentations in the real world. In Digest of Papers. Third International Symposium on Wearable Computers. IEEE, 79–86.",
      "doi": ""
    },
    {
      "text": "Curtis M. Humphrey and Julie A. Adams. 2008. Compass Visualizations for Human-Robotic Interaction. In Proceedings of the 3rd ACM/IEEE International Conference on Human Robot Interaction (Amsterdam, The Netherlands) (HRI ’08). Association for Computing Machinery, New York, NY, USA, 49–56. https://doi.org/10.1145/1349822.1349830",
      "doi": "10.1145/1349822.1349830"
    },
    {
      "text": "Adam Ibrahim, Brandon Huynh, Jonathan Downey, Tobias Höllerer, Dorothy Chun, and John O’donovan. 2018. Arbis pictus: A study of vocabulary learning with augmented reality. IEEE transactions on visualization and computer graphics 24, 11(2018), 2867–2874.",
      "doi": ""
    },
    {
      "text": "Simon Julier, Marco Lanzagorta, Yohan Baillot, Lawrence Rosenblum, Steven Feiner, Tobias Hollerer, and Sabrina Sestito. 2000. Information filtering for mobile augmented reality. In Proceedings IEEE and ACM International Symposium on Augmented Reality (ISAR 2000). IEEE, 3–11.",
      "doi": ""
    },
    {
      "text": "Steven J Kass, Kerstan S Cole, and Claudia J Stanny. 2007. Effects of distraction and experience on situation awareness and simulated driving. Transportation Research Part F: Traffic Psychology and Behaviour 10, 4(2007), 321–329.",
      "doi": ""
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203–220.",
      "doi": ""
    },
    {
      "text": "You-Jin Kim, Radha Kumaran, Ehsan Sayyad, Anne Milner, Tom Bullock, Barry Giesbrecht, and Tobias Höllerer. 2022. Investigating Search Among Physical and Virtual Objects Under Different Lighting Conditions. IEEE Transactions on Visualization and Computer Graphics 28, 11(2022), 3788–3798.",
      "doi": ""
    },
    {
      "text": "Mark A Livingston, J Edward Swan, Joseph L Gabbard, Tobias H Hollerer, Deborah Hix, Simon J Julier, Yohan Baillot, and Dennis Brown. 2003. Resolving multiple occluded layers in augmented reality. In The Second IEEE and ACM International Symposium on Mixed and Augmented Reality, 2003. Proceedings.IEEE, 56–65.",
      "doi": ""
    },
    {
      "text": "John Luksas, Kelsey Quinn, Joseph L Gabbard, Mariam Hasan, Janet He, Neha Surana, Moustafa Tabbarah, and Nishant Kishan Teckchandani. 2022. Search and Rescue AR Visualization Environment (SAVE): Designing an AR Application for Use with Search and Rescue Personnel. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW) (Christchurch, New Zealand). IEEE, 488–492.",
      "doi": ""
    },
    {
      "text": "Ann Morrison, Antti Oulasvirta, Peter Peltonen, Saija Lemmela, Giulio Jacucci, Gerhard Reitmayr, Jaana Näsänen, and Antti Juustila. 2009. Like Bees around the Hive: A Comparative Study of a Mobile Augmented Reality Map. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1889–1898. https://doi.org/10.1145/1518701.1518991",
      "doi": "10.1145/1518701.1518991"
    },
    {
      "text": "Alessandro Mulloni, Hartmut Seichter, and Dieter Schmalstieg. 2011. User experiences with augmented reality aided navigation on phones. In 2011 10th IEEE International Symposium on Mixed and Augmented Reality (Basel, Switzerland). IEEE, 229–230. https://doi.org/10.1109/ISMAR.2011.6092390",
      "doi": "10.1109/ISMAR.2011.6092390"
    },
    {
      "text": "Ulric Neisser. 1963. Decision-time without reaction-time: Experiments in visual scanning. The American journal of psychology 76, 3 (1963), 376–385.",
      "doi": ""
    },
    {
      "text": "J. Newman, D. Ingram, and A. Hopper. 2001. Augmented reality in a wide area sentient environment. In Proceedings IEEE and ACM International Symposium on Augmented Reality. 77–86. https://doi.org/10.1109/ISAR.2001.970517",
      "doi": ""
    },
    {
      "text": "Jordan Novet. 2022. Microsoft Wins U.S. Army Contract for Augmented Reality Headsets, Worth up to $21.9 Billion over 10 Years. https://www.cnbc.com/2021/03/31/microsoft-wins-contract-to-make-modified-hololens-for-us-army.html. Accessed September 2022.",
      "doi": ""
    },
    {
      "text": "Niklas Osmers and Michael Prilla. 2020. Getting out of Out of Sight: Evaluation of AR Mechanisms for Awareness and Orientation Support in Occluded Multi-Room Settings. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3313831.3376742",
      "doi": "10.1145/3313831.3376742"
    },
    {
      "text": "Harold Pashler and James C Johnston. 1989. Chronometric evidence for central postponement in temporally overlapping tasks. The Quarterly Journal of Experimental Psychology 41, 1(1989), 19–45.",
      "doi": ""
    },
    {
      "text": "Tabitha C. Peck, Henry Fuchs, and Mary C. Whitton. 2011. An evaluation of navigational ability comparing Redirected Free Exploration with Distractors to Walking-in-Place and joystick locomotio interfaces. In 2011 IEEE Virtual Reality Conference (Singapore). IEEE, 55–62. https://doi.org/10.1109/VR.2011.5759437",
      "doi": "10.1109/VR.2011.5759437"
    },
    {
      "text": "Matti Rantanen, Antti Oulasvirta, Jan Blom, Sauli Tiitta, and Martti Mäntylä. 2004. InfoRadar: Group and Public Messaging in the Mobile Context. In Proceedings of the Third Nordic Conference on Human-Computer Interaction (Tampere, Finland) (NordiCHI ’04). Association for Computing Machinery, New York, NY, USA, 131–140. https://doi.org/10.1145/1028014.1028035",
      "doi": "10.1145/1028014.1028035"
    },
    {
      "text": "Patrick Renner and Thies Pfeiffer. 2017. Attention guiding techniques using peripheral vision and eye tracking for feedback in augmented-reality-based assistance systems. In 2017 IEEE Symposium on 3D User Interfaces (3DUI) (Los Angeles, CA, USA). IEEE, 186–194. https://doi.org/10.1109/3DUI.2017.7893338",
      "doi": ""
    },
    {
      "text": "Caterina Rizzi, Francesca Campana, Michele Bici, Francesco Gherardini, Tommaso Ingrassia, and Paolo Cicconi (Eds.). 2022. Design Tools and Methods in Industrial Engineering II: Proceedings of the Second International Conference on Design Tools and Methods in Industrial Engineering, ADM 2021, September 9–10, 2021, Rome, Italy. Springer International Publishing, Cham. https://doi.org/10.1007/978-3-030-91234-5",
      "doi": ""
    },
    {
      "text": "Damien C. Rompapas, Christian Sandor, Alexander Plopski, Daniel Saakes, Joongi Shin, Takafumi Taketomi, and Hirokazu Kato. 2019. Towards large scale high fidelity collaborative augmented reality. Computers & Graphics 84(2019), 24–41.",
      "doi": "10.1016/j.cag.2019.08.007"
    },
    {
      "text": "Damien C. Rompapas, Christian Sandor, Alexander Plopski, Daniel Saakes, Dong Hyeok Yun, Takafumi Taketomi, and Hirokazu Kato. 2018. HoloRoyale: A Large Scale High Fidelity Augmented Reality Game. In Adjunct Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18 Adjunct). Association for Computing Machinery, New York, NY, USA, 163–165. https://doi.org/10.1145/3266037.3271637",
      "doi": "10.1145/3266037.3271637"
    },
    {
      "text": "Roy A. Ruddle and Simon Lessels. 2009. The Benefits of Using a Walking Interface to Navigate Virtual Environments. ACM Trans. Comput.-Hum. Interact. 16, 1, Article 5 (apr 2009), 18 pages. https://doi.org/10.1145/1502800.1502805",
      "doi": "10.1145/1502800.1502805"
    },
    {
      "text": "Ehsan Sayyad, Misha Sra, and Tobias Höllerer. 2020. Walking and Teleportation in Wide-area Virtual Reality Experiences. In 2020 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 608–617. https://doi.org/10.1109/ISMAR50242.2020.00088",
      "doi": ""
    },
    {
      "text": "Torben Schinke, Niels Henze, and Susanne Boll. 2010. Visualization of Off-Screen Objects in Mobile Augmented Reality. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (Lisbon, Portugal) (MobileHCI ’10). Association for Computing Machinery, New York, NY, USA, 313–316. https://doi.org/10.1145/1851600.1851655",
      "doi": "10.1145/1851600.1851655"
    },
    {
      "text": "Bjorn Schwerdtfeger and Gudrun Klinker. 2008. Supporting order picking with augmented reality. In 2008 7th IEEE/ACM International Symposium on Mixed and Augmented Reality (Cambridge, UK). IEEE, 91–94.",
      "doi": "10.1109/ISMAR.2008.4637331"
    },
    {
      "text": "Jun Shingu, Eleanor Rieffel, Don Kimber, Jim Vaughan, Pernilla Qvarfordt, and Kathleen Tuite. 2010. Camera pose navigation using augmented reality. In 2010 IEEE International Symposium on Mixed and Augmented Reality (Seoul, Korea (South)). IEEE, 271–272.",
      "doi": ""
    },
    {
      "text": "Alexa F. Siu, Mike Sinclair, Robert Kovacs, Eyal Ofek, Christian Holz, and Edward Cutrell. 2020. Virtual Reality Without Vision: A Haptic and Auditory White Cane to Navigate Complex Virtual Worlds. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376353",
      "doi": "10.1145/3313831.3376353"
    },
    {
      "text": "Charles Spence and Jon Driver. 1997. Audiovisual links in exogenous covert spatial orienting. Perception & psychophysics 59, 1 (1997), 1–22.",
      "doi": ""
    },
    {
      "text": "Aaron Stafford, Wayne Piekarski, and Bruce H Thomas. 2006. Implementation of god-like interaction techniques for supporting collaboration between outdoor AR and indoor tabletop users. In 2006 IEEE/ACM International Symposium on Mixed and Augmented Reality (Santa Barbara, CA, USA). IEEE, 165–172.",
      "doi": "10.1109/ISMAR.2006.297809"
    },
    {
      "text": "David L Strayer and William A Johnston. 2001. Driven to distraction: Dual-task studies of simulated driving and conversing on a cellular telephone. Psychological science 12, 6 (2001), 462–466.",
      "doi": ""
    },
    {
      "text": "Riku Suomela and Juha Lehikoinen. 2000. Context compass. In Digest of Papers. Fourth International Symposium on Wearable Computers. IEEE, 147–154.",
      "doi": ""
    },
    {
      "text": "Bruce Thomas, Ben Close, John Donoghue, John Squires, Phillip De Bondi, and Wayne Piekarski. 2002. First person indoor/outdoor augmented reality application: ARQuake. Personal and Ubiquitous Computing 6, 1 (2002), 75–86.",
      "doi": "10.1007/s007790200007"
    },
    {
      "text": "B. Thomas, V. Demczuk, W. Piekarski, D. Hepworth, and B. Gunther. 1998. A wearable computer system with augmented reality to support terrestrial navigation. In Digest of Papers. Second International Symposium on Wearable Computers (Cat. No.98EX215). 168–171. https://doi.org/10.1109/ISWC.1998.729549",
      "doi": ""
    },
    {
      "text": "Vinnie Tieto, Max Wang, and Qian Wen. 2022. HoloLens UX building blocks - MRTK2 - Mixed Reality. https://docs.microsoft.com/en-us/windows/mixed-reality/mrtk-unity/mrtk2/features/ux-building-blocks/solvers. Accessed: September 2022.",
      "doi": ""
    },
    {
      "text": "Jan Oliver Wallgrün, Mahda M. Bagher, Pejman Sajjadi, and Alexander Klippel. 2020. A Comparison of Visual Attention Guiding Approaches for 360° Image-Based VR Tours. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 83–91. https://doi.org/10.1109/VR46266.2020.00026",
      "doi": ""
    },
    {
      "text": "Jeremy M Wolfe. 1998. What can 1 million trials tell us about visual search?Psychological Science 9, 1 (1998), 33–39.",
      "doi": ""
    },
    {
      "text": "Hsin-Kai Wu, Silvia Wen-Yu Lee, Hsin-Yi Chang, and Jyh-Chong Liang. 2013. Current status, opportunities and challenges of augmented reality in education. Computers & education 62 (2013), 41–49.",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Edward Cutrell, Christian Holz, Meredith Ringel Morris, Eyal Ofek, and Andrew D. Wilson. 2019. SeeingVR: A Set of Tools to Make Virtual Reality More Accessible to People with Low Vision. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300341",
      "doi": "10.1145/3290605.3300341"
    },
    {
      "text": "Yuhang Zhao, Elizabeth Kupferstein, Brenda Veronica Castro, Steven Feiner, and Shiri Azenkot. 2019. Designing AR Visualizations to Facilitate Stair Navigation for People with Low Vision. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 387–402. https://doi.org/10.1145/3332165.3347906",
      "doi": "10.1145/3332165.3347906"
    },
    {
      "text": "Yuhang Zhao, Elizabeth Kupferstein, Hathaitorn Rojnirun, Leah Findlater, and Shiri Azenkot. 2020. The Effectiveness of Visual and Audio Wayfinding Guidance on Smartglasses for People with Low Vision. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376516",
      "doi": "10.1145/3313831.3376516"
    },
    {
      "text": "Yuhang Zhao, Sarit Szpiro, Jonathan Knighten, and Shiri Azenkot. 2016. CueSee: Exploring Visual Cues for People with Low Vision to Facilitate a Visual Search Task. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Heidelberg, Germany) (UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 73–84. https://doi.org/10.1145/2971648.2971730",
      "doi": "10.1145/2971648.2971730"
    },
    {
      "text": "Yiqing Zhu and Nan Li. 2021. Virtual and augmented reality technologies for emergency management in the built environments: A state-of-the-art review. Journal of Safety Science and Resilience 2, 1 (2021), 1–10.",
      "doi": ""
    },
    {
      "text": "Stefanie Zollmann, Denis Kalkofen, Erick Mendez, and Gerhard Reitmayr. 2010. Image-based ghostings for single layer occlusions in augmented reality. In 2010 IEEE International Symposium on Mixed and Augmented Reality (Seoul, Korea (South)). IEEE, 19–26.",
      "doi": ""
    }
  ]
}