{
  "doi": "10.1145/3544548.3581545",
  "title": "Becoming a Speleologist: Design Implications for Coordination in Wild Outdoor Environments",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2023,
  "badges": [],
  "abstract": "Learning outdoor sports entails acquiring physical skills, managing gear, and coordinating with others. We investigated how speleologists are trained to explore underground caves. We interviewed 15 instructors and 10 trainees to understand the main problems that may occur during training cave trips. Our findings show that stressful situations are linked to beginners’ difficulties applying new gestures and procedures - on which their progression and safety depend - and coordinating with others when they are out of sight. It emerged that group awareness and communication are pivotal for their tranquility. Yet, the underground environment makes communicating very hard. This study led to the elaboration of design implications for technology supporting awareness, communication, and coordination in speleology training, which draw from and enrich previous literature on coordination in the wild, as it may happen while performing outdoor sports or during search-and-rescue operations.",
  "tags": [
    "Outdoor sports",
    "Group coordination",
    "Caving",
    "Awareness",
    "Wilderness",
    "Team communication",
    "Speleology"
  ],
  "authors": [
    {
      "name": "Eleonora Mencarini",
      "institution": "Intelligent Interfaces and Interaction, Bruno Kessler Foundation, Italy",
      "img": "/do/10.1145/contrib-81472653876/rel-imgonly/img_3255.jpg",
      "acmid": "81472653876",
      "orcid": "0000-0002-9622-2438"
    },
    {
      "name": "Tommaso Zambon",
      "institution": "Department of Computer Science and Engineering, University of Bologna, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780586",
      "orcid": "0000-0002-3751-9207"
    }
  ],
  "references": [
    {
      "text": "Aino Ahtinen, Minna Isomursu, Ykä Huhtala, Jussi Kaasinen, Jukka Salminen, and Jonna Häkkilä. 2008. Tracking Outdoor Sports – User Experience Perspective. In European Conference on Ambient Intelligence, 192–209. https://doi.org/10.1007/978-3-540-89617-3_13",
      "doi": "10.1007/978-3-540-89617-3_13"
    },
    {
      "text": "Sultan A. Alharthi, Nicolas James LaLone, Hitesh Nidhi Sharma, Igor Dolgov, and Z O. Toups. 2021. An Activity Theory Analysis of Search & Rescue Collective Sensemaking and Planning Practices. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–20. https://doi.org/10.1145/3411764.3445272",
      "doi": "10.1145/3411764.3445272"
    },
    {
      "text": "Paul Aoki, Allison Woodruff, Baladitya Yellapragada, and Wesley Willett. 2017. Environmental protection and agency: Motivations, capacity, and goals in participatory sensing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 3138–3150.",
      "doi": "10.1145/3025453.3025667"
    },
    {
      "text": "Marc Bächlin, Kilian Förster, and Gerhard Tröster. 2009. SwimMaster: a wearable assistant for swimmer. In Proceedings of the 11th International Conference on Ubiquitous Computing, 215–224. https://doi.org/10.1145/1620545.1620578",
      "doi": "10.1145/1620545.1620578"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic Analysis. In APA handbook of research methods in psychology, H. Cooper, P.M. Camic, D. L. Long, A. T. Panter, D. Rindskopf and K. J. Sher (eds.). American Psychological Association, 57–71.",
      "doi": ""
    },
    {
      "text": "Sarah G. Cant. 2006. British speleologies: geographies of science, personality and practice, 1935–1953. Journal of Historical Geography 32, 4: 775–795. https://doi.org/10.1016/j.jhg.2005.10.002",
      "doi": ""
    },
    {
      "text": "Keith Cheverst, Mads Bødker, and Florian Daiber. 2020. Technology and Mastery: Design Sensitivities for Technology in Mountaineering. In HCI Outdoors: Theory, Design, Methods and Applications. Springer, Cham, 197–211.",
      "doi": ""
    },
    {
      "text": "Lee Davidson and Robert A. Stebbins. 2011. Serious leisure and nature: sustainable consumption in the outdoors. Palgrave Macmillan, Houndmills, Basingstoke, Hampshire ; New York.",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins, Carman Neustaedter, Saul Greenberg, and Ron Wakkary. 2014. Collaboration Surrounding Beacon Use During Companion Avalanche Rescue. In Proceedings of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing - CSCW’14, 877–887. https://doi.org/10.1145/2531602.2531684",
      "doi": "10.1145/2531602.2531684"
    },
    {
      "text": "Eva Ellmer, Steven Rynne, and Eimear Enright. 2019. Learning in action sports: A scoping review. European Physical Education Review: 1–21. https://doi.org/10.1177/1356336X19851535",
      "doi": ""
    },
    {
      "text": "Anton Fedosov and Marc Langheinrich. 2015. From Start to Finish: Understanding Group Sharing Behavior in a Backcountry Skiing Community. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, 758–765. https://doi.org/10.1145/2786567.2793698",
      "doi": "10.1145/2786567.2793698"
    },
    {
      "text": "Anton Fedosov, Eleonora Mencarini, Paweł W. Woźniak, Kristina Knaving, and Marc Langheinrich. 2016. Towards understanding digital sharing practices in outdoor sports. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct, 861–866.",
      "doi": "10.1145/2968219.2968537"
    },
    {
      "text": "Anton Fedosov, Evangelos Niforatos, Ivan Elhart, Teseo Schneider, Dmitry Anisimov, and Marc Langheinrich. 2016. Design and Evaluation of a Wearable AR System for Sharing Personalized Content on Ski Resort Maps. In Proceedings of the 15th International Conference on Mobile and Ubiquitous Multimedia, 141–152.",
      "doi": "10.1145/3012709.3012721"
    },
    {
      "text": "Jonna Häkkilä, Nicola J. Bidwell, Keith Cheverst, Ashley Colley, Felix Kosmalla, Simon Robinson, and Johannes Schöning. 2018. Reflections on the NatureCHI workshop series: unobtrusive user experiences with technology in nature. International Journal of Mobile Human Computer Interaction (IJMHCI) 10, 3: 1–9.",
      "doi": "10.4018/IJMHCI.2018070101"
    },
    {
      "text": "Shoichi Hasegawa, Seiichiro Ishijima, Fumihiro Kato, Hironori Mitake, and Makoto Sato. 2012. Realtime Sonification of the Center of Gravity for Skiing. In Proceedings of the 2012 Augmented Human International Conference, 3–6. https://doi.org/10.1145/2160125.2160136",
      "doi": "10.1145/2160125.2160136"
    },
    {
      "text": "Brennan Jones, Anthony Tang, and Carman Neustaedter. 2020. Remote Communication in Wilderness Search and Rescue: Implications for the Design of Emergency Distributed-Collaboration Tools for Network-Sparse Environments. Proceedings of the ACM on Human-Computer Interaction 4, GROUP: 1–26. https://doi.org/10.1145/3375190",
      "doi": "10.1145/3375190"
    },
    {
      "text": "Brennan Jones, Anthony Tang, and Carman Neustaedter. 2022. RescueCASTR: Exploring Photos and Live Streaming to Support Contextual Awareness in the Wilderness Search and Rescue Command Post. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1: 1–32. https://doi.org/10.1145/3512960",
      "doi": "10.1145/3512960"
    },
    {
      "text": "Francisco Kiss, Paweł W. Woźniak, Felix Scheerer, Julia Dominiak, Andrzej Romanowski, and Albrecht Schmidt. 2019. Clairbuoyance: Improving Directional Perception for Swimmers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, 1–12. https://doi.org/10.1145/3290605.3300467",
      "doi": "10.1145/3290605.3300467"
    },
    {
      "text": "Felix Kosmalla, Frederik Wiehr, Florian Daiber, Antonio Krüger, and Markus Löchtefeld. 2016. ClimbAware - Investigating Perception and Acceptance of Wearables in Rock Climbing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI’16, 1097–1108.",
      "doi": ""
    },
    {
      "text": "Eleonora Mencarini, Antonella De Angeli, and Massimo Zancanaro. 2016. Emotions in climbing: a design opportunity for haptic communication. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct, 867–871.",
      "doi": "10.1145/2968219.2968539"
    },
    {
      "text": "Eleonora Mencarini, Chiara Leonardi, Alessandro Cappelletti, Davide Giovanelli, Antonella De Angeli, and Massimo Zancanaro. 2019. Co-designing wearable devices for sports: The case study of sport climbing. International Journal of Human-Computer Studies 124: 26–43.",
      "doi": ""
    },
    {
      "text": "Eleonora Mencarini, Chiara Leonardi, Antonella De Angeli, and Massimo Zancanaro. 2016. Design opportunities for wearable devices in learning to climb. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction, 1–10.",
      "doi": "10.1145/2971485.2971509"
    },
    {
      "text": "Eleonora Mencarini, Amon Rapp, and Massimo Zancanaro. 2021. Underground astronauts: Understanding the sporting science of speleology and its implications for HCI. International Journal of Human-Computer Studies 151: 102621. https://doi.org/10.1016/j.ijhcs.2021.102621",
      "doi": ""
    },
    {
      "text": "Florian “Floyd” Müller and Sarah Jane Pell. 2016. Technology meets Adventure: Learnings from an Earthquake-Interrupted Mt. Everest Expedition. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 817–828.",
      "doi": ""
    },
    {
      "text": "Florian “Floyd” Müller and Damon Young. 2018. 10 Lenses to Design Sports-HCI. Foundations and Trends® in Human–Computer Interaction 12, 3: 172–237. https://doi.org/10.1561/1100000076",
      "doi": "10.1561/1100000076"
    },
    {
      "text": "Stina Nylander and Jakob Tholander. 2012. Tactile feedback in real life sports: a pilot study from cross-country skiing. In The Seventh International Workshop on Haptic and Audio Interaction Design, 35–37.",
      "doi": ""
    },
    {
      "text": "Stina Nylander and Jakob Tholander. 2016. Drifting Off Course – how Sports Technology Can Use Real-Time Data to Add New Dimensions to Sports. In Proceedings of the 15th International Conference on Mobile and Ubiquitous Multimedia - MUM’16, 1–4.",
      "doi": "10.1145/3012709.3012740"
    },
    {
      "text": "María Alejandra Pérez. 2015. Exploring the vertical: science and sociality in the field among cavers in Venezuela. Social & Cultural Geography 16, 2: 226–247. https://doi.org/10.1080/14649365.2014.973438",
      "doi": ""
    },
    {
      "text": "Elizabeth C. J. Pike and Simon K. Beames (eds.). 2013. Outdoor Adventure and Social Theory. Routledge.",
      "doi": ""
    },
    {
      "text": "Maaret Posti, Johannes Schöning, and Jonna Häkkilä. 2014. Unexpected journeys with the HOBBIT: the design and evaluation of an asocial hiking app. In Proceedings of the 2014 conference on Designing interactive systems, 637–646.",
      "doi": "10.1145/2598510.2598592"
    },
    {
      "text": "Philip Schuchardt and Doug A. Bowman. 2007. The benefits of immersion for spatial understanding of complex underground cave systems. In Proceedings of the 2007 ACM symposium on Virtual reality software and technology - VRST ’07, 121–124. https://doi.org/10.1145/1315184.1315205",
      "doi": "10.1145/1315184.1315205"
    },
    {
      "text": "Daniel Spelmezan. 2012. An investigation into the use of tactile instructions in snowboarding. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services - MobileHCI ’12, 417. https://doi.org/10.1145/2371574.2371639",
      "doi": "10.1145/2371574.2371639"
    },
    {
      "text": "Jakob Tholander and Stina Nylander. 2015. Snot, Sweat, Pain, Mud, and Snow: Performance and Experience in the Use of Sports Watches. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI’15, 2913–2922. https://doi.org/10.1145/2702123.2702482",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "Zachary O. Toups, Andruid Kerne, and William A. Hamilton. 2011. The Team Coordination Game: Zero-fidelity simulation abstracted from fire emergency response practice. ACM Transactions on Computer-Human Interaction 18, 4: 1–37. https://doi.org/10.1145/2063231.2063237",
      "doi": "10.1145/2063231.2063237"
    },
    {
      "text": "Zachary O Toups, Andruid Kerne, William A Hamilton, and Nabeel Shahzad. 2011. Zero-fidelity simulation of fire emergency response: improving team coordination learning. 10.",
      "doi": ""
    },
    {
      "text": "A. Weilenmann and L.E. Holmquist. 1999. Hummingbirds go skiing: using wearable computers to support social interaction. In Digest of papers. Third International Symposium on Wearable Computers, 191–192. https://doi.org/10.1109/ISWC.1999.806924",
      "doi": ""
    },
    {
      "text": "Belinda Wheaton. 2004. Understanding lifestyle sports: Consumption, Identity and Difference. Routledge.",
      "doi": ""
    },
    {
      "text": "D. E. Young, Richard A. Schmidt, and Timothy D. Lee. 2006. Skill learning: Augmented feedback. International encyclopaedia of ergonomics and human factors, 558–561.",
      "doi": ""
    }
  ]
}