{
  "doi": "10.1145/3544548.3581085",
  "title": "Spatialized Audio and Hybrid Video Conferencing: Where Should Voices be Positioned for People in the Room and Remote Headset Users?",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Hybrid video calls include attendees in a conference room with loudspeakers and remote attendees using headsets, each with different options for rendering sound spatially. Two studies explored the listener experience with spatial audio in video calls. One study examined the in-room experience using loudspeakers, comparing among spatialization algorithms spreading voices out horizontally. A second study compared varying degrees of horizontal separation of binaurally rendered voices for a remote participant using a headset. In-room participants preferred the widest spatialization over monophonic, stereo, and stereo-binary audio in metrics related to intelligibility and helpfulness. Remote participants preferred different widths of the audio stage depending on the number of voices. In both studies, rendering sound spatially increased performance in speech stream identification. Results indicate spatial audio benefits for in-room and remote attendees in video calls, although the in-room attendees accepted a wider audio stage than remote users.",
  "authors": [
    {
      "name": "Jeremy Hyrkas",
      "institution": "Microsoft Research, United States and University of California San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658733015",
      "orcid": "0000-0002-2659-0657"
    },
    {
      "name": "Andrew D Wilson",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567780",
      "orcid": "0000-0001-5751-9354"
    },
    {
      "name": "John Tang",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81405592014/rel-imgonly/johntang_v2_cropped.jpg",
      "acmid": "81405592014",
      "orcid": "0000-0003-0603-3877"
    },
    {
      "name": "Hannes Gamper",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81486655108/rel-imgonly/pic.jpg",
      "acmid": "81486655108",
      "orcid": "0000-0002-2148-6367"
    },
    {
      "name": "Hong Sodoma",
      "institution": "Microsoft, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782658",
      "orcid": "0000-0003-0516-0233"
    },
    {
      "name": "Lev Tankelevitch",
      "institution": "Microsoft Research, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779127",
      "orcid": "0000-0003-1286-5194"
    },
    {
      "name": "Kori Inkpen",
      "institution": "Microsoft Research, Microsoft, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Shreya Chappidi",
      "institution": "Microsoft Research, United States and University of Virginia, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660489667",
      "orcid": "0000-0001-7042-5766"
    },
    {
      "name": "Brennan Jones",
      "institution": "Microsoft Research, United States and Reality Labs Research, Meta, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778626",
      "orcid": "0000-0002-8664-3191"
    }
  ],
  "references": [
    {
      "text": "Ronald M Aarts. 1993. Enlarging the sweet spot for stereophony by time/intensity trading. In Audio Engineering Society Convention 94. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Jessica J Baldis. 2001. Effects of spatial audio on memory, comprehension, and preference during desktop conferences. In Proceedings of the SIGCHI conference on Human factors in computing systems. 166–173.",
      "doi": "10.1145/365024.365092"
    },
    {
      "text": "John G Beerends and Frank E De Caluwe. 1999. The influence of video quality on perceived audio quality and vice versa. Journal of the Audio Engineering Society 47, 5 (1999), 355–362.",
      "doi": ""
    },
    {
      "text": "Augustinus J Berkhout, Diemer de Vries, and Peter Vogel. 1993. Acoustic control by wave field synthesis. The Journal of the Acoustical Society of America 93, 5 (1993), 2764–2778.",
      "doi": ""
    },
    {
      "text": "Paul Bertelson and Monique Radeau. 1976. Ventriloquism, sensory interaction, and response bias: Remarks on the paper by Choe, Welch, Gilford, and Juola. Perception & Psychophysics 19, 6 (1976), 531–535.",
      "doi": ""
    },
    {
      "text": "Jens Blauert. 1997. Spatial hearing: the psychophysics of human sound localization. MIT press.",
      "doi": ""
    },
    {
      "text": "Elizabeth A Boyle, Anne H Anderson, and Alison Newlands. 1994. The effects of visibility on dialogue and performance in a cooperative problem solving task. Language and speech 37, 1 (1994), 1–20.",
      "doi": ""
    },
    {
      "text": "Edgar Brunner, Sebastian Domhof, and Frank Langer. 2002. Nonparametric analysis of longitudinal data in factorial experiments. Vol. 373. Wiley-Interscience.",
      "doi": ""
    },
    {
      "text": "Jerry Brunner. 2019. Repeated measurement analysis of binary responses.http://www.utstat.toronto.edu/ brunner/workshops/mixed/",
      "doi": ""
    },
    {
      "text": "E Colin Cherry. 1953. Some experiments on the recognition of speech, with one and with two ears. The Journal of the acoustical society of America 25, 5 (1953), 975–979.",
      "doi": ""
    },
    {
      "text": "Werner Paulus Josephus De Bruijn. 2004. Application of wave field synthesis in videoconferencing. (2004).",
      "doi": ""
    },
    {
      "text": "Edina Fintor, Lukas Aspöck, Janina Fels, and Sabine J Schlittmeier. 2022. The role of spatial separation of two talkers’ auditory stimuli in the listener’s memory of running speech: listening effort in a non-noisy conversational setting. International Journal of Audiology 61, 5 (2022), 371–379.",
      "doi": ""
    },
    {
      "text": "Justin T Fleming, Ross K Maddox, and Barbara G Shinn-Cunningham. 2021. Spatial alignment between faces and voices improves selective attention to audio-visual speech. The Journal of the Acoustical Society of America 150, 4 (2021), 3085–3100.",
      "doi": ""
    },
    {
      "text": "William G Gardner and Keith D Martin. 1995. HRTF measurements of a KEMAR. The Journal of the Acoustical Society of America 97, 6 (1995), 3907–3908.",
      "doi": ""
    },
    {
      "text": "Michael A Gerzon. 1985. Ambisonics in multichannel broadcasting and video. Journal of the Audio Engineering Society 33, 11 (1985), 859–871.",
      "doi": ""
    },
    {
      "text": "Jackson Montgomery Goode. 2021. Toward a Telepresence of Sound: Video Conferencing in Spatial Audio. Master’s thesis.",
      "doi": ""
    },
    {
      "text": "Kori Inkpen, Rajesh Hegde, Mary Czerwinski, and Zhengyou Zhang. 2010. Exploring spatialized audio & video for distributed conversations. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. 95–98.",
      "doi": "10.1145/1718918.1718936"
    },
    {
      "text": "Gary L. Jones and Ruth Y. Litovsky. 2011. A cocktail party model of spatial release from masking by both noise and speech interferers. J. Acoust. Soc. Am. 130, 3 (2011), 1463–1474. https://doi.org/10.1121/1.3613928",
      "doi": ""
    },
    {
      "text": "Setsu Komiyama. 1989. Subjective evaluation of angular displacement between picture and sound directions for HDTV sound systems. Journal of the Audio Engineering Society 37, 4 (1989), 210–214.",
      "doi": ""
    },
    {
      "text": "Ruth Y Litovsky. 2012. Spatial release from masking. Acoust. Today 8, 2 (2012), 18–25.",
      "doi": ""
    },
    {
      "text": "Telecommunication Standardization Sector of ITU. 2017. Spatial Audio Meetings Quality Evaluation, Document ITU-T Rec. P.1310. International Telecommunication Union, Geneva, Switzerland.",
      "doi": ""
    },
    {
      "text": "Ville Pulkki. 1997. Virtual sound source positioning using vector base amplitude panning. Journal of the audio engineering society 45, 6 (1997), 456–466.",
      "doi": ""
    },
    {
      "text": "Alexander Raake, Markus Fiedler, Katrin Schoenenberg, Katrien De Moor, and Nicola Döring. 2022. Technological Factors Influencing Videoconferencing and Zoom Fatigue. https://doi.org/10.48550/ARXIV.2202.01740",
      "doi": ""
    },
    {
      "text": "Alexander Raake and Claudia Schlegel. 2008. Auditory assessment of conversational speech quality of traditional and spatialized teleconferences. In ITG conference on voice communication [8. ITG-Fachtagung]. VDE, 1–4.",
      "doi": ""
    },
    {
      "text": "Loïc Rosset, Hamed Alavi, Sailin Zhong, and Denis Lalanne. 2021. Already It Was Hard to Tell Who’s Speaking Over There, and Now Face Masks! Can Binaural Audio Help Remote Participation in Hybrid Meetings?. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": ""
    },
    {
      "text": "Janto Skowronek and Alexander Raake. 2015. Assessment of cognitive load, speech communication quality and quality of experience for spatial and non-spatial audio conferencing calls. Speech Communication 66(2015), 154–175.",
      "doi": "10.1016/j.specom.2014.10.003"
    },
    {
      "text": "Janto Skowronek, Alexander Raake, Gunilla Berndtsson, Olli S Rummukainen, Paolino Usai, Simon NB Gunkel, Mathias Johanson, Emanuël AP Habets, Ludovic Malfait, David Lindero, 2022. Quality of Experience in Telemeetings and Videoconferencing: A Comprehensive Survey. IEEE Access (2022).",
      "doi": ""
    },
    {
      "text": "Matthew Wong and Ramani Duraiswami. 2021. Shared-Space: Spatial Audio and Video Layouts for Videoconferencing in a Virtual Room. In 2021 Immersive and 3D Audio: from Architecture to Automotive (I3DA). IEEE, 1–6.",
      "doi": ""
    }
  ]
}