{
  "doi": "10.1145/3544548.3580906",
  "title": "Smartphone-derived Virtual Keyboard Dynamics Coupled with Accelerometer Data as a Window into Understanding Brain Health: Smartphone Keyboard and Accelerometer as Window into Brain Health",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "We examine the feasibility of using accelerometer data exclusively collected during typing on a custom smartphone keyboard to study whether typing dynamics are associated with daily variations in mood and cognition. As part of an ongoing digital mental health study involving mood disorders, we collected data from a well-characterized clinical sample (N = 85) and classified accelerometer data per typing session into orientation (upright vs. not) and motion (active vs. not). The mood disorder group showed lower cognitive performance despite mild symptoms (depression/mania). There were also diurnal pattern differences with respect to cognitive performance: individuals with higher cognitive performance typed faster and were less sensitive to time of day. They also exhibited more well-defined diurnal patterns in smartphone keyboard usage: they engaged with the keyboard more during the day and tapered their usage more at night compared to those with lower cognitive performance, suggesting a healthier usage of their phone.",
  "authors": [
    {
      "name": "Emma Ning",
      "institution": "Psychology, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780581",
      "orcid": "0000-0003-3579-8262"
    },
    {
      "name": "Andrea T. Cladek",
      "institution": "Psychiatry, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778627",
      "orcid": "0000-0003-0639-0196"
    },
    {
      "name": "Mindy K. Ross",
      "institution": "Biomedical Engineering, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660495240",
      "orcid": "0000-0002-8005-0053"
    },
    {
      "name": "Sarah Kabir",
      "institution": "Psychiatry, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781262",
      "orcid": "0000-0002-5381-9656"
    },
    {
      "name": "Amruta Barve",
      "institution": "Psychiatry, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782726",
      "orcid": "0000-0002-7692-9225"
    },
    {
      "name": "Ellyn Kennelly",
      "institution": "Psychology, Wayne State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781433",
      "orcid": "0000-0002-8238-8656"
    },
    {
      "name": "Faraz Hussain",
      "institution": "Psychiatry, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779288",
      "orcid": "0000-0002-4910-1342"
    },
    {
      "name": "Jennifer Duffecy",
      "institution": "Psychiatry, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781632",
      "orcid": "0000-0002-4505-6820"
    },
    {
      "name": "Scott L. Langenecker",
      "institution": "Psychiatry, University of Utah, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783753",
      "orcid": "0000-0002-7932-5494"
    },
    {
      "name": "Theresa Nguyen",
      "institution": "Biomedical Engineering, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778272",
      "orcid": "0000-0003-3730-6807"
    },
    {
      "name": "Theja Tulabandhula",
      "institution": "Information and Decision Sciences, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387608862",
      "orcid": "0000-0002-9469-3340"
    },
    {
      "name": "John Zulueta",
      "institution": "Psychiatry, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659193002",
      "orcid": "0000-0001-6834-1256"
    },
    {
      "name": "Olusola A. Ajilore",
      "institution": "Psychiatry, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550167656",
      "orcid": "0000-0003-0737-0437"
    },
    {
      "name": "Alexander P. Demos",
      "institution": "Psychology, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660387678",
      "orcid": "0000-0001-7964-7808"
    },
    {
      "name": "Alex Leow",
      "institution": "Psychiatry, Biomedical Engineering, University of Illinois Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100380710",
      "orcid": "0000-0002-5660-8651"
    }
  ],
  "references": [
    {
      "text": "Saeed Abdullah, Elizabeth L. Murnane, Mark Matthews, Matthew Kay, Julie A. Kientz, Geri Gay, and Tanzeem Choudhury. 2016. Cognitive rhythms: Unobtrusive and continuous sensing of alertness using a mobile phone. UbiComp 2016 - Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing(2016), 178–189. https://doi.org/10.1145/2971648.2971712",
      "doi": "10.1145/2971648.2971712"
    },
    {
      "text": "Hessa Alfalahi, Ahsan H. Khandoker, Nayeefa Chowdhury, Dimitrios Iakovakis, Sofia B. Dias, K. Ray Chaudhuri, and Leontios J. Hadjileontiadis. 2022. Diagnostic accuracy of keystroke dynamics as digital biomarkers for fine motor decline in neuropsychiatric disorders: a systematic review and meta-analysis. Scientific Reports 2022 12:1 12, 1 (may 2022), 1–24. https://doi.org/10.1038/s41598-022-11865-7",
      "doi": ""
    },
    {
      "text": "Sangwon Bae, Tammy Chung, Denzil Ferreira, Anind K. Dey, and Brian Suffoletto. 2018. Mobile phone sensors and supervised machine learning to identify alcohol use events in young adults: Implications for just-in-time adaptive interventions. Addictive Behaviors 83 (aug 2018), 42–47. https://doi.org/10.1016/J.ADDBEH.2017.11.039",
      "doi": ""
    },
    {
      "text": "Luca Bedogni, Marco Di Felice, and Luciano Bononi. 2012. By train or by car? Detecting the user’s motion type through smartphone sensors data. IFIP Wireless Days (2012). https://doi.org/10.1109/WD.2012.6402818",
      "doi": ""
    },
    {
      "text": "Dror Ben-Zeev, Michael A. Young, and Joshua W. Madsen. 2009. Retrospective recall of affect in clinically depressed individuals and controls. Cognition and Emotion 23, 5 (2009), 1021–1040. https://doi.org/10.1080/02699930802607937",
      "doi": ""
    },
    {
      "text": "Casey C. Bennett, Mindy K. Ross, Eu Gene Baek, Dohyeon Kim, and Alex D. Leow. 2022. Predicting clinically relevant changes in bipolar disorder outside the clinic walls based on pervasive technology interactions via smartphone typing dynamics. Pervasive and Mobile Computing 83 (jul 2022). https://doi.org/10.1016/J.PMCJ.2022.101598",
      "doi": "10.1016/J.PMCJ.2022.101598"
    },
    {
      "text": "Robert Bixler and Sidney D’Mello. 2013. Detecting boredom and engagement during writing with keystroke analysis, task appraisals, and stable traits. International Conference on Intelligent User Interfaces, Proceedings IUI (mar 2013), 225–233. https://doi.org/10.1145/2449396.2449426",
      "doi": "10.1145/2449396.2449426"
    },
    {
      "text": "C. Bourne, O. Aydemir, V. Balanzá-Martínez, E. Bora, S. Brissos, J. T.O. Cavanagh, L. Clark, Z. Cubukcuoglu, V. V. Dias, S. Dittmann, I. N. Ferrier, D. E. Fleck, S. Frangou, P. Gallagher, L. Jones, T. Kieseppä, A. Martínez-Aran, I. Melle, P. B. Moore, M. Mur, A. Pfennig, A. Raust, V. Senturk, C. Simonsen, D. J. Smith, D. S. Bio, M. G. Soeiro-de Souza, S. D.R. Stoddart, K. Sundet, A. Szöke, J. M. Thompson, C. Torrent, T. Zalla, N. Craddock, O. A. Andreassen, M. Leboyer, E. Vieta, M. Bauer, P. D. Worhunsky, C. Tzagarakis, R. D. Rogers, J. R. Geddes, and G. M. Goodwin. 2013. Neuropsychological testing of cognitive impairment in euthymic bipolar disorder: An individual patient data meta-analysis. Acta Psychiatrica Scandinavica 128, 3 (sep 2013), 149–162. https://doi.org/10.1111/acps.12133",
      "doi": ""
    },
    {
      "text": "Mollie E. Brooks, Kasper Kristensen, Koen J. van Benthem, Arni Magnusson, Casper W. Berg, Anders Nielsen, Hans J. Skaug, Martin Maechler, and Benjamin M. Bolker. 2017. glmmTMB Balances Speed and Flexibility Among Packages for Zero-inflated Generalized Linear Mixed Modeling. The R Journal 9, 2 (2017), 378–400. https://doi.org/10.32614/RJ-2017-066",
      "doi": ""
    },
    {
      "text": "Daniel Buschek, Alexander De Luca, and Florian Alt. 2015. Improving accuracy, applicability and usability of keystroke biometrics on mobile touchscreen devices. Conference on Human Factors in Computing Systems - Proceedings 2015-April (apr 2015), 1393–1402. https://doi.org/10.1145/2702123.2702252",
      "doi": "10.1145/2702123.2702252"
    },
    {
      "text": "G. B. Cassano, A. Benvenuti, M. Miniati, S. Calugi, M. Mula, L. Maggi, P. Rucci, A. Fagiolini, F. Perris, and E. Frank. 2009. The factor structure of lifetime depressive spectrum in patients with unipolar depression. Journal of Affective Disorders 115, 1-2 (may 2009), 87–99. https://doi.org/10.1016/J.JAD.2008.09.006",
      "doi": ""
    },
    {
      "text": "Michelle H Chen, Alex Leow, Mindy K Ross, John Deluca, Nancy Chiaravalloti, Silvana L Costa, Helen M Genova, Erica Weber, Faraz Hussain, and Alexander P Demos. 2022. Associations between smartphone keystroke dynamics and cognition in MS. Digital Health 8(2022), 1–12. https://doi.org/10.1177/20552076221143234",
      "doi": ""
    },
    {
      "text": "Richard Chen, Luca Foschini, Lampros Kourtis, Alessio Signorini, Filip Jankovic, Melissa Pugh, Jie Shen, Roy Yaari, Vera Maljkovic, Marc Sunga, Nikki Marinsek, Han Hee Song, Hyun Joon Jung, Belle Tseng, and Andrew Trister. 2019. Developing measures of cognitive impairment in the real world from consumer-grade multimodal sensor streams. Proceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (jul 2019), 2145–2155. https://doi.org/10.1145/3292500.3330690",
      "doi": "10.1145/3292500.3330690"
    },
    {
      "text": "Vivek Dhakal, Anna Maria Feit, Per Ola Kristensson, and Antti Oulasvirta. 2018. Observations on typing from 136 million keystrokes. Conference on Human Factors in Computing Systems - Proceedings 2018-April (apr 2018). https://doi.org/10.1145/3173574.3174220",
      "doi": "10.1145/3173574.3174220"
    },
    {
      "text": "Tilman Dingler, Albrecht Schmidt, and Tonja Machulla. 2017. Building Cognition-Aware Systems. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (sep 2017), 1–15. https://doi.org/10.1145/3132025",
      "doi": "10.1145/3132025"
    },
    {
      "text": "Rachel Eardley, Anne Roudaut, Steve Gill, and Stephen J. Thompson. 2018. Investigating how smartphone movement is affected by body posture. Conference on Human Factors in Computing Systems - Proceedings 2018-April (apr 2018). https://doi.org/10.1145/3173574.3173776",
      "doi": "10.1145/3173574.3173776"
    },
    {
      "text": "Clayton Epp, Michael Lippold, and Regan L. Mandryk. 2011. Identifying emotional states using keystroke dynamics. Conference on Human Factors in Computing Systems - Proceedings (2011), 715–724. https://doi.org/10.1145/1978942.1979046",
      "doi": "10.1145/1978942.1979046"
    },
    {
      "text": "Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N. Patel, and Jacob O. Wobbrock. 2013. ContextType: Using hand posture information to improve mobile touch screen text entry. Conference on Human Factors in Computing Systems - Proceedings (2013), 2795–2798. https://doi.org/10.1145/2470654.2481386",
      "doi": "10.1145/2470654.2481386"
    },
    {
      "text": "Safaa Hriez, Nadim Obeid, and Arafat Awajan. 2019. User authentication on smartphones using keystroke dynamics. ACM International Conference Proceeding Series (dec 2019). https://doi.org/10.1145/3368691.3368725",
      "doi": "10.1145/3368691.3368725"
    },
    {
      "text": "Dimitrios Iakovakis, K. Ray Chaudhuri, Lisa Klingelhoefer, Sevasti Bostantjopoulou, Zoe Katsarou, Dhaval Trivedi, Heinz Reichmann, Stelios Hadjidimitriou, Vasileios Charisis, and Leontios J. Hadjileontiadis. 2020. Screening of Parkinsonian subtle fine-motor impairment from touchscreen typing via deep learning. Scientific Reports 2020 10:1 10, 1 (jul 2020), 1–13. https://doi.org/10.1038/s41598-020-69369-1",
      "doi": ""
    },
    {
      "text": "Dimitrios Iakovakis, Stelios Hadjidimitriou, Vasileios Charisis, Sevasti Bostantjopoulou, Zoe Katsarou, Lisa Klingelhoefer, Heinz Reichmann, Sofia B. Dias, José A. Diniz, Dhaval Trivedi, K. Ray Chaudhuri, and Leontios J. Hadjileontiadis. 2018. Motor impairment estimates via touchscreen typing dynamics toward Parkinson’s Disease detection from data harvested in-the-wild. Frontiers in ICT 5 (nov 2018), 28. https://doi.org/10.3389/FICT.2018.00028/BIBTEX",
      "doi": ""
    },
    {
      "text": "Xinhui Jiang, Jussi P.P. Jokinen, Antti Oulasvirta, and Xiangshi Ren. 2022. Learning to type with mobile keyboards: Findings with a randomized keyboard. Computers in Human Behavior 126 (jan 2022). https://doi.org/10.1016/J.CHB.2021.106992",
      "doi": "10.1016/J.CHB.2021.106992"
    },
    {
      "text": "Xinhui Jiang, Yang Li, Jussi P.P. Jokinen, Viet Ba Hirvola, Antti Oulasvirta, and Xiangshi Ren. 2020. How We Type: Eye and Finger Movement Strategies in Mobile Typing. Conference on Human Factors in Computing Systems - Proceedings (apr 2020). https://doi.org/10.1145/3313831.3376711",
      "doi": "10.1145/3313831.3376711"
    },
    {
      "text": "Jennifer C. Kanady and Allison G. Harvey. 2015. Development and Validation of the Sleep Inertia Questionnaire (SIQ) and Assessment of Sleep Inertia in Analogue and Clinical Depression. Cognitive therapy and research 39, 5 (oct 2015), 601. https://doi.org/10.1007/S10608-015-9686-4",
      "doi": ""
    },
    {
      "text": "Rinat Khusainov, Djamel Azzi, Ifeyinwa E. Achumba, and Sebastian D. Bersch. 2013. Real-time human ambulation, activity, and physiological monitoring: Taxonomy of issues, techniques, applications, challenges and limitations. https://doi.org/10.3390/s131012852",
      "doi": ""
    },
    {
      "text": "William D.S. Killgore. 2010. Effects of sleep deprivation on cognition. Progress in Brain Research 185, C (jan 2010), 105–129. https://doi.org/10.1016/B978-0-444-53702-7.00007-5",
      "doi": ""
    },
    {
      "text": "Matthew M Kurtz and Raphael T Gerraty. 2009. A Meta-Analytic Investigation of Neurocognitive Deficits in Bipolar Illness: Profile and Effects of Clinical State. Neuropsychology 23, 5 (2009), 551–562. https://doi.org/10.1037/a0016277",
      "doi": ""
    },
    {
      "text": "Alex Mariakakis, Sayna Parsi, Shwetak N. Patel, and Jacob O. Wobbrock. 2018. Drunk user interfaces: Determining blood alcohol level through everyday smartphone tasks. Conference on Human Factors in Computing Systems - Proceedings 2018-April (2018). https://doi.org/10.1145/3173574.3173808",
      "doi": "10.1145/3173574.3173808"
    },
    {
      "text": "Rafail Evangelos Mastoras, Dimitrios Iakovakis, Stelios Hadjidimitriou, Vasileios Charisis, Seada Kassie, Taoufik Alsaadi, Ahsan Khandoker, and Leontios J. Hadjileontiadis. 2019. Touchscreen typing pattern analysis for remote detection of the depressive tendency. Scientific Reports 2019 9:1 9, 1 (sep 2019), 1–12. https://doi.org/10.1038/s41598-019-50002-9",
      "doi": ""
    },
    {
      "text": "Jun Ki Min, Afsaneh Doryab, Jason Wiese, Shahriyar Amini, John Zimmerman, and Jason I. Hong. 2014. Toss ’N’ turn: Smartphone as sleep and sleep quality detector. Conference on Human Factors in Computing Systems - Proceedings (2014), 477–486. https://doi.org/10.1145/2556288.2557220",
      "doi": "10.1145/2556288.2557220"
    },
    {
      "text": "Greg Murray. 2007. Diurnal mood variation in depression: A signal of disturbed circadian function?Journal of Affective Disorders 102, 1-3 (sep 2007), 47–53. https://doi.org/10.1016/J.JAD.2006.12.001",
      "doi": ""
    },
    {
      "text": "Jukka Pekka Onnela and Scott L. Rauch. 2016. Harnessing Smartphone-Based Digital Phenotyping to Enhance Behavioral and Mental Health. https://doi.org/10.1038/npp.2016.7",
      "doi": ""
    },
    {
      "text": "Venet Osmani, Alban Maxhuni, Agnes Grünerbl, Paul Lukowicz, Christian Haring, and Oscar Mayora. 2013. Monitoring activity of patients with bipolar disorder using smart phones. In ACM International Conference Proceeding Series. 85–92. https://doi.org/10.1145/2536853.2536882",
      "doi": "10.1145/2536853.2536882"
    },
    {
      "text": "Alexandros Papadopoulos, Dimitrios Iakovakis, Lisa Klingelhoefer, Sevasti Bostantjopoulou, K. Ray Chaudhuri, Konstantinos Kyritsis, Stelios Hadjidimitriou, Vasileios Charisis, Leontios J. Hadjileontiadis, and Anastasios Delopoulos. 2020. Unobtrusive detection of Parkinson’s disease from multi-modal and in-the-wild sensor data using deep learning techniques. Scientific Reports 2020 10:1 10, 1 (dec 2020), 1–13. https://doi.org/10.1038/s41598-020-78418-8",
      "doi": ""
    },
    {
      "text": "Homa Rashidisabet, Olusola Ajilore, Alex Leow, and Alexander P. Demos. 2022. Revisiting power-law estimation with applications to real-world human typing dynamics. Physica A: Statistical Mechanics and its Applications 599 (aug 2022). https://doi.org/10.1016/j.physa.2022.127384",
      "doi": ""
    },
    {
      "text": "Nishkam Ravi, Nikhil Dandekar, Preetham Mysore, and Michael L Littman. 2005. Activity recognition from accelerometer data. In Proceedings of the National Conference on Artificial Intelligence, Vol. 3. 1541–1546.",
      "doi": ""
    },
    {
      "text": "Barbara Ravnkilde, Poul Videbech, Karin Clemmensen, Annette Egander, Niels Anton Rasmussen, and Raben Rosenberg. 2002. Cognitive deficits in major depression. Scandinavian Journal of Psychology 43, 3 (jul 2002), 239–251. https://doi.org/10.1111/1467-9450.00292",
      "doi": ""
    },
    {
      "text": "Philipp S. Ritter, Carolin Marx, Natalia Lewtschenko, Steffi Pfeiffer, Karolina Leopold, Michael Bauer, and Andrea Pfennig. 2012. The characteristics of sleep in patients with manifest bipolar disorder, subjects at high risk of developing the disease and healthy controls. Journal of Neural Transmission 119, 10 (oct 2012), 1173–1184. https://doi.org/10.1007/S00702-012-0883-Y/TABLES/7",
      "doi": ""
    },
    {
      "text": "Lucy J. Robinson, Jill M. Thompson, Peter Gallagher, Utpal Goswami, Allan H. Young, I. Nicol Ferrier, and P. Brian Moore. 2006. A meta-analysis of cognitive deficits in euthymic patients with bipolar disorder. Journal of Affective Disorders 93, 1-3 (jul 2006), 105–115. https://doi.org/10.1016/j.jad.2006.02.016",
      "doi": ""
    },
    {
      "text": "Mindy K. Ross, Alexander P. Demos, John Zulueta, Andrea Piscitello, Scott A. Langenecker, Melvin McInnis, Olusola Ajilore, Peter C. Nelson, Kelly A. Ryan, and Alex Leow. 2021. Naturalistic smartphone keyboard typing reflects processing speed and executive function. Brain and Behavior 11, 11 (nov 2021). https://doi.org/10.1002/brb3.2363",
      "doi": ""
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Kai Kunze, and Albrecht Schmidt. 2013. Upright or sideways? Analysis of smartphone postures in the wild. In MobileHCI 2013 - Proceedings of the 15th International Conference on Human-Computer Interaction with Mobile Devices and Services. 362–371. https://doi.org/10.1145/2493190.2493230",
      "doi": "10.1145/2493190.2493230"
    },
    {
      "text": "Christina Schmidt, Fabienne Collette, Christian Cajochen, and Philippe Peigneux. 2007. A time to think: Circadian rhythms in human cognition. Cognitive Neuropsychology 24, 7 (oct 2007), 755–789. https://doi.org/10.1080/02643290701754158",
      "doi": ""
    },
    {
      "text": "Jussi Seppälä, Ilaria De Vita, Timo Jämsä, Jouko Miettunen, Matti Isohanni, Katya Rubinstein, Yoram Feldman, Eva Grasa, Iluminada Corripio, Jesus Berdun, Enrico D’Amico, and Maria Bulgheroni. 2019. Mobile phone and wearable sensor-based mhealth approaches for psychiatric disorders and symptoms: Systematic review. https://doi.org/10.2196/mental.9819",
      "doi": ""
    },
    {
      "text": "Saul Shiffman, Arthur A. Stone, and Michael R. Hufford. 2008. Ecological momentary assessment. https://doi.org/10.1146/annurev.clinpsy.3.022806.091415",
      "doi": ""
    },
    {
      "text": "Valeriu Daniel Stanciu, Riccardo Spolaor, Mauro Conti, and Cristiano Giuffrida. 2016. On the effectiveness of sensor-enhanced keystroke dynamics against statistical attacks. CODASPY 2016 - Proceedings of the 6th ACM Conference on Data and Application Security and Privacy (mar 2016), 105–112. https://doi.org/10.1145/2857705.2857748",
      "doi": "10.1145/2857705.2857748"
    },
    {
      "text": "Jonathan P. Stange, John Zulueta, Scott A. Langenecker, Kelly A. Ryan, Andrea Piscitello, Jenna Duffecy, Melvin G. McInnis, Pete Nelson, Olusola Ajilore, and Alex Leow. 2018. Let your fingers do the talking: Passive typing instability predicts future mood outcomes. Bipolar Disorders 20, 3 (may 2018), 285–288. https://doi.org/10.1111/BDI.12637",
      "doi": ""
    },
    {
      "text": "Ming Sun and J. O. Hill. 1993. A method for measuring mechanical work and work efficiency during human activities. Journal of Biomechanics 26, 3 (1993), 229–241. https://doi.org/10.1016/0021-9290(93)90361-H",
      "doi": ""
    },
    {
      "text": "Shikha Tripathi, Teresa Arroyo-Gallego, and Luca Giancardo. 2022. Keystroke-Dynamics for Parkinson’s Disease Signs Detection in An At-Home Uncontrolled Population: A New Benchmark and Method. IEEE Transactions on Biomedical Engineering(2022). https://doi.org/10.1109/TBME.2022.3187309",
      "doi": ""
    },
    {
      "text": "Athanasios Tsanas, Elizabeth Woodward, and Anke Ehlers. 2020. Objective Characterization of Activity, Sleep, and Circadian Rhythm Patterns Using a Wrist-Worn Actigraphy Sensor: Insights Into Posttraumatic Stress Disorder. JMIR mHealth and uHealth 8, 4 (apr 2020). https://doi.org/10.2196/14306",
      "doi": ""
    },
    {
      "text": "E. J.W. Van Someren. 1997. Actigraphic monitoring of movement and rest-activity rhythms in aging, Alzheimer’s disease, and Parkinson’s disease., 394–398 pages.",
      "doi": ""
    },
    {
      "text": "Claudia Vesel, Homa Rashidisabet, John Zulueta, Jonathan P. Stange, Jennifer Duffecy, Faraz Hussain, Andrea Piscitello, John Bark, Scott A. Langenecker, Shannon Young, Erin Mounts, Larsson Omberg, Peter C. Nelson, Raeanne C. Moore, Dave Koziol, Keith Bourne, Casey C. Bennett, Olusola Ajilore, Alexander P. Demos, and Alex Leow. 2020. Effects of mood and aging on keystroke dynamics metadata and their diurnal patterns in a large open-science sample: A BiAffect iOS study. Journal of the American Medical Informatics Association 27, 7 (jul 2020), 1007–1018. https://doi.org/10.1093/jamia/ocaa057",
      "doi": ""
    },
    {
      "text": "Lakshmi N. Yatham, Ivan J. Torres, Gin S. Malhi, Sophia Frangou, David C. Glahn, Carrie E. Bearden, Katherine E. Burdick, Anabel Martínez-Arán, Sandra Dittmann, Joseph F. Goldberg, Aysegul Ozerdem, Omer Aydemir, and K. N.Roy Chengappa. 2010. The International Society for Bipolar Disorders-Battery for Assessment of Neurocognition (ISBD-BANC). Bipolar Disorders 12, 4 (jun 2010), 351–363. https://doi.org/10.1111/j.1399-5618.2010.00830.x",
      "doi": ""
    },
    {
      "text": "Nan Zheng, Kun Bai, Hai Huang, and Haining Wang. 2014. You are how you touch: User verification on smartphones via tapping behaviors. Proceedings - International Conference on Network Protocols, ICNP (dec 2014), 221–232. https://doi.org/10.1109/ICNP.2014.43",
      "doi": "10.1109/ICNP.2014.43"
    },
    {
      "text": "John Zulueta, Alexander Pantelis Demos, Claudia Vesel, Mindy Ross, Andrea Piscitello, Faraz Hussain, Scott A. Langenecker, Melvin McInnis, Peter Nelson, Kelly Ryan, Alex Leow, and Olusola Ajilore. 2021. The Effects of Bipolar Disorder Risk on a Mobile Phone Keystroke Dynamics Based Biomarker of Brain Age. Frontiers in Psychiatry 12 (dec 2021). https://doi.org/10.3389/fpsyt.2021.739022",
      "doi": ""
    },
    {
      "text": "John Zulueta, Andrea Piscitello, Mladen Rasic, Rebecca Easter, Pallavi Babu, Scott A. Langenecker, Melvin McInnis, Olusola Ajilore, Peter C. Nelson, Kelly Ryan, and Alex Leow. 2018. Predicting mood disturbance severity with mobile phone keystroke metadata: A biaffect digital phenotyping study. Journal of Medical Internet Research 20, 7 (jul 2018). https://doi.org/10.2196/jmir.9775",
      "doi": ""
    }
  ]
}