{
  "doi": "10.1145/3544548.3580679",
  "title": "Assistive-Technology Aided Manual Accessibility Testing in Mobile Apps, Powered by Record-and-Replay",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [],
  "abstract": "Billions of people use smartphones on a daily basis, including 15% of the world’s population with disabilities. Mobile platforms encourage developers to manually assess their apps’ accessibility in the way disabled users interact with phones, i.e., through Assistive Technologies (AT) like screen readers. However, most developers only test their apps with touch gestures and do not have enough knowledge to use AT properly. Moreover, automated accessibility testing tools typically do not consider AT. This paper introduces a record-and-replay technique that records the developers’ touch interactions, replays the same actions with an AT, and generates a visualized report of various ways of interacting with the app using ATs. Empirical evaluation of this technique on real-world apps revealed that while user study is the most reliable way of assessing accessibility, our technique can aid developers in detecting complex accessibility issues at different stages of development.",
  "authors": [
    {
      "name": "Navid Salehnamadi",
      "institution": "University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-99659539077/rel-imgonly/profile_stand_new.jpg",
      "acmid": "99659539077",
      "orcid": "0000-0001-7009-2420"
    },
    {
      "name": "Ziyao He",
      "institution": "University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782110",
      "orcid": "0000-0002-1222-7240"
    },
    {
      "name": "Sam Malek",
      "institution": "University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100267865",
      "orcid": "0000-0001-6152-7402"
    }
  ],
  "references": [
    {
      "text": "Ali S Alotaibi, Paul T Chiou, and William GJ Halfond. 2022. Automated Detection of TalkBack Interactive Accessibility Failures in Android Applications. In 2022 IEEE Conference on Software Testing, Verification and Validation (ICST). IEEE, IEEE, Virtual, 232–243.",
      "doi": ""
    },
    {
      "text": "Abdulaziz Alshayban, Iftekhar Ahmed, and Sam Malek. 2020. Accessibility issues in Android apps: state of affairs, sentiments, and ways forward. In 2020 IEEE/ACM 42nd International Conference on Software Engineering. ICSE, Virtual, 1323–1334.",
      "doi": "10.1145/3377811.3380392"
    },
    {
      "text": "Abdulaziz Alshayban and Sam Malek. 2022. AccessiText: Automated Detection of Text Accessibility Issues in Android Apps. In Proceedings of the 30th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (Singapore, Singapore) (ESEC/FSE 2022). Association for Computing Machinery, New York, NY, USA, 984–995. https://doi.org/10.1145/3540250.3549118",
      "doi": "10.1145/3540250.3549118"
    },
    {
      "text": "Silviu Andrica and George Candea. 2011. WaRR: A tool for high-fidelity web application record and replay. In 2011 IEEE/IFIP 41st International Conference on Dependable Systems & Networks (DSN). IEEE, Hong Kong, China, 403–410.",
      "doi": "10.1109/DSN.2011.5958253"
    },
    {
      "text": "Android. 2022. Accessibility Scanner - Apps on Google Play. Google. Retrieved May 6, 2022 from https://play.google.com/store/apps/details?id=com.google.android.apps.accessibility.auditor&hl=en_US",
      "doi": ""
    },
    {
      "text": "Android. 2022. AccessibilityService in Android. Google. Retrieved May 6, 2022 from https://developer.android.com/guide/topics/ui/accessibility/service",
      "doi": ""
    },
    {
      "text": "Android. 2022. Android accessibility overview. Google. Retrieved May 6, 2022 from https://support.google.com/accessibility/android/answer/6006564",
      "doi": ""
    },
    {
      "text": "Android. 2022. Build more accessible apps. Google. Retrieved May 6, 2022 from https://developer.android.com/guide/topics/ui/accessibility",
      "doi": ""
    },
    {
      "text": "Android. 2022. Espresso : Android Developers. Google. Retrieved May 6, 2022 from https://developer.android.com/training/testing/espresso",
      "doi": ""
    },
    {
      "text": "Android. 2022. Get started on android with talkback - android accessibility help.Google. Retrieved May 6, 2022 from https://support.google.com/accessibility/android/answer/6283677?hl=en",
      "doi": ""
    },
    {
      "text": "Android. 2022. Improve your code with lint checks. Google. Retrieved May 6, 2020 from https://developer.android.com/studio/write/lint?hl=en",
      "doi": ""
    },
    {
      "text": "Android. 2022. TalkBack source code by Google. Google. Retrieved May 6, 2022 from https://github.com/google/talkback",
      "doi": ""
    },
    {
      "text": "Android. 2022. Use Touch Gestures. Google Inc. Retrieved August 29, 2022 from https://developer.android.com/develop/ui/views/touch-and-input/gestures",
      "doi": ""
    },
    {
      "text": "Vinod Anupam, Juliana Freire, Bharat Kumar, and Daniel Lieuwen. 2000. Automating Web navigation with the WebVCR. Computer Networks 33, 1-6 (2000), 503–517.",
      "doi": "10.1016/S1389-1286%2800%2900073-6"
    },
    {
      "text": "appetizerio. 2022. Replaykit. appetizerio. Retrieved September 2, 2022 from https://github.com/appetizerio/replaykit",
      "doi": ""
    },
    {
      "text": "Apple. 2022. Accessibility on iOS. Apple. Retrieved May 6, 2021 from https://developer.apple.com/accessibility/ios/",
      "doi": ""
    },
    {
      "text": "Apple. 2022. Apple Accessibility. Apple. Retrieved May 6, 2020 from https://www.apple.com/accessibility/iphone/",
      "doi": ""
    },
    {
      "text": "Apple. 2022. Debug Accessibility in iOS Simulator with the Accessibility Inspector. Apple. Retrieved May 6, 2022 from https://developer.apple.com/library/archive/technotes/TestingAccessibilityOfiOSApps/TestAccessibilityiniOSSimulatorwithAccessibilityInspector/TestAccessibilityiniOSSimulatorwithAccessibilityInspector.html#//apple_ref/doc/uid/TP40012619-CH4-SW1",
      "doi": ""
    },
    {
      "text": "Tingting Bi, Xin Xia, David Lo, John Grundy, Thomas Zimmermann, and Denae Ford. 2022. Accessibility in software practice: A practitioner’s perspective. ACM Transactions on Software Engineering and Methodology (TOSEM) 31, 4(2022), 1–26.",
      "doi": "10.1145/3503508"
    },
    {
      "text": "Jeffrey P Bigham, Jeremy T Brudvik, and Bernie Zhang. 2010. Accessibility by demonstration: enabling end users to guide developers to web accessibility solutions. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility. Association for Computing Machinery, Orlando, USA, 35–42.",
      "doi": "10.1145/1878803.1878812"
    },
    {
      "text": "Michael Bolin, Matthew Webber, Philip Rha, Tom Wilson, and Robert C Miller. 2005. Automation and customization of rendered web pages. In Proceedings of the 18th annual ACM symposium on User interface software and technology. Association for Computing Machinery, Seattle, USA, 163–172.",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Giovanna Broccia, Marco Manca, Fabio Paternò, and Francesca Pulina. 2020. Flexible automatic support for web accessibility validation. Proceedings of the ACM on Human-Computer Interaction 4, EICS(2020), 1–24.",
      "doi": "10.1145/3397871"
    },
    {
      "text": "Jieshan Chen, Chunyang Chen, Zhenchang Xing, Xiwei Xu, Liming Zhu, and Guoqiang Li. 2020. Unblind Your Apps: Predicting Natural-Language Labels for Mobile GUI Components by Deep Learning. In 2020 IEEE/ACM 42nd International Conference on Software Engineering. ICSE, Virtual, 322–334.",
      "doi": "10.1145/3377811.3380327"
    },
    {
      "text": "Sen Chen, Chunyang Chen, Lingling Fan, Mingming Fan, Xian Zhan, and Yang Liu. 2021. Accessible or Not An Empirical Investigation of Android App Accessibility. IEEE Transactions on Software Engineering 48 (2021), 3954–3968.",
      "doi": "10.1109/TSE.2021.3108162"
    },
    {
      "text": "Dictionary.Com. 2022. Dictionary.com English Word Meanings & Definitions. Dictionary.Com. Retrieved August 29, 2022 from https://play.google.com/store/apps/details?id=com.dictionary",
      "doi": ""
    },
    {
      "text": "Marcelo Medeiros Eler, José Miguel Rojas, Yan Ge, and Gordon Fraser. 2018. Automated accessibility testing of mobile apps. In 2018 IEEE 11th International Conference on Software Testing, Verification and Validation. ICST, Västerås, Sweden, 116–126.",
      "doi": ""
    },
    {
      "text": "Mattia Fazzini, Eduardo Noronha De A Freitas, Shauvik Roy Choudhary, and Alessandro Orso. 2017. Barista: A technique for recording, encoding, and running platform independent android tests. In 2017 IEEE International Conference on Software Testing, Verification and Validation (ICST). IEEE, IEEE, Tokyo, Japan, 149–160.",
      "doi": ""
    },
    {
      "text": "Earlence Fernandes, Qi Alfred Chen, Georg Essl, J Alex Halderman, Z Morley Mao, and Atul Prakash. 2014. Tivos: Trusted visual i/o paths for android. University of Michigan CSE Technical Report CSE-TR-586-14 (2014), 12 pages.",
      "doi": ""
    },
    {
      "text": "Cuiyun Gao, Jichuan Zeng, Federica Sarro, David Lo, Irwin King, and Michael R Lyu. 2021. Do users care about ad’s performance costs? Exploring the effects of the performance costs of in-app ads on user experience. Information and Software Technology 132 (2021), 106471.",
      "doi": ""
    },
    {
      "text": "Greg Gay and Cindy Qi Li. 2010. AChecker: open, interactive, customizable, web accessibility checking. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A). Association for Computing Machinery, Raleigh, USA, 1–2.",
      "doi": "10.1145/1805986.1806019"
    },
    {
      "text": "Lorenzo Gomez, Iulian Neamtiu, Tanzirul Azim, and Todd Millstein. 2013. Reran: Timing-and touch-sensitive record and replay for android. In 2013 35th International Conference on Software Engineering (ICSE). IEEE, IEEE, San Francisco, CA, USA, 72–81.",
      "doi": ""
    },
    {
      "text": "Jiaping Gui, Meiyappan Nagappan, and William GJ Halfond. 2017. What aspects of mobile ads do users care about? an empirical study of mobile in-app ad reviews. arXiv preprint arXiv:1702.07681(2017), 10 pages.",
      "doi": ""
    },
    {
      "text": "Jiaqi Guo, Shuyue Li, Jian-Guang Lou, Zijiang Yang, and Ting Liu. 2019. Sara: self-replay augmented record and replay for Android in industrial cases. In Proceedings of the 28th acm sigsoft international symposium on software testing and analysis. Association for Computing Machinery, Beijing, China, 90–100.",
      "doi": "10.1145/3293882.3330557"
    },
    {
      "text": "Matthew Halpern, Yuhao Zhu, Ramesh Peri, and Vijay Janapa Reddi. 2015. Mosaic: cross-platform user-interaction record and replay for the fragmented android ecosystem. In 2015 IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS). IEEE, IEEE, Philadelphia, PA, USA, 215–224.",
      "doi": ""
    },
    {
      "text": "Shuai Hao, Bin Liu, Suman Nath, William GJ Halfond, and Ramesh Govindan. 2014. PUMA: programmable UI-automation for large-scale dynamic analysis of mobile apps. In Proceedings of the 12th annual international conference on Mobile systems, applications, and services. ACM New York, NY, USA, Bretton Woods, New Hampshire, USA, 204–217.",
      "doi": "10.1145/2594368.2594390"
    },
    {
      "text": "Yongjian Hu, Tanzirul Azim, and Iulian Neamtiu. 2015. Versatile yet lightweight record-and-replay for android. In Proceedings of the 2015 ACM SIGPLAN International Conference on Object-Oriented Programming, Systems, Languages, and Applications. Association for Computing Machinery, Auckland, New Zealand, 349–366.",
      "doi": "10.1145/2814270.2814320"
    },
    {
      "text": "Darris Hupp and Robert C Miller. 2007. Smart bookmarks: automatic retroactive macro recording on the web. In Proceedings of the 20th annual ACM symposium on User interface software and technology. Association for Computing Machinery, Newport, USA, 81–90.",
      "doi": "10.1145/1294211.1294226"
    },
    {
      "text": "Mona Erfani Joorabchi, Ali Mesbah, and Philippe Kruchten. 2013. Real challenges in mobile app development. In 2013 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement. IEEE, IEEE, Baltimore, MD, USA, 15–24.",
      "doi": ""
    },
    {
      "text": "Kiran Kaja. 2022. DoorDash Issue Tweet. Retrieved September 15, 2022 from https://twitter.com/kirankaja12/status/1551710324016836608",
      "doi": ""
    },
    {
      "text": "KIF. 2022. Keep It Functional - An iOS Functional Testing Framework. Retrieved November 28, 2022 from https://github.com/kif-framework/KIF",
      "doi": ""
    },
    {
      "text": "Pavneet Singh Kochhar, Ferdian Thung, Nachiappan Nagappan, Thomas Zimmermann, and David Lo. 2015. Understanding the test automation culture of app developers. In 2015 IEEE 8th International Conference on Software Testing, Verification and Validation (ICST). IEEE, IEEE, Graz, Austria, 1–10.",
      "doi": ""
    },
    {
      "text": "Will Lachance. 2022. Orangutan. wlach. Retrieved September 2, 2022 from https://github.com/wlach/orangutan",
      "doi": ""
    },
    {
      "text": "Gilly Leshed, Eben M Haber, Tara Matthews, and Tessa Lau. 2008. CoScripter: automating & sharing how-to knowledge in the enterprise. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Florence, Italy, 1719–1728.",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Ian Li, Jeffrey Nichols, Tessa Lau, Clemens Drews, and Allen Cypher. 2010. Here’s what I did: Sharing and reusing web activity with ActionShot. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Atlanta, USA, 723–732.",
      "doi": "10.1145/1753326.1753432"
    },
    {
      "text": "Toby Jia-Jun Li, Amos Azaria, and Brad A Myers. 2017. SUGILITE: creating multimodal smartphone automation by demonstration. In Proceedings of the 2017 CHI conference on human factors in computing systems. Association for Computing Machinery, Bremen, Germany, 6038–6049.",
      "doi": ""
    },
    {
      "text": "Jun-Wei Lin, Navid Salehnamadi, and Sam Malek. 2020. Test automation in open-source android apps: A large-scale empirical study. In Proceedings of the 35th IEEE/ACM International Conference on Automated Software Engineering. ACM New York, NY, USA, Virtual, Australia, 1078–1089.",
      "doi": "10.1145/3324884.3416623"
    },
    {
      "text": "Mario Linares-Vásquez, Carlos Bernal-Cárdenas, Kevin Moran, and Denys Poshyvanyk. 2017. How do developers test android applications?. In 2017 IEEE International Conference on Software Maintenance and Evolution (ICSME). IEEE, IEEE, Shanghai, China, 613–622.",
      "doi": ""
    },
    {
      "text": "Zhenyue Long, Guoquan Wu, Xiaojiang Chen, Wei Chen, and Jun Wei. 2020. WebRR: self-replay enhanced robust record/replay for web application testing. In Proceedings of the 28th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering. Association for Computing Machinery, Virtual Event, USA, 1498–1508.",
      "doi": "10.1145/3368089.3417069"
    },
    {
      "text": "Google Material Design. 2022. Gestures. Google Inc. Retrieved August 29, 2022 from https://material.io/design/interaction/gestures.html#principles",
      "doi": ""
    },
    {
      "text": "Forough Mehralian, Navid Salehnamadi, Syed Fatiul Huq, and Sam Malek. 2022. Too Much Accessibility is Harmful! Automated Detection and Analysis of Overly Accessible Elements in Mobile Apps. In 2022 37th IEEE/ACM International Conference on Automated Software Engineering. IEEE, ACM New York, NY, USA, Rochester, Michigan, USA, 13 pages.",
      "doi": "10.1145/3551349.3560424"
    },
    {
      "text": "Forough Mehralian, Navid Salehnamadi, and Sam Malek. 2021. Data-driven accessibility repair revisited: on the effectiveness of generating labels for icons in Android apps. In Proceedings of the 29th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering. ACM New York, NY, USA, Virtual, Athens, Greece, 107–118.",
      "doi": "10.1145/3468264.3468604"
    },
    {
      "text": "Diego Torres Milano. 2022. Culebra. Diego Torres Milano. Retrieved September 2, 2022 from https://github.com/dtmilano/AndroidViewClient/wiki/culebra",
      "doi": ""
    },
    {
      "text": "Zhengrui Qin, Yutao Tang, Ed Novak, and Qun Li. 2016. Mobiplay: A remote execution based record-and-replay tool for mobile applications. In Proceedings of the 38th International Conference on Software Engineering. Association for Computing Machinery, Texas, Austin, 571–582.",
      "doi": "10.1145/2884781.2884854"
    },
    {
      "text": "Ranorex. 2022. ranorex. Idera, Inc. Retrieved September 2, 2022 from https://www.ranorex.com/mobile-automation-testing/android-test-automation/",
      "doi": ""
    },
    {
      "text": "RobotiumTech. 2022. robotiumrecorder. RobotiumTech. Retrieved September 2, 2022 from https://github.com/RobotiumTech/robotium",
      "doi": ""
    },
    {
      "text": "Anne Spencer Ross, Xiaoyi Zhang, James Fogarty, and Jacob O Wobbrock. 2017. Epidemiology as a framework for large-scale mobile application accessibility assessment. In Proceedings of the 19th international ACM SIGACCESS conference on computers and accessibility. ASSETS, Baltimore, MD, USA, 2–11.",
      "doi": "10.1145/3132525.3132547"
    },
    {
      "text": "Onur Sahin, Assel Aliyeva, Hariharan Mathavan, Ayse Coskun, and Manuel Egele. 2019. Randr: Record and replay for android applications via targeted runtime instrumentation. In 2019 34th IEEE/ACM International Conference on Automated Software Engineering (ASE). IEEE, IEEE, San Diego, CA, USA, 128–138.",
      "doi": "10.1109/ASE.2019.00022"
    },
    {
      "text": "Navid Salehnamadi, Abdulaziz Alshayban, Jun-Wei Lin, Iftekhar Ahmed, Stacy Branham, and Sam Malek. 2021. Latte: Use-case and assistive-service driven automated accessibility testing framework for android. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM New York, NY, USA, Virtual, Okohama, Japan, 1–11.",
      "doi": "10.1145/3411764.3445455"
    },
    {
      "text": "Navid Salehnamadi, Ziyao He, and Sam Malek. 2022. A11yPuppetry companion website. Retrieved Jan 31, 2023 from https://github.com/seal-hub/A11yPuppetry",
      "doi": ""
    },
    {
      "text": "Navid Salehnamadi, Forough Mehralian, and Sam Malek. 2022. GroundHog: An Automated Accessibility Crawler for Mobile Apps. In 2022 37th IEEE/ACM International Conference on Automated Software Engineering. IEEE, ACM New York, NY, USA, Rochester, Michigan, USA, 13 pages.",
      "doi": ""
    },
    {
      "text": "Camila Silva, Marcelo Medeiros Eler, and Gordon Fraser. 2018. A survey on the tool support for the automatic evaluation of mobile accessibility. In Proceedings of the 8th International Conference on Software Development and Technologies for Enhancing Accessibility and Fighting Info-exclusion. DSAI, Thessaloniki, Greece, 286–293.",
      "doi": "10.1145/3218585.3218673"
    },
    {
      "text": "StatCounter. 2022. Desktop vs Mobile vs Tablet vs Console Market Share Worldwide. StatCounter. Retrieved September 15, 2022 from https://gs.statcounter.com/platform-market-share",
      "doi": ""
    },
    {
      "text": "Hironobu Takagi, Chieko Asakawa, Kentarou Fukuda, and Junji Maeda. 2003. Accessibility designer: visualizing usability for the blind. ACM SIGACCESS accessibility and computing77-78 (2003), 177–184.",
      "doi": "10.1145/1028630.1028662"
    },
    {
      "text": "David Thompson and Birgit Wassmuth. 2001. Accessibility of online advertising: a content analysis of alternative text for banner ad images in online newspapers. Disability Studies Quarterly 21, 2 (2001), 26 pages.",
      "doi": ""
    },
    {
      "text": "W3. 2022. Web Content Accessibility Guidelines (WCAG) Overview. World Wide Web Consortium. Retrieved May 6, 2022 from https://www.w3.org/WAI/standards-guidelines/wcag/",
      "doi": ""
    },
    {
      "text": "WHO. 2011. World report on disability. World Health Organization. Retrieved May 6, 2022 from https://www.who.int/disabilities/world_report/2011/report/en/",
      "doi": ""
    }
  ]
}