{
  "doi": "10.1145/3544548.3581295",
  "title": "TexonMask: Facial Expression Recognition Using Textile Electrodes on Commodity Facemasks",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "This paper presents TexonMask, a facial expression recognition system using lightweight electrode-augmented commodity facemasks. With a matrix of textile electrodes carefully deployed on a commodity mask, our edge computing system recognizes the wearer’s facial expressions with machine learning based on the capacitive sensor readings, provides a wearable affective display and communicates with external devices using low bandwidth. Results from user studies show that the system is effective and efficient at recognizing five or ten facial expressions with an accuracy of around , using a personalized classifier trained with only six data points per expression. The system’s performance is stable across the use sessions and further improves when more data points are collected. We further developed two LiveEmoji applications for facilitating online and face-to-face communication of facemask wearers, demonstrated them in user interviews, and obtained positive participant feedback. Based on the results and findings of the study, we discuss implications and future research directions for facilitating emotional communication between facemask wearers and others.",
  "tags": [
    "facemasks",
    "edge computing",
    "wearable",
    "capacitive sensing",
    "facial expression recognition",
    "embedded interaction",
    "textile electrodes"
  ],
  "authors": [
    {
      "name": "Zengrong Guo",
      "institution": "Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659676724",
      "orcid": "0000-0001-7842-5779"
    },
    {
      "name": "Rong-Hao Liang",
      "institution": "Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321494894",
      "orcid": "0000-0003-3239-8749"
    }
  ],
  "references": [
    {
      "text": "Roland Aigner, Andreas Pointner, Thomas Preindl, Rainer Danner, and Michael Haller. 2021. TexYZ: Embroidering Enameled Wires for Three Degree-of-Freedom Mutual Capacitive Sensing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 499, 12 pages. https://doi.org/10.1145/3411764.3445479",
      "doi": "10.1145/3411764.3445479"
    },
    {
      "text": "Ozgur Atalay. 2018. Textile-based, interdigital, capacitive, soft-strain sensor for wearable applications. Materials 11, 5 (2018), 768. https://doi.org/10.3390/ma11050768",
      "doi": ""
    },
    {
      "text": "James R Averill. 1999. Individual differences in emotional creativity: Structure and correlates. Journal of personality 67, 2 (1999), 331–371.",
      "doi": ""
    },
    {
      "text": "S Baron-Cohen, T Jolliffe, C Mortimore, and M Robertson. 1997. Another advanced test of theory of mind: Evidence from very high functioning adults with autism or Asperger Syndrome. Child Psychology & Psychiatry & Allied Disciplines, 38 (7), 813–822.",
      "doi": ""
    },
    {
      "text": "John N Bassili. 1979. Emotion recognition: the role of facial movement and the relative importance of upper and lower areas of the face.Journal of personality and social psychology 37, 11(1979), 2049.",
      "doi": ""
    },
    {
      "text": "Dario Bombari, Petra C Schmid, Marianne Schmid Mast, Sandra Birri, Fred W Mast, and Janek S Lobmaier. 2013. Emotion recognition: The role of featural and configural face information. Quarterly Journal of Experimental Psychology 66, 12(2013), 2426–2442.",
      "doi": ""
    },
    {
      "text": "Leah Buechley and Michael Eisenberg. 2009. Fabric PCBs, Electronic Sequins, and Socket Buttons: Techniques for e-Textile Craft. Personal Ubiquitous Comput. 13, 2 (feb 2009), 133–150. https://doi.org/10.1007/s00779-007-0181-0",
      "doi": "10.1007/s00779-007-0181-0"
    },
    {
      "text": "Claus-Christian Carbon. 2020. Wearing face masks strongly confuses counterparts in reading emotions. Frontiers in psychology 11 (2020), 566886.",
      "doi": ""
    },
    {
      "text": "Chih-Chung Chang and Chih-Jen Lin. 2011. LIBSVM: A Library for Support Vector Machines. ACM Trans. Intell. Syst. Technol. 2, 3, Article 27 (may 2011), 27 pages. https://doi.org/10.1145/1961189.1961199",
      "doi": "10.1145/1961189.1961199"
    },
    {
      "text": "Tuochao Chen, Yaxuan Li, Songyun Tao, Hyunchul Lim, Mose Sakashita, Ruidong Zhang, Francois Guimbretiere, and Cheng Zhang. 2021. NeckFace: Continuously Tracking Full Facial Expressions on Neck-Mounted Wearables. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 2, Article 58 (jun 2021), 31 pages. https://doi.org/10.1145/3463511",
      "doi": "10.1145/3463511"
    },
    {
      "text": "Tuochao Chen, Benjamin Steeper, Kinan Alsheikh, Songyun Tao, François Guimbretière, and Cheng Zhang. 2020. C-Face: Continuously Reconstructing Facial Expressions by Deep Learning Contours of the Face with Ear-Mounted Miniature Cameras. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 112–125. https://doi.org/10.1145/3379337.3415879",
      "doi": "10.1145/3379337.3415879"
    },
    {
      "text": "Dong Yoon Choi and Byung Cheol Song. 2020. Facial Micro-Expression Recognition Using Two-Dimensional Landmark Feature Maps. IEEE Access 8(2020), 121549–121563. https://doi.org/10.1109/ACCESS.2020.3006958",
      "doi": ""
    },
    {
      "text": "Jadisha Yarif Ramìrez Cornejo and Helio Pedrini. 2018. Emotion recognition from occluded facial expressions using weber local descriptor. In 2018 25Th international conference on systems, signals and image processing (IWSSIP). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Alexander Curtiss, Blaine Rothrock, Abu Bakar, Nivedita Arora, Jason Huang, Zachary Englhardt, Aaron-Patrick Empedrado, Chixiang Wang, Saad Ahmed, Yang Zhang, Nabil Alshurafa, and Josiah Hester. 2022. FaceBit: Smart Face Masks Platform. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 4, Article 151 (dec 2022), 44 pages. https://doi.org/10.1145/3494991",
      "doi": "10.1145/3494991"
    },
    {
      "text": "Paul Dietz and Darren Leigh. 2001. DiamondTouch: a multi-user touch technology. In Proceedings of the 14th annual ACM symposium on User interface software and technology. 219–226. https://doi.org/10.1145/502348.502389",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Paul Ekman. 1972. Expressions of Emotion. In Nebraska Symposium on Motivation, Vol. 19. University of Nebraska Press, 207.",
      "doi": ""
    },
    {
      "text": "Agneta H Fischer, Marleen Gillebaart, Mark Rotteveel, Daniela Becker, and Michael Vliek. 2012. Veiled emotions: the effect of covered faces on emotion perception and attitudes. Social Psychological and Personality Science 3, 3 (2012), 266–273.",
      "doi": ""
    },
    {
      "text": "Çağlar Genç, Ashley Colley, Markus Löchtefeld, and Jonna Häkkilä. 2020. Face mask design to mitigate facial expression occlusion. In Proceedings of the 2020 International Symposium on Wearable Computers. 40–44. https://doi.org/10.1145/3410531.3414303",
      "doi": "10.1145/3410531.3414303"
    },
    {
      "text": "Anna Gruebler and Kenji Suzuki. 2010. Measurement of distal EMG signals using a wearable device for reading facial expressions. In 2010 Annual International Conference of the IEEE Engineering in Medicine and Biology. 4594–4597. https://doi.org/10.1109/IEMBS.2010.5626504",
      "doi": ""
    },
    {
      "text": "Jason Hong. 2013. Considering Privacy Issues in the Context of Google Glass. Commun. ACM 56, 11 (nov 2013), 10–11. https://doi.org/10.1145/2524713.2524717",
      "doi": "10.1145/2524713.2524717"
    },
    {
      "text": "Andrew G Howard, Menglong Zhu, Bo Chen, Dmitry Kalenichenko, Weijun Wang, Tobias Weyand, Marco Andreetto, and Hartwig Adam. 2017. Mobilenets: Efficient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861(2017).",
      "doi": ""
    },
    {
      "text": "Jeremy Howard, Austin Huang, Zhiyuan Li, Zeynep Tufekci, Vladimir Zdimal, Helene-Mari van der Westhuizen, Arne von Delft, Amy Price, Lex Fridman, Lei-Han Tang, 2021. An evidence review of face masks against COVID-19. Proceedings of the National Academy of Sciences 118, 4 (2021), e2014564118.",
      "doi": ""
    },
    {
      "text": "Yasha Iravantchi, Yang Zhang, Evi Bernitsas, Mayank Goel, and Chris Harrison. 2019. Interferi: Gesture Sensing Using On-Body Acoustic Interferometry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300506",
      "doi": "10.1145/3290605.3300506"
    },
    {
      "text": "Christian J Kähler and Rainer Hain. 2020. Fundamental protective mechanisms of face masks against droplet infections. Journal of aerosol science 148 (2020), 105617.",
      "doi": ""
    },
    {
      "text": "Takeo Kanade, Jeffrey F Cohn, and Yingli Tian. 2000. Comprehensive database for facial expression analysis. In Proceedings Fourth IEEE International Conference on Automatic Face and Gesture Recognition (Cat. No. PR00580). IEEE, 46–53. https://doi.org/10.1109/AFGR.2000.840611",
      "doi": ""
    },
    {
      "text": "Dae-Hyeong Kim, Nanshu Lu, Rui Ma, Yun-Soung Kim, Rak-Hwan Kim, Shuodao Wang, Jian Wu, Sang Min Won, Hu Tao, Ahmad Islam, 2011. Epidermal electronics. science 333, 6044 (2011), 838–843.",
      "doi": ""
    },
    {
      "text": "Marion Koelle, Swamy Ananthanarayan, and Susanne Boll. 2020. Social Acceptability in HCI: A Survey of Methods, Measures, and Design Strategies. Association for Computing Machinery, New York, NY, USA, 1–19. https://doi.org/10.1145/3313831.3376162",
      "doi": "10.1145/3313831.3376162"
    },
    {
      "text": "Matthias Kranz, Paul Holleis, and Albrecht Schmidt. 2010. Embedded Interaction: Interacting with the Internet of Things. IEEE Internet Computing 14, 2 (mar 2010), 46–53. https://doi.org/10.1109/MIC.2009.141",
      "doi": "10.1109/MIC.2009.141"
    },
    {
      "text": "Mariska E Kret and Beatrice De Gelder. 2012. A review on sex differences in processing emotional signals. Neuropsychologia 50, 7 (2012), 1211–1221.",
      "doi": ""
    },
    {
      "text": "Ryoga Kumazaki and Akifumi Inoue. 2019. Development and Evaluation of a Mask-type Display Transforming the Wearer’s Impression. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction. 568–571. https://doi.org/10.1145/3369457.3369533",
      "doi": "10.1145/3369457.3369533"
    },
    {
      "text": "Takahiro Kusabuka and Takuya Indo. 2020. IBUKI: Gesture Input Method Based on Breathing. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology. 102–104. https://doi.org/10.1145/3379350.3416134",
      "doi": "10.1145/3379350.3416134"
    },
    {
      "text": "Yann LeCun, Yoshua Bengio, 1995. Convolutional networks for images, speech, and time series. The handbook of brain theory and neural networks 3361, 10(1995), 1995.",
      "doi": "10.5555/303568.303704"
    },
    {
      "text": "Hyein Lee, Yoonji Kim, and Andrea Bianchi. 2020. MAScreen: Augmenting Speech with Visual Cues of Lip Motions, Facial Expressions, and Text Using a Wearable Display. In SIGGRAPH Asia 2020 Emerging Technologies (Virtual Event, Republic of Korea) (SA ’20). Association for Computing Machinery, New York, NY, USA, Article 2, 2 pages. https://doi.org/10.1145/3415255.3422886",
      "doi": "10.1145/3415255.3422886"
    },
    {
      "text": "Hao Li, Laura Trutoiu, Kyle Olszewski, Lingyu Wei, Tristan Trutna, Pei-Lun Hsieh, Aaron Nicholls, and Chongyang Ma. 2015. Facial Performance Sensing Head-Mounted Display. ACM Trans. Graph. 34, 4, Article 47 (jul 2015), 9 pages. https://doi.org/10.1145/2766939",
      "doi": "10.1145/2766939"
    },
    {
      "text": "Shan Li and Weihong Deng. 2020. Deep facial expression recognition: A survey. IEEE Transactions on Affective Computing(2020).",
      "doi": ""
    },
    {
      "text": "Ji Lin, Wei-Ming Chen, John Cohn, Chuang Gan, and Song Han. 2020. MCUNet: Tiny Deep Learning on IoT Devices. In Annual Conference on Neural Information Processing Systems (NeurIPS).",
      "doi": ""
    },
    {
      "text": "DU LL, Li-Min Wang, and Ziqing Zhuang. 2008. Measurement and analysis of human head-face dimensions. Chinese journal of industrial hygiene and occupational diseases 26, 5(2008), 266–270.",
      "doi": ""
    },
    {
      "text": "Yijia Lu, Han Tian, Jia Cheng, Fei Zhu, Bin Liu, Shanshan Wei, Linhong Ji, and Zhong Lin Wang. 2022. Decoding lip language using triboelectric sensors with deep learning. Nature communications 13, 1 (2022), 1–12.",
      "doi": ""
    },
    {
      "text": "Marco Marini, Alessandro Ansani, Fabio Paglieri, Fausto Caruana, and Marco Viola. 2021. The impact of facemasks on emotion recognition, trust attribution and re-identification. Scientific Reports 11, 1 (2021), 1–14.",
      "doi": ""
    },
    {
      "text": "Denys J. C. Matthies, Bernhard A. Strecker, and Bodo Urban. 2017. ",
      "doi": "10.1145/3025453.3025692"
    },
    {
      "text": "Hye Yeon Nam, Iyleah Hernandez, and Brendan Harmon. 2020. Unmasked. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology. 111–113. https://doi.org/10.1145/3379350.3416137",
      "doi": "10.1145/3379350.3416137"
    },
    {
      "text": "Duy Duong Nguyen, Patricia McCabe, Donna Thomas, Alison Purcell, Maree Doble, Daniel Novakovic, Antonia Chacon, and Catherine Madill. 2021. Acoustic voice characteristics with and without wearing a facemask. Scientific reports 11, 1 (2021), 1–11.",
      "doi": ""
    },
    {
      "text": "Aditya Shekhar Nittala, Arshad Khan, Klaus Kruttwig, Tobias Kraus, and Jürgen Steimle. 2020. PhysioSkin: Rapid Fabrication of Skin-Conformal Physiological Interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376366",
      "doi": "10.1145/3313831.3376366"
    },
    {
      "text": "World Health Organization 2020. Mask use in the context of COVID-19: interim guidance, 1 December 2020. Technical Report. World Health Organization.",
      "doi": ""
    },
    {
      "text": "Farid Pazhoohi, Leilani Forby, and Alan Kingstone. 2021. Facial masks affect emotion recognition in the general population and individuals with autistic traits. Plos One 16, 9 (2021), e0257740.",
      "doi": ""
    },
    {
      "text": "Eli N Perencevich, Daniel J Diekema, and Michael B Edmond. 2020. Moving personal protective equipment into the community: face shields and containment of COVID-19. Jama 323, 22 (2020), 2252–2253.",
      "doi": ""
    },
    {
      "text": "Brenda T Poon and Lorienne M Jenstad. 2022. Communication with face masks during the COVID-19 pandemic for adults with hearing loss. Cognitive Research: Principles and Implications 7, 1(2022), 1–18.",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4216–4227. https://doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Narjes Pourjafarian, Anusha Withana, Joseph A Paradiso, and Jürgen Steimle. 2019. Multi-Touch Kit: A do-it-yourself technique for capacitive multi-touch sensing using a commodity microcontroller. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 1071–1083. https://doi.org/10.1145/3332165.3347895",
      "doi": "10.1145/3332165.3347895"
    },
    {
      "text": "Vijayachandra Ramachandra and Hannah Longacre. 2022. Unmasking the psychology of recognizing emotions of people wearing masks: The role of empathizing, systemizing, and autistic traits. Personality and Individual Differences 185 (2022), 111249.",
      "doi": ""
    },
    {
      "text": "Rajeev Ranjan, Vishal M Patel, and Rama Chellappa. 2017. Hyperface: A deep multi-task learning framework for face detection, landmark localization, pose estimation, and gender recognition. IEEE transactions on pattern analysis and machine intelligence 41, 1(2017), 121–135.",
      "doi": ""
    },
    {
      "text": "Ville Rantanen, Pekka-Henrik Niemenlehto, Jarmo Verho, and Jukka Lekkala. 2010. Capacitive facial movement detection for human–computer interaction to click by frowning and lifting eyebrows. Medical & biological engineering & computing 48, 1 (2010), 39–47.",
      "doi": ""
    },
    {
      "text": "Ville Rantanen, Hanna Venesvirta, Oleg Spakov, Jarmo Verho, Akos Vetek, Veikko Surakka, and Jukka Lekkala. 2013. Capacitive measurement of facial activity intensity. IEEE Sensors journal 13, 11 (2013), 4329–4338. https://doi.org/10.1109/JSEN.2013.2269864",
      "doi": ""
    },
    {
      "text": "Soha Rostaminia, Alexander Lamson, Subhransu Maji, Tauhidur Rahman, and Deepak Ganesan. 2019. W!NCE: Unobtrusive Sensing of Upper Facial Action Units with EOG-Based Eyewear. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 1, Article 23 (mar 2019), 26 pages. https://doi.org/10.1145/3314410",
      "doi": "10.1145/3314410"
    },
    {
      "text": "Sigrid Rotzler, Christine Kallmayer, Christian Dils, Malte von Krshiwoblozki, Ulrich Bauer, and Martin Schneider-Ramelow. 2020. Improving the washability of smart textiles: Influence of different washing conditions on textile integrated conductor tracks. The Journal of The Textile Institute 111, 12 (2020), 1766–1777.",
      "doi": ""
    },
    {
      "text": "Mahadev Satyanarayanan. 2017. The Emergence of Edge Computing. Computer 50, 1 (2017), 30–39. https://doi.org/10.1109/MC.2017.9",
      "doi": "10.1109/MC.2017.9"
    },
    {
      "text": "Jocelyn Scheirer, Raul Fernandez, and Rosalind W. Picard. 1999. Expression Glasses: A Wearable Device for Facial Expression Recognition. In CHI ’99 Extended Abstracts on Human Factors in Computing Systems (Pittsburgh, Pennsylvania) (CHI EA ’99). Association for Computing Machinery, New York, NY, USA, 262–263. https://doi.org/10.1145/632716.632878",
      "doi": "10.1145/632716.632878"
    },
    {
      "text": "Martin Schrepp, Andreas Hinderks, and Jörg Thomaschewski. 2017. Design and evaluation of a short version of the user experience questionnaire (UEQ-S). International Journal of Interactive Multimedia and Artificial Intelligence, 4 (6), 103-108.(2017).",
      "doi": ""
    },
    {
      "text": "Muhammad Hameed Siddiqi, Rahman Ali, Abdul Sattar, Adil Mehmood Khan, and Sungyoung Lee. 2014. Depth camera-based facial expression recognition system using multilayer scheme. IETE Technical Review 31, 4 (2014), 277–286.",
      "doi": ""
    },
    {
      "text": "Peter Strevens. 1960. Spectra of fricative noise in human speech. Language and speech 3, 1 (1960), 32–49.",
      "doi": ""
    },
    {
      "text": "Ruojia Sun, Ryosuke Onose, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. Association for Computing Machinery, New York, NY, USA, 365–377. https://doi.org/10.1145/3357236.3395548",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Yutaro Suzuki, Kodai Sekimori, Yuki Yamato, Yusuke Yamasaki, Buntarou Shizuki, and Shin Takahashi. 2020. A Mouth Gesture Interface Featuring a Mutual-Capacitance Sensor Embedded in a Surgical Mask. In International Conference on Human-Computer Interaction. Springer, 154–165. https://doi.org/10.1007/978-3-030-49062-1_10",
      "doi": "10.1007/978-3-030-49062-1_10"
    },
    {
      "text": "Marc Teyssier, Gilles Bailly, Catherine Pelachaud, Eric Lecolinet, Andrew Conn, and Anne Roudaut. 2019. Skin-On Interfaces: A Bio-Driven Approach for Artificial Skin Design to Cover Interactive Devices(UIST ’19). Association for Computing Machinery, New York, NY, USA, 307–322. https://doi.org/10.1145/3332165.3347943",
      "doi": "10.1145/3332165.3347943"
    },
    {
      "text": "Asad Ullah, Jing Wang, M Shahid Anwar, Arshad Ahmad, Shah Nazir, Habib Ullah Khan, and Zesong Fei. 2021. Fusion of machine learning and privacy preserving for secure facial expression recognition. Security and Communication Networks 2021 (2021).",
      "doi": ""
    },
    {
      "text": "Akino Umezawa, Yoshinari Takegawa, and Keiji Hirtata. 2017. e2-mask: Design and implementation of a mask-type display to support face-to-face communication. In International Conference on Entertainment Computing. Springer, 88–93. https://doi.org/10.1007/978-3-319-66715-7_10",
      "doi": "10.1007/978-3-319-66715-7_10"
    },
    {
      "text": "Dhruv Verma, Sejal Bhalla, Dhruv Sahnan, Jainendra Shukla, and Aman Parnami. 2021. ExpressEar: Sensing Fine-Grained Facial Expressions with Earables. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 3, Article 129 (sep 2021), 28 pages. https://doi.org/10.1145/3478085",
      "doi": "10.1145/3478085"
    },
    {
      "text": "Ignazio Maria Viola, Brian Peterson, Gabriele Pisetta, Geethanjali Pavar, Hibbah Akhtar, Filippo Menoloascina, Enzo Mangano, Katherine E Dunn, Roman Gabl, Alex Nila, 2021. Face coverings, aerosol dispersion and mitigation of virus transmission risk. IEEE Open Journal of Engineering in Medicine and Biology 2 (2021), 26–35.",
      "doi": ""
    },
    {
      "text": "Tony Wu, Shiho Fukuhara, Nicholas Gillian, Kishore Sundara-Rajan, and Ivan Poupyrev. 2020. ZebraSense: A Double-Sided Textile Touch Sensor for Smart Clothing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 662–674. https://doi.org/10.1145/3379337.3415886",
      "doi": "10.1145/3379337.3415886"
    },
    {
      "text": "Georgios V Zacharopoulos, Andreas Manios, Chung H Kau, George Velagrakis, George N Tzanakakis, and Eelco de Bree. 2016. Anthropometric analysis of the face. Journal of Craniofacial Surgery 27, 1 (2016), e71–e75.",
      "doi": ""
    },
    {
      "text": "Qingkai Zhen, Di Huang, Yunhong Wang, and Liming Chen. 2016. Muscular movement model-based automatic 3D/4D facial expression recognition. IEEE Transactions on Multimedia 18, 7 (2016), 1438–1450. https://doi.org/10.1109/TMM.2016.2557063",
      "doi": "10.1109/TMM.2016.2557063"
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye Text, Hello Emoji: Mobile Communication on WeChat in China. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 748–759. https://doi.org/10.1145/3025453.3025800",
      "doi": "10.1145/3025453.3025800"
    }
  ]
}