{
  "doi": "10.1145/3544548.3581056",
  "title": "Resemblance of religion and pervasive games: A study among church employees and gamers",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Previous research suggests that the experience and practices related to gaming and extended realities, and religion and spiritualism, share similarities. In this study, we explore how both the employees of the Evangelical Lutheran Church (n=156) and pervasive game players (n=98) perceive and make sense of these connections. We approach the qualitative data from the perspective of Durkheim, who, similarly to how game theorists view games, views religion as a multi-faceted system that incorporates the rules, practices and communities that comprise the religion. From the data emerges the following prominent connection as perceived by both groups of informants: systems of (1) shared premise, (2) resilience and restoration, (3) symbolism, (4) extended reality and (5) day-to-day structuring. A numerical view of the data shows that 42,5% of the participants did not perceive similarities, and examination of these responses suggested that while religion and pervasive games share functional similarities, they are further apart from a substantive perspective.",
  "authors": [
    {
      "name": "Samuli Laato",
      "institution": "Gamification Group, Faculty of Information Technology and Communication Sciences, Tampere University, Finland and Department of Computing, University of Turku, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659464536",
      "orcid": "0000-0003-4285-0073"
    },
    {
      "name": "Sampsa Rauti",
      "institution": "University of Turku, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549161356",
      "orcid": "0000-0002-1891-2353"
    },
    {
      "name": "Juho Hamari",
      "institution": "Gamification Group, Faculty of Information Technology and Communication Sciences, Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548585656",
      "orcid": "0000-0002-6573-588X"
    }
  ],
  "references": [
    {
      "text": "Catherine L Albanese. 2012. America: Religions and religion. Cengage Learning, 20 Channel Center Street, Boston MA, USA.",
      "doi": ""
    },
    {
      "text": "Zoe Alderton. 2014. ‘Snapewives’ and ‘Snapeism’: A Fiction-Based Religion within the Harry Potter Fandom. Religions 5, 1 (2014), 219–267. https://doi.org/10.3390/rel5010219",
      "doi": ""
    },
    {
      "text": "Dmitry Alexandrovsky, Georg Volkmar, Maximilian Spliethöver, Stefan Finke, Marc Herrlich, Tanja Döring, Jan David Smeddinck, and Rainer Malaka. 2020. Playful User-Generated Treatment: A Novel Game Design Approach for VR Exposure Therapy. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, Virtual [ONLINE], 32–45. https://doi.org/10.1145/3410404.3414222",
      "doi": "10.1145/3410404.3414222"
    },
    {
      "text": "Manuel Baer, Thomas Tregel, Samuli Laato, and Heinrich Söbke. 2022. Virtually (re) constructed reality: the representation of physical space in commercial location-based games. In 25th International Academic Mindtrek conference. ACM, Tampere, Finland, 9–22.",
      "doi": "10.1145/3569219.3569339"
    },
    {
      "text": "Peter L Berger. 1974. Some second thoughts on substantive versus functional definitions of religion. Journal for the scientific study of religion 13, 2 (1974), 125–133.",
      "doi": ""
    },
    {
      "text": "Arpita Bhattacharya, Travis W Windleharth, Rio Anthony Ishii, Ivy M Acevedo, Cecilia R Aragon, Julie A Kientz, Jason C Yip, and Jin Ha Lee. 2019. Group interactions in location-based gaming: A case study of raiding in pokémon go. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, UK, 1–12. https://doi.org/10.1145/3290605.3300817",
      "doi": "10.1145/3290605.3300817"
    },
    {
      "text": "Frank G Bosman. 2014. ‘The Lamb of Comstock’. Dystopia and Religion in Video Games. Online-Heidelberg Journal of Religions on the Internet 5 (2014), 162–183.",
      "doi": ""
    },
    {
      "text": "Glenn A Bowen. 2006. Grounded theory and sensitizing concepts. International journal of qualitative methods 5, 3 (2006), 12–23.",
      "doi": ""
    },
    {
      "text": "Nicholas David Bowman, Diana Rieger, and Jih-Hsuan Tammy Lin. 2022. Social video gaming and well-being. Current Opinion in Psychology 45 (2022), 101316.",
      "doi": ""
    },
    {
      "text": "Elizabeth Buie. 2019. Let Us Say What We Mean: Towards Operational Definitions for Techno-Spirituality Research. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, UK, 1–10.",
      "doi": "10.1145/3290607.3310426"
    },
    {
      "text": "Elizabeth Buie and Mark Blythe. 2013. Spirituality: there’s an app for that!(but not a lot of research). In CHI’13 extended abstracts on human factors in computing systems. ACM, Paris, France, 2315–2324.",
      "doi": ""
    },
    {
      "text": "Roger Caillois. 1961. Man, play, and games. University of Illinois press, Chicago, USA.",
      "doi": ""
    },
    {
      "text": "Heidi Campbell and Ruth (eds) Trusia. 2013. Digital religion. Routledge, 605 Third Avenue, New York, NY 10158, USA.",
      "doi": ""
    },
    {
      "text": "Heidi A Campbell, Rachel Wagner, Shanny Luft, Rabia Gregory, Gregory Price Grieve, and Xenia Zeiler. 2016. Gaming Religionworlds: Why Religious Studies Should Pay Attention to Religion in Gaming. Journal of the American Academy of Religion 84, 3 (2016), 641–664.",
      "doi": ""
    },
    {
      "text": "Heidi Campbell (editor), Gregory Grieve (editor), Oliver Steffen, Peter F Likarish, Brenda S Gardemour Walter, Nathan Abrams, Xenia Zeiler, Jason Anthony, Vit Sisler, Michael Waltemathe, Kevin Schut, Shanny Luft, 2014. Playing with religion in digital games. Indiana University Press, Bloomington, Indiana, USA.",
      "doi": ""
    },
    {
      "text": "Adam Chapman. 2013. Is Sid Meier’s Civilization History?Rethinking history 17, 3 (2013), 312–332. https://doi.org/10.1080/13642529.2013.774719",
      "doi": ""
    },
    {
      "text": "Ashley Colley, Jacob Thebault-Spieker, Allen Yilun Lin, Donald Degraen, Benjamin Fischman, Jonna Häkkilä, Kate Kuehl, Valentina Nisi, Nuno Jardim Nunes, Nina Wenig, 2017. The geography of Pokémon GO: beneficial and problematic effects on places and movement. In Proceedings of the 2017 CHI conference on human factors in computing systems. ACM, Colorado, USA, 1179–1192.",
      "doi": "10.1145/3025453.3025495"
    },
    {
      "text": "Anthony-Paul Cooper, Samuli Laato, Suvi Nenonen, Nicolas Pope, David Tjiharuka, and Erkki Sutinen. 2021. The reconfiguration of social, digital and physical presence: From online church to church online. HTS Teologiese Studies/Theological Studies 77, 3 (2021), 1–9.",
      "doi": ""
    },
    {
      "text": "Rowan Daneels, Nicholas D Bowman, Daniel Possler, and Elisa D Mekler. 2021. The ‘eudaimonic experience’: A scoping review of the concept in digital games research. Media and Communication 9, 2 (2021), 178–190.",
      "doi": ""
    },
    {
      "text": "Rowan Daneels, Heidi Vandebosch, and Michel Walrave. 2020. “Just for fun?”: An exploration of digital games’ potential for eudaimonic media experiences among Flemish adolescents. Journal of Children and Media 14, 3 (2020), 1–17. https://doi.org/10.1080/17482798.2020.1727934",
      "doi": ""
    },
    {
      "text": "Adriana de Souza e Silva, Ragan Glover-Rijkse, Anne Njathi, and Daniela de Cunto Bueno. 2021. Playful mobilities in the Global South: A study of Pokémon Go play in Rio de Janeiro and Nairobi. New Media & Society online first, online first(2021), 14614448211016400.",
      "doi": ""
    },
    {
      "text": "Lars De Wildt and Stef Aupers. 2017. Bibles and BioShock: Affording Religious Discussion on Video Game Forums. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. ACM, Amsterdam, Netherlands, 463–475.",
      "doi": "10.1145/3116595.3116625"
    },
    {
      "text": "Lars De Wildt and Stef Aupers. 2019. Playing the Other: Role-playing religion in videogames. European Journal of Cultural Studies 22, 5-6 (2019), 867–884. https://doi.org/10.1177/1367549418790454",
      "doi": ""
    },
    {
      "text": "Lars De Wildt and Stef Aupers. 2020. Pop theology: forum discussions on religion in videogames. Information, Communication & Society 23, 10 (2020), 1444–1462. https://doi.org/10.1080/1369118X.2019.1577476",
      "doi": ""
    },
    {
      "text": "Lars De Wildt and Stef Aupers. 2021. Marketable Religion: How Game Company Ubisoft Commodified Religion for a Global Audience. Journal Of Consumer Culture online first, online first(2021), 1–1.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Miguel Sicart, Lennart Nacke, Kenton O’Hara, and Dan Dixon. 2011. Gamification. using game-design elements in non-gaming contexts. In CHI’11 extended abstracts on human factors in computing systems. ACM, Vancouver, Canada, 2425–2428.",
      "doi": ""
    },
    {
      "text": "John Dunham, Konstantinos Papangelis, Samuli Laato, Nicolas LaLone, Jin Ha Lee, and Michael Saker. 2022. The Impacts of Covid-19 on Players of Pokémon GO. ACM Transactions on Computer-Human Interaction online first, online first(2022), 1–20.",
      "doi": ""
    },
    {
      "text": "Emile Durkheim. 1897. Le suicide: étude de sociologie. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Emile Durkheim. 1995. The elementary forms of religious life, translated by Karen E. Fields. New York: Free, New York, USA.",
      "doi": ""
    },
    {
      "text": "Charles A Ellwood. 1913. The social function of religion. Amer. J. Sociology 19, 3 (1913), 289–307.",
      "doi": ""
    },
    {
      "text": "Suomen ev. lut. kirkko. 2020. Kirkko on Suuri Työnantaja. Retrieved November 22, 2020 from https://evl.fi/tietoa-kirkosta/tilastotietoa/henkilosto#6b0cc772",
      "doi": ""
    },
    {
      "text": "Laura Feldt. 2016. Harry Potter and contemporary magic: Fantasy literature, popular culture, and the representation of religion. Journal of Contemporary Religion 31, 1 (2016), 101–114. https://doi.org/10.1080/13537903.2016.1109877",
      "doi": ""
    },
    {
      "text": "Bruce B (ed.) Frey. 2018. The SAGE encyclopedia of educational research, measurement, and evaluation. Sage Publications, Los Angeles, USA. https://doi.org/10.4135/9781506326139.n369",
      "doi": ""
    },
    {
      "text": "Sonja Gabriel. 2017. Pokémon Go-How Religious Can an Augmented Reality Hunt Be?Online-Heidelberg Journal of Religions on the Internet 12 (2017), 1–12. https://doi.org/10.17885/heiup.rel.2017.0.23766",
      "doi": ""
    },
    {
      "text": "Juho Hamari. 2019. Gamification., 3 pages.",
      "doi": ""
    },
    {
      "text": "Juho Hamari, Aqdas Malik, Johannes Koski, and Aditya Johri. 2018. Uses and gratifications of pokémon go: why do people play mobile location-based augmented reality games?International Journal of Human–Computer Interaction 35, 9(2018), 804–819.",
      "doi": ""
    },
    {
      "text": "Juho Hamari and Max Sjöblom. 2017. What is eSports and why do people watch it?Internet research 27, 2 (2017), 211–232. https://doi.org/10.1108/IntR-04-2016-0085",
      "doi": ""
    },
    {
      "text": "Yuval Noah Harari. 2014. Sapiens: A brief history of humankind. Random House, New York, USA.",
      "doi": ""
    },
    {
      "text": "Paul L Harris and Melissa A Koenig. 2006. Trust in testimony: How children learn about science and religion. Child development 77, 3 (2006), 505–524.",
      "doi": ""
    },
    {
      "text": "Stewart M Hoover, Knut Lundby, 1997. Rethinking media, religion, and culture. Vol. 23. Sage, Los Angeles, USA.",
      "doi": ""
    },
    {
      "text": "Johan Huizinga. 2014. Homo ludens: A study of the play-element in culture. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Harry T Hunt. 2012. A collective unconscious reconsidered: Jung’s archetypal imagination in the light of contemporary psychology and social science. Journal of Analytical Psychology 57, 1 (2012), 76–98. https://doi.org/10.1111/j.1468-5922.2011.01952.x",
      "doi": ""
    },
    {
      "text": "Lucas J Jensen, Keri D Valentine, and Joshua P Case. 2019. Accessing the pokélayer: Augmented reality and fantastical play in Pokémon Go. In Educational Media and Technology Yearbook. Springer, Berlin, Germany, 87–103. https://doi.org/10.1007/978-3-030-27986-8_9",
      "doi": ""
    },
    {
      "text": "Levente Juhász and Hartwig H Hochmair. 2017. Where to catch ‘em all?–a geographic analysis of Pokémon Go locations. Geo-spatial information science 20, 3 (2017), 241–251.",
      "doi": ""
    },
    {
      "text": "Sangwon Jung, Oğuz’Oz Buruk, and Juho Hamari. 2022. Altered States of Consciousness in Human-Computer Interaction: A Review. In Nordic Human-Computer Interaction Conference. ACM, Aarhus Denmark, 1–13.",
      "doi": "10.1145/3546155.3546667"
    },
    {
      "text": "Daniel Kardefelt-Winther. 2014. The moderating role of psychosocial well-being on the relationship between escapism and excessive online gaming. Computers in Human Behavior 38 (2014), 68–74. https://doi.org/10.1016/j.chb.2014.05.020",
      "doi": "10.1016/j.chb.2014.05.020"
    },
    {
      "text": "Jooyoung Kim. 2021. Advertising in the Metaverse: Research Agenda., 4 pages.",
      "doi": ""
    },
    {
      "text": "Yoojung Kim, Arpita Bhattacharya, Julie A Kientz, and Jin Ha Lee. 2020. \" It Should Be a Game for Fun, Not Exercise\": Tensions in Designing Health-Related Features for Pokémon GO. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Hawaii, USA (REMOTE), 1–13.",
      "doi": "10.1145/3313831.3376830"
    },
    {
      "text": "Ana Carolina Tomé Klock, Isabela Gasparini, Marcelo Soares Pimenta, and Juho Hamari. 2020. Tailored gamification: A review of literature. International Journal of Human-Computer Studies 144, - (2020), 102495. https://doi.org/10.1016/j.ijhcs.2020.102495",
      "doi": ""
    },
    {
      "text": "Ana Carolina Tomé Klock, Eetu Wallius, and Juho Hamari. 2021. Gamification in freight transportation: extant corpus and future agenda. International Journal of Physical Distribution & Logistics Management 51, 7 (2021), 685–710.",
      "doi": ""
    },
    {
      "text": "Bastian Kordyaka, Samuli Laato, Marius Mueller, and Bjoern Niehaves. 2021. Architecture of Belonging–A Social Identity-based Design Theory of Community Identification in Multiplayer Video Games. In Proceedings of the 54th Hawaii International Conference on System Sciences. ScholarSpace, Maui, Hawaii, USA, 1–10.",
      "doi": ""
    },
    {
      "text": "Samuli Laato, Nobufumi Inaba, and Juho Hamari. 2021. Convergence between the real and the augmented: Experiences and perceptions in location-based games. Telematics and Informatics 65 (2021), 101716.",
      "doi": "10.1016/j.tele.2021.101716"
    },
    {
      "text": "Samuli Laato, Bastian Kordyaka, AKM Najmul Islam, Konstantinos Papangelis, and Juho Hamari. 2022. Territorial or nomadic? Geo-social determinants of location-based IT use: a study in Pokemon GO. Internet Research 32, 7 (2022), 330–353. https://doi.org/10.1108/INTR-11-2021-0863",
      "doi": ""
    },
    {
      "text": "Samuli Laato and Sampsa Rauti. 2021. Video games and religion: Lutheran Church employees’ perspectives on similarities between virtual and spiritual, In Proceedings of the 5th annual GamiFIN conference. Proceedings of the 5th annual GamiFIN conference -, -, 1–10.",
      "doi": ""
    },
    {
      "text": "Samuli Laato and Sampsa Rauti. 2022. Comparing Social Media Reactions to Early Game Songs and Final Boss Music in Single Player Adventure Games. In Proceedings of the 55th Hawaii International Conference on System Sciences. Scholarspace, Hawaii, USA, 1–10.",
      "doi": ""
    },
    {
      "text": "Samuli Laato, Sampsa Rauti, AKM Najmul Islam, and Erkki Sutinen. 2021. Why playing augmented reality games feels meaningful to players? The roles of imagination and social experience. Computers in Human Behavior 121 (2021), 106816.",
      "doi": "10.1016/j.chb.2021.106816"
    },
    {
      "text": "Samuli Laato and Erkki Sutinen. 2020. Integrating theological aspects to engineering education. In 2020 IEEE Frontiers in Education Conference (FIE). IEEE, IEEE, Uppsala, Sweden, 1–9.",
      "doi": "10.1109/FIE44824.2020.9274089"
    },
    {
      "text": "Nicola Liberati. 2018. Phenomenology, pokémon go, and other augmented reality games. Human studies 41, 2 (2018), 211–232. https://doi.org/10.1007/s10746-017-9450-8",
      "doi": ""
    },
    {
      "text": "Marley-Vincent Lindsey. 2015. The politics of Pokémon. Socialized gaming, religious themes and the construction of communal narratives. Online-Heidelberg Journal of Religions on the Internet 7 (2015), 1–12. https://doi.org/10.11588/rel.2015.0.18510",
      "doi": ""
    },
    {
      "text": "Bruno Lovric. 2020. Pokémon fandom as a religion: construction of identity and cultural consumption in Hong Kong. In Handbook of Research on the Impact of Fandom in Society and Consumerism. IGI Global, 701 E. Chocolate Ave. Hershey, PA 17033, USA, 460–479.",
      "doi": ""
    },
    {
      "text": "Amari Low, Jane Turner, and Marcus Foth. 2022. Pla (y) cemaking With Care: Locative Mobile Games as Agents of Place Cultivation. In 25th International Academic Mindtrek conference. ACM, Tampere, Finland, 135–146.",
      "doi": "10.1145/3569219.3569311"
    },
    {
      "text": "Steven Lukes. 1985. Emile Durkheim, his life and work: a historical and critical study. Stanford University Press, Stanford, California, USA.",
      "doi": ""
    },
    {
      "text": "Aaron May, Jim Bizzocchi, Alissa N Antle, and Amber Choo. 2014. Fraternal feelings: How Brothers: A Tale of Two Sons affects players through gameplay. In 2014 IEEE Games Media Entertainment. IEEE, IEEE, Toronto, Canada, 1–4.",
      "doi": ""
    },
    {
      "text": "Jacqueline Mees-Buss, Catherine Welch, and Rebecca Piekkari. 2022. From templates to heuristics: how and why to move beyond the Gioia methodology. Organizational Research Methods 25, 2 (2022), 405–429.",
      "doi": ""
    },
    {
      "text": "Alberto Mora, Daniel Riera, Carina Gonzalez, and Joan Arnedo-Moreno. 2015. A literature review of gamification design frameworks. In 2015 7th International Conference on Games and Virtual Worlds for Serious Applications (VS-Games). IEEE, IEEE, Skövde, Sweden, 1–8. https://doi.org/10.1109/VS-GAMES.2015.7295760",
      "doi": ""
    },
    {
      "text": "David Morgan. 2013. Religion and media: A critical review of recent developments. Critical research on religion 1, 3 (2013), 347–356.",
      "doi": ""
    },
    {
      "text": "Benedikt Morschheuser, Juho Hamari, Karl Werder, and Julian Abe. 2017. How to gamify? A method for designing gamification. In Proceedings of the 50th Hawaii International Conference on System Sciences 2017. University of Hawai’i at Manoa, Scholarspace, Hawaii, USA, 1298–1307. https://doi.org/10.24251/HICSS.2017.155",
      "doi": ""
    },
    {
      "text": "Khushnood Naqshbandi, Kristina Mah, and Naseem Ahmadpour. 2022. Making space for faith, religion, and spirituality in prosocial HCI. Interactions 29, 4 (2022), 62–67.",
      "doi": "10.1145/3544301"
    },
    {
      "text": "Mary Beth Oliver, Nicholas David Bowman, Julia K Woolley, Ryan Rogers, Brett I Sherrick, and Mun-Young Chung. 2016. Video games as meaningful entertainment experiences.Psychology of Popular Media Culture 5, 4 (2016), 390. https://doi.org/10.1037/ppm0000066",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver and Arthur A Raney. 2011. Entertainment as pleasurable and meaningful: Identifying hedonic and eudaimonic motivations for entertainment consumption. Journal of Communication 61, 5 (2011), 984–1004. https://doi.org/10.1111/j.1460-2466.2011.01585.x",
      "doi": ""
    },
    {
      "text": "Wallach Omri. 2020. 50 Years of Gaming History, by Revenue Stream (1970-2020). Retrieved November 25, 2020 from https://www.visualcapitalist.com/50-years-gaming-history-revenue-stream/",
      "doi": ""
    },
    {
      "text": "Konstantinos Papangelis, Alan Chamberlain, Ioanna Lykourentzou, Vassilis-Javed Khan, Michael Saker, Hai-Ning Liang, Irwyn Sadien, and Ting Cao. 2020. Performing the Digital Self: Understanding Location-Based Social Networking, Territory, Space, and Identity in the City. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 1(2020), 1–26. https://doi.org/10.1145/3364997",
      "doi": "10.1145/3364997"
    },
    {
      "text": "Konstantinos Papangelis, Melvin Metzger, Yiyang Sheng, Hai-Ning Liang, Alan Chamberlain, and Vassilis-Javed Khan. 2017. \" Get Off My Lawn!\" Starting to Understand Territoriality in Location Based Mobile Games. In Proceedings of the 2017 CHI conference extended abstracts on human factors in computing systems. ACM, Colorado, USA, 1955–1961.",
      "doi": "10.1145/3027063.3053154"
    },
    {
      "text": "PCJM Paulissen. 2018. The Dark of the Covenant: Christian Imagery, Fundamentalism, and the Relationship between Science and Religion in the Halo Video Game Series. Religions 9, 4 (2018), 126. https://doi.org/10.3390/rel9040126",
      "doi": ""
    },
    {
      "text": "I. Quershi, B. Bhatt, S. Gupta, and Tiwari A.A. 2020. Call for Papers: Causes, Symptoms and Consequences of Social Media Induced Polarization (SMIP).",
      "doi": ""
    },
    {
      "text": "Sampsa Rauti, Samuli Laato, and Tarja Pietarinen. 2020. Learning social skills and accruing social capital through pervasive gaming. In 2020 Workshop on Designing and Facilitating Educational Location-Based Applications, DELbA 2020. CEUR workshop proceedings, Heidelberg, Germany, 1–12.",
      "doi": ""
    },
    {
      "text": "Morva Saaty, Derek Haqq, Mohammadreza Beyki, Taha Hassan, and D SCOTT McCRICKARD. 2022. Pokémon GO with Social Distancing: Social Media Analysis of Players’ Experiences with Location-based Games. Proceedings of the ACM on Human-Computer Interaction 6, CHI PLAY(2022), 1–22.",
      "doi": "10.1145/3549512"
    },
    {
      "text": "Michael Sailer and Lisa Homner. 2020. The gamification of learning: A meta-analysis. Educational Psychology Review 32, 1 (2020), 77–112.",
      "doi": ""
    },
    {
      "text": "Jenny Saucerman and Dennis Ramirez. 2016. Praise Helix! Christian Narrative in Twitch Plays: Pokémon. Online-Heidelberg Journal of Religions on the Internet 10 (2016), 1–12. https://doi.org/10.17885/heiup.rel.23549",
      "doi": ""
    },
    {
      "text": "Julian Schaap and Stef Aupers. 2017. ‘Gods in World of Warcraft exist’: Religious reflexivity and the quest for meaning in online computer games. new media & society 19, 11 (2017), 1744–1760. https://doi.org/10.1177/1461444816642421",
      "doi": ""
    },
    {
      "text": "Olivier Servais. 2015. Funerals in the ‘World of Warcraft’: religion, polemic, and styles of play in a videogame universe. Social Compass 62, 3 (2015), 362–378. https://doi.org/10.1177/0037768615587840",
      "doi": ""
    },
    {
      "text": "C Estelle Smith, Avleen Kaur, Katie Z Gach, Loren Terveen, Mary Jo Kreitzer, and Susan O’Conner-Von. 2021. What is Spiritual Support and How Might It Impact the Design of Online Communities?Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–42.",
      "doi": ""
    },
    {
      "text": "Heinrich Söbke, Jannicke Baalsrud Hauge, and Ioana Andreea Stefan. 2017. Prime example ingress reframing the pervasive game design framework (PGDF). International Journal of Serious Games 4, 2 (2017), 1–12.",
      "doi": ""
    },
    {
      "text": "Richard Sosis and Bradley J Ruffle. 2004. Ideology, religion, and the evolution of cooperation: Field experiments on Israeli Kibbutzim. In Socioeconomic aspects of human behavioral ecology. Emerald Group Publishing Limited, Bingley, UK.",
      "doi": ""
    },
    {
      "text": "Anselm L Strauss. 1987. Qualitative analysis for social scientists. Cambridge university press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Erkki Sutinen and Anthony-Paul Cooper. 2021. Digital theology: A computer science perspective. Emerald Group Publishing, Bingley, UK.",
      "doi": ""
    },
    {
      "text": "the Evangelical Luterhan Church of Finland. 2022. The Church in Numbers - Official website.",
      "doi": ""
    },
    {
      "text": "Thomas Tregel, Philipp Niklas Müller, Stefan Göbel, and Ralf Steinmetz. 2021. Looking for Charizard: applying the orienteering problem to location-based games. The Visual Computer 37, 1 (2021), 31–45.",
      "doi": "10.1007/s00371-019-01737-z"
    },
    {
      "text": "Thomas Tregel, Lukas Raymann, Stefan Göbel, and Ralf Steinmetz. 2017. Geodata classification for automatic content creation in location-based games. In Joint International Conference on Serious Games. Springer, Springer, Valencia, Spain, 212–223.",
      "doi": ""
    },
    {
      "text": "J Mitchell Vaterlaus, Kala Frantz, and Tracey Robecker. 2019. “Reliving my childhood dream of being a Pokémon Trainer”: An exploratory study of college student uses and gratifications related to Pokémon Go. International Journal of Human–Computer Interaction 35, 7(2019), 596–604.",
      "doi": ""
    },
    {
      "text": "Kellie Vella, Daniel Johnson, Vanessa Wan Sze Cheng, Tracey Davenport, Jo Mitchell, Madison Klarkowski, and Cody Phillips. 2019. A sense of belonging: Pokémon GO and social connectedness. Games and Culture 14, 6 (2019), 583–603.",
      "doi": ""
    },
    {
      "text": "Annika Waern, Markus Montola, and Jaakko Stenros. 2009. The three-sixty illusion: designing for immersion in pervasive games. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, Boston, USA, 1549–1558. https://doi.org/10.1145/1518701.1518939",
      "doi": "10.1145/1518701.1518939"
    },
    {
      "text": "Rachel Wagner. 2012. Godwired: Religion, ritual and virtual reality. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Margaret Wertheim. 2017. The pearly gates of cyberspace. In Religion Today: A Reader. Routledge, London, UK, 43–46.",
      "doi": ""
    },
    {
      "text": "Jennifer R Whitson. 2013. Gaming the quantified self. Surveillance & Society 11, 1/2 (2013), 163–176.",
      "doi": ""
    },
    {
      "text": "Werner Wirth, Matthias Hofer, and Holger Schramm. 2012. Beyond pleasure: Exploring the eudaimonic entertainment experience. Human Communication Research 38, 4 (2012), 406–428. https://doi.org/10.1111/j.1468-2958.2012.01434.x",
      "doi": ""
    },
    {
      "text": "Nick Yee. 2007. Motivations for play in online games. CyberPsychology & behavior 9, 6 (2007), 772–775. https://doi.org/10.1089/cpb.2006.9.772",
      "doi": ""
    }
  ]
}