{
  "doi": "10.1145/3544548.3581391",
  "title": "Get Distracted or Missed the Stop? Investigating Public Transit Passengers’ Travel-Based Multitasking Behaviors, Motives, and Challenges",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Mobile users commonly multitask during travel, but doing so on public transit can be challenging due to the dynamic nature of the environment as well as long-standing lack of infrastructural support. Nevertheless, HCI scholars and practitioners have devoted relatively little attention to developing technology for enhancing travel multitasking. To facilitate such development, we sought to understand travel multitaskers’ practices and challenges while on public transit, and to that end, conducted a multi-methods study that involved shadowing and interviewing 30 of them. We identified four travel-multitasking patterns, characterized by distinct motives that affected these travelers’ multitasking practices, receptivity to environmental stimuli, and task persistence. The two main challenges they encountered during travel multitasking resulted from mutual interference from their tasks and from the dynamic nature of transit environments. Based on these findings, design recommendations for public-transit agencies and mobile services are also provided.",
  "authors": [
    {
      "name": "Hsinju Lee",
      "institution": "Institute of Service Science, National Tsing Hua University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528285",
      "orcid": "0000-0002-6386-8291"
    },
    {
      "name": "Fang-Hsin Hsu",
      "institution": "National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778459",
      "orcid": "0000-0002-5314-4361"
    },
    {
      "name": "Wei-Ko Li",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660570746",
      "orcid": "0000-0003-4291-7688"
    },
    {
      "name": "Jie Tsai",
      "institution": "National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660631715",
      "orcid": "0000-0002-0218-5876"
    },
    {
      "name": "Ying-Yu Chen",
      "institution": "Department of Communication and Technology, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780422",
      "orcid": "0000-0002-8461-555X"
    },
    {
      "name": "Yung-Ju Chang",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019794",
      "orcid": "0000-0001-6956-3459"
    }
  ],
  "references": [
    {
      "text": "Reem Alzahabi, Mark W Becker, and David Z Hambrick. 2017. Investigating the relationship between media multitasking and processes involved in task-switching.Journal of experimental psychology: human perception and performance 43, 11(2017), 1872.",
      "doi": ""
    },
    {
      "text": "Sally Andrews, David A Ellis, Heather Shaw, and Lukasz Piwek. 2015. Beyond self-report: Tools to compare estimated and real-world smartphone use. PloS one 10, 10 (2015), e0139004.",
      "doi": ""
    },
    {
      "text": "Carolyn Axtell, Donald Hislop, and Steve Whittaker. 2008. Mobile technologies in mobile spaces: Findings from the context of train travel. International Journal of Human-Computer Studies 66, 12 (2008), 902–915.",
      "doi": "10.1016/j.ijhcs.2008.07.001"
    },
    {
      "text": "Lynda Baker. 2006. Observation: A complex research method. Library trends 55, 1 (2006), 171–189.",
      "doi": ""
    },
    {
      "text": "Raquel Benbunan-Fich, Rachel F Adler, and Tamilla Mavlanova. 2011. Measuring multitasking behavior with activity-based metrics. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 2(2011), 1–22.",
      "doi": "10.1145/1970378.1970381"
    },
    {
      "text": "Andrea Berger, Laura Jones, Mary K Rothbart, and Michael I Posner. 2000. Computerized games to study the development of attention in childhood. Behavior Research Methods, Instruments, & Computers 32, 2 (2000), 297–303.",
      "doi": ""
    },
    {
      "text": "Rosaria M Berliner, Aliaksandr Malokin, Giovanni Circella, and Patricia L Mokhtarian. 2015. Travel-based multitasking: modeling the propensity to conduct activities while commuting. Technical Report.",
      "doi": ""
    },
    {
      "text": "Thomas Bjørner. 2016. Time use on trains: media use/non-use and complex shifts in activities. Mobilities 11, 5 (2016), 681–702.",
      "doi": ""
    },
    {
      "text": "Allen C Bluedorn, Carol Felker Kaufman, and Paul M Lane. 1992. How many things do you like to do at once? An introduction to monochronic and polychronic time. Academy of Management Perspectives 6, 4 (1992), 17–26.",
      "doi": ""
    },
    {
      "text": "Scott W Campbell. 2007. Perceptions of mobile phone use in public settings: A cross-cultural comparison. International Journal of Communication 1, 1 (2007), 20.",
      "doi": ""
    },
    {
      "text": "Hancheng Cao, Chia-Jung Lee, Shamsi Iqbal, Mary Czerwinski, Priscilla NY Wong, Sean Rintel, Brent Hecht, Jaime Teevan, and Longqi Yang. 2021. Large scale analysis of multitasking behavior during remote meetings. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445243"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. sage.",
      "doi": ""
    },
    {
      "text": "Yu-Chun Chen, Keui-Chun Kao, Yu-Jen Lee, Faye Shih, Wei-Chen Chiu, and Yung-Ju Chang. 2021. Killing-Time Detection from Smartphone Screenshots. In Adjunct Proceedings of the 2021 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2021 ACM International Symposium on Wearable Computers. 15–16.",
      "doi": "10.1145/3460418.3479295"
    },
    {
      "text": "Marvin M Chun and Nicholas B Turk-Browne. 2007. Interactions between attention and memory. Current opinion in neurobiology 17, 2 (2007), 177–184.",
      "doi": ""
    },
    {
      "text": "Myoungbeom Chung. 2022. A Disembarking Notification Application for Public Transportation Using Inaudible Frequency. Mobile Information Systems 2022 (2022).",
      "doi": ""
    },
    {
      "text": "Giovanni Circella, Patricia L Mokhtarian, and Laura K Poff. 2012. A conceptual typology of multitasking behavior and polychronicity preferences.Electronic International Journal of Time Use Research 9, 1 (2012).",
      "doi": ""
    },
    {
      "text": "M Czerwinski, E Horvitz, 2004. A diary study of task switching and interruptions.’CHI.",
      "doi": ""
    },
    {
      "text": "Gabrielle C Danna, Jason G Randall, and Bhindai K Mahabir. 2022. Commute based learning: Integrating literature across transportation, education, and io psychology. Organizational Psychology Review(2022), 20413866221132060.",
      "doi": ""
    },
    {
      "text": "Jonas De Vos. 2020. The effect of COVID-19 and subsequent social distancing on travel behavior. Transportation Research Interdisciplinary Perspectives 5 (2020), 100121.",
      "doi": ""
    },
    {
      "text": "Kerry Allison Delbridge. 2000. Individual differences in multi-tasking ability: Exploring a nomological network. Michigan State University.",
      "doi": ""
    },
    {
      "text": "Jason R Finley, Aaron S Benjamin, and Jason S McCarley. 2014. Metacognition of multitasking: How well do we predict the costs of divided attention?Journal of experimental psychology: applied 20, 2 (2014), 158.",
      "doi": ""
    },
    {
      "text": "Rico Fischer and Gesine Dreisbach. 2015. Predicting high levels of multitasking reduces between-tasks interactions.Journal of Experimental Psychology: Human Perception and Performance 41, 6(2015), 1482.",
      "doi": ""
    },
    {
      "text": "Charlotte Frei, Hani S Mahmassani, and Andreas Frei. 2015. Making time count: Traveler activity engagement on urban transit. Transportation Research Part A: Policy and Practice 76 (2015), 58–70.",
      "doi": ""
    },
    {
      "text": "Mattias Gripsrud and Randi Hjorthol. 2012. Working on the train: from ‘dead time’to productive and vital time. Transportation 39, 5 (2012), 941–956.",
      "doi": ""
    },
    {
      "text": "Zhan Guo, Alexandra Derian, and Jinhua Zhao. 2015. Smart devices and travel time use by bus passengers in Vancouver, Canada. International Journal of Sustainable Transportation 9, 5(2015), 335–347.",
      "doi": ""
    },
    {
      "text": "Juliet Jain and Glenn Lyons. 2008. The gift of travel time. Journal of transport geography 16, 2 (2008), 81–89.",
      "doi": ""
    },
    {
      "text": "W James. 1890. The principles of psychology, Vol I. Henry Holt and Co. https. doi. org/10.1037/10538-000(1890).",
      "doi": ""
    },
    {
      "text": "Tom Erik Julsrud and Jon Martin Denstadli. 2017. Smartphones, travel time-use, and attitudes to public transport services. insights from an explorative study of urban dwellers in two norwegian cities. International Journal of Sustainable Transportation 11, 8(2017), 602–610.",
      "doi": ""
    },
    {
      "text": "Susan Kenyon. 2010. What do we mean by multitasking?–Exploring the need for methodological clarification in time use research.Electronic International Journal of Time Use Research 7, 1 (2010).",
      "doi": ""
    },
    {
      "text": "Susan Kenyon and Glenn Lyons. 2007. Introducing multitasking to the study of travel and ICT: Examining its extent and assessing its potential importance. Transportation Research Part A: Policy and Practice 41, 2 (2007), 161–175.",
      "doi": ""
    },
    {
      "text": "Imre Keseru, Ewoud Heyndels, Tan Dat Ton, and Cathy Macharis. 2020. Multitasking on the go: An observation study on local public transport in Brussels. Travel Behaviour and Society 18 (2020), 106–116.",
      "doi": ""
    },
    {
      "text": "Imre Keseru and Cathy Macharis. 2018. Travel-based multitasking: review of the empirical evidence. Transport reviews 38, 2 (2018), 162–183.",
      "doi": ""
    },
    {
      "text": "Benjamin Kommey, Elvis Tamakloe, and Eric Tutu Tchao. 2021. Passenger Destination System for Commercial Vehicles. Int. J. Appl. Inf. Technol. Vol 5, 02 (2021).",
      "doi": ""
    },
    {
      "text": "Cornelius J König and Mary J Waller. 2010. Time for reflection: A critical examination of polychronicity. Human Performance 23, 2 (2010), 173–190.",
      "doi": ""
    },
    {
      "text": "Reed Larson and Mihaly Csikszentmihalyi. 2014. The experience sampling method. In Flow and the foundations of positive psychology. Springer, 21–34.",
      "doi": ""
    },
    {
      "text": "Sophie Leroy. 2009. Why is it so hard to do my work? The challenge of attention residue when switching between work tasks. Organizational Behavior and Human Decision Processes 109, 2(2009), 168–181.",
      "doi": ""
    },
    {
      "text": "Sophie Leroy, Aaron M Schmidt, and Nora Madjar. 2021. Working from home during COVID-19: A study of the interruption landscape.Journal of Applied Psychology 106, 10 (2021), 1448.",
      "doi": ""
    },
    {
      "text": "Jay D Lindquist and Carol Kaufman-Scarborough. 2007. The polychronic—Monochronic tendency model: Pmts scale development and validation. Time & Society 16, 2-3 (2007), 253–285.",
      "doi": ""
    },
    {
      "text": "Valentin Lohmüller, Philip Eiermann, Peter Zeitlhöfler, and Christian Wolff. 2019. Attention Guidance in Second Screen Applications. In Proceedings of Mensch und Computer 2019. 179–187.",
      "doi": "10.1145/3340764.3340788"
    },
    {
      "text": "Hila Lowenstein-Barkai and Azi Lev-On. 2018. Complementing or substituting? News in an era of multiple platforms and second screens. International Journal of Human–Computer Interaction 34, 10(2018), 922–931.",
      "doi": ""
    },
    {
      "text": "Glenn Lyons and Kiron Chatterjee. 2008. A human perspective on the daily commute: costs, benefits and trade-offs. Transport reviews 28, 2 (2008), 181–198.",
      "doi": ""
    },
    {
      "text": "Glenn Lyons and John Urry. 2005. Travel time use in the information age. Transportation Research Part A: Policy and Practice 39, 2-3(2005), 257–276.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2015. Focused, aroused, but so distractible: Temporal perspectives on multitasking and communications. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 903–916.",
      "doi": "10.1145/2675133.2675221"
    },
    {
      "text": "Patricia L Mokhtarian and Ilan Salomon. 2001. How derived is the demand for travel? Some conceptual and measurement considerations. Transportation research part A: Policy and practice 35, 8 (2001), 695–719.",
      "doi": ""
    },
    {
      "text": "Andrew D Newton. 2014. Crime on public transport. Springer.",
      "doi": ""
    },
    {
      "text": "Jeremy Packer and Stephen B Crofts Wiley. 2013. Communication matters: Materialist approaches to media, mobility and networks. Routledge.",
      "doi": ""
    },
    {
      "text": "Steven E Petersen and Michael I Posner. 2012. The attention system of the human brain: 20 years after. Annual review of neuroscience 35 (2012), 73.",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Tilman Dingler, Jose San Pedro, and Nuria Oliver. 2015. When attention is not scarce-detecting boredom from mobile phone usage. In Proceedings of the 2015 ACM international joint conference on pervasive and ubiquitous computing. 825–836.",
      "doi": "10.1145/2750858.2804252"
    },
    {
      "text": "Pruthvish Rajput and Manish Chaturvedi. 2019. Automatic detection of bus-stops and bus-crowdedness using crowdsourced data. In 2019 IEEE Intelligent Transportation Systems Conference (ITSC). IEEE, 740–745.",
      "doi": "10.1109/ITSC.2019.8917008"
    },
    {
      "text": "Karen Raphael. 1987. Recall bias: a proposal for assessment and control. International journal of epidemiology 16, 2 (1987), 167–170.",
      "doi": ""
    },
    {
      "text": "M Rosario Rueda, Joan P Pozuelos, and Lina M Cómbita. 2015. Cognitive neuroscience of attention from brain mechanisms to individual differences in efficiency. AIMS Neuroscience 2, 4 (2015), 183–202.",
      "doi": ""
    },
    {
      "text": "Marie Russell, Rachel Price, Louise Signal, James Stanley, Zachery Gerring, and Jacqueline Cumming. 2011. What do passengers do during travel time? Structured observations on buses and trains. Journal of Public Transportation 14, 3 (2011), 7.",
      "doi": ""
    },
    {
      "text": "Dario D Salvucci and Niels A Taatgen. 2010. The multitasking mind. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Dario D Salvucci, Niels A Taatgen, and Jelmer P Borst. 2009. Toward a unified theory of the multitasking continuum: From concurrent performance to task switching, interruption, and resumption. In Proceedings of the SIGCHI conference on human factors in computing systems. 1819–1828.",
      "doi": "10.1145/1518701.1518981"
    },
    {
      "text": "Carl Shapiro, Hal R Varian, and WE Becker. 1999. Information rules: a strategic guide to the network economy. Journal of Economic Education 30 (1999), 189–190.",
      "doi": ""
    },
    {
      "text": "Herbert A Simon 1971. Designing organizations for an information-rich world. Computers, communications, and the public interest 72 (1971), 37.",
      "doi": ""
    },
    {
      "text": "Jonathan B Spira and Joshua B Feintuch. 2005. The cost of not paying attention: How interruptions impact knowledge worker productivity. Report from Basex (2005).",
      "doi": ""
    },
    {
      "text": "Tilo Strobach, Tiina Salminen, Julia Karbach, and Torsten Schubert. 2014. Practice-related optimization and transfer of executive functions: a general review and a specific realization of their mechanisms in dual tasks. Psychological research 78, 6 (2014), 836–851.",
      "doi": ""
    },
    {
      "text": "Elizabeth A Styles. 2010. Psicología de la atención. Editorial Centro de Estudios Ramón Areces Madrid, Spain.",
      "doi": ""
    },
    {
      "text": "Shanshan Sun and Yiik Diew Wong. 2022. Travel-based multitasking behaviour in Singapore: Determinants and impacts on money-time-seat trade-offs. Travel Behaviour and Society 26 (2022), 84–95.",
      "doi": ""
    },
    {
      "text": "Jia Tang, Feng Zhen, Jason Cao, and Patricia L Mokhtarian. 2018. How do passengers use travel time? A case study of Shanghai–Nanjing high speed rail. Transportation 45, 2 (2018), 451–477.",
      "doi": ""
    },
    {
      "text": "Taede Tillema, Tim Schwanen, and Martin Dijst. 2009. Communicating something confidential while travelling by train: the use of a telephone conversation versus silent modes. Transportation 36, 5 (2009), 541–564.",
      "doi": ""
    },
    {
      "text": "Harry Timmermans and Peter Van der Waerden. 2008. Synchronicity of activity engagement and travel in time and space: descriptors and correlates of field observations. Transportation Research Record 2054, 1 (2008), 1–9.",
      "doi": ""
    },
    {
      "text": "Niels Van Berkel, Chu Luo, Theodoros Anagnostopoulos, Denzil Ferreira, Jorge Goncalves, Simo Hosio, and Vassilis Kostakos. 2016. A systematic assessment of smartphone usage gaps. In Proceedings of the 2016 CHI conference on human factors in computing systems. 4711–4721.",
      "doi": "10.1145/2858036.2858348"
    },
    {
      "text": "Peter Van der Waerden, Harry Timmermans, and Rob van Neerven. 2009. Extent, nature, and covariates of multitasking of rail passengers in an urban corridor: A Dutch case study. Transportation research record 2110, 1 (2009), 106–111.",
      "doi": ""
    },
    {
      "text": "Mark Wardman and Glenn Lyons. 2016. The digital revolution and worthwhile use of travel time: implications for appraisal and forecasting. Transportation 43, 3 (2016), 507–530.",
      "doi": ""
    },
    {
      "text": "Junyi Zhang and Harry Timmermans. 2010. Scobit-based panel analysis of multitasking behavior of public transport users. Transportation research record 2157, 1 (2010), 46–53.",
      "doi": ""
    }
  ]
}