{
  "doi": "10.1145/3544548.3580846",
  "title": "Assessing enactment of content regulation policies: A post hoc crowd-sourced audit of election misinformation on YouTube",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2023,
  "badges": [],
  "abstract": "With the 2022 US midterm elections approaching, conspiratorial claims about the 2020 presidential elections continue to threaten users’ trust in the electoral process. To regulate election misinformation, YouTube introduced policies to remove such content from its searches and recommendations. In this paper, we conduct a 9-day crowd-sourced audit on YouTube to assess the extent of enactment of such policies. We recruited 99 users who installed a browser extension that enabled us to collect up-next recommendation trails and search results for 45 videos and 88 search queries about the 2020 elections. We find that YouTube’s search results, irrespective of search query bias, contain more videos that oppose rather than support election misinformation. However, watching misinformative election videos still lead users to a small number of misinformative videos in the up-next trails. Our results imply that while YouTube largely seems successful in regulating election misinformation, there is still room for improvement.",
  "tags": [
    "fairness",
    "misinformation",
    "recommendations",
    "voter fraud",
    "elections",
    "algorithm audit"
  ],
  "authors": [
    {
      "name": "Prerna Juneja",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659490327",
      "orcid": "0000-0003-1779-4276"
    },
    {
      "name": "Md Momen Bhuiyan",
      "institution": "Virginia Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321079",
      "orcid": "0000-0003-3408-9122"
    },
    {
      "name": "Tanushree Mitra",
      "institution": "University of Washington, United States",
      "img": "/do/10.1145/contrib-81553902156/rel-imgonly/tanu_sm.jpg",
      "acmid": "81553902156",
      "orcid": "0000-0002-9507-6192"
    }
  ],
  "references": [
    {
      "text": "Anton Abilov, Yiqing Hua, Hana Matatov, Ofra Amir, and Mor Naaman. 2021. VoterFraud2020: a Multi-modal Dataset of Election Fraud Claims on Twitter. Proceedings of the International AAAI Conference on Web and Social Media 15, 1 (May 2021), 901–912. https://ojs.aaai.org/index.php/ICWSM/article/view/18113",
      "doi": ""
    },
    {
      "text": "Hunt Allcott and Matthew Gentzkow. 2017. Social media and fake news in the 2016 election. Journal of economic perspectives 31, 2 (2017), 211–36.",
      "doi": ""
    },
    {
      "text": "Joshua Asplund, Motahhare Eslami, Hari Sundaram, Christian Sandvig, and Karrie Karahalios. 2020. Auditing race and gender discrimination in online housing markets. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. 24–35.",
      "doi": ""
    },
    {
      "text": "Jack Bandy. 2021. Problematic Machine Behavior: A Systematic Literature Review of Algorithm Audits. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 74 (April 2021), 34 pages. https://doi.org/10.1145/3449148",
      "doi": "10.1145/3449148"
    },
    {
      "text": "Jack Bandy and Nicholas Diakopoulos. 2020. Auditing news curation systems: A case study examining algorithmic and editorial logic in Apple News. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. 36–47.",
      "doi": ""
    },
    {
      "text": "Jack Bandy and Nicholas Diakopoulos. 2021. More accounts, fewer links: How algorithmic curation impacts media exposure in Twitter timelines. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–28.",
      "doi": "10.1145/3449152"
    },
    {
      "text": "Ryan Teague Beckwith. 2022. US Primaries: Election Deniers Go Door-to-Door to Confront Voters After Losses - Bloomberg. https://www.bloomberg.com/news/articles/2022-08-23/election-deniers-go-door-to-door-to-confront-voters-after-losses?leadSource=uverify%20wall. (Accessed on 09/07/2022).",
      "doi": ""
    },
    {
      "text": "Md Momen Bhuiyan, Carlos Augusto Bautista Isaza, Tanushree Mitra, and Sang Won Lee. 2022. OtherTube: Facilitating Content Discovery and Reflection by Exchanging YouTube Recommendations with Strangers. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3491102.3502028"
    },
    {
      "text": "James Bisbee, Megan Brown, Angela Lai, Richard Bonneau, Jonathan Nagler, and Joshua A Tucker. 2022. Election Fraud, YouTube, and Public Perception of the Legitimacy of President Biden. Journal of Online Trust and Safety 1, 3 (2022).",
      "doi": ""
    },
    {
      "text": "Axel Bruns. 2019. Are filter bubbles real?(2019).",
      "doi": ""
    },
    {
      "text": "Axel Bruns. 2019. Filter bubble. Internet Policy Review 8, 4 (2019).",
      "doi": ""
    },
    {
      "text": "Philip Bump. 2021. The unique role of Fox News in the misinformation universe - The Washington Post. https://www.washingtonpost.com/politics/2021/11/08/unique-role-fox-news-misinformation-universe/. (Accessed on 09/10/2022).",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. PMLR, 77–91.",
      "doi": ""
    },
    {
      "text": "Jonatas C. dos Santos, Sean WM Siqueira, Bernardo Pereira Nunes, Pedro P. Balestrassi, and Fabrício RS Pereira. 2020. Is there personalization in twitter search? a study on polarized opinions about the brazilian welfare reform. In 12th ACM Conference on Web Science. 267–276.",
      "doi": "10.1145/3394231.3397917"
    },
    {
      "text": "José González Cabañas, Ángel Cuevas, and Rubén Cuevas. 2018. Unveiling and quantifying facebook exploitation of sensitive personal data for advertising purposes. In 27th {USENIX} Security Symposium ({USENIX} Security 18). 479–495.",
      "doi": ""
    },
    {
      "text": "Nitesh V Chawla, Kevin W Bowyer, Lawrence O Hall, and W Philip Kegelmeyer. 2002. SMOTE: synthetic minority over-sampling technique. Journal of artificial intelligence research 16 (2002), 321–357.",
      "doi": "10.5555/1622407.1622416"
    },
    {
      "text": "Annie Y Chen, Brendan Nyhan, Jason Reifler, Ronald E Robertson, and Christo Wilson. 2022. Subscriptions and external links help drive resentful users to alternative and extremist YouTube videos. arXiv preprint arXiv:2204.10921(2022).",
      "doi": ""
    },
    {
      "text": "Peter M Dahlgren. 2021. A critical review of filter bubbles and a comparison with selective exposure. Nordicom Review 42, 1 (2021), 15–33.",
      "doi": ""
    },
    {
      "text": "Fred J Damerau. 1964. A technique for computer detection and correction of spelling errors. Commun. ACM 7, 3 (1964), 171–176.",
      "doi": "10.1145/363958.363994"
    },
    {
      "text": "Amit Datta, Michael Carl Tschantz, and Anupam Datta. 2014. Automated Experiments on Ad Privacy Settings: A Tale of Opacity, Choice, and Discrimination. CoRR abs/1408.6491(2014). arXiv:1408.6491http://arxiv.org/abs/1408.6491",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805(2018).",
      "doi": ""
    },
    {
      "text": "Jillian D’Onfro. 2018. YouTube adding Wikipedia links debunking conspiracy theories. https://www.cnbc.com/2018/03/13/youtube-wikipedia-links-debunk-conspiracy.html. (Accessed on 09/12/2022).",
      "doi": ""
    },
    {
      "text": "Grant Duwe. 2019. Better practices in the development and validation of recidivism risk assessments: The Minnesota Sex Offender Screening Tool–4. Criminal Justice Policy Review 30, 4 (2019), 538–564.",
      "doi": ""
    },
    {
      "text": "Robert Epstein and Ronald E Robertson. 2015. The search engine manipulation effect (SEME) and its possible impact on the outcomes of elections. Proceedings of the National Academy of Sciences 112, 33(2015), E4512–E4521.",
      "doi": ""
    },
    {
      "text": "Robert Epstein, Ronald E Robertson, David Lazer, and Christo Wilson. 2017. Suppressing the search engine manipulation effect (SEME). Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–22.",
      "doi": "10.1145/3134677"
    },
    {
      "text": "Marc Faddoul, Guillaume Chaslot, and Hany Farid. 2020. A longitudinal analysis of YouTube’s promotion of conspiracy videos. arXiv preprint arXiv:2003.03318(2020).",
      "doi": ""
    },
    {
      "text": "Center for an Informed Public, Digital Forensic Research Lab, Graphika, and Stanford Internet Observatory. 2021. The Long Fuse: Misinformation and the 2020 Election. (2021).",
      "doi": ""
    },
    {
      "text": "Yingqiang Ge, Shuchang Liu, Ruoyuan Gao, Yikun Xian, Yunqi Li, Xiangyu Zhao, Changhua Pei, Fei Sun, Junfeng Ge, Wenwu Ou, 2021. Towards long-term fairness in recommendation. In Proceedings of the 14th ACM International Conference on Web Search and Data Mining. 445–453.",
      "doi": "10.1145/3437963.3441824"
    },
    {
      "text": "Tarleton Gillespie. 2017. Algorithmically recognizable: Santorum’s Google problem, and Google’s Santorum problem. Information, communication & society 20, 1 (2017), 63–80.",
      "doi": ""
    },
    {
      "text": "Michael Golebiewski and Danah Boyd. 2019. Data voids: Where missing data can easily be exploited. (2019).",
      "doi": ""
    },
    {
      "text": "Jon Green, William Hobbs, Stefan McCabe, and David Lazer. 2022. Online engagement with 2020 election misinformation and turnout in the 2021 Georgia runoff election. Proceedings of the National Academy of Sciences 119, 34(2022), e2115900119. https://doi.org/10.1073/pnas.2115900119 arXiv:https://www.pnas.org/doi/pdf/10.1073/pnas.2115900119",
      "doi": ""
    },
    {
      "text": "Aniko Hannak, Piotr Sapiezynski, Arash Molavi Kakhki, Balachander Krishnamurthy, David Lazer, Alan Mislove, and Christo Wilson. 2013. Measuring personalization of web search. In Proceedings of the 22nd international conference on World Wide Web. 527–538.",
      "doi": "10.1145/2488388.2488435"
    },
    {
      "text": "Emelia Hughes, Renee Wang, Prerna Juneja, Tanushree Mitra, and Amy X Zhang. 2021. Introducing Credibility Signals and Citations to Video-Sharing Platforms. (2021).",
      "doi": ""
    },
    {
      "text": "Eslam Hussein, Prerna Juneja, and Tanushree Mitra. 2020. Measuring misinformation in video search platforms: An audit study on YouTube. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–27.",
      "doi": "10.1145/3392854"
    },
    {
      "text": "Ferenc Huszár, Sofia Ira Ktena, Conor O’Brien, Luca Belli, Andrew Schlaikjer, and Moritz Hardt. 2022. Algorithmic amplification of politics on Twitter. Proceedings of the National Academy of Sciences 119, 1 (2022), e2025334119.",
      "doi": ""
    },
    {
      "text": "Steve Inskeep. 2022. Timeline: The False Election Fraud Story Trump Told For Months Before Jan. 6 : NPR. https://www.npr.org/2021/02/08/965342252/timeline-what-trump-told-supporters-for-months-before-they-attacked. (Accessed on 04/18/2022).",
      "doi": ""
    },
    {
      "text": "Glen Joris, Frederik De Grove, Kristin Van Damme, and Lieven De Marez. 2020. News diversity reconsidered: A systematic literature review unraveling the diversity in conceptualizations. Journalism Studies 21, 13 (2020), 1893–1912.",
      "doi": ""
    },
    {
      "text": "Prerna Juneja and Tanushree Mitra. 2021. Auditing e-commerce platforms for algorithmically curated vaccine misinformation. In Proceedings of the 2021 chi conference on human factors in computing systems. 1–27.",
      "doi": "10.1145/3411764.3445250"
    },
    {
      "text": "Anna Kahlisch. 2021. All Souls Blog: “Predictive Algorithms in the Justice System: The implications of neutrality logics” | Oxford Law Faculty. https://www.law.ox.ac.uk/centres-institutes/centre-criminology/blog/2021/02/all-souls-blog-predictive-algorithms-justice. (2021). (Accessed on 11/03/2021).",
      "doi": ""
    },
    {
      "text": "Alex Kaplan. 2020. YouTube has allowed conspiracy theories about interference with voting machines to go viral | Media Matters for America. https://www.mediamatters.org/google/youtube-has-allowed-conspiracy-theories-about-interference-voting-machines-go-viral. (Accessed on 09/08/2022).",
      "doi": ""
    },
    {
      "text": "Chloe Kliman-Silver, Aniko Hannak, David Lazer, Christo Wilson, and Alan Mislove. 2015. Location, location, location: The impact of geolocation on web search personalization. In Proceedings of the 2015 internet measurement conference. 121–127.",
      "doi": "10.1145/2815675.2815714"
    },
    {
      "text": "Juhi Kulshrestha, Motahhare Eslami, Johnnatan Messias, Muhammad Bilal Zafar, Saptarshi Ghosh, Krishna P. Gummadi, and Karrie Karahalios. 2017. Quantifying Search Bias: Investigating Sources of Bias for Political Searches in Social Media. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 417–432. https://doi.org/10.1145/2998181.2998321",
      "doi": "10.1145/2998181.2998321"
    },
    {
      "text": "Kyriakos Kyriakou, Pınar Barlas, Styliani Kleanthous, and Jahna Otterbacher. 2019. Fairness in proprietary image tagging algorithms: A cross-platform audit on people images. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 13. 313–322.",
      "doi": ""
    },
    {
      "text": "Binh Le, Damiano Spina, Falk Scholer, and Hui Chia. 2022. A crowdsourcing methodology to measure algorithmic bias in black-box systems: A case study with COVID-related searches. In Proceedings of the Third Workshop on Bias and Social Aspects in Search and Recommendation (Bias@ ECIR 2022).",
      "doi": ""
    },
    {
      "text": "Cristiano Lima. 2020. YouTube to remove videos claiming mass fraud changed election results - POLITICO. https://www.politico.com/news/2020/12/09/youtube-videos-mass-fraud-election-results-443925. (Accessed on 09/08/2022).",
      "doi": ""
    },
    {
      "text": "Cristiano Lima and Aaron Schaffer. 2022. Study finds social media posts about election fraud still prevalent - The Washington Post. https://www.washingtonpost.com/politics/2022/08/09/social-media-posts-about-election-fraud-still-prevalent-study-finds/. (Accessed on 09/06/2022).",
      "doi": ""
    },
    {
      "text": "Christina Lioma, Jakob Grue Simonsen, and Birger Larsen. 2017. Evaluation measures for relevance and credibility in ranked lists. In Proceedings of the ACM SIGIR International Conference on Theory of Information Retrieval. 91–98.",
      "doi": "10.1145/3121050.3121072"
    },
    {
      "text": "John Locher. 2022. How to Fight Election Misinformation in 2022 – Brewminate: A Bold Blend of News and Ideas. https://brewminate.com/how-to-fight-election-misinformation-in-2022/. (Accessed on 09/08/2022).",
      "doi": ""
    },
    {
      "text": "Maggie Macdonald and Megan A. Brown. 2022. Republican candidates are spreading more fake news than just two years ago - The Washington Post. https://www.washingtonpost.com/politics/2022/08/29/republicans-democrats-misinformation-falsehoods/. (Accessed on 09/10/2022).",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra, Graham P Wright, and Eric Gilbert. 2017. A parsimonious language model of social media credibility across disparate events. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 126–145.",
      "doi": "10.1145/2998181.2998351"
    },
    {
      "text": "Philip M Napoli. 2011. Exposure diversity reconsidered. Journal of information policy 1, 1 (2011), 246–259.",
      "doi": ""
    },
    {
      "text": "Laura Hazard Owen. 2017. Republicans seem more susceptible to fake news than Democrats (but liberals, don’t feel too comfy yet) | Nieman Journalism Lab. https://www.niemanlab.org/2017/05/republicans-seem-more-susceptible-to-fake-news-than-democrats-but-liberals-dont-feel-too-comfy-yet/. (Accessed on 09/14/2022).",
      "doi": ""
    },
    {
      "text": "Kostantinos Papadamou, Savvas Zannettou, Jeremy Blackburn, Emiliano De Cristofaro, Gianluca Stringhini, and Michael Sirivianos. 2022. “It is just a flu”: Assessing the Effect of Watch History on YouTube’s Pseudoscientific Video Recommendations. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 16. 723–734.",
      "doi": ""
    },
    {
      "text": "Andrew Perrin and Monica Anderson. 2019. Social media usage in the U.S. in 2019 | Pew Research Center. https://www.pewresearch.org/fact-tank/2019/04/10/share-of-u-s-adults-using-social-media-including-facebook-is-mostly-unchanged-since-2018/. (Accessed on 09/08/2022).",
      "doi": ""
    },
    {
      "text": "Manoel Horta Ribeiro, Raphael Ottoni, Robert West, Virgílio AF Almeida, and Wagner Meira Jr. 2020. Auditing radicalization pathways on YouTube. In Proceedings of the 2020 conference on fairness, accountability, and transparency. 131–141.",
      "doi": "10.1145/3351095.3372879"
    },
    {
      "text": "Ronald E. Robertson, Shan Jiang, Kenneth Joseph, Lisa Friedland, David Lazer, and Christo Wilson. 2018. Auditing Partisan Audience Bias within Google Search. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 148 (Nov. 2018), 22 pages. https://doi.org/10.1145/3274417",
      "doi": "10.1145/3274417"
    },
    {
      "text": "Ronald E Robertson, David Lazer, and Christo Wilson. 2018. Auditing the personalization and composition of politically-related search engine results pages. In Proceedings of the 2018 World Wide Web Conference. 955–965.",
      "doi": "10.1145/3178876.3186143"
    },
    {
      "text": "Christian Sandvig, Kevin Hamilton, Karrie Karahalios, and Cedric Langbort. 2014. Auditing algorithms: Research methods for detecting discrimination on internet platforms. Data and discrimination: converting critical concerns into productive inquiry 22(2014), 4349–4357.",
      "doi": ""
    },
    {
      "text": "Leonardo Sanna, Salvatore Romano, Giulia Corona, and Claudio Agosti. 2020. YTTREX: crowdsourced analysis of YouTube’s recommender system during COVID-19 pandemic. In Annual International Conference on Information Management and Big Data. Springer, 107–121.",
      "doi": ""
    },
    {
      "text": "Amanda Seitz. 2022. In election misinformation fight, ’2020 changed everything’ | AP News. https://apnews.com/article/2022-midterm-elections-voting-rights-technology-business-social-media-f5ba340c7a98f6f058fb3afac74a26bb. (Accessed on 09/10/2022).",
      "doi": ""
    },
    {
      "text": "Hong Shen, Alicia DeVos, Motahhare Eslami, and Kenneth Holstein. 2021. Everyday algorithm auditing: Understanding the power of everyday users in surfacing harmful algorithmic behaviors. CoRR abs/2105.02980(2021). arxiv:2105.02980https://arxiv.org/abs/2105.02980",
      "doi": ""
    },
    {
      "text": "Julia Shumway. 2022. Oregon GOP frontrunner for governor embraces claims of election fraud – Oregon Capital Chronicle. https://oregoncapitalchronicle.com/2022/02/01/oregon-gop-frontrunner-for-governor-embraces-claims-of-election-fraud/. (Accessed on 09/08/2022).",
      "doi": ""
    },
    {
      "text": "Jakub Simko, Matus Tomlein, Branislav Pecher, Robert Moro, Ivan Srba, Elena Stefancova, Andrea Hrckova, Michal Kompan, Juraj Podrouzek, and Maria Bielikova. 2021. Towards Continuous Automatic Audits of Social Media Adaptive Behavior and its Role in Misinformation Spreading. In Adjunct Proceedings of the 29th ACM Conference on User Modeling, Adaptation and Personalization. 411–414.",
      "doi": "10.1145/3450614.3463353"
    },
    {
      "text": "Patrick Linehan Soo Rin Kim, Laura Romeroand Kate Holland. 2022. With 10 weeks until midterms, election deniers are hampering some election preparations - ABC News. https://abcnews.go.com/US/10-weeks-midterms-election-deniers-hampering-election-preparations/story?id=89007798. (Accessed on 09/07/2022).",
      "doi": ""
    },
    {
      "text": "Hana Stepnick. 2022. How will social media platforms respond to election misinformation? It isn’t clear - Poynter. https://www.poynter.org/fact-checking/2022/how-will-social-media-platforms-respond-to-election-misinformation-it-isnt-clear/. (Accessed on 09/08/2022).",
      "doi": ""
    },
    {
      "text": "Yla R Tausczik and James W Pennebaker. 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of language and social psychology 29, 1 (2010), 24–54.",
      "doi": ""
    },
    {
      "text": "The YouTube Team. 2020. Managing harmful conspiracy theories on YouTube. https://blog.youtube/news-and-events/harmful-conspiracy-theories-youtube/. (Accessed on 09/08/2022).",
      "doi": ""
    },
    {
      "text": "The YouTube Team. 2020. Supporting the 2020 U.S. election. https://blog.youtube/news-and-events/supporting-the-2020-us-election/.",
      "doi": ""
    },
    {
      "text": "Alex Thompson. 2020. Trump deploys YouTube as his secret weapon in 2020 - POLITICO. https://www.politico.com/news/2020/09/06/trumpyoutube-election-comeback-408576. (Accessed on 09/08/2022).",
      "doi": ""
    },
    {
      "text": "Matus Tomlein, Branislav Pecher, Jakub Simko, Ivan Srba, Robert Moro, Elena Stefancova, Michal Kompan, Andrea Hrckova, Juraj Podrouzek, and Maria Bielikova. 2021. An Audit of Misinformation Filter Bubbles on YouTube: Bubble Bursting and Recent Behavior Changes. In Fifteenth ACM Conference on Recommender Systems. 1–11.",
      "doi": ""
    },
    {
      "text": "Daniel Trielli and Nicholas Diakopoulos. 2019. Search as news curator: The role of Google in shaping attention to news information. In Proceedings of the 2019 CHI Conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3290605.3300683"
    },
    {
      "text": "Giridhari Venkatadri, Piotr Sapiezynski, Elissa M Redmiles, Alan Mislove, Oana Goga, Michelle Mazurek, and Krishna P Gummadi. 2019. Auditing Offline Data Brokers via Facebook’s Advertising Platform. In The World Wide Web Conference. 1920–1930.",
      "doi": ""
    },
    {
      "text": "YouTube Viewers. 2022. Learn about watch history on YouTube - YouTube. https://www.youtube.com/watch?v=YbWZcgOYHAc&ab_channel=YouTubeViewers. (Accessed on 02/07/2022).",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Paul Zube, Andrew Smock, Caleb T Carr, Nicole Ellison, and Cliff Lampe. 2011. It’s complicated: Facebook users’ political participation in the 2008 election. CyberPsychology, behavior, and social networking 14, 3(2011), 107–114.",
      "doi": ""
    },
    {
      "text": "Daisuke Wakabayashi. Accessed on 09/08/2022. Election misinformation continues staying up on YouTube. - The New York Times. https://www.nytimes.com/2020/11/10/technology/election-misinformation-continues-staying-up-on-youtube.html.",
      "doi": ""
    },
    {
      "text": "William Webber, Alistair Moffat, and Justin Zobel. 2010. A similarity measure for indefinite rankings. ACM Transactions on Information Systems (TOIS) 28, 4 (2010), 1–38.",
      "doi": "10.1145/1852102.1852106"
    },
    {
      "text": "Joe Whittaker, Seán Looney, Alastair Reed, and Fabio Votta. 2021. Recommender systems and the amplification of extremist content. Internet Policy Review 10, 2 (2021), 1–29.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors. 2022. Occam’s razor — Wikipedia, The Free Encyclopedia. https://en.wikipedia.org/w/index.php?title=Occam%27s_razor&oldid=1119577554 [Online; accessed 13-September-2022].",
      "doi": ""
    },
    {
      "text": "Christo Wilson. 2019. The Promise and Peril of Algorithm Audits for Increasing Transparency and Accountability of Donated Datasets. (2019).",
      "doi": ""
    },
    {
      "text": "Sam Wineburg and Sarah McGrew. 2017. Lateral reading: Reading less and learning more when evaluating digital information. (2017).",
      "doi": ""
    },
    {
      "text": "Wenyi Xiao, Huan Zhao, Haojie Pan, Yangqiu Song, Vincent W Zheng, and Qiang Yang. 2019. Beyond personalization: Social content recommendation for creator equality and consumer satisfaction. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. 235–245.",
      "doi": "10.1145/3292500.3330965"
    },
    {
      "text": "YouTube. 2022. View or delete search history - Computer - YouTube Help. https://support.google.com/youtube/answer/57711?co=GENIE.Platform%3DDesktop&hl=en. (Accessed on 02/07/2022).",
      "doi": ""
    },
    {
      "text": "YouTube. Accessed on 09/08/2022. Elections misinformation policies - YouTube Help. https://support.google.com/youtube/answer/10835034?hl=en.",
      "doi": ""
    },
    {
      "text": "YouTube. Accessed on 09/14/2022. Browse YouTube while incognito on mobile devices - YouTube Help. https://support.google.com/youtube/answer/9040743?hl=en.",
      "doi": ""
    }
  ]
}