{
  "doi": "10.1145/3544548.3581195",
  "title": "Seeking Love and Companionship through Streaming: Unpacking Livestreamer-moderated Senior Matchmaking in China",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Livestreamer-moderated matchmaking has gained wide popularity among the elderly population in China. Compared to algorithm-mediated online dating, it is characterized by (1) the mediation of matchmakers in a synchronous virtual environment and (2) the natural development of livestreaming-based matchmaking communities. Nonetheless, how these new features influence single seniors’ match-seeking remains unknown. To fill this research gap, we conduct a qualitative study consisting of observations and semi-structured interviews with 6 livestreaming matchmakers and 12 senior match-seekers (age: 50-70). We uncover matchmakers’ mediation roles during and beyond livestreaming to facilitate seniors’ match-seeking, and their additional duties to enhance seniors’ safety in this process. Livestreaming-based matchmaking communities afford multiple important values for single seniors to acquire companionship and help in seeking late-life love. We unpack the perceived benefits and challenges of livestreamer-moderated matchmaking, and discuss how to support single seniors’ match-seeking in an accessible, safe, and convenient manner.",
  "authors": [
    {
      "name": "Changyang He",
      "institution": "Department of Computer Science and Engineering, Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659900877",
      "orcid": "0000-0001-6648-4456"
    },
    {
      "name": "Lu He",
      "institution": "Department of Informatics, University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659898406",
      "orcid": "0000-0003-0181-018X"
    },
    {
      "name": "Zhicong Lu",
      "institution": "Department of Computer Science, City University of Hong Kong, China",
      "img": "/do/10.1145/contrib-99659162049/rel-imgonly/photo.jpg",
      "acmid": "99659162049",
      "orcid": "0000-0002-7761-6351"
    },
    {
      "name": "Bo Li",
      "institution": "Department of Computer Science and Engineering, Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409595864",
      "orcid": "0000-0003-2955-750X"
    }
  ],
  "references": [
    {
      "text": "AgeClub. 2020. When tens of millions of middle-aged and elderly people turn to Douyin and Kuaishou, what will happen to the \"small but delicate\" App (in Chinese). https://www.cbndata.com/information/64611. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Adel Al-Dawood, Norah Abokhodair, Houda El Mimouni, and Svetlana Yarosh. 2017. \" Against Marrying a Stranger\" Marital Matchmaking Technologies in Saudi Arabia. In Proceedings of the 2017 Conference on Designing Interactive Systems. 1013–1024.",
      "doi": "10.1145/3064663.3064683"
    },
    {
      "text": "Adel Al-Dawood, Serene Alhajhussein, and Svetlana Yarosh. 2021. Saudi Arabian Parents’ Perception of Online Marital Matchmaking Technologies. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–32.",
      "doi": "10.1145/3432910"
    },
    {
      "text": "Irwin Altman and Dalmas A Taylor. 1973. Social penetration: The development of interpersonal relationships.Holt, Rinehart & Winston.",
      "doi": ""
    },
    {
      "text": "Jacob Ausubel. 2020. Older people are more likely to live alone in the U.S. than elsewhere in the world. https://www.pewresearch.org/fact-tank/2020/03/10/older-people-are-more-likely-to-live-alone-in-the-u-s-than-elsewhere-in-the-world/. Accessed: 2022-01-09.",
      "doi": ""
    },
    {
      "text": "Baidu Baike. 2021. Laolai Net. https://baike.baidu.com/item/%E8%80%81%E6%9D%A5%E7%BD%91. Accessed: 2021-10-04.",
      "doi": ""
    },
    {
      "text": "Vern Bengtson. 2018. Global aging and challenges to families. Routledge.",
      "doi": ""
    },
    {
      "text": "Luigi Biocca, Nicolò Paraciani, Francesca Picenni, Giovanni Caruso, Marco Padula, Riccardo Chiariglione, Agnieszka Kowalska, Monica Florea, and Ilias Kapouranis. 2017. The STAGE project: Tailored cultural entertainment for older adults via streaming technology. In International Conference on Human Aspects of IT for the Aged Population. Springer, 487–500.",
      "doi": ""
    },
    {
      "text": "Robin N Brewer, Sarita Schoenebeck, Kerry Lee, and Haripriya Suryadevara. 2021. Challenging Passive Social Media Use: Older Adults as Caregivers Online. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–20.",
      "doi": "10.1145/3449197"
    },
    {
      "text": "China Internet Network Information Center. 2021. The 47th statistical report on the development of the Internet in China (in Chinese). http://www.cac.gov.cn/2021-02/03/c_1613923423079314.htm. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Di Chen, Dustin Freeman, and Ravin Balakrishnan. 2019. Integrating Multimedia Tools to Enrich Interactions in Live Streaming for Language Learning. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300668"
    },
    {
      "text": "Yan Chen, Walter S Lasecki, and Tao Dong. 2021. Towards Supporting Programming Education at Scale via Live Streaming. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–19.",
      "doi": "10.1145/3434168"
    },
    {
      "text": "Chinabaogao. 2022. Statistics on daily/monthly active user scale, user stickiness, per capita usage time and proportion of short video industry in China in 2022 (in Chinese). https://www.chinabaogao.com/detail/606375.html. Accessed: 2022-11-15.",
      "doi": ""
    },
    {
      "text": "Leung-Wing Chu and Iris Chi. 2008. Nursing homes in China. Journal of the American Medical Directors Association 9, 4(2008), 237–243.",
      "doi": ""
    },
    {
      "text": "Camille Cobb and Tadayoshi Kohno. 2017. How public is my private life? Privacy in online dating. In Proceedings of the 26th International Conference on World Wide Web. 1231–1240.",
      "doi": "10.1145/3038912.3052592"
    },
    {
      "text": "Graeme W Coleman, Lorna Gibson, Vicki L Hanson, Ania Bobrowicz, and Alison McKay. 2010. Engaging the disengaged: How do we design technology for digitally excluded older adults?. In Proceedings of the 8th ACM Conference on Designing Interactive Systems. 175–178.",
      "doi": "10.1145/1858171.1858202"
    },
    {
      "text": "Rachel Connelly and Margaret Maurer-Fazio. 2016. Left behind, at-risk, and vulnerable elders in rural China. China Economic Review 37(2016), 140–153.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage publications.",
      "doi": ""
    },
    {
      "text": "John W Creswell and Dana L Miller. 2000. Determining validity in qualitative inquiry. Theory into practice 39, 3 (2000), 124–130.",
      "doi": ""
    },
    {
      "text": "Yngve Dahl and Kshitij Sharma. 2022. Six Facets of Facilitation: Participatory Design Facilitators’ Perspectives on Their Role and Its Realization. In CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": ""
    },
    {
      "text": "China Youth Daily. 2022. Douyin’s Elderly Friends Program upgrades multiple measures to protect the healthy use of the Internet of the elderly. http://m.cyol.com/gb/articles/2022-03/30/content_XXnKKipA6.html. Accessed: 2022-12-10.",
      "doi": ""
    },
    {
      "text": "Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2006. Managing impressions online: Self-presentation processes in the online dating environment. Journal of computer-mediated communication 11, 2 (2006), 415–441.",
      "doi": ""
    },
    {
      "text": "Travis Faas, Lynn Dombrowski, Alyson Young, and Andrew D Miller. 2018. Watch me code: Programming mentorship communities on twitch. tv. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–18.",
      "doi": "10.1145/3274319"
    },
    {
      "text": "Andrew T Fiore, Lindsay Shaw Taylor, Gerald A Mendelsohn, and Marti Hearst. 2008. Assessing attractiveness in online dating profiles. In Proceedings of the SIGCHI conference on human factors in computing systems. 797–806.",
      "doi": "10.1145/1357054.1357181"
    },
    {
      "text": "Ying Gao, Xiulan Zhang, and Weilong Zhu. 2012. Study on the Divorce Rate and Age Distribution in Beijing in Recent Years. Social Sciences of Beijing 4 (2012), 34–42.",
      "doi": ""
    },
    {
      "text": "Rosanna E Guadagno, Bradley M Okdie, and Sara A Kruse. 2012. Dating deception: Gender, online dating, and exaggerated self-presentation. Computers in Human Behavior 28, 2 (2012), 642–647.",
      "doi": "10.1016/j.chb.2011.11.010"
    },
    {
      "text": "Yu Guo, Tingshuai Ge, Li Mei, Lina Wang, and Jingbo Li. 2021. Widowhood and Health Status Among Chinese Older Adults: The Mediation Effects of Different Types of Support. Frontiers in public health 9 (2021).",
      "doi": ""
    },
    {
      "text": "William A Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on twitch: fostering participatory communities of play within live mixed media. In Proceedings of the SIGCHI conference on human factors in computing systems. 1315–1324.",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "Jeffrey T Hancock, Catalina Toma, and Nicole Ellison. 2007. The truth about lying in online dating profiles. In Proceedings of the SIGCHI conference on Human factors in computing systems. 449–452.",
      "doi": "10.1145/1240624.1240697"
    },
    {
      "text": "Mark J Handel and Irina Shklovski. 2012. Disclosure, ambiguity and risk reduction in real-time dating sites. In Proceedings of the 17th ACM international conference on Supporting group work. 175–178.",
      "doi": "10.1145/2389176.2389203"
    },
    {
      "text": "Christina N Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging low-income African American older adults in health discussions through community-based design workshops. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3290605.3300823"
    },
    {
      "text": "Changyang He, Lu He, Zhicong Lu, and Bo Li. 2023. \"I Have to Use My Son’s QR Code to Run the Business\": Unpacking Senior Street Vendors’ Challenges in Mobile Money Collection in China. Proceedings of the ACM on Human-Computer Interaction 7, CSCW1(2023), 1–28.",
      "doi": "10.1145/3579493"
    },
    {
      "text": "Eulàlia Hernández-Encuentra, Modesta Pousada, and Beni Gómez-Zúñiga. 2009. ICT and older people: Beyond usability. Educational Gerontology 35, 3 (2009), 226–245.",
      "doi": ""
    },
    {
      "text": "Zorah Hilvert-Bruce, James T Neill, Max Sjöblom, and Juho Hamari. 2018. Social motivations of live-streaming viewer engagement on Twitch. Computers in Human Behavior 84 (2018), 58–67.",
      "doi": "10.1016/j.chb.2018.02.013"
    },
    {
      "text": "Arlie R Hochschild. 1983. The managed heart. Berkeley.",
      "doi": ""
    },
    {
      "text": "Duan Hongbiao. 2015. 80% widowed elderly have desire to remarry: Vulnerable to interference by their children, and with lots of property disputes (in Chinese). http://finance.people.com.cn/n/2015/0909/c1004-27559937.html. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Mingyao Hu and Sohail S Chaudhry. 2020. Enhancing consumer engagement in e-commerce live streaming via relational bonds. Internet Research (2020).",
      "doi": ""
    },
    {
      "text": "iResearch Consulting Group. 2019. Research report on China’s online dating industry (in Chinese). http://report.iresearch.cn/wx/report.aspx?id=3339. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Kylie Jarrett. 2014. The relevance of“women’s work” social reproduction and immaterial labor in digital media. Television & new media 15, 1 (2014), 14–29.",
      "doi": ""
    },
    {
      "text": "Quanbao Jiang, Xiaomin Li, and Jesús J Sánchez-Barricarte. 2015. Elderly widowhood in China. Asian Population Studies 11, 1 (2015), 7–16.",
      "doi": ""
    },
    {
      "text": "Xiaofu Jin, Emily Kuang, and Mingming Fan. 2021. \" Too old to bank digitally?\": A Survey of Banking Practices and Challenges Among Older Adults in China. (2021).",
      "doi": ""
    },
    {
      "text": "Pegah Karimi and Aqueasha Martin-Hammond. 2020. Understanding barriers to medical instruction access for older adults: implications for AI-assisted tools. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers. 42–45.",
      "doi": "10.1145/3410530.3414412"
    },
    {
      "text": "Lucas Kempe-Cook, Stephen Tsung-Han Sher, and Norman Makoto Su. 2019. Behind the Voices: The Practice and Challenges of Esports Casters. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300795"
    },
    {
      "text": "Susann Keohane, Caroline Swarbrick, and Sumi Helal. 2022. Barriers and Facilitators to Technology Among Older Adults During COVID-19 Pandemic: A Systematic Review Using Thematic Analysis. In International Conference on Human-Computer Interaction. Springer, 466–484.",
      "doi": "10.1007/978-3-031-05581-2_33"
    },
    {
      "text": "Bran Knowles and Vicki L Hanson. 2018. Older adults’ deployment of‘distrust’. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 4(2018), 1–25.",
      "doi": "10.1145/3196490"
    },
    {
      "text": "Jess Kropczynski, Zaina Aljallad, Nathan Jeffrey Elrod, Heather Lipford, and Pamela J Wisniewski. 2021. Towards Building Community Collective Efficacy for Managing Digital Privacy and Security within Older Adult Communities. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–27.",
      "doi": "10.1145/3432954"
    },
    {
      "text": "Simiran Lalvani and Joyojeet Pal. 2022. The Moral Orders of Matchmaking Work: Digitization of Matrimonial Services and the Future of Work. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–23.",
      "doi": "10.1145/3512968"
    },
    {
      "text": "Maurizio Lazzarato. 1996. Immaterial labor. Radical thought in Italy: A potential politics 1996 (1996), 133–47.",
      "doi": ""
    },
    {
      "text": "Adeline Y Lee and Amy S Bruckman. 2007. Judging you by the company you keep: dating on social networking sites. In Proceedings of the 2007 international ACM conference on Supporting group work. 371–378.",
      "doi": "10.1145/1316624.1316680"
    },
    {
      "text": "Bob Lee, Yiwei Chen, and Lynne Hewitt. 2011. Age differences in constraints encountered by seniors in their use of computers and the internet. Computers in Human Behavior 27, 3 (2011), 1231–1237.",
      "doi": "10.1016/j.chb.2011.01.003"
    },
    {
      "text": "Vilma Lehtinen, Jaana Näsänen, and Risto Sarvas. 2009. “A Little Silly and Empty-Headed”–Older Adults’ Understandings of Social Networking Sites. People and Computers XXIII Celebrating People and Technology (2009), 45–54.",
      "doi": ""
    },
    {
      "text": "Jie Li, Xinning Gui, Yubo Kou, and Yukun Li. 2019. Live Streaming as Co-Performance: Dynamics between Center and Periphery in Theatrical Engagement. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3359166"
    },
    {
      "text": "Gretchen Livingston. 2019. Americans 60 and older are spending more time in front of their screens than a decade ago. https://www.pewresearch.org/fact-tank/2019/06/18/americans-60-and-older-are-spending-more-time-in-front-of-their-screens-than-a-decade-ago/. Accessed: 2021-10-20.",
      "doi": ""
    },
    {
      "text": "Ya Lu. 2021. The unhappy middle-aged women in streaming on relationship (in Chinese). https://mp.weixin.qq.com/s/FIU6GhqEA8PqHL0xRuIrAg. Accessed: 2021-10-22.",
      "doi": ""
    },
    {
      "text": "Zhicong Lu, Michelle Annett, Mingming Fan, and Daniel Wigdor. 2019. \" I feel it is my responsibility to stream\" Streaming and Engaging with Intangible Cultural Heritage through Livestreaming. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300459"
    },
    {
      "text": "Zhicong Lu, Michelle Annett, and Daniel Wigdor. 2019. Vicariously experiencing it all without going outside: a study of outdoor livestreaming in China. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–28.",
      "doi": "10.1145/3359127"
    },
    {
      "text": "Zhicong Lu, Haijun Xia, Seongkook Heo, and Daniel Wigdor. 2018. You watch, you give, and you engage: a study of live streaming practices in China. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174040"
    },
    {
      "text": "Xiao Ma, Emily Sun, and Mor Naaman. 2017. What happens in happn: The warranting powers of location history in online dating. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 41–50.",
      "doi": "10.1145/2998181.2998241"
    },
    {
      "text": "Christina Masden and W Keith Edwards. 2015. Understanding the role of community in online dating. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 535–544.",
      "doi": "10.1145/2702123.2702417"
    },
    {
      "text": "Michael Muller. 2014. Curiosity, creativity, and surprise as analytic tools: Grounded theory method. In Ways of Knowing in HCI. Springer, 25–48.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Benett Axtell, Hiba Rafih, Amna Liaqat, and Yomna Aly. 2018. Designing for Older Adults: Overcoming Barriers toward a Supportive, Safe, and Healthy Retirement. Pennsylvania: University of Pennsylvania(2018).",
      "doi": ""
    },
    {
      "text": "Savanthi Murthy, Karthik S Bhat, Sauvik Das, and Neha Kumar. 2021. Individually Vulnerable, Collectively Safe: The Security and Privacy Practices of Households with Older Adults. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–24.",
      "doi": "10.1145/3449212"
    },
    {
      "text": "Richi Nayak, Meng Zhang, and Lin Chen. 2010. A social matching system for an online dating network: a preliminary study. In 2010 IEEE International Conference on Data Mining Workshops. IEEE, 352–357.",
      "doi": "10.1109/ICDMW.2010.36"
    },
    {
      "text": "Xinhua Net. 2020. Xiaohongshu launched a psychological assistance platform to provide free counseling with more than 1,000 counselors (in Chinese). http://www.xinhuanet.com/enterprise/2020-02/10/c_1125553919.htm. Accessed: 2021-10-28.",
      "doi": ""
    },
    {
      "text": "Tencent News. 2021. The development trend of the dating market and the ranking of dating applications in 2020 (in Chinese). https://new.qq.com/omn/20210207/20210207A02WFM00.html. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "James Nicholson, Lynne Coventry, and Pamela Briggs. 2019. \" If It’s Important It Will Be A Headline\" Cybersecurity Information Seeking in Older Adults. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300579"
    },
    {
      "text": "NOVIA NURAIN, CHIA-FANG CHUNG, CLARA CALDEIRA, and KAY CONNELLY. 2021. Hugging with a Shower Curtain: Older Adults’Social Support Realities During the COVID-19 Pandemic. (2021).",
      "doi": ""
    },
    {
      "text": "Borke Obada-Obieh and Anil Somayaji. 2017. Can I believe you? Establishing trust in computer mediated introductions. In Proceedings of the 2017 New Security Paradigms Workshop. 94–106.",
      "doi": "10.1145/3171533.3171544"
    },
    {
      "text": "Daniela Oliveira, Harold Rocha, Huizi Yang, Donovan Ellis, Sandeep Dommaraju, Melis Muradoglu, Devon Weir, Adam Soliman, Tian Lin, and Natalie Ebner. 2017. Dissecting spear phishing emails for older vs young adults: On the interplay of weapons of influence and life domains in predicting susceptibility to phishing. In Proceedings of the 2017 chi conference on human factors in computing systems. 6412–6424.",
      "doi": "10.1145/3025453.3025831"
    },
    {
      "text": "Carolyn Pang, Zhiqin Collin Wang, Joanna McGrenere, Rock Leung, Jiamin Dai, and Karyn Moffatt. 2021. Technology Adoption and Learning Preferences for Older Adults: Evolving Perceptions, Ongoing Challenges, and Emerging Design Opportunities. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445702"
    },
    {
      "text": "Aswati Panicker, Kavya Basu, and Chia-Fang Chung. 2020. Changing Roles and Contexts: Symbolic Interactionism in the Sharing of Food and Eating Practices between Remote, Intergenerational Family Members. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–19.",
      "doi": "10.1145/3392848"
    },
    {
      "text": "Anthony Poon, Vaidehi Hussain, Julia Loughman, Ariel C Avgar, Madeline Sterling, and Nicola Dell. 2021. Computer-Mediated Peer Support Needs of Home Care Workers: Emotional Labor & the Politics of Professionalism. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–32.",
      "doi": "10.1145/3476077"
    },
    {
      "text": "John R Porter, Kiley Sobel, Sarah E Fox, Cynthia L Bennett, and Julie A Kientz. 2017. Filtered out: Disability disclosure practices in online dating communities. Proceedings of the ACM on Human-Computer interaction 1, CSCW(2017), 1–13.",
      "doi": "10.1145/3134722"
    },
    {
      "text": "Shailendra Rao, Tom Hurlbutt, Clifford Nass, and Nundu JanakiRam. 2009. My Dating Site Thinks I’m a Loser: effects of personal photos and presentation intervals on perceptions of recommender systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 221–224.",
      "doi": "10.1145/1518701.1518737"
    },
    {
      "text": "SWS Research. 2022. Kuaishou: the community of “bros” is breaking the circle, and the monetization of short videos is in progress (in Chinese). https://pdf.dfcfw.com/pdf/H3_AP202112171535046977_1.pdf. Accessed: 2022-11-15.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, Margot Brereton, Kate L Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never too old: engaging retired people inventing the future with MaKey MaKey. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3913–3922.",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "Zick Rubin. 1975. Disclosing oneself to a stranger: Reciprocity and its limits. Journal of Experimental Social Psychology 11, 3 (1975), 233–260.",
      "doi": ""
    },
    {
      "text": "Hyeyoung Ryu, Soyeon Kim, Dain Kim, Sooan Han, Keeheon Lee, and Younah Kang. 2020. Simple and Steady Interactions Win the Healthy Mentality: Designing a Chatbot Service for the Elderly. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–25.",
      "doi": "10.1145/3415223"
    },
    {
      "text": "Ari Schlesinger, Eshwar Chandrasekharan, Christina A Masden, Amy S Bruckman, W Keith Edwards, and Rebecca E Grinter. 2017. Situated anonymity: Impacts of anonymity, ephemerality, and hyper-locality on social media. In Proceedings of the 2017 CHI conference on human factors in computing systems. 6912–6924.",
      "doi": "10.1145/3025453.3025682"
    },
    {
      "text": "Dougal Shaw. 2020. Live video dating: Finding love online with an audience. https://www.bbc.com/news/business-53760042. Accessed: 2022-12-10.",
      "doi": ""
    },
    {
      "text": "Hong Shen, Cori Faklaris, Haojian Jin, Laura Dabbish, and Jason I Hong. 2020. ’I Can’t Even Buy Apples If I Don’t Use Mobile Pay?’ When Mobile Payments Become Infrastructural in China. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–26.",
      "doi": ""
    },
    {
      "text": "Jeff T Sheng and Sanjay R Kairam. 2020. From Virtual Strangers to IRL Friends: Relationship Development in Livestreaming Communities on Twitch. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–34.",
      "doi": "10.1145/3415165"
    },
    {
      "text": "Frances JiHae Sin. 2021. Digital social interaction in older adults during the COVID-19 pandemic. Ph. D. Dissertation. University of British Columbia.",
      "doi": ""
    },
    {
      "text": "Archana Singh and Nishi Misra. 2009. Loneliness, depression and sociability in old age. Industrial psychiatry journal 18, 1 (2009), 51.",
      "doi": ""
    },
    {
      "text": "David Struzek, Martin Dickel, Dave Randall, and Claudia Müller. 2019. How live streaming church services promotes social participation in rural areas. Interactions 27, 1 (2019), 64–69.",
      "doi": "10.1145/3373263"
    },
    {
      "text": "Yuling Sun, Xianghua Ding, Silvia Lindtner, Tun Lu, and Ning Gu. 2014. Being senior and ICT: A study of seniors using ICT in China. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems. 3933–3942.",
      "doi": "10.1145/2556288.2557248"
    },
    {
      "text": "Dan Tang, Zhiyong Lin, and Feinian Chen. 2020. Moving beyond living arrangements: the role of family and friendship ties in promoting mental health for urban and rural older adults in China. Aging & mental health 24, 9 (2020), 1523–1532.",
      "doi": ""
    },
    {
      "text": "Ningjing Tang, Lei Tao, Bo Wen, and Zhicong Lu. 2022. Dare to Dream, Dare to Livestream: How E-Commerce Livestreaming Empowers Chinese Rural Women. In CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3491102.3517634"
    },
    {
      "text": "Catalina L Toma and Jeffrey T Hancock. 2010. Reading between the lines: linguistic cues to deception in online dating profiles. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. 5–8.",
      "doi": "10.1145/1718918.1718921"
    },
    {
      "text": "Catalina L Toma, Jeffrey T Hancock, and Nicole B Ellison. 2008. Separating fact from fiction: An examination of deceptive self-presentation in online dating profiles. Personality and Social Psychology Bulletin 34, 8 (2008), 1023–1036.",
      "doi": ""
    },
    {
      "text": "Data Source Triangulation. 2014. The use of triangulation in qualitative research. In Oncol Nurs Forum, Vol. 41. 545–7.",
      "doi": ""
    },
    {
      "text": "John Vines, Mark Blythe, Paul Dunphy, and Andrew Monk. 2011. Eighty something: banking for the older old. In Proceedings of HCI 2011 The 25th BCS Conference on Human Computer Interaction 25. 64–73.",
      "doi": ""
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An age-old problem: Examining the discourses of ageing in HCI and strategies for future research. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 1(2015), 1–27.",
      "doi": "10.1145/2696867"
    },
    {
      "text": "Kerryellen G Vroman, Sajay Arthanat, and Catherine Lysack. 2015. “Who over 65 is online?” Older adults’dispositions toward information communication technology. Computers in Human Behavior 43 (2015), 156–166.",
      "doi": "10.1016/j.chb.2014.10.018"
    },
    {
      "text": "Matthew Walsh. 2017. Matchmakers Give Chinese Seniors a Second Spring in Romance. https://www.sixthtone.com/news/1000328/matchmakers-give-chinese-seniors-a-second-spring-in-romance. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther, Brandon Van Der Heide, Lauren M Hamel, and Hillary C Shulman. 2009. Self-generated versus other-generated statements and impressions in computer-mediated communication: A test of warranting theory using Facebook. Communication research 36, 2 (2009), 229–253.",
      "doi": ""
    },
    {
      "text": "Shuaishuai Wang. 2020. Chinese affective platform economies: dating, live streaming, and performative labor on Blued. Media, Culture & Society 42, 4 (2020), 502–520.",
      "doi": ""
    },
    {
      "text": "Shuaishuai Wang. 2020. Live streaming, intimate situations, and the circulation of same-sex affect: Monetizing affective encounters on Blued. Sexualities 23, 5-6 (2020), 934–950.",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Lars Kulik, Elizabeth Ozanne, Alan Gruner, and John Downs. 2013. Older adults as digital content producers. In Proceedings of the SIGCHI conference on human factors in computing systems. 39–48.",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Sui-Lee Wee. 2019. China’s Seniors, Looking for Love, Head to the Park. https://www.nytimes.com/2019/12/24/world/asia/china-seniors-love-park.html. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2015. Timeline of online dating services. https://en.wikipedia.org/wiki/Timeline_of_online_dating_services. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2018. Chinese city tier system. https://en.wikipedia.org/wiki/Chinese_city_tier_system. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2021. Migration in China. https://en.wikipedia.org/wiki/Migration_in_China. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2021. Traditional Chinese marriage. https://en.wikipedia.org/wiki/Traditional_Chinese_marriage. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Bei Wu. 2020. Social isolation and loneliness among older adults in the context of COVID-19: a global challenge. Global health research and policy 5, 1 (2020), 1–3.",
      "doi": ""
    },
    {
      "text": "Alice Yan. 2020. It’s hard for women over 50 to find jobs: retirement age revision plans in China spark anger. https://www.scmp.com/lifestyle/family-relationships/article/3110984/its-hard-women-over-50-find-jobs-retirement-age. Accessed: 2021-12-25.",
      "doi": ""
    },
    {
      "text": "Zeng Yuli. 2017. China’s Love-Hate Relationship With Traditional Matchmaking. http://www.sixthtone.com/news/1000547/chinas-love-hate-relationship-with-traditional-matchmaking. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Phoebe Zhang. 2020. Chinese online dating groups help elderly find love and companionship. https://www.scmp.com/news/china/society/article/3103971/chinese-online-dating-groups-help-elderly-find-love-and. Accessed: 2021-07-13.",
      "doi": ""
    },
    {
      "text": "Donna M Zulman, Matthias Kirch, Kai Zheng, and Lawrence C An. 2011. Trust in the internet as a health resource among older adults: analysis of data from a nationally representative survey. Journal of medical Internet research 13, 1 (2011), e1552.",
      "doi": ""
    },
    {
      "text": "Doug Zytko, Guo Freeman, Sukeshini A Grandhi, Susan C Herring, and Quentin Jones. 2015. Enhancing evaluation of potential dates online through paired collaborative activities. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing. 1849–1859.",
      "doi": "10.1145/2675133.2675184"
    },
    {
      "text": "Douglas Zytko, Nicholas Furlo, Bailey Carlin, and Matthew Archer. 2021. Computer-mediated consent to sex: the context of Tinder. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–26.",
      "doi": "10.1145/3449288"
    },
    {
      "text": "Douglas Zytko, Sukeshini A Grandhi, and Quentin Jones. 2016. Online Dating Coaches’ User Evaluation Strategies. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1337–1343.",
      "doi": "10.1145/2851581.2892482"
    }
  ]
}