{
  "doi": "10.1145/3544548.3581255",
  "title": "Kaleidoscope: A Reflective Documentation Tool for a User Interface Design Course",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Documentation can support design work and create opportunities for learning and reflection. We explore how a novel documentation tool for a remote interaction design course provides insight into design process and integrates strategies from expert practice to support studio-style collaboration and reflection. Using Research through Design, we develop and deploy Kaleidoscope, an online tool for documenting design process, in an upper-level HCI class during the COVID-19 pandemic, iteratively developing it in response to student feedback and needs. We discuss key themes from the real-world deployment of Kaleidoscope, including: tensions between documentation and creation; effects of centralizing discussion; privacy and visibility in shared spaces; balancing evidence of achievement with feelings of overwhelm; and the effects of initial perceptions and incentives on tool usage. These successes and challenges provide insights to guide future tools for design documentation and HCI education that scaffold learning process as an equal partner to execution.",
  "tags": [
    "reflection",
    "studio",
    "documentation",
    "online learning",
    "HCI education"
  ],
  "authors": [
    {
      "name": "Sarah Sterman",
      "institution": "University of California, Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131975",
      "orcid": "0000-0002-9282-559X"
    },
    {
      "name": "Molly Jane Nicholas",
      "institution": "University of California, Berkeley, United States",
      "img": "/do/10.1145/contrib-99659163367/rel-imgonly/0-scarf-glasses-the-future-cropped.jpeg",
      "acmid": "99659163367",
      "orcid": "0000-0002-2830-3084"
    },
    {
      "name": "Janaki Vivrekar",
      "institution": "University of California, Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701703",
      "orcid": "0000-0001-7455-4717"
    },
    {
      "name": "Jessica R Mindel",
      "institution": "University of California, Berkeley, United States",
      "img": "/do/10.1145/contrib-99660782840/rel-imgonly/jessie_mindel.png",
      "acmid": "99660782840",
      "orcid": "0000-0001-5506-216X"
    },
    {
      "name": "Eric Paulos",
      "institution": "University of California, Berkeley, United States",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "2022. Canvas. https://www.instructure.com/canvas/try-canvas.",
      "doi": ""
    },
    {
      "text": "2022. Figma. https://www.figma.com.",
      "doi": ""
    },
    {
      "text": "2022. Miro. http://www.miro.com.",
      "doi": ""
    },
    {
      "text": "2022. Piazza. https://piazza.com/.",
      "doi": ""
    },
    {
      "text": "Teresa M Amabile. 2018. Creativity in context: Update to the social psychology of creativity. Routledge.",
      "doi": ""
    },
    {
      "text": "Gabrielle Benabdallah, Sam Bourgault, Nadya Peek, and Jennifer Jacobs. 2021. Remote Learners, Home Makers: How Digital Fabrication Was Taught Online During a Pandemic. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 350, 14 pages. https://doi.org/10.1145/3411764.3445450",
      "doi": "10.1145/3411764.3445450"
    },
    {
      "text": "Jorge Luis Borges. 1999. On exactitude in science. In Collected Fictions. Penguin, New York. Translated by Andrew Hurley.",
      "doi": ""
    },
    {
      "text": "David Boud and Elizabeth Molloy. 2013. Rethinking models of feedback for learning: the challenge of design. Assessment & Evaluation in higher education 38, 6 (2013), 698–712.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern-based qualitative analytic approaches. Counselling and Psychotherapy Research 21, 1 (2021), 37–47.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. To saturate or not to saturate? Questioning data saturation as a useful concept for thematic analysis and sample-size rationales. Qualitative research in sport, exercise and health 13, 2 (2021), 201–216.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. Sage.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Linda Liska Belgrave. 2007. Grounded theory. The Blackwell encyclopedia of sociology(2007).",
      "doi": ""
    },
    {
      "text": "Ricky Chen, Mychajlo Demko, Daragh Byrne, and Marti Louw. 2021. Probing Documentation Practices: Reflecting on Students’ Conceptions, Values, and Experiences with Documentation in Creative Inquiry. In Creativity and Cognition(Virtual Event, Italy) (C&C ’21). Association for Computing Machinery, New York, NY, USA, Article 32, 14 pages. https://doi.org/10.1145/3450741.3465391",
      "doi": "10.1145/3450741.3465391"
    },
    {
      "text": "Allan Collins and John Seely Brown. 1988. The Computer as a Tool for Learning Through Reflection. In Learning Issues for Intelligent Tutoring Systems, Heinz Mandl and Alan Lesgold (Eds.). Springer US, New York, NY, 1–18. https://doi.org/10.1007/978-1-4684-6350-7_1",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The psychology of optimal experience. Vol. 1990. Harper & Row New York.",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard. 2017. Instruments of inquiry: Understanding the nature and role of tools in design. International Journal of Design 11, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2012. Reflective Design Documentation. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 428–437. https://doi.org/10.1145/2317956.2318020",
      "doi": "10.1145/2317956.2318020"
    },
    {
      "text": "Carol S Dweck. 2008. Mindset: The new psychology of success. Random House Digital, Inc.",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. 2003. Design-oriented human-computer interaction. In Proceedings of the SIGCHI conference on Human factors in computing systems. 225–232. https://doi.org/10.1145/642611.642652",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Rowanne Fleck and Geraldine Fitzpatrick. 2010. Reflecting on reflection: framing a design landscape. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction. 216–223.",
      "doi": "10.1145/1952222.1952269"
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated Portfolios. Interactions 19, 4 (2012), 40–49. https://doi.org/10.1145/2212877.2212889",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI conference on human factors in computing systems. 937–946.",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Bruna Goveia da Rocha, Janne Spork, and Kristina Andersen. 2022. Making Matters: Samples and Documentation in Digital Craftsmanship. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction (Daejeon, Republic of Korea) (TEI ’22). Association for Computing Machinery, New York, NY, USA, Article 37, 10 pages. https://doi.org/10.1145/3490149.3502261",
      "doi": "10.1145/3490149.3502261"
    },
    {
      "text": "Gillian R Hayes. 2014. Knowing by doing: action research as an approach to HCI. In Ways of Knowing in HCI. Springer, 49–68.",
      "doi": ""
    },
    {
      "text": "Jim Hollan and Scott Stornetta. 1992. Beyond Being There. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 119–125. https://doi.org/10.1145/142750.142769",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Mary Beth Kery, Amber Horvath, and Brad Myers. 2017. Variolite: Supporting Exploratory Programming by Data Scientists. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1265–1276. https://doi.org/10.1145/3025453.3025626",
      "doi": "10.1145/3025453.3025626"
    },
    {
      "text": "Anna Keune, Naomi Thompson, Kylie Peppler, and Stephanie Chang. 2017. \"My portfolio helps my making\": Motivations and mechanisms for documenting creative projects. In \"Young & Creative: Digital Technologies Empowering Children in Everyday Life\", Ilana Eleá and Lothar Mikos (Eds.). Nordicom, University of Gothenburg, Chapter 12.",
      "doi": ""
    },
    {
      "text": "Joy Kim, Maneesh Agrawala, and Michael S. Bernstein. 2017. Mosaic: Designing Online Creative Communities for Sharing Works-in-Progress. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 246–258. https://doi.org/10.1145/2998181.2998195",
      "doi": "10.1145/2998181.2998195"
    },
    {
      "text": "Scott R. Klemmer, Björn Hartmann, and Leila Takayama. 2006. How Bodies Matter: Five Themes for Interaction Design. In Proceedings of the 6th conference on Designing Interactive Systems (University Park, PA, USA) (DIS ’06). Association for Computing Machinery, New York, NY, USA, 140–149. https://doi.org/10.1145/1142405.1142429",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "Scott R. Klemmer, Michael Thomsen, Ethan Phelps-Goodman, Robert Lee, and James A. Landay. 2002. Where Do Web Sites Come from?: Capturing and Interacting with Design History. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI ’02). ACM, New York, NY, USA, 1–8. https://doi.org/10.1145/503376.503378",
      "doi": "10.1145/503376.503378"
    },
    {
      "text": "Panayiotis Koutsabasis and Spyros Vosinakis. 2012. Rethinking HCI education for design: problem-based learning and virtual worlds at an HCI design studio. International Journal of Human-Computer Interaction 28, 8(2012), 485–499.",
      "doi": ""
    },
    {
      "text": "Chinmay E. Kulkarni, Michael S. Bernstein, and Scott R. Klemmer. 2015. PeerStudio: Rapid Peer Feedback Emphasizes Revision and Improves Performance. In Proceedings of the Second (2015) ACM Conference on Learning @ Scale (Vancouver, BC, Canada) (L@S ’15). Association for Computing Machinery, New York, NY, USA, 75–84. https://doi.org/10.1145/2724660.2724670",
      "doi": "10.1145/2724660.2724670"
    },
    {
      "text": "Bruno Latour. 1994. On technical mediation. Common knowledge 3, 2 (1994).",
      "doi": ""
    },
    {
      "text": "Xiaodong Lin, Cindy E. Hmelo, Charles K. Kinzer, and Teresa Secules. 1999. Designing technology to support reflection. Educational Technology Research and Development 47 (1999), 43–62.",
      "doi": ""
    },
    {
      "text": "Nic Lupfer. 2018. Multiscale Curation: Supporting Collaborative Design and Ideation. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 351–354. https://doi.org/10.1145/3197391.3205380",
      "doi": "10.1145/3197391.3205380"
    },
    {
      "text": "Nic Lupfer, Andruid Kerne, Rhema Linder, Hannah Fowler, Vijay Rajanna, Matthew Carrasco, and Alyssa Valdez. 2019. Multiscale Design Curation: Supporting Computer Science Students’ Iterative and Reflective Creative Processes. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C&C ’19). Association for Computing Machinery, New York, NY, USA, 233–245. https://doi.org/10.1145/3325480.3325483",
      "doi": "10.1145/3325480.3325483"
    },
    {
      "text": "Julia M. Markel and Philip J. Guo. 2020. Designing the Future of Experiential Learning Environments for a Post-COVID World: A Preliminary Case Study. (2020). https://www.microsoft.com/en-us/research/publication/designing-the-future-of-experiential-learning-environments-for-a-post-covid-world-a-preliminary-case-study/",
      "doi": ""
    },
    {
      "text": "Emma Mercier, Shelley Goldman, and Angela Booker. 2006. Collaborating to Learn, Learning to Collaborate: Finding the Balance in a Cross-Disciplinary Design Course. In Proceedings of the 7th International Conference on Learning Sciences (Bloomington, Indiana) (ICLS ’06). International Society of the Learning Sciences, 467–473.",
      "doi": ""
    },
    {
      "text": "Troy Nachtigall, Daniel Tetteroo, and Panos Markopoulos. 2018. A Five-Year Review of Methods, Purposes and Domains of the International Symposium on Wearable Computing. In Proceedings of the 2018 ACM International Symposium on Wearable Computers (Singapore, Singapore) (ISWC ’18). Association for Computing Machinery, New York, NY, USA, 48–55. https://doi.org/10.1145/3267242.3267272",
      "doi": "10.1145/3267242.3267272"
    },
    {
      "text": "Molly Jane Nicholas, Sarah Sterman, and Eric Paulos. 2022. Creative and Motivational Strategies Used by Expert Creative Practitioners. In Proceedings of the 2022 Conference on Creativity and Cognition. https://doi.org/10.1145/3527927.3532870",
      "doi": "10.1145/3527927.3532870"
    },
    {
      "text": "Vanessa Oguamanam, Taneisha Lee, Tom McKlin, Zane Cochran, Gregory Abowd, and Betsy DiSalvo. 2020. Cultural Clash: Exploring How Studio-Based Pedagogy Impacts Learning for Students in HCI Classrooms. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 1131–1142. https://doi.org/10.1145/3357236.3395544",
      "doi": "10.1145/3357236.3395544"
    },
    {
      "text": "Nadya Peek, Jennifer Jacobs, Wendy Ju, Neil Gershenfeld, and Tom Igoe. 2021. Making at a Distance: Teaching Hands-on Courses During the Pandemic. Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Sarah Quinton and Teresa Smallbone. 2010. Feeding forward: using feedback to promote student reflection and learning–a teaching model. Innovations in Education and Teaching International 47, 1(2010), 125–135.",
      "doi": ""
    },
    {
      "text": "Yolanda Jacobs Reimer and Sarah A Douglas. 2003. Teaching HCI design with the studio approach. Computer science education 13, 3 (2003), 191–205.",
      "doi": ""
    },
    {
      "text": "Kathryn Rivard and Haakon Faste. 2012. How Learning Works in Design Education: Educating for Creative Awareness through Formative Reflexivity. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 298–307. https://doi.org/10.1145/2317956.2318002",
      "doi": "10.1145/2317956.2318002"
    },
    {
      "text": "Wendy Roldan, Ziyue Li, Xin Gao, Sarah Kay Strickler, Allison Marie Hishikawa, Jon E. Froehlich, and Jason Yip. 2021. Pedagogical Strategies for Reflection in Project-based HCI Education with End Users. In Designing Interactive Systems Conference 2021. 1846–1860. https://doi.org/10.1145/3461778.3462113",
      "doi": "10.1145/3461778.3462113"
    },
    {
      "text": "Moushumi Sharmin, Brian P. Bailey, Cole Coats, and Kevin Hamilton. 2009. Understanding Knowledge Management Practices for Early Design Activity and Its Implications for Reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 2367–2376. https://doi.org/10.1145/1518701.1519064",
      "doi": "10.1145/1518701.1519064"
    },
    {
      "text": "Katie A Siek, Gillian R Hayes, Mark W Newman, and John C Tang. 2014. Field deployments: Knowing from using in context. In Ways of Knowing in HCI. Springer, 119–142.",
      "doi": ""
    },
    {
      "text": "Pieter Jan Stappers and Elisa Giaccardi. 2017. Research through design. The encyclopedia of human-computer interaction (2017), 1–94.",
      "doi": ""
    },
    {
      "text": "Sarah Sterman. 2022. Process-Sensitive Creativity Support Tools. Ph. D. Dissertation. EECS Department, University of California, Berkeley. http://www2.eecs.berkeley.edu/Pubs/TechRpts/2022/EECS-2022-207.html",
      "doi": ""
    },
    {
      "text": "Sarah Sterman, Molly Jane Nicholas, and Eric Paulos. 2022. Towards Creative Version Control. In Proceedings of the 2022 ACM Conference on Computer Supported Cooperative Work and Social Computing.",
      "doi": "10.1145/3555756"
    },
    {
      "text": "David Tinapple, Loren Olson, and John Sadauskas. 2013. CritViz: Web-based software supporting peer critique in large creative classrooms. Bulletin of the IEEE Technical Committee on Learning Technology 15, 1(2013), 29.",
      "doi": ""
    },
    {
      "text": "Cesar Torres, Sarah Sterman, Molly Nicholas, Richard Lin, Eric Pai, and Eric Paulos. 2018. Guardians of Practice: A Contextual Inquiry of Failure-Mitigation Strategies within Creative Practices. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 1259–1267. https://doi.org/10.1145/3196709.3196795",
      "doi": "10.1145/3196709.3196795"
    },
    {
      "text": "Mihaela Vorvoreanu, Colin M. Gray, Paul Parsons, and Nancy Rasche. 2017. Advancing UX Education: A Model for Integrated Studio Pedagogy. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1441–1446. https://doi.org/10.1145/3025453.3025726",
      "doi": "10.1145/3025453.3025726"
    },
    {
      "text": "Lauren Wilcox, Betsy DiSalvo, Dick Henneman, and Qiaosi Wang. 2019. Design in the HCI Classroom: Setting a Research Agenda. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 871–883. https://doi.org/10.1145/3322276.3322381",
      "doi": "10.1145/3322276.3322381"
    },
    {
      "text": "Lisa Yan, Annie Hu, and Chris Piech. 2019. Pensieve: Feedback on Coding Process for Novices. In Proceedings of the 50th ACM Technical Symposium on Computer Science Education (Minneapolis, MN, USA) (SIGCSE ’19). Association for Computing Machinery, New York, NY, USA, 253–259. https://doi.org/10.1145/3287324.3287483",
      "doi": "10.1145/3287324.3287483"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2014. Research through design in HCI. In Ways of Knowing in HCI. Springer, 167–189.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through Design as a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 493–502. https://doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}