{
  "doi": "10.1145/3544548.3580952",
  "title": "ProxSituated Visualization: An Extended Model of Situated Visualization using Proxies for Physical Referents",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [],
  "abstract": "Existing situated visualization models assume the user is able to directly interact with the objects and spaces to which the data refers (known as physical referents). We review a growing body of work exploring scenarios where the user interacts with a proxy representation of the physical referent rather than immediately with the object itself. This introduces a complex mixture of immediate situatedness and proxies of situatedness that goes beyond the expressiveness of current models. We propose an extended model of situated visualization that encompasses Immediate Situated Visualization and ProxSituated (Proxy of Situated) Visualization. Our model describes a set of key entities involved in proxSituated scenarios and important relationships between them. From this model, we derive design dimensions and apply them to existing situated visualization work. The resulting design space allows us to describe and evaluate existing scenarios, as well as to creatively generate new conceptual scenarios.",
  "authors": [
    {
      "name": "Kadek Ananta Satriadi",
      "institution": "University of South Australia, Australia and Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659644394",
      "orcid": "0000-0002-2230-8677"
    },
    {
      "name": "Andrew Cunningham",
      "institution": "University of South Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100562644",
      "orcid": "0000-0003-2536-3011"
    },
    {
      "name": "Ross T. Smith",
      "institution": "University of South Australia, Australia",
      "img": "/do/10.1145/contrib-81100078983/rel-imgonly/ross048_bw.jpg",
      "acmid": "81100078983",
      "orcid": "0000-0002-9044-9199"
    },
    {
      "name": "Tim Dwyer",
      "institution": "Monash University, Australia",
      "img": "/do/10.1145/contrib-81100013275/rel-imgonly/tim-dwyer-2016-small.jpg",
      "acmid": "81100013275",
      "orcid": "0000-0002-9076-9571"
    },
    {
      "name": "Adam Drogemuller",
      "institution": "Wearable Computing Lab, University of South Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261736",
      "orcid": "0000-0002-9433-0259"
    },
    {
      "name": "Bruce H. Thomas",
      "institution": "University of South Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100411664",
      "orcid": "0000-0002-9148-085X"
    }
  ],
  "references": [
    {
      "text": "Hala Almukhalfi and Sarah Goodwin. 2021. Visually Communicating Microgrid Complexity. In The 23rd International Conference on Information Integration and Web Intelligence (Linz, Austria). Association for Computing Machinery, New York, NY, USA, 614–619.",
      "doi": ""
    },
    {
      "text": "Luis Alonso, Yan Ryan Zhang, Arnaud Grignard, Ariel Noyman, Yasushi Sakai, Markus ElKatsha, Ronan Doorley, and Kent Larson. 2018. Cityscope: a data-driven interactive simulation tool for urban design. Use case volpe. In International conference on complex systems. Springer, Springer, Cham, 253–261.",
      "doi": ""
    },
    {
      "text": "S Sandra Bae, Clement Zheng, Mary Etta West, Ellen Yi-Luen Do, Samuel Huron, and Danielle Albers Szafir. 2022. Making Data Tangible: A Cross-disciplinary Design Space for Data Physicalization. In CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3491102.3501939",
      "doi": "10.1145/3491102.3501939"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2000. Instrumental Interaction: An Interaction Model for Designing Post-WIMP User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI ’00). Association for Computing Machinery, New York, NY, USA, 446–453. https://doi.org/10.1145/332040.332473",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2004. Designing Interaction, Not Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (Gallipoli, Italy) (AVI ’04). Association for Computing Machinery, New York, NY, USA, 15–22. https://doi.org/10.1145/989863.989865",
      "doi": "10.1145/989863.989865"
    },
    {
      "text": "Mark Billinghurst, Hirokazu Kato, and Ivan Poupyrev. 2001. The MagicBook: a transitional AR interface. Computers & Graphics 25, 5 (2001), 745–753. https://doi.org/10.1016/S0097-8493(01)00117-0",
      "doi": ""
    },
    {
      "text": "Nathalie Bressa, Henrik Korsgaard, Aurélien Tabard, Steven Houben, and Jo Vermeulen. 2021. What’s the Situation with Situated Visualization? A Survey and Perspectives on Situatedness. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 107–117. https://doi.org/10.1109/TVCG.2021.3114835",
      "doi": "10.1109/TVCG.2021.3114835"
    },
    {
      "text": "Nathalie Bressa, Kendra Wannamaker, Henrik Korsgaard, Wesley Willett, and Jo Vermeulen. 2019. Sketching and Ideation Activities for Situated Visualization Design(DIS ’19). Association for Computing Machinery, New York, NY, USA, 173–185. https://doi.org/10.1145/3322276.3322326",
      "doi": "10.1145/3322276.3322326"
    },
    {
      "text": "Federica Bucchieri, Lijie Yao, and Petra Isenberg. 2022. Situated Visualization in Motion for Video Games. In EuroVis 2022 - Posters, Michael Krone, Simone Lenti, and Johanna Schmidt (Eds.). The Eurographics Association. https://doi.org/10.2312/evp.20221119",
      "doi": ""
    },
    {
      "text": "Wolfgang Büschel, Anke Lehmann, and Raimund Dachselt. 2021. MIRIA: A Mixed Reality Toolkit for the In-Situ Visualization and Analysis of Spatio-Temporal Interaction Data(CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 470, 15 pages. https://doi.org/10.1145/3411764.3445651",
      "doi": "10.1145/3411764.3445651"
    },
    {
      "text": "Marco Cavallo and Angus G. Forbes. 2019. CAVE-AR: A VR Authoring System to Interactively Design, Simulate, and Debug Multi-user AR Experiences. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Cham, 872–873. https://doi.org/10.1109/VR.2019.8798148",
      "doi": ""
    },
    {
      "text": "Jeroen Ceyssens, Sven Coppers, and Davy Vanacken. 2020. Towards Traceable Design Rationale in Augmented Reality. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382835",
      "doi": "10.1145/3334480.3382835"
    },
    {
      "text": "Edwin Chan, Craig Anslow, Teddy Seyed, and Frank Maurer. 2016. Envisioning the emergency operations centre of the future. In Collaboration Meets Interactive Spaces. Springer, Cham, 349–372. https://doi.org/10.1007/978-3-319-45853-3_15",
      "doi": ""
    },
    {
      "text": "Ed Huai-hsin Chi. 2000. A taxonomy of visualization techniques using the data state reference model. In IEEE Symposium on Information Visualization 2000. INFOVIS 2000. Proceedings. IEEE, IEEE, 69–75. https://doi.org/10.1109/INFVIS.2000.885092",
      "doi": ""
    },
    {
      "text": "Haley Coppins, Tudor Tibu, Jack Shen-Kuen Chang, Ali Mazalek, and Frauke Zeller. 2016. Combining Mobile, Tangible and Virtual World Platforms to Support Participatory Campus Planning. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (Niagara Falls, Ontario, Canada) (ISS ’16). Association for Computing Machinery, New York, NY, USA, 325–330. https://doi.org/10.1145/2992154.2996775",
      "doi": "10.1145/2992154.2996775"
    },
    {
      "text": "Corentin Coupry, Sylvain Noblecourt, Paul Richard, David Baudry, and David Bigaud. 2021. BIM-Based digital twin and XR devices to improve maintenance procedures in smart buildings: A literature review. Applied Sciences 11, 15 (2021), 6810. https://doi.org/10.3390/app11156810",
      "doi": ""
    },
    {
      "text": "Andrew Cunningham, Jonathon Derek Hart, Ulrich Engelke, Matt Adcock, and Bruce H. Thomas. 2021. Towards Embodied Interaction for Geospatial Energy Sector Analytics in Immersive Environments. In Proceedings of the Twelfth ACM International Conference on Future Energy Systems (Virtual Event, Italy) (e-Energy ’21). Association for Computing Machinery, New York, NY, USA, 396–400. https://doi.org/10.1145/3447555.3466602",
      "doi": "10.1145/3447555.3466602"
    },
    {
      "text": "Shaozhang Dai, Jim Smiley, Tim Dwyer, Barrett Ens, and Lonni Besancon. 2022. RoboHapalytics: A Robot Assisted Haptic Controller for Immersive Analytics. IEEE Transactions on Visualization and Computer Graphics (2022), 1–11. https://doi.org/10.1109/TVCG.2022.3209433",
      "doi": ""
    },
    {
      "text": "Kurtis Danyluk, Barrett Ens, Bernhard Jenny, and Wesley Willett. 2021. A Design Space Exploration of Worlds in Miniature. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 122, 15 pages. https://doi.org/10.1145/3411764.3445098",
      "doi": "10.1145/3411764.3445098"
    },
    {
      "text": "Fábio Matoseiro Dinis, Ana Sofia Guimarães, Bárbara Rangel Carvalho, and João Pedro Poças Martins. 2017. Virtual and augmented reality game-based applications to civil engineering education. In 2017 IEEE Global Engineering Education Conference (EDUCON). IEEE, 1683–1688.",
      "doi": ""
    },
    {
      "text": "Alix Ducros, Clemens N. Klokmose, and Aurélien Tabard. 2019. Situated Sketching and Enactment for Pervasive Displays. In Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces (Daejeon, Republic of Korea) (ISS ’19). Association for Computing Machinery, New York, NY, USA, 217–228. https://doi.org/10.1145/3343055.3359702",
      "doi": "10.1145/3343055.3359702"
    },
    {
      "text": "Neven AM ElSayed, Ross T Smith, Kim Marriott, and Bruce H Thomas. 2018. Context-aware design pattern for situated analytics: Blended Model View Controller. Journal of Visual Languages & Computing 44 (2018), 1–12. https://doi.org/10.1016/j.jvlc.2017.11.001",
      "doi": ""
    },
    {
      "text": "Neven AM Elsayed, Bruce H Thomas, Ross T Smith, Kim Marriott, and Julia Piantadosi. 2015. Using augmented reality to support situated analytics. In 2015 IEEE Virtual Reality (VR). IEEE, 175–176. https://doi.org/10.1109/VR.2015.7223352",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Fraser Anderson, Tovi Grossman, Michelle Annett, Pourang Irani, and George Fitzmaurice. 2017. Ivy: Exploring Spatially Situated Visual Programming for Authoring and Understanding Intelligent Environments. In Proceedings of the 43rd Graphics Interface Conference (Edmonton, Alberta, Canada) (GI ’17). Canadian Human-Computer Communications Society, Waterloo, CAN, 156–162.",
      "doi": "10.5555/3141475.3141507"
    },
    {
      "text": "Barrett Ens, Benjamin Bach, Maxime Cordeil, Ulrich Engelke, Marcos Serrano, Wesley Willett, Arnaud Prouzeau, Christoph Anthes, Wolfgang Büschel, Cody Dunne, Tim Dwyer, Jens Grubert, Jason H. Haga, Nurit Kirshenbaum, Dylan Kobayashi, Tica Lin, Monsurat Olaosebikan, Fabian Pointecker, David Saffo, Nazmus Saquib, Dieter Schmalstieg, Danielle Albers Szafir, Matt Whitlock, and Yalong Yang. 2021. Grand Challenges in Immersive Analytics(CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 459, 17 pages. https://doi.org/10.1145/3411764.3446866",
      "doi": "10.1145/3411764.3446866"
    },
    {
      "text": "Barrett Ens, Maxime Cordeil, Chris North, Tim Dwyer, Lonni Besançon, Arnaud Prouzeau, Jiazhou Liu, Andrew Cunningham, Adam Drogemuller, Kadek Ananta Satriadi, 2022. Immersive Analytics 2.0: Spatial and Embodied Sensemaking. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–7. https://doi.org/10.1145/3491101.3503726",
      "doi": "10.1145/3491101.3503726"
    },
    {
      "text": "Barrett Ens, Sarah Goodwin, Arnaud Prouzeau, Fraser Anderson, Florence Y Wang, Samuel Gratzl, Zac Lucarelli, Brendan Moyle, Jim Smiley, and Tim Dwyer. 2020. Uplift: A tangible and immersive tabletop system for casual collaborative visual analytics. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 1193–1203.",
      "doi": ""
    },
    {
      "text": "Omid Ettehadi, Fraser Anderson, Adam Tindale, and Sowmya Somanath. 2021. Documented: Embedding Information onto and Retrieving Information from 3D Printed Objects. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 424, 11 pages. https://doi.org/10.1145/3411764.3445551",
      "doi": "10.1145/3411764.3445551"
    },
    {
      "text": "Aluna Everitt and Jason Alexander. 2017. PolySurface: A Design Approach for Rapid Prototyping of Shape-Changing Displays Using Semi-Solid Surfaces. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 1283–1294. https://doi.org/10.1145/3064663.3064677",
      "doi": "10.1145/3064663.3064677"
    },
    {
      "text": "Andreas Rene Fender and Christian Holz. 2022. Causality-Preserving Asynchronous Reality. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 634, 15 pages. https://doi.org/10.1145/3491102.3501836",
      "doi": "10.1145/3491102.3501836"
    },
    {
      "text": "Vicente Ferrer, Alex Perdomo, Hazem Rashed-Ali, Carmen Fies, and John Quarles. 2013. How does usability impact motivation in augmented reality serious games for education?. In 2013 5th International Conference on Games and virtual worlds for serious applications (VS-GAMES). IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Philipp Fleck, Aimee Sousa Calepso, Sebastian Hubenschmid, Michael Sedlmair, and Dieter Schmalstieg. 2022. RagRug: A Toolkit for Situated Analytics. IEEE Transactions on Visualization and Computer Graphics (2022), 1–1. https://doi.org/10.1109/TVCG.2022.3157058",
      "doi": ""
    },
    {
      "text": "B. Fröhler, C. Anthes, F. Pointecker, J. Friedl, D. Schwajda, A. Riegler, S. Tripathi, C. Holzmann, M. Brunner, H. Jodlbauer, H.-C. Jetter, and C. Heinzl. 2022. A Survey on Cross-Virtuality Analytics. Computer Graphics Forum 41, 1, 465–494. https://doi.org/10.1111/cgf.14447 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.14447",
      "doi": ""
    },
    {
      "text": "City Science Group. NA. CityScope Project. (NA). https://www.media.mit.edu/projects/cityscope/overview/ [Accessed on 6 August 2022].",
      "doi": ""
    },
    {
      "text": "Jascha Grübel, Tyler Thrash, Leonel Aguilar, Michal Gath-Morad, Julia Chatain, Robert W Sumner, Christoph Hölscher, and Victor R Schinazi. 2022. The Hitchhiker’s Guide to Fused Twins: A Review of Access to Digital Twins In Situ in Smart Cities. Remote Sensing 14, 13 (2022), 3095. https://doi.org/10.3390/rs14133095",
      "doi": ""
    },
    {
      "text": "Julia Hertel, Sukran Karaosmanoglu, Susanne Schmidt, Julia Bräker, Martin Semmann, and Frank Steinicke. 2021. A Taxonomy of Interaction Techniques for Immersive Augmented Reality based on an Iterative Literature Review. In 2021 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 431–440. https://doi.org/10.1109/ISMAR52148.2021.00060",
      "doi": ""
    },
    {
      "text": "I-Hsuan Hsu, Xiu-Wei Zhang, and Fong-Ming Shyu. 2018. An application for geovisualization with virtual reality built on Unity3D. In 2018 IEEE International Conference on Applied System Invention (ICASI). IEEE, 1082–1085.",
      "doi": ""
    },
    {
      "text": "Sebastian Hubenschmid, Jonathan Wieland, Daniel Immanuel Fink, Andrea Batch, Johannes Zagermann, Niklas Elmqvist, and Harald Reiterer. 2022. ReLive: Bridging In-Situ and Ex-Situ Visual Analytics for Analyzing Mixed Reality User Studies. In CHI Conference on Human Factors in Computing Systems. 1–20. https://doi.org/10.1145/3491102.3517550",
      "doi": "10.1145/3491102.3517550"
    },
    {
      "text": "Carmen Hull, Søren Knudsen, Sheelagh Carpendale, and Wesley Willett. 2022. Simultaneous Worlds: Supporting Fluid Exploration of Multiple Data Sets via Physical Models. In Graphics Interface 2022.",
      "doi": ""
    },
    {
      "text": "Carmen Hull and Wesley Willett. 2017. Building with data: Architectural models as inspiration for data physicalization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1217–1264. https://doi.org/10.1145/3025453.3025850",
      "doi": "10.1145/3025453.3025850"
    },
    {
      "text": "Hiroshi Ishii, John Underkoffler, Dan Chak, Ben Piper, Eran Ben-Joseph, Luke Yeung, and Zahra Kanji. 2002. Augmented urban planning workbench: overlaying drawings, physical models and digital simulation. In Proceedings. International Symposium on Mixed and Augmented Reality. IEEE, 203–211.",
      "doi": ""
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization(CHI ’15). Association for Computing Machinery, New York, NY, USA, 3227–3236. https://doi.org/10.1145/2702123.2702180",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Andreas Künz, Sabrina Rosmann, Enrica Loria, and Johanna Pirker. 2022. The Potential of Augmented Reality for Digital Twins: A Literature Review. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 389–398. https://doi.org/10.1109/VR51125.2022.00058",
      "doi": ""
    },
    {
      "text": "Carol LaFayette, Frederic I Parke, Carl J Pierce, Tatsuya Nakamura, and Lauren Simpson. 2008. Atta texana leafcutting ant colony: a view underground. In ACM SIGGRAPH 2008 new tech demos. 1–1. https://doi.org/10.1145/1401615.1401621",
      "doi": "10.1145/1401615.1401621"
    },
    {
      "text": "Bokyung Lee, Michael Lee, Jeremy Mogk, Rhys Goldstein, Jacobo Bibliowicz, Frederik Brudy, and Alexander Tessier. 2021. Designing a Multi-Agent Occupant Simulation System to Support Facility Planning and Analysis for COVID-19. In Designing Interactive Systems Conference 2021. 15–30.",
      "doi": ""
    },
    {
      "text": "Nico Li, Ehud Sharlin, and Mario Costa Sousa. 2017. Duopography: Using back-of-device multi-touch input to manipulate spatial data on mobile tangible interactive topography. In SIGGRAPH Asia 2017 Mobile Graphics & Interactive Applications. 1–6.",
      "doi": "10.1145/3132787.3139197"
    },
    {
      "text": "Joshua Lifton and Joseph A Paradiso. 2009. Dual reality: Merging the real and virtual. In International conference on facets of virtual environments. Springer, 12–28. https://doi.org/10.1007/978-3-642-11743-5_2",
      "doi": ""
    },
    {
      "text": "Tica Lin, Zhutian Chen, Yalong Yang, Daniele Chiappalupi, Johanna Beyer, and Hanspeter Pfister. 2022. The Quest for Omnioculars: Embedded Visualization for Augmenting Basketball Game Viewing Experiences. To appear in IEEE Transactions on Visualization and Computer Graphics (2022).",
      "doi": ""
    },
    {
      "text": "Tica Lin, Zhutian Chen, Yalong Yang, Daniele Chiappalupi, Johanna Beyer, and Hanspeter Pfister. 2022. The Quest for Omnioculars: Embedded Visualization for Augmenting Basketball Game Viewing Experiences. https://doi.org/10.48550/ARXIV.2209.00202",
      "doi": ""
    },
    {
      "text": "Tica Lin, Yalong Yang, Johanna Beyer, and Hanspeter Pfister. 2020. SportsXR–Immersive Analytics in Sports. arXiv preprint arXiv:2004.08010(2020). https://doi.org/10.48550/arXiv.2004.08010",
      "doi": ""
    },
    {
      "text": "Wei Hong Lo, Stefanie Zollmann, and Holger Regenbrecht. 2021. From off-site to on-site: A Flexible Framework for XR Prototyping in Sports Spectating. In 2021 36th International Conference on Image and Vision Computing New Zealand (IVCNZ). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Wei Hong Lo, Stefanie Zollmann, Holger Regenbrecht, and Moritz Loos. 2019. From Lab to Field: Demonstrating Mixed Reality Prototypes for Augmented Sports Experiences. In The 17th International Conference on Virtual-Reality Continuum and its Applications in Industry. 1–2. https://doi.org/10.1145/3359997.3365728",
      "doi": "10.1145/3359997.3365728"
    },
    {
      "text": "Markus Löchtefeld, Frederik Wiehr, and Sven Gehring. 2017. Analysing the effect of tangibile user interfaces on spatial memory. In Proceedings of the 5th Symposium on Spatial User Interaction. 78–81.",
      "doi": "10.1145/3131277.3132172"
    },
    {
      "text": "Allan MacLean, Richard M Young, Victoria ME Bellotti, and Thomas P Moran. 1996. Questions, options, and criteria: Elements of design space analysis. In Design rationale. CRC Press, 53–105.",
      "doi": ""
    },
    {
      "text": "Tahir Mahmood, Willis Fulmer, Neelesh Mungoli, Jian Huang, and Aidong Lu. 2019. Improving information sharing and collaborative analysis for remote geospatial visualization using mixed reality. In 2019 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 236–247.",
      "doi": ""
    },
    {
      "text": "Narges Mahyar, Kelly J Burke, Jialiang Xiang, Siyi Meng, Kellogg S Booth, Cynthia L Girling, and Ronald W Kellett. 2016. Ud co-spaces: A table-centred multi-display environment for public engagement in urban design charrettes. In Proceedings of the 2016 ACM international conference on interactive surfaces and spaces. 109–118.",
      "doi": "10.1145/2992154.2992163"
    },
    {
      "text": "Panos Markopoulos, Boris De Ruyter, and Wendy E Mackay. 2005. Awareness systems: known results, theory, concepts and future challenges. In CHI’05 Extended Abstracts on Human Factors in Computing Systems. 2128–2129. https://doi.org/10.1145/1056808.1057121",
      "doi": "10.1145/1056808.1057121"
    },
    {
      "text": "Bob Martens. 2008. Endoscopy without Endoscopes: Alternatives for Gaining Shared-IN-sights at an Eye-level. (2008).",
      "doi": ""
    },
    {
      "text": "Nuno Martins, Bernardo Marques, Paulo Dias, and Beatriz Santos. 2022. Augmenting the Reality of Situated Visualization. 26 International Conference Information Visualisation.",
      "doi": ""
    },
    {
      "text": "Florian Mathis, Joseph O’Hagan, Kami Vaniea, and Mohamed Khamis. 2022. Stay Home! Conducting Remote Usability Evaluations of Novel Real-World Authentication Systems Using Virtual Reality. In Proceedings of the 2022 International Conference on Advanced Visual Interfaces. 1–9.",
      "doi": "10.1145/3531073.3531087"
    },
    {
      "text": "Florian Mathis, Xuesong Zhang, Joseph O’Hagan, Daniel Medeiros, Pejman Saeghe, Mark McGill, Stephen Brewster, and Mohamed Khamis. 2021. Remote xr studies: The golden future of hci research?(2021).",
      "doi": ""
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A taxonomy of mixed reality visual displays. IEICE TRANSACTIONS on Information and Systems 77, 12 (1994), 1321–1329.",
      "doi": ""
    },
    {
      "text": "Andrew Vande Moere and Dan Hill. 2012. Designing for the situated and public visualization of urban data. Journal of Urban Technology 19, 2 (2012), 25–46.",
      "doi": ""
    },
    {
      "text": "Luiz Morais, Yvonne Jansen, Nazareno Andrade, and Pierre Dragicevic. 2020. Showing data about people: A design space of anthropographics. IEEE Transactions on Visualization and Computer Graphics (2020). https://doi.org/10.1109/tvcg.2020.3023013",
      "doi": ""
    },
    {
      "text": "Michael Nebeling, Maximilian Speicher, Xizi Wang, Shwetha Rajaram, Brian D Hall, Zijian Xie, Alexander RE Raistrick, Michelle Aebersold, Edward G Happ, Jiayin Wang, 2020. MRAT: The mixed reality analytics toolkit. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3313831.3376330",
      "doi": "10.1145/3313831.3376330"
    },
    {
      "text": "Rhys Newbury, Kadek Ananta Satriadi, Jesse Bolton, Jiazhou Liu, Maxime Cordeil, Arnaud Prouzeau, and Bernhard Jenny. 2021. Embodied gesture interaction for immersive maps. Cartography and Geographic Information Science 48, 5 (2021), 417–431.",
      "doi": ""
    },
    {
      "text": "Huyen Nguyen, Sarah Ketchell, Ulrich Engelke, Bruce H Thomas, and Paulo A de Souza. 2017. HoloBee: Augmented Reality Based Bee Drift Analysis.. In ISMAR Adjunct. 87–92.",
      "doi": ""
    },
    {
      "text": "Matthew J Page, Joanne E McKenzie, Patrick M Bossuyt, Isabelle Boutron, Tammy C Hoffmann, Cynthia D Mulrow, Larissa Shamseer, Jennifer M Tetzlaff, Elie A Akl, Sue E Brennan, 2021. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. Systematic reviews 10, 1 (2021), 1–11. https://doi.org/10.1186/s13643-021-01626-4",
      "doi": ""
    },
    {
      "text": "Payod Panda, Byungsoo Kim, Sana Behnam-Asl, and Elif Sener. 2021. Immersive Analytics: A User-Centered Perspective. In Proceedings of the 27th ACM Symposium on Virtual Reality Software and Technology. 1–3. https://doi.org/10.1145/3489849.3489951",
      "doi": "10.1145/3489849.3489951"
    },
    {
      "text": "Johanna Pirker, Enrica Loria, Saeed Safikhani, Andreas Künz, and Sabrina Rosmann. 2022. Immersive Virtual Reality for Virtual and Digital Twins: A Literature Review to Identify State Of The Art and Perspectives. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 114–115. https://doi.org/10.1109/VRW55335.2022.00035",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Gun A Lee, Jonathon D Hart, Barrett Ens, Robert W Lindeman, Bruce H Thomas, and Mark Billinghurst. 2018. Mini-me: An adaptive avatar for mixed reality remote collaboration. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13. https://doi.org/10.1145/3173574.3173620",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "Arnaud Prouzeau, Yuchen Wang, Barrett Ens, Wesley Willett, and Tim Dwyer. 2020. Corsican twin: Authoring in situ augmented reality visualisations in virtual reality. In Proceedings of the International Conference on Advanced Visual Interfaces. 1–9.",
      "doi": "10.1145/3399715.3399743"
    },
    {
      "text": "Xun Qian, Fengming He, Xiyun Hu, Tianyi Wang, Ananya Ipsita, and Karthik Ramani. 2022. ScalAR: Authoring Semantically Adaptive Augmented Reality Experiences in Virtual Reality. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": ""
    },
    {
      "text": "Quang Quach and Bernhard Jenny. 2020. Immersive visualization with bar graphics. Cartography and Geographic Information Science 47, 6 (2020), 471–480.",
      "doi": ""
    },
    {
      "text": "Carolin Reichherzer, Andrew Cunningham, Jason Barr, Tracey Coleman, Kurt McManus, Dion Sheppard, Scott Coussens, Mark Kohler, Mark Billinghurst, and Bruce H. Thomas. 2022. Supporting Jury Understanding of Expert Evidence in a Virtual Environment. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 615–624. https://doi.org/10.1109/VR51125.2022.00082",
      "doi": ""
    },
    {
      "text": "Jan Richter, Bruce H. Thomas, Maki Sugimoto, and Masahiko Inami. 2007. Remote Active Tangible Interactions. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (Baton Rouge, Louisiana) (TEI ’07). Association for Computing Machinery, New York, NY, USA, 39–42. https://doi.org/10.1145/1226969.1226977",
      "doi": "10.1145/1226969.1226977"
    },
    {
      "text": "Joel Murithi Runji, Yun-Ju Lee, and Chih-Hsing Chu. 2022. User Requirements Analysis on Augmented Reality-Based Maintenance in Manufacturing. Journal of Computing and Information Science in Engineering 22, 5(2022), 050901. https://doi.org/10.1115/1.4053410",
      "doi": ""
    },
    {
      "text": "Kadek Ananta Satriadi, Andrew Cunningham, Bruce H. Thomas, Adam Drogemuller, Antoine Odi, Niki Patel, Cathlyn Aston, and Ross T. Smith. 2022. Augmented Scale Models: Presenting Multivariate Data Around Physical Scale Models in Augmented Reality. In 2022 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). 54–63. https://doi.org/10.1109/ISMAR55827.2022.00019",
      "doi": ""
    },
    {
      "text": "Dieter Schmalstieg and Tobias Hollerer. 2016. Augmented reality: principles and practice. Addison-Wesley Professional.",
      "doi": ""
    },
    {
      "text": "Ankit Shringi, Mehrdad Arashpour, and Arnaud Prouzeau. 2020. Constructible design for off-site prefabricated structures in industrial environments: Review of mixed reality applications. In ISARC. Proceedings of the International Symposium on Automation and Robotics in Construction, Vol. 37. IAARC Publications, 1074–1081. https://doi.org/10.22260/ISARC2020/0148",
      "doi": ""
    },
    {
      "text": "Ronell Sicat, Jiabao Li, JunYoung Choi, Maxime Cordeil, Won-Ki Jeong, Benjamin Bach, and Hanspeter Pfister. 2018. DXR: A toolkit for building immersive data visualizations. IEEE transactions on visualization and computer graphics 25, 1(2018), 715–725.",
      "doi": "10.1109/TVCG.2018.2865152"
    },
    {
      "text": "Richard Skarbez, Missie Smith, and Mary C Whitton. 2021. Revisiting milgram and kishino’s reality-virtuality continuum. Frontiers in Virtual Reality 2 (2021), 27. https://doi.org/10.3389/frvir.2021.647997",
      "doi": ""
    },
    {
      "text": "Mikael B Skov, Jesper Kjeldskov, Jeni Paay, Niels Husted, Jacob Nørskov, and Kenneth Pedersen. 2013. Designing on-site: Facilitating participatory contextual architecture with mobile phones. Pervasive and Mobile Computing 9, 2 (2013), 216–227.",
      "doi": "10.1016/j.pmcj.2012.05.004"
    },
    {
      "text": "Dorothé Smit, Thomas Grah, Martin Murer, Vincent van Rheden, and Manfred Tscheligi. 2018. Macroscope: First-person perspective in physical scale models. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction. 253–259.",
      "doi": "10.1145/3173225.3173276"
    },
    {
      "text": "Stephen Snow, Jason Weigel, Alex Balson, Stephen Viller, and Mashhuda Glencross. 2021. User-centred design of a grid health virtual reality tabletop for energy networks. In 2021 IEEE PES Innovative Smart Grid Technologies-Asia (ISGT Asia). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Hannah Snyder. 2019. Literature review as a research methodology: An overview and guidelines. Journal of business research 104 (2019), 333–339. https://doi.org/10.1016/j.jbusres.2019.07.039",
      "doi": ""
    },
    {
      "text": "Richard Stoakley, Matthew J Conway, and Randy Pausch. 1995. Virtual reality on a WIM: interactive worlds in miniature. In Proceedings of the SIGCHI conference on Human factors in computing systems. 265–272. https://doi.org/10.1145/223904.223938",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Ivan E. Sutherland. 1965. The Ultimate Display. In Proceedings of the IFIP Congress. 506–508.",
      "doi": ""
    },
    {
      "text": "Markus Tatzgern. 2015. Situated visualization in augmented reality. Graz University of Technology(2015).",
      "doi": ""
    },
    {
      "text": "Bruce H Thomas, Gregory F Welch, Pierre Dragicevic, Niklas Elmqvist, Pourang Irani, Yvonne Jansen, Dieter Schmalstieg, Aurélien Tabard, Neven AM ElSayed, Ross T Smith, 2018. Situated Analytics. In Immersive analytics. Vol. 11190. Springer. https://doi.org/10.1007/978-3-030-01388-2",
      "doi": ""
    },
    {
      "text": "Ben Thompson, Laura Levy, Amelia Lambeth, David Byrd, Joelle Alcaidinho, Iulian Radu, and Maribeth Gandy. 2016. Participatory design of STEM education AR experiences for heterogeneous student groups: exploring dimensions of tangibility, simulation, and interaction. In 2016 IEEE International Symposium on Mixed and Augmented Reality (ISMAR-Adjunct). IEEE, 53–58.",
      "doi": ""
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. 1999. Urp: a luminous-tangible workbench for urban planning and design. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 386–393.",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Johan Wagemans, James H Elder, Michael Kubovy, Stephen E Palmer, Mary A Peterson, Manish Singh, and Rüdiger von der Heydt. 2012. A century of Gestalt psychology in visual perception: I. Perceptual grouping and figure–ground organization. Psychological bulletin 138, 6 (2012), 1172. https://doi.org/10.1037/a0029333",
      "doi": ""
    },
    {
      "text": "Will Walker, Hyungie Sung, Chris Kevin Ong, and Federico Casalegno. 2017. Exploring spatial meaning with a tangible map. In Proceedings of the 6th ACM International Symposium on Pervasive Displays. 1–8.",
      "doi": "10.1145/3078810.3078826"
    },
    {
      "text": "Sean White and Steven Feiner. 2009. SiteLens: situated visualization techniques for urban site visits. In Proceedings of the SIGCHI conference on human factors in computing systems. 1117–1120. https://doi.org/10.1145/1518701.1518871",
      "doi": "10.1145/1518701.1518871"
    },
    {
      "text": "Sean White, Steven Feiner, and Jason Kopylec. 2006. Virtual vouchers: Prototyping a mobile augmented reality user interface for botanical species identification. In 3D User Interfaces (3DUI’06). IEEE, 119–126. https://doi.org/10.1109/VR.2006.145",
      "doi": "10.1109/VR.2006.145"
    },
    {
      "text": "Sean Michael White. 2009. Interaction and presentation techniques for situated visualization. Columbia University.",
      "doi": ""
    },
    {
      "text": "Matt Whitlock, Danielle Albers Szafir, and Kenny Gruchalla. 2020. HydrogenAR: Interactive Data-Driven Presentation of Dispenser Reliability. In 2020 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 704–712.",
      "doi": ""
    },
    {
      "text": "Wesley Willett, Bon Adriel Aseniero, Sheelagh Carpendale, Pierre Dragicevic, Yvonne Jansen, Lora Oehlberg, and Petra Isenberg. 2021. Perception! Immersion! Empowerment! Superpowers as Inspiration for Visualization. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 22–32. https://doi.org/10.1109/TVCG.2021.3114844",
      "doi": "10.1109/TVCG.2021.3114844"
    },
    {
      "text": "Wesley Willett, Yvonne Jansen, and Pierre Dragicevic. 2016. Embedded data representations. IEEE transactions on visualization and computer graphics 23, 1(2016), 461–470. https://doi.org/10.1109/TVCG.2016.2598608",
      "doi": "10.1109/TVCG.2016.2598608"
    },
    {
      "text": "Kaufui V Wong and Aldo Hernandez. 2012. A review of additive manufacturing. International scholarly research notices 2012 (2012). https://doi.org/10.5402/2012/208760",
      "doi": ""
    },
    {
      "text": "Lijie Yao, Anastasia Bezerianos, Romain Vuillemot, and Petra Isenberg. 2022. Visualization in Motion: A Research Agenda and Two Evaluations. IEEE Transactions on Visualization and Computer Graphics (2022). https://doi.org/10.1109/TVCG.2022.3184993",
      "doi": ""
    },
    {
      "text": "Yidan Zhang, Barrett Ens, Kadek Ananta Satriadi, Arnaud Prouzeau, and Sarah Goodwin. 2022. TimeTables: Embodied Exploration of Immersive Spatio-Temporal Data. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 599–605.",
      "doi": ""
    },
    {
      "text": "Yuheng Zhao, Jinjing Jiang, Yi Chen, Richen Liu, Yalong Yang, Xiangyang Xue, and Siming Chen. 2022. Metaverse: Perspectives from graphics, interactions and visualization. Visual Informatics (2022). https://doi.org/10.1016/j.visinf.2022.03.002",
      "doi": ""
    },
    {
      "text": "Mengya Zheng, Xingyu Pan, Nestor Velasco Bermeo, Rosemary J Thomas, David Coyle, Gregory MP O’hare, and Abraham G Campbell. 2022. STARE: Augmented Reality Data Visualization for Explainable Decision Support in Smart Environments. IEEE Access 10(2022), 29543–29557.",
      "doi": ""
    }
  ]
}