{
  "doi": "10.1145/3544548.3581351",
  "title": "Comparing Sentence-Level Suggestions to Message-Level Suggestions in AI-Mediated Communication",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Traditionally, writing assistance systems have focused on short or even single-word suggestions. Recently, large language models like GPT-3 have made it possible to generate significantly longer natural-sounding suggestions, offering more advanced assistance opportunities. This study explores the trade-offs between sentence- vs. message-level suggestions for AI-mediated communication. We recruited 120 participants to act as staffers from legislators’ offices who often need to respond to large volumes of constituent concerns. Participants were asked to reply to emails with different types of assistance. The results show that participants receiving message-level suggestions responded faster and were more satisfied with the experience, as they mainly edited the suggested drafts. In addition, the texts they wrote were evaluated as more helpful by others. In comparison, participants receiving sentence-level assistance retained a higher sense of agency, but took longer for the task as they needed to plan the flow of their responses and decide when to use suggestions. Our findings have implications for designing task-appropriate communication assistance systems.",
  "tags": [],
  "authors": [
    {
      "name": "Liye Fu",
      "institution": "Thomson Reuters Labs, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781547",
      "orcid": "0000-0001-7989-6839"
    },
    {
      "name": "Benjamin Newman",
      "institution": "Allen Institute for Artificial Intelligence, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660003192",
      "orcid": "0000-0003-3552-8676"
    },
    {
      "name": "Maurice Jakesch",
      "institution": "Department of Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366351",
      "orcid": "0000-0002-2642-3322"
    },
    {
      "name": "Sarah Kreps",
      "institution": "Tech Policy Institute, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780606",
      "orcid": "0000-0002-0924-4234"
    }
  ],
  "references": [
    {
      "text": "Sinan Aral and Dean Eckles. 2019. Protecting elections from social media manipulation. Science 365, 6456 (2019), 858–861.",
      "doi": ""
    },
    {
      "text": "Kenneth C. Arnold, Krzysztof Z. Gajos, and Adam T. Kalai. 2016. On Suggesting Phrases vs. Predicting Words for Mobile Text Composition. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, Tokyo Japan, 603–608. https://doi.org/10.1145/2984511.2984584",
      "doi": "10.1145/2984511.2984584"
    },
    {
      "text": "Nikola Banovic, Ticha Sethapakdi, Yasasvi Hari, Anind K. Dey, and Jennifer Mankoff. 2019. The Limits of Expert Text Entry Speed on Mobile Keyboards with Autocorrect. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 15, 12 pages. https://doi.org/10.1145/3338286.3340126",
      "doi": "10.1145/3338286.3340126"
    },
    {
      "text": "Pablo Barberá, Andreu Casas, Jonathan Nagler, Patrick J Egan, Richard Bonneau, John T Jost, and Joshua A Tucker. 2019. Who leads? Who follows? Measuring issue attention and agenda setting by legislators and the mass public using social media data. American Political Science Review 113, 4 (2019), 883–901.",
      "doi": ""
    },
    {
      "text": "Emily M Bender, Timnit Gebru, Angelina McMillan-Major, and Shmargaret Shmitchell. 2021. On the Dangers of Stochastic Parrots: Can Language Models Be Too Big?. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. 610–623.",
      "doi": "10.1145/3442188.3445922"
    },
    {
      "text": "Rishi Bommasani, Drew A Hudson, Ehsan Adeli, Russ Altman, Simran Arora, Sydney von Arx, Michael S Bernstein, Jeannette Bohg, Antoine Bosselut, Emma Brunskill, 2021. On the opportunities and risks of foundation models. arXiv preprint arXiv:2108.07258(2021).",
      "doi": ""
    },
    {
      "text": "Samantha Bradshaw and Philip Howard. 2017. Troops, trolls and troublemakers: A global inventory of organized social media manipulation. (2017).",
      "doi": ""
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, 2020. Language models are few-shot learners. Advances in neural information processing systems 33 (2020), 1877–1901.",
      "doi": ""
    },
    {
      "text": "Axel Bruns. 2019. Are filter bubbles real?John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Daniel Buschek, Benjamin Bisinger, and Florian Alt. 2018. ResearchIME: A Mobile Keyboard Application for Studying Free Typing Behaviour in the Wild. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA. https://doi.org/10.1145/3173574.3173829 event-place: Montreal, Quebec, CA.",
      "doi": "10.1145/3173574.3173829"
    },
    {
      "text": "Daniel Buschek, Martin Zürn, and Malin Eiband. 2021. The Impact of Multiple Parallel Phrase Suggestions on Email Input and Composition Behaviour of Native and Non-Native English Writers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 732, 13 pages. https://doi.org/10.1145/3411764.3445372",
      "doi": "10.1145/3411764.3445372"
    },
    {
      "text": "Mia Xu Chen, Benjamin N. Lee, Gagan Bansal, Yuan Cao, Shuyuan Zhang, Justin Lu, Jackie Tsay, Yinan Wang, Andrew M. Dai, Zhifeng Chen, Timothy Sohn, and Yonghui Wu. 2019. Gmail Smart Compose: Real-Time Assisted Writing. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining (Anchorage, AK, USA) (KDD ’19). Association for Computing Machinery, New York, NY, USA, 2287–2295. https://doi.org/10.1145/3292500.3330723",
      "doi": "10.1145/3292500.3330723"
    },
    {
      "text": "Congressional Management Foundation. Retrieved in 2022. Communicating with Congress. https://www.congressfoundation.org/projects/communicating-with-congress.",
      "doi": ""
    },
    {
      "text": "Yao Dou, Maxwell Forbes, Rik Koncel-Kedziorski, Noah Smith, and Yejin Choi. 2022. Is GPT-3 Text Indistinguishable from Human Text? Scarecrow: A Framework for Scrutinizing Machine Text. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics. https://doi.org/10.18653/v1/2022.acl-long.501",
      "doi": ""
    },
    {
      "text": "Mark Dunlop and John Levine. 2012. Multidimensional Pareto Optimization of Touchscreen Keyboards for Speed, Familiarity and Improved Spell Checking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2669–2678. https://doi.org/10.1145/2207676.2208659",
      "doi": "10.1145/2207676.2208659"
    },
    {
      "text": "Congressional Management Foundation. 2017. Handling Volume. https://www.congressfoundation.org/office-toolkit-home/improve-mail-operations-menu-item-new/handling-volume-home/terms/summary. Accessed: 2022-11-21.",
      "doi": ""
    },
    {
      "text": "Andrew Fowler, Kurt Partridge, Ciprian Chelba, Xiaojun Bi, Tom Ouyang, and Shumin Zhai. 2015. Effects of Language Modeling and Its Personalization on Touchscreen Typing Performance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 649–658. https://doi.org/10.1145/2702123.2702503",
      "doi": "10.1145/2702123.2702503"
    },
    {
      "text": "Joshua Goodman, Gina Venolia, Keith Steury, and Chauncey Parker. 2002. Language modeling for soft keyboards. (Jan. 2002), 194–195. https://doi.org/10.1145/502716.502753",
      "doi": "10.1145/502716.502753"
    },
    {
      "text": "Francis J. Griffith and John Warriner. 1977. English Grammar and Composition: Complete Course.",
      "doi": ""
    },
    {
      "text": "Christian R. Grose, Neil Malhotra, and Robert Parks Van Houweling. 2015. Explaining Explanations: How Legislators Explain their Policy Positions and How Citizens React. American Journal of Political Science 59, 3 (2015), 724–743. https://doi.org/10.1111/ajps.12164 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/ajps.12164",
      "doi": ""
    },
    {
      "text": "Jeffrey T. Hancock, Mor Naaman, and Karen Levy. 2020. AI-Mediated Communication: Definition, Research Agenda, and Ethical Considerations. Journal of Computer-Mediated Communication 25, 1 (March 2020). https://doi.org/10.1093/jcmc/zmz022",
      "doi": ""
    },
    {
      "text": "ALEXANDER HERTEL-FERNANDEZ, MATTO MILDENBERGER, and LEAH C. STOKES. 2019. Legislative Staff and Representation in Congress. American Political Science Review 113, 1 (2019), 1–18. https://doi.org/10.1017/S0003055418000606",
      "doi": ""
    },
    {
      "text": "Po-Sen Huang, Huan Zhang, Ray Jiang, Robert Stanforth, Johannes Welbl, Jack Rae, Vishal Maini, Dani Yogatama, and Pushmeet Kohli. 2019. Reducing sentiment bias in language models via counterfactual evaluation. arXiv preprint arXiv:1911.03064(2019).",
      "doi": ""
    },
    {
      "text": "Maurice Jakesch, Jeffrey Hancock, and Mor Naaman. 2022. Human Heuristics for AI-Generated Language Are Flawed. arXiv preprint arXiv:2206.07271(2022).",
      "doi": ""
    },
    {
      "text": "Christina James and Michael Longé. 2000. Bringing Text Input beyond the Desktop. In CHI ’00 Extended Abstracts on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI EA ’00). Association for Computing Machinery, New York, NY, USA, 49–50. https://doi.org/10.1145/633292.633324",
      "doi": "10.1145/633292.633324"
    },
    {
      "text": "Anjuli Kannan, Karol Kurach, Sujith Ravi, Tobias Kaufmann, Andrew Tomkins, Balint Miklos, Greg Corrado, Laszlo Lukacs, Marina Ganea, Peter Young, and Vivek Ramavajjala. 2016. Smart Reply: Automated Response Suggestion for Email. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (San Francisco, California, USA) (KDD ’16). Association for Computing Machinery, New York, NY, USA, 955–964. https://doi.org/10.1145/2939672.2939801",
      "doi": "10.1145/2939672.2939801"
    },
    {
      "text": "Habibul Haque Khondker. 2011. Role of the new media in the Arab Spring. Globalizations 8, 5 (2011), 675–679.",
      "doi": ""
    },
    {
      "text": "Sarah Kreps. 2022. AI-Mediated Communication, Legislative Responsiveness, and Trust in Democratic Institutions. In Technologies of Deception.",
      "doi": ""
    },
    {
      "text": "Sarah Kreps, R Miles McCain, and Miles Brundage. 2022. All the news that’s fit to fabricate: AI-generated text as a tool of media misinformation. Journal of Experimental Political Science 9, 1 (2022), 104–117.",
      "doi": ""
    },
    {
      "text": "Per Ola Kristensson and Keith Vertanen. 2014. The inviscid text entry rate and its application as a grand goal for mobile text entry. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services(MobileHCI ’14). Association for Computing Machinery, Toronto, ON, Canada, 335–338. https://doi.org/10.1145/2628363.2628405",
      "doi": "10.1145/2628363.2628405"
    },
    {
      "text": "Mina Lee, Percy Liang, and Qian Yang. 2022. CoAuthor: Designing a Human-AI Collaborative Writing Dataset for Exploring Language Model Capabilities. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 388, 19 pages. https://doi.org/10.1145/3491102.3502030",
      "doi": "10.1145/3491102.3502030"
    },
    {
      "text": "Jiwei Li, Michel Galley, Chris Brockett, Jianfeng Gao, and Bill Dolan. 2016. A Diversity-Promoting Objective Function for Neural Conversation Models. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics. https://doi.org/10.18653/v1/N16-1014",
      "doi": ""
    },
    {
      "text": "Stephanie Lin, Jacob Hilton, and Owain Evans. 2021. Truthfulqa: Measuring how models mimic human falsehoods. arXiv preprint arXiv:2109.07958(2021).",
      "doi": ""
    },
    {
      "text": "Brian Lubars and Chenhao Tan. 2019. Ask Not What AI Can Do, but What AI Should Do: Towards a Framework of Task Delegability. (2019).",
      "doi": ""
    },
    {
      "text": "Debora Nozza, Federico Bianchi, and Dirk Hovy. 2021. HONEST: Measuring hurtful sentence completion in language models. In The 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics.",
      "doi": ""
    },
    {
      "text": "Stefan Palan and Christian Schitter. 2018. Prolific. ac—A subject pool for online experiments. Journal of Behavioral and Experimental Finance 17 (2018), 22–27.",
      "doi": ""
    },
    {
      "text": "Kseniia Palin, Anna Maria Feit, Sunjun Kim, Per Ola Kristensson, and Antti Oulasvirta. 2019. How do People Type on Mobile Devices? Observations from a Study with 37,000 Volunteers. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3338286.3340120",
      "doi": "10.1145/3338286.3340120"
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2016. A Cost-Benefit Study of Text Entry Suggestion Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 83–88. https://doi.org/10.1145/2858036.2858305",
      "doi": "10.1145/2858036.2858305"
    },
    {
      "text": "Jack W Rae, Sebastian Borgeaud, Trevor Cai, Katie Millican, Jordan Hoffmann, Francis Song, John Aslanides, Sarah Henderson, Roman Ring, Susannah Young, 2021. Scaling language models: Methods, analysis & insights from training gopher. arXiv preprint arXiv:2112.11446(2021).",
      "doi": ""
    },
    {
      "text": "Nikhil Singh, Guillermo Bernal, Daria Savchenko, and Elena L. Glassman. 2022. Where to Hide a Stolen Elephant: Leaps in Creative Writing with Multimodal Machine Intelligence. ACM Transactions on Computer-Human Interaction (Feb. 2022), 3511599. https://doi.org/10.1145/3511599",
      "doi": "10.1145/3511599"
    },
    {
      "text": "Emma Strubell, Ananya Ganesh, and Andrew McCallum. 2019. Energy and policy considerations for deep learning in NLP. arXiv preprint arXiv:1906.02243(2019).",
      "doi": ""
    },
    {
      "text": "The OpenGov Foundation. 2017. From Voicemails to Votes. Technical Report.",
      "doi": ""
    },
    {
      "text": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. Advances in neural information processing systems 30 (2017).",
      "doi": ""
    },
    {
      "text": "Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. 2015. VelociTap: Investigating Fast Mobile Text Entry using Sentence-Based Decoding of Touchscreen Keyboard Input. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, Seoul, Republic of Korea, 659–668. https://doi.org/10.1145/2702123.2702135",
      "doi": "10.1145/2702123.2702135"
    },
    {
      "text": "Laura Weidinger, John Mellor, Maribeth Rauh, Conor Griffin, Jonathan Uesato, Po-Sen Huang, Myra Cheng, Mia Glaese, Borja Balle, Atoosa Kasirzadeh, 2021. Ethical and social risks of harm from language models. arXiv preprint arXiv:2112.04359(2021).",
      "doi": ""
    },
    {
      "text": "Laura Weidinger, Jonathan Uesato, Maribeth Rauh, Conor Griffin, Po-Sen Huang, John Mellor, Amelia Glaese, Myra Cheng, Borja Balle, Atoosa Kasirzadeh, 2022. Taxonomy of risks posed by language models. In 2022 ACM Conference on Fairness, Accountability, and Transparency. 214–229.",
      "doi": "10.1145/3531146.3533088"
    },
    {
      "text": "Sean Welleck, Ilia Kulikov, Stephen Roller, Emily Dinan, Kyunghyun Cho, and Jason Weston. 2020. Neural Text Generation with Unlikelihood Training. ArXiv abs/1908.04319(2020).",
      "doi": ""
    },
    {
      "text": "Sophie Wodzak. 2022. Can a Standardized Test Actually Write Itself?",
      "doi": ""
    },
    {
      "text": "Ann Yuan, Andy Coenen, Emily Reif, and Daphne Ippolito. 2022. Wordcraft: Story Writing With Large Language Models. In 27th International Conference on Intelligent User Interfaces(IUI ’22). Association for Computing Machinery, New York, NY, USA, 841–852. https://doi.org/10.1145/3490099.3511105",
      "doi": "10.1145/3490099.3511105"
    },
    {
      "text": "Ekaterina Zhuravskaya, Maria Petrova, and Ruben Enikolopov. 2020. Political effects of the internet and social media. Annual Review of Economics 12 (2020), 415–438.",
      "doi": ""
    }
  ]
}