{
  "doi": "10.1145/3544548.3581330",
  "title": "When do data visualizations persuade? The impact of prior attitudes on learning about correlations from scatterplot visualizations",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Data visualizations are vital to scientific communication on critical issues such as public health, climate change, and socioeconomic policy. They are often designed not just to inform, but to persuade people to make consequential decisions (e.g., to get vaccinated). Are such visualizations persuasive, especially when audiences have beliefs and attitudes that the data contradict? In this paper we examine the impact of existing attitudes (e.g., positive or negative attitudes toward COVID-19 vaccination) on changes in beliefs about statistical correlations when viewing scatterplot visualizations with different representations of statistical uncertainty. We find that strong prior attitudes are associated with smaller belief changes when presented with data that contradicts existing views, and that visual uncertainty representations may amplify this effect. Finally, even when participants’ beliefs about correlations shifted their attitudes remained unchanged, highlighting the need for further research on whether data visualizations can drive longer-term changes in views and behavior.",
  "tags": [
    "attitudes",
    "persuasion",
    "data visualization",
    "uncertainty communication",
    "science communication"
  ],
  "authors": [
    {
      "name": "Douglas Markant",
      "institution": "Department of Psychological Science, University of North Carolina at Charlotte, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660456665",
      "orcid": "0000-0003-0568-2648"
    },
    {
      "name": "Milad Rogha",
      "institution": "Department of Computer Science, University of North Carolina at Charlotte, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779255",
      "orcid": "0000-0002-1464-2157"
    },
    {
      "name": "Alireza Karduni",
      "institution": "IDEO, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659349355",
      "orcid": "0000-0001-9719-7513"
    },
    {
      "name": "Ryan Wesslen",
      "institution": "Explosion, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659349405",
      "orcid": "0000-0001-9638-8078"
    },
    {
      "name": "Wenwen Dou",
      "institution": "Department of Computer Science, University of North Carolina at Charlotte, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414604610",
      "orcid": "0000-0003-0319-9484"
    }
  ],
  "references": [
    {
      "text": "Dolores Albarracin, Blair Johnson, and Mark Zanna. 2005. Handbook of Attitudes. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Dolores Albarracín and Amy L. Mitchell. 2004. The Role of Defensive Confidence in Preference for Proattitudinal Information: How Believing That One Is Strong Can Sometimes Be a Defensive Weakness. Personality and Social Psychology Bulletin 30, 12 (Dec. 2004), 1565–1584. https://doi.org/10.1177/0146167204271180",
      "doi": ""
    },
    {
      "text": "Mike Allen, Rebecca Bruflat, Renée Fucilla, Michael Kramer, Steve McKellips, Daniel J Ryan, and Marieke Spiegelhoff. 2000. Testing the persuasiveness of evidence: Combining narrative and statistical forms. Communication Research Reports 17, 4 (2000), 331–336.",
      "doi": ""
    },
    {
      "text": "Mike Allen and Raymond W Preiss. 1997. Comparing the persuasiveness of narrative and statistical evidence using meta-analysis. Communication Research Reports 14, 2 (1997), 125–131.",
      "doi": ""
    },
    {
      "text": "United States Census Bureau. 2019. US Census Current Population Survey and American Community Survey. http://data.census.gov Accessed 2022-04-15.",
      "doi": ""
    },
    {
      "text": "Paul-Christian Bürkner. 2017. Brms: An R Package for Bayesian Multilevel Models Using Stan. Journal of Statistical Software 80 (2017), 1–28.",
      "doi": ""
    },
    {
      "text": "CA Chinn and WF Brewer. 1993. The Role of Anomalous Data in Knowledge Acquisition: A Theoretical Framework and Implications for Science Instruction. Review of Educational Research 63, 1 (1993), 1.",
      "doi": ""
    },
    {
      "text": "Jean-François Daoust and Frédérick Bastien. 2021. Should We or Should We Not Include Confidence Intervals in COVID-19 Death Forecasting? Evidence from a Survey Experiment. Political Studies Review 19, 2 (2021), 302–310.",
      "doi": ""
    },
    {
      "text": "Alice H Eagly and Shelly Chaiken. 1993. The Psychology of Attitudes.Harcourt Brace Jovanovich College Publishers.",
      "doi": ""
    },
    {
      "text": "Jonathan D Ericson, William S Albert, and Ja-Nae Duane. 2022. Political Affiliation Moderates Subjective Interpretations of COVID-19 Graphs. Big Data & Society 9, 1 (Jan. 2022), 205395172210806. https://doi.org/10.1177/20539517221080678",
      "doi": ""
    },
    {
      "text": "Michael Fernandes, Logan Walls, Sean Munson, Jessica Hullman, and Matthew Kay. 2018. Uncertainty Displays Using Quantile Dotplots or CDFs Improve Transit Decision-Making. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173718",
      "doi": "10.1145/3173574.3173718"
    },
    {
      "text": "Baruch Fischhoff. 2012. Communicating uncertainty: Fulfilling the duty to inform. Issues in Science and Technology 28 (2012), 63–70.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. 2022. Adverse vaccination events. http://wonder.cdc.gov/vaers.html Accessed: 2022-03-10.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. 2022. Vaccination rate. https://data.cdc.gov/Vaccinations/COVID-19-Vaccinations- in-the-United-States-Jurisdi/unsk-b7fc Accessed: 2022-03-10.",
      "doi": ""
    },
    {
      "text": "Steven L. Franconeri, Lace M. Padilla, Priti Shah, Jeffrey M. Zacks, and Jessica Hullman. 2021. The Science of Visual Data Communication: What Works. Psychological Science in the Public Interest 22, 3 (Dec. 2021), 110–161. https://doi.org/10.1177/15291006211051956",
      "doi": ""
    },
    {
      "text": "R Kelly Garrett and Brian E Weeks. 2017. Epistemic beliefs’ role in promoting misperceptions and conspiracist ideation. PLOS One 12, 9 (2017), e0184733. https://doi.org/10.1371/journal.pone.0184733",
      "doi": ""
    },
    {
      "text": "Daniel W Heck, Udo Boehm, Florian Böing-Messing, Paul-Christian Bürkner, Koen Derks, Zoltan Dienes, Qianrao Fu, Xin Gu, Diana Karimova, Henk AL Kiers, 2022. A review of applications of the bayes factor in psychological research. Psychological Methods(2022).",
      "doi": ""
    },
    {
      "text": "Austin Hegland, Annie Li Zhang, Brianna Zichettella, and Josh Pasek. 2022. A Partisan Pandemic: How COVID-19 Was Primed for Polarization. The ANNALS of the American Academy of Political and Social Science 700, 1 (March 2022), 55–72. https://doi.org/10.1177/00027162221083686",
      "doi": ""
    },
    {
      "text": "Jeremy Heyer, Nirmal Kumar Raveendranath, and Khairi Reda. 2020. Pushing the (visual) narrative: The effects of prior knowledge elicitation in provocative topics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, 1–14.",
      "doi": "10.1145/3313831.3376887"
    },
    {
      "text": "Barry T Hirsch and David A Macpherson. 2003. Union membership and coverage database from the current population survey: Note. ILR Review 56, 2 (2003), 349–354.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman. 2020. Why Authors Don’t Visualize Uncertainty. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 130–139. https://doi.org/10.1109/TVCG.2019.2934287",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Xiaoli Qiao, Michael Correll, Alex Kale, and Matthew Kay. 2018. In pursuit of error: A survey of uncertainty visualization evaluation. IEEE Transactions on Visualization and Computer Graphics 25, 1(2018), 903–913.",
      "doi": "10.1109/TVCG.2018.2864889"
    },
    {
      "text": "Fabian Hutmacher, Regina Reichardt, and Markus Appel. 2022. The Role of Motivated Science Reception and Numeracy in the Context of the COVID-19 Pandemic. Public Understanding of Science 31, 1 (Jan. 2022), 19–34. https://doi.org/10.1177/09636625211047974",
      "doi": ""
    },
    {
      "text": "Alex Kale, Matthew Kay, and Jessica Hullman. 2021. Visual Reasoning Strategies for Effect Size Judgments and Decisions. IEEE Trans. Vis. Comput. Graph. 27, 2 (2021), 272–282. https://doi.org/10.1109/TVCG.2020.3030335",
      "doi": ""
    },
    {
      "text": "Alex Kale, Francis Nguyen, Matthew Kay, and Jessica Hullman. 2019. Hypothetical Outcome Plots Help Untrained Observers Judge Trends in Ambiguous Data. IEEE Transactions on Visualization and Computer Graphics 25, 1(2019), 892–902. https://doi.org/10.1109/TVCG.2018.2864909",
      "doi": "10.1109/TVCG.2018.2864909"
    },
    {
      "text": "Alireza Karduni, Douglas Markant, Ryan Wesslen, and Wenwen Dou. 2021. A Bayesian cognition approach for belief updating of correlation judgement through uncertainty visualizations. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb. 2021), 978–988. https://doi.org/10.1109/TVCG.2020.3029412",
      "doi": ""
    },
    {
      "text": "Alireza Karduni, Ryan Wesslen, Douglas Markant, and Wenwen Dou. 2023. Images, Emotions, and Credibility: Effect of Emotional Facial Images on Perceptions of News Content Bias and Source Credibility in Social Media. The 17th International AAAI Conference on Web and Social Media (ICWSM) (2023).",
      "doi": ""
    },
    {
      "text": "Nicole C. Kelp, Jessica K. Witt, and Gayathri Sivakumar. 2022. To Vaccinate or Not? The Role Played by Uncertainty Communication on Public Understanding and Behavior Regarding COVID-19. Science Communication 44, 2 (April 2022), 223–239. https://doi.org/10.1177/10755470211063628",
      "doi": ""
    },
    {
      "text": "Silvia Knobloch-Westerwick, Benjamin K. Johnson, and Axel Westerwick. 2015. Confirmation Bias in Online Searches: Impacts of Selective Exposure Before an Election on Political Attitude Strength and Shifts. Journal of Computer-Mediated Communication 20, 2 (March 2015), 171–187. https://doi.org/10.1111/jcc4.12105",
      "doi": ""
    },
    {
      "text": "Patrick W. Kraft, Milton Lodge, and Charles S. Taber. 2015. Why People “Don’t Trust the Evidence”: Motivated Reasoning and Scientific Beliefs. The Annals of the American Academy of Political and Social Science 658, 1 (March 2015), 121–133. https://doi.org/10.1177/0002716214554758",
      "doi": ""
    },
    {
      "text": "John K. Kruschke. 2013. Bayesian Estimation Supersedes the t Test.Journal of Experimental Psychology: General 142, 2 (2013), 573–603. https://doi.org/10.1037/a0029146",
      "doi": ""
    },
    {
      "text": "Stephan Lewandowsky and Klaus Oberauer. 2016. Motivated Rejection of Science. Current Directions in Psychological Science 25, 4 (Aug. 2016), 217–222. https://doi.org/10.1177/0963721416654436",
      "doi": ""
    },
    {
      "text": "Q Vera Liao and Wai-Tat Fu. 2013. Beyond the filter bubble: Interactive effects of perceived threat and topic involvement on selective exposure to information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, 2359–2368.",
      "doi": "10.1145/2470654.2481326"
    },
    {
      "text": "Johannes Liem, Charles Perin, and Jo Wood. 2020. Structure and empathy in visual data storytelling: Evaluating their influence on attitude. Computer Graphics Forum 39, 3 (2020), 277–289.",
      "doi": ""
    },
    {
      "text": "Dominique Makowski, Mattan S. Ben-Shachar, Indrajeet Patil, and Daniel Lüdecke. 2020. Methods and Algorithms for Correlation Analysis in R.Journal of Open Source Software 5, 51 (2020), 2306. https://doi.org/10.21105/joss.02306",
      "doi": ""
    },
    {
      "text": "Ricardo Matheus, Marijn Janssen, and Devender Maheshwari. 2020. Data Science Empowering the Public: Data-driven Dashboards for Transparent and Accountable Decision-Making in Smart Cities. Government Information Quarterly 37, 3 (July 2020), 101284. https://doi.org/10.1016/j.giq.2018.01.006",
      "doi": ""
    },
    {
      "text": "Seth M. Noar and Lucinda Austin. 2020. (Mis)Communicating about COVID-19: Insights from Health and Crisis Communication. Health Communication 35, 14 (Dec. 2020), 1735–1739. https://doi.org/10.1080/10410236.2020.1838093",
      "doi": ""
    },
    {
      "text": "Covid Act Now. 2022. U.S. Covid Risk & Vaccine tracker. https://covidactnow.org/data-api Accessed: 2022-03-10.",
      "doi": ""
    },
    {
      "text": "Brendan Nyhan, Jason Reifler, Sean Richey, and Gary L. Freed. 2014. Effective Messages in Vaccine Promotion: A Randomized Trial. Pediatrics 133, 4 (April 2014), e835–e842. https://doi.org/10.1542/peds.2013-2365",
      "doi": ""
    },
    {
      "text": "Department of Health and Human Services. 2022. I.C.U. capacity ratio. https://healthdata.gov/Hospital/COVID-19-Reported-Patient-Impact- and-Hospital-Capa/g62h-syeh Accessed: 2022-03-10.",
      "doi": ""
    },
    {
      "text": "Department of Health and Human Services. 2022. Test positivity ratio. https://healthdata.gov/dataset/COVID-19-Diagnostic-Laboratory- Testing-PCR-Testing/j8mb-icvb Accessed: 2022-03-10.",
      "doi": ""
    },
    {
      "text": "North Carolina Department of Health and Human Services COVID-19 Response. 2022. Vaccination rate. https://covid19.ncdhhs.gov/dashboard/vaccinations Accessed: 2022-03-10.",
      "doi": ""
    },
    {
      "text": "Lace Padilla, Helia Hosseinpour, Racquel Fygenson, Jennifer Howell, Rumi Chunara, and Enrico Bertini. 2022. Impact of COVID-19 forecast visualizations on pandemic risk perceptions. Scientific Reports 12 (02 2022). https://doi.org/10.1038/s41598-022-05353-1",
      "doi": ""
    },
    {
      "text": "Lace M Padilla, Ian T Ruginski, and Sarah H Creem-Regehr. 2017. Effects of ensemble and summary displays on interpretations of geospatial uncertainty data. Cognitive Research: Principles and Implications 2, 1(2017), 1–16.",
      "doi": ""
    },
    {
      "text": "Anshul Vikram Pandey, Anjali Manivannan, Oded Nov, Margaret Satterthwaite, and Enrico Bertini. 2014. The Persuasive Power of Data Visualization. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 2211–2220. https://doi.org/10.1109/TVCG.2014.2346419",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook. 2019. Lazy, Not Biased: Susceptibility to Partisan Fake News Is Better Explained by Lack of Reasoning than by Motivated Reasoning. Cognition 188(2019), 39–50.",
      "doi": ""
    },
    {
      "text": "Gordon Pennycook, Ziv Epstein, Mohsen Mosleh, Antonio A Arechar, Dean Eckles, and David G Rand. 2021. Shifting attention to accuracy can reduce misinformation online. Nature 592, 7855 (2021), 590–595.",
      "doi": ""
    },
    {
      "text": "John V. Petrocelli, Zakary L. Tormala, and Derek D. Rucker. 2007. Unpacking attitude certainty: Attitude clarity and attitude correctness. Journal of Personality and Social Psychology 92, 1 (Jan. 2007), 30–41. https://doi.org/10.1037/0022-3514.92.1.30",
      "doi": ""
    },
    {
      "text": "Richard Petty, Pablo Briñol, and Joseph Priester. 2002. Mass Media Attitude Change: Implications of the Elaboration Likelihood Model of Persuasion. In Media Effects(zeroth ed.), Jennings Bryant, Dolf Zillmann, Jennings Bryant, and Mary Beth Oliver (Eds.). Routledge, 165–208. https://doi.org/10.4324/9781410602428-11",
      "doi": ""
    },
    {
      "text": "Richard E Petty and John T Cacioppo. 1986. Communication and Persuasion: Central and Peripheral Routes to Attitude Change. Springer, New York, NY.",
      "doi": ""
    },
    {
      "text": "R Core Team. 2021. R: A Language and Environment for Statistical Computing. R Foundation for Statistical Computing, Vienna, Austria. https://www.R-project.org/",
      "doi": ""
    },
    {
      "text": "Jan Philipp Rudloff, Fabian Hutmacher, and Markus Appel. 2022. Beliefs about the Nature of Knowledge Shape Responses to the Pandemic: Epistemic Beliefs, the Dark Factor of Personality, and COVID-19–Related Conspiracy Ideation and Behavior. Journal of Personality(2022), jopy.12706. https://doi.org/10.1111/jopy.12706",
      "doi": ""
    },
    {
      "text": "Linda J Skitka, Anthony N Washburn, and Timothy S Carsel. 2015. The psychological foundations and consequences of moral conviction. Current Opinion in Psychology 6 (2015), 41–44.",
      "doi": ""
    },
    {
      "text": "Stephanie Ternullo. 2022. “I’m Not Sure What to Believe”: Media Distrust and Opinion Formation during the COVID-19 Pandemic. American Political Science Review (Feb. 2022), 1–14. https://doi.org/10.1017/S000305542200003X",
      "doi": ""
    },
    {
      "text": "Keela S Thomson and Daniel M Oppenheimer. 2016. Investigating an alternate form of the cognitive reﬂection test. Judgment and Decision Making 11, 1 (2016), 15.",
      "doi": ""
    },
    {
      "text": "New York Times. 2022. New York Times COVID-19 public repository. https://github.com/nytimes/COVID-19-data Accessed: 2022-03-10.",
      "doi": ""
    },
    {
      "text": "Zakary L. Tormala and Derek D. Rucker. 2018. Attitude Certainty: Antecedents, Consequences, and New Directions. Consumer Psychology Review 1, 1 (Jan. 2018), 72–89. https://doi.org/10.1002/arcp.1004",
      "doi": ""
    },
    {
      "text": "Anne Marthe van der Bles, Sander van der Linden, Alexandra L. J. Freeman, and David J. Spiegelhalter. 2020. The Effects of Communicating Uncertainty on Public Trust in Facts and Numbers. Proceedings of the National Academy of Sciences 117, 14 (April 2020), 7672–7683. https://doi.org/10.1073/pnas.1913678117",
      "doi": ""
    },
    {
      "text": "Sander van der Linden. 2022. Misinformation: Susceptibility, Spread, and Interventions to Immunize the Public. Nature Medicine (March 2022). https://doi.org/10.1038/s41591-022-01713-6",
      "doi": ""
    },
    {
      "text": "Aki Vehtari, Andrew Gelman, and Jonah Gabry. 2017. Practical Bayesian Model Evaluation Using Leave-One-out Cross-Validation and WAIC. Statistics and Computing 27, 5 (Sept. 2017), 1413–1432. https://doi.org/10.1007/s11222-016-9696-4",
      "doi": "10.1007/s11222-016-9696-4"
    },
    {
      "text": "Fernanda B Viegas and Martin Wattenberg. 2006. Communication-minded visualization: A call to action. IBM Systems Journal 45, 4 (2006), 801.",
      "doi": "10.1147/sj.454.0801"
    },
    {
      "text": "Wibke Weber, Martin Engebretsen, and Helen Kennedy. 2018. Data Stories. Rethinking Journalistic Storytelling in the Context of Data Journalism. Studies in Communication Sciences(2018), 16.",
      "doi": ""
    },
    {
      "text": "Ryan Wesslen, Alireza Karduni, Douglas Markant, and Wenwen Dou. 2022. Effect of uncertainty visualizations on myopic loss aversion and the equity premium puzzle in retirement investment decisions. IEEE Trans. Vis. Comput. Graph. 28, 1 (2022), 454–464. https://doi.org/10.1109/TVCG.2021.3114692",
      "doi": "10.1109/TVCG.2021.3114692"
    },
    {
      "text": "Cindy Xiong, Chase Stokes, Yea-Seul Kim, and Steven Franconeri. 2022. Seeing What You Believe or Believing What You See? Belief Biases Correlation Estimation. https://doi.org/10.48550/ARXIV.2208.04436",
      "doi": ""
    },
    {
      "text": "M Zanna. 8. P., & Rempel, JK (1988). Attitudes: A new look at an old concept. The Social Psychology of Knowledge(8), 315–334.",
      "doi": ""
    },
    {
      "text": "Yixuan Zhang, Yifan Sun, Lace Padilla, Sumit Barua, Enrico Bertini, and Andrea G Parker. 2021. Mapping the Landscape of COVID-19 Crisis Visualizations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–23. https://doi.org/10.1145/3411764.3445381",
      "doi": "10.1145/3411764.3445381"
    }
  ]
}