{
  "doi": "10.1145/3544548.3580915",
  "title": "T-Force: Exploring the Use of Typing Force for Three State Virtual Keyboards",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Three state virtual keyboards which differentiate contact events between released, touched, and pressed states have the potential to improve overall typing experience and reduce the gap between virtual keyboards and physical keyboards. Incorporating force sensitivity, three-state virtual keyboards can utilize a force threshold to better classify a contact event. However, our limited knowledge of how force plays a role during typing on virtual keyboards limits further progress. Through a series of studies we observe that using a uniform threshold is not an optimal approach. Furthermore, the force being applied while typing varies significantly across the keys and among participants. As such, we propose three different approaches to further improve the uniform threshold. We show that a carefully selected non-uniform threshold function could be sufficient in delineating typing events on a three-state keyboard. Finally, we conclude our work with lessons learned, suggestion for future improvements, and comparisons with current methods available.",
  "authors": [
    {
      "name": "Shariff AM Faleel",
      "institution": "Department of Computer Science, University of British Columbia, Canada",
      "img": "/do/10.1145/contrib-99659534363/rel-imgonly/52832132052_e777922992_o.jpg",
      "acmid": "99659534363",
      "orcid": "0000-0001-6979-6877"
    },
    {
      "name": "Yishuo Liu",
      "institution": "Human Machine Interaction Lab, Huawei Central Research, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660784082",
      "orcid": "0000-0003-0389-6810"
    },
    {
      "name": "Roya A Cody",
      "institution": "Human Machine Interaction Lab, Huawei Technologies, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779161",
      "orcid": "0000-0001-6458-6002"
    },
    {
      "name": "Bradley Rey",
      "institution": "Computer Science, University of British Columbia, Canada",
      "img": "/do/10.1145/contrib-99659536233/rel-imgonly/bradleyrey_headshot_round.png",
      "acmid": "99659536233",
      "orcid": "0000-0001-7356-0656"
    },
    {
      "name": "Linghao Du",
      "institution": "Human Machine Interaction Lab, Huawei, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780014",
      "orcid": "0000-0002-1454-9753"
    },
    {
      "name": "Jiangyue Yu",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781391",
      "orcid": "0000-0002-5151-9596"
    },
    {
      "name": "Da-Yuan Huang",
      "institution": "Human Machine Interaction Lab, Huawei Canada, Canada",
      "img": "/do/10.1145/contrib-81551198756/rel-imgonly/81551198756.jpg",
      "acmid": "81551198756",
      "orcid": "missing"
    },
    {
      "name": "Pourang Irani",
      "institution": "Computer Science, University of British Columbia (Okanagan), Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    },
    {
      "name": "Wei Li",
      "institution": "Human-Machine Interaction Lab, Huawei Canada, Canada",
      "img": "/do/10.1145/contrib-81392599313/rel-imgonly/header_people_wei.jpg",
      "acmid": "81392599313",
      "orcid": "0000-0001-7174-9228"
    }
  ],
  "references": [
    {
      "text": "Thomas Bekken Aschim, Julie Lidahl Gjerstad, Lars Vidar Lien, Rukaiya Tahsin, and Frode Eika Sandnes. 2019. Are Split Tablet Keyboards Better? A Study of Soft Keyboard Layout and Hand Posture. Lecture Notes in Computer Science(2019), 647–655. https://doi.org/10.1007/978-3-030-29387-1_37",
      "doi": "10.1007/978-3-030-29387-1_37"
    },
    {
      "text": "Myroslav Bachynskyi, Gregorio Palmas, Antti Oulasvirta, Jürgen Steimle, and Tino Weinkauf. 2015. Performance and Ergonomics of Touch Surfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. https://doi.org/10.1145/2702123.2702607",
      "doi": "10.1145/2702123.2702607"
    },
    {
      "text": "James V. Bradley. 1958. Complete Counterbalancing of Immediate Sequential Effects in a Latin Square Design. J. Amer. Statist. Assoc. 53, 282 (1958), 525–528. https://doi.org/10.1080/01621459.1958.10501456 arXiv:https://www.tandfonline.com/doi/pdf/10.1080/01621459.1958.10501456",
      "doi": ""
    },
    {
      "text": "Daewoong Choi, Hyeonjoong Cho, and Joono Cheong. 2015. Improving Virtual Keyboards When All Finger Positions Are Known. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. https://doi.org/10.1145/2807442.2807491",
      "doi": "10.1145/2807442.2807491"
    },
    {
      "text": "Amrish O. Chourasia, Douglas A. Wiegmann, Karen B. Chen, Curtis B. Irwin, and Mary E. Sesto. 2013. Effect of Sitting or Standing on Touch Screen Performance and Touch Characteristics. Human Factors 55, 4 (2013), 789–802. https://doi.org/10.1177/0018720812470843 arXiv:https://doi.org/10.1177/0018720812470843PMID: 23964418.",
      "doi": ""
    },
    {
      "text": "Matthew J. C. Crump and Gordon D. Logan. 2010. Warning: This Keyboard Will Deconstruct- the Role of the Keyboard in Skilled Typewriting. Psychonomic Bulletin & Review 17, 3 (2010), 394–399. https://doi.org/10.3758/pbr.17.3.394",
      "doi": ""
    },
    {
      "text": "Vivek Dhakal, Anna Maria Feit, Per Ola Kristensson, and Antti Oulasvirta. 2018. Observations on Typing from 136 Million Keystrokes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3173574.3174220",
      "doi": "10.1145/3173574.3174220"
    },
    {
      "text": "Jörg Edelmann, Philipp Mock, Andreas Schilling, Peter Gerjets, Wolfgang Rosenstiel, and Wolfgang Straßer. 2012. Towards the keyboard of oz. In Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces - ITS ’12. https://doi.org/10.1145/2396636.2396662",
      "doi": "10.1145/2396636.2396662"
    },
    {
      "text": "Anna Maria Feit, Daryl Weir, and Antti Oulasvirta. 2016. How We Type. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/2858036.2858233",
      "doi": "10.1145/2858036.2858233"
    },
    {
      "text": "Tamara Fiedler and Yasemin Vardar. 2019. A Novel Texture Rendering Approach for Electrostatic Displays. In International Workshop on Haptic and Audio Interaction Design - HAID2019. Lille, France. https://hal.archives-ouvertes.fr/hal-02011782",
      "doi": ""
    },
    {
      "text": "Leah Findlater and Jacob Wobbrock. 2012. Personalized input. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. https://doi.org/10.1145/2207676.2208520",
      "doi": "10.1145/2207676.2208520"
    },
    {
      "text": "Leah Findlater, Jacob O. Wobbrock, and Daniel Wigdor. 2011. Typing on flat glass. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11. https://doi.org/10.1145/1978942.1979301",
      "doi": "10.1145/1978942.1979301"
    },
    {
      "text": "Mayank Goel, Leah Findlater, and Jacob Wobbrock. 2012. WalkType: Using Accelerometer Data to Accomodate Situational Impairments in Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2687–2696. https://doi.org/10.1145/2207676.2208662",
      "doi": "10.1145/2207676.2208662"
    },
    {
      "text": "Yizheng Gu, Chun Yu, Xuanzhong Chen, ZHUOJUN LI, and Yuanchun Shi. 2021. TypeBoard: Identifying Unintentional Touch on Pressure-Sensitive Touchscreen Keyboards. In The 34th Annual ACM Symposium on User Interface Software and Technology. nil. https://doi.org/10.1145/3472749.3474770",
      "doi": "10.1145/3472749.3474770"
    },
    {
      "text": "Tatsuhito Hasegawa and Tatsuya Hatakenaka. 2019. Touch-Typing Detection Using Eyewear: Toward Realizing a New Interaction for Typing Applications. Sensors 19, 9 (2019). https://doi.org/10.3390/s19092022",
      "doi": ""
    },
    {
      "text": "Min-Chieh Hsiu, Da-Yuan Huang, Chi An Chen, Yu-Chih Lin, Yi ping Hung, De-Nian Yang, and Mike Chen. 2016. ForceBoard. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. nil. https://doi.org/10.1145/2957265.2961827",
      "doi": "10.1145/2957265.2961827"
    },
    {
      "text": "Seokhee Jeon, Hongchae Lee, Jiyoung Jung, and Jin Ryong Kim. 2018. User-Adaptive Key Click Vibration on Virtual Keyboard. Mobile Information Systems 2018 (2018), 1–12. https://doi.org/10.1155/2018/6126140",
      "doi": ""
    },
    {
      "text": "Xinhui Jiang, Yang Li, Jussi P.P. Jokinen, Viet Ba Hirvola, Antti Oulasvirta, and Xiangshi Ren. 2020. How We Type: Eye and Finger Movement Strategies in Mobile Typing. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3313831.3376711",
      "doi": "10.1145/3313831.3376711"
    },
    {
      "text": "Huhn Kim, Seungyoun Yi, and So-Yeon Yoon. 2019. Exploring touch feedback display of virtual keyboards for reduced eye movements. Displays 56(2019), 38–48. https://doi.org/10.1016/j.displa.2018.11.004",
      "doi": ""
    },
    {
      "text": "Jeong Ho Kim, Lovenoor Aulck, Michael C Bartha, Christy A Harper, and Peter W Johnson. 2012. Are There Differences in Force Exposures and Typing Productivity Between Touchscreen and Conventional Keyboard?Proceedings of the Human Factors and Ergonomics Society Annual Meeting 56, 1(2012), 1104–1108. https://doi.org/10.1177/1071181312561240",
      "doi": ""
    },
    {
      "text": "Jin Ryong Kim, Xiaowei Dai, Xiang Cao, Carl Picciotto, Desney Tan, and Hong Z. Tan. 2012. A Masking Study of Key-Click Feedback Signals on a Virtual Keyboard. Springer Berlin Heidelberg, 247–257. https://doi.org/10.1007/978-3-642-31401-8_23",
      "doi": "10.1007/978-3-642-31401-8_23"
    },
    {
      "text": "Jin Ryong Kim and Hong Z. Tan. 2014. Haptic Feedback Intensity Affects Touch Typing Performance on a Flat Keyboard. Springer Berlin Heidelberg, 369–375. https://doi.org/10.1007/978-3-662-44193-0_46",
      "doi": ""
    },
    {
      "text": "Jin Ryong Kim and Hong Z. Tan. 2014. A study of touch typing performance with keyclick feedback. In 2014 IEEE Haptics Symposium (HAPTICS). https://doi.org/10.1109/haptics.2014.6775459",
      "doi": ""
    },
    {
      "text": "Jin Ryong Kim and Hong Z. Tan. 2015. Effect of information content in sensory feedback on typing performance using a flat keyboard. In 2015 IEEE World Haptics Conference (WHC). https://doi.org/10.1109/whc.2015.7177718",
      "doi": ""
    },
    {
      "text": "Sunjun Kim and Geehyuk Lee. 2012. Typing on a Touch Surface: Effect of Feedback with Horizontal Touch Keyboard and Vertical Display Setup. In The 10th Asia Pacific Conference on Computer Human Interaction. Human Centered Design Organization and ACM, 525–530.",
      "doi": ""
    },
    {
      "text": "Sunjun Kim, Jeongmin Son, Geehyuk Lee, Hwan Kim, and Woohun Lee. 2013. TapBoard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/2470654.2470733",
      "doi": "10.1145/2470654.2470733"
    },
    {
      "text": "Ue-Hwan Kim, Sahng-Min Yoo, and Jong-Hwan Kim. 2019. I-Keyboard: Fully Imaginary Keyboard on Touch Devices Empowered By Deep Neural Decoder. CoRR (2019). arxiv:1907.13285 [cs.HC] http://arxiv.org/abs/1907.13285v1",
      "doi": ""
    },
    {
      "text": "Yuki Kuno and Buntarou Shizuki. 2017. Meyboard: A QWERTY-Based Soft Keyboard for Touch-Typing on Tablets. Springer International Publishing, 193–207. https://doi.org/10.1007/978-3-319-58077-7_16",
      "doi": ""
    },
    {
      "text": "Sunghyuk Kwon, Donghun Lee, and Min K. Chung. 2009. Effect of Key Size and Activation Area on the Performance of a Regional Error Correction Method in a Touch-Screen Qwerty Keyboard. International Journal of Industrial Ergonomics 39, 5(2009), 888–893. https://doi.org/10.1016/j.ergon.2009.02.013",
      "doi": ""
    },
    {
      "text": "Lik Hang Lee, Ngo Yan Yeung, Tristan Braud, Tong Li, Xiang Su, and Pan Hui. 2020. Force9: Force-assisted Miniature Keyboard on Smart Wearables. In Proceedings of the 2020 International Conference on Multimodal Interaction. nil. https://doi.org/10.1145/3382507.3418827",
      "doi": "10.1145/3382507.3418827"
    },
    {
      "text": "Blaine Lewis, Greg d’Eon, Andy Cockburn, and Daniel Vogel. 2020. KeyMap: Improving Keyboard Shortcut Vocabulary Using Norman’s Mapping. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376483",
      "doi": "10.1145/3313831.3376483"
    },
    {
      "text": "Changshuan Li. 2010. Coping strategies for fast delivery in simultaneous interpretation. The Journal of Specialised Translation 13 (2010), 19–25.",
      "doi": ""
    },
    {
      "text": "Frank Chun Yat Li, Leah Findlater, and Khai N. Truong. 2013. Effects of Hand Drift While Typing on Touchscreens. In Proceedings of Graphics Interface 2013 (Regina, Sascatchewan, Canada) (GI ’13). Canadian Information Processing Society, CAN, 95–98.",
      "doi": ""
    },
    {
      "text": "Frank Chun Yat Li, Richard T. Guy, Koji Yatani, and Khai N. Truong. 2011. The 1line Keyboard: A QWERTY Layout in a Single Line. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 461–470. https://doi.org/10.1145/2047196.2047257",
      "doi": "10.1145/2047196.2047257"
    },
    {
      "text": "Ming-I Brandon Lin, Ruei-Hong Hong, and Yu-Ping Huang. 2020. Influence of Virtual Keyboard Design and Usage Posture on Typing Performance and Muscle Activity During Tablet Interaction. Ergonomics 63, 10 (2020), 1312–1328. https://doi.org/10.1080/00140139.2020.1778097",
      "doi": ""
    },
    {
      "text": "Ming-I Brandon Lin, Ruei-Hong Hong, and Yu-Ping Huang. 2020. Influence of virtual keyboard design and usage posture on typing performance and muscle activity during tablet interaction. Ergonomics 63, 10 (2020), 1312–1328. https://doi.org/10.1080/00140139.2020.1778097 arXiv:https://doi.org/10.1080/00140139.2020.1778097PMID: 32496886.",
      "doi": ""
    },
    {
      "text": "Yiqin Lu, Chun Yu, Xin Yi, Yuanchun Shi, and Shengdong Zhao. 2017. Blindtype. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 2 (2017), 1–24. https://doi.org/10.1145/3090083",
      "doi": "10.1145/3090083"
    },
    {
      "text": "Zhaoyuan Ma, Darren Edge, Leah Findlater, and Hong Z. Tan. 2015. Haptic keyclick feedback improves typing speed and reduces typing errors on a flat keyboard. In 2015 IEEE World Haptics Conference (WHC). https://doi.org/10.1109/whc.2015.7177717",
      "doi": ""
    },
    {
      "text": "Zhaoyuan Ma, Darren Edge, Leah Findlater, and Hong Z. Tan. 2015. Haptic keyclick feedback improves typing speed and reduces typing errors on a flat keyboard. In 2015 IEEE World Haptics Conference (WHC). 220–227. https://doi.org/10.1109/WHC.2015.7177717",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2002. Text Entry for Mobile Computing: Models and Methods, Theory and Practice. Human–Computer Interaction 17, 2-3 (2002), 147–198. https://doi.org/10.1080/07370024.2002.9667313 arXiv:https://www.tandfonline.com/doi/pdf/10.1080/07370024.2002.9667313",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase sets for evaluating text entry techniques. In CHI ’03 extended abstracts on Human factors in computing systems - CHI ’03. https://doi.org/10.1145/765891.765971",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Dan Odell. 2015. On-screen keyboards. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. https://doi.org/10.1145/2785830.2785848",
      "doi": "10.1145/2785830.2785848"
    },
    {
      "text": "Dan Odell. 2015. On-Screen Keyboards: Does the Presence of Feedback or Tactile Landmarks Improve Typing Performance?. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (Copenhagen, Denmark) (MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 131–136. https://doi.org/10.1145/2785830.2785848",
      "doi": "10.1145/2785830.2785848"
    },
    {
      "text": "Dan Odell and Eric Faggin. 2014. The Typing Performance and Preference Costs of Reducing Tactile Feedback and Tactile Landmarks in Tablet Keyboards. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 58, 1(2014), 1790–1794. https://doi.org/10.1177/1541931214581373",
      "doi": ""
    },
    {
      "text": "Sarangi P. Parikh and Joel M. Esposito. 2012. Negative Feedback for Small Capacitive Touchscreen Interfaces: a Usability Study for Data Entry Tasks. IEEE Transactions on Haptics 5, 1 (2012), 39–47. https://doi.org/10.1109/toh.2011.71",
      "doi": "10.1109/toh.2011.71"
    },
    {
      "text": "Radosław Puka, Piotr Łebkowski, and Jerzy Duda. 2021. One Row Keyboard: The Concept of Designing a Common Layout for Physical and Virtual Keyboards. Electronics 10, 6 (2021). https://doi.org/10.3390/electronics10060663",
      "doi": ""
    },
    {
      "text": "Ely Rabin and Andrew M. Gordon. 2004. Tactile Feedback Contributes To Consistency of Finger Movements During Typing. Experimental Brain Research 155, 3 (2004), 362–369. https://doi.org/10.1007/s00221-003-1736-6",
      "doi": ""
    },
    {
      "text": "Gregory Reardon, Nikolas Kastor, Yitian Shao, and Yon Visell. 2020. Elastowave: Localized Tactile Feedback in a Soft Haptic Interface via Focused Elastic Waves. In 2020 IEEE Haptics Symposium (HAPTICS). https://doi.org/10.1109/haptics45997.2020.ras.hap20.25.aa4d97aa",
      "doi": ""
    },
    {
      "text": "Mark Richardson, Matt Durasoff, and Robert Wang. 2020. Decoding Surface Touch Typing from Hand-Tracking. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. https://doi.org/10.1145/3379337.3415816",
      "doi": "10.1145/3379337.3415816"
    },
    {
      "text": "Dominik Schmidt, Florian Block, and Hans Gellersen. 2009. A Comparison of Direct and Indirect Multi-touch Input for Large Surfaces. Springer Berlin Heidelberg, 582–594. https://doi.org/10.1007/978-3-642-03655-2_65",
      "doi": "10.1007/978-3-642-03655-2_65"
    },
    {
      "text": "Andrew Sears, Julie A. Jacko, Josey Chu, and Francisco Moro. 2001. The Role of Visual Search in the Design of Effective Soft Keyboards. Behaviour & Information Technology 20, 3 (2001), 159–166. https://doi.org/10.1080/01449290110049790",
      "doi": ""
    },
    {
      "text": "Weinan Shi, Chun Yu, Xin Yi, Zhen Li, and Yuanchun Shi. 2018. Toast. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (2018), 1–23. https://doi.org/10.1145/3191765",
      "doi": "10.1145/3191765"
    },
    {
      "text": "Paul D. Varcholik, Joseph J. LaViola, and Charles E. Hughes. 2012. Establishing a Baseline for Text Entry for a Multi-Touch Virtual Keyboard. International Journal of Human-Computer Studies 70, 10 (2012), 657–672. https://doi.org/10.1016/j.ijhcs.2012.05.007",
      "doi": "10.1016/j.ijhcs.2012.05.007"
    },
    {
      "text": "Daryl Weir, Henning Pohl, Simon Rogers, Keith Vertanen, and Per Ola Kristensson. 2014. Uncertain text entry on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. nil. https://doi.org/10.1145/2556288.2557412",
      "doi": "10.1145/2556288.2557412"
    },
    {
      "text": "Pui Chung Wong, Kening Zhu, Xing-Dong Yang, and Hongbo Fu. 2020. Exploring Eyes-Free Bezel-Initiated Swipe on Round Smartwatches. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3313831.3376393",
      "doi": "10.1145/3313831.3376393"
    },
    {
      "text": "Zhican Yang, Chun Yu, Xin Yi, and Yuanchun Shi. 2019. Investigating Gesture Typing for Indirect Touch. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–22. https://doi.org/10.1145/3351275",
      "doi": "10.1145/3351275"
    },
    {
      "text": "Xin Yi, Chen Wang, Xiaojun Bi, and Yuanchun Shi. 2020. PalmBoard: Leveraging Implicit Touch Pressure in Statistical Decoding for Indirect Text Entry. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3313831.3376441",
      "doi": "10.1145/3313831.3376441"
    },
    {
      "text": "Xiao Ying Zhao, Ian A Spraggs, David A Pakula, and Tang Y Tan. 2021. 3d touch. US Patent App. 16/708,350.",
      "doi": ""
    },
    {
      "text": "Mingyuan Zhong, Chun Yu, Qian Wang, Xuhai Xu, and Yuanchun Shi. 2018. ForceBoard. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. nil. https://doi.org/10.1145/3173574.3174102",
      "doi": "10.1145/3173574.3174102"
    },
    {
      "text": "Suwen Zhu, Jingjie Zheng, Shumin Zhai, and Xiaojun Bi. 2019. i’sFree. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. nil. https://doi.org/10.1145/3290605.3300678",
      "doi": "10.1145/3290605.3300678"
    }
  ]
}