{
  "doi": "10.1145/3544548.3581015",
  "title": "Are Two Heads Better Than One in AI-Assisted Decision Making? Comparing the Behavior and Performance of Groups and Individuals in Human-AI Collaborative Recidivism Risk Assessment",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "With the prevalence of AI assistance in decision making, a more relevant question to ask than the classical question of “are two heads better than one?’’ is how groups’ behavior and performance in AI-assisted decision making compare with those of individuals’. In this paper, we conduct a case study to compare groups and individuals in human-AI collaborative recidivism risk assessment along six aspects, including decision accuracy and confidence, appropriateness of reliance on AI, understanding of AI, decision-making fairness, and willingness to take accountability. Our results highlight that compared to individuals, groups rely on AI models more regardless of their correctness, but they are more confident when they overturn incorrect AI recommendations. We also find that groups make fairer decisions than individuals according to the accuracy equality criterion, and groups are willing to give AI more credit when they make correct decisions. We conclude by discussing the implications of our work.",
  "authors": [
    {
      "name": "Chun-Wei Chiang",
      "institution": "Computer Sciences, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659243338",
      "orcid": "0000-0001-9635-3385"
    },
    {
      "name": "Zhuoran Lu",
      "institution": "Computer Science, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702293",
      "orcid": "0000-0002-1079-2043"
    },
    {
      "name": "Zhuoyan Li",
      "institution": "Purdue university, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783365",
      "orcid": "0000-0001-7143-9262"
    },
    {
      "name": "Ming Yin",
      "institution": "Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438595973",
      "orcid": "0000-0002-7364-139X"
    }
  ],
  "references": [
    {
      "text": "Abdullah Almaatouq, Mohammed Alsobay, Ming Yin, and Duncan J Watts. 2021. Task complexity moderates group synergy. Proceedings of the National Academy of Sciences 118, 36(2021), e2101062118.",
      "doi": ""
    },
    {
      "text": "Julia Angwin, Jeff Larson, Surya Mattu, and Lauren Kirchner. 2016. Machine Bias. ProPublica (2016). URL: https://www. propublica. org/article/machine-bias-risk-asses sments-in-criminal-sentencing(2016).",
      "doi": ""
    },
    {
      "text": "Alejandro Barredo Arrieta, Natalia Díaz-Rodríguez, Javier Del Ser, Adrien Bennetot, Siham Tabik, Alberto Barbado, Salvador García, Sergio Gil-López, Daniel Molina, Richard Benjamins, 2020. Explainable Artificial Intelligence (XAI): Concepts, taxonomies, opportunities and challenges toward responsible AI. Information fusion 58(2020), 82–115.",
      "doi": ""
    },
    {
      "text": "Zahra Ashktorab, Michael Desmond, Josh Andres, Michael Muller, Narendra Nath Joshi, Michelle Brachman, Aabhas Sharma, Kristina Brimijoin, Qian Pan, Christine T Wolf, 2021. AI-Assisted Human Labeling: Batching for Efficiency without Overreliance. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–27.",
      "doi": "10.1145/3449163"
    },
    {
      "text": "Bahador Bahrami, Karsten Olsen, Peter E Latham, Andreas Roepstorff, Geraint Rees, and Chris D Frith. 2010. Optimally interacting minds. Science 329, 5995 (2010), 1081–1085.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Walter S Lasecki, Daniel S Weld, and Eric Horvitz. 2019. Beyond accuracy: The role of mental models in human-AI team performance. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing, Vol. 7. 2–11.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Daniel S Weld, Walter S Lasecki, and Eric Horvitz. 2019. Updates in human-ai teams: Understanding and addressing the performance/compatibility tradeoff. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. 2429–2437.",
      "doi": "10.1609/aaai.v33i01.33012429"
    },
    {
      "text": "Gagan Bansal, Tongshuang Wu, Joyce Zhou, Raymond Fok, Besmira Nushi, Ece Kamar, Marco Tulio Ribeiro, and Daniel Weld. 2021. Does the whole exceed its parts? the effect of ai explanations on complementary team performance. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445717"
    },
    {
      "text": "Solon Barocas, Moritz Hardt, and Arvind Narayanan. 2017. Fairness in machine learning. Nips tutorial 1(2017), 2.",
      "doi": ""
    },
    {
      "text": "Bernard Bass. 1982. Individual capability, team performance, and team productivity. Human Performance and Productivity. Vols 1, 2 (1982), 179–222.",
      "doi": ""
    },
    {
      "text": "Suzanne T Bell. 2007. Deep-level composition variables as predictors of team performance: a meta-analysis.Journal of applied psychology 92, 3 (2007), 595.",
      "doi": ""
    },
    {
      "text": "Richard Berk, Hoda Heidari, Shahin Jabbari, Michael Kearns, and Aaron Roth. 2021. Fairness in criminal justice risk assessments: The state of the art. Sociological Methods & Research 50, 1 (2021), 3–44.",
      "doi": ""
    },
    {
      "text": "Yochanan E Bigman and Kurt Gray. 2018. People are averse to machines making moral decisions. Cognition 181(2018), 21–34.",
      "doi": ""
    },
    {
      "text": "Reuben Binns, Max Van Kleek, Michael Veale, Ulrik Lyngs, Jun Zhao, and Nigel Shadbolt. 2018. ’It’s Reducing a Human Being to a Percentage’ Perceptions of Justice in Algorithmic Decisions. In Proceedings of the 2018 Chi conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3173951"
    },
    {
      "text": "Bruce K Blaylock and Loren P Rees. 1984. Cognitive style and the usefulness of information. Decision Sciences 15, 1 (1984), 74–91.",
      "doi": ""
    },
    {
      "text": "Jonathan David Bobaljik and Höskuldur Thráinsson. 1998. Two heads aren’t always better than one. Syntax 1, 1 (1998), 37–71.",
      "doi": ""
    },
    {
      "text": "Marcus T Boccaccini, Darrel B Turner, Daniel C Murrie, Craig E Henderson, and Caroline Chevalier. 2013. Do scores from risk measures matter to jurors?Psychology, Public Policy, and Law 19, 2 (2013), 259.",
      "doi": ""
    },
    {
      "text": "Tim Brennan, William Dieterich, and Beate Ehret. 2009. Evaluating the predictive validity of the COMPAS risk and needs assessment system. Criminal Justice and behavior 36, 1 (2009), 21–40.",
      "doi": ""
    },
    {
      "text": "Zana Buçinca, Phoebe Lin, Krzysztof Z Gajos, and Elena L Glassman. 2020. Proxy tasks and subjective measures can be misleading in evaluating explainable AI systems. In Proceedings of the 25th international conference on intelligent user interfaces. 454–464.",
      "doi": "10.1145/3377325.3377498"
    },
    {
      "text": "Zana Buçinca, Maja Barbara Malaya, and Krzysztof Z Gajos. 2021. To trust or to think: cognitive forcing functions can reduce overreliance on AI in AI-assisted decision-making. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–21.",
      "doi": "10.1145/3449287"
    },
    {
      "text": "Madalina Busuioc. 2021. Accountable artificial intelligence: Holding algorithms to account. Public Administration Review 81, 5 (2021), 825–836.",
      "doi": ""
    },
    {
      "text": "Carrie J Cai, Samantha Winter, David Steiner, Lauren Wilcox, and Michael Terry. 2019. \" Hello AI\": uncovering the onboarding needs of medical practitioners for human-AI collaborative decision-making. Proceedings of the ACM on Human-computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359206"
    },
    {
      "text": "Aylin Caliskan, Joanna J Bryson, and Arvind Narayanan. 2017. Semantics derived automatically from language corpora contain human-like biases. Science 356, 6334 (2017), 183–186.",
      "doi": ""
    },
    {
      "text": "Samuel Carton, Qiaozhu Mei, and Paul Resnick. 2020. Feature-Based Explanations Don’t Help People Detect Misclassifications of Online Toxicity. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. 95–106.",
      "doi": ""
    },
    {
      "text": "Hao-Fei Cheng, Ruotong Wang, Zheng Zhang, Fiona O’Connell, Terrance Gray, F Maxwell Harper, and Haiyi Zhu. 2019. Explaining decision-making algorithms through UI: Strategies to help non-expert stakeholders. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300789"
    },
    {
      "text": "Chun-Wei Chiang and Ming Yin. 2021. You’d better stop! Understanding human reliance on machine learning models under covariate shift. In 13th ACM Web Science Conference 2021. 120–129.",
      "doi": "10.1145/3447535.3462487"
    },
    {
      "text": "Chun-Wei Chiang and Ming Yin. 2022. Exploring the Effects of Machine Learning Literacy Interventions on Laypeople’s Reliance on Machine Learning Models. In 27th International Conference on Intelligent User Interfaces. 148–161.",
      "doi": ""
    },
    {
      "text": "Leah Chong, Ayush Raina, Kosa Goucher-Lambert, Kenneth Kotovsky, and Jonathan Cagan. 2022. The Evolution and Impact of Human Confidence in Artificial Intelligence and in Themselves on AI-Assisted Decision-Making in Design. Journal of Mechanical Design(2022), 1–37.",
      "doi": ""
    },
    {
      "text": "Leah Chong, Guanglu Zhang, Kosa Goucher-Lambert, Kenneth Kotovsky, and Jonathan Cagan. 2022. Human confidence in artificial intelligence and in themselves: The evolution and impact of confidence on adoption of AI advice. Computers in Human Behavior 127 (2022), 107018.",
      "doi": "10.1016/j.chb.2021.107018"
    },
    {
      "text": "Nancy J Cooke, Mustafa Demir, and Nathan McNeese. 2016. Synthetic teammates as team players: Coordination of human and synthetic teammates. Technical Report. Cognitive Engineering Research Institute Mesa United States.",
      "doi": ""
    },
    {
      "text": "Jeffrey Dastin. 2018. Amazon scraps secret AI recruiting tool that showed bias against women. https://www.reuters.com/article/us-amazon-com-jobs-automation-insight/amazon-scraps-secret-ai-recruiting-tool-that-showed-bias-against-women-idUSKCN1MK08G",
      "doi": ""
    },
    {
      "text": "Bart A De Jong, Kurt T Dirks, and Nicole Gillespie. 2016. Trust and team performance: A meta-analysis of main effects, moderators, and covariates.Journal of applied psychology 101, 8 (2016), 1134.",
      "doi": ""
    },
    {
      "text": "Marie Delacre, Daniël Lakens, and Christophe Leys. 2017. Why psychologists should by default use Welch’s t-test instead of Student’s t-test. International Review of Social Psychology 30, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Mustafa Demir, Nathan J McNeese, and Nancy J Cooke. 2016. Team communication behaviors of the human-automation teaming. In 2016 IEEE international multi-disciplinary conference on cognitive methods in situation awareness and decision support (CogSIMA). IEEE, 28–34.",
      "doi": ""
    },
    {
      "text": "Dennis J Devine and Jennifer L Philips. 2001. Do smarter teams do better: A meta-analysis of cognitive ability and team performance. Small group research 32, 5 (2001), 507–532.",
      "doi": ""
    },
    {
      "text": "Berkeley J Dietvorst, Joseph P Simmons, and Cade Massey. 2015. Algorithm aversion: people erroneously avoid algorithms after seeing them err.Journal of Experimental Psychology: General 144, 1 (2015), 114.",
      "doi": ""
    },
    {
      "text": "Jonathan Dodge, Q Vera Liao, Yunfeng Zhang, Rachel KE Bellamy, and Casey Dugan. 2019. Explaining models: an empirical study of how explanations impact fairness judgment. In Proceedings of the 24th international conference on intelligent user interfaces. 275–285.",
      "doi": "10.1145/3301275.3302310"
    },
    {
      "text": "Julia Dressel and Hany Farid. 2018. The accuracy, fairness, and limits of predicting recidivism. Science advances 4, 1 (2018), eaao5580.",
      "doi": ""
    },
    {
      "text": "Xiaoni Duan, Chien-Ju Ho, and Ming Yin. 2022. The influences of task design on crowdsourced judgement: A case study of recidivism risk evaluation. In Proceedings of the ACM Web Conference 2022. 1685–1696.",
      "doi": "10.1145/3485447.3512239"
    },
    {
      "text": "Cynthia Dwork, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Richard Zemel. 2012. Fairness through awareness. In Proceedings of the 3rd innovations in theoretical computer science conference. 214–226.",
      "doi": "10.1145/2090236.2090255"
    },
    {
      "text": "Ferda Erdem, Janset Ozen, and Nuray Atsan. 2003. The relationship between trust and team performance. Work study (2003).",
      "doi": ""
    },
    {
      "text": "Andre Esteva, Brett Kuprel, Roberto A Novoa, Justin Ko, Susan M Swetter, Helen M Blau, and Sebastian Thrun. 2017. Dermatologist-level classification of skin cancer with deep neural networks. nature 542, 7639 (2017), 115–118.",
      "doi": ""
    },
    {
      "text": "Northpointe Institute for Public Management.1996. COMPAS [Computer software].",
      "doi": ""
    },
    {
      "text": "Donelson R Forsyth. 2018. Group dynamics. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Jorge Galindo and Pablo Tamayo. 2000. Credit risk assessment using statistical and machine learning: basic methodology and risk modeling applications. Computational economics 15, 1 (2000), 107–143.",
      "doi": ""
    },
    {
      "text": "Yashesh Gaur, Walter S Lasecki, Florian Metze, and Jeffrey P Bigham. 2016. The effects of automatic speech recognition quality on human transcription latency. In Proceedings of the 13th International Web for All Conference. 1–8.",
      "doi": "10.1145/2899475.2899478"
    },
    {
      "text": "Meric Altug Gemalmaz and Ming Yin. 2022. Understanding Decision Subjects’ Fairness Perceptions and Retention in Repeated Interactions with AI-Based Decision Systems. In Proceedings of the 2022 AAAI/ACM Conference on AI, Ethics, and Society. 295–306.",
      "doi": "10.1145/3514094.3534201"
    },
    {
      "text": "Ella Glikson and Anita Williams Woolley. 2020. Human trust in artificial intelligence: Review of empirical research. Academy of Management Annals 14, 2 (2020), 627–660.",
      "doi": ""
    },
    {
      "text": "Ben Green and Yiling Chen. 2019. Disparate interactions: An algorithm-in-the-loop analysis of fairness in risk assessments. In Proceedings of the conference on fairness, accountability, and transparency. 90–99.",
      "doi": "10.1145/3287560.3287563"
    },
    {
      "text": "Ben Green and Yiling Chen. 2019. The principles and limits of algorithm-in-the-loop decision making. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359152"
    },
    {
      "text": "Moritz Hardt, Eric Price, and Nati Srebro. 2016. Equality of opportunity in supervised learning. Advances in neural information processing systems 29 (2016).",
      "doi": ""
    },
    {
      "text": "Randy Y Hirokawa and Marshall Scott Poole. 1996. Communication and group decision making. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Fred Hohman, Andrew Head, Rich Caruana, Robert DeLine, and Steven M Drucker. 2019. Gamut: A design probe to understand how data scientists understand machine learning models. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300809"
    },
    {
      "text": "Lu Hong and Scott E Page. 2004. Groups of diverse problem solvers can outperform groups of high-ability problem solvers. Proceedings of the National Academy of Sciences 101, 46(2004), 16385–16389.",
      "doi": ""
    },
    {
      "text": "Sujin K Horwitz and Irwin B Horwitz. 2007. The effects of team diversity on team outcomes: A meta-analytic review of team demography. Journal of management 33, 6 (2007), 987–1015.",
      "doi": ""
    },
    {
      "text": "Yoyo Tsung-Yu Hou and Malte F Jung. 2021. Who is the expert? Reconciling algorithm aversion and algorithm appreciation in AI-supported decision making. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": ""
    },
    {
      "text": "George P Huber and Kyle Lewis. 2010. Cross-understanding: Implications for group cognition and performance. Academy of Management review 35, 1 (2010), 6–26.",
      "doi": ""
    },
    {
      "text": "Raymond G Hunt, Frank J Krzystofiak, James R Meindl, and Abdalla M Yousry. 1989. Cognitive style and decision making. Organizational behavior and human decision processes 44, 3 (1989), 436–453.",
      "doi": ""
    },
    {
      "text": "Niranjan S Janardhanan, Kyle Lewis, Rhonda K Reger, and Cynthia K Stevens. 2020. Getting to know you: motivating cross-understanding for improved team and individual performance. Organization Science 31, 1 (2020), 103–118.",
      "doi": "10.1287/orsc.2019.1324"
    },
    {
      "text": "Irving Lester Janis. 1983. Groupthink. Houghton Mifflin Boston.",
      "doi": ""
    },
    {
      "text": "Karen A Jehn, Gregory B Northcraft, and Margaret A Neale. 1999. Why differences make a difference: A field study of diversity, conflict and performance in workgroups. Administrative science quarterly 44, 4 (1999), 741–763.",
      "doi": ""
    },
    {
      "text": "Ece Kamar. 2016. Directions in Hybrid Intelligence: Complementing AI Systems with Human Intelligence.. In IJCAI. 4070–4073.",
      "doi": ""
    },
    {
      "text": "Steven J Karau and Kipling D Williams. 1993. Social loafing: A meta-analytic review and theoretical integration.Journal of personality and social psychology 65, 4(1993), 681.",
      "doi": ""
    },
    {
      "text": "Harmanpreet Kaur, Harsha Nori, Samuel Jenkins, Rich Caruana, Hanna Wallach, and Jennifer Wortman Vaughan. 2020. Interpreting Interpretability: Understanding Data Scientists’ Use of Interpretability Tools for Machine Learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376219"
    },
    {
      "text": "Norbert L Kerr, R Scott Tindale, 2004. Group performance and decision making. Annual review of psychology 55, 1 (2004), 623–655.",
      "doi": ""
    },
    {
      "text": "Antino Kim, Mochen Yang, and Jingjng Zhang. 2020. When Algorithms Err: Differential Impact of Early vs. Late Errors on Users’ Reliance on Algorithms. Late Errors on Users’ Reliance on Algorithms (July 2020) (2020).",
      "doi": ""
    },
    {
      "text": "Young Ji Kim, David Engel, Anita Williams Woolley, Jeffrey Yu-Ting Lin, Naomi McArthur, and Thomas W Malone. 2017. What makes a strong team? Using collective intelligence to predict team performance in League of Legends. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 2316–2329.",
      "doi": ""
    },
    {
      "text": "Keith Kirkpatrick. 2017. It’s not the algorithm, it’s the data. Commun. ACM 60, 2 (2017), 21–23.",
      "doi": "10.1145/3022181"
    },
    {
      "text": "Asher Koriat. 2012. When are two heads better than one and why?Science 336, 6079 (2012), 360–362.",
      "doi": ""
    },
    {
      "text": "Vivian Lai, Chacha Chen, Q Vera Liao, Alison Smith-Renner, and Chenhao Tan. 2021. Towards a science of human-ai decision making: a survey of empirical studies. arXiv preprint arXiv:2112.11471(2021).",
      "doi": ""
    },
    {
      "text": "Vivian Lai, Han Liu, and Chenhao Tan. 2020. \" Why is’ Chicago’deceptive?\" Towards Building Model-Driven Tutorials for Humans. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376873"
    },
    {
      "text": "Vivian Lai and Chenhao Tan. 2019. On human predictions with explanations and predictions of machine learning models: A case study on deception detection. In Proceedings of the conference on fairness, accountability, and transparency. 29–38.",
      "doi": "10.1145/3287560.3287590"
    },
    {
      "text": "Molly K Land and Jay D Aronson. 2020. Human rights and technology: new challenges for justice and accountability. Annual Review of Law and Social Science (Forthcoming) (2020).",
      "doi": ""
    },
    {
      "text": "Jeff Larson, Surya Mattu, Lauren Kirchner, and Julia Angwin. 2016. How we analyzed the COMPAS recidivism algorithm. ProPublica (5 2016) 9, 1 (2016), 3–3.",
      "doi": ""
    },
    {
      "text": "James R Larson Jr. 2013. In search of synergy in small group performance. Psychology Press.",
      "doi": ""
    },
    {
      "text": "James R Larson Jr, Pennie G Foster-Fishman, and Timothy M Franz. 1998. Leadership style and the discussion of shared and unshared information in decision-making groups. Personality and Social Psychology Bulletin 24, 5 (1998), 482–495.",
      "doi": ""
    },
    {
      "text": "Patrick R Laughlin and John Adamopoulos. 1980. Social combination processes and individual learning for six-person cooperative groups on an intellective task.Journal of Personality and Social Psychology 38, 6(1980), 941.",
      "doi": ""
    },
    {
      "text": "Patrick R Laughlin, Bryan L Bonner, and Andrew G Miner. 2002. Groups perform better than the best individuals on letters-to-numbers problems. Organizational Behavior and Human Decision Processes 88, 2 (2002), 605–620.",
      "doi": ""
    },
    {
      "text": "Daniel Levi and David A Askay. 2020. Group dynamics for teams. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Brian Y Lim, Anind K Dey, and Daniel Avrahami. 2009. Why and why not explanations improve the intelligibility of context-aware intelligent systems. In Proceedings of the SIGCHI conference on human factors in computing systems. 2119–2128.",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Zachary C Lipton. 2018. The mythos of model interpretability: In machine learning, the concept of interpretability is both important and slippery.Queue 16, 3 (2018), 31–57.",
      "doi": "10.1145/3236386.3241340"
    },
    {
      "text": "Han Liu, Vivian Lai, and Chenhao Tan. 2021. Understanding the Effect of Out-of-distribution Examples and Interactive Explanations on Human-AI Decision Making. arXiv preprint arXiv:2101.05303(2021).",
      "doi": ""
    },
    {
      "text": "Jennifer M Logg, Julia A Minson, and Don A Moore. 2019. Algorithm appreciation: People prefer algorithmic to human judgment. Organizational Behavior and Human Decision Processes 151 (2019), 90–103.",
      "doi": ""
    },
    {
      "text": "Zhuoran Lu and Ming Yin. 2021. Human Reliance on Machine Learning Models When Performance Feedback is Limited: Heuristics and Risks. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3411764.3445562"
    },
    {
      "text": "Pamela J Ludford, Dan Cosley, Dan Frankowski, and Loren Terveen. 2004. Think different: increasing online community participation using uniqueness and group dissimilarity. In Proceedings of the SIGCHI conference on Human factors in computing systems. 631–638.",
      "doi": "10.1145/985692.985772"
    },
    {
      "text": "Merce Mach, Simon Dolan, and Shay Tzafrir. 2010. The differential effect of team members’ trust on team performance: The mediation role of team cohesion. Journal of Occupational and Organizational Psychology 83, 3(2010), 771–794.",
      "doi": ""
    },
    {
      "text": "Andrew Mao, Winter Mason, Siddharth Suri, and Duncan J Watts. 2016. An experimental study of team size and performance on a complex task. PloS one 11, 4 (2016), e0153048.",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon’s Mechanical Turk. Behavior research methods 44, 1 (2012), 1–23.",
      "doi": ""
    },
    {
      "text": "Winter Mason and Duncan J Watts. 2012. Collaborative learning in networks. Proceedings of the National Academy of Sciences 109, 3 (2012), 764–769.",
      "doi": ""
    },
    {
      "text": "Nathan J McNeese, Beau G Schelble, Lorenzo Barberis Canonico, and Mustafa Demir. 2021. Who/What Is My Teammate? Team Composition Considerations in Human–AI Teaming. IEEE Transactions on Human-Machine Systems 51, 4 (2021), 288–299.",
      "doi": ""
    },
    {
      "text": "Ninareh Mehrabi, Fred Morstatter, Nripsuta Saxena, Kristina Lerman, and Aram Galstyan. 2021. A survey on bias and fairness in machine learning. ACM Computing Surveys (CSUR) 54, 6 (2021), 1–35.",
      "doi": "10.1145/3457607"
    },
    {
      "text": "Larry K Michaelsen, Warren E Watson, and Robert H Black. 1989. A realistic test of individual versus group consensus decision making.Journal of applied psychology 74, 5 (1989), 834.",
      "doi": ""
    },
    {
      "text": "Dena F Mujtaba and Nihar R Mahapatra. 2019. Ethical considerations in AI-based recruitment. In 2019 IEEE International Symposium on Technology and Society (ISTAS). IEEE, 1–7.",
      "doi": ""
    },
    {
      "text": "Geoff Musick, Thomas A O’Neill, Beau G Schelble, Nathan J McNeese, and Jonn B Henke. 2021. What Happens When Humans Believe Their Teammate is an AI? An Investigation into Humans Teaming with Autonomy. Computers in Human Behavior 122 (2021), 106852.",
      "doi": ""
    },
    {
      "text": "David G Myers and Helmut Lamm. 1976. The group polarization phenomenon.Psychological bulletin 83, 4 (1976), 602.",
      "doi": ""
    },
    {
      "text": "Richard Nadeau, Edouard Cloutier, and J-H Guay. 1993. New evidence about the existence of a bandwagon effect in the opinion formation process. International Political Science Review 14, 2 (1993), 203–213.",
      "doi": ""
    },
    {
      "text": "Lisa Hope Pelled, Kathleen M Eisenhardt, and Katherine R Xin. 1999. Exploring the black box: An analysis of work group diversity, conflict and performance. Administrative science quarterly 44, 1 (1999), 1–28.",
      "doi": ""
    },
    {
      "text": "Kaśka Porayska-Pomsta and Gnanathusharan Rajendran. 2019. Accountability in human and artificial intelligence decision-making as the basis for diversity and educational inclusion. In Artificial intelligence and inclusive education. Springer, 39–59.",
      "doi": ""
    },
    {
      "text": "Forough Poursabzi-Sangdeh, Daniel G Goldstein, Jake M Hofman, Jennifer Wortman Wortman Vaughan, and Hanna Wallach. 2021. Manipulating and measuring model interpretability. In Proceedings of the 2021 CHI conference on human factors in computing systems. 1–52.",
      "doi": "10.1145/3411764.3445315"
    },
    {
      "text": "Emilee Rader, Kelley Cotter, and Janghee Cho. 2018. Explanations as mechanisms for supporting algorithmic transparency. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173677"
    },
    {
      "text": "Amy Rechkemmer and Ming Yin. 2022. When Confidence Meets Accuracy: Exploring the Effects of Multiple Performance Indicators on Trust in Machine Learning Models. In CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": ""
    },
    {
      "text": "Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. \" Why should i trust you?\" Explaining the predictions of any classifier. In Proceedings of the 22nd ACM SIGKDD international conference on knowledge discovery and data mining. 1135–1144.",
      "doi": "10.1145/2939672.2939778"
    },
    {
      "text": "Niloufar Salehi, Andrew McCabe, Melissa Valentine, and Michael Bernstein. 2017. Huddler: Convening stable and familiar crowd teams despite unpredictable availability. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 1700–1713.",
      "doi": "10.1145/2998181.2998300"
    },
    {
      "text": "Julian Sanchez, Wendy A Rogers, Arthur D Fisk, and Ericka Rovira. 2014. Understanding reliance on automation: effects of error type, error distribution, age and experience. Theoretical issues in ergonomics science 15, 2 (2014), 134–160.",
      "doi": ""
    },
    {
      "text": "Donghee Shin. 2020. User perceptions of algorithmic decisions in the personalized AI system: perceptual evaluation of fairness, accountability, transparency, and explainability. Journal of Broadcasting & Electronic Media 64, 4 (2020), 541–565.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2020. Human-centered artificial intelligence: Reliable, safe & trustworthy. International Journal of Human–Computer Interaction 36, 6(2020), 495–504.",
      "doi": ""
    },
    {
      "text": "Tony Simons, Lisa Hope Pelled, and Ken A Smith. 1999. Making use of difference: Diversity, debate, and decision comprehensiveness in top management teams. Academy of management journal 42, 6 (1999), 662–673.",
      "doi": ""
    },
    {
      "text": "Joachim Stempfle and Petra Badke-Schaub. 2002. Thinking in design teams-an analysis of team communication. Design studies 23, 5 (2002), 473–496.",
      "doi": ""
    },
    {
      "text": "Harini Suresh, Natalie Lao, and Ilaria Liccardi. 2020. Misplaced Trust: Measuring the Interference of Machine Learning in Human Decision-Making. In 12th ACM Conference on Web Science. 315–324.",
      "doi": ""
    },
    {
      "text": "James Surowiecki. 2005. The wisdom of crowds. Anchor.",
      "doi": ""
    },
    {
      "text": "Suzanne Tolmeijer, Markus Christen, Serhiy Kandul, Markus Kneer, and Abraham Bernstein. 2022. Capable but Amoral? Comparing AI and Human Expert Collaboration in Ethical Decision Making. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": ""
    },
    {
      "text": "Suzanne Tolmeijer, Ujwal Gadiraju, Ramya Ghantasala, Akshit Gupta, and Abraham Bernstein. 2021. Second Chance for a First Impression? Trust Development in Intelligent System Interaction. In Proceedings of the 29th ACM Conference on User Modeling, Adaptation and Personalization (UMAP 2021).",
      "doi": "10.1145/3450613.3456817"
    },
    {
      "text": "Ray Tsaih, Yenshan Hsu, and Charles C Lai. 1998. Forecasting S&P 500 stock index futures with a hybrid AI system. Decision support systems 23, 2 (1998), 161–174.",
      "doi": ""
    },
    {
      "text": "Michael Veale, Max Van Kleek, and Reuben Binns. 2018. Fairness and accountability design needs for algorithmic support in high-stakes public sector decision-making. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3174014"
    },
    {
      "text": "Oleksandra Vereschak, Gilles Bailly, and Baptiste Caramiaux. 2021. How to evaluate trust in AI-assisted decision making? A survey of empirical methodologies. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–39.",
      "doi": "10.1145/3476068"
    },
    {
      "text": "Victor H Vroom. 2000. Leadership and the decision-making process. Organizational dynamics 28, 4 (2000), 82–94.",
      "doi": ""
    },
    {
      "text": "Daisuke Wakabayashi. 2018. Self-driving Uber car kills pedestrian in Arizona, where robots roam. The New York Times 19, 03 (2018).",
      "doi": ""
    },
    {
      "text": "Ruotong Wang, F Maxwell Harper, and Haiyi Zhu. 2020. Factors influencing perceived fairness in algorithmic decision-making: Algorithm outcomes, development procedures, and individual differences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376813"
    },
    {
      "text": "Xinru Wang, Zhuoran Lu, and Ming Yin. 2022. Will You Accept the AI Recommendation? Predicting Human Behavior in AI-Assisted Decision Making. In Proceedings of the ACM Web Conference 2022. 1697–1708.",
      "doi": "10.1145/3485447.3512240"
    },
    {
      "text": "Xinru Wang and Ming Yin. 2021. Are explanations helpful? a comparative study of the effects of explanations in ai-assisted decision-making. In 26th International Conference on Intelligent User Interfaces. 318–328.",
      "doi": "10.1145/3397481.3450650"
    },
    {
      "text": "Xinru Wang and Ming Yin. 2022. Effects of Explanations in AI-Assisted Decision Making: Principles and Comparisons. ACM Transactions on Interactive Intelligent Systems (TiiS) (2022).",
      "doi": ""
    },
    {
      "text": "Jenny S Wesche and Andreas Sonderegger. 2019. When computers take the lead: The automation of leadership. Computers in Human Behavior 101 (2019), 197–209.",
      "doi": ""
    },
    {
      "text": "Anita Williams Woolley, Christopher F Chabris, Alex Pentland, Nada Hashmi, and Thomas W Malone. 2010. Evidence for a collective intelligence factor in the performance of human groups. science 330, 6004 (2010), 686–688.",
      "doi": ""
    },
    {
      "text": "Edward F Wright and Gary L Wells. 1985. Does group discussion attenuate the dispositional bias?Journal of Applied Social Psychology 15, 6 (1985), 531–546.",
      "doi": ""
    },
    {
      "text": "Fumeng Yang, Zhuanyi Huang, Jean Scholtz, and Dustin L Arendt. 2020. How do visual explanations foster end users’ appropriate trust in machine learning?. In Proceedings of the 25th International Conference on Intelligent User Interfaces. 189–201.",
      "doi": "10.1145/3377325.3377480"
    },
    {
      "text": "Michael Yeomans, Anuj Shah, Sendhil Mullainathan, and Jon Kleinberg. 2019. Making sense of recommendations. Journal of Behavioral Decision Making 32, 4 (2019), 403–414.",
      "doi": ""
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna Wallach. 2019. Understanding the effect of accuracy on trust in machine learning models. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300509"
    },
    {
      "text": "Kun Yu, Shlomo Berkovsky, Ronnie Taib, Jianlong Zhou, and Fang Chen. 2019. Do I Trust My Machine Teammate? An Investigation from Perception to Decision. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 460–468. https://doi.org/10.1145/3301275.3302277",
      "doi": "10.1145/3301275.3302277"
    },
    {
      "text": "Muhammad Bilal Zafar, Isabel Valera, Manuel Gomez Rodriguez, and Krishna P Gummadi. 2017. Fairness beyond disparate treatment & disparate impact: Learning classification without disparate mistreatment. In Proceedings of the 26th international conference on world wide web. 1171–1180.",
      "doi": "10.1145/3038912.3052660"
    },
    {
      "text": "Rui Zhang, Nathan J McNeese, Guo Freeman, and Geoff Musick. 2021. \" An Ideal Human\" Expectations of AI Teammates in Human-AI Teaming. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–25.",
      "doi": ""
    },
    {
      "text": "Yunfeng Zhang, Q Vera Liao, and Rachel KE Bellamy. 2020. Effect of confidence and explanation on accuracy and trust calibration in AI-assisted decision making. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. 295–305.",
      "doi": "10.1145/3351095.3372852"
    },
    {
      "text": "Zijian Zhang, Jaspreet Singh, Ujwal Gadiraju, and Avishek Anand. 2019. Dissonance between human and machine understanding. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359158"
    },
    {
      "text": "Sharon Zhou, Melissa Valentine, and Michael S Bernstein. 2018. In search of the dream team: Temporally constrained multi-armed bandits for identifying effective team structures. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173682"
    }
  ]
}