{
  "doi": "10.1145/3544548.3580839",
  "title": "Older Adults Using Technology for Meaningful Activities During COVID-19: An Analysis Through the Lens of Self-Determination Theory",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Restrictions during the COVID-19 pandemic significantly affected people's opportunities to engage in activities that are meaningful to their lives. In response to these constraints, many people, including older adults, turned to digital technologies as alternative ways to pursue meaningful activities. These technology-mediated activities, however, presented new challenges for older adults’ everyday use of technology. In this paper, we investigate how older adults used digital technologies for meaningful activities during COVID-19 restrictions. We conducted in-depth interviews with 40 older adults and analyzed the interview data through the lens of self-determination theory (SDT). Our analysis shows that using digital technologies for meaningful activities can both support and undermine older people's three basic psychological needs for autonomy, competence, and relatedness. We argue that future technologies should be designed to empower older adults’ content creation, engagement in personal interests, exploration of technology, effortful communication, and participation in beneficent activities.",
  "authors": [
    {
      "name": "Wei Zhao",
      "institution": "School of Computing and Information Systems, The University of Melbourne, Australia",
      "img": "/do/10.1145/contrib-99659899383/rel-imgonly/img_6206.jpg",
      "acmid": "99659899383",
      "orcid": "0000-0002-4025-6639"
    },
    {
      "name": "Ryan M. Kelly",
      "institution": "School of Computing and Information Systems, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365229",
      "orcid": "0000-0002-8773-6656"
    },
    {
      "name": "Melissa J. Rogerson",
      "institution": "School of Computing and Information Systems, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020899",
      "orcid": "0000-0002-9851-6608"
    },
    {
      "name": "Jenny Waycott",
      "institution": "School of Computing and Information Systems, The University of Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100550581/rel-imgonly/jwaycottheadshot2.jpg",
      "acmid": "81100550581",
      "orcid": "0000-0002-4634-0532"
    }
  ],
  "references": [
    {
      "text": "Aloha Hufana Ambe, Margot Brereton, Alessandro Soro, Min Zhen Chai, Laurie Buys and Paul Roe. 2019. Older people inventing their personal internet of things with the IoT un-kit experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1-15.",
      "doi": "10.1145/3290605.3300552"
    },
    {
      "text": "Australian Bureau of Statistics. 2018. Census of Population and Housing: Socio-Economic Indexes for Areas (SEIFA), Australia. Retrieved from https://www.abs.gov.au/ausstats/abs@.nsf/mf/2033.0.55.001.",
      "doi": ""
    },
    {
      "text": "Steven Baker, Jeni Warburton, Jenny Waycott, Frances Batchelor, Thuong Hoang, Briony Dow, Elizabeth Ozanne and Frank Vetere. 2018. Combatting social isolation and increasing social participation of older adults through the use of technology: A systematic review of existing evidence. Australasian journal on ageing 37, 3, 184-193.",
      "doi": ""
    },
    {
      "text": "Belén Barros Pena, Rachel E. Clarke, Lars Erik Holmquist and John Vines. 2021. Circumspect Users: Older Adults as Critical Adopters and Resistors of Technology. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1-14. http://dx.doi.org/10.1145/3411764.3445128",
      "doi": "10.1145/3411764.3445128"
    },
    {
      "text": "Jeanie Beh, Sonja Pedell and Wendy Doubé. 2016. Evaluation of interest-bridge model: older adults meditated learning of mobile technology. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. 293-301. http://dx.doi.org/10.1145/3010915.3010943",
      "doi": "10.1145/3010915.3010943"
    },
    {
      "text": "Tony Blakely, Jason Thompson, Laxman Bablani, Patrick Andersen, Driss Ait Ouakrim, Natalie Carvalho, Patrick Abraham, Marie-Anne Boujaoude, Ameera Katar, Edifofon Akpan, Nick Wilson and Mark Stevenson. 2021. Association of Simulated COVID-19 Policy Responses for Social Restrictions and Lockdowns With Health-Adjusted Life-Years and Costs in Victoria, Australia. JAMA Health Forum 2, 7, e211749-e211749. http://dx.doi.org/10.1001/jamahealthforum.2021.1749",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Dominic Furniss and Stephann Makri. 2016. Qualitative HCI research: Going behind the scenes. Synthesis lectures on human-centered informatics 9, 1, 1-115.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2, 77-101.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Thematic analysis. Analysing qualitative data in psychology. London: Sage Publications Ltd, 128-147.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gina Venolia and John C. Tang. 2012. Focusing on shared experiences: moving beyond the camera in video communication. In Proceedings of the Designing Interactive Systems Conference. Association for Computing Machinery, Newcastle Upon Tyne, United Kingdom, 96–105. http://dx.doi.org/10.1145/2317956.2317973",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Oliver Kisalay Burmeister. 2012. What seniors value about online community. Journal of community informatics 8, 1, 1-12.",
      "doi": ""
    },
    {
      "text": "Rafael A Calvo and Dorian Peters. 2014. Positive computing: technology for wellbeing and human potential. MIT press,",
      "doi": "10.5555/2627995"
    },
    {
      "text": "John M. Carroll, Gregorio Convertino, Umer Farooq and Mary Beth Rosson. 2012. The firekeepers: aging considered as a resource. Univers. Access Inf. Soc. 11, 1, 7–15. http://dx.doi.org/10.1007/s10209-011-0229-9",
      "doi": "10.1007/s10209-011-0229-9"
    },
    {
      "text": "Montserrat Celdrán, Rodrigo Serrat and Feliciano Villar. 2019. Older adults as internet content producers: Motivations for blogging in later life. In Perspectives on human-computer interaction research with older people, Springer, 169-182.",
      "doi": ""
    },
    {
      "text": "Triparna De Vreede, Mukhunth Raghavan and Gert-Jan De Vreede. 2021. Design Foundations for AI Assisted Decision Making: A Self Determination Theory Approach.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and AC Möller. 2005. The Concept of Competence: A Starting Place for Understanding Intrinsic Motivation and Self-Determined Extrinsic Motivation. In Handbook of competence and motivation: Theory and application. , New York: The Guilford Press.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 1994. Promoting self‐determined education. Scandinavian journal of educational research 38, 1, 3-14.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Maarten Vansteenkiste. 2003. Self-determination theory and basic need satisfaction: Understanding human development in positive psychology.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 1985. Self-determination and intrinsic motivation in human behavior. EL Deci, RM Ryan.–1985.",
      "doi": ""
    },
    {
      "text": "Kelli Dendle, Laurie Buys, Desley Vine and Tracy Washington. 2022. Fears and freedoms: A qualitative analysis of older adults’ basic psychological needs for autonomy, competence, relatedness and beneficence. Australasian journal on ageing 41, 2, 229-236.",
      "doi": ""
    },
    {
      "text": "Tao Deng, Shaheen Kanthawala, Jingbo Meng, Wei Peng, Anastasia Kononova, Qi Hao, Qinhao Zhang and Prabu David. 2019. Measuring smartphone usage and task switching with log tracking and self-reports. Mobile Media & Communication 7, 1, 3-23.",
      "doi": ""
    },
    {
      "text": "Gillian Dowds, Margaret Currie, Lorna Philip and Judith Masthoff. 2018. A window to the outside world. Digital technology to stimulate imaginative mobility for housebound older adults in rural areas. In Geographies of transport and ageing, Springer, 101-130.",
      "doi": ""
    },
    {
      "text": "Aaron M Eakman. 2013. Relationships between meaningful activity, basic psychological needs, and meaning in life: Test of the meaningful activity and life meaning model. OTJR: Occupation, Participation and Health 33, 2, 100-109.",
      "doi": ""
    },
    {
      "text": "Aaron M Eakman. 2014. A prospective longitudinal study testing relationships between meaningful activities, basic psychological needs fulfillment, and meaning in life. OTJR: occupation, participation and health 34, 2, 93-105.",
      "doi": ""
    },
    {
      "text": "Aaron M. Eakman, Mike E. Carlson and Florence A. Clark. 2010. The Meaningful Activity Participation Assessment: A Measure of Engagement in Personally Valued Activities. The International Journal of Aging and Human Development 70, 4, 299-317. http://dx.doi.org/10.2190/AG.70.4.b",
      "doi": ""
    },
    {
      "text": "Martin J Eppler and Jeanne Mengis. 2008. The concept of information overload-a review of literature from organization science, accounting, marketing, mis, and related disciplines (2004). Kommunikationsmanagement im Wandel, 271-305.",
      "doi": ""
    },
    {
      "text": "Susan M Ferreira, Sergio Sayago and Josep Blat. 2017. Older people's production and appropriation of digital videos: an ethnographic study. Behaviour & Information Technology 36, 6, 557-574.",
      "doi": "10.5555/3100515.3100516"
    },
    {
      "text": "Matthew Ford, Peta Wyeth and Daniel Johnson. 2012. Self-determination theory as applied to the design of a software learning system using whole-body controls. In Proceedings of the 24th Australian Computer-Human Interaction Conference. Association for Computing Machinery, Melbourne, Australia, 146–149. http://dx.doi.org/10.1145/2414536.2414562",
      "doi": "10.1145/2414536.2414562"
    },
    {
      "text": "Grant Gibson, Claire Dickinson, Katie Brittain and Louise Robinson. 2019. Personalisation, customisation and bricolage: how people with dementia and their families make assistive technology work for them. Ageing & Society 39, 11, 2502-2519.",
      "doi": ""
    },
    {
      "text": "Bluma Goldberg, E Sharon Brintnell and Jack Goldberg. 2002. The relationship between engagement in meaningful activities and quality of life in persons disabled by mental illness. Occupational Therapy in Mental Health 18, 2, 17-44.",
      "doi": ""
    },
    {
      "text": "Emily A Greenfield and Nadine F Marks. 2004. Formal volunteering as a protective factor for older adults' psychological well-being. The Journals of Gerontology Series B: Psychological Sciences and Social Sciences 59, 5, S258-S264.",
      "doi": ""
    },
    {
      "text": "Babita Gupta and Anitha Chennamaneni. 2018. Understanding Online Privacy Protection Behavior of the Older Adults: An Empirical Investigation. J. Inf. Technol. Manag. 29, 3, 1-13.",
      "doi": ""
    },
    {
      "text": "Kristen R Haase, Theodore Cosco, Lucy Kervin, Indira Riadi and Megan E O'Connell. 2021. Older Adults’ Experiences With Using Technology for Socialization During the COVID-19 Pandemic: Cross-sectional Survey Study. JMIR aging 4, 2, e28010.",
      "doi": ""
    },
    {
      "text": "Dave Harley and Geraldine Fitzpatrick. 2009. YouTube and intergenerational communication: the case of Geriatric1927. Universal access in the information society 8, 1, 5-20.",
      "doi": ""
    },
    {
      "text": "Olivier A Blanson Henkemans, Bert PB Bierman, Joris Janssen, Rosemarijn Looije, Mark A Neerincx, Marierose MM van Dooren, Jitske LE de Vries, Gert Jan van der Burg and Sasja D Huisman. 2017. Design and evaluation of a personal robot playing a self-management education game with children with diabetes type 1. International Journal of Human-Computer Studies 106, 63-76.",
      "doi": ""
    },
    {
      "text": "RSM Heung and Jean Tak Alice Loke Yuen. 2012. Leisure and older people: a concept analysis, and implications for nursing. The International journal of aging in society: an interdisciplinary journal 1, 2, 55-68.",
      "doi": ""
    },
    {
      "text": "Stephanie A Hooker, Kevin S Masters, Kaitlyn M Vagnini and Christina L Rush. 2020. Engaging in personally meaningful activities is associated with meaning salience and psychological well-being. The Journal of Positive Psychology 15, 6, 821-831.",
      "doi": ""
    },
    {
      "text": "Alexis Hope, Ted Schwaba and Anne Marie Piper. 2014. Understanding digital and material social communications for older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3903-3912.",
      "doi": "10.1145/2556288.2557133"
    },
    {
      "text": "Lixiao Huang. 2017. Qualitative Analysis of the Application of Self-Determination Theory in Robotics Tournaments. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. Association for Computing Machinery, Vienna, Austria, 135–136. http://dx.doi.org/10.1145/3029798.3038342",
      "doi": "10.1145/3029798.3038342"
    },
    {
      "text": "Carroll E Izard and Brian P Ackerman. 2000. Motivational, organizational, and regulatory functions of discrete emotions. Handbook of emotions 2, 253-264.",
      "doi": ""
    },
    {
      "text": "Ben Jelen, Anne Freeman, Mina Narayanan, Kate M Sanders, James Clawson and Katie A Siek. 2019. Craftec: Engaging older adults in making through a craft-based toolkit system. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction. 577-587.",
      "doi": "10.1145/3294109.3295636"
    },
    {
      "text": "Ryan Kelly, Daniel Gooch, Bhagyashree Patil and Leon Watts. 2017. Demanding by design: Supporting effortful communication practices in close personal relationships. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 70-83.",
      "doi": "10.1145/2998181.2998184"
    },
    {
      "text": "Wiesław Kopeć, Bartłomiej Balcerzak, Radoslaw Nielek, Grzegorz Kowalik, Adam Wierzbicki and Fabio Casati. 2018. Older adults and hackathons: a qualitative study. In Proceedings of the 40th International Conference on Software Engineering. Association for Computing Machinery, Gothenburg, Sweden, 702–703. http://dx.doi.org/10.1145/3180155.3182547",
      "doi": "10.1145/3180155.3182547"
    },
    {
      "text": "Hanna Köttl, Ella Cohn-Schwartz and Liat Ayalon. 2021. Self-perceptions of aging and everyday ICT engagement: A test of reciprocal associations. The Journals of Gerontology: Series B 76, 9, 1913-1922.",
      "doi": ""
    },
    {
      "text": "Hanna Köttl, Vera Gallistl, Rebekka Rohner and Liat Ayalon. 2021. “But at the age of 85? Forget it!”: Internalized ageism, a barrier to technology use. Journal of Aging Studies 59, 100971.",
      "doi": ""
    },
    {
      "text": "Shalini Lal, Michael Ungar, Carl Leggo, Ashok Malla, James Frankish and Melinda J Suto. 2013. Well-being and engagement in valued activities: experiences of young people with psychosis. OTJR: occupation, participation and health 33, 4, 190-197.",
      "doi": ""
    },
    {
      "text": "A. Lazar, A. Pradhan, B. Jelen, K. A. Siek and A. Leitch. 2021. Studying the Formation of an Older Adult-Led Makerspace. Proc SIGCHI Conf Hum Factor Comput Syst 593, 1-11. http://dx.doi.org/10.1145/3411764.3445146",
      "doi": "10.1145/3411764.3445146"
    },
    {
      "text": "Young S Lee, Shirley Chaysinh, Santosh Basapur, Crysta J Metcalf and Hiren Mandalia. 2012. Active aging in community centers and ICT design implications. In Proceedings of the Designing Interactive Systems Conference. 156-165.",
      "doi": "10.1145/2317956.2317981"
    },
    {
      "text": "Siân E Lindley, Richard Harper and Abigail Sellen. 2009. Desiring to be in touch in a changing communications landscape: attitudes of older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1693-1702.",
      "doi": "10.1145/1518701.1518962"
    },
    {
      "text": "Siân E. Lindley. 2012. Shades of lightweight: supporting cross-generational communication through home messaging. Univers. Access Inf. Soc. 11, 1, 31–43. http://dx.doi.org/10.1007/s10209-011-0231-2",
      "doi": "10.1007/s10209-011-0231-2"
    },
    {
      "text": "Stephen Lindsay, Daniel Jackson, Guy Schofield and Patrick Olivier. 2012. Engaging older people using participatory design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1199-1208.",
      "doi": "10.1145/2207676.2208570"
    },
    {
      "text": "Jason B. Luoma, Steven C. Hayes and Robyn D. Walser. 2007. Learning ACT: An acceptance and commitment therapy skills-training manual for therapists. New Harbinger Publications, Oakland, CA, US.",
      "doi": ""
    },
    {
      "text": "Cayley MacArthur, Caroline Wong and Mark Hancock. 2019. Makers and quilters: Investigating opportunities for improving gender-imbalanced maker groups. Proceedings of the ACM on Human-Computer Interaction 3, CSCW, 1-24.",
      "doi": ""
    },
    {
      "text": "Uwe Matzat and Bert Sadowski. 2012. Does the “do-it-yourself approach” reduce digital inequality? Evidence of self-learning of digital skills. The Information Society 28, 1, 1-12.",
      "doi": ""
    },
    {
      "text": "Sandra Miranda, Ana Cristina Antunes and Ana Gama. 2022. A different type of influencer? Examining senior Instagram influencers communication. In Proceedings of the 9th European Conference on Social Media. Academic Conferences International, 130-136.",
      "doi": ""
    },
    {
      "text": "A. B. Neubauer, O. K. Schilling and H. W. Wahl. 2017. What Do We Need at the End of Life? Competence, but not Autonomy, Predicts Intraindividual Fluctuations in Subjective Well-Being in Very Old Age. J Gerontol B Psychol Sci Soc Sci 72, 3, 425-435. http://dx.doi.org/10.1093/geronb/gbv052",
      "doi": ""
    },
    {
      "text": "Reuben Ng and Nicole Indran. 2022. Not Too Old for TikTok: How Older Adults are Reframing Aging. The Gerontologist.",
      "doi": ""
    },
    {
      "text": "Novia Nurain, Clara Caldeira and Kay Connelly. 2021. Older Adults’ Experiences of Autonomy During COVID-19 Pandemic. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1-6. http://dx.doi.org/10.1145/3411763.3451674",
      "doi": "10.1145/3411763.3451674"
    },
    {
      "text": "Novia Nurain, Chia-Fang Chung, Clara Caldeira and Kay Connelly. 2021. Hugging with a Shower Curtain: Older Adults' Social Support Realities During the COVID-19 Pandemic. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 463. http://dx.doi.org/10.1145/3479607",
      "doi": "10.1145/3479607"
    },
    {
      "text": "Wanda J Orlikowski. 2000. Using technology and constituting structures: A practice lens for studying technology in organizations. Organization science 11, 4, 404-428.",
      "doi": ""
    },
    {
      "text": "Rebecca Owen, Katherine Berry and Laura JE Brown. 2021. Enhancing older adults’ well-being and quality of life through purposeful activity: A systematic review of intervention studies. The Gerontologist.",
      "doi": ""
    },
    {
      "text": "Alison Phinney, Habib Chaudhury and Deborah L O'connor. 2007. Doing as much as I can do: The meaning of activity for people with dementia. Aging and Mental Health 11, 4, 384-393.",
      "doi": ""
    },
    {
      "text": "Ivana Piterová. 2020. Older Adults Vulnerability to Fraud: Narrative Review Study. Work and Organizational Psychology, 49.",
      "doi": ""
    },
    {
      "text": "Arlind Reuter, Tom Bartindale, Kellie Morrissey, Thomas Scharf and Jennifer Liddle. 2019. Older Voices: Supporting Community Radio Production for Civic Participation in Later Life. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Glasgow, Scotland Uk, Paper 434. http://dx.doi.org/10.1145/3290605.3300664",
      "doi": "10.1145/3290605.3300664"
    },
    {
      "text": "Arlind Reuter and Jennifer Liddle. 2020. The Later Life Audio and Radio Co-operative: considering radio as a technology to promote citizen dialogue in later life. In 9th International Conference on Software Development and Technologies for Enhancing Accessibility and Fighting Info-exclusion. 153-157.",
      "doi": "10.1145/3439231.3439237"
    },
    {
      "text": "Arlind Reuter, Thomas Scharf and Jan Smeddinck. 2021. Content Creation in Later Life: Reconsidering Older Adults' Digital Participation and Inclusion. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3, 1-23.",
      "doi": "10.1145/3434166"
    },
    {
      "text": "Olivia K. Richards. 2017. Exploring the Empowerment of Older Adult Creative Groups Using Maker Technology. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, Denver, Colorado, USA, 166–171. http://dx.doi.org/10.1145/3027063.3048425",
      "doi": "10.1145/3027063.3048425"
    },
    {
      "text": "Olivia K. Richards, Gabriela Marcu and Robin N. Brewer. 2021. Hugs, Bible Study, and Speakeasies: Designing for Older Adults’ Multimodal Connectedness. In Designing Interactive Systems Conference 2021, Association for Computing Machinery, 815–831. http://dx.doi.org/10.1145/3461778.3462075",
      "doi": "10.1145/3461778.3462075"
    },
    {
      "text": "Valeria Righi, Sergio Sayago and Josep Blat. 2017. When we talk about older people in HCI, who are we talking about? Towards a ‘turn to community'in the design of technologies for a growing ageing population. International Journal of Human-Computer Studies 108, 15-31.",
      "doi": "10.1016/j.ijhcs.2017.06.005"
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, Margot Brereton, Kate L Vaisutis, Gary Marsden and Frank Vetere. 2014. Never too old: engaging retired people inventing the future with MaKey MaKey. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3913-3922.",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "Andrea L Rosso, Jennifer A Taylor, Loni Philip Tabb and Yvonne L Michael. 2013. Mobility, disability, and social engagement in older adults. Journal of aging and health 25, 4, 617-637.",
      "doi": ""
    },
    {
      "text": "Mary Beth Rosson and John M Carroll. 2003. Learning and collaboration across generations in a community. In Communities and technologies. Springer, 205-225.",
      "doi": ""
    },
    {
      "text": "Mary Beth Rosson, John M Carroll, Cheryl D Seals and Tracy L Lewis. 2002. Community design of community simulations. In Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques. 75-83.",
      "doi": "10.1145/778712.778726"
    },
    {
      "text": "Ljilja Ruzic, Seunghyun Tina Lee, Yilin Elaine Liu and Jon A Sanford. 2016. Development of universal design mobile interface guidelines (UDMIG) for aging population. In International Conference on Universal Access in Human-Computer Interaction. Springer, 98-108.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2017. Self-determination theory: Basic psychological needs in motivation, development, and wellness. Guilford Publications,",
      "doi": ""
    },
    {
      "text": "Rachel D Savage, Sophia Di Nicolo, Wei Wu, Joyce Li, Andrea Lawson, Jim Grieve, Vivek Goel and Paula A Rochon. 2022. The Factors Associated With Nonuse of Social Media or Video Communications to Connect With Friends and Family During the COVID-19 Pandemic in Older Adults: Web-Based Survey Study. JMIR aging 5, 2, e34793.",
      "doi": ""
    },
    {
      "text": "Sergio Sayago, Paula Forbes and Josep Blat. 2012. Older people's social sharing practices in YouTube through an ethnographical lens. In The 26th BCS Conference on Human Computer Interaction 26. 185-194.",
      "doi": ""
    },
    {
      "text": "Isabel Schwaninger, Christopher Frauenberger and Geraldine Fitzpatrick. 2020. Unpacking Forms of Relatedness around Older People and Telecare. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, Eindhoven, Netherlands, 163–169. http://dx.doi.org/10.1145/3393914.3395867",
      "doi": "10.1145/3393914.3395867"
    },
    {
      "text": "Kai Shu, Amrita Bhattacharjee, Faisal Alatawi, Tahora H Nazer, Kaize Ding, Mansooreh Karami and Huan Liu. 2020. Combating disinformation in a social media age. Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery 10, 6, e1385.",
      "doi": ""
    },
    {
      "text": "Frances Sin, Sophie Berger, Ig-Jae Kim and Dongwook Yoon. 2021. Digital Social Interaction in Older Adults During the COVID-19 Pandemic. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 380. http://dx.doi.org/10.1145/3479524",
      "doi": "10.1145/3479524"
    },
    {
      "text": "Stephanie Stewart, Terri S Hansen and Timothy A Carey. 2010. Opportunities for people with disabilities in the virtual world of Second Life. Rehabilitation Nursing 35, 6, 254-259.",
      "doi": ""
    },
    {
      "text": "Gareth Terry and Nikki Hayfield. 2020. Reflexive thematic analysis. In Handbook of qualitative research in education, Edward Elgar Publishing.",
      "doi": ""
    },
    {
      "text": "Laura Tierney and Elizabeth Beattie. 2020. Enjoyable, engaging and individualised: A concept analysis of meaningful activity for older adults with dementia. International journal of older people nursing 15, 2, e12306.",
      "doi": ""
    },
    {
      "text": "April Tyack and Elisa D. Mekler. 2020. Self-Determination Theory in HCI Games Research: Current Uses and Open Questions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, Association for Computing Machinery, 1–22. http://dx.doi.org/10.1145/3313831.3376723",
      "doi": "10.1145/3313831.3376723"
    },
    {
      "text": "Marie Jacqueline van de Goor. 2021. Wonderful life: The power of sharing and reflecting on meaningful moments. thesis. Univesity of Twente,",
      "doi": ""
    },
    {
      "text": "Kimberly S Van Haitsma, Kimberly Curyto, Katherine M Abbott, Gail L Towsley, Abby Spector and Morton Kleban. 2015. A randomized controlled trial for an individualized positive psychosocial intervention for the affective and behavioral symptoms of dementia in nursing home residents. Journals of Gerontology Series B: Psychological Sciences and Social Sciences 70, 1, 35-45.",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Frank Vetere and Elizabeth Ozanne. 2019. Building social connections: a framework for enriching older adults’ social connectedness through information and communication technologies. In Ageing and Digital Technology, Springer, 65-82.",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Lars Kulik, Elizabeth Ozanne, Alan Gruner and John Downs. 2013. Older adults as digital content producers. In Proceedings of the SIGCHI conference on human factors in computing systems. 39-48.",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Amee Morgans, Elizabeth Ozanne and Lars Kulik. 2016. Not For Me: Older Adults Choosing Not to Participate in a Social Isolation Intervention. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, San Jose, California, USA, 745–757. http://dx.doi.org/10.1145/2858036.2858458",
      "doi": "10.1145/2858036.2858458"
    },
    {
      "text": "Xi Yang and Marco Aurisicchio. 2021. Designing Conversational Agents: A Self-Determination Theory Approach. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Yokohama, Japan, Article 256. http://dx.doi.org/10.1145/3411764.3445445",
      "doi": "10.1145/3411764.3445445"
    },
    {
      "text": "Lei Zhang, Tianying Chen, Olivia Seow, Tim Chong, Sven Kratz, Yu Jiang Tham, Andrés Monroy-Hernández, Rajan Vaish and Fannie Liu. 2022. Auggie: Encouraging Effortful Communication through Handcrafted Digital Experiences. arXiv preprint arXiv:2207.07771.",
      "doi": ""
    },
    {
      "text": "Wei Zhao, Ryan Kelly, Melissa Rogerson and Jenny Waycott. 2022. Understanding Older Adults’ Participation in Online Social Activities: Lessons from the COVID-19 Pandemic. Proc. ACM Hum. -Comput. Interact 6, CSCW2, Article 470. http://dx.doi.org/10.1145/3555571",
      "doi": ""
    }
  ]
}