{
  "doi": "10.1145/3544548.3581055",
  "title": "ResType: Invisible and Adaptive Tablet Keyboard Leveraging Resting Fingers",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Text entry on tablet touchscreens is a basic need nowadays. Tablet keyboards require visual attention for users to locate keys, thus not supporting efficient touch typing. They also take up a large proportion of screen space, which affects the access to information. To solve these problems, we propose ResType, an adaptive and invisible keyboard on three-state touch surfaces (e.g. tablets with unintentional touch prevention). ResType allows users to rest their hands on it and automatically adapts the keyboard to the resting fingers. Thus, users do not need visual attention to locate keys, which supports touch typing. We quantitatively explored users’ resting finger patterns on ResType, based on which we proposed an augmented Bayesian decoding algorithm for ResType, with 96.3% top-1 and 99.0% top-3 accuracies. After a 5-day evaluation, ResType achieved 41.26 WPM, outperforming normal tablet keyboards by 13.5% and reaching 86.7% of physical keyboards. It solves the occlusion problem while maintaining comparable typing speed with current methods on visible tablet keyboards.",
  "tags": [
    "touch typing",
    "invisible keyboard",
    "adaptive keyboard",
    "text entry"
  ],
  "authors": [
    {
      "name": "Zhuojun Li",
      "institution": "Department of Computer Science and Technology, Tsinghua University, China",
      "img": "/do/10.1145/contrib-99659892344/rel-imgonly/idphoto-1m.jpg",
      "acmid": "99659892344",
      "orcid": "0000-0003-4374-9452"
    },
    {
      "name": "Chun Yu",
      "institution": "Department of Computer science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467660483",
      "orcid": "0000-0003-2591-7993"
    },
    {
      "name": "Yizheng Gu",
      "institution": "Department of Computer science and Technology, Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163360",
      "orcid": "0000-0002-1794-2171"
    },
    {
      "name": "Yuanchun Shi",
      "institution": "Department of Computer science and Technology, Tsinghua University, China and Qinghai University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647319",
      "orcid": "0000-0003-2273-6927"
    }
  ],
  "references": [
    {
      "text": "2018. The Project Precog. https://www.asus.com/Content/Project-Precog/",
      "doi": ""
    },
    {
      "text": "2022. The Sensel Morph. https://morph.sensel.com",
      "doi": ""
    },
    {
      "text": "Khaldoun Al Faraj, Mustapha Mojahid, and Nadine Vigouroux. 2009. BigKey: A Virtual Keyboard for Mobile Devices. In Human-Computer Interaction. Ambient, Ubiquitous and Intelligent Interaction, Julie A. Jacko (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 3–10.",
      "doi": "10.1007/978-3-642-02580-8_1"
    },
    {
      "text": "Ahmed Sabbir Arif, Benedikt Iltisberger, and Wolfgang Stuerzlinger. 2011. Extending Mobile User Ambient Awareness for Nomadic Text Entry. In Proceedings of the 23rd Australian Computer-Human Interaction Conference (Canberra, Australia) (OzCHI ’11). Association for Computing Machinery, New York, NY, USA, 21–30. https://doi.org/10.1145/2071536.2071539",
      "doi": "10.1145/2071536.2071539"
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2009. Analysis of text entry performance metrics. In 2009 IEEE Toronto International Conference Science and Technology for Humanity (TIC-STH). 100–105. https://doi.org/10.1109/TIC-STH.2009.5444533",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-Computer Interaction with Mobile Devices and Services (San Francisco, California, USA) (MobileHCI ’12). Association for Computing Machinery, New York, NY, USA, 251–260. https://doi.org/10.1145/2371574.2371612",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Tyler Baldwin and Joyce Chai. 2012. Towards Online Adaptation and Personalization of Key-Target Resizing for Mobile Devices. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (Lisbon, Portugal) (IUI ’12). Association for Computing Machinery, New York, NY, USA, 11–20. https://doi.org/10.1145/2166966.2166969",
      "doi": "10.1145/2166966.2166969"
    },
    {
      "text": "Daniel Buschek, Oliver Schoenleben, and Antti Oulasvirta. 2014. Improving Accuracy in Back-of-Device Multitouch Typing: A Clustering-Based Approach to Keyboard Updating. In Proceedings of the 19th International Conference on Intelligent User Interfaces (Haifa, Israel) (IUI ’14). Association for Computing Machinery, New York, NY, USA, 57–66. https://doi.org/10.1145/2557500.2557501",
      "doi": "10.1145/2557500.2557501"
    },
    {
      "text": "Lung-Pan Cheng, Hsiang-Sheng Liang, Che-Yang Wu, and Mike Y. Chen. 2013. IGrasp: Grasp-Based Adaptive Keyboard for Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 3037–3046. https://doi.org/10.1145/2470654.2481422",
      "doi": "10.1145/2470654.2481422"
    },
    {
      "text": "Elaine Lawrence Christian Sax, Hannes Lau. 2011. Liquid Keyboard : An Ergonomic, Adaptive QWERTY Keyboard for Touchscreens and Surfaces. http://hdl.handle.net/10453/16246",
      "doi": ""
    },
    {
      "text": "Guofeng Feng, Xiao Guo, Minsi Ren, Shuoming Zhang, and Jie Liu. 2020. NaviKey: An Invisible Keyboard with Navigation Keys. In The Eighth International Workshop of Chinese CHI (Honolulu, HI, USA) (Chinese CHI 2020). Association for Computing Machinery, New York, NY, USA, 61–64. https://doi.org/10.1145/3403676.3403684",
      "doi": "10.1145/3403676.3403684"
    },
    {
      "text": "Leah Findlater and Jacob Wobbrock. 2012. Personalized Input: Improving Ten-Finger Touchscreen Typing through Automatic Adaptation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 815–824. https://doi.org/10.1145/2207676.2208520",
      "doi": "10.1145/2207676.2208520"
    },
    {
      "text": "Leah Findlater, Jacob O. Wobbrock, and Daniel Wigdor. 2011. Typing on Flat Glass: Examining Ten-Finger Expert Typing Patterns on Touch Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2453–2462. https://doi.org/10.1145/1978942.1979301",
      "doi": "10.1145/1978942.1979301"
    },
    {
      "text": "Apostolos Gkoumas, Andreas Komninos, and John Garofalakis. 2016. Usability of Visibly Adaptive Smartphone Keyboard Layouts. In Proceedings of the 20th Pan-Hellenic Conference on Informatics (Patras, Greece) (PCI ’16). Association for Computing Machinery, New York, NY, USA, Article 40, 6 pages. https://doi.org/10.1145/3003733.3003743",
      "doi": "10.1145/3003733.3003743"
    },
    {
      "text": "Pupil Labs GmbH.2022. The Pupil Core gaze tracking device. https://pupil-labs.com/products/core/",
      "doi": ""
    },
    {
      "text": "Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N. Patel, and Jacob O. Wobbrock. 2013. ContextType: Using Hand Posture Information to Improve Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 2795–2798. https://doi.org/10.1145/2470654.2481386",
      "doi": "10.1145/2470654.2481386"
    },
    {
      "text": "Mayank Goel, Jacob Wobbrock, and Shwetak Patel. 2012. GripSense: Using Built-in Sensors to Detect Hand Posture and Pressure on Commodity Mobile Phones. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 545–554. https://doi.org/10.1145/2380116.2380184",
      "doi": "10.1145/2380116.2380184"
    },
    {
      "text": "Joshua Goodman, Gina Venolia, Keith Steury, and Chauncey Parker. 2002. Language Modeling for Soft Keyboards. In Proceedings of the 7th International Conference on Intelligent User Interfaces (San Francisco, California, USA) (IUI ’02). Association for Computing Machinery, New York, NY, USA, 194–195. https://doi.org/10.1145/502716.502753",
      "doi": "10.1145/502716.502753"
    },
    {
      "text": "Nathan Green, Jan Kruger, Chirag Faldu, and Robert St. Amant. 2004. A Reduced QWERTY Keyboard for Mobile Text Entry. In CHI ’04 Extended Abstracts on Human Factors in Computing Systems (Vienna, Austria) (CHI EA ’04). Association for Computing Machinery, New York, NY, USA, 1429–1432. https://doi.org/10.1145/985921.986082",
      "doi": "10.1145/985921.986082"
    },
    {
      "text": "Yizheng Gu, Chun Yu, Xuanzhong Chen, ZHUOJUN LI, and Yuanchun Shi. 2021. TypeBoard: Identifying Unintentional Touch on Pressure-Sensitive Touchscreen Keyboards. In The 34th Annual ACM Symposium on User Interface Software and Technology(Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 568–581. https://doi.org/10.1145/3472749.3474770",
      "doi": "10.1145/3472749.3474770"
    },
    {
      "text": "Yizheng Gu, Chun Yu, Zhipeng Li, Zhaoheng Li, Xiaoying Wei, and Yuanchun Shi. 2020. QwertyRing: Text Entry on Physical Surfaces Using a Ring. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 128 (dec 2020), 29 pages. https://doi.org/10.1145/3432204",
      "doi": "10.1145/3432204"
    },
    {
      "text": "Asela Gunawardana, Tim Paek, and Christopher Meek. 2010. Usability Guided Key-Target Resizing for Soft Keyboards. In Proceedings of the 15th International Conference on Intelligent User Interfaces (Hong Kong, China) (IUI ’10). Association for Computing Machinery, New York, NY, USA, 111–118. https://doi.org/10.1145/1719970.1719986",
      "doi": "10.1145/1719970.1719986"
    },
    {
      "text": "Johan Himberg, Jonna Häkkilä, Petri Kangas, and Jani Mäntyjärvi. 2003. On-Line Personalization of a Touch Screen Based Keyboard. In Proceedings of the 8th International Conference on Intelligent User Interfaces (Miami, Florida, USA) (IUI ’03). Association for Computing Machinery, New York, NY, USA, 77–84. https://doi.org/10.1145/604045.604061",
      "doi": "10.1145/604045.604061"
    },
    {
      "text": "Johannes Hirche, Peter Bomark, Mikael Bauer, and Pawel Solyga. 2008. Adaptive interface for text input on large-scale interactive surfaces. In 2008 3rd IEEE International Workshop on Horizontal Interactive Human Computer Systems. 153–156. https://doi.org/10.1109/TABLETOP.2008.4660198",
      "doi": ""
    },
    {
      "text": "Nancy Ide. 2012. The American National Corpus: Then, Now, and Tomorrow. (03 2012).",
      "doi": ""
    },
    {
      "text": "Hwan Kim, Yea-kyung Row, and Geehyuk Lee. 2012. Back Keyboard: A Physical Keyboard on Backside of Mobile Phone Using Qwerty. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems (Austin, Texas, USA) (CHI EA ’12). Association for Computing Machinery, New York, NY, USA, 1583–1588. https://doi.org/10.1145/2212776.2223676",
      "doi": "10.1145/2212776.2223676"
    },
    {
      "text": "Sunjun Kim, Jeongmin Son, Geehyuk Lee, Hwan Kim, and Woohun Lee. 2013. TapBoard: Making a Touch Screen Keyboard More Touchable. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 553–562. https://doi.org/10.1145/2470654.2470733",
      "doi": "10.1145/2470654.2470733"
    },
    {
      "text": "Ue-Hwan Kim, Sahng-Min Yoo, and Jong-Hwan Kim. 2021. I-Keyboard: Fully Imaginary Keyboard on Touch Devices Empowered by Deep Neural Decoder. IEEE Transactions on Cybernetics 51, 9 (2021), 4528–4539. https://doi.org/10.1109/TCYB.2019.2952391",
      "doi": ""
    },
    {
      "text": "Jianwei Lai, Dongsong Zhang, Sen Wang, Isil Doga Yakut Kilic, and Lina Zhou. 2019. ThumbStroke: A Virtual Keyboard in Support of Sight-Free and One-Handed Text Entry on Touchscreen Mobile Devices. ACM Trans. Manage. Inf. Syst. 10, 3, Article 11 (sep 2019), 19 pages. https://doi.org/10.1145/3343858",
      "doi": "10.1145/3343858"
    },
    {
      "text": "Frank Chun Yat Li, Richard T. Guy, Koji Yatani, and Khai N. Truong. 2011. The 1line Keyboard: A QWERTY Layout in a Single Line. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 461–470. https://doi.org/10.1145/2047196.2047257",
      "doi": "10.1145/2047196.2047257"
    },
    {
      "text": "Yiqin Lu, Chun Yu, Xin Yi, Yuanchun Shi, and Shengdong Zhao. 2017. BlindType: Eyes-Free Text Entry on Handheld Touchpad by Leveraging Thumb’s Muscle Memory. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 18 (jun 2017), 24 pages. https://doi.org/10.1145/3090083",
      "doi": "10.1145/3090083"
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI ’03 Extended Abstracts on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI EA ’03). Association for Computing Machinery, New York, NY, USA, 754–755. https://doi.org/10.1145/765891.765971",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "I. Scott MacKenzie, R. William Soukoreff, and Joanna Helga. 2011. 1 Thumb, 4 Buttons, 20 Words per Minute: Design and Evaluation of H4-Writer. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 471–480. https://doi.org/10.1145/2047196.2047258",
      "doi": "10.1145/2047196.2047258"
    },
    {
      "text": "Anders Markussen, Mikkel Rønne Jakobsen, and Kasper Hornbæk. 2014. Vulture: A Mid-Air Word-Gesture Keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1073–1082. https://doi.org/10.1145/2556288.2556964",
      "doi": "10.1145/2556288.2556964"
    },
    {
      "text": "Kseniia Palin, Anna Maria Feit, Sunjun Kim, Per Ola Kristensson, and Antti Oulasvirta. 2019. How Do People Type on Mobile Devices? Observations from a Study with 37,000 Volunteers. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 9, 12 pages. https://doi.org/10.1145/3338286.3340120",
      "doi": "10.1145/3338286.3340120"
    },
    {
      "text": "Gulnar Rakhmetulla and Ahmed Sabbir Arif. 2020. Senorita: A Chorded Keyboard for Sighted, Low Vision, and Blind Mobile Users. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376576",
      "doi": "10.1145/3313831.3376576"
    },
    {
      "text": "Daniel R. Rashid and Noah A. Smith. 2008. Relative Keyboard Input System. In Proceedings of the 13th International Conference on Intelligent User Interfaces (Gran Canaria, Spain) (IUI ’08). Association for Computing Machinery, New York, NY, USA, 397–400. https://doi.org/10.1145/1378773.1378839",
      "doi": "10.1145/1378773.1378839"
    },
    {
      "text": "Mark Richardson, Matt Durasoff, and Robert Wang. 2020. Decoding Surface Touch Typing from Hand-Tracking. Association for Computing Machinery, New York, NY, USA, 686–696. https://doi.org/10.1145/3379337.3415816",
      "doi": "10.1145/3379337.3415816"
    },
    {
      "text": "Mario Romero, Brian Frey, Caleb Southern, and Gregory D. Abowd. 2011. BrailleTouch: Designing a Mobile Eyes-Free Soft Keyboard. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services(Stockholm, Sweden) (MobileHCI ’11). Association for Computing Machinery, New York, NY, USA, 707–709. https://doi.org/10.1145/2037373.2037491",
      "doi": "10.1145/2037373.2037491"
    },
    {
      "text": "Oliver Schoenleben and Antti Oulasvirta. 2013. Sandwich Keyboard: Fast Ten-Finger Typing on a Mobile Device with Adaptive Touch Sensing on the Back Side. In Proceedings of the 15th International Conference on Human-Computer Interaction with Mobile Devices and Services (Munich, Germany) (MobileHCI ’13). Association for Computing Machinery, New York, NY, USA, 175–178. https://doi.org/10.1145/2493190.2493233",
      "doi": "10.1145/2493190.2493233"
    },
    {
      "text": "James Scott, Shahram Izadi, Leila Sadat Rezai, Dominika Ruszkowski, Xiaojun Bi, and Ravin Balakrishnan. 2010. RearType: Text Entry Using Keys on the Back of a Device. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services(Lisbon, Portugal) (MobileHCI ’10). Association for Computing Machinery, New York, NY, USA, 171–180. https://doi.org/10.1145/1851600.1851630",
      "doi": "10.1145/1851600.1851630"
    },
    {
      "text": "Weinan Shi, Chun Yu, Xin Yi, Zhen Li, and Yuanchun Shi. 2018. TOAST: Ten-Finger Eyes-Free Typing on Touchable Surfaces. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1, Article 33 (mar 2018), 23 pages. https://doi.org/10.1145/3191765",
      "doi": "10.1145/3191765"
    },
    {
      "text": "Touchscape Software. 2020. KlearKeys: Transparent Keyboard Phone. https://play.google.com/store/apps/details?id=com.touchscapesoftware.klearkeys.phone",
      "doi": ""
    },
    {
      "text": "Caleb Southern, James Clawson, Brian Frey, Gregory Abowd, and Mario Romero. 2012. An Evaluation of BrailleTouch: Mobile Touchscreen Text Entry for the Visually Impaired. In Proceedings of the 14th International Conference on Human-Computer Interaction with Mobile Devices and Services (San Francisco, California, USA) (MobileHCI ’12). Association for Computing Machinery, New York, NY, USA, 317–326. https://doi.org/10.1145/2371574.2371623",
      "doi": "10.1145/2371574.2371623"
    },
    {
      "text": "Ke Sun, Chun Yu, and Yuanchun Shi. 2019. Exploring Low-Occlusion Qwerty Soft Keyboard Using Spatial Landmarks. ACM Trans. Comput.-Hum. Interact. 26, 4, Article 20 (jun 2019), 33 pages. https://doi.org/10.1145/3318141",
      "doi": "10.1145/3318141"
    },
    {
      "text": "Daryl Weir, Henning Pohl, Simon Rogers, Keith Vertanen, and Per Ola Kristensson. 2014. Uncertain Text Entry on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2307–2316. https://doi.org/10.1145/2556288.2557412",
      "doi": "10.1145/2556288.2557412"
    },
    {
      "text": "Wikipedia. 2022. Touch typing. https://en.wikipedia.org/wiki/Touch_typing",
      "doi": ""
    },
    {
      "text": "Ying Yin, Tom Yu Ouyang, Kurt Partridge, and Shumin Zhai. 2013. Making Touchscreen Keyboards Adaptive to Keys, Hand Postures, and Individuals: A Hierarchical Spatial Backoff Model Approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 2775–2784. https://doi.org/10.1145/2470654.2481384",
      "doi": "10.1145/2470654.2481384"
    },
    {
      "text": "Sahng-Min Yoo, Ue-Hwan Kim, Yewon Hwang, and Jong-Hwan Kim. 2021. Type Anywhere You Want: An Introduction to Invisible Mobile Keyboard. In Proceedings of the Thirtieth International Joint Conference on Artificial Intelligence, IJCAI-21, Zhi-Hua Zhou (Ed.). International Joint Conferences on Artificial Intelligence Organization, 1757–1764. https://doi.org/10.24963/ijcai.2021/242 Main Track.",
      "doi": ""
    },
    {
      "text": "Suwen Zhu, Tianyao Luo, Xiaojun Bi, and Shumin Zhai. 2018. Typing on an Invisible Keyboard. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174013",
      "doi": "10.1145/3173574.3174013"
    }
  ]
}