{
  "doi": "10.1145/3544548.3581192",
  "title": "Assisting with Fingertip Force Control by Active Bio-Acoustic Sensing and Electrical Muscle Stimulation",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Fingertip force control plays an important role in learning motor skills. Exoskeleton gloves have been developed to assist with fingertip force control, but having the equipment on the fingers interferes with finger motion control and tactile sensation. Thus, we present a system for assisting with voluntary fingertip force control that does not require any devices to be worn on the fingers. In this study, we focused particularly on lateral pinch force, which is grip force achieved with the pad of the thumb and the lateral surface of the index finger to grasp objects. We use active bio-acoustic sensing to estimate voluntary pinch force with piezo elements attached to the back of the hand and electrical muscle stimulation (EMS) to the forearm to control involuntary pinch force in a closed-loop system. We developed three prototypes and conducted user studies to investigate whether our system can assist with pinch force control under several target forces, from weak to strong. Our user studies showed that the combination of active bio-acoustic sensing and EMS can assist users in maintaining the pinch force closer to the target force.",
  "authors": [
    {
      "name": "Arinobu Niijima",
      "institution": "NTT Human Informatics Laboratories, NTT Corporation, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502808453",
      "orcid": "0000-0003-4884-9612"
    },
    {
      "name": "Yuki Kubo",
      "institution": "NTT Human Informatics Laboratories, NTT Corporation, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019513",
      "orcid": "0000-0003-3887-446X"
    }
  ],
  "references": [
    {
      "text": "Elahe Abdi, Dana Kulić, and Elizabeth Croft. 2020. Haptics in Teleoperated Medical Interventions: Force Measurement, Haptic Interfaces and Their Influence on User’s Performance. IEEE Transactions on Biomedical Engineering 67, 12 (2020), 3438–3451. https://doi.org/10.1109/TBME.2020.2987603",
      "doi": ""
    },
    {
      "text": "B Abernethy, RJ Neal, MJ Moran, and AW Parker. 1990. Expert-novice differences in muscle activity during the golf swing. In Science and golf: Proceedings of the first World Scientific Congress of Golf. E&FN Spon London, 54–60.",
      "doi": ""
    },
    {
      "text": "Jonas Auda, Max Pascher, and Stefan Schneegass. 2019. Around the (virtual) world: infinite walking in virtual reality using electrical muscle stimulation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8. https://doi.org/10.1145/3290605.3300661",
      "doi": "10.1145/3290605.3300661"
    },
    {
      "text": "Vincent Becker, Pietro Oldrati, Liliana Barrios, and Gabor Soros. 2018. Touchsense: classifying finger touches and measuring their force with an electromyography armband. In Proceedings of the 2018 ACM International Symposium on Wearable Computers. 1–8. https://doi.org/10.1145/3267242.3267250",
      "doi": "10.1145/3267242.3267250"
    },
    {
      "text": "Delphine Chadefaux, Guillaume Rao, Jean-Loïc Le Carrou, Eric Berton, and Laurent Vigouroux. 2017. The effects of player grip on the dynamic behaviour of a tennis racket. Journal of sports sciences 35, 12 (2017), 1155–1164. https://doi.org/10.1080/02640414.2016.1213411",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1992. A power primer. Psychological bulletin 112, 1 (1992), 155. https://doi.org/10.1037//0033-2909.112.1.155",
      "doi": ""
    },
    {
      "text": "Smita De, Jacob Rosen, Aylon Dagan, Blake Hannaford, Paul Swanson, and Mika Sinanan. 2007. Assessment of tissue damage due to mechanical stresses. The International Journal of Robotics Research 26, 11-12(2007), 1159–1171. https://doi.org/10.1177/0278364907082847",
      "doi": "10.1177/0278364907082847"
    },
    {
      "text": "Carlo J De Luca, L Donald Gilmore, Mikhail Kuznetsov, and Serge H Roy. 2010. Filtering the surface EMG signal: movement artifact and baseline noise contamination. Journal of biomechanics 43, 8 (2010), 1573–1579. https://doi.org/10.1016/j.jbiomech.2010.01.027",
      "doi": ""
    },
    {
      "text": "Bachar Dreibati, Cedric Lavet, Antonio Pinti, and Georges Poumarat. 2010. Influence of electrical stimulation frequency on skeletal muscle force and fatigue. Annals of physical and rehabilitation medicine 53, 4 (2010), 266–277.",
      "doi": ""
    },
    {
      "text": "Tim Duente, Max Pfeiffer, and Michael Rohs. 2017. Zap++ a 20-channel electrical muscle stimulation system for fine-grained wearable force feedback. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–13. https://doi.org/10.1145/3098279.3098546",
      "doi": "10.1145/3098279.3098546"
    },
    {
      "text": "Tim Duente, Justin Schulte, Max Pfeiffer, and Michael Rohs. 2018. Muscleio: muscle-based input and output for casual notifications. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (2018), 1–21. https://doi.org/10.1145/3214267",
      "doi": "10.1145/3214267"
    },
    {
      "text": "Ayaka Ebisu, Satoshi Hashizume, Kenta Suzuki, Akira Ishii, Mose Sakashita, and Yoichi Ochiai. 2017. Stimulated percussions: method to control human for learning music by using electrical muscle stimulation. In Proceedings of the 8th Augmented Human International Conference. 1–5. https://doi.org/10.1145/3041164.3041202",
      "doi": "10.1145/3041164.3041202"
    },
    {
      "text": "Tiago H Falk, Cynthia Tam, Heidi Schellnus, and Tom Chau. 2011. On the development of a computer-based handwriting assessment tool to objectively quantify handwriting proficiency in children. Computer methods and programs in biomedicine 104, 3(2011), e102–e111. https://doi.org/10.1016/j.cmpb.2010.12.010",
      "doi": "10.1016/j.cmpb.2010.12.010"
    },
    {
      "text": "Tiago H Falk, Cynthia Tam, Heidi Schwellnus, and Tom Chau. 2010. Grip force variability and its effects on children’s handwriting legibility, form, and strokes. Journal of biomechanical engineering 132, 11 (2010). https://doi.org/10.1115/1.4002611",
      "doi": ""
    },
    {
      "text": "Sarah Faltaous, Aya Abdulmaksoud, Markus Kempe, Florian Alt, and Stefan Schneegass. 2021. GeniePutt: Augmenting human motor skills through electrical muscle stimulation. it-Information Technology 63, 3 (2021), 157–166. https://doi.org/10.1515/itit-2020-0035",
      "doi": ""
    },
    {
      "text": "Yinfeng Fang, Zhaojie Ju, Xiangyang Zhu, and Honghai Liu. 2014. Finger pinch force estimation through muscle activations using a surface EMG sleeve on the forearm. In 2014 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE). IEEE, 1449–1455. https://doi.org/10.1109/FUZZ-IEEE.2014.6891790",
      "doi": ""
    },
    {
      "text": "Nobuhiro Funato and Kentaro Takemura. 2017. estimating three-axis contact force for fingertip by emitting vibration actively. In 2017 IEEE International Conference on Robotics and Biomimetics (ROBIO). IEEE, 406–411. https://doi.org/10.1109/ROBIO.2017.8324451",
      "doi": ""
    },
    {
      "text": "Tricia L Gibo, Darrel R Deo, Zhan Fan Quek, and Allison M Okamura. 2014. Effect of load force feedback on grip force control during teleoperation: A preliminary study. In 2014 IEEE Haptics Symposium (HAPTICS). IEEE, 379–383. https://doi.org/10.1109/HAPTICS.2014.6775485",
      "doi": ""
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. 2016. Dexmo: an inexpensive and lightweight mechanical exoskeleton for motion capture and force feedback in VR. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1991–1995. https://doi.org/10.1145/2858036.2858487",
      "doi": "10.1145/2858036.2858487"
    },
    {
      "text": "Mahmoud Hassan, Florian Daiber, Frederik Wiehr, Felix Kosmalla, and Antonio Krüger. 2017. Footstriker: an EMS-based foot strike assistant for running. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 1 (2017), 1–18. https://doi.org/10.1145/3053332",
      "doi": "10.1145/3053332"
    },
    {
      "text": "Wenjing Hu, Na Wei, Zong-Ming Li, and Ke Li. 2018. Effects of muscle fatigue on directional coordination of fingertip forces during precision grip. PloS one 13, 12 (2018), e0208740. https://doi.org/10.1371/journal.pone.0208740",
      "doi": ""
    },
    {
      "text": "Patria A Hume, Justin Keogh, and Duncan Reid. 2005. The role of biomechanics in maximising distance and accuracy of golf shots. Sports medicine 35, 5 (2005), 429–449. https://doi.org/10.2165/00007256-200535050-00005",
      "doi": ""
    },
    {
      "text": "Kwangyul Jeong, Franz Konstantin Fuss, Bernd Fuernschuss, and Yehuda Weizman. 2015. Development of a smart kendo sword and assessment of grip pressure of Kamai stance and Kote cut. Procedia Engineering 112(2015), 231–236. https://doi.org/10.1016/j.proeng.2015.07.205",
      "doi": ""
    },
    {
      "text": "Shunichi Kasahara, Jun Nishida, and Pedro Lopes. 2019. Preemptive action: accelerating human reaction using electrical muscle stimulation without compromising agency. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15. https://doi.org/10.1145/3290605.3300873",
      "doi": "10.1145/3290605.3300873"
    },
    {
      "text": "Shunichi Kasahara, Kazuma Takada, Jun Nishida, Kazuhisa Shibata, Shinsuke Shimojo, and Pedro Lopes. 2021. Preserving agency during electrical muscle stimulation training speeds up reaction time directly after removing EMS. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–9. https://doi.org/10.1145/3411764.3445147",
      "doi": "10.1145/3411764.3445147"
    },
    {
      "text": "Oliver Beren Kaul, Max Pfeiffer, and Michael Rohs. 2016. Follow the force: Steering the index finger towards targets using EMS. In Proceedings of the 2016 chi conference extended abstracts on human factors in computing systems. 2526–2532. https://doi.org/10.1145/2851581.2892352",
      "doi": "10.1145/2851581.2892352"
    },
    {
      "text": "Justin Keogh, S Morrison, and R Barrett. 2006. Age-related differences in inter-digit coupling during finger pinching. European journal of applied physiology 97, 1 (2006), 76–88. https://doi.org/10.1007/s00421-006-0151-7",
      "doi": ""
    },
    {
      "text": "Justin W Keogh, Steve Morrison, and Rod Barrett. 2007. Strength training improves the tri-digit finger-pinch force control of older adults. Archives of Physical Medicine and Rehabilitation 88, 8(2007), 1055–1063. https://doi.org/10.1016/j.apmr.2007.05.014",
      "doi": ""
    },
    {
      "text": "Yudai Kimoto, Takanori Oku, and Shinichi Furuya. 2019. Neuromuscular and biomechanical functions subserving finger dexterity in musicians. Scientific reports 9, 1 (2019), 1–12. https://doi.org/10.1038/s41598-019-48718-9",
      "doi": ""
    },
    {
      "text": "Erin R Komi, Jonathan R Roberts, and SJ Rothberg. 2008. Measurement and analysis of grip force during a golf shot. Proceedings of the Institution of Mechanical Engineers, Part P: Journal of Sports Engineering and Technology 222, 1 (2008), 23–35. https://doi.org/10.1243/17543371JSET9",
      "doi": ""
    },
    {
      "text": "Michinari Kono, Takumi Takahashi, Hiromi Nakamura, Takashi Miyaki, and Jun Rekimoto. 2018. Design guideline for developing safe systems that apply electricity to the human body. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 3(2018), 1–36. https://doi.org/10.1145/3184743",
      "doi": "10.1145/3184743"
    },
    {
      "text": "Yuki Kubo, Yuto Koguchi, Buntarou Shizuki, Shin Takahashi, and Otmar Hilliges. 2019. AudioTouch: minimally invasive sensing of micro-gestures via active bio-acoustic sensing. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–13. https://doi.org/10.1145/3338286.3340147",
      "doi": "10.1145/3338286.3340147"
    },
    {
      "text": "Francesca Leone, Cosimo Gentile, Anna Lisa Ciancio, Emanuele Gruppioni, Angelo Davalli, Rinaldo Sacchetti, Eugenio Guglielmelli, and Loredana Zollo. 2019. Simultaneous sEMG classification of hand/wrist gestures and forces. Frontiers in Neurorobotics 13 (2019), 42. https://doi.org/10.3389/fnbot.2019.00042",
      "doi": ""
    },
    {
      "text": "Jhe-Wei Lin, Chiuan Wang, Yi Yao Huang, Kuan-Ting Chou, Hsuan-Yu Chen, Wei-Luan Tseng, and Mike Y Chen. 2015. Backhand: Sensing hand gestures via back of the hand. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 557–564. https://doi.org/10.1145/2807442.2807462",
      "doi": "10.1145/2807442.2807462"
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. 2013. Muscle-propelled force feedback: bringing force feedback to mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2577–2580. https://doi.org/10.1145/2470654.2481355",
      "doi": "10.1145/2470654.2481355"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: simulating physical impact by combining tactile stimulation with electrical muscle stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 11–19. https://doi.org/10.1145/2807442.2807443",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, Willi Mueller, Daniel Hoffmann, Patrik Jonell, and Patrick Baudisch. 2015. Proprioceptive interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 939–948. https://doi.org/10.1145/2702123.2702461",
      "doi": "10.1145/2702123.2702461"
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++ allowing objects to communicate dynamic use. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2515–2524. https://doi.org/10.1145/2702123.2702128",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing haptics to walls & heavy objects in virtual reality by means of electrical muscle stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1471–1482. https://doi.org/10.1145/3025453.3025600",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Pedro Lopes, Sijing You, Alexandra Ion, and Patrick Baudisch. 2018. Adding force feedback to mixed reality experiences and games using electrical muscle stimulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13. https://doi.org/10.1145/3173574.3174020",
      "doi": "10.1145/3173574.3174020"
    },
    {
      "text": "Pedro Lopes, Doăa Yüksel, François Guimbretière, and Patrick Baudisch. 2016. Muscle-plotter: an interactive system based on electrical muscle stimulation that produces spatial output. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 207–217. https://doi.org/10.1145/2984511.2984530",
      "doi": "10.1145/2984511.2984530"
    },
    {
      "text": "Stephen A Mascaro and H Harry Asada. 2004. measurement of finger posture and three-axis fingertip touch force using fingernail sensors. IEEE Transactions on Robotics and Automation 20, 1(2004), 26–35. https://doi.org/10.1109/TRA.2003.820931",
      "doi": ""
    },
    {
      "text": "Florian Floyd Mueller, Pedro Lopes, Paul Strohmeier, Wendy Ju, Caitlyn Seim, Martin Weigel, Suranga Nanayakkara, Marianna Obrist, Zhuying Li, Joseph Delfa, 2020. Next steps for human-computer integration. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15. https://doi.org/10.1145/3313831.3376242",
      "doi": "10.1145/3313831.3376242"
    },
    {
      "text": "Sachith Muthukumarana, Denys JC Matthies, Chamod Weerasinghe, Don Samitha Elvitigala, and Suranga Nanayakkara. 2019. CricketCoach: towards creating a better awareness of gripping forces for cricketers. In Proceedings of the 10th Augmented Human International Conference 2019. 1–2. https://doi.org/10.1145/3311823.3311833",
      "doi": "10.1145/3311823.3311833"
    },
    {
      "text": "Arinobu Niijima, Takashi Isezaki, Ryosuke Aoki, Tomoki Watanabe, and Tomohiro Yamada. 2018. Controlling maximal voluntary contraction of the upper limb muscles by facial electrical stimulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–7. https://doi.org/10.1145/3173574.3173968",
      "doi": "10.1145/3173574.3173968"
    },
    {
      "text": "Arinobu Niijima and Yuki Kubo. 2021. Assisting with Voluntary Pinch Force Control by Using Electrical Muscle Stimulation and Active Bio-Acoustic Sensing. In The Adjunct Publication of the 34th Annual ACM Symposium on User Interface Software and Technology. 11–13. https://doi.org/10.1145/3474349.3480214",
      "doi": "10.1145/3474349.3480214"
    },
    {
      "text": "Arinobu Niijima, Toki Takeda, Ryosuke Aoki, and Shinji Miyahara. 2022. Muscle synergies learning with electrical muscle stimulation for playing the piano. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. 1–10. https://doi.org/10.1145/3526113.3545666",
      "doi": "10.1145/3526113.3545666"
    },
    {
      "text": "Arinobu Niijima, Toki Takeda, Kentaro Tanaka, Ryosuke Aoki, and Yukio Koike. 2021. Reducing Muscle Activity when Playing Tremolo by Using Electrical Muscle Stimulation to Learn Efficient Motor Skills. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 3 (2021), 1–17. https://doi.org/10.1145/3478110",
      "doi": "10.1145/3478110"
    },
    {
      "text": "Jun Nishida and Kenji Suzuki. 2017. BioSync: a paired wearable device for blending kinesthetic experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3316–3327. https://doi.org/10.1145/3025453.3025829",
      "doi": "10.1145/3025453.3025829"
    },
    {
      "text": "Jun Nishida, Yudai Tanaka, Romain Nith, and Pedro Lopes. 2022. DigituSync: A Dual-User Passive Exoskeleton Glove That Adaptively Shares Hand Gestures. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. 1–12. https://doi.org/10.1145/3526113.3545630",
      "doi": "10.1145/3526113.3545630"
    },
    {
      "text": "Jun Nishida, Keisuke Yagi, Modar Hassan, and Kenji Suzuki. 2019. Wearable kinesthetic I/O device for sharing wrist joint stiffness. In 2019 41st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 3306–3310. https://doi.org/10.1109/EMBC.2019.8857538",
      "doi": ""
    },
    {
      "text": "Romain Nith, Shan-Yuan Teng, Pengyu Li, Yujie Tao, and Pedro Lopes. 2021. DextrEMS: Increasing Dexterity in Electrical Muscle Stimulation by Combining it with Brakes. In The 34th Annual ACM Symposium on User Interface Software and Technology. 414–430. https://doi.org/10.1145/3472749.3474759",
      "doi": "10.1145/3472749.3474759"
    },
    {
      "text": "Makoto Ono, Buntarou Shizuki, and Jiro Tanaka. 2013. Touch & activate: adding interactivity to existing objects using active acoustic sensing. In Proceedings of the 26th annual ACM symposium on User interface software and technology. 31–40. https://doi.org/10.1145/2501988.2501989",
      "doi": "10.1145/2501988.2501989"
    },
    {
      "text": "Makoto Ono, Buntarou Shizuki, and Jiro Tanaka. 2015. Sensing touch force using active acoustic sensing. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. 355–358. https://doi.org/10.1145/2677199.2680585",
      "doi": "10.1145/2677199.2680585"
    },
    {
      "text": "Claudio Pacchierotti, Stephen Sinclair, Massimiliano Solazzi, Antonio Frisoli, Vincent Hayward, and Domenico Prattichizzo. 2017. Wearable haptic systems for the fingertip and the hand: taxonomy, review, and perspectives. IEEE transactions on haptics 10, 4 (2017), 580–600. https://doi.org/10.1109/TOH.2017.2689006",
      "doi": "10.1109/TOH.2017.2689006"
    },
    {
      "text": "Dietrich Parlitz, Thomas Peschel, and Eckart Altenmüller. 1998. Assessment of dynamic finger forces in pianists: effects of training and expertise. Journal of biomechanics 31, 11 (1998), 1063–1067. https://doi.org/10.1016/S0021-9290(98)00113-4",
      "doi": ""
    },
    {
      "text": "Fabian Pedregosa, Gaël Varoquaux, Alexandre Gramfort, Vincent Michel, Bertrand Thirion, Olivier Grisel, Mathieu Blondel, Peter Prettenhofer, Ron Weiss, Vincent Dubourg, 2011. Scikit-learn: machine learning in python. the Journal of machine Learning research 12, null (2011), 2825–2830. https://doi.org/10.5555/1953048.2078195",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Max Pfeiffer, Tim Duente, and Michael Rohs. 2016. A wearable force feedback toolkit with electrical muscle stimulation. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3758–3761. https://doi.org/10.1145/2851581.2890238",
      "doi": "10.1145/2851581.2890238"
    },
    {
      "text": "Max Pfeiffer, Tim Dünte, Stefan Schneegass, Florian Alt, and Michael Rohs. 2015. Cruise control for pedestrians: controlling walking direction using electrical muscle stimulation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2505–2514. https://doi.org/10.1145/2702123.2702190",
      "doi": "10.1145/2702123.2702190"
    },
    {
      "text": "Max Pfeiffer and Michael Rohs. 2017. Haptic feedback for wearables and textiles based on electrical muscle stimulation. In Smart textiles. Springer, 103–137. https://doi.org/10.1007/978-3-319-50124-6_6",
      "doi": ""
    },
    {
      "text": "Max Pfeiffer, Stefan Schneegass, Florian Alt, and Michael Rohs. 2014. Let me grab this: a comparison of EMS and vibration for haptic feedback in free-hand interaction. In Proceedings of the 5th augmented human international conference. 1–8. https://doi.org/10.1145/2582051.2582099",
      "doi": "10.1145/2582051.2582099"
    },
    {
      "text": "Ayane Saito, Wakaba Kuno, Wataru Kawai, Natsuki Miyata, and Yuta Sugiura. 2019. Estimation of fingertip contact force by measuring skin deformation and posture with photo-reflective sensors. In Proceedings of the 10th Augmented Human International Conference 2019. 1–6. https://doi.org/10.1145/3311823.3311824",
      "doi": "10.1145/3311823.3311824"
    },
    {
      "text": "Katsuyuki Sakuma, Avner Abrami, Gaddi Blumrosen, Stanislav Lukashov, Rajeev Narayanan, Joseph W Ligman, Vittorio Caggiano, and Stephen J Heisig. 2018. Wearable nail deformation sensing for behavioral and biomechanical monitoring and human-computer interaction. Scientific reports 8, 1 (2018), 1–11. https://doi.org/10.1038/s41598-018-36834-x",
      "doi": ""
    },
    {
      "text": "Laura Santos-Carreras, Monika Hagen, Roger Gassert, and Hannes Bleuler. 2012. Survey on surgical instrument handle design: ergonomics and acceptance. Surgical innovation 19, 1 (2012), 50–59. https://doi.org/10.1177/1553350611413611",
      "doi": ""
    },
    {
      "text": "Heidi Schwellnus, Heather Carnahan, Azadeh Kushki, Helene Polatajko, Cheryl Missiuna, and Tom Chau. 2013. Writing forces associated with four pencil grasp patterns in grade 4 children. American Journal of Occupational Therapy 67, 2 (2013), 218–227. https://doi.org/10.5014/ajot.2013.005538",
      "doi": ""
    },
    {
      "text": "Primož Strojnik, Alojz Kralj, and I Ursic. 1979. Programmed six-channel electrical stimulator for complex stimulation of leg muscles during walking. IEEE Transactions on Biomedical Engineering2 (1979), 112–116. https://doi.org/10.1109/TBME.1979.326520",
      "doi": ""
    },
    {
      "text": "Akifumi Takahashi, Jas Brooks, Hiroyuki Kajimoto, and Pedro Lopes. 2021. Increasing electrical muscle stimulation’s dexterity by means of back of the hand actuation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3411764.3445761",
      "doi": "10.1145/3411764.3445761"
    },
    {
      "text": "Nobuhiro Takahashi, Shinichi Furuya, and Hideki Koike. 2020. Soft exoskeleton glove with human anatomical architecture: production of dexterous finger movements and skillful piano performance. IEEE Transactions on Haptics(2020). https://doi.org/10.1109/TOH.2020.2993445",
      "doi": "10.1109/TOH.2020.2993445"
    },
    {
      "text": "Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. 2011. PossessedHand: techniques for controlling human hands using electrical muscles stimuli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 543–552. https://doi.org/10.1145/1978942.1979018",
      "doi": "10.1145/1978942.1979018"
    },
    {
      "text": "Sho Tatsuno, Tomohiko Hayakawa, and Masatoshi Ishikawa. 2017. Supportive training system for sports skill acquisition based on electrical stimulation. In 2017 IEEE World Haptics Conference (WHC). IEEE, 466–471. https://doi.org/10.1109/WHC.2017.7989946",
      "doi": ""
    },
    {
      "text": "Joseph D Towles, Vincent R Hentz, and Wendy M Murray. 2008. Use of intrinsic thumb muscles may help to improve lateral pinch function restored by tendon transfer. Clinical Biomechanics 23, 4 (2008), 387–394. https://doi.org/10.1016/j.clinbiomech.2007.11.008",
      "doi": ""
    },
    {
      "text": "Francisco J Valero-Cuevas. 2000. Predictive modulation of muscle coordination pattern magnitude scales fingertip force magnitude over the voluntary range. Journal of Neurophysiology 83, 3 (2000), 1469–1479. https://doi.org/10.1152/jn.2000.83.3.1469",
      "doi": ""
    },
    {
      "text": "Kyosuke Watanabe, Makoto Oka, and Hirohiko Mori. 2020. Feedback control to a static target angle in the middle finger metacarpophalangeal joint using functional electrical stimulation. International Journal of Human–Computer Interaction (2020), 1–11. https://doi.org/10.1080/10447318.2020.1758879",
      "doi": ""
    },
    {
      "text": "Eleonora P Westebring-van der Putten, John J van den Dobbelsteen, Richard HM Goossens, Jack J Jakimowicz, and Jenny Dankelman. 2009. Force feedback requirements for efficient laparoscopic grasp control. Ergonomics 52, 9 (2009), 1055–1066. https://doi.org/10.1080/00140130902912803",
      "doi": ""
    },
    {
      "text": "Richard W Young. 2003. Evolution of the human hand: the role of throwing and clubbing. Journal of Anatomy 202, 1 (2003), 165–174. https://doi.org/10.1046/j.1469-7580.2003.00144.x",
      "doi": ""
    }
  ]
}