{
  "doi": "10.1145/3544548.3581458",
  "title": "Community Voice as Data: Affordances of Participatory Videos for International Program Development",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "International program development is a complex process involving many stakeholders. Current international practice affords limited, if any, opportunities for direct community-led input into the program commissioning process, resulting in programs that may not meet the specific needs of communities on the ground. Community voice is one source of data that could help focus the design of effective development programs and interventions. However, development programs are primarily formulated based on representative and often quantitative data conducted by experts from outside the community. Through a participatory video production process with disadvantaged women farmers in rural Bangladesh, we explore the opportunities for including meaningful community voices in these institutionalized processes. We present practical design implications for how community-generated voices can act as rich data, establishing confidence, community bonds and senses of accountability to inform early stages of project development, and to specifically augment and contextualize other data sources.",
  "authors": [
    {
      "name": "Manika Saha",
      "institution": "Action Lab, Faculty of IT, Monash University, Australia and Centre for Humanitarian Leadership (CHL), Deakin University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660065614",
      "orcid": "0000-0002-9111-3195"
    },
    {
      "name": "Tom Bartindale",
      "institution": "Action Lab, Faculty of IT, Monash University, Australia",
      "img": "/do/10.1145/contrib-81416597993/rel-imgonly/81416597993.jpg",
      "acmid": "81416597993",
      "orcid": "0000-0002-0476-3422"
    },
    {
      "name": "Delvin Varghese",
      "institution": "Action Lab, Faculty of IT, Monash University, Australia",
      "img": "/do/10.1145/contrib-99659153172/rel-imgonly/picked_img_0051_cw.jpg",
      "acmid": "99659153172",
      "orcid": "0000-0002-7806-1001"
    },
    {
      "name": "Stephen Lindsay",
      "institution": "Computing Science, University of Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384616016",
      "orcid": "0000-0001-6063-3676"
    },
    {
      "name": "Dan Richardson",
      "institution": "Action Lab, Faculty of IT, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021231",
      "orcid": "0000-0001-6652-071X"
    },
    {
      "name": "Syed Ishtiaque Ahmed",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502686136",
      "orcid": "0000-0003-2452-0687"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Action Lab, Faculty of IT, Monash University, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "AA Adekunle, AO Fatunbi, 2012. Approaches for setting-up multi-stakeholder platforms for agricultural research and development. World Applied Sciences Journal 16, 7 (2012), 981–988.",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Jay Chen, and Nicola Dell. 2017. Digital privacy challenges with shared mobile phone use in Bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 1–20.",
      "doi": "10.1145/3134652"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md. Romael Haque, Shion Guha, Md. Rashidujjaman Rifat, and Nicola Dell. 2017. Privacy, Security, and Surveillance in the Global South: A Study of Biometric Mobile SIM Registration in Bangladesh. (2017), 906–918. https://doi.org/10.1145/3025453.3025961",
      "doi": "10.1145/3025453.3025961"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md. Romael Haque, Irtaza Haider, Jay Chen, and Nicola Dell. 2019. \"Everyone Has Some Personal Stuff\": Designing to Support Digital Privacy with Shared Mobile Phone Use in Bangladesh. (2019), 1–13. https://doi.org/10.1145/3290605.3300410",
      "doi": "10.1145/3290605.3300410"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J. Jackson, Nova Ahmed, Hasan Shahid Ferdous, Md. Rashidujjaman Rifat, A.S.M Rizvi, Shamir Ahmed, and Rifat Sabbir Mansur. 2014. Protibadi: A Platform for Fighting Sexual Harassment in Urban Bangladesh. (2014), 2695–2704. https://doi.org/10.1145/2556288.2557376",
      "doi": "10.1145/2556288.2557376"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, and Md Rashidujjaman Rifat. 2015. Learning to fix: knowledge, collaboration and mobile phone repair in Dhaka, Bangladesh. Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (2015), 1–10.",
      "doi": "10.1145/2737856.2738018"
    },
    {
      "text": "Yaw Anokwa, Thomas N Smyth, Divya Ramachandran, Jahanzeb Sherwani, Yael Schwartzman, Rowena Luk, Melissa Ho, Neema Moraveji, and Brian DeRenzi. 2009. Stories from the field: Reflections on HCI4D experiences. Information Technologies & International Development 5, 4 (2009), pp–101.",
      "doi": ""
    },
    {
      "text": "Chrisanthi Avgerou. 2010. Discourses on ICT and development. Information technologies and international development 6, 3 (2010), 1–18.",
      "doi": ""
    },
    {
      "text": "Naveen Bagalkot, Nervo Verdezoto, Anushri Ghode, Shipra Purohit, Lakshmi Murthy, Nicola Mackintosh, and Paula Griffiths. 2020. Beyond Health Literacy: Navigating Boundaries and Relationships During High-Risk Pregnancies: Challenges and Opportunities for Digital Health in North-West India. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. 1–15.",
      "doi": "10.1145/3419249.3420126"
    },
    {
      "text": "Albert Bandura and Richard E Watts. 1996. Self-efficacy in changing societies.",
      "doi": ""
    },
    {
      "text": "Tom Bartindale, Delvin Varghese, Guy Schofield, and Miki Tsukamoto. 2019. Our Story: Addressing Challenges in Development Contexts for Sustainable Participatory Video. (2019), 1–12. https://doi.org/10.1145/3290605.3300667",
      "doi": "10.1145/3290605.3300667"
    },
    {
      "text": "Cynthia L Bennett, Burren Peil, and Daniela K Rosner. 2019. Biographical prototypes: Reimagining recognition and disability in design. In Proceedings of the 2019 on Designing Interactive Systems Conference. 35–47.",
      "doi": "10.1145/3322276.3322376"
    },
    {
      "text": "Vinay Bhargava. 2015. Engaging citizens and civil society to promote good governance and development effectiveness. (2015).",
      "doi": ""
    },
    {
      "text": "Zulfiqar A Bhutta, Jai K Das, Arjumand Rizvi, Michelle F Gaffey, Neff Walker, Susan Horton, Patrick Webb, Anna Lartey, Robert E Black, The Lancet Nutrition Interventions Review Group, 2013. Evidence-based interventions for improvement of maternal and child nutrition: what can be done and at what cost?The lancet 382, 9890 (2013), 452–477.",
      "doi": ""
    },
    {
      "text": "Nicola J Bidwell. 2009. Anchoring design in rural customs of doing and saying. In IFIP Conference on Human-Computer Interaction. Springer, 686–699.",
      "doi": "10.1007/978-3-642-03655-2_75"
    },
    {
      "text": "Nicola J Bidwell. 2016. Moving the centre to design social media in rural Africa. AI & society 31, 1 (2016), 51–77.",
      "doi": ""
    },
    {
      "text": "Nicola J. Bidwell, Thomas Reitmaier, Gary Marsden, and Susan Hansen. 2010. Designing with Mobile Digital Storytelling in Rural Africa. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1593–1602. https://doi.org/10.1145/1753326.1753564",
      "doi": "10.1145/1753326.1753564"
    },
    {
      "text": "Peri K Blind. 2007. Building trust in government in the twenty-first century: Review of literature and emerging issues. 7th Global Forum on Reinventing Government Building Trust in Government 2007 (2007), 26–29.",
      "doi": ""
    },
    {
      "text": "Tone Bratteteig and Ina Wagner. 2016. Unpacking the notion of participation in participatory design. Computer Supported Cooperative Work (CSCW) 25, 6 (2016), 425–475.",
      "doi": "10.1007/s10606-016-9259-4"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Tian Cai, Hastings Chiwasa, Charles Steinfield, and Susan Wyche. 2015. Participatory video for nutrition training for farmers in Malawi: an analysis of knowledge gain and adoption. Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (2015), 1–5.",
      "doi": "10.1145/2737856.2737878"
    },
    {
      "text": "Robert Chambers. 2013. Ideas for development. Routledge.",
      "doi": ""
    },
    {
      "text": "G Shabbir Cheema and Vesselin Popovski. 2010. Building trust in government: innovations in governance reform in Asia. Vol. 139. United Nations University Press Tokyo.",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi, Gabriela Avram, Laura Maye, Nick Dulake, Mark T Marshall, Dick van Dijk, and Fiona McDermott. 2016. Articulating co-design in museums: Reflections on two participatory processes. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. 13–25.",
      "doi": "10.1145/2818048.2819967"
    },
    {
      "text": "Bill Cooke and Uma Kothari. 2001. Participation: The new tyranny?Zed books.",
      "doi": ""
    },
    {
      "text": "Andrea Cornwall. 2016. Citizen voice and action. GSDRC Professional Development Reading Pack 2016, 36 (2016).",
      "doi": ""
    },
    {
      "text": "John W Creswell and J David Creswell. 2017. Research design: Qualitative, quantitative, and mixed methods approaches. Sage publications.",
      "doi": ""
    },
    {
      "text": "Danish Dada. 2006. The failure of E-government in developing countries: A literature review. The electronic journal of information systems in developing countries 26, 1 (2006), 1–10.",
      "doi": ""
    },
    {
      "text": "Areti Damala, Eva Hornecker, Merel J van Der Vaart, Dick Van Dijk, and Ian Ruthven. 2016. The Loupe: tangible augmented reality for learning to look at Ancient Greek art. Mediterranean Archaeology and Archaeometry 16, 5 (2016), 73–85.",
      "doi": ""
    },
    {
      "text": "Soniia David and Christopher Asamoah. 2011. Video as a tool for agricultural extension in Africa: a case study from Ghana. International Journal of Education and Development using ICT 7, 1 (2011), 26–41.",
      "doi": ""
    },
    {
      "text": "Naydene De Lange and Mart-Mari Geldenhuys. 2012. Youth envisioning safe schools: A participatory video approach. South African Journal of Education 32, 4 (2012), 494–511.",
      "doi": ""
    },
    {
      "text": "Brian DeRenzi, Gaetano Borriello, Jonathan Jackson, Vikram S Kumar, Tapan S Parikh, Pushwaz Virk, and Neal Lesh. 2011. Mobile phone tools for field-based health care workers in low-income countries. Mount Sinai Journal of Medicine: A Journal of Translational and Personalized Medicine 78, 3 (2011), 406–418.",
      "doi": ""
    },
    {
      "text": "William Easterly. 2008. Institutions: Top down or bottom up?American Economic Review 98, 2 (2008), 95–99.",
      "doi": ""
    },
    {
      "text": "Marita Eastmond. 2007. Stories as lived experience: Narratives in forced migration research. Journal of refugee studies 20, 2 (2007), 248–264.",
      "doi": ""
    },
    {
      "text": "Niall Ferguson and Dambisa Moyo. 2019. Dead Aid: Why Aid Is Not Working And How There Is A Better Way For Africa. Tantor Audio.",
      "doi": ""
    },
    {
      "text": "Steven D Findlay. 2016. Consumers’ interest in provider ratings grows, and improved report cards and other steps could accelerate their use. Health Affairs 35, 4 (2016), 688–696.",
      "doi": ""
    },
    {
      "text": "Rachael Fleurence, Joe V Selby, Kara Odom-Walker, Gail Hunt, David Meltzer, Jean R Slutsky, and Clyde Yancy. 2013. How the Patient-Centered Outcomes Research Institute is engaging patients and others in shaping its research agenda. Health Affairs 32, 2 (2013), 393–400.",
      "doi": ""
    },
    {
      "text": "Tira Foran, James RA Butler, Liana J Williams, Wolf J Wanjura, Andy Hall, Lucy Carter, and Peter S Carberry. 2014. Taking complexity in food systems seriously: an interdisciplinary analysis. World Development 61 (2014), 85–101.",
      "doi": ""
    },
    {
      "text": "Paulo Freire. 2013. Pedagogy of the oppressed. Routledge.",
      "doi": ""
    },
    {
      "text": "Michael Frierson. 2018. Film and video editing theory: How editing creates meaning. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Mike Y Chen, Sunny Consolvo, Beverly Harrison, and James A Landay. 2007. MyExperience: a system for in situ tracing and capturing of user feedback on mobile phones. Proceedings of the 5th international conference on Mobile systems, applications and services (2007), 57–70.",
      "doi": "10.1145/1247660.1247670"
    },
    {
      "text": "Karin Fröhlich, Marko Nieminen, Anicia Peters, and Antti Pinomaa. 2018. Considerations for co-designing e-government services in under-served rural communities. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities. 1–4.",
      "doi": "10.1145/3283458.3283476"
    },
    {
      "text": "Rikin Gandhi, Rajesh Veeraraghavan, Kentaro Toyama, and Vanaja Ramprasad. 2007. Digital green: Participatory video for agricultural extension. 2007 International conference on information and communication technologies and development (2007), 1–10.",
      "doi": ""
    },
    {
      "text": "Bradley L Garrett. 2011. Videographic geographies: Using digital video for geographic research. Progress in Human Geography 35, 4 (2011), 521–541.",
      "doi": ""
    },
    {
      "text": "Susmita Ghosh, Md Ruhul Kabir, Md Mahmudul Islam Khan, Lincon Chandra Shill, and Syeda Saima Alam. 2020. Knowledge, Attitude, and Practice (KAP) regarding personal hygiene among primary school going children in Sadar Upazilla, Noakhali District, Bangladesh. Indian Journal of Public Health 11, 6 (2020), 1465.",
      "doi": ""
    },
    {
      "text": "Göran Goldkuhl. 2012. Pragmatism vs interpretivism in qualitative information systems research. European journal of information systems 21, 2 (2012), 135–146.",
      "doi": ""
    },
    {
      "text": "David Philip Green, Simon J. Bowen, Christopher Newell, Guy Schofield, Tom Bartindale, Clara Crivellaro, Alia Sheikh, Peter Wright, and Patrick Olivier. 2015. Beyond Participatory Production: Digitally Supporting Grassroots Documentary. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3157–3166. https://doi.org/10.1145/2702123.2702203",
      "doi": "10.1145/2702123.2702203"
    },
    {
      "text": "Independent Evaluation Group. 2018. Engaging Citizens for Better Development Results: An Independent Evaluation. World Bank.",
      "doi": ""
    },
    {
      "text": "Aline Gubrium and Krista Harper. 2016. Participatory visual and digital methods. Vol. 10. Routledge.",
      "doi": ""
    },
    {
      "text": "Aakriti Gupta and Umesh C Kapil. 2017. Quantum Jump in the Coverage of Mega Doses of Vitamin A Supplementation Program to Children in India.Indian pediatrics 54, 9 (2017), 784–786.",
      "doi": ""
    },
    {
      "text": "Anita Gurumurthy. 2018. Where is the ‘struggle’in communications for social progress?Global media and communication 14, 2 (2018), 193–200.",
      "doi": ""
    },
    {
      "text": "L Haddad, A Mejia Acosta, and J Fanzo. 2012. Accelerating reductions in undernutrition: what can nutrition governance tell us. University of Sussex. Brighton: Institute of Development Studies (2012), –.",
      "doi": ""
    },
    {
      "text": "Roger W Harris. 2016. How ICT4D research fails the poor. Information Technology for Development 22, 1 (2016), 177–192.",
      "doi": "10.1080/02681102.2015.1018115"
    },
    {
      "text": "Katharine Haynes and Thomas M Tanner. 2015. Empowering young people and strengthening resilience: Youth-centred participatory video as a tool for climate change adaptation and disaster risk reduction. Children’s Geographies 13, 3 (2015), 357–371.",
      "doi": ""
    },
    {
      "text": "Jessica Heckert, Deanna K Olney, and Marie T Ruel. 2019. Is women’s empowerment a pathway to improving child nutrition outcomes in a nutrition-sensitive agriculture program?: Evidence from a randomized controlled trial in Burkina Faso. Social Science & Medicine 233 (2019), 93–102.",
      "doi": ""
    },
    {
      "text": "Richard Heeks. 2003. Most eGovernment-for-development projects fail: how can risks be reduced? (2003).",
      "doi": ""
    },
    {
      "text": "Vanessa Herringshaw. 2018. Increasing citizen voice and government responsiveness: what does success really look like, and who decides? (2018).",
      "doi": ""
    },
    {
      "text": "Melissa R Ho, Thomas N Smyth, Matthew Kam, and Andy Dearden. 2009. Human-computer interaction for development: The past, present, and future. Information Technologies & International Development 5, 4 (2009), pp–1.",
      "doi": ""
    },
    {
      "text": "Shakibul Islam. 2017. Assessment of the Impact and Management of Flood, Drought and River Bank Erosion: A Case Study of Char Land Peoples of Gangachara Upazila, Rangpur District, Bangladesh. Imperial Journal of Interdisciplinary Research 3, 4 (2017), 96–111.",
      "doi": ""
    },
    {
      "text": "Naila Kabeer and Simeen Mahmud. 2004. Globalization, gender and poverty: Bangladeshi women workers in export and local markets. Journal of international development 16, 1 (2004), 93–109.",
      "doi": ""
    },
    {
      "text": "Ilan Kapoor. 2005. Participatory development, complicity and desire. Third world quarterly 26, 8 (2005), 1203–1220.",
      "doi": ""
    },
    {
      "text": "Stephen Katende. 2018. Citizen Voice and Action (CVA) Model: Field practitioner version evidence 4 change.",
      "doi": ""
    },
    {
      "text": "Finn Kensing and Jeanette Blomberg. 1998. Participatory design: Issues and concerns. Computer supported cooperative work (CSCW) 7, 3 (1998), 167–185.",
      "doi": ""
    },
    {
      "text": "Sara Kindon, Rachel Pain, and Mike Kesby. 2007. Participatory action research approaches and methods: Connecting people, participation and place. Vol. 22. Routledge.",
      "doi": ""
    },
    {
      "text": "Cecilie Kjeldsberg, Niva Shrestha, Miti Patel, Dale Davis, Gary Mundy, and Kenda Cunningham. 2018. Nutrition-sensitive agricultural interventions and gender dynamics: A qualitative study in Nepal. Maternal & child nutrition 14, 3 (2018), e12593.",
      "doi": ""
    },
    {
      "text": "Hubert Knoblauch and Bernt Schnettler. 2012. Videography: Analysing video data as a ‘focused’ethnographic and hermeneutical exercise. Qualitative Research 12, 3 (2012), 334–356.",
      "doi": ""
    },
    {
      "text": "Benedikt Korf. 2010. The geography of participation. Third World Quarterly 31, 5 (2010), 709–720.",
      "doi": ""
    },
    {
      "text": "Lindah Kotut and D. Scott McCrickard. 2022. Winds of Change: Seeking, Preserving, and Retelling Indigenous Knowledge Through Self-Organized Online Communities. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 257, 15 pages. https://doi.org/10.1145/3491102.3502094",
      "doi": "10.1145/3491102.3502094"
    },
    {
      "text": "Neha Kumar. 2015. The gender-technology divide or perceptions of non-use?First Monday (2015).",
      "doi": ""
    },
    {
      "text": "Isabelle Lemaire and Soledad Muñiz. 2011. Participatory Video for Monitoring and Evaluation of Community Based Adaptation to Climate Change.",
      "doi": ""
    },
    {
      "text": "Alex John London. 2005. Justice and the human development approach to international research. Hastings Center Report 35, 1 (2005), 24–37.",
      "doi": ""
    },
    {
      "text": "Nicholas Mays, Catherine Pope, and Jennie Popay. 2005. Systematically reviewing qualitative and quantitative evidence to inform management and policy-making in the health field. Journal of health services research & policy 10, 1_suppl (2005), 6–20.",
      "doi": ""
    },
    {
      "text": "Rosemary McGee, Duncan Edwards, Hannah Hudson, Colin Anderson, and Francesca Feruglio. 2018. Appropriating technology for accountability: messages from Making All Voices Count. (2018).",
      "doi": ""
    },
    {
      "text": "Claire Mcloughlin and Zoe Scott. 2014. Service Delivery: Topic Guide.",
      "doi": ""
    },
    {
      "text": "Matthew B Miles and A Michael Huberman. 1994. Qualitative data analysis: An expanded sourcebook. sage.",
      "doi": ""
    },
    {
      "text": "Claudia Mitchell. 2011. Doing visual research. Sage.",
      "doi": ""
    },
    {
      "text": "Claudia Mitchell, Naydene De Lange, and Relebohile Moletsane. 2016. Me and my cellphone: Constructing change from the inside through cellphilms and participatory video in a rural community. Area 48, 4 (2016), 435–441.",
      "doi": ""
    },
    {
      "text": "Preeti Mudliar, Jonathan Donner, and William Thies. 2012. Emergent practices around CGNet Swara, voice forum for citizen journalism in rural India. Proceedings of the Fifth International Conference on Information and Communication Technologies and Development (2012), 159–168.",
      "doi": "10.1145/2160673.2160695"
    },
    {
      "text": "NIPORT and ICF. 2019. Bangladesh Demographic and Health Survey 2017–18: Key Indicators. Dhaka, Bangladesh, and Rockville, Maryland, USA (2019).",
      "doi": ""
    },
    {
      "text": "HLPE Nutrition. 2017. food systems: a report by the High Level Panel of Experts on Food Security and Nutrition of the Committee on World Food Security. Rome: Commitee on World Food Security (2017), 152.",
      "doi": ""
    },
    {
      "text": "OECD. 2019. Aid by DAC members increases in 2019 with more aid to the poorest countries. https://www.oecd.org/dac/financing-sustainable-development/development-finance-data/ODA-2019-detailed-summary.pdf.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Deborah K Padgett. 2016. Qualitative methods in social work research. Vol. 36. Sage publications.",
      "doi": ""
    },
    {
      "text": "Tapan S Parikh and Edward D Lazowska. 2006. Designing an architecture for delivering mobile information services to the rural developing world. Proceedings of the 15th international conference on World Wide Web (2006), 791–800.",
      "doi": "10.1145/1135777.1135897"
    },
    {
      "text": "Anicia N. Peters, Heike Winschiers-Theophilus, Kagonya Awori, Nicola J. Bidwell, Edwin Blake, Arun Kumar, and Shilumbe Chivuno-Kuria. 2014. Collaborating with Communities in Africa: A Hitchhikers Guide. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1969–1974. https://doi.org/10.1145/2559206.2581313",
      "doi": "10.1145/2559206.2581313"
    },
    {
      "text": "Sarah Pink. 2020. Doing visual ethnography. Sage.",
      "doi": ""
    },
    {
      "text": "Food Planning and Ministry of Food Monitoring Unit (FPMU). 2021. Bangladesh Second Country Investment Plan Nutrition-Sensitive Food Systems (CIP2 2016-2020) Monitoring Report 2021. Dhaka, Bangladesh (2021).",
      "doi": ""
    },
    {
      "text": "Bridget Pratt. 2019. Constructing citizen engagement in health research priority-setting to attend to dynamics of power and difference. Developing world bioethics 19, 1 (2019), 45–60.",
      "doi": ""
    },
    {
      "text": "Bridget Pratt. 2019. Inclusion of marginalized groups and communities in global health research priority-setting. Journal of Empirical Research on Human Research Ethics 14, 2 (2019), 169–181.",
      "doi": ""
    },
    {
      "text": "Wendy Quarry and Ricardo Ramirez. 2009. Building Community Trust to Improve Participation in COVID-19 Testing and Contact Tracing. Bloomsbury Publishing.",
      "doi": ""
    },
    {
      "text": "Atiya Rahman, Margaret Leppard, Sarawat Rashid, Nauruj Jahan, and Hashima E Nasreen. 2016. Community perceptions of behaviour change communication interventions of the maternal neonatal and child health programme in rural Bangladesh: an exploratory study. BMC health services research 16, 1 (2016), 1–13.",
      "doi": ""
    },
    {
      "text": "Md Mostafizur Rahman. 2018. Farmers’Knowledge, Attitude and Practice (KAP) Towards Agricultural Mechanization of Babuganj Upazilla Under Barisal District. Ph. D. Dissertation. Department of Agricultural Extension & Information system, Sher-E-Bangla ….",
      "doi": ""
    },
    {
      "text": "Terri Raney, Gustavo Anríquez, André Croppenstedt, Stefano Gerosa, Sarah K Lowder, Ira Matuschke, and Jakob Skoet. 2011. The role of women in agriculture. (2011).",
      "doi": ""
    },
    {
      "text": "Tony Roberts. 2016. Women’s use of participatory video technology to tackle gender inequality in Zambia’s ICT sector. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/2909609.2909673"
    },
    {
      "text": "Emma Rose and Alison Cardinal. 2018. Participatory video methods in UX: Sharing power with users to gain insights into everyday life. Communication Design Quarterly Review 6, 2 (2018), 9–20.",
      "doi": "10.1145/3282665.3282667"
    },
    {
      "text": "Marie T Ruel, Harold Alderman, Maternal, Child Nutrition Study Group, 2013. Nutrition-sensitive interventions and programmes: how can they help to accelerate progress in improving maternal and child nutrition?The lancet 382, 9891 (2013), 536–551.",
      "doi": ""
    },
    {
      "text": "Manika Saha, Tom Bartindale, Sharifa Sultana, Gillian Oliver, Shakuntala Haraksingh Thilsted, Syed Ishtiaque Ahmed, Delvin Varghese, and Patrick Olivier. 2022. Pictorial Consent: Fieldwork Reflections. In Proceedings of 20th European Conference on Computer-Supported Cooperative Work. European Society for Socially Embedded Technologies (EUSSET).",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. 2018. \" Privacy is not for me, it’s for those rich women\": Performative Privacy Practices on Mobile Phones by Women in South Asia. Fourteenth Symposium on Usable Privacy and Security ({ SOUPS} 2018) (2018), 127–142.",
      "doi": ""
    },
    {
      "text": "Leonie Sandercock and Giovanni Attili. 2010. Digital ethnography as planning praxis: An experiment with film as social research, community engagement and policy dialogue. Planning Theory & Practice 11, 1 (2010), 23–45.",
      "doi": ""
    },
    {
      "text": "Bidhan Krishna Sarker, Malay Kanti Mridha, Sushil Kanti Dasgupta, Noushin Islam, and Laura Reichenbach. 2012. The effect of Behavior Change Communication (BCC) interventions on maternal neonatal and child health (MNCH) knowledge in urban slums of Bangladesh [working paper]. Manoshi Working Paper 17 (2012).",
      "doi": ""
    },
    {
      "text": "Laura Schelenz and Maria Pawelec. 2021. Information and Communication Technologies for Development (ICT4D) critique. Information Technology for Development (2021), 1–24.",
      "doi": ""
    },
    {
      "text": "Tom Schofield, Daniel Foster-Smith, Gonul Bozoglu, and Christopher Whitehead. 2018. Co-Producing Collections: Re-imagining a Polyvocal Past with Cultural Probes. Open Library of Humanities (2018).",
      "doi": ""
    },
    {
      "text": "Joshua Schwab-Cartas and Claudia Mitchell. 2014. A tale of two sites: Cellphones, participatory video and indigeneity in community-based research. McGill Journal of Education/Revue des sciences de l’éducation de McGill 49, 3 (2014), 603–620.",
      "doi": ""
    },
    {
      "text": "Asif Mohammad Shahan and Ferdous Jahan. 2017. Opening the policy space: the dynamics of nutrition policy making in Bangladesh.",
      "doi": ""
    },
    {
      "text": "Indu K Sharma, Sabina Di Prima, Dirk Essink, and Jacqueline EW Broerse. 2021. Nutrition-sensitive agriculture: a systematic review of impact pathways to nutrition outcomes. Advances in Nutrition 12, 1 (2021), 251–275.",
      "doi": ""
    },
    {
      "text": "Gursharan Singh, Leah Findlater, Kentaro Toyama, Scott Helmer, Rikin Gandhi, and Ravin Balakrishnan. 2009. Numeric paper forms for NGOs. 2009 International Conference on Information and Communication Technologies and Development (ICTD) (2009), 406–416.",
      "doi": ""
    },
    {
      "text": "Larry Stillman, Mauro Sarrica, Tom Denison, and Anindita Sarker. 2020. After the smartphone has arrived in the village. how practices and proto-practices emerged in an ict4d project. International Development Informatics Association Conference (2020), 81–94.",
      "doi": ""
    },
    {
      "text": "Christiane Struckmann. 2018. A postcolonial feminist critique of the 2030 Agenda for Sustainable Development: A South African application. Agenda 32, 1 (2018), 12–24.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design Within a Patriarchal Society: Opportunities and Challenges in Designing for Rural Women in Bangladesh. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174110",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Renata Tesch. 2013. Qualitative research: Analysis types and software. Routledge.",
      "doi": ""
    },
    {
      "text": "Crystal Tremblay and Leila Harris. 2018. Critical video engagements: Empathy, subjectivity and changing narratives of water resources through participatory video. Geoforum 90 (2018), 174–182.",
      "doi": ""
    },
    {
      "text": "Crystal Tremblay and Bruno de Oliveira Jayme. 2015. Community knowledge co-creation through participatory video. Action Research 13, 3 (2015), 298–314.",
      "doi": ""
    },
    {
      "text": "Paul Van Mele. 2006. Zooming-in zooming-out: a novel method to scale up local innovations and sustainable technologies. International journal of agricultural sustainability 4, 2 (2006), 131–142.",
      "doi": ""
    },
    {
      "text": "Paul Van Mele. 2011. Video-mediated farmer-to-farmer learning for sustainable agriculture. A scoping study for SDC, SAI Platform and GFRAS (2011), 1–47.",
      "doi": ""
    },
    {
      "text": "Victor Van Reijswoud. 2009. Appropriate ICT as a tool to increase effectiveness in ICT4D: Theoretical considerations and illustrating cases. The Electronic Journal of Information Systems in Developing Countries 38, 1 (2009), 1–18.",
      "doi": ""
    },
    {
      "text": "Delvin Varghese, Patrick Olivier, Tom Bartindale, and Matt Baillie Smith. 2020. Towards Participatory Video 2.0. (2020), 1–13. https://doi.org/10.1145/3313831.3376694",
      "doi": "10.1145/3313831.3376694"
    },
    {
      "text": "Christina Vasiliou and Tom Schofield. 2019. Technology, Theatre and Co-design: Impact and Design Considerations. In IFIP conference on human-computer interaction. Springer, 387–396.",
      "doi": ""
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring Participation: On How We Involve People in Design. (2013), 429–438. https://doi.org/10.1145/2470654.2470716",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Louise Waite and Cath Conn. 2011. Creating a space for young women’s voices: using ‘participatory video drama’in Uganda. Gender, Place and Culture 18, 01 (2011), 115–135.",
      "doi": ""
    },
    {
      "text": "Geoff Walsham. 2017. ICT4D research: reflections on history and future agenda. Information Technology for Development 23, 1 (2017), 18–41.",
      "doi": "10.1080/02681102.2016.1246406"
    },
    {
      "text": "Caroline C Wang. 1999. Photovoice: A participatory action research strategy applied to women’s health. Journal of women’s health 8, 2 (1999), 185–192.",
      "doi": ""
    },
    {
      "text": "Zhi Wang, Lifeng Sun, Wenwu Zhu, Shiqiang Yang, Hongzhi Li, and Dapeng Wu. 2012. Joint social and content recommendation for user-generated videos in online social network. IEEE Transactions on Multimedia 15, 3 (2012), 698–709.",
      "doi": "10.1109/TMM.2012.2237022"
    },
    {
      "text": "Hilary Warburton and Adrienne Martin. 1999. Local people’s knowledge in natural resources research.",
      "doi": ""
    },
    {
      "text": "Human Rights Watch. 2015. Child Marriage:Bangladesh. Dhaka, Bangladesh (2015). https://www.hrw.org/report/2015/06/09/marry-your-house-swept-away/child-marriage-bangladesh",
      "doi": ""
    },
    {
      "text": "Shirley A White. 1999. The art of facilitating participation: Releasing the power of grassroots communication. New Delhi: Sage Pub.",
      "doi": ""
    },
    {
      "text": "Peter K Wiesner. 1992. Media for the people: The Canadian experiments with film and video in community development. American Review of Canadian Studies 22, 1 (1992), 65–99.",
      "doi": ""
    },
    {
      "text": "Heike Winschiers-Theophilus and Nicola J Bidwell. 2013. Toward an Afro-Centric indigenous HCI paradigm. International Journal of Human-Computer Interaction 29, 4 (2013), 243–255.",
      "doi": ""
    },
    {
      "text": "Heike Winschiers-Theophilus, Naska Winschiers-Goagoses, Kasper Rodil, Edwin Blake, Tariq Zaman, Gereon Koch Kapuire, and Richard Kamukuenjandje. 2013. Moving away from Erindi-roukambe: Transferability of a rural community-based co-design. (2013).",
      "doi": ""
    },
    {
      "text": "Steven H Woolf, Emily Zimmerman, Amber Haley, and Alex H Krist. 2016. Authentic engagement of patients and communities can transform research, practice, and policy. Health Affairs 35, 4 (2016), 590–594.",
      "doi": ""
    },
    {
      "text": "Kyung-Hwa Yang. 2012. Reflexivity, participation, and video. The handbook of participatory video (2012), 100–114.",
      "doi": ""
    },
    {
      "text": "Iris Marion Young. 2002. Inclusion and democracy. Oxford University press on demand.",
      "doi": ""
    }
  ]
}