{
  "doi": "10.1145/3544548.3581287",
  "title": "Understanding tensions in music accessibility through song signing for and with d/Deaf and Non-d/Deaf persons",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Song signing is a method practiced by people who are d/Deaf and non-d/Deaf individuals to visually represent music and make music accessible through sign language and body movements. Although there is growing interest in song signing, there is a lack of understanding on what d/Deaf people value about song signing and how to make song signing productions that they would consider acceptable. We conducted semi-structured interviews with 12 d/Deaf participants to gain a deeper understanding of what they value in music and song signing. We then interviewed 14 song signers to understand their experiences and processes in creating song signing performances. From this study, we identify three complex, interrelated layers of the song signing creation process and discuss how they can be supported and completed to potentially bridge the cultural divide between the d/Deaf and non-d/Deaf audiences and guide more culturally responsive creation of music.",
  "authors": [
    {
      "name": "Suhyeon Yoo",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782148",
      "orcid": "0000-0001-6098-9947"
    },
    {
      "name": "Georgianna Lin",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783266",
      "orcid": "0000-0002-9993-2718"
    },
    {
      "name": "Hyeon Jeong Byeon",
      "institution": "Computer Science and Engineering, Ewha Womans University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659894443",
      "orcid": "0000-0002-0811-2504"
    },
    {
      "name": "Amy S. Hwang",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704869",
      "orcid": "0000-0003-0217-6088"
    },
    {
      "name": "Khai Nhut Truong",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81339532748/rel-imgonly/81339532748.jpg",
      "acmid": "81339532748",
      "orcid": "0000-0003-0774-5964"
    }
  ],
  "references": [
    {
      "text": "1993. Do you feel comfortable having hearing people signing songs to deaf audience?Deaf Life (Jul 1993), p. 60.",
      "doi": ""
    },
    {
      "text": "Kailyn Aaron Lozano and H Dirksen L Bauman. 2022. Sign Language Music Videos: Language Preservation or Appropriation?In The Routledge Companion to Art and Disability.",
      "doi": ""
    },
    {
      "text": "Paweł Aleksandrowicz. 2020. Can subtitles for the deaf and hard-of-hearing convey the emotions of film music? A reception study. Perspectives 28, 1 (2020), 58–72.",
      "doi": ""
    },
    {
      "text": "Felipe Alves Araujo, Fabricio Lima Brasil, Allison Candido Lima Santos, Luzenildo de Sousa Batista Junior, Savio Pereira Fonseca Dutra, and Carlos Eduardo Coelho Freire Batista. 2017. Auris system: providing vibrotactile feedback for hearing impaired population. BioMed research international 2017 (2017).",
      "doi": ""
    },
    {
      "text": "Shunya Ariga, Masataka Goto, and Koji Yatani. 2017. Strummer: An interactive guitar chord practice system. In 2017 IEEE International Conference on Multimedia and Expo (ICME). IEEE, 1057–1062.",
      "doi": ""
    },
    {
      "text": "Ben Bahan. 2006. Face-to-face tradition in the American Deaf Community. Signing the body poetic(2006), 21–50.",
      "doi": ""
    },
    {
      "text": "Mathieu Barthet, György Fazekas, and Mark Sandler. 2012. Music emotion recognition: From content-to context-based models. In International symposium on computer music modeling and retrieval. Springer, 228–252.",
      "doi": ""
    },
    {
      "text": "Beth S Benedict and Marilyn Sass-Lehrer. 2007. Deaf and hearing partnerships: Ethical and communication considerations. American annals of the deaf 152, 3 (2007), 275–282.",
      "doi": ""
    },
    {
      "text": "Tony Bergstrom, Karrie Karahalios, and John C Hart. 2007. Isochords: visualizing structure in music. In Proceedings of Graphics Interface 2007. 297–304.",
      "doi": "10.1145/1268517.1268565"
    },
    {
      "text": "Katelyn E Best. 2015. “We still have a dream” the deaf hip hop movement and the struggle against the socio-cultural marginalization of deaf people. Lied und populäre Kultur/Song and Popular Culture 60 (2015), 61–86.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Sylvain Brétéché. 2019. The Deaf Musical Experience. In International Symposium on Computer Music Multidisciplinary Research. Springer, 422–448.",
      "doi": ""
    },
    {
      "text": "Diane Brewer. 2002. West side silence: Producing West Side Story with deaf and hearing actors. Theatre Topics 12, 1 (2002), 17–34.",
      "doi": ""
    },
    {
      "text": "Noah Buchholz. 2018. Seeing music? An inquiry into the place of music in Deaf culture. Journal of American Sign Languages & Literatures (2018).",
      "doi": ""
    },
    {
      "text": "Doga Cavdir. 2022. Touch, Listen,(Re) Act: Co-designing Vibrotactile Wearable Instruments for Deaf and Hard of Hearing. In NIME 2022. PubPub.",
      "doi": ""
    },
    {
      "text": "James I Charlton. 1998. Nothing about us without us. In Nothing About Us Without Us. University of California Press.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. sage.",
      "doi": ""
    },
    {
      "text": "Jody Cripps. 2018. Ethnomusicology & signed music: A breakthrough. Journal of American Sign Languages & Literatures (2018).",
      "doi": ""
    },
    {
      "text": "Jody H Cripps. 2017. Understanding Signed Music. Society for American Sign Language Journal 1 (2017).",
      "doi": ""
    },
    {
      "text": "Jody H Cripps, Ely Rosenblum, Anita Small, and Samuel J Supalla. 2017. A case study on signed music: The emergence of an inter-performance art. Liminalities 13, 2 (2017).",
      "doi": ""
    },
    {
      "text": "Robert Dale. 2021. GPT-3: What’s it good for?Natural Language Engineering 27, 1 (2021), 113–118.",
      "doi": ""
    },
    {
      "text": "Alice-Ann Darrow. 1987. Exploring the arts of sign and song. Music Educators Journal 74, 1 (1987), 32–35.",
      "doi": ""
    },
    {
      "text": "Alice-Ann Darrow. 1993. The role of music in deaf culture: Implications for music educators. Journal of Research in Music Education 41, 2 (1993), 93–110.",
      "doi": ""
    },
    {
      "text": "Alice-Ann Darrow. 2006. Sounds in the silence: Research on music and deafness. Update: Applications of Research in Music Education 25, 1 (2006), 5–14.",
      "doi": ""
    },
    {
      "text": "Maartje De Meulder. 2019. “So, why do you sign?” Deaf and hearing new signers, their motivation, and revitalisation policies for sign languages. Applied Linguistics Review 10, 4 (2019), 705–724.",
      "doi": ""
    },
    {
      "text": "Nicolas DeGuglielmo, Cesar Lobo, Edward J Moriarty, Gloria Ma, and Douglas E Dow. 2021. Haptic Vibrations for Hearing Impaired to Experience Aspects of Live Music. In International Conference on Bio-inspired Information and Communication Technologies. Springer, 71–86.",
      "doi": ""
    },
    {
      "text": "Jordan Aiko Deja, Alexczar Dela Torre, Hans Joshua Lee, Jose Florencio Ciriaco IV, and Carlo Miguel Eroles. 2020. Vitune: A visualizer tool to allow the deaf and hard of hearing to see music with their eyes. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3334480.3383046"
    },
    {
      "text": "Becca Dingman, Garreth W Tigwell, and Kristen Shinohara. 2021. Designing a Podcast Platform for Deaf and Hard of Hearing Users. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. 1–4.",
      "doi": "10.1145/3441852.3476523"
    },
    {
      "text": "Daniel PW Ellis. 2006. Extracting information from music audio. Commun. ACM 49, 8 (2006), 32–37.",
      "doi": "10.1145/1145287.1145310"
    },
    {
      "text": "Karla Enriquez, Melany Palacios, Daniel Pallo, and Graciela Guerrero. 2020. SENSE: Sensory component VR application for hearing impaired people to enhance the music experience. In 2020 15th Iberian Conference on Information Systems and Technologies (CISTI). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Citra Fadillah and RR Ratna Amalia Rahayu. 2019. Sound Visualization Using Typography Composition Based GIF. In 2019 International Conference on Sustainable Engineering and Creative Computing (ICSECC). IEEE, 309–314.",
      "doi": ""
    },
    {
      "text": "Michael Fell. 2020. Natural language processing for music information retrieval: deep analysis of lyrics structure and content. Ph. D. Dissertation. Université Côte d’Azur.",
      "doi": ""
    },
    {
      "text": "Jami N Fisher, Gene Mirus, and Donna Jo Napoli. 2019. Sticky: Taboo topics in deaf communities. (2019).",
      "doi": ""
    },
    {
      "text": "Vicky J Fisher. 2021. Embodied Songs: Insights Into the Nature of Cross-Modal Meaning-Making Within Sign Language Informed, Embodied Interpretations of Vocal Music. Frontiers in psychology 12 (2021).",
      "doi": ""
    },
    {
      "text": "Luciano Floridi and Massimo Chiriatti. 2020. GPT-3: Its nature, scope, limits, and consequences. Minds and Machines 30, 4 (2020), 681–694.",
      "doi": "10.1007/s11023-020-09548-1"
    },
    {
      "text": "David Fourney. 2012. Can computer representations of music enhance enjoyment for individuals who are hard of hearing?. In International Conference on Computers for Handicapped Persons. Springer, 535–542.",
      "doi": "10.1007/978-3-642-31522-0_80"
    },
    {
      "text": "David W Fourney and Deborah I Fels. 2009. Creating access to music through visualization. In 2009 ieee toronto international conference science and technology for humanity (tic-sth). IEEE, 939–944.",
      "doi": ""
    },
    {
      "text": "Hiromasa Fujihara, Masataka Goto, Jun Ogata, and Hiroshi G Okuno. 2011. LyricSynchronizer: Automatic synchronization system between musical audio signals and lyrics. IEEE Journal of Selected Topics in Signal Processing 5, 6 (2011), 1252–1261.",
      "doi": ""
    },
    {
      "text": "Graham R Gibbs. 2007. Thematic coding and categorizing. Analyzing qualitative data 703 (2007), 38–56.",
      "doi": ""
    },
    {
      "text": "Abraham Glasser, Fyodor Minakov, and Danielle Bragg. 2022. ASL Wiki: An Exploratory Interface for Crowdsourcing ASL Translations. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": "10.1145/3517428.3544827"
    },
    {
      "text": "Satoshi Hashizume, Shinji Sakamoto, Kenta Suzuki, and Yoichi Ochiai. 2018. Livejacket: Wearable music experience device with multiple speakers. In International Conference on Distributed, Ambient, and Pervasive Interactions. Springer, 359–371.",
      "doi": "10.1007/978-3-319-91125-0_30"
    },
    {
      "text": "Alice Haynes, Jonathan Lawry, Christopher Kent, and Jonathan Rossiter. 2021. FeelMusic: enriching our emotive experience of music through audio-tactile mappings. Multimodal Technologies and Interaction 5, 6 (2021), 29.",
      "doi": ""
    },
    {
      "text": "Gabrielle Hodge. 2020. The ideology of communication practices embedded in an Australian deaf/hearing dance collaboration. Sign Language Ideologies in Practice(2020), 59–82.",
      "doi": ""
    },
    {
      "text": "Jessica A Holmes. 2017. Expert listening beyond the limits of hearing: Music and deafness. Journal of the American Musicological Society 70, 1 (2017), 171–220.",
      "doi": ""
    },
    {
      "text": "Ryo Iijima, Akihisa Shitara, and Yoichi Ochiai. 2022. Designing Gestures for Digital Musical Instruments: Gesture Elicitation Study with Deaf and Hard of Hearing People. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility. 1–8.",
      "doi": "10.1145/3517428.3544828"
    },
    {
      "text": "Eric J Isaacson. 2005. What You See Is What You Get: on Visualizing Music.. In ISMIR. 389–395.",
      "doi": ""
    },
    {
      "text": "Robert Jack, Andrew McPherson, and Tony Stockman. 2015. Designing tactile musical devices with and for deaf users: a case study. In Proceedings of the International Conference on the Multimodal Experience of Music, Sheffield, UK. 23–25.",
      "doi": ""
    },
    {
      "text": "Haojian Jin, Yale Song, and Koji Yatani. 2017. Elasticplay: Interactive video summarization with dynamic time budgets. In Proceedings of the 25th ACM international conference on Multimedia. 1164–1172.",
      "doi": "10.1145/3123266.3123393"
    },
    {
      "text": "Junichi Kanebako, Fusako Kusunoki, Shigenori Inagaki, and Miki Namatame. 2015. Proposal for science learning materials using a\" VibGrip\". In Proceedings of the 12th International Conference on Advances in Computer Entertainment Technology. 1–3.",
      "doi": "10.1145/2832932.2832935"
    },
    {
      "text": "Junichi Kanebako and Kouta Minamizawa. 2016. VibGrip++: haptic device allows feeling the music for hearing impaired people. In International AsiaHaptics conference. Springer, 449–452.",
      "doi": ""
    },
    {
      "text": "Maria Karam, Carmen Branje, Gabe Nespoli, Norma Thompson, Frank A Russo, and Deborah I Fels. 2010. The emoti-chair: an interactive tactile music exhibit. In CHI’10 Extended Abstracts on Human Factors in Computing Systems. 3069–3074.",
      "doi": ""
    },
    {
      "text": "Maria Karam and Deborah I Fels. 2008. Designing a model human cochlea: Issues and challenges in crossmodal audio-haptic displays. In Proceedings of the 2008 Ambi-Sys workshop on Haptic user interfaces in ambient media systems. 1–9.",
      "doi": ""
    },
    {
      "text": "Maria Karam, Gabe Nespoli, Frank Russo, and Deborah I Fels. 2009. Modelling perceptual elements of music in a vibrotactile display for deaf users: A field study. In 2009 Second International Conferences on Advances in Computer-Human Interactions. IEEE, 249–254.",
      "doi": "10.1109/ACHI.2009.64"
    },
    {
      "text": "Tanya Keshari and Suja Palaniswamy. 2019. Emotion recognition using feature-level fusion of facial expressions and body gestures. In 2019 International Conference on Communication and Electronics Systems (ICCES). IEEE, 1184–1189.",
      "doi": ""
    },
    {
      "text": "Michael Kipp, Alexis Heloir, and Quan Nguyen. 2011. Sign language avatars: Animation and comprehensibility. In International Workshop on Intelligent Virtual Agents. Springer, 113–126.",
      "doi": ""
    },
    {
      "text": "Katri Kosonen and Roope Raisamo. 2006. Rhythm perception through different modalities. In Proc. EuroHaptics. 365–370.",
      "doi": ""
    },
    {
      "text": "Daniel G Lee, Deborah I Fels, and John Patrick Udo. 2007. Emotive captioning. Computers in Entertainment (CIE) 5, 2 (2007), 11.",
      "doi": "10.1145/1236224.1236242"
    },
    {
      "text": "Sang Won Lee and Jeffrey Scott. 2017. Word level lyrics-audio synchronization using separated vocals. In 2017 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 646–650.",
      "doi": "10.1109/ICASSP.2017.7952235"
    },
    {
      "text": "Kelly Mack, Danielle Bragg, Meredith Ringel Morris, Maarten W Bos, Isabelle Albi, and Andrés Monroy-Hernández. 2020. Social app accessibility for deaf signers. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–31.",
      "doi": "10.1145/3415196"
    },
    {
      "text": "Anabel Maler. 2013. Songs for hands: Analyzing interactions of sign language and music. Music theory online 19, 1 (2013).",
      "doi": ""
    },
    {
      "text": "Anabel Maler. 2015. Musical expression among deaf and hearing song signers. The Oxford handbook of music and disability studies (2015), 73–91.",
      "doi": ""
    },
    {
      "text": "Anabel Maler. 2022. Music and Deafness in the Nineteenth-Century US Imagination. Journal of the Society for American Music(2022), 1–22.",
      "doi": ""
    },
    {
      "text": "Anabel Maler and Robert Komaniecki. 2021. Rhythmic Techniques in Deaf Hip Hop. Music Theory Online 27, 1 (2021).",
      "doi": ""
    },
    {
      "text": "Heather Harden Mangelsdorf, Jason Listman, and Anabel Maler. 2021. Perception of Musicality and Emotion in Signed Songs. Music Perception: An Interdisciplinary Journal 39, 2 (2021), 160–180.",
      "doi": ""
    },
    {
      "text": "Jennifer Mankoff, Gillian R Hayes, and Devva Kasnitz. 2010. Disability studies as a source of critical inquiry for the field of assistive technology. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility. 3–10.",
      "doi": "10.1145/1878803.1878807"
    },
    {
      "text": "Antonella Mazzoni and Nick Bryan-Kinns. 2016. Mood glove: A haptic wearable prototype system to enhance mood music in film. Entertainment Computing 17 (2016), 9–17.",
      "doi": ""
    },
    {
      "text": "Thomas Barlow McHugh, Abir Saha, David Bar-El, Marcelo Worsley, and Anne Marie Piper. 2021. Towards Inclusive Streaming: Building Multimodal Music Experiences for the Deaf and Hard of Hearing. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": ""
    },
    {
      "text": "Sebastian Merchel and M Ercan Altinsoy. 2014. The influence of vibrations on musical experience. Journal of the Audio Engineering Society 62, 4 (2014), 220–234.",
      "doi": ""
    },
    {
      "text": "Jorge Mori and Deborah I Fels. 2009. Seeing the music can animated lyrics provide access to the emotional content in music for people who are deaf or hard of hearing?. In 2009 IEEE Toronto International Conference Science and Technology for Humanity (TIC-STH). IEEE, 951–956.",
      "doi": ""
    },
    {
      "text": "John W Morley and Mark J Rowe. 1990. Perceived pitch of vibrotactile stimuli: effects of vibration amplitude, and implications for vibration frequency coding.The Journal of physiology 431, 1 (1990), 403–416.",
      "doi": ""
    },
    {
      "text": "Suranga Nanayakkara, Elizabeth Taylor, Lonce Wyse, and S H Ong. 2009. An enhanced musical experience for the deaf: design and evaluation of a music display and a haptic chair. In Proceedings of the sigchi conference on human factors in computing systems. 337–346.",
      "doi": "10.1145/1518701.1518756"
    },
    {
      "text": "Suranga Chandima Nanayakkara, Elizabeth Taylor, Lonce Wyse, and SH Ong. 2007. Towards building an experiential music visualizer. In 2007 6th International Conference on Information, Communications & Signal Processing. IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Suranga Chandima Nanayakkara, Lonce Wyse, Sim Heng Ong, and Elizabeth A Taylor. 2013. Enhancing musical experience for the hearing-impaired using visual and haptic displays. Human–Computer Interaction 28, 2 (2013), 115–160.",
      "doi": ""
    },
    {
      "text": "Ashley M Nassiri, Donna L Sorkin, and Matthew L Carlson. 2022. Current estimates of cochlear implant utilization in the United States. Otology & Neurotology 43, 5 (2022), e558–e562.",
      "doi": ""
    },
    {
      "text": "NIH National Institute of Health. 2021. Quick statistics about hearing. https://www.nidcd.nih.gov/health/statistics/quick-statistics-hearing",
      "doi": ""
    },
    {
      "text": "Kia Ng, Joanne Armitage, and Alex McLean. 2014. The colour of music: Real-time music visualisation with synaesthetic sound-colour mapping. Electronic Visualisation and the Arts (EVA 2014) (2014), 17–20.",
      "doi": ""
    },
    {
      "text": "Catherine O’Brien, Crystal Kroner, and Peggy Placier. 2015. Deaf culture and academic culture: Cultivating understanding across cultural and linguistic boundaries.Journal of Diversity in Higher Education 8, 2 (2015), 104.",
      "doi": ""
    },
    {
      "text": "Keita Ohshiro and Mark Cartwright. 2022. How people who are deaf, Deaf, and hard of hearing use technology in creative sound activities. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility. 1–4.",
      "doi": "10.1145/3517428.3550396"
    },
    {
      "text": "Benjamin I Outram. 2016. Synesthesia audio-visual interactive-sound and music visualization in virtual reality with orbital observation and navigation. In 2016 IEEE International Workshop on Mixed Reality Art (MRA). IEEE, 7–8.",
      "doi": ""
    },
    {
      "text": "Carol A Padden and Tom Humphries. 1988. Deaf in America: Voices from a culture. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Soochul Park and Ben Sangbae Chon. 2020. GSEP: A robust vocal and accompaniment separation system using gated CBHG module and loudness normalization. arXiv preprint arXiv:2010.12139(2020).",
      "doi": ""
    },
    {
      "text": "Joana Morêdo Pereira. 2021. Deaf on stage: the cultural impact of performing Signed Songs. University of London, University College London (United Kingdom).",
      "doi": ""
    },
    {
      "text": "Benjamin Petry, Thavishi Illandara, Don Samitha Elvitigala, and Suranga Nanayakkara. 2018. Supporting rhythm activities of deaf children using music-sensory-substitution systems. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3173574.3174060"
    },
    {
      "text": "Benjamin Petry, Thavishi Illandara, Juan Pablo Forero, and Suranga Nanayakkara. 2016. Ad-hoc access to musical sound for deaf individuals. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. 285–286.",
      "doi": "10.1145/2982142.2982213"
    },
    {
      "text": "Benjamin Petry, Thavishi Illandara, and Suranga Nanayakkara. 2016. MuSS-bits: sensor-display blocks for deaf people to explore musical sounds. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. 72–80.",
      "doi": "10.1145/3010915.3010939"
    },
    {
      "text": "Michael Pouris and Deborah I Fels. 2012. Creating an entertaining and informative music visualization. In International Conference on Computers for Handicapped Persons. Springer, 451–458.",
      "doi": "10.1007/978-3-642-31522-0_68"
    },
    {
      "text": "Konstantinos Pyrovolakis, Paraskevi Tzouveli, and George Stamou. 2021. Mood detection analyzing lyrics and audio signal based on deep learning architectures. In 2020 25th International Conference on Pattern Recognition (ICPR). IEEE, 9363–9370.",
      "doi": ""
    },
    {
      "text": "Raisa Rashid, Quoc Vy, Richard Hunt, and Deborah I Fels. 2008. Dancing with words: Using animated text for captioning. Intl. Journal of Human–Computer Interaction 24, 5(2008), 505–519.",
      "doi": ""
    },
    {
      "text": "Pablo Revuelta, Tomás Ortiz, María J Lucía, Belén Ruiz, and José Manuel Sánchez-Pena. 2020. Limitations of standard accessible captioning of sounds and music for deaf and hard of hearing people: An EEG study. Frontiers in integrative neuroscience(2020), 1.",
      "doi": ""
    },
    {
      "text": "Kelly Robinson. 2021. Knowing by DEAF-Listening: Epistemologies & Ontologies Revealed in Song-Signing. (2021).",
      "doi": ""
    },
    {
      "text": "WUD Rodrigo, HUW Ratnayake, and IA Premaratne. 2021. Identification of Music Instruments from a Music Audio File. In Proceedings of International Conference on Sustainable Expert Systems. Springer, 335–352.",
      "doi": ""
    },
    {
      "text": "Martin Rothenberg, Ronald T Verrillo, Stephen A Zahorian, Michael L Brachman, and Stanley J Bolanowski Jr. 1977. Vibrotactile frequency for encoding a speech parameter. The Journal of the Acoustical Society of America 62, 4 (1977), 1003–1012.",
      "doi": ""
    },
    {
      "text": "Joseph Rovan and Vincent Hayward. 2000. Typology of tactile sounds and their synthesis in gesture-driven computer music performance. Trends in gestural control of music(2000), 297–320.",
      "doi": ""
    },
    {
      "text": "Frank A Russo, Paolo Ammirante, and Deborah I Fels. 2012. Vibrotactile discrimination of musical timbre.Journal of Experimental Psychology: Human Perception and Performance 38, 4(2012), 822.",
      "doi": ""
    },
    {
      "text": "Ioannis Petros Samiotis, Sihang Qiu, Andrea Mauri, Cynthia CS Liem, Christoph Lofi, and Alessandro Bozzon. 2020. Microtask Crowdsourcing for Music Score Transcriptions: An Experiment with Error Detection.. In ISMIR. 901–907.",
      "doi": ""
    },
    {
      "text": "R Santhoshkumar and M Kalaiselvi Geetha. 2019. Deep learning approach for emotion recognition from human body movements with feedforward deep convolution neural networks. Procedia Computer Science 152 (2019), 158–165.",
      "doi": "10.1016/j.procs.2019.05.038"
    },
    {
      "text": "Pierre Schmitt. 2017. Representations of sign language, deaf people, and interpreters in the arts and the media. Sign Language Studies 18, 1 (2017), 130–147.",
      "doi": ""
    },
    {
      "text": "Anastasia Schmitz, Catherine Holloway, and Youngjun Cho. 2020. Hearing through Vibrations: Perception of Musical Emotions by Profoundly Deaf People. arXiv preprint arXiv:2012.13265(2020).",
      "doi": ""
    },
    {
      "text": "Jerry C Schnepp, Rosalee J Wolfe, John C McDonald, and Jorge A Toro. 2012. Combining emotion and facial nonmanual signals in synthesized american sign language. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility. 249–250.",
      "doi": "10.1145/2384916.2384977"
    },
    {
      "text": "Andréanne Sharp, BA Bacon, and F Champoux. 2020. Enhanced tactile identification of musical emotion in the deaf. Experimental brain research 238, 5 (2020), 1229–1236.",
      "doi": ""
    },
    {
      "text": "Miguel Cuadrado Sierra, Jonas Brunskog, and Jeremy Marozeau. 2021. An audio-tactile artinstallation for hearing impaired people. In 2nd Nordic Sound and Music Conference.",
      "doi": ""
    },
    {
      "text": "Jason M Silveira and Frank M Diaz. 2014. The effect of subtitles on listeners’ perceptions of expressivity. Psychology of music 42, 2 (2014), 233–250.",
      "doi": ""
    },
    {
      "text": "Anita Small. 2021. Mentorship for Canadian Deaf Artists: Fostering Deaf Performance Arts Excellence. Canadian Cultural Society of the Deaf(2021).",
      "doi": ""
    },
    {
      "text": "Robert G Smith and Brian Nolan. 2016. Emotional facial expressions in synthesised sign language avatars: a manual evaluation. Universal Access in the Information Society 15, 4 (2016), 567–576.",
      "doi": "10.1007/s10209-015-0410-7"
    },
    {
      "text": "Ene Alicia Søderberg, Rasmus Emil Odgaard, Sarah Bitsch, Oliver Høeg-Jensen, Nikolaj Schildt Christensen, Søren Dahl Poulsen, and Steven Gelineck. 2016. Music Aid: Towards a Collaborative Experience for Deaf and Hearing People in Creating Music. In New Interfaces for Musical Expression.",
      "doi": ""
    },
    {
      "text": "Nan Song, Hongwu Yang, and Peiwen Wu. 2018. A gesture-to-emotional speech conversion by combining gesture recognition and facial expression recognition. In 2018 First Asian Conference on Affective Computing and Intelligent Interaction (ACII Asia). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "T Stark, SJ Brockmeier, P Nopp, M Vischer, WD Baumgartner, F Schön, J Müller, T Braunschweig, W Arnold, and DJ Allum. 2003. Correlation of speech and music appreciation in post-lingually deaf Combi 40/40+ cochlear implant users. Cochlear implants international 4, S1 (2003), 68–69.",
      "doi": ""
    },
    {
      "text": "Minhyang (Mia) Suh, Emily Youngblom, Michael Terry, and Carrie J Cai. 2021. AI as Social Glue: Uncovering the Roles of Deep Generative AI during Social Music Composition. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 582, 11 pages. https://doi.org/10.1145/3411764.3445219",
      "doi": "10.1145/3411764.3445219"
    },
    {
      "text": "Veronika Szucs, Beata Kovacs, and Balint Tasnadi. 2018. Music for seeing–visualization of sounds. In 2018 9th IEEE International Conference on Cognitive Infocommunications (CogInfoCom). IEEE, 000123–000128.",
      "doi": ""
    },
    {
      "text": "Pauline Tranchant, Martha M Shiell, Marcello Giordano, Alexis Nadeau, Isabelle Peretz, and Robert J Zatorre. 2017. Feeling the beat: Bouncing synchronization to vibrotactile music in hearing and early deaf people. Frontiers in neuroscience 11 (2017), 507.",
      "doi": ""
    },
    {
      "text": "Urvish Trivedi, Redwan Alqasemi, and Rajiv Dubey. 2019. Wearable musical haptic sleeves for people with hearing impairment. In Proceedings of the 12th ACM International Conference on Pervasive Technologies Related to Assistive Environments. 146–151.",
      "doi": "10.1145/3316782.3316796"
    },
    {
      "text": "Tim Tse, Justin Salamon, Alex C Williams, Helga Jiang, and Edith Law. 2016. Ensemble: A Hybrid Human-Machine System for Generating Melody Scores from Audio.. In ISMIR. 143–149.",
      "doi": ""
    },
    {
      "text": "Luca Turchet, Travis West, and Marcelo M Wanderley. 2021. Touching the audience: musical haptic wearables for augmented and participatory live music performances. Personal and Ubiquitous Computing 25, 4 (2021), 749–769.",
      "doi": "10.1007/s00779-020-01395-2"
    },
    {
      "text": "Stefan Uhlich, Franck Giron, and Yuki Mitsufuji. 2015. Deep neural network based instrument extraction from music. In 2015 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 2135–2139.",
      "doi": ""
    },
    {
      "text": "Joy Victory. 2021. Hearing loss statistics at a glance. https://www.healthyhearing.com/report/52814-Hearing-loss-statistics-at-a-glance",
      "doi": ""
    },
    {
      "text": "Ulrich Von Agris, Jörg Zieren, Ulrich Canzler, Britta Bauer, and Karl-Friedrich Kraiss. 2008. Recent developments in visual sign language recognition. Universal Access in the Information Society 6, 4 (2008), 323–362.",
      "doi": "10.1007/s10209-007-0104-x"
    },
    {
      "text": "Quoc V Vy, Jorge A Mori, David W Fourney, and Deborah I Fels. 2008. EnACT: A software tool for creating animated text captions. In International Conference on Computers for Handicapped Persons. Springer, 609–616.",
      "doi": "10.1007/978-3-540-70540-6_87"
    },
    {
      "text": "Amy Wilson and Nickson Kakiri. 2011. Best practices for collaborating with deaf communities in developing countries. Deaf around the world: The impact of language (2011), 271–286.",
      "doi": ""
    },
    {
      "text": "Ju-Lee A Wolsey, Kim Misener Dunn, Scott W Gentzke, Hannah A Joharchi, M Diane Clark, and CSEDL Team. 2017. Deaf/hearing research partnerships. American Annals of the Deaf 161, 5 (2017), 571–582.",
      "doi": ""
    },
    {
      "text": "Yi-Hsuan Yang and Homer H Chen. 2011. Music emotion recognition. CRC Press.",
      "doi": ""
    },
    {
      "text": "Yixiao Zhang, Junyan Jiang, Gus Xia, and Simon Dixon. 2022. Interpreting Song Lyrics with an Audio-Informed Pre-trained Language Model. arXiv preprint arXiv:2208.11671(2022).",
      "doi": ""
    },
    {
      "text": "Zhongyi Zhou, Anran Xu, and Koji Yatani. 2021. SyncUp: Vision-based Practice Support for Synchronized Dancing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 3 (2021), 1–25.",
      "doi": "10.1145/3478120"
    }
  ]
}