{
  "doi": "10.1145/3544548.3580685",
  "title": "Vergence Matching: Inferring Attention to Objects in 3D Environments for Gaze-Assisted Selection",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Gaze pointing is the de facto standard to infer attention and interact in 3D environments but is limited by motor and sensor limitations. To circumvent these limitations, we propose a vergence-based motion correlation method to detect visual attention toward very small targets. Smooth depth movements relative to the user are induced on 3D objects, which cause slow vergence eye movements when looked upon. Using the principle of motion correlation, the depth movements of the object and vergence eye movements are matched to determine which object the user is focussing on. In two user studies, we demonstrate how the technique can reliably infer gaze attention on very small targets, systematically explore how different stimulus motions affect attention detection, and show how the technique can be extended to multi-target selection. Finally, we provide example applications using the concept and design guidelines for small target and accuracy-independent attention detection in 3D environments.",
  "tags": [
    "Motion Correlation",
    "Gaze",
    "Attention Detection",
    "Virtual Reality",
    "Vergence",
    "Small Targets",
    "Selection"
  ],
  "authors": [
    {
      "name": "Ludwig Sidenmark",
      "institution": "Computing and Communications, Lancaster University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659431013",
      "orcid": "0000-0002-7965-0107"
    },
    {
      "name": "Christopher Clarke",
      "institution": "University of Bath, United Kingdom",
      "img": "/do/10.1145/contrib-99658704149/rel-imgonly/headshot-smile-small.jpg",
      "acmid": "99658704149",
      "orcid": "0000-0003-3916-7708"
    },
    {
      "name": "Joshua Newn",
      "institution": "Computing and Communications, Lancaster University, United Kingdom",
      "img": "/do/10.1145/contrib-99658770761/rel-imgonly/joshua-newn.jpg",
      "acmid": "99658770761",
      "orcid": "0000-0001-5769-6297"
    },
    {
      "name": "Mathias N. Lystbæk",
      "institution": "Department of Computer Science, Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660345771",
      "orcid": "0000-0001-6624-3732"
    },
    {
      "name": "Ken Pfeuffer",
      "institution": "Department of Computer Science, Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549578256",
      "orcid": "0000-0002-5870-1120"
    },
    {
      "name": "Hans Gellersen",
      "institution": "Computing and Communications, Lancaster University, United Kingdom and Department of Computer Science, Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616827",
      "orcid": "0000-0003-2233-2121"
    }
  ],
  "references": [
    {
      "text": "Sunggeun Ahn, Stephanie Santosa, Mark Parent, Daniel Wigdor, Tovi Grossman, and Marcello Giordano. 2021. StickyPie: A Gaze-Based, Scale-Invariant Marking Menu Optimized for AR/VR. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 739, 16 pages. https://doi.org/10.1145/3411764.3445297",
      "doi": "10.1145/3411764.3445297"
    },
    {
      "text": "Sunggeun Ahn, Jeongmin Son, Sangyoon Lee, and Geehyuk Lee. 2020. Verge-It: Gaze Interaction for a Binocular Head-Worn Display Using Modulated Disparity Vergence Eye Movement. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3334480.3382908",
      "doi": "10.1145/3334480.3382908"
    },
    {
      "text": "Rawan Alghofaili, Yasuhito Sawahata, Haikun Huang, Hsueh-Cheng Wang, Takaaki Shiratori, and Lap-Fai Yu. 2019. Lost in Style: Gaze-Driven Adaptive Aid for VR Navigation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300578",
      "doi": "10.1145/3290605.3300578"
    },
    {
      "text": "Rawan Alghofaili, Michael S Solah, Haikun Huang, Yasuhito Sawahata, Marc Pomplun, and Lap-Fai Yu. 2019. Optimizing Visual Element Placement via Visual Attention Analysis. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 464–473. https://doi.org/10.1109/VR.2019.8797816",
      "doi": ""
    },
    {
      "text": "Ferran Argelaguet and Carlos Andujar. 2013. A survey of 3D object selection techniques for virtual environments. Computers & Graphics 37, 3 (2013), 121–136. https://doi.org/10.1016/j.cag.2012.12.003",
      "doi": "10.1016/j.cag.2012.12.003"
    },
    {
      "text": "Isayas B. Adhanom, Samantha C. Lee, Eelke Folmer, and Paul MacNeilage. 2020. GazeMetrics: An Open-Source Tool for Measuring the Data Quality of HMD-Based Eye Trackers. In ACM Symposium on Eye Tracking Research and Applications (Stuttgart, Germany) (ETRA ’20 Short Papers). ACM, Article 19, 5 pages. https://doi.org/10.1145/3379156.3391374",
      "doi": "10.1145/3379156.3391374"
    },
    {
      "text": "Marc Baloup, Thomas Pietrzak, and Géry Casiez. 2019. RayCursor: A 3D Pointing Facilitation Technique Based on Raycasting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 101, 12 pages. https://doi.org/10.1145/3290605.3300331",
      "doi": "10.1145/3290605.3300331"
    },
    {
      "text": "Pieter Blignaut. 2009. Fixation identification: The optimum threshold for a dispersion algorithm. Attention, Perception, & Psychophysics 71, 4 (01 May 2009), 881–895. https://doi.org/10.3758/APP.71.4.881",
      "doi": ""
    },
    {
      "text": "Richard A. Bolt. 1981. Gaze-Orchestrated Dynamic Windows. SIGGRAPH Comput. Graph. 15, 3 (aug 1981), 109–119. https://doi.org/10.1145/965161.806796",
      "doi": "10.1145/965161.806796"
    },
    {
      "text": "Kathleen E. Cullen and Marion R. Van Horn. 2011. The neural control of fast vs. slow vergence eye movements. European Journal of Neuroscience 33, 11 (2011), 2147–2154. https://doi.org/10.1111/j.1460-9568.2011.07692.x",
      "doi": ""
    },
    {
      "text": "Gerwin de Haan, Michal Koutek, and Frits H. Post. 2005. IntenSelect: Using Dynamic Object Rating for Assisting 3D Object Selection. In Proceedings of the 11th Eurographics Conference on Virtual Environments (Aalborg, Denmark) (EGVE’05). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 201–209. https://doi.org/10.2312/EGVE/IPT_EGVE2005/201-209",
      "doi": ""
    },
    {
      "text": "Neil A. Dodgson. 2004. Variation and extrema of human interpupillary distance. In Stereoscopic Displays and Virtual Reality Systems XI, Mark T. Bolas, Andrew J. Woods, John O. Merritt, and Stephen A. Benton (Eds.). Vol. 5291. International Society for Optics and Photonics, SPIE, 36 – 46. https://doi.org/10.1117/12.529999",
      "doi": ""
    },
    {
      "text": "Niklas Elmqvist and Philippas Tsigas. 2008. A Taxonomy of 3D Occlusion Management for Visualization. IEEE Transactions on Visualization and Computer Graphics 14, 5(2008), 1095–1109. https://doi.org/10.1109/TVCG.2008.59",
      "doi": "10.1109/TVCG.2008.59"
    },
    {
      "text": "Augusto Esteves, Eduardo Velloso, Andreas Bulling, and Hans Gellersen. 2015. Orbits: Gaze Interaction for Smart Watches Using Smooth Pursuit Eye Movements. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(Charlotte, NC, USA) (UIST ’15). ACM, New York, NY, USA, 457–466. https://doi.org/10.1145/2807442.2807499",
      "doi": "10.1145/2807442.2807499"
    },
    {
      "text": "Anna Maria Feit, Shane Williams, Arturo Toledo, Ann Paradiso, Harish Kulkarni, Shaun Kane, and Meredith Ringel Morris. 2017. Toward Everyday Gaze Input: Accuracy and Precision of Eye Tracking and Implications for Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1118–1130. https://doi.org/10.1145/3025453.3025599",
      "doi": "10.1145/3025453.3025599"
    },
    {
      "text": "Christoph Gebhardt, Brian Hecox, Bas van Opheusden, Daniel Wigdor, James Hillis, Otmar Hilliges, and Hrvoje Benko. 2019. Learning Cooperative Personalized Policies from Gaze Data. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 197–208. https://doi.org/10.1145/3332165.3347933",
      "doi": "10.1145/3332165.3347933"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2006. The Design and Evaluation of Selection Techniques for 3D Volumetric Displays. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology(Montreux, Switzerland) (UIST ’06). ACM, New York, NY, USA, 3–12. https://doi.org/10.1145/1166253.1166257",
      "doi": "10.1145/1166253.1166257"
    },
    {
      "text": "Teresa Hirzle, Jan Gugenheimer, Florian Geiselhart, Andreas Bulling, and Enrico Rukzio. 2019. A Design Space for Gaze Interaction on Head-Mounted Displays. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300855",
      "doi": "10.1145/3290605.3300855"
    },
    {
      "text": "Kenneth Holmqvist, Marcus Nyström, Richard Andersson, Richard Dewhurst, Jarodzka Halszka, and Joost van de Weijer. 2011. Eye Tracking : A Comprehensive Guide to Methods and Measures. Oxford University Press. 560 pages.",
      "doi": ""
    },
    {
      "text": "Zhiming Hu, Andreas Bulling, Sheng Li, and Guoping Wang. 2021. FixationNet: Forecasting Eye Fixations in Task-Oriented Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 27, 5(2021), 2681–2690. https://doi.org/10.1109/TVCG.2021.3067779",
      "doi": ""
    },
    {
      "text": "Robert J. K. Jacob. 1991. The Use of Eye Movements in Human-Computer Interaction Techniques: What You Look at is What You Get. ACM Trans. Inf. Syst. 9, 2 (apr 1991), 152–169. https://doi.org/10.1145/123078.128728",
      "doi": "10.1145/123078.128728"
    },
    {
      "text": "Stephanie Jainta, Maria Pia Bucci, Sylvette Wiener-Vacher, and Zoï Kapoula. 2011. Changes in vergence dynamics due to repetition. Vision Research 51, 16 (2011), 1845–1852. https://doi.org/10.1016/j.visres.2011.06.014",
      "doi": ""
    },
    {
      "text": "Shahram Jalaliniya and Diako Mardanbegi. 2016. EyeGrip: Detecting Targets in a Series of Uni-Directional Moving Objects Using Optokinetic Nystagmus Eye Movements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5801–5811. https://doi.org/10.1145/2858036.2858584",
      "doi": "10.1145/2858036.2858584"
    },
    {
      "text": "Mohamed Khamis, Carl Oechsner, Florian Alt, and Andreas Bulling. 2018. VRpursuits: Interaction in Virtual Reality Using Smooth Pursuit Eye Movements. In Proceedings of the 2018 International Conference on Advanced Visual Interfaces(Castiglione della Pescaia, Grosseto, Italy) (AVI ’18). ACM, New York, NY, USA, Article 18, 8 pages. https://doi.org/10.1145/3206505.3206522",
      "doi": "10.1145/3206505.3206522"
    },
    {
      "text": "Mikko Kytö, Barrett Ens, Thammathip Piumsomboon, Gun A. Lee, and Mark Billinghurst. 2018. Pinpointing: Precise Head- and Eye-Based Target Selection for Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 81, 14 pages. https://doi.org/10.1145/3173574.3173655",
      "doi": "10.1145/3173574.3173655"
    },
    {
      "text": "Judith B Lavrich. 2010. Convergence insufficiency and its current treatment. Current opinion in ophthalmology 21, 5 (2010), 356–360. https://doi.org/10.1097/ICU.0b013e32833cf03a",
      "doi": ""
    },
    {
      "text": "David Lindlbauer, Anna Maria Feit, and Otmar Hilliges. 2019. Context-Aware Online Adaptation of Mixed Reality Interfaces. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 147–160. https://doi.org/10.1145/3332165.3347945",
      "doi": "10.1145/3332165.3347945"
    },
    {
      "text": "Feiyu Lu, Shakiba Davari, and Doug Bowman. 2021. Exploration of Techniques for Rapid Activation of Glanceable Information in Head-Worn Augmented Reality. In Symposium on Spatial User Interaction (Virtual Event, USA) (SUI ’21). Association for Computing Machinery, New York, NY, USA, Article 14, 11 pages. https://doi.org/10.1145/3485279.3485286",
      "doi": "10.1145/3485279.3485286"
    },
    {
      "text": "Feiyu Lu, Shakiba Davari, Lee Lisle, Yuan Li, and Doug A. Bowman. 2020. Glanceable AR: Evaluating Information Access Methods for Head-Worn Augmented Reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 930–939. https://doi.org/10.1109/VR46266.2020.00113",
      "doi": ""
    },
    {
      "text": "Yiqin Lu, Chun Yu, and Yuanchun Shi. 2020. Investigating Bubble Mechanism for Ray-Casting to Improve 3D Target Acquisition in Virtual Reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 35–43. https://doi.org/10.1109/VR46266.2020.00021",
      "doi": ""
    },
    {
      "text": "Diako Mardanbegi, Christopher Clarke, and Hans Gellersen. 2019. Monocular Gaze Depth Estimation Using the Vestibulo-ocular Reflex. In Proceedings of the 11th ACM Symposium on Eye Tracking Research & Applications (Denver, Colorado) (ETRA ’19). ACM, New York, NY, USA, Article 20, 9 pages. https://doi.org/10.1145/3314111.3319822",
      "doi": "10.1145/3314111.3319822"
    },
    {
      "text": "Diako Mardanbegi, Dan Witzner Hansen, and Thomas Pederson. 2012. Eye-based Head Gestures. In Proceedings of the Symposium on Eye Tracking Research and Applications (Santa Barbara, California) (ETRA ’12). ACM, New York, NY, USA, 139–146. https://doi.org/10.1145/2168556.2168578",
      "doi": "10.1145/2168556.2168578"
    },
    {
      "text": "Diako Mardanbegi, Tobias Langlotz, and Hans Gellersen. 2019. Resolving Target Ambiguity in 3D Gaze Interaction Through VOR Depth Estimation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 612, 12 pages. https://doi.org/10.1145/3290605.3300842",
      "doi": "10.1145/3290605.3300842"
    },
    {
      "text": "P. McCullagh and J. A. Nelder. 1989. Generalized Linear Models. Chapman and Hall/CRC. 532 pages.",
      "doi": ""
    },
    {
      "text": "Mark R Mine. 1995. Virtual environment interaction techniques. Technical Report. UNC Chapel Hill CS Dept.",
      "doi": ""
    },
    {
      "text": "Brad A. Myers, Rishi Bhatnagar, Jeffrey Nichols, Choon Hong Peck, Dave Kong, Robert Miller, and A. Chris Long. 2002. Interacting at a Distance: Measuring the Performance of Laser Pointers and Other Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI ’02). Association for Computing Machinery, New York, NY, USA, 33–40. https://doi.org/10.1145/503376.503383",
      "doi": "10.1145/503376.503383"
    },
    {
      "text": "Marcus Nyström and Kenneth Holmqvist. 2010. An adaptive algorithm for fixation, saccade, and glissade detection in eyetracking data. Behavior Research Methods 42, 1 (01 Feb 2010), 188–204. https://doi.org/10.3758/BRM.42.1.188",
      "doi": ""
    },
    {
      "text": "Yun Suen Pai, Benjamin Outram, Noriyasu Vontin, and Kai Kunze. 2016. Transparent Reality: Using Eye Gaze Focus Depth as Interaction Modality. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16 Adjunct). Association for Computing Machinery, New York, NY, USA, 171–172. https://doi.org/10.1145/2984751.2984754",
      "doi": "10.1145/2984751.2984754"
    },
    {
      "text": "Soonchan Park, Seokyeol Kim, and Jinah Park. 2012. Select Ahead: Efficient Object Selection Technique Using the Tendency of Recent Cursor Movements. In Proceedings of the 10th Asia Pacific Conference on Computer Human Interaction (Matsue-city, Shimane, Japan) (APCHI ’12). Association for Computing Machinery, New York, NY, USA, 51–58. https://doi.org/10.1145/2350046.2350060",
      "doi": "10.1145/2350046.2350060"
    },
    {
      "text": "Ken Pfeuffer, Jason Alexander, Ming Ki Chong, and Hans Gellersen. 2014. Gaze-Touch: Combining Gaze with Multi-Touch for Interaction on the Same Surface. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 509–518. https://doi.org/10.1145/2642918.2647397",
      "doi": "10.1145/2642918.2647397"
    },
    {
      "text": "Ken Pfeuffer, Benedikt Mayer, Diako Mardanbegi, and Hans Gellersen. 2017. Gaze + Pinch Interaction in Virtual Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (Brighton, United Kingdom) (SUI ’17). ACM, New York, NY, USA, 99–108. https://doi.org/10.1145/3131277.3132180",
      "doi": "10.1145/3131277.3132180"
    },
    {
      "text": "Ken Pfeuffer, Melodie Vidal, Jayson Turner, Andreas Bulling, and Hans Gellersen. 2013. Pursuit Calibration: Making Gaze Calibration Less Tedious and More Flexible. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 261–270. https://doi.org/10.1145/2501988.2501998",
      "doi": "10.1145/2501988.2501998"
    },
    {
      "text": "Yuan Yuan Qian and Robert J. Teather. 2017. The Eyes Don’T Have It: An Empirical Comparison of Head-based and Eye-based Selection in Virtual Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (Brighton, United Kingdom) (SUI ’17). ACM, New York, NY, USA, 91–98. https://doi.org/10.1145/3131277.3132182",
      "doi": "10.1145/3131277.3132182"
    },
    {
      "text": "Rufat Rzayev, Sven Mayer, Christian Krauter, and Niels Henze. 2019. Notification in VR: The Effect of Notification Placement, Task and Environment. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 199–211. https://doi.org/10.1145/3311350.3347190",
      "doi": "10.1145/3311350.3347190"
    },
    {
      "text": "Dario D. Salvucci and Joseph H. Goldberg. 2000. Identifying Fixations and Saccades in Eye-Tracking Protocols. In Proceedings of the 2000 Symposium on Eye Tracking Research & Applications (Palm Beach Gardens, Florida, USA) (ETRA ’00). Association for Computing Machinery, New York, NY, USA, 71–78. https://doi.org/10.1145/355017.355028",
      "doi": "10.1145/355017.355028"
    },
    {
      "text": "Greg Schmidt, Yohan Baillot, Dennis G. Brown, Erik B. Tomlin, and J. Edward Swan. 2006. Toward Disambiguating Multiple Selections for Frustum-Based Pointing. In 3D User Interfaces (3DUI’06). IEEE, 87–94. https://doi.org/10.1109/VR.2006.133",
      "doi": "10.1109/VR.2006.133"
    },
    {
      "text": "Ludwig Sidenmark, Christopher Clarke, Xuesong Zhang, Jenny Phu, and Hans Gellersen. 2020. Outline Pursuits: Gaze-Assisted Selection of Occluded Objects in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376438",
      "doi": "10.1145/3313831.3376438"
    },
    {
      "text": "Ludwig Sidenmark and Hans Gellersen. 2019. Eye&Head: Synergetic Eye and Head Movement for Gaze Pointing and Selection. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). ACM, New York, NY, USA, 1161–1174. https://doi.org/10.1145/3332165.3347921",
      "doi": "10.1145/3332165.3347921"
    },
    {
      "text": "Ludwig Sidenmark, Diako Mardanbegi, Argenis Ramirez Gomez, Christopher Clarke, and Hans Gellersen. 2020. BimodalGaze: Seamlessly Refined Pointing with Gaze and Filtered Gestural Head Movement. In ACM Symposium on Eye Tracking Research and Applications (Stuttgart, Germany) (ETRA ’20 Full Papers). Association for Computing Machinery, New York, NY, USA, Article 8, 9 pages. https://doi.org/10.1145/3379155.3391312",
      "doi": "10.1145/3379155.3391312"
    },
    {
      "text": "Ludwig Sidenmark, Mark Parent, Chi-Hao Wu, Joannes Chan, Michael Glueck, Daniel Wigdor, Tovi Grossman, and Marcello Giordano. 2022. Weighted Pointer: Error-aware Gaze-based Interaction through Fallback Modalities. IEEE Transactions on Visualization and Computer Graphics 28, 11(2022), 3585–3595. https://doi.org/10.1109/TVCG.2022.3203096",
      "doi": ""
    },
    {
      "text": "Ludwig Sidenmark, Dominic Potts, Bill Bapisch, and Hans Gellersen. 2021. Radi-Eye: Hands-Free Radial Interfaces for 3D Interaction Using Gaze-Activated Head-Crossing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 740, 11 pages. https://doi.org/10.1145/3411764.3445697",
      "doi": "10.1145/3411764.3445697"
    },
    {
      "text": "Oleg Špakov and Päivi Majaranta. 2012. Enhanced Gaze Interaction Using Simple Head Gestures. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (Pittsburgh, Pennsylvania) (UbiComp ’12). ACM, New York, NY, USA, 705–710. https://doi.org/10.1145/2370216.2370369",
      "doi": "10.1145/2370216.2370369"
    },
    {
      "text": "Frank Steinicke, Timo Ropinski, and Klaus Hinrichs. 2006. Object Selection in Virtual Environments Using an Improved Virtual Pointer Metaphor. Springer Netherlands, Dordrecht, 320–326. https://doi.org/10.1007/1-4020-4179-9_46",
      "doi": ""
    },
    {
      "text": "Lode Vanacken, Tovi Grossman, and Karin Coninx. 2007. Exploring the Effects of Environment Density and Target Visibility on Object Selection in 3D Virtual Environments. In 2007 IEEE Symposium on 3D User Interfaces. IEEE. https://doi.org/10.1109/3DUI.2007.340783",
      "doi": ""
    },
    {
      "text": "Eduardo Velloso, Marcus Carter, Joshua Newn, Augusto Esteves, Christopher Clarke, and Hans Gellersen. 2017. Motion Correlation: Selecting Objects by Matching Their Movement. ACM Trans. Comput.-Hum. Interact. 24, 3, Article 22 (April 2017), 35 pages. https://doi.org/10.1145/3064937",
      "doi": "10.1145/3064937"
    },
    {
      "text": "Eduardo Velloso, Flavio Luiz Coutinho, Andrew Kurauchi, and Carlos H. Morimoto. 2018. Circular Orbits Detection for Gaze Interaction Using 2D Correlation and Profile Matching Algorithms. In Proceedings of the 2018 ACM Symposium on Eye Tracking Research & Applications (Warsaw, Poland) (ETRA ’18). ACM, New York, NY, USA, Article 25, 9 pages. https://doi.org/10.1145/3204493.3204524",
      "doi": "10.1145/3204493.3204524"
    },
    {
      "text": "Eduardo Velloso and Carlos H Morimoto. 2021. A Probabilistic Interpretation of Motion Correlation Selection Techniques. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 285, 13 pages. https://doi.org/10.1145/3411764.3445184",
      "doi": "10.1145/3411764.3445184"
    },
    {
      "text": "Eduardo Velloso, Markus Wirth, Christian Weichel, Augusto Esteves, and Hans Gellersen. 2016. AmbiGaze: Direct Control of Ambient Devices by Gaze. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). ACM, New York, NY, USA, 812–817. https://doi.org/10.1145/2901790.2901867",
      "doi": "10.1145/2901790.2901867"
    },
    {
      "text": "Mélodie Vidal, Andreas Bulling, and Hans Gellersen. 2013. Pursuits: Spontaneous Interaction with Displays Based on Smooth Pursuit Eye Movement and Moving Targets. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Zurich, Switzerland) (UbiComp ’13). ACM, New York, NY, USA, 439–448. https://doi.org/10.1145/2493432.2493477",
      "doi": "10.1145/2493432.2493477"
    },
    {
      "text": "Rui I. Wang, Brandon Pelfrey, Andrew T. Duchowski, and Donald H. House. 2014. Online 3D Gaze Localization on Stereoscopic Displays. ACM Trans. Appl. Percept. 11, 1, Article 3 (April 2014), 21 pages. https://doi.org/10.1145/2593689",
      "doi": "10.1145/2593689"
    },
    {
      "text": "Martin Weier, Thorsten Roth, André Hinkenjann, and Philipp Slusallek. 2018. Predicting the Gaze Depth in Head-Mounted Displays Using Multiple Feature Regression. In Proceedings of the 2018 ACM Symposium on Eye Tracking Research & Applications (Warsaw, Poland) (ETRA ’18). Association for Computing Machinery, New York, NY, USA, Article 19, 9 pages. https://doi.org/10.1145/3204493.3204547",
      "doi": "10.1145/3204493.3204547"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The xAligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Qing Yang, Maria Pia Bucci, and Zoï Kapoula. 2002. The Latency of Saccades, Vergence, and Combined Eye Movements in Children and in Adults. Investigative Ophthalmology & Visual Science 43, 9 (09 2002), 2939–2949.",
      "doi": ""
    },
    {
      "text": "Shunnan Yang and James E. Sheedy. 2011. Effects of vergence and accommodative responses on viewer’s comfort in viewing 3D stimuli. In Stereoscopic Displays and Applications XXII, Andrew J. Woods, Nicolas S. Holliman, and Neil A. Dodgson (Eds.). Vol. 7863. International Society for Optics and Photonics, SPIE, 78630Q. https://doi.org/10.1117/12.872546",
      "doi": ""
    },
    {
      "text": "Shumin Zhai, William Buxton, and Paul Milgram. 1994. The “Silk Cursor”: Investigating Transparency for 3D Target Acquisition. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, Massachusetts, USA) (CHI ’94). ACM, New York, NY, USA, 459–464. https://doi.org/10.1145/191666.191822",
      "doi": "10.1145/191666.191822"
    },
    {
      "text": "Shumin Zhai, Carlos Morimoto, and Steven Ihde. 1999. Manual and Gaze Input Cascaded (MAGIC) Pointing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Pittsburgh, Pennsylvania, USA) (CHI ’99). Association for Computing Machinery, New York, NY, USA, 246–253. https://doi.org/10.1145/302979.303053",
      "doi": "10.1145/302979.303053"
    }
  ]
}