{
  "doi": "10.1145/3544548.3580700",
  "title": "Negotiating Experience and Communicating Information Through Abstract Metaphor",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "An implicit assumption in metaphor use is that it requires grounding in a familiar concept, prominently seen in the popular Desktop Metaphor. In human-to-human communication, however, abstract metaphors, without such grounding, are often used with great success. To understand when and why metaphors work, we present a case study of metaphor use in voice teaching. Voice educators must teach about subjective, sensory experiences and rely on abstract metaphor to express information about unseen and intangible processes inside the body. We present a thematic analysis of metaphor use by 12 voice teachers. We found that metaphor works not because of strong grounding in the familiar, but because of its ambiguity and flexibility, allowing shared understanding between individual lived experiences. We summarise our findings in a model of metaphor-based communication. This model can be used as an analysis tool within the existing taxonomies of metaphor in user interaction for better understanding why metaphor works in HCI. It can also be used as a design resource for thinking about metaphor use and abstracting metaphor strategies from both novel and existing designs.",
  "authors": [
    {
      "name": "Courtney N. Reed",
      "institution": "Sensorimotor Interaction Group, Max Planck Institute for Informatics, Saarland Informatics Campus, Germany and Centre for Digital Music, School of Electronic Engineering and Computer Science, Queen Mary University of London, United Kingdom",
      "img": "/do/10.1145/contrib-99659676536/rel-imgonly/creed.png",
      "acmid": "99659676536",
      "orcid": "0000-0003-0893-9277"
    },
    {
      "name": "Paul Strohmeier",
      "institution": "Sensorimotor Interaction, Max Planck Institute for Informatics, Saarland Informatics Campus, Germany",
      "img": "/do/10.1145/contrib-81498658319/rel-imgonly/crop.jpg",
      "acmid": "81498658319",
      "orcid": "0000-0002-7442-2607"
    },
    {
      "name": "Andrew P. McPherson",
      "institution": "Dyson School of Design Engineering, Imperial College London, United Kingdom and Centre for Digital Music, School of Electronic Engineering and Computer Science, Queen Mary University of London, United Kingdom",
      "img": "/do/10.1145/contrib-81421599247/rel-imgonly/andrew.jpg",
      "acmid": "81421599247",
      "orcid": "0000-0001-9323-9069"
    }
  ],
  "references": [
    {
      "text": "Anand Agarawala and Ravin Balakrishnan. 2006. Keepin’ It Real: Pushing the Desktop Metaphor with Physics, Piles and the Pen. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 1283–1292. https://doi.org/10.1145/1124772.1124965",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Alissa N. Antle, Greg Corness, and Milena Droumeva. 2009. What the body knows: Exploring the benefits of embodied metaphors in hybrid physical digital environments. Interacting with Computers 21, 1-2 (Jan. 2009), 66–75. https://doi.org/10.1016/j.intcom.2008.10.005",
      "doi": "10.1016/j.intcom.2008.10.005"
    },
    {
      "text": "Pippin Barr, Robert Biddle, and James Noble. 2002. A Taxonomy of User-Interface Metaphors. In Proceedings of the SIGCHI-NZ Symposium on Computer-Human Interaction (Hamilton, New Zealand) (CHINZ ’02). Association for Computing Machinery, New York, NY, USA, 25–30. https://doi.org/10.1145/2181216.2181221",
      "doi": "10.1145/2181216.2181221"
    },
    {
      "text": "Cordula Baur, Carolin Wienrich, and Jörn Hurtienne. 2022. Form Follows Mental Models: Finding Instantiations of Image Schemas Using a Design Research Approach. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 586–598. https://doi.org/10.1145/3532106.3533451",
      "doi": "10.1145/3532106.3533451"
    },
    {
      "text": "Michel Beaudouin-Lafon, Wendy E. Mackay, Peter Andersen, Paul Janecek, Mads Jensen, Michael Lassen, Kasper Lund, Kjeld Mortensen, Stephanie Munck, Katrine Ravn, Anne Ratzer, Søren Christensen, and Kurt Jensen. 2001. CPN/Tools: Revisiting the Desktop Metaphor with Post-WIMP Interaction Techniques. In CHI ’01 Extended Abstracts on Human Factors in Computing Systems (Seattle, Washington) (CHI EA ’01). Association for Computing Machinery, New York, NY, USA, 11–12. https://doi.org/10.1145/634067.634076",
      "doi": "10.1145/634067.634076"
    },
    {
      "text": "Michel Beaudouin-Lafon, Wendy E. Mackay, Mads Jensen, Peter Andersen, Paul Janecek, Henry Michael Lassen, Kasper Lund, Kjeld Høyer Mortensen, Stephanie Munck, Anne V. Ratzer, Katrine Ravn, Søren Christensen, and Kurt Jensen. 2001. CPN/Tools: A Tool for Editing and Simulating Coloured Petri Nets ETAPS Tool Demonstration Related to TACAS. In Proceedings of the 7th International Conference on Tools and Algorithms for the Construction and Analysis of Systems(TACAS 2001). Springer-Verlag, Berlin, Heidelberg, 574–577.",
      "doi": ""
    },
    {
      "text": "Alan F. Blackwell. 2006. The Reification of Metaphor as a Design Tool. ACM Trans. Comput.-Hum. Interact. 13, 4 (dec 2006), 490–530. https://doi.org/10.1145/1188816.1188820",
      "doi": "10.1145/1188816.1188820"
    },
    {
      "text": "Katherine M. Boydell, Angela Dew, Susan Collings, Kate Senior, and Louisa Smith (Eds.). 2020. Applying Body Mapping In Research. Routledge. https://doi.org/10.4324/9780429340260",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2020. One size fits all? What counts as quality practice in (reflexive) thematic analysis?Qualitative Research in Psychology 18, 3 (Aug. 2020), 328–352. https://doi.org/10.1080/14780887.2020.1769238",
      "doi": ""
    },
    {
      "text": "Jean Callaghan. 1998. Singing Teachers and Voice Science - An Evaluation of Voice Teaching in Australian Tertiary Institutions. Research Studies in Music Education 10, 1 (1998), 25–41. https://doi.org/10.1177/1321103X9801000103",
      "doi": ""
    },
    {
      "text": "David Canfield Smith. 2020. SIGCHI Lifetime Research Award Talk: Icons, Metaphor, and End-User Programming. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3386148",
      "doi": "10.1145/3334480.3386148"
    },
    {
      "text": "Justine Cassell. 1998. A Framework For Gesture Generation and Interpretation. In Computer Vision in Human-Machine Interaction. Cambridge University Press, 191–215.",
      "doi": ""
    },
    {
      "text": "Olivier Chapuis and Nicolas Roussel. 2005. Metisse is Not a 3D Desktop!. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology (Seattle, WA, USA) (UIST ’05). Association for Computing Machinery, New York, NY, USA, 13–22. https://doi.org/10.1145/1095034.1095038",
      "doi": "10.1145/1095034.1095038"
    },
    {
      "text": "Hillel J. Chiel and Randall D. Beer. 1997. The brain has a body: adaptive behavior emerges from interactions of nervous system, body and environment. In Trends in Neurosciences 20, 12 (1997), 553–557. https://doi.org/10.1016/s0166-2236(97)01149-1",
      "doi": ""
    },
    {
      "text": "Karen Anne Cochrane, Kristina Mah, Anna Ståhl, Claudia Núñez Pacheco, Madeline Balaam, Naseem Ahmadpour, and Lian Loke. 2022. Body Maps: A Generative Tool for Soma-Based Design. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction (Daejeon, Republic of Korea) (TEI ’22). Association for Computing Machinery, New York, NY, USA, Article 38, 14 pages. https://doi.org/10.1145/3490149.3502262",
      "doi": "10.1145/3490149.3502262"
    },
    {
      "text": "Jennifer Cumming and Sarah E. Williams. 2012. The Role of Imagery in Performance. Oxford University Press, Oxford. https://doi.org/10.1093/oxfordhb/9780199731763.013.0011",
      "doi": ""
    },
    {
      "text": "Claudia Daudén Roquet and Corina Sas. 2020. Body Matters: Exploration of the Human Body as a Resource for the Design of Technologies for Meditation. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 533–546. https://doi.org/10.1145/3357236.3395499",
      "doi": "10.1145/3357236.3395499"
    },
    {
      "text": "Claudia Daudén Roquet and Corina Sas. 2021. Interoceptive Interaction: An Embodied Metaphor Inspired Approach to Designing for Meditation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 265, 17 pages. https://doi.org/10.1145/3411764.3445137",
      "doi": "10.1145/3411764.3445137"
    },
    {
      "text": "Natalie Depraz, Francisco J. Varela, and Pierre Vermersch. 2003. On becoming aware: A pragmatics of experiencing. John Benjamins Publishing.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 1980. Where the action is: the foundations of embodied interaction. MIT Press, Cambridge.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Graham Dove and Sara Jones. 2012. Narrative Visualization: Sharing Insights into Complex Data. In Interfaces and Human Computer Interaction Conference (IHCI 2012), 21 - 23 July 2012, Lisbon, Portugal.",
      "doi": ""
    },
    {
      "text": "Susan T. Dumais and William P. Jones. 1985. A Comparison of Symbolic and Spatial Filing. SIGCHI Bull. 16, 4 (apr 1985), 127–130. https://doi.org/10.1145/1165385.317479",
      "doi": "10.1145/1165385.317479"
    },
    {
      "text": "Roslyn Dunbar-Wells. 1997. The relevance of metaphor in voice teaching: A comparative study of Sinus Tone Production and Vocal Cord Theories. Ph. D. Dissertation. University of Reading, UK.",
      "doi": ""
    },
    {
      "text": "Roslyn Dunbar-Wells. 1999. The Relevance of Metaphor to Effective Voice Teaching Strategies. Australian Voice 5(1999), 50–59.",
      "doi": ""
    },
    {
      "text": "Roslyn Dunbar-Wells. 2003. Using appropriate language modes and explicit teaching aids. Australian Voice 9(2003), 63–68.",
      "doi": ""
    },
    {
      "text": "Shirlee Emmons and Alma Thomas. 1998. Power performance for singers: Transcending the barriers. Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "Megan Farokhmanesh. 2017. Why is this floppy disk joke still haunting the internet?https://web.archive.org/web/20220424120448/https://www.theverge.com/2017/10/24/16505912/floppy-disk-3d-print-save-joke-meme",
      "doi": ""
    },
    {
      "text": "Mikhaila Friske, Jordan Wirfs-Brock, and Laura Devendorf. 2020. Entangling the Roles of Maker and Interpreter in Interpersonal Data Narratives: Explorations in Yarn and Sound. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 297–310. https://doi.org/10.1145/3357236.3395442",
      "doi": "10.1145/3357236.3395442"
    },
    {
      "text": "Denise Gastaldo, Natalia Rivas-Quarneti, and Lilian Magalhaes. 2018. Body-Map Storytelling as a Health Research Methodology: Blurred Lines Creating Clear Pictures. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research Vol 19(2018), No 2 (2018). https://doi.org/10.17169/FQS-19.2.2858",
      "doi": ""
    },
    {
      "text": "William W. Gaver. 1986. Auditory Icons: Using Sound in Computer Interfaces. Hum.-Comput. Interact. 2, 2 (jun 1986), 167–177. https://doi.org/10.1207/s15327051hci0202_3",
      "doi": "10.1207/s15327051hci0202_3"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI ’03). Association for Computing Machinery, New York, NY, USA, 233–240. https://doi.org/10.1145/642611.642653",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Raymond W. Gibbs, Paula Lenz Costa Lima, and Edson Francozo. 2004. Metaphor is grounded in embodied experience. Journal of Pragmatics 36, 7 (2004), 1189–1210. https://doi.org/10.1016/j.pragma.2003.10.009 Metaphor.",
      "doi": ""
    },
    {
      "text": "Rolf Inge Godøy and Harald Jørgensen. 2001. Musical Imagery. Number 5 in Studies on New Music Research. Swets & Zeitlinger, Lisse, Netherlands.",
      "doi": ""
    },
    {
      "text": "Barry Green and W. Timothy Gallwey. 1986. The inner game of music. Anchor Press/Doubleday, New York.",
      "doi": ""
    },
    {
      "text": "George Grouios. 1992. Mental practice: A review. Journal of Sport Behavior 15, 1 (1992), 42–59.",
      "doi": ""
    },
    {
      "text": "Horst Günter. 1992. Mental concepts in singing: A psychological approach, Part 1. The National Association of Teachers of Singing Journal 48, 5(1992), 46.",
      "doi": ""
    },
    {
      "text": "Horst Günter. 1992. Mental concepts in singing: A psychological approach, Part 2. The National Association of Teachers of Singing Journal 49, 1(1992), 4–6.",
      "doi": ""
    },
    {
      "text": "Bruce D. Hale. 1982. The effects of internal and external imagery on muscular and ocular concomitants. Journal of Sport Psychology 4 (1982), 379–387.",
      "doi": ""
    },
    {
      "text": "Bruce D. Hale. 1994. Imagery Perspectives and Learning in Sports Performance. In Imagery in Sports and Physical Performance, A. A. Sheikh and E. R. Korn (Eds.). Baywood, New York, 75–96.",
      "doi": ""
    },
    {
      "text": "Andrea R. Halpern. 2015. Differences in auditory imagery self-report predict neural and behavioral outcomes. Psychomusicology: Music, Mind, and Brain 25, 1 (2015), 37–47. https://doi.org/10.1037/pmu0000081",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The Three Paradigms of HCI. (2007), 24.",
      "doi": ""
    },
    {
      "text": "Martin Heidegger. 1967. Being and Time. Blackwell, Oxford.",
      "doi": ""
    },
    {
      "text": "Paul Hekkert and Nazlı Cila. 2015. Handle with care! Why and how designers make use of product metaphors. Design Studies 40(2015), 196–217. https://doi.org/10.1016/j.destud.2015.06.007",
      "doi": ""
    },
    {
      "text": "Jerome Hines. 1983. Great singers on great singing. Victor Gollancz, London.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2010. Transferring Qualities from Horseback Riding to Design. In Proc. NordiCHI 2010, October 16–20, 2010, Reykjavik, Iceland. 226–235. https://doi.org/10.3390/informatics5010008",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Steve Benford, Paul Tennent, Vasiliki Tsaknaki, Miquel Alfaras, Juan Martinez Avila, Christine Li, Joseph Marshall, Claudia Daudén Roquet, Pedro Sanches, Anna Ståhl, Muhammad Umair, Charles Windlin, and Feng Zhou. 2021. Unpacking Non-Dualistic Design: The Soma Design Case. ACM Transactions on Computer-Human Interaction 28, 6 (Dec. 2021), 1–36. https://doi.org/10.1145/3462448",
      "doi": "10.1145/3462448"
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline C. M. Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian F. Müller, Marianne G. Petersen, Thecla Schiphorst, Elena M. Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing First-Person Perspectives in Soma-Based Design. Informatics 5, 1 (2018), 8. https://doi.org/10.3390/informatics5010008",
      "doi": ""
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong Concepts: Intermediate-Level Knowledge in Interaction Design Research. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 23 (oct 2012), 18 pages. https://doi.org/10.1145/2362364.2362371",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Eva Hornecker and Jacob Buur. 2006. Getting a Grip on Tangible Interaction: A Framework on Physical Space and Social Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 437–446. https://doi.org/10.1145/1124772.1124838",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Noura Howell, Greg Niemeyer, and Kimiko Ryokai. 2019. Life-Affirming Biosensing in Public: Sounding Heartbeats on a Red Bench. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3290605.3300910",
      "doi": "10.1145/3290605.3300910"
    },
    {
      "text": "Samuel Huron, Pauline Gourlet, Uta Hinrichs, Trevor Hogan, and Yvonne Jansen. 2017. Let’s Get Physical: Promoting Data Physicalization in Workshop Formats. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 1409–1422. https://doi.org/10.1145/3064663.3064798",
      "doi": "10.1145/3064663.3064798"
    },
    {
      "text": "Jörn Hurtienne, Diana Löffler, Clara Hüsch, Daniel Reinhardt, Robert Tscharn, and Stephan Huber. 2020. Happy Is Up, Sad Is Down: 65 Metaphors for Design. Bis B.V., Uitgeverij (BIS Publishers).",
      "doi": ""
    },
    {
      "text": "Edmund Husserl. 2014. Ideas: General Introduction to Pure Phenomenology. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Marc Jeannerod. 1995. Mental imagery in the motor context. Neuropsychologia 33, 11 (1995), 1419–1432.",
      "doi": ""
    },
    {
      "text": "Marc Jeannerod. 1999. The 25th Bartlett Lecture ‒ To act or not to act: Perspectives on the representation of actions. Quarterly Journal of Experimental Psychology 52 (1999), 1–29.",
      "doi": ""
    },
    {
      "text": "Jennifer A. Jestley. 2011. Metaphorical and Non-Metaphorical Imagery Use in Vocal Pedagogy: An Investigation of Underlying Cognitive Organisational Constructs. Ph. D. Dissertation. University of British Columbia.",
      "doi": ""
    },
    {
      "text": "Li Jianye. 2008. Pianobell. http://labexp.blogspot.com/2008/07/pianobell.html",
      "doi": ""
    },
    {
      "text": "Jeff A. Johnson, Teresa L. Roberts, William Verplank, David C. Smith, Charles H. Irby, Marian Beard, and Kevin Mackey. 1989. The Xerox Star: a retrospective. Computer (Long Beach Calif.) 22, 9 (Sept. 1989), 11–26.",
      "doi": "10.1109/2.35211"
    },
    {
      "text": "Mark Johnson. 1989. The Body in the Mind: The Bodily Basis of Meaning, Imagination, and Reason. The Journal of Aesthetics and Art Criticism 47, 4 (1989), 400. https://doi.org/10.2307/431155",
      "doi": ""
    },
    {
      "text": "Scott R. Klemmer, Björn Hartmann, and Leila Takayama. 2006. How Bodies Matter: Five Themes for Interaction Design. In Proceedings of the 6th Conference on Designing Interactive Systems (University Park, PA, USA) (DIS ’06). Association for Computing Machinery, New York, NY, USA, 140–149. https://doi.org/10.1145/1142405.1142429",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "Robert Kosara and Jock Mackinlay. 2013. Storytelling: The Next Step for Visualization. Computer 46, 5 (may 2013), 44–50. https://doi.org/10.1109/MC.2013.36",
      "doi": "10.1109/MC.2013.36"
    },
    {
      "text": "Stephen M. Kosslyn. 1980. Image and mind. Harvard University Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Stephen M. Kosslyn, Giorgio Ganis, and William L. Thompson. 2001. Neural foundations of imagery. Nature Reviews Neuroscience 2, 9 (2001), 635–642. https://doi.org/10.1038/35090055",
      "doi": ""
    },
    {
      "text": "George Lakoff. 1993. The contemporary theory of metaphor. In Metaphor and Thought, Andrew Ortony (Ed.). Cambridge University Press, Cambridge, 202–251.",
      "doi": ""
    },
    {
      "text": "George Lakoff and Mark Johnson. 1999. The embodied mind. In Philosophy in the flesh: Embodied mind and its challenges to Western thought. New York, Basic Books, 16–41.",
      "doi": ""
    },
    {
      "text": "Ronald W. Langacker and George Lakoff. 1988. Women, Fire, and Dangerous Things: What Categories Reveal about the Mind. Language 64, 2 (June 1988), 384. https://doi.org/10.2307/415440",
      "doi": ""
    },
    {
      "text": "William Langston. 2002. Violating Orientational Metaphors Slows Reading. Discourse Processes 34, 3 (Nov. 2002), 281–310. https://doi.org/10.1207/s15326950dp3403_3",
      "doi": ""
    },
    {
      "text": "Astrid Twenebowa Larssen, Toni Robertson, and Jenny Edwards. 2007. The Feel Dimension of Technology Interaction: Exploring Tangibles through Movement and Touch. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (Baton Rouge, Louisiana) (TEI ’07). Association for Computing Machinery, New York, NY, USA, 271–278. https://doi.org/10.1145/1226969.1227024",
      "doi": "10.1145/1226969.1227024"
    },
    {
      "text": "Paul Marshall, Rowanne Fleck, Amanda Harris, Jochen Rick, Eva Hornecker, Yvonne Rogers, Nicola Yuill, and Nick Sheep Dalton. 2009. Fighting for Control: Children’s Embodied Interactions When Using Physical and Digital Representations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 2149–2152. https://doi.org/10.1145/1518701.1519027",
      "doi": "10.1145/1518701.1519027"
    },
    {
      "text": "Maurice Merleau-Ponty. 2014. Phenomenology of perception. Routledge.",
      "doi": ""
    },
    {
      "text": "Richard Miller. 1996. Imagery and the Teaching of Singing. In On the Art of Singing. Oxford University Press, Oxford, Chapter 1, 3–5. https://doi.org/10.1093/acprof:osobl/9780195098259.001.0001",
      "doi": ""
    },
    {
      "text": "Florian Floyd Mueller, Pedro Lopes, Paul Strohmeier, Wendy Ju, Caitlyn Seim, Martin Weigel, Suranga Nanayakkara, Marianna Obrist, Zhuying Li, Joseph Delfa, Jun Nishida, Elizabeth M. Gerber, Dag Svanaes, Jonathan Grudin, Stefan Greuter, Kai Kunze, Thomas Erickson, Steven Greenspan, Masahiko Inami, Joe Marshall, Harald Reiterer, Katrin Wolf, Jochen Meyer, Thecla Schiphorst, Dakuo Wang, and Pattie Maes. 2020. Next Steps for Human-Computer Integration. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376242",
      "doi": "10.1145/3313831.3376242"
    },
    {
      "text": "Keith V. Nesbitt. 2006. Modelling Human Perception to Leverage the Reuse of Concepts across the Multi-Sensory Design Space. In Proceedings of the 3rd Asia-Pacific Conference on Conceptual Modelling - Volume 53 (Hobart, Australia) (APCCM ’06). Australian Computer Society, Inc., AUS, 65–74.",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical Design in HCI Research: Designing and Learning through Use-It-Yourself. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 514–523. https://doi.org/10.1145/2317956.2318034",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Claudia Núñez Pacheco. 2021. Tangible Body Maps of Felt-Sensing Experience. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (Salzburg, Austria) (TEI ’21). Association for Computing Machinery, New York, NY, USA, Article 65, 3 pages. https://doi.org/10.1145/3430524.3442700",
      "doi": "10.1145/3430524.3442700"
    },
    {
      "text": "Claudia Núñez Pacheco and Lian Loke. 2016. Felt-Sensing Archetypes: Analysing Patterns of Accessing Tacit Meaning in Design. In Proceedings of the 28th Australian Conference on Computer-Human Interaction(Launceston, Tasmania, Australia) (OzCHI ’16). Association for Computing Machinery, New York, NY, USA, 462–471. https://doi.org/10.1145/3010915.3010932",
      "doi": "10.1145/3010915.3010932"
    },
    {
      "text": "Claudia Núñez-Pacheco and Lian Loke. 2020. Getting Into Someone Else’s Soul: Communicating Embodied Experience. Journal of Digital Creativity 31 (2020). Issue 4.",
      "doi": ""
    },
    {
      "text": "Dora Ohrenstein. 2003. Insights into training aural and kinaesthetic awareness. The National Association of Teachers of Singing Journal 60, 1(2003), 29–35.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbæk. 2022. Counterfactual Thinking: What Theories Do in Design. International Journal of Human–Computer Interaction 38, 1(2022), 78–92. https://doi.org/10.1080/10447318.2021.1925436 arXiv:https://doi.org/10.1080/10447318.2021.1925436",
      "doi": ""
    },
    {
      "text": "Mirjana Prpa, Sarah Fdili-Alaoui, Thecla Schiphorst, and Philippe Pasquier. 2020. Articulating Experience: Reflections from Experts Applying Micro-Phenomenology to Design Research in HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376664",
      "doi": "10.1145/3313831.3376664"
    },
    {
      "text": "2016 1:15 pm UTC Ron Amadeo Oct 31. 2016. The (updated) history of Android. https://arstechnica.com/gadgets/2016/10/building-android-a-40000-word-history-of-googles-mobile-os/",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst. 2011. Self-Evidence: Applying Somatic Connoisseurship to Experience Design. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 145–160. https://doi.org/10.1145/1979742.1979640",
      "doi": "10.1145/1979742.1979640"
    },
    {
      "text": "Ben Shneiderman and Pattie Maes. 1997. Direct Manipulation vs. Interface Agents. Interactions 4, 6 (1997), 42–61. https://doi.org/10.1145/267505.267514",
      "doi": "10.1145/267505.267514"
    },
    {
      "text": "Richard Shusterman. 2008. Body Consciousness: A Philosophy of Mindfulness and Somaesthetics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "David C. Smith, Frank E. Ludolph, Charles H. Irby, and Jeff A. Johnson. 1985. The Desktop Metaphor as an Approach to User Interface Design (Panel Discussion). In Proceedings of the 1985 ACM Annual Conference on The Range of Computing: Mid-80’s Perspective (Denver, Colorado, USA) (ACM ’85). Association for Computing Machinery, New York, NY, USA, 548–549. https://doi.org/10.1145/320435.320594",
      "doi": "10.1145/320435.320594"
    },
    {
      "text": "Thomas Smith, Simon J. Bowen, Bettina Nissen, Jonathan Hook, Arno Verhoeven, John Bowers, Peter Wright, and Patrick Olivier. 2015. Exploring Gesture Sonification to Support Reflective Craft Practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 67–76. https://doi.org/10.1145/2702123.2702497",
      "doi": "10.1145/2702123.2702497"
    },
    {
      "text": "Katta Spiel. 2019. The Bodies of TEI – Investigating Norms and Assumptions in the Design of Embodied Interaction. In Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’21), February 14–17, 2021, Salzburg, Austria. ACM, New York, NY, USA, 1–19. https://doi.org/10.1145/3430524.3440651",
      "doi": "10.1145/3430524.3440651"
    },
    {
      "text": "Anna Ståhl, Vasiliki Tsaknaki, and Madeline Balaam. 2021. Validity and Rigour in Soma Design-Sketching with the Soma. ACM Trans. Comput.-Hum. Interact. 28, 6, Article 38 (dec 2021), 36 pages. https://doi.org/10.1145/3470132",
      "doi": "10.1145/3470132"
    },
    {
      "text": "Paul Strohmeier and Kasper Hornbæk. 2017. Generating Haptic Textures with a Vibrotactile Actuator. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4994–5005. https://doi.org/10.1145/3025453.3025812",
      "doi": "10.1145/3025453.3025812"
    },
    {
      "text": "Ivan E. Sutherland. 1963. Sketchpad: A Man-Machine Graphical Communication System. Ph. D. Dissertation. Massachusetts Institute of Technology.",
      "doi": "10.1145/1461551.1461591"
    },
    {
      "text": "Dag Svanæs. 1997. Kinaesthetic thinking: The tacit dimension of interaction design. Computers in Human Behavior 13, 4 (1997), 443–463.",
      "doi": ""
    },
    {
      "text": "Dag Svanæs. 2013. Interaction Design for and with the Lived Body: Some Implications of Merleau-Ponty’s Phenomenology. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 8 (apr 2013), 30 pages. https://doi.org/10.1145/2442106.2442114",
      "doi": "10.1145/2442106.2442114"
    },
    {
      "text": "Dag Svanæs. 2019. Phenomenology through Design: A Tale of a Human Tail. In Proceedings of CHI’19 Extended Abstracts, Glasgow, Scotland, UK 19 (May 2019), 4–9.",
      "doi": ""
    },
    {
      "text": "Dag Svanaes and Martin Solheim. 2016. Wag Your Tail and Flap Your Ears: The Kinesthetic User Experience of Extending Your Body. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 3778–3779. https://doi.org/10.1145/2851581.2890268",
      "doi": "10.1145/2851581.2890268"
    },
    {
      "text": "Paul Tennent, Kristina Höök, Steve Benford, Vasiliki Tsaknaki, Anna Ståhl, Claudia Dauden Roquet, Charles Windlin, Pedro Sanches, Joe Marshall, Christine Li, Juan Pablo Martinez Avila, Miquel Alfaras, Muhammad Umair, and Feng Zhou. 2021. Articulating Soma Experiences Using Trajectories. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 268, 16 pages. https://doi.org/10.1145/3411764.3445482",
      "doi": "10.1145/3411764.3445482"
    },
    {
      "text": "Jakob Tholander, Klas Karlgren, Robert Ramberg, and Per Sökjer. 2008. Where All the Interaction is: Sketching in Interaction Design as an Embodied Practice. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (Cape Town, South Africa) (DIS ’08). Association for Computing Machinery, New York, NY, USA, 445–454. https://doi.org/10.1145/1394445.1394493",
      "doi": "10.1145/1394445.1394493"
    },
    {
      "text": "Evan Thompson and Francisco J. Varela. 2001. Radical embodiment: Neural dynamics and consciousness. Trends in Cognitive Sciences 5, 10 (2001), 418–425. https://doi.org/10.1016/S1364-6613(00)01750-2",
      "doi": ""
    },
    {
      "text": "Lisa R. Trainor and Andrea Bundon. 2020. Developing the craft: reflexive accounts of doing reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 13, 5 (Nov. 2020), 705–726. https://doi.org/10.1080/2159676x.2020.1840423",
      "doi": ""
    },
    {
      "text": "Akria Utsumi. 2005. The Role of Feature Emergence in Metaphor Appreciation. Metaphor and Symbol 20, 3 (May 2005), 151–172. https://doi.org/10.1207/s15327868ms2003_1",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2005. What Things Do: Philosophical Reflections on Technology, Agency, and Design. Penn State University Press.",
      "doi": ""
    },
    {
      "text": "Fred A. Voorhorst, Helmut Krueger, and Martin Bichsel. 2000. Menus beyond the Desktop Metaphor. In CHI ’00 Extended Abstracts on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI EA ’00). Association for Computing Machinery, New York, NY, USA, 271–272. https://doi.org/10.1145/633292.633450",
      "doi": "10.1145/633292.633450"
    },
    {
      "text": "Ron Wakkary, Doenja Oogjes, Henry W. J. Lin, and Sabrina Hauser. 2018. Philosophers Living with the Tilting Bowl. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173668",
      "doi": "10.1145/3173574.3173668"
    },
    {
      "text": "David Whetten. 1989. What Constitutes A Theoretical Contribution?Academy of Management Review 14 (10 1989), 490–495. https://doi.org/10.2307/258554",
      "doi": ""
    },
    {
      "text": "Sarah E. Williams, Jennifer Cumming, Nikos Ntoumanis, Sanna M. Nordin-Bates, Richard Ramsey, and Craig Hall. 2012. Further validation and development of the Movement Imagery Questionnaire. Journal of Sport & Exercise Psychology 34 (2012), 621–646. https://doi.org/10.1123/jsep.34.5.621",
      "doi": ""
    },
    {
      "text": "Robert A. Wilson and Frank Keil. 1998. The shadows and shallows of explanation. Minds and Machines 8, 1 (1998), 137–159.",
      "doi": "10.1023/A%3A1008259020140"
    },
    {
      "text": "Jordan Wirfs-Brock, Alli Fam, Laura Devendorf, and Brian Keegan. 2021. Examining Narrative Sonification: Using First-Person Retrospection Methods to Translate Radio Production to Interaction Design. ACM Trans. Comput.-Hum. Interact. 28, 6, Article 41 (nov 2021), 34 pages. https://doi.org/10.1145/3461762",
      "doi": "10.1145/3461762"
    },
    {
      "text": "Jordan Wirfs-Brock, Maxene Graze, Laura Devendorf, Audrey Desjardins, Visda Goudarzi, Mikhaila Friske, and Brian C Keegan. 2022. Sketching Across the Senses: Exploring Sensory Translation as a Generative Practice for Designing Data Representations. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 92, 7 pages. https://doi.org/10.1145/3491101.3503712",
      "doi": "10.1145/3491101.3503712"
    },
    {
      "text": "Jack Zhao and Andrew Vande Moere. 2008. Embodiment in Data Sculpture: A Model of the Physical Visualization of Information. In Proceedings of the 3rd International Conference on Digital Interactive Media in Entertainment and Arts (Athens, Greece) (DIMEA ’08). Association for Computing Machinery, New York, NY, USA, 343–350. https://doi.org/10.1145/1413634.1413696",
      "doi": "10.1145/1413634.1413696"
    }
  ]
}