{
  "doi": "10.1145/3544548.3581112",
  "title": "Cognition-oriented Facilitation and Guidelines for Collaborative Problem-solving Online and Face-to-face: An in-depth examination of format and facilitation influence on problem-solving performance",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "During the Covid-19 pandemic, more guidelines were created to teach people how to facilitate meetings online, but few were designed from a cognition-oriented perspective. Additionally, solving complex problems is essential in many occupations. However, the influence of online and face-to-face discussion formats on the performance in complex problem-solving tasks is unclear, even though remote working has become common over the past several few years. Hence, this study aims to answer two research questions: (a) Does problem-solving performance differ between online and face-to-face meetings? and (b) Does facilitation improve problem-solving performance when different formats are used? We conducted experiments with 40 groups using a 2 × 2 factorial design, which were controlled for both facilitation and format. Each group comprised two randomly selected participants, and each problem-solving discussion lasted between 1.5–2 h. The obtained evidence showed that format can influence the performance of balancing intercorrelated factors in a complex scenario, but it does not affect the performance of achieving a predefined goal. Instead, it we found that facilitation is helpful for achieving a predefined goal. Based on the results obtained, we propose future design directions for problem-solving centric computer-supported cooperative work systems from a cognition-oriented perspective.",
  "authors": [
    {
      "name": "Yingting Chen",
      "institution": "Dept. of Systems Innovation, School of Engineering, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780435",
      "orcid": "0000-0002-0907-7317"
    },
    {
      "name": "Taro Kanno",
      "institution": "Dept. of Systems Innovation, School of Engineering, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100456230",
      "orcid": "0000-0002-4214-7495"
    },
    {
      "name": "Kazuo Furuta",
      "institution": "Resilience Engineering Center, School of Engineering, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100038608",
      "orcid": "0000-0001-9180-9822"
    }
  ],
  "references": [
    {
      "text": "Tracy, B. 2016. Meetings That Get Results (The Brian Tracy Success Library). American Management Association.",
      "doi": ""
    },
    {
      "text": "Caglar, D. 2021. It's time to reimagine where and how work will get done.",
      "doi": ""
    },
    {
      "text": "Kostiviarová, Z. 2021. HYBRID WORK SURVEY.",
      "doi": ""
    },
    {
      "text": "Chew, D., Azizi, M., 2022. The State of Video Conferencing 2022.",
      "doi": ""
    },
    {
      "text": "Survey report: online facilitation and virtual meetings: 2021. https://www.sessionlab.com/blog/online-facilitation-survey-report/. Accessed: 2022-12-07.",
      "doi": ""
    },
    {
      "text": "Allison, B.B. 2015. The Successful Facilitation of Virtual Team Meetings. The Cambridge Handbook of Meeting Science. J.A. Allen , eds. Cambridge University Press. 680–706.",
      "doi": ""
    },
    {
      "text": "Vreede, G.-J. de 2006. ThinkLets: A Collaboration Engineering Pattern Language. Int. J. Comput. Appl. Technol. 25, 2/3 (Feb. 2006), 140–154. DOI:https://doi.org/10.1504/IJCAT.2006.009064.",
      "doi": "10.1504/IJCAT.2006.009064"
    },
    {
      "text": "Hontvedt, M. and Øvergård, K.I. 2020. Simulations at Work —a Framework for Configuring Simulation Fidelity with Training Objectives. Computer Supported Cooperative Work: CSCW: An International Journal. 29, 1–2 (2020), 85–113. DOI:https://doi.org/10.1007/s10606-019-09367-8.",
      "doi": "10.1007/s10606-019-09367-8"
    },
    {
      "text": "Reichert, U. and Dörner, D. 1988. Heurismen beim Umgang mit einem “einfachen” dynamischen System. [Heuristics of coping with a “simple” dynamic system.]. Sprache & Kognition. Verlag Hans Huber.",
      "doi": ""
    },
    {
      "text": "Schwarz, R. 2015. How to Design an Agenda for an Effective Meeting How to Design an Agenda for an Effective Meeting. (2015), 1–7.",
      "doi": ""
    },
    {
      "text": "Bower, M. 2015. Design and implementation factors in blended synchronous learning environments: Outcomes from a cross-case analysis. Computers & Education. 86, (Aug. 2015), 1–17. DOI:https://doi.org/10.1016/j.compedu.2015.03.006.",
      "doi": "10.1016/j.compedu.2015.03.006"
    },
    {
      "text": "Waller, G. 2020. Cognitive‐behavioral therapy in the time of coronavirus: Clinician tips for working with eating disorders via telehealth when face‐to‐face meetings are not possible. International Journal of Eating Disorders. 53, 7 (Jul. 2020), 1132–1141. DOI:https://doi.org/10.1002/eat.23289.",
      "doi": ""
    },
    {
      "text": "Jung, Y.-W. 2017. Possibilities and Limitations of Online Document Tools for Design Collaboration: The Case of Google Docs. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (New York, NY, USA, 2017), 1096–1108.",
      "doi": "10.1145/2998181.2998297"
    },
    {
      "text": "Karl, K.A. 2021. Virtual Work Meetings During the COVID-19 Pandemic: The Good, Bad, and Ugly. Small Group Research. (May 2021), 10464964211015286. DOI:https://doi.org/10.1177/10464964211015286.",
      "doi": ""
    },
    {
      "text": "Olson, G.M. and Olson, J.S. 2000. Distance Matters. Human–Computer Interaction. 15, 2–3 (Sep. 2000), 139–178. DOI:https://doi.org/10.1207/S15327051HCI1523_4.",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Turhan, C. 2022. Online collaborative tool usage for review meetings in software engineering courses. Interactive Learning Environments. 30, 2 (Feb. 2022), 202–214. DOI:https://doi.org/10.1080/10494820.2019.1651742.",
      "doi": ""
    },
    {
      "text": "van der Kleij, R. 2009. How Conversations Change Over Time in Face-to-Face and Video-Mediated Communication. Small Group Research. 40, 4 (Aug. 2009), 355–381. DOI:https://doi.org/10.1177/1046496409333724.",
      "doi": ""
    },
    {
      "text": "Bailenson, J.N. 2021. Nonverbal Overload: A theoretical argument for the causes of Zoom fatigue. Technology, Mind, and Behavior. 2, 1 (2021). DOI:https://doi.org/10.1037/tmb0000030.",
      "doi": ""
    },
    {
      "text": "Short Williams, Ederyn., Christie, Bruce., John. 1976. The social psychology of telecommunications. Wiley.",
      "doi": ""
    },
    {
      "text": "Lee, J.S. and Tatar, D. 2014. Sounds of Silence: Exploring Contributions to Conversations, Non-Responses and the Impact of Mediating Technologies in Triple Space. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (New York, NY, USA, 2014), 1561–1572.",
      "doi": ""
    },
    {
      "text": "Viller, S. 1991. The Group Facilitator: A CSCW Perspective. Proceedings of the Second European Conference on Computer-Supported Cooperative Work ECSCW ’91. (1991), 81–95. DOI:https://doi.org/10.1007/978-94-011-3506-1_6.",
      "doi": ""
    },
    {
      "text": "de Vreede, G.-J. 2001. Measuring participants’ perception on facilitation in group support systems meetings. Proceedings of the 2001 ACM SIGCPR conference on Computer personnel research - SIGCPR ’01 (New York, New York, USA, 2001), 173–181.",
      "doi": "10.1145/371209.371232"
    },
    {
      "text": "Dahl, Y. and Sharma, K. 2022. Six Facets of Facilitation: Participatory Design Facilitators’ Perspectives on Their Role and Its Realization. CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2022), 1–14.",
      "doi": ""
    },
    {
      "text": "Setyaningtyas, E.W. and Radia, E.H. 2019. Six Thinking Hats Method for Developing Critical Thinking Skills. Journal of Educational Science and Technology (EST). 5, 1 (2019), 82. DOI:https://doi.org/10.26858/est.v5i1.8243.",
      "doi": ""
    },
    {
      "text": "Takouachet, N. 2014. The role of the facilitator during digital creative sessions. Proceedings of the 2014 Ergonomie et Informatique Avancée Conference - Design, Ergonomie et IHM: quelle articulation pour la co-conception de l'interaction on - Ergo'IA ’14 (New York, New York, USA, 2014), 20–23.",
      "doi": "10.1145/2671470.2671473"
    },
    {
      "text": "Hughes, M. and Roy, D. 2020. Keeper: An Online Synchronous Conversation Environment Informed by In-Person Facilitation Practices. Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing (New York, NY, USA, Oct. 2020), 275–279.",
      "doi": "10.1145/3406865.3418344"
    },
    {
      "text": "Wang, H.-C. 2010. Idea expander. Proceedings of the 2010 ACM conference on Computer supported cooperative work - CSCW ’10 (New York, New York, USA, 2010), 103.",
      "doi": "10.1145/1718918.1718938"
    },
    {
      "text": "Jeong, A. 2016. Facilitating Collaborative Problem-Solving with Computer-Supported Causal Mapping. Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion - CSCW ’16 Companion (New York, New York, USA, 2016), 57–60.",
      "doi": "10.1145/2818052.2874324"
    },
    {
      "text": "Wu, S.Y. 2016. Exploring the interactive patterns of concept map-based online discussion: A sequential analysis of users’ operations, cognitive processing, and knowledge construction. Interactive Learning Environments. 24, 8 (2016), 1778–1794. DOI:https://doi.org/10.1080/10494820.2015.1057740.",
      "doi": ""
    },
    {
      "text": "Singley, M.K. 2000. Algebra Jam: Supporting Teamwork and Managing Roles in a Collaborative Learning Environment. Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (New York, NY, USA, 2000), 145–154.",
      "doi": "10.1145/358916.358985"
    },
    {
      "text": "Ackerman, M.S. 2000. The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human–Computer Interaction. 15, 2–3 (Sep. 2000), 179–203. DOI:https://doi.org/10.1207/S15327051HCI1523_5.",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Dörner, D. and Funke, J. 2017. Complex Problem Solving: What It Is and What It Is Not. Frontiers in Psychology. 8, (Jul. 2017). DOI:https://doi.org/10.3389/fpsyg.2017.01153.",
      "doi": ""
    },
    {
      "text": "Kleiter, G.D. 1970. Trend-control in a dynamic decision-making task. (1970), 387–397.",
      "doi": ""
    },
    {
      "text": "Thalmaier, A. 1979. Cognitive solutions for the optimal control of a dynamic system. Zeitschrift für Experimentelle und Angewandte Psychologie. Hogrefe & Huber Publishers.",
      "doi": ""
    },
    {
      "text": "Berry, D.C. and Broadbent, D.E. 1987. The combination of explicit and implicit learning processes in task control. Psychological Research. 49, 1 (1987), 7–15. DOI:https://doi.org/10.1007/BF00309197.",
      "doi": ""
    },
    {
      "text": "Broadbent, D.E. 1986. Implicit and explicit knowledge in the control of complex systems. British Journal of Psychology. 77, 1 (1986), 33–50. DOI:https://doi.org/10.1111/j.2044-8295.1986.tb01979.x.",
      "doi": ""
    },
    {
      "text": "Opwis, K. and Spada, H. 1985. Erwerb und Anwendung von Wissen über ökologische Systeme (Acquisition and application of knowledge about ecological systems). Grundlagenforschung (1985), 258–260.",
      "doi": ""
    },
    {
      "text": "Funke, J. 1985. Steuerung dynamischer Systeme durch Aufbau und Anwendung subjektiver Kausalmodelle. [Control of dynamic systems through development and application of subjective models of causality.]. Zeitschrift für Psychologie mit Zeitschrift für angewandte Psychologie. J.A. Barth Verlag.",
      "doi": ""
    },
    {
      "text": "Hübner, R. 1987. Eine naheliegende Fehleinschätzung des Zielabstandes bei der zeitoptimalen Regelung dynamischer Systeme. Zeitschrift für experimentelle und an gewandte Psychologie. 1 (1987), 38–53.",
      "doi": ""
    },
    {
      "text": "Moray, N. 1986. Acquisition of Process Control Skills. IEEE Transactions on Systems, Man, and Cybernetics. 16, 4 (1986), 497–504. DOI:https://doi.org/10.1109/TSMC.1986.289252.",
      "doi": "10.1109/TSMC.1986.289252"
    },
    {
      "text": "Preußler, W. 1985. Über die Bedingungen der Prognose eines bivariaten ökologischen Systems [On the determinants of the forecast of a bivariate ecologic system]. Memo No. 31 at the chair Psychology II. University of Bamberg.",
      "doi": ""
    },
    {
      "text": "Ackerman, P.L. and Kanfer, R. 1993. Integrating Laboratory and Field Study for Improving Selection: Development of a Battery for Predicting Air Traffic Controller Success. Journal of Applied Psychology. 78, 3 (1993), 413–432. DOI:https://doi.org/10.1037/0021-9010.78.3.413.",
      "doi": ""
    },
    {
      "text": "Mané, A. and Donchin, E. 1989. The space fortress game. Acta Psychologica. 71, 1–3 (1989), 17–22. DOI:https://doi.org/10.1016/0001-6918(89)90003-6.",
      "doi": ""
    },
    {
      "text": "Süß, H.-M. and Kretzschmar, A. 2018. Impact of Cognitive Abilities and Prior Knowledge on Complex Problem Solving Performance – Empirical Results and a Plea for Ecologically Valid Microworlds. Frontiers in Psychology.",
      "doi": ""
    },
    {
      "text": "Wagener, D. and Wittmann, W.W. 2002. Personalarbeit mit dem komplexen Szenario FSYS: Zeitschrift für Personalpsychologie. 1, 2 (Apr. 2002), 80–93. DOI:https://doi.org/10.1026//1617-6391.1.2.80.",
      "doi": ""
    },
    {
      "text": "Wiltshire, T.J. 2018. Problem-Solving Phase Transitions During Team Collaboration. Cognitive Science. 42, 1 (2018), 129–167. DOI:https://doi.org/10.1111/cogs.12482.",
      "doi": ""
    },
    {
      "text": "Chen, Y., Kanno, T., Furuta, K., 2022. Complex Scenario Design for Investigating Cognitive Process for Problem-Solving Collaboration, in: Proceeding of 13th International Conference on Applied Human Factors and Ergonomics (AHFE). Springer, New York. https://doi.org/10.54941/ahfe1002248",
      "doi": ""
    },
    {
      "text": "The Future of Meetings Report 2021 | Meeting Statistics: 2022. https://fellow.app/resources/future-of-meetings-report/. Accessed: 2022-12-07.",
      "doi": ""
    },
    {
      "text": "van Merriënboer, J.J.G. and de Bruin, A.B.H. 2019. Cue-based facilitation of self-regulated learning: A discussion of multidisciplinary innovations and technologies. Computers in Human Behavior. 100, (Nov. 2019), 384–391. DOI:https://doi.org/10.1016/J.CHB.2019.07.021.",
      "doi": "10.1016/J.CHB.2019.07.021"
    },
    {
      "text": "Frensch, P.A. and Funke, J. 1995. Complex Problem Solving: The European Perspective.",
      "doi": ""
    },
    {
      "text": "Chen, Y. 2022. An Empirical Investigation of the Underlying Cognitive Process in Complex Problem Solving. International Journal of Cognitive Informatics and Natural Intelligence. 16, 1 (Jan. 2022), 1–50. DOI:https://doi.org/10.4018/IJCINI.301204.",
      "doi": "10.4018/IJCINI.301204"
    },
    {
      "text": "Koumakhov, R. 2014. Conventionalism, coordination, and mental models: from Poincaré to Simon. Journal of Economic Methodology. 21, 3 (Jul. 2014), 251–272. DOI:https://doi.org/10.1080/1350178X.2014.939688.",
      "doi": ""
    },
    {
      "text": "Kauffeld, S. and Lehmann-Willenbrock, N. 2012. Meetings matter: Effects of team meetings on team and organizational success. Small Group Research. 43, 2 (2012), 130–158. DOI:https://doi.org/10.1177/1046496411429599.",
      "doi": ""
    },
    {
      "text": "Lehmann-Willenbrock, N. 2013. A sequential analysis of procedural meeting communication: How teams facilitate their meetings. Journal of Applied Communication Research. 41, 4 (2013), 365–388. DOI:https://doi.org/10.1080/00909882.2013.844847.",
      "doi": ""
    },
    {
      "text": "Miranda, S.M. and Bostrom, R.P. 1998. Meeting facilitation: Process versus content interventions. Journal of Management Information Systems. 15, 4 (1998), 89–114. DOI:https://doi.org/10.1080/07421222.1999.11518223.",
      "doi": "10.1080/07421222.1999.11518223"
    },
    {
      "text": "Gogus, A. 2012. Bloom's Taxonomy of Learning Objectives BT - Encyclopedia of the Sciences of Learning. N.M. Seel, ed. Springer US. 469–473.",
      "doi": ""
    },
    {
      "text": "Kelly, G.G. and Bostrom, R.P. 1997. A Facilitator's General Model for Managing Socioemotional Issues in Group Support Systems Meeting Environments. Journal of Management Information Systems. 14, 3 (Dec. 1997), 23–44. DOI:https://doi.org/10.1080/07421222.1997.11518173.",
      "doi": "10.1080/07421222.1997.11518173"
    },
    {
      "text": "Bakeman, R. and Quera, V. eds. 2011. Expected Values for Kappa Comparing Two Observers. Sequential Analysis and Observational Methods for the Behavioral Sciences. Cambridge University Press. 165–166.",
      "doi": ""
    },
    {
      "text": "Anderson, A.H. 2006. Achieving Understanding in Face-to-Face and Video-Mediated Multiparty Interactions. Discourse Processes. 41, 3 (May 2006), 251–287. DOI:https://doi.org/10.1207/s15326950dp4103_2.",
      "doi": ""
    }
  ]
}