{
  "doi": "10.1145/3544548.3581157",
  "title": "Measurement Patterns: User-Oriented Strategies for Dealing with Measurements and Dimensions in Making Processes",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "The majority of errors in making processes can be tracked back to errors in dimensional specifications. While technical aspects of measurement, such as precision and speed have been extensively studied in metrology, the user aspects of measurement received significantly less attention. While little research exists that specifically addresses the user aspects of handling dimensions, various systems have been built that embed new interactive modalities, processes, and techniques which significantly impact how users deal with dimensions or conduct measurements. However, these features are mostly hidden in larger system contributions. To uncover and articulate these techniques, we conducted a holistic literature survey on measurement practices in crafting techniques and systems for rapid prototyping. Based on this survey, we contribute  10 measurement patterns, which describe reusable elements and solutions for common difficulties when dealing with dimensions throughout workflows for making physical artifacts.",
  "tags": [
    "Fabrication",
    "Patterns",
    "Measurement",
    "Making"
  ],
  "authors": [
    {
      "name": "Raf Ramakers",
      "institution": "Hasselt University, Flanders Make - Expertise Centre for Digital Media, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549578156",
      "orcid": "0000-0001-6466-0663"
    },
    {
      "name": "Danny Leen",
      "institution": "Hasselt University, Flanders Make - Expertise Centre for Digital Media, Belgium",
      "img": "/do/10.1145/contrib-99659213623/rel-imgonly/99659213623.jpg",
      "acmid": "99659213623",
      "orcid": "0000-0002-0429-6537"
    },
    {
      "name": "Jeeeun Kim",
      "institution": "Computer Science & Engineering, Texas A&M University, United States",
      "img": "/do/10.1145/contrib-87959397157/rel-imgonly/me_2020.jpeg",
      "acmid": "87959397157",
      "orcid": "0000-0002-8915-481X"
    },
    {
      "name": "Kris Luyten",
      "institution": "Expertise Centre for Digital Media, Hasselt University - Flanders Make, Belgium",
      "img": "/do/10.1145/contrib-81309493252/rel-imgonly/luyten_k.png",
      "acmid": "81309493252",
      "orcid": "0000-0002-4194-1101"
    },
    {
      "name": "Steven Houben",
      "institution": "Eindhoven University of Technology, Netherlands",
      "img": "/do/10.1145/contrib-81502746220/rel-imgonly/steven.jpg",
      "acmid": "81502746220",
      "orcid": "0000-0002-9009-5706"
    },
    {
      "name": "Tom Veuskens",
      "institution": "Hasselt University, Flanders Make - Expertise Centre for Digital Media, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366939",
      "orcid": "0000-0002-0644-3254"
    }
  ],
  "references": [
    {
      "text": "Muhammad Abdullah, Romeo Sommerfeld, Laurenz Seidel, Jonas Noack, Ran Zhang, Thijs Roumen, and Patrick Baudisch. 2021. Roadkill: Nesting Laser-Cut Objects for Fast Assembly. In The 34th Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, 972–984. https://doi.org/10.1145/3472749.3474799",
      "doi": "10.1145/3472749.3474799"
    },
    {
      "text": "Stavros Antifakos, Florian Michahelles, and Bernt Schiele. 2002. Proactive Instructions for Furniture Assembly. In UbiComp 2002: Ubiquitous Computing, Gaetano Borriello and Lars Erik Holmquist (Eds.). Vol. 2498. Springer Berlin Heidelberg, Berlin, Heidelberg, 351–360. https://doi.org/10.1007/3-540-45809-3_27 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "Daniel Ashbrook, Shitao Stan Guo, and Alan Lambie. 2016. Towards Augmented Fabrication: Combining Fabricated and Existing Objects. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 1510–1518. https://doi.org/10.1145/2851581.2892509",
      "doi": "10.1145/2851581.2892509"
    },
    {
      "text": "Charles Babbage. 2018. On the Economy of Machinery and Manufactures: Large Print. CreateSpace Independent Publishing Platform, North Charleston, SC, USA.",
      "doi": ""
    },
    {
      "text": "Bankokscan. 2023. Bankokscan. https://www.bangkokscan.com/what-is-a-3d-scanner-and-can-you-use-it-to-scan-paper Accessed: 2023-02-26.",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2017. Personal Fabrication. Foundations and Trends® in Human–Computer Interaction 10, 3–4(2017), 165–293. https://doi.org/10.1561/1100000055",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch, Thijs Roumen, Arthur Silber, Yannis Kommana, Milan Gruner, Ludwig Wall, Kevin Reuss, Lukas Heilman, Robert Kovacs, and Daniel Rechlitz. 2019. Kyub: A 3D Editor for Modeling Sturdy Laser-Cut Objects. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300796",
      "doi": "10.1145/3290605.3300796"
    },
    {
      "text": "Stephanie Bell. 2001. Measurement Good Practice Guide No. 11 (Issue 2). National Physical Laboratory, Teddington, Middlesex,United Kingdom, TW11 0LW.",
      "doi": ""
    },
    {
      "text": "Paulo Blikstein. 2013. Digital fabrication and ‘making’in education: The democratization of invention. FabLabs: Of machines, makers and inventors 4, 1 (2013), 1–21.",
      "doi": ""
    },
    {
      "text": "Petr Brychta, Marek Sadílek, and Josef Brychta. 2016. The Influence of Motor Skills on Measurement Accuracy. Technological Engineering 13, 1 (Oct. 2016), 19–21. https://doi.org/10.2478/teen-2016-0006",
      "doi": ""
    },
    {
      "text": "Francesco Buonamici, Monica Carfagni, Rocco Furferi, Lapo Governi, Alessandro Lapini, and Yary Volpe. 2018. Reverse engineering modeling methods and tools: a survey. Computer-Aided Design and Applications 15, 3 (2018), 443–464. https://doi.org/10.1080/16864360.2017.1397894 arXiv:https://doi.org/10.1080/16864360.2017.1397894",
      "doi": ""
    },
    {
      "text": "Francesco Buonamici, Monica Carfagni, Rocco Furferi, Yary Volpe, and Lapo Governi. 2020. Generative design: an explorative study. Computer-Aided Design and Applications 18, 1 (2020), 144–155.",
      "doi": ""
    },
    {
      "text": "Cadbull. 2023. Augmented Reality Measurements App Free Download APK File. https://cadbull.com/detail/185974/Augmented-Reality-Measurements-App-Free-Download-APK-File Accessed: 2023-02-26.",
      "doi": ""
    },
    {
      "text": "J.M. Carroll. 1998. Measuring, Marking & Layout: A Builder’s Guide. Taunton Press.",
      "doi": ""
    },
    {
      "text": "Centroid. 2023. Part, Vise and Fixture Probing: Automatically Set Zero points fast and accurate.https://www.centroidcnc.com/cnc_probing.html Accessed: 2023-02-26.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: a practical guide through qualitative analysis. Sage Publications, London; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Centroid CNC. 2022. CNC Digitizing for Milling machines,CENTROID Digitizing touch probe reproduces parts that would be impossible any other way.https://www.centroidcnc.com/cnc_digitizing.html",
      "doi": ""
    },
    {
      "text": "Cults3D-Peaberry. 2023. MICRO 9G SERVO ARM EXTENDER. https://cults3d.com/en/3d-model/various/micro-9g-servo-arm-extender Accessed: 2023-02-26.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf and Kimiko Ryokai. 2015. Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 2477–2486. https://doi.org/10.1145/2702123.2702547",
      "doi": "10.1145/2702123.2702547"
    },
    {
      "text": "Markus Eng, Ken Camarata, Ellen Yi-Luen Do, and Mark D Gross. 2006. FlexM: Designing a Physical Construction Kit for 3d Modeling. International Journal of Architectural Computing 4, 2 (June 2006), 27–47. https://doi.org/10.1260/1478-0771.4.2.27",
      "doi": ""
    },
    {
      "text": "David Flack and John Hannaford. 2005. Fundamental Good Practice in Dimensional Metrology. (July 2005), 227.",
      "doi": ""
    },
    {
      "text": "Christoph M. Flath, Sascha Friesike, Marco Wirth, and Frédéric Thiesse. 2017. Copy, Transform, Combine: Exploring the Remix as a Form of Innovation. Journal of Information Technology 32, 4 (Dec. 2017), 306–325. https://doi.org/10.1057/s41265-017-0043-9",
      "doi": ""
    },
    {
      "text": "Sean Follmer and Hiroshi Ishii. 2012. KidCAD: digitally remixing toys through tangible tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2401–2410.",
      "doi": "10.1145/2207676.2208403"
    },
    {
      "text": "Erich Gamma, Richard Helm, Ralph Johnson, and John Vlissides. 1995. Design Patterns: Elements of Reusable Object-Oriented Software. Addison-Wesley Longman Publishing Co., Inc., USA.",
      "doi": "10.5555/186897"
    },
    {
      "text": "Matthew G. Gorbet, Maggie Orth, and Hiroshi Ishii. 1998. Triangles: tangible interface for manipulation and exploration of digital information topography. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI ’98. ACM Press, Los Angeles, California, United States, 49–56. https://doi.org/10.1145/274644.274652",
      "doi": "10.1145/274644.274652"
    },
    {
      "text": "Grib3D. 2022. Grib3D - 3D modeling in AR. https://grib3d.com/",
      "doi": ""
    },
    {
      "text": "Daniel Groeger, Elena Chong Loo, and Jürgen Steimle. 2016. HotFlex: Post-print Customization of 3D Prints Using Embedded State Change. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 420–432. https://doi.org/10.1145/2858036.2858191",
      "doi": "10.1145/2858036.2858191"
    },
    {
      "text": "Ankit Gupta, Dieter Fox, Brian Curless, and Michael Cohen. 2012. DuploTrack: a real-time system for authoring and guiding duplo block assembly. In Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST ’12. ACM Press, Cambridge, Massachusetts, USA, 389. https://doi.org/10.1145/2380116.2380167",
      "doi": "10.1145/2380116.2380167"
    },
    {
      "text": "Family Handyman. 2023. The 100 Handiest Shop Tips. https://www.familyhandyman.com/list/the-100-handiest-shop-tips Accessed: 2023-02-26.",
      "doi": ""
    },
    {
      "text": "Family Handyman. 2023. Measuring Tips and Techniques for DIYers. https://www.familyhandyman.com/list/measuring-tips-and-techniques-for-diyers Accessed: 2023-02-26.",
      "doi": ""
    },
    {
      "text": "Thuong N Hoang, Ross T Smith, and Bruce H Thomas. 2013. Ultrasonic glove input device for distance-based interactions. In 2013 23rd International Conference on Artificial Reality and Telexistence (ICAT). IEEE, 46–53.",
      "doi": ""
    },
    {
      "text": "Yingdan Huang and Michael Eisenberg. 2012. Easigami: virtual creation by physical folding. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction. ACM, Kingston Ontario Canada, 41–48. https://doi.org/10.1145/2148131.2148143",
      "doi": "10.1145/2148131.2148143"
    },
    {
      "text": "Michael D. Jones, Kevin Seppi, and Dan R. Olsen. 2016. What You Sculpt is What You Get: Modeling Physical Interactive Devices with Clay and 3D Printed Widgets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 876–886. https://doi.org/10.1145/2858036.2858493",
      "doi": "10.1145/2858036.2858493"
    },
    {
      "text": "Swarna Keshavabhotla, Blake Williford, Shalini Kumar, Ethan Hilton, Paul Taele, Wayne Li, Julie Linsey, and Tracy Hammond. 2017. Conquering the cube: learning to sketch primitives in perspective with an intelligent tutoring system. In Proceedings of the Symposium on Sketch-Based Interfaces and Modeling. 1–11.",
      "doi": "10.1145/3092907.3092911"
    },
    {
      "text": "Keyence. 2022. Measurement Library KEYENCE. https://www.keyence.eu/ss/products/measure/measurement_library/",
      "doi": ""
    },
    {
      "text": "Keyence. 2022. Selecting a Measurement System | Measurement Fundamentals | KEYENCE America. https://www.keyence.com/ss/products/measure-sys/measurement-selection/select/",
      "doi": ""
    },
    {
      "text": "Jeeeun Kim, Anhong Guo, Tom Yeh, Scott E. Hudson, and Jennifer Mankoff. 2017. Understanding Uncertainty in Measurement and Accommodating its Impact in 3D Modeling and Printing. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, Edinburgh United Kingdom, 1067–1078. https://doi.org/10.1145/3064663.3064690",
      "doi": "10.1145/3064663.3064690"
    },
    {
      "text": "Donghyeon Ko, Jee Bin Yim, Yujin Lee, Jaehoon Pyun, and Woohun Lee. 2021. Designing Metamaterial Cells to Enrich Thermoforming 3D Printed Object for Post-Print Modification. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 671, 12 pages. https://doi.org/10.1145/3411764.3445229",
      "doi": "10.1145/3411764.3445229"
    },
    {
      "text": "Matthew Lakier, Michelle Annett, and Daniel Wigdor. 2018. Automatics: Dynamically Generating Fabrication Tasks to Adapt to Varying Contexts. ACM Trans. Comput.-Hum. Interact. 25, 4, Article 22 (aug 2018), 44 pages. https://doi.org/10.1145/3185065",
      "doi": "10.1145/3185065"
    },
    {
      "text": "Mannu Lambrichts, Raf Ramakers, Steve Hodges, Sven Coppers, and James Devine. 2021. A Survey and Taxonomy of Electronics Toolkits for Interactive and Ubiquitous Device Prototyping. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5, 2, Article 70 (jun 2021), 24 pages. https://doi.org/10.1145/3463523",
      "doi": "10.1145/3463523"
    },
    {
      "text": "Lareo. 2023. Premium Digitale Hoekmeter. https://lareo.nl/products/hoekmeter Accessed: 2023-02-26.",
      "doi": ""
    },
    {
      "text": "Manfred Lau, Masaki Hirose, Akira Ohgawara, Jun Mitani, and Takeo Igarashi. 2012. Situated modeling: a shape-stamping interface with tangible primitives. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction. ACM, Kingston Ontario Canada, 275–282. https://doi.org/10.1145/2148131.2148190",
      "doi": "10.1145/2148131.2148190"
    },
    {
      "text": "Manfred Lau, Greg Saul, Jun Mitani, and Takeo Igarashi. 2010. Modeling-in-Context: User Design of Complementary Objects with a Single Photo. In Proceedings of the Seventh Sketch-Based Interfaces and Modeling Symposium(SBIM ’10). Eurographics Association, Goslar, DEU, 17–24. event-place: Annecy, France.",
      "doi": ""
    },
    {
      "text": "Bokyung Lee, Minjoo Cho, Joonhee Min, and Daniel Saakes. 2016. Posing and Acting as Input for Personalizing Furniture. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction - NordiCHI ’16. ACM Press, Gothenburg, Sweden, 1–10. https://doi.org/10.1145/2971485.2971487",
      "doi": "10.1145/2971485.2971487"
    },
    {
      "text": "Jay Lee, Victor Su, Sandia Ren, and Hiroshi Ishii. 2000. HandSCAPE: a vectorizing tape measure for on-site measuring applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press, The Hague, The Netherlands, 137–144. https://doi.org/10.1145/332040.332417",
      "doi": "10.1145/332040.332417"
    },
    {
      "text": "Danny Leen, Raf Ramakers, and Kris Luyten. 2017. StrutModeling: A Low-Fidelity Construction Kit to Iteratively Model, Test, and Adapt 3D Objects. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, Québec City QC Canada, 471–479. https://doi.org/10.1145/3126594.3126643",
      "doi": "10.1145/3126594.3126643"
    },
    {
      "text": "Danny Leen, Tom Veuskens, Kris Luyten, and Raf Ramakers. 2019. JigFab: Computational Fabrication of Constraints to Facilitate Woodworking with Power Tools. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300386",
      "doi": "10.1145/3290605.3300386"
    },
    {
      "text": "Evolution Marble. 2023. Leaders in Quality Customized Countertops. https://www.evolutionmarble.com Accessed: 2023-02-26.",
      "doi": ""
    },
    {
      "text": "Tom Melcher. 2018. Measuring and Marking Tools For Woodworkers. Woodworkers’ Guild of Georgia, Georgia.",
      "doi": ""
    },
    {
      "text": "W.R. Moore. 1970. Foundations of Mechanical Accuracy. Moore Special Tool Company.",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014. WirePrint: 3D printed previews for fast prototyping. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, Honolulu Hawaii USA, 273–280. https://doi.org/10.1145/2642918.2647359",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive construction: interactive fabrication of functional mechanical devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST ’12. ACM Press, Cambridge, Massachusetts, USA, 599. https://doi.org/10.1145/2380116.2380191",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "David F. Noble. 2011. Forces of production: a social history of industrial automation. Transaction Publishers, New Brunswick, N.J. OCLC: ocn678923644.",
      "doi": ""
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 639–648. https://doi.org/10.1145/2702123.2702175",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "Keunwoo Park, Conrad Lempert, Muhammad Abdullah, Shohei Katakura, Jotaro Shigeyama, Thijs Roumen, and Patrick Baudisch. 2022. FoolProofJoint: Reducing Assembly Errors of Laser Cut 3D Models by Means of Custom Joint Patterns. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 271, 12 pages. https://doi.org/10.1145/3491102.3501919",
      "doi": "10.1145/3491102.3501919"
    },
    {
      "text": "Huaishu Peng, Jimmy Briggs, Cheng-Yao Wang, Kevin Guo, Joseph Kider, Stefanie Mueller, Patrick Baudisch, and François Guimbretière. 2018. RoMA: Interactive Fabrication with Augmented Reality and a Robotic 3D Printer. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3174153",
      "doi": "10.1145/3173574.3174153"
    },
    {
      "text": "N. V Raghavendra and L Krishnamurthy. 2013. Engineering metrology and measurements. Oxford University Press, New Delhi. OCLC: 900768286.",
      "doi": ""
    },
    {
      "text": "Troels A Rasmussen and Timothy Merritt. 2018. ProjecTables: Augmented CNC tools for sustainable creative practices. International Journal of Architectural Computing 16, 3 (Sept. 2018), 227–242. https://doi.org/10.1177/1478077118792356",
      "doi": ""
    },
    {
      "text": "Alec Rivers, Andrew Adams, and Frédo Durand. 2012. Sculpting by numbers. ACM Transactions on Graphics 31, 6 (Nov. 2012), 1–7. https://doi.org/10.1145/2366145.2366176",
      "doi": "10.1145/2366145.2366176"
    },
    {
      "text": "Alec Rivers, Ilan E Moyer, and Fredo Durand. 2012. Position-Correcting Tools for 2D Digital Fabrication. ACM Transactions on Graphics 31, 4 (2012), 7.",
      "doi": "10.1145/2185520.2185584"
    },
    {
      "text": "Thijs Roumen, Ingo Apel, Jotaro Shigeyama, Abdullah Muhammad, and Patrick Baudisch. 2020. Kerf-Canceling Mechanisms: Making Laser-Cut Mechanisms Operate Across Different Laser Cutters. (2020), 11.",
      "doi": ""
    },
    {
      "text": "Thijs Roumen, Jotaro Shigeyama, Julius Cosmo Romeo Rudolph, Felix Grzelka, and Patrick Baudisch. 2019. SpringFit: Joints and Mounts that Fabricate on Any Laser Cutter. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New Orleans LA USA, 727–738. https://doi.org/10.1145/3332165.3347930",
      "doi": "10.1145/3332165.3347930"
    },
    {
      "text": "Thijs Jan Roumen, Willi Müller, and Patrick Baudisch. 2018. Grafter: Remixing 3D-Printed Machines. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3173637",
      "doi": "10.1145/3173574.3173637"
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015. Makers’ Marks: Physical Markup for Designing and Fabricating Functional Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST ’15. ACM Press, Daegu, Kyungpook, Republic of Korea, 103–108. https://doi.org/10.1145/2807442.2807508",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Ryan Schmidt and Karan Singh. 2010. Meshmixer: An Interface for Rapid Mesh Composition. In ACM SIGGRAPH 2010 Talks (Los Angeles, California) (SIGGRAPH ’10). ACM, New York, NY, USA, Article 6, 1 pages. https://doi.org/10.1145/1837026.1837034",
      "doi": "10.1145/1837026.1837034"
    },
    {
      "text": "Eldon Schoop, Michelle Nguyen, Daniel Lim, Valkyrie Savage, Sean Follmer, and Björn Hartmann. 2016. Drill Sergeant: Supporting Physical Construction Projects through an Ecosystem of Augmented Tools. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, San Jose California USA, 1607–1614. https://doi.org/10.1145/2851581.2892429",
      "doi": "10.1145/2851581.2892429"
    },
    {
      "text": "Christian Schüller, Daniele Panozzo, Anselm Grundhöfer, Henning Zimmer, Evgeni Sorkine, and Olga Sorkine-Hornung. 2016. Computational Thermoforming. ACM Transactions on Graphics (Proceedings of ACM SIGGRAPH) 35, 4(2016).",
      "doi": ""
    },
    {
      "text": "Adam Smith. 1776. An Inquiry into the Nature and Causes of the Wealth of Nations. McMaster University Archive for the History of Economic Thought. https://EconPapers.repec.org/RePEc:hay:hetboo:smith1776",
      "doi": ""
    },
    {
      "text": "Evgeny Stemasov, Enrico Rukzio, and Jan Gugenheimer. 2021. The Road to Ubiquitous Personal Fabrication: Modeling-Free Instead of Increasingly Simple. IEEE Pervasive Computing 20, 1 (2021), 19–27. https://doi.org/10.1109/MPRV.2020.3029650",
      "doi": ""
    },
    {
      "text": "Evgeny Stemasov, Tobias Wagner, Jan Gugenheimer, and Enrico Rukzio. 2020. Mix&Match: Towards Omitting Modelling Through In-situ Remixing of Model Repository Artifacts in Mixed Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–12. https://doi.org/10.1145/3313831.3376839",
      "doi": "10.1145/3313831.3376839"
    },
    {
      "text": "Miriam Sturdee and Jason Alexander. 2018. Analysis and Classification of Shape-Changing Interfaces for Design and Application-Based Research. ACM Comput. Surv. 51, 1, Article 2 (jan 2018), 32 pages. https://doi.org/10.1145/3143559",
      "doi": "10.1145/3143559"
    },
    {
      "text": "Lingyun Sun, Yue Yang, Yu Chen, Jiaji Li, Danli Luo, Haolin Liu, Lining Yao, Ye Tao, and Guanyun Wang. 2021. ShrinCage: 4D Printing Accessories that Self-Adapt. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–12. https://doi.org/10.1145/3411764.3445220",
      "doi": "10.1145/3411764.3445220"
    },
    {
      "text": "Ryo Suzuki, Junichi Yamaoka, Daniel Leithinger, Tom Yeh, Mark D. Gross, Yoshihiro Kawahara, and Yasuaki Kakehi. 2018. Dynablock: Dynamic 3D Printing for Instant and Reconstructable Shape Formation. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST ’18. ACM Press, Berlin, Germany, 99–111. https://doi.org/10.1145/3242587.3242659",
      "doi": "10.1145/3242587.3242659"
    },
    {
      "text": "Ryo Suzuki, Clement Zheng, Yasuaki Kakehi, Tom Yeh, Ellen Yi-Luen Do, Mark D. Gross, and Daniel Leithinger. 2019. ShapeBots: Shape-changing Swarm Robots. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New Orleans LA USA, 493–505. https://doi.org/10.1145/3332165.3347911",
      "doi": "10.1145/3332165.3347911"
    },
    {
      "text": "C. S. Syan and K. G. Swift. 1994. Design for assembly. In Concurrent Engineering: Concepts, implementation and practice, Chanan S. Syan and Unny Menon (Eds.). Springer Netherlands, Dordrecht, 117–136. https://doi.org/10.1007/978-94-011-1298-7_7",
      "doi": ""
    },
    {
      "text": "Haruki Takahashi and Jeeeun Kim. 2019. 3D Pen + 3D Printer: Exploring the Role of Humans and Fabrication Machines in Creative Making. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300525",
      "doi": "10.1145/3290605.3300525"
    },
    {
      "text": "Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching Physical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 83–91. https://doi.org/10.1145/2807442.2807467",
      "doi": "10.1145/2807442.2807467"
    },
    {
      "text": "Rundong Tian and Eric Paulos. 2021. Adroid: Augmenting Hands-on Making with a Collaborative Robot. Association for Computing Machinery, New York, NY, USA, 270–281. https://doi.org/10.1145/3472749.3474749",
      "doi": "10.1145/3472749.3474749"
    },
    {
      "text": "Jenifer Tidwell. 2005. Designing Interfaces. O’Reilly Media, Inc.",
      "doi": "10.5555/1965339"
    },
    {
      "text": "Jim Tolpin. 2007. Measure twice, cut once. Popular Woodworking Books, Cincinnati, Ohio. OCLC: ocm76828935.",
      "doi": ""
    },
    {
      "text": "Cesar Torres, Wilmot Li, and Eric Paulos. 2016. ProxyPrint: Supporting Crafting Practice through Physical Computational Proxies. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, Brisbane QLD Australia, 158–169. https://doi.org/10.1145/2901790.2901828",
      "doi": "10.1145/2901790.2901828"
    },
    {
      "text": "Pavlina Toteva, Dimka Vasileva, and Nadezhda Mihaylova. 2014. Methods for Selection of Measuring Instruments. Applied Mechanics and Materials 657 (Oct. 2014), 1006–1010. https://doi.org/10.4028/www.scientific.net/AMM.657.1006",
      "doi": ""
    },
    {
      "text": "Unfold. 2010. l’Artisan Électronique. http://unfold.be/pages/l-artisan-electronique.html",
      "doi": ""
    },
    {
      "text": "Unfold. 2015. Of Instruments and Archetypes. http://unfold.be/pages/of-instruments-and-archetypes.html",
      "doi": ""
    },
    {
      "text": "Tom Valkeneers, Danny Leen, Daniel Ashbrook, and Raf Ramakers. 2019. StackMold: Rapid Prototyping of Functional Multi-Material Objects with Selective Levels of Surface Details. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New Orleans LA USA, 687–699. https://doi.org/10.1145/3332165.3347915",
      "doi": "10.1145/3332165.3347915"
    },
    {
      "text": "Hitesh D. Vora and Subrata Sanyal. 2020. A comprehensive review: metrology in additive manufacturing and 3D printing technology. Progress in Additive Manufacturing 5, 4 (Dec. 2020), 319–353. https://doi.org/10.1007/s40964-020-00142-6",
      "doi": ""
    },
    {
      "text": "Geoff Walsham. 2006. Doing interpretive research. European journal of information systems 15, 3 (2006), 320–330.",
      "doi": ""
    },
    {
      "text": "Christian Weichel, Jason Alexander, Abhijit Karnik, and Hans Gellersen. 2015. SPATA: Spatio-Tangible Tools for Fabrication-Aware Design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI ’14. ACM Press, Stanford, California, USA, 189–196. https://doi.org/10.1145/2677199.2680576",
      "doi": "10.1145/2677199.2680576"
    },
    {
      "text": "Christian Weichel, John Hardy, Jason Alexander, and Hans Gellersen. 2015. ReForm: Integrating Physical and Digital Design through Bidirectional Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST ’15. ACM Press, Daegu, Kyungpook, Republic of Korea, 93–102. https://doi.org/10.1145/2807442.2807451",
      "doi": "10.1145/2807442.2807451"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: a mixed-reality environment for personal fabrication. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, Toronto, Ontario, Canada, 3855–3864. https://doi.org/10.1145/2556288.2557090",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Michael Philetus Weller, Ellen Yi-Luen Do, and Mark D Gross. 2008. Posey: instrumenting a poseable hub and strut construction toy. In Proceedings of the 2nd international conference on Tangible and embedded interaction - TEI ’08. ACM Press, Bonn, Germany, 39. https://doi.org/10.1145/1347390.1347402",
      "doi": "10.1145/1347390.1347402"
    },
    {
      "text": "Michael Wessely, Theophanis Tsandilas, and Wendy E. Mackay. 2018. Shape-Aware Material: Interactive Fabrication with ShapeMe. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST ’18. ACM Press, Berlin, Germany, 127–139. https://doi.org/10.1145/3242587.3242619",
      "doi": "10.1145/3242587.3242619"
    },
    {
      "text": "Kristoffer Winge, Rune Haugaard, and Tim Merritt. 2014. VAL: Visually Augmented Laser cutting to enhance and support creativity. In 2014 IEEE International Symposium on Mixed and Augmented Reality - Media, Art, Social Science, Humanities and Design (ISMAR-MASH’D). 31–34. https://doi.org/10.1109/ISMAR-AMH.2014.6935435",
      "doi": ""
    },
    {
      "text": "Chenming Wu, Haisen Zhao, Chandrakana Nandi, Jeffrey I. Lipton, Zachary Tatlock, and Adriana Schulz. 2019. Carpentry compiler. ACM Transactions on Graphics 38, 6 (Nov. 2019), 1–14. https://doi.org/10.1145/3355089.3356518",
      "doi": "10.1145/3355089.3356518"
    },
    {
      "text": "Haijun Xia, Bruno Araujo, Tovi Grossman, and Daniel Wigdor. 2016. Object-Oriented Drawing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4610–4621. https://doi.org/10.1145/2858036.2858075",
      "doi": "10.1145/2858036.2858075"
    },
    {
      "text": "Xue Yu, Stephen DiVerdi, Akshay Sharma, and Yotam Gingold. 2021. ScaffoldSketch: Accurate Industrial Design Drawing in VR. In Proceedings of ACM Symposium on User Interface Software and Technology(UIST).",
      "doi": "10.1145/3472749.3474756"
    },
    {
      "text": "Amit Zoran and Joseph A. Paradiso. 2013. FreeD: a freehand digital sculpting tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13. ACM Press, Paris, France, 2613. https://doi.org/10.1145/2470654.2481361",
      "doi": "10.1145/2470654.2481361"
    }
  ]
}