{
  "doi": "10.1145/3544548.3581031",
  "title": "Designing structural participation in an interactive film on mental health",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "The practice of interactive documentary can provide participatory opportunities thanks to its capacity for making space for audiences to leave their marks in a film. However, participants’ inclusion has often been limited to an a-posteriori contribution of materials rather than a structural involvement in the film design. What happens when we treat participants as authors and let them imagine and design their own interactive film? This paper explores how design processes from participatory filmmaking can be adapted to achieve this goal by presenting the design process that led to the production of an interactive participatory film on mental health, Stepping Through Interactive. Five participants with lived experience of mental health problems explored, designed, and produced a non-linear film form to effectively represent their personal accounts of mental health. We review the challenges faced and the strategies deployed in the design process in view of supporting similar forms of production in other contexts.",
  "authors": [
    {
      "name": "Simona Manni",
      "institution": "Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom and Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659432319",
      "orcid": "0000-0002-8015-8136"
    },
    {
      "name": "Marian F Ursu",
      "institution": "Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343507220",
      "orcid": "0000-0002-5567-3275"
    },
    {
      "name": "John Gray",
      "institution": "Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom and Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659542081",
      "orcid": "0000-0002-9807-1135"
    },
    {
      "name": "Migle Markeviciute",
      "institution": "School of Arts and Creative Technologies, University of York, United Kingdom and School of Arts and Creative Technologies, University of York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780459",
      "orcid": "0000-0002-7803-2489"
    },
    {
      "name": "Andrew Walter",
      "institution": "Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom and Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781879",
      "orcid": "0000-0003-2718-0016"
    },
    {
      "name": "Jonathan Hook",
      "institution": "Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom and Digital Creativity Labs, School of Arts and Creative Technologies, University of York, United Kingdom",
      "img": "/do/10.1145/contrib-81416594009/rel-imgonly/jonhook_florence.jpg",
      "acmid": "81416594009",
      "orcid": "0000-0002-0588-7013"
    }
  ],
  "references": [
    {
      "text": "Arnold, J. (2012). ‘Practice Led Research: Creative Activity, Academic Debate, and Intellectual Rigour’, Higher Education Studies, 2(2), pp. 9–24. doi: 10.5539/hes.v2n2p9.",
      "doi": ""
    },
    {
      "text": "Aston, J. and Gaudenzi S. (2012). “Interactive documentary: setting the field”. Stud Doc Film, 6(2):125- 139",
      "doi": ""
    },
    {
      "text": "Aston, J. and Odorico, S. (2018). ‘The poetics and politics of polyphony: towards a research method for interactive documentary’, Alphaville: Journal of Film and Screen Media, (15), pp. 63–93.",
      "doi": ""
    },
    {
      "text": "Birch, M. (2012). Mediating Mental Health. Contexts, Debates, and Analysis, Routledge. Buchanan,",
      "doi": ""
    },
    {
      "text": "Buchanan, A. and Murray, M. (2012). ‘Using participatory video to challenge the stigma of mental illness: A case study’, International Journal of Mental Health Promotion, 14(1), pp. 35–43. doi: 10.1080/14623730.2012.673894.",
      "doi": ""
    },
    {
      "text": "Chowdhury, A. H., Odame, H. H. and Hauser, M. (2010). ‘With or without a script? Comparing two styles of participatory video on enhancing local seed innovation system in Bangladesh’, Journal of Agricultural Education and Extension, 16(4), pp. 355–371. doi: 10.1080/1389224X.2010.515056.",
      "doi": ""
    },
    {
      "text": "Clarke, R. (2014) ‘Socially engaged arts practice in HCI’, Conference on Human Factors in Computing Systems - Proceedings, pp. 69–72. doi: 10.1145/2559206.2559227.",
      "doi": "10.1145/2559206.2559227"
    },
    {
      "text": "Concannon, S., Rajan, N., Shah, P., Smith, D., Ursu, M. and Hook, J. (2020), April. Brooke leave home: Designing a personalized film to support public engagement with open data. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (pp. 1-14).",
      "doi": "10.1145/3313831.3376462"
    },
    {
      "text": "Corrigan, P.W., Watson, AC. (2003). Factors that explain how policy makers distribute resources to mental health services. Psychiatr. Serv.54: 501–7",
      "doi": ""
    },
    {
      "text": "Corrigan, P.W., Rao, D. (2012). On the self-stigma of mental illness: Stages, disclosure, and strategies for change. Can J Psychiatry. 57(8):464-469. doi:10.1177/070674371205700804.",
      "doi": ""
    },
    {
      "text": "Corrigan, P.W., Bink, A.B., Fokuo, J.K., Schmidt, A. (2015). The public stigma of mental illness means a difference between you and me. Psychiatry Res; 226(1):186-191. doi:10.1016/j.psychres.2014.12.047.",
      "doi": ""
    },
    {
      "text": "Coughlin, S. S., Smith, S. A., Fernandez, M.E. (edited by). (2017). “Handbook of Community- Based Participatory Research”. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Cross, S. (2004). Visualizing Madness: Mental Illness and Public Representation. Telev New Media. 5(3):197-216. doi:10.1177/1527476403254001.",
      "doi": ""
    },
    {
      "text": "Davis, H., Waycott, J., Schleser, M. (2019). Digital storytelling: designing, developing and delivering with diverse communities, Managing complexity and creating innovation through design, 1st ed. / Satu Miettinen, Melanie Sarantou (eds.), Chapter 1, pp. 131-140",
      "doi": ""
    },
    {
      "text": "Dinmore, S. (2014). The real online: database documentary in the knowledge space. Journal of Media Practice, 15(2), pp.123-132.",
      "doi": ""
    },
    {
      "text": "Fisher, J. C., Mistry, J., Pierre, M. A., Yang, H., Harris, A., Hunte, N., Fernandes, D., Bicknell, J. E., & Davies, Z. G. (2021). Using participatory video to share people's experiences of neotropical urban green and blue spaces with decision-makers. Geographical Journal, 187(4), 346–360. https://doi.org/10.1111/geoj.12406",
      "doi": ""
    },
    {
      "text": "Flower, E. and McConville, B. (2009). “Diary of a participatory advocacy film project: Transforming communication initiatives into living campaigns,” Dev. Pract., vol. 19, no. 7, pp. 933–937.",
      "doi": ""
    },
    {
      "text": "Gaudenzi, S. (2013). “The Interactive Documentary as a Living Documentary”. Doc On-Line, (14):9- 31",
      "doi": ""
    },
    {
      "text": "Gifreu Castells, A. (2011). “The Interactive Documentary. Definition Proposal and Basic Features of the New Emerging Genre”. McLuhan Galaxy Conf, 354-3",
      "doi": ""
    },
    {
      "text": "Gifreu-Castells, A. (2014). ‘Mapping trends in interactive non-fiction through the lenses of interactive documentary’, Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 8832, pp. 156–163.",
      "doi": ""
    },
    {
      "text": "Green, D., Bowen, S., Hook, J., Wright, P. (2017). Enabling Polyvocality in Interactive Documentaries through ‘Structural Participation’. In Proc. of CHI ’17, ACM, 6317-6329. doi: 10.1145/3025453.3025606.",
      "doi": "10.1145/3025453.3025606"
    },
    {
      "text": "Green, D., Crivellaro, C. and Tidey, J. (2015). Interactive design documentary as a method for civic engagement. In Proceedings of the ACM international conference on interactive experiences for TV and online video (pp. 161-166).",
      "doi": "10.1145/2745197.2755518"
    },
    {
      "text": "Gustafsson, J. (2017). ‘Single case studies vs. multiple case studies: A comparative study’, Academy of Business, Engineering and Science Halmstad University, Sweden, pp. 1–15.",
      "doi": ""
    },
    {
      "text": "Harper, S. (2005). “Media, Madness and Misrepresentation”. Eur J Commun, 20(4):460-483",
      "doi": ""
    },
    {
      "text": "High, C., Singh, N., Petheram, L. and Nemes, G. (2012). Defining participatory video from practice. Handbook of participatory video, pp.35-48.",
      "doi": ""
    },
    {
      "text": "Hornecker, E. and Buur, J. (2006) ‘Getting a grip on tangible interaction: A framework on physical space and social interaction’, Conference on Human Factors in Computing Systems - Proceedings, 1, pp. 437–446.",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Jacobs, J. (2016) ‘Digital craftsmanship: HCI takes on technology as an expressive medium’, DIS 2016 Companion - Proceedings of the 2016 ACM Conference on Designing Interactive Systems: Fuse, pp. 57–60. doi: 10.1145/2908805.2913018.",
      "doi": "10.1145/2908805.2913018"
    },
    {
      "text": "Keen, S. (2018). ‘The Documentary Designer: A List of Propositions for Interactive Documentary Practice Online’, pp. 49–67.",
      "doi": ""
    },
    {
      "text": "Koenitz, H. (2015). Design approaches for interactive digital narrative. In International Conference on Interactive Digital Storytelling (pp. 50-57). Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Koningstein, M. (2018). ‘Participatory video for two-way communication in research for development’. doi: 10.1177/1476750318762032.",
      "doi": ""
    },
    {
      "text": "Krishnaswamy, A. (2004). “Participatory Research: Strategies and Tools” https://iep.berkeley.edu/community_forestry/Workshops/powerpoints/tools and strategies of PR.pdf",
      "doi": ""
    },
    {
      "text": "Lin, F. L. Y. (2019). ‘Using Thematic Analysis to Facilitate Meaning-Making in Practice-Led Art and Design Research’, International Journal of Art and Design Education, 38(1), pp. 153–167. doi: 10.1111/jade.12177.",
      "doi": ""
    },
    {
      "text": "Literat, I. (2012) .‘The Work of Art in the Age of Mediated Participation’, Internation Journal of Communication, 11, pp. 2962–2984. Available at: http://ijoc.org/index.php/ijoc/article/view/1531.",
      "doi": ""
    },
    {
      "text": "Lunch, N. and Lunch, C. (2006). Insights into participatory video: A handbook for the field. InsightShare.",
      "doi": ""
    },
    {
      "text": "Manni, S., Ursu, M., & Hook, J. (2019, June). Stepping Through Remixed: Exploring the Limits of Linear Video in a Participatory Mental Health Film. In Proceedings of the 2019 ACM International Conference on Interactive Experiences for TV and Online Video (pp. 83-94).",
      "doi": ""
    },
    {
      "text": "Manni, S. (2021). Interactive media and non-linear participatory narratives of mental health, Doctoral Thesis, University of York",
      "doi": ""
    },
    {
      "text": "Miller, L., and Allor, M. (2016). “Choreographies of collaboration: Social engagement in interactive documentaries”. Stud Doc Film, 10(1):53-70.",
      "doi": ""
    },
    {
      "text": "Mitchell, C. and de Lange, N. (2019). Community-Based Participatory Video and Social Action. The SAGE Handbook of Visual Research Methods, p.254.",
      "doi": ""
    },
    {
      "text": "Mistry, J., Bignante, E. and Berardi, A. (2016). ‘Why are we doing it? Exploring participant motivations within a participatory video project’, Area, 48(4), pp. 412–418. doi: 10.1111/area.12105.",
      "doi": ""
    },
    {
      "text": "Mistry, J., & Shaw, J. (2021). Evolving Social and Political Dialogue through Participatory Video Processes. Progress in Development Studies, 21(2), 196–213. https://doi.org/10.1177/14649934211016725",
      "doi": ""
    },
    {
      "text": "Montero Sánchez, D. (2021). Rethinking participatory video in the times of YouTube. Media, Culture and Society, 43(1), 101–116. https://doi.org/10.1177/0163443720948017",
      "doi": ""
    },
    {
      "text": "Nash, K. (2012). “Modes of interactivity: analysing the webdoc”. Media, Cult Soc, 34(2):195-210",
      "doi": ""
    },
    {
      "text": "Nash, K. (2014). ‘What is interactivity for? the social dimension of web-documentary participation’, Continuum. Taylor & Francis, pp. 383–395. doi: 10.1080/10304312.2014.893995.",
      "doi": ""
    },
    {
      "text": "Nash, K. (2021). Interactive Documentary: Theory and Debate. Routledge.",
      "doi": ""
    },
    {
      "text": "O'Reilly, K. (2014). ‘Key Concepts in Ethnography’, Key Concepts in Ethnography, pp. 187–193. doi: 10.4135/9781446268308",
      "doi": ""
    },
    {
      "text": "Parr, H. (2007) ‘Collaborative film-making as process, method and text in mental health research’, Cultural Geographies, 14(1), pp. 114–138. doi: 10.1177/1474474007072822.",
      "doi": ""
    },
    {
      "text": "Perry, M. (2003). Distributed Cognition, HCI Models, Theories, and Frameworks: Toward a Multidisciplinary Science. doi: 10.1016/B978-155860808-5/50008-3.",
      "doi": ""
    },
    {
      "text": "Pryluck, C. (1976). Ultimately we are all outsiders: the ethics of documentary filming. Journal of the University Film Association, 28(1), pp.21-29.",
      "doi": ""
    },
    {
      "text": "Richardson-Ngwenya, P. (2019). ‘Participatory video proposals: A tool for empowering farmer groups in rural innovation processes?’, Journal of Rural Studies. Elsevier, 69(March), pp. 173–185. doi: 10.1016/j.jrurstud.2019.02.022.",
      "doi": ""
    },
    {
      "text": "Rose, D. (1998). Television, madness and community care. J Community Appl Soc Psychol. 8(3):213- 228. doi:10.1002/(SICI)1099-1298(199805/06)8:3<213::AID-CASP449>3.0.CO;2-C.",
      "doi": ""
    },
    {
      "text": "Shaw, J. and Robertson, C. (1997). “Participatory Video. A Practical guide to using video creatively in group development work”. Routledge.",
      "doi": ""
    },
    {
      "text": "Sitter, K. C. (2015). ‘Participatory video analysis in disability research’, Disability and Society. Routledge, 30(6), pp. 910–923. doi: 10.1080/09687599.2015.1057319.",
      "doi": ""
    },
    {
      "text": "Smith, D., Hook, J., Schofield, G., Ursu, M.F., Bartindale, T., Wilkinson, G., Stenton, P. and Brooks, M. (2017). Designing reconfigurable televisual experiences. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (pp. 368-371).",
      "doi": "10.1145/3064857.3064867"
    },
    {
      "text": "Spinuzzi, C. (2005). ‘The Methodology of Participatory Design’, Technical Communication, 52(2), pp. 163–174. doi: 10.1016/j.infsof.2008.09.005.",
      "doi": "10.1016/j.infsof.2008.09.005"
    },
    {
      "text": "Star, S.L. and Griesemer, J.R. (1989). Institutional ecology, translations and boundary objects: Amateurs and professionals in Berkeley's Museum of Vertebrate Zoology, 1907-39. Social studies of science, 19(3), pp.387-420.",
      "doi": ""
    },
    {
      "text": "Thieme, A., Vines, J., Wallace, J., Clarke, R. E., Slovák, P., McCarthy, J., ... & Parker, A. G. G. (2014). Enabling empathy in health and care: Design methods and challenges. In CHI'14 Extended Abstracts on Human Factors in Computing Systems (pp. 139-142).",
      "doi": "10.1145/2559206.2559237"
    },
    {
      "text": "Van der Ham, A. J., Kupper, F., Bodewes, A., & Broerse, J. E. (2013). Stimulating client involvement and client–provider dialog through participatory video: Deliberations on long-term care in a psychiatric hospital. Patient education and counseling, 91(1), 44-49.",
      "doi": ""
    },
    {
      "text": "Vines, J., Clarke, R., Wright, P., McCarthy, J., & Olivier, P. (2013). Configuring participation: on how we involve people in design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 429-438).",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Waycott, J., Davis, H., Warr, D., Edmonds, F., & Taylor, G. (2017). Co-constructing meaning and negotiating participation: Ethical tensions when “giving voice” through digital storytelling. Interacting with Computers, 29(2), 237–247. https://doi.org/10.1093/iwc/iww025",
      "doi": ""
    },
    {
      "text": "Wahl, O.F. (1995). Media madness: Public images of mental illness. New Brunswick, NJ: Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "White, A. S. (2003). “Participatory Video: A Process That Transforms the Self and the Other”, in Participatory Vi>",
      "doi": ""
    },
    {
      "text": "Whitley, R., Sitter, K. C., Adamson, G., & Carmichael, V. (2020). Can participatory video reduce mental illness stigma? Results from a Canadian action-research study of feasibility and impact. BMC psychiatry, 20(1), 1-12.",
      "doi": ""
    },
    {
      "text": "Yelmi, P. and Bayar, T. (2020). ‘Designing an interactive non-linear documentary contributed by public participation: Suburbs of istanbul’, DIS 2020 - Proceedings of the 2020 ACM Designing Interactive Systems Conference, pp. 747–755. doi: 10.1145/3357236.3395504.",
      "doi": "10.1145/3357236.3395504"
    },
    {
      "text": "Zimmerman, J. and Forlizzi, J. (2011). ‘Research through Design: Method for Interaction Design Research in HCI’, Chi 2011, pp. 167–189.",
      "doi": ""
    }
  ]
}