{
  "doi": "10.1145/3544548.3580886",
  "title": "Designing Ocean Vision AI: An Investigation of Community Needs for Imaging-based Ocean Conservation",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Ocean scientists studying diverse organisms and phenomena increasingly rely on imaging devices for their research. These scientists have many tools to collect their data, but few resources for automated analysis. In this paper, we report on discussions with diverse stakeholders to identify community needs and develop a set of functional requirements for the ongoing development of ocean science-specific analysis tools. We conducted 36 in-depth interviews with individuals working in the Blue Economy space, revealing four central issues inhibiting the development of effective imaging analysis monitoring tools for marine science. We also identified twelve user archetypes that will engage with these services. Additionally, we held a workshop with 246 participants from 35 countries centered around FathomNet, a web-based open-source annotated image database for marine research. Findings from these discussions are being used to define the feature set and interface design of Ocean Vision AI, a suite of tools and services to advance observational capabilities of life in the ocean.",
  "tags": [
    "machine learning-enabled interfaces",
    "human-centered design",
    "data portals",
    "citizen science",
    "sustainability",
    "ocean science"
  ],
  "authors": [
    {
      "name": "Alison Crosby",
      "institution": "University of California, Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659916781",
      "orcid": "0000-0002-3610-1319"
    },
    {
      "name": "Eric Coughlin Orenstein",
      "institution": "Monterey Bay Aquarium Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782277",
      "orcid": "0000-0002-9822-6774"
    },
    {
      "name": "Susan E Poulton",
      "institution": "Ocean Discovery League, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780658",
      "orcid": "0000-0002-2514-7100"
    },
    {
      "name": "Katherine L.C. Bell",
      "institution": "Ocean Discovery League, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782378",
      "orcid": "0000-0003-0826-0758"
    },
    {
      "name": "Benjamin Woodward",
      "institution": "CVision AI, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780193",
      "orcid": "0000-0001-9039-3255"
    },
    {
      "name": "Henry Ruhl",
      "institution": "Central and Northern California Ocean Observing System, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660429621",
      "orcid": "0000-0002-3434-9353"
    },
    {
      "name": "Kakani Katija",
      "institution": "Research & Engineering, Monterey Bay Aquarium Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659916622",
      "orcid": "0000-0002-7249-0147"
    },
    {
      "name": "Angus G. Forbes",
      "institution": "Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474644982",
      "orcid": "0000-0002-8700-7795"
    }
  ],
  "references": [
    {
      "text": "Franziska Althaus, Nicole Hill, Renata Ferrari, Luke Edwards, Rachel Przeslawski, Christine H.L. Schönberg, Rick Stuart-Smith, Neville Barrett, Graham Edgar, Colquhoun, 2015. A standardised vocabulary for identifying benthic biota and substrata from underwater imagery: The CATAMI classification scheme. PLOS ONE 10, 10 (2015), 1–18.",
      "doi": ""
    },
    {
      "text": "Diva J. Amon, Randi D. Rotjan, Brian R.C. Kennedy, Gerard Alleng, Rafael Anta, Eriatera Aram, Thera Edwards, Marcia Creary-Ford, Kristina M. Gjerde, Judith Gobin, 2022. My Deep Sea, My Backyard: A pilot study study to build capacity for global deep-ocean exploration and research. Philosophical Transactions of the Royal Society B 377, 1854(2022), 20210121.",
      "doi": ""
    },
    {
      "text": "Ward Appeltans, Shane T. Ahyong, Gary Anderson, Martin V. Angel, Tom Artois, Nicolas Bailly, Roger Bamber, Anthony Barber, Ilse Bartsch, Annalisa Berta, 2012. The magnitude of global marine species diversity. Current Biology 22, 23 (2012), 2189–2202.",
      "doi": ""
    },
    {
      "text": "Oscar Beijbom, Peter J. Edmunds, David I. Kline, B. Greg Mitchell, and David Kriegman. 2012. Automated annotation of coral reef survey images. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 1170–1177.",
      "doi": ""
    },
    {
      "text": "Katherine L.C. Bell and Diva J. Amon. 2022. Toward an equitable deep sea future. In The 2022 Global Deep-Sea Capacity Assessment. Ocean Discovery League. https://deepseacapacity.oceandiscoveryleague.org/pub/2022-equitable-future.",
      "doi": ""
    },
    {
      "text": "Katherine L.C. Bell, Jennifer S. Chow, Alexis Hope, Maud C. Quinzin, Kat A. Cantner, Diva J. Amon, Jessica E. Cramp, Randi D. Rotjan, Lehua Kamalu, Asha de Vos, 2022. Low-cost, deep-sea imaging and analysis tools for deep-sea exploration: A collaborative design study. Frontiers in Marine Science 9 (2022), 873700.",
      "doi": ""
    },
    {
      "text": "Katherine L.C. Bell, Maud C. Quinzin, Susan Poulton, Alexis Hope, and Diva Amon (Eds.). 2022. The 2022 Global Deep-Sea Capacity Assessment. Ocean Discovery League. https://deepseacapacity.oceandiscoveryleague.org.",
      "doi": ""
    },
    {
      "text": "Nathan J. Bennett, Andrés M. Cisneros-Montemayor, Jessica Blythe, Jennifer J. Silver, Gerald Singh, Nathan Andrews, Antonio Calò, Patrick Christie, Antonio Di Franco, Elena M. Finkbeiner, 2019. Towards a sustainable and equitable blue economy. Nature Sustainability 2, 11 (2019), 991–993.",
      "doi": ""
    },
    {
      "text": "Tanya Y. Berger-Wolf, Daniel I. Rubenstein, Charles V. Stewart, Jason A. Holmberg, Jason Parham, and Sreejith Menon. 2017. Wildbook: Crowdsourcing, computer vision, and data science for conservation. arXiv preprint arXiv:1710.08880(2017).",
      "doi": ""
    },
    {
      "text": "Richard T. Bex, Lisa Lundgren, Kent J. Crippen, and Bruce J. MacFadden. 2018. Designing for public participation in paleontology through the development of an app. In Proceedings of the 5th European Conference on Social Media (ECSM). Academic Conferences and publishing limited, 462.",
      "doi": ""
    },
    {
      "text": "Federico Bonetti and Sara Tonelli. 2021. Measuring orthogonal mechanics in linguistic annotation games. Proceedings of the ACM on Human-Computer Interaction 5 (2021), 265–1–16.",
      "doi": "10.1145/3474692"
    },
    {
      "text": "Qimin Chen, Oscar Beijbom, Stephen Chan, Jessica Bouwmeester, and David Kriegman. 2021. A new deep learning engine for CoralNet. In Proceedings of the IEEE/CVF International Conference on Computer Vision. 3693–3702.",
      "doi": ""
    },
    {
      "text": "Hervé Claustre, Kenneth S. Johnson, and Yuichiro Takeshita. 2020. Observing the global ocean with Biogeochemical-Argo. Annual Review of Marine Science 12 (2020), 23–48.",
      "doi": ""
    },
    {
      "text": "Joe Cox, Eun Young Oh, Brooke Simmons, Chris Lintott, Karen Masters, Anita Greenhill, Gary Graham, and Kate Holmes. 2015. Defining and measuring success in online citizen science: A case study of Zooniverse projects. Computing in Science & Engineering 17, 4 (2015), 28–41.",
      "doi": "10.1109/MCSE.2015.65"
    },
    {
      "text": "Matthew Dawkins, Linus Sherrill, Keith Fieldhouse, Anthony Hoogs, Benjamin Richards, David Zhang, Lakshman Prasad, Kresimir Williams, Nathan Lauffenburger, and Gaoang Wang. 2017. An open-source platform for underwater image and video analytics. In Proceedings of the IEEE Winter Conference on Applications of Computer Vision (WACV). 898–906.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Marti Louw, Julina Coupland, and MaryAnn Steiner. 2009. Local issues, local uses: Tools for robotics and sensing in community contexts. In Proceedings of the ACM Conference on Creativity and Cognition. 245–254.",
      "doi": "10.1145/1640233.1640271"
    },
    {
      "text": "Jennifer M. Durden, Timm Schoening, Franziska Althaus, Ariell Friedman, Rafael Garcia, Adrian G. Glover, Jens Greinert, Nancy Jacobsen Stout, Daniel O.B. Jones, and Anne Jordt. 2016. Perspectives in visual imaging for marine biology and ecology: From acquisition to understanding. Oceanography and Marine Biology: An Annual Review 54 (2016), 1–72.",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Ellen, Casey A. Graff, and Mark D. Ohman. 2019. Improving plankton image classification using context metadata. Limnology and Oceanography: Methods 17, 8 (2019), 439–461.",
      "doi": ""
    },
    {
      "text": "Geraldine Fauville, Anna Carolina Muller Queiroz, and Jeremy N. Bailenson. 2020. Virtual reality as a promising tool to promote climate change awareness. Technology and Health(2020), 91–108.",
      "doi": ""
    },
    {
      "text": "Sarah Lou Carolin Giering, Emma Louise Cavan, Sünnje Linnéa Basedow, Nathan Briggs, Adrian B. Burd, Louise J. Darroch, Lionel Guidi, Jean-Olivier Irisson, Morten H. Iversen, Rainer Kiko, 2020. Sinking organic particles in the ocean—Flux estimates from in situ optical devices. Frontiers in Marine Science 6 (2020), 834.",
      "doi": ""
    },
    {
      "text": "Jose Nuno Gomes-Pereira, Vincent Auger, Kolja Beisiegel, Robert Benjamin, Melanie Bergmann, David Bowden, Pal Buhl-Mortensen, Fabio C. De Leo, Gisela Dionísio, Jennifer M. Durden, 2016. Current and future trends in marine image annotation software. Progress in Oceanography 149 (2016), 106–120.",
      "doi": ""
    },
    {
      "text": "Adam T. Greer, John C. Lehrter, Benjamin M. Binder, Aditya R. Nayak, Ranjoy Barua, Ana E. Rice, Jonathan H. Cohen, Malcolm N. McFarland, Alexis Hagemeyer, Nicole D. Stockley, 2020. High-resolution sampling of a broad marine life size spectrum reveals differing size- and composition-based associations with physical oceanographic structure. Frontiers in Marine Science 7 (2020).",
      "doi": ""
    },
    {
      "text": "Steven H. D. Haddock, Lynne M. Christianson, Warren R. Francis, Séverine Martini, Casey W. Dunn, Philip R. Pugh, Claudia E. Mills, Karen J. Osborn, Brad A. Seibel, C. Anela Choy, 2017. Insights into the biodiversity, behavior, and bioluminescence of deep-sea organisms using molecular and maritime technology. Oceanography 30, 4 (2017), 38–47.",
      "doi": ""
    },
    {
      "text": "Dan Hendrycks, Steven Basart, Norman Mu, Saurav Kadavath, Frank Wang, Evan Dorundo, Rahul Desai, Tyler Zhu, Samyak Parajuli, Mike Guo, 2021. The many faces of robustness: A critical analysis of out-of-distribution generalization. In Proceedings of the IEEE/CVF International Conference on Computer Vision. 8340–8349.",
      "doi": ""
    },
    {
      "text": "Yen-Chia Hsu, Paul Dille, Jennifer Cross, Beatrice Dias, Randy Sargent, and Illah Nourbakhsh. 2017. Community-empowered air quality monitoring system. In Proceedings of the CHI Conference on Human Factors in Computing Systems. 1607–1619.",
      "doi": "10.1145/3025453.3025853"
    },
    {
      "text": "Yen-Chia Hsu and Illah Nourbakhsh. 2020. When human-computer interaction meets community citizen science. Commun. ACM 63, 2 (2020), 31–34.",
      "doi": "10.1145/3376892"
    },
    {
      "text": "IDEO.org. 2016. The Field Guide to Human-Centered Design. https://www.designkit.org/resources/1.",
      "doi": ""
    },
    {
      "text": "Kakani Katija, Eric Orenstein, Brian Schlining, Lonny Lundsten, Kevin Barnard, Giovanna Sainz, Oceane Boulais, Megan Cromwell, Erin Butler, Benjamin Woodward, and Katherine L.C. Bell. 2022. FathomNet: A global image database for enabling artificial intelligence in the ocean. Scientific reports 12, 1 (2022), 15914.",
      "doi": ""
    },
    {
      "text": "Kakani Katija, Giancarlo Troni, Joost Daniels, Kelly Lance, Rob E. Sherlock, Alana D. Sherman, and Bruce H. Robison. 2020. Revealing enigmatic mucus structures in the deep sea using DeepPIV. Nature 583(2020), 78–82.",
      "doi": ""
    },
    {
      "text": "Douwe Kiela, Max Bartolo, Yixin Nie, Divyansh Kaushik, Atticus Geiger, Zhengxuan Wu, Bertie Vidgen, Grusha Prasad, Amanpreet Singh, Pratik Ringshia, 2021. Dynabench: Rethinking benchmarking in NLP. arXiv preprint arXiv:2104.14337(2021).",
      "doi": ""
    },
    {
      "text": "Pang Wei Koh, Shiori Sagawa, Henrik Marklund, Sang Michael Xie, Marvin Zhang, Akshay Balsubramani, Weihua Hu, Michihiro Yasunaga, Richard Lanas Phillips, Irena Gao, 2021. Wilds: A benchmark of in-the-wild distribution shifts. In Proceedings of the 38th International Conference on Machine Learning. 5637–5664.",
      "doi": ""
    },
    {
      "text": "Robert E. Kraut and Paul Resnick. 2012. Building Successful Online Communities: Evidence-Based Social Design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Tim Langlois, Jordan Goetze, Todd Bond, Jacquomo Monk, Rene A. Abesamis, Jacob Asher, Neville Barrett, Anthony T.F. Bernard, Phil J. Bouchet, Matthew J. Birt, 2020. A field and video annotation guide for baited remote underwater stereo-video surveys of demersal fish assemblages. Methods in Ecology and Evolution 11, 11 (2020), 1401–1409.",
      "doi": ""
    },
    {
      "text": "Jessica Lehman. 2018. From ships to robots: The social relations of sensing the world ocean. Social Studies of Science 48, 1 (2018), 57–79.",
      "doi": ""
    },
    {
      "text": "Ming-Chaun Li and Chin-Chung Tsai. 2013. Game-based learning in science education: A review of relevant research. Journal of Science Education and Technology 22, 6 (2013), 877–898.",
      "doi": ""
    },
    {
      "text": "Huan Lin, Michael Julian Caley, and Scott A. Sisson. 2022. Estimating global species richness using symbolic data meta-analysis. Ecography 2022, 3 (2022), e05617.",
      "doi": ""
    },
    {
      "text": "Fabien Lombard, Emmanuel Boss, Anya M. Waite, Meike Vogt, Julia Uitz, Lars Stemmann, Heidi M. Sosik, Jan Schulz, Jean-Baptiste Romagnan, Marc Picheral, 2019. Globally consistent quantitative observations of planktonic ecosystems. Frontiers in Marine Science 6 (2019), 196.",
      "doi": ""
    },
    {
      "text": "David M. Markowitz, Rob Laha, Brian P. Perone, Roy D. Pea, and Jeremy N. Bailenson. 2018. Immersive virtual reality field trips facilitate learning about climate change. Frontiers in Psychology 9 (2018), 2364.",
      "doi": ""
    },
    {
      "text": "Karen L. Masters, Coleman Krawczyk, Shoaib Shamsi, Alexander Todd, Daniel Finnegan, Matthew Bershady, Kevin Bundy, Brian Cherinka, Amelia Fraser-McKelvie, Dhanesh Krishnarao, 2021. Galaxy Zoo: 3D — Crowdsourced bar, spiral, and foreground star masks for MaNGA target galaxies. Monthly Notices of the Royal Astronomical Society 507, 3 (2021), 3923–3935.",
      "doi": ""
    },
    {
      "text": "Lachlan I.W. McKinna. 2015. Three decades of ocean-color remote-sensing Trichodesmium spp. in the World’s oceans: A review. Progress in Oceanography 131 (2015), 177–199.",
      "doi": ""
    },
    {
      "text": "Abhas Misraraj, Amanda Bullington, Alex Shepard, Scott Loarie, Ken-ichi Ueda, Carrie Seltzer, Tony Iwane, Patrick Leary, and Yaron Budowski. 2020. Seek by iNaturalist: User guide. http://static.inaturalist.org/wiki_page_attachments/SeekUserGuide2020.pdf",
      "doi": ""
    },
    {
      "text": "Frank E. Muller-Karger, Erin Hestir, Christiana Ade, Kevin Turpie, Dar A. Roberts, David Siegel, Robert J. Miller, David Humm, Noam Izenberg, Mary Keller, 2018. Satellite sensor requirements for monitoring essential biodiversity variables of coastal ecosystems. Ecological Applications 28, 3 (2018), 749–760.",
      "doi": ""
    },
    {
      "text": "Mohammad Sadegh Norouzzadeh, Dan Morris, Sara Beery, Neel Joshi, Nebojsa Jojic, and Jeff Clune. 2021. A deep active learning system for species identification and counting in camera trap images. Methods in Ecology and Evolution 12, 1 (2021), 150–161.",
      "doi": ""
    },
    {
      "text": "Jill Nugent. 2017. It all adds up: WildCam Gorongosa citizen science and conservation in the classroom. Science Scope 40, 8 (2017), 12–15.",
      "doi": ""
    },
    {
      "text": "Jorg Ontrup, Nils Ehnert, Melanie Bergmann, and Tim W. Nattkemper. 2009. Biigle – Web 2.0 enabled labelling and exploring of images from the Arctic deep-sea observatory HAUSGARTEN. In Proceedings of OCEANS. 1–7.",
      "doi": ""
    },
    {
      "text": "Eric C. Orenstein, Sakina-Dorothée Ayata, Frédéric Maps, Érica C. Becker, Fabio Benedetti, Tristan Biard, Thibault de Garidel-Thoron, Jeffrey S. Ellen, Filippo Ferrario, Sarah L.C. Giering, 2022. Machine learning techniques to characterize functional traits of plankton from image data. Limnology and Oceanography 67, 8 (2022), 1647–1669.",
      "doi": ""
    },
    {
      "text": "Malte Pedersen, Joakim Bruslund Haurum, Rikke Gade, and Thomas B. Moeslund. 2019. Detection of marine animals in a new underwater dataset with varying visibility. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops. 18–26.",
      "doi": ""
    },
    {
      "text": "Marc Picheral, Sébastien Colin, and Jean-Olivier Irisson. 2017. EcoTaxa, a tool for the taxonomic classification of images. https://ecotaxa.obs-vlfr.fr/",
      "doi": ""
    },
    {
      "text": "Marc Picheral, Lionel Guidi, Lars Stemmann, David M. Karl, Ghizlaine Iddaoud, and Gabriel Gorsky. 2010. The Underwater Vision Profiler 5: An advanced instrument for high spatial resolution studies of particle size spectra and zooplankton. Limnology and Oceanography: Methods 8, 9 (2010), 462–473.",
      "doi": ""
    },
    {
      "text": "Viviana Piermattei, Alice Madonia, Simone Bonamano, Riccardo Martellucci, Gabriele Bruzzone, Roberta Ferretti, Angelo Odetti, Maurizio Azzaro, Giuseppe Zappalà, and Marco Marcelli. 2018. Cost-effective technologies to study the arctic ocean environment. Sensors 18, 7 (2018), 2257.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece. 2016. Citizen science: New research challenges for human–computer interaction. International Journal of Human-Computer Interaction 32, 8(2016), 585–612.",
      "doi": ""
    },
    {
      "text": "Meihua Qian and Karen R. Clark. 2016. Game-based Learning and 21st century skills: A review of recent research. Computers in Human Behavior 63 (2016), 50–58.",
      "doi": "10.1016/j.chb.2016.05.023"
    },
    {
      "text": "Barath Raghavan and Daniel Pargman. 2017. Means and ends in human-computer interaction: Sustainability through disintermediation. In Proceedings of the CHI Conference on Human Factors in Computing Systems. 786–796.",
      "doi": "10.1145/3025453.3025542"
    },
    {
      "text": "David Randall, Richard Harper, and Mark Rouncefield. 2007. Fieldwork for Design: Theory and Practice. Springer.",
      "doi": "10.5555/1296077"
    },
    {
      "text": "Benjamin Recht, Rebecca Roelofs, Ludwig Schmidt, and Vaishaal Shankar. 2019. Do ImageNet classifiers generalize to ImageNet?. In Proceedings of the 36th International Conference on Machine Learning. 5389–5400.",
      "doi": ""
    },
    {
      "text": "Christian Remy, Silke Gegenbauer, and Elaine M. Huang. 2015. Bridging the theory-practice gap: Lessons and challenges of applying the attachment framework for sustainable HCI design. In Proceedings of the CHI Conference on Human Factors in Computing Systems. 1305–1314.",
      "doi": "10.1145/2702123.2702567"
    },
    {
      "text": "Kelly L. Robinson, Jessica Y. Luo, Su Sponaugle, Cedric Guigand, and Robert K. Cowen. 2017. A tale of two crowds: Public engagement in plankton classification. Frontiers in Marine Science 4 (2017), 82.",
      "doi": ""
    },
    {
      "text": "Brian M. Schlining and Nancy Jacobsen Stout. 2006. MBARI’s Video Annotation and Reference System. In Proceedings of OCEANS. 1–5.",
      "doi": ""
    },
    {
      "text": "M. Six Silberman, Lisa Nathan, Bran Knowles, Roy Bendor, Adrian Clear, Maria Håkansson, Tawanna Dillahunt, and Jennifer Mankoff. 2014. Next steps for sustainable HCI. Interactions 21, 5 (2014), 66–69.",
      "doi": "10.1145/2651820"
    },
    {
      "text": "Robert Simpson, Kevin R. Page, and David De Roure. 2014. Zooniverse: Observing the world’s largest citizen science platform. In Proceedings of the 23rd International Conference on World Wide Web. 1049–1054.",
      "doi": "10.1145/2567948.2579215"
    },
    {
      "text": "Leslie M. Smith, Laura Cimoli, Diana LaScala-Gruenewald, Maria Pachiadaki, Brennan Phillips, Helen Pillar, Justin E. Stopa, Simone Baumann-Pickering, Stace E. Beaulieu, Katherine L.C. Bell, 2022. The deep ocean observing strategy: Addressing global challenges in the deep sea through collaboration. Marine Technology Society Journal 56, 3 (2022), 50–66.",
      "doi": ""
    },
    {
      "text": "Ramine Tinati, Max Van Kleek, Elena Simperl, Markus Luczak-Rösch, Robert Simpson, and Nigel Shadbolt. 2015. Designing for citizen data analysis: A cross-sectional case study of a multi-domain citizen science platform. In Proceedings of the CHI Conference on Human Factors in Computing Systems. 4069–4078.",
      "doi": "10.1145/2702123.2702420"
    },
    {
      "text": "Colin J. Torney, David J. Lloyd-Jones, Mark Chevallier, David C. Moyer, Honori T. Maliti, Machoke Mwita, Edward M. Kohi, and Grant C. Hopcraft. 2019. A comparison of deep learning and citizen science techniques for counting wildlife in aerial survey images. Methods in Ecology and Evolution 10, 6 (2019), 779–787.",
      "doi": ""
    },
    {
      "text": "Devis Tuia, Benjamin Kellenberger, Sara Beery, Blair R. Costelloe, Silvia Zuffi, Benjamin Risse, Alexander Mathis, Mackenzie W. Mathis, Frank van Langevelde, Tilo Burghardt, 2022. Perspectives in machine learning for wildlife conservation. Nature Communications 13, 1 (2022), 1–15.",
      "doi": ""
    },
    {
      "text": "Jarrett Van den Bergh, Ved Chirayath, Alan Li, Juan L Torres-Pérez, and Michal Segal-Rozenhaimer. 2021. NeMO-Net — Gamifying 3D labeling of multi-modal reference datasets to support automated marine habitat mapping. Frontiers in Marine Science 8 (2021), 645408.",
      "doi": ""
    },
    {
      "text": "Grant Van Horn, Steve Branson, Ryan Farrell, Scott Haber, Jessie Barry, Panos Ipeirotis, Pietro Perona, and Serge Belongie. 2015. Building a bird recognition app and large scale dataset with citizen scientists: The fine print in fine-grained dataset collection. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 595–604.",
      "doi": ""
    },
    {
      "text": "Grant Van Horn, Oisin Mac Aodha, Yang Song, Yin Cui, Chen Sun, Alex Shepard, Hartwig Adam, Pietro Perona, and Serge Belongie. 2018. The iNaturalist species classification and detection dataset. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 8769–8778.",
      "doi": ""
    },
    {
      "text": "Noah L. Walcutt, Benjamin Knörlein, Ivona Cetinić, Zrinka Ljubesic, Suncica Bosak, Tom Sgouros, Amanda L. Montalbano, Aimee Neeley, Susanne Menden-Deuer, and Melissa M. Omand. 2020. Assessment of holographic microscopy for quantifying marine particle size and concentration. Limnology and Oceanography: Methods 18, 9 (2020), 516–530.",
      "doi": ""
    },
    {
      "text": "Zhaohui Aleck Wang, Hassan Moustahfid, Amy V. Mueller, Anna P.M. Michel, Matthew Mowlem, Brian T. Glazer, T. Aran Mooney, William Michaels, Jonathan S. McQuillan, Julie C. Robidart, 2019. Advancing observation of ocean biogeochemistry, biology, and ecosystems with cost-effective in situ sensing technologies. Frontiers in Marine Science 6 (2019), 519.",
      "doi": ""
    },
    {
      "text": "Poonam Yadav and John Darlington. 2016. Design guidelines for the user-centred collaborative citizen science platforms. Human Computation 3, 1 (2016), 213–2223.",
      "doi": ""
    },
    {
      "text": "Fumin Zhang, Giacomo Marani, Ryan N. Smith, and Hyun Taek Choi. 2015. Future trends in marine robotics. IEEE Robotics & Automation Magazine 22, 1 (2015), 14–122.",
      "doi": ""
    },
    {
      "text": "Martin Zurowietz, Daniel Langenkämper, Brett Hosking, Henry A. Ruhl, and Tim W. Nattkemper. 2018. MAIA—A machine learning assisted image annotation method for environmental monitoring and exploration. PLOS ONE 13, 11 (2018), e0207498.",
      "doi": ""
    }
  ]
}