{
  "doi": "10.1145/3544548.3581039",
  "title": "“Picture the Audience...”: Exploring Private AR Face Filters for Online Public Speaking",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Faced with public speaking anxiety, one common piece of advice is to picture the audience in a new light, using your mind’s eye. With Augmented Reality (AR) face filters, it becomes possible to literally change how one sees oneself or others. In this paper, we explore privately applied AR filters during online public speaking. Private means that these effects are only visible to the speaker. To investigate this possibly controversial concept, we conducted an online survey with 100 respondents to gather a diverse set of initial impressions, possible boundaries, and guidelines. Following this, we built a prototype of a private AR web-based video-calling application, and pilot-tested it with 16 participants to gain more in-depth insights. Based on our results, we outline key user perspectives and opportunities for the private application of AR face filters during online public speaking and discuss them in the context of previous literature on this topic.",
  "authors": [
    {
      "name": "Joanne Leong",
      "institution": "MIT Media Lab, USA",
      "img": "/do/10.1145/contrib-89558862057/rel-imgonly/joanne-grey-square-640.jpg",
      "acmid": "89558862057",
      "orcid": "0000-0001-5422-1018"
    },
    {
      "name": "Florian Perteneder",
      "institution": "Independent, Austria",
      "img": "/do/10.1145/contrib-81442617361/rel-imgonly/flo_small_bw.jpg",
      "acmid": "81442617361",
      "orcid": "0000-0003-0664-570X"
    },
    {
      "name": "Muhender Raj Rajvee",
      "institution": "Massachusetts Institute of Technology, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780499",
      "orcid": "0000-0002-4062-9554"
    },
    {
      "name": "Pattie Maes",
      "institution": "MIT Media Lab, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319638",
      "orcid": "0000-0002-7722-6038"
    }
  ],
  "references": [
    {
      "text": "2022. Tropedia Fandom: Imagine the Audience Naked. https://tropedia.fandom.com/wiki/Imagine_the_Audience_Naked Accessed: 2022-09-09.",
      "doi": ""
    },
    {
      "text": "Page L Anderson, Elana Zimand, Larry F Hodges, and Barbara O Rothbaum. 2005. Cognitive behavioral therapy for public-speaking anxiety using virtual reality for exposure. Depression and anxiety 22, 3 (2005), 156–158.",
      "doi": ""
    },
    {
      "text": "Laura Aymerich-Franch, René F Kizilcec, and Jeremy N Bailenson. 2014. The relationship between virtual self similarity and social anxiety. Frontiers in human neuroscience 8 (2014), 944.",
      "doi": ""
    },
    {
      "text": "Domna Banakou, Sameer Kishore, and Mel Slater. 2018. Virtually being Einstein results in an improvement in cognitive task performance and a decrease in age bias. Frontiers in psychology(2018), 917.",
      "doi": ""
    },
    {
      "text": "Ronald Bassett, Ralph R Behnke, Larry W Carlile, and Jimmie Rogers. 1973. The effects of positive and negative audience responses on the autonomic arousal of student speakers. Southern Journal of Communication 38, 3 (1973), 255–261.",
      "doi": ""
    },
    {
      "text": "Graham D Bodie. 2010. A racing heart, rattling knees, and ruminative thoughts: Defining, explaining, and treating public speaking anxiety. Communication education 59, 1 (2010), 70–105.",
      "doi": ""
    },
    {
      "text": "Cristina Botella, Javier Fernández-Álvarez, Verónica Guillén, Azucena García-Palacios, and Rosa Baños. 2017. Recent progress in virtual reality exposure therapy for phobias: a systematic review. Current psychiatry reports 19, 7 (2017), 1–13.",
      "doi": ""
    },
    {
      "text": "Yi Fei Cheng, Hang Yin, Yukang Yan, Jan Gugenheimer, and David Lindlbauer. 2022. Towards Understanding Diminished Reality. In CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": ""
    },
    {
      "text": "JE Cichor, M Egorov, DA Plecher, E Schmid, and C Peus. 2019. Everything Starts with a Handshake: Effects of Character Design and Character Interactions on Leadership Development in Virtual Reality.. In 5th International Augmented Reality & Virtual Reality Conference (IAVR).",
      "doi": ""
    },
    {
      "text": "Ionut Damian, Chiew Seng Tan, Tobias Baur, Johannes Schöning, Kris Luyten, and Elisabeth André. 2015. Augmenting social interactions: Realtime behavioural feedback using social signal processing techniques. In Proceedings of the 33rd annual ACM conference on Human factors in computing systems. 565–574.",
      "doi": "10.1145/2702123.2702314"
    },
    {
      "text": "Iñigo Fernández del Amo, John Ahmet Erkoyuncu, Rajkumar Roy, Riccardo Palmarini, and Demetrius Onoufriou. 2018. A systematic review of Augmented Reality content-related techniques for knowledge transfer in maintenance applications. Computers in Industry 103 (2018), 47–71.",
      "doi": ""
    },
    {
      "text": "Christian Eichhorn, David Plecher, and Gudrun Klinker. 2022. VR enabling knowledge gain for the user (VENUS). (2022).",
      "doi": ""
    },
    {
      "text": "Meriem El-Yamri, Alejandro Romero-Hernandez, Manuel Gonzalez-Riojo, and Borja Manero. 2019. Designing a VR game for public speaking based on speakers features: a case study. Smart Learning Environments 6, 1 (2019), 1–15.",
      "doi": ""
    },
    {
      "text": "Thomas E Ford, Brianna L Ford, Christie F Boxer, and Jacob Armstrong. 2012. Effect of humor on state anxiety and math performance.",
      "doi": ""
    },
    {
      "text": "Rebecca Fribourg, Etienne Peillard, and Rachel Mcdonnell. 2021. Mirror, Mirror on My Phone: Investigating Dimensions of Self-Face Perception Induced by Augmented Reality Filters. In 2021 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 470–478.",
      "doi": ""
    },
    {
      "text": "Jérôme Guegan, Stéphanie Buisine, Fabrice Mantelet, Nicolas Maranzana, and Frédéric Segonds. 2016. Avatar-mediated creativity: When embodying inventors makes engineers more creative. Computers in Human Behavior 61 (2016), 165–175.",
      "doi": "10.1016/j.chb.2016.03.024"
    },
    {
      "text": "Olli I Heimo, Kai K Kimppa, Seppo Helle, Timo Korkalainen, and Teijo Lehtonen. 2014. Augmented reality-Towards an ethical fantasy?. In 2014 IEEE international symposium on ethics in science, technology and engineering. IEEE, 1–7.",
      "doi": ""
    },
    {
      "text": "Mohammed Hoque, Matthieu Courgeon, Jean-Claude Martin, Bilge Mutlu, and Rosalind W Picard. 2013. Mach: My automated conversation coach. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. 697–706.",
      "doi": "10.1145/2493432.2493502"
    },
    {
      "text": "Ana Javornik, Ben Marder, Jennifer Brannon Barhorst, Graeme McLean, Yvonne Rogers, Paul Marshall, and Luk Warlop. 2022. ‘What lies behind the filter?’ Uncovering the motivations for using augmented reality (AR) face filters on social media and their effect on well-being. Computers in Human Behavior 128 (2022), 107126.",
      "doi": "10.1016/j.chb.2021.107126"
    },
    {
      "text": "Ana Javornik and Marta Pizzetti. 2017. Mirror Mirror on the Wall, Who Is Real of Them All?-the Role of Augmented Self, Expertise and Personalisation in the Experience With Augmented Reality Mirror. ACR North American Advances(2017).",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Ilias Bergstrom, and Mel Slater. 2013. Drumming in immersive virtual reality: the body shapes the way we play. IEEE transactions on visualization and computer graphics 19, 4(2013), 597–605.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Dorothy Leeds. 2003. PowerSpeak: Engage, Inspire and Stimulate your Audience. The Career Press. http://ielts-house.net/Ebook/Speaking/PowerSpeak_%20Engage%2C%20Inspire%2C%20and%20Stimulate%20Your%20Audience.pdf",
      "doi": ""
    },
    {
      "text": "Joanne Leong, Pat Pataranutaporn, Yaoli Mao, Florian Perteneder, Ehsan Hoque, Janet M Baker, and Pattie Maes. 2021. Exploring the use of real-time camera filters on embodiment and creativity. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": "10.1145/3411763.3451696"
    },
    {
      "text": "Jonathan Li. 2022. Picturing Your Audience in Their Underwear–That’s a Stupid Strategy. https://www.presentationxpert.com/10357-2 Accessed: 2022-09-09.",
      "doi": ""
    },
    {
      "text": "Peter D MacIntyre, Kimly A Thivierge, and J Renée MacDonald. 1997. The effects of audience interest, responsiveness, and evaluation on public speaking anxiety and related variables. Communication research reports 14, 2 (1997), 157–168.",
      "doi": ""
    },
    {
      "text": "Steve Mann. 2002. Mediated reality with implementations for everyday life. Presence Connect 1(2002), 2002.",
      "doi": ""
    },
    {
      "text": "Rod A Martin, Patricia Puhlik-Doris, Gwen Larsen, Jeanette Gray, and Kelly Weir. 2003. Individual differences in uses of humor and their relation to psychological well-being: Development of the Humor Styles Questionnaire. Journal of research in personality 37, 1 (2003), 48–75.",
      "doi": ""
    },
    {
      "text": "Morag Maskey, Jacqui Rodgers, Barry Ingham, Mark Freeston, Gemma Evans, Marie Labus, and Jeremy R Parr. 2019. Using virtual reality environments to augment cognitive behavioral therapy for fears and phobias in autistic adults. Autism in Adulthood 1, 2 (2019), 134–145.",
      "doi": ""
    },
    {
      "text": "Paul R Messinger, Xin Ge, Kristen Smirnov, Eleni Stroulia, and Kelly Lyons. 2019. Reflections of the extended self: Visual self-representation in avatar-mediated environments. Journal of Business Research 100 (2019), 531–546.",
      "doi": ""
    },
    {
      "text": "MT Motley. 1997. COM therapy. Avoiding communication: Shyness, reticence, and communication apprehension (1997), 379–400.",
      "doi": ""
    },
    {
      "text": "Prasanth Murali, Ha Trinh, Lazlo Ring, and Timothy Bickmore. 2021. A Friendly Face in the Crowd: Reducing Public Speaking Anxiety with an Emotional Support Agent in the Audience. In Proceedings of the 21st ACM International Conference on Intelligent Virtual Agents. 156–163.",
      "doi": "10.1145/3472306.3478364"
    },
    {
      "text": "Naoto Nakazato, Shigeo Yoshida, Sho Sakurai, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2014. Smart Face: enhancing creativity during video conferences using real-time facial deformation. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 75–83.",
      "doi": "10.1145/2531602.2531637"
    },
    {
      "text": "David Narciso, Maximino Bessa, Miguel Melo, and José Vasconcelos-Raposo. 2019. Virtual reality for training-the impact of smell on presence, cybersickness, fatigue, stress and knowledge transfer. In 2019 International Conference on Graphics and Interaction (ICGI). IEEE, 115–121.",
      "doi": ""
    },
    {
      "text": "Merve Denizci Nazligul, Murat Yilmaz, Ulas Gulec, Mert Ali Gozcu, Rory V O’Connor, and Paul M Clarke. 2017. Overcoming public speaking anxiety of software engineers using virtual reality exposure therapy. In European Conference on Software Process Improvement. Springer, 191–202.",
      "doi": ""
    },
    {
      "text": "Lewis Nitschinsk, Stephanie J Tobin, Deanna Varley, and Eric J Vanman. 2021. Seeking Anonymity in Online Spaces: How Anonymous Motivations Predict our Social Media Usage and Online Behavior. In TMS Proceedings 2021. PubPub.",
      "doi": ""
    },
    {
      "text": "Nielsen Norman Group 2022. Interviewing Users. Nielsen Norman Group. https://www.nngroup.com/articles/interviewing-users/",
      "doi": ""
    },
    {
      "text": "Nahal Norouzi, Kangsoo Kim, Gerd Bruder, Jeremy N Bailenson, Pamela Wisniewski, and Gregory F Welch. 2022. The advantages of virtual dogs over virtual people: Using augmented reality to provide social support in stressful situations. International Journal of Human-Computer Studies 165 (2022), 102838.",
      "doi": "10.1016/j.ijhcs.2022.102838"
    },
    {
      "text": "Fabrizio Palmas, Jakub Cichor, David A Plecher, and Gudrun Klinker. 2019. Acceptance and effectiveness of a virtual reality public speaking training. In 2019 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 363–371.",
      "doi": ""
    },
    {
      "text": "Fabrizio Palmas, David Labode, David A Plecher, and Gudrun Klinker. 2019. Comparison of a gamified and non-gamified virtual reality training assembly task. In 2019 11th International Conference on Virtual Worlds and Games for Serious Applications (VS-Games). IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Fabrizio Palmas, Ramona Reinelt, Jakub E Cichor, David A Plecher, and Gudrun Klinker. 2021. Virtual reality public speaking training: Experimental evaluation of direct feedback technology acceptance. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). IEEE, 463–472.",
      "doi": ""
    },
    {
      "text": "Inyoung Park, Young June Sah, Suhyun Lee, and Daeho Lee. 2022. Avatar-Mediated Communication in Video Conferencing: Effect of Self-Affirmation on Debating Participation Focusing on Moderation Effect of Avatar. International Journal of Human–Computer Interaction (2022), 1–12.",
      "doi": ""
    },
    {
      "text": "Pat Pataranutaporn, Valdemar Danry, Joanne Leong, Parinya Punpongsanon, Dan Novy, Pattie Maes, and Misha Sra. 2021. AI-generated characters for supporting personalized learning and well-being. Nature Machine Intelligence 3, 12 (2021), 1013–1022.",
      "doi": ""
    },
    {
      "text": "Tabitha C Peck, Jessica J Good, and Kimberly A Bourne. 2020. Inducing and mitigating stereotype threat through gendered virtual body-swap illusions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376419"
    },
    {
      "text": "David-Paul Pertaub, Mel Slater, and Chris Barker. 2002. An experiment on public speaking anxiety in response to three different types of virtual audience. Presence 11, 1 (2002), 68–78.",
      "doi": "10.1162/105474602317343668"
    },
    {
      "text": "David Plecher, Christian Eichhorn, and Gudrun Klinker. 2022. ROAR-Role of Augmented Reality in Serious Games and Superhuman Sports. (2022).",
      "doi": ""
    },
    {
      "text": "Mark B Powers and Paul MG Emmelkamp. 2008. Virtual reality exposure therapy for anxiety disorders: A meta-analysis. Journal of anxiety disorders 22, 3 (2008), 561–569.",
      "doi": ""
    },
    {
      "text": "Ayelet Meron Ruscio, Timothy A Brown, Wai Tat Chiu, Jitender Sareen, Murray B Stein, and Ronald C Kessler. 2008. Social fears and social phobia in the USA: results from the National Comorbidity Survey Replication. Psychological medicine 38, 1 (2008), 15–28.",
      "doi": ""
    },
    {
      "text": "Justas Šalkevičius, Audronė Miškinytė, and Lukas Navickas. 2019. Cloud based virtual reality exposure therapy service for public speaking anxiety. Information 10, 2 (2019), 62.",
      "doi": ""
    },
    {
      "text": "Dorothy Sarnoff. 1970. Speech Can Change Your Life: Tips on Speech, Conversation, and Speechmaking. Doubleday. https://books.google.at/books?id=4-tEAAAAIAAJ",
      "doi": ""
    },
    {
      "text": "Valentin Schwind, Katrin Wolf, and Niels Henze. 2018. Avoiding the uncanny valley in virtual character design. interactions 25, 5 (2018), 45–49.",
      "doi": ""
    },
    {
      "text": "Esther Shein. 2021. Filtering for beauty. Commun. ACM 64, 11 (2021), 17–19.",
      "doi": "10.1145/3484997"
    },
    {
      "text": "William B Swann. 1987. Identity negotiation: Where two roads meet.Journal of personality and social psychology 53, 6(1987), 1038.",
      "doi": ""
    },
    {
      "text": "William B Swann Jr, Brett W Pelham, and Douglas S Krull. 1989. Agreeable fancy or disagreeable truth? Reconciling self-enhancement and self-verification.Journal of personality and social psychology 57, 5(1989), 782.",
      "doi": ""
    },
    {
      "text": "Marcel Takac, James Collett, Kristopher J Blom, Russell Conduit, Imogen Rehm, and Alexander De Foe. 2019. Public speaking anxiety decreases within repeated virtual reality training sessions. PloS one 14, 5 (2019), e0216288.",
      "doi": ""
    },
    {
      "text": "M Iftekhar Tanveer, Emy Lin, and Mohammed Hoque. 2015. Rhema: A real-time in-situ intelligent interface to help people with public speaking. In Proceedings of the 20th international conference on intelligent user interfaces. 286–295.",
      "doi": "10.1145/2678025.2701386"
    },
    {
      "text": "Ha Trinh, Lazlo Ring, and Timothy Bickmore. 2015. Dynamicduo: co-presenting with virtual agents. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1739–1748.",
      "doi": "10.1145/2702123.2702584"
    },
    {
      "text": "Sherry Turkle. 1994. Constructions and reconstructions of self in virtual reality: Playing in the MUDs. Mind, Culture, and Activity 1, 3 (1994), 158–167.",
      "doi": ""
    },
    {
      "text": "Eva AM van Dis, Elze Landkroon, Muriel A Hagenaars, Florentine HS van der Does, and Iris M Engelhard. 2021. Old fears die hard: Return of public speaking fear in a virtual reality procedure. Behavior Therapy 52, 5 (2021), 1188–1197.",
      "doi": ""
    },
    {
      "text": "Jinping Wang, Hyun Yang, Ruosi Shao, Saeed Abdullah, and S Shyam Sundar. 2020. Alexa as coach: Leveraging smart speakers to build social agents that reduce public speaking anxiety. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376561"
    },
    {
      "text": "Xingbo Wang, Haipeng Zeng, Yong Wang, Aoyu Wu, Zhida Sun, Xiaojuan Ma, and Huamin Qu. 2020. Voicecoach: Interactive evidence-based training for voice modulation skills in public speaking. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376726"
    },
    {
      "text": "Nick Yee and Jeremy Bailenson. 2007. The Proteus effect: The effect of transformed self-representation on behavior. Human communication research 33, 3 (2007), 271–290.",
      "doi": ""
    },
    {
      "text": "Shigeo Yoshida, Tomohiro Tanikawa, Sho Sakurai, Michitaka Hirose, and Takuji Narumi. 2013. Manipulation of an emotional experience by real-time deformed facial feedback. In Proceedings of the 4th Augmented Human International Conference. 35–42.",
      "doi": "10.1145/2459236.2459243"
    },
    {
      "text": "Anja Zimmer, Nan Wang, Merle K Ibach, Bernhard Fehlmann, Nathalie S Schicktanz, Dorothée Bentz, Tanja Michael, Andreas Papassotiropoulos, and Dominique JF de Quervain. 2021. Effectiveness of a smartphone-based, augmented reality exposure app to reduce fear of spiders in real-life: A randomized controlled trial. Journal of anxiety disorders 82 (2021), 102442.",
      "doi": ""
    },
    {
      "text": "Avner Ziv. 1984. Personality and sense of humor. Springer.",
      "doi": ""
    }
  ]
}