{
  "doi": "10.1145/3544548.3581348",
  "title": "Navigates Like Me: Understanding How People Evaluate Human-Like AI in Video Games",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "We aim to understand how people assess human likeness in navigation produced by people and artificially intelligent (AI) agents in a video game. To this end, we propose a novel AI agent with the goal of generating more human-like behavior. We collect hundreds of crowd-sourced assessments comparing the human-likeness of navigation behavior generated by our agent and baseline AI agents with human-generated behavior. Our proposed agent passes a Turing Test, while the baseline agents do not. By passing a Turing Test, we mean that human judges could not quantitatively distinguish between videos of a person and an AI agent navigating. To understand what people believe constitutes human-like navigation, we extensively analyze the justifications of these assessments. This work provides insights into the characteristics that people consider human-like in the context of goal-directed video game navigation, which is a key step for further improving human interactions with AI agents.",
  "authors": [
    {
      "name": "Stephanie Milani",
      "institution": "Machine Learning, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659445010",
      "orcid": "0000-0003-1150-4418"
    },
    {
      "name": "Arthur Juliani",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659843074",
      "orcid": "0000-0002-1971-5167"
    },
    {
      "name": "Ida Momennejad",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239468",
      "orcid": "0000-0003-0830-3973"
    },
    {
      "name": "Raluca Georgescu",
      "institution": "Game Intelligence, Microsoft Research, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233289",
      "orcid": "0000-0001-7917-3729"
    },
    {
      "name": "Jaroslaw Rzepecki",
      "institution": "Monumo, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659530191",
      "orcid": "0000-0001-8409-7476"
    },
    {
      "name": "Alison Shaw",
      "institution": "Ninja Theory, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236865",
      "orcid": "0000-0002-6668-5896"
    },
    {
      "name": "Gavin Costello",
      "institution": "Ninja Theory, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232866",
      "orcid": "0000-0002-6863-1314"
    },
    {
      "name": "Fei Fang",
      "institution": "Institute for Software Research, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81504684096",
      "orcid": "0000-0003-2256-8329"
    },
    {
      "name": "Sam Devlin",
      "institution": "Microsoft Research, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444594894",
      "orcid": "0000-0002-7769-3090"
    },
    {
      "name": "Katja Hofmann",
      "institution": "Microsoft, United Kingdom",
      "img": "/do/10.1145/contrib-81384619723/rel-imgonly/katja-twitter-profile.jpg",
      "acmid": "81384619723",
      "orcid": "0000-0003-3697-407X"
    }
  ],
  "references": [
    {
      "text": "Martín Abadi, Ashish Agarwal, Paul Barham, Eugene Brevdo, Zhifeng Chen, Craig Citro, Greg S. Corrado, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Ian Goodfellow, Andrew Harp, Geoffrey Irving, Michael Isard, Yangqing Jia, Rafal Jozefowicz, Lukasz Kaiser, Manjunath Kudlur, Josh Levenberg, Dandelion Mané, Rajat Monga, Sherry Moore, Derek Murray, Chris Olah, Mike Schuster, Jonathon Shlens, Benoit Steiner, Ilya Sutskever, Kunal Talwar, Paul Tucker, Vincent Vanhoucke, Vijay Vasudevan, Fernanda Viégas, Oriol Vinyals, Pete Warden, Martin Wattenberg, Martin Wicke, Yuan Yu, and Xiaoqiang Zheng. 2015. TensorFlow: Large-Scale Machine Learning on Heterogeneous Systems.",
      "doi": ""
    },
    {
      "text": "Peter Aigner and Brenan McCarragher. 1997. Human integration into robot control utilising potential fields. In Proceedings of International Conference on Robotics and Automation, Vol. 1. IEEE, 291–296.",
      "doi": ""
    },
    {
      "text": "Eloi Alonso, Ubisoft La Forge, Maxim Peter, David Goumard, and Joshua Romoff. 2020. Deep Reinforcement Learning for Navigation in AAA Video Games. In Challenges of Real-World Reinforcement Learning NeurIPS Workshop. NeurIPS, Montreal, Canada, 1–13.",
      "doi": ""
    },
    {
      "text": "Ron Artstein and Massimo Poesio. 2008. Inter-coder agreement for computational linguistics. Computational linguistics 34, 4 (2008), 555–596.",
      "doi": ""
    },
    {
      "text": "Christian Arzate Cruz and Jorge Adolfo Ramirez Uresti. 2018. HRLB2: A Reinforcement Learning Based Framework for Believable Bots. Applied Sciences 8, 12 (2018), 2453.",
      "doi": ""
    },
    {
      "text": "Christopher Berner, Greg Brockman, Brooke Chan, Vicki Cheung, Przemysław Dębiak, Christy Dennison, David Farhi, Quirin Fischer, Shariq Hashme, Chris Hesse, 2019. Dota 2 with large scale deep reinforcement learning. arXiv preprint arXiv:1912.06680 1 (2019), 1–66.",
      "doi": ""
    },
    {
      "text": "Michael S Bernstein, Joel Brandt, Robert C Miller, and David R Karger. 2011. Crowds in two seconds: Enabling realtime crowd-powered interfaces. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 33–42.",
      "doi": "10.1145/2047196.2047201"
    },
    {
      "text": "Rodney A Brooks, Cynthia Breazeal, Robert Irie, Charles C Kemp, Matthew Marjanovic, Brian Scassellati, and Matthew M Williamson. 1998. Alternative essences of intelligence. AAAI/IAAI 1998(1998), 961–968.",
      "doi": "10.5555/295240.295935"
    },
    {
      "text": "Micah Carroll, Rohin Shah, Mark K Ho, Tom Griffiths, Sanjit Seshia, Pieter Abbeel, and Anca Dragan. 2019. On the utility of learning about humans for human-ai coordination. Advances in neural information processing systems 32 (2019).",
      "doi": ""
    },
    {
      "text": "Paul F Christiano, Jan Leike, Tom Brown, Miljan Martic, Shane Legg, and Dario Amodei. 2017. Deep reinforcement learning from human preferences. In Advances in Neural Information Processing Systems. 4299–4307.",
      "doi": ""
    },
    {
      "text": "Georgios Christou. 2014. The interplay between immersion and appeal in video games. Computers in human behavior 32 (2014), 92–100.",
      "doi": ""
    },
    {
      "text": "Jack Clark and Dario Amodei. 2016. Faulty reward functions in the wild. https://blog.openai.com/faulty-reward-functions",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A Coefficient of Agreement for Nominal Scales. Educational and Psychological Measurement 20, 1 (1960), 37–46. https://doi.org/10.1177/001316446002000104 arXiv:https://doi.org/10.1177/001316446002000104",
      "doi": ""
    },
    {
      "text": "David Conroy, Peta Wyeth, and Daniel Johnson. 2011. Modeling player-like behavior for game AI design. In Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology. ACM, New York, NY, 1–8.",
      "doi": "10.1145/2071423.2071434"
    },
    {
      "text": "Sara De Freitas. 2018. Are games effective learning tools? A review of educational games. Journal of Educational Technology & Society 21, 2 (2018), 74–84.",
      "doi": ""
    },
    {
      "text": "Sam Devlin, Raluca Georgescu, Ida Momennejad, Jaroslaw Rzepecki, Evelyn Zuniga, Gavin Costello, Guy Leroy, Ali Shaw, and Katja Hofmann. 2021. Navigation Turing Test (NTT): Learning to Evaluate Human-Like Navigation. In Proceedings of the 38th International Conference on Machine Learning. PMLR, Virtual, 1–10.",
      "doi": ""
    },
    {
      "text": "Prafulla Dhariwal, Christopher Hesse, Oleg Klimov, Alex Nichol, Matthias Plappert, Alec Radford, John Schulman, Szymon Sidor, Yuhuai Wu, and Peter Zhokhov. 2017. OpenAI Baselines. https://github.com/openai/baselines.",
      "doi": ""
    },
    {
      "text": "Hippolyte Dubois, Patrick Le Callet, and Antoine Coutrot. 2021. Visualizing navigation difficulties in video game experiences. In 2021 13th International Conference on Quality of Multimedia Experience (QoMEX). IEEE, 77–80.",
      "doi": ""
    },
    {
      "text": "Logan Engstrom, Andrew Ilyas, Shibani Santurkar, Dimitris Tsipras, Firdaus Janoos, Larry Rudolph, and Aleksander Madry. 2019. Implementation matters in deep RL: A case study on ppo and trpo. In International conference on learning representations.",
      "doi": ""
    },
    {
      "text": "Nobuto Fujii, Yuichi Sato, Hironori Wakama, Koji Kazai, and Haruhiro Katayose. 2013. Evaluating human-like behaviors of video-game agents autonomously acquired with biological constraints. In International Conference on Advances in Computer Entertainment Technology. Springer, 61–76.",
      "doi": ""
    },
    {
      "text": "Yolanda Gil and Bart Selman. 2019. A 20-year community roadmap for artificial intelligence research in the US. arXiv preprint arXiv:1908.02624(2019).",
      "doi": ""
    },
    {
      "text": "Astrid Glende. 2004. Agent design to pass computer games. In Proceedings of the 42nd annual Southeast regional conference. 414–415.",
      "doi": "10.1145/986537.986640"
    },
    {
      "text": "Stefan Freyr Gudmundsson, Philipp Eisen, Erik Poromaa, Alex Nodet, Sami Purmonen, Bartlomiej Kozakowski, Richard Meurling, and Lele Cao. 2018. Human-like playtesting with deep learning. In 2018 IEEE Conference on Computational Intelligence and Games (CIG). IEEE, 1–8.",
      "doi": "10.1109/CIG.2018.8490442"
    },
    {
      "text": "William H Guss, Cayden Codel, Katja Hofmann, Brandon Houghton, Noboru Kuno, Stephanie Milani, Sharada Mohanty, Diego Perez Liebana, Ruslan Salakhutdinov, Nicholay Topin, 2019. NeurIPS 2019 competition: the MineRL competition on sample efficient reinforcement learning using human priors. arXiv preprint arXiv:1904.10079(2019).",
      "doi": ""
    },
    {
      "text": "Rotem D Guttman, Jessica Hammer, Erik Harpstead, and Carol J Smith. 2021. Play for Real (ism)-Using Games to Predict Human-AI interactions in the Real World. Proceedings of the ACM on Human-Computer Interaction 5 (2021), 1–17.",
      "doi": "10.1145/3474655"
    },
    {
      "text": "Torkel Hafting, Marianne Fyhn, Sturla Molden, May-Britt Moser, and Edvard I Moser. 2005. Microstructure of a spatial map in the entorhinal cortex. Nature 436, 7052 (2005), 801–806.",
      "doi": ""
    },
    {
      "text": "Simon Hecker, Dengxin Dai, Alexander Liniger, Martin Hahner, and Luc Van Gool. 2020. Learning accurate and human-like driving using semantic maps and attention. In 2020 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, Piscataway, New Jersey, 2346–2353.",
      "doi": "10.1109/IROS45743.2020.9341157"
    },
    {
      "text": "Philip Hingston. 2010. A new design for a turing test for bots. In Proceedings of the 2010 IEEE Conference on Computational Intelligence and Games. IEEE, Piscataway, New Jersey, 345–350.",
      "doi": ""
    },
    {
      "text": "Vita Hinze-Hoare. 2007. The review and analysis of human computer interaction (HCI) principles. arXiv preprint arXiv:0707.3638(2007).",
      "doi": ""
    },
    {
      "text": "Sean D Holcomb, William K Porter, Shaun V Ault, Guifen Mao, and Jin Wang. 2018. Overview on deepmind and its alphago zero ai. In Proceedings of the 2018 international conference on big data and education. 67–71.",
      "doi": "10.1145/3206157.3206174"
    },
    {
      "text": "Ahmed Hussein, Mohamed Medhat Gaber, Eyad Elyan, and Chrisina Jayne. 2017. Imitation learning: A survey of learning methods. ACM Computing Surveys (CSUR) 50, 2 (2017), 1–35.",
      "doi": "10.1145/3054912"
    },
    {
      "text": "Panagiotis G Ipeirotis, Foster Provost, and Jing Wang. 2010. Quality management on amazon mechanical turk. In Proceedings of the ACM SIGKDD workshop on human computation. ACM, New York City, New York, 64–67.",
      "doi": "10.1145/1837885.1837906"
    },
    {
      "text": "Athul Paul Jacob, David J Wu, Gabriele Farina, Adam Lerer, Hengyuan Hu, Anton Bakhtin, Jacob Andreas, and Noam Brown. 2022. Modeling strong and human-like gameplay with KL-regularized search. In International Conference on Machine Learning. PMLR, 9695–9728.",
      "doi": ""
    },
    {
      "text": "Mikhail Jacob, Sam Devlin, and Katja Hofmann. 2020. “It’s Unwieldy and It Takes a Lot of Time”—Challenges and Opportunities for Creating Agents in Commercial Games. In Proceedings of the AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment, Vol. 16. AAAI Press, Palo Alto, CA, 88–94.",
      "doi": ""
    },
    {
      "text": "Magnus Johansson. 2013. Do non-player characters dream of electric sheep. A thesis about players, NPCs, immersion and believability (Doctoral dissertation, Department of Computer and Systems Sciences, Stockholm University) (2013).",
      "doi": ""
    },
    {
      "text": "Arthur Juliani, Vincent-Pierre Berges, Ervin Teng, Andrew Cohen, Jonathan Harper, Chris Elion, Chris Goy, Yuan Gao, Hunter Henry, Marwan Mattar, 2018. Unity: A general platform for intelligent agents. arXiv preprint arXiv:1809.02627(2018).",
      "doi": ""
    },
    {
      "text": "Anssi Kanervisto, Christian Scheller, and Ville Hautamäki. 2020. Action space shaping in deep reinforcement learning. In 2020 IEEE Conference on Games (CoG). IEEE, 479–486.",
      "doi": ""
    },
    {
      "text": "Igor V Karpov, Jacob Schrum, and Risto Miikkulainen. 2013. Believable bot navigation via playback of human traces. In Believable bots. Springer, 151–170.",
      "doi": ""
    },
    {
      "text": "Man-Je Kim, Kyung-Joong Kim, Seungjun Kim, and Anind K. Dey. 2018. Performance Evaluation Gaps in a Real-Time Strategy Game Between Human and Artificial Intelligence Players. IEEE Access 6(2018), 13575–13586. https://doi.org/10.1109/ACCESS.2018.2800016",
      "doi": ""
    },
    {
      "text": "Diederik P Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980(2014).",
      "doi": ""
    },
    {
      "text": "Raph Koster. 2013. Theory of fun for game design. \" O’Reilly Media, Inc.\".",
      "doi": "10.5555/2601678"
    },
    {
      "text": "Victoria Krakovna. 2018. Specification gaming examples in AI. https://vkrakovna.wordpress.com/2018/04/02/specification-gaming-examples-in-ai/",
      "doi": ""
    },
    {
      "text": "Guillaume Lample and Devendra Singh Chaplot. 2017. Playing FPS games with deep reinforcement learning. In Thirty-First AAAI Conference on Artificial Intelligence.",
      "doi": "10.5555/3298483.3298548"
    },
    {
      "text": "Joni Lämsä, Raija Hämäläinen, Mikko Aro, Raine Koskimaa, and Sanna-Mari Äyrämö. 2018. Games for enhancing basic reading and maths skills: A systematic review of educational game design in supporting learning by people with learning disabilities. British Journal of Educational Technology 49, 4 (2018), 596–607.",
      "doi": ""
    },
    {
      "text": "P Lavega 2004. Traditional games and education to learn to create bonds. To create bonds to learn. Studies in Physical Culture and Tourism 11, 1 (2004), 9–32.",
      "doi": ""
    },
    {
      "text": "Kuang-Huei Lee, Ofir Nachum, Mengjiao Yang, Lisa Lee, Daniel Freeman, Winnie Xu, Sergio Guadarrama, Ian Fischer, Eric Jang, Henryk Michalewski, 2022. Multi-Game Decision Transformers. arXiv preprint arXiv:2205.15241(2022).",
      "doi": ""
    },
    {
      "text": "Joel Lehman, Jeff Clune, and Dusan Misevic. 2018. The surprising creativity of digital evolution. In Artificial Life Conference Proceedings. MIT Press, 55–56.",
      "doi": ""
    },
    {
      "text": "Daniel Livingstone. 2006. Turing’s test and believable AI in games. Computers in Entertainment (CIE) 4, 1 (2006), 6–es.",
      "doi": "10.1145/1111293.1111303"
    },
    {
      "text": "Rossella Lorenzi. 2013. Oldest known gaming tokens dug up in Bronze Age Turkish graves. NBC News (2013). https://www.nbcnews.com/sciencemain/oldest-known-gaming-tokens-dug-bronze-age-turkish-graves-6c10920354",
      "doi": ""
    },
    {
      "text": "Brian Mac Namee. 2004. Proactive persistent agents-using situational intelligence to create support characters in character-centric computer games. (2004).",
      "doi": ""
    },
    {
      "text": "Colt McAnlis and James Stewart. 2008. Intrinsic detail in navigation mesh generation. AI Game Programming Wisdom 4 (2008), 95–112.",
      "doi": ""
    },
    {
      "text": "Matheus RF Mendonça, Heder S Bernardino, and Raul F Neto. 2015. Simulating human behavior in fighting games using reinforcement learning and artificial neural networks. In 2015 14th Brazilian symposium on computer games and digital entertainment (SBGames). IEEE, 152–159.",
      "doi": ""
    },
    {
      "text": "Lazaros Michailidis, Emili Balaguer-Ballester, and Xun He. 2018. Flow and immersion in video games: The aftermath of a conceptual challenge. Frontiers in psychology 9 (2018), 1682.",
      "doi": ""
    },
    {
      "text": "Maximiliano Miranda, Antonio A Sánchez-Ruiz, and Federico Peinado. 2016. A Neuroevolution Approach to Imitating Human-Like Play in Ms. Pac-Man Video Game.. In CoSECivi. 113–124.",
      "doi": ""
    },
    {
      "text": "Maxim Mozgovoy and Iskander Umarov. 2011. Behavior capture: Building believable and effective AI agents for video games. International Journal of Arts & Sciences 4, 20 (2011), 243.",
      "doi": ""
    },
    {
      "text": "Kara Murias, Kathy Kwok, Adrian Gil Castillejo, Irene Liu, and Giuseppe Iaria. 2016. The effects of video game use on performance in a virtual navigation task. Computers in Human Behavior 58 (2016), 398–406.",
      "doi": "10.1016/j.chb.2016.01.020"
    },
    {
      "text": "Mohamed Musbah, Matthew Mitchell Dixon, Geoffrey Jacoby Gordon, Mahmoud Adada, Soroush Mehri, Andrew James McNamara, and Jonathan David Morrison. U.S. Patent 11213746, Oct. 2019. Providing automated user input to an application during a disruption.",
      "doi": ""
    },
    {
      "text": "Andrew Y Ng, Daishi Harada, and Stuart Russell. 1999. Policy invariance under reward transformations: Theory and application to reward shaping. In Icml, Vol. 99. 278–287.",
      "doi": ""
    },
    {
      "text": "John O’Keefe and Lynn Nadel. 1978. The hippocampus as a cognitive map. Oxford: Clarendon Press, New York City, New York.",
      "doi": ""
    },
    {
      "text": "Gabriele Paolacci, Jesse Chandler, and Panagiotis G Ipeirotis. 2010. Running experiments on Amazon Mechanical Turk. Judgment and Decision Making 5, 5 (2010), 411–419.",
      "doi": ""
    },
    {
      "text": "Scott Reed, Konrad Zolna, Emilio Parisotto, Sergio Gomez Colmenarejo, Alexander Novikov, Gabriel Barth-Maron, Mai Gimenez, Yury Sulsky, Jackie Kay, Jost Tobias Springenberg, 2022. A generalist agent. arXiv preprint arXiv:2205.06175(2022).",
      "doi": ""
    },
    {
      "text": "Anthony E Richardson, Morgan E Powers, and Lauren G Bousquet. 2011. Video game experience predicts virtual, but not real navigation performance. Computers in Human Behavior 27, 1 (2011), 552–560.",
      "doi": "10.1016/j.chb.2010.10.003"
    },
    {
      "text": "Ariel Rosenfeld, Moshe Cohen, Matthew E Taylor, and Sarit Kraus. 2018. Leveraging human knowledge in tabular reinforcement learning: A study of human subjects. The Knowledge Engineering Review 33 (2018), 1–26.",
      "doi": ""
    },
    {
      "text": "Matthias Scheutz, Paul Schermerhorn, James Kramer, and David Anderson. 2007. First steps toward natural human-like HRI. Autonomous Robots 22, 4 (2007), 411–423.",
      "doi": ""
    },
    {
      "text": "Douglas Schuler and Aki Namioka. 1993. Participatory design: Principles and practices. CRC Press.",
      "doi": "10.5555/563076"
    },
    {
      "text": "John Schulman, Filip Wolski, Prafulla Dhariwal, Alec Radford, and Oleg Klimov. 2017. Proximal policy optimization algorithms. arXiv preprint arXiv:1707.06347 1 (2017), 12 pages.",
      "doi": ""
    },
    {
      "text": "Peter Seiler, Bongsob Song, and J Karl Hedrick. 1998. Development of a collision avoidance system. SAE transactions (1998), 1334–1340.",
      "doi": ""
    },
    {
      "text": "Alessandro Sestini, Linus Gisslén, Joakim Bergdahl, Konrad Tollmar, and Andrew D Bagdanov. 2022. Automated Gameplay Testing and Validation with Curiosity-Conditioned Proximal Trajectories. IEEE Transactions on Games(2022).",
      "doi": ""
    },
    {
      "text": "Rohin Shah, Cody Wild, Steven H Wang, Neel Alex, Brandon Houghton, William Guss, Sharada Mohanty, Anssi Kanervisto, Stephanie Milani, Nicholay Topin, 2021. The MineRL BASALT competition on learning from human feedback. arXiv preprint arXiv:2107.01969(2021).",
      "doi": ""
    },
    {
      "text": "Noor Shaker, Julian Togelius, Georgios N Yannakakis, Likith Poovanna, Vinay S Ethiraj, Stefan J Johansson, Robert G Reynolds, Leonard K Heether, Tom Schumann, and Marcus Gallagher. 2013. The turing test track of the 2012 mario ai championship: entries and evaluation. In 2013 IEEE Conference on Computational Inteligence in Games (CIG). IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Aaron Sloman. 1999. What sort of architecture is required for a human-like agent?In Foundations of rational agency. Springer, 35–52.",
      "doi": ""
    },
    {
      "text": "Bhuman Soni and Philip Hingston. 2008. Bots trained to play like a human are more fun. (2008).",
      "doi": ""
    },
    {
      "text": "Richard S Sutton and Andrew G Barto. 2018. Reinforcement learning: An introduction. MIT press, 1 Broadway, Cambridge, MA.",
      "doi": "10.5555/551283"
    },
    {
      "text": "Jonathan Sykes and Melissa Federoff. 2006. Player-centred game design. In CHI’06 extended abstracts on Human factors in computing systems. 1731–1734.",
      "doi": ""
    },
    {
      "text": "István Szita. 2012. Reinforcement learning in games. In Reinforcement learning. Springer, 539–577.",
      "doi": ""
    },
    {
      "text": "Fabien Tencé and Cédric Buche. 2010. Automatable evaluation method oriented toward behaviour believability for video games. arXiv preprint arXiv:1009.0501(2010).",
      "doi": ""
    },
    {
      "text": "Christian Thurau, Christian Bauckhage, and Gerhard Sagerer. 2004. Learning human-like movement behavior for computer games. In Proc. Int. Conf. on the Simulation of Adaptive Behavior. 315–323.",
      "doi": ""
    },
    {
      "text": "Julian Togelius, Georgios N Yannakakis, Sergey Karakovskiy, and Noor Shaker. 2013. Assessing believability. In Believable bots. Springer, 215–230.",
      "doi": ""
    },
    {
      "text": "Edward B Tylor. 1879. THE HISTORY OF GAMES.Fortnightly 25, 149 (1879), 735–747.",
      "doi": ""
    },
    {
      "text": "Teija Vainio. 2010. A Review of the Navigation HCI Research During the 2000’s. international Journal of Interactive Mobile Technologies (iJIM) 4, 3(2010).",
      "doi": ""
    },
    {
      "text": "Oriol Vinyals, Igor Babuschkin, Wojciech M Czarnecki, Michaël Mathieu, Andrew Dudzik, Junyoung Chung, David H Choi, Richard Powell, Timo Ewalds, Petko Georgiev, 2019. Grandmaster level in StarCraft II using multi-agent reinforcement learning. Nature 575, 7782 (2019), 350–354.",
      "doi": ""
    },
    {
      "text": "Luis Von Ahn and Laura Dabbish. 2004. Labeling images with a computer game. In Proceedings of the SIGCHI conference on Human factors in computing systems. 319–326.",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Marcel Walch, Julian Frommel, Katja Rogers, Felix Schüssel, Philipp Hock, David Dobbelstein, and Michael Weber. 2017. Evaluating VR driving simulation from a player experience perspective. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 2982–2989.",
      "doi": "10.1145/3027063.3053202"
    },
    {
      "text": "Dakuo Wang, Elizabeth Churchill, Pattie Maes, Xiangmin Fan, Ben Shneiderman, Yuanchun Shi, and Qianying Wang. 2020. From human-human collaboration to Human-AI collaboration: Designing AI systems that can work together with people. In Extended abstracts of the 2020 CHI conference on human factors in computing systems. 1–6.",
      "doi": ""
    },
    {
      "text": "Henrik Warpefelt. 2013. Mind the gap: Exploring the social capability of non-player characters. Ph. D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Eric Wiewiora. 2010. Reward Shaping. Springer US, Boston, MA, 863–865. https://doi.org/10.1007/978-0-387-30164-8_731",
      "doi": ""
    },
    {
      "text": "Erik Wijmans, Manolis Savva, Irfan Essa, Stefan Lee, Ari S Morcos, and Dhruv Batra. 2023. Emergence of Maps in the Memories of Blind Navigation Agents. arXiv preprint arXiv:2301.13261(2023).",
      "doi": ""
    },
    {
      "text": "Anthony Zador, Blake Richards, Bence Ölveczky, Sean Escola, Yoshua Bengio, Kwabena Boahen, Matthew Botvinick, Dmitri Chklovskii, Anne Churchland, Claudia Clopath, 2022. Toward next-generation artificial intelligence: Catalyzing the neuroai revolution. arXiv preprint arXiv:2210.08340(2022).",
      "doi": ""
    },
    {
      "text": "Yunqi Zhao, Igor Borovikov, Jason Rupert, Caedmon Somers, and Ahmad Beirami. 2019. On multi-agent learning in team sports games. arXiv preprint arXiv:1906.10124(2019).",
      "doi": ""
    },
    {
      "text": "Brian D Ziebart, J Andrew Bagnell, and Anind K Dey. 2010. Modeling interaction via the principle of maximum causal entropy. (2010).",
      "doi": ""
    },
    {
      "text": "Evelyn Zuniga, Stephanie Milani, Guy Leroy, Jaroslaw Rzepecki, Raluca Georgescu, Ida Momennejad, Dave Bignell, Mingfei Sun, Alison Shaw, Gavin Costello, 2022. How Humans Perceive Human-like Behavior in Video Game Navigation. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–11.",
      "doi": ""
    }
  ]
}