{
  "doi": "10.1145/3544548.3581090",
  "title": "Towards Leveraging AI-based Moderation to Address Emergent Harassment in Social Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Extensive HCI research has investigated how to prevent and mitigate harassment in virtual spaces, particularly by leveraging human-based and Artificial Intelligence (AI)-based moderation. However, social Virtual Reality (VR) constitutes a novel social space that faces both intensified harassment challenges and a lack of consensus on how moderation should be approached to address such harassment. Drawing on 39 interviews with social VR users with diverse backgrounds, we investigate the perceived opportunities and limitations for leveraging AI-based moderation to address emergent harassment in social VR, and how future AI moderators can be designed to enhance such opportunities and address limitations. We provide the first empirical investigation into re-envisioning AI’s new roles in innovating content moderation approaches to better combat harassment in social VR. We also highlight important principles for designing future AI-based moderation incorporating user-human-AI collaboration to achieve safer and more nuanced online spaces.",
  "tags": [
    "online harassment",
    "social VR",
    "artificial intelligence",
    "content moderation"
  ],
  "authors": [
    {
      "name": "Kelsea Schulenberg",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659959850",
      "orcid": "0000-0002-1503-7872"
    },
    {
      "name": "Lingyuan Li",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588610",
      "orcid": "0000-0002-8640-9936"
    },
    {
      "name": "Guo Freeman",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639182",
      "orcid": "0000-0001-5107-7794"
    },
    {
      "name": "Samaneh Zamanifard",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659481931",
      "orcid": "0000-0001-8736-1690"
    },
    {
      "name": "Nathan J. McNeese",
      "institution": "Human-Centered Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758690057",
      "orcid": "0000-0002-9143-2460"
    }
  ],
  "references": [
    {
      "text": "Team AltspaceVR. 2022. Making altspacevr a safer space. https://altvr.com/making-altspacevr-a-safer-space/",
      "doi": ""
    },
    {
      "text": "Carolina Are. 2020. How Instagram’s algorithm is censoring women and vulnerable users but helping online abusers. Feminist media studies 20, 5 (2020), 741–744.",
      "doi": ""
    },
    {
      "text": "Priyam Basu, Tiasa Singha Roy, Soham Tiwari, and Saksham Mehta. 2021. CyberPolice: Classification of Cyber Sexual Harassment. In EPIA Conference on Artificial Intelligence. Springer, 701–714.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and its consequences for online harassment: Design insights from heartmob. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–19.",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in Social Virtual Reality: Challenges for Platform Governance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359202"
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in social VR: Implications for design. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 854–855.",
      "doi": ""
    },
    {
      "text": "Hannah Bloch-Wehba. 2020. Automation in moderation. Cornell Int’l LJ 53(2020), 41.",
      "doi": ""
    },
    {
      "text": "Johanna Brewer, Morgan Romine, and TL Taylor. 2020. Inclusion at Scale: Deploying a Community-Driven Moderation Intervention on Twitch. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 757–769.",
      "doi": "10.1145/3357236.3395514"
    },
    {
      "text": "Jie Cai and Donghee Yvette Wohn. 2021. After Violation But Before Sanction: Understanding Volunteer Moderators’ Profiling Processes Toward Violators in Live Streaming Communities. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": ""
    },
    {
      "text": "Jie Cai and Donghee Yvette Wohn. 2022. Coordination and Collaboration: How do Volunteer Moderators Work as a Team in Live Streaming Communities?. In CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3491102.3517628"
    },
    {
      "text": "Jie Cai, Donghee Yvette Wohn, and Mashael Almoqbel. 2021. Moderation visibility: Mapping the strategies of volunteer moderators in live streaming micro communities. In ACM International Conference on Interactive Media Experiences. 61–72.",
      "doi": "10.1145/3452918.3458796"
    },
    {
      "text": "Kelly Caine. 2016. Local standards for sample size at CHI. In Proceedings of the 2016 CHI conference on human factors in computing systems. 981–992.",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Robyn Caplan and Tarleton Gillespie. 2020. Tiered governance and demonetization: The shifting terms of labor and compensation in the platform economy. Social Media+ Society 6, 2 (2020), 2056305120936636.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Jessica Annette Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. # thyghgapp: Instagram content moderation and lexical variation in pro-eating disorder communities. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. 1201–1213.",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Eshwar Chandrasekharan, Shagun Jhaver, Amy Bruckman, and Eric Gilbert. 2022. Quarantined! Examining the effects of a community-wide moderation intervention on Reddit. ACM Transactions on Computer-Human Interaction (TOCHI) 29, 4(2022), 1–26.",
      "doi": "10.1145/3490499"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. sage.",
      "doi": ""
    },
    {
      "text": "Fatih Çömlekçi. 2019. Custodians of the internet: Platforms, content moderation, and the hidden decisions that shape social media. Communication Today 10, 1 (2019), 165–166.",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Tarleton Gillespie. 2016. What is a flag for? Social media reporting tools and the vocabulary of complaint. New Media & Society 18, 3 (2016), 410–428.",
      "doi": ""
    },
    {
      "text": "Maral Dadvar and Franciska De Jong. 2012. Cyberbullying detection: a step toward a safer internet yard. In Proceedings of the 21st International Conference on World Wide Web. 121–126.",
      "doi": "10.1145/2187980.2187995"
    },
    {
      "text": "Karthik Dinakar, Roi Reichart, and Henry Lieberman. 2011. Modeling the detection of textual cyberbullying. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 5. 11–17.",
      "doi": ""
    },
    {
      "text": "Bryan Dosono and Bryan Semaan. 2019. Moderation practices as emotional labor in sustaining online communities: The case of AAPI identity work on Reddit. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300372"
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I\" like\" it, then I hide it: Folk Theories of Social Feeds. In Proceedings of the 2016 cHI conference on human factors in computing systems. 2371–2382.",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Jessica L Feuston, Alex S Taylor, and Anne Marie Piper. 2020. Conformity of eating disorders through content moderation. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–28.",
      "doi": "10.1145/3392845"
    },
    {
      "text": "Colin Ford, Dan Gardner, Leah Elaine Horgan, Calvin Liu, AM Tsaasan, Bonnie Nardi, and Jordan Rickman. 2017. Chat speed op pogchamp: Practices of coherence in massive twitch chat. In Proceedings of the 2017 CHI conference extended abstracts on human factors in computing systems. 858–871.",
      "doi": "10.1145/3027063.3052765"
    },
    {
      "text": "Guo Freeman and Divine Maloney. 2021. Body, avatar, and me: The presentation and perception of self in social virtual reality. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–27.",
      "doi": "10.1145/3432938"
    },
    {
      "text": "Guo Freeman, Samaneh Zamanifard, Divine Maloney, and Dane Acena. 2022. Disturbing the Peace: Experiencing and Mitigating Emerging Harassment in Social Virtual Reality. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1(2022), 1–30.",
      "doi": "10.1145/3512932"
    },
    {
      "text": "Dennis Friess, Marc Ziegele, and Dominique Heinbach. 2021. Collective civic moderation for deliberation? Exploring the links between citizens’ organized engagement in comment sections and the deliberative quality of online discussions. Political Communication 38, 5 (2021), 624–646.",
      "doi": ""
    },
    {
      "text": "Robert Gorwa, Reuben Binns, and Christian Katzenbach. 2020. Algorithmic content moderation: Technical and political challenges in the automation of platform governance. Big Data & Society 7, 1 (2020), 2053951719897945.",
      "doi": ""
    },
    {
      "text": "James Grimmelmann. 2015. The virtues of moderation. Yale JL & Tech. 17(2015), 42.",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Daniel Delmonaco, Peipei Nie, and Andrea Wegner. 2021. Disproportionate removals and differing content moderation experiences for conservative, transgender, and black social media users: Marginalization and moderation gray areas. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–35.",
      "doi": "10.1145/3479610"
    },
    {
      "text": "Qinglai He, Yili Kevin Hong, and TS Raghu. 2022. The Effects of Machine-powered Content Modereation: An Empirical Study on Reddit. In 55th Hawaii International Conference on System Sciences (HICSS).",
      "doi": ""
    },
    {
      "text": "Manoel Horta Ribeiro, Shagun Jhaver, Savvas Zannettou, Jeremy Blackburn, Gianluca Stringhini, Emiliano De Cristofaro, and Robert West. 2021. Do platform migrations compromise content moderation? evidence from r/the_donald and r/incels. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–24.",
      "doi": "10.1145/3476057"
    },
    {
      "text": "Shagun Jhaver, Darren Scott Appling, Eric Gilbert, and Amy Bruckman. 2019. \" Did you suspect the post would be removed?\" Understanding user reactions to content removals on Reddit. Proceedings of the ACM on human-computer interaction 3, CSCW(2019), 1–33.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Amy Bruckman, and Eric Gilbert. 2019. Does transparency in moderation really matter? User behavior after content removal explanations on reddit. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Quan Ze Chen, Detlef Knauss, and Amy X Zhang. 2022. Designing Word Filter Tools for Creator-led Comment Moderation. In CHI Conference on Human Factors in Computing Systems. 1–21.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Sucheta Ghoshal, Amy Bruckman, and Eric Gilbert. 2018. Online harassment and content moderation: The case of blocklists. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 2(2018), 1–33.",
      "doi": "10.1145/3185593"
    },
    {
      "text": "Jialun Aaron Jiang, Charles Kiene, Skyler Middler, Jed R Brubaker, and Casey Fiesler. 2019. Moderation challenges in voice-based online communities on discord. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359157"
    },
    {
      "text": "Jialun Aaron Jiang, Peipei Nie, Jed R Brubaker, and Casey Fiesler. 2022. A Trade-off-centered Framework of Content Moderation. arXiv preprint arXiv:2206.03450(2022).",
      "doi": ""
    },
    {
      "text": "Prerna Juneja, Deepika Rama Subramanian, and Tanushree Mitra. 2020. Through the looking glass: Study of transparency in Reddit’s moderation practices. Proceedings of the ACM on Human-Computer Interaction 4, GROUP(2020), 1–35.",
      "doi": "10.1145/3375197"
    },
    {
      "text": "Sara Kiesler, Robert Kraut, Paul Resnick, and Aniket Kittur. 2012. Regulating behavior in online communities. Building successful online communities: Evidence-based social design 1 (2012), 4–2.",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2020. Mediating community-AI interaction through situated explanation: the case of AI-Led moderation. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–27.",
      "doi": "10.1145/3415173"
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2021. Flag and Flaggability in Automated Moderation: The Case of Reporting Toxic Behavior in an Online Game Community. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445279"
    },
    {
      "text": "Cliff Lampe and Paul Resnick. 2004. Slash (dot) and burn: distributed moderation in a large online conversation space. In Proceedings of the SIGCHI conference on Human factors in computing systems. 543–550.",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Saul Levmore and Martha Craven Nussbaum. 2012. The offensive Internet: Speech, privacy, and reputation. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Emma Llansó, Joris Van Hoboken, Paddy Leerssen, and Jaron Harambam. 2020. Artificial intelligence, content moderation, and freedom of expression. (2020).",
      "doi": ""
    },
    {
      "text": "Renkai Ma and Yubo Kou. 2021. \" How advertiser-friendly is my video?\": YouTuber’s Socioeconomic Interactions with Algorithmic Content Moderation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": "10.1145/3479573"
    },
    {
      "text": "Aaron Mak. 2022. I Was a Bouncer in the Metaverse. https://slate.com/technology/2022/05/metaverse-content-moderation-virtual-reality-bouncers.html",
      "doi": ""
    },
    {
      "text": "Sampada Marathe and S Shyam Sundar. 2011. What drives customization? Control or identity?. In Proceedings of the SIGCHI conference on human factors in computing systems. 781–790.",
      "doi": "10.1145/1978942.1979056"
    },
    {
      "text": "Adrienne Massanari. 2017. # Gamergate and The Fappening: How Reddit’s algorithm, governance, and culture support toxic technocultures. New media & society 19, 3 (2017), 329–346.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping pro-social interaction in VR: an emerging design framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Ninareh Mehrabi, Fred Morstatter, Nripsuta Saxena, Kristina Lerman, and Aram Galstyan. 2021. A Survey on Bias and Fairness in Machine Learning. Comput. Surveys 54, 6 (July 2021), 115:1–115:35. https://doi.org/10.1145/3457607",
      "doi": "10.1145/3457607"
    },
    {
      "text": "Sharan B Merriam and Elizabeth J Tisdell. 2015. Qualitative research: A guide to design and implementation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Meta. 2022. Code of conduct for virtual experiences. https://www.meta.com/help/quest/articles/accounts/privacy-information-and-settings/code-of-conduct-for-virtual-experiences/",
      "doi": ""
    },
    {
      "text": "Meta. 2022. Notification of warning or suspension of your meta or oculus account. https://www.meta.com/help/quest/articles/accounts/account-settings-and-management/received-warning-or-suspension-notification-on-account/",
      "doi": ""
    },
    {
      "text": "Meta. 2022. Reporting someone on Meta Quest and rift S. https://www.meta.com/help/quest/articles/accounts/privacy-information-and-settings/reporting-someone-on-oculus/",
      "doi": ""
    },
    {
      "text": "Meta. 2022. Safety and privacy in Meta Horizon Worlds. https://www.meta.com/help/quest/articles/horizon/safety-and-privacy-in-horizon-worlds/index-safety-and-privacy/",
      "doi": ""
    },
    {
      "text": "Meta. 2022. Someone in my party is Bothering me. https://www.meta.com/help/quest/articles/in-vr-experiences/social-features-and-sharing/someone-in-my-party-is-bothering-me/",
      "doi": ""
    },
    {
      "text": "Maria D Molina and S Shyam Sundar. 2022. Does distrust in humans predict greater trust in AI? Role of individual differences in user responses to content moderation. New Media & Society(2022), 14614448221103534.",
      "doi": ""
    },
    {
      "text": "Thomas O’Neill, Nathan McNeese, Amy Barron, and Beau Schelble. 2022. Human–autonomy teaming: A review and analysis of the empirical literature. Human factors 64, 5 (2022), 904–938.",
      "doi": ""
    },
    {
      "text": "Jessica A Pater, Moon K Kim, Elizabeth D Mynatt, and Casey Fiesler. 2016. Characterizations of online harassment: Comparing policies across social media platforms. In Proceedings of the 19th international conference on supporting group work. 369–374.",
      "doi": "10.1145/2957276.2957297"
    },
    {
      "text": "Jenny Preece and Diane Maloney-Krichmar. 2003. Online communities: focusing on sociability and usability. Handbook of human-computer interaction(2003), 596–620.",
      "doi": ""
    },
    {
      "text": "Kim Renfro. 2016. For whom the troll trolls: A day in the life of a Reddit moderator. Business Insider (2016).",
      "doi": ""
    },
    {
      "text": "Kelly Reynolds, April Kontostathis, and Lynne Edwards. 2011. Using machine learning to detect cyberbullying. In 2011 10th International Conference on Machine learning and applications and workshops, Vol. 2. IEEE, 241–244.",
      "doi": "10.1109/ICMLA.2011.152"
    },
    {
      "text": "Sarah T Roberts. 2016. Commercial content moderation: Digital laborers’ dirty work. (2016).",
      "doi": ""
    },
    {
      "text": "Shikhar Sakhuja and Robin Cohen. 2020. RideSafe: Detecting Sexual Harassment in Rideshares. In Canadian Conference on Artificial Intelligence. Springer, 464–469.",
      "doi": ""
    },
    {
      "text": "Joseph Seering. 2020. Reconsidering community self-moderation: the role of research in supporting community-based models for online content moderation. Proceedings of the ACM on Human-Computer Interaction 4 (2020), 107.",
      "doi": "10.1145/3415178"
    },
    {
      "text": "Joseph Seering, Geoff Kaufman, and Stevie Chancellor. 2022. Metaphors in moderation. New Media & Society 24, 3 (2022), 621–640.",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Robert Kraut, and Laura Dabbish. 2017. Shaping pro and anti-social behavior on twitch through moderation and example-setting. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 111–125.",
      "doi": "10.1145/2998181.2998277"
    },
    {
      "text": "Joseph Seering, Tony Wang, Jina Yoon, and Geoff Kaufman. 2019. Moderator engagement and community development in the age of algorithms. New Media & Society 21, 7 (2019), 1417–1443.",
      "doi": ""
    },
    {
      "text": "Ketaki Shriram and Raz Schwartz. 2017. All are welcome: Using VR ethnography to explore harassment behavior in immersive social virtual reality. In 2017 IEEE Virtual Reality (VR). IEEE, 225–226.",
      "doi": ""
    },
    {
      "text": "Tanner Skousen, Hani Safadi, Colleen Young, Elena Karahanna, Sami Safadi, Fouad Chebib, 2020. Successful moderation in online patient communities: inductive case study. Journal of medical Internet research 22, 3 (2020), e15983.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Daniel Pérez Marcos, Henrik Ehrsson, and Maria V Sanchez-Vives. 2009. Inducing illusory ownership of a virtual body. Frontiers in neuroscience(2009), 29.",
      "doi": ""
    },
    {
      "text": "Weilun Soon. 2022. A researcher’s avatar was sexually assaulted on a metaverse platform owned by Meta. https://www.businessinsider.com/researcher-claims-her-avatar-was-raped-on-metas-metaverse-platform-2022-5",
      "doi": ""
    },
    {
      "text": "Hannah Sparks. 2021. Woman claims she was virtually ‘groped’ in Meta’s VR metaverse. https://nypost.com/2021/12/17/woman-claims-she-was-virtually-groped-in-meta-vr-metaverse/",
      "doi": ""
    },
    {
      "text": "Tim Squirrell. 2019. Platform dialectics: The relationships between volunteer moderators and end users on reddit. New Media & Society 21, 9 (2019), 1910–1927.",
      "doi": ""
    },
    {
      "text": "Miriah Steiger, Timir J Bharucha, Sukrit Venkatagiri, Martin J Riedl, and Matthew Lease. 2021. The psychological well-being of content moderators: the emotional labor of commercial moderation and avenues for improving support. In Proceedings of the 2021 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3411764.3445092"
    },
    {
      "text": "Wessel Stoop, Florian Kunneman, Antal van den Bosch, and Ben Miller. 2019. Detecting harassment in real-time as conversations develop. In Proceedings of the Third Workshop on Abusive Language Online. 19–24.",
      "doi": ""
    },
    {
      "text": "Anselm L Strauss. 1987. Qualitative analysis for social scientists. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "S Shyam Sundar and Sampada S Marathe. 2010. Personalization versus customization: The importance of agency, privacy, and power usage. Human communication research 36, 3 (2010), 298–322.",
      "doi": ""
    },
    {
      "text": "Hibby Thach, Samuel Mayworm, Daniel Delmonaco, and Oliver Haimson. 2022. (In) visible moderation: A digital ethnography of marginalized users and content moderation on Twitch and Reddit. new media & society(2022), 14614448221109804.",
      "doi": ""
    },
    {
      "text": "Dias Oliva Thiago, Antonialli Dennys Marcelo, and Alessandra Gomes. 2021. Fighting hate speech, silencing drag queens? artificial intelligence in content moderation and risks to lgbtq voices online. Sexuality & culture 25, 2 (2021), 700–732.",
      "doi": ""
    },
    {
      "text": "Kristen Vaccaro, Christian Sandvig, and Karrie Karahalios. 2020. \" At the End of the Day Facebook Does What ItWants\" How Users Experience Contesting Algorithmic Content Moderation. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–22.",
      "doi": ""
    },
    {
      "text": "Kathleen Van Royen, Karolien Poels, Heidi Vandebosch, and Philippe Adam. 2017. “Thinking before posting?” Reducing cyber harassment on social networking sites through a reflective message. Computers in human behavior 66 (2017), 345–352.",
      "doi": "10.1016/j.chb.2016.09.040"
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying women’s experiences with and strategies for mitigating negative effects of online harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 1231–1245.",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "VRChat. 2022. Community guidelines. https://hello.vrchat.com/community-guidelines#: :text=VRChat%20Moderation%20will%20take%20action,boards%2C%20and%20other%20online%20portals.",
      "doi": ""
    },
    {
      "text": "VRChat. 2022. Submit a request – VRChat. https://help.vrchat.com/hc/en-us/requests/new",
      "doi": ""
    },
    {
      "text": "VRChat. 2022. Terms of Service. https://hello.vrchat.com/legal",
      "doi": ""
    },
    {
      "text": "Vryunji, Qian Wen, and Harrison Ferrone. 2022. Community standards - altspacevr. https://learn.microsoft.com/en-us/windows/mixed-reality/altspace-vr/community/community-standards",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Elizabeth Churchill, Pattie Maes, Xiangmin Fan, Ben Shneiderman, Yuanchun Shi, and Qianying Wang. 2020. From Human-Human Collaboration to Human-AI Collaboration: Designing AI Systems That Can Work Together with People. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3334480.3381069",
      "doi": "10.1145/3334480.3381069"
    },
    {
      "text": "Leijie Wang and Haiyi Zhu. 2022. How are ML-Based Online Content Moderation Systems Actually Used? Studying Community Size, Local Activity, and Disparate Treatment. In 2022 ACM Conference on Fairness, Accountability, and Transparency. 824–838.",
      "doi": "10.1145/3531146.3533147"
    },
    {
      "text": "Sai Wang. 2021. Moderating uncivil user comments by humans or machines? The effects of moderation agent on perceptions of bias and credibility in news content. Digital journalism 9, 1 (2021), 64–83.",
      "doi": ""
    },
    {
      "text": "Amy K Way, Robin Kanak Zwier, and Sarah J Tracy. 2015. Dialogic interviewing and flickers of transformation: An examination and delineation of interactional strategies that promote participant self-reflexivity. Qualitative Inquiry 21, 8 (2015), 720–731.",
      "doi": ""
    },
    {
      "text": "Qian Wen. 2022. Event host guide - altspacevr. https://learn.microsoft.com/en-us/windows/mixed-reality/altspace-vr/explore/host-events?source=recommendations",
      "doi": ""
    },
    {
      "text": "Qian Wen. 2022. User safety and moderation - ALTSPACEVR. https://learn.microsoft.com/en-us/windows/mixed-reality/altspace-vr/user-safety",
      "doi": ""
    },
    {
      "text": "Qian Wen and Harrison Ferrone. 2022. Host tools overview - altspacevr. https://learn.microsoft.com/en-us/windows/mixed-reality/altspace-vr/tutorials/host-tools-overview#safety-and-moderation-tools",
      "doi": ""
    },
    {
      "text": "Ruth L Williams and Joseph Cothrel. 2000. Four smart ways to run online communities. MIT Sloan Management Review 41, 4 (2000), 81.",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn. 2019. Volunteer moderators in twitch micro communities: How they get involved, the roles they play, and the emotional labor they experience. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300390"
    },
    {
      "text": "Bingjie Yu, Joseph Seering, Katta Spiel, and Leon Watts. 2020. \" Taking Care of a Fruit Tree\": Nurturing as a Layer of Concern in Online Community Moderation. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3334480.3383009"
    },
    {
      "text": "Andrew Zolides. 2021. Gender moderation and moderating gender: Sexual content policies in Twitch’s community guidelines. New Media & Society 23, 10 (2021), 2999–3015.",
      "doi": ""
    }
  ]
}