{
  "doi": "10.1145/3544548.3581172",
  "title": "PumpVR: Rendering the Weight of Objects and Avatars through Liquid Mass Transfer in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Perceiving objects’ and avatars’ weight in Virtual Reality (VR) is important to understand their properties and naturally interact with them. However, commercial VR controllers cannot render weight. Controllers presented by previous work are single-handed, slow, or only render a small mass. In this paper, we present PumpVR that renders weight by varying the controllers’ mass according to the properties of virtual objects or bodies. Using a bi-directional pump and solenoid valves, the system changes the controllers’ absolute weight by transferring water in or out with an average error of less than 5%. We implemented VR use cases with objects and avatars of different weights to compare the system with standard controllers. A study with 24 participants revealed significantly higher realism and enjoyment when using PumpVR to interact with virtual objects. Using the system to render body weight had significant effects on virtual embodiment, perceived exertion, and self-perceived fitness.",
  "authors": [
    {
      "name": "Alexander Kalus",
      "institution": "University of Regensburg, Germany",
      "img": "/do/10.1145/contrib-99659463729/rel-imgonly/unbenannt3.png",
      "acmid": "99659463729",
      "orcid": "0000-0002-9464-8427"
    },
    {
      "name": "Martin Kocur",
      "institution": "University of Applied Sciences Upper Austria, Austria",
      "img": "/do/10.1145/contrib-99659210804/rel-imgonly/mi-teamfotos-martin-kocur-2019_small.jpg",
      "acmid": "99659210804",
      "orcid": "0000-0003-3077-6267"
    },
    {
      "name": "Johannes Klein",
      "institution": "University of Regensburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781775",
      "orcid": "0000-0003-2629-0926"
    },
    {
      "name": "Manuel Mayer",
      "institution": "Media Informatics Group, University of Regensburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660648898",
      "orcid": "0000-0002-8950-9801"
    },
    {
      "name": "Niels Henze",
      "institution": "University of Regensburg, Germany",
      "img": "/do/10.1145/contrib-81350574049/rel-imgonly/nielshenze.jpg",
      "acmid": "81350574049",
      "orcid": "0000-0002-5702-6290"
    }
  ],
  "references": [
    {
      "text": "Tomohiro Amemiya and Taro Maeda. 2008. Asymmetric Oscillation Distorts the Perceived Heaviness of Handheld Objects. IEEE Transactions on Haptics 1, 1 (2008), 9–18. https://doi.org/10.1109/TOH.2008.5",
      "doi": "10.1109/TOH.2008.5"
    },
    {
      "text": "Rosa María Baños, Cristina Botella, Azucena García-Palacios, Helena Villa Martín, Concepción Perpiñá, and Mariano Luis Alcañiz Raya. 2000. Presence and Reality Judgment in Virtual Environments: A Unitary Construct?Cyberpsychology Behav. Soc. Netw. 3 (2000), 327–335.",
      "doi": ""
    },
    {
      "text": "Gunnar A V Borg. 1982. Psychophysical bases of perceived exertion.Medicine and science in sports and exercise 14 (1982), 377–81. Issue 5. https://doi.org/10.1249/00005768-198205000-00012",
      "doi": ""
    },
    {
      "text": "Eric E Brodie and Helen E Ross. 1984. Sensorimotor mechanisms in weight discrimination. Perception & Psychophysics 36 (1984), 477–481. Issue 5. https://doi.org/10.3758/BF03207502",
      "doi": ""
    },
    {
      "text": "Gavin Buckingham. 2014. Getting a grip on heaviness perception: a review of weight illusions and their probable causes. Experimental Brain Research 232 (2014), 1623–1629. Issue 6. https://doi.org/10.1007/s00221-014-3926-9",
      "doi": ""
    },
    {
      "text": "Chih-Hao Cheng, Chia-Chi Chang, Ying-Hsuan Chen, Ying-Li Lin, Jing-Yuan Huang, Ping-Hsuan Han, Ju-Chun Ko, and Lai-Chung Lee. 2018. GravityCup: A Liquid-Based Haptics for Simulating Dynamic Weight in Virtual Reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology(VRST ’18). Association for Computing Machinery, New York, NY, USA, 2 pages. https://doi.org/10.1145/3281505.3281569",
      "doi": "10.1145/3281505.3281569"
    },
    {
      "text": "Maria Christofi and Despina Michael-Grigoriou. 2017. Virtual reality for inducing empathy and reducing prejudice towards stigmatized groups: A survey. In 2017 23rd International Conference on Virtual System & Multimedia (VSMM). IEEE, Dublin, 1–8. https://doi.org/10.1109/VSMM.2017.8346252",
      "doi": ""
    },
    {
      "text": "D. Delignières, A. Marcellini, J. Brisswalter, and P. Legros. 1994. Self-Perception of Fitness and Personality Traits. Perceptual and Motor Skills 78, 3 (1994), 843–851. https://doi.org/10.1177/003151259407800333 arXiv:https://doi.org/10.1177/003151259407800333PMID: 8084701.",
      "doi": ""
    },
    {
      "text": "Massimiliano Di Luca and Arash Mahnan. 2019. Perceptual Limits of Visual-Haptic Simultaneity in Virtual Reality Interactions. In 2019 IEEE World Haptics Conference (WHC). IEEE, Tokyo, 67–72. https://doi.org/10.1109/WHC.2019.8816173",
      "doi": ""
    },
    {
      "text": "Anton J M Dijker. 2014. The role of expectancies in the size-weight illusion: A review of theoretical and empirical arguments and a new explanation. Psychonomic Bulletin & Review 21 (2014), 1404–1414. Issue 6. https://doi.org/10.3758/s13423-014-0634-1",
      "doi": ""
    },
    {
      "text": "Nina Döllinger, Carolin Wienrich, Erik Wolf, Mario Botsch, and Marc Erich Latoschik. 2019. ViTraS - Virtual Reality Therapy by Stimulation of Modulated Body Image - Project Outline. In Mensch und Computer 2019 - Workshopband. Gesellschaft für Informatik e.V., Bonn, 606–611. https://doi.org/10.18420/muc2019-ws-633",
      "doi": ""
    },
    {
      "text": "E R Ferrè, T Frett, P Haggard, and M R Longo. 2019. A gravitational contribution to perceived body weight. Scientific Reports 9(2019), 11448. Issue 1. https://doi.org/10.1038/s41598-019-47663-x",
      "doi": ""
    },
    {
      "text": "Daniel Fink and Jan Mayes. 2021. Too loud! Non-occupational noise exposure causes hearing loss. Proceedings of Meetings on Acoustics 43 (2021), 13 pages. Issue 1. https://doi.org/10.1121/2.0001436",
      "doi": ""
    },
    {
      "text": "Adrien Girard, Maud Marchal, Florian Gosselin, Anthony Chabrier, François Louveau, and Anatole Lécuyer. 2016. HapTip: Displaying Haptic Shear Forces at the Fingertips for Multi-Finger Interaction in Virtual Environments. Frontiers in ICT 3(2016), 15 pages. https://doi.org/10.3389/fict.2016.00006",
      "doi": ""
    },
    {
      "text": "James M Goodman and Sliman J Bensmaia. 2002. The Neural Basis of Haptic Perception. John Wiley & Sons, Ltd, Hoboken, NJ, 537–584. https://doi.org/10.1002/9781119170174.epcn205",
      "doi": ""
    },
    {
      "text": "David Halbhuber, Jakob Fehle, Alexander Kalus, Konstantin Seitz, Martin Kocur, Thomas Schmidt, and Christian Wolff. 2019. The Mood Game - How to Use the Player’s Affective State in a Shoot’em up Avoiding Frustration and Boredom. In Proceedings of Mensch Und Computer 2019 (Hamburg, Germany) (MuC’19). Association for Computing Machinery, New York, NY, USA, 867–870. https://doi.org/10.1145/3340764.3345369",
      "doi": "10.1145/3340764.3345369"
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor’s Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174099",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Anne Herrmann-Werner, Teresa Loda, Lisa M Wiesner, Rebecca Sarah Erschens, Florian Junne, and Stephan Zipfel. 2019. Is an obesity simulation suit in an undergraduate medical communication class a valuable teaching tool? A cross-sectional proof of concept study. BMJ Open 9, 8 (2019), 7 pages. https://doi.org/10.1136/bmjopen-2019-029738 arXiv:https://bmjopen.bmj.com/content/9/8/e029738.full.pdf",
      "doi": ""
    },
    {
      "text": "Han-Chung Huang, May-Kuen Wong, Ju Lu, Wei-Fan Huang, and Ching-I Teng. 2017. Can Using Exergames Improve Physical Fitness? A 12-Week Randomized Controlled Trial. Comput. Hum. Behav. 70, C (may 2017), 310–316. https://doi.org/10.1016/j.chb.2016.12.086",
      "doi": "10.1016/j.chb.2016.12.086"
    },
    {
      "text": "Robin Hunicke. 2005. The Case for Dynamic Difficulty Adjustment in Games. In Proceedings of the 2005 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology(Valencia, Spain) (ACE ’05). Association for Computing Machinery, New York, NY, USA, 429–433. https://doi.org/10.1145/1178477.1178573",
      "doi": "10.1145/1178477.1178573"
    },
    {
      "text": "Lasse Jensen and Flemming Konradsen. 2018. A review of the use of virtual reality head-mounted displays in education and training. Education and Information Technologies 23 (2018), 1515–1529. Issue 4. https://doi.org/10.1007/s10639-017-9676-0",
      "doi": "10.1007/s10639-017-9676-0"
    },
    {
      "text": "Lynette A. Jones. 1986. Perception of force and weight: Theory and research.Psychological bulletin 100 (1986), 29–42. Issue 1.",
      "doi": ""
    },
    {
      "text": "Alexander Kalus, Martin Kocur, and Niels Henze. 2022. Towards Inducing Weight Perception in Virtual Reality Through a Liquid-based Haptic Controller. In AVI ’22 - Workshop on Visuo-Haptic Interaction. 5 pages. https://doi.org/10.5283/epub.53628",
      "doi": ""
    },
    {
      "text": "Alexander Kalus, Martin Kocur, Niels Henze, Johanna Bogon, and Valentin Schwind. 2022. How to Induce a Physical and Virtual Rubber Hand Illusion. In Proceedings of Mensch Und Computer 2022 (Darmstadt, Germany) (MuC ’22). Association for Computing Machinery, New York, NY, USA, 580–583. https://doi.org/10.1145/3543758.3547512",
      "doi": "10.1145/3543758.3547512"
    },
    {
      "text": "Konstantina Kilteni, Antonella Maselli, Konrad P Kording, and Mel Slater. 2015. Over my fake body: body ownership illusions for studying the multisensory basis of own-body perception. Frontiers in Human Neuroscience 9 (2015), 141. https://doi.org/10.3389/fnhum.2015.00141",
      "doi": ""
    },
    {
      "text": "Martin Kocur, Johanna Bogon, Manuel Mayer, Miriam Witte, Amelie Karber, Niels Henze, and Valentin Schwind. 2022. Sweating Avatars Decrease Perceived Exertion and Increase Perceived Endurance While Cycling in Virtual Reality. In Proceedings of the 28th ACM Symposium on Virtual Reality Software and Technology (Tsukuba, Japan) (VRST ’22). Association for Computing Machinery, New York, NY, USA, Article 29, 12 pages. https://doi.org/10.1145/3562939.3565628",
      "doi": "10.1145/3562939.3565628"
    },
    {
      "text": "Martin Kocur, Florian Habler, Valentin Schwind, Paweł W. Woźniak, Christian Wolff, and Niels Henze. 2021. Physiological and Perceptual Responses to Athletic Avatars While Cycling in Virtual Reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 519, 18 pages. https://doi.org/10.1145/3411764.3445160",
      "doi": "10.1145/3411764.3445160"
    },
    {
      "text": "Martin Kocur, Alexander Kalus, Johanna Bogon, Niels Henze, Christian Wolff, and Valentin Schwind. 2022. The Rubber Hand Illusion in Virtual Reality and the Real World - Comparable but Different. In Proceedings of the 28th ACM Symposium on Virtual Reality Software and Technology (Tsukuba, Japan) (VRST ’22). Association for Computing Machinery, New York, NY, USA, Article 31, 12 pages. https://doi.org/10.1145/3562939.3565614",
      "doi": "10.1145/3562939.3565614"
    },
    {
      "text": "Martin Kocur, Melanie Kloss, Valentin Schwind, Christian Wolff, and Niels Henze. 2020. Flexing Muscles in Virtual Reality: Effects of Avatars’ Muscular Appearance on Physical Performance. Association for Computing Machinery, New York, NY, USA, 193–205. https://doi.org/10.1145/3410404.3414261",
      "doi": "10.1145/3410404.3414261"
    },
    {
      "text": "Martin Kocur, Philipp Schauhuber, Valentin Schwind, Christian Wolff, and Niels Henze. 2020. The Effects of Self- and External Perception of Avatars on Cognitive Task Performance in Virtual Reality. In 26th ACM Symposium on Virtual Reality Software and Technology (Virtual Event, Canada) (VRST ’20). Association for Computing Machinery, New York, NY, USA, Article 27, 11 pages. https://doi.org/10.1145/3385956.3418969",
      "doi": "10.1145/3385956.3418969"
    },
    {
      "text": "Elena Kokkinara and Mel Slater. 2014. Measuring the Effects through Time of the Influence of Visuomotor and Visuotactile Synchronous Stimulation on a Virtual Body Ownership Illusion. Perception 43, 1 (2014), 43–58. https://doi.org/10.1068/p7545",
      "doi": ""
    },
    {
      "text": "James R Lackner and Paul Dizio. 1993. Multisensory, Cognitive, and Motor Influences on Human Spatial Orientation in Weightlessness. Journal of Vestibular Research 3 (1993), 361–372. https://doi.org/10.3233/VES-1993-3315",
      "doi": ""
    },
    {
      "text": "Jun Lee, Jee-In Kim, and HyungSeok Kim. 2019. Force Arrow 2: A Novel Pseudo-Haptic Interface for Weight Perception in Lifting Virtual Objects. In 2019 IEEE International Conference on Big Data and Smart Computing (BigComp). IEEE, Kyoto, 1–8. https://doi.org/10.1109/BIGCOMP.2019.8679400",
      "doi": ""
    },
    {
      "text": "Woan Ning Lim, Kian Meng Yap, Yunli Lee, Chyanna Wee, and Ching Chiuan Yen. 2021. A Systematic Review of Weight Perception in Virtual Reality: Techniques, Challenges, and Road Ahead. IEEE Access 9(2021), 163253–163283. https://doi.org/10.1109/ACCESS.2021.3131525",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1471–1482. https://doi.org/10.1145/3025453.3025600",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "D.I. McCloskey. 1974. Muscular and cutaneous mechanisms in the estimation of the weights of grasped objects. Neuropsychologia 12, 4 (1974), 513–520. https://doi.org/10.1016/0028-3932(74)90081-5",
      "doi": ""
    },
    {
      "text": "M. Meehan, S. Razzaque, M.C. Whitton, and F.P. Brooks. 2003. Effect of latency on presence in stressful virtual environments. In IEEE Virtual Reality, 2003. Proceedings.IEEE, Los Angeles, 141–148. https://doi.org/10.1109/VR.2003.1191132",
      "doi": ""
    },
    {
      "text": "Sarah Messiah. 2013. Body Mass Index. In Encyclopedia of Behavioral Medicine, Marc D Gellman and J Rick Turner (Eds.). Springer New York, New York, NY, 247–249. https://doi.org/10.1007/978-1-4419-1005-9_729",
      "doi": ""
    },
    {
      "text": "Albert Ng, Michelle Annett, Paul Dietz, Anoop Gupta, and Walter F. Bischof. 2014. In the Blink of an Eye: Investigating Latency Perception during Stylus Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1103–1112. https://doi.org/10.1145/2556288.2557037",
      "doi": "10.1145/2556288.2557037"
    },
    {
      "text": "Jakob Nielsen. 1994. Usability Engineering. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/529793"
    },
    {
      "text": "Ryuma Niiyama, Lining Yao, and Hiroshi Ishii. 2014. Weight and Volume Changing Device with Liquid Metal Transfer. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction(TEI ’14). Association for Computing Machinery, New York, NY, USA, 49–52. https://doi.org/10.1145/2540930.2540953",
      "doi": "10.1145/2540930.2540953"
    },
    {
      "text": "Jean-Marie Normand, Elias Giannopoulos, Bernhard Spanlang, and Mel Slater. 2011. Multisensory stimulation can induce an illusion of larger belly size in immersive virtual reality. PloS one 6, 1 (2011), e16128. https://doi.org/10.1371/journal.pone.0016128",
      "doi": ""
    },
    {
      "text": "Ivelina V. Piryankova, Hong Yu Wong, Sally A. Linkenauger, Catherine Stinson, Matthew R. Longo, Heinrich H. Bülthoff, and Betty J. Mohler. 2014. Owning an overweight or underweight body: distinguishing the physical, experienced and virtual body. PloS one 9, 8 (2014), e103428. https://doi.org/10.1371/journal.pone.0103428",
      "doi": ""
    },
    {
      "text": "Myrthe A. Plaisier, Irene A. Kuling, Eli Brenner, and Jeroen B. J. Smeets. 2019. When Does One Decide How Heavy an Object Feels While Picking It Up?Psychological Science 30, 6 (2019), 822–829. https://doi.org/10.1177/0956797619837981 arXiv:https://doi.org/10.1177/0956797619837981PMID: 30917092.",
      "doi": ""
    },
    {
      "text": "Michael Rietzler, Florian Geiselhart, Jan Gugenheimer, and Enrico Rukzio. 2018. Breaking the Tracking: Enabling Weight Perception Using Perceivable Tracking Offsets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173702",
      "doi": "10.1145/3173574.3173702"
    },
    {
      "text": "Daniel Roth and Marc Erich Latoschik. 2020. Construction of the Virtual Embodiment Questionnaire (VEQ). IEEE Transactions on Visualization and Computer Graphics 26, 12(2020), 3546–3556. https://doi.org/10.1109/TVCG.2020.3023603",
      "doi": ""
    },
    {
      "text": "Richard Ryan and Edward Deci. 2000. Self-Determination Theory and the Facilitation of Intrinsic Motivation, Social Development, and Well-Being. American Psychologist 55 (02 2000), 68–78. Issue 1. https://doi.org/10.1037/0003-066X.55.1.68",
      "doi": ""
    },
    {
      "text": "T A Ryan. 1940. Interrelations of sensory systems in perception.Psychological Bulletin 37 (1940), 659–698. https://doi.org/10.1037/h0060252",
      "doi": ""
    },
    {
      "text": "Majed Samad, Elia Gatti, Anne Hermes, Hrvoje Benko, and Cesare Parise. 2019. Pseudo-Haptic Weight: Changing the Perceived Weight of Virtual Objects By Manipulating Control-Display Ratio. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300550",
      "doi": "10.1145/3290605.3300550"
    },
    {
      "text": "Natascha Sanders. 2022. Marco UP1-JR Reversible impeller pump 7.4 gpm – 28 l/min with on/off integrated switch (12 Volt). Retrieved January 19, 2023 from marco-pumps.shop/marco-up1-jr-reversible-impeller-pump-28-l-min-with-on-off-integrated-switch-12-volt-16201112",
      "doi": ""
    },
    {
      "text": "Erik Sikström, Amalia de Götzen, and Stefania Serafin. 2015. Self-characterstics and sound in immersive virtual reality — Estimating avatar weight from footstep sounds. In 2015 IEEE Virtual Reality (VR). IEEE, Arles, 283–284. https://doi.org/10.1109/VR.2015.7223406",
      "doi": ""
    },
    {
      "text": "Mel Slater, Daniel Pérez Marcos, Henrik Ehrsson, and Maria Sanchez-Vives. 2008. Towards a digital body: the virtual arm illusion. Frontiers in Human Neuroscience 2 (2008), 1–8. https://doi.org/10.3389/neuro.09.006.2008",
      "doi": ""
    },
    {
      "text": "Theophilus Teo, Fumihiko Nakamura, Maki Sugimoto, Adrien Verhulst, Gun A. Lee, Mark Billinghurst, and Matt Adcock. 2020. Feel It: Using Proprioceptive and Haptic Feedback for Interaction with Virtual Embodiment. In ACM SIGGRAPH 2020 Emerging Technologies (Virtual Event, USA) (SIGGRAPH ’20). Association for Computing Machinery, New York, NY, USA, Article 2, 2 pages. https://doi.org/10.1145/3388534.3407288",
      "doi": "10.1145/3388534.3407288"
    },
    {
      "text": "Anne Thaler, Michael N. Geuss, Simone C. Mölbert, Katrin E. Giel, Stephan Streuber, Javier Romero, Michael J. Black, and Betty J. Mohler. 2018. Body size estimation of self and others in females varying in BMI. PLOS ONE 13, 2 (02 2018), 1–24. https://doi.org/10.1371/journal.pone.0192152",
      "doi": ""
    },
    {
      "text": "Anne Thaler, Ivelina Piryankova, Jeanine K. Stefanucci, Sergi Pujades, Stephan de la Rosa, Stephan Streuber, Javier Romero, Michael J. Black, and Betty J. Mohler. 2018. Visual Perception and Evaluation of Photo-Realistic Self-Avatars From 3D Body Scans in Males and Females. Frontiers in ICT 5(2018), 1–14. https://doi.org/10.3389/fict.2018.00018",
      "doi": ""
    },
    {
      "text": "Manos Tsakiris. 2010. My body in the brain: A neurocognitive model of body-ownership. Neuropsychologia 48, 3 (2010), 703–712. https://doi.org/10.1016/j.neuropsychologia.2009.09.034",
      "doi": ""
    },
    {
      "text": "Femke E van Beek, Raymond J King, Casey Brown, Massimiliano Di Luca, and Sean Keller. 2021. Static Weight Perception Through Skin Stretch and Kinesthetic Information: Detection Thresholds, JNDs, and PSEs. IEEE Transactions on Haptics 14, 1 (2021), 20–31. https://doi.org/10.1109/TOH.2020.3009599",
      "doi": ""
    },
    {
      "text": "Anurag Sai Vempati, Harshit Khurana, Vojtech Kabelka, Simon Flueckiger, Roland Siegwart, and Paul Beardsley. 2019. A Virtual Reality Interface for an Autonomous Spray Painting UAV. IEEE Robotics and Automation Letters 4, 3 (2019), 2870–2877. https://doi.org/10.1109/LRA.2019.2922588",
      "doi": ""
    },
    {
      "text": "Adrien Verhulst, Jean-Marie Normand, Cindy Lombart, Maki Sugimoto, and Guillaume Moreau. 2018. Influence of Being Embodied in an Obese Virtual Body on Shopping Behavior and Products Perception in VR. Frontiers in Robotics and AI 5 (2018), 1–20. https://doi.org/10.3389/frobt.2018.00113",
      "doi": ""
    },
    {
      "text": "Thomas Waltemate, Dominik Gall, Daniel Roth, Mario Botsch, and Marc Erich Latoschik. 2018. The Impact of Avatar Personalization and Immersion on Virtual Body Ownership, Presence, and Emotional Response. IEEE Transactions on Visualization and Computer Graphics 24, 4(2018), 1643–1652. https://doi.org/10.1109/TVCG.2018.2794629",
      "doi": "10.1109/TVCG.2018.2794629"
    },
    {
      "text": "Xian Wang, Diego Monteiro, Lik-Hang Lee, Pan Hui, and Hai-Ning Liang. 2022. VibroWeight: Simulating Weight and Center of Gravity Changes of Objects in Virtual Reality for Enhanced Realism. In 2022 IEEE Haptics Symposium (HAPTICS). IEEE, Santa Barbara, 1–7. https://doi.org/10.1109/HAPTICS52432.2022.9765609",
      "doi": ""
    },
    {
      "text": "Robert B. Welch and David H. Warren. 1980. Immediate perceptual response to intersensory discrepancy.Psychological bulletin 88 3 (1980), 638–67.",
      "doi": ""
    },
    {
      "text": "Robin Welsch, Heiko Hecht, David R. Kolar, Michael Witthöft, and Tanja Legenbauer. 2020. Body image avoidance affects interpersonal distance perception: A virtual environment experiment. European Eating Disorders Review 28, 3 (2020), 282–295. https://doi.org/10.1002/erv.2715 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/erv.2715",
      "doi": ""
    },
    {
      "text": "Michael White, James Gain, Ulysse Vimont, and Daniel Lochner. 2019. The Case for Haptic Props: Shape, Weight and Vibro-Tactile Feedback. In Motion, Interaction and Games (Newcastle upon Tyne, United Kingdom) (MIG ’19). Association for Computing Machinery, New York, NY, USA, Article 7, 10 pages. https://doi.org/10.1145/3359566.3360058",
      "doi": "10.1145/3359566.3360058"
    },
    {
      "text": "Mieszko Wodzyński. 2020. Design of a Research and Training Platform for Operating Portable Chainsaws Using Virtual Reality Technology. Problems of Mechatronics Armament Aviation Safety Engineering 11 (12 2020), 83–92. https://doi.org/10.5604/01.3001.0014.5646",
      "doi": ""
    },
    {
      "text": "Erik Wolf, Nina Döllinger, David Mal, Carolin Wienrich, Mario Botsch, and Marc Erich Latoschik. 2020. Body Weight Perception of Females using Photorealistic Avatars in Virtual and Augmented Reality. In 2020 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, Porto de Galinhas, 462–473. https://doi.org/10.1109/ISMAR50242.2020.00071",
      "doi": ""
    },
    {
      "text": "Xupeng Ye. 2021. A Survey on Simulation for Weight Perception in Virtual Reality. Journal of Computer and Communications 9 (2021), 1–24. https://doi.org/10.4236/jcc.2021.99001",
      "doi": ""
    },
    {
      "text": "André Zenner and Antonio Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4(2017), 1285–1294. https://doi.org/10.1109/TVCG.2017.2656978",
      "doi": "10.1109/TVCG.2017.2656978"
    }
  ]
}