{
  "doi": "10.1145/3544548.3581304",
  "title": "3D Printed Interactive Multi-Storey Model for People with Visual Impairments",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "The understanding of multi-level spatial topologies is a difficult and frequent challenge in people with visual impairments daily life, impacting their independent mobility. Using the tools of the “maker” movement, and following an iterative co-design process with Orientation and Mobility instructors, we created an innovative tool (3D printed interactive model of a train station) for teaching complex spatial knowledge. Then, we did a comparative study with end users between the 3D interactive model that we designed and two 2D interactive tactile maps representing the same location. Our results show that the 3D interactive model is useful and usable, provides better satisfaction and is preferred to 2D tactile maps. In addition, complex spatial notions are better understood with the 3D model. Altogether, these results suggest that the “maker movement” may empower special education teachers with adapted and innovative tools.",
  "authors": [
    {
      "name": "Elen Sargsyan",
      "institution": "IRIT - Elipse, University of Toulouse 3, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778946",
      "orcid": "0000-0003-4342-253X"
    },
    {
      "name": "Bernard Oriola",
      "institution": "IRIT, CNRS / UPS, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100409371",
      "orcid": "0000-0001-5888-5268"
    },
    {
      "name": "Marc J-M Macé",
      "institution": "IRIT, CNRS / UPS, France and IRISA, CNRS / Rennes 1, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020667",
      "orcid": "0000-0003-4124-8697"
    },
    {
      "name": "Marcos Serrano",
      "institution": "IRIT - Elipse, University of Toulouse 3, France",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    },
    {
      "name": "Christophe Jouffrais",
      "institution": "IRIT, CNRS, France and IPAL, CNRS, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377594403",
      "orcid": "0000-0002-0768-1019"
    }
  ],
  "references": [
    {
      "text": "2016. Braille Literacy Statistics and How They Relate to Equality. https://brailleworks.com/braille-literacy-statistics/.",
      "doi": ""
    },
    {
      "text": "2021. Quelques chiffres sur la déficience visuelle. https://aveuglesdefrance.org/quelques-chiffres-sur-la-deficience-visuelle/",
      "doi": ""
    },
    {
      "text": "Tânia Aciem and Marcos Mazzotta. 2013. Personal and social autonomy of visually impaired people who were assisted by rehabilitation services. Revista Brasileira de Oftalmologia 72 (08 2013), 261–267. https://doi.org/10.1590/S0034-72802013000400011",
      "doi": ""
    },
    {
      "text": "Jérémy Albouys-Perrois, Jérémy Laviole, Carine Briant, and Anke M. Brock. 2018. Towards a Multisensory Augmented Reality Map for Blind and Low Vision People: A Participatory Design Approach. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174203",
      "doi": "10.1145/3173574.3174203"
    },
    {
      "text": "Mohammed Ibrahim Alhojailan and Mohammed Ibrahim. 2012. Thematic analysis: A critical review of its process and evaluation. West east journal of social sciences 1, 1 (2012), 39–47.",
      "doi": ""
    },
    {
      "text": "Cecile Allaire. 2012. Informer les personnes aveugles ou malvoyantes. Partage d’expériences.Inpes, coll. Référentiels de communication en santé publique. https://www.santepubliquefrance.fr/docs/informer-les-personnes-aveugles-et-malvoyantes-partage-d-experiences",
      "doi": ""
    },
    {
      "text": "AMI-télé. [n.d.]. Les maquettes 3D de l’INLB. Youtube. https://www.youtube.com/watch?v=BpXFPCqPyaY&ab_channel=AMI-t%C3%A9l%C3%A9",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2016. Personal Fabrication: State of the Art and Future Research. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 936–939. https://doi.org/10.1145/2851581.2856664",
      "doi": "10.1145/2851581.2856664"
    },
    {
      "text": "Cynthia L. Bennett, Abigale Stangl, Alexa F. Siu, and Joshua A. Miele. 2019. Making Nonvisually: Lessons from the Field(ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 279–285. https://doi.org/10.1145/3308561.3355619",
      "doi": "10.1145/3308561.3355619"
    },
    {
      "text": "Billie Louise Bentzen. 1972. Production and testing of an orientation and travel map for visually handicapped persons.New Outlook for the Blind 66, 8 (1972), 249–55.",
      "doi": ""
    },
    {
      "text": "Sharon Bertsch, Bryan Pesta, Richard Wiscott, and Michael Mcdaniel. 2007. The generation effect: A meta-analytic review. Memory & cognition 35 (04 2007), 201–10. https://doi.org/10.3758/BF03193441",
      "doi": ""
    },
    {
      "text": "Ann E. Bigelow. 1996. Blind and Sighted Children’s Spatial Knowledge of Their Home Environments. International Journal of Behavioral Development 19, 4(1996), 797–816. https://doi.org/10.1177/016502549601900407 arXiv:https://doi.org/10.1177/016502549601900407",
      "doi": ""
    },
    {
      "text": "Mark Blades, Simon Ungar, and Christopher Spencer. 1999. Map Use by Adults with Visual Impairments. The Professional Geographer 51, 4 (1999), 539–553. https://doi.org/10.1111/0033-0124.00191 arXiv:https://doi.org/10.1111/0033-0124.00191",
      "doi": ""
    },
    {
      "text": "M Brambring and C. Weber. 1981. Taktile, verbale und motorische Informationen zur geographischen Orientierung Blinder [Tactile, verbal, and motor information for a geographic orientation of the blind]. Zeitschrift für experimentelle und angewandte Psychologie 28 (1981), 23––37.",
      "doi": ""
    },
    {
      "text": "Megen E. Brittell, Amy K. Lobben, and Megan M. Lawrence. 2018. Usability Evaluation of Tactile Map Symbols across Three Production Technologies. Journal of Visual Impairment & Blindness 112, 6 (2018), 745–758. https://doi.org/10.1177/0145482X1811200609 arXiv:https://doi.org/10.1177/0145482X1811200609",
      "doi": ""
    },
    {
      "text": "Anke M. Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2015. Interactivity Improves Usability of Geographic Maps for Visually Impaired People. Human–Computer Interaction 30, 2 (2015), 156–194. https://doi.org/10.1080/07370024.2014.924412 arXiv:https://doi.org/10.1080/07370024.2014.924412",
      "doi": ""
    },
    {
      "text": "Emeline Brulé and Gilles Bailly. 2021. ”Beyond 3D Printers”: Understanding Long-Term Digital Fabrication Practices for the Education of Visually Impaired or Blind Youth. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 44, 15 pages. https://doi.org/10.1145/3411764.3445403",
      "doi": "10.1145/3411764.3445403"
    },
    {
      "text": "Emeline Brule, Gilles Bailly, Anke Brock, Frederic Valentin, Grégoire Denis, and Christophe Jouffrais. 2016. MapSense: Multi-Sensory Interactive Maps for Children Living with Visual Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 445–457. https://doi.org/10.1145/2858036.2858375",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Erin Buehler, Niara Comrie, Megan Hofmann, Samantha McDonald, and Amy Hurst. 2016. Investigating the Implications of 3D Printing in Special Education. ACM Trans. Access. Comput. 8, 3, Article 11 (mar 2016), 28 pages. https://doi.org/10.1145/2870640",
      "doi": "10.1145/2870640"
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014. ABC and 3D: Opportunities and obstacles to 3D printing in special education environments. In ASSETS14 - Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS14 - Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility). Association for Computing Machinery, 107–114. https://doi.org/10.1145/2661334.2661365 16th International ACM SIGACCESS Conference on Computers and Accessibility, ASSETS 2014 ; Conference date: 20-10-2014 Through 22-10-2014.",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Zaira Cattaneo, Tomaso Vecchi, Cesare Cornoldi, Irene Mammarella, Daniela Bonino, Emiliano Ricciardi, and Pietro Pietrini. 2008. Imagery and spatial processes in blindness and visual impairment. Neuroscience & Biobehavioral Reviews 32, 8 (2008), 1346–1360. https://doi.org/10.1016/j.neubiorev.2008.05.002 Special section: The European Workshop in Imagery and Cognition: Neurocognition and Visual Imagery.",
      "doi": ""
    },
    {
      "text": "Erin C. Connors, Elizabeth R. Chrastil, Jaime Sánchez, and Lotfi B. Merabet. 2014. Virtual environments for the transfer of navigation skills in the blind: a comparison of directed instruction vs. video game based learning approaches. Frontiers in Human Neuroscience 8 (2014). https://doi.org/10.3389/fnhum.2014.00223",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Katya Borgos-Rodriguez, and Anne Marie Piper. 2020. Weaving by Touch: A Case Analysis of Accessible Making(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376477",
      "doi": "10.1145/3313831.3376477"
    },
    {
      "text": "Roger M. Downs and David Stea. 1973. Cognitive Mapping and Spatial Behavior. Chapter 1, 8–26. https://doi.org/10.4324/9780203789155",
      "doi": ""
    },
    {
      "text": "M.A. Espinosa and E. Ochaíta. 1998. Using Tactile Maps to Improve the Practical Spatial Knowledge of Adults who are Blind. Journal of Visual Impairment & Blindness 92, 5 (1998), 338–345. https://doi.org/10.1177/0145482X9809200512 arXiv:https://doi.org/10.1177/0145482X9809200512",
      "doi": ""
    },
    {
      "text": "M. A. Espinosa, Simon Ungar, Esperanza Ochaíta, Mark Blades, and Christopher P. Spencer. 1998. Comparing Methods for Introducing Blind and Visually Impaired People to Unfamiliar Urban Environments. Journal of Environmental Psychology 18 (1998), 277–287.",
      "doi": ""
    },
    {
      "text": "Agebson Rocha Façanha, Ticianne Darin, Windson Viana, and Jaime Sánchez. 2020. O&M Indoor Virtual Environments for People Who Are Blind: A Systematic Literature Review. ACM Trans. Access. Comput. 13, 2, Article 9a (aug 2020), 42 pages. https://doi.org/10.1145/3395769",
      "doi": "10.1145/3395769"
    },
    {
      "text": "Uttara Ghodke, Lena Yusim, Sowmya Somanath, and Peter Coppin. 2019. The Cross-Sensory Globe: Participatory Design of a 3D Audio-Tactile Globe Prototype for Blind and Low-Vision Users to Learn Geography. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 399–412. https://doi.org/10.1145/3322276.3323686",
      "doi": "10.1145/3322276.3323686"
    },
    {
      "text": "Stéphanie Giraud, Anke M. Brock, Marc J.-M. Macé, and Christophe Jouffrais. 2017. Map Learning with a 3D Printed Interactive Small-Scale Model: Improvement of Space and Text Memorization in Visually Impaired Students. Frontiers in Psychology 8 (2017). https://doi.org/10.3389/fpsyg.2017.00930",
      "doi": ""
    },
    {
      "text": "Stéphanie Giraud and Christophe Jouffrais. 2016. Empowering Low-Vision Rehabilitation Professionals with “Do-It-Yourself” Methods. LNCS 9759, 61–68. https://doi.org/10.1007/978-3-319-41267-2_9",
      "doi": ""
    },
    {
      "text": "Stéphanie Giraud, Philippe Truillet, Véronique Gaildrat, and Christophe Jouffrais. 2017. DIY Prototyping of Teaching Materials for Visually Impaired Children: Usage and Satisfaction of Professionals. https://doi.org/10.1007/978-3-319-58706-6_42",
      "doi": ""
    },
    {
      "text": "Nicholas A. Giudice, Benjamin A. Guenther, Nicholas A. Jensen, and Kaitlyn N. Haase. 2020. Cognitive Mapping Without Vision: Comparing Wayfinding Performance After Learning From Digital Touchscreen-Based Multimodal Maps vs. Embossed Tactile Overlays. Frontiers in Human Neuroscience 14 (2020). https://doi.org/10.3389/fnhum.2020.00087",
      "doi": ""
    },
    {
      "text": "Jaume Gual, Marina Puyuelo, and Joaquim Lloveras. 2015. The effect of volumetric (3D) tactile symbols within inclusive tactile maps. Applied Ergonomics 48(2015), 1–10. https://doi.org/10.1016/j.apergo.2014.10.018",
      "doi": ""
    },
    {
      "text": "Yvette Hatwell. 2006. Appréhender l’espace pour un enfant aveugle. Enfances & Psy 33 (11 2006). https://doi.org/10.3917/ep.033.0069",
      "doi": ""
    },
    {
      "text": "Leona Holloway, Matthew Butler, and Kim Marriott. 2022. 3D Printed Street Crossings: Supporting Orientation and Mobility Training with People Who Are Blind or Have Low Vision(CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 415, 16 pages. https://doi.org/10.1145/3491102.3502072",
      "doi": "10.1145/3491102.3502072"
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible Maps for the Blind: Comparing 3D Printed Models with Tactile Graphics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173772",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Andreas Hub, Joachim Diepstraten, and Thomas Ertl. 2003. Design and Development of an Indoor Navigation and Object Identification System for the Blind. SIGACCESS Access. Comput.77–78 (sep 2003), 147–152. https://doi.org/10.1145/1029014.1028657",
      "doi": "10.1145/1029014.1028657"
    },
    {
      "text": "R.Dan Jacobson. 1998. Cognitive Mapping Without Sight: four preliminary studies of spatial learning. Journal of Environmental Psychology 18, 3 (1998), 289–305. https://doi.org/10.1006/jevp.1998.0098",
      "doi": ""
    },
    {
      "text": "R. Dan Jacobson. 1998. Navigating maps with little or no sight: An audio-tactile approach. In Content Visualization and Intermedia Representations (CVIR’98). https://aclanthology.org/W98-0214",
      "doi": ""
    },
    {
      "text": "Rob Kitchin and Dan Jacobson. 1997. Techniques to Collect and Analyze the Cognitive Map Knowledge of Persons with Visual Impairment Or Blindness: Issues of Validity. Journal of Visual Impairment and Blindness 91 (07 1997). https://doi.org/10.1177/0145482X9709100405",
      "doi": ""
    },
    {
      "text": "O. Lahav and D. Mioduser. 2008. Haptic-feedback support for cognitive mapping of unknown spaces by people who are blind. International Journal of Human-Computer Studies 66, 1 (2008), 23–35. https://doi.org/10.1016/j.ijhcs.2007.08.001",
      "doi": "10.1016/j.ijhcs.2007.08.001"
    },
    {
      "text": "Carine Lallemand. 2018. Méthodes de Design UX. 30 méthodes fondamentales pour concevoir des expériences optimales. (2e edition).",
      "doi": ""
    },
    {
      "text": "Carine Lallemand and Vincent Koenig. 2017. “How Could an Intranet be Like a Friend to Me?” - Why Standardized UX Scales Don’t Always Fit. https://doi.org/10.1145/3121283.3121288",
      "doi": "10.1145/3121283.3121288"
    },
    {
      "text": "Megan M. Lawrence and Amy K. Lobben. 2011. The Design of Tactile Thematic Symbols. Journal of Visual Impairment & Blindness 105, 10 (2011), 681–691. https://doi.org/10.1177/0145482X1110501014 arXiv:https://doi.org/10.1177/0145482X1110501014",
      "doi": ""
    },
    {
      "text": "Barbara Leporini, Valentina Rossetti, Francesco Furfari, Susanna Pelagatti, and Andrea Quarta. 2020. Design Guidelines for an Interactive 3D Model as a Supporting Tool for Exploring a Cultural Site by Visually Impaired and Sighted People. ACM Trans. Access. Comput. 13, 3, Article 9 (aug 2020), 39 pages. https://doi.org/10.1145/3399679",
      "doi": "10.1145/3399679"
    },
    {
      "text": "Luis Fernando Milan and Gabriela Celani. 2007. Tactile scale models: Three-dimensional info-graphics for space orientation of the blind and visually impaired. (01 2007), 801–805.",
      "doi": ""
    },
    {
      "text": "S. Millar. 1994. Understanding and Representing Space: Theory and Evidence from Studies with Blind and Sighted Children. Clarendon Press. https://books.google.fr/books?id=6nhoi8Hzuo4C",
      "doi": ""
    },
    {
      "text": "Susanna Millar. 1995. Understanding and representing spatial information. British Journal of Visual Impairment 13, 1 (1995), 8–11. https://doi.org/10.1177/026461969501300102 arXiv:https://doi.org/10.1177/026461969501300102",
      "doi": ""
    },
    {
      "text": "Dominika Palivcová, Miroslav Macík, and Zdeněk Míkovec. 2020. Interactive Tactile Map as a Tool for Building Spatial Knowledge of Visually Impaired Older Adults. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382912",
      "doi": "10.1145/3334480.3382912"
    },
    {
      "text": "Konstantinos Papadopoulos and Marialena Barouti. 2015. The Contribution of Audio-tactile Maps to Spatial Knowledge of Individuals with Visual Impairments. Proceedings of ICEAPVI (International Conference on Enabling Access) 1, 141–146.",
      "doi": ""
    },
    {
      "text": "Brice Parilusyan, Marc Teyssier, Valentin Martinez-Missir, Clément Duhart, and Marcos Serrano. 2022. Sensurfaces: A Novel Approach for Embedded Touch Sensing on Everyday Surfaces. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 2, Article 67 (jul 2022), 19 pages. https://doi.org/10.1145/3534616",
      "doi": "10.1145/3534616"
    },
    {
      "text": "R. Passini, A. Dupré, and C. Langlois. 1986. Spatial Mobility of the Visually Handicapped Active Person: A Descriptive Study. Journal of Visual Impairment & Blindness 80, 8 (1986), 904–907. https://doi.org/10.1177/0145482X8608000809 arXiv:https://doi.org/10.1177/0145482X8608000809",
      "doi": ""
    },
    {
      "text": "Lorenzo Picinali, Amandine Afonso, Michel Denis, and Brian F.G. Katz. 2014. Exploration of architectural spaces by blind people using auditory virtual reality for the construction of spatial knowledge. International Journal of Human-Computer Studies 72, 4 (2014), 393–407. https://doi.org/10.1016/j.ijhcs.2013.12.008",
      "doi": "10.1016/j.ijhcs.2013.12.008"
    },
    {
      "text": "Andreas Reichinger, Moritz Neumüller, Florian Rist, Stefan Maierhofer, and Werner Purgathofer. 2012. Computer-Aided Design of Tactile Models. In Computers Helping People with Special Needs, Klaus Miesenberger, Arthur Karshmer, Petr Penaz, and Wolfgang Zagler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 497–504.",
      "doi": ""
    },
    {
      "text": "Jaime Sánchez, Matías Espinoza, Marcia de Borba Campos, and Lotfi B. Merabet. 2013. Enhancing Orientation and Mobility Skills in Learners Who Are Blind through Video Gaming(C&C ’13). Association for Computing Machinery, New York, NY, USA, 353–356. https://doi.org/10.1145/2466627.2466673",
      "doi": "10.1145/2466627.2466673"
    },
    {
      "text": "Saquib Sarwar and David Wilson. 2022. Systematic Literature Review on Making and Accessibility. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility(Athens, Greece) (ASSETS ’22). Association for Computing Machinery, New York, NY, USA, Article 84, 5 pages. https://doi.org/10.1145/3517428.3550377",
      "doi": "10.1145/3517428.3550377"
    },
    {
      "text": "Brandon Taylor, Anind Dey, Dan Siewiorek, and Asim Smailagic. 2016. Customizable 3D Printed Tactile Maps as Interactive Overlays. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (Reno, Nevada, USA) (ASSETS ’16). Association for Computing Machinery, New York, NY, USA, 71–79. https://doi.org/10.1145/2982142.2982167",
      "doi": "10.1145/2982142.2982167"
    },
    {
      "text": "Simon Ungar. 2018. Cognitive mapping without visual experience. 221–248. https://doi.org/10.4324/9781315812281-13",
      "doi": ""
    },
    {
      "text": "Simon Ungar, Mark Blades, and Christopher Spencer. 1993. The role of tactile maps in mobility training. British Journal of Visual Impairment 11, 2 (1993), 59–61. https://doi.org/10.1177/026461969301100205 arXiv:https://doi.org/10.1177/026461969301100205",
      "doi": ""
    },
    {
      "text": "Bert Vandenberghe, Kathrin Gerling, Luc Geurts, and Vero Vanden Abeele. 2022. Maker Technology and the Promise of Empowerment in a Flemish School for Disabled Children. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 546, 18 pages. https://doi.org/10.1145/3491102.3501853",
      "doi": "10.1145/3491102.3501853"
    },
    {
      "text": "Viswanath Venkatesh, Michael G. Morris, Gordon B. Davis, and Fred D. Davis. 2003. User Acceptance of Information Technology: Toward a Unified View. MIS Quarterly 27, 3 (2003), 425–478. http://www.jstor.org/stable/30036540",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Jakub Wabiński, Albina Mościcka, and Guillaume Touya. 2022. Guidelines for Standardizing the Design of Tactile Maps: A Review of Research and Best Practice. The Cartographic Journal 59, 3 (2022), 239–258. https://doi.org/10.1080/00087041.2022.2097760 arXiv:https://doi.org/10.1080/00087041.2022.2097760",
      "doi": ""
    },
    {
      "text": "Chih-Fu Wu, Hsiang-Ping Wu, Yung-Hsiang Tu, I-Ting Yeh, and Chin-Te Chang. 2022. A Study on the Design Procedure of Three-Dimensional Printable Tactile Graphics for Individuals With Visual Impairments. Journal of Visual Impairment & Blindness 116, 4 (2022), 507–516. https://doi.org/10.1177/0145482X221122754 arXiv:https://doi.org/10.1177/0145482X221122754",
      "doi": ""
    }
  ]
}