{
  "doi": "10.1145/3544548.3581319",
  "title": "Just Do Something: Comparing Self-proposed and Machine-recommended Stress Interventions among Online Workers with Home Sweet Office",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [],
  "abstract": "Modern stress management techniques have been shown to be effective, particularly when applied systematically and with the supervision of an instructor. However, online workers usually lack sufficient support from therapists and learning resources to self-manage their stress. To better assist these users, we implemented a browser-based application, Home Sweet Office (HSO), to administer a set of stress micro-interventions which mimic existing therapeutic techniques, including somatic, positive psychology, meta cognitive, and cognitive behavioral categories. In a four-week field study, we compared random and machine-recommended interventions to interventions that were self-proposed by participants in order to investigate effective content and recommendation methods. Our primary findings suggest that both machine-recommended and self-proposed interventions had significantly higher momentary efficacy than random selection, whereas machine-recommended interventions offer more activity diversity compared to self-proposed interventions. We conclude with reflections on these results, discuss features and mechanisms which might improve efficacy, and suggest areas for future work.",
  "authors": [
    {
      "name": "Xin Tong",
      "institution": "Duke Kunshan University, China",
      "img": "/do/10.1145/contrib-99658689004/rel-imgonly/profile_1.jpeg",
      "acmid": "99658689004",
      "orcid": "0000-0002-8037-6301"
    },
    {
      "name": "Matthew Louis Mauriello",
      "institution": "Department of Computer and Information Sciences, University of Delaware, United States",
      "img": "/do/10.1145/contrib-81502788966/rel-imgonly/untitled-1_reasonably_small.jpg",
      "acmid": "81502788966",
      "orcid": "0000-0001-5359-6520"
    },
    {
      "name": "Marco Antonio Mora-Mendoza",
      "institution": "Pervasive Wellbeing Technology Lab, Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660679411",
      "orcid": "0000-0002-7305-3520"
    },
    {
      "name": "Nina Prabhu",
      "institution": "Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779954",
      "orcid": "0000-0002-4957-5046"
    },
    {
      "name": "Jane Paik Kim",
      "institution": "Psychiatry and Behavioral Sciences, Stanford University School of Medicine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780227",
      "orcid": "0000-0002-1475-9822"
    },
    {
      "name": "Pablo E Paredes Castro",
      "institution": "Department of Computer Science, University of Maryland College Park, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781499",
      "orcid": "0000-0003-2431-9190"
    }
  ],
  "references": [
    {
      "text": "2015. Special Report: the costs of nonpayment. https://blog.freelancersunion.org/2015/12/10/costs-nonpayment/",
      "doi": ""
    },
    {
      "text": "2020. Stress at work.(2020). https://doi.org/10.26616/NIOSHPUB99101",
      "doi": ""
    },
    {
      "text": "Aino Ahtinen, Elina Mattila, Pasi Välkkynen, Kirsikka Kaipainen, Toni Vanhala, Miikka Ermes, Essi Sairanen, Tero Myllymäki, Raimo Lappalainen, 2013. Mobile mental wellness training for stress management: feasibility and design implications based on a one-month field study. JMIR mHealth and uHealth 1, 2 (2013), e2596.",
      "doi": ""
    },
    {
      "text": "John A Astin. 1997. Stress reduction through mindfulness meditation. Psychotherapy and psychosomatics 66, 2 (1997), 97–106.",
      "doi": ""
    },
    {
      "text": "Peter Auer, Nicolo Cesa-Bianchi, and Paul Fischer. 2002. Finite-time analysis of the multiarmed bandit problem. Machine learning 47, 2 (2002), 235–256.",
      "doi": "10.1023/A%3A1013689704352"
    },
    {
      "text": "Douglas W Billings, Royer F Cook, April Hendrickson, and David C Dove. 2008. A web-based approach to managing stress and mood disorders in the workforce. Journal of occupational and environmental medicine/American College of Occupational and Environmental Medicine 50, 8 (2008), 960.",
      "doi": ""
    },
    {
      "text": "Edwin Boudreaux, Cris Mandry, and Phillip J Brantley. 1997. Stress, job satisfaction, coping, and psychological distress among emergency medical technicians. Prehospital and Disaster Medicine 12, 4 (1997), 9–16.",
      "doi": ""
    },
    {
      "text": "Danielle Boyd. [n. d.]. Workplace Stress. https://www.stress.org/workplace-stress",
      "doi": ""
    },
    {
      "text": "Robin Brewer and Anne Marie Piper. 2016. \" Tell It Like It Really Is\" A Case of Online Content Creation and Sharing Among Older Adult Bloggers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5529–5542.",
      "doi": "10.1145/2858036.2858379"
    },
    {
      "text": "Richard P Brown, Patricia L Gerbarg, and Fred Muench. 2013. Breathing practices for treatment of psychiatric and stress-related medical conditions. Psychiatric Clinics 36, 1 (2013), 121–140.",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2016. Amazon’s Mechanical Turk: A new source of inexpensive, yet high-quality data?(2016).",
      "doi": ""
    },
    {
      "text": "Andrew C Butler, Jason E Chapman, Evan M Forman, and Aaron T Beck. 2006. The empirical status of cognitive-behavioral therapy: a review of meta-analyses. Clinical psychology review 26, 1 (2006), 17–31.",
      "doi": ""
    },
    {
      "text": "James Carmody and Ruth A Baer. 2008. Relationships between mindfulness practice and levels of mindfulness, medical and psychological symptoms and well-being in a mindfulness-based stress reduction program. Journal of behavioral medicine 31, 1 (2008), 23–33.",
      "doi": ""
    },
    {
      "text": "James Carmody and Ruth A Baer. 2008. Relationships between mindfulness practice and levels of mindfulness, medical and psychological symptoms and well-being in a mindfulness-based stress reduction program. Journal of behavioral medicine 31, 1 (2008), 23–33.",
      "doi": ""
    },
    {
      "text": "Laura Carter, Deevakar Rogith, Amy Franklin, and Sahiti Myneni. 2019. NewCope: a theory-linked mobile application for stress education and management. Studies in health technology and informatics 264 (2019), 1150.",
      "doi": ""
    },
    {
      "text": "Krista Casler, Lydia Bickel, and Elizabeth Hackett. 2013. Separate but equal? A comparison of participants and data gathered via Amazon’s MTurk, social media, and face-to-face behavioral testing. Computers in human behavior 29, 6 (2013), 2156–2160.",
      "doi": "10.1016/j.chb.2013.05.009"
    },
    {
      "text": "David Cella, William Riley, Arthur Stone, Nan Rothrock, Bryce Reeve, Susan Yount, Dagmar Amtmann, Rita Bode, Daniel Buysse, Seung Choi, 2010. The Patient-Reported Outcomes Measurement Information System (PROMIS) developed and tested its first wave of adult self-reported health outcome item banks: 2005–2008. Journal of clinical epidemiology 63, 11 (2010), 1179–1194.",
      "doi": ""
    },
    {
      "text": "Janine Clarke, Judith Proudfoot, Mary-Rose Birch, Alexis E Whitton, Gordon Parker, Vijaya Manicavasagar, Virginia Harrison, Helen Christensen, and Dusan Hadzi-Pavlovic. 2014. Effects of mental health self-efficacy on outcomes of a mobile phone and web intervention for mild-to-moderate depression, anxiety and stress: secondary analysis of a randomised controlled trial. BMC psychiatry 14, 1 (2014), 1–10.",
      "doi": ""
    },
    {
      "text": "Shanice Clarke, Luis G Jaimes, and Miguel A Labrador. 2017. mstress: A mobile recommender system for just-in-time interventions for stress. In 2017 14th IEEE Annual Consumer Communications & Networking Conference (CCNC). IEEE, 1–5.",
      "doi": "10.1109/CCNC.2017.8015367"
    },
    {
      "text": "Thomas W Colligan and Eileen M Higgins. 2006. Workplace stress: Etiology and consequences. Journal of workplace behavioral health 21, 2 (2006), 89–97.",
      "doi": ""
    },
    {
      "text": "Royer Cook, Douglas Billings, Rebekah Hersch, Anita Back, April Hendrickson, 2007. A field test of a web-based workplace health promotion program to improve dietary practices, reduce stress, and increase physical activity: randomized controlled trial. Journal of medical Internet research 9, 2 (2007), e627.",
      "doi": ""
    },
    {
      "text": "Cary L Cooper and Sue Cartwright. 1997. An intervention strategy for workplace stress. Journal of psychosomatic research 43, 1 (1997), 7–16.",
      "doi": ""
    },
    {
      "text": "Djellel Eddine Difallah, Michele Catasta, Gianluca Demartini, Panagiotis G Ipeirotis, and Philippe Cudré-Mauroux. 2015. The dynamics of micro-task crowdsourcing: The case of amazon mturk. In Proceedings of the 24th international conference on world wide web. 238–247.",
      "doi": ""
    },
    {
      "text": "Katherine Pollak Eisen, George J Allen, Mary Bollash, and Linda S Pescatello. 2008. Stress management in the workplace: A comparison of a computer-based and an in-person stress-management intervention. Computers in Human Behavior 24, 2 (2008), 486–496.",
      "doi": "10.1016/j.chb.2007.02.003"
    },
    {
      "text": "Elissa S Epel, Alexandra D Crosswell, Stefanie E Mayer, Aric A Prather, George M Slavich, Eli Puterman, and Wendy Berry Mendes. 2018. More than a feeling: A unified view of stress measurement for population science. Frontiers in neuroendocrinology 49 (2018), 146–169.",
      "doi": ""
    },
    {
      "text": "Susan Folkman, Judith Tedlie Moskowitz, Elizabeth M Ozer, and Crystal L Park. 1997. Positive meaningful events and coping in the context of HIV/AIDS. In Coping with chronic stress. Springer, 293–314.",
      "doi": ""
    },
    {
      "text": "Barbara L Fredrickson. 2001. The role of positive emotions in positive psychology: The broaden-and-build theory of positive emotions.American psychologist 56, 3 (2001), 218.",
      "doi": ""
    },
    {
      "text": "Kelsie M Full, Atul Malhotra, Katie Crist, Kevin Moran, and Jacqueline Kerr. 2019. Assessing psychometric properties of the PROMIS Sleep Disturbance Scale in older adults in independent-living and continuing care retirement communities. Sleep Health 5, 1 (2019), 18–22.",
      "doi": ""
    },
    {
      "text": "Paul R Grime. 2004. Computerized cognitive behavioural therapy at work: a randomized controlled trial in employees with recent stress-related absenteeism. Occupational Medicine 54, 5 (2004), 353–359.",
      "doi": ""
    },
    {
      "text": "Dan Hasson, Ulla Maria Anderberg, Töres Theorell, and Bengt B Arnetz. 2005. Psychophysiological effects of a web-based stress management system: a prospective, randomized controlled intervention study of IT and media workers [ISRCTN54254861]. BMC public health 5, 1 (2005), 1–14.",
      "doi": ""
    },
    {
      "text": "Elena Heber, David Daniel Ebert, Dirk Lehr, Stephanie Nobis, Matthias Berking, and Heleen Riper. 2013. Efficacy and cost-effectiveness of a web-based and mobile stress-management intervention for employees: design of a randomized controlled trial. BMC public health 13, 1 (2013), 1–12.",
      "doi": ""
    },
    {
      "text": "Elena Heber, Dirk Lehr, David Daniel Ebert, Matthias Berking, Heleen Riper, 2016. Web-based and mobile stress management intervention for employees: a randomized controlled trial. Journal of medical Internet research 18, 1 (2016), e5112.",
      "doi": ""
    },
    {
      "text": "Blake Anthony Hickey, Taryn Chalmers, Phillip Newton, Chin-Teng Lin, David Sibbritt, Craig S McLachlan, Roderick Clifton-Bligh, John Morley, and Sara Lal. 2021. Smart devices and wearable technologies to detect and monitor mental health conditions and stress: A systematic review. Sensors 21, 10 (2021), 3461.",
      "doi": ""
    },
    {
      "text": "Irit Hochberg, Guy Feraru, Mark Kozdoba, Shie Mannor, Moshe Tennenholtz, and Elad Yom-Tov. 2016. A reinforcement learning system to encourage physical activity in diabetes patients. arXiv preprint arXiv:1605.04070(2016).",
      "doi": ""
    },
    {
      "text": "Esther Howe, Jina Suh, Mehrab Bin Morshed, Daniel McDuff, Kael Rowan, Javier Hernandez, Marah Ihab Abdin, Gonzalo Ramos, Tracy Tran, and Mary P Czerwinski. 2022. Design of Digital Workplace Stress-Reduction Intervention Systems: Effects of Intervention Type and Timing. In CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": ""
    },
    {
      "text": "Julie Anne Irving, Patricia L Dobkin, and Jeeseon Park. 2009. Cultivating mindfulness in health care professionals: A review of empirical studies of mindfulness-based stress reduction (MBSR). Complementary therapies in clinical practice 15, 2 (2009), 61–66.",
      "doi": ""
    },
    {
      "text": "Luis G Jaimes, Martin Llofriu, and Andrew Raij. 2015. Preventer, a selection mechanism for just-in-time preventive interventions. IEEE Transactions on Affective Computing 7, 3 (2015), 243–257.",
      "doi": "10.1109/TAFFC.2015.2490062"
    },
    {
      "text": "Ravinder Jerath, Molly W Crawford, Vernon A Barnes, and Kyler Harden. 2015. Self-regulation of breathing as a primary treatment for anxiety. Applied psychophysiology and biofeedback 40, 2 (2015), 107–115.",
      "doi": ""
    },
    {
      "text": "Toni Kaplan, Susumu Saito, Kotaro Hara, and Jeffrey P Bigham. 2018. Striving to earn more: a survey of work strategies and tool use among crowd workers. In Sixth AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Eric B Hekler, Saul Shiffman, Audrey Boruvka, Daniel Almirall, Ambuj Tewari, and Susan A Murphy. 2015. Microrandomized trials: An experimental design for developing just-in-time adaptive interventions.Health Psychology 34, S (2015), 1220.",
      "doi": ""
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S Bernstein. 2018. Rotating online behavior change interventions increases effectiveness but also increases attrition. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–25.",
      "doi": "10.1145/3274364"
    },
    {
      "text": "Kurt Kroenke and Robert L Spitzer. 2002. The PHQ-9: a new depression diagnostic and severity measure., 509–515 pages.",
      "doi": ""
    },
    {
      "text": "Lihong Li, Wei Chu, John Langford, and Robert E Schapire. 2010. A contextual-bandit approach to personalized news article recommendation. In Proceedings of the 19th international conference on World wide web. 661–670.",
      "doi": "10.1145/1772690.1772758"
    },
    {
      "text": "Tania M Lincoln, Maike Hartmann, Ulf Köther, and Steffen Moritz. 2015. Dealing with feeling: Specific emotion regulation skills predict responses to stress in psychosis. Psychiatry Research 228, 2 (2015), 216–222.",
      "doi": ""
    },
    {
      "text": "Peter F Lovibond and Sydney H Lovibond. 1995. The structure of negative emotional states: Comparison of the Depression Anxiety Stress Scales (DASS) with the Beck Depression and Anxiety Inventories. Behaviour research and therapy 33, 3 (1995), 335–343.",
      "doi": ""
    },
    {
      "text": "David Martin, Benjamin V Hanrahan, Jacki O’neill, and Neha Gupta. 2014. Being a turker. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 224–235.",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Matthew Louis Mauriello, Thierry Lincoln, Grace Hon, Dorien Simon, Dan Jurafsky, and Pablo Paredes. 2021. SAD: A Stress Annotated Dataset for Recognizing Everyday Stressors in SMS-like Conversational Systems. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 399, 7 pages. https://doi.org/10.1145/3411763.3451799",
      "doi": "10.1145/3411763.3451799"
    },
    {
      "text": "Matthew Louis Mauriello, Nantanick Tantivasadakarn, Marco Antonio Mora-Mendoza, Emmanuel Thierry Lincoln, Grace Hon, Parsa Nowruzi, Dorien Simon, Luke Hansen, Nathaniel H Goenawan, Joshua Kim, Nikhil Gowda, Dan Jurafsky, and Pablo Enrique Paredes. 2021. A Suite of Mobile Conversational Agents for Daily Stress Management (Popbots): Mixed Methods Exploratory Study. JMIR Form Res 5, 9 (14 Sep 2021), e25294. https://doi.org/10.2196/25294",
      "doi": ""
    },
    {
      "text": "Bruce S McEwen and Eliot Stellar. 1993. Stress and the individual: Mechanisms leading to disease. Archives of internal medicine 153, 18 (1993), 2093–2101.",
      "doi": ""
    },
    {
      "text": "Kathleen Mikkelsen, Lily Stojanovska, Momir Polenakovic, Marijan Bosevski, and Vasso Apostolopoulos. 2017. Exercise and mental health. Maturitas 106(2017), 48–56.",
      "doi": ""
    },
    {
      "text": "Margaret E Morris, Qusai Kathawala, Todd K Leen, Ethan E Gorenstein, Farzin Guilak, William DeLeeuw, and Michael Labhard. 2010. Mobile therapy: case study evaluations of a cell phone application for emotional self-awareness. Journal of medical Internet research 12, 2 (2010), e1371.",
      "doi": ""
    },
    {
      "text": "Leanne G Morrison, Adam WA Geraghty, Scott Lloyd, Natalie Goodman, Danius T Michaelides, Charlie Hargood, Mark Weal, and Lucy Yardley. 2018. Comparing usage of a web and app stress management intervention: An observational study. Internet interventions 12 (2018), 74–82.",
      "doi": ""
    },
    {
      "text": "Pablo Paredes, Ran Gilad-Bachrach, Mary Czerwinski, Asta Roseway, Kael Rowan, and Javier Hernandez. 2014. PopTherapy: Coping with stress through pop-culture. In Proceedings of the 8th international conference on pervasive computing technologies for healthcare. 109–117.",
      "doi": "10.4108/icst.pervasivehealth.2014.255070"
    },
    {
      "text": "Pablo Enrique Paredes, Nur Al-Huda Hamdan, Dav Clark, Carrie Cai, Wendy Ju, and James A Landay. 2017. Evaluating in-car movements in the design of mindful commute interventions: exploratory study. Journal of medical Internet research 19, 12 (2017), e6983.",
      "doi": ""
    },
    {
      "text": "Valentina Perciavalle, Marta Blandini, Paola Fecarotta, Andrea Buscemi, Donatella Di Corrado, Luana Bertolo, Fulvia Fichera, and Marinella Coco. 2017. The role of deep breathing on stress. Neurological Sciences 38, 3 (2017), 451–458.",
      "doi": ""
    },
    {
      "text": "Taylor E Purvis, Brian J Neuman, Lee H Riley, and Richard L Skolasky. 2019. Comparison of PROMIS Anxiety and Depression, PHQ-8, and GAD-7 to screen for anxiety and depression among patients presenting for spine surgery. Journal of Neurosurgery: Spine 30, 4 (2019), 524–531.",
      "doi": ""
    },
    {
      "text": "Michael E Robinson, Joseph L Riley III, Cynthia D Myers, Ian J Sadler, Steven A Kvaal, Michael E Geisser, and Francis J Keefe. 1997. The Coping Strategies Questionnaire: a large sample, item level factor analysis. The Clinical journal of pain 13, 1 (1997), 43–49.",
      "doi": ""
    },
    {
      "text": "Darya Saedpanah, Shiva Salehi, and Ladan Fattah Moghaddam. 2016. The effect of emotion regulation training on occupational stress of critical care nurses. Journal of clinical and diagnostic research: JCDR 10, 12 (2016), VC01.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Elsa Vaara, Claus Weymann, Markus Bylund, Pedro Ferreira, Nathalie Peira, and Marie Sjölinder. 2010. Mind the body! Designing a mobile stress management application encouraging personal reflection. In Proceedings of the 8th ACM conference on designing interactive systems. 47–56.",
      "doi": "10.1145/1858171.1858182"
    },
    {
      "text": "Akane Sano, Paul Johns, and Mary Czerwinski. 2015. HealthAware: An advice system for stress, sleep, diet and exercise. In 2015 International Conference on Affective Computing and Intelligent Interaction (ACII). IEEE, 546–552.",
      "doi": "10.1109/ACII.2015.7344623"
    },
    {
      "text": "Akane Sano, Paul Johns, and Mary Czerwinski. 2017. Designing opportune stress intervention delivery timing using multi-modal data. In 2017 Seventh International Conference on Affective Computing and Intelligent Interaction (ACII). IEEE, 346–353.",
      "doi": ""
    },
    {
      "text": "Hillol Sarker, Moushumi Sharmin, Amin Ahsan Ali, Md Mahbubur Rahman, Rummana Bari, Syed Monowar Hossain, and Santosh Kumar. 2014. Assessing the availability of users to engage in just-in-time intervention in the natural environment. In Proceedings of the 2014 ACM international joint conference on pervasive and ubiquitous computing. 909–920.",
      "doi": "10.1145/2632048.2636082"
    },
    {
      "text": "Jessica Schroeder, Chelsey Wilkes, Kael Rowan, Arturo Toledo, Ann Paradiso, Mary Czerwinski, Gloria Mark, and Marsha M Linehan. 2018. Pocket skills: A conversational mobile web app to support dialectical behavioral therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3173574.3173972"
    },
    {
      "text": "Stephen M Schueller. 2010. Preferences for positive psychology exercises. The Journal of Positive Psychology 5, 3 (2010), 192–203.",
      "doi": ""
    },
    {
      "text": "Martin EP Seligman and Mihaly Csikszentmihalyi. 2014. Positive psychology: An introduction. In Flow and the foundations of positive psychology. Springer, 279–298.",
      "doi": ""
    },
    {
      "text": "Annie Shearer, Melissa Hunt, Mifta Chowdhury, and Lorena Nicol. 2016. Effects of a brief mindfulness meditation intervention on student stress and heart rate variability.International Journal of Stress Management 23, 2 (2016), 232.",
      "doi": ""
    },
    {
      "text": "Jeanne A Teresi, Katja Ocepek-Welikson, Marjorie Kleinman, Mildred Ramirez, and Giyeon Kim. 2016. Psychometric properties and performance of the Patient Reported Outcomes Measurement Information System®(PROMIS®) depression short forms in ethnically diverse groups.Psychological test and assessment modeling(2016).",
      "doi": ""
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales.Journal of personality and social psychology 54, 6(1988), 1063.",
      "doi": ""
    },
    {
      "text": "Elad Yom-Tov, Guy Feraru, Mark Kozdoba, Shie Mannor, Moshe Tennenholtz, Irit Hochberg, 2017. Encouraging physical activity in patients with diabetes: intervention using a reinforcement learning system. Journal of medical Internet research 19, 10 (2017), e7994.",
      "doi": ""
    },
    {
      "text": "Bin Yu, Mathias Funk, Jun Hu, Qi Wang, and Loe Feijs. 2018. Biofeedback for everyday stress management: A systematic review. Frontiers in ICT 5(2018), 23.",
      "doi": ""
    },
    {
      "text": "Yufan Zhao, Michael R Kosorok, and Donglin Zeng. 2009. Reinforcement learning design for cancer clinical trials. Statistics in medicine 28, 26 (2009), 3294–3315.",
      "doi": ""
    },
    {
      "text": "Xingchen Zhou, Pei-Luen Patrick Rau, and Xueqian Liu. 2021. \" Time to Take a Break\" How Heavy Adult Gamers React to a Built-In Gaming Gradual Intervention System. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–30.",
      "doi": ""
    }
  ]
}