{
  "doi": "10.1145/3544548.3581439",
  "title": "Amortized Inference with User Simulations",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [],
  "abstract": "There have been significant advances in simulation models predicting human behavior across various interactive tasks. One issue remains, however: identifying the parameter values that best describe an individual user. These parameters often express personal cognitive and physiological characteristics, and inferring their exact values has significant effects on individual-level predictions. Still, the high complexity of simulation models usually causes parameter inference to consume prohibitively large amounts of time, as much as days per user. We investigated amortized inference for its potential to reduce inference time dramatically, to mere tens of milliseconds. Its principle is to pre-train a neural proxy model for probabilistic inference, using synthetic data simulated from a range of parameter combinations. From examining the efficiency and prediction performance of amortized inference in three challenging cases that involve real-world data (menu search, point-and-click, and touchscreen typing), the paper demonstrates that an amortized-inference approach permits analyzing large-scale datasets by means of simulation models. It also addresses emerging opportunities and challenges in applying amortized inference in HCI.",
  "tags": [
    "simulation models",
    "amortized inference",
    "inverse modeling"
  ],
  "authors": [
    {
      "name": "Hee-Seung Moon",
      "institution": "Yonsei University, Korea, Republic of and Aalto University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588221",
      "orcid": "0000-0003-0882-2335"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Byungjoo Lee",
      "institution": "Yonsei University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659503945",
      "orcid": "0000-0003-0341-448X"
    }
  ],
  "references": [
    {
      "text": "John R Anderson. 1996. ACT: A simple theory of complex cognition.American Psychologist 51, 4 (1996), 355–365.",
      "doi": ""
    },
    {
      "text": "Lynton Ardizzone, Jakob Kruse, Carsten Rother, and Ullrich Köthe. 2018. Analyzing inverse problems with invertible neural networks. In International Conference on Learning Representations.",
      "doi": ""
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Duncan P Brumby, and Andrew Howes. 2014. Model of visual search and selection time in linear menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3865–3874.",
      "doi": "10.1145/2556288.2557093"
    },
    {
      "text": "Mark A Beaumont, Wenyang Zhang, and David J Balding. 2002. Approximate Bayesian computation in population genetics. Genetics 162, 4 (2002), 2025–2035.",
      "doi": ""
    },
    {
      "text": "David M Blei, Alp Kucukelbir, and Jon D McAuliffe. 2017. Variational inference: A review for statisticians. J. Amer. Statist. Assoc. 112, 518 (2017), 859–877.",
      "doi": ""
    },
    {
      "text": "George Erich Brogmus. 1991. Effects of age and sex on speed and accuracy of hand movements: And the refinements they suggest for Fitts’ law. Proceedings of the Human Factors Society Annual Meeting 35, 3(1991), 208–212.",
      "doi": ""
    },
    {
      "text": "Rachael A Burno, Bing Wu, Rina Doherty, Hannah Colett, and Rania Elnaggar. 2015. Applying Fitts’ law to gesture based computer interactions. Procedia Manufacturing 3(2015), 4342–4349.",
      "doi": ""
    },
    {
      "text": "Stuart K Card, Thomas P Moran, and Allen Newell. 1983. The psychology of human–computer interaction. Lawrence Erlbaum Associates.",
      "doi": "10.5555/578027"
    },
    {
      "text": "Noshaba Cheema, Laura A Frey-Law, Kourosh Naderi, Jaakko Lehtinen, Philipp Slusallek, and Perttu Hämäläinen. 2020. Predicting mid-air interaction movements and fatigue using deep reinforcement learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376701"
    },
    {
      "text": "Xiuli Chen, Gilles Bailly, Duncan P Brumby, Antti Oulasvirta, and Andrew Howes. 2015. The emergence of interactive behavior: A model of rational menu search. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 4217–4226.",
      "doi": "10.1145/2702123.2702483"
    },
    {
      "text": "Kyle Cranmer, Johann Brehmer, and Gilles Louppe. 2020. The frontier of simulation-based inference. Proceedings of the National Academy of Sciences 117, 48(2020), 30055–30062.",
      "doi": ""
    },
    {
      "text": "Chris Cremer, Xuechen Li, and David Duvenaud. 2018. Inference suboptimality in variational autoencoders. In International Conference on Machine Learning. PMLR, 1078–1086.",
      "doi": ""
    },
    {
      "text": "Maximilian Dax, Stephen R Green, Jonathan Gair, Jakob H Macke, Alessandra Buonanno, and Bernhard Schölkopf. 2021. Real-time gravitational wave science with neural posterior estimation. Physical Review Letters 127, 24 (2021), 241103.",
      "doi": ""
    },
    {
      "text": "Laurent Dinh, Jascha Sohl-Dickstein, and Samy Bengio. 2017. Density estimation using Real NVP. In International Conference on Learning Representations.",
      "doi": ""
    },
    {
      "text": "Seungwon Do, Minsuk Chang, and Byungjoo Lee. 2021. A simulation model of intermittently controlled point-and-click behaviour. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3411764.3445514"
    },
    {
      "text": "Florian Fischer, Miroslav Bachinski, Markus Klar, Arthur Fleig, and Jörg Müller. 2021. Reinforcement learning control of a biomechanical model of the upper extremity. Scientific Reports 11, 1 (2021), 1–15.",
      "doi": ""
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement.Journal of Experimental Psychology 47, 6 (1954), 381–391.",
      "doi": ""
    },
    {
      "text": "Christoph Gebhardt, Antti Oulasvirta, and Otmar Hilliges. 2021. Hierarchical reinforcement learning explains task interleaving behavior. Computational Brain & Behavior 4, 3 (2021), 284–304.",
      "doi": ""
    },
    {
      "text": "Samuel Gershman and Noah Goodman. 2014. Amortized inference in probabilistic reasoning. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 36.",
      "doi": ""
    },
    {
      "text": "Samuel J Gershman, Eric J Horvitz, and Joshua B Tenenbaum. 2015. Computational rationality: A converging paradigm for intelligence in brains, minds, and machines. Science 349, 6245 (2015), 273–278.",
      "doi": ""
    },
    {
      "text": "Manuel Glöckler, Michael Deistler, and Jakob H Macke. 2022. Variational methods for simulation-based inference. In International Conference on Learning Representations.",
      "doi": ""
    },
    {
      "text": "Pedro J Gonçalves, Jan-Matthis Lueckmann, Michael Deistler, Marcel Nonnenmacher, Kaan Öcal, Giacomo Bassetto, Chaitanya Chintaluri, William F Podlaski, Sara A Haddad, Tim P Vogels, 2020. Training deep neural density estimators to identify mechanistic models of neural dynamics. eLife 9(2020), e56261.",
      "doi": ""
    },
    {
      "text": "David Greenberg, Marcel Nonnenmacher, and Jakob Macke. 2019. Automatic posterior transformation for likelihood-free inference. In International Conference on Machine Learning. PMLR, 2404–2414.",
      "doi": ""
    },
    {
      "text": "Arthur Gretton, Karsten M Borgwardt, Malte J Rasch, Bernhard Schölkopf, and Alexander Smola. 2012. A kernel two-sample test. Journal of Machine Learning Research 13, 1 (2012), 723–773.",
      "doi": "10.5555/2188385.2188410"
    },
    {
      "text": "Yves Guiard and Olivier Rioul. 2015. A mathematical description of the speed/accuracy trade-off of aimed movement. In Proceedings of the 2015 British HCI Conference. 91–100.",
      "doi": "10.1145/2783446.2783574"
    },
    {
      "text": "Ryan N Gutenkunst, Joshua J Waterfall, Fergal P Casey, Kevin S Brown, Christopher R Myers, and James P Sethna. 2007. Universally sloppy parameter sensitivities in systems biology models. PLoS Computational Biology 3, 10 (2007), e189.",
      "doi": ""
    },
    {
      "text": "Michael U Gutmann and Jukka Corander. 2016. Bayesian optimization for likelihood-free inference of simulator-based statistical models. Journal of Machine Learning Research 17 (2016).",
      "doi": ""
    },
    {
      "text": "Peter C Humphreys, David Raposo, Tobias Pohlen, Gregory Thornton, Rachita Chhaparia, Alistair Muldal, Josh Abramson, Petko Georgiev, Adam Santoro, and Timothy Lillicrap. 2022. A data-driven approach for learning to control computers. In International Conference on Machine Learning. PMLR, 9466–9482.",
      "doi": ""
    },
    {
      "text": "Andrew Jaegle, Felix Gimeno, Andy Brock, Oriol Vinyals, Andrew Zisserman, and Joao Carreira. 2021. Perceiver: General perception with iterative attention. In International Conference on Machine Learning. PMLR, 4651–4664.",
      "doi": ""
    },
    {
      "text": "Jussi Jokinen, Aditya Acharya, Mohammad Uzair, Xinhui Jiang, and Antti Oulasvirta. 2021. Touchscreen typing as optimal supervisory control. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445483"
    },
    {
      "text": "Jussi PP Jokinen, Tuomo Kujala, and Antti Oulasvirta. 2021. Multitasking in driving as optimal adaptation under uncertainty. Human Factors 63, 8 (2021), 1324–1341.",
      "doi": ""
    },
    {
      "text": "Jussi PP Jokinen, Sayan Sarcar, Antti Oulasvirta, Chaklam Silpasuwanchai, Zhenxin Wang, and Xiangshi Ren. 2017. Modelling learning of new keyboard layouts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4203–4215.",
      "doi": "10.1145/3025453.3025580"
    },
    {
      "text": "Jussi PP Jokinen, Zhenxin Wang, Sayan Sarcar, Antti Oulasvirta, and Xiangshi Ren. 2020. Adaptive feature guidance: Modelling visual search with graphical layouts. International Journal of Human–Computer Studies 136 (2020), 102376.",
      "doi": "10.1016/j.ijhcs.2019.102376"
    },
    {
      "text": "Antti Kangasrääsiö, Kumaripaba Athukorala, Andrew Howes, Jukka Corander, Samuel Kaski, and Antti Oulasvirta. 2017. Inferring cognitive models from data using approximate Bayesian computation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1295–1306.",
      "doi": "10.1145/3025453.3025576"
    },
    {
      "text": "Antti Kangasrääsiö, Jussi PP Jokinen, Antti Oulasvirta, Andrew Howes, and Samuel Kaski. 2019. Parameter inference for computational cognitive models with Approximate Bayesian Computation. Cognitive Science 43, 6 (2019), e12738.",
      "doi": ""
    },
    {
      "text": "Davis E Kieras and Davis E Meyer. 1997. An overview of the EPIC architecture for cognition and performance with application to human–computer interaction. Human–Computer Interaction 12, 4 (1997), 391–438.",
      "doi": ""
    },
    {
      "text": "Durk P Kingma and Prafulla Dhariwal. 2018. Glow: Generative flow with invertible 1 × 1 convolutions. Advances in Neural Information Processing Systems 31 (2018).",
      "doi": ""
    },
    {
      "text": "Diederik P Kingma and Max Welling. 2013. Auto-encoding variational Bayes. arXiv preprint arXiv:1312.6114(2013).",
      "doi": ""
    },
    {
      "text": "Hiroaki Kitano. 2004. Biological robustness. Nature Reviews Genetics 5, 11 (2004), 826–837.",
      "doi": ""
    },
    {
      "text": "Jakob Kruse, Lynton Ardizzone, Carsten Rother, and Ullrich Köthe. 2021. Benchmarking invertible architectures on inverse problems. arXiv preprint arXiv:2101.10763(2021).",
      "doi": ""
    },
    {
      "text": "Minhae Kwon, Saurabh Daptardar, Paul R Schrater, and Xaq Pitkow. 2020. Inverse rational control with partially observable continuous nonlinear dynamics. Advances in Neural Information Processing Systems 33 (2020), 7898–7909.",
      "doi": ""
    },
    {
      "text": "Gary D Langolf, Don B Chaffin, and James A Foulke. 1976. An investigation of Fitts’ law using a wide range of movement amplitudes. Journal of Motor Behavior 8, 2 (1976), 113–128.",
      "doi": ""
    },
    {
      "text": "Vladimir I Levenshtein. 1966. Binary codes capable of correcting deletions, insertions, and reversals. Soviet Physics – Doklady 10, 8 (1966), 707–710.",
      "doi": ""
    },
    {
      "text": "Richard L Lewis, Andrew Howes, and Satinder Singh. 2014. Computational rationality: Linking mechanism and behavior through bounded utility maximization. Topics in Cognitive Science 6, 2 (2014), 279–311.",
      "doi": ""
    },
    {
      "text": "Jan-Matthis Lueckmann, Pedro J Goncalves, Giacomo Bassetto, Kaan Öcal, Marcel Nonnenmacher, and Jakob H Macke. 2017. Flexible statistical inference for mechanistic models of neural dynamics. Advances in Neural Information Processing Systems 30 (2017).",
      "doi": ""
    },
    {
      "text": "Julieta Martinez, Michael J Black, and Javier Romero. 2017. On human motion prediction using recurrent neural networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2891–2900.",
      "doi": ""
    },
    {
      "text": "Matthew Millard, Thomas Uchida, Ajay Seth, and Scott L Delp. 2013. Flexing computational muscle: Modeling and simulation of musculotendon dynamics. Journal of Biomechanical Engineering 135, 2 (2013).",
      "doi": ""
    },
    {
      "text": "Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Andrei A Rusu, Joel Veness, Marc G Bellemare, Alex Graves, Martin Riedmiller, Andreas K Fidjeland, Georg Ostrovski, 2015. Human-level control through deep reinforcement learning. Nature 518, 7540 (2015), 529–533.",
      "doi": ""
    },
    {
      "text": "Hee-Seung Moon, Seungwon Do, Wonjae Kim, Jiwon Seo, Minsuk Chang, and Byungjoo Lee. 2022. Speeding up inference with user simulators through policy modulation. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. 1–21.",
      "doi": "10.1145/3491102.3502023"
    },
    {
      "text": "Hee-Seung Moon and Jiwon Seo. 2021. Fast user adaptation for human motion prediction in physical human–robot interaction. IEEE Robotics and Automation Letters 7, 1 (2021), 120–127.",
      "doi": ""
    },
    {
      "text": "Roderick Murray-Smith, John H Williamson, Andrew Ramsay, Francesco Tonolini, Simon Rogers, and Antoine Loriette. 2021. Forward and inverse models in HCI: Physical simulation and deep learning for inferring 3D finger pose. arXiv preprint arXiv:2109.03366(2021).",
      "doi": ""
    },
    {
      "text": "John A Nelder and Roger Mead. 1965. A simplex method for function minimization. The Computer Journal 7, 4 (1965), 308–313.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Jussi PP Jokinen, and Andrew Howes. 2022. Computational rationality as a theory of interaction. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3491102.3517739"
    },
    {
      "text": "Antti Oulasvirta, Sunjun Kim, and Byungjoo Lee. 2018. Neuromechanics of a button press. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174082"
    },
    {
      "text": "Brooks Paige and Frank Wood. 2016. Inference networks for sequential Monte Carlo in graphical models. In International Conference on Machine Learning. PMLR, 3040–3049.",
      "doi": ""
    },
    {
      "text": "Kseniia Palin, Anna Maria Feit, Sunjun Kim, Per Ola Kristensson, and Antti Oulasvirta. 2019. How do people type on mobile devices? Observations from a study with 37,000 volunteers. In Proceedings of the 21st International Conference on Human–Computer Interaction with Mobile Devices and Services. 1–12.",
      "doi": "10.1145/3338286.3340120"
    },
    {
      "text": "George Papamakarios and Iain Murray. 2016. Fast ε-free inference of simulation models with Bayesian conditional density estimation. Advances in Neural Information Processing Systems 29 (2016).",
      "doi": ""
    },
    {
      "text": "George Papamakarios, Eric T Nalisnick, Danilo Jimenez Rezende, Shakir Mohamed, and Balaji Lakshminarayanan. 2021. Normalizing flows for probabilistic modeling and inference. Journal of Machine Learning Research 22, 57 (2021), 1–64.",
      "doi": ""
    },
    {
      "text": "Stephen J Payne and Andrew Howes. 2013. Adaptive interaction: A utility maximization approach to understanding human interaction with technology. Synthesis Lectures on Human-Centered Informatics 6, 1(2013), 1–111.",
      "doi": "10.5555/2534478"
    },
    {
      "text": "Stefan T Radev, Frederik Graw, Simiao Chen, Nico T Mutters, Vanessa M Eichel, Till Bärnighausen, and Ullrich Köthe. 2021. OutbreakFlow: Model-based Bayesian inference of disease outbreak dynamics with invertible neural networks and its application to the COVID-19 pandemics in Germany. PLoS Computational Biology 17, 10 (2021), e1009472.",
      "doi": ""
    },
    {
      "text": "Stefan T Radev, Ulf K Mertens, Andreas Voss, Lynton Ardizzone, and Ullrich Köthe. 2020. BayesFlow: Learning complex stochastic models with invertible neural networks. IEEE Transactions on Neural Networks and Learning Systems (2020).",
      "doi": ""
    },
    {
      "text": "Stefan T Radev, Ulf K Mertens, Andreas Voss, and Ullrich Köthe. 2020. Towards end-to-end likelihood-free inference with convolutional neural networks. British Journal of Mathematical and Statistical Psychology 73, 1(2020), 23–43.",
      "doi": ""
    },
    {
      "text": "Robert G Radwin, Gregg C Vanderheiden, and Mei-Li Lin. 1990. A method for evaluating head-controlled computer input devices using Fitts’ law. Human Factors 32, 4 (1990), 423–438.",
      "doi": "10.1177/001872089003200405"
    },
    {
      "text": "Roger Ratcliff. 1978. A theory of memory retrieval. Psychological Review 85, 2 (1978), 59–108.",
      "doi": ""
    },
    {
      "text": "Roger Ratcliff and Francis Tuerlinckx. 2002. Estimating parameters of the diffusion model: Approaches to dealing with contaminant reaction times and parameter variability. Psychonomic Bulletin & Review 9, 3 (2002), 438–481.",
      "doi": ""
    },
    {
      "text": "Danilo Rezende and Shakir Mohamed. 2015. Variational inference with normalizing flows. In International Conference on Machine Learning. PMLR, 1530–1538.",
      "doi": ""
    },
    {
      "text": "Dario D Salvucci. 2001. An integrated model of eye movements and visual encoding. Cognitive Systems Research 1, 4 (2001), 201–220.",
      "doi": "10.1016/S1389-0417%2800%2900015-2"
    },
    {
      "text": "Sayan Sarcar, Jussi PP Jokinen, Antti Oulasvirta, Zhenxin Wang, Chaklam Silpasuwanchai, and Xiangshi Ren. 2018. Ability-based optimization of touchscreen interactions. IEEE Pervasive Computing 17, 1 (2018), 15–26.",
      "doi": "10.1109/mprv.2018.011591058"
    },
    {
      "text": "Sayan Sarcar, Jussi Joklnen, Antti Oulasvirta, Chaklam Silpasuwanchai, Zhenxin Wang, and Xiangshi Ren. 2016. Towards ability-based optimization for aging users. In Proceedings of the International Symposium on Interactive Technology and Ageing Populations. 77–86.",
      "doi": "10.1145/2996267.2996275"
    },
    {
      "text": "John Schulman, Filip Wolski, Prafulla Dhariwal, Alec Radford, and Oleg Klimov. 2017. Proximal policy optimization algorithms. arXiv preprint arXiv:1707.06347(2017).",
      "doi": ""
    },
    {
      "text": "Alan A Stocker and Eero P Simoncelli. 2006. Noise characteristics and prior expectations in human visual speed perception. Nature Neuroscience 9, 4 (2006), 578–585.",
      "doi": ""
    },
    {
      "text": "Andreas Stuhlmüller, Jacob Taylor, and Noah Goodman. 2013. Learning stochastic inverses. Advances in Neural Information Processing Systems 26 (2013).",
      "doi": ""
    },
    {
      "text": "Kashyap Todi, Gilles Bailly, Luis Leiva, and Antti Oulasvirta. 2021. Adapting user interfaces with model-based reinforcement learning. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445497"
    },
    {
      "text": "Kashyap Todi, Jussi Jokinen, Kris Luyten, and Antti Oulasvirta. 2019. Individualising graphical layouts with predictive visual search models. ACM Transactions on Interactive Intelligent Systems 10, 1 (2019), 1–24.",
      "doi": "10.1145/3241381"
    },
    {
      "text": "Jonathan Tremblay, Aayush Prakash, David Acuna, Mark Brophy, Varun Jampani, Cem Anil, Thang To, Eric Cameracci, Shaad Boochoon, and Stan Birchfield. 2018. Training deep networks with synthetic data: Bridging the reality gap by domain randomization. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) Workshops. 969–977.",
      "doi": ""
    },
    {
      "text": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. Advances in Neural Information Processing Systems 30 (2017).",
      "doi": ""
    },
    {
      "text": "Martin J Wainwright and Michael I Jordan. 2008. Graphical models, exponential families, and variational inference. Foundations and Trends® in Machine Learning 1, 1–2(2008), 1–305.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Edward Cutrell, Susumu Harada, and I Scott MacKenzie. 2008. An error model for pointing based on Fitts’ law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1613–1622.",
      "doi": "10.1145/1357054.1357306"
    }
  ]
}