{
  "doi": "10.1145/3544548.3580759",
  "title": "Democratizing Making: Scaffolding Participation Using e-Waste to Engage Under-resourced Communities in Technology Design",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Maker culture and DIY practices are central to democratizing the design of technology; enabling non-designers (future end-users) to actively participate in the design process. However, little is known about how individuals from under-resourced communities and low socioeconomic status (SES) backgrounds, can practically leverage maker practices to design technology, creating value for themselves or their communities. To investigate this, we collaborated with an e-waste recycling centre, involving 24 participants (staff and low-SES volunteers) in two participatory maker workshop activities. Participants were provided with a generative e-waste toolkit, through which they repurposed e-waste materials and developed novel technology prototypes that created value from their perspectives and agendas. Our findings unpack three factors that influenced their making: balancing personal and community needs; incorporating convenience and productivity; and re-thinking sustainability and connection; and discuss strategies for scaffolding participation and engagement of under-resourced communities in making using an e-waste generative toolkit to democratize technology design.",
  "authors": [
    {
      "name": "Dhaval Vyas",
      "institution": "University of Queensland, Australia",
      "img": "/do/10.1145/contrib-81333491595/rel-imgonly/dhavalvyas4.jpg",
      "acmid": "81333491595",
      "orcid": "0000-0002-9356-0976"
    },
    {
      "name": "Awais Hameed Khan",
      "institution": "The University of Queensland, Australia",
      "img": "/do/10.1145/contrib-99659337900/rel-imgonly/linkedinphoto1.jpg",
      "acmid": "99659337900",
      "orcid": "0000-0003-3432-8445"
    },
    {
      "name": "Anabelle Cooper",
      "institution": "University of Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783291",
      "orcid": "0000-0002-3732-4805"
    }
  ],
  "references": [
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, and Md Rashidujjaman Rifat. 2015. Learning to fix: knowledge, collaboration and mobile phone repair in Dhaka, Bangladesh. Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (2015), 4. DOI:https://doi.org/10.1145/2737856.2738018",
      "doi": "10.1145/2737856.2738018"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Austin Toombs. 2014. Now That'S Definitely a Proper Hack: Self-Made Tools in Hackerspaces. Proceedings of the 32nd annual {ACM} conference on {Human} factors in computing systems (2014), 473–476. DOI:https://doi.org/10.1145/2556288.2557221",
      "doi": "10.1145/2556288.2557221"
    },
    {
      "text": "Eevi E. Beck. 2002. P for political - participation is not enough. Scandinavian Journal of Information Systems 14, (2002), 77–92.",
      "doi": ""
    },
    {
      "text": "Nataly Birbeck, Shaun Lawson, Kellie Morrissey, Tim Rapley, and Patrick Olivier. Self Harmony: Rethinking Hackathons to Design and Critique Digital Technologies for Those Affected by Self-Harm. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. DOI:https://doi.org/10.1145/3025453",
      "doi": "10.1145/3025453"
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory Design and “Democratizing Innovation.” In Proceedings of the 11th Biennial Participatory Design Conference (PDC ’10), ACM, New York, NY, USA, 41–50. DOI:https://doi.org/10.1145/1900441.1900448",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "Edward de Bono. 1970. Lateral thinking. Penguin London, UK.",
      "doi": ""
    },
    {
      "text": "Eva Brandt, Thomas Binder, and Elizabeth B.-N. Sanders. 2012. Tools and techniques: ways to engage telling, making and enacting. In Routledge international handbook of participatory design. Routledge, 165–201.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (January 2006), 77–101. DOI:https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Margot Brereton. 2009. Designing from Somewhere: A located, relational and transformative view of design. Re-) searching a digital Bauhaus (2009), 99–119.",
      "doi": ""
    },
    {
      "text": "Jacob Buur and Ben Matthews. 2008. Participatory Innovation: A Research Agenda. In Proceedings of the Tenth Anniversary Conference on Participatory Design 2008 (PDC ’08), Indiana University, Indianapolis, IN, USA, 186–189. Retrieved March 29, 2017 from http://dl.acm.org/citation.cfm?id=1795234.1795269",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Kayla Carucci and Kentaro Toyama. 2019. Making well-being: Exploring the role of makerspaces in long-term care facilities. In Conference on Human Factors in Computing Systems - Proceedings, Association for Computing Machinery, New York, New York, USA, 1–12. DOI:https://doi.org/10.1145/3290605.3300699",
      "doi": "10.1145/3290605.3300699"
    },
    {
      "text": "David Cuartielles, Jonathan Bean, and Daniela Rosner. 2015. Conversations on making. Interactions 22, 1 (January 2015), 22–24. DOI:https://doi.org/10.1145/2685366",
      "doi": "10.1145/2685366"
    },
    {
      "text": "Ana Delgado and Blanca Callén. 2016. Do-it-yourself biology and electronic waste hacking: A politics of demonstration in precarious times: http://dx.doi.org/10.1177/0963662516647348 26, 2 (May 2016), 179–194. DOI:https://doi.org/10.1177/0963662516647348",
      "doi": ""
    },
    {
      "text": "Kristin N Dew and Daniela K Rosner. 2018. Lessons from the Woodshop: Cultivating Design with Living Materials. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018). DOI:https://doi.org/10.1145/3173574",
      "doi": "10.1145/3173574"
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2019. Designing with Waste. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19, ACM Press, New York, New York, USA, 1307–1319. DOI:https://doi.org/10.1145/3322276.3322320",
      "doi": "10.1145/3322276.3322320"
    },
    {
      "text": "Kristin N. Dew, Samantha Shorey, and Daniela Rosner. 2018. Making within limits: Towards salvage fabrication. In ACM International Conference Proceeding Series, ACM Press, New York, New York, USA, 1–11. DOI:https://doi.org/10.1145/3232617.3232626",
      "doi": "10.1145/3232617.3232626"
    },
    {
      "text": "DiSalvoCarl, GreggMelissa, and LodatoThomas. 2014. Building belonging. Interactions 21, 4 (July 2014), 58–61. DOI:https://doi.org/10.1145/2628685",
      "doi": "10.1145/2628685"
    },
    {
      "text": "Pelle Ehn. 1988. Work-Oriented Design of Computer Artifacts. Stockholm: Arbetslivscentrum, Stockholm.",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Jeanette Falk, Gopinaath Kannabiran, and Nicolai Brodersen Hansen. 2021. What do hackathons do? understanding participation in hackathons through program theory analysis. Conference on Human Factors in Computing Systems - Proceedings (May 2021), 16. DOI:https://doi.org/10.1145/3411764.3445198",
      "doi": "10.1145/3411764.3445198"
    },
    {
      "text": "Jeanette Falk Olesen and Kim Halskov. 2020. 10 years of research with and on hackathons. DIS 2020 - Proceedings of the 2020 ACM Designing Interactive Systems Conference (July 2020), 1073–1088. DOI:https://doi.org/10.1145/3357236.3395543",
      "doi": "10.1145/3357236.3395543"
    },
    {
      "text": "Daniel Fallman. 2008. The interaction design research triangle of design practice, design studies, and design exploration. Design Issues 24, 3 (2008), 4–18.",
      "doi": ""
    },
    {
      "text": "Christiane Floyd, Wolf-Michael Mehl, Fanny-Michaela Reisin, Gerhard Schmidt, and Gregor Wolf. 1989. Out of Scandinavia: Alternative Approaches to Software Design and System Development. Hum.-Comput. Interact. 4, 4 (December 1989), 253–350. DOI:https://doi.org/10.1207/s15327051hci0404_1",
      "doi": "10.1207/s15327051hci0404_1"
    },
    {
      "text": "Sarah Fox and Sarah. 2015. Feminist Hackerspaces as Sites for Feminist Design. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition - C&C ’15, ACM Press, New York, New York, USA, 341–342. DOI:https://doi.org/10.1145/2757226.2764771",
      "doi": "10.1145/2757226.2764771"
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, and Daniela K. Rosner. 2015. Hacking culture, not devices: Access and recognition in feminist hackerspaces. CSCW 2015 - Proceedings of the 2015 ACM International Conference on Computer-Supported Cooperative Work and Social Computing (2015), 56–68. DOI:https://doi.org/10.1145/2675133.2675223",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Christopher Frauenberger, Katta Spiel, and Julia Makhaeva. 2018. Thinking OutsideTheBox - Designing Smart Things with Autistic Children. https://doi.org/10.1080/10447318.2018.1550177 35, 8 (May 2018), 666–678. DOI:https://doi.org/10.1080/10447318.2018.1550177",
      "doi": ""
    },
    {
      "text": "Benjamin Gaulon. 2022. Recyclism. Retrieved December 14, 2022 from https://www.recyclism.com/index.html",
      "doi": ""
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing Community-Based Collaborative Design. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (November 2019), 1–25. DOI:https://doi.org/10.1145/3359318",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Christina N. Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging Low-Income African American Older Adults in Health Discussions through Community-based Design Workshops. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM, New York, New York, USA, 1–15. DOI:https://doi.org/10.1145/3290605.3300823",
      "doi": "10.1145/3290605.3300823"
    },
    {
      "text": "Sonali Hedditch and Dhaval Vyas. 2021. A Gendered Perspective on Making from an Autoethnography in Makerspaces. Designing Interactive Systems Conference 2021 (June 2021), 1887–1901. DOI:https://doi.org/10.1145/3461778.3462015",
      "doi": "10.1145/3461778.3462015"
    },
    {
      "text": "Alexis Hope, Catherine D ’ Ignazio, Josephine Hoy, Rebecca Michelson, Jennifer Roberts, Kate Krontiris, Ethan Zuckerman, Catherine D'ignazio, and Rebecca Michel-Son. 2019. Hackathons as Participatory Design: Iterating Feminist Utopias. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019), 14. DOI:https://doi.org/10.1145/3290605",
      "doi": "10.1145/3290605"
    },
    {
      "text": "Eva Hornecker. 2010. Creative Idea Exploration Within the Structure of a Guiding Framework: The Card Brainstorming Game. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’10), ACM, New York, NY, USA, 101–108. DOI:https://doi.org/10.1145/1709886.1709905",
      "doi": "10.1145/1709886.1709905"
    },
    {
      "text": "Lara Houston and Steven J. Jackson. 2016. Caring for the “next billion” mobile handsets: Opening proprietary closures through the work of repair. ACM International Conference Proceeding Series 03-06-June, (2016). DOI:https://doi.org/10.1145/2909609.2909658",
      "doi": "10.1145/2909609.2909658"
    },
    {
      "text": "Lara Houston, Steven J. Jackson, Daniela K. Rosner, Syed Ishtiaque Ahmed, Meg Young, and Laewoo Kang. 2016. Values in Repair. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16 (2016), 1403–1414. DOI:https://doi.org/10.1145/2858036.2858470",
      "doi": "10.1145/2858036.2858470"
    },
    {
      "text": "Julie S. Hui and Elizabeth M. Gerber. 2017. Developing makerspaces as sites of entrepreneurship. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW (2017), 2023–2038. DOI:https://doi.org/10.1145/2998181.2998264",
      "doi": "10.1145/2998181.2998264"
    },
    {
      "text": "Jeremy Hunsinger and Andrew Schrock. 2018. Making Our World: The Hacker and Maker Movements in Context. (2018).",
      "doi": ""
    },
    {
      "text": "Lilly Irani. 2015. Hackathons and the Making of Entrepreneurial Citizenship. Science, Technology, & Human Values 40, 5 (September 2015), 799–824. DOI:https://doi.org/10.1177/0162243915578486",
      "doi": ""
    },
    {
      "text": "S J Jackson, S I Ahmed, and M R Rifat. 2014. Learning, Innovation, and Sustainability Among Mobile Phone Repairers in Dhaka, Bangladesh. Proceedings of the ACM Conference on Designing Interactive Systems (2014), 905–914.",
      "doi": "10.1145/2598510.2598576"
    },
    {
      "text": "Steven J. Jackson and Laewoo Kang. 2014. Breakdown, obsolescence and reuse: HCI and the art of repair. Conference on Human Factors in Computing Systems - Proceedings (2014), 449–458. DOI:https://doi.org/10.1145/2556288.2557332",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "Awais Hameed Khan and Ben Matthews. 2019. Democratizing Soap: The Methodological Value of Using Constructive Assemblies as a Participatory Design Tool. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 155–164. DOI:https://doi.org/10.1145/3294109.3295641",
      "doi": "10.1145/3294109.3295641"
    },
    {
      "text": "Awais Hameed Khan, Stephen Snow, Scott Heiner, Robert Hardgrove, Sarah Matthews, and Ben Matthews. 2020. The Politics of Materiality: Exploring Participatory Design Tools, Methods & Practices. In DRS2020 Synergy, Brisbane, Australia. DOI:https://doi.org/10.21606/drs.2020.246",
      "doi": ""
    },
    {
      "text": "Awais Hameed Khan, Stephen Snow, and Ben Matthews. 2020. Tracing Design: Practitioner Accounts of Design Value, Documentation & Practices. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (DIS ’20), Association for Computing Machinery, Eindhoven, Netherlands, 2091–2105. DOI:https://doi.org/10.1145/3357236.3395537",
      "doi": "10.1145/3357236.3395537"
    },
    {
      "text": "Sunyoung Kim and Eric Paulos. 2011. Practices in the creative reuse of e-waste. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11, ACM Press, New York, New York, USA, 2395. DOI:https://doi.org/10.1145/1978942.1979292",
      "doi": "10.1145/1978942.1979292"
    },
    {
      "text": "Beth Kolko, Alexis Hope, Brook Sattler, Kate Maccorkle, and Behzod Sirjani. 2012. Hackademia: Building Functional Rather Than Accredited Engineers. Pdc ’12 (2012), 1–10. DOI:https://doi.org/10.1145/2347635.2347654",
      "doi": "10.1145/2347635.2347654"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the expert amateur. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction Extending Boundaries - NordiCHI ’10, ACM Press, New York, New York, USA, 295. DOI:https://doi.org/10.1145/1868914.1868950",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Morten Kyng and Lars Mathiassen. 1979. Systems development and trade union activities. Computer Science Department, Aarhus University.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2008. A Cautious Prometheus? A Few Steps Toward a Philosophy of Design with Special Attention to Peter Sloterdijk. In In Medias Res (1st ed.), Willem Schinkel, Liesbeth Noordegraaf-Eelens, Lena Tsipouri and Vanja Stenius (eds.). Amsterdam University Press, 151–164. DOI:https://doi.org/10.1017/9789048514502.009",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Jessica L. Feuston, Caroline Edasis, and Anne Marie Piper. 2018. Making as Expression: Informing Design with People with Complex Communication Needs through Art Therapy. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18 (2018), 1–16. DOI:https://doi.org/10.1145/3173574.3173925",
      "doi": "10.1145/3173574.3173925"
    },
    {
      "text": "Chang Hee Lee, Dan Lockton, John Stevens, Stephen Jia Wang, and SungHee Ahn. 2019. Synaesthetic-Translation Tool: Synaesthesia as an Interactive Material for Ideation. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–6. DOI:https://doi.org/10.1145/3290607.3312849",
      "doi": "10.1145/3290607.3312849"
    },
    {
      "text": "Janis Lena Meissner, Pradthana Jarusriboonchai, Janice McLaughlin, and Peter Wright. More than the Sum of Makers The Complex Dynamics of Diverse Practices at Maker Faire. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 13. DOI:https://doi.org/10.1145/3290605",
      "doi": "10.1145/3290605"
    },
    {
      "text": "Silvia Lindtner, Anna Greenspan, and David Li. 2015. Designed in Shenzhen: Shanzhai Manufacturing and Maker Entrepreneurs. Aarhus Series on Human Centered Computing 1, 1 (2015), 12. DOI:https://doi.org/10.7146/aahcc.v1i1.21265",
      "doi": "10.7146/aahcc.v1i1.21265"
    },
    {
      "text": "Silvia Lindtner, Garnet D Hertz, and Paul Dourish. 2014. Emerging sites of HCI innovation: Hackerspaces, Hardware Startups & Incubators. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14 (2014), 439–448. DOI:https://doi.org/10.1145/2556288.2557132",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Nick Logler, Caroline Pitt, Xin Gao, Allison Marie Hishikawa, Jason Yip, and Batya Friedman. 2020. “I Feel Like This is a Bad Thing”: Investigating Disassembly in Action for Novices. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3313831.3376337",
      "doi": "10.1145/3313831.3376337"
    },
    {
      "text": "Lawrence E. Marks. 1975. On colored-hearing synesthesia: cross-modal translations of sensory dimensions. Psychological bulletin 82, 3 (1975), 303.",
      "doi": ""
    },
    {
      "text": "Janis Lena Meissner, John Vines, Janice McLaughlin, Thomas Nappey, Jekaterina Maksimova, and Peter Wright. 2017. Do-It-Yourself Empowerment as Experienced by Novice Makers with Disabilities. Proceedings of the 2017 Conference on Designing Interactive Systems - DIS ’17 1, (2017), 1053–1065. DOI:https://doi.org/10.1145/3064663.3064674",
      "doi": "10.1145/3064663.3064674"
    },
    {
      "text": "Jarkko Moilanen. 2012. Emerging Hackerspaces – Peer-Production Generation. IFIP Advances in Information and Communication Technology 378 AICT, (2012), 94–111. DOI:https://doi.org/10.1007/978-3-642-33442-9_7",
      "doi": ""
    },
    {
      "text": "Emily Porter, Chris Bopp, Elizabeth Gerber, and Amy Voida. Reappropriating Hackathons: The Production Work of the CHI4Good Day of Service. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. DOI:https://doi.org/10.1145/3025453",
      "doi": "10.1145/3025453"
    },
    {
      "text": "Jenny Preece, Yvonne Rogers, and Helen Sharp. 2015. Interaction Design: Beyond Human-Computer Interaction. John Wiley & Sons.",
      "doi": "10.5555/1215597"
    },
    {
      "text": "Robert Racadio, Emma J. Rose, and Beth E. Kolko. 2014. Research at the margin: Participatory design and community based participatory research. In ACM International Conference Proceeding Series, Association for Computing Machinery, 49–52. DOI:https://doi.org/10.1145/2662155.2662188",
      "doi": "10.1145/2662155.2662188"
    },
    {
      "text": "Matt Ratto and Megan Boler. DIY citizenship: critical making and social media. 461.",
      "doi": ""
    },
    {
      "text": "Horst WJ Rittel. 1973. The state of the art in design methods. Design Research and Methods 7, 2 (1973), 143–147.",
      "doi": ""
    },
    {
      "text": "Toni Robertson and Jesper Simonsen. 2012. Routledge International Handbook of Participatory Design. Routledge.",
      "doi": ""
    },
    {
      "text": "Pamela J. Robinson and Peter A. Johnson. 2016. Civic hackathons: New terrain for local government-citizen interaction? Urban Planning 1, 2 (2016), 65–74. DOI:https://doi.org/10.17645/UP.V1I2.627",
      "doi": ""
    },
    {
      "text": "RoedlDavid, BardzellShaowen, and BardzellJeffrey. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 3 (June 2015). DOI:https://doi.org/10.1145/2699742",
      "doi": "10.1145/2699742"
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, Margot Brereton, Kate Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never too old: Engaging retired people inventing the future with MaKey MaKey. In Conference on Human Factors in Computing Systems - Proceedings, Association for Computing Machinery, New York, New York, USA, 3913–3922. DOI:https://doi.org/10.1145/2556288.2557184",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "Valentina Rognoli and Ernesto Oroza. 2015. “Worker, build your own machinery!” A workshop to practice the Technological Disobedience. 324–333. Retrieved December 14, 2022 from https://re.public.polimi.it/retrieve/e0c31c08-b4d5-4599-e053-1705fe0aef77/Rognoli_Oroza%2042%20final.pdf",
      "doi": ""
    },
    {
      "text": "Elizabeth BN Sanders. 1999. Postdesign and participatory culture. Proceedings of Useful and Critical: The Position of Research in Design. University of Art and Design, Helsinki (1999).",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders, Eva Brandt, and Thomas Binder. 2010. A framework for organizing the tools and techniques of participatory design. ACM Press, 195. DOI:https://doi.org/10.1145/1900441.1900476",
      "doi": "10.1145/1900441.1900476"
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. CoDesign 4, 1 (March 2008), 5–18. DOI:https://doi.org/10.1080/15710880701875068",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. CoDesign 10, 1 (January 2014), 5–14. DOI:https://doi.org/10.1080/15710882.2014.888183",
      "doi": ""
    },
    {
      "text": "Donald A. Schön. 1983. The Reflective Practitioner: How Professionals Think in Action. Basic books.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and James R. Griesemer. 1989. Institutional ecology,translations’ and boundary objects: Amateurs and professionals in Berkeley's Museum of Vertebrate Zoology, 1907-39. Social studies of science 19, 3 (1989), 387–420.",
      "doi": ""
    },
    {
      "text": "Oliver Stickel, Dominik Hornung, and Konstantin Aal. 2015. 3D Printing with Marginalised Children - An Exploration in a Palestinian Refugee Camp. ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19-23 September 2015, Oslo, Norway September (2015), 19–23. DOI:https://doi.org/10.1007/978-3-319-20499-4",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Communications of the ACM 38, 9 (1995), 56–64.",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Yuling Sun, Silvia Lindtner, Xianghua Ding, Tun Lu, and Ning Gu. 2015. Reliving the Past & Making a Harmonious Society Today. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15, ACM Press, New York, New York, USA, 44–55. DOI:https://doi.org/10.1145/2675133.2675195",
      "doi": "10.1145/2675133.2675195"
    },
    {
      "text": "K. Tanenbaum, J. Williams, A. Desjardins, A., Tanenbaum. 2013. Democratizing technology: Pleasure, Utility and Expressiveness in DIY and Maker Practice. CHI 2013: Changing Perspectives, Paris., France 1 (2013), 2603–2612. DOI:https://doi.org/10.1080/09505439609526460",
      "doi": ""
    },
    {
      "text": "Joshua Tanenbaum, Karen Tanenbaum, and Ron Wakkary. 2012. Steampunk as design fiction. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12, ACM Press, Austin, Texas, USA, 1583. DOI:https://doi.org/10.1145/2207676.2208279",
      "doi": "10.1145/2207676.2208279"
    },
    {
      "text": "Jennyfer Lawrence J.L. Taylor, Dhaval Vyas, and Tony Sharp. 2017. Diversity and coherence in a hackerspace for people from a low socioeconomic community. In Proceedings of the 29th Australian Conference on Computer-Human Interaction - OZCHI ’17, ACM Press, New York, New York, USA, 238–247. DOI:https://doi.org/10.1145/3152771.3152797",
      "doi": "10.1145/3152771.3152797"
    },
    {
      "text": "Nick Taylor and Loraine Clarke. 2018. Everybody's Hacking: Participation and the Mainstreaming of Hackathons. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–12. DOI:https://doi.org/10.1145/3173574.3173746",
      "doi": "10.1145/3173574.3173746"
    },
    {
      "text": "Nick Taylor, Loraine Clarke, and Katerina Gorkovenko. 2017. Community Inventor days: Scaffolding grassroots innovation with maker events. In DIS 2017 - Proceedings of the 2017 ACM Conference on Designing Interactive Systems, 1201–1212. DOI:https://doi.org/10.1145/3064663.3064723",
      "doi": "10.1145/3064663.3064723"
    },
    {
      "text": "Nick Taylor, Loraine Clarke, Martin Skelly, and Sara Nevay. 2018. Strategies for engaging communities in creating physical civic technologies. In Conference on Human Factors in Computing Systems - Proceedings, Association for Computing Machinery, New York, New York, USA, 1–12. DOI:https://doi.org/10.1145/3173574.3174081",
      "doi": "10.1145/3173574.3174081"
    },
    {
      "text": "Nick Taylor, Ursula Hurley, and Philip Connolly. 2016. Making community: the wider role of makerspaces in public life. CHI ’16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 1415–1425. DOI:https://doi.org/10.1145/2858036.2858073",
      "doi": "10.1145/2858036.2858073"
    },
    {
      "text": "Austin L. Toombs. 2017. Hackerspace Tropes, Identities, and Community Values. In Proceedings of the 2017 Conference on Designing Interactive Systems - DIS ’17, ACM Press, New York, New York, USA, 1079–1091. DOI:https://doi.org/10.1145/3064663.3064760",
      "doi": "10.1145/3064663.3064760"
    },
    {
      "text": "Dhaval Vyas. 2019. Altruism and wellbeing as care work in a craft-based maker culture. Proceedings of the ACM on Human-Computer Interaction 3, GROUP (2019). DOI:https://doi.org/10.1145/3361120",
      "doi": "10.1145/3361120"
    },
    {
      "text": "Dhaval Vyas. 2012. Domestic artefacts: sustainability in the context of indian middle class. In Proceedings of the 4th international conference on Intercultural Collaboration (ICIC ’12), Association for Computing Machinery, New York, NY, USA, 119–128. DOI:https://doi.org/10.1145/2160881.2160900",
      "doi": "10.1145/2160881.2160900"
    },
    {
      "text": "Dhaval Vyas. 2020. Life improvements: DIY in low socio-economic status communities. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, Association for Computing Machinery, New York, NY, USA, 407–412. DOI:https://doi.org/10.1145/3406865.3418325",
      "doi": "10.1145/3406865.3418325"
    },
    {
      "text": "Dhaval Vyas and John Vines. 2019. Making at the margins: Making in an Under-resourced e-Waste Recycling Centre. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (November 2019). DOI: https://doi.org/10.1145/3359290",
      "doi": "10.1145/3359290"
    },
    {
      "text": "Dhaval Vyas and Diogo Quental. 2022. \"It's Just Like doing Meditation\": Making at a Community Men's Shed. Proc. ACM Hum.-Comput. Interact. 7, GROUP, Article 14 (January 2023), 28 pages. https://doi.org/10.1145/3567564",
      "doi": "10.1145/3567564"
    },
    {
      "text": "Kristin Williams, Rajitha Pulivarthy, Scott E. Hudson, and Jessica Hammer. 2020. The Upcycled Home: Removing Barriers to Lightweight Modification of the Home's Everyday Objects. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3313831.3376314",
      "doi": "10.1145/3313831.3376314"
    },
    {
      "text": "Langdon Winner. 1980. Do Artifacts Have Politics? Daedalus 109, 1 (1980), 121–136.",
      "doi": ""
    }
  ]
}