{
  "doi": "10.1145/3544548.3580731",
  "title": "Multiple Device Users’ Actual and Ideal Cross-Device Usage for Multi-Stage Notification-Interactions: An ESM Study Addressing the Usage Gap and Impacts of Device Context",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "People nowadays can use multiple devices to interact with notifications, whether via noticing, glancing, reading, or acting upon them. Prior research has focused on actual usage or on device preferences. However, users’ ideal experience of cross-device notification-interaction might differ from their current practices (due to situational limitations) and/or across the four notification-interaction stages. We therefore conducted an experience-sampling method study with multi-device users to investigate these gaps and the influence of device context. Our results reveal that nearly half of the time, the non-phone devices the participants had ranked as their top preferences for notification-interaction were not actually used, due to the devices’ context. Beyond device context, the participants’ choices of devices for notification-interaction were heavily determined by 1) their preferences that particular notification-interaction stages to take place (or not) on particular devices; and 2) the device on which they had undertaken the former stage.",
  "authors": [
    {
      "name": "Fang-Ching Tseng",
      "institution": "Department of Computer Science and Information Engineering, National Taiwan University, Taiwan and Undergraduate Honors Program of Electrical Engineering and Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779615",
      "orcid": "0000-0001-7968-0835"
    },
    {
      "name": "Zih-Yun Chiou",
      "institution": "Institute of Artificial Intelligence Innovation, National Yang Ming Chiao Tung University, Taiwan and Undergraduate Honors Program of Electrical Engineering and Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783512",
      "orcid": "0000-0003-2816-7315"
    },
    {
      "name": "Ho-Hsuan Chuang",
      "institution": "Undergraduate Honors Program of Electrical Engineering and Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780690",
      "orcid": "0000-0001-9828-5726"
    },
    {
      "name": "Li-Ting Su",
      "institution": "Institute of Multimedia Engineering, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780443",
      "orcid": "0000-0002-7476-8173"
    },
    {
      "name": "Yong-Han Lin",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/do/10.1145/contrib-99660481557/rel-imgonly/74231828_1528529383952029_8956399390881218560_o.jpg",
      "acmid": "99660481557",
      "orcid": "0000-0003-1611-3440"
    },
    {
      "name": "Yu-Rou Lin",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783493",
      "orcid": "0000-0003-2633-2583"
    },
    {
      "name": "Yi-Chi Lee",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783416",
      "orcid": "0000-0002-3850-8542"
    },
    {
      "name": "Peng-Jui Wang",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780624",
      "orcid": "0000-0003-4139-8695"
    },
    {
      "name": "Uei-Dar Chen",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782488",
      "orcid": "0000-0001-9019-8265"
    },
    {
      "name": "Yung-Ju Chang",
      "institution": "Department of Computer Science, National Yang Ming Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019794",
      "orcid": "0000-0001-6956-3459"
    }
  ],
  "references": [
    {
      "text": "Piotr D. Adamczyk and Brian P. Bailey. 2004. If not now, when? the effects of interruption at different moments within task execution. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’04). Association for Computing Machinery, New York, NY, USA, 271–278. https://doi.org/10.1145/985692.985727",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Daniel L. Ashbrook, James R. Clawson, Kent Lyons, Thad E. Starner, and Nirmal Patel. 2008. Quickdraw: The Impact of Mobility and on-Body Placement on Device Access Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 219–222. https://doi.org/10.1145/1357054.1357092",
      "doi": "10.1145/1357054.1357092"
    },
    {
      "text": "Jonas Auda, Dominik Weber, Alexandra Voit, and Stefan Schneegass. 2018. Understanding User Preferences towards Rule-based Notification Deferral. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188688",
      "doi": "10.1145/3170427.3188688"
    },
    {
      "text": "Jiang Bian, Anlei Dong, Xiaofeng He, Srihari Reddy, and Yi Chang. 2013. User Action Interpretation for Online Content Optimization. IEEE Transactions on Knowledge and Data Engineering 25, 9 (Sept. 2013), 2161–2174. https://doi.org/10.1109/TKDE.2012.130 Conference Name: IEEE Transactions on Knowledge and Data Engineering.",
      "doi": "10.1109/TKDE.2012.130"
    },
    {
      "text": "Leslie H Brown, Timothy Strauman, Neus Barrantes-Vidal, Paul J Silvia, and Thomas R Kwapil. 2011. An experience-sampling study of depressive symptoms and their social context. The Journal of nervous and mental disease 199, 6 (2011), 403–409.",
      "doi": ""
    },
    {
      "text": "Michael Bub, Evgeny Volynsky, and Wolfgang Wörndl. 2018. User Acceptance of Proactive Recommendations on Smartphone and Smartwatch. In Adjunct Publication of the 26th Conference on User Modeling, Adaptation and Personalization(UMAP ’18). Association for Computing Machinery, New York, NY, USA, 143–150. https://doi.org/10.1145/3213586.3226210",
      "doi": "10.1145/3213586.3226210"
    },
    {
      "text": "Seyma Kucukozer Cavdar, Tugba Taskaya-Temizel, Mirco Musolesi, and Peter Tino. 2020. A Multi-perspective Analysis of Social Context and Personal Factors in Office Settings for the Design of an Effective Mobile Notification System. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 1 (2020), 15:1–15:38. https://doi.org/10.1145/3381000",
      "doi": "10.1145/3381000"
    },
    {
      "text": "M. Cecchinato, A. Sellen, M. Shokouhi, and G. Smyth. 2016. Finding email in a multi-account, multi-device world. http://dx.doi.org/10.1145/2858036.2858473 Conference Name: CHI 2016 Conference on Human Factors in Computing Systems Meeting Name: CHI 2016 Conference on Human Factors in Computing Systems Pages: 1200-1210 Place: New York, NY, USA Publisher: ACM publishing.",
      "doi": "10.1145/2858036.2858473"
    },
    {
      "text": "Marta E. Cecchinato, Anna L. Cox, and Jon Bird. 2017. Always On(line)? User Experience of Smartwatches and their Role within Multi-Device Ecologies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 3557–3568. https://doi.org/10.1145/3025453.3025538",
      "doi": "10.1145/3025453.3025538"
    },
    {
      "text": "Chung Chiao Chang, Meng-Hsin Wu, Yu-Jen Lee, XiJing Chang, and Yung-Ju Chang. 2021. Opportune Moments for the Multi-Stage Notification Responding Process: A Preliminary Investigation. In Adjunct Proceedings of the 2021 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2021 ACM International Symposium on Wearable Computers. 9–10.",
      "doi": ""
    },
    {
      "text": "Yung-Ju Chang, Yi-Ju Chung, and Yi-Hao Shih. 2019. I Think It’s Her: Investigating Smartphone Users’ Speculation about Phone Notifications and Its Influence on Attendance. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3338286.3340125",
      "doi": "10.1145/3338286.3340125"
    },
    {
      "text": "Yung-Ju Chang and John C. Tang. 2015. Investigating Mobile Users’ Ringer Mode Usage and Attentiveness and Responsiveness to Communication. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 6–15. https://doi.org/10.1145/2785830.2785852",
      "doi": "10.1145/2785830.2785852"
    },
    {
      "text": "Sunny Consolvo and Miriam Walker. 2003. Using the experience sampling method to evaluate ubicomp applications. IEEE pervasive computing 2, 2 (2003), 24–31.",
      "doi": "10.1109/MPRV.2003.1203750"
    },
    {
      "text": "Fulvio Corno, Luigi De Russis, and Teodoro Montanaro. 2015. A Context and User Aware Smart Notification System. https://doi.org/10.1109/WF-IoT.2015.7389130",
      "doi": "10.1109/WF-IoT.2015.7389130"
    },
    {
      "text": "Fulvio Corno, Luigi De Russis, and Alberto Roffarello. 2018. AwareNotifications: Multi-Device Semantic Notification Handling with User-Defined Preferences. Journal of Ambient Intelligence and Smart Environments 10 (Aug. 2018). https://doi.org/10.3233/AIS-180492",
      "doi": "10.3233/AIS-180492"
    },
    {
      "text": "Mihaly Csikszentmihalyi and Reed Larson. 2014. Validity and reliability of the experience-sampling method. In Flow and the foundations of positive psychology. Springer, 35–54.",
      "doi": ""
    },
    {
      "text": "David Dearman and Jeffery S. Pierce. 2008. It’s on my other computer! computing with multiple devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). Association for Computing Machinery, New York, NY, USA, 767–776. https://doi.org/10.1145/1357054.1357177",
      "doi": "10.1145/1357054.1357177"
    },
    {
      "text": "Tilman Dingler and Martin Pielot. 2015. I’ll be there for you: Quantifying Attentiveness towards Mobile Messaging. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/2785830.2785840",
      "doi": "10.1145/2785830.2785840"
    },
    {
      "text": "Jon D. Elhai, Dmitri Rozgonjuk, Ahmad M. Alghraibeh, and Haibo Yang. 2021. Disrupted Daily Activities From Interruptive Smartphone Notifications: Relations With Depression and Anxiety Severity and the Mediating Role of Boredom Proneness. Social Science Computer Review 39, 1 (Feb. 2021), 20–37. https://doi.org/10.1177/0894439319858008 Publisher: SAGE Publications Inc.",
      "doi": "10.1177/0894439319858008"
    },
    {
      "text": "Anja Exler, Marcel Braith, Kristina Mincheva, Andrea Schankin, and Michael Beigl. 2018. Smartphone-Based Estimation of a User Being in Company or Alone Based on Place, Time, and Activity. In Mobile Computing, Applications, and Services(Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering), Kazuya Murao, Ren Ohmura, Sozo Inoue, and Yusuke Gotoh (Eds.). Springer International Publishing, Cham, 74–89. https://doi.org/10.1007/978-3-319-90740-6_5",
      "doi": ""
    },
    {
      "text": "Joel E. Fischer, Chris Greenhalgh, and Steve Benford. 2011. Investigating episodes of mobile phone activity as indicators of opportune moments to deliver notifications. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services(MobileHCI ’11). Association for Computing Machinery, New York, NY, USA, 181–190. https://doi.org/10.1145/2037373.2037402",
      "doi": "10.1145/2037373.2037402"
    },
    {
      "text": "Joel E. Fischer, Nick Yee, Victoria Bellotti, Nathan Good, Steve Benford, and Chris Greenhalgh. 2010. Effects of content and time of delivery on receptivity to mobile interruptions. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services(MobileHCI ’10). Association for Computing Machinery, New York, NY, USA, 103–112. https://doi.org/10.1145/1851600.1851620",
      "doi": "10.1145/1851600.1851620"
    },
    {
      "text": "Anthony G. Greenwald and Mahzarin R. Banaji. 1995. Implicit social cognition: Attitudes, self-esteem, and stereotypes. Psychological Review 102(1995), 4–27. https://doi.org/10.1037/0033-295X.102.1.4 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Jens Grubert, Matthias Kranz, and Aaron Quigley. 2016. Challenges in Mobile Multi-Device Ecosystems. mUX: The Journal of Mobile User Experience 5, 1 (Dec. 2016), 5. https://doi.org/10.1186/s13678-016-0007-y arXiv:1605.07760 [cs].",
      "doi": ""
    },
    {
      "text": "Marcelo Guzman, Gustavo López, and Luis A. Guerrero. 2018. Human Factors Affecting the Development of Smart Device-Based Notifications. In Advances in Human Factors and Systems Interaction(Advances in Intelligent Systems and Computing), Isabel L. Nunes (Ed.). Springer International Publishing, Cham, 251–259. https://doi.org/10.1007/978-3-319-60366-7_24",
      "doi": ""
    },
    {
      "text": "Daniel Harrison and Marta E. Cecchinato. 2015. \"Give me five minutes!\": feeling time slip by. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers(UbiComp/ISWC’15 Adjunct). Association for Computing Machinery, New York, NY, USA, 45–48. https://doi.org/10.1145/2800835.2800858",
      "doi": "10.1145/2800835.2800858"
    },
    {
      "text": "Joyce Ho and Stephen S. Intille. 2005. Using context-aware computing to reduce the perceived burden of interruptions from mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’05). Association for Computing Machinery, New York, NY, USA, 909–918. https://doi.org/10.1145/1054972.1055100",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2007. Understanding and developing models for detecting and differentiating breakpoints during interactive tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). Association for Computing Machinery, New York, NY, USA, 697–706. https://doi.org/10.1145/1240624.1240732",
      "doi": "10.1145/1240624.1240732"
    },
    {
      "text": "Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 3903–3912. https://doi.org/10.1145/2702123.2702211",
      "doi": "10.1145/2702123.2702211"
    },
    {
      "text": "Amy K. Karlson, Shamsi T. Iqbal, Brian Meyers, Gonzalo Ramos, Kathy Lee, and John C. Tang. 2010. Mobile taskflow in context: a screenshot study of smartphone usage. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, New York, NY, USA, 2009–2018. https://doi.org/10.1145/1753326.1753631",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "Fahim Kawsar and A.J. Bernheim Brush. 2013. Home computing unplugged: why, where and when people use different connected devices at home. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing(UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 627–636. https://doi.org/10.1145/2493432.2493494",
      "doi": "10.1145/2493432.2493494"
    },
    {
      "text": "Inyeop Kim, Hwarang Goh, Youngtae Noh, and Uichin Lee. 2021. Poster: Exploring User Contexts and Needs for Context-aware Smartphone Distraction Management. In Adjunct Proceedings of the 2021 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2021 ACM International Symposium on Wearable Computers(UbiComp ’21). Association for Computing Machinery, New York, NY, USA, 41–43. https://doi.org/10.1145/3460418.3479307",
      "doi": "10.1145/3460418.3479307"
    },
    {
      "text": "Kostadin Kushlev, Jason Proulx, and Elizabeth W. Dunn. 2016. \"Silence Your Phones\": Smartphone Notifications Increase Inattention and Hyperactivity Symptoms. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 1011–1020. https://doi.org/10.1145/2858036.2858359",
      "doi": "10.1145/2858036.2858359"
    },
    {
      "text": "Alexandra Kuznetsova, Per B. Brockhoff, and Rune H. B. Christensen. 2017. lmerTest Package: Tests in Linear Mixed Effects Models. Journal of Statistical Software 82, 13 (2017), 1–26. https://doi.org/10.18637/jss.v082.i13",
      "doi": ""
    },
    {
      "text": "Hao-Ping Lee, Kuan-Yin Chen, Chih-Heng Lin, Chia-Yu Chen, Yu-Lin Chung, Yung-Ju Chang, and Chien-Ru Sun. 2019. Does Who Matter? Studying the Impact of Relationship Characteristics on Receptivity to Mobile IM Messages. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300756",
      "doi": "10.1145/3290605.3300756"
    },
    {
      "text": "Luis Leiva, Matthias Böhmer, Sven Gehring, and Antonio Krüger. 2012. Back to the app: the costs of mobile application interruptions. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services(MobileHCI ’12). Association for Computing Machinery, New York, NY, USA, 291–294. https://doi.org/10.1145/2371574.2371617",
      "doi": "10.1145/2371574.2371617"
    },
    {
      "text": "Tianshi Li, Julia Katherine Haines, Miguel Flores Ruiz de Eguino, Jason I. Hong, and Jeffrey Nichols. 2021. Alert Now or Never: Understanding and Predicting Notification Preferences of Smartphone Users. ACM Transactions on Computer-Human Interaction (2021). https://doi.org/10.1145/3478868 Just Accepted.",
      "doi": "10.1145/3478868"
    },
    {
      "text": "Tzu-Chieh Lin, Yu-Shao Su, Emily Helen Yang, Yun Han Chen, Hao-Ping Lee, and Yung-Ju Chang. 2021. “Put it on the Top, I’ll Read it Later”: Investigating Users’ Desired Display Order for Smartphone Notifications. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3411764.3445384",
      "doi": "10.1145/3411764.3445384"
    },
    {
      "text": "Andrés Lucero. 2015. Using Affinity Diagrams to Evaluate Interactive Prototypes. In Human-Computer Interaction – INTERACT 2015(Lecture Notes in Computer Science), Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 231–248. https://doi.org/10.1007/978-3-319-22668-2_19",
      "doi": "10.1007/978-3-319-22668-2_19"
    },
    {
      "text": "Afra Mashhadi, Akhil Mathur, and Fahim Kawsar. 2014. The myth of subtle notifications. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication(UbiComp ’14 Adjunct). Association for Computing Machinery, New York, NY, USA, 111–114. https://doi.org/10.1145/2638728.2638759",
      "doi": "10.1145/2638728.2638759"
    },
    {
      "text": "Abhinav Mehrotra, Robert Hendley, and Mirco Musolesi. 2019. NotifyMeHere: Intelligent Notification Delivery in Multi-Device Environments. In Proceedings of the 2019 Conference on Human Information Interaction and Retrieval(CHIIR ’19). Association for Computing Machinery, New York, NY, USA, 103–111. https://doi.org/10.1145/3295750.3298932",
      "doi": "10.1145/3295750.3298932"
    },
    {
      "text": "Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing content-driven intelligent notification mechanisms for mobile applications. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 813–824. https://doi.org/10.1145/2750858.2807544",
      "doi": "10.1145/2750858.2807544"
    },
    {
      "text": "Abhinav Mehrotra, Veljko Pejovic, Jo Vermeulen, Robert Hendley, and Mirco Musolesi. 2016. My Phone and Me: Understanding People’s Receptivity to Mobile Notifications. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 1021–1032. https://doi.org/10.1145/2858036.2858566",
      "doi": "10.1145/2858036.2858566"
    },
    {
      "text": "Abhinav Mehrotra, Fani Tsapeli, Robert Hendley, and Mirco Musolesi. 2017. MyTraces: Investigating Correlation and Causation between Users’ Emotional States and Mobile Phone Interaction. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 83:1–83:21. https://doi.org/10.1145/3130948",
      "doi": "10.1145/3130948"
    },
    {
      "text": "Alberto Monge Roffarello and Luigi De Russis. 2021. Coping with Digital Wellbeing in a Multi-Device World. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3411764.3445076",
      "doi": "10.1145/3411764.3445076"
    },
    {
      "text": "Ngoc Thi Nguyen, Agustin Zuniga, Huber Flores, Hyowon Lee, Simon Tangi Perrault, and Petteri Nurmi. 2021. Intelligent Shifting Cues: Increasing the Awareness of Multi-Device Interaction Opportunities. In Proceedings of the 29th ACM Conference on User Modeling, Adaptation and Personalization(UMAP ’21). Association for Computing Machinery, New York, NY, USA, 213–223. https://doi.org/10.1145/3450613.3456839",
      "doi": "10.1145/3450613.3456839"
    },
    {
      "text": "Tadashi Okoshi, Julian Ramos, Hiroki Nozaki, Jin Nakazawa, Anind K. Dey, and Hideyuki Tokuda. 2015. Reducing users’ perceived mental effort due to interruptive notifications in multi-device mobile environments. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 475–486. https://doi.org/10.1145/2750858.2807517",
      "doi": "10.1145/2750858.2807517"
    },
    {
      "text": "Antti Oulasvirta and Lauri Sumari. 2007. Mobile kits and laptop trays: managing multiple devices in mobile information work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). Association for Computing Machinery, New York, NY, USA, 1127–1136. https://doi.org/10.1145/1240624.1240795",
      "doi": "10.1145/1240624.1240795"
    },
    {
      "text": "Chunjong Park, Junsung Lim, Juho Kim, Sung-Ju Lee, and Dongman Lee. 2017. Don’t Bother Me. I’m Socializing! A Breakpoint-Based Smartphone Notification System. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). Association for Computing Machinery, New York, NY, USA, 541–554. https://doi.org/10.1145/2998181.2998189",
      "doi": "10.1145/2998181.2998189"
    },
    {
      "text": "Veljko Pejovic and Mirco Musolesi. 2014. InterruptMe: designing intelligent prompting mechanisms for pervasive applications. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’14). Association for Computing Machinery, New York, NY, USA, 897–908. https://doi.org/10.1145/2632048.2632062",
      "doi": "10.1145/2632048.2632062"
    },
    {
      "text": "Veljko Pejovic, Mirco Musolesi, and Abhinav Mehrotra. 2015. Investigating The Role of Task Engagement in Mobile Interruptibility. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 1100–1105. https://doi.org/10.1145/2786567.2794336",
      "doi": "10.1145/2786567.2794336"
    },
    {
      "text": "Martin Pielot, Karen Church, and Rodrigo de Oliveira. 2014. An in-situ study of mobile phone notifications. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services(MobileHCI ’14). Association for Computing Machinery, New York, NY, USA, 233–242. https://doi.org/10.1145/2628363.2628364",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Martin Pielot, Rodrigo de Oliveira, Haewoon Kwak, and Nuria Oliver. 2014. Didn’t you see my message? predicting attentiveness to mobile instant messages. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 3319–3328. https://doi.org/10.1145/2556288.2556973",
      "doi": "10.1145/2556288.2556973"
    },
    {
      "text": "Martin Pielot, Tilman Dingler, Jose San Pedro, and Nuria Oliver. 2015. When attention is not scarce - detecting boredom from mobile phone usage. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 825–836. https://doi.org/10.1145/2750858.2804252",
      "doi": "10.1145/2750858.2804252"
    },
    {
      "text": "Martin Pielot, Amalia Vradi, and Souneil Park. 2018. Dismissed! a detailed exploration of how mobile phone users handle push notifications. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3229434.3229445",
      "doi": "10.1145/3229434.3229445"
    },
    {
      "text": "Henning Pohl, Justyna Medrek, and Michael Rohs. 2016. ScatterWatch: Subtle Notifications via Indirect Illumination Scattered in the Skin. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 7–16. https://doi.org/10.1145/2935334.2935351",
      "doi": "10.1145/2935334.2935351"
    },
    {
      "text": "Aditya Ponnada, Jixin Li, Shirlene Wang, Wei-Lin Wang, Bridgette Do, Genevieve F. Dunton, and Stephen S. Intille. 2022. Contextual Biases in Microinteraction Ecological Momentary Assessment (MEMA) Non-Response. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 1, Article 26 (mar 2022), 24 pages. https://doi.org/10.1145/3517259",
      "doi": "10.1145/3517259"
    },
    {
      "text": "Umar Rashid, Miguel A. Nacenta, and Aaron Quigley. 2012. The cost of display switching: a comparison of mobile, large display and hybrid UI configurations. In Proceedings of the International Working Conference on Advanced Visual Interfaces(AVI ’12). Association for Computing Machinery, New York, NY, USA, 99–106. https://doi.org/10.1145/2254556.2254577",
      "doi": "10.1145/2254556.2254577"
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-scale assessment of mobile notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 3055–3064. https://doi.org/10.1145/2556288.2557189",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "Stephanie Santosa and Daniel Wigdor. 2013. A field study of multi-device workflows in distributed workspaces. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing(UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 63–72. https://doi.org/10.1145/2493432.2493476",
      "doi": "10.1145/2493432.2493476"
    },
    {
      "text": "Florian Schulze and Georg Groh. 2014. Studying how character of conversation affects personal receptivity to mobile notifications. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 1729–1734. https://doi.org/10.1145/2559206.2581320",
      "doi": "10.1145/2559206.2581320"
    },
    {
      "text": "Florian Schulze and Georg Groh. 2016. Conversational context helps improve mobile notification management. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 518–528. https://doi.org/10.1145/2935334.2935347",
      "doi": "10.1145/2935334.2935347"
    },
    {
      "text": "Alireza Sahami Shirazi and Niels Henze. 2015. Assessment of Notifications on Smartwatches. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 1111–1116. https://doi.org/10.1145/2786567.2794338",
      "doi": "10.1145/2786567.2794338"
    },
    {
      "text": "Eran Toch, Hadas Chassidim, and Tali Hatuka. 2020. Can you Turn it Off? The Spatial and Social Context of Mobile Disturbance. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 91:1–91:18. https://doi.org/10.1145/3415162",
      "doi": "10.1145/3415162"
    },
    {
      "text": "J. Gregory Trafton, Erik M Altmann, Derek P Brock, and Farilee E Mintz. 2003. Preparing to resume an interrupted task: effects of prospective goal encoding and retrospective rehearsal. International Journal of Human-Computer Studies 58, 5 (May 2003), 583–603. https://doi.org/10.1016/S1071-5819(03)00023-5",
      "doi": "10.1016/S1071-5819%2803%2900023-5"
    },
    {
      "text": "Liam D. Turner. 2017. Decomposing responses to mobile notifications. phd. Cardiff University. https://orca.cardiff.ac.uk/id/eprint/102135/",
      "doi": ""
    },
    {
      "text": "Liam D. Turner, Stuart M. Allen, and Roger M. Whitaker. 2015. Push or Delay? Decomposing Smartphone Notification Response Behaviour. In Human Behavior Understanding(Lecture Notes in Computer Science), Albert Ali Salah, Ben J.A. Kröse, and Diane J. Cook (Eds.). Springer International Publishing, Cham, 69–83. https://doi.org/10.1007/978-3-319-24195-1_6",
      "doi": "10.1007/978-3-319-24195-1_6"
    },
    {
      "text": "Liam D. Turner, Stuart M. Allen, and Roger M. Whitaker. 2017. Reachable but not receptive: Enhancing smartphone interruptibility prediction by modelling the extent of user engagement with notifications. Pervasive and Mobile Computing 40 (Sept. 2017), 480–494. https://doi.org/10.1016/j.pmcj.2017.01.011",
      "doi": "10.1016/j.pmcj.2017.01.011"
    },
    {
      "text": "Niels van Berkel, Denzil Ferreira, and Vassilis Kostakos. 2017. The Experience Sampling Method on Mobile Devices. ACM Comput. Surv. 50, 6, Article 93 (dec 2017), 40 pages. https://doi.org/10.1145/3123988",
      "doi": "10.1145/3123988"
    },
    {
      "text": "Niels van Berkel, Jorge Goncalves, Simo Hosio, Zhanna Sarsenbayeva, Eduardo Velloso, and Vassilis Kostakos. 2020. Overcoming compliance bias in self-report studies: A cross-study analysis. International Journal of Human-Computer Studies 134 (2020), 1–12. https://doi.org/10.1016/j.ijhcs.2019.10.003",
      "doi": ""
    },
    {
      "text": "Alexandra Voit, Dominik Weber, and Niels Henze. 2018. Qualitative Investigation of Multi-Device Notifications. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers(UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 1263–1270. https://doi.org/10.1145/3267305.3274117",
      "doi": "10.1145/3267305.3274117"
    },
    {
      "text": "Dominik Weber. 2017. Towards smart notification management in multi-device environments. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’17). Association for Computing Machinery, New York, NY, USA, 1–2. https://doi.org/10.1145/3098279.3119921",
      "doi": "10.1145/3098279.3119921"
    },
    {
      "text": "Dominik Weber, Alexandra Voit, Jonas Auda, Stefan Schneegass, and Niels Henze. 2018. Snooze! investigating the user-defined deferral of mobile notifications. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3229434.3229436",
      "doi": "10.1145/3229434.3229436"
    },
    {
      "text": "Dominik Weber, Alexandra Voit, and Niels Henze. 2019. Clear All: A Large-Scale Observational Study on Mobile Notification Drawers. In Proceedings of Mensch und Computer 2019(MuC’19). Association for Computing Machinery, New York, NY, USA, 361–372. https://doi.org/10.1145/3340764.3340765",
      "doi": "10.1145/3340764.3340765"
    },
    {
      "text": "Dominik Weber, Alexandra Voit, Gisela Kollotzek, and Niels Henze. 2019. Annotif: A System for Annotating Mobile Notifcations in User Studies. In Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia(MUM ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3365610.3365611",
      "doi": "10.1145/3365610.3365611"
    },
    {
      "text": "Dominik Weber, Alexandra Voit, Philipp Kratzer, and Niels Henze. 2016. In-situ investigation of notifications in multi-device environments. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 1259–1264. https://doi.org/10.1145/2971648.2971732",
      "doi": "10.1145/2971648.2971732"
    },
    {
      "text": "Tilo Westermann, Sebastian Möller, and Ina Wechsung. 2015. Assessing the Relationship between Technical Affinity, Stress and Notifications on Smartphones. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 652–659. https://doi.org/10.1145/2786567.2793684",
      "doi": "10.1145/2786567.2793684"
    },
    {
      "text": "Ting-Wei Wu, Yu-Ling Chien, Hao-Ping Lee, and Yung-Ju Chang. 2021. IM Receptivity and Presentation-type Preferences among Users of a Mobile App with Automated Receptivity-status Adjustment. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3411764.3445209",
      "doi": "10.1145/3411764.3445209"
    },
    {
      "text": "SungHyuk Yoon, Sang-su Lee, Jae-myung Lee, and KunPyo Lee. 2014. Understanding notification stress of smartphone messenger app. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 1735–1740. https://doi.org/10.1145/2559206.2581167",
      "doi": "10.1145/2559206.2581167"
    },
    {
      "text": "Ye Yuan, Nathalie Riche, Nicolai Marquardt, Molly Jane Nicholas, Teddy Seyed, Hugo Romat, Bongshin Lee, Michel Pahud, Jonathan Goldstein, Rojin Vishkaie, Christian Holz, and Ken Hinckley. 2022. Understanding Multi-Device Usage Patterns: Physical Device Configurations and Fragmented Workflows. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–22. https://doi.org/10.1145/3491102.3517702",
      "doi": "10.1145/3491102.3517702"
    },
    {
      "text": "George Kingsley Zipf. 1949. Human behavior and the principle of least effort. Addison-Wesley Press, Oxford, England. Pages: xi, 573.",
      "doi": ""
    }
  ]
}