{
  "doi": "10.1145/3544548.3580762",
  "title": "Autonomous is Not Enough: Designing Multisensory Mid-Air Gestures for Vehicle Interactions Among People with Visual Impairments",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Should fully autonomous vehicles (FAVs) be designed inclusively and accessibly, independence will be transformed for millions of people experiencing transportation-limiting disabilities worldwide. Although FAVs hold promise to improve efficient transportation without intervention, a truly accessible experience must enable user input, for all people, in many driving scenarios (e.g., to alter a route or pull over during an emergency). Therefore, this paper explores desires for control in FAVs among (n=23) people who are blind and visually impaired. Results indicate strong support for control across a battery of driving tasks, as well as the need for multimodal information. These findings inspired the design and evaluation of a novel multisensory interface leveraging mid-air gestures, audio, and haptics. All participants successfully navigated driving scenarios using our gestural-audio interface, reporting high ease-of-use. Contributions include the first inclusively designed gesture set for FAV control and insight regarding supplemental haptic and audio cues.",
  "tags": [
    "Autonomous vehicles",
    "Situational awareness",
    "Accessible design",
    "Interfaces for blind or visually impaired individuals",
    "Gestures",
    "Spatial audio"
  ],
  "authors": [
    {
      "name": "Paul D. S. Fink",
      "institution": "VEMI Lab, The University of Maine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659863763",
      "orcid": "0000-0003-2915-1331"
    },
    {
      "name": "Velin Dimitrov",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87059183757",
      "orcid": "0000-0002-3072-8962"
    },
    {
      "name": "Hiroshi Yasuda",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557485556",
      "orcid": "0000-0003-2708-8623"
    },
    {
      "name": "Tiffany L. Chen",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779745",
      "orcid": "0000-0002-2951-8052"
    },
    {
      "name": "Richard R. Corey",
      "institution": "VEMI Lab, The University of Maine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659058482",
      "orcid": "0000-0001-5247-2067"
    },
    {
      "name": "Nicholas A. Giudice",
      "institution": "VEMI Lab, The University of Maine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384607254",
      "orcid": "0000-0002-7640-0428"
    },
    {
      "name": "Emily S. Sumner",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660749425",
      "orcid": "0000-0003-1912-9640"
    }
  ],
  "references": [
    {
      "text": "Roger Bennett, Rohini Vijaygopal, and Rita Kottasz. 2020. Willingness of people who are blind to accept autonomous vehicles: An empirical investigation. Transportation Research Part F: Traffic Psychology and Behaviour 69 (Feb. 2020), 13–27. https://doi.org/10.1016/j.trf.2019.12.012",
      "doi": ""
    },
    {
      "text": "Rupert RA Bourne, Jaimie Adelson, Seth Flaxman, Paul Briant, Michele Bottone, Theo Vos, Kovin Naidoo, Tasanee Braithwaite, Maria Cicinelli, Jost Jonas, 2020. Global Prevalence of Blindness and Distance and Near Vision Impairment in 2020: progress towards the Vision 2020 targets and what the future holds.Investigative Ophthalmology & Visual Science 61, 7 (2020), 2317–2317.",
      "doi": ""
    },
    {
      "text": "Robin Brewer and Nicole Ellison. 2020. Supporting People with Vision Impairments in Automated Vehicles: Challenge and Opportunities. Technical Report. University of Michigan, Ann Arbor, Transportation Research Institute.",
      "doi": ""
    },
    {
      "text": "Robin N Brewer and Vaishnav Kameswaran. 2018. Understanding the power of control in autonomous vehicles for people with vision impairment. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. 185–197.",
      "doi": "10.1145/3234695.3236347"
    },
    {
      "text": "Julian Brinkley. 2021. Using personas with visual impairments to explore the design of an accessible self-driving vehicle human-machine interface. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 65. SAGE Publications Sage CA: Los Angeles, CA, 337–341.",
      "doi": ""
    },
    {
      "text": "Julian Brinkley, Earl W Huff Jr, Briana Posadas, Julia Woodward, Shaundra B Daily, and Juan E Gilbert. 2020. Exploring the needs, preferences, and concerns of persons with visual impairments regarding autonomous vehicles. ACM Transactions on Accessible Computing (TACCESS) 13, 1 (2020), 1–34.",
      "doi": "10.1145/3372280"
    },
    {
      "text": "Julian Brinkley, Brianna Posadas, Imani Sherman, Shaundra B Daily, and Juan E Gilbert. 2019. An open road evaluation of a self-driving vehicle human–machine interface designed for visually impaired users. International Journal of Human–Computer Interaction 35, 11(2019), 1018–1032.",
      "doi": ""
    },
    {
      "text": "Eddie Brown, David R. Large, Hannah Limerick, and Gary Burnett. 2020. Ultrahapticons:“Haptifying” drivers’ mental models to transform automotive mid-air haptic gesture infotainment interfaces. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 54–57.",
      "doi": "10.1145/3409251.3411722"
    },
    {
      "text": "Henry Claypool, Amitai Bin-Nun, and Jeffrey Gerlach. 2017. Self-Driving Cars: The Impact on People with Disabilities. Ruderman Foundation (2017), 35.",
      "doi": ""
    },
    {
      "text": "Henrik Detjen, Stefan Geisler, and Stefan Schneegass. 2020. Maneuver-based control interventions during automated driving: Comparing touch, voice, and mid-air gestures as input modalities. In 2020 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE, 3268–3274.",
      "doi": "10.1109/SMC42975.2020.9283431"
    },
    {
      "text": "Brad E. Dicianno, Sivashankar Sivakanthan, S. Andrea Sundaram, Shantanu Satpute, Hailee Kulich, Elizabeth Powers, Nikitha Deepak, Rebecca Russell, Rosemarie Cooper, and Rory A. Cooper. 2021. Systematic review: Automated vehicles and services for people with disabilities. Neuroscience Letters 761 (Sept. 2021), 136103. https://doi.org/10.1016/j.neulet.2021.136103",
      "doi": ""
    },
    {
      "text": "Paul DS Fink, Jessica A Holz, and Nicholas A Giudice. 2021. Fully autonomous vehicles for people with visual impairment: Policy, accessibility, and future directions. ACM Transactions on Accessible Computing (TACCESS) 14, 3 (2021), 1–17.",
      "doi": "10.1145/3471934"
    },
    {
      "text": "Nicholas A. Giudice. 2018. Navigating without vision: principles of blind spatial cognition. Handbook of Behavioral and Cognitive Geography (April 2018), 260–288. https://www.elgaronline.com/view/edcoll/9781784717537/9781784717537.00024.xml ISBN: 9781784717544 Publisher: Edward Elgar Publishing Section: Handbook of Behavioral and Cognitive Geography.",
      "doi": ""
    },
    {
      "text": "Nicholas A. Giudice, Benjamin A. Guenther, Nicholas A. Jensen, and Kaitlyn N. Haase. 2020. Cognitive Mapping Without Vision: Comparing Wayfinding Performance After Learning From Digital Touchscreen-Based Multimodal Maps vs. Embossed Tactile Overlays. Frontiers in Human Neuroscience 14 (2020). https://doi.org/10.3389/fnhum.2020.00087",
      "doi": ""
    },
    {
      "text": "Nicholas A. Giudice, Benjamin A. Guenther, Toni M. Kaplan, Shane M. Anderson, Robert J. Knuesel, and Joseph F. Cioffi. 2020. Use of an Indoor Navigation System by Sighted and Blind Travelers: Performance Similarities across Visual Status and Age. ACM Trans. Access. Comput. 13, 3, Article 11 (aug 2020), 27 pages. https://doi.org/10.1145/3407191",
      "doi": "10.1145/3407191"
    },
    {
      "text": "Nicholas A. Giudice and Jerome D. Tietz. 2008. Learning with Virtual Verbal Displays: Effects of Interface Fidelity on Cognitive Map Development. In Spatial Cognition VI. Learning, Reasoning, and Talking about Space, Christian Freksa, Nora S. Newcombe, Peter Gärdenfors, and Stefan Wölfl (Eds.). Vol. 5248. Springer Berlin Heidelberg, Berlin, Heidelberg, 121–137. https://doi.org/10.1007/978-3-540-87601-4_11 ISSN: 0302-9743, 1611-3349 Series Title: Lecture Notes in Computer Science.",
      "doi": "10.1007/978-3-540-87601-4_11"
    },
    {
      "text": "Nicholas A. Giudice, William E. Whalen, Timothy H. Riehle, Shane M. Anderson, and Stacy A. Doore. 2019. Evaluation of an Accessible, Real-Time, and Infrastructure-Free Indoor Navigation System by Users Who Are Blind in the Mall of America. Journal of Visual Impairment & Blindness 113, 2 (March 2019), 140–155. https://doi.org/10.1177/0145482X19840918 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Mikaylah Gross, Joe Dara, Christopher Meyer, and Davide Bolchini. 2018. Exploring Aural Navigation by Screenless Access. In Proceedings of the 15th International Web for All Conference(W4A ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3192714.3192815",
      "doi": "10.1145/3192714.3192815"
    },
    {
      "text": "Kyle Harrington, David R. Large, Gary Burnett, and Orestis Georgiou. 2018. Exploring the Use of Mid-Air Ultrasonic Feedback to Enhance Automotive User Interfaces. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 11–20. https://doi.org/10.1145/3239060.3239089",
      "doi": "10.1145/3239060.3239089"
    },
    {
      "text": "JASP Team. 2022. JASP (Version 0.16.3)[Computer software]. https://jasp-stats.org/",
      "doi": ""
    },
    {
      "text": "Kibum Kim, Xiangshi Ren, Seungmoon Choi, and Hong Z Tan. 2016. Assisting people with visual impairments in aiming at a target on a large wall-mounted display. International Journal of Human-Computer Studies 86 (2016), 109–120.",
      "doi": "10.1016/j.ijhcs.2015.10.002"
    },
    {
      "text": "Roberta L. Klatzky, James R. Marston, Nicholas A. Giudice, Reginald G. Golledge, and Jack M. Loomis. 2006. Cognitive load of navigating without vision when guided by virtual sound versus spatial language. Journal of Experimental Psychology. Applied 12, 4 (Dec. 2006), 223–232. https://doi.org/10.1037/1076-898X.12.4.223",
      "doi": ""
    },
    {
      "text": "David R Large, Kyle Harrington, Gary Burnett, and Orestis Georgiou. 2019. Feel the noise: Mid-air ultrasound haptics as a novel human-vehicle interaction paradigm. Applied ergonomics 81(2019), 102909.",
      "doi": ""
    },
    {
      "text": "Mathieu Nancel, Julie Wagner, Emmanuel Pietriga, Olivier Chapuis, and Wendy Mackay. 2011. Mid-Air Pan-and-Zoom on Wall-Sized Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 177–186. https://doi.org/10.1145/1978942.1978969",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "World Health Organization. 2021. Blindness and Visual Impairment. Technical Report. Retrieved Feb 15, 2022.",
      "doi": ""
    },
    {
      "text": "Sharon Oviatt, Rachel Coulston, and Rebecca Lunsford. 2004. When do we interact multimodally? Cognitive load and multimodal communication patterns. In Proceedings of the 6th international conference on Multimodal interfaces. 129–136.",
      "doi": "10.1145/1027933.1027957"
    },
    {
      "text": "Hari P. Palani, Paul D. S. Fink, and Nicholas A. Giudice. 2020. Design Guidelines for Schematizing and Rendering Haptically Perceivable Graphical Elements on Touchscreen Devices. International Journal of Human–Computer Interaction (April 2020), 1–22. https://doi.org/10.1080/10447318.2020.1752464",
      "doi": ""
    },
    {
      "text": "Hari Prasath Palani, Paul D. S. Fink, and Nicholas A. Giudice. 2022. Comparing Map Learning between Touchscreen-Based Visual and Haptic Displays: A Behavioral Evaluation with Blind and Sighted Users. Multimodal Technologies and Interaction 6, 1 (Jan. 2022), 1. https://doi.org/10.3390/mti6010001 Number: 1 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Xiaosong Qian, Wendy Ju, and David Michael Sirkin. 2020. Aladdin’s magic carpet: Navigation by in-air static hand gesture in autonomous vehicles. International Journal of Human–Computer Interaction 36, 20(2020), 1912–1927.",
      "doi": ""
    },
    {
      "text": "Parivash Ranjbar, Pournami Krishnan Krishnakumari, Jonas Andersson, and Maria Klingegård. 2022. Vibrotactile guidance for trips with autonomous vehicles for persons with blindness, deafblindness, and deafness. Transportation Research Interdisciplinary Perspectives 15 (2022), 100630.",
      "doi": ""
    },
    {
      "text": "SAE. 2019. SAE Demo Days Survey. SAE. https://www.sae.org/news/press-room/2019/11/sae-international-survey-shows-public-enthusiasm-about-self-driving-cars",
      "doi": ""
    },
    {
      "text": "Gözel Shakeri, John H Williamson, and Stephen Brewster. 2018. May the force be with you: Ultrasound haptic feedback for mid-air gesture interaction in cars. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 1–10.",
      "doi": "10.1145/3239060.3239081"
    },
    {
      "text": "Surak Son, YiNa Jeong, and Byungkwan Lee. 2019. An Audification and Visualization System (AVS) of an Autonomous Vehicle for Blind and Deaf People Based on Deep Learning. Sensors 19, 22 (Jan. 2019), 5035. https://doi.org/10.3390/s19225035 Number: 22 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Peng Song, Wooi Boon Goh, William Hutama, Chi-Wing Fu, and Xiaopei Liu. 2012. A Handle Bar Metaphor for Virtual Object Manipulation with Mid-Air Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1297–1306. https://doi.org/10.1145/2207676.2208585",
      "doi": "10.1145/2207676.2208585"
    },
    {
      "text": "Robert Walter, Gilles Bailly, and Jörg Müller. 2013. StrikeAPose: Revealing Mid-Air Gestures on Public Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 841–850. https://doi.org/10.1145/2470654.2470774",
      "doi": "10.1145/2470654.2470774"
    },
    {
      "text": "Gareth Young, Hamish Milne, Daniel Griffiths, Elliot Padfield, Robert Blenkinsopp, and Orestis Georgiou. 2020. Designing Mid-Air Haptic Gesture Controlled User Interfaces for Cars. Proceedings of the ACM on Human-Computer Interaction 4, EICS (June 2020), 81:1–81:23. https://doi.org/10.1145/3397869",
      "doi": "10.1145/3397869"
    }
  ]
}