{
  "doi": "10.1145/3544548.3580698",
  "title": "Tutoria11y: Enhancing Accessible Interactive Tutorial Creation by Blind Audio Producers",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Audio production is a skilled practice that requires mastery in highly complex software and hardware tools. Blind audio producers face a steep learning curve where they must learn multiple inaccessible audio production tools in conjunction with workarounds for screen reader support. Learning audio production is made even more challenging due to a scarcity of educational resources geared towards blind people. Grounded in formative interviews and observations with seven blind audio production instructors, we developed Tutoria11y, an extension for GarageBand to support blind audio producers in creating accessible, interactive tutorials that screen reader users can follow to receive step-by-step guidance and confirmation of their actions. Findings from design exploration sessions with five blind instructors highlight how Tutoria11y can support tutorial creation and augment tutorial playback for blind audio producers. We discuss how we can rethink technology’s role as a means to amplify, rather than replace, the knowledge of disabled experts.",
  "authors": [
    {
      "name": "Abir Saha",
      "institution": "Northwestern University, United States",
      "img": "/do/10.1145/contrib-99659260724/rel-imgonly/abir_1024.png",
      "acmid": "99659260724",
      "orcid": "0000-0003-2725-4003"
    },
    {
      "name": "Thomas Barlow McHugh",
      "institution": "Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659653997",
      "orcid": "0000-0002-2486-6744"
    },
    {
      "name": "Anne Marie Piper",
      "institution": "University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316490036",
      "orcid": "0000-0003-3085-3277"
    }
  ],
  "references": [
    {
      "text": "Joe Bennett. 2018. Songwriting, Digital Audio Workstations, and the Internet. In The Oxford Handbook of the Creative Process in Music, Nicolas Donin (Ed.). Oxford University Press, Oxford. https://doi.org/10.1093/oxfordhb/9780190636197.013.28",
      "doi": ""
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. The Invisible Work of Accessibility: How Blind Employees Manage Accessibility in Mixed-Ability Workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (Lisbon, Portugal) (ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 163–171. https://doi.org/10.1145/2700648.2809864",
      "doi": "10.1145/2700648.2809864"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Anh Truong, Oliver Wang, Maneesh Agrawala, and Juho Kim. 2019. How to Design Voice Based Navigation for How-To Videos. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300931",
      "doi": "10.1145/3290605.3300931"
    },
    {
      "text": "Pei-Yu Chi, Sally Ahn, Amanda Ren, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2012. MixT: Automatic Generation of Step-by-Step Mixed Media Tutorials. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 93–102. https://doi.org/10.1145/2380116.2380130",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Bill Crow. 2006. Musical Creativity and the New Technology. Music Education Research 8, 1 (March 2006), 121–130. https://doi.org/10.1080/14613800600581659",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. \"It Doesn’t Win You Friends\": Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 191:1–191:26. https://doi.org/10.1145/3359293",
      "doi": "10.1145/3359293"
    },
    {
      "text": "Maitraye Das, Thomas Barlow McHugh, Anne Marie Piper, and Darren Gergle. 2022. Co11ab: Augmenting Accessibility in Synchronous Collaborative Writing for People with Vision Impairments. In CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, Article 196, 18 pages. https://doi.org/10.1145/3491102.3501918",
      "doi": "10.1145/3491102.3501918"
    },
    {
      "text": "György Fazekas and Mark Sandler. 2007. Intelligent Editing of Studio Recordings with the Help of Automatic Music Structure Extraction. In Audio Engineering Society Convention 122. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Floraine Grabler, Maneesh Agrawala, Wilmot Li, Mira Dontcheva, and Takeo Igarashi. 2009. Generating Photo Manipulation Tutorials by Demonstration. In ACM SIGGRAPH 2009 Papers (New Orleans, Louisiana) (SIGGRAPH ’09). Association for Computing Machinery, New York, NY, USA, Article 66, 9 pages. https://doi.org/10.1145/1576246.1531372",
      "doi": "10.1145/1576246.1531372"
    },
    {
      "text": "Tovi Grossman and George Fitzmaurice. 2010. ToolClips: An Investigation of Contextual Video Assistance for Functionality Understanding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1515–1524. https://doi.org/10.1145/1753326.1753552",
      "doi": "10.1145/1753326.1753552"
    },
    {
      "text": "Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2010. Chronicle: Capture, Exploration, and Playback of Document Workflow Histories. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (New York, New York, USA) (UIST ’10). Association for Computing Machinery, New York, NY, USA, 143–152. https://doi.org/10.1145/1866029.1866054",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Toshiyuki Hagiya, Toshiharu Horiuchi, and Tomonori Yazaki. 2016. Typing Tutor: Individualized Tutoring in Text Entry for Older Adults Based on Input Stumble Detection. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 733–744. https://doi.org/10.1145/2858036.2858455",
      "doi": "10.1145/2858036.2858455"
    },
    {
      "text": "Brian J. Hracs. 2012. A Creative Industry in Transition: The Rise of Digitally Driven Independent Music Production. Growth and Change 43, 3 (2012), 442–461. https://doi.org/10.1111/j.1468-2257.2012.00593.x",
      "doi": ""
    },
    {
      "text": "Björn Kaiser, Matthias Lindner, Sascha Reinhold, and Michael Teistler. 2018. Audio Editing with a Game Controller for Blind Users. In Mensch und Computer 2018 - Tagungsband, Raimund Dachselt and Gerhard Weber (Eds.). Gesellschaft für Informatik e.V., Bonn. https://doi.org/10.18420/muc2018-mci-0439",
      "doi": ""
    },
    {
      "text": "Aaron Karp and Bryan Pardo. 2017. HaptEQ: A Collaborative Tool For Visually Impaired Audio Producers. In AM’17. ACM Press, 1–4. https://doi.org/10.1145/3123514.3123531",
      "doi": "10.1145/3123514.3123531"
    },
    {
      "text": "Benjamin Lafreniere, Tovi Grossman, and George Fitzmaurice. 2013. Community Enhanced Tutorials: Improving Tutorials with Multiple Demonstrations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1779–1788. https://doi.org/10.1145/2470654.2466235",
      "doi": "10.1145/2470654.2466235"
    },
    {
      "text": "Ben Lafreniere, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2014. Investigating the Feasibility of Extracting Tool Demonstrations from In-Situ Video Content. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 4007–4016. https://doi.org/10.1145/2556288.2557142",
      "doi": "10.1145/2556288.2557142"
    },
    {
      "text": "Guo Li, Tun Lu, Jiang Yang, Xiaomu Zhou, Xianghua Ding, and Ning Gu. 2015. Intelligently Creating Contextual Tutorials for GUI Applications. In 2015 IEEE 12th Intl Conf on Ubiquitous Intelligence and Computing and 2015 IEEE 12th Intl Conf on Autonomic and Trusted Computing and 2015 IEEE 15th Intl Conf on Scalable Computing and Communications and Its Associated Workshops (UIC-ATC-ScalCom). 187–196. https://doi.org/10.1109/UIC-ATC-ScalCom-CBDCom-IoP.2015.50",
      "doi": ""
    },
    {
      "text": "Marlene Mathew, Jennifer Grossman, and Areti Andreopoulou. 2016. Women in Audio: Contributions and Challenges in Music Technology and Production. In Audio Engineering Society Convention 141. http://www.aes.org/e-lib/browse.cfm?elib=18477",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Nick Bryan-Kinns, Tony Stockman, and Fiore Martin. 2015. Sonifications for digital audio workstations: Reflections on a participatory design approach. In International Conference on Auditory Display (ICAD).",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Fiore Martin, Adam Parkinson, Nick Bryan-Kinns, Tony Stockman, and Atau Tanaka. 2016. Audio-Haptic Interfaces for Digital Audio Workstations. Journal on Multimodal User Interfaces 10, 3 (Sept. 2016), 247–258. https://doi.org/10.1007/s12193-016-0217-8",
      "doi": ""
    },
    {
      "text": "Joshua Mycroft, Tony Stockman, and J. D. Reiss. 2018. A Prototype Mixer to Improve Cross-Modal Attention During Audio Mixing. In Proceedings of the Audio Mostly 2018 on Sound in Immersion and Emotion (Wrexham, United Kingdom) (AM’18). Association for Computing Machinery, New York, NY, USA, Article 3, 7 pages. https://doi.org/10.1145/3243274.3243290",
      "doi": "10.1145/3243274.3243290"
    },
    {
      "text": "Alok Mysore and Philip J. Guo. 2017. Torta: Generating Mixed-Media GUI and Command-Line App Tutorials Using Operating-System-Wide Activity Tracing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 703–714. https://doi.org/10.1145/3126594.3126628",
      "doi": "10.1145/3126594.3126628"
    },
    {
      "text": "Cuong Nguyen and Feng Liu. 2015. Making Software Tutorial Video Responsive. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1565–1568. https://doi.org/10.1145/2702123.2702209",
      "doi": "10.1145/2702123.2702209"
    },
    {
      "text": "Shotaro Omori and Ikuko Eguchi Yairi. 2013. Collaborative Music Application for Visually Impaired People with Tangible Objects on Table. In ASSETS’13. ACM Press, 1–2. https://doi.org/10.1145/2513383.2513403",
      "doi": "10.1145/2513383.2513403"
    },
    {
      "text": "George Palaigeorgiou and Theofanis Despotakis. 2010. Known and Unknown Weaknesses in Software Animated Demonstrations (Screencasts): A Study in Self-Paced Learning Settings. Journal of Information Technology Education 9 (01 2010), 81–98.",
      "doi": ""
    },
    {
      "text": "Maulishree Pandey, Vaishnav Kameswaran, Hrishikesh V Rao, Sile O’Modhrain, and Steve Oney. 2021. Understanding Accessibility and Collaboration in Programming for People with Visual Impairments. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1, Article 129 (April 2021), 30 pages. https://doi.org/10.1145/3449203",
      "doi": "10.1145/3449203"
    },
    {
      "text": "William Payne, Fabiha Ahmed, Michael Gardell, R. Luke DuBois, and Amy Hurst. 2022. SoundCells: Designing a Browser-Based Music Technology for Braille and Print Notation. In Proceedings of the 19th International Web for All Conference (Lyon, France) (W4A ’22). Association for Computing Machinery, New York, NY, USA, Article 14, 12 pages. https://doi.org/10.1145/3493612.3520462",
      "doi": "10.1145/3493612.3520462"
    },
    {
      "text": "William Christopher Payne, Alex Yixuan Xu, Fabiha Ahmed, Lisa Ye, and Amy Hurst. 2020. How Blind and Visually Impaired Composers, Producers, and Songwriters Leverage and Adapt Music Technology. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 35, 12 pages. https://doi.org/10.1145/3373625.3417002",
      "doi": "10.1145/3373625.3417002"
    },
    {
      "text": "Enrique Perez-Gonzalez and Joshua Reiss. 2009. Automatic Equalization of Multichannel Audio Using Cross-Adaptive Methods. In Audio Engineering Society Convention 127. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Suporn Pongnumkul, Mira Dontcheva, Wilmot Li, Jue Wang, Lubomir Bourdev, Shai Avidan, and Michael F. Cohen. 2011. Pause-and-Play: Automatically Linking Screencast Video Tutorials with Applications. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology(Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 135–144. https://doi.org/10.1145/2047196.2047213",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "André Rodrigues, André Santos, Kyle Montague, Hugo Nicolau, and Tiago Guerreiro. 2019. Understanding the Authoring and Playthrough of Nonvisual Smartphone Tutorials. In Human-Computer Interaction – INTERACT 2019, David Lamas, Fernando Loizides, Lennart Nacke, Helen Petrie, Marco Winckler, and Panayiotis Zaphiris (Eds.). Springer International Publishing, Cham, 42–62. https://doi.org/10.1007/978-3-030-29381-9_4",
      "doi": "10.1007/978-3-030-29381-9_4"
    },
    {
      "text": "André Rodrigues, André R.B. Santos, Kyle Montague, and Tiago Guerreiro. 2021. Promoting Self-Efficacy Through an Effective Human-Powered Nonvisual Smartphone Task Assistant. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 114 (apr 2021), 19 pages. https://doi.org/10.1145/3449188",
      "doi": "10.1145/3449188"
    },
    {
      "text": "Abir Saha and Anne Marie Piper. 2020. Understanding Audio Production Practices of People with Vision Impairments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 36, 13 pages. https://doi.org/10.1145/3373625.3416993",
      "doi": "10.1145/3373625.3416993"
    },
    {
      "text": "Stacy L. Smith, Marc Choueiti, Katherine Pieper, Hannah Clark, Ariana Case, and Sylvia Villanueva. 2019. Inclusion in the Recording Studio? Gender & Race/Ethnicity of Artists, Songwriters, & Producers across 700 Popular Songs from 2012-2018. Technical Report. USC Annenberg Inclusion Initiative. http://assets.uscannenberg.org/docs/aii-inclusion-recording-studio-2019.pdf",
      "doi": ""
    },
    {
      "text": "Atau Tanaka and Adam Parkinson. 2016. Haptic Wave: A Cross-Modal Interface for Visually Impaired Audio Producers. In CHI’16. ACM Press, 2150–2161. https://doi.org/10.1145/2858036.2858304",
      "doi": "10.1145/2858036.2858304"
    },
    {
      "text": "Michael Terren. 2019. The Grain of the Digital Audio Workstation. Dissertation. Edith Cowan University. https://ro.ecu.edu.au/theses/2201",
      "doi": ""
    },
    {
      "text": "Cheng-Yao Wang, Wei-Chen Chu, Hou-Ren Chen, Chun-Yen Hsu, and Mike Y. Chen. 2014. EverTutor: Automatically Creating Interactive Guided Tutorials on Smartphones by User Demonstration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 4027–4036. https://doi.org/10.1145/2556288.2557407",
      "doi": "10.1145/2556288.2557407"
    }
  ]
}