{
  "doi": "10.1145/3544548.3580942",
  "title": "Linguistic Dead-Ends and Alphabet Soup: Finding Dark Patterns in Japanese Apps",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Dark patterns are deceptive and malicious properties of user interfaces that lead the end-user to do something different from intended or expected. While now a key topic in critical computing, most work has been conducted in Western contexts. Japan, with its booming app market, is a relatively uncharted context that offers culturally- and linguistically-sensitive differences in design standards, contexts of use, values, and language, all of which could influence the presence and expression of dark patterns. In this work, we analyzed 200 popular mobile apps in the Japanese market. We found that most apps had dark patterns, with an average of 3.9 per app. We also identified a new class of dark pattern: “Linguistic Dead-Ends” in the forms of “Untranslation” and “Alphabet Soup.” We outline the implications for design and research practice, especially for future cross-cultural research on dark patterns.",
  "authors": [
    {
      "name": "Shun Hidaka",
      "institution": "Department of Industrial Engineering and Economics, Tokyo Institute of Technology, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780388",
      "orcid": "0000-0003-3132-2099"
    },
    {
      "name": "Sota Kobuki",
      "institution": "Department of Industrial Engineering and Economics, Tokyo Institute of Technology, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779931",
      "orcid": "0000-0003-0531-7579"
    },
    {
      "name": "Mizuki Watanabe",
      "institution": "Department of Industrial Engineering and Economics, Tokyo Institute of Technology, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783259",
      "orcid": "0000-0003-3036-7041"
    },
    {
      "name": "Katie Seaborn",
      "institution": "Department of Industrial Engineering and Economics, Tokyo Institute of Technology, Japan",
      "img": "/do/10.1145/contrib-81460657397/rel-imgonly/uclic.png",
      "acmid": "81460657397",
      "orcid": "0000-0002-7812-9096"
    }
  ],
  "references": [
    {
      "text": "App Store Review Guidelines: 2022. https://developer.apple.com/app-store/review/guidelines/.",
      "doi": ""
    },
    {
      "text": "Benoliel, U. and Becher, S. 2019. The duty to read the unreadable. SSRN.",
      "doi": ""
    },
    {
      "text": "Bhoot, A.M., Shinde, M.A. and Mishra, W.P. 2020. Towards the identification of dark patterns: An analysis based on end-user reactions. IndiaHCI ’20: Proceedings of the 11th Indian Conference on Human-Computer Interaction (Online India, Nov. 2020), 24–33. DOI:https://doi.org/10.1145/3429290.3429293.",
      "doi": "10.1145/3429290.3429293"
    },
    {
      "text": "Bongard-Blanchy, K., Rossi, A., Rivas, S., Doublet, S., Koenig, V. and Lenzini, G. 2021. “I am definitely manipulated, even when I am aware of it. It's ridiculous!” - Dark patterns from the end-user perspective. Designing Interactive Systems Conference 2021 (Virtual Event USA, Jun. 2021), 763–776. DOI:https://doi.org/10.1145/3461778.3462086.",
      "doi": "10.1145/3461778.3462086"
    },
    {
      "text": "Bösch, C., Erb, B., Kargl, F., Kopp, H. and Pfattheicher, S. 2016. Tales from the dark side: Privacy dark strategies and privacy dark patterns. Proceedings on Privacy Enhancing Technologies. 2016, 4 (Oct. 2016), 237–254. DOI:https://doi.org/10.1515/popets-2016-0038.",
      "doi": ""
    },
    {
      "text": "Comber, R., Bardzell, S., Bardzell, J., Hazas, M. and Muller, M. 2020. Announcing a new CHI subcommittee: Critical and sustainable computing. interactions. 27, 4 (2020), 101–103. DOI:https://doi.org/10.1145/3407228.",
      "doi": "10.1145/3407228"
    },
    {
      "text": "Cyr, D. and Trevor-Smith, H. 2004. Localization of web design: An empirical comparison of German, Japanese, and United States web site characteristics. Journal of the American Society for Information Science and Technology. 55, 13 (Nov. 2004), 1199–1208. DOI:https://doi.org/10.1002/asi.20075.",
      "doi": ""
    },
    {
      "text": "Deceptive Design: 2010. https://www.darkpatterns.org/.",
      "doi": ""
    },
    {
      "text": "Di Geronimo, L., Braz, L., Fregnan, E., Palomba, F. and Bacchelli, A. 2020. UI dark patterns and where to find them: A study on mobile applications and user perception. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu HI USA, Apr. 2020), 1–14. DOI:https://doi.org/10.1145/3313831.3376600.",
      "doi": "10.1145/3313831.3376600"
    },
    {
      "text": "Fansher, M., Chivukula, S.S. and Gray, C.M. 2018. #darkpatterns: UX practitioner conversations about ethical design. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2018), 1–6. DOI:https://doi.org/10.1145/3170427.318855.",
      "doi": ""
    },
    {
      "text": "Fitton, D. and Read, J.C. 2019. Creating a framework to support the critical consideration of dark design aspects in free-to-play apps. Proceedings of the 18th ACM International Conference on Interaction Design and Children (Boise ID USA, Jun. 2019), 407–418. DOI:https://doi.org/10.1145/3311927.3323136.",
      "doi": "10.1145/3311927.3323136"
    },
    {
      "text": "Friedman, B. 1996. Value-sensitive design. interactions. 3, 6 (Dec. 1996), 16–23. DOI:https://doi.org/10.1145/242485.242493.",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Fujita-Round, S. and Maher, J.C. 2017. Language Policy and Education in Japan. Language Policy and Political Issues in Education. T.L. McCarty and S. May, eds. Springer International Publishing. 491–505. DOI:https://doi.org/10.1007/978-3-319-02320-5_36-2.",
      "doi": ""
    },
    {
      "text": "Gray, C.M., Chen, J., Chivukula, S.S. and Qu, L. 2021. End user accounts of dark patterns as felt manipulation. Proceedings of the ACM on Human-Computer Interaction. 5, CSCW2 (Oct. 2021), 1–25. DOI:https://doi.org/10.1145/3479516.",
      "doi": "10.1145/3479516"
    },
    {
      "text": "Gray, C.M. and Chivukula, S.S. 2019. Ethical mediation in UX practice. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow Scotland Uk, May 2019), 1–11. DOI:https://doi.org/10.1145/3290605.3300408.",
      "doi": "10.1145/3290605.3300408"
    },
    {
      "text": "Gray, C.M., Kou, Y., Battles, B., Hoggatt, J. and Toombs, A.L. 2018. The dark (patterns) side of UX design. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC Canada, Apr. 2018), 1–14. DOI:https://doi.org/10.1145/3173574.3174108.",
      "doi": "10.1145/3173574.3174108"
    },
    {
      "text": "Gray, C.M., Santos, C., Bielova, N., Toth, M. and Clifford, D. 2021. Dark patterns and the legal requirements of consent banners: An interaction criticism perspective. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama Japan, May 2021), 1–18. DOI:https://doi.org/10.1145/3411764.3445779.",
      "doi": "10.1145/3411764.3445779"
    },
    {
      "text": "Grimpe, B., Hartswood, M. and Jirotka, M. 2014. Towards a closer dialogue between policy and practice: Responsible design in HCI. Proceedings of the SIGCHI conference on Human Factors in Computing Systems (2014), 2965–2974. DOI:https://doi.org/10.1145/2556288.255736.",
      "doi": ""
    },
    {
      "text": "Henrich, J., Heine, S.J. and Norenzayan, A. 2010. Most people are not WEIRD. Nature. 466, 7302 (Jul. 2010), 29–29. DOI:https://doi.org/10.1038/466029a.",
      "doi": ""
    },
    {
      "text": "Henrich, J., Heine, S.J. and Norenzayan, A. 2010. The weirdest people in the world? Behavioral and Brain Sciences. 33, 2–3 (Jun. 2010), 61–83. DOI:https://doi.org/10.1017/S0140525X0999152X.",
      "doi": ""
    },
    {
      "text": "Krisam, C., Dietmann, H., Volkamer, M. and Kulyk, O. 2021. Dark patterns in the wild: Review of cookie disclaimer designs on top 500 German websites. European Symposium on Usable Security 2021 (Karlsruhe Germany, Oct. 2021), 1–8. DOI:https://doi.org/10.1145/3481357.3481516.",
      "doi": "10.1145/3481357.3481516"
    },
    {
      "text": "Kumar, N. and Karusala, N. 2019. Intersectional computing. Interactions. 26, 2 (2019), 50–54. DOI:https://doi.org/10.1145/3305360.",
      "doi": "10.1145/3305360"
    },
    {
      "text": "Labrecque, L.I. and Milne, G.R. 2012. Exciting red and competent blue: The importance of color in marketing. Journal of the Academy of Marketing Science. 40, 5 (Sep. 2012), 711–727. DOI:https://doi.org/10.1007/s11747-010-0245-y.",
      "doi": ""
    },
    {
      "text": "Linxen, S., Sturm, C., Brühlmann, F., Cassau, V., Opwis, K. and Reinecke, K. 2021. How WEIRD is CHI? Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama Japan, May 2021), 1–14. DOI:https://doi.org/10.1145/3411764.344548.",
      "doi": ""
    },
    {
      "text": "Luguri, J. and Strahilevitz, L.J. 2021. Shining a light on dark patterns. Journal of Legal Analysis. 13, 1 (2021), 43–109. DOI:https://doi.org/10.1093/jla/laaa006.",
      "doi": ""
    },
    {
      "text": "Maier, M. and Harr, R. 2019. Dark patterns: An end-user perspective. Human Technology. 16, 2 (Jun. 2019), 170–199. DOI:https://doi.org/10.17011/ht/urn.202008245641.",
      "doi": ""
    },
    {
      "text": "Marily, P. 2015. How web design characteristics affect consumer online behaviour Retrieved on Feb. 2, 2023 from https://repository.ihu.edu.gr/xmlui/handle/11544/537.",
      "doi": ""
    },
    {
      "text": "Mathur, A., Acar, G., Friedman, M.J., Lucherini, E., Mayer, J., Chetty, M. and Narayanan, A. 2019. Dark patterns at scale: Findings from a crawl of 11k shopping websites. Proceedings of the ACM on Human-Computer Interaction. 3, CSCW (Nov. 2019), 1–32. DOI:https://doi.org/10.1145/3359183.",
      "doi": "10.1145/3359183"
    },
    {
      "text": "Mathur, A., Kshirsagar, M. and Mayer, J. 2021. What makes a dark pattern... dark?: Design attributes, normative considerations, and measurement methods. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama Japan, May 2021), 1–18. DOI:https://doi.org/10.1145/3411764.3445610.",
      "doi": "10.1145/3411764.3445610"
    },
    {
      "text": "Monge Roffarello, A. and De Russis, L. 2022. Towards understanding the dark patterns that steal our attention. CHI Conference on Human Factors in Computing Systems Extended Abstracts (New Orleans LA USA, Apr. 2022), 1–7. DOI:https://doi.org/10.1145/3491101.3519829.",
      "doi": "10.1145/3491101.3519829"
    },
    {
      "text": "Ogbonnaya-Ogburu, I.F., Smith, A.D.R., To, A. and Toyama, K. 2020. Critical race theory for HCI. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA, Apr. 2020), 1–16. DOI:https://doi.org/10.1145/3313831.3376392.",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Rogers, Y., Dourish, P., Olivier, P., Brereton, M. and Forlizzi, J. 2020. The dark side of interaction design. Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA, Apr. 2020), 1–4. DOI:https://doi.org/10.1145/3411763.3450397.",
      "doi": "10.1145/3411763.3450397"
    },
    {
      "text": "Roma, P. and Ragaglia, D. 2016. Revenue models, in-app purchase, and the app performance: Evidence from Apple's App Store and Google Play. Electronic Commerce Research and Applications. 17, (May 2016), 173–190. DOI:https://doi.org/10.1016/j.elerap.2016.04.007.",
      "doi": "10.1016/j.elerap.2016.04.007"
    },
    {
      "text": "Saito, M. 1996. Comparative studies on color preference in Japan and other Asian regions, with special emphasis on the preference for white. Color Research & Application. 21, 1 (1996), 35–49. DOI:https://doi.org/10.1002/(SICI)1520-6378(199602)21:1%3C35::AID-COL4%3E3.0.CO;2-6.",
      "doi": ""
    },
    {
      "text": "Schlesinger, A., Edwards, W.K. and Grinter, R.E. 2017. Intersectional HCI: Engaging identity through gender, race, and class. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, May 2017), 5412–5427. DOI:https://doi.org/10.1145/3025453.3025766.",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Sengers, P., Boehner, K., David, S. and Kaye, J. 2005. Reflective design. Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (Århus, Denmark, 2005), 49–58. DOI:https://doi.org/10.1145/1094562.1094569.",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Spiel, K., Gerling, K., Bennett, C.L., Brulé, E., Williams, R.M., Rode, J. and Mankoff, J. 2020. Nothing about us without us: Investigating the role of critical disability studies in HCI. Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2020), 1–8. DOI:https://doi.org/10.1145/3334480.3375150.",
      "doi": "10.1145/3334480.3375150"
    },
    {
      "text": "Takiura M. 2008. Introduction to politeness [ポライトネス入門]. Kenkyuusha [研究社].",
      "doi": ""
    },
    {
      "text": "Tamura, N. 2020. 日本のインターネットサービスの利用規約に関する:消費者意識の考察ཞパーソナルデータの収集を契機としてཞ (Study on Terms of Service or Internet Services in Japan: Consideration of consumer awareness - Triggered personal data collection). 消費者政策研究 (Consumer Policy Research). 2, (2020), 50–61.",
      "doi": ""
    },
    {
      "text": "Yao, J. and Wei, H. 2018. Creating better-informed consumers and reducing dark pattern tendencies through improved terms of service solutions. (2018). Retrieved Feb. 2, 2023 from https://src.acm.org/binaries/content/assets/src/2018/jenny-yao.pdf.",
      "doi": ""
    }
  ]
}