{
  "doi": "10.1145/3544548.3581230",
  "title": "VR Almost There: Simulating Co-located Multiplayer Experiences in Social Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Consumer social virtual reality (VR) applications have recently started to enable social interactions at a distance. Yet it is still relatively unknown if and to what extent such applications provide meaningful social experiences in cases where in-person leisure activities are not feasible. To explore this, we developed a custom social VR application and conducted an exploratory lab study with 25 dyads in which we compared an in-person and a virtual version of a co-located multiplayer scenario. Our mixed-methods analysis revealed that both scenarios created a socially rich atmosphere and strengthened the social closeness between players. However, the lack of facial animations, limited body language, and a low field of view led to VR’s main social experiential limitations: a reduced mutual awareness and emotional understanding compared to the in-person scenario. We derive implications for social VR design and research as well as game user research.",
  "tags": [
    "social interaction",
    "multiplayer games",
    "social virtual reality",
    "social presence",
    "player experience"
  ],
  "authors": [
    {
      "name": "Philipp Sykownik",
      "institution": "Entertainment Computing Group, University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473578",
      "orcid": "0000-0003-0894-7242"
    },
    {
      "name": "Sukran Karaosmanoglu",
      "institution": "Human-Computer Interaction, Universität Hamburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659466914",
      "orcid": "0000-0002-9624-4258"
    },
    {
      "name": "Katharina Emmerich",
      "institution": "COVIDAG, University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81551044556",
      "orcid": "0000-0002-3198-6373"
    },
    {
      "name": "Frank Steinicke",
      "institution": "Human-Computer Interaction, Universität Hamburg, Germany",
      "img": "/do/10.1145/contrib-81313483772/rel-imgonly/steinicke-sit2-sm.jpg",
      "acmid": "81313483772",
      "orcid": "0000-0001-9879-7414"
    },
    {
      "name": "Maic Masuch",
      "institution": "Entertainment Computing Group, University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100616924",
      "orcid": "0000-0002-7965-6269"
    }
  ],
  "references": [
    {
      "text": "Vero Vanden Abeele, Katta Spiel, Lennart Nacke, Daniel Johnson, and Kathrin Gerling. 2020. Development and validation of the player experience inventory: A scale to measure player experiences at the level of functional and psychosocial consequences. International Journal of Human-Computer Studies 135 (2020), 102370. https://doi.org/10.1016/j.ijhcs.2019.102370",
      "doi": "10.1016/j.ijhcs.2019.102370"
    },
    {
      "text": "Arthur Aron, Elaine N Aron, and Danny Smollan. 1992. Inclusion of other in the self scale and the structure of interpersonal closeness.Journal of personality and social psychology 63, 4(1992), 596. https://doi.org/10.1037/0022-3514.63.4.596",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Jim Blascovich, Andrew C Beall, and Jack M Loomis. 2001. Equilibrium theory revisited: Mutual gaze and personal space in virtual environments. Presence: Teleoperators & Virtual Environments 10, 6(2001), 583–598. https://doi.org/10.1162/105474601753272844",
      "doi": "10.1162/105474601753272844"
    },
    {
      "text": "Sebastian Baltes and Paul Ralph. 2022. Sampling in Software Engineering Research: A Critical Review and Guidelines. Empirical Softw. Engg. 27, 4 (jul 2022), 31 pages. https://doi.org/10.1007/s10664-021-10072-8",
      "doi": "10.1007/s10664-021-10072-8"
    },
    {
      "text": "Miguel Barreda-Ángeles and Tilo Hartmann. 2022. Psychological benefits of using social virtual reality platforms during the covid-19 pandemic: The role of social and spatial presence. Computers in Human Behavior 127 (2022), 107047. https://doi.org/10.1016/j.chb.2021.107047",
      "doi": "10.1016/j.chb.2021.107047"
    },
    {
      "text": "Steve Benford, John Bowers, Lennart E Fahlén, Chris Greenhalgh, and Dave Snowdon. 1995. User embodiment in collaborative virtual environments. In Proceedings of the SIGCHI conference on Human factors in computing systems (Denver, Colorado, USA). ACM Press/Addison-Wesley Publishing Co., USA, 242–249. https://doi.org/10.1145/223904.223935",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "Frank Biocca, Chad Harms, and Judee K. Burgoon. 2003. Toward a More Robust Theory and Measure of Social Presence: Review and Suggested Criteria. Presence: Teleoperators and Virtual Environments 12, 5(2003), 456–480. https://doi.org/10.1162/105474603322761270",
      "doi": "10.1162/105474603322761270"
    },
    {
      "text": "Frank Biocca, Chad Harms, and Jenn Gregg. 2001. The networked minds measure of social presence: Pilot test of the factor structure and concurrent validity. 4th annual international workshop on presence, Philadelphia, PA (2001), 1–9.",
      "doi": ""
    },
    {
      "text": "Jim Blascovich. 2002. A Theoretical Model of Social Influence for Increasing the Utility of Collaborative Virtual Environments. In Proceedings of the 4th International Conference on Collaborative Virtual Environments (Bonn, Germany) (CVE ’02). Association for Computing Machinery, New York, NY, USA, 25–30. https://doi.org/10.1145/571878.571883",
      "doi": "10.1145/571878.571883"
    },
    {
      "text": "Riccardo Bovo, Daniele Giunchi, Muna Alebri, Anthony Steed, Enrico Costanza, and Thomas Heinis. 2022. Cone of Vision as a Behavioural Cue for VR Collaboration. Proc. ACM Hum.-Comput. Interact. 6, CSCW2, Article 502 (nov 2022), 27 pages. https://doi.org/10.1145/3555615",
      "doi": "10.1145/3555615"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern-based qualitative analytic approaches. Counselling and Psychotherapy Research 21, 1 (2021), 37–47. https://doi.org/10.1002/capr.12360",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 981–992. https://doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Annemaree Carroll, Julie M. Bower, and Sandy Muspratt. 2017. The conceptualization and construction of the Self in a Social Context—Social Connectedness Scale: A multidimensional scale for high school students. International Journal of Educational Research 81 (2017), 97–107. https://doi.org/10.1016/j.ijer.2016.12.001",
      "doi": ""
    },
    {
      "text": "Sebastian Cmentowski and Jens Krüger. 2020. Playing With Friends - The Importance of Social Play During the COVID-19 Pandemic. Association for Computing Machinery, New York, NY, USA, 209–212. https://doi.org/10.1145/3383668.3419911",
      "doi": "10.1145/3383668.3419911"
    },
    {
      "text": "J Cohen. 1988. Statistical power analysis for the behavioral sciences (Revised ed.). Hillsdale, NJ: Lawrence Earlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Yvonne A. W. de Kort and Wijnand A. Ijsselsteijn. 2008. People, places, and play: player experience in a socio-spatial context. Computers in Entertainment 6, 2 (2008), 1–11. https://doi.org/10.1145/1371216.1371221",
      "doi": "10.1145/1371216.1371221"
    },
    {
      "text": "Ansgar E Depping and Regan L Mandryk. 2017. Cooperation and interdependence: How multiplayer games increase social closeness. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, New York, NY, USA, 449–461. https://doi.org/10.1145/3116595.3116639",
      "doi": "10.1145/3116595.3116639"
    },
    {
      "text": "Elena Dzardanova, Vlasios Kasapakis, Damianos Gavalas, and Stella Sylaiou. 2022. Virtual reality as a communication medium: a comparative study of forced compliance in virtual reality versus physical world. Virtual Reality 26, 2 (2022), 737–757. https://doi.org/10.1007/s10055-021-00564-9",
      "doi": "10.1007/s10055-021-00564-9"
    },
    {
      "text": "Katharina Emmerich and Maic Masuch. 2017. The Impact of Game Patterns on Player Experience and Social Interaction in Co-Located Multiplayer Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17). Association for Computing Machinery, New York, NY, USA, 411–422. https://doi.org/10.1145/3116595.3116606",
      "doi": "10.1145/3116595.3116606"
    },
    {
      "text": "Entertainment Software Association (ESA). 2021. 2021 Essential Facts about the Video Game Industry. https://www.theesa.com/resource/2021-essential-facts-about-the-video-game-industry/ Washington, D.C., USA.",
      "doi": ""
    },
    {
      "text": "Andy P Field. 2005. Kendall’s coefficient of concordance. Encyclopedia of Statistics in Behavioral Science 2 (2005), 1010–11.",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Dane Acena. 2021. Hugging from A Distance: Building Interpersonal Relationships in Social Virtual Reality. In ACM International Conference on Interactive Media Experiences (Virtual Event, USA) (IMX ’21). Association for Computing Machinery, New York, NY, USA, 84–95. https://doi.org/10.1145/3452918.3458805",
      "doi": "10.1145/3452918.3458805"
    },
    {
      "text": "Brian Gajadhar, Yvonne de Kort, and Wijnand IJsselsteijn. 2008. Influence of Social Setting on Player Experience of Digital Games. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems (Florence, Italy) (CHI EA ’08). Association for Computing Machinery, New York, NY, USA, 3099–3104. https://doi.org/10.1145/1358628.1358814",
      "doi": "10.1145/1358628.1358814"
    },
    {
      "text": "B. J. Gajadhar, Y. A.W. de Kort, and W. A. Ijsselsteijn. 2009. Rules of Engagement: Influence of Co-Player Presence on Player Involvement in Digital Games. International Journal of Gaming and Computer-Mediated Simulations 1, 3(2009), 14–27. https://doi.org/10.4018/jgcms.2009070102",
      "doi": ""
    },
    {
      "text": "Brian J. Gajadhar, Yvonne A. W. de Kort, and Wijnand A. Ijsselsteijn. 2008. Shared Fun Is Doubled Fun: Player Enjoyment as a Function of Social Setting. In Fun and Games, Panos Markopoulos, Boris de Ruyter, Wijnand IJsselsteijn, and Duncan Rowland (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 106–117. https://doi.org/10.1007/978-3-540-88322-7_11",
      "doi": "10.1007/978-3-540-88322-7_11"
    },
    {
      "text": "Linda Graf, Maximilian Altmeyer, Katharina Emmerich, Marc Herrlich, Andrey Krekhov, and Katta Spiel. 2022. Development and Validation of a German Version of the Player Experience Inventory (PXI). In Mensch und Computer 2022 - Tagungsband, Bastian Pfleging, Kathrin Gerling, and Sven Mayer (Eds.). ACM, New York, 265–265. https://doi.org/10.1145/3543758.3543763",
      "doi": "10.1145/3543758.3543763"
    },
    {
      "text": "Eugy Han, Mark Roman Miller, Nilam Ram, Kristine L Nowak, and Jeremy N Bailenson. 2022. Understanding Group Behavior in Virtual Reality: A Large-Scale, Longitudinal Study in the Metaverse. 72nd Annual International Communication Association Conference, Paris, France (2022).",
      "doi": ""
    },
    {
      "text": "Chad Harms and Frank Biocca. 2004. Internal Consistency and Reliability of the Networked Minds Social Presence Measure. In Seventh Annual International Workshop: Presence 2004 (Valencia: Universidad Politecnica de Valencia), In M. Alcaniz & B. Rey (Ed.).",
      "doi": ""
    },
    {
      "text": "John Harris and Mark Hancock. 2019. To Asymmetry and Beyond! Improving Social Connectedness by Increasing Designed Interdependence in Cooperative Play. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300239",
      "doi": "10.1145/3290605.3300239"
    },
    {
      "text": "John Harris, Mark Hancock, and Stacey D Scott. 2016. Leveraging asymmetries in multiplayer games: Investigating design elements of interdependent play. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (Austin, Texas, USA) (CHI PLAY ’16). Association for Computing Machinery, New York, NY, USA, 350–361. https://doi.org/10.1145/2967934.2968113",
      "doi": "10.1145/2967934.2968113"
    },
    {
      "text": "Daniel Hepperle, Christian Felix Purps, Jonas Deuchler, and Matthias Wölfel. 2022. Aspects of visual avatar appearance: self-representation, display type, and uncanny valley. The Visual Computer 38, 4 (2022), 1227–1244.",
      "doi": "10.1007/s00371-021-02151-0"
    },
    {
      "text": "Sture Holm. 1979. A Simple Sequentially Rejective Multiple Test Procedure. Scandinavian Journal of Statistics 6, 2 (1979), 65–70. http://www.jstor.org/stable/4615733",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides and Elisa D. Mekler. 2019. The Role of Gaming During Difficult Life Experiences. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300453",
      "doi": "10.1145/3290605.3300453"
    },
    {
      "text": "Wijnand A IJsselsteijn, Yvonne A W de Kort, and Antal Haans. 2006. Is this my hand I see before me? The rubber hand illusion in reality, virtual reality, and mixed reality. Presence: Teleoperators and Virtual Environments 15, 4(2006), 455–464. https://doi.org/10.1162/pres.15.4.455",
      "doi": "10.1162/pres.15.4.455"
    },
    {
      "text": "Katherine Isbister. 2010. Enabling Social Play: A Framework for Design and Evaluation. In Evaluating User Experience in Games, Reg-ina Bernhaupt (Ed.). Springer London, London, 11–22. https://doi.org/10.1007/978-1-84882-963-3_2",
      "doi": ""
    },
    {
      "text": "Sukran Karaosmanoglu, Katja Rogers, Dennis Wolf, Enrico Rukzio, Frank Steinicke, and Lennart E. Nacke. 2021. Feels like Team Spirit: Biometric and Strategic Interdependence in Asymmetric Multiplayer VR Games. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 443, 15 pages. https://doi.org/10.1145/3411764.3445492",
      "doi": "10.1145/3411764.3445492"
    },
    {
      "text": "Linda K. Kaye and Jo Bryce. 2012. Putting The \"Fun Factor\" Into Gaming: The Influence of Social Contexts on Experiences of Playing Video-games. International Journal of Internet Science 7, 1 (2012), 23–36.",
      "doi": ""
    },
    {
      "text": "Linda K Kaye and Jo Bryce. 2014. Go with the flow: The experience and affective outcomes of solo versus social gameplay. Journal of Gaming & Virtual Worlds 6, 1 (2014), 49–60. https://doi.org/10.1386/jgvw.6.1.49_1",
      "doi": ""
    },
    {
      "text": "Negar Khojasteh and Andrea Stevenson Won. 2021. Working together on diverse tasks: A longitudinal study on individual workload, presence and emotional recognition in collaborative virtual environments. Frontiers in Virtual Reality 2 (2021), 643331. https://doi.org/10.3389/frvir.2021.643331",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Raphaela Groten, and Mel Slater. 2012. The sense of embodiment in virtual reality. Presence: Teleoperators and Virtual Environments 21, 4(2012), 373–387. https://doi.org/10.1162/PRES_a_00124",
      "doi": "10.1162/PRES_a_00124"
    },
    {
      "text": "Andrey Krekhov, Sebastian Cmentowski, Katharina Emmerich, and Jens Krüger. 2019. Beyond Human: Animals as an Escape from Stereotype Avatars in Virtual Reality Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 439–451. https://doi.org/10.1145/3311350.3347172",
      "doi": "10.1145/3311350.3347172"
    },
    {
      "text": "Sonja Kröger and Thorsten Quandt. 2014. Get Together: Console Playing as a Group Experience. In Multiplayer, Thorsten Quandt and Sonja Kröger (Eds.). Routledge, London, 147–161.",
      "doi": ""
    },
    {
      "text": "Christos Kyrlitsias and Despina Michael-Grigoriou. 2022. Social Interaction With Agents and Avatars in Immersive Virtual Environments: A Survey. Frontiers in Virtual Reality 2 (2022). https://doi.org/10.3389/frvir.2021.786665",
      "doi": ""
    },
    {
      "text": "Marc Erich Latoschik, Daniel Roth, Dominik Gall, Jascha Achenbach, Thomas Waltemate, and Mario Botsch. 2017. The Effect of Avatar Realism in Immersive Social Virtual Realities. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (Gothenburg, Sweden) (VRST ’17). Association for Computing Machinery, New York, NY, USA, Article 39, 10 pages. https://doi.org/10.1145/3139131.3139156",
      "doi": "10.1145/3139131.3139156"
    },
    {
      "text": "Christopher Lee, Peta Wyeth, Daniel Johnson, and Joshua Hall. 2015. Flow during Individual and Co-operative Gameplay. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play - CHI PLAY ’15, Anna L. Cox, Paul Cairns, Regina Bernhaupt, and Lennart Nacke (Eds.). ACM Press, New York, New York, USA, 103–107. https://doi.org/10.1145/2793107.2793142",
      "doi": "10.1145/2793107.2793142"
    },
    {
      "text": "Sueyoon Lee, Abdallah El Ali, Maarten Wijntjes, and Pablo Cesar. 2022. Understanding and Designing Avatar Biosignal Visualizations for Social Virtual Reality Entertainment. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 425, 15 pages. https://doi.org/10.1145/3491102.3517451",
      "doi": "10.1145/3491102.3517451"
    },
    {
      "text": "Jie Li, Yiping Kong, Thomas Röggla, Francesca De Simone, Swamy Ananthanarayan, Huib de Ridder, Abdallah El Ali, and Pablo Cesar. 2019. Measuring and Understanding Photo Sharing Experiences in Social Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300897",
      "doi": "10.1145/3290605.3300897"
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How WEIRD is CHI?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 143, 14 pages. https://doi.org/10.1145/3411764.3445488",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "Matthew Lombard, Theresa B Ditton, and Lisa Weinstein. 2009. Measuring presence: the temple presence inventory. In Proceedings of the 12th annual international workshop on presence. 1–15.",
      "doi": ""
    },
    {
      "text": "Anna Loparev, Walter S. Lasecki, Kyle I. Murray, and Jeffrey P. Bigham. 2014. Introducing Shared Character Control to Existing Video Games. https://doi.org/10.1184/R1/6470180.v1",
      "doi": ""
    },
    {
      "text": "Fang Ma and Xueni Pan. 2022. Visual Fidelity Effects on Expressive Self-avatar in Virtual Reality: First Impressions Matter. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Christchurch, New Zealand, 57–65. https://doi.org/10.1109/VR51125.2022.00023",
      "doi": ""
    },
    {
      "text": "Divine Maloney and Guo Freeman. 2020. Falling Asleep Together: What Makes Activities in Social Virtual Reality Meaningful to Users. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Virtual Event, Canada) (CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 510–521. https://doi.org/10.1145/3410404.3414266",
      "doi": "10.1145/3410404.3414266"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2021. Stay Connected in An Immersive World: Why Teenagers Engage in Social Virtual Reality. In Interaction Design and Children (Athens, Greece) (IDC ’21). Association for Computing Machinery, New York, NY, USA, 69–79. https://doi.org/10.1145/3459990.3460703",
      "doi": "10.1145/3459990.3460703"
    },
    {
      "text": "Divine Maloney, Samaneh Zamanifard, and Guo Freeman. 2020. Anonymity vs. Familiarity: Self-Disclosure and Privacy in Social Virtual Reality. In Proceedings of the 26th ACM Symposium on Virtual Reality Software and Technology(Virtual Event, Canada) (VRST ’20). Association for Computing Machinery, New York, NY, USA, Article 25, 9 pages. https://doi.org/10.1145/3385956.3418967",
      "doi": "10.1145/3385956.3418967"
    },
    {
      "text": "Antonella Maselli and Mel Slater. 2013. The building blocks of the full body ownership illusion. Frontiers in human neuroscience 7 (2013), 83. https://doi.org/10.3389/fnhum.2013.00083",
      "doi": ""
    },
    {
      "text": "Mark McGill, John H Williamson, and Stephen Brewster. 2016. Examining the role of smart TVs and VR HMDs in synchronous at-a-distance media consumption. ACM Transactions on Computer-Human Interaction (TOCHI) 23, 5(2016), 1–57. https://doi.org/10.1145/2983530",
      "doi": "10.1145/2983530"
    },
    {
      "text": "Joshua McVeigh-Schultz and Katherine Isbister. 2021. The Case for “Weird Social” in VR/XR: A Vision of Social Superpowers Beyond Meatspace. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 17, 10 pages. https://doi.org/10.1145/3411763.3450377",
      "doi": "10.1145/3411763.3450377"
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300794",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Joshua McVeigh-Schultz, Elena Márquez Segura, Nick Merrill, and Katherine Isbister. 2018. What’s It Mean to \"Be Social\" in VR? Mapping the Social VR Design Ecology. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems(Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 289–294. https://doi.org/10.1145/3197391.3205451",
      "doi": "10.1145/3197391.3205451"
    },
    {
      "text": "Meta. 2020. Facebook Horizon Welcomes Its First Virtual Explorers. Retrieved August 09, 2022 from https://about.fb.com/news/2020/08/facebook-horizon-welcomes-first-virtual-explorers/",
      "doi": ""
    },
    {
      "text": "Microsoft. 2022. Altspace VR Beginner’s Guide. Retrieved August 09, 2022 from https://altvr.com/altspacevr-beginners-guide/",
      "doi": ""
    },
    {
      "text": "Mario Montagud, Jie Li, Gianluca Cernigliaro, Abdallah El Ali, Sergi Fernández, and Pablo Cesar. 2022. Towards socialVR: evaluating a novel technology for watching videos together. Virtual Reality 26(2022), 1–21. https://doi.org/10.1007/s10055-022-00651-5",
      "doi": "10.1007/s10055-022-00651-5"
    },
    {
      "text": "Masahiro Mori, Karl F. MacDorman, and Norri Kageki. 2012. The Uncanny Valley [From the Field]. IEEE Robotics & Automation Magazine 19, 2 (2012), 98–100. https://doi.org/10.1109/MRA.2012.2192811",
      "doi": ""
    },
    {
      "text": "Fares Moustafa and Anthony Steed. 2018. A Longitudinal Study of Small Group Interaction in Social Virtual Reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (Tokyo, Japan) (VRST ’18). Association for Computing Machinery, New York, NY, USA, Article 22, 10 pages. https://doi.org/10.1145/3281505.3281527",
      "doi": "10.1145/3281505.3281527"
    },
    {
      "text": "Vivek Nair, Gonzalo Munilla Garrido, and Dawn Song. 2022. Exploring the Unprecedented Privacy Risks of the Metaverse. https://doi.org/10.48550/ARXIV.2207.13176",
      "doi": ""
    },
    {
      "text": "Benjamin John Newton, Zuzana Rothlingova, Robin Gutteridge, Karen LeMarchand, and Jon Howard Raphael. 2012. No room for reflexivity? Critical reflections following a systematic review of qualitative research. Journal of Health Psychology 17, 6 (2012), 866–885. https://doi.org/10.1177/1359105311427615",
      "doi": ""
    },
    {
      "text": "Catherine S. Oh, Jeremy N. Bailenson, and Gregory F. Welch. 2018. A Systematic Review of Social Presence: Definition, Antecedents, and Implications. Frontiers in Robotics and AI 5 (2018). https://doi.org/10.3389/frobt.2018.00114",
      "doi": ""
    },
    {
      "text": "Ye Pan and Anthony Steed. 2017. The impact of self-avatars on trust and collaboration in shared virtual environments. PloS one 12, 12 (2017), e0189078. https://doi.org/10.1371/journal.pone.0189078",
      "doi": ""
    },
    {
      "text": "Katy E Pearce, Jason C Yip, Jin Ha Lee, Jesse J Martinez, Travis W Windleharth, Arpita Bhattacharya, and Qisheng Li. 2022. Families playing animal crossing together: coping with video games during the COVID-19 pandemic. Games and Culture 17, 5 (2022), 773–794.",
      "doi": ""
    },
    {
      "text": "T. S. Perry. 2016. Virtual reality goes social. IEEE Spectrum 53, 1 (2016), 56–57. https://doi.org/10.1109/MSPEC.2016.7367470",
      "doi": "10.1109/MSPEC.2016.7367470"
    },
    {
      "text": "Roosa Piitulainen, Perttu Hämäläinen, and Elisa D Mekler. 2022. Vibing Together: Dance Experiences in Social Virtual Reality. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 188, 18 pages. https://doi.org/10.1145/3491102.3501828",
      "doi": "10.1145/3491102.3501828"
    },
    {
      "text": "Katja Rogers, Sukran Karaosmanoglu, Dennis Wolf, Frank Steinicke, and Lennart E. Nacke. 2021. A Best-Fit Framework and Systematic Review of Asymmetric Gameplay in Multiplayer Virtual Reality Games. Frontiers in Virtual Reality 2 (2021). https://doi.org/10.3389/frvir.2021.694660",
      "doi": ""
    },
    {
      "text": "Shane L. Rogers, Rebecca Broadbent, Jemma Brown, Alan Fraser, and Craig P. Speelman. 2022. Realistic Motion Avatars are the Future for Social Interaction in Virtual Reality. Frontiers in Virtual Reality 2 (2022). https://doi.org/10.3389/frvir.2021.750729",
      "doi": ""
    },
    {
      "text": "Daniel Roth, Gary Bente, Peter Kullmann, David Mal, Chris Felix Purps, Kai Vogeley, and Marc Erich Latoschik. 2019. Technologies for Social Augmentations in User-Embodied Virtual Reality. In Proceedings of the 25th ACM Symposium on Virtual Reality Software and Technology(Parramatta, NSW, Australia) (VRST ’19). Association for Computing Machinery, New York, NY, USA, Article 5, 12 pages. https://doi.org/10.1145/3359996.3364269",
      "doi": "10.1145/3359996.3364269"
    },
    {
      "text": "Daniel Roth and Marc Erich Latoschik. 2020. Construction of the Virtual Embodiment Questionnaire (VEQ). IEEE Transactions on Visualization and Computer Graphics 26, 12(2020), 3546–3556. https://doi.org/10.1109/TVCG.2020.3023603",
      "doi": ""
    },
    {
      "text": "Sylvia Rothe, Alexander Schmidt, Mario Montagud, Daniel Buschek, and Heinrich Hußmann. 2021. Social viewing in cinematic virtual reality: a design space for social movie applications. Virtual Reality 25, 3 (2021), 613–630. https://doi.org/10.1007/s10055-020-00472-4",
      "doi": "10.1007/s10055-020-00472-4"
    },
    {
      "text": "Katie Salen Tekinbaş and Eric Zimmerman. 2004. Rules of play: Game design fundamentals. MIT press.",
      "doi": ""
    },
    {
      "text": "Thomas Schubert, Frank Friedmann, and Holger Regenbrecht. 2001. The Experience of Presence: Factor Analytic Insights. Presence: Teleoperators and Virtual Environments 10, 3 (06 2001), 266–281. https://doi.org/10.1162/105474601300343603 arXiv:https://direct.mit.edu/pvar/article-pdf/10/3/266/1623697/105474601300343603.pdf",
      "doi": "10.1162/105474601300343603"
    },
    {
      "text": "Valentin Schwind, Katrin Wolf, and Niels Henze. 2018. Avoiding the Uncanny Valley in Virtual Character Design. Interactions 25, 5 (aug 2018), 45–49. https://doi.org/10.1145/3236673",
      "doi": "10.1145/3236673"
    },
    {
      "text": "Navya N. Sharan, Alexander Toet, Tina Mioch, Omar Niamut, and Jan B. F. van Erp. 2022. The Relative Importance of Social Cues in Immersive Mediated Communication. In Human Interaction, Emerging Technologies and Future Systems V, Tareq Ahram and Redha Taiar (Eds.). Springer International Publishing, Cham, 491–498.",
      "doi": ""
    },
    {
      "text": "Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (2009), 3549–3557. https://doi.org/10.1098/rstb.2009.0138",
      "doi": ""
    },
    {
      "text": "Mel Slater, Daniel Pérez Marcos, Henrik Ehrsson, and Maria V Sanchez-Vives. 2008. Towards a digital body: the virtual arm illusion. Frontiers in human neuroscience 2 (2008), 6. https://doi.org/10.3389/neuro.09.006.2008",
      "doi": ""
    },
    {
      "text": "Harrison Jesse Smith and Michael Neff. 2018. Communication Behavior in Embodied Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173863",
      "doi": "10.1145/3173574.3173863"
    },
    {
      "text": "Misha Sra, Aske Mottelson, and Pattie Maes. 2018. Your Place and Mine: Designing a Shared VR Experience for Remotely Located Users. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 85–97. https://doi.org/10.1145/3196709.3196788",
      "doi": "10.1145/3196709.3196788"
    },
    {
      "text": "Jaakko Stenros, Janne Paavilainen, and Frans Mayra. 2011. Social interaction in games. International Journal of Arts and Technology 4, 3 (2011), 342. https://doi.org/10.1504/IJART.2011.041486",
      "doi": ""
    },
    {
      "text": "Philipp Sykownik, Katharina Emmerich, and Maic Masuch. 2018. Exploring Patterns of Shared Control in Digital Multiplayer Games. In Advances in Computer Entertainment Technology, Adrian David Cheok, Masahiko Inami, and Teresa Romão (Eds.). Springer International Publishing, Cham, 847–867.",
      "doi": ""
    },
    {
      "text": "Philipp Sykownik, Katharina Emmerich, and Maic Masuch. 2020. Like in the Good Old Times, but Virtual - A Case for Simulating Co-Located Multiplayer Games in VR. Association for Computing Machinery, New York, NY, USA, 379–383. https://doi.org/10.1145/3383668.3419885",
      "doi": "10.1145/3383668.3419885"
    },
    {
      "text": "Philipp Sykownik, Linda Graf, Christoph Zils, and Maic Masuch. 2021. The Most Social Platform Ever? A Survey about Activities & Motives of Social VR Users. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). IEEE, Lisboa, Portugal, 546–554. https://doi.org/10.1109/VR50410.2021.00079",
      "doi": ""
    },
    {
      "text": "Philipp Sykownik, Divine Maloney, Guo Freeman, and Maic Masuch. 2022. Something Personal from the Metaverse: Goals, Topics, and Contextual Factors of Self-Disclosure in Commercial Social VR. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 632, 17 pages. https://doi.org/10.1145/3491102.3502008",
      "doi": "10.1145/3491102.3502008"
    },
    {
      "text": "Philipp Sykownik and Maic Masuch. 2020. The Experience of Social Touch in Multi-User Virtual Reality. In Proceedings of the 26th ACM Symposium on Virtual Reality Software and Technology (Virtual Event, Canada) (VRST ’20). Association for Computing Machinery, New York, NY, USA, Article 30, 11 pages. https://doi.org/10.1145/3385956.3418944",
      "doi": "10.1145/3385956.3418944"
    },
    {
      "text": "Philipp Sykownik and Maic Masuch. 2021. Developing a Framework for Designing Augmentations of Social Touch in Multiuser Virtual Reality. Mensch und Computer 2021-Workshopband(2021). https://doi.org/10.18420/muc2021-mci-ws16-241",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Nazely Hartoonian, and Jeffrey Bryan. 2020. \"How Do I Make This Thing Smile?\": An Inventory of Expressive Nonverbal Communication in Commercial Social Virtual Reality Platforms. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376606",
      "doi": "10.1145/3313831.3376606"
    },
    {
      "text": "Maciej Tomczak and Ewa Tomczak. 2014. The need to report effect size estimates revisited. An overview of some recommended measures of effect size. Trends in sport sciences 1, 21 (2014), 19–25.",
      "doi": ""
    },
    {
      "text": "Kellie Vella, Madison Klarkowski, Daniel Johnson, Leanne Hides, and Peta Wyeth. 2016. The Social Context of Video Game Play: Challenges and Strategies. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS ’16, Marcus Foth, Wendy Ju, Ronald Schroeter, and Stephen Viller (Eds.). ACM Press, New York, New York, USA, 761–772. https://doi.org/10.1145/2901790.2901823",
      "doi": "10.1145/2901790.2901823"
    },
    {
      "text": "Kurt Wagner. 2021. Zuckerberg Says Facebook’s Future Lies in Virtual ‘Metaverse’. Retrieved August 09, 2022 from https://www.bloomberg.com/news/articles/2021-07-29/mark-zuckerberg-explains-metaverse-vision-to-facebook-fb-investors-analysts",
      "doi": ""
    },
    {
      "text": "Dmitri Williams, Nicolas Ducheneaut, Li Xiong, Yuanyuan Zhang, Nick Yee, and Eric Nickell. 2006. From Tree House to Barracks: The Social Life of Guilds in World of Warcraft. Games and Culture 1, 4 (2006), 338–361. https://doi.org/10.1177/1555412006292616 arXiv:https://doi.org/10.1177/1555412006292616",
      "doi": ""
    },
    {
      "text": "Bob G Witmer and Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence 7, 3 (1998), 225–240. https://doi.org/10.1162/105474698565686",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Samaneh Zamanifard and Guo Freeman. 2019. \"The Togetherness That We Crave\": Experiencing Social VR in Long Distance Relationships. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 438–442. https://doi.org/10.1145/3311957.3359453",
      "doi": "10.1145/3311957.3359453"
    },
    {
      "text": "Xiaolong Zhang and George W. Furnas. 2002. Social Interactions in Multiscale CVEs. In Proceedings of the 4th International Conference on Collaborative Virtual Environments (Bonn, Germany) (CVE ’02). Association for Computing Machinery, New York, NY, USA, 31–38. https://doi.org/10.1145/571878.571884",
      "doi": "10.1145/571878.571884"
    },
    {
      "text": "Katja Zibrek, Sean Martin, and Rachel McDonnell. 2019. Is photorealism important for perception of expressive virtual humans in virtual reality?ACM Transactions on Applied Perception (TAP) 16, 3 (2019), 1–19. https://doi.org/10.1145/3349609",
      "doi": "10.1145/3349609"
    }
  ]
}