{
  "doi": "10.1145/3544548.3581322",
  "title": "Groupnamics: Designing an Interface for Overviewing and Managing Parallel Group Discussions in an Online Classroom",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Instructors facilitating online classes have a limited ability to see and hear interactions of student groups working in parallel, which prevents them from interacting with students effectively. In this work, we explore interface design for providing an overview of parallel group discussions in online classrooms. We derive design considerations through a participatory design process and instantiate them in our visualization interface, Groupnamics. Groupnamics visualizes recent vocal activities and discussion statuses of each group in a one-page view, facilitating identification of groups where intervention may be needed. Our user study with 16 instructors confirmed that Groupnamics can successfully provide cues for when instructors should join group discussions and improvements on the perceived usefulness and ease of use over the baseline interface representing existing videoconferencing tools. Our qualitative results suggest future research directions in interface design for online parallel group discussions.",
  "tags": [
    "parallel group discussions",
    "online classroom",
    "Group visualization"
  ],
  "authors": [
    {
      "name": "Arissa J. Sato",
      "institution": "IIS Lab, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702429",
      "orcid": "0000-0002-1103-8050"
    },
    {
      "name": "Zefan Sramek",
      "institution": "IIS Lab, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780077",
      "orcid": "0000-0003-4541-0399"
    },
    {
      "name": "Koji Yatani",
      "institution": "IIS Lab, The University of Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100158260/rel-imgonly/me_202010.jpg",
      "acmid": "81100158260",
      "orcid": "0000-0003-4192-0420"
    }
  ],
  "references": [
    {
      "text": "Hiroyuki Adachi, Seiko Myojin, and Nobutaka Shimada. 2015. ScoringTalk: A Tablet System Scoring and Visualizing Conversation for Balancing of Participation. In SIGGRAPH Asia 2015 Mobile Graphics and Interactive Applications (Kobe, Japan) (SA ’15). Association for Computing Machinery, New York, NY, USA, Article 9, 5 pages. https://doi.org/10.1145/2818427.2818454",
      "doi": "10.1145/2818427.2818454"
    },
    {
      "text": "Karan Ahuja, Dohyun Kim, Franceska Xhakaj, Virag Varga, Anne Xie, Stanley Zhang, Jay Eric Townsend, Chris Harrison, Amy Ogan, and Yuvraj Agarwal. 2019. EduSense: Practical Classroom Sensing at Scale. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 3, Article 71 (sep 2019), 26 pages. https://doi.org/10.1145/3351229",
      "doi": "10.1145/3351229"
    },
    {
      "text": "Gökçe Akçayır and Murat Akçayır. 2018. The flipped classroom: A review of its advantages and challenges. Computers & Education 126 (2018), 334–345. https://doi.org/10.1016/j.compedu.2018.07.021",
      "doi": ""
    },
    {
      "text": "Pengcheng An, Saskia Bakker, Sara Ordanovski, Ruurd Taconis, and Berry Eggen. 2018. ClassBeacons: Designing Distributed Visualization of Teachers’ Physical Proximity in the Classroom. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (Stockholm, Sweden) (TEI ’18). Association for Computing Machinery, New York, NY, USA, 357–367. https://doi.org/10.1145/3173225.3173243",
      "doi": "10.1145/3173225.3173243"
    },
    {
      "text": "Pengcheng An, Saskia Bakker, Sara Ordanovski, Ruurd Taconis, Chris L. E. Paffen, and Berry Eggen. 2019. ClassBeacons: Enhancing Reflection-in-Action of Teachers through Spatially Distributed Ambient Information. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3290607.3313239",
      "doi": "10.1145/3290607.3313239"
    },
    {
      "text": "Dimitra Anastasiou and Eric Ras. 2017. A Questionnaire-Based Case Study on Feedback by a Tangible Interface. In Proceedings of the 2017 ACM Workshop on Intelligent Interfaces for Ubiquitous and Smart Learning(Limassol, Cyprus) (SmartLearn ’17). Association for Computing Machinery, New York, NY, USA, 39–42. https://doi.org/10.1145/3038535.3038540",
      "doi": "10.1145/3038535.3038540"
    },
    {
      "text": "Mark Andrejevic and Neil Selwyn. 2020. Facial recognition technology in schools: critical questions and concerns. Learning, Media and Technology 45, 2 (2020), 115–128. https://doi.org/10.1080/17439884.2020.1686014 arXiv:https://doi.org/10.1080/17439884.2020.1686014",
      "doi": ""
    },
    {
      "text": "Subhashni Appana. 2008. A review of benefits and limitations of online learning in the context of the student, the instructor and the tenured faculty. International Journal on E-learning 7, 1 (2008), 5–22.",
      "doi": ""
    },
    {
      "text": "Khaled Bachour, Frederic Kaplan, and Pierre Dillenbourg. 2010. An interactive table for supporting participation balance in face-to-face collaborative learning. IEEE Transactions on Learning Technologies 3, 3 (2010), 203–213.",
      "doi": "10.1109/TLT.2010.18"
    },
    {
      "text": "Tony Bergstrom, Andrew Harris, and Karrie Karahalios. 2011. Encouraging initiative in the classroom with anonymous feedback. In IFIP Conference on Human-Computer Interaction. Springer, 627–642.",
      "doi": ""
    },
    {
      "text": "Tony Bergstrom and Karrie Karahalios. 2007. Conversation Clock: Visualizing audio patterns in co-located groups. In 2007 40th Annual Hawaii International Conference on System Sciences (HICSS’07). 78–78. https://doi.org/10.1109/HICSS.2007.151",
      "doi": "10.1109/HICSS.2007.151"
    },
    {
      "text": "Tony Bergstrom and Karrie Karahalios. 2009. Conversation Clusters: Grouping Conversation Topics through Human-Computer Dialog. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 2349–2352. https://doi.org/10.1145/1518701.1519060",
      "doi": "10.1145/1518701.1519060"
    },
    {
      "text": "Jacob Bishop and Matthew A Verleger. 2013. The flipped classroom: A survey of the research. In 2013 ASEE Annual Conference & Exposition. 23–1200.",
      "doi": ""
    },
    {
      "text": "Julia Cambre, Scott Klemmer, and Chinmay Kulkarni. 2018. Juxtapeer: Comparative Peer Review Yields Higher Quality Feedback and Promotes Deeper Reflection. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173868",
      "doi": "10.1145/3173574.3173868"
    },
    {
      "text": "A. T. Chamillard. 2011. Using a Student Response System in CS1 and CS2. In Proceedings of the 42nd ACM Technical Symposium on Computer Science Education (Dallas, TX, USA) (SIGCSE ’11). Association for Computing Machinery, New York, NY, USA, 299–304. https://doi.org/10.1145/1953163.1953253",
      "doi": "10.1145/1953163.1953253"
    },
    {
      "text": "Senthil Chandrasegaran, Chris Bryan, Hidekazu Shidara, Tung-Yen Chuang, and Kwan-Liu Ma. 2019. TalkTraces: Real-Time Capture and Visualization of Verbal Content in Meetings. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300807",
      "doi": "10.1145/3290605.3300807"
    },
    {
      "text": "Bo Chang. 2021. Student privacy issues in online learning environments. Distance Education 42, 1 (2021), 55–69. https://doi.org/10.1080/01587919.2020.1869527 arXiv:https://doi.org/10.1080/01587919.2020.1869527",
      "doi": ""
    },
    {
      "text": "Xiuyu Chen and Shihui Feng. 2022. Exploring the Relationships between Social and Teaching Presence in Video-Based Informal Learning Using Network Analysis. In Proceedings of the Ninth ACM Conference on Learning @ Scale (New York City, NY, USA) (L@S ’22). Association for Computing Machinery, New York, NY, USA, 340–344. https://doi.org/10.1145/3491140.3528316",
      "doi": "10.1145/3491140.3528316"
    },
    {
      "text": "Zhilong Chen, Hancheng Cao, Yuting Deng, Xuan Gao, Jinghua Piao, Fengli Xu, Yu Zhang, and Yong Li. 2021. Learning from Home: A Mixed-Methods Analysis of Live Streaming Based Remote Education Experience in Chinese Colleges during the COVID-19 Pandemic. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 348, 16 pages. https://doi.org/10.1145/3411764.3445428",
      "doi": "10.1145/3411764.3445428"
    },
    {
      "text": "Eva Hammar Chiriac and Karin Forslund Frykedal. 2011. Management of group work as a classroom activity. World Journal of Education 1, 2 (2011), 3–16. https://doi.org/10.5430/wje.v1n2p3",
      "doi": ""
    },
    {
      "text": "Heather Glynn Crawford-Ferre and Lynda R. Wiest. 2012. Effective Online Instruction in Higher Education. Quarterly Review of Distance Education 13, 1 (2012), 11–14. https://www.learntechlib.org/p/131979",
      "doi": ""
    },
    {
      "text": "Fred D. Davis. 1989. Perceived Usefulness, Perceived Ease of Use, and User Acceptance of Information Technology. MIS Quarterly 13 (09 1989), 319–. https://doi.org/10.2307/249008",
      "doi": "10.2307/249008"
    },
    {
      "text": "Joan Morris DiMicco, Katherine J. Hollenbach, and Walter Bender. 2006. Using Visualizations to Review a Group’s Interaction Dynamics. In CHI ’06 Extended Abstracts on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI EA ’06). Association for Computing Machinery, New York, NY, USA, 706–711. https://doi.org/10.1145/1125451.1125594",
      "doi": "10.1145/1125451.1125594"
    },
    {
      "text": "Joan Morris DiMicco, Anna Pandolfo, and Walter Bender. 2004. Influencing Group Participation with a Shared Display. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (Chicago, Illinois, USA) (CSCW ’04). Association for Computing Machinery, New York, NY, USA, 614–623. https://doi.org/10.1145/1031607.1031713",
      "doi": "10.1145/1031607.1031713"
    },
    {
      "text": "Judith Donath. 2002. A semantic approach to visualizing online conversations. Commun. ACM 45, 4 (2002), 45–49.",
      "doi": "10.1145/505248.505271"
    },
    {
      "text": "Judith Donath, Karrie Karahalios, and Fernanda Viegas. [n. d.]. Visualizing Conversation. Journal of Computer-Mediated Communication 4, 4 ([n. d.]), 0–0. https://doi.org/10.1111/j.1083-6101.1999.tb00107.x",
      "doi": ""
    },
    {
      "text": "Judith Donath and Fernanda B. Viégas. 2002. The Chat Circles Series: Explorations in Designing Abstract Graphical Communication Interfaces. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (London, England) (DIS ’02). Association for Computing Machinery, New York, NY, USA, 359–369. https://doi.org/10.1145/778712.778764",
      "doi": "10.1145/778712.778764"
    },
    {
      "text": "Yvonne Earnshaw. 2017. Navigating turn-taking and conversational repair in an online synchronous course. Online Learning Journal 21, 4 (2017).",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A. Kellogg. 2000. Social Translucence: An Approach to Designing Systems That Support Social Processes. ACM Trans. Comput.-Hum. Interact. 7, 1 (mar 2000), 59–83. https://doi.org/10.1145/344949.345004",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Abraham E. Flanigan, Mete Akcaoglu, and Emily Ray. 2022. Initiating and maintaining student-instructor rapport in online classes. The Internet and Higher Education 53 (2022), 100844. https://doi.org/10.1016/j.iheduc.2021.100844",
      "doi": ""
    },
    {
      "text": "Mark Freeman, Paul Blayney, and Paul Ginns. 2006. Anonymity and in class learning: The case for electronic response systems. Australasian Journal of Educational Technology 22, 4 (Nov. 2006). https://doi.org/10.14742/ajet.1286",
      "doi": ""
    },
    {
      "text": "Katsuya Fujii, Plivelic Marian, Dav Clark, Yoshi Okamoto, and Jun Rekimoto. 2018. Sync Class: Visualization System for In-Class Student Synchronization. In Proceedings of the 9th Augmented Human International Conference (Seoul, Republic of Korea) (AH ’18). Association for Computing Machinery, New York, NY, USA, Article 12, 8 pages. https://doi.org/10.1145/3174910.3174927",
      "doi": "10.1145/3174910.3174927"
    },
    {
      "text": "Kazuyuki Fujita, Yuichi Itoh, Hiroyuki Ohsaki, Naoaki Ono, Keiichiro Kagawa, Kazuki Takashima, Sho Tsugawa, Kosuke Nakajima, Yusuke Hayashi, and Fumio Kishino. 2011. Ambient Suite: Enhancing Communication among Multiple Participants. In Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology(Lisbon, Portugal) (ACE ’11). Association for Computing Machinery, New York, NY, USA, Article 25, 8 pages. https://doi.org/10.1145/2071423.2071454",
      "doi": "10.1145/2071423.2071454"
    },
    {
      "text": "Jens Emil Grønbæk, Banu Saatçi, Carla F. Griggio, and Clemens Nylandsted Klokmose. 2021. MirrorBlender: Supporting Hybrid Meetings with a Malleable Video-Conferencing System. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445698",
      "doi": "10.1145/3411764.3445698"
    },
    {
      "text": "Philip J. Guo. 2015. Codeopticon: Real-Time, One-To-Many Human Tutoring for Computer Programming. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology(Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 599–608. https://doi.org/10.1145/2807442.2807469",
      "doi": "10.1145/2807442.2807469"
    },
    {
      "text": "Marion Händel, Svenja Bedenlier, Bärbel Kopp, Michaela Gläser-Zikuda, Rudolf Kammerl, and Albert Ziegler. 2022. The webcam and student engagement in synchronous online learning: visually or verbally?Education and Information Technologies(2022), 1 – 24.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9(2006), 904–908. https://doi.org/10.1177/154193120605000909 arXiv:https://doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Frank Heppner. 2007. Teaching the large college class: A guidebook for instructors with multitudes. Vol. 116. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Reiya Horii, Yurike Chandra, Kai Kunze, and Kouta Minamizawa. 2020. Bubble Visualization Overlay in Online Communication for Increased Speed Awareness and Better Turn Taking. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20 Adjunct). Association for Computing Machinery, New York, NY, USA, 59–61. https://doi.org/10.1145/3379350.3416185",
      "doi": "10.1145/3379350.3416185"
    },
    {
      "text": "Maggie Hughes and Deb Roy. 2020. Keeper: An Online Synchronous Conversation Environment Informed by In-Person Facilitation Practices. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing (Virtual Event, USA) (CSCW ’20 Companion). Association for Computing Machinery, New York, NY, USA, 275–279. https://doi.org/10.1145/3406865.3418344",
      "doi": "10.1145/3406865.3418344"
    },
    {
      "text": "Margaret A. Hughes and Deb Roy. 2021. Keeper: A Synchronous Online Conversation Environment Informed by In-Person Facilitation Practices. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445316",
      "doi": "10.1145/3411764.3445316"
    },
    {
      "text": "Ajita John, Shreeharsh Kelkar, Ed Peebles, Adithya Renduchintala, and Doree Seligmann. 2007. Collaborative Tagging and Persistent Audio Conversations. In European Conference on Computer Supported Cooperative Work (ECSCW 2007): Workshop on CSCW and Web, Vol. 2.",
      "doi": ""
    },
    {
      "text": "K. Kendall and Elisabeth Schussler. 2012. Does Instructor Type Matter? Undergraduate Student Perception of Graduate Teaching Assistants and Professors. CBE life sciences education 11 (06 2012), 187–99. https://doi.org/10.1187/cbe.11-10-0091",
      "doi": ""
    },
    {
      "text": "Soomin Kim, Jinsu Eun, Joseph Seering, and Joonhwan Lee. 2021. Moderator Chatbot for Deliberative Discussion: Effects of Discussion Structure and Discussant Facilitation. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 87 (apr 2021), 26 pages. https://doi.org/10.1145/3449161",
      "doi": "10.1145/3449161"
    },
    {
      "text": "Taemie Kim, Agnes Chang, Lindsey Holland, and Alex Sandy Pentland. 2008. Meeting Mediator: Enhancing Group Collaborationusing Sociometric Feedback. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (San Diego, CA, USA) (CSCW ’08). Association for Computing Machinery, New York, NY, USA, 457–466. https://doi.org/10.1145/1460563.1460636",
      "doi": "10.1145/1460563.1460636"
    },
    {
      "text": "Taemie Kim, Pamela Hinds, and Alex Pentland. 2012. Awareness as an Antidote to Distance: Making Distributed Groups Cooperative and Consistent. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). Association for Computing Machinery, New York, NY, USA, 1237–1246. https://doi.org/10.1145/2145204.2145391",
      "doi": "10.1145/2145204.2145391"
    },
    {
      "text": "Chinmay E. Kulkarni, Michael S. Bernstein, and Scott R. Klemmer. 2015. PeerStudio: Rapid Peer Feedback Emphasizes Revision and Improves Performance. In Proceedings of the Second (2015) ACM Conference on Learning @ Scale (Vancouver, BC, Canada) (L@S ’15). Association for Computing Machinery, New York, NY, USA, 75–84. https://doi.org/10.1145/2724660.2724670",
      "doi": "10.1145/2724660.2724670"
    },
    {
      "text": "David Kurlander, Tim Skelly, and David Salesin. 1996. Comic chat. In Proceedings of the 23rd annual conference on Computer graphics and interactive techniques. 225–236.",
      "doi": "10.1145/237170.237260"
    },
    {
      "text": "Alyson Latham and N Sharon Hill. 2014. Preference for anonymous classroom participation: Linking student characteristics and reactions to electronic response systems. Journal of Management Education 38, 2 (2014), 192–215.",
      "doi": ""
    },
    {
      "text": "Moon-Hwan Lee, Yea-Kyung Row, Oosung Son, Uichin Lee, Jaejeung Kim, Jungi Jeong, Seungryoul Maeng, and Tek-Jin Nam. 2018. Flower-Pop: Facilitating Casual Group Conversations With Multiple Mobile Devices. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 150 (jan 2018), 24 pages. https://doi.org/10.1145/3161170",
      "doi": "10.1145/3161170"
    },
    {
      "text": "Jialang Victor Li, Max Kreminski, Sean M Fernandes, Anya Osborne, Joshua McVeigh-Schultz, and Katherine Isbister. 2022. Conversation Balance: A Shared VR Visualization to Support Turn-Taking in Meetings. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems(New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 181, 4 pages. https://doi.org/10.1145/3491101.3519879",
      "doi": "10.1145/3491101.3519879"
    },
    {
      "text": "Na Li, Guillermo Romera Rodriguez, Yuqiao Xu, Parth Bhatt, Huy A. Nguyen, Alex Serpi, Chunhua Tsai, and John M. Carroll. 2022. Picturing One’s Self: Camera Use in Zoom Classes during the COVID-19 Pandemic. In Proceedings of the Ninth ACM Conference on Learning @ Scale (New York City, NY, USA) (L@S ’22). Association for Computing Machinery, New York, NY, USA, 151–162. https://doi.org/10.1145/3491140.3528284",
      "doi": "10.1145/3491140.3528284"
    },
    {
      "text": "Shuai Ma, Taichang Zhou, Fei Nie, and Xiaojuan Ma. 2022. Glancee: An Adaptable System for Instructors to Grasp Student Learning Status in Synchronous Online Classes. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 313, 25 pages. https://doi.org/10.1145/3491102.3517482",
      "doi": "10.1145/3491102.3517482"
    },
    {
      "text": "Jamie Manolev, Anna Sullivan, and Roger Slee. 2019. The datafication of discipline: ClassDojo, surveillance and a performative classroom culture. Learning, Media and Technology 44, 1 (2019), 36–51. https://doi.org/10.1080/17439884.2018.1558237 arXiv:https://doi.org/10.1080/17439884.2018.1558237",
      "doi": ""
    },
    {
      "text": "Roberto Martinez-Maldonado, Judy Kay, Simon Buckingham Shum, and Kalina Yacef. 2019. Collocated Collaboration Analytics: Principles and Dilemmas for Mining Multimodal Interaction Data. Human–Computer Interaction 34, 1 (2019), 1–50. https://doi.org/10.1080/07370024.2017.1338956 arXiv:https://doi.org/10.1080/07370024.2017.1338956",
      "doi": ""
    },
    {
      "text": "Misaki Matsuda, Ivan Tanev, and Katsunori Shimohara. 2010. Comic live chat communication tool based on concept of downgrading. In Proceedings of SICE Annual Conference 2010. IEEE, 2775–2778.",
      "doi": ""
    },
    {
      "text": "Joshua McVeigh-Schultz and Katherine Isbister. 2021. The Case for “Weird Social” in VR/XR: A Vision of Social Superpowers Beyond Meatspace. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 17, 10 pages. https://doi.org/10.1145/3411763.3450377",
      "doi": "10.1145/3411763.3450377"
    },
    {
      "text": "Elizabeth Monk-Turner and Brian Payne. 2005. Addressing issues in group work in the classroom. Journal of Criminal Justice Education 16, 1 (2005), 166–179. https://doi.org/10.1080/1051125042000333532 arXiv:https://doi.org/10.1080/1051125042000333532",
      "doi": ""
    },
    {
      "text": "Michael J Muller and Sarah Kuhn. 1993. Participatory design. Commun. ACM 36, 6 (1993), 24–28.",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Catherine Mulryan-Kyne. 2010. Teaching large classes at college and university level: Challenges and opportunities. Teaching in higher education 15, 2 (2010), 175–185.",
      "doi": ""
    },
    {
      "text": "Prasanth Murali, Javier Hernandez, Daniel McDuff, Kael Rowan, Jina Suh, and Mary Czerwinski. 2021. AffectiveSpotlight: Facilitating the Communication of Affective Responses from Audience Members during Online Presentations. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445235",
      "doi": "10.1145/3411764.3445235"
    },
    {
      "text": "Kyohei Ogawa, Yukari Hori, Toshiki Takeuchi, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Table Talk Enhancer: A Tabletop System for Enhancing and Balancing Mealtime Conversations Using Utterance Rates. In Proceedings of the ACM Multimedia 2012 Workshop on Multimedia for Cooking and Eating Activities (Nara, Japan) (CEA ’12). Association for Computing Machinery, New York, NY, USA, 25–30. https://doi.org/10.1145/2390776.2390783",
      "doi": "10.1145/2390776.2390783"
    },
    {
      "text": "Judith S Olson, Gary M Olson, and David K Meader. 1995. What mix of video and audio is useful for small groups doing remote real-time design work?. In Proceedings of the SIGCHI conference on Human factors in computing systems. 362–368.",
      "doi": "10.1145/223904.223951"
    },
    {
      "text": "Soo-Hyun Park, Seung-Hyun Ji, Dong-Sung Ryu, and Hwan-Gue Cho. 2008. AVACHAT: A New Comic-Based Chat System for Virtual Avatars. In Proceedings of the 2008 ACM Symposium on Virtual Reality Software and Technology (Bordeaux, France) (VRST ’08). Association for Computing Machinery, New York, NY, USA, 279–280. https://doi.org/10.1145/1450579.1450652",
      "doi": "10.1145/1450579.1450652"
    },
    {
      "text": "Elizabeth J. Parks-Stamm, Maria Zafonte, and Stephanie M. Palenque. 2017. The effects of instructor participation and class size on student participation in an online class discussion forum. British Journal of Educational Technology 48, 6 (2017), 1250–1259. https://doi.org/10.1111/bjet.12512 arXiv:https://bera-journals.onlinelibrary.wiley.com/doi/pdf/10.1111/bjet.12512",
      "doi": ""
    },
    {
      "text": "J. P. Powell. 1974. Small Group Teaching Methods in Higher Education. Educational Research 16, 3 (1974), 163–171. https://doi.org/10.1080/0013188740160301 arXiv:https://doi.org/10.1080/0013188740160301",
      "doi": ""
    },
    {
      "text": "Joseph W. Roberts. 2021. Rapidly Moving Online in a Pandemic: Intentionality, Rapport, and The Synchronous/Asynchronous Delivery Decision. PS: Political Science & Politics 54, 1 (2021), 183–185. https://doi.org/10.1017/S1049096520001596",
      "doi": ""
    },
    {
      "text": "Patrick C. Shih, David H. Nguyen, Sen H. Hirano, David F. Redmiles, and Gillian R. Hayes. 2009. GroupMind: Supporting Idea Generation through a Collaborative Mind-Mapping Tool. In Proceedings of the ACM 2009 International Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’09). Association for Computing Machinery, New York, NY, USA, 139–148. https://doi.org/10.1145/1531674.1531696",
      "doi": "10.1145/1531674.1531696"
    },
    {
      "text": "Donghoon Shin, Sangwon Yoon, Soomin Kim, and Joonhwan Lee. 2021. BlahBlahBot: Facilitating Conversation between Strangers Using a Chatbot with ML-Infused Personalized Topic Suggestion. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 409, 6 pages. https://doi.org/10.1145/3411763.3451771",
      "doi": "10.1145/3411763.3451771"
    },
    {
      "text": "Clay Spinuzzi. 2005. The methodology of participatory design. Technical communication 52, 2 (2005), 163–174.",
      "doi": ""
    },
    {
      "text": "Christie Suggs, Jennifer Myers, and Vanessa Dennen. 2010. Raise your hand if you wanna speak: Navigating turn-taking in a Webex course. In E-Learn: World Conference on E-Learning in Corporate, Government, Healthcare, and Higher Education. Association for the Advancement of Computing in Education (AACE), 2212–2219.",
      "doi": ""
    },
    {
      "text": "Annie Tat and Sheelagh Carpendale. 2006. CrystalChat: Visualizing personal chat history. In Proceedings of the 39th Annual Hawaii International Conference on System Sciences (HICSS’06), Vol. 3. IEEE, 58c–58c.",
      "doi": "10.1109/HICSS.2006.107"
    },
    {
      "text": "Sarah Tausch, Doris Hausen, Ismail Kosan, Andrey Raltchev, and Heinrich Hussmann. 2014. Groupgarden: Supporting Brainstorming through a Metaphorical Group Mirror on Table or Wall. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (Helsinki, Finland) (NordiCHI ’14). Association for Computing Machinery, New York, NY, USA, 541–550. https://doi.org/10.1145/2639189.2639215",
      "doi": "10.1145/2639189.2639215"
    },
    {
      "text": "Sarah Tausch, Stephanie Ta, and Heinrich Hussmann. 2016. A Comparison of Cooperative and Competitive Visualizations for Co-Located Collaboration. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5034–5039. https://doi.org/10.1145/2858036.2858072",
      "doi": "10.1145/2858036.2858072"
    },
    {
      "text": "Hamish Tennent, Solace Shen, and Malte Jung. 2019. Micbot: A Peripheral Robotic Object to Shape Conversational Dynamics and Team Performance. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI). 133–142. https://doi.org/10.1109/HRI.2019.8673013",
      "doi": ""
    },
    {
      "text": "Beth A Trammell and Chera LaForge. 2017. Common challenges for instructors in large online courses: Strategies to mitigate student and instructor frustration.Journal of Educators Online 14, 1 (2017), n1.",
      "doi": ""
    },
    {
      "text": "Fernanda B. Viégas and Judith S. Donath. 1999. Chat Circles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Pittsburgh, Pennsylvania, USA) (CHI ’99). Association for Computing Machinery, New York, NY, USA, 9–16. https://doi.org/10.1145/302979.302981",
      "doi": "10.1145/302979.302981"
    },
    {
      "text": "Ben Williamson. 2019. Datafication of education: a critical approach to emerging analytics technologies and practices. In Rethinking pedagogy for a digital age. Routledge, 212–226.",
      "doi": ""
    },
    {
      "text": "Wanda L. Worley and Lee S. Tesdell. 2009. Instructor Time and Effort in Online and Face-to-Face Teaching: Lessons Learned. IEEE Transactions on Professional Communication 52, 2(2009), 138–151. https://doi.org/10.1109/TPC.2009.2017990",
      "doi": ""
    },
    {
      "text": "Rebecca Xiong and Judith Donath. 1999. PeopleGarden: Creating Data Portraits for Users. In Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology (Asheville, North Carolina, USA) (UIST ’99). Association for Computing Machinery, New York, NY, USA, 37–44. https://doi.org/10.1145/320719.322581",
      "doi": "10.1145/320719.322581"
    },
    {
      "text": "Bin Yang and Cheng Huang. 2021. Turn crisis into opportunity in response to COVID-19: experience from a Chinese University and future prospects. Studies in Higher Education 46, 1 (2021), 121–132. https://doi.org/10.1080/03075079.2020.1859687 arXiv:https://doi.org/10.1080/03075079.2020.1859687",
      "doi": ""
    },
    {
      "text": "Matin Yarmand, Jaemarie Solyst, Scott Klemmer, and Nadir Weibel. 2021. “It Feels Like I Am Talking into a Void”: Understanding Interaction Gaps in Synchronous Online Classrooms(CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 351, 9 pages. https://doi.org/10.1145/3411764.3445240",
      "doi": "10.1145/3411764.3445240"
    },
    {
      "text": "Haoqi Zhang, Matthew W. Easterday, Elizabeth M. Gerber, Daniel Rees Lewis, and Leesha Maliakal. 2017. Agile Research Studios: Orchestrating Communities of Practice to Advance Research Training. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 220–232. https://doi.org/10.1145/2998181.2998199",
      "doi": "10.1145/2998181.2998199"
    },
    {
      "text": "Ying Zhang, Marshall Bern, Juan Liu, Kurt Partridge, Bo Begole, Bob Moore, Jim Reich, and Koji Kishimoto. 2010. Facilitating Meetings with Playful Feedback. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI EA ’10). Association for Computing Machinery, New York, NY, USA, 4033–4038. https://doi.org/10.1145/1753846.1754098",
      "doi": "10.1145/1753846.1754098"
    }
  ]
}