{
  "doi": "10.1145/3544548.3581480",
  "title": "Counterventions: a reparative reflection on interventionist HCI",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2023,
  "badges": [],
  "abstract": "Research in HCI applied to clinical interventions relies on normative assumptions about which bodies and minds are healthy, valuable, and desirable. To disrupt this normalizing drive in HCI, we define a “counterventional approach” to intervention technology design informed by critical scholarship and community perspectives. This approach is meant to unsettle normative assumptions of intervention as urgent, necessary, and curative. We begin with a historical overview of intervention in HCI and its critics. Then, through reparative readings of past HCI projects in autism intervention, we illustrate the emergent principles of a counterventional approach and how it may manifest research outcomes that are fundamentally divergent from dominant approaches. We then explicate characteristics of “counterventions” – projects that aim to contest dominant sociotechnical paradigms through privileging community and participants in research inquiry, interaction design, and analysis of outcomes. These divergent research imaginaries have transformative implications for how interventionist HCI might be conducted in future.",
  "tags": [
    "Queer Theory",
    "Critical Disability Studies",
    "Critical Design",
    "Crip HCI"
  ],
  "authors": [
    {
      "name": "Rua Mae Williams",
      "institution": "Computer Graphics and Technology, Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366755",
      "orcid": "0000-0002-6182-8923"
    },
    {
      "name": "Louanne Boyd",
      "institution": "Learn.Adapt.Build, Chapman University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460647791",
      "orcid": "0000-0002-9244-6581"
    },
    {
      "name": "Juan E. Gilbert",
      "institution": "Computer and Information Sciences and Engineering, University of Florida, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100549770",
      "orcid": "0000-0002-6801-2206"
    }
  ],
  "references": [
    {
      "text": "Chimamanda Ngozi Adichie. 2009. The Danger of a Single Story. Retrieved from https://www.ted.com/talks/chimamanda_ngozi_adichie_the_danger_of_a_single_story",
      "doi": ""
    },
    {
      "text": "Kassiane Asasumasu. 2012. AUTISTIFYING MY HABITAT!! Radical Neurodivergence Speaking. Retrieved April 15, 2019 from http://timetolisten.blogspot.com/2012/08/autistifying-my-habitat.html",
      "doi": ""
    },
    {
      "text": "Liam Bannon, Jeffrey Bardzell, and Susanne Bødker. 2018. Reimagining participatory design. Interactions 26, 1: 26–32. https://doi.org/10.1145/3292015",
      "doi": "10.1145/3292015"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is “critical” about critical design? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 3297–3306. https://doi.org/10.1145/2470654.2466451",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2014. Utopias of participation: design, criticality, and emancipation. In Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - PDC ’14 - volume 2, 189–190. https://doi.org/10.1145/2662155.2662213",
      "doi": "10.1145/2662155.2662213"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: Social science, feminism, and HCI. In Conference on Human Factors in Computing Systems - Proceedings, 675–684. https://doi.org/10.1145/1978942.1979041",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Cynthia L Bennett and Daniela K Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the “Other.” In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, 1–13. https://doi.org/10.1145/3290605.3300528",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Monique Botha and David M. Frost. 2020. Extending the Minority Stress Model to Understand Mental Health Problems Experienced by the Autistic Population. Society and Mental Health 10, 1: 20–34. https://doi.org/10.1177/2156869318804297",
      "doi": ""
    },
    {
      "text": "LouAnne E. Boyd, Saumya Gupta, Sagar B. Vikmani, Carlos M. Gutierrez, Junxiang Yang, Erik Linstead, and Gillian R. Hayes. 2018. vrSocial: Toward Immersive Therapeutic VR Systems for Children with Autism. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–12. https://doi.org/10.1145/3173574.3173778",
      "doi": "10.1145/3173574.3173778"
    },
    {
      "text": "LouAnne E. Boyd, Xinlong Jiang, and Gillian R. Hayes. 2017. ProCom: Designing and Evaluating a Mobile and Wearable System to Support Proximity Awareness for People with Autism. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17, 2865–2877. https://doi.org/10.1145/3025453.3026014",
      "doi": "10.1145/3025453.3026014"
    },
    {
      "text": "LouAnne E. Boyd, Alejandro Rangel, Helen Tomimbang, Andrea Conejo-Toledo, Kanika Patel, Monica Tentori, and Gillian R. Hayes. 2016. SayWAT: Augmenting Face-to-Face Conversations for Adults with Autism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16, 4872–4883. https://doi.org/10.1145/2858036.2858215",
      "doi": "10.1145/2858036.2858215"
    },
    {
      "text": "Sarah Cassidy, Louise Bradley, Rebecca Shaw, and Simon Baron-Cohen. 2018. Risk markers for suicidality in autistic adults. Molecular Autism 9, 1: 42. https://doi.org/10.1186/s13229-018-0226-4",
      "doi": ""
    },
    {
      "text": "Sarah Cassidy, Paul Bradley, Janine Robinson, Carrie Allison, Meghan McHugh, and Simon Baron-Cohen. 2014. Suicidal ideation and suicide plans or attempts in adults with asperger's syndrome attending a specialist diagnostic clinic: A clinical cohort study. The Lancet Psychiatry 1, 2: 142–147. https://doi.org/10.1016/S2215-0366(14)70248-2",
      "doi": ""
    },
    {
      "text": "Michela Cozza, Linda Tonolli, and Vincenzo D'Andrea. 2016. Subversive participatory design: Reflections on a case study. In Proceedings of the 14th Participatory Design Conference: Short Papers, Interactive Exhibitions, Workshops - Volume 2, 53–56. https://doi.org/10.1145/2948076.2948085",
      "doi": "10.1145/2948076.2948085"
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2010. Innovation in participatory design. In Proceedings of the 11th Biennial Participatory Design Conference on - PDC ’10, 281. https://doi.org/10.1145/1900441.1900508",
      "doi": "10.1145/1900441.1900508"
    },
    {
      "text": "DART. 2019. Diversity in Social Intelligence: Summer 2019 update. University of Edinburgh, Edinburgh.",
      "doi": ""
    },
    {
      "text": "Christian Dindler and Ole Sejer Iversen. 2014. Relational Expertise in Participatory Design. Proceedings of the 13th Participatory Design Conference on Research Papers - PDC ’14. https://doi.org/10.1145/2661435",
      "doi": "10.1145/2661435"
    },
    {
      "text": "Batya Friedman. 1996. Value-Sensitive Design. Interactions of the ACM 3, 6: 17–23.",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Colin M. Gray and Shruthi Sai Chivukula. 2019. Ethical Mediation in UX Practice. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–11. https://doi.org/10.1145/3290605.3300408",
      "doi": "10.1145/3290605.3300408"
    },
    {
      "text": "Christina N. Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW. https://doi.org/10.1145/3359318",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Gillian R. Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction 18, 3: 15:1-15:20. https://doi.org/10.1145/1993060.1993065",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Brent Hecht, Lauren Wilcox, Jeffrey P. Bigham, Johannes Schöning, Ehsan Hoque, Jason Ernst, Yonatan Bisk, Lana Yarosh, Bushra Amjam, and Cathy Wu. 2018. It's Time to Do Something: Mitigating the Negative Impacts of Computing Through a Change to the Peer Review Process. ACM Future of Computing. Retrieved January 6, 2019 from https://acm-fca.org/2018/03/29/negativeimpacts/",
      "doi": ""
    },
    {
      "text": "Liz Jackson, Alex Haagaard, and Rua M. Williams. 2022. Disability Dongle. CASTAC Platypus Blog. Retrieved January 26, 2023 from https://blog.castac.org/2022/04/disability-dongle/",
      "doi": ""
    },
    {
      "text": "Alison Kafer. 2013. Feminist, Queer, Crip. Indiana University Press, Bloomington, IN. Retrieved March 15, 2018 from http://www.jstor.org/stable/j.ctt16gz79x",
      "doi": ""
    },
    {
      "text": "F. D. Kennedy, J. C. Wright, M. J. Anderson, and Phillip Cooley. 1969. Simulation in mental health planning. Proceedings of the fourth annual conference on Applications of simulation. https://doi.org/10.5555/800240.807184",
      "doi": "10.5555/800240.807184"
    },
    {
      "text": "O. George Kennedy. 1973. The use of computer simulation in health care facility design. In Proceedings - Winter Simulation Conference, 172–198. https://doi.org/10.1145/800293.811575",
      "doi": "10.1145/800293.811575"
    },
    {
      "text": "Eunjung Kim. 2017. Curative Violence: Rehabilitating Disability, Gender, and Sexuality in Modern Korea. Duke University Press, Durham and London.",
      "doi": ""
    },
    {
      "text": "Ann Light. 2011. HCI as heterodoxy: Technologies of identity and the queering of interaction with computers✩. Interacting with Computers 23, 5: 430–438. https://doi.org/10.1016/j.intcom.2011.02.002",
      "doi": "10.1016/j.intcom.2011.02.002"
    },
    {
      "text": "Kelly Mack and Emma McDonnell. 2021. What do we mean by accessibility research? a literature survey of accessibility papers in chi and assets from 1994 to 2019. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3411764.3445412",
      "doi": "10.1145/3411764.3445412"
    },
    {
      "text": "Jennifer Mankoff, Gillian R. Hayes, and Devva Kasnitz. 2010. Disability studies as a source of critical inquiry for the field of assistive technology. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility - ASSETS ’10, 3. https://doi.org/10.1145/1878803.1878807",
      "doi": "10.1145/1878803.1878807"
    },
    {
      "text": "J. Milsum, D. Uyeno, I. Vertinsky, and H. Will. 1971. Vancouver regional health planning model. In Proceedings - Winter Simulation Conference, 462–473. https://doi.org/10.1145/800294.811473",
      "doi": "10.1145/800294.811473"
    },
    {
      "text": "Cal Montgomery. 2019. Little Red Wagons. Cal's Blog. Retrieved February 11, 2022 from https://montgomerycal.wordpress.com/2019/12/29/little-red-wagons/",
      "doi": ""
    },
    {
      "text": "Michael J. Muller and Sarah Kuhn. 1993. Participatory design. Communications of the ACM 36, 6: 24–28. https://doi.org/10.1145/153571.255960",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Brenda Smith Myles and Richard L. Simpson. 2001. Understanding the Hidden Curriculum: An Essential Social Skill for Children and Youth with Asperger Syndrome. Intervention in School and Clinic 36, 5: 279–286. https://doi.org/10.1177/105345120103600504",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Esther O. Ohito and Shenila Khoja-Moolji. 2018. Reparative readings: re-claiming black feminised bodies as sites of somatic pleasures and possibilities. Gender and Education 30, 3: 277–294. https://doi.org/10.1080/09540253.2016.1225014",
      "doi": ""
    },
    {
      "text": "Michael Oliver. 1990. The politics of disablement: A sociological approach. Palgrave Macmillan. Retrieved February 15, 2022 from https://lib.ugent.be/catalog/rug01:000362511",
      "doi": ""
    },
    {
      "text": "Sushil K. Oswal. 2014. Participatory design: barriers and possibilities. Communication Design Quarterly 2, 3: 14–19. https://doi.org/10.1145/2644448.2644452",
      "doi": "10.1145/2644448.2644452"
    },
    {
      "text": "Lucy Pei and Bonnie Nardi. 2019. We Did It Right, But It Was Still Wrong: Toward Assets-Based Design. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1–11. https://doi.org/10.1145/3290607.3310434",
      "doi": "10.1145/3290607.3310434"
    },
    {
      "text": "Elizabeth Pellicano, Adam Dinsmore, and Tony Charman. 2014. What should autism research focus upon? Community views and priorities from the United Kingdom. Autism 18, 7: 756–770. https://doi.org/10.1177/1362361314529627",
      "doi": ""
    },
    {
      "text": "Suvi Pihkala and Helena Karasti. 2016. Reflexive Engagement-Enacting Reflexivity in Design and for “Participation in Plural.” In Proceedings of the 14th Participatory Design Conference: Full papers - Volume 1. Retrieved June 13, 2021 from http://dx.doi.org/10.1145/2940299.2940302",
      "doi": "10.1145/2940299.2940302"
    },
    {
      "text": "Donna Riley. 2017. Rigor/Us: Building Boundaries and Disciplining Diversity with Standards of Merit. Engineering Studies 9, 3: 249–265. https://doi.org/10.1080/19378629.2017.1408631",
      "doi": ""
    },
    {
      "text": "Camille Robcis. 2020. Frantz Fanon, institutional psychotherapy, and the decolonization of psychiatry. Journal of the History of Ideas 81, 2: 303–325. https://doi.org/10.1353/jhi.2020.0009",
      "doi": ""
    },
    {
      "text": "Jennifer A. Rode. 2011. Reflexivity in digital anthropology. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11, 123–132. https://doi.org/10.1145/1978942.1978961",
      "doi": "10.1145/1978942.1978961"
    },
    {
      "text": "Jennifer A. Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers 23, 5: 393–400. https://doi.org/10.1016/j.intcom.2011.04.005",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Claudia M. Roebers. 2017. Executive function and metacognition: Towards a unifying framework of cognitive self-regulation. Developmental Review 45: 31–51. https://doi.org/10.1016/J.DR.2017.04.001",
      "doi": ""
    },
    {
      "text": "Noah J Sasson, Daniel J Faso, Jack Nugent, Sarah Lovell, Daniel P Kennedy, and Ruth B Grossman. 2017. Neurotypical Peers are Less Willing to Interact with Those with Autism based on Thin Slice Judgments. Scientific Reports 7, 1: 40700. https://doi.org/10.1038/srep40700",
      "doi": ""
    },
    {
      "text": "Noah J Sasson and Kerrianne E Morrison. 2019. First impressions of adults with autism improve with diagnostic disclosure and increased autism knowledge of peers. Autism 23, 1: 50–59. https://doi.org/10.1177/1362361317729526",
      "doi": ""
    },
    {
      "text": "Eve Kosofsky Sedgwick. 1997. Paranoid Reading and Reparative Reading; or, You're So Paranoid, You Probably Think This Introduction is About You EVE KOSOFSKY SEDGWICK. https://doi.org/10.1215/9780822382478-001",
      "doi": ""
    },
    {
      "text": "Paul T. Shattuck, Sarah Carter Narendorf, Benjamin Cooper, Paul R. Sterzing, Mary Wagner, and Julie Lounds Taylor. 2012. Postsecondary Education and Employment Among Youth With an Autism Spectrum Disorder. PEDIATRICS 129, 6: 1042–1049. https://doi.org/10.1542/peds.2011-2864",
      "doi": ""
    },
    {
      "text": "Lawrence D. Shriberg, Rhea Paul, Jane L. McSweeny, Ami Klin, Donald J. Cohen, and Fred R. Volkmar. 2001. Speech and Prosody Characteristics of Adolescents and Adults With High-Functioning Autism and Asperger Syndrome. Journal of Speech, Language, and Hearing Research 44, 5: 1097–1115. https://doi.org/10.1044/1092-4388(2001/087)",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Os Keyes, and Geraldine Fitzpatrick. 2019. Agency of Autistic Children in Technology Research—A Critical Literature Review. ACM Transactions on Computer-Human Interaction 26, 6: 1–40. https://doi.org/10.1145/3344919",
      "doi": "10.1145/3344919"
    },
    {
      "text": "Katta Spiel and Kathrin Gerling. 2020. The Purpose of Play: How HCI Games Research Fails Neurodivergent Populations. Transactions in Computer Human Interaction preprint. https://doi.org/10.1145/nnnnnnn.nnnnnnn",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Laura Malinverni, Judith Good, and Christopher Frauenberger. 2017. Participatory Evaluation with Autistic Children. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17, 5755–5766. https://doi.org/10.1145/3025453.3025851",
      "doi": "10.1145/3025453.3025851"
    },
    {
      "text": "stinkyzen. 2019. Elements of Executive Function: Road Trip Without a Map. NeuroClastic. Retrieved February 11, 2022 from https://neuroclastic.com/elements-of-executive-functioning-dysfunction/",
      "doi": ""
    },
    {
      "text": "Joseph A. Stramondo. 2019. The Distinction Between Curative and Assistive Technology. Science and Engineering Ethics 25, 4: 1125–1145. https://doi.org/10.1007/s11948-018-0058-9",
      "doi": ""
    },
    {
      "text": "Patricia Stuelke. 2021. The Ruse of Repair: US Neoliberal Empire and the Turn from Critique. Duke University Press, Durham, NC.",
      "doi": ""
    },
    {
      "text": "Yngve Sundblad. 2011. UTOPIA: Participatory design from Scandinavia to the world. In HiNC3, IFIP AICT 350. Springer, Berlin, Heidelberg, 176–186. https://doi.org/10.1007/978-3-642-23315-9_20",
      "doi": ""
    },
    {
      "text": "Tanya Titchkosky. 2007. Reading and Writing Disability Differently: The Textured Life of Embodiment. University of Toronto Press. https://doi.org/10.3138/9781442683839",
      "doi": ""
    },
    {
      "text": "Tanya Titchkosky. 2011. The Question of Access: Disability, Space, Meaning. University of Toronto Press, Toronto, CA.",
      "doi": ""
    },
    {
      "text": "Ben Wasserman, Derek Prate, Bryce Purnell, Alex Muse, Kaitlyn Abdo, Kendra Day, and LouAnne Boyd. 2019. vrSensory: Designing Inclusive Virtual Games with Neurodiverse Children. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (CHI PLAY ’19 Extended Abstracts), 755–761. https://doi.org/10.1145/3341215.3356277",
      "doi": "10.1145/3341215.3356277"
    },
    {
      "text": "Susan W. White, Angela Scarpa, Caitlin M. Conner, Brenna B. Maddox, and Saray Bonete. 2015. Evaluating Change in Social Skills in High-Functioning Adults With Autism Spectrum Disorder Using a Laboratory-Based Observational Measure. Focus on Autism and Other Developmental Disabilities 30, 1: 3–12. https://doi.org/10.1177/1088357614539836",
      "doi": ""
    },
    {
      "text": "Rua M. Williams and LouAnne E. Boyd. 2019. Prefigurative Politics and Passionate Witnessing. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS ’19, 262–266. https://doi.org/10.1145/3308561.3355617",
      "doi": "10.1145/3308561.3355617"
    },
    {
      "text": "Rua M. Williams and Juan E. Gilbert. 2019. “Nothing about us without us”: Transforming participatory research and ethics in human systems engineering. In Advancing Diversity Inclusion and Social Justice Through Human Systems Engineering, Rod Roscoe and Erin Chiou (eds.). Taylor & Francis Group.",
      "doi": ""
    },
    {
      "text": "Rua M. Williams and Juan E. Gilbert. 2019. Cyborg Perspectives on Computing Research Reform. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI EA ’19, 1–11. https://doi.org/10.1145/3290607.3310421",
      "doi": "10.1145/3290607.3310421"
    },
    {
      "text": "Rua M. Williams and Juan E. Gilbert. 2020. Perseverations of the academy: A survey of wearable technologies applied to autism intervention. International Journal of Human-Computer Studies 143: 102485. https://doi.org/10.1016/j.ijhcs.2020.102485",
      "doi": ""
    },
    {
      "text": "Rua M. Williams, Kathryn E. Ringland, Amelia Gibson, Mahender Mandala, Arne Maibaum, and Tiago Guerreiro. 2021. Articulations toward a Crip HCI. Interactions 28, 28–37.",
      "doi": "10.1145/3458453"
    },
    {
      "text": "Rua M. Williams, Simone Smarr, Diandra Prioleau, and Juan E. Gilbert. 2021. Oh No, Not Another Trolley! On the Need for a Co-Liberative Consciousness in CS Pedagogy. IEEE Transactions on Technology and Society: 1–1. https://doi.org/10.1109/TTS.2021.3084913",
      "doi": ""
    },
    {
      "text": "Rua Mae Williams. 2019. Metaeugenics and Metaresistance: from manufacturing the ‘includeable body’ to walking away from the broom closet. Canadian Journal of Children's Rights / Revue canadienne des droits des enfants 6, 1: 60–77. https://doi.org/10.22215/cjcr.v6i1.1976",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Krzysztof Z. Gajos, Shaun K. Kane, and Gregg C. Vanderheiden. 2018. Ability-based design. Communications of the ACM 61, 6: 62–71. https://doi.org/10.1145/3148051",
      "doi": "10.1145/3148051"
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles and Examples. ACM Transactions on Accessible Computing 3, 3: 9:1-9:27. https://doi.org/10.1145/1952383.1952384",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Anon Ymous, Os Keyes, Rua M Williams, Judith Good, Eva Hornecker, and Cynthia L Bennett. 2020. “I am just terrified of my future”-Epistemic Violence in Disability Related Technology Research. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, 1–16. https://doi.org/10.1145/3334480.3381828",
      "doi": "10.1145/3334480.3381828"
    }
  ]
}