{
  "doi": "10.1145/3544548.3580831",
  "title": "Data Practice for a Politics of Care: Food Assistance as a Site of Careful Data Work",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "As data plays an increasing role in civic decision making, diverse organizations are facing pressure to engage in data work. The HCI community has explored both the potential of and challenges to integrating robust data practices in mission-driven organizations. At each step – from collection, to storage, to analysis, to maintenance – these organizations need to develop tools and practices that balance internal operational needs and external community priorities. This work reports on an 11 month-long collaboration with a mission-driven hybrid organization that has designed tools and procedures for collecting data that enact an ethic of care. This caring data practice is characterized by defining success through relationships, attending to the social and cultural community context, and protecting vulnerable populations through non-collection. We share the organization’s practices, analyze how they support the organization in providing care, and offer recommendations for building caring data systems.",
  "authors": [
    {
      "name": "Ashley Boone",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526804",
      "orcid": "0000-0001-5349-8920"
    },
    {
      "name": "Carl Disalvo",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100258547",
      "orcid": "0000-0002-7344-8741"
    },
    {
      "name": "Christopher A Le Dantec",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81367592039/rel-imgonly/le_dantec_-_light_-_small.jpg",
      "acmid": "81367592039",
      "orcid": "0000-0001-8338-4852"
    }
  ],
  "references": [
    {
      "text": "Deborah Agostino and Michela Arnaboldi. 2017. Rational and ritualistic use of key performance indicators in hybrid organizations. Public money & management 37, 6 (2017), 409–416.",
      "doi": ""
    },
    {
      "text": "Julie Battilana and Silvia Dorado. 2010. Building sustainable hybrid organizations: The case of commercial microfinance organizations. Academy of management Journal 53, 6 (2010), 1419–1440.",
      "doi": ""
    },
    {
      "text": "Lehn M. Benjamin, Amy Voida, and Chris Bopp. 2018. Policy fields, data systems, and the performance of nonprofit human service organizations. Human Service Organizations: Management, Leadership & Governance 42, 2 (March 2018), 185–204. https://doi.org/10.1080/23303131.2017.1422072",
      "doi": ""
    },
    {
      "text": "Karthik S Bhat and Neha Kumar. 2020. Sociocultural dimensions of tracking health and taking care. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24.",
      "doi": "10.1145/3415200"
    },
    {
      "text": "Kirsten Boehner and Carl DiSalvo. 2016. Data, Design and Civics: An Exploratory Study of Civic Tech. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 2970–2981. https://doi.org/10.1145/2858036.2858326",
      "doi": "10.1145/2858036.2858326"
    },
    {
      "text": "Chris Bopp, Ellie Harmon, and Amy Voida. 2017. Disempowered by Data: Nonprofits, Social Enterprises, and the Consequences of Data-Driven Work. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 3608–3619. https://doi.org/10.1145/3025453.3025694",
      "doi": "10.1145/3025453.3025694"
    },
    {
      "text": "Vani K Borooah and Martin Paldam. 2007. Why is the world short of democracy?: A cross-country analysis of barriers to representative government. European Journal of Political Economy 23, 3 (2007), 582–604.",
      "doi": ""
    },
    {
      "text": "Geoffrey C Bowker. 2005. Memory practices in the sciences. Vol. 205. Mit Press Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Alex Bowyer, Rob Wilson, Stuart Wheater, Matthew Snape, and Kyle Montague. 2019. Human-Data Interaction in the Context of Care: Co-designing Family Civic Data Interfaces and Practices. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–6. https://doi.org/10.1145/3290607.3312998",
      "doi": "10.1145/3290607.3312998"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Ross C Brownson, James G Gurney, and Garland H Land. 1999. Evidence-based decision making in public health. Journal of Public Health Management and Practice (1999), 86–97.",
      "doi": ""
    },
    {
      "text": "Fabienne Brugère and Joan C Tronto. 2019. Care Ethics: The Introduction of Care as a Political Category. Peeters.",
      "doi": ""
    },
    {
      "text": "Andreas Chatzidakis, Jamie Hakim, Jo Litter, Catherine Rottenberg, 2020. The care manifesto: The politics of interdependence. Verso Books.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Morgan Currie, Britt S Paris, Irene Pasquetto, and Jennifer Pierre. 2016. The conundrum of police officer-involved homicides: Counter-data in Los Angeles County. Big Data & Society 3, 2 (Dec. 2016), 205395171666356. https://doi.org/10.1177/2053951716663566",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2011. Matters of care in technoscience: Assembling neglected things. Social Studies of Science 41, 1 (Feb. 2011), 85–106. https://doi.org/10.1177/0306312710380301",
      "doi": ""
    },
    {
      "text": "Luigi De Russis, Neha Kumar, and Akhil Mathur. 2020. Data4Good: Designing for Diversity and Development. In Proceedings of the International Conference on Advanced Visual Interfaces. 1–2.",
      "doi": "10.1145/3399715.3400864"
    },
    {
      "text": "Alain Desrosières. 1998. The politics of large numbers: A history of statistical reasoning. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Catherine D’ignazio and Lauren F Klein. 2020. Data feminism. MIT press.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt, Alex Jiahong Lu, Aarti Israni, Ruchita Lodha, Savana Brewer, Tiera S Robinson, Angela Brown Wilson, and Earnest Wheeler. 2022. The Village: Infrastructuring Community-based Mentoring to Support Adults Experiencing Poverty. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3491102.3501949"
    },
    {
      "text": "Carl Disalvo. 2022. Care of The Possible. In Design ad Democratic Inquiry: Putting Experimental Civics into Practice. MIT Press.",
      "doi": ""
    },
    {
      "text": "Bob Doherty, Helen Haugh, and Fergus Lyon. 2014. Social enterprises as hybrid organizations: A review and research agenda. International journal of management reviews 16, 4 (2014), 417–436.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2014. No SQL: The shifting materialities of database technology. Computational Culture4(2014).",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Scott D Mainwaring. 2012. Ubicomp’s colonial impulse. In Proceedings of the 2012 ACM conference on ubiquitous computing. 133–142.",
      "doi": "10.1145/2370216.2370238"
    },
    {
      "text": "Robert F Durant. 1995. The democratic deficit in America. Political Science Quarterly 110, 1 (1995), 25–47.",
      "doi": ""
    },
    {
      "text": "Rosalind Edwards and Melanie Mauthner. 2002. Ethics and feminist research: Theory and practice. Ethics in qualitative research 2 (2002), 14–28.",
      "doi": ""
    },
    {
      "text": "Sarah Elwood. 2008. Grassroots groups as stakeholders in spatial data infrastructures: challenges and opportunities for local data development and sharing. International Journal of Geographical Information Science 22, 1 (Jan. 2008), 71–90. https://doi.org/10.1080/13658810701348971 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/13658810701348971.",
      "doi": "10.1080/13658810701348971"
    },
    {
      "text": "Robert M Emerson, Rachel I Fretz, and Linda L Shaw. 2011. Writing ethnographic fieldnotes. University of Chicago press.",
      "doi": ""
    },
    {
      "text": "Sheena Erete, Emily Ryou, Geoff Smith, Khristina Marie Fassett, and Sarah Duda. 2016. Storytelling with Data: Examining the Use of Data by Non-Profit Organizations. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, San Francisco California USA, 1273–1283. https://doi.org/10.1145/2818048.2820068",
      "doi": "10.1145/2818048.2820068"
    },
    {
      "text": "Sarah Fox and Christopher Le Dantec. 2014. Community Historians: Scaffolding Community Engagement through Culture and Heritage. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 785–794. https://doi.org/10.1145/2598510.2598563",
      "doi": "10.1145/2598510.2598563"
    },
    {
      "text": "Sucheta Ghoshal, Rishma Mendhekar, and Amy Bruckman. 2020. Toward a Grassroots Culture of Technology Practice. 4 (2020), 28.",
      "doi": "10.1145/3392862"
    },
    {
      "text": "Carol Gilligan. 1993. In a different voice: Psychological theory and women’s development. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Lisa Gitelman. 2013. Raw data is an oxymoron. MIT press.",
      "doi": ""
    },
    {
      "text": "Gregg Gonsalves and Amy Kapczynski. 2020. The new politics of care. Boston Review 27(2020).",
      "doi": ""
    },
    {
      "text": "Ben Green, Alejandra Caro, Matthew Conway, Robert Manduca, Tom Plagge, and Abby Miller. 2015. Mining Administrative Data to Spur Urban Revitalization. In Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, Sydney NSW Australia, 1829–1838. https://doi.org/10.1145/2783258.2788568",
      "doi": "10.1145/2783258.2788568"
    },
    {
      "text": "Ian Hacking, Tim Hacking, 1990. The taming of chance. Number 17. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Ron Haskins and Jon Baron. 2011. Building the connection between policy and evidence. Using evidence to improve social policy and practice 25 (2011).",
      "doi": ""
    },
    {
      "text": "Virginia Held 2006. The ethics of care: Personal, political, and global. Oxford University Press on Demand.",
      "doi": ""
    },
    {
      "text": "Johann Höchtl, Peter Parycek, and Ralph Schöllhammer. 2016. Big data in the policy cycle: Policy decision making in the digital era. Journal of Organizational Computing and Electronic Commerce 26, 1-2(2016), 147–169.",
      "doi": ""
    },
    {
      "text": "Jason Jay. 2013. Navigating paradox as a mechanism of change and innovation in hybrid organizations. Academy of management journal 56, 1 (2013), 137–159.",
      "doi": ""
    },
    {
      "text": "Jan-Erik Johanson and Jarmo Vakkuri. 2017. Governing hybrid organisations: Exploring diversity of institutional life. Routledge.",
      "doi": ""
    },
    {
      "text": "Ian G. Johnson, Aare Puussaar, Jennifer Manuel, and Peter Wright. 2018. Neighbourhood Data: Exploring the Role of Open Data in Locally Devolved Policymaking Processes. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 1–20. https://doi.org/10.1145/3274352",
      "doi": "10.1145/3274352"
    },
    {
      "text": "Elizabeth Kaziunas, Mark S. Ackerman, Silvia Lindtner, and Joyce M. Lee. 2017. Caring through Data: Attending to the Social and Emotional Experiences of Health Datafication. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, Portland Oregon USA, 2260–2272. https://doi.org/10.1145/2998181.2998303",
      "doi": "10.1145/2998181.2998303"
    },
    {
      "text": "Cayla Key, Fiona Browne, Nick Taylor, and Jon Rogers. 2021. Proceed with Care: Reimagining Home IoT Through a Care Perspective. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–15. https://doi.org/10.1145/3411764.3445602",
      "doi": "10.1145/3411764.3445602"
    },
    {
      "text": "Linda M. Lampkin and Elizabeth T. Boris. 2002. Nonprofit Organization Data: What we Have and What we Need. American Behavioral Scientist 45, 11 (July 2002), 1675–1715. https://doi.org/10.1177/0002764202045011005",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2004. Why has critique run out of steam? From matters of fact to matters of concern. Critical inquiry 30, 2 (2004), 225–248.",
      "doi": ""
    },
    {
      "text": "Siân E. Lindley, Anja Thieme, Alex S. Taylor, Vasilis Vlachokyriakos, Tim Regan, and David Sweeney. 2017. Surfacing Small Worlds through Data-In-Place. Computer Supported Cooperative Work (CSCW) 26, 1-2 (April 2017), 135–163. https://doi.org/10.1007/s10606-017-9263-3",
      "doi": "10.1007/s10606-017-9263-3"
    },
    {
      "text": "Sara Miller Llana. 2006. Global stopgap for US nurse deficit. Christian Science Monitor 98, 68 (2006), 2–4.",
      "doi": ""
    },
    {
      "text": "Manissa M. Maharawal and Erin McElroy. 2018. The Anti-Eviction Mapping Project: Counter Mapping and Oral History toward Bay Area Housing Justice. Annals of the American Association of Geographers 108, 2 (March 2018), 380–389. https://doi.org/10.1080/24694452.2017.1365583",
      "doi": ""
    },
    {
      "text": "Amanda Meng, Carl DiSalvo, and Ellen Zegura. 2019. Collaborative Data Work Towards a Caring Democracy. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2019), 1–22.",
      "doi": "10.1145/3359144"
    },
    {
      "text": "Cecelia Merkel, Umer Farooq, Lu Xiao, Craig Ganoe, Mary Beth Rosson, and John Carroll. 2007. Managing technology use and learning in nonprofit community organizations: Methodological challenges and opportunities. 8. https://doi.org/10.1145/1234772.1234783",
      "doi": "10.1145/1234772.1234783"
    },
    {
      "text": "Annemarie Mol. 2008. The logic of care: Health and the problem of patient choice. Routledge.",
      "doi": ""
    },
    {
      "text": "Annemarie Mol, Ingunn Moser, and Jeannette Pols (Eds.). 2010. Care in Practice: On Tinkering in Clinics, Homes and Farms (1 ed.). VerKörperungen/MatteRealities - Perspektiven empirischer Wissenschaftsforschung, Vol. 8. transcript Verlag, Bielefeld, Germany. https://doi.org/10.14361/transcript.9783839414477",
      "doi": ""
    },
    {
      "text": "Annemarie Mol, Ingunn Moser, and Jeannette Pols. 2015. Care in practice: On tinkering in clinics, homes and farms. Vol. 8. transcript Verlag.",
      "doi": ""
    },
    {
      "text": "Margaret Morrison. 2009. Models, measurement and computer simulation: the changing face of experimentation. Philosophical Studies 143, 1 (2009), 33–57.",
      "doi": ""
    },
    {
      "text": "Joseph S Nye Jr. 2001. Globalization’s Democratic Defecit-How to Make International Institutions More Accountable. Foreign Aff. 80(2001), 2.",
      "doi": ""
    },
    {
      "text": "Anne-Claire Pache and Filipe Santos. 2013. Embedded in hybrid contexts: How individuals in organizations respond to competing institutional logics. In Institutional logics in action, part B. Emerald Group Publishing Limited.",
      "doi": ""
    },
    {
      "text": "Anne-Claire Pache and Filipe Santos. 2013. Inside the hybrid organization: Selective coupling as a response to competing institutional logics. Academy of management journal 56, 4 (2013), 972–1001.",
      "doi": ""
    },
    {
      "text": "Firaz Peer and Carl DiSalvo. 2022. The Work of Infrastructural Bricoleurs in Building Civic Data Dashboards. Proceedings of the ACM on Human-Computer Interaction 6, CSCW1 (March 2022), 1–25. https://doi.org/10.1145/3512971",
      "doi": "10.1145/3512971"
    },
    {
      "text": "Kathleen H. Pine and Max Liboiron. 2015. The Politics of Measurement and Action. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 3147–3156. https://doi.org/10.1145/2702123.2702298",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Theodore M Porter and R MacLeod. 1996. Trust in Numbers: The Pursuit of Objectivity in Science and Public Life. ISIS-International Review Devoted to the History of Science and its Cultural Influence 87, 3 (1996), 519–520.",
      "doi": ""
    },
    {
      "text": "Adam Porton, Ashley Gromis, and Matthew Desmond. 2021. Inaccuracies in Eviction Records: Implications for Renters and Researchers. Housing Policy Debate 31, 3-5 (Sept. 2021), 377–394. https://doi.org/10.1080/10511482.2020.1748084",
      "doi": ""
    },
    {
      "text": "Sebastian Prost, Clara Crivellaro, Andy Haddon, and Rob Comber. 2018. Food Democracy in the Making: Designing with Local Food Networks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173907",
      "doi": "10.1145/3173574.3173907"
    },
    {
      "text": "Thomas Richards. 1993. The imperial archive: knowledge and the fantasy of empire. Verso.",
      "doi": ""
    },
    {
      "text": "Chris Skelcher and Steven Rathgeb Smith. 2015. Theorizing hybridity: Institutional logics, complex organizations, and actor identities: The case of nonprofits. Public administration 93, 2 (2015), 433–448.",
      "doi": ""
    },
    {
      "text": "Robert Soden and Austin Lord. 2018. Mapping silences, reconfiguring loss: Practices of damage assessment & repair in post-earthquake Nepal. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–21.",
      "doi": "10.1145/3274430"
    },
    {
      "text": "Robert Soden and Embry Owen. 2021. Dilemmas in Mutual Aid: Lessons for Crisis Informatics from an Emergent Community Response to the Pandemic. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2 (Oct. 2021), 1–19. https://doi.org/10.1145/3479862",
      "doi": "10.1145/3479862"
    },
    {
      "text": "Randy Stoecker. 2007. Research practices and needs of non-profit organizations in an urban center. J. Soc. & Soc. Welfare 34 (2007), 97.",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 2863–2872. https://doi.org/10.1145/2702123.2702558",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Austin Toombs, Laura Devendorf, Patrick Shih, Elizabeth Kaziunas, David Nemer, Helena Mentis, and Laura Forlano. 2018. Sociotechnical systems of care. In Companion of the 2018 ACM conference on computer supported cooperative work and social computing. 479–485.",
      "doi": "10.1145/3272973.3273010"
    },
    {
      "text": "Austin L Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The proper care and feeding of hackerspaces: Care ethics and cultures of making. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 629–638.",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Ahn-Ton Tran, Ashley Boone, Christopher A. Le Dantec, and Carl DiSalvo. 2022. Careful Data Tinkering.Proceedings of the ACM on Human-Computer Interaction (Nov. 2022).",
      "doi": ""
    },
    {
      "text": "Joan Tronto. 1993. Moral Boundaries: A Political Argument for an Ethic of Care. Routledge.",
      "doi": ""
    },
    {
      "text": "Joan C. Tronto. 2010. Creating Caring Institutions: Politics, Plurality, and Purpose. Ethics and Social Welfare 4, 2 (July 2010), 158–171. https://doi.org/10.1080/17496535.2010.484259",
      "doi": ""
    },
    {
      "text": "Joan C. Tronto. 2013. Caring Democracy, Markets, Equality, and Justice. New York University Press.",
      "doi": ""
    },
    {
      "text": "Joan C Tronto. 2015. Who cares?: how to reshape a democratic politics. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Janet Vertesi. 2014. Seamful spaces: Heterogeneous infrastructures in interaction. Science, Technology, & Human Values 39, 2 (2014), 264–284.",
      "doi": ""
    },
    {
      "text": "Amy Voida, Ellie Harmon, and Ban Al-Ani. 2011. Homebrew databases: complexities of everyday information management in nonprofit organizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 915–924. https://doi.org/10.1145/1978942.1979078",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "Amy Voida, Ellie Harmon, and Ban Al-Ani. 2012. Bridging between organizations and the public: volunteer coordinators’ uneasy relationship with social computing. (2012), 10.",
      "doi": "10.1145/2207676.2208341"
    },
    {
      "text": "Marisol Wong-Villacres, Cristina M Velasquez, and Neha Kumar. 2017. Social media for earthquake response: Unpacking its limitations with care. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–22.",
      "doi": "10.1145/3134747"
    },
    {
      "text": "Ellen Zegura, Carl DiSalvo, and Amanda Meng. 2018. Care and the Practice of Data Science for Social Good. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, Menlo Park and San Jose CA USA, 1–9. https://doi.org/10.1145/3209811.3209877",
      "doi": "10.1145/3209811.3209877"
    }
  ]
}