{
  "doi": "10.1145/3544548.3580639",
  "title": "Polagons: Designing and Fabricating Polarized Light Mosaics with User-Defined Color-Changing Behaviors",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Polarized light mosaics (PLMs) are color-changing structures that alter their appearance based on the orientation of incident polarized light. While a few artists have developed techniques for crafting PLMs by hand, the underlying material properties are difficult to reason about; there exist no tools to bridge the high-level design objectives with the low-level physics knowledge needed to create PLMs. In this paper, we introduce the first system for creating Polagons: machine-made PLMs crafted from cellophane with user-defined color changing behaviors. Our system includes an interface for designing and visualizing Polagons as well as a fabrication process based on laser cutting and welding that requires minimal assembly by the user. We define the design space for Polagons and demonstrate how formalizing the process for creating PLMs can enable new applications in fields such as education, data visualization, and fashion.",
  "tags": [
    "design tools",
    "fabrication",
    "optics",
    "programmable materials"
  ],
  "authors": [
    {
      "name": "Ticha Sethapakdi",
      "institution": "MIT CSAIL, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365879",
      "orcid": "0000-0002-4939-1087"
    },
    {
      "name": "Laura Huang",
      "institution": "MIT CSAIL, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780161",
      "orcid": "0000-0002-0337-4230"
    },
    {
      "name": "Vivian Hsinyueh Chan",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700834",
      "orcid": "0000-0001-5547-6143"
    },
    {
      "name": "Lung-Pan Cheng",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-81470651683/rel-imgonly/32956970-44d4-41fa-95c3-df5faf94a414_1_201_a.jpeg",
      "acmid": "81470651683",
      "orcid": "0000-0002-7712-8622"
    },
    {
      "name": "Fernando Fuzinatto Dall'Agnol",
      "institution": "Exact Sciences and Education, Federal University of Santa Catarina, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782152",
      "orcid": "0000-0003-3551-3466"
    },
    {
      "name": "Mackenzie Leake",
      "institution": "MIT CSAIL, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658694029",
      "orcid": "0000-0002-8070-4918"
    },
    {
      "name": "Stefanie Mueller",
      "institution": "MIT CSAIL, United States",
      "img": "/do/10.1145/contrib-81548921556/rel-imgonly/81548921556.jpg",
      "acmid": "81548921556",
      "orcid": "0000-0001-7743-7807"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Color matching functions.",
      "doi": ""
    },
    {
      "text": "Lea Albaugh, James McCann, Lining Yao, and Scott E. Hudson. 2021. Enabling Personal Computational Handweaving with a Low-Cost Jacquard Loom. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 497, 10 pages. https://doi.org/10.1145/3411764.3445750",
      "doi": "10.1145/3411764.3445750"
    },
    {
      "text": "Ray Asahina, Takashi Nomoto, Takatoshi Yoshida, and Yoshihiro Watanabe. 2021. Realistic 3D Swept-Volume Display with Hidden-Surface Removal Using Physical Materials. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). 113–121. https://doi.org/10.1109/VR50410.2021.00032",
      "doi": ""
    },
    {
      "text": "Bernd Bickel, Paolo Cignoni, Luigi Malomo, and Nico Pietroni. 2018. State of the Art on Stylized Fabrication. Computer Graphics Forum 37 (2018). http://vcg.isti.cnr.it/Publications/2018/BCMP18",
      "doi": ""
    },
    {
      "text": "Susan Cousins Breen. 2021. The Art of Polage. https://www.swarthmore.edu/bulletin/archive/wp/july-2008_the-art-of-polage.html",
      "doi": ""
    },
    {
      "text": "Eric Brockmeyer, Ivan Poupyrev, and Scott Hudson. 2013. PAPILLON: Designing Curved Display Surfaces with Printed Optics. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 457–462. https://doi.org/10.1145/2501988.2502027",
      "doi": "10.1145/2501988.2502027"
    },
    {
      "text": "Mayo Clinic. 2021. U.S. coronavirus map: What do the trends mean for you?https://www.mayoclinic.org/coronavirus-covid-19/map",
      "doi": ""
    },
    {
      "text": "Austine Wood Comarow. 2021. Austine Studios. https://www.austine.com/",
      "doi": ""
    },
    {
      "text": "Fernando Fuzinatto Dall’Agnol and Daniel Den Engelsen. 2012. Colors from polarizers and birefringent films. Revista Brasileira de Ensino de Fisica(2012). http://www.scielo.br/scielo.php?script=sci_arttext&pid=S1806-11172012000200005&nrm=iso",
      "doi": ""
    },
    {
      "text": "SJ Edwards and AJ Langley. 1981. On producing colours using birefringence property of transparent, colourless stretched cellophane. Leonardo (1981), 187–190.",
      "doi": ""
    },
    {
      "text": "Jonas Frich, Lindsay MacDonald Vermeulen, Christian Remy, Michael Mose Biskjaer, and Peter Dalsgaard. 2019. Mapping the landscape of creativity support tools in HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3290605.3300619"
    },
    {
      "text": "Akash Garg, Andrew O Sageman-Furnas, Bailin Deng, Yonghao Yue, Eitan Grinspun, Mark Pauly, and Max Wardetzky. 2014. Wire mesh design. ACM Transactions on Graphics 33, 4 (2014).",
      "doi": "10.1145/2601097.2601106"
    },
    {
      "text": "Arjan Gijsenij, Theo Gevers, and Joost Van De Weijer. 2011. Computational color constancy: Survey and experiments. IEEE transactions on image processing 20, 9 (2011), 2475–2489.",
      "doi": ""
    },
    {
      "text": "MRSEC Education Group. 2021. Creating Art with Polarized Light. https://education.mrsec.wisc.edu/creating-art-polarized-light/",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Lea Albaugh, Ticha Sethapakadi, Jessica Hodgins, Scott E Hudson, James McCann, and Jennifer Mankoff. 2019. KnitPicking textures: Programming and modifying complex knitted textures for machine and hand knitting. In Proceedings of the 32nd annual ACM symposium on user interface software and technology. 5–16.",
      "doi": "10.1145/3332165.3347886"
    },
    {
      "text": "Melody Horn, Amy Traylor, and Leah Buechley. 2022. Slabforge: Design Software for Slab-Based Ceramics. In CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": ""
    },
    {
      "text": "Yuhua Jin, Isabel Qamar, Michael Wessely, Aradhana Adhikari, Katarina Bulovic, Parinya Punpongsanon, and Stefanie Mueller. 2019. Photo-Chromeleon: Re-Programmable Multi-Color Textures Using Photochromic Dyes. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 701–712. https://doi.org/10.1145/3332165.3347905",
      "doi": "10.1145/3332165.3347905"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Manisha Mohan, Chris Schmandt, Joseph A. Paradiso, and Katia Vega. 2016. ChromoSkin: Towards Interactive Cosmetics Using Thermochromic Pigments. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 3703–3706. https://doi.org/10.1145/2851581.2890270",
      "doi": "10.1145/2851581.2890270"
    },
    {
      "text": "Yuki Katsumata, Wataru Yamada, and Hiroyuki Manabe. 2019. Optical See-Through Head-Mounted Display with Deep Depth of Field Using Pinhole Polarizing Plates. In The Adjunct Publication of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, 102–104.",
      "doi": ""
    },
    {
      "text": "Rubaiat Habib Kazi, Kien Chuan Chua, Shengdong Zhao, Richard Davis, and Kok-Lim Low. 2011. SandCanvas: A Multi-Touch Art Medium Inspired by Sand Animation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 1283–1292. https://doi.org/10.1145/1978942.1979133",
      "doi": "10.1145/1978942.1979133"
    },
    {
      "text": "Sawa Korogi, Takuya Kitade, and Wataru Yamada. 2020. Janus Screen: A Screen with Switchable Projection Surfaces Using Polarizers. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology(Virtual Event, USA) (UIST ’20 Adjunct). Association for Computing Machinery, New York, NY, USA, 123–125. https://doi.org/10.1145/3379350.3416144",
      "doi": "10.1145/3379350.3416144"
    },
    {
      "text": "Mackenzie Leake, Gilbert Bernstein, Abe Davis, and Maneesh Agrawala. 2021. A mathematical foundation for foundation paper pieceable quilts.ACM Trans. Graph. 40, 4 (2021), 65–1.",
      "doi": "10.1145/3450626.3459853"
    },
    {
      "text": "Rong-Hao Liang, Chao Shen, Yu-Chien Chan, Guan-Ting Chou, Liwei Chan, De-Nian Yang, Mike Y. Chen, and Bing-Yu Chen. 2015. WonderLens: Optical Lenses and Mirrors for Tangible Interactions on Printed Paper. Association for Computing Machinery, New York, NY, USA, 1281–1284. https://doi.org/10.1145/2702123.2702434",
      "doi": "10.1145/2702123.2702434"
    },
    {
      "text": "Bruce Lindbloom. 2021. XYZ to RGB: Bruce Lindbloom. http://www.brucelindbloom.com/index.html?Eqn_XYZ_to_RGB.html",
      "doi": ""
    },
    {
      "text": "Hao Liu, Xiao-Teng Zhang, Xiao-Ming Fu, Zhi-Chao Dong, and Ligang Liu. 2019. Computational Peeling Art Design. ACM Trans. Graph. 38, 4, Article 64 (July 2019), 12 pages. https://doi.org/10.1145/3306346.3323000",
      "doi": "10.1145/3306346.3323000"
    },
    {
      "text": "Xuan Luo, Jason Lawrence, and Steven M. Seitz. 2017. Pepper’s Cone: An Inexpensive Do-It-Yourself 3D Display. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 623–633. https://doi.org/10.1145/3126594.3126602",
      "doi": "10.1145/3126594.3126602"
    },
    {
      "text": "James Mann. 2005. Austine Wood Comarow: Paintings in Polarized Light. Wasabi Publishing.",
      "doi": ""
    },
    {
      "text": "James McCann, Lea Albaugh, Vidya Narayanan, April Grow, Wojciech Matusik, Jennifer Mankoff, and Jessica Hodgins. 2016. A compiler for 3D machine knitting. ACM Transactions on Graphics (TOG) 35, 4 (2016), 1–11.",
      "doi": "10.1145/2897824.2925940"
    },
    {
      "text": "Leo Miyashita, Kota Ishihara, Yoshihiro Watanabe, and Masatoshi Ishikawa. 2016. ZoeMatrope: A System for Physical Material Design. ACM Trans. Graph. 35, 4, Article 66 (July 2016), 11 pages. https://doi.org/10.1145/2897824.2925925",
      "doi": "10.1145/2897824.2925925"
    },
    {
      "text": "BA Morris. 2017. 4-Commonly Used Resins and Substrates in Flexible Packaging. The Science and Technology of Flexible Packaging. Oxford: William Andrew Publishing (2017), 69–119.",
      "doi": ""
    },
    {
      "text": "Keith Muscutt. 1978. Projected Kinetic Displays and Photomicrographs Based on the Use of Polarized Light. Leonardo (1978). http://www.jstor.org/stable/1574003",
      "doi": ""
    },
    {
      "text": "N.M. Neves, A.S. Pouzada, J.H.D. Voerman, and P.C. Powell. 1998. Polymer engineering and science 38, 10 (1998), 1770–1777. https://doi.org/10.1002/pen.10347",
      "doi": ""
    },
    {
      "text": "Roshan Lalintha Peiris and Suranga Nanayakkara. 2014. PaperPixels: A Toolkit to Create Paper-Based Displays. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (Sydney, New South Wales, Australia) (OzCHI ’14). Association for Computing Machinery, New York, NY, USA, 498–504. https://doi.org/10.1145/2686612.2686691",
      "doi": "10.1145/2686612.2686691"
    },
    {
      "text": "Roshan Lalintha Peiris, Mili John Tharakan, Adrian David Cheok, and Owen Noel Newton. 2011. AmbiKraf: A Ubiquitous Non-Emissive Color Changing Fabric Display. In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (Tampere, Finland) (MindTrek ’11). Association for Computing Machinery, New York, NY, USA, 320–322. https://doi.org/10.1145/2181037.2181096",
      "doi": "10.1145/2181037.2181096"
    },
    {
      "text": "Thiadmer Riemersma. 2019. Colour metric. https://www.compuphase.com/cmetric.htm",
      "doi": ""
    },
    {
      "text": "Alec Rivers, Andrew Adams, and Frédo Durand. 2012. Sculpting by numbers. ACM Transactions on Graphics (TOG) 31, 6 (2012), 1–7.",
      "doi": "10.1145/2185520.2185584"
    },
    {
      "text": "Masato Sasaki, Takashi Nagamatsu, and Kentaro Takemura. 2019. Cross-Ratio Based Gaze Estimation for Multiple Displays Using a Polarization Camera. In The Adjunct Publication of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1–3. https://doi.org/10.1145/3332167.3357095",
      "doi": "10.1145/3332167.3357095"
    },
    {
      "text": "Toshiki Sato, Haruko Mamiya, Hideki Koike, and Kentaro Fukuchi. 2009. PhotoelasticTouch: Transparent Rubbery Tangible Interface Using an LCD and Photoelasticity. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (Victoria, BC, Canada) (UIST ’09). Association for Computing Machinery, New York, NY, USA, 43–50. https://doi.org/10.1145/1622176.1622185",
      "doi": "10.1145/1622176.1622185"
    },
    {
      "text": "Nik Semenoff. 1984. Photographic Images and Optical Effects Using Birefringent Materials. Leonardo 17, 3 (1984), 180–184.",
      "doi": ""
    },
    {
      "text": "Maria Shugrina, Jingwan Lu, and Stephen Diverdi. 2017. Playful Palette: An Interactive Parametric Color Mixer for Artists. ACM Trans. Graph. 36, 4, Article 61 (jul 2017), 10 pages. https://doi.org/10.1145/3072959.3073690",
      "doi": "10.1145/3072959.3073690"
    },
    {
      "text": "Manlin Song, Chenyu Jia, and Katia Vega. 2018. Eunoia: Dynamically Control Thermochromic Displays for Animating Patterns on Fabrics(UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 255–258. https://doi.org/10.1145/3267305.3267557",
      "doi": "10.1145/3267305.3267557"
    },
    {
      "text": "Manlin Song and Katia Vega. 2018. HeartMe: Thermochromic Display as An Expression of Heart Health. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 311–314. https://doi.org/10.1145/3197391.3205393",
      "doi": "10.1145/3197391.3205393"
    },
    {
      "text": "Zhao Tian, Charles J. Carver, Qijia Shao, Monika Roznere, Alberto Quattrini Li, and Xia Zhou. 2020. PolarTag: Invisible Data with Light Polarization. In Proceedings of the 21st International Workshop on Mobile Computing Systems and Applications (Austin, TX, USA) (HotMobile ’20). Association for Computing Machinery, New York, NY, USA, 74–79. https://doi.org/10.1145/3376897.3377854",
      "doi": "10.1145/3376897.3377854"
    },
    {
      "text": "Cesar Torres, Jessica Chang, Advaita Patel, and Eric Paulos. 2019. Phosphenes: Crafting Resistive Heaters within Thermoreactive Composites. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 907–919. https://doi.org/10.1145/3322276.3322375",
      "doi": "10.1145/3322276.3322375"
    },
    {
      "text": "Cesar Torres, Wilmot Li, and Eric Paulos. 2016. ProxyPrint: Supporting Crafting Practice through Physical Computational Proxies. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). Association for Computing Machinery, New York, NY, USA, 158–169. https://doi.org/10.1145/2901790.2901828",
      "doi": "10.1145/2901790.2901828"
    },
    {
      "text": "Cesar Torres, Jasper O’Leary, Molly Nicholas, and Eric Paulos. 2017. Illumination Aesthetics: Light as a Creative Material within Computational Design. Association for Computing Machinery, New York, NY, USA, 6111–6122. https://doi.org/10.1145/3025453.3025466",
      "doi": "10.1145/3025453.3025466"
    },
    {
      "text": "Michael Wessely, Yuhua Jin, Cattalyya Nuengsigkapian, Aleksei Kashapov, Isabel P. S. Qamar, Dzmitry Tsetserukou, and Stefanie Mueller. 2021. ChromoUpdate: Fast Design Iteration of Photochromic Color Textures Using Grayscale Previews and Local Color Updates. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 666, 13 pages. https://doi.org/10.1145/3411764.3445391",
      "doi": "10.1145/3411764.3445391"
    },
    {
      "text": "Rundong Wu, Joy Xiaoji Zhang, Jonathan Leaf, Xinru Hua, Ante Qu, Claire Harvey, Emily Holtzman, Joy Ko, Brooks Hagan, Doug L James, 2020. Weavecraft: an interactive design and simulation tool for 3D weaving.ACM Trans. Graph. 39, 6 (2020), 210–1.",
      "doi": "10.1145/3414685.3417865"
    },
    {
      "text": "Wataru Yamada, Hiroyuki Manabe, Daizo Ikeda, and Jun Rekimoto. 2019. VARiable HMD: Optical See-Through HMD for AR and VR. In The Adjunct Publication of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 131–133. https://doi.org/10.1145/3332167.3356896",
      "doi": "10.1145/3332167.3356896"
    },
    {
      "text": "Takatoshi Yoshida, Yoshihiro Watanabe, and Masatoshi Ishikawa. 2016. Phyxel: Realistic Display Using Physical Objects with High-Speed Spatially Pixelated Lighting. In ACM SIGGRAPH 2016 Emerging Technologies (Anaheim, California) (SIGGRAPH ’16). Association for Computing Machinery, New York, NY, USA, Article 18, 1 pages. https://doi.org/10.1145/2929464.2929476",
      "doi": "10.1145/2929464.2929476"
    },
    {
      "text": "Jiani Zeng, Honghao Deng, Yunyi Zhu, Michael Wessely, Axel Kilian, and Stefanie. Mueller. 2021. Lenticular Objects: 3D Printed Objects with Lenticular Lens Surfaces that Can Change their Appearance Depending on the Viewpoint.. In Proceedings of the 33th Annual ACM Symposium on User Interface Software and Technology(UIST ’21). Association for Computing Machinery, New York, NY, USA, (to appear).",
      "doi": "10.1145/3472749.3474815"
    }
  ]
}