{
  "doi": "10.1145/3544548.3581378",
  "title": "“I Would Like to Design”: Black Girls Analyzing and Ideating Fair and Accountable AI",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Artificial intelligence (AI) literacy is especially important for those who may not be well-represented in technology design. We worked with ten Black girls in fifth and sixth grade from a predominantly Black school to understand their perceptions around fair and accountable AI and how they can have an empowered role in the creation of AI. Thematic analysis of discussions and activity artifacts from a summer camp and after-school session revealed a number of findings around how Black girls: perceive AI, primarily consider fairness as niceness and equality (but may need support considering other notions, such as equity), consider accountability, and envision a just future. We also discuss how the learners can be positioned as decision-making designers in creating AI technology, as well as how AI literacy learning experiences can be empowering.",
  "tags": [
    "Black girls",
    "design",
    "artificial intelligence",
    "AI literacy",
    "AI ethics"
  ],
  "authors": [
    {
      "name": "Jaemarie Solyst",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659510828",
      "orcid": "0000-0002-0549-0454"
    },
    {
      "name": "Shixian Xie",
      "institution": "Integrated Innovation Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660740783",
      "orcid": "0000-0002-8438-9281"
    },
    {
      "name": "Ellia Yang",
      "institution": "School of Computer Science, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778321",
      "orcid": "0000-0001-7452-4200"
    },
    {
      "name": "Angela E.B. Stewart",
      "institution": "Department of Informatics and Networked Systems, Learning Research and Development Center, University of Pittsburgh, United States",
      "img": "/do/10.1145/contrib-99659310904/rel-imgonly/99659310904.jpg",
      "acmid": "99659310904",
      "orcid": "0000-0002-6004-9266"
    },
    {
      "name": "Motahhare Eslami",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959132657",
      "orcid": "0000-0002-1499-3045"
    },
    {
      "name": "Jessica Hammer",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658650866",
      "orcid": "0000-0003-4102-2575"
    },
    {
      "name": "Amy Ogan",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583567",
      "orcid": "0000-0003-2671-6149"
    }
  ],
  "references": [
    {
      "text": "Safinah Ali, Blakeley H Payne, Randi Williams, Hae Won Park, and Cynthia Breazeal. 2019. Constructionism, ethics, and creativity: Developing primary and middle school artificial intelligence education. In International workshop on education in artificial intelligence k-12 (eduai’19). 1–4.",
      "doi": ""
    },
    {
      "text": "Louise Amoore. 2020. Why ‘Ditch the algorithm’is the future of political protest. The Guardian 19(2020).",
      "doi": ""
    },
    {
      "text": "Joshua Asplund, Motahhare Eslami, Hari Sundaram, Christian Sandvig, and Karrie Karahalios. 2020. Auditing race and gender discrimination in online housing markets. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. 24–35.",
      "doi": ""
    },
    {
      "text": "Computer Science Teachers Association. 2017. CS Standards. Standards (2017).",
      "doi": ""
    },
    {
      "text": "Joan Palmiter Bajorek. 2019. Voice recognition still has significant race and gender biases. Harvard Business Review 10 (2019).",
      "doi": ""
    },
    {
      "text": "Nicolas Baumard, Olivier Mascaro, and Coralie Chevallier. 2012. Preschoolers are able to take merit into account when distributing goods.Developmental psychology 48, 2 (2012), 492.",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1999. Contextual design. interactions 6, 1 (1999), 32–42.",
      "doi": "10.1145/291224.291229"
    },
    {
      "text": "Peter R Blake and Katherine McAuliffe. 2011. “I had so much it didn’t seem fair”: Eight-year-olds reject two forms of inequity. Cognition 120, 2 (2011), 215–224.",
      "doi": ""
    },
    {
      "text": "Peter R Blake, Katherine McAuliffe, and Felix Warneken. 2014. The developmental origins of fairness: The knowledge–behavior gap. Trends in cognitive sciences 18, 11 (2014), 559–561.",
      "doi": ""
    },
    {
      "text": "Eduardo Bonilla-Silva. 2006. Racism without racists: Color-blind racism and the persistence of racial inequality in the United States. Rowman & Littlefield Publishers.",
      "doi": ""
    },
    {
      "text": "Engin Bozdag. 2013. Bias in algorithmic filtering and personalization. Ethics and information technology 15, 3 (2013), 209–227.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. PMLR, 77–91.",
      "doi": ""
    },
    {
      "text": "Sylvia Celedón-Pattichis, Lunney Lisa Borden, Stephen J Pape, Douglas H Clements, Susan A Peters, Joshua R Males, Olive Chapman, and Jacqueline Leonard. 2018. Asset-based approaches to equitable mathematics education research and practice. Journal for Research in Mathematics Education 49, 4 (2018), 373–389.",
      "doi": ""
    },
    {
      "text": "Alexandra Chouldechova, Diana Benavides-Prado, Oleksandr Fialko, and Rhema Vaithianathan. 2018. A case study of algorithm-assisted decision making in child maltreatment hotline screening decisions. In Conference on Fairness, Accountability and Transparency. PMLR, 134–148.",
      "doi": ""
    },
    {
      "text": "Jazmine Christen. 2018. Devaluation of Feminized Work. (2018).",
      "doi": ""
    },
    {
      "text": "Sean T Coleman and Julius Davis. 2020. Using asset-based pedagogy to facilitate STEM learning, engagement, and motivation for Black middle school boys. Journal of African American Males in Education (JAAME) 11, 2(2020), 76–94.",
      "doi": ""
    },
    {
      "text": "Juliet M Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative sociology 13, 1 (1990), 3–21.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2018. Design justice: Towards an intersectional feminist framework for design theory and practice. Proceedings of the Design Research Society(2018).",
      "doi": ""
    },
    {
      "text": "Tim Dare and Eileen Gambrill. 2017. Ethical analysis: Predictive risk models at call screening for Allegheny County. Alleghany County Analytics(2017).",
      "doi": ""
    },
    {
      "text": "Jeffrey Dastin. 2018. Amazon scraps secret AI recruiting tool that showed bias against women. In Ethics of Data and Analytics. Auerbach Publications, 296–299.",
      "doi": ""
    },
    {
      "text": "Daniella DiPaola, Blakeley H Payne, and Cynthia Breazeal. 2020. Decoding design agendas: an ethical design activity for middle school students. In Proceedings of the Interaction Design and Children Conference. 1–10.",
      "doi": "10.1145/3392063.3394396"
    },
    {
      "text": "Stefania Druga, Sarah T Vu, Eesh Likhith, and Tammy Qiu. 2019. Inclusive AI literacy for kids around the world. In Proceedings of FabLearn 2019. 104–111.",
      "doi": "10.1145/3311890.3311904"
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. \"Hey Google is it OK if I eat you?\": Initial Explorations in Child-Agent Interaction. Proceedings of the 2017 Conference on Interaction Design and Children (2017).",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Stefania Druga, Randi Williams, Hae Won Park, and Cynthia Breazeal. 2018. How smart are the smart toys?: children and parents’ agent interaction and intelligence attribution. Proceedings of the 17th ACM Conference on Interaction Design and Children (2018).",
      "doi": "10.1145/3202185.3202741"
    },
    {
      "text": "Yarrow Dunham, Allison Durkin, and Tom R Tyler. 2018. The development of a preference for procedural justice for self and others. Scientific reports 8, 1 (2018), 1–8.",
      "doi": ""
    },
    {
      "text": "Cynthia Dwork, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Richard Zemel. 2012. Fairness through awareness. In Proceedings of the 3rd innovations in theoretical computer science conference. 214–226.",
      "doi": "10.1145/2090236.2090255"
    },
    {
      "text": "Rashmi Dyal-Chand. 2021. Autocorrecting for Whiteness. BUL Rev. 101(2021), 191.",
      "doi": ""
    },
    {
      "text": "Aaliyah El-Amin, Scott Seider, Daren Graves, Jalene Tamerat, Shelby Clark, Madora Soutter, Jamie Johannsen, and Saira Malhotra. 2017. Critical consciousness: A key to student achievement. Phi Delta Kappan 98, 5 (2017), 18–23.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Kristen Vaccaro, Karrie Karahalios, and Kevin Hamilton. 2017. “Be careful; things can be worse than they appear”: Understanding Biased Algorithms and Users’ Behavior around Them in Rating Platforms. In Proceedings of the international AAAI conference on web and social media, Vol. 11. 62–71.",
      "doi": ""
    },
    {
      "text": "Virginia Eubanks. 2018. Automating inequality: How high-tech tools profile, police, and punish the poor. St. Martin’s Press.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Jayne Everson, F Megumi Kivuva, and Amy J Ko. 2022. \" A Key to Reducing Inequities in Like, AI, is by Reducing Inequities Everywhere First\" Emerging Critical Consciousness in a Co-Constructed Secondary CS Classroom. In Proceedings of the 53rd ACM Technical Symposium on Computer Science Education V. 1. 209–215.",
      "doi": "10.1145/3478431.3499395"
    },
    {
      "text": "Jodi Forlizzi and Carl F. DiSalvo. 2006. Service robots in the domestic environment: a study of the roomba vacuum in the home. In HRI ’06.",
      "doi": ""
    },
    {
      "text": "World Economic Forum. 2020. Global gender gap report 2020. Insight Report (2020).",
      "doi": ""
    },
    {
      "text": "Paulo Freire. 2021. Education for critical consciousness. Bloomsbury Publishing.",
      "doi": ""
    },
    {
      "text": "Francisco J García-Peñalvo, Angela Marie Rees, Jenny Hughes, Ilkka Jormanainen, Tapani Toivonen, and Jens Vermeersch. 2016. A survey of resources for introducing coding into schools. In Proceedings of the Fourth International Conference on Technological Ecosystems for Enhancing Multiculturality. 19–26.",
      "doi": "10.1145/3012430.3012491"
    },
    {
      "text": "Lisa Garoutte and Kate McCarthy-Gilmore. 2014. Preparing students for community-based learning using an asset-based approach. Journal of the Scholarship of Teaching and Learning (2014), 48–61.",
      "doi": ""
    },
    {
      "text": "Geneva Gay. 2002. Preparing for culturally responsive teaching. Journal of teacher education 53, 2 (2002), 106–116.",
      "doi": ""
    },
    {
      "text": "Geneva Gay. 2018. Culturally responsive teaching: Theory, research, and practice. teachers college press.",
      "doi": ""
    },
    {
      "text": "Nina Grgic-Hlaca, Elissa M Redmiles, Krishna P Gummadi, and Adrian Weller. 2018. Human perceptions of fairness in algorithmic decision making: A case study of criminal risk prediction. In Proceedings of the 2018 World Wide Web Conference. 903–912.",
      "doi": "10.1145/3178876.3186138"
    },
    {
      "text": "Nina Grgić-Hlača, Muhammad Bilal Zafar, Krishna P Gummadi, and Adrian Weller. 2018. Beyond distributive fairness in algorithmic decision making: Feature selection for procedurally fair learning. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 32.",
      "doi": ""
    },
    {
      "text": "Patricia Grocke, Federico Rossano, and Michael Tomasello. 2015. Procedural justice in children: Preschoolers accept unequal resource distributions if the procedure provides equal opportunities. Journal of experimental child psychology 140 (2015), 197–210.",
      "doi": ""
    },
    {
      "text": "Ben Guarino. 2016. Google faulted for racial bias in image search results for black teenagers. Washington Post 6(2016), 2016.",
      "doi": ""
    },
    {
      "text": "David Hammer and Leema K Berland. 2014. Confusing claims for data: A critique of common practices for presenting qualitative research on learning. Journal of the Learning Sciences 23, 1 (2014), 37–46.",
      "doi": ""
    },
    {
      "text": "Moritz Hardt, Eric Price, and Nati Srebro. 2016. Equality of opportunity in supervised learning. Advances in neural information processing systems 29 (2016).",
      "doi": ""
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Tom Hitron, Yoav Orlev, Iddo Wald, Ariel Shamir, Hadas Erel, and Oren Zuckerman. 2019. Can children understand machine learning concepts? The effect of uncovering black boxes. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–11.",
      "doi": "10.1145/3290605.3300645"
    },
    {
      "text": "Tom Hitron, Iddo Wald, Hadas Erel, and Oren Zuckerman. 2018. Introducing children to machine learning concepts through hands-on experience. In Proceedings of the 17th ACM conference on interaction design and children. 563–568.",
      "doi": "10.1145/3202185.3210776"
    },
    {
      "text": "Andrew Gary Darwin Holmes. 2020. Researcher Positionality–A Consideration of Its Influence and Place in Qualitative Research–A New Researcher Guide.Shanlax International Journal of Education 8, 4 (2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Kenneth Holstein, Bruce M McLaren, and Vincent Aleven. 2018. Student learning benefits of a mixed-reality teacher awareness tool in AI-enhanced classrooms. In International conference on artificial intelligence in education. Springer, 154–168.",
      "doi": ""
    },
    {
      "text": "Kenneth Holstein, Jennifer Wortman Vaughan, Hal Daumé III, Miro Dudik, and Hanna Wallach. 2019. Improving fairness in machine learning systems: What do industry practitioners need?. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–16.",
      "doi": "10.1145/3290605.3300830"
    },
    {
      "text": "Elizabeth Huppert, Jason M Cowell, Yawei Cheng, Carlos Contreras-Ibáñez, Natalia Gomez-Sicard, Maria Luz Gonzalez-Gadea, David Huepe, Agustin Ibanez, Kang Lee, Randa Mahasneh, 2019. The development of children’s preferences for equality and equity across 13 individualistic and collectivist cultures. Developmental science 22, 2 (2019), e12729.",
      "doi": ""
    },
    {
      "text": "Jillian J Jordan, Katherine McAuliffe, and Felix Warneken. 2014. Development of in-group favoritism in children’s third-party punishment of selfishness. Proceedings of the National Academy of Sciences 111, 35(2014), 12710–12715.",
      "doi": ""
    },
    {
      "text": "N Joseph and Jakita O Thomas. 2020. Designing STEM Learning Environments to Support Middle School Black Girls’ Computational Algorithmic Thinking: A Possibility Model for Disrupting STEM Neoliberal Projects. In International Conference of the Learning Sciences.",
      "doi": ""
    },
    {
      "text": "K Megasari Kahn, Rani Megasari, Erna Piantari, and Enjun Junaeti. 2018. AI programming by children using snap! block programming in a developing country. (2018).",
      "doi": ""
    },
    {
      "text": "Patricia Kanngiesser and Felix Warneken. 2012. Young children consider merit when sharing resources with others. (2012).",
      "doi": ""
    },
    {
      "text": "Maria Kasinidou, Styliani Kleanthous, Kalia Orphanou, and Jahna Otterbacher. 2021. Educating Computer Science Students about Algorithmic Fairness, Accountability, Transparency and Ethics. In Proceedings of the 26th ACM Conference on Innovation and Technology in Computer Science Education V. 1. 484–490.",
      "doi": "10.1145/3430665.3456311"
    },
    {
      "text": "Styliani Kleanthous, Maria Kasinidou, Pınar Barlas, and Jahna Otterbacher. 2022. Perception of fairness in algorithmic decisions: Future developers’ perspective. Patterns 3, 1 (2022), 100380.",
      "doi": ""
    },
    {
      "text": "Lawrence Kohlberg. 1958. The development of modes of moral thinking and choice in the years 10 to 16. Ph. D. Dissertation. The University of Chicago.",
      "doi": ""
    },
    {
      "text": "Lawrence Kohlberg. 1974. Education, moral development and faith. Journal of Moral Education 4, 1 (1974), 5–16.",
      "doi": ""
    },
    {
      "text": "Matt J Kusner, Joshua Loftus, Chris Russell, and Ricardo Silva. 2017. Counterfactual fairness. Advances in neural information processing systems 30 (2017).",
      "doi": ""
    },
    {
      "text": "Gloria Ladson-Billings. 1995. Toward a theory of culturally relevant pedagogy. American educational research journal 32, 3 (1995), 465–491.",
      "doi": ""
    },
    {
      "text": "Irene Lee, Safinah Ali, Helen Zhang, Daniella DiPaola, and Cynthia Breazeal. 2021. Developing Middle School Students’ AI Literacy. In Proceedings of the 52nd ACM Technical Symposium on Computer Science Education. 191–197.",
      "doi": "10.1145/3408877.3432513"
    },
    {
      "text": "Lanna Lima, Vasco Furtado, Elizabeth Furtado, and Virgilio Almeida. 2019. Empirical analysis of bias in voice-based personal assistants. In Companion Proceedings of The 2019 World Wide Web Conference. 533–538.",
      "doi": "10.1145/3308560.3317597"
    },
    {
      "text": "Duri Long and Brian Magerko. 2020. What is AI literacy? Competencies and design considerations. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–16.",
      "doi": "10.1145/3313831.3376727"
    },
    {
      "text": "Duri Long and Brian Magerko. 2020. What is AI Literacy? Competencies and Design Considerations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376727",
      "doi": "10.1145/3313831.3376727"
    },
    {
      "text": "Francesca López. 2016. Culturally responsive pedagogies in Arizona and Latino students’ achievement. Teachers College Record 118, 5 (2016), 1–42.",
      "doi": ""
    },
    {
      "text": "Frank Marcinkowski, Kimon Kieslich, Christopher Starke, and Marco Lünich. 2020. Implications of AI (un-) fairness in higher education admissions: the effects of perceived AI (un-) fairness on exit, voice and organizational reputation. In Proceedings of the 2020 conference on fairness, accountability, and transparency. 122–130.",
      "doi": "10.1145/3351095.3372867"
    },
    {
      "text": "Katherine McAuliffe, Peter R Blake, Grace Kim, Richard W Wrangham, and Felix Warneken. 2013. Social influences on inequity aversion in children. PloS one 8, 12 (2013), e80966.",
      "doi": ""
    },
    {
      "text": "Alexander Monea. 2019. Race and computer vision. (2019).",
      "doi": ""
    },
    {
      "text": "Rolf E Muuss. 1988. Carol Gilligan’s theory of sex differences in the development of moral reasoning during adolescence. Adolescence 23, 89 (1988), 229.",
      "doi": ""
    },
    {
      "text": "Ziad Obermeyer, Brian Powers, Christine Vogeli, and Sendhil Mullainathan. 2019. Dissecting racial bias in an algorithm used to manage the health of populations. Science 366, 6464 (2019), 447–453.",
      "doi": ""
    },
    {
      "text": "Renata M O’Donnell. 2019. Challenging racist predictive policing algorithms under the equal protection clause. NYUL Rev. 94(2019), 544.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela DR Smith, Alexandra To, and Kentaro Toyama. 2020. Critical race theory for HCI. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–16.",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Markus Paulus. 2014. The early origins of human charity: Developmental changes in preschoolers’ sharing with poor and wealthy individuals. Frontiers in Psychology 5 (2014), 344.",
      "doi": ""
    },
    {
      "text": "Robin J Phelps-Ward and Crystal T Laura. 2016. Talking back in cyberspace: self-love, hair care, and counter narratives in Black adolescent girls’ YouTube vlogs. Gender and Education 28, 6 (2016), 807–820.",
      "doi": ""
    },
    {
      "text": "Jean Piaget. 1965. The stages of the intellectual development of the child. Educational psychology in context: Readings for future teachers 63, 4(1965), 98–106.",
      "doi": ""
    },
    {
      "text": "Yim Register and Amy J Ko. 2020. Learning machine learning with personal data helps stakeholders ground advocacy arguments in model mechanics. In Proceedings of the 2020 ACM Conference on International Computing Education Research. 67–78.",
      "doi": "10.1145/3372782.3406252"
    },
    {
      "text": "Michael T Rizzo, Laura Elenbaas, Shelby Cooley, and Melanie Killen. 2016. Children’s recognition of fairness and others’ welfare in a resource allocation task: Age related changes.Developmental psychology 52, 8 (2016), 1307.",
      "doi": ""
    },
    {
      "text": "Michael S Rosenwald. 2017. How millions of kids are being shaped by know-it-all voice assistants. Washington Post 2(2017).",
      "doi": ""
    },
    {
      "text": "Alan G Sanfey, James K Rilling, Jessica A Aronson, Leigh E Nystrom, and Jonathan D Cohen. 2003. The neural basis of economic decision-making in the ultimatum game. Science 300, 5626 (2003), 1755–1758.",
      "doi": ""
    },
    {
      "text": "Marco FH Schmidt, Margarita Svetlova, Jana Johe, and Michael Tomasello. 2016. Children’s developing understanding of legitimate reasons for allocating resources unequally. Cognitive Development 37(2016), 42–52.",
      "doi": ""
    },
    {
      "text": "Kimberly A Scott, Kimberly M Sheridan, and Kevin Clark. 2015. Culturally responsive computing: A theory revisited. Learning, Media and Technology 40, 4 (2015), 412–436.",
      "doi": ""
    },
    {
      "text": "Kimberly A Scott and Mary Aleta White. 2013. COMPUGIRLS’standpoint: Culturally responsive computing and its effect on girls of color. Urban Education 48, 5 (2013), 657–681.",
      "doi": ""
    },
    {
      "text": "Alex Shaw and Kristina R Olson. 2012. Children discard a resource to avoid inequity.Journal of Experimental Psychology: General 141, 2 (2012), 382.",
      "doi": ""
    },
    {
      "text": "Zoe Skinner, Stacey Brown, and Greg Walsh. 2020. Children of Color’s Perceptions of Fairness in AI: An Exploration of Equitable and Inclusive Co-Design. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382901",
      "doi": "10.1145/3334480.3382901"
    },
    {
      "text": "Jaemarie Solyst, Alexis Axon, Angela E.B. Stewart, Motahhare Eslami, and Amy Ogan. 2022. Investigating Girls’ Perspectives and Knowledge Gaps on Ethics and Fairness in Artificial Intelligence in a Lightweight Workshop. Proceedings of the 16th International Society of the Learning Sciences (ICLS) (2022), 807–814.",
      "doi": ""
    },
    {
      "text": "Jessica A Sommerville. 2018. Infants’ understanding of distributive fairness as a test case for identifying the extents and limits of infants’ sociomoral cognition and behavior. Child Development Perspectives 12, 3 (2018), 141–145.",
      "doi": ""
    },
    {
      "text": "Konstantinos Stathoulopoulos and Juan C Mateos-Garcia. 2019. Gender diversity in AI research. Available at SSRN 3428240(2019).",
      "doi": ""
    },
    {
      "text": "Ulrika Sultan, Cecilia Axell, and Jonas Hallström. 2018. Girls’ engagement in technology education: A systematic review of the literature. In 36th International Pupils’ Attitudes Towards Technology Conference Athlone Institute of Technology, Co. Westmeath, Ireland, 18th–21st June 2018. Technology Education Research Group, 231–238.",
      "doi": ""
    },
    {
      "text": "Robert H Tai, Christine Qi Liu, Adam V Maltese, and Xitao Fan. 2006. Planning early for careers in science. Science 312, 5777 (2006), 1143–1144.",
      "doi": ""
    },
    {
      "text": "David Touretzky, Christina Gardner-McCune, Fred Martin, and Deborah Seehorn. 2019. Envisioning AI for K-12: What should every child know about AI?. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. 9795–9799.",
      "doi": "10.1609/aaai.v33i01.33019795"
    },
    {
      "text": "Rhema Vaithianathan, Emily Putnam-Hornstein, Nan Jiang, Parma Nand, and Tim Maloney. 2017. Developing predictive models to support child maltreatment hotline screening decisions: Allegheny County methodology and implementation. Center for Social data Analytics(2017).",
      "doi": ""
    },
    {
      "text": "Mike Van Duuren, Barbara Dossett, and Dawn Robinson. 1998. Gauging children’s understanding of artificially intelligent objects: a presentation of “counterfactuals”. International Journal of Behavioral Development 22, 4(1998), 871–889.",
      "doi": ""
    },
    {
      "text": "Greg Walsh and Eric Wronsky. 2019. AI+ co-design: developing a novel computer-supported approach to inclusive design. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. 408–412.",
      "doi": "10.1145/3311957.3359456"
    },
    {
      "text": "Ruotong Wang, F Maxwell Harper, and Haiyi Zhu. 2020. Factors influencing perceived fairness in algorithmic decision-making: Algorithm outcomes, development procedures, and individual differences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376813"
    },
    {
      "text": "Randi Williams, Christian Vázquez Machado, Stefania Druga, Cynthia Breazeal, and Pattie Maes. 2018. \"My Doll Says It’s Ok\": A Study of Children’s Conformity to a Talking Doll. In Proceedings of the 17th ACM Conference on Interaction Design and Children (Trondheim, Norway) (IDC ’18). Association for Computing Machinery, New York, NY, USA, 625–631. https://doi.org/10.1145/3202185.3210788",
      "doi": "10.1145/3202185.3210788"
    },
    {
      "text": "Randi Williams, Hae Won Park, Lauren Oh, and Cynthia Breazeal. 2019. Popbots: Designing an artificial intelligence curriculum for early childhood education. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. 9729–9736.",
      "doi": "10.1609/aaai.v33i01.33019729"
    },
    {
      "text": "Allison Woodruff, Sarah E Fox, Steven Rousso-Schindler, and Jeffrey Warshaw. 2018. A qualitative exploration of perceptions of algorithmic fairness. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3174230"
    },
    {
      "text": "Brian Wynne. 1991. Knowledges in context. Science, Technology, & Human Values 16, 1 (1991), 111–121.",
      "doi": ""
    },
    {
      "text": "Tan Fee Yean 2016. Organizational justice: A conceptual discussion. Procedia-Social and Behavioral Sciences 219 (2016), 798–803.",
      "doi": ""
    },
    {
      "text": "Abigail Zimmermann-Niefield, Makenna Turner, Bridget Murphy, Shaun K Kane, and R Benjamin Shapiro. 2019. Youth learning machine learning through building models of athletic moves. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. 121–132.",
      "doi": "10.1145/3311927.3323139"
    }
  ]
}