{
  "doi": "10.1145/3544548.3581534",
  "title": "Engaging with Nature through Technology: A Scoping Review of HCI Research",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Technological progress has often been measured by the extent to which it shields and protects us from the harshness of nature. At the same time, it has long been recognised that our resulting disengagement from nature negatively affects our wellbeing and impedes awareness of our vital dependence on natural environments. To understand how HCI has considered the possibilities that digital technology offers for engaging with nature, we conducted a scoping review encompassing more than 20 years of HCI research on nature engagement. We compare the orientations, motivations, and methodologies of different threads within this growing body of work. We show how HCI research has enabled varied forms of direct and indirect engagement with nature, and we develop a typology of the roles proposed for technology in this work. We highlight promising and under-utilised approaches to designing for nature engagement and discuss directions for future research.",
  "authors": [
    {
      "name": "Sarah Webber",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86159053057",
      "orcid": "0000-0002-3144-9957"
    },
    {
      "name": "Ryan M. Kelly",
      "institution": "School of Computing and Information Systems, University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365229",
      "orcid": "0000-0002-8773-6656"
    },
    {
      "name": "Greg Wadley",
      "institution": "School of Computing and Information Systems, The University of Melbourne, Australia",
      "img": "/do/10.1145/contrib-81309499961/rel-imgonly/greg.jpg",
      "acmid": "81309499961",
      "orcid": "0000-0003-4230-3440"
    },
    {
      "name": "Wally Smith",
      "institution": "School of Computing & Information Systems, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324494027",
      "orcid": "0000-0002-1059-6704"
    }
  ],
  "references": [
    {
      "text": "David Abram. 1996. The Spell of the Sensuous: Perception and Language in a More-Than-Human World. Vintage Books.",
      "doi": ""
    },
    {
      "text": "Ismo Alakärppä, Elisa Jaakkola, Jani Väyrynen, and Jonna Häkkilä. 2017. Using nature elements in mobile AR for education with children. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI ’17), 1–13. https://doi.org/10.1145/3098279.3098547",
      "doi": "10.1145/3098279.3098547"
    },
    {
      "text": "** Ferran Altarriba Bertran, Oðuz “Oz” Buruk, and Juho Hamari. 2022. From-The-Wild: Towards Co-Designing For and From Nature. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (CHI EA ’22), 1–7. https://doi.org/10.1145/3491101.3519811",
      "doi": "10.1145/3491101.3519811"
    },
    {
      "text": "** Zann Anderson and Michael Jones. 2020. Rethinking the Role of a Mobile Computing in Recreational Hiking. In HCI Outdoors: Theory, Design, Methods and Applications, D. Scott McCrickard, Michael Jones and Timothy L. Stelter (eds.). Springer, 291–305.",
      "doi": ""
    },
    {
      "text": "** Riga Anggarendra and Margot Brereton. 2016. Engaging children with nature through environmental HCI. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (OzCHI ’16), 310–315. https://doi.org/10.1145/3010915.3010981",
      "doi": "10.1145/3010915.3010981"
    },
    {
      "text": "Hilary Arksey and Lisa O'Malley. 2005. Scoping studies: towards a methodological framework. International Journal of Social Research Methodology 8, 1: 19–32. https://doi.org/10.1080/1364557032000119616",
      "doi": ""
    },
    {
      "text": "** Fredrik Aspling, Jinyi Wang, and Oskar Juhlin. 2016. Plant-computer Interaction, Beauty and Dissemination. In Proceedings of the Third International Conference on Animal-Computer Interaction (ACI ’16), 5:1-5:10. https://doi.org/10.1145/2995257.2995393",
      "doi": "10.1145/2995257.2995393"
    },
    {
      "text": "Jon Back, Laia Turmo Vidal, Annika Waern, Susan Paget, and Eva-Lotta Sallnäs Pysander. 2018. Playing Close to Home: Interaction and Emerging Play in Outdoor Play Installations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–11. https://doi.org/10.1145/3173574.3173730",
      "doi": "10.1145/3173574.3173730"
    },
    {
      "text": "** Maryam Bandukda and Catherine Holloway. 2020. Audio AR to support nature connectedness in people with visual disabilities. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers (UbiComp-ISWC ’20), 204–207. https://doi.org/10.1145/3410530.3414332",
      "doi": "10.1145/3410530.3414332"
    },
    {
      "text": "** Maryam Bandukda, Aneesha Singh, Nadia Berthouze, and Catherine Holloway. 2019. Understanding Experiences of Blind Individuals in Outdoor Nature. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1–6. https://doi.org/10.1145/3290607.3313008",
      "doi": "10.1145/3290607.3313008"
    },
    {
      "text": "Patrick Barron. 2002. The Separation of Wild Animal Nature and Human Nature in Gilgamesh. Papers on Language and Literature 38, 4. Retrieved July 28, 2022 from https://www.proquest.com/docview/198501934",
      "doi": ""
    },
    {
      "text": "Ariane L. Bedimo-Rung, Andrew J. Mowen, and Deborah A. Cohen. 2005. The significance of parks to physical activity and public health: A conceptual model. American Journal of Preventive Medicine 28, 2, Supplement 2: 159–168. https://doi.org/10.1016/j.amepre.2004.10.024",
      "doi": ""
    },
    {
      "text": "** Nicola J Bidwell and David Browning. 2006. Making there: methods to uncover egocentric experience in a dialogic of natural places. In Proceedings of the 18th Australia conference on Computer-Human Interaction: Design: Activities, Artefacts and Environments (OZCHI ’06), 229–236. https://doi.org/10.1145/1228175.1228216",
      "doi": "10.1145/1228175.1228216"
    },
    {
      "text": "** Nicola J. Bidwell and David Browning. 2009. Pursuing genius loci: interaction design and natural places. Personal and Ubiquitous Computing 14, 1: 15–30. https://doi.org/10.1007/s00779-009-0217-8",
      "doi": "10.1007/s00779-009-0217-8"
    },
    {
      "text": "** Heidi R. Biggs, Jeffrey Bardzell, and Shaowen Bardzell. 2021. Watching Myself Watching Birds: Abjection, Ecological Thinking, and Posthuman Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–16. https://doi.org/10.1145/3411764.3445329",
      "doi": "10.1145/3411764.3445329"
    },
    {
      "text": "Murray Bookchin. 1982. The ecology of freedom: The emergence and dissolution of hierarchy. Cheshire Books, USA.",
      "doi": ""
    },
    {
      "text": "** Carol Boston, Tamara Clegg, Daniel Pauw, Jennifer Preece, Elizabeth Warrick, Sarah Abdellahi, Travis Christian, Kazjon Grace, Mary Lou Maher, Jacqueline Cameron, and Tom Yeh. 2017. Supporting Environmental Stewards’ Needs with Technology. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17 Companion), 151–154. https://doi.org/10.1145/3022198.3026346",
      "doi": "10.1145/3022198.3026346"
    },
    {
      "text": "Elena Brambilla, Evi Petersen, Karen Stendal, Vibeke Sundling, Tadhg E MacIntyre, and Giovanna Calogiuri. 2022. Effects of immersive virtual nature on nature connectedness: A systematic review protocol. Digital Health 8: 20552076221120324. https://doi.org/10.1177/20552076221120324",
      "doi": ""
    },
    {
      "text": "** Marina Cardoso, Elizabeth Warrick, Jennifer Golbeck, and Jennifer Preece. 2016. Motivational Impact of Facebook Posts on Environmental Communities. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (CSCW ’16 Companion), 237–240. https://doi.org/10.1145/2818052.2869089",
      "doi": "10.1145/2818052.2869089"
    },
    {
      "text": "Louise Chawla. 2009. Growing up green: Becoming an agent of care for the natural world. The Journal of Developmental Processes 4, 1: 6–23.",
      "doi": ""
    },
    {
      "text": "** Dominique Chen, Young ah Seong, Hiraku Ogura, Yuto Mitani, Naoto Sekiya, and Kiichi Moriya. 2021. Nukabot: Design of Care for Human-Microbe Relationships. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (CHI EA ’21), 1–7. https://doi.org/10.1145/3411763.3451605",
      "doi": "10.1145/3411763.3451605"
    },
    {
      "text": "** Yang Chen, Yuyu Lin, Junwu Wang, Lijuan Liu, Cheng Yao, and Fangtian Ying. 2019. IPANDA: A Playful Hybrid Product for Facilitating Children's Wildlife Conservation Education. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1–6. https://doi.org/10.1145/3290607.3312884",
      "doi": "10.1145/3290607.3312884"
    },
    {
      "text": "** Keith Cheverst, Mads Bødker, and Florian Daiber. 2020. Technology and Mastery: Exploring Design Sensitivities for Technology in Mountaineering. In HCI Outdoors: Theory, Design, Methods and Applications, D. Scott McCrickard, Michael Jones and Timothy L. Stelter (eds.). Springer, 197–211.",
      "doi": ""
    },
    {
      "text": "** Gene Chipman, Allison Druin, Dianne Beer, Jerry Alan Fails, Mona Leigh Guha, and Sante Simms. 2006. A case study of tangible flags: a collaborative technology to enhance field trips. In Proceedings of the 2006 conference on Interaction design and children (IDC ’06), 1–8. https://doi.org/10.1145/1139073.1139081",
      "doi": "10.1145/1139073.1139081"
    },
    {
      "text": "Roberto Cibin, Sarah Robinson, Nicola J. Bidwell, Conor Linehan, Laura Maye, Nadia Pantidi, and Maurizio Teli. 2021. Land, Water and Sun: Tuning into Socio-Ecological Relations in Radio Design. In Designing Interactive Systems Conference 2021 (DIS ’21), 1954–1969. https://doi.org/10.1145/3461778.3462104",
      "doi": "10.1145/3461778.3462104"
    },
    {
      "text": "** Rachel Clarke, Sara Heitlinger, Ann Light, Laura Forlano, Marcus Foth, and Carl DiSalvo. 2019. More-than-human participation: design for sustainable smart city futures. Interactions 26, 3: 60–63. https://doi.org/10.1145/3319075",
      "doi": "10.1145/3319075"
    },
    {
      "text": "Rhonda Clements. 2004. An Investigation of the Status of Outdoor Play. Contemporary Issues in Early Childhood 5, 1: 68–80. https://doi.org/10.2304/ciec.2004.5.1.10",
      "doi": ""
    },
    {
      "text": "** Karen Anne Cochrane, Lian Loke, Caitilin de Bérigny, and Andrew Campbell. 2018. Sounds in the moment: designing an interactive EEG nature soundscape for novice mindfulness meditators. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (OzCHI ’18), 298–302. https://doi.org/10.1145/3292147.3292215",
      "doi": "10.1145/3292147.3292215"
    },
    {
      "text": "** Isabel Correa and Nathan Holbert. 2021. Myco-kit: Towards a design for interspecies creative learning. In Interaction Design and Children (IDC ’21), 439–443. https://doi.org/10.1145/3459990.3465178",
      "doi": "10.1145/3459990.3465178"
    },
    {
      "text": "** Mark Cottman-Fields, Margot Brereton, and Paul Roe. 2013. Virtual birding: extending an environmental pastime into the virtual world for citizen science. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 2029–2032. https://doi.org/10.1145/2470654.2466268",
      "doi": "10.1145/2470654.2466268"
    },
    {
      "text": "** Richard Coyne. 2014. Nature vs. Smartphones. Interactions 21, 5: 24–31. https://doi.org/10.1145/2656933",
      "doi": "10.1145/2656933"
    },
    {
      "text": "** Bronwyn J. Cumbo and Ole Sejer Iversen. 2020. CCI in the wild: designing for environmental stewardship through children's nature-play. In Proceedings of the Interaction Design and Children Conference (IDC ’20), 335–348. https://doi.org/10.1145/3392063.3394398",
      "doi": "10.1145/3392063.3394398"
    },
    {
      "text": "** Bronwyn J. Cumbo and Tuck Wah Leong. 2015. Wearable audio-video recorders as a tool for investigating child play experiences in nature. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI ’15), 618–622. https://doi.org/10.1145/2838739.2838822",
      "doi": "10.1145/2838739.2838822"
    },
    {
      "text": "** Bronwyn J. Cumbo, Jeni Paay, Jesper Kjeldskov, and Brent C. Jacobs. 2014. Connecting children to nature with technology: sowing the seeds for proenvironmental behaviour. In Proceedings of the 2014 conference on Interaction design and children (IDC ’14), 189–192. https://doi.org/10.1145/2593968.2610449",
      "doi": "10.1145/2593968.2610449"
    },
    {
      "text": "** Tshering Dema, Margot Brereton, Jessica L. Cappadonna, Paul Roe, Anthony Truskinger, and Jinglan Zhang. 2017. Collaborative Exploration and Sensemaking of Big Environmental Sound Data. Computer Supported Cooperative Work (CSCW) 26, 4: 693–731. https://doi.org/10.1007/s10606-017-9286-9",
      "doi": "10.1007/s10606-017-9286-9"
    },
    {
      "text": "** Tshering Dema, Margot Brereton, Michael Esteban, Alessandro Soro, Sherub Sherub, and Paul Roe. 2020. Designing in the Network of Relations for Species Conservation: The Playful Tingtibi Community Birdhouse. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–14. https://doi.org/10.1145/3313831.3376713",
      "doi": "10.1145/3313831.3376713"
    },
    {
      "text": "** Tshering Dema, Margot Brereton, and Paul Roe. 2019. Designing Participatory Sensing with Remote Communities to Conserve Endangered Species. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 1–16. https://doi.org/10.1145/3290605.3300894",
      "doi": "10.1145/3290605.3300894"
    },
    {
      "text": "James M. Dennis and Lu B. Wenneker. 1965. Ornamentation and the organic architecture of Frank Lloyd Wright. Art Journal 25, 1: 2–14.",
      "doi": ""
    },
    {
      "text": "** Siobhán Dervan, Tony Hall, and Sarah Knight. 2008. Interaction design for kid's technology-enhanced environmental education. In Proceedings of the 7th international conference on Interaction design and children (IDC ’08), 105–108. https://doi.org/10.1145/1463689.1463732",
      "doi": "10.1145/1463689.1463732"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the Landscape of Sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’10), 1975–1984. https://doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS ’10), 1–10. https://doi.org/10.1145/1858171.1858173",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Edward Dudley and Maximillian E. Novak. 1972. The Wild Man Within: An Image in Western Thought from the Renaissance to Romanticism. University of Pittsburgh Press.",
      "doi": ""
    },
    {
      "text": "Riley E. Dunlap, Kent D. Van Liere, Angela G. Mertig, and Robert Emmet Jones. 2000. New Trends in Measuring Environmental Attitudes: Measuring Endorsement of the New Ecological Paradigm: A Revised NEP Scale. Journal of Social Issues 56, 3: 425–442. https://doi.org/10.1111/0022-4537.00176",
      "doi": ""
    },
    {
      "text": "** Elizabeth Edwards, Serena Pollastri, Robert J Barratt, and Claire Dean. 2021. How Can Digital Education Contribute To A Pedagogy For Environmental Care? In Interaction Design and Children (IDC ’21), 421–426. https://doi.org/10.1145/3459990.3465190",
      "doi": "10.1145/3459990.3465190"
    },
    {
      "text": "** Jerry A. Fails and Michael Jones. 2020. The Design of Outdoor Technologies for Children. In HCI Outdoors: Theory, Design, Methods and Applications, D. Scott McCrickard, Michael Jones and Timothy L. Stelter (eds.). Springer, 213–224.",
      "doi": ""
    },
    {
      "text": "** Jerry Alan Fails, Katherine G. Herbert, Emily Hill, Christopher Loeschorn, Spencer Kordecki, David Dymko, Andrew DeStefano, and Zill Christian. 2014. GeoTagger: a collaborative and participatory environmental inquiry system. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW Companion ’14), 157–160. https://doi.org/10.1145/2556420.2556481",
      "doi": "10.1145/2556420.2556481"
    },
    {
      "text": "Paul Farley and Michael Symmons Roberts. 2012. Edgelands: journeys into England's true wilderness. Random House.",
      "doi": ""
    },
    {
      "text": "** Jan Fell, Travis Greene, Jyun-Cheng Wang, and Pei-Yi Kuo. 2020. Beyond Human-Centered Design: Proposing a Biocentric View on Design Research Involving Vegetal Subjects. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference (DIS’ 20 Companion), 209–214. https://doi.org/10.1145/3393914.3395883",
      "doi": "10.1145/3393914.3395883"
    },
    {
      "text": "Hugh Fido and Chris Gayford. 1982. Field work and the biology teacher: a survey in secondary schools in England and Wales. Journal of Biological Education 16, 1: 27–34. https://doi.org/10.1080/00219266.1982.9654414",
      "doi": ""
    },
    {
      "text": "Jessica Katherine Frawley and Laurel Evelyn Dyson. 2014. Animal Personas: Acknowledging Non-human Stakeholders in Designing for Sustainable Food Systems. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI ’14), 21–30. https://doi.org/10.1145/2686612.2686617",
      "doi": "10.1145/2686612.2686617"
    },
    {
      "text": "Kevin J. Gaston and Masashi Soga. 2020. Extinction of experience: The need to be more specific. People and Nature 2, 3: 575–581. https://doi.org/10.1002/pan3.10118",
      "doi": ""
    },
    {
      "text": "** William Gaver, Andy Boucher, Michail Vanis, Andy Sheen, Dean Brown, Liliana Ovalle, Naho Matsuda, Amina Abbas-Nazari, and Robert Phillips. 2019. My Naturewatch Camera: Disseminating Practice Research with a Cheap and Easy DIY Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 1–13. https://doi.org/10.1145/3290605.3300532",
      "doi": "10.1145/3290605.3300532"
    },
    {
      "text": "William Gaver, Mike Michael, Tobie Kerridge, Alex Wilkie, Andy Boucher, Liliana Ovalle, and Matthew Plummer-Fernandez. 2015. Energy Babble: Mixing Environmentally-Oriented Internet Content to Engage Community Groups. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), 1115–1124. https://doi.org/10.1145/2702123.2702546",
      "doi": "10.1145/2702123.2702546"
    },
    {
      "text": "E. Paul J. Gibbs. 2014. The evolution of One Health: a decade of progress and challenges for the future. Veterinary Record 174, 4: 85–91.",
      "doi": ""
    },
    {
      "text": "Elizabeth Goodman. 2009. Three environmental discourses in human-computer interaction. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’09), 2535–2544. https://doi.org/10.1145/1520340.1520358",
      "doi": "10.1145/1520340.1520358"
    },
    {
      "text": "Judith I. M. de Groot and Linda Steg. 2008. Value Orientations to Explain Beliefs Related to Environmental Significant Behavior: How to Measure Egoistic, Altruistic, and Biospheric Value Orientations. Environment and Behavior 40, 3: 330–354. https://doi.org/10.1177/0013916506297831",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 1994. Computer-Supported Cooperative Work: History and Focus. Computer 27, 5: 19–26. https://doi.org/10.1109/2.291294",
      "doi": "10.1109/2.291294"
    },
    {
      "text": "** Jonna Häkkilä, Nicola J. Bidwell, Keith Cheverst, Ashley Colley, Felix Kosmalla, Simon Robinson, and Johannes Schöning. 2018. Reflections on the NatureCHI Workshop Series: Unobtrusive User Experiences with Technology in Nature. International Journal of Mobile Human Computer Interaction 10, 3: 1–9. https://doi.org/10.4018/IJMHCI.2018070101",
      "doi": "10.4018/IJMHCI.2018070101"
    },
    {
      "text": "** Jonna Häkkilä, Keith Cheverst, Johannes Schöning, Nicola J. Bidwell, Simon Robinson, and Ashley Colley. 2016. NatureCHI: Unobtrusive User Experiences with Technology in Nature. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’16), 3574–3580. https://doi.org/10.1145/2851581.2856495",
      "doi": "10.1145/2851581.2856495"
    },
    {
      "text": "** Jonna Häkkilä, Ashley Colley, Keith Cheverst, Simon Robinson, Johannes Schöning, Nicola J. Bidwell, and Felix Kosmalla. 2017. NatureCHI 2017: the 2nd workshop on unobtrusive user experiences with technology in nature. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI ’17), 1–4. https://doi.org/10.1145/3098279.3119836",
      "doi": "10.1145/3098279.3119836"
    },
    {
      "text": "Lon Åke Erni Johannes Hansson, Teresa Cerratto Pargman, and Daniel Sapiens Pargman. 2021. A Decade of Sustainable HCI: Connecting SHCI to the Sustainable Development Goals. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–19. https://doi.org/10.1145/3411764.3445069",
      "doi": "10.1145/3411764.3445069"
    },
    {
      "text": "Donna J. Haraway. 2003. The companion species manifesto: Dogs, people, and significant otherness. Prickly Paradigm Press Chicago.",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 2016. Staying with the Trouble: Making Kin in the Chthulucene. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2014. The talking plants: an interactive system for grassroots urban food-growing communities. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’14), 459–462. https://doi.org/10.1145/2559206.2574792",
      "doi": "10.1145/2559206.2574792"
    },
    {
      "text": "** Yasamin Heshmat, Brennan Jones, Xiaoxuan Xiong, Carman Neustaedter, Anthony Tang, Bernhard E. Riecke, and Lillian Yang. 2018. Geocaching with a Beam: Shared Outdoor Activities through a Telepresence Robot with 360 Degree Viewing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–13. https://doi.org/10.1145/3173574.3173933",
      "doi": "10.1145/3173574.3173933"
    },
    {
      "text": "Ilyena Hirskyj-Douglas, Roosa Piitulainen, and Andrés Lucero. 2021. Forming the Dog Internet: Prototyping a Dog-to-Human Video Call Device. Proceedings of the ACM on Human-Computer Interaction 5, ISS: 494:1-494:20. https://doi.org/10.1145/3488539",
      "doi": "10.1145/3488539"
    },
    {
      "text": "Max Horkheimer and Theodor W. Adorno. 1944. Dialectic of Enlightenment. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Eva Hornecker. 2016. The To-and-Fro of Sense Making: Supporting Users’ Active Indexing in Museums. ACM Trans. Comput.-Hum. Interact. 23, 2: 10:1-10:48. https://doi.org/10.1145/2882785",
      "doi": "10.1145/2882785"
    },
    {
      "text": "** Sungjae Hwang, Kibeom Lee, and Woonseung Yeo. 2010. My Green Pet: a current-based interactive plant for children. In Proceedings of the 9th International Conference on Interaction Design and Children (IDC ’10), 210–213. https://doi.org/10.1145/1810543.1810573",
      "doi": "10.1145/1810543.1810573"
    },
    {
      "text": "** Steven J. Jackson and Sarah Barbrow. 2013. Infrastructure and vocation: field, calling and computation in ecology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 2873–2882. https://doi.org/10.1145/2470654.2481397",
      "doi": "10.1145/2470654.2481397"
    },
    {
      "text": "Wanggi Jaung. 2022. Digital forest recreation in the metaverse: Opportunities and challenges. Technological Forecasting and Social Change 185: 122090. https://doi.org/10.1016/j.techfore.2022.122090",
      "doi": ""
    },
    {
      "text": "Brennan Jones. 2018. Designing for Distributed Collaboration in Wilderness Search and Rescue. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’18), 77–80. https://doi.org/10.1145/3272973.3272978",
      "doi": "10.1145/3272973.3272978"
    },
    {
      "text": "Julia P. G. Jones, Laura Thomas-Walters, Niki A. Rust, and Diogo Veríssimo. 2019. Nature documentaries and saving nature: Reflections on the new Netflix series Our Planet. People and Nature 1, 4: 420–425. https://doi.org/10.1002/pan3.10052",
      "doi": ""
    },
    {
      "text": "** Michael D. Jones, Zann Anderson, Jonna Häkkilä, Keith Cheverst, and Florian Daiber. 2018. HCI Outdoors: Understanding Human-Computer Interaction in Outdoor Recreation. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA ’18), 1–8. https://doi.org/10.1145/3170427.3170624",
      "doi": "10.1145/3170427.3170624"
    },
    {
      "text": "Peter H. Kahn, Rachel L. Severson, and Jolina H. Ruckert. 2009. The Human Relation With Nature and Technological Nature. Current Directions in Psychological Science 18, 1: 37–42. https://doi.org/10.1111/j.1467-8721.2009.01602.x",
      "doi": ""
    },
    {
      "text": "** Matej Kaninsky, Sarah Gallacher, and Yvonne Rogers. 2018. Confronting People's Fears About Bats: Combining Multi-modal and Environmentally Sensed Data to Promote Curiosity and Discovery. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS ’18), 931–943. https://doi.org/10.1145/3196709.3196783",
      "doi": "10.1145/3196709.3196783"
    },
    {
      "text": "Rachel Kaplan and Stephen Kaplan. 1989. The experience of nature: A psychological perspective. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "** Saba Kawas, Sarah K. Chase, Jason Yip, Joshua J. Lawler, and Katie Davis. 2019. Sparking interest: A design framework for mobile technologies to promote children's interest in nature. International Journal of Child-Computer Interaction 20: 24–34. https://doi.org/10.1016/j.ijcci.2019.01.003",
      "doi": "10.1016/j.ijcci.2019.01.003"
    },
    {
      "text": "** Saba Kawas, Nicole S. Kuhn, Kyle Sorstokke, Emily Bascom, Alexis Hiniker, and Katie Davis. 2021. When Screen Time Isn't Screen Time: Tensions and Needs Between Tweens and Their Parents During Nature-Based Exploration. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21). https://doi.org/10.1145/3411764.3445142",
      "doi": "10.1145/3411764.3445142"
    },
    {
      "text": "** Saba Kawas, Nicole S. Kuhn, Mina Tari, Alexis Hiniker, and Katie Davis. 2020. “Otter this world”: can a mobile application promote children's connectedness to nature? In Proceedings of the Interaction Design and Children Conference (IDC ’20), 444–457. https://doi.org/10.1145/3392063.3394434",
      "doi": "10.1145/3392063.3394434"
    },
    {
      "text": "Stephen R. Kellert. 2012. Building for life: Designing and understanding the human-nature connection. Island press.",
      "doi": ""
    },
    {
      "text": "Stephen R. Kellert and Edward O. Wilson (eds.). 1993. The Biophilia hypothesis. Island Press, Washington, D.C.",
      "doi": ""
    },
    {
      "text": "** Rébecca Kleinberger, Anne H. K. Harrington, Lydia Yu, Akito van Troyer, David Su, Janet M. Baker, and Gabriel Miller. 2020. Interspecies Interactions Mediated by Technology: An Avian Case Study at the Zoo. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–12. https://doi.org/10.1145/3313831.3376858",
      "doi": "10.1145/3313831.3376858"
    },
    {
      "text": "** Hill Hiroki Kobayashi. 2015. Human–Computer–Biosphere Interaction: Toward a Sustainable Society. In More Playful User Interfaces: Interfaces that Invite Social and Physical Interaction, Anton Nijholt (ed.). Springer Singapore, Singapore, 97–119. https://doi.org/10.1007/978-981-287-546-4_5",
      "doi": ""
    },
    {
      "text": "** Hill Hiroki Kobayashi, Hiromi Kudo, Vicki Moulder, Michael Heidt, and Lorna Boschman. 2017. Fukushima Audio Census. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17), 1393–1398. https://doi.org/10.1145/3027063.3052546",
      "doi": "10.1145/3027063.3052546"
    },
    {
      "text": "Lindah Kotut, Michael Horning, Timothy L. Stelter, and D. Scott McCrickard. 2020. Preparing for the Unexpected: Community Framework for Social Media Use and Social Support by Trail Thru-Hikers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–13. https://doi.org/10.1145/3313831.3376391",
      "doi": "10.1145/3313831.3376391"
    },
    {
      "text": "** K. Cassie Kresnye and Patrick C. Shih. 2020. Smart Habitat: A Wildlife Rehabilitation System. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), 1–7. https://doi.org/10.1145/3334480.3383093",
      "doi": "10.1145/3334480.3383093"
    },
    {
      "text": "Gerard T. Kyle, Andrew J. Mowen, and Michael Tarrant. 2004. Linking place preferences with place meaning: An examination of the relationship between place motivation and place attachment. Journal of Environmental Psychology 24, 4: 439–454. https://doi.org/10.1016/j.jenvp.2004.11.001",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 1993. We Have Never Been Modern. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Pascal Lessel, Maximilian Altmeyer, and Antonio Krüger. 2015. Analysis of recycling capabilities of individuals and crowds to encourage and educate people to separate their garbage playfully. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1095–1104.",
      "doi": "10.1145/2702123.2702309"
    },
    {
      "text": "Daniel Levi and Sara Kocher. 1999. Virtual Nature: The Future Effects of Information Technology on Our Relationship to Nature. Environment and Behavior 31, 2: 203–226. https://doi.org/10.1177/00139169921972065",
      "doi": ""
    },
    {
      "text": "** Ann Light, Irina Shklovski, and Alison Powell. 2017. Design for Existential Crisis. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17), 722–734. https://doi.org/10.1145/3027063.3052760",
      "doi": "10.1145/3027063.3052760"
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How WEIRD is CHI? In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–14. https://doi.org/10.1145/3411764.3445488",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "** Jen Liu, Daragh Byrne, and Laura Devendorf. 2018. Design for Collaborative Survival: An Inquiry into Human-Fungi Relationships. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–13. https://doi.org/10.1145/3173574.3173614",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "** Szu-Yu (Cyn) Liu, Jeffrey Bardzell, and Shaowen Bardzell. 2018. Photography as a Design Research Tool into Natureculture. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS ’18), 777–789. https://doi.org/10.1145/3196709.3196819",
      "doi": "10.1145/3196709.3196819"
    },
    {
      "text": "** Szu-Yu (Cyn) Liu, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Decomposition as Design: Co-Creating (with) Natureculture. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’19), 605–614. https://doi.org/10.1145/3294109.3295653",
      "doi": "10.1145/3294109.3295653"
    },
    {
      "text": "Richard Louv. 2008. Last Child in the Woods: Saving Our Children from Nature-Deficit Disorder. Algonquin Books, Chapel Hill, N.C.",
      "doi": ""
    },
    {
      "text": "** Hanuma Teja Maddali and Amanda Lazar. 2020. Sociality and Skill Sharing in the Garden. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–13. https://doi.org/10.1145/3313831.3376246",
      "doi": "10.1145/3313831.3376246"
    },
    {
      "text": "Magic to Go. Magic to Go. Retrieved September 16, 2022 from https://go-to-magic.com/",
      "doi": ""
    },
    {
      "text": "Clara Mancini. 2011. Animal-computer Interaction: A Manifesto. Interactions 18, 4: 69–73. https://doi.org/10.1145/1978822.1978836",
      "doi": "10.1145/1978822.1978836"
    },
    {
      "text": "Christian Martin and Sandor Czellar. 2017. Where do biospheric values come from? A connectedness to nature perspective. Journal of Environmental Psychology 52: 56–68. https://doi.org/10.1016/j.jenvp.2017.04.009",
      "doi": ""
    },
    {
      "text": "F. Stephan Mayer and Cynthia McPherson Frantz. 2004. The connectedness to nature scale: A measure of individuals’ feeling in community with nature. Journal of Environmental Psychology 24, 4: 503–515. https://doi.org/10.1016/j.jenvp.2004.10.001",
      "doi": ""
    },
    {
      "text": "** D. Scott McCrickard, Michael Jones, and Timothy L. Stelter. 2020. Finding Human–Computer Interaction Outdoors. In HCI Outdoors: Theory, Design, Methods and Applications, D. Scott McCrickard, Michael Jones and Timothy L. Stelter (eds.). Springer, 1–16.",
      "doi": ""
    },
    {
      "text": "Adina M. Merenlender, Alycia W. Crall, Sabrina Drill, Michelle Prysby, and Heidi Ballard. 2016. Evaluating environmental education, citizen science, and stewardship through naturalist programs. Conservation Biology 30, 6: 1255–1265. https://doi.org/10.1111/cobi.12737",
      "doi": ""
    },
    {
      "text": "** Stuart Moran, Nadia Pantidi, Tom Rodden, Alan Chamberlain, Chloe Griffiths, Davide Zilli, Geoff Merrett, and Alex Rogers. 2014. Listening to the forest and its curators: lessons learnt from a bioacoustic smartphone application deployment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’14), 2387–2396. https://doi.org/10.1145/2556288.2557022",
      "doi": "10.1145/2556288.2557022"
    },
    {
      "text": "** Carman Neustaedter, Yasamin Heshmat, Brennan Jones, Azadeh Forghani, and Xiaoxuan Xiong. 2020. Shared Family Experiences Over Distance in the Outdoors. In HCI Outdoors: Theory, Design, Methods and Applications, D. Scott McCrickard, Michael Jones and Timothy L. Stelter (eds.). Springer, 155–174.",
      "doi": ""
    },
    {
      "text": "** Joseph W. Newbold, Jacob Luton, Anna L. Cox, and Sandy J. J. Gould. 2017. Using Nature-based Soundscapes to Support Task Performance and Mood. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17), 2802–2809. https://doi.org/10.1145/3027063.3053214",
      "doi": "10.1145/3027063.3053214"
    },
    {
      "text": "** Kenton O'Hara. 2008. Understanding geocaching practices and motivations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’08), 1177–1186. https://doi.org/10.1145/1357054.1357239",
      "doi": "10.1145/1357054.1357239"
    },
    {
      "text": "** Kenton O'Hara, Tim Kindberg, Maxine Glancy, Luciana Baptista, Byju Sukumaran, Gil Kahana, and Julie Rowbotham. 2007. Collecting and sharing location-based content on mobile phones in a zoo visitor experience. Computer Supported Cooperative Work (CSCW) 16, 1–2: 11–44. https://doi.org/10.1007/s10606-007-9039-2",
      "doi": "10.1007/s10606-007-9039-2"
    },
    {
      "text": "** Yutaro Ohashi and Makoto Arisawa. 2006. Nature talk: a proposed audible database system for environmental learning. In Proceedings of the 2006 conference on Interaction design and children (IDC ’06), 167–168. https://doi.org/10.1145/1139073.1139077",
      "doi": "10.1145/1139073.1139077"
    },
    {
      "text": "** Yutaro Ohashi, Hideaki Ogawa, and Makoto Arisawa. 2008. Making New Learning Environment in Zoo by Adopting Mobile Devices. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI ’08), 489–490. https://doi.org/10.1145/1409240.1409323",
      "doi": "10.1145/1409240.1409323"
    },
    {
      "text": "** Jessica L. Oliver, Margot Brereton, Selen Turkay, David M. Watson, and Paul Roe. 2020. Exploration of Aural & Visual Media About Birds Informs Lessons for Citizen Science Design. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (DIS ’20), 1687–1700. https://doi.org/10.1145/3357236.3395478",
      "doi": "10.1145/3357236.3395478"
    },
    {
      "text": "** Jessica L. Oliver, Margot Brereton, David M. Watson, and Paul Roe. 2018. Visualisations elicit knowledge to refine citizen science technology design: spectrograms resonate with birders. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (OzCHI ’18), 133–144. https://doi.org/10.1145/3292147.3292171",
      "doi": "10.1145/3292147.3292171"
    },
    {
      "text": "** Jessica L. Oliver, Margot Brereton, David M. Watson, and Paul Roe. 2019. Listening to Save Wildlife: Lessons Learnt from Use of Acoustic Technology by a Species Recovery Team. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), 1335–1348. https://doi.org/10.1145/3322276.3322360",
      "doi": "10.1145/3322276.3322360"
    },
    {
      "text": "** Jessie L. Oliver, Selen Turkay, Margot Brereton, David M. Watson, and Paul Roe. 2021. Engaging with Nature Sounds & Citizen Science by Designing for Creative & Contextual Audio Encounters. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–14. https://doi.org/10.1145/3411764.3445390",
      "doi": "10.1145/3411764.3445390"
    },
    {
      "text": "** Maria V. Palacin-Silva, Antti Knutas, Maria Angela Ferrario, Jari Porras, Jouni Ikonen, and Chandara Chea. 2018. The Role of Gamification in Participatory Environmental Sensing: A Study In the Wild. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–13. https://doi.org/10.1145/3173574.3173795",
      "doi": "10.1145/3173574.3173795"
    },
    {
      "text": "Bum Jin Park, Yuko Tsunetsugu, Tamami Kasetani, Takahide Kagawa, and Yoshifumi Miyazaki. 2009. The physiological effects of Shinrin-yoku (taking in the forest atmosphere or forest bathing): evidence from field experiments in 24 forests across Japan. Environmental Health and Preventive Medicine 15, 1: 18. https://doi.org/10.1007/s12199-009-0086-9",
      "doi": ""
    },
    {
      "text": "** Claudio Pedica, Michelangelo Diamanti, and Hannes Högni Vilhjálmsson. 2021. Assessing the Disturbance from Overcrowding in Outdoor Nature Experiences. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (CHI EA ’21), 1–8. https://doi.org/10.1145/3411763.3443439",
      "doi": "10.1145/3411763.3443439"
    },
    {
      "text": "Micah DJ Peters, Casey Marnie, Andrea C. Tricco, Danielle Pollock, Zachary Munn, Lyndsay Alexander, Patricia McInerney, Christina M. Godfrey, and Hanan Khalil. 2020. Updated methodological guidance for the conduct of scoping reviews. JBI evidence synthesis 18, 10: 2119–2126.",
      "doi": ""
    },
    {
      "text": "** Daniel Pimentel. 2021. The Peril and Potential of XR-based Interactions with Wildlife. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, 1–9. https://doi.org/10.1145/3411763.3450378",
      "doi": "10.1145/3411763.3450378"
    },
    {
      "text": "Ralph Pite. 2009. “His Country”: Hardy in the Rural. In A Companion to Thomas Hardy, Keith Wilson (ed.). Blackwell Publishing Ltd.",
      "doi": ""
    },
    {
      "text": "Val Plumwood. 2002. Feminism and the Mastery of Nature. Routledge.",
      "doi": ""
    },
    {
      "text": "** Nicholas Polys, Peter Sforza, and John Munsell. 2020. PlantShoe: Botanical Detectives. In HCI Outdoors: Theory, Design, Methods and Applications, D. Scott McCrickard, Michael Jones and Timothy L. Stelter (eds.). Springer, 119–136.",
      "doi": ""
    },
    {
      "text": "** Leigh Ellen Potter, Lewis Carter, and Alexandra Coghlan. 2016. Virtual reality and nature based tourism: an opportunity for operators and visitors. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (OzCHI ’16), 652–654. https://doi.org/10.1145/3010915.3011854",
      "doi": "10.1145/3010915.3011854"
    },
    {
      "text": "Helena Pozniak. 2022. The off-grid lifestyle. Engineering & Technology 17, 8: 1–6. https://doi.org/10.1049/et.2022.0808",
      "doi": ""
    },
    {
      "text": "** Jennifer Preece. 2016. Citizen Science: New Research Challenges for Human–Computer Interaction. International Journal of Human–Computer Interaction 32, 8: 585–612. https://doi.org/10.1080/10447318.2016.1194153",
      "doi": ""
    },
    {
      "text": "** Jennifer Preece. 2017. How two billion smartphone users can save species! Interactions 24, 2: 26–33. https://doi.org/10.1145/3043702",
      "doi": "10.1145/3043702"
    },
    {
      "text": "** Jennifer Preece, Carol Boston, Tom Yeh, Jacqueline Cameron, Mary Maher, and Kazjon Grace. 2016. Enticing Casual Nature Preserve Visitors into Citizen Science via Photos. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (CSCW ’16 Companion), 373–376. https://doi.org/10.1145/2818052.2869104",
      "doi": "10.1145/2818052.2869104"
    },
    {
      "text": "Anne-Caroline Prévot, Susan Clayton, and Raphael Mathevet. 2018. The relationship of childhood upbringing and university degree program to environmental identity: experience in nature matters. Environmental Education Research 24, 2: 263–279. https://doi.org/10.1080/13504622.2016.1249456",
      "doi": ""
    },
    {
      "text": "Ulrike Pröbstl, Birgit Elands, and Veronika Wirth. 2008. Forest recreation and nature tourism in Europe: context, history, and current situation. In European Forest Recreation and Tourism. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "** Cassidy Puckett. 2007. Using handhelds to promote environmental stewardship. In Proceedings of the 6th international conference on Interaction design and children (IDC ’07), 171–172. https://doi.org/10.1145/1297277.1297317",
      "doi": "10.1145/1297277.1297317"
    },
    {
      "text": "Maria Puig de la Bellacasa. 2010. Ethical doings in naturecultures. Ethics, place and environment 13, 2: 151–169.",
      "doi": ""
    },
    {
      "text": "** Andrew Quitmeyer and Kitty Kelly. 2020. Wild Birthplaces of Behavioral Media. In HCI Outdoors: Theory, Design, Methods and Applications, D. Scott McCrickard, Michael Jones and Timothy L. Stelter (eds.). Springer, 99–118.",
      "doi": ""
    },
    {
      "text": "** Adrijan S. Radikovic, John J. Leggett, John Keyser, and Roger S. Ulrich. 2005. Artificial window view of nature. In CHI ’05 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’05), 1993–1996. https://doi.org/10.1145/1056808.1057075",
      "doi": "10.1145/1056808.1057075"
    },
    {
      "text": "** Adrian Reetz, Deltcho Valtchanov, Michael Barnett-Cowan, Mark Hancock, and James R. Wallace. 2021. Nature vs. Stress: Investigating the Use of Biophilia in Non-Violent Exploration Games to Reduce Stress. Proceedings of the ACM on Human-Computer Interaction 5, CHI PLAY: 247:1-247:13. https://doi.org/10.1145/3474674",
      "doi": "10.1145/3474674"
    },
    {
      "text": "Matthias C. Rillig, Kenneth A. Gould, Marcus Maeder, Shing Woong Kim, Juan F. Dueñas, Liliana Pinek, Anika Lehmann, and Milos Bielcik. 2022. Opportunities and Risks of the “Metaverse” For Biodiversity and the Environment. Environmental Science & Technology 56, 8: 4721–4723. https://doi.org/10.1021/acs.est.2c01562",
      "doi": ""
    },
    {
      "text": "** Christine Robson, Marti Hearst, Chris Kau, and Jeffrey Pierce. 2013. Comparing the use of social networking and traditional media channels for promoting citizen science. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW ’13), 1463–1468. https://doi.org/10.1145/2441776.2441941",
      "doi": "10.1145/2441776.2441941"
    },
    {
      "text": "** Shannon Rodgers, Bernd Ploderer, and Margot Brereton. 2019. HCI in the Garden: Current Trends and Future Directions. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction (OZCHI’19), 381–386. https://doi.org/10.1145/3369457.3369498",
      "doi": "10.1145/3369457.3369498"
    },
    {
      "text": "** Yvonne Rogers, Sara Price, Geraldine Fitzpatrick, Rowanne Fleck, Eric Harris, H. Smith, C. Randell, H. Muller, C. O'Malley, D. Stanton, M. Thompson, and M. Weal. 2004. Ambient wood: designing new forms of digital augmentation for learning outdoors. In Proceedings of the 2004 conference on Interaction design and children: building a community (IDC ’04), 3–10. https://doi.org/10.1145/1017833.1017834",
      "doi": "10.1145/1017833.1017834"
    },
    {
      "text": "Keith C. Russell. 2001. What is wilderness therapy? Journal of Experiential Education 24, 2: 70–79.",
      "doi": ""
    },
    {
      "text": "** Kimiko Ryokai and Alice Agogino. 2013. Off the Paved Paths: Exploring Nature with a Mobile Augmented Reality Learning Tool. International Journal of Mobile Human Computer Interaction (IJMHCI) 5, 2: 21–49. https://doi.org/10.4018/jmhci.2013040102",
      "doi": ""
    },
    {
      "text": "** Kimiko Ryokai, Lora Oehlberg, Michael Manoochehri, and Alice Agogino. 2011. GreenHat: exploring the natural environment through experts’ perspectives. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), 2149–2152. https://doi.org/10.1145/1978942.1979254",
      "doi": "10.1145/1978942.1979254"
    },
    {
      "text": "** Mangalam Sankupellay, Anna Kalma, Sean Magin, Jessica L. Cappadonna, Paul Roe, and Margot Brereton. 2017. Birdsound: enticing urban dwellers to engage with local birds around their home. In Proceedings of the 29th Australian Conference on Computer-Human Interaction, 172–181. https://doi.org/10.1145/3152771.3152790",
      "doi": "10.1145/3152771.3152790"
    },
    {
      "text": "** Mangalam Sankupellay, Connor McLaughlin, Jessica Davis, Jonas Schulz, Sean Magin, Margot Brereton, and Paul Roe. 2016. B4 - Brisbane Backyard Bird Box: Connecting People to the Environment. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems (DIS ’16 Companion), 9–12. https://doi.org/10.1145/2908805.2908808",
      "doi": "10.1145/2908805.2908808"
    },
    {
      "text": "Harpreet Sareen, Jiefu Zheng, and Pattie Maes. 2019. Cyborg Botany: Augmented Plants as Sensors, Displays and Actuators. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1–2. https://doi.org/10.1145/3290607.3311778",
      "doi": "10.1145/3290607.3311778"
    },
    {
      "text": "Phoebe Sengers. 2011. What I learned on Change Islands: reflections on IT and pace of life. Interactions 18, 2: 40–48. https://doi.org/10.1145/1925820.1925830",
      "doi": "10.1145/1925820.1925830"
    },
    {
      "text": "** Jinsil Hwaryoung Seo, Annie Sungkajun, and Jinkyo Suh. 2015. Touchology: Towards Interactive Plant Design for Children with Autism and Older Adults in Senior Housing. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’15), 893–898. https://doi.org/10.1145/2702613.2732883",
      "doi": "10.1145/2702613.2732883"
    },
    {
      "text": "Paul Shepard. 1982. Nature and madness. Athens.",
      "doi": ""
    },
    {
      "text": "Marion Shoard. 2000. Edgelands of promise. Landscapes 1, 2: 74–93.",
      "doi": ""
    },
    {
      "text": "** Jay Silver. 2008. Camera for the invisible. In Proceedings of the 7th international conference on Interaction design and children (IDC ’08), 173–174. https://doi.org/10.1145/1463689.1463751",
      "doi": "10.1145/1463689.1463751"
    },
    {
      "text": "** Jay Silver and Eric Rosenbaum. 2010. Gifts for intertwining with modern nature. In Proceedings of the 9th International Conference on Interaction Design and Children (IDC ’10), 340–343. https://doi.org/10.1145/1810543.1810608",
      "doi": "10.1145/1810543.1810608"
    },
    {
      "text": "Henricus Smid, Patrick Mast, Maarten Tromp, Andi Winterboer, and Vanessa Evers. 2011. Canary in a coal mine: monitoring air quality and detecting environmental incidents by harvesting Twitter. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’11), 1855–1860. https://doi.org/10.1145/1979742.1979890",
      "doi": "10.1145/1979742.1979890"
    },
    {
      "text": "** Brian K. Smith and Brian J. Reiser. 1998. National Geographic unplugged: classroom-centered design of interactive nature films. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’98), 424–431. https://doi.org/10.1145/274644.274702",
      "doi": "10.1145/274644.274702"
    },
    {
      "text": "** Nancy Smith, Shaowen Bardzell, and Jeffrey Bardzell. 2017. Designing for Cohabitation: Naturecultures, Hybrids, and Decentering the Human in Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 1714–1725. https://doi.org/10.1145/3025453.3025948",
      "doi": "10.1145/3025453.3025948"
    },
    {
      "text": "Masashi Soga and Kevin J. Gaston. 2016. Extinction of experience: the loss of human–nature interactions. Frontiers in Ecology and the Environment 14, 2: 94–101. https://doi.org/10.1002/fee.1225",
      "doi": ""
    },
    {
      "text": "Masashi Soga, Kevin J. Gaston, Yuichi Yamaura, Kiyo Kurisu, and Keisuke Hanaki. 2016. Both Direct and Vicarious Experiences of Nature Affect Children's Willingness to Conserve Biodiversity. International Journal of Environmental Research and Public Health 13, 6: 529. https://doi.org/10.3390/ijerph13060529",
      "doi": ""
    },
    {
      "text": "** Alessandro Soro, Margot Brereton, Tshering Dema, Jessica L. Oliver, Min Zhen Chai, and Aloha May Hufana Ambe. 2018. The Ambient Birdhouse: An IoT Device to Discover Birds and Engage with Nature. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–13. https://doi.org/10.1145/3173574.3173971",
      "doi": "10.1145/3173574.3173971"
    },
    {
      "text": "Giuseppina Spano, Annalisa Theodorou, Gerhard Reese, Giuseppe Carrus, Giovanni Sanesi, and Angelo Panno. 2022. Virtual Nature and Psychological Outcomes: A Systematic Review. https://doi.org/10.31219/osf.io/8ux9a",
      "doi": ""
    },
    {
      "text": "** Anna Ståhl, Jakob Tholander, Jarmo Laaksolahti, and Elsa Kosmack-Vaara. 2017. Being, Bringing and Bridging: Three Aspects of Sketching with Nature. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS ’17), 1309–1320. https://doi.org/10.1145/3064663.3064764",
      "doi": "10.1145/3064663.3064764"
    },
    {
      "text": "** Cameron Steer, Simon Robinson, and Matt Jones. 2015. Growth, Change and Decay: Plants and Interaction Possibilities. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’15), 2037–2042. https://doi.org/10.1145/2702613.2732765",
      "doi": "10.1145/2702613.2732765"
    },
    {
      "text": "** Ekaterina R. Stepanova, John Desnoyers-Stewart, Philippe Pasquier, and Bernhard E. Riecke. 2020. JeL: Breathing Together to Connect with Others and Nature. In Proceedings of the 2020 ACM Designing Interactive Systems Conference, 641–654. https://doi.org/10.1145/3357236.3395532",
      "doi": "10.1145/3357236.3395532"
    },
    {
      "text": "Angus Stevenson (ed.). 2010. nature. Oxford Dictionary of English. Retrieved August 30, 2022 from https://www.oxfordreference.com/view/10.1093/acref/9780199571123.001.0001/m_en_gb0549910",
      "doi": ""
    },
    {
      "text": "Alison Stone. 2006. Adorno and the disenchantment of nature. Philosophy & Social Criticism 32, 2: 231–253. https://doi.org/10.1177/0191453706061094",
      "doi": ""
    },
    {
      "text": "** Norman Makoto Su and EunJeong Cheon. 2017. Reconsidering Nature: The Dialectics of Fair Chase in the Practices of American Midwest Hunters. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 6089–6100. https://doi.org/10.1145/3025453.3025966",
      "doi": "10.1145/3025453.3025966"
    },
    {
      "text": "** Mariko Suzuki, Itsuo Hatono, Tetsuo Ogino, Fusako Kusunoki, Hidefusa Sakamoto, Kazuhiko Sawada, Yasuhiro Hoki, and Katsuya Ifuku. 2009. LEGS system in a zoo: use of mobile phones to enhance observation of animals. In Proceedings of the 8th International Conference on Interaction Design and Children, 222–225. https://doi.org/10.1145/1551788.1551835",
      "doi": "10.1145/1551788.1551835"
    },
    {
      "text": "Trine Syvertsen. 2020. Digital Detox: The Politics of Disconnecting. Emerald Group Publishing.",
      "doi": ""
    },
    {
      "text": "** Bill Tomlinson, Bonnie Nardi, Daniel Stokols, and Ankita Raturi. 2021. Ecosystemas: Representing Ecosystem Impacts in Design. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, 1–10. https://doi.org/10.1145/3411763.3450382",
      "doi": "10.1145/3411763.3450382"
    },
    {
      "text": "** Bill Tomlinson, Man Lok Yau, Eric Baumer, Sara Goetz, Lynn Carpenter, Riley Pratt, Kristin Young, and Calen May-Tobin. 2006. The EcoRaft project: a multi-device interactive graphical exhibit for learning about restoration ecology. In CHI ’06 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’06), 1445–1450. https://doi.org/10.1145/1125451.1125717",
      "doi": "10.1145/1125451.1125717"
    },
    {
      "text": "Minh-Xuan A. Truong and Susan Clayton. 2020. Technologically transformed experiences of nature: A challenge for environmental conservation? Biological Conservation 244: 108532. https://doi.org/10.1016/j.biocon.2020.108532",
      "doi": ""
    },
    {
      "text": "Anna Tsing. 2012. Unruly Edges: Mushrooms as Companion SpeciesFor Donna Haraway. Environmental Humanities 1, 1: 141–154. https://doi.org/10.1215/22011919-3610012",
      "doi": ""
    },
    {
      "text": "Will R. Turner, Toshihiko Nakamura, and Marco Dinetti. 2004. Global Urbanization and the Separation of Humans from Nature. BioScience 54, 6: 585–590. https://doi.org/10.1641/0006-3568(2004)054[0585:GUATSO]2.0.CO;2",
      "doi": ""
    },
    {
      "text": "Roger S. Ulrich, Robert F. Simons, Barbara D. Losito, Evelyn Fiorito, Mark A. Miles, and Michael Zelson. 1991. Stress recovery during exposure to natural and urban environments. Journal of Environmental Psychology 11, 3: 201–230. https://doi.org/10.1016/S0272-4944(05)80184-7",
      "doi": ""
    },
    {
      "text": "Sim Van der Ryn and Stuart Cowan. 2013. Ecological design. Island press.",
      "doi": ""
    },
    {
      "text": "** Kellie Vella, Bernd Ploderer, and Margot Brereton. 2021. Human-Nature Relations in Urban Gardens: Explorations with Camera Traps. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–13. https://doi.org/10.1145/3411764.3445438",
      "doi": "10.1145/3411764.3445438"
    },
    {
      "text": "Helen Verran and Michael Christie. 2007. Using/designing digital technologies of representation in Aborginal Australian knowledge practices. Human Technology: An interdisciplinary journal on humans in ICT environments.",
      "doi": ""
    },
    {
      "text": "** Sarah Webber, Marcus Carter, Sally Sherwen, Wally Smith, Zaher Joukhader, and Frank Vetere. 2017. Kinecting with Orangutans: Zoo Visitors’ Empathetic Responses to Animals’ Use of Interactive Technology. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6075–6088. https://doi.org/10.1145/3025453.3025729",
      "doi": "10.1145/3025453.3025729"
    },
    {
      "text": "Sarah Webber, Marcus Carter, Wally Smith, and Frank Vetere. 2020. Co-Designing with Orangutans: Enhancing the Design of Enrichment for Animals. In Proceedings of the 2020 ACM Conference on Designing Interactive Systems, 1713–1725. https://doi.org/doi.org/10.1145/3357236.3395559",
      "doi": "10.1145/3357236.3395559"
    },
    {
      "text": "** Sarah Webber, Jessica L. Oliver, Wally Smith, Helena Bender, Kellie Vella, Margot Brereton, Alasdair Davies, Julia Hoy, and Kate Judith. 2021. Digital Technologies in Nature. In Proceedings of the Eighth International Conference on Animal-Computer Interaction. https://doi.org/10.1145/3493842.3493885",
      "doi": "10.1145/3493842.3493885"
    },
    {
      "text": "Lynn White Jr. 1967. The historical roots of our ecologic crisis. Science 155, 3767: 1203–1207.",
      "doi": ""
    },
    {
      "text": "** Danielle Wilde, Eric Harris, Yvonne Rogers, and Cliff Randell. 2003. The Periscope: supporting a computer enhanced field trip for children. Personal and Ubiquitous Computing 7, 3: 227–233. https://doi.org/10.1007/s00779-003-0230-2",
      "doi": "10.1007/s00779-003-0230-2"
    },
    {
      "text": "** Gavin Wood, Jon Back, Jaz Hee-jeong Choi, Thomas Dylan, and Marti Louw. 2019. Designing for Outdoor Play. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1–8. https://doi.org/10.1145/3290607.3299026",
      "doi": "10.1145/3290607.3299026"
    },
    {
      "text": "World Bank. 2020. Urban Development. World Bank. Retrieved September 12, 2022 from https://www.worldbank.org/en/topic/urbandevelopment/overview",
      "doi": ""
    },
    {
      "text": "Oran R. Young, Frans Berkhout, Gilberto C. Gallopin, Marco A. Janssen, Elinor Ostrom, and Sander van der Leeuw. 2006. The globalization of socio-ecological systems: An agenda for scientific research. Global Environmental Change 16, 3: 304–316. https://doi.org/10.1016/j.gloenvcha.2006.03.004",
      "doi": ""
    },
    {
      "text": "** Heather Toomey Zimmerman, Susan M. Land, Michael R. Mohney, Gi Woong Choi, Chrystal Maggiore, Soo Hyeon Kim, Yong Ju Jung, and Jaclyn Dudek. 2015. Using augmented reality to support observations about trees during summer camp. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC ’15), 395–398. https://doi.org/10.1145/2771839.2771925%3c/bib>",
      "doi": "10.1145/2771839.2771925"
    }
  ]
}