{
  "doi": "10.1145/3544548.3580782",
  "title": "Social Dynamics of AI Support in Creative Writing",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Recently, large language models have made huge advances in generating coherent, creative text. While much research focuses on how users can interact with language models, less work considers the social-technical gap that this technology poses. What are the social nuances that underlie receiving support from a generative AI? In this work we ask when and why a creative writer might turn to a computer versus a peer or mentor for support. We interview 20 creative writers about their writing practice and their attitudes towards both human and computer support. We discover three elements that govern a writer’s interaction with support actors: 1) what writers desire help with, 2) how writers perceive potential support actors, and 3) the values writers hold. We align our results with existing frameworks of writing cognition and creativity support, uncovering the social dynamics which modulate user responses to generative technologies.",
  "authors": [
    {
      "name": "Katy Ilonka Gero",
      "institution": "Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365341",
      "orcid": "0000-0001-5982-9321"
    },
    {
      "name": "Tao Long",
      "institution": "Computer Science, Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782655",
      "orcid": "0000-0002-1173-3475"
    },
    {
      "name": "Lydia B Chilton",
      "institution": "Computer Science Department, Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480701",
      "orcid": "0000-0002-1737-1276"
    }
  ],
  "references": [
    {
      "text": "Mark S. Ackerman. 2000. The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human–Computer Interaction 15, 2-3 (Sept. 2000), 179–203. https://doi.org/10.1207/S15327051HCI1523_5",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Stephen H. Bach, Victor Sanh, Zheng-Xin Yong, Albert Webson, Colin Raffel, Nihal V. Nayak, Abheesht Sharma, Taewoon Kim, M. Saiful Bari, Thibault Fevry, Zaid Alyafeai, Manan Dey, Andrea Santilli, Zhiqing Sun, Srulik Ben-David, Canwen Xu, Gunjan Chhablani, Han Wang, Jason Alan Fries, Maged S. Al-shaibani, Shanya Sharma, Urmish Thakker, Khalid Almubarak, Xiangru Tang, Xiangru Tang, Mike Tian-Jian Jiang, and Alexander M. Rush. 2022. PromptSource: An Integrated Development Environment and Repository for Natural Language Prompts. arXiv:2202.01279 [cs] (Feb. 2022). http://arxiv.org/abs/2202.01279 arXiv:2202.01279.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Walter S. Lasecki, Daniel S. Weld, and Eric Horvitz. 2019. Beyond Accuracy: The Role of Mental Models in Human-AI Team Performance. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 7 (Oct. 2019), 2–11. https://doi.org/10.1609/hcomp.v7i1.5285",
      "doi": ""
    },
    {
      "text": "Emily M. Bender, Timnit Gebru, Angelina McMillan-Major, and Shmargaret Shmitchell. 2021. On the Dangers of Stochastic Parrots: Can Language Models Be Too Big?. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. ACM, Virtual Event Canada, 610–623. https://doi.org/10.1145/3442188.3445922",
      "doi": "10.1145/3442188.3445922"
    },
    {
      "text": "Margaret A Boden. 2009. Computer Models of Creativity. AI Magazine (2009), 12. https://doi.org/10.1609/aimag.v30i3.2254",
      "doi": ""
    },
    {
      "text": "Kyle Booten and Katy Ilonka Gero. 2021. Poetry Machines: Eliciting Designs for Interactive Writing Tools from Poets. In Creativity and Cognition. ACM, Virtual Event Italy, 1–5. https://doi.org/10.1145/3450741.3466813",
      "doi": "10.1145/3450741.3466813"
    },
    {
      "text": "Tom B. Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel M. Ziegler, Jeffrey Wu, Clemens Winter, Christopher Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. arXiv:2005.14165 [cs] (July 2020). http://arxiv.org/abs/2005.14165 arXiv:2005.14165.",
      "doi": ""
    },
    {
      "text": "John Joon Young Chung, Shiqing He, and Eytan Adar. 2022. Artist Support Networks: Implications for Future Creativity Support Tools. In Designing Interactive Systems Conference. ACM, Virtual Event Australia, 232–246. https://doi.org/10.1145/3532106.3533505",
      "doi": "10.1145/3532106.3533505"
    },
    {
      "text": "John Joon Young Chung, Wooseok Kim, Kang Min Yoo, Hwaran Lee, Eytan Adar, and Minsuk Chang. 2022. TaleBrush: Sketching Stories with Generative Pretrained Language Models. (2022), 19.",
      "doi": ""
    },
    {
      "text": "Linda Flower and John R. Hayes. 1981. A Cognitive Process Theory of Writing. College Composition and Communication 32, 4 (Dec. 1981), 365. https://doi.org/10.2307/356600",
      "doi": ""
    },
    {
      "text": "Samuel Gehman, Suchin Gururangan, Maarten Sap, Yejin Choi, and Noah A. Smith. 2020. RealToxicityPrompts: Evaluating Neural Toxic Degeneration in Language Models. arXiv:2009.11462 [cs] (Sept. 2020). http://arxiv.org/abs/2009.11462 arXiv:2009.11462.",
      "doi": ""
    },
    {
      "text": "Katy Gero, Alex Calderwood, Charlotte Li, and Lydia Chilton. 2022. A Design Space for Writing Support Tools Using a Cognitive Process Model of Writing. In Proceedings of the First Workshop on Intelligent and Interactive Writing Assistants (In2Writing 2022). Association for Computational Linguistics, Dublin, Ireland, 11–24. https://doi.org/10.18653/v1/2022.in2writing-1.2",
      "doi": ""
    },
    {
      "text": "Katy Ilonka Gero, Zahra Ashktorab, Casey Dugan, Qian Pan, James Johnson, Werner Geyer, Maria Ruiz, Sarah Miller, David R. Millen, Murray Campbell, Sadhana Kumaravel, and Wei Zhang. 2020. Mental Models of AI Agents in a Cooperative Game Setting. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–12. https://doi.org/10.1145/3313831.3376316",
      "doi": "10.1145/3313831.3376316"
    },
    {
      "text": "Katy Ilonka Gero and Lydia B. Chilton. 2019. How a Stylistic, Machine-Generated Thesaurus Impacts a Writer’s Process. In Proceedings of the 2019 on Creativity and Cognition. ACM, San Diego CA USA, 597–603. https://doi.org/10.1145/3325480.3326573",
      "doi": "10.1145/3325480.3326573"
    },
    {
      "text": "Katy Ilonka Gero and Lydia B. Chilton. 2019. Metaphoria: An Algorithmic Companion for Metaphor Creation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300526",
      "doi": "10.1145/3290605.3300526"
    },
    {
      "text": "Katy Ilonka Gero, Vivian Liu, and Lydia Chilton. 2022. Sparks: Inspiration for Science Writing using Language Models. In Designing Interactive Systems Conference. ACM, Virtual Event Australia, 1002–1019. https://doi.org/10.1145/3532106.3533533",
      "doi": "10.1145/3532106.3533533"
    },
    {
      "text": "John R. Hayes. 1996. A new framework for understanding cognition and affect in writing. In The Science of Writing: Theories, Methods, Individual Differences, and Applications. Lawrence Erbaum Associates.",
      "doi": ""
    },
    {
      "text": "Julie S. Hui, Darren Gergle, and Elizabeth M. Gerber. 2018. IntroAssist: A Tool to Support Writing Introductory Help Requests. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–13. https://doi.org/10.1145/3173574.3173596",
      "doi": "10.1145/3173574.3173596"
    },
    {
      "text": "Zhengbao Jiang, Frank F. Xu, Jun Araki, and Graham Neubig. 2020. How Can We Know What Language Models Know?Transactions of the Association for Computational Linguistics 8 (07 2020), 423–438. https://doi.org/10.1162/tacl_a_00324 arXiv:https://direct.mit.edu/tacl/article-pdf/doi/10.1162/tacl_a_00324/1923867/tacl_a_00324.pdf",
      "doi": ""
    },
    {
      "text": "R.T. Kellogg. 2008. Training writing skills: A cognitive developmental perspective. Journal of Writing Research 1, 1 (June 2008), 1–26. https://doi.org/10.17239/jowr-2008.01.01.1",
      "doi": ""
    },
    {
      "text": "Pranav Khadpe, Ranjay Krishna, Li Fei-Fei, Jeffrey Hancock, and Michael Bernstein. 2020. Conceptual Metaphors Impact Perceptions of Human-AI Collaboration. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2 (Oct. 2020), 1–26. https://doi.org/10.1145/3415234 arXiv:2008.02311 [cs].",
      "doi": "10.1145/3415234"
    },
    {
      "text": "Mina Lee, Percy Liang, and Qian Yang. 2022. CoAuthor: Designing a Human-AI Collaborative Writing Dataset for Exploring Language Model Capabilities. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–19. https://doi.org/10.1145/3491102.3502030",
      "doi": "10.1145/3491102.3502030"
    },
    {
      "text": "Ming Liu, Rafael A Calvo, and Vasile Rus. 2020. Automatic Generation and Ranking of Questions for Critical Review. (2020), 15.",
      "doi": ""
    },
    {
      "text": "Pengfei Liu, Weizhe Yuan, Jinlan Fu, Zhengbao Jiang, Hiroaki Hayashi, and Graham Neubig. 2021. Pre-train, Prompt, and Predict: A Systematic Survey of Prompting Methods in Natural Language Processing. arXiv:2107.13586 [cs] (July 2021). http://arxiv.org/abs/2107.13586 arXiv:2107.13586.",
      "doi": ""
    },
    {
      "text": "Mary Lou Maher. 2012. Computational and Collective Creativity: Who’s Being Creative?(2012), 5.",
      "doi": ""
    },
    {
      "text": "Raphaël Millière. 2022. AI Art Is Challenging the Boundaries of Curation. Wired (July 2022). https://www.wired.com/story/dalle-art-curation-artificial-intelligence/",
      "doi": ""
    },
    {
      "text": "Meghan O’Gieblyn. 2021. Babel: Could a machine have an unconscious? (July 2021). https://www.nplusonemag.com/issue-40/essays/babel-4/",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 2002. Qualitative Research and Evaluation Methods (Chapter 5) (3 ed.). Sage Publications.",
      "doi": ""
    },
    {
      "text": "Zhenhui Peng, Qingyu Guo, Ka Wing Tsang, and Xiaojuan Ma. 2020. Exploring the Effects of Technological Writing Assistance for Support Providers in Online Mental Health Community. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–15. https://doi.org/10.1145/3313831.3376695",
      "doi": "10.1145/3313831.3376695"
    },
    {
      "text": "Ethan Perez, Saffron Huang, Francis Song, Trevor Cai, Roman Ring, John Aslanides, Amelia Glaese, Nat McAleese, and Geoffrey Irving. 2022. Red Teaming Language Models with Language Models. arXiv preprint arXiv:2202.03286(2022), 31.",
      "doi": ""
    },
    {
      "text": "James L. Peterson. 1980. Computer programs for detecting and correcting spelling errors. Commun. ACM 23, 12 (Dec. 1980), 676–687. https://doi.org/10.1145/359038.359041",
      "doi": "10.1145/359038.359041"
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2016. A Cost-Benefit Study of Text Entry Suggestion Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 83–88. https://doi.org/10.1145/2858036.2858305",
      "doi": "10.1145/2858036.2858305"
    },
    {
      "text": "Jack W. Rae, Sebastian Borgeaud, Trevor Cai, Katie Millican, Jordan Hoffmann, Francis Song, John Aslanides, Sarah Henderson, Roman Ring, Susannah Young, Eliza Rutherford, Tom Hennigan, Jacob Menick, Albin Cassirer, Richard Powell, George van den Driessche, Lisa Anne Hendricks, Maribeth Rauh, Po-Sen Huang, Amelia Glaese, Johannes Welbl, Sumanth Dathathri, Saffron Huang, Jonathan Uesato, John Mellor, Irina Higgins, Antonia Creswell, Nat McAleese, Amy Wu, Erich Elsen, Siddhant Jayakumar, Elena Buchatskaya, David Budden, Esme Sutherland, Karen Simonyan, Michela Paganini, Laurent Sifre, Lena Martens, Xiang Lorraine Li, Adhiguna Kuncoro, Aida Nematzadeh, Elena Gribovskaya, Domenic Donato, Angeliki Lazaridou, Arthur Mensch, Jean-Baptiste Lespiau, Maria Tsimpoukelli, Nikolai Grigorev, Doug Fritz, Thibault Sottiaux, Mantas Pajarskas, Toby Pohlen, Zhitao Gong, Daniel Toyama, Cyprien de Masson d’Autume, Yujia Li, Tayfun Terzi, Vladimir Mikulik, Igor Babuschkin, Aidan Clark, Diego de Las Casas, Aurelia Guy, Chris Jones, James Bradbury, Matthew Johnson, Blake Hechtman, Laura Weidinger, Iason Gabriel, William Isaac, Ed Lockhart, Simon Osindero, Laura Rimell, Chris Dyer, Oriol Vinyals, Kareem Ayoub, Jeff Stanway, Lorrayne Bennett, Demis Hassabis, Koray Kavukcuoglu, and Geoffrey Irving. 2022. Scaling Language Models: Methods, Analysis & Insights from Training Gopher. http://arxiv.org/abs/2112.11446 arXiv:2112.11446 [cs].",
      "doi": ""
    },
    {
      "text": "Nikhil Singh, Guillermo Bernal, Daria Savchenko, and Elena L. Glassman. 2022. Where to Hide a Stolen Elephant: Leaps in Creative Writing with Multimodal Machine Intelligence. ACM Transactions on Computer-Human Interaction (Feb. 2022), 3511599. https://doi.org/10.1145/3511599",
      "doi": "10.1145/3511599"
    },
    {
      "text": "Robin Sloan. 2016. Writing with the machine. (May 2016). https://www.robinsloan.com/notes/writing-with-the-machine/",
      "doi": ""
    },
    {
      "text": "Richard Jean So and Andrew Piper. 2016. How Has the MFA Changed the Contemporary Novel?The Atlantic (March 2016). https://www.theatlantic.com/entertainment/archive/2016/03/mfa-creative-writing/462483/",
      "doi": ""
    },
    {
      "text": "Richard Jean So and Gus Wezerek. 2020. Just How White Is the Book Industry?The New York Times (Dec. 2020). https://www.nytimes.com/interactive/2020/12/11/opinion/culture/diversity-publishing-industry.html",
      "doi": ""
    },
    {
      "text": "David R. Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2 (June 2006), 237–246. https://doi.org/10.1177/1098214005283748",
      "doi": ""
    },
    {
      "text": "Qiaosi Wang, Koustuv Saha, Eric Gregori, David Joyner, and Ashok Goel. 2021. Towards Mutual Theory of Mind in Human-AI Interaction: How Language Reflects What Students Perceive About a Virtual Teaching Assistant. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 384, 14 pages. https://doi.org/10.1145/3411764.3445645",
      "doi": "10.1145/3411764.3445645"
    },
    {
      "text": "Tongshuang Wu, Michael Terry, and Carrie J. Cai. 2021. AI Chains: Transparent and Controllable Human-AI Interaction by Chaining Large Language Model Prompts. arXiv:2110.01691 [cs] (Oct. 2021). http://arxiv.org/abs/2110.01691 arXiv:2110.01691.",
      "doi": ""
    },
    {
      "text": "Feiyu Xu, Hans Uszkoreit, Yangzhou Du, Wei Fan, Dongyan Zhao, and Jun Zhu. 2019. Explainable AI: A Brief Survey on History, Research Areas, Approaches and Challenges. In Natural Language Processing and Chinese Computing, Jie Tang, Min-Yen Kan, Dongyan Zhao, Sujian Li, and Hongying Zan (Eds.). Springer International Publishing, Cham, 563–574.",
      "doi": ""
    },
    {
      "text": "Susan Zhang, Stephen Roller, Naman Goyal, Mikel Artetxe, Moya Chen, Shuohui Chen, Christopher Dewan, Mona Diab, Xian Li, Xi Victoria Lin, Todor Mihaylov, Myle Ott, Sam Shleifer, Kurt Shuster, Daniel Simig, Punit Singh Koura, Anjali Sridhar, Tianlu Wang, and Luke Zettlemoyer. 2022. OPT: Open Pre-trained Transformer Language Models. http://arxiv.org/abs/2205.01068 arXiv:2205.01068 [cs].",
      "doi": ""
    }
  ]
}