{
  "doi": "10.1145/3544548.3581357",
  "title": "Can Voice Assistants Be Microaggressors? Cross-Race Psychological Responses to Failures of Automatic Speech Recognition",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Language technologies have a racial bias, committing greater errors for Black users than for white users. However, little work has evaluated what effect these disparate error rates have on users themselves. The present study aims to understand if speech recognition errors in human-computer interactions may mirror the same effects as misunderstandings in interpersonal cross-race communication. In a controlled experiment (N=108), we randomly assigned Black and white participants to interact with a voice assistant pre-programmed to exhibit a high versus low error rate. Results revealed that Black participants in the high error rate condition, compared to Black participants in the low error rate condition, exhibited significantly higher levels of self-consciousness, lower levels of self-esteem and positive affect, and less favorable ratings of the technology. White participants did not exhibit this disparate pattern. We discuss design implications and the diverse research directions to which this initial study aims to contribute.",
  "tags": [
    "Voice Assistants",
    "Automated Speech Recognition",
    "Race",
    "Individual Differences",
    "Wizard-of-Oz",
    "Harm",
    "Quantitative Methods",
    "Microaggressions",
    "Language Technology"
  ],
  "authors": [
    {
      "name": "Kimi Wenzel",
      "institution": "Human Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238735",
      "orcid": "0000-0003-3651-7063"
    },
    {
      "name": "Nitya Devireddy",
      "institution": "Human Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778320",
      "orcid": "0000-0001-8798-3115"
    },
    {
      "name": "Cam Davison",
      "institution": "Human Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778863",
      "orcid": "0000-0003-3181-7243"
    },
    {
      "name": "Geoff Kaufman",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459698057",
      "orcid": "0000-0002-0123-3792"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Play.ht. https://play.ht/. Accessed: 2022-09-13.",
      "doi": ""
    },
    {
      "text": "2019. Adobe Digital Insights 2019 US Voice Assistant Survey. Technical Report. Abobe.",
      "doi": ""
    },
    {
      "text": "Glenn Adams, Donna M Garcia, Valerie Purdie-Vaughns, and Claude M Steele. 2006. The detrimental effects of a suggestion of sexism in an instruction situation. Journal of experimental social psychology 42, 5 (2006), 602–615.",
      "doi": ""
    },
    {
      "text": "Linda Albright, David A Kenny, and Thomas E Malloy. 1988. Consensus in personality judgments at zero acquaintance.Journal of personality and social psychology 55, 3(1988), 387.",
      "doi": ""
    },
    {
      "text": "Annalisa Anzani, Ezra R Morris, and M Paz Galupo. 2019. From absence of microaggressions to seeing authentic gender: Transgender clients’ experiences with microaffirmations in therapy. Journal of LGBT Issues in Counseling 13, 4 (2019), 258–275.",
      "doi": ""
    },
    {
      "text": "Saray Ayala-López. 2020. Outing Foreigners: Accent and Linguistic Microaggressions. In Microaggressions and philosophy. Routledge, 146–162.",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Nicole B Lee. 2013. Exploring the use of speech input by blind people on mobile devices. In Proceedings of the 15th international ACM SIGACCESS conference on computers and accessibility. 1–8.",
      "doi": "10.1145/2513383.2513440"
    },
    {
      "text": "Erin Beneteau, Olivia K Richards, Mingrui Zhang, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication breakdowns between families and Alexa. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Jim Blascovich, Steven J Spencer, Diane Quinn, and Claude Steele. 2001. African Americans and high blood pressure: The role of stereotype threat. Psychological science 12, 3 (2001), 225–229.",
      "doi": ""
    },
    {
      "text": "Su Lin Blodgett and Brendan O’Connor. 2017. Racial disparity in natural language processing: A case study of social media african-american english. arXiv preprint arXiv:1707.00061(2017).",
      "doi": ""
    },
    {
      "text": "Michael Bonfert, Maximilian Spliethöver, Roman Arzaroli, Marvin Lange, Martin Hanci, and Robert Porzel. 2018. If you ask nicely: a digital assistant rebuking impolite voice commands. In proceedings of the 20th ACM international conference on multimodal interaction. 95–102.",
      "doi": "10.1145/3242969.3242995"
    },
    {
      "text": "Michael Braun, Anja Mainz, Ronee Chadowitz, Bastian Pfleging, and Florian Alt. 2019. At your service: Designing voice assistant personalities to improve automotive user interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300270"
    },
    {
      "text": "LaPrincess C Brewer, Kathryn A Carson, David R Williams, Allyssa Allen, Camara P Jones, and Lisa A Cooper. 2013. Association of race consciousness with the patient–physician relationship, medication adherence, and blood pressure in urban primary care patients. American journal of hypertension 26, 11 (2013), 1346–1352.",
      "doi": ""
    },
    {
      "text": "Penelope Brown, Stephen C Levinson, and Stephen C Levinson. 1987. Politeness: Some universals in language usage. Vol. 4. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Ryan P Brown and Elizabeth C Pinel. 2003. Stigma on my mind: Individual differences in the experience of stereotype threat. Journal of experimental social psychology 39, 6 (2003), 626–633.",
      "doi": ""
    },
    {
      "text": "Janghee Cho and Emilee Rader. 2020. The role of conversational grounding in supporting symbiosis between people and digital assistants. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–28.",
      "doi": "10.1145/3392838"
    },
    {
      "text": "Tae Rang Choi and Minette E Drumwright. 2021. “OK, Google, why do I use you?” Motivations, post-consumption evaluations, and perceptions of voice AI assistants. Telematics and Informatics 62 (2021), 101628.",
      "doi": ""
    },
    {
      "text": "Nikolas Coupland. 2000. Sociolinguistic prevarication about ‘standard English’. Journal of Sociolinguistics 4, 4 (2000), 622–634.",
      "doi": ""
    },
    {
      "text": "Jennifer Crocker and Brenda Major. 1989. Social stigma and self-esteem: The self-protective properties of stigma.Psychological review 96, 4 (1989), 608.",
      "doi": ""
    },
    {
      "text": "Jean-Claude Croizet, Gérard Després, Marie-Eve Gauzins, Pascal Huguet, Jacques-Philippe Leyens, and Alain Méot. 2004. Stereotype threat undermines intellectual performance by triggering a disruptive mental load. Personality and social psychology bulletin 30, 6 (2004), 721–731.",
      "doi": ""
    },
    {
      "text": "Andrea Cuadra, Shuran Li, Hansol Lee, Jason Cho, and Wendy Ju. 2021. My bad! repairing intelligent voice assistant errors improves interaction. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–24.",
      "doi": "10.1145/3449101"
    },
    {
      "text": "Bethany Davila. 2016. The inevitability of “standard” English: Discursive constructions of standard language ideologies. Written Communication 33, 2 (2016), 127–148.",
      "doi": ""
    },
    {
      "text": "Dana S Dunn and Erin E Andrews. 2015. Person-first and identity-first language: Developing psychologists’ cultural competence using disability language.American Psychologist 70, 3 (2015), 255.",
      "doi": ""
    },
    {
      "text": "Alice H Eagly and Steven J Karau. 2002. Role congruity theory of prejudice toward female leaders.Psychological review 109, 3 (2002), 573.",
      "doi": ""
    },
    {
      "text": "Alice H Eagly and Wendy Wood. 1982. Inferred sex differences in status as a determinant of gender stereotypes about social influence.Journal of personality and social psychology 43, 5(1982), 915.",
      "doi": ""
    },
    {
      "text": "Allan Fenigstein, Michael F Scheier, and Arnold H Buss. 1975. Public and private self-consciousness: Assessment and theory.Journal of consulting and clinical psychology 43, 4(1975), 522.",
      "doi": ""
    },
    {
      "text": "Anjalie Field, Su Lin Blodgett, Zeerak Waseem, and Yulia Tsvetkov. 2021. A Survey of Race, Racism, and Anti-Racism in NLP. arXiv preprint arXiv:2106.11410(2021).",
      "doi": ""
    },
    {
      "text": "Nelson Flores and Jonathan Rosa. 2015. Undoing appropriateness: Raciolinguistic ideologies and language diversity in education. Harvard Educational Review 85, 2 (2015), 149–171.",
      "doi": ""
    },
    {
      "text": "Lauren Freeman and Heather Stewart. 2021. Toward a harm-based account of microaggressions. Perspectives on Psychological Science 16, 5 (2021), 1008–1023.",
      "doi": ""
    },
    {
      "text": "Mary Louise Gomez, Ayesha Khurshid, Mel B Freitag, and Amy Johnson Lachuk. 2011. Microaggressions in graduate students’ lives: How they are encountered and their consequences. Teaching and teacher education 27, 8 (2011), 1189–1199.",
      "doi": ""
    },
    {
      "text": "Kylie L Goodman and Christopher B Mayhorn. 2023. It’s not what you say but how you say it: Examining the influence of perceived voice assistant gender and pitch on trust and reliance. Applied Ergonomics 106(2023), 103864.",
      "doi": ""
    },
    {
      "text": "Melanie C Green and Timothy C Brock. 2000. The role of transportation in the persuasiveness of public narratives.Journal of personality and social psychology 79, 5(2000), 701.",
      "doi": ""
    },
    {
      "text": "Eve Haque and Donna Patrick. 2015. Indigenous languages and the racial hierarchisation of language policy in Canada. Journal of Multilingual and Multicultural Development 36, 1(2015), 27–41.",
      "doi": ""
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Christina N Harrington, Radhika Garg, Amanda Woodward, and Dimitri Williams. 2022. “It’s Kind of Like Code-Switching”: Black Older Adults’ Experiences with a Voice Assistant for Health Information Seeking. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    },
    {
      "text": "Deborah J Hess, Hilreth Lanig, and Winston Vaughan. 2007. Educating for equity and social justice: A conceptual model for cultural engagement. Multicultural Perspectives 9, 1 (2007), 32–39.",
      "doi": ""
    },
    {
      "text": "Lindsay Pérez Huber. 2011. Discourses of racist nativism in California public education: English dominance as racist nativist microaggressions. Educational Studies 47, 4 (2011), 379–401.",
      "doi": ""
    },
    {
      "text": "Lindsay Pérez Huber, Tamara Gonzalez, Gabriela Robles, and Daniel G Solórzano. 2021. Racial microaffirmations as a response to racial microaggressions: Exploring risk and protective factors. New Ideas in Psychology 63 (2021), 100880.",
      "doi": ""
    },
    {
      "text": "Jiepu Jiang, Wei Jeng, and Daqing He. 2013. How do users respond to voice input errors? Lexical and phonetic query reformulation in voice search. In Proceedings of the 36th international ACM SIGIR conference on Research and development in information retrieval. 143–152.",
      "doi": "10.1145/2484028.2484092"
    },
    {
      "text": "Eunhee Kim. 2006. Reasons and motivations for code-mixing and code-switching. Issues in EFL 4, 1 (2006), 43–61.",
      "doi": ""
    },
    {
      "text": "Allison Koenecke, Andrew Nam, Emily Lake, Joe Nudell, Minnie Quartey, Zion Mengesha, Connor Toups, John R Rickford, Dan Jurafsky, and Sharad Goel. 2020. Racial disparities in automated speech recognition. Proceedings of the National Academy of Sciences 117, 14(2020), 7684–7689.",
      "doi": ""
    },
    {
      "text": "Youjin Kong. 2022. Are “Intersectionally Fair” AI Algorithms Really Fair to Women of Color? A Philosophical Analysis. In 2022 ACM Conference on Fairness, Accountability, and Transparency. 485–494.",
      "doi": ""
    },
    {
      "text": "Adi Kuntsman and Esperanza Miyake. 2019. The paradox and continuum of digital disengagement: denaturalising digital sociality and technological connectivity. Media, Culture & Society 41, 6 (2019), 901–913.",
      "doi": ""
    },
    {
      "text": "Eun Ju Lee, Clifford Nass, and Scott Brave. 2000. Can computer-generated speech have gender? An experimental test of gender stereotype. In CHI’00 extended abstracts on Human factors in computing systems. 289–290.",
      "doi": ""
    },
    {
      "text": "Yuting Liao and Jiangen He. 2020. Racial mirroring effects on human-agent interaction in psychotherapeutic conversations. In Proceedings of the 25th international conference on intelligent user interfaces. 430–442.",
      "doi": "10.1145/3377325.3377488"
    },
    {
      "text": "Linguistic Society of America. 1997. LSA Resolution on the Oakland “Ebonics” Issue. Presented at the annual meeting of the Linguistic Society of America.https://www.linguisticsociety.org/resource/lsa-resolution-oakland-ebonics-issue.",
      "doi": ""
    },
    {
      "text": "Kasper Lippert-Rasmussen. 2013. Born free and equal?: A philosophical inquiry into the nature of discrimination. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Rosina Lippi-Green. 1997. What we talk about when we talk about Ebonics: Why definitions matter. The Black Scholar 27, 2 (1997), 7–11.",
      "doi": ""
    },
    {
      "text": "Christine Logel, Emma C Iserman, Paul G Davies, Diane M Quinn, and Steven J Spencer. 2009. The perils of double consciousness: The role of thought suppression in stereotype threat. Journal of Experimental Social Psychology 45, 2 (2009), 299–312.",
      "doi": ""
    },
    {
      "text": "Riia Luhtanen and Jennifer Crocker. 1992. A collective self-esteem scale: Self-evaluation of one’s social identity. Personality and social psychology bulletin 18, 3 (1992), 302–318.",
      "doi": ""
    },
    {
      "text": "Andy Martens, Michael Johns, Jeff Greenberg, and Jeff Schimel. 2006. Combating stereotype threat: The effect of self-affirmation on women’s intellectual performance. Journal of Experimental Social Psychology 42, 2 (2006), 236–243.",
      "doi": ""
    },
    {
      "text": "Lina Mavrina, Jessica Szczuka, Clara Strathmann, Lisa Michelle Bohnenkamp, Nicole Krämer, and Stefan Kopp. 2022. “Alexa, You’re Really Stupid”: A Longitudinal Field Study on Communication Breakdowns Between Family Members and a Voice Assistant. Frontiers in Computer Science 4 (2022), 791704.",
      "doi": ""
    },
    {
      "text": "Phil McAleer, Alexander Todorov, and Pascal Belin. 2014. How do you say ‘Hello’? Personality impressions from brief novel voices. PloS one 9, 3 (2014), e90779.",
      "doi": ""
    },
    {
      "text": "Emma McClure. 2020. Escalating linguistic violence: From microaggressions to hate speech. In Microaggressions and Philosophy. Routledge, 121–145.",
      "doi": ""
    },
    {
      "text": "Zion Mengesha, Courtney Heldreth, Michal Lahav, Juliana Sublewski, and Elyse Tuennerman. 2021. “I don’t Think These Devices are Very Culturally Sensitive.”—Impact of Automated Speech Recognition Errors on African Americans. Frontiers in Artificial Intelligence(2021), 169.",
      "doi": ""
    },
    {
      "text": "Julie Minikel-Lacocque. 2013. Racism, college, and the power of words: Racial microaggressions reconsidered. American Educational Research Journal 50, 3 (2013), 432–465.",
      "doi": ""
    },
    {
      "text": "Nicole Mirnig, Gerald Stollnberger, Markus Miksch, Susanne Stadler, Manuel Giuliani, and Manfred Tscheligi. 2017. To err is robot: How humans assess and act toward an erroneous social robot. Frontiers in Robotics and AI(2017), 21.",
      "doi": ""
    },
    {
      "text": "James Moar and Meike Escherich. 2021. Voice Assistants: Monetisation Strategies, Competitive Landscape & Market Forecasts 2021-2026. Juniper Research. https://www.juniperresearch.com/researchstore/devices-technology/voice-assistants-market-research-report",
      "doi": ""
    },
    {
      "text": "R Matthew Montoya and Robert S Horton. 2013. A meta-analytic investigation of the processes underlying the similarity-attraction effect. Journal of Social and Personal Relationships 30, 1(2013), 64–94.",
      "doi": ""
    },
    {
      "text": "Taylor C Moran. 2021. Racial technological bias and the white, feminine voice of AI VAs. Communication and Critical/Cultural Studies 18, 1 (2021), 19–36.",
      "doi": ""
    },
    {
      "text": "Antony Morgan and Erio Ziglio. 2007. Revitalising the evidence base for public health: an assets model. Promotion & Education 14, 2_suppl (2007), 17–22.",
      "doi": ""
    },
    {
      "text": "Isabela Motta and Manuela Quaresma. 2021. Users’ Error Recovery Strategies in the Interaction with Voice Assistants (VAs). In Congress of the International Ergonomics Association. Springer, 658–666.",
      "doi": ""
    },
    {
      "text": "Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for how users overcome obstacles in voice user interfaces. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–7.",
      "doi": "10.1145/3173574.3173580"
    },
    {
      "text": "Kevin L Nadal, Katie E Griffin, Yinglee Wong, Kristin C Davidoff, and Lindsey S Davis. 2017. The injurious relationship between racial microaggressions and physical health: Implications for social work. Journal of Ethnic & Cultural Diversity in Social Work 26, 1-2(2017), 6–17.",
      "doi": ""
    },
    {
      "text": "Kevin L Nadal, Katie E Griffin, Yinglee Wong, Sahran Hamit, and Morgan Rasmus. 2014. The impact of racial microaggressions on mental health: Counseling implications for clients of color. Journal of Counseling & Development 92, 1 (2014), 57–66.",
      "doi": ""
    },
    {
      "text": "Clifford Nass and Kwan Min Lee. 2001. Does computer-synthesized speech manifest personality? Experimental tests of recognition, similarity-attraction, and consistency-attraction.Journal of experimental psychology: applied 7, 3 (2001), 171.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Youngme Moon, and Nancy Green. 1997. Are machines gender neutral? Gender-stereotypic responses to computers with voices. Journal of applied social psychology 27, 10 (1997), 864–876.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. 72–78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Clifford Ivar Nass and Scott Brave. 2005. Wired for speech: How voice activates and advances the human-computer relationship. MIT press Cambridge.",
      "doi": "10.5555/1088925"
    },
    {
      "text": "Andreea Niculescu, Betsy van Dijk, Anton Nijholt, Haizhou Li, and Swee Lan See. 2013. Making social robots more attractive: the effects of voice pitch, humor and empathy. International journal of social robotics 5, 2 (2013), 171–191.",
      "doi": ""
    },
    {
      "text": "Jason W Osborne. 2007. Linking stereotype threat and anxiety. Educational psychology 27, 1 (2007), 135–154.",
      "doi": ""
    },
    {
      "text": "Adam Palanica, Anirudh Thommandram, Andrew Lee, Michael Li, and Yan Fossat. 2019. Do you understand the words that are comin outta my mouth? Voice assistant comprehension of medication names. NPJ digital medicine 2, 1 (2019), 1–6.",
      "doi": ""
    },
    {
      "text": "Yin Paradies, Jehonathan Ben, Nida Denson, Amanuel Elias, Naomi Priest, Alex Pieterse, Arpana Gupta, Margaret Kelaher, and Gilbert Gee. 2015. Racism as a determinant of health: a systematic review and meta-analysis. PloS one 10, 9 (2015), e0138511.",
      "doi": ""
    },
    {
      "text": "Atieh Poushneh. 2021. Humanizing voice assistant: The impact of voice assistant personality on consumers’ attitudes and behaviors. Journal of Retailing and Consumer Services 58 (2021), 102283.",
      "doi": ""
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. \" Accessibility Came by Accident\" Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. In Proceedings of the 2018 CHI Conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174033"
    },
    {
      "text": "Amanda Purington, Jessie G Taft, Shruti Sannon, Natalya N Bazarova, and Samuel Hardman Taylor. 2017. \" Alexa is my new BFF\" Social Roles, User Satisfaction, and Personification of the Amazon Echo. In Proceedings of the 2017 CHI conference extended abstracts on human factors in computing systems. 2853–2859.",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Marco Ragni, Andrey Rudenko, Barbara Kuhnert, and Kai O Arras. 2016. Errare humanum est: Erroneous robots in human-robot interaction. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 501–506.",
      "doi": "10.1109/ROMAN.2016.7745164"
    },
    {
      "text": "Yolanda A Rankin and Jakita O Thomas. 2019. Straighten up and fly right: Rethinking intersectionality in HCI research. Interactions 26, 6 (2019), 64–68.",
      "doi": "10.1145/3363033"
    },
    {
      "text": "Cami Rincón, Os Keyes, and Corinne Cath. 2021. Speaking from Experience: Trans/Non-Binary Requirements for Voice-Activated AI. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–27.",
      "doi": "10.1145/3449206"
    },
    {
      "text": "Calpurnyia B Roberts, Anissa I Vines, Jay S Kaufman, and Sherman A James. 2008. Cross-sectional association between perceived discrimination and hypertension in African-American men and women: the Pitt County Study. American journal of epidemiology 167, 5 (2008), 624–632.",
      "doi": ""
    },
    {
      "text": "Richard W Robins, Holly M Hendin, and Kali H Trzesniewski. 2001. Measuring global self-esteem: Construct validation of a single-item measure and the Rosenberg Self-Esteem Scale. Personality and social psychology bulletin 27, 2 (2001), 151–161.",
      "doi": ""
    },
    {
      "text": "Jonathan Rosa. 2019. Looking like a language, sounding like a race. Oxf Studies in Anthropology of.",
      "doi": ""
    },
    {
      "text": "Jonathan Rosa and Nelson Flores. 2017. Unsettling race and language: Toward a raciolinguistic perspective. Language in society 46, 5 (2017), 621–647.",
      "doi": ""
    },
    {
      "text": "Morris Rosenberg. 1965. Rosenberg self-esteem scale (RSE). Acceptance and commitment therapy. Measures package 61, 52 (1965), 18.",
      "doi": ""
    },
    {
      "text": "Robert J Rydell, Allen R McConnell, and Sian L Beilock. 2009. Multiple social identities and stereotype threat: imbalance, accessibility, and working memory.Journal of personality and social psychology 96, 5(2009), 949.",
      "doi": ""
    },
    {
      "text": "Maarten Sap, Dallas Card, Saadia Gabriel, Yejin Choi, and Noah A Smith. 2019. The risk of racial bias in hate speech detection. In Proceedings of the 57th annual meeting of the association for computational linguistics. 1668–1678.",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I Hong. 2018. \" Hey Alexa, What’s Up?\" A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 designing interactive systems conference. 857–868.",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Rustam Shadiev, Wu-Yuin Hwang, Nian-Shing Chen, and Yueh-Min Huang. 2014. Review of speech-to-text recognition technology for enhancing learning. Journal of Educational Technology & Society 17, 4 (2014), 65–84.",
      "doi": ""
    },
    {
      "text": "Jessi L Smith, Carol Sansone, and Paul H White. 2007. The stereotyped task engagement process: The role of interest and achievement motivation.Journal of Educational Psychology 99, 1 (2007), 99.",
      "doi": ""
    },
    {
      "text": "Claude M Steele and Joshua Aronson. 1995. Stereotype threat and the intellectual test performance of African Americans.Journal of personality and social psychology 69, 5(1995), 797.",
      "doi": ""
    },
    {
      "text": "Derald Wing Sue. 2010. Microaggressions in everyday life: Race, gender, and sexual orientation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Derald Wing Sue. 2019. Microaggressions and student activism: Harmless impact and victimhood controversies. Microaggression theory: Influence and implications. Hoboken, NJ: Wiley (2019).",
      "doi": ""
    },
    {
      "text": "Derald Wing Sue, Cassandra Z Calle, Narolyn Mendez, Sarah Alsaidi, and Elizabeth Glaeser. 2020. Microintervention strategies: What you can do to disarm and dismantle individual and systemic racism and bias. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Derald Wing Sue, Christina M Capodilupo, Gina C Torino, Jennifer M Bucceri, Aisha Holder, Kevin L Nadal, and Marta Esquilin. 2007. Racial microaggressions in everyday life: implications for clinical practice.American psychologist 62, 4 (2007), 271.",
      "doi": ""
    },
    {
      "text": "Derald Wing Sue, Kevin L Nadal, Christina M Capodilupo, Annie I Lin, Gina C Torino, and David P Rivera. 2008. Racial microaggressions against Black Americans: Implications for counseling. Journal of Counseling & Development 86, 3 (2008), 330–338.",
      "doi": ""
    },
    {
      "text": "Rachael Tatman and Conner Kasten. 2017. Effects of Talker Dialect, Gender & Race on Accuracy of Bing Speech and YouTube Automatic Captions.. In Interspeech. 934–938.",
      "doi": ""
    },
    {
      "text": "Alexandra To, Wenxia Sweeney, Jessica Hammer, and Geoff Kaufman. 2020. \"They Just Don’t Get It\": Towards Social Technologies for Coping with Interpersonal Racism. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–29.",
      "doi": "10.1145/3392828"
    },
    {
      "text": "Suzanne Tolmeijer, Naim Zierau, Andreas Janson, Jalil Sebastian Wahdatehagh, Jan Marco Marco Leimeister, and Abraham Bernstein. 2021. Female by Default?–Exploring the Effect of Voice Assistant Gender and Pitch on Trait and Trust Attribution. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": "10.1145/3411763.3451623"
    },
    {
      "text": "Gina C Torino, David P Rivera, Christina M Capodilupo, Kevin L Nadal, and Derald Wing Sue. 2018. Everything You Wanted to Know About Microaggressions but Didn’t Get a Chance to Ask. Microaggression theory: Influence and implications (2018), 1–15.",
      "doi": ""
    },
    {
      "text": "Brendesha M Tynes, Michael T Giang, David R Williams, and Geneene N Thompson. 2008. Online racial discrimination and psychological adjustment among adolescents. Journal of adolescent health 43, 6 (2008), 565–569.",
      "doi": ""
    },
    {
      "text": "Octavio Villalpando and Daniel G Solórzano. 2005. The role of culture in college preparation programs: A review of the research literature. Preparing for college: Nine elements of effective outreach (2005), 13–28.",
      "doi": ""
    },
    {
      "text": "Mike Wald and Keith Bain. 2008. Universal access to communication and learning: the role of automatic speech recognition. Universal Access in the Information Society 6, 4 (2008), 435–447.",
      "doi": ""
    },
    {
      "text": "Gregory M Walton and Geoffrey L Cohen. 2007. A question of belonging: race, social fit, and achievement.Journal of personality and social psychology 92, 1(2007), 82.",
      "doi": ""
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales.Journal of personality and social psychology 54, 6(1988), 1063.",
      "doi": ""
    },
    {
      "text": "Monnica T Williams. 2020. Psychology cannot afford to ignore the many harms caused by microaggressions. Perspectives on Psychological Science 15, 1 (2020), 38–43.",
      "doi": ""
    },
    {
      "text": "Wendy Wood and Stephen J Karten. 1986. Sex differences in interaction style as a product of perceived sex differences in competence.Journal of personality and social psychology 50, 2(1986), 341.",
      "doi": ""
    }
  ]
}