{
  "doi": "10.1145/3544548.3580643",
  "title": "Marking Material Interactions with Computer Vision",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "The electronics-centered approach to physical computing presents challenges when designers build tangible interactive systems due to its inherent emphasis on circuitry and electronic components. To explore an alternative physical computing approach we have developed a computer vision (CV) based system that uses a webcam, computer, and printed fiducial markers to create functional tangible interfaces. Through a series of design studios, we probed how designers build tangible interfaces with this CV-driven approach. In this paper, we apply the annotated portfolio method to reflect on the fifteen outcomes from these studios. We observed that CV markers offer versatile materiality for tangible interactions, afford the use of democratic materials for interface construction, and engage designers in embodied debugging with their own vision as a proxy for CV. By sharing our insights, we inform other designers and educators who seek alternative ways to facilitate physical computing and tangible interaction design.",
  "authors": [
    {
      "name": "Peter Gyory",
      "institution": "ATLAS Institute, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659277033",
      "orcid": "0000-0003-2345-4825"
    },
    {
      "name": "S. Sandra Bae",
      "institution": "ATLAS Institute, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527372",
      "orcid": "0000-0002-2023-6219"
    },
    {
      "name": "Ruhan Yang",
      "institution": "ATLAS Institute, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659555082",
      "orcid": "0000-0001-9689-0877"
    },
    {
      "name": "Ellen Yi-Luen Do",
      "institution": "ATLAS Institute, University of Colorado Boulder, United States",
      "img": "/do/10.1145/contrib-81100609985/rel-imgonly/ellendo025x.jpg",
      "acmid": "81100609985",
      "orcid": "0000-0002-9948-6375"
    },
    {
      "name": "Clement Zheng",
      "institution": "Division of Industrial Design, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659143831",
      "orcid": "0000-0003-0336-6430"
    }
  ],
  "references": [
    {
      "text": "Adafruit. 2022. Adafruit Industries, Unique & fun DIY electronics and kits. Adafruit. https://www.adafruit.com/",
      "doi": ""
    },
    {
      "text": "Arduino. 2022. Arduino - Home. Arduino. https://www.arduino.cc/",
      "doi": ""
    },
    {
      "text": "S Sandra Bae, Rishi Vanukuru, Ruhan Yang, Peter Gyory, Ran Zhou, Ellen Yi-Luen Do, and Danielle Albers Szafir. 2022. Cultivating Visualization Literacy for Children Through Curiosity and Play. IEEE Transactions on Visualization and Computer Graphics 29, 1(2022), 257–267.",
      "doi": ""
    },
    {
      "text": "Bahareh Barati and Elvin Karana. 2019. Affordances as Materials Potential: What Design Can Do for Materials Development. International Journal of Design 13, 3 (Dec. 2019), 105–123. http://www.ijdesign.org/index.php/IJDesign/article/view/3419/879",
      "doi": ""
    },
    {
      "text": "Hernando Barragán. 2022. Wiring. Wiring. http://wiring.org.co/",
      "doi": ""
    },
    {
      "text": "Ayah Bdeir. 2009. Electronics as material: littleBits. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (2009-02-16) (TEI ’09). Association for Computing Machinery, New York, NY, USA, 397–400. https://doi.org/10.1145/1517664.1517743",
      "doi": "10.1145/1517664.1517743"
    },
    {
      "text": "Eli Blevis, Youn-kyung Lim, Erik Stolterman, Tracee Vetting Wolf, and Keichi Sato. 2007. Supporting design studio culture in HCI. In CHI ’07 Extended Abstracts on Human Factors in Computing Systems (2007-04-28) (CHI EA ’07). Association for Computing Machinery, New York, NY, USA, 2821–2824. https://doi.org/10.1145/1240866.1241086",
      "doi": "10.1145/1240866.1241086"
    },
    {
      "text": "Tracey Booth, Simone Stumpf, Jon Bird, and Sara Jones. 2016. Crossed Wires: Investigating the Problems of End-User Developers in a Physical Computing Task. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016-05-07) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3485–3497. https://doi.org/10.1145/2858036.2858533",
      "doi": "10.1145/2858036.2858533"
    },
    {
      "text": "John Bowers. 2012. The logic of annotated portfolios: communicating the value of ’research through design’. In Proceedings of the Designing Interactive Systems Conference (2012-06-11) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 68–77. https://doi.org/10.1145/2317956.2317968",
      "doi": "10.1145/2317956.2317968"
    },
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2008-04-06) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 423–432. https://doi.org/10.1145/1357054.1357123",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the wild: how hardware’s long tail is supporting new engineering and design communities. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (2010-08-16) (DIS ’10). Association for Computing Machinery, New York, NY, USA, 199–207. https://doi.org/10.1145/1858171.1858206",
      "doi": "10.1145/1858171.1858206"
    },
    {
      "text": "SparkFun Electronics. 2022. SparkFun Electronics. SparkFun Electronics. https://www.sparkfun.com/",
      "doi": ""
    },
    {
      "text": "MIT’s Center for Bits and Atoms. 2022. HTMAA 2022. https://fab.cba.mit.edu/classes/MAS.863/",
      "doi": ""
    },
    {
      "text": "Micro:bit Educational Foundation. 2022. Micro:bit Educational Foundation. Micro:bit Educational Foundation. https://microbit.org/",
      "doi": ""
    },
    {
      "text": "Raspberry Pi Foundation. 2022. Teach, learn, and make with the Raspberry Pi Foundation. Raspberry Pi Foundation. https://www.raspberrypi.org/",
      "doi": ""
    },
    {
      "text": "Mikhaila Friske, Shanel Wu, and Laura Devendorf. 2019. AdaCAD: Crafting Software For Smart Textiles Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019-05-02) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300575",
      "doi": "10.1145/3290605.3300575"
    },
    {
      "text": "S. Garrido-Jurado, R. Muñoz-Salinas, F.J. Madrid-Cuevas, and M.J. Marín-Jiménez. 2014. Automatic generation and detection of highly reliable fiducial markers under occlusion. Pattern Recognition 47, 6 (2014), 2280–2292. https://doi.org/10.1016/j.patcog.2014.01.005",
      "doi": "10.1016/j.patcog.2014.01.005"
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated portfolios. Interactions 19, 4 (2012), 40–49. https://doi.org/10.1145/2212877.2212889",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "William Gaver. 2012. What Should We Expect from Research through Design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 937–946. https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Shad Gross, Jeffrey Bardzell, and Shaowen Bardzell. 2014. Structures, forms, and stuff: the materiality and medium of interaction. Personal and Ubiquitous Computing 18, 3 (2014), 637–649. https://doi.org/10.1007/s00779-013-0689-4",
      "doi": "10.1007/s00779-013-0689-4"
    },
    {
      "text": "Kate Hartman, Emma Westecott, Izzie Colpitts-Campbell, Jennie Robinson Faber, Yiyi Shao, Chris Luginbuhl, Olivia Prior, and Manisha Laroia. 2021. Textile Game Controllers: Exploring Affordances of E-Textile Techniques as Applied to Alternative Game Controllers. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (2021-02-14) (TEI ’21). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3430524.3446069",
      "doi": "10.1145/3430524.3446069"
    },
    {
      "text": "Sabrina Hauser, Doenja Oogjes, Ron Wakkary, and Peter-Paul Verbeek. 2018. An Annotated Portfolio on Doing Postphenomenology Through Research Products. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 459–471. https://doi.org/10.1145/3196709.3196745",
      "doi": "10.1145/3196709.3196745"
    },
    {
      "text": "Cindy E. Hmelo and Mark Guzdial. 1996. Of black and glass boxes: scaffolding for doing and learning. In Proceedings of the 1996 international conference on Learning sciences (1996-07-25) (ICLS ’96). International Society of the Learning Sciences, Evanston, Illinois, 128–134.",
      "doi": ""
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Transactions on Computer-Human Interaction 19, 3(2012), 23:1–23:18. https://doi.org/10.1145/2362364.2362371",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Lee Jones. 2021. The E-darning Sampler: Exploring E-textile Repair with Darning Looms. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (2021-02-14) (TEI ’21). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/3430524.3444700",
      "doi": "10.1145/3430524.3444700"
    },
    {
      "text": "Martin Kaltenbrunner and Ross Bencina. 2007. reacTIVision: a computer-vision framework for table-based tangible interaction. In Proceedings of the 1st international conference on Tangible and embedded interaction (2007-02-15) (TEI ’07). Association for Computing Machinery, New York, NY, USA, 69–74. https://doi.org/10.1145/1226969.1226983",
      "doi": "10.1145/1226969.1226983"
    },
    {
      "text": "Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015-04-18) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2161–2170. https://doi.org/10.1145/2702123.2702414",
      "doi": "10.1145/2702123.2702414"
    },
    {
      "text": "Youn-Kyung Lim, Erik Stolterman, and Josh Tenenberg. 2008. The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas. ACM Transactions on Computer-Human Interaction 15, 2(2008), 7:1–7:27. https://doi.org/10.1145/1375761.1375762",
      "doi": "10.1145/1375761.1375762"
    },
    {
      "text": "Jonas Löwgren. 2013. Annotated Portfolios and Other Forms of Intermediate-Level Knowledge. Interactions 20, 1 (jan 2013), 30–34. https://doi.org/10.1145/2405716.2405725",
      "doi": "10.1145/2405716.2405725"
    },
    {
      "text": "F. Martin, B. Mikhak, and B. Silverman. 2000. MetaCricket: A designer’s kit for making computational devices. IBM Systems Journal 39, 3 (2000), 795–815. https://doi.org/10.1147/sj.393.0795",
      "doi": "10.1147/sj.393.0795"
    },
    {
      "text": "David A. Mellis, Sam Jacoby, Leah Buechley, Hannah Perner-Wilson, and Jie Qi. 2013. Microcontrollers as material: crafting circuits with paper, conductive ink, electronic components, and an \"untoolkit\". In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (2013-02-10) (TEI ’13). Association for Computing Machinery, New York, NY, USA, 83–90. https://doi.org/10.1145/2460625.2460638",
      "doi": "10.1145/2460625.2460638"
    },
    {
      "text": "Dave Murray-Rust, Chris Elsden, Bettina Nissen, Ella Tallyn, Larissa Pschetz, and Chris Speed. 2022. Blockchain and Beyond: Understanding Blockchains through Prototypes and Public Engagement. ACM Trans. Comput.-Hum. Interact. (feb 2022). https://doi.org/10.1145/3503462 Just Accepted.",
      "doi": "10.1145/3503462"
    },
    {
      "text": "Nintendo. 2022. Create new ways to play with Nintendo Labo!Nintendo. https://www.nintendo.co.uk/Nintendo-Labo/Nintendo-Labo-1328637.html",
      "doi": ""
    },
    {
      "text": "Edwin Olson. 2011. AprilTag: A robust and flexible visual fiducial system. In 2011 IEEE international conference on robotics and automation. IEEE, IEEE, New York, NY, USA, 3400–3407.",
      "doi": ""
    },
    {
      "text": "OpenCV. 2022. OpenCV. OpenCV. https://opencv.org/",
      "doi": ""
    },
    {
      "text": "Dan O’Sullivan and Tom Igoe. 2004. Physical Computing: Sensing and Controlling the Physical World with Computers. Course Technology Press, Boston, MA, United States.",
      "doi": ""
    },
    {
      "text": "Irene Posch and Ebru Kurbak. 2016. CRAFTED LOGIC Towards Hand-Crafting a Computer. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (2016-05-07) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 3881–3884. https://doi.org/10.1145/2851581.2891101",
      "doi": "10.1145/2851581.2891101"
    },
    {
      "text": "Jie Qi and Leah Buechley. 2014. Sketching in circuits: designing and building electronics on paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2014-04-26) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1713–1722. https://doi.org/10.1145/2556288.2557391",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Mitchel Resnick and Eric Rosenbaum. 2013. Designing for Tinkerability. In Design, Make, Play. Routledge, Abingdon, Oxfordshire, UK.",
      "doi": ""
    },
    {
      "text": "Erica Robles and Mikael Wiberg. 2010. Texturing the \"material turn\" in interaction design. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (2010-01-24) (TEI ’10). Association for Computing Machinery, New York, NY, USA, 137–144. https://doi.org/10.1145/1709886.1709911",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: embedded single-camera sensing of printed physical user interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology (2013-10-08) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 447–456. https://doi.org/10.1145/2501988.2501992",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B. Goldman, Gautham Mysore, and Wilmot Li. 2015. Lamello: Passive Acoustic Sensing for Tangible Input Components. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015-04-18) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1277–1280. https://doi.org/10.1145/2702123.2702207",
      "doi": "10.1145/2702123.2702207"
    },
    {
      "text": "Donald A. Schon and Glenn Wiggins. 1992. Kinds of seeing and their functions in designing. Design Studies 13, 2 (1992), 135–156. https://doi.org/10.1016/0142-694X(92)90268-F",
      "doi": ""
    },
    {
      "text": "D.A. Schön. 1992. Designing as reflective conversation with the materials of a design situation. Knowledge-Based Systems 5, 1 (1992), 3–14. https://doi.org/10.1016/0950-7051(92)90020-G Artificial Intelligence in Design Conference 1991 Special Issue.",
      "doi": "10.1016/0950-7051%2892%2990020-G"
    },
    {
      "text": "Michael Shorter, Jon Rogers, and John McGhee. 2014. Practical notes on paper circuits. In Proceedings of the 2014 conference on Designing interactive systems (2014-06-21) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 483–492. https://doi.org/10.1145/2598510.2602965",
      "doi": "10.1145/2598510.2602965"
    },
    {
      "text": "Cesar Torres, Jessica Chang, Advaita Patel, and Eric Paulos. 2019. Phosphenes: Crafting Resistive Heaters within Thermoreactive Composites. In Proceedings of the 2019 on Designing Interactive Systems Conference (2019-06-18) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 907–919. https://doi.org/10.1145/3322276.3322375",
      "doi": "10.1145/3322276.3322375"
    },
    {
      "text": "Vasiliki Tsaknaki, Pedro Sanches, Tom Jenkins, Noura Howell, Laurens Boer, and Afroditi Bitzouni. 2022. Fabulating Biodata Futures for Living and Knowing Together. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 1878–1892. https://doi.org/10.1145/3532106.3533477",
      "doi": "10.1145/3532106.3533477"
    },
    {
      "text": "New York University. 2022. ITP Physical Computing. https://itp.nyu.edu/physcomp/",
      "doi": ""
    },
    {
      "text": "Anna Vallgårda and Johan Redström. 2007. Computational composites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2007-04-29) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 513–522. https://doi.org/10.1145/1240624.1240706",
      "doi": "10.1145/1240624.1240706"
    },
    {
      "text": "Aaron Visschedijk, Hyunyoung Kim, Carlos Tejada, and Daniel Ashbrook. 2022. ClipWidgets: 3D-printed Modular Tangible UI Extensions for Smartphones. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction (2022-02-13) (TEI ’22). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3490149.3501314",
      "doi": "10.1145/3490149.3501314"
    },
    {
      "text": "Malte Weiss, Julie Wagner, Yvonne Jansen, Roger Jennings, Ramsin Khoshabeh, James D. Hollan, and Jan Borchers. 2009. SLAP widgets: bridging the gap between virtual and physical controls on tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2009-04-04) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 481–490. https://doi.org/10.1145/1518701.1518779",
      "doi": "10.1145/1518701.1518779"
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2018. Pulp Nonfiction: Low-Cost Touch Tracking for Paper. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018-04-19). ACM, Montreal QC Canada, 1–11. https://doi.org/10.1145/3173574.3173691",
      "doi": "10.1145/3173574.3173691"
    },
    {
      "text": "Clement Zheng, Peter Gyory, and Ellen Yi-Luen Do. 2020. Tangible Interfaces with Printed Paper Markers. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (2020-07-03) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 909–923. https://doi.org/10.1145/3357236.3395578",
      "doi": "10.1145/3357236.3395578"
    },
    {
      "text": "Clement Zheng, HyunJoo Oh, Laura Devendorf, and Ellen Yi-Luen Do. 2019. Sensing Kirigami. In Proceedings of the 2019 on Designing Interactive Systems Conference (2019-06-18) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 921–934. https://doi.org/10.1145/3322276.3323689",
      "doi": "10.1145/3322276.3323689"
    }
  ]
}