{
  "doi": "10.1145/3544548.3581494",
  "title": "AVscript: Accessible Video Editing with Audio-Visual Scripts",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Sighted and blind and low vision (BLV) creators alike use videos to communicate with broad audiences. Yet, video editing remains inaccessible to BLV creators. Our formative study revealed that current video editing tools make it difficult to access the visual content, assess the visual quality, and efficiently navigate the timeline. We present  AVscript, an accessible text-based video editor.  AVscript enables users to edit their video using a script that embeds the video’s visual content, visual errors (e.g., dark or blurred footage), and speech. Users can also efficiently navigate between scenes and visual errors or locate objects in the frame or spoken words of interest. A comparison study (N=12) showed that  AVscript significantly lowered BLV creators’ mental demands while increasing confidence and independence in video editing. We further demonstrate the potential of  AVscript through an exploratory study (N=3) where BLV creators edited their own footage.",
  "authors": [
    {
      "name": "Mina Huh",
      "institution": "Department of Computer Science, University of Texas, Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700740",
      "orcid": "0000-0002-0031-9180"
    },
    {
      "name": "Saelyne Yang",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528111",
      "orcid": "0000-0003-1776-4712"
    },
    {
      "name": "Yi-Hao Peng",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99659261824/rel-imgonly/me_hci_2.png",
      "acmid": "99659261824",
      "orcid": "0000-0002-6335-5904"
    },
    {
      "name": "Xiang 'Anthony' Chen",
      "institution": "HCI Research, UCLA, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659468135",
      "orcid": "0000-0002-8527-1744"
    },
    {
      "name": "Young-Ho Kim",
      "institution": "NAVER AI Lab, Korea, Republic of",
      "img": "/do/10.1145/contrib-99659022154/rel-imgonly/kim_portrait_2021.jpg",
      "acmid": "99659022154",
      "orcid": "0000-0002-2681-2774"
    },
    {
      "name": "Amy Pavel",
      "institution": "Department of Computer Science, University of Texas, Austin, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87258908457",
      "orcid": "0000-0002-3908-4366"
    }
  ],
  "references": [
    {
      "text": "3PlayMedia. 2021. 3PlayMedia. https://www.3playmedia.com/",
      "doi": ""
    },
    {
      "text": "Dustin Adams, Sri Kurniawan, Cynthia Herrera, Veronica Kang, and Natalie Friedman. 2016. Blind photographers and VizSnap: A long-term study. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. 201–208.",
      "doi": "10.1145/2982142.2982169"
    },
    {
      "text": "Dustin Adams, Lourdes Morales, and Sri Kurniawan. 2013. A qualitative study to support a blind photography mobile application. In Proceedings of the 6th International Conference on PErvasive Technologies Related to Assistive Environments. 1–8.",
      "doi": "10.1145/2504335.2504360"
    },
    {
      "text": "Adobe. 2022 (accessed Dec 13, 2022). Premiere Pro. https://www.adobe.com/products/premiere.html",
      "doi": ""
    },
    {
      "text": "Faisal Ahmed, Yevgen Borodin, Yury Puzis, and IV Ramakrishnan. 2012. Why read if you can skim: towards enabling faster screen reading. In Proceedings of the International Cross-Disciplinary Conference on Web Accessibility. 1–10.",
      "doi": "10.1145/2207016.2207052"
    },
    {
      "text": "Apple. 2022 (accessed Dec 13, 2022). Final Cut Pro. https://www.apple.com/final-cut-pro/",
      "doi": ""
    },
    {
      "text": "Mauro Avila, Francisco Kiss, Ismael Rodriguez, Albrecht Schmidt, and Tonja Machulla. 2018. Tactile sheets: using engraved paper overlays to facilitate access to a digital document’s layout and logical structure. In Proceedings of the 11th PErvasive Technologies Related to Assistive Environments Conference. 165–169.",
      "doi": "10.1145/3197768.3201530"
    },
    {
      "text": "Cynthia L Bennett, Jane E, Martez E Mott, Edward Cutrell, and Meredith Ringel Morris. 2018. How teens with visual impairments take, edit, and share photos on social media. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Floraine Berthouzoz, Wilmot Li, and Maneesh Agrawala. 2012. Tools for Placing Cuts and Transitions in Interview Video. ACM Transactions on Graphics 31, 4, Article 67 (jul 2012), 8 pages. https://doi.org/10.1145/2185520.2185563",
      "doi": "10.1145/2185520.2185563"
    },
    {
      "text": "Erin L Brady, Yu Zhong, Meredith Ringel Morris, and Jeffrey P Bigham. 2013. Investigating the appropriateness of social network question asking as a resource for blind users. In Proceedings of the 2013 conference on Computer supported cooperative work. 1225–1236.",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, 2020. Language models are few-shot learners. Advances in neural information processing systems 33 (2020), 1877–1901.",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Mina Huh, and Juho Kim. 2021. RubySlippers: Supporting Content-Based Voice Navigation for How-to Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 97, 14 pages. https://doi.org/10.1145/3411764.3445131",
      "doi": "10.1145/3411764.3445131"
    },
    {
      "text": "Pei-Yu Chi, Sally Ahn, Amanda Ren, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2012. MixT: Automatic Generation of Step-by-Step Mixed Media Tutorials. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 93–102. https://doi.org/10.1145/2380116.2380130",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Pei-Yu Chi, Joyce Liu, Jason Linder, Mira Dontcheva, Wilmot Li, and Bjoern Hartmann. 2013. DemoCut: Generating Concise Instructional Videos for Physical Demonstrations. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 141–150. https://doi.org/10.1145/2501988.2502052",
      "doi": "10.1145/2501988.2502052"
    },
    {
      "text": "Maitraye Das, Thomas Barlow McHugh, Anne Marie Piper, and Darren Gergle. 2022. Co11ab: Augmenting Accessibility in Synchronous Collaborative Writing for People with Vision Impairments. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3491102.3501918"
    },
    {
      "text": "Descript. 2022 (accessed Sep 6, 2022). Descript. https://www.descript.com/",
      "doi": ""
    },
    {
      "text": "Colorado State University Extension. 2022 (accessed Dec 12, 2022). A friendly guide to video production 2020. https://extension.colostate.edu/docs/comm/video-handbook2.pdf",
      "doi": ""
    },
    {
      "text": "[18] Facebook.2022 (accessed Dec 12, 2022). https://draftjs.org/",
      "doi": ""
    },
    {
      "text": "C. Ailie Fraser, Joy O. Kim, Hijung Valentina Shin, Joel Brandt, and Mira Dontcheva. 2020. Temporal Segmentation of Creative Live Streams. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376437",
      "doi": "10.1145/3313831.3376437"
    },
    {
      "text": "Ohad Fried, Ayush Tewari, Michael Zollhöfer, Adam Finkelstein, Eli Shechtman, Dan B Goldman, Kyle Genova, Zeyu Jin, Christian Theobalt, and Maneesh Agrawala. 2019. Text-Based Editing of Talking-Head Video. ACM Transactions on Graphics 38, 4, Article 68 (jul 2019), 14 pages. https://doi.org/10.1145/3306346.3323028",
      "doi": "10.1145/3306346.3323028"
    },
    {
      "text": "Google. 2022. Firebase. https://firebase.google.com/.",
      "doi": ""
    },
    {
      "text": "Rae Green. 2020. College Life...As A Blind Girl!https://www.youtube.com/watch?v=EFbU7g7dbp0",
      "doi": ""
    },
    {
      "text": "Ijaz Ul Haq, Khan Muhammad, Tanveer Hussain, Soonil Kwon, Maleerat Sodanil, Sung Wook Baik, and Mi Young Lee. 2019. Movie scene segmentation using object detection and set theory. International Journal of Distributed Sensor Networks 15, 6 (2019), 1550147719845277.",
      "doi": ""
    },
    {
      "text": "Rex Hartson and Pardha S Pyla. 2012. The UX Book: Process and guidelines for ensuring a quality user experience. Elsevier.",
      "doi": "10.5555/2207824"
    },
    {
      "text": "Karen Holtzblatt and Hugh Beyer. 1997. Contextual design: defining customer-centered systems. Elsevier.",
      "doi": ""
    },
    {
      "text": "Wenyi Hong, Ming Ding, Wendi Zheng, Xinghan Liu, and Jie Tang. 2022. CogVideo: Large-scale Pretraining for Text-to-Video Generation via Transformers. arXiv preprint arXiv:2205.15868(2022).",
      "doi": ""
    },
    {
      "text": "Matthew Honnibal, Ines Montani, Sofie Van Landeghem, and Adriane Boyd. 2020. spaCy: Industrial-strength Natural Language Processing in Python. (2020). https://doi.org/10.5281/zenodo.1212303",
      "doi": ""
    },
    {
      "text": "Bernd Huber, Hijung Valentina Shin, Bryan Russell, Oliver Wang, and Gautham J. Mysore. 2019. B-Script: Transcript-Based B-Roll Video Editing with Recommendations. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300311",
      "doi": "10.1145/3290605.3300311"
    },
    {
      "text": "Mina Huh, YunJung Lee, Dasom Choi, Haesoo Kim, Uran Oh, and Juho Kim. 2022. Cocomix: Utilizing Comments to Improve Non-Visual Webtoon Accessibility. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3491102.3502081"
    },
    {
      "text": "Imvidu. 2022 (accessed Sep 6, 2022). Imvidu. https://imvidu.com/",
      "doi": ""
    },
    {
      "text": "The Smith-Kettlewell Eye Research Institute. 2019. YouDescribe.com. https://youdescribe.org/.",
      "doi": ""
    },
    {
      "text": "Harsh Jhamtani and Taylor Berg-Kirkpatrick. 2018. Learning to describe differences between pairs of similar images. arXiv preprint arXiv:1808.10584(2018).",
      "doi": ""
    },
    {
      "text": "Juho Kim, Philip J. Guo, Carrie J. Cai, Shang-Wen (Daniel) Li, Krzysztof Z. Gajos, and Robert C. Miller. 2014. Data-Driven Interaction Techniques for Improving Navigation of Educational Videos. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 563–572. https://doi.org/10.1145/2642918.2647389",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Juho Kim, Phu Tran Nguyen, Sarah Weir, Philip J. Guo, Robert C. Miller, and Krzysztof Z. Gajos. 2014. Crowdsourcing Step-by-Step Information Extraction to Enhance Existing How-to Videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 4017–4026. https://doi.org/10.1145/2556288.2556986",
      "doi": "10.1145/2556288.2556986"
    },
    {
      "text": "Young-Ho Kim, Bongshin Lee, Arjun Srinivasan, and Eun Kyoung Choe. 2021. Data@ hand: Fostering visual exploration of personal data on smartphones leveraging speech and touch interaction. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3411764.3445421"
    },
    {
      "text": "Martin Kurze. 1996. TDraw: a computer-based tactile drawing tool for blind people. In Proceedings of the second Annual ACM Conference on Assistive technologies. 131–138.",
      "doi": "10.1145/228347.228368"
    },
    {
      "text": "TTU English Department Media Lab. 2022 (accessed Dec 12, 2022). Video editing and screencast guide best practices. https://www.deauthor=pts.ttu.edu/english/student_involvement/labs_studios/media_lab/events/workshop_pdfs/vide-editing-guide.pdf",
      "doi": ""
    },
    {
      "text": "Mackenzie Leake, Abe Davis, Anh Truong, and Maneesh Agrawala. 2017. Computational Video Editing for Dialogue-Driven Scenes. ACM Transactions on Graphics 36, 4, Article 130 (jul 2017), 14 pages. https://doi.org/10.1145/3072959.3073653",
      "doi": "10.1145/3072959.3073653"
    },
    {
      "text": "Cheuk Yin Phipson Lee, Zhuohao Zhang, Jaylin Herskovitz, JooYoung Seo, and Anhong Guo. CHI 2022. CollabAlly: Accessible Collaboration Awareness in Document Editing. (CHI 2022).",
      "doi": ""
    },
    {
      "text": "Franklin Mingzhe Li, Jamie Dorst, Peter Cederberg, and Patrick Carrington. 2021. Non-Visual Cooking: Exploring Practices and Challenges of Meal Preparation by People with Visual Impairments. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. 1–11.",
      "doi": "10.1145/3441852.3471215"
    },
    {
      "text": "Franklin Mingzhe Li, Franchesca Spektor, Meng Xia, Mina Huh, Peter Cederberg, Yuqi Gong, Kristen Shinohara, and Patrick Carrington. 2022. “It Feels Like Taking a Gamble”: Exploring Perceptions, Practices, and Challenges of Using Makeup and Cosmetics for People with Visual Impairments. In CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    },
    {
      "text": "Jingyi Li, Son Kim, Joshua A Miele, Maneesh Agrawala, and Sean Follmer. 2019. Editing spatial layouts through tactile templates for people with visual impairments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300436"
    },
    {
      "text": "Junnan Li, Dongxu Li, Caiming Xiong, and Steven Hoi. 2022. Blip: Bootstrapping language-image pre-training for unified vision-language understanding and generation. arXiv preprint arXiv:2201.12086(2022).",
      "doi": ""
    },
    {
      "text": "Ching Liu, Juho Kim, and Hao-Chuan Wang. 2018. ConceptScape: Collaborative Concept Mapping for Video Learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173961",
      "doi": "10.1145/3173574.3173961"
    },
    {
      "text": "Xingyu Liu, Patrick Carrington, Xiang ’Anthony’ Chen, and Amy Pavel. 2021. What Makes Videos Accessible to Blind and Visually Impaired People?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–4.",
      "doi": "10.1145/3411764.3445233"
    },
    {
      "text": "Xingyu Liu, Ruolin Wang, Dingzeyu Li, Xiang’Anthony’ Chen, and Amy Pavel. UIST 2022. CrossA11y: Identifying Video Accessibility Issues via Cross-modal Grounding.",
      "doi": ""
    },
    {
      "text": "Antonio Manriquez and Thomas Mccluskey. 2022 (accessed Dec 12, 2022). Video production 101 - delivering the message. https://ptgmedia.pearsoncmg.com/images/9780321990198/samplepages/9780321990198.pdf",
      "doi": ""
    },
    {
      "text": "Gerald Millerson and Owens Jim. 2022 (accessed Dec 12, 2022). Video production handbook fourth edition. https://digitalmindsphotography.files.wordpress.com/2020/05/video-production-handbook-fourth-edition.pdf",
      "doi": ""
    },
    {
      "text": "Rosiana Natalie, Ebrima Jarjue, Hernisa Kacorri, and Kotaro Hara. 2020. ViScene: A Collaborative Authoring Tool for Scene Descriptions in Videos. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–4.",
      "doi": ""
    },
    {
      "text": "Ashley Nemeth. 2016. How Blind Mom Cooks. https://www.youtube.com/watch?v=ZaQtx54N6iU",
      "doi": ""
    },
    {
      "text": "Ashley Nemeth. 2020. Day In The Life Blind Mom. https://www.youtube.com/watch?v=YCF5LVGfGJE",
      "doi": ""
    },
    {
      "text": "Alex Nichol, Prafulla Dhariwal, Aditya Ramesh, Pranav Shyam, Pamela Mishkin, Bob McGrew, Ilya Sutskever, and Mark Chen. 2021. Glide: Towards photorealistic image generation and editing with text-guided diffusion models. arXiv preprint arXiv:2112.10741(2021).",
      "doi": ""
    },
    {
      "text": "National Conference of State Legislatures. 2022 (accessed Dec 12, 2022). NCSL Video editing guideline.",
      "doi": ""
    },
    {
      "text": "Amy Pavel, Dan B. Goldman, Björn Hartmann, and Maneesh Agrawala. 2015. SceneSkim: Searching and Browsing Movies Using Synchronized Captions, Scripts and Plot Summaries. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 181–190. https://doi.org/10.1145/2807442.2807502",
      "doi": "10.1145/2807442.2807502"
    },
    {
      "text": "Amy Pavel, Dan B. Goldman, Björn Hartmann, and Maneesh Agrawala. 2016. VidCrit: Video-Based Asynchronous Video Review. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 517–528. https://doi.org/10.1145/2984511.2984552",
      "doi": "10.1145/2984511.2984552"
    },
    {
      "text": "Amy Pavel, Colorado Reed, Björn Hartmann, and Maneesh Agrawala. 2014. Video Digests: A Browsable, Skimmable Format for Informational Lecture Videos. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 573–582. https://doi.org/10.1145/2642918.2647400",
      "doi": "10.1145/2642918.2647400"
    },
    {
      "text": "Amy Pavel, Gabriel Reyes, and Jeffrey P. Bigham. 2020. Rescribe: Authoring and Automatically Editing Audio Descriptions. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 747–759. https://doi.org/10.1145/3379337.3415864",
      "doi": "10.1145/3379337.3415864"
    },
    {
      "text": "José Luis Pech-Pacheco, Gabriel Cristóbal, Jesús Chamorro-Martinez, and Joaquín Fernández-Valdivia. 2000. Diatom autofocusing in brightfield microscopy: a comparative study. In Proceedings 15th International Conference on Pattern Recognition. ICPR-2000, Vol. 3. IEEE, 314–317.",
      "doi": ""
    },
    {
      "text": "Yi-Hao Peng, Jeffrey P Bigham, and Amy Pavel. 2021. Slidecho: Flexible Non-Visual Exploration of Presentation Videos. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. 1–12.",
      "doi": ""
    },
    {
      "text": "Yi-Hao Peng, JiWoong Jang, Jeffrey P Bigham, and Amy Pavel. 2021. Say It All: Feedback for Improving Non-Visual Presentation Accessibility. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445572"
    },
    {
      "text": "Yi-Hao Peng, Jason Wu, Jeffrey P. Bigham, and Amy Pavel. 2022. Diffscriber: Describing Visual Design Changes to Support Mixed-ability Collaborative Presentation Authoring. In Proceedings of the 35rd Annual ACM Symposium on User Interface Software and Technology (Bend, Oregon, USA) (UIST ’22). Association for Computing Machinery, New York, NY, USA.",
      "doi": "10.1145/3526113.3545637"
    },
    {
      "text": "Aditya Ramesh, Prafulla Dhariwal, Alex Nichol, Casey Chu, and Mark Chen. 2022. Hierarchical text-conditional image generation with clip latents. arXiv preprint arXiv:2204.06125(2022).",
      "doi": ""
    },
    {
      "text": "Reduct.Video. 2022 (accessed Sep 6, 2022). Reduct.Video. https://reduct.video/",
      "doi": ""
    },
    {
      "text": "Remotion.dev. 2022 (accessed Dec 12, 2022). Remotion: Make videos programmatically in react. https://www.remotion.dev/",
      "doi": ""
    },
    {
      "text": "Steve Rubin, Floraine Berthouzoz, Gautham J Mysore, Wilmot Li, and Maneesh Agrawala. 2013. Content-based tools for editing audio stories. In Proceedings of the 26th annual ACM symposium on User interface software and technology. 113–122.",
      "doi": "10.1145/2501988.2501993"
    },
    {
      "text": "A. Rudnicky. 2021. cmu sphinx knowledge base tool version 3. http://www.speech.cs.cmu.edu/tools/lmtool-new.html",
      "doi": ""
    },
    {
      "text": "Abir Saha and Anne Marie Piper. 2020. Understanding audio production practices of people with vision impairments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–13.",
      "doi": "10.1145/3373625.3416993"
    },
    {
      "text": "Chitwan Saharia, William Chan, Saurabh Saxena, Lala Li, Jay Whang, Emily Denton, Seyed Kamyar Seyed Ghasemipour, Burcu Karagol Ayan, S Sara Mahdavi, Rapha Gontijo Lopes, 2022. Photorealistic Text-to-Image Diffusion Models with Deep Language Understanding. arXiv preprint arXiv:2205.11487(2022).",
      "doi": ""
    },
    {
      "text": "José Francisco Saray Villamizar, Benoît Encelle, Yannick Prié, and Pierre-Antoine Champin. 2011. An adaptive videos enrichment system based on decision trees for people with sensory disabilities. In Proceedings of the International Cross-Disciplinary Conference on Web Accessibility. 1–4.",
      "doi": "10.1145/1969289.1969299"
    },
    {
      "text": "Anastasia Schaadhardt, Alexis Hiniker, and Jacob O Wobbrock. 2021. Understanding Blind Screen-Reader Users’ Experiences of Digital Artboards. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445242"
    },
    {
      "text": "Woosuk Seo and Hyunggu Jung. 2021. Understanding the community of blind or visually impaired vloggers on YouTube. Universal Access in the Information Society 20, 1 (2021), 31–44.",
      "doi": "10.1007/s10209-019-00706-6"
    },
    {
      "text": "Lei Shi, Yuhang Zhao, Ricardo Gonzalez Penuela, Elizabeth Kupferstein, and Shiri Azenkot. 2020. Molder: an accessible design tool for tactile maps. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376431"
    },
    {
      "text": "Hijung Valentina Shin, Wilmot Li, and Frédo Durand. 2016. Dynamic Authoring of Audio with Linked Scripts. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 509–516. https://doi.org/10.1145/2984511.2984561",
      "doi": "10.1145/2984511.2984561"
    },
    {
      "text": "Arjun Srinivasan, Bongshin Lee, Nathalie Henry Riche, Steven M. Drucker, and Ken Hinckley. 2020. InChorus: Designing Consistent Multimodal Interactions for Data Visualization on Tablet Devices. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376782",
      "doi": "10.1145/3313831.3376782"
    },
    {
      "text": "Arjun Srinivasan, Bongshin Lee, and John T. Stasko. 2020. Interweaving Multimodal Interaction with Flexible Unit Visualizations for Data Exploration. IEEE Transactions on Visualization and Computer Graphics 0, 0(2020), 15 pages pages. https://doi.org/10.1109/TVCG.2020.2978050 (Early access).",
      "doi": "10.1109/TVCG.2020.2978050"
    },
    {
      "text": "Arjun Srinivasan and John Stasko. 2018. Orko: Facilitating Multimodal Interaction for Visual Exploration and Analysis of Networks. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan. 2018), 511–521. https://doi.org/10.1109/TVCG.2017.2745219",
      "doi": ""
    },
    {
      "text": "Yu-Chuan Su, Dinesh Jayaraman, and Kristen Grauman. 2016. Pano2Vid: Automatic Cinematography for Watching 360 Videos. In Asian Conference on Computer Vision. Springer, 154–171.",
      "doi": ""
    },
    {
      "text": "Bright Trip. 2022 (accessed Dec 12, 2022). Bright trip - How To Vlog. https://assets.ctfassets.net/bhsr3r63z25m/4hf7ysCBudTkv1N5SQCzgY/0b3546e2fdd77a6e72149a2eb26eb337/HOW-TO-VLOG-PDF.pdf",
      "doi": ""
    },
    {
      "text": "Anh Truong, Floraine Berthouzoz, Wilmot Li, and Maneesh Agrawala. 2016. QuickCut: An Interactive Tool for Editing Narrated Video. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 497–507. https://doi.org/10.1145/2984511.2984569",
      "doi": "10.1145/2984511.2984569"
    },
    {
      "text": "Anh Truong, Peggy Chi, David Salesin, Irfan Essa, and Maneesh Agrawala. 2021. Automatic Generation of Two-Level Hierarchical Tutorials from Instructional Makeup Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 108, 16 pages. https://doi.org/10.1145/3411764.3445721",
      "doi": "10.1145/3411764.3445721"
    },
    {
      "text": "Lourdes M Morales Villaverde. 2014. Facilitating blind people to independently format their documents. ACM SIGACCESS Accessibility and Computing108 (2014), 38–41.",
      "doi": ""
    },
    {
      "text": "W3C Web Accessibility Initiative (WAI). 2022 (accessed Dec 12, 2022). Introduction to web accessibility. https://www.w3.org/WAI/fundamentals/accessibility-intro/",
      "doi": ""
    },
    {
      "text": "Yujia Wang, Wei Liang, Haikun Huang, Yongqi Zhang, Dingzeyu Li, and Lap-Fai Yu. CHI 2021. Toward Automatic Audio Description Generation for Accessible Videos.",
      "doi": ""
    },
    {
      "text": "Saelyne Yang, Jisu Yim, Juho Kim, and Hijung Valentina Shin. 2022. CatchLive: Real-Time Summarization of Live Streams with Stream Content and Interaction Data. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 500, 20 pages. https://doi.org/10.1145/3491102.3517461",
      "doi": "10.1145/3491102.3517461"
    },
    {
      "text": "Kai Zhang, Lawrence H Kim, Yipeng Guo, and Sean Follmer. 2020. Automatic Generation of Spatial Tactile Effects by Analyzing Cross-modality Features of a Video. In Symposium on Spatial User Interaction. 1–10.",
      "doi": "10.1145/3385959.3418459"
    },
    {
      "text": "Xingyi Zhou, Rohit Girdhar, Armand Joulin, Philipp Krähenbühl, and Ishan Misra. 2022. Detecting Twenty-thousand Classes using Image-level Supervision. In ECCV.",
      "doi": ""
    }
  ]
}