{
  "doi": "10.1145/3544548.3581126",
  "title": "Beyond Instructions: A Taxonomy of Information Types in How-to Videos",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2023,
  "badges": [],
  "abstract": "How-to videos are rich in information—they not only give instructions but also provide justifications or descriptions. People seek different information to meet their needs, and identifying different types of information present in the video can improve access to the desired knowledge. Thus, we present a taxonomy of information types in how-to videos. Through an iterative open coding of 4k sentences in 48 videos, 21 information types under 8 categories emerged. The taxonomy represents diverse information types that instructors provide beyond instructions. We first show how our taxonomy can serve as an analytical framework for video navigation systems. Then, we demonstrate through a user study (n=9) how type-based navigation helps participants locate the information they needed. Finally, we discuss how the taxonomy enables a wide range of video-related tasks, such as video authoring, viewing, and analysis. To allow researchers to build upon our taxonomy, we release a dataset of 120 videos containing 9.9k sentences labeled using the taxonomy.",
  "authors": [
    {
      "name": "Saelyne Yang",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528111",
      "orcid": "0000-0003-1776-4712"
    },
    {
      "name": "Sangkyung Kwak",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782347",
      "orcid": "0000-0001-9145-5876"
    },
    {
      "name": "Juhoon Lee",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780869",
      "orcid": "0000-0003-0796-4227"
    },
    {
      "name": "Juho Kim",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    }
  ],
  "references": [
    {
      "text": "D.G. Altman. 1990. Practical Statistics for Medical Research. (1990). https://doi.org/10.1201/9780429258589",
      "doi": ""
    },
    {
      "text": "Microsoft Azure. 2022 (accessed Sep 14, 2022). Speech to text. https://azure.microsoft.com/en-us/services/cognitive-services/speech-to-text",
      "doi": ""
    },
    {
      "text": "Floraine Berthouzoz, Wilmot Li, and Maneesh Agrawala. 2012. Tools for Placing Cuts and Transitions in Interview Video. ACM Transactions on Graphics 31, 4, Article 67 (jul 2012), 8 pages. https://doi.org/10.1145/2185520.2185563",
      "doi": "10.1145/2185520.2185563"
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel Ziegler, Jeffrey Wu, Clemens Winter, Chris Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. In Advances in Neural Information Processing Systems, H. Larochelle, M. Ranzato, R. Hadsell, M.F. Balcan, and H. Lin (Eds.). Vol. 33. Curran Associates, Inc., 1877–1901. https://proceedings.neurips.cc/paper/2020/file/1457c0d6bfcb4967418bfb8ac142f64a-Paper.pdf",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Leonore V. Guillain, Hyeungshik Jung, Vivian M. Hare, Juho Kim, and Maneesh Agrawala. 2018. RecipeScape: An Interactive Tool for Analyzing Cooking Instructions at Scale. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174025",
      "doi": "10.1145/3173574.3174025"
    },
    {
      "text": "Minsuk Chang, Mina Huh, and Juho Kim. 2021. RubySlippers: Supporting Content-Based Voice Navigation for How-to Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 97, 14 pages. https://doi.org/10.1145/3411764.3445131",
      "doi": "10.1145/3411764.3445131"
    },
    {
      "text": "Minsuk Chang, Ben Lafreniere, Juho Kim, George Fitzmaurice, and Tovi Grossman. 2020. Workflow Graphs: A Computational Model of Collective Task Strategies for 3D Design Software. In Proceedings of Graphics Interface 2020(University of Toronto) (GI 2020). Canadian Human-Computer Communications Society / Socíeté canadienne du dialogue humain-machie, 114 – 124. https://doi.org/10.20380/GI2020.13",
      "doi": ""
    },
    {
      "text": "Minsuk Chang, Anh Truong, Oliver Wang, Maneesh Agrawala, and Juho Kim. 2019. How to Design Voice Based Navigation for How-To Videos. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300931",
      "doi": "10.1145/3290605.3300931"
    },
    {
      "text": "Hung-Tao Chen and Megan Thomas. 2020. Effects of lecture video styles on engagement and learning. Educational Technology Research and Development 68 (03 2020), 2147–2164. https://doi.org/10.1007/s11423-020-09757-6",
      "doi": ""
    },
    {
      "text": "Peggy Chi, Nathan Frey, Katrina Panovich, and Irfan Essa. 2021. Automatic Instructional Video Creation from a Markdown-Formatted Tutorial. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 677–690. https://doi.org/10.1145/3472749.3474778",
      "doi": "10.1145/3472749.3474778"
    },
    {
      "text": "Pei-Yu Chi, Sally Ahn, Amanda Ren, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2012. MixT: Automatic Generation of Step-by-Step Mixed Media Tutorials. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 93–102. https://doi.org/10.1145/2380116.2380130",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Pei-Yu Chi, Joyce Liu, Jason Linder, Mira Dontcheva, Wilmot Li, and Bjoern Hartmann. 2013. DemoCut: Generating Concise Instructional Videos for Physical Demonstrations. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 141–150. https://doi.org/10.1145/2501988.2502052",
      "doi": "10.1145/2501988.2502052"
    },
    {
      "text": "Konstantinos Chorianopoulos. 2018. A Taxonomy of Asynchronous Instructional Video Styles. The International Review of Research in Open and Distributed Learning 19, 1 (Feb. 2018). https://doi.org/10.19173/irrodl.v19i1.2920",
      "doi": ""
    },
    {
      "text": "Maureen Daum, Enhao Zhang, Dong He, Magdalena Balazinska, Brandon Haynes, Ranjay Krishna, Apryle Craig, and Aaron Wirsingn. 2022. VOCAL: Video Organization and Interactive Compositional AnaLytics. In The Conference on Innovative Data Systems Research (CIDR).",
      "doi": ""
    },
    {
      "text": "Descript. 2022 (accessed Sep 6, 2022). Descript. https://www.descript.com/",
      "doi": ""
    },
    {
      "text": "José Miguel Santos Espino. 2019. Anatomy of instructional videos: a systematic characterization of the structure of academic instructional videos.",
      "doi": ""
    },
    {
      "text": "Logan Fiorella and Richard E. Mayer. 2018. What Works and Doesn’t Work with Instructional Video. Comput. Hum. Behav. 89, C (dec 2018), 465–470. https://doi.org/10.1016/j.chb.2018.07.015",
      "doi": "10.1016/j.chb.2018.07.015"
    },
    {
      "text": "C. Ailie Fraser, Joy O. Kim, Hijung Valentina Shin, Joel Brandt, and Mira Dontcheva. 2020. Temporal Segmentation of Creative Live Streams. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376437",
      "doi": "10.1145/3313831.3376437"
    },
    {
      "text": "Daniel Fu, Will Crichton, James Hong, Xinwei Yao, Haotian Zhang, Anh Truong, Avanika Narayan, Maneesh Agrawala, Christopher Ré, and Kayvon Fatahalian. 2019. Rekall: Specifying Video Events using Compositions of Spatiotemporal Labels.",
      "doi": ""
    },
    {
      "text": "Philip J. Guo, Juho Kim, and Rob Rubin. 2014. How Video Production Affects Student Engagement: An Empirical Study of MOOC Videos. In Proceedings of the First ACM Conference on Learning @ Scale Conference (Atlanta, Georgia, USA) (L@S ’14). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/2556325.2566239",
      "doi": "10.1145/2556325.2566239"
    },
    {
      "text": "Tengda Han, Weidi Xie, and Andrew Zisserman. 2022. Temporal Alignment Network for long-term Video. In CVPR.",
      "doi": ""
    },
    {
      "text": "Bernd Huber, Hijung Valentina Shin, Bryan Russell, Oliver Wang, and Gautham J. Mysore. 2019. B-Script: Transcript-Based B-Roll Video Editing with Recommendations. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300311",
      "doi": "10.1145/3290605.3300311"
    },
    {
      "text": "Christina Ilioudi, Michail Giannakos, and Konstantinos Chorianopoulos. 2013. Investigating Differences among the Commonly Used Video Lecture Styles. https://doi.org/10.13140/2.1.3524.9284",
      "doi": ""
    },
    {
      "text": "Oana Inel, Nava Tintarev, and Lora Aroyo. 2020. Eliciting User Preferences for Personalized Explanations for Video Summaries. In Proceedings of the 28th ACM Conference on User Modeling, Adaptation and Personalization(Genoa, Italy) (UMAP ’20). Association for Computing Machinery, New York, NY, USA, 98–106. https://doi.org/10.1145/3340631.3394862",
      "doi": "10.1145/3340631.3394862"
    },
    {
      "text": "Haojian Jin, Yale Song, and Koji Yatani. 2017. ElasticPlay: Interactive Video Summarization with Dynamic Time Budgets. In Proceedings of the 25th ACM International Conference on Multimedia (Mountain View, California, USA) (MM ’17). Association for Computing Machinery, New York, NY, USA, 1164–1172. https://doi.org/10.1145/3123266.3123393",
      "doi": "10.1145/3123266.3123393"
    },
    {
      "text": "Kimia Kiani, George Cui, Andrea Bunt, Joanna McGrenere, and Parmit K. Chilana. 2019. Beyond \"One-Size-Fits-All\": Understanding the Diversity in How Software Newcomers Discover and Make Use of Help Resources. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300570",
      "doi": "10.1145/3290605.3300570"
    },
    {
      "text": "Juho Kim, Philip J. Guo, Carrie J. Cai, Shang-Wen (Daniel) Li, Krzysztof Z. Gajos, and Robert C. Miller. 2014. Data-Driven Interaction Techniques for Improving Navigation of Educational Videos. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 563–572. https://doi.org/10.1145/2642918.2647389",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Juho Kim, Phu Tran Nguyen, Sarah Weir, Philip J. Guo, Robert C. Miller, and Krzysztof Z. Gajos. 2014. Crowdsourcing Step-by-Step Information Extraction to Enhance Existing How-to Videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 4017–4026. https://doi.org/10.1145/2556288.2556986",
      "doi": "10.1145/2556288.2556986"
    },
    {
      "text": "Yoonjoo Lee, John Joon Young Chung, Tae Soo Kim, Jean Y Song, and Juho Kim. 2022. Promptiverse: Scalable Generation of Scaffolding Prompts Through Human-AI Hybrid Knowledge Graph Annotation. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 96, 18 pages. https://doi.org/10.1145/3491102.3502087",
      "doi": "10.1145/3491102.3502087"
    },
    {
      "text": "Jian Liao, Adnan Karim, Shivesh Singh Jadon, Rubaiat Habib Kazi, and Ryo Suzuki. 2022. RealityTalk: Real-Time Speech-Driven Augmented Presentation for AR Live Storytelling. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology (Bend, OR, USA) (UIST ’22). Association for Computing Machinery, New York, NY, USA, Article 17, 12 pages. https://doi.org/10.1145/3526113.3545702",
      "doi": "10.1145/3526113.3545702"
    },
    {
      "text": "Ching Liu, Juho Kim, and Hao-Chuan Wang. 2018. ConceptScape: Collaborative Concept Mapping for Video Learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173961",
      "doi": "10.1145/3173574.3173961"
    },
    {
      "text": "Xingyu Liu, Patrick Carrington, Xiang ’Anthony’ Chen, and Amy Pavel. 2021. What Makes Videos Accessible to Blind and Visually Impaired People?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 272, 14 pages. https://doi.org/10.1145/3411764.3445233",
      "doi": "10.1145/3411764.3445233"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2014. Video Lens: Rapid Playback and Exploration of Large Video Collections and Associated Metadata. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 541–550. https://doi.org/10.1145/2642918.2647366",
      "doi": "10.1145/2642918.2647366"
    },
    {
      "text": "Richard E. Mayer. 2005. Cognitive Theory of Multimedia Learning. Cambridge University Press, 31–48. https://doi.org/10.1017/CBO9780511816819.004",
      "doi": ""
    },
    {
      "text": "Antoine Miech, Jean-Baptiste Alayrac, Lucas Smaira, Ivan Laptev, Josef Sivic, and Andrew Zisserman. 2020. End-to-End Learning of Visual Representations From Uncurated Instructional Videos. 2020 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) (2020), 9876–9886.",
      "doi": ""
    },
    {
      "text": "Antoine Miech, Dimitri Zhukov, Jean-Baptiste Alayrac, Makarand Tapaswi, Ivan Laptev, and Josef Sivic. 2019. HowTo100M: Learning a Text-Video Embedding by Watching Hundred Million Narrated Video Clips. In ICCV.",
      "doi": ""
    },
    {
      "text": "Toni-Jan Keith Palma Monserrat, Shengdong Zhao, Kevin McGee, and Anshul Vikram Pandey. 2013. NoteVideo: Facilitating Navigation of Blackboard-Style Lecture Videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1139–1148. https://doi.org/10.1145/2470654.2466147",
      "doi": "10.1145/2470654.2466147"
    },
    {
      "text": "Matt Morain and Jason Swarts. 2012. YouTutorial: A Framework for Assessing Instructional Online Video. Technical Communication Quarterly 21, 1 (2012), 6–24. https://doi.org/10.1080/10572252.2012.626690 arXiv:https://doi.org/10.1080/10572252.2012.626690",
      "doi": ""
    },
    {
      "text": "Megha Nawhal, Jacqueline B. Lang, Greg Mori, and Parmit K. Chilana. 2019. VideoWhiz: Non-Linear Interactive Overviews for Recipe Videos. In Proceedings of the 45th Graphics Interface Conference on Proceedings of Graphics Interface 2019 (Kingston, Canada) (GI’19). Canadian Human-Computer Communications Society, Waterloo, CAN, Article 15, 8 pages. https://doi.org/10.20380/GI2019.15",
      "doi": "10.20380/GI2019.15"
    },
    {
      "text": "Robert Nickerson, Upkar Varshney, and Jan Muntermann. 2013. A Method for Taxonomy Development and its Application in Information Systems. European Journal of Information Systems 22 (05 2013). https://doi.org/10.1057/ejis.2012.26",
      "doi": ""
    },
    {
      "text": "Daulet Nurmanbetov. 2021. BERT-restore-punctuation model from huggingface. https://huggingface.co/felflare/bert-restore-punctuation",
      "doi": ""
    },
    {
      "text": "Ozlem Ozan and Yasin Ozarslan. 2016. Video lecture watching behaviors of learners in online courses. Educational Media International 53, 1 (2016), 27–41. https://doi.org/10.1080/09523987.2016.1189255 arXiv:https://doi.org/10.1080/09523987.2016.1189255",
      "doi": ""
    },
    {
      "text": "Amy Pavel, Dan B. Goldman, Björn Hartmann, and Maneesh Agrawala. 2015. SceneSkim: Searching and Browsing Movies Using Synchronized Captions, Scripts and Plot Summaries. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 181–190. https://doi.org/10.1145/2807442.2807502",
      "doi": "10.1145/2807442.2807502"
    },
    {
      "text": "Amy Pavel, Dan B. Goldman, Björn Hartmann, and Maneesh Agrawala. 2016. VidCrit: Video-Based Asynchronous Video Review. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 517–528. https://doi.org/10.1145/2984511.2984552",
      "doi": "10.1145/2984511.2984552"
    },
    {
      "text": "Amy Pavel, Colorado Reed, Björn Hartmann, and Maneesh Agrawala. 2014. Video Digests: A Browsable, Skimmable Format for Informational Lecture Videos. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 573–582. https://doi.org/10.1145/2642918.2647400",
      "doi": "10.1145/2642918.2647400"
    },
    {
      "text": "Yi-Hao Peng, JiWoong Jang, Jeffrey P Bigham, and Amy Pavel. 2021. Say It All: Feedback for Improving Non-Visual Presentation Accessibility. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 276, 12 pages. https://doi.org/10.1145/3411764.3445572",
      "doi": "10.1145/3411764.3445572"
    },
    {
      "text": "Suporn Pongnumkul, Mira Dontcheva, Wilmot Li, Jue Wang, Lubomir Bourdev, Shai Avidan, and Michael F. Cohen. 2011. Pause-and-Play: Automatically Linking Screencast Video Tutorials with Applications. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology(Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 135–144. https://doi.org/10.1145/2047196.2047213",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Luca Ponzanelli, Gabriele Bavota, Andrea Mocci, Rocco Oliveto, Massimiliano Di Penta, Sonia Haiduc, Barbara Russo, and Michele Lanza. 2019. Automatic Identification and Classification of Software Development Video Tutorial Fragments. IEEE Transactions on Software Engineering 45, 5 (2019), 464–488. https://doi.org/10.1109/TSE.2017.2779479",
      "doi": "10.1109/TSE.2017.2779479"
    },
    {
      "text": "José Miguel Santos Espino, M.D. Afonso-Suárez, and Cayetano Guerra Artal. 2016. Speakers and boards: A survey of instructional video styles in MOOCs. 63 (05 2016), 101–115.",
      "doi": ""
    },
    {
      "text": "Alessandra Semeraro and Laia Turmo Vidal. 2022. Visualizing Instructions for Physical Training: Exploring Visual Cues to Support Movement Learning from Instructional Videos. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 90, 16 pages. https://doi.org/10.1145/3491102.3517735",
      "doi": "10.1145/3491102.3517735"
    },
    {
      "text": "William Sugar, Abbie Brown, and Kenneth Luterbach. 2010. Examining the anatomy of a screencast: Uncovering common elements and instructional strategies. The International Review of Research in Open and Distributed Learning 11, 3 (October 2010), 1–20. https://www.learntechlib.org/p/49134",
      "doi": ""
    },
    {
      "text": "Atima Tharatipyakul and Hyowon Lee. 2018. Towards a Better Video Comparison: Comparison as a Way of Browsing the Video Contents. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (Melbourne, Australia) (OzCHI ’18). Association for Computing Machinery, New York, NY, USA, 349–353. https://doi.org/10.1145/3292147.3292183",
      "doi": "10.1145/3292147.3292183"
    },
    {
      "text": "TikTok. 2022 (accessed Sep 14, 2022). TikTok. https://www.tiktok.com",
      "doi": ""
    },
    {
      "text": "Anh Truong, Floraine Berthouzoz, Wilmot Li, and Maneesh Agrawala. 2016. QuickCut: An Interactive Tool for Editing Narrated Video. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 497–507. https://doi.org/10.1145/2984511.2984569",
      "doi": "10.1145/2984511.2984569"
    },
    {
      "text": "Anh Truong, Peggy Chi, David Salesin, Irfan Essa, and Maneesh Agrawala. 2021. Automatic Generation of Two-Level Hierarchical Tutorials from Instructional Makeup Videos. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 108, 16 pages. https://doi.org/10.1145/3411764.3445721",
      "doi": "10.1145/3411764.3445721"
    },
    {
      "text": "Xu Wang, Benjamin Lafreniere, and Tovi Grossman. 2018. Leveraging Community-Generated Videos and Command Logs to Classify and Recommend Software Workflows. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173859",
      "doi": "10.1145/3173574.3173859"
    },
    {
      "text": "Sarah Weir, Juho Kim, Krzysztof Z. Gajos, and Robert C. Miller. 2015. Learnersourcing Subgoal Labels for How-to Videos. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 405–416. https://doi.org/10.1145/2675133.2675219",
      "doi": "10.1145/2675133.2675219"
    },
    {
      "text": "wikihow. 2022 (accessed Sep 14, 2022). Wikihow. https://www.wikihow.com/",
      "doi": ""
    },
    {
      "text": "Kuldeep Yadav, Ankit Gandhi, Arijit Biswas, Kundan Shrivastava, Saurabh Srivastava, and Om Deshmukh. 2016. ViZig: Anchor Points Based Non-Linear Navigation and Summarization in Educational Videos. In Proceedings of the 21st International Conference on Intelligent User Interfaces (Sonoma, California, USA) (IUI ’16). Association for Computing Machinery, New York, NY, USA, 407–418. https://doi.org/10.1145/2856767.2856788",
      "doi": "10.1145/2856767.2856788"
    },
    {
      "text": "Saelyne Yang, Sangkyung Kwak, Tae Soo Kim, and Juho Kim. 2022. Improving Video Interfaces by Presenting Informational Units of Videos. In CHI’22 Extended Abstracts. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "Saelyne Yang, Jisu Yim, Aitolkyn Baigutanova, Seoyoung Kim, Minsuk Chang, and Juho Kim. 2022. SoftVideo: Improving the Learning Experience of Software Tutorial Videos with Collective Interaction Data. In 27th International Conference on Intelligent User Interfaces (Helsinki, Finland) (IUI ’22). Association for Computing Machinery, New York, NY, USA, 646–660. https://doi.org/10.1145/3490099.3511106",
      "doi": "10.1145/3490099.3511106"
    },
    {
      "text": "Saelyne Yang, Jisu Yim, Juho Kim, and Hijung Valentina Shin. 2022. CatchLive: Real-Time Summarization of Live Streams with Stream Content and Interaction Data. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 500, 20 pages. https://doi.org/10.1145/3491102.3517461",
      "doi": "10.1145/3491102.3517461"
    },
    {
      "text": "YouTube. 2022 (accessed Sep 14, 2022). Video Chapters. https://support.google.com/youtube/answer/9884579",
      "doi": ""
    },
    {
      "text": "youtube dl. 2022 (accessed Sep 14, 2022). youtube-dl. https://www.npmjs.com/package/youtube-dl",
      "doi": ""
    }
  ]
}