{
  "doi": "10.1145/3544548.3580752",
  "title": "Evaluating the Extension of Wall Displays with AR for Collaborative Work",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Wall displays are well suited for collaborative work and are often placed in rooms with ample space in front of them that remains largely unused. Augmented Reality (AR) headsets can seamlessly extend the collaboration space around the Wall. Nevertheless, it is unclear if extending Walls with AR is effective and how it may affect collaboration. We first present a prototype combining a Wall and AR headsets to extend the Wall workspace. We then use this prototype to study how users utilize the virtual space created in AR. In an experiment with 24 participants, we compare how pairs solve collaborative tasks with the Wall alone and with Wall+AR. Our qualitative and quantitative results highlight that with Wall+AR, participants use the physical space in front and around the Wall extensively, and while this creates interaction overhead, it does not impact performance and improves the user experience.",
  "tags": [
    "Empirical Study",
    "Wall Display",
    "Collaboration",
    "Augmented Reality"
  ],
  "authors": [
    {
      "name": "Raphaël James",
      "institution": "LISN, Université Paris-Saclay, CNRS, Inria, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782139",
      "orcid": "0000-0002-4224-1430"
    },
    {
      "name": "Anastasia Bezerianos",
      "institution": "LISN, Université Paris-Saclay, CNRS, Inria, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659165855",
      "orcid": "0000-0002-7142-2548"
    },
    {
      "name": "Olivier Chapuis",
      "institution": "LISN, Université Paris-Saclay, CNRS, Inria, France",
      "img": "/do/10.1145/contrib-81319489300/rel-imgonly/oc.jpg",
      "acmid": "81319489300",
      "orcid": "0000-0003-0632-3700"
    }
  ],
  "references": [
    {
      "text": "visited on Sep 2022. ADNOC’s Panorama Digital Command Center. https://www.adnoc.ae/en/News-and-Media/Press-Releases/2020/ADNOC-Panorama-Digital-Command-Center-Generates-Over-1-Billion-in-Value/",
      "doi": ""
    },
    {
      "text": "visited on Sep 2022. Hiperwall in Global Satellite Services Provider command center. https://www.sharpnecdisplays.us/success-stories/intelsat/143",
      "doi": ""
    },
    {
      "text": "visited on Sep 2022. IBPC institute Visualization Wall. http://www.ibpc.fr/en/visualisation-wall-910.htm",
      "doi": ""
    },
    {
      "text": "Johnny Accot and Shumin Zhai. 2002. More than Dotting the i’s — Foundations for Crossing-Based Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’02). ACM, 73–80. https://doi.org/10.1145/503376.503390",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Christopher Andrews, Alex Endert, and Chris North. 2010. Space to Think: Large High-resolution Displays for Sensemaking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). ACM, 55–64. https://doi.org/10.1145/1753326.1753336",
      "doi": "10.1145/1753326.1753336"
    },
    {
      "text": "Georg Apitz and François Guimbretière. 2005. CrossY: A Crossing-Based Drawing Application. ACM Trans. Graph. 24, 3 (jul 2005), 930. https://doi.org/10.1145/1073204.1073286",
      "doi": "10.1145/1073204.1073286"
    },
    {
      "text": "Alec Azad, Jaime Ruiz, Daniel Vogel, Mark Hancock, and Edward Lank. 2012. Territoriality and Behaviour on and around Large Vertical Publicly-Shared Displays. In Proceedings of the Designing Interactive Systems Conference(DIS ’12). ACM, 468–477. https://doi.org/10.1145/2317956.2318025",
      "doi": "10.1145/2317956.2318025"
    },
    {
      "text": "Sriram Karthik Badam, Fereshteh Amini, Niklas Elmqvist, and Pourang Irani. 2016. Supporting visual exploration for multiple users in large display environments. In Conference on Visual Analytics Science and Technology(VAST ’16). IEEE, 1–10. https://doi.org/10.1109/VAST.2016.7883506",
      "doi": ""
    },
    {
      "text": "Robert Ball, Chris North, and Doug A. Bowman. 2007. Move to improve: promoting physical navigation to increase user performance with large displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). ACM, 191–200. https://doi.org/10.1145/1240624.1240656",
      "doi": "10.1145/1240624.1240656"
    },
    {
      "text": "Michel Beaudouin-Lafon, Olivier Chapuis, James Eagan, Tony Gjerlufsen, Stéphane Huot, Clemens Klokmose, Wendy Mackay, Mathieu Nancel, Emmanuel Pietriga, Clément Pillias, Romain Primet, and Julie Wagner. 2012. Multisurface Interaction in the WILD Room. IEEE Computer 45, 4 (April 2012), 48–56. https://doi.org/10.1109/MC.2012.110",
      "doi": "10.1109/MC.2012.110"
    },
    {
      "text": "M. Billinghurst, J. Bowskill, M. Jessop, and J. Morphett. 1998. A wearable spatial conferencing space. In Second International Symposium on Wearable Computers(ISWC ’98). IEEE, 76–83. https://doi.org/10.1109/ISWC.1998.729532",
      "doi": ""
    },
    {
      "text": "Lauren Bradel, Alex Endert, Kristen Koch, Christopher Andrews, and Chris North. 2013. Large high resolution displays for co-located collaborative sensemaking: Display usage and territoriality. International Journal of Human-Computer Studies 71, 11 (2013), 1078 – 1088. https://doi.org/10.1016/j.ijhcs.2013.07.004",
      "doi": "10.1016/j.ijhcs.2013.07.004"
    },
    {
      "text": "Eugenie Brasier, Olivier Chapuis, Nicolas Ferey, Jeanne Vezien, and Caroline Appert. 2020. ARPads: Mid-air Indirect Input for Augmented Reality. In Proceedings of the International Symposium on Mixed and Augmented Reality(ISMAR ’20). IEEE, Porto de Galinhas, Brazil, 13 pages. https://hal.archives-ouvertes.fr/hal-02915795",
      "doi": ""
    },
    {
      "text": "Eugenie Brasier, Emmanuel Pietriga, and Caroline Appert. 2021. AR-Enhanced Widgets for Smartphone-Centric Interaction. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction. ACM, Article 32, 12 pages. https://doi.org/10.1145/3447526.3472019",
      "doi": "10.1145/3447526.3472019"
    },
    {
      "text": "Catherine E. Brouwer and Jelle Van Dijk. 2011. Brainstorming: Talk and the representation of ideas and insights. In Proceedings of the Participatory Innovation Conference(PIN-C ’11). PIN-C, 15–20. https://pin-c.sdu.dk/2011.html",
      "doi": ""
    },
    {
      "text": "A. Butz, T. Hollerer, S. Feiner, B. MacIntyre, and C. Beshers. 1999. Enveloping users and computers in a collaborative 3D augmented reality. In Proceedings 2nd IEEE and ACM International Workshop on Augmented Reality (IWAR’99). IEEE, 35–44.",
      "doi": ""
    },
    {
      "text": "Marco Cavallo, Mishal Dolakia, Matous Havlena, Kenneth Ocheltree, and Mark Podlaseck. 2019. Immersive Insights: A Hybrid Analytics System ForCollaborative Exploratory Data Analysis. In 25th ACM Symposium on Virtual Reality Software and Technology(VRST ’19). ACM, Article 9, 12 pages. https://doi.org/10.1145/3359996.3364242",
      "doi": "10.1145/3359996.3364242"
    },
    {
      "text": "Chenliang Chang, Kiseung Bang, Gordon Wetzstein, Byoungho Lee, and Liang Gao. 2020. Toward the next-generation VR/AR optics: a review of holographic near-eye displays from a human-centric perspective. Optica 7, 11 (Nov 2020), 1563–1578. https://doi.org/10.1364/OPTICA.406004",
      "doi": ""
    },
    {
      "text": "Olivier Chapuis, Anastasia Bezerianos, and Stelios Frantzeskakis. 2014. Smarties: An Input System for Wall Display Development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, 2763–2772. https://doi.org/10.1145/2556288.2556956",
      "doi": "10.1145/2556288.2556956"
    },
    {
      "text": "Apoorve Chokshi, Teddy Seyed, Francisco Marinho Rodrigues, and Frank Maurer. 2014. EPlan Multi-Surface: A Multi-Surface Environment for Emergency Response Planning Exercises. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces(ITS ’14). ACM, 219–228. https://doi.org/10.1145/2669485.2669520",
      "doi": "10.1145/2669485.2669520"
    },
    {
      "text": "Alex Endert, Christopher Andrews, Yueh Lee, and Chris North. 2011. Visual encodings that support physical navigation on large displays. In Proceedings of Graphics Interface 2011(GI ’11). CHCCS, 103–110. http://dl.acm.org.gate6.inist.fr/citation.cfm?id=1992917.1992935",
      "doi": "10.5555/1992917.1992935"
    },
    {
      "text": "Barrett M. Ens, Rory Finnegan, and Pourang P. Irani. 2014. The Personal Cockpit: A Spatial Interface for Effective Task Switching on Head-Worn Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, 3171–3180. https://doi.org/10.1145/2556288.2557058",
      "doi": "10.1145/2556288.2557058"
    },
    {
      "text": "Steven Feiner and Ari Shamash. 1991. Hybrid User Interfaces: Breeding Virtually Bigger Interfaces for Physically Smaller Computers. In Proceedings of the 4th Annual ACM Symposium on User Interface Software and Technology(UIST ’91). ACM, 9–17. https://doi.org/10.1145/120782.120783",
      "doi": "10.1145/120782.120783"
    },
    {
      "text": "Georges Grinstein, Theresa O’Connell, Sharon Laskowski, Catherine Plaisant, Jean Scholtz, and Mark Whiting. 2006. Vast 2006 contest-a tale of alderwood. In Symposium On Visual Analytics Science And Technology. IEEE, 215–216.",
      "doi": ""
    },
    {
      "text": "Jens Emil Grønbæk, Majken Kirkegaard Rasmussen, Kim Halskov, and Marianne Graves Petersen. 2020. KirigamiTable: Designing for Proxemic Transitions with a Shape-Changing Tabletop. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). ACM, 1–15. https://doi.org/10.1145/3313831.3376834",
      "doi": "10.1145/3313831.3376834"
    },
    {
      "text": "Jens Grubert, Matthias Heinisch, Aaron Quigley, and Dieter Schmalstieg. 2015. MultiFi: Multi Fidelity Interaction with Displays On and Around the Body. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, 3933–3942. https://doi.org/10.1145/2702123.2702331",
      "doi": "10.1145/2702123.2702331"
    },
    {
      "text": "Edward T. Hall. 1960. The Hidden Dimension. Anchor Books, USA.",
      "doi": ""
    },
    {
      "text": "Chad Harms and Frank Biocca. 2004. Internal Consistency and Reliability of the Networked Minds Measure of Social Presence. In Seventh Annual International Workshop: Presence(Universidad Politecnica de Valencia, Valencia).",
      "doi": ""
    },
    {
      "text": "S. Hayne, M. Pendergast, and S. Greenberg. 1993. Gesturing through cursors: implementing multiple pointers in group support systems. In Proceedings of the Twenty-sixth Hawaii International Conference on System Sciences(HICSS ’93, Vol. iv). IEEE, 4–12 vol.4. https://doi.org/10.1109/HICSS.1993.284158",
      "doi": ""
    },
    {
      "text": "Juan David Hincapié-Ramos, Xiang Guo, Paymahn Moghadasian, and Pourang Irani. 2014. Consumed Endurance: A Metric to Quantify Arm Fatigue of Mid-Air Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, 1063–1072. https://doi.org/10.1145/2556288.2557130",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Tom Horak, Sriram Karthik Badam, Niklas Elmqvist, and Raimund Dachselt. 2018. When David Meets Goliath: Combining Smartwatches with a Large Vertical Display for Visual Data Exploration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, 1–13. https://doi.org/10.1145/3173574.3173593",
      "doi": "10.1145/3173574.3173593"
    },
    {
      "text": "Petra Isenberg, Danyel Fisher, Sharoda A. Paul, Meredith Ringel Morris, Kori Inkpen, and Mary Czerwinski. 2012. Co-Located Collaborative Visual Analytics around a Tabletop Display. IEEE Transactions on Visualization and Computer Graphics 18, 5(2012), 689–702. https://doi.org/10.1109/TVCG.2011.287",
      "doi": "10.1109/TVCG.2011.287"
    },
    {
      "text": "Yuta Itoh, Tobias Langlotz, Jonathan Sutton, and Alexander Plopski. 2021. Towards Indistinguishable Augmented Reality: A Survey on Optical See-through Head-Mounted Displays. ACM Comput. Surv. 54, 6, Article 120 (jul 2021), 36 pages. https://doi.org/10.1145/3453157",
      "doi": "10.1145/3453157"
    },
    {
      "text": "Yuta Itoh, Tobias Langlotz, Jonathan Sutton, and Alexander Plopski. 2021. Towards Indistinguishable Augmented Reality: A Survey on Optical See-through Head-Mounted Displays. ACM Comput. Surv. 54, 6, Article 120 (jul 2021), 36 pages. https://doi.org/10.1145/3453157",
      "doi": "10.1145/3453157"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2014. Up Close and Personal: Collaborative Work on a High-Resolution Multitouch Wall Display. ACM Transactions on Computer-Human Interaction 21, 2(2014), 1–34. https://doi.org/10.1145/2576099",
      "doi": "10.1145/2576099"
    },
    {
      "text": "Raphaël James, Anastasia Bezerianos, Olivier Chapuis, Maxime Cordeil, Tim Dwyer, and Arnaud Prouzeau. 2020. Personal+Context navigation: combining AR and shared displays in Network Path-following. In Proceedings of Graphics Interface(GI ’20). CHCCS/SCDHM, 267 – 278. https://doi.org/10.20380/GI2020.27",
      "doi": ""
    },
    {
      "text": "Juho Kim, Haoqi Zhang, Paul André, Lydia B. Chilton, Wendy Mackay, Michel Beaudouin-Lafon, Robert C. Miller, and Steven P. Dow. 2013. Cobi: A Community-Informed Conference Scheduling Tool. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology(UIST ’13). ACM, 173–182. https://doi.org/10.1145/2501988.2502034",
      "doi": "10.1145/2501988.2502034"
    },
    {
      "text": "Taeheon Kim, Bahador Saket, Alex Endert, and Blair MacIntyre. 2017. VisAR: Bringing Interactivity to Static Data Visualizations through Augmented Reality. CoRR abs/1708.01377(2017), 4 pages. arxiv:1708.01377http://arxiv.org/abs/1708.01377",
      "doi": ""
    },
    {
      "text": "Ulrike Kister, Patrick Reipschläger, Fabrice Matulic, and Raimund Dachselt. 2015. BodyLenses: Embodied Magic Lenses and Personal Territories for Wall Displays. In Proceedings of the International Conference on Interactive Tabletops & Surfaces(ITS ’15). ACM, 117–126. https://doi.org/10.1145/2817721.2817726",
      "doi": "10.1145/2817721.2817726"
    },
    {
      "text": "Anne Köpsel, Päivi Majaranta, Poika Isokoski, and Anke Huckauf. 2016. Effects of auditory, haptic and visual feedback on performing gestures by gaze or by hand. Behaviour & Information Technology 35, 12 (2016), 1044–1062. https://doi.org/10.1080/0144929X.2016.1194477",
      "doi": "10.1080/0144929X.2016.1194477"
    },
    {
      "text": "Ricardo Langner, Marc Satkowski, Wolfgang Büschel, and Raimund Dachselt. 2021. MARVIS: Combining Mobile Devices and Augmented Reality for Visual Data Analysis. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). ACM, Article 468, 17 pages. https://doi.org/10.1145/3411764.3445593",
      "doi": "10.1145/3411764.3445593"
    },
    {
      "text": "Benjamin Lee, Maxime Cordeil, Arnaud Prouzeau, Bernhard Jenny, and Tim Dwyer. 2022. A Design Space For Data Visualisation Transformations Between 2D And 3D In Mixed-Reality Environments. In CHI Conference on Human Factors in Computing Systems(CHI ’22). ACM, Article 25, 14 pages. https://doi.org/10.1145/3491102.3501859",
      "doi": "10.1145/3491102.3501859"
    },
    {
      "text": "Benjamin Lee, Xiaoyun Hu, Maxime Cordeil, Arnaud Prouzeau, Bernhard Jenny, and Tim Dwyer. 2021. Shared Surfaces and Spaces: Collaborative Data Visualisation in a Co-located Immersive Environment. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 1171–1181. https://doi.org/10.1109/TVCG.2020.3030450",
      "doi": ""
    },
    {
      "text": "Gun A. Lee, Ungyeon Yang, and Wookho Son. 2006. Layered multiple displays for immersive and interactive digital contents. In International Conference on Entertainment Computing(IFIP ICEC ’06). Springer, 123–134. https://doi.org/10.1007/11872320_15",
      "doi": "10.1007/11872320_15"
    },
    {
      "text": "Gun-Yeal Lee, Jong-Young Hong, SoonHyoung Hwang, Seokil Moon, Hyeokjung Kang, Sohee Jeon, Hwi Kim, Jun-Ho Jeong, and Byoungho Lee. 2018. Metasurface eyepiece for augmented reality. Nature Communications 9, 1 (2018), 4562. https://doi.org/10.1038/s41467-018-07011-5",
      "doi": ""
    },
    {
      "text": "Sikun Lin, Hao Fei Cheng, Weikai Li, Zhanpeng Huang, Pan Hui, and Christoph Peylo. 2017. Ubii: Physical World Interaction Through Augmented Reality. IEEE Transactions on Mobile Computing 16, 3 (2017), 872–885. https://doi.org/10.1109/TMC.2016.2567378",
      "doi": "10.1109/TMC.2016.2567378"
    },
    {
      "text": "Lee Lisle, Kylie Davidson, Edward J.K. Gitre, Chris North, and Doug A. Bowman. 2021. Sensemaking Strategies with Immersive Space to Think. In Virtual Reality and 3D User Interfaces(VR ’21). IEEE, 529–537. https://doi.org/10.1109/VR50410.2021.00077",
      "doi": ""
    },
    {
      "text": "Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, and Eric Lecolinet. 2016. Shared Interaction on a Wall-Sized Display in a Data Manipulation Task. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, 2075–2086. https://doi.org/10.1145/2858036.2858039",
      "doi": "10.1145/2858036.2858039"
    },
    {
      "text": "Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, and Eric Lecolinet. 2017. CoReach: Cooperative Gestures for Data Manipulation on Wall-sized Displays. In Proceedings of the CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, 6730–6741. https://doi.org/10.1145/3025453.3025594",
      "doi": "10.1145/3025453.3025594"
    },
    {
      "text": "Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, Eric Lecolinet, and Wendy E. Mackay. 2014. Effects of Display Size and Navigation Type on a Classification Task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, 4147–4156. https://doi.org/10.1145/2556288.2557020",
      "doi": "10.1145/2556288.2557020"
    },
    {
      "text": "Weizhou Luo, Anke Lehmann, Hjalmar Widengren, and Raimund Dachselt. 2022. Where Should We Put It? Layout and Placement Strategies of Documents in Augmented Reality for Collaborative Sensemaking. In CHI Conference on Human Factors in Computing Systems(CHI ’22). ACM, Article 627, 16 pages. https://doi.org/10.1145/3491102.3501946",
      "doi": "10.1145/3491102.3501946"
    },
    {
      "text": "Mayra Donaji Barrera Machuca, Winyu Chinthammit, Weidong Huang, Rainer Wasinger, and Henry Duh. 2018. Enabling symmetric collaboration in public spaces through 3D mobile interaction. Symmetry 10, 3 (2018), 69. https://doi.org/10.3390/sym10030069",
      "doi": ""
    },
    {
      "text": "Tahir Mahmood, Erik Butler, Nicholas Davis, Jian Huang, and Aidong Lu. 2018. Building Multiple Coordinated Spaces for Effective Immersive Analytics through Distributed Cognition. In International Symposium on Big Data Visual and Immersive Analytics(BDVA ’18). IEEE, 1–11. https://doi.org/10.1109/BDVA.2018.8533893",
      "doi": ""
    },
    {
      "text": "Thomas W. Malone. 1983. How Do People Organize Their Desks? Implications for the Design of Office Information Systems. ACM Trans. Inf. Syst. 1, 1 (jan 1983), 99–112. https://doi.org/10.1145/357423.357430",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Sven Mayer, Lars Lischke, Jens Emil Grønbæk, Zhanna Sarsenbayeva, Jonas Vogelsang, Paweł W. Woźniak, Niels Henze, and Giulio Jacucci. 2018. Pac-Many: Movement Behavior When Playing Collaborative and Competitive Games on Large Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, 1–10. https://doi.org/10.1145/3173574.3174113",
      "doi": "10.1145/3173574.3174113"
    },
    {
      "text": "Will McGrath, Brian Bowman, David McCallum, Juan David Hincapié-Ramos, Niklas Elmqvist, and Pourang Irani. 2012. Branch-Explore-Merge: Facilitating Real-Time Revision Control in Collaborative Visual Exploration. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces(ITS ’12). ACM, 235–244. https://doi.org/10.1145/2396636.2396673",
      "doi": "10.1145/2396636.2396673"
    },
    {
      "text": "Meredith Ringel Morris, Kathy Ryall, Chia Shen, Clifton Forlines, and Frederic Vernier. 2004. Beyond \"Social Protocols\": Multi-User Coordination Policies for Co-Located Groupware. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work(CSCW ’04). ACM, 262–265. https://doi.org/10.1145/1031607.1031648",
      "doi": "10.1145/1031607.1031648"
    },
    {
      "text": "Mathieu Nancel, Olivier Chapuis, Emmanuel Pietriga, Xing-Dong Yang, Pourang P. Irani, and Michel Beaudouin-Lafon. 2013. High-Precision Pointing on Large Wall Displays Using Small Handheld Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). ACM, 831–840. https://doi.org/10.1145/2470654.2470773",
      "doi": "10.1145/2470654.2470773"
    },
    {
      "text": "Susanna Nilsson, Bjorn Johansson, and Arne Jonsson. 2009. Using AR to support cross-organisational collaboration in dynamic tasks. In International Symposium on Mixed and Augmented Reality(ISMAR ’09). IEEE, 3–12.",
      "doi": "10.1109/ISMAR.2009.5336522"
    },
    {
      "text": "Arthur Nishimoto and Andrew E Johnson. 2019. Extending Virtual Reality Display Wall Environments Using Augmented Reality. In Symposium on Spatial User Interaction(SUI ’19). ACM, Article 7, 5 pages. https://doi.org/10.1145/3357251.3357579",
      "doi": "10.1145/3357251.3357579"
    },
    {
      "text": "Erwan Normand and Michael J. McGuffin. 2018. Enlarging a Smartphone with AR to Create a Handheld VESAD (Virtually Extended Screen-Aligned Display). In IEEE International Symposium on Mixed and Augmented Reality(ISMAR ’18). IEEE, 123–133. https://doi.org/10.1109/ISMAR.2018.00043",
      "doi": ""
    },
    {
      "text": "Peter Peltonen, Esko Kurvinen, Antti Salovaara, Giulio Jacucci, Tommi Ilmonen, John Evans, Antti Oulasvirta, and Petri Saarikko. 2008. It’s Mine, Don’t Touch! Interactions at a Large Multi-Touch Display in a City Centre. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). ACM, 1285–1294. https://doi.org/10.1145/1357054.1357255",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Arnaud Prouzeau, Anastasia Bezerianos, and Olivier Chapuis. 2017. Evaluating Multi-User Selection for Exploring Graph Topology on Wall-Displays. IEEE Transactions on Visualization and Computer Graphics 23, 8(2017), 1936–1951. https://doi.org/10.1109/TVCG.2016.2592906",
      "doi": "10.1109/TVCG.2016.2592906"
    },
    {
      "text": "Arnaud Prouzeau, Anastasia Bezerianos, and Olivier Chapuis. 2018. Awareness Techniques to Aid Transitions Between Personal and Shared Workspaces in Multi-Display Environments. In Proceedings of the ACM International Conference on Interactive Surfaces and Spaces(ISS ’18). ACM, 291–304. https://doi.org/10.1145/3279778.3279780",
      "doi": "10.1145/3279778.3279780"
    },
    {
      "text": "Erik Prytz, Susanna Nilsson, and Arne Jönsson. 2010. The importance of eye-contact for collaboration in AR systems. In International Symposium on Mixed and Augmented Reality(ISMAR ’10). IEEE, 119–126. https://doi.org/10.1109/ISMAR.2010.5643559",
      "doi": ""
    },
    {
      "text": "Fateme Rajabiyazdi, Jagoda Walny, Carrie Mah, John Brosz, and Sheelagh Carpendale. 2015. Understanding Researchers’ Use of a Large, High-Resolution Display Across Disciplines. In Proceedings of the International Conference on Interactive Tabletops & Surfaces(ITS ’15). ACM, 107–116. https://doi.org/10.1145/2817721.2817735",
      "doi": "10.1145/2817721.2817735"
    },
    {
      "text": "Khairi Reda, Andrew E. Johnson, Michael E. Papka, and Jason Leigh. 2015. Effects of Display Size and Resolution on User Behavior and Insight Acquisition in Visual Exploration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, 2759–2768. https://doi.org/10.1145/2702123.2702406",
      "doi": "10.1145/2702123.2702406"
    },
    {
      "text": "Patrick Reipschläger, Tamara Flemisch, and Raimund Dachselt. 2021. Personal Augmented Reality for Information Visualization on Large Interactive Displays. IEEE Transactions on Visualization and Computer Graphics 27 (2 2021), 11 pages. Issue 2.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto and Masanori Saitoh. 1999. Augmented Surfaces: A Spatially Continuous Work Space for Hybrid Computing Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’99). ACM, 378–385. https://doi.org/10.1145/302979.303113",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Marc Satkowski, Weizhou Luo, and Raimund Dachselt. 2021. Towards In-situ Authoring of AR Visualizations with Mobile Devices. In International Symposium on Mixed and Augmented Reality Adjunct(ISMAR-Adjunct ’21). IEEE, 324–325. https://doi.org/10.1109/ISMAR-Adjunct54149.2021.00073",
      "doi": ""
    },
    {
      "text": "Stacey Scott, Sheelagh Carpendale, and Kori Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the Conference on Computer Supported Cooperative Work(CSCW ’04). ACM, 294–303. https://doi.org/10.1145/1031607.1031655",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Marcos Serrano, Barrett Ens, Xing-Dong Yang, and Pourang Irani. 2015. Gluey: Developing a Head-Worn Display Interface to Unify the Interaction Experience in Distributed Display Environments. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’15). ACM, 161–171. https://doi.org/10.1145/2785830.2785838",
      "doi": "10.1145/2785830.2785838"
    },
    {
      "text": "Anton Sigitov, André Hinkenjann, Ernst Kruijff, and Oliver Staadt. 2019. Task Dependent Group Coupling and Territorial Behavior on Large Tiled Displays. Frontiers in Robotics and AI 6 (2019), 17 pages. https://doi.org/10.3389/frobt.2019.00128",
      "doi": ""
    },
    {
      "text": "Tianchen Sun, Yucong Ye, Issei Fujishiro, and Kwan-Liu Ma. 2019. Collaborative Visual Analysis with Multi-level Information Sharing Using a Wall-Size Display and See-Through HMDs. In Pacific Visualization Symposium(PacificVis ’19). IEEE, 11–20.",
      "doi": ""
    },
    {
      "text": "Tianchen Sun, Yucong Chris Ye, Issei Fujishiro, and Kwan-Liu Ma. 2019. Collaborative Visual Analysis with Multi-Level Information Sharing Using a Wall-size Display and See-Through HMDs. In Proceedings of IEEE Pacific Visualization Symposium(PacificVis ’19). IEEE, 11–20.",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative Coupling over Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’06). ACM, 1181–1190. https://doi.org/10.1145/1124772.1124950",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "Theophanis Tsandilas, Anastasia Bezerianos, and Thibaut Jacob. 2015. SketchSliders: Sketching Widgets for Visual Exploration on Wall Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, 3255–3264. https://doi.org/10.1145/2702123.2702129",
      "doi": "10.1145/2702123.2702129"
    },
    {
      "text": "Vinoba Vinayagamoorthy, Maxine Glancy, Christoph Ziegler, and Richard Schäffer. 2019. Personalising the TV Experience Using Augmented Reality: An Exploratory Study on Delivering Synchronised Sign Language Interpretation. ACM, 1–12. https://doi.org/10.1145/3290605.3300762",
      "doi": "10.1145/3290605.3300762"
    },
    {
      "text": "James R. Wallace, Nancy Iskander, and Edward Lank. 2016. Creating Your Bubble: Personal Space On and Around Large Public Displays. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, 2087–2092. https://doi.org/10.1145/2858036.2858118",
      "doi": "10.1145/2858036.2858118"
    },
    {
      "text": "James R. Wallace, Stacey D. Scott, Eugene Lai, and Deon Jajalla. 2011. Investigating the Role of a Large, Shared Display in Multi-Display Environments. Computer Supported Cooperative Work 20 (2011), 529–561. https://doi.org/10.1007/s10606-011-9149-8",
      "doi": "10.1007/s10606-011-9149-8"
    },
    {
      "text": "Xiyao Wang, Lonni Besançon, David Rousseau, Mickael Sereno, Mehdi Ammi, and Tobias Isenberg. 2020. Towards an Understanding of Augmented Reality Extensions for Existing 3D Data Analysis Tools. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). ACM, 1–13. https://doi.org/10.1145/3313831.3376657",
      "doi": "10.1145/3313831.3376657"
    },
    {
      "text": "Andrew D. Wilson and Hrvoje Benko. 2010. Combining Multiple Depth Cameras and Projectors for Interactions on, above and between Surfaces. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology(UIST ’10). ACM, 273–282. https://doi.org/10.1145/1866029.1866073",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Fengyuan Zhu and Tovi Grossman. 2020. BISHARE: Exploring Bidirectional Interactions Between Smartphones and Head-Mounted Augmented Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). ACM, 1–14. https://doi.org/10.1145/3313831.3376233",
      "doi": "10.1145/3313831.3376233"
    }
  ]
}