{
  "doi": "10.1145/3544548.3581066",
  "title": "“Should I Follow the Human, or Follow the Robot?” — Robots in Power Can Have More Influence Than Humans on Decision-Making",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Artificially intelligent (AI) agents such as robots are increasingly delegated power in work settings, yet it remains unclear how power functions in interactions with both humans and robots, especially when they directly compete for influence. Here we present an experiment where every participant was matched with one human and one robot to perform decision-making tasks. By manipulating who has power, we created three conditions: human as leader, robot as leader, and a no-power-difference control. The results showed that the participants were significantly more influenced by the leader, regardless of whether the leader was a human or a robot. However, they generally held a more positive attitude toward the human than the robot, although they considered whichever was in power as more competent. This study illustrates the importance of power for future Human-Robot Interaction (HRI) and Human-AI Interaction (HAI) research, as it addresses pressing concerns of society about AI-powered intelligent agents.",
  "authors": [
    {
      "name": "Yoyo Tsung-Yu Hou",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321635",
      "orcid": "0000-0003-0586-1398"
    },
    {
      "name": "Wen-Ying Lee",
      "institution": "Mechanical Engineering, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319719",
      "orcid": "0000-0002-1427-1755"
    },
    {
      "name": "Malte Jung",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758949457",
      "orcid": "0000-0001-9359-7122"
    }
  ],
  "references": [
    {
      "text": "Siddharth Agrawal and Mary-Anne Williams. 2017. Robot authority and human obedience: A study of human behaviour using a robot security guard. In Proceedings of the companion of the 2017 ACM/IEEE international conference on human-robot interaction. 57–58.",
      "doi": "10.1145/3029798.3038387"
    },
    {
      "text": "Colleen M Carpinella, Alisa B Wyman, Michael A Perez, and Steven J Stroessner. 2017. The robotic social attributes scale (RoSAS) development and validation. In Proceedings of the 2017 ACM/IEEE International Conference on human-robot interaction. 254–262.",
      "doi": "10.1145/2909824.3020208"
    },
    {
      "text": "Dowrin Cartwright. 1965. Influence, Leadership, and Control in Handbook of Organizations.",
      "doi": ""
    },
    {
      "text": "Noah Castelo, Maarten W Bos, and Donald R Lehmann. 2019. Task-dependent algorithm aversion. Journal of Marketing Research 56, 5 (2019), 809–825.",
      "doi": ""
    },
    {
      "text": "Le Chen, Alan Mislove, and Christo Wilson. 2015. Peeking beneath the hood of uber. In Proceedings of the 2015 internet measurement conference. 495–508.",
      "doi": "10.1145/2815675.2815681"
    },
    {
      "text": "Derek Cormier, Gem Newman, Masayuki Nakane, James E Young, and Stephane Durocher. 2013. Would you do as a robot commands? an obedience study for human-robot interaction. In International Conference on Human-Agent Interaction. 1–3.",
      "doi": ""
    },
    {
      "text": "Bo Cowgill. 2018. Bias and productivity in humans and algorithms: Theory and evidence from resume screening. Columbia Business School, Columbia University 29 (2018).",
      "doi": ""
    },
    {
      "text": "Berkeley J Dietvorst, Joseph P Simmons, and Cade Massey. 2015. Algorithm aversion: people erroneously avoid algorithms after seeing them err.Journal of Experimental Psychology: General 144, 1 (2015), 114.",
      "doi": ""
    },
    {
      "text": "Donelson R Forsyth. 2018. Group dynamics. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "AGENCE FRANCE-PRESSE. 2020. Robot reminds Japan shoppers to wear masks. https://techxplore.com/news/2020-11-robot-japan-shoppers-masks.html Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Marlena R Fraune, Selma Šabanović, and Eliot R Smith. 2017. Teammates first: Favoring ingroup robots over outgroup humans. In 2017 26th IEEE international symposium on robot and human interactive communication (RO-MAN). IEEE, 1432–1437.",
      "doi": "10.1109/ROMAN.2017.8172492"
    },
    {
      "text": "John R French, Bertram Raven, and Dorwin Cartwright. 1959. The bases of social power. Classics of organization theory 7 (1959), 311–320.",
      "doi": ""
    },
    {
      "text": "Adam D Galinsky, Joe C Magee, M Ena Inesi, and Deborah H Gruenfeld. 2006. Power and perspectives not taken. Psychological science 17, 12 (2006), 1068–1074.",
      "doi": ""
    },
    {
      "text": "Adam D Galinsky, Derek D Rucker, and Joe C Magee. 2015. Power: Past findings, present considerations, and future directions.(2015).",
      "doi": ""
    },
    {
      "text": "Denise Geiskkovitch, Stela Seo, and James E Young. 2015. Autonomy, embodiment, and obedience to robots. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction Extended Abstracts. 235–236.",
      "doi": "10.1145/2701973.2702723"
    },
    {
      "text": "Denise Y Geiskkovitch, Derek Cormier, Stela H Seo, and James E Young. 2016. Please continue, we need more data: an exploration of obedience to robots. Journal of Human-Robot Interaction 5, 1 (2016), 82–99.",
      "doi": "10.5555/3109939.3109943"
    },
    {
      "text": "Heather Griffiths, Nathan Keirns, Eric Strayer, Tommy Sadler, Susan Cody-Rydzewski, Gail Scaramuzzo, Sally Vyain, Jeff Bry, and Faye Jones. 2012. Power and Authority. Introduction to Sociology 2e(2012).",
      "doi": ""
    },
    {
      "text": "Kerstin S Haring, Ariana Mosley, Sarah Pruznick, Julie Fleming, Kelly Satterfield, Ewart J de Visser, Chad C Tossell, and Gregory Funke. 2019. Robot authority in human-machine teams: effects of human-like appearance on compliance. In International Conference on Human-Computer Interaction. Springer, 63–78.",
      "doi": ""
    },
    {
      "text": "Mojgan Hashemian. 2019. Persuasive Social Robots using Social Power Dynamics.. In AAMAS. 2408–2410.",
      "doi": ""
    },
    {
      "text": "Mojgan Hashemian, Marta Couto, Samuel Mascarenhas, Ana Paiva, Pedro A Santos, and Rui Prada. 2020. Investigating reward/punishment strategies in the persuasiveness of social robots. In 2020 29th IEEE International Conference on Robot and Human Interactive Communication (RO-MAN). IEEE, 863–868.",
      "doi": ""
    },
    {
      "text": "Mojgan Hashemian, Marta Couto, Samuel Mascarenhas, Ana Paiva, Pedro A Santos, and Rui Prada. 2020. Persuasive social robots using reward/coercion strategies. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction. 230–232.",
      "doi": "10.1145/3371382.3378373"
    },
    {
      "text": "Mojgan Hashemian, Marta Couto, Samuel Mascarenhas, Ana Paiva, Pedro A Santos, and Rui Prada. 2021. Persuasive Social Robot Using Reward Power over Repeated Instances of Persuasion. In International Conference on Persuasive Technology. Springer, 63–70.",
      "doi": "10.1007/978-3-030-79460-6_6"
    },
    {
      "text": "Mojgan Hashemian, Samuel Mascarenhas, Marta Couto, Ana Paiva, Pedro A Santos, and Rui Prada. 2020. The Application of Social Power in Persuasive Social Robots. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction. 564–566.",
      "doi": ""
    },
    {
      "text": "Mojgan Hashemian, Ana Paiva, Samuel Mascarenhas, Pedro A Santos, and Rui Prada. 2019. The power to persuade: a study of social power in human-robot interaction. In 2019 28th IEEE International Conference on Robot and Human Interactive Communication (RO-MAN). IEEE, 1–8.",
      "doi": "10.1109/RO-MAN46459.2019.8956298"
    },
    {
      "text": "Mojgan Hashemian, Ana Paiva, Samuel Mascarenhas, Pedro Alexandre Santos, and Rui Prada. 2019. Social Power in Human-Robot Interaction: Towards More Persuasive Robots.. In AAMAS. 2015–2017.",
      "doi": ""
    },
    {
      "text": "Mojgan Hashemian, Rui Prada, Pedro A Santos, and Samuel Mascarenhas. 2018. Enhancing social believability of virtual agents using social power dynamics. In Proceedings of the 18th International Conference on Intelligent Virtual Agents. 147–152.",
      "doi": "10.1145/3267851.3267902"
    },
    {
      "text": "Robert V Hogg, Elliot A Tanis, and Dale L Zimmerman. 1977. Probability and statistical inference. Vol. 993. Macmillan New York.",
      "doi": ""
    },
    {
      "text": "Yoyo Tsung-Yu Hou and Malte F Jung. 2021. Who is the expert? Reconciling algorithm aversion and algorithm appreciation in AI-supported decision making. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": ""
    },
    {
      "text": "Wendy Ju. 2016. Power in Human Robot Interactions.. In Robophilosophy/Transor. 13–14.",
      "doi": ""
    },
    {
      "text": "Herbert C Kelman. 1958. Compliance, identification, and internalization three processes of attitude change. Journal of conflict resolution 2, 1 (1958), 51–60.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with machines: The impact of algorithmic and data-driven management on human workers. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1603–1612.",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Jamy Li, Wendy Ju, and Cliff Nass. 2015. Observer perception of dominance and mirroring behavior in human-robot relationships. In 2015 10th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 133–140.",
      "doi": "10.1145/2696454.2696459"
    },
    {
      "text": "Jennifer M Logg, Julia A Minson, and Don A Moore. 2019. Algorithm appreciation: People prefer algorithmic to human judgment. Organizational Behavior and Human Decision Processes 151 (2019), 90–103.",
      "doi": ""
    },
    {
      "text": "Steven Lukes. 1986. Power. Readings in Social and Political Theory, no 4.",
      "doi": ""
    },
    {
      "text": "Lisa Meinecke and Laura Voss. 2018. I robot, you unemployed: robotics in science fiction and media discourse. Schafft Wissen. Gemeinsames und geteiltes Wissen in Wissenschaft und Technik 2(2018), 203–221.",
      "doi": ""
    },
    {
      "text": "Stanley Milgram. 1963. Behavioral study of obedience.The Journal of abnormal and social psychology 67, 4(1963), 371.",
      "doi": ""
    },
    {
      "text": "Brian Ka-Jun Mok, Stephen Yang, David Sirkin, and Wendy Ju. 2015. A place for every tool and every tool in its place: Performing collaborative tasks with interactive robotic drawers. In 2015 24th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 700–706.",
      "doi": ""
    },
    {
      "text": "Richard L Moreland. 2010. Are dyads really groups?Small Group Research 41, 2 (2010), 251–267.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. 72–78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Charles A O’Reilly and Jennifer Chatman. 1986. Organizational commitment and psychological attachment: The effects of compliance, identification, and internalization on prosocial behavior.Journal of applied psychology 71, 3 (1986), 492.",
      "doi": ""
    },
    {
      "text": "Bertrand Russell. 1938. Power.",
      "doi": ""
    },
    {
      "text": "Shane P Saunderson and Goldie Nejat. 2021. Persuasive robots should avoid authority: The effects of formal and real authority on persuasion in human-robot interaction. Science Robotics 6, 58 (2021), eabd5186.",
      "doi": ""
    },
    {
      "text": "Catherine E Sembroski, Marlena R Fraune, and Selma Šabanović. 2017. He said, she said, it said: Effects of robot group membership and human authority on people’s willingness to follow their instructions. In 2017 26th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 56–61.",
      "doi": "10.1109/ROMAN.2017.8172280"
    },
    {
      "text": "Hung Sik and Ski Hung Ng. 1980. The social psychology of power. Number 21. Academic press.",
      "doi": ""
    },
    {
      "text": "Georg Simmel. 1908. Die quantitative Bestimmtheit der Gruppe. Soziologie. Untersuchungen über die Formen der Vergesellschaftung (1908), 68–94.",
      "doi": ""
    },
    {
      "text": "Janet A Sniezek and Timothy Buckley. 1995. Cueing and cognitive conflict in judge-advisor decision making. Organizational behavior and human decision processes 62, 2 (1995), 159–174.",
      "doi": ""
    },
    {
      "text": "Jacob Turner. 2018. Robot rules: Regulating artificial intelligence. Springer.",
      "doi": ""
    },
    {
      "text": "Tom R Tyler and E Allan Lind. 1992. A relational model of authority in groups. In Advances in experimental social psychology. Vol. 25. Elsevier, 115–191.",
      "doi": ""
    },
    {
      "text": "Blay Whitby and Kane Oliver. 2000. How to avoid a robot takeover: political and ethical choices in the design and introduction of intelligent artifacts. AISB QUARTERLY (2000), 42–46.",
      "doi": ""
    },
    {
      "text": "Sangseok You and Lionel Robert. 2018. Trusting robots in teams: Examining the impacts of trusting robots on team performance and satisfaction. In You, S. and Robert, LP (2019). Trusting Robots in Teams: Examining the Impacts of Trusting Robots on Team Performance and Satisfaction, Proceedings of the 52th Hawaii International Conference on System Sciences, Jan. 8–11.",
      "doi": ""
    },
    {
      "text": "Frankie Youd. 2021. Do the robot: Kansai Airport’s new autonomous security. https://www.airport-technology.com/analysis/do-the-robot-kansai-airports-new-autonomous-security/ Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "James Young. 2021. Danger! This robot may be trying to manipulate you. Science Robotics 6, 58 (2021), eabk3479.",
      "doi": ""
    },
    {
      "text": "James Young and Derek Cormier. 2014. Can robots be managers, too. Harvard Business Review 2014, 4 (2014).",
      "doi": ""
    },
    {
      "text": "Gary Yukl. 1981. Leadership in Organizations, 9/e. Pearson Education India.",
      "doi": ""
    }
  ]
}