{
  "doi": "10.1145/3544548.3581404",
  "title": "Player-Driven Game Analytics: The Case of Guild Wars 2",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Video game analytics are widely adopted within academia and industrial development – yet, the player’s perspective is rarely considered as a driving factor, even though vast communities are interested in self-regulated learning, cross-comparisons and empirical trends or insights. In this work, we propose to empower the role of the player as the central impulse for analytics, collect requirements and data from the community of one of the most popular MMORPGs (Guild Wars 2), establish a tool over a 18-month period of participatory development and discuss the co-created features. With analytics for in-game logs from (n = 175, 099) unique players and atomic game actions of over 2 million hours played, we contribute a large-scale, long-term iterative implementation and evaluation of a player-driven instrument to quantify popularity, viability and hierarchical inspection between classes or individual performances. This tool found frequent usage among the actual game community, delivering game data science to the very player.",
  "authors": [
    {
      "name": "Johannes Pfau",
      "institution": "Computational Media, University of California at Santa Cruz, United States",
      "img": "/do/10.1145/contrib-99659210831/rel-imgonly/402059_368317296520046_450185021_n.jpg",
      "acmid": "99659210831",
      "orcid": "0000-0002-8760-5023"
    },
    {
      "name": "Magy Seif El-Nasr",
      "institution": "Computational Media, University of California at Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502694399",
      "orcid": "0000-0002-7808-1686"
    }
  ],
  "references": [
    {
      "text": "Sabbir Ahmad, Andy Bryant, Erica Kleinman, Zhaoqing Teng, Truong-Huy D Nguyen, and Magy Seif El-Nasr. 2019. Modeling individual and team behavior through spatio-temporal analysis. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. 601–612.",
      "doi": "10.1145/3311350.3347188"
    },
    {
      "text": "Aghyad Mohammad Albaghajati and Moataz Aly Kamaleldin Ahmed. 2020. Video game automated testing approaches: An assessment framework. IEEE Transactions on Games(2020).",
      "doi": ""
    },
    {
      "text": "ArenaNet. 2012. Guild Wars 2. Game [PC]. ArenaNet, Bellevue, Washington, USA..",
      "doi": ""
    },
    {
      "text": "Alexander Becker and Daniel Görlich. 2020. What is Game Balancing? - An Examination of Concepts. ParadigmPlus 1, 1 (2020), 22–41.",
      "doi": ""
    },
    {
      "text": "Blizzard Entertainment. 2004. World of Warcraft. Game [PC]. Blizzard Entertainment, Irvine, California, USA..",
      "doi": ""
    },
    {
      "text": "Brian Bowman, Niklas Elmqvist, and TJ Jankun-Kelly. 2012. Toward visualization for games: Theory, design space, and patterns. IEEE transactions on visualization and computer graphics 18, 11(2012), 1956–1968.",
      "doi": ""
    },
    {
      "text": "Alessandro Canossa and Anders Drachen. 2009. Patterns of Play: Play-Personas in User-Centred Game Development.. In DiGRA Conference.",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popović, 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (2010), 756–760.",
      "doi": ""
    },
    {
      "text": "Sylker Teles Da Silva and Kiyoshi Tomimatsu. 2013. Game prototyping with community-driven narrative: Actor-network theory applied for Massively Multiplayer Online Games development. In 2013 IEEE 2nd Global Conference on Consumer Electronics (GCCE). IEEE, 376–378.",
      "doi": ""
    },
    {
      "text": "Anders Drachen and Alessandro Canossa. 2009. Towards gameplay analysis via gameplay metrics. In Proceedings of the 13th international MindTrek conference: Everyday life in the ubiquitous era. 202–209.",
      "doi": "10.1145/1621841.1621878"
    },
    {
      "text": "Anders Drachen, Pejman Mirza-Babaei, and Lennart E Nacke. 2018. Games user research. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Anders Drachen, Rafet Sifa, Christian Bauckhage, and Christian Thurau. 2012. Guns, swords and data: Clustering of player behavior in computer games in the wild. In 2012 IEEE conference on Computational Intelligence and Games (CIG). IEEE, 163–170.",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr, Anders Drachen, and Alessandro Canossa. 2013. Game analytics. Springer.",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr, Truong-Huy D Nguyen, Alessandro Canossa, and Anders Drachen. 2021. Game Data Science. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Gearbox Software. 2019. Borderlands 3. Game [PC,PS4,XBoxOne]. Gearbox Software, Frisco, Texas, USA..",
      "doi": ""
    },
    {
      "text": "Christian W Günther and Anne Rozinat. 2012. Disco: Discover Your Processes.BPM (Demos) 940, 1 (2012), 40–44.",
      "doi": ""
    },
    {
      "text": "Fabian Hadiji, Rafet Sifa, Anders Drachen, Christian Thurau, Kristian Kersting, and Christian Bauckhage. 2014. Predicting player churn in the wild. In 2014 IEEE Conference on Computational Intelligence and Games. Ieee, 1–8.",
      "doi": ""
    },
    {
      "text": "Anders Hjort, Kristoffer Henriksen, and Lars Elbæk. 2018. Player-driven video analysis to enhance reflective soccer practice in talent development. International Journal of Game-Based Learning (IJGBL) 8, 2 (2018), 29–43.",
      "doi": "10.4018/IJGBL.2018040103"
    },
    {
      "text": "Stefan Holmlid. 2012. Participative; co-operative; emancipatory: From participatory design to service design. In Conference Proceedings ServDes. 2009; DeThinking Service; ReThinking Design; Oslo Norway 24-26 November 2009. Linköping University Electronic Press, 105–118.",
      "doi": ""
    },
    {
      "text": "Erica Kleinman and Magy Seif El-Nasr. 2021. Using Data to\" Git Gud\": A Push for a Player-Centric approach to the Use of Data in Esports. (2021).",
      "doi": ""
    },
    {
      "text": "Antti Koskenvoima and Matti Mäntymäki. 2015. Why do small and medium-size freemium game developers use game analytics?. In Conference on e-business, e-Services and e-Society. Springer, 326–337.",
      "doi": "10.1007/978-3-319-25013-7_26"
    },
    {
      "text": "Simone Kriglstein, Günter Wallner, and Margit Pohl. 2014. A user study of different gameplay visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 361–370.",
      "doi": "10.1145/2556288.2557317"
    },
    {
      "text": "Pascal Lessel, Maximilian Altmeyer, and Nicolas Brauner. 2019. Crowdjump: Investigating a Player-Driven Platform Game. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. 149–159.",
      "doi": "10.1145/3311350.3347168"
    },
    {
      "text": "Christian Sebastian Loh, I-Hung Li, and Yanyan Sheng. 2016. Comparison of similarity measures to differentiate players’ actions and decision-making profiles in serious games analytics. Computers in Human Behavior 64 (2016), 562–574.",
      "doi": "10.1016/j.chb.2016.07.024"
    },
    {
      "text": "Crisrael Lucero, Christianne Izumigawa, Kurt Frederiksen, Lena Nans, Rebecca Iden, and Douglas S Lange. 2020. Human-Autonomy Teaming and Explainable AI Capabilities in RTS Games. In International Conference on Human-Computer Interaction. Springer, 161–171.",
      "doi": ""
    },
    {
      "text": "Jacob Metcalf and Kate Crawford. 2016. Where are human subjects in big data research? The emerging ethics divide. Big Data & Society 3, 1 (2016), 2053951716650211.",
      "doi": ""
    },
    {
      "text": "Dinara Moura, Magy Seif El-Nasr, and Christopher D Shaw. 2011. Visualizing and understanding players’ behavior in video games: discovering patterns and supporting aggregation and comparison. In ACM SIGGRAPH 2011 game papers. 1–6.",
      "doi": "10.1145/2037692.2037695"
    },
    {
      "text": "Nici Nelson and Susan Wright. 1995. Power and participatory development: Theory and practice. ITDG Publishing.",
      "doi": ""
    },
    {
      "text": "Truong-Huy D Nguyen, Magy Seif El-Nasr, and Alessandro Canossa. 2015. Glyph: Visualization Tool for Understanding Problem Solving Strategies in Puzzle Games. In Proceedings of the 10th International Conference on the Foundations of Digital Games (FDG 2015). Foundations of Digital Games 2015, FDG 2015 ; Conference date: 22-06-2015 Through 22-06-2015.",
      "doi": ""
    },
    {
      "text": "Nathan Partlan, Erica Kleinman, Jim Howe, Sabbir Ahmad, Stacy Marsella, and Magy Seif El-Nasr. 2021. Design-Driven Requirements for Computationally Co-Creative Game AI Design Tools. In The 16th International Conference on the Foundations of Digital Games (FDG) 2021. 1–12.",
      "doi": ""
    },
    {
      "text": "Nathan Partlan, Abdelrahman Madkour, Chaima Jemmali, Josh Aaron Miller, Christoffer Holmgård, and Magy Seif El-Nasr. 2019. Player imitation for build actions in a real-time strategy game. In AIIDE workshop on Artificial Intelligence for Strategy Games.",
      "doi": ""
    },
    {
      "text": "Johannes Pfau, Michael Debus, Jesper Juul, Emil Lundedal Hammar, Alessandro Canossa, and Magy Seif El-Nasr. 2022. Predicting Success Factors of Video Game Titles and Companies. In Entertainment Computing – ICEC 2022, Barbara Göbl, Erik van der Spek, Jannicke Baalsrud Hauge, and Rod McCall (Eds.). Springer International Publishing, Cham, 269–282.",
      "doi": "10.1007/978-3-031-20212-4_22"
    },
    {
      "text": "Johannes Pfau, Antonios Liapis, Georg Volkmar, Georgios N. Yannakakis, and Rainer Malaka. 2020. Dungeons & Replicants: Automated Game Balancing via Deep Player Behavior Modeling. In 2020 IEEE Conference on Games (CoG). 431–438. https://doi.org/10.1109/CoG47356.2020.9231958",
      "doi": ""
    },
    {
      "text": "Johannes Pfau, Antonios Liapis, Georgios N. Yannakakis, and Rainer Malaka. 2022. Dungeons & Replicants II: Automated Game Balancing Across Multiple Difficulty Dimensions via Deep Player Behavior Modeling. IEEE Transactions on Games(2022), 1–1. https://doi.org/10.1109/TG.2022.3167728",
      "doi": ""
    },
    {
      "text": "Johannes Pfau, Robert Porzel, Mihai Pomarlan, Vanja Sophie Cangalovic, Supara Grudpan, Sebastian Höffner, John Bateman, and Rainer Malaka. 2019. Give MEANinGS to Robots with Kitchen Clash: A VR Human Computation Serious Game for World Knowledge Accumulation. In Entertainment Computing and Serious Games, Erik van der Spek, Stefan Göbel, Ellen Yi-Luen Do, Esteban Clua, and Jannicke Baalsrud Hauge (Eds.). Springer International Publishing, Cham, 85–96.",
      "doi": ""
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2017. Automated Game Testing with ICARUS: Intelligent Completion of Adventure Riddles via Unsupervised Solving. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 153–164. https://doi.org/10.1145/3130859.3131439",
      "doi": "10.1145/3130859.3131439"
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2018. Towards Deep Player Behavior Models in MMORPGs. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (Melbourne, VIC, Australia) (CHI PLAY ’18). Association for Computing Machinery, New York, NY, USA, 381–392. https://doi.org/10.1145/3242671.3242706",
      "doi": "10.1145/3242671.3242706"
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2020. The Case for Usable AI: What Industry Professionals Make of Academic AI in Video Games(CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 330–334. https://doi.org/10.1145/3383668.3419905",
      "doi": "10.1145/3383668.3419905"
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, and Rainer Malaka. 2020. Enemy Within: Long-Term Motivation Effects of Deep Player Behavior Models for Dynamic Difficulty Adjustment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3313831.3376423",
      "doi": "10.1145/3313831.3376423"
    },
    {
      "text": "Umendra Rajapakshe. 2019. Development Centric Player Feedback Analysis for Video Games: A Review. In 2019 International Conference on High Performance Big Data and Intelligent Systems (HPBD&IS). IEEE, 190–194.",
      "doi": ""
    },
    {
      "text": "Riot Games. 2009. League of Legends. Game [PC]. Riot Games, Los Angeles, California, USA..",
      "doi": ""
    },
    {
      "text": "Riot Games. 2020. Valorant. Game [PC]. Riot Games, Los Angeles, California, USA..",
      "doi": ""
    },
    {
      "text": "Sebastian Risi and Julian Togelius. 2019. Procedural content generation: from automatically generating game levels to increasing generality in machine learning. arXiv preprint arXiv:1911.13071(2019).",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344–360.",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr and Erica Kleinman. 2020. Data-driven game development: ethical considerations. In International Conference on the Foundations of Digital Games. 1–10.",
      "doi": "10.1145/3402942.3402964"
    },
    {
      "text": "Noor Shaker, Georgios N Yannakakis, and Julian Togelius. 2012. Towards player-driven procedural content generation. In Proceedings of the 9th conference on Computing Frontiers. 237–240.",
      "doi": "10.1145/2212908.2212942"
    },
    {
      "text": "Square Enix. 2013. Final Fantasy XIV. Game [PC,OSX,PS3]. Square Enix, Tokyo, Japan..",
      "doi": ""
    },
    {
      "text": "Marc Steen. 2013. Co-design as a process of joint inquiry and imagination. Design Issues 29, 2 (2013), 16–28.",
      "doi": ""
    },
    {
      "text": "Zhaoqing Teng, Johannes Pfau, Sai Siddartha Maram, and Magy Seif El-Nasr. 2022. Player Segmentation with INSPECT: Revealing Systematic Behavior Differences within MMORPG and Educational Game Case Studies. In Extended Abstracts of the 2022 Annual Symposium on Computer-Human Interaction in Play (Bremen, Germany) (CHI PLAY ’22). Association for Computing Machinery, New York, NY, USA, 87–92. https://doi.org/10.1145/3505270.3558340",
      "doi": "10.1145/3505270.3558340"
    },
    {
      "text": "Jakob Trischler, Timo Dietrich, and Sharyn Rundle-Thiele. 2019. Co-design: from expert-to user-driven ideas in public service design. Public Management Review 21, 11 (2019), 1595–1619.",
      "doi": ""
    },
    {
      "text": "Valve. 2013. Dota2. Game [PC]. Valve, Bellevue, Washington State, USA..",
      "doi": ""
    },
    {
      "text": "Jérôme Waldispühl, Attila Szantner, Rob Knight, Sébastien Caisse, and Randy Pitchford. 2020. Leveling up citizen science. Nature Biotechnology 38, 10 (2020), 1124–1126.",
      "doi": ""
    },
    {
      "text": "Günter Wallner. 2019. A brief overview of data mining and analytics in games. Data analytics applications in gaming and entertainment (2019), 1–14.",
      "doi": ""
    },
    {
      "text": "Günter Wallner, Nour Halabi, and Pejman Mirza-Babaei. 2019. Aggregated visualization of playtesting data. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300593"
    },
    {
      "text": "Günter Wallner and Simone Kriglstein. 2012. A spatiotemporal visualization approach for the analysis of gameplay data. In Proceedings of the SIGCHI conference on human factors in computing systems. 1115–1124.",
      "doi": "10.1145/2207676.2208558"
    },
    {
      "text": "Günter Wallner and Simone Kriglstein. 2016. Visualizations for retrospective analysis of battles in team-based combat games: A user study. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. 22–32.",
      "doi": "10.1145/2967934.2968093"
    },
    {
      "text": "Günter Wallner, Marnix Van Wijland, Regina Bernhaupt, and Simone Kriglstein. 2021. What Players Want: Information Needs of Players on Post-Game Visualizations. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445174"
    },
    {
      "text": "Bernard L Welch. 1947. The generalization of ‘STUDENT’S’problem when several different population varlances are involved. Biometrika 34, 1-2 (1947), 28–35.",
      "doi": ""
    },
    {
      "text": "Lindsay Wells and Tomasz Bednarz. 2021. Explainable ai and reinforcement learning—a systematic review of current approaches and trends. Frontiers in artificial intelligence 4 (2021), 550030.",
      "doi": ""
    },
    {
      "text": "Nick Yee. 2006. The psychology of massively multi-user online role-playing games: Motivations, emotional investment, relationships and problematic usage. In Avatars at work and play. Springer, 187–207.",
      "doi": ""
    },
    {
      "text": "ZeniMax Online Studios. 2014. The Elder Scrolls Online. Game [PC,OSX,PS4,XboxOne]. ZeniMax Online Studios,Hunt Valley, Maryland, USA..",
      "doi": ""
    },
    {
      "text": "Jichen Zhu and Magy Seif El-Nasr. 2021. Open Player Modeling: Empowering Players through Data Transparency. In Proceedings of AIIDE Workshop on Experimental AI in Games (ExAG ’21).",
      "doi": ""
    }
  ]
}