{
  "doi": "10.1145/3544548.3580993",
  "title": "FIDO2 the Rescue? Platform vs. Roaming Authentication on Smartphones",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Modern smartphones support FIDO2 passwordless authentication using either external security keys or internal biometric authentication, but it is unclear whether users appreciate and accept these new forms of web authentication for their own accounts. We present the first lab study (N=87) comparing platform and roaming authentication on smartphones, determining the practical strengths and weaknesses of FIDO2 as perceived by users in a mobile scenario. Most participants were willing to adopt passwordless authentication during our in-person user study, but closer analysis shows that participants prioritize usability, security, and availability differently depending on the account type. We identify remaining adoption barriers that prevent FIDO2 from succeeding password authentication, such as missing support for contemporary usage patterns, including account delegation and usage on multiple clients.",
  "authors": [
    {
      "name": "Leon Würsching",
      "institution": "Secure Mobile Networking Lab (SEEMOO), Technische Universität Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783820",
      "orcid": "0000-0003-2648-6507"
    },
    {
      "name": "Florentin Putz",
      "institution": "Secure Mobile Networking Lab (SEEMOO), Technische Universität Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659554815",
      "orcid": "0000-0003-3122-7315"
    },
    {
      "name": "Steffen Haesler",
      "institution": "Science and Technology for Peace and Security (PEASEC), Technische Universität Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99659680590/rel-imgonly/steffenhaesler.jpg",
      "acmid": "99659680590",
      "orcid": "0000-0002-6808-0487"
    },
    {
      "name": "Matthias Hollick",
      "institution": "Secure Mobile Networking Lab (SEEMOO), Technische Universität Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100325093",
      "orcid": "0000-0002-9163-5989"
    }
  ],
  "references": [
    {
      "text": "Fatima Alqubaisi, Ahmad Samer Wazan, Liza Ahmad, and David W Chadwick. 2020. Should We Rush to Implement Password-less Single Factor FIDO2 based Authentication?. In 12th Annual Undergraduate Research Conference on Applied Computing (URC).",
      "doi": ""
    },
    {
      "text": "Apple. 2020. About iOS 13 Updates. https://support.apple.com/en-us/HT210393#133. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Apple. 2020. Safari 14 Release Notes. https://developer.apple.com/documentation/safari-release-notes/safari-14-release-notes. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Apple. 2022. iCloud Find My. https://www.apple.com/icloud/find-my. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Apple. 2022. iOS 16 Release Notes. https://developer.apple.com/documentation/ios-ipados-release-notes/ios-16-release-notes/. [Online; accessed 2022-09-14].",
      "doi": ""
    },
    {
      "text": "Apple. 2022. Locate a Lost or Stolen Device, Remotely Erase a Device. https://support.apple.com/en-us/HT210515. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Apple Developers. 2020. Meet Face ID and Touch ID for the web. https://developer.apple.com/videos/play/wwdc2020/10670/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Apple Developers. 2022. Meet passkeys. https://developer.apple.com/videos/play/wwdc2022/10092/. [Online; accessed 2022-09-07].",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. Journal of usability studies(2009).",
      "doi": ""
    },
    {
      "text": "Yoav Benjamini and Yosef Hochberg. 1995. Controlling the False Discovery Rate: A Practical and Powerful Approach to Multiple Testing. Journal of the Royal Statistical Society: Series B (Methodological) (1995).",
      "doi": ""
    },
    {
      "text": "Joseph Bonneau, Cormac Herley, Paul C Van Oorschot, and Frank Stajano. 2012. The Quest to Replace Passwords: A Framework for Comparative Evaluation of Web Authentication Schemes. In 2012 IEEE Symposium on Security and Privacy.",
      "doi": "10.1109/SP.2012.44"
    },
    {
      "text": "John Brooke. 1996. SUS: A Quick and Dirty Usability Scale. Usability Evaluation in Industry(1996).",
      "doi": ""
    },
    {
      "text": "Stéphane Ciolino, Simon Parkin, and Paul Dunphy. 2019. Of Two Minds about Two-Factor: Understanding Everyday FIDO U2F Usability through Device Comparison and Experience Sampling. In Fifteenth Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Jessica Colnago, Summer Devlin, Maggie Oates, Chelse Swoopes, Lujo Bauer, Lorrie Cranor, and Nicolas Christin. 2018. “It’s not actually that horrible”: Exploring Adoption of Two-Factor Authentication at a University. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3173574.3174030"
    },
    {
      "text": "James Conners, Stephen Derbidge, Corey Devenport, Natalie Farnsworth, Kyler Gates, Stephen Lambert, Christopher McClain, Parker Nichols, and Daniel Zappala. 2022. Let’s Authenticate: Automated Certificates for User Authentication. In Network and Distributed Systems Security (NDSS) Symposium 2022.",
      "doi": ""
    },
    {
      "text": "James Conners and Daniel Zappala. 2019. Let’s authenticate: Automated cryptographic authentication for the web with simple account recovery. In Who Are You?! Adventures in Authentication Workshop (WAY).",
      "doi": ""
    },
    {
      "text": "Harald Cramér. 1946. Mathematical Methods of Statistics. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Sanchari Das, Andrew Dingman, and L Jean Camp. 2018. Why Johnny Doesn’t Use Two Factor: A Two-Phase Usability Study of the FIDO U2F Security Key. In International Conference on Financial Cryptography and Data Security.",
      "doi": "10.1007/978-3-662-58387-6_9"
    },
    {
      "text": "Sanchari Das, Andrew Kim, Ben Jelen, Joshua Streiff, L Jean Camp, and Lesa Huber. 2019. Towards Implementing Inclusive Authentication Technologies for Older Adults. In Who Are You?! Adventures in Authentication Workshop (WAY).",
      "doi": ""
    },
    {
      "text": "Sanchari Das, Gianpaolo Russo, Andrew C Dingman, Jayati Dev, Olivia Kenny, and L Jean Camp. 2018. A Qualitative Study on Usability and Acceptability of Yubico Security Key. In Proceedings of the 7th Workshop on Socio-Technical Aspects in Security and Trust.",
      "doi": "10.1145/3167996.3167997"
    },
    {
      "text": "Sanchari Das, Bingxing Wang, Andrew Kim, and L Jean Camp. 2020. MFA is a Necessary Chore! Exploring User Mental Models of Multi-Factor Authentication Technologies. In 53rd Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Rachna Dhamija, J. D. Tygar, and Marti Hearst. 2006. Why Phishing Works. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/1124772.1124861"
    },
    {
      "text": "Florian M. Farke, Lennart Lorenz, Theodor Schnitzler, Philipp Markert, and Markus Dürmuth. 2020. “You still use the password after all”–Exploring FIDO2 Security Keys in a Small Company. In Sixteenth Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Feitian. 2018. BioPass FIDO Series Biometric Security Keys. https://www.ftsafe.com/products/FIDO/BIO. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Feitian. 2020. iePass FIDO Series iOS Security Key. https://www.ftsafe.com/products/FIDO/iOS. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "FIDO Alliance. 2017. FIDO U2F Raw Message Formats. https://fidoalliance.org/specs/fido-u2f-v1.2-ps-20170411/fido-u2f-raw-message-formats-v1.2-ps-20170411.html. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "FIDO Alliance. 2019. Android now FIDO2 certified, accelerating global migration beyond passwords. https://fidoalliance.org/android-now-fido2-certified-accelerating-global-migration-beyond-passwords/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "FIDO Alliance. 2021. Client to Authenticator Protocol (CTAP). https://fidoalliance.org/specs/fido-v2.1-ps-20210615/fido-client-to-authenticator-protocol-v2.1-ps-20210615.html. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "FIDO Alliance. 2022. FIDO Alliance Member Companies & Organizations. https://fidoalliance.org/members/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "FIDO Alliance. 2022. FIDO Alliance Specifications Overview. https://fidoalliance.org/specifications/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Mikhail Fomichev, Julia Hesse, Lars Almon, Timm Lippert, Jun Han, and Matthias Hollick. 2021. Fastzip: Faster and more secure zero-interaction pairing. In Proceedings of the 19th Annual International Conference on Mobile Systems, Applications, and Services. 440–452.",
      "doi": "10.1145/3458864.3467883"
    },
    {
      "text": "Thomas Franke, Christiane Attig, and Daniel Wessel. 2019. A Personal Resource for Technology Interaction: Development and Validation of the Affinity for Technology Interaction (ATI) Scale. International Journal of Human–Computer Interaction (2019).",
      "doi": ""
    },
    {
      "text": "Nick Frymann, Daniel Gardham, Franziskus Kiefer, Emil Lundberg, Mark Manulis, and Dain Nilsson. 2020. Asynchronous Remote Key Generation: An Analysis of Yubico’s Proposal for W3C WebAuthn. In Proceedings of the 2020 ACM SIGSAC Conference on Computer and Communications Security. New York, NY, USA. https://doi.org/10.1145/3372297.3417292",
      "doi": "10.1145/3372297.3417292"
    },
    {
      "text": "Dennis A. Gioia, Kevin G. Corley, and Aimee L. Hamilton. 2013. Seeking Qualitative Rigor in Inductive Research: Notes on the Gioia Methodology. Organizational Research Methods 16 (2013).",
      "doi": ""
    },
    {
      "text": "Google. 2022. Find, lock, or erase a lost Android device. https://support.google.com/accounts/answer/6160491. [Online; accessed 2022-09-08].",
      "doi": ""
    },
    {
      "text": "GoTrustID. 2022. Smart Badge Authenticator — Idem Card. https://www.gotrustid.com/idem-card. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Seunghun Han, Wook Shin, Jun-Hyeok Park, and HyoungChun Kim. 2018. A bad dream: Subverting trusted platform module while you are sleeping. In 27th USENIX Security Symposium.",
      "doi": ""
    },
    {
      "text": "Blake Ives, Kenneth R. Walsh, and Helmut Schneider. 2004. The Domino Effect of Password Reuse. Commun. ACM 47(2004).",
      "doi": ""
    },
    {
      "text": "Maurice G. Kendall. 1938. A New Measure of Rank Correlation. Biometrika 30(1938).",
      "doi": ""
    },
    {
      "text": "Klaus Krippendorff. 2004. Content Analysis: An Introduction to Its Methodology. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Juan Lang, Alexei Czeskis, Dirk Balfanz, Marius Schilder, and Sampath Srinivas. 2016. Security Keys: Practical Cryptographic Second Factors for the Modern Web. In International Conference on Financial Cryptography and Data Security.",
      "doi": ""
    },
    {
      "text": "Markus Langer, Cornelius J König, and Andromachi Fitili. 2018. Information as a Double-Edged Sword: The Role of Computer Experience and Information on Applicant Reactions Towards Novel Technologies for Personnel Selection. Computers in Human Behavior(2018).",
      "doi": ""
    },
    {
      "text": "Leona Lassak, Annika Hildebrandt, Maximilian Golla, and Blase Ur. 2021. “It’s Stored, Hopefully, on an Encrypted Server”: Mitigating Users’ Misconceptions About FIDO2 Biometric WebAuthn. In 30th USENIX Security Symposium.",
      "doi": ""
    },
    {
      "text": "Sanam Ghorbani Lyastani, Michael Schilling, Michaela Neumayr, Michael Backes, and Sven Bugiel. 2020. Is FIDO2 the Kingslayer of User Authentication? A Comparative Usability Study of FIDO2 Passwordless Authentication. In 2020 IEEE Symposium on Security and Privacy.",
      "doi": ""
    },
    {
      "text": "Henry B. Mann and Donald R. Whitney. 1947. On a Test of Whether one of Two Random Variables is Stochastically Larger than the Other. The Annals of Mathematical Statistics 18 (1947).",
      "doi": ""
    },
    {
      "text": "MDN. 2022. Web Authentication API: Browser compatibility. https://developer.mozilla.org/en-US/docs/Web/API/Web_Authentication_API#browser_compatibility. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Nathan Mercer. 2018. Extending the capabilities of Windows Hello. https://techcommunity.microsoft.com/t5/windows-blog-archive/extending-the-capabilities-of-windows-hello/ba-p/166534. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Sharan B. Merriam and Elizabeth J. Tisdell. 2015. Qualitative Research: A Guide to Design and Implementation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Matus Nemec, Marek Sys, Petr Svenda, Dusan Klinec, and Vashek Matyas. 2017. The return of Coppersmith’s attack: Practical factorization of widely used RSA moduli. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security.",
      "doi": "10.1145/3133956.3133969"
    },
    {
      "text": "Wataru Oogami, Hidehito Gomi, Shuji Yamaguchi, Shota Yamanaka, and Tatsuru Higurashi. 2020. Observation Study on Usability Challenges for Fingerprint Authentication Using WebAuthn-enabled Android Smartphones. In Sixteenth Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Kentrell Owens, Olabode Anise, Amanda Krauss, and Blase Ur. 2021. User Perceptions of the Usability and Security of Smartphones as FIDO2 Roaming Authenticators. In Seventeenth Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Kentrell Owens, Blase Ur, and Olabode Anise. 2020. A Framework for Evaluating the Usability and Security of Smartphones as FIDO2 Roaming Authenticators. In Who Are You?! Adventures in Authentication Workshop (WAY)).",
      "doi": ""
    },
    {
      "text": "Karl Pearson. 1900. X. On the criterion that a given system of deviations from the probable in the case of a correlated system of variables is such that it can be reasonably supposed to have arisen from random sampling. The London, Edinburgh, and Dublin Philosophical Magazine and Journal of Science 50(1900).",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2021. Mobile Fact Sheet. https://www.pewresearch.org/internet/fact-sheet/mobile/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Florentin Putz, Steffen Schön, and Matthias Hollick. 2021. Future-Proof Web Authentication: Bring Your Own FIDO2 Extensions. In Emerging Technologies for Authorization and Authentication (ETAA). Springer.",
      "doi": ""
    },
    {
      "text": "R Core Team. 2022. R: A Language and Environment for Statistical Computing. R Foundation for Statistical Computing.",
      "doi": ""
    },
    {
      "text": "Brian Rasmussen. 2021. A Usability Study of FIDO2 Roaming Software Tokens as a Password Replacement. Master’s thesis. Brigham Young University.",
      "doi": ""
    },
    {
      "text": "Ken Reese, Trevor Smith, Jonathan Dutson, Jonathan Armknecht, Jacob Cameron, and Kent Seamons. 2019. A Usability Study of Five Two-Factor Authentication Methods. In Fifteenth Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Joshua Reynolds, Nikita Samarin, Joseph Barnes, Taylor Judd, Joshua Mason, Michael Bailey, and Serge Egelman. 2020. Empirical Measurement of Systemic 2FA Usability. In 29th USENIX Security Symposium.",
      "doi": "10.5555/3489212.3489220"
    },
    {
      "text": "Joshua Reynolds, Trevor Smith, Ken Reese, Luke Dickinson, Scott Ruoti, and Kent Seamons. 2018. A Tale of Two Studies: The Best and Worst of YubiKey Usability. In 2018 IEEE Symposium on Security and Privacy (SP).",
      "doi": ""
    },
    {
      "text": "Robert Rosenthal. 1991. Meta-Analytic Procedures for Social Research. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Fabian Schwarz, Khue Do, Gunnar Heide, Lucjan Hanzlik, and Christian Rossow. 2022. FeIDo: Recoverable FIDO2 Tokens Using Electronic IDs. In 2022 ACM SIGSAC Conference on Computer and Communications Security (CCS).",
      "doi": "10.1145/3548606.3560584"
    },
    {
      "text": "Samuel S. Shapiro and Martin B. Wilk. 1965. An analysis of variance test for normality (complete samples). Biometrika 52(1965).",
      "doi": ""
    },
    {
      "text": "Statista. 2021. Market share of mobile operating systems in North America from January 2018 to June 2021. https://www.statista.com/statistics/1045192/share-of-mobile-operating-systems-in-north-america-by-month/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Blase Ur, Fumiko Noma, Jonathan Bees, Sean M Segreti, Richard Shay, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2015. \"I Added ’!’at the End to Make It Secure\": Observing Password Creation in the Lab. In Eleventh Symposium On Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Leon van den Boogaard. 2022. User understanding and user acceptance of biometric authentication on mobile phones. Master’s thesis. Radboud University.",
      "doi": ""
    },
    {
      "text": "Jinke D. Van Der Laan, Adriaan Heino, and Dick De Waard. 1997. A Simple Procedure for the Assessment of Acceptance of Advanced Transport Telematics. Transportation Research Part C: Emerging Technologies (1997).",
      "doi": ""
    },
    {
      "text": "Rand Wilcox. 2017. Introduction to Robust Estimation and Hypothesis Testing. Elsevier, Academic Press.",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium. 2021. Web Authentication: An API for Accessing Public Key Credentials Level 2. https://www.w3.org/TR/2021/REC-webauthn-2-20210408/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Leon Würsching, Florentin Putz, Steffen Haesler, and Matthias Hollick. 2023. FIDO2 The Smartphone: Mockup Website for Platform and Roaming Authentication on Smartphones. https://github.com/seemoo-lab/fido2-the-smartphone",
      "doi": ""
    },
    {
      "text": "Leon Würsching, Florentin Putz, Steffen Haesler, and Matthias Hollick. 2023. Lab Study Dataset: FIDO2 Platform and Roaming Authentication on Smartphones. https://doi.org/10.5281/zenodo.7572697",
      "doi": ""
    },
    {
      "text": "Jeff Yan, Alan Blackwell, Ross Anderson, and Alasdair Grant. 2004. Password Memorability and Security: Empirical Results. IEEE Security Privacy 2(2004).",
      "doi": ""
    },
    {
      "text": "Yubico. 2019. Yubico Launches the World’s First Lightning-Compatible Security Key, the YubiKey 5Ci. https://www.yubico.com/press-releases/yubico-launches-the-worlds-first-lightning-compatible-security-key-the-yubikey-5ci/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Yubico. 2022. GitHub: webauthn-recovery-extension. https://github.com/Yubico/webauthn-recovery-extension. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Yubico. 2022. Security Key NFC. https://www.yubico.com/us/product/security-key-nfc-by-yubico/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Yubico. 2022. YubiKey 5C NFC. https://www.yubico.com/us/product/yubikey-5c-nfc/. [Online; accessed 2022-06-07].",
      "doi": ""
    },
    {
      "text": "Yubico. 2022. YubiKey Bio - FIDO Edition. https://www.yubico.com/us/product/yubikey-bio/. [Online; accessed 2022-06-07].",
      "doi": ""
    }
  ]
}