{
  "doi": "10.1145/3544548.3580765",
  "title": "Visual Task Performance and Spatial Abilities: An Investigation of Artists and Mathematicians",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "This study builds on past research to present a domain-specific empirical investigation of artists and math & computer scientists on their respective relationships to, perceptions of, and interactions with data visualization. We conducted a three-phase study utilizing mixed-methods to investigate performance on visual and text representations of data between domains. Our findings evidenced how math & computer scientists are proficient utilizing text representations of data while artists benefit more from visual chart representations. Finally, we present perspectives from artists to gain an understanding of their approach to visual and mathematical tasks. Our findings indicate that artists are especially adept at statistical visual tasks and that development of cognitive skills could be fostered by individuals to potentially benefit visualization task performance.",
  "tags": [
    "spatial ability",
    "bar charts",
    "mixed-methods",
    "visual artists",
    "perception",
    "Human-subjects quantitative studies",
    "domain-specific",
    "education",
    "text representation",
    "cognitive abilities"
  ],
  "authors": [
    {
      "name": "Sara Tandon",
      "institution": "Informatics, King's College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781358",
      "orcid": "0000-0002-4615-6444"
    },
    {
      "name": "Alfie Abdul-Rahman",
      "institution": "Department of Informatics, King's College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81372591106",
      "orcid": "0000-0002-6257-876X"
    },
    {
      "name": "Rita Borgo",
      "institution": "Informatics Department, Kings College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81372592607",
      "orcid": "0000-0003-2875-6793"
    }
  ],
  "references": [
    {
      "text": "James Ainooson and Maithilee Kunda. 2017. A Computational Model for Reasoning About the Paper Folding Task Using Visual Mental Images. Cognitive Science (2017), 1519–1524.",
      "doi": ""
    },
    {
      "text": "Bonnie Angelone, Richard Hass, and Marissa Cohen. 2016. Skill Transfer in Visual Arts Expertise. Psychology of Aesthetics, Creativity, and the Arts 10, 2 (2016), 147–156.",
      "doi": ""
    },
    {
      "text": "Solomon Assefa. 2020. Gauteng Province Launches COVID-19 Dashboard Developed by IBM Research, Wits University and GCRO. IBM Research Blog.",
      "doi": ""
    },
    {
      "text": "Kinnari Atit, Jason Power, Norma Veurink, David H. Uttal, Sheryl A. Sorby, Grace C. Panther, Camille Msall, Logan Fiorella, and Martha M. Carr. 2020. Examining the role of spatial skills and mathematics motivation on middle school mathematics achievement. International Journal of STEM Education 7 (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Jerry Biller. 1996. Reduction of Mathematics Anxiety.ERIC (1996).",
      "doi": ""
    },
    {
      "text": "Rita Borgo, Alfie Abdul-Rahman, Farhan Mohamed, Philip Grant, Irene Reppa, Luciano Floridi, and Min Chen. 2012. An Empirical Study on Using Visual Embellishments in Visualization. IEEE Trans. Vis. & Comp. Grap. 18, 12 (Dec. 2012), 2759–2768.",
      "doi": "10.1109/TVCG.2012.197"
    },
    {
      "text": "Rita Borgo, Luana Micallef, B. Bach, F. McGee, and B. Lee. 2018. Information Visualization Evaluation Using Crowdsourcing. Computer Graphics Forum 37, 3 (July 2018), 573–595.",
      "doi": ""
    },
    {
      "text": "Robert R. Bryan, Shawn M. Glynn, and Julie M. Kittleson. 2011. Motivation, achievement, and advanced placement intent of high school students learning science. Science Education 95(2011), 1049–1065.",
      "doi": ""
    },
    {
      "text": "Lucy Lynn Bryson. 2011. Drama+ math= dramath. Master’s thesis. University of Central Flordia.",
      "doi": ""
    },
    {
      "text": "Michael Burch and Daniel Weiskopf. 2014. On the benefits and drawbacks of radial diagrams. In Handbook of human centric visualization. Springer, 429–451.",
      "doi": ""
    },
    {
      "text": "Bruce D. Campbell and Francesca Samsel. 2015. Pursuing Value in Art-Science Collaborations. IEEE Computer Graphics and Applications 35, 1 (2015), 6–11.",
      "doi": "10.1109/MCG.2015.124"
    },
    {
      "text": "Mona Chalabi. 2022. Visualizations. https://monachalabi.com/.",
      "doi": ""
    },
    {
      "text": "Chaomei Chen. 2000. Individual differences in a spatial-semantic virtual environment. Journal of the American Society for Information Science 51, 6(2000), 529–542.",
      "doi": "10.5555/358242.358261"
    },
    {
      "text": "Chaomei Chen and Mary Czerwinski. 1997. Spatial Ability and Visual Navigation: an Empirical Study. New Review of Hypermedia and Multimedia 3, 1 (1997), 67–89.",
      "doi": ""
    },
    {
      "text": "Cheryl Cohen and Mary Hegarty. 2007. Individual differences in use of external visualizations to perform an internal visualization taks. Applied Cognitive Psychology 21 (2007), 701–711.",
      "doi": ""
    },
    {
      "text": "Janet Lynn Collins. 1982. Self-efficacy and ability in achievement behavior. In Annual Meeting of the American Educational Research Association. (New York).",
      "doi": ""
    },
    {
      "text": "Cristina Conati, Giuseppe Carenini, Enamul Hoque, Ben Steichen, and Dereck Toker. 2014. Evaluating the Impact of User Characteristics and Different Layouts on an Interactive Visualization for Decision Making. Computer Graphics Forum 33, 3 (June 2014), 371–380.",
      "doi": ""
    },
    {
      "text": "Richard Daker, Robert Cortes, Ian Lyons, and Adam Green. 2020. Creativity Anxiety: Evidence for Anxiety That Is Specific to Creative Thinking, From STEM to the Arts. Journal of Experimental Psychology: General 149, 1 (12 2020), 42–47.",
      "doi": ""
    },
    {
      "text": "Ryan Daniel. 2018. Motivation to be an Artist: Insights relevant to mental health. International Journal of Innovation, Creativity and Change 4 (11 2018), 21–32.",
      "doi": ""
    },
    {
      "text": "Aritra Dasgupta, Susannah Burrows, Kyungsik Han, and Philip J. Rasch. 2017. Empirical Analysis of the Subjective Impressions and Objective Measures of Domain Scientists’ Visual Analytic Judgments. Association for Computing Machinery, New York, NY, USA, 1193–1204.",
      "doi": ""
    },
    {
      "text": "Ec.europa.eu. 2020. Tertiary Education Statistics. https://ec.europa.eu/eurostat/statistics-explained/.",
      "doi": ""
    },
    {
      "text": "Elliot Eisner and Kimberly Powell. 2002. Art In Science?Curriculum Inquiry 32, 2 (2002), 131–159.",
      "doi": ""
    },
    {
      "text": "R.B. Ekstrom, J.W. French, H.H. Harman, and D. Derman. 1976. Manual from Kit of Factor-References Cognitive Tests. Educational Testing Service., 286–288 pages.",
      "doi": ""
    },
    {
      "text": "Madison Elliott, Christine Nothelfer, Cindy Xiong, and Danielle Albers Szafir. 2021. A Design Space of Vision Science Methods for Visualization Research. IEEE Trans. Vis. & Comp. Grap. 27, 2 (2021), 1117–1127.",
      "doi": ""
    },
    {
      "text": "Amanda M. Ferguson, Erin A. Maloney, Jonathan Fugelsang, and Evan F. Risko. 2015. On the relation between math and spatial ability: The case of math anxiety. Learning and Individual Differences 39 (2015), 1–12.",
      "doi": ""
    },
    {
      "text": "Aurelio José Figueredo, Steven Charles Hertler, and Mateo Peñaherrera-Aguirre. 2020. The Biogeography of Human Diversity in Cognitive Ability. Evolutionary Psychological Science(2020), 1–18.",
      "doi": ""
    },
    {
      "text": "Michael Friendly. 2008. A Brief History of Data Visualization. In Handbook of Data Visualization (Berlin). Springer Handbooks Comp. Statistics.",
      "doi": ""
    },
    {
      "text": "Colleen M. Ganley and Marina Vasilyeva. 2011. Sex differences in the relation between math performance, spatial skills, and attitudes. Journal of Applied Developmental Psychology 32, 4 (2011), 235–242.",
      "doi": ""
    },
    {
      "text": "Shawn M. Glynn, Gita Taasoobshirazi, and Peggy Brickman. 2009. Science Motivation Questionnaire: Construct Validation With Nonscience Majors. Journal of Research in Science Teaching 46 (2009), 127–146.",
      "doi": ""
    },
    {
      "text": "Lynn Goldsmith, Lois Hetland, Craig Hoyle, and Ellen Winner. 2016. Visual-Spatial Thinking in Geometry and the Visual Arts. Psychology of Aesthetics, Creativity, and the Arts 10, 1 (2016), 56–71.",
      "doi": ""
    },
    {
      "text": "Sander Greenland, Stephen J Senn, Kenneth J. Rothman, John B. Carlin, Charles L Poole, Steven N. Goodman, and Douglas G. Altman. 2016. Statistical tests, P values, confidence intervals, and power: a guide to misinterpretations. European Journal of Epidemiology 31 (2016), 337–350.",
      "doi": ""
    },
    {
      "text": "Kyle Wm. Hall, Adam James Bradley, Uta Hinrichs, Samuel Huron, Jo Wood, Christopher M. Collins, and M. Sheelagh T. Carpendale. 2020. Design by Immersion: A Transdisciplinary Approach to Problem-Driven Visualizations. IEEE Trans. Vis. & Comp. Grap. 26, 1 (2020), 109–118.",
      "doi": ""
    },
    {
      "text": "Kyle Wm. Hall, Anthony Kouroupis, Anastasia Bezerianos, Danielle Albers Szafir, and Christopher M. Collins. 2022. Professional Differences: A Comparative Study of Visualization Task Performance and Spatial Ability Across Disciplines. IEEE Trans. Vis. & Comp. Grap. 28, 1 (2022), 654–664.",
      "doi": "10.1109/TVCG.2021.3114805"
    },
    {
      "text": "Harvard: Civic Analytics Network. 2022. COVID-19 Dashboards: Examples from the Civic Analytics Network. Datasmart.ash.harvard.edu. https://datasmart.ash.harvard.edu/news/article/covid-19-dashboards-examples-civic-analytics-network",
      "doi": ""
    },
    {
      "text": "Mary Hegarty. 2004. Diagrams in the Mind and in the World: Relations between Internal and External Visualizations. In Diagrammtic representation and inference. Springer, 1–13.",
      "doi": ""
    },
    {
      "text": "Zorana Ivcevic, Eliana Grossman, and Apara Ranjan. 2022. Patterns of Psychological Vulnerabilities and Resources in Artists and Nonartists. Psychology of Aesthetics, Creativity, and the Arts 16, 1 (2022), 3–15.",
      "doi": ""
    },
    {
      "text": "Catherine Jones, Victoria Braithwaite, and Susan Healy. 2003. The Evolution of Sex Differences in Spatial Ability. Behavioral Neuroscience 117, 3 (2003), 403–411.",
      "doi": ""
    },
    {
      "text": "Sue Jones and Gary Burnett. 2008. Spatial Ability and Learning to Program. Human Technology 4, 1 (2008), 47–61.",
      "doi": ""
    },
    {
      "text": "Kwanghee Jung, Jaehoon Lee, Vibhuti Gupta, and Gyeongcheol Cho. 2019. Comparison of Bootstrap Confidence Interval Methods for GSCA Using a Monte Carlo Simulation. Frontiers in Psychology 10 (2019).",
      "doi": ""
    },
    {
      "text": "Yalcin Karali. 2021. Interdisciplinary Approach in Primary School Mathematics Education. Education Quarterly Reviews 4, 4 (2021).",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Katharina Reinecke, and Jessica Hullman. 2017. Explaining the Gap: Visualizing One’s Predictions Improves Recall and Comprehension of Data. In ACM Conf. Human Factors - CHI. 1375–1386.",
      "doi": "10.1145/3025453.3025592"
    },
    {
      "text": "Robert M. Kirby and Miriah Meyer. 2013. Visualization Collaborations: What Works and Why. IEEE Computer Graphics and Applications 33, 6 (2013), 82–88.",
      "doi": "10.1109/MCG.2013.101"
    },
    {
      "text": "Robert Kosara, Fritz Drury, Lars Erik Holmquist, and David H. Laidlaw. 2008. Visualization Criticism. IEEE Computer Graphics and Applications 28, 3 (2008), 13–15.",
      "doi": "10.1109/MCG.2008.63"
    },
    {
      "text": "Charles Kostelnick. 2016. The re-emergence of emotional appeals in interactive data visualization. Technical Communication 63, 2 (2016), 116–135.",
      "doi": ""
    },
    {
      "text": "Andres Ledesma, Mohammed Al-Musawi, and Hannu Nieminen. 2016. Health figures: an open source JavaScript library for health data visualization. BMC medical informatics and decision making 16, 1 (2016), 1–19.",
      "doi": ""
    },
    {
      "text": "Qi Li. 2018. Data Visualization as Creative Art Practice. Visual Communication 17, 3 (2018), 299–312.",
      "doi": ""
    },
    {
      "text": "Tom Lowrie and Carmel Diezmann. 2007. Solving Graphics Problems: Student Performance in Junior Grades. Journal of Educational Research 100, 6 (2007), 369–378.",
      "doi": ""
    },
    {
      "text": "Adam V Maltese, Joseph A Harsh, and Dubravka Svetina. 2015. Data visualization literacy: Investigating data interpretation along the novice—expert continuum. Journal of College Science Teaching 45, 1 (2015), 84–90.",
      "doi": ""
    },
    {
      "text": "Richard Mayer. 2014. Cognitive theory of multimedia learning. Cambridge handbook of multimedia learning 43 (2014).",
      "doi": ""
    },
    {
      "text": "Joachim Meyer, David Shinar, and David Leiser. 1997. Multiple Factors That Determine Performance with Tables and Graphs. Human Factors 39, 2 (1997), 86–268.",
      "doi": ""
    },
    {
      "text": "Luana Micallef, Pierre Dragicevic, and Jean-Daniel Fekete. 2012. Assessing the Effect of Visualizations on Bayesian Reasoning through Crowdsourcing. IEEE Trans. Vis. & Comp. Grap. 18, 12 (2012), 2536–2545.",
      "doi": "10.1109/TVCG.2012.199"
    },
    {
      "text": "William Burton Michael, J Paul Guilford, Benjamin Fruchter, and Wayne S. Zimmerman. 1957. The Description of Spatial-Visualization Abilities. Educational and Psychological Measurement 17 (1957), 185–199.",
      "doi": ""
    },
    {
      "text": "Microsoft: PowerBI Community. 2020. COVID-19 Data Stories Gallery. Community.powerbi.com.",
      "doi": ""
    },
    {
      "text": "George A. Miller. 1956. The magical number seven plus or minus two: some limits on our capacity for processing information.Psychological review 63 2 (1956), 81–97.",
      "doi": ""
    },
    {
      "text": "Kelly S. Mix and Yi-Ling Cheng. 2012. Chapter 6 - The Relation Between Space and Math: Developmental and Educational Implications. In Advances in Child Development and Behavior, Janette B. Benson (Ed.). Vol. 42. JAI, 197–243.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2009. A Nested Model for Visualization Design and Validation. IEEE Trans. Vis. & Comp. Grap. 15, 6 (2009), 921–928.",
      "doi": "10.1109/TVCG.2009.111"
    },
    {
      "text": "Nadim Nachar 2008. The Mann-Whitney U: A test for assessing whether two independent samples come from the same distribution. Tutorials in quantitative Methods for Psychology 4, 1 (2008), 13–20.",
      "doi": ""
    },
    {
      "text": "Alvitta Ottley, Evan M. Peck, Lane Harrison, Daniel Afergan, Caroline Ziemkiewicz, Holly Taylor, Paul Han, and Remco Chang. 2016. Improving Bayesian Reasoning: The Effects of Phrasing, Visualization, and Spatial Ability. IEEE Trans. Vis. & Comp. Grap. 22, 1 (Jan. 2016).",
      "doi": "10.1109/TVCG.2015.2467758"
    },
    {
      "text": "Katja Paessler and Benedikt Hell. 2012. Do Interests and Cognitive Abilities Help Explain College Major Choice Equally Well for Women and Men?Journal of Career Assessment 20, 4 (2012), 479–496.",
      "doi": ""
    },
    {
      "text": "Stefan Palan and Christian Schitter. 2017. Prolific.ac—A subject pool for online experiments. Journal of Behavioral and Experimental Finance 17 (12 2017).",
      "doi": ""
    },
    {
      "text": "Dorit Patkin and Ester Dayan. 2012. The intelligence of observation: improving high school students’ spatial ability by means of intervention unit. International Journal of Mathematical Education in Science and Technology 44, 2 (July 2012), 179–195.",
      "doi": ""
    },
    {
      "text": "Evan M. Peck, Sofia E. Ayuso, and Omar El-Etr. 2019. Data is Personal: attitudes and perception of data visualization in rural pennsylvania. In ACM Conf. Human Factors - CHI. 1–12.",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Evan M Peck, Beste F Yuksel, Lane Harrison, Alvitta Ottley, and Remco Chang. 2012. Towards a 3-Dimensional Model of Individual Cognitive Differences: Position Paper. In ACM Conf. Human Factors - CHI (Seattle, Washington, USA) (BELIV ’12). New York, NY, USA, 6 pages.",
      "doi": "10.1145/2442576.2442582"
    },
    {
      "text": "Marie-Therese Puth, Markus Neuhäuser, and Graeme D. Ruxton. 2015. On the variety of methods for calculating confidence intervals by bootstrapping.The Journal of animal ecology 84 (2015), 892–7.",
      "doi": ""
    },
    {
      "text": "Severino Ribecca. 2022. The Data Visualisation Catalogue. https://datavizcatalogue.com/.",
      "doi": ""
    },
    {
      "text": "Hannah Ritchie, Edouard Mathieu, Lucas Rodés-Guirao, Cameron Appel, Charlie Giattino, Esteban Ortiz-Ospina, Joe Hasell, Bobbie Macdonald, Diana Beltekian, and Max Roser. 2022. Coronavirus Pandemic (COVID-19) - Our World in Data. https://ourworldindata.org/coronavirus.",
      "doi": ""
    },
    {
      "text": "Sara Salloum. 2019. An Artistic Data Visualization of Pollution at Earlham College. (2019).",
      "doi": ""
    },
    {
      "text": "Timothy Salthouse, Renée L. Babcock, Eric Skovronek, Debora R. D. Mitchell, and Ron Palmon. 1990. Age and Experience Effects in Spatial Visualization. Developmental Psychology 26 (1990), 128–136.",
      "doi": ""
    },
    {
      "text": "Anna Schudy, Karolina Zurek, Marcelina Wisniewska, Aleksandra Piejka, Lukasz Gaweda, and Lukasz Okruszek. 2020. Mental well-being during pandemic: the role of cognitive biases and emotion regulation strategies in risk perception and affective response to COVID-19. Frontiers in psychiatry 11 (2020), 589973.",
      "doi": ""
    },
    {
      "text": "Michael Sedlmair, Miriah Meyer, and Tamara Munzner. 2012. Design Study Methodology: Reflections from the Trenches and the Stacks. IEEE Trans. Vis. & Comp. Grap. 18, 12 (2012), 2431–2440.",
      "doi": "10.1109/TVCG.2012.213"
    },
    {
      "text": "Daniel L. Shea, David Lubinski, and Camilla Persson Benbow. 2001. Importance of Assessing Spatial Ability in Intellectually Talented Young Adolescents: A 20-Year Longitudinal Study.Journal of Educational Psychology 93 (2001), 604–614.",
      "doi": ""
    },
    {
      "text": "Jiye Shen, Eyal M. Reingold, and Marc Pomplun. 2003. Guidance of eye movements during conjunctive visual search: the distractor-ratio effect.Canadian journal of experimental psychology 57 (2003), 76–96.",
      "doi": ""
    },
    {
      "text": "Svenja Simon, Sebastian Mittelstädt, Daniel A. Keim, and Michael Sedlmair. 2015. Bridging the Gap of Domain and Visualization Experts with a Liaison. In Eurographics Conference on Visualization (EuroVis) - Short Papers, E. Bertini, J. Kennedy, and E. Puppo (Eds.). The Eurographics Association.",
      "doi": ""
    },
    {
      "text": "K.M. Stanney and G. Salvendy. 1995. Information Visualization: Assisting low spatial inidviduals with information access tasks through the use of visual mediators. Ergonomics 38, 6 (1995), 1184–1198.",
      "doi": ""
    },
    {
      "text": "Keith Stenning and Jon Oberlander. 1995. A cognitive theory of graphical and linguistic reasoning: Logic and implementation. Cognitive Science 19, 1 (1995), 97–140.",
      "doi": ""
    },
    {
      "text": "Tableau LLC. 2020. Global COVID-19 Tracker. Public.tableau.com.",
      "doi": ""
    },
    {
      "text": "Sara Tandon, Alfie Abdul-Rahman, and Rita Borgo. 2022. Measuring Effects of Spatial Visualization and Domain On Visualization Task Performance: A Comparative Study. IEEE Transactions on Visualization and Computer Graphics (2022), 1–11.",
      "doi": ""
    },
    {
      "text": "Anne Treisman and Sharon Sato. 1990. Conjunction Search Revisited. Journal of Experimental Psychology: Human Perception and Performance 16, 3(1990), 459–478.",
      "doi": ""
    },
    {
      "text": "Jacquelyn D Tretter. 2012. Mathematics anxiety in ninth-grade pre-algebra. Master’s thesis. Western Kentucky University.",
      "doi": ""
    },
    {
      "text": "Susan VanderPlas and Heike Hofmann. 2016. Spatial Reasoning and Data Displays. IEEE Trans. Vis. & Comp. Grap. 22, 1 (Jan. 2016), 459–568.",
      "doi": "10.1109/TVCG.2015.2469125"
    },
    {
      "text": "M.C. Velez, D. Silver, and M. Tremaine. 2005. Understanding visualization through spatial ability differences. In Vis ’05. IEEE, Minneapolis, MN.",
      "doi": ""
    },
    {
      "text": "Jonathan Wai, David Lubinski, and Camilla Persson Benbow. 2009. Spatial ability for STEM domains: Aligning over 50 years of cumulative psychological knowledge solidifies its importance.Journal of Educational Psychology 101 (2009), 817–835.",
      "doi": ""
    },
    {
      "text": "Colin Ware. 2004. Information visualization: Perception for design. Elsevier Science & Technology.",
      "doi": "10.5555/2285540"
    },
    {
      "text": "Luo Wenhong. 2019. User Choice of Interactive Data Visualization Format: The effects of Cognitive style and Spatial Ability. Decision Support Systems 122 (2019).",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2022. WHO Coronavirus (COVID-19) Dashboard. https://covid19.who.int/.",
      "doi": ""
    },
    {
      "text": "Cindy Xiong, Lisanne Van Weelden, and Steven Franconeri. 2020. The Curse of Knowledge in Visual Data Communication. IEEE Trans. Vis. & Comp. Grap. 26, 10 (2020), 3051–3062.",
      "doi": ""
    },
    {
      "text": "Christopher Young, Susan C. Levine, and Kelly S. Mix. 2018. The Connection Between Spatial and Mathematical Ability Across Development. Frontiers in Psychology 9 (2018).",
      "doi": ""
    },
    {
      "text": "Robert D. Zettle and Susan J. Raines. 2000. The relationship of trait and test anxiety with mathematics anxiety. College Student Journal 34, 2 (2000), 246.",
      "doi": ""
    },
    {
      "text": "Caroline Ziemkiewicz and Robert Kosara. 2009. Perceptions and individual differences in understanding visual metaphors. IEEE-VGTC Symposium on Visualization 28, 3 (2009).",
      "doi": ""
    },
    {
      "text": "Caroline Ziemkiewicz, Alvitta Ottley, Jordan Crouser, Ashley Yauilla, Sara Su, William Ribarsky, and Remco Chang. 2013. How visualization layout relates to locus of control and other personality factors. IEEE Trans. Vis. & Comp. Grap. 19, 7 (July 2013), 1109–1121. https://doi.org/10.1109/TVCG.2012.180",
      "doi": "10.1109/TVCG.2012.180"
    }
  ]
}