{
  "doi": "10.1145/3544548.3580821",
  "title": "Humorous Robotic Behavior as a New Approach to Mitigating Social Awkwardness",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Social awkwardness is a frequent challenge to healthy social interactions and can dramatically impact how people feel, communicate and behave. It is known that humor can invoke positive feelings and enable people to modify perspective of a situation. We explored whether using a non-humanoid robotic object performing humorous behavior can reduce social awkwardness between two strangers. The robot was peripherally incorporated into the interaction to ensure the natural social flow. We compared the impact of humorous and non-humorous robotic gestures on the human-human interaction. Objective and subjective measures indicate that despite being peripheral to the human-human interaction, the humorous robotic gestures significantly reduced the intensity of awkwardness between the strangers. Our findings suggest humorous robotic behavior can be used to enhance interpersonal relationships hindered by awkwardness and still preserve natural human-human interaction.",
  "tags": [
    "Social robot",
    "Human-Human-Robot Interaction",
    "Humor-Computer Interaction",
    "HRI",
    "Humor",
    "Social Awkwardness",
    "HCI",
    "Non-humanoid robots"
  ],
  "authors": [
    {
      "name": "Viva Sarah Press",
      "institution": "Media Innovation Lab, Reichman University, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234328",
      "orcid": "0000-0001-7826-9796"
    },
    {
      "name": "Hadas Erel",
      "institution": "Media Innovation Lab, Reichman University, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260836",
      "orcid": "0000-0001-7099-6104"
    }
  ],
  "references": [
    {
      "text": "Millicent H Abel. 2002. Humor, stress, and coping strategies. (2002).",
      "doi": ""
    },
    {
      "text": "Daniel Algom, Eran Chajut, and Shlomo Lev. 2004. A rational look at the emotional stroop phenomenon: a generic slowdown, not a stroop effect.Journal of experimental psychology: General 133, 3 (2004), 323.",
      "doi": ""
    },
    {
      "text": "Patrícia Alves-Oliveira, Pedro Sequeira, and Ana Paiva. 2016. The role that an educational robot plays. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 817–822.",
      "doi": "10.1109/ROMAN.2016.7745213"
    },
    {
      "text": "Lucy Anderson-Bashan, Benny Megidish, Hadas Erel, Iddo Wald, Guy Hoffman, Oren Zuckerman, and Andrey Grishko. 2018. The greeting machine: an abstract robotic object for opening encounters. In 2018 27th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 595–602.",
      "doi": "10.1109/ROMAN.2018.8525516"
    },
    {
      "text": "Ratih Devi Aryanti, Erita Yuliasesti Diah Sari, and Herlina Siwi Widiana. 2020. A Literature Review of Workplace Well-Being. In International Conference on Community Development (ICCD 2020). Atlantis Press, 605–609.",
      "doi": ""
    },
    {
      "text": "Salvatore Attardo and Victor Raskin. 1991. Script theory revis (it) ed: Joke similarity and joke representation model. (1991).",
      "doi": ""
    },
    {
      "text": "Laura Aymerich-Franch. 2020. Why it is time to stop ostracizing social robots. Nature Machine Intelligence 2, 7 (2020), 364–364.",
      "doi": ""
    },
    {
      "text": "Christoph Bartneck, Dana Kulić, Elizabeth Croft, and Susana Zoghbi. 2009. Measurement instruments for the anthropomorphism, animacy, likeability, perceived intelligence, and perceived safety of robots. International journal of social robotics 1, 1 (2009), 71–81.",
      "doi": ""
    },
    {
      "text": "Henri Bergson, Cloudesley Shovell Henry Brereton, and Fred Rothwell. 1914. Laughter: An essay on the meaning of the comic. Macmillan.",
      "doi": ""
    },
    {
      "text": "Kim Binsted 1995. Using humour to make natural language interfaces more friendly. In Proceedings of the ai, alife and entertainment workshop, intern. Joint conf. On artificial intelligence.",
      "doi": ""
    },
    {
      "text": "Kim Binsted, Anton Nijholt, Oliviero Stock, Carlo Strapparava, G Ritchie, R Manurung, H Pain, Annalu Waller, and D O’Mara. 2006. Computational humor. IEEE Intelligent Systems 21, 2 (2006), 59–69.",
      "doi": "10.1109/MIS.2006.22"
    },
    {
      "text": "Frank Biocca, Chad Harms, and Judee K Burgoon. 2003. Toward a more robust theory and measure of social presence: Review and suggested criteria. Presence: Teleoperators & virtual environments 12, 5(2003), 456–480.",
      "doi": ""
    },
    {
      "text": "Lynn Bloomberg, James Meyers, and Marc T Braverman. 1994. The importance of social interaction: a new perspective on social epidemiology, social risk factors, and health. Health Education Quarterly 21, 4 (1994), 447–463.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Pavel Braslavski, Vladislav Blinov, Valeria Bolotova, and Katya Pertsova. 2018. How to evaluate humorous response generation, seriously?. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval. 225–228.",
      "doi": "10.1145/3176349.3176879"
    },
    {
      "text": "Cynthia Breazeal, Cory D Kidd, Andrea Lockerd Thomaz, Guy Hoffman, and Matt Berlin. 2005. Effects of nonverbal communication on efficiency and robustness in human-robot teamwork. In 2005 IEEE/RSJ international conference on intelligent robots and systems. IEEE, 708–713.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal, Atsuo Takanishi, and Tetsunori Kobayashi. 2008. Social robots that interact with people.",
      "doi": ""
    },
    {
      "text": "Judee K Burgoon and Jerold L Hale. 1984. The fundamental topoi of relational communication. Communication Monographs 51, 3 (1984), 193–214.",
      "doi": ""
    },
    {
      "text": "Fabio Buttussi and Luca Chittaro. 2019. Humor and fear appeals in animated pedagogical agents: An evaluation in aviation safety education. IEEE Transactions on Learning Technologies 13, 1 (2019), 63–76.",
      "doi": ""
    },
    {
      "text": "What Social Robots Can, Should Do J Seibt, 2016. A generic scale for assessment of attitudes towards social robots: The ASOR-5. What Social Robots Can and Should Do: Proceedings of Robophilosophy 2016/TRANSOR 2016 290(2016), 45.",
      "doi": ""
    },
    {
      "text": "Arnie Cann, Lawrence G Calhoun, and Janet S Banks. 1997. On the role of humor appreciation in interpersonal attraction: It’s no joking matter. (1997).",
      "doi": ""
    },
    {
      "text": "Arnie Cann, Lawrence G Calhoun, and Jamey T Nance. 2000. Exposure to humor before and after an unpleasant stimulus: Humor as a preventative or a cure. (2000).",
      "doi": ""
    },
    {
      "text": "Arnie Cann and Chantal Collette. 2014. Sense of Humor, Stable Affect, and Psychological Well-Being. Europe’s Journal of Psychology 10, 3 (Aug. 2014), 464–479. https://doi.org/10.5964/ejop.v10i3.746",
      "doi": ""
    },
    {
      "text": "Arnie Cann, Kitty Holt, and Lawrence G Calhoun. 1999. The roles of humor and sense of humor in responses to stressors. (1999).",
      "doi": ""
    },
    {
      "text": "Noël Carroll. 2006. Philosophizing through the Moving Image: The Case of\" Serene Velocity\". The Journal of Aesthetics and Art Criticism 64, 1 (2006), 173–185.",
      "doi": ""
    },
    {
      "text": "Noël Carroll. 2014. Humour: A very short introduction. OUP Oxford.",
      "doi": ""
    },
    {
      "text": "Antony J. Chapman. 1983. Humor and Laughter in Social Interaction and some Implications for Humor Research. Springer New York, New York, NY, 135–157. https://doi.org/10.1007/978-1-4612-5572-7_7",
      "doi": ""
    },
    {
      "text": "Jonathan M Cheek and Arnold H Buss. 1981. Shyness and sociability.Journal of personality and social psychology 41, 2(1981), 330.",
      "doi": ""
    },
    {
      "text": "Francesca MM Citron, Brendan S Weekes, and Evelyn C Ferstl. 2013. Effects of valence and arousal on written word recognition: Time course and ERP correlates. Neuroscience letters 533(2013), 90–95.",
      "doi": ""
    },
    {
      "text": "Herbert H Clark. 1996. Using language. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Joshua W Clegg. 2007. An inquiry into social awkwardness. Clark University.",
      "doi": ""
    },
    {
      "text": "Joshua W Clegg. 2012. The importance of feeling awkward: A dialogical narrative phenomenology of socially awkward situations. Qualitative Research in Psychology 9, 3 (2012), 262–278.",
      "doi": ""
    },
    {
      "text": "Joshua W Clegg. 2012. Stranger situations: Examining a self-regulatory model of socially awkward encounters. Group processes & intergroup relations 15, 6 (2012), 693–712.",
      "doi": ""
    },
    {
      "text": "Ruth Anne Kinsman Dean and Joanne E Major. 2008. From critical care to comfort care: the sustaining value of humour. Journal of clinical nursing 17, 8 (2008), 1088–1095.",
      "doi": ""
    },
    {
      "text": "Laurence Devillers. 2021. Human–Robot Interactions and Affective Computing: The Ethical Implications. In Robotics, AI, and Humanity. Springer, Cham, 205–211.",
      "doi": ""
    },
    {
      "text": "Laurence Devillers, Sophie Rosset, Guillaume Dubuisson Duplessis, Lucile Bechade, Yucel Yemez, Bekir B Turker, Metin Sezgin, Engin Erzin, Kevin El Haddad, Stephane Dupont, 2018. Multifaceted engagement in social interaction with a machine: The joker project. In 2018 13th IEEE International Conference on Automatic Face & Gesture Recognition (FG 2018). IEEE, 697–701.",
      "doi": "10.1109/FG.2018.00110"
    },
    {
      "text": "Laurence Devillers, Sophie Rosset, Guillaume Dubuisson Duplessis, Mohamed A Sehili, Lucile Béchade, Agnes Delaborde, Clément Gossart, Vincent Letard, Fan Yang, Yücel Yemez, 2015. Multimodal data collection of human-robot humorous interactions in the joker project. In 2015 international conference on affective computing and intelligent interaction (ACII). IEEE, 348–354.",
      "doi": "10.1109/ACII.2015.7344594"
    },
    {
      "text": "Merriam Webster Dictionary. 2016. Merriam webster dictionary and thesaurus. Retrieved from: www. merriam-webster. com(2016).",
      "doi": ""
    },
    {
      "text": "James Dimmock, Amanda E Krause, Amanda Rebar, and Ben Jackson. 2022. Relationships between social interactions, basic psychological needs, and wellbeing during the COVID-19 pandemic. Psychology & health 37, 4 (2022), 457–469.",
      "doi": ""
    },
    {
      "text": "Brian R Duffy. 2003. Anthropomorphism and the social robot. Robotics and autonomous systems 42, 3-4 (2003), 177–190.",
      "doi": ""
    },
    {
      "text": "Patricia M Duronto, Tsukasa Nishida, and Shin-ichi Nakayama. 2005. Uncertainty, anxiety, and avoidance in communication with strangers. International Journal of Intercultural Relations 29, 5 (2005), 549–560.",
      "doi": ""
    },
    {
      "text": "Sophia F Dziegielewski. 2003. Humor: An essential communication tool in therapy. International Journal of Mental Health 32, 3 (2003), 74–90.",
      "doi": ""
    },
    {
      "text": "Nicholas Epley and Juliana Schroeder. 2014. Mistakenly seeking solitude.Journal of Experimental Psychology: General 143, 5 (2014), 1980.",
      "doi": ""
    },
    {
      "text": "Hadas Erel, Elior Carsenti, and Oren Zuckerman. 2022. A Carryover Effect in HRI: Beyond Direct Social Effects in Human-Robot Interaction. In Proceedings of the 2022 ACM/IEEE International Conference on Human-Robot Interaction. 342–352.",
      "doi": ""
    },
    {
      "text": "Hadas Erel, Yoav Cohen, Klil Shafrir, Sara Daniela Levy, Idan Dov Vidra, Tzachi Shem Tov, and Oren Zuckerman. 2021. Excluded by robots: Can robot-robot-human interaction lead to ostracism?. In Proceedings of the 2021 ACM/IEEE International Conference on Human-Robot Interaction. 312–321.",
      "doi": "10.1145/3434073.3444648"
    },
    {
      "text": "Hadas Erel, Guy Hoffman, and Oren Zuckerman. 2018. Interpreting non-anthropomorphic robots’ social gestures. In Proceedings of the 2018 ACM/IEEE international conference on Human-Robot Interaction, Chicago, Illinois. ACM.",
      "doi": ""
    },
    {
      "text": "Hadas Erel, Tzachi Shem Tov, Yoav Kessler, and Oren Zuckerman. 2019. Robots are Always Social: Robotic Movements are Automatically Interpreted as Social Cues. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3290607.3312758"
    },
    {
      "text": "Hadas Erel, Denis Trayman, Chen Levy, Adi Manor, Mario Mikulincer, and Oren Zuckerman. 2022. Enhancing Emotional Support: The Effect of a Robotic Object on Human–Human Support Quality. International Journal of Social Robotics 14, 1 (2022), 257–276.",
      "doi": ""
    },
    {
      "text": "Zachary Estes and Michelle Verges. 2008. Freeze or flee? Negative stimuli elicit selective responding. Cognition 108, 2 (2008), 557–565.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi. 2007. How robotic products become social products: an ethnographic study of cleaning in the home. In 2007 2nd ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 129–136.",
      "doi": "10.1145/1228716.1228734"
    },
    {
      "text": "Sigmund Freud. 1928. Humour. International Journal of Psycho-Analysis 9 (1928), 1–6.",
      "doi": ""
    },
    {
      "text": "Anne Galletta. 2013. Mastering the semi-structured interview and beyond: From research design to analysis and publication. Vol. 18. NYU press.",
      "doi": ""
    },
    {
      "text": "Stella Garcia, Linda Stinson, William Ickes, Victor Bissonnette, and Stephen R Briggs. 1991. Shyness and physical attractiveness in mixed-sex dyads.Journal of Personality and Social Psychology 61, 1(1991), 35.",
      "doi": ""
    },
    {
      "text": "Maggie Geuens and Patrick De Pelsmacker. 1998. Need for cognition and the moderating role of the intensity of warm and humorous advertising appeals. ACR Asia-Pacific Advances(1998).",
      "doi": ""
    },
    {
      "text": "G Gibbs. 2008. Analysing qualitative data (Qualitative research kit). Retrieved from (2008).",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1955. On face-work: An analysis of ritual elements in social interaction. Psychiatry 18, 3 (1955), 213–231.",
      "doi": ""
    },
    {
      "text": "Carina Soledad González-González, Verónica Violant-Holz, and Rosa Maria Gil-Iranzo. 2021. Social robots in hospitals: a systematic review. Applied Sciences 11, 13 (2021), 5976.",
      "doi": ""
    },
    {
      "text": "Elizabeth E Graham, Michael J Papa, and Gordon P Brooks. 1992. Functions of humor in conversation: Conceptualization and measurement. Western Journal of Communication (Includes Communication Reports) 56, 2(1992), 161–183.",
      "doi": ""
    },
    {
      "text": "Julienne A Greer. 2017. Method and improvisation: Theatre arts performance techniques to further HRI in social and affective robots. In 2017 26th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 1255–1260.",
      "doi": "10.1109/ROMAN.2017.8172465"
    },
    {
      "text": "Victoria Groom and Clifford Nass. 2007. Can robots be teammates?: Benchmarks in human–robot teams. Interaction studies 8, 3 (2007), 483–500.",
      "doi": ""
    },
    {
      "text": "Gul Gunaydin, Hazal Oztekin, Deniz Hazal Karabulut, and Selin Salman-Engin. 2021. Minimal social interactions with strangers predict greater subjective well-being. Journal of Happiness Studies 22, 4 (2021), 1839–1853.",
      "doi": ""
    },
    {
      "text": "Stephanie J Hanrahan and Rachel A Pedro. 2017. Team-building activities in dance classes and discoveries from reflective essays. Asia-Pacific Journal of Health, Sport and Physical Education 8, 1(2017), 53–66.",
      "doi": ""
    },
    {
      "text": "Guy Hoffman, Oren Zuckerman, Gilad Hirschberger, Michal Luria, and Tal Shani-Sherman. 2015. Design and evaluation of a peripheral robotic conversation companion. In 2015 10th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 3–10.",
      "doi": "10.1145/2696454.2696495"
    },
    {
      "text": "Jess Hohenstein and Malte Jung. 2018. AI-supported messaging: An investigation of human-human text conversation with AI support. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3170427.3188487"
    },
    {
      "text": "Julianne Holt-Lunstad, Timothy B Smith, and J Bradley Layton. 2010. Social relationships and mortality risk: a meta-analytic review. PLoS medicine 7, 7 (2010), e1000316.",
      "doi": ""
    },
    {
      "text": "Amy Huggard, Anushka De Mel, Jayden Garner, Cagdas’ Chad’ Toprak, Alan Chatham, and Florian’Floyd’ Mueller. 2013. Musical embrace: Exploring social awkwardness in digital games. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. 725–728.",
      "doi": "10.1145/2493432.2493518"
    },
    {
      "text": "Katherine Isbister, Hideyuki Nakanishi, Toru Ishida, and Cliff Nass. 2000. Helper agent: Designing an assistant for human-human interaction in a virtual meeting space. In Proceedings of the SIGCHI conference on Human factors in computing systems. 57–64.",
      "doi": "10.1145/332040.332407"
    },
    {
      "text": "Pradthana Jarusriboonchai, Aris Malapaschas, and Thomas Olsson. 2016. Design and evaluation of a multi-player mobile game for icebreaking activity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4366–4377.",
      "doi": "10.1145/2858036.2858298"
    },
    {
      "text": "Pradthana Jarusriboonchai, Thomas Olsson, Jarno Ojala, and Kaisa Väänänen-Vainio-Mattila. 2014. Opportunities and challenges of mobile applications as\" tickets-to-talk\" a scenario-based user study. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia. 89–97.",
      "doi": "10.1145/2677972.2677993"
    },
    {
      "text": "Malte F Jung, Dominic DiFranzo, Solace Shen, Brett Stoll, Houston Claure, and Austin Lawrence. 2020. Robot-assisted tower construction—a method to study the impact of a robot’s allocation behavior on interpersonal dynamics and collaboration in groups. ACM Transactions on Human-Robot Interaction (THRI) 10, 1 (2020), 1–23.",
      "doi": "10.1145/3394287"
    },
    {
      "text": "Kleomenis Katevas, Patrick GT Healey, and Matthew Tobias Harris. 2014. Robot stand-up: engineering a comic performance. In Proceedings of the workshop on humanoid robots and creativity at the IEEE-RAS international conference on humanoid robots humanoids (Madrid). Citeseer.",
      "doi": ""
    },
    {
      "text": "Sahar Khademi. 2022. A Review of Silence in Conversation: Discoursal Perspective. International Journal of Language and Translation Research 2, 1(2022), 51–67.",
      "doi": ""
    },
    {
      "text": "A. Kotsko. 2010. Awkwardness. O Books. https://books.google.co.il/books?id=bxvaV6hjdjYC",
      "doi": ""
    },
    {
      "text": "Nicholas A Kuiper, Sandra D McKenzie, and Kristine A Belanger. 1995. Cognitive appraisals and individual differences in sense of humor: Motivational and affective implications. Personality and individual differences 19, 3 (1995), 359–372.",
      "doi": ""
    },
    {
      "text": "Cherie Lacey and Catherine Barbara Caudwell. 2018. The robotic archetype: Character animation and social robotics. In International Conference on Social Robotics. Springer, 25–34.",
      "doi": ""
    },
    {
      "text": "H.M. Lefcourt and R.A. Martin. 2012. Humor and Life Stress: Antidote to Adversity. Springer New York. https://books.google.co.il/books?id=8s0hBAAAQBAJ",
      "doi": ""
    },
    {
      "text": "Adi Manor, Benny Megidish, Etay Todress, Mario Mikulincer, and Hadas Erel. 2022. A Non-Humanoid Robotic Object for Providing a Sense Of Security. In 2022 31st IEEE International Conference on Robot and Human Interactive Communication (RO-MAN). IEEE, 1520–1527.",
      "doi": "10.1109/RO-MAN53752.2022.9900747"
    },
    {
      "text": "Rod A Martin. 2010. Approaches to the sense of humor: A historical review. In The sense of humor. De Gruyter Mouton, 15–60.",
      "doi": ""
    },
    {
      "text": "Rod A Martin and Thomas Ford. 2018. The psychology of humor: An integrative approach. Academic press.",
      "doi": ""
    },
    {
      "text": "Rod A Martin and Herbert M Lefcourt. 1983. Sense of humor as a moderator of the relation between stressors and moods.Journal of personality and social psychology 45, 6(1983), 1313.",
      "doi": ""
    },
    {
      "text": "Rod A Martin, Patricia Puhlik-Doris, Gwen Larsen, Jeanette Gray, and Kelly Weir. 2003. Individual differences in uses of humor and their relation to psychological well-being: Development of the Humor Styles Questionnaire. Journal of research in personality 37, 1 (2003), 48–75.",
      "doi": ""
    },
    {
      "text": "Abraham Harold Maslow. 1958. A Dynamic Theory of Human Motivation.(1958).",
      "doi": ""
    },
    {
      "text": "Nikolaos Mavridis. 2015. A review of verbal and non-verbal human–robot interactive communication. Robotics and Autonomous Systems 63 (2015), 22–35.",
      "doi": "10.1016/j.robot.2014.09.031"
    },
    {
      "text": "David W McMillan and David M Chavis. 1986. Sense of community: A definition and theory. Journal of community psychology 14, 1 (1986), 6–23.",
      "doi": ""
    },
    {
      "text": "Benny Megidish. 2017. Butter Robotics. https://butter-robotics.web.app/",
      "doi": ""
    },
    {
      "text": "Benny Megidish, Oren Zuckerman, and Guy Hoffman. 2017. Animating mechanisms: A pipeline for authoring robot gestures. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. 45–45.",
      "doi": "10.1145/3029798.3036667"
    },
    {
      "text": "Isabelle M Menne, Benjamin P Lange, and Dagmar C Unz. 2018. My humorous robot: effects of a robot telling jokes on perceived intelligence and liking. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. 193–194.",
      "doi": "10.1145/3173386.3177015"
    },
    {
      "text": "Anna Medaris Miller. 2015. The Science of Awkwardness. US News (2015).",
      "doi": ""
    },
    {
      "text": "Nicole Mirnig, Susanne Stadler, Gerald Stollnberger, Manuel Giuliani, and Manfred Tscheligi. 2016. Robot humor: How self-irony and Schadenfreude influence people’s rating of robot likability. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). 166–171. https://doi.org/10.1109/ROMAN.2016.7745106",
      "doi": "10.1109/ROMAN.2016.7745106"
    },
    {
      "text": "Nicole Mirnig, Gerald Stollnberger, Manuel Giuliani, and Manfred Tscheligi. 2017. Elements of humor: How humans perceive verbal and non-verbal aspects of humorous robot behavior. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. 211–212.",
      "doi": "10.1145/3029798.3038337"
    },
    {
      "text": "John Morkes, Hadyn K Kernal, and Clifford Nass. 1998. Humor in task-oriented computer-mediated communication and human-computer interaction. In CHI 98 Conference Summary on Human Factors in Computing Systems. 215–216.",
      "doi": "10.1145/286498.286704"
    },
    {
      "text": "John Morkes, Hadyn K Kernal, and Clifford Nass. 1999. Effects of humor in task-oriented human-computer interaction and computer-mediated communication: A direct test of SRCT theory. Human-Computer Interaction 14, 4 (1999), 395–435.",
      "doi": "10.1207/S15327051HCI1404_2"
    },
    {
      "text": "John Morreall. 1986. The philosophy of laughter and humor. (1986).",
      "doi": ""
    },
    {
      "text": "Omar Mubin, Thomas D’Arcy, Ghulam Murtaza, Simeon Simoff, Chris Stanton, and Catherine Stevens. 2014. Active or passive?: Investigating the impact of robot role in meetings. In The 23rd IEEE International Symposium on Robot and Human Interactive Communication. IEEE, 580–585.",
      "doi": ""
    },
    {
      "text": "Bilge Mutlu, Toshiyuki Shiwa, Takayuki Kanda, Hiroshi Ishiguro, and Norihiro Hagita. 2009. Footing in human-robot conversations: how robots might shape participant roles using gaze cues. In Proceedings of the 4th ACM/IEEE international conference on Human robot interaction. 61–68.",
      "doi": "10.1145/1514095.1514109"
    },
    {
      "text": "Hideyuki Nakanishi, Satoshi Nakazawa, Toru Ishida, Katsuya Takanashi, and Katherine Isbister. 2003. Can software agents influence human relations? Balance theory in agent-mediated communities. In Proceedings of the second international joint conference on autonomous agents and multiagent systems. 717–724.",
      "doi": "10.1145/860575.860691"
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. 72–78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Austin Lee Nichols and Jon K Maner. 2008. The good-subject effect: Investigating participant demand characteristics. The Journal of general psychology 135, 2 (2008), 151–166.",
      "doi": ""
    },
    {
      "text": "Andreea Niculescu, Betsy van Dijk, Anton Nijholt, Haizhou Li, and Swee Lan See. 2013. Making social robots more attractive: the effects of voice pitch, humor and empathy. International journal of social robotics 5, 2 (2013), 171–191.",
      "doi": ""
    },
    {
      "text": "Andreea Niculescu, Betsy Van Dijk, Anton Nijholt, Dilip Kumar Limbu, Swee Lan See, and Alvin Hong Yee Wong. 2010. Socializing with Olivia, the youngest robot receptionist outside the lab. In International Conference on Social Robotics. Springer, 50–62.",
      "doi": ""
    },
    {
      "text": "Andreea I Niculescu. 2021. Brief Considerations on the Phenomenon of Humor in HCI. In Asian CHI Symposium 2021. 152–156.",
      "doi": ""
    },
    {
      "text": "Anton Nijholt. 2002. Embodied agents: A new impetus to humor research. In The April Fools Day Workshop on Computational Humour, Vol. 20. In: Proc. Twente Workshop on Language Technology, 101–111.",
      "doi": ""
    },
    {
      "text": "Anton Nijholt. 2018. Robotic stand-up comedy: State-of-the-art. In International conference on distributed, ambient, and pervasive interactions. Springer, 391–410.",
      "doi": "10.1007/978-3-319-91125-0_32"
    },
    {
      "text": "Anton Nijholt, Andreea I Niculescu, Alessandro Valitutti, and Rafael E Banchs. 2017. Humor in human-computer interaction: a short survey. In Adjunct conference proceedings interact. 527–530.",
      "doi": ""
    },
    {
      "text": "Anton Nijholt, Oliviero Stock, Alan Dix, and John Morkes. 2003. Humor modeling in the interface. In CHI’03 extended abstracts on Human factors in computing systems. 1050–1051.",
      "doi": ""
    },
    {
      "text": "Jin Niu, Chih-Fu Wu, Xiao Dou, and Kai-Chieh Lin. 2022. Designing Gestures of Robots in Specific Fields for Different Perceived Personality Traits. Frontiers in Psychology 13 (2022).",
      "doi": ""
    },
    {
      "text": "Neal R Norrick. 1993. Conversational joking: Humor in everyday talk.Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Neal R Norrick. 2004. Non-verbal humor and joke performance. (2004).",
      "doi": ""
    },
    {
      "text": "Neal R Norrick and Delia Chiaro. 2009. Humor in interaction. Vol. 182. John Benjamins Publishing.",
      "doi": ""
    },
    {
      "text": "Naoki Ohshima, Keita Kimijima, Junji Yamato, and Naoki Mukawa. 2015. A conversational robot with vocal and bodily fillers for recovering from awkward silence at turn-takings. 325–330. https://doi.org/10.1109/ROMAN.2015.7333677",
      "doi": "10.1109/ROMAN.2015.7333677"
    },
    {
      "text": "Raquel Oliveira, Patricia Arriaga, Minja Axelsson, and Ana Paiva. 2021. Humor–Robot interaction: a scoping review of the literature and future directions. International Journal of Social Robotics 13, 6 (2021), 1369–1383.",
      "doi": ""
    },
    {
      "text": "Thomas Olsson, Pradthana Jarusriboonchai, Paweł Woźniak, Susanna Paasovaara, Kaisa Väänänen, and Andrés Lucero. 2020. Technologies for enhancing collocated social interaction: review of design solutions and approaches. Computer Supported Cooperative Work (CSCW) 29, 1 (2020), 29–83.",
      "doi": "10.1007/s10606-019-09345-0"
    },
    {
      "text": "Raymond Opdenakker. 2006. Advantages and disadvantages of four interview techniques in qualitative research. In Forum qualitative sozialforschung/forum: Qualitative social research, Vol. 7.",
      "doi": ""
    },
    {
      "text": "Catherine Pelachaud. 2009. Studies on gesture expressivity for a virtual agent. Speech Communication 51, 7 (2009), 630–639.",
      "doi": "10.1016/j.specom.2008.04.009"
    },
    {
      "text": "Rosalind W Picard. 2000. Affective computing. MIT press.",
      "doi": "10.5555/265013"
    },
    {
      "text": "Viva Sarah Press and Hadas Erel. 2022. Designing Non-Verbal Humorous Gestures for a Non-Humanoid Robot. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–7.",
      "doi": "10.1145/3491101.3519924"
    },
    {
      "text": "Byron Reeves and Clifford Nass. 1996. The media equation: How people treat computers, television, and new media like real people. Cambridge university press Cambridge, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Harry T Reis, Kennon M Sheldon, Shelly L Gable, Joseph Roscoe, and Richard M Ryan. 2018. Daily well-being: The role of autonomy, competence, and relatedness. In Relationships, well-being and behaviour. Routledge, 317–349.",
      "doi": ""
    },
    {
      "text": "Tiago Ribeiro and Ana Paiva. 2012. The illusion of robotic life: principles and practices of animation for robots. In Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction. 383–390.",
      "doi": "10.1145/2157689.2157814"
    },
    {
      "text": "Danielle Rifinski, Hadas Erel, Adi Feiner, Guy Hoffman, and Oren Zuckerman. 2021. Human-human-robot interaction: robotic object’s responsive gestures improve interpersonal evaluation in human interaction. Human–Computer Interaction 36, 4 (2021), 333–359.",
      "doi": ""
    },
    {
      "text": "Stephen Ristau. 2011. People do need people: Social interaction boosts brain health in older age. Generations 35, 2 (2011), 70–76.",
      "doi": ""
    },
    {
      "text": "Silvia Rossi, Mariacarla Staffa, Luigi Bove, Roberto Capasso, and Giovanni Ercolano. 2017. User’s personality and activity influence on HRI comfortable distances. In International Conference on Social Robotics. Springer, 167–177.",
      "doi": ""
    },
    {
      "text": "Ofir Sadka, Alon Jacobi, Andrey Grishko, Udi Lumnitz, Benny Megidish, and Hadas Erel. 2022. ” By the way, what’s your name?”: The Effect of Robotic Bar-stools on Human-human Opening-encounters. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. 1–6.",
      "doi": ""
    },
    {
      "text": "Gillian M Sandstrom, Erica J Boothby, and Gus Cooney. 2022. Talking to strangers: A week-long intervention reduces psychological barriers to social connection. Journal of Experimental Social Psychology 102 (2022), 104356.",
      "doi": ""
    },
    {
      "text": "W Schneider, A Eschman, and A Zuccolotto. 2002. EPrime. Pittsburgh: Psychology Software Tools.",
      "doi": ""
    },
    {
      "text": "Sara Sheikholeslami, AJung Moon, and Elizabeth A Croft. 2017. Cooperative gestures for industry: Exploring the efficacy of robot hand configurations in expression of instructional gestures for human–robot interaction. The International Journal of Robotics Research 36, 5-7(2017), 699–720.",
      "doi": "10.1177/0278364917709941"
    },
    {
      "text": "Shoshanna Sofaer. 1999. Qualitative methods: what are they and why use them?Health services research 34, 5 Pt 2 (1999), 1101.",
      "doi": ""
    },
    {
      "text": "Brett Stoll, Malte F Jung, and Susan R Fussell. 2018. Keeping it light: perceptions of humor styles in robot-mediated conflict. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. 247–248.",
      "doi": "10.1145/3173386.3176996"
    },
    {
      "text": "Sarah Strohkorb Sebo, Margaret Traeger, Malte Jung, and Brian Scassellati. 2018. The ripple effects of vulnerability: The effects of a robot’s vulnerable behavior on trust in human-robot teams. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. 178–186.",
      "doi": "10.1145/3171221.3171275"
    },
    {
      "text": "Moonyoung Tae and Joonhwan Lee. 2020. The Effect of Robot’s Ice-Breaking Humor on Likeability and Future Contact Intentions. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction (Cambridge, United Kingdom) (HRI ’20). Association for Computing Machinery, New York, NY, USA, 462–464. https://doi.org/10.1145/3371382.3378267",
      "doi": "10.1145/3371382.3378267"
    },
    {
      "text": "Deborah Tannen. 1984. Conversational style: Analyzing talk among friends. Norwood. NJ: Ablex (1984).",
      "doi": ""
    },
    {
      "text": "Hamish Tennent, Solace Shen, and Malte Jung. 2019. Micbot: a peripheral robotic object to shape conversational dynamics and team performance. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 133–142.",
      "doi": ""
    },
    {
      "text": "Stanislav Treger, Susan Sprecher, and Ralph Erber. 2013. Laughing and liking: Exploring the interpersonal effects of humor use in initial social interactions. European Journal of Social Psychology 43, 6 (2013), 532–543.",
      "doi": ""
    },
    {
      "text": "George E Vaillant. 2000. Adaptive mental mechanisms: Their role in a positive psychology.American psychologist 55, 1 (2000), 89.",
      "doi": ""
    },
    {
      "text": "Raskin Victor. 1985. Semantic mechanisms of humor. Dordrecht: D. Reidel(1985).",
      "doi": ""
    },
    {
      "text": "John Vilk and Naomi T Fitter. 2020. Comedians in cafes getting data: evaluating timing and adaptivity in real-world robot comedy performance. In Proceedings of the 2020 ACM/IEEE international conference on human-Robot Interaction. 223–231.",
      "doi": "10.1145/3319502.3374780"
    },
    {
      "text": "Caleb Warren, Adam Barsky, and A Peter McGraw. 2021. What makes things funny? An integrative review of the antecedents of laughter and amusement. Personality and Social Psychology Review 25, 1 (2021), 41–65.",
      "doi": ""
    },
    {
      "text": "Allison M Waters, Ottmar V Lipp, and Vanessa E Cobham. 2000. Investigation of threat-related attentional bias in anxious children using the startle eyeblink modification paradigm.Journal of Psychophysiology 14, 3 (2000), 142.",
      "doi": ""
    },
    {
      "text": "Cornelia Wendt and Guy Berg. 2009. Nonverbal humor as a new dimension of HRI. RO-MAN 2009 - The 18th IEEE International Symposium on Robot and Human Interactive Communication(2009), 183–188.",
      "doi": ""
    },
    {
      "text": "Julia Wilkins and Amy Janel Eisenbraun. 2009. Humor theories and the physiological benefits of laughter. Holistic nursing practice 23, 6 (2009), 349–354.",
      "doi": ""
    },
    {
      "text": "Zhao Yao, Deshui Yu, Lili Wang, Xiangru Zhu, Jingjing Guo, and Zhenhong Wang. 2016. Effects of valence and arousal on emotional word processing are modulated by concreteness: Behavioral and ERP evidence from a lexical decision task. International Journal of Psychophysiology 110 (2016), 231–242.",
      "doi": ""
    },
    {
      "text": "Avner Ziv. 1988. Teaching and learning with humor: Experiment and replication. The Journal of Experimental Education 57, 1 (1988), 4–15.",
      "doi": ""
    },
    {
      "text": "Oren Zuckerman, Dina Walker, Andrey Grishko, Tal Moran, Chen Levy, Barak Lisak, Iddo Yehoshua Wald, and Hadas Erel. 2020. Companionship is not a function: The effect of a novel robotic object on healthy older adults’ feelings of\" being-seen\". In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3313831.3376411"
    }
  ]
}