{
  "doi": "10.1145/3544548.3581004",
  "title": "Investigating the Effects of Individual Spatial Abilities on Virtual Reality Object Manipulation",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2023,
  "badges": [],
  "abstract": "Object manipulation in 3D space, meaning translating, rotating, and scaling, is ubiquitous in virtual reality (VR), and several interaction techniques have been developed in the past to optimize the task performance and usability. However, preliminary research indicates that individual spatial abilities also have an impact. Yet, it was never investigated if users’ spatial abilities influence VR object manipulation. We assessed this in a user study (N=66) using 21 manipulation tasks defined in a Fitts’ law-related approach. As interaction techniques, we chose gizmos for simultaneously manipulating 1 and 3 degrees of freedom (DOF) and a handle bar metaphor for 7 DOF. Higher spatial abilities resulted in significantly shorter task completion time and more targeted manipulations, while task accuracy was unaffected. However, an optimized interaction technique could compensate individual disadvantages. We propose seven guidelines on spatial abilities in interaction technique design and research to personalize and improve VR applications.",
  "tags": [
    "spatial abilities",
    "interaction technique",
    "docking task",
    "mixed reality",
    "virtual reality",
    "object manipulation",
    "individual characteristics",
    "Fitts’ law"
  ],
  "authors": [
    {
      "name": "Tobias Drey",
      "institution": "Institute of Media Informatics, Ulm University, Germany",
      "img": "/do/10.1145/contrib-99659070533/rel-imgonly/xing.jpg",
      "acmid": "99659070533",
      "orcid": "0000-0002-6330-6803"
    },
    {
      "name": "Michael Montag",
      "institution": "Department of General Psychology, Magdeburg-Stendal University of Applied Science, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659933465",
      "orcid": "0000-0002-8478-6332"
    },
    {
      "name": "Andrea Vogt",
      "institution": "Institute of Psychology and Education, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782438",
      "orcid": "0000-0003-3523-9911"
    },
    {
      "name": "Nico Rixen",
      "institution": "Institute of Media Informatics, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778196",
      "orcid": "0000-0002-9210-0804"
    },
    {
      "name": "Tina Seufert",
      "institution": "Institute of Psychology and Education, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81388600674",
      "orcid": "0000-0002-8685-4116"
    },
    {
      "name": "Steffi Zander",
      "institution": "Department of General Psychology, Magdeburg-Stendal University of Applied Science, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659114499",
      "orcid": "0000-0002-6938-1345"
    },
    {
      "name": "Michael Rietzler",
      "institution": "Institute of Media Informatics, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458666657",
      "orcid": "0000-0003-2599-8308"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Institute of Media Informatics, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "A.C. Acock. 2018. A Gentle Introduction to Stata. Stata Press.",
      "doi": ""
    },
    {
      "text": "Patrick Albus, Andrea Vogt, and Tina Seufert. 2021. Signaling in virtual reality influences learning outcome and cognitive load. Computers & Education 166 (2021), 104154. https://doi.org/10.1016/j.compedu.2021.104154",
      "doi": ""
    },
    {
      "text": "Mayra Donaji Barrera Machuca, Wolfgang Stuerzlinger, and Paul Asente. 2019. The Effect of Spatial Ability on Immersive 3D Drawing. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C&C ’19). Association for Computing Machinery, New York, NY, USA, 173–186. https://doi.org/10.1145/3325480.3325489",
      "doi": "10.1145/3325480.3325489"
    },
    {
      "text": "Trevor Barrett and Mary Hegarty. 2014. Interaction design and the role of spatial ability in moderating virtual molecule manipulation performance. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 36.",
      "doi": ""
    },
    {
      "text": "Trevor J. Barrett and Mary Hegarty. 2016. Effects of interface and spatial ability on manipulation of virtual models in a STEM domain. Computers in Human Behavior 65 (2016), 220–231. https://doi.org/10.1016/j.chb.2016.06.026",
      "doi": "10.1016/j.chb.2016.06.026"
    },
    {
      "text": "Joanna Bergström, Tor-Salve Dalsgaard, Jason Alexander, and Kasper Hornbæk. 2021. How to Evaluate Object Selection and Manipulation in VR? Guidelines from 20 Years of Studies. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 533, 20 pages. https://doi.org/10.1145/3411764.3445193",
      "doi": "10.1145/3411764.3445193"
    },
    {
      "text": "Lonni Besançon, Paul Issartel, Mehdi Ammi, and Tobias Isenberg. 2017. Mouse, Tactile, and Tangible Input for 3D Manipulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4727–4740. https://doi.org/10.1145/3025453.3025863",
      "doi": "10.1145/3025453.3025863"
    },
    {
      "text": "Blender Foundation. [n.d.]. Home of the Blender project. https://www.blender.org/ (Accessed on 12/02/2022).",
      "doi": ""
    },
    {
      "text": "Benoît Bossavit, Asier Marzo, Oscar Ardaiz, Luis Diaz De Cerio, and Alfredo Pina. 2014. Design Choices and Their Implications for 3D Mid-Air Manipulation Techniques. Presence: Teleoperators and Virtual Environments 23, 4 (11 2014), 377–392. https://doi.org/10.1162/PRES_a_00207 arXiv:https://direct.mit.edu/pvar/article-pdf/23/4/377/1625398/pres_a_00207.pdf",
      "doi": "10.1162/PRES_a_00207"
    },
    {
      "text": "Doug A. Bowman, Donald B. Johnson, and Larry F. Hodges. 2001. Testbed Evaluation of Virtual Environment Interaction Techniques. Presence: Teleoperators and Virtual Environments 10, 1(2001), 75–95. https://doi.org/10.1162/105474601750182333 arXiv:https://doi.org/10.1162/105474601750182333",
      "doi": "10.1162/105474601750182333"
    },
    {
      "text": "John Brooke. 1996. SUS-A Quick and Dirty Usability Scale. Usability evaluation in industry 189, 194 (1996).",
      "doi": ""
    },
    {
      "text": "P. Carlson, A. Peters, S. B. Gilbert, J. M. Vance, and A. Luse. 2015. Virtual Training: Learning Transfer of Assembly Tasks. IEEE Transactions on Visualization and Computer Graphics 21, 6(2015), 770–782.",
      "doi": "10.1109/TVCG.2015.2393871"
    },
    {
      "text": "John B Carroll 1993. Human cognitive abilities: A survey of factor-analytic studies. Number 1. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "E. Chapoulie, T. Tsandilas, L. Oehlberg, W. Mackay, and G. Drettakis. 2015. Finger-based manipulation in immersive spaces and the real world. In 2015 IEEE Symposium on 3D User Interfaces (3DUI). 109–116.",
      "doi": ""
    },
    {
      "text": "J Cohen. 1988. Statistical power analysis for the behavioral sciences. Hoboken: Taylor and Francis(1988).",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1992. Quantitative methods in psychology: A power primer. In Psychological bulletin. Citeseer.",
      "doi": ""
    },
    {
      "text": "Brookshire D. Conner, Scott S. Snibbe, Kenneth P. Herndon, Daniel C. Robbins, Robert C. Zeleznik, and Andries van Dam. 1992. Three-Dimensional Widgets. In Proceedings of the 1992 Symposium on Interactive 3D Graphics (Cambridge, Massachusetts, USA) (I3D ’92). Association for Computing Machinery, New York, NY, USA, 183–188. https://doi.org/10.1145/147156.147199",
      "doi": "10.1145/147156.147199"
    },
    {
      "text": "Valve Corporation. 2022. Steam Hardware and Software Survey. https://store.steampowered.com/hwsurvey/Steam-Hardware-Software-Survey-Welcome-to-Steam (Accessed on 12/02/2022).",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1975. Beyond boredom and anxiety: Experiencing flow in work and play. San Francisco/Washington/London(1975).",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The psychology of optimal experience. Vol. 1990. Harper & Row New York.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair Statistical Communication in HCI. Springer International Publishing, Cham, 291–330. https://doi.org/10.1007/978-3-319-26633-6_13",
      "doi": ""
    },
    {
      "text": "Tobias Drey, Patrick Albus, Simon der Kinderen, Maximilian Milo, Thilo Segschneider, Linda Chanzab, Michael Rietzler, Tina Seufert, and Enrico Rukzio. 2022. Towards Collaborative Learning in Virtual Reality: A Comparison of Co-Located Symmetric and Asymmetric Pair-Learning. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 610, 19 pages. https://doi.org/10.1145/3491102.3517641",
      "doi": "10.1145/3491102.3517641"
    },
    {
      "text": "Tobias Drey, Fabian Fischbach, Pascal Jansen, Julian Frommel, Michael Rietzler, and Enrico Rukzio. 2021. To Be or Not to Be Stuck, or Is It a Continuum? A Systematic Literature Review on the Concept of Being Stuck in Games. Proc. ACM Hum.-Comput. Interact. 5, CHI PLAY, Article 229 (oct 2021), 35 pages. https://doi.org/10.1145/3474656",
      "doi": "10.1145/3474656"
    },
    {
      "text": "Tobias Drey, Jan Gugenheimer, Julian Karlbauer, Maximilian Milo, and Enrico Rukzio. 2020. VRSketchIn: Exploring the Design Space of Pen and Tablet Interaction for 3D Sketching in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, Hawai’i, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, Article 501, 14 pages. https://doi.org/10.1145/3313831.3376628",
      "doi": "10.1145/3313831.3376628"
    },
    {
      "text": "Tobias Drey, Jessica Janek, Josef Lang, Dietmar Puschmann, Michael Rietzler, and Enrico Rukzio. 2022. SpARklingPaper: Enhancing Common Pen- And Paper-Based Handwriting Training for Children by Digitally Augmenting Papers Using a Tablet Screen. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 3, Article 113 (sep 2022), 29 pages. https://doi.org/10.1145/3550337",
      "doi": "10.1145/3550337"
    },
    {
      "text": "Tobias Drey, Pascal Jansen, Fabian Fischbach, Julian Frommel, and Enrico Rukzio. 2020. Towards Progress Assessment for Adaptive Hints in Educational Virtual Reality Games. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382789",
      "doi": "10.1145/3334480.3382789"
    },
    {
      "text": "J.N. Druckman, D.P. Greene, J.H. Kuklinski, and A. Lupia. 2011. Cambridge Handbook of Experimental Political Science. Cambridge University Press. https://books.google.de/books?id=ES5PUvvShF8C",
      "doi": ""
    },
    {
      "text": "LLC. Facebook Technologies. 2022. Oculus Quest 2. https://www.oculus.com/quest-2/ (Accessed on 12/02/2022).",
      "doi": ""
    },
    {
      "text": "Franz Faul, Edgar Erdfelder, Axel Buchner, and Albert-Georg Lang. 2009. Statistical Power Analyses Using G*Power 3.1: Tests for Correlation and Regression Analyses. Behavior research methods 41 (11 2009), 1149–60. https://doi.org/10.3758/BRM.41.4.1149",
      "doi": ""
    },
    {
      "text": "Jinbo Feng, Isaac Cho, and Zachary Wartell. 2015. Comparison of Device-Based, One and Two-Handed 7DOF Manipulation Techniques. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction (Los Angeles, California, USA) (SUI ’15). Association for Computing Machinery, New York, NY, USA, 2–9. https://doi.org/10.1145/2788940.2788942",
      "doi": "10.1145/2788940.2788942"
    },
    {
      "text": "Carl F. Fey, Tianyou Hu, and Andrew Delios. 2022. The Measurement and Communication of Effect Sizes in Management Research. Management and Organization Review(2022), 1–22. https://doi.org/10.1017/mor.2022.2",
      "doi": ""
    },
    {
      "text": "Andy Field. 2013. Discovering statistics using IBM SPSS statistics. sage.",
      "doi": ""
    },
    {
      "text": "Holmes Finch. 2005. Comparison of the performance of nonparametric and parametric MANOVA test statistics when assumptions are violated. Methodology 1, 1 (2005), 27–38.",
      "doi": ""
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement.Journal of experimental psychology 47, 6 (1954), 381.",
      "doi": ""
    },
    {
      "text": "P. Christopher Gloumeau, Wolfgang Stuerzlinger, and JungHyun Han. 2021. PinNPivot: Object Manipulation Using Pins in Immersive Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 27, 4(2021), 2488–2494. https://doi.org/10.1109/TVCG.2020.2987834",
      "doi": ""
    },
    {
      "text": "Nextcloud GmbH. 2022. Nextcloud. https://nextcloud.com/ (Accessed on 12/02/2022).",
      "doi": ""
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does Gamification Work? – A Literature Review of Empirical Studies on Gamification. In 2014 47th Hawaii International Conference on System Sciences. 3025–3034. https://doi.org/10.1109/HICSS.2014.377",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Justin Harris, Kathy Hirsh-Pasek, and Nora S Newcombe. 2013. Understanding spatial transformations: similarities and differences between mental rotation and mental folding. Cognitive processing 14, 2 (2013), 105–115.",
      "doi": ""
    },
    {
      "text": "Devamardeep Hayatpur, Seongkook Heo, Haijun Xia, Wolfgang Stuerzlinger, and Daniel Wigdor. 2019. Plane, Ray, and Point: Enabling Precise Spatial Manipulations with Shape Constraints. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1185–1195. https://doi.org/10.1145/3332165.3347916",
      "doi": "10.1145/3332165.3347916"
    },
    {
      "text": "Mary Hegarty and David A Waller. 2005. Individual differences in spatial abilities.Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Joe Tullio, Randy Pausch, Dennis Proffitt, and Neal Kassell. 1997. Usability analysis of 3D rotation techniques. In Proceedings of the 10th annual ACM symposium on User interface software and technology. 1–10.",
      "doi": "10.1145/263407.263408"
    },
    {
      "text": "Stephanie Houde. 1992. Iterative Design of an Interface for Easy 3-D Direct Manipulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 135–142. https://doi.org/10.1145/142750.142772",
      "doi": "10.1145/142750.142772"
    },
    {
      "text": "Marcel Adam Just and Patricia A Carpenter. 1976. Eye fixations and cognitive processes. Cognitive Psychology 8, 4 (1976), 441–480. https://doi.org/10.1016/0010-0285(76)90015-3",
      "doi": ""
    },
    {
      "text": "MyoungGon Kim and JungHyun Han. 2019. Effects of Switchable DOF for Mid-Air Manipulation in Immersive Virtual Environments. International Journal of Human–Computer Interaction 35, 13(2019), 1147–1159. https://doi.org/10.1080/10447318.2018.1514163 arXiv:https://doi.org/10.1080/10447318.2018.1514163",
      "doi": ""
    },
    {
      "text": "Melina Klepsch, Florian Schmitz, and Tina Seufert. 2017. Development and Validation of Two Instruments Measuring Intrinsic, Extraneous, and Germane Cognitive Load. Frontiers in Psychology 8 (2017), 1997. https://doi.org/10.3389/fpsyg.2017.01997",
      "doi": ""
    },
    {
      "text": "Melina Klepsch and Tina Seufert. 2021. Making an Effort Versus Experiencing Load. Frontiers in Education 6(2021). https://doi.org/10.3389/feduc.2021.645284",
      "doi": ""
    },
    {
      "text": "Max Krichenbauer, Goshiro Yamamoto, Takafumi Taketom, Christian Sandor, and Hirokazu Kato. 2018. Augmented Reality versus Virtual Reality for 3D Object Manipulation. IEEE Transactions on Visualization and Computer Graphics 24, 2(2018), 1038–1048. https://doi.org/10.1109/TVCG.2017.2658570",
      "doi": ""
    },
    {
      "text": "A. Kulik, A. Kunert, and B. Froehlich. 2020. On Motor Performance in Virtual 3D Object Manipulation. IEEE Transactions on Visualization and Computer Graphics 26, 5(2020), 2041–2050.",
      "doi": ""
    },
    {
      "text": "Wallace S. Lages and Doug A. Bowman. 2018. Move the Object or Move Myself? Walking vs. Manipulation for the Examination of 3D Scientific Data. Frontiers in ICT 5(2018), 15. https://doi.org/10.3389/fict.2018.00015",
      "doi": ""
    },
    {
      "text": "P Lance and Aiko Hattori. 2016. Sampling and evaluation. Chapel Hill, North Carolina: MEASURE Evaluation, University of North Carolina (2016).",
      "doi": ""
    },
    {
      "text": "Joseph J LaViola Jr, Ernst Kruijff, Ryan P McMahan, Doug Bowman, and Ivan P Poupyrev. 2017. 3D user interfaces: theory and practice. Addison-Wesley Professional.",
      "doi": ""
    },
    {
      "text": "Marcia C. Linn and Anne C. Petersen. 1985. Emergence and Characterization of Sex Differences in Spatial Ability: A Meta-Analysis. Child Development 56, 6 (1985), 1479–1498. http://www.jstor.org/stable/1130467",
      "doi": ""
    },
    {
      "text": "David Lubinski. 2010. Spatial ability and STEM: A sleeping giant for talent identification and development. Personality and Individual Differences 49 (09 2010), 344–351. https://doi.org/10.1016/j.paid.2010.03.022",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie. 1989. A Note on the Information-Theoretic Basis for Fitts’ Law. Journal of Motor Behavior 21, 3 (1989), 323–330. https://doi.org/10.1080/00222895.1989.10735486 arXiv:https://doi.org/10.1080/00222895.1989.10735486PMID: 15136269.",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie. 1992. Fitts’ Law as a Research and Design Tool in Human-Computer Interaction. Human–Computer Interaction 7, 1 (1992), 91–139. https://doi.org/10.1207/s15327051hci07013 arXiv:https://doi.org/10.1207/s15327051hci07013",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Anthony Martinet, Géry Casiez, and Laurent Grisoni. 2010. The Effect of DOF Separation in 3D Manipulation Tasks with Multi-Touch Displays. In Proceedings of the 17th ACM Symposium on Virtual Reality Software and Technology (Hong Kong) (VRST ’10). Association for Computing Machinery, New York, NY, USA, 111–118. https://doi.org/10.1145/1889863.1889888",
      "doi": "10.1145/1889863.1889888"
    },
    {
      "text": "John H McDonald. 2009. Handbook of biological statistics. Vol. 2. sparky house publishing Baltimore, MD.",
      "doi": ""
    },
    {
      "text": "D. Mendes, F. M. Caputo, A. Giachetti, A. Ferreira, and J. Jorge. 2019. A Survey on 3D Virtual Object Manipulation: From the Desktop to Immersive Virtual Environments. Computer Graphics Forum 38, 1 (2019), 21–45. https://doi.org/10.1111/cgf.13390 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.13390",
      "doi": ""
    },
    {
      "text": "Daniel Mendes, Fernando Fonseca, Bruno Araùjo, Alfredo Ferreira, and Joaquim Jorge. 2014. Mid-air interactions above stereoscopic interactive tables. In 2014 IEEE Symposium on 3D User Interfaces (3DUI). 3–10. https://doi.org/10.1109/3DUI.2014.6798833",
      "doi": ""
    },
    {
      "text": "Daniel Mendes, Filipe Relvas, Alfredo Ferreira, and Joaquim Jorge. 2016. The Benefits of DOF Separation in Mid-Air 3D Object Manipulation. In Proceedings of the 22nd ACM Conference on Virtual Reality Software and Technology (Munich, Germany) (VRST ’16). Association for Computing Machinery, New York, NY, USA, 261–268. https://doi.org/10.1145/2993369.2993396",
      "doi": "10.1145/2993369.2993396"
    },
    {
      "text": "Daniel Mendes, Maurício Sousa, Rodrigo Lorena, Alfredo Ferreira, and Joaquim Jorge. 2017. Using Custom Transformation Axes for Mid-Air Manipulation of 3D Virtual Objects. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology(Gothenburg, Sweden) (VRST ’17). Association for Computing Machinery, New York, NY, USA, Article 27, 8 pages. https://doi.org/10.1145/3139131.3139157",
      "doi": "10.1145/3139131.3139157"
    },
    {
      "text": "Marvin E Mundell. 1978. Motion and time study: Improving productivity. Prentice Hall,.",
      "doi": ""
    },
    {
      "text": "Gregory M. Nielson and Dan R. Olsen. 1987. Direct Manipulation Techniques for 3D Objects Using 2D Locator Devices. In Proceedings of the 1986 Workshop on Interactive 3D Graphics (Chapel Hill, North Carolina, USA) (I3D ’86). Association for Computing Machinery, New York, NY, USA, 175–182. https://doi.org/10.1145/319120.319134",
      "doi": "10.1145/319120.319134"
    },
    {
      "text": "M. Peters, B. Laeng, K. Latham, M. Jackson, R. Zaiyouna, and C. Richardson. 1995. A Redrawn Vandenberg and Kuse Mental Rotations Test - Different Versions and Factors That Affect Performance. Brain and Cognition 28, 1 (1995), 39–58. https://doi.org/10.1006/brcg.1995.1032",
      "doi": ""
    },
    {
      "text": "Michael Peters, John T Manning, and Stian Reimers. 2007. The effects of sex, sexual orientation, and digit ratio (2D: 4D) on mental rotation performance. Archives of sexual behavior 36, 2 (2007), 251–260.",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Suzanne Weghorst, Mark Billinghurst, and Tadao Ichikawa. 1997. A Framework and Testbed for Studying Manipulation Techniques for Immersive VR. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (Lausanne, Switzerland) (VRST ’97). Association for Computing Machinery, New York, NY, USA, 21–28. https://doi.org/10.1145/261135.261141",
      "doi": "10.1145/261135.261141"
    },
    {
      "text": "Prolific. [n.d.]. Prolific | Online participant recruitment for surveys and market research. https://prolific.co/ (Accessed on 12/02/2022).",
      "doi": ""
    },
    {
      "text": "Rivu Radiah, Ville Mäkelä, Sarah Prange, Sarah Delgado Rodriguez, Robin Piening, Yumeng Zhou, Kay Köhle, Ken Pfeuffer, Yomna Abdelrahman, Matthias Hoppe, Albrecht Schmidt, and Florian Alt. 2021. Remote VR Studies: A Framework for Running Virtual Reality Studies Remotely Via Participant-Owned HMDs. ACM Trans. Comput.-Hum. Interact. 28, 6, Article 46 (nov 2021), 36 pages. https://doi.org/10.1145/3472617",
      "doi": "10.1145/3472617"
    },
    {
      "text": "Roger N. Shepard and Jacqueline Metzler. 1971. Mental Rotation of Three-Dimensional Objects. Science 171, 3972 (1971), 701–703. https://doi.org/10.1126/science.171.3972.701 arXiv:http://science.sciencemag.org/content/171/3972/701.full.pdf",
      "doi": ""
    },
    {
      "text": "Ken Shoemake. 1992. ARCBALL: A user interface for specifying three-dimensional orientation using a mouse. In Proceedings of Graphics Interface ’92 (Vancouver, British Columbia, Canada) (GI ’92). Canadian Human-Computer Communications Society, Toronto, Ontario, Canada, 151–156. http://graphicsinterface.org/wp-content/uploads/gi1992-18.pdf",
      "doi": "10.5555/155294.155312"
    },
    {
      "text": "Peng Song, Wooi Boon Goh, William Hutama, Chi-Wing Fu, and Xiaopei Liu. 2012. A Handle Bar Metaphor for Virtual Object Manipulation with Mid-Air Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1297–1306. https://doi.org/10.1145/2207676.2208585",
      "doi": "10.1145/2207676.2208585"
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts’ law research in HCI. International Journal of Human-Computer Studies 61, 6 (2004), 751–789. https://doi.org/10.1016/j.ijhcs.2004.09.001 Fitts’ law 50 years later: applications and contributions from human-computer interaction.",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Joachim Stoeber and Lavinia E. Damian. 2016. Perfectionism in Employees: Work Engagement, Workaholism, and Burnout. Springer International Publishing, Cham, 265–283. https://doi.org/10.1007/978-3-319-18582-8_12",
      "doi": ""
    },
    {
      "text": "Martin F. Stoelen and David L. Akin. 2010. Assessment of Fitts’ Law for Quantifying Combined Rotational and Translational Movements. Human Factors 52, 1 (2010), 63–77. https://doi.org/10.1177/0018720810366560 arXiv:https://doi.org/10.1177/0018720810366560PMID: 20653226.",
      "doi": ""
    },
    {
      "text": "Junwei Sun and Wolfgang Stuerzlinger. 2019. Extended Sliding in Virtual Reality. In 25th ACM Symposium on Virtual Reality Software and Technology (Parramatta, NSW, Australia) (VRST ’19). Association for Computing Machinery, New York, NY, USA, Article 38, 5 pages. https://doi.org/10.1145/3359996.3364251",
      "doi": "10.1145/3359996.3364251"
    },
    {
      "text": "John Sweller. 1988. Cognitive Science 12, 2 (1988), 257–285. https://doi.org/10.1207/s15516709cog1202_4 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1207/s15516709cog1202",
      "doi": ""
    },
    {
      "text": "Robert J. Teather and Wolfgang Stuerzlinger. 2007. Guidelines for 3D Positioning Techniques. In Proceedings of the 2007 Conference on Future Play(Toronto, Canada) (Future Play ’07). Association for Computing Machinery, New York, NY, USA, 61–68. https://doi.org/10.1145/1328202.1328214",
      "doi": "10.1145/1328202.1328214"
    },
    {
      "text": "Eleftherios Triantafyllidis and Zhibin Li. 2021. The Challenges in Modeling Human Performance in 3D Space with Fitts’ Law. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411763.3443442",
      "doi": "10.1145/3411763.3443442"
    },
    {
      "text": "Unity Technologies. [n.d.]. Unity Real-Time Development Platform | 3D, 2D VR & AR Visualizations. https://unity.com/ (Accessed on 12/02/2022).",
      "doi": ""
    },
    {
      "text": "Steven G. Vandenberg and Allan R. Kuse. 1978. Mental Rotations, a Group Test of Three-Dimensional Spatial Visualization. Perceptual and Motor Skills 47, 2 (Dec. 1978), 599–604. https://doi.org/10.2466/pms.1978.47.2.599",
      "doi": ""
    },
    {
      "text": "Manuel Veit, Antonio Capobianco, and Dominique Bechmann. 2009. Influence of Degrees of Freedom’s Manipulation on Performances during Orientation Tasks in Virtual Reality Environments. In Proceedings of the 16th ACM Symposium on Virtual Reality Software and Technology (Kyoto, Japan) (VRST ’09). Association for Computing Machinery, New York, NY, USA, 51–58. https://doi.org/10.1145/1643928.1643942",
      "doi": "10.1145/1643928.1643942"
    },
    {
      "text": "Daniel Voyer, Susan Voyer, and M Philip Bryden. 1995. Magnitude of sex differences in spatial abilities: a meta-analysis and consideration of critical variables.Psychological bulletin 117, 2 (1995), 250.",
      "doi": ""
    },
    {
      "text": "Vanessa Vuibert, Wolfgang Stuerzlinger, and Jeremy R. Cooperstock. 2015. Evaluation of Docking Task Performance Using Mid-Air Interaction Techniques. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction (Los Angeles, California, USA) (SUI ’15). Association for Computing Machinery, New York, NY, USA, 44–52. https://doi.org/10.1145/2788940.2788950",
      "doi": "10.1145/2788940.2788950"
    },
    {
      "text": "Adrian Willings. 2022. Meta Quest 2 vs Oculus Quest: What’s the difference between these VR headsets?https://www.pocket-lint.com/ar-vr/buyers-guides/oculus-rift/153716-oculus-quest-2-vs-oculus-quest-whats-the-difference (Accessed on 11/28/2022).",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock and Julie A. Kientz. 2016. Research Contributions in Human-computer Interaction. Interactions 23, 3 (April 2016), 38–44. https://doi.org/10.1145/2907069",
      "doi": "10.1145/2907069"
    },
    {
      "text": "Steffi Zander, Stefanie Wetzel, and Sven Bertel. 2016. Rotate it! – Effects of touch-based gestures on elementary school students’ solving of mental rotation tasks. Computers & Education 103 (Dec. 2016), 158–169. https://doi.org/10.1016/j.compedu.2016.10.007",
      "doi": "10.1016/j.compedu.2016.10.007"
    },
    {
      "text": "Shumin Zhai and Paul Milgram. 1998. Quantifying Coordination in Multiple DOF Movement and Its Application to Evaluating 6 DOF Input Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Los Angeles, California, USA) (CHI ’98). ACM Press/Addison-Wesley Publishing Co., USA, 320–327. https://doi.org/10.1145/274644.274689",
      "doi": "10.1145/274644.274689"
    }
  ]
}