{
  "doi": "10.1145/3544548.3581114",
  "title": "‘You are you and the app. There’s nobody else.’: Building Worker-Designed Data Institutions within Platform Hegemony",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-26",
  "year": 2023,
  "badges": [],
  "abstract": "Information asymmetries create extractive, often harmful relationships between platform workers (e.g., Uber or Deliveroo drivers) and their algorithmic managers. Recent HCI studies have put forward more equitable platform designs but leave open questions about the social and technical infrastructures required to support them without the cooperation of platforms. We conducted a participatory design study in which platform workers deconstructed and re-imagined Uber’s schema for driver data. We analyzed the data structures and social institutions participants proposed, focusing on the stakeholders, roles, and strategies for mitigating conflicting interests of privacy, personal agency, and utility. Using critical theory, we reflected on the capability of participatory design to generate bottom-up collective data infrastructures. Based on the plurality of alternative institutions participants produced and their aptitude to navigate data stewardship decisions, we propose user-configurable tools for lightweight data institution building, as an alternative to redesigning existing platforms or delegating control to centralized trusts.",
  "authors": [
    {
      "name": "Jake M L Stein",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781702",
      "orcid": "0000-0002-6344-7526"
    },
    {
      "name": "Vidminas Vizgirda",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783239",
      "orcid": "0000-0002-5085-9513"
    },
    {
      "name": "Max Van Kleek",
      "institution": "missing",
      "img": "/do/10.1145/contrib-81328490974/rel-imgonly/max-android.jpg",
      "acmid": "81328490974",
      "orcid": "0000-0003-3873-6366"
    },
    {
      "name": "Reuben Binns",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959194057",
      "orcid": "missing"
    },
    {
      "name": "Jun Zhao",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453639687",
      "orcid": "0000-0001-6935-9028"
    },
    {
      "name": "Rui Zhao",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782625",
      "orcid": "missing"
    },
    {
      "name": "Naman Goel",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659343595",
      "orcid": "missing"
    },
    {
      "name": "George Chalhoub",
      "institution": "missing",
      "img": "/do/10.1145/contrib-99659526426/rel-imgonly/profile-new.jpg",
      "acmid": "99659526426",
      "orcid": "missing"
    },
    {
      "name": "Wael S Albayaydh",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233629",
      "orcid": "missing"
    },
    {
      "name": "Nigel Shadbolt",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100351241",
      "orcid": "0000-0002-5085-9724"
    }
  ],
  "references": [
    {
      "text": "Ifeoma Ajunwa. 2018. Algorithms at work: productivity monitoring applications and wearable technology as the new data-centric research agenda for employment and labor law. . Louis ULJ 63(2018), 21. ZSCC: 0000041 Publisher: HeinOnline.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2018. Utopias of Participation: Feminism, Design, and the Futures. ACM Transactions on Computer-Human Interaction 25, 1 (Feb. 2018), 1–24. https://doi.org/10.1145/3127359",
      "doi": "10.1145/3127359"
    },
    {
      "text": "Oliver Bates, Christian Remy, Callum Nash, and Ben Kirman. 2019. The future of techno-disruption in gig economy workforces: challenging the dialogue with fictional abstracts. In Proceedings of the Halfway to the Future Symposium 2019. ACM, Nottingham United Kingdom, 1–4. https://doi.org/10.1145/3363384.3363476",
      "doi": "10.1145/3363384.3363476"
    },
    {
      "text": "Ana Brandusescu and Jonathan van Geus. 2020. Shifting Power Through Data Governance. Technical Report. Mozilla Foundation Data Futures Lab, San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2017. The algorithmic imaginary: exploring the ordinary affects of Facebook algorithms. Information, communication & society 20, 1 (2017), 30–44. Publisher: Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Gordon Burtch, Seth Carnahan, and Brad N. Greenwood. 2018. Can You Gig It? An Empirical Examination of the Gig Economy and Entrepreneurial Activity. Management Science 64, 12 (Dec. 2018), 5497–5520. https://doi.org/10.1287/mnsc.2017.2916",
      "doi": "10.1287/mnsc.2017.2916"
    },
    {
      "text": "Susanne Bødker and Morten Kyng. 2018. Participatory Design that Matters—Facing the Big Issues. ACM Transactions on Computer-Human Interaction 25, 1 (Feb. 2018), 1–31. https://doi.org/10.1145/3152421",
      "doi": "10.1145/3152421"
    },
    {
      "text": "Dan Calacci. 2022. Organizing in the End of Employment: Information Sharing, Data Stewardship, and Digital Workerism. In 2022 Symposium on Human-Computer Interaction for Work. ACM, Durham NH USA, 1–9. https://doi.org/10.1145/3533406.3533424",
      "doi": "10.1145/3533406.3533424"
    },
    {
      "text": "Dan Calacci and Alex Pentland. 2022. Bargaining with the Black-Box: Designing and Deploying Worker-Centric Tools to Audit Algorithmic Management. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2 (Nov. 2022), 1–24. https://doi.org/10.1145/3570601",
      "doi": "10.1145/3570601"
    },
    {
      "text": "Christina J. Colclough. 2020. Towards Workers’ Data Collectives. Technical Report. It For Change & The Just Net Coalition, Bangalore, Karnataka.",
      "doi": ""
    },
    {
      "text": "Craig Dalton and Jim Thatcher. 2014. What does a critical data studies look like, and why do we care? Seven points for a critical approach to ‘big data’. Society and Space 29(2014).",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2 (April 2013), 241–264. https://doi.org/10.1177/0306312712471581",
      "doi": ""
    },
    {
      "text": "Sylvie Delacroix and Neil D Lawrence. 2019. Bottom-up data Trusts: disturbing the ‘one size fits all’ approach to data governance. International Data Privacy Law (Oct. 2019), ipz014. https://doi.org/10.1093/idpl/ipz014",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Adriana Alvarado Garcia, and Jessica Despard. 2017. Low-Wage Precarious Workers’ Sociotechnical Practices Working Towards Addressing Wage Theft. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 4585–4598. https://doi.org/10.1145/3025453.3025633",
      "doi": "10.1145/3025453.3025633"
    },
    {
      "text": "Paul Dourish, Christopher Lawrence, Tuck Wah Leong, and Greg Wadley. 2020. On Being Iterated: The Affective Demands of Design Participation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–11. https://doi.org/10.1145/3313831.3376545",
      "doi": "10.1145/3313831.3376545"
    },
    {
      "text": "Veena Dubal. 2017. Wage Slave or Entrepreneur?: Contesting the Dualism of Legal Worker Identities. California Law Review 105, 1 (2017). https://doi.org/10.15779/Z38M84X Publisher: Berkeley Law Scholarship Repository.",
      "doi": ""
    },
    {
      "text": "Veena Dubal. 2021. The New Racial Wage Code. SSRN Electronic Journal(2021). https://doi.org/10.2139/ssrn.3855094",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Lilian Edwards. 2004. The Problem with Privacy. https://papers.ssrn.com/abstract=1857536",
      "doi": ""
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2016. Social Inequality and HCI: The View from Political Economy. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 4997–5002. https://doi.org/10.1145/2858036.2858343",
      "doi": "10.1145/2858036.2858343"
    },
    {
      "text": "Fairwork Foundation. 2022. Prolific (Cloudwork). https://fair.work/en/ratings/platforms/cloudwork-prolific/?y=2022",
      "doi": ""
    },
    {
      "text": "Mark Graham. 2020. Regulate, replicate, and resist – the conjunctural geographies of platform urbanism. Urban Geography 41, 3 (March 2020), 453–457. https://doi.org/10.1080/02723638.2020.1717028",
      "doi": ""
    },
    {
      "text": "Kathleen Griesbach, Adam Reich, Luke Elliott-Negri, and Ruth Milkman. 2019. Algorithmic Control in Platform Food Delivery Work. Socius: Sociological Research for a Dynamic World 5 (Jan. 2019), 237802311987004. https://doi.org/10.1177/2378023119870041",
      "doi": ""
    },
    {
      "text": "Wendy Hall and Jérôme Pesenti. 2017. Growing the artificial intelligence industry in the UK. Department for Digital, Culture, Media & Sport and Department for Business, Energy & Industrial Strategy. Part of the Industrial Strategy UK and the Commonwealth (2017).",
      "doi": ""
    },
    {
      "text": "Jack Hardinges and Jared Robert Keller. 2021. What are ‘bottom-up’ data institutions and how do they empower people? – The ODI. https://theodi.org/article/what-are-bottom-up-data-institutions-and-how-do-they-empower-people/",
      "doi": ""
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: interrupting worker invisibility in amazon mechanical turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 611–620. https://doi.org/10.1145/2470654.2470742",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2016. Stories We Tell About Labor: Turkopticon and the Trouble with \"Design\". In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 4573–4586. https://doi.org/10.1145/2858036.2858592",
      "doi": "10.1145/2858036.2858592"
    },
    {
      "text": "Toby Jia-Jun Li, Lu Yuwen, Jaylexia Clark, Megan Chen, Victor Cox, Meng Jiang, Yang Yang, Tamara Kay, Danielle Wood, and Jay Brockman. 2022. A Bottom-Up End-User Intelligent Assistant Approach to Empower Gig Workers against AI Inequality. CHIWORK 2022 Symposium on Human-Computer Interaction for Work (June 2022), 1–10.",
      "doi": ""
    },
    {
      "text": "Nadia Karizat, Dan Delmonaco, Motahhare Eslami, and Nazanin Andalibi. 2021. Algorithmic Folk Theories and Identity: How TikTok Users Co-Produce Knowledge of Identity and Engage in Algorithmic Resistance. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2 (Oct. 2021), 1–44. https://doi.org/10.1145/3476046",
      "doi": "10.1145/3476046"
    },
    {
      "text": "Becky Kazansky. 2021. ‘It depends on your threat model’: the anticipatory dimensions of resistance to data-driven surveillance. Big Data & Society 8, 1 (Jan. 2021), 205395172098555. https://doi.org/10.1177/2053951720985557",
      "doi": ""
    },
    {
      "text": "Sangmi Kim, Elizabeth Marquis, Rasha Alahmad, Casey S. Pierce, and Lionel P. Robert Jr.2018. The Impacts of Platform Quality on Gig Workers’ Autonomy and Job Satisfaction. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, Jersey City NJ USA, 181–184. https://doi.org/10.1145/3272973.3274050",
      "doi": "10.1145/3272973.3274050"
    },
    {
      "text": "Eliscia Kinder, Mohammad Hossein Jarrahi, and Will Sutherland. 2019. Gig Platforms, Tensions, Alliances and Ecosystems: An Actor-Network Perspective. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 1–26. https://doi.org/10.1145/3359314",
      "doi": "10.1145/3359314"
    },
    {
      "text": "Ernesto Laclau and Chantal Mouffe. 1985. Hegemony and socialist strategy: towards a radical democratic politics. Verso, London.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee. 2018. Understanding perception of algorithmic decisions: Fairness, trust, and emotion in response to algorithmic management. Big Data & Society 5, 1 (Jan. 2018), 205395171875668. https://doi.org/10.1177/2053951718756684",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 1603–1612. https://doi.org/10.1145/2702123.2702548",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Min Kyung Lee, Ishan Nigam, Angie Zhang, Joel Afriyie, Zhizhen Qin, and Sicun Gao. 2021. Participatory Algorithmic Management: Elicitation Methods for Worker Well-Being Models. In Proceedings of the 2021 AAAI/ACM Conference on AI, Ethics, and Society. ACM, Virtual Event USA, 715–726. https://doi.org/10.1145/3461702.3462628",
      "doi": "10.1145/3461702.3462628"
    },
    {
      "text": "Sebastián Lehuedé. 2022. When friction becomes the norm: Antagonism, discourse and planetary data turbulence. New Media & Society (July 2022), 146144482211084. https://doi.org/10.1177/14614448221108449",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the Utopian Vision of Making: HCI After Technosolutionism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 1390–1402. https://doi.org/10.1145/2858036.2858506",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Natasha Lomas. 2021. Dutch court rejects Uber drivers’ ‘robo-firing’ charge but tells Ola to explain algo-deductions. https://social.techcrunch.com/2021/03/12/dutch-court-rejects-uber-drivers-robo-firing-charge-but-tells-ola-to-explain-algo-deductions/",
      "doi": ""
    },
    {
      "text": "Elizabeth B. Marquis, Sangmi Kim, Rasha Alahmad, Casey S. Pierce, and Lionel P. Robert Jr.2018. Impacts of Perceived Behavior Control and Emotional Labor on Gig Workers. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, Jersey City NJ USA, 241–244. https://doi.org/10.1145/3272973.3274065",
      "doi": "10.1145/3272973.3274065"
    },
    {
      "text": "Amanda Meng and Carl DiSalvo. 2018. Grassroots resource mobilization through counter-data action. Big Data & Society 5, 2 (July 2018), 205395171879686. https://doi.org/10.1177/2053951718796862",
      "doi": ""
    },
    {
      "text": "Ruth Milkman, Luke Elliott-Negri, Kathleen Griesbach, and Adam Reich. 2021. Gender, Class, and the Gig Economy: The Case of Platform-Based Food Delivery. Critical Sociology 47, 3 (2021), 357–372. https://doi.org/10.1177/0896920520949631 _eprint: https://doi.org/10.1177/0896920520949631.",
      "doi": ""
    },
    {
      "text": "Chantal Mouffe (Ed.). 1992. Dimensions of radical democracy: pluralism, citizenship, community. Verso, London ; New York.",
      "doi": ""
    },
    {
      "text": "Chantal Mouffe. 2005. On the political. Routledge, London ; New York. OCLC: ocm56806700.",
      "doi": ""
    },
    {
      "text": "Dave Murray-Rust, Alan Davoust, Petros Papapanagiotou, Areti Manataki, Max Van Kleek, Nigel Shadbolt, and Dave Robertson. 2018. Towards Executable Representations of Social Machines. In Diagrammatic Representation and Inference, Peter Chapman, Gem Stapleton, Amirouche Moktefi, Sarah Perez-Kriz, and Francesco Bellucci (Eds.). Springer International Publishing, Cham, 765–769.",
      "doi": ""
    },
    {
      "text": "Kieron O’hara. 2019. Data Trusts: Ethics, Architecture and Governance for Trustworthy Data Stewardship. University of Southampton. https://doi.org/10.5258/SOTON/WSI-WP001",
      "doi": ""
    },
    {
      "text": "Open Data Insitute and Projects by IF. 2022. Perceptions of “Bottom-up Data Institutions”: A report on research findings and key learnings for ODI. Technical Report. Open Data Institute, London.",
      "doi": ""
    },
    {
      "text": "Alex Rosenblat and Luke Stark. 2015. Uber’s Drivers: Information Asymmetries and Control in Dynamic Work. SSRN Electronic Journal(2015). https://doi.org/10.2139/ssrn.2686227",
      "doi": ""
    },
    {
      "text": "Herbert Rubin and Irene Rubin. 2012. Qualitative Interviewing (2nd ed.): The Art of Hearing Data. SAGE Publications, Inc., Thousand Oaks, 64–78,223. https://doi.org/10.4135/9781452226651",
      "doi": ""
    },
    {
      "text": "Anouk Ruhaak. 2020. Data trusts: what are they and how do they work?https://www.thersa.org/blog/2020/06/data-trusts-protection",
      "doi": ""
    },
    {
      "text": "Bhavani Seetharaman, Joyojeet Pal, and Julie Hui. 2021. Delivery Work and the Experience of Social Isolation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–17. Publisher: ACM New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Brandon Sellers. 2020. Who are delivery drivers: A demographic breakdown of delivery drivers in the U.S.https://gridwise.io/blog/b2b/who-are-delivery-drivers-a-demographic-breakdown-of-delivery-drivers-in-the-u-s/ Section: B2B.",
      "doi": ""
    },
    {
      "text": "Harini Suresh, Rajiv Movva, Amelia Lee Dogan, Rahul Bhargava, Isadora Cruxen, Angeles Martinez Cuba, Guilia Taurino, Wonyoung So, and Catherine D’Ignazio. 2022. Towards Intersectional Feminist and Participatory ML: A Case Study in Supporting Feminicide Counterdata Collection. In 2022 ACM Conference on Fairness, Accountability, and Transparency. ACM, Seoul Republic of Korea, 667–678. https://doi.org/10.1145/3531146.3533132",
      "doi": "10.1145/3531146.3533132"
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring participation: on how we involve people in design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 429–438. https://doi.org/10.1145/2470654.2470716",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Christine T. Wolf, Mariam Asad, and Lynn S. Dombrowski. 2022. Designing within Capitalism. In Designing Interactive Systems Conference. ACM, Virtual Event Australia, 439–453. https://doi.org/10.1145/3532106.3533559",
      "doi": "10.1145/3532106.3533559"
    },
    {
      "text": "Christine T. Wolf, Haiyi Zhu, Julia Bullard, Min Kyung Lee, and Jed R. Brubaker. 2018. The Changing Contours of \"Participation\" in Data-driven, Algorithmic Ecosystems: Challenges, Tactics, and an Agenda. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, Jersey City NJ USA, 377–384. https://doi.org/10.1145/3272973.3273005",
      "doi": "10.1145/3272973.3273005"
    },
    {
      "text": "Alex J Wood, Mark Graham, Vili Lehdonvirta, and Isis Hjorth. 2019. Good Gig, Bad Gig: Autonomy and Algorithmic Control in the Global Gig Economy. Work, Employment and Society 33, 1 (Feb. 2019), 56–75. https://doi.org/10.1177/0950017018785616",
      "doi": ""
    },
    {
      "text": "Alex J Wood and Vili Lehdonvirta. 2021. Antagonism beyond employment: how the ‘subordinated agency’ of labour platforms generates conflict in the remote gig economy. Socio-Economic Review 19, 4 (Nov. 2021), 1369–1396. https://doi.org/10.1093/ser/mwab016",
      "doi": ""
    },
    {
      "text": "Alex J. Wood, Nicholas Martindale, and Vili Lehdonvirta. 2021. Dynamics of contention in the gig economy: Rage against the platform, customer or state?New Technology, Work and Employment (Sept. 2021), ntwe.12216. https://doi.org/10.1111/ntwe.12216",
      "doi": ""
    },
    {
      "text": "Jamie Woodcock and Mark Graham. 2019. The gig economy. A critical introduction. Cambridge: Polity(2019).",
      "doi": ""
    },
    {
      "text": "Zheng Yao, Silas Weden, Lea Emerlyn, Haiyi Zhu, and Robert E Kraut. 2021. Together But Alone: Atomization and Peer Support among Gig Workers. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–29. Publisher: ACM New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Angie Zhang, Alexander Boltz, Chun Wei Wang, and Min Kyung Lee. 2022. Algorithmic Management Reimagined For Workers and By Workers: Centering Worker Well-Being in Gig Work. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–20. https://doi.org/10.1145/3491102.3501866",
      "doi": "10.1145/3491102.3501866"
    }
  ]
}