{
  "doi": "10.1145/3544548.3580976",
  "title": "Understanding and Mitigating Challenges for Non-Profit Driven Indie Game Development to Innovate Game Production",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Non-profit driven indie game development represents a growing open and participatory game production model as an alternative to the traditional mainstream gaming industry. However, this community is also facing and coping with tensions and dilemmas brought by its focus on artistic and cultural values over economic benefits. Using 28 interviews with indie game developers with a non-profit agenda across various cultures, we investigate the challenges non-profit driven indie game developers face, which mainly emerge in their personal or collaborative labor and their endeavors to secure sustainable resources and produce quality products. Our investigation extends the current HCI knowledge of the democratization of technology and its impact on the trajectory of innovating, designing, and producing future (gaming) technologies. These insights may help increase the opportunities for and retention of previously underrepresented groups in technology production and inform effective decision/policy making to better support the creativity industry in the future.",
  "authors": [
    {
      "name": "Guo Freeman",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639182",
      "orcid": "0000-0001-5107-7794"
    },
    {
      "name": "Lingyuan Li",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588610",
      "orcid": "0000-0002-8640-9936"
    },
    {
      "name": "Nathan Mcneese",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758690057",
      "orcid": "0000-0002-9143-2460"
    },
    {
      "name": "Kelsea Schulenberg",
      "institution": "School of Computing, Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659959850",
      "orcid": "0000-0002-1503-7872"
    }
  ],
  "references": [
    {
      "text": "Morgan G Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A Mellis, and Daniela K Rosner. 2014. Making cultures: empowerment, participation, and democracy-or not?In CHI’14 Extended Abstracts on Human Factors in Computing Systems. 1087–1092.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Cindy Lin Kaiying, Silvia Lindtner, and Austin Toombs. 2017. HCI’s Making Agendas.Found. Trends Hum. Comput. Interact. 11, 3 (2017), 126–200.",
      "doi": "10.1561/1100000066"
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, and Sarah Ng. 2017. Supporting cultures of making: Technology, policy, visions, and myths. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6523–6535.",
      "doi": "10.1145/3025453.3025975"
    },
    {
      "text": "Pierre Bourdieu and Loïc JD Wacquant. 1992. An invitation to reflexive sociology. University of Chicago press.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory : a practical guide through qualitative analysis. Sage Publications, London; Thousand Oaks, Calif.http://www.amazon.com/Constructing-Grounded-Theory-Qualitative-Introducing/dp/0761973532",
      "doi": ""
    },
    {
      "text": "Game Developers Conference. 2020. 2020 State of the Game Industry Report. Retrieved November 14, 2022 from https://reg.gdconf.com/gdc-state-of-game-industry-2020",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt. 2014. Fostering social capital in economically distressed communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 531–540.",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2015. The political economy of computing: the elephant in the HCI room. interactions 22, 6 (2015), 46–49.",
      "doi": "10.1145/2832117"
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2016. Social inequality and HCI: The view from political economy. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4997–5002.",
      "doi": "10.1145/2858036.2858343"
    },
    {
      "text": "Stephanie J Fisher and Alison Harvey. 2013. Intervention for inclusivity: Gender politics and indie game development. Loading... 7, 11 (2013).",
      "doi": ""
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, Shaowen Bardzell, and Nathan McNeese. 2020. Mitigating Exploitation: Indie Game Developers’ Reconfigurations of Labor in Technology. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–23.",
      "doi": "10.1145/3392864"
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, Shaowen Bardzell, and Nathan J McNeese. 2019. The Innovation Ecology: Collaborative Information, Community Support, and Policy in a Creative Technology Community. In International Conference on Information. Springer, 614–624.",
      "doi": ""
    },
    {
      "text": "Guo Freeman, Nathan McNeese, Jeffrey Bardzell, and Shaowen Bardzell. 2020. \" Pro-Amateur\"-Driven Technological Innovation: Participation and Challenges in Indie Game Development. Proceedings of the ACM on Human-Computer Interaction 4, GROUP(2020), 1–22.",
      "doi": "10.1145/3375184"
    },
    {
      "text": "Guo Freeman and Nathan J McNeese. 2019. Exploring Indie Game Development: Team Practices and Social Experiences in A Creativity-Centric Technology Community. Computer Supported Cooperative Work (CSCW) 28, 3-4 (2019), 723–748.",
      "doi": "10.1007/s10606-019-09348-x"
    },
    {
      "text": "Maria B Garda and Paweł Grabarczyk. 2016. Is every indie game independent? Towards the concept of independent game. Game Studies 16, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Orlando Guevara-Villalobos. 2015. Independent gamework and identity: Problems and subjective nuances.. In DiGRA Conference.",
      "doi": ""
    },
    {
      "text": "Julia Katherine Haines. 2014. Emerging innovation: the global expansion of seed accelerators. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing. 57–60.",
      "doi": "10.1145/2556420.2556823"
    },
    {
      "text": "William A Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on twitch: fostering participatory communities of play within live mixed media. In Proceedings of the SIGCHI conference on human factors in computing systems. 1315–1324.",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "Alison Harvey. 2014. Twine’s revolution: Democratization, depoliticization, and the queering of game design. G| A| M| E Games as Art, Media, Entertainment 1, 3(2014).",
      "doi": ""
    },
    {
      "text": "Alison Harvey and Stephanie Fisher. 2015. “Everyone can make games!”: The post-feminist context of women in digital game production. Feminist Media Studies 15, 4 (2015), 576–592.",
      "doi": ""
    },
    {
      "text": "Andrea Hsu. 2021. As The Pandemic Recedes, Millions Of Workers Are Saying ’I Quit’. https://www.npr.org/2021/06/24/1007914455/as-the-pandemic-recedes-millions-of-workers-are-saying-i-quit",
      "doi": ""
    },
    {
      "text": "Andreas Jahn-Sudmann. 2008. Innovation NOT opposition: the logic of distinction of independent games. Eludamos: Journal for Computer Game Culture 2, 1 (2008), 5–10.",
      "doi": ""
    },
    {
      "text": "Sven Jöckel, Andreas Will, and Florian Schwarzer. 2008. Participatory media culture and digital online distribution—reconfiguring the value chain in the computer game industry. The International Journal on Media Management 10, 3(2008), 102–111.",
      "doi": ""
    },
    {
      "text": "Brendan Keogh. 2021. 1. Hobbyist Game Making Between Self-Exploitation and Self-Emancipation. Game Production Studies(2021), 29.",
      "doi": ""
    },
    {
      "text": "Óliver Pérez Latorre 2016. Indie or mainstream? Tensions and nuances between the alternative and the mainstream in indie games. Anàlisi (2016), 15–30.",
      "doi": ""
    },
    {
      "text": "Maurizio Lazzarato. 1996. Immaterial labor. Radical thought in Italy: A potential politics 1996 (1996), 133–47.",
      "doi": ""
    },
    {
      "text": "Pascal Lessel, Alexander Vielhauer, and Antonio Krüger. 2017. Expanding video game live-streams with enhanced communication channels: a case study. In Proceedings of the 2017 CHI conference on human factors in computing systems. 1571–1576.",
      "doi": "10.1145/3025453.3025708"
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the utopian vision of making: HCI after technosolutionism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1390–1402.",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Nadav Lipkin. 2013. Examining Indie’s Independence: The meaning of \"Indie\" Games, the politics of production, and mainstream cooptation. Loading... 7, 11 (2013).",
      "doi": ""
    },
    {
      "text": "Ioanna Lykourentzou, Angeliki Antoniou, Yannick Naudet, and Steven P Dow. 2016. Personality matters: Balancing for personality types leads to better outcomes for crowd teams. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 260–273.",
      "doi": "10.1145/2818048.2819979"
    },
    {
      "text": "Chase Bowen Martin and Mark Deuze. 2009. The independent production of culture: A digital games case study. Games and culture 4, 3 (2009), 276–295.",
      "doi": ""
    },
    {
      "text": "Christian McCrea. 2013. Australian Video Games: The Collapse and Reconstruction of an Industry. In Gaming Globally. Springer, 203–207.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Sharan B Merriam and Elizabeth J Tisdell. 2015. Qualitative research: A guide to design and implementation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Casey O’Donnell. 2012. The North American game industry. The video game industry: Formation, present state, and future (2012), 99–115.",
      "doi": ""
    },
    {
      "text": "Felan Parker, Jennifer R Whitson, and Bart Simon. 2018. Megabooth: The cultural intermediation of indie games. new media & society 20, 5 (2018), 1953–1972.",
      "doi": ""
    },
    {
      "text": "Leônidas S Pereira and Maurício MS Bernardes. 2018. Aspects of independent game production: An exploratory study. Computers in Entertainment (CIE) 16, 4 (2018), 1–16.",
      "doi": "10.1145/3276322"
    },
    {
      "text": "Noopur Raval and Paul Dourish. 2016. Standing out from the crowd: Emotional labor, body labor, and temporal labor in ridesharing. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 97–107.",
      "doi": "10.1145/2818048.2820026"
    },
    {
      "text": "David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. 2015. Sustainable making? Balancing optimism and criticism in HCI discourse. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 3(2015), 1–27.",
      "doi": "10.1145/2699742"
    },
    {
      "text": "Paolo Ruffino. 2020. Independent Videogames: Cultures, Networks, Techniques and Politics. Routledge.",
      "doi": ""
    },
    {
      "text": "Rebecca H Rutherfoord. 2001. Using personality inventories to help form teams for software engineering class projects. ACM Sigcse Bulletin 33, 3 (2001), 73–76.",
      "doi": "10.1145/507758.377486"
    },
    {
      "text": "Bart Simon. 2013. Indie Eh? Some Kind of Game Studies.Loading... 7, 11 (2013).",
      "doi": ""
    },
    {
      "text": "Olli Sotamaa and Jan Svelch. 2021. Game production studies. Amsterdam University Press.",
      "doi": ""
    },
    {
      "text": "Keith Stuart. 2012. Us and the game industry–How indie games are the new counter-culture. The Guardian (2012).",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Amanda M Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2603–2612.",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "José Pedro Tavares and Licínio Roque. 2007. Games 2.0: Participatory Game Creation. In Proceedings of the 6th Symposium on Computer Games and Digital Entertainment.",
      "doi": ""
    },
    {
      "text": "Vanissa Wanick and Chaiane Bitelo. 2020. Exploring the use of participatory design in game design: a Brazilian perspective. International Journal of Serious Games 7, 3 (2020), 3–20.",
      "doi": ""
    },
    {
      "text": "Emma Westecott. 2013. Independent game development as craft. Loading… The Journal of the Canadian Game Studies Association 7, 11(2013), 78–91.",
      "doi": ""
    },
    {
      "text": "Jennifer R Whitson, Bart Simon, and Felan Parker. 2021. The Missing Producer: Rethinking indie cultural production in terms of entrepreneurship, relational labour, and sustainability. European Journal of Cultural Studies 24, 2 (2021), 606–627.",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn and Guo Freeman. 2020. Live streaming, playing, and money spending behaviors in eSports. Games and Culture 15, 1 (2020), 73–88.",
      "doi": ""
    },
    {
      "text": "Adrian Wright. 2015. It’s all about games: Enterprise and entrepreneurialism in digital games. New Technology, Work and Employment 30, 1 (2015), 32–46.",
      "doi": ""
    }
  ]
}