{
  "doi": "10.1145/3544548.3580819",
  "title": "Tracing and Visualizing Human-ML/AI Collaborative Processes through Artifacts of Data Work",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2023,
  "badges": [],
  "abstract": "Automated Machine Learning (AutoML) technology can lower barriers in data work yet still requires human intervention to be functional. However, the complex and collaborative process resulting from humans and machines trading off work makes it difficult to trace what was done, by whom (or what), and when. In this research, we construct a taxonomy of data work artifacts that captures AutoML and human processes. We present a rigorous methodology for its creation and discuss its transferability to the visual design process. We operationalize the taxonomy through the development of AutoML Trace  a visual interactive sketch showing both the context and temporality of human-ML/AI collaboration in data work. Finally, we demonstrate the utility of our approach via a usage scenario with an enterprise software development team. Collectively, our research process and findings explore challenges and fruitful avenues for developing data visualization tools that interrogate the sociotechnical relationships in automated data work.  Availability of Supplemental Materials: https://osf.io/3nmyj/?view_only=19962103d58b45d289b5c83421f48b36",
  "authors": [
    {
      "name": "Jen Rogers",
      "institution": "Visualization Design Lab, University of Utah, Scientific Computing and Imaging Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782933",
      "orcid": "0000-0002-9568-469X"
    },
    {
      "name": "Anamaria Crisan",
      "institution": "Tableau Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81458656138",
      "orcid": "0000-0003-3445-3414"
    }
  ],
  "references": [
    {
      "text": "Oshin Agarwal, Heming Ge, Siamak Shakeri, and Rami Al-Rfou. 2021. Knowledge Graph Based Synthetic Corpus Generation for Knowledge-Enhanced Language Model Pre-training. https://arxiv.org/abs/2010.12688",
      "doi": ""
    },
    {
      "text": "Stefano Alletto, Shenyang Huang, Vincent Francois-Lavet, Yohei Nakata, and Guillaume Rabusseau. 2020. RandomNet: Towards Fully Automatic Neural Architecture Design for Multimodal Learning. arXiv:2003.01181https://arxiv.org/abs/2003.01181",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proc. CHI’19. 1–13. https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Daniel S. Weld, Walter S. Lasecki, and Eric Horvitz. 2019. Updates in Human-AI Teams: Understanding and Addressing the Performance/Compatibility Tradeoff. Proc AAAI’19 33, 01 (Jul. 2019), 2429–2437. https://doi.org/10.1609/aaai.v33i01.33012429",
      "doi": "10.1609/aaai.v33i01.33012429"
    },
    {
      "text": "Alejandro Barredo Arrieta, Natalia Díaz-Rodríguez, Javier Del Ser, Adrien Bennetot, Siham Tabik, Alberto Barbado, Salvador Garcia, Sergio Gil-Lopez, Daniel Molina, Richard Benjamins, Raja Chatila, and Francisco Herrera. 2020. Explainable Artificial Intelligence (XAI): Concepts, taxonomies, opportunities and challenges toward responsible AI. Information Fusion 58(2020), 82–115. https://doi.org//10.1016/j.inffus.2019.12.012",
      "doi": "10.1016/j.inffus.2019.12.012"
    },
    {
      "text": "Leilani Battle and Jeffrey Heer. 2019. Characterizing Exploratory Visual Analysis: A Literature Review and Evaluation of Analytic Provenance in Tableau. Computer Graphics Forum 38, 3 (2019), 145–159. https://doi.org/10.1111/cgf.13678",
      "doi": ""
    },
    {
      "text": "Fabian Beck, Michael Burch, Stephan Diehl, and Daniel Weiskopf. 2017. A Taxonomy and Survey of Dynamic Graph Visualization. Computer Graphics Forum 36, 1 (2017), 133–159. https://doi.org/10.1111/cgf.12791",
      "doi": "10.1111/cgf.12791"
    },
    {
      "text": "Nadia Boukhelifa, Anastasia Bezerianos, Remco Chang, Christopher Collins, Steven Drucker, Alexander Endert, Jessica Hullman, Chris North, and Michael Sedlmair. 2020. Challenges in evaluating interactive visual machine learning systems. IEEE Computer Graphics and Applications 40, 6 (2020), 88–96.",
      "doi": ""
    },
    {
      "text": "Matthew Brehmer and Tamara Munzner. 2013. A Multi-Level Typology of Abstract Visualization Tasks. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2376–2385. https://doi.org/10.1109/TVCG.2013.124",
      "doi": "10.1109/TVCG.2013.124"
    },
    {
      "text": "Eli T. Brown, Jingjing Lie, Carla E. Brodely, and Remco Chang. 2012. Dis-function: Learning Distance Functions Interactively. In 2012 IEEE Conference on Visual Analytics Science and Technology (VAST). 83–92. https://doi.org/10.1109/VAST.2012.6400486",
      "doi": "10.1109/VAST.2012.6400486"
    },
    {
      "text": "José Pablo Cambronero. 2021. Mining Software Artifacts for use in Automated Machine Learning. Ph.D. Dissertation. MIT-CSAIL. https://www.josecambronero.com/pdf/JCambronero-PhD-EECS-June2021.pdf",
      "doi": ""
    },
    {
      "text": "Dylan Cashman, Shah Rukh Humayoun, Florian Heimerl, Kendall Park, Subhajit Das, John Thompson, Bahador Saket, Abigail Mosca, John Stasko, Alex Endert, Michael Gleicher, and Remco Chang. 2019. A User-based Visual Analytics Workflow for Exploratory Model Analysis. Computer Graphics Forum 38, 3 (2019), 185–199. https://doi.org/10.1111/cgf.13681",
      "doi": ""
    },
    {
      "text": "Bilge Celik and Joaquin Vanschoren. 2021. Adaptation Strategies for Automated Machine Learning on Evolving Data. IEEE Transactions on Pattern Analysis and Machine Intelligence (2021), 1–1. https://doi.org/10.1109/TPAMI.2021.3062900",
      "doi": ""
    },
    {
      "text": "Anamaria Crisan and Brittany Fiore-Gartland. 2021. Fits and Starts: Enterprise Use of AutoML and the Role of Humans in the Loop. In Proc CHI’21. Article 601, 15 pages.",
      "doi": "10.1145/3411764.3445775"
    },
    {
      "text": "Anamaria Crisan, Brittany Fiore-Gartland, and Melanie Tory. 2021. Passing the Data Baton : A Retrospective Analysis on Data Science Work and Workers. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 1860–1870. https://doi.org/10.1109/TVCG.2020.3030340",
      "doi": ""
    },
    {
      "text": "Zach Cutler, Kiran Gadhave, and Alexander Lex. 2020. Trrack: A Library for Provenance-Tracking in Web-Based Visualizations. In 2020 IEEE Visualization Conference (VIS). 116–120. https://doi.org/10.1109/VIS47514.2020.00030",
      "doi": ""
    },
    {
      "text": "Tim Davies and Mark Frank. 2013. ’There’s No Such Thing as Raw Data’: Exploring the Socio-Technical Life of a Government Dataset. In Proc WebSci ’13. 75–78. https://doi.org/10.1145/2464464.2464472",
      "doi": "10.1145/2464464.2464472"
    },
    {
      "text": "Tijl De Bie, Luc De Raedt, José Hernández-Orallo, Holger H. Hoos, Padhraic Smyth, and Christopher K. I. Williams. 2022. Automating Data Science. Commun. ACM 65, 3 (feb 2022), 76–87. https://doi.org/10.1145/3495256",
      "doi": "10.1145/3495256"
    },
    {
      "text": "Dominik Dellermann, Adrian Calma, Nikolaus Lipusch, Thorsten Weber, Sascha Weigel, and Philipp Ebel. 2021. The future of human-AI collaboration: a taxonomy of design knowledge for hybrid intelligence systems. arXiv:2105.03354https://arxiv.org/abs/2105.03354",
      "doi": ""
    },
    {
      "text": "Veronika Domova and Katerina Vrotsou. 2022. A Model for Types and Levels of Automation in Visual Analytics: a Survey, a Taxonomy, and Examples. IEEE Transactions on Visualization and Computer Graphics (2022).",
      "doi": ""
    },
    {
      "text": "Jaimie Drozdal, Justin Weisz, Dakuo Wang, Gaurav Dass, Bingsheng Yao, Changruo Zhao, Michael Muller, Lin Ju, and Hui Su. 2020. Trust in AutoML: Exploring Information Needs for Establishing Trust in Automated Machine Learning Systems. In Proc. IUI’20. 297–307. https://doi.org/10.1145/3377325.3377501",
      "doi": "10.1145/3377325.3377501"
    },
    {
      "text": "Radwa Elshawi, Mohamed Maher, and Sherif Sakr. 2019. Automated Machine Learning: State-of-The-Art and Open Challenges. arXiv:1906.02287https://arxiv.org/abs/1906.02287",
      "doi": ""
    },
    {
      "text": "Alex Endert, Patrick Fiaux, and Chris North. 2012. Semantic Interaction for Visual Text Analytics. In Proc CHI’12. 473–482. https://doi.org/10.1145/2207676.2207741",
      "doi": "10.1145/2207676.2207741"
    },
    {
      "text": "Alex Endert, William Ribarsky, Cagatay Turkay, BL William Wong, Ian Nabney, I Díaz Blanco, and Fabrice Rossi. 2017. The state of the art in integrating machine learning into visual analytics. In Computer Graphics Forum, Vol. 36. Wiley Online Library, 458–486.",
      "doi": ""
    },
    {
      "text": "Suilan Estevez-Velarde, Yoan Gutiérrez, Andrés Montoyo, and Yudivián Almeida-Cruz. 2019. AutoML Strategy Based on Grammatical Evolution: A Case Study about Knowledge Discovery from Text. In Proc ACL’19. 4356–4365. https://doi.org/10.18653/v1/P19-1428",
      "doi": ""
    },
    {
      "text": "Matthias Feurer, Katharina Eggensperger, Stefan Falkner, Marius Lindauer, and Frank Hutter. 2020. Auto-Sklearn 2.0: The Next Generation. arXiv:2007.04074https://arxiv.org/abs/2007.04074",
      "doi": ""
    },
    {
      "text": "Gerhard . Fischer and Jonathan. Otswald. 2001. Knowledge management: problems, promises, realities, and challenges. IEEE Intelligent Systems 16, 1 (2001), 60–72. https://doi.org/10.1109/5254.912386",
      "doi": "10.1109/5254.912386"
    },
    {
      "text": "Kiran Gadhave, Jochen Görtler, Zach Cutler, Carolina Nobre, Oliver Deussen, Miriah Meyer, Jeff Phillips, and Alexander Lex. 2020. Capturing User Intent when Brushing in Scatterplots. https://doi.org/10.31219/osf.io/mq2rk",
      "doi": ""
    },
    {
      "text": "Sebastian Gehrmann, Hendrik Strobelt, Robert Krüger, Hanspeter Pfister, and Alexander M. Rush. 2020. Visual Interaction with Deep Learning Models through Collaborative Semantic Inference. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 884–894. https://doi.org/10.1109/TVCG.2019.2934595",
      "doi": ""
    },
    {
      "text": "Pieter Gijsbers, Erin LeDell, Janek Thomas, Sébastien Poirier, Bernd Bischl, and Joaquin Vanschoren. 2019. An Open Source AutoML Benchmark. arXiv:1907.00909https://arxiv.org/abs/1907.00909",
      "doi": ""
    },
    {
      "text": "Lisa Gitelman. 2013. “Raw Data” Is an Oxymoron. MIT Press, Cambridge, USA.",
      "doi": ""
    },
    {
      "text": "Michael Gleicher. 2018. Considerations for Visualizing Comparison. IEEE Transactions on Visualization and Computer Graphics 24, 1(2018), 413–423. https://doi.org/10.1109/TVCG.2017.2744199",
      "doi": ""
    },
    {
      "text": "Michael Gleicher, Danielle Albers, Rick Walker, Ilir Jusufi, Charles D. Hansen, and Jonathan C. Roberts. 2011. Visual Comparison for Information Visualization. Information Visualization 10, 4 (Oct. 2011), 289–309. https://doi.org/10.1177/1473871611416549",
      "doi": "10.1177/1473871611416549"
    },
    {
      "text": "Daniel Golovin, Benjamin Solnik, Subhodeep Moitra, Greg Kochanski, John Karro, and D. Sculley. 2017. Google Vizier: A Service for Black-Box Optimization. In Proc KDD’17. 1487–1495. https://doi.org/10.1145/3097983.3098043",
      "doi": "10.1145/3097983.3098043"
    },
    {
      "text": "Saul Greenberg and William Buxton. 2008. Usability evaluation considered harmful (some of the time). Proc. CHI’08, 111–120. https://doi.org/10.1145/1357054.1357074",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Xin He, Kaiyong Zhao, and Xiaowen Chu. 2021. AutoML: A survey of the state-of-the-art. Knowledge-Based Systems 212 (Jan 2021), 106622. https://doi.org/10.1016/j.knosys.2020.106622",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer. 2019. Agency Plus Automation: Designing Artificial Intelligence into Interactive Systems. Proceedings of the National Academy of Sciences 116, 6 (2019), 1844–1850. https://doi.org/10.1073/pnas.1807184115",
      "doi": ""
    },
    {
      "text": "Yuval Heffetz, Roman Vainshtein, Gilad Katz, and Lior Rokach. 2020. DeepLine: AutoML Tool for Pipelines Generation Using Deep Reinforcement Learning and Hierarchical Actions Filtering. In Proc KDD ’20. 2103–2113. https://doi.org/10.1145/3394486.3403261",
      "doi": "10.1145/3394486.3403261"
    },
    {
      "text": "Sungsoo Ray Hong, Sonia Castelo, Vito D’Orazio, Christopher Benthune, Aecio Santos, Scott Langevin, David Jonker, Enrico Bertini, and Juliana Freire. 2020. Towards Evaluating Exploratory Model Building Process with AutoML Systems. arXiv:2009.00449https://arxiv.org/abs/2009.00449",
      "doi": ""
    },
    {
      "text": "Sungsoo Ray Hong, Jessica Hullman, and Enrico Bertini. 2020. Human Factors in Model Interpretability: Industry Practices, Challenges, and Needs. Proc. CSCW’20. 4, CSCW1, Article 068 (May 2020), 26 pages. https://doi.org/10.1145/3392878",
      "doi": "10.1145/3392878"
    },
    {
      "text": "Kevin Hu, Michiel A. Bakker, Stephen Li, Tim Kraska, and César Hidalgo. 2019. VizML: A Machine Learning Approach to Visualization Recommendation. In Proc. CHI’19. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300358",
      "doi": "10.1145/3290605.3300358"
    },
    {
      "text": "Haifeng Jin, Qingquan Song, and Xia Hu. 2019. Auto-Keras: An Efficient Neural Architecture Search System. In Proc KDD ’19 (Anchorage, AK, USA). Association for Computing Machinery, New York, NY, USA, 1946–1956. https://doi.org/10.1145/3292500.3330648",
      "doi": "10.1145/3292500.3330648"
    },
    {
      "text": "Bonnie E John, Len Bass, Rick Kazman, and Eugene Chen. 2004. Identifying gaps between HCI, software engineering, and design, and boundary objects to bridge them. In CHI’04 extended abstracts on Human factors in computing systems. 1723–1724.",
      "doi": ""
    },
    {
      "text": "Shubhra Kanti Karmaker, Md. Mahadi Hassan, Micah J. Smith, Lei Xu, ChengXiang Zhai, and Kalyan Veeramachaneni. 2021. AutoML to Date and Beyond: Challenges and Opportunities. arXiv:2010.10777https://arxiv.org/abs/2010.10777",
      "doi": ""
    },
    {
      "text": "Stephen Kasica, Charles Berret, and Tamara Munzner. 2021. Table Scraps: An Actionable Framework for Multi-Table Data Wrangling From An Artifact Study of Computational Journalism. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 957–966. https://doi.org/10.1109/TVCG.2020.3030462",
      "doi": ""
    },
    {
      "text": "Harmanpreet Kaur, Harsha Nori, Samuel Jenkins, Rich Caruana, Hanna Wallach, and Jennifer Wortman Vaughan. 2020. Interpreting Interpretability: Understanding Data Scientists’ Use of Interpretability Tools for Machine Learning. 1–14. https://doi.org/h10.1145/3313831.3376219",
      "doi": "10.1145/3313831.3376219"
    },
    {
      "text": "Kristian Kreiner. 2002. Tacit knowledge management: the role of artifacts. Journal of Knowledge Management 6, 2 (01 Jan 2002), 112–123. https://doi.org/10.1108/13673270210424648",
      "doi": ""
    },
    {
      "text": "Heidi Lam, Melanie Tory, and Tamara Munzner. 2018. Bridging from Goals to Tasks with Design Study Analysis Reports. IEEE Transactions on Visualization and Computer Graphics 24, 1(2018), 435–445. https://doi.org/10.1109/TVCG.2017.2744319",
      "doi": ""
    },
    {
      "text": "Charlotte P. Lee. 2007. Boundary Negotiating Artifacts: Unbinding the Routine of Boundary Objects and Embracing Chaos in Collaborative Work. Proc. CSCW’07 16, 3 (01 Jun 2007), 307–339. https://doi.org/10.1007/s10606-007-9044-5",
      "doi": "10.1007/s10606-007-9044-5"
    },
    {
      "text": "D. Lee, Stephen Macke, Doris Xin, Angela Lee, Silu Huang, and Aditya G. Parameswaran. 2019. A Human-in-the-loop Perspective on AutoML: Milestones and the Road Ahead. IEEE Data Eng. Bull. 42, 2 (2019), 59–70. http://sites.computer.org/debull/A19june/p59.pdf",
      "doi": ""
    },
    {
      "text": "Doris Jung-Lin Lee, Vidya Setlur, Melanie Tory, Karrie G Karahalios, and Aditya Parameswaran. 2021. Deconstructing categorization in visualization recommendation: A taxonomy and comparative study. IEEE Transactions on Visualization and Computer Graphics (2021).",
      "doi": "10.1109/TVCG.2021.3085751"
    },
    {
      "text": "Doris Jung-Lin Lee, Vidya Setlur, Melanie Tory, Karrie G. Karahalios, and Aditya Parameswaran. 2021. Deconstructing Categorization in Visualization Recommendation: A Taxonomy and Comparative Study. IEEE Transactions on Visualization and Computer Graphics (2021), 1–1. https://doi.org/10.1109/TVCG.2021.3085751",
      "doi": "10.1109/TVCG.2021.3085751"
    },
    {
      "text": "Doris Jung-Lin Lee, Dixin Tang, Kunal Agarwal, Thyne Boonmark, Caitlyn Chen, Jake Kang, Ujjaini Mukhopadhyay, Jerry Song, Micah Yong, Marti A. Hearst, and Aditya G. Parameswaran. 2021. Lux: Always-on Visualization Recommendations for Exploratory Data Science. https://arxiv.org/abs/2105.00121",
      "doi": ""
    },
    {
      "text": "Shixia Liu, Xiting Wang, Mengchen Liu, and Jun Zhu. 2017. Towards better analysis of machine learning models: A visual analytics perspective. Visual Informatics 1, 1 (2017), 48–56. https://doi.org/10.1016/j.visinf.2017.01.006",
      "doi": ""
    },
    {
      "text": "Yang Liu, Tim Althoff, and Jeffrey Heer. 2020. Paths Explored, Paths Omitted, Paths Obscured: Decision Points; Selective Reporting in End-to-End Data Analysis. In Proc. CHI’20. 1–14. https://doi.org/10.1145/3313831.3376533",
      "doi": "10.1145/3313831.3376533"
    },
    {
      "text": "Yang Liu, Alex Kale, Tim Althoff, and Jeffrey Heer. 2021. Boba: Authoring and Visualizing Multiverse Analyses. IEEE Transactions on Visualization and Computer Graphics 27, 2 (Feb 2021), 1753–1763. https://doi.org/10.1109/tvcg.2020.3028985",
      "doi": ""
    },
    {
      "text": "David Lloyd and Jason Dykes. 2011. Human-Centered Approaches in Geovisualization Design: Investigating Multiple Methods Through a Long-Term Case Study. IEEE Transactions on Visualization and Computer Graphics 17, 12(2011), 2498–2507. https://doi.org/10.1109/TVCG.2011.209",
      "doi": "10.1109/TVCG.2011.209"
    },
    {
      "text": "Octavio Loyola-González. 2019. Black-Box vs. White-Box: Understanding Their Advantages and Weaknesses From a Practical Point of View. IEEE Access 7(2019), 154096–154113. https://doi.org/10.1109/ACCESS.2019.2949286",
      "doi": ""
    },
    {
      "text": "Stefania Mariano and Yukika Awazu. 2016. Artifacts in knowledge management research: a systematic literature review and future research directions. Journal of Knowledge Management 20, 6 (01 Jan 2016), 1333–1352. https://doi.org/10.1108/JKM-05-2016-0199",
      "doi": ""
    },
    {
      "text": "Swati Mishra and Jeffrey M Rzeszotarski. 2021. Designing Interactive Transfer Learning Tools for ML Non-Experts. In Proc. CHI’21. Article 364, 15 pages. https://doi.org/10.1145/3411764.3445096",
      "doi": "10.1145/3411764.3445096"
    },
    {
      "text": "Margaret Mitchell, Simone Wu, Andrew Zaldivar, Parker Barnes, Lucy Vasserman, Ben Hutchinson, Elena Spitzer, Inioluwa Deborah Raji, and Timnit Gebru. 2019. Model Cards for Model Reporting. In Proc. FAccT’19. https://doi.org/10.1145/3287560.3287596",
      "doi": "10.1145/3287560.3287596"
    },
    {
      "text": "Brent Mittelstadt, Chris Russell, and Sandra Wachter. 2019. Explaining Explanations in AI. In Proc. FAccT’19. 279–288. https://doi.org/10.1145/3287560.3287574",
      "doi": "10.1145/3287560.3287574"
    },
    {
      "text": "Marçal Mora-Cantallops, Salvador Sánchez-Alonso, Elena García-Barriocanal, and Miguel-Angel Sicilia. 2021. Traceability for Trustworthy AI: A Review of Models and Tools. Big Data and Cognitive Computing 5, 2 (May 2021), 20. https://doi.org/10.3390/bdcc5020020",
      "doi": ""
    },
    {
      "text": "Shweta Narkar, Yunfeng Zhang, Q. Vera Liao, Dakuo Wang, and Justin D. Weisz. 2021. Model LineUpper: Supporting Interactive Model Comparison at Multiple Levels for AutoML. In Proc. IUI’21. 170–174. https://doi.org/10.1145/3397481.3450658",
      "doi": "10.1145/3397481.3450658"
    },
    {
      "text": "Gina Neff, Anissa Tanweer, Brittany Fiore-Gartland, and Laura Osburn. 2017. Critique and contribute: A practice-based framework for improving critical data studies and data science. Big data 5, 2 (2017), 85–97.",
      "doi": ""
    },
    {
      "text": "Habib Asseiss Neto, Ronnie C. O. Alves, and Sergio V. A. Campos. 2020. NASirt: AutoML based learning with instance-level complexity information. arXiv:2008.11846https://arxiv.org/abs/2008.11846",
      "doi": ""
    },
    {
      "text": "Robert Nickerson, Upkar Varshney, and Jan Muntermann. 2013. A Method for Taxonomy Development and its Application in Information Systems. European Journal of Information Systems 22 (05 2013). https://doi.org/10.1057/ejis.2012.26",
      "doi": ""
    },
    {
      "text": "Nikolay O. Nikitin, Pavel Vychuzhanin, Mikhail Sarafanov, Iana S. Polonskaia, Ilia Revin, Irina V. Barabanova, Gleb Maximov, Anna V. Kalyuzhnaya, and Alexander Boukhanovsky. 2021. Automated Evolutionary Approach for the Design of Composite Machine Learning Pipelines. https://arxiv.org/abs/2106.15397",
      "doi": ""
    },
    {
      "text": "Randal S. Olson, Nathan Bartley, Ryan J. Urbanowicz, and Jason H. Moore. 2016. Evaluation of a Tree-Based Pipeline Optimization Tool for Automating Data Science. In Proc GECCO’16. 485–492. https://doi.org/10.1145/2908812.2908918",
      "doi": "10.1145/2908812.2908918"
    },
    {
      "text": "Jorge Piazentin Ono, Sonia Castelo, Roque Lopez, Enrico Bertini, Juliana Freire, and Claudio Silva. 2021. PipelineProfiler: A Visual Analytics Tool for the Exploration of AutoML Pipelines. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 390–400. https://doi.org/10.1109/TVCG.2020.3030361",
      "doi": ""
    },
    {
      "text": "Sinno Jialin Pan and Qiang Yang. 2010. A Survey on Transfer Learning. IEEE Transactions on Knowledge and Data Engineering 22, 10(2010), 1345–1359. https://doi.org/10.1109/TKDE.2009.191",
      "doi": "10.1109/TKDE.2009.191"
    },
    {
      "text": "Raja Parasuraman, Thomas B. Sheridan, and Christopher D. Wickens. 2000. A Model for Types and Levels of Human Interaction with Automation. IEEE Transactions on Systems, Man, and Cybernetics - Part A: Systems and Humans 30, 3 (2000), 286–297. https://doi.org/10.1109/3468.844354",
      "doi": "10.1109/3468.844354"
    },
    {
      "text": "Nicolas Prat, Isabelle Comyn-Wattiau, and Jacky Akoka. 2015. A Taxonomy of Evaluation Methods for Information Systems Artifacts. Journal of Management Information Systems 32, 3 (2015), 229–267. https://doi.org/10.1080/07421222.2015.1099390",
      "doi": ""
    },
    {
      "text": "G. Publio, Diego Esteves, Agnieszka Lawrynowicz, P. Panov, L. Soldatova, Tommaso Soru, J. Vanschoren, and Hamid Zafar. 2018. ML-Schema: Exposing the Semantics of Machine Learning with Schemas and Ontologies. https://openreview.net/forum?id=B1e8MrXVxQ",
      "doi": ""
    },
    {
      "text": "Eric D Ragan, Alex Endert, Jibonananda Sanyal, and Jian Chen. 2015. Characterizing provenance in visualization and data analysis: an organizational framework of provenance types and purposes. IEEE transactions on visualization and computer graphics 22, 1(2015), 31–40.",
      "doi": ""
    },
    {
      "text": "Jen Rogers, Austin H. Patton, Luke Harmon, Alexander Lex, and Miriah Meyer. 2021. Insights From Experiments With Rigor in an EvoBio Design Study. IEEE Transactions on Visualization and Computer Graphics 27, 2(2021), 1106–1116. https://doi.org/10.1109/TVCG.2020.3030405",
      "doi": ""
    },
    {
      "text": "Dominik Sacha, Matthias Kraus, Daniel A. Keim, and Min Chen. 2019. VIS4ML: An Ontology for Visual Analytics Assisted Machine Learning. IEEE Transactions on Visualization and Computer Graphics 25, 1(2019), 385–395. https://doi.org/10.1109/TVCG.2018.2864838",
      "doi": "10.1109/TVCG.2018.2864838"
    },
    {
      "text": "Dominik Sacha, Michael Sedlmair, Leishi Zhang, John A. Lee, Jaakko Peltonen, Daniel Weiskopf, Stephen C. North, and Daniel A. Keim. 2017. What you see is what you can change: Human-centered machine learning by interactive visualization. Neurocomputing 268(2017), 164–175. https://doi.org/10.1016/j.neucom.2017.01.105",
      "doi": "10.1016/j.neucom.2017.01.105"
    },
    {
      "text": "Janet Salmons. 2008. Expect originality! Using taxonomies to structure assignments that support original work. In Student plagiarism in an online world: Problems and solutions. IGI Global, 208–227.",
      "doi": ""
    },
    {
      "text": "Manuel Martin Salvador, Marcin Budka, and Bogdan Gabrys. 2016. Adapting Multicomponent Predictive Systems using Hybrid Adaptation Strategies with Auto-WEKA in Process Industry. In Proceedings of the Workshop on Automatic Machine Learning(Proceedings of Machine Learning Research, Vol. 64), Frank Hutter, Lars Kotthoff, and Joaquin Vanschoren (Eds.). PMLR, New York, New York, USA, 48–57. http://proceedings.mlr.press/v64/salvador_adapting_2016.html",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Shivani Kapania, Hannah Highfill, Diana Akrong, Praveen Paritosh, and Lora M Aroyo. 2021. “Everyone Wants to Do the Model Work, Not the Data Work”: Data Cascades in High-Stakes AI. In Proc. CHI’21. Article 39, 15 pages. https://doi.org/10.1145/3411764.3445518",
      "doi": "10.1145/3411764.3445518"
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. CoDesign 10, 1 (2014), 5–14. https://doi.org/10.1080/15710882.2014.888183",
      "doi": ""
    },
    {
      "text": "Aécio Santos, Sonia Castelo, Cristian Felix, Jorge Piazentin Ono, Bowen Yu, Sungsoo Ray Hong, Cláudio T. Silva, Enrico Bertini, and Juliana Freire. 2019. Visus: An Interactive System for Automatic Machine Learning Model Building and Curation. In Proc. HILDA’19. Article 6, 7 pages. https://doi.org/10.1145/3328519.3329134",
      "doi": "10.1145/3328519.3329134"
    },
    {
      "text": "Sebastian Schelter, Joos-Hendrik Boese, Johannes Kirschnick, Thoralf Klein, and Stephan Seufert. 2017. Automatically tracking metadata and provenance of machine learning experiments. In Machine Learning Systems Workshop at NIPS. 27–29.",
      "doi": ""
    },
    {
      "text": "Vidya Setlur, Melanie Tory, and Alex Djalali. 2019. Inferencing Underspecified Natural Language Utterances in Visual Analysis. In Proc IUI ’19. 40–51. https://doi.org/10.1145/3301275.3302270",
      "doi": "10.1145/3301275.3302270"
    },
    {
      "text": "B. Shneiderman. 1996. The eyes have it: a task by data type taxonomy for information visualizations. In Proc. VLHCC’96. 336–343. https://doi.org/10.1109/VL.1996.545307",
      "doi": ""
    },
    {
      "text": "Renan Souza, Patrick Valduriez, Marta Mattoso, Renato Cerqueira, Marco Netto, Leonardo Azevedo, Vítor Lourenço, Elton F. de S. Soares, Raphael Melo, Rafael Brandão, Daniel Salles Civitarese, Emilio Vital Brazil, and Marcio Ferreira Moreno. 2019. Provenance Data in the Machine Learning Lifecycle in Computational Science and Engineering. In Proc. WORKS’19. 1–10. https://doi.org/10.1109/WORKS49585.2019.00006",
      "doi": ""
    },
    {
      "text": "Fabian Sperrle, Mennatallah El-Assady, Grace Guo, Rita Borgo, Duen Horng Chau, Alex Endert, and Daniel Keim. 2021. A Survey of Human-Centered Evaluations in Human-Centered Machine Learning. Computer Graphics Forum 40, 3 (2021), 543–567. https://doi.org/10.1111/cgf.14329",
      "doi": ""
    },
    {
      "text": "Fabian Sperrle, Astrik Jeitler, Jürgen Bernard, Daniel A. Keim, and Mennatallah El-Assady. 2020. Learning and Teaching in Co-Adaptive Guidance for Mixed-Initiative Visual Analytics. In EuroVis Workshop on Visual Analytics (EuroVA). The Eurographics Association. https://doi.org/10.2312/eurova.20201088",
      "doi": ""
    },
    {
      "text": "Thilo Spinner, Udo Schlegel, Hanna Schäfer, and Mennatallah El-Assady. 2020. explAIner: A Visual Analytics Framework for Interactive and Explainable Machine Learning. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 1064–1074. https://doi.org/10.1109/TVCG.2019.2934629",
      "doi": ""
    },
    {
      "text": "Holger Stitz, Samuel Gratzl, Harald Piringer, Thomas Zichner, and Marc Streit. 2019. KnowledgePearls: Provenance-Based Visualization Retrieval. IEEE Transactions on Visualization and Computer Graphics 25, 1(2019), 120–130. https://doi.org/10.1109/TVCG.2018.2865024",
      "doi": "10.1109/TVCG.2018.2865024"
    },
    {
      "text": "Senthil Karthikeyan Sundaram, Jane Huffman Hayes, Alex Dekhtyar, and E. Ashlee Holbrook. 2010. Assessing traceability of software engineering artifacts. Requirements Engineering 15, 3 (01 Sep 2010), 313–335. https://doi.org/10.1007/s00766-009-0096-6",
      "doi": "10.1007/s00766-009-0096-6"
    },
    {
      "text": "Rachel Taman, Jake VanderPlas, and Sohier Dane. 2018. A Practical Taxonomy of Reproducibility for Machine Learning Research. https://openreview.net/forum?id=B1eYYK5QgX",
      "doi": ""
    },
    {
      "text": "Chris Thornton, Frank Hutter, Holger H. Hoos, and Kevin Leyton-Brown. 2013. Auto-WEKA: Combined Selection and Hyperparameter Optimization of Classification Algorithms. In Proc. KDD’13. 847–855. https://doi.org/10.1145/2487575.2487629",
      "doi": "10.1145/2487575.2487629"
    },
    {
      "text": "Amrit Tiwana and Balasubramaniam Ramesh. 2001. A design knowledge management system to support collaborative information product evolution. Decision Support Systems 31, 2 (2001), 241–262. https://doi.org/10.1016/S0167-9236(00)00134-2",
      "doi": "10.1016/S0167-9236%2800%2900134-2"
    },
    {
      "text": "Eliane R. A. Valiati, Marcelo S. Pimenta, and Carla M. D. S. Freitas. 2006. A Taxonomy of Tasks for Guiding the Evaluation of Multidimensional Visualizations. In Proceedings of the 2006 AVI Workshop on BEyond Time and Errors: Novel Evaluation Methods for Information Visualization (Venice, Italy) (BELIV ’06). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/1168149.1168169",
      "doi": "10.1145/1168149.1168169"
    },
    {
      "text": "Laura von Rueden, Sebastian Mayer, Katharina Beckh, Bogdan Georgiev, Sven Giesselbach, Raoul Heese, Birgit Kirsch, Michal Walczak, Julius Pfrommer, Annika Pick, and et al.2021. Informed Machine Learning - A Taxonomy and Survey of Integrating Prior Knowledge into Learning Systems. IEEE Transactions on Knowledge and Data Engineering (2021), 1–1. https://doi.org/10.1109/tkde.2021.3079836",
      "doi": ""
    },
    {
      "text": "April Yi Wang, Anant Mittal, Christopher Brooks, and Steve Oney. 2019. How Data Scientists Use Computational Notebooks for Real-Time Collaboration. Proc CSCW’19 3 (Nov 2019), 1–30. https://doi.org/10.1145/3359141",
      "doi": "10.1145/3359141"
    },
    {
      "text": "Bochao Wang, Hang Xu, Jiajin Zhang, Chen Chen, Xiaozhi Fang, Yixing Xu, Ning Kang, Lanqing Hong, Chenhan Jiang, Xinyue Cai, Jiawei Li, Fengwei Zhou, Yong Li, Zhicheng Liu, Xinghao Chen, Kai Han, Han Shu, Dehua Song, Yunhe Wang, Wei Zhang, Chunjing Xu, Zhenguo Li, Wenzhi Liu, and Tong Zhang. 2020. VEGA: Towards an End-to-End Configurable AutoML Pipeline. arXiv:2011.01507https://arxiv.org/abs/2011.01507",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Josh Andres, Justin D. Weisz, Erick Oduor, and Casey Dugan. 2021. AutoDS: Towards Human-Centered Automation of Data Science. In Proc. CHI’21. Article 79, 12 pages. https://doi.org/10.1145/3411764.3445526",
      "doi": "10.1145/3411764.3445526"
    },
    {
      "text": "Dakuo Wang, Q. Vera Liao, Yunfeng Zhang, Udayan Khurana, Horst Samulowitz, Soya Park, Michael Muller, and Lisa Amini. 2021. How Much Automation Does a Data Scientist Want?arXiv:2101.03970https://arxiv.org/abs/2101.03970",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Justin D. Weisz, Michael Muller, Parikshit Ram, Werner Geyer, Casey Dugan, Yla Tausczik, Horst Samulowitz, and Alexander Gray. 2019. Human-AI Collaboration in Data Science: Exploring Data Scientists’ Perceptions of Automated AI. Proc. CSCW’19, 24 pages. https://doi.org/10.1145/3359313",
      "doi": "10.1145/3359313"
    },
    {
      "text": "Qianwen Wang, Yao Ming, Zhihua Jin, Qiaomu Shen, Dongyu Liu, Micah J. Smith, Kalyan Veeramachaneni, and Huamin Qu. 2019. ATMSeer: Increasing Transparency and Controllability in Automated Machine Learning. In Proc CHI’19. 1–12. https://doi.org/10.1145/3290605.3300911",
      "doi": "10.1145/3290605.3300911"
    },
    {
      "text": "Daniel Karl I. Weidele, Justin D. Weisz, Erick Oduor, Michael Muller, Josh Andres, Alexander Gray, and Dakuo Wang. 2020. AutoAIViz: Opening the Blackbox of Automated Artificial Intelligence with Conditional Parallel Coordinates. In Proc. IUI’20. 308–312. https://doi.org/10.1145/3377325.3377538",
      "doi": "10.1145/3377325.3377538"
    },
    {
      "text": "Alan F. T. Winfield and Marina Jirotka. 2018. Ethical governance is essential to building trust in robotics and artificial intelligence systems. Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences 376, 2133 (2018), 20180085. https://doi.org/10.1098/rsta.2018.0085",
      "doi": ""
    },
    {
      "text": "Catherine Wong, Neil Houlsby, Yifeng Lu, and Andrea Gesmundo. 2018. Transfer Learning with Neural AutoML. In Proc NeurIPS’18. Curran Associates Inc., Red Hook, NY, USA, 8366–8375.",
      "doi": ""
    },
    {
      "text": "K. Wongsuphasawat, D. Moritz, A. Anand, J. Mackinlay, D. Howe, and J. Heer. 2016. Voyager: Exploratory Analysis via Faceted Browsing of Visualization Recommendations. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan 2016), 649–658. https://doi.org/10.1109/TVCG.2015.2467191",
      "doi": "10.1109/TVCG.2015.2467191"
    },
    {
      "text": "Doris Xin, Litian Ma, Jialin Liu, Stephen Macke, Shuchen Song, and Aditya Parameswaran. 2018. Accelerating Human-in-the-Loop Machine Learning: Challenges and Opportunities. In Proc. DEEM’18. https://doi.org/10.1145/3209889.3209897",
      "doi": "10.1145/3209889.3209897"
    },
    {
      "text": "Doris Xin, Eva Yiwei Wu, Doris Jung-Lin Lee, Niloufar Salehi, and Aditya Parameswaran. 2021. Whither AutoML? Understanding the Role of Automation in Machine Learning Workflows. https://doi.org/10.1145/3411764.3445306",
      "doi": "10.1145/3411764.3445306"
    },
    {
      "text": "Chengrun Yang, Yuji Akimoto, Dae Won Kim, and Madeleine Udell. 2019. OBOE: Collaborative Filtering for AutoML Model Selection. In Proc KDD ’19 (Anchorage, AK, USA). 1173–1183. https://doi.org/10.1145/3292500.3330909",
      "doi": "10.1145/3292500.3330909"
    },
    {
      "text": "Chengrun Yang, Jicong Fan, Ziyang Wu, and Madeleine Udell. 2020. AutoML Pipeline Selection: Efficiently Navigating the Combinatorial Space. In Proc KDD ’20. 1446–1456. https://doi.org/10.1145/3394486.3403197",
      "doi": "10.1145/3394486.3403197"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-Examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. 1–13. https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Quanming Yao, Mengshuo Wang, Yuqiang Chen, Wenyuan Dai, Yu-Feng Li, Wei-Wei Tu, Qiang Yang, and Yang Yu. 2019. Taking Human out of Learning Applications: A Survey on Automated Machine Learning. arXiv:1810.13306https://arxiv.org/abs/1810.13306",
      "doi": ""
    },
    {
      "text": "Amy X. Zhang, Michael Muller, and Dakuo Wang. 2020. How Do Data Science Workers Collaborate? Roles, Workflows, and Tools. Proc CSCW’2020, Article 022 (May 2020), 23 pages. https://doi.org/10.1145/3392826",
      "doi": "10.1145/3392826"
    },
    {
      "text": "Baobao Zhang, Markus Anderljung, Lauren Kahn, Noemi Dreksler, Michael C. Horowitz, and Allan Dafoe. 2021. Ethics and Governance of Artificial Intelligence: Evidence from a Survey of Machine Learning Researchers. arxiv:2105.02117 [cs.CY]",
      "doi": ""
    },
    {
      "text": "Yao Zhang, William Zame, and Mihaela van der Schaar. 2020. AutoCP: Automated Pipelines for Accurate Prediction Intervals. arXiv:2006.14099https://arxiv.org/abs/2006.14099",
      "doi": ""
    },
    {
      "text": "Fuzhen Zhuang, Zhiyuan Qi, Keyu Duan, Dongbo Xi, Yongchun Zhu, Hengshu Zhu, Hui Xiong, and Qing He. 2021. A Comprehensive Survey on Transfer Learning. Proc. IEEE 109, 1 (2021), 43–76. https://doi.org/10.1109/JPROC.2020.3004555",
      "doi": ""
    },
    {
      "text": "Lucas Zimmer, Marius Lindauer, and Frank Hutter. 2021. Auto-Pytorch: Multi-Fidelity MetaLearning for Efficient and Robust AutoDL. IEEE Transactions on Pattern Analysis & Machine Intelligence01 (2021), 1–1. https://doi.org/10.1109/TPAMI.2021.3067763",
      "doi": ""
    },
    {
      "text": "Marc-André Zöller and M. Huber. 2021. Benchmark and Survey of Automated Machine Learning Frameworks. J. Artif. Intell. Res. 70 (2021), 409–472.",
      "doi": "10.1613/jair.1.11854"
    },
    {
      "text": "Barret Zoph and Quoc V. Le. 2017. Neural Architecture Search with Reinforcement Learning. https://arxiv.org/abs/1611.01578",
      "doi": ""
    }
  ]
}