{
  "doi": "10.1145/3544548.3581523",
  "title": "LYDSPOR: AN URBAN SOUND EXPERIENCE WEAVING TOGETHER PAST AND PRESENT THROUGH VIBRATING BODIES",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "In this paper we present LYDSPOR; a site-specific sound experience, created in Elsinore, Denmark, consisting of two physical installations and an app-based soundwalk, which together allow people to feel and sense in their bodies certain narrative fragments of the history of the city. LYDSPOR is the result of a 1,5 year-long research project which had the aim of adopting soma design methods by drawing on affective interaction design and on an understanding of bodies as always multiple, relational, and never only human. Through an analysis of the design process and its outcome, the paper contributes an in-depth understanding of how to combine somatic and affective design approaches when creating site-specific sonic augmentations for historical dissemination in public space.",
  "tags": [
    "public space",
    "cultural heritage",
    "Soma design",
    "Sonic Interaction Design",
    "Affective Interaction Design",
    "urban",
    "design methods",
    "site-specific"
  ],
  "authors": [
    {
      "name": "Karin Ryding",
      "institution": "Digital Design, IT University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473738",
      "orcid": "0000-0001-7294-3129"
    },
    {
      "name": "Vasiliki Tsaknaki",
      "institution": "Digital Design, IT University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-87358710757/rel-imgonly/vasiliki.jpeg",
      "acmid": "87358710757",
      "orcid": "0000-0003-2235-6078"
    },
    {
      "name": "Stina Marie Hasse Jørgensen",
      "institution": "Digital Design, IT University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782673",
      "orcid": "0000-0001-6275-8966"
    },
    {
      "name": "Jonas Fritsch",
      "institution": "Digital Design, IT University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435606777",
      "orcid": "0000-0001-9065-2843"
    }
  ],
  "references": [
    {
      "text": "Academia de Artes de Estonia, Escuela de Doctorado en Arte y Diseño, Arife Dila Demir, Nithikul Nimkulrat, Ontario College of Art & Design University, Facultad de Diseño, Kristi Kuusk, and Academia de Artes de Estonia, Grupo de Investigación en Diseño. 2022. “Squeaky/Pain”: Cultivando experiencias perturbadoras y la transición de perspectivas para las interacciones somaestéticas. Revista Diseña, 20. https://doi.org/10.7764/disena.20.Article.2",
      "doi": ""
    },
    {
      "text": "Sara Ahmed. 2006. Queer phenomenology: orientations, objects, others. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Alessandro Altavilla. Designing From Listening: Embodied Experience and Sonic Interactions. Goldsmiths, University of London.",
      "doi": ""
    },
    {
      "text": "Anagram. 2015. Nightwatchers. Retrieved November 19, 2020 from http://weareanagram.co.uk/project/nightwatchers",
      "doi": ""
    },
    {
      "text": "Karen Anne Cochrane, Kristina Mah, Anna Ståhl, Claudia Núñez-Pacheco, Madeline Balaam, Naseem Ahmadpour, and Lian Loke. 2022. Body Maps: A Generative Tool for Soma-based Design. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction, 1–14. https://doi.org/10.1145/3490149.3502262",
      "doi": "10.1145/3490149.3502262"
    },
    {
      "text": "Karen Michelle Barad. 2007. Meeting the universe halfway: quantum physics and the entanglement of matter and meaning. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Stephen Barrass. 2008. Creative practice-based research in interaction design. 17. https://doi.org/10.1145/1394021.1394026",
      "doi": "10.1145/1394021.1394026"
    },
    {
      "text": "Ditte Amund Basballe, Morten Breinbjerg, and Jonas Fritsch. 2012. Ekkomaten – An Auditory Interface to the 18th Century City of Aarhus. NordiCHI ’12: Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design: 742–745. https://doi.org/10.1145/2399016.2399130",
      "doi": "10.1145/2399016.2399130"
    },
    {
      "text": "Steve Benford, Anders Sundnes Løvlie, Karin Ryding, Paulina Rajkowska, Edgar Bodiaj, Dimitrios Darzentas, Harriet Cameron, Jocelyn Spence, Joy Egede, and Bogdan Spanjevic. forthcoming. Sensitive Pictures: Emotional Interpretation in the Museum. In Proccedings of The ACM CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Ilias Bergström and Martin Jonsson. 2016. Sarka: Sonification and Somaesthetic Appreciation Design. In Proceedings of the 3rd International Symposium on Movement and Computing, 1–8. https://doi.org/10.1145/2948910.2948922",
      "doi": "10.1145/2948910.2948922"
    },
    {
      "text": "Heidi R. Biggs, Jeffrey Bardzell, and Shaowen Bardzell. 2021. Watching myself watching birds: Abjection, ecological thinking, and posthuman design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–16. https://doi.org/10.1145/3411764.3445329",
      "doi": "10.1145/3411764.3445329"
    },
    {
      "text": "Kirsten Boehner, Phoebe Sengers, and Geri Gay. 2006. Affective presence in museums: Ambient systems for creative expression. Digital Creativity 16, 2: 79–89.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. One size fits all? What counts as quality practice in (reflexive) thematic analysis? Qualitative Research in Psychology 18, 3: 328–352. https://doi.org/10.1080/14780887.2020.1769238",
      "doi": ""
    },
    {
      "text": "Eoin Brazil. 2010. A Review of Methods and Frameworks for Sonic Interaction Design: Exploring Existing Approaches. In Auditory Display: 6th International Symposium, May 18-22, 2009.",
      "doi": "10.1007/978-3-642-12439-6_3"
    },
    {
      "text": "Emeline Brulé. 2020. Thematic analysis in HCI. Design and Society.",
      "doi": ""
    },
    {
      "text": "Baptiste Caramiaux, Jules Françoise, Norbert Schnell, and Frédéric Bevilacqua. 2014. Mapping Through Listening. Computer Music Journal 38, 3: 34–48. https://doi.org/10.1162/COMJ_a_00255",
      "doi": "10.1162/COMJ_a_00255"
    },
    {
      "text": "Luigina Ciolfi, Gabriela Avram, Laura Maye, Nick Dulake, Mark T. Marshall, Dick van Dijk, and Fiona McDermott. 2016. Articulating Co-Design in Museums: Reflections on Two Participatory Processes. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 13–25.",
      "doi": "10.1145/2818048.2819967"
    },
    {
      "text": "Circumstance. 2014. A Hollow Body. Retrieved November 19, 2020 from http://www.ahollowbody.com/",
      "doi": ""
    },
    {
      "text": "Rachel Clarke, Sara Heitlinger, Ann Light, Laura Forlano, Marcus Foth, and Carl DiSalvo. 2019. More-than-human participation: design for sustainable smart city futures. Interactions 26, 3: 60–63. https://doi.org/10.1145/3319075",
      "doi": "10.1145/3319075"
    },
    {
      "text": "Patricia Ticineto Clough and Jean Halley (eds.). 2007. The Affective Turn: Theorizing the Social. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Dan Cosley, Jonathan Baxter, Soyoung Lee, Brian Alson, Saeko Nomura, Phil Adams, Chethan Sarabu, and Geri Gay. 2009. A Tag in the Hand: Supporting Semantic, Social, and Spatial Navigation in Museums. In SIGCHI Conference on Human Factors in Computing Systems, 1953–1962.",
      "doi": "10.1145/1518701.1518999"
    },
    {
      "text": "Dan Cosley, Joel Lewenstein, Andrew Herman, Jenna Holloway, Jonathan Baxter, Saeko Nomura, Kirsten Boehner, and Geri Gay. 2008. ArtLinks: Fostering Social Awareness and Reflection in Museums. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’08), 403–412. https://doi.org/10.1145/1357054.1357121",
      "doi": "10.1145/1357054.1357121"
    },
    {
      "text": "Don Ihde. 2007. Listening and Voice: Phenomenologies of Sound. State University of New York Press, Albany.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the Action Is: The Foundations of Embodied Interaction. The MIT Press, Cambridge, MA.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Paul Dourish. 2006. Re-Space-ing Place: “Place” and “Space” Ten Years On. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, 10.",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Gershon Dublon and Edwina Portocarrero. ListenTree: Audio Haptic Display in the Natural Environment. In Proceedings of the conference of the International Community for Auditory Display (ICAD ’14).",
      "doi": ""
    },
    {
      "text": "Eleni Economidou, Bart Hengeveld, Moritz Kubesch, Alina Krischkowsky, Martin Murer, and Manfred Tscheligi. 2021. Audio-Frequency Induction Loops (AFILs) as a Design Materialfor Architectural Interactivity: An Illustrated Guide. In Designing Interactive Systems Conference 2021, 1201–1214. https://doi.org/10.1145/3461778.3462070",
      "doi": "10.1145/3461778.3462070"
    },
    {
      "text": "John H. Falk. 2009. Identity and the museum visitor experience. Left Coast Press.",
      "doi": ""
    },
    {
      "text": "Laura Forlano. 2017. Posthumanism and Design. She Ji: The Journal of Design, Economics, and Innovation 3, 1: 16–29. https://doi.org/10.1016/j.sheji.2017.08.001",
      "doi": ""
    },
    {
      "text": "Lesley Fosh, Steve Benford, Stuart Reeves, Boriana Koleva, and Patrick Brundell. 2013. ‘See Me, Feel Me, Touch Me, Hear Me’: Trajectories and Interpretation in a Sculpture Garden. In CHI 2013: Changing Perspectives, 149–158.",
      "doi": ""
    },
    {
      "text": "Jules Françoise, Yves Candau, Sarah Fdili Alaoui, and Thecla Schiphorst. 2017. Designing for Kinesthetic Awareness: Revealing User Experiences through Second-Person Inquiry. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 5171–5183. https://doi.org/10.1145/3025453.3025714",
      "doi": "10.1145/3025453.3025714"
    },
    {
      "text": "Jules Françoise, Sarah Fdili Alaoui, Thecla Schiphorst, and Frederic Bevilacqua. 2014. Vocalizing dance movement for interactive sonification of laban effort factors. In Proceedings of the 2014 conference on Designing interactive systems, 1079–1082. https://doi.org/10.1145/2598510.2598582",
      "doi": "10.1145/2598510.2598582"
    },
    {
      "text": "Karmen Franinović and Yon Visell. 2004. Recycled soundscapes. In Proceedings of the Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques. https://doi.org/10.1145/1013115.1013167",
      "doi": "10.1145/1013115.1013167"
    },
    {
      "text": "Christopher Frauenberger. 2020. Entanglement HCI The Next Wave? ACM Transactions on Computer-Human Interaction 27, 1: 1–27. https://doi.org/10.1145/3364998",
      "doi": "10.1145/3364998"
    },
    {
      "text": "Euan Freeman, Graham Wilson, Dong-Bach Vo, Alex Ng, Ioannis Politis, and Stephen Brewster. 2017. Multimodal feedback in HCI: haptics, non-speech audio, and their applications. In The Handbook of Multimodal-Multisensor Interfaces: Foundations, User Modeling, and Common Modality Combinations - Volume 1, Sharon Oviatt, Björn Schuller, Philip R. Cohen, Daniel Sonntag, Gerasimos Potamianos and Antonio Krüger (eds.). ACM, 277–317. https://doi.org/10.1145/3015783.3015792",
      "doi": "10.1145/3015783.3015792"
    },
    {
      "text": "Jonas Fritsch. 2009. Understanding Affective Engagement as a Resource in Interaction Design. In Proceedings of “Engaging Artifacts”, Nordic Design Research (NORDES) Conference.",
      "doi": ""
    },
    {
      "text": "Jonas Fritsch. 2018. Affective Interaction Design at the End of the World. In DRS 2018: Catalyst, 896–908.",
      "doi": ""
    },
    {
      "text": "Jonas Fritsch. 2021. Problematizing Affective Interaction Design. In Affects, Interfaces, Events, Bodil Marie Stavning Thomsen (ed.). Imbricate! Press, 17–38. https://doi.org/10.22387/IMBAIE.01",
      "doi": ""
    },
    {
      "text": "William Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a Resource for Design. 233–240. Retrieved July 31, 2017 from https://dl.acm.org/doi/10.1145/642611.642653",
      "doi": ""
    },
    {
      "text": "W. S. Gershon. 2013. Vibrational Affect: Sound Theory and Practice in Qualitative Research. Cultural Studies ↔ Critical Methodologies 13, 4: 257–262.",
      "doi": ""
    },
    {
      "text": "Gilles Deleuze. 1970. Spinoza: Practical Philosophy. City Lights Books, San Francisco, US.",
      "doi": ""
    },
    {
      "text": "Christina Goulding. 2000. The museum environment and the visitor experience. European Journal of marketing.",
      "doi": ""
    },
    {
      "text": "Melissa Gregg and Gregory J. Seigworth (eds.). 2010. The Affect Theory Reader. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Melissa Gregg and Gregory J. Seigworth (eds.). 2010. The affect theory reader. Duke University Press, Durham, NC.",
      "doi": ""
    },
    {
      "text": "Hans Ulrich Gumbrecht. 2003. Production of Presence: What Meaning Cannot Convey. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Donna Jeanne Haraway. 2003. The companion species manifesto: dogs, people, and significant otherness. Prickly Paradigm Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Adrian Hazzard, Steve Benford, and Gary Burnett. 2015. Sculpting a mobile music soundtrack. In SIGCHI Conference on Human Factors in Computing Systems, 387–396.",
      "doi": ""
    },
    {
      "text": "Karey Helms. 2022. A Speculative Ethics for Designing with Bodily Fluids. In CHI Conference on Human Factors in Computing Systems Extended Abstracts, 1–11. https://doi.org/10.1145/3491101.3516395",
      "doi": "10.1145/3491101.3516395"
    },
    {
      "text": "Sarah Homewood, Marika Hedemyr, Maja Fagerberg Ranten, and Susan Kozel. 2021. Tracing Conceptions of the Body in HCI: From User to More-Than-Human. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–12. https://doi.org/10.1145/3411764.3445656",
      "doi": "10.1145/3411764.3445656"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Steve Benford, Paul Tennent, Vasiliki Tsaknaki, Miquel Alfaras, Juan Martinez Avila, Christine Li, Joseph Marshall, Claudia Daudén Roquet, Pedro Sanches, Anna Ståhl, Muhammad Umair, Charles Windlin, and Feng Zhou. 2021. Unpacking Non-Dualistic Design: The Soma Design Case. ACM Transactions on Computer-Human Interaction 28, 6: 40:1-40:36. https://doi.org/10.1145/3462448",
      "doi": "10.1145/3462448"
    },
    {
      "text": "Eilean Hooper-Greenhill. 2006. Studying visitors. In A Companion to Museum Studies, Sharon MacDonald (ed.). Blackwell, Oxford, 362–376.",
      "doi": ""
    },
    {
      "text": "David Howes. 2014. Introduction to sensory museology. Senses and Society 9, 3: 259–267. https://doi.org/10.2752/174589314X14023847039917",
      "doi": ""
    },
    {
      "text": "Stine S. Johansen, Niels van Berkel, and Jonas Fritsch. 2022. Characterising Soundscape Research in Human-Computer Interaction. In Designing Interactive Systems Conference, 1394–1417. https://doi.org/10.1145/3532106.3533458",
      "doi": "10.1145/3532106.3533458"
    },
    {
      "text": "Karmen Franinović and Stefania Serafin. 2013. Sonic Interaction Design. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Jenny Kidd. 2018. “Immersive” heritage encounters. The Museum Review 3, 1.",
      "doi": ""
    },
    {
      "text": "Brandon LaBelle. 2010. Acoustic territories: sound culture and everyday life. Continuum, New York.",
      "doi": ""
    },
    {
      "text": "Jordan Lacey. 2016. Sonic Placemaking: Three approaches and ten attributes for the creation of enduring urban sound art installations. Organised Sound 21, 2: 147–159. https://doi.org/10.1017/S1355771816000078",
      "doi": ""
    },
    {
      "text": "Maya Livio and Laura Devendorf. 2022. The Eco-Technical Interface: Attuning to the Instrumental. In CHI Conference on Human Factors in Computing Systems, 1–12. https://doi.org/10.1145/3491102.3501851",
      "doi": "10.1145/3491102.3501851"
    },
    {
      "text": "Brian Massumi. 2002. Parables for the virtual: movement, affect, sensation. Duke University Press, Durham, NC.",
      "doi": ""
    },
    {
      "text": "Miikka Tikkander and Tapio Lokki. 2004. Augmented Reality Audio for Mobile and Wearable Appliances. In J. Audio Eng. Soc.",
      "doi": ""
    },
    {
      "text": "Ann Morrison, Cristina Manresa-Yee, Walther Jensen, and Neda Eshraghi. 2016. The Humming Wall: Vibrotactile and Vibroacoustic Interactions in an Urban Environment. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 818–822. https://doi.org/10.1145/2901790.2901878",
      "doi": "10.1145/2901790.2901878"
    },
    {
      "text": "D. Mulcahy. 2016. “Sticky” learning: Assembling bodies, objects and affects at the museum and beyond. In Learning Bodies: The Body in Youth and Childhood Studies, Julia Coffey, Shelley Budgeon and Helen Cahill (eds.). Springer, Singapore, 207–222.",
      "doi": ""
    },
    {
      "text": "Pauline Oliveros. 2005. Deep Listening: A Composer's Sound Practice. Universe, New York. Retrieved from https://monoskop.org/images/2/2c/Oliveros_Pauline_Deep_Listening_A_Composers_Sound_Practice_2005.pdf",
      "doi": ""
    },
    {
      "text": "Pauline Oliveros. 2022. Quantum listening. Ignota Books, London.",
      "doi": ""
    },
    {
      "text": "Doenja Oogjes and Ronald Wakkary. 2022. Weaving Stories: Toward Repertoires for Designing Things. In n Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Kristina Popova, Rachael Garrett, Claudia Núñez-Pacheco, Airi Lampinen, and Kristina Höök. 2022. Vulnerability as an ethical stance in soma design processes. In CHI Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3491102.3501994",
      "doi": "10.1145/3491102.3501994"
    },
    {
      "text": "Loes van Renswouw, Jelle Neerhof, Steven Vos, Pieter van Wesemael, and Carine Lallemand. 2021. Sensation: Sonifying the Urban Running Experience. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, 1–5. https://doi.org/10.1145/3411763.3451788",
      "doi": "10.1145/3411763.3451788"
    },
    {
      "text": "Davide Rocchesso. 2011. Explorations in sonic interaction design. Logos, Berlin.",
      "doi": ""
    },
    {
      "text": "Daniela Rosner. 2018. Critical fabulations: reworking the methods and margins of design. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "RTD Conference, Charles Windlin, Anna Ståhl, Pedro Sanches, Vasiliki Tsaknaki, Pavel Karpashevich, Madeline Balaam, and Kristina Höök. 2019. Soma Bits: Mediating technology to orchestrate bodily experiences. 1387501 Bytes. https://doi.org/10.6084/M9.FIGSHARE.7855799.V2",
      "doi": ""
    },
    {
      "text": "Karin Ryding. 2020. The Silent Conversation: Designing for Introspection and Social Play in Art Museums. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–10. https://doi.org/10.1145/3313831.3376357",
      "doi": "10.1145/3313831.3376357"
    },
    {
      "text": "arin Ryding and Jonas Fritsch. 2020. Play Design as a Relational Strategy to Intensify Affective Encounters in the Art Museum. In Proceedings of the 2020 ACM on Designing Interactive Systems Conference (DIS ’20), 681–693. https://doi.org/10.1145/3357236.3395431",
      "doi": "10.1145/3357236.3395431"
    },
    {
      "text": "Karin Ryding, Stina Hasse Jørgensen, and Vasiliki Tsaknaki. 2021. Sensing Places: Making Room for More- Than-Human Encounters in the City. In Proceedings of POM Berlin 2021, 1–6.",
      "doi": ""
    },
    {
      "text": "Kristine Samson and Jonas Fritsch. In Press. Affective Methodologies and more-than-human encounters: livability and life quality beyond the smart city. In Beyond Smart Cities Today: Power, Justice and Resistance, Malmö, 2022.",
      "doi": ""
    },
    {
      "text": "Holger Schulze. 2018. The sonic persona: an anthropology of sound. Bloomsbury Academic, an imprint of Bloomsbury Publishing Inc, New York.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2008. Body consciousness: A philosophy of mindfulness and somaesthetics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Laurajane Smith, Margret Wetherell, and Gary Campbell (eds.). 2018. Emotion, Affective Practices, and the Past in the Present. Routledge.",
      "doi": ""
    },
    {
      "text": "Nancy Smith, Shaowen Bardzell, and Jeffrey Bardzell. 2017. Designing for Cohabitation: Naturecultures, Hybrids, and Decentering the Human in Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 1714–1725. https://doi.org/10.1145/3025453.3025948",
      "doi": "10.1145/3025453.3025948"
    },
    {
      "text": "Marie Louise Juul Søndergaard, Ozgun Kilic Afsar, Marianela Ciolfi Felice, Nadia Campo Woytuk, and Madeline Balaam. 2020. Designing with Intimate Materials and Movements: Making “Menarche Bits.” In Proceedings of the 2020 ACM Designing Interactive Systems Conference, 587–600. https://doi.org/10.1145/3357236.3395592",
      "doi": "10.1145/3357236.3395592"
    },
    {
      "text": "Jocelyn Spence, Benjamin Bedwell, Michelle Coleman, Steve Benford, Boriana N. Koleva, Matt Adams, Ju Row Farr, Nick Tandavanitj, and Anders Sundnes Løvlie. 2019. Seeing with New Eyes: Designing for In-the-Wild Museum Gifting. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems (CHI 2019). https://doi.org/10.1145/3290605.3300235",
      "doi": "10.1145/3290605.3300235"
    },
    {
      "text": "Baruch de Spinoza. 1678. Ethics. Citadel Press, New York.",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Madeline Balaam, Rob Comber, Pedro Sanches, and Kristina Höök. 2022. Making New Worlds – Transformative Becomings with Soma Design. In CHI Conference on Human Factors in Computing Systems, 1–17. https://doi.org/10.1145/3491102.3502018",
      "doi": "10.1145/3491102.3502018"
    },
    {
      "text": "Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, Kristina Höök, and Eva-Carin Banka Johnson. 2016. The Soma Mat and Breathing Light. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, 305–308. https://doi.org/10.1145/2851581.2889464",
      "doi": "10.1145/2851581.2889464"
    },
    {
      "text": "Loïc Tallon and Kevin Walker (eds.). 2008. Digital Technologies and the Museum Experience: Handheld Guides and Other Media. AltaMira Press.",
      "doi": ""
    },
    {
      "text": "Robyn Taylor, John Bowers, Bettina Nissen, Gavin Wood, Qasim Chaudry, Peter Wright, Lindsey Bruce, Sarah Glynn, Helen Mallinson, and Roy Bearpark. 2015. Making Magic: Designing for Open Interactions in Museum Settings. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, 313–322.",
      "doi": "10.1145/2757226.2757241"
    },
    {
      "text": "Paul Tennent, Kristina Höök, Steve Benford, Vasiliki Tsaknaki, Anna Ståhl, Claudia Dauden Roquet, Charles Windlin, Pedro Sanches, Joe Marshall, Christine Li, Juan Pablo Martinez Avila, Miquel Alfaras, Muhammad Umair, and Feng Zhou. 2021. Articulating Soma Experiences using Trajectories. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–16. https://doi.org/10.1145/3411764.3445482",
      "doi": "10.1145/3411764.3445482"
    },
    {
      "text": "Vasiliki Tsaknaki. 2021. The Breathing Wings: An Autobiographical Soma Design Exploration of Touch Qualities through Shape-Change Materials. In Designing Interactive Systems Conference 2021, 1266–1279. https://doi.org/10.1145/3461778.3462054",
      "doi": "10.1145/3461778.3462054"
    },
    {
      "text": "Vasiliki Tsaknaki, Madeline Balaam, Anna Ståhl, Pedro Sanches, Charles Windlin, Pavel Karpashevich, and Kristina Höök. 2019. Teaching Soma Design. In Proceedings of the 2019 on Designing Interactive Systems Conference, 1237–1249. https://doi.org/10.1145/3322276.3322327",
      "doi": "10.1145/3322276.3322327"
    },
    {
      "text": "Vasiliki Tsaknaki, Kelsey Cotton, Pavel Karpashevich, and Pedro Sanches. 2021. “Feeling the Sensor Feeling you”: A Soma Design Exploration on Sensing Non-habitual Breathing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1–16. https://doi.org/10.1145/3411764.3445628",
      "doi": "10.1145/3411764.3445628"
    },
    {
      "text": "Anne-Sofie Udsen and Kim Halskov. 2022. Soundscape design for historical buildings as a sonic place-making process. https://doi.org/10.21606/drs.2022.178",
      "doi": ""
    },
    {
      "text": "Salomé Voegelin. 2021. Listening to noise and silence: towards a philosophy of sound art. Zed Books, London, England.",
      "doi": ""
    },
    {
      "text": "Ronald Wakkary. 2021. Things We Could Design: For More Than Human-centered Worlds. MIT Press.",
      "doi": ""
    },
    {
      "text": "Andrea Witcomb. 2013. Understanding the role of affect in producing a critical pedagogy for history museums. Museum Management and Curatorship 28, 3: 255–271. https://doi.org/10.1080/09647775.2013.807998",
      "doi": ""
    },
    {
      "text": "Andrea Witcomb. 2014. “Look, Listen and Feel”: The first peoples exhibition at the Bunjilaka Gallery, Melbourne Museum. Thema La revue des Musées de la civilistion 1: 49–62.",
      "doi": ""
    },
    {
      "text": "Krzysztof Wodiczko, Anke von der Heide, Patrick Fischer Tobias, Timm Burkhardt, Roy Müller, Lea Brugnoli, Hala Ghatasheh, Sebastian Schuster, Christian Paffrath, Muzaffar Ali, Mark Eisenberg, Michael Ohaya, Christian Rene Manzano Schlamp, David Leroy, Eva Hornecker, Wolfgang Sattler, and Liz Bachhuber. 2017. Die ermittler: a dialogue about displacement, refuge, and home. In 16th International Conference on Mobile and Ubiquitous Multimedia, 527–533. https://doi.org/10.1145/3152832.3156608",
      "doi": "10.1145/3152832.3156608"
    },
    {
      "text": "Nikoleta Yiannoutsou, Ioanna Papadimitriou, Vassilis Komis, and Nikolaos Avouris. 2009. Playing with museum exhibits: designing educational games mediated by mobile technology. 230–233. https://doi.org/10.1145/1551788.1551837",
      "doi": "10.1145/1551788.1551837"
    },
    {
      "text": "1971. Sonic Meditations. Smith Publications. Retrieved September 15, 2022 from https://monoskop.org/images/0/09/Oliveros_Pauline_Sonic_Meditations_1974.pdf",
      "doi": ""
    }
  ]
}