{
  "doi": "10.1145/3544548.3581144",
  "title": "Using Virtual Reality and Co-Design to Study the Design of Large-scale Shape-Changing Interfaces",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Large-scale shape-changing interfaces (SCIs) such as shape-changing walls offer opportunities for enhancing user experiences within buildings, e.g., for navigation. However, due to the embryonic nature of SCI technologies, designing and explaining the shape features that are beneficial to users is challenging. Previous work used virtual platforms (2D video or Projected Augmented Reality) to design SCI. This paper explores how Virtual Reality (VR) can provide an immersive experience that can help in designing large-scale SCI. We follow a co-design approach in which we use VR to obtain users’ impressions of shape-changing walls. Then, we conduct co-design sessions to understand how shape-changing walls can be designed to become ambient and blend with the environment. We report our results to guide the design of shape-changing walls as well as discuss how our approach can provide valuable insights into how a VR experience, prior to design, and can help in the design process.",
  "tags": [
    "Virtual Reality",
    "Shape-Changing Walls",
    "Large-Scale Interfaces",
    "Co-design"
  ],
  "authors": [
    {
      "name": "Luluah Albarrak",
      "institution": "Department of Computer Science, University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366140",
      "orcid": "0000-0002-5669-7623"
    },
    {
      "name": "Oussama Metatla",
      "institution": "Department of Computer Science, University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418592476",
      "orcid": "0000-0002-3882-3243"
    },
    {
      "name": "Anne Roudaut",
      "institution": "Department of Computer Science, University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81414614562/rel-imgonly/81414614562.png",
      "acmid": "81414614562",
      "orcid": "0000-0003-3082-4564"
    }
  ],
  "references": [
    {
      "text": "Jason Alexander, Anne Roudaut, Jürgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand Challenges in Shape-Changing Interface Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173873",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Mohammed Ibrahim Alhojailan. 2012. Thematic analysis: A critical review of its process and evaluation. West East Journal of Social Sciences 1, 1 (2012), 39–47.",
      "doi": ""
    },
    {
      "text": "Morgan G Ames and Anind K Dey. 2002. Description of design dimensions and evaluation for Ambient Displays. Computer Science Division, University of California, California.",
      "doi": ""
    },
    {
      "text": "Steven Baker, Jenny Waycott, Romina Carrasco, Thuong Hoang, and Frank Vetere. 2019. Exploring the Design of Social VR Experiences with Older Adults. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 303–315. https://doi.org/10.1145/3322276.3322361",
      "doi": "10.1145/3322276.3322361"
    },
    {
      "text": "Moshe Bar and Maital Neta. 2006. Humans Prefer Curved Visual Objects. Psychological Science 17, 8 (2006), 645–648. https://doi.org/10.1111/j.1467-9280.2006.01759.x PMID: 16913943.",
      "doi": ""
    },
    {
      "text": "Bar, Moshe and Neta, Maital. 2007. Visual elements of subjective preference modulate amygdala activation. Neuropsychologia 45, 10 (2007), 2191–2200. https://doi.org/10.1016/j.neuropsychologia.2007.03.008",
      "doi": ""
    },
    {
      "text": "Leif P Berg and Judy M Vance. 2017. Industry use of virtual reality in product design and manufacturing: a survey. Virtual Reality 21, 1 (2017), 1–17. https://doi.org/10.1007/s10055-016-0293-9",
      "doi": "10.1007/s10055-016-0293-9"
    },
    {
      "text": "D E Berlyne. 1960. Conflict, arousal, and curiosity.McGraw-Hill Book Company, New York, NY, US. xii, 350–xii, 350 pages. https://doi.org/10.1037/11164-000",
      "doi": ""
    },
    {
      "text": "Frank Biocca, Jin Kim, and Yung Choi. 2001. Visual Touch in Virtual Environments: An Exploratory Study of Presence, Multimodal Interfaces, and Cross-Modal Sensory Illusions. Presence: Teleoperators and Virtual Environments 10, 3 (jun 2001), 247–265. https://doi.org/10.1162/105474601300343595",
      "doi": "10.1162/105474601300343595"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (jan 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Cesar Flores Cano and Anne Roudaut. 2019. MorphBenches: Using mixed reality experimentation platforms to study dynamic affordances in shape-changing devices. International Journal of Human-Computer Studies 132 (2019), 1–11. https://doi.org/10.1016/j.ijhcs.2019.07.006",
      "doi": "10.1016/j.ijhcs.2019.07.006"
    },
    {
      "text": "Seijin Cha, Moon-Hwan Lee, and Tek-Jin Nam. 2016. Gleamy: An Ambient Display Lamp with a Transparency-Controllable Shade. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (Eindhoven, Netherlands) (TEI ’16). Association for Computing Machinery, New York, NY, USA, 304–307. https://doi.org/10.1145/2839462.2839501",
      "doi": "10.1145/2839462.2839501"
    },
    {
      "text": "Marcelo Coelho and Pattie Maes. 2009. Shutters: A Permeable Surface for Environmental Control and Communication. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction(Cambridge, United Kingdom) (TEI ’09). Association for Computing Machinery, New York, NY, USA, 13–18. https://doi.org/10.1145/1517664.1517671",
      "doi": "10.1145/1517664.1517671"
    },
    {
      "text": "Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-changing interfaces. Personal and Ubiquitous Computing 15, 2 (2011), 161–173. https://doi.org/10.1007/s00779-010-0311-y",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Satu Elo and Helvi Kyngäs. 2008. The qualitative content analysis process. Journal of Advanced Nursing 62, 1 (apr 2008), 107–115. https://doi.org/10.1111/j.1365-2648.2007.04569.x",
      "doi": ""
    },
    {
      "text": "Feng Feng, Dan Bennett, Zhi-jun Fan, and Oussama Metatla. 2022. It’s Touching: Understanding Touch-Affect Association in Shape-Change with Kinematic Features. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 428, 18 pages. https://doi.org/10.1145/3491102.3502003",
      "doi": "10.1145/3491102.3502003"
    },
    {
      "text": "Eivind Flobak, Jo D. Wake, Joakim Vindenes, Smiti Kahlon, Tine Nordgreen, and Frode Guribye. 2019. Participatory Design of VR Scenarios for Exposure Therapy. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300799",
      "doi": "10.1145/3290605.3300799"
    },
    {
      "text": "Alf Gabrielsson. 2001. Emotion perceived and emotion felt: Same or different?Musicae Scientiae 5, 1_suppl (2001), 123–147. https://doi.org/10.1177/10298649020050S105",
      "doi": ""
    },
    {
      "text": "James J Gibson. 2014. The ecological approach to visual perception: classic edition. Psychology press, New York. https://doi.org/10.4324/9781315740218",
      "doi": ""
    },
    {
      "text": "Mark Goulthorpe, Mark Burry, and Grant Dunlop. 2001. Aegis Hyposurface©: the bordering of university and practice. CUMINCAD, CUMINCAD.",
      "doi": ""
    },
    {
      "text": "Jens Emil Grønbæk, Henrik Korsgaard, Marianne Graves Petersen, Morten Henriksen Birk, and Peter Gall Krogh. 2017. Proxemic Transitions: Designing Shape-Changing Furniture for Informal Meetings. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 7029–7041. https://doi.org/10.1145/3025453.3025487",
      "doi": "10.1145/3025453.3025487"
    },
    {
      "text": "Jens Emil Grønbæk, Majken Kirkegaard Rasmussen, Kim Halskov, and Marianne Graves Petersen. 2020. KirigamiTable: Designing for Proxemic Transitions with a Shape-Changing Tabletop. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376834",
      "doi": "10.1145/3313831.3376834"
    },
    {
      "text": "Kim Laranang Hansen, Ulrik Stoch Jensen, Sune Porsmose Johansson, Eleftherios Papachristos, Mikael B. Skov, Roel Vertegaal, and Timothy Merritt. 2022. FeetBack: Providing Haptic Directional Cues Through a Shape-Changing Floor. In Nordic Human-Computer Interaction Conference (Aarhus, Denmark) (NordiCHI ’22). Association for Computing Machinery, New York, NY, USA, Article 39, 10 pages. https://doi.org/10.1145/3546155.3546653",
      "doi": "10.1145/3546155.3546653"
    },
    {
      "text": "Jeremy M. Heiner, Scott E. Hudson, and Kenichiro Tanaka. 1999. The Information Percolator: Ambient Information Display in a Decorative Object. In Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology(Asheville, North Carolina, USA) (UIST ’99). Association for Computing Machinery, New York, NY, USA, 141–148. https://doi.org/10.1145/320719.322595",
      "doi": "10.1145/320719.322595"
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Saskia Bakker, Gail Kenning, Inge Bongers, and Berry Eggen. 2020. The Role of Everyday Sounds in Advanced Dementia Care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376577",
      "doi": "10.1145/3313831.3376577"
    },
    {
      "text": "Hiroshi Ishii, Daniel Leithinger, Sean Follmer, Amit Zoran, Philipp Schoessler, and Jared Counts. 2015. TRANSFORM: Embodiment of \"Radical Atoms\" at Milano Design Week. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 687–694. https://doi.org/10.1145/2702613.2702969",
      "doi": "10.1145/2702613.2702969"
    },
    {
      "text": "Hiroshi Ishii, Sandia Ren, and Phil Frei. 2001. Pinwheels: Visualizing Information Flow in an Architectural Space. In CHI ’01 Extended Abstracts on Human Factors in Computing Systems (Seattle, Washington) (CHI EA ’01). Association for Computing Machinery, New York, NY, USA, 111–112. https://doi.org/10.1145/634067.634135",
      "doi": "10.1145/634067.634135"
    },
    {
      "text": "Hans-Christian Jetter, Roman Rädle, Tiare Feuchtner, Christoph Anthes, Judith Friedl, and Clemens Nylandsted Klokmose. 2020. \"In VR, Everything is Possible!\": Sketching and Simulating Spatially-Aware Interactive Spaces in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376652",
      "doi": "10.1145/3313831.3376652"
    },
    {
      "text": "Hyunyoung Kim, Celine Coutrix, and Anne Roudaut. 2018. Morphees+: Studying Everyday Reconfigurable Objects for the Design and Taxonomy of Reconfigurable UIs. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174193",
      "doi": "10.1145/3173574.3174193"
    },
    {
      "text": "Seoktae Kim, Hyunjung Kim, Boram Lee, Tek-Jin Nam, and Woohun Lee. 2008. Inflatable Mouse: Volume-Adjustable Mouse with Air-Pressure-Sensitive Input and Haptic Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 211–224. https://doi.org/10.1145/1357054.1357090",
      "doi": "10.1145/1357054.1357090"
    },
    {
      "text": "Yuhan Luo, Peiyi Liu, and Eun Kyoung Choe. 2019. Co-Designing Food Trackers with Dietitians: Identifying Design Opportunities for Food Tracker Customization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300822",
      "doi": "10.1145/3290605.3300822"
    },
    {
      "text": "S Malpica, A Serrano, M Allue, M G Bedia, and B Masia. 2020. Crossmodal perception in virtual reality. Multimedia Tools and Applications 79, 5 (2020), 3311–3331. https://doi.org/10.1007/s11042-019-7331-z",
      "doi": ""
    },
    {
      "text": "Martin N Marshall. 1996. Sampling for qualitative research. Family Practice 13, 6 (jan 1996), 522–526. https://doi.org/10.1093/fampra/13.6.522",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Tye Rattenbury, Scott Carter, Anind Dey, and Jennifer Mankoff. 2003. A peripheral display toolkit. University of California, Berkeley Technotes, UCB//CSD-03-1258 168 (2003), 0–10.",
      "doi": ""
    },
    {
      "text": "Brenna McNally, Priya Kumar, Chelsea Hordatt, Matthew Louis Mauriello, Shalmali Naik, Leyla Norooz, Alazandra Shorter, Evan Golub, and Allison Druin. 2018. Co-Designing Mobile Online Safety Applications with Children. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3173574.3174097",
      "doi": "10.1145/3173574.3174097"
    },
    {
      "text": "Joshua McVeigh-Schultz, Max Kreminski, Keshav Prasad, Perry Hoberman, and Scott S. Fisher. 2018. Immersive Design Fiction: Using VR to Prototype Speculative Interfaces and Interaction Rituals within a Virtual Storyworld. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 817–829. https://doi.org/10.1145/3196709.3196793",
      "doi": "10.1145/3196709.3196793"
    },
    {
      "text": "Yanni Mei, Jie Li, Huib de Ridder, and Pablo Cesar. 2021. CakeVR: A Social Virtual Reality (VR) Tool for Co-Designing Cakes. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 572, 14 pages. https://doi.org/10.1145/3411764.3445503",
      "doi": "10.1145/3411764.3445503"
    },
    {
      "text": "Samantha Mitchell Finnigan and Adrian K. Clear. 2020. \"No Powers, Man!\": A Student Perspective on Designing University Smart Building Interactions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376174",
      "doi": "10.1145/3313831.3376174"
    },
    {
      "text": "Emmi Parviainen and Marie Louise Juul Søndergaard. 2020. Experiential Qualities of Whispering with Voice Assistants. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376187",
      "doi": "10.1145/3313831.3376187"
    },
    {
      "text": "Elin Rønby Pedersen and Tomas Sokoler. 1997. AROMA: Abstract Representation of Presence Supporting Mutual Awareness. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’97). Association for Computing Machinery, New York, NY, USA, 51–58. https://doi.org/10.1145/258549.258584",
      "doi": "10.1145/258549.258584"
    },
    {
      "text": "Esben W. Pedersen, Sriram Subramanian, and Kasper Hornbæk. 2014. Is My Phone Alive? A Large-Scale Study of Shape Change in Handheld Devices Using Videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2579–2588. https://doi.org/10.1145/2556288.2557018",
      "doi": "10.1145/2556288.2557018"
    },
    {
      "text": "Miro Platform. 2011. An Online Visual Collaboration Platform for Teamwork. Miro. Retrieved Dec 1, 2020 from http://miro.com",
      "doi": ""
    },
    {
      "text": "Anett Racz and Gergo Zilizi. 2018. VR Aided Architecture and Interior Design. In 2018 International Conference on Advances in Computing and Communication Engineering (ICACCE). IEEE, -, 11–16. https://doi.org/10.1109/ICACCE.2018.8441714",
      "doi": ""
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-Changing Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 735–744. https://doi.org/10.1145/2207676.2207781",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Yvonne Rogers, William R. Hazlewood, Paul Marshall, Nick Dalton, and Susanna Hertrich. 2010. Ambient Influence: Can Twinkly Lights Lure and Abstract Representations Trigger Behavioral Change?. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing (Copenhagen, Denmark) (UbiComp ’10). Association for Computing Machinery, New York, NY, USA, 261–270. https://doi.org/10.1145/1864349.1864372",
      "doi": "10.1145/1864349.1864372"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High \"Shape Resolution\" in Self-Actuated Flexible Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 593–602. https://doi.org/10.1145/2470654.2470738",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Aimee Rydarowski, Ozge Samanci, and Ali Mazalek. 2008. Murmur: Kinetic Relief Sculpture, Multi-Sensory Display, Listening Machine. In Proceedings of the 2nd International Conference on Tangible and Embedded Interaction (Bonn, Germany) (TEI ’08). Association for Computing Machinery, New York, NY, USA, 231–238. https://doi.org/10.1145/1347390.1347442",
      "doi": "10.1145/1347390.1347442"
    },
    {
      "text": "Heikki Sjöman, Nazare Soares, Martinus Suijkerbuijk, Jørgen Blindheim, Martin Steinert, and Dag T. Wisland. 2018. The Breathing Room: Breathing Interval and Heart Rate Capturing through Ultra Low Power Radar. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3170427.3186473",
      "doi": "10.1145/3170427.3186473"
    },
    {
      "text": "Yading Song, Simon Dixon, Marcus T Pearce, and Andrea R Halpern. 2016. Perceived and Induced Emotion Responses to Popular Music: Categorical and Dimensional Models. Music Perception 33, 4 (apr 2016), 472–492. https://doi.org/10.1525/mp.2016.33.4.472",
      "doi": ""
    },
    {
      "text": "Marc Steen, Menno Manschot, and Nicole De Koning. 2011. Benefits of co-design in service design projects. International Journal of Design 5, 2 (2011).",
      "doi": ""
    },
    {
      "text": "Miriam Sturdee and Jason Alexander. 2018. Analysis and Classification of Shape-Changing Interfaces for Design and Application-Based Research. ACM Comput. Surv. 51, 1, Article 2 (jan 2018), 32 pages. https://doi.org/10.1145/3143559",
      "doi": "10.1145/3143559"
    },
    {
      "text": "Ryo Suzuki, Ryosuke Nakayama, Dan Liu, Yasuaki Kakehi, Mark D. Gross, and Daniel Leithinger. 2020. LiftTiles: Constructive Building Blocks for Prototyping Room-Scale Shape-Changing Interfaces. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (Sydney NSW, Australia) (TEI ’20). Association for Computing Machinery, New York, NY, USA, 143–151. https://doi.org/10.1145/3374920.3374941",
      "doi": "10.1145/3374920.3374941"
    },
    {
      "text": "Kazuki Takashima, Naohiro Aida, Hitomi Yokoyama, and Yoshifumi Kitamura. 2013. TransformTable: A Self-Actuated Shape-Changing Digital Table. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (St. Andrews, Scotland, United Kingdom) (ITS ’13). Association for Computing Machinery, New York, NY, USA, 179–188. https://doi.org/10.1145/2512349.2512818",
      "doi": "10.1145/2512349.2512818"
    },
    {
      "text": "Kazuki Takashima, Takafumi Oyama, Yusuke Asari, Ehud Sharlin, Saul Greenberg, and Yoshifumi Kitamura. 2016. Study and Design of a Shape-Shifting Wall Display. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 796–806. https://doi.org/10.1145/2901790.2901892",
      "doi": "10.1145/2901790.2901892"
    },
    {
      "text": "Haodan Tan, John Tiab, Selma Šabanović, and Kasper Hornbæk. 2016. Happy Moves, Sad Grooves: Using Theories of Biological Motion and Affect to Design Shape-Changing Interfaces. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 1282–1293. https://doi.org/10.1145/2901790.2901845",
      "doi": "10.1145/2901790.2901845"
    },
    {
      "text": "Shan-Yuan Teng, Cheng-Lung Lin, Chi-huan Chiang, Tzu-Sheng Kuo, Liwei Chan, Da-Yuan Huang, and Bing-Yu Chen. 2019. TilePoP: Tile-Type Pop-up Prop for Virtual Reality. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 639–649. https://doi.org/10.1145/3332165.3347958",
      "doi": "10.1145/3332165.3347958"
    },
    {
      "text": "Jonas Togler, Fabian Hemmert, and Reto Wettach. 2009. Living Interfaces: The Thrifty Faucet. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (Cambridge, United Kingdom) (TEI ’09). Association for Computing Machinery, New York, NY, USA, 43–44. https://doi.org/10.1145/1517664.1517680",
      "doi": "10.1145/1517664.1517680"
    },
    {
      "text": "Martin Tomitsch, Karin Kappel, Andreas Lehner, and Thomas Grechenig. 2007. Towards a Taxonomy for Ambient Information Systems.Ambient information systems 44 (2007).",
      "doi": ""
    },
    {
      "text": "Sam Tregillus, Majed Al Zayer, and Eelke Folmer. 2017. Handsfree Omnidirectional VR Navigation Using Head Tilt. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4063–4068. https://doi.org/10.1145/3025453.3025521",
      "doi": "10.1145/3025453.3025521"
    },
    {
      "text": "Aditya Vishwanath, Naveena Karusala, Marisol Wong-Villacres, and Neha Kumar. 2019. Engaging Lived and Virtual Realities. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300580",
      "doi": "10.1145/3290605.3300580"
    },
    {
      "text": "Peter Weir, Christian Sandor, Matt Swoboda, Thanh Nguyen, Ulrich Eck, Gerhard Reitmayr, and Arindam Day. 2013. Burnar: Involuntary heat sensations in augmented reality. In 2013 IEEE Virtual Reality (VR). IEEE, Lake Buena Vista, FL, 43–46. https://doi.org/10.1109/VR.2013.6549357",
      "doi": ""
    },
    {
      "text": "Craig Wisneski, Hiroshi Ishii, Andrew Dahley, Matt Gorbet, Scott Brave, Brygg Ullmer, and Paul Yarin. 1998. Ambient Displays: Turning Architectural Space into an Interface between People and Digital Information BT. In Cooperative Buildings: Integrating Information, Organization, and Architecture, Norbert A Streitz, Shin’ichi Konomi, and Heinz-Jürgen Burkhardt (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 22–32.",
      "doi": ""
    },
    {
      "text": "Rob Withagen, Duarte Araújo, and Harjo J de Poel. 2017. Inviting affordances and agency. New Ideas in Psychology 45 (2017), 11–18. https://doi.org/10.1016/j.newideapsych.2016.12.002",
      "doi": ""
    },
    {
      "text": "Yinlong Zhang, Lawrence Feick, and Lydia J Price. 2006. The Impact of Self-Construal on Aesthetic Preference for Angular Versus Rounded Shapes. Personality and Social Psychology Bulletin 32, 6 (jun 2006), 794–805. https://doi.org/10.1177/0146167206286626",
      "doi": ""
    },
    {
      "text": "Peter Zimmermann. 2008. Virtual Reality Aided Design. A survey of the use of VR in automotive industry BT. In Product Engineering: Tools and Methods Based on Virtual Reality, Doru Talabaand Angelos Amditis (Eds.). Springer Netherlands, Dordrecht, 277–296. https://doi.org/10.1007/978-1-4020-8200-9_13",
      "doi": ""
    }
  ]
}