{
  "doi": "10.1145/3544548.3580650",
  "title": "Tips, Tricks, and Training: Supporting Anti-Phishing Awareness among Mid-Career Office Workers Based on Employees’ Current Practices",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Preventing workplace phishing depends on the actions of every employee, regardless of cybersecurity expertise. Based on 24 semi-structured interviews with mid-career office workers (70.8% women, averaging 44 years old) at two U.S. universities, we found that less than 21% of our participants had any formal anti-phishing training. Much of what our participants know about phishing comes from informal sources that emphasize “tips” and \"tricks\" like those found in conversations with friends, news stories, newsletters, social media, and podcasts. These informal channels provide opportunities for IT professionals wishing to enhance employees’ anti-phishing awareness by better aligning the delivery of expert advice with employees’ current practices and desires. We provide four recommendations designed to embrace \"guerrilla learning\" by distributing anti-phishing educational resources across the workplace and workday in part to encourage the delivery of more accurate information in more informal and incidental ways, and greater dialogue between anti-phishing training instructors and learners.",
  "tags": [
    "human factors",
    "IT departments",
    "phishing",
    "organizational security",
    "cybersecurity",
    "informal learning",
    "qualitative user studies",
    "anti-phishing training",
    "workplace",
    "phishing education",
    "organizations",
    "work context",
    "guerrilla learning",
    "security"
  ],
  "authors": [
    {
      "name": "Anne Clara Tally",
      "institution": "Informatics, Indiana University Bloomington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659639838",
      "orcid": "0000-0001-6699-187X"
    },
    {
      "name": "Jacob Abbott",
      "institution": "Informatics, Indiana University Bloomington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658998128",
      "orcid": "0000-0002-7173-6643"
    },
    {
      "name": "Ashley M Bochner",
      "institution": "Informatics, Indiana University Bloomington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778107",
      "orcid": "0000-0001-6840-6961"
    },
    {
      "name": "Sanchari Das",
      "institution": "Computer Science, University of Denver, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659258333",
      "orcid": "0000-0003-1299-7867"
    },
    {
      "name": "Christena Nippert-Eng",
      "institution": "Informatics, Indiana University Bloomington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320259",
      "orcid": "0000-0002-1212-3628"
    }
  ],
  "references": [
    {
      "text": "Jonathan E Adler. 2008. Surprise. Educational Theory 58, 2 (2008), 149–173.",
      "doi": ""
    },
    {
      "text": "Cyber Infrastructure & Security Agency. 2021. Reminder for critical infrastructure to stay vigilant against threats during holidays and weekends.",
      "doi": ""
    },
    {
      "text": "Melad Mohamed Al-Daeef, Nurlida Basir, and Madihah Mohd Saudi. 2017. Security awareness training: A review. Lecture Notes in Engineering and Computer Science 2229 (2017), 446–451.",
      "doi": ""
    },
    {
      "text": "Ahmed Aleroud and Lina Zhou. 2017. Phishing environments, techniques, and countermeasures: A survey. Computers & Security 68(2017), 160–196.",
      "doi": "10.1016/j.cose.2017.04.006"
    },
    {
      "text": "Ahmad O Almashhadani, Mustafa Kaiiali, Sakir Sezer, and Philip O’Kane. 2019. A multi-classifier network-based crypto ransomware detection system: A case study of locky ransomware. IEEE access 7(2019), 47053–47067.",
      "doi": ""
    },
    {
      "text": "Abdullah Alnajim and Malcolm Munro. 2009. An Anti-Phishing Approach that Uses Training Intervention for Phishing Websites Detection. In 2009 Sixth International Conference on Information Technology: New Generations. IEEE, New York, NY, 405–410. https://doi.org/10.1109/ITNG.2009.109",
      "doi": "10.1109/ITNG.2009.109"
    },
    {
      "text": "Nalin Asanka Gamagedara Arachchilage and Steve Love. 2013. A game design framework for avoiding phishing attacks. Computers in Human Behavior 29, 3 (2013), 706–714.",
      "doi": "10.1016/j.chb.2012.12.018"
    },
    {
      "text": "Maria Bada and Jason R.C. Nurse. 2020. Chapter 4 - The social and psychological impact of cyberattacks. In Emerging Cyber Threats and Cognitive Vulnerabilities, Vladlena Benson and John Mcalaney (Eds.). Academic Press, San Diego, CA, 73–92. https://doi.org/10.1016/B978-0-12-816203-3.00004-6",
      "doi": ""
    },
    {
      "text": "Ben K Beitin. 2012. Interview and sampling. In The SAGE handbook of interview research: The complexity of the craft. Sage Publications, Thousand Oaks, CA, 243–254.",
      "doi": ""
    },
    {
      "text": "Glenn A Bowen. 2008. Naturalistic inquiry and the saturation concept: a research note. Qualitative research 8, 1 (2008), 137–152.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Jan-Willem Bullee, Lorena Montoya, Marianne Junger, and Pieter Hartel. 2017. Spear phishing in organisations explained. Information & Computer Security 25, 5 (2017), 593–613.",
      "doi": "10.1108/ICS-03-2017-0009"
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 981–992. https://doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Deanna D. Caputo, Shari Lawrence Pfleeger, Jesse D. Freeman, and M. Eric Johnson. 2014. Going Spear Phishing: Exploring Embedded Training and Awareness. IEEE Security and Privacy 12, 1 (2014), 28–38. https://doi.org/10.1109/MSP.2013.106",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory(2 ed.). SAGE Publications, London, England.",
      "doi": ""
    },
    {
      "text": "Weiru Chen, Yuming He, Xin Tian, and Wu He. 2021. Exploring Cybersecurity Education at the K-12 Level. In Proceedings of SITE Interactive Conference 2021, Elizabeth Langranand David Rutledge (Eds.). Association for the Advancement of Computing in Education (AACE), Online, United States, 108–114. https://www.learntechlib.org/p/220175",
      "doi": ""
    },
    {
      "text": "Cofense. 2016. Enterprise Phishing Susceptibility Report: An Inside Look at Employee Behavior Pertaining to Highly-Effective Phishing Scenarios., 13 pages. https://cofense.com/wp-content/uploads/2017/10/PhishMe_EnterprisePhishingSusceptibilityReport_2015_Final.pdf",
      "doi": ""
    },
    {
      "text": "Anastasia Danilova, Alena Naiakshina, and Matthew Smith. 2020. One size does not fit all: a grounded theory and online survey study of developer preferences for security warning types. In 2020 IEEE/ACM 42nd International Conference on Software Engineering (ICSE). IEEE, New York, NY, 136–148.",
      "doi": "10.1145/3377811.3380387"
    },
    {
      "text": "Hasan Darwish. 2017. Gamifying the industrial engineering profession., 1148–1161 pages. https://www.scopus.com/inward/record.uri?eid=2-s2.0-85018967165&partnerID=40&md5=399c9f1b99a2ea9306fdba815f51319d",
      "doi": ""
    },
    {
      "text": "Sanchari Das, Andrew Kim, Zachary Tingle, and Christena Nippert-Eng. 2019. All about phishing: Exploring user research through a systematic literature review. In Proceedings of the Thirteenth International Symposium on Human Aspects of Information Security & Assurance (HAISA 2019). International Federation for Information Processing (IFIP), Laxenburg, Austria, 198–202.",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Joanne Lo, Laura Dabbish, and Jason I. Hong. 2018. Breaking! A Typology of Security and Privacy News and How It’s Shared. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173575",
      "doi": "10.1145/3173574.3173575"
    },
    {
      "text": "Dana-Ain Davis and Christa Craven. 2022. Feminist ethnography (2ed.). Rowman & Littlefield, Lanham, MD.",
      "doi": ""
    },
    {
      "text": "Rachna Dhamija, J. D. Tygar, and Marti Hearst. 2006. Why Phishing Works. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 581–590. https://doi.org/10.1145/1124772.1124861",
      "doi": "10.1145/1124772.1124861"
    },
    {
      "text": "Paul Dourish, Rebecca E Grinter, Jessica Delgado De La Flor, and Melissa Joseph. 2004. Security in the wild: user strategies for managing security as an everyday, practical problem. Personal and Ubiquitous Computing 8, 6 (2004), 391–401.",
      "doi": ""
    },
    {
      "text": "Martina Dove. 2020. The Psychology of Fraud, Persuasion and Scam Techniques: Understanding what Makes Us Vulnerable. Routledge, London, UK. https://doi.org/10.4324/9781003015994",
      "doi": ""
    },
    {
      "text": "John D’Arcy and Anat Hovav. 2009. Does one size fit all? Examining the differential effects of IS security countermeasures. Journal of business ethics 89, 1 (2009), 59–71.",
      "doi": ""
    },
    {
      "text": "Michael Eraut. 2000. Non-formal learning and tacit knowledge in professional work. British journal of educational psychology 70, 1 (2000), 113–136.",
      "doi": ""
    },
    {
      "text": "Michael Fagan and Mohammad Maifi Hasan Khan. 2016. Why Do They Do What They Do?: A Study of What Motivates Users to (Not) Follow Computer Security Advice. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). USENIX Association, Denver, CO, 59–75. https://www.usenix.org/conference/soups2016/technical-sessions/presentation/fagan",
      "doi": ""
    },
    {
      "text": "Rubia Fatima, Affan Yasin, Lin Liu, and Jianmin Wang. 2019. How persuasive is a phishing email? A phishing game for phishing awareness. Journal of Computer Security 27, 6 (2019), 581–612.",
      "doi": "10.3233/JCS-181253"
    },
    {
      "text": "Chris Fennell and Rick Wash. 2019. Do stories help people adopt two-factor authentication?Studies 1, 2 (2019), 3.",
      "doi": ""
    },
    {
      "text": "Lisa M Finkelstein, Eden B King, and Elora C Voyles. 2015. Age metastereotyping and cross-age workplace interactions: A meta view of age stereotypes at work. Work, Aging and Retirement 1, 1 (2015), 26–40.",
      "doi": ""
    },
    {
      "text": "Anjuli Franz, Verena Zimmermann, Gregor Albrecht, Katrin Hartwig, Christian Reuter, Alexander Benlian, and Joachim Vogt. 2021. {SoK}: Still Plenty of Phish in the Sea — A Taxonomy of User-Oriented Phishing Interventions and Avenues for Future Research. In Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021). USENIX Association, Berkeley, CA, 339–358. https://www.usenix.org/conference/soups2021/presentation/franz",
      "doi": ""
    },
    {
      "text": "Kelsey R Fulton, Rebecca Gelles, Alexandra McKay, Yasmin Abdi, Richard Roberts, and Michelle L Mazurek. 2019. The effect of entertainment media on mental models of computer security. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019). USENIX Association, Berkeley, CA, 79–95.",
      "doi": ""
    },
    {
      "text": "Fiona Fylan. 2005. Semi-structured interviewing. A handbook of research methods for clinical and health psychology 5, 2(2005), 65–78.",
      "doi": ""
    },
    {
      "text": "Sanjukta T Ghosh. 2016. Feminist Ethnography. In The Wiley Blackwell Encyclopedia of Gender and Sexuality Studies. John Wiley & Sons, Ltd, Hoboken, NJ, 1–9. https://doi.org/10.1002/9781118663219.wbegss765 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/9781118663219.wbegss765",
      "doi": ""
    },
    {
      "text": "Kristen K Greene, Michelle P Steves, Mary F Theofanos, Jennifer Kostick, 2018. User context: an explanatory variable in phishing susceptibility. In in Proceedings of the 2018 Workshop Usable Security. National Institute of Standards and Technology (NIST), San Diego, California, United States.",
      "doi": ""
    },
    {
      "text": "Anti-Phishing Working Group. 2021. Phishing Activity Trends Report: 3rd Quarter. https://docs.apwg.org/reports/apwg_trends_report_q3_2021.pdf",
      "doi": ""
    },
    {
      "text": "Anti-Phishing Working Group. 2021. Phishing Activity Trends Report: 4th Quarter. https://docs.apwg.org/reports/apwg_trends_report_q4_2020.pdf",
      "doi": ""
    },
    {
      "text": "Isredza Rahmi A Hamid, Jemal Abawajy, and TH Kim. 2013. Using feature selection and classification scheme for automating phishing email detection. Studies in informatics and control 22, 1 (2013), 61–70.",
      "doi": ""
    },
    {
      "text": "Ryan Heartfield and George Loukas. 2015. A Taxonomy of Attacks and a Survey of Defence Mechanisms for Semantic Social Engineering Attacks. ACM Comput. Surv. 48, 3, Article 37 (dec 2015), 39 pages. https://doi.org/10.1145/2835375",
      "doi": "10.1145/2835375"
    },
    {
      "text": "Katie Hendrickson, Liz Gauthier, Maggie Osorio Glennon, Alexis Menocal Harrigan, Hannah Weissman, Carol Fletcher, Sarah Dunton, Jake Baskin, and Janice Mak. 2021. 2021 State of Computer Science Education Accelerating Action Through Advocacy.",
      "doi": ""
    },
    {
      "text": "Masayuki Higashino. 2019. A Design of an Anti-Phishing Training System Collaborated with Multiple Organizations. In Proceedings of the 21st International Conference on Information Integration and Web-Based Applications & Services (Munich, Germany) (iiWAS2019). Association for Computing Machinery, New York, NY, USA, 589–592. https://doi.org/10.1145/3366030.3366086",
      "doi": "10.1145/3366030.3366086"
    },
    {
      "text": "Jason Hong. 2012. The state of phishing attacks. Commun. ACM 55, 1 (2012), 74–81.",
      "doi": "10.1145/2063176.2063197"
    },
    {
      "text": "Tom N Jagatic, Nathaniel A Johnson, Markus Jakobsson, and Filippo Menczer. 2007. Social phishing. Commun. ACM 50, 10 (2007), 94–100.",
      "doi": "10.1145/1290958.1290968"
    },
    {
      "text": "Mohammad S Jalali, Maike Bruckes, Daniel Westmattelmann, and Gerhard Schewe. 2020. Why employees (still) click on phishing links: investigation in hospitals. Journal of medical Internet research 22, 1 (2020), e16775.",
      "doi": ""
    },
    {
      "text": "Daniel Jampen, Gürkan Gür, Thomas Sutter, and Bernhard Tellenbach. 2020. Don’t click: towards an effective anti-phishing training. A comparative literature review. Human-centric Computing and Information Sciences 10, 1 (2020), 1–41.",
      "doi": "10.1186/s13673-020-00237-7"
    },
    {
      "text": "Jurjen Jansen and Paul Van Schaik. 2018. Persuading end users to act cautiously online: A fear appeals study on phishing. Information & Computer Security 26, 3 (2018), 264–276.",
      "doi": ""
    },
    {
      "text": "Giti Javidi and Ehsan Sheybani. 2018. K-12 Cybersecurity education, research, and outreach. In 2018 IEEE Frontiers in Education Conference (FIE). IEEE, New York, NY, 1–5.",
      "doi": "10.1109/FIE.2018.8659021"
    },
    {
      "text": "Matthew L Jensen, Michael Dinger, Ryan T Wright, and Jason Bennett Thatcher. 2017. Training to mitigate phishing attacks using mindfulness techniques. Journal of Management Information Systems 34, 2 (2017), 597–626.",
      "doi": ""
    },
    {
      "text": "Sean HK Kang. 2016. Spaced repetition promotes efficient and effective learning: Policy implications for instruction. Policy Insights from the Behavioral and Brain Sciences 3, 1 (2016), 12–19.",
      "doi": ""
    },
    {
      "text": "Timothy Kelley, Mary J Amon, and Bennett I Bertenthal. 2018. Statistical models for predicting threat detection from human behavior. Frontiers in psychology 9 (2018), 466.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Katta Spiel, Oliver L Haimson, Foad Hamidi, and Stacy M Branham. 2019. HCI Guidelines for Gender Equity and Inclusivity. Version 1.1. https://www.morgan-klaus.com/gender-guidelines.html.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru, Justin Cranshaw, Alessandro Acquisti, Lorrie Cranor, Jason Hong, Mary Ann Blair, and Theodore Pham. 2009. School of Phish: A Real-World Evaluation of Anti-Phishing Training. In Proceedings of the 5th Symposium on Usable Privacy and Security (Mountain View, California, USA) (SOUPS ’09). Association for Computing Machinery, New York, NY, USA, Article 3, 12 pages. https://doi.org/10.1145/1572532.1572536",
      "doi": "10.1145/1572532.1572536"
    },
    {
      "text": "Ponnurangam Kumaraguru, Yong Rhee, Alessandro Acquisti, Lorrie Faith Cranor, Jason Hong, and Elizabeth Nunge. 2007. Protecting People from Phishing: The Design and Evaluation of an Embedded Training Email System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 905–914. https://doi.org/10.1145/1240624.1240760",
      "doi": "10.1145/1240624.1240760"
    },
    {
      "text": "Ponnurangam Kumaraguru, Steve Sheng, Alessandro Acquisti, Lorrie Faith Cranor, and Jason Hong. 2010. Teaching Johnny not to fall for phish. ACM Transactions on Internet Technology (TOIT) 10, 2 (2010), 1–31.",
      "doi": "10.1145/1754393.1754396"
    },
    {
      "text": "Ponemon Institute LLC. 2021. The 2021 Cost of Phishing Study. https://www.proofpoint.com/sites/default/files/analyst-reports/pfpt-us-ar-ponemon-2021-cost-of-phishing-study.pdf",
      "doi": ""
    },
    {
      "text": "Jeffrey Loewenstein and Chip Heath. 2009. The Repetition-Break plot structure: A cognitive influence on selection in the marketplace of ideas. Cognitive science 33, 1 (2009), 1–19.",
      "doi": ""
    },
    {
      "text": "Lili Luo and Barbara M Wildemuth. 2016. Semistructured interviews. In Applications of social research methods to questions in information and library science, 2nd edition(2 ed.), Barbara M Wildemuth (Ed.). Vol. 232. Libraries Unlimited Westport, Englewood, CO.",
      "doi": ""
    },
    {
      "text": "Janice Malcolm, Phil Hodkinson, and Helen Colley. 2003. The interrelationships between informal and formal learning. Journal of Workplace Learning 15, 7/8 (01 Jan 2003), 313–318. https://doi.org/10.1108/13665620310504783",
      "doi": ""
    },
    {
      "text": "Amelia Manuti, Serafina Pastore, Anna Fausta Scardigno, Maria Luisa Giancaspro, and Daniele Morciano. 2015. Formal and informal learning in the workplace: A research review. International journal of training and development 19, 1(2015), 1–17.",
      "doi": ""
    },
    {
      "text": "Mark Mason. 2010. Sample Size and Saturation in PhD Studies Using Qualitative Interviews. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research 11, 3 (Aug. 2010), 19 pages. https://doi.org/10.17169/fqs-11.3.1428",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-Rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 72 (nov 2019), 23 pages. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Michael JA Miranda. 2018. Enhancing cybersecurity awareness training: A comprehensive phishing exercise approach. International Management Review 14, 2 (2018), 5–10.",
      "doi": ""
    },
    {
      "text": "Gaurav Misra, Nalin Asanka Gamagedara Arachchilage, and Shlomo Berkovsky. 2017. Phish Phinder: A Game Design Approach to Enhance User Confidence in Mitigating Phishing Attacks. In Eleventh International Symposium on Human Aspects of Information Security & Assurance (HAISA) 2017, Proceedings, Steven Furnell and Nathan L. Clarke (Eds.). University of Plymouth, Plymouth, UK, 41–51. http://www.cscan.org/openaccess/?paperid=349",
      "doi": ""
    },
    {
      "text": "Harvey Molotch. 2014.. Princeton University Press, Princeton, NJ.",
      "doi": ""
    },
    {
      "text": "Steve Morgan. 2021. Cybercrime to cost the world $10.5 trillion annually by 2025. https://cybersecurityventures.com/cybercrime-damages-6-trillion-by-2021/",
      "doi": ""
    },
    {
      "text": "Alan Morris. 2015. A practical introduction to in-depth interviewing. SAGE Publications, London, England.",
      "doi": ""
    },
    {
      "text": "Katelin A Moul. 2019. Avoid Phishing Traps. In Proceedings of the 2019 ACM SIGUCCS Annual Conference (New Orleans, LA, USA) (SIGUCCS ’19). Association for Computing Machinery, New York, NY, USA, 199–208. https://doi.org/10.1145/3347709.3347774",
      "doi": "10.1145/3347709.3347774"
    },
    {
      "text": "Edward Munnich, Micheal Andrew Ranney, and Mirian Song. 2007. Surprise, surprise: The role of surprising numerical feedback in belief change. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 29. Cognitive Science Society, Seattle, WA, 503–508.",
      "doi": ""
    },
    {
      "text": "Francois Murphy. 2019. Austrian court rejects FACC lawsuit against ex-CEO in cyber fraud case. https://www.nasdaq.com/articles/austrian-court-rejects-facc-lawsuit-against-ex-ceo-in-cyber-fraud-case-2019-11-27",
      "doi": ""
    },
    {
      "text": "Shadia Nasralla. 2016. Austria’s FACC, hit by Cyber Fraud, fires CEO. https://www.reuters.com/article/us-facc-ceo-idUSKCN0YG0ZF",
      "doi": ""
    },
    {
      "text": "Christopher Nguyen, Matthew Jensen, and Eric Day. 2021. Learning not to take the bait: a longitudinal examination of digital training methods and overlearning on phishing susceptibility. European Journal of Information Systems 0, 0 (2021), 1–25. https://doi.org/10.1080/0960085X.2021.1931494 arXiv:https://doi.org/10.1080/0960085X.2021.1931494",
      "doi": ""
    },
    {
      "text": "James Nicholson, Lynne Coventry, and Pamela Briggs. 2019. \"If It’s Important It Will Be A Headline\": Cybersecurity Information Seeking in Older Adults. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi-org.proxyiub.uits.iu.edu/10.1145/3290605.3300579",
      "doi": "10.1145/3290605.3300579"
    },
    {
      "text": "Norbert Nthala and Rick Wash. 2021. How Non-Experts Try to Detect Phishing Scam Emails. In Workshop on Consumer Protection. USENIX Association, Berkeley, CA, 7 pages.",
      "doi": ""
    },
    {
      "text": "Zhixin Pan, Jennifer Sheldon, Chamika Sudusinghe, Subodha Charles, and Prabhat Mishra. 2021. Hardware-assisted malware detection using machine learning. In 2021 Design, Automation & Test in Europe Conference & Exhibition (DATE). IEEE, New York, NY, 1775–1780.",
      "doi": ""
    },
    {
      "text": "Lisa Glebatis Perks and Jacob S Turner. 2019. Podcasts and productivity: A qualitative uses and gratifications study. Mass Communication and Society 22, 1 (2019), 96–116.",
      "doi": ""
    },
    {
      "text": "Andrew Perrin and Sara Atske. 2021. About three-in-ten U.S. adults say they are ‘almost constantly’ online. https://www.pewresearch.org/fact-tank/2021/03/26/about-three-in-ten-u-s-adults-say-they-are-almost-constantly-online/",
      "doi": ""
    },
    {
      "text": "Justin Petelka, Yixin Zou, and Florian Schaub. 2019. Put Your Warning Where Your Link Is: Improving and Evaluating Email Phishing Warnings. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300748",
      "doi": "10.1145/3290605.3300748"
    },
    {
      "text": "Katharina Pfeffer, Alexandra Mai, Edgar Weippl, Emilee Rader, and Katharina Krombholz. 2022. Replication: Stories as Informal Lessons about Security. In Eighteenth Symposium on Usable Privacy and Security (SOUPS 2022). USENIX Association, Berkeley, CA, 1–18.",
      "doi": ""
    },
    {
      "text": "Emilee Rader and Rick Wash. 2015. Identifying patterns in informal sources of security information. Journal of Cybersecurity 1, 1 (2015), 121–144.",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Rick Wash, and Brandon Brooks. 2012. Stories as Informal Lessons about Security. In Proceedings of the Eighth Symposium on Usable Privacy and Security (Washington, D.C.) (SOUPS ’12). Association for Computing Machinery, New York, NY, USA, Article 6, 17 pages. https://doi.org/10.1145/2335356.2335364",
      "doi": "10.1145/2335356.2335364"
    },
    {
      "text": "Justinas Rastenis, Simona Ramanauskaitė, Justinas Janulevičius, Antanas Čenys, Asta Slotkienė, and Kęstutis Pakrijauskas. 2020. E-mail-based phishing attack taxonomy. Applied Sciences 10, 7 (2020), 2363.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2016. How I Learned to Be Secure: A Census-Representative Survey of Security Advice Sources and Behavior. In Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security (Vienna, Austria) (CCS ’16). Association for Computing Machinery, New York, NY, USA, 666–677. https://doi.org/10.1145/2976749.2978307",
      "doi": "10.1145/2976749.2978307"
    },
    {
      "text": "Robert W. Reeder, Adrienne Porter Felt, Sunny Consolvo, Nathan Malkin, Christopher Thompson, and Serge Egelman. 2018. An Experience Sampling Study of User Reactions to Browser Warnings in the Field. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174086",
      "doi": "10.1145/3173574.3174086"
    },
    {
      "text": "Joseph Ricci, Frank Breitinger, and Ibrahim Baggili. 2019. Survey results on adults and cybersecurity education. Education and Information Technologies 24, 1 (2019), 231–249.",
      "doi": "10.1007/s10639-018-9765-8"
    },
    {
      "text": "Barbara J Risman. 1993. Methodological implications of feminist scholarship. The American Sociologist 24, 3/4 (1993), 15–25.",
      "doi": ""
    },
    {
      "text": "Alan Rogers. 2014. The classroom and the everyday: The importance of informal learning for formal learning. Investigar em educação 2, 1 (2014), 7–34.",
      "doi": ""
    },
    {
      "text": "Ashina Sadiq, Muhammad Anwar, Rizwan A Butt, Farhan Masud, Muhammad K Shahzad, Shahid Naseem, and Muhammad Younas. 2021. A review of phishing attacks and countermeasures for internet of things-based smart business applications in industry 4.0. Human behavior and emerging technologies 3, 5 (2021), 854–864.",
      "doi": ""
    },
    {
      "text": "Michael L Schwalbe and Michelle Wolkomir. 2012. 10 Interviewing Men. SAGE Publications, Inc., Thousand Oaks, CA. 202–219 pages.",
      "doi": ""
    },
    {
      "text": "Sylvia Scribner and Michael Cole. 1973. Cognitive Consequences of Formal and Informal Education: New accommodations are needed between school-based learning and learning experiences of everyday life.Science 182, 4112 (1973), 553–559.",
      "doi": ""
    },
    {
      "text": "Himani Sharma, Er. Meenakshi, and Sandeep Kaur Bhatia. 2017. A comparative analysis and awareness survey of phishing detection tools. In 2017 2nd IEEE International Conference on Recent Trends in Electronics, Information & Communication Technology (RTEICT). IEEE, New York, NY, 1437–1442. https://doi.org/10.1109/RTEICT.2017.8256835",
      "doi": ""
    },
    {
      "text": "Steve Sheng, Bryant Magnien, Ponnurangam Kumaraguru, Alessandro Acquisti, Lorrie Faith Cranor, Jason Hong, and Elizabeth Nunge. 2007. Anti-Phishing Phil: The Design and Evaluation of a Game That Teaches People Not to Fall for Phish. In Proceedings of the 3rd Symposium on Usable Privacy and Security (Pittsburgh, Pennsylvania, USA) (SOUPS ’07). Association for Computing Machinery, New York, NY, USA, 88–99. https://doi.org/10.1145/1280680.1280692",
      "doi": "10.1145/1280680.1280692"
    },
    {
      "text": "Kuldeep Singh, Palvi Aggarwal, Prashanth Rajivan, and Cleotilde Gonzalez. 2019. Training to Detect Phishing Emails: Effects of the Frequency of Experienced Phishing Emails., 453-457 pages. https://doi.org/10.1177/1071181319631355 arXiv:https://doi.org/10.1177/1071181319631355",
      "doi": ""
    },
    {
      "text": "Tiffany Skinner, Jacqui Taylor, Aftab Alam, and Raian Ali. 2021. Does Learning Method Matter in Cyber Security Behaviour? Spaced Vs. Massed e-Learning. In 2021 8th International Conference on Behavioral and Social Computing (BESC). IEEE, New York, NY, 1–6. https://doi.org/10.1109/BESC53957.2021.9635235",
      "doi": ""
    },
    {
      "text": "Gunikhan Sonowal. 2022. Introduction to Phishing. In Phishing and Communication Channels. Apress, Berkeley, CA, 1–24.",
      "doi": ""
    },
    {
      "text": "Judith Stacey. 1988. Can there be a feminist ethnography?Women’s Studies International Forum 11, 1 (1988), 21–27. https://doi.org/10.1016/0277-5395(88)90004-0",
      "doi": ""
    },
    {
      "text": "Michelle P Steves, Kristen K Greene, Mary F Theofanos, 2019. A phish scale: rating human phishing message detection difficulty., 14 pages.",
      "doi": ""
    },
    {
      "text": "Lennart Svensson, Per-Erik Ellström, and Carina Åberg. 2004. Integrating formal and informal learning at work. Journal of Workplace Learning 16, 8 (2004), 479–491. https://doi.org/10.1108/13665620410566441",
      "doi": ""
    },
    {
      "text": "Rick Wash. 2010. Folk Models of Home Computer Security. In Proceedings of the Sixth Symposium on Usable Privacy and Security (Redmond, Washington, USA) (SOUPS ’10). Association for Computing Machinery, New York, NY, USA, Article 11, 16 pages. https://doi.org/10.1145/1837110.1837125",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "Rick Wash. 2020. How Experts Detect Phishing Scam Emails. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 160 (oct 2020), 28 pages. https://doi.org/10.1145/3415231",
      "doi": "10.1145/3415231"
    },
    {
      "text": "Rick Wash and Molly M. Cooper. 2018. Who Provides Phishing Training? Facts, Stories, and People Like Me. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi-org.proxyiub.uits.iu.edu/10.1145/3173574.3174066",
      "doi": ""
    },
    {
      "text": "Rick Wash, Norbert Nthala, and Emilee Rader. 2021. Knowledge and Capabilities that {Non-Expert} Users Bring to Phishing Detection. In Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021). USENIX Association, Berkeley, CA, 377–396.",
      "doi": ""
    },
    {
      "text": "Rick Wash and Emilee Rader. 2011. Influencing Mental Models of Security: A Research Agenda. In Proceedings of the 2011 New Security Paradigms Workshop (Marin County, California, USA) (NSPW ’11). Association for Computing Machinery, New York, NY, USA, 57–66. https://doi.org/10.1145/2073276.2073283",
      "doi": "10.1145/2073276.2073283"
    },
    {
      "text": "Lisa D Weems. 2013. Guerilla-Pedagogy: On the Importance of Surprise and Responsibility in Education.Philosophical Studies in Education 44 (2013), 50–59.",
      "doi": ""
    },
    {
      "text": "Zikai Alex Wen, Zhiqiu Lin, Rowena Chen, and Erik Andersen. 2019. What.Hack: Engaging Anti-Phishing Training Through a Role-Playing Phishing Simulation Game. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300338",
      "doi": "10.1145/3290605.3300338"
    },
    {
      "text": "Yixin Zou, Abraham H Mhaidli, Austin McCall, and Florian Schaub. 2018. \"I’ve Got Nothing to Lose\": Consumers’ Risk Perceptions and Protective Actions after the Equifax Data Breach. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Berkeley, CA, 197–216.",
      "doi": ""
    }
  ]
}