{
  "doi": "10.1145/3544548.3581502",
  "title": "Sleep Planning with Awari: Uncovering the Materiality of Body Rhythms using Research through Design",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "With the increasing adoption of body tracking technology, users are able to collect bio-data which designers struggle to make legible or actionable. This work focused on increasing this technology-mediated bodily understanding through exploring the material properties of the body rhythms that govern the sleep behaviours being tracked.  Building from a workshop with non-normative sleepers, we reframe sleep tracking to be about understanding and manipulating body rhythms. We explore these rhythms through the RtD process of designing the Awari alertness-forecast and scheduling application in four iterations. This resulted in three non-exclusive categories of rhythmic influence: Slow & Cyclical, Pressure & Release, and Anchored. Through a better understanding of how they interact, their inertia, and their material properties for interaction we encourage the design of technology to shape, and be shaped, by the complex rhythms of life. We discuss ways in which this can democratise medical-models, and make actionable complex bodily processes.",
  "authors": [
    {
      "name": "Kasper Karlgren",
      "institution": "Department of Computer and Systems Sciences, Stockholm University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660499541",
      "orcid": "0000-0002-4435-9272"
    },
    {
      "name": "Donald Mcmillan",
      "institution": "Department of Computer and Systems Sciences, Stockholm University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484646781",
      "orcid": "0000-0002-1392-5737"
    }
  ],
  "references": [
    {
      "text": "Saeed Abdullah, Mark Matthews, Elizabeth L. Murnane, Geri Gay, and Tanzeem Choudhury. 2014. Towards circadian computing: \"early to bed and early to rise\" makes some of us unhealthy and sleep deprived. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’14 Adjunct. ACM Press, Seattle, Washington, 673–684. https://doi.org/10.1145/2632048.2632100 tex.ids= abdullah_towards_2014-1.",
      "doi": "10.1145/2632048.2632100"
    },
    {
      "text": "Saeed Abdullah, Elizabeth L. Murnane, Mark Matthews, and Tanzeem Choudhury. 2017. Circadian Computing: Sensing, Modeling, and Maintaining Biological Rhythms. In Mobile Health, James M. Rehg, Susan A. Murphy, and Santosh Kumar (Eds.). Springer International Publishing, Cham, 35–58. https://doi.org/10.1007/978-3-319-51394-2_3",
      "doi": ""
    },
    {
      "text": "Saeed Abdullah, Elizabeth L. Murnane, Mark Matthews, Matthew Kay, Julie A. Kientz, Geri Gay, and Tanzeem Choudhury. 2016. Cognitive rhythms: unobtrusive and continuous sensing of alertness using a mobile phone. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, Heidelberg Germany, 178–189. https://doi.org/10.1145/2971648.2971712 tex.ids= abdullah_cognitive_2016-1, abdullah_cognitive_2016-2.",
      "doi": "10.1145/2971648.2971712"
    },
    {
      "text": "Christer Ahlstrom, Wessel van Leeuwen, Stas Krupenia, Herman Jansson, Svitlana Finer, Anna Anund, and Goran Kecklund. 2022. Real-Time Adaptation of Driving Time and Rest Periods in Automated Long-Haul Trucking: Development of a System Based on Biomathematical Modelling, Fatigue and Relaxation Monitoring. IEEE Transactions on Intelligent Transportation Systems 23, 5 (May 2022), 4758–4766. https://doi.org/10.1109/TITS.2021.3102519",
      "doi": "10.1109/TITS.2021.3102519"
    },
    {
      "text": "Miquel Alfaras, William Primett, Muhammad Umair, Charles Windlin, Pavel Karpashevich, Niaz Chalabianloo, Dionne Bowie, Corina Sas, Pedro Sanches, Kristina Höök, Cem Ersoy, and Hugo Gamboa. 2020. Biosensing and Actuation—Platforms Coupling Body Input-Output Modalities for Affective Technologies. Sensors 20, 21 (Oct. 2020), 5968. https://doi.org/10.3390/s20215968",
      "doi": ""
    },
    {
      "text": "Lau Amdisen, Stine Daugaard, Jesper Medom Vestergaard, Anne Vested, Jens Peter Bonde, Helene Tilma Vistisen, Jens Christoffersen, Anne Helene Garde, Åse Marie Hansen, and Jakob Markvart. 2022. A longitudinal study of morning, evening, and night light intensities and nocturnal sleep quality in a working population. Chronobiology International 39, 4 (2022), 579–589. https://doi.org/10.1080/07420528.2021.2010741 ISBN: 0742-0528 Publisher: Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Kristina Andersen and Ron Wakkary. 2019. The Magic Machine Workshops: Making Personal Design Knowledge. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300342",
      "doi": "10.1145/3290605.3300342"
    },
    {
      "text": "Ilene L. Bernstein, Janet C. Zimmerman, Charles A. Czeisler, and Elliot D. Weitzman. 1981. Meal patterns in “free-running” humans. Physiology & behavior 27, 4 (1981), 621–623. https://doi.org/10.1016/0031-9384(81)90232-8 ISBN: 0031-9384 Publisher: Elsevier.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Minna Vigren, Asreen Rostami, and Mareike Glöss. 2022. Why Users Hack: Conflicting Interests and the Political Economy of Software. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–26. https://doi.org/10.1145/3555774 ISBN: 2573-0142 Publisher: ACM New York, NY, USA.",
      "doi": "10.1145/3555774"
    },
    {
      "text": "Zhenyu Chen, Mu Lin, Fanglin Chen, Nicholas D. Lane, Giuseppe Cardone, Rui Wang, Tianxing Li, Yiqiang Chen, Tanzeem Choudhury, and Andrew T. Campbell. 2013. Unobtrusive sleep monitoring using smartphones. In 2013 7th International Conference on Pervasive Computing Technologies for Healthcare and Workshops. ACM Press, Venice Italy, 145–152. tex.ids= chen_unobtrusive_2013-1 ISSN: 2153-1641.",
      "doi": "10.4108/icst.pervasivehealth.2013.252148"
    },
    {
      "text": "Janghee Cho. 2021. From The Art of Reflection to The Art of Noticing: A Shifting View of Self-Tracking Technologies’ Role in Supporting Sustainable Food Practices. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. ACM Press, Yokohama, Japan, 7. https://doi.org/10.1145/3411763.3451838",
      "doi": "10.1145/3411763.3451838"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. 2015. SleepTight: low-burden, self-monitoring technology for capturing and reflecting on sleep behaviors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’15. ACM Press, Osaka, Japan, 121–132. https://doi.org/10.1145/2750858.2804266",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Stephen Deacon and Josephine Arendt. 1996. Adapting to phase shifts, I. An experimental model for jet lag and shift work. Physiology & behavior 59, 4-5 (1996), 665–673. https://doi.org/10.1016/0031-9384(95)02147-7",
      "doi": ""
    },
    {
      "text": "John Partomo Djajadiningrat, William W Gaver, and JW Fres. 2000. Interaction relabelling and extreme characters: methods for exploring aesthetic interactions. In DIS ’00: Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques. ACM Press, Brooklyn, New York, 66–71. https://doi.org/10.1145/347642.347664",
      "doi": "10.1145/347642.347664"
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX design innovation: Challenges for working with machine learning as a design material. In CHI ’17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM Press, Denver, CO, USA, 11. https://doi.org/10.1145/3025453.3025739",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Charmane I Eastman, Clifford J Gazda, Helen J Burgess, Stephanie J Crowley, and Louis F Fogg. 2005. Advancing circadian rhythms before eastward flight: a strategy to prevent or reduce jet lag. Sleep 28, 1 (2005), 33–44. https://doi.org/10.1093/sleep/28.1.33 Publisher: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Arthi Manohar, Jo Briggs, Mike Harding, Chris Speed, and John Vines. 2018. Making Sense of Blockchain Applications: A Typology for HCI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–14. https://doi.org/10.1145/3173574.3174032",
      "doi": "10.1145/3173574.3174032"
    },
    {
      "text": "Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating Rigor Using Thematic Analysis: A Hybrid Approach of Inductive and Deductive Coding and Theme Development. International Journal of Qualitative Methods 5, 1 (March 2006), 80–92. https://doi.org/10.1177/160940690600500107 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Brittany Fiore-Gartland. 2015. Communication, Mediation, and the Expectations of Data: Data Valences Across Health and Wellness Communities. International Journal of Communication 9 (2015), 1466–1484.",
      "doi": ""
    },
    {
      "text": "Renaud Gervais, Jérémy Frey, Alexis Gay, Fabien Lotte, and Martin Hachet. 2016. TOBE: Tangible Out-of-Body Experience. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Eindhoven Netherlands, 227–235. https://doi.org/10.1145/2839462.2839486 tex.ids= gervais_tobe_2016-1.",
      "doi": "10.1145/2839462.2839486"
    },
    {
      "text": "Colin M. Gray, Shruthi Sai Chivukula, and Ahreum Lee. 2020. What Kind of Work Do \"Asshole Designers\" Create? Describing Properties of Ethical Concern on Reddit. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, Eindhoven Netherlands, 61–73. https://doi.org/10.1145/3357236.3395486 tex.ids= gray_what_2020-1.",
      "doi": "10.1145/3357236.3395486"
    },
    {
      "text": "Lise Amy Hansen. 2014. Communicating movement: Full-body movement as a design material for digital interaction. Ph.D. Dissertation. Oslo School of Architecture and Design, Oslo Norway. http://hdl.handle.net/11250/2395154",
      "doi": ""
    },
    {
      "text": "Karey Helms. 2019. Do You Have to Pee?: A Design Space for Intimate and Somatic Data. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego CA USA, 1209–1222. https://doi.org/10.1145/3322276.3322290",
      "doi": "10.1145/3322276.3322290"
    },
    {
      "text": "Lars Erik Holmquist. 2004. User-driven innovation in the future applications lab. In Extended abstracts of the 2004 conference on Human factors and computing systems - CHI ’04. ACM Press, Vienna, Austria, 1091. https://doi.org/10.1145/985921.985995",
      "doi": "10.1145/985921.985995"
    },
    {
      "text": "Noura Howell, John Chuang, Abigail De Kosnik, Greg Niemeyer, and Kimiko Ryokai. 2018. Emotional Biosensing: Exploring Critical Alternatives. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 1–25. https://doi.org/10.1145/3274338",
      "doi": "10.1145/3274338"
    },
    {
      "text": "Noura Howell, Laura Devendorf, Rundong (Kevin) Tian, Tomás Vega Galvez, Nan-Wei Gong, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. Biosignals as Social Cues: Ambiguity and Emotional Interpretation in Social Displays of Skin Conductance. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, Brisbane QLD Australia, 865–870. https://doi.org/10.1145/2901790.2901850",
      "doi": "10.1145/2901790.2901850"
    },
    {
      "text": "Kunpeng Huang, Ruojia Sun, Ximeng Zhang, Md. Tahmidul Islam Molla, Margaret Dunne, Francois Guimbretiere, and Cindy Hsin-Liu Kao. 2021. WovenProbe: Probing Possibilities for Weaving Fully-Integrated On-Skin Systems Deployable in the Field. In Designing Interactive Systems Conference 2021. ACM, Virtual Event USA, 1143–1158. https://doi.org/10.1145/3461778.3462105 tex.ids= huang_wovenprobe_2021-1.",
      "doi": "10.1145/3461778.3462105"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the body: Somaesthetic interaction design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Michael Ingre, Wessel Van Leeuwen, Tomas Klemets, Christer Ullvetter, Stephen Hough, Göran Kecklund, David Karlsson, and Torbjörn Åkerstedt. 2014. Validating and Extending the Three Process Model of Alertness in Airline Operations. PLoS ONE 9, 10 (Oct. 2014), e108679. https://doi.org/10.1371/journal.pone.0108679 tex.ids= ingre_validating_2014-1.",
      "doi": ""
    },
    {
      "text": "Myriam Juda, Céline Vetter, and Till Roenneberg. 2013. The Munich ChronoType Questionnaire for Shift-Workers (MCTQShift). Journal of Biological Rhythms 28, 2 (April 2013), 130–140. https://doi.org/10.1177/0748730412475041 tex.ids= juda_munich_2013-1 publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Kasper Karlgren, Barry Brown, and Donald McMillan. 2022. From Self-Tracking to Sleep-Hacking: Online Collaboration on Changing Sleep. Proceedings of the ACM of Human-Computer Interaction 6, CSCW2 (Nov. 2022), 517–542. https://doi.org/10.1145/3555630",
      "doi": "10.1145/3555630"
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A. Kientz. 2012. Lullaby: a capture & access system for understanding the sleep environment. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing - UbiComp ’12. ACM Press, Pittsburgh, Pennsylvania, 226. https://doi.org/10.1145/2370216.2370253 tex.ids= kay_lullaby_2012-1.",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Nathaniel Kleitman. 1982. Basic Rest-Activity Cycle—22 Years Later. Sleep 5, 4 (Sept. 1982), 311–317. https://doi.org/10.1093/sleep/5.4.311",
      "doi": ""
    },
    {
      "text": "Dorthe Brogård Kristensen and Minna Ruckenstein. 2018. Co-evolving with self-tracking technologies. New Media & Society 20, 10 (Oct. 2018), 3624–3640. https://doi.org/10.1177/1461444818755650",
      "doi": ""
    },
    {
      "text": "Tsung-Min Lee, El-Wui Loh, Tai-Chih Kuo, Ka-Wai Tam, Hsin-Chien Lee, and Dean Wu. 2021. Effects of ultraviolet and blue-light filtering on sleep: a meta-analysis of controlled trials and studies on cataract patients. Eye 35, 6 (June 2021), 1629–1636. https://doi.org/10.1038/s41433-020-01132-2",
      "doi": ""
    },
    {
      "text": "Wanyu Liu, Bernd Ploderer, and Thuong Hoang. 2015. In Bed with Technology: Challenges and Opportunities for Sleep Tracking. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction on - OzCHI ’15. ACM Press, Parkville, VIC, Australia, 142–151. https://doi.org/10.1145/2838739.2838742 tex.ids= liu_bed_2015-1.",
      "doi": "10.1145/2838739.2838742"
    },
    {
      "text": "Sara Ljungblad and Lars Erik Holmquist. 2007. Transfer scenarios: grounding innovation with marginal practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 737–746. https://doi.org/10.1145/1240624.1240738",
      "doi": "10.1145/1240624.1240738"
    },
    {
      "text": "Yuhan Luo, Peiyi Liu, and Eun Kyoung Choe. 2019. Co-Designing Food Trackers with Dietitians: Identifying Design Opportunities for Food Tracker Customization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300822",
      "doi": "10.1145/3290605.3300822"
    },
    {
      "text": "Deborah Lupton. 2014. Self-tracking cultures: towards a sociology of personal informatics. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design. ACM, Sydney New South Wales Australia, 77–86. https://doi.org/10.1145/2686612.2686623",
      "doi": "10.1145/2686612.2686623"
    },
    {
      "text": "Lena Mamykina, Elizabeth D. Mynatt, and David R. Kaufman. 2006. Investigating health management practices of individuals with diabetes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Montréal Québec Canada, 927–936. https://doi.org/10.1145/1124772.1124910",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "Robert Meadows, Sara Arber, Susan Venn, and Jenny Hislop. 2008. Engaging with sleep: male definitions, understandings and attitudes. Sociology of Health & Illness 30, 5 (2008), 696–710. https://doi.org/10.1111/j.1467-9566.2008.01088.x",
      "doi": ""
    },
    {
      "text": "Androniki Naska. 2007. Siesta in Healthy Adults and Coronary Mortality in the General Population. Archives of Internal Medicine 167, 3 (Feb. 2007), 296. https://doi.org/10.1001/archinte.167.3.296",
      "doi": ""
    },
    {
      "text": "William Odom and Tijs Duel. 2018. On the Design of OLO Radio: Investigating Metadata as a Design Material. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–9. https://doi.org/10.1145/3173574.3173678",
      "doi": "10.1145/3173574.3173678"
    },
    {
      "text": "Fatih Kursat Ozenc, Miso Kim, John Zimmerman, Stephen Oney, and Brad Myers. 2010. How to support designers in getting hold of the immaterial material of software. In CHI ’10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press, Atlanta GA USA, 2513–2522. https://doi.org/10.1145/1753326.1753707",
      "doi": "10.1145/1753326.1753707"
    },
    {
      "text": "Bianca Maria Pirani. 2005. Body Rhythms, Social Rhythms in Digital Societies. Current Sociology 53, 2 (March 2005), 237–273. https://doi.org/10.1177/0011392105049539 Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Alisha Pradhan, Ben Jelen, Katie A Siek, Joel Chan, and Amanda Lazar. 2020. Understanding Older Adults’ Participation in Design Workshops. In CHI ’20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM Press, Honolulu, HI, USA, 15. https://doi.org/10.1145/3313831.3376299",
      "doi": "10.1145/3313831.3376299"
    },
    {
      "text": "Tauhidur Rahman, Alexander T. Adams, Ruth Vinisha Ravichandran, Mi Zhang, Shwetak N. Patel, Julie A. Kientz, and Tanzeem Choudhury. 2015. DoppleSleep: a contactless unobtrusive sleep sensing system using short-range Doppler radar. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’15. ACM Press, Osaka, Japan, 39–50. https://doi.org/10.1145/2750858.2804280 tex.ids= rahman_dopplesleep_2015-1.",
      "doi": "10.1145/2750858.2804280"
    },
    {
      "text": "Amon Rapp, Maurizio Tirassa, and Lia Tirabeni. 2019. Rethinking Technologies for Behavior Change: A View from the Inside of Human Change. ACM Transactions on Computer-Human Interaction 26, 4 (Aug. 2019), 1–30. https://doi.org/10.1145/3318142",
      "doi": "10.1145/3318142"
    },
    {
      "text": "Ruth Ravichandran, Sang-Wha Sien, Shwetak N. Patel, Julie A. Kientz, and Laura R. Pina. 2017. Making Sense of Sleep Sensors: How Sleep Sensing Technologies Support and Undermine Sleep Health. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 6864–6875. https://doi.org/10.1145/3025453.3025557",
      "doi": "10.1145/3025453.3025557"
    },
    {
      "text": "Sara Riggare. 2018. E-patients hold key to the future of healthcare. BMJ 360 (Feb. 2018). https://doi.org/10.1136/bmj.k846 tex.ids= riggare_e-patients_2018 ISBN: 0959-8138 publisher: British Medical Journal Publishing Group.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 1163–1172. https://doi.org/10.1145/2556288.2557039",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Minna Ruckenstein and Natasha Dow Schüll. 2017. The Datafication of Health. Annual Review of Anthropology 46, 1 (Oct. 2017), 261–278. https://doi.org/10.1146/annurev-anthro-102116-041244",
      "doi": ""
    },
    {
      "text": "Bettina Schmietow and Georg Marckmann. 2019. Mobile health ethics and the expanding role of autonomy. Medicine, Health Care and Philosophy 22, 4 (Dec. 2019), 623–630. https://doi.org/10.1007/s11019-019-09900-y",
      "doi": ""
    },
    {
      "text": "Donald A. Schön. 1992. Designing as reflective conversation with the materials of a design situation. Knowledge-based systems 5, 1 (1992), 3–14. https://doi.org/10.1016/0950-7051(92)90020-G ISBN: 0950-7051 Publisher: Elsevier.",
      "doi": "10.1016/0950-7051%2892%2990020-G"
    },
    {
      "text": "Herbert A. Simon. 1996. The Sciences of the Artificial(3rd ed.). MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/237774"
    },
    {
      "text": "B. Steger. 2003. Getting Away with Sleep–Social and Cultural Aspects of Dozing in Parliament. Social Science Japan Journal 6, 2 (Oct. 2003), 181–197. https://doi.org/10.1093/ssjj/6.2.181",
      "doi": ""
    },
    {
      "text": "Rosemary Steup, Paige White, Lynn Dombrowski, and Norman Makoto Su. 2022. \"A Reasonable Life\": Rhythmic Attunement and Sustainable Work at the Intersection of Farming and Knowledge Work. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2 (Nov. 2022), 1–22. https://doi.org/10.1145/3555577",
      "doi": "10.1145/3555577"
    },
    {
      "text": "Victor J. Strecher, Gerard H. Seijts, Gerjo J. Kok, Gary P. Latham, Russell Glasgow, Brenda DeVellis, Ree M. Meertens, and David W. Bulger. 1995. Goal setting as a strategy for health behavior change. Health education quarterly 22, 2 (1995), 190–200. ISBN: 0195-8402 Publisher: Sage Publications Sage CA: Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Selina Jeanne Sutton, Paul Foulkes, David Kirk, and Shaun Lawson. 2019. Voice as a Design Material: Sociophonetic Inspired Design Strategies in Human-Computer Interaction. In CHI ’19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM Press, Glasgow, Scotland, UK, 14. https://doi.org/10.1145/3290605.3300833",
      "doi": "10.1145/3290605.3300833"
    },
    {
      "text": "Marie Louise Juul Søndergaard. 2020. Troubling Design: A Design Program for Designing with Women’s Health. ACM Transactions on Computer-Human Interaction 27, 4 (Sept. 2020), 1–36. https://doi.org/10.1145/3397199 tex.ids= sondergaard_troubling_2020-1.",
      "doi": "10.1145/3397199"
    },
    {
      "text": "Marie Louise Juul Søndergaard, Ozgun Kilic Afsar, Marianela Ciolfi Felice, Nadia Campo Woytuk, and Madeline Balaam. 2020. Designing with Intimate Materials and Movements: Making \"Menarche Bits\". In DIS ’20: Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM Press, Eindhoven Netherlands, 587–600. https://doi.org/10.1145/3357236.3395592",
      "doi": "10.1145/3357236.3395592"
    },
    {
      "text": "Patricia Tassi and Alain Muzet. 2000. Sleep inertia. Sleep Medicine Reviews 4, 4 (Aug. 2000), 341–353. https://doi.org/10.1053/smrv.2000.0098",
      "doi": ""
    },
    {
      "text": "Vasiliki Tsaknaki, Kelsey Cotton, Pavel Karpashevich, and Pedro Sanches. 2021. “Feeling the Sensor Feeling you”: A Soma Design Exploration on Sensing Non-habitual Breathing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–16. https://doi.org/10.1145/3411764.3445628",
      "doi": "10.1145/3411764.3445628"
    },
    {
      "text": "Vasiliki Tsaknaki, Tom Jenkins, Laurens Boer, Sarah Homewood, Noura Howell, and Pedro Sanches. 2020. Challenges and Opportunities for Designing with Biodata as Material. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. ACM, Tallinn Estonia, 1–3. https://doi.org/10.1145/3419249.3420063",
      "doi": "10.1145/3419249.3420063"
    },
    {
      "text": "Toshimitsu Uchiyama and Russell Chess-Williams. 2004. Muscarinic receptor subtypes of the bladder and gastrointestinal tract. Journal of Smooth Muscle Research 40, 6 (2004), 237–247. https://doi.org/10.1540/jsmr.40.237",
      "doi": ""
    },
    {
      "text": "Anna Vallgårda and Johan Redström. 2007. Computational composites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 513–522. https://doi.org/10.1145/1240624.1240706",
      "doi": "10.1145/1240624.1240706"
    },
    {
      "text": "Wessel M. A. van Leeuwen, Claire Pekcan, Mike Barnett, and Göran Kecklund. 2021. Mathematical modelling of sleep and sleepiness under various watch keeping schedules in the maritime industry. Marine Policy 130 (Aug. 2021), 104277. https://doi.org/10.1016/j.marpol.2020.104277 tex.ids= van_leeuwen_mathematical_2021-1.",
      "doi": ""
    },
    {
      "text": "Loes van Renswouw, Steven Vos, Pieter van Wesemael, and Carine Lallemand. 2021. Exploring the Design Space of InterActive Urban Environments: triggering physical activity through embedded technology. In Designing Interactive Systems Conference 2021. ACM, Virtual Event USA, 955–969. https://doi.org/10.1145/3461778.3462137 tex.ids= van_renswouw_exploring_2021-1.",
      "doi": "10.1145/3461778.3462137"
    },
    {
      "text": "Runzhe Wan, Xinyu Zhang, and Rui Song. 2021. Multi-Objective Model-based Reinforcement Learning for Infectious Disease Control. In Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining. ACM, Virtual Event Singapore, 1634–1644. https://doi.org/10.1145/3447548.3467303",
      "doi": "10.1145/3447548.3467303"
    },
    {
      "text": "Noah Wardrip-Fruin. 2011. 14. Digital Media Archaeology: Interpreting Computational Processes. In Media Archaeology. University of California Press, 302–322. https://doi.org/10.1525/9780520948518-016",
      "doi": ""
    },
    {
      "text": "Thomas A. Wehr. 1992. In short photoperiods, human sleep is biphasic. Journal of Sleep Research 1, 2 (June 1992), 103–107. https://doi.org/10.1111/j.1365-2869.1992.tb00019.x",
      "doi": ""
    },
    {
      "text": "Kimberley Whitehead and Matthew Beaumont. 2018. Insomnia: a cultural history. The Lancet 391, 10138 (June 2018), 2408–2409. https://doi.org/10.1016/S0140-6736(18)31275-3",
      "doi": ""
    },
    {
      "text": "Marc Wittmann, Jenny Dinich, Martha Merrow, and Till Roenneberg. 2006. Social Jetlag: Misalignment of Biological and Social Time. Chronobiology International 23, 1-2 (Jan. 2006), 497–509. https://doi.org/10.1080/07420520500545979",
      "doi": ""
    },
    {
      "text": "Natalie T. Wood and Caroline Lego Muñoz. 2007. ‘No Rules, Just Right’ or is it? The Role of Themed Restaurants as Cultural Ambassadors. Tourism and Hospitality Research 7, 3-4 (Sept. 2007), 242–255. https://doi.org/10.1057/palgrave.thr.6050047",
      "doi": ""
    },
    {
      "text": "Paweł W. Woźniak, Przemysław Piotr Kucharski, Maartje M.A. de Graaf, and Jasmin Niess. 2020. Exploring Understandable Algorithms to Suggest Fitness Tracker Goals that Foster Commitment. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. ACM, Tallinn Estonia, 1–12. https://doi.org/10.1145/3419249.3420131",
      "doi": "10.1145/3419249.3420131"
    },
    {
      "text": "Rayoung Yang, Eunice Shin, Mark W. Newman, and Mark S. Ackerman. 2015. When fitness trackers don’t ’fit’: end-user difficulties in the assessment of personal tracking device accuracy. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’15. ACM Press, Osaka, Japan, 623–634. https://doi.org/10.1145/2750858.2804269 tex.ids= yang_when_2015-1, yang_when_2015-2.",
      "doi": "10.1145/2750858.2804269"
    },
    {
      "text": "Shikun Zhang, Florian Schaub, Yuanyuan Feng, and Norman Sadeh. 2019. “It Only Tells Me How I Slept, Not How to Fix It”: Exploring Sleep Behaviors and Opportunities for Sleep Technology. In Information in Contemporary Society(Lecture Notes in Computer Science), Natalie Greene Taylor, Caitlin Christian-Lamb, Michelle H. Martin, and Bonnie Nardi (Eds.). Springer International Publishing, Cham, 754–766. https://doi.org/10.1007/978-3-030-15742-5_71 tex.ids= zhang_it_2019-1.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Aaron Steinfeld, Anthony Tomasic, and Oscar J. Romero. 2022. Recentering Reframing as an RtD Contribution: The Case of Pivoting from Accessible Web Tables to a Conversational Internet. In CHI Conference on Human Factors in Computing Systems. ACM, New Orleans LA USA, 1–14. https://doi.org/10.1145/3491102.3517789 tex.ids= zimmerman_recentering_2022-1.",
      "doi": "10.1145/3491102.3517789"
    },
    {
      "text": "T. Åkerstedt, J. Axelsson, and G. Kecklund. 2007. Individual validation of model predictions of sleepiness and sleep hours. Somnologie - Schlafforschung und Schlafmedizin 11, 3 (Sept. 2007), 169–174. https://doi.org/10.1007/s11818-007-0315-7",
      "doi": ""
    },
    {
      "text": "Torbjörn Åkerstedt, Jennie Connor, Andrew Gray, and Göran Kecklund. 2008. Predicting road crashes from a mathematical model of alertness regulation—The Sleep/Wake Predictor. Accident Analysis & Prevention 40, 4 (July 2008), 1480–1485. https://doi.org/10.1016/j.aap.2008.03.016",
      "doi": ""
    }
  ]
}