{
  "doi": "10.1145/3544548.3581074",
  "title": "Cultural Differences in Friendship Network Behaviors: A Snapchat Case Study",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Culture shapes people’s behavior, both online and offline. Surprisingly, there is sparse research on how cultural context affects network formation and content consumption on social media. We analyzed the friendship networks and dyadic relations between content producers and consumers across 73 countries through a cultural lens in a closed-network setting. Closed networks allow for intimate bonds and self-expression, providing a natural setting to study cultural differences in behavior. We studied three theoretical frameworks of culture - individualism, relational mobility, and tightness. We found that friendship networks formed across different cultures differ in egocentricity, meaning the connectedness between a user’s friends. Individualism, mobility, and looseness also significantly negatively impact how tie strength affects content consumption. Our findings show how culture affects social media behavior, and we outline how researchers can incorporate this in their work. Our work has implications for content recommendations and can improve content engagement.",
  "authors": [
    {
      "name": "Agrima Seth",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782093",
      "orcid": "0000-0001-8547-6304"
    },
    {
      "name": "Jiyin Cao",
      "institution": "Stony Brook University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660375236",
      "orcid": "0000-0003-0227-3697"
    },
    {
      "name": "Xiaolin Shi",
      "institution": "Snap Inc., United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361595824",
      "orcid": "0000-0002-3705-1552"
    },
    {
      "name": "Ron Dotsch",
      "institution": "Research, Snap Inc., United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782995",
      "orcid": "0000-0002-3429-660X"
    },
    {
      "name": "Yozen Liu",
      "institution": "Snap Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659575245",
      "orcid": "0000-0002-2107-504X"
    },
    {
      "name": "Maarten W. Bos",
      "institution": "Snap Inc., United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366383",
      "orcid": "0000-0001-5020-4990"
    }
  ],
  "references": [
    {
      "text": "Glenn Adams and Victoria C Plaut. 2003. The cultural grounding of personal relationship: Friendship in North American and West African worlds. Personal Relationships 10, 3 (2003), 333–347.",
      "doi": ""
    },
    {
      "text": "Khaled Saleh Al Omoush, Saad Ghaleb Yaseen, and Mohammad Atwah Alma’Aitah. 2012. The impact of Arab cultural values on online social networking: The case of Facebook. Computers in Human Behavior 28, 6 (2012), 2387–2399.",
      "doi": "10.1016/j.chb.2012.07.010"
    },
    {
      "text": "Saleem Alhabash and Mengyan Ma. 2017. A tale of four platforms: Motivations and uses of Facebook, Twitter, Instagram, and Snapchat among college students?Social media+ society 3, 1 (2017), 2056305117691544.",
      "doi": ""
    },
    {
      "text": "Dhoha A Alsaleh, Michael T Elliott, Frank Q Fu, and Ramendra Thakur. 2019. Cross-cultural differences in the adoption of social media. Journal of Research in Interactive Marketing (2019).",
      "doi": ""
    },
    {
      "text": "Valerio Arnaboldi, Andrea Guazzini, and Andrea Passarella. 2013. Egocentric online social networks: Analysis of key features and prediction of tie strength in Facebook. Computer Communications 36, 10-11 (2013), 1130–1144.",
      "doi": ""
    },
    {
      "text": "Joseph B Bayer, Nicole B Ellison, Sarita Y Schoenebeck, and Emily B Falk. 2016. Sharing the small moments: ephemeral social interaction on Snapchat. Information, Communication & Society 19, 7 (2016), 956–977.",
      "doi": ""
    },
    {
      "text": "Agata Błachnio, Aneta Przepiorka, Martina Benvenuti, Davide Cannata, Adela M Ciobanu, Emre Senol-Durak, Mithat Durak, Michail N Giannakos, Elvis Mazzoni, Ilias O Pappas, 2016. Cultural and personality predictors of Facebook intrusion: a cross-cultural study. Frontiers in Psychology 7 (2016), 1895.",
      "doi": ""
    },
    {
      "text": "Robert M Bond, Christopher J Fariss, Jason J Jones, Adam DI Kramer, Cameron Marlow, Jaime E Settle, and James H Fowler. 2012. A 61-million-person experiment in social influence and political mobilization. Nature 489, 7415 (2012), 295–298.",
      "doi": ""
    },
    {
      "text": "Brent Barnhart. 2022. Social media demographics to inform your brand’s strategy in 2022. https://sproutsocial.com/insights/new-social-media-demographics/#facebook-demographics, Last accessed on 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Brent Barnhart. 2022. Social media demographics to inform your brand’s strategy in 2022. https://sproutsocial.com/insights/new-social-media-demographics/#snapchat-demographics, Last accessed on 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Mehmet Civelek, Krzysztof Gajdka, Jaroslav Světlík, and Vladimír Vavrečka. 2020. Differences in the usage of online marketing and social media tools: evidence from Czech, Slovakian and Hungarian SMEs. Equilibrium. Quarterly Journal of Economics and Economic Policy 15, 3(2020), 537–563.",
      "doi": ""
    },
    {
      "text": "Gabor Csardi and Tamas Nepusz. 2006. The igraph software package for complex network research. InterJournal Complex Systems (2006), 1695. https://igraph.org",
      "doi": ""
    },
    {
      "text": "José Manuel Errasti Pérez, Isaac Amigo Vázquez, José Manuel Villadangos Fernández, Joaquín Morís Fernández, 2018. Differences between individualist and collectivist cultures in emotional Facebook usage: Relationship with empathy, self-esteem, and narcissism. Psicothema (2018).",
      "doi": ""
    },
    {
      "text": "Silvia Elena Gallagher and Timothy Savage. 2013. Cross-cultural analysis in online community research: A literature review. Computers in Human Behavior 29, 3 (2013), 1028–1038.",
      "doi": "10.1016/j.chb.2012.09.011"
    },
    {
      "text": "Michele J Gelfand, Jana L Raver, Lisa Nishii, Lisa M Leslie, Janetta Lun, Beng Chong Lim, Lili Duan, Assaf Almaliach, Soon Ang, Jakobina Arnadottir, 2011. Differences between tight and loose cultures: A 33-nation study. science 332, 6033 (2011), 1100–1104.",
      "doi": ""
    },
    {
      "text": "Robin Goodwin. 2013. Personal relationships across cultures. Routledge.",
      "doi": ""
    },
    {
      "text": "Mark S Granovetter. 1973. The strength of weak ties. American journal of sociology 78, 6 (1973), 1360–1380.",
      "doi": ""
    },
    {
      "text": "Manjul Gupta, Irem Uz, Pouyan Esmaeilzadeh, Fabrizio Noboa, Abeer A Mahrous, Eojina Kim, Graca Miranda, Vanesa M Tennant, Sean Chung, Akbar Azam, 2018. Do cultural norms affect social network behavior inappropriateness? A global study. Journal of Business Research 85 (2018), 10–22.",
      "doi": ""
    },
    {
      "text": "Arnon Hershkovitz and Zack Hayat. 2020. The role of tie strength in assessing credibility of scientific content on Facebook. Technology in Society 61(2020), 101261.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 2001. Culture’s consequences: Comparing values, behaviors, institutions and organizations across nations. Sage publications.",
      "doi": ""
    },
    {
      "text": "Tasuku Igarashi, Yoshihisa Kashima, Emiko S Kashima, Tomas Farsides, Uichol Kim, Fritz Strack, Lioba Werth, and Masaki Yuki. 2008. Culture, trust, and social networks. Asian Journal of Social Psychology 11, 1 (2008), 88–101.",
      "doi": ""
    },
    {
      "text": "International Monetary Fund. 2022. Global economy on firmer ground, but with divergent recoveries amid high uncertainty. https://www.imf.org/en/Publications/WEO/Issues/2021/03/23/world-economic-outlook-april-2021, Last accessed on 2022-09-12.",
      "doi": ""
    },
    {
      "text": "Parisa Kaghazgaran, Maarten Bos, Leonardo Neves, and Neil Shah. 2020. Social factors in closed-network content consumption. In Proceedings of the 29th ACM International Conference on Information & Knowledge Management. 595–604.",
      "doi": "10.1145/3340531.3411935"
    },
    {
      "text": "Nicole C Krämer, Vera Sauer, and Nicole Ellison. 2021. The strength of weak ties revisited: further evidence of the role of strong ties in the provision of online social support. Social Media+ Society 7, 2 (2021), 20563051211024958.",
      "doi": ""
    },
    {
      "text": "Piper Liping Liu and Tien Ee Dominic Yeo. 2022. Weak ties matter: Social network dynamics of mobile media multiplexity and their impact on the social support and psychological well-being experienced by migrant workers. Mobile Media & Communication 10, 1 (2022), 76–96.",
      "doi": ""
    },
    {
      "text": "Hazel R Markus and Shinobu Kitayama. 1991. Culture and the self: Implications for cognition, emotion, and motivation.Psychological review 98, 2 (1991), 224.",
      "doi": ""
    },
    {
      "text": "Ferenc Moksony and Rita Heged. 1990. Small is beautiful. The use and interpretation of R2 in social research. Szociológiai Szemle, Special issue(1990), 130–138.",
      "doi": ""
    },
    {
      "text": "Jinkyung Na, Michal Kosinski, and David J Stillwell. 2015. When a new tool is introduced in different cultural contexts: Individualism–collectivism and social network on Facebook. Journal of Cross-Cultural Psychology 46, 3 (2015), 355–370.",
      "doi": ""
    },
    {
      "text": "Thuan Si Nguyen. 2015. Using Geert Hofstede’s cultural dimensions to describe and to analyze cultural differences between first generation and second generation Vietnamese in the Vietnamese Church in America. Nyack College, Alliance Theological Seminary.",
      "doi": ""
    },
    {
      "text": "Michael Obal and Werner Kunz. 2016. Cross-cultural differences in uses of online experts. Journal of Business Research 69, 3 (2016), 1148–1156.",
      "doi": ""
    },
    {
      "text": "Katrina Panovich, Rob Miller, and David Karger. 2012. Tie strength in question & answer on social network sites. In Proceedings of the ACM 2012 conference on computer supported cooperative work. 1057–1066.",
      "doi": "10.1145/2145204.2145361"
    },
    {
      "text": "Sachin R Pendse, Kate Niederhoffer, and Amit Sharma. 2019. Cross-Cultural Differences in the Use of Online Mental Health Support Forums. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–29.",
      "doi": "10.1145/3359169"
    },
    {
      "text": "PEW RESEARCH CENTER. 2006. The Strength of Internet Ties. https://www.pewresearch.org/internet/2006/01/25/the-strength-of-internet-ties/, Last accessed on 2022-09-12.",
      "doi": ""
    },
    {
      "text": "Joe Phua, Seunga Venus Jin, and Jihoon Jay Kim. 2017. Uses and gratifications of social networking sites for bridging and bonding social capital: A comparison of Facebook, Twitter, Instagram, and Snapchat. Computers in human behavior 72 (2017), 115–122.",
      "doi": ""
    },
    {
      "text": "Lukasz Piwek and Adam Joinson. 2016. “What do they snapchat about?” Patterns of use in time-limited instant messaging service. Computers in human behavior 54 (2016), 358–367.",
      "doi": "10.1016/j.chb.2015.08.026"
    },
    {
      "text": "Annu Sible Prabhakar, Elena Maris, and Indrani Medhi Thies. 2021. Toward Understanding the Cultural Influences on Social Media Use of Middle Class Mothers in India. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": ""
    },
    {
      "text": "Catherine Raeff, Patricia Marks Greenfield, and Blanca Quiroz. 2000. Conceptualizing interpersonal relationships in the cultural contexts of individualism and collectivism. New directions for child and adolescent development 2000, 87(2000), 59–74.",
      "doi": ""
    },
    {
      "text": "Ross Schuchard, Andrew Crooks, Anthony Stefanidis, and Arie Croitoru. 2018. Bots in nets: empirical comparative analysis of bot evidence in social networks. In International Conference on Complex Networks and their Applications. Springer, 424–436.",
      "doi": ""
    },
    {
      "text": "Pavica Sheldon, Erna Herzfeldt, and Philipp A Rauschnabel. 2020. Culture and social media: the relationship between cultural values and hashtagging styles. Behaviour & Information Technology 39, 7 (2020), 758–770.",
      "doi": ""
    },
    {
      "text": "Richard A Shweder, Jonathan Haidt, Randall Horton, and Craig Joseph. 1993. The cultural psychology of the emotions. Handbook of emotions(1993), 417–431.",
      "doi": ""
    },
    {
      "text": "Statista. 2022. Number of daily active Snapchat users from 1st quarter 2014 to 2nd quarter 2022. https://www.statista.com/statistics/545967/snapchat-app-dau/, Last accessed on 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Statista. 2022. Number of social media users worldwide from 2018 to 2022, with forecasts from 2023 to 2027. https://www.statista.com/statistics/278414/number-of-worldwide-social-network-users/, Last accessed on 2022-09-12.",
      "doi": ""
    },
    {
      "text": "Jiaming Sun and Xun Wang. 2010. Value differences between generations in China: A study in Shanghai. Journal of Youth Studies 13, 1 (2010), 65–81.",
      "doi": ""
    },
    {
      "text": "Thomas Talhelm, Xiao Zhang, Shige Oishi, Chen Shimin, Dechao Duan, Xiaoli Lan, and Shinobu Kitayama. 2014. Large-scale psychological differences within China explained by rice versus wheat agriculture. Science 344, 6184 (2014), 603–608.",
      "doi": ""
    },
    {
      "text": "The World Bank. 2022. Gini Index. https://data.worldbank.org/indicator/SI.POV.GINI, Last accessed on 2022-09-12.",
      "doi": ""
    },
    {
      "text": "Robert Thomson, Masaki Yuki, Thomas Talhelm, Joanna Schug, Mie Kito, Arin H Ayanian, Julia C Becker, Maja Becker, Chi-yue Chiu, Hoon-Seok Choi, 2018. Relational mobility predicts social behaviors in 39 countries and is tied to historical farming and threat. Proceedings of the National Academy of Sciences 115, 29(2018), 7521–7526.",
      "doi": ""
    },
    {
      "text": "William B Gudykunst Stella Ting-Toomeyand Tsukasa Nishida. 1996. Communication in personal relationships across cultures. Sage.",
      "doi": ""
    },
    {
      "text": "Joshua Uyheng and Kathleen M Carley. 2020. Bots and online hate during the COVID-19 pandemic: case studies in the United States and the Philippines. Journal of computational social science 3, 2 (2020), 445–468.",
      "doi": ""
    },
    {
      "text": "Brian Uzzi. 1999. Embeddedness in the making of financial capital: How social relations and networks benefit firms seeking financing. American sociological review(1999), 481–505.",
      "doi": ""
    },
    {
      "text": "J Mitchell Vaterlaus, Kathryn Barnett, Cesia Roche, and Jimmy A Young. 2016. “Snapchat is more personal”: An exploratory study on Snapchat behaviors and young adult interpersonal relationships. Computers in Human Behavior 62 (2016), 594–601.",
      "doi": "10.1016/j.chb.2016.04.029"
    },
    {
      "text": "Alan Warde and Gindo Tampubolon. 2002. Social capital, networks and leisure consumption. The Sociological Review 50, 2 (2002), 155–180.",
      "doi": ""
    },
    {
      "text": "Lilian Weng, Márton Karsai, Nicola Perra, Filippo Menczer, and Alessandro Flammini. 2018. Attention on weak ties in social and communication networks. In Complex spreading phenomena in social systems. Springer, 213–228.",
      "doi": ""
    },
    {
      "text": "Naomi Whiteside, Torgeir Aleti, Jason Pallant, John Zeleznikow, 2018. Helpful or harmful? Exploring the impact of social media usage on intimate relationships. Australasian Journal of Information Systems 22 (2018).",
      "doi": ""
    },
    {
      "text": "REBECCA P. YU, RYAN J. MCCAMMON, NICOLE B. ELLISON, and KENNETH M. LANGA. 2016. The relationships that matter: social network site use and social wellbeing among older adults in the United States of America. Ageing and Society 36, 9 (2016), 1826–1852. https://doi.org/10.1017/S0144686X15000677",
      "doi": ""
    },
    {
      "text": "Masaki Yuki and Joanna Schug. 2020. Psychological consequences of relational mobility. Current opinion in psychology 32 (2020), 129–132.",
      "doi": ""
    }
  ]
}