{
  "doi": "10.1145/3544548.3581564",
  "title": "Work with AI and Work for AI: Autonomous Vehicle Safety Drivers’ Lived Experiences",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "The development of Autonomous Vehicle (AV) has created a novel job, the safety driver, recruited from experienced drivers to supervise and operate AV in numerous driving missions. Safety drivers usually work with non-perfect AV in high-risk real-world traffic environments for road testing tasks. However, this group of workers is under-explored in the HCI community. To fill this gap, we conducted semi-structured interviews with 26 safety drivers. Our results present how safety drivers cope with defective algorithms and shape and calibrate their perceptions while working with AV. We found that, as front-line workers, safety drivers are forced to take risks accumulated from the AV industry upstream and are also confronting restricted self-development in working for AV development. We contribute the first empirical evidence of the lived experience of safety drivers, the first passengers in the development of AV, and also the grassroots workers for AV, which can shed light on future human-AI interaction research.",
  "tags": [
    "AI perception",
    "responsible AI",
    "human-AI interaction",
    "autonomous driving",
    "AI labor"
  ],
  "authors": [
    {
      "name": "Mengdi Chu",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778693",
      "orcid": "0000-0003-0533-7801"
    },
    {
      "name": "Keyu Zong",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779708",
      "orcid": "0000-0003-0927-6129"
    },
    {
      "name": "Xin Shu",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783174",
      "orcid": "0000-0002-8898-9698"
    },
    {
      "name": "Jiangtao Gong",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82658964757",
      "orcid": "0000-0002-4310-1894"
    },
    {
      "name": "Zhicong Lu",
      "institution": "Department of Computer Science, City University of Hong Kong, China",
      "img": "/do/10.1145/contrib-99659162049/rel-imgonly/photo.jpg",
      "acmid": "99659162049",
      "orcid": "0000-0002-7761-6351"
    },
    {
      "name": "Kaimin Guo",
      "institution": "Tsinghua university, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783806",
      "orcid": "0000-0002-7381-8925"
    },
    {
      "name": "Xinyi Dai",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782895",
      "orcid": "0000-0001-7718-5259"
    },
    {
      "name": "Guyue Zhou",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660556271",
      "orcid": "0000-0002-3894-9858"
    }
  ],
  "references": [
    {
      "text": "Amirul Ibrahim Abu Bakar, Mohd Azman Abas, Mohd Farid Muhamad Said, and Tengku Azrul Tengku Azhar. 2022. Synthesis of Autonomous Vehicle Guideline for Public Road-Testing Sustainability. Sustainability 14, 3 (2022), 1456.",
      "doi": ""
    },
    {
      "text": "Eugen Altendorf, Constanze Schreck, Gina Weßel, Yigiterkut Canpolat, and Frank Flemisch. 2019. Utility assessment in automated driving for cooperative human–machine systems. Cognition, Technology & Work 21, 4 (2019), 607–619.",
      "doi": "10.1007/s10111-019-00557-4"
    },
    {
      "text": "Robert W Andrews, J Mason Lilly, Divya Srivastava, and Karen M Feigh. 2022. The role of shared mental models in human-AI teams: a theoretical review. Theoretical Issues in Ergonomics Science(2022), 1–47.",
      "doi": ""
    },
    {
      "text": "Verena Bader and Stephan Kaiser. 2019. Algorithmic decision-making? The user interface and its role for human involvement in decisions supported by artificial intelligence. Organization 26, 5 (2019), 655–672.",
      "doi": ""
    },
    {
      "text": "Ronald M. Baecker. 2019. Automation, work, and jobs. Computers and Society(2019).",
      "doi": ""
    },
    {
      "text": "SJ Baltrusch, F Krause, AW de Vries, W van Dijk, and MP de Looze. 2022. What about the Human in Human Robot Collaboration? A literature review on HRC’s effects on aspects of job quality. Ergonomics 65, 5 (2022), 719–740.",
      "doi": ""
    },
    {
      "text": "Marcel Baltzer, Eugen Altendorf, Sonja Meier, Frank Flemisch, N Stanton, S Landry, GD Bucchianico, and A Vallicelli. 2014. Mediating the interaction between human and automation during the arbitration processes in cooperative guidance and control of highly automated vehicles: basic concept and first study. Advances in Human Aspects of Transportation Part I (2014), 439–450.",
      "doi": ""
    },
    {
      "text": "Victoria Banks, Emily Shaw, and David R Large. 2018. Keeping the driver in the loop: The ‘Other’ethics of automation. In Congress of the International Ergonomics Association. Springer, 70–79.",
      "doi": ""
    },
    {
      "text": "Mark J Brosnan. 2002. Technophobia: The psychological impact of information technology. Routledge.",
      "doi": ""
    },
    {
      "text": "EunJeong Cheon, Cristina Zaga, Hee Rin Lee, Maria Luce Lupetti, Lynn Dombrowski, and Malte F Jung. 2021. Human-Machine Partnerships in the Future of Work: Exploring the Role of Emerging Technologies in Future Workplaces. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing. 323–326.",
      "doi": ""
    },
    {
      "text": "Torkil Clemmensen and Torkil Clemmensen. 2021. Socio-Technical HCI Design in a Wider Context. Human Work Interaction Design: A Platform for Theory and Action (2021), 267–280.",
      "doi": ""
    },
    {
      "text": "Mark Coeckelbergh. 2020. Artificial intelligence, responsibility attribution, and a relational justification of explainability. Science and engineering ethics 26, 4 (2020), 2051–2068.",
      "doi": ""
    },
    {
      "text": "Mark Colley, Christian Bräuner, Mirjam Lanzer, Marcel Walch, Martin R. K. Baumann, and Enrico Rukzio. 2020. Effect of Visualization of Pedestrian Intention Recognition on Trust and Cognitive Load. 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(2020).",
      "doi": ""
    },
    {
      "text": "SAE On-Road Automated Vehicle Standards Committee 2014. Taxonomy and definitions for terms related to on-road motor vehicle automated driving systems. SAE Standard J 3016(2014), 1–16.",
      "doi": ""
    },
    {
      "text": "Laura Crompton. 2021. The decision-point-dilemma: Yet another problem of responsibility in human-AI interaction. Journal of Responsible Technology 7 (2021), 100013.",
      "doi": ""
    },
    {
      "text": "Mitchell Cunningham and Michael A Regan. 2015. Autonomous vehicles: human factors issues and future research. In Proceedings of the 2015 Australasian Road safety conference, Vol. 14.",
      "doi": ""
    },
    {
      "text": "Allan Dafoe, Yoram Bachrach, Gillian Hadfield, Eric Horvitz, Kate Larson, and Thore Graepel. 2021. Cooperative AI: machines must learn to find common ground.",
      "doi": ""
    },
    {
      "text": "Mustafa Demir, Aaron D Likens, Nancy J Cooke, Polemnia G Amazeen, and Nathan J McNeese. 2018. Team coordination and effectiveness in human-autonomy teaming. IEEE Transactions on Human-Machine Systems 49, 2 (2018), 150–159.",
      "doi": ""
    },
    {
      "text": "Nachiket Deo and Mohan M Trivedi. 2019. Looking at the driver/rider in autonomous vehicles to predict take-over readiness. IEEE Transactions on Intelligent Vehicles 5, 1 (2019), 41–52.",
      "doi": ""
    },
    {
      "text": "Nachiket Deo and Mohan Manubhai Trivedi. 2020. Looking at the Driver/Rider in Autonomous Vehicles to Predict Take-Over Readiness. IEEE Transactions on Intelligent Vehicles 5 (2020), 41–52.",
      "doi": ""
    },
    {
      "text": "Taşkın Dirsehan and Ceren Can. 2020. Examination of trust and sustainability concerns in autonomous vehicle adoption. Technology in Society 63(2020), 101361.",
      "doi": ""
    },
    {
      "text": "Vinayak V. Dixit, Sai Chand, and Divya Jayakumar Nair. 2016. Autonomous Vehicles: Disengagements, Accidents and Reaction Times. PLoS ONE 11(2016).",
      "doi": ""
    },
    {
      "text": "Mitch Downey. 2021. Partial automation and the technology-enabled deskilling of routine jobs. Labour Economics 69(2021), 101973.",
      "doi": ""
    },
    {
      "text": "Dániel A Drexler, Arpád Takács, Tamás D Nagy, and Tamás Haidegger. 2019. Handover Process of Autonomous Vehicles-technology and application challenges. Acta Polytechnica Hungarica 16, 9 (2019), 235–255.",
      "doi": ""
    },
    {
      "text": "Yuemeng Du, Jingyan Qin, Shujing Zhang, Sha Cao, and Jinhua Dou. 2018. Voice User Interface Interaction Design Research Based on User Mental Model in Autonomous Vehicle. In HCI.",
      "doi": ""
    },
    {
      "text": "Charles Duhigg. 2016. What Google learned from its quest to build the perfect team. The New York Times Magazine 26, 2016 (2016), 2016.",
      "doi": ""
    },
    {
      "text": "Mahdi Ebnali, Cyrus Kian, Majid Ebnali-Heidari, and Adel Mazloumi. 2019. User experience in immersive VR-based serious game: an application in highly automated driving training. In International Conference on Applied Human Factors and Ergonomics. Springer, 133–144.",
      "doi": ""
    },
    {
      "text": "Fredrick Ekman, Mikael Johansson, and Jana Sochor. 2016. Creating Appropriate Trust for Autonomous Vehicle Systems: A Framework for HMI Design.",
      "doi": ""
    },
    {
      "text": "Oswald Mesumbe Ekwoge, Awdren Fontão, and Arilo C Dias-Neto. 2017. Tester experience: concept, issues and definition. In 2017 ieee 41st annual computer software and applications conference (compsac), Vol. 1. IEEE, 208–213.",
      "doi": ""
    },
    {
      "text": "Madeleine Gibson, John Lee, Vindhya Venkatraman, Morgan Price, Jeffrey Lewis, Olivia Montgomery, Bilge Mutlu, Joshua Domeyer, and James Foley. 2016. Situation awareness, scenarios, and secondary tasks: measuring driver performance and safety margins in highly automated vehicles. SAE International Journal of Passenger Cars-Electronic and Electrical Systems 9, 1 (2016), 237–243.",
      "doi": ""
    },
    {
      "text": "Balint Gyevnar, Massimiliano Tamborski, Cheng-Hsien Wang, Christopher G. Lucas, Shay B. Cohen, and Stefano V. Albrecht. 2022. A Human-Centric Method for Generating Causal Explanations in Natural Language for Autonomous Vehicle Motion Planning. ArXiv abs/2206.08783(2022).",
      "doi": ""
    },
    {
      "text": "Michelle Hester, Kevin Lee, and Brian P. Dyre. 2017. “Driver Take Over”: A Preliminary Exploration of Driver Trust and Performance in Autonomous Vehicles. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 61(2017), 1969 – 1973.",
      "doi": ""
    },
    {
      "text": "Charles P. Hewitt, Ioannis Politis, Theocharis Amanatidis, and Advait Sarkar. 2019. Assessing public perception of self-driving cars: the autonomous vehicle acceptance model. Proceedings of the 24th International Conference on Intelligent User Interfaces (2019).",
      "doi": "10.1145/3301275.3302268"
    },
    {
      "text": "Gaojian Huang and Brandon Pitts. 2020. Age-related differences in takeover request modality preferences and attention allocation during semi-autonomous driving. In International Conference on Human-Computer Interaction. Springer, 135–146.",
      "doi": "10.1007/978-3-030-50252-2_11"
    },
    {
      "text": "Michael Huesemann and Joyce Huesemann. 2011. Techno-fix: why technology won’t save us or the environment. New Society Publishers.",
      "doi": ""
    },
    {
      "text": "Nidhi Kalra and Susan M. Paddock. 2016. Driving to safety: How many miles of driving would it take to demonstrate autonomous vehicle reliability?Transportation Research Part A-policy and Practice 94 (2016), 182–193.",
      "doi": ""
    },
    {
      "text": "Hannu Karvonen, Iina Aaltonen, Mikael Wahlström, Leena Salo, Paula Savioja, and Leena Norros. 2011. Hidden roles of the train driver: A challenge for metro automation. Interacting with computers 23, 4 (2011), 289–298.",
      "doi": ""
    },
    {
      "text": "Hyung Jun Kim and Ji Hyun Yang. 2017. Takeover requests in simulated partially autonomous vehicles considering human factors. IEEE Transactions on Human-Machine Systems 47, 5 (2017), 735–740.",
      "doi": ""
    },
    {
      "text": "Jungsook Kim, Hyunsuk Kim, Woojin Kim, and Daesub Yoon. 2018. Take-over performance analysis depending on the drivers’ non-driving secondary tasks in automated vehicles. 2018 International Conference on Information and Communication Technology Convergence (ICTC) (2018), 1364–1366.",
      "doi": ""
    },
    {
      "text": "Anirudh Kishore Bhoopalam, Roy van den Berg, Niels Agatz, and Caspar Chorus. 2021. The long road to automated trucking: Insights from driver focus groups. Roy and Agatz, Niels AH and Chorus, Caspar, The Long Road to Automated Trucking: Insights from Driver Focus Groups (February 4, 2021) (2021).",
      "doi": ""
    },
    {
      "text": "Jeamin Koo, Jungsuk Kwac, Wendy Ju, Martin Steinert, Larry J. Leifer, and Clifford Nass. 2015. Why did my car just do that? Explaining semi-autonomous driving actions to improve driver understanding, trust, and performance. International Journal on Interactive Design and Manufacturing (IJIDeM) 9 (2015), 269–275.",
      "doi": ""
    },
    {
      "text": "Jiin-in Lee, Na-eun Kim, and Jin-woo Kim. 2017. A study on driver experience in autonomous car based on trust and distrust model of automation system. Journal of Digital Contents Society 18, 4 (2017), 713–722.",
      "doi": ""
    },
    {
      "text": "Y. Li, Dihua Sun, Min Zhao, Dong Chen, Senlin Cheng, and Fei Xie. 2018. Switched Cooperative Driving Model towards Human Vehicle Copiloting Situation: A Cyberphysical Perspective. Journal of Advanced Transportation 2018 (2018), 1–11.",
      "doi": ""
    },
    {
      "text": "Claire Liang, Julia Proft, Erik Andersen, and Ross A Knepper. 2019. Implicit communication of actionable information in human-ai teams. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300325"
    },
    {
      "text": "Patrick Lindemann, Tae-Young Lee, and Gerhard Rigoll. 2018. Catch My Drift: Elevating Situation Awareness for Highly Automated Driving with an Explanatory Windshield Display User Interface. Multimodal Technol. Interact. 2 (2018), 71.",
      "doi": ""
    },
    {
      "text": "Robert E Llaneras, Brad R Cannon, and Charles A Green. 2017. Strategies to assist drivers in remaining attentive while under partially automated driving: Verification of human–machine interface concepts. Transportation research record 2663, 1 (2017), 20–26.",
      "doi": ""
    },
    {
      "text": "Duri Long and Brian Magerko. 2020. What is AI literacy? Competencies and design considerations. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–16.",
      "doi": "10.1145/3313831.3376727"
    },
    {
      "text": "Joseph B. Lyons. 2013. Being Transparent about Transparency: A Model for Human-Robot Interaction. In AAAI Spring Symposium: Trust and Autonomous Systems.",
      "doi": ""
    },
    {
      "text": "Ioannis Magnisalis, Stavros Demetriadis, and Anastasios Karakostas. 2011. Adaptive and intelligent systems for collaborative learning support: A review of the field. IEEE transactions on Learning Technologies 4, 1 (2011), 5–20.",
      "doi": ""
    },
    {
      "text": "Moira Maguire and Brid Delahunt. 2017. Doing a thematic analysis: A practical, step-by-step guide for learning and teaching scholars.All Ireland Journal of Higher Education 9, 3 (2017).",
      "doi": ""
    },
    {
      "text": "Sotiris Makris, Panagiotis Karagiannis, Spyridon Koukas, and Aleksandros-Stereos Matthaiakis. 2016. Augmented reality system for operator support in human–robot collaborative assembly. CIRP Annals 65, 1 (2016), 61–64.",
      "doi": ""
    },
    {
      "text": "James Manyika, Susan Lund, Michael Chui, Jacques Bughin, Jonathan Woetzel, Parul Batra, Ryan Ko, and Saurabh Sanghvi. 2017. Jobs lost, jobs gained: Workforce transitions in a time of automation. McKinsey Global Institute 150 (2017).",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on human-computer interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Daniel V McGehee, Mark Brewer, Chris Schwarz, Bryant Walker Smith, 2016. Review of automated vehicle technology: policy and implementation implications.Technical Report. Iowa. Dept. of Transportation.",
      "doi": ""
    },
    {
      "text": "Seamus McGuinness, John Will Freebairn, and Kostas G Mavromaras. 2008. Characteristics of minimum wage employees. Australian Fair Pay Commission.",
      "doi": ""
    },
    {
      "text": "Raissa Pokam Meguia, Serge Debernard, Christine Chauvin, and Sabine Langlois. 2019. Principles of transparency for autonomous vehicles: first results of an experiment with an augmented reality human–machine interface. Cognition, Technology & Work(2019), 1–14.",
      "doi": ""
    },
    {
      "text": "Adam Millard‐Ball. 2016. Pedestrians, Autonomous Vehicles, and Cities. Journal of Planning Education and Research 38 (2016), 12 – 6.",
      "doi": ""
    },
    {
      "text": "Alexander G Mirnig, Philipp Wintersberger, Christine Sutter, and Jürgen Ziegler. 2016. A framework for analyzing and calibrating trust in automated vehicles. In Adjunct proceedings of the 8th international conference on automotive user interfaces and interactive vehicular applications. 33–38.",
      "doi": "10.1145/3004323.3004326"
    },
    {
      "text": "Brian Mok, Mishel Johns, Key Jung Lee, David Miller, David Sirkin, Page Ive, and Wendy Ju. 2015. Emergency, automation off: Unstructured transition timing for distracted drivers of automated vehicles. In 2015 IEEE 18th international conference on intelligent transportation systems. IEEE, 2458–2464.",
      "doi": "10.1109/ITSC.2015.396"
    },
    {
      "text": "António Moniz and Bettina-Johanna Krings. 2014. Technology assessment approach to human-robot interactions in work environments. In 2014 7th International Conference on Human System Interactions (HSI). IEEE, 282–289.",
      "doi": ""
    },
    {
      "text": "Shane T Mueller, Robert R Hoffman, William Clancey, Abigail Emrey, and Gary Klein. 2019. Explanation in human-AI systems: A literature meta-review, synopsis of key ideas and publications, and bibliography for explainable AI. arXiv preprint arXiv:1902.01876(2019).",
      "doi": ""
    },
    {
      "text": "Michael Muller, Christine T Wolf, Josh Andres, Michael Desmond, Narendra Nath Joshi, Zahra Ashktorab, Aabhas Sharma, Kristina Brimijoin, Qian Pan, Evelyn Duesterwald, 2021. Designing ground truth and the social life of labels. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445402"
    },
    {
      "text": "Lisa Orii, Diana Tosca, Andrew L Kun, and Orit Shaer. 2021. Perceptions on the Future of Automation in r/Truckers. In Extended abstracts of the 2021 CHI conference on human factors in computing systems. 1–6.",
      "doi": ""
    },
    {
      "text": "Scott Ososky, David Schuster, Florian Jentsch, Stephen Fiore, Randall Shumaker, Christian Lebiere, Unmesh Kurup, Jean Oh, and Anthony Stentz. 2012. The importance of shared mental models and shared situation awareness for transforming robots from tools to teammates. In Unmanned systems technology XIV, Vol. 8387. SPIE, 397–408.",
      "doi": ""
    },
    {
      "text": "Lawrence A Palinkas, Sarah M Horwitz, Carla A Green, Jennifer P Wisdom, Naihua Duan, and Kimberly Hoagwood. 2015. Purposeful sampling for qualitative data collection and analysis in mixed method implementation research. Administration and policy in mental health and mental health services research 42, 5 (2015), 533–544.",
      "doi": ""
    },
    {
      "text": "Ilias E. Panagiotopoulos, George J. Dimitrakopoulos, Gabriele Keraite, and Urte Steikuniene. 2020. Are Consumers Ready to Adopt Highly Automated Passenger Vehicles? Results from a Cross-national Survey in Europe. In VEHITS.",
      "doi": ""
    },
    {
      "text": "Sarvapali D Ramchurn, Sebastian Stein, and Nicholas R Jennings. 2021. Trustworthy human-AI partnerships. Iscience 24, 8 (2021), 102891.",
      "doi": ""
    },
    {
      "text": "Mireia Ribera and Agata Lapedriza. 2019. Can we do better explanations? A proposal of user-centered explainable AI.. In IUI Workshops, Vol. 2327. 38.",
      "doi": ""
    },
    {
      "text": "Herbert J Rubin and Irene S Rubin. 2011. Qualitative interviewing: The art of hearing data. sage.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Shivani Kapania, Hannah Highfill, Diana Akrong, Praveen Paritosh, and Lora M Aroyo. 2021. “Everyone wants to do the model work, not the data work”: Data Cascades in High-Stakes AI. In proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": ""
    },
    {
      "text": "Beau G Schelble, Christopher Flathmann, Nathan J McNeese, Guo Freeman, and Rohit Mallick. 2022. Let’s Think Together! Assessing Shared Mental Models, Performance, and Trust in Human-Agent Teams. Proceedings of the ACM on Human-Computer Interaction 6, GROUP(2022), 1–29.",
      "doi": "10.1145/3492832"
    },
    {
      "text": "Shervin Shahrdar, Luiza Menezes, and Mehrdad Nojoumian. 2018. A survey on trust in autonomous systems. In Science and Information Conference. Springer, 368–386.",
      "doi": ""
    },
    {
      "text": "Yuan Shen, Shanduojiao Jiang, Yanlin Chen, Eileen Jianxun Yang, Xilun Jin, Yuliang Fan, and Katherine Driggs Campbell. 2020. To Explain or Not to Explain: A Study on the Necessity of Explanations for Autonomous Vehicles. ArXiv abs/2006.11684(2020).",
      "doi": ""
    },
    {
      "text": "R Jay Shively, Joel Lachter, Summer L Brandt, Michael Matessa, Vernol Battiste, and Walter W Johnson. 2017. Why human-autonomy teaming?. In International conference on applied human factors and ergonomics. Springer, 3–11.",
      "doi": ""
    },
    {
      "text": "Nasim Sonboli, Jessie J Smith, Florencia Cabral Berenfus, Robin Burke, and Casey Fiesler. 2021. Fairness and transparency in recommendation: The users’ perspective. In Proceedings of the 29th ACM Conference on User Modeling, Adaptation and Personalization. 274–279.",
      "doi": "10.1145/3450613.3456835"
    },
    {
      "text": "Eric Strobl and Robert J Thornton. 2002. Do large employers pay more in developing countries? The case of five African countries. The Case of Five African Countries (December 2002) (2002).",
      "doi": ""
    },
    {
      "text": "Cass Robert Sunstein. 2018. Algorithms, Correcting Biases. Artificial Intelligence - Law(2018).",
      "doi": ""
    },
    {
      "text": "Árpád Takács, Dániel András Drexler, Péter Galambos, Imre J Rudas, and Tamás Haidegger. 2018. Assessment and standardization of autonomous vehicles. In 2018 IEEE 22nd International Conference on Intelligent Engineering Systems (INES). IEEE, 000185–000192.",
      "doi": ""
    },
    {
      "text": "Duy Tran, Jianhao Du, Weihua Sheng, Denis Osipychev, Yuge Sun, and He Bai. 2018. A human-vehicle collaborative driving framework for driver assistance. IEEE Transactions on Intelligent Transportation Systems 20, 9(2018), 3470–3485.",
      "doi": "10.1109/TITS.2018.2878027"
    },
    {
      "text": "Alexander Trende, Anirudh Unni, Lars Weber, Jochem W. Rieger, and Andreas Lüdtke. 2019. An investigation into human-autonomous vs. human-human vehicle interaction in time-critical situations. Proceedings of the 12th ACM International Conference on PErvasive Technologies Related to Assistive Environments(2019).",
      "doi": "10.1145/3316782.3321544"
    },
    {
      "text": "Paola Tubaro, Antonio A Casilli, and Marion Coville. 2020. The trainer, the verifier, the imitator: Three ways in which human platform workers support artificial intelligence. Big Data & Society 7, 1 (2020), 2053951720919776.",
      "doi": ""
    },
    {
      "text": "Christopher J Turner, Ruidong Ma, Jingyu Chen, and John Oyekan. 2021. Human in the Loop: Industry 4.0 technologies and scenarios for worker mediation of automated manufacturing. IEEE access 9(2021), 103950–103966.",
      "doi": ""
    },
    {
      "text": "Alain Villemeur. 1992. Assessment, hardware, software and human factors, volume 2 of Reliability, availability, maintainability and safety assessment.",
      "doi": ""
    },
    {
      "text": "Marcel Walch, Tobias Sieber, Philipp Hock, Martin R. K. Baumann, and Michael Weber. 2016. Towards Cooperative Driving: Involving the Driver in an Autonomous Vehicle’s Decision Making. Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (2016).",
      "doi": "10.1145/3003715.3005458"
    },
    {
      "text": "Ding Wang, Shantanu Prabhat, and Nithya Sambasivan. 2022. Whose AI Dream? In search of the aspiration in data annotation.. In CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3491102.3502121"
    },
    {
      "text": "Jun Wang, Li Zhang, Yanjun Huang, and Jian Zhao. 2020. Safety of autonomous vehicles. Journal of advanced transportation 2020 (2020).",
      "doi": ""
    },
    {
      "text": "Gesa Wiegand, Kai Holländer, Katharina Rupp, and Heinrich Hussmann. 2020. The Joy of Collaborating with Highly Automated Vehicles. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 223–232.",
      "doi": ""
    },
    {
      "text": "Gesa Wiegand, Matthias Schmidmaier, Thomas Weber, Yuanting Liu, and Heinrich Hussmann. 2019. I Drive - You Trust: Explaining Driving Behavior Of Autonomous Cars. Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (2019).",
      "doi": "10.1145/3290607.3312817"
    },
    {
      "text": "David D Woods, Leila J Johannesen, Richard I Cook, and Nadine B Sarter. 1994. Behind human error: Cognitive systems, computers and hindsight. Technical Report. Dayton Univ Research Inst (Urdi) OH.",
      "doi": ""
    },
    {
      "text": "Yang Xing, Chen Lv, Dongpu Cao, and Peng Hang. 2021. Toward human-vehicle collaboration: Review and perspectives on human-centered collaborative automated driving. Transportation Research Part C: Emerging Technologies (2021).",
      "doi": ""
    },
    {
      "text": "Wei Xu. 2020. From automation to autonomy and autonomous vehicles: Challenges and opportunities for human-computer interaction. Interactions 28, 1 (2020), 48–53.",
      "doi": "10.1145/3434580"
    },
    {
      "text": "Wei Xu, Marvin J Dainoff, Liezhong Ge, and Zaifeng Gao. 2023. Transitioning to human interaction with AI systems: New challenges and opportunities for HCI professionals to enable human-centered AI. International Journal of Human–Computer Interaction 39, 3(2023), 494–518.",
      "doi": ""
    },
    {
      "text": "Shiyan Yang, Steven E Shladover, Xiao-Yun Lu, John Spring, David Nelson, and Hani Ramezani. 2018. A first investigation of truck drivers’ on-the-road experience using cooperative adaptive cruise control. (2018).",
      "doi": ""
    },
    {
      "text": "Yucheng Yang, Burak Karakaya, Giancarlo Caccia Dominioni, Kyosuke Kawabe, and Klaus Bengler. 2018. An HMI Concept to Improve Driver’s Visual Behavior and Situation Awareness in Automated Vehicle. 2018 21st International Conference on Intelligent Transportation Systems (ITSC) (2018), 650–655.",
      "doi": ""
    },
    {
      "text": "Yucheng Yang, Burak Karakaya, Giancarlo Caccia Dominioni, Kyosuke Kawabe, and Klaus Bengler. 2018. An hmi concept to improve driver’s visual behavior and situation awareness in automated vehicle. In 2018 21st International Conference on Intelligent Transportation Systems (ITSC). IEEE, 650–655.",
      "doi": "10.1109/ITSC.2018.8569986"
    },
    {
      "text": "Jiehuang Zhang, Ying Shu, and Han Yu. 2021. Human-Machine Interaction for Autonomous Vehicles: A Review. In International Conference on Human-Computer Interaction. Springer, 190–201.",
      "doi": "10.1007/978-3-030-77626-8_13"
    }
  ]
}