{
  "doi": "10.1145/3544548.3581013",
  "title": "OpenMic: Utilizing Proxemic Metaphors for Conversational Floor Transitions in Multiparty Video Meetings",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Turn-taking is one of the biggest interactivity challenges in multiparty remote meetings. One contributing factor is that current videoconferencing tools lack support for proxemic cues; i.e., spatial cues that humans use to enact their social relations and intentions. While more recent tools provide support for proxemic metaphors, they often focus on approach and leave-taking rather than turn-taking. In this paper, we present OpenMic, a videoconferencing system that utilizes proxemic metaphors for conversational floor management by providing 1) a Virtual Floor that serves as a fixed-feature space for users to be aware of others’ intention to talk, and 2) Malleable Mirrors, which are video and screen feeds that can be continuously moved and resized for conversational floor transitions. Our exploratory user study found that these system features can aid the conversational flow in multiparty video meetings. With this work, we show potential for embedding proxemic metaphors to support conversational floor management in videoconferencing systems.",
  "tags": [
    "multiparty video meeting",
    "non-verbal cues",
    "proxemics",
    "video conferencing",
    "turn-taking"
  ],
  "authors": [
    {
      "name": "Erzhen Hu",
      "institution": "Department of Computer Science, University of Virginia, United States",
      "img": "/do/10.1145/contrib-99660240562/rel-imgonly/img_3983.jpg",
      "acmid": "99660240562",
      "orcid": "0000-0002-8248-8382"
    },
    {
      "name": "Jens Emil Sloth Grønbæk",
      "institution": "Department of Computer Science, Aarhus University, Denmark",
      "img": "/do/10.1145/contrib-99659020791/rel-imgonly/jens_emil_72dpi_sh.png",
      "acmid": "99659020791",
      "orcid": "0000-0002-9566-7195"
    },
    {
      "name": "Austin Houck",
      "institution": "Department of Computer Science, University of Virginia, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782649",
      "orcid": "0000-0002-3079-656X"
    },
    {
      "name": "Seongkook Heo",
      "institution": "Department of Computer Science, University of Virginia, United States",
      "img": "/do/10.1145/contrib-81484643096/rel-imgonly/81484643096.jpg",
      "acmid": "81484643096",
      "orcid": "0000-0003-2004-4812"
    }
  ],
  "references": [
    {
      "text": "2021. Gather.Town. https://gather.town/. Accessed: 2021-04-15.",
      "doi": ""
    },
    {
      "text": "2021. Lost at Sea. https://insight.typepad.co.uk/lost_at_sea.pdf. Accessed: 2021-09-09.",
      "doi": ""
    },
    {
      "text": "2021. Mozilla Hubs. https://hubs.mozilla.com/. Accessed: 2021-04-15.",
      "doi": ""
    },
    {
      "text": "2021. Remo. https://remo.co/. Accessed: 2021-04-15.",
      "doi": ""
    },
    {
      "text": "2021. SpatialChat. https://spatial.chat/. Accessed: 2021-04-15.",
      "doi": ""
    },
    {
      "text": "2021. Sprout. https://sprout.place/. Accessed: 2021-12-08.",
      "doi": ""
    },
    {
      "text": "2021. Wonder.Me. https://www.wonder.me. Accessed: 2021-12-08.",
      "doi": ""
    },
    {
      "text": "2021. Zoom. https://zoom.us/. Accessed: 2021-04-15.",
      "doi": ""
    },
    {
      "text": "2022. Teamflow. https://www.teamflowhq.com/. Accessed: 2022-04-15.",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Jim Blascovich, Andrew C Beall, and Jack M Loomis. 2003. Interpersonal Distance in Immersive Virtual Environments. Personality and Social Psychology Bulletin 29, 7 (2003), 819–833. https://doi.org/10.1145/3452918.3458804",
      "doi": "10.1145/3452918.3458804"
    },
    {
      "text": "Steve Benford, John Bowers, Lennart E Fahlén, Chris Greenhalgh, and Dave Snowdon. 1995. User Embodiment in Collaborative Virtual Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 242–249. https://doi.org/10.1145/223904.223935",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "John Bowers, James Pycock, and Jon O’brien. 1996. Talk and Embodiment in Collaborative Virtual Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 58–65. https://doi.org/10.1145/238386.238404",
      "doi": "10.1145/238386.238404"
    },
    {
      "text": "Bill Buxton. 2009. Mediaspace-Meaningspace-Meetingspace. In Media Space 20+ Years of Mediated Life. Springer, 217–231. https://doi.org/10.1145/3170427.3173033",
      "doi": "10.1145/3170427.3173033"
    },
    {
      "text": "William AS Buxton, Abigail J Sellen, and Michael C Sheasby. 1997. Interfaces for Multiparty Videoconferences. Video-Mediated Communication(1997), 385–400. https://doi.org/10.1145/142750.143070",
      "doi": "10.1145/142750.143070"
    },
    {
      "text": "Luigina Ciolfi, Breda Gray, and Aparecido Fabiano Pinatti de Carvalho. 2020. Making Home Work Places. (2020).",
      "doi": ""
    },
    {
      "text": "Herbert H Clark and Susan E Brennan. 1991. Grounding in Communication. (1991). https://doi.org/10.1109/9781118098974.ch9",
      "doi": ""
    },
    {
      "text": "Herbert H Clark and Edward F Schaefer. 1989. Contributing to Discourse. Cognitive Science 13, 2 (1989), 259–294. https://doi.org/10.1207/s15516709cog130_7",
      "doi": ""
    },
    {
      "text": "Michael E Ellis. 1992. Perceived Proxemic Distance and Instructional Videoconferencing: Impact on Student Performance and Attitude. (1992).",
      "doi": ""
    },
    {
      "text": "Randi A Engle, Jennifer M Langer-Osuna, and Maxine McKinney de Royston. 2014. Toward a Model of Influence in Persuasive Discussions: Negotiating Quality, Authority, Privilege, and Access Within a Student-Led Argument. Journal of the Learning Sciences 23, 2 (2014), 245–268. https://doi.org/10.1080/10508406.2014.883979",
      "doi": ""
    },
    {
      "text": "Robert S. Fish, Robert E. Kraut, and Barbara L. Chalfonte. 1990. The VideoWindow System in Informal Communication. In Proceedings of the 1990 ACM Conference on Computer-Supported Cooperative Work (Los Angeles, California, USA) (CSCW ’90). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/99332.99335",
      "doi": "10.1145/99332.99335"
    },
    {
      "text": "David R Gibson. 2003. Participation Shifts: Order and Differentiation in Group Conversation. Social Forces 81, 4 (2003), 1335–1380. https://doi.org/10.1353/sof.2003.0055",
      "doi": ""
    },
    {
      "text": "David R Gibson. 2005. Taking Turns and Talking Ties: Networks and Conversational Interaction. Amer. J. Sociology 110, 6 (2005), 1561–1597. https://doi.org/10.1086/428689",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1981. Forms of Talk. University of Pennsylvania Press.",
      "doi": ""
    },
    {
      "text": "Carlos Gonzalez Diaz, John Tang, Advait Sarkar, and Sean Rintel. 2022. Making Space for Social Time: Supporting Conversational Transitions Before, During, and After Video Meetings. In 2022 Symposium on Human-Computer Interaction for Work (Durham, NH, USA) (CHIWORK 2022). Association for Computing Machinery, New York, NY, USA, Article 4, 11 pages. https://doi.org/10.1145/3533406.3533417",
      "doi": "10.1145/3533406.3533417"
    },
    {
      "text": "Mar Gonzalez-Franco, Mark Hall, Devon Hansen, Karl Jones, Paul Hannah, and Pablo Bermell-Garcia. 2015. Framework for Remote Collaborative Interaction in Virtual Environments Based On Proximity. In 2015 IEEE Symposium on 3D User Interfaces (3DUI). 153–154. https://doi.org/10.1109/3DUI.2015.7131746",
      "doi": ""
    },
    {
      "text": "Jack Arthur Gowan and James Michael Downs. 1994. Video Conferencing Human-Machine Interface: a Field Study. Information & Management 27, 6 (1994), 341–356. https://doi.org/10.1016/0378-7206(94)90015-9",
      "doi": "10.1016/0378-7206%2894%2990015-9"
    },
    {
      "text": "David Michael Grayson. 2000. The Role of Perceived Proximity in Video-Mediated Communication. Ph. D. Dissertation. University of Glasgow. https://doi.org/10.1145/565711.565713",
      "doi": "10.1145/565711.565713"
    },
    {
      "text": "Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic Interactions: the New Ubicomp?Interactions 18, 1 (2011), 42–50. https://doi.org/10.1145/1897239.1897250",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Jens Emil Grønbæk, Mille Skovhus Knudsen, Kenton O’Hara, Peter Gall Krogh, Jo Vermeulen, and Marianne Graves Petersen. 2020. Proxemics Beyond Proximity: Designing for Flexible Social Interaction Through Cross-Device Interaction. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376379",
      "doi": "10.1145/3313831.3376379"
    },
    {
      "text": "Jens Emil Grønbæk, Henrik Korsgaard, Marianne Graves Petersen, Morten Henriksen Birk, and Peter Gall Krogh. 2017. Proxemic Transitions: Designing Shape-Changing Furniture for Informal Meetings. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 7029–7041. https://doi.org/10.1145/3025453.3025487",
      "doi": "10.1145/3025453.3025487"
    },
    {
      "text": "Jens Emil Grønbæk, Banu Saatçi, Carla F. Griggio, and Clemens Nylandsted Klokmose. 2021. MirrorBlender: Supporting Hybrid Meetings With a Malleable Video-Conferencing System. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 451, 13 pages. https://doi.org/10.1145/3411764.3445698",
      "doi": "10.1145/3411764.3445698"
    },
    {
      "text": "Sofiane Gueddana and Nicolas Roussel. 2006. PêLe-MêLe, a Video Communication System Supporting a Variable Degree of Engagement. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (Banff, Alberta, Canada) (CSCW ’06). Association for Computing Machinery, New York, NY, USA, 423–426. https://doi.org/10.1145/1180875.1180938",
      "doi": "10.1145/1180875.1180938"
    },
    {
      "text": "Sofiane Gueddana and Nicolas Roussel. 2006. PêLe-MêLe, a Video Communication System Supporting a Variable Degree of Engagement. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (Banff, Alberta, Canada) (CSCW ’06). Association for Computing Machinery, New York, NY, USA, 423–426. https://doi.org/10.1145/1180875.1180938",
      "doi": "10.1145/1180875.1180938"
    },
    {
      "text": "Carl Gutwin. 2002. Traces: Visualizing the Immediate Past to Support Group Interaction. In Graphics Interface. Citeseer, Citeseer, 43–50. https://doi.org/10.1145/3105971.3105981",
      "doi": "10.1145/3105971.3105981"
    },
    {
      "text": "Edward Twitchell Hall. 1966. The Hidden Dimension. Vol. 609. Garden City, NY: Doubleday.",
      "doi": ""
    },
    {
      "text": "Zhenyi He, Keru Wang, Brandon Yushan Feng, Ruofei Du, and Ken Perlin. 2021. GazeChat: Enhancing Virtual Conferences With Gaze-Aware 3D Photos. In The 34th Annual ACM Symposium on User Interface Software and Technology. 769–782. https://doi.org/10.1145/3472749.3474785",
      "doi": "10.1145/3472749.3474785"
    },
    {
      "text": "Erzhen Hu, Md Asshikur Rahman Azim, and Seongkook Heo. 2022. FluidMeet: Enabling Frictionless Transitions Between In-Group, Between-Group, and Private Conversations During Virtual Breakout Meetings. In Proceedings of the 40rd Annual ACM Conference on Human Factors in Computing Systems (New Olearns, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, 17 pages. https://doi.org/10.1145/3491102.3517558",
      "doi": "10.1145/3491102.3517558"
    },
    {
      "text": "Erzhen Hu, Jens Emil Grønbæk, Wen Ying, Ruofei Du, and Seongkook Heo. 2023. ThingShare: Ad-Hoc Digital Copies of Physical Objects for Sharing Things in Video Meetings. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3544548.3581148",
      "doi": "10.1145/3544548.3581148"
    },
    {
      "text": "Hiroshi Ishii and Minoru Kobayashi. 1992. Clearboard: a Seamless Medium for Shared Drawing and Conversation With Eye Contact. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 525–532. https://doi.org/10.1145/142750.142977",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Shahram Izadi, Ankur Agarwal, Antonio Criminisi, John Winn, Andrew Blake, and Andrew Fitzgibbon. 2007. C-Slate: Exploring Remote Collaboration on Horizontal Multi-Touch Surfaces. (2007).",
      "doi": ""
    },
    {
      "text": "Tracy Jenkin, Jesse McGeachie, David Fono, and Roel Vertegaal. 2005. EyeView: Focus+ Context Views for Large Group Video Conferences. In CHI’05 Extended Abstracts on Human Factors in Computing Systems. 1497–1500. https://doi.org/10.1145/1056808.1056950",
      "doi": "10.1145/1056808.1056950"
    },
    {
      "text": "Adam Kendon. 1990. Conducting Interaction: Patterns of Behavior in Focused Encounters. Vol. 7. CUP Archive.",
      "doi": ""
    },
    {
      "text": "Peter Gall Krogh, Marianne Graves Petersen, Kenton O’Hara, and Jens Emil Grønbæk. 2017. Sensitizing Concepts for Socio-Spatial Literacy in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6449–6460. https://doi.org/10.1145/3025453.3025756",
      "doi": "10.1145/3025453.3025756"
    },
    {
      "text": "Celine Latulipe. 2021. A CS1 Team-Based Learning Space in Gather.Town. Association for Computing Machinery, New York, NY, USA, 1245. https://doi.org/10.1145/3408877.3439587",
      "doi": "10.1145/3408877.3439587"
    },
    {
      "text": "Bryan Lawson. 2007. Language of Space. Routledge.",
      "doi": ""
    },
    {
      "text": "Bokyung Lee, Michael Lee, Pan Zhang, Alexander Tessier, and Azam Khan. 2019. An empirical study of how socio-spatial formations are influenced by interior elements and displays in an office context. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": "10.1145/3359160"
    },
    {
      "text": "Paul Luff, Christian Heath, Hideaki Kuzuoka, Keiichi Yamazaki, and Jun Yamashita. 2006. Handling Documents and Discriminating Objects in Hybrid Spaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 561–570. https://doi.org/10.1145/1124772.1124858",
      "doi": "10.1145/1124772.1124858"
    },
    {
      "text": "Nicolai Marquardt, Till Ballendat, Sebastian Boring, Saul Greenberg, and Ken Hinckley. 2012. Gradual Engagement: Facilitating Information Exchange Between Digital Devices As a Function of Proximity. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces. 31–40. https://doi.org/10.1145/2396636.2396642",
      "doi": "10.1145/2396636.2396642"
    },
    {
      "text": "Nicolai Marquardt, Robert Diaz-Marino, Sebastian Boring, and Saul Greenberg. 2011. The Proximity Toolkit: Prototyping Proxemic Interactions in Ubiquitous Computing Ecologies. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 315–326. https://doi.org/10.1145/2047196.2047238",
      "doi": "10.1145/2047196.2047238"
    },
    {
      "text": "Nicolai Marquardt, Nathalie Henry Riche, Christian Holz, Hugo Romat, Michel Pahud, Frederik Brudy, David Ledo, Chunjong Park, Molly Jane Nicholas, Teddy Seyed, 2021. AirConstellations: In-Air Device Formations for Cross-Device Interaction Via Multiple Spatially-Aware Armatures. In The 34th Annual ACM Symposium on User Interface Software and Technology. 1252–1268. https://doi.org/10.1145/3472749.3474820",
      "doi": "10.1145/3472749.3474820"
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-Device Interaction Via Micro-Mobility and F-Formations. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology. 13–22. https://doi.org/10.1145/2380116.2380121",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Osamu Morikawa and Takanori Maesako. 1998. HyperMirror: Toward Pleasant-to-Use Video Mediated Communication System. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work. 149–158. https://doi.org/10.1145/289444.289489",
      "doi": "10.1145/289444.289489"
    },
    {
      "text": "Archana Narayanan, Erzhen Hu, and Seongkook Heo. 2022. Enabling Remote Hand Guidance in Video Calls Using Directional Force Illusion. In Companion Publication of the 2022 Conference on Computer Supported Cooperative Work and Social Computing (Virtual Event, Taiwan) (CSCW’22 Companion). Association for Computing Machinery, New York, NY, USA, 135–139. https://doi.org/10.1145/3500868.3559470",
      "doi": "10.1145/3500868.3559470"
    },
    {
      "text": "Caleece Nash, Mohammad Hossein Jarrahi, and Will Sutherland. 2021. Nomadic Work and Location Independence: the Role of Space in Shaping the Work of Digital Nomads. Human Behavior and Emerging Technologies 3, 2 (2021), 271–282.",
      "doi": ""
    },
    {
      "text": "David Nguyen and John Canny. 2005. MultiView: Spatially Faithful Group Video Conferencing. Association for Computing Machinery, New York, NY, USA, 799–808. https://doi.org/10.1145/1240624.1240846",
      "doi": "10.1145/1240624.1240846"
    },
    {
      "text": "Brid O’Conaill, Steve Whittaker, and Sylvia Wilbur. 1993. Conversations Over Video Conferences: an Evaluation of the Spoken Aspects of Video-Mediated Communication. Human-Computer Interaction 8, 4 (1993), 389–428. https://doi.org/10.1207/s15327051hci080_4",
      "doi": ""
    },
    {
      "text": "Kenton O’hara, Jesper Kjeldskov, and Jeni Paay. 2011. Blended Interaction Spaces for Distributed Team Collaboration. ACM Trans. Comput.-Hum. Interact 18, 1, Article 3(2011), 28 pages. https://doi.org/10.1145/1959022.1959025",
      "doi": "10.1145/1959022.1959025"
    },
    {
      "text": "Rieks op den Akker, Dennis Hofs, Hendri Hondorp, Harm op den Akker, Job Zwiers, and Anton Nijholt. 2009. Supporting Engagement and Floor Control in Hybrid Meetings. In Cross-Modal Analysis of Speech, Gestures, Gaze and Facial Expressions. Springer, 276–290. https://doi.org/10.1007/978-3-642-03320-9_26",
      "doi": "10.1007/978-3-642-03320-9_26"
    },
    {
      "text": "Alexandre Pauchet, François Coldefy, Liv Lefebvre, S Louis Dit Picard, Arnaud Bouguet, Laurence Perron, Joël Guerin, Daniel Corvaisier, and Michel Collobert. 2007. Mutual Awareness in Collocated and Distant Collaborative Tasks Using Shared Interfaces. In IFIP Conference on Human-Computer Interaction. Springer, Springer, 59–73.",
      "doi": ""
    },
    {
      "text": "Mark Perry, Kenton O’hara, Abigail Sellen, Barry Brown, and Richard Harper. 2001. Dealing With Mobility: Understanding Access Anytime, Anywhere. ACM Transactions on Computer-Human Interaction (TOCHI) 8, 4(2001), 323–347. https://doi.org/10.1145/504704.504707",
      "doi": "10.1145/504704.504707"
    },
    {
      "text": "Sean Rintel, Abi Sellen, Advait Sarkar, Priscilla Wong, Nancy Baym, and Rachel Bergmann. 2020. Study of Microsoft Employee Experiences in Remote Meetings During COVID-19 (Project Tahiti). Microsoft Research. Retrieved from https://www. microsoft. com/en-us …, Microsoft Research. Retrieved from https://www. microsoft. com/en-us ….",
      "doi": ""
    },
    {
      "text": "Roy Rodenstein and Judith S. Donath. 2000. Talking in Circles: Designing a Spatially-Grounded Audioconferencing Environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI ’00). Association for Computing Machinery, New York, NY, USA, 81–88. https://doi.org/10.1145/332040.332410",
      "doi": "10.1145/332040.332410"
    },
    {
      "text": "Nicolas Roussel, Helen Evans, and Heiko Hansen. 2004. MirrorSpace: Using Proximity as an Interface to Video-Mediated Communication. 345–350. https://doi.org/10.1007/978-3-540-24646-6_25",
      "doi": ""
    },
    {
      "text": "Stacey D Scott, M Sheelagh T Carpendale, and Kori Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work. 294–303. https://doi.org/10.1145/1031607.1031655",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Abigail Sellen, Bill Buxton, and John Arnott. 1992. Using Spatial Cues to Improve Videoconferencing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 651–652. https://doi.org/10.1145/142750.143070",
      "doi": "10.1145/142750.143070"
    },
    {
      "text": "Abigail J Sellen. 1995. Remote Conversations: the Effects of Mediating Talk With Technology. Human-Computer Interaction 10, 4 (1995), 401–444. https://doi.org/10.1207/s15327051hci100_2",
      "doi": ""
    },
    {
      "text": "Maurício Sousa, Daniel Mendes, Daniel Medeiros, Alfredo Ferreira, João Madeiras Pereira, and Joaquim Jorge. 2016. Remote Proxemics. In Collaboration Meets Interactive Spaces. Springer, 47–73. https://doi.org/10.1007/978-3-319-45853-_4",
      "doi": ""
    },
    {
      "text": "Mark Stefik, Daniel G Bobrow, Gregg Foster, Stan Lanning, and Deborah Tatar. 1987. WYSIWIS Revised: Early Experiences With Multiuser Interfaces. ACM Transactions on Information Systems (TOIS) 5, 2 (1987), 147–167. https://doi.org/10.1145/27636.28056",
      "doi": "10.1145/27636.28056"
    },
    {
      "text": "Anthony Tang, Michel Pahud, Kori Inkpen, Hrvoje Benko, John C Tang, and Bill Buxton. 2010. Three’s Company: Understanding Communication Channels in Three-Way Distributed Collaboration. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work. 271–280. https://doi.org/10.1145/1718918.1718969",
      "doi": "10.1145/1718918.1718969"
    },
    {
      "text": "John C Tang. 1991. Findings From Observational Studies of Collaborative Work. International Journal of Man-Machine Studies 34, 2 (1991), 143–160. https://doi.org/10.1016/0020",
      "doi": ""
    },
    {
      "text": "John C Tang, Ellen A Isaacs, and Monica Rua. 1994. Supporting distributed groups with a montage of lightweight interactions. In Proceedings of the 1994 ACM conference on Computer supported cooperative work. 23–34. https://doi.org/10.1145/192844.192861",
      "doi": "10.1145/192844.192861"
    },
    {
      "text": "John C. Tang and Monica Rua. 1994. Montage: Providing Teleproximity for Distributed Groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, Massachusetts, USA) (CHI ’94). Association for Computing Machinery, New York, NY, USA, 37–43. https://doi.org/10.1145/191666.191688",
      "doi": "10.1145/191666.191688"
    },
    {
      "text": "Maria Tomprou, Young Ji Kim, Prerna Chikersal, Anita Williams Woolley, and Laura A Dabbish. 2021. Speaking Out of Turn: How Video Conferencing Reduces Vocal Synchrony and Collective Intelligence. PloS One 16, 3 (2021), e0247655.",
      "doi": ""
    },
    {
      "text": "Philip Tuddenham and Peter Robinson. 2009. Territorial Coordination and Workspace Awareness in Remote Tabletop Collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 2139–2148. https://doi.org/10.1145/1518701.1519026",
      "doi": "10.1145/1518701.1519026"
    },
    {
      "text": "Roel Vertegaal. 1999. The GAZE Groupware System: Mediating Joint Attention in Multiparty Communication and Collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 294–301. https://doi.org/10.1145/302979.303065",
      "doi": "10.1145/302979.303065"
    },
    {
      "text": "Roel Vertegaal, Ivo Weevers, and Changuk Sohn. 2002. GAZE-2: an Attentive Video Conferencing System. In CHI’02 Extended Abstracts on Human Factors in Computing Systems. 736–737. https://doi.org/10.1145/506443.506572",
      "doi": "10.1145/506443.506572"
    },
    {
      "text": "John M Wiemann and Mark L Knapp. 2017. Turn-Taking in Conversations. Communication Theory(2017), 226–245. https://doi.org/10.1109/ROMAN.2014.6926266",
      "doi": ""
    },
    {
      "text": "Julie Williamson, Jie Li, Vinoba Vinayagamoorthy, David A. Shamma, and Pablo Cesar. 2021. Proxemics and Social Interactions in an Instrumented Virtual Reality Workshop. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 253, 13 pages. https://doi.org/10.1145/3411764.3445729",
      "doi": "10.1145/3411764.3445729"
    },
    {
      "text": "Bin Xu, Jason Ellis, and Thomas Erickson. 2017. Attention From Afar: Simulating the Gazes of Remote Participants in Hybrid Meetings. In Proceedings of the 2017 Conference on Designing Interactive Systems. 101–113. https://doi.org/10.1145/3064663.3064720",
      "doi": "10.1145/3064663.3064720"
    },
    {
      "text": "Xiaolong Zhang and George W. Furnas. 2002. Social Interactions in Multiscale CVEs. In Proceedings of the 4th International Conference on Collaborative Virtual Environments (Bonn, Germany) (CVE ’02). Association for Computing Machinery, New York, NY, USA, 31–38. https://doi.org/10.1145/571878.571884",
      "doi": "10.1145/571878.571884"
    }
  ]
}