{
  "doi": "10.1145/3544548.3581021",
  "title": "CrowdIDEA: Blending Crowd Intelligence and Data Analytics to Empower Causal Reasoning",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Causal reasoning is crucial for people to understand data, make decisions, or take action. However, individuals often have blind spots and overlook alternative hypotheses, and using only data is insufficient for causal reasoning. We designed and implemented CrowdIDEA, a novel tool consisting of a three-panel integration incorporating the crowd’s beliefs (Crowd Panel with two designs), data analytics (Data Panel), and user’s causal diagram (Diagram Panel) to stimulate causal reasoning. Through an experiment with 54 participants, we showed the significant effects of the Crowd Panel designs on the outcomes of causal reasoning, such as an increased number of causal beliefs generated. Participants also devised new strategies for bootstrapping, strengthening, deepening, and explaining their causal beliefs, as well as taking advantage of the unique characteristics of both qualitative and quantitative data sources to reduce potential biases in reasoning. Our work makes theoretical and design implications for exploratory causal reasoning.",
  "authors": [
    {
      "name": "Chi-Hsien Yen",
      "institution": "Computer Science Department, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659249328",
      "orcid": "0000-0003-1781-8530"
    },
    {
      "name": "Haocong Cheng",
      "institution": "School of Information Sciences, University of Illinois Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528078",
      "orcid": "0000-0002-1535-1714"
    },
    {
      "name": "Yilin Xia",
      "institution": "School of Information Sciences, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781824",
      "orcid": "0000-0003-2500-0245"
    },
    {
      "name": "Yun Huang",
      "institution": "School of Information Sciences, University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658635613",
      "orcid": "0000-0003-0399-8032"
    }
  ],
  "references": [
    {
      "text": "Rajeev Agrawal, Anirudh Kadadi, Xiangfeng Dai, and Frederic Andres. 2015. Challenges and opportunities with big data visualization. In Proceedings of the 7th International Conference on Management of computational and collective intElligence in Digital EcoSystems. 169–173.",
      "doi": "10.1145/2857218.2857256"
    },
    {
      "text": "Haldun Akoglu. 2018. User’s guide to correlation coefficients. Turkish journal of emergency medicine 18, 3 (2018), 91–93.",
      "doi": ""
    },
    {
      "text": "Payam Aminpour, Steven A Gray, Antonie J Jetter, Joshua E Introne, Alison Singer, and Robert Arlinghaus. 2020. Wisdom of stakeholder crowds in complex social–ecological systems. Nature Sustainability 3, 3 (2020), 191–199.",
      "doi": ""
    },
    {
      "text": "Solomon E Asch. 1956. Studies of independence and conformity: I. A minority of one against a unanimous majority.Psychological monographs: General and applied 70, 9 (1956), 1.",
      "doi": ""
    },
    {
      "text": "Reuben M Baron and David A Kenny. 1986. The moderator–mediator variable distinction in social psychological research: Conceptual, strategic, and statistical considerations.Journal of personality and social psychology 51, 6(1986), 1173.",
      "doi": ""
    },
    {
      "text": "Daniel Berenberg and James P Bagrow. 2018. Efficient crowd exploration of large networks: The case of causal attribution. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–25.",
      "doi": "10.1145/3274293"
    },
    {
      "text": "Dorrit Billman, Gregorio Convertino, Jeff Shrager, P Pirolli, and J Massar. 2006. Collaborative intelligence analysis with CACHE and its effects on information gathering and cognitive bias. In Human Computer Interaction Consortium Workshop.",
      "doi": ""
    },
    {
      "text": "Yang Chen, Jamal Alsakran, Scott Barlowe, Jing Yang, and Ye Zhao. 2011. Supporting effective common ground construction in asynchronous collaborative visual analytics. In 2011 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, 101–110.",
      "doi": ""
    },
    {
      "text": "Haeyong Chung, Sai Prashanth Dasari, Santhosh Nandhakumar, and Christopher Andrews. 2017. Cricto: Supporting sensemaking through crowdsourced information schematization. In 2017 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, 139–150.",
      "doi": ""
    },
    {
      "text": "Haeyong Chung, Seungwon Yang, Naveed Massjouni, Christopher Andrews, Rahul Kanna, and Chris North. 2010. Vizcept: Supporting synchronous collaboration for constructing visualizations in intelligence analysis. In 2010 IEEE Symposium on Visual Analytics Science and Technology. IEEE, 107–114.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1992. Statistical power analysis. Current directions in psychological science 1, 3 (1992), 98–101.",
      "doi": ""
    },
    {
      "text": "Tuan Nhon Dang, Paul Murray, Jillian Aurisano, and Angus Graeme Forbes. 2015. ReactionFlow: an interactive visualization tool for causality analysis in biological pathways. In BMC proceedings, Vol. 9. Springer, S6.",
      "doi": ""
    },
    {
      "text": "David Danks. 2014. Unifying the mind: Cognitive representations as graphical models. Mit Press.",
      "doi": ""
    },
    {
      "text": "Denver Dash, Mark Voortman, and Martijn De Jongh. 2013. Sequences of mechanisms for causal reasoning in artificial intelligence. In Twenty-Third International Joint Conference on Artificial Intelligence.",
      "doi": "10.5555/2540128.2540250"
    },
    {
      "text": "Li Du, Xiao Ding, Kai Xiong, Ting Liu, and Bing Qin. 2021. ExCAR: Event Graph Knowledge Enhanced Explainable Causal Reasoning. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers). 2354–2363.",
      "doi": ""
    },
    {
      "text": "Lisa A Elkin, Jean-Baptiste Beau, Géry Casiez, and Daniel Vogel. 2020. Manipulation, learning, and recall with tangible pen-like input. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376772"
    },
    {
      "text": "Nicolas Espinosa Dice, Megan Kaye, Hana Ahmed, and George Montañez. 2021. A Probabilistic Theory of Abductive Reasoning. In Proceedings of the 13th International Conference on Agents and Artificial Intelligence, Vol. 2.",
      "doi": ""
    },
    {
      "text": "Franz Faul, Edgar Erdfelder, Albert-Georg Lang, and Axel Buchner. 2007. G* Power 3: A flexible statistical power analysis program for the social, behavioral, and biomedical sciences. Behavior research methods 39, 2 (2007), 175–191.",
      "doi": ""
    },
    {
      "text": "Vasco Furtado, Leonardo Ayres, Marcos De Oliveira, Eurico Vasconcelos, Carlos Caminha, Johnatas D’Orleans, and Mairon Belchior. 2010. Collective intelligence in law enforcement–The WikiCrimes system. Information Sciences 180, 1 (2010), 4–17.",
      "doi": "10.1016/j.ins.2009.08.004"
    },
    {
      "text": "Robert C Gardner. 2000. Correlation, causation, motivation, and second language acquisition.Canadian Psychology/Psychologie Canadienne 41, 1 (2000), 10.",
      "doi": ""
    },
    {
      "text": "Charles F Gettys, Carol Manning, Tom Mehle, and Stanley D Fisher. 1980. Hypothesis generation: A final report of three years of research. Technical Report. Technical report. University of Oklahoma, Decision Processes Laboratory. Norman, OK.",
      "doi": ""
    },
    {
      "text": "Philippe J Giabbanelli, Andrew A Tawfik, and Vishrant K Gupta. 2019. Learning analytics to support teachers’ assessment of problem solving: A novel application for machine learning and graph algorithms. Utilizing learning analytics to support study success (2019), 175–199.",
      "doi": ""
    },
    {
      "text": "Andrew Gordon, Zornitsa Kozareva, and Melissa Roemmele. 2012. Semeval-2012 task 7: Choice of plausible alternatives: An evaluation of commonsense causal reasoning. In * SEM 2012: The First Joint Conference on Lexical and Computational Semantics–Volume 1: Proceedings of the main conference and the shared task, and Volume 2: Proceedings of the Sixth International Workshop on Semantic Evaluation (SemEval 2012). 394–398.",
      "doi": ""
    },
    {
      "text": "Nitesh Goyal and Susan R Fussell. 2016. Effects of sensemaking translucence on distributed collaborative analysis. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 288–302.",
      "doi": "10.1145/2818048.2820071"
    },
    {
      "text": "Nitesh Goyal, Gilly Leshed, Dan Cosley, and Susan R Fussell. 2014. Effects of implicit sharing in collaborative analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 129–138.",
      "doi": "10.1145/2556288.2557229"
    },
    {
      "text": "Tera Marie Green, William Ribarsky, and Brian Fisher. 2008. Visual analytics for complex concepts using a human cognition model. In 2008 IEEE Symposium on Visual Analytics Science and Technology. IEEE, 91–98.",
      "doi": ""
    },
    {
      "text": "Tera Marie Green, William Ribarsky, and Brian Fisher. 2009. Building and applying a human cognition model for visual analytics. Information Visualization 8, 1 (2009), 1–13.",
      "doi": "10.5555/1598928.1598929"
    },
    {
      "text": "Sander Greenland, Judea Pearl, and James M Robins. 1999. Causal diagrams for epidemiologic research. Epidemiology (1999), 37–48.",
      "doi": ""
    },
    {
      "text": "Thomas Robert Gruber, Adam John Cheyer, Dag Kittlaus, Didier Rene Guzzoni, Christopher Dean Brigham, Richard Donald Giuli, Marcello Bastea-Forte, and Harry Joseph Saddler. 2016. Intelligent automated assistant. US Patent 9,318,108.",
      "doi": ""
    },
    {
      "text": "Yue Guo, Carsten Binnig, and Tim Kraska. 2017. What you see is not what you get! Detecting Simpson’s Paradoxes during Data Exploration. In Proceedings of the 2nd Workshop on Human-In-the-Loop Data Analytics. 1–5.",
      "doi": "10.1145/3077257.3077266"
    },
    {
      "text": "York Hagmayer and Cilia Witteman. 2017. Causal knowledge and reasoning in decision making. In Psychology of Learning and Motivation. Vol. 67. Elsevier, 95–134.",
      "doi": ""
    },
    {
      "text": "Derek L Hansen, Patrick J Schone, Douglas Corey, Matthew Reid, and Jake Gehring. 2013. Quality control mechanisms for crowdsourcing: peer review, arbitration, & expertise at familysearch indexing. In Proceedings of the 2013 conference on Computer supported cooperative work. 649–660.",
      "doi": "10.1145/2441776.2441848"
    },
    {
      "text": "Megan L Head, Luke Holman, Rob Lanfear, Andrew T Kahn, and Michael D Jennions. 2015. The extent and consequences of p-hacking in science. PLoS Biology 13, 3 (2015), e1002106.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive dynamics for visual analysis: A taxonomy of tools that support the fluent and flexible use of visualizations. Queue 10, 2 (2012), 30–55.",
      "doi": "10.1145/2133416.2146416"
    },
    {
      "text": "Richards J Heuer. 1999. Psychology of intelligence analysis. Center for the Study of Intelligence.",
      "doi": ""
    },
    {
      "text": "Austin Bradford Hill. 1965. The environment and disease: association or causation?",
      "doi": ""
    },
    {
      "text": "Rick H Hoyle. 1995. Structural equation modeling: Concepts, issues, and applications. Sage.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman and Andrew Gelman. 2021. Designing for interactive exploratory data analysis requires theories of graphical inference. Harvard Data Science Review 3, 3 (2021).",
      "doi": ""
    },
    {
      "text": "Irving L Janis. 2008. Groupthink. IEEE Engineering Management Review 36, 1 (2008), 36.",
      "doi": ""
    },
    {
      "text": "Ruth Jensen. 2022. Exploring causal relationships qualitatively: An empirical illustration of how causal relationships become visible across episodes and contexts. Journal of Educational Change 23, 2 (2022), 179–196.",
      "doi": ""
    },
    {
      "text": "Radu Jianu and David Laidlaw. 2012. An evaluation of how small user interface changes can improve scientists’ analytic strategies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2953–2962.",
      "doi": "10.1145/2207676.2208704"
    },
    {
      "text": "Jing Jin. 2006. Similarity of weighted directed acyclic graphs. (2006).",
      "doi": ""
    },
    {
      "text": "Linda T Kaastra and Brian Fisher. 2014. Field experiment methodology for pair analytics. In Proceedings of the Fifth Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization. 152–159.",
      "doi": "10.1145/2669557.2669572"
    },
    {
      "text": "Ruogu Kang, Aimee Kane, and Sara Kiesler. 2014. Teammate inaccuracy blindness: when information sharing tools hinder collaborative analysis. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing. 797–806.",
      "doi": "10.1145/2531602.2531681"
    },
    {
      "text": "Daniel Keim, Jörn Kohlhammer, Geoffrey Ellis, and Florian Mansmann. 2010. Mastering the information age: solving problems with visual analytics. (2010).",
      "doi": ""
    },
    {
      "text": "Ha-Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2018. Frames and slants in titles of visualizations on controversial topics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174012"
    },
    {
      "text": "Daniël Lakens. 2013. Calculating and reporting effect sizes to facilitate cumulative science: a practical primer for t-tests and ANOVAs. Frontiers in psychology 4 (2013), 863.",
      "doi": ""
    },
    {
      "text": "Christopher M Layne, Jesse R Steinberg, and Alan M Steinberg. 2014. Causal reasoning skills training for mental health practitioners: Promoting sound clinical judgment in evidence-based practice.Training and Education in Professional Psychology 8, 4 (2014), 292.",
      "doi": ""
    },
    {
      "text": "Félicien Le Louedec and Etienne Chatelut. 2020. Correlation Between Bevacizumab Exposure and Survival Does Not Necessarily Imply Causality.Oncologist 25, 12 (2020).",
      "doi": ""
    },
    {
      "text": "Boyang Li, Stephen Lee-Urban, Darren Scott Appling, and Mark O Riedl. 2012. Crowdsourcing narrative intelligence. Advances in Cognitive systems 2, 1 (2012).",
      "doi": ""
    },
    {
      "text": "Tianyi Li, Kurt Luther, and Chris North. 2018. CrowdIA: Solving Mysteries with Crowdsourced Sensemaking. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–29.",
      "doi": "10.1145/3274374"
    },
    {
      "text": "Ching Liu, Juho Kim, and Hao-Chuan Wang. 2018. ConceptScape: Collaborative concept mapping for video learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173961"
    },
    {
      "text": "Gill Livingston, Andrew Sommerlad, Vasiliki Orgeta, Sergi G Costafreda, Jonathan Huntley, David Ames, Clive Ballard, Sube Banerjee, Alistair Burns, Jiska Cohen-Mansfield, 2017. Dementia prevention, intervention, and care. The Lancet 390, 10113 (2017), 2673–2734.",
      "doi": ""
    },
    {
      "text": "Luciano Lopez and Sylvain Weber. 2017. Testing for Granger causality in panel data. The Stata Journal 17, 4 (2017), 972–984.",
      "doi": ""
    },
    {
      "text": "Shufan Ming, Ryan DW Mayfield, Haocong Cheng, Ke-Rou Wang, and Yun Huang. 2021. Examining Interactions Between Community Members and University Safety Organizations through Community-Sourced Risk Systems. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–23.",
      "doi": "10.1145/3449111"
    },
    {
      "text": "Paramita Mirza and Sara Tonelli. 2016. Catena: Causal and temporal relation extraction from natural language texts. In The 26th international conference on computational linguistics. ACL, 64–75.",
      "doi": ""
    },
    {
      "text": "Raymond S Nickerson. 1998. Confirmation bias: A ubiquitous phenomenon in many guises. Review of general psychology 2, 2 (1998), 175–220.",
      "doi": ""
    },
    {
      "text": "Per Nilsen, DS Hudson, Agneta Kullberg, Toomas Timpka, Robert Ekman, and Kent Lindqvist. 2004. Making sense of safety. Injury Prevention 10, 2 (2004), 71–73.",
      "doi": ""
    },
    {
      "text": "Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic books.",
      "doi": ""
    },
    {
      "text": "Brendan Nyhan and Jason Reifler. 2010. When corrections fail: The persistence of political misperceptions. Political Behavior 32, 2 (2010), 303–330.",
      "doi": ""
    },
    {
      "text": "Alvitta Ottley, Evan M Peck, Lane T Harrison, Daniel Afergan, Caroline Ziemkiewicz, Holly A Taylor, Paul KJ Han, and Remco Chang. 2016. Improving Bayesian reasoning: The effects of phrasing, visualization, and spatial ability. IEEE transactions on visualization and computer graphics 22, 1(2016), 529–538.",
      "doi": ""
    },
    {
      "text": "Judea Pearl. 1998. Graphs, causality, and structural equation models. Sociological Methods & Research 27, 2 (1998), 226–284.",
      "doi": ""
    },
    {
      "text": "Judea Pearl. 2009. Causality. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Judea Pearl and Dana Mackenzie. 2018. The book of why: the new science of cause and effect. Basic Books.",
      "doi": "10.5555/3238230"
    },
    {
      "text": "Mark S Pfaff, Jill L Drury, and Garly L Klein. 2015. Crowdsourcing mental models using DESIM (Descriptive to Executable Simulation Modeling). In International Conference on Natualistic Decision Making, McLean, VA.",
      "doi": ""
    },
    {
      "text": "William A Pike, Richard May, Bob Baddeley, Roderick Riensche, Joe Bruce, and Katarina Younkin. 2007. Scalable visual reasoning: Supporting collaboration through distributed analysis. In 2007 International Symposium on Collaborative Technologies and Systems. IEEE, 24–32.",
      "doi": ""
    },
    {
      "text": "Peter Pirolli and Stuart Card. 2005. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. In Proceedings of International Conference on Intelligence Analysis, Vol. 5. McLean, VA, USA, 2–4.",
      "doi": ""
    },
    {
      "text": "Ramsey M Raafat, Nick Chater, and Chris Frith. 2009. Herding in humans. Trends in Cognitive Sciences 13, 10 (2009), 420–428.",
      "doi": ""
    },
    {
      "text": "Martin Rein and Christopher Winship. 2018. The dangers of strong causal reasoning: Root causes, social science, and poverty policy. In Experiencing poverty. Routledge, 26–54.",
      "doi": ""
    },
    {
      "text": "Dominik Sacha, Andreas Stoffel, Florian Stoffel, Bum Chul Kwon, Geoffrey Ellis, and Daniel A Keim. 2014. Knowledge generation model for visual analytics. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 1604–1613.",
      "doi": ""
    },
    {
      "text": "Christoph Schulz, Arlind Nocaj, Mennatallah El-Assady, Steffen Frey, Marcel Hlawatsch, Michael Hund, Grzegorz Karch, Rudolf Netzel, Christin Schätzle, Miriam Butt, 2016. Generative data models for validation and evaluation of visualization techniques. In Proceedings of the Sixth Workshop on Beyond Time and Errors on Novel Evaluation Methods for Visualization. ACM, 112–124.",
      "doi": "10.1145/2993901.2993907"
    },
    {
      "text": "Skipper Seabold and Josef Perktold. 2010. Statsmodels: Econometric and statistical modeling with python. In Proceedings of the 9th Python in Science Conference, Vol. 57. Austin, TX, 10–25080.",
      "doi": ""
    },
    {
      "text": "Colleen M Seifert, David E Meyer, Natalie Davidson, Andrea L Patalano, and Ilan Yaniv. 1994. Demystification of cognitive insight: Opportunistic assimilation and the prepared-mind hypothesis. In The Nature of Insight. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Hamidreza Seiti, Ahmad Makui, Ashkan Hafezalkotob, Mehran Khalaj, and Ibrahim A Hameed. 2022. R. Graph: A new risk-based causal reasoning and its application to COVID-19 risk analysis. Process Safety and Environmental Protection 159 (2022), 585–604.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2003. The eyes have it: A task by data type taxonomy for information visualizations. In The craft of information visualization. Elsevier, 364–371.",
      "doi": ""
    },
    {
      "text": "Steven Sloman. 2005. Causal models: How people think about the world and its alternatives. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Peter Spirtes, Clark N Glymour, Richard Scheines, and David Heckerman. 2000. Causation, prediction, and search. MIT press.",
      "doi": ""
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237–246.",
      "doi": ""
    },
    {
      "text": "Christian Toth, Lars Lorch, Christian Knoll, Andreas Krause, Franz Pernkopf, Robert Peharz, and Julius von Kügelgen. 2022. Active Bayesian Causal Inference. arXiv preprint arXiv:2206.02063(2022).",
      "doi": ""
    },
    {
      "text": "John W Tukey 1977. Exploratory data analysis. Vol. 2. Reading, Mass.",
      "doi": ""
    },
    {
      "text": "Frank Van Ham and Adam Perer. 2009. “Search, show context, expand on demand”: Supporting large graph exploration with degree-of-interest. IEEE Transactions on Visualization and Computer Graphics 15, 6(2009), 953–960.",
      "doi": "10.1109/TVCG.2009.108"
    },
    {
      "text": "Luis A Vasconcelos and Nathan Crilly. 2016. Inspiration and fixation: Questions, methods, findings, and challenges. Design Studies 42(2016), 1–32.",
      "doi": ""
    },
    {
      "text": "Brad Verhulst, Lindon J Eaves, and Peter K Hatemi. 2012. Correlation not causation: The relationship between personality traits and political ideologies. American journal of political science 56, 1 (2012), 34–51.",
      "doi": ""
    },
    {
      "text": "Michael R Waldmann and York Hagmayer. 2013. Causal reasoning.(2013).",
      "doi": ""
    },
    {
      "text": "Jun Wang and Klaus Mueller. 2016. The visual causality analyst: An interactive interface for causal reasoning. IEEE transactions on visualization and computer graphics 22, 1(2016), 230–239.",
      "doi": ""
    },
    {
      "text": "Jun Wang and Klaus Mueller. 2017. Visual causality analysis made practical. In 2017 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, 151–161.",
      "doi": ""
    },
    {
      "text": "Wesley Willett, Jeffrey Heer, and Maneesh Agrawala. 2012. Strategies for crowdsourcing social data analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 227–236.",
      "doi": "10.1145/2207676.2207709"
    },
    {
      "text": "Wesley Willett, Jeffrey Heer, Joseph Hellerstein, and Maneesh Agrawala. 2011. CommentSpace: structured support for collaborative visual analysis. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 3131–3140.",
      "doi": "10.1145/1978942.1979407"
    },
    {
      "text": "Elizabeth J Wilson and Arch G Woodside. 2001. Executive and consumer decision processes: increasing useful sensemaking by identifying similarities and departures. Journal of Business & Industrial Marketing(2001).",
      "doi": ""
    },
    {
      "text": "Sewall Wright. 1921. Correlation and causation. Journal of Agricultural Research 20, 7 (1921), 557–585.",
      "doi": ""
    },
    {
      "text": "Cindy Xiong, Joel Shapiro, Jessica Hullman, and Steven Franconeri. 2019. Illusion of Causality in Visualized Data. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 853–862.",
      "doi": ""
    },
    {
      "text": "Cindy Xiong, Chase Stokes, Yea-Seul Kim, and Steven Franconeri. 2022. Seeing what you believe or believing what you see? belief biases correlation estimation. IEEE Transactions on Visualization and Computer Graphics (2022).",
      "doi": ""
    },
    {
      "text": "Koji Yatani. 2016. Effect sizes and power analysis in hci. In Modern statistical methods for hci. Springer, 87–110.",
      "doi": ""
    },
    {
      "text": "Chi-Hsien Yen, Haocong Cheng, Grace Yu-Chun Yen, Brian P Bailey, and Yun Huang. 2021. Narratives+ Diagrams: An Integrated Approach for Externalizing and Sharing People’s Causal Beliefs. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–27.",
      "doi": ""
    },
    {
      "text": "Chi-Hsien Yen, Yu-Chun Yen, and Wai-Tat Fu. 2019. An intelligent assistant for mediation analysis in visual analytics. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 432–436.",
      "doi": "10.1145/3301275.3302325"
    },
    {
      "text": "Chi-Hsien Eric Yen, Aditya Parameswaran, and Wai-Tat Fu. 2019. An Exploratory User Study of Visual Causality Analysis. In Computer Graphics Forum, Vol. 38. Wiley Online Library, 173–184.",
      "doi": ""
    },
    {
      "text": "Emanuel Zgraggen, Zheguang Zhao, Robert Zeleznik, and Tim Kraska. 2018. Investigating the effect of the multiple comparisons problem in visual analysis. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 479.",
      "doi": "10.1145/3173574.3174053"
    },
    {
      "text": "Jian Zhao, Michael Glueck, Petra Isenberg, Fanny Chevalier, and Azam Khan. 2017. Supporting handoff in asynchronous collaborative sensemaking using knowledge-transfer graphs. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 340–350.",
      "doi": ""
    }
  ]
}