{
  "doi": "10.1145/3544548.3581490",
  "title": "Playing with Power Tools: Design Toolkits and the Framing of Equity",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2023,
  "badges": [],
  "abstract": "Design toolkits that aim to to promote equity offer designers simplified approaches to creating more equitable technology. However, it is important to understand how equity is conceptualized in practice. As a curated collection of methods, toolkits signal how equity is imagined in design. In this paper, we perform a qualitative analysis of 17 design toolkits related to equity. We explore alternative design approaches that address inequity in design. We evaluate whether equity toolkits align with calls for changes to design practice, as well as Nancy Fraser’s dimensions of justice. Finally, we find that design toolkits focus on the ‘digital divide’ rather than redistributing world-building power, and thus continue to keep design power with professional designers. We also find that ‘design thinking’ continues to influence design toolkits. Furthermore, the simplicity of toolkits does not engage with the complexities that shape equity in practice. We conclude with suggestions to help researchers and designers rethink design toolkits.",
  "tags": [
    "Universal Design",
    "Value Sensitive Design",
    "ethics",
    "justice",
    "design",
    "equity",
    "activism",
    "Inclusive Design",
    "cards",
    "Participatory Design",
    "tool",
    "toolkits"
  ],
  "authors": [
    {
      "name": "Adrian Petterson",
      "institution": "University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660546963",
      "orcid": "0000-0002-4367-2179"
    },
    {
      "name": "Keith Cheng",
      "institution": "University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782228",
      "orcid": "0000-0001-8366-992X"
    },
    {
      "name": "Priyank Chandra",
      "institution": "Faculty of Information, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658714851",
      "orcid": "0000-0003-4024-8871"
    }
  ],
  "references": [
    {
      "text": "[1] n.d.. Toolkit Creation Guide. https://www.ala.org/yalsa/sites/ala.org.yalsa/files/content/ToolkitCreationGuide.pdf",
      "doi": ""
    },
    {
      "text": "[2] Sara Ahmed. 2010. The promise of happiness. In The Promise of Happiness. Duke University Press.",
      "doi": ""
    },
    {
      "text": "[3] Sara Ahmed. 2013. Strange encounters: Embodied others in post-coloniality. Routledge.",
      "doi": ""
    },
    {
      "text": "[4] Tanla Anaissie, Victor Cary, David Clifford, Tom Malarkey, and Susie Wise. 2021. Liberatory Design Toolkit. liberatorydesign.com",
      "doi": ""
    },
    {
      "text": "[5] Mariam Asad and Christopher A Le Dantec. 2015. Illegitimate civic participation: supporting community activists on the ground. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1694–1703.",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "[6] Jan Auernhammer, Matteo Zallio, Lawrence Domingo, and Larry Leifer. 2022. Facets of Human-Centered Design: The Evolution of Designing by, with, and for People. In Design Thinking Research. Springer, 227–245.",
      "doi": ""
    },
    {
      "text": "[7] Dana Ayotte, Cheryl Li, Sepideh Shahi, Colin Veda, Titania Clark, and Gloria Bernal. 2020. Community-Led Co-Design. https://co-design.inclusivedesign.ca/",
      "doi": ""
    },
    {
      "text": "[8] Liam Bannon. 2011. Reimagining HCI: toward a more human-centered perspective. interactions 18, 4 (2011), 50–57.",
      "doi": "10.1145/1978822.1978833"
    },
    {
      "text": "[9] Liam J Bannon and Pelle Ehn. 2012. Design: design matters in Participatory Design. In Routledge international handbook of participatory design. Routledge, 37–63.",
      "doi": ""
    },
    {
      "text": "[10] Karen Barad. 2007. Meeting the universe halfway: Quantum physics and the entanglement of matter and meaning. duke university Press.",
      "doi": ""
    },
    {
      "text": "[11] Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "[12] Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI conference on human factors in computing systems. 675–684.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "[13] Shaowen Bardzell, Jeffrey Bardzell, Jodi Forlizzi, John Zimmerman, and John Antanitis. 2012. Critical design and critical theory: the challenge of designing for provocation. In Proceedings of the Designing Interactive Systems Conference. 288–297.",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "[14] Rebeccah Bartlett, Jacqueline A Boyle, Jessica Simons Smith, Nadia Khan, Tracy Robinson, and Rohit Ramaswamy. 2021. Evaluating human-centred design for public health: a case study on developing a healthcare app with refugee communities. Research Involvement and Engagement 7 (2021), 1–13.",
      "doi": ""
    },
    {
      "text": "[15] Allan Beever. 2004. Aristotle on equity, law, and justice. Legal theory 10, 1 (2004), 33–50.",
      "doi": ""
    },
    {
      "text": "[16] Liat Ben-Moshe and Sandy Magaña. 2014. An introduction to race, gender, and disability: Intersectionality, disability studies, and families of color. Women, Gender, and Families of Color 2, 2 (2014), 105–114.",
      "doi": ""
    },
    {
      "text": "[17] Ruha Benjamin. 2019. Race after technology: Abolitionist tools for the new jim code. Social forces (2019).",
      "doi": ""
    },
    {
      "text": "[18] Cynthia L. Bennett. 2018. A Toolkit for Facilitating Accessible Design with Blind People. SIGACCESS Access. Comput.120 (jan 2018), 16–19. https://doi.org/10.1145/3178412.3178415",
      "doi": "10.1145/3178412.3178415"
    },
    {
      "text": "[19] Cynthia L Bennett and Daniela K Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the\" Other\". In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "[20] Arne Berger, Aloha Hufana Ambe, Alessandro Soro, Dries De Roeck, and Margot Brereton. 2019. The stories people tell about the home through IoT toolkits. In Proceedings of the 2019 on designing interactive systems conference. 7–19.",
      "doi": "10.1145/3322276.3322308"
    },
    {
      "text": "[21] Elettra Bietti. 2020. From ethics washing to ethics bashing: a view on tech ethics from within moral philosophy. In Proceedings of the 2020 conference on fairness, accountability, and transparency. 210–219.",
      "doi": "10.1145/3351095.3372860"
    },
    {
      "text": "[22] Heidi Biggs, Tejaswini Joshi, Ries Murphy, Jeffrey Bardzell, and Shaowen Bardzell. 2021. Alternatives to agrilogistics: designing for ecological thinking. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2 (2021), 1–31.",
      "doi": "10.1145/3479557"
    },
    {
      "text": "[23] Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory design and\" democratizing innovation\". In Proceedings of the 11th Biennial participatory design conference. 41–50.",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "[24] Susanne Bødker. 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles. 1–8.",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "[25] Susanne Bødker, Christian Dindler, and Ole Sejer Iversen. 2017. Tying knots: Participatory infrastructuring at work. Computer Supported Cooperative Work (CSCW) 26, 1 (2017), 245–273.",
      "doi": "10.1007/s10606-017-9268-y"
    },
    {
      "text": "[26] Susanne Bødker and Morten Kyng. 2018. Participatory design that matters—Facing the big issues. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 1 (2018), 1–31.",
      "doi": "10.1145/3152421"
    },
    {
      "text": "[27] Claus Bossen, Christian Dindler, and Ole Sejer Iversen. 2016. Evaluation in participatory design: a literature survey. In Proceedings of the 14th Participatory Design Conference: Full papers-Volume 1. 151–160.",
      "doi": "10.1145/2940299.2940303"
    },
    {
      "text": "[28] Tone Bratteteig and Ina Wagner. 2012. Disentangling power and decision-making in participatory design. In Proceedings of the 12th Participatory Design Conference: Research Papers-Volume 1. 41–50.",
      "doi": "10.1145/2347635.2347642"
    },
    {
      "text": "[29] Tone Bratteteig and Ina Wagner. 2014. Disentangling participation: power and decision-making in participatory design. Springer.",
      "doi": ""
    },
    {
      "text": "[30] Tone Bratteteig and Ina Wagner. 2016. Unpacking the notion of participation in participatory design. Computer Supported Cooperative Work (CSCW) 25, 6 (2016), 425–475.",
      "doi": "10.1007/s10606-016-9259-4"
    },
    {
      "text": "[31] André Brock, Lynette Kvasny, and Kayla Hales. 2010. Cultural appropriations of technical capital: Black women, weblogs, and the digital divide. Information, Communication & Society 13, 7 (2010), 1040–1059.",
      "doi": ""
    },
    {
      "text": "[32] Tim Brown. n.d.. Design Thinking Defined. https://designthinking.ideo.com/",
      "doi": ""
    },
    {
      "text": "[33] Margaret Burnett. 2020. Doing inclusive design: From gendermag in the trenches to inclusive mag in the research lab. In Proceedings of the International Conference on Advanced Visual Interfaces. 1–6.",
      "doi": "10.1145/3399715.3400871"
    },
    {
      "text": "[34] Antionette D. Carroll and Mariama Kurbally. 2018. Equity Centered Community Design Kit. https://www.creativereactionlab.com/our-approach",
      "doi": ""
    },
    {
      "text": "[35] Colin Clark, Dana Ayotte, Antranig Basman, and Jutta Treviranus. 2016. About us, with us: The fluid project’s inclusive design tools. In International Conference on Universal Access in Human-Computer Interaction. Springer, 172–182.",
      "doi": ""
    },
    {
      "text": "[36] P John Clarkson, Roger Coleman, Simeon Keates, and Cherie Lebbon. 2013. Inclusive design: Design for the whole population. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "[37] Jane Clemensen, Simon B Larsen, Morten Kyng, and Marit Kirkevold. 2007. Participatory design in health sciences: using cooperative experimental methods in developing health services and computer technology. Qualitative health research 17, 1 (2007), 122–130.",
      "doi": ""
    },
    {
      "text": "[38] Rebecca Cober, Esther Tan, Jim Slotta, Hyo-Jeong So, and Karen D Könings. 2015. Teachers as participatory designers: Two case studies with technology-enhanced learning environments. Instructional Science 43, 2 (2015), 203–228.",
      "doi": ""
    },
    {
      "text": "[39] Cynthia Cockburn and Susan Ormrod. 1993. Gender and Technology in the Making. SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "[40] Patricia Hill Collins. 1990. Black feminist thought in the matrix of domination. Black feminist thought: Knowledge, consciousness, and the politics of empowerment 138, 1990 (1990), 221–238.",
      "doi": ""
    },
    {
      "text": "[41] Patricia Hill Collins. 2002. Black feminist thought: Knowledge, consciousness, and the politics of empowerment. routledge.",
      "doi": ""
    },
    {
      "text": "[42] Eric Corbett and Yanni Loukissas. 2019. Engaging gentrification as a social justice issue in HCI. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–16.",
      "doi": "10.1145/3290605.3300510"
    },
    {
      "text": "[43] Sasha Costanza-Chock. 2018. Design justice: Towards an intersectional feminist framework for design theory and practice. Proceedings of the Design Research Society (2018).",
      "doi": ""
    },
    {
      "text": "[44] Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. The MIT Press.",
      "doi": ""
    },
    {
      "text": "[45] Michela Cozza, Linda Tonolli, and Vincenzo D’Andrea. 2016. Subversive participatory design: Reflections on a case study. In Proceedings of the 14th Participatory Design Conference: Short Papers, Interactive Exhibitions, Workshops-Volume 2. 53–56.",
      "doi": "10.1145/2948076.2948085"
    },
    {
      "text": "[46] Anna Croon. 2022. Thinking with care in human–computer interaction. Feminist Theory 23, 2 (2022), 232–246.",
      "doi": ""
    },
    {
      "text": "[47] Nigel Cross. 2006. Design as a discipline. Designerly ways of knowing (2006), 95–103.",
      "doi": ""
    },
    {
      "text": "[48] Michael Ann DeVito, Ashley Marie Walker, and Julia R Fernandez. 2021. Values (Mis) alignment: Exploring Tensions Between Platform and LGBTQ+ Community Design Values. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1 (2021), 1–27.",
      "doi": "10.1145/3449162"
    },
    {
      "text": "[49] Christian Dindler and Ole Sejer Iversen. 2014. Relational expertise in participatory design. In Proceedings of the 13th Participatory Design Conference: Research Papers-Volume 1. 41–50.",
      "doi": "10.1145/2661435.2661452"
    },
    {
      "text": "[50] Carl DiSalvo, Andrew Clement, and Volkmar Pipek. 2012. Communities: Participatory Design for, with and by communities. In Routledge international handbook of participatory design. Routledge, 202–230.",
      "doi": ""
    },
    {
      "text": "[51] Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social justice-oriented interaction design: Outlining key design strategies and commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 656–671.",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "[52] Hua Dong, Simeon Keates, and P John Clarkson. 2004. Inclusive design in industry: barriers, drivers and the business case. In Ercim workshop on user interfaces for all. Springer, 305–319.",
      "doi": ""
    },
    {
      "text": "[53] Scott Doorley, Sarah Holcomb, Perry Klebahn, Kathryn Segovia, and Jeremy Utley. 2018. Design Thinking Bootleg. https://dschool.stanford.edu/resources/inequity-catcher",
      "doi": ""
    },
    {
      "text": "[54] Kees Dorst. 2011. The core of ‘design thinking’and its application. Design studies 32, 6 (2011), 521–532.",
      "doi": ""
    },
    {
      "text": "[55] Paul Dourish and Scott D Mainwaring. 2012. Ubicomp’s colonial impulse. In Proceedings of the 2012 ACM conference on ubiquitous computing. 133–142.",
      "doi": "10.1145/2370216.2370238"
    },
    {
      "text": "[56] Anthony Dunne and Fiona Raby. 2001. Design noir: The secret life of electronic objects. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "[57] Pelle Ehn and Morten Kyng. 1987. The collective resource approach to systems design. Computers and democracy 17 (1987), 57.",
      "doi": ""
    },
    {
      "text": "[58] Elizabeth Ellcessor. 2016. Restricted access: Media, disability, and the politics of participation. Vol. 6. NYU Press.",
      "doi": ""
    },
    {
      "text": "[59] Sheena Erete, Aarti Israni, and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions 25, 3 (2018), 66–69.",
      "doi": "10.1145/3194349"
    },
    {
      "text": "[60] Sheena Erete, Yolanda A Rankin, and Jakita O Thomas. 2021. I can’t breathe: Reflections from Black women in CSCW and HCI. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3 (2021), 1–23.",
      "doi": "10.1145/3432933"
    },
    {
      "text": "[61] Sheena Erete, Yolanda A Rankin, and Jakita O Thomas. 2022. A method to the madness: Applying an intersectional analysis of structural oppression and power in HCI and design. ACM Transactions on Computer-Human Interaction (2022).",
      "doi": "10.1145/3507695"
    },
    {
      "text": "[62] Arturo Escobar. 2018. Designs for the Pluriverse. Duke University Press.",
      "doi": ""
    },
    {
      "text": "[63] Virginia Eubanks. 2018. Automating inequality: How high-tech tools profile, police, and punish the poor. St. Martin’s Press.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "[64] Casey Fiesler, Shannon Morrison, and Amy S Bruckman. 2016. An archive of their own: A case study of feminist HCI and values in design. In Proceedings of the 2016 CHI conference on human factors in computing systems. 2574–2585.",
      "doi": "10.1145/2858036.2858409"
    },
    {
      "text": "[65] Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social Justice and Design: Power and oppression in collaborative systems. In Companion of the 2017 acm conference on computer supported cooperative work and social computing. 117–122.",
      "doi": ""
    },
    {
      "text": "[66] Sarah Fox and Daniela Rosner. 2016. Inversions of Design: Examining the limits of human-centered perspectives in a feminist design workshop image. Journal of Peer Production 8 (2016).",
      "doi": ""
    },
    {
      "text": "[67] Daniel Fraga Viera, Carina Gonzalez-González, Rosa Gil Iranzo, Patricia Paderewski, and Francisco L. Gutiérrez Vela. 2021. Inclusive Design Toolkit for the Creation of Intergenerational Gamified Experiences. In Eighth International Conference on Technological Ecosystems for Enhancing Multiculturality (Salamanca, Spain) (TEEM’20). Association for Computing Machinery, New York, NY, USA, 707–712. https://doi.org/10.1145/3434780.3436697",
      "doi": "10.1145/3434780.3436697"
    },
    {
      "text": "[68] Nancy Fraser. 2008. Scales of Justice: Reimagining Political Space in a Globalizing World. Columbia University Press. https://books.google.ca/books?id=GybhFYFkcpMC",
      "doi": ""
    },
    {
      "text": "[69] Nancy Fraser. 2020. From redistribution to recognition?: dilemmas of justice in a’postsocialist’age. In The new social theory reader. Routledge, 188–196.",
      "doi": ""
    },
    {
      "text": "[70] Nancy Fraser 1999. Social justice in the age of identity politics: Redistribution, recognition, and participation. Culture and economy after the cultural turn 1 (1999), 25–52.",
      "doi": ""
    },
    {
      "text": "[71] Nancy Fraser and Axel Honneth. 2003. Redistribution or recognition?: a political-philosophical exchange. verso.",
      "doi": ""
    },
    {
      "text": "[72] Batya Friedman and David Hendry. 2012. The Envisioning Cards: A Toolkit for Catalyzing Humanistic and Technical Imaginations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1145–1148. https://doi.org/10.1145/2207676.2208562",
      "doi": "10.1145/2207676.2208562"
    },
    {
      "text": "[73] Batya Friedman and David G Hendry. 2019. Value sensitive design: Shaping technology with moral imagination. Mit Press.",
      "doi": ""
    },
    {
      "text": "[74] Batya Friedman, Peter Kahn, and Alan Borning. 2002. Value sensitive design: Theory and methods. University of Washington technical report 2 (2002), 12.",
      "doi": ""
    },
    {
      "text": "[75] Batya Friedman, Lisa Nathan, Shaun Kane, and John Lin. 2020. Envisioning Cards. https://www.envisioningcards.com/?page_id=2",
      "doi": ""
    },
    {
      "text": "[76] Tony Fry. 1999. A new design philosophy: an introduction to defuturing. UNSW Press.",
      "doi": ""
    },
    {
      "text": "[77] Intentional Futures. 2021. An Introduction to Equity Centered Design. https://www.intentionalfutures.com/public/ecd-booklet.pdf",
      "doi": ""
    },
    {
      "text": "[78] Patricia Garcia, Tonia Sutherland, Marika Cifor, Anita Say Chan, Lauren Klein, Catherine D’Ignazio, and Niloufar Salehi. 2020. No: Critical refusal as feminist data practice. In conference companion publication of the 2020 on computer supported cooperative work and social computing. 199–202.",
      "doi": "10.1145/3406865.3419014"
    },
    {
      "text": "[79] Jet Gispen. 2017. Ethics for Designers. https://www.ethicsfordesigners.com/tools",
      "doi": ""
    },
    {
      "text": "[80] Maya Goodwill. 2020. A Social Designer’s Field Guide to Power Literacy. https://www.power-literacy.com/",
      "doi": ""
    },
    {
      "text": "[81] Maya Goodwill, Mieke van der Bijl-Brouwer, and Roy Bendor. 2021. Beyond good intentions: Towards a power literacy framework for service designers. International Journal of Design 15, 3 (2021).",
      "doi": ""
    },
    {
      "text": "[82] Colin M Gray and Shruthi Sai Chivukula. 2019. Ethical mediation in UX practice. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300408"
    },
    {
      "text": "[83] Daniel Greene. 2021. The promise of access: Technology, inequality, and the political economy of hope. MIT Press.",
      "doi": ""
    },
    {
      "text": "[84] Judith Gregory. 2003. Scandinavian approaches to participatory design. International Journal of Engineering Education 19, 1 (2003), 62–74.",
      "doi": ""
    },
    {
      "text": "[85] Elizabeth A Grosz and Elizabeth Grosz. 1999. Becomings: Explorations in time, memory, and futures. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "[86] Mary E Guy and Sean A McCandless. 2012. Social equity: Its legacy, its promise. Public Administration Review 72, s1 (2012), S5–S13.",
      "doi": ""
    },
    {
      "text": "[87] Oliver L Haimson, Dykee Gorrell, Denny L Starks, and Zu Weinger. 2020. Designing trans technology: Defining challenges and envisioning community-centered solutions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376669"
    },
    {
      "text": "[88] Aimi Hamraie. 2012. Universal design research as a new materialist practice. Disability Studies Quarterly 32, 4 (2012).",
      "doi": ""
    },
    {
      "text": "[89] Aimi Hamraie. 2017. Building access: Universal design and the politics of disability. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "[90] Aimi Hamraie and Kelly Fritsch. 2019. Crip technoscience manifesto. Catalyst: Feminism, Theory, Technoscience 5, 1 (2019), 1–33.",
      "doi": ""
    },
    {
      "text": "[91] Jean Hardy, Caitlin Geier, Stefani Vargas, Riley Doll, and Amy Lyn Howard. 2022. LGBTQ Futures and Participatory Design: Investigating Visibility, Community, and the Future of Future Workshops. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2 (2022), 1–25.",
      "doi": "10.1145/3555638"
    },
    {
      "text": "[92] Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (2019), 1–25.",
      "doi": "10.1145/3359318"
    },
    {
      "text": "[93] Christina Harrington, Jennifer Roberts, Kirsten Bray, and N’Deye Diakhate. 2020. Building Utopia Deck. https://www.buildingutopiadeck.com/",
      "doi": ""
    },
    {
      "text": "[94] Steve Harrison, Phoebe Sengers, and Deborah Tatar. 2011. Making epistemological trouble: Third-paradigm HCI as successor science. Interacting with computers 23, 5 (2011), 385–392.",
      "doi": ""
    },
    {
      "text": "[95] Maryam Heidaripour and Laura Forlano. 2018. Formgiving to Feminist Futures as Design Activism. (2018).",
      "doi": ""
    },
    {
      "text": "[96] Steven Heller and Véronique Vienne. 2003. Citizen designer: Perspectives on design responsibility. Skyhorse Publishing Inc.",
      "doi": ""
    },
    {
      "text": "[97] Ann Heylighen and Andy Dong. 2019. To empathise or not to empathise? Empathy and its limits in design. Design Studies 65 (2019), 107–124.",
      "doi": ""
    },
    {
      "text": "[98] Raymond Holt, Anne-Marie Moore, and Angharad Beckett. 2012. Together through play: Facilitating meaningful play for disabled & non-disabled children through participatory design. (2012).",
      "doi": ""
    },
    {
      "text": "[99] Alexis Hope, Catherine D’Ignazio, Josephine Hoy, Rebecca Michelson, Jennifer Roberts, Kate Krontiris, and Ethan Zuckerman. 2019. Hackathons as participatory design: iterating feminist utopias. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300291"
    },
    {
      "text": "[100] Idean. 2021. Cards for Humanity. https://cardsforhumanity.idean.com/",
      "doi": ""
    },
    {
      "text": "[101] Lilly Irani. 2018. “Design thinking”: Defending Silicon Valley at the apex of global labor hierarchies. Catalyst: Feminism, Theory, Technoscience 4, 1 (2018), 1–19.",
      "doi": ""
    },
    {
      "text": "[102] Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI conference on human factors in computing systems. 1311–1320.",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "[103] Azra Ismail and Neha Kumar. 2019. Empowerment on the margins: The online experiences of community health workers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300329"
    },
    {
      "text": "[104] Pradthana Jarusriboonchai, Janis Lena Meissner, Nicolai Brodersen Hansen, and Ben Schouten. 2018. Thinking outside the (tool) box: empowering people with toolkits. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction. 980–983.",
      "doi": "10.1145/3240167.3240263"
    },
    {
      "text": "[105] Alison Kafer. 2013. Feminist, queer, crip. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "[106] Maurits Kaptein, Dean Eckles, and Janet Davis. 2011. Envisioning Persuasion Profiles: Challenges for Public Policy and Ethical Practice. Interactions 18, 5 (sep 2011), 66–69. https://doi.org/10.1145/2008176.2008191",
      "doi": "10.1145/2008176.2008191"
    },
    {
      "text": "[107] Simeon Keates and John Clarkson. 2003. Countering design exclusion. Inclusive Design (2003), 438–453.",
      "doi": ""
    },
    {
      "text": "[108] Finn Kensing and Jeanette Blomberg. 1998. Participatory design: Issues and concerns. Computer supported cooperative work (CSCW) 7, 3 (1998), 167–185.",
      "doi": ""
    },
    {
      "text": "[109] Lucy Kimbell. 2011. Rethinking design thinking: Part I. Design and culture 3, 3 (2011), 285–306.",
      "doi": ""
    },
    {
      "text": "[110] Lucy Kimbell. 2012. Rethinking design thinking: Part II. Design and Culture 4, 2 (2012), 129–148.",
      "doi": ""
    },
    {
      "text": "[111] Lucy Kimbell and Park End Street. 2009. Beyond design thinking: Design-as-practice and designs-in-practice. In CRESC Conference, Manchester. 1–15.",
      "doi": ""
    },
    {
      "text": "[112] Rob Kling and Susan Leigh Star. 1998. Human centered systems in the perspective of organizational and social informatics. Acm Sigcas Computers and Society 28, 1 (1998), 22–29.",
      "doi": "10.1145/277351.277356"
    },
    {
      "text": "[113] Cory Knobel and Geoffrey C Bowker. 2011. Values in design. Commun. ACM 54, 7 (2011), 26–28.",
      "doi": "10.1145/1965724.1965735"
    },
    {
      "text": "[114] Bran Knowles, Oliver Bates, and Maria Håkansson. 2018. This changes sustainable HCI. In Proceedings of the 2018 CHI Conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3174045"
    },
    {
      "text": "[115] Ansgar Koene, Elvira Perez, Sofia Ceppi, Michael Rovatsos, Helena Webb, Menisha Patel, Marina Jirotka, and Giles Lane. 2017. Algorithmic Fairness in Online Information Mediating Systems. In Proceedings of the 2017 ACM on Web Science Conference (Troy, New York, USA) (WebSci ’17). Association for Computing Machinery, New York, NY, USA, 391–392. https://doi.org/10.1145/3091478.3098864",
      "doi": "10.1145/3091478.3098864"
    },
    {
      "text": "[116] Jon Kolko. 2018. The divisiveness of design thinking. Interactions 25, 3 (2018), 28–34.",
      "doi": "10.1145/3194313"
    },
    {
      "text": "[117] P. M. Krafft, Meg Young, Michael Katell, Jennifer E. Lee, Shankar Narayan, Micah Epstein, Dharma Dailey, Bernease Herman, Aaron Tam, Vivian Guetler, Corinne Bintz, Daniella Raz, Pa Ousman Jobe, Franziska Putz, Brian Robick, and Bissan Barghouti. 2021. An Action-Oriented AI Policy Toolkit for Technology Audits by Community Advocates and Activists. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 772–781. https://doi.org/10.1145/3442188.3445938",
      "doi": "10.1145/3442188.3445938"
    },
    {
      "text": "[118] Michael Kwet. 2019. Digital colonialism: US empire and the new imperialism in the Global South. Race & Class 60, 4 (2019), 3–26.",
      "doi": ""
    },
    {
      "text": "[119] David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation strategies for HCI toolkit research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "[120] Michelle Seng Ah Lee and Jat Singh. 2021. The landscape and gaps in open source fairness toolkits. In Proceedings of the 2021 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3411764.3445261"
    },
    {
      "text": "[121] Lenka Lhotska. 2022. Ethics in Engineering Education. In 2022 31st Annual Conference of the European Association for Education in Electrical and Information Engineering (EAEEIE). 1–5. https://doi.org/10.1109/EAEEIE54893.2022.9820462",
      "doi": ""
    },
    {
      "text": "[122] Ann Light. 2011. HCI as heterodoxy: Technologies of identity and the queering of interaction with computers. Interacting with computers 23, 5 (2011), 430–438.",
      "doi": ""
    },
    {
      "text": "[123] Ann Light and Yoko Akama. 2012. The human touch: participatory practice and the role of facilitation in designing with communities. In Proceedings of the 12th Participatory Design Conference: Research Papers-Volume 1. 61–70.",
      "doi": "10.1145/2347635.2347645"
    },
    {
      "text": "[124] Ann Light and Yoko Akama. 2014. Structuring future social relations: the politics of care in participatory practice. In Proceedings of the 13th Participatory Design Conference: Research Papers-Volume 1. 151–160.",
      "doi": "10.1145/2661435.2661438"
    },
    {
      "text": "[125] Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the utopian vision of making: HCI after technosolutionism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1390–1402.",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "[126] Roseann Liu and Savannah Shange. 2018. Toward thick solidarity: Theorizing empathy in social justice movements. Radical History Review 2018, 131 (2018), 189–198.",
      "doi": ""
    },
    {
      "text": "[127] Rachael Luck. 2003. Dialogue in participatory design. Design studies 24, 6 (2003), 523–535.",
      "doi": ""
    },
    {
      "text": "[128] Subcomandante Marcos and the Zapatistas. 2006. The Other Campaign/La Otra Campaña. (2006).",
      "doi": ""
    },
    {
      "text": "[129] Shannon Mattern. 2021. Unboxing the Toolkit. https://tool-shed.org/unboxing-the-toolkit/",
      "doi": ""
    },
    {
      "text": "[130] Jane McGonigal, Raina Kumra, Parker Barnes, Nick Brakenbury, Bobby Dresser, Rose Jackson, Sheridan Kates, Amy Lazarus, Jake Metcalf, Jonathan Morgan, Gisela Perez de Acha, and Caroline Sinders. 2018. Ethical Explorer Pack. https://ethicalexplorer.org/",
      "doi": ""
    },
    {
      "text": "[131] KA McKercher. 2021. Model of Care for Co-Design. https://www.beyondstickynotes.com/",
      "doi": ""
    },
    {
      "text": "[132] Janis Lena Meissner, Angelika Strohmayer, Peter Wright, and Geraldine Fitzpatrick. 2018. A Schnittmuster for Crafting Context-Sensitive Toolkits. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173725"
    },
    {
      "text": "[133] Lisa E Mercer and Terresa Moses. 2019. Identifying racialized design to cultivate a culture of awareness in design. The Design Journal 22, sup1 (2019), 1399–1407.",
      "doi": ""
    },
    {
      "text": "[134] Sebastian Merkel and Alexander Kucharski. 2019. Participatory design in gerontechnology: A systematic literature review. The Gerontologist 59, 1 (2019), e16–e25.",
      "doi": ""
    },
    {
      "text": "[135] Samantha Merritt and Erik Stolterman. 2012. Cultural hybridity in participatory design. In Proceedings of the 12th Participatory Design Conference: Exploratory Papers, Workshop Descriptions, Industry Cases-Volume 2. 73–76.",
      "doi": "10.1145/2348144.2348168"
    },
    {
      "text": "[136] Danaë Metaxa-Kakavouli, Kelly Wang, James A Landay, and Jeff Hancock. 2018. Gender-inclusive design: Sense of belonging and bias in web interfaces. In Proceedings of the 2018 CHI Conference on human factors in computing systems. 1–6.",
      "doi": "10.1145/3173574.3174188"
    },
    {
      "text": "[137] Terresa Moses and Lisa Mercer. 2019. Racism Untaught. racismuntaught.com/",
      "doi": ""
    },
    {
      "text": "[138] Preeti Mudliar. 2020. Whither Humane-Computer Interaction? Adult and Child Value Conflicts in the Biometric Fingerprinting for Food. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376564"
    },
    {
      "text": "[139] Geoff Mulgan. 2019. Social Innovation: how societies find the power to change. Policy Press.",
      "doi": ""
    },
    {
      "text": "[140] Michael J Muller and Allison Druin. 2012. Participatory design: The third space in human–computer interaction. In The Human–Computer Interaction Handbook. CRC Press, 1125–1153.",
      "doi": ""
    },
    {
      "text": "[141] Lisa Nathan, Batya Friedman, and Dave Hendry. 2009. SUSTAINABLY OURS Information System Design as Catalyst: Human Action and Environmental Sustainability. Interactions 16, 4 (jul 2009), 6–11. https://doi.org/10.1145/1551986.1551988",
      "doi": "10.1145/1551986.1551988"
    },
    {
      "text": "[142] Dean Nieusma. 2004. Alternative design scholarship: Working toward appropriate design. Design Issues 20, 3 (2004), 13–24.",
      "doi": ""
    },
    {
      "text": "[143] Safiya Umoja Noble. 2018. Algorithms of oppression. In Algorithms of Oppression. New York University Press.",
      "doi": ""
    },
    {
      "text": "[144] Stephanie Odera, M Alex Wagaman, Ashley Staton, and Aaron Kemmerer. 2021. Decentering whiteness in social work curriculum: An autoethnographic reflection on a racial justice practice course. Advances in Social Work 21, 2/3 (2021), 801–820.",
      "doi": ""
    },
    {
      "text": "[145] Victor Papanek and R Buckminster Fuller. 1972. Design for the real world. (1972).",
      "doi": ""
    },
    {
      "text": "[146] Sachin R Pendse, Amit Sharma, Aditya Vashistha, Munmun De Choudhury, and Neha Kumar. 2021. “Can I Not Be Suicidal on a Sunday?”: Understanding Technology-Mediated Pathways to Mental Health Support. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445410"
    },
    {
      "text": "[147] Hans Persson, Henrik Åhman, Alexander Arvei Yngling, and Jan Gulliksen. 2015. Universal design, inclusive design, accessible design, design for all: different concepts—one goal? On the concept of accessibility—historical, methodological and philosophical aspects. Universal Access in the Information Society 14, 4 (2015), 505–526.",
      "doi": "10.1007/s10209-014-0358-z"
    },
    {
      "text": "[148] Dorian Peters, Susan Hansen, Jenny McMullan, Theresa Ardler, Janet Mooney, and Rafael A Calvo. 2018. \" Participation is not enough\" towards indigenous-led co-design. In Proceedings of the 30th Australian conference on computer-human interaction. 97–101.",
      "doi": "10.1145/3292147.3292204"
    },
    {
      "text": "[149] Emma J Rose, Avery Edenfield, Rebecca Walton, Laura Gonzales, Ann Shivers McNair, Tetyana Zhvotovska, Natasha Jones, Genevieve I Garcia de Mueller, and Kristen Moore. 2018. Social justice in UX: Centering marginalized users. In Proceedings of the 36th ACM International Conference on the Design of Communication. 1–2.",
      "doi": "10.1145/3233756.3233931"
    },
    {
      "text": "[150] Marta Russell. 2019. Capitalism and disability: Selected writings by Marta Russell. Haymarket Books.",
      "doi": ""
    },
    {
      "text": "[151] Alvin Schexnider. 2021. Racial DeckEquity. https://www.docdroid.net/lnmnnjq/racial-deckequity-ver-2-pdf#page=2",
      "doi": ""
    },
    {
      "text": "[152] Douglas Schuler and Aki Namioka. 1993. Participatory design: Principles and practices. CRC Press.",
      "doi": "10.5555/563076"
    },
    {
      "text": "[153] Neil Selwyn. 2004. Reconsidering political and popular understandings of the digital divide. New media & society 6, 3 (2004), 341–362.",
      "doi": ""
    },
    {
      "text": "[154] Amartya Sen. 2012. Values and justice. Journal of Economic Methodology 19, 2 (2012), 101–108.",
      "doi": ""
    },
    {
      "text": "[155] Bibiana Oliveira Serpa, Batista E Silva, 2021. Solidarity as a principle for antisystemic design processes: two cases of alliance with social struggles in Brazil. (2021).",
      "doi": ""
    },
    {
      "text": "[156] Albert Shun, Kat Holms, Kris Woolery, Margaret Price, Doug Kim, Elena Dvorkina, Derek Dietrich-Muller, Nathan Kile, Sara Morris, Joyce Chou, and Sogol Malekzadeh. 2018. Microsoft Inclusive Design Guide. https://www.microsoft.com/design/inclusive/",
      "doi": ""
    },
    {
      "text": "[157] Jesper Simonsen and Toni Robertson. 2013. Routledge international handbook of participatory design. Vol. 711. Routledge New York.",
      "doi": ""
    },
    {
      "text": "[158] Christo Sims. 2017. The politics of design, design as politics. In The Routledge companion to digital ethnography. Routledge, 465–473.",
      "doi": ""
    },
    {
      "text": "[159] Thomas Smyth and Jill Dimond. 2014. Anti-oppressive design. Interactions 21, 6 (2014), 68–71.",
      "doi": "10.1145/2668969"
    },
    {
      "text": "[160] Molly Follette Story. 2001. Principles of universal design. Universal design handbook (2001).",
      "doi": ""
    },
    {
      "text": "[161] Molly Follette Story, James L Mueller, and Ronald L Mace. 1998. The universal design file: Designing for people of all ages and abilities. (1998).",
      "doi": ""
    },
    {
      "text": "[162] Elizabeth Stowell, Teresa K O’Leary, Everlyne Kimani, Michael K Paasche-Orlow, Timothy Bickmore, and Andrea G Parker. 2020. Investigating Opportunities for Crowdsourcing in Church-Based Health Interventions: A Participatory Design Study. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376833"
    },
    {
      "text": "[163] Angelika Strohmayer, Jenn Clamen, and Mary Laing. 2019. Technologies for social justice: Lessons from sex workers on the front lines. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3290605.3300882"
    },
    {
      "text": "[164] Lucy A Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press.",
      "doi": "10.5555/38407"
    },
    {
      "text": "[165] Yngve Sundblad. 2010. UTOPIA: participatory design from Scandinavia to the world. In IFIP Conference on History of Nordic Computing. Springer, 176–186.",
      "doi": ""
    },
    {
      "text": "[166] Jonathan Taplin. 2017. Move fast and break things: How Facebook, Google, and Amazon have cornered culture and what it means for all of us. Pan Macmillan.",
      "doi": ""
    },
    {
      "text": "[167] M.J.F. Tella. 2008. Equity and Law. Martinus Nijhoff Publishers. https://books.google.ca/books?id=2piPE9DYpGoC",
      "doi": ""
    },
    {
      "text": "[168] Henk ten Have and Maria do Céu Patrão Neves. 2021. Dictionary of Global Bioethics. Springer Verlag.",
      "doi": ""
    },
    {
      "text": "[169] Joyce Thomas, David Smith, and Doris Wells-Papanek. 2021. Studio-Based Learning Strategies Inspire Thoughtful and Purposeful Designers. In Advances in Industrial Design: Proceedings of the AHFE 2021 Virtual Conferences on Design for Inclusion, Affective and Pleasurable Design, Interdisciplinary Practice in Industrial Design, Kansei Engineering, and Human Factors for Apparel and Textile Engineering, July 25-29, 2021, USA. Springer, 167–176.",
      "doi": ""
    },
    {
      "text": "[170] Bettina Törpel, Alex Voss, Mark Hartswood, and Rob Procter. 2009. Participatory design: Issues and approaches in dynamic constellations of use, design, and research. In Configuring User-Designer Relations. Springer, 13–29.",
      "doi": ""
    },
    {
      "text": "[171] Sophie Toupin. 2014. Feminist hackerspaces: The synthesis of feminist and hacker cultures. Journal of Peer Production 5, 2014 (2014), 1–11.",
      "doi": ""
    },
    {
      "text": "[172] Jutta Treviranus and Community Contributors. 2017. Inclusive Design Guide. https://guide.inclusivedesign.ca/",
      "doi": ""
    },
    {
      "text": "[173] Victor Udoewa. 2022. Radical Participatory Design: Awareness of Participation. Journal of Awareness-Based Systems Change 2, 2 (2022), 59–84.",
      "doi": ""
    },
    {
      "text": "[174] Sim Van der Ryn and Stuart Cowan. 2013. Ecological design. Island press.",
      "doi": ""
    },
    {
      "text": "[175] Jan Van Dijk. 2020. The digital divide. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "[176] Ulrich von Zadow and Raimund Dachselt. 2017. Research on HCI Toolkits and Toolkits for HCI Research: A Comparison. (2017).",
      "doi": ""
    },
    {
      "text": "[177] Sam Waller, Joy Goodman-Deane, Mike Bradley, Ian Hosking, Pat Langdon, and John Clarkson. 2007. Cambridge Inclusive Design Toolkit. inclusivedesigntoolkit.com/",
      "doi": ""
    },
    {
      "text": "[178] Greg Walsh. 2018. Towards equity and equality in American co-design: a case study. In Proceedings of the 17th ACM Conference on Interaction Design and Children. 434–440.",
      "doi": "10.1145/3202185.3202768"
    },
    {
      "text": "[179] Leslie Weisman. 1994. Discrimination by design: A feminist critique of the man-made environment. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "[180] Anne-Marie Willis. 2006. Ontological designing. Design philosophy papers 4, 2 (2006), 69–92.",
      "doi": ""
    },
    {
      "text": "[181] Langdon Winner. 2017. Do artifacts have politics? In Computer Ethics. Routledge, 177–192.",
      "doi": ""
    },
    {
      "text": "[182] Suzie Wise. 2022. Design for Belonging. https://www.designforbelonging.com/",
      "doi": ""
    },
    {
      "text": "[183] Richmond Y Wong, Michael A Madaio, and Nick Merrill. 2022. Seeing Like a Toolkit: How Toolkits Envision the Work of AI Ethics. arXiv preprint arXiv:2202.08792 (2022).",
      "doi": ""
    },
    {
      "text": "[184] Marisol Wong-Villacres, Aakash Gautam, Wendy Roldan, Lucy Pei, Jessa Dickinson, Azra Ismail, Betsy DiSalvo, Neha Kumar, Tammy Clegg, Sheena Erete, 2020. From needs to strengths: Operationalizing an assets-based design of technology. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. 527–535.",
      "doi": "10.1145/3406865.3418594"
    },
    {
      "text": "[185] Hitomi Yokota. 2022. Inclusive Co-Design Design Toolkit. http://info.bridgeable.com/inclusive_codesign_toolkit",
      "doi": ""
    },
    {
      "text": "[186] Daisy Yoo, Alina Huldtgren, Jill Palzkill Woelfer, David G. Hendry, and Batya Friedman. 2013. A Value Sensitive Action-Reflection Model: Evolving a Co-Design Space with Stakeholder and Designer Prompts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 419–428. https://doi.org/10.1145/2470654.2470715",
      "doi": "10.1145/2470654.2470715"
    },
    {
      "text": "[187] H Peyton Young. 1995. Equity: in theory and practice. Princeton University Press.",
      "doi": ""
    }
  ]
}