{
  "doi": "10.1145/3544548.3581191",
  "title": "The Effect of Movement Direction, Hand Dominance, and Hemispace on Reaching Movement Kinematics in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "When users reach their arms to different locations in physical space, they often adapt how they move (i.e., kinematic properties of their reaches) depending on the: (1) direction they move, (2) hand they use, and (3) side of the body where the movement occurs. However, it is not yet clear if and how these three properties of reaching tasks may interact to influence users’ behavior when they reach to objects in VR. To address this question, we had users perform virtual hand reaches in five different directions, on both sides of their bodies, using both their dominant and non-dominant hands. The results revealed that users adapted their virtual hand reaching movements in response to changes in all three properties. The findings provide practitioners insights on how to measure and interpret users’ movements, which has applicability in emerging contexts that include detecting VR usability issues and using VR for stroke rehabilitation.",
  "tags": [
    "virtual hand",
    "movement kinematics",
    "virtual reality",
    "pointing",
    "reaching"
  ],
  "authors": [
    {
      "name": "Logan D Clark",
      "institution": "Engineering Systems and Environment, University of Virginia, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237291",
      "orcid": "0000-0001-6882-7539"
    },
    {
      "name": "Mohamad El Iskandarani",
      "institution": "Engineering Systems and Environment, University of Virginia, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778991",
      "orcid": "0000-0002-2779-474X"
    },
    {
      "name": "Sara L Riggs",
      "institution": "Engineering Systems and Environment, University of Virginia, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659531652",
      "orcid": "0000-0002-0112-9469"
    }
  ],
  "references": [
    {
      "text": "Julian Abich, Jason Parker, Jennifer S. Murphy, and Morgan Eudy. 2021. A review of the evidence for training effectiveness with virtual reality technology. Virtual Reality 25, 4: 919–933. https://doi.org/10.1007/s10055-020-00498-8",
      "doi": "10.1007/s10055-020-00498-8"
    },
    {
      "text": "Jos J. Adam, Stijn Parthoens, and Jay Pratt. 2006. Distinct mechanisms for planning keypress and reaching responses: A developmental study. Human Movement Science 25, 3: 293–309. https://doi.org/10.1016/j.humov.2006.03.005",
      "doi": ""
    },
    {
      "text": "Sara Arlati, Noël Keijsers, Gabriele Paolini, Giancarlo Ferrigno, and Marco Sacco. 2021. Kinematics of aimed movements in ecological immersive virtual reality: a comparative study with real world. Virtual Reality 26, 3: 1–17. https://doi.org/10.1007/s10055-021-00603-5",
      "doi": "10.1007/s10055-021-00603-5"
    },
    {
      "text": "Leia B. Bagesteiro and Robert L. Sainburg. 2002. Handedness: Dominant Arm Advantages in Control of Limb Dynamics. Journal of Neurophysiology 88, 5: 2408–2421. https://doi.org/10.1152/jn.00901.2001",
      "doi": ""
    },
    {
      "text": "S. Balasubramanian, A. Melendez-Calderon, and E. Burdet. 2012. A Robust and Sensitive Metric for Quantifying Movement Smoothness. IEEE Transactions on Biomedical Engineering 59, 8: 2126–2136. https://doi.org/10.1109/TBME.2011.2179545",
      "doi": ""
    },
    {
      "text": "Sivakumar Balasubramanian, Alejandro Melendez-Calderon, Agnes Roby-Brami, and Etienne Burdet. 2015. On the analysis of movement smoothness. Journal of NeuroEngineering and Rehabilitation 12, 1: 112. https://doi.org/10.1186/s12984-015-0090-9",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models using lme4. Journal of Statistical Software 67, 1: 1–48.",
      "doi": ""
    },
    {
      "text": "Anil Ufuk Batmaz, Mayra Donaji, Barrera Machuca, Duc Minh Pham, and Wolfgang Stuerzlinger. 2019. Do Head-Mounted Display Stereo Deficiencies Affect 3D Pointing Tasks in AR and VR? In IEEE Conference on Virtual Reality and 3D User Interfaces.",
      "doi": ""
    },
    {
      "text": "Anil Ufuk Batmaz, Xintian Sun, Dogu Taskiran, and Wolfgang Stuerzlinger. 2020. Eye-Hand Coordination Training for Sports with Mid-air VR. In 26th ACM Symposium on Virtual Reality Software and Technology, 1–10. https://doi.org/10.1145/3385956.3418971",
      "doi": "10.1145/3385956.3418971"
    },
    {
      "text": "Nicolas Bayle, Mathieu Lempereur, Emilie Hutin, Damien Motavasseli, Olivier Remy-Neris, Jean-Michel Gracies, and Gwenaël Cornec. 2022. Comparison of Various Smoothness Metrics for Upper Limb Movements in Healthy Subjects. In Review. https://doi.org/10.21203/rs.3.rs-1431894/v1",
      "doi": ""
    },
    {
      "text": "Robert J. van Beers, Patrick Haggard, and Daniel M. Wolpert. 2004. The Role of Execution Noise in Movement Variability. Journal of Neurophysiology 91, 2: 1050–1063. https://doi.org/10.1152/jn.00652.2003",
      "doi": ""
    },
    {
      "text": "Simon J Bennett, Digby Elliott, and Andre Rodacki. 2012. Movement strategies in vertical aiming of older adults. Experimental Brain Research 216: 445–455. https://doi.org/10.1007/s00221-011-2947-x",
      "doi": ""
    },
    {
      "text": "Bastien Berret, Adrien Conessa, Nicolas Schweighofer, and Etienne Burdet. 2021. Stochastic optimal feedforward-feedback control determines timing and variability of arm movements with or without vision. PLOS Computational Biology 17, 6: e1009047. https://doi.org/10.1371/journal.pcbi.1009047",
      "doi": ""
    },
    {
      "text": "John L. Bradshaw, Judy A. Bradshaw, and Norman C. Nettleton. 1990. Abduction, adduction and hand differences in simple and serial movements. Neuropsychologia 28, 9: 917–931. https://doi.org/10.1016/0028-3932(90)90108-Z",
      "doi": ""
    },
    {
      "text": "James J. Burkitt, Raoul M. Bongers, Digby Elliott, Steve Hansen, and James L. Lyons. 2017. Extending Energy Optimization in Goal-Directed Aiming from Movement Kinematics to Joint Angles. Journal of Motor Behavior 49, 2: 129–140. https://doi.org/10.1080/00222895.2016.1161592",
      "doi": ""
    },
    {
      "text": "David P. Carey and Jonathan Liddle. 2013. Hemifield or hemispace: what accounts for the ipsilateral advantages in visually guided aiming? Experimental Brain Research 230, 3: 323–331. https://doi.org/10.1007/s00221-013-3657-3",
      "doi": ""
    },
    {
      "text": "David P Carey and E Otto-de Haart. 2001. Hemispatial differences in visually guided aiming are neither hemispatial nor visual. Neuropsychologia 39, 9: 885–894. https://doi.org/10.1016/S0028-3932(01)00036-7",
      "doi": ""
    },
    {
      "text": "DavidP. Carey, EricL. Hargreaves, and MelvynA. Goodale. 1996. Reaching to ipsilateral or contralateral targets: within-hemisphere visuomotor processing cannot explain hemispatial differences in motor control. Experimental Brain Research 112, 3. https://doi.org/10.1007/BF00227955",
      "doi": ""
    },
    {
      "text": "Richard G. Carson, Romeo Chua, Digby Elliott, and David Goodman. 1990. The contribution of vision to asymmetries in manual aiming. Neuropsychologia 28, 11: 1215–1220. https://doi.org/10.1016/0028-3932(90)90056-T",
      "doi": ""
    },
    {
      "text": "Yeonjoo Cha and Rohae Myung. 2013. Extended Fitts’ law for 3D pointing tasks using 3D target arrangements. International Journal of Industrial Ergonomics 43, 4: 350–355. https://doi.org/10.1016/j.ergon.2013.05.005",
      "doi": ""
    },
    {
      "text": "Romeo Chua and Digby Elliott. 1993. Visual Regulation of Manual Aiming. McMaster University.",
      "doi": ""
    },
    {
      "text": "Logan D. Clark, Aakash Bhagat, and Sara L. Riggs. 2020. Extending Fitts’ Law in Three-Dimensional Virtual Environments with Current Low-Cost Virtual Reality Technology. International Journal of Human-Computer Studies 139, February: 102413. https://doi.org/10.1016/j.ijhcs.2020.102413",
      "doi": ""
    },
    {
      "text": "Logan D. Clark and Sara L. Riggs. 2019. Investigating the Use of Movement Kinematics to Assess Perceptual Ambiguity in Virtual Reality. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 63, 1: 2318–2322. https://doi.org/10.1177/1071181319631156",
      "doi": ""
    },
    {
      "text": "Logan D. Clark and Sara L. Riggs. 2020. Movement Strategies in Virtual Reality: The Influence of Effort Costs and Target Depth. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 64, 1: 1600–1604. https://doi.org/10.1177/1071181320641385",
      "doi": ""
    },
    {
      "text": "Logan D. Clark and Sara L. Riggs. 2021. Movement Strategies in Virtual Reality: Exploring the Influence of 3D Endpoint Variability. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 65, 1: 91–95. https://doi.org/10.1177/1071181321651101",
      "doi": ""
    },
    {
      "text": "Ersin Dincelli and Alper Yayla. 2022. Immersive virtual reality in the age of the Metaverse: A hybrid-narrative review based on the technology affordance perspective. The Journal of Strategic Information Systems 31, 2: 101717. https://doi.org/10.1016/j.jsis.2022.101717",
      "doi": "10.1016/j.jsis.2022.101717"
    },
    {
      "text": "Pablo Domínguez-Téllez, Jose A Moral-Muñoz, Alejandro Salazar, Esteban Casado-Fernández, and David Lucena-Antón. 2020. Game-Based Virtual Reality Interventions to Improve Upper Limb Motor Function and Quality of Life After Stroke: Systematic Review and Meta-analysis. Games for Health Journal 9, 1: 1–10.",
      "doi": ""
    },
    {
      "text": "Robert R.A. van Doorn. 2008. Manual asymmetries in the temporal and spatial control of aimed movements. Human Movement Science 27, 4: 551–576. https://doi.org/10.1016/j.humov.2007.11.006",
      "doi": ""
    },
    {
      "text": "Digby Elliott, Chris Dutoy, Matthew Andrew, James J Burkitt, James L Lyons, Spencer J Hayes, and Simon J Bennett. 2014. The Influence of Visual Feedback and Prior Knowledge About Feedback on Vertical Aiming Strategies. Journal of Motor Behavior 46, 6: 12.",
      "doi": ""
    },
    {
      "text": "Digby Elliott, Steve Hansen, Lawrence E. M. Grierson, James Lyons, Simon J. Bennett, and Spencer J. Hayes. 2010. Goal-directed aiming: Two components but multiple processes. Psychological Bulletin 136, 6: 1023–1044. https://doi.org/10.1037/a0020958",
      "doi": ""
    },
    {
      "text": "Digby Elliott, Steven Hansen, Jocelyn Mendoza, and Luc Tremblay. 2004. Learning to Optimize Speed, Accuracy, and Energy Expenditure: A Framework for Understanding Speed-Accuracy Relations in Goal-Directed Aiming. Journal of Motor Behavior 36, 3: 339–351. https://doi.org/10.3200/JMBR.36.3.339-351",
      "doi": ""
    },
    {
      "text": "Digby Elliott, James Lyons, Spencer J. Hayes, James J. Burkitt, Steve Hansen, Lawrence E. M. Grierson, Nathan C. Foster, James W. Roberts, and Simon J. Bennett. 2020. The multiple process model of goal-directed aiming/reaching: insights on limb control from various special populations. Experimental Brain Research: 1–15. https://doi.org/10.1007/s00221-020-05952-2",
      "doi": ""
    },
    {
      "text": "Digby Elliott, James Lyons, Spencer J. Hayes, James J. Burkitt, James W. Roberts, Lawrence E.M. Grierson, Steve Hansen, and Simon J. Bennett. 2017. The multiple process model of goal-directed reaching revisited. Neuroscience & Biobehavioral Reviews 72: 95–110. https://doi.org/10.1016/j.neubiorev.2016.11.016",
      "doi": ""
    },
    {
      "text": "Shirana Asmi Farook, Kshtrashal Singh, Susmitha Govind, Yu Chye Wah, Rishi Kesavan, and Elanchezian Chinnavan. 2018. Impact of Virtual Reality Training in Rehabilitation of Stroke Patients: A Cross Sectional Review. Journal of Neuroscience 8, 1: 16–20.",
      "doi": ""
    },
    {
      "text": "Jamille A Feitosa, Corina A Fernandes, Raphael F Casseb, and Gabriela Castellano. 2021. Effects of virtual reality-based motor rehabilitation: a systematic review of fMRI studies. Journal of Neural Engineering in press. https://doi.org/10.1088/1741-2552/ac456e",
      "doi": ""
    },
    {
      "text": "Laure Fernandez and Reinoud J. Bootsma. 2004. Effects of biomechanical and task constraints on the organization of movement in precision aiming. Experimental Brain Research 159, 4: 458–466. https://doi.org/10.1007/s00221-004-1964-4",
      "doi": ""
    },
    {
      "text": "Jason W. Flindall, Jon B. Doan, and Claudia L. R. Gonzalez. 2014. Manual asymmetries in the kinematics of a reach-to-grasp action. Laterality: Asymmetries of Body, Brain and Cognition 19, 4: 489–507. https://doi.org/10.1080/1357650X.2013.862540",
      "doi": ""
    },
    {
      "text": "Jeremie Gaveau, Bastien Berret, Dora E Angelaki, and Charalambos Papaxanthis. 2016. Direction-dependent arm kinematics reveal optimal integration of gravity cues. eLife 5: e16394. https://doi.org/10.7554/eLife.16394",
      "doi": ""
    },
    {
      "text": "R. Gentili, V. Cahouet, and C. Papaxanthis. 2007. Motor planning of arm movements is direction-dependent in the gravity field. Neuroscience 145, 1: 20–32. https://doi.org/10.1016/j.neuroscience.2006.11.035",
      "doi": ""
    },
    {
      "text": "Peter Gianaros, Eric Muth, Toby Mordkoff, Max Levine, and Robert Stern. 2001. A Questionnaire for the Assessment of the Multiple Dimensions of Motion Sickness. Aviat Space Environ Med. 72, 2: 115–119.",
      "doi": ""
    },
    {
      "text": "Gurkeerat Gill and Vilma Dudonienė. 2019. Virtual reality therapy for upper extremity functions following stroke: A systematic review. Reabilitacijos mokslai: slauga, kineziterapija, ergoterapija 2, 21. https://doi.org/10.33607/rmske.v2i21.826",
      "doi": ""
    },
    {
      "text": "Hui-Ting Goh, Jill C Stewart, Kevin Becker, and Cheng-Ju Hung. 2022. Perceived effort for reaching is associated with self-reported fatigue. Journal of Motor Behavior 54, 1: 14–26. https://doi.org/10.1080/00222895.2021.1871877",
      "doi": ""
    },
    {
      "text": "James Gordon, M Felice Ghilardi, Scott Cooper, and Claude Ghez. 1994. Accuracy of planar reaching movements II: Systematic extent errors resulting from inertial anistrophy. Experimental Brain Research 99: 112–130.",
      "doi": ""
    },
    {
      "text": "Paul L. Gribble and David J. Ostry. 1999. Compensation for Interaction Torques During Single- and Multijoint Limb Movement. Journal of Neurophysiology 82, 5: 2310–2326. https://doi.org/10.1152/jn.1999.82.5.2310",
      "doi": ""
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2004. Pointing at Trivariate Targets in 3D Environments. Proceedings of the 2004 conference on Human factors in computing systems - CHI ’04 6, 1: 447–454. https://doi.org/10.1145/985692.985749",
      "doi": "10.1145/985692.985749"
    },
    {
      "text": "Maria Gutierrez-Herrera, Styrmir Saevarsson, Thomas Huber, Joachim Hermsdörfer, and Waltraud Stadler. 2017. Repetitive TMS in right sensorimotor areas affects the selection and completion of contralateral movements. Cortex 90: 46–57. https://doi.org/10.1016/j.cortex.2017.02.009",
      "doi": ""
    },
    {
      "text": "Adrian M. Haith, David M. Huberdeau, and John W. Krakauer. 2015. Hedging Your Bets: Intermediate Movements as Optimal Behavior in the Context of an Incomplete Decision. PLOS Computational Biology 11, 3: e1004171. https://doi.org/10.1371/journal.pcbi.1004171",
      "doi": ""
    },
    {
      "text": "Majid Hajihosseinali, Saeed Behzadipour, Ghorban Taghizadeh, and Farzam Farahmand. 2022. Direction-dependency of the Kinematic Indices in Upper Extremities Motor Assessment of Stroke Patients. Medical Engineering & Physics: 103880. https://doi.org/10.1016/j.medengphy.2022.103880",
      "doi": ""
    },
    {
      "text": "Steve Hansen, Digby Elliott, and Michael A. Khan. 2007. Comparing derived and acquired acceleration profiles: 3-D optical electronic data analyses. Behavior Research Methods 39, 4: 748–754. https://doi.org/10.3758/BF03192965",
      "doi": ""
    },
    {
      "text": "Rorik Henrikson, Tovi Grossman, Sean Trowbridge, Daniel Wigdor, and Hrvoje Benko. 2020. Head-Coupled Kinematic Template Matching: A Prediction Model for Ray Pointing in VR. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3313831.3376489",
      "doi": "10.1145/3313831.3376489"
    },
    {
      "text": "John M. Hollerbach and Tamar Flash. 1982. Dynamic interactions between limb segments during planar arm movement. Massachusetts Institute of Technology Artificial Intelligence Laboratory.",
      "doi": ""
    },
    {
      "text": "Sture Holm. 1979. A Simple Sequentially Rejective Multiple Test Procedure. Scand J Statist 6, 2: 65–70.",
      "doi": ""
    },
    {
      "text": "Conor Kaminer, Kevin LeBras, Jordan McCall, Tan Phan, Paul Naud, Mircea Teodorescu, and Sri Kurniawan. 2014. An immersive physical therapy game for stroke survivors. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility - ASSETS ’14, 299–300. https://doi.org/10.1145/2661334.2661340",
      "doi": "10.1145/2661334.2661340"
    },
    {
      "text": "Dorota Kamińska, Grzegorz Zwoliński, and Anna Laska-Leśniewicz. 2022. Usability Testing of Virtual Reality Applications—The Pilot Study. Sensors 22, 4: 1342. https://doi.org/10.3390/s22041342",
      "doi": ""
    },
    {
      "text": "Christoph M. Kanzler, Mike D. Rinderknecht, Anne Schwarz, Ilse Lamers, Cynthia Gagnon, Jeremia P. O. Held, Peter Feys, Andreas R. Luft, Roger Gassert, and Olivier Lambercy. 2020. A data-driven framework for selecting and validating digital health metrics: use-case in neurological sensorimotor impairments. npj Digital Medicine 3, 1: 80. https://doi.org/10.1038/s41746-020-0286-7",
      "doi": ""
    },
    {
      "text": "Ron F. Keulen, Jos J. Adam, Martin H. Fischer, Harm Kuipers, and Jelle Jolles. 2007. Distractor Interference in Selective Reaching: Effects of Hemispace, Movement Direction, and Type of Movement. Cortex 43, 4: 531–541. https://doi.org/10.1016/S0010-9452(08)70247-8",
      "doi": ""
    },
    {
      "text": "Azka Khan, Anna Podlasek, and Fahad Somaa. 2021. Virtual reality in post-stroke neurorehabilitation – a systematic review and meta-analysis. Topics in Stroke Rehabilitation: 1–20. https://doi.org/10.1080/10749357.2021.1990468",
      "doi": ""
    },
    {
      "text": "Michael A. Khan, Ian M. Franks, and David Goodman. 1998. The Effect of Practice on the Control of Rapid Aiming Movements: Evidence for an Interdependency Between Programming and Feedback Processing. The Quarterly Journal of Experimental Psychology Section A 51, 2: 425–443. https://doi.org/10.1080/713755756",
      "doi": ""
    },
    {
      "text": "Wondae Kim, John Buchanan, and Carl Gabbard. 2011. Constraints on Arm Selection Processes When Reaching: Degrees of Freedom and Joint Amplitudes Interact to Influence Limb Selection. Journal of Motor Behavior 43, 5: 403–411. https://doi.org/10.1080/00222895.2011.619222",
      "doi": ""
    },
    {
      "text": "Wondae Kim, Carl Gabbard, John J. Buchanan, and Young U. Ryu. 2007. Right-Handers’ Reaching in Contralateral Hemispace: A Kinematic Observation. Journal of Motor Behavior 39, 6: 451–456. https://doi.org/10.3200/JMBR.39.6.451-456",
      "doi": ""
    },
    {
      "text": "Luiz A. Knaut, Sandeep K. Subramanian, Bradford J. McFadyen, Daniel Bourbonnais, and Mindy F. Levin. 2009. Kinematics of Pointing Movements Made in a Virtual Versus a Physical 3-Dimensional Environment in Healthy and Stroke Subjects. Archives of Physical Medicine and Rehabilitation 90, 5: 793–802. https://doi.org/10.1016/j.apmr.2008.10.030",
      "doi": ""
    },
    {
      "text": "G Kwakkel, Erwin E.H. van Wegen, Jane H. Burridge, C. J. Winstein, Liesjet Elisabeth Henriette Van Dokkum, Margit Alt Murphy, M. F. Levin, and J. W. Krakauer. 2019. Standardized Measurement of Quality of Upper Limb Movement After Stroke: Consensus-Based Core Recommendations From the Second Stroke Recovery and Rehabilitation Roundtable. Neurorehabilitation and Neural Repair 33, 11: 951–958.",
      "doi": ""
    },
    {
      "text": "Nan M. Laird and James H. Ware. 1982. Random-Effects Models for Longitudinal Data. Biometrics 38, 4: 963–974.",
      "doi": ""
    },
    {
      "text": "KE Laver. 2018. Virtual reality for stroke rehabilitation (Review). Cochrane Database of Systematic Reviews: 164.",
      "doi": ""
    },
    {
      "text": "Han Suk Lee, Yoo Junk Park, and Sun Wook Park. 2019. The Effects of Virtual Reality Training on Function in Chronic Stroke Patients: A Systematic Review and Meta-Analysis. BioMed Research International 2019: 1–12. https://doi.org/10.1155/2019/7595639",
      "doi": ""
    },
    {
      "text": "Paul Lubos, Gerd Bruder, and Frank Steinicke. 2014. Analysis of Direct Selection in Head-Mounted Display Environments. 2014 IEEE Symposium on 3D User Interfaces: 11–18.",
      "doi": ""
    },
    {
      "text": "James Lyons, Steve Hansen, Suzanne Hurding, and Digby Elliott. 2006. Optimizing rapid aiming behaviour: movement kinematics depend on the cost of corrective modifications. Experimental Brain Research 174, 1: 95–100. https://doi.org/10.1007/s00221-006-0426-6",
      "doi": ""
    },
    {
      "text": "Mayra Donaji Barrera Machuca and Wolfgang Stuerzlinger. 2019. The Effect of Stereo Display Deficiencies on Virtual Hand Pointing. Proceedings of CHI Conference on Human Factors in Computing Systems Proceedings (CHI2019): 14. https://doi.org/10.1145/3290605.3300437",
      "doi": "10.1145/3290605.3300437"
    },
    {
      "text": "I. Scott MacKenzie. 1989. A Note on the Information-Theoretic Basis for Fitts’ Law. Journal of Motor Behavior 21, 3: 323–330. https://doi.org/10.1080/00222895.1989.10735486",
      "doi": ""
    },
    {
      "text": "Mathworks Inc. 2021. MATLAB.",
      "doi": ""
    },
    {
      "text": "Destaw B. Mekbib, Jiawei Han, Li Zhang, Shan Fang, Hongjie Jiang, Junming Zhu, Anna W. Roe, and Dongrong Xu. 2020. Virtual reality therapy for upper limb rehabilitation in patients with stroke: a meta-analysis of randomized clinical trials. Brain Injury 34, 4: 456–465. https://doi.org/10.1080/02699052.2020.1725126",
      "doi": ""
    },
    {
      "text": "Ruud G.J. Meulenbroek and Arnold J.W.M. Thomassen. 1991. Stroke-direction preferences in drawing and handwriting. Human Movement Science 10, 2–3: 247–270. https://doi.org/10.1016/0167-9457(91)90006-J",
      "doi": ""
    },
    {
      "text": "Mark R Mine. 1995. Virtual Environment Interaction Techniques. University of North Carolina, Chapel Hill, NC.",
      "doi": ""
    },
    {
      "text": "Robert Mihai Mira, Lorenzo Molinari Tosatti, Marco Sacco, and Alessandro Scano. 2021. Detailed characterization of physiological EMG activations and directional tuning of upper-limb and trunk muscles in point-to-point reaching movements. Current Research in Physiology 4: 60–72. https://doi.org/10.1016/j.crphys.2021.02.005",
      "doi": ""
    },
    {
      "text": "Mohamed Irfan Mohamed Refai, Mique Saes, Bouke L. Scheltinga, Joost van Kordelaar, Johannes B. J. Bussmann, Peter H. Veltink, Jaap H. Buurke, Carel G. M. Meskers, Erwin E. H. van Wegen, Gert Kwakkel, and Bert-Jan F. van Beijnum. 2021. Smoothness metrics for reaching performance after stroke. Part 1: which one to choose? Journal of NeuroEngineering and Rehabilitation 18, 1: 154. https://doi.org/10.1186/s12984-021-00949-6",
      "doi": ""
    },
    {
      "text": "Marta A Montalbán and Oscar Arrogante. 2020. Rehabilitation through virtual reality therapy after a stroke: A literature review. Revista Científica de la Sociedad de Enfermería Neurológica (English ed.) 52: 19–27.",
      "doi": ""
    },
    {
      "text": "Seyyed Ahmad Mousavi, Mehdi Shahbazi, Elahe Arabameri, and Elham Shirzad. 2019. The Effect of Virtual Reality Training on Learning and Kinematics Characteristics of Dart Throwing. International Journal of School Health In Press, In Press. https://doi.org/10.5812/intjsh.84300",
      "doi": ""
    },
    {
      "text": "Margit Alt Murphy and Charlotte K Hager. 2015. Kinematic analysis of the upper extremity after stroke – how far have we reached and what have we grasped? Physical Therapy Reviews 20, 3: 137–155.",
      "doi": ""
    },
    {
      "text": "Eliza L. Nelson, Neil E. Berthier, and George D. Konidaris. 2018. Handedness and Reach-to-Place Kinematics in Adults: Left-Handers Are Not Reversed Right-Handers. Journal of Motor Behavior 50, 4: 381–391. https://doi.org/10.1080/00222895.2017.1363698",
      "doi": ""
    },
    {
      "text": "Richard C. Oldfield. 1971. The assessment and analysis of handedness: The Edinburgh inventory. Neuropsychologia 9, 1: 97–113.",
      "doi": ""
    },
    {
      "text": "Flavio T P Oliveira, Digby Elliott, and David Goodman. 2005. Energy-Minimization Bias: Compensating for Intrinsic Influence of Energy-Minimization Mechanisms. Motor Control 9: 101–114.",
      "doi": ""
    },
    {
      "text": "Charalambos Papaxanthis, Thierry Pozzo, and Marco Schieppati. 2003. Trajectories of arm pointing movements on the sagittal plane vary with both direction and speed. Experimental Brain Research 148, 4: 498–503. https://doi.org/10.1007/s00221-002-1327-y",
      "doi": ""
    },
    {
      "text": "Charalambos Papaxanthis, Thierry Pozzo, and Paul Stapley. 1998. Effects of movement direction upon kinematic characteristics of vertical arm pointing movements in man. Neuroscience Letters 253, 2: 103–106. https://doi.org/10.1016/S0304-3940(98)00604-1",
      "doi": ""
    },
    {
      "text": "SuHo Park, DongGeon Lee, SoungKyun Hong, KiHun Cho, and GyuChang Lee. 2021. Feasibility of training using full immersion virtual reality video game in young stroke survivor: A case report. NeuroRehabilitation 48, 1: 1–8. https://doi.org/10.3233/NRE-201501",
      "doi": ""
    },
    {
      "text": "Gabriel Poirier, Mélanie Lebigre, France Mourey, Charalambos Papaxanthis, and Jeremie Gaveau. 2022. Muscle effort is best minimized by the right-dominant arm in the gravity field. Journal of Neurophysiology 127: 1117–1126. https://doi.org/10.1101/2021.07.13.452146",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev and Tadap Ichikawa. 1999. Manipulating Objects in Virtual Worlds: Categorization and Empirical Evaluation of Interaction Techniques. Journal of Visual Languages & Computing 10, 1: 19–35. https://doi.org/10.1006/jvlc.1998.0112",
      "doi": "10.1006/jvlc.1998.0112"
    },
    {
      "text": "Gerdienke B. Prange-Lasonder, Margit Alt Murphy, Ilse Lamers, Ann-Marie Hughes, Jaap H. Buurke, Peter Feys, Thierry Keller, Verena Klamroth-Marganska, Ina M. Tarkka, Annick Timmermans, and Jane H. Burridge. 2021. European evidence-based recommendations for clinical assessment of upper limb in neurorehabilitation (CAULIN): data synthesis from systematic reviews, clinical practice guidelines and expert consensus. Journal of NeuroEngineering and Rehabilitation 18, 1: 1–12. https://doi.org/10.1186/s12984-021-00951-y",
      "doi": ""
    },
    {
      "text": "Jay Pratt and Richard A. Adams. 1996. Practice and component submovements: The roles of programming and feedback in rapid aimed limb movements. Journal of Motor Behavior 28: 49–146.",
      "doi": ""
    },
    {
      "text": "R Core Team. 2021. R.",
      "doi": ""
    },
    {
      "text": "Unnikrishnan Radhakrishnan, Konstantinos Koumaditis, and Francesco Chinello. 2021. A systematic review of immersive virtual reality for industrial skills training. Behaviour & Information Technology 40, 12: 1310–1339. https://doi.org/10.1080/0144929X.2021.1954693",
      "doi": ""
    },
    {
      "text": "Miya K. Rand and Sebastian Rentsch. 2017. Eye–hand coordination during visuomotor adaptation: effects of hemispace and joint coordination. Experimental Brain Research 235, 12: 3645–3661. https://doi.org/10.1007/s00221-017-5088-z",
      "doi": ""
    },
    {
      "text": "Rebekka S. Renner, Boris M. Velichkovsky, and Jens R. Helmert. 2013. The perception of egocentric distances in virtual environments - A review. ACM Computing Surveys 46, 2: 1–40. https://doi.org/10.1145/2543581.2543590",
      "doi": "10.1145/2543581.2543590"
    },
    {
      "text": "James W. Roberts. 2020. Energy minimization within target-directed aiming: the mediating influence of the number of movements and target size. Experimental Brain Research 238, 3: 741–749. https://doi.org/10.1007/s00221-020-05750-w",
      "doi": ""
    },
    {
      "text": "R. L. Sainburg, C. Ghez, and D. Kalakanis. 1999. Intersegmental Dynamics Are Controlled by Sequential Anticipatory, Error Correction, and Postural Mechanisms. Journal of Neurophysiology 81, 3: 1045–1056. https://doi.org/10.1152/jn.1999.81.3.1045",
      "doi": ""
    },
    {
      "text": "R. L. Sainburg and D. Kalakanis. 2000. Differences in Control of Limb Dynamics During Dominant and Nondominant Arm Reaching. Journal of Neurophysiology 83, 5: 2661–2675. https://doi.org/10.1152/jn.2000.83.5.2661",
      "doi": ""
    },
    {
      "text": "Robert Sainburg. 2002. Evidence for a dynamic-dominance hypothesis of handedness. Experimental Brain Research 142, 2: 241–258. https://doi.org/10.1007/s00221-001-0913-8",
      "doi": ""
    },
    {
      "text": "Robert L. Sainburg. 2014. Convergent models of handedness and brain lateralization. Frontiers in Psychology 5: 1092. https://doi.org/10.3389/fpsyg.2014.01092",
      "doi": ""
    },
    {
      "text": "Joseph P. Salisbury, Ted M. Aronson, and Tony J. Simon. 2020. At-Home Self-Administration of an Immersive Virtual Reality Therapeutic Game for Post-Stroke Upper Limb Rehabilitation. In Extended Abstracts of the 2020 Annual Symposium on Computer-Human Interaction in Play, 114–121. https://doi.org/10.1145/3383668.3419935",
      "doi": "10.1145/3383668.3419935"
    },
    {
      "text": "Jacob E. Schaffer and Robert L. Sainburg. 2017. Interlimb differences in coordination of unsupported reaching movements. Neuroscience 350: 54–64. https://doi.org/10.1016/j.neuroscience.2017.03.025",
      "doi": ""
    },
    {
      "text": "Joost J. Schillings, Ruud G. J. Meulenbroek, and Arnold J. W. M. Thomassen. 1996. Limb Segment Recruitment as a Function of Movement Direction, Amplitude, and Speed. Journal of Motor Behavior 28, 3: 241–254. https://doi.org/10.1080/00222895.1996.9941749",
      "doi": ""
    },
    {
      "text": "Anne Schwarz, Christoph M Kanzler, Olivier Lambercy, Andreas R Luft, and Janne M Veerbeek. 2019. Systematic Review on Kinematic Assessments of Upper Limb Movements After Stroke. Stroke 50, 3: 718–727.",
      "doi": ""
    },
    {
      "text": "Jill Campbell Stewart, James Gordon, and Carolee J Winstein. 2013. Planning and adjustments for the control of reach extent in a virtual environment. Journal of NeuroEngineering and Rehabilitation 10, 1: 27. https://doi.org/10.1186/1743-0003-10-27",
      "doi": ""
    },
    {
      "text": "John F. Stins, Endre E. Kadar, and Alan Costall. 2001. A kinematic analysis of hand selection in a reaching task. Laterality: Asymmetries of Body, Brain and Cognition 6, 4: 347–367. https://doi.org/10.1080/713754421",
      "doi": ""
    },
    {
      "text": "Shelby G. Thompson, Daniel S. McConnell, Jeremy S. Slocum, and Michael Bohan. 2007. Kinematic analysis of multiple constraints on a pointing task. Human Movement Science 26, 1: 11–26. https://doi.org/10.1016/j.humov.2006.09.001",
      "doi": ""
    },
    {
      "text": "Emanuel Todorov and Michael I. Jordan. 2002. Optimal feedback control as a theory of motor coordination. Nature Neuroscience 5, 11: 1226–1235. https://doi.org/10.1038/nn963",
      "doi": ""
    },
    {
      "text": "Tucker Tomlinson and Robert Sainburg. 2012. Dynamic Dominance Persists During Unsupported Reaching. Journal of Motor Behavior 44, 1: 13–25. https://doi.org/10.1080/00222895.2011.636398",
      "doi": ""
    },
    {
      "text": "Annelies Vandenberghe, Lode Bosmans, Joris De Schutter, Stephan Swinnen, and Ilse Jonkers. 2012. Quantifying individual muscle contribution to three-dimensional reaching tasks. Gait & Posture 35, 4: 579–584. https://doi.org/10.1016/j.gaitpost.2011.11.028",
      "doi": ""
    },
    {
      "text": "Vibhuti Vibhuti, Neelesh Kumar, and Chitra Kataria. 2021. Efficacy assessment of virtual reality therapy for neuromotor rehabilitation in home environment: a systematic review. Disability and Rehabilitation: Assistive Technology: 1–21. https://doi.org/10.1080/17483107.2021.1998674",
      "doi": ""
    },
    {
      "text": "Cyril Vienne, Stephane Masfrand, Christophe Bourdin, and Jean-Louis Vercher. 2020. Depth Perception in Virtual Reality Systems: Effect of Screen Distance, Environment Richness and Display Factors. IEEE Access 8: 29099–29110. https://doi.org/10.1109/ACCESS.2020.2972122",
      "doi": ""
    },
    {
      "text": "Erica Waters and Eric Wade. 2021. Classification of Task-Specific Confidence from Kinematic Features. In 2021 10th International IEEE/EMBS Conference on Neural Engineering (NER), 757–762. https://doi.org/10.1109/NER49283.2021.9441448",
      "doi": ""
    },
    {
      "text": "O. White, J. Gaveau, L. Bringoux, and F. Crevecoeur. 2020. The gravitational imprint on sensorimotor planning and control. Journal of Neurophysiology 124, 1: 4–19. https://doi.org/10.1152/jn.00381.2019",
      "doi": ""
    },
    {
      "text": "Aaron L. Wong and Adrian M. Haith. 2017. Motor planning flexibly optimizes performance under uncertainty about task goals. Nature Communications 8, 1: 14624. https://doi.org/10.1038/ncomms14624",
      "doi": ""
    },
    {
      "text": "R.S. Woodworth. 1899. The Accuracy of Voluntary Movement. Psychological Review: Monograph Supplements 3, 3.",
      "doi": ""
    },
    {
      "text": "Xiang Xiao, Huijing Hu, Lifang Li, and Le Li. 2019. Comparison of dominant hand to non-dominant hand in conduction of reaching task from 3D kinematic data: Trade-off between successful rate and movement efficiency. Mathematical Biosciences and Engineering 16, 3: 1611–1624. https://doi.org/10.3934/mbe.2019077",
      "doi": ""
    },
    {
      "text": "Shinji Yamamoto and Keisuke Kushiro. 2014. Direction-dependent differences in temporal kinematics for vertical prehension movements. Experimental Brain Research 232, 2: 703–711. https://doi.org/10.1007/s00221-013-3783-y",
      "doi": ""
    },
    {
      "text": "Hiroshi Yamasaki, Yoshiyuki Tagami, Hiroyuki Fujisawa, Fumihiko Hoshi, and Hiroshi Nagasaki. 2008. Interaction torque contributes to planar reaching at slow speed. BioMedical Engineering OnLine 7, 1: 27. https://doi.org/10.1186/1475-925X-7-27",
      "doi": ""
    }
  ]
}