{
  "doi": "10.1145/3544548.3581170",
  "title": "The Influence of Context on Response to Spear-Phishing Attacks: an In-Situ Deception Study",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "In today’s digitized societies, phishing attacks are a security threat with damaging consequences. Organizations remain vulnerable to phishing attacks, and it is not clear how the work context influences people’s perceptions and behaviors related to phishing attempts. I investigate (1) how contextual factors influence reactions to a spear-phishing attempt, (2) why people report or do not report phishing attempts, (3) which opportunities for security-enhancing interventions people identify. I use an in-situ deception methodology to observe participants (N=14) in their realistic work environment. I triangulate observational and self-reported data to obtain rich qualitative insights into participants’ emotions, thoughts, and actions when receiving a targeted phishing email. I find that task, IT, internal and social context play an important role. The email’s request being aligned with expectations and perceived time pressure when responding to emails were associated with insecure behavior. The social context positively influenced phishing detection, but “phished” participants did not tell anyone.",
  "authors": [
    {
      "name": "Verena Distler",
      "institution": "Human-Computer Interaction Research Group, University of Luxembourg, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260538",
      "orcid": "0000-0002-4461-0551"
    }
  ],
  "references": [
    {
      "text": "Kholoud Althobaiti, Nicole Meng, and Kami Vaniea. 2021. I Don’t Need an Expert! Making URL Phishing Features Human Comprehensible. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, Yokohama Japan, 1–17. https://doi.org/10.1145/3411764.3445574",
      "doi": "10.1145/3411764.3445574"
    },
    {
      "text": "Jeremy Barr. 2020. The company email promised bonuses. It was a hoax — and Tribune Publishing employees are furious.Washington Post (2020). https://www.washingtonpost.com/media/2020/09/23/tribune-bonus-email-phishing-hoax/",
      "doi": ""
    },
    {
      "text": "Nicholas Bradley and Mark Dunlop. 2005. Toward a Multidisciplinary Model of Context to Support Context-Aware Computing. Human-Computer Interaction 20, 4 (Dec. 2005), 403–446. https://doi.org/10.1207/s15327051hci2004_2",
      "doi": "10.1207/s15327051hci2004_2"
    },
    {
      "text": "Cristian Bravo-Lillo, Saranga Komanduri, Lorrie Faith Cranor, Robert W. Reeder, Manya Sleeper, Julie Downs, and Stuart Schechter. 2013. Your attention please: designing security-decision UIs to make genuine risks harder to ignore. In Proceedings of the Ninth Symposium on Usable Privacy and Security - SOUPS ’13. ACM Press, Newcastle, United Kingdom, 1. https://doi.org/10.1145/2501604.2501610",
      "doi": "10.1145/2501604.2501610"
    },
    {
      "text": "Gamze Canova, Melanie Volkamer, Clemens Bergmann, and Roland Borza. 2014. NoPhish: An Anti-Phishing Education App. In Security and Trust Management, Sjouke Mauw and Christian Damsgaard Jensen (Eds.). Vol. 8743. Springer International Publishing, Cham, 188–192. https://doi.org/10.1007/978-3-319-11851-2_14 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "National Cyber Security Centre. 2018. The Trouble with Phishing. https://www.ncsc.gov.uk/blog-post/trouble-phishing",
      "doi": ""
    },
    {
      "text": "National Cyber Security Centre. 2019. Phishing attacks: defending your organisation. https://www.ncsc.gov.uk/guidance/phishing",
      "doi": ""
    },
    {
      "text": "CISCO. 2021. Cyber security threat trends. Technical Report. https://learn-umbrella.cisco.com/ebook-library/2021-cyber-security-threat-trends-phishing-crypto-top-the-list",
      "doi": ""
    },
    {
      "text": "Verena Distler, Matthias Fassl, Hana Habib, Katharina Krombholz, Gabriele Lenzini, Carine Lallemand, Lorrie Faith Cranor, and Vincent Koenig. 2021. A Systematic Literature Review of Empirical Methods and Risk Representation in Usable Privacy and Security Research. ACM Transactions on Computer-Human Interaction 28, 6 (Dec. 2021), 1–50. https://doi.org/10.1145/3469845",
      "doi": "10.1145/3469845"
    },
    {
      "text": "Verena Distler, Gabriele Lenzini, Carine Lallemand, and Vincent Koenig. 2020. The Framework of Security-Enhancing Friction: How UX Can Help Users Behave More Securely. In New Security Paradigms Workshop 2020. ACM, Online USA, 45–58. https://doi.org/10.1145/3442167.3442173",
      "doi": "10.1145/3442167.3442173"
    },
    {
      "text": "Matt Dixon, James Nicholson, Dawn Branley-Bell, Pam Briggs, and Lynne Coventry. 2022. Holding Your Hand on the Danger Button: Observing User Phish Detection Strategies Across Mobile and Desktop. Proceedings of the ACM on Human-Computer Interaction 6, MHCI (Sept. 2022), 1–22. https://doi.org/10.1145/3546730",
      "doi": "10.1145/3546730"
    },
    {
      "text": "Julie S. Downs, Mandy Holbrook, and Lorrie Faith Cranor. 2007. Behavioral response to phishing risk. In Proceedings of the anti-phishing working groups 2nd annual eCrime researchers summit on - eCrime ’07. ACM Press, Pittsburgh, Pennsylvania, 37–44. https://doi.org/10.1145/1299015.1299019",
      "doi": "10.1145/1299015.1299019"
    },
    {
      "text": "Julie S. Downs, Mandy B. Holbrook, and Lorrie Faith Cranor. 2006. Decision strategies and susceptibility to phishing. In Proceedings of the second symposium on Usable privacy and security - SOUPS ’06. ACM Press, Pittsburgh, Pennsylvania, 79. https://doi.org/10.1145/1143120.1143131",
      "doi": "10.1145/1143120.1143131"
    },
    {
      "text": "Matthew Fisher and Frank C. Keil. 2016. The Curse of Expertise: When More Knowledge Leads to Miscalibrated Explanatory Insight. Cognitive Science 40, 5 (2016), 1251–1269. https://doi.org/10.1111/cogs.12280 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/cogs.12280.",
      "doi": ""
    },
    {
      "text": "Centre for the Protection of National Infrastructure. 2021. Don’t take the bait!https://www.cpni.gov.uk/security-campaigns/don%E2%80%99t-take-bait-0",
      "doi": ""
    },
    {
      "text": "Anjuli Franz, Verena Zimmermann, Gregor Albrecht, Katrin Hartwig, Christian Reuter, Alexander Benlian, and Joachim Vogt. 2021. SoK: Still Plenty of Phish in the Sea — A Taxonomy of User-Oriented Phishing Interventions and Avenues for Future Research. In Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021). USENIX Association, 339–358. https://www.usenix.org/conference/soups2021/presentation/franz",
      "doi": ""
    },
    {
      "text": "Diksha Goel. 2018. Mobile phishing attacks and defence mechanisms: State of art and open research challenges. (2018), 26.",
      "doi": ""
    },
    {
      "text": "Kristen Greene, Michelle Steves, Mary Theofanos, and Jennifer Kostick. 2018. User Context: An Explanatory Variable in Phishing Susceptibility. In Proceedings 2018 Workshop on Usable Security. Internet Society, San Diego, CA. https://doi.org/10.14722/usec.2018.23016",
      "doi": ""
    },
    {
      "text": "Frank L. Greitzer, Wanru Li, Kathryn B. Laskey, James Lee, and Justin Purl. 2021. Experimental Investigation of Technical and Human Factors Related to Phishing Susceptibility. ACM Transactions on Social Computing 4, 2 (June 2021), 1–48. https://doi.org/10.1145/3461672",
      "doi": "10.1145/3461672"
    },
    {
      "text": "Andrew Hinton. 2014. Understanding context: Environment, language, and information architecture. \" O’Reilly Media, Inc.\".",
      "doi": ""
    },
    {
      "text": "Karen Holtzblatt and Hugh Beyer. 1998. Contextual Design: Defining Customer-Centered Systems. Morgan Kaufmann Publishers.",
      "doi": "10.5555/286067"
    },
    {
      "text": "Matthew L. Jensen, Ryan T. Wright, Alexandra Durcikova, and Shamya Karumbaiah. 2022. Improving Phishing Reporting Using Security Gamification. Journal of Management Information Systems 39, 3 (July 2022), 793–823. https://doi.org/10.1080/07421222.2022.2096551",
      "doi": ""
    },
    {
      "text": "Klaus Jonas, Wolfgang Stroebe, and Miles Hewstone. 2014. Sozialpsychologie (6ed.). Springer, Berlin Heidelbert.",
      "doi": ""
    },
    {
      "text": "Helen S. Jones, John N. Towse, Nicholas Race, and Timothy Harrison. 2019. Email fraud: The search for psychological predictors of susceptibility. PLOS ONE 14, 1 (Jan. 2019), e0209684. https://doi.org/10.1371/journal.pone.0209684",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman. 2011. Thinking, fast and slow. Farrar, Straus and Giroux, New York.",
      "doi": ""
    },
    {
      "text": "Leon Kersten, Pavlo Burda, Luca Allodi, and Nicola Zannone. 2022. Investigating the Effect of Phishing Believability on Phishing Reporting. In 2022 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). 117–128. https://doi.org/10.1109/EuroSPW55150.2022.00018 ISSN: 2768-0657.",
      "doi": ""
    },
    {
      "text": "Sari Kujala, Virpi Roto, Kaisa Väänänen-Vainio-Mattila, Evangelos Karapanos, and Arto Sinnelä. 2011. UX Curve: A method for evaluating long-term user experience. Interacting with Computers 23, 5 (Sept. 2011), 473–483. https://doi.org/10.1016/j.intcom.2011.06.005",
      "doi": "10.1016/j.intcom.2011.06.005"
    },
    {
      "text": "Ponnurangam Kumaraguru, Lorrie Faith Cranor, and Laura Mather. 2009. Anti-phishing landing page: Turning a 404 into a teachable moment for end users. In Conference on Email and Anti-Spam (CEAS). Citeseer.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru, Justin Cranshaw, Alessandro Acquisti, Lorrie Cranor, Jason Hong, Mary Ann Blair, and Theodore Pham. 2009. School of Phish: A Real-World Evaluation of Anti-Phishing Training. In Proceedings of the 5th Symposium on Usable Privacy and Security(SOUPS ’09). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/1572532.1572536 event-place: Mountain View, California, USA.",
      "doi": "10.1145/1572532.1572536"
    },
    {
      "text": "Youngsun Kwak, Seyoung Lee, Amanda Damiano, and Arun Vishwanath. 2020. Why do users not report spear phishing emails?Telematics and Informatics 48 (May 2020), 101343. https://doi.org/10.1016/j.tele.2020.101343",
      "doi": "10.1016/j.tele.2020.101343"
    },
    {
      "text": "Sam Ladner. 2014. Practical Ethnography: A Guide to Doing Ethnography in the Private Sector. Taylor & Francis Group, Walnut Creek, UNITED STATES. http://ebookcentral.proquest.com/lib/unilu-ebooks/detail.action?docID=1656740",
      "doi": ""
    },
    {
      "text": "Carine Lallemand and Vincent Koenig. 2020. Measuring the Contextual Dimension of User Experience: Development of the User Experience Context Scale (UXCS). In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. ACM, Tallinn Estonia, 1–13. https://doi.org/10.1145/3419249.3420156",
      "doi": "10.1145/3419249.3420156"
    },
    {
      "text": "Susan Landau. 2017. Listening In: Cybersecurity in an Insecure Age. Yale University Press, New Haven and London.",
      "doi": ""
    },
    {
      "text": "Tian Lin, Daniel E. Capecci, Donovan M. Ellis, Harold A. Rocha, Sandeep Dommaraju, Daniela S. Oliveira, and Natalie C. Ebner. 2019. Susceptibility to Spear-Phishing Emails: Effects of Internet User Demographics and Email Content. ACM Transactions on Computer-Human Interaction 26, 5 (Sept. 2019), 1–28. https://doi.org/10.1145/3336141",
      "doi": "10.1145/3336141"
    },
    {
      "text": "Sean Lyngaas. 2022. Ransomware attack hits New Jersey county. https://www.cnn.com/2022/05/26/politics/new-jersey-somerset-county-ransomware-attack/index.html",
      "doi": ""
    },
    {
      "text": "Phillipp Mayring. 2015. Qualitative Inhaltsanalyse(12 ed.). Beltz, Weinheim und Basel.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 1–23. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Geir Moulson. 2021. Germany protests to Russia over pre-election cyberattacks. https://apnews.com/article/technology-europe-russia-elections-germany-26ea77a3b96b94d5760aab48c9dfc008 Section: Technology.",
      "doi": ""
    },
    {
      "text": "Federal Bureau of Investigation. 2022. 2021 Internet Crime Report. Technical Report.",
      "doi": ""
    },
    {
      "text": "Daniela Oliveira, Harold Rocha, Huizi Yang, Donovan Ellis, Sandeep Dommaraju, Melis Muradoglu, Devon Weir, Adam Soliman, Tian Lin, and Natalie Ebner. 2017. Dissecting Spear Phishing Emails for Older vs Young Adults: On the Interplay of Weapons of Influence and Life Domains in Predicting Susceptibility to Phishing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 6412–6424. https://doi.org/10.1145/3025453.3025831 event-place: Denver, Colorado, USA.",
      "doi": "10.1145/3025453.3025831"
    },
    {
      "text": "Gregor Petrič and Kai Roer. 2022. The impact of formal and informal organizational norms on susceptibility to phishing: Combining survey and field experiment data. Telematics and Informatics 67 (Feb. 2022), 101766. https://doi.org/10.1016/j.tele.2021.101766",
      "doi": "10.1016/j.tele.2021.101766"
    },
    {
      "text": "Stefan Rädiker and Udo Kuckartz. 2019. Analyse qualitativer Daten mit MAXQDA. Springer VS, Wiesbaden.",
      "doi": ""
    },
    {
      "text": "Kim Salazar. 2020. Contextual Inquiry: Inspire Design by Observing and Interviewing Users in Their Context. https://www.nngroup.com/articles/contextual-inquiry/",
      "doi": ""
    },
    {
      "text": "M. Angela Sasse, Jonas Hielscher, and Marco Gutfleisch. 2022. Human-Centred Security: Unfug Informationssicherheits-Sensibilisierung. kma - Klinik Management aktuell 27, 04 (Aug. 2022), 44–46. 44.",
      "doi": ""
    },
    {
      "text": "Peter Schaab, Kristian Beckers, and Sebastian Pape. 2016. A Systematic Gap Analysis of Social Engineering Defence Mechanisms Considering Social Psychology.. In HAISA. 241–251.",
      "doi": ""
    },
    {
      "text": "Steve Sheng, Mandy Holbrook, Ponnurangam Kumaraguru, Lorrie Faith Cranor, and Julie Downs. 2010. Who falls for phish?: a demographic analysis of phishing susceptibility and effectiveness of interventions. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, Atlanta, Georgia, USA, 373. https://doi.org/10.1145/1753326.1753383",
      "doi": "10.1145/1753326.1753383"
    },
    {
      "text": "Lucy A. Suchman. 1987. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press, USA.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Arun Vishwanath, Tejaswini Herath, Rui Chen, Jingguo Wang, and H. Raghav Rao. 2011. Why do people get phished? Testing individual differences in phishing vulnerability within an integrated, information processing model. Decision Support Systems 51, 3 (June 2011), 576–586. https://doi.org/10.1016/j.dss.2011.03.002",
      "doi": "10.1016/j.dss.2011.03.002"
    },
    {
      "text": "Melanie Volkamer, Karen Renaud, Benjamin Reinheimer, and Alexandra Kunz. 2017. User experiences of TORPEDO: TOoltip-poweRed Phishing Email DetectiOn. Computers & Security 71 (Nov. 2017), 100–113. https://doi.org/10.1016/j.cose.2017.02.004",
      "doi": "10.1016/j.cose.2017.02.004"
    },
    {
      "text": "Melanie Volkamer, Martina A. Sasse, and Franziska Boehm. 2020. Phishing-Kampagnen zur Steigerung der Mitarbeiter-Awareness: Analyse aus verschiedenen Blickwinkeln – Security, Recht und Faktor Mensch. Datenschutz und Datensicherheit - DuD 44, 8 (Aug. 2020), 518–521. https://doi.org/10.1007/s11623-020-1317-x",
      "doi": ""
    },
    {
      "text": "Rick Wash. 2020. How Experts Detect Phishing Scam Emails. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2 (Oct. 2020). https://doi.org/10.1145/3415231 Place: New York, NY, USA Publisher: Association for Computing Machinery.",
      "doi": "10.1145/3415231"
    },
    {
      "text": "Rick Wash, Norbert Nthala, and Emilee Rader. 2021. Knowledge and Capabilities that Non-Expert Users Bring to Phishing Detection. In Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021). USENIX Association, 377–396. https://www.usenix.org/conference/soups2021/presentation/wash",
      "doi": ""
    },
    {
      "text": "Emma J. Williams, Joanne Hinds, and Adam N. Joinson. 2018. Exploring susceptibility to phishing in the workplace. International Journal of Human-Computer Studies 120 (Dec. 2018), 1–13. https://doi.org/10.1016/j.ijhcs.2018.06.004",
      "doi": ""
    },
    {
      "text": "Carly Wilson and David Argles. 2011. The fight against phishing: Technology, the end user and legislation. In International Conference on Information Society (i-Society 2011). 501–504. https://doi.org/10.1109/i-Society18435.2011.5978553",
      "doi": ""
    },
    {
      "text": "Dennis Wixon, Alicia Flanders, and Minette A. Beabes. 1996. Contextual Inquiry: Grounding Your Design in User’s Work. In Conference Companion on Human Factors in Computing Systems(CHI ’96). Association for Computing Machinery, New York, NY, USA, 354–355. https://doi.org/10.1145/257089.257365 event-place: Vancouver, British Columbia, Canada.",
      "doi": "10.1145/257089.257365"
    },
    {
      "text": "Weining Yang, Aiping Xiong, Jing Chen, Robert W. Proctor, and Ninghui Li. 2017. Use of Phishing Training to Improve Security Warning Compliance: Evidence from a Field Experiment. In Proceedings of the Hot Topics in Science of Security: Symposium and Bootcamp on - HoTSoS. ACM Press, Hanover, MD, USA, 52–61. https://doi.org/10.1145/3055305.3055310",
      "doi": "10.1145/3055305.3055310"
    },
    {
      "text": "Sarah Zheng and Ingolf Becker. 2022. Presenting Suspicious Details in User-Facing E-mail Headers Does Not Improve Phishing Detection. In Eighteenth Symposium on Usable Privacy and Security (SOUPS 2022). USENIX Association, Boston, MA, 253–271. https://www.usenix.org/conference/soups2022/presentation/zheng",
      "doi": ""
    }
  ]
}