{
  "doi": "10.1145/3544548.3581418",
  "title": "Tasks of a Different Color: How Crowdsourcing Practices Differ per Complex Task Type and Why This Matters",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Crowdsourcing in China is a thriving industry. Among its most interesting structures, we find crowdfarms, in which crowdworkers self-organize as small organizations to tackle macrotasks. Little, however, is known as to which practices these crowdfarms use to tackle the macrotasks, and this goes hand in hand with the current practice of the HCI research community to treat all forms of complex crowdsourcing work as practically the same. However, macrotasks differ substantially regarding structure and decomposability. Treating them under one umbrella term - macrotasking - can lead to an imprecise understanding of the workforce involved. We address this gap by examining the work practices of 31 Chinese crowdfarms on the four main macrotask types, namely: modular, interlaced, wicked, and container macrotasks. Our results confirm essential differences in how these nascent crowd organizations address different macrotasks and shed light on what platforms can do to improve the uptake of such work.",
  "tags": [
    "Crowdsourcing",
    "Crowdfarms",
    "Work Practices"
  ],
  "authors": [
    {
      "name": "Yihong Wang",
      "institution": "Computer Science and Software Engineering, Xi'an Jiaotong-Liverpool University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659482133",
      "orcid": "0000-0002-3278-6410"
    },
    {
      "name": "Konstantinos Papangelis",
      "institution": "Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659162915/rel-imgonly/kp.jpg",
      "acmid": "99659162915",
      "orcid": "missing"
    },
    {
      "name": "Ioanna Lykourentzou",
      "institution": "Utrecht University, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363604838",
      "orcid": "0000-0002-4243-4128"
    },
    {
      "name": "Michael Saker",
      "institution": "City University London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659492997",
      "orcid": "0000-0002-7414-2840"
    },
    {
      "name": "Alan Chamberlain",
      "institution": "Mixed Reality Lab, University of Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100146006/rel-imgonly/ac.jpg",
      "acmid": "81100146006",
      "orcid": "0000-0002-2122-8077"
    },
    {
      "name": "Vassilis-Javed Khan",
      "institution": "Sappi Europe, Belgium",
      "img": "/do/10.1145/contrib-81371592633/rel-imgonly/javed-khan-opt.jpg",
      "acmid": "81371592633",
      "orcid": "0000-0002-7333-981X"
    },
    {
      "name": "Hai-Ning Liang",
      "institution": "Department of Computing, Xi'an Jiaotong-Liverpool University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502722554",
      "orcid": "0000-0003-3600-8955"
    },
    {
      "name": "Yong Yue",
      "institution": "Department of Computer Science and Software Engineering, Xi'an Jiaotong-Liverpool University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358628557",
      "orcid": "0000-0001-7695-4538"
    }
  ],
  "references": [
    {
      "text": "G Altshuller. 2005. Principles: Extended Edition. Technical Innovation Center, Worcester(2005).",
      "doi": ""
    },
    {
      "text": "LM Applegate, Terri L Griffith, and Ann Majchrzak. 2017. Hyperloop transportation technologies: Building breakthrough innovations in crowd-powered ecosystems. Harvard Bus. School Case Study(2017), 1–22.",
      "doi": ""
    },
    {
      "text": "Diego Battiston, Jordi Blanes i Vidal, and Tom Kirchmaier. 2021. Face-to-face communication in organizations. The Review of Economic Studies 88, 2 (2021), 574–609.",
      "doi": ""
    },
    {
      "text": "Michael S Bernstein, Greg Little, Robert C Miller, Björn Hartmann, Mark S Ackerman, David R Karger, David Crowell, and Katrina Panovich. 2010. Soylent: a word processor with a crowd inside. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. 313–322.",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Sabine Brunswicker, Volker Bilgram, and Johann Fueller. 2017. Taming wicked civic challenges with an innovative crowd. Business Horizons 60, 2 (2017), 167–177.",
      "doi": ""
    },
    {
      "text": "Joel Chan, Steven Dang, and Steven P Dow. 2016. Improving crowd innovation with expert facilitation. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 1223–1235.",
      "doi": "10.1145/2818048.2820023"
    },
    {
      "text": "Justin Cheng, Jaime Teevan, Shamsi T Iqbal, and Michael S Bernstein. 2015. Break it down: A comparison of macro-and microtasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 4061–4064.",
      "doi": "10.1145/2702123.2702146"
    },
    {
      "text": "Roelof AJ de Vries, Khiet P Truong, Jaebok Kim, and Vanessa Evers. 2019. “You Can Do It!”—Crowdsourcing Motivational Speech and Text Messages. In Macrotask Crowdsourcing. Springer, 217–231.",
      "doi": ""
    },
    {
      "text": "Amir Hossein Gharehgozli, Joan Mileski, Alyssa Adams, and Wyndylyn von Zharen. 2017. Evaluating a “wicked problem”: A conceptual framework on seaport resiliency in the event of weather disruptions. Technological forecasting and social change 121 (2017), 65–75.",
      "doi": ""
    },
    {
      "text": "Jerome C Glenn. 2015. Collective intelligence systems and an application by The Millennium Project for the Egyptian Academy of Scientific Research and Technology. Technological Forecasting and Social Change 97 (2015), 7–14.",
      "doi": ""
    },
    {
      "text": "Mary L Gray, Siddharth Suri, Syed Shoaib Ali, and Deepti Kulkarni. 2016. The crowd is a collaborative network. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. 134–147.",
      "doi": "10.1145/2818048.2819942"
    },
    {
      "text": "David Alan Grier. 2013. Crowdsourcing for dummies. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Daniel Haas, Jason Ansel, Lydia Gu, and Adam Marcus. 2015. Argonaut: Macrotask crowdsourcing for complex data processing. Proceedings of the VLDB Endowment 8, 12 (2015), 1642–1653.",
      "doi": "10.14778/2824032.2824062"
    },
    {
      "text": "Thomas Höhne and Martina Sproll. 2020. Devaluation of cultural capital on online platforms and the changing shape of the social space. Work Organisation, Labour & Globalisation 14, 1 (2020), 32–46.",
      "doi": ""
    },
    {
      "text": "Shengping Huo, Zheng Chijian, and Hailang Tu. 2017. On the Research of Intelligent Coupling and Coordination between Employers and Witkey on the Crowd Innovation Network Platform. Journal of Xiangtan University 41, 1 (2017), 94–101.",
      "doi": ""
    },
    {
      "text": "Lilly C Irani and M Six Silberman. 2013. Turkopticon: Interrupting worker invisibility in amazon mechanical turk. In Proceedings of the SIGCHI conference on human factors in computing systems. 611–620.",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Lilly C Irani and M Six Silberman. 2016. Stories We Tell About Labor: Turkopticon and the Trouble with\" Design\". In Proceedings of the 2016 CHI conference on human factors in computing systems. 4573–4586.",
      "doi": "10.1145/2858036.2858592"
    },
    {
      "text": "Rajat Kathuria, Mansi Kedia, Gangesh Varma, Kaushambi Bagchi, and Saumitra Khullar. 2017. Future of work in a digital era: The potential and challenges for online freelancing and microwork in India. (2017).",
      "doi": ""
    },
    {
      "text": "Nicolas Kaufmann, Thimo Schulze, and Daniel J Veit. 2011. More than fun and money. Worker motivation in crowdsourcing-a study on mechanical turk. In Proceedings of the 17th Americas Conference on Information Systems (AMCIS 2011). AISeL, Paper–340.",
      "doi": ""
    },
    {
      "text": "Vassillis-Javed Khan, Konstantinos Papangelis, Ioanna Lykourentzou, and Panos Markopoulos. 2019. Macrotask Crowdsourcing. Cham: Springer International Publishing(2019).",
      "doi": ""
    },
    {
      "text": "Joy Kim, Sarah Sterman, Allegra Argent Beal Cohen, and Michael S. Bernstein. 2017. Mechanical Novel: Crowdsourcing Complex Work through Reflection and Revision. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 233–245. https://doi.org/10.1145/2998181.2998196",
      "doi": "10.1145/2998181.2998196"
    },
    {
      "text": "Joy Kim, Sarah Sterman, Allegra Argent Beal Cohen, and Michael S Bernstein. 2017. Mechanical novel: Crowdsourcing complex work through reflection and revision. In Proceedings of the 2017 acm conference on computer supported cooperative work and social computing. 233–245.",
      "doi": "10.1145/2998181.2998196"
    },
    {
      "text": "Sangmi Kim and Lionel P Robert Jr. 2019. Crowdsourcing coordination: A review and research agenda for crowdsourcing coordination used for macro-tasks. Macrotask Crowdsourcing(2019), 17–43.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI conference on human factors in computing systems. 453–456.",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E Kraut. 2011. Crowdforge: Crowdsourcing complex work. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 43–52.",
      "doi": "10.1145/2047196.2047202"
    },
    {
      "text": "Walter Lasecki, Christopher Miller, Adam Sadilek, Andrew Abumoussa, Donato Borrello, Raja Kushalnagar, and Jeffrey Bigham. 2012. Real-time captioning by groups of non-experts. In Proceedings of the 25th annual ACM symposium on User interface software and technology. 23–34.",
      "doi": "10.1145/2380116.2380122"
    },
    {
      "text": "Thomas D LaToza and André Van Der Hoek. 2015. A vision of crowd development. In 2015 IEEE/ACM 37th IEEE International Conference on Software Engineering, Vol. 2. IEEE, 563–566.",
      "doi": ""
    },
    {
      "text": "Greg Little, Lydia B Chilton, Max Goldman, and Robert C Miller. 2010. Exploring iterative and parallel human computation processes. In Proceedings of the ACM SIGKDD workshop on human computation. 68–76.",
      "doi": "10.1145/1837885.1837907"
    },
    {
      "text": "Leticia Machado, Josiane Kroll, Rafael Prikladnicki, Cleidson de Souza, and Erran Carmel. 2016. Software crowdsourcing challenges in the Brazilian IT Industry. In International Conference on Enterprise Information Systems, 2016, Itália.",
      "doi": "10.5220/0005835004820489"
    },
    {
      "text": "Anoush Margaryan. 2016. Understanding crowdworkers’ learning practices. (2016).",
      "doi": ""
    },
    {
      "text": "Anoush Margaryan, Julian Albert, and Timothy Charlton-Czaplicki. 2022. Workplace learning in Crowdwork Questionnaire (WLCQ): Measuring self-regulated learning and skill development in online platform work. International Journal of Training and Development (2022).",
      "doi": ""
    },
    {
      "text": "David Martin, Jacki O’Neill, Neha Gupta, and Benjamin V Hanrahan. 2016. Turking in a global labour market. Computer Supported Cooperative Work (CSCW) 25 (2016), 39–77.",
      "doi": "10.1007/s10606-015-9241-6"
    },
    {
      "text": "Yue Pan and Eli Blevis. 2011. A survey of crowdsourcing as a means of collaboration and the implications of crowdsourcing for interaction design. In 2011 international conference on Collaboration technologies and systems (CTS). IEEE, 397–403.",
      "doi": ""
    },
    {
      "text": "Lisa Posch, Arnim Bleier, Clemens M Lechner, Daniel Danner, Fabian Flöck, and Markus Strohmaier. 2019. Measuring motivations of crowdworkers: The multidimensional crowdworker motivation scale. ACM Transactions on Social Computing 2, 2 (2019), 1–34.",
      "doi": "10.1145/3335081"
    },
    {
      "text": "Ned Prutzer. 2019. The mapping crowd: Macrotask crowdsourcing in disaster response. In Macrotask Crowdsourcing. Springer, 253–275.",
      "doi": ""
    },
    {
      "text": "Uma Rani and Marianne Furrer. 2019. On-demand digital economy: Can experience ensure work and income security for microtask workers?Jahrbücher für Nationalökonomie und Statistik 239, 3(2019), 565–597.",
      "doi": ""
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S Bernstein. 2014. Expert crowdsourcing with flash teams. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 75–85.",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S Bernstein. 2014. Expert crowdsourcing with flash teams. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 75–85.",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "Lionel P Robert. 2019. Crowdsourcing controls: A review and research agenda for crowdsourcing controls used for macro-tasks. Macrotask Crowdsourcing(2019), 45–126.",
      "doi": ""
    },
    {
      "text": "Heinz Schmitz and Ioanna Lykourentzou. 2016. It’s about time: Online Macrotask Sequencing in Expert Crowdsourcing. arXiv preprint arXiv:1601.04038(2016).",
      "doi": ""
    },
    {
      "text": "Heinz Schmitz and Ioanna Lykourentzou. 2018. Online sequencing of non-decomposable macrotasks in expert crowdsourcing. ACM Transactions on Social Computing 1, 1 (2018), 1–33.",
      "doi": "10.1145/3140459"
    },
    {
      "text": "Jaime Teevan, Shamsi T Iqbal, and Curtis Von Veh. 2016. Supporting collaborative writing with microtasks. In Proceedings of the 2016 CHI conference on human factors in computing systems. 2657–2668.",
      "doi": "10.1145/2858036.2858108"
    },
    {
      "text": "Melissa A Valentine, Daniela Retelny, Alexandra To, Negar Rahmati, Tulsee Doshi, and Michael S Bernstein. 2017. Flash organizations: Crowdsourcing complex work by structuring crowds as organizations. In Proceedings of the 2017 CHI conference on human factors in computing systems. 3523–3537.",
      "doi": "10.1145/3025453.3025811"
    },
    {
      "text": "Luis Von Ahn. 2007. Human computation. In Proceedings of the 4th international conference on Knowledge capture. 5–6.",
      "doi": "10.1145/1298406.1298408"
    },
    {
      "text": "Carl Vondrick, Donald Patterson, and Deva Ramanan. 2013. Efficiently scaling up crowdsourced video annotation. International journal of computer vision 101, 1 (2013), 184–204.",
      "doi": "10.1007/s11263-012-0564-1"
    },
    {
      "text": "Yihong Wang, Konstantinos Papangelis, Ioanna Lykourentzou, and Vassilis-Javed Khan. 2019. The changing landscape of crowdsourcing in China: from individual crowdworkers to crowdfarms. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. 413–417.",
      "doi": "10.1145/3311957.3359469"
    },
    {
      "text": "Yihong Wang, Konstantinos Papangelis, Ioanna Lykourentzou, Vassilis-Javed Khan, Michael Saker, Yong Yue, and Jonathan Grudin. 2022. The dawn of crowdfarms. Commun. ACM 65, 8 (2022), 64–70.",
      "doi": "10.1145/3490698"
    },
    {
      "text": "Yihong Wang, Konstantinos Papangelis, Ioanna Lykourentzou, Hai-Ning Liang, Irwyn Sadien, Evangelia Demerouti, and Vassilis-Javed Khan. 2020. In Their Shoes: A Structured Analysis of Job Demands, Resources, Work Experiences, and Platform Commitment of Crowdworkers in China. Proceedings of the ACM on Human-Computer Interaction 4, GROUP(2020), 1–40.",
      "doi": "10.1145/3375187"
    },
    {
      "text": "Yihong Wang, Konstantinos Papangelis, Michael Saker, Ioanna Lykourentzou, Alan Chamberlain, and Vassilis-Javed Khan. 2020. Crowdsourcing in China: Exploring the work experiences of solo crowdworkers and crowdfarm workers. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376473"
    },
    {
      "text": "Yihong Wang, Konstantinos Papangelis, Michel Saker, Ioanna Lykourentzou, Vassilis-Javed Khan, Alan Chamberlain, and Jonathan Grudin. 2021. An examination of the work practices of crowdfarms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445603"
    },
    {
      "text": "Ryen W White, Elnaz Nouri, James Woffinden-Luey, Mark Encarnacion, and Sujay Kumar Jauhar. 2021. Microtask detection. ACM Transactions on Information Systems (TOIS) 39, 2 (2021), 1–29.",
      "doi": "10.1145/3432290"
    },
    {
      "text": "Alex J Wood, Mark Graham, Vili Lehdonvirta, and Isis Hjorth. 2019. Networked but commodified: The (dis) embeddedness of digital labour in the gig economy. Sociology 53, 5 (2019), 931–950.",
      "doi": ""
    },
    {
      "text": "Lingfei Zou, Weiling Ke, Jinlong Zhang, and Kwok Kee Wei. 2014. User creativity in crowdsourcing community: from extrinsic motivation perspective. (2014).",
      "doi": ""
    }
  ]
}