{
  "doi": "10.1145/3544548.3581524",
  "title": "Who Do We Mean When We Talk About Visualization Novices?",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "As more people rely on visualization to inform their personal and collective decisions, researchers have focused on a broader range of audiences, including “novices.” But successfully applying, interrogating, or advancing visualization research for novices demands a clear understanding of what “novice” means in theory and practice. Misinterpreting who a “novice” is could lead to misapplying guidelines and overgeneralizing results. In this paper, we investigated how visualization researchers define novices and how they evaluate visualizations intended for novices. We analyzed 79 visualization papers that used “novice,” “non-expert,” “laypeople,” or “general public” in their titles or abstracts. We found ambiguity within papers and disagreement between papers regarding what defines a novice. Furthermore, we found a mismatch between the broad language describing novices and the narrow population representing them in evaluations (i.e., young people, students, and US residents). We suggest directions for inclusively supporting novices in both theory and practice.",
  "authors": [
    {
      "name": "Alyxander Burns",
      "institution": "Mount Holyoke College, United States and College of Information and Computer Sciences, University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660691582",
      "orcid": "0000-0002-2784-3011"
    },
    {
      "name": "Christiana Lee",
      "institution": "College of Information and Computer Sciences, University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783524",
      "orcid": "0000-0002-8296-5660"
    },
    {
      "name": "Ria Chawla",
      "institution": "College of Information and Computer Sciences, University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780174",
      "orcid": "0000-0003-1913-5012"
    },
    {
      "name": "Evan Peck",
      "institution": "Bucknell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474642862",
      "orcid": "0000-0001-9498-5362"
    },
    {
      "name": "Narges Mahyar",
      "institution": "College of Information and Computer Sciences, University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490689705",
      "orcid": "0000-0003-1781-0029"
    }
  ],
  "references": [
    {
      "text": "Jarryullah Ahmad, Elaine Huynh, and Fanny Chevalier. 2021. When Red Means Good, Bad, or Canada: Exploring People’s Reasoning for Choosing Color Palettes. In 2021 IEEE Visualization Conference (VIS). IEEE, CA, USA, 56–60.",
      "doi": ""
    },
    {
      "text": "Benita R Allen. 2014. An analysis of student success predictors for technical college persistence. Ph. D. Dissertation. Edgewood College.",
      "doi": ""
    },
    {
      "text": "Dana Angluin. 1987. Learning regular sets from queries and counterexamples. Information and computation 75, 2 (1987), 87–106.",
      "doi": ""
    },
    {
      "text": "Lynda Baker. 2006. Observation: A complex research method. Library trends 55, 1 (2006), 171–189.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer, Mahmood Jasim, Ali Sarvghad, and Narges Mahyar. 2022. Of Course it’s Political! A Critical Inquiry into Underemphasized Dimensions in Civic Text Visualization. (2022). To appear in the Proceedings of EuroVis 2022.",
      "doi": ""
    },
    {
      "text": "Sebastian Baumgärtner, Achim Ebert, Matthias Deller, and Stefan Agne. 2007. 2D meets 3D: A Human-Centered Interface for Visual Data exploration. In CHI’07 Extended Abstracts on Human Factors in Computing Systems. ACM, NY, USA, 2273–2278.",
      "doi": ""
    },
    {
      "text": "Nuel Belnap. 1993. On rigorous definitions. Philosophical Studies: An International Journal for Philosophy in the Analytic Tradition 72, 2/3 (1993), 115–146.",
      "doi": ""
    },
    {
      "text": "David Bickford, Mary Rose C Posa, Lan Qie, Ahimsa Campos-Arceiz, and Enoka P Kudavidanage. 2012. Science communication for biodiversity conservation. Biological Conservation 151, 1 (2012), 74–76.",
      "doi": ""
    },
    {
      "text": "Staffan Björk, Lars Erik Holmquist, Peter Ljungstrand, and Johan Redström. 2000. Powerview: structured access to integrated information on small screens. In CHI’00 extended abstracts on Human factors in computing systems. ACM, NY, USA, 265–266.",
      "doi": "10.1145/633292.633447"
    },
    {
      "text": "Tanja Blascheck, Lindsay MacDonald Vermeulen, Jo Vermeulen, Charles Perin, Wesley Willett, Thomas Ertl, and Sheelagh Carpendale. 2018. Exploration strategies for discovery of interactivity in visualizations. IEEE Trans. Vis. Comput. Graph. 25, 2 (2018), 1407–1420.",
      "doi": ""
    },
    {
      "text": "Katy Börner, Adam Maltese, Russell Nelson Balliet, and Joe Heimlich. 2016. Investigating aspects of data visualization literacy using 20 information visualizations and 273 science museum visitors. Information Visualization 15, 3 (2016), 198–213.",
      "doi": "10.1177/1473871615594652"
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. Sage Publications, CA, USA.",
      "doi": ""
    },
    {
      "text": "Sebastian Bremm, Tatiana von Landesberger, Jürgen Bernard, and Tobias Schreck. 2011. Assisted descriptor selection based on visual comparative data analysis. Computer Graphics Forum 30, 3 (2011), 891–900.",
      "doi": "10.1111/j.1467-8659.2011.01938.x"
    },
    {
      "text": "Alyxander Burns, Cindy Xiong, Steven Franconeri, Alberto Cairo, and Narges Mahyar. 2021. Designing with Pictographs: Envision Topics without Sacrificing Understanding. IEEE Trans. Vis. Comput. Graph.(2021), 13 pages.",
      "doi": ""
    },
    {
      "text": "Ángel Alexander Cabrera, Will Epperson, Fred Hohman, Minsuk Kahng, Jamie Morgenstern, and Duen Horng Chau. 2019. FairVis: Visual analytics for discovering intersectional bias in machine learning. In 2019 IEEE Conf. on Visual Analytics Science and Technology (VAST). IEEE, CA, USA, 46–56.",
      "doi": ""
    },
    {
      "text": "Emanuele Castano, Vincent Yzerbyt, David Bourguignon, and Eléonore Seron. 2002. Who May Enter? The Impact of In-Group Identification on In-Group/Out-Group Categorization. Journal of Experimental Social Psychology 38, 3 (2002), 315–322.",
      "doi": ""
    },
    {
      "text": "Damla Cay, Till Nagel, and Asım Evren Yantaç. 2020. Understanding User Experience of COVID-19 Maps through Remote Elicitation Interviews. In 2020 IEEE Workshop on Evaluation and Beyond-Methodological Approaches to Visualization (BELIV). IEEE, CA, USA, 65–73.",
      "doi": ""
    },
    {
      "text": "Nicolas Cebron, Fabian Richter, and Rainer Lienhart. 2012. “I can tell you what it’s not”: active learning from counterexamples. Progress in artificial intelligence 1, 4 (2012), 291–301.",
      "doi": ""
    },
    {
      "text": "Wing-Yi Chan, Huamin Qu, and Wai-Ho Mak. 2009. Visualizing the semantic structure in classical music works. IEEE Trans. Vis. Comput. Graph. 16, 1 (2009), 161–173.",
      "doi": "10.1109/TVCG.2009.63"
    },
    {
      "text": "Winnie Chang. 2014. Grit and academic performance: Is being grittier better?Ph. D. Dissertation. University of Miami.",
      "doi": ""
    },
    {
      "text": "Zhutian Chen, Yun Wang, Qianwen Wang, Yong Wang, and Huamin Qu. 2019. Towards automated infographic design: Deep learning-based auto-extraction of extensible timeline. IEEE Trans. Vis. Comput. Graph. 26, 1 (2019), 917–926.",
      "doi": ""
    },
    {
      "text": "Luca Chittaro and Fabio Buttussi. 2015. Assessing knowledge retention of an immersive serious game vs. a traditional education method in aviation safety. IEEE Trans. Vis. Comput. Graph. 21, 4 (2015), 529–538.",
      "doi": "10.1109/TVCG.2015.2391853"
    },
    {
      "text": "Hyungsuk Choi, Woohyuk Choi, Tran Minh Quan, David GC Hildebrand, Hanspeter Pfister, and Won-Ki Jeong. 2014. Vivaldi: A domain-specific language for volume processing and visualization on distributed heterogeneous systems. IEEE Trans. Vis. Comput. Graph. 20, 12 (2014), 2407–2416.",
      "doi": ""
    },
    {
      "text": "Malgorzata Ciesielska, Katarzyna W Boström, and Magnus Öhlander. 2018. Observation methods. In Qualitative methodologies in organization studies. Springer, USA, 33–52.",
      "doi": ""
    },
    {
      "text": "John Clarkson, Roger Coleman, Simeon Keates, and Cherie Lebbon (Eds.). 2013. Inclusive Design: Design for the Whole Population. Springer Science & Business Media, USA.",
      "doi": ""
    },
    {
      "text": "Andrew Collins and D Ball. 2013. Philosophical and theoretic underpinnings of simulation visualization rhetoric and their practical implications. In Ontology, epistemology, and teleology for modeling and simulation. Springer, USA, 173–191.",
      "doi": ""
    },
    {
      "text": "Shauna Concannon, Natasha Rajan, Parthiv Shah, Davy Smith, Marian Ursu, and Jonathan Hook. 2020. Brooke leave home: Designing a personalized film to support public engagement with open data. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376462"
    },
    {
      "text": "Sarah Cooney. 2021. Toward Co-Creative Tools for Tactical Urban Revitalization. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, NY, USA, 1–5.",
      "doi": ""
    },
    {
      "text": "Daniel Cornel, Artem Konev, Bernhard Sadransky, Zsolt Horvath, Eduard Gröller, and Jürgen Waser. 2015. Visualization of Object-Centered Vulnerability to Possible Flood Hazards. Computer Graphics Forum 34, 3 (2015), 331–340.",
      "doi": "10.5555/2858877.2858912"
    },
    {
      "text": "Donna J Cox. 2015. VIS keynote address. In 2015 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, CA, USA, 1–1.",
      "doi": ""
    },
    {
      "text": "Marcus Credé, Michael C Tynan, and Peter D Harms. 2017. Much ado about grit: A meta-analytic synthesis of the grit literature.Journal of Personality and social Psychology 113, 3(2017), 492.",
      "doi": ""
    },
    {
      "text": "Yael De Haan, Sanne Kruikemeier, Sophie Lecheler, Gerard Smit, and Renee Van der Nat. 2018. When does an infographic say more than a thousand words? Audience evaluations of news visualizations. Journalism Studies 19, 9 (2018), 1293–1312.",
      "doi": ""
    },
    {
      "text": "Catherine D’ignazio and Lauren F Klein. 2020. Data feminism. MIT press, MA, USA.",
      "doi": ""
    },
    {
      "text": "Evanthia Dimara and John Stasko. 2021. A Critical Reflection on Visualization Research: Where Do Decision Making Tasks Hide?IEEE Trans. Vis. Comput. Graph. 28, 1 (2021), 1128–1138.",
      "doi": "10.1109/TVCG.2021.3114813"
    },
    {
      "text": "Janette Dinishak. 2016. The deficit view and its critics. Disability Studies Quarterly 36, 4 (2016), 24 pages.",
      "doi": ""
    },
    {
      "text": "Michael Douma, Grzegorz Ligierko, Ovidiu Ancuta, Pavel Gritsai, and Sean Liu. 2009. SpicyNodes: Radial layout authoring for the general public. IEEE Trans. Vis. Comput. Graph. 15, 6 (2009), 1089–1096.",
      "doi": "10.1109/TVCG.2009.183"
    },
    {
      "text": "James N Druckman and Cindy D Kam. 2011. Students as experimental participants. Cambridge handbook of experimental political science 1 (2011), 41–57.",
      "doi": ""
    },
    {
      "text": "Angela L Duckworth, Christopher Peterson, Michael D Matthews, and Dennis R Kelly. 2007. Grit: perseverance and passion for long-term goals.Journal of personality and social psychology 92, 6(2007), 1087.",
      "doi": ""
    },
    {
      "text": "Angela L Duckworth and Patrick D Quinn. 2009. Development and validation of the Short Grit Scale (GRIT–S). Journal of personality assessment 91, 2 (2009), 166–174.",
      "doi": ""
    },
    {
      "text": "Niklas Elmqvist and Philippas Tsigas. 2007. TrustNeighborhoods: Visualizing Trust in Distributed File Sharing Systems. In Eurographics/ IEEE-VGTC Symposium on Visualization, K. Museth, T. Moeller, and A. Ynnerman (Eds.). The Eurographics Association, Switzerland, 8 pages.",
      "doi": ""
    },
    {
      "text": "Lauren Eskreis-Winkler, Elizabeth P Shulman, Scott A Beal, and Angela L Duckworth. 2014. The grit effect: Predicting retention in the military, the workplace, school and marriage. Frontiers in psychology 5 (2014), 36.",
      "doi": ""
    },
    {
      "text": "Deon Filmer and Lant Pritchett. 1999. The effect of household wealth on educational attainment: evidence from 35 countries. Population and development review 25, 1 (1999), 85–120.",
      "doi": ""
    },
    {
      "text": "Issei Fujishiro, Yoshihiko Ichikawa, Rika Furuhata, and Yuriko Takeshima. 2000. GADGET/IV: a taxonomic approach to semi-automatic design of information visualization applications using modular visualization environment. In IEEE Symposium on Information Visualization 2000. INFOVIS 2000. Proceedings. IEEE, CA, USA, 77–83.",
      "doi": ""
    },
    {
      "text": "Lynda Joy Gerry. 2017. Paint with me: stimulating creativity and empathy while painting with a painter in virtual reality. IEEE Trans. Vis. Comput. Graph. 23, 4 (2017), 1418–1426.",
      "doi": "10.1109/TVCG.2017.2657239"
    },
    {
      "text": "Samuel D Gosling, Carson J Sandy, Oliver P John, and Jeff Potter. 2010. Wired but not WEIRD: The promise of the Internet in reaching more diverse samples. Behavioral and Brain Sciences 33, 2-3 (2010), 94.",
      "doi": ""
    },
    {
      "text": "Nathan Gossett and Baoquan Chen. 2004. Paint inspired color mixing and compositing for visualization. In IEEE Symposium on Information Visualization. IEEE, CA, USA, 113–118.",
      "doi": ""
    },
    {
      "text": "Lars Grammel, Melanie Tory, and Margaret-Anne Storey. 2010. How information visualization novices construct visualizations. IEEE Trans. Vis. Comput. Graph. 16, 6 (2010), 943–952.",
      "doi": "10.1109/TVCG.2010.164"
    },
    {
      "text": "Frank Grave and Michael Buser. 2008. Visiting the Gödel universe. IEEE Trans. Vis. Comput. Graph. 14, 6 (2008), 1563–1570.",
      "doi": "10.1109/TVCG.2008.177"
    },
    {
      "text": "Jonathan Gray. 2017. Reviving audience studies. Critical Studies in Media Communication 34, 1 (2017), 79–83.",
      "doi": ""
    },
    {
      "text": "Norbert Gruenwald and Sergiy Klymchuk. 2003. Using counter-examples in teaching Calculus. The New Zealand Mathematics Magazine 40 (2003), 33 – 41.",
      "doi": ""
    },
    {
      "text": "H Haase, M Bock, Elke Hergenröther, C Knöpfte, H-J Koppert, Florian Schröder, Andrzej Trembilski, and Jens Weidenhausen. 1999. Where weather meets the eye—A case study on a wide range of meteorological visualisations for diverse audiences. In Computer Graphics Forum. Springer, USA, 261–266.",
      "doi": ""
    },
    {
      "text": "Stuart Hall. 2003. Encoding/decoding. In Culture, media, language. Routledge, England, UK, 127–137.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2020. Situated knowledges: The science question in feminism and the privilege of partial perspective. In Feminist theory reader. Routledge, England, UK, 303–310.",
      "doi": ""
    },
    {
      "text": "Douglas Harper. 2019. Etymology of novice. https://www.etymonline.com/word/novice.",
      "doi": ""
    },
    {
      "text": "Beth Harry and Janette Klingner. 2007. Discarding the deficit model. Educational leadership 64, 5 (2007), 16.",
      "doi": ""
    },
    {
      "text": "Marti A Hearst, Paul Laskowski, and Luis Silva. 2016. Evaluating information visualization via the interplay of heuristic evaluation and question-based scoring. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 5028–5033.",
      "doi": "10.1145/2858036.2858280"
    },
    {
      "text": "Jeffrey Heer, Frank van Ham, Sheelagh Carpendale, Chris Weaver, and Petra Isenberg. 2008. Creation and collaboration: Engaging new audiences for information visualization. In Information visualization. Springer, USA, 92–133.",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010. Most people are not WEIRD. Nature 466, 7302 (2010), 29–29.",
      "doi": ""
    },
    {
      "text": "Jane Hoffswell, Arvind Satyanarayan, and Jeffrey Heer. 2018. Augmenting code with in situ visualizations to aid program understanding. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3174106"
    },
    {
      "text": "Md Naimul Hoque and Klaus Mueller. 2021. Outcome-explorer: A causality guided interactive visual interface for interpretable algorithmic decision making. IEEE Trans. Vis. Comput. Graph.(2021), 13 pages.",
      "doi": ""
    },
    {
      "text": "Yi-Jheng Huang, Wen-Chieh Lin, I-Cheng Yeh, and Tong-Yee Lee. 2017. Geometric and textural blending for 3d model stylization. IEEE Trans. Vis. Comput. Graph. 24, 2 (2017), 1114–1126.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman and Nick Diakopoulos. 2011. Visualization rhetoric: Framing effects in narrative visualization. IEEE transactions on visualization and computer graphics 17, 12(2011), 2231–2240.",
      "doi": ""
    },
    {
      "text": "Tobias Isenberg, Petra Isenberg, Jian Chen, Michael Sedlmair, and Torsten Möller. 2013. A Systematic Review on the Practice of Evaluating Visualization. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2818–2827.",
      "doi": "10.1109/TVCG.2013.126"
    },
    {
      "text": "Nancy Jay. 1981. Gender and dichotomy. Feminist studies 7, 1 (1981), 38–56.",
      "doi": ""
    },
    {
      "text": "Amit Jena, Matthew Butler, Tim Dwyer, Kirsten Ellis, Ulrich Engelke, Reuben Kirkham, Kim Marriott, Cecile Paris, and Venkatesh Rajamanickam. 2021. The next billion users of visualization. IEEE Computer Graphics and Applications 41, 2 (2021), 8–16.",
      "doi": ""
    },
    {
      "text": "Stine S Johansen, Timothy Merritt, Rune Møberg Jacobsen, Peter Axel Nielsen, and Jesper Kjeldskov. 2022. Investigating Potentials of Shape-Changing Displays for Sound Zones. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–12.",
      "doi": "10.1145/3491102.3517632"
    },
    {
      "text": "Daniel Jönsson, Martin Falk, and Anders Ynnerman. 2015. Intuitive exploration of volumetric data using dynamic galleries. IEEE Trans. Vis. Comput. Graph. 22, 1 (2015), 896–905.",
      "doi": "10.1109/TVCG.2015.2467294"
    },
    {
      "text": "Marta Kersten-Oertel, Sean Jy-Shyang Chen, and D Louis Collins. 2013. An evaluation of depth enhancing perceptual cues for vascular volume visualization in neurosurgery. IEEE Trans. Vis. Comput. Graph. 20, 3 (2013), 391–403.",
      "doi": "10.1109/TVCG.2013.240"
    },
    {
      "text": "Aaron Kotranza, D Scott Lind, and Benjamin Lok. 2011. Real-time evaluation and visualization of learner performance in a mixed-reality environment for clinical breast examination. IEEE Trans. Vis. Comput. Graph. 18, 7 (2011), 1101–1114.",
      "doi": "10.1109/TVCG.2011.132"
    },
    {
      "text": "Per Ola Kristensson, Nils Dahlback, Daniel Anundi, Marius Bjornstad, Hanna Gillberg, Jonas Haraldsson, Ingrid Martensson, Mathias Nordvall, and Josefine Stahl. 2008. An evaluation of space time cube representation of spatiotemporal patterns. IEEE Trans. Vis. Comput. Graph. 15, 4 (2008), 696–702.",
      "doi": "10.1109/TVCG.2008.194"
    },
    {
      "text": "Yngve S Kristiansen, Laura Garrison, and Stefan Bruckner. 2021. Semantic Snapping for Guided Multi-View Visualization Design. IEEE Trans. Vis. Comput. Graph. 28, 1 (2021), 43–53.",
      "doi": "10.1109/TVCG.2021.3114860"
    },
    {
      "text": "Bum Chul Kwon and Bongshin Lee. 2016. A comparative evaluation on online learning approaches using parallel coordinate visualization. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 993–997.",
      "doi": "10.1145/2858036.2858101"
    },
    {
      "text": "Heidi Lam, Enrico Bertini, Petra Isenberg, Catherine Plaisant, and Sheelagh Carpendale. 2011. Empirical studies in information visualization: Seven scenarios. IEEE transactions on visualization and computer graphics 18, 9(2011), 1520–1536.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research Methods in Human-Computer Interaction. Morgan Kaufmann, MA, USA.",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Bongshin Lee, Eun Kyoung Choe, Petra Isenberg, Kim Marriott, and John Stasko. 2020. Reaching broader audiences with data visualization. IEEE Computer Graphics and Applications 40, 2 (2020), 82–90.",
      "doi": "10.1109/MCG.2020.2968244"
    },
    {
      "text": "Crystal Lee, Tanya Yang, Gabrielle D Inchoco, Graham M Jones, and Arvind Satyanarayan. 2021. Viral visualizations: How coronavirus skeptics use orthodox data practices to promote unorthodox science online. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–18.",
      "doi": "10.1145/3411764.3445211"
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, Ya-Hsin Hung, Heidi Lam, Youn-ah Kang, and Ji Soo Yi. 2015. How do people make sense of unfamiliar visualizations?: A grounded model of novice’s information visualization sensemaking. IEEE transactions on visualization and computer graphics 22, 1(2015), 499–508.",
      "doi": ""
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, and Bum Chul Kwon. 2016. Vlat: Development of a visualization literacy assessment test. IEEE Trans. Vis. Comput. Graph. 23, 1 (2016), 551–560.",
      "doi": "10.1109/TVCG.2016.2598920"
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How weird is CHI?. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–14.",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "Zhicheng Liu, John Thompson, Alan Wilson, Mira Dontcheva, James Delorey, Sam Grigg, Bernard Kerr, and John Stasko. 2018. Data Illustrator: Augmenting vector design tools with lazy data binding for expressive visualization authoring. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3173697"
    },
    {
      "text": "Anna-Pia Lohfink, Simon D Duque Anton, Hans Dieter Schotten, Heike Leitte, and Christoph Garth. 2020. Security in process: Visually supported triage analysis in industrial process data. IEEE Trans. Vis. Comput. Graph. 26, 4 (2020), 1638–1649.",
      "doi": ""
    },
    {
      "text": "Weiquan Lu, Chenchen Sun, Timo Bleeker, Yingdan You, Shintaro Kitazawa, and Ellen Yi-Luen Do. 2014. Sensorendipity: a real-time web-enabled smartphone sensor platform for idea generation and prototyping. In Proceedings of the Second International Symposium of Chinese CHI. ACM, NY, USA, 11–18.",
      "doi": "10.1145/2592235.2592238"
    },
    {
      "text": "Zhicong Lu, Mingming Fan, Yun Wang, Jian Zhao, Michelle Annett, and Daniel Wigdor. 2018. Inkplanner: Supporting prewriting via intelligent visual diagramming. IEEE Trans. Vis. Comput. Graph. 25, 1 (2018), 277–287.",
      "doi": "10.1109/TVCG.2018.2864887"
    },
    {
      "text": "Michael Luca and Max H Bazerman. 2021. The power of experiments: Decision making in a data-driven world. MIT Press, MA, USA.",
      "doi": ""
    },
    {
      "text": "María José Luzón. 2013. Public Communication of Science in Blogs: Recontextualizing Scientific Discourse for a Diversified Audience. Written Communication 30, 4 (2013), 428–457.",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Emma McDonnell, Dhruv Jain, Lucy Lu Wang, Jon E. Froehlich, and Leah Findlater. 2021. What do we mean by “accessibility research”? A literature survey of accessibility papers in CHI and ASSETS from 1994 to 2019. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–18.",
      "doi": ""
    },
    {
      "text": "John Mason. 2006. What makes an example exemplary: Pedagogical and didactical issues in appreciating multiplicative structures. Routledge, England, UK, 41–68.",
      "doi": ""
    },
    {
      "text": "Matthew Louis Mauriello, Ben Shneiderman, Fan Du, Sana Malik, and Catherine Plaisant. 2016. Simplifying overviews of temporal event sequences. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, USA, 2217–2224.",
      "doi": "10.1145/2851581.2892440"
    },
    {
      "text": "Kevin T McDonnell and Klaus Mueller. 2008. Illustrative parallel coordinates. Computer Graphics Forum 27, 3 (2008), 1031–1038.",
      "doi": "10.1111/j.1467-8659.2008.01239.x"
    },
    {
      "text": "Joseph E McGrath. 1995. Methodology matters: Doing research in the behavioral and social sciences. Morgan Kaufmann, USA, 152–169.",
      "doi": ""
    },
    {
      "text": "Kevin Mullet, Christopher Fry, and Diane Schiano. 1997. On your marks, get set, browse!In CHI’97 Extended Abstracts on Human Factors in Computing Systems. ACM, NY, USA, 113–114.",
      "doi": ""
    },
    {
      "text": "Brad A Myers. 2017. SIGCHI Lifetime Research Award Talk–RUBY: Reminiscing about User interfaces by Brad over the Years. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, NY, USA, 10–11.",
      "doi": "10.1145/3027063.3058590"
    },
    {
      "text": "Adam Nieman. 2012. Concrete vs abstract visualisation: the real world as a canvas for data visualisation. In Proceedings of ADS-VIS2011: Making visible the invisible: Art, design and science in data visualisation. University of Huddersfield Press, UK, 49–56.",
      "doi": ""
    },
    {
      "text": "Matthew C Nisbet and Dietram A Scheufele. 2009. What’s next for science communication? Promising directions and lingering distractions. American journal of botany 96, 10 (2009), 1767–1778.",
      "doi": ""
    },
    {
      "text": "Peter O’Donovan, Aseem Agarwala, and Aaron Hertzmann. 2014. Learning layouts for single-pagegraphic designs. IEEE Trans. Vis. Comput. Graph. 20, 8 (2014), 1200–1213.",
      "doi": "10.1109/TVCG.2014.48"
    },
    {
      "text": "Stefano Padilla, Thomas S Methven, David A Robb, and Mike J Chantler. 2017. Understanding Concept Maps: A Closer Look at How People Organise Ideas.. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 815–827.",
      "doi": "10.1145/3025453.3025977"
    },
    {
      "text": "Ji Hwan Park, Arie Kaufman, and Klaus Mueller. 2018. Graphoto: Aesthetically pleasing charts for casual information visualization. IEEE computer graphics and applications 38, 6 (2018), 67–82.",
      "doi": ""
    },
    {
      "text": "Ji Hwan Park, Saad Nadeem, Seyedkoosha Mirhosseini, and Arie Kaufman. 2016. C 2 A: Crowd consensus analytics for virtual colonoscopy. In 2016 IEEE Conf. on Visual Analytics Science and Technology (VAST). IEEE, CA, USA, 21–30.",
      "doi": ""
    },
    {
      "text": "Evan M Peck, Sofia E Ayuso, and Omar El-Etr. 2019. Data is personal: Attitudes and perceptions of data visualization in rural pennsylvania. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Alex “Sandy” Pentland. 2013. The Data-Driven Society. Scientific American 309, 4 (2013), 78–83.",
      "doi": ""
    },
    {
      "text": "Laura J Perovich, Sara Ann Wylie, and Roseann Bongiovanni. 2020. Chemicals in the Creek: designing a situated data physicalization of open government data with the community. IEEE Trans. Vis. Comput. Graph. 27, 2 (2020), 913–923.",
      "doi": ""
    },
    {
      "text": "Hermann Pflüger, Dennis Thom, Anna Schütz, Daniela Bohde, and Thomas Ertl. 2019. VeCHArt: visually enhanced comparison of historic art using an automated line-based synchronization technique. IEEE Trans. Vis. Comput. Graph. 26, 10 (2019), 3063–3076.",
      "doi": ""
    },
    {
      "text": "Catherine Plaisant. 2005. Information visualization and the challenge of universal usability. In Exploring geovisualization. Elsevier, Netherlands, 53–82.",
      "doi": ""
    },
    {
      "text": "Zachary Pousman, John Stasko, and Michael Mateas. 2007. Casual information visualization: Depictions of data in everyday life. IEEE Trans. Vis. Comput. Graph. 13, 6 (2007), 1145–1152.",
      "doi": "10.1109/TVCG.2007.70541"
    },
    {
      "text": "Chunyao Qian, Shizhao Sun, Weiwei Cui, Jian-Guang Lou, Haidong Zhang, and Dongmei Zhang. 2020. Retrieve-Then-Adapt: Example-based automatic generation for proportion-related infographics. IEEE Trans. Vis. Comput. Graph. 27, 2 (2020), 443–452.",
      "doi": ""
    },
    {
      "text": "Peter Rautek, Stefan Bruckner, M Eduard Gröller, and Markus Hadwiger. 2014. ViSlang: A system for interpreted domain-specific languages for scientific visualization. IEEE Trans. Vis. Comput. Graph. 20, 12 (2014), 2388–2396.",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z Gajos. 2014. Quantifying visual preferences around the world. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 11–20.",
      "doi": "10.1145/2556288.2557052"
    },
    {
      "text": "Paul Rosen, Voicu Popescu, Christoph Hoffmann, and Ayhan Irfanoglu. 2008. A high-quality high-fidelity visualization of the September 11 attack on the World Trade Center. IEEE Trans. Vis. Comput. Graph. 14, 4 (2008), 937–947.",
      "doi": "10.1109/TVCG.2008.41"
    },
    {
      "text": "Scott D Rothenberger, John E Wenskovitch, and G Elisabeta Marai. 2011. Pexel and heatmap visual analysis of multidimensional gun/homicide data. In 2011 IEEE Conf. on Visual Analytics Science and Technology (VAST). IEEE, CA, USA, 297–298.",
      "doi": ""
    },
    {
      "text": "Christof Rezk Salama, Maik Keller, and Peter Kohlmann. 2006. High-level user interfaces for transfer function design with semantics. IEEE Trans. Vis. Comput. Graph. 12, 5 (2006), 1021–1028.",
      "doi": "10.1109/TVCG.2006.148"
    },
    {
      "text": "Timothy A Salthouse, Renee L Babcock, Eric Skovronek, Debora RD Mitchell, and Roni Palmon. 1990. Age and experience effects in spatial visualization.Developmental Psychology 26, 1 (1990), 128.",
      "doi": ""
    },
    {
      "text": "Michael Sedlmair, Annika Frank, Tamara Munzner, and Andreas Butz. 2012. Relex: Visualization for actively changing overlay network specifications. IEEE Trans. Vis. Comput. Graph. 18, 12 (2012), 2729–2738.",
      "doi": "10.1109/TVCG.2012.255"
    },
    {
      "text": "Hong Shen, Haojian Jin, Ángel Alexander Cabrera, Adam Perer, Haiyi Zhu, and Jason I Hong. 2020. Designing alternative representations of confusion matrices to support non-expert public understanding of algorithm performance. Proc. of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–22.",
      "doi": "10.1145/3415224"
    },
    {
      "text": "I-Chao Shen and Bing-Yu Chen. 2021. Clipgen: A deep generative model for clipart vectorization and synthesis. IEEE Trans. Vis. Comput. Graph.(2021), 15 pages.",
      "doi": ""
    },
    {
      "text": "Edward Shizha. 2006. Legitimizing indigenous knowledge in Zimbabwe: A theoretical analysis of postcolonial school knowledge and its colonial legacy. Journal of Contemporary Issues in Education 1 (2006), 20–35.",
      "doi": ""
    },
    {
      "text": "Divit P Singh, Lee Lisle, TM Murali, and Kurt Luther. 2018. Crowdlayout: Crowdsourced design and evaluation of biological network visualizations. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–14.",
      "doi": "10.1145/3173574.3173806"
    },
    {
      "text": "Stephen Smart, Keke Wu, and Danielle Albers Szafir. 2019. Color crafting: Automating the construction of designer quality color ramps. IEEE Trans. Vis. Comput. Graph. 26, 1 (2019), 1215–1225.",
      "doi": ""
    },
    {
      "text": "Henricus Smid, Patrick Mast, Maarten Tromp, Andi Winterboer, and Vanessa Evers. 2011. Canary in a coal mine: monitoring air quality and detecting environmental incidents by harvesting Twitter. In CHI’11 Extended Abstracts on Human Factors in Computing Systems. ACM, NY, USA, 1855–1860.",
      "doi": ""
    },
    {
      "text": "Laura South, Michail Schwab, Nick Beauchamp, Lu Wang, John Wihbey, and Michelle A Borkin. 2020. DebateVis: Visualizing political debates for non-expert users. In 2020 IEEE Visualization Conference (VIS). IEEE, CA, USA, 241–245.",
      "doi": ""
    },
    {
      "text": "David Sprague and Melanie Tory. 2012. Exploring how and why people use visualizations in casual contexts: Modeling user goals and regulated motivations. Information Visualization 11, 2 (2012), 106–123.",
      "doi": "10.1177/1473871611433710"
    },
    {
      "text": "David W Sprague and Melanie Tory. 2009. Motivation and procrastination: Methods for evaluating pragmatic casual information visualizations. IEEE Computer Graphics and Applications 29, 4 (2009), 86–91.",
      "doi": "10.5555/1669308.1669320"
    },
    {
      "text": "Eftychia Stamkou, Gerben A van Kleef, Astrid C Homan, and Adam D Galinsky. 2016. How norm violations shape social hierarchies: Those who stand on top block norm violators from rising up. Group Processes & Intergroup Relations 19, 5 (2016), 608–629.",
      "doi": ""
    },
    {
      "text": "Christian Sturm, Alice Oh, Sebastian Linxen, Jose Abdelnour Nocera, Susan Dray, and Katharina Reinecke. 2015. How WEIRD is HCI? Extending HCI principles to other countries and cultures. In Proc. of the 33rd Annual ACM Conf. Extended Abstracts on Human Factors in Comput. Sys.ACM, NY, USA, 2425–2428.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana, Syed Ishtiaque Ahmed, and Jeffrey M. Rzeszotarski. 2021. Seeing in Context: Traditional Visual Communication Practices in Rural Bangladesh. Proc. ACM Hum.-Comput. Interact. 4, CSCW3, Article 214 (jan 2021), 31 pages.",
      "doi": "10.1145/3432913"
    },
    {
      "text": "Uzma Haque Syeda, Prasanth Murali, Lisa Roe, Becca Berkey, and Michelle A Borkin. 2020. Design Study\" Lite\" Methodology: Expediting Design Studies and Enabling the Synergy of Visualization Pedagogy and Social Good. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376829"
    },
    {
      "text": "Alex S Taylor. 2011. Out there. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, NY, USA, 685–694.",
      "doi": "10.1145/1978942.1979042"
    },
    {
      "text": "Christian Tietjen, Tobias Isenberg, and Bernhard Preim. 2005. Combining Silhouettes, Surface, and Volume Rendering for Surgery Education and Planning.. In EuroVis. The Eurographics Association, Switzerland, 303–310.",
      "doi": ""
    },
    {
      "text": "Cesar Torres, Jasper O’Leary, Molly Nicholas, and Eric Paulos. 2017. Illumination aesthetics: Light as a creative material within computational design. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 6111–6122.",
      "doi": "10.1145/3025453.3025466"
    },
    {
      "text": "U.S. Department of Education. 2017. Highlights of the 2017 U.S. PIAAC Results Web Report. Technical Report. Institute of Education Sci., National Center for Education Statistics. https://nces.ed.gov/surveys/piaac/current_results.asp.",
      "doi": ""
    },
    {
      "text": "Niels Van Berkel, Jorge Goncalves, Daniel Russo, Simo Hosio, and Mikael B Skov. 2021. Effect of information presentation on fairness perceptions of machine learning predictors. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–13.",
      "doi": "10.1145/3411764.3445365"
    },
    {
      "text": "Stef Van den Elzen and Jarke J Van Wijk. 2014. Multivariate network exploration and presentation: From detail to overview via selections and aggregations. IEEE Trans. Vis. Comput. Graph. 20, 12 (2014), 2310–2319.",
      "doi": ""
    },
    {
      "text": "Fernanda B Viegas, Martin Wattenberg, Frank Van Ham, Jesse Kriss, and Matt McKeon. 2007. Manyeyes: a site for visualization at internet scale. IEEE Trans. Vis. Comput. Graph. 13, 6 (2007), 1121–1128.",
      "doi": "10.1109/TVCG.2007.70577"
    },
    {
      "text": "Manuela Waldner, Alexandra Diehl, Denis Gračanin, Rainer Splechtna, Claudio Delrieux, and Krešimir Matković. 2019. A comparison of radial and linear charts for visualizing daily patterns. IEEE Trans. Vis. Comput. Graph. 26, 1 (2019), 1033–1042.",
      "doi": ""
    },
    {
      "text": "Jagoda Walny, Samuel Huron, and Sheelagh Carpendale. 2015. An exploratory study of data sketching for visual representation. Computer Graphics Forum 34, 3 (2015), 231–240.",
      "doi": ""
    },
    {
      "text": "Yong Wang, Zhihua Jin, Qianwen Wang, Weiwei Cui, Tengfei Ma, and Huamin Qu. 2019. Deepdrawing: A deep learning approach to graph drawing. IEEE Trans. Vis. Comput. Graph. 26, 1 (2019), 676–686.",
      "doi": ""
    },
    {
      "text": "Gesa Wiegand, Matthias Schmidmaier, Thomas Weber, Yuanting Liu, and Heinrich Hussmann. 2019. I drive-you trust: Explaining driving behavior of autonomous cars. In Extended abstracts of the 2019 CHI conference on human factors in computing systems. ACM, NY, USA, 1–6.",
      "doi": ""
    },
    {
      "text": "Angela Cavender Wilson. 2005. Reclaiming our humanity: Decolonization and the recovery of Indigenous knowledge. Rowman & Littlefield Lanham, CA, 255–263.",
      "doi": ""
    },
    {
      "text": "John A Winnie. 1967. The implicit definition of theoretical terms. The British Journal for the Philosophy of Science 18, 3 (1967), 223–229.",
      "doi": ""
    },
    {
      "text": "Jo Wood, Roger Beecham, and Jason Dykes. 2014. Moving beyond sequential design: Reflections on a rich multi-channel approach to data visualization. IEEE Trans. Vis. Comput. Graph. 20, 12 (2014), 2171–2180.",
      "doi": ""
    },
    {
      "text": "Tiffany Wun, Jennifer Payne, Samuel Huron, and Sheelagh Carpendale. 2016. Comparing bar chart authoring with Microsoft Excel and tangible tiles. Computer Graphics Forum 35, 3 (2016), 111–120.",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Nathalie Henry Riche, Fanny Chevalier, Bruno De Araujo, and Daniel Wigdor. 2018. DataInk: Direct and Creative Data-Oriented Drawing. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Cindy Xiong, Ali Sarvghad, Daniel G Goldstein, Jake M Hofman, and Çagatay Demiralp. 2022. Investigating Perceptual Biases in Icon Arrays. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–12.",
      "doi": "10.1145/3491102.3501874"
    },
    {
      "text": "Cindy Xiong, Lisanne Van Weelden, and Steven Franconeri. 2019. The curse of knowledge in visual data communication. IEEE Trans. Vis. Comput. Graph. 26, 10 (2019), 3051–3062.",
      "doi": ""
    },
    {
      "text": "Songhua Xu, Wenxia Yang, and Francis CM Lau. 2009. A visualization based approach for digital signature authentication. Computer Graphics Forum 28, 3 (2009), 935–942.",
      "doi": "10.1111/j.1467-8659.2009.01455.x"
    },
    {
      "text": "Xiwei Xuan, Xiaoyu Zhang, Oh-Hyun Kwon, and Kwan-Liu Ma. 2022. VAC-CNN: A Visual Analytics System for Comparative Studies of Deep Convolutional Neural Networks. IEEE Trans. Vis. Comput. Graph. 28, 6 (2022), 2326–2337.",
      "doi": "10.1109/TVCG.2022.3165347"
    },
    {
      "text": "Rina Zazkis and Egan J Chernoff. 2008. What makes a counterexample exemplary?Educational Studies in Mathematics 68, 3 (2008), 195–208.",
      "doi": ""
    },
    {
      "text": "Wei Zeng, Chi-Wing Fu, Stefan Müller Arisona, Alexander Erath, and Huamin Qu. 2014. Visualizing mobility of public transportation system. IEEE Trans. Vis. Comput. Graph. 20, 12 (2014), 1833–1842.",
      "doi": ""
    },
    {
      "text": "André Zenner, Hannah Maria Kriegler, and Antonio Krüger. 2021. Hart-the virtual reality hand redirection toolkit. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, NY, USA, 1–7.",
      "doi": "10.1145/3411763.3451814"
    },
    {
      "text": "André Zenner, Akhmajon Makhsadov, Sören Klingner, David Liebemann, and Antonio Krüger. 2020. Immersive process model exploration in virtual reality. IEEE Trans. Vis. Comput. Graph. 26, 5 (2020), 2104–2114.",
      "doi": ""
    },
    {
      "text": "Fang-Lue Zhang, Jue Wang, Eli Shechtman, Zi-Ye Zhou, Jia-Xin Shi, and Shi-Min Hu. 2016. Plenopatch: Patch-based plenoptic image manipulation. IEEE Trans. Vis. Comput. Graph. 23, 5 (2016), 1561–1573.",
      "doi": "10.1109/TVCG.2016.2532329"
    },
    {
      "text": "Jiayi Eris Zhang, Nicole Sultanum, Anastasia Bezerianos, and Fanny Chevalier. 2020. DataQuilt: Extracting visual elements from images to craft pictorial visualizations. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376172"
    },
    {
      "text": "Shengchen Zhang, Zixuan Wang, Chaoran Chen, Yi Dai, Lyumanshan Ye, and Xiaohua Sun. 2021. Patterns for Representing Knowledge Graphs to Communicate Situational Knowledge of Service Robots. In Proc. CHI Conf. Hum. Factors Comput. Sys.ACM, NY, USA, 1–12.",
      "doi": "10.1145/3411764.3445767"
    },
    {
      "text": "Jian Zhao, Shenyu Xu, Senthil Chandrasegaran, Christopher James Bryan, Fan Du, Aditi Mishra, Xin Qian, Yiran Li, and Kwan-Liu Ma. 2021. ChartStory: Automated Partitioning, Layout, and Captioning of Charts into Comic-Style Narratives. IEEE Trans. Vis. Comput. Graph.(2021), 15 pages.",
      "doi": ""
    },
    {
      "text": "Zengsheng Zhong, Shuirun Wei, Yeting Xu, Ying Zhao, Fangfang Zhou, Feng Luo, and Ronghua Shi. 2020. SilkViser: A visual explorer of blockchain-based cryptocurrency transaction data. In 2020 IEEE Conf. on Visual Analytics Science and Technology (VAST). IEEE, CA, USA, 95–106.",
      "doi": ""
    },
    {
      "text": "Mengdie Zhuang, David Concannon, and Ed Manley. 2022. A framework for evaluating dashboards in healthcare. IEEE Trans. Vis. Comput. Graph. 28, 4 (2022), 1715–1731.",
      "doi": ""
    },
    {
      "text": "Alexandra Zytek, Dongyu Liu, Rhema Vaithianathan, and Kalyan Veeramachaneni. 2021. Sibyl: Understanding and addressing the usability challenges of machine learning in high-stakes decision making. IEEE Trans. Vis. Comput. Graph. 28, 1 (2021), 1161–1171.",
      "doi": "10.1109/TVCG.2021.3114864"
    }
  ]
}