{
  "doi": "10.1145/3544548.3581175",
  "title": "The Entoptic Field Camera as Metaphor-Driven Research-through-Design with AI Technologies",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Artificial intelligence (AI) technologies are widely deployed in smartphone photography; and prompt-based image synthesis models have rapidly become commonplace. In this paper, we describe a Research-through-Design (RtD) project which explores this shift in the means and modes of image production via the creation and use of the Entoptic Field Camera. Entoptic phenomena usually refer to perceptions of floaters or bright blue dots stemming from the physiological interplay of the eye and brain. We use the term entoptic as a metaphor to investigate how the material interplay of data and models in AI technologies shapes human experiences of reality. Through our case study using first-person design and a field study, we offer implications for critical, reflective, more-than-human and ludic design to engage AI technologies; the conceptualisation of an RtD research space which contributes to AI literacy discourses; and outline a research trajectory concerning materiality and design affordances of AI technologies.",
  "tags": [
    "materiality",
    "GAN",
    "image synthesis",
    "technological mediation",
    "artificial intelligence",
    "research through design"
  ],
  "authors": [
    {
      "name": "Jesse Josua Benjamin",
      "institution": "Department of Philosophy, University of Twente, Netherlands and Imagination Lancaster, Lancaster University, United Kingdom",
      "img": "/do/10.1145/contrib-99659276432/rel-imgonly/jbenjamin_portrait.jpg",
      "acmid": "99659276432",
      "orcid": "0000-0003-3391-3060"
    },
    {
      "name": "Heidi Biggs",
      "institution": "College of Information Sciences and Technology, The Pennsylvania State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441708",
      "orcid": "0000-0001-9208-7921"
    },
    {
      "name": "Arne Berger",
      "institution": "Computer Science and Languages, Anhalt University of Applied Sciences, Germany",
      "img": "/do/10.1145/contrib-81442594089/rel-imgonly/bildschirmfoto_2022-11-04_um_09.59.58.png",
      "acmid": "81442594089",
      "orcid": "0000-0002-6398-839X"
    },
    {
      "name": "Julija Rukanskaitė",
      "institution": "Julija.Works, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778668",
      "orcid": "0000-0001-9993-6287"
    },
    {
      "name": "Michael B. Heidt",
      "institution": "Computer Science and Languages, Anhalt University of Applied Sciences, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384599696",
      "orcid": "0000-0001-9758-2526"
    },
    {
      "name": "Nick Merrill",
      "institution": "Daylight Lab, Center for Long-Term Cybersecurity, University of California, Berkeley, United States",
      "img": "/do/10.1145/contrib-99659085848/rel-imgonly/headshot.jpg",
      "acmid": "99659085848",
      "orcid": "0000-0003-3669-1387"
    },
    {
      "name": "James Pierce",
      "institution": "School of Art + Art History + Design, University of Washington Seattle, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    },
    {
      "name": "Joseph Lindley",
      "institution": "Lancaster University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458634157",
      "orcid": "0000-0002-5527-3028"
    }
  ],
  "references": [
    {
      "text": "2010. entoptic phenomena. In Concise Medical Dictionary. Oxford University Press. https://www.oxfordreference.com/view/10.1093/acref/9780199557141.001.0001/acref-9780199557141-e-3227",
      "doi": ""
    },
    {
      "text": "2022. Shuttercam | Responsible Sensing Lab. https://responsiblesensinglab.org/projects/shuttercam",
      "doi": ""
    },
    {
      "text": "Philip Agre. 1997. Computation and human experience. Cambridge University Press, Cambridge ; New York.",
      "doi": "10.5555/522884"
    },
    {
      "text": "Philip E. Agre. 1997. Toward a Critical Technical Practice: Lessons Learned in Trying to Reform AI. In Social Science, Technical Systems, and Cooperative Work: Bridging the Great Divide, Geoff Bowker, Susan Leigh Star, Willian Turner, and Les Gasser (Eds.). L. Erlbaum Associates, New Jersey, USA, 131–156.",
      "doi": ""
    },
    {
      "text": "M. M. Bakhtin. 1986. Speech genres and other late essays(1st ed ed.). Number no. 8 in University of Texas Press Slavic series. University of Texas Press, Austin.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"critical\" about critical design?In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3297–3306. https://doi.org/10.1145/2470654.2466451",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Rocco Bellanova and Gloria González Fuster. 2013. Politics of Disappearance: Scanners and (Unobserved) Bodies as Mediators of Security Practices. International Political Sociology 7, 2 (June 2013), 188–209. https://doi.org/10.1111/ips.12017",
      "doi": ""
    },
    {
      "text": "Jesse Josua Benjamin. 2021. The Spark of a Future Anterior: An Archaeology of Entoptic Media. ŠUM Journal for Contemporary Art Criticism and Theory16 (2021), 2172–2184. https://www.sum.si/journal-articles/the-spark-of-a-future-anterior-an-archaeology-of-entoptic-media Publisher: Društvo Galerija Books.",
      "doi": ""
    },
    {
      "text": "Jesse Josua Benjamin, Arne Berger, Nick Merrill, and James Pierce. 2021. Machine Learning Uncertainty as a Design Material: A Post-Phenomenological Inquiry. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3411764.3445481",
      "doi": "10.1145/3411764.3445481"
    },
    {
      "text": "Jesse Josua Benjamin, Christoph Kinkeldey, Claudia Müller-Birn, Tim Korjakow, and Eva-Maria Herbst. 2022. Explanation Strategies as an Empirical-Analytical Lens for Socio-Technical Contextualization of Machine Learning Interpretability. Proceedings of the ACM on Human-Computer Interaction 6, GROUP (Jan. 2022), 39:1–39:25. https://doi.org/10.1145/3492858",
      "doi": "10.1145/3492858"
    },
    {
      "text": "Heidi R. Biggs and Audrey Desjardins. 2020. High Water Pants: Designing Embodied Environmental Speculation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376429",
      "doi": "10.1145/3313831.3376429"
    },
    {
      "text": "Abeba Birhane, Vinay Uday Prabhu, and Emmanuel Kahembwe. 2021. Multimodal datasets: misogyny, pornography, and malignant stereotypes. https://doi.org/10.48550/arXiv.2110.01963 arXiv:2110.01963 [cs].",
      "doi": ""
    },
    {
      "text": "Alan F. Blackwell. 2006. The reification of metaphor as a design tool. ACM Transactions on Computer-Human Interaction 13, 4 (Dec. 2006), 490–530. https://doi.org/10.1145/1188816.1188820",
      "doi": "10.1145/1188816.1188820"
    },
    {
      "text": "Eli Blevis, Elizabeth Churchill, William Odom, James Pierce, David Roedl, and Ron Wakkary. 2012. Visual thinking & digital imagery. In Conference on Human Factors in Computing Systems - Proceedings. 2715–2718. https://doi.org/10.1145/2212776.2212703",
      "doi": "10.1145/2212776.2212703"
    },
    {
      "text": "Shunying An Blevis, Eli Blevis, and Bonnie Nardi. 2019. All the tea in China: Interaction design inspirations. In C and C 2019 - Proceedings of the 2019 Creativity and Cognition, Vol. c. 333–345. https://doi.org/10.1145/3325480.3326569",
      "doi": "10.1145/3325480.3326569"
    },
    {
      "text": "Ian Bogost. 2020. Your Phone Wasn’t Built for the Apocalypse. https://www.theatlantic.com/technology/archive/2020/09/camera-phone-wildfire-sky/616279/ Section: Technology.",
      "doi": ""
    },
    {
      "text": "Ian Bogost. 2022. Google’s ‘Sentient’ Chatbot Is Our Self-Deceiving Future. https://www.theatlantic.com/technology/archive/2022/06/google-engineer-sentient-ai-chatbot/661273/ Section: Technology.",
      "doi": ""
    },
    {
      "text": "Katherine L. Bouman, Michael D. Johnson, Daniel Zoran, Vincent L. Fish, Sheperd S. Doeleman, and William T. Freeman. 2016. Computational Imaging for VLBI Image Reconstruction. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 913–922. https://www.cv-foundation.org/openaccess/content_cvpr_2016/html/Bouman_Computational_Imaging_for_CVPR_2016_paper.html",
      "doi": ""
    },
    {
      "text": "Nico Brand, William Odom, and Samuel Barnett. 2021. A Design Inquiry into Introspective AI: Surfacing Opportunities, Issues, and Paradoxes. In Designing Interactive Systems Conference 2021. ACM, Virtual Event USA, 1603–1618. https://doi.org/10.1145/3461778.3462000",
      "doi": "10.1145/3461778.3462000"
    },
    {
      "text": "Benjamin Bratton and Blaise Agüera Y Arcas. 2022. The Model Is The Message. NOEMA (July 2022). https://www.noemamag.com/the-model-is-the-message",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2016. How the machine ‘thinks’: Understanding opacity in machine learning algorithms. Big Data & Society 3, 1 (Jan. 2016), 205395171562251. https://doi.org/10.1177/2053951715622512",
      "doi": ""
    },
    {
      "text": "Michel Callon. 1990. Techno-economic Networks and Irreversibility. The Sociological Review 38, 1_suppl (May 1990), 132–161. https://doi.org/10.1111/j.1467-954X.1990.tb03351.x Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Ernst Cassirer. 1953. Language and Myth(dover ed ed.). Dover Publications Inc., New York.",
      "doi": ""
    },
    {
      "text": "Brian X. Chen. 2019. The Reason Your Photos Are About to Get a Lot Better. The New York Times (Oct. 2019). https://www.nytimes.com/2019/10/15/technology/personaltech/google-pixel-photography.html",
      "doi": ""
    },
    {
      "text": "Yu-Sheng Chen, Yu-Ching Wang, Man-Hsin Kao, and Yung-Yu Chuang. 2018. Deep Photo Enhancer: Unpaired Learning for Image Enhancement From Photographs With GANs. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 6306–6314. http://openaccess.thecvf.com/content_cvpr_2018/html/Chen_Deep_Photo_Enhancer_CVPR_2018_paper.html",
      "doi": ""
    },
    {
      "text": "Kate Crawford and Vladan Joler. 2018. Anatomy of an AI System. http://www.anatomyof.ai",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins, Cayla Key, Heidi R. Biggs, and Kelsey Aschenbeck. 2019. Bespoke Booklets: A Method for Situated Co-Speculation. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). ACM, New York, NY, USA, 697–709. https://doi.org/10.1145/3322276.3322311 event-place: San Diego, CA, USA.",
      "doi": "10.1145/3322276.3322311"
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial design. MIT Press, Cambridge, Mass. ; London.",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Jeff Donahue, Philipp Krähenbühl, and Trevor Darrell. 2016. Adversarial feature learning. arXiv preprint arXiv:1605.09782 Published as a conference paper at ICLR 2017.(2016).",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2016. Algorithms and their others: Algorithmic culture in context. Big Data & Society 3, 2 (Dec. 2016), 2053951716665128. https://doi.org/10.1177/2053951716665128",
      "doi": ""
    },
    {
      "text": "Graham Dove and Anne-Laure Fayard. 2020. Monsters, Metaphors, and Machine Learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–17. https://doi.org/10.1145/3313831.3376275",
      "doi": "10.1145/3313831.3376275"
    },
    {
      "text": "Tony Dunne and Delena Pacenti Bill Gaver. 1999. Cultural Probes. ACM Interactions February (1999), 21–29.",
      "doi": ""
    },
    {
      "text": "Hamid Ekbia and Bonnie Nardi. 2014. Heteromation and its (dis)contents: The invisible division of labor between humans and machines. First Monday 19, 6 (May 2014), 1–21. https://doi.org/10.5210/fm.v19i6.5331",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David Chatting, Michael Duggan, Andrew Carl Dwyer, and Pip Thornton. 2022. Zoom Obscura: Counterfunctional Design for Video-Conferencing. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3491102.3501973",
      "doi": "10.1145/3491102.3501973"
    },
    {
      "text": "Vilém Flusser. 2011. Into the Universe of Technical Images. Number 32 in Electronic Mediations. University of Minnesota Press, Minneapolis, London.",
      "doi": ""
    },
    {
      "text": "Christopher Frayling. 1994. Research in Art and Design. 1, 1 (1994). http://researchonline.rca.ac.uk/384/",
      "doi": ""
    },
    {
      "text": "William Gaver, Peter Gall Krogh, Andy Boucher, and David Chatting. 2022. Emergence as a Feature of Practice-based Design Research. In Designing Interactive Systems Conference(DIS ’22). Association for Computing Machinery, New York, NY, USA, 517–526. https://doi.org/10.1145/3532106.3533524",
      "doi": "10.1145/3532106.3533524"
    },
    {
      "text": "William W. Gaver, John Bowers, Kirsten Boehner, Andy Boucher, David W.T. Cameron, Mark Hauenstein, Nadine Jarvis, and Sarah Pennington. 2013. Indoor Weather Stations: Investigating a Ludic Approach to Environmental HCI Through Batch Prototyping. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). ACM, New York, NY, USA, 3451–3460. https://doi.org/10.1145/2470654.2466474 event-place: Paris, France.",
      "doi": "10.1145/2470654.2466474"
    },
    {
      "text": "William W. Gaver, John Bowers, Andrew Boucher, Hans Gellerson, Sarah Pennington, Albrecht Schmidt, Anthony Steed, Nicholas Villars, and Brendan Walker. 2004. The Drift Table: Designing for Ludic Engagement. In CHI ’04 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’04). ACM, New York, NY, USA, 885–900. https://doi.org/10.1145/985921.985947 event-place: Vienna, Austria.",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Maliheh Ghajargar and Jeffrey Bardzell. 2021. Synthesis of Forms: Integrating Practical and Reflective Qualities in Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3411764.3445232",
      "doi": "10.1145/3411764.3445232"
    },
    {
      "text": "Ian J. Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. 2014. Generative Adversarial Networks. arXiv:1406.2661 [cs, stat] (June 2014). http://arxiv.org/abs/1406.2661 arXiv:1406.2661.",
      "doi": ""
    },
    {
      "text": "David Philip Green, Simon Bowen, Jonathan Hook, and Peter Wright. 2017. Enabling Polyvocality in Interactive Documentaries through\" Structural Participation\". In Proceedings of the 2017 CHI conference on human factors in computing systems. 6317–6329.",
      "doi": "10.1145/3025453.3025606"
    },
    {
      "text": "Sabrina Hauser, Ron Wakkary, William Odom, Peter-Paul Verbeek, Audrey Desjardins, Henry Lin, Matthew Dalton, Markus Schilling, and Gijs de Boer. 2018. Deployments of the Table-non-table: A Reflection on the Relation Between Theory and Things in the Practice of Design Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 201:1–201:13. https://doi.org/10.1145/3173574.3173775",
      "doi": "10.1145/3173574.3173775"
    },
    {
      "text": "Martin Heidegger. 2005. The basic problems of phenomenology. Indiana University Press, Bloomington; Indianapolis. OCLC: 750615910.",
      "doi": ""
    },
    {
      "text": "Martin Heidegger. 2010. Being and time. State University of New York Press, Albany. OCLC: ocn608297834.",
      "doi": ""
    },
    {
      "text": "Hermann von Helmholtz. 1867. Handbuch der physiologischen Optik. Leipzig : Leopold Voss. http://archive.org/details/handbuchderphysi00helm",
      "doi": ""
    },
    {
      "text": "Holly Herndon and Matt Dryhurst. 2022. Infinite Images and the latent camera. https://mirror.xyz/herndondryhurst.eth/eZG6mucl9fqU897XvJs0vUUMnm5OITpSWN8S-6KWamY",
      "doi": ""
    },
    {
      "text": "Jonathan Ho, Ajay Jain, and Pieter Abbeel. 2020. Denoising Diffusion Probabilistic Models. https://doi.org/10.48550/arXiv.2006.11239 arXiv:2006.11239 [cs, stat].",
      "doi": ""
    },
    {
      "text": "Fred Hohman, Andrew Head, Rich Caruana, Robert DeLine, and Steven M. Drucker. 2019. Gamut: A Design Probe to Understand How Data Scientists Understand Machine Learning Models. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 579:1–579:13. https://doi.org/10.1145/3290605.3300809 event-place: Glasgow, Scotland Uk.",
      "doi": "10.1145/3290605.3300809"
    },
    {
      "text": "Sarah Homewood, Amanda Karlsson, and Anna Vallgårda. 2020. Removal as a Method: A Fourth Wave HCI Approach to Understanding the Experience of Self-Tracking. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 1779–1791. https://doi.org/10.1145/3357236.3395425",
      "doi": "10.1145/3357236.3395425"
    },
    {
      "text": "Don Ihde. 1990. Technology and the Lifeworld: From Garden to Earth. Indiana University Press, Bloomington and Indianapolis.",
      "doi": ""
    },
    {
      "text": "Don Ihde. 1998. Expanding hermeneutics: visualism in science. Northwestern University Press, Evanston, Ill.",
      "doi": ""
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: interrupting worker invisibility in amazon mechanical turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 611–620. https://doi.org/10.1145/2470654.2470742",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Nadine Jarvis, David Cameron, and Andy Boucher. 2012. Attention to detail: Annotations of a design process. In NordiCHI 2012: Making Sense Through Design - Proceedings of the 7th Nordic Conference on Human-Computer Interaction. 11–20. https://doi.org/10.1145/2399016.2399019",
      "doi": "10.1145/2399016.2399019"
    },
    {
      "text": "Ellen Jiang, Kristen Olson, Edwin Toh, Alejandra Molina, Aaron Donsbach, Michael Terry, and Carrie J Cai. 2022. PromptMaker: Prompt-based Prototyping with Large Language Models. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems(CHI EA ’22). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3491101.3503564",
      "doi": "10.1145/3491101.3503564"
    },
    {
      "text": "Li Jönsson, Martín Tironi, Pablo Hermansen, and Alex Wilkie. 2022. Doing and Undoing Post-Anthropocentric Design. In DRS Biennial Conference Series. https://dl.designresearchsociety.org/drs-conference-papers/drs2022/editorials/17",
      "doi": ""
    },
    {
      "text": "Christoph Kinkeldey, Tim Korjakow, and Jesse Josua Benjamin. 2019. Towards Supporting Interpretability of Clustering Results with Uncertainty Visualization. In Eurographics Proceedings 2019. The Eurographics Association. https://doi.org/10.2312/trvis.20191183",
      "doi": ""
    },
    {
      "text": "Friedrich Kittler. 2010. Optical media : Berlin lectures 1999. Polity, Cambridge, UK ; Malden, MA.",
      "doi": ""
    },
    {
      "text": "Lucian Leahu. 2016. Ontological Surprises: A Relational Perspective on Machine Learning. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). ACM, New York, NY, USA, 182–186. https://doi.org/10.1145/2901790.2901840",
      "doi": "10.1145/2901790.2901840"
    },
    {
      "text": "Francis Lee. 2021. Enacting the Pandemic: Analyzing Agency, Opacity, and Power in Algorithmic Assemblages. Science & Technology Studies 34, 1 (Feb. 2021), 65–90. https://doi.org/10.23987/sts.75323 Number: 1.",
      "doi": ""
    },
    {
      "text": "J. D. Lewis-Williams and T. A. Dowson. 1988. The Signs of All Times: Entoptic Phenomena in Upper Palaeolithic Art [and Comments and Reply]. Current Anthropology 29, 2 (1988), 201–245. https://www.jstor.org/stable/2743395 Publisher: [University of Chicago Press, Wenner-Gren Foundation for Anthropological Research].",
      "doi": ""
    },
    {
      "text": "Youn-kyung Lim, Daesung Kim, Jaesung Jo, and Jong-bum Woo. 2013. Discovery-Driven Prototyping for User-Driven Creativity. IEEE Pervasive Computing 12, 3 (July 2013), 74–80. https://doi.org/10.1109/MPRV.2012.57 Conference Name: IEEE Pervasive Computing.",
      "doi": "10.1109/MPRV.2012.57"
    },
    {
      "text": "Henry Lin, Ron Wakkary, and Doenja Oogjes. 2019. The Tilting Bowl: Electronic design for a research product. In DIS 2019 - Proceedings of the 2019 ACM Designing Interactive Systems Conference. 345–357. https://doi.org/10.1145/3322276.3323701",
      "doi": "10.1145/3322276.3323701"
    },
    {
      "text": "Maria Lindh. 2016. As a Utility – Metaphors of Information Technologies. Human IT 13, 2 (2016), 47–80. http://urn.kb.se/resolve?urn=urn:nbn:se:hb:diva-10679 Publisher: Högskolan i Borås.",
      "doi": ""
    },
    {
      "text": "Joseph Lindley, Haider Ali Akmal, Franziska Pillling, and Paul Coulton. 2020. Researching AI Legibility through Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376792",
      "doi": "10.1145/3313831.3376792"
    },
    {
      "text": "Joseph Galen Lindley, Paul Coulton, Haider Ali Akmal, and Franziska Louise Pilling. 2020. Signs of the Time: Making AI Legible. In DRS Biennial Conference Series. https://dl.designresearchsociety.org/drs-conference-papers/drs2020/researchpapers/63",
      "doi": ""
    },
    {
      "text": "Szu Yu Liu, Jeffrey Bardzell, and Shaowen Bardzell. 2018. Photography as a design research tool into natureculture. In DIS 2018 - Proceedings of the 2018 Designing Interactive Systems Conference. 777–790. https://doi.org/10.1145/3196709.3196819",
      "doi": "10.1145/3196709.3196819"
    },
    {
      "text": "Duri Long and Brian Magerko. 2020. What is AI Literacy? Competencies and Design Considerations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376727",
      "doi": "10.1145/3313831.3376727"
    },
    {
      "text": "Andrés Lucero, Audrey Desjardins, Carman Neustaedter, Kristina Höök, Marc Hassenzahl, and Marta E. Cecchinato. 2019. A Sample of One: First-Person Research Methods in HCI. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion(DIS ’19 Companion). Association for Computing Machinery, New York, NY, USA, 385–388. https://doi.org/10.1145/3301019.3319996",
      "doi": "10.1145/3301019.3319996"
    },
    {
      "text": "Davor Löffler. 2018. Distributing Potentiality. Post-capitalist Economies and the Generative Time Regime. Identities: Journal for Politics, Gender and Culture 15, 1-2 (2018), 8–44. https://identitiesjournal.edu.mk/index.php/IJPGC/article/view/329",
      "doi": ""
    },
    {
      "text": "Davor Löffler. 2019. Generative Realitäten I Die Technologische Zivilisation als neue Achsenzeit und Zivilisationsstufe Eine Anthropologie des 21. Jahrhunderts. Velbrück Wissenschaft. OCLC: 1081348786.",
      "doi": ""
    },
    {
      "text": "Drew McDermott. 1976. Artificial Intelligence Meets Natural Stupidity. SIGART Bull.57 (April 1976), 4–9. https://doi.org/10.1145/1045339.1045340",
      "doi": "10.1145/1045339.1045340"
    },
    {
      "text": "Heather McKinnon. 2016. Finding Design Value in Modern Mundanity. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS, Vol. 16. 1059–1071. https://doi.org/10.1145/2901790.2901906",
      "doi": "10.1145/2901790.2901906"
    },
    {
      "text": "Yisroel Mirsky and Wenke Lee. 2021. The Creation and Detection of Deepfakes: A Survey. Comput. Surveys 54, 1 (Jan. 2021), 7:1–7:41. https://doi.org/10.1145/3425780",
      "doi": "10.1145/3425780"
    },
    {
      "text": "W. J. T Mitchell. 1995. Picture theory : essays on verbal and visual representation (paperback ed. ed.). Chicago [u.a.].",
      "doi": ""
    },
    {
      "text": "Alexander Mordvintsev, Christopher Olah, and Mike Tyke. 2015. Inceptionism: Going Deeper into Neural Networks. http://ai.googleblog.com/2015/06/inceptionism-going-deeper-into-neural.html",
      "doi": ""
    },
    {
      "text": "Dave Murray-Rust, Iohanna Nicenboim, and Dan Lockton. 2022. Metaphors for designers working with AI. https://doi.org/10.21606/drs.2022.667",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical design: what you can learn from designing for yourself. Interactions 19, 6 (Nov. 2012), 28–33. https://doi.org/10.1145/2377783.2377791",
      "doi": "10.1145/2377783.2377791"
    },
    {
      "text": "Iohanna Nicenboim, Elisa Giaccardi, Marie Louise Juul Søndergaard, Anuradha Venugopal Reddy, Yolande Strengers, James Pierce, and Johan Redström. 2020. More-Than-Human Design and AI: In Conversation with Agents. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference(DIS’ 20 Companion). Association for Computing Machinery, New York, NY, USA, 397–400. https://doi.org/10.1145/3393914.3395912",
      "doi": "10.1145/3393914.3395912"
    },
    {
      "text": "William Odom, Ron Wakkary, Youn-kyung Lim, Audrey Desjardins, Bart Hengeveld, and Richard Banks. 2016. From Research Prototype to Research Product. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 2549–2561. https://doi.org/10.1145/2858036.2858447",
      "doi": "10.1145/2858036.2858447"
    },
    {
      "text": "Chris Olah, Arvind Satyanarayan, Ian Johnson, Shan Carter, Ludwig Schubert, Katherine Ye, and Alexander Mordvintsev. 2018. The Building Blocks of Interpretability. Distill 3, 3 (March 2018), e10. https://doi.org/10.23915/distill.00010",
      "doi": ""
    },
    {
      "text": "Erwin Panofsky. 1991. Perspective as Symbolic Form(1st ed ed.). Zone Books ; Distributed by the MIT Press, New York : Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "James Pierce. 2014. On the Presentation and Production of Design Research Artifacts in HCI. In Proceedings of the 2014 Conference on Designing Interactive Systems(DIS ’14). ACM, New York, NY, USA, 735–744. https://doi.org/10.1145/2598510.2598525 event-place: Vancouver, BC, Canada.",
      "doi": "10.1145/2598510.2598525"
    },
    {
      "text": "James Pierce. 2021. In Tension with Progression: Grasping the Frictional Tendencies of Speculative, Critical, and other Alternative Designs. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–19. https://doi.org/10.1145/3411764.3445406",
      "doi": "10.1145/3411764.3445406"
    },
    {
      "text": "James Pierce and Eric Paulos. 2015. Making Multiple Uses of the Obscura 1C Digital Camera: Reflecting on the Design, Production, Packaging and Distribution of a Counterfunctional Device. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 2103–2112. https://doi.org/10.1145/2702123.2702405",
      "doi": "10.1145/2702123.2702405"
    },
    {
      "text": "James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 2083–2092. https://doi.org/10.1145/2702123.2702438 event-place: Seoul, Republic of Korea.",
      "doi": "10.1145/2702123.2702438"
    },
    {
      "text": "Victoria Purcell-Gates, Jim Anderson, Monique Gagne, Kristy Jang, Kimberly A. Lenters, and Marianne McTavish. 2012. Measuring Situated Literacy Activity: Challenges and Promises. Journal of Literacy Research 44, 4 (Dec. 2012), 396–425. https://doi.org/10.1177/1086296X12457167 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Ming Qian, Congyu Qiao, Jiamin Lin, Zhenyu Guo, Chenghua Li, Cong Leng, and Jian Cheng. 2020. BGGAN: Bokeh-Glass Generative Adversarial Network for Rendering Realistic Bokeh. arXiv:2011.02242 [cs, eess] 12537 (2020), 229–244. https://doi.org/10.1007/978-3-030-67070-2_14 arXiv:2011.02242.",
      "doi": "10.1007/978-3-030-67070-2_14"
    },
    {
      "text": "Anuradha Reddy, Iohanna Nicenboim, James Pierce, and Elisa Giaccardi. 2020. Encountering ethics through design: a workshop with nonhuman participants. AI & SOCIETY (Nov. 2020). https://doi.org/10.1007/s00146-020-01088-7",
      "doi": "10.1007/s00146-020-01088-7"
    },
    {
      "text": "Alastair Reynolds. 2003. Revelation Space. Gollancz, London. OCLC: 464649633.",
      "doi": ""
    },
    {
      "text": "Delanie Ricketts and Dan Lockton. 2019. Mental landscapes: externalizing mental models through metaphors. Interactions 26, 2 (Feb. 2019), 86–90. https://doi.org/10.1145/3301653",
      "doi": "10.1145/3301653"
    },
    {
      "text": "Adi Robertson. 2022. The US Copyright Office says an AI can’t copyright its art. https://www.theverge.com/2022/2/21/22944335/us-copyright-office-reject-ai-generated-art-recent-entrance-to-paradise",
      "doi": ""
    },
    {
      "text": "Frank Rosenblatt. 1958. The perceptron: a probabilistic model for information storage and organization in the brain.Psychological Review 65, 6 (1958), 386–408. Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Julija Rukanskaitė. 2021. Tuning into uncertainty : A material exploration of object detection through play. http://urn.kb.se/resolve?urn=urn:nbn:se:mau:diva-44239",
      "doi": ""
    },
    {
      "text": "Olga Russakovsky, Jia Deng, Hao Su, Jonathan Krause, Sanjeev Satheesh, Sean Ma, Zhiheng Huang, Andrej Karpathy, Aditya Khosla, Michael Bernstein, Alexander C. Berg, and Li Fei-Fei. 2015. ImageNet Large Scale Visual Recognition Challenge. International Journal of Computer Vision 115, 3 (Dec. 2015), 211–252. https://doi.org/10.1007/s11263-015-0816-y",
      "doi": "10.1007/s11263-015-0816-y"
    },
    {
      "text": "Donald A. Schön. 1979. Generative metaphor: A perspective on problem-setting in social policy. In Metaphor and thought. Vol. 2. Cambridge University Press Cambridge, 137–163.",
      "doi": ""
    },
    {
      "text": "Hugo Scurto, Baptiste Caramiaux, and Frederic Bevilacqua. 2021. Prototyping Machine Learning Through Diffractive Art Practice. In Designing Interactive Systems Conference 2021(DIS ’21). Association for Computing Machinery, New York, NY, USA, 2013–2025. https://doi.org/10.1145/3461778.3462163",
      "doi": "10.1145/3461778.3462163"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph ’Jofish’ Kaye. 2005. Reflective Design. In Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility(CC ’05). ACM, New York, NY, USA, 49–58. https://doi.org/10.1145/1094562.1094569 event-place: Aarhus, Denmark.",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Zachary Senzer and Navin Sarma. 2021. Photobombs begone with Magic Eraser in Google Photos. https://blog.google/products/photos/magic-eraser/",
      "doi": ""
    },
    {
      "text": "Petra Sundström, Alex Taylor, Katja Grufberg, Niklas Wirström, Jordi Solsona Belenguer, and Marcus Lundén. 2011. Inspirational bits: towards a shared understanding of the digital material. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 1561–1570. https://doi.org/10.1145/1978942.1979170",
      "doi": "10.1145/1978942.1979170"
    },
    {
      "text": "Grace Turtle. 2022. Mutant in the mirror: Queer becomings with AI. In DRS Biennial Conference Series. https://dl.designresearchsociety.org/drs-conference-papers/drs2022/researchpapers/298",
      "doi": ""
    },
    {
      "text": "Vinay Uday Prabhu and Abeba Birhane. 2020. Large image datasets: A pyrrhic win for computer vision?arXiv e-prints 2006 (June 2020). http://adsabs.harvard.edu/abs/2020arXiv200616923U arXiv:2006.16923.",
      "doi": ""
    },
    {
      "text": "Francisco Varela and Jonathan Shear. 1999. First-Person Methodologies: What, Why, How?Journal of Consciousness Studies 6, 2-3 (1999), 1–14.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2006. What things do : philosophical reflections on technology, agency, and design. Penn State Press, University Park.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2015. Beyond Interaction: A Short Introduction to Mediation Theory. interactions 22, 3 (April 2015), 26–31. https://doi.org/10.1145/2751314",
      "doi": "10.1145/2751314"
    },
    {
      "text": "James Vincent. 2022. \"An engine for the imagination\": an interview with David Holz, CEO of AI image generator Midjourney. https://www.theverge.com/2022/8/2/23287173/ai-image-generation-art-midjourney-multiverse-interview-david-holz",
      "doi": ""
    },
    {
      "text": "Ron Wakkary. 2021. Things We Could Design: For More Than Human-Centered Worlds. MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary, Doenja Oogjes, Sabrina Hauser, Henry Lin, Cheng Cao, Leo Ma, and Tijs Duel. 2017. Morse Things: A Design Inquiry into the Gap Between Things and Us. In Proceedings of the 2017 Conference on Designing Interactive Systems(DIS ’17). ACM, New York, NY, USA, 503–514. https://doi.org/10.1145/3064663.3064734",
      "doi": "10.1145/3064663.3064734"
    },
    {
      "text": "Bernhard Waldenfels. 2000. Time Lag: Motifs for a Phenomenology of the Experience of Time. Research in Phenomenology 30 (2000), 107–119. http://www.jstor.org/stable/24654799 Publisher: Brill.",
      "doi": ""
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y. Lim. 2019. Designing Theory-Driven User-Centric Explainable AI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, Glasgow, Scotland Uk, 1–15. https://doi.org/10.1145/3290605.3300831",
      "doi": "10.1145/3290605.3300831"
    },
    {
      "text": "Charlie Warzel. 2022. Where Does Alex Jones Go From Here?https://newsletters.theatlantic.com/galaxy-brain/62f28a6bbcbd490021af2db4/where-does-alex-jones-go-from-here/",
      "doi": ""
    },
    {
      "text": "Yao Xie, Melody Chen, David Kao, Ge Gao, and Xiang ’Anthony’ Chen. 2020. CheXplain: Enabling Physicians to Explore and Understand Data-Driven, AI-Enabled Medical Imaging Analysis. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376807",
      "doi": "10.1145/3313831.3376807"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Zili Yi, Qiang Tang, Shekoofeh Azizi, Daesik Jang, and Zhan Xu. 2020. Contextual Residual Aggregation for Ultra High-Resolution Image Inpainting. arXiv:2005.09704 [cs] (May 2020). http://arxiv.org/abs/2005.09704 arXiv:2005.09704.",
      "doi": ""
    },
    {
      "text": "Clement Zheng, HyunJoo Oh, Laura Devendorf, and Ellen Yi-Luen Do. 2019. Sensing Kirigami. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 921–934. https://doi.org/10.1145/3322276.3323689",
      "doi": "10.1145/3322276.3323689"
    },
    {
      "text": "Bolei Zhou, Agata Lapedriza, Aditya Khosla, Aude Oliva, and Antonio Torralba. 2018. Places: A 10 Million Image Database for Scene Recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 40, 6 (June 2018), 1452–1464. https://doi.org/10.1109/TPAMI.2017.2723009 Conference Name: IEEE Transactions on Pattern Analysis and Machine Intelligence.",
      "doi": ""
    }
  ]
}