{
  "doi": "10.1145/3544548.3581210",
  "title": "Performative Vocal Synthesis for Foreign Language Intonation Practice",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2023,
  "badges": [],
  "abstract": "Typical foreign language (L2) pronunciation training focuses mainly on individual sounds. Intonation, the patterns of pitch change across words or phrases is often neglected, despite its key role in word-level intelligibility and in the expression of attitudes and affect. This paper examines hand-controlled real-time vocal synthesis, known as Performative Vocal Synthesis (PVS), as an interaction technique for practicing L2 intonation in computer aided pronunciation training (CAPT).  We evaluate a tablet-based interface where users gesturally control the pitch of a pre-recorded utterance by drawing curves on the touchscreen. 24 subjects (12 French learners, 12 British controls) imitated English phrases with their voice and the interface. Results of an acoustic analysis and expert perceptive evaluation showed that learners’ gestural imitations yielded more accurate results than vocal imitations of the fall-rise intonation pattern typically difficult for francophones, suggesting that PVS can help learners produce intonation patterns beyond the capabilities of their natural voice.",
  "tags": [
    "gesture",
    "vocal synthesis",
    "intonation",
    "performative vocal synthesis",
    "CAPT",
    "prosody",
    "language learning"
  ],
  "authors": [
    {
      "name": "Xiao Xiao",
      "institution": "Léonard de Vinci Pôle Universitaire, Research Center, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781003",
      "orcid": "0000-0001-7525-5129"
    },
    {
      "name": "Barbara Kuhnert",
      "institution": "Laboratoire de Phonétique et Phonologie UMR 7018, Sorbonne Nouvelle, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659958760",
      "orcid": "0000-0003-4805-8490"
    },
    {
      "name": "Nicolas Audibert",
      "institution": "Laboratoire de Phonétique et Phonologie UMR 7018, Sorbonne Nouvelle, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781952",
      "orcid": "0000-0003-3648-9322"
    },
    {
      "name": "Grégoire Locqueville",
      "institution": "Institut Jean Le Rond d'Alembert, Sorbonne Université, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780310",
      "orcid": "0000-0002-4122-6693"
    },
    {
      "name": "Claire Pillot-Loiseau",
      "institution": "Laboratoire de Phonétique et Phonologie UMR 7018, Sorbonne Nouvelle, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781588",
      "orcid": "0000-0003-2167-5392"
    },
    {
      "name": "Haohan Zhang",
      "institution": "Laboratoire de Phonétique et Phonologie UMR 7018, Sorbonne Nouvelle, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782801",
      "orcid": "0000-0003-1675-6526"
    },
    {
      "name": "Christophe D'Alessandro",
      "institution": "Institut Jean Le Rond D'Alembert, CNRS Sorbonne Université, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100077652",
      "orcid": "0000-0002-2629-8752"
    }
  ],
  "references": [
    {
      "text": "2022. Guthman Musical Instrument Competition, 2022 Competition. https://guthman.gatech.edu/2022-competition. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Pierre Badin, Atef Ben Youssef, Gérard Bailly, Frédéric Elisei, and Thomas Hueber. 2010. Visual articulatory feedback for phonetic correction in second language learning. In L2SW, Workshop on\" Second Language Studies: Acquisition, Learning, Education and Technology. P1–10.",
      "doi": ""
    },
    {
      "text": "Paul Boersma and David Weenink. 1992-2022. Praat: doing phonetics by computer [Computer program]. Version 6.1.08, retrieved 5 December 2019 from http://www.praat.org.",
      "doi": ""
    },
    {
      "text": "Elena Boitsova, Evgeny Pyshkin, Yasuta Takako, Natalia Bogach, Iurii Lezhenin, Anton Lamtev, and Vadim Diachkov. 2018. StudyIntonation courseware kit for EFL prosody teaching. In Proceedings of the 9th International Conference on Speech Prosody. 413–417.",
      "doi": ""
    },
    {
      "text": "Yaohua Bu, Tianyi Ma, Weijun Li, Hang Zhou, Jia Jia, Shengqi Chen, Kaiyuan Xu, Dachuan Shi, Haozhe Wu, Zhihan Yang, 2021. PTeacher: a Computer-Aided Personalized Pronunciation Training System with Exaggerated Audio-Visual Corrective Feedback. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445490"
    },
    {
      "text": "Dorothy Chun. 1998. Signal analysis software for teaching discourse intonation. Language Learning & Technology 2, 1 (1998), 74–93.",
      "doi": ""
    },
    {
      "text": "Cristina Crison, Daniel Romero, Joaquín Romero, and Rovira i Virgili. 2018. The practical application of hand gestures as a means of improving English intonation. In Proc. ISAPh 2018 International Symposium on Applied Phonetics. 45–50.",
      "doi": ""
    },
    {
      "text": "Alan Cruttenden 1997. Intonation. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Madalena Cruz-Ferreira. 1984. Perception and interpretation of non-native intonation patterns. In Proceedings of the tenth International Congress of Phonetic Sciences. De Gruyter Mouton, 565–569.",
      "doi": ""
    },
    {
      "text": "Christophe d’Alessandro, Lionel Feugère, Sylvain Le Beux, Olivier Perrotin, and Albert Rilliard. 2014. Drawing melodies: Evaluation of chironomic singing synthesis. The Journal of the Acoustical Society of America 135, 6 (2014), 3601–3612.",
      "doi": ""
    },
    {
      "text": "Christophe d’Alessandro, Xiao Xiao, Grégoire Locqueville, and Boris Doval. 2019. Borrowed voices. In International Conference on New Interfaces for Musical Expression NIME’19. 2–2.",
      "doi": ""
    },
    {
      "text": "Kees De Bot. 1983. Visual feedback of intonation I: Effectiveness and induced practice behavior. Language and speech 26, 4 (1983), 331–350.",
      "doi": ""
    },
    {
      "text": "Tracey M Derwing and Marian J Rossiter. 2002. ESL learners’ perceptions of their pronunciation needs and strategies. System 30, 2 (2002), 155–166.",
      "doi": ""
    },
    {
      "text": "Christophe d’Alessandro, Albert Rilliard, and Sylvain Le Beux. 2011. Chironomic stylization of intonation. The Journal of the Acoustical Society of America 129, 3 (2011), 1594–1604.",
      "doi": ""
    },
    {
      "text": "Marc Evrard, Samuel Delalez, Christophe d’Alessandro, and Albert Rilliard. 2015. Comparison of chironomic stylization versus statistical modeling of prosody for expressive speech synthesis. In Sixteenth Annual Conference of the International Speech Communication Association.",
      "doi": ""
    },
    {
      "text": "S. Sidney Fels and Geoffrey E. Hinton. 1993. Glove-talk: A neural network interface between a data-glove and a speech synthesizer. Neural Networks, IEEE Trans. on 4, 1 (1993), 2–8.",
      "doi": "10.1109/72.182690"
    },
    {
      "text": "S. Sydney Fels and Geoffrey E. Hinton. 1998. Glove-Talk II-a neural-network interface which maps gestures to parallel formant speech synthesizer controls. IEEE Trans.on Neural Networks 9, 1 (Jan 1998), 205–212. https://doi.org/10.1109/72.655042",
      "doi": "10.1109/72.655042"
    },
    {
      "text": "Lionel Feugère, Christophe d’Alessandro, and Boris Doval. 2013. Performative voice synthesis for edutainment in acoustic phonetics and singing: A case study using the “Cantor Digitalis”. In International Conference on Intelligent Technologies for Interactive Entertainment. Springer, 169–178.",
      "doi": ""
    },
    {
      "text": "Joseph L Fleiss. 1971. Measuring nominal scale agreement among many raters.Psychological bulletin 76, 5 (1971), 378.",
      "doi": ""
    },
    {
      "text": "Atsushi Fujimori, Noriko Yoshimura, and Noriko Yamane. 2015. The development of visual CALL materials for learning L2 English prosody. In Conference proceedings. ICT for language learning. libreriauniversitaria. it Edizioni, 249.",
      "doi": ""
    },
    {
      "text": "Abbas Pourhossein Gilakjani and Mohammad Reza Ahmadi. 2011. Why Is Pronunciation So Difficult to Learn?.English language teaching 4, 3 (2011), 74–83.",
      "doi": ""
    },
    {
      "text": "Pierre A Hallé, Yueh-Chin Chang, and Catherine T Best. 2004. Identification and discrimination of Mandarin Chinese tones by Mandarin Chinese vs. French listeners. Journal of phonetics 32, 3 (2004), 395–421.",
      "doi": ""
    },
    {
      "text": "Sophie Herment and Anne Tortel. 2021. The intonation contour of non-finality revisited: implications for EFL teaching. In English pronunciation instruction: Research-based Insights, Applied Linguisics series, Anastazija Kirkova-Naskova, Alice Henderson, and Jonás Fouz-González (Eds.). John Benjamins, Amsterdam, Netherlands, 175–195.",
      "doi": ""
    },
    {
      "text": "Rebecca Hincks. 2003. Speech technologies for pronunciation feedback and evaluation. ReCALL 15, 1 (2003), 3–20.",
      "doi": "10.1017/S0958344003000211"
    },
    {
      "text": "Daniel Hirst and Albert Di Cristo. 1998. Intonation systems. A survey of Twenty Languages(1998).",
      "doi": ""
    },
    {
      "text": "Thomas Kisler, Uwe Reichel, and Florian Schiel. 2017. Multilingual processing of speech via web services. Computer Speech & Language 45 (2017), 326–347.",
      "doi": "10.1016/j.csl.2017.01.005"
    },
    {
      "text": "Grégoire Locqueville, Christophe d’Alessandro, Samuel Delalez, Boris Doval, and Xiao Xiao. 2020. Voks: Digital instruments for chironomic control of voice samples. Speech Communication 125(2020), 97–113.",
      "doi": ""
    },
    {
      "text": "Steven G McCafferty. 2006. Gesture and the materialization of second language prosody. (2006).",
      "doi": ""
    },
    {
      "text": "Murray J Munro and Tracey M Derwing. 1999. Foreign accent, comprehensibility, and intelligibility in the speech of second language learners. Language learning 49(1999), 285–310.",
      "doi": ""
    },
    {
      "text": "Yishuang Ning, Zhiyong Wu, Jia Jia, Fanbo Meng, Helen Meng, and Lianhong Cai. 2015. HMM-based emphatic speech synthesis for corrective feedback in computer-aided pronunciation training. In 2015 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 4934–4938.",
      "doi": ""
    },
    {
      "text": "Martha C Pennington. 1999. Computer-aided pronunciation pedagogy: Promise, limitations, directions. Computer assisted language learning 12, 5 (1999), 427–440.",
      "doi": ""
    },
    {
      "text": "Brechtje Post, Mariapaola d’Imperio, and Carlos Gussenhoven. 2007. Fine phonetic detail and intonational meaning. In International Congress of Phonetic Science (ICPhS). 191–196.",
      "doi": ""
    },
    {
      "text": "Evgeny Pyshkin, John Blake, Anton Lamtev, Iurii Lezhenin, Artyom Zhuikov, and Natalia Bogach. 2019. Prosody training mobile application: Early design assessment and lessons learned. In 2019 10th IEEE International Conference on Intelligent Data Acquisition and Advanced Computing Systems: Technology and Applications (IDAACS), Vol. 2. IEEE, 735–740.",
      "doi": "10.1109/IDAACS.2019.8924359"
    },
    {
      "text": "R Core Team. 2020. R: A Language and Environment for Statistical Computing. R Foundation for Statistical Computing, Vienna, Austria. https://www.R-project.org/",
      "doi": ""
    },
    {
      "text": "Tetyana Smotrova. 2017. Making pronunciation visible: Gesture in teaching pronunciation. Tesol Quarterly 51, 1 (2017), 59–89.",
      "doi": ""
    },
    {
      "text": "Marton Soskuthy. 2021. Evaluating generalised additive mixed modelling strategies for dynamic speech analysis. Journal of Phonetics 84(2021), 101017.",
      "doi": ""
    },
    {
      "text": "Ron I Thomson and Tracey M Derwing. 2015. The effectiveness of L2 pronunciation instruction: A narrative review. Applied Linguistics 36, 3 (2015), 326–344.",
      "doi": ""
    },
    {
      "text": "Juhani Toivanen. 2007. Fall-rise intonation usage in Finnish English second language discourse. Proceedings of Fonetik 2007, TMH-QPSR, 50 (1) (2007), 85–88.",
      "doi": ""
    },
    {
      "text": "Jacolien van Rij, Martijn Wieling, R. Harald Baayen, and Hedderik van Rijn. 2020. itsadug: Interpreting Time Series and Autocorrelated Data Using GAMMs. R package version 2.4.",
      "doi": ""
    },
    {
      "text": "Gregory Ward and Julia Hirschberg. 1985. Implicating uncertainty: The pragmatics of fall-rise intonation. Language (1985), 747–776.",
      "doi": ""
    },
    {
      "text": "Martijn Wieling. 2018. Analyzing dynamic phonetic data using generalized additive mixed modeling: A tutorial focusing on articulatory differences between L1 and L2 speakers of English. Journal of Phonetics 70(2018), 86–116.",
      "doi": ""
    },
    {
      "text": "S. N. Wood. 2011. Fast stable restricted maximum likelihood and marginal likelihood estimation of semiparametric generalized linear models. Journal of the Royal Statistical Society (B) 73, 1 (2011), 3–36.",
      "doi": ""
    },
    {
      "text": "S. N. Wood. 2017. Generalized Additive Models: An Introduction with R (2 ed.). Chapman and Hall/CRC.",
      "doi": ""
    },
    {
      "text": "Xiao Xiao, Nicolas Audibert, Grégoire Locqueville, Christophe d’Alessandro, Barbara Kuhnert, and Claire Pillot-Loiseau. 2021. Prosodic Disambiguation Using Chironomic Stylization of Intonation with Native and Non-Native Speakers. In Interspeech 2021. ISCA, 516–520.",
      "doi": ""
    },
    {
      "text": "Xiao Xiao, Grégoire Locqueville, Christophe d’Alessandro, and Boris Doval. 2019. T-Voks: the singing and speaking theremin. In NIME 2019 International Conference on New Interfaces for Musical Expression. 110–115.",
      "doi": ""
    },
    {
      "text": "Johan ’t Hart. 1981. Differential sensitivity to pitch distance, particularly in speech. The Journal of the Acoustical Society of America 69, 3 (1981), 811–821.",
      "doi": ""
    }
  ]
}