{
  "doi": "10.1145/3544548.3581152",
  "title": "A Mixed-Methods Approach to Understanding User Trust after Voice Assistant Failures",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Despite huge gains in performance in natural language understanding via large language models in recent years, voice assistants still often fail to meet user expectations. In this study, we conducted a mixed-methods analysis of how voice assistant failures affect users’ trust in their voice assistants. To illustrate how users have experienced these failures, we contribute a crowdsourced dataset of 199 voice assistant failures, categorized across 12 failure sources. Relying on interview and survey data, we find that certain failures, such as those due to overcapturing users’ input, derail user trust more than others. We additionally examine how failures impact users’ willingness to rely on voice assistants for future tasks. Users often stop using their voice assistants for specific tasks that result in failures for a short period of time before resuming similar usage. We demonstrate the importance of low stakes tasks, such as playing music, towards building trust after failures.",
  "authors": [
    {
      "name": "Amanda Baughan",
      "institution": "Paul G. Allen School of Computer Science and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527940",
      "orcid": "0000-0003-2217-6974"
    },
    {
      "name": "Xuezhi Wang",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659259549",
      "orcid": "0000-0003-3299-2780"
    },
    {
      "name": "Ariel Liu",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260482",
      "orcid": "0000-0002-0513-7474"
    },
    {
      "name": "Allison Mercurio",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783481",
      "orcid": "0000-0002-6865-8648"
    },
    {
      "name": "Jilin Chen",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487940",
      "orcid": "0000-0002-0513-7474"
    },
    {
      "name": "Xiao Ma",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987040",
      "orcid": "0000-0001-6134-3531"
    }
  ],
  "references": [
    {
      "text": "Deepali Aneja, Daniel McDuff, and Mary Czerwinski. 2020. Conversational Error Analysis in Human-Agent Interaction. In Proceedings of the 20th ACM International Conference on Intelligent Virtual Agents. Association for Computing Machinery, New York, NY, USA, Article 3, 8 pages. https://doi.org/10.1145/3383652.3423901",
      "doi": "10.1145/3383652.3423901"
    },
    {
      "text": "Ron Artstein, Jill Boberg, Alesia Gainer, Jonathan Gratch, Emmanuel Johnson, Anton Leuski, Gale Lucas, and David Traum. 2018. The Niki and Julie Corpus: Collaborative Multimodal Dialogues between Humans, Robots, and Virtual Agents. In Proceedings of the Eleventh International Conference on Language Resources and Evaluation (LREC 2018). European Language Resources Association (ELRA), Miyazaki, Japan. https://aclanthology.org/L18-1463",
      "doi": ""
    },
    {
      "text": "Tammy Bahmanziari, J Michael Pearson, and Leon Crosby. 2003. Is trust important in technology adoption? A policy capturing approach. Journal of Computer Information Systems 43, 4 (2003), 46–54.",
      "doi": ""
    },
    {
      "text": "Yonatan Belinkov and Yonatan Bisk. 2017. Synthetic and natural noise both break neural machine translation. arXiv preprint arXiv:1711.02173(2017).",
      "doi": ""
    },
    {
      "text": "Timothy Bickmore and Justine Cassell. 2001. Relational Agents: A Model and Implementation of Building User Trust. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, USA) (CHI ’01). Association for Computing Machinery, New York, NY, USA, 396–403. https://doi.org/10.1145/365024.365304",
      "doi": "10.1145/365024.365304"
    },
    {
      "text": "Timothy Bickmore and Justine Cassell. 2005. Social Dialongue with Embodied Conversational Agents. Springer Netherlands, Dordrecht, 23–54. https://doi.org/10.1007/1-4020-3933-6_2",
      "doi": ""
    },
    {
      "text": "Michael Braun, Anja Mainz, Ronee Chadowitz, Bastian Pfleging, and Florian Alt. 2019. At Your Service: Designing Voice Assistant Personalities to Improve Automotive User Interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300270",
      "doi": "10.1145/3290605.3300270"
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, 2020. Language models are few-shot learners. Advances in neural information processing systems 33 (2020), 1877–1901.",
      "doi": ""
    },
    {
      "text": "Heloisa Candello, Claudio Pinhanez, Mauro Pichiliani, Paulo Cavalin, Flavio Figueiredo, Marisa Vasconcelos, and Haylla Do Carmo. 2019. The Effect of Audiences on the User Experience with Conversational Interfaces in Physical Spaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300320",
      "doi": "10.1145/3290605.3300320"
    },
    {
      "text": "Herbert H. Clark. 1996. Using Language. Cambridge University Press, Cambridge, UK. https://doi.org/10.1017/CBO9780511620539",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane, Emer Gilmartin, Christine Murad, Cosmin Munteanu, Vincent Wade, and Benjamin R. Cowan. 2019. What Makes a Good Conversation? Challenges in Designing Truly Conversational Agents. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300705",
      "doi": "10.1145/3290605.3300705"
    },
    {
      "text": "Jamie Condliffe. 2017. AI Voice Assistant Apps are Proliferating, but People Don’t Use Them. MIT Technology Review. https://www.technologyreview.com/2017/01/23/154449/ai-voice-assistant-apps-are-proliferating-but-people-dont-use-them/.",
      "doi": ""
    },
    {
      "text": "Toby A. Cox. 2020. Siri and Alexa Fails: Frustrations With Voice Search. https://themanifest.com/digital-marketing/resources/siri-alexa-fails-frustrations-with-voice-search",
      "doi": ""
    },
    {
      "text": "John W Creswell and Cheryl N Poth. 2016. Qualitative inquiry and research design: Choosing among five approaches. Sage publications, Thousand Oaks.",
      "doi": ""
    },
    {
      "text": "Andrea Cuadra, Hansol Lee, Jason Cho, and Wendy Ju. 2021. Look at Me When I Talk to You: A Video Dataset to Enable Voice Assistants to Recognize Errors. arXiv preprint arXiv:2104.07153(2021).",
      "doi": ""
    },
    {
      "text": "Andrea Cuadra, Shuran Li, Hansol Lee, Jason Cho, and Wendy Ju. 2021. My Bad! Repairing Intelligent Voice Assistant Errors Improves Interaction. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–24.",
      "doi": "10.1145/3449101"
    },
    {
      "text": "Celso M De Melo, Kangsoo Kim, Nahal Norouzi, Gerd Bruder, and Gregory Welch. 2020. Reducing Cognitive Load and Improving Warfighter Problem Solving With Intelligent Virtual Assistants. Frontiers in psychology 11 (2020), 554706.",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805(2018).",
      "doi": ""
    },
    {
      "text": "Berkeley J Dietvorst, Joseph P Simmons, and Cade Massey. 2015. Algorithm aversion: people erroneously avoid algorithms after seeing them err.Journal of Experimental Psychology: General 144, 1 (2015), 114.",
      "doi": ""
    },
    {
      "text": "Mary T Dzindolet, Linda G Pierce, Hall P Beck, and Lloyd A Dawe. 2002. The perceived utility of human and automated aids in a visual detection task. Human factors 44, 1 (2002), 79–94.",
      "doi": ""
    },
    {
      "text": "Javid Ebrahimi, Anyi Rao, Daniel Lowd, and Dejing Dou. 2018. HotFlip: White-Box Adversarial Examples for Text Classification. In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers). Association for Computational Linguistics, Melbourne, Australia, 31–36. https://doi.org/10.18653/v1/P18-2006",
      "doi": ""
    },
    {
      "text": "Yuksel Ekinci and Philip L Dawes. 2009. Consumer perceptions of frontline service employee personality traits, interaction quality, and consumer satisfaction. The service industries journal 29, 4 (2009), 503–521.",
      "doi": ""
    },
    {
      "text": "Joel E. Fischer, Stuart Reeves, Martin Porcheron, and Rein Ove Sikveland. 2019. Progressivity for Voice Interface Design. In Proceedings of the 1st International Conference on Conversational User Interfaces (Dublin, Ireland) (CUI ’19). Association for Computing Machinery, New York, NY, USA, Article 26, 8 pages. https://doi.org/10.1145/3342775.3342788",
      "doi": "10.1145/3342775.3342788"
    },
    {
      "text": "Jack FitzGerald, Shankar Ananthakrishnan, Konstantine Arkoudas, Davide Bernardi, Abhishek Bhagia, Claudio Delli Bovi, Jin Cao, Rakesh Chada, Amit Chauhan, Luoxin Chen, Anurag Dwarakanath, Satyam Dwivedi, Turan Gojayev, Karthik Gopalakrishnan, Thomas Gueudre, Dilek Hakkani-Tur, Wael Hamza, Jonathan J. Hüser, Kevin Martin Jose, Haidar Khan, Beiye Liu, Jianhua Lu, Alessandro Manzotti, Pradeep Natarajan, Karolina Owczarzak, Gokmen Oz, Enrico Palumbo, Charith Peris, Chandana Satya Prakash, Stephen Rawls, Andy Rosenbaum, Anjali Shenoy, Saleh Soltan, Mukund Harakere Sridhar, Lizhen Tan, Fabian Triefenbach, Pan Wei, Haiyang Yu, Shuai Zheng, Gokhan Tur, and Prem Natarajan. 2022. Alexa Teacher Model: Pretraining and Distilling Multi-Billion-Parameter Encoders for Natural Language Understanding Systems. In Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (Washington DC, USA) (KDD ’22). Association for Computing Machinery, New York, NY, USA, 2893–2902. https://doi.org/10.1145/3534678.3539173",
      "doi": "10.1145/3534678.3539173"
    },
    {
      "text": "Karthik Gopalakrishnan, Behnam Hedayatnia, Qinlang Chen, Anna Gottardi, Sanjeev Kwatra, Anu Venkatesh, Raefer Gabriel, and Dilek Hakkani-Tür. 2019. Topical-Chat: Towards Knowledge-Grounded Open-Domain Conversations. In Proc. Interspeech 2019. 1891–1895. https://doi.org/10.21437/Interspeech.2019-3079",
      "doi": ""
    },
    {
      "text": "Aditya Gupta, Jiacheng Xu, Shyam Upadhyay, Diyi Yang, and Manaal Faruqui. 2021. Disfl-QA: A Benchmark Dataset for Understanding Disfluencies in Question Answering. In Findings of ACL.",
      "doi": ""
    },
    {
      "text": "Paige Hayes, Jason Wagner, Mark McCaffrey, and Matt Hobbs. 2018. Consumer intelligence series: Prepare for the Voice Revolution. https://www.pwc.com/us/en/services/consulting/library/consumer-intelligence-series/voice-assistants.html",
      "doi": ""
    },
    {
      "text": "Matthew K. Hong, Adam Fourney, Derek DeBellis, and Saleema Amershi. 2021. Planning for Natural Language Failures with the AI Playbook. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 386, 11 pages. https://doi.org/10.1145/3411764.3445735",
      "doi": "10.1145/3411764.3445735"
    },
    {
      "text": "Tatum Hunter. 2022. Siri and Alexa are getting on their owners’ last nerves. The Washington Post. https://www.washingtonpost.com/technology/2022/03/07/voice-assistants-wrong-answers/. (Accessed on 06/08/2022).",
      "doi": ""
    },
    {
      "text": "Rinat Khaziev, Usman Shahid, Tobias Röding, Rakesh Chada, Emir Kapanci, and Pradeep Natarajan. 2022. FPI: Failure Point Isolation in Large-scale Conversational Assistants. In Proceedings of the 2022 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies: Industry Track. Association for Computational Linguistics, Hybrid: Seattle, Washington + Online, 141–148. https://doi.org/10.18653/v1/2022.naacl-industry.17",
      "doi": ""
    },
    {
      "text": "Dounia Lahoual and Myriam Frejus. 2019. When Users Assist the Voice Assistants: From Supervision to Failure Resolution. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299053",
      "doi": "10.1145/3290607.3299053"
    },
    {
      "text": "Chia-Hsuan Lee, Szu-Lin Wu, Chi-Liang Liu, and Hung-yi Lee. 2018. Spoken SQuAD: A Study of Mitigating the Impact of Speech Recognition Errors on Listening Comprehension. Proc. Interspeech 2018(2018), 3459–3463.",
      "doi": ""
    },
    {
      "text": "One-Ki Daniel Lee, Ramakrishna Ayyagari, Farzaneh Nasirian, and Mohsen Ahmadian. 2021. Role of interaction quality and trust in use of AI-based voice-assistant systems. Journal of Systems and Information Technology 23, 2(2021), 154–170.",
      "doi": ""
    },
    {
      "text": "Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Mandar Joshi, Danqi Chen, Omer Levy, Mike Lewis, Luke Zettlemoyer, and Veselin Stoyanov. 2019. Roberta: A robustly optimized bert pretraining approach. arXiv preprint arXiv:1907.11692(2019).",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5286–5297. https://doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Xiao Ma, Jeffrey T. Hancock, Kenneth Lim Mingjie, and Mor Naaman. 2017. Self-Disclosure and Perceived Trustworthiness of Airbnb Host Profiles. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 2397–2409. https://doi.org/10.1145/2998181.2998269",
      "doi": "10.1145/2998181.2998269"
    },
    {
      "text": "Maria Madsen and Shirley Gregor. 2000. Measuring human-computer trust. In 11th australasian conference on information systems, Vol. 53. 6–8.",
      "doi": ""
    },
    {
      "text": "Alexandre Magueresse, Vincent Carles, and Evan Heetderks. 2020. Low-resource languages: A review of past work and future challenges. arXiv preprint arXiv:2006.07264(2020).",
      "doi": ""
    },
    {
      "text": "Amama Mahmood, Jeanie W Fung, Isabel Won, and Chien-Ming Huang. 2022. Owning Mistakes Sincerely: Strategies for Mitigating AI Errors. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 578, 11 pages. https://doi.org/10.1145/3491102.3517565",
      "doi": "10.1145/3491102.3517565"
    },
    {
      "text": "Roger C Mayer, James H Davis, and F David Schoorman. 1995. An integrative model of organizational trust. Academy of management review 20, 3 (1995), 709–734.",
      "doi": ""
    },
    {
      "text": "Nikita Mehandru, Samantha Robertson, and Niloufar Salehi. 2022. Reliable and Safe Use of Machine Translation in Medical Settings. In 2022 ACM Conference on Fairness, Accountability, and Transparency (Seoul, Republic of Korea) (FAccT ’22). Association for Computing Machinery, New York, NY, USA, 2016–2025. https://doi.org/10.1145/3531146.3533244",
      "doi": "10.1145/3531146.3533244"
    },
    {
      "text": "John Miller, Karl Krauth, Benjamin Recht, and Ludwig Schmidt. 2020. The Effect of Natural Distribution Shift on Question Answering Models. In Proceedings of the 37th International Conference on Machine Learning(ICML’20). JMLR.org, Article 641, 12 pages.",
      "doi": "10.5555/3524938.3525579"
    },
    {
      "text": "Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for How Users Overcome Obstacles in Voice User Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3173574.3173580",
      "doi": "10.1145/3173574.3173580"
    },
    {
      "text": "Aakanksha Naik, Abhilasha Ravichander, Norman Sadeh, Carolyn Rose, and Graham Neubig. 2018. Stress test evaluation for natural language inference. arXiv preprint arXiv:1806.00692(2018).",
      "doi": ""
    },
    {
      "text": "Farzaneh Nasirian, Mohsen Ahmadian, and One-Ki Daniel Lee. 2017. AI-Based Voice Assistant Systems: Evaluating from the Interaction and Trust Perspectives. In Americas Conference on Information Systems.",
      "doi": ""
    },
    {
      "text": "Tim Paek and Eric J Horvitz. 2013. Conversation as action under uncertainty. arXiv preprint arXiv:1301.3883(2013).",
      "doi": ""
    },
    {
      "text": "Yury Pinsky. 2021. Loud and clear: AI is improving Assistant conversations. https://blog.google/products/assistant/loud-and-clear-ai-improving-assistant-conversations/. (Accessed on 12/12/2022).",
      "doi": ""
    },
    {
      "text": "Pranav Rajpurkar, Robin Jia, and Percy Liang. 2018. Know what you don’t know: Unanswerable questions for SQuAD. arXiv preprint arXiv:1806.03822(2018).",
      "doi": ""
    },
    {
      "text": "Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. 2016. Squad: 100,000+ questions for machine comprehension of text. arXiv preprint arXiv:1606.05250(2016).",
      "doi": ""
    },
    {
      "text": "Siva Reddy, Danqi Chen, and Christopher D Manning. 2019. Coqa: A conversational question answering challenge. Transactions of the Association for Computational Linguistics 7 (2019), 249–266.",
      "doi": ""
    },
    {
      "text": "Samantha Robertson and Mark Díaz. 2022. Understanding and Being Understood: User Strategies for Identifying and Recovering From Mistranslations in Machine Translation-Mediated Chat. In 2022 ACM Conference on Fairness, Accountability, and Transparency (Seoul, Republic of Korea) (FAccT ’22). Association for Computing Machinery, New York, NY, USA, 2223–2238. https://doi.org/10.1145/3531146.3534638",
      "doi": "10.1145/3531146.3534638"
    },
    {
      "text": "Tulika Saha, Saichethan Reddy, Anindya Das, Sriparna Saha, and Pushpak Bhattacharyya. 2022. A Shoulder to Cry on: Towards A Motivational Virtual Assistant for Assuaging Mental Agony. In Proceedings of the 2022 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Seattle, United States, 2436–2449. https://doi.org/10.18653/v1/2022.naacl-main.174",
      "doi": ""
    },
    {
      "text": "Maha Salem, Gabriella Lakatos, Farshid Amirabdollahian, and Kerstin Dautenhahn. 2015. Would You Trust a (Faulty) Robot? Effects of Error, Task Type and Personality on Human-Robot Cooperation and Trust. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (Portland, Oregon, USA) (HRI ’15). Association for Computing Machinery, New York, NY, USA, 141–148. https://doi.org/10.1145/2696454.2696497",
      "doi": "10.1145/2696454.2696497"
    },
    {
      "text": "William Seymour and Max Van Kleek. 2021. Exploring Interactions Between Trust, Anthropomorphism, and Relationship Development in Voice Assistants. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–16.",
      "doi": "10.1145/3479515"
    },
    {
      "text": "Emre Sezgin, Yungui Huang, Ujjwal Ramtekkar, and Simon Lin. 2020. Readiness for voice assistants to support healthcare delivery during a health crisis and pandemic. NPJ Digital Medicine 3, 1 (2020), 1–4.",
      "doi": ""
    },
    {
      "text": "Shaden Smith, Mostofa Patwary, Brandon Norick, Patrick LeGresley, Samyam Rajbhandari, Jared Casper, Zhun Liu, Shrimai Prabhumoye, George Zerveas, Vijay Korthikanti, 2022. Using deepspeed and megatron to train megatron-turing nlg 530b, a large-scale generative language model. arXiv preprint arXiv:2201.11990(2022).",
      "doi": ""
    },
    {
      "text": "Yueming Sun and Yi Zhang. 2018. Conversational Recommender System. In The 41st International ACM SIGIR Conference on Research & Development in Information Retrieval (Ann Arbor, MI, USA) (SIGIR ’18). Association for Computing Machinery, New York, NY, USA, 235–244. https://doi.org/10.1145/3209978.3210002",
      "doi": "10.1145/3209978.3210002"
    },
    {
      "text": "Romal Thoppilan, Daniel De Freitas, Jamie Hall, Noam Shazeer, Apoorv Kulshreshtha, Heng-Tze Cheng, Alicia Jin, Taylor Bos, Leslie Baker, Yu Du, 2022. LaMDA: Language Models for Dialog Applications. arXiv preprint arXiv:2201.08239(2022). https://arxiv.org/abs/2201.08239",
      "doi": ""
    },
    {
      "text": "Suzanne Tolmeijer, Naim Zierau, Andreas Janson, Jalil Sebastian Wahdatehagh, Jan Marco Marco Leimeister, and Abraham Bernstein. 2021. Female by Default? – Exploring the Effect of Voice Assistant Gender and Pitch on Trait and Trust Attribution. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 455, 7 pages. https://doi.org/10.1145/3411763.3451623",
      "doi": "10.1145/3411763.3451623"
    },
    {
      "text": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. 2017. Attention is All you Need. In Advances in Neural Information Processing Systems, I. Guyon, U. Von Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett (Eds.). Vol. 30. Curran Associates, Inc.https://proceedings.neurips.cc/paper/2017/file/3f5ee243547dee91fbd053c1c4a845aa-Paper.pdf",
      "doi": ""
    },
    {
      "text": "Julia Velkovska and Moustafa Zouinar. 2018. The illusion of natural conversation: interacting with smart assistants in home settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Xuezhi Wang, Haohan Wang, and Diyi Yang. 2021. Measure and Improve Robustness in NLP Models: A Survey. arXiv preprint arXiv:2112.08313(2021).",
      "doi": ""
    },
    {
      "text": "Jason Wei, Maarten Bosma, Vincent Y Zhao, Kelvin Guu, Adams Wei Yu, Brian Lester, Nan Du, Andrew M Dai, and Quoc V Le. 2021. Finetuned language models are zero-shot learners. arXiv preprint arXiv:2109.01652(2021).",
      "doi": ""
    },
    {
      "text": "Peter Winter and Annamaria Carusi. 2022. ‘If You’re Going to Trust the Machine, Then That Trust Has Got to Be Based on Something’:: Validation and the Co-Constitution of Trust in Developing Artificial Intelligence (AI) for the Early Diagnosis of Pulmonary Hypertension (PH). Science & Technology Studies 35, 4 (2022), 58–77.",
      "doi": ""
    },
    {
      "text": "Ziang Xiao, Sarah Mennicken, Bernd Huber, Adam Shonkoff, and Jennifer Thom. 2021. Let Me Ask You This: How Can a Voice Assistant Elicit Explicit User Feedback?Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 388 (oct 2021), 24 pages. https://doi.org/10.1145/3479532",
      "doi": "10.1145/3479532"
    },
    {
      "text": "Samuel Yang, Jennifer Lee, Emre Sezgin, Jeffrey Bridge, Simon Lin, 2021. Clinical advice by voice assistants on postpartum depression: cross-sectional investigation using Apple Siri, Amazon Alexa, Google Assistant, and Microsoft Cortana. JMIR mHealth and uHealth 9, 1 (2021), e24045.",
      "doi": ""
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna Wallach. 2019. Understanding the Effect of Accuracy on Trust in Machine Learning Models. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300509",
      "doi": "10.1145/3290605.3300509"
    },
    {
      "text": "Saizheng Zhang, Emily Dinan, Jack Urbanek, Arthur Szlam, Douwe Kiela, and Jason Weston. 2018. Personalizing dialogue agents: I have a dog, do you have pets too?arXiv preprint arXiv:1801.07243(2018).",
      "doi": ""
    }
  ]
}