{
  "doi": "10.1145/3544548.3580936",
  "title": "Envisioning the (In)Visibility of Discreet and Wearable AAC Devices",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [
    "Best Paper"
  ],
  "abstract": "High-tech augmentative and alternative communication (AAC) devices can offer vital communication support for those with complex communication needs (CCNs). Unfortunately, these devices are rarely adopted. Abandonment has been linked to many factors – commonly, stigma resulting from the visibility of the device and its intrusion into other essential modes of communication like body language. However, visible AAC is strategically useful for setting conversational expectations. In this work, we explore how we might envision AAC to address these tensions directly. We conduct user-centred design activities to build three high-fidelity AAC prototypes with different communities with CCNs, specialists and stakeholders. The prototypes demonstrate different form factors, visibility and modes of input/output. Subsequently, we conduct two qualitative focus groups using convergent and divergent co-design methods with people with the language impairment aphasia – supporting ideation of seven discreet and wearable low-fidelity AAC prototypes and critique of the three high-fidelity prototypes.",
  "authors": [
    {
      "name": "Humphrey Curtis",
      "institution": "King's College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660615540",
      "orcid": "0000-0002-1540-9699"
    },
    {
      "name": "Zihao You",
      "institution": "Department of Informatics, King's College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783158",
      "orcid": "0000-0002-3450-0543"
    },
    {
      "name": "William Deary",
      "institution": "King's College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779966",
      "orcid": "0000-0001-5799-5406"
    },
    {
      "name": "Miruna-Ioana Tudoreanu",
      "institution": "King's College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780974",
      "orcid": "0000-0002-8129-5773"
    },
    {
      "name": "Timothy Neate",
      "institution": "Department of Informatics, King's College London, United Kingdom",
      "img": "/do/10.1145/contrib-99658696166/rel-imgonly/moi.jpg",
      "acmid": "99658696166",
      "orcid": "0000-0002-1387-8168"
    }
  ],
  "references": [
    {
      "text": "In North America, Pure Offices Plato Close, Tachbrook Park, and Leamington Spa. 2014. DynaVox T10/T15 User’s Guide. (2014).",
      "doi": ""
    },
    {
      "text": "Caroline Baker, Linda Worrall, Miranda Rose, Kyla Hudson, Brooke Ryan, and Leana O’Byrne. 2018. A systematic review of rehabilitation interventions to prevent and treat depression in post-stroke aphasia. Disability and rehabilitation 40, 16 (2018), 1870–1892.",
      "doi": ""
    },
    {
      "text": "Erin Beneteau. 2020. Who are you asking?: Qualitative methods for involving AAC users as primary research participants. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376883"
    },
    {
      "text": "Cynthia L Bennett, Erin Brady, and Stacy M Branham. 2018. Interdependence as a frame for assistive technology research and design. In Proceedings of the 20th international acm sigaccess conference on computers and accessibility. 161–173.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Marcelo L Berthier. 2005. Poststroke aphasia. Drugs & aging 22, 2 (2005), 163–182.",
      "doi": ""
    },
    {
      "text": "Filip Bircanin, Bernd Ploderer, Laurianne Sitbon, Andrew A Bayor, and Margot Brereton. 2019. Challenges and opportunities in using Augmentative and Alternative Communication (AAC) technologies: Design considerations for adults with severe disabilities. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction. 184–196.",
      "doi": "10.1145/3369457.3369473"
    },
    {
      "text": "Jordan L Boyd-Graber, Sonya S Nikolova, Karyn A Moffatt, Kenrick C Kin, Joshua Y Lee, Lester W Mackey, Marilyn M Tremaine, and Maria M Klawe. 2006. Participatory design with proxies: developing a desktop-PDA system to support people with aphasia. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 151–160.",
      "doi": "10.1145/1124772.1124797"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis.American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative research in sport, exercise and health 11, 4 (2019), 589–597.",
      "doi": ""
    },
    {
      "text": "Kyla Brown, Linda Worrall, Bronwyn Davidson, and Tami Howe. 2011. Exploring speech–language pathologists’ perspectives about living successfully with aphasia. International Journal of Language & Communication Disorders 46, 3(2011), 300–311.",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Benjamin R. Cowan, Abi Roper, Stephen Lindsay, and Owen Sheers. 2020. Speech Diversity and Speech Interfaces: Considering an Inclusive Future through Stammering(CUI ’20). Association for Computing Machinery, New York, NY, USA, Article 24, 3 pages. https://doi.org/10.1145/3405755.3406139",
      "doi": "10.1145/3405755.3406139"
    },
    {
      "text": "Chris Code, Gayle Hemsley, and Manfred Herrmann. 1999. The emotional impact of aphasia. In Seminars in speech and language, Vol. 20. © 1999 by Thieme Medical Publishers, Inc., 19–31.",
      "doi": ""
    },
    {
      "text": "Arthur Cropley. 2006. In praise of convergent thinking. Creativity research journal 18, 3 (2006), 391–404.",
      "doi": ""
    },
    {
      "text": "Humphrey Curtis, Timothy Neate, and Carlota Vazquez Gonzalez. 2022. State of the Art in AAC: A Systematic Review and Taxonomy. State of the Art in AAC: A Systematic Review and Taxonomy (2022), 23 pages.",
      "doi": ""
    },
    {
      "text": "Aimee Dietz, Sarah E Wallace, and Kristy Weissling. 2020. Revisiting the role of augmentative and alternative communication in aphasia rehabilitation. American journal of speech-language pathology 29, 2 (2020), 909–913.",
      "doi": ""
    },
    {
      "text": "Elizabeth Ellcessor. 2010. Bridging disability divides: A critical history of web content accessibility through 2001. Information, communication & society 13, 3 (2010), 289–308.",
      "doi": ""
    },
    {
      "text": "Annette Estes, Vanessa Rivera, Matthew Bryan, Philip Cali, and Geraldine Dawson. 2011. Discrepancies between academic achievement and intellectual ability in higher-functioning school-aged children with autism spectrum disorder. Journal of autism and developmental disorders 41, 8 (2011), 1044–1052.",
      "doi": ""
    },
    {
      "text": "Kelly Farquharson, Michelle Therrien, Andrea Barton-Hulsey, and Ann F Brandt. 2022. How to recruit, support, and retain speech-language pathologists in public schools. Journal of School Leadership 32, 3 (2022), 225–245.",
      "doi": ""
    },
    {
      "text": "Heather A Faucett, Kate E Ringland, Amanda LL Cullen, and Gillian R Hayes. 2017. (In) visibility in disability and assistive technology. ACM Transactions on Accessible Computing (TACCESS) 10, 4 (2017), 1–17.",
      "doi": "10.1145/3132040"
    },
    {
      "text": "Alexander Fiannaca, Ann Paradiso, Mira Shah, and Meredith Ringel Morris. 2017. AACrobat: Using mobile devices to lower communication barriers and provide autonomy with gaze-based AAC. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 683–695.",
      "doi": "10.1145/2998181.2998215"
    },
    {
      "text": "Amanda Fleury, Gloria Wu, and Tom Chau. 2019. A wearable fabric-based speech-generating device: system design and case demonstration. Disability and Rehabilitation: Assistive Technology 14, 5(2019), 434–444.",
      "doi": ""
    },
    {
      "text": "The Tavistock Trust for Aphasia. 2022. Tavistock Trust Homepage. (2022).",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger. 2015. Disability and technology: A critical realist perspective. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 89–96.",
      "doi": "10.1145/2700648.2809851"
    },
    {
      "text": "Rosemarie Garland-Thomson. 2017. Building a world with disability in it. Culture–theory–disability: encounters between disability studies and cultural studies (2017), 51–62.",
      "doi": ""
    },
    {
      "text": "Bhavya Ghai and Klaus Mueller. 2021. Fluent: An AI Augmented Writing Tool for People who Stutter. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. 1–8.",
      "doi": "10.1145/3441852.3471211"
    },
    {
      "text": "Carol Heins Gonzalesa, Gondy Leroya, and Gianluca De Leob. 2009. Augmentative and Alternative Communication Technologies. (2009), 1–17.",
      "doi": ""
    },
    {
      "text": "Joy P Guilford. 1967. Creativity: Yesterday, today and tomorrow. The Journal of Creative Behavior 1, 1 (1967), 3–14.",
      "doi": ""
    },
    {
      "text": "Florian Güldenpfennig. 2018. Tailor-made Accessible Computers: An Interactive Toolkit for Iterative Co-Design. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction. 231–236.",
      "doi": "10.1145/3173225.3173237"
    },
    {
      "text": "D Jeffery Higginbotham, Howard Shane, Susanne Russell, and Kevin Caves. 2007. Access to AAC: Present, past, and future. Augmentative and alternative communication 23, 3 (2007), 243–257.",
      "doi": ""
    },
    {
      "text": "Gareth Iacobucci. 2017. A service under pressure. BMJ 356(2017), 2 pages.",
      "doi": ""
    },
    {
      "text": "Seray Ibrahim, Asimina Vasalou, and Michael Clarke. 2017. Rethinking technology design for and with children who have severe speech & physical disabilities. Communication Matters 2017 National AAC Conference 32 (2017), 29–31.",
      "doi": ""
    },
    {
      "text": "Seray B Ibrahim, Asimina Vasalou, and Michael Clarke. 2018. Design opportunities for AAC and children with severe speech and physical impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173801"
    },
    {
      "text": "IDC. 2020. Worldwide wearables market forecast to maintain double-digit growth in 2020 and through 2024. https://www.idc.com/getdoc.jsp?containerId=prUS46885820",
      "doi": ""
    },
    {
      "text": "Dhruv Jain, Hung Ngo, Pratyush Patel, Steven Goodman, Leah Findlater, and Jon Froehlich. 2020. SoundWatch: Exploring smartwatch-based deep learning approaches to support sound awareness for deaf and hard of hearing users. In The 22nd international ACM SIGACCESS conference on computers and accessibility. 1–13.",
      "doi": "10.1145/3373625.3416991"
    },
    {
      "text": "Shaun K Kane, Barbara Linam-Church, Kyle Althoff, and Denise McCall. 2012. What we talk about: designing a context-aware communication tool for people with aphasia. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility. 49–56.",
      "doi": "10.1145/2384916.2384926"
    },
    {
      "text": "Saili S Kulkarni and Jessica Parmar. 2017. Culturally and linguistically diverse student and family perspectives of AAC. Augmentative and Alternative Communication 33, 3 (2017), 170–180.",
      "doi": ""
    },
    {
      "text": "Janice Light and David McNaughton. 2012. The changing face of augmentative and alternative communication: Past, present, and future challenges. Augmentative and Alternative Communication 28, 4 (2012), 197–204.",
      "doi": ""
    },
    {
      "text": "Janice Light, David McNaughton, David Beukelman, Susan Koch Fager, Melanie Fried-Oken, Thomas Jakobs, and Erik Jakobs. 2019. Challenges and opportunities in augmentative and alternative communication: Research and technology development to enhance communication and participation for individuals with complex communication needs. Augmentative and Alternative Communication 35, 1 (2019), 1–12.",
      "doi": ""
    },
    {
      "text": "Stephen Lindsay, Daniel Jackson, Guy Schofield, and Patrick Olivier. 2012. Engaging older people using participatory design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1199–1208.",
      "doi": "10.1145/2207676.2208570"
    },
    {
      "text": "Fannie Liu, Chunjong Park, Yu Jiang Tham, Tsung-Yu Tsai, Laura Dabbish, Geoff Kaufman, and Andrés Monroy-Hernández. 2021. Significant otter: Understanding the role of biosignals in communication. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445200"
    },
    {
      "text": "Liberator Ltd.2022. Liberator Homepage. (2022).",
      "doi": ""
    },
    {
      "text": "Lingraphica Ltd.2022. Lingraphica Homepage. (2022).",
      "doi": ""
    },
    {
      "text": "Stephen J Macdonald, Lesley Deacon, Jackie Nixon, Abisope Akintola, Anna Gillingham, Jacqueline Kent, Gillian Ellis, Debbie Mathews, Abolaji Ismail, Sylvia Sullivan, 2018. ‘The invisible enemy’: disability, loneliness and isolation. Disability & Society 33, 7 (2018), 1138–1159.",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Emma McDonnell, Venkatesh Potluri, Maggie Xu, Jailyn Zabala, Jeffrey Bigham, Jennifer Mankoff, and Cynthia Bennett. 2022. Anticipate and Adjust: Cultivating Access in Human-Centered Methods. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3491102.3501882"
    },
    {
      "text": "Azeem Majeed, Edward John Maile, and Andrew B Bindman. 2020. The primary care response to COVID-19 in England’s National Health Service. Journal of the Royal Society of Medicine 113, 6 (2020), 208–210.",
      "doi": ""
    },
    {
      "text": "David McNaughton, Diane Bryen, Sarah Blackstone, Michael Williams, and Pamela Kennedy. 2012. Young adults with complex communication needs: Research and development in AAC for a “diverse” population. Assistive Technology 24, 1 (2012), 45–53.",
      "doi": ""
    },
    {
      "text": "David McNaughton and Janice Light. 2013. The iPad and mobile technology revolution: Benefits and challenges for individuals who require augmentative and alternative communication., 107–116 pages.",
      "doi": ""
    },
    {
      "text": "Sally Millar, Janet Scott, 1998. What is augmentative and alternative communication? An introduction. Augmentative Communication in Practice 2(1998), 1–92.",
      "doi": ""
    },
    {
      "text": "Karyn Moffatt, Golnoosh Pourshahid, and Ronald M Baecker. 2017. Augmentative and alternative communication devices for aphasia: the emerging role of “smart” mobile devices. Universal Access in the Information Society 16, 1 (2017), 115–128.",
      "doi": "10.1007/s10209-015-0428-x"
    },
    {
      "text": "Alison Moorcroft, Nerina Scarinci, and Carly Meyer. 2020. ‘We were just kind of handed it and then it was smoke bombed by everyone’: How do external stakeholders contribute to parent rejection and the abandonment of AAC systems?International Journal of Language & Communication Disorders 55, 1(2020), 59–69.",
      "doi": ""
    },
    {
      "text": "Timothy Neate, Aikaterini Bourazeri, Abi Roper, Simone Stumpf, and Stephanie Wilson. 2019. Co-created personas: Engaging and empowering users with diverse needs within the design process. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300880"
    },
    {
      "text": "Timothy Neate, Abi Roper, Stephanie Wilson, Jane Marshall, and Madeline Cruice. 2020. CreaTable content and tangible interaction in Aphasia. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376490"
    },
    {
      "text": "Christopher S Norrie, Annalu Waller, and Elizabeth FS Hannah. 2021. Establishing Context: AAC Device Adoption and Support in a Special-Education Setting. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 2(2021), 1–30.",
      "doi": "10.1145/3446205"
    },
    {
      "text": "Mmachi God’sglory Obiorah, Anne Marie Marie Piper, and Michael Horn. 2021. Designing AACs for people with aphasia dining in restaurants. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3411764.3445280"
    },
    {
      "text": "Eliada Pampoulou. 2019. Speech and language therapists’ views about AAC system acceptance by people with acquired communication disorders. Disability and Rehabilitation: Assistive Technology 14, 5(2019), 471–478.",
      "doi": ""
    },
    {
      "text": "Phil Parette and Marcia Scherer. 2004. Assistive technology use and stigma. Education and Training in Developmental Disabilities 39, 3(2004), 217–226.",
      "doi": ""
    },
    {
      "text": "Susie Parr. 2007. Living with severe aphasia: Tracking social exclusion. Aphasiology 21, 1 (2007), 98–123.",
      "doi": ""
    },
    {
      "text": "Jennifer Pearson, Simon Robinson, and Matt Jones. 2015. It’s About Time: Smartwatches as public displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1257–1266.",
      "doi": "10.1145/2702123.2702247"
    },
    {
      "text": "Jennifer Pearson, Simon Robinson, Matt Jones, Anirudha Joshi, Shashank Ahire, Deepak Sahoo, and Sriram Subramanian. 2017. Chameleon devices: investigating more secure and discreet mobile interactions via active camouflaging. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5184–5196.",
      "doi": "10.1145/3025453.3025482"
    },
    {
      "text": "Helen Petrie. 1997. User-centred design and evaluation of adaptive and assistive technology for disabled and elderly users. it-Information Technology 39, 2 (1997), 7–12.",
      "doi": ""
    },
    {
      "text": "Kathryn E Ringland, Christine T Wolf, Heather Faucett, Lynn Dombrowski, and Gillian R Hayes. 2016. \" Will I always be not social?\" Re-Conceptualizing Sociality in the Context of a Minecraft Community for Autism. In Proceedings of the 2016 CHI conference on human factors in computing systems. 1256–1269.",
      "doi": "10.1145/2858036.2858038"
    },
    {
      "text": "Tobias Röddiger, Christopher Clarke, Paula Breitling, Tim Schneegans, Haibin Zhao, Hans Gellersen, and Michael Beigl. 2022. Sensing with Earables: A Systematic Literature Review and Taxonomy of Phenomena. PACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 6, 3(2022), 135.",
      "doi": "10.1145/3550314"
    },
    {
      "text": "Robert J Ruben. 2000. Redefining the survival of the fittest: communication disorders in the 21st century. The Laryngoscope 110, 2 (2000), 241–241.",
      "doi": ""
    },
    {
      "text": "Tom Shakespeare 2006. The social model of disability. The disability studies reader 2 (2006), 197–204.",
      "doi": ""
    },
    {
      "text": "Howard C Shane, Sarah Blackstone, Gregg Vanderheiden, Michael Williams, and Frank DeRuyter. 2012. Using AAC technology to access the world. Assistive technology 24, 1 (2012), 3–13.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI conference on human factors in computing systems. 705–714.",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2016. Self-conscious or self-confident? A diary study conceptualizing the social accessibility of assistive technology. ACM Transactions on Accessible Computing (TACCESS) 8, 2 (2016), 1–31.",
      "doi": "10.1145/2827857"
    },
    {
      "text": "Kiley Sobel, Alexander Fiannaca, Jon Campbell, Harish Kulkarni, Ann Paradiso, Ed Cutrell, and Meredith Ringel Morris. 2017. Exploring the design space of AAC awareness displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2890–2903.",
      "doi": "10.1145/3025453.3025610"
    },
    {
      "text": "Carla Tamburro, Timothy Neate, Abi Roper, and Stephanie Wilson. 2020. Accessible creativity with a comic spin. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. 1–11.",
      "doi": "10.1145/3373625.3417012"
    },
    {
      "text": "Stephanie Valencia, Mark Steidl, Michael Rivera, Cynthia Bennett, Jeffrey Bigham, and Henny Admoni. 2021. Aided Nonverbal Communication through Physical Expressive Objects. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility. 1–11.",
      "doi": "10.1145/3441852.3471228"
    },
    {
      "text": "Mieke van de Sandt-Koenderman. 2004. High-tech AAC and aphasia: Widening horizons?Aphasiology 18, 3 (2004), 245–263.",
      "doi": ""
    },
    {
      "text": "W Mieke E van de Sandt-Koenderman, Jiska Wiegers, Sandra M Wielaert, Hugo J Duivenvoorden, and Gerard M Ribbers. 2007. High-tech AAC and severe aphasia: Candidacy for TouchSpeak (TS). Aphasiology 21, 5 (2007), 459–474.",
      "doi": ""
    },
    {
      "text": "Ineke van der Meulen, W Mieke E van de Sandt-Koenderman, Hugo J Duivenvoorden, and Gerard M Ribbers. 2010. Measuring verbal and non-verbal communication in aphasia: reliability, validity, and sensitivity to change of the Scenario Test. International Journal of Language & Communication Disorders 45, 4(2010), 424–435.",
      "doi": ""
    },
    {
      "text": "Dimitri Vargemidis, Kathrin Gerling, Vero Vanden Abeele, Luc Geurts, and Katta Spiel. 2021. Irrelevant Gadgets or a Source of Worry: Exploring Wearable Activity Trackers with Older Adults. ACM Transactions on Accessible Computing (TACCESS) 14, 3 (2021), 1–28.",
      "doi": "10.1145/3473463"
    },
    {
      "text": "Jaipreet Virdi. 2020. Hearing happiness: deafness cures in history. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Annalu Waller. 2019. Telling tales: unlocking the potential of AAC technologies. International journal of language & communication disorders 54, 2(2019), 159–169.",
      "doi": ""
    },
    {
      "text": "Peter Washington, Catalin Voss, Nick Haber, Serena Tanaka, Jena Daniels, Carl Feinstein, Terry Winograd, and Dennis Wall. 2016. A wearable social interaction aid for children with autism. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 2348–2354.",
      "doi": "10.1145/2851581.2892282"
    },
    {
      "text": "Mark Weiser. 1993. Hot topics-ubiquitous computing. Computer 26, 10 (1993), 71–72.",
      "doi": "10.1109/2.237456"
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21st century. ACM SIGMOBILE mobile computing and communications review 3, 3(1999), 3–11.",
      "doi": ""
    },
    {
      "text": "Anne Werner and Kirsti Malterud. 2003. It is hard work behaving as a credible patient: encounters between women with chronic pain and their doctors. Social science & medicine 57, 8 (2003), 1409–1419.",
      "doi": ""
    },
    {
      "text": "Joshua M Wiener and Jane Tilly. 2002. Population ageing in the United States of America: implications for public programmes. International journal of epidemiology 31, 4 (2002), 776–781.",
      "doi": ""
    },
    {
      "text": "Kristin Williams, Karyn Moffatt, Jonggi Hong, Yasmeen Faroqi-Shah, and Leah Findlater. 2016. The cost of turning heads: A comparison of a head-worn display to a smartphone for supporting persons with aphasia in conversation. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. 111–120.",
      "doi": "10.1145/2982142.2982165"
    },
    {
      "text": "Stephanie Wilson, Abi Roper, Jane Marshall, Julia Galliers, Niamh Devane, Tracey Booth, and Celia Woolf. 2015. Codesign for people with aphasia through tangible design languages. CoDesign 11, 1 (2015), 21–34.",
      "doi": ""
    },
    {
      "text": "Xuhai Xu, Jun Gong, Carolina Brum, Lilian Liang, Bongsoo Suh, Shivam Kumar Gupta, Yash Agarwal, Laurence Lindsey, Runchang Kang, Behrooz Shahsavari, 2022. Enabling hand gesture customization on wrist-worn devices. In CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3491102.3501904"
    }
  ]
}