{
  "doi": "10.1145/3544548.3581016",
  "title": "DataLev: Mid-air Data Physicalisation Using Acoustic Levitation",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Data physicalisation is a technique that encodes data through the geometric and material properties of an artefact, allowing users to engage with data in a more immersive and multi-sensory way. However, current methods of data physicalisation are limited in terms of their reconfigurability and the types of materials that can be used. Acoustophoresis—a method of suspending and manipulating materials using sound waves—offers a promising solution to these challenges. In this paper, we present DataLev, a design space and platform for creating reconfigurable, multimodal data physicalisations with enriched materiality using acoustophoresis. We demonstrate the capabilities of DataLev through eight examples and evaluate its performance in terms of reconfigurability and materiality. Our work offers a new approach to data physicalisation, enabling designers to create more dynamic, engaging, and expressive artefacts.",
  "authors": [
    {
      "name": "Lei Gao",
      "institution": "Department of Computer Science, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660629886",
      "orcid": "0000-0001-5301-0876"
    },
    {
      "name": "Pourang Irani",
      "institution": "Department of Computer Science, University of British Columbia (Okanagan), Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "Department of Computer Science, University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    },
    {
      "name": "Gowdham Prabhakar",
      "institution": "Department of Computer Science, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659258079",
      "orcid": "0000-0002-1579-2843"
    },
    {
      "name": "Diego Martinez Plasencia",
      "institution": "Department of Computer Science, University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81548363756/rel-imgonly/diego-bw-e1492896584298-thegem-person.jpg",
      "acmid": "81548363756",
      "orcid": "0000-0002-5815-8236"
    },
    {
      "name": "Ryuji Hirayama",
      "institution": "Department of Computer Science, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659572226",
      "orcid": "0000-0001-7007-3756"
    }
  ],
  "references": [
    {
      "text": "Tobias Alrøe, Jonas Grann, Erik Grönvall, Marianne Graves Petersen, and Jesper L. Rasmussen. 2012. Aerial tunes: Exploring interaction qualities of mid-air displays. NordiCHI 2012: Making Sense Through Design - Proceedings of the 7th Nordic Conference on Human-Computer Interaction: 514–523. https://doi.org/10.1145/2399016.2399095",
      "doi": "10.1145/2399016.2399095"
    },
    {
      "text": "Marco A.B. Andrade, Thales S.A. Camargo, and Asier Marzo. 2018. Automatic contactless injection, transportation, merging, and ejection of droplets with a multifocal point acoustic levitator. Review of Scientific Instruments 89, 12. https://doi.org/10.1063/1.5063715",
      "doi": ""
    },
    {
      "text": "Marco A.B. Andrade, Tiago S. Ramos, Julio C. Adamowski, and Asier Marzo. 2020. Contactless pick-and-place of millimetric objects using inverted near-field acoustic levitation. Applied Physics Letters 116, 5. https://doi.org/10.1063/1.5138598",
      "doi": ""
    },
    {
      "text": "Kathleen D. Ang, Faramarz F. Samavati, Samin Sabokrohiyeh, Julio Garcia, and Mohammed S. Elbaz. 2019. Physicalizing cardiac blood flow data via 3D printing. Computers and Graphics (Pergamon) 85: 42–54. https://doi.org/10.1016/j.cag.2019.09.004",
      "doi": "10.1016/j.cag.2019.09.004"
    },
    {
      "text": "Myroslav Bachynskyi, Viktorija Paneva, and Jörg Müller. 2018. LeviCursor: Dexterous Interaction with a Levitating Object. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces (ISS ’18): 253–262. https://doi.org/10.1145/3279778.3279802",
      "doi": "10.1145/3279778.3279802"
    },
    {
      "text": "S. Sandra Bae, Clement Zheng, Mary Etta West, Ellen Yi-Luen Do, Samuel Huron, and Danielle Albers Szafir. 2022. Making Data Tangible: A Cross-disciplinary Design Space for Data Physicalization. Association for Computing Machinery. https://doi.org/10.1145/3491102.3501939",
      "doi": "10.1145/3491102.3501939"
    },
    {
      "text": "Patrick Baudisch, Nathaniel Good, and Paul Stewart. 2001. Focus plus context screens: Combining display technology with visualization techniques. In Proceedings of the 14th annual ACM symposium on User interface software and technology: 31–40.",
      "doi": "10.1145/502348.502354"
    },
    {
      "text": "Sean Braley, Calvin Rubens, Timothy Merritt, and Roel Vertegaal. 2018. Griddrones: A self-levitating physical voxel lattice for interactive 3D surface deformations. UIST 2018 - Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology: 87–98. https://doi.org/10.1145/3242587.3242658",
      "doi": "10.1145/3242587.3242658"
    },
    {
      "text": "E H Brandt. 1989. levitation in Physics. Science 243, 4889: 349–355.",
      "doi": ""
    },
    {
      "text": "Nathalie Bressa, Henrik Korsgaard, Aurelien Tabard, Steven Houben, and Jo Vermeulen. 2021. What's the Situation with Situated Visualization? A Survey and Perspectives on Situatedness. IEEE Transactions on Visualization and Computer Graphics 28, 1: 107–117. https://doi.org/10.1109/TVCG.2021.3114835",
      "doi": "10.1109/TVCG.2021.3114835"
    },
    {
      "text": "Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: Multi-point mid-air haptic feedback for touch surfaces. UIST 2013 - Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology: 505–514. https://doi.org/10.1145/2501988.2502018",
      "doi": "10.1145/2501988.2502018"
    },
    {
      "text": "Jingkai Chen, Jiaoyang Li, Chuchu Fan, and Brian Williams. 2020. Scalable and Safe Multi-Agent Motion Planning with Nonlinear Dynamics and Bounded Disturbances. In Proceedings of the AAAI Conference on Artificial Intelligence. Retrieved from http://arxiv.org/abs/2012.09052",
      "doi": ""
    },
    {
      "text": "L. Cox, A. Croxford, B. W. Drinkwater, and A. Marzo. 2018. Acoustic Lock: Position and orientation trapping of non-spherical sub-wavelength particles in mid-air using a single-axis acoustic levitator. Applied Physics Letters 113, 5. https://doi.org/10.1063/1.5042518",
      "doi": ""
    },
    {
      "text": "Tim Dwyer, Kim Marriott, Tobias Isenberg, Karsten Klein, Nathalie Riche, Falk Schreiber, Wolfgang Stuerzlinger, and Bruce H. Thomas. 2018. Immersive analytics. Immersive Analytics. Springer International Publishing 11190 LNCS: 1–23. https://doi.org/10.1007/978-3-030-01388-2_1",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Benjamin Bach, Maxime Cordeil, and Ulrich Engelke. 2021. Grand challenges in immersive analytics. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3411764.3446866",
      "doi": "10.1145/3411764.3446866"
    },
    {
      "text": "Iñigo Ezcurdia;, Rafael Morales, Marco A. B. Andrade, and Asier Marzo. 2022. LeviPrint: Contactless Fabrication using Full Acoustic Trapping of Elongated Parts . ACM Transactions on Graphics 1, 1. https://doi.org/10.1145/3528233.3530752",
      "doi": "10.1145/3528233.3530752"
    },
    {
      "text": "Andreas Rene Fender, Diego Martinez Plasencia, and Sriram Subramanian. 2021. ArticuLev: An Integrated Self-Assembly Pipeline for Articulated Multi-Bead Levitation Primitives. In Proceedings of 2021CHI Conference on Human Factors in Computing Systems ACM. https://doi.org/10.1145/3411764.3445342",
      "doi": "10.1145/3411764.3445342"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. InFORM: Dynamic Physical Affordances and Constraints through shape and object actuation. UIST 2013 - Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology: 417–426. https://doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Daniele Foresti, Katharina T. Kroll, Robert Amissah, Francesco Sillani, Kimberly A. Homan, Dimos Poulikakos, and Jennifer A. Lewis. 2018. Acoustophoretic printing. Science Advances 4, 8: 1–10. https://doi.org/10.1126/sciadv.aat1659",
      "doi": ""
    },
    {
      "text": "Daniele Foresti, Majid Nabavi, Mirko Klingauf, Aldo Ferrari, and Dimos Poulikakos. 2013. Acoustophoretic contactless transport and handling of matter in air. Proceedings of the National Academy of Sciences of the United States of America 110, 31: 12549–12554. https://doi.org/10.1073/pnas.1301860110",
      "doi": ""
    },
    {
      "text": "Euan Freeman, Asier Marzo, Praxitelis B. Kourtelos, Julie R. Williamson, and Stephen Brewster. 2019. Enhancing physical objects with actuated levitating particles. Proceedings - Pervasive Displays 2019 - 8th ACM International Symposium on Pervasive Displays, PerDis 2019. https://doi.org/10.1145/3321335.3324939",
      "doi": "10.1145/3321335.3324939"
    },
    {
      "text": "Mathieu Le Goc, Lawrence Kim, Ali Parsaei, Jean-daniel Fekete, Sean Follmer, Mathieu Le Goc, Lawrence Kim, Ali Parsaei, Jean-daniel Fekete, Pierre Dragicevic, Mathieu Le Goc, Lawrence H Kim, Ali Parsaei, Jean-daniel Fekete, and Pierre Dragicevic. 2016. Zooids: Building Blocks for Swarm User Interfaces. UIST 2016 - Proceedings of the 29th Annual Symposium on User Interface Software and Technology.",
      "doi": ""
    },
    {
      "text": "Mathieu Le Goc, Charles Perin, Sean Follmer, Jean Daniel Fekete, and Pierre Dragicevic. 2019. Dynamic Composite Data Physicalization Using Wheeled Micro-Robots. IEEE Transactions on Visualization and Computer Graphics 25, 1: 737–747. https://doi.org/10.1109/TVCG.2018.2865159",
      "doi": "10.1109/TVCG.2018.2865159"
    },
    {
      "text": "Mohsen Habibi, Shervin Foroughi, Vahid Karamzadeh, and Muthukumaran Packirisamy. 2022. Direct sound printing. Nature Communications 13, 1: 1–11. https://doi.org/10.1038/s41467-022-29395-1",
      "doi": ""
    },
    {
      "text": "John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. Shapeclip: Towards rapid prototyping with shape- Changing displays for designers. In Proceedings of 2015CHI Conference on Human Factors in Computing Systems 2015-April: 19–28. https://doi.org/10.1145/2702123.2702599",
      "doi": "10.1145/2702123.2702599"
    },
    {
      "text": "Keisuke Hasegawa, Liwei Qiu, Akihito Noda, Seki Inoue, and Hiroyuki Shinoda. 2017. Electronically steerable ultrasound-driven long narrow air stream. Applied Physics Letters 111, 6. https://doi.org/10.1063/1.4985159",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and George G. Robertson. 2007. Animated transitions in statistical data graphics. IEEE Transactions on Visualization and Computer Graphics 13, 6: 1240–1247. https://doi.org/10.1109/TVCG.2007.70539",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Michael Bostock; Vadim Ogievetsky; Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12: 2301–2309.",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Felix Heibeck, Basheer Tome, Clark Della Silva, and Hiroshi Ishii. 2015. Unimorph -fabricating thin-film composites for shape-changing interfaces. UIST 2015 - Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology: 233–242. https://doi.org/10.1145/2807442.2807472",
      "doi": "10.1145/2807442.2807472"
    },
    {
      "text": "Bridger Herman, Maxwell Omdal, Stephanie Zeller, Clara A. Richter, Francesca Samsel, Greg Abram, and Daniel F. Keefe. 2021. Multi-Touch Querying on Data Physicalizations in Immersive AR. Proceedings of the ACM on Human-Computer Interaction 5, ISS. https://doi.org/10.1145/3488542",
      "doi": "10.1145/3488542"
    },
    {
      "text": "Hessam Djavaherpour, Mahdavi-Amiri Ali, and Faramarz F. Samavati. 2017. Physical Visualization of Geospatial Datasets. IEEE Computer Graphics and Applications: 61–69.",
      "doi": ""
    },
    {
      "text": "Ryuji Hirayama, Giorgos Christopoulos, Diego Martinez Plasencia, and Sriram Subramanian. 2022. High-speed acoustic holography with arbitrary scattering objects. Science Advances 8, 24: 1–13. Retrieved from https://www.science.org/doi/10.1126/sciadv.abn7614",
      "doi": ""
    },
    {
      "text": "Ryuji Hirayama, Diego Martinez Plasencia, Nobuyuki Masuda, and Sriram Subramanian. 2019. A volumetric display for visual, tactile and audio presentation using acoustic trapping. Nature 575, 7782: 320–323. https://doi.org/10.1038/s41586-019-1739-5",
      "doi": ""
    },
    {
      "text": "Ryuji Hirayama and Sriram Subramanian. 2022. Magical Multi-modal Displays using Acoustophoresis. XRDS 29, 1: 54–58.",
      "doi": "10.1145/3558195"
    },
    {
      "text": "Seki Inoue, Shinichi Mogami, Tomohiro Ichiyama, Akihito Noda, Yasutoshi Makino, and Hiroyuki Shinoda. 2019. Acoustical boundary hologram for macroscopic rigid-body levitation. The Journal of the Acoustical Society of America 145, 1: 328–337. https://doi.org/10.1121/1.5087130",
      "doi": ""
    },
    {
      "text": "Eimontas Jankauskis, Sonia Elizondo, Roberto Antonio Montano Murillo, Asier Marzo, and Diego Martinez Plasencia. 2022. TipTrap: A Co-located Direct Manipulation Technique for Acoustically Levitated Content. UIST 2022 - Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology.",
      "doi": ""
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Jean-daniel Fekete, and Jean-daniel Fekete Evaluating. 2013. Evaluating the Efficiency of Physical Visualizations. In Proceedings of 2013CHI Conference on Human Factors in Computing Systems ACM.",
      "doi": "10.1145/2470654.2481359"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and challenges for data physicalization. In Proceedings of 2015 CHI Conference on Human Factors in Computing Systems ACM: 3227–3236. https://doi.org/10.1145/2702123.2702180",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Ben Kazemi, Roberto Montano-Murillo, and Diego Martinez Plasencia. 2022. Two-Gimbal PAT: An artistic installation combining mechanical and acoustic rotation of levitated content. In CHI Conference on Human Factors in Computing Systems Extended Abstracts. https://doi.org/10.1145/3491101.3519891",
      "doi": "10.1145/3491101.3519891"
    },
    {
      "text": "John Lasseter. 1987. Principles of traditional animation applied to 3D computer animation. In Proceedings of the 14th annual conference on Computer graphics and interactive techniques (SIGGRAPH ’87). 21, 4: 35–44.",
      "doi": "10.1145/37401.37407"
    },
    {
      "text": "Bongshin Lee, Nathalie Henry Riche, Petra Isenberg, and Sheelagh Carpendale. 2015. More Than Telling a Story: Transforming Data into Visually Shared Stories. IEEE Computer Graphics and Applications 35, 5: 84–90. https://doi.org/10.1109/MCG.2015.99",
      "doi": "10.1109/MCG.2015.99"
    },
    {
      "text": "Jinha Lee, Rehmi Post, and Hiroshi Ishii. 2011. ZeroN: Mid-air tangible interaction enabled by computer controlled magnetic levitation. UIST’11 - Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology: 327–336. https://doi.org/10.1145/2047196.2047239",
      "doi": "10.1145/2047196.2047239"
    },
    {
      "text": "Patricia Cornelio Martinez, Silvana De Pirro, Chi Thanh Vi, and Sriram Subramanian. 2017. Agency in Mid-air Interfaces. 2426–2439.",
      "doi": ""
    },
    {
      "text": "Asier Marzo. 2016. GauntLev: A wearable to manipulate free-floating objects. Conference on Human Factors in Computing Systems - Proceedings: 3277–3281. https://doi.org/10.1145/2858036.2858370",
      "doi": "10.1145/2858036.2858370"
    },
    {
      "text": "Asier Marzo and Bruce W. Drinkwater. 2019. Holographic acoustic tweezers. Proceedings of the National Academy of Sciences of the United States of America 116, 1: 84–89. https://doi.org/10.1073/pnas.1813047115",
      "doi": ""
    },
    {
      "text": "Asier Marzo, Sue Ann Seah, Bruce W. Drinkwater, Deepak Ranjan Sahoo, Benjamin Long, and Sriram Subramanian. 2015. Holographic acoustic elements for manipulation of levitated objects. Nature Communications 6: 1–7. https://doi.org/10.1038/ncomms9661",
      "doi": ""
    },
    {
      "text": "Roberto Montano-Murillo, Ryuji Hirayama, and Diego Martinez Plasencia. 2022. OpenMPD: A low-level presentation engine for Multimodal Particle-based Displays ( MPDs ). ACM Transactions on Graphics 1, 1: 1-12(To Appear).",
      "doi": ""
    },
    {
      "text": "Hila Mor, Tianyu Yu, Ken Nakagaki, Benjamin Harvey Miller, Yichen Jia, and Hiroshi Ishii. 2020. Venous Materials: Towards Interactive Fluidic Mechanisms. In Proceedings of 2020CHI Conference on Human Factors in Computing Systems: 1–14. https://doi.org/10.1145/3313831.3376129",
      "doi": "10.1145/3313831.3376129"
    },
    {
      "text": "Rafael Morales, Asier Marzo, Sriram Subramanian, and Diego Martínez. 2019. LeviProps: Animating levitated optimized fabric structures using holographic acoustic tweezers. Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology: 651–661. https://doi.org/10.1145/3332165.3347882",
      "doi": "10.1145/3332165.3347882"
    },
    {
      "text": "Mohd Adili Norasikin, Diego Martinez Plasencia, Gianluca Memoli, and Sriram Subramanian. 2019. SonicSpray: A technique to reconfigure permeable mid-air displays. ISS 2019 - Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces: 113–122. https://doi.org/10.1145/3343055.3359704",
      "doi": "10.1145/3343055.3359704"
    },
    {
      "text": "Yoichi Ochiai, Takayuki Hoshi, and Ippei Suzuki. 2017. Holographic whisper: Rendering audible sound spots in three-dimensional space by focusing ultrasonic waves. Conference on Human Factors in Computing Systems - Proceedings 2017-May: 4314–4325. https://doi.org/10.1145/3025453.3025989",
      "doi": "10.1145/3025453.3025989"
    },
    {
      "text": "Yoichi Ochiai, Takayuki Hoshit, and Jun Rekimoto. 2014. Pixie dust: Graphics generated by levitated and animated objects in computational acoustic-potential field. ACM Transactions on Graphics 33, 4. https://doi.org/10.1145/2601097.2601118",
      "doi": "10.1145/2601097.2601118"
    },
    {
      "text": "Themis Omirou, Asier Marzo Perez, Sriram Subramanian, and Anne Roudaut. 2016. Floating charts: Data plotting using free-floating acoustically levitated representations. 2016 IEEE Symposium on 3D User Interfaces, 3DUI 2016 - Proceedings: 187–190. https://doi.org/10.1109/3DUI.2016.7460051",
      "doi": ""
    },
    {
      "text": "Viktorija Paneva, Myroslav Bachynskyi, and Jörg Müller. 2020. Levitation Simulator: Prototyping Ultrasonic Levitation Interfaces in Virtual Reality. In Proceedings of 2020CHI Conference on Human Factors in Computing Systems: 1–12.",
      "doi": "10.1145/3313831.3376409"
    },
    {
      "text": "Randy Pausch, John C Goblel, and Neal F Kassell. 1994. Passive Real-World Neurosurgical Visualization. Conference on Human Factors in Computing Systems - Proceedings: 452–458.",
      "doi": ""
    },
    {
      "text": "Diego Martinez Plasencia, Ryuji Hirayama, Roberto Montano-Murillo, and Sriram Subramanian. 2020. GS-PAT: High-Speed Multi-Point Sound-Fields for Phased Arrays of Transducers. ACM Transactions on Graphics 39, 4. https://doi.org/10.1145/3386569.3392492",
      "doi": "10.1145/3386569.3392492"
    },
    {
      "text": "He Ren and Eva Hornecker. 2021. Comparing Understanding and Memorization in Physicalization and VR Visualization. TEI 2021 - Proceedings of the 15th International Conference on Tangible, Embedded, and Embodied Interaction. https://doi.org/10.1145/3430524.3442446",
      "doi": "10.1145/3430524.3442446"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward high “shape resolution” in self-actuated flexible mobile devices. In Proceedings of 2013CHI Conference on Human Factors in Computing Systems ACM: 593–602. https://doi.org/10.1145/2470654.2470738",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1: 341–350. https://doi.org/10.1109/TVCG.2016.2599030",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Pitchaya E Sitthi-Amorn Javier Ramos Yuwang Wang Joyce Kwan Justin Lan Wenshou Wang Wojciech Matusik. 2015. MultiFab: A Machine Vision Assisted Platform for Multi-Material 3D Printing. ACM Trans. Graph. Article 34, August: 11. Retrieved from http://doi.acm.org/",
      "doi": ""
    },
    {
      "text": "D. E. Smalley, E. Nygaard, K. Squire, J. Van Wagoner, J. Rasmussen, S. Gneiting, K. Qaderi, J. Goodsell, W. Rogers, M. Lindsey, K. Costner, A. Monk, M. Pearson, B. Haymore, and J. Peatross. 2018. A photophoretic-Trap volumetric display. Nature 553, 7689: 486–490. https://doi.org/10.1038/nature25176",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Clement Zheng, Yasuaki Kakehi, Tom Yeh, Ellen Yi Luen Do, Mark D. Gross, and Daniel Leithinger. 2019. ShapeBots: Shape-changing Swarm Robots. In Proceedings of the 32nd annual ACM symposium on user interface software and technology: 493–505.",
      "doi": "10.1145/3332165.3347911"
    },
    {
      "text": "Saiganesh Swaminathan, Conglei Shi, Yvonne Jansen, Pierre Dragicevic, Lora Oehlberg, and Jean Daniel Fekete. 2014. Supporting the design and fabrication of physical visualizations. Conference on Human Factors in Computing Systems - Proceedings: 3845–3854. https://doi.org/10.1145/2556288.2557310",
      "doi": "10.1145/2556288.2557310"
    },
    {
      "text": "Faisal Taher, John Hardy, Abhijit Karnik, Christian Weichel, Yvonne Jansen, Kasper Hornbæk, and Jason Alexander. 2015. Exploring interactions with physically dynamic bar charts. In Proceedings of 2015 CHI Conference on Human Factors in Computing Systems ACM: 3237–3246. https://doi.org/10.1145/2702123.2702604",
      "doi": "10.1145/2702123.2702604"
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, Samuel Huron, and Sheelagh Carpendale. 2018. Self-reflection and personal physicalization construction. In Proceedings of 2018 CHI Conference on Human Factors in Computing Systems ACM 2018-April: 1–13. https://doi.org/10.1145/3173574.3173728",
      "doi": "10.1145/3173574.3173728"
    },
    {
      "text": "Yuki Uno, Hao Qiu, Toru Sai, Shunta Iguchi, Yota Mizutani, Takayuki Hoshi, Yoshihiro Kawahara, Yasuaki Kakehi, and Makoto Takamiya. 2018. Luciola:A Millimeter-Scale Light-Emitting Particle Moving in Mid-Air Based On Acoustic Levitation and Wireless Powering. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 4: 1–17. https://doi.org/10.1145/3161182",
      "doi": "10.1145/3161182"
    },
    {
      "text": "Annemiek Veldhuis, Rong Hao Liang, and Tilde Bekker. 2020. CoDa: Collaborative data interpretation through an interactive tangible scatterplot. TEI 2020 - Proceedings of the 14th International Conference on Tangible, Embedded, and Embodied Interaction: 323–336. https://doi.org/10.1145/3374920.3374934",
      "doi": "10.1145/3374920.3374934"
    },
    {
      "text": "Chi Thanh Vi, Asier Marzo, Damien Ablart, Gianluca Memoli, Sriram Subramanian, Bruce Drinkwater, and Marianna Obrist. 2017. TastyFloats:A Contactless Food Delivery System. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces: 161–170. Retrieved from https://doi.org/10.1145/3132272.3134123%0D",
      "doi": "10.1145/3132272.3134123"
    },
    {
      "text": "Chi Thanh Vi, Asier Marzo, Gianluca Memoli, Emanuela Maggioni, Damien Ablart, Martin Yeomans, and Marianna Obrist. 2020. LeviSense: A platform for the multisensory integration in levitating food and insights into its effect on flavour perception. International Journal of Human Computer Studies 139, March: 102428. https://doi.org/10.1016/j.ijhcs.2020.102428",
      "doi": ""
    },
    {
      "text": "Wesley Willett, Yvonne Jansen, and Pierre Dragicevic. 2017. Embedded Data Representations. IEEE Transactions on Visualization and Computer Graphics 23, 1: 461–470. https://doi.org/10.1109/TVCG.2016.2598608",
      "doi": "10.1109/TVCG.2016.2598608"
    },
    {
      "text": "W. J. Xie, C. D. Cao, Y. J. Lü, Z. Y. Hong, and B. Wei. 2006. Acoustic method for levitation of small living animals. Applied Physics Letters 89, 21: 1–4. https://doi.org/10.1063/1.2396893",
      "doi": ""
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically actuated soft composite materials for shape changing interfaces. UIST 2013 - Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology: 13–22. https://doi.org/10.1145/2501988.2502037",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. bioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. In Proceedings of 2015 CHI Conference on Human Factors in Computing Systems ACM: 1–10. https://doi.org/10.1016/B978-0-12-811155-0.00004-1",
      "doi": ""
    },
    {
      "text": "Toshiya Yui and Tomoko Hashida. 2016. Floatio:Floating Tangible User Interface Based on Animacy Perception. Proceedings of the 29th Annual Symposium on User Interface Software and Technology: 43–45. https://doi.org/10.1145/2984751.2985699",
      "doi": "10.1145/2984751.2985699"
    },
    {
      "text": "Data Storytelling with LEGOs. Retrieved May 25, 2021 from http://dataphys.org/list/data-storytelling-with-lego/",
      "doi": ""
    },
    {
      "text": "Steven Pinker explains Global Life Expectancy with Physical Line Charts. Retrieved May 28, 2021 from http://dataphys.org/list/steven-pinker-explains-global-life-expectancy-with-physical-line-charts/",
      "doi": ""
    },
    {
      "text": "ASKA3D. Retrieved July 4, 2022 from https://aska3d.com/en/",
      "doi": ""
    },
    {
      "text": "Drone 100: A World Record with 100 Points – Ars Electronica Blog. Retrieved September 16, 2022 from https://ars.electronica.art/aeblog/en/2016/01/12/drone100/",
      "doi": ""
    },
    {
      "text": "Park Row London & Monarch Theatre – Wonderland Restaurants. Retrieved July 5, 2022 from https://parkrowlondon.co.uk/",
      "doi": ""
    },
    {
      "text": "The National Library of Medicine's Visible Human Project. Retrieved July 4, 2022 from https://www.nlm.nih.gov/research/visible/visible_human.html",
      "doi": ""
    }
  ]
}