{
  "doi": "10.1145/3544548.3580958",
  "title": "Design, Mould, Grow!: A Fabrication Pipeline for Growing 3D Designs Using Myco-Materials",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "There is a growing interest in sustainable fabrication approaches, including the exploration of material conservation and utilisation of waste materials. Particularly, recent work has applied organic myco-materials, made from fungi, to develop tangible, interactive devices. However, a systematic approach for 3D fabrication using myco-materials is under-explored. In this paper, we present a parametric design tool and a fabrication pipeline to grow 3D designs using the mycelia of edible fungi species, such as Reishi or Oyster mushrooms. The proposed tool is designed based on empirical results from a series of technical evaluations of the geometric and material qualities of 3D-grown myco-objects. Furthermore, the paper introduces an easy-to-replicate fabrication process that can recycle different organic waste material combinations such as sawdust and coffee grounds to grow mycelia. Through a series of demonstration applications, we identify the challenges and opportunities for working with myco-materials in the HCI context.",
  "authors": [
    {
      "name": "Phillip Gough",
      "institution": "Design Lab, School of Architecture Design and Planning, The University of Sydney, Australia and The University of Sydney Nano Institute (Sydney Nano), The University of Sydney, Australia",
      "img": "/do/10.1145/contrib-87958859657/rel-imgonly/resource.jpeg",
      "acmid": "87958859657",
      "orcid": "0000-0003-3687-6365"
    },
    {
      "name": "Praneeth Bimsara Perera",
      "institution": "School of Computer Science, University of Sydney, Australia and Department of Electronic and Telecommunication Engineering, University of Moratuwa, Sri Lanka",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778982",
      "orcid": "0000-0001-9390-8381"
    },
    {
      "name": "Michael A. Kertesz",
      "institution": "School of Life and Environmental Sciences, The University of Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779484",
      "orcid": "0000-0003-2112-4451"
    },
    {
      "name": "Anusha Withana",
      "institution": "School of Computer Science, The University of Sydney, Australia and The University of Sydney Nano Institute (Sydney Nano), The University of Sydney, Australia",
      "img": "/do/10.1145/contrib-81456616335/rel-imgonly/28416_398719482664_7387313_n.jpg",
      "acmid": "81456616335",
      "orcid": "0000-0001-6587-1278"
    }
  ],
  "references": [
    {
      "text": "Isabelle Anderson. 2017. Mechanical Properties of Specimens 3D Printed with Virgin and Recycled Polylactic Acid. 3D Printing and Additive Manufacturing 4, 2 (2017), 110–115.",
      "doi": ""
    },
    {
      "text": "Freek V.W. Appels, Serena Camere, Maurizio Montalti, Elvin Karana, Kaspar M.B. Jansen, Jan Dijksterhuis, Pauline Krijgsheld, and Han A.B. Wösten. 2019. Fabrication Factors Influencing Mechanical, Moisture- and Water-Related Properties of Mycelium-Based Composites. Materials and Design 161, November (2019), 64–71. https://doi.org/10.1016/j.matdes.2018.11.027",
      "doi": ""
    },
    {
      "text": "Oliver Bates, Kathy New, Samantha Mitchell-Finnigan, Matthew Louis Mauriello, Christian Remy, Roy Bendor, Samuel Mann, Simran Chopra, Adrian K. Clear, and Chris Preist. 2019. Towards a Responsible Innovation Agenda for HCI. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299017",
      "doi": "10.1145/3290607.3299017"
    },
    {
      "text": "Oliver Bates, Vanessa Thomas, and Christian Remy. 2017. Doing Good in HCI. Interactions 24, 5 (Aug. 2017), 80–82. https://doi.org/10.1145/3121386",
      "doi": "10.1145/3121386"
    },
    {
      "text": "Fiona Bell and Mirela Alistar. 2022. Designing with Alganyl: A Hands-on Exploration of Biodegradable Plastics. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, New York, NY, USA, 1–5. https://doi.org/10.1145/3490149.3503669",
      "doi": "10.1145/3490149.3503669"
    },
    {
      "text": "Abhinav Bhardwaj, Joseph Vasselli, Matt Lucht, Zhijian Pei, Brian Shaw, Zachary Grasley, Xingjian Wei, and Na Zou. 2020. 3D Printing of Biomass-Fungi Composite Material: A Preliminary Study. Manufacturing Letters 24(2020), 96–99. https://doi.org/10.1016/j.mfglet.2020.04.005",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable Interaction Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 503–512. https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Eli Blevis, Chris Preist, Daniel Schien, and Priscilla Ho. 2017. Further Connecting Sustainable Interaction Design with Sustainable Digital Infrastructure Design. In Proceedings of the 2017 Workshop on Computing Within Limits. ACM, New York, NY, USA, 71–83. https://doi.org/10.1145/3080556.3080568",
      "doi": "10.1145/3080556.3080568"
    },
    {
      "text": "Kustrim Cerimi, Kerem Can Akkaya, Carsten Pohl, Bertram Schmidt, and Peter Neubauer. 2019. Fungi as Source for New Bio-Based Materials: A Patent Review. Fungal Biology and Biotechnology 6, 1 (Dec. 2019), 17. https://doi.org/10.1186/s40694-019-0080-y",
      "doi": ""
    },
    {
      "text": "Kyung Yun Choi and Hiroshi Ishii. 2021. Therms-up!: DIY Inflatables and Interactive Materials by Upcycling Wasted Thermoplastic Bags. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’21). Association for Computing Machinery, New York, NY, USA, Article 51. https://doi.org/10.1145/3430524.3442457",
      "doi": "10.1145/3430524.3442457"
    },
    {
      "text": "Marina F Cosate de Andrade, Patricia Souza, Otávio Cavalett, and Ana R Morales. 2016. Life Cycle Assessment of Poly (Lactic Acid)(PLA): Comparison between Chemical Recycling, Mechanical Recycling and Composting. Journal of Polymers and the Environment 24, 4 (2016), 372–384.",
      "doi": ""
    },
    {
      "text": "Vânia Paula de Almeida Neris, Kamila Rios da Hora Rodrigues, and Renata Firmino Lima. 2014. A Systematic Review of Sustainability and Aspects of Human-Computer Interaction. In Lecture Notes in Computer Science (Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Vol. 8512 LNCS. 742–753. https://doi.org/10.1007/978-3-319-07227-2_71",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the Landscape of Sustainable HCI. In Proceedings of the 28th International Conference on Human Factors in Computing Systems - CHI ’10, Vol. 30332. ACM Press, New York, New York, USA, 1975. https://doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Elise Elsacker, Simon Vandelook, Joost Brancart, Eveline Peeters, and Lars De Laet. 2019. Mechanical, Physical and Chemical Characterisation of Mycelium-Based Composites with Different Types of Lignocellulosic Substrates. PLOS ONE 14, 7 (July 2019), e0213954. https://doi.org/10.1371/journal.pone.0213954",
      "doi": ""
    },
    {
      "text": "Elise Elsacker, Simon Vandelook, Aurélie Van Wylick, Joske Ruytinx, Lars De Laet, and Eveline Peeters. 2020. A Comprehensive Framework for the Production of Mycelium-Based Lignocellulosic Composites. Science of The Total Environment 725 (July 2020), 138431. https://doi.org/10.1016/j.scitotenv.2020.138431",
      "doi": ""
    },
    {
      "text": "Jeremy Faludi, Natasha Cline-Thomas, and Shardul Agrawala. 2017. 3D printing and its environmental implications. The Next Production Revolution Implications for Governments and Business, Organization for Economic Cooperation and Development (OECD) (2017).",
      "doi": ""
    },
    {
      "text": "Joel Fredericks, Callum Parker, Glenda Amayo Caldwell, Marcus Foth, Hilary Davis, and Martin Tomitsch. 2019. Designing Smart for Sustainable Communities. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction. ACM, New York, NY, USA, 12–15. https://doi.org/10.1145/3369457.3369550",
      "doi": "10.1145/3369457.3369550"
    },
    {
      "text": "Snehalkumar Neil S. Gaikwad. 2020. Beyond Boundaries. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, USA, 257–262. https://doi.org/10.1145/3406865.3418336",
      "doi": "10.1145/3406865.3418336"
    },
    {
      "text": "Martin Geissdoerfer, Paulo Savaget, Nancy M.P. Bocken, and Erik Jan Hultink. 2017. The Circular Economy – A New Sustainability Paradigm?Journal of Cleaner Production 143 (Feb. 2017), 757–768. https://doi.org/10.1016/j.jclepro.2016.12.048",
      "doi": ""
    },
    {
      "text": "Çağlar Genç, Emilia Launne, and Jonna Häkkilä. 2022. Interactive Mycelium Composites: Material Exploration on Combining Mushroom with Off-the-shelf Electronic Components. In Nordic Human-Computer Interaction Conference(NordiCHI ’22). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3546155.3546689",
      "doi": "10.1145/3546155.3546689"
    },
    {
      "text": "Phillip Gough, Jack Forman, Pat Pataranutaporn, Leigh-Anne Hepburn, Carolina Ramirez-Figueroa, Clare Cooper, Angela Vujic, David Sun Kong, Raphael Kim, Pattie Maes, Hiroshi Ishii, Misha Sra, and Naseem Ahmadpour. 2021. Speculating on Biodesign in the Future Home. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–5. https://doi.org/10.1145/3411763.3441353",
      "doi": "10.1145/3411763.3441353"
    },
    {
      "text": "Phillip Gough, Larissa Pschetz, Naseem Ahmadpour, Leigh-Anne Hepburn, Clare Cooper, Carolina Ramirez-Figueroa, and Oron Catts. 2020. The Nature of Biodesigned Systems. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference. ACM, New York, NY, USA, 389–392. https://doi.org/10.1145/3393914.3395908",
      "doi": "10.1145/3393914.3395908"
    },
    {
      "text": "Phillip Gough, Soojeong Yoo, Martin Tomitsch, and Naseem Ahmadpour. 2021. Applying Bioaffordances through an Inquiry-Based Model: A Literature Review of Interactive Biodesign. International Journal of Human–Computer Interaction 37, 17 (April 2021), 1–15. https://doi.org/10.1080/10447318.2021.1898846",
      "doi": ""
    },
    {
      "text": "Jianzhe Gu, David E. Breen, Jenny Hu, Lifeng Zhu, Ye Tao, Tyson Van de Zande, Guanyun Wang, Yongjie Jessica Zhang, and Lining Yao. 2019. Geodesy: Self-rising 2.5D Tiles by Printing along 2D Geodesic Closed Path. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3290605.3300267",
      "doi": "10.1145/3290605.3300267"
    },
    {
      "text": "Tanya Gupta, Neelakshi Kar, Wricha Mishra, and Gareth Loudon. 2021. Persuasive Design for Sustainable Mobility. In India HCI 2021. ACM, New York, NY, USA, 123–127. https://doi.org/10.1145/3506469.3506490",
      "doi": "10.1145/3506469.3506490"
    },
    {
      "text": "Muhammad Haneef, Luca Ceseracciu, Claudio Canale, Ilker S. Bayer, José A. Heredia-Guerrero, and Athanassia Athanassiou. 2017. Advanced Materials from Fungal Mycelium: Fabrication and Tuning of Physical Properties. Scientific Reports 7, January (2017), 1–11. https://doi.org/10.1038/srep41292",
      "doi": ""
    },
    {
      "text": "Kristin Hanks, William Odom, David Roedl, and Eli Blevis. 2008. Sustainable Millennials. In Proceeding of the Twenty-Sixth Annual CHI Conference on Human Factors in Computing Systems - CHI ’08. ACM Press, New York, New York, USA, 333. https://doi.org/10.1145/1357054.1357111",
      "doi": "10.1145/1357054.1357111"
    },
    {
      "text": "Asep Hidayat and Sanro Tachibana. 2012. Characterization of Polylactic Acid (PLA)/Kenaf Composite Degradation by Immobilized Mycelia of Pleurotus Ostreatus. International Biodeterioration & Biodegradation 71 (2012), 50–54.",
      "doi": ""
    },
    {
      "text": "Mitchell Jones, Antoni Gandia, Sabu John, and Alexander Bismarck. 2021. Leather-like Material Biofabrication Using Fungi. Nature Sustainability 4, 1 (Jan. 2021), 9–16. https://doi.org/10.1038/s41893-020-00606-1",
      "doi": ""
    },
    {
      "text": "Mitchell Jones, Tien Huynh, Chaitali Dekiwadia, Fugen Daver, and Sabu John. 2017. Mycelium Composites: A Review of Engineering Characteristics and Growth Kinetics. Journal of Bionanoscience 11, 4 (2017), 241–257. https://doi.org/10.1166/jbns.2017.1440",
      "doi": ""
    },
    {
      "text": "Mitchell Jones, Andreas Mautner, Stefano Luenco, Alexander Bismarck, and Sabu John. 2020. Engineered Mycelium Composite Construction Materials from Fungal Biorefineries: A Critical Review. Materials & Design 187 (Feb. 2020), 108397. https://doi.org/10.1016/j.matdes.2019.108397",
      "doi": ""
    },
    {
      "text": "Sveinung Jørgensen and Lars Jacob Tynes Pedersen. 2018. The Circular Rather than the Linear Economy. 103–120. https://doi.org/10.1007/978-3-319-91971-3_8",
      "doi": ""
    },
    {
      "text": "Somya Joshi and Teresa Cerratto Pargman. 2015. In Search of Fairness: Critical Design Alternatives for Sustainability. Aarhus Series on Human Centered Computing 1, 1 (Oct. 2015), 4. https://doi.org/10.7146/aahcc.v1i1.21301",
      "doi": "10.7146/aahcc.v1i1.21301"
    },
    {
      "text": "Elvin Karana, Bahareh Barati, and Elisa Giaccardi. 2020. Living Artefacts: Conceptualizing Livingness as a Material Quality in Everyday Artefacts. International Journal of Design 14, 3 (2020), 37–53.",
      "doi": ""
    },
    {
      "text": "Elvin Karana, Bahareh Barati, Valentina Rognoli, and Anouk Zeeuw van der Laan. 2015. Material Driven Design (MDD): A Method to Design for Material Experiences. International Journal of Design 9, 2 (2015), 35–54. http://www.ijdesign.org/index.php/IJDesign/article/view/1965/693",
      "doi": ""
    },
    {
      "text": "Elvin Karana, Davine Blauwhoff, Erik Jan Hultink, and Serena Camere. 2018. When the Material Grows: A Case Study on Designing (with) Mycelium-Based Materials. International Journal of Design 12, 2 (2018), 119–136. http://www.ijdesign.org/index.php/IJDesign/article/view/2918",
      "doi": ""
    },
    {
      "text": "Marion Koelle, Madalina Nicolae, Aditya Shekhar Nittala, Marc Teyssier, and Jürgen Steimle. 2022. Prototyping Soft Devices with Interactive Bioplastics. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology (Bend, OR, USA) (UIST ’22). Association for Computing Machinery, New York, NY, USA, Article 19, 16 pages. https://doi.org/10.1145/3526113.3545623",
      "doi": "10.1145/3526113.3545623"
    },
    {
      "text": "Robert Kovacs, Anna Seufert, Ludwig Wall, Hsiang-Ting Chen, Florian Meinel, Willi Müller, Sijing You, Maximilian Brehm, Jonathan Striebel, Yannis Kommana, Alexander Popiak, Thomas Bläsius, and Patrick Baudisch. 2017. TrussFab: Fabricating Sturdy Large-Scale Structures on Desktop 3D Printers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 2606–2616. https://doi.org/10.1145/3025453.3026016",
      "doi": "10.1145/3025453.3026016"
    },
    {
      "text": "Joseph La Delfa, Mehmet Aydin Baytaş, Emma Luke, Ben Koder, and Florian ’Floyd’ Mueller. 2020. Designing Drone Chi. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, New York, NY, USA, 575–586. https://doi.org/10.1145/3357236.3395589",
      "doi": "10.1145/3357236.3395589"
    },
    {
      "text": "Antonio Lanzotti, Massimo Martorelli, Saverio Maietta, Salvatore Gerbino, Francesco Penta, and Antonio Gloria. 2019. A Comparison between Mechanical Properties of Specimens 3D Printed with Virgin and Recycled PLA. Procedia CIRP 79(2019), 143–146. https://doi.org/10.1016/j.procir.2019.02.030",
      "doi": ""
    },
    {
      "text": "Eldy S. Lazaro Vasquez, Hao-Chuan Wang, and Katia Vega. 2020. Introducing the Sustainable Prototyping Life Cycle for Digital Fabrication to Designers. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). Association for Computing Machinery, New York, NY, USA, 1301–1312. https://doi.org/10.1145/3357236.3395510",
      "doi": "10.1145/3357236.3395510"
    },
    {
      "text": "William Lidwell, Kritina Holden, and Jill Butler. 2010. Wabi-Sabi. In Universal Principles of Design. Number 2010. Quarto Publishing Group, Beverly MA, 256–257.",
      "doi": ""
    },
    {
      "text": "Damien Lutz. 2022. The Life-centred Design Guide. Damien Lutz.",
      "doi": ""
    },
    {
      "text": "Jennifer C. Mankoff, Eli Blevis, Alan Borning, Batya Friedman, Susan R. Fussell, Jay Hasbrouck, Allison Woodruff, and Phoebe Sengers. 2007. Environmental Sustainability and Interaction. In CHI ’07 Extended Abstracts on Human Factors in Computing Systems. ACM, New York, NY, USA, 2121–2124. https://doi.org/10.1145/1240866.1240963",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Behdad Moghtaderi and T F Wall. 2006. An Overview of the Australian Biomass Resources and Utilization Technologies. BioResources 1, 1 (Aug. 2006), 93–115. https://doi.org/10.15376/biores.1.1.93-115",
      "doi": ""
    },
    {
      "text": "Pat Pataranutaporn, Jaime Sanchez De La Vega, Abhik Chowdhury, Audrey Ng, and Galina Mihaleva. 2018. Toward Growable Robot : Exploring and Integrating Flexible – Biological Matter with Electronics. In 2018 International Flexible Electronics Technology Conference (IFETC). IEEE, 1–4. https://doi.org/10.1109/IFETC.2018.8584034",
      "doi": ""
    },
    {
      "text": "Pat Pataranutaporn, Todd Ingalls, and Ed Finn. 2018. Biological HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, New York, USA, 1–6. https://doi.org/10.1145/3170427.3188662",
      "doi": "10.1145/3170427.3188662"
    },
    {
      "text": "Pat Pataranutaporn, Angela Vujic, David S. Kong, Pattie Maes, and Misha Sra. 2020. Living Bits. In Proceedings of the Augmented Humans International Conference. ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3384657.3384783",
      "doi": "10.1145/3384657.3384783"
    },
    {
      "text": "Christian Remy, Oliver Bates, Alan Dix, Vanessa Thomas, Mike Hazas, Adrian Friday, and Elaine M. Huang. 2018. Evaluation Beyond Usability. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, Vol. 2018-April. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173790",
      "doi": "10.1145/3173574.3173790"
    },
    {
      "text": "Harpreet Sareen and Pattie Maes. 2019. Cyborg Botany. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313091",
      "doi": "10.1145/3290607.3313091"
    },
    {
      "text": "Paul Stamets and J.S. Chilton. 1983. The Mushroom Cultivator. Agarikon Press.",
      "doi": ""
    },
    {
      "text": "S Stamets. 2005. Mycelium Running. In Mycelium Running: How Mushrooms Can Help Save the World. Ten Speed Press, Berkeley, 343.",
      "doi": ""
    },
    {
      "text": "Lingyun Sun, Yue Yang, Yu Chen, Jiaji Li, Danli Luo, Haolin Liu, Lining Yao, Ye Tao, and Guanyun Wang. 2021. ShrinCage: 4D Printing Accessories that Self-Adapt. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445220"
    },
    {
      "text": "Tzu-Chieh Tang, Bolin An, Yuanyuan Huang, Sangita Vasikaran, Yanyi Wang, Xiaoyu Jiang, Timothy K. Lu, and Chao Zhong. 2020. Materials Design by Synthetic Biology. Nature Reviews Materials (Dec. 2020). https://doi.org/10.1038/s41578-020-00265-w",
      "doi": ""
    },
    {
      "text": "Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching Physical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology(UIST ’15). Association for Computing Machinery, New York, NY, USA, 83–91. https://doi.org/10.1145/2807442.2807467",
      "doi": "10.1145/2807442.2807467"
    },
    {
      "text": "Anja Thieme, Rob Comber, Julia Miebach, Jack Weeden, Nicole Kraemer, Shaun Lawson, and Patrick Olivier. 2012. \"We’ve Bin Watching You\": Designing for Reflection and Social Persuasion to Promote Sustainable Lifestyles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). Association for Computing Machinery, New York, NY, USA, 2337–2346. https://doi.org/10.1145/2207676.2208394",
      "doi": "10.1145/2207676.2208394"
    },
    {
      "text": "Yutaka Tokuda, Deepak Ranjan Sahoo, Matt Jones, Sriram Subramanian, and Anusha Withana. 2021. Flowcuits: Crafting Tangible and Interactive Electrical Components with Liquid Metal Circuits. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’21). Association for Computing Machinery, New York, NY, USA, Article 35. https://doi.org/10.1145/3430524.3440654",
      "doi": "10.1145/3430524.3440654"
    },
    {
      "text": "Martin Tomitsch, Joel Fredericks, Dan Vo, Jessica Frawley, and Marcus Foth. 2021. Non-Human Personas. Including Nature in the Participatory Design of Smart Cities. Interaction Design and Architecture(s)50 (Dec. 2021), 102–130. https://doi.org/10.55612/s-5002-050-006",
      "doi": ""
    },
    {
      "text": "Vasiliki Tsaknaki and Ylva Fernaeus. 2016. Expanding on Wabi-Sabi as a Design Resource in HCI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 5970–5983. https://doi.org/10.1145/2858036.2858459",
      "doi": "10.1145/2858036.2858459"
    },
    {
      "text": "Eldy S. Lazaro Vasquez and Katia Vega. 2019. From Plastic to Biomaterials. In Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers - UbiComp/ISWC ’19. ACM Press, New York, New York, USA, 308–311. https://doi.org/10.1145/3341162.3343808",
      "doi": "10.1145/3341162.3343808"
    },
    {
      "text": "Eldy S. Lazaro Vasquez and Katia Vega. 2019. Myco-Accessories. In Proceedings of the 23rd International Symposium on Wearable Computers. ACM, New York, NY, USA, 306–311. https://doi.org/10.1145/3341163.3346938",
      "doi": "10.1145/3341163.3346938"
    },
    {
      "text": "Susanna Vogel, Nathalia Campreguer França, Eleni Economidou, Bernhard Maurer, and Manfred Tscheligi. 2020. Circular HCI. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference. ACM, New York, NY, USA, 233–237. https://doi.org/10.1145/3393914.3395894",
      "doi": "10.1145/3393914.3395894"
    },
    {
      "text": "Ron Wakkary. 2021. Things we could design: For more than human-centered worlds. MIT press.",
      "doi": ""
    },
    {
      "text": "Jennifer Weiler, Piyum Fernando, Nipuni Siyambalapitiya, and Stacey Kuznetsov. 2019. Mycelium Artifacts. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion. ACM, New York, NY, USA, 69–72. https://doi.org/10.1145/3301019.3325156",
      "doi": "10.1145/3301019.3325156"
    },
    {
      "text": "Daniel Welch, Margit Keller, and Giuliana Mandich. 2017. Imagined Futures of Everyday Life in the Circular Economy. Interactions 24, 2 (Feb. 2017), 46–51. https://doi.org/10.1145/3047415",
      "doi": "10.1145/3047415"
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. bioLogic: Natto Cells As Nanoactuators for Shape Changing Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–10. https://doi.org/10.1145/2702123.2702611",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Zuan-Wei Zhou. 2017. Cultivation of Ganoderma Lucidum.In Edible and Medicinal Mushrooms: Technology and Applications, Diego Cunha Zied and Arturo Pardo-Giménez (Eds.). Wiley.",
      "doi": ""
    }
  ]
}