{
  "doi": "10.1145/3544548.3581417",
  "title": "Surfacing Livingness in Microbial Displays: A Design Taxonomy for HCI",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2023,
  "badges": [],
  "abstract": "In recent years, there has been a notable proliferation and diversification of works in HCI, that integrate living microorganisms; an imperative lifeform dominating ecosystems of our planet. Yet despite the growing interest, there is a lack of structured lenses with which designers can strategize their processes of surfacing livingness; a material quality inherent in living artefacts with a potential to enrich user experiences and to initiate mutualistic care between humans and microorganisms. Through a systematic artefacts review and a case study on Flavobacteria, we have developed and instantiated a Taxonomy of Surfacing Livingness in Microbial Displays, consisting of six microbe-sensitive, tuneable mechanisms for human noticing of microorganisms: 1) Canvassing, 2) Marking, 3) Magnifying, 4) Translating, 5) Nudging, and 6) Molecular Programming. The taxonomy invites diverse and adaptable ways of generating and crafting microbial displays; towards overcoming microbe-specific surfacing constraints, integrating diverse stakeholders’ values, and enabling nuanced address of microbial welfare.",
  "tags": [
    "biological-HCI",
    "Microbes",
    "livingness",
    "taxonomy",
    "biodesign",
    "living aesthetics"
  ],
  "authors": [
    {
      "name": "Raphael Kim",
      "institution": "Industrial Design Engineering, Delft University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659306478",
      "orcid": "0000-0002-0777-0134"
    },
    {
      "name": "Clarice Risseeuw",
      "institution": "Industrial Design Engineering, Delft University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239308",
      "orcid": "0000-0002-9557-6517"
    },
    {
      "name": "Eduard Georges Groutars",
      "institution": "Industrial Design Engineering, Delft University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232799",
      "orcid": "0000-0002-6013-5092"
    },
    {
      "name": "Elvin Karana",
      "institution": "Industrial Design Engineering, Delft University of Technology, Netherlands",
      "img": "/do/10.1145/contrib-81508708476/rel-imgonly/elvinkarana.jpg",
      "acmid": "81508708476",
      "orcid": "0000-0001-9598-2753"
    }
  ],
  "references": [
    {
      "text": "Andrew Adamatzky. 2010. Physarum machines: computers from slime mould. Vol. 74. World Scientific, Singapore.",
      "doi": ""
    },
    {
      "text": "Mirela Alistar and Margherita Pevere. 2020. Semina Aeternitatis: Using Bacteria for Tangible Interaction with Data. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3334480.3381817",
      "doi": "10.1145/3334480.3381817"
    },
    {
      "text": "Rachel Armstrong. 2022. Biodesign for a culture of life: Of microbes, ethics, and design. In Lockton, D., Lenzi, S., Hekkert, P., Oak, A., Sádaba, J., Lloyd, P. (eds.). DRS2022: Bilbao, Spain, 1–20. https://doi.org/10.21606/drs.2022.144",
      "doi": ""
    },
    {
      "text": "S. Nisa Asgarali-Hoffman and Foad Hamidi. 2021. Perspectives of Bioartists and Community Lab Organizers on Working with Living Organisms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 591, 15 pages. https://doi.org/10.1145/3411764.3445060",
      "doi": "10.1145/3411764.3445060"
    },
    {
      "text": "Fredrik Aspling, Jinyi Wang, and Oskar Juhlin. 2016. Plant-Computer Interaction, Beauty and Dissemination. In Proceedings of the Third International Conference on Animal-Computer Interaction (Milton Keynes, United Kingdom) (ACI ’16). Association for Computing Machinery, New York, NY, USA, Article 5, 10 pages. https://doi.org/10.1145/2995257.2995393",
      "doi": "10.1145/2995257.2995393"
    },
    {
      "text": "Bahareh Barati, Elvin Karana, Sylvia Pont, and Tim van Dortmont. 2021. LIVING LIGHT INTERFACES —AN EXPLORATION OF BIOLUMINESCENCE AESTHETICS. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 1215–1229. https://doi.org/10.1145/3461778.3462038",
      "doi": "10.1145/3461778.3462038"
    },
    {
      "text": "Fiona Bell, Alice Hong, Andreea Danielescu, Aditi Maheshwari, Ben Greenspan, Hiroshi Ishii, Laura Devendorf, and Mirela Alistar. 2021. Self-DeStaining Textiles: Designing Interactive Systems with Fabric, Stains and Light. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 631, 12 pages. https://doi.org/10.1145/3411764.3445155",
      "doi": "10.1145/3411764.3445155"
    },
    {
      "text": "Fiona Bell, Netta Ofer, Ethan Frier, Ella McQuaid, Hyelin Choi, and Mirela Alistar. 2022. Biomaterial Playground: Engaging with Bio-Based Materiality. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 171, 5 pages. https://doi.org/10.1145/3491101.3519875",
      "doi": "10.1145/3491101.3519875"
    },
    {
      "text": "Bio Art & Design Award 2022. BAD Award. Bio Art & Design Award. Retrieved September 11, 2022 from https://www.badaward.nl/",
      "doi": ""
    },
    {
      "text": "Laurens Boer, Harvey Bewley, Tom Jenkins, Sarah Homewood, Teresa Almeida, and Anna Vallgårda. 2020. Gut-Tracking as Cultivation. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 561–574. https://doi.org/10.1145/3357236.3395588",
      "doi": "10.1145/3357236.3395588"
    },
    {
      "text": "Timothy F. Braun, Manjeet K. Khubbar, Daad A. Saffarini, and Mark J. McBride. 2005. Flavobacterium johnsoniae gliding motility genes identified by mariner mutagenesis. Journal of bacteriology 187 (2005), 6943–6952. Issue 20. https://doi.org/10.1128/JB.187.20.6943-6952.2005",
      "doi": ""
    },
    {
      "text": "Edward Braund and Eduardo Miranda. 2014. Music with unconventional computing: a system for physarum polycephalum sound synthesis. In Sound, Music, and Motion: 10th International Symposium, CMMR 2013, Marseille, France, October 15-18, 2013. Revised Selected Papers 10. Springer, Switzerland, 175–189.",
      "doi": ""
    },
    {
      "text": "Edward Braund and Eduardo R Miranda. 2016. BioComputer music: generating musical responses with physarum polycephalum-based memristors. In Music, Mind, and Embodiment: 11th International Symposium, CMMR 2015, Plymouth, UK, June 16-19, 2015, Revised Selected Papers 11. Springer, Switzerland, 405–419.",
      "doi": ""
    },
    {
      "text": "Serena Camere and Elvin Karana. 2017. Growing materials for product design. In Alive. Active. Adaptive: Proceedings of International Conference on Experiential Knowledge and Emerging Materials (EKSIG 2017). International Conference on Experiential Knowledge and Emerging Materials, Netherlands, 101–115.",
      "doi": ""
    },
    {
      "text": "Serena Camere and Elvin Karana. 2018. Fabricating materials from living organisms: An emerging design practice. Journal of Cleaner Production 186 (2018), 570–584.",
      "doi": ""
    },
    {
      "text": "Francisco Carpio, Admela Jukan, Ana Isabel Martín Sanchez, Nina Amla, and Nicole Kemper. 2017. Beyond Production Indicators: A Novel Smart Farming Application and System for Animal Welfare. In Proceedings of the Fourth International Conference on Animal-Computer Interaction (Milton Keynes, United Kingdom) (ACI2017). Association for Computing Machinery, New York, NY, USA, Article 7, 11 pages. https://doi.org/10.1145/3152130.3152140",
      "doi": "10.1145/3152130.3152140"
    },
    {
      "text": "Arturo Casadevall and Liise-anne Pirofski. 2000. Host-pathogen interactions: basic concepts of microbial commensalism, colonization, infection, and disease. Infection and immunity 68, 12 (2000), 6511–6518.",
      "doi": ""
    },
    {
      "text": "Carlos Castellanos, Bello Bello, Hyeryeong Lee, Mungyu Lee, Yoo Seok Lee, and In Seop Chang. 2020. On Creating Multimedia Interfaces for Hybrid Biological-Digital Art Installations. In International Conference on Multimedia Modeling. Springer, Switzerland, 139–150.",
      "doi": ""
    },
    {
      "text": "Ricardo Cavicchioli, William J Ripple, Kenneth N Timmis, Farooq Azam, Lars R Bakken, Matthew Baylis, Michael J Behrenfeld, Antje Boetius, Philip W Boyd, Aimée T Classen, 2019. Scientists’ warning to humanity: microorganisms and climate change. Nature Reviews Microbiology 17, 9 (2019), 569–586.",
      "doi": ""
    },
    {
      "text": "Dominique Chen, Young ah Seong, Hiraku Ogura, Yuto Mitani, Naoto Sekiya, and Kiichi Moriya. 2021. Nukabot: Design of Care for Human-Microbe Relationships. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 291, 7 pages. https://doi.org/10.1145/3411763.3451605",
      "doi": "10.1145/3411763.3451605"
    },
    {
      "text": "Adrian David Cheok, Roger Thomas Kok, Chuen Tan, Owen Noel Newton Fernando, Tim Merritt, and Janyn Yen Ping Sen. 2008. Empathetic Living Media. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (Cape Town, South Africa) (DIS ’08). Association for Computing Machinery, New York, NY, USA, 465–473. https://doi.org/10.1145/1394445.1394495",
      "doi": "10.1145/1394445.1394495"
    },
    {
      "text": "Laura Cinti and Howard Boland. 2012. Living Mirror. Bio Art & Design Award. Retrieved July 25, 2022 from https://www.badaward.nl/artists-scientists/laura-cinti-howard-boland",
      "doi": ""
    },
    {
      "text": "Collins 2022. Collins Dictionary. Collins. Retrieved September 8, 2022 from https://www.collinsdictionary.com/",
      "doi": ""
    },
    {
      "text": "Isabel Correa and Nathan Holbert. 2021. Myco-Kit: Towards a Design for Interspecies Creative Learning. In Interaction Design and Children (Athens, Greece) (IDC ’21). Association for Computing Machinery, New York, NY, USA, 439–443. https://doi.org/10.1145/3459990.3465178",
      "doi": "10.1145/3459990.3465178"
    },
    {
      "text": "Lucas Czjek. 2013. Anima. Pavillion 35. Retrieved July 25, 2022 from https://pavillon35.polycinease.com/anima-1-0/",
      "doi": ""
    },
    {
      "text": "Orlando de Lange, Kellie Dunn, and Nadya Peek. 2022. “Short on Time and Big on Ideas”: Perspectives from Lab Members on DIYBio Work in Community Biolabs. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 1358–1376. https://doi.org/10.1145/3532106.3533521",
      "doi": "10.1145/3532106.3533521"
    },
    {
      "text": "Donald Degraen, Felix Kosmalla, and Antonio Krüger. 2019. Overgrown: Supporting Plant Growth with an Endoskeleton for Ambient Notifications. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312833",
      "doi": "10.1145/3290607.3312833"
    },
    {
      "text": "Laura Devendorf, Abigail De Kosnik, Kate Mattingly, and Kimiko Ryokai. 2016. Probing the Potential of Post-Anthropocentric 3D Printing. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 170–181. https://doi.org/10.1145/2901790.2901879",
      "doi": "10.1145/2901790.2901879"
    },
    {
      "text": "Douglas Easterly, Matthew Kenyon, and Tiago Rorke. 2010. Tardigotchi: Considerations on Pets and Digital Simulations. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction(Funchal, Portugal) (TEI ’11). Association for Computing Machinery, New York, NY, USA, 391–392. https://doi.org/10.1145/1935701.1935795",
      "doi": "10.1145/1935701.1935795"
    },
    {
      "text": "Wim van Eck and Maarten H Lamers. 2015. Biological content generation: evolving game terrains through living organisms. In International Conference on Evolutionary and Biologically Inspired Music and Art. Springer, Switzlernad, 224–235.",
      "doi": ""
    },
    {
      "text": "Thomas Egli, Wolfgang Köster, and Leo Meile. 2002. Pathogenic microbes in water and food: changes and challenges. FEMS microbiology reviews 26, 2 (2002), 111–112.",
      "doi": ""
    },
    {
      "text": "Karen El Asmar. 2019. Social Microbial Prosthesis: Towards Super-Organism Centered Design. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3290607.3312852",
      "doi": "10.1145/3290607.3312852"
    },
    {
      "text": "SS Epstein. 2013. The phenomenon of microbial uncultivability. Current opinion in microbiology 16, 5 (2013), 636–642.",
      "doi": ""
    },
    {
      "text": "Hazal Ertürkan, Elvin Karana, and Ruth Mugge. 2022. Is this alive? Towards a vocabulary for understanding and communicating living material experiences. In Lockton, D., Lenzi, S., Hekkert, P., Oak, A., Sádaba, J., Lloyd, P. (eds.). DRS2022: Bilbao, Spain, 1–21. https://doi.org/10.21606/drs.2022.796",
      "doi": ""
    },
    {
      "text": "Yuval Fein, Gilad Gome, Oren Zuckerman, and Hadas Erel. 2020. My First Biolab: An Inquiry-Based Learning System for Microbiology Exploration. In Proceedings of the 2020 ACM Interaction Design and Children Conference: Extended Abstracts(London, United Kingdom) (IDC ’20). Association for Computing Machinery, New York, NY, USA, 292–295. https://doi.org/10.1145/3397617.3402040",
      "doi": "10.1145/3397617.3402040"
    },
    {
      "text": "Mary Flanagan. 2002. Feminist Transgressions? Object and Process in Transgenic/Genetic Works by Women. In Proceedings of the 29th International Conference on Computer Graphics and Interactive Techniques. Electronic Art and Animation Catalog. (San Antonio, Texas) (SIGGRAPH ’02). Association for Computing Machinery, New York, NY, USA, 129–133. https://doi.org/10.1145/2931127.2931197",
      "doi": "10.1145/2931127.2931197"
    },
    {
      "text": "Tyler Fox. 2018. Designing with the Sensorial. Interactions 25, 4 (jun 2018), 64–65. https://doi.org/10.1145/3229344",
      "doi": "10.1145/3229344"
    },
    {
      "text": "Gerd Geleff Nielsen and Teresa Almeida. 2021. Designing with the Immune System: The Abject, Bodily Fluids, and Micro(Be) Interactions. In 10th International Conference on Digital and Interactive Arts (Aveiro, Portugal, Portugal) (ARTECH 2021). Association for Computing Machinery, New York, NY, USA, Article 79, 4 pages. https://doi.org/10.1145/3483529.3483726",
      "doi": "10.1145/3483529.3483726"
    },
    {
      "text": "Lukas C Gerber, Michael C Doshi, Honesty Kim, and Ingmar H Riedel-Kruse. 2016. BioGraphr: Science Games on a Biotic Computer. In DiGRA/FDG. DiGRA/FDG, DiGRA Digital Library, 16.",
      "doi": ""
    },
    {
      "text": "Lukas C Gerber, Honesty Kim, and Ingmar H Riedel-Kruse. 2016. Interactive Biotechnology: Design Rules for Integrating Biological Matter into Digital Games.DiGRA/FDG 13, 1 (2016), 16.",
      "doi": ""
    },
    {
      "text": "Gilad Gome, Yuval Fein, Julian Waksberg, Yuval Maayan, Andrey Grishko, Iddo Yehoshua Wald, and Oren Zuckerman. 2019. My First Biolab: A System for Hands-On Biology Experiments. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313081",
      "doi": "10.1145/3290607.3313081"
    },
    {
      "text": "Gilad Gome, Julian Waksberg, Andrey Grishko, Iddo Yehoshua Wald, and Oren Zuckerman. 2019. OpenLH: Open Liquid-Handling System for Creative Experimentation with Biology. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (Tempe, Arizona, USA) (TEI ’19). Association for Computing Machinery, New York, NY, USA, 55–64. https://doi.org/10.1145/3294109.3295619",
      "doi": "10.1145/3294109.3295619"
    },
    {
      "text": "Phillip Gough, Jack Forman, Pat Pataranutaporn, Leigh-Anne Hepburn, Carolina Ramirez-Figueroa, Clare Cooper, Angela Vujic, David Sun Kong, Raphael Kim, Pattie Maes, Hiroshi Ishii, Misha Sra, and Naseem Ahmadpour. 2021. Speculating on Biodesign in the Future Home. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 77, 5 pages. https://doi.org/10.1145/3411763.3441353",
      "doi": "10.1145/3411763.3441353"
    },
    {
      "text": "Phillip Gough, Larissa Pschetz, Naseem Ahmadpour, Leigh-Anne Hepburn, Clare Cooper, Carolina Ramirez-Figueroa, and Oron Catts. 2020. The Nature of Biodesigned Systems: Directions for HCI. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS’ 20 Companion). Association for Computing Machinery, New York, NY, USA, 389–392. https://doi.org/10.1145/3393914.3395908",
      "doi": "10.1145/3393914.3395908"
    },
    {
      "text": "Phillip Gough, Soojeong Yoo, Martin Tomitsch, and Naseem Ahmadpour. 2021. Applying bioaffordances through an inquiry-based model: A literature review of interactive biodesign. International Journal of Human–Computer Interaction 37, 17(2021), 1583–1597.",
      "doi": ""
    },
    {
      "text": "Eduard Georges Groutars, Carmen Clarice Risseeuw, Colin Ingham, Raditijo Hamidjaja, Willemijn S. Elkhuizen, Sylvia C. Pont, and Elvin Karana. 2022. Flavorium: An Exploration of Flavobacteria’s Living Aesthetics for Living Color Interfaces. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 99, 19 pages. https://doi.org/10.1145/3491102.3517713",
      "doi": "10.1145/3491102.3517713"
    },
    {
      "text": "Masami Hagiya. 2000. From molecular computing to molecular programming. In International workshop on DNA-based computers. Springer, Berlin, Heidelberg, 89–102.",
      "doi": ""
    },
    {
      "text": "Foad Hamidi and Melanie Baljko. 2014. Rafigh: A Living Media Interface for Speech Intervention. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1817–1820. https://doi.org/10.1145/2556288.2557402",
      "doi": "10.1145/2556288.2557402"
    },
    {
      "text": "Foad Hamidi and Melanie Baljko. 2017. Engaging Children Using a Digital Living Media System. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 711–723. https://doi.org/10.1145/3064663.3064708",
      "doi": "10.1145/3064663.3064708"
    },
    {
      "text": "Foad Hamidi, Lydia Stamato, Lisa Scheifele, Rian Ciela Visscher Hammond, and S. Nisa Asgarali-Hoffman. 2021. “Turning the Invisible Visible”: Transdisciplinary Bioart Explorations in Human-DNA Interaction. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 592, 15 pages. https://doi.org/10.1145/3411764.3445408",
      "doi": "10.1145/3411764.3445408"
    },
    {
      "text": "Raditijo Hamidjaja, Jérémie Capoulade, Laura Catón, and Colin J. Ingham. 2020. The cell organization underlying structural colour is involved in Flavobacterium IR1 predation. ISME Journal 14 (11 2020), 2890–2900. Issue 11. https://doi.org/10.1038/s41396-020-00760-6",
      "doi": ""
    },
    {
      "text": "Donna Jeanne Haraway. 2003. The companion species manifesto: Dogs, people, and significant otherness. Vol. 1. Prickly Paradigm Press Chicago, United States.",
      "doi": ""
    },
    {
      "text": "Donna J Haraway. 2013. When species meet. Vol. 3. U of Minnesota Press, United States.",
      "doi": ""
    },
    {
      "text": "Hayden Harvey, Molly Havard, David Magnus, Mildred K Cho, and Ingmar H Riedel-Kruse. 2014. Innocent fun or “microslavery”? An ethical analysis of biotic games. Hastings Center Report 44, 6 (2014), 38–46.",
      "doi": ""
    },
    {
      "text": "Ivan Henriques. 2016. Caravel: Environmental Robotics. ivanhenriques.com. Retrieved September 11, 2022 from https://ivanhenriques.com/works/caravel/",
      "doi": ""
    },
    {
      "text": "Ivan Henriques. 2019. Bacterbrain. ivanhenriques.com. Retrieved September 11, 2022 from https://ivanhenriques.com/works/bacterbrain/",
      "doi": ""
    },
    {
      "text": "David Holstius, John Kembel, Amy Hurst, Peng-Hui Wan, and Jodi Forlizzi. 2004. Infotropism: Living and Robotic Plants as Interactive Displays. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (Cambridge, MA, USA) (DIS ’04). Association for Computing Machinery, New York, NY, USA, 215–221. https://doi.org/10.1145/1013115.1013145",
      "doi": "10.1145/1013115.1013145"
    },
    {
      "text": "Zahid Hossain, Engin Bumbacher, Alison Brauneis, Monica Diaz, Andy Saltarelli, Paulo Blikstein, and Ingmar H Riedel-Kruse. 2018. Design guidelines and empirical case study for scaling authentic inquiry-based science learning via open online courses and interactive biology cloud labs. International Journal of Artificial Intelligence in Education 28, 4(2018), 478–507.",
      "doi": ""
    },
    {
      "text": "Zahid Hossain, Xiaofan Jin, Engin W. Bumbacher, Alice M. Chung, Stephen Koo, Jordan D. Shapiro, Cynthia Y. Truong, Sean Choi, Nathan D. Orloff, Paulo Blikstein, and Ingmar H. Riedel-Kruse. 2015. Interactive Cloud Experimentation for Biology: An Online Education Case Study. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3681–3690. https://doi.org/10.1145/2702123.2702354",
      "doi": "10.1145/2702123.2702354"
    },
    {
      "text": "Mohammadreza Hosseini, Arcot Sowmya, Pascal Vallotton, and Tomasz Bednarz. 2013. High Precision Localization of Bacterium and Scientific Visualization. In Proceedings of the IEEE International Conference on Computer Vision Workshops. Computer Vision Foundation, IEEE Xplore, 210–213.",
      "doi": "10.1109/ICCVW.2013.35"
    },
    {
      "text": "inaturalist.org 2022. Dog Vomit Slime Mold (Fuligo septica). inaturalist.org. Retrieved July 27, 2022 from https://www.inaturalist.org/taxa/55483-Fuligo-septica#cite_note-2",
      "doi": ""
    },
    {
      "text": "Villads E. Johansen, Laura Catón, Raditijo Hamidjaja, Els Oosterink, Bodo D. Wilts, Torben S. Rasmussen, Michael M. Sherlock, Colin J. Ingham, and Silvia Vignolini. 2017. Genetic manipulation of structural color in bacterial colonies. PNAS 115(2017), 2652–2657. Issue 11. https://doi.org/10.17863/CAM.16794",
      "doi": ""
    },
    {
      "text": "Eduardo Kac. 2000. GFP Bunny. ekac.org. Retrieved September 11, 2022 from https://www.ekac.org/gfpbunny.html#gfpbunnyanchor",
      "doi": ""
    },
    {
      "text": "Elvin Karana, Bahareh Barati, and Elisa Giaccardi. 2020. Living Artefacts: Conceptualizing Livingness as a Material Quality in Everyday Artefacts.International Journal of Design 14, 3 (2020), 37–53.",
      "doi": ""
    },
    {
      "text": "Elvin Karana, Elisa Giaccardi, Niels Stamhuis, and Jasper Goossensen. 2016. The Tuning of Materials: A Designer’s Journey. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 619–631. https://doi.org/10.1145/2901790.2901909",
      "doi": "10.1145/2901790.2901909"
    },
    {
      "text": "Betty Kientz, Adrien Ducret, Stephen Luke, Peter Vukusic, Tâm Mignot, and Eric Rosenfeld. 2012. Glitter-Like Iridescence within the Bacteroidetes Especially Cellulophaga spp.: Optical Properties and Correlation with Gliding Motility. PLoS ONE 7 (12 2012), e52900. Issue 12. https://doi.org/10.1371/journal.pone.0052900",
      "doi": ""
    },
    {
      "text": "Betty Kientz, Stephen Luke, Peter Vukusic, Renaud Péteri, Cyrille Beaudry, Tristan Renault, David Simon, Tâm Mignot, and Eric Rosenfeld. 2016. A unique self-organization of bacterial sub-communities creates iridescence in Cellulophaga lytica colony biofilms. Scientific Reports 6 (1 2016), 1–11. https://doi.org/10.1038/srep19906",
      "doi": ""
    },
    {
      "text": "Honesty Kim, Lukas Cyrill Gerber, Daniel Chiu, Seung Ah Lee, Nate J Cira, Sherwin Yuyang Xia, and Ingmar H Riedel-Kruse. 2016. LudusScope: accessible interactive smartphone microscopy for life-science education. PloS one 11, 10 (2016), e0162602.",
      "doi": ""
    },
    {
      "text": "Raphael Kim. 2017. Reviving Drachma. raphael.kim. Retrieved September 5, 2022 from https://raphael.kim/reviving-drachma",
      "doi": ""
    },
    {
      "text": "Raphael Kim. 2021. Virus as Quasi-Living Bio-Material for Interaction Design: Practical, Ethical, and Philosophical Implications. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 321, 7 pages. https://doi.org/10.1145/3411763.3451770",
      "doi": "10.1145/3411763.3451770"
    },
    {
      "text": "Raphael Kim, Pat Pataranutaporn, Jack Forman, Seung Ah Lee, Ingmar H. Riedel-Kruse, Mirela Alistar, Eldy S. Lazaro Vasquez, Katia Vega, Roland van Dierendonck, Gilad Gome, Oren Zuckerman, Angela Vujic, David S. Kong, Pattie Maes, Hiroshi Ishii, Misha Sra, and Stefan Poslad. 2021. Microbe-HCI: Introduction and Directions for Growth. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 155, 4 pages. https://doi.org/10.1145/3411763.3450408",
      "doi": "10.1145/3411763.3450408"
    },
    {
      "text": "Raphael Kim and Stefan Poslad. 2019. Growable, Invisible, Connected Toys: Twitching Towards Ubiquitous Bacterial Computing. In Proceedings of the Halfway to the Future Symposium 2019 (Nottingham, United Kingdom) (HTTF 2019). Association for Computing Machinery, New York, NY, USA, Article 3, 9 pages. https://doi.org/10.1145/3363384.3363387",
      "doi": "10.1145/3363384.3363387"
    },
    {
      "text": "Raphael Kim, Siobhan Thomas, Roland van Dierendonck, Nick Bryan-Kinns, and Stefan Poslad. 2020. Working with Nature’s Lag: Initial Design Lessons for Slow Biotic Games. Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3402942.3409790",
      "doi": "10.1145/3402942.3409790"
    },
    {
      "text": "Raphael Kim, Siobhan Thomas, Roland van Dierendonck, Antonios Kaniadakis, and Stefan Poslad. 2019. Microbial integration on player experience of hybrid bio-digital games. In Intelligent Technologies for Interactive Entertainment. INTETAIN 2018., Paulo Cortez, Luís Magalhães, Pedro Branco, Carlos F. Portela, and Telmo Adão (Eds.). Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering, Vol. 273. Springer, Cham, 148–159. https://doi.org/10.1007/978-3-030-16447-8_15",
      "doi": ""
    },
    {
      "text": "Raphael Kim, Siobhan Thomas, Roland van Dierendonck, and Stefan Poslad. 2018. A New Mould Rush: Designing for a Slow Bio-Digital Game Driven by Living Micro-Organisms. In Proceedings of the 13th International Conference on the Foundations of Digital Games (Malmö, Sweden) (FDG ’18). Association for Computing Machinery, New York, NY, USA, Article 10, 9 pages. https://doi.org/10.1145/3235765.3235798",
      "doi": "10.1145/3235765.3235798"
    },
    {
      "text": "Raphael Kim, Roland van Dierendonck, and Stefan Poslad. 2019. Moldy Ghosts and Yeasty Invasions: Glitches in Hybrid Bio-Digital Games. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312895",
      "doi": "10.1145/3290607.3312895"
    },
    {
      "text": "Stacey Kuznetsov, Cassandra Barrett, Piyum Fernando, and Kat Fowler. 2018. Antibiotic-Responsive Bioart: Exploring DIYbio as a Design Studio Practice. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174037",
      "doi": "10.1145/3173574.3174037"
    },
    {
      "text": "Stacey Kuznetsov, Will Harrigan-Anderson, Haakon Faste, Scott E. Hudson, and Eric Paulos. 2013. Community Engagements with Living Sensing Systems. In Proceedings of the 9th ACM Conference on Creativity & Cognition (Sydney, Australia) (C&C ’13). Association for Computing Machinery, New York, NY, USA, 213–222. https://doi.org/10.1145/2466627.2466638",
      "doi": "10.1145/2466627.2466638"
    },
    {
      "text": "Amy T. Lam, Jonathan Griffin, Matthew Austin Loeun, Nate J. Cira, Seung Ah Lee, and Ingmar H. Riedel-Kruse. 2020. Pac-Euglena: A Living Cellular Pac-Man Meets Virtual Ghosts. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376378",
      "doi": "10.1145/3313831.3376378"
    },
    {
      "text": "Amy T Lam, Joyce Ma, Cory Barr, Seung Ah Lee, Adam K White, Kristina Yu, and Ingmar H Riedel-Kruse. 2019. First-hand, immersive full-body experiences with living cells through interactive museum exhibits. Nature biotechnology 37, 10 (2019), 1238–1241.",
      "doi": ""
    },
    {
      "text": "Maarten H Lamers and Wim JOM van Eck. 2022. Microbial content generation for natural terrains in computer games. Frontiers in Computer Science 4 (2022), 1–11.",
      "doi": ""
    },
    {
      "text": "Cate LaPlante, Matthew Nolin, and Tobi Saulnier. 2017. PlayScope: Augmented Microscopy as a Tool to Increase STEM Engagement. In Proceedings of the 12th International Conference on the Foundations of Digital Games (Hyannis, Massachusetts) (FDG ’17). Association for Computing Machinery, New York, NY, USA, Article 63, 4 pages. https://doi.org/10.1145/3102071.3116223",
      "doi": "10.1145/3102071.3116223"
    },
    {
      "text": "Eldy S. Lazaro Vasquez, Hao-Chuan Wang, and Katia Vega. 2020. Introducing the Sustainable Prototyping Life Cycle for Digital Fabrication to Designers. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 1301–1312. https://doi.org/10.1145/3357236.3395510",
      "doi": "10.1145/3357236.3395510"
    },
    {
      "text": "Kyungwon Lee, Yu-Kyung Jang, Jaewoo Jung, Dong Hwan Kim, Hyun Jean Lee, and Seung Ah Lee. 2022. EuglPollock: Rethinking Interspecies Collaboration through Art Making. In Proceedings of the 30th ACM International Conference on Multimedia (Lisboa, Portugal) (MM ’22). Association for Computing Machinery, New York, NY, USA, 1077–1084. https://doi.org/10.1145/3503161.3548151",
      "doi": "10.1145/3503161.3548151"
    },
    {
      "text": "Kyungwon Lee, Jaewoo Jung, and Seung Ah Lee. 2020. MicroAquarium: An Immersive and Interactive Installation with Living Microorganisms. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3334480.3383164",
      "doi": "10.1145/3334480.3383164"
    },
    {
      "text": "SA Lee and IH Riedel-Kruse. 2022. Micro-HBI: Human-Biology Interaction With Living Cells, Viruses, and Molecules. Front. Comput. Sci. 4: 849887. doi: 10.3389/fcomp 4 (2022), 1–4.",
      "doi": ""
    },
    {
      "text": "Seung Ah Lee, Engin Bumbacher, Alice M. Chung, Nate Cira, Byron Walker, Ji Young Park, Barry Starr, Paulo Blikstein, and Ingmar H. Riedel-Kruse. 2015. Trap It! A Playful Human-Biology Interaction for a Museum Installation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2593–2602. https://doi.org/10.1145/2702123.2702220",
      "doi": "10.1145/2702123.2702220"
    },
    {
      "text": "Ann Light, Alison Powell, and Irina Shklovski. 2017. Design for Existential Crisis in the Anthropocene Age. In Proceedings of the 8th International Conference on Communities and Technologies (Troyes, France) (C&T ’17). Association for Computing Machinery, New York, NY, USA, 270–279. https://doi.org/10.1145/3083671.3083688",
      "doi": "10.1145/3083671.3083688"
    },
    {
      "text": "Jen Liu, Daragh Byrne, and Laura Devendorf. 2018. Design for Collaborative Survival: An Inquiry into Human-Fungi Relationships. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173614",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2019. Symbiotic Encounters: HCI and Sustainable Agriculture. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300547",
      "doi": "10.1145/3290605.3300547"
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Jen Liu, Kristin Dew, Patrycja Zdziarska, Maya Livio, and Shaowen Bardzell. 2019. Exploring Noticing as Method in Design Research. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion (San Diego, CA, USA) (DIS ’19 Companion). Association for Computing Machinery, New York, NY, USA, 377–380. https://doi.org/10.1145/3301019.3319995",
      "doi": "10.1145/3301019.3319995"
    },
    {
      "text": "Maya Livio, Kristin Dew, SzuYu Liu, and Patrycja Zdziarska. 2019. Methods for Noticing Workbook. mayalivio.com. Retrieved July 31, 2022 from https://mayalivio.com/METHODS-FOR-NOTICING-WORKBOOK",
      "doi": ""
    },
    {
      "text": "Jasmine Lu and Pedro Lopes. 2022. Integrating Living Organisms in Devices to Implement Care-Based Interactions. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology(Bend, OR, USA) (UIST ’22). Association for Computing Machinery, New York, NY, USA, Article 28, 13 pages. https://doi.org/10.1145/3526113.3545629",
      "doi": "10.1145/3526113.3545629"
    },
    {
      "text": "Jan-Maarten Luursema. 2017. Slime Mold Andi. slime-mold-andi.medium.com. Retrieved September 5, 2022 from https://slime-mold-andi.medium.com/",
      "doi": ""
    },
    {
      "text": "Clara Mancini. 2011. Animal-Computer Interaction: A Manifesto. Interactions 18, 4 (jul 2011), 69–73. https://doi.org/10.1145/1978822.1978836",
      "doi": "10.1145/1978822.1978836"
    },
    {
      "text": "Timothy Merritt, Foad Hamidi, Mirela Alistar, and Marta DeMenezes. 2020. Living media interfaces: a multi-perspective analysis of biological materials for interaction. Digital Creativity 31, 1 (2020), 1–21.",
      "doi": ""
    },
    {
      "text": "2006.igem.org 2006. MIT 2006 - iGEM. 2006.igem.org. Retrieved September 8, 2022 from https://2006.igem.org/wiki/index.php/MIT_2006",
      "doi": ""
    },
    {
      "text": "Robert E Mitchell. 2015. Bioart and the Vitality of Media. University of Washington Press, United States.",
      "doi": ""
    },
    {
      "text": "Matthijs Munnick. 2011. Microscopic Opera. matthijsmunnik.nl. Retrieved September 11, 2022 from http://matthijsmunnik.nl/works/installation/microscopicopera/",
      "doi": ""
    },
    {
      "text": "William Myers and Paola Antonelli. 2012. Bio Design: Nature, Science, Creativity. Thames and Hudson London, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Jay Nadeau, Chris Lindensmith, Jody W Deming, Vicente I Fernandez, and Roman Stocker. 2016. Microbial morphology and motility as biosignatures for outer planet missions. Astrobiology 16, 10 (2016), 755–774.",
      "doi": ""
    },
    {
      "text": "Kristin Neidlinger, Colin Willson, Khiet P. Truong, Hermie Hermens, and Vanessa Evers. 2018. Nanogami: The Microbiome Expanded. Speak Your Truth. Listen to Your Gut.. In Proceedings of the 2018 ACM International Symposium on Wearable Computers (Singapore, Singapore) (ISWC ’18). Association for Computing Machinery, New York, NY, USA, 295–300. https://doi.org/10.1145/3267242.3267296",
      "doi": "10.1145/3267242.3267296"
    },
    {
      "text": "Audrey Ng. 2017. Grown Microbial 3D Fiber Art, Ava: Fusion of Traditional Art with Technology. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (Maui, Hawaii) (ISWC ’17). Association for Computing Machinery, New York, NY, USA, 209–214. https://doi.org/10.1145/3123021.3123069",
      "doi": "10.1145/3123021.3123069"
    },
    {
      "text": "Wasabii Ng, Bahareh Barati, and Elvin Karana. 2022. Healing with Fungi: Unique Aesthetic Expressions for Mycelium-Based Materials Through Patch and Mend. In Congress of the International Association of Societies of Design Research. Springer, Singapore, 3253–3267.",
      "doi": ""
    },
    {
      "text": "Netta Ofer, Fiona Bell, and Mirela Alistar. 2021. Designing Direct Interactions with Bioluminescent Algae. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 1230–1241. https://doi.org/10.1145/3461778.3462090",
      "doi": "10.1145/3461778.3462090"
    },
    {
      "text": "Maureen O’Malley. 2014. Philosophy of microbiology. Cambridge University Press, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Maureen A O’Malley. 2016. Microbiology, philosophy and education. FEMS microbiology letters 363, 17 (2016), 1–269.",
      "doi": ""
    },
    {
      "text": "Dilan Ozkan, Martyn Dade-Robertson, Ruth Morrow, and Meng Zhang. 2021. Designing a Living Material Through Bio-Digital-Fabrication: Guiding the growth of fungi through a robotic system. Education and Research in Computer Aided Architectural Design in Europe (eCAADe) 1(2021), 77–84.",
      "doi": ""
    },
    {
      "text": "Patrizia Paci, Clara Mancini, and Blaine A. Price. 2017. The Role of Ethological Observation for Measuring Animal Reactions to Biotelemetry Devices. In Proceedings of the Fourth International Conference on Animal-Computer Interaction (Milton Keynes, United Kingdom) (ACI2017). Association for Computing Machinery, New York, NY, USA, Article 5, 12 pages. https://doi.org/10.1145/3152130.3152144",
      "doi": "10.1145/3152130.3152144"
    },
    {
      "text": "Muriel Pacton, Georges E Gorin, and Crisogono Vasconcelos. 2011. Amorphous organic matter—Experimental data on formation and the role of microbes. Review of Palaeobotany and Palynology 166, 3-4 (2011), 253–267.",
      "doi": ""
    },
    {
      "text": "Amanda Parkes and Connor Dickie. 2013. A Biological Imperative for Interaction Design. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 2209–2218. https://doi.org/10.1145/2468356.2468742",
      "doi": "10.1145/2468356.2468742"
    },
    {
      "text": "Pat Pataranutaporn, Jaime Sanchez De La Vega, Abhik Chowdhury, Audrey Ng, and Galina Mihaleva. 2018. Toward growable robot: Exploring and integrating flexible–Biological matter with electronics. In 2018 International Flexible Electronics Technology Conference (IFETC). IEEE, Ottawa, ON, Canada, 1–4.",
      "doi": ""
    },
    {
      "text": "Pat Pataranutaporn, Todd Ingalls, and Ed Finn. 2018. Biological HCI: Towards Integrative Interfaces Between People, Computer, and Biological Materials. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188662",
      "doi": "10.1145/3170427.3188662"
    },
    {
      "text": "Pat Pataranutaporn, Angela Vujic, David S. Kong, Pattie Maes, and Misha Sra. 2020. Living Bits: Opportunities and Challenges for Integrating Living Microorganisms in Human-Computer Interaction. In Proceedings of the Augmented Humans International Conference (Kaiserslautern, Germany) (AHs ’20). Association for Computing Machinery, New York, NY, USA, Article 30, 12 pages. https://doi.org/10.1145/3384657.3384783",
      "doi": "10.1145/3384657.3384783"
    },
    {
      "text": "Ida Nilstad Pettersen, Hanne Cecilie Geirbo, and Hanne Johnsrud. 2018. The Tree as Method: Co-Creating with Urban Ecosystems. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial - Volume 2 (Hasselt and Genk, Belgium) (PDC ’18). Association for Computing Machinery, New York, NY, USA, Article 21, 6 pages. https://doi.org/10.1145/3210604.3210653",
      "doi": "10.1145/3210604.3210653"
    },
    {
      "text": "Ingmar H Riedel-Kruse, Alice M Chung, Burak Dura, Andrea L Hamilton, and Byung C Lee. 2011. Design, engineering and utility of biotic games. Lab on a Chip 11, 1 (2011), 14–22.",
      "doi": ""
    },
    {
      "text": "Anthony Rowe. 2018. Creativity, Technology and Collaboration Towards Hoped-for and Unexpected Serendipities. In Explorations in Art and Technology. Springer, London, 333–340.",
      "doi": ""
    },
    {
      "text": "Luisa Ruge, Elizabeth Cox, Clara Mancini, and Rachael Luck. 2018. User Centered Design Approaches to Measuring Canine Behavior: Tail Wagging as a Measure of User Experience. In Proceedings of the Fifth International Conference on Animal-Computer Interaction (Atlanta, Georgia, USA) (ACI ’18). Association for Computing Machinery, New York, NY, USA, Article 1, 12 pages. https://doi.org/10.1145/3295598.3295599",
      "doi": "10.1145/3295598.3295599"
    },
    {
      "text": "Michael Sedbon. 2018. C t r l. michaelsedbon.com. Retrieved September 11, 2022 from https://michaelsedbon.com/C-t-r-l",
      "doi": ""
    },
    {
      "text": "Michael Sedbon. 2019. CMD: Experiment in Bio Algorithmic Politics. michaelsedbon.com. Retrieved September 11, 2022 from https://michaelsedbon.com/CMD",
      "doi": ""
    },
    {
      "text": "Olivia Seow, Cedric Honnet, Simon Perrault, and Hiroshi Ishii. 2022. Pudica: A Framework For Designing Augmented Human-Flora Interaction. In Augmented Humans 2022 (Kashiwa, Chiba, Japan) (AHs 2022). Association for Computing Machinery, New York, NY, USA, 40–45. https://doi.org/10.1145/3519391.3519394",
      "doi": "10.1145/3519391.3519394"
    },
    {
      "text": "Rasa Smite and Raitis Smits. 2017. Fluctuations of Microworlds. smitesmits.com. Retrieved August 17, 2022 from http://smitesmits.com/FluctuationsOfMicroworlds.html",
      "doi": ""
    },
    {
      "text": "Lydia Stamato, Erin Higgins, Hasan Mahmud Prottoy, S Asgarali-Hoffman, Lisa Scheifele, Linda Dusman, Tagide deCarvalho, Teresa Ascencao, and Foad Hamidi. 2022. Raaz: A Transdisciplinary Exploration at the Intersection of Bioart, HCI, and Community Engagement. Frontiers in Computer Science 4 (2022), 25.",
      "doi": ""
    },
    {
      "text": "Prophecy Sun, Freya Zinovieff, and Gabriela Aceves-Sepulveda. 2019. Mothering Bacteria: A Speculative Forecast of the Body as an Interface. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C&C ’19). Association for Computing Machinery, New York, NY, USA, 455–460. https://doi.org/10.1145/3325480.3329173",
      "doi": "10.1145/3325480.3329173"
    },
    {
      "text": "Kenneth Timmis, Ricardo Cavicchioli, José Luis Garcia, Balbina Nogales, Max Chavarría, Lisa Stein, Terry J McGenity, Nicole Webster, Brajesh K Singh, Jo Handelsman, 2019. The urgent need for microbiology literacy in society. Environmental microbiology 21, 5 (2019), 1513–1528.",
      "doi": ""
    },
    {
      "text": "Anukool Vaishnav, Jagajjit Sahu, and Harikesh B Singh. 2020. Genomics of extremophiles for sustainable agriculture and biotechnological applications (Part I). Current Genomics 21, 2 (2020), 78.",
      "doi": ""
    },
    {
      "text": "Eldy S. Lazaro Vasquez and Katia Vega. 2019. From Plastic to Biomaterials: Prototyping DIY Electronics with Mycelium. In Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers (London, United Kingdom) (UbiComp/ISWC ’19 Adjunct). Association for Computing Machinery, New York, NY, USA, 308–311. https://doi.org/10.1145/3341162.3343808",
      "doi": "10.1145/3341162.3343808"
    },
    {
      "text": "Eldy S. Lazaro Vasquez and Katia Vega. 2019. Myco-Accessories: Sustainable Wearables with Biodegradable Materials. In Proceedings of the 23rd International Symposium on Wearable Computers (London, United Kingdom) (ISWC ’19). Association for Computing Machinery, New York, NY, USA, 306–311. https://doi.org/10.1145/3341163.3346938",
      "doi": "10.1145/3341163.3346938"
    },
    {
      "text": "Peter Washington, Karina G. Samuel-Gama, Shirish Goyal, Ashwin Ramaswami, and Ingmar H. Riedel-Kruse. 2018. Prototyping Biotic Games and Interactive Experiments with JavaScript. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3170427.3186510",
      "doi": "10.1145/3170427.3186510"
    },
    {
      "text": "westlab.com 2022. What magnification do I need to see bacteria?westlab.com. Retrieved September 8, 2022 from https://www.westlab.com/",
      "doi": ""
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. BioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2702123.2702611",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Cui Zhang, Han Gao, Zhenke Yang, Yuanyuan Jiang, Zhenkui Li, Xu Wang, Bo Xiao, Xin-zhuan Su, Huiting Cui, and Jing Yuan. 2017. CRISPR/Cas9 mediated sequential editing of genes critical for ookinete motility in Plasmodium yoelii. Molecular and biochemical parasitology 212 (2017), 1–8.",
      "doi": ""
    },
    {
      "text": "Jing Zhao, Huan Fang, and Dawei Zhang. 2020. Expanding application of CRISPR-Cas9 system in microorganisms. Synthetic and systems biotechnology 5, 4 (2020), 269–276.",
      "doi": ""
    },
    {
      "text": "Jiwei Zhou, Bahareh Barati, Elisa Giaccardi, and Elvin Karana. 2022. Habitabilities of living artefacts: A taxonomy of digital tools for biodesign. International Journal of Design 16, 2 (2022), 57–73.",
      "doi": ""
    }
  ]
}