{
  "doi": "10.1145/3544548.3581542",
  "title": "Understanding Journalists’ Workflows in News Curation",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "With the increasing dominance of internet as a source of news consumption, there has been a rise in the production and popularity of email newsletters compiled by individual journalists. However, there is little research on the processes of aggregation, and how these differ between expert journalists and trained machines. In this paper, we interviewed journalists who curate newsletters from around the world. Through an in-depth understanding of journalists’ workflows, our findings lay out the role of their prior experience in the value they bring into the curation process, their own use of algorithms in finding stories for their newsletter, and their internalization of their readers’ interests and the context they are curating for. While identifying the role of human expertise, we highlight the importance of hybrid curation and provide design insights on how technology can support the work of these experts.",
  "authors": [
    {
      "name": "Shubham Atreja",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659060491",
      "orcid": "0000-0002-0056-3060"
    },
    {
      "name": "Shruthi Srinath",
      "institution": "Microsoft Research, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782753",
      "orcid": "0000-0002-5651-4778"
    },
    {
      "name": "Mohit Jain",
      "institution": "Microsoft Research, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659887025",
      "orcid": "0000-0002-7106-164X"
    },
    {
      "name": "Joyojeet Pal",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100249207",
      "orcid": "0000-0002-9076-2046"
    }
  ],
  "references": [
    {
      "text": "Tanja Aitamurto, Mike Ananny, Chris W Anderson, Larry Birnbaum, Nicholas Diakopoulos, Matilda Hanson, Jessica Hullman, and Nick Ritchie. 2019. HCI for accurate, impartial and transparent journalism: Challenges and solutions. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290607.3299007"
    },
    {
      "text": "Jack Bandy and Nicholas Diakopoulos. 2020. Auditing News Curation Systems: A Case Study Examining Algorithmic and Editorial Logic in Apple News. Proceedings of the International AAAI Conference on Web and Social Media 14 (May 2020), 36–47.",
      "doi": ""
    },
    {
      "text": "Jack Bandy and Nicholas Diakopoulos. 2021. More Accounts, Fewer Links: How Algorithmic Curation Impacts Media Exposure in Twitter Timelines. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1 (Apr 2021), 78:1–78:28. https://doi.org/10.1145/3449152",
      "doi": "10.1145/3449152"
    },
    {
      "text": "Frank Bentley, Katie Quehl, Jordan Wirfs-Brock, and Melissa Bica. 2019. Understanding Online News Behaviors. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300820",
      "doi": "10.1145/3290605.3300820"
    },
    {
      "text": "Microsoft Bing. [Accessed 12-Sep-2022]. Bing Webmaster Tools. https://www.bing.com/webmasters/help/webmaster-guidelines-30fba23a.",
      "doi": ""
    },
    {
      "text": "Jacob Bogage. 2020. Reporters are leaving newsrooms for newsletters, their own mini media empire. https://www.washingtonpost.com/business/2020/07/24/substack-email-newsletter-journalism/.",
      "doi": ""
    },
    {
      "text": "Marc Bourreau. 2003. Mimicking vs. counter-programming strategies for television programs. Information Economics and Policy 15, 1 (2003), 35–54.",
      "doi": ""
    },
    {
      "text": "Taina Bucher. 2017. ‘Machines don’t have instincts’: Articulating the computational in journalism. New Media & Society 19, 6 (2017), 918–933.",
      "doi": ""
    },
    {
      "text": "Björn Burscher, Daan Odijk, Rens Vliegenthart, Maarten De Rijke, and Claes H De Vreese. 2014. Teaching the computer to code frames in news: Comparing two supervised machine learning approaches to frame analysis. Communication Methods and Measures 8, 3 (2014), 190–206.",
      "doi": ""
    },
    {
      "text": "Matt Carlson. 2018. Automating judgment? Algorithmic judgment, news knowledge, and journalistic professionalism. New media & society 20, 5 (2018), 1755–1772.",
      "doi": ""
    },
    {
      "text": "Abhijnan Chakraborty, Saptarshi Ghosh, Niloy Ganguly, and Krishna P Gummadi. 2015. Can trending news stories create coverage bias? on the impact of high content churn in online news media. In Computation and Journalism Symposium.",
      "doi": ""
    },
    {
      "text": "Sarah Cohen, James T Hamilton, and Fred Turner. 2011. Computational journalism. Commun. ACM 54, 10 (2011), 66–71.",
      "doi": "10.1145/2001269.2001288"
    },
    {
      "text": "Xi Cui and Yu Liu. 2017. How does online news curate linked sources? A content analysis of three online news media. Journalism 18, 7 (2017), 852–870.",
      "doi": ""
    },
    {
      "text": "Samuel Danzon-Chambaud. 2022. The Tow Center newsletter: experimenting with automated news at the BBC. https://www.cjr.org/tow_center/the-tow-center-newsletter-experimenting-with-automated-news-at-the-bbc.php.",
      "doi": ""
    },
    {
      "text": "Michael A DeVito. 2017. From editors to algorithms: A values-based approach to understanding story selection in the Facebook news feed. Digital journalism 5, 6 (2017), 753–773.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos. 2019. 5. Digital Paperboys: Algorithms in News Distribution. In Automating the News. Harvard University Press, 177–203.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos. 2019. Automating the news. In Automating the News. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos. 2019. Towards a Design Orientation on Algorithms and Automation in News Production. Digital Journalism 7, 8 (Sep 2019), 1180–1184. https://doi.org/10.1080/21670811.2019.1682938",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos. 2020. Computational News Discovery: Towards Design Considerations for Editorial Orientation Algorithms in Journalism. Digital Journalism 8, 7 (Aug 2020), 945–967. https://doi.org/10.1080/21670811.2020.1736946",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos, Daniel Trielli, and Grace Lee. 2021. Towards Understanding and Supporting Journalistic Practices Using Semi-Automated News Discovery Tools. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2 (Oct 2021), 1–30. https://doi.org/10.1145/3479550",
      "doi": "10.1145/3479550"
    },
    {
      "text": "Jen Doll. 2021. Substackers are making serious money in the newsletter game. https://fortune.com/2021/10/07/substack-writers-newsletters-how-much-money-do-they-make/.",
      "doi": ""
    },
    {
      "text": "Robert M Entman. 1993. Framing: Towards clarification of a fractured paradigm. McQuail’s reader in mass communication theory 390 (1993), 397.",
      "doi": ""
    },
    {
      "text": "Martin Flintham, Christian Karner, Khaled Bachour, Helen Creswick, Neha Gupta, and Stuart Moran. 2018. Falling for Fake News: Investigating the Consumption of News via Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173950",
      "doi": "10.1145/3173574.3173950"
    },
    {
      "text": "Tarleton Gillespie. 2014. The relevance of algorithms. Media technologies: Essays on communication, materiality, and society 167, 2014(2014), 167.",
      "doi": ""
    },
    {
      "text": "BG Glaser. 1978. Theoretical Sensitivity: Advances in the Methodology of Grounded Theory.",
      "doi": ""
    },
    {
      "text": "Google. 2019. What site owners should know about Google’s core updates Google Search Central Blog Google Developers. https://developers.google.com/search/blog/2019/08/core-updates.",
      "doi": ""
    },
    {
      "text": "Google. Accessed 1-Aug-2022. An overview of our rater guidelines for Search. https://blog.google/products/search/overview-our-rater-guidelines-search/.",
      "doi": ""
    },
    {
      "text": "Google. Accessed 12-Sep-2022. Google News policies - Publisher Center Help. https://support.google.com/news/publisher-center/answer/6204050?hl=en.",
      "doi": ""
    },
    {
      "text": "Google. Accessed 12-Sep-2022. Show up in Google News - Publisher Center Help. https://support.google.com/news/publisher-center/answer/9607025?hl=en.",
      "doi": ""
    },
    {
      "text": "Mario Haim, Andreas Graefe, and Hans-Bernd Brosius. 2018. Burst of the filter bubble? Effects of personalization on the diversity of Google News. Digital journalism 6, 3 (2018), 330–343.",
      "doi": ""
    },
    {
      "text": "Tony Harcup and Deirdre O’neill. 2001. What is news? Galtung and Ruge revisited. Journalism studies 2, 2 (2001), 261–280.",
      "doi": ""
    },
    {
      "text": "Tony Harcup and Deirdre ONeill. 2017. What is News?Journalism Studies 18, 12 (Dec 2017), 1470–1488. https://doi.org/10.1080/1461670X.2016.1150193",
      "doi": ""
    },
    {
      "text": "Jonathan Hendrickx, Karen Donders, and Ike Picone. 2020. Innovating journalism by going back in time? The curious case of newsletters as a news source in Belgium. In Journalistic metamorphosis. Springer, 57–68.",
      "doi": ""
    },
    {
      "text": "Allegra Hobbs. 2021. Substack and the Newsletter Boom: When Does a Platform Become a Publisher?In SAGE Business Cases. SAGE Publications: SAGE Business Cases Originals.",
      "doi": ""
    },
    {
      "text": "Adil Imad Eddine Hosni and Kan Li. 2020. Minimizing the influence of rumors during breaking news events in online social networks. Knowledge-Based Systems 193 (2020), 105452.",
      "doi": "10.1016/j.knosys.2019.105452"
    },
    {
      "text": "Anita Howarth. 2015. Exploring a curatorial turn in journalism. M/C Journal 18, 4 (2015).",
      "doi": ""
    },
    {
      "text": "Google News Initiatives. Accessed 12-Sep-2022. Surfacing useful and relevant content – How News Works. https://newsinitiative.withgoogle.com/hownewsworks/approach/surfacing-useful-and-relevant-content/.",
      "doi": ""
    },
    {
      "text": "Priyanka Kalra and Mark Boukes. 2021. Curbing journalistic gender bias: How activating awareness of gender bias in Indian journalists affects their reporting. Journalism Practice 15, 5 (2021), 651–668.",
      "doi": ""
    },
    {
      "text": "Mozhgan Karimi, Dietmar Jannach, and Michael Jugovac. 2018. News recommender systems–Survey and roads ahead. Information Processing & Management 54, 6 (2018), 1203–1227.",
      "doi": ""
    },
    {
      "text": "Anna Sophie Kümpel, Veronika Karnowski, and Till Keyling. 2015. News sharing in social media: A review of current research on news sharing users, content, and networks. Social media+ society 1, 2 (2015), 2056305115610141.",
      "doi": ""
    },
    {
      "text": "Seth C Lewis and Oscar Westlund. 2015. Actors, actants, audiences, and activities in cross-media news work: A matrix and a research agenda. Digital journalism 3, 1 (2015), 19–37.",
      "doi": ""
    },
    {
      "text": "Katerina Eva Matsa Mason Walker. 2021. News Consumption Across Social Media in 2021. https://www.pewresearch.org/journalism/2021/09/20/news-consumption-across-social-media-in-2021/.",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam and Robin S Grenier. 2019. Qualitative research in practice: Examples for discussion and analysis. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Robinson Meyer. 2016. How many stories do newspapers publish per day. The Atlantic 26(2016).",
      "doi": ""
    },
    {
      "text": "Logan Molyneux and Shannon C McGregor. 2022. Legitimating a platform: Evidence of journalists’ role in transferring authority to Twitter. Information, Communication & Society 25, 11 (2022), 1577–1595.",
      "doi": ""
    },
    {
      "text": "Mike Murphy. 2016. After replacing human editors with an algorithm, Facebook ended up with a fake Trending news story. https://qz.com/769002/after-replacing-human-editors-with-an-algorithm-facebook-ended-up-with-a-fake-trending-news-story/.",
      "doi": ""
    },
    {
      "text": "Efrat Nechushtai and Seth C Lewis. 2019. What kind of news gatekeepers do we want machines to be? Filter bubbles, fragmentation, and the normative dimensions of algorithmic recommendations. Computers in Human Behavior 90 (2019), 298–307.",
      "doi": ""
    },
    {
      "text": "Nic Newman, Richard Fletcher, Craig T Robertson, Kirsten Eddy, and Rasmus Kleis Nielsen. 2022. Reuters Institute Digital News Report 2022. Reuters Institute (2022), 164.",
      "doi": ""
    },
    {
      "text": "Tom Nicholls and Pepper D Culpepper. 2021. Computational identification of media frames: Strengths, weaknesses, and opportunities. Political Communication 38, 1-2 (2021), 159–181.",
      "doi": ""
    },
    {
      "text": "Dimitar Nikolov, Mounia Lalmas, Alessandro Flammini, and Filippo Menczer. 2019. Quantifying biases in online information exposure. Journal of the Association for Information Science and Technology 70, 3(2019), 218–229.",
      "doi": "10.1002/asi.24121"
    },
    {
      "text": "NYTimes. [Accessed 1-Sep-2022]. What is News Curation?https://nytlicensing.com/latest/methods/what-is-news-curation/.",
      "doi": ""
    },
    {
      "text": "Changhoon Oh, Jinhan Choi, Sungwoo Lee, SoHyun Park, Daeryong Kim, Jungwoo Song, Dongwhan Kim, Joonhwan Lee, and Bongwon Suh. 2020. Understanding User Perception of Automated News Generation System. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376811",
      "doi": "10.1145/3313831.3376811"
    },
    {
      "text": "Jane O’Boyle and Carol J Pardun. 2021. How Twitter drives the global news agenda: Tweets from Brazil, Russia, India, China, the UK and US and online discourse about the 2016 US presidential Election. Global Media and Communication 17, 3 (2021), 363–384.",
      "doi": ""
    },
    {
      "text": "Shaina Raza and Chen Ding. 2021. News recommender system: a review of recent progress, challenges, and opportunities. Artificial Intelligence Review(2021), 1–52.",
      "doi": ""
    },
    {
      "text": "Christine Schmidt. 2019. From newsroom to newsletter: How local journalists are DIYing important coverage via email. https://www.niemanlab.org/2019/10/from-newsroom-to-newsletter-how-local-journalists-are-diying-important-coverage-via-email/.",
      "doi": ""
    },
    {
      "text": "Sarah Scire. 2021. The New York Times is making about a third of its newsletters subscriber-only — niemanlab.org. https://www.niemanlab.org/2021/08/the-new-york-times-is-making-about-a-third-of-its-newsletters-subscriber-only/.",
      "doi": ""
    },
    {
      "text": "Natalee Seely and Mary Spillman. 2021. Email Newsletters: An Analysis of Content From Nine Top News Organizations. Electronic News 15, 3-4 (2021), 123–138.",
      "doi": ""
    },
    {
      "text": "Elisa Shearer and Elizabeth Grieco. 2019. Americans are wary of the role social media sites play in delivering the news. Pew Research Center 2(2019).",
      "doi": ""
    },
    {
      "text": "Rashi Shrivastava. 2022. The role of newsletters in the future of independent journalism. (2022).",
      "doi": ""
    },
    {
      "text": "Isabella Simonetti. 2022. Over 360 newspapers have closed since just before the start of the pandemic.https://www.nytimes.com/2022/06/29/business/media/local-newspapers-pandemic.html.",
      "doi": ""
    },
    {
      "text": "C. Estelle Smith, Xinyi Wang, Raghav Pavan Karumur, and Haiyi Zhu. 2018. [Un]breaking News: Design Opportunities for Enhancing Collaboration in Scientific Media Production. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173955",
      "doi": "10.1145/3173574.3173955"
    },
    {
      "text": "Daniel Smullen. 2022. Avoid These 6 Common Google News Optimization Mistakes — searchenginejournal.com. https://www.searchenginejournal.com/google-news-optimization-mistakes/448539/.",
      "doi": ""
    },
    {
      "text": "Kalpathy Ramaiyer Subramanian. 2018. Myth and mystery of shrinking attention span. International Journal of Trend in Research and Development 5, 1(2018).",
      "doi": ""
    },
    {
      "text": "Kjerstin Thorson and Chris Wells. 2016. Curated flows: A framework for mapping media exposure in the digital age. Communication Theory 26, 3 (2016), 309–328.",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Rob Procter, David William Randall, Mark Rouncefield, Christian Burger, Geraldine Wong Sak Hoi, Arkaitz Zubiaga, and Maria Liakata. 2017. Supporting the Use of User Generated Content in Journalistic Practice. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI’17). Association for Computing Machinery, New York, NY, USA, 3632–3644. https://doi.org/10.1145/3025453.3025892",
      "doi": "10.1145/3025453.3025892"
    },
    {
      "text": "Daniel Trielli and Nicholas Diakopoulos. 2019. Search as news curator: The role of Google in shaping attention to news information. In Proceedings of the 2019 CHI Conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3290605.3300683"
    },
    {
      "text": "Julian Wallace. 2018. Modelling contemporary gatekeeping: The rise of individuals, algorithms and platforms in digital news dissemination. Digital Journalism 6, 3 (2018), 274–293.",
      "doi": ""
    },
    {
      "text": "Dror Walter and Yotam Ophir. 2019. News frame analysis: An inductive mixed-method computational approach. Communication Methods and Measures 13, 4 (2019), 248–266.",
      "doi": ""
    },
    {
      "text": "Yixue Wang and Nicholas Diakopoulos. 2021. Journalistic Source Discovery: Supporting The Identification of News Sources in User Generated Content. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3411764.3445266",
      "doi": "10.1145/3411764.3445266"
    },
    {
      "text": "Jim Waterson. 2020. Microsoft sacks journalists to replace them with robots. https://www.theguardian.com/technology/2020/may/30/microsoft-sacks-journalists-to-replace-them-with-robots.",
      "doi": ""
    },
    {
      "text": "Amy Watson. 2022. Leading news websites U.S. by monthly visits 2022. https://www.statista.com/statistics/381569/leading-news-and-media-sites-usa-by-share-of-visits/.",
      "doi": ""
    },
    {
      "text": "Amy Watson. 2022. Trust in news media in the U.S. 2022 | Statista. https://www.statista.com/statistics/255891/trust-in-types-of-news-media-in-the-us/.",
      "doi": ""
    }
  ]
}