{
  "doi": "10.1145/3544548.3580674",
  "title": "Exploring the digital support needs of caregivers of people with serious mental illness",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "In low-and middle-income countries like India, people with severe mental illness (PSMI) rely on their families as a primary source of care, given the lack of support from healthcare systems. The demanding nature of caregiving places significant physical and mental demands on caregivers, who are the primary source of support to PSMI. We explore how caregivers in under-resourced settings can be better supported through everyday digital technologies. We conducted interviews with caregivers (from urban and rural India), as well as workshops with professionals from Indian NGOs that work directly with PSMIs. We found that technology has the potential to (1) provide carer-centred support that empowers carers who experience stigma and issues with existing support networks; (2) provide support for carers to overcome barriers and progress in the recovery of the PSMI. We conclude with design considerations, proposing how an online peer community can leverage carers’ expertise to actualise support provision.",
  "authors": [
    {
      "name": "Farheen Siddiqui",
      "institution": "Action Lab, Monash University, Australia",
      "img": "/do/10.1145/contrib-99660782682/rel-imgonly/screen_shot_2023-04-29_at_3.59.02_pm.png",
      "acmid": "99660782682",
      "orcid": "0000-0003-3073-4446"
    },
    {
      "name": "Delvin Varghese",
      "institution": "Action Lab, Monash University, Australia",
      "img": "/do/10.1145/contrib-99659153172/rel-imgonly/picked_img_0051_cw.jpg",
      "acmid": "99659153172",
      "orcid": "0000-0002-7806-1001"
    },
    {
      "name": "Pushpendra Singh",
      "institution": "IIIT-Delhi, India",
      "img": "/do/10.1145/contrib-81309502140/rel-imgonly/psingh.jpg",
      "acmid": "81309502140",
      "orcid": "0000-0003-2152-1027"
    },
    {
      "name": "Sunita Bapuji Bayyavarapu",
      "institution": "Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778208",
      "orcid": "0000-0002-1438-3589"
    },
    {
      "name": "Stephen Lindsay",
      "institution": "Computing Science, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384616016",
      "orcid": "0000-0001-6063-3676"
    },
    {
      "name": "Dharshani Chandrasekara",
      "institution": "Action Lab, Faculty of Information Technology, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782159",
      "orcid": "0000-0002-7667-9828"
    },
    {
      "name": "Pranav Kulkarni",
      "institution": "Action Lab, Faculty of IT, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238509",
      "orcid": "0000-0001-5544-5515"
    },
    {
      "name": "Ling Wu",
      "institution": "Action Lab, Human-Centred Computing, Faculty of IT, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660481899",
      "orcid": "0000-0001-5406-6927"
    },
    {
      "name": "Taghreed Alshehri",
      "institution": "Taif University, Saudi Arabia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527367",
      "orcid": "0000-0002-6075-8652"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Action Lab, Monash University, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Ebtisam Alabdulqader, Katy Stockwell, Kyle Montague, Dan Jackson, Andrew Monk, Lindsay Pennington, Roisin McNaney, Stephen Lindsay, Ling Wu, and Patrick Olivier. 2022. Understanding the Therapeutic Coaching Needs of Mothers of Children with Cerebral Palsy. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 1788–1801. https://doi.org/10.1145/3532106.3533576",
      "doi": "10.1145/3532106.3533576"
    },
    {
      "text": "Lilas Ali, Barbro Krevers, Nils Sjöström, and Ingela Skärsäter. 2014. Effectiveness of web-based versus folder support interventions for young informal carers of persons with mental illness: a randomized controlled trial. Patient Education and Counseling 94, 3 (2014), 362–371. https://doi.org/10.1016/j.pec.2013.10.020",
      "doi": ""
    },
    {
      "text": "G. Andersson, J. Bergström, P. Carlbring, and N. Lindefors. 2005. The use of the Internet in the treatment of anxiety disorders. Curr Opin Psychiatry 18, 1 (2005), 73–7.",
      "doi": ""
    },
    {
      "text": "Kelly A. Aschbrenner, John A. Naslund, Laura K. Barre, Kim T. Mueser, Allison Kinney, and Stephen J. Bartels. 2015. Peer health coaching for overweight and obese individuals with serious mental illness: intervention development and initial feasibility study. Translational behavioral medicine 5, 3 (2015), 277–284. https://doi.org/10.1007%2Fs13142-015-0313-4",
      "doi": ""
    },
    {
      "text": "Madhumitha Balaji, Sudipto Chatterjee, Beth Brennan, Thara Rangaswamy, Graham Thornicroft, and Vikram Patel. 2012. Outcomes that matter: A qualitative study with persons with schizophrenia and their primary caregivers in India. Asian Journal of Psychiatry 5, 3 (2012), 258–265. https://doi.org/10.1016/j.ajp.2012.06.002",
      "doi": ""
    },
    {
      "text": "[6] Hrishikesh Ballal.2015. Collaborative planning with digital design synthesis. Thesis.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2022. Conceptual and design thinking for thematic analysis.Qualitative Psychology 9, 1 (2022), 3.",
      "doi": ""
    },
    {
      "text": "Tony Buzan and Susanna Abbott. 2006. The ultimate book of mind maps: unlock your creativity, boost your memory, change your life. HarperCollins UK.",
      "doi": ""
    },
    {
      "text": "SOS Children’s Villages Canada. 2018. Poverty in India: Facts and Figures on the Daily Struggle for Survival. Retrieved Sep 14, 2022 from https://www.soschildrensvillages.ca/news/poverty-in-india-602",
      "doi": ""
    },
    {
      "text": "Alejandra Caqueo-Urízar, José Gutiérrez-Maldonado, and Claudia Miranda-Castillo. 2009. Quality of life in caregivers of patients with schizophrenia: a literature review. Health and quality of life outcomes 7, 1 (2009), 1–5.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Tanushree Mitra, and Munmun De Choudhury. 2016. Recovery Amid Pro-Anorexia: Analysis of Recovery in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2111–2123. https://doi.org/10.1145/2858036.2858246",
      "doi": "10.1145/2858036.2858246"
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Park. 2013. Caring for caregivers: Designing for integrality. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, 91–102. https://doi.org/10.1145/2441776.2441789",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Sarah Clement, Manuela Jarrett, Claire Henderson, and Graham Thornicroft. 2010. Messages to use in population-level campaigns to reduce mental health-related stigma: consensus development study. Epidemiology and Psychiatric Sciences 19, 1 (2010), 72–79. https://doi.org/10.1017/S1121189X00001627",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Peter Roessler, Brett Shelton, Anthony LaMarca, Bill Schilit, and Sara Bly. 2004. Technology for care networks of elders. Pervasive Computing, IEEE 3 (05 2004), 22– 29. https://doi.org/10.1109/MPRV.2004.1316814",
      "doi": "10.1109/MPRV.2004.1316814"
    },
    {
      "text": "P. W. Corrigan. 2006. Impact of consumer-operated services on empowerment and recovery of people with psychiatric disabilities. Psychiatr Serv 57, 10 (2006), 1493–6. https://doi.org/10.1176/ps.2006.57.10.1493",
      "doi": ""
    },
    {
      "text": "Patrick W Corrigan, Amy C Watson, and Frederick E Miller. 2006. Blame, shame, and contamination: the impact of mental illness and drug dependence stigma on family members. Journal of family psychology 20, 2 (2006), 239. https://doi.org/10.1037/0893-3200.20.2.239",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A Pool of Dreams: Facebook, Politics and the Emergence of a Social Movement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3573–3582. https://doi.org/10.1145/2556288.2557100",
      "doi": "10.1145/2556288.2557100"
    },
    {
      "text": "Alieske EH Dam, Martin PJ Van Boxtel, Nico Rozendaal, Frans RJ Verhey, and Marjolein E de Vugt. 2017. Development and feasibility of Inlife: a pilot study of an online social support intervention for informal caregivers of people with dementia. PLoS One 12, 9 (2017), e0183386. https://doi.org/10.1371/journal.pone.0183386",
      "doi": ""
    },
    {
      "text": "Larry Davidson, Matthew Chinman, David Sells, and Michael Rowe. 2006. Peer Support Among Adults With Serious Mental Illness: A Report From the Field. Schizophrenia Bulletin 32, 3 (2006), 443–450. https://doi.org/10.1093/schbul/sbj043",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury. 2015. Anorexia on Tumblr: A Characterization Study. In Proceedings of the 5th International Conference on Digital Health 2015 (Florence, Italy) (DH ’15). Association for Computing Machinery, New York, NY, USA, 43–50. https://doi.org/10.1145/2750511.2750515",
      "doi": "10.1145/2750511.2750515"
    },
    {
      "text": "Patricia Deegan. 1996. Recovery as a journey of the heart. Psychiatric rehabilitation journal 19, 3 (1996), 91. https://doi.org/doi/10.1037/h0101301",
      "doi": ""
    },
    {
      "text": "P. M. Emmelkamp. 2005. Technological innovations in clinical assessment and psychotherapy. Psychother Psychosom 74, 6 (2005), 336–43. https://doi.org/10.1159/000087780",
      "doi": ""
    },
    {
      "text": "Sara Evans-Lacko, Emilie Courtin, Aandrea Fiorillo, Martin Knapp, Mario Luciano, A-L Park, M Brunn, S Byford, K Chevreul, and AK Forsman. 2014. The state of the art in European research on reducing social exclusion and stigma related to mental health: a systematic mapping of the literature. European Psychiatry 29, 6 (2014), 381–389. https://doi.org/10.1016/j.eurpsy.2014.02.007",
      "doi": ""
    },
    {
      "text": "Karen L. Fortuna, Jessica M. Brooks, Emre Umucu, Robert Walker, and Phillip I. Chow. 2019. Peer Support: a Human Factor to Enhance Engagement in Digital Health Behavior Change Interventions. Journal of Technology in Behavioral Science 4, 2 (2019), 152–161. https://doi.org/10.1007/s41347-019-00105-x",
      "doi": ""
    },
    {
      "text": "Robert Gallienne, Shirley Moore, and Patricia Brennan. 1994. Alzheimer’s caregivers. Psychosocial support via computer networks. Journal of gerontological nursing 19 (01 1994), 15–22. https://doi.org/10.3928/0098-9134-19931201-05",
      "doi": ""
    },
    {
      "text": "H Ganguli. 2000. Epidemiological finding on prevalence of mental disorders in India. Indian journal of psychiatry 42 (01 2000), 14–20.",
      "doi": ""
    },
    {
      "text": "Kabir Garg, C. Naveen Kumar, and Prabha S. Chandra. 2019. Number of psychiatrists in India: Baby steps forward, but a long way to go. Indian journal of psychiatry 61, 1 (2019), 104–105. https://doi.org/10.4103/psychiatry.IndianJPsychiatry_7_18",
      "doi": ""
    },
    {
      "text": "Sobin George. 2015. Health for not all: mapping the discriminated and detached terrains of health services in rural India. J Health Syst 1(2015), 20–26.",
      "doi": ""
    },
    {
      "text": "S. M. Glynn, E. T. Randolph, T. Garrick, and A. Lui. 2010. A proof of concept trial of an online psychoeducational program for relatives of both veterans and civilians living with schizophrenia. Psychiatr Rehabil J 33, 4 (2010), 278–87. https://doi.org/10.2975/33.4.2010.278.287",
      "doi": ""
    },
    {
      "text": "Nitin Gogtay, Nora S. Vyas, Renee Testa, Stephen J. Wood, and Christos Pantelis. 2011. Age of Onset of Schizophrenia: Perspectives From Structural Neuroimaging Studies. Schizophrenia Bulletin 37, 3 (2011), 504–513. https://doi.org/10.1093/schbul/sbr030",
      "doi": ""
    },
    {
      "text": "Narayan Gopalkrishnan. 2018. Cultural Diversity and Mental Health: Considerations for Policy and Practice. Frontiers in Public Health 6, 179 (2018). https://doi.org/10.3389/fpubh.2018.00179",
      "doi": ""
    },
    {
      "text": "Hannah Green, Keri Facer, Tim Rudd, Patrick Dillon, and Peter Humphreys. 2005. Personalisation and digital technologies. Bristol: Futurelab (2005).",
      "doi": ""
    },
    {
      "text": "Xinning Gui and Yunan Chen. 2019. Making Healthcare Infrastructure Work: Unpacking the Infrastructuring Work of Individuals. https://doi.org/10.1145/3290605.3300688",
      "doi": "10.1145/3290605.3300688"
    },
    {
      "text": "G Gururaj, N Girish, and MK Isaac. 2005. Mental, neurological and substance abuse disorders: Strategies towards a systems approach. Burden of Disease in India 226 (2005).",
      "doi": ""
    },
    {
      "text": "Shefali Haldar, Sonali R. Mishra, Maher Khelifi, Ari H. Pollack, and Wanda Pratt. 2017. Opportunities and Design Considerations for Peer Support in a Hospital Setting. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 867–879. https://doi.org/10.1145/3025453.3026040",
      "doi": "10.1145/3025453.3026040"
    },
    {
      "text": "Pamela Hamilton. 2016. The Workshop Book: How to design and lead successful workshops. Pearson UK.",
      "doi": ""
    },
    {
      "text": "Andrea L Hartzler, Megan N Taylor, Albert Park, Troy Griffiths, Uba Backonja, David W McDonald, Sam Wahbeh, Cory Brown, and Wanda Pratt. 2016. Leveraging cues from person-generated health data for peer matching in online communities. Journal of the American Medical Informatics Association 23, 3(2016), 496–507. https://doi.org/10.1093/jamia/ocv175",
      "doi": ""
    },
    {
      "text": "Bart Hattink, Franka Meiland, Henriëtte van der Roest, Peter Kevern, Francesca Abiuso, Johan Bengtsson, Angele Giuliano, Annalise Duca, Jennifer Sanders, and Fern Basnett. 2015. Web-based STAR E-learning course increases empathy and understanding in dementia caregivers: results from a randomized controlled trial in the Netherlands and the United Kingdom. Journal of Medical Internet Research 17, 10 (2015), e4025. https://doi.org/10.2196/jmir.4025",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes, Karen G. Cheng, Sen H. Hirano, Karen P. Tang, Marni S. Nagel, and Dianne E. Baker. 2014. Estrellita: A Mobile Capture and Access Tool for the Support of Preterm Infants and Their Caregivers. ACM Trans. Comput.-Hum. Interact. 21, 3 (2014), Article 19. https://doi.org/10.1145/2617574",
      "doi": "10.1145/2617574"
    },
    {
      "text": "N. A. Hazel, M. G. McDonell, R. A. Short, C. M. Berry, W. D. Voss, M. L. Rodgers, and D. G. Dyck. 2004. Impact of multiple-family groups for outpatients with schizophrenia on caregivers’ distress and resources. Psychiatr Serv 55, 1 (2004), 35–41. https://doi.org/10.1176/appi.ps.55.1.35",
      "doi": ""
    },
    {
      "text": "Michele Heisler and John D. Piette. 2005. I Help You, and You Help Me. The Diabetes Educator 31, 6 (2005), 869–879. https://doi.org/10.1177/0145721705283247",
      "doi": ""
    },
    {
      "text": "Md Mahbub Hossain, Neetu Purohit, Abida Sultana, Ping Ma, E Lisako J McKyer, and Helal Uddin Ahmed. 2020. Prevalence of mental disorders in South Asia: An umbrella review of systematic reviews and meta-analyses. Asian Journal of Psychiatry 51 (2020), 102041. https://doi.org/10.1016/j.ajp.2020.102041",
      "doi": ""
    },
    {
      "text": "John A Hughes, Jon O’Brien, Tom Rodden, Mark Rouncefield, and Steve Blythin. 1997. Designing with ethnography: a presentation framework for design. In Proceedings of the 2nd conference on Designing interactive systems: processes, practices, methods, and techniques. 147–158.",
      "doi": "10.1145/263552.263598"
    },
    {
      "text": "KS Jacob. 2015. Recovery model of mental illness: A complementary approach to psychiatric care., 117–119 pages.",
      "doi": ""
    },
    {
      "text": "N. Jacobson and D. Greenley. 2001. What is recovery? A conceptual model and explication. Psychiatr Serv 52, 4 (2001), 482–5. https://doi.org/10.1176/appi.ps.52.4.482",
      "doi": ""
    },
    {
      "text": "Sushrut Jadhav, Roland Littlewood, Andrew G Ryder, Ajita Chakraborty, Sumeet Jain, and Maan Barua. 2007. Stigmatization of severe mental illness in India: Against the simple industrialization hypothesis. Indian Journal of Psychiatry 49, 3 (2007), 189. https://doi.org/10.4103%2F0019-5545.37320",
      "doi": ""
    },
    {
      "text": "Y. Jain and P. Jain. 2018. Communitisation of healthcare: peer support groups for chronic disease care in rural India. Bmj 360(2018), k85. https://doi.org/10.1136/bmj.k85",
      "doi": ""
    },
    {
      "text": "Anthony F Jorm, Lisa J Barney, Helen Christensen, Nicole J Highet, Claire M Kelly, and Betty A Kitchener. 2006. Research on mental health literacy: what we know and what we still need to know. Australian & New Zealand Journal of Psychiatry 40, 1(2006), 3–5. https://doi.org/10.1080%2Fj.1440-1614.2006.01734.x",
      "doi": ""
    },
    {
      "text": "Johannes Jungbauer, Kirsten Stelling, Sandra Dietrich, and Matthias Angermeyer. 2004. Schizophrenia: Problems of separation in families. Journal of advanced nursing 47 (10 2004), 605–13. https://doi.org/10.1111/j.1365-2648.2004.03157.x",
      "doi": ""
    },
    {
      "text": "Bruno Kajiyama, Larry W Thompson, Tamiko Eto-Iwase, Mio Yamashita, John Di Mario, Yuan Marian Tzuang, and Dolores Gallagher-Thompson. 2013. Exploring the effectiveness of an internet-based program for reducing caregiver distress using the iCare Stress Management e-Training Program. Aging & mental health 17, 5 (2013), 544–554.",
      "doi": ""
    },
    {
      "text": "K. Kaplan, M. S. Salzer, P. Solomon, E. Brusilovskiy, and P. Cousounis. 2011. Internet peer support for individuals with psychiatric disabilities: A randomized controlled trial. Soc Sci Med 72, 1 (2011), 54–62. https://doi.org/10.1016/j.socscimed.2010.09.037",
      "doi": ""
    },
    {
      "text": "Alfred H Katz. 1981. Self-help and mutual aid: An emerging social movement?Annual review of sociology(1981), 129–155. https://www.jstor.org/stable/2946025",
      "doi": ""
    },
    {
      "text": "Konstantinos Kazakos, Siddhartha Asthana, Madeline Balaam, Mona Duggal, Amey Holden, Limalemla Jamir, Nanda Kishore Kannuri, Saurabh Kumar, Amarendar Reddy Manindla, Subhashini Arcot Manikam, GVS Murthy, Papreen Nahar, Peter Phillimore, Shreyaswi Sathyanath, Pushpendra Singh, Meenu Singh, Pete Wright, Deepika Yadav, and Patrick Olivier. 2016. A Real-Time IVR Platform for Community Radio. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 343–354. https://doi.org/10.1145/2858036.2858585",
      "doi": "10.1145/2858036.2858585"
    },
    {
      "text": "Mirja Koschorke, R. Padmavati, Shuba Kumar, Alex Cohen, Helen A. Weiss, Sudipto Chatterjee, Jesina Pereira, Smita Naik, Sujit John, Hamid Dabholkar, Madhumitha Balaji, Animish Chavan, Mathew Varghese, R. Thara, Vikram Patel, and Graham Thornicroft. 2017. Experiences of stigma and discrimination faced by family caregivers of people with schizophrenia in India. Social Science & Medicine 178 (2017), 66–77. https://doi.org/10.1016/j.socscimed.2017.01.061",
      "doi": ""
    },
    {
      "text": "Channaveerachari N Kumar, Kudumallige K Suresha, Jagadisha Thirthalli, Udupi Arunachala, and Bangalore N Gangadhar. 2015. Caregiver burden is associated with disability in schizophrenia: Results of a study from a rural setting of south India. International Journal of Social Psychiatry 61, 2 (2015), 157–163. https://doi.org/10.1177/0020764014537637",
      "doi": ""
    },
    {
      "text": "Daniel Lambton-Howard, Emma Simpson, Kim Quimby, Ahmed Kharrufa, Heidi Hoi Ming Ng, Emma Foster, and Patrick Olivier. 2021. Blending into Everyday Life: Designing a Social Media-Based Peer Support System. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 168, 14 pages. https://doi.org/10.1145/3411764.3445079",
      "doi": "10.1145/3411764.3445079"
    },
    {
      "text": "L S Leach and H Christensen. 2006. A systematic review of telephone-based interventions for mental disorders. Journal of Telemedicine and Telecare 12, 3 (2006), 122–129. https://doi.org/10.1258/135763306776738558 arXiv:https://doi.org/10.1258/135763306776738558PMID: 16638233.",
      "doi": ""
    },
    {
      "text": "Guo Li, Xiaomu Zhou, Tun Lu, Jiang Yang, and Ning Gu. 2016. SunForum: Understanding Depression in a Chinese Online Community. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing(2016). https://doi.org/10.1145/2818048.2819994",
      "doi": "10.1145/2818048.2819994"
    },
    {
      "text": "Jael Lorca-Cabrera, Carme Grau, Rut Martí-Arques, Laia Raigal-Aran, Anna Falcó-Pegueroles, and Núria Albacar-Riobóo. 2020. Effectiveness of health web-based and mobile app-based interventions designed to improve informal caregiver’s well-being and quality of life: A systematic review. International Journal of Medical Informatics 134 (2020), 104003. https://doi.org/10.1016/j.ijmedinf.2019.104003",
      "doi": ""
    },
    {
      "text": "Martin Maguire. 2001. Methods to support human-centred design. International Journal of Human-Computer Studies 55, 4 (2001), 587–634. https://doi.org/10.1006/ijhc.2001.0503",
      "doi": "10.1006/ijhc.2001.0503"
    },
    {
      "text": "Winnie WS Mak and Rebecca YM Cheung. 2008. Affiliate stigma among caregivers of people with intellectual disability or mental illness. Journal of applied research in intellectual disabilities 21, 6(2008), 532–545. https://doi.org/10.1111/j.1468-3148.2008.00426.x",
      "doi": ""
    },
    {
      "text": "Logan D McColl, Pamela E Rideout, Tasha N Parmar, and Adam Abba-Aji. 2014. Peer support intervention through mobile application: An integrative literature review and future directions. Canadian Psychology/Psychologie canadienne 55, 4 (2014), 250. https://doi.org/doi/10.1037/a0038095",
      "doi": ""
    },
    {
      "text": "William R. McFarlane, Ellen Lukens, Bruce Link, Robert Dushay, Susan A. Deakins, Margaret Newmark, Edward J. Dunne, Bonnie Horen, and Joanne Toran. 1995. Multiple-Family Groups and Psychoeducation in the Treatment of Schizophrenia. Archives of General Psychiatry 52, 8 (1995), 679–687. https://doi.org/10.1001/archpsyc.1995.03950200069016",
      "doi": ""
    },
    {
      "text": "Serious mental illness. n.d. Serious Mental Illness. Retrieved Oct 4, 2021 from https://smiadviser.org/about/serious-mental-illness",
      "doi": ""
    },
    {
      "text": "Andrew Miller, Sonali Mishra, Logan Kendall, Shefali Haldar, Ari Pollack, and Wanda Pratt. 2016. Partners in Care: Design Considerations for Caregivers and Patients During a Hospital Stay. CSCW : proceedings of the Conference on Computer-Supported Cooperative Work. Conference on Computer-Supported Cooperative Work 2016, 754–767. https://doi.org/10.1145/2818048.2819983",
      "doi": "10.1145/2818048.2819983"
    },
    {
      "text": "A. Millier, U. Schmidt, M.C. Angermeyer, D. Chauhan, V. Murthy, M. Toumi, and N. Cadi-Soussi. 2014. Humanistic burden in schizophrenia: A literature review. Journal of Psychiatric Research 54 (2014), 85–93. https://doi.org/10.1016/j.jpsychires.2014.03.021",
      "doi": ""
    },
    {
      "text": "Vicki Moulder, Lorna R Boschman, Ron Wakkary, William Odom, and Stacey Kuznetsov. 2014. HCI interventions with nonprofit organizations: tactics for effective collaboration. 877–880. https://doi.org/10.1145/2559206.2559971",
      "doi": "10.1145/2559206.2559971"
    },
    {
      "text": "Elizabeth Murnane, Tara Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal Informatics in Interpersonal Contexts: Towards the Design of Technology that Supports the Social Ecologies of Long-Term Mental Health Management. Proceedings of the ACM on Human-Computer Interaction 2 (11 2018), 1–27. https://doi.org/10.1145/3274396",
      "doi": "10.1145/3274396"
    },
    {
      "text": "R. Srinivasa Murthy. 2017. National Mental Health Survey of India 2015-2016. Indian journal of psychiatry 59, 1 (2017), 21–26. https://doi.org/10.4103/psychiatry.IndianJPsychiatry_102_17",
      "doi": ""
    },
    {
      "text": "Elizabeth Mynatt, Jim Rowan, Sarah Craighill, and Annie Jacobs. 2001. Digital family portraits: Supporting peace of mind for extended family members. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/365024.365126",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "J. A. Naslund, K. A. Aschbrenner, L. A. Marsch, and S. J. Bartels. 2016. The future of mental health care: peer-to-peer support and social media. Epidemiology and Psychiatric Sciences 25, 2 (2016), 113–122. https://doi.org/10.1017/S2045796015001067",
      "doi": ""
    },
    {
      "text": "John A. Naslund, Kelly A. Aschbrenner, Lisa A. Marsch, Gregory J. McHugo, and Stephen J. Bartels. 2018. Facebook for Supporting a Lifestyle Intervention for People with Major Depressive Disorder, Bipolar Disorder, and Schizophrenia: an Exploratory Study. Psychiatric Quarterly 89, 1 (2018), 81–94. https://doi.org/10.1007/s11126-017-9512-0",
      "doi": ""
    },
    {
      "text": "Michael Nunley. 1998. The involvement of families in Indian psychiatry. Culture, medicine and psychiatry 22, 3 (1998), 317–353.",
      "doi": ""
    },
    {
      "text": "World Health Organisation. 2013. Government expenditures on mental health as a percentage of total government expenditures on health. Retrieved Sep 16, 2022 from https://www.who.int/data/gho/data/indicators/indicator-details/GHO/government-expenditures-on-mental-health-as-a-percentage-of-total-government-expenditures-on-health-(-)",
      "doi": ""
    },
    {
      "text": "World Health Organisation. 2019. Mental health workers Data by country. Retrieved Sep 16, 2022 from https://apps.who.int/gho/data/view.main.HWF11v",
      "doi": ""
    },
    {
      "text": "World Health Organisation. 2022. Mental disorders. Retrieved June 27, 2022 from https://www.who.int/news-room/fact-sheets/detail/mental-disorders",
      "doi": ""
    },
    {
      "text": "World Health Organisation. 2022. Schizophrenia. Retrieved June 27, 2022 from https://www.who.int/news-room/fact-sheets/detail/schizophrenia",
      "doi": ""
    },
    {
      "text": "World Health Organization 2011. mHealth: new horizons for health through mobile technologies.mHealth: new horizons for health through mobile technologies. (2011).",
      "doi": ""
    },
    {
      "text": "Minsu Park, David McDonald, and Meeyoung Cha. 2021. Perception Differences between the Depressed and Non-Depressed Users in Twitter. Proceedings of the International AAAI Conference on Web and Social Media 7, 1(2021). https://ojs.aaai.org/index.php/ICWSM/article/view/14425",
      "doi": ""
    },
    {
      "text": "Vikram Patel. 2007. Mental health in low- and middle-income countries. British Medical Bulletin 81-82, 1 (04 2007), 81–96. https://doi.org/10.1093/bmb/ldm010 arXiv:https://academic.oup.com/bmb/article-pdf/81-82/1/81/795753/ldm010.pdf",
      "doi": ""
    },
    {
      "text": "Vikram Patel, Shuiyuan Xiao, Hanhui Chen, Fahmy Hanna, A. T. Jotheeswaran, Dan Luo, Rachana Parikh, Eesha Sharma, Shamaila Usmani, Yu Yu, Benjamin G. Druss, and Shekhar Saxena. 2016. The magnitude of and health system responses to the mental health treatment gap in adults in India and China. The Lancet 388, 10063 (2016), 3074–3084. https://doi.org/10.1016/S0140-6736(16)00160-4",
      "doi": ""
    },
    {
      "text": "S. Pathare, Jasmine Kalha, and S. Krishnamoorthy. 2018. Peer support for mental illness in India: an underutilised resource. Epidemiology and Psychiatric Sciences 27 (2018), 1–5. https://doi.org/10.1017/S2045796018000161",
      "doi": ""
    },
    {
      "text": "Sachin Pendse, Naveena Karusala, Divya Siddarth, Pattie Gonsalves, Seema Mehrotra, John Naslund, Mamta Sood, Neha Kumar, and Amit Sharma. 2019. Mental health in the global south: challenges and opportunities in HCI for development. 22–36. https://doi.org/10.1145/3314344.3332483",
      "doi": "10.1145/3314344.3332483"
    },
    {
      "text": "Sachin Pendse, Faisal Lalani, Munmun Choudhury, Amit Sharma, and Neha Kumar. 2020. \"Like Shock Absorbers\": Understanding the Human Infrastructures of Technology-Mediated Mental Health Support. 1–14. https://doi.org/10.1145/3313831.3376465",
      "doi": "10.1145/3313831.3376465"
    },
    {
      "text": "Sachin Pendse, Daniel Nkemulu, Nicola Bidwell, Sushrut Jadhav, Soumitra Pathare, Munmun De, and Neha Kumar. 2022. From Treatment to Healing: Envisioning a Decolonial Digital Mental Health. https://doi.org/10.1145/3491102.3501982",
      "doi": "10.1145/3491102.3501982"
    },
    {
      "text": "Sachin R Pendse, Amit Sharma, Aditya Vashistha, Munmun De Choudhury, and Neha Kumar. 2021. “Can I Not Be Suicidal on a Sunday?”: Understanding Technology-Mediated Pathways to Mental Health Support. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445410"
    },
    {
      "text": "Inge Petersen, Debbie Marais, Jibril O. Abdulmalik, Shalini Ahuja, Atalay Alem, Dan Chisholm, Catherine Egbe, Oye Gureje, Charlotte Hanlon, Crick Lund, Rahul Shidhaye, Mark Jordans, Fred Kigozi, James Mugisha, Nawaraj Upadhaya, and Graham Thornicroft. 2017. Strengthening mental health system governance in six low- and middle-income countries in Africa and South Asia: Challenges, needs and potential strategies. Health policy and planning 32 (02 2017). https://doi.org/10.1093/heapol/czx014",
      "doi": ""
    },
    {
      "text": "S. Pilling, P. Bebbington, E. Kuipers, P. Garety, J. Geddes, G. Orbach, and C. Morgan. 2002. Psychological treatments in schizophrenia: I. Meta-analysis of family intervention and cognitive behaviour therapy. Psychological Medicine 32, 5 (2002), 763–782. https://doi.org/10.1017/S0033291702005895",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper, Raymundo Cornejo, Lisa Hurwitz, and Caitlin Unumb. 2016. Technological Caregiving: Supporting Online Activity for Adults with Cognitive Impairments. 5311–5323. https://doi.org/10.1145/2858036.2858260",
      "doi": "10.1145/2858036.2858260"
    },
    {
      "text": "Gabi Pitschel-Walz, Stefan Leucht, Josef Bäuml, Werner Kissling, and Rolf R. Engel. 2001. The Effect of Family Interventions on Relapse and Rehospitalization in Schizophrenia—A Meta-analysis. Schizophrenia Bulletin 27, 1 (2001), 73–92. https://doi.org/10.1093/oxfordjournals.schbul.a006861",
      "doi": ""
    },
    {
      "text": "Imas Rafiyah. 2011. Review: Burden on Family Caregivers Caring for Patients with Schizophrenia and Its Related Factors. Nurse Media Journal of Nursing 1, 1 (2011), 13. https://doi.org/10.14710/nmjn.v1i1.745",
      "doi": ""
    },
    {
      "text": "Martin Rama, Tara Béteille, John Newman, and Yue Li. 2014. Addressing Inequality in South Asia. World Bank Publications. https://books.google.com.au/books?hl=en&lr=&id=qobjBAAAQBAJ&oi=fnd&pg=PR1&ots=3a3QIXZg5o&sig=i-zHhlAP0Qa96_59w42XTOSHVTc&redir_esc=y#v=onepage&q&f=false",
      "doi": ""
    },
    {
      "text": "Shanaya Rathod, Narsimha Pinninti, Muhammed Irfan, Paul Gorczynski, Pranay Rathod, Lina Gega, and Farooq Naeem. 2017. Mental health service provision in low-and middle-income countries. Health services insights 10 (2017), 1178632917694350.",
      "doi": ""
    },
    {
      "text": "Robin Reid Rudy, Lawrence B. Rosenfeld, John P. Galassi, Joanna Parker, and Rachel Schanberg. 2001. Participants’ Perceptions of a Peer-Helper, Telephone-Based Social Support Intervention for Melanoma Patients. Health Communication 13, 3 (2001), 285–305. https://doi.org/10.1207/S15327027HC1303_4",
      "doi": ""
    },
    {
      "text": "J. Repper and T. Carter. 2011. A review of the literature on peer support in mental health services. J Ment Health 20, 4 (2011), 392–411. https://doi.org/10.3109/09638237.2011.583947",
      "doi": ""
    },
    {
      "text": "Debbie Robson and Richard Gray. 2007. Serious mental illness and physical health problems: A discussion paper. International Journal of Nursing Studies 44, 3 (2007), 457–466. https://doi.org/10.1016/j.ijnurstu.2006.07.013",
      "doi": ""
    },
    {
      "text": "E. Rodriguez-Villa, A. R. Rozatkar, M. Kumar, V. Patel, A. Bondre, S. S. Naik, S. Dutt, U. M. Mehta, S. Nagendra, D. Tugnawat, R. Shrivastava, H. Raghuram, A. Khan, J. A. Naslund, S. Gupta, A. Bhan, J. Thirthall, P. K. Chand, T. Lakhtakia, M. Keshavan, and J. Torous. 2021. Cross cultural and global uses of a digital mental health app: results of focus groups with clinicians, patients and family members in India and the United States. Glob Ment Health (Camb) 8 (2021), e30. https://doi.org/10.1017/gmh.2021.28",
      "doi": ""
    },
    {
      "text": "Peter Rosenbaum, Nigel Paneth, Alan Leviton, Murray Goldstein, Martin Bax, Diane Damiano, Bernard Dan, and Bo Jacobsson. 2007. A report: the definition and classification of cerebral palsy April 2006. Dev Med Child Neurol Suppl 109, suppl 109 (2007), 8–14. https://doi.org/10.1111/j.1469-8749.2007.tb12610.x",
      "doi": ""
    },
    {
      "text": "Nicolas Rüsch, Patrick W. Corrigan, Abigail Wassel, Patrick Michaels, Jonathon E. Larson, Manfred Olschewski, Sandra Wilkniss, and Karen Batia. 2009. Self-stigma, group identification, perceived legitimacy of discrimination and mental health service use. British Journal of Psychiatry 195, 6 (2009), 551–552. https://doi.org/10.1192/bjp.bp.109.067157",
      "doi": ""
    },
    {
      "text": "Nicholas Rüsch, Patrick W Corrigan, Abigail Wassel, Patrick Michaels, Manfred Olschewski, Sandra Wilkniss, and Karen Batia. 2009. Ingroup perception and responses to stigma among persons with mental illness. Acta Psychiatrica Scandinavica 120, 4 (2009), 320–328. https://doi.org/10.1111/j.1600-0447.2009.01403.x",
      "doi": ""
    },
    {
      "text": "Rajesh Sagar, Rakhi Dandona, Gujaraj G, Dalhiwal RS, and Aditya Singh. 2019. The burden of mental disorders across the states of India: the Global Burden of Disease Study 1990‚Äì2017. The Lancet Psychiatry 7 (12 2019). https://doi.org/10.1016/S2215-0366(19)30475-4",
      "doi": ""
    },
    {
      "text": "Rajesh Sagar, Rakhi Dandona, Gopalkrishna Gururaj, R. S. Dhaliwal, Aditya Singh, Alize Ferrari, Tarun Dua, Atreyi Ganguli, Mathew Varghese, Joy K. Chakma, G. Anil Kumar, K. S. Shaji, Atul Ambekar, Thara Rangaswamy, Lakshmi Vijayakumar, Vivek Agarwal, Rinu P. Krishnankutty, Rohit Bhatia, Fiona Charlson, Neerja Chowdhary, Holly E. Erskine, Scott D. Glenn, Varsha Krish, Ana M. Mantilla Herrera, Parul Mutreja, Christopher M. Odell, Pramod K. Pal, Sanjay Prakash, Damian Santomauro, D. K. Shukla, Ravinder Singh, R. K. Lenin Singh, J. S. Thakur, Akhil S. ThekkePurakkal, Chris M. Varghese, K. Srinath Reddy, Soumya Swaminathan, Harvey Whiteford, Hendrik J. Bekedam, Christopher J. L. Murray, Theo Vos, and Lalit Dandona. 2020. The burden of mental disorders across the states of India: the Global Burden of Disease Study 1990–2017. The Lancet Psychiatry 7, 2 (2020), 148–161. https://doi.org/10.1016/S2215-0366(19)30475-4",
      "doi": ""
    },
    {
      "text": "Hannah Ritchie Saloni Dattani and Max Roser. 2021. Mental Health. Retrieved December 11, 2022 from https://ourworldindata.org/mental-health",
      "doi": ""
    },
    {
      "text": "Antti Salovaara, Sacha Helfenstein, and Antti Oulasvirta. 2011. Everyday appropriations of information technology: A study of creative uses of digital cameras. Journal of the American Society for Information Science and Technology 62, 12 (2011), 2347–2363. https://doi.org/10.1002/asi.21643",
      "doi": "10.1002/asi.21643"
    },
    {
      "text": "M. S. Salzer and S. L. Shear. 2002. Identifying consumer-provider benefits in evaluations of consumer-delivered services. Psychiatr Rehabil J 25, 3 (2002), 281–8. https://doi.org/10.1037/h0095014",
      "doi": ""
    },
    {
      "text": "Sandesh Samudre, Rahul Shidhaye, Shalini Ahuja, Sharmishtha Nanda, Azaz Khan, Sara Evans-Lacko, and Charlotte Hanlon. 2016. Service user involvement for mental health system strengthening in India: a qualitative study. BMC psychiatry 16, 1 (2016), 1–11.",
      "doi": ""
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating Implications for Design through Design Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1971–1980. https://doi.org/10.1145/2556288.2557357",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "S. Saxena, G. Thornicroft, M. Knapp, and H. Whiteford. 2007. Resources for mental health: scarcity, inequity, and inefficiency. Lancet 370, 9590 (2007), 878–89. https://doi.org/10.1016/s0140-6736(07)61239-2",
      "doi": ""
    },
    {
      "text": "A. J. Schneider, D. Mataix-Cols, I. M. Marks, and M. Bachofen. 2005. Internet-guided self-help with or without exposure therapy for phobic and panic disorders. Psychother Psychosom 74, 3 (2005), 154–64. https://doi.org/10.1159/000084000",
      "doi": ""
    },
    {
      "text": "Marén Schorch, Lin Wan, David William Randall, and Volker Wulf. 2016. Designing for Those Who Are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 787–799. https://doi.org/10.1145/2818048.2819999",
      "doi": "10.1145/2818048.2819999"
    },
    {
      "text": "Beate Schrank, Ingrid Sibitz, Annemarie Unger, and Michaela Amering. 2010. How patients with schizophrenia use the internet: qualitative study. Journal of medical Internet research 12, 5 (2010), e70–e70. https://doi.org/10.2196/jmir.1550",
      "doi": ""
    },
    {
      "text": "Richard Schulz, Amy Lustig, and Lynn Martire. 2002. Technology-Based Caregiver Intervention Research: Current Status and Future Directions. Gerontechnology 2 (01 2002), 15–47. https://doi.org/10.4017/gt.2002.02.01.003.00",
      "doi": ""
    },
    {
      "text": "Kalyanasundaram Seshadri, Thanapal Sivakumar, and Aarti Jagannathan. 2019. The Family Support Movement and Schizophrenia in India. Current Psychiatry Reports 21 (09 2019). https://doi.org/10.1007/s11920-019-1081-5",
      "doi": ""
    },
    {
      "text": "Victoria Shahly, S Chatterji, MJ Gruber, A Al-Hamzawi, J Alonso, LH Andrade, MC Angermeyer, Ronny Bruffaerts, Brendan Bunting, JM Caldas-de Almeida, 2013. Cross-national differences in the prevalence and correlates of burden among older family caregivers in the World Health Organization World Mental Health (WMH) Surveys. Psychological medicine 43, 4 (2013), 865–879.",
      "doi": ""
    },
    {
      "text": "Aakanksha Singh, Surendra K. Mattoo, and Sandeep Grover. 2016. Stigma and its correlates among caregivers of schizophrenia: A study from North India. Psychiatry Research 241(2016), 302–308. https://doi.org/10.1016/j.psychres.2016.04.108",
      "doi": ""
    },
    {
      "text": "K. Sinha Deb, A. Tuli, M. Sood, R. Chadda, R. Verma, S. Kumar, R. Ganesh, and P. Singh. 2018. Is India ready for mental health apps (MHApps)? A quantitative-qualitative exploration of caregivers’ perspective on smartphone-based solutions for managing severe mental illnesses in low resource settings. PLoS One 13, 9 (2018), e0203353. https://doi.org/10.1371/journal.pone.0203353",
      "doi": ""
    },
    {
      "text": "Petr Slovak, Nikki Theofanopoulou, Alessia Cecchet, Peter Cottrell, Ferran Altarriba Bertran, Ella Dagan, Julian Edbrooke-Childs, and Katherine Isbister. 2018. \"I just let him cry...: Designing Socio-Technical Interventions in Families to Prevent Mental Health Disorders. Proceedings of the ACM on Human-Computer Interaction 2 (11 2018), 1–34. https://doi.org/10.1145/3274429",
      "doi": "10.1145/3274429"
    },
    {
      "text": "P. Solomon. 2004. Peer support/peer provided services underlying processes, benefits, and critical ingredients. Psychiatr Rehabil J 27, 4 (2004), 392–401. https://doi.org/10.2975/27.2004.392.401",
      "doi": ""
    },
    {
      "text": "V. Spek, P. Cuijpers, I. Nyklícek, H. Riper, J. Keyzer, and V. Pop. 2007. Internet-based cognitive behaviour therapy for symptoms of depression and anxiety: a meta-analysis. Psychol Med 37, 3 (2007), 319–28. https://doi.org/10.1017/s0033291706008944",
      "doi": ""
    },
    {
      "text": "Tk Srikanth, Girish Rao, Rajani Parthasarathy, Divya Raj, Suresh Bada Math, Seema Mehrotra, Jagadisha Tirthahalli, Naveen Kumar, Paulomi Sudhir, and Deepak Jayarajan. 2021. Leveraging technology to improve quality of mental health care in Karnataka. 107–114. https://doi.org/10.1145/3462741.3466652",
      "doi": "10.1145/3462741.3466652"
    },
    {
      "text": "Ye Sun, Ying Liu, Ting Zhou, and Zheng Huang. 2022. The Relationship between Social Support and Subjective Well-being in Primary Caregivers with Schizophrenia: The Mediating Role of Just World Belief and Hope. 580–587. https://doi.org/10.1145/3556089.3556092",
      "doi": "10.1145/3556089.3556092"
    },
    {
      "text": "Thi Minh Tam Ta, Aron Zieger, Georg Schomerus, Tien Duc Cao, Michael Dettling, Xuan Tinh Do, Aditya Mungee, Albert Diefenbacher, Matthias C Angermeyer, and Eric Hahn. 2016. Influence of urbanity on perception of mental illness stigma: a population based study in urban and rural Hanoi, Vietnam. International Journal of Social Psychiatry 62, 8 (2016), 685–695. https://doi.org/10.1177%2F0020764016670430",
      "doi": ""
    },
    {
      "text": "Yoshimitsu Takahashi, Chiyoko Uchida, Koichi Miyaki, Michi Sakai, Takuro Shimbo, and Takeo Nakayama. 2009. Potential Benefits and Harms of a Peer Support Social Network Service on the Internet for People With Depressive Tendencies: Qualitative Content Analysis and Social Network Analysis. J Med Internet Res 11, 3 (23 Jul 2009), e29. https://doi.org/10.2196/jmir.1142",
      "doi": ""
    },
    {
      "text": "R. Thara, R. Padmavati, J. R. Aynkran, and S. John. 2008. Community mental health in India: A rethink. Int J Ment Health Syst 2, 1 (2008), 11. https://doi.org/10.1186/1752-4458-2-11",
      "doi": ""
    },
    {
      "text": "R. Thara, R. Padmavati, and T. N. Srinivasan. 2004. Focus on psychiatry in India. British Journal of Psychiatry 184, 4 (2004), 366–373. https://doi.org/10.1192/bjp.184.4.366",
      "doi": ""
    },
    {
      "text": "Graham Thornicroft. 2006. Shunned: Discrimination against people with mental illness. Oxford university press.",
      "doi": ""
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2015. Looking for respite and support: technological opportunities for spousal caregivers. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1155–1158.",
      "doi": "10.1145/2702123.2702563"
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2016. \"Counting on the Group\": Reconciling Online and Offline Social Support among Older Informal Caregivers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3545–3558. https://doi.org/10.1145/2858036.2858477",
      "doi": "10.1145/2858036.2858477"
    },
    {
      "text": "Kentaro Toyama. 2011. Technology as amplifier in international development. 75–82. https://doi.org/10.1145/1940761.1940772",
      "doi": "10.1145/1940761.1940772"
    },
    {
      "text": "Jitendra Trivedi, Dishanter Goel, Roy Kallivayalil, Mohan Isaac, Dhruba Shrestha, and Harish Gambheera. 2007. Regional co-operation in South Asia in the field of mental health. World psychiatry : official journal of the World Psychiatric Association (WPA) 6 (03 2007), 57–9.",
      "doi": ""
    },
    {
      "text": "Anupriya Tuli, Pushpendra Singh, Mamta Sood, Koushik Sinha Deb, Siddharth Jain, Abhishek Jain, Manan Wason, Rakesh Chadda, and Rohit Verma. 2016. Harmony: Close Knitted Mhealth Assistance for Patients, Caregivers and Doctors for Managing SMIs. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (Heidelberg, Germany) (UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 1144–1152. https://doi.org/10.1145/2968219.2968301",
      "doi": "10.1145/2968219.2968301"
    },
    {
      "text": "Mark J. Viron and Theodore A. Stern. 2010. The Impact of Serious Mental Illness on Health and Healthcare. Psychosomatics 51, 6 (2010), 458–465. https://doi.org/10.1016/S0033-3182(10)70737-4",
      "doi": ""
    },
    {
      "text": "Johannes Wancata, Monika Krautgartner, Julia Berner, Sabrina Scumaci, Marion Freidl, Rainer Alexandrowicz, and Hans Rittmannsberger. 2006. The “Carers’ needs assessment for Schizophrenia”. Social Psychiatry and Psychiatric Epidemiology 41, 3(2006), 221–229. https://doi.org/10.1007/s00127-005-0021-3",
      "doi": ""
    },
    {
      "text": "Mark Warschauer. 2003. Demystifying the digital divide. Scientific American 289, 2 (2003), 42–47. https://www.jstor.org/stable/26060401",
      "doi": ""
    },
    {
      "text": "Brittany White, Heather Castleden, and Anatoliy Gruzd. 2015. Talking to Twitter users: Motivations behind Twitter use on the Alberta oil sands and the Northern Gateway Pipeline. First Monday (2015). https://doi.org/10.5210/fm.v20i1.5404",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing Moods: How Manual Tracking by Family Caregivers Improves Caring and Family Communication. 158–169. https://doi.org/10.1145/3025453.3025843",
      "doi": "10.1145/3025453.3025843"
    },
    {
      "text": "Lawrence Hsin Yang, Arthur Kleinman, Bruce G. Link, Jo C. Phelan, Sing Lee, and Byron Good. 2007. Culture and stigma: Adding moral experience to stigma theory. Social Science & Medicine 64, 7 (2007), 1524–1535. https://doi.org/10.1016/j.socscimed.2006.11.013",
      "doi": ""
    },
    {
      "text": "M. L. Ybarra and W. W. Eaton. 2005. Internet-based mental health interventions. Ment Health Serv Res 7, 2 (2005), 75–87. https://doi.org/10.1007/s11020-005-3779-8",
      "doi": ""
    }
  ]
}