{
  "doi": "10.1145/3544548.3580980",
  "title": "EquityWare: Co-Designing Wearables With And For Low Income Communities In The U.S.",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Wearables are a potentially vital mechanism for individuals to monitor their health, track behaviors, and stay connected. Unfortunately, both price and a lack of consideration of the needs of low-SES communities have made these devices inaccessible and unusable for communities that would most substantially benefit from their affordances. To address this gap and better understand how members of low-SES communities perceive the potential benefits and barriers to using wearable devices, we conducted 19 semi-structured interviews with people from minority, high crime rate, low-SES communities. Participants emphasized a critical need for safety-related wearable devices in their communities. Still, existing tools do not yet address the specific needs of this community and are out of reach due to several barriers. We distill themes on perceived useful features and ongoing obstacles to guide a much-needed research agenda we term ’Equityware’: building wearable devices based on low-SES communities’ needs, comfortability, and limitations.",
  "tags": [
    "Co-design",
    "Safety",
    "Low-socioeconomic status",
    "Crime",
    "Neighborhoods",
    "interviews",
    "Wearables"
  ],
  "authors": [
    {
      "name": "Stefany Cruz",
      "institution": "Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659664879",
      "orcid": "0000-0001-6461-1984"
    },
    {
      "name": "Alexander Redding",
      "institution": "Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780830",
      "orcid": "0000-0001-5210-0407"
    },
    {
      "name": "Connie W. Chau",
      "institution": "Northwestern Unversity, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660643224",
      "orcid": "0000-0002-0519-9616"
    },
    {
      "name": "Claire Lu",
      "institution": "Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778475",
      "orcid": "0000-0001-6639-7539"
    },
    {
      "name": "Julia Persche",
      "institution": "Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783507",
      "orcid": "0000-0003-3273-6699"
    },
    {
      "name": "Josiah Hester",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658657825",
      "orcid": "0000-0002-1680-085X"
    },
    {
      "name": "Maia Jacobs",
      "institution": "Computer Science and Preventive Medicine, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778197",
      "orcid": "0000-0001-8500-0277"
    }
  ],
  "references": [
    {
      "text": "2022. Tracking the COVID-19 economy’s effects on food, housing, and employment hardships. https://www.cbpp.org/research/poverty-and-inequality/tracking-the-covid-19-economys-effects-on-food-housing-and",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, Nova Ahmed, Hasan Shahid Ferdous, Md Rashidujjaman Rifat, ASM Rizvi, Shamir Ahmed, and Rifat Sabbir Mansur. 2014. Protibadi: A platform for fighting sexual harassment in urban Bangladesh. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2695–2704.",
      "doi": "10.1145/2556288.2557376"
    },
    {
      "text": "Mohammed Eunus Ali, Shabnam Basera Rishta, Lazima Ansari, Tanzima Hashem, and Ahamad Imtiaz Khan. 2015. SafeStreet: empowering women against street harassment using a privacy-aware location based application. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. 1–4.",
      "doi": "10.1145/2737856.2737870"
    },
    {
      "text": "Fabio Bacchini and Ludovica Lorusso. 2019. Race, again: how face recognition technology reinforces racial discrimination. Journal of information, communication and ethics in society (2019).",
      "doi": ""
    },
    {
      "text": "Laura Benton, Asimina Vasalou, Rilla Khaled, Hilary Johnson, and Daniel Gooch. 2014. Diversity for design: a framework for involving neurodiverse children in the technology design process. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 3747–3756.",
      "doi": "10.1145/2556288.2557244"
    },
    {
      "text": "Constanza Bianchi, Sven Tuzovic, and Volker G Kuppelwieser. 2022. Investigating the drivers of wearable technology adoption for healthcare in South America. Information Technology & People(2022).",
      "doi": ""
    },
    {
      "text": "Waleed Bin Qaim, Aleksandr Ometov, Antonella Molinaro, Ilaria Lener, Claudia Campolo, Elena Simona Lohan, and Jari Nurmi. 2020. Towards Energy Efficiency in the Internet of Wearable Things: A Systematic Review. IEEE Access 8 (09 2020), 175412–175435. https://doi.org/10.1109/ACCESS.2020.3025270",
      "doi": ""
    },
    {
      "text": "Josh Bivens and Ben Zipperer. [n.d.]. Health insurance and the COVID-19 shock. https://www.epi.org/publication/health-insurance-and-the-covid-19-shock/",
      "doi": ""
    },
    {
      "text": "Terra Blevins, Robert Kwiatkowski, Jamie C Macbeth, Kathleen McKeown, Desmond Patton, and Owen Rambow. 2016. Automatically processing tweets from gang-involved youth: towards detecting loss and aggression. (2016).",
      "doi": ""
    },
    {
      "text": "Jan Blom, Divya Viswanathan, Mirjana Spasojevic, Janet Go, Karthik Acharya, and Robert Ahonius. 2010. Fear and the city: role of mobile services in harnessing safety and security in urban use contexts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1841–1850.",
      "doi": "10.1145/1753326.1753602"
    },
    {
      "text": "LaPrincess C Brewer, Karen L Fortuna, Clarence Jones, Robert Walker, Sharonne N Hayes, Christi A Patten, and Lisa A Cooper. 2020. Back to the future: Achieving Health Equity Through Health Informatics and Digital Health. JMIR mHealth and uHealth 8, 1 (2020). https://doi.org/10.2196/14512",
      "doi": ""
    },
    {
      "text": "Diana Budds and Diana Budds. 2018. How Urban Design Perpetuates Racial Inequality–And What We Can Do About It. Fast Company (2018).",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. PMLR, 77–91.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. In Proceedings of the 1st Conference on Fairness, Accountability and Transparency(Proceedings of Machine Learning Research, Vol. 81), Sorelle A. Friedler and Christo Wilson (Eds.). PMLR, 77–91. https://proceedings.mlr.press/v81/buolamwini18a.html",
      "doi": ""
    },
    {
      "text": "US Census Bureau. 2022. Income and poverty. https://www.census.gov/topics/income-poverty.html",
      "doi": ""
    },
    {
      "text": "Christopher L Busey and Carolyn Silva. 2021. Troubling the essentialist discourse of Brown in education: The anti-Black sociopolitical and sociohistorical etymology of Latinxs as a Brown monolith. Educational Researcher 50, 3 (2021), 176–186.",
      "doi": ""
    },
    {
      "text": "AM Bustamante, N Brendel, A Degbelo, and C Kray. 2018. Participatory Design and Participatory Research: An HCI Case Study. (2018).",
      "doi": ""
    },
    {
      "text": "Paul Cain. 2015. Unlock the full potential of wearables with organic TFTs. Information Display 31, 1 (Jan 2015), 22–26. https://doi.org/10.1002/j.2637-496x.2015.tb00782.x",
      "doi": ""
    },
    {
      "text": "Ranganathan Chandrasekaran, Vipanchi Katthula, and Evangelos Moustakas. 2020. Patterns of Use and Key Predictors for the Use of Wearable Health Care Devices by US Adults: Insights from a National Survey. J Med Internet Res 22, 10 (16 Oct 2020), e22443. https://doi.org/10.2196/22443",
      "doi": ""
    },
    {
      "text": "Serina Chang, Ruiqi Zhong, Ethan Adams, Fei-Tzin Lee, Siddharth Varia, Desmond Patton, William Frey, Chris Kedzie, and Kathleen McKeown. 2018. Detecting gang-involved escalation on social media using context. arXiv preprint arXiv:1809.03632(2018).",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz, Liska Belgrave, 2012. Qualitative interviewing and grounded theory analysis. The SAGE handbook of interview research: The complexity of the craft 2 (2012), 347–365.",
      "doi": ""
    },
    {
      "text": "John W. Cheng and Hitoshi Mitomo. 2017. The underlying factors of the perceived usefulness of using smart wearable devices for disaster applications. Telematics and Informatics 34, 2 (2017), 528–539. https://doi.org/10.1016/j.tele.2016.09.010",
      "doi": ""
    },
    {
      "text": "George Hope Chidziwisano, Susan Wyche, and Erick Oduor. 2020. GridAlert: Using a Sensor-Based Technology to Monitor Power Blackouts in Kenyan Homes. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376500",
      "doi": "10.1145/3313831.3376500"
    },
    {
      "text": "Peter J Colvonen, Pamela N DeYoung, Naa-Oye A Bosompra, and Robert L Owens. 2020. Limiting racial disparities and bias for wearable devices in health science research.",
      "doi": ""
    },
    {
      "text": "Francine E Darroch and Audrey R Giles. 2017. Conception of a resource: Development of a physical activity and healthy living resource with and for pregnant urban First Nations and Métis women in Ottawa, Canada. Qualitative Research in Sport, Exercise and Health 9, 2 (2017), 157–169.",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Anind K Dey, and John Zimmerman. 2007. Rapidly exploring application design through speed dating. In International conference on ubiquitous computing. Springer, 429–446.",
      "doi": ""
    },
    {
      "text": "Matthew Desmond, Andrew V Papachristos, and David S Kirk. 2016. Police violence and citizen crime reporting in the black community. American sociological review 81, 5 (2016), 857–876.",
      "doi": ""
    },
    {
      "text": "Jessa Dickinson, Jalon Arthur, Maddie Shiparski, Angalia Bianca, Alejandra Gonzalez, and Sheena Erete. 2021. Amplifying community-led violence prevention as a counter to structural oppression. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–28.",
      "doi": "10.1145/3449279"
    },
    {
      "text": "Jessa Dickinson, Mark Díaz, Christopher A Le Dantec, and Sheena Erete. 2019. \" The cavalry ain’t coming in to save us\" Supporting Capacities and Relationships through Civic Tech. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–21.",
      "doi": "10.1145/3359225"
    },
    {
      "text": "Tawanna R Dillahunt, Sheena Erete, Roxana Galusca, Aarti Israni, Denise Nacu, and Phoebe Sengers. 2017. Reflections on design methods for underserved communities. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 409–413.",
      "doi": "10.1145/3022198.3022664"
    },
    {
      "text": "Carl DiSalvo, Andrew Clement, and Volkmar Pipek. 2012. Communities: Participatory Design for, with and by communities. In Routledge international handbook of participatory design. Routledge, 202–230.",
      "doi": ""
    },
    {
      "text": "Stan Dorn. [n.d.]. THE COVID-19 PANDEMIC AND RESULTING ECONOMIC CRASH HAVE CAUSED THE GREATEST HEALTH INSURANCE LOSSES IN AMERICAN HISTORY. https://familiesusa.org/resources/the-covid-19-pandemic-and-resulting-economic-crash-have-caused-the-greatest-health-insurance-losses-in-american-history/",
      "doi": ""
    },
    {
      "text": "Jessilyn Dunn, Ryan Runge, and Michael Snyder. 2018. Wearables and the medical revolution. Personalized medicine 15, 5 (2018), 429–448.",
      "doi": ""
    },
    {
      "text": "Sheena Erete, Aarti Israni, and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions 25, 3 (2018), 66–69.",
      "doi": "10.1145/3194349"
    },
    {
      "text": "Sheena Lewis Erete. 2013. Empowerment through community crime-prevention technologies. Interactions 20, 6 (2013), 27–31.",
      "doi": "10.1145/2517444"
    },
    {
      "text": "United Nations High Commissioner for Refugees. [n.d.]. Gender-based violence. https://www.unhcr.org/en-us/gender-based-violence.html",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social Justice and Design: Power and oppression in collaborative systems. In Companion of the 2017 acm conference on computer supported cooperative work and social computing. 117–122.",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. “A Stalker’s Paradise” How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "William R Frey, Desmond U Patton, Michael B Gaskell, and Kyle A McGregor. 2020. Artificial intelligence and inclusion: Formerly gang-involved youth as domain experts for analyzing unstructured twitter data. Social Science Computer Review 38, 1 (2020), 42–56.",
      "doi": "10.1177/0894439318788314"
    },
    {
      "text": "Tamar Ginossar and Sara Nelson. 2010. Reducing the health and digital divides: a model for using community-based participatory research approach to e-health interventions in low-income Hispanic communities. Journal of Computer-Mediated Communication 15, 4 (2010), 530–551.",
      "doi": ""
    },
    {
      "text": "Jeffrey T Grabill. 2003. Community computing and citizen productivity. Computers and Composition 20, 2 (2003), 131–150.",
      "doi": ""
    },
    {
      "text": "Abdolrasoul Habibipour, Ali Mohammad Padyab, and Anna Ståhlbröst. 2017. Social, Ethical and Ecological Issues in Wearable Technologies. AMCIS 2019 Proceedings, Association for Information Systems (Jul 2017).",
      "doi": ""
    },
    {
      "text": "Christina Harrington and Tawanna R Dillahunt. 2021. Eliciting Tech Futures Among Black Young Adults: A Case Study of Remote Speculative Co-Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445723"
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Christina N Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging low-income African American older adults in health discussions through community-based design workshops. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3290605.3300823"
    },
    {
      "text": "Drew Harwell. 2019. Oregon became a testing ground for Amazon’s facial-recognition policing. But what if Rekognition gets it wrong. Washington Post 30(2019).",
      "doi": ""
    },
    {
      "text": "Sam Havron, Diana Freed, Rahul Chatterjee, Damon McCoy, Nicola Dell, and Thomas Ristenpart. 2019. Clinical computer security for victims of intimate partner violence. In 28th USENIX Security Symposium (USENIX Security 19). 105–122.",
      "doi": ""
    },
    {
      "text": "Alyssa Fowers Heather Long, Andrew Van Damand Leslie Shapiro. [n.d.]. The covid-19 recession is the most unequal in modern U.S. history. https://www.washingtonpost.com/graphics/2020/business/coronavirus-recession-equality/",
      "doi": ""
    },
    {
      "text": "J. C. Herz. [n.d.]. Wearables Are Totally Failing the People Who Need Them Most. https://www.wired.com/2014/11/where-fitness-trackers-fail/",
      "doi": ""
    },
    {
      "text": "Josiah Hester, Travis Peters, Tianlong Yun, Ronald Peterson, Joseph Skinner, Bhargav Golla, Kevin Storer, Steven Hearndon, Kevin Freeman, Sarah Lord, 2016. Amulet: An energy-efficient, multi-application wearable platform. In Proceedings of the 14th ACM Conference on Embedded Network Sensor Systems CD-ROM. 216–229.",
      "doi": "10.1145/2994551.2994554"
    },
    {
      "text": "Josiah Hester, Travis Peters, Tianlong Yun, Ronald Peterson, Joseph Skinner, Bhargav Golla, Kevin Storer, Steven Hearndon, Kevin Freeman, Sarah Lord, and et al.2016. Amulet: An Energy-Efficient, Multi-Application Wearable Platform. Proceedings of the 14th ACM Conference on Embedded Network Sensor Systems CD-ROM (2016). https://doi.org/10.1145/2994551.2994554",
      "doi": "10.1145/2994551.2994554"
    },
    {
      "text": "Michelle Holko, Tamara R. Litwin, Fatima Munoz, Katrina I. Theisz, Linda Salgin, Nancy Piper Jenks, Beverly W. Holmes, Pamelia Watson-McGee, Eboni Winford, Yashoda Sharma, and et al.2022. Wearable Fitness Tracker use in Federally Qualified Health Center Patients: Strategies to improve the health of all of US using Digital Health Devices. npj Digital Medicine 5, 1 (2022). https://doi.org/10.1038/s41746-022-00593-x",
      "doi": ""
    },
    {
      "text": "Sara Hooker. 2021. Moving beyond “algorithmic bias is a data problem”. Patterns 2, 4 (2021), 100241. https://doi.org/10.1016/j.patter.2021.100241",
      "doi": ""
    },
    {
      "text": "Hugh Hunkin, Daniel L. King, and Ian T. Zajac. 2020. Perceived acceptability of wearable devices for the treatment of mental health problems. Journal of Clinical Psychology 76, 6 (2020), 987–1003. https://doi.org/10.1002/jclp.22934 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/jclp.22934",
      "doi": ""
    },
    {
      "text": "Sofia Hussain, Elizabeth B-N Sanders, and Martin Steinert. 2012. Participatory design with marginalized people in developing countries: Challenges and opportunities experienced in a field study in Cambodia. International Journal of Design 6, 2 (2012).",
      "doi": ""
    },
    {
      "text": "Nadia Ilahi. 2009. Gendered contestations: An analysis of street harassment in Cairo and its implications for women’s access to public spaces. Surfacing: An Interdisciplinary Journal for Gender in the Global South 2, 1(2009), 56–69.",
      "doi": ""
    },
    {
      "text": "Veronica Jacome, Noah Klugman, Catherine Wolfram, Belinda Grunfeld, Duncan Callaway, and Isha Ray. 2019. Power quality and modern energy for all. Proceedings of the National Academy of Sciences 116, 33(2019), 16308–16313.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala and Neha Kumar. 2017. Women’s safety in public spaces: Examining the efficacy of panic buttons in New Delhi. In Proceedings of the 2017 CHI conference on human factors in computing systems. 3340–3351.",
      "doi": "10.1145/3025453.3025532"
    },
    {
      "text": "Maximilian Kasy and Rediet Abebe. 2021. Fairness, equality, and power in algorithmic decision-making. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. 576–586.",
      "doi": "10.1145/3442188.3445919"
    },
    {
      "text": "Zaid Khan and Yun Fu. 2021. One Label, One Billion Faces: Usage and Consistency of Racial Categories in Computer Vision. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 587–597. https://doi.org/10.1145/3442188.3445920",
      "doi": "10.1145/3442188.3445920"
    },
    {
      "text": "Noah Klugman, Joshua Adkins, Susanna Berkouwer, Kwame Abrokwah, Ivan Bobashev, Pat Pannuto, Matthew Podolsky, Aldo Suseno, Revati Thatte, Catherine Wolfram, 2019. Hardware, apps, and surveys at scale: insights from measuring grid reliability in Accra, Ghana. In Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies. 134–144.",
      "doi": "10.1145/3314344.3332482"
    },
    {
      "text": "Rhonda Koster, Kirstine Baccar, and R Harvey Lemelin. 2012. Moving from research ON, to research WITH and FOR Indigenous communities: A critical reflection on community-based participatory research. The Canadian Geographer/Le Géographe canadien 56, 2 (2012), 195–210.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec and W Keith Edwards. 2008. Designs on dignity: perceptions of technology among the homeless. In Proceedings of the SIGCHI conference on human factors in computing systems. 627–636.",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Sang M. Lee and DonHee Lee. 2020. Healthcare wearable devices: An analysis of key factors for continuous use intention. Service Business 14, 4 (2020), 503–531. https://doi.org/10.1007/s11628-020-00428-3",
      "doi": ""
    },
    {
      "text": "Jennifer Lynch. 2020. Face off: Law enforcement use of face recognition technology. Available at SSRN 3909038(2020).",
      "doi": ""
    },
    {
      "text": "Terika McCall, Kammarauche Asuzu, Carol R. Oladele, Tiffany I. Leung, and Karen H. Wang. 2022. A socio-ecological approach to addressing digital redlining in the United States: A call to action for health equity. Frontiers in Digital Health 4 (2022). https://doi.org/10.3389/fdgth.2022.897250",
      "doi": ""
    },
    {
      "text": "Beza Merid, Maria Cielito Robles, and Brahmajee K. Nallamothu. 2021. Digital Redlining and Cardiovascular Innovation. Circulation 144, 12 (2021), 913–915. https://doi.org/10.1161/circulationaha.121.056532",
      "doi": ""
    },
    {
      "text": "Maletsabisa Molapo, Melissa Densmore, and Limpho Morie. 2016. Designing with community health workers: enabling productive participation through exploration. In Proceedings of the First African Conference on Human Computer Interaction. 58–68.",
      "doi": "10.1145/2998581.2998589"
    },
    {
      "text": "Michael J Muller and Sarah Kuhn. 1993. Participatory design. Commun. ACM 36, 6 (1993), 24–28.",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Bishwajit Nayak, Som Sekhar Bhattacharyya, Saurabh Kumar, and Rohan Kumar Jumnani. 2021. Exploring the factors influencing adoption of health-care wearables among generation Z consumers in India. Journal of Information, Communication and Ethics in Society (2021).",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of Oppression: How Search Engines Reinforce Racism. New York University Press, New York, USA. https://doi.org/doi:10.18574/nyu/9781479833641.001.0001",
      "doi": ""
    },
    {
      "text": "Janet Mayowa Nwaogu, Albert PC Chan, John A Naslund, Carol KH Hon, Christopher Belonwu, and Jackie Yang. 2021. Exploring the barriers to and motivators for using digital mental health interventions among construction personnel in Nigeria: qualitative study. JMIR formative research 5, 11 (2021), e18969.",
      "doi": ""
    },
    {
      "text": "Aleksandr Ometov, Viktoriia Shubina, Lucie Klus, Justyna Skibińska, Salwa Saafi, Pavel Pascacio, Laura Flueratoru, Darwin Quezada Gaibor, Nadezhda Chukhno, Olga Chukhno, Asad Ali, Asma Channa, Ekaterina Svertoka, Waleed Bin Qaim, Raúl Casanova-Marqués, Sylvia Holcer, Joaquín Torres-Sospedra, Sven Casteleyn, Giuseppe Ruggeri, Giuseppe Araniti, Radim Burget, Jiri Hosek, and Elena Simona Lohan. 2021. A Survey on Wearable Technology: History, State-of-the-Art and Current Challenges. Computer Networks 193(2021), 108074. https://doi.org/10.1016/j.comnet.2021.108074",
      "doi": ""
    },
    {
      "text": "Desmond U Patton, Philipp Blandfort, William R Frey, Rossano Schifanella, Kyle McGregor, and Shih-Fu U Chang. 2020. Vatas: An open-source web platform for visual and textual analysis of social media. Journal of the Society for Social Work and Research 11, 1 (2020), 133–155.",
      "doi": ""
    },
    {
      "text": "Desmond Upton Patton, Robert D Eschmann, Caitlin Elsaesser, and Eddie Bocanegra. 2016. Sticks, stones and Facebook accounts: What violence outreach workers know about social media and urban-based gang violence in Chicago. Computers in human behavior 65 (2016), 591–600.",
      "doi": ""
    },
    {
      "text": "Desmond U Patton, William R Frey, Kyle A McGregor, Fei-Tzin Lee, Kathleen McKeown, and Emanuel Moss. 2020. Contextual analysis of social media: The promise and challenge of eliciting context in social media posts with natural language processing. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society. 337–342.",
      "doi": "10.1145/3375627.3375841"
    },
    {
      "text": "Desmond Upton Patton, Patrick Leonard, Loren Cahill, Jamie Macbeth, Shantel Crosby, and Douglas-Wade Brunton. 2016. “Police took my homie I dedicate my life 2 his revenge”: Twitter tensions between gang-involved youth and police in Chicago. Journal of Human Behavior in the Social Environment 26, 3-4(2016), 310–324.",
      "doi": ""
    },
    {
      "text": "Jelena Radulovic, Royce Lee, and Andrew Ortony. 2018. State-dependent memory: neurobiological advances and prospects for translation to dissociative amnesia. Frontiers in Behavioral Neuroscience 12 (2018), 259.",
      "doi": ""
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Magy Seif El-Nasr, Vivien Morris, and Andrea G Parker. 2018. Family health promotion in low-SES neighborhoods: A two-month study of wearable activity tracking. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173883"
    },
    {
      "text": "Mat Santamouris, K Pavlou, A Synnefa, K Niachou, and D Kolokotsa. 2007. Recent progress on passive cooling techniques: Advanced technological developments to improve survivability levels in low-income households. Energy and Buildings 39, 7 (2007), 859–866.",
      "doi": ""
    },
    {
      "text": "David Satcher. 2005. Methods in community-based participatory research for health. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Anna Shcherbina, C. Mattsson, Daryl Waggott, Heidi Salisbury, Jeffrey Christle, Trevor Hastie, Matthew Wheeler, and Euan Ashley. 2017. Accuracy in wrist-worn, sensor-based measurements of heart rate and energy expenditure in a diverse cohort. Journal of Personalized Medicine 7, 2 (2017), 3. https://doi.org/10.3390/jpm7020003",
      "doi": ""
    },
    {
      "text": "Matthew Smuck, Charles A Odonkor, Jonathan K Wilt, Nicolas Schmidt, and Michael A Swiernik. 2021. The emerging clinical role of wearables: factors for successful implementation in healthcare. NPJ Digital Medicine 4, 1 (2021), 1–8.",
      "doi": ""
    },
    {
      "text": "Aparna Sodhi, Nathan Aguilar, Deanna E Choma, Jackie Marie Steve, Desmond Patton, and Marie Crandall. 2020. Social media representations of law enforcement within four diverse Chicago neighborhoods. Journal of Contemporary Ethnography 49, 6 (2020), 832–852.",
      "doi": ""
    },
    {
      "text": "Fiona Ssozi-Mugarura, Edwin Blake, and Ulrike Rivett. 2016. Supporting community needs for rural water management through community-based co-design. In Proceedings of the 14th Participatory Design Conference: Full papers-Volume 1. 91–100.",
      "doi": "10.1145/2940299.2940311"
    },
    {
      "text": "Statista. [n.d.]. Number of connected wearable devices worldwide from 2016 to 2022. https://www.statista.com/statistics/487291/global-connected-wearable-devices/",
      "doi": ""
    },
    {
      "text": "Jennifer S. Stevens, Renuka Reddy, Ye Ji Kim, Sanne J.H. van Rooij, Timothy D. Ely, Stephan Hamann, Kerry J. Ressler, and Tanja Jovanovic. 2018. Episodic memory after trauma exposure: Medial temporal lobe function is positively related to re-experiencing and inversely related to negative affect symptoms. NeuroImage: Clinical 17(2018), 650–658. https://doi.org/10.1016/j.nicl.2017.11.016",
      "doi": ""
    },
    {
      "text": "Elizabeth Stowell, Teresa K O’Leary, Everlyne Kimani, Michael K Paasche-Orlow, Timothy Bickmore, and Andrea G Parker. 2020. Investigating Opportunities for Crowdsourcing in Church-Based Health Interventions: A Participatory Design Study. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376833"
    },
    {
      "text": "Barsa Tandukar, Pooja Vazirani, and Aqueasha Martin-Hammond. 2021. Advocacy Through Design: Partnering to Improve Online Communications and Connections in a Life Plan Community. In Designing Interactive Systems Conference 2021. 1695–1709.",
      "doi": "10.1145/3461778.3462009"
    },
    {
      "text": "Mamello Thinyane, Karthik Bhat, Lauri Goldkind, and Vikram Kamath Cannanure. 2018. Critical participatory design: reflections on engagement and empowerment in a case of a community based organization. In Proceedings of the 15th Participatory Design Conference: Full Papers-Volume 1. 1–10.",
      "doi": "10.1145/3210586.3210601"
    },
    {
      "text": "Khai N. Truong, Gillian R. Hayes, and Gregory D. Abowd. 2006. Storyboarding: An Empirical Determination of Best Practices and Effective Guidelines. In Proceedings of the 6th Conference on Designing Interactive Systems (University Park, PA, USA) (DIS ’06). Association for Computing Machinery, New York, NY, USA, 12–21. https://doi.org/10.1145/1142405.1142410",
      "doi": "10.1145/1142405.1142410"
    },
    {
      "text": "Tsai-Hsuan Tsai, Kevin C Tseng, and Yung-Sheng Chang. 2017. Testing the usability of smartphone surface gestures on different sizes of smartphones by different age groups of users. Computers in Human Behavior 75 (2017), 103–116.",
      "doi": "10.1016/j.chb.2017.05.013"
    },
    {
      "text": "Kim M Unertl, Chris L Schaefbauer, Terrance R Campbell, Charles Senteio, Katie A Siek, Suzanne Bakken, and Tiffany C Veinot. 2016. Integrating community-based participatory research and informatics approaches to improve the engagement and health of underserved populations. Journal of the American Medical Informatics Association 23, 1(2016), 60–73.",
      "doi": ""
    },
    {
      "text": "Michael Veale and Reuben Binns. 2017. Fairer machine learning in the real world: Mitigating discrimination without collecting sensitive data. Big Data and Society 4, 2 (2017), 205395171774353. https://doi.org/10.1177/2053951717743530",
      "doi": ""
    },
    {
      "text": "Morgan Vigil-Hayes, Ann Futterman Collier, Shelby Hagemann, Giovanni Castillo, Keller Mikkelson, Joshua Dingman, Andrew Muñoz, Jade Luther, and Alexandra McLaughlin. 2021. Integrating cultural relevance into a behavioral mHealth intervention for Native American youth. Proceedings of the ACM on human-computer interaction 5, CSCW1(2021), 1–29.",
      "doi": "10.1145/3449239"
    },
    {
      "text": "Vini Vijayan, James P. Connolly, Joan Condell, Nigel McKelvey, and Philip Gardiner. 2021. Review of Wearable Devices and Data Collection Considerations for Connected Health. Sensors 21, 16 (2021). https://doi.org/10.3390/s21165589",
      "doi": ""
    },
    {
      "text": "Emily A. Vogels. 2020. About one-in-five Americans use a smart watch or fitness tracker. https://www.pewresearch.org/fact-tank/2020/01/09/about-one-in-five-americans-use-a-smart-watch-or-fitness-tracker/",
      "doi": ""
    },
    {
      "text": "Nina B Wallerstein and Bonnie Duran. 2006. Using community-based participatory research to address health disparities. Health promotion practice 7, 3 (2006), 312–323.",
      "doi": ""
    },
    {
      "text": "Robin M Weinick, Elizabeth A Jacobs, Lisa Cacari Stone, Alexander N Ortega, and Helen Burstin. 2004. Hispanic healthcare disparities: challenging the myth of a monolithic Hispanic population. Medical care (2004), 313–320.",
      "doi": ""
    },
    {
      "text": "Daniel Weiz, Gagat Anand, and Claus-Peter H. Ernst. 2016. The influence of subjective norm on the usage of smartglasses. Progress in IS (Feb 2016), 1–11. https://doi.org/10.1007/978-3-319-30376-5_1",
      "doi": ""
    },
    {
      "text": "Max J. Western, Miranda E. Armstrong, Ishrat Islam, Kelly Morgan, Una F. Jones, and Mark J. Kelson. 2021. The effectiveness of digital interventions for increasing physical activity in individuals of low socioeconomic status: A systematic review and meta-analysis. International Journal of Behavioral Nutrition and Physical Activity 18, 1(2021). https://doi.org/10.1186/s12966-021-01218-4",
      "doi": ""
    },
    {
      "text": "Meredith Whittaker, Meryl Alper, Cynthia L Bennett, Sara Hendren, Liz Kaziunas, Mara Mills, Meredith Ringel Morris, Joy Rankin, Emily Rogers, Marcel Salas, 2019. Disability, bias, and AI. AI Now Institute (2019).",
      "doi": ""
    },
    {
      "text": "Anna Wojciechowska, Foad Hamidi, Andrés Lucero, and Jessica R Cauchard. 2020. Chasing Lions: Co-designing human-drone interaction in sub-saharan Africa. arXiv preprint arXiv:2005.02022(2020).",
      "doi": ""
    },
    {
      "text": "Susan P Wyche and Laura L Murphy. 2013. Powering the cellphone revolution: findings from mobile phone charging trials in off-grid Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1959–1968.",
      "doi": "10.1145/2470654.2466260"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2017. Speed dating: providing a menu of possible futures. She Ji: The Journal of Design, Economics, and Innovation 3, 1 (2017), 30–50.",
      "doi": ""
    }
  ]
}