{
  "doi": "10.1145/3544548.3581216",
  "title": "Children with ADHD and their Care Ecosystem: Designing Beyond Symptoms",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Designing for children with ADHD has been of increasing interest to the HCI community. However, current approaches do not adequately involve all relevant stakeholders, and primarily focus on addressing symptoms, following a medical model of disability that is extrinsic to neurodivergent interests. To address this, we employed a multi-step, multi-stakeholder approach (N=31). First, we conducted 1) interviews with children with ADHD and their care ecosystem followed by 2) a co-design pilot with one child with ADHD and his therapists and an interview with a UX designer and an occupational therapist. We then employed 3) co-design sessions with neurotypical children and children with ADHD, and 4) a focus group with their therapists. We identified communication and reflection as key concepts for empowering and promoting the well-being of children with ADHD and their care ecosystem. We contribute design implications for future systems aiming to promote the overall well-being of this population.",
  "authors": [
    {
      "name": "Evropi Stefanidi",
      "institution": "University of Bremen, Germany",
      "img": "/do/10.1145/contrib-99659279435/rel-imgonly/evropi-bremen.jpg",
      "acmid": "99659279435",
      "orcid": "0000-0001-5547-6426"
    },
    {
      "name": "Johannes Schöning",
      "institution": "University of St. Gallen, Switzerland",
      "img": "/do/10.1145/contrib-81508685058/rel-imgonly/20160404_5404_dsc_6947_small.jpg",
      "acmid": "81508685058",
      "orcid": "0000-0002-8823-4607"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "UCLIC, UCL, United Kingdom",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    },
    {
      "name": "Jasmin Niess",
      "institution": "University of St. Gallen, Switzerland and University of Oslo, Norway",
      "img": "/do/10.1145/contrib-99659260376/rel-imgonly/niessj.jpg",
      "acmid": "99659260376",
      "orcid": "0000-0003-3529-0653"
    }
  ],
  "references": [
    {
      "text": "Tessa Aarts, Panos Markopoulos, Lars Giling, Tudor Vacaretu, and Sigrid Pillen. 2022. Snoozy: A Chatbot-Based Sleep Diary for Children Aged Eight to Twelve. In Interaction Design and Children. 297–307.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association 2013. Diagnostic and statistical manual of mental disorders (DSM-5®). American Psychiatric Pub.",
      "doi": ""
    },
    {
      "text": "Grace Ataguba. 2018. Maintaining long-distance relationships with children: exploring autobiographical designs and life logging. In Proceedings of the 17th ACM Conference on Interaction Design and Children. 693–698.",
      "doi": "10.1145/3202185.3210801"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, and Anna L Cox. 2020. Trackly: A customisable and pictorial self-tracking app to support agency in multiple sclerosis self-care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376809"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Laura Bartoli, Franca Garzotto, Mirko Gelsomini, Luigi Oliveto, and Matteo Valoriani. 2014. Designing and evaluating touchless playful interaction for ASD children. In Proceedings of the 2014 conference on Interaction design and children. 17–26.",
      "doi": "10.1145/2593968.2593976"
    },
    {
      "text": "Eric PS Baumer and Jed R Brubaker. 2017. Post-userism. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6291–6303.",
      "doi": ""
    },
    {
      "text": "Ashkan Beheshti, Mira-Lynn Chavanon, and Hanna Christiansen. 2020. Emotion dysregulation in adults with attention deficit hyperactivity disorder: a meta-analysis. BMC psychiatry 20, 1 (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Laura Benton, Asimina Vasalou, Rilla Khaled, Hilary Johnson, and Daniel Gooch. 2014. Diversity for design: a framework for involving neurodiverse children in the technology design process. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 3747–3756.",
      "doi": "10.1145/2556288.2557244"
    },
    {
      "text": "Marit Bentvelzen, Jasmin Niess, Mikołaj P Woźniak, and Paweł W Woźniak. 2021. The Development and Validation of the Technology-Supported Reflection Inventory. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3411764.3445673"
    },
    {
      "text": "Marit Bentvelzen, Paweł W Woźniak, Pia SF Herbes, Evropi Stefanidi, and Jasmin Niess. 2022. Revisiting Reflection in HCI: Four Design Resources for Technologies that Support Reflection. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 6, 1 (2022), 1–27.",
      "doi": "10.1145/3517233"
    },
    {
      "text": "Ann Blandford, Dominic Furniss, and Stephann Makri. 2016. Qualitative HCI research: Going behind the scenes. Synthesis lectures on human-centered informatics 9, 1(2016), 1–115.",
      "doi": ""
    },
    {
      "text": "Alicia Blum-Ross and Sonia Livingstone. 2016. Families and screen time: Current advice and emerging research. (2016).",
      "doi": ""
    },
    {
      "text": "Peter Börjesson, Wolmet Barendregt, Eva Eriksson, and Olof Torgersson. 2015. Designing technology for and with developmentally diverse children: a systematic literature review. In Proceedings of the 14th international conference on interaction design and children. 79–88.",
      "doi": "10.1145/2771839.2771848"
    },
    {
      "text": "Evie Browne. 2015. Wellbeing through empowerment, improved enabling environment, and assets.",
      "doi": ""
    },
    {
      "text": "Fred B Bryant, Colette M Smart, and Scott P King. 2005. Using the past to enhance the present: Boosting happiness through positive reminiscence. Journal of Happiness Studies 6, 3 (2005), 227–260.",
      "doi": ""
    },
    {
      "text": "Anne-Emmanuèle Calvès. 2009. Empowerment: The history of a key concept in contemporary development discourse. Revue Tiers Monde4(2009), 735–749.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Nicole B Lee, Bongshin Lee, Wanda Pratt, and Julie A Kientz. 2014. Understanding quantified-selfers’ practices in collecting and exploring personal data. In Proceedings of the SIGCHI conference on human factors in computing systems. 1143–1152.",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Sharon Lynn Chu, Brittany Garcia, and Beth Nam. 2019. Understanding Context in Children’s Use of Smartwatches for Everyday Science Reflections. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. 83–93.",
      "doi": "10.1145/3311927.3323144"
    },
    {
      "text": "Franceli L Cibrian, Gillian R Hayes, and Kimberley D Lakes. 2020. Research Advances in ADHD and Technology. Synthesis Lectures on Assistive, Rehabilitative. and Health-Preserving Technologies 9, 3 (2020), i–156.",
      "doi": ""
    },
    {
      "text": "Franceli L Cibrian, Kimberley D Lakes, Sabrina EB Schuck, and Gillian R Hayes. 2022. The potential for emerging technologies to support self-regulation in children with ADHD: A literature review. International Journal of Child-Computer Interaction 31 (2022), 100421.",
      "doi": "10.1016/j.ijcci.2021.100421"
    },
    {
      "text": "Franceli L Cibrian, Kimberley D Lakes, Arya Tavakoulnia, Kayla Guzman, Sabrina Schuck, and Gillian R Hayes. 2020. Supporting self-regulation of children with ADHD using wearables: tensions and design challenges. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376837"
    },
    {
      "text": "Max Doan, Franceli L Cibrian, Agnes Jang, Nihar Khare, Sean Chang, Aiyuan Li, Sabrina Schuck, Kimberley D Lakes, and Gillian R Hayes. 2020. CoolCraig: A Smart Watch/Phone Application Supporting Co-Regulation of Children with ADHD. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": ""
    },
    {
      "text": "Wesley H Dotson, Eric E Rasmussen, Autumn Shafer, Malinda Colwell, Rebecca L Densley, Adam T Brewer, Marisol C Alonzo, and Laura A Martinez. 2017. Evaluating the ability of the PBS children’s show Daniel Tiger’s Neighborhood to teach skills to two young children with autism spectrum disorder. Behavior analysis in practice 10, 1 (2017), 67–71.",
      "doi": ""
    },
    {
      "text": "Elizabeth Victoria Eikey, Clara Marques Caldeira, Mayara Costa Figueiredo, Yunan Chen, Jessica L Borelli, Melissa Mazmanian, and Kai Zheng. 2021. Beyond self-reflection: introducing the concept of rumination in personal informatics. Personal and Ubiquitous Computing 25, 3 (2021), 601–616.",
      "doi": "10.1007/s00779-021-01573-w"
    },
    {
      "text": "Lizbeth Escobedo, David H Nguyen, LouAnne Boyd, Sen Hirano, Alejandro Rangel, Daniel Garcia-Rosas, Monica Tentori, and Gillian Hayes. 2012. MOSOCO: a mobile assistive tool to support children with autism practicing social skills in real-life situations. In Proceedings of the SIGCHI conference on human factors in computing systems. 2589–2598.",
      "doi": "10.1145/2207676.2208649"
    },
    {
      "text": "SV Faraone, P Asherson, T Banaschewski, J Biederman, JK Buitelaar, JA Ramos-Quiroga, and B Franke. 2015. Attention-deficit/hyperactivity disorder. Nature Rev. Dis. Primers 15020.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi. 2018. Moving beyond user-centered design. interactions 25, 5 (2018), 22–23.",
      "doi": ""
    },
    {
      "text": "Graham Gibbs. 1988. Learning by doing: A guide to teaching and learning methods. Further Education Unit(1988).",
      "doi": ""
    },
    {
      "text": "Noël Gregg and Sally S Scott. 2000. Definition and documentation: Theory, measurement, and the courts. Journal of Learning Disabilities 33, 1 (2000), 5–13.",
      "doi": ""
    },
    {
      "text": "James J Gross. 1998. The emerging field of emotion regulation: An integrative review. Review of general psychology 2, 3 (1998), 271–299.",
      "doi": ""
    },
    {
      "text": "Juan Pablo Hourcade, Stacy R Williams, Ellen A Miller, Kelsey E Huebner, and Lucas J Liang. 2013. Evaluation of tablet apps to encourage social interaction in children with autism spectrum disorders. In Proceedings of the SIGCHI conference on human factors in computing systems. 3197–3206.",
      "doi": "10.1145/2470654.2466438"
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the past: how technology mediated reflection improves well-being. In Proceedings of the SIGCHI conference on human factors in computing systems. 1071–1080.",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Saba Kawas, Ye Yuan, Akeiylah DeWitt, Qiao Jin, Susanne Kirchner, Abigail Bilger, Ethan Grantham, Julie A Kientz, Andrea Tartaro, and Svetlana Yarosh. 2020. Another decade of IDC research: Examining and reflecting on values and ethics. In Proceedings of the interaction design and children conference. 205–215.",
      "doi": "10.1145/3392063.3394436"
    },
    {
      "text": "Marianne Kinnula, Netta Iivari, Tonja Molin-Juustila, Eino Keskitalo, Topi Leinonen, Eetu Mansikkamäki, Toni Käkelä, and Martti Similä. 2017. Cooperation, Combat, or Competence Building-What Do We Mean When We Are ’Empowering Children’ in and through Digital Technology Design?. In ICIS.",
      "doi": ""
    },
    {
      "text": "Rebecca Lane and Jenny Radesky. 2019. Digital media and autism spectrum disorders: Review of evidence, theoretical concerns, and opportunities for intervention. Journal of developmental and behavioral pediatrics: JDBP 40, 5(2019), 364.",
      "doi": ""
    },
    {
      "text": "Lian Loke, Aaron Blishen, Carl Gray, and Naseem Ahmadpour. 2021. Safety, Connection and Reflection: Designing with Therapists for Children with Serious Emotional Behaviour Issues. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3411764.3445178"
    },
    {
      "text": "Sonja Lyubomirsky, Kennon M Sheldon, and David Schkade. 2005. Pursuing happiness: The architecture of sustainable change. Review of general psychology 9, 2 (2005), 111–131.",
      "doi": ""
    },
    {
      "text": "Steve Mann. 1998. Wearable computing as means for personal empowerment. In Proc. 3rd Int. Conf. on Wearable Computing (ICWC). 51–59.",
      "doi": ""
    },
    {
      "text": "Gabriela Marcu, Anind K Dey, and Sara Kiesler. 2014. Designing for collaborative reflection. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare. 9–16.",
      "doi": "10.4108/icst.pervasivehealth.2014.254987"
    },
    {
      "text": "Gabriela Marcu and Allison N Spiller. 2020. Collaborative Aspects of Collecting and Reflecting on Behavioral Data. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376623"
    },
    {
      "text": "Tuuli Mattelmäki and Froukje Sleeswijk Visser. 2011. Lost in Co-X-Interpretations of Co-design and Co-creation. In Proceedings of IASDR’11, 4th World Conference on Design Research, Delft University,. International Association of Societies of Design Research (IASDR).",
      "doi": ""
    },
    {
      "text": "Elgin-Skye McLaren and Alissa N Antle. 2017. Exploring and Evaluating Sound for Helping Children Self-Regulate with a Brain-Computer Application. In Proceedings of the 2017 Conference on Interaction Design and Children. 393–398.",
      "doi": "10.1145/3078072.3084299"
    },
    {
      "text": "Desiree W Murray and Katie Rosanbalm. 2017. Promoting Self-Regulation in Adolescents and Young Adults: A Practice Brief. OPRE Report 2015-82.Office of Planning, Research and Evaluation(2017).",
      "doi": ""
    },
    {
      "text": "Jasmin Niess, Kristina Knaving, Alina Kolb, and Paweł W Woźniak. 2020. Exploring fitness tracker visualisations to avoid rumination. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–11.",
      "doi": "10.1145/3379503.3405662"
    },
    {
      "text": "World Health Organization. 2018. ICD-11: International Classification of Diseases 11th Revision. Retrieved July 4, 2021 from https://icd.who.int/en",
      "doi": ""
    },
    {
      "text": "Keith W Pecor, Georgia Barbayannis, Max Yang, Jacklyn Johnson, Sarah Materasso, Mauricio Borda, Disleidy Garcia, Varsha Garla, and Xue Ming. 2021. Quality of Life Changes during the COVID-19 Pandemic for Caregivers of Children with ADHD and/or ASD. International journal of environmental research and public health 18, 7(2021), 3667.",
      "doi": ""
    },
    {
      "text": "James W Pennebaker and Cindy K Chung. 2011. Expressive writing: Connections to physical and mental health.(2011).",
      "doi": ""
    },
    {
      "text": "Laura Pina, Kael Rowan, Asta Roseway, Paul Johns, Gillian R Hayes, and Mary Czerwinski. 2014. In situ cues for ADHD parenting strategies using mobile technology. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare. 17–24.",
      "doi": "10.4108/icst.pervasivehealth.2014.254958"
    },
    {
      "text": "Guilherme Polanczyk, Maurício Silva De Lima, Bernardo Lessa Horta, Joseph Biederman, and Luis Augusto Rohde. 2007. The worldwide prevalence of ADHD: a systematic review and metaregression analysis. American journal of psychiatry 164, 6 (2007), 942–948.",
      "doi": ""
    },
    {
      "text": "Jenny S Radesky, Caroline Kistin, Staci Eisenberg, Jamie Gross, Gabrielle Block, Barry Zuckerman, and Michael Silverstein. 2016. Parent perspectives on their mobile technology use: The excitement and exhaustion of parenting while connected. Journal of Developmental & Behavioral Pediatrics 37, 9(2016), 694–701.",
      "doi": ""
    },
    {
      "text": "Robert Reid, Alexandra L Trout, and Michalla Schartz. 2005. Self-regulation interventions for children with attention deficit/hyperactivity disorder. Exceptional Children 71, 4 (2005), 361.",
      "doi": ""
    },
    {
      "text": "Olivia K Richards, Adrian Choi, and Gabriela Marcu. 2021. Shared Understanding in Care Coordination for Children’s Behavioral Health. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–25.",
      "doi": "10.1145/3449095"
    },
    {
      "text": "Victoria Rideout and Michael B Robb. 2017. The Common Sense census: Media use by kids age zero to eight. San Francisco, CA: Common Sense Media 263 (2017), 283.",
      "doi": ""
    },
    {
      "text": "Nigel Robb, Michael Leahy, Connie Sung, and Lizbeth Goodman. 2017. Multisensory participatory design for children with special educational needs and disabilities. In Proceedings of the 2017 Conference on Interaction Design and Children. 490–496.",
      "doi": "10.1145/3078072.3084314"
    },
    {
      "text": "Yvonne Rogers and Gary Marsden. 2013. Does he take sugar? Moving beyond the rhetoric of compassion. interactions 20, 4 (2013), 48–57.",
      "doi": ""
    },
    {
      "text": "Perou Ruth, Bitsko H Rebecca, Blumberg J Stephen, Pastor Patricia, Ghandour M Reem, Gfroerer C Joseph, Hedden L Sarra, Crosby E Alex, Visser N Susanna, Schieve A Laura, Parks E Sharyn, Hall E Jeffery, Brody Debra, Simile M Catherine, Thompson W William, Baio Jon, Avenevoli Shelli, Kogan D Michael, Huang N Larke, Centers for Disease Control, and Prevention (CDC). 2013. Mental health surveillance among children–United States, 2005-2011. MMWR Surveill Summ 62 Suppl 2: 1–35(2013).",
      "doi": ""
    },
    {
      "text": "Sirpa Saario, Christopher Hall, and Sue Peckover. 2012. Inter-professional electronic documents and child health: A study of persisting non-electronic communication in the use of electronic documents. Social Science & Medicine 75, 12 (2012), 2207–2214.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Elsa Vaara, Claus Weymann, Markus Bylund, Pedro Ferreira, Nathalie Peira, and Marie Sjölinder. 2010. Mind the body! Designing a mobile stress management application encouraging personal reflection. In Proceedings of the 8th ACM conference on designing interactive systems. 47–56.",
      "doi": "10.1145/1858171.1858182"
    },
    {
      "text": "Hanna Schneider, Malin Eiband, Daniel Ullrich, and Andreas Butz. 2018. Empowerment in HCI-A survey and framework. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3173818"
    },
    {
      "text": "Donald A Schon. 1968. The reflective practitioner. New York (1968).",
      "doi": ""
    },
    {
      "text": "Martin EP Seligman, Tracy A Steen, Nansook Park, and Christopher Peterson. 2005. Positive psychology progress: empirical validation of interventions.American psychologist 60, 5 (2005), 410.",
      "doi": ""
    },
    {
      "text": "Philip Shaw, Argyris Stringaris, Joel Nigg, and Ellen Leibenluft. 2016. Emotion dysregulation in attention deficit hyperactivity disorder. Focus 14, 1 (2016), 127–144.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1990. Human values and the future of technology: A declaration of empowerment. Acm Sigcas Computers and Society 20, 3 (1990), 1–6.",
      "doi": "10.1145/97351.97360"
    },
    {
      "text": "Petr Slovák, Christopher Frauenberger, and Geraldine Fitzpatrick. 2017. Reflective practicum: A framework of sensitising concepts to design for transformative reflection. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2696–2707.",
      "doi": "10.1145/3025453.3025516"
    },
    {
      "text": "RJW Sluis-Thiescheffer, Mathilde M Bekker, JH Eggen, Arnold POS Vermeeren, and Huib de Ridder. 2011. Development and application of a framework for comparing early design methods for young children. Interacting with Computers 23, 1 (2011), 70–84.",
      "doi": "10.1016/j.intcom.2010.10.002"
    },
    {
      "text": "Rachel C Smith, Ole S Iversen, Thomas Hjermitslev, and Aviaja B Lynggaard. 2013. Towards an ecological inquiry in child-computer interaction. In Proceedings of the 12th International Conference on Interaction Design and Children. 183–192.",
      "doi": "10.1145/2485760.2485780"
    },
    {
      "text": "Tobias Sonne and Mads Møller Jensen. 2016. Chillfish: A respiration game for children with adhd. In Proceedings of the TEI’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. 271–278.",
      "doi": "10.1145/2839462.2839480"
    },
    {
      "text": "Tobias Sonne, Paul Marshall, Carsten Obel, Per Hove Thomsen, and Kaj Grønbæk. 2016. An assistive technology design framework for ADHD. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. 60–70.",
      "doi": "10.1145/3010915.3010925"
    },
    {
      "text": "Tobias Sonne, Jörg Müller, Paul Marshall, Carsten Obel, and Kaj Grønbæk. 2016. Changing family practices with assistive technology: MOBERO improves morning and bedtime routines for children with ADHD. In Proceedings of the 2016 CHI conference on human factors in computing systems. 152–164.",
      "doi": "10.1145/2858036.2858157"
    },
    {
      "text": "Tobias Sonne, Carsten Obel, and Kaj Grønbæk. 2015. Designing real time assistive technologies: a study of children with ADHD. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. 34–38.",
      "doi": "10.1145/2838739.2838815"
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Os Keyes, and Geraldine Fitzpatrick. 2019. Agency of autistic children in technology research—A critical literature review. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 6(2019), 1–40.",
      "doi": "10.1145/3344919"
    },
    {
      "text": "Katta Spiel and Kathrin Gerling. 2021. The Purpose of Play: How HCI Games Research Fails Neurodivergent Populations. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 2(2021), 1–40.",
      "doi": "10.1145/3432245"
    },
    {
      "text": "Evropi Stefanidi, Johannes Schöning, Sebastian S Feger, Paul Marshall, Yvonne Rogers, and Jasmin Niess. 2022. Designing for Care Ecosystems: a Literature Review of Technologies for Children with ADHD. In Interaction Design and Children. 13–25.",
      "doi": ""
    },
    {
      "text": "Silvia Torsi, Loredana Verardi, and Carmelo Ardito. 2019. Children’s Reflection in Action with DIY. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": ""
    },
    {
      "text": "Maarten Van Mechelen, Line Have Musaeus, Ole Sejer Iversen, Christian Dindler, and Arthur Hjorth. 2021. A Systematic Review of Empowerment in Child-Computer Interaction Research. In Interaction Design and Children. 119–130.",
      "doi": ""
    },
    {
      "text": "Peter M Wehmeier, Alexander Schacht, and Russell A Barkley. 2010. Social and emotional impairment in children and adolescents with ADHD and the impact on quality of life. Journal of Adolescent health 46, 3 (2010), 209–217.",
      "doi": ""
    },
    {
      "text": "Orad Weisberg, Ayelet GalOz, Ruth Berkowitz, Noa Weiss, Oran Peretz, Shlomi Azoulai, Daphne KoplemanRubin, and Oren Zuckerman. 2014. TangiPlan: designing an assistive technology to enhance executive functioning among children with ADHD. In Proceedings of the 2014 conference on Interaction design and children. 293–296.",
      "doi": "10.1145/2593968.2610475"
    },
    {
      "text": "Judith Bula Wise. 2005. Empowerment practice with families in distress. Columbia University Press.",
      "doi": ""
    },
    {
      "text": "Nathan D Zasler, Michael F Martelli, and Harvey E Jacobs. 2013. Neurobehavioral disorders. Handbook of clinical neurology 110 (2013), 377–388.",
      "doi": ""
    },
    {
      "text": "Oren Zuckerman, Ayelet Gal-Oz, Neta Tamir, and Daphne Kopelman-Rubin. 2015. Initial validation of an assistive technology to enhance executive functioning among children with ADHD. In Proceedings of the 14th international conference on interaction design and children. 299–302.",
      "doi": "10.1145/2771839.2771901"
    }
  ]
}