{
  "doi": "10.1145/3544548.3580809",
  "title": "“Easier or Harder, Depending on Who the Hearing Person Is”: Codesigning Videoconferencing Tools for Small Groups with Mixed Hearing Status",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "With improvements in automated speech recognition and increased use of videoconferencing, real-time captioning has changed significantly. This shift toward broadly available but less accurate captioning invites exploration of the role hearing conversation partners play in shaping the accessibility of a conversation to d/Deaf and hard of hearing (DHH) captioning users. While recent work has explored DHH individuals’ videoconferencing experiences with captioning, we focus on established groups’ current practices and priorities for future tools to support more accessible online conversations. Our study consists of three codesign sessions, conducted with four groups (17 participants total, 10 DHH, 7 hearing). We found that established groups crafted social accessibility norms that met their relational contexts. We also identify promising directions for future captioning design, including the need to standardize speaker identification and customization, opportunities to provide behavioral feedback during a conversation, and ways that videoconferencing platforms could enable groups to set and share norms.",
  "tags": [
    "d/Deaf and hard of hearing",
    "Videoconferencing",
    "Accessibility",
    "Captioning"
  ],
  "authors": [
    {
      "name": "Emma J McDonnell",
      "institution": "Human Centered Design and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702455",
      "orcid": "0000-0001-7976-0886"
    },
    {
      "name": "Soo Hyun Moon",
      "institution": "Human-Centered Design & Engineering, University of Washington, United States and Human-Centered Design & Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779279",
      "orcid": "0000-0002-4814-5335"
    },
    {
      "name": "Lucy Jiang",
      "institution": "Computing and Information Sciences, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779249",
      "orcid": "0000-0001-9582-9468"
    },
    {
      "name": "Steven M. Goodman",
      "institution": "Human Centered Design and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81464650547",
      "orcid": "0000-0002-7381-1942"
    },
    {
      "name": "Raja Kushalnagar",
      "institution": "Gallaudet University, United States",
      "img": "/do/10.1145/contrib-81472654980/rel-imgonly/rajaweb.jpg",
      "acmid": "81472654980",
      "orcid": "0000-0002-0493-413X"
    },
    {
      "name": "Jon E. Froehlich",
      "institution": "Paul G. Allen School of Computer Science & Engineering, University of Washington, United States",
      "img": "/do/10.1145/contrib-81331492504/rel-imgonly/81331492504.jpg",
      "acmid": "81331492504",
      "orcid": "0000-0001-8291-3353"
    },
    {
      "name": "Leah Findlater",
      "institution": "Human Centered Design and Engineering, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100170743",
      "orcid": "0000-0002-5619-4452"
    }
  ],
  "references": [
    {
      "text": "Akhter Al Amin, Saad Hassan, Sooyeon Lee, and Matt Huenerfauth. 2022. Watch It, Don't Imagine It: Creating a Better Caption-Occlusion Metric by Collecting More Ecologically Valid Judgments from DHH Viewers. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), 1–14. https://doi.org/10.1145/3491102.3517681",
      "doi": "10.1145/3491102.3517681"
    },
    {
      "text": "H.-Dirksen L. Bauman and Joseph J. Murray. 2014. Deaf Gain: Raising the Stakes for Human Diversity. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Macy Bayern. 2020. Zoom grew by 574% in less than two months, but Skype for Business reigns supreme. TechRepublic. Retrieved September 5, 2022 from https://www.techrepublic.com/article/zoom-grew-by-574-in-less-than-two-months-but-skype-for-business-reigns-supreme/",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence as a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS ’18, 161–173. https://doi.org/10.1145/3234695.3236348",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Larwan Berke, Khaled Albusays, Matthew Seita, and Matt Huenerfauth. 2019. Preferred Appearance of Captions Generated by Automatic Speech Recognition for Deaf and Hard-of-Hearing Viewers. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems, 1–6. https://doi.org/10.1145/3290607.3312921",
      "doi": "10.1145/3290607.3312921"
    },
    {
      "text": "Larwan Berke, Christopher Caulfield, and Matt Huenerfauth. 2017. Deaf and Hard-of-Hearing Perspectives on Imperfect Automatic Speech Recognition for Captioning One-on-One Meetings. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, 155–164. https://doi.org/10.1145/3132525.3132541",
      "doi": "10.1145/3132525.3132541"
    },
    {
      "text": "Danielle Bragg, Nicholas Huynh, and Richard E. Ladner. 2016. A Personalizable Mobile Sound Detector App Design for Deaf and Hard-of-Hearing Users. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’16), 3–13. https://doi.org/10.1145/2982142.2982171",
      "doi": "10.1145/2982142.2982171"
    },
    {
      "text": "Alessandra Brandão, Hugo Nicolau, Shreya Tadas, and Vicki L. Hanson. 2016. SlidePacer: A Presentation Delivery Tool for Instructors of Deaf and Hard of Hearing Students. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’16), 25–32. https://doi.org/10.1145/2982142.2982177",
      "doi": "10.1145/2982142.2982177"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Thematic Analysis: A Practical Guide. SAGE.",
      "doi": ""
    },
    {
      "text": "Janine Butler, Brian Trager, and Byron Behm. 2019. Exploration of Automatic Speech Recognition for Deaf and Hard of Hearing Students in Higher Education Classes. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’19), 32–42. https://doi.org/10.1145/3308561.3353772",
      "doi": "10.1145/3308561.3353772"
    },
    {
      "text": "Anna C. Cavender, Jeffrey P. Bigham, and Richard E. Ladner. 2009. ClassInFocus: enabling improved visual attention strategies for deaf and hard of hearing students. In Proceeding of the eleventh international ACM SIGACCESS conference on Computers and accessibility - ASSETS ’09, 67. https://doi.org/10.1145/1639642.1639656",
      "doi": "10.1145/1639642.1639656"
    },
    {
      "text": "Becca Dingman, Garreth W. Tigwell, and Kristen Shinohara. 2021. Designing a Podcast Platform for Deaf and Hard of Hearing Users. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’21), 1–4. https://doi.org/10.1145/3441852.3476523",
      "doi": "10.1145/3441852.3476523"
    },
    {
      "text": "Claire Edwards and Gill Harold. 2014. DeafSpace and the principles of universal design. Disability and Rehabilitation 36, 16: 1350–1359. https://doi.org/10.3109/09638288.2014.913710",
      "doi": ""
    },
    {
      "text": "Lisa B. Elliot, Michael Stinson, Syed Ahmed, and Donna Easton. 2017. User Experiences When Testing a Messaging App for Communication Between Individuals who are Hearing and Deaf or Hard of Hearing. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, 405–406. https://doi.org/10.1145/3132525.3134798",
      "doi": "10.1145/3132525.3134798"
    },
    {
      "text": "Abraham Glasser, Kesavan Kushalnagar, and Raja Kushalnagar. 2017. Deaf, Hard of Hearing, and Hearing Perspectives on Using Automatic Speech Recognition in Conversation. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, 427–432. https://doi.org/10.1145/3132525.3134781",
      "doi": "10.1145/3132525.3134781"
    },
    {
      "text": "Abraham T. Glasser, Kesavan R. Kushalnagar, and Raja S. Kushalnagar. 2017. Feasibility of Using Automatic Speech Recognition with Voices of Deaf and Hard-of-Hearing Individuals. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, 373–374. https://doi.org/10.1145/3132525.3134819",
      "doi": "10.1145/3132525.3134819"
    },
    {
      "text": "Steven M. Goodman, Ping Liu, Dhruv Jain, Emma J. McDonnell, Jon E. Froehlich, and Leah Findlater. 2021. Toward User-Driven Sound Recognizer Personalization with People Who Are d/Deaf or Hard of Hearing. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 2: 63:1-63:23. https://doi.org/10.1145/3463501",
      "doi": "10.1145/3463501"
    },
    {
      "text": "Benjamin M. Gorman, Michael Crabb, and Michael Armstrong. 2021. Adaptive Subtitles: Preferences and Trade-Offs in Real-Time Media Adaption. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–11. https://doi.org/10.1145/3411764.3445509",
      "doi": "10.1145/3411764.3445509"
    },
    {
      "text": "Michael Gower, Brent Shiver, Charu Pandhi, and Shari Trewin. 2018. Leveraging Pauses to Improve Video Captions. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’18), 414–416. https://doi.org/10.1145/3234695.3241023",
      "doi": "10.1145/3234695.3241023"
    },
    {
      "text": "Ru Guo, Yiru Yang, Johnson Kuang, Xue Bin, Dhruv Jain, Steven Goodman, Leah Findlater, and Jon Froehlich. 2020. HoloSound: Combining Speech and Sound Identification for Deaf or Hard of Hearing Users on a Head-mounted Display. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’20), 1–4. https://doi.org/10.1145/3373625.3418031",
      "doi": "10.1145/3373625.3418031"
    },
    {
      "text": "Christina Harrington and Tawanna R Dillahunt. 2021. Eliciting Tech Futures Among Black Young Adults: A Case Study of Remote Speculative Co-Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), 1–15. https://doi.org/10.1145/3411764.3445723",
      "doi": "10.1145/3411764.3445723"
    },
    {
      "text": "Rebecca Perkins Harrington and Gregg C. Vanderheiden. 2013. Crowd caption correction (CCC). In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’13), 1–2. https://doi.org/10.1145/2513383.2513413",
      "doi": "10.1145/2513383.2513413"
    },
    {
      "text": "23. Richang Hong, Meng Wang, Mengdi Xu, Shuicheng Yan, and Tat-Seng Chua. 2010. Dynamic captioning: video accessibility enhancement for hearing impairment. In Proceedings of the 18th ACM international conference on Multimedia (MM ’10), 421–430. https://doi.org/10.1145/1873951.1874013",
      "doi": "10.1145/1873951.1874013"
    },
    {
      "text": "Dhruv Jain, Leah Findlater, Jamie Gilkeson, Benjamin Holland, Ramani Duraiswami, Dmitry Zotkin, Christian Vogler, and Jon E. Froehlich. 2015. Head-Mounted Display Visualizations to Support Sound Awareness for the Deaf and Hard of Hearing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), 241–250. https://doi.org/10.1145/2702123.2702393",
      "doi": "10.1145/2702123.2702393"
    },
    {
      "text": "Dhruv Jain, Rachel Franz, Leah Findlater, Jackson Cannon, Raja Kushalnagar, and Jon Froehlich. 2018. Towards Accessible Conversations in a Mobile Context for People who are Deaf and Hard of Hearing. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility, 81–92. https://doi.org/10.1145/3234695.3236362",
      "doi": "10.1145/3234695.3236362"
    },
    {
      "text": "Dhruv Jain, Khoa Huynh Anh Nguyen, Steven M. Goodman, Rachel Grossman-Kahn, Hung Ngo, Aditya Kusupati, Ruofei Du, Alex Olwal, Leah Findlater, and Jon E. Froehlich. 2022. ProtoSound: A Personalized and Scalable Sound Recognition System for Deaf and Hard-of-Hearing Users. In CHI Conference on Human Factors in Computing Systems, 1–16. https://doi.org/10.1145/3491102.3502020",
      "doi": "10.1145/3491102.3502020"
    },
    {
      "text": "Carl Jensema. 1998. Viewer Reaction to Different Television Captioning Speeds. American Annals of the Deaf 143, 4: 318–324. https://doi.org/10.1353/aad.2012.0073",
      "doi": ""
    },
    {
      "text": "Sushant Kafle, Becca Dingman, and Matt Huenerfauth. 2021. Deaf and Hard-of-hearing Users Evaluating Designs for Highlighting Key Words in Educational Lecture Videos. ACM Transactions on Accessible Computing 14, 4: 20:1-20:24. https://doi.org/10.1145/3470651",
      "doi": "10.1145/3470651"
    },
    {
      "text": "Saba Kawas, George Karalis, Tzu Wen, and Richard E. Ladner. 2016. Improving Real-Time Captioning Experiences for Deaf and Hard of Hearing Students. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility, 15–23. https://doi.org/10.1145/2982142.2982164",
      "doi": "10.1145/2982142.2982164"
    },
    {
      "text": "Allison Koenecke, Andrew Nam, Emily Lake, Joe Nudell, Minnie Quartey, Zion Mengesha, Connor Toups, John R. Rickford, Dan Jurafsky, and Sharad Goel. 2020. Racial disparities in automated speech recognition. Proceedings of the National Academy of Sciences 117, 14: 7684–7689. https://doi.org/10.1073/pnas.1915768117",
      "doi": ""
    },
    {
      "text": "Kuno Kurzhals, Fabian Göbel, Katrin Angerbauer, Michael Sedlmair, and Martin Raubal. 2020. A View on the Viewer: Gaze-Adaptive Captions for Videos. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–12. https://doi.org/10.1145/3313831.3376266",
      "doi": "10.1145/3313831.3376266"
    },
    {
      "text": "Raja Kushalnagar and Poorna Kushalnagar. 2014. Collaborative Gaze Cues and Replay for Deaf and Hard of Hearing Students. In Computers Helping People with Special Needs (Lecture Notes in Computer Science), 415–422. https://doi.org/10.1007/978-3-319-08599-9_63",
      "doi": ""
    },
    {
      "text": "Raja S. Kushalnagar, Gary W. Behm, Aaron W. Kelstone, and Shareef Ali. 2015. Tracked Speech-To-Text Display: Enhancing Accessibility and Readability of Real-Time Speech-To-Text. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS ’15), 223–230. https://doi.org/10.1145/2700648.2809843",
      "doi": "10.1145/2700648.2809843"
    },
    {
      "text": "Raja S. Kushalnagar, Gary W. Behm, Joseph S. Stanislow, and Vasu Gupta. 2014. Enhancing caption accessibility through simultaneous multimodal information: visual-tactile captions. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility (ASSETS ’14), 185–192. https://doi.org/10.1145/2661334.2661381",
      "doi": "10.1145/2661334.2661381"
    },
    {
      "text": "Raja S. Kushalnagar and Christian Vogler. 2020. Teleconference Accessibility and Guidelines for Deaf and Hard of Hearing Users. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’20), 1–6. https://doi.org/10.1145/3373625.3417299",
      "doi": "10.1145/3373625.3417299"
    },
    {
      "text": "Paddy Ladd. 2005. Deafhood: A concept stressing possibilities, not deficits. Scandinavian Journal of Public Health 33, 66_suppl: 12–17. https://doi.org/10.1080/14034950510033318",
      "doi": ""
    },
    {
      "text": "Daniel G. Lee, Deborah I. Fels, and John Patrick Udo. 2007. Emotive captioning. Computers in Entertainment 5, 2: 11. https://doi.org/10.1145/1279540.1279551",
      "doi": "10.1145/1279540.1279551"
    },
    {
      "text": "Kim Lyons. 2021. Zoom now has auto-generated captions available for free accounts. The Verge. Retrieved September 13, 2022 from https://www.theverge.com/2021/10/25/22744704/zoom-auto-generated-captions-available-free-accounts-accessibility",
      "doi": ""
    },
    {
      "text": "Kelly Mack, Maitraye Das, Dhruv Jain, Danielle Bragg, John Tang, Andrew Begel, Erin Beneteau, Josh Urban Davis, Abraham Glasser, Joon Sung Park, and Venkatesh Potluri. 2021. Mixed Abilities and Varied Experiences: a group autoethnography of a virtual summer internship. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’21), 1–13. https://doi.org/10.1145/3441852.3471199",
      "doi": "10.1145/3441852.3471199"
    },
    {
      "text": "Kelly Mack, Emma McDonnell, Venkatesh Potluri, Maggie Xu, Jailyn Zabala, Jeffrey Bigham, Jennifer Mankoff, and Cynthia Bennett. 2022. Anticipate and Adjust: Cultivating Access in Human-Centered Methods. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), 1–18. https://doi.org/10.1145/3491102.3501882",
      "doi": "10.1145/3491102.3501882"
    },
    {
      "text": "James R. Mallory, Michael Stinson, Lisa Elliot, and Donna Easton. 2017. Personal Perspectives on Using Automatic Speech Recognition to Facilitate Communication between Deaf Students and Hearing Customers. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, 419–421. https://doi.org/10.1145/3132525.3134779",
      "doi": "10.1145/3132525.3134779"
    },
    {
      "text": "Emma McDonnell. 2022. Understanding Social and Environmental Factors to Enable Collective Access Approaches to the Design of Captioning Technology. In Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’22), 1–8. https://doi.org/10.1145/3517428.3550417",
      "doi": "10.1145/3517428.3550417"
    },
    {
      "text": "Emma J. McDonnell, Ping Liu, Steven M. Goodman, Raja Kushalnagar, Jon E. Froehlich, and Leah Findlater. 2021. Social, Environmental, and Technical: Factors at Play in the Current Use and Future Design of Small-Group Captioning. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2: 434:1-434:25. https://doi.org/10.1145/3479578",
      "doi": "10.1145/3479578"
    },
    {
      "text": "Mia Mingus. 2011. Changing the Framework: Disability Justice. Leaving Evidence. Retrieved March 20, 2020 from https://leavingevidence.wordpress.com/2011/02/12/changing-the-framework-disability-justice/",
      "doi": ""
    },
    {
      "text": "Mia Mingus. 2017. Access Intimacy, Interdependence and Disability Justice. Leaving Evidence. Retrieved February 4, 2020 from https://leavingevidence.wordpress.com/2017/04/12/access-intimacy-interdependence-and-disability-justice/",
      "doi": ""
    },
    {
      "text": "Michael Oliver. 1983. Social Work with Disabled People. Macmillan.",
      "doi": ""
    },
    {
      "text": "Yi-Hao Peng, Ming-Wei Hsi, Paul Taele, Ting-Yu Lin, Po-En Lai, Leon Hsu, Tzu-chuan Chen, Te-Yen Wu, Yu-An Chen, Hsien-Hui Tang, and Mike Y. Chen. 2018. SpeechBubbles: Enhancing Captioning Experiences for Deaf and Hard-of-Hearing People in Group Conversations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–10. https://doi.org/10.1145/3173574.3173867",
      "doi": "10.1145/3173574.3173867"
    },
    {
      "text": "Agnès Piquard-Kipffer, Odile Mella, Jérémy Miranda, Denis Jouvet, and Luiza Orosanu. 2015. Qualitative investigation of the display of speech recognition results for communication with deaf people. In Proceedings of SLPAT 2015: 6th Workshop on Speech and Language Processing for Assistive Technologies, 36–41. https://doi.org/10.18653/v1/W15-5107",
      "doi": ""
    },
    {
      "text": "Anwesha Roy. 2021. How Reliable is Speech-to-Text in 2021? CX Today. Retrieved September 13, 2022 from https://www.cxtoday.com/speech-analytics/how-reliable-is-speech-to-text-in-2021/",
      "doi": ""
    },
    {
      "text": "Jazz Rui Xia Ang, Ping Liu, Emma McDonnell, and Sarah Coppola. 2022. “In this online environment, we're limited”: Exploring Inclusive Video Conferencing Design for Signers. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), 1–16. https://doi.org/10.1145/3491102.3517488",
      "doi": "10.1145/3491102.3517488"
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. CoDesign 4, 1: 5–18. https://doi.org/10.1080/15710880701875068",
      "doi": ""
    },
    {
      "text": "Matthew Seita, Khaled Albusays, Sushant Kafle, Michael Stinson, and Matt Huenerfauth. 2018. Behavioral Changes in Speakers who are Automatically Captioned in Meetings with Deaf or Hard-of-Hearing Peers. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’18), 68–80. https://doi.org/10.1145/3234695.3236355",
      "doi": "10.1145/3234695.3236355"
    },
    {
      "text": "Matthew Seita, Sarah Andrew, and Matt Huenerfauth. 2021. Deaf and hard-of-hearing users’ preferences for hearing speakers’ behavior during technology-mediated in-person and remote conversations. In Proceedings of the 18th International Web for All Conference, 1–12. https://doi.org/10.1145/3430263.3452430",
      "doi": "10.1145/3430263.3452430"
    },
    {
      "text": "Matthew Seita and Matt Huenerfauth. 2020. Deaf Individuals’ Views on Speaking Behaviors of Hearing Peers when Using an Automatic Captioning App. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), 1–8. https://doi.org/10.1145/3334480.3383083",
      "doi": "10.1145/3334480.3383083"
    },
    {
      "text": "Matthew Seita, Sooyeon Lee, Sarah Andrew, Kristen Shinohara, and Matt Huenerfauth. 2022. Remotely Co-Designing Features for Communication Applications using Automatic Captioning with Deaf and Hearing Pairs. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), 1–13. https://doi.org/10.1145/3491102.3501843",
      "doi": "10.1145/3491102.3501843"
    },
    {
      "text": "Brent N. Shiver and Rosalee J. Wolfe. 2015. Evaluating Alternatives for Better Deaf Accessibility to Selected Web-Based Multimedia. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility - ASSETS ’15, 231–238. https://doi.org/10.1145/2700648.2809857",
      "doi": "10.1145/2700648.2809857"
    },
    {
      "text": "Sins Invalid. 2019. Skin Tooth and Bone: The Basis of Movement is Our People, a Disability Justice Primer. Sins Invalid.",
      "doi": ""
    },
    {
      "text": "John Tang. 2021. Understanding the Telework Experience of People with Disabilities. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1: 30:1-30:27. https://doi.org/10.1145/3449104",
      "doi": "10.1145/3449104"
    },
    {
      "text": "Máté Ákos Tündik, György Szaszák, G. Gosztolya, and A. Beke. 2018. User-centric Evaluation of Automatic Punctuation in ASR Closed Captioning. In INTERSPEECH. https://doi.org/10.21437/Interspeech.2018-1352",
      "doi": ""
    },
    {
      "text": "Christian Vogler, Paula Tucker, and Norman Williams. 2013. Mixed local and remote participation in teleconferences from a deaf and hard of hearing perspective. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’13), 1–5. https://doi.org/10.1145/2513383.2517035",
      "doi": "10.1145/2513383.2517035"
    },
    {
      "text": "Emily Q. Wang and Anne Marie Piper. 2018. Accessibility in Action: Co-Located Collaboration among Deaf and Hearing Professionals. Proceedings of the ACM on Human-Computer Interaction 2, CSCW: 180:1-180:25. https://doi.org/10.1145/3274449",
      "doi": "10.1145/3274449"
    },
    {
      "text": "Kenta Yamamoto, Ippei Suzuki, Akihisa Shitara, and Yoichi Ochiai. 2021. See-Through Captions: Real-Time Captioning on Transparent Display for Deaf and Hard-of-Hearing People. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’21), 1–4. https://doi.org/10.1145/3441852.3476551",
      "doi": "10.1145/3441852.3476551"
    },
    {
      "text": "Matthijs Zwinderman, Rinze Leenheer, Azadeh Shirzad, Nikolay Chupriyanov, Glenn Veugen, Biyong Zhang, and Panos Markopoulos. 2013. Using Video Prototypes for Evaluating Design Concepts with Users: A Comparison to Usability Testing. In Human-Computer Interaction – INTERACT 2013 (Lecture Notes in Computer Science), 774–781. https://doi.org/10.1007/978-3-642-40480-1_55",
      "doi": ""
    },
    {
      "text": "2017. Communicating With Deaf Individuals. National Deaf Center. Retrieved September 14, 2022 from https://www.nationaldeafcenter.org/resource/communicating-deaf-individuals",
      "doi": ""
    },
    {
      "text": "Lost in Transcription: Auto-Captions Often Fall Short on Zoom, Facebook, Google Meet, and YouTube. Consumer Reports. Retrieved September 13, 2022 from https://www.consumerreports.org/disability-rights/auto-captions-often-fall-short-on-zoom-facebook-and-others-a9742392879/",
      "doi": ""
    },
    {
      "text": "Use live captions in a Teams meeting. Retrieved September 13, 2022 from https://support.microsoft.com/en-us/office/use-live-captions-in-a-teams-meeting-4be2d304-f675-4b57-8347-cbd000a21260",
      "doi": ""
    },
    {
      "text": "Use captions in a meeting - Computer - Google Meet Help. Retrieved September 13, 2022 from https://support.google.com/meet/answer/9300310?hl=en&co=GENIE.Platform%3DDesktop",
      "doi": ""
    },
    {
      "text": "Certified Realtime Captioner (CRC) | NCRA. Retrieved July 11, 2022 from https://www.ncra.org/certification/NCRA-Certifications/certified-realtime-captioner",
      "doi": ""
    },
    {
      "text": "Live Transcribe | Speech to Text App. Android. Retrieved September 8, 2022 from https://www.android.com/accessibility/live-transcribe/",
      "doi": ""
    },
    {
      "text": "DeafSpace. Retrieved September 16, 2020 from https://www.gallaudet.edu/campus-design-and-planning/deafspace",
      "doi": ""
    }
  ]
}