{
  "doi": "10.1145/3544548.3581399",
  "title": "Toward Inclusive Mindsets: Design Opportunities to Represent Neurodivergent Work Experiences to Neurotypical Co-Workers in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Inclusive workplaces require mutual efforts between neurotypical (NT) and neurodivergent (ND) employees to understand one another’s viewpoints and experiences. Currently, the majority of inclusivity training places the burden of change on NDs to conform to NT social-behavioral standards. Our research examines moving toward a more equal effort distribution by exploring virtual reality (VR) design opportunities to build NTs’ understanding of ND workplace experiences. Using participatory design, including generative toolkits and design meetings, we surfaced two main themes that could bridge gaps in understanding: (1) NTs’ recognition of NDs’ strengths and efforts at work, and (2) NTs’ understanding of NDs’ differences. We present a strengths-based assessment of ND traits in the workplace, focusing on how workplaces can support NDs’ success. Finally, we propose VR simulation designs that communicate these themes to represent ND experiences, emphasizing their strengths and viewpoints so that NT co-workers can better empathize and accommodate them.",
  "tags": [
    "neurodiversity",
    "virtual reality",
    "workplace",
    "empathy-building"
  ],
  "authors": [
    {
      "name": "Rachel Lowy",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780089",
      "orcid": "0000-0003-1940-6441"
    },
    {
      "name": "Lan Gao",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782504",
      "orcid": "0000-0002-3429-5172"
    },
    {
      "name": "Kaely Hall",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236517",
      "orcid": "0000-0003-1266-8908"
    },
    {
      "name": "Jennifer G Kim",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498653663",
      "orcid": "0000-0003-3253-3963"
    }
  ],
  "references": [
    {
      "text": "Sun Joo Ahn, Joshua Bostick, Elise Ogle, Kristine L Nowak, Kara T McGillicuddy, and Jeremy N Bailenson. 2016. Experiencing nature: Embodying animals in immersive virtual environments increases inclusion of nature in self and involvement with nature. Journal of Computer-Mediated Communication 21, 6 (2016), 399–419.",
      "doi": "10.1111/jcc4.12173"
    },
    {
      "text": "Sun Joo Ahn, Amanda Minh Tran Le, and Jeremy Bailenson. 2013. The effect of embodied experiences on self-other merging, attitude, and helping behavior. Media Psychology 16, 1 (2013), 7–38.",
      "doi": ""
    },
    {
      "text": "Hala Annabi and Jill Locke. 2019. A theoretical framework for investigating the context for creating employment success in information technology for individuals with autism. Journal of Management & Organization 25, 4 (2019), 499–515.",
      "doi": ""
    },
    {
      "text": "Hala Annabi, Karthika Sundaresan, and Annuska Zolyomi. 2017. It’s not just about attention to details: Redefining the talents autistic software developers bring to software development. (2017).",
      "doi": ""
    },
    {
      "text": "Bruno J Anthony, Hillary A Robertson, Alyssa Verbalis, Yetta Myrick, Mary Troxel, Sydney Seese, and Laura Gutermuth Anthony. 2020. Increasing autism acceptance: the impact of the Sesame Street “See Amazing in All Children” initiative. Autism 24, 1 (2020), 95–108.",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett and Daniela K Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the\" Other\". In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Laura Benton, Asimina Vasalou, Rilla Khaled, Hilary Johnson, and Daniel Gooch. 2014. Diversity for Design: A Framework for Involving Neurodiverse Children in the Technology Design Process. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3747–3756. https://doi.org/10.1145/2556288.2557244",
      "doi": "10.1145/2556288.2557244"
    },
    {
      "text": "William M Bolman. 2008. Brief report: 25-year follow-up of a high-functioning autistic child. Journal of Autism and Developmental Disorders 38, 1 (2008), 181–183.",
      "doi": ""
    },
    {
      "text": "BBC CAPE. 2022. https://www.bbc.co.uk/neurodiversity. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Tanvir Irfan Chowdhury, Sharif Mohammad Shahnewaz Ferdous, and John Quarles. 2019. VR disability simulation reduces implicit bias towards persons with disabilities. IEEE Transactions on Visualization and Computer Graphics 27, 6(2019), 3079–3090.",
      "doi": ""
    },
    {
      "text": "James J Cummings and Jeremy N Bailenson. 2016. How immersive is enough? A meta-analysis of the effect of immersive technology on user presence. Media psychology 19, 2 (2016), 272–309.",
      "doi": ""
    },
    {
      "text": "Max T Curran, Jeremy Raboff Gordon, Lily Lin, Priyashri Kamlesh Sridhar, and John Chuang. 2019. Understanding digitally-mediated empathy: An exploration of visual, narrative, and biosensory informational cues. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300844"
    },
    {
      "text": "Maitraye Das, John Tang, Kathryn E Ringland, and Anne Marie Piper. 2021. Towards accessible remote work: Understanding work-from-home practices of neurodivergent professionals. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–30.",
      "doi": "10.1145/3449282"
    },
    {
      "text": "Nancy Doyle and Almuth McDowall. 2021. Diamond in the rough? An “empty review” of research into “neurodiversity” and a road map for developing the inclusion agenda. Equality, Diversity and Inclusion: An International Journal 41, 3(2021), 352–382.",
      "doi": ""
    },
    {
      "text": "Autism TMI Virtual Reality Experience. 2022. https://www.youtube.com/watch?v=DgDR_gYk_a8. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Project Cape Neurodiverse Immersive 360VR experience. 2022. https://www.youtube.com/watch?v=ZLyGuVTH8sA. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Caroline J Falconer, Aitor Rovira, John A King, Paul Gilbert, Angus Antley, Pasco Fearon, Neil Ralph, Mel Slater, and Chris R Brewin. 2016. Embodying self-compassion within virtual reality and its effects on patients with depression. BJPsych open 2, 1 (2016), 74–80.",
      "doi": ""
    },
    {
      "text": "Ashley Flower, Matthew K Burns, and Nicole A Bottsford-Miller. 2007. Meta-analysis of disability simulation research. Remedial and Special Education 28, 2 (2007), 72–79.",
      "doi": ""
    },
    {
      "text": "Miro: The Visual Collaboration Platform for Every Team. 2022. https://www.miro.com. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Shaun Gallagher. 2012. Empathy, simulation, and narrative. Science in context 25, 3 (2012), 355–381.",
      "doi": ""
    },
    {
      "text": "Domingo García-Villamisar, Paul Wehman, and Maria Diaz Navarro. 2002. Changes in the quality of autistic people’s life that work in supported and sheltered employment. A 5-year follow-up study. Journal of Vocational Rehabilitation 17, 4 (2002), 309–312.",
      "doi": ""
    },
    {
      "text": "Hunter Gehlbach, Geoff Marietta, Aaron M King, Cody Karutz, Jeremy N Bailenson, and Chris Dede. 2015. Many ways to walk a mile in another’s moccasins: Type of social perspective taking and its effect on negotiation outcomes. Computers in Human Behavior 52 (2015), 523–532.",
      "doi": "10.1016/j.chb.2014.12.035"
    },
    {
      "text": "David Hagner and Bernard F Cooney. 2005. “I do that for everybody”: Supervising employees with autism. Focus on autism and other developmental disabilities 20, 2(2005), 91–97.",
      "doi": ""
    },
    {
      "text": "Charmine EJ Härtel, Günter F Härtel, and Rick B Trumble. 2013. IDADA: The individual difference approach to assessing and developing diversity awareness. Journal of Management & Organization 19, 1 (2013), 60–74.",
      "doi": ""
    },
    {
      "text": "Susan M Hayward, Keith R McVilly, and Mark A Stokes. 2020. Sources and impact of occupational demands for autistic employees. Research in Autism Spectrum Disorders 76 (2020), 101571.",
      "doi": ""
    },
    {
      "text": "Dawn Hendricks. 2010. Employment and adults with autism spectrum disorders: Challenges and strategies for success. Journal of vocational rehabilitation 32, 2 (2010), 125–134.",
      "doi": ""
    },
    {
      "text": "Laura M Heron, Rumi Agarwal, Ingrid Gonzalez, Tan Li, Stephanie Garcia, Marlaina Maddux, Nicole Attong, and Shanna L Burke. 2020. Understanding local barriers to inclusion for individuals with intellectual and developmental disabilities through an employment conference. International Journal of Disability Management 15 (2020).",
      "doi": ""
    },
    {
      "text": "Fernanda Herrera, Jeremy Bailenson, Erika Weisz, Elise Ogle, and Jamil Zaki. 2018. Building long-term empathy: A large-scale comparison of traditional and virtual reality perspective-taking. PloS one 13, 10 (2018), e0204494.",
      "doi": ""
    },
    {
      "text": "Ashleigh Hillier, Heather Campbell, Karen Mastriani, Margo Vreeburg Izzo, Andrea K Kool-Tucker, Laura Cherry, and David Q Beversdorf. 2007. Two-year evaluation of a vocational support program for adults on the autism spectrum. Career Development for Exceptional Individuals 30, 1(2007), 35–47.",
      "doi": ""
    },
    {
      "text": "Martin L Hoffman. 1996. Empathy and moral development. The annual report of educational psychology in Japan 35 (1996), 157–162.",
      "doi": ""
    },
    {
      "text": "Terrell Holmes and Hala Annabi. 2020. The dark side of software development: job stress amongst autistic software developers. In Proceedings of the 53rd Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Laura Hull, KV Petrides, Carrie Allison, Paula Smith, Simon Baron-Cohen, Meng-Chuan Lai, and William Mandy. 2017. “Putting on my best normal”: Social camouflaging in adults with autism spectrum conditions. Journal of autism and developmental disorders 47, 8 (2017), 2519–2534.",
      "doi": ""
    },
    {
      "text": "Karen Hurlbutt and Lynne Chalmers. 2002. Adults with autism speak out: Perceptions of their life experiences. Focus on autism and other developmental disabilities 17, 2(2002), 103–111.",
      "doi": ""
    },
    {
      "text": "Karen Hurlbutt and Lynne Chalmers. 2004. Employment and adults with Asperger syndrome. Focus on autism and other developmental disabilities 19, 4(2004), 215–222.",
      "doi": ""
    },
    {
      "text": "Steven K Kapp, Kristen Gillespie-Lynch, Lauren E Sherman, and Ted Hutman. 2013. Deficit, difference, or both? Autism and neurodiversity.Developmental psychology 49, 1 (2013), 59.",
      "doi": ""
    },
    {
      "text": "Steven K Kapp, Robyn Steward, Laura Crane, Daisy Elliott, Chris Elphick, Elizabeth Pellicano, and Ginny Russell. 2019. ‘People should be allowed to do what they like’: Autistic adults’ views and experiences of stimming. Autism 23, 7 (2019), 1782–1792.",
      "doi": ""
    },
    {
      "text": "Jennifer G Kim, Taewan Kim, Sung-In Kim, So-youn Jang, Eun Bin Lee, Heejung Yoo, Kyungsik Han, and Hwajung Hong. 2022. The Workplace Playbook VR: Exploring the Design Space of Virtual Reality to Foster Understanding of and Support for Autistic People. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–24.",
      "doi": "10.1145/3555082"
    },
    {
      "text": "Anna Krzeminska, Robert D Austin, Susanne M Bruyère, and Darren Hedley. 2019. The advantages and challenges of neurodiversity employment in organizations. Journal of Management & Organization 25, 4 (2019), 453–463.",
      "doi": ""
    },
    {
      "text": "Meng-Chuan Lai, Michael V Lombardo, Amber NV Ruigrok, Bhismadev Chakrabarti, Bonnie Auyeung, Peter Szatmari, Francesca Happé, Simon Baron-Cohen, and MRC AIMS Consortium. 2017. Quantifying and exploring camouflaging in men and women with autism. Autism 21, 6 (2017), 690–702.",
      "doi": ""
    },
    {
      "text": "Lauren M Little, Evan Dean, Scott Tomchek, and Winnie Dunn. 2018. Sensory processing patterns in autism, attention deficit hyperactivity disorder, and typical development. Physical & occupational therapy in pediatrics 38, 3(2018), 243–254.",
      "doi": ""
    },
    {
      "text": "Deborah Marks. 1997. Models of disability. Disability and rehabilitation 19, 3 (1997), 85–91.",
      "doi": ""
    },
    {
      "text": "K Martin, J Jamrog, A Dixon, L Lykins, and E Davis. 2014. Employing people with intellectual and developmental disabilities.",
      "doi": ""
    },
    {
      "text": "Alison Jane Martingano, Fernanda Hererra, and Sara Konrath. 2021. Virtual Reality Improves Emotional but Not Cognitive Empathy: A Meta-Analysis. Technology, Mind, and Behavior 2, 1 (jun 17 2021). https://tmb.apaopen.org/pub/vr-improves-emotional-empathy-only.",
      "doi": ""
    },
    {
      "text": "Lynn Mawhood and Patricia Howlin. 1999. The outcome of a supported employment scheme for high-functioning adults with autism or Asperger syndrome. Autism 3, 3 (1999), 229–254.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Andrew Begel, and Ben Wiedermann. 2015. Understanding the challenges faced by neurodiverse software engineering employees: Towards a more inclusive and productive technical workforce. In Proceedings of the 17th International ACM SIGACCESS Conference on computers & accessibility. 173–184.",
      "doi": "10.1145/2700648.2809841"
    },
    {
      "text": "Michelle R Nario-Redmond, Dobromir Gospodinov, and Angela Cobb. 2017. Crip for a day: The unintended negative consequences of disability simulations.Rehabilitation psychology 62, 3 (2017), 324.",
      "doi": ""
    },
    {
      "text": "Sophie Nesbitt. 2000. Why and why not? Factors influencing employment for individuals with Asperger syndrome. Autism 4, 4 (2000), 357–369.",
      "doi": ""
    },
    {
      "text": "Catherine S Oh, Jeremy N Bailenson, and Gregory F Welch. 2018. A systematic review of social presence: Definition, antecedents, and implications. Frontiers in Robotics and AI(2018), 114.",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver, James Price Dillard, Keunmin Bae, and Daniel J Tamul. 2012. The effect of narrative news format on empathy for stigmatized groups. Journalism & Mass Communication Quarterly 89, 2 (2012), 205–224.",
      "doi": ""
    },
    {
      "text": "EB-N Sanders. 2000. Generative tools for co-designing. In Collaborative design. Springer, 3–12.",
      "doi": ""
    },
    {
      "text": "Noah J Sasson, Daniel J Faso, Jack Nugent, Sarah Lovell, Daniel P Kennedy, and Ruth B Grossman. 2017. Neurotypical peers are less willing to interact with those with autism based on thin slice judgments. Scientific reports 7, 1 (2017), 1–10.",
      "doi": ""
    },
    {
      "text": "Esther Shein. 2020. Hiring from the autism spectrum. Commun. ACM 63, 6 (2020), 17–19.",
      "doi": "10.1145/3392509"
    },
    {
      "text": "Ashley Shew. 2020. Ableism, technoableism, and future AI. IEEE Technology and Society Magazine 39, 1 (2020), 40–85.",
      "doi": ""
    },
    {
      "text": "Arielle M Silverman, Jason D Gwinn, and Leaf Van Boven. 2015. Stumbling in their shoes: Disability simulations reduce judged capabilities of disabled people. Social Psychological and Personality Science 6, 4 (2015), 464–471.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Bernhard Spanlang, Maria V Sanchez-Vives, and Olaf Blanke. 2010. First person experience of body transfer in virtual reality. PloS one 5, 5 (2010), e10564.",
      "doi": ""
    },
    {
      "text": "Matthew J Smith, Michael F Fleming, Michael A Wright, Molly Losh, Laura Boteler Humm, Dale Olsen, and Morris D Bell. 2015. Brief report: Vocational outcomes for young adults with autism spectrum disorders at six months after virtual reality job interview training. Journal of Autism and Developmental Disorders 45, 10(2015), 3364–3369.",
      "doi": ""
    },
    {
      "text": "National Autistic Society. 2022. https://www.autism.org.uk. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Os Keyes, and Geraldine Fitzpatrick. 2019. Agency of autistic children in technology research—A critical literature review. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 6(2019), 1–40.",
      "doi": "10.1145/3344919"
    },
    {
      "text": "Katta Spiel and Kathrin Gerling. 2021. The purpose of play: How HCI games research fails neurodivergent populations. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 2(2021), 1–40.",
      "doi": "10.1145/3432245"
    },
    {
      "text": "Kenneth E Sumner and Theresa J Brown. 2015. Neurodiversity and human resource management: Employer challenges for applicants and employees with learning disabilities.The Psychologist-Manager Journal 18, 2 (2015), 77.",
      "doi": ""
    },
    {
      "text": "John Tang. 2021. Understanding the telework experience of people with disabilities. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–27.",
      "doi": "10.1145/3449104"
    },
    {
      "text": "Jaimie Ciulla Timmons, Allison Cohen Hall, Jennifer Bose, Ashley Wolfe, and Jean Winsor. 2011. Choosing employment: Factors that impact employment decisions for individuals with intellectual disability. Intellectual and developmental disabilities 49, 4 (2011), 285–299.",
      "doi": ""
    },
    {
      "text": "Andrew R Todd and Adam D Galinsky. 2014. Perspective-taking as a strategy for improving intergroup relations: Evidence, mechanisms, and qualifications. Social and Personality Psychology Compass 8, 7 (2014), 374–387.",
      "doi": ""
    },
    {
      "text": "Axon VR Training. 2022. https://www.axon.com/training/vr. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Michael Vallance and Phillip A Towndrow. 2022. Perspective: Narrative Storyliving in Virtual Reality Design.Frontiers Virtual Real. 3 (2022), 779148.",
      "doi": ""
    },
    {
      "text": "Emmanuelle Walkowiak. 2021. Neurodiversity of the workforce and digital transformation: The case of inclusion of autistic workers at the workplace. Technological Forecasting and Social Change 168 (2021), 120739.",
      "doi": ""
    },
    {
      "text": "Danielle Wallace, Jessica Herbert, David Tyler, and Elizabeth McGee-Hassrick. 2021. Interactions between individuals on the autism spectrum and the police: the fears of parents, caregivers, and professionals. Policing: A Journal of Policy and Practice 15, 2 (2021), 950–964.",
      "doi": ""
    },
    {
      "text": "Jennifer Warnick. 2016. https://news.microsoft.com/stories/people/kyle-schwaneke.html. Microsoft Story Labs (Feb 2016). https://news.microsoft.com/stories/people/kyle-schwaneke.html",
      "doi": ""
    },
    {
      "text": "Axon Partners with Chicago Police Department for First VR Empathy Training Program; Debuts New Autism Empathy Training. 2022. https://www.prnewswire.com/news-releases/axon-partners-with-chicago-police-department-for-first-vr-empathy-training-program-debuts-new-autism-empathy-training-300854997.html. Accessed: 2022-09-15.",
      "doi": ""
    },
    {
      "text": "Y Wayne Wu and Brian P Bailey. 2021. Better feedback from nicer people: Narrative empathy and ingroup framing improve feedback exchange. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–20.",
      "doi": "10.1145/3432935"
    },
    {
      "text": "Annuska Zolyomi, Andrew Begel, Jennifer Frances Waldern, John Tang, Michael Barnett, Edward Cutrell, Daniel McDuff, Sean Andrist, and Meredith Ringel Morris. 2019. Managing stress: the needs of autistic adults in video calling. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–29.",
      "doi": "10.1145/3359236"
    }
  ]
}