{
  "doi": "10.1145/3544548.3580799",
  "title": "TactorBots: A Haptic Design Toolkit for Out-of-lab Exploration of Emotional Robotic Touch",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Emerging research has demonstrated the viability of emotional communication through haptic technology inspired by interpersonal touch. However, the meaning-making of artificial touch remains ambiguous and contextual. We see this ambiguity caused by robotic touch’s \"otherness\" as an opportunity for exploring alternatives. To empower emotional haptic design in longitudinal out-of-lab exploration, we devise TactorBots, a design toolkit consisting of eight wearable hardware modules for rendering robotic touch gestures controlled by a web-based software application. We deployed TactorBots to thirteen designers and researchers to validate its functionality, characterize its design experience, and analyze what, how, and why alternative perceptions, practices, contexts, and metaphors would emerge in the experiment. We provide suggestions for designing future toolkits and field studies based on our experiences. Reflecting on the findings, we derive design implications for further enhancing the ambiguity and shifting the mindsets to expand the design space.",
  "tags": [
    "Emotional Robotic Touch",
    "Haptic Design Toolkit",
    "Wearable",
    "Creativity Support",
    "Outside of Lab Study",
    "Design Research"
  ],
  "authors": [
    {
      "name": "Ran Zhou",
      "institution": "ATLAS Institute, University of Colorado, Boulder, United States",
      "img": "/do/10.1145/contrib-99659548128/rel-imgonly/img_9762.jpg",
      "acmid": "99659548128",
      "orcid": "0000-0002-5309-056X"
    },
    {
      "name": "Zachary Schwemler",
      "institution": "ATLAS Institute, University of Colorado, Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658729427",
      "orcid": "0000-0002-3852-8850"
    },
    {
      "name": "Akshay Baweja",
      "institution": "Parsons School of Design, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779258",
      "orcid": "0000-0002-7901-272X"
    },
    {
      "name": "Harpreet Sareen",
      "institution": "Parsons School of Design, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161013",
      "orcid": "0000-0002-0897-8105"
    },
    {
      "name": "Casey Lee Hunt",
      "institution": "ATLAS Institute, University of Colorado, Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660729886",
      "orcid": "0000-0002-9351-1496"
    },
    {
      "name": "Daniel Leithinger",
      "institution": "ATLAS Institute, University of Colorado, Boulder, United States",
      "img": "/do/10.1145/contrib-81319495312/rel-imgonly/074_7043_medium.jpg",
      "acmid": "81319495312",
      "orcid": "0000-0003-4342-7082"
    }
  ],
  "references": [
    {
      "text": "Kerem Altun and Karon E. MacLean. 2015. Recognizing affect in human touch of a robot. Pattern Recognition Letters 66 (Nov. 2015), 31–40. https://doi.org/10.1016/j.patrec.2014.10.016",
      "doi": "10.1016/j.patrec.2014.10.016"
    },
    {
      "text": "Patrícia Alves-Oliveira, Patrícia Arriaga, Ana Paiva, and Guy Hoffman. 2021. Children as Robot Designers. In Proceedings of the 2021 ACM/IEEE International Conference on Human-Robot Interaction (Boulder, CO, USA) (HRI ’21). Association for Computing Machinery, New York, NY, USA, 399–408. https://doi.org/10.1145/3434073.3444650",
      "doi": "10.1145/3434073.3444650"
    },
    {
      "text": "Patrícia Alves-Oliveira, Maria Luce Lupetti, Michal Luria, Diana Löffler, Mafalda Gamboa, Lea Albaugh, Waki Kamino, Anastasia K. Ostrowski, David Puljiz, Pedro Reynolds-Cuéllar, Marcus Scheunemann, Michael Suguitan, and Dan Lockton. 2021. Collection of Metaphors for Human-Robot Interaction. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 1366–1379. https://doi.org/10.1145/3461778.3462060",
      "doi": "10.1145/3461778.3462060"
    },
    {
      "text": "Lucy Anderson-Bashan, Benny Megidish, Hadas Erel, Iddo Wald, Guy Hoffman, Oren Zuckerman, and Andrey Grishko. 2018. The Greeting Machine: An Abstract Robotic Object for Opening Encounters. In 2018 27th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). 595–602. https://doi.org/10.1109/ROMAN.2018.8525516",
      "doi": "10.1109/ROMAN.2018.8525516"
    },
    {
      "text": "Matthew A Baumann, Karon E MacLean, Thomas W Hazelton, and Ashley McKay. 2010. Emulating human attention-getting practices with wearable haptics. In 2010 IEEE Haptics Symposium. IEEE, 149–156.",
      "doi": "10.1109/HAPTIC.2010.5444662"
    },
    {
      "text": "Ayah Bdeir. 2009. Electronics as Material: LittleBits. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (Cambridge, United Kingdom) (TEI ’09). Association for Computing Machinery, New York, NY, USA, 397–400. https://doi.org/10.1145/1517664.1517743",
      "doi": "10.1145/1517664.1517743"
    },
    {
      "text": "Christopher C Berger, Mar Gonzalez-Franco, Eyal Ofek, and Ken Hinckley. 2018. The uncanny valley of haptics. Science Robotics 3, 17 (2018), eaar7010.",
      "doi": ""
    },
    {
      "text": "Harvey Bewley and Laurens Boer. 2018. Designing Blo-Nut: Design Principles, Choreography and Otherness in an Expressive Social Robot. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 1069–1080. https://doi.org/10.1145/3196709.3196817",
      "doi": "10.1145/3196709.3196817"
    },
    {
      "text": "Rebecca Boehme, Steven Hauser, Gregory J Gerling, Markus Heilig, and Håkan Olausson. 2019. Distinction of self-produced touch and social touch at cortical and spinal cord levels. Proceedings of the National Academy of Sciences 116, 6 (2019), 2290–2299.",
      "doi": ""
    },
    {
      "text": "Andrew J Bremner, David J Lewkowicz, and Charles Spence. 2012. Multisensory development. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Paul Bucci, Lotus Zhang, Xi Laura Cang, and Karon E. MacLean. 2018. Is It Happy? Behavioural and Narrative Frame Complexity Impact Perceptions of a Simple Furry Robot’s Emotions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174083",
      "doi": "10.1145/3173574.3174083"
    },
    {
      "text": "John T Cacioppo, Wendi L Gardner, and Gary G Berntson. 1999. The affect system has parallel and integrative processing components: Form follows function.Journal of personality and Social Psychology 76, 5(1999), 839.",
      "doi": ""
    },
    {
      "text": "Steven Ding and Colin Gallacher. 2018. The Haply Development Platform: A Modular and Open-Sourced Entry Level Haptic Toolset. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3170427.3186512",
      "doi": "10.1145/3170427.3186512"
    },
    {
      "text": "Youngwook Do, Linh Thai Hoang, Jung Wook Park, Gregory D. Abowd, and Sauvik Das. 2021. Spidey Sense: Designing Wrist-Mounted Affective Haptics for Communicating Cybersecurity Warnings. In Designing Interactive Systems Conference 2021(Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 125–137. https://doi.org/10.1145/3461778.3462027",
      "doi": "10.1145/3461778.3462027"
    },
    {
      "text": "Shreyosi Endow, Hedieh Moradi, Anvay Srivastava, Esau G Noya, and Cesar Torres. 2021. Compressables: A Haptic Prototyping Toolkit for Wearable Compression-Based Interfaces. In Designing Interactive Systems Conference 2021(Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 1101–1114. https://doi.org/10.1145/3461778.3462057",
      "doi": "10.1145/3461778.3462057"
    },
    {
      "text": "Esther Foo and Brad Holschuh. 2018. Dynamic Compression in Affective Haptics. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers (Singapore, Singapore) (UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 577–583. https://doi.org/10.1145/3267305.3267312",
      "doi": "10.1145/3267305.3267312"
    },
    {
      "text": "Esther W. Foo, Lucy E. Dunne, and Brad Holschuh. 2021. User Expectations and Mental Models for Communicating Emotions through Compressive & Warm Affective Garment Actuation. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 5, 1 (March 2021), 1–25. https://doi.org/10.1145/3448097",
      "doi": "10.1145/3448097"
    },
    {
      "text": "Jonas Forsslund, Michael Yip, and Eva-Lotta Sallnäs. 2015. WoodenHaptics: A Starting Kit for Crafting Force-Reflecting Spatial Haptic Devices. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (Stanford, California, USA) (TEI ’15). Association for Computing Machinery, New York, NY, USA, 133–140. https://doi.org/10.1145/2677199.2680595",
      "doi": "10.1145/2677199.2680595"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. Interactions 6, 1 (jan 1999), 21–29. https://doi.org/10.1145/291224.291235",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI ’03). Association for Computing Machinery, New York, NY, USA, 233–240. https://doi.org/10.1145/642611.642653",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Frank A Geldard and Carl E Sherrick. 1972. The cutaneous\" rabbit\": a perceptual illusion. Science 178, 4057 (1972), 178–179.",
      "doi": ""
    },
    {
      "text": "Jungu Guo. 2022. Color Crush: Crafting multisensory digital-physical interactives in a science museum. https://media.segd.org/s3fs-public/SEGD-2022-Academic-Journal-7.27.22.pdf",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Jan Borchers, Susanne Boll, Astrid Rosenthal-von der Pütten, and Volker Wulf. 2020. Otherware: How to Best Interact with Autonomous Systems. Interactions 28, 1 (dec 2020), 54–57. https://doi.org/10.1145/3436942",
      "doi": "10.1145/3436942"
    },
    {
      "text": "Steven C. Hauser, Sarah McIntyre, Ali Israr, Hakan Olausson, and Gregory J. Gerling. 2019. Uncovering Human-to-Human Physical Interactions that Underlie Emotional and Affective Touch Communication. In 2019 IEEE World Haptics Conference (WHC). IEEE, Tokyo, Japan, 407–412. https://doi.org/10.1109/WHC.2019.8816169",
      "doi": ""
    },
    {
      "text": "Matthew J. Hertenstein, Rachel Holmes, Margaret McCullough, and Dacher Keltner. 2009. The communication of emotion via touch.Emotion 9, 4 (2009), 566–573. https://doi.org/10.1037/a0016108",
      "doi": ""
    },
    {
      "text": "Matthew J. Hertenstein, Dacher Keltner, Betsy App, Brittany A. Bulleit, and Ariane R. Jaskolka. 2006. Touch communicates distinct emotions.Emotion 6, 3 (2006), 528–533. https://doi.org/10.1037/1528-3542.6.3.528",
      "doi": ""
    },
    {
      "text": "Kristina Hook. 2018. Designing with the body: Somaesthetic interaction design. MIt Press.",
      "doi": ""
    },
    {
      "text": "Yuhan Hu and Guy Hoffman. 2022. What Can a Robot’s Skin Be? Designing Texture-Changing Skin for Human-Robot Social Interaction. J. Hum.-Robot Interact. (feb 2022). https://doi.org/10.1145/3532772 Just Accepted.",
      "doi": "10.1145/3532772"
    },
    {
      "text": "Gijs Huisman. 2017. Social Touch Technology: A Survey of Haptic Technology for Social Touch. IEEE Transactions on Haptics 10, 3 (July 2017), 391–408. https://doi.org/10.1109/TOH.2017.2650221 Conference Name: IEEE Transactions on Haptics.",
      "doi": "10.1109/TOH.2017.2650221"
    },
    {
      "text": "Gijs Huisman and Aduén Darriba Frederiks. 2013. Towards tactile expressions of emotion through mediated touch. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems on - CHI EA ’13. ACM Press, Paris, France, 1575. https://doi.org/10.1145/2468356.2468638",
      "doi": "10.1145/2468356.2468638"
    },
    {
      "text": "G. Huisman, Aduen Darriba Frederiks, B. Van Dijk, D. Hevlen, and B. Krose. 2013. The TaSSt: Tactile sleeve for social touch. In 2013 World Haptics Conference (WHC). IEEE, Daejeon, 211–216. https://doi.org/10.1109/WHC.2013.6548410",
      "doi": ""
    },
    {
      "text": "Hayeon Hwang. 2019. Expressive Tactile Controls. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (Tempe, Arizona, USA) (TEI ’19). Association for Computing Machinery, New York, NY, USA, 223–227. https://doi.org/10.1145/3294109.3300991",
      "doi": "10.1145/3294109.3300991"
    },
    {
      "text": "Ali Israr, Siyan Zhao, Kaitlyn Schwalje, Roberta Klatzky, and Jill Lehman. 2014. Feel Effects: Enriching Storytelling with Haptic Feedback. ACM Trans. Appl. Percept. 11, 3, Article 11 (sep 2014), 17 pages. https://doi.org/10.1145/2641570",
      "doi": "10.1145/2641570"
    },
    {
      "text": "Carey Jewitt, Sara Price, Jürgen Steimle, Gijs Huisman, Lili Golmohammadi, Narges Pourjafarian, William Frier, Thomas Howard, Sima Ipakchian Askari, Michela Ornati, 2021. Manifesto for digital social touch in crisis. Frontiers in Computer Science(2021), 97.",
      "doi": ""
    },
    {
      "text": "Stanley E Jones and A Elaine Yarbrough. 1985. A naturalistic study of the meanings of touch. Communications Monographs 52, 1 (1985), 19–56.",
      "doi": ""
    },
    {
      "text": "Jin Hee (Heather) Kim, Kunpeng Huang, Simone White, Melissa Conroy, and Cindy Hsin-Liu Kao. 2021. KnitDermis: Fabricating Tactile On-Body Interfaces Through Machine Knitting. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 1183–1200. https://doi.org/10.1145/3461778.3462007",
      "doi": "10.1145/3461778.3462007"
    },
    {
      "text": "Lawrence H. Kim and Sean Follmer. 2019. SwarmHaptics: Haptic Display with Swarm Robots. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300918",
      "doi": "10.1145/3290605.3300918"
    },
    {
      "text": "Espen Knoop and Jonathan Rossiter. 2015. The Tickler: A Compliant Wearable Tactile Display for Stroking and Tickling. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 1133–1138. https://doi.org/10.1145/2702613.2732749",
      "doi": "10.1145/2702613.2732749"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3173574.3173610",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Yuxuan Lei, Qi Lu, and Yingqing Xu. 2022. O&O: A DIY Toolkit for Designing and Rapid Prototyping Olfactory Interfaces. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 637, 21 pages. https://doi.org/10.1145/3491102.3502033",
      "doi": "10.1145/3491102.3502033"
    },
    {
      "text": "Dan Lockton, Devika Singh, Saloni Sabnis, Michelle Chou, Sarah Foley, and Alejandro Pantoja. 2019. New Metaphors: A Workshop Method for Generating Ideas and Reframing Problems in Design and Beyond. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C&C ’19). Association for Computing Machinery, New York, NY, USA, 319–332. https://doi.org/10.1145/3325480.3326570",
      "doi": "10.1145/3325480.3326570"
    },
    {
      "text": "Jasmine Lu, Ziwei Liu, Jas Brooks, and Pedro Lopes. 2021. Chemical Haptics: Rendering Haptic Sensations via Topical Stimulants. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 239–257. https://doi.org/10.1145/3472749.3474747",
      "doi": "10.1145/3472749.3474747"
    },
    {
      "text": "Zhengda Luo, Siyu Wu, Xuanyu Fang, and Nelson C Brunsting. 2019. International students’ perceived language competence, domestic student support, and psychological well-being at a US university. Journal of International Students 9, 4 (2019), 954–971.",
      "doi": ""
    },
    {
      "text": "Alex Mazursky, Madeleine DeVoe, and Sarah Sebo. 2022. Physical Touch from a Robot Caregiver: Examining Factors that Shape Patient Experience. In 2022 31st IEEE International Conference on Robot and Human Interactive Communication (RO-MAN). 1578–1585. https://doi.org/10.1109/RO-MAN53752.2022.9900549",
      "doi": "10.1109/RO-MAN53752.2022.9900549"
    },
    {
      "text": "Alex Mazursky, Shan-Yuan Teng, Romain Nith, and Pedro Lopes. 2021. MagnetIO: Passive yet Interactive Soft Haptic Patches Anywhere. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 213, 15 pages. https://doi.org/10.1145/3411764.3445543",
      "doi": "10.1145/3411764.3445543"
    },
    {
      "text": "Sarah McIntyre, Steven C Hauser, Anikó Kusztor, Rebecca Boehme, Athanasia Moungou, Peder Mortvedt Isager, Lina Homman, Giovanni Novembre, Saad S Nagi, Ali Israr, 2021. The language of social touch is intuitive and quantifiable. Psychological Science(2021), 09567976211059801.",
      "doi": ""
    },
    {
      "text": "Sevi Merter. 2017. Synesthetic approach in the design process for enhanced creativity and multisensory experiences. The Design Journal 20, sup1 (2017), S4519–S4528.",
      "doi": ""
    },
    {
      "text": "Moritz Alexander Messerschmidt, Sachith Muthukumarana, Nur Al-Huda Hamdan, Adrian Wagner, Haimo Zhang, Jan Borchers, and Suranga Chandima Nanayakkara. 2022. ANISMA: A Prototyping Toolkit to Explore Haptic Skin Deformation Applications Using Shape-Memory Alloys. ACM Trans. Comput.-Hum. Interact. 29, 3, Article 19 (jan 2022), 34 pages. https://doi.org/10.1145/3490497",
      "doi": "10.1145/3490497"
    },
    {
      "text": "Masahiro Mori, Karl F MacDorman, and Norri Kageki. 2012. The uncanny valley [from the field]. IEEE Robotics & automation magazine 19, 2 (2012), 98–100.",
      "doi": ""
    },
    {
      "text": "Tania K. Morimoto, Paulo Blikstein, and Allison M. Okamura. 2014. [D81] Hapkit: An open-hardware haptic device for online education. In 2014 IEEE Haptics Symposium (HAPTICS). 1–1. https://doi.org/10.1109/HAPTICS.2014.6775560",
      "doi": ""
    },
    {
      "text": "Sachith Muthukumarana. 2020. Touch me Gently: Recreating the Perception of Touch using a Shape-Memory Alloy Matrix. (2020), 12.",
      "doi": ""
    },
    {
      "text": "Romain Nith, Shan-Yuan Teng, Pengyu Li, Yujie Tao, and Pedro Lopes. 2021. DextrEMS: Increasing Dexterity in Electrical Muscle Stimulation by Combining It with Brakes. In The 34th Annual ACM Symposium on User Interface Software and Technology(Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 414–430. https://doi.org/10.1145/3472749.3474759",
      "doi": "10.1145/3472749.3474759"
    },
    {
      "text": "Cara M Nunez, Bryce N Huerta, Allison M Okamura, and Heather Culbertson. 2020. Investigating social haptic illusions for tactile stroking (SHIFTS). In 2020 IEEE Haptics Symposium (HAPTICS). IEEE, 629–636.",
      "doi": ""
    },
    {
      "text": "Sabrina Panëels, Margarita Anastassova, and Lucie Brunet. 2013. TactiPEd: Easy prototyping of tactile patterns. In IFIP Conference on Human-Computer Interaction. Springer, 228–245.",
      "doi": ""
    },
    {
      "text": "James Pierce. 2021. In Tension with Progression: Grasping the Frictional Tendencies of Speculative, Critical, and Other Alternative Designs. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 617, 19 pages. https://doi.org/10.1145/3411764.3445406",
      "doi": "10.1145/3411764.3445406"
    },
    {
      "text": "Sara Price, Nadia Bianchi-Berthouze, Carey Jewitt, Nikoleta Yiannoutsou, Katerina Fotopoulou, Svetlana Dajic, Juspreet Virdee, Yixin Zhao, Douglas Atkinson, and Frederik Brudy. 2022. The Making of Meaning through Dyadic Haptic Affective Touch. ACM Trans. Comput.-Hum. Interact. 29, 3, Article 21 (jan 2022), 42 pages. https://doi.org/10.1145/3490494",
      "doi": "10.1145/3490494"
    },
    {
      "text": "Vilayanur S Ramachandran, Diane Rogers-Ramachandran, and Steve Cobb. 1995. Touching the phantom limb. Nature 377, 6549 (1995), 489–490.",
      "doi": ""
    },
    {
      "text": "Kimiko Ryokai, Nicole Marie Bulalacao, Sandra Jacobo, Prasad Boradkar, and Kelly Dobson. 2022. Shifting Design Perspectives: Touch, Co-Location, and Sharing Objects during the Pandemic. Multimodal Technologies and Interaction 6, 9 (2022), 74.",
      "doi": ""
    },
    {
      "text": "Jonghyun Ryu and Seungmoon Choi. 2008. posVibEditor: Graphical authoring tool of vibrotactile patterns. In 2008 IEEE International Workshop on Haptic Audio visual Environments and Games. 120–125. https://doi.org/10.1109/HAVE.2008.4685310",
      "doi": ""
    },
    {
      "text": "Eleanor Sandry. 2015. Re-evaluating the form and communication of social robots. International Journal of Social Robotics 7, 3 (2015), 335–346.",
      "doi": ""
    },
    {
      "text": "Oliver S Schneider and Karon E MacLean. 2016. Studying design process and example use with Macaron, a web-based vibrotactile effect editor. In 2016 IEEE Haptics Symposium (HAPTICS). IEEE, 52–58.",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard, Ozgun Kilic Afsar, Marianela Ciolfi Felice, Nadia Campo Woytuk, and Madeline Balaam. 2020. Designing with Intimate Materials and Movements: Making \"Menarche Bits\". In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 587–600. https://doi.org/10.1145/3357236.3395592",
      "doi": "10.1145/3357236.3395592"
    },
    {
      "text": "Andrew A. Stanley and Katherine J. Kuchenbecker. 2011. Design of body-grounded tactile actuators for playback of human physical contact. In 2011 IEEE World Haptics Conference. IEEE, Istanbul, 563–568. https://doi.org/10.1109/WHC.2011.5945547",
      "doi": ""
    },
    {
      "text": "Walter Dan Stiehl, Jun Ki Lee, Cynthia Breazeal, Marco Nalin, Angelica Morandi, and Alberto Sanna. 2009. The huggable: a platform for research in robotic companions for pediatric care. In Proceedings of the 8th International Conference on Interaction Design and Children - IDC ’09. ACM Press, Como, Italy, 317. https://doi.org/10.1145/1551788.1551872",
      "doi": "10.1145/1551788.1551872"
    },
    {
      "text": "Anna Ståhl, Vasiliki Tsaknaki, and Madeline Balaam. 2021. Validity and Rigour in Soma Design-Sketching with the Soma. ACM Trans. Comput.-Hum. Interact. 28, 6, Article 38 (dec 2021), 36 pages. https://doi.org/10.1145/3470132",
      "doi": "10.1145/3470132"
    },
    {
      "text": "Michael Suguitan and Guy Hoffman. 2019. Blossom: A Handcrafted Open-Source Robot. J. Hum.-Robot Interact. 8, 1, Article 2 (mar 2019), 27 pages. https://doi.org/10.1145/3310356",
      "doi": "10.1145/3310356"
    },
    {
      "text": "Ruojia Sun, Ryosuke Onose, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 365–377. https://doi.org/10.1145/3357236.3395548",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Juulia T. Suvilehto, Enrico Glerean, Robin I. M. Dunbar, Riitta Hari, and Lauri Nummenmaa. 2015. Topography of social touching depends on emotional bonds between humans. Proceedings of the National Academy of Sciences 112, 45 (Nov. 2015), 13811–13816. https://doi.org/10.1073/pnas.1519231112",
      "doi": ""
    },
    {
      "text": "Yujie Tao, Shan-Yuan Teng, and Pedro Lopes. 2021. Altering Perceived Softness of Real Rigid Objects by Restricting Fingerpad Deformation. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 985–996. https://doi.org/10.1145/3472749.3474800",
      "doi": "10.1145/3472749.3474800"
    },
    {
      "text": "Erin Thompson and James Hampton. 2011. The effect of relationship status on communicating emotions through touch. Cognition & emotion 25 (Feb. 2011), 295–306. https://doi.org/10.1080/02699931.2010.492957",
      "doi": ""
    },
    {
      "text": "Ron Wakkary, Doenja Oogjes, and Armi Behzad. 2022. Two Years or More of Co-Speculation: Polylogues of Philosophers, Designers, and a Tilting Bowl. ACM Trans. Comput.-Hum. Interact. (jan 2022). https://doi.org/10.1145/3514235 Just Accepted.",
      "doi": "10.1145/3514235"
    },
    {
      "text": "Danielle Wilde, Anna Vallgårda, and Oscar Tomico. 2017. Embodied Design Ideation Methods: Analysing the Power of Estrangement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5158–5170. https://doi.org/10.1145/3025453.3025873",
      "doi": "10.1145/3025453.3025873"
    },
    {
      "text": "Charles Windlin, Kristina Höök, and Jarmo Laaksolahti. 2022. SKETCHING SOMA BITS. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 1758–1772. https://doi.org/10.1145/3532106.3533510",
      "doi": "10.1145/3532106.3533510"
    },
    {
      "text": "Dennis Wittchen, Katta Spiel, Bruno Fruchard, Donald Degraen, Oliver Schneider, Georg Freitag, and Paul Strohmeier. 2022. TactJam: An End-to-End Prototyping Suite for Collaborative Design of On-Body Vibrotactile Feedback. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction (Daejeon, Republic of Korea) (TEI ’22). Association for Computing Machinery, New York, NY, USA, Article 1, 13 pages. https://doi.org/10.1145/3490149.3501307",
      "doi": "10.1145/3490149.3501307"
    },
    {
      "text": "Yutong Xie. 2023. Collection of design and art projects. Retrieved Jan 21, 2023 from https://yutongxie.com/",
      "doi": ""
    },
    {
      "text": "Shan Xu, Chang Xu, Sarah McIntyre, Håkan Olausson, and Gregory J. Gerling. 2022. 3D Visual Tracking to Quantify Physical Contact Interactions in Human-to-Human Touch. Frontiers in Physiology 13 (2022). https://doi.org/10.3389/fphys.2022.841938",
      "doi": ""
    },
    {
      "text": "Steve Yohanan and Karon E MacLean. 2012. The role of affective touch in human-robot interaction: Human intent and expectations in touching the haptic creature. International Journal of Social Robotics 4, 2 (2012), 163–180.",
      "doi": ""
    },
    {
      "text": "Ruby Yu, Elsie Hui, Jenny Lee, Dawn Poon, Ashley Ng, Kitty Sit, Kenny Ip, Fannie Yeung, Martin Wong, Takanori Shibata, and Jean Woo. 2015. Use of a Therapeutic, Socially Assistive Pet Robot (PARO) in Improving Mood and Stimulating Social Interaction and Communication for People With Dementia: Study Protocol for a Randomized Controlled Trial. JMIR Research Protocols 4, 2 (May 2015), e45. https://doi.org/10.2196/resprot.4189",
      "doi": ""
    },
    {
      "text": "Yuguang Zhang. 2021. (Non-)Human, Kinetic Installation. https://www.ygzhang.com/non-human.html",
      "doi": ""
    },
    {
      "text": "Yiran Zhao*, Yujie Tao*, Grace Le, Rui Maki, Alexander Adams, Pedro Lopes, and Tanzeem Choudhury. 2023. Affective Touch as Immediate and Passive Wearable Intervention. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 4, Article 200 (jan 2023), 23 pages. https://doi.org/10.1145/3569484",
      "doi": "10.1145/3569484"
    },
    {
      "text": "Ran Zhou and Harpreet Sareen. 2020. EmotiTactor: Emotional Expression of Robotic Physical Contact. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference. ACM, Eindhoven Netherlands, 151–156. https://doi.org/10.1145/3393914.3395891",
      "doi": "10.1145/3393914.3395891"
    },
    {
      "text": "Ran Zhou, Harpreet Sareen, Yufei Zhang, and Daniel Leithinger. 2022. EmotiTactor: Exploring How Designers Approach Emotional Robotic Touch. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 1330–1344. https://doi.org/10.1145/3532106.3533487",
      "doi": "10.1145/3532106.3533487"
    }
  ]
}