{
  "doi": "10.1145/3544548.3580675",
  "title": "Save A Tree or 6 kg of CO2? Understanding Effective Carbon Footprint Interventions for Eco-Friendly Vehicular Choices",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "From ride-hailing to car rentals, consumers are often presented with eco-friendly options. Beyond highlighting a “green” vehicle and CO2 emissions, CO2 equivalencies have been designed to provide understandable amounts; we ask which equivalencies will lead to eco-friendly decisions. We conducted five ride-hailing scenario surveys where participants picked between regular and eco-friendly options, testing equivalencies, social features, and valence-based interventions. Further, we tested a car-rental embodiment to gauge how an individual (needing a car for several days) might behave versus the immediate ride-hailing context. We find that participants are more likely to choose green rides when presented with additional information about emissions; CO2 by weight was found to be the most effective. Further, we found that information framing—be it individual or collective footprint, positive or negative valence—had an impact on participants’ choices. Finally, we discuss how our findings inform the design of effective interventions for reducing car-based carbon-emissions.",
  "tags": [
    "Eco-Feedback",
    "CO2 Emissions",
    "Carbon Neutrality",
    "Electric Vehicles",
    "Carbon Emissions",
    "Automobiles",
    "Design Interventions",
    "Behavioral Science",
    "Ride Hailing",
    "Ridesharing"
  ],
  "authors": [
    {
      "name": "Vikram Mohanty",
      "institution": "Toyota Research Institute, United States",
      "img": "/do/10.1145/contrib-99659349310/rel-imgonly/profilepic.jpg",
      "acmid": "99659349310",
      "orcid": "0000-0001-6296-3134"
    },
    {
      "name": "Alexandre L. S. Filipowicz",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660049505",
      "orcid": "0000-0002-1311-386X"
    },
    {
      "name": "Nayeli Suseth Bravo",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660569252",
      "orcid": "0000-0001-9238-9831"
    },
    {
      "name": "Scott Carter",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238112",
      "orcid": "0000-0002-2942-972X"
    },
    {
      "name": "David A. Shamma",
      "institution": "Toyota Research Institute, United States",
      "img": "/do/10.1145/contrib-81100288295/rel-imgonly/me.jpg",
      "acmid": "81100288295",
      "orcid": "0000-0003-2399-9374"
    }
  ],
  "references": [
    {
      "text": "Chiamaka Ann Marie Ajufo and Girish Bekaroo. 2021. An automated personal carbon footprint calculator for estimating carbon emissions from transportation use. In Proceedings of the International Conference on Artificial Intelligence and its Applications. 1–7.",
      "doi": "10.1145/3487923.3487935"
    },
    {
      "text": "Icek Ajzen. 1991. The theory of planned behavior. Organizational behavior and human decision processes 50, 2 (1991), 179–211.",
      "doi": ""
    },
    {
      "text": "Hunt Allcott. 2011. Social norms and energy conservation. Journal of public Economics 95, 9-10 (2011), 1082–1095.",
      "doi": ""
    },
    {
      "text": "David Andersson. 2020. A novel approach to calculate individuals’ carbon footprints using financial transaction data–App development and design. Journal of Cleaner Production 256 (2020), 120396.",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2014. Fitting linear mixed-effects models using lme4. arXiv preprint arXiv:1406.5823(2014).",
      "doi": ""
    },
    {
      "text": "Colin B Becg and Robert Gray. 1984. Calculation of polychotomous logistic regression parameters using individualized regressions. Biometrika 71, 1 (1984), 11–18.",
      "doi": ""
    },
    {
      "text": "John Beshears, James J Choi, David Laibson, and Brigitte C Madrian. 2008. How are preferences revealed?Journal of public economics 92, 8-9 (2008), 1787–1794.",
      "doi": ""
    },
    {
      "text": "Bryan Bollinger, Phillip Leslie, and Alan Sorensen. 2011. Calorie posting in chain restaurants. American Economic Journal: Economic Policy 3, 1 (2011), 91–128.",
      "doi": ""
    },
    {
      "text": "Michael Bosnjak, Icek Ajzen, and Peter Schmidt. 2020. The theory of planned behavior: selected recent advances and applications. Europe’s Journal of Psychology 16, 3 (2020), 352.",
      "doi": ""
    },
    {
      "text": "CATF. 2022. Clean Air Task Force | About Us. https://www.catf.us/about/",
      "doi": ""
    },
    {
      "text": "Nick Chater and George Loewenstein. 2022. The i-frame and the s-frame: How focusing on the individual-level solutions has led behavioral public policy astray. Available at SSRN 4046264(2022).",
      "doi": ""
    },
    {
      "text": "Robert B Cialdini, Raymond R Reno, and Carl A Kallgren. 1990. A focus theory of normative conduct: Recycling the concept of norms to reduce littering in public places.Journal of personality and social psychology 58, 6(1990), 1015.",
      "doi": ""
    },
    {
      "text": "André Dahlinger, Felix Wortmann, Benjamin Ryder, and Bernhard Gahr. 2018. The impact of abstract vs. concrete feedback design on behavior insights from a large eco-driving field experiment. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3173574.3173953"
    },
    {
      "text": "Stanislas Dehaene. 2003. The neural basis of the Weber–Fechner law: a logarithmic mental number line. Trends in cognitive sciences 7, 4 (2003), 145–147.",
      "doi": ""
    },
    {
      "text": "Wenjing Duan, Bin Gu, and Andrew B Whinston. 2008. Do online reviews matter?—An empirical investigation of panel data. Decision support systems 45, 4 (2008), 1007–1016.",
      "doi": ""
    },
    {
      "text": "Daniel Ellsberg. 1961. Risk, ambiguity, and the Savage axioms. The quarterly journal of economics(1961), 643–669.",
      "doi": ""
    },
    {
      "text": "EPA. 2022. FuelEconomy.Gov - Compare Cars side-by-side. https://www.fueleconomy.gov/feg/Find.do?action=sbs&id=41915",
      "doi": ""
    },
    {
      "text": "EPA. 2022. Greenhouse Gas Equivalency Calculator. https://www.epa.gov/energy/greenhouse-gas-equivalencies-calculator",
      "doi": ""
    },
    {
      "text": "[19] US EPA.2022. https://www.epa.gov/ghgemissions/inventory-us-greenhouse-gas-emissions-and-sinks",
      "doi": ""
    },
    {
      "text": "Corinna Fischer. 2008. Feedback on household electricity consumption: a tool for saving energy?Energy efficiency 1, 1 (2008), 79–104.",
      "doi": ""
    },
    {
      "text": "Brian J Fogg. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December (2002), 2.",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Craig R Fox and Amos Tversky. 1995. Ambiguity aversion and comparative ignorance. The quarterly journal of economics 110, 3 (1995), 585–603.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, Jennifer Mankoff, Sunny Consolvo, Beverly Harrison, and James A Landay. 2009. UbiGreen: investigating a mobile tool for tracking and supporting green transportation habits. In Proceedings of the sigchi conference on human factors in computing systems. 1043–1052.",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Jon Froehlich, Leah Findlater, and James Landay. 2010. The design of eco-feedback technology. In Proceedings of the SIGCHI conference on human factors in computing systems. 1999–2008.",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Silvia Gabrielli, Paula Forbes, Antti Jylhä, Simon Wells, Miika Sirén, Samuli Hemminki, Petteri Nurmi, Rosa Maimone, Judith Masthoff, and Giulio Jacucci. 2014. Design challenges in motivating change for sustainable urban mobility. Computers in Human Behavior 41 (2014), 416–423.",
      "doi": "10.1016/j.chb.2014.05.026"
    },
    {
      "text": "Silvia Gabrielli, Rosa Maimone, Paula Forbes, Judith Masthoff, Simon Wells, Laura Primerano, Laura Haverinen, Giancarlo Bo, and Marco Pompa. 2013. Designing motivational features for sustainable urban mobility. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 1461–1466.",
      "doi": ""
    },
    {
      "text": "Charles R Gallistel and Rochel Gelman. 2000. Non-verbal numerical cognition: From reals to integers. Trends in cognitive sciences 4, 2 (2000), 59–65.",
      "doi": ""
    },
    {
      "text": "Gizmodo. 2014. Mitsubishi Outlander PHEV: Australian Review. https://www.gizmodo.com.au/2014/05/mitsubishi-outlander-phev-australian-review/",
      "doi": ""
    },
    {
      "text": "Matthew H Goldberg, Abel Gustafson, Seth A Rosenthal, and Anthony Leiserowitz. 2021. Shifting Republican views on climate change through targeted advertising. Nature Climate Change 11, 7 (2021), 573–577.",
      "doi": ""
    },
    {
      "text": "Warwick Goodall, Tiffany Dovey, Justine Bornstein, and Brett Bonthron. 2017. The rise of mobility as a service. Deloitte Rev 20, 1 (2017), 112–129.",
      "doi": ""
    },
    {
      "text": "[31] Grab.2022. https://help.grab.com/passenger/en-sg/4403209189913-What-is-JustGrab-Green",
      "doi": ""
    },
    {
      "text": "Uber Green. 2022. Uber Green. https://www.uber.com/us/en/ride/ubergreen/",
      "doi": ""
    },
    {
      "text": "Sue Hall. 2016. Targeting 2 Tons: Closer Than We Think?http://insight.gbig.org/targeting-2-tons-closer-than-we-think/",
      "doi": ""
    },
    {
      "text": "Lon Åke Erni Johannes Hansson, Teresa Cerratto Pargman, and Daniel Sapiens Pargman. 2021. A decade of sustainable HCI: connecting SHCI to the sustainable development goals. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445069"
    },
    {
      "text": "Totte Harinen, Alexandre Filipowicz, Shabnam Hakimi, Rumen Iliev, Matthew Klenk, and Emily Sumner. 2021. Machine learning reveals how personalized climate communication can both succeed and backfire. arXiv preprint arXiv:2109.05104(2021).",
      "doi": ""
    },
    {
      "text": "Tiffany Grace Holmes. 2007. Eco-visualization: combining art and technology to reduce energy consumption. In Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition. 153–162.",
      "doi": "10.1145/1254960.1254982"
    },
    {
      "text": "David Holstius, John Kembel, Amy Hurst, Peng-Hui Wan, and Jodi Forlizzi. 2004. Infotropism: living and robotic plants as interactive displays. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques. 215–221.",
      "doi": "10.1145/1013115.1013145"
    },
    {
      "text": "The White House. 2022. National Climate Task Force. https://www.whitehouse.gov/climate/",
      "doi": ""
    },
    {
      "text": "Diana Ivanova, Konstantin Stadler, Kjartan Steen-Olsen, Richard Wood, Gibran Vita, Arnold Tukker, and Edgar G Hertwich. 2016. Environmental impact assessment of household consumption. Journal of Industrial Ecology 20, 3 (2016), 526–536.",
      "doi": ""
    },
    {
      "text": "Peraphan Jittrapirom, Valeria Caiati, A-M Feneri, Shima Ebrahimigharehbaghi, María J Alonso González, and Jishnu Narayan. 2017. Mobility as a service: A critical review of definitions, assessments of schemes, and key challenges. (2017).",
      "doi": ""
    },
    {
      "text": "Avraham N Kluger and Angelo DeNisi. 1996. The effects of feedback interventions on performance: a historical review, a meta-analysis, and a preliminary feedback intervention theory.Psychological bulletin 119, 2 (1996), 254.",
      "doi": ""
    },
    {
      "text": "I-Min Lee, Eric J Shiroma, Masamitsu Kamada, David R Bassett, Charles E Matthews, and Julie E Buring. 2019. Association of step volume and intensity with all-cause mortality in older women. JAMA internal medicine 179, 8 (2019), 1105–1112.",
      "doi": ""
    },
    {
      "text": "Rachael Link and Kris Gunnars. 2021. How many calories should you eat per day to lose weight?https://www.healthline.com/nutrition/how-many-calories-per-day#average-needs",
      "doi": ""
    },
    {
      "text": "Yana Litovsky, George Loewenstein, Samantha Horn, and Christopher Y Olivola. 2022. Loss aversion, the endowment effect, and gain-loss framing shape preferences for noninstrumental information. Proceedings of the National Academy of Sciences 119, 34(2022), e2202700119.",
      "doi": ""
    },
    {
      "text": "Rubén Lozano-Aguilera. 2022. More ways to drive sustainably and save money with google maps. https://blog.google/around-the-globe/google-europe/eco-friendly-routing-in-europe/",
      "doi": ""
    },
    {
      "text": "Lyft. 2019. Making cities more livable with electric vehicles. https://www.lyft.com/blog/posts/making-cities-more-liveable-with-electric-vehicles",
      "doi": ""
    },
    {
      "text": "Smithsonian Magazine. 2022. Spain restricts use of air conditioning in public places. https://www.smithsonianmag.com/smart-news/spain-restricts-use-of-air-conditioning-in-public-places-180980539/",
      "doi": ""
    },
    {
      "text": "Jasmin Mahmoodi, Stefanie Hille, Martin K Patel, and Tobias Brosch. 2021. Using rewards and penalties to promote sustainability: Who chooses incentive-based electricity products and why?Journal of Consumer Behaviour 20, 2 (2021), 381–398.",
      "doi": ""
    },
    {
      "text": "Michael E Mann. 2021. The new climate war: The fight to take back our planet. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Nathan Novemsky and Daniel Kahneman. 2005. The boundaries of loss aversion. Journal of Marketing research 42, 2 (2005), 119–128.",
      "doi": ""
    },
    {
      "text": "Stefan Palan and Christian Schitter. 2018. Prolific. ac—A subject pool for online experiments. Journal of Behavioral and Experimental Finance 17 (2018), 22–27.",
      "doi": ""
    },
    {
      "text": "Hannah Park, Angela Sanguinetti, and Gabriel Castillo Cortes. 2017. EcoTrips. In International Conference of Design, User Experience, and Usability. Springer, 60–76.",
      "doi": ""
    },
    {
      "text": "Wei Peng, Lin Li, Anastasia Kononova, Shelia Cotten, Kendra Kamp, Marie Bowen, 2021. Habit formation in wearable activity tracker use among older adults: qualitative study. JMIR mHealth and uHealth 9, 1 (2021), e22488.",
      "doi": ""
    },
    {
      "text": "The Climate Pledge. 2022. Net-Zero Carbon by 2040. https://www.theclimatepledge.com/",
      "doi": ""
    },
    {
      "text": "Scott Plous. 1993. The psychology of judgment and decision making.Mcgraw-Hill Book Company.",
      "doi": ""
    },
    {
      "text": "Qualtrics. 2021. MaxDiff - Qualtrics. https://www.qualtrics.com/support/conjoint-project/getting-started-conjoints/getting-started-maxdiff/getting-started-with-maxdiff-projects/",
      "doi": ""
    },
    {
      "text": "Thom Rieck. 2020. 10,000 steps a day: Too low? too high?https://www.mayoclinic.org/healthy-lifestyle/fitness/in-depth/10000-steps/art-20317391",
      "doi": ""
    },
    {
      "text": "William Safire. 2008. Footprint. https://web.archive.org/web/20130430210302http://www.nytimes.com/2008/02/17/magazine/17wwln-safire-t.html",
      "doi": ""
    },
    {
      "text": "Angela Sanguinetti, Kelsea Dombrovski, and Suhaila Sikand. 2018. Information, timing, and display: A design-behavior framework for improving the effectiveness of eco-feedback. Energy Research & Social Science 39 (2018), 55–68.",
      "doi": ""
    },
    {
      "text": "Angela Sanguinetti, Andrew Kwon, Yitong Li, Vishal Chakraborty, Suhaila Sikand, Otavio Tarelho, Ying Chen, and Nina Amenta. 2017. GreenFLY. In International Conference of Design, User Experience, and Usability. Springer, 87–103.",
      "doi": ""
    },
    {
      "text": "P Wesley Schultz, Jessica M Nolan, Robert B Cialdini, Noah J Goldstein, and Vladas Griskevicius. 2007. The constructive, destructive, and reconstructive power of social norms. Psychological science 18, 5 (2007), 429–434.",
      "doi": ""
    },
    {
      "text": "P Wesley Schultz, Jessica M Nolan, Robert B Cialdini, Noah J Goldstein, and Vladas Griskevicius. 2018. The constructive, destructive, and reconstructive power of social norms: Reprise. Perspectives on psychological science 13, 2 (2018), 249–254.",
      "doi": ""
    },
    {
      "text": "Shalom H Schwartz. 1977. Normative influences on altruism. In Advances in experimental social psychology. Vol. 10. Elsevier, 221–279.",
      "doi": ""
    },
    {
      "text": "Gözel Shakeri and Claire H McCallum. 2021. Envirofy your Shop: Development of a Real-time Tool to Support Eco-friendly Food Purchases Online. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3411763.3451713"
    },
    {
      "text": "David A Shamma, Matthew L Lee, Alexandre LS Filipowicz, Laurent Denoue, Kate Glazko, Kalani Murakami, and Kent Lyons. 2022. EV Life: A Counterfactual Dashboard Towards Reducing Carbon Emissions of Automotive Behaviors. In 27th International Conference on Intelligent User Interfaces. 46–49.",
      "doi": ""
    },
    {
      "text": "Gregg Sparkman and Gregory M Walton. 2017. Dynamic norms promote sustainable behavior, even if it is counternormative. Psychological science 28, 11 (2017), 1663–1674.",
      "doi": ""
    },
    {
      "text": "[67] Statista.2022. https://www.statista.com/statistics/999398/carbon-dioxide-emissions-sources-european-union-eu/",
      "doi": ""
    },
    {
      "text": "Helen Stopps and Marianne F Touchie. 2021. Residential smart thermostat use: An exploration of thermostat programming, environmental attitudes, and the influence of smart controls on energy savings. Energy and Buildings 238(2021), 110834.",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1985. The framing of decisions and the psychology of choice. In Behavioral decision making. Springer, 25–41.",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1992. Advances in prospect theory: Cumulative representation of uncertainty. Journal of Risk and uncertainty 5, 4 (1992), 297–323.",
      "doi": ""
    },
    {
      "text": "Mascha Van der Voort, Mark S Dougherty, and Martin van Maarseveen. 2001. A prototype fuel-efficiency support tool. Transportation Research Part C: Emerging Technologies 9, 4(2001), 279–296.",
      "doi": ""
    },
    {
      "text": "Steffen P Walz and Sebastian Deterding. 2014. Gamifying green: gamification and environmental sustainability. (2014).",
      "doi": ""
    },
    {
      "text": "Sarah E West, Anne Owen, Katarina Axelsson, and Chris D West. 2016. Evaluating the use of a carbon footprint calculator: communicating impacts of consumption at household level and exploring mitigation options. Journal of Industrial Ecology 20, 3 (2016), 396–409.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors. 2022. Phase-out of incandescent light bulbs — Wikipedia, The Free Encyclopedia. https://en.wikipedia.org/w/index.php?title=Phase-out_of_incandescent_light_bulbs&oldid=1105075892 [Online; accessed 15-September-2022].",
      "doi": ""
    },
    {
      "text": "Bob Woods. 2022. How the massive EV transition is starting in the car rental industry. https://www.cnbc.com/2022/06/18/how-the-massive-ev-transition-is-starting-in-the-car-rental-industry.html",
      "doi": ""
    },
    {
      "text": "Ray Yun, Peter Scupelli, Azizan Aziz, and Vivian Loftness. 2013. Sustainability in the workplace: nine intervention techniques for behavior change. In International conference on persuasive technology. Springer, 253–265.",
      "doi": "10.1007/978-3-642-37157-8_30"
    },
    {
      "text": "Jorge Luis Zapico, Cecilia Katzeff, Ulrica Bohné, and Rebecka Milestad. 2016. Eco-feedback visualization for closing the gap of organic food consumption. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. 1–9.",
      "doi": "10.1145/2971485.2971507"
    }
  ]
}