{
  "doi": "10.1145/3544548.3581162",
  "title": "Wish You Were Here: Mental and Physiological Effects of Remote Music Collaboration in Mixed Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "With face-to-face music collaboration being severely limited during the recent pandemic, mixed reality technologies and their potential to provide musicians a feeling of \"being there\" with their musical partner can offer tremendous opportunities. In order to assess this potential, we conducted a laboratory study in which musicians made music together in real-time while simultaneously seeing their jamming partner’s mixed reality point cloud via a head-mounted display and compared mental effects such as flow, affect, and co-presence to an audio-only baseline. In addition, we tracked the musicians’ physiological signals and evaluated their features during times of self-reported flow. For users jamming in mixed reality, we observed a significant increase in co-presence. Regardless of the condition (mixed reality or audio-only), we observed an increase in positive affect after jamming remotely. Furthermore, we identified heart rate and HF/LF as promising features for classifying the flow state musicians experienced while making music together.",
  "tags": [
    "Social Presence",
    "Co-Presence",
    "Remote Collaboration",
    "Networked Music Performance",
    "Mixed Reality",
    "Head-mounted Displays",
    "Augmented Reality",
    "Psychophysiology",
    "Physiological Signal Processing"
  ],
  "authors": [
    {
      "name": "Ruben Schlagowski",
      "institution": "Chair for Human-Centered Artificial Intelligence, University of Augsburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659443254",
      "orcid": "0000-0002-3516-6188"
    },
    {
      "name": "Dariia Nazarenko",
      "institution": "Chair for Human-Centered Artificial Intelligence, University of Augsburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780503",
      "orcid": "0000-0003-1164-7283"
    },
    {
      "name": "Yekta Can",
      "institution": "Chair for Human-Centered Artificial Intelligence, University of Augsburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783686",
      "orcid": "0000-0002-6614-0183"
    },
    {
      "name": "Kunal Gupta",
      "institution": "Empathic Computing Lab, University of Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707157",
      "orcid": "0000-0003-3963-8856"
    },
    {
      "name": "Silvan Mertes",
      "institution": "Chair for Human-Centered Artificial Intelligence, University of Augsburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659900764",
      "orcid": "0000-0001-5230-5218"
    },
    {
      "name": "Mark Billinghurst",
      "institution": "Empathic Computing Lab, University of Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100499261",
      "orcid": "0000-0003-4172-6759"
    },
    {
      "name": "Elisabeth André",
      "institution": "Chair for Human-Centered Artificial Intelligence, University of Augsburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548034272",
      "orcid": "0000-0002-2367-162X"
    }
  ],
  "references": [
    {
      "text": "Ane Alberdi, Asier Aztiria, and Adrian Basarab. 2016. Towards an automatic early stress recognition system for office environments based on multimodal measurements: A review. Journal of Biomedical Informatics 59 (2016), 49 – 75.",
      "doi": "10.1016/j.jbi.2015.11.007"
    },
    {
      "text": "Huidong Bai, Prasanth Sasikumar, Jing Yang, and Mark Billinghurst. 2020. A user study on mixed reality remote collaboration with eye gaze and hand gesture sharing. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3313831.3376550"
    },
    {
      "text": "Stephen Barrass and Tim Barrass. 2006. Musical creativity in collaborative virtual environments. Virtual Reality 10, 2 (2006), 149–157.",
      "doi": "10.5555/3113194.3113384"
    },
    {
      "text": "Tobias Baur, Alexander Heimerl, Florian Lingenfelser, Johannes Wagner, Michel F. Valstar, Björn Schuller, and Elisabeth André. 2020. eXplainable Cooperative Machine Learning with NOVA. KI - Künstliche Intelligenz (19 Jan 2020).",
      "doi": ""
    },
    {
      "text": "Yulong Bian, Chenglei Yang, Fengqiang Gao, Huiyu Li, Shisheng Zhou, Hanchao Li, Xiaowen Sun, and Xiangxu Meng. 2016. A framework for physiological indicators of flow in VR games: construction and preliminary evaluation. Personal and Ubiquitous Computing 20, 5 (2016), 821–832.",
      "doi": "10.1007/s00779-016-0953-5"
    },
    {
      "text": "Frank Biocca and Chad Harms. 2003. Networked Minds Social Presence Inventory:|(Scales only, Version 1.2) Measures of co-presence, social presence, subjective symmetry, and intersubjective symmetry. (2003).",
      "doi": ""
    },
    {
      "text": "Frank Biocca, Chad Harms, and Jenn Gregg. 2001. The networked minds measure of social presence: Pilot test of the factor structure and concurrent validity. In 4th annual international workshop on presence, Philadelphia, PA. 1–9.",
      "doi": ""
    },
    {
      "text": "Nicolas Bonneel, Julien Rabin, Gabriel Peyré, and Hanspeter Pfister. 2015. Sliced and radon wasserstein barycenters of measures. Journal of Mathematical Imaging and Vision 51, 1 (2015), 22–45.",
      "doi": "10.1007/s10851-014-0506-3"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis.(2012).",
      "doi": ""
    },
    {
      "text": "Nick Bryan-Kinns. 2004. Daisyphone: the design and impact of a novel environment for remote group music improvisation. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques. 135–144.",
      "doi": "10.1145/1013115.1013135"
    },
    {
      "text": "Nick Bryan-Kinns and Patrick GT Healey. 2004. Daisyphone: support for remote music collaboration. In Proceedings of the 2004 conference on New interfaces for musical expression. 27–30.",
      "doi": ""
    },
    {
      "text": "Igor Burstyn and Tran Huynh. 2021. Symptoms of anxiety and depression in relation to work patterns during the first wave of the COVID-19 epidemic in Philadelphia PA: a cross-sectional survey. Journal of occupational and environmental medicine 63, 5 (2021), e283.",
      "doi": ""
    },
    {
      "text": "Carrie J Cai, Michelle Carney, Nida Zada, and Michael Terry. 2021. Breakdowns and breakthroughs: Observing musicians’ responses to the COVID-19 pandemic. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445192"
    },
    {
      "text": "Alexander Carôt, Torben Hohn, and Christian Werner. 2009. Netjack-Remote music collaboration with electronic sequencers on the Internet. na.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1975. Beyond boredom and anxiety. The Jossey-Bass behavioral science series., 36 pages.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 2000. Beyond boredom and anxiety.Jossey-bass.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihayli. 1991. Talent and enjoyment: Findings from a longitudinal study. In Keynote address at the annual conference of the association for the advancement of applied sport psychology, Savannah, GA.",
      "doi": ""
    },
    {
      "text": "Gill Davies. 2015. The effectiveness of LOLA (LOw LAtency) audiovisual streaming technology for distributed music practice. M. Research diss., Edinburgh Napier University (2015).",
      "doi": ""
    },
    {
      "text": "Caroline A Davis, Robert D Levitan, Caroline Reid, Jacqueline C Carter, Allan S Kaplan, Karen A Patte, Nicole King, Claire Curtis, and James L Kennedy. 2009. Dopamine for “wanting” and opioids for “liking”: a comparison of obese adults with and without binge eating. Obesity 17, 6 (2009), 1220–1225.",
      "doi": ""
    },
    {
      "text": "Antonio Deusany de Carvalho Junior, Sang Won Lee, and Georg Essl. 2015. Supercopair: Collaborative live coding on supercollider through the cloud. In International Conference on Live Coding.",
      "doi": ""
    },
    {
      "text": "Örjan De Manzano, Töres Theorell, László Harmat, and Fredrik Ullén. 2010. The psychophysiology of flow during piano playing.Emotion 10, 3 (2010), 301.",
      "doi": ""
    },
    {
      "text": "Ed Diener and Robert A Emmons. 1984. The independence of positive and negative affect.Journal of personality and social psychology 47, 5(1984).",
      "doi": ""
    },
    {
      "text": "Daniel Diethei, Jasmin Niess, Carolin Stellmacher, Evropi Stefanidi, and Johannes Schöning. 2021. Sharing heartbeats: motivations of citizen scientists in times of crises. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445665"
    },
    {
      "text": "Arne Dietrich. 2004. Neurocognitive mechanisms underlying the experience of flow. Consciousness and Cognition 13, 4 (2004), 746–761.",
      "doi": ""
    },
    {
      "text": "Carlo Drioli, Claudio Allocchio, and Nicola Buso. 2013. Networked performances and natural interaction via LOLA: Low latency high quality A/V streaming system. In International Conference on Information Technologies for Performing Arts, Media Access, and Entertainment. Springer, 240–250.",
      "doi": ""
    },
    {
      "text": "Robin IM Dunbar, Kostas Kaskatis, Ian MacDonald, and Vinnie Barra. 2012. Performance of music elevates pain threshold and positive affect: implications for the evolutionary function of music. Evolutionary psychology 10, 4 (2012), 147470491201000403.",
      "doi": ""
    },
    {
      "text": "Paul Elvers, Timo Fischinger, and Jochen Steffens. 2018. Music listening as self-enhancement: Effects of empowering music on momentary explicit and implicit self-esteem. Psychology of Music 46, 3 (2018), 307–325.",
      "doi": ""
    },
    {
      "text": "Stefan Ed Engeser. 2012. Advances in flow research.Springer Science+ Business Media.",
      "doi": ""
    },
    {
      "text": "Melissa Forbes. 2021. Giving voice to jazz singers’ experiences of flow in improvisation. Psychology of Music 49, 4 (2021), 789–803.",
      "doi": ""
    },
    {
      "text": "Jessica L Ford, Justine Vosloo, and Monna Arvinen-Barrow. 2020. ‘Pouring everything that you are’: musicians’ experiences of optimal performances. British Journal of Music Education 37, 2 (2020), 141–153.",
      "doi": ""
    },
    {
      "text": "Hilary A Fredenburg and Michael J Silverman. 2014. Effects of music therapy on positive and negative affect and pain with hospitalized patients recovering from a blood and marrow transplant: A randomized effectiveness study. The Arts in Psychotherapy 41, 2 (2014), 174–180.",
      "doi": ""
    },
    {
      "text": "Barbara Smolej Fritz and Andreja Avsec. 2007. The experience of flow and subjective well-being of music students. Horizons of psychology 16, 2 (2007), 5–17.",
      "doi": ""
    },
    {
      "text": "Martin Gjoreski, Hristijan Gjoreski, Mitja Luštrek, and Matjaž Gams. 2016. Continuous Stress Detection Using a Wrist Device: In Laboratory and Real Life. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (Heidelberg, Germany) (UbiComp ’16). ACM, New York, NY, USA, 1185–1193.",
      "doi": "10.1145/2968219.2968306"
    },
    {
      "text": "Scott W Greenwald, Zhangyuan Wang, Markus Funk, and Pattie Maes. 2017. Investigating social presence and communication with embodied avatars in room-scale virtual reality. In International Conference on Immersive Learning. Springer, 75–90.",
      "doi": ""
    },
    {
      "text": "Jenny M Groarke and Michael J Hogan. 2019. Listening to self-chosen music regulates induced negative affect for both younger and older adults. PLoS One 14, 6 (2019), e0218017.",
      "doi": ""
    },
    {
      "text": "Michael Gurevich. 2006. JamSpace: a networked real-time collaborative music environment. In CHI’06 extended abstracts on Human factors in computing systems. 821–826.",
      "doi": ""
    },
    {
      "text": "Susan Hallam and Raymond MacDonald. 2008. The effects of music in community and educational settings. (2008).",
      "doi": ""
    },
    {
      "text": "Rob Hamilton and Chris Platz. 2016. Gesture-based collaborative virtual reality performance in carillon. In Proceedings of the 2016 international computer music conference. 337–340.",
      "doi": ""
    },
    {
      "text": "László Harmat, Örjan de Manzano, Töres Theorell, Lennart Högman, Håkan Fischer, and Fredrik Ullén. 2015. Physiological correlates of the flow experience during computer game playing. International Journal of Psychophysiology 97, 1 (2015), 1–7.",
      "doi": ""
    },
    {
      "text": "Sture Holm. 1979. A simple sequentially rejective multiple test procedure. Scandinavian journal of statistics(1979), 65–70.",
      "doi": ""
    },
    {
      "text": "Vahid Houshyarifar and Mehdi Chehel Amirani. 2017. Early detection of sudden cardiac death using Poincaré plots and recurrence plot-based features from HRV signals. Turkish Journal of Electrical Engineering & Computer Sciences 25, 2(2017), 1541–1553.",
      "doi": ""
    },
    {
      "text": "Susan A Jackson and Mihaly Csikszentmihalyi. 1999. Flow in sports. The keys to optimal experiences and performances: Human Kinetics.",
      "doi": ""
    },
    {
      "text": "Kenneth L Kaiser. 2005. Transmission lines, matching, and crosstalk. CRC Press.",
      "doi": ""
    },
    {
      "text": "Walter Karlen, Srinivas Raman, J Mark Ansermino, and Guy A Dumont. 2013. Multiparameter respiratory rate estimation from the photoplethysmogram. IEEE Transactions on Biomedical Engineering 60, 7 (2013), 1946–1953.",
      "doi": ""
    },
    {
      "text": "Jason R Keeler, Edward A Roth, Brittany L Neuser, John M Spitsbergen, Daniel James Maxwell Waters, John-Mary Vianney, 2015. The neurochemistry and social flow of singing: bonding and oxytocin. Frontiers in human neuroscience(2015), 518.",
      "doi": ""
    },
    {
      "text": "Joann Marie Kirchner, Arvid J Bloom, and Paula Skutnick-Henley. 2008. The relationship between performance anxiety and flow. Medical Problems of Performing Artists 23, 2 (2008), 59–65.",
      "doi": ""
    },
    {
      "text": "J Matias Kivikangas 2006. Psychophysiology of flow experience: An explorative study. (2006).",
      "doi": ""
    },
    {
      "text": "Veronika Krauß, Alexander Boden, Leif Oppermann, and René Reiners. 2021. Current practices, challenges, and design implications for collaborative AR/VR application development. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445335"
    },
    {
      "text": "Fusako Kusunoki, Masanori Sugimoto, and Hiromichi Hashizume. 2002. Symphony-Q: A support system for learning music in collaborative learning. In IEEE International Conference on Systems, Man and Cybernetics, Vol. 4. IEEE, 6–pp.",
      "doi": ""
    },
    {
      "text": "Anna Grace Leicht. 2022. Teaching Music in the Age of Zoom: How to Run a Multimedia Piano Studio. (2022).",
      "doi": ""
    },
    {
      "text": "Michael Lester and Jon Boley. 2007. The effects of latency on live sound monitoring. In Audio Engineering Society Convention 123. Audio Engineering Society.",
      "doi": ""
    },
    {
      "text": "Howard Levene. 1961. Robust tests for equality of variances. Contributions to probability and statistics. Essays in honor of Harold Hotelling (1961), 279–292.",
      "doi": ""
    },
    {
      "text": "David Lindlbauer and Andy D Wilson. 2018. Remixed reality: Manipulating space and time in augmented reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173703"
    },
    {
      "text": "Hancong Liu, Sirish Shah, and Wei Jiang. 2004. On-line outlier detection and data cleaning. Computers & chemical engineering 28, 9 (2004), 1635–1647.",
      "doi": ""
    },
    {
      "text": "Tim Loepthien and Bernhard Leipold. 2022. Flow in music performance and music-listening: Differences in intensity, predictors, and the relationship between flow and subjective well-being. Psychology of Music 50, 1 (2022), 111–126.",
      "doi": ""
    },
    {
      "text": "Raymond MacDonald and Ross Birrell. 2021. Flattening the Curve: Glasgow Improvisers Orchestra’s Use of Virtual Improvising to Maintain Community During the COVID-19 Pandemic. Critical Studies in Improvisation/Études critiques en improvisation 14, 2-3(2021).",
      "doi": ""
    },
    {
      "text": "Raymond AR MacDonald. 2013. Music, health, and well-being: A review. International journal of qualitative studies on health and well-being 8, 1(2013), 20635.",
      "doi": ""
    },
    {
      "text": "Peter Mall and Jürgen Kilian. 2021. Low-Latency Online Music Tool in Practice. (2021).",
      "doi": ""
    },
    {
      "text": "Liang Men and Nick Bryan-Kinns. 2018. LeMo: supporting collaborative music making in virtual reality. In 2018 IEEE 4th VR workshop on sonic interactions for virtual environments (SIVE). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Madison Merry and Michael J Silverman. 2021. Effects of patient-preferred live music on positive and negative affect and pain with adults on a post-surgical oncology unit: A randomized study. The Arts in Psychotherapy 72 (2021), 101739.",
      "doi": ""
    },
    {
      "text": "Evan Morgan, Hatice Gunes, and Nick Bryan-Kinns. 2014. Instrumenting the interaction: affective and psychophysiological features of live collaborative musical improvisation. (2014).",
      "doi": ""
    },
    {
      "text": "Evan Morgan, Hatice Gunes, and Nick Bryan-Kinns. 2015. Using affective and behavioural sensors to explore aspects of collaborative music making. International Journal of Human-Computer Studies 82 (2015), 31–47.",
      "doi": "10.1016/j.ijhcs.2015.05.002"
    },
    {
      "text": "Kristine L Nowak and Frank Biocca. 2003. The effect of the agency and anthropomorphism on users’ sense of telepresence, copresence, and social presence in virtual environments. Presence: Teleoperators & Virtual Environments 12, 5(2003), 481–494.",
      "doi": "10.1162/105474603322761289"
    },
    {
      "text": "Jieun Oh, Jorge Herrera, Nicholas J Bryan, Luke Dahl, and Ge Wang. 2010. Evolving The Mobile Phone Orchestra.. In NIME. Sydney, 82–87.",
      "doi": ""
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L Davidson, Sameh Khamis, Mingsong Dou, 2016. Holoportation: Virtual 3d teleportation in real-time. In Proceedings of the 29th annual symposium on user interface software and technology. 741–754.",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Sihwa Park. 2019. ARLooper: a mobile AR application for collaborative sound recording and performance. In International Symposium on Computer Music Multidisciplinary Research. Springer, 554–562.",
      "doi": ""
    },
    {
      "text": "Corinna Peifer, André Schulz, Hartmut Schächinger, Nicola Baumann, and Conny H Antoni. 2014. The relation of flow-experience and physiological arousal under stress—can u shape it?Journal of Experimental Social Psychology 53 (2014), 62–69.",
      "doi": ""
    },
    {
      "text": "Tomislav Pejsa, Julian Kantor, Hrvoje Benko, Eyal Ofek, and Andrew Wilson. 2016. Room2room: Enabling life-size telepresence in a projected augmented reality environment. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. 1716–1725.",
      "doi": "10.1145/2818048.2819965"
    },
    {
      "text": "Tanner Person, Benjamin Outram, and Kouta Minamizawa. 2018. Flow zone: A cross-modal music creation VR experience to induce flow. In SIGGRAPH Asia 2018 Virtual & Augmented Reality. 1–2.",
      "doi": ""
    },
    {
      "text": "Simon Pfaff and Olav Lervik. 2015. Games in concert. In 2015 IEEE 2nd VR Workshop on Sonic Interactions for Virtual Environments (SIVE). 1–4.",
      "doi": "10.1109/SIVE.2015.7361289"
    },
    {
      "text": "Rosland W Picard. 2016. Automating the Recognition of Stress and Emotion: From Lab to Real-World Impact. IEEE MultiMedia 23, 3 (July 2016), 3–7.",
      "doi": "10.1109/MMUL.2016.38"
    },
    {
      "text": "Jarosław Piskorski and Przemysław Guzik. 2005. Filtering poincare plots. Computational methods in science and technology 11, 1(2005), 39–48.",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Gun A Lee, Jonathon D Hart, Barrett Ens, Robert W Lindeman, Bruce H Thomas, and Mark Billinghurst. 2018. Mini-me: An adaptive avatar for mixed reality remote collaboration. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "Ivan Poupyrev, Rodney Berry, Jun Kurumisawa, Keiko Nakao, Mark Billinghurst, Chris Airola, Hirokazu Kato, Tomoko Yonezawa, and Lewis Baldwin. 2000. Augmented groove: Collaborative jamming in augmented reality. In ACM SIGGRAPH 2000 Conference Abstracts and Applications, Vol. 17. 77.",
      "doi": ""
    },
    {
      "text": "Holger Regenbrecht, Claudia Ott, Noel Park, Stuart Duncan, and Jonny Collins. 2021. Voxelvideos for entertainment, education, and training. IEEE Access 9(2021), 68185–68196.",
      "doi": ""
    },
    {
      "text": "Holger Regenbrecht, Jung-Woo Park, Claudia Ott, Steven Mills, Matthew Cook, and Tobias Langlotz. 2019. Preaching voxels: an alternative approach to mixed reality. Frontiers in ICT 6(2019), 7.",
      "doi": ""
    },
    {
      "text": "Falko Rheinberg, Regina Vollmeyer, and Stefan Engeser. 2003. Die Erfassung des Flow-Erlebens. In Diagnostik von Motivation und Selbstkonzept (Tests und Trends – Jahrbuch der pädagogisch-psychologischen Diagnostik - Band 2). 261–279.",
      "doi": ""
    },
    {
      "text": "Cristina Rottondi, Chris Chafe, Claudio Allocchio, and Augusto Sarti. 2016. An overview on networked music performance technologies. IEEE Access 4(2016), 8823–8843.",
      "doi": ""
    },
    {
      "text": "Anastasia Ruvimova, Junhyeok Kim, Thomas Fritz, Mark Hancock, and David C Shepherd. 2020. \" Transport Me Away\": Fostering Flow in Open Offices through Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376724"
    },
    {
      "text": "Katharina Schäfer, Suvi Saarikallio, and Tuomas Eerola. 2020. Music may reduce loneliness and act as social surrogate for a friend: evidence from an experimental listening study. Music & Science 3(2020), 2059204320935709.",
      "doi": ""
    },
    {
      "text": "E Glenn Schellenberg. 2005. Music and cognitive abilities. Current Directions in Psychological Science 14, 6 (2005), 317–320.",
      "doi": ""
    },
    {
      "text": "Ruben Schlagowski, Kunal Gupta, Silvan Mertes, Mark Billinghurst, Susanne Metzner, and Elisabeth André. 2022. Jamming in MR: towards real-time music collaboration in mixed reality. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, 854–855.",
      "doi": ""
    },
    {
      "text": "Ralph Schroeder. 2002. Copresence and interaction in virtual environments: An overview of the range of issues. In Presence 2002: Fifth international workshop. Citeseer, 274–295.",
      "doi": ""
    },
    {
      "text": "Frederick A Seddon. 2005. Modes of communication during jazz improvisation. British Journal of Music Education 22, 1 (2005), 47–61.",
      "doi": ""
    },
    {
      "text": "Fred Shaffer and Jay P Ginsberg. 2017. An overview of heart rate variability metrics and norms. Frontiers in public health(2017), 258.",
      "doi": ""
    },
    {
      "text": "Samuel Sanford Shapiro and Martin B Wilk. 1965. An analysis of variance test for normality (complete samples). Biometrika 52, 3/4 (1965), 591–611.",
      "doi": ""
    },
    {
      "text": "Lin Shu, Jinyan Xie, Mingyue Yang, Ziyi Li, Zhenqi Li, Dan Liao, Xiangmin Xu, and Xinyi Yang. 2018. A review of emotion recognition using physiological signals. Sensors 18, 7 (2018), 2074.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Amela Sadagic, Martin Usoh, and Ralph Schroeder. 2000. Small-group behavior in a virtual and real environment: A comparative study. Presence 9, 1 (2000), 37–51.",
      "doi": "10.1162/105474600566600"
    },
    {
      "text": "Harrison Jesse Smith and Michael Neff. 2018. Communication behavior in embodied virtual reality. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3173574.3173863"
    },
    {
      "text": "Student. 1908. The probable error of a mean. Biometrika (1908), 1–25.",
      "doi": ""
    },
    {
      "text": "Leonard Tan and Hui Xing Sin. 2021. Flow research in music contexts: A systematic literature review. Musicae Scientiae 25, 4 (2021), 399–428.",
      "doi": ""
    },
    {
      "text": "Auke Tellegen. 1988. Development and Validation of Brief Measures of Positive and Negative Affect: The PANAS Scales. Journal of Personality and Social Psychology 54, 6(1988), 1063–1070.",
      "doi": ""
    },
    {
      "text": "Tahmine Tozman, Elisabeth S Magdas, Hamish G MacDougall, and Regina Vollmeyer. 2015. Understanding the psychophysiology of flow: A driving simulator experiment to investigate the relationship between flow and heart rate variability. Computers in Human Behavior 52 (2015), 408–418.",
      "doi": "10.1016/j.chb.2015.06.023"
    },
    {
      "text": "Luca Turchet, Rob Hamilton, and Anil Çamci. 2021. Music in Extended Realities. IEEE Access 9(2021), 15810–15832.",
      "doi": ""
    },
    {
      "text": "Paul van Gent, Haneen Farah, Nicole Nes, and Bart van Arem. 2018. Heart rate analysis for human factors: Development and validation of an open source toolkit for noisy naturalistic heart rate data. In Proceedings of the 6th HUMANIST Conference. 173–178.",
      "doi": ""
    },
    {
      "text": "Johannes Wagner, Florian Lingenfelser, Tobias Baur, Ionut Damian, Felix Kistler, and Elisabeth André. 2013. The social signal interpretation (SSI) framework: multimodal signal processing and recognition in real-time. In Proceedings of the 21st ACM international conference on Multimedia. 831–834.",
      "doi": "10.1145/2502081.2502223"
    },
    {
      "text": "Graham F Welch, Michele Biasutti, Jennifer MacRitchie, Gary E McPherson, and Evangelos Himonides. 2020. The impact of music on human development and well-being. Frontiers in Psychology 11 (2020), 1246.",
      "doi": ""
    },
    {
      "text": "Peter D Welch. 1967. The use of fast Fourier transform for the estimation of power spectra: A method based on time averaging over short, modified periodograms. IEEE Transactions on Audio and Electroacoustics 15, 2(1967), 70–73.",
      "doi": ""
    },
    {
      "text": "Christopher D Wickens. 2008. Multiple resources and mental workload. Human factors 50, 3 (2008), 449–455.",
      "doi": ""
    },
    {
      "text": "Frank Wilcoxon. 1992. Individual comparisons by ranking methods. In Breakthroughs in statistics. Springer, 196–202.",
      "doi": ""
    },
    {
      "text": "Ian H Witten, Eibe Frank, Mark A Hall, Christopher J Pal, and MINING DATA. 2005. Practical machine learning tools and techniques. In Data Mining, Vol. 2.",
      "doi": ""
    },
    {
      "text": "William J Wrigley and Stephen B Emmerson. 2013. The experience of the flow state in live music performance. Psychology of Music 41, 3 (2013), 292–305.",
      "doi": ""
    },
    {
      "text": "Boram Yoon, Hyung-il Kim, Gun A Lee, Mark Billinghurst, and Woontack Woo. 2019. The effect of avatar appearance on social presence in an augmented reality remote collaboration. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 547–556.",
      "doi": ""
    },
    {
      "text": "Tianyi Zhang, Björn Hartmann, Miryung Kim, and Elena L Glassman. 2020. Enabling data-driven api design with community usage data: A need-finding study. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376382"
    }
  ]
}