{
  "doi": "10.1145/3544548.3580659",
  "title": "“Any bit of help, helps”: Understanding how older caregivers use carework platforms for caregiving support",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Older adults are increasingly acting as caregivers, given population aging and pervasive caregiver shortages. Meanwhile, gig-economy-based carework platforms have also become popular. As older adults are one of the fastest-growing groups of informal caregivers and technology users in the past decade, we conducted an online survey among older adults residing in the US (N = 193) about how they use these platforms to manage their caregiving tasks. We identified factors related to their frequency of using caregiving help and their intention to continue using caregiving help via carework platforms. We also reported how and why older adults use these platforms, their main concerns and needs related to these platforms, and their most significant positive and negative experiences. Our findings contribute to a foundational understanding of how older caregivers use carework platforms and how such platforms could be better designed to suit the needs and wants of older caregivers.",
  "authors": [
    {
      "name": "Lin Li",
      "institution": "Department of Informatics, University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783541",
      "orcid": "0000-0002-8197-9155"
    },
    {
      "name": "Vitica Arnold",
      "institution": "Department of Informatics, University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660641732",
      "orcid": "0000-0002-6023-6459"
    },
    {
      "name": "Anne Marie Piper",
      "institution": "Department of Informatics, University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316490036",
      "orcid": "0000-0003-3085-3277"
    }
  ],
  "references": [
    {
      "text": "AARP. 2021. Tech Usage Among Older Adults Skyrockets During Pandemic. AARP Press Room. Retrieved August 25, 2022 from https://press.aarp.org/2021-4-21-Tech-Usage-Among-Older-Adults-Skyrockets-During-Pandemic",
      "doi": ""
    },
    {
      "text": "AARP. 2021. Caregiving Out-of-Pocket Costs Study. AARP Research, Washington, DC. DOI:https://doi.org/10.26419/res.00473.001",
      "doi": ""
    },
    {
      "text": "Gregory Abowd, Gillian Hayes, Julie Kientz, Lena Mamykina, and Elizabeth Mynatt. 2022. Challenges and Opportunities for Collaboration Technologies for Chronic Care Management. (September 2022).",
      "doi": ""
    },
    {
      "text": "Christopher V. Almario, Megana L. Ballal, William D. Chey, Carl Nordstrom, Dinesh Khanna, and Brennan M.R. Spiegel. 2018. Burden of Gastrointestinal Symptoms in the United States: Results of a Nationally Representative Survey of Over 71,000 Americans. Am J Gastroenterol 113, 11 (November 2018), 1701–1710. DOI:https://doi.org/10.1038/s41395-018-0256-8",
      "doi": ""
    },
    {
      "text": "P. G. Archbold, B. J. Stewart, M. R. Greenlick, and T. Harvath. 1990. Mutuality and preparedness as predictors of caregiver role strain. Res Nurs Health 13, 6 (December 1990), 375–384. DOI:https://doi.org/10.1002/nur.4770130605",
      "doi": ""
    },
    {
      "text": "JANE ARONSON and SHEILA M. NEYSMITH. 1996. “YOU'RE NOT JUST IN THERE TO DO THE WORK”: Depersonalizing Policies and the Exploitation of Home Care Workers’ Labor. Gender & Society 10, 1 (February 1996), 59–77. DOI:https://doi.org/10.1177/089124396010001005",
      "doi": ""
    },
    {
      "text": "Caroline Bell, Cara Fausset, Sarah Farmer, Julie Nguyen, Linda Harley, and W. Bradley Fain. 2013. Examining social media use among older adults. In Proceedings of the 24th ACM Conference on Hypertext and Social Media (HT ’13), Association for Computing Machinery, New York, NY, USA, 158–163. DOI:https://doi.org/10.1145/2481492.2481509",
      "doi": "10.1145/2481492.2481509"
    },
    {
      "text": "Timothy W. Bickmore, Laura M. Pfeifer, and Brian W. Jack. 2009. Taking the time to care: empowering low health literacy hospital patients with virtual nurse agents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’09), Association for Computing Machinery, New York, NY, USA, 1265–1274. DOI:https://doi.org/10.1145/1518701.1518891",
      "doi": "10.1145/1518701.1518891"
    },
    {
      "text": "Judith Bom, Pieter Bakx, Frederik Schut, and Eddy van Doorslaer. 2019. The Impact of Informal Caregiving for Older Adults on the Health of Various Types of Caregivers: A Systematic Review. The Gerontologist 59, 5 (September 2019), e629–e642. DOI:https://doi.org/10.1093/geront/gny137",
      "doi": ""
    },
    {
      "text": "Lilian Bernadina Josefina Bosch and Marije Kanis. 2016. Design Opportunities for Supporting Informal Caregivers. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’16), Association for Computing Machinery, New York, NY, USA, 2790–2797. DOI:https://doi.org/10.1145/2851581.2892354",
      "doi": "10.1145/2851581.2892354"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2022. Using thematic analysis in psychology. Sage Publications, London.",
      "doi": ""
    },
    {
      "text": "Robin Brewer, Meredith Ringel Morris, and Anne Marie Piper. 2016. “Why would anybody do this?”: Understanding Older Adults’ Motivations and Challenges in Crowd Work. ACM Press, 2246–2257. DOI:https://doi.org/10.1145/2858036.2858198",
      "doi": "10.1145/2858036.2858198"
    },
    {
      "text": "Robin N. Brewer, Sarita Schoenebeck, Kerry Lee, and Haripriya Suryadevara. 2021. Challenging Passive Social Media Use: Older Adults as Caregivers Online. Proc. ACM Hum.-Comput. Interact. 5, CSCW1 (April 2021), 1–20. DOI:https://doi.org/10.1145/3449197",
      "doi": "10.1145/3449197"
    },
    {
      "text": "Robin Brewer and Anne Marie Piper. 2016. “Tell It Like It Really Is”: A Case of Online Content Creation and Sharing Among Older Adult Bloggers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), Association for Computing Machinery, New York, NY, USA, 5529–5542. DOI:https://doi.org/10.1145/2858036.2858379",
      "doi": "10.1145/2858036.2858379"
    },
    {
      "text": "Lee D. Butterfield, William A. Borgen, Norman E. Amundson, and Asa-Sophia T. Maglio. 2005. Fifty years of the critical incident technique: 1954-2004 and beyond. Qualitative Research 5, 4 (November 2005), 475–497. DOI:https://doi.org/10.1177/1468794105056924",
      "doi": ""
    },
    {
      "text": "Clara Caldeira, Novia Nurain, and Kay Connelly. 2022. “I hope I never need one”: Unpacking Stigma in Aging in Place Technology. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3491102.3517586",
      "doi": "10.1145/3491102.3517586"
    },
    {
      "text": "Care.com. 2021. Basic Membership vs. Premium Subscription: What's the difference for families? Retrieved December 11, 2022 from https://help.care.com/families/s/article/What-is-the-difference-between-a-basic-and-premium-membership?language=en_US&memberUUID=7929f66f-e8cf-4210-ab36-61756e260e06&memberType=BASIC",
      "doi": ""
    },
    {
      "text": "Care.com. 2022. What is a CareCheck? Help Center. Retrieved September 13, 2022 from https://help.care.com/families/s/article/What-is-a-CareCheck-1?language=en_US",
      "doi": ""
    },
    {
      "text": "Juan Carlos Alvarez de la Vega, Marta E. Cecchinato, and John Rooksby. 2021. “Why lose control?” A Study of Freelancers’ Experiences with Gig Economy Platforms. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–14. DOI:https://doi.org/10.1145/3411764.3445305",
      "doi": "10.1145/3411764.3445305"
    },
    {
      "text": "Hui-Chen Chao, Ya-Ping Yang, Mei-Chih Huang, and Jing-Jy Wang. 2016. Development and Psychometric Testing of the Caregiver Communication Competence Scale in Patients With Dementia. Journal of Gerontological Nursing 42, 1 (January 2016), 32–39. DOI:https://doi.org/10.3928/00989134-20151008-36",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for caregivers: designing for integrality. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW ’13), Association for Computing Machinery, New York, NY, USA, 91–102. DOI:https://doi.org/10.1145/2441776.2441789",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Miriam A. Cherry and Antonio Aloisi. 2016. “Dependent Contractors” in the Gig Economy: A Comparative Approach. DOI:https://doi.org/10.2139/ssrn.2847869",
      "doi": ""
    },
    {
      "text": "C. M. Connell, M. R. Janevic, and M. P. Gallant. 2001. The costs of caring: impact of dementia on family caregivers. J Geriatr Psychiatry Neurol 14, 4 (2001), 179–187. DOI:https://doi.org/10.1177/089198870101400403",
      "doi": ""
    },
    {
      "text": "Flannery Currin, Gustavo Razo, and Aehong Min. 2019. Give Me a Break: Design for Communication Among Family Caregivers and Respite Caregivers. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), Association for Computing Machinery, New York, NY, USA, 1–6. DOI:https://doi.org/10.1145/3290607.3309687",
      "doi": "10.1145/3290607.3309687"
    },
    {
      "text": "Omid Dadras, SeyedAhmad SeyedAlinaghi, Amirali Karimi, Ahmadreza Shamsabadi, Kowsar Qaderi, Maryam Ramezani, Seyed Peyman Mirghaderi, Sara Mahdiabadi, Farzin Vahedi, Solmaz Saeidi, Alireza Shojaei, Mohammad Mehrtak, Shiva A. Azar, Esmaeil Mehraeen, and Fabrício A. Voltarelli. 2022. COVID-19 mortality and its predictors in the elderly: A systematic review. Health Science Reports 5, 3 (2022), e657. DOI:https://doi.org/10.1002/hsr2.657",
      "doi": ""
    },
    {
      "text": "H. D. W. T. Damayanthi, K. I. P. Prabani, and Ishanka Weerasekara. 2021. Factors Associated for Mortality of Older People With COVID 19: A Systematic Review and Meta-analysis. Gerontol Geriatr Med 7, (December 2021), 23337214211057390. DOI:https://doi.org/10.1177/23337214211057392",
      "doi": ""
    },
    {
      "text": "Alexander J.A.M. van Deursen, Ellen J. Helsper, and Rebecca Eynon. 2016. Development and validation of the Internet Skills Scale (ISS). Information, Communication & Society 19, 6 (June 2016), 804–823. DOI:https://doi.org/10.1080/1369118X.2015.1078834",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt, Xinyi Wang, Earnest Wheeler, Hao Fei Cheng, Brent Hecht, and Haiyi Zhu. 2017. The Sharing Economy in Computing: A Systematic Literature Review. Proc. ACM Hum.-Comput. Interact. 1, CSCW (December 2017), 38:1-38:26. DOI:https://doi.org/10.1145/3134673",
      "doi": "10.1145/3134673"
    },
    {
      "text": "Emma Dixon, Anne Marie Piper, and Amanda Lazar. 2021. “Taking care of myself as long as I can”: How People with Dementia Configure Self-Management Systems. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3411764.3445225",
      "doi": "10.1145/3411764.3445225"
    },
    {
      "text": "Niels van Doorn. 2017. Platform labor: on the gendered and racialized exploitation of low-income service work in the ‘on-demand’ economy. Information, Communication & Society 20, 6 (June 2017), 898–914. DOI:https://doi.org/10.1080/1369118X.2017.1294194",
      "doi": ""
    },
    {
      "text": "Mignon Duffy. 2011. Making Care Count: A Century of Gender, Race, and Paid Care Work. Rutgers University Press, New Brunswick. Retrieved September 13, 2022 from https://muse.jhu.edu/book/2209",
      "doi": ""
    },
    {
      "text": "Family Caregiver Alliance. Caregiver Statistics: Demographics. Family Caregiver Alliance. Retrieved September 6, 2022 from https://www.caregiver.org/resource/caregiver-statistics-demographics/",
      "doi": ""
    },
    {
      "text": "Michelle Faverio. 2022. Share of those 65 and older who are tech users has grown in the past decade. Pew Research Center. Retrieved August 25, 2022 from https://www.pewresearch.org/fact-tank/2022/01/13/share-of-those-65-and-older-who-are-tech-users-has-grown-in-the-past-decade/",
      "doi": ""
    },
    {
      "text": "Frances Flanagan. 2019. Theorising the gig economy and home-based service work. Journal of Industrial Relations 61, 1 (February 2019), 57–78. DOI:https://doi.org/10.1177/0022185618800518",
      "doi": ""
    },
    {
      "text": "Pin Sym Foong, Shengdong Zhao, Felicia Tan, and Joseph Jay Williams. 2018. Harvesting Caregiving Knowledge: Design Considerations for Integrating Volunteer Input in Dementia Care. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3173574.3173653",
      "doi": "10.1145/3173574.3173653"
    },
    {
      "text": "Sarah E. Fox, Vera Khovanskaya, Clara Crivellaro, Niloufar Salehi, Lynn Dombrowski, Chinmay Kulkarni, Lilly Irani, and Jodi Forlizzi. 2020. Worker-Centered Design: Expanding HCI Methods for Supporting Labor. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), Association for Computing Machinery, New York, NY, USA, 1–8. DOI:https://doi.org/10.1145/3334480.3375157",
      "doi": "10.1145/3334480.3375157"
    },
    {
      "text": "Kathrin Gerling, Ian Livingston, Lennart Nacke, and Regan Mandryk. 2012. Full-body motion-based game interaction for older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12), Association for Computing Machinery, New York, NY, USA, 1873–1882. DOI:https://doi.org/10.1145/2207676.2208324",
      "doi": "10.1145/2207676.2208324"
    },
    {
      "text": "Evelyn Nakano Glenn. 2010. Forced to Care: Coercion and Caregiving in America. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Elaine Godfrey. 2020. ‘We're Literally Killing Elders Now.’ The Atlantic. Retrieved September 15, 2022 from https://www.theatlantic.com/politics/archive/2020/04/coronavirus-especially-deadly-nursing-homes/610855/",
      "doi": ""
    },
    {
      "text": "Kirsten Grind, Gregory Zuckerman, and Shane Shifflett. 2019. Care.com Puts Onus on Families to Check Caregivers’ Backgrounds—With Sometimes Tragic Outcomes. WSJ. Retrieved December 11, 2022 from https://www.wsj.com/articles/care-com-puts-onus-on-families-to-check-caregivers-backgroundswith-sometimes-tragic-outcomes-11552088138",
      "doi": ""
    },
    {
      "text": "Ken H. M. HO, Vico C. L. CHIANG, Doris LEUNG, and Daphne S. K. CHEUNG. 2019. A feminist phenomenology on the emotional labor and morality of live-in migrant care workers caring for older people in the community. BMC Geriatrics 19, 1 (November 2019), 314. DOI:https://doi.org/10.1186/s12877-019-1352-3",
      "doi": ""
    },
    {
      "text": "HomeCare.com. HomeCare.com: Quality home care company for elderly. Retrieved December 11, 2022 from https://www.homecare.com/",
      "doi": ""
    },
    {
      "text": "Keman Huang, Jinhui Yao, and Ming Yin. 2019. Understanding the Skill Provision in Gig Economy from A Network Perspective: A Case Study of Fiverr. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 132:1-132:23. DOI:https://doi.org/10.1145/3359234",
      "doi": "10.1145/3359234"
    },
    {
      "text": "Jeff Johnson and Kate Finn. 2017. Designing User Interfaces for an Aging Population: Towards Universal Design. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, Azra Ismail, Karthik S Bhat, Aakash Gautam, Sachin R Pendse, Neha Kumar, Richard Anderson, Madeline Balaam, Shaowen Bardzell, Nicola J Bidwell, Melissa Densmore, Elizabeth Kaziunas, Anne Marie Piper, Noopur Raval, Pushpendra Singh, Austin Toombs, Nervo Verdezoto, and Ding Wang. 2021. The Future of Care Work: Towards a Radical Politics of Care in CSCW Research and Practice. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’21), Association for Computing Machinery, New York, NY, USA, 338–342. DOI:https://doi.org/10.1145/3462204.3481734",
      "doi": "10.1145/3462204.3481734"
    },
    {
      "text": "Sidney Katz, Amasa B. Ford, Roland W. Moskowitz, Beverly A. Jackson, and Marjorie W. Jaffe. 1963. Studies of Illness in the Aged: The Index of ADL: A Standardized Measure of Biological and Psychosocial Function. JAMA 185, 12 (September 1963), 914–919. DOI:https://doi.org/10.1001/jama.1963.03060120024016",
      "doi": ""
    },
    {
      "text": "Eliscia Kinder, Mohammad Hossein Jarrahi, and Will Sutherland. 2019. Gig Platforms, Tensions, Alliances and Ecosystems: An Actor-Network Perspective. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 212:1-212:26. DOI:https://doi.org/10.1145/3359314",
      "doi": "10.1145/3359314"
    },
    {
      "text": "Eva Feder Kittay. 1999. Love's Labor: Essays on Women, Equality, and Dependency. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Ben Knight. 2020. Caregiver shortage means less time for patients. Deutsche Welle. Retrieved December 11, 2022 from https://www.dw.com/en/germanys-caregiver-shortage-means-less-time-for-patients/a-52549043",
      "doi": ""
    },
    {
      "text": "Claire Kumar and Helen Dempster. 2021. Staffing Shortages in the UK's Care Sector: A Sign of Things to Come. Center for Global Development | Ideas to Action. Retrieved December 11, 2022 from https://www.cgdev.org/blog/staffing-shortages-uks-care-sector-sign-things-come",
      "doi": ""
    },
    {
      "text": "Guy Laban, Val Morrison, Arvid Kappas, and Emily S. Cross. 2022. Informal Caregivers Disclose Increasingly More to a Social Robot Over Time. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (CHI EA ’22), Association for Computing Machinery, New York, NY, USA, 1–7. DOI:https://doi.org/10.1145/3491101.3519666",
      "doi": "10.1145/3491101.3519666"
    },
    {
      "text": "Amanda Lazar, Mark Diaz, Robin Brewer, Chelsea Kim, and Anne Marie Piper. 2017. Going Gray, Failure to Hire, and the Ick Factor: Analyzing How Older Bloggers Talk about Ageism. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, ACM, Portland Oregon USA, 655–668. DOI:https://doi.org/10.1145/2998181.2998275",
      "doi": "10.1145/2998181.2998275"
    },
    {
      "text": "Déjà Leonard. 2022. Shortage of caregivers has families struggling with rising child-care costs. The Globe and Mail. Retrieved December 11, 2022 from https://www.theglobeandmail.com/business/careers/article-caregivers-shortage-childcare-costs/",
      "doi": ""
    },
    {
      "text": "Siân E. Lindley, Richard Harper, and Abigail Sellen. 2009. Desiring to be in touch in a changing communications landscape: attitudes of older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’09), Association for Computing Machinery, New York, NY, USA, 1693–1702. DOI:https://doi.org/10.1145/1518701.1518962",
      "doi": "10.1145/1518701.1518962"
    },
    {
      "text": "Mable.com.au. Mable: Disability NDIS & Aged Care. Find Local Support Workers | Mable. Retrieved December 11, 2022 from https://mable.com.au/",
      "doi": ""
    },
    {
      "text": "Elizabeth B. Marquis, Sangmi Kim, Rasha Alahmad, Casey S. Pierce, and Lionel P. Robert Jr. 2018. Impacts of Perceived Behavior Control and Emotional Labor on Gig Workers. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’18), Association for Computing Machinery, New York, NY, USA, 241–244. DOI:https://doi.org/10.1145/3272973.3274065",
      "doi": "10.1145/3272973.3274065"
    },
    {
      "text": "Andrew D. Miller, Sonali R. Mishra, Logan Kendall, Shefali Haldar, Ari H. Pollack, and Wanda Pratt. 2016. Partners in Care: Design Considerations for Caregivers and Patients During a Hospital Stay. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, ACM, San Francisco California USA, 756–769. DOI:https://doi.org/10.1145/2818048.2819983",
      "doi": "10.1145/2818048.2819983"
    },
    {
      "text": "Julie Miller, Carley Ward, Chaiwoo Lee, Lisa D'Ambrosio, and Joseph Coughlin. 2020. Sharing is caring: The potential of the sharing economy to support aging in place. Gerontology & Geriatrics Education 41, 4 (October 2020), 407–429. DOI:https://doi.org/10.1080/02701960.2018.1428575",
      "doi": ""
    },
    {
      "text": "National Alliance for Caregiving and AARP. 2004. Caregiving in the U.S. Retrieved September 2, 2022 from https://assets.aarp.org/rgcenter/il/us_caregiving.pdf",
      "doi": ""
    },
    {
      "text": "National Alliance for Caregiving and AARP. 2020. Caregiving in the U.S. Retrieved September 6, 2022 from https://www.aarp.org/content/dam/aarp/ppi/2020/05/full-report-caregiving-in-the-united-states.doi.10.26419-2Fppi.00103.001.pdf",
      "doi": ""
    },
    {
      "text": "Steve O'Hear. 2018. Careship, the German marketplace for in-home care, scores further €6M funding. TechCrunch. Retrieved December 11, 2022 from https://techcrunch.com/2018/04/05/careship/",
      "doi": ""
    },
    {
      "text": "Paul Osterman. 2017. Who Will Care For Us?: Long-Term Care and the Long-Term Workforce. Russell Sage Foundation, New York. Retrieved September 6, 2022 from https://muse.jhu.edu/book/52642",
      "doi": ""
    },
    {
      "text": "Emily Paulin. 2022. COVID-19 Deaths on the Rise in Nursing Homes. AARP. Retrieved September 15, 2022 from https://www.aarp.org/caregiving/health/info-2022/nursing-home-covid-19-report-september.html",
      "doi": ""
    },
    {
      "text": "L. I. Pearlin, J. T. Mullan, S. J. Semple, and M. M. Skaff. 1990. Caregiving and the stress process: an overview of concepts and their measures. Gerontologist 30, 5 (October 1990), 583–594. DOI:https://doi.org/10.1093/geront/30.5.583",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2021. Internet/Broadband Fact Sheet. Internet/Broadband Fact Sheet. Retrieved May 17, 2022 from https://www.pewresearch.org/internet/fact-sheet/internet-broadband/",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2021. Social Media Fact Sheet. Social Media Fact Sheet. Retrieved May 17, 2022 from https://www.pewresearch.org/internet/fact-sheet/social-media/",
      "doi": ""
    },
    {
      "text": "R. I. Pfeffer, T. T. Kurosaki, C. H. Harrah Jr., J. M. Chance, and S. Filos. 1982. Measurement of Functional Activities in Older Adults in the Community1. Journal of Gerontology 37, 3 (May 1982), 323–329. DOI:https://doi.org/10.1093/geronj/37.3.323",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper, Raymundo Cornejo, Lisa Hurwitz, and Caitlin Unumb. 2016. Technological Caregiving: Supporting Online Activity for Adults with Cognitive Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, San Jose California USA, 5311–5323. DOI:https://doi.org/10.1145/2858036.2858260",
      "doi": "10.1145/2858036.2858260"
    },
    {
      "text": "Noopur Raval and Paul Dourish. 2016. Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW ’16), Association for Computing Machinery, New York, NY, USA, 97–107. DOI:https://doi.org/10.1145/2818048.2820026",
      "doi": "10.1145/2818048.2820026"
    },
    {
      "text": "Lazlo Ring, Lin Shi, Kathleen Totzke, and Timothy Bickmore. 2015. Social support agents for older adults: longitudinal affective computing in the home. J Multimodal User Interfaces 9, 1 (March 2015), 79–88. DOI:https://doi.org/10.1007/s12193-014-0157-0",
      "doi": ""
    },
    {
      "text": "Shruti Sannon, Billie Sun, and Dan Cosley. 2022. Privacy, Surveillance, and Power in the Gig Economy. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–15. DOI:https://doi.org/10.1145/3491102.3502083",
      "doi": "10.1145/3491102.3502083"
    },
    {
      "text": "Florian A Schmidt. 2016. Digital Labour Markets in the Platform Economy. Friedrich-Ebert Stiftung. Retrieved from https://library.fes.de/pdf-files/wiso/13164.pdf",
      "doi": ""
    },
    {
      "text": "Marén Schorch, Lin Wan, David William Randall, and Volker Wulf. 2016. Designing for Those who are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW ’16), Association for Computing Machinery, New York, NY, USA, 787–799. DOI:https://doi.org/10.1145/2818048.2819999",
      "doi": "10.1145/2818048.2819999"
    },
    {
      "text": "Gregory Zuckerman and Dave Sebastian. 2019. IAC to Buy Care.com in $500 Million Cash Deal. WSJ. Retrieved December 11, 2022 from https://www.wsj.com/articles/iac-to-buy-care-com-in-500-million-cash-deal-11576851598",
      "doi": ""
    },
    {
      "text": "Lawrence G. Shattuck and David D. Woods. 1994. The Critical Incident Technique: 40 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 38, 17 (October 1994), 1080–1084. DOI:https://doi.org/10.1177/154193129403801702",
      "doi": ""
    },
    {
      "text": "Andrew Sixsmith, Becky R. Horst, Dorina Simeonov, and Alex Mihailidis. 2022. Older People's Use of Digital Technology During the COVID-19 Pandemic. Bulletin of Science, Technology & Society 42, 1–2 (June 2022), 19–24. DOI:https://doi.org/10.1177/02704676221094731",
      "doi": ""
    },
    {
      "text": "Will Sutherland and Mohammad Hossein Jarrahi. 2017. The Gig Economy and Information Infrastructure: The Case of the Digital Nomad Community. Proc. ACM Hum.-Comput. Interact. 1, CSCW (December 2017), 97:1-97:24. DOI:https://doi.org/10.1145/3134732",
      "doi": "10.1145/3134732"
    },
    {
      "text": "Charlotte Tang, Yunan Chen, Karen Cheng, Victor Ngo, and John E. Mattison. 2018. Awareness and handoffs in home care: coordination among informal caregivers. Behaviour & Information Technology 37, 1 (January 2018), 66–86. DOI:https://doi.org/10.1080/0144929X.2017.1405073",
      "doi": ""
    },
    {
      "text": "Julia Ticona. 2022. Red flags, sob stories, and scams: The contested meaning of governance on carework labor platforms. New Media & Society 24, 7 (July 2022), 1548–1566. DOI:https://doi.org/10.1177/14614448221099233",
      "doi": ""
    },
    {
      "text": "Julia Ticona and Alexandra Mateescu. 2018. Trusted strangers: Carework platforms’ cultural entrepreneurship in the on-demand economy. New Media & Society 20, 11 (November 2018), 4384–4404. DOI:https://doi.org/10.1177/1461444818773727",
      "doi": ""
    },
    {
      "text": "Matthieu Tixier, Gérald Gaglio, and Myriam Lewkowicz. 2009. Translating social support practices into online services for family caregivers. In Proceedings of the ACM 2009 international conference on Supporting group work (GROUP ’09), Association for Computing Machinery, New York, NY, USA, 71–80. DOI:https://doi.org/10.1145/1531674.1531685",
      "doi": "10.1145/1531674.1531685"
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2016. “Counting on the Group”: Reconciling Online and Offline Social Support among Older Informal Caregivers. 3545–3558. DOI:https://doi.org/10.1145/2858036.2858477",
      "doi": "10.1145/2858036.2858477"
    },
    {
      "text": "Austin Toombs, Colin Gray, Guoyang Zhou, and Ann Light. 2018. Appropriated or Inauthentic Care in Gig-Economy Platforms: A Psycho-linguistic Analysis of Uber and Lyft. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–6. DOI:https://doi.org/10.1145/3170427.3188657",
      "doi": "10.1145/3170427.3188657"
    },
    {
      "text": "Jacqueline M. Torres, Kathryn G. Kietzman, and Steven P. Wallace. 2015. Walking the Line: Navigating Market and Gift Economies of Care in a Consumer-Directed Home-Based Care Program for Older Adults. Milbank Q 93, 4 (December 2015), 732–760. DOI:https://doi.org/10.1111/1468-0009.12163",
      "doi": ""
    },
    {
      "text": "Tiina Vaittinen, Hanna-Kaisa Hoppania, and Olli Karsio. 2018. Marketization, commodification and privatization of care services. Handbook on the International Political Economy of Gender (February 2018), 379–391.",
      "doi": ""
    },
    {
      "text": "Steven Vallas and Juliet B. Schor. 2020. What Do Platforms Do? Understanding the Gig Economy. Annu. Rev. Sociol. 46, 1 (July 2020), 273–294. DOI:https://doi.org/10.1146/annurev-soc-121919-054857",
      "doi": ""
    },
    {
      "text": "Laura Pfeifer Vardoulakis, Lazlo Ring, Barbara Barry, Candace L. Sidner, and Timothy Bickmore. 2012. Designing Relational Agents as Long Term Social Companions for Older Adults. In Intelligent Virtual Agents (Lecture Notes in Computer Science), Springer, Berlin, Heidelberg, 289–302. DOI:https://doi.org/10.1007/978-3-642-33197-8_30",
      "doi": "10.1007/978-3-642-33197-8_30"
    },
    {
      "text": "Viswanath Venkatesh, Michael G. Morris, Gordon B. Davis, and Fred D. Davis. 2003. User acceptance of information technology: Toward a unified view. MIS quarterly (2003), 425–478.",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An Age-Old Problem: Examining the Discourses of Ageing in HCI and Strategies for Future Research. ACM Trans. Comput.-Hum. Interact. 22, 1 (February 2015), 2:1-2:27. DOI:https://doi.org/10.1145/2696867",
      "doi": "10.1145/2696867"
    },
    {
      "text": "VisitingAngels. VisitingAngels: Senior Home Care. Visiting Angels. Retrieved December 11, 2022 from https://www.visitingangels.com/",
      "doi": ""
    },
    {
      "text": "Kerryellen G. Vroman, Sajay Arthanat, and Catherine Lysack. 2015. “Who over 65 is online?” Older adults’ dispositions toward information communication technology. Computers in Human Behavior 43, (February 2015), 156–166. DOI:https://doi.org/10.1016/j.chb.2014.10.018",
      "doi": "10.1016/j.chb.2014.10.018"
    },
    {
      "text": "Rachel M. Werner, Allison K. Hoffman, and Norma B. Coe. 2020. Long-Term Care Policy after Covid-19 — Solving the Nursing Home Crisis. New England Journal of Medicine 383, 10 (September 2020), 903–905. DOI:https://doi.org/10.1056/NEJMp2014811",
      "doi": ""
    },
    {
      "text": "Nirmalie Wiratunga, Kay Cooper, Anjana Wijekoon, Chamath Palihawadana, Vanessa Mendham, Ehud Reiter, and Kyle Martin. 2020. FitChat: Conversational Artificial Intelligence Interventions for Encouraging Physical Activity in Older Adults. DOI:https://doi.org/10.48550/arXiv.2004.14067",
      "doi": ""
    },
    {
      "text": "Jamie Woodcock and Mark Graham. 2020. The gig economy: a critical introduction. Polity, Cambridge.",
      "doi": ""
    },
    {
      "text": "Chenyan Xu, Daniel Peak, and Victor Prybutok. 2015. A customer value, satisfaction, and loyalty perspective of mobile application recommendations. Decision Support Systems 79, (November 2015), 171–183. DOI:https://doi.org/10.1016/j.dss.2015.08.008",
      "doi": "10.1016/j.dss.2015.08.008"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing Moods: How Manual Tracking by Family Caregivers Improves Caring and Family Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), Association for Computing Machinery, New York, NY, USA, 158–169. DOI:https://doi.org/10.1145/3025453.3025843",
      "doi": "10.1145/3025453.3025843"
    },
    {
      "text": "Kathryn Zyskowski, Meredith Ringel Morris, Jeffrey P. Bigham, Mary L. Gray, and Shaun K. Kane. 2015. Accessible Crowdwork? Understanding the Value in and Challenge of Microtask Employment for People with Disabilities. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW ’15), Association for Computing Machinery, New York, NY, USA, 1682–1693. DOI:https://doi.org/10.1145/2675133.2675158",
      "doi": "10.1145/2675133.2675158"
    }
  ]
}