{
  "doi": "10.1145/3544548.3581048",
  "title": "RoutineAid: Externalizing Key Design Elements to Support Daily Routines of Individuals with Autism",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "Implementing structure into our daily lives is critical for maintaining health, productivity, and social and emotional well-being. New norms for routine management have emerged during the current pandemic, and in particular, individuals with autism find it difficult to adapt to those norms. While much research has focused on the use of computer technology to support individuals with autism, little is known about ways of helping them establish and maintain “self-directed” routine structures. In this paper, we identify design requirements for an app that support four key routine components (i.e., physical activity, diet, mindfulness, and sleep) through a formative study and develop RoutineAid, a gamified smartphone app that reflects the design requirements. The results of a two-month field study on design feasibility highlight two affordances of RoutineAid—the establishment of daily routines by facilitating micro-planning and the maintenance of daily routines through celebratory interactions. We discuss salient design considerations for the future development of daily routine management tools for individuals with autism.",
  "authors": [
    {
      "name": "Bogoan Kim",
      "institution": "School of Intelligence Computing, Hanyang University, Korea, Republic of and School of Intelligence Computing, Hanyang University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659893186",
      "orcid": "0000-0002-9083-1128"
    },
    {
      "name": "Sung-In Kim",
      "institution": "Medical division, Seoul Dasiseogi Homless Support Center, Korea, Republic of and Medical division, Seoul Dasiseogi Homless Support Center, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214465",
      "orcid": "0000-0001-7627-2756"
    },
    {
      "name": "Sangwon Park",
      "institution": "Dept. of Electrical and Computer Engineering, SNU, Korea, Republic of and Dept. of Electrical and Computer Engineering, SNU, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779874",
      "orcid": "0000-0002-9735-1303"
    },
    {
      "name": "Hee Jeong Yoo",
      "institution": "Seoul National University Bundang Hospital, Korea, Republic of and Seoul National University Bundang Hospital, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659433099",
      "orcid": "0000-0003-0521-2718"
    },
    {
      "name": "Hwajung Hong",
      "institution": "KAIST, Korea, Republic of and KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022414",
      "orcid": "0000-0001-5268-3331"
    },
    {
      "name": "Kyungsik Han",
      "institution": "Department of Data Science, Hanyang University, Korea, Republic of and Department of Data Science, Hanyang University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658997188",
      "orcid": "0000-0001-5535-0081"
    }
  ],
  "references": [
    {
      "text": "Mohammed Abdellaoui, Han Bleichrodt, and Olivier l’Haridon. 2008. A tractable method to measure utility and loss aversion under prospect theory. Journal of Risk and uncertainty 36, 3 (2008), 245–266.",
      "doi": ""
    },
    {
      "text": "Smisha Agarwal, Amnesty E LeFevre, Jaime Lee, Kelly L’engle, Garrett Mehl, Chaitali Sinha, and Alain Labrique. 2016. Guidelines for reporting of health interventions using mobile phones: mobile health (mHealth) evidence reporting and assessment (mERA) checklist. bmj 352(2016).",
      "doi": ""
    },
    {
      "text": "Bruce M Altevogt, Harvey R Colten, 2006. Sleep disorders and sleep deprivation: an unmet public health problem. (2006).",
      "doi": ""
    },
    {
      "text": "Stephanie H Ameis, Meng-Chuan Lai, Benoit H Mulsant, and Peter Szatmari. 2020. Coping, fostering resilience, and driving care innovation for autistic people and their families during the COVID-19 pandemic and beyond. Molecular Autism 11, 1 (2020), 1–9.",
      "doi": ""
    },
    {
      "text": "Autism Speaks. 2013. COVID-19 (coronavirus) information and resources. https://bit.ly/3DMHmUx Last accessed 25 August 2021.",
      "doi": ""
    },
    {
      "text": "Albert Bandura 2006. Guide for constructing self-efficacy scales. Self-efficacy beliefs of adolescents 5, 1 (2006), 307–337.",
      "doi": ""
    },
    {
      "text": "Simon Baron-Cohen, Sally Wheelwright, Richard Skinner, Joanne Martin, and Emma Clubley. 2001. The autism-spectrum quotient (AQ): Evidence from asperger syndrome/high-functioning autism, malesand females, scientists and mathematicians. Journal of autism and developmental disorders 31, 1 (2001), 5–17.",
      "doi": ""
    },
    {
      "text": "Renae Beaumont and Kate Sofronoff. 2008. A multi-component social skills intervention for children with Asperger syndrome: The Junior Detective Training Program. Journal of Child Psychology and Psychiatry 49, 7 (2008), 743–753.",
      "doi": ""
    },
    {
      "text": "Melissa D Bittner, B Rhett Rigby, Lisa Silliman-French, David L Nichols, and Suzanna R Dillon. 2017. Use of technology to facilitate physical activity in children with autism spectrum disorders: A pilot study. Physiology & behavior 177 (2017), 242–246.",
      "doi": ""
    },
    {
      "text": "Stéphanie Carlier, Sara Van der Paelt, Femke Ongenae, Femke De Backere, and Filip De Turck. 2020. Empowering children with ASD and their parents: Design of a serious game for anxiety and stress reduction. Sensors 20, 4 (2020), 966.",
      "doi": ""
    },
    {
      "text": "Sarah A Cassidy, Christina Nicolaidis, Bethan Davies, Shannon Des Roches Rosa, David Eisenman, Morénike Giwa Onaiwu, Steven K Kapp, Clarissa C Kripke, Jacqui Rodgers, and TC Waisman. 2020. An expert discussion on autism in the COVID-19 pandemic. Autism in Adulthood 2, 2 (2020), 106–117.",
      "doi": ""
    },
    {
      "text": "Stanley J Colcombe, Kirk I Erickson, Paige E Scalf, Jenny S Kim, Ruchika Prakash, Edward McAuley, Steriani Elavsky, David X Marquez, Liang Hu, and Arthur F Kramer. 2006. Aerobic exercise training increases brain volume in aging humans. The Journals of Gerontology Series A: Biological Sciences and Medical Sciences 61, 11 (2006), 1166–1170.",
      "doi": ""
    },
    {
      "text": "Marco Colizzi, Elena Sironi, Federico Antonini, Marco Luigi Ciceri, Chiara Bovo, and Leonardo Zoccante. 2020. Psychosocial and behavioral impact of COVID-19 in autism spectrum disorder: an online parent survey. Brain sciences 10, 6 (2020), 341.",
      "doi": ""
    },
    {
      "text": "Jifang Cui, Dingguo Gao, Yinghe Chen, Xiaobing Zou, and Ya Wang. 2010. Working memory in early-school-age children with Asperger’s syndrome. Journal of autism and developmental disorders 40, 8 (2010), 958–967.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining\" gamification\". In Proceedings of the 15th international academic MindTrek conference: Envisioning future media environments. 9–15.",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Ceymi Doenyas and Samaa M Shohieb. 2021. Leveraging Technology for the Wellbeing of Individuals With Autism Spectrum Disorder and Their Families During Covid-19. Frontiers in Psychiatry(2021), 795.",
      "doi": ""
    },
    {
      "text": "Geoffrey Engelstein. 2020. Achievement relocked: Loss aversion and game design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Adrien A Eshraghi, Crystal Li, Michael Alessandri, Daniel S Messinger, Rebecca S Eshraghi, Rahul Mittal, and F Daniel Armstrong. 2020. COVID-19: overcoming the challenges faced by individuals with autism and their families. The Lancet Psychiatry 7, 6 (2020), 481–483.",
      "doi": ""
    },
    {
      "text": "Joseph Firth, James E Gangwisch, Alessandra Borsini, Robyn E Wootton, and Emeran A Mayer. 2020. Food and mood: how do diet and nutrition affect mental wellbeing?Bmj 369(2020).",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Katta Spiel, Laura Scheepmaker, and Irene Posch. 2019. Nurturing constructive disagreement-Agonistic design with neurodiverse children. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–11.",
      "doi": "10.1145/3290605.3300501"
    },
    {
      "text": "Good Karma Applications, Inc. 2010. First Then Visual Schedule. https://apps.apple.com/us/app/first-then-visual-schedule/id355527801",
      "doi": ""
    },
    {
      "text": "Corentin J Gosling and Sylvain Moutier. 2018. Brief report: Risk-aversion and rationality in autism spectrum disorders. Journal of autism and developmental disorders 48, 10(2018), 3623–3628.",
      "doi": ""
    },
    {
      "text": "Temple Grandin. 2008. Thinking in pictures, expanded edition: My life with autism. Vintage.",
      "doi": ""
    },
    {
      "text": "A Guterres. 2020. We have a unique opportunity to design and implement more inclusive and accessible societies. United Nations COVID-19 Response(2020).",
      "doi": ""
    },
    {
      "text": "HabitRPG, Inc. 2020. Habitica: Gamified Taskmanager. https://apps.apple.com/us/app/habitica-gamified-taskmanager/id994882113",
      "doi": ""
    },
    {
      "text": "Juho Hamari. 2011. Perspectives from behavioral economics to analyzing game design patterns: Loss aversion in social games. In CHI (2011), Vancouver, Canada, May 7-12, 2011.",
      "doi": ""
    },
    {
      "text": "Tobias Heussner, Toiya Finley, Jennifer Hepler, and Ann Lemay. 2015. The game narrative toolbox. Routledge.",
      "doi": ""
    },
    {
      "text": "Clint Heyer and Margot Brereton. 2008. Reflective agile interative design. Proceedings of SIMTECH, Social Interaction with Mundane Technologies (2008), 1–4.",
      "doi": ""
    },
    {
      "text": "Johns Hopkins All Children’s Hospital. 2021. 5 Coronavirus Coping Tips for Parents of Children on the Autism Spectrum.",
      "doi": ""
    },
    {
      "text": "Wai Kai Hou, Francisco TT Lai, Menachem Ben-Ezra, and Robin Goodwin. 2020. Regularizing daily routines for mental health during and after the COVID-19 pandemic. Journal of global health 10, 2 (2020).",
      "doi": ""
    },
    {
      "text": "Juan Pablo Hourcade, Stacy R Williams, Ellen A Miller, Kelsey E Huebner, and Lucas J Liang. 2013. Evaluation of tablet apps to encourage social interaction in children with autism spectrum disorders. In Proceedings of the SIGCHI conference on human factors in computing systems. 3197–3206.",
      "doi": "10.1145/2470654.2466438"
    },
    {
      "text": "Julie A Kientz, Matthew S Goodwin, Gillian R Hayes, and Gregory D Abowd. 2013. Interactive technologies for autism. Synthesis lectures on assistive, rehabilitative, and health-preserving technologies 2, 2 (2013), 1–177.",
      "doi": "10.5555/2613712"
    },
    {
      "text": "Bogoan Kim, Dayoung Jeong, Mingon Jeong, Taehyung Noh, Sung-In Kim, Taewan Kim, So-Youn Jang, Hee Jeong Yoo, Jennifer Kim, Hwajung Hong, 2022. VISTA: User-centered VR Training System for Effectively Deriving Characteristics of People with Autism Spectrum Disorder. In Proceedings of the 28th ACM Symposium on Virtual Reality Software and Technology. 1–12.",
      "doi": "10.1145/3562939.3565608"
    },
    {
      "text": "Bogoan Kim, Daehyoung Lee, Aehong Min, Seungwon Paik, Georgia Frey, Scott Bellini, Kyungsik Han, and Patrick C Shih. 2020. PuzzleWalk: A theory-driven iterative design inquiry of a mobile game for promoting physical activity in adults with autism spectrum disorder. Plos one 15, 9 (2020), e0237966.",
      "doi": ""
    },
    {
      "text": "Sung-In Kim, Eunkyung Jo, Myeonghan Ryu, Inha Cha, Young-Ho Kim, Heejung Yoo, and Hwajung Hong. 2019. Toward becoming a better self: Understanding self-tracking experiences of adolescents with autism spectrum disorder using custom trackers. In Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare. 169–178.",
      "doi": "10.1145/3329189.3329209"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Bongshin Lee, Eun Kyoung Choe, and Jinwook Seo. 2017. OmniTrack: a flexible self-tracking approach leveraging semi-automated tracking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–28.",
      "doi": "10.1145/3131893"
    },
    {
      "text": "Reuben Kirkham and Chris Greenhalgh. 2015. Social access vs. privacy in wearable computing: A case study of autism. IEEE Pervasive Computing 14, 1 (2015), 26–33.",
      "doi": "10.1109/MPRV.2015.14"
    },
    {
      "text": "Artie Konrad, Victoria Bellotti, Nicole Crenshaw, Simon Tucker, Les Nelson, Honglu Du, Peter Pirolli, and Steve Whittaker. 2015. Finding the adaptive sweet spot: Balancing compliance and achievement in automated stress reduction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 3829–3838.",
      "doi": "10.1145/2702123.2702512"
    },
    {
      "text": "Yiannis Koumpouros and Theodoros Kafazis. 2019. Wearables and mobile technologies in Autism Spectrum Disorder interventions: A systematic literature review. Research in Autism Spectrum Disorders 66 (2019), 101405.",
      "doi": ""
    },
    {
      "text": "M Alexandra Kredlow, Michelle C Capozzoli, Bridget A Hearon, Amanda W Calkins, and Michael W Otto. 2015. The effects of physical activity on sleep: a meta-analytic review. Journal of behavioral medicine 38, 3 (2015), 427–449.",
      "doi": ""
    },
    {
      "text": "J Richard Landis and Gary G Koch. 1977. The measurement of observer agreement for categorical data. biometrics (1977), 159–174.",
      "doi": ""
    },
    {
      "text": "Nicholas D Lane, Mu Lin, Mashfiqui Mohammod, Xiaochao Yang, Hong Lu, Giuseppe Cardone, Shahid Ali, Afsaneh Doryab, Ethan Berke, Andrew T Campbell, 2014. Bewell: Sensing sleep, physical activities and social interactions to promote wellbeing. Mobile Networks and Applications 19, 3 (2014), 345–359.",
      "doi": "10.1007/s11036-013-0484-5"
    },
    {
      "text": "Daehyoung Lee, Georgia C Frey, Aehong Min, Bogoan Kim, Donetta J Cothran, Scott Bellini, Kyungsik Han, and Patrick C Shih. 2020. Usability inquiry of a gamified behavior change app for increasing physical activity and reducing sedentary behavior in adults with and without autism spectrum disorder. Health informatics journal 26, 4 (2020), 2992–3008.",
      "doi": ""
    },
    {
      "text": "Susan R Leekam, Margot R Prior, and Mirko Uljarevic. 2011. Restricted and repetitive behaviors in autism spectrum disorders: a review of research in the last decade.Psychological bulletin 137, 4 (2011), 562.",
      "doi": ""
    },
    {
      "text": "Rachel Loomes, Laura Hull, and William Polmear Locke Mandy. 2017. What is the male-to-female ratio in autism spectrum disorder? A systematic review and meta-analysis. Journal of the American Academy of Child & Adolescent Psychiatry 56, 6(2017), 466–474.",
      "doi": ""
    },
    {
      "text": "Anna V Mattioli, Susanna Sciomer, Camilla Cocchi, Silvia Maffei, and Sabina Gallina. 2020. Quarantine during COVID-19 outbreak: Changes in diet and physical activity increase the risk of cardiovascular disease. Nutrition, Metabolism and Cardiovascular Diseases 30, 9 (2020), 1409–1417.",
      "doi": ""
    },
    {
      "text": "Michael V McConnell, Anna Shcherbina, Aleksandra Pavlovic, Julian R Homburger, Rachel L Goldfeder, Daryl Waggot, Mildred K Cho, Mary E Rosenberger, William L Haskell, Jonathan Myers, 2017. Feasibility of obtaining measures of lifestyle from a smartphone app: the MyHeart Counts Cardiovascular Health Study. JAMA cardiology 2, 1 (2017), 67–76.",
      "doi": ""
    },
    {
      "text": "Antonio Narzisi. 2020. Handle the autism spectrum condition during Coronavirus (COVID-19) stay at home period: Ten tips for helping parents and caregivers of young children., 207 pages.",
      "doi": ""
    },
    {
      "text": "National Autistic Society. 2021. Guidance on supporting autistic people during the coronavirus outbreak. https://bit.ly/3FkTYl9 Last accessed 12 November 2021.",
      "doi": ""
    },
    {
      "text": "Danna Oomen, Annabel D Nijhof, and Jan R Wiersema. 2021. The psychological impact of the COVID-19 pandemic on adults with autism: a survey study across three countries. Molecular Autism 12, 1 (2021), 1–21.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2020. Disability considerations during the COVID-19 outbreak. Technical Report. World Health Organization.",
      "doi": ""
    },
    {
      "text": "Phaneronsoft. 2020. Fun Routine - Visual Schedules. https://play.google.com/store/apps/details?id=br.com.phaneronsoft.rotinadivertida&hl=en_US&gl=US",
      "doi": ""
    },
    {
      "text": "Hua Qin, Pei-Luen Patrick Rau, and Gavriel Salvendy. 2009. Measuring player immersion in the computer game narrative. Intl. Journal of Human–Computer Interaction 25, 2(2009), 107–133.",
      "doi": ""
    },
    {
      "text": "Jane Roitsch, Robert L Moore, and Annemarie L Horn. 2021. Lessons learned: What the COVID-19 global pandemic has taught us about teaching, technology, and students with autism spectrum disorder. Journal of Enabling Technologies(2021).",
      "doi": ""
    },
    {
      "text": "Julia SY Tang, Marita Falkmer, Nigel TM Chen, Sven Bolte, and Sonya Girdler. 2019. Designing a serious game for youth with ASD: perspectives from end-users and professionals. Journal of autism and developmental disorders 49, 3 (2019), 978–995.",
      "doi": ""
    },
    {
      "text": "Christiaan H Vinkers, Therese van Amelsvoort, Jonathan I Bisson, Igor Branchi, John F Cryan, Katharina Domschke, Oliver D Howes, Mirko Manchia, Luisa Pinto, Dominique de Quervain, 2020. Stress resilience during the coronavirus pandemic. European Neuropsychopharmacology 35 (2020), 12–16.",
      "doi": ""
    },
    {
      "text": "Joshua H West, Lindsay M Belvedere, Rebecca Andreasen, Christine Frandsen, P Cougar Hall, and Benjamin T Crookston. 2017. Controlling your “App” etite: how diet and nutrition-related mobile apps lead to behavior change. JMIR mHealth and uHealth 5, 7 (2017), e95.",
      "doi": ""
    },
    {
      "text": "Elisabeth M Whyte, Joshua M Smyth, and K Suzanne Scherf. 2015. Designing serious game interventions for individuals with autism. Journal of autism and developmental disorders 45, 12(2015), 3820–3831.",
      "doi": ""
    },
    {
      "text": "Marc R Woodbury-Smith, Janine Robinson, Sally Wheelwright, and Simon Baron-Cohen. 2005. Screening adults for Asperger syndrome using the AQ: A preliminary study of its diagnostic validity in clinical practice. Journal of autism and developmental disorders 35, 3 (2005), 331–335.",
      "doi": ""
    },
    {
      "text": "Holly R Wyatt, Gary K Grunwald, Cecilia L Mosca, Mary L Klem, Rena R Wing, and James O Hill. 2002. Long-term weight loss and breakfast in subjects in the National Weight Control Registry. Obesity research 10, 2 (2002), 78–82.",
      "doi": ""
    },
    {
      "text": "Tammar B Zilber, Rivka Tuval-Mashiach, and Amia Lieblich. 2008. The embedded narrative: Navigating through multiple contexts. Qualitative inquiry 14, 6 (2008), 1047–1069.",
      "doi": ""
    }
  ]
}