{
  "doi": "10.1145/3544548.3581036",
  "title": "Producer Conflict Management Approaches in Online Peer Production Communities – Case Study of OpenStreetMap",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2023,
  "badges": [],
  "abstract": "Producers of online peer-production communities (OPPCs) regularly experience conflicts with other producers. A deeper understanding of the producer conflict management approaches employed by community members could help OPPCs improve their conflict management tools. In this paper, we analyze the effectiveness of conflict management approaches employed by producers. Using OpenStreetMap (OSM) as a case study, we manually annotate OSM mappers’ conflict management approaches from 384 online discussion threads contained in one of OSM’s public communication channels. We investigate the effectiveness of conflict management by verifying whether producer discussions led to a solution. Our results show that online producer conflict management approaches with empathetic and proactive listening behaviors were more likely to reach a productive solution, whereas those approaches with negative online behaviors were less likely to do so. Based on these results, we reflect on how the user interface of OSM’s public online communication channels could better support producers to manage conflict behaviors.",
  "tags": [
    "Conflict management approach",
    "OpenStreetMap",
    "online discussion",
    "user interface design"
  ],
  "authors": [
    {
      "name": "Youjin Choe",
      "institution": "Department of Infrastructure Engineering, Faculty of Engineering and Information Technology, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783819",
      "orcid": "0000-0002-3959-2141"
    },
    {
      "name": "Martin Tomko",
      "institution": "Department of Infrastructure Engineering, Faculty of Engineering and Information Technology, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496645361",
      "orcid": "0000-0002-5736-4679"
    },
    {
      "name": "Mohsen Kalantari",
      "institution": "School of Civil and Enviromental Engineering, The University of New South Wales, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81555093656",
      "orcid": "0000-0002-6650-5218"
    }
  ],
  "references": [
    {
      "text": "Ofer Arazy, Oded Nov, Raymond Patterson, and Lisa Yeo. 2011. Information Quality in Wikipedia: The Effects of Group Composition and Task Conflict. Journal of Management Information Systems 27, 4 (2011), 71–98. https://doi.org/10.2753/mis0742-1222270403",
      "doi": "10.2753/mis0742-1222270403"
    },
    {
      "text": "Ofer Arazy, Lisa Yeo, and Oded Nov. 2013. Stay on the Wikipedia task: When task-related disagreements slip into personal and procedural conflicts. Journal of the American Society for Information Science and Technology 64, 8 (2013), 1634–1648. https://doi.org/10.1002/asi.22869",
      "doi": ""
    },
    {
      "text": "Andrea Ballatore. 2014. Defacing the Map: Cartographic Vandalism in the Digital Commons. Cartographic Journal 51, 3 (Aug. 2014), 214–224. https://doi.org/10.1179/1743277414Y.0000000085",
      "doi": ""
    },
    {
      "text": "Matt Billings and Leon A. Watts. 2010. Understanding Dispute Resolution Online: Using Text to Reflect Personal and Substantive Issues in Conflict. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1447–1456. https://doi.org/10.1145/1753326.1753542",
      "doi": "10.1145/1753326.1753542"
    },
    {
      "text": "Robert Blake and Jane Mouton. 1964. The managerial grid: The key to leadership excellence. Houston: Gulf Publishing Company, Houston, Texas, USA.",
      "doi": ""
    },
    {
      "text": "Mohamad Adam Bujang, Nadiah Sa’at, Tg Mohd Ikhwan Tg Abu Bakar, Lim Chien Joo, 2018. Sample size guidelines for logistic regression from observational studies with large population: emphasis on the accuracy between statistics and parameters based on real life clinical data. The Malaysian journal of medical sciences: MJMS 25, 4 (2018), 122.",
      "doi": ""
    },
    {
      "text": "Gerard A. Callanan, Cynthia D. Benzing, and David F. Perri. 2006. Choice of Conflict-Handling Strategy: A Matter of Context. The Journal of Psychology 140, 3 (2006), 269–288. https://doi.org/10.3200/JRLP.140.3.269-288",
      "doi": ""
    },
    {
      "text": "Youjin Choe, Martin Tomko, and Mohsen Kalantari. 2023. Assessing Mapper Conflict in OpenStreetMap Using the Delphi Survey Method. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (Hamburg, Germany) (CHI ’23). Association for Computing Machinery, New York, NY, USA, forthcoming. https://doi.org/10.1145/3544548.3580758",
      "doi": "10.1145/3544548.3580758"
    },
    {
      "text": "Madeline Ann Domino, Rosann Webb Collins, Alan R. Hevner, and Cynthia F. Cohen. 2003. Conflict in Collaborative Software Development. In Proceedings of the 2003 SIGMIS Conference on Computer Personnel Research: Freedom in Philadelphia–Leveraging Differences and Diversity in the IT Workforce (Philadelphia, Pennsylvania) (SIGMIS CPR ’03). Association for Computing Machinery, New York, NY, USA, 44–51.",
      "doi": "10.1145/761849.761856"
    },
    {
      "text": "Françoise Détienne, Michael Baker, Dominique Fréard, Flore Barcellini, Alexandre Denis, and Matthieu Quignard. 2016. The Descent of Pluto: Interactive dynamics, specialisation and reciprocity of roles in a Wikipedia debate. International Journal of Human-Computer Studies 86 (2016), 11–31. https://doi.org/10.1016/j.ijhcs.2015.09.002",
      "doi": "10.1016/j.ijhcs.2015.09.002"
    },
    {
      "text": "Anna Filippova and Hichang Cho. 2016. The Effects and Antecedents of Conflict in Free and Open Source Software Development. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 705–716. https://doi.org/10.1145/2818048.2820018",
      "doi": "10.1145/2818048.2820018"
    },
    {
      "text": "Marjaana Gunkel, Christopher Schlaegel, and Vas Taras. 2015. \"Cultural Values, Emotional Intelligence, and Conflict Handling Styles: A Global Study\". Academy of Management Proceedings 2015 (01 2015), 10708–10708. https://doi.org/10.5465/AMBPP.2015.10708abstract",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, R Stuart Geiger, Jonathan T Morgan, and John Riedl. 2013. The rise and decline of an open collaboration system: How Wikipedia’s reaction to popularity is causing its decline. American Behavioral Scientist 57, 5 (2013), 664–688.",
      "doi": ""
    },
    {
      "text": "Jay Hall. 1969. Conflict Management Survey: A Survey of One’s Characteristic Reaction To and Handling Of Conflicts between Himself and Others.Teleometrics Int’l., Houston, Texas, USA.",
      "doi": ""
    },
    {
      "text": "Vivianna Fang He, Phanish Puranam, Yash Raj Shrestha, and Georg von Krogh. 2020. Resolving governance disputes in communities: A study of software license decisions. Strategic Management Journal 41, 10 (2020), 1837–1868.",
      "doi": ""
    },
    {
      "text": "I. Richard Hoffman and Norman R. F. Maier. 1961. QUALITY AND ACCEPTANCE OF PROBLEM SOLUTIONS BY MEMBERS OF HOMOGENEOUS AND HETEROGENEOUS GROUPS. Journal of Abnormal and Social Psychology 62, 2 (March 1961), 401–407. https://search.ebscohost.com/login.aspx?direct=true&AuthType=sso&db=edo&AN=23775560&site=eds-live&scope=site&custid=s2775460",
      "doi": ""
    },
    {
      "text": "Wenjian Huang, Tun Lu, Haiyi Zhu, Guo Li, and Ning Gu. 2016. Effectiveness of Conflict Management Strategies in Peer Review Process of Online Collaboration Projects. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 717–728. https://doi.org/10.1145/2818048.2819950",
      "doi": "10.1145/2818048.2819950"
    },
    {
      "text": "Bernard Jacquemin, Aurélien Lauf, Céline Poudat, Martine Hurault-Plantet, and Nicolas Auray. 2008. Managing conflicts between users in Wikipedia. In CEUR Workshop Proceedings: Social Aspects of the Web 2008, Vol. 333. RWTH Aachen University, Innsbruck, Austria, 87–99.",
      "doi": ""
    },
    {
      "text": "Karen A. Jehn. 1997. A Qualitative Analysis of Conflict Types and Dimensions in Organizational Groups. Administrative Science Quarterly 42, 3 (1997), 530–557. https://doi.org/10.2307/2393737",
      "doi": ""
    },
    {
      "text": "Karen A. Jehn and Corinne Bendersky. 2003. Intragroup Conflict in Organizations: A Contingency Perspective on the Conflict-Outcome Relationship. Research in Organizational Behavior 25, s (2003), 187–242. https://doi.org/10.1016/S0191-3085(03)25005-X",
      "doi": ""
    },
    {
      "text": "Karen A. Jehn and Elizabeth A. Mannix. 2001. The Dynamic Nature of Conflict: A Longitudinal Study of Intragroup Conflict and Group Performance. Academy of Management Journal 44, 2 (April 2001), 238–251. https://doi.org/10.5465/3069453",
      "doi": ""
    },
    {
      "text": "Chris Jensen and Walt Scacchi. 2005. Collaboration, leadership, control, and conflict negotiation and the netbeans. org open source software development community. In Proceedings of the 38th Annual Hawaii International Conference on System Sciences. IEEE, Big Island, HI, USA, 196b–196b.",
      "doi": ""
    },
    {
      "text": "M. Zeeshan Jhandir, Ali Tenvir, Byung-Won On, Ingyu Lee, and Gyu Sang Choi. 2017. Controversy detection in Wikipedia using semantic dissimilarity. Information Sciences 418-419 (2017), 581–600. https://doi.org/10.1016/j.ins.2017.08.037",
      "doi": "10.1016/j.ins.2017.08.037"
    },
    {
      "text": "Gerald Kane, Jeremiah Johnson, and Ann Majchrzak. 2014. Emergent Lifecycle: The Tension Between Knowledge Change And Knowledge Retention In Open Online Co-production Communities 1. Management Science 60 (12 2014). https://doi.org/10.1287/mnsc.2013.1855",
      "doi": "10.1287/mnsc.2013.1855"
    },
    {
      "text": "A. Jehn Karen, Gregory B. Northcraft, and Margaret A. Neale. 1999. Why Differences Make a Difference: A Field Study of Diversity, Conflict, and Performance in Workgroups. Administrative Science Quarterly 44, 4 (Dec. 1999), 741–763. https://doi.org/10.2307/2667054",
      "doi": ""
    },
    {
      "text": "Marzieh Khazraie and Hossein Talebzadeh. 2020. “Wikipedia does NOT tolerate your babbling!”: Impoliteness-induced conflict (resolution) in a polylogal collaborative online community of practice. Journal of Pragmatics 163 (2020), 46–65. https://doi.org/10.1016/j.pragma.2020.03.009",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Bongwon Suh, Bryan A. Pendleton, and Ed H. Chi. 2007. He Says, She Says: Conflict and Coordination in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 453–462. https://doi.org/10.1145/1240624.1240698",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Helge Klapper and Markus Reitzig. 2018. On the effects of authority on peer motivation: Learning from Wikipedia. Strategic Management Journal 39, 8 (2018), 2178–2203. https://doi.org/10.1002/smj.2909",
      "doi": ""
    },
    {
      "text": "Travis Kriplean, Ivan Beschastnikh, David W. McDonald, and Scott A. Golder. 2007. Community, Consensus, Coercion, Control: Cs*w or How Policy Mediates Mass Participation. In Proceedings of the 2007 International ACM Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’07). Association for Computing Machinery, New York, NY, USA, 167–176. https://doi.org/10.1145/1316624.1316648",
      "doi": "10.1145/1316624.1316648"
    },
    {
      "text": "René König. 2013. Wikipedia: Between lay participation and elite knowledge representation. Information, Communication and Society 16, 2 (2013), 160–177. https://doi.org/10.1080/1369118X.2012.734319",
      "doi": ""
    },
    {
      "text": "Arto Lanamäki, Netta Iivari, Mikko Rajanen, and Henrik Hedberg. 2015. Battle over Media Choice: Multiplex Tensions in the Online Community of Wikipedia. In 23rd European Conference on Information Systems (ECIS)-2015 Completed Research Papers. European Research Center for Information Systems, Munster, Germany, 1–18.",
      "doi": ""
    },
    {
      "text": "C Landbeck. 2007. Trouble in Paradise: Conflict Management and Resolution in Social Classification Environments. ASIS&T Bulletin: Special Section: Folksonomies 34 (2007), 16–20.",
      "doi": ""
    },
    {
      "text": "Renee Li, Pavitthra Pandurangan, Hana Frluckaj, and Laura Dabbish. 2021. Code of conduct conversations in open source software projects on Github. Proceedings of the ACM on Human-computer Interaction 5, CSCW1(2021), 1–31.",
      "doi": "10.1145/3449093"
    },
    {
      "text": "Arwid Lund and Juhana Venäläinen. 2016. Monetary Materialities of Peer-Produced Knowledge: The Case of Wikipedia and Its Tensions with Paid Labour. TripleC (Cognition, Communication, Co-Operation): Open Access Journal for a Global Sustainable Information Society 14, 1 (2016), 78–98. https://doi.org/10.31269/triplec.v14i1.694",
      "doi": ""
    },
    {
      "text": "Maksymilian Marcinowski and Agnieszka Ławrynowicz. 2020. On Emotions in Conflict Wikipedia Talk Pages Discussions. In Web Engineering. ICWE 2020, Maria Bielikova, Tommi Mikkonen, and Cesare Pautasso (Eds.). Springer International Publishing, New York, NY, USA, 293–301.",
      "doi": "10.1007/978-3-030-50578-3_20"
    },
    {
      "text": "Joanne Meredith. 2019. Conversation analysis and online interaction. Research on Language and Social Interaction 52, 3 (2019), 241–256.",
      "doi": ""
    },
    {
      "text": "Jonathan T. Morgan and Anna Filippova. 2018. “Welcome” Changes? Descriptive and Injunctive Norms in a Wikipedia Sub-Community. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 52 (Nov. 2018), 26 pages. https://doi.org/10.1145/3274321",
      "doi": "10.1145/3274321"
    },
    {
      "text": "Pascal Neis and Alexander Zipf. 2012. Analyzing the Contributor Activity of a Volunteered Geographic Information Project – The Case of OpenStreetMap. ISPRS International Journal of Geo-Information 1, 2 (July 2012), 146–165. https://doi.org/10.3390/ijgi1020146",
      "doi": ""
    },
    {
      "text": "Anthony Oberschall. 1978. Theories of social conflict. Annual review of sociology 4 (1978), 291–315.",
      "doi": ""
    },
    {
      "text": "OpenStreetMap. 2021. Good changeset comments. Retrieved February 02, 2022 from https://wiki.openstreetmap.org/wiki/Good_changeset_comments",
      "doi": ""
    },
    {
      "text": "Kim Osman. 2013. The Role of Conflict in Determining Consensus on Quality in Wikipedia Articles. In Proceedings of the 9th International Symposium on Open Collaboration (Hong Kong, China) (WikiSym ’13). Association for Computing Machinery, New York, NY, USA, Article Article 12, 6 pages.",
      "doi": "10.1145/2491055.2491067"
    },
    {
      "text": "Gordon Pask. 1976. Conversation theory : applications in education and epistemology. Elsevier, Amsterdam ; New York. http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.119.9872&rep=rep1&type=pdf",
      "doi": ""
    },
    {
      "text": "Roel Popping. 2000. Computer-assisted text analysis. SAGE, Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Dean G Pruitt. 1983. Strategic choice in negotiation. American Behavioral Scientist 27, 2 (1983), 167–194.",
      "doi": ""
    },
    {
      "text": "Afzalur M. Rahim. 2002. Toward a Theory of Managing Organizational Conflict. International Journal of Conflict Management 13, 3(2002), 206–235. https://doi.org/10.2139/ssrn.437684",
      "doi": ""
    },
    {
      "text": "Afzalur M. Rahim and Thomas V. Bonoma. 1979. Managing Organizational Conflict: A Model for Diagnosis and Intervention. Psychological Reports 44, 3_suppl (1979), 1323–1344. https://doi.org/10.2466/pr0.1979.44.3c.1323",
      "doi": ""
    },
    {
      "text": "Ruqin Ren and Bei Yan. 2017. Crowd Diversity and Performance in Wikipedia: The Mediating Effects of Task Conflict and Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6342–6351. https://doi.org/10.1145/3025453.3025992",
      "doi": "10.1145/3025453.3025992"
    },
    {
      "text": "Csilla Rudas and János Török. 2018. Modeling the Wikipedia to Understand the Dynamics of Long Disputes and Biased Articles. Historical Social Research / Historische Sozialforschung 43, 1 (163)(2018), 72. https://search.ebscohost.com/login.aspx?direct=true&AuthType=sso&db=edsjsr&AN=edsjsr.26395045&site=eds-live&scope=site&custid=s2775460",
      "doi": ""
    },
    {
      "text": "Orest Semotiuk. 2003. Computer based content analysis: main goals, applications, advantages and disadvantages. In The Experience of Designing and Application of CAD Systems in Microelectronics, 2003. Proceedings of the 7th International Conference (Slavske, Ukraine) (CADSM 2003). IEEE, Piscataway, NJ, USA, 521 – 522.",
      "doi": ""
    },
    {
      "text": "Almut Sichler and Elizabeth Prommer. 2014. Gender differences within the German-language Wikipedia. ESSACHESS–Journal for Communication Studies 7, 2 (14)(2014), 77–93.",
      "doi": ""
    },
    {
      "text": "Nathan TeBlunthuis, Aaron Shaw, and Benjamin Mako Hill. 2018. Revisiting \"The Rise and Decline\" in a Population of Peer Production Projects. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3173574.3173929",
      "doi": "10.1145/3173574.3173929"
    },
    {
      "text": "Kenneth W Thomas. 1974. Thomas-Kilmann Conflict Mode Instrument. Xicom Inc., Tuxedo, NY, USA.",
      "doi": ""
    },
    {
      "text": "Kenneth W Thomas and Ralph H Kilmann. 1978. Comparison of four instruments measuring conflict behavior. Psychological reports 42(1978), 1139–1145.",
      "doi": ""
    },
    {
      "text": "W. Ben Towne, Aniket Kittur, Peter Kinnaird, and James Herbsleb. 2013. Your Process is Showing: Controversy Management and Perceived Quality in Wikipedia. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1059–1068. https://doi.org/10.1145/2441776.2441896",
      "doi": "10.1145/2441776.2441896"
    },
    {
      "text": "Quy Thy Truong, Guillaume Touya, and Cyril de Runz. 2018. Towards vandalism detection in OpenStreetMap through a data driven approach. In GIScience 2018. 10th International Conference on Geographic Information Science. Dagstuhl Publishing, Saarbrücken, Germany, 61:1–61:7.",
      "doi": ""
    },
    {
      "text": "Quy Thy Truong, Guillaume Touya, and Cyril de Runz. 2020. OSMWatchman: Learning How to Detect Vandalized Contributions in OSM Using a Random Forest Classifier. ISPRS International Journal of Geo-Information 9, 9(2020), 504.",
      "doi": ""
    },
    {
      "text": "János Török, Gerardo Iñiguez, Taha Yasseri, Maxi Miguel, Kimmo Kaski, and János Kertész. 2013. Opinions, Conflicts, and Consensus: Modeling Social Dynamics in a Collaborative Environment. Physical review letters 110 (2013), 088701. https://doi.org/10.1103/PhysRevLett.110.088701",
      "doi": ""
    },
    {
      "text": "James A. Wall and Ronda Roberts Callister. 1995. Conflict and Its Management. Journal of Management 21, 3 (1995), 515–558. https://doi.org/10.1177/014920639502100306",
      "doi": ""
    },
    {
      "text": "Jing Wang, Patrick C. Shih, and John M. Carroll. 2015. Revisiting Linus’s law: Benefits and challenges of open source software peer review. International Journal of Human-Computer Studies 77 (2015), 52–65. https://doi.org/10.1016/j.ijhcs.2015.01.005",
      "doi": "10.1016/j.ijhcs.2015.01.005"
    },
    {
      "text": "Serge Wroclawski. 2014. Introducing Changeset Discussions. Retrieved June 9, 2022 from https://blog.openstreetmap.org/2014/11/02/introducing-changeset-discussions/",
      "doi": ""
    },
    {
      "text": "Kewen Wu, Yuxiang Zhao, Julita Vassileva, Xiaoling Sun, and Zhe Fan. 2014. How Does Awareness of Task Conflict motivate Wiki-Based Collaborative Learning? A Design Science Approach. In The 18th Pacific Asia Conference on Information Systems (PACIS 2014 (Chengdu, China). Association for Information Systems, Atlanta, GA, USA, 261.",
      "doi": ""
    },
    {
      "text": "Pujan Ziaie and Medin Imamovic. 2013. Lifecycle-based evolution of features in collaborative open production communities: the case of Wikipedia. In 21st European Conference on Information Systems(Proceedings of the 21st European Conference on Information Systems). European Research Center for Information Systems, Munster, Germany, 1–12.",
      "doi": ""
    }
  ]
}