{
  "doi": "10.1145/3544548.3581131",
  "title": "Competent but Rigid: Identifying the Gap in Empowering AI to Participate Equally in Group Decision-Making",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Existing research on human-AI collaborative decision-making focuses mainly on the interaction between AI and individual decision-makers. There is a limited understanding of how AI may perform in group decision-making. This paper presents a wizard-of-oz study in which two participants and an AI form a committee to rank three English essays. One novelty of our study is that we adopt a speculative design by endowing AI equal power to humans in group decision-making. We enable the AI to discuss and vote equally with other human members. We find that although the voice of AI is considered valuable, AI still plays a secondary role in the group because it cannot fully follow the dynamics of the discussion and make progressive contributions. Moreover, the divergent opinions of our participants regarding an “equal AI” shed light on the possible future of human-AI relations.",
  "tags": [
    "automated essay grading",
    "human-AI collaboration",
    "qualitative study",
    "group decision-making"
  ],
  "authors": [
    {
      "name": "Chengbo Zheng",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237913",
      "orcid": "0000-0003-0226-9399"
    },
    {
      "name": "Yuheng Wu",
      "institution": "Chinese University of Hong Kong, Shenzhen, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781135",
      "orcid": "0000-0001-8473-0999"
    },
    {
      "name": "Chuhan Shi",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659547865",
      "orcid": "0000-0002-3370-1626"
    },
    {
      "name": "Shuai Ma",
      "institution": "The Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239312",
      "orcid": "0000-0002-7658-292X"
    },
    {
      "name": "Jiehui Luo",
      "institution": "Hong Kong University of Science and Technology, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782252",
      "orcid": "0000-0002-1394-4348"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    }
  ],
  "references": [
    {
      "text": "Ali Alkhatib. 2021. To live in their utopia: Why algorithmic systems create absurd outcomes. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3411764.3445740"
    },
    {
      "text": "Ali Alkhatib and Michael Bernstein. 2019. Street-level algorithms: A theory at the gaps between policy and decisions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300760"
    },
    {
      "text": "Daniel Balliet, Junhui Wu, and Carsten KW De Dreu. 2014. Ingroup favoritism in cooperation: a meta-analysis.Psychological bulletin 140, 6 (2014), 1556.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Eric Horvitz, and Daniel S Weld. 2021. Is the most accurate ai the best teammate? optimizing ai for teamwork. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 35. 11405–11414.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Tongshuang Wu, Joyce Zhou, Raymond Fok, Besmira Nushi, Ece Kamar, Marco Tulio Ribeiro, and Daniel Weld. 2021. Does the whole exceed its parts? the effect of ai explanations on complementary team performance. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445717"
    },
    {
      "text": "BBC. 2014. Algorithm appointed board director. Retrieved November 21, 2022 from https://www.bbc.com/news/technology-27426942",
      "doi": ""
    },
    {
      "text": "Bloomberg. 2016. Tieto the First Nordic Company to Appoint Artificial Intelligence to the Leadership Team of the New Data-Driven Businesses Unit. Retrieved November 21, 2022 from https://www.bloomberg.com/press-releases/2016-10-17/tieto-the-first-nordic-company-to-appoint-artificial-intelligence-to-the-leadership-team-of-the-new-data-driven-businesses-unit",
      "doi": ""
    },
    {
      "text": "Rod Bond. 2005. Group size and conformity. Group processes & intergroup relations 8, 4 (2005), 331–354.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Zana Buçinca, Phoebe Lin, Krzysztof Z Gajos, and Elena L Glassman. 2020. Proxy tasks and subjective measures can be misleading in evaluating explainable AI systems. In Proceedings of the 25th international conference on intelligent user interfaces. 454–464.",
      "doi": "10.1145/3377325.3377498"
    },
    {
      "text": "Zana Buçinca, Maja Barbara Malaya, and Krzysztof Z Gajos. 2021. To trust or to think: cognitive forcing functions can reduce overreliance on AI in AI-assisted decision-making. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–21.",
      "doi": "10.1145/3449287"
    },
    {
      "text": "Carrie J Cai, Emily Reif, Narayan Hegde, Jason Hipp, Been Kim, Daniel Smilkov, Martin Wattenberg, Fernanda Viegas, Greg S Corrado, Martin C Stumpe, 2019. Human-centered tools for coping with imperfect algorithms during medical decision-making. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3290605.3300234"
    },
    {
      "text": "Hao-Fei Cheng, Logan Stapleton, Anna Kawakami, Venkatesh Sivaraman, Yanghuidi Cheng, Diana Qing, Adam Perer, Kenneth Holstein, Zhiwei Steven Wu, and Haiyi Zhu. 2022. How Child Welfare Workers Reduce Racial Disparities in Algorithmic Decisions. In CHI Conference on Human Factors in Computing Systems. 1–22.",
      "doi": ""
    },
    {
      "text": "Jared R Curhan, Jennifer R Overbeck, Yeri Cho, Teng Zhang, and Yu Yang. 2022. Silence is golden: Extended silence, deliberative mindset, and value creation in negotiation.Journal of applied psychology 107, 1 (2022), 78.",
      "doi": ""
    },
    {
      "text": "Gerardine DeSanctis and R Brent Gallupe. 1987. A foundation for the study of group decision support systems. Management science 33, 5 (1987), 589–609.",
      "doi": ""
    },
    {
      "text": "Berkeley J Dietvorst, Joseph P Simmons, and Cade Massey. 2015. Algorithm aversion: people erroneously avoid algorithms after seeing them err.Journal of Experimental Psychology: General 144, 1 (2015), 114.",
      "doi": ""
    },
    {
      "text": "Upol Ehsan, Q Vera Liao, Michael Muller, Mark O Riedl, and Justin D Weisz. 2021. Expanding explainability: Towards social transparency in ai systems. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445188"
    },
    {
      "text": "Muzaffer Eroğlu and Meltem Karatepe Kaya. 2022. Impact of Artificial Intelligence on Corporate Board Diversity Policies and Regulations. European Business Organization Law Review(2022), 1–32.",
      "doi": ""
    },
    {
      "text": "Shelly Farnham, Harry R Chesley, Debbie E McGhee, Reena Kawal, and Jennifer Landau. 2000. Structured online interactions: improving the decision-making of small discussion groups. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. 299–308.",
      "doi": "10.1145/358916.359001"
    },
    {
      "text": "Lori L. Foster and Michael D. Coovert. 2000. \"Intelligent\" Team Decision Making. In CHI ’00 Extended Abstracts on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI EA ’00). Association for Computing Machinery, New York, NY, USA, 153–154. https://doi.org/10.1145/633292.633378",
      "doi": "10.1145/633292.633378"
    },
    {
      "text": "Alex Graves, Abdel-rahman Mohamed, and Geoffrey Hinton. 2013. Speech recognition with deep recurrent neural networks. In 2013 IEEE international conference on acoustics, speech and signal processing. Ieee, 6645–6649.",
      "doi": ""
    },
    {
      "text": "Greg Guest, Kathleen M MacQueen, and Emily E Namey. 2011. Applied thematic analysis. sage publications.",
      "doi": ""
    },
    {
      "text": "Riccardo Guidotti, Anna Monreale, Salvatore Ruggieri, Franco Turini, Fosca Giannotti, and Dino Pedreschi. 2018. A Survey of Methods for Explaining Black Box Models. ACM Comput. Surv. 51, 5, Article 93 (aug 2018), 42 pages. https://doi.org/10.1145/3236009",
      "doi": "10.1145/3236009"
    },
    {
      "text": "Torben Hagerup, Kurt Mehlhorn, and J. Ian Munro. 1993. Maintaining Discrete Probability Distributions Optimally. In Proceedings of the 20th International Colloquium on Automata, Languages and Programming(Lecture Notes in Computer Science, Vol. 700). Springer-Verlag, Berlin, 253–264.",
      "doi": "10.5555/646247.685022"
    },
    {
      "text": "Nichole Harvey and Colin A Holmes. 2012. Nominal group technique: an effective method for obtaining group consensus. International journal of nursing practice 18, 2 (2012), 188–194.",
      "doi": ""
    },
    {
      "text": "Nicholas Hertz and Eva Wiese. 2018. Under pressure: Examining social conformity with computer and robot groups. Human factors 60, 8 (2018), 1207–1218.",
      "doi": ""
    },
    {
      "text": "Michael Hilb. 2020. Toward artificial governance? The role of artificial intelligence in shaping the future of corporate governance. Journal of Management and Governance 24, 4 (2020), 851–870.",
      "doi": ""
    },
    {
      "text": "James L Hilton and William Von Hippel. 1996. Stereotypes. Annual review of psychology 47, 1 (1996), 237–271.",
      "doi": ""
    },
    {
      "text": "Randy Y Hirokawa and Marshall Scott Poole. 1996. Communication and group decision making. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Jess Hohenstein, Lindsay E Larson, Yoyo Tsung-Yu Hou, Alexa M Harris, Aaron Schecter, Leslie Dechurch, Noshir Contractor, and Malte F Jung. 2022. Vero: A Method for Remotely Studying Human-AI Collaboration. Proceedings of the 55th Hawaii International Conference on System Sciences (2022).",
      "doi": ""
    },
    {
      "text": "Sungsoo Hong, Minhyang Suh, Nathalie Henry Riche, Jooyoung Lee, Juho Kim, and Mark Zachry. 2018. Collaborative dynamic queries: Supporting distributed small group decision-making. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173640"
    },
    {
      "text": "Silas Hsu, Tiffany Wenting Li, Zhilin Zhang, Max Fowler, Craig Zilles, and Karrie Karahalios. 2021. Attitudes surrounding an imperfect AI autograder. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445424"
    },
    {
      "text": "Floyd Hunter. 2017. Community power structure: A study of decision makers. UNC Press Books.",
      "doi": ""
    },
    {
      "text": "John M Ivancevich, Michael T Matteson, and Robert Konopaske. 1990. Organizational behavior and management. (1990).",
      "doi": ""
    },
    {
      "text": "Holtzblatt Karen and Jones Sandra. 2017. Contextual inquiry: A participatory technique for system design. In Participatory design. CRC Press, 177–210.",
      "doi": ""
    },
    {
      "text": "Anna Kawakami, Venkatesh Sivaraman, Hao-Fei Cheng, Logan Stapleton, Yanghuidi Cheng, Diana Qing, Adam Perer, Zhiwei Steven Wu, Haiyi Zhu, and Kenneth Holstein. 2022. Improving Human-AI Partnerships in Child Welfare: Understanding Worker Practices, Challenges, and Desires for Algorithmic Decision Support. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3491102.3517439"
    },
    {
      "text": "Pranav Khadpe, Chinmay Kulkarni, and Geoff Kaufman. 2022. Empathosphere: Promoting Constructive Communication in Ad-Hoc Virtual Teams through Perspective-Taking Spaces. Proc. ACM Hum.-Comput. Interact. 6, CSCW1, Article 55 (apr 2022), 26 pages. https://doi.org/10.1145/3512902",
      "doi": "10.1145/3512902"
    },
    {
      "text": "Saif Khairat, David Marc, William Crosby, Ali Al Sanousi, 2018. Reasons for physicians not adopting clinical decision support systems: critical analysis. JMIR medical informatics 6, 2 (2018), e8912.",
      "doi": ""
    },
    {
      "text": "Eugene C Kim. 2007. YouTube: Testing the safe harbors of digital copyright law. S. Cal. Interdisc. LJ 17(2007), 139.",
      "doi": ""
    },
    {
      "text": "Soomin Kim, Jinsu Eun, Changhoon Oh, Bongwon Suh, and Joonhwan Lee. 2020. Bot in the bunch: Facilitating group chat discussion by improving efficiency and participation with a chatbot. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376785"
    },
    {
      "text": "Soomin Kim, Jinsu Eun, Joseph Seering, and Joonhwan Lee. 2021. Moderator Chatbot for Deliberative Discussion: Effects of Discussion Structure and Discussant Facilitation. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 87 (apr 2021), 26 pages. https://doi.org/10.1145/3449161",
      "doi": "10.1145/3449161"
    },
    {
      "text": "Jon Kleinberg, Himabindu Lakkaraju, Jure Leskovec, Jens Ludwig, and Sendhil Mullainathan. 2018. Human decisions and machine predictions. The quarterly journal of economics 133, 1 (2018), 237–293.",
      "doi": ""
    },
    {
      "text": "Rahul Kumar, Sandeep Mathias, Sriparna Saha, and Pushpak Bhattacharyya. 2022. Many Hands Make Light Work: Using Essay Traits to Automatically Score Essays. In Proceedings of the 2022 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Seattle, United States, 1485–1495. https://doi.org/10.18653/v1/2022.naacl-main.106",
      "doi": ""
    },
    {
      "text": "Sandeep Kaur Kuttal, Bali Ong, Kate Kwasny, and Peter Robe. 2021. Trade-offs for substituting a human with an agent in a pair programming context: the good, the bad, and the ugly. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–20.",
      "doi": "10.1145/3411764.3445659"
    },
    {
      "text": "Vivian Lai, Samuel Carton, Rajat Bhatnagar, Q Vera Liao, Yunfeng Zhang, and Chenhao Tan. 2022. Human-AI Collaboration via Conditional Delegation: A Case Study of Content Moderation. In CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3491102.3501999"
    },
    {
      "text": "Vivian Lai, Chacha Chen, Q Vera Liao, Alison Smith-Renner, and Chenhao Tan. 2021. Towards a science of human-ai decision making: a survey of empirical studies. arXiv preprint arXiv:2112.11471(2021).",
      "doi": ""
    },
    {
      "text": "Vivian Lai, Han Liu, and Chenhao Tan. 2020. \" Why is’ Chicago’deceptive?\" Towards Building Model-Driven Tutorials for Humans. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376873"
    },
    {
      "text": "Vivian Lai and Chenhao Tan. 2019. On human predictions with explanations and predictions of machine learning models: A case study on deception detection. In Proceedings of the conference on fairness, accountability, and transparency. 29–38.",
      "doi": "10.1145/3287560.3287590"
    },
    {
      "text": "Balaji Lakshminarayanan, Alexander Pritzel, and Charles Blundell. 2017. Simple and scalable predictive uncertainty estimation using deep ensembles. Advances in neural information processing systems 30 (2017).",
      "doi": ""
    },
    {
      "text": "Markus Langer, Tim Hunsicker, Tina Feldkamp, Cornelius J König, and Nina Grgić-Hlača. 2022. “Look! It’sa Computer Program! It’s an Algorithm! It’s AI!”: Does Terminology Affect Human Perceptions and Evaluations of Algorithmic Decision-Making Systems?. In CHI Conference on Human Factors in Computing Systems. 1–28.",
      "doi": "10.1145/3491102.3517527"
    },
    {
      "text": "Ariel Levy, Monica Agrawal, Arvind Satyanarayan, and David Sontag. 2021. Assessing the impact of automated suggestions on decision making: Domain experts mediate model errors but take less initiative. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3411764.3445522"
    },
    {
      "text": "Jinyu Li 2022. Recent advances in end-to-end automatic speech recognition. APSIPA Transactions on Signal and Information Processing 11, 1(2022).",
      "doi": ""
    },
    {
      "text": "Q Vera Liao, Daniel Gruen, and Sarah Miller. 2020. Questioning the AI: informing design practices for explainable AI user experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376590"
    },
    {
      "text": "Q Vera Liao and Kush R Varshney. 2021. Human-centered explainable ai (xai): From algorithms to user experiences. arXiv preprint arXiv:2110.10790(2021).",
      "doi": ""
    },
    {
      "text": "Robert C Liden, Sandy J Wayne, Renata A Jaworski, and Nathan Bennett. 2004. Social loafing: A field investigation. Journal of management 30, 2 (2004), 285–304.",
      "doi": ""
    },
    {
      "text": "Harold A Linstone, Murray Turoff, 1975. The delphi method. Addison-Wesley Reading, MA.",
      "doi": ""
    },
    {
      "text": "Duri Long and Brian Magerko. 2020. What is AI literacy? Competencies and design considerations. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–16.",
      "doi": "10.1145/3313831.3376727"
    },
    {
      "text": "Scott M Lundberg and Su-In Lee. 2017. A Unified Approach to Interpreting Model Predictions. In Advances in Neural Information Processing Systems 30, I. Guyon, U. V. Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett (Eds.). Curran Associates, Inc., 4765–4774. http://papers.nips.cc/paper/7062-a-unified-approach-to-interpreting-model-predictions.pdf",
      "doi": ""
    },
    {
      "text": "Scott M Lundberg, Bala Nair, Monica S Vavilala, Mayumi Horibe, Michael J Eisses, Trevor Adams, David E Liston, Daniel King-Wai Low, Shu-Fang Newman, Jerry Kim, 2018. Explainable machine-learning predictions for the prevention of hypoxaemia during surgery. Nature biomedical engineering 2, 10 (2018), 749–760.",
      "doi": ""
    },
    {
      "text": "Shuai Ma, Mingfei Sun, and Xiaojuan Ma. 2022. Modeling Adaptive Expression of Robot Learning Engagement and Exploring its Effects on Human Teachers. ACM Transactions on Computer-Human Interaction (2022).",
      "doi": ""
    },
    {
      "text": "Shuai Ma, Zijun Wei, Feng Tian, Xiangmin Fan, Jianming Zhang, Xiaohui Shen, Zhe Lin, Jin Huang, Radomír Měch, Dimitris Samaras, 2019. SmartEye: assisting instant photo taking via integrating user preference with deep view proposal network. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300701"
    },
    {
      "text": "Shuai Ma, Taichang Zhou, Fei Nie, and Xiaojuan Ma. 2022. Glancee: An adaptable system for instructors to grasp student learning status in synchronous online classes. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. 1–25.",
      "doi": "10.1145/3491102.3517482"
    },
    {
      "text": "Karthik Mahadevan, Mauricio Sousa, Anthony Tang, and Tovi Grossman. 2021. “Grip-That-There”: An Investigation of Explicit and Implicit Task Allocation Techniques for Human-Robot Collaboration. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 215, 14 pages. https://doi.org/10.1145/3411764.3445355",
      "doi": "10.1145/3411764.3445355"
    },
    {
      "text": "Yaoli Mao, Dakuo Wang, Michael Muller, Kush R Varshney, Ioana Baldini, Casey Dugan, and Aleksandra Mojsilović. 2019. How data scientistswork together with domain experts in scientific collaborations: To find the right answer or to ask the right question?Proceedings of the ACM on Human-Computer Interaction 3, GROUP(2019), 1–23.",
      "doi": ""
    },
    {
      "text": "Andrew Monk. 2003. Common ground in electronically mediated communication: Clark’s theory of language use. HCI models, theories, and frameworks: Toward a multidisciplinary science (2003), 265–289.",
      "doi": ""
    },
    {
      "text": "Yi Mou and Kun Xu. 2017. The media inequality: Comparing the initial human-human and human-AI social interactions. Computers in Human Behavior 72 (2017), 432–440.",
      "doi": "10.1016/j.chb.2017.02.067"
    },
    {
      "text": "Dena F Mujtaba and Nihar R Mahapatra. 2019. Ethical considerations in AI-based recruitment. In 2019 IEEE International Symposium on Technology and Society (ISTAS). IEEE, 1–7.",
      "doi": ""
    },
    {
      "text": "Michael J Muller and Sarah Kuhn. 1993. Participatory design. Commun. ACM 36, 6 (1993), 24–28.",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Mahsan Nourani, Joanie King, and Eric Ragan. 2020. The role of domain expertise in user trust and the impact of first impressions with intelligent systems. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing, Vol. 8. 112–121.",
      "doi": ""
    },
    {
      "text": "Yaniv Ovadia, Emily Fertig, Jie Ren, Zachary Nado, David Sculley, Sebastian Nowozin, Joshua Dillon, Balaji Lakshminarayanan, and Jasper Snoek. 2019. Can you trust your model’s uncertainty? evaluating predictive uncertainty under dataset shift. Advances in neural information processing systems 32 (2019).",
      "doi": ""
    },
    {
      "text": "Zhenhui Peng, Yunhwan Kwon, Jiaan Lu, Ziming Wu, and Xiaojuan Ma. 2019. Design and Evaluation of Service Robot’s Proactivity in Decision-Making Support Process. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300328",
      "doi": "10.1145/3290605.3300328"
    },
    {
      "text": "Martin Petrin. 2019. Corporate Management in the Age of AI. Colum. Bus. L. Rev. (2019), 965.",
      "doi": ""
    },
    {
      "text": "James Pierce. 2021. In tension with progression: Grasping the frictional tendencies of speculative, critical, and other alternative designs. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445406"
    },
    {
      "text": "Margaret Potter, Sandy Gordon, and Peter Hamer. 2004. The nominal group technique: a useful consensus methodology in physiotherapy research. NZ Journal of Physiotherapy 32, 3 (2004), 126–130.",
      "doi": ""
    },
    {
      "text": "Laurel D Riek. 2012. Wizard of oz studies in hri: a systematic review and new reporting guidelines. Journal of Human-Robot Interaction 1, 1 (2012), 119–136.",
      "doi": "10.5898/JHRI.1.1.Riek"
    },
    {
      "text": "Peter Robe and Sandeep Kaur Kuttal. 2022. Designing PairBuddy—A Conversational Agent for Pair Programming. ACM Transactions on Computer-Human Interaction (TOCHI) 29, 4(2022), 1–44.",
      "doi": "10.1145/3498326"
    },
    {
      "text": "Paul Robinette, Wenchen Li, Robert Allen, Ayanna M. Howard, and Alan R. Wagner. 2016. Overtrust of Robots in Emergency Evacuation Scenarios. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction (Christchurch, New Zealand) (HRI ’16). IEEE Press, 101–108.",
      "doi": ""
    },
    {
      "text": "Thomas L Saaty and Kirti Peniwati. 2013. Group decision making: drawing out and reconciling differences. RWS publications.",
      "doi": ""
    },
    {
      "text": "Eduardo Salas, Rebecca Grossman, Ashley M Hughes, and Chris W Coultas. 2015. Measuring team cohesion: Observations from the science. Human factors 57, 3 (2015), 365–374.",
      "doi": ""
    },
    {
      "text": "William Samuelson and Richard Zeckhauser. 1988. Status quo bias in decision making. Journal of risk and uncertainty 1, 1 (1988), 7–59.",
      "doi": ""
    },
    {
      "text": "Victor Sanh, Lysandre Debut, Julien Chaumond, and Thomas Wolf. 2019. DistilBERT, a distilled version of BERT: smaller, faster, cheaper and lighter. arXiv preprint arXiv:1910.01108(2019).",
      "doi": ""
    },
    {
      "text": "Beau G Schelble, Christopher Flathmann, Nathan J McNeese, Guo Freeman, and Rohit Mallick. 2022. Let’s Think Together! Assessing Shared Mental Models, Performance, and Trust in Human-Agent Teams. Proceedings of the ACM on Human-Computer Interaction 6, GROUP(2022), 1–29.",
      "doi": "10.1145/3492832"
    },
    {
      "text": "Ameneh Shamekhi, Q Vera Liao, Dakuo Wang, Rachel KE Bellamy, and Thomas Erickson. 2018. Face value? Exploring the effects of embodiment for a group facilitation agent. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173965"
    },
    {
      "text": "Chuhan Shi, Fei Nie, Yicheng Hu, Yige Xu, Lei Chen, Xiaojuan Ma, and Qiong Luo. 2022. MedChemLens: An Interactive Visual Tool to Support Direction Selection in Interdisciplinary Experimental Research of Medicinal Chemistry. IEEE Transactions on Visualization and Computer Graphics 29, 1(2022), 63–73.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2022. Human-Centered AI. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Kaveh Taghipour and Hwee Tou Ng. 2016. A neural approach to automated essay scoring. In Proceedings of the 2016 conference on empirical methods in natural language processing. 1882–1891.",
      "doi": ""
    },
    {
      "text": "Anna Trunk, Hendrik Birkel, and Evi Hartmann. 2020. On the current state of combining human and artificial intelligence for strategic organizational decision making. Business Research 13, 3 (2020), 875–919.",
      "doi": ""
    },
    {
      "text": "Patrick Van Esch, J Stewart Black, and Joseph Ferolie. 2019. Marketing AI recruitment: The next phase in job application and selection. Computers in Human Behavior 90 (2019), 215–222.",
      "doi": ""
    },
    {
      "text": "April Yi Wang, Dakuo Wang, Jaimie Drozdal, Michael Muller, Soya Park, Justin D Weisz, Xuye Liu, Lingfei Wu, and Casey Dugan. 2022. Documentation Matters: Human-Centered AI System to Assist Data Science Code Documentation in Computational Notebooks. ACM Transactions on Computer-Human Interaction 29, 2(2022), 1–33.",
      "doi": "10.1145/3489465"
    },
    {
      "text": "Dakuo Wang, Josh Andres, Justin D Weisz, Erick Oduor, and Casey Dugan. 2021. Autods: Towards human-centered automation of data science. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445526"
    },
    {
      "text": "Dakuo Wang, Liuping Wang, Zhan Zhang, Ding Wang, Haiyi Zhu, Yvonne Gao, Xiangmin Fan, and Feng Tian. 2021. “Brilliant AI Doctor” in Rural Clinics: Challenges in AI-Powered Clinical Decision Support System Deployment. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3411764.3445432"
    },
    {
      "text": "Ruotong Wang, F Maxwell Harper, and Haiyi Zhu. 2020. Factors influencing perceived fairness in algorithmic decision-making: Algorithm outcomes, development procedures, and individual differences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376813"
    },
    {
      "text": "Rina R Wehbe, Edward Lank, and Lennart E Nacke. 2017. Left them 4 dead: Perception of humans versus non-player character teammates in cooperative gameplay. In Proceedings of the 2017 Conference on Designing Interactive Systems. 403–415.",
      "doi": "10.1145/3064663.3064712"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, and John Zimmerman. 2019. Unremarkable AI: Fitting Intelligent Decision Support into Critical, Clinical Decision-Making Processes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300468",
      "doi": "10.1145/3290605.3300468"
    },
    {
      "text": "Yunfeng Zhang, Q Vera Liao, and Rachel KE Bellamy. 2020. Effect of confidence and explanation on accuracy and trust calibration in AI-assisted decision making. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. 295–305.",
      "doi": "10.1145/3351095.3372852"
    },
    {
      "text": "Ran Zhao, Alexandros Papangelis, and Justine Cassell. 2014. Towards a dyadic computational model of rapport management for human-virtual agent interaction. In International conference on intelligent virtual agents. Springer, 514–527.",
      "doi": ""
    },
    {
      "text": "Chengbo Zheng, Dakuo Wang, April Yi Wang, and Xiaojuan Ma. 2022. Telling Stories from Computational Notebooks: AI-Assisted Presentation Slides Creation for Presenting Data Science Work. In CHI Conference on Human Factors in Computing Systems. 1–20.",
      "doi": "10.1145/3491102.3517615"
    }
  ]
}