{
  "doi": "10.1145/3544548.3580973",
  "title": "Never Skip Leg Day Again: Training the Lower Body with Vertical Jumps in a Virtual Reality Exergame",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Virtual Reality (VR) exergames can increase engagement in and motivation for physical activities. Most VR exergames focus on the upper body because many VR setups only track the users’ heads and hands. To become a serious alternative to existing exercise programs, VR exergames must provide a balanced workout and train the lower limbs, too. To address this issue, we built a VR exergame focused on vertical jump training to explore full-body exercise applications. To create a safe and effective training, nine domain experts participated in our prototype design. Our mixed-methods study confirms that the jump-centered exercises provided a worthy challenge and positive player experience, indicating long-term retention. Based on our findings, we present five design implications to guide future work: avoid an unintended forward drift, consider technical constraints, address safety concerns in full-body VR exergames, incorporate rhythmic elements with fluent movement patterns, adapt difficulty to players’ fitness progression status.",
  "authors": [
    {
      "name": "Sebastian Cmentowski",
      "institution": "COVIDAG, University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210449",
      "orcid": "0000-0003-4555-6187"
    },
    {
      "name": "Sukran Karaosmanoglu",
      "institution": "Human-Computer Interaction, Universität Hamburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659466914",
      "orcid": "0000-0002-9624-4258"
    },
    {
      "name": "Lennart E. Nacke",
      "institution": "HCI Games Group, Games Institute, University of Waterloo, Canada and Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/do/10.1145/contrib-81392605076/rel-imgonly/len-acm.png",
      "acmid": "81392605076",
      "orcid": "0000-0003-4290-8829"
    },
    {
      "name": "Frank Steinicke",
      "institution": "Human-Computer Interaction, Universität Hamburg, Germany",
      "img": "/do/10.1145/contrib-81313483772/rel-imgonly/steinicke-sit2-sm.jpg",
      "acmid": "81313483772",
      "orcid": "0000-0001-9879-7414"
    },
    {
      "name": "Jens Harald Krüger",
      "institution": "COVIDAG, University of Duisburg-Essen, Germany and School of Computing, University of Utah, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503661713",
      "orcid": "0000-0002-9197-0613"
    }
  ],
  "references": [
    {
      "text": "Vero Vanden Abeele, Katta Spiel, Lennart Nacke, Daniel Johnson, and Kathrin Gerling. 2020. Development and validation of the player experience inventory: A scale to measure player experiences at the level of functional and psychosocial consequences. International Journal of Human-Computer Studies 135 (2020), 102370. https://doi.org/10.1016/j.ijhcs.2019.102370",
      "doi": "10.1016/j.ijhcs.2019.102370"
    },
    {
      "text": "Kent Adams, John P O’Shea, Katie L O’Shea, and Mike Climstein. 1992. The effect of six weeks of squat, plyometric and squat-plyometric training on power production. Journal of applied sport science research 6, 1 (1992), 36–41.",
      "doi": ""
    },
    {
      "text": "Ali Al-Khalifah, Rachel McCrindle, Paul Sharkey, and Vassil Alexandrov. 2006. Using virtual reality for medical diagnosis, training and education. International Journal on Disability and Human Development 5, 2(2006), 187–194.",
      "doi": ""
    },
    {
      "text": "Iannis Albert, Nicole Burkard, Dirk Queck, and Marc Herrlich. 2022. The Effect of Auditory-Motor Synchronization in Exergames on the Example of the VR Rhythm Game BeatSaber. Proc. ACM Hum.-Comput. Interact. 6, CHI PLAY, Article 253 (oct 2022), 26 pages. https://doi.org/10.1145/3549516",
      "doi": "10.1145/3549516"
    },
    {
      "text": "Kenneth Anderson and David G Behm. 2005. The impact of instability resistance training on balance and stability. Sports medicine 35, 1 (2005), 43–53.",
      "doi": ""
    },
    {
      "text": "LE Armstrong and CM Maresh. 1998. Effects of training, environment, and host factors on the sweating response to exercise. International journal of sports medicine 19, S 2 (1998), S103–S105.",
      "doi": ""
    },
    {
      "text": "Timothy T Baldwin and J Kevin Ford. 1988. Transfer of training: A review and directions for future research. Personnel psychology 41, 1 (1988), 63–105.",
      "doi": ""
    },
    {
      "text": "Wendy Balster, ELC Xue, and WK Pui. 2016. Effects of a deeper countermovement on vertical jump biomechanics after three weeks of familiarisation–preliminary findings. International Journal of Human Movement and Sports Sciences 4, 4(2016), 51–60.",
      "doi": ""
    },
    {
      "text": "E Joan Bassey, Maria A Fiatarone, Evelyn F O’neill, Margaret Kelly, William J Evans, and Lewis A Lipsitz. 1992. Leg extensor power and functional performance in very old men and women.Clinical science (London, England: 1979) 82, 3 (1992), 321–327.",
      "doi": ""
    },
    {
      "text": "Nathaniel A Bates, Kevin R Ford, Gregory D Myer, and Timothy E Hewett. 2013. Impact differences in ground reaction force and center of mass between the first and second landing phases of a drop vertical jump and their implications for injury risk assessment. Journal of biomechanics 46, 7 (2013), 1237–1241.",
      "doi": ""
    },
    {
      "text": "B Bideau, R Kulpa, N Vignais, S Brault, F Multon, and C Craig. 2010. Virtual reality, a serious game for understanding performance and training players in sport. IEEE Computer Graphic Applications 30, 2 (2010), 14–21.",
      "doi": "10.1109/MCG.2009.134"
    },
    {
      "text": "Jonathan R Blackburn and Matthew C Morrissey. 1998. The relationship between open and closed kinetic chain strength of the lower limb and jumping performance. Journal of Orthopaedic & Sports Physical Therapy 27, 6 (1998), 430–435.",
      "doi": ""
    },
    {
      "text": "James P Bliss, Philip D Tidwell, and Michael A Guest. 1997. The effectiveness of virtual reality for administering spatial navigation training to firefighters. Presence: Teleoperators & Virtual Environments 6, 1(1997), 73–86.",
      "doi": "10.1162/pres.1997.6.1.73"
    },
    {
      "text": "Maarten F Bobbert. 1990. Drop jumping as a training method for jumping ability. Sports medicine 9, 1 (1990), 7–22.",
      "doi": ""
    },
    {
      "text": "Felix Born, Sophie Abramowski, and Maic Masuch. 2019. Exergaming in VR: The Impact of Immersive Embodiment on Motivation, Performance, and Perceived Exertion. In 2019 11th International Conference on Virtual Worlds and Games for Serious Applications (VS-Games). IEEE, New York City, NY, USA, 1–8. https://doi.org/10.1109/VS-Games.2019.8864579",
      "doi": ""
    },
    {
      "text": "Felix Born, Adrian Rygula, and Maic Masuch. 2021. Motivating Players to Perform an Optional Strenuous Activity in a Virtual Reality Exergame Using Virtual Performance Augmentation. Proc. ACM Hum.-Comput. Interact. 5, CHI PLAY, Article 225 (oct 2021), 21 pages. https://doi.org/10.1145/3474652",
      "doi": "10.1145/3474652"
    },
    {
      "text": "C. Bosco, P. V. Komi, J. Tihanyi, G. Fekete, and P. Apor. 1983. Mechanical power test and fiber composition of human leg extensor muscles. European Journal of Applied Physiology and Occupational Physiology 51, 1(1983), 129–135. https://doi.org/10.1007/BF00952545",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. Can I use TA? Should I use TA? Should I not use TA? Comparing reflexive thematic analysis and other pattern-based qualitative analytic approaches. Counselling and Psychotherapy Research 21, 1 (2021), 37–47. https://doi.org/10.1002/capr.12360",
      "doi": ""
    },
    {
      "text": "Eva Buchtelová, M Tichy, and Kateřina Vaniková. 2013. Influence of muscular imbalances on pelvic position and lumbar lordosis: a theoretical basis. Journal of Nursing, Social Studies, Public Health and Rehabilitation 1, 2(2013), 25–36.",
      "doi": ""
    },
    {
      "text": "Lee N Burkett, Wayne T Phillips, and Joana Ziuraitis. 2005. The best warm-up for the vertical jump in college-age athletic men. The Journal of Strength & Conditioning Research 19, 3 (2005), 673–676.",
      "doi": ""
    },
    {
      "text": "Paul K Canavan and Jason D Vescovi. 2004. Evaluation of power prediction equations: peak vertical jumping power in women. Medicine & Science in Sports & Exercise 36, 9 (2004), 1589–1593.",
      "doi": ""
    },
    {
      "text": "Alberto Cannavò, Filippo Gabriele Pratticò, Giuseppe Ministeri, and Fabrizio Lamberti. 2018. A Movement Analysis System Based on Immersive Virtual Reality and Wearable Technology for Sport Training. In Proceedings of the 4th International Conference on Virtual Reality (Hong Kong, Hong Kong) (ICVR 2018). Association for Computing Machinery, New York, NY, USA, 26–31. https://doi.org/10.1145/3198910.3198917",
      "doi": "10.1145/3198910.3198917"
    },
    {
      "text": "Kevin Carlson, Marshall Magnusen, and Peter Walters. 2009. Effect of various training modalities on vertical jump. Research in Sports Medicine 17, 2 (2009), 84–94.",
      "doi": ""
    },
    {
      "text": "Patrick Carlson, Anicia Peters, Stephen B Gilbert, Judy M Vance, and Andy Luse. 2015. Virtual training: Learning transfer of assembly tasks. IEEE transactions on visualization and computer graphics 21, 6(2015), 770–782.",
      "doi": ""
    },
    {
      "text": "Polona Caserman, Shule Liu, and Stefan Göbel. 2022. Full-Body Motion Recognition in Immersive- Virtual-Reality-Based Exergame. IEEE Transactions on Games 14, 2 (2022), 243–252. https://doi.org/10.1109/TG.2021.3064749",
      "doi": ""
    },
    {
      "text": "Guilherme M. Cesar, Curtis L. Tomasevicz, and Judith M. Burnfield. 2016. Frontal plane comparison between drop jump and vertical jump: implications for the assessment of ACL risk of injury. Sports Biomechanics 15, 4 (Oct. 2016), 440–449. https://doi.org/10.1080/14763141.2016.1174286",
      "doi": ""
    },
    {
      "text": "John S. Y. Chan, Guanmin Liu, Danxia Liang, Kanfeng Deng, Jiamin Wu, and Jin H. Yan. 2019. Special Issue – Therapeutic Benefits of Physical Activity for Mood: A Systematic Review on the Effects of Exercise Intensity, Duration, and Modality. The Journal of Psychology 153, 1 (2019), 102–125. https://doi.org/10.1080/00223980.2018.1470487 arXiv:https://doi.org/10.1080/00223980.2018.1470487PMID: 30321106.",
      "doi": ""
    },
    {
      "text": "A Chardenon, Gilles Montagne, MJ Buekers, and Michel Laurent. 2002. The visual control of ball interception during human locomotion. Neuroscience letters 334, 1 (2002), 13–16.",
      "doi": ""
    },
    {
      "text": "Gary Charness and Uri Gneezy. 2009. Incentives to exercise. Econometrica 77, 3 (2009), 909–931.",
      "doi": ""
    },
    {
      "text": "Yu-Ping Chen, Lin-Ju Kang, Tien-Yow Chuang, Ji-Liang Doong, Shwn-Jan Lee, Mei-Wun Tsai, Suh-Fang Jeng, and Wen-Hsu Sung. 2007. Use of virtual reality to improve upper-extremity control in children with cerebral palsy: a single-subject design. Physical therapy 87, 11 (2007), 1441–1457.",
      "doi": ""
    },
    {
      "text": "Sebastian Cmentowski and Jens Krueger. 2021. Exploring the Potential of Vertical Jump Training in Virtual Reality. In Extended Abstracts of the 2021 Annual Symposium on Computer-Human Interaction in Play (Virtual Event, Austria) (CHI PLAY ’21). Association for Computing Machinery, New York, NY, USA, 179–185. https://doi.org/10.1145/3450337.3483503",
      "doi": "10.1145/3450337.3483503"
    },
    {
      "text": "Jacob Cohen. 1992. Quantitative methods in psychology: A power primer. Psychological Bulletin 112, 1 (1992), 153–159. https://doi.org/10.1.1.1043.9095",
      "doi": ""
    },
    {
      "text": "Cathy Craig. 2013. Understanding perception and action in sport: how can virtual reality technology help?Sports Technology 6, 4 (2013), 161–169.",
      "doi": ""
    },
    {
      "text": "Cathy M Craig, Eric Berton, Guillaume Rao, Laure Fernandez, and Reinoud J Bootsma. 2006. Judging where a ball will go: the case of curved free kicks in football. Naturwissenschaften 93, 2 (2006), 97–101.",
      "doi": ""
    },
    {
      "text": "Jean-Louis Croisier. 2004. Muscular imbalance and acute lower extremity muscle injuries in sport. International SportMed Journal 5, 3 (2004), 169–176.",
      "doi": ""
    },
    {
      "text": "Don Decker and Mike Vinson. 1996. Using periodization to improve vertical jump performance. Strength & Conditioning Journal 18, 1 (1996), 13–17.",
      "doi": ""
    },
    {
      "text": "DeepL SE. 2017. DeepL Translator. DeepL Pro version. Cologne, Germany. https://www.deepl.com/pro?cta=header-pro/.",
      "doi": ""
    },
    {
      "text": "PAUL Devita and William A Skelly. 1992. Effect of landing stiffness on joint kinetics and energetics in the lower extremity. Med Sci Sports Exerc 24, 1 (1992), 108–115.",
      "doi": ""
    },
    {
      "text": "Dovetail Research PTY. LTD.2016. Dovetail. Surry Hills, Australia. https://dovetailapp.com/.",
      "doi": ""
    },
    {
      "text": "Peter Düking, Hans-Christer Holmberg, and Billy Sperlich. 2018. The potential usefulness of virtual reality systems for athletes: a short SWOT analysis. Frontiers in Physiology 9 (2018), 128.",
      "doi": ""
    },
    {
      "text": "Daniel L Eaves, Gavin Breslin, Paul Van Schaik, Emma Robinson, and Iain R Spears. 2011. The short-term effects of real-time virtual reality feedback on motor learning in dance. Presence: Teleoperators and Virtual Environments 20, 1(2011), 62–77.",
      "doi": "10.5555/3116694.3116700"
    },
    {
      "text": "Kirk I Erickson, Michelle W Voss, Ruchika Shaurya Prakash, Chandramallika Basak, Amanda Szabo, Laura Chaddock, Jennifer S Kim, Susie Heo, Heloisa Alves, Siobhan M White, 2011. Exercise training increases size of hippocampus and improves memory. Proceedings of the national academy of sciences 108, 7 (2011), 3017–3022.",
      "doi": ""
    },
    {
      "text": "Philip W Fink, Patrick S Foo, and William H Warren. 2009. Catching fly balls in virtual reality: A critical test of the outfielder problem. Journal of vision 9, 13 (2009), 14–14.",
      "doi": ""
    },
    {
      "text": "Samantha Finkelstein, Andrea Nickel, Tiffany Barnes, and Evan A. Suma. 2010. Astrojumper: Motivating Children with Autism to Exercise Using a VR Game. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI EA ’10). Association for Computing Machinery, New York, NY, USA, 4189–4194. https://doi.org/10.1145/1753846.1754124",
      "doi": "10.1145/1753846.1754124"
    },
    {
      "text": "Samantha Finkelstein, Andrea Nickel, Zachary Lipps, Tiffany Barnes, Zachary Wartell, and Evan A Suma. 2011. Astrojumper: Motivating exercise with an immersive virtual reality exergame. Presence: Teleoperators and Virtual Environments 20, 1(2011), 78–92. https://doi.org/10.1162/pres_a_00036",
      "doi": ""
    },
    {
      "text": "FitXR. 2019. FitXR. Game [VR]. FitXR, London, United Kingdom..",
      "doi": ""
    },
    {
      "text": "Steven J Fleck and William Kraemer. 2014. Designing resistance training programs, 4E. Human Kinetics, Champaign, Illinois.",
      "doi": ""
    },
    {
      "text": "Jenny Gabel, Sukran Karaosmanoglu, Celeste Mason, Sebastian Rings, and Frank Steinicke. 2021. Corona Beat - Kicking The Sedentary Habit Induced By Prolonged Social Distancing. In 2021 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, Lisbon, Portugal, 687–688. https://doi.org/10.1109/VRW52623.2021.00226",
      "doi": ""
    },
    {
      "text": "David A Gabriel, Gary Kamen, and Gail Frost. 2006. Neural adaptations to resistive exercise. Sports medicine 36, 2 (2006), 133–149.",
      "doi": ""
    },
    {
      "text": "Mat Gallagher. 2022. 3 reasons why you should buy a VR headset. https://www.t3.com/news/3-reasons-why-you-should-buy-a-vr-headset",
      "doi": ""
    },
    {
      "text": "Beat Games. 2019. Beat Saber. Game [VR]. Beat Games. Los Angeles, CA, USA. https://beatsaber.com/. Steam Reviews: https://store.steampowered.com/app/620980/Beat_Saber/. Accessed: 30.12.2021.",
      "doi": ""
    },
    {
      "text": "Rodrigo Ghedini Gheller, Juliano Dal Pupo, Luis Antonio Pereira de Lima, Bruno Monteiro de Moura, and Saray Giovana dos Santos. 2014. Effect of squat depth on performance and biomechanical parameters of countermovement vertical jump.",
      "doi": ""
    },
    {
      "text": "Linda Graf, Maximilian Altmeyer, Katharina Emmerich, Marc Herrlich, Andrey Krekhov, and Katta Spiel. 2022. Development and Validation of a German Version of the Player Experience Inventory (PXI). In Proceedings of Mensch Und Computer 2022(Darmstadt, Germany) (MuC ’22). Association for Computing Machinery, New York, NY, USA, 265–275. https://doi.org/10.1145/3543758.3543763",
      "doi": "10.1145/3543758.3543763"
    },
    {
      "text": "John Graham. 1994. Guidelines for providing valid testing of athletes’ fitness levels. Strength & Conditioning Journal 16, 6 (1994), 7–14.",
      "doi": ""
    },
    {
      "text": "Daigo Hayashi, Kazuyuki Fujita, Kazuki Takashima, Robert W. Lindeman, and Yoshifumi Kitamura. 2019. Redirected Jumping: Imperceptibly Manipulating Jump Motions in Virtual Reality. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, New York City, NY, USA, 386–394. https://doi.org/10.1109/VR.2019.8797989",
      "doi": ""
    },
    {
      "text": "Robert T Hays, John W Jacobs, Carolyn Prince, and Eduardo Salas. 1992. Flight simulator training effectiveness: A meta-analysis. Military psychology 4, 2 (1992), 63–74.",
      "doi": ""
    },
    {
      "text": "Eric J Hegedus, Suzanne McDonough, Chris Bleakley, Chad E Cook, and G David Baxter. 2015. Clinician-friendly lower extremity physical performance measures in athletes: a systematic review of measurement properties and correlation with injury, part 1. The tests for knee function including the hop tests. British journal of sports medicine 49, 10 (2015), 642–648.",
      "doi": ""
    },
    {
      "text": "Christian Helland, Jens Bojsen-Møller, Truls Raastad, Olivier R Seynnes, Marie M Moltubakk, Vidar Jakobsen, Håvard Visnes, and Roald Bahr. 2013. Mechanical properties of the patellar tendon in elite volleyball players with and without patellar tendinopathy. British Journal of Sports Medicine 47, 13 (Sept. 2013), 862–868. https://doi.org/10.1136/bjsports-2013-092275",
      "doi": ""
    },
    {
      "text": "Timothy E Hewett, Gregory D Myer, Kevin R Ford, Robert S Heidt Jr, Angelo J Colosimo, Scott G McLean, Antonie J Van den Bogert, Mark V Paterno, and Paul Succop. 2005. Biomechanical measures of neuromuscular control and valgus loading of the knee predict anterior cruciate ligament injury risk in female athletes: a prospective study. The American journal of sports medicine 33, 4 (2005), 492–501.",
      "doi": ""
    },
    {
      "text": "Anne Hösch. 2018. Simulator Sickness in Fahrsimulationsumgebungen-drei Studien zu Human Factors. Ph. D. Dissertation. Technische Universität Ilmenau. https://www.db-thueringen.de/receive/dbt_mods_00037865",
      "doi": ""
    },
    {
      "text": "Paul A Hough, Emma Z Ross, and Glyn Howatson. 2009. Effects of dynamic and static stretching on vertical jump performance and electromyographic activity. The Journal of Strength & Conditioning Research 23, 2 (2009), 507–512.",
      "doi": ""
    },
    {
      "text": "HTC Corporation. 2020. HTC Vive Pro. Website. Retrieved October 26, 2020 from https://www.vive.com/eu/product/vive-pro/.",
      "doi": ""
    },
    {
      "text": "HTC Corporation. 2022. HTC Vive Tracker. Website. Retrieved July 12, 2022 from https://www.vive.com/us/accessory/tracker3/.",
      "doi": ""
    },
    {
      "text": "Jackie L Hudson. 1986. Coordination of segments in the vertical jump.Medicine & Science in Sports & Exercise 18, 2 (1986), 241–252.",
      "doi": ""
    },
    {
      "text": "Joseph P Hunter and Robert N Marshall. 2002. Effects of power and flexibility training on vertical jump technique. Medicine and science in sports and exercise 34, 3 (2002), 478–486.",
      "doi": ""
    },
    {
      "text": "Christos Ioannou, Patrick Archard, Eamonn O’Neill, and Christof Lutteroth. 2019. Virtual Performance Augmentation in an Immersive Jump & Run Exergame. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300388",
      "doi": "10.1145/3290605.3300388"
    },
    {
      "text": "Clayne R Jensen and A Garth Fisher. 1972. Scientific Basis of Athletic Conditioning: A Unique Book Dealing Exclusively with the Practical Application of Scientific Information to Athletic Conditioning. Journal of Health, Physical Education, Recreation 43, 8(1972), 6–7.",
      "doi": ""
    },
    {
      "text": "Jason Jerald. 2015. The VR Book: Human-Centered Design for Virtual Reality. Association for Computing Machinery and Morgan & Claypool, New York, New York, US.",
      "doi": "10.1145/2792790"
    },
    {
      "text": "Raine Kajastila, Leo Holsti, and Perttu Hämäläinen. 2014. Empowering the Exercise: a Body-Controlled Trampoline Training Game. International Journal of Computer Science in Sport 1, 13 (2014), 6–23.",
      "doi": ""
    },
    {
      "text": "Sukran Karaosmanoglu, Lucie Kruse, Sebastian Rings, and Frank Steinicke. 2022. Canoe VR: An Immersive Exergame to Support Cognitive and Physical Exercises of Older Adults. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 342, 7 pages. https://doi.org/10.1145/3491101.3519736",
      "doi": "10.1145/3491101.3519736"
    },
    {
      "text": "Sukran Karaosmanoglu, Sebastian Rings, Lucie Kruse, Christian Stein, and Frank Steinicke. 2021. Lessons Learned from a Human-Centered Design of an Immersive Exergame for People with Dementia. Proc. ACM Hum.-Comput. Interact. 5, CHI PLAY, Article 252 (oct 2021), 27 pages. https://doi.org/10.1145/3474679",
      "doi": "10.1145/3474679"
    },
    {
      "text": "Philip Kelly, Aoife Healy, Kieran Moran, and Noel E. O’Connor. 2010. A Virtual Coaching Environment for Improving Golf Swing Technique. In Proceedings of the 2010 ACM Workshop on Surreal Media and Virtual Cloning (Firenze, Italy) (SMVC ’10). Association for Computing Machinery, New York, NY, USA, 51–56. https://doi.org/10.1145/1878083.1878098",
      "doi": "10.1145/1878083.1878098"
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator Sickness Questionnaire: An Enhanced Method for Quantifying Simulator Sickness. The International Journal of Aviation Psychology 3, 3 (1993), 203–220. https://doi.org/10.1207/s15327108ijap0303_3",
      "doi": ""
    },
    {
      "text": "Ho-Jun Kim, Seokhee Chung, Sungsoo Kim, Hyundae Shin, Jongsoo Lee, Sehyun Kim, and Mi-Yeon Song. 2006. Influences of trunk muscles on lumbar lordosis and sacral angle. European Spine Journal 15, 4 (2006), 409–414.",
      "doi": ""
    },
    {
      "text": "Jungjin Kim, Jaebum Son, Nayeon Ko, and BumChul Yoon. 2013. Unsupervised virtual reality-based exercise program improves hip muscle strength and balance control in older adults: a pilot study. Archives of physical medicine and rehabilitation 94, 5(2013), 937–943.",
      "doi": ""
    },
    {
      "text": "Joong Hwi Kim, Sung Ho Jang, Chung Sun Kim, Ji Hee Jung, and Joshua H You. 2009. Use of virtual reality to enhance balance and ambulation in chronic stroke: a double-blind, randomized controlled study. American Journal of physical medicine & rehabilitation 88, 9(2009), 693–701.",
      "doi": ""
    },
    {
      "text": "P Klavora 2000. Vertical-jump tests: A critical review. Strength and Conditioning Journal 22, 5 (2000), 70–75.",
      "doi": ""
    },
    {
      "text": "JJ Kozak, Peter A Hancock, EJ Arthur, and Susan T Chrysler. 1993. Transfer of training from virtual reality. Ergonomics 36, 7 (1993), 777–784.",
      "doi": ""
    },
    {
      "text": "William J Kraemer, Scott A Mazzetti, Bradley C Nindl, Lincoln A Gotshalk, Jeff S Volek, Jill A Bush, JIM O MARX, KEI DOHI, Ana L Gomez, MARY MILES, 2001. Effect of resistance training on women’s strength/power and occupational performances. Medicine & Science in Sports & Exercise 33, 6 (2001), 1011–1025.",
      "doi": ""
    },
    {
      "text": "Lucie Kruse, Sukran Karaosmanoglu, Sebastian Rings, Benedikt Ellinger, Daniel Apken, Thandiwe Feziwe Mangana, and Frank Steinicke. 2021. A Long-Term User Study of an Immersive Exergame for Older Adults with Mild Dementia during the COVID-19 Pandemic. In ICAT-EGVE 2021 - International Conference on Artificial Reality and Telexistence and Eurographics Symposium on Virtual Environments, Jason Orlosky, Dirk Reiners, and Benjamin Weyers (Eds.). The Eurographics Association, Eindhoven, The Netherlands, 9–18. https://doi.org/10.2312/egve.20211322",
      "doi": ""
    },
    {
      "text": "H Kyröläinen, J Avela, JM McBride, S Koskinen, JL Andersen, S Sipilä, TES Takala, and PV Komi. 2004. Effects of power training on mechanical efficiency in jumping. European journal of applied physiology 91, 2 (2004), 155–159.",
      "doi": ""
    },
    {
      "text": "Odders Lab. 2019. OhShape. Game [VR]. Odders Lab. Seville, Spain. https://ohshapevr.com/. Steam Reviews: https://store.steampowered.com/app/1098100/OhShape/. Accessed: 22.11.2022.",
      "doi": ""
    },
    {
      "text": "Rotem Lammfromm and Daniel Gopher. 2011. Transfer of skill from a virtual reality trainer to real juggling. BIO web of conferences 1(2011), 00054. https://doi.org/10.1051/bioconf/20110100054",
      "doi": ""
    },
    {
      "text": "Corinna E Lathan, Michael R Tracey, Marc M Sebrechts, Deborah M Clawson, and Gerald A Higgins. 2002. Using virtual environments as training simulators: Measuring transfer. In Handbook of Virtual Environments. CRC Press, Boca Raton, Florida, US, 443–454.",
      "doi": ""
    },
    {
      "text": "Savvas Lazaridis, Eleni Bassa, Dimitrios Patikas, Giannis Giakas, Albert Gollhofer, and Christos Kotzamanidis. 2010. Neuromuscular differences between prepubescents boys and adult men during drop jump. European journal of applied physiology 110, 1 (2010), 67–74.",
      "doi": ""
    },
    {
      "text": "Adrian Lees, Jos Vanrenterghem, and Dirk De Clercq. 2004. The maximal and submaximal vertical jump: implications for strength and conditioning. The Journal of Strength & Conditioning Research 18, 4 (2004), 787–791.",
      "doi": ""
    },
    {
      "text": "Lauri Lehtonen, Maximus D. Kaos, Raine Kajastila, Leo Holsti, Janne Karsisto, Sami Pekkola, Joni Vähämäki, Lassi Vapaakallio, and Perttu Hämäläinen. 2019. Movement Empowerment in a Multiplayer Mixed-Reality Trampoline Game. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 19–29. https://doi.org/10.1145/3311350.3347181",
      "doi": "10.1145/3311350.3347181"
    },
    {
      "text": "Matthieu Lenoir, Eliane Musch, and Nancy La Grange. 1999. Ecological relevance of stereopsis in one-handed ball-catching. Perceptual and motor skills 89, 2 (1999), 495–508.",
      "doi": ""
    },
    {
      "text": "Yi-Jun Li, De-Rong Jin, Miao Wang, Jun-Long Chen, Frank Steinicke, Shi-Min Hu, and Qinping Zhao. 2021. Detection Thresholds with Joint Horizontal and Vertical Gains in Redirected Jumping. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). IEEE, New York City, NY, USA, 95–102. https://doi.org/10.1109/VR50410.2021.00030",
      "doi": ""
    },
    {
      "text": "Phil Lundin and William Berg. 1991. Plyometrics: a review of plyometric training. Strength & Conditioning Journal 13, 6 (1991), 22–34.",
      "doi": ""
    },
    {
      "text": "Andrew D Lyttle, Greg J Wilson, and Karl J Ostrowski. 1996. Enhancing performance: Maximal power versus combined weights and plyometrics training. Journal of strength and conditioning research 10 (1996), 173–179.",
      "doi": ""
    },
    {
      "text": "Andrew Macvean and Judy Robertson. 2013. Understanding Exergame Users’ Physical Activity, Motivation and Behavior over Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1251–1260. https://doi.org/10.1145/2470654.2466163",
      "doi": "10.1145/2470654.2466163"
    },
    {
      "text": "Laurent Malisoux, Marc Francaux, Henri Nielens, and Daniel Theisen. 2006. Stretch-shortening cycle exercises: an effective training paradigm to enhance power output of human single muscle fibers. Journal of applied physiology 100, 3 (2006), 771–779.",
      "doi": ""
    },
    {
      "text": "Fabrizia Mantovani, Gianluca Castelnuovo, Andrea Gaggioli, and Giuseppe Riva. 2003. Virtual reality training for health-care professionals. CyberPsychology & Behavior 6, 4 (2003), 389–395.",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The Design Space of Body Games: Technological, Physical, and Social Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 3365–3374. https://doi.org/10.1145/2470654.2466461",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Anna Lisa Martin-Niedecken, Andrea Mahrer, Katja Rogers, Eling D. de Bruin, and Alexandra Schättin. 2020. “HIIT” the ExerCube: Comparing the Effectiveness of Functional High-Intensity Interval Training in Conventional vs. Exergame-Based Training. Frontiers in Computer Science 2 (2020), 15 pages. https://doi.org/10.3389/fcomp.2020.00033",
      "doi": ""
    },
    {
      "text": "Anna Lisa Martin-Niedecken, Katja Rogers, Laia Turmo Vidal, Elisa D. Mekler, and Elena Márquez Segura. 2019. ExerCube vs. Personal Trainer: Evaluating a Holistic, Immersive, and Adaptive Fitness Game Setup. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300318",
      "doi": "10.1145/3290605.3300318"
    },
    {
      "text": "Arnaud Mas, Idriss Ismaël, and Nicolas Filliard. 2018. Indy: a virtual reality multi-player game for navigation skills training. In 2018 IEEE Fourth VR International Workshop on Collaborative Virtual Environments (3DCVE). IEEE, IEEE, New York City, NY, USA, 1–4.",
      "doi": ""
    },
    {
      "text": "Daniel Travis McMaster, Nicholas Gill, John Cronin, and Michael McGuigan. 2014. A Brief Review of Strength and Ballistic Assessment Methodologies in Sport. Sports Medicine 44, 5 (May 2014), 603–623. https://doi.org/10.1007/s40279-014-0145-2",
      "doi": ""
    },
    {
      "text": "Peter J McNair, Harry Prapavessis, and Karen Callender. 2000. Decreasing landing forces: effect of instruction. British journal of sports medicine 34, 4 (2000), 293–296.",
      "doi": ""
    },
    {
      "text": "Stefan C Michalski, Ancret Szpak, and Tobias Loetscher. 2019. Using virtual environments to improve real-world motor skills in sports: A systematic review. Frontiers in psychology 10 (2019), 2159.",
      "doi": ""
    },
    {
      "text": "Stefan Carlo Michalski, Ancret Szpak, Dimitrios Saredakis, Tyler James Ross, Mark Billinghurst, and Tobias Loetscher. 2019. Getting your game on: Using virtual reality to improve real table tennis skills. PloS one 14, 9 (2019), e0222351.",
      "doi": ""
    },
    {
      "text": "Microsoft Corporation. 2014. Kinect 2 for Windows. Website. Discontinued Product.",
      "doi": ""
    },
    {
      "text": "Anat Mirelman, Benjamin L Patritti, Paolo Bonato, and Judith E Deutsch. 2010. Effects of virtual reality training on gait biomechanics of individuals post-stroke. Gait & posture 31, 4 (2010), 433–437.",
      "doi": ""
    },
    {
      "text": "Florian Mueller and Katherine Isbister. 2014. Movement-Based Game Guidelines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2191–2200. https://doi.org/10.1145/2556288.2557163",
      "doi": "10.1145/2556288.2557163"
    },
    {
      "text": "Florian Mueller, Rohit Ashok Khot, Kathrin Gerling, and Regan Mandryk. 2016. Exertion Games. Foundations and Trends® in Human–Computer Interaction 10, 1(2016), 1–86. https://doi.org/10.1561/1100000041",
      "doi": "10.1561/1100000041"
    },
    {
      "text": "Florian ’Floyd’ Mueller, Darren Edge, Frank Vetere, Martin R. Gibbs, Stefan Agamanolis, Bert Bongers, and Jennifer G. Sheridan. 2011. Designing Sports: A Framework for Exertion Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2651–2660. https://doi.org/10.1145/1978942.1979330",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "Sean P Mullen, Erin A Olson, Siobhan M Phillips, Amanda N Szabo, Thomas R Wójcicki, Emily L Mailey, Neha P Gothe, Jason T Fanning, Arthur F Kramer, and Edward McAuley. 2011. Measuring enjoyment of physical activity in older adults: invariance of the physical activity enjoyment scale (paces) across groups and time. International Journal of Behavioral Nutrition and Physical Activity 8, 1(2011), 1–9. https://doi.org/10.1186/1479-5868-8-103",
      "doi": ""
    },
    {
      "text": "David L Neumann, Robyn L Moffitt, Patrick R Thomas, Kylie Loveday, David P Watling, Chantal L Lombard, Simona Antonova, and Michael A Tremeer. 2018. A systematic review of the application of interactive virtual reality to sport. Virtual Reality 22, 3 (2018), 183–198.",
      "doi": "10.1007/s10055-017-0320-5"
    },
    {
      "text": "Benjamin John Newton, Zuzana Rothlingova, Robin Gutteridge, Karen LeMarchand, and Jon Howard Raphael. 2012. No room for reflexivity? Critical reflections following a systematic review of qualitative research. Journal of Health Psychology 17, 6 (2012), 866–885. https://doi.org/10.1177/1359105311427615",
      "doi": ""
    },
    {
      "text": "Niantic, Nintendo, and The Pokémon Company. 2016. Pokémon Go. Game [AR]. https://www.pokemongo.com/en-us/.",
      "doi": ""
    },
    {
      "text": "Niels C Nilsson, Stefania Serafin, and Rolf Nordahl. 2013. Unintended positional drift and its potential solutions. In 2013 IEEE Virtual Reality (VR). IEEE, IEEE, New York City, NY, USA, 121–122.",
      "doi": ""
    },
    {
      "text": "Rui Nouchi, Yasuyuki Taki, Hikaru Takeuchi, Atsushi Sekiguchi, Hiroshi Hashizume, Takayuki Nozawa, Haruka Nouchi, and Ryuta Kawashima. 2014. Four weeks of combination exercise training improved executive functions, episodic memory, and processing speed in healthy elderly people: evidence from a randomized controlled trial. Age 36, 2 (2014), 787–799.",
      "doi": ""
    },
    {
      "text": "Anderson Souza Oliveira, Priscila Brito Silva, Morten Enemark Lund, Dario Farina, and Uwe Gustav Kersting. 2017. Balance training enhances motor coordination during a perturbed sidestep cutting task. journal of orthopaedic & sports physical therapy 47, 11 (2017), 853–862.",
      "doi": ""
    },
    {
      "text": "Jorge Perez-Gomez and JA Calbet. 2013. Training methods to improve vertical jump performance. The Journal of sports medicine and physical fitness 53, 4 (2013), 339–357.",
      "doi": ""
    },
    {
      "text": "Dana P Piasecki, Kurt P Spindler, Todd A Warren, Jack T Andrish, and Richard D Parker. 2003. Intraarticular injuries associated with anterior cruciate ligament tear: findings at ligament reconstruction in high school and recreational athletes: an analysis of sex-based differences. The American journal of sports medicine 31, 4 (2003), 601–605.",
      "doi": ""
    },
    {
      "text": "Jeffrey A Potteiger, Robert H Lockwood, Mark D Haub, Brett A Dolezal, Khalid S Almuzaini, Jan M Schroeder, and Carole J Zebas. 1999. Muscle power and fiber characteristics following 8 weeks of plyometric training. Journal of strength and conditioning research 13 (1999), 275–279.",
      "doi": ""
    },
    {
      "text": "Michael E Powers. 1996. Vertical jump training for volleyball. Strength and Conditioning 18 (1996), 18–23.",
      "doi": ""
    },
    {
      "text": "Harry Prapavessis and Peter J McNair. 1999. Effects of instruction in jumping technique and experience jumping on ground reaction forces. Journal of orthopaedic & sports physical therapy 29, 6 (1999), 352–356.",
      "doi": ""
    },
    {
      "text": "Judy Robertson, Andrew Macvean, Samantha Fawkner, Graham Baker, and Ruth G. Jepson. 2018. Savouring our mistakes: Learning from the FitQuest project. International Journal of Child-Computer Interaction 16 (2018), 55–67. https://doi.org/10.1016/j.ijcci.2017.12.003",
      "doi": ""
    },
    {
      "text": "Sharon Stansfield, Daniel Shawver, Annette Sobel, Monica Prasad, and Lydia Tapia. 2000. Design and implementation of a virtual reality system and its application to training medical first responders. Presence: Teleoperators & Virtual Environments 9, 6(2000), 524–556.",
      "doi": "10.1162/105474600300040376"
    },
    {
      "text": "Dejan Stošić, Slavoljub Uzunović, Saša Pantelić, Saša Veličković, Marko Đurović, and Danica Piršl. 2019. Effects of exercise program on coordination and explosive power in university dance students. Facta Universitatis. Series: Physical Education and Sport 17, 3(2019), 579–589.",
      "doi": ""
    },
    {
      "text": "Yusaku Sugiura, Tomoyuki Saito, Keishoku Sakuraba, Kazuhiko Sakuma, and Eiichi Suzuki. 2008. Strength deficits identified with concentric action of the hip extensors and eccentric action of the hamstrings predispose to hamstring injury in elite sprinters. Journal of orthopaedic & sports physical therapy 38, 8 (2008), 457–464.",
      "doi": ""
    },
    {
      "text": "Ancret Szpak, Stefan Carlo Michalski, and Tobias Loetscher. 2020. Exergaming With Beat Saber: An Investigation of Virtual Reality Aftereffects. J Med Internet Res 22, 10 (23 Oct 2020), e19840. https://doi.org/10.2196/19840",
      "doi": ""
    },
    {
      "text": "Kazumoto Tanaka. 2017. 3D action reconstruction using virtual player to assist karate training. In 2017 IEEE Virtual Reality (VR). IEEE, IEEE, New York City, NY, USA, 395–396.",
      "doi": ""
    },
    {
      "text": "Judith Tirp, Christina Steingröver, Nick Wattie, Joseph Baker, and Jörg Schorer. 2015. Virtual realities as optimal learning environments in sport-A transfer study of virtual and real dart throwing. Psychological Test and Assessment Modeling 57, 1 (2015), 57.",
      "doi": ""
    },
    {
      "text": "Emanuel Todorov, Reza Shadmehr, and Emilio Bizzi. 1997. Augmented feedback presented in a virtual environment accelerates learning of a difficult motor task. Journal of motor behavior 29, 2 (1997), 147–158.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2020. Unity. Website. Retrieved October 26, 2020 from https://unity.com/.",
      "doi": ""
    },
    {
      "text": "Stephen Uzor and Lynne Baillie. 2014. Investigating the Long-Term Use of Exergames in the Home with Elderly Fallers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2813–2822. https://doi.org/10.1145/2556288.2557160",
      "doi": "10.1145/2556288.2557160"
    },
    {
      "text": "Etienne van Wyk and Ruth de Villiers. 2009. Virtual Reality Training Applications for the Mining Industry. In Proceedings of the 6th International Conference on Computer Graphics, Virtual Reality, Visualisation and Interaction in Africa (Pretoria, South Africa) (AFRIGRAPH ’09). Association for Computing Machinery, New York, NY, USA, 53–63. https://doi.org/10.1145/1503454.1503465",
      "doi": "10.1145/1503454.1503465"
    },
    {
      "text": "Athanasios Vanezis and Adrian Lees. 2005. A biomechanical analysis of good and poor performers of the vertical jump. Ergonomics 48, 11-14 (2005), 1594–1603.",
      "doi": ""
    },
    {
      "text": "WanadevStudio. 2020. Ragnaröck. Game [VR]. WanadevStudio. Lyon, France. https://www.ragnarock-vr.com/home/.",
      "doi": ""
    },
    {
      "text": "Peter Wilhelm and Dominik Schoebi. 2007. Assessing mood in daily life: Structural validity, sensitivity to change, and reliability of a short-scale to measure three basic dimensions of mood.European Journal of Psychological Assessment 23, 4(2007), 258. https://doi.org/10.1027/1015-5759.23.4.258",
      "doi": ""
    },
    {
      "text": "Greg J Wilson and Aron J Murphy. 1996. The use of isometric tests of muscular function in athletic assessment. Sports medicine 22, 1 (1996), 19–37.",
      "doi": ""
    },
    {
      "text": "Greg J Wilson, Aron J Murphy, and Anthony Giorgi. 1996. Weight and plyometric training: effects on eccentric and concentric force production. Canadian Journal of Applied Physiology 21, 4 (1996), 301–315.",
      "doi": ""
    },
    {
      "text": "Dennis Wolf, Katja Rogers, Christoph Kunder, and Enrico Rukzio. 2020. JumpVR: Jump-Based Locomotion Augmentation for Virtual Reality. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376243",
      "doi": "10.1145/3313831.3376243"
    },
    {
      "text": "World Health Organization. 2020. Physical activity. Website. Retrieved September 5, 2022 from https://www.who.int/news-room/fact-sheets/detail/physical-activity.",
      "doi": ""
    },
    {
      "text": "XRWorkout Inc.2021. VRWorkout. Game [VR]. Michael Gschwandtner, Wien, Austria..",
      "doi": ""
    },
    {
      "text": "Wenge Xu, Hai-Ning Liang, Qiuyu He, Xiang Li, Kangyou Yu, and Yuzheng Chen. 2020. Results and Guidelines From a Repeated-Measures Design Experiment Comparing Standing and Seated Full-Body Gesture-Based Immersive Virtual Reality Exergames: Within-Subjects Evaluation. JMIR Serious Games 8, 3 (27 Jul 2020), e17972. https://doi.org/10.2196/17972",
      "doi": ""
    },
    {
      "text": "Yei-Yu Yeh and Louis D Silverstein. 1992. Spatial judgments with monoscopic and stereoscopic presentation of perspective displays. Human Factors 34, 5 (1992), 583–600.",
      "doi": "10.1177/001872089203400506"
    },
    {
      "text": "Soojeong Yoo and Judy Kay. 2016. VRun: Running-in-Place Virtual Reality Exergame. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (Launceston, Tasmania, Australia) (OzCHI ’16). Association for Computing Machinery, New York, NY, USA, 562–566. https://doi.org/10.1145/3010915.3010987",
      "doi": "10.1145/3010915.3010987"
    },
    {
      "text": "Frank TJM Zaal and Reinoud J Bootsma. 2011. Virtual reality as a tool for the study of perception-action: The case of running to catch fly balls. Presence 20, 1 (2011), 93–103.",
      "doi": "10.5555/3116694.3116702"
    }
  ]
}