{
  "doi": "10.1145/3544548.3581081",
  "title": "HCI Research on Agriculture: Competing Sociotechnical Imaginaries, Definitions, and Opportunities",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2023,
  "badges": [],
  "abstract": "Agriculture is foundational for food security on our planet. Considering climate change and other pressures on food production, HCI scholars have increasingly begun to examine how the field should approach agricultural innovation. We conducted a literature review of HCI research through the lens of competing future visions for good food systems : a “conventional” vision of profit-oriented production, and an “alternative” which prioritizes sustainability and community-led practices. Leveraging the concept of sociotechnical imaginaries, we provide an empirical analysis of how HCI and adjacent applied computing projects align with these competing visions for agriculture. This review reveals, amongst other findings, a prioritization of the perspectives of the Global North and a need for more careful attention to the constraints and aspirations of subsistence farmers. Finally, we note the limits of the conventional-alternative binary that shapes much of contemporary HCI research focused on agriculture and offer opportunities for transcending this framing.",
  "tags": [],
  "authors": [
    {
      "name": "Olivia Doggett",
      "institution": "Faculty of Information & School of Environment, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659886020",
      "orcid": "0000-0002-7056-6347"
    },
    {
      "name": "Kelly Bronson",
      "institution": "School of Sociological and Anthropological Studies, University of Ottawa, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783245",
      "orcid": "0000-0002-5365-4919"
    },
    {
      "name": "Robert Soden",
      "institution": "University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704911",
      "orcid": "0000-0003-2657-0485"
    }
  ],
  "references": [
    {
      "text": "Abanay, Lh. Masmoudi, A. Elharif, M. Gharbi, and B. Bououlid. 2017. Design and development of a mobile platform for an agricultural robot prototype. In Proceedings of the 2nd International Conference on Computing and Wireless Communication Systems - ICCWCS’17, ACM Press, Larache, Morocco, 1–5. DOI:https://doi.org/10.1145/3167486.3167527",
      "doi": "10.1145/3167486.3167527"
    },
    {
      "text": "Waleed Abdallah, Mohamad Khdair, Mos'ab Ayyash, and Issa Asad. 2018. IoT system to control greenhouse agriculture based on the needs of Palestinian farmers. In Proceedings of the 2nd International Conference on Future Networks and Distributed Systems, ACM, Amman Jordan, 1–9. DOI:https://doi.org/10.1145/3231053.3231061",
      "doi": "10.1145/3231053.3231061"
    },
    {
      "text": "John Carlo Q. Agetano, Niña Angela T. Pamplona, Genoah Lee Hernia, Ingrid Carissa C. Obnial, and Eugenia R. Zhuo. 2018. Amaize: Automated Maize Seed Sowing Robot with Android Mobile Application. In Proceedings of the 6th International Conference on Information Technology: IoT and Smart City  - ICIT 2018, ACM Press, Hong Kong, Hong Kong, 295–300. DOI:https://doi.org/10.1145/3301551.3301554",
      "doi": "10.1145/3301551.3301554"
    },
    {
      "text": "Rakshit Agrawal, Mridu Atray, and Krishna Sundari Sattiraju. 2013. Exploring suitable interfaces for agriculture based smartphone apps in India. In Proceedings of the 11th Asia Pacific Conference on Computer Human Interaction - APCHI ’13, ACM Press, Bangalore, India, 280–285. DOI:https://doi.org/10.1145/2525194.2525293",
      "doi": "10.1145/2525194.2525293"
    },
    {
      "text": "Julian Agyeman (Ed.). 2003. Just sustainabilities: development in an unequal world. MIT Press [u.a.], Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Hasib Ahsan, Lars Rune Christensen, and Kengo Kitaura. 2021. Agribuddy: Infrastructuring for Smallholder Farming in Cambodia. In C&T ’21: Proceedings of the 10th International Conference on Communities & Technologies - Wicked Problems in the Age of Tech, ACM, Seattle WA USA, 309–318. DOI:https://doi.org/10.1145/3461564.3461576",
      "doi": "10.1145/3461564.3461576"
    },
    {
      "text": "Moustafa Ali. 2013. Towards a decolonial computing. 28–35.",
      "doi": ""
    },
    {
      "text": "Ahmed Ansari. 2019. Decolonizing design through the perspectives of cosmological others: Arguing for an ontological turn in design research and practice. XRDS 26, 2 (November 2019), 16–19. DOI:https://doi.org/10.1145/3368048",
      "doi": "10.1145/3368048"
    },
    {
      "text": "Amir Asghar Ali, Muhammad Zohaib, and Syed Atif Mehdi. 2019. An Autonomous Seeder for Maize Crop. In Proceedings of the 2019 5th International Conference on Robotics and Artificial Intelligence, ACM, Singapore Singapore, 42–47. DOI:https://doi.org/10.1145/3373724.3373737",
      "doi": "10.1145/3373724.3373737"
    },
    {
      "text": "Syed Ali, Harris Durrani, Muhammad Naeem, Waleed Riaz, and Suleman Shahid. 2016. Supporting Pakistani Farmers Through Digital Means: An Exploratory Study. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM, San Jose California USA, 2299–2305. DOI:https://doi.org/10.1145/2851581.2892527",
      "doi": "10.1145/2851581.2892527"
    },
    {
      "text": "Doreid Ammar, Jean Savinien, and Lionel Radisson. 2019. The Makers’ Beehives: Smart Beehives for Monitoring Honey-Bees’ Activities. In Proceedings of the 9th International Conference on the Internet of Things, ACM, Bilbao Spain, 1–4. DOI:https://doi.org/10.1145/3365871.3365887",
      "doi": "10.1145/3365871.3365887"
    },
    {
      "text": "Jessica Andrich, Diana Beirl, Tassilo Nick Bouwman, Anouk Zarah Harde, and Tim Serkes. 2018. NaviiCompass: An Exploratory Feedback System for an Urban Farm Community. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–6. DOI:https://doi.org/10.1145/3170427.3180645",
      "doi": "10.1145/3170427.3180645"
    },
    {
      "text": "Danny Ardianto. 2014. Understanding social media-enabled participation and resilience in urban farming communities. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design, ACM, Sydney New South Wales Australia, 111–114. DOI:https://doi.org/10.1145/2686612.2686627",
      "doi": "10.1145/2686612.2686627"
    },
    {
      "text": "Niina Arvila, Anabel Fischer, Pietari Keskinen, and Marko Nieminen. 2018. Mobile weather services for Maasai farmers: socio-cultural factors influencing the adoption of technology. In Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities, ACM, Windhoek Namibia, 1–11. DOI:https://doi.org/10.1145/3283458.3283466",
      "doi": "10.1145/3283458.3283466"
    },
    {
      "text": "Lindsay Barbieri, Sonya Ahamed, and Sam Bliss. 2019. Farming within Limits. Interactions 26, 5 (2019), 70–73. DOI:https://doi.org/10.1145/3348795",
      "doi": "10.1145/3348795"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Ann Light. 2021. Wanting To Live Here: Design After Anthropocentric Functionalism. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–24. DOI:https://doi.org/10.1145/3411764.3445167",
      "doi": "10.1145/3411764.3445167"
    },
    {
      "text": "Tanya Basok. 2009. Tortillas and tomatoes transmigrant Mexican harvesters in Canada. McGill-Queen's University Press, Montreal.",
      "doi": ""
    },
    {
      "text": "Paul Baxter, Grzegorz Cielniak, Marc Hanheide, and Pål From. 2018. Safe Human-Robot Interaction in Agriculture. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction, ACM, Chicago IL USA, 59–60. DOI:https://doi.org/10.1145/3173386.3177072",
      "doi": "10.1145/3173386.3177072"
    },
    {
      "text": "Curtis E. Beus and Riley E. Dunlap. 1990. Conventional versus Alternative Agriculture: The Paradigmatic Roots of the Debate*. Rural Sociology 55, 4 (1990), 590–616. DOI:https://doi.org/10.1111/j.1549-0831.1990.tb00699.x",
      "doi": ""
    },
    {
      "text": "Curtis E. Beus and Riley E. Dunlap. 1994. Endorsement of Agrarian Ideology and Adherence to Agricultural Paradigms1. Rural Sociology 59, 3 (1994), 462–484. DOI:https://doi.org/10.1111/j.1549-0831.1994.tb00542.x",
      "doi": ""
    },
    {
      "text": "Curtis E. Beus and Riley E. Dunlap. 1994. Agricultural Paradigms and the Practice of Agriculture1. Rural Sociology 59, 4 (1994), 620–635. DOI:https://doi.org/10.1111/j.1549-0831.1994.tb00551.x",
      "doi": ""
    },
    {
      "text": "Heidi Biggs, Tejaswini Joshi, Ries Murphy, Jeffrey Bardzell, and Shaowen Bardzell. 2021. Alternatives to Agrilogistics: Designing for Ecological Thinking. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (October 2021), 1–31. DOI:https://doi.org/10.1145/3479557",
      "doi": "10.1145/3479557"
    },
    {
      "text": "Wiebe E. Bijker. 1995. Of bicycles, bakelites, and bulbs: toward a theory of sociotechnical change. MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Ted Nordhaus Blaustein-Rejto Dan. Big Agriculture Is Best. Foreign Policy. Retrieved September 14, 2022 from https://foreignpolicy.com/2021/04/18/big-agriculture-is-best/",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, San Jose California USA, 503–512. DOI:https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Eli Blevis and Susan Coleman Morse. 2009. SUSTAINABLY OURSFood, dude. interactions 16, 2 (March 2009), 58–62. DOI:https://doi.org/10.1145/1487632.1487646",
      "doi": "10.1145/1487632.1487646"
    },
    {
      "text": "Rosi Braidotti. 2013. The posthuman. Polity Press, Cambridge, UK ; Malden, MA, USA.",
      "doi": ""
    },
    {
      "text": "Kelly Bronson. 2019. Looking through a responsible innovation lens at uneven engagements with digital farming. NJAS - Wageningen Journal of Life Sciences 90–91, (December 2019), 100294. DOI:https://doi.org/10.1016/j.njas.2019.03.001",
      "doi": ""
    },
    {
      "text": "Kelly Bronson. 2022. The Immaculate Conception of Data: Agribusiness, Activists, and Their Shared Politics of the Future. McGill-Queen's University Press.",
      "doi": ""
    },
    {
      "text": "Frederick H. Buttel, Gilbert W. Gillespie, Rhonda Janke, Brian Caldwell, and Marianne Sarrantonio. 1986. Reduced-input agricultural systems: Rationale and prospects. Am J Alt Ag 1, 2 (1986), 58–64. DOI:https://doi.org/10.1017/S0889189300000898",
      "doi": ""
    },
    {
      "text": "Michael Carolan. 2020. Automated agrifood futures: Robotics, labor and the distributive politics of digital agriculture. The Journal of Peasant Studies 47, 1 (January 2020), 184–207. DOI:https://doi.org/10.1080/03066150.2019.1584189",
      "doi": ""
    },
    {
      "text": "Rachel Carson. 2002. Silent spring (40th anniversary ed., 1st Mariner Books ed ed.). Houghton Mifflin, Boston.",
      "doi": ""
    },
    {
      "text": "Paula Jean M. Castro, Jasmin A. Caliwag, Roxanne A. Pagaduan, Joshua M. Arpia, and Gracelyn I. Delmita. 2019. A Mobile Application for Organic Farming Assistance Techniques using Time-Series Algorithm. In Proceedings of the 2019 2nd International Conference on Information Science and Systems, ACM, Tokyo Japan, 120–124. DOI:https://doi.org/10.1145/3322645.3322697",
      "doi": "10.1145/3322645.3322697"
    },
    {
      "text": "Bidisha Chaudhuri, Linus Kendall, Janaki Srinivasan, Onkar Hoysala, and Purnabha Dasgupta. 2017. Understanding capabilities through everyday practice: The case of a weather information system for farmers in West Bengal. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development, ACM, Lahore Pakistan, 1–10. DOI:https://doi.org/10.1145/3136560.3136578",
      "doi": "10.1145/3136560.3136578"
    },
    {
      "text": "Simran Chopra, Rachel Clarke, Clara Crivellaro, Adrian Clear, Sara Heitlinger, and Ozge Dilaver. 2022. Infrastructuring ecological sustainability through multi-scalar speculations. In Participatory Design Conference 2022: Volume 1, ACM, Newcastle upon Tyne United Kingdom, 13–25. DOI:https://doi.org/10.1145/3536169.3537776",
      "doi": "10.1145/3536169.3537776"
    },
    {
      "text": "Simran Chopra, Rachel E Clarke, Adrian K Clear, Sara Heitlinger, Ozge Dilaver, and Christina Vasiliou. 2022. Negotiating sustainable futures in communities through participatory speculative design and experiments in living. In CHI Conference on Human Factors in Computing Systems, ACM, New Orleans LA USA, 1–17. DOI:https://doi.org/10.1145/3491102.3501929",
      "doi": "10.1145/3491102.3501929"
    },
    {
      "text": "Lars Rune Christensen, Hasib Ahsan, and Eshrat Akand. 2018. Krishi Kontho: an agricultural information service in Bangladesh. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction, ACM, Oslo Norway, 203–214. DOI:https://doi.org/10.1145/3240167.3240225",
      "doi": "10.1145/3240167.3240225"
    },
    {
      "text": "Lars Rune Christensen, Hasib Ahsan, Mamunur Rashid, and Badal Kumar Das. 2019. Are you magicians?: the collaborative work of an agricultural information service. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development, ACM, Ahmedabad India, 1–10. DOI:https://doi.org/10.1145/3287098.3287109",
      "doi": "10.1145/3287098.3287109"
    },
    {
      "text": "Jennifer Clapp. 2012. Food. Polity, Cambridge.",
      "doi": ""
    },
    {
      "text": "Jennifer Clapp and Sarah-Louise Ruder. 2020. Precision Technologies for Agriculture: Digital Farming, Gene-Edited Crops, and the Politics of Sustainability. Global Environmental Politics 20, 3 (August 2020), 49–69. DOI:https://doi.org/10.1162/glep_a_00566",
      "doi": ""
    },
    {
      "text": "Torkil Clemmensen, Morten Hertzum, and Jose Abdelnour-Nocera. 2020. Ordinary User Experiences at Work: A Study of Greenhouse Growers. ACM Trans. Comput.-Hum. Interact. 27, 3 (June 2020), 1–31. DOI:https://doi.org/10.1145/3386089",
      "doi": "10.1145/3386089"
    },
    {
      "text": "Willard W. Cochrane. 1958. Farm Prices: Myth and Reality. University of Minnesota Press, Minnesota.",
      "doi": ""
    },
    {
      "text": "Sammy Comer, Enefiok Ekanem, Safdar Muhammad, Surendra P. Singh, and Fisseha Tegegne. 1999. Sustainable and Conventional Farmers: A Comparison of Socio-Economic Characteristics, Attitude, and Beliefs. Journal of Sustainable Agriculture 15, 1 (November 1999), 29–45. DOI:https://doi.org/10.1300/J064v15n01_04",
      "doi": ""
    },
    {
      "text": "Nick Cullather. 2010. The hungry world: America's Cold War battle against poverty in Asia. Harvard University Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Aman Dalmia, Jerome White, Ankit Chaurasia, Vishal Agarwal, Rajesh Jain, Dhruvin Vora, Balasaheb Dhame, Raghu Dharmaraju, and Rahul Panicker. 2020. Pest Management In Cotton Farms: An AI-System Case Study from the Global South. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining, ACM, Virtual Event CA USA, 3119–3127. DOI:https://doi.org/10.1145/3394486.3403363",
      "doi": "10.1145/3394486.3403363"
    },
    {
      "text": "Definition of AGRICULTURE. Retrieved August 30, 2022 from https://www.merriam-webster.com/dictionary/agriculture",
      "doi": ""
    },
    {
      "text": "Sandya De Alwis, Bahadorreza Ofoghi, and Myung Hwan Na. 2022. Enhanced strawberry image classification using multi-task deep neural learning. In Proceedings of the 37th ACM/SIGAPP Symposium on Applied Computing, ACM, Virtual Event, 971–978. DOI:https://doi.org/10.1145/3477314.3506994",
      "doi": "10.1145/3477314.3506994"
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The Ins and Outs of HCI for Development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, San Jose California USA, 2220–2232. DOI:https://doi.org/10.1145/2858036.2858081",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Xiongna Deng, Jiandong Zhao, Tingting Lu, Lirong Dong, and Peng Huang. 2021. Visual Analysis of Chinese Rural E-commerce Research in Recent Ten Years. In 2021 The 3rd World Symposium on Software Engineering, ACM, Xiamen China, 120–126. DOI:https://doi.org/10.1145/3488838.3488859",
      "doi": "10.1145/3488838.3488859"
    },
    {
      "text": "Mrunal Dhaygude and Dipanjan Chakraborty. 2020. Rethinking Design of Digital Platforms for Emergent Users: Findings from a Study with Rural Indian Farmers. In IndiaHCI ’20: Proceedings of the 11th Indian Conference on Human-Computer Interaction, ACM, Online India, 62–69. DOI:https://doi.org/10.1145/3429290.3429297",
      "doi": "10.1145/3429290.3429297"
    },
    {
      "text": "Carol DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. April 10-15. Mapping the Landscape of Sustainable HCI. CHI 2010 (April 10-15).",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo and Tom Jenkins. 2017. Fruit Are Heavy: A Prototype Public IoT System to Support Urban Foraging. In Proceedings of the 2017 Conference on Designing Interactive Systems, ACM, Edinburgh United Kingdom, 541–553. DOI:https://doi.org/10.1145/3064663.3064748",
      "doi": "10.1145/3064663.3064748"
    },
    {
      "text": "Francis Dittoh, Chris van Aart, and Victor de Boer. 2013. Voice-based marketing for agricultural products: a case study in rural Northern Ghana. In Proceedings of the Sixth International Conference on Information and Communications Technologies and Development Notes - ICTD ’13 - volume 2, ACM Press, Cape Town, South Africa, 21–24. DOI:https://doi.org/10.1145/2517899.2517924",
      "doi": "10.1145/2517899.2517924"
    },
    {
      "text": "Francis Dittoh, Victor de Boer, Anna Bon, Wendelien Tuyp, and André Baart. 2020. Mr. Meteo: Providing Climate Information for the Unconnected. In 12th ACM Conference on Web Science Companion, ACM, Southampton United Kingdom, 20–25. DOI:https://doi.org/10.1145/3394332.3402824",
      "doi": "10.1145/3394332.3402824"
    },
    {
      "text": "Markéta Dolejšová, Sjef van Gaalen, Danielle Wilde, Paul Graham Raven, Sara Heitlinger, and Ann Light. 2020. Designing with More-than-Human Food Practices for Climate-Resilience. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference, ACM, Eindhoven Netherlands, 381–384. DOI:https://doi.org/10.1145/3393914.3395909",
      "doi": "10.1145/3393914.3395909"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, ACM, Brisbane QLD Australia, 656–671. DOI:https://doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Paul Dourish and Scott Mainwaring. 2012. Ubicomp's Colonial Impulse. In Ubicomp, ACM Digital Library, Pittsburgh, USA.",
      "doi": ""
    },
    {
      "text": "A. Edwards, R. Lal, Patrick Madden, Robert H. Miller, and Garfield J. House (Eds.). 2020. Sustainable agricultural systems (1st ed.). CRC Press, Boca Raton.",
      "doi": ""
    },
    {
      "text": "Edim Azom Emmanuel and Hippolyte N. Muyingi. 2010. A mobile commerce application for rural economy development: a case study for Dwesa. In Proceedings of the 2010 Annual Research Conference of the South African Institute of Computer Scientists and Information Technologists (SAICSIT '10). Association for Computing Machinery, New York, NY, USA, 58–66. h",
      "doi": ""
    },
    {
      "text": "Nathan Ensmenger. 2013. Computation, Materiality, and the Global Environment. IEEE Annals of the History of Computing (2013).",
      "doi": "10.1109/MAHC.2013.33"
    },
    {
      "text": "Nathan Ensmenger. 2018. The Environmental History of Computing. Technology and Culture 59, 4 (2018), S7–S33. DOI:https://doi.org/10.1353/tech.2018.0148",
      "doi": ""
    },
    {
      "text": "Geremy Farr-Wharton. 2019. Seed to Feed: Leveraging HCl and Capitalising on Office Environments to Grow Food. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction, ACM, Fremantle WA Australia, 53–63. DOI:https://doi.org/10.1145/3369457.3369462",
      "doi": "10.1145/3369457.3369462"
    },
    {
      "text": "Nancy Fraser. 2008. Abnormal Justice. Critical Inquiry 34, 3 (March 2008), 393–422. DOI:https://doi.org/10.1086/589478",
      "doi": ""
    },
    {
      "text": "William H. Friedland, Amy E. Barton, and Robert J. Thomas. 1981. Manufacturing green gold: Capital, labor, and technology in the lettuce industry. Cambridge UP, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "William N Friedland, Lawrence Busch, Frederick H Buttel, and Alan P Rudy. 1991. Towards a new political economy of agriculture. Westview Press, Boulder, CO.",
      "doi": ""
    },
    {
      "text": "Harriet Friedman and Philip McMichael. 1989. Agriculture and the state system: The rise and decline of national agricultures, 1870 to the present. Sociologia Ruralis 29, 2 (August 1989), 93–117. DOI:https://doi.org/10.1111/j.1467-9523.1989.tb00360.x",
      "doi": ""
    },
    {
      "text": "Syed Taha Bilal Gilani, Ahmed Shahzad, Shahzaib Ahmad Malik, Rana Abdul Haseeb, Beenish Fatima, and Amna Batool. 2019. Improving financial condition of small scale farmers through mobile based crop suggestion services. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development, ACM, Ahmedabad India, 1–5. DOI:https://doi.org/10.1145/3287098.3287146",
      "doi": "10.1145/3287098.3287146"
    },
    {
      "text": "D Goodman, B Sorj, and J Wilkinson. 1987. From farming to biotechnology: A theory of agro-industrial development. Basil Blackwell, New York.",
      "doi": ""
    },
    {
      "text": "Julie Guthman. 2017. Paradoxes of the Border: Labor Shortages and Farmworker Minor Agency in Reworking California's Strawberry Fields. Economic Geography 93, 1 (January 2017), 24–43. DOI:https://doi.org/10.1080/00130095.2016.1180241",
      "doi": ""
    },
    {
      "text": "Hugo Hadjur, Doreid Ammar, and Laurent Lefèvre. 2020. Analysis of energy consumption in a precision beekeeping system. In Proceedings of the 10th International Conference on the Internet of Things, ACM, Malmö Sweden, 1–8. DOI:https://doi.org/10.1145/3410992.3411010",
      "doi": "10.1145/3410992.3411010"
    },
    {
      "text": "Maria Håkansson and Phoebe Sengers. 2014. No easy compromise: sustainability and the dilemmas and dynamics of change. In Proceedings of the 2014 conference on Designing interactive systems, ACM, Vancouver BC Canada, 1025–1034. DOI:https://doi.org/10.1145/2598510.2598569",
      "doi": "10.1145/2598510.2598569"
    },
    {
      "text": "Benjamin V. Hanrahan, Carleen Maitland, Timothy Brown, Anita Chen, Fraterne Kagame, and Beatrice Birir. 2021. Agency and Extraction in Emerging Industrial Drone Applications: Imaginaries of Rwandan Farm Workers and Community Members. Proc. ACM Hum.-Comput. Interact. 4, CSCW3 (January 2021), 1–21. DOI:https://doi.org/10.1145/3432932",
      "doi": "10.1145/3432932"
    },
    {
      "text": "Donna Haraway. 2003. The companion species manifesto: dogs, people, and significant otherness. Prickly Paradigm Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2016. Staying with the trouble: making kin in the Chthulucene. Duke University Press, Durham London.",
      "doi": ""
    },
    {
      "text": "Jean Hardy, Dharma Dailey, Susan Wyche, and Norman Makoto Su. 2018. Rural computing: Beyond access and infrastructure. In Companion of the 2018 ACM conference on computer supported cooperative work and social computing (CSCW ’18), ACM, New York, NY, USA, 463–470. DOI:https://doi.org/10.1145/3272973.3273008",
      "doi": "10.1145/3272973.3273008"
    },
    {
      "text": "Jean Hardy, Chanda Phelan, Morgan Vigil-Hayes, Norman Makoto Su, Susan Wyche, and Phoebe Sengers. 2019. Designing from the rural. Interactions 26, 4 (June 2019), 37–41. DOI:https://doi.org/10.1145/3328487",
      "doi": "10.1145/3328487"
    },
    {
      "text": "Jean Hardy, Susan Wyche, and Tiffany Veinot. 2019. Rural HCI Research: Definitions, Distinctions, Methods, and Opportunities. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 1–33. DOI:https://doi.org/10.1145/3359298",
      "doi": "10.1145/3359298"
    },
    {
      "text": "Christopher G. Harris and Janet C. Achora. 2018. Designing ICT for Agriculture (ICT4A) Innovations for Smallholder Farmers: The Case of Uganda. In Proceedings of the XIX International Conference on Human Computer Interaction, ACM, Palma Spain, 1–9. DOI:https://doi.org/10.1145/3233824.3233830",
      "doi": "10.1145/3233824.3233830"
    },
    {
      "text": "Steve Harrison, Phoebe Sengers, and Deborah Tatar. 2011. Making epistemological trouble: Third-paradigm HCI as successor science. Interacting with Computers 23, 5 (September 2011), 385–392. DOI:https://doi.org/10.1016/j.intcom.2011.03.005",
      "doi": "10.1016/j.intcom.2011.03.005"
    },
    {
      "text": "N. Katherine Hayles. 1999. How we became posthuman: virtual bodies in cybernetics, literature, and informatics. University of Chicago Press, Chicago, Ill.",
      "doi": "10.5555/553246"
    },
    {
      "text": "J. Heckman. 2006. A history of organic farming: Transitions from Sir Albert Howard's War in the Soil to USDA National Organic Program. Renew. Agric. Food Syst. 21, 3 (September 2006), 143–150. DOI:https://doi.org/10.1079/RAF2005126",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Rob Comber. 2018. Connected seeds and sensors: co-designing internet of things for sustainable smart cities with urban food-growing communities. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial - Volume 2, ACM, Hasselt and Genk Belgium, 1–5. DOI:https://doi.org/10.1145/3210604.3210620",
      "doi": "10.1145/3210604.3210620"
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for grassroots urban food-growing communities. In Proceedings of the 25th Australian Computer-Human Interaction Conference on Augmentation, Application, Innovation, Collaboration - OzCHI ’13, ACM Press, Adelaide, Australia, 255–264. DOI:https://doi.org/10.1145/2541016.2541023",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Sara Heitlinger, Rachel Clarke, Adrian K. Clear, Simran Chopra, and Özge Dilaver. 2019. Co-Creating “Smart” Sustainable Food Futures with Urban Food Growers. In Proceedings of the 9th International Conference on Communities & Technologies - Transforming Communities, ACM, Vienna Austria, 114–120. DOI:https://doi.org/10.1145/3328320.3328399",
      "doi": "10.1145/3328320.3328399"
    },
    {
      "text": "Sara Heitlinger, Lara Houston, Alex Taylor, and Ruth Catlow. 2021. Algorithmic Food Justice: Co-Designing More-than-Human Blockchain Futures for the Food Commons. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–17. DOI:https://doi.org/10.1145/3411764.3445655",
      "doi": "10.1145/3411764.3445655"
    },
    {
      "text": "Zhuoling Huang, Genki Miyauchi, Adrian Salazar Gomez, Richie Bird, Amar Singh Kalsi, Chipp Jansen, Zeyang Liu, Simon Parsons, and Elizabeth Sklar. 2020. Toward Robot Co-Labourers for Intelligent Farming. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction, ACM, Cambridge United Kingdom, 263–265. DOI:https://doi.org/10.1145/3371382.3378333",
      "doi": "10.1145/3371382.3378333"
    },
    {
      "text": "Zhuoling Huang, Elizabeth Sklar, and Simon Parsons. 2020. Design of Automatic Strawberry Harvest Robot Suitable in Complex Environments. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction, ACM, Cambridge United Kingdom, 567–569. DOI:https://doi.org/10.1145/3371382.3377443",
      "doi": "10.1145/3371382.3377443"
    },
    {
      "text": "Fahad Idrees, Amna Batool, and Junaid Qadir. 2017. Weather Forecast Information Dissemination Design For Low-Literate Farmers: An Exploratory Study. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development, ACM, Lahore Pakistan, 1–5. DOI:https://doi.org/10.1145/3136560.3136596",
      "doi": "10.1145/3136560.3136596"
    },
    {
      "text": "Fahad Idrees, Junaid Qadir, Hamid Mehmood, Saeed Ul Hassan, and Amna Batool. 2019. Urdu language based information dissemination system for low-literate farmers. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development, ACM, Ahmedabad India, 1–5. DOI:https://doi.org/10.1145/3287098.3287126",
      "doi": "10.1145/3287098.3287126"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10, ACM Press, Atlanta, Georgia, USA, 1311. DOI:https://doi.org/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Md. Ariful Islam, Md. Antonin Islam, Md Saef Ullah Miah, and Abhijit Bhowmik. 2022. An automated monitoring and environmental control system for laboratory-scale cultivation of oyster mushrooms using the Internet of Agricultural Thing (IoAT). In Proceedings of the 2nd International Conference on Computing Advancements, ACM, Dhaka Bangladesh, 207–212. DOI:https://doi.org/10.1145/3542954.3542985",
      "doi": "10.1145/3542954.3542985"
    },
    {
      "text": "Mohit Jain, Pratyush Kumar, Ishita Bhansali, Q. Vera Liao, Khai Truong, and Shwetak Patel. 2018. FarmChat: A Conversational Agent to Answer Farmer Queries. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 4 (December 2018), 1–22. DOI:https://doi.org/10.1145/3287048",
      "doi": "10.1145/3287048"
    },
    {
      "text": "Guido Jansen, Nazli Cila, Marije Kanis, and Yanti Slaats. 2016. Attitudes Towards Vertical Farming at Home: A User Study. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM, San Jose California USA, 3091–3098. DOI:https://doi.org/10.1145/2851581.2892474",
      "doi": "10.1145/2851581.2892474"
    },
    {
      "text": "Sheila Jasanoff and Sang-Hyun Kim. 2009. Containing the Atom: Sociotechnical Imaginaries and Nuclear Power in the United States and South Korea. Minerva 47, 2 (June 2009), 119–146. DOI:https://doi.org/10.1007/s11024-009-9124-4",
      "doi": ""
    },
    {
      "text": "Sheila Jasanoff and Sang-Hyun Kim (Eds.). 2015. Dreamscapes of modernity: sociotechnical imaginaries and the fabrication of power. The University of Chicago Press, Chicago ; London.",
      "doi": ""
    },
    {
      "text": "Os Keyes, Josephine Hoy, and Margaret Drouhard. 2019. Human-Computer Insurrection: Notes on an Anarchist HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–13. DOI:https://doi.org/10.1145/3290605.3300569",
      "doi": "10.1145/3290605.3300569"
    },
    {
      "text": "TaeHong Kim, YoonSeok Cha, SooHee Oh, Byungrae Cha, Sun Park, and JaeHyun Seo. 2020. Prototype of Strawberry Maturity-level Classification to Determine Harvesting Time of Strawberry. In The 9th International Conference on Smart Media and Applications, ACM, Jeju Republic of Korea, 126–129. DOI:https://doi.org/10.1145/3426020.3426050",
      "doi": "10.1145/3426020.3426050"
    },
    {
      "text": "Laurens Klerkx, Emma Jakku, and Pierece Labarthe. 2019. A review of social science on digital agriculture, smart farming and agriculture 4.0: New contributions and a future research agenda. NJAS - Wageningen Journal of Life Sciences (2019). DOI:https://doi.org/10.1016/j.njas.2019.100315",
      "doi": ""
    },
    {
      "text": "Laurens Klerkx and David Rose. 2020. Dealing with the game-changing technologies of Agriculture 4.0: how do we manage diversity and responsibility in food system transition pathways? Global Food Security 24, (2020). DOI:https://doi.org/10.1016/j.gfs.2019.100347",
      "doi": ""
    },
    {
      "text": "Mallika Kliangkhlao and Somchai Limsiroratana. 2019. Towards the Idea of Agricultural Market Understanding for Automatic Event Detection. In Proceedings of the 2019 8th International Conference on Software and Computer Applications, ACM, Penang Malaysia, 81–86. DOI:https://doi.org/10.1145/3316615.3316650",
      "doi": "10.1145/3316615.3316650"
    },
    {
      "text": "Jack Ralph Kloppenburg. 2004. First the seed: the political economy of plant biotechnology, 1492-2000 (2nd ed ed.). University of Wisconsin Press, Madison, Wis.",
      "doi": ""
    },
    {
      "text": "Dietrich W. Knorr and Tom R. Watkins (Eds.). 1984. Alterations in food production. Van Nostrand Reinhold, New York.",
      "doi": ""
    },
    {
      "text": "Bran Knowles, Oliver Bates, and Maria Håkansson. 2018. This Changes Sustainable HCI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–12. DOI:https://doi.org/10.1145/3173574.3174045",
      "doi": "10.1145/3173574.3174045"
    },
    {
      "text": "Thomas S. Kuhn. 1994. The structure of scientific revolutions (2. ed., enlarged, 21. print ed.). Univ. of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, William Odom, James Pierce, and Eric Paulos. 2011. Nurturing natural sensors. In Proceedings of the 13th international conference on Ubiquitous computing - UbiComp ’11, ACM Press, Beijing, China, 227. DOI:https://doi.org/10.1145/2030112.2030144",
      "doi": "10.1145/2030112.2030144"
    },
    {
      "text": "La Via Campesina | International Peasants’ Movement. Via Campesina English. Retrieved December 12, 2022 from https://viacampesina.org/en/",
      "doi": ""
    },
    {
      "text": "Alana Lajoie-O'Malley, Kelly Bronson, Simone van der Burg, and Laurens Klerkx. 2020. The future(s) of digital agriculture and sustainable food systems: An analysis of high-level policy documents. Ecosystem Services 45, (2020). DOI:https://doi.org/10.1016/j.ecoser.2020.101183",
      "doi": ""
    },
    {
      "text": "Marvin Landwehr, Philip Engelbutzeder, and Volker Wulf. 2021. Community Supported Agriculture: The Concept of Solidarity in Mitigating Between Harvests and Needs. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–13. DOI:https://doi.org/10.1145/3411764.3445268",
      "doi": "10.1145/3411764.3445268"
    },
    {
      "text": "Shaimaa Lazem, Danilo Giglitto, Makuochi Samuel Nkwo, Hafeni Mthoko, Jessica Upani, and Anicia Peters. 2021. Challenges and Paradoxes in Decolonising HCI: A Critical Discussion. Comput Supported Coop Work (July 2021). DOI:https://doi.org/10.1007/s10606-021-09398-0",
      "doi": "10.1007/s10606-021-09398-0"
    },
    {
      "text": "Yi-Ling Lee and Kuan-Chuan Tao. 2018. The Barriers and Key Breakthrough Factors for E-commerce Implementation for Small Agriculture Firms in Taiwan Rural Areas. In Proceedings of the 2nd International Conference on E-Society, E-Education and E-Technology - ICSET 2018, ACM Press, Taipei, Taiwan, 94–97. DOI:https://doi.org/10.1145/3268808.3268820",
      "doi": "10.1145/3268808.3268820"
    },
    {
      "text": "Gilly Leshed, Maria Håkansson, and Joseph “Jofish” Kaye. 2014. “Our life is the farm and farming is our life”: home-work coordination in organic farm families. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, Baltimore Maryland USA, 487–498. DOI:https://doi.org/10.1145/2531602.2531708",
      "doi": "10.1145/2531602.2531708"
    },
    {
      "text": "Gilly Leshed, Liza Mansbach, and Michael Huang. 2018. Designing for Transparency of Coffee Production Costs. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–6. DOI:https://doi.org/10.1145/3170427.3188508",
      "doi": "10.1145/3170427.3188508"
    },
    {
      "text": "Gilly Leshed, Masha Rosca, Michael Huang, Liza Mansbach, Yicheng Zhu, and Juan Nicolás Hernández-Aguilera. 2018. CalcuCafé: Designing for Collaboration Among Coffee Farmers to Calculate Costs of Production. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 1–26. DOI:https://doi.org/10.1145/3274418",
      "doi": "10.1145/3274418"
    },
    {
      "text": "Zheng Li. 2018. Status Analysis and Strategy research of E-Commerce Logistics of Henan Agricultural Products. In Proceedings of the 2018 1st International Conference on Internet and e-Business, ACM, Singapore Singapore, 19–22. DOI:https://doi.org/10.1145/3230348.3230408",
      "doi": "10.1145/3230348.3230408"
    },
    {
      "text": "Hang Li. 2021. Research and Prospect of crawler chassis of agricultural machinery in mountainous and hilly areas. In Proceedings of the 2021 International Conference on Control and Intelligent Robotics, ACM, Guangzhou China, 1–5. DOI:https://doi.org/10.1145/3473714.3473715",
      "doi": "10.1145/3473714.3473715"
    },
    {
      "text": "Zhihong Li and Dingbang Wu. 2022. Problems and Countermeasures of the E-commerce for the Agricultural Product in the Conditions of the Big Data in China. In 2022 8th International Conference on E-business and Mobile Commerce, ACM, Seoul Republic of Korea, 1–5. DOI:https://doi.org/10.1145/3543106.3543107",
      "doi": "10.1145/3543106.3543107"
    },
    {
      "text": "Jun Lin, Zhiqi Shen, Anting Zhang, and Yueting Chai. 2018. Blockchain and IoT based Food Traceability for Smart Agriculture. In Proceedings of the 3rd International Conference on Crowd Science and Engineering - ICCSE’18, ACM Press, Singapore, Singapore, 1–6. DOI:https://doi.org/10.1145/3265689.3265692",
      "doi": "10.1145/3265689.3265692"
    },
    {
      "text": "George Liodakis. 1997. Technological Change in Agriculture: A Marxist Critique. Sociologia Ruralis 37, 1 (April 1997), 61–78. DOI:https://doi.org/10.1111/1467-9523.00036",
      "doi": ""
    },
    {
      "text": "Jen Liu, Daragh Byrne, and Laura Devendorf. 2018. Design for Collaborative Survival: An Inquiry into Human-Fungi Relationships. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–13. DOI:https://doi.org/10.1145/3173574.3173614",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Jen Liu and Phoebe Sengers. 2021. Legibility and the Legacy of Racialized Dispossession in Digital Agriculture. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (October 2021), 1–21. DOI:https://doi.org/10.1145/3479867",
      "doi": "10.1145/3479867"
    },
    {
      "text": "Szu-Yu (Cyn) Liu. 2019. Designing with, through, and for Human-Nature Interaction. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion, ACM, San Diego CA USA, 101–104. DOI:https://doi.org/10.1145/3301019.3324874",
      "doi": "10.1145/3301019.3324874"
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Out of control: reframing sustainable HCI using permaculture. In Proceedings of the 2018 Workshop on Computing within Limits, ACM, Toronto Ontario Canada, 1–8. DOI:https://doi.org/10.1145/3232617.3232625",
      "doi": "10.1145/3232617.3232625"
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2019. Symbiotic Encounters: HCI and Sustainable Agriculture. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–13. DOI:https://doi.org/10.1145/3290605.3300547",
      "doi": "10.1145/3290605.3300547"
    },
    {
      "text": "William Lockeretz (Ed.). 2007. Organic farming: an international history. CABI, Wallingford, UK ; Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Danli Luo, Jianzhe Gu, Fang Qin, Guanyun Wang, and Lining Yao. 2020. E-seed: Shape-Changing Interfaces that Self Drill. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology, ACM, Virtual Event USA, 45–57. DOI:https://doi.org/10.1145/3379337.3415855",
      "doi": "10.1145/3379337.3415855"
    },
    {
      "text": "Peter Lyle, Jaz Hee-jeong Choi, and Marcus Foth. 2014. Designing for grassroots food production: an event-based urban agriculture community. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design, ACM, Sydney New South Wales Australia, 362–365. DOI:https://doi.org/10.1145/2686612.2686666s",
      "doi": ""
    },
    {
      "text": "Peter Lyle, Jaz Hee-jeong Choi, and Marcus Foth. 2015. Growing food in the city: design ideations for urban residential gardeners. In Proceedings of the 7th International Conference on Communities and Technologies, ACM, Limerick Ireland, 89–97. DOI:https://doi.org/10.1145/2768545.2768549",
      "doi": "10.1145/2768545.2768549"
    },
    {
      "text": "Wei Ma, Kendall Nowocin, Niraj Marathe, and George H. Chen. 2019. An interpretable produce price forecasting system for small and marginal farmers in India using collaborative filtering and adaptive nearest neighbors. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development, ACM, Ahmedabad India, 1–11. DOI:https://doi.org/10.1145/3287098.3287100",
      "doi": "10.1145/3287098.3287100"
    },
    {
      "text": "Lovish Madaan, Ankur Sharma, Praneet Khandelwal, Shivank Goel, Parag Singla, and Aaditeshwar Seth. 2019. Price forecasting & anomaly detection for agricultural commodities in India. In Proceedings of the Conference on Computing & Sustainable Societies  - COMPASS 19, ACM Press, Accra, Ghana, 52–64. DOI:https://doi.org/10.1145/3314344.3332488",
      "doi": "10.1145/3314344.3332488"
    },
    {
      "text": "Aditi Maheshwari, Abhay Kumar Aggarwal, and Andreea Danielescu. 2022. Designing Tools and Interfaces for Ecological Restoration: An Investigation into the Opportunities and Constraints for Technological Interventions. In CHI Conference on Human Factors in Computing Systems, ACM, New Orleans LA USA, 1–17. DOI:https://doi.org/10.1145/3491102.3517664",
      "doi": "10.1145/3491102.3517664"
    },
    {
      "text": "Jennifer Mankoff, Robin Kravets, and Eli Blevis. 2008. Some Computer Science Issues in Creating a Sustainable World. Computer 41, 8 (August 2008), 102–105. DOI:https://doi.org/10.1109/MC.2008.307",
      "doi": "10.1109/MC.2008.307"
    },
    {
      "text": "Atsunori Maruyama and Keitaro Naruse. 2015. Feasibility Study of Weeding Robots in Rice Fields Inspired by Natural Ducks. In Proceedings of the 8th International Conference on Bio-inspired Information and Communications Technologies (formerly BIONETICS), ACM, Boston, United States. DOI:https://doi.org/10.4108/icst.bict.2014.257897",
      "doi": "10.4108/icst.bict.2014.257897"
    },
    {
      "text": "Gurpreet Singh Matharu, Anju Mishra, and Pallavi Chhikara. 2014. A Framework to leverage Cloud for Modernization of Indian Agricultural Produce Marketing System. In Proceedings of the 2014 International Conference on Information and Communication Technology for Competitive Strategies - ICTCS ’14, ACM Press, Udaipur, Rajasthan, India, 1–7. DOI:https://doi.org/10.1145/2677855.2677862",
      "doi": "10.1145/2677855.2677862"
    },
    {
      "text": "Janet McLaughlin. 2010. Classifying the “ideal migrant worker.” Focaal 2010, 57 (June 2010), 79–94. DOI:https://doi.org/10.3167/fcl.2010.570106",
      "doi": ""
    },
    {
      "text": "Juzlinda Mohd Ghazali, Mohd Shahrul Nizam Mohd Danuri, Helyawati Baharudin, Nurul Ibtisam Yaacob, Siti Noor Ahmad, and Nor Musliza Mustafa. 2021. A Survey on Factors Influencing Digital Agriculture Adoption. In The 5th International Conference on Future Networks & Distributed Systems, ACM, Dubai United Arab Emirates, 356–360. DOI:https://doi.org/10.1145/3508072.3508130",
      "doi": "10.1145/3508072.3508130"
    },
    {
      "text": "Leonida Mutuku, Kennedy Kirui, and Mark Kamau. 2014. ShambaConnect: case study on the hybrid design of an application for Kenyan extension officers. In Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - PDC ’14 - volume 2, ACM Press, Windhoek, Namibia, 57–61. DOI:https://doi.org/10.1145/2662155.2662191",
      "doi": "10.1145/2662155.2662191"
    },
    {
      "text": "Khanista Namee, Chumpol Kamjumpol, and Witoon Pimsiri. 2020. Development of Smart Vegetable Growing Cabinet with IoT, Edge Computing and Cloud Computing. In 2020 2nd International Conference on Image Processing and Machine Vision, ACM, Bangkok Thailand, 47–52. DOI:https://doi.org/10.1145/3421558.3421588",
      "doi": "10.1145/3421558.3421588"
    },
    {
      "text": "Daniel Ninsiima. 2015. “Buuza Omulimisa” (ask the extension officer): text messaging for low literate farming communities in rural Uganda. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development, ACM, Singapore Singapore, 1–4. DOI:https://doi.org/10.1145/2737856.2737908",
      "doi": "10.1145/2737856.2737908"
    },
    {
      "text": "Yoshiaki Nishikawa and Michel Pimbert (Eds.). 2022. Seeds for Diversity and Inclusion: Agroecology and Endogenous Development. Springer International Publishing, Cham. DOI:https://doi.org/10.1007/978-3-030-89405-4",
      "doi": ""
    },
    {
      "text": "Juliet Norton, Birgit Penzenstadler, Samantha McDonald, Emily Kang, Nora Koirala, Rieko Konishi, Gabriela Pena Carmona, Jainee Shah, Sebastian Troncoso, and Bill Tomlinson. 2019. The SAGE Community Coordinator: A Demonstration. In Proceedings of the Fifth Workshop on Computing within Limits, ACM, Lappeenranta Finland, 1–10. DOI:https://doi.org/10.1145/3338103.3338108",
      "doi": "10.1145/3338103.3338108"
    },
    {
      "text": "Juliet Norton, Birgit Penzenstadler, and Bill Tomlinson. 2019. Implications of Grassroots Sustainable Agriculture Community Values on the Design of Information Systems. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 1–22. DOI:https://doi.org/10.1145/3359136",
      "doi": "10.1145/3359136"
    },
    {
      "text": "William Odom. 2010. “Mate, we don't need a chip to tell us the soil's dry”: opportunities for designing interactive systems to support urban food production. In Proceedings of the 8th ACM Conference on Designing Interactive Systems - DIS ’10, ACM Press, Aarhus, Denmark, 232. DOI:https://doi.org/10.1145/1858171.1858211",
      "doi": "10.1145/1858171.1858211"
    },
    {
      "text": "Erick Oduor, Peninah Waweru, Jonathan Lenchner, and Carman Neustaedter. 2018. Practices and Technology Needs of a Network of Farmers in Tharaka Nithi, Kenya. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, Montreal QC Canada, 1–11. DOI:https://doi.org/10.1145/3173574.3173613",
      "doi": "10.1145/3173574.3173613"
    },
    {
      "text": "Kweku Opoku-Agyemang, Bhaumik Shah, and Tapan S. Parikh. 2017. Scaling Up Peer Education with Farmers in India. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development, ACM, Lahore Pakistan, 1–10. DOI:https://doi.org/10.1145/3136560.3136567",
      "doi": "10.1145/3136560.3136567"
    },
    {
      "text": "Elisa Oreglia. 2013. When technology doesn't fit: information sharing practices among farmers in rural China. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1, ACM, Cape Town South Africa, 165–176. DOI:https://doi.org/10.1145/2516604.2516610",
      "doi": "10.1145/2516604.2516610"
    },
    {
      "text": "Tapan S. Parikh, Neil Patel, and Yael Schwartzman. 2007. A survey of information systems reaching small producers in global agricultural value chains. In 2007 International Conference on Information and Communication Technologies and Development, IEEE, Bangalore, India, 1–11. DOI:https://doi.org/10.1109/ICTD.2007.4937421",
      "doi": ""
    },
    {
      "text": "Mihirkumar S. Patel and Ranjith Pillai R. 2019. Design of an Autonomous Weed Removal System. In Proceedings of the Advances in Robotics 2019, ACM, Chennai India, 1–6. DOI:https://doi.org/10.1145/3352593.3352674",
      "doi": "10.1145/3352593.3352674"
    },
    {
      "text": "Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan S. Parikh. 2010. Avaaj Otalo: a field study of an interactive voice forum for small farmers in rural India. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10, ACM Press, Atlanta, Georgia, USA, 733. DOI:https://doi.org/10.1145/1753326.1753434",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Neil Patel, Kapil Shah, Krishna Savani, Scott R. Klemmer, Paresh Dave, and Tapan S. Parikh. 2012. Power to the peers: authority of source effects for a voice-based agricultural information service in rural India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development - ICTD ’12, ACM Press, Atlanta, Georgia, 169. DOI:https://doi.org/10.1145/2160673.2160696",
      "doi": "10.1145/2160673.2160696"
    },
    {
      "text": "Anton Poikolainen Rosén, Maria Normark, and Mikael Wiberg. 2020. Relating to the Environment Through Photography: The Smartphone Camera as a Tool in Urban Farming. In 32nd Australian Conference on Human-Computer Interaction, ACM, Sydney NSW Australia, 506–519. DOI:https://doi.org/10.1145/3441000.3441026",
      "doi": "10.1145/3441000.3441026"
    },
    {
      "text": "Larissa Pschetz, Billy Dixon, Kruakae Pothong, Arlene Bailey, Allister Glean, Luis Lourenço Soares, and Jessica A. Enright. 2020. Designing Distributed Ledger Technologies for Social Change: The Case of CariCrop. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–12. DOI:https://doi.org/10.1145/3313831.3376364",
      "doi": "10.1145/3313831.3376364"
    },
    {
      "text": "María Puig de la Bellacasa. 2017. Matters of care: speculative ethics in more than human worlds. University of Minnesota Press, Minneapolis.",
      "doi": ""
    },
    {
      "text": "Barath Raghavan, Bonnie Nardi, Sarah T. Lovell, Juliet Norton, Bill Tomlinson, and Donald J. Patterson. 2016. Computational Agroecology: Sustainable Food Ecosystem Design. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM, San Jose California USA, 423–435. DOI:https://doi.org/10.1145/2851581.2892577",
      "doi": "10.1145/2851581.2892577"
    },
    {
      "text": "George Rapsomanikis. The economic lives of smallholder farmers. 48.",
      "doi": ""
    },
    {
      "text": "Ankita Raturi, Juliet Norton, Bill Tomlinson, Eli Blevis, and Lynn Dombrowski. 2017. Designing Sustainable Food Systems. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM, Denver Colorado USA, 609–616. DOI:https://doi.org/10.1145/3027063.3027075",
      "doi": "10.1145/3027063.3027075"
    },
    {
      "text": "Waleed Riaz, Haris Durrani, Suleman Shahid, and Agha Ali Raza. 2017. ICT Intervention for Agriculture Development: Designing an IVR System for Farmers in Pakistan. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development, ACM, Lahore Pakistan, 1–5. DOI:https://doi.org/10.1145/3136560.3136598",
      "doi": "10.1145/3136560.3136598"
    },
    {
      "text": "Vincent Ricciardi, Navin Ramankutty, Zia Mehrabi, Larissa Jarvis, and Brenton Chookolingo. 2018. How much of the world's food do smallholders produce? Global Food Security 17, (June 2018), 64–72. DOI:https://doi.org/10.1016/j.gfs.2018.05.002",
      "doi": ""
    },
    {
      "text": "David C. Rose, Carol Morris, Matt Lobley, Michael Winter, William J. Sutherland, and Lynn V. Dicks. 2018. Exploring the spatialities of technological and user re-scripting: The case of decision support tools in UK agriculture. Geoforum 89, (February 2018), 11–18. DOI:https://doi.org/10.1016/j.geoforum.2017.12.006",
      "doi": ""
    },
    {
      "text": "David C. Rose and Jason Chilvers. 2018. Agriculture 4.0: Broadening Responsible Innovation in an Era of Smart Farming. Front. Sustain. Food Syst. 2, (December 2018), 87. DOI:https://doi.org/10.3389/fsufs.2018.00087",
      "doi": ""
    },
    {
      "text": "Gloire Rubambiza, Phoebe Sengers, and Hakim Weatherspoon. 2021. Paradoxes in Producing the Future of Farm Work: Anticipating Social Impact through the Lens of Early Adopters. In AutomationXP@CHI.",
      "doi": ""
    },
    {
      "text": "Gloire Rubambiza, Phoebe Sengers, and Hakim Weatherspoon. 2022. Seamless Visions, Seamful Realities: Anticipating Rural Infrastructural Fragility in Early Design of Digital Agriculture. CHI Conference on Human Factors in Computing Systems (CHI ’22) (2022).",
      "doi": ""
    },
    {
      "text": "M. Saravanan and Satheesh K. Perepu. 2018. Focusing Social Media Based Analytics for Plant Diseases in Smart Agriculture. In Proceedings of the 5th Multidisciplinary International Social Networks Conference on - MISNC ’18, ACM Press, Saint-Etienne, France, 1–7. DOI:https://doi.org/10.1145/3227696.3227720",
      "doi": "10.1145/3227696.3227720"
    },
    {
      "text": "Vic Satzewich. 1991. Racism and the incorporation of foreign labour: farm labour migration to Canada since 1945. Routledge, London ; New York.",
      "doi": ""
    },
    {
      "text": "Emrys Schoemaker, Reem Talhouk, Catherine Kamanu, Eoghan McDonaugh, Chris McDonaugh, Eliza Casey, Adam Wills, Finn Richardson, and Jonathan Donner. 2022. Social Agriculture: Examining the Affordances of Social Media for Agricultural Practices. In ACM SIGCAS/SIGCHI Conference on Computing and Sustainable Societies (COMPASS), ACM, Seattle WA USA, 476–489. DOI:https://doi.org/10.1145/3530190.3534806",
      "doi": "10.1145/3530190.3534806"
    },
    {
      "text": "Zhonghua Shen, Wanwei Chen, and Zhikang Dong. 2021. Research on Walking Speed of Sugarcane Harvester Based on Machine Vision. In 2021 6th International Conference on Intelligent Information Processing, ACM, Bucharest Romania, 309–312. DOI:https://doi.org/10.1145/3480571.3480627",
      "doi": "10.1145/3480571.3480627"
    },
    {
      "text": "Vandana Shiva. 2016. The violence of the Green Revolution: Third World agriculture, ecology and politics. University Press of Kentucky, Lexington.",
      "doi": ""
    },
    {
      "text": "Robert Soden, Pradnaya Pathak, and Olivia Doggett. 2021. What We Speculate About When We Speculate About Sustainable HCI. In ACM SIGCAS Conference on Computing and Sustainable Societies (COMPASS), ACM, Virtual Event Australia, 188–198. DOI:https://doi.org/10.1145/3460112.3471956",
      "doi": "10.1145/3460112.3471956"
    },
    {
      "text": "Robert Soden, David Ribes, Seyram Avle, and Will Sutherland. 2021. Time for historicism in CSCW: An invitation. Proceedings of the ACM on Human-Computer Interaction. 2021 Oct 18;5 (CSCW2):1-8.",
      "doi": "10.1145/3479603"
    },
    {
      "text": "Statistics Canada Government of Canada. 2020. Agricultural employees, 2016 to 2018. Retrieved September 14, 2022 from https://www150.statcan.gc.ca/n1/pub/11-627-m/11-627-m2020033-eng.htm",
      "doi": ""
    },
    {
      "text": "Charles Steinfield, Susan Wyche, Tian Cai, and Hastings Chiwasa. 2015. The mobile divide revisited: mobile phone use by smallholder farmers in Malawi. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development, ACM, Singapore Singapore, 1–9. DOI:https://doi.org/10.1145/2737856.2738022",
      "doi": "10.1145/2737856.2738022"
    },
    {
      "text": "Rosemary Steup, Lynn Dombrowski, and Norman Makoto Su. 2019. Feeding the World with Data: Visions of Data-Driven Farming. DIS (2019), 1503–1515. DOI:http://dx.doi.org/10.1145/3322276.3322382",
      "doi": "10.1145/3322276.3322382"
    },
    {
      "text": "Rosemary Steup, Arvind Santhanam, Marisa Logan, Lynn Dombrowski, and Norman Makoto Su. 2018. Growing Tiny Publics: Small Farmers’ Social Movement Strategies. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 1–24. DOI:https://doi.org/10.1145/3274434",
      "doi": "10.1145/3274434"
    },
    {
      "text": "Amine Mohammed Taberkit, Ahmed Kechida, and Abdelmalek Bouguettaya. 2021. Algerian Perspectives for UAV-based Remote Sensing Technologies and Artificial Intelligence in Precision Agriculture. In The 4th International Conference on Networking, Information Systems amp Security., ACM, KENITRA AA Morocco, 1–9. DOI:https://doi.org/10.1145/3454127.3457637",
      "doi": "10.1145/3454127.3457637"
    },
    {
      "text": "Riki Tatsuta, Dinh Thi Dong Phuong, Yusuke Kajiwara, and Hiromitsu Shimakawa. 2017. Guidance of Farming Works to Improve Efficiency Considering Physical Behavior. In Proceedings of the 9th International Conference on Machine Learning and Computing, ACM, Singapore Singapore, 28–32. DOI:https://doi.org/10.1145/3055635.3056616",
      "doi": "10.1145/3055635.3056616"
    },
    {
      "text": "Alex S. Taylor. 2011. Out there. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Vancouver BC Canada, 685–694. DOI:https://doi.org/10.1145/1978942.1979042",
      "doi": "10.1145/1978942.1979042"
    },
    {
      "text": "Kentaro Toyama. 2010. Human Computer Interaction and Global Development. Found. Trends Hum.-Comput. Interact. 4, 1 (January 2010), 1–79. DOI:https://doi.org/10.1561/1100000021",
      "doi": "10.1561/1100000021"
    },
    {
      "text": "Kentaro Toyama. 2018. From needs to aspirations in information technology for development. Information Technology for Development 24, 1 (January 2018), 15–36. DOI:https://doi.org/10.1080/02681102.2017.1310713",
      "doi": ""
    },
    {
      "text": "United Nations High Commissioner for Refugees. Climate change and disaster displacement. UNHCR. Retrieved September 15, 2022 from https://www.unhcr.org/climate-change-and-disasters.html",
      "doi": ""
    },
    {
      "text": "Viany Utami Tjhin and Regina Eka Riantini. 2022. Smart Farming: Implementation of Industry 4.0 in the Agricultural Sector. In 2022 6th International Conference on E-Commerce, E-Business and E-Government, ACM, Plymouth United Kingdom, 115–120. DOI:https://doi.org/10.1145/3537693.3537711",
      "doi": "10.1145/3537693.3537711"
    },
    {
      "text": "Kellie Vella, Bernd Ploderer, and Margot Brereton. 2021. Human-Nature Relations in Urban Gardens: Explorations with Camera Traps. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–13. DOI:https://doi.org/10.1145/3411764.3445438",
      "doi": "10.1145/3411764.3445438"
    },
    {
      "text": "Chen Zhi Yuan and Sin Kai Ling. 2020. Long Short-Term Memory Model Based Agriculture Commodity Price Prediction Application. In Proceedings of the 2020 2nd International Conference on Information Technology and Computer Communications, ACM, Kuala Lumpur Malaysia, 43–49. DOI:https://doi.org/10.1145/3417473.3417481",
      "doi": "10.1145/3417473.3417481"
    },
    {
      "text": "Mikael Wiberg, Alex Taylor, and Daniela Rosner. 2022. Climate care. interactions 29, 1 (January 2022), 5–5. DOI:https://doi.org/10.1145/3507359",
      "doi": "10.1145/3507359"
    },
    {
      "text": "Langdon Winner. 1986. Do Artifacts Have Politics? Daedulus, MIT Press 109, 1 (1986), 121–136.",
      "doi": ""
    },
    {
      "text": "Susan P. Wyche, Melissa Densmore, and Brian Samuel Geyer. 2015. Real mobiles: Kenyan and Zambian smallholder farmers’ current attitudes towards mobile phones. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development, ACM, Singapore Singapore, 1–10. DOI:https://doi.org/10.1145/2737856.2738013",
      "doi": "10.1145/2737856.2738013"
    },
    {
      "text": "Mattia Zeni, Elizabeth Ondula, Reagan Mbitiru, Agnes Nyambura, Lianna Samuel, Kala Fleming, and Komminist Weldemariam. 2015. Low-power Low-cost Wireless Sensors for Real-time Plant Stress Detection. In Proceedings of the 2015 Annual Symposium on Computing for Development, ACM, London United Kingdom, 51–59. DOI:https://doi.org/10.1145/2830629.2830641",
      "doi": "10.1145/2830629.2830641"
    },
    {
      "text": "Liang Zhao, Leilei Chen, and Adnan Safi. 2022. Blockchain Technology in Post-Covid Agriculture. In 2022 5th International Conference on Computers in Management and Business (ICCMB), ACM, Singapore Singapore, 50–55. DOI:https://doi.org/10.1145/3512676.3512685",
      "doi": "10.1145/3512676.3512685"
    },
    {
      "text": "Mariya Zheleva, Petko Bogdanov, Daphney-Stravoula Zois, Wei Xiong, Ranveer Chandra, and Mark Kimball. 2017. Smallholder Agriculture in the Information Age: Limits and Opportunities. In Proceedings of the 2017 Workshop on Computing Within Limits, ACM, Santa Barbara California USA, 59–70. DOI:https://doi.org/10.1145/3080556.3080563",
      "doi": "10.1145/3080556.3080563"
    },
    {
      "text": "Matt Ziegler, Lokesh Garg, Shailesh Tiwary, Aditya Vashistha, and Kurtis Heimerl. 2019. Fresh insights: user research towards a market information service for bihari vegetable farmers. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development, ACM, Ahmedabad India, 1–11. DOI:https://doi.org/10.1145/3287098.3287115",
      "doi": "10.1145/3287098.3287115"
    },
    {
      "text": "Ilaria Zonda, Dan Xu, Mick Jongeling, and Gijs Huisman. 2019. Growkit: Using Technology to Support People Growing Food at Home. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, Glasgow Scotland Uk, 1–6. DOI:https://doi.org/10.1145/3290607.3312834",
      "doi": "10.1145/3290607.3312834"
    }
  ]
}