{
  "doi": "10.1145/3544548.3581303",
  "title": "Interaction Effects of Pedestrian Behavior, Smartphone Distraction and External Communication of Automated Vehicles on Crossing and Gaze Behavior",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "External communication of automated vehicles is proposed to replace driver-pedestrian communication in ambiguous crossing situations. So far, research has focused on simpler scenarios with one attentive pedestrian and one automated vehicle. This virtual reality study (N=115) investigates a more complex scenario with other crossing pedestrians, a distracting task on the smartphone, and external communication by the automated vehicle. Interaction effects were found for crossing duration, gaze behavior, and subjective measures. For attentive pedestrians, the external communication resulted in shorter crossing durations, higher perceived safety, as well as lower perceived criticality, cognitive workload, and effort. These positive effects were not found when pedestrians were distracted. Instead, distracted pedestrians benefited from other crossing pedestrians because they looked less at the stopping vehicle, felt safer, perceived the situation as less critical, and reported lower cognitive workload and effort. Pedestrians initiated crossings earlier with a group or external communication and later with a smartphone.",
  "authors": [
    {
      "name": "Mirjam Lanzer",
      "institution": "Human Factors, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659578764",
      "orcid": "0000-0001-9293-5783"
    },
    {
      "name": "Ina Koniakowsky",
      "institution": "Human Factors, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659886754",
      "orcid": "0000-0002-4075-1234"
    },
    {
      "name": "Mark Colley",
      "institution": "Institute of Media Informatics, Ulm University, Germany",
      "img": "/do/10.1145/contrib-99659260328/rel-imgonly/img_6166.jpg",
      "acmid": "99659260328",
      "orcid": "0000-0001-5207-5029"
    },
    {
      "name": "Martin Baumann",
      "institution": "Human Factors, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442595745",
      "orcid": "0000-0002-2668-2527"
    }
  ],
  "references": [
    {
      "text": "Linson J. Alapatt, Nancye M. Peel, Natasha Reid, Leonard C. Gray, and Ruth E. Hubbard. 2020. The Effect of Age on Gait Speed When Texting. International Journal of Environmental Research and Public Health 17, 2(2020), 599. https://doi.org/10.3390/ijerph17020599",
      "doi": ""
    },
    {
      "text": "Rushdi Alsaleh, Tarek Sayed, and Mohamed H. Zaki. 2018. Assessing the Effect of Pedestrians’ Use of Cell Phones on Their Walking Behavior: A Study Based on Automated Video Analysis. Transportation Research Record 2672, 35 (2018), 46–57. https://doi.org/10.1177/0361198118780708",
      "doi": ""
    },
    {
      "text": "Harley Amado, Sara Ferreira, José Pedro Tavares, Paulo Ribeiro, and Elisabete Freitas. 2020. Pedestrian–Vehicle Interaction at Unsignalized Crosswalks: A Systematic Review. Sustainability 12, 7 (2020), 2805. https://doi.org/10.3390/su12072805",
      "doi": ""
    },
    {
      "text": "Ashratuz Zavin Asha, Christopher Smith, Georgina Freeman, Sean Crump, Sowmya Somanath, Lora Oehlberg, and Ehud Sharlin. 2021. Co-Designing Interactions between Pedestrians in Wheelchairs and Autonomous Vehicles. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 339–351. https://doi.org/10.1145/3461778.3462068",
      "doi": "10.1145/3461778.3462068"
    },
    {
      "text": "P. Bazilinskyy, L. Kooijman, D. Dodou, and J.C.F. de Winter. 2021. How should external human-machine interfaces behave? Examining the effects of colour, position, message, activation distance, vehicle yielding, and visual distraction among 1,434 participants. Applied Ergonomics 95(2021), 103450. https://doi.org/10.1016/j.apergo.2021.103450",
      "doi": ""
    },
    {
      "text": "Katherine W. Byington and David C. Schwebel. 2013. Effects of mobile Internet use on college student pedestrian injury risk. Accident Analysis & Prevention 51 (2013), 78–83. https://doi.org/10.1016/j.aap.2012.11.001",
      "doi": ""
    },
    {
      "text": "Siyuan Chen, Julien Epps, Natalie Ruiz, and Fang Chen. 2011. Eye Activity as a Measure of Human Mental Effort in HCI. In Proceedings of the 16th International Conference on Intelligent User Interfaces (Palo Alto, CA, USA) (IUI ’11). Association for Computing Machinery, New York, NY, USA, 315–318. https://doi.org/10.1145/1943403.1943454",
      "doi": "10.1145/1943403.1943454"
    },
    {
      "text": "Mark Colley, Elvedin Bajrovic, and Enrico Rukzio. 2022. Effects of Pedestrian Behavior, Time Pressure, and Repeated Exposure on Crossing Decisions in Front of Automated Vehicles Equipped with External Communication. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 367, 11 pages. https://doi.org/10.1145/3491102.3517571",
      "doi": "10.1145/3491102.3517571"
    },
    {
      "text": "Mark Colley, Jan Henry Belz, and Enrico Rukzio. 2021. Investigating the Effects of Feedback Communication of Autonomous Vehicles. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Leeds, United Kingdom) (AutomotiveUI ’21). Association for Computing Machinery, New York, NY, USA, 263–273. https://doi.org/10.1145/3409118.3475133",
      "doi": "10.1145/3409118.3475133"
    },
    {
      "text": "Mark Colley, Christian Hummler, and Enrico Rukzio. 2022. Effects of mode distinction, user visibility, and vehicle appearance on mode confusion when interacting with highly automated vehicles. Transportation Research Part F: Traffic Psychology and Behaviour 89 (2022), 303–316. https://doi.org/10.1016/j.trf.2022.06.020",
      "doi": ""
    },
    {
      "text": "Mark Colley, Surong Li, and Enrico Rukzio. 2021. Increasing Pedestrian Safety Using External Communication of Autonomous Vehicles for Signalling Hazards. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction (Toulouse & Virtual, France) (MobileHCI ’21). Association for Computing Machinery, New York, NY, USA, Article 20, 10 pages. https://doi.org/10.1145/3447526.3472024",
      "doi": "10.1145/3447526.3472024"
    },
    {
      "text": "Mark Colley, Stefanos Can Mytilineos, Marcel Walch, Jan Gugenheimer, and Enrico Rukzio. 2020. Evaluating Highly Automated Trucks as Signaling Lights. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’20). Association for Computing Machinery, New York, NY, USA, 111–121. https://doi.org/10.1145/3409120.3410647",
      "doi": "10.1145/3409120.3410647"
    },
    {
      "text": "Mark Colley and Enrico Rukzio. 2020. A Design Space for External Communication of Autonomous Vehicles. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Virtual Event, DC, USA) (AutomotiveUI ’20). Association for Computing Machinery, New York, NY, USA, 212–222. https://doi.org/10.1145/3409120.3410646",
      "doi": "10.1145/3409120.3410646"
    },
    {
      "text": "Mark Colley, Marcel Walch, Jan Gugenheimer, Ali Askari, and Enrico Rukzio. 2020. Towards Inclusive External Communication of Autonomous Vehicles for Pedestrians with Vision Impairments. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376472",
      "doi": "10.1145/3313831.3376472"
    },
    {
      "text": "Mark Colley, Marcel Walch, and Enrico Rukzio. 2019. For a Better (Simulated) World: Considerations for VR in External Communication Research. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 442–449. https://doi.org/10.1145/3349263.3351523",
      "doi": "10.1145/3349263.3351523"
    },
    {
      "text": "Mark Colley, Marcel Walch, and Enrico Rukzio. 2020. Unveiling the Lack of Scalability in Research on External Communication of Autonomous Vehicles. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382865",
      "doi": "10.1145/3334480.3382865"
    },
    {
      "text": "Mark Colley, Bastian Wankmüller, Tim Mend, Thomas Väth, Enrico Rukzio, and Jan Gugenheimer. 2022. User gesticulation inside an automated vehicle with external communication can cause confusion in pedestrians and a lower willingness to cross. Transportation Research Part F: Traffic Psychology and Behaviour 87 (2022), 120–137. https://doi.org/10.1016/j.trf.2022.03.011",
      "doi": ""
    },
    {
      "text": "John M. Darley and Bibb Latane. 1968. Bystander intervention in emergencies: Diffusion of responsibility. Journal of Personality and Social Psychology 8, 4 (1968), 377–383. https://doi.org/10.1037/h0025589",
      "doi": ""
    },
    {
      "text": "Koen de Clercq, Andre Dietrich, Juan Pablo Núñez Velasco, Joost de Winter, and Riender Happee. 2019. External Human-Machine Interfaces on Automated Vehicles: Effects on Pedestrian Crossing Decisions. Human Factors 61, 8 (2019), 1353–1370. https://doi.org/10.1177/0018720819836343",
      "doi": ""
    },
    {
      "text": "Joost de Winter and Dimitra Dodou. 2022. External human–machine interfaces: Gimmick or necessity?Transportation Research Interdisciplinary Perspectives 15 (2022), 100643. https://doi.org/10.1016/j.trip.2022.100643",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Daniel W. Carruth, Muztaba Fuad, Laura M. Stanley, and Darren Frey. 2020. Comparison of Child and Adult Pedestrian Perspectives of External Features on Autonomous Vehicles Using Virtual Reality Experiment. In Advances in Human Factors of Transportation, Neville Stanton (Ed.). Springer International Publishing, Cham, 145–156. https://doi.org/10.1007/978-3-030-20503-4_13",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Daniel W. Carruth, Richard Sween, Lesley Strawderman, and Teena M. Garrison. 2017. Efficacy of virtual reality in pedestrian safety research. Applied Ergonomics 65(2017), 449–460. https://doi.org/10.1016/j.apergo.2017.03.007",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Azra Habibovic, Andreas Löcken, Philipp Wintersberger, Bastian Pfleging, Andreas Riener, Marieke Martens, and Jacques Terken. 2020. Taming the eHMI jungle: A classification taxonomy to guide, compare, and assess the design principles of automated vehicles’ external human-machine interfaces. Transportation Research Interdisciplinary Perspectives 7 (2020), 100174. https://doi.org/10.1016/j.trip.2020.100174",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Azra Habibovic, Bastian Pfleging, Marieke Martens, and Jacques Terken. 2020. Color and Animation Preferences for a Light Band EHMI in Interactions Between Automated Vehicles and Pedestrians. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376325",
      "doi": "10.1145/3313831.3376325"
    },
    {
      "text": "Debargha Dey, Andrii Matviienko, Melanie Berger, Bastian Pfleging, Marieke Martens, and Jacques Terken. 2021. Communicating the intention of an automated vehicle to pedestrians: The contributions of eHMI and vehicle behavior. it - Information Technology 63, 2 (2021), 123–141. https://doi.org/10.1515/itit-2020-0025",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Arjen van Vastenhoven, Raymond H. Cuijpers, Marieke Martens, and Bastian Pfleging. 2021. Towards Scalable EHMIs: Designing for AV-VRU Communication Beyond One Pedestrian. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Leeds, United Kingdom) (AutomotiveUI ’21). Association for Computing Machinery, New York, NY, USA, 274–286. https://doi.org/10.1145/3409118.3475129",
      "doi": "10.1145/3409118.3475129"
    },
    {
      "text": "Joshua E. Domeyer, John D. Lee, and Heishiro Toyoda. 2020. Vehicle Automation–Other Road User Communication and Coordination: Theory and Mechanisms. IEEE Access 8(2020), 19860–19872. https://doi.org/10.1109/ACCESS.2020.2969233",
      "doi": ""
    },
    {
      "text": "Aurélie Dommes, M-A Granié, M-S Cloutier, Cécile Coquelet, and Florence Huguenin-Richard. 2015. Red light violations by adult pedestrians and other safety-related behaviors at signalized crosswalks. Accident Analysis & Prevention 80 (2015), 67–75. https://doi.org/10.1016/j.aap.2015.04.002",
      "doi": ""
    },
    {
      "text": "Fatima El Jamiy and Ronald Marsh. 2019. Survey on depth perception in head mounted displays: distance estimation in virtual reality, augmented reality, and mixed reality. IET Image Processing 13, 5 (2019), 707–712. https://doi.org/10.1049/iet-ipr.2018.5920",
      "doi": ""
    },
    {
      "text": "Stefanie M Faas and Martin Baumann. 2019. Yielding light signal evaluation for self-driving vehicle and pedestrian interaction. In Human Systems Engineering and Design II. IHSED 2019. Advances in Intelligent Systems and Computing, Vol. 1026. Springer, 189–194. https://doi.org/10.1007/978-3-030-27928-8_29",
      "doi": ""
    },
    {
      "text": "Stefanie M. Faas, Andrea C. Kao, and Martin Baumann. 2020. A Longitudinal Video Study on Communicating Status and Intent for Self-Driving Vehicle Pedestrian Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376484",
      "doi": "10.1145/3313831.3376484"
    },
    {
      "text": "Daniel J Fagnant and Kara Kockelman. 2015. Preparing a nation for autonomous vehicles: opportunities, barriers and policy recommendations. Transportation Research Part A: Policy and Practice 77 (2015), 167–181. https://doi.org/10.1016/j.tra.2015.04.003]",
      "doi": ""
    },
    {
      "text": "Jolyon J. Faria, Stefan Krause, and Jens Krause. 2010. Collective behavior in road crossing pedestrians: the role of social information. Behavioral Ecology 21, 6 (09 2010), 1236–1242. https://doi.org/10.1093/beheco/arq141",
      "doi": ""
    },
    {
      "text": "Nicholas N Ferenchak and Matin Katirai. 2017. Pedestrian Crossing Behavior in Relation to Grouping and Gender in a Developing Country Context. Journal of Global Epidemiology and Environmental Health 2017 (2017), 37–45. https://doi.org/10.29199/2637-7144/GEEH-101018",
      "doi": ""
    },
    {
      "text": "Cesar Fernandez, Maria A. Vicente, Irene Carrillo, Mercedes Guilabert, and José J. Mira. 2020. Factors influencing the smartphone usage behavior of pedestrians: Observational study on “Spanish Smombies”. Journal of Medical Internet Research 22, 8 (2020), e19350. https://doi.org/10.2196/19350",
      "doi": ""
    },
    {
      "text": "Duane R Geruschat, Shirin E Hassan, and Kathleen A Turano. 2003. Gaze behavior while crossing complex intersections. Optometry and vision science 80, 7 (2003), 515–528.",
      "doi": ""
    },
    {
      "text": "George Gillette, Kay Fitzpatrick, Susan Chrysler, and Raul Avelar. 2016. Effect of Distractions on a Pedestrian’s Waiting Behavior at Traffic Signals: Observational Study. Transportation Research Record 2586, 1 (2016), 111–119. https://doi.org/10.3141/2586-13",
      "doi": ""
    },
    {
      "text": "Marie-Axelle Granié, Marjorie Pannetier, and Ludivine Gueho. 2013. Developing a self-reporting method to measure pedestrian behaviors at all ages. Accident Analysis & Prevention 50 (2013), 830–839. https://doi.org/10.1016/j.aap.2012.07.009",
      "doi": ""
    },
    {
      "text": "Mathias Haimerl, Mark Colley, and Andreas Riener. 2022. Evaluation of Common External Communication Concepts of Automated Vehicles for People With Intellectual Disabilities. Proc. ACM Hum.-Comput. Interact. 6, MHCI, Article 182 (sep 2022), 19 pages. https://doi.org/10.1145/3546717",
      "doi": "10.1145/3546717"
    },
    {
      "text": "Cara Hamann, Diana Dulf, Erika Baragan-Andrada, Morgan Price, and Corinne Peek-Asa. 2017. Contributors to pedestrian distraction and risky behaviours during road crossings in Romania. 23, 6 (2017), 370–376. https://doi.org/10.1136/injuryprev-2016-042219",
      "doi": ""
    },
    {
      "text": "W. Andrew Harrell. 1991. Factors influencing pedestrian cautiousness in crossing streets. Journal of Social Psychology 131, 3 (1991), 367–372. https://doi.org/10.1080/00224545.1991.9713863",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Julie Hatfield and Susanne Murphy. 2007. The effects of mobile phone use on pedestrian crossing behaviour at signalised and unsignalised intersections. Accident Analysis & Prevention 39, 1 (2007), 197–205. https://doi.org/10.1016/j.aap.2006.07.001",
      "doi": ""
    },
    {
      "text": "Samantha H. Haus, Rini Sherony, and Hampton C. Gabler. 2019. Estimated benefit of automated emergency braking systems for vehicle–pedestrian crashes in the United States. Traffic Injury Prevention 20, Sup1 (2019), S171–S176. https://doi.org/10.1080/15389588.2019.1602729",
      "doi": ""
    },
    {
      "text": "Ann-Christin Hensch, Isabel Kreißig, Matthias Beggiato, and Josef F. Krems. 2022. The Effect of eHMI Malfunctions on Younger and Elderly Pedestrians’ Trust and Acceptance of Automated Vehicle Communication Signals. Frontiers in Psychology 13 (2022), 866475. https://doi.org/10.3389/fpsyg.2022.866475",
      "doi": ""
    },
    {
      "text": "Ann-Christin Hensch, Isabel Neumann, Matthias Beggiato, Josephine Halama, and Josef F Krems. 2019. Effects of a light-based communication approach as an external HMI for Automated Vehicles–a Wizard-of-Oz Study.Transactions on Transport Sciences 10, 2 (2019), 18–32. https://doi.org/10.5507/tots.2019.012",
      "doi": ""
    },
    {
      "text": "Kai Holländer, Ashley Colley, Christian Mai, Jonna Häkkilä, Florian Alt, and Bastian Pfleging. 2019. Investigating the Influence of External Car Displays on Pedestrians’ Crossing Behavior in Virtual Reality. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 27, 11 pages. https://doi.org/10.1145/3338286.3340138",
      "doi": "10.1145/3338286.3340138"
    },
    {
      "text": "Kai Holländer, Mark Colley, Enrico Rukzio, and Andreas Butz. 2021. A Taxonomy of Vulnerable Road Users for HCI Based On A Systematic Literature Review. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 158, 13 pages. https://doi.org/10.1145/3411764.3445480",
      "doi": "10.1145/3411764.3445480"
    },
    {
      "text": "Kai Holländer, Marius Hoggenmller, Romy Gruber, Sarah Theres Völkel, and Andreas Butz. 2022. Take It to the Curb: Scalable Communication Between Autonomous Cars and Vulnerable Road Users Through Curbstone Displays. Frontiers in Computer Science 4 (2022). https://doi.org/10.3389/fcomp.2022.844245",
      "doi": ""
    },
    {
      "text": "Kai Holländer, Andy Krüger, and Andreas Butz. 2020. Save the Smombies: App-Assisted Street Crossing. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, Article 22, 11 pages. https://doi.org/10.1145/3379503.3403547",
      "doi": "10.1145/3379503.3403547"
    },
    {
      "text": "Tim Horberry, Rachel Osborne, and Kristie Young. 2019. Pedestrian smartphone distraction: prevalence and potential severity. Transportation Research Part F: Traffic Psychology and Behaviour 60 (2019), 515–523. https://doi.org/10.1016/j.trf.2018.11.011",
      "doi": ""
    },
    {
      "text": "Kang Jiang, Feiyang Ling, Zhongxiang Feng, Changxi Ma, Wesley Kumfer, Chen Shao, and Kun Wang. 2018. Effects of mobile phone distraction on pedestrians’ crossing behavior and visual attention allocation at a signalized intersection: An outdoor experimental study. Accident Analysis & Prevention 115 (2018), 170–177. https://doi.org/10.1016/j.aap.2018.03.019",
      "doi": ""
    },
    {
      "text": "Philip Joisten, Ziyu Liu, Nina Theobald, Andreas Webler, and Bettina Abendroth. 2021. Communication of Automated Vehicles and Pedestrian Groups: An Intercultural Study on Pedestrians’ Street Crossing Decisions. In Mensch Und Computer 2021 (Ingolstadt, Germany) (MuC ’21). Association for Computing Machinery, New York, NY, USA, 49–53. https://doi.org/10.1145/3473856.3474004",
      "doi": "10.1145/3473856.3474004"
    },
    {
      "text": "Christina Kaß, Stefanie Schoch, Frederik Naujoks, Sebastian Hergeth, Andreas Keinath, and Alexandra Neukum. 2020. Standardized Test Procedure for External Human–Machine Interfaces of Automated Vehicles. Information 11, 3 (2020), 173. https://doi.org/10.3390/info11030173",
      "doi": ""
    },
    {
      "text": "Eunjee Kim, Hyorim Kim, Yujin Kwon, Seobin Choi, and Gwanseob Shin. 2021. Performance of ground-level signal detection when using a phone while walking. Accident Analysis & Prevention 151 (2021), 105909. https://doi.org/10.1016/j.aap.2020.105909",
      "doi": ""
    },
    {
      "text": "Hye-Jin Kim, Jin-Young Min, Hyun-Jin Kim, and Kyoung-Bok Min. 2017. Accident risk associated with smartphone addiction: A study on university students in Korea. Journal of Behavioral Addictions 6, 4 (2017), 699–707. https://doi.org/10.1556/2006.6.2017.070",
      "doi": ""
    },
    {
      "text": "Julian FP Kooij, Fabian Flohr, Ewoud AI Pool, and Dariu M Gavrila. 2019. Context-based path prediction for targets with switching dynamics. International Journal of Computer Vision 127, 3 (2019), 239–262. https://doi.org/10.1007/s11263-018-1104-4",
      "doi": "10.1007/s11263-018-1104-4"
    },
    {
      "text": "Lars Kooijman, Riender Happee, and Joost C. F. de Winter. 2019. How Do eHMIs Affect Pedestrians’ Crossing Behavior? A Study Using a Head-Mounted Display Combined with a Motion Suit. Information 10, 12 (2019), 386. https://doi.org/10.3390/info10120386",
      "doi": ""
    },
    {
      "text": "Oswald D. Kothgassner, Anna Felnhofer, Nathalie Hauk, Elisabeth Kastenhofer, Jasmine Gomm, and Ilse Kryspin-Exner. 2012. Technology Usage Inventory - Manual. Retrieved September 15, 2022 from https://www.ffg.at/sites/default/files/allgemeine_downloads/thematische%20programme/programmdokumente/tui_manual.pdf",
      "doi": ""
    },
    {
      "text": "Mirjam Lanzer, Franziska Babel, Fei Yan, Bihan Zhang, Fang You, Jianmin Wang, and Martin Baumann. 2020. Designing Communication Strategies of Autonomous Vehicles with Pedestrians: An Intercultural Study. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Virtual Event, DC, USA) (AutomotiveUI ’20). Association for Computing Machinery, New York, NY, USA, 122–131. https://doi.org/10.1145/3409120.3410653",
      "doi": "10.1145/3409120.3410653"
    },
    {
      "text": "Mirjam Lanzer and Martin Baumann. 2020. Does crossing the road in a group influence pedestrians’ gaze behavior?Proceedings of the Human Factors and Ergonomics Society Annual Meeting 64, 1(2020), 1938–1942. https://doi.org/10.1177/1071181320641467",
      "doi": ""
    },
    {
      "text": "Mirjam Lanzer, Tanja Stoll, Mark Colley, and Martin Baumann. 2021. Intelligent Mobility in the City: The Influence of System and Context Factors on Drivers’ Takeover Willingness and Trust in Automated Vehicles. Frontiers in Human Dynamics 3 (2021). https://doi.org/10.3389/fhumd.2021.676667",
      "doi": ""
    },
    {
      "text": "Grégoire S. Larue, Christopher N. Watling, Alexander A. Black, Joanne M. Wood, and Mahrokh Khakzar. 2020. Pedestrians distracted by their smartphone: Are in-ground flashing lights catching their attention? A laboratory study. Accident Analysis & Prevention 134 (2020), 105346. https://doi.org/10.1016/j.aap.2019.105346",
      "doi": ""
    },
    {
      "text": "Merle Lau, Duc Hai Le, and Michael Oehl. 2021. Design of External Human-Machine Interfaces for Different Automated Vehicle Types for the Interaction with Pedestrians on a Shared Space. In Proceedings of the 21st Congress of the International Ergonomics Association (IEA 2021), Nancy L. Black, W. Patrick Neumann, and Ian Noy (Eds.). Springer International Publishing, Cham, 710–717. https://doi.org/10.1007/978-3-030-74608-7_87",
      "doi": ""
    },
    {
      "text": "Yee Mun Lee, Ruth Madigan, Oscar Giles, Laura Garach-Morcillo, Gustav Markkula, Charles Fox, Fanta Camara, Markus Rothmueller, Signe Alexandra Vendelbo-Larsen, Pernille Holm Rasmussen, Andre Dietrich, Dimitris Nathanael, Villy Portouli, Anna Schieben, and Natasha Merat. 2021. Road users rarely use explicit communication when interacting in today’s traffic: implications for automated vehicles. Cognition, Technology & Work 23 (2021), 367–380. https://doi.org/10.1007/s10111-020-00635-y",
      "doi": "10.1007/s10111-020-00635-y"
    },
    {
      "text": "Sammy Licence, Robynne Smith, Miranda P. McGuigan, and Conrad P. Earnest. 2015. Gait Pattern Alterations during Walking, Texting and Walking and Texting during Cognitively Distractive Tasks while Negotiating Common Pedestrian Obstacles. PLOS ONE 10, 7 (07 2015), 1–11. https://doi.org/10.1371/journal.pone.0133281",
      "doi": ""
    },
    {
      "text": "Ming-I Brandon Lin and Yu-Ping Huang. 2017. The impact of walking while using a smartphone on pedestrians’ awareness of roadside events. Accident Analysis & Prevention 101 (2017), 87–96. https://doi.org/10.1016/j.aap.2017.02.005",
      "doi": ""
    },
    {
      "text": "Hailong Liu, Takatsugu Hirayama, Luis Yoichi Morales Saiki, and Hiroshi Murase. 2022. Implicit Interaction with an Autonomous Personal Mobility Vehicle: Relations of Pedestrians’ Gaze Behavior with Situation Awareness and Perceived Risks. International Journal of Human–Computer Interaction 0, 0(2022), 1–17. https://doi.org/10.1080/10447318.2022.2073006",
      "doi": ""
    },
    {
      "text": "Andreas Löcken, Carmen Golling, and Andreas Riener. 2019. How Should Automated Vehicles Interact with Pedestrians? A Comparative Analysis of Interaction Concepts in Virtual Reality. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 262–274. https://doi.org/10.1145/3342197.3344544",
      "doi": "10.1145/3342197.3344544"
    },
    {
      "text": "Stefanie M. Faas, Johannes Kraus, Alexander Schoenhals, and Martin Baumann. 2021. Calibrating Pedestrians’ Trust in Automated Vehicles: Does an Intent Display in an External HMI Support Trust Calibration and Safe Crossing Behavior?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 157, 17 pages. https://doi.org/10.1145/3411764.3445738",
      "doi": "10.1145/3411764.3445738"
    },
    {
      "text": "Karthik Mahadevan, Elaheh Sanoubari, Sowmya Somanath, James E. Young, and Ehud Sharlin. 2019. AV-Pedestrian Interaction Design Using a Pedestrian Mixed Traffic Simulator. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 475–486. https://doi.org/10.1145/3322276.3322328",
      "doi": "10.1145/3322276.3322328"
    },
    {
      "text": "Dylan Moore, Rebecca Currano, G. Ella Strack, and David Sirkin. 2019. The Case for Implicit External Human-Machine Interfaces for Autonomous Vehicles. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 295–307. https://doi.org/10.1145/3342197.3345320",
      "doi": "10.1145/3342197.3345320"
    },
    {
      "text": "Mehdi Moussaid, Niriaska Perozo, Simon Garnier, Dirk Helbing, and Guy Theraulaz. 2010. The Walking Behaviour of Pedestrian Social Groups and Its Impact on Crowd Dynamics. PLoS ONE 5, 4 (2010), e10047. https://doi.org/10.1371/journal.pone.0010047",
      "doi": ""
    },
    {
      "text": "Judith Mwakalonge, Saidi Siuhi, and Jamario White. 2015. Distracted walking: Examining the extent to pedestrian safety problems. Journal of Traffic and Transportation Engineering (English Edition) 2, 5(2015), 327–337. https://doi.org/10.1016/j.jtte.2015.08.004",
      "doi": ""
    },
    {
      "text": "Jack L. Nasar and Derek Troyer. 2013. Pedestrian injuries due to mobile phone use in public places. Accident Analysis & Prevention 57 (2013), 91–95. https://doi.org/10.1016/j.aap.2013.03.021",
      "doi": ""
    },
    {
      "text": "Dalibor Pešić, Boris Antić, Draženko Glavić, and Marina Milenković. 2016. The effects of mobile phone use on pedestrian crossing behaviour at unsignalized intersections–Models for predicting unsafe pedestrians behaviour. Safety Science 82(2016), 1–8. https://doi.org/10.1016/j.ssci.2015.08.016",
      "doi": ""
    },
    {
      "text": "Andrew J. Piazza, Adam P. Knowlden, Elizabeth Hibberd, James Leeper, Angelia M. Paschal, and Stuart Usdan. 2020. Distracted mobile device use among street-crossing college student pedestrians: An observational approach. Journal of American College Health 70, 7 (2020), 2135–2142. https://doi.org/10.1080/07448481.2020.1845182",
      "doi": ""
    },
    {
      "text": "Paphawee Prupetkaew, Vipul Lugade, Teerawat Kamnardsiri, and Patima Silsupadol. 2019. Cognitive and visual demands, but not gross motor demand, of concurrent smartphone use affect laboratory and free-living gait among young and older adults. Gait & Posture 68(2019), 30–36. https://doi.org/10.1016/j.gaitpost.2018.11.003",
      "doi": ""
    },
    {
      "text": "Pooya Rahimian, Elizabeth E. O’Neal, Shiwen Zhou, Jodie M. Plumert, and Joseph K. Kearney. 2018. Harnessing Vehicle-to-Pedestrian (V2P) Communication Technology: Sending Traffic Warnings to Texting Pedestrians. Human Factors 60, 6 (2018), 833–843. https://doi.org/10.1177/0018720818781365",
      "doi": ""
    },
    {
      "text": "Rahul Raoniar and Akhilesh Kumar Maurya. 2022. Pedestrian red-light violation at signalised intersection crosswalks: Influence of social and non-social factors. Safety Science 147(2022), 105583. https://doi.org/10.1016/j.ssci.2021.105583",
      "doi": ""
    },
    {
      "text": "Amir Rasouli and John K. Tsotsos. 2020. Autonomous Vehicles That Interact With Pedestrians: A Survey of Theory and Practice. IEEE Transactions on Intelligent Transportation Systems 21, 3(2020), 900–918. https://doi.org/10.1109/TITS.2019.2901817",
      "doi": ""
    },
    {
      "text": "Jun Ren, Yue Chen, Fenfen Li, Cheng Xue, Xiaoya Yin, Juanjuan Peng, Ji Liang, Qiming Feng, and Shumei Wang. 2021. Road Injuries Associated With Cellular Phone Use While Walking or Riding a Bicycle or an Electric Bicycle: A Case-Crossover Study. American Journal of Epidemiology 190, 1 (2021), 37–43. https://doi.org/10.1093/aje/kwaa164",
      "doi": ""
    },
    {
      "text": "Sonja Schneider, Philipp Maruhn, Nguyen-Thong Dang, Prashant Pala, Viola Cavallo, and Klaus Bengler. 2021. Pedestrian Crossing Decisions in Virtual Environments: Behavioral Validity in CAVEs and Head-Mounted Displays. Human Factors 64, 7 (2021), 0018720820987446. https://doi.org/10.1177/0018720820987446",
      "doi": ""
    },
    {
      "text": "Thomas Schubert, Frank Friedmann, and Holger Regenbrecht. 2001. The Experience of Presence: Factor Analytic Insights. Presence: Teleoperators and Virtual Environments 10, 3 (06 2001), 266–281. https://doi.org/10.1162/105474601300343603",
      "doi": "10.1162/105474601300343603"
    },
    {
      "text": "Sarah M Simmons, Jeff K Caird, Alicia Ta, Franci Sterzer, and Brent E Hagel. 2020. Plight of the distracted pedestrian: a research synthesis and meta-analysis of mobile phone use on crossing behaviour. Injury Prevention 26, 2 (2020), 170–176. https://doi.org/10.1136/injuryprev-2019-043426",
      "doi": ""
    },
    {
      "text": "Christos Stogios, Dena Kasraian, Matthew J. Roorda, and Marianne Hatzopoulou. 2019. Simulating impacts of automated driving behavior and traffic conditions on vehicle emissions. Transportation Research Part D: Transport and Environment 76 (2019), 176–192. https://doi.org/10.1016/j.trd.2019.09.020",
      "doi": ""
    },
    {
      "text": "David L. Strayer, Jonna Turrill, Joel M. Cooper, James R. Coleman, Nathan Medeiros-Ward, and Francesco Biondi. 2015. Assessing Cognitive Distraction in the Automobile. Human Factors 57, 8 (2015), 1300–1324. https://doi.org/10.1177/0018720815575149",
      "doi": ""
    },
    {
      "text": "Matus Sucha, Daniel Dostal, and Ralf Risser. 2017. Pedestrian-driver communication and decision strategies at marked crossings. Accident Analysis & Prevention 102 (2017), 41–50. https://doi.org/10.1016/j.aap.2017.02.018",
      "doi": ""
    },
    {
      "text": "Leah L. Thompson, Frederick P. Rivara, Rajiv C. Ayyagari, and Beth E. Ebel. 2013. Impact of social and technological distraction on pedestrian crossing behaviour: An observational study. Injury Prevention 19, 4 (2013), 232–237. https://doi.org/10.1136/injuryprev-2012-040601",
      "doi": ""
    },
    {
      "text": "Kai Tian, Gustav Markkula, Chongfeng Wei, Ehsan Sadraei, Toshiya Hirose, Natasha Merat, and Richard Romano. 2022. Impacts of visual and cognitive distractions and time pressure on pedestrian crossing behaviour: A simulator study. Accident Analysis & Prevention 174 (2022), 106770. https://doi.org/10.1016/j.aap.2022.106770",
      "doi": ""
    },
    {
      "text": "Tom Tullis and Bill Albert. 2013. Chapter 7 - Behavioral and Physiological Metrics. In Measuring the User Experience(2 ed.), Tom Tullisand Bill Albert (Eds.). Morgan Kaufmann, Boston, 163–186. https://doi.org/10.1016/B978-0-12-415781-1.00007-8",
      "doi": ""
    },
    {
      "text": "Roni Utriainen. 2021. The potential impacts of automated vehicles on pedestrian safety in a four-season country. Journal of Intelligent Transportation Systems 25, 2 (2021), 188–196. https://doi.org/10.1080/15472450.2020.1845671",
      "doi": ""
    },
    {
      "text": "Mark Vollrath, Anja Katharina Huemer, and Christin Nicolai. 2019. Young people use their smartphone all the time–even when crossing the street?IET Intelligent Transport Systems 13, 8 (2019), 1213–1217. https://doi.org/10.1049/iet-its.2018.5548 IET",
      "doi": ""
    },
    {
      "text": "Nikolai von Janczewski, Jennifer Wittmann, Arnd Engeln, Martin Baumann, and Lutz Krauß. 2021. A meta-analysis of the n-back task while driving and its effects on cognitive workload. Transportation Research Part F: Traffic Psychology and Behaviour 76 (2021), 269–285. https://doi.org/10.1016/j.trf.2020.11.014",
      "doi": ""
    },
    {
      "text": "Rebecca Wiczorek and Janna Protzak. 2022. The Impact of Visual and Cognitive Dual-Task Demands on Traffic Perception During Road Crossing of Older and Younger Pedestrians. Frontiers in Psychology 13 (2022), 775165. https://doi.org/10.3389/fpsyg.2022.775165",
      "doi": ""
    },
    {
      "text": "Marc Wilbrink, Manja Nuttelmann, and Michael Oehl. 2021. Scaling up Automated Vehicles’ EHMI Communication Designs to Interactions with Multiple Pedestrians – Putting EHMIs to the Test. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Leeds, United Kingdom) (AutomotiveUI ’21 Adjunct). Association for Computing Machinery, New York, NY, USA, 119–122. https://doi.org/10.1145/3473682.3480277",
      "doi": "10.1145/3473682.3480277"
    },
    {
      "text": "George Yannis, Eleonora Papadimitriou, and Athanasios Theofilatos. 2013. Pedestrian gap acceptance for mid-block street crossing. Transportation Planning and Technology 36, 5 (2013), 450–462. https://doi.org/10.1080/03081060.2013.818274",
      "doi": ""
    },
    {
      "text": "Xiangling Zhuang and Changxu Wu. 2012. The safety margin and perceived safety of pedestrians at unmarked roadway. Transportation Research Part F: Traffic Psychology and Behaviour 15, 2(2012), 119–131. https://doi.org/10.1016/j.trf.2011.11.005",
      "doi": ""
    }
  ]
}