{
  "doi": "10.1145/3544548.3581149",
  "title": "Communicating Consequences: Visual Narratives, Abstraction, and Polysemy in Rural Bangladesh",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Information communication and visualization practices reflect two centuries of developments of conventions and best practices which may not be reflective of global audiences’ methods for conveying information. Contrasting between rural traditional visual culture and contemporary HCI and data-visualization, we argue that an understanding of traditional practices for information visualization is required for building rich data-narratives and making data-driven systems more accessible and culturally situated. Our ten-month ethnographic study investigates how rural Bangladeshi communities construct narratives through visual media. 1 Our observation, interviews, and FGDs (n=54) expose how participants convey risk management, decision-making, and monetary management practices to their peers. We find that villagers used a rich network of polysemic symbols and abstractions to manifest subjectivity, factuality, consequence, situatedness, and uncertainty; varied visual attributes for constructing narratives; and emphasized material relations among components in visuals. These findings inform the design of future systems for decision support in a culturally situated manner.",
  "authors": [
    {
      "name": "Sharifa Sultana",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261900",
      "orcid": "0000-0003-2906-7391"
    },
    {
      "name": "Syed Ishtiaque Ahmed",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502686136",
      "orcid": "0000-0003-2452-0687"
    },
    {
      "name": "Jeffrey M Rzeszotarski",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490684184",
      "orcid": "0000-0002-4317-9501"
    }
  ],
  "references": [
    {
      "text": "Basak Alper, Nathalie Henry Riche, Fanny Chevalier, Jeremy Boy, and Metin Sezgin. 2017. Visualization literacy at elementary school. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5485–5497.",
      "doi": "10.1145/3025453.3025877"
    },
    {
      "text": "Chiara Ambrosio. 2014. Objectivity and representative practices across artistic and scientific visualization. In Visualization in the age of computerization. Routledge, 118–144.",
      "doi": ""
    },
    {
      "text": "Benedict Anderson. 2006. Imagined communities: Reflections on the origin and spread of nationalism. Verso books.",
      "doi": ""
    },
    {
      "text": "Rudolf Arnheim. 1947. Perceptual abstraction and art.Psychological Review 54, 2 (1947), 66.",
      "doi": ""
    },
    {
      "text": "Rudolf Arnheim. 1969. Visual Thinking University of California Press. Berkeley and Los Angeles(1969).",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L Cox. 2018. Flexible and mindful self-tracking: Design implications from paper bullet journals. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3173602"
    },
    {
      "text": "Prathama Banerjee. 2006. Culture/politics: The irresoluble double-bind of the Indian adivasi. Indian Historical Review 33, 1 (2006), 99–126.",
      "doi": ""
    },
    {
      "text": "Prathama Banerjee. 2006. Politics of Time:’primitives’ and History-writing in a Colonial Society. (2006).",
      "doi": ""
    },
    {
      "text": "Prathama Banerjee. 2016. Writing the Adivasi: Some historiographical notes. The Indian Economic & Social History Review 53, 1 (2016), 131–153.",
      "doi": ""
    },
    {
      "text": "Eitan Ben-Haim, Anat Cohen, and Michal Tabach. 2019. Types of graphic interface design and their role in learning via mathematical applets at the elementary school. In Eleventh Congress of the European Society for Research in Mathematics Education. Freudenthal Group; Freudenthal Institute; ERME.",
      "doi": ""
    },
    {
      "text": "Jacques Bertin. 1983. Semiology of graphics. University of Wisconsin press.",
      "doi": "10.5555/1095597"
    },
    {
      "text": "Georges-Pierre Bonneau, Hans-Christian Hege, Chris R Johnson, Manuel M Oliveira, Kristin Potter, Penny Rheingans, and Thomas Schultz. 2014. Overview and state-of-the-art of uncertainty visualization. In Scientific Visualization. Springer, 3–27.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Doreen S Boyd, Peter C Phipps, William J Duane, and Giles M Foody. 2003. Remote Monitoring of the Impact of ENSO-related Drought on Sabah Rainforest Using NOAA AVHRR Middle Infrared Reflectance: Exploring Emissivity Uncertainty. Uncertainty in Remote Sensing and GIS(2003), 119.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis.American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Nathalie Bressa, Henrik Korsgaard, Aurélien Tabard, Steven Houben, and Jo Vermeulen. 2021. What’s the Situation with Situated Visualization? A Survey and Perspectives on Situatedness. IEEE Transactions on Visualization and Computer Graphics 28, 1(2021), 107–117.",
      "doi": "10.1109/TVCG.2021.3114835"
    },
    {
      "text": "Nathalie Bressa, Kendra Wannamaker, Henrik Korsgaard, Wesley Willett, and Jo Vermeulen. 2019. Sketching and ideation activities for situated visualization design. In Proceedings of the 2019 on Designing Interactive Systems Conference. 173–185.",
      "doi": "10.1145/3322276.3322326"
    },
    {
      "text": "Ken Brodlie, Rodolfo Allendes Osorio, and Adriano Lopes. 2012. A review of uncertainty in data visualization. Expanding the frontiers of visual analytics and visualization (2012), 81–109.",
      "doi": ""
    },
    {
      "text": "Birgit Brucker, Katharina Scheiter, and Peter Gerjets. 2014. Learning with dynamic and static visualizations: Realistic details only benefit learners with high visuospatial abilities. Computers in Human Behavior 36 (2014), 330–339.",
      "doi": "10.1016/j.chb.2014.03.077"
    },
    {
      "text": "Paolo Buono and Fabrizio Balducci. 2019. MonitorApp: a web tool to analyze and visualize pollution data detected by an electronic nose. Multimedia Tools and Applications 78, 23 (2019), 33023–33040.",
      "doi": ""
    },
    {
      "text": "Jan Byška, Thomas Trautner, Sérgio M Marques, Jirí Damborskỳ, Barbora Kozlíková, and Manuela Waldner. 2019. Analysis of long molecular dynamics simulations using interactive focus+ context visualization. In Computer Graphics Forum, Vol. 38. Wiley Online Library, 441–453.",
      "doi": ""
    },
    {
      "text": "Ruochen Cao, Subrata Dey, Andrew Cunningham, James Walsh, Ross T Smith, Joanne E Zucco, and Bruce H Thomas. 2020. Examining the use of narrative constructs in data videos. Visual Informatics 4, 1 (2020), 8–22.",
      "doi": ""
    },
    {
      "text": "John V Carlis and Joseph A Konstan. 1998. Interactive visualization of serial periodic data. In Proceedings of the 11th annual ACM symposium on User interface software and technology. 29–38.",
      "doi": "10.1145/288392.288399"
    },
    {
      "text": "Sheelagh Carpendale, Alice Thudt, Charles Perin, and Wesley Willett. 2017. Subjectivity in personal storytelling with visualization. Information Design Journal 23, 1 (2017), 48–64.",
      "doi": ""
    },
    {
      "text": "Chih-Hung Chiang, Patrick Shaughnessy, Gary Livingston, and GG Grinstein. 2005. Visualizing graphical probabilistic models. UML CS, Lowell, Massachusetts(2005).",
      "doi": ""
    },
    {
      "text": "Sohee Cho, Ginkyeng Lee, Wonjoon Chang, and Jaesik Choi. 2020. Interpretation of Deep Temporal Representations by Selective Visualization of Internally Activated Nodes. arXiv preprint arXiv:2004.12538(2020).",
      "doi": ""
    },
    {
      "text": "Sandy Claes and Andrew Vande Moere. 2013. Street infographics: raising awareness of local issues through a situated urban visualization. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays. 133–138.",
      "doi": "10.1145/2491568.2491597"
    },
    {
      "text": "Michael Correll. 2019. Ethical dimensions of visualization research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300418"
    },
    {
      "text": "MC Ferreira De Oliveira and Haim Levkowitz. 2003. From visual data exploration to visual data mining: A survey. IEEE transactions on visualization and computer graphics 9, 3(2003), 378–394.",
      "doi": "10.1109/TVCG.2003.1207445"
    },
    {
      "text": "Marian Dörk, Patrick Feng, Christopher Collins, and Sheelagh Carpendale. 2013. Critical InfoVis: exploring the politics of visualization. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 2189–2198.",
      "doi": ""
    },
    {
      "text": "Johanna Drucker. 2011. Humanities approaches to graphical display. Digital Humanities Quarterly 5, 1 (2011), 1–21.",
      "doi": ""
    },
    {
      "text": "Fan Du, Nan Cao, Yu-Ru Lin, Panpan Xu, and Hanghang Tong. 2017. isphere: Focus+ context sphere visualization for interactive large graph exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2916–2927.",
      "doi": "10.1145/3025453.3025628"
    },
    {
      "text": "Jennifer L Dungan, David Kao, and Alex Pang. 2002. The uncertainty visualization problem in remote sensing analysis. In IEEE International Geoscience and Remote Sensing Symposium, Vol. 2. IEEE, 729–731.",
      "doi": ""
    },
    {
      "text": "Yujie Fang, Hui Xu, and Jie Jiang. 2020. A survey of time series data visualization research. In IOP Conference Series: Materials Science and Engineering, Vol. 782. IOP Publishing, 022013.",
      "doi": ""
    },
    {
      "text": "[35] Rural Reconstruction Foundation.2018. http://www.rrf-bd.org/.",
      "doi": ""
    },
    {
      "text": "Mark Gahegan and Manfred Ehlers. 2000. A framework for the modelling of uncertainty between remote sensing and geographic information systems. ISPRS journal of photogrammetry and remote sensing 55, 3 (2000), 176–188.",
      "doi": ""
    },
    {
      "text": "Christina Gillmann, Dorothee Saur, and Gerik Scheuermann. 2021. How to deal with Uncertainty in Machine Learning for Medical Imaging?. In 2021 IEEE Workshop on TRust and EXpertise in Visual Analytics (TREX). IEEE, 52–58.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1974. Frame analysis: An essay on the organization of experience.Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Aline Gubrium and Krista Harper. 2016. Participatory visual and digital methods. Routledge.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2020. Situated knowledges: The science question in feminism and the privilege of partial perspective. In Feminist theory reader. Routledge, 303–310.",
      "doi": ""
    },
    {
      "text": "Susan Havre, Beth Hetzler, and Lucy Nowell. 2000. ThemeRiver: Visualizing theme changes over time. In IEEE Symposium on Information Visualization 2000. INFOVIS 2000. Proceedings. IEEE, 115–123.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Maureen Stone. 2012. Color naming models for color selection, image editing and palette design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1007–1016.",
      "doi": "10.1145/2207676.2208547"
    },
    {
      "text": "Darrell Huff. 1993. How to lie with statistics. WW Norton & Company.",
      "doi": "10.5555/1098683"
    },
    {
      "text": "Jessica Hullman and Nick Diakopoulos. 2011. Visualization rhetoric: Framing effects in narrative visualization. IEEE transactions on visualization and computer graphics 17, 12(2011), 2231–2240.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Steven Drucker, Nathalie Henry Riche, Bongshin Lee, Danyel Fisher, and Eytan Adar. 2013. A deeper understanding of sequence in narrative visualization. IEEE Transactions on visualization and computer graphics 19, 12(2013), 2406–2415.",
      "doi": "10.1109/TVCG.2013.119"
    },
    {
      "text": "Jessica Hullman, Xiaoli Qiao, Michael Correll, Alex Kale, and Matthew Kay. 2018. In pursuit of error: A survey of uncertainty visualization evaluation. IEEE transactions on visualization and computer graphics 25, 1(2018), 903–913.",
      "doi": ""
    },
    {
      "text": "Gary J Hunter and MF Goodchild. 1993. Managing uncertainty in spatial databases: Putting theory into practice. URISA Journal 5, 2 (1993), 55–62.",
      "doi": ""
    },
    {
      "text": "Loki JGrgenson, BC Ronald Kriz, Virgina Tech, and Barbara Mones-Hattal. 1995. Is Visualization Struggling under the Myth of Objectivity?(1995).",
      "doi": ""
    },
    {
      "text": "Meraj Khan, Larry Xu, Arnab Nandi, and Joseph M Hellerstein. 2017. Data tweening: incremental visualization of data transforms. Proceedings of the VLDB Endowment 10, 6 (2017), 661–672.",
      "doi": "10.14778/3055330.3055333"
    },
    {
      "text": "Yea-Seul Kim, Logan A Walls, Peter Krafft, and Jessica Hullman. 2019. A bayesian cognition approach to improve data visualization. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3290605.3300912"
    },
    {
      "text": "Robert Kosara and Jock Mackinlay. 2013. Storytelling: The next step for visualization. Computer 46, 5 (2013), 44–50.",
      "doi": "10.1109/MC.2013.36"
    },
    {
      "text": "W Labov and J Waletzky. 1967. Narrative analysis: oral versions of personal experience, Essays on the Verbal and Visual Arts,(ed. J. Helms) Univ.",
      "doi": ""
    },
    {
      "text": "Kristin M Langellier. 1989. Personal narratives: Perspectives on theory and research. Text and performance quarterly 9, 4 (1989), 243–276.",
      "doi": ""
    },
    {
      "text": "Weiyu Li, Jiying Lang, He Zhang, Fei Yang, Lei Zhang, and Jingchang Pan. 2019. Parallel coordinates based visualization for high-dimensional data. In Proceedings of the 2019 3rd international conference on big data research. 161–165.",
      "doi": "10.1145/3372454.3372460"
    },
    {
      "text": "Johannes Liem, Charles Perin, and Jo Wood. 2020. Structure and empathy in visual data storytelling: Evaluating their influence on attitude. In Computer Graphics Forum, Vol. 39. Wiley Online Library, 277–289.",
      "doi": ""
    },
    {
      "text": "Charlotte Linde. 1993. Life stories: The creation of coherence. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Giorgia Lupi and Stefanie Posavec. 2016. Dear data. Chronicle books.",
      "doi": ""
    },
    {
      "text": "Catarina Maçãs and Penousal Machado. 2018. Radial calendar of consumption. In 2018 22nd International Conference Information Visualisation (IV). IEEE, 96–102.",
      "doi": ""
    },
    {
      "text": "Alan M MacEachren, Anthony Robinson, Susan Hopper, Steven Gardner, Robert Murray, Mark Gahegan, and Elisabeth Hetzler. 2005. Visualizing geospatial information uncertainty: What we know and what we need to know. Cartography and Geographic Information Science 32, 3 (2005), 139–160.",
      "doi": ""
    },
    {
      "text": "Alan M MacEachren, Robert E Roth, James O’Brien, Bonan Li, Derek Swingley, and Mark Gahegan. 2012. Visual semiotics & uncertainty visualization: An empirical study. IEEE transactions on visualization and computer graphics 18, 12(2012), 2496–2505.",
      "doi": ""
    },
    {
      "text": "Lev Manovich. 2002. Data visualization as new abstraction and anti-sublime. Small tech: The culture of digital tools 3, 9 (2002).",
      "doi": ""
    },
    {
      "text": "Lev Manovich 2002. The anti-sublime ideal in data art. URL= http://www. manovich. net/DOCS/data_art. doc (2002).",
      "doi": ""
    },
    {
      "text": "Matthew Mauriello, Michael Gubbels, and Jon E Froehlich. 2014. Social fabric fitness: the design and evaluation of wearable E-textile displays to support group running. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2833–2842.",
      "doi": "10.1145/2556288.2557299"
    },
    {
      "text": "Sean McKenna, Alexander Lex, and Miriah Meyer. 2017. Worksheets for guiding novices through the visualization design process. arXiv preprint arXiv:1709.05723(2017).",
      "doi": ""
    },
    {
      "text": "Miriah Meyer and Jason Dykes. 2019. Criteria for rigor in visualization design study. IEEE transactions on visualization and computer graphics 26, 1(2019), 87–97.",
      "doi": ""
    },
    {
      "text": "Claudia M Mitchell and Marni Sommer. 2016. Participatory visual methodologies in global public health., 521–527 pages.",
      "doi": ""
    },
    {
      "text": "Andrew Vande Moere and Dan Hill. 2012. Designing for the situated and public visualization of urban data. Journal of Urban Technology 19, 2 (2012), 25–46.",
      "doi": ""
    },
    {
      "text": "Luiz Morais, Yvonne Jansen, Nazareno Andrade, and Pierre Dragicevic. 2020. Showing data about people: A design space of anthropographics. IEEE Transactions on Visualization and Computer Graphics (2020).",
      "doi": ""
    },
    {
      "text": "Leyla Norooz, Matthew Louis Mauriello, Anita Jorgensen, Brenna McNally, and Jon E Froehlich. 2015. BodyVis: A new approach to body learning through wearable sensing and visualization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1025–1034.",
      "doi": "10.1145/2702123.2702299"
    },
    {
      "text": "EdrawMax Online. 2022. What is A Decision Tree with Examples. https://www.edrawmax.com/decision-tree/.",
      "doi": ""
    },
    {
      "text": "Josh Packard. 2008. ‘I’m gonna show you what it’s really like out here’: the power and limitation of participatory visual methods. Visual studies 23, 1 (2008), 63–77.",
      "doi": ""
    },
    {
      "text": "Alex T Pang, Craig M Wittenbrink, Suresh K Lodha, 1997. Approaches to uncertainty visualization. The Visual Computer 13, 8 (1997), 370–390.",
      "doi": ""
    },
    {
      "text": "Evan M Peck, Sofia E Ayuso, and Omar El-Etr. 2019. Data is Personal: Attitudes and Perceptions of Data Visualization in Rural Pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Laura J Perovich, Sara Ann Wylie, and Roseann Bongiovanni. 2020. Chemicals in the Creek: designing a situated data physicalization of open government data with the community. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 913–923.",
      "doi": ""
    },
    {
      "text": "Robert Racadio, Emma J Rose, and Beth E Kolko. 2014. Research at the margin: participatory design and community based participatory research. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts-Volume 2. 49–52.",
      "doi": "10.1145/2662155.2662188"
    },
    {
      "text": "Eric D Ragan, Alex Endert, Jibonananda Sanyal, and Jian Chen. 2015. Characterizing provenance in visualization and data analysis: an organizational framework of provenance types and purposes. IEEE transactions on visualization and computer graphics 22, 1(2015), 31–40.",
      "doi": ""
    },
    {
      "text": "Shamsur Rahman. 2018. Over 25,000 killed on roads in 3 years | Prothom Alo. https://en.prothomalo.com/bangladesh/25-120-killed-on-roads-in-3-years.",
      "doi": ""
    },
    {
      "text": "Andres Ramirez Gaviria. 2008. When is information visualization art? Determining the critical criteria. Leonardo 41, 5 (2008), 479–482.",
      "doi": ""
    },
    {
      "text": "Ke Ren, Dezhan Qu, Shaobin Xu, Xufeng Jiao, Liang Tai, and Huijie Zhang. 2020. Uncertainty visualization of transport variance in a time-varying ensemble vector field. ISPRS International Journal of Geo-Information 9, 1(2020), 19.",
      "doi": ""
    },
    {
      "text": "Maria Riveiro. 2007. Evaluation of uncertainty visualization techniques for information fusion. In 2007 10th International Conference on Information Fusion. IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Jonathan C Roberts, Christopher J Headleand, and Panagiotis D Ritsos. 2017. Five design-sheets: creative design and sketching for computing and visualisation. Springer.",
      "doi": ""
    },
    {
      "text": "George Robertson, Roland Fernandez, Danyel Fisher, Bongshin Lee, and John Stasko. 2008. Effectiveness of animation in trend visualization. IEEE transactions on visualization and computer graphics 14, 6(2008), 1325–1332.",
      "doi": "10.1109/TVCG.2008.125"
    },
    {
      "text": "Jan Ketil Rod. 2001. How The Monosemic Graphics Go Polysemic. Cartographic Perspectives38 (2001), 7–18.",
      "doi": ""
    },
    {
      "text": "Sergio Sayago, Andrea Rosales, Valeria Righi, Susan M Ferreira, Graeme W Coleman, and Josep Blat. 2016. On the conceptualization, design, and evaluation of appealing, meaningful, and playable digital games for older people. Games and Culture 11, 1-2 (2016), 53–80.",
      "doi": ""
    },
    {
      "text": "Christoph Schulz, Arlind Nocaj, Jochen Goertler, Oliver Deussen, Ulrik Brandes, and Daniel Weiskopf. 2016. Probabilistic graph layout for uncertain network visualization. IEEE Transactions on Visualization and Computer Graphics 23, 1(2016), 531–540.",
      "doi": "10.1109/TVCG.2016.2598919"
    },
    {
      "text": "Edward Segel and Jeffrey Heer. 2010. Narrative visualization: Telling stories with data. IEEE transactions on visualization and computer graphics 16, 6(2010), 1139–1148.",
      "doi": ""
    },
    {
      "text": "David Sinton. 1978. The inherent structure of information as a constraint to analysis: Mapped thematic data as a case study. Harvard papers on geographic information systems (1978).",
      "doi": ""
    },
    {
      "text": "Gayatri Chakravorty Spivak. 2005. Scattered speculations on the subaltern and the popular. Postcolonial studies 8, 4 (2005), 475–486.",
      "doi": ""
    },
    {
      "text": "Thomas Strothotte. 2012. Computational Visualization: Graphics, abstraction and interactivity. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana and Syed Ishtiaque Ahmed. 2019. Witchcraft and HCI: Morality, Modernity, and Postcolonial Computing in Rural Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 356.",
      "doi": "10.1145/3290605.3300586"
    },
    {
      "text": "Sharifa Sultana, Syed Ishtiaque Ahmed, and Jeffrey M Rzeszotarski. 2021. Seeing in context: Traditional visual communication practices in rural bangladesh. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–31.",
      "doi": "10.1145/3432913"
    },
    {
      "text": "Danielle A. Szafir. 2017. Modeling color difference for visualization design. In IEEE Transactions on Visualization and Computer Graphics, Vol. 24. IEEE, 392–401.",
      "doi": ""
    },
    {
      "text": "Danielle A. Szafir. 2018. Modeling Color Difference for Visualization Design. In IEEE Transactions on Visualization and Computer Graphics, Vol. 24. 392–401.",
      "doi": ""
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, Samuel Huron, and Sheelagh Carpendale. 2018. Self-reflection and personal physicalization construction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173728"
    },
    {
      "text": "Christian Tominski, James Abello, and Heidrun Schumann. 2004. Axes-based visualizations with radial layouts. In Proceedings of the 2004 ACM symposium on Applied computing. 1242–1247.",
      "doi": "10.1145/967900.968153"
    },
    {
      "text": "Christian Tominski and Heidrun Schumann. 2008. Enhanced interactive spiral display. In SIGRAD 2008. The annual SIGRAD conference special theme: interaction; November 27-28; 2008 Stockholm; Sweden. Linköping University Electronic Press, 53–56.",
      "doi": ""
    },
    {
      "text": "Edward R Tufte. 1985. The visual display of quantitative information. The Journal for Healthcare Quality (JHQ) 7, 3 (1985), 15.",
      "doi": ""
    },
    {
      "text": "Nina Valkanova, Sergi Jorda, and Andrew Vande Moere. 2015. Public visualization displays of citizen data: Design, impact and implications. International Journal of Human-Computer Studies 81 (2015), 4–16.",
      "doi": "10.1016/j.ijhcs.2015.02.005"
    },
    {
      "text": "Mario Valle. 2005. Visualization and art. http://mariovalle.name/visualization/VizArt.html.",
      "doi": ""
    },
    {
      "text": "Jarke J Van Wijk. 2005. The value of visualization. In VIS 05. IEEE Visualization, 2005. IEEE, 79–86.",
      "doi": ""
    },
    {
      "text": "Jarke J Van Wijk and Edward R Van Selow. 1999. Cluster and calendar based visualization of time series data. In Proceedings 1999 IEEE Symposium on Information Visualization (InfoVis’ 99). IEEE, 4–9.",
      "doi": ""
    },
    {
      "text": "Fernanda B Viégas and Martin Wattenberg. 2007. Artistic data visualization: Beyond visual analytics. In International Conference on Online Communities and Social Computing. Springer, 182–191.",
      "doi": ""
    },
    {
      "text": "Tomohito Wada, Mirai Mizutani, James Lee, David Rowlands, and Daniel James. 2018. 3D visualisation of wearable inertial/magnetic sensors. Multidisciplinary Digital Publishing Institute Proceedings 2, 6(2018), 292.",
      "doi": ""
    },
    {
      "text": "Michelle Q Wang Baldonado, Allison Woodruff, and Allan Kuchinsky. 2000. Guidelines for using multiple views in information visualization. In Proceedings of the working conference on Advanced visual interfaces. 110–119.",
      "doi": "10.1145/345513.345271"
    },
    {
      "text": "Matthew O Ward, Georges Grinstein, and Daniel Keim. 2010. Interactive data visualization: foundations, techniques, and applications. CRC Press.",
      "doi": ""
    },
    {
      "text": "Jorin Weatherston, Charles Perin, Dennis Hore, Bruce Wallace, and Margaret-Anne Storey. 2020. An unquantified uncertainty visualization design space during the opioid crisis. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3334480.3383072"
    },
    {
      "text": "Sean White and Steven Feiner. 2009. SiteLens: situated visualization techniques for urban site visits. In Proceedings of the SIGCHI conference on human factors in computing systems. 1117–1120.",
      "doi": "10.1145/1518701.1518871"
    },
    {
      "text": "Peter Willett, John M Barnard, and Geoffrey M Downs. 1998. Chemical similarity searching. Journal of chemical information and computer sciences 38, 6 (1998), 983–996.",
      "doi": ""
    },
    {
      "text": "Stanton Emerson Fisher Wortham. 2001. Narratives in action: A strategy for research and analysis. Teachers College Press.",
      "doi": ""
    },
    {
      "text": "Jiayi Eris Zhang, Nicole Sultanum, Anastasia Bezerianos, and Fanny Chevalier. 2020. DataQuilt: Extracting Visual Elements from Images to Craft Pictorial Visualizations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376172",
      "doi": "10.1145/3313831.3376172"
    }
  ]
}