{
  "doi": "10.1145/3544548.3580918",
  "title": "Are Embodied Avatars Harmful to our Self-Experience? The Impact of Virtual Embodiment on Body Awareness",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Virtual Reality (VR) allows us to replace our visible body with a virtual self-representation (avatar) and to explore its effects on our body perception. While the feeling of owning and controlling a virtual body is widely researched, how VR affects the awareness of internal body signals (body awareness) remains open. Forty participants performed moving meditation tasks in reality and VR, either facing their mirror image or not. Both the virtual environment and avatars photorealistically matched their real counterparts. We found a negative effect of VR on body awareness, mediated by feeling embodied in and changed by the avatar. Further, we revealed a negative effect of a mirror on body awareness. Our results indicate that assessing body awareness should be essential in evaluating VR designs and avatar embodiment aiming at mental health, as even a scenario as close to reality as possible can distract users from their internal body signals.",
  "authors": [
    {
      "name": "Nina Döllinger",
      "institution": "Psychology of Intelligent Interactive Systems, University of Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236855",
      "orcid": "0000-0002-0609-8841"
    },
    {
      "name": "Erik Wolf",
      "institution": "Human-Computer Interaction Group, University of Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659473773",
      "orcid": "0000-0003-4881-9982"
    },
    {
      "name": "Mario Botsch",
      "institution": "Computer Graphics Group, TU Dortmund University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100347774",
      "orcid": "0000-0001-9954-120X"
    },
    {
      "name": "Marc Erich Latoschik",
      "institution": "Human-Computer Interaction Group, University of Würzburg, Germany",
      "img": "/do/10.1145/contrib-81100286130/rel-imgonly/marc.jpg",
      "acmid": "81100286130",
      "orcid": "0000-0002-9340-9600"
    },
    {
      "name": "Carolin Wienrich",
      "institution": "Psychology of Intelligent Interactive Systems, University of Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659468005",
      "orcid": "0000-0003-3052-7172"
    }
  ],
  "references": [
    {
      "text": "Jascha Achenbach, Thomas Waltemate, Marc Erich Latoschik, and Mario Botsch. 2017. Fast Generation of Realistic Virtual Humans. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (Gothenburg, Sweden) (VRST ’17). Association for Computing Machinery, New York, NY, USA, Article 12, 10 pages. https://doi.org/10.1145/3139131.3139154",
      "doi": "10.1145/3139131.3139154"
    },
    {
      "text": "Agisoft. 2021. Metashape Pro. http://www.agisoft.com. http://www.agisoft.com [Accessed August 26, 2022].",
      "doi": ""
    },
    {
      "text": "Vivien Ainley and Manos Tsakiris. 2013. Body conscious? Interoceptive awareness, measured by heartbeat perception, is negatively correlated with self-objectification. PloS one 8, 2 (2013), e55568. https://doi.org/10.1371/journal.pone.0055568",
      "doi": ""
    },
    {
      "text": "Pasquale Arpaia, Giovanni D’Errico, Lucio Tommaso De Paolis, Nicola Moccaldi, and Fabiana Nuccetelli. 2021. A Narrative Review of Mindfulness-Based Interventions Using Virtual Reality. Mindfulness 13, 3 (2021), 1–16. https://doi.org/10.1007/s12671-021-01783-6",
      "doi": ""
    },
    {
      "text": "Autodesk. 2014. Character Generator. https://charactergenerator.autodesk.com. https://charactergenerator.autodesk.com [Accessed August 24, 2022].",
      "doi": ""
    },
    {
      "text": "Andrea Bartl, Christian Merz, Daniel Roth, and Marc Erich Latoschik. 2022. The Effects of Avatar and Environment Design on Embodiment, Presence, Activation, and Task Load in a Virtual Reality Exercise Application. In IEEE International Symposium on Mixed and Augmented Reality (ISMAR). https://downloads.hci.informatik.uni-wuerzburg.de/2022-ismar-ilast-avatar-environment-design-vr-exercise-application.pdf",
      "doi": ""
    },
    {
      "text": "Andrea Bartl, Stephan Wenninger, Erik Wolf, Mario Botsch, and Marc Erich Latoschik. 2021. Affordable But Not Cheap: A Case Study of the Effects of Two 3D-Reconstruction Methods of Virtual Humans. Frontiers in Virtual Reality 2 (2021), 18. https://doi.org/10.3389/frvir.2021.694617",
      "doi": ""
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands ’feel’ touch that eyes see. Nature 391, 6669 (1998), 756–756. https://doi.org/10.1038/35784",
      "doi": ""
    },
    {
      "text": "Anne E. Cox, Sarah Ullrich-French, and Brian F. French. 2016. Validity evidence for the state mindfulness scale for physical activity. Measurement in Physical Education and Exercise Science 20, 1(2016), 38–49. https://doi.org/10.1080/1091367X.2015.1089404",
      "doi": ""
    },
    {
      "text": "Nicole David, Francesca Fiori, and Salvatore M. Aglioti. 2014. Susceptibility to the rubber hand illusion does not tell the whole body-awareness story. Cognitive, Affective and Behavioral Neuroscience 14 (2014), 297–306. Issue 1. https://doi.org/10.3758/s13415-013-0190-6",
      "doi": ""
    },
    {
      "text": "Henrique Galvan Debarba, Sidney Bovet, Roy Salomon, Olaf Blanke, Bruno Herbelin, and Ronan Boulic. 2017. Characterizing first and third person viewpoints and their alternation for embodied interaction in virtual reality. PLOS ONE 12, 12 (12 2017), 1–19. https://doi.org/10.1371/journal.pone.0190109",
      "doi": ""
    },
    {
      "text": "Henrique G. Debarba, Eray Molla, Bruno Herbelin, and Ronan Boulic. 2015. Characterizing embodied interaction in First and Third Person Perspective viewpoints. In 2015 IEEE Symposium on 3D User Interfaces (3DUI). Institute of Electrical and Electronics Engineers Inc., 67–72. https://doi.org/10.1109/3DUI.2015.7131728",
      "doi": ""
    },
    {
      "text": "Diane Dewez, Rebecca Fribourg, Ferran Argelaguet, Ludovic Hoyet, Daniel Mestre, Mel Slater, and Anatole Lecuyer. 2019. Influence of personality traits and body awareness on the sense of embodiment in virtual reality, In 2019 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). Proceedings - 2019 IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2019, 123–134. https://doi.org/10.1109/ISMAR.2019.00-12",
      "doi": ""
    },
    {
      "text": "Nina Döllinger, Carolin Wienrich, and Marc Erich Latoschik. 2021. Challenges and Opportunities of Immersive Technologies for Mindfulness Meditation: A Systematic Review. Frontiers in Virtual Reality 2 (2021), 29. https://doi.org/10.3389/frvir.2021.644683",
      "doi": ""
    },
    {
      "text": "Nina Döllinger, Erik Wolf, David Mal, Nico Erdmannsdörfer, Mario Botsch, Marc Erich Latoschik, and Carolin Wienrich. 2022. Virtual Reality for Mind and Body: Does the Sense of Embodiment Towards a Virtual Body Affect Physical Body Awareness?. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, US). Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": "10.1145/3491101.3519613"
    },
    {
      "text": "Nina Döllinger, Erik Wolf, David Mal, Stephan Wenninger, Mario Botsch, Marc Erich Latoschik, and Carolin Wienrich. 2022. Resize Me! Exploring the User Experience of Embodied Realistic Modulatable Avatars for Body Image Intervention in Virtual Reality. Frontiers in Virtual Reality 3 (2022). https://doi.org/10.3389/frvir.2022.935449",
      "doi": ""
    },
    {
      "text": "Empatica. 2020. E4 wristband for real-time physiological signals. https://www.empatica.com/research/e4/",
      "doi": ""
    },
    {
      "text": "Eszter Ferentzi, Raechel Drew, Benedek T. Tihanyi, and Ferenc Köteles. 2018. Interoceptive accuracy and body awareness – Temporal and longitudinal associations in a non-clinical sample. Physiology & behavior 184 (2018), 100–107. https://doi.org/10.1016/j.physbeh.2017.11.015",
      "doi": ""
    },
    {
      "text": "Maria L. Filippetti and Manos Tsakiris. 2017. Heartfelt embodiment: Changes in body-ownership and self-identification produce distinct changes in interoceptive accuracy. Cognition 159(2017), 1–10. https://doi.org/10.1016/j.cognition.2016.11.002",
      "doi": ""
    },
    {
      "text": "Sarah Friedrich, Edgar Brunner, and Markus Pauly. 2017. Permuting longitudinal data in spite of the dependencies. Journal of Multivariate Analysis 153 (2017), 255–265. https://doi.org/10.1016/j.jmva.2016.10.004",
      "doi": "10.1016/j.jmva.2016.10.004"
    },
    {
      "text": "Sarah Friedrich, Frank Konietschke, and Markus Pauly. 2019. Resampling-based analysis of multivariate data and repeated measures designs with the R package MANOVA. RM.R J. 11, 2 (2019), 380.",
      "doi": ""
    },
    {
      "text": "Sarah Friedrich and Markus Pauly. 2018. MATS: Inference for potentially singular and heteroscedastic MANOVA. Journal of Multivariate Analysis 165 (2018), 166–179. https://doi.org/10.1016/j.jmva.2017.12.008",
      "doi": ""
    },
    {
      "text": "Elisabeth Ganal, Andrea Bartl, Franziska Westermeier, Daniel Roth, and Marc Erich Latoschik. 2020. Developing a Study Design on the Effects of Different MotionTracking Approaches on the User Embodiment in Virtual Reality. Mensch und Computer 2020-Workshopband(2020).",
      "doi": ""
    },
    {
      "text": "Gunvor Gard. 2005. Body awareness therapy for patients with fibromyalgia and chronic pain. Disability and rehabilitation 27, 12 (2005), 725–728. https://doi.org/10.1080/09638280400009071",
      "doi": ""
    },
    {
      "text": "Jonathan Gibson. 2019. Mindfulness, Interoception, and the Body: A Contemporary Perspective. Frontiers in Psychology 10 (9 2019). https://doi.org/10.3389/fpsyg.2019.02012",
      "doi": ""
    },
    {
      "text": "Geoffrey Gorisse, Olivier Christmann, and Simon Richir. 2017. First- and Third-Person Perspectives in Immersive Virtual Environments: Presence and Performance analysis of Embodied Users. Frontiers in Robotics and AI 4 (2017). https://doi.org/10.3389/frobt.2017.00033",
      "doi": ""
    },
    {
      "text": "Amanda L. Gyllensten, Kent Skoglund, and Inger Wulf. 2018. Basic Body Awareness Therapy: Embodied Identity. Vulkan.",
      "doi": ""
    },
    {
      "text": "Adam W. Hanley, Wolf E. Mehling, and Eric L. Garland. 2017. Holding the body in mind: Interoceptive awareness, dispositional mindfulness and psychological well-being. Journal of Psychosomatic Research 99 (8 2017), 13–20. https://doi.org/10.1016/j.jpsychores.2017.05.014",
      "doi": ""
    },
    {
      "text": "Ding He, Fuhu Liu, Dave Pape, Greg Dawe, and Dan Sandin. 2000. Video-based measurement of system latency. In International Immersive Projection Technology Workshop. 1–6. https://doi.org/10.1080/09638280400009071",
      "doi": ""
    },
    {
      "text": "Emily Hielscher and Regine Zopf. 2021. Interoceptive Abnormalities and Suicidality: A Systematic Review. Behavior Therapy 52, 5 (2021), 1035–1054. https://doi.org/10.1016/j.beth.2021.02.012 Interoceptive Dysfunction and Suicidality.",
      "doi": ""
    },
    {
      "text": "Chin-Chang Ho and Karl F MacDorman. 2017. Measuring the uncanny valley effect. International Journal of Social Robotics 9, 1 (2017), 129–139. https://doi.org/10.1007/s12369-016-0380-9",
      "doi": ""
    },
    {
      "text": "Yasuyuki Inoue and Michiteru Kitazaki. 2021. Virtual Mirror and Beyond: The Psychological Basis for Avatar Embodiment via a Mirror. Journal of Robotics and Mechatronics 33, 5 (2021), 1004–1012. https://doi.org/10.20965/jrm.2021.p1004",
      "doi": ""
    },
    {
      "text": "Shunichi Kasahara, Keina Konno, Richi Owaki, Tsubasa Nishi, Akiko Takeshita, Takayuki Ito, Shoko Kasuga, and Junichi Ushiba. 2017. Malleable embodiment: Changing sense of embodiment by spatial-temporal deformation of virtual human body. Conference on Human Factors in Computing Systems - Proceedings 2017-May, 6438–6448. https://doi.org/10.1145/3025453.3025962",
      "doi": "10.1145/3025453.3025962"
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The International Journal of Aviation Psychology 3, 3 (1993), 203–220. https://doi.org/10.1207/s15327108 ijap0303_3",
      "doi": ""
    },
    {
      "text": "Nayla M. Khoury, Jacqueline Lutz, and Zev Schuman-Olivier. 2018. Interoception in psychiatric disorders: A review of randomized controlled trials with interoception-based interventions. Harvard review of psychiatry 26, 5 (2018), 250. https://doi.org/10.1097/HRP.0000000000000170",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Raphaela Groten, and Mel Slater. 2012. The sense of embodiment in virtual reality. Presence: Teleoperators & Virtual Environments 21, 4(2012), 373–387. https://doi.org/10.1162/PRES_a_00124",
      "doi": "10.1162/PRES_a_00124"
    },
    {
      "text": "Konstantina Kilteni, Jean-Marie Normand, Maria V Sanchez-Vives, and Mel Slater. 2012. Extending body space in immersive virtual reality: a very long arm illusion. PloS one 7, 7 (2012), e40867.",
      "doi": ""
    },
    {
      "text": "Marc Erich Latoschik, Jean-Luc Lugrin, and Daniel Roth. 2016. FakeMi: A Fake Mirror System for Avatar Embodiment Studies. In Proceedings of the 22nd ACM Conference on Virtual Reality Software and Technology (Munich, Germany) (VRST ’16). Association for Computing Machinery, New York, NY, USA, 73–76. https://doi.org/10.1145/2993369.2993399",
      "doi": "10.1145/2993369.2993399"
    },
    {
      "text": "Marc Erich Latoschik and Carolin Wienrich. 2022. Congruence and Plausibility, Not Presence: Pivotal Conditions for XR Experiences and Effects, a Novel Approach. Frontiers in Virtual Reality 3 (2022). https://doi.org/10.3389/frvir.2022.694433",
      "doi": ""
    },
    {
      "text": "LimeSurvey GmbH. 2020. LimeSurvey 4. Retrieved September 30, 2021 from https://www.limesurvey.org https://www.limesurvey.org.",
      "doi": ""
    },
    {
      "text": "Joan Llobera, Maria V. Sanchez-Vives, and Mel Slater. 2013. The relationship between virtual body ownership and temperature sensitivity. Journal of the Royal Society Interface 10 (8 2013). Issue 85. https://doi.org/10.1098/rsif.2013.0300",
      "doi": ""
    },
    {
      "text": "Lara Maister and Manos Tsakiris. 2014. My face, my heart: Cultural differences in integrated bodily self-awareness. Cognitive neuroscience 5, 1 (2014), 10–16. https://doi.org/10.1080/17588928.2013.808613",
      "doi": ""
    },
    {
      "text": "David Mal, Erik Wolf, Nina Döllinger, Mario Botsch, Carolin Wienrich, and Marc Erich Latoschik. 2022. Virtual Human Coherence and Plausibility – Towards a Validated Scale. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). 788–789. https://doi.org/10.1109/VRW55335.2022.00245",
      "doi": ""
    },
    {
      "text": "Wolf E. Mehling, Michael Acree, Anita Stewart, Jonathan Silas, and Alexander Jones. 2018. The multidimensional assessment of interoceptive awareness, version 2 (MAIA-2). PloS one 13, 12 (2018), 12 pages. https://doi.org/10.1371/journal.pone.0208034",
      "doi": ""
    },
    {
      "text": "Wolf E. Mehling, Viranjini Gopisetty, Jennifer Daubenmier, Cynthia J. Price, Frederick M. Hecht, and Anita Stewart. 2009. Body awareness: construct and self-report measures. PloS one 4, 5 (2009), e5614. https://doi.org/10.1371/journal.pone.0005614",
      "doi": ""
    },
    {
      "text": "Wolf E. Mehling, Judith Wrubel, Jennifer J. Daubenmier, Cynthia J. Price, Catherine E. Kerr, Theresa Silow, Viranjini Gopisetty, and Anita L. Stewart. 2011. Body Awareness: a phenomenological inquiry into the common ground of mind-body therapies. Philosophy, ethics, and humanities in medicine 6, 1 (2011), 1–12. https://doi.org/10.1186/1747-5341-6-6",
      "doi": ""
    },
    {
      "text": "Bonnie Moradi and Julia R. Varnes. 2017. Structure of the objectified body consciousness scale: Reevaluated 20 years later. Sex Roles 77, 5 (2017), 325–337. https://doi.org/10.1007/s11199-016-0731-x",
      "doi": ""
    },
    {
      "text": "Jean-Marie Normand, Elias Giannopoulos, Bernhard Spanlang, and Mel Slater. 2011. Multisensory stimulation can induce an illusion of larger belly size in immersive virtual reality. PLOS ONE 6, 1 (2011), e16128. https://doi.org/10.1371/journal.pone.0016128",
      "doi": ""
    },
    {
      "text": "Martin P. Paulus and Murray B. Stein. 2010. Interoception in anxiety and depression. Brain structure and Function 214, 5 (2010), 451–463. https://doi.org/10.1007/s00429-010-0258-9",
      "doi": ""
    },
    {
      "text": "Ivelina V. Piryankova, Hong Yu Wong, Sally A. Linkenauger, Catherine Stinson, Matthew R. Longo, Heinrich H. Bülthoff, and Betty J. Mohler. 2014. Owning an overweight or underweight body: Distinguishing the physical, experienced and virtual body. PLOS ONE 9, 8 (2014), e103428. https://doi.org/10.1371/journal.pone.0103428",
      "doi": ""
    },
    {
      "text": "Beatriz Rey, Alejandro Oliver, Jose M. Monzo, and Inmaculada Riquelme. 2022. Development and Testing of a Portable Virtual Reality-Based Mirror Visual Feedback System with Behavioral Measures Monitoring. International Journal of Environmental Research and Public Health 19, 4(2022), 20 pages. https://doi.org/10.3390/ijerph19042276",
      "doi": ""
    },
    {
      "text": "Daniel Roth and Marc Erich Latoschik. 2020. Construction of the Virtual Embodiment Questionnaire (VEQ). IEEE Transactions on Visualization and Computer Graphics 26, 12(2020), 3546–3556. https://doi.org/10.1109/TVCG.2020.3023603",
      "doi": ""
    },
    {
      "text": "Rainer Schandry. 1981. Heart beat perception and emotional experience. Psychophysiology 18, 4 (1981), 483–488. https://doi.org/10.1111/j.1469-8986.1981.tb02486.x",
      "doi": ""
    },
    {
      "text": "Kimberly B. Schauder, Lisa E. Mash, Lauren K. Bryant, and Carissa J. Cascio. 2015. Interoceptive ability and body awareness in autism spectrum disorder. Journal of Experimental Child Psychology 131 (3 2015), 193–200. https://doi.org/10.1016/j.jecp.2014.11.002",
      "doi": ""
    },
    {
      "text": "Meral Sertel, Tülay T. Şimşek, and Eylem T. Yümin. 2021. The Effect of Body Awareness Therapy on Pain, Fatigue and Health-related Quality of Life in Female Patients with Tension-type Headaches and Migraine.West Indian Medical Journal 69, 2 (2021), 121–128. https://doi.org/10.7727/wimj.2015.304",
      "doi": ""
    },
    {
      "text": "Richard Skarbez, Joe Gabbard, Doug A. Bowman, Todd Ogle, and Thomas Tucker. 2021. Virtual replicas of real places: Experimental investigations. IEEE Transactions on Visualization and Computer Graphics (2021), 1–1. https://doi.org/10.1109/TVCG.2021.3096494",
      "doi": "10.1109/TVCG.2021.3096494"
    },
    {
      "text": "Bernhard Spanlang, Jean-Marie Normand, David Borland, Konstantina Kilteni, Elias Giannopoulos, Ausiàs Pomés, Mar González-Franco, Daniel Perez-Marcos, Jorge Arroyo-Palacios, Xavi Navarro Muncunill, 2014. How to build an embodiment lab: achieving body representation illusions in virtual reality. Frontiers in Robotics and AI 1 (2014), 9. https://doi.org/10.3389/frobt.2014.00009",
      "doi": ""
    },
    {
      "text": "Jan-Philipp Stauffert, Kristof Korwisi, Florian Niebling, and Marc Erich Latoschik. 2021. Ka-Boom!!! Visually Exploring Latency Measurements for XR. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI EA ’21). Association for Computing Machinery, New York, NY, USA, Article 20, 9 pages. https://doi.org/10.1145/3411763.3450379",
      "doi": "10.1145/3411763.3450379"
    },
    {
      "text": "Jan-Philipp Stauffert, Florian Niebling, and Marc Erich Latoschik. 2018. Effects of Latency Jitter on Simulator Sickness in a Search Task. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 121–127. https://doi.org/10.1109/VR.2018.8446195",
      "doi": ""
    },
    {
      "text": "Jan-Philipp Stauffert, Florian Niebling, and Marc Erich Latoschik. 2020. Latency and Cybersickness: Impact, Causes, and Measures. A Review. Frontiers in Virtual Reality 1 (2020). https://doi.org/10.3389/frvir.2020.582204",
      "doi": ""
    },
    {
      "text": "Ana Tajadura-Jiménez and Manos Tsakiris. 2014. Balancing the \"inner\" and the \"outer\" self: Interoceptive sensitivity modulates self-other boundaries. Journal of Experimental Psychology: General 143 (2014), 736–744. Issue 2. https://doi.org/10.1037/a0033171",
      "doi": ""
    },
    {
      "text": "Galia Tanay and Amit Bernstein. 2013. State Mindfulness Scale (SMS): development and initial validation.Psychological assessment 25, 4 (2013), 1286. https://doi.org/10.1037/a0034044",
      "doi": ""
    },
    {
      "text": "Manos Tsakiris, Ana Tajadura Jiménez, and Marcello Costantini. 2011. Just a heartbeat away from one’s body: interoceptive sensitivity predicts malleability of body-representations. Proceedings of the Royal Society B: Biological Sciences 278, 1717(2011), 2470–2476. https://doi.org/10.1098/rspb.2010.2547",
      "doi": ""
    },
    {
      "text": "Manos Tsakiris, Gita Prabhu, and Patrick Haggard. 2006. Having a body versus moving your body: How agency structures body-ownership. Consciousness and Cognition 15, 2 (2006), 423–432. https://doi.org/10.1016/j.concog.2005.09.004",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2020. Unity Real-Time Development Platform. Retrieved January 10, 2022 from https://unity.com",
      "doi": ""
    },
    {
      "text": "Martin Usoh, Ernest Catena, Sima Arman, and Mel Slater. 2000. Using presence questionnaires in reality. Presence 9, 5 (2000), 497–503. https://doi.org/10.1162/105474600566989",
      "doi": "10.1162/105474600566989"
    },
    {
      "text": "Valve Corporation. 2021. SteamVR. Retrieved January 10, 2022 from https://assetstore.unity.com/packages/tools/integration/steamvr-plugin-32647",
      "doi": ""
    },
    {
      "text": "Albert H. Van der Veer, Matthew R. Longo, Adrian J. Alsmith, Hong Yu Wong, and Betty J. Mohler. 2019. Self and body part localization in virtual reality: Comparing a headset and a large-screen immersive display. Frontiers Robotics AI 6(2019). Issue APR. https://doi.org/10.3389/frobt.2019.00033",
      "doi": ""
    },
    {
      "text": "Matti Vuorre and Niall Bolger. 2018. Within-subject mediation analysis for experimental data in cognitive psychology and neuroscience. Behavior Research Methods 50, 5 (2018), 2125–2143. https://doi.org/10.3758/s13428-017-0980-9",
      "doi": ""
    },
    {
      "text": "Thomas Waltemate, Dominik Gall, Daniel Roth, Mario Botsch, and Marc Erich Latoschik. 2018. The impact of avatar personalization and immersion on virtual body ownership, presence, and emotional response. IEEE Transactions on Visualization and Computer Graphics 24, 4(2018), 1643–1652. https://doi.org/10.1109/TVCG.2018.2794629",
      "doi": "10.1109/TVCG.2018.2794629"
    },
    {
      "text": "Maren Wehrle. 2020. Being a body and having a body. The twofold temporality of embodied intentionality. Phenomenology and the Cognitive Sciences 19, 3 (2020), 499–521. https://doi.org/10.1007/s11097-019-09610-z",
      "doi": ""
    },
    {
      "text": "Margaret Wilson. 2002. Six views of embodied cognition. Psychonomic bulletin & review 9, 4 (2002), 625–636. https://doi.org/10.3758/BF03196322",
      "doi": ""
    },
    {
      "text": "Erik Wolf, Nina Döllinger, David Mal, Stephan Wenninger, Bartl Andrea, Mario Botsch, Marc Erich Latoschik, and Carolin Wienrich. 2022. Does Distance Matter? Embodiment and Perception of Personalized Avatars in Relation to the Self-Observation Distance in Virtual Reality. Frontiers in Virtual Reality 3 (2022). https://doi.org/10.3389/frvir.2022.1031093",
      "doi": ""
    },
    {
      "text": "Erik Wolf, Nina Döllinger, David Mal, Carolin Wienrich, Mario Botsch, and Marc Erich Latoschik. 2020. Body Weight Perception of Females using Photorealistic Avatars in Virtual and Augmented Reality. In 2020 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). 462–473. https://doi.org/10.1109/ISMAR50242.2020.00071",
      "doi": ""
    },
    {
      "text": "Erik Wolf, Marie Luisa Fiedler, Nina Döllinger, Carolin Wienrich, and Marc Erich Latoschik. 2022. Exploring Presence, Avatar Embodiment, and Body Perception with a Holographic Augmented Reality Mirror. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 350–359. https://doi.org/10.1109/VR51125.2022.00054",
      "doi": ""
    },
    {
      "text": "Erik Wolf, Nathalie Merdan, Nina Döllinger, David Mal, Carolin Wienrich, Mario Botsch, and Marc Erich Latoschik. 2021. The Embodiment of Photorealistic Avatars Influences Female Body Weight Perception in Virtual Reality. In 2021 IEEE Virtual Reality and 3D User Interfaces (VR). IEEE, 65–74. https://doi.org/10.1109/VR50410.2021.00027",
      "doi": ""
    }
  ]
}