{
  "doi": "10.1145/3544548.3580751",
  "title": "Playful Reflection: Impact of Gamification on a Virtual Reality Simulation of Breastfeeding",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Gamification is a popular technique to improve task engagement, and has broadly been deployed in health and education to a point where many users now expect gameful experiences in these settings. However, gamification has been criticised for being a potential obstacle to the experience of reflection. Motivated by this tension, our work examines how the addition of gamification to a Virtual Reality simulation of breastfeeding impacts player experience and reflection. Using a within-subjects design, we invited 34 participants to take part in a mixed-methods evaluation of a gamified and non-gamified variant of the simulation that included questionnaires and semi-structured interviews. Results show that gamification improved player experience and encouraged players to reflect on goal achievement and performance. However, it also diverted players’ attention from nuances within the act of nursing. Drawing on our findings, we contribute considerations for the application of gamification in personal and sensitive settings such as breastfeeding.",
  "authors": [
    {
      "name": "Kymeng Tang",
      "institution": "Department of Computer Science, KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319525",
      "orcid": "0000-0002-8221-2677"
    },
    {
      "name": "Kathrin Gerling",
      "institution": "Department of Informatics, Human-Computer Interaction and Accessibility, Karlsruhe Institute of Technology, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657431",
      "orcid": "0000-0002-8449-6124"
    },
    {
      "name": "Vero Vanden Abeele",
      "institution": "Department of Computer Sciences, KU Leuven, Belgium",
      "img": "/do/10.1145/contrib-81416596596/rel-imgonly/polaroid_vero_v4.png",
      "acmid": "81416596596",
      "orcid": "0000-0002-3031-9579"
    },
    {
      "name": "Luc Geurts",
      "institution": "e-Media Research Lab, KU Leuven, Belgium",
      "img": "/do/10.1145/contrib-81479650302/rel-imgonly/photo.jpg",
      "acmid": "81479650302",
      "orcid": "0000-0002-9608-9147"
    },
    {
      "name": "Maria Aufheimer",
      "institution": "Department of Informatics, Human-Computer Interaction and Accessibility, Karlsruhe Institute of Technology, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078429",
      "orcid": "0000-0003-2360-7799"
    }
  ],
  "references": [
    {
      "text": "Vero Vanden Abeele, Katta Spiel, Lennart Nacke, Daniel Johnson, and Kathrin Gerling. 2020. Development and validation of the player experience inventory: A scale to measure player experiences at the level of functional and psychosocial consequences. International Journal of Human-Computer Studies 135 (2020), 102370. https://doi.org/10.1016/j.ijhcs.2019.102370",
      "doi": "10.1016/j.ijhcs.2019.102370"
    },
    {
      "text": "Sojung Bahng, Ryan M. Kelly, and Jon McCormack. 2020. Reflexive VR Storytelling Design Beyond Immersion: Facilitating Self-Reflection on Death and Loneliness. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376582",
      "doi": "10.1145/3313831.3376582"
    },
    {
      "text": "Eric P.S. Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 585–594. https://doi.org/10.1145/2702123.2702234",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Eric P.S. Baumer, Vera Khovanskaya, Mark Matthews, Lindsay Reynolds, Victoria Schwanda Sosik, and Geri Gay. 2014. Reviewing Reflection: On the Use of Reflection in Interactive System Design. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 93–102. https://doi.org/10.1145/2598510.2598598",
      "doi": "10.1145/2598510.2598598"
    },
    {
      "text": "Vítor Belim, Olga Lyra, Pedro Teixeira, Ana Caraban, Maria José Ferreira, Rúben Gouveia, Andrés Lucero, and Evangelos Karapanos. 2014. Beyond Gamification: Sociometric Technologies That Encourage Reflection before Behavior Change. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (Funchal, Portugal) (ACE ’14). Association for Computing Machinery, New York, NY, USA, Article 27, 6 pages. https://doi.org/10.1145/2663806.2663828",
      "doi": "10.1145/2663806.2663828"
    },
    {
      "text": "Marit Bentvelzen, Jasmin Niess, and Paweł W. Woźniak. 2021. The Technology-Mediated Reflection Model: Barriers and Assistance in Data-Driven Reflection. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 246, 12 pages. https://doi.org/10.1145/3411764.3445505",
      "doi": "10.1145/3411764.3445505"
    },
    {
      "text": "Marit Bentvelzen, Paweł W. Woźniak, Pia S.F. Herbes, Evropi Stefanidi, and Jasmin Niess. 2022. Revisiting Reflection in HCI: Four Design Resources for Technologies That Support Reflection. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 1, Article 2 (mar 2022), 27 pages. https://doi.org/10.1145/3517233",
      "doi": "10.1145/3517233"
    },
    {
      "text": "Max V. Birk, Regan L. Mandryk, and Cheralyn Atkins. 2016. The Motivational Push of Games: The Interplay of Intrinsic Motivation and External Rewards in Games for Training. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (Austin, Texas, USA) (CHI PLAY ’16). Association for Computing Machinery, New York, NY, USA, 291–303. https://doi.org/10.1145/2967934.2968091",
      "doi": "10.1145/2967934.2968091"
    },
    {
      "text": "James Brown, Kathrin Gerling, Patrick Dickinson, and Ben Kirman. 2015. Dead Fun: Uncomfortable Interactions in a Virtual Reality Game for Coffins. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ’15). Association for Computing Machinery, New York, NY, USA, 475–480. https://doi.org/10.1145/2793107.2810307",
      "doi": "10.1145/2793107.2810307"
    },
    {
      "text": "Jaehee Cho, Atit Kothari, Zixu Ding, Yeongmin Won, Stephanie Fawaz, and Xu Cheng. 2016. Injustice: Interactive Live Action Virtual Reality Experience. In ACM SIGGRAPH 2016 VR Village(Anaheim, California) (SIGGRAPH ’16). Association for Computing Machinery, New York, NY, USA, Article 9, 2 pages. https://doi.org/10.1145/2929490.2929493",
      "doi": "10.1145/2929490.2929493"
    },
    {
      "text": "Carlos Cruz, Michael D. Hanus, and Jesse Fox. 2017. The need to achieve: Players’ perceptions and uses of extrinsic meta-game reward systems for video game consoles. Computers in Human Behavior 71 (2017), 516–524. https://doi.org/10.1016/j.chb.2015.08.017",
      "doi": "10.1016/j.chb.2015.08.017"
    },
    {
      "text": "Robin De Croon, Jonas Geuens, Katrien Verbert, and Vero Vanden Abeele. 2021. A Systematic Review of the Effect of Gamification on Adherence Across Disciplines. In HCI in Games: Experience Design and Game Mechanics, Xiaowen Fang (Ed.). Springer International Publishing, Cham, 168–184.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding. 2014. Eudaimonic Design, or: Six Invitations to Rethink Gamification. meson press, Lüneburg, Germany, 305–331.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From Game Design Elements to Gamefulness: Defining \"Gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (Tampere, Finland) (MindTrek ’11). Association for Computing Machinery, New York, NY, USA, 9–15. https://doi.org/10.1145/2181037.2181040",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Rowanne Fleck and Geraldine Fitzpatrick. 2010. Reflecting on Reflection: Framing a Design Landscape. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction (Brisbane, Australia) (OZCHI ’10). Association for Computing Machinery, New York, NY, USA, 216–223. https://doi.org/10.1145/1952222.1952269",
      "doi": "10.1145/1952222.1952269"
    },
    {
      "text": "Kathrin Gerling, Kieran Hicks, Laura Buttrick, Chris Headleand, Ben Williams, Jason Hall, Kymeng Tang, Luc Geurts, and Wei Chen. 2018. Potential and Limitations of Playful Technology to Support Infant Feeding. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts(CHI PLAY ’18 Extended Abstracts). ACM, New York, NY, USA, 431–437. https://doi.org/10.1145/3270316.3271519",
      "doi": "10.1145/3270316.3271519"
    },
    {
      "text": "Chad Phoenix Rose Gowler and Ioanna Iacovides. 2019. \"Horror, Guilt and Shame\" – Uncomfortable Experiences in Digital Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 325–337. https://doi.org/10.1145/3311350.3347179",
      "doi": "10.1145/3311350.3347179"
    },
    {
      "text": "Jonathan Gutman. 1982. A Means-End Chain Model Based on Consumer Categorization Processes. Journal of Marketing 46, 2 (Apr 1982), 60–72. https://doi.org/10.1177/002224298204600207",
      "doi": ""
    },
    {
      "text": "Lasse Hakulinen, Tapio Auvinen, and Ari Korhonen. 2013. Empirical Study on the Effect of Achievement Badges in TRAKLA2 Online Learning Environment. In 2013 Learning and Teaching in Computing and Engineering. IEEE, Danvers, MA, USA, 47–54. https://doi.org/10.1109/LaTiCE.2013.34",
      "doi": "10.1109/LaTiCE.2013.34"
    },
    {
      "text": "Juho Hamari. 2017. Do Badges Increase User Activity? A Field Experiment on the Effects of Gamification. Comput. Hum. Behav. 71, C (jun 2017), 469–478. https://doi.org/10.1016/j.chb.2015.03.036",
      "doi": "10.1016/j.chb.2015.03.036"
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does Gamification Work? – A Literature Review of Empirical Studies on Gamification. In 2014 47th Hawaii International Conference on System Sciences. IEEE, Danvers, MA, USA, 3025–3034. https://doi.org/10.1109/HICSS.2014.377",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, Amsterdam, the Netherlands, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Kieran Hicks, Kathrin Gerling, Patrick Dickinson, and Vero Vanden Abeele. 2019. Juicy Game Design: Understanding the Impact of Visual Embellishments on Player Experience. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 185–197. https://doi.org/10.1145/3311350.3347171",
      "doi": "10.1145/3311350.3347171"
    },
    {
      "text": "Kieran Hicks, Kathrin Gerling, Patrick Dickinson, and Vero Vanden Abeele. 2019. Juicy Game Design: Understanding the Impact of Visual Embellishments on Player Experience. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 185–197. https://doi.org/10.1145/3311350.3347171",
      "doi": "10.1145/3311350.3347171"
    },
    {
      "text": "Robin Hunicke, Marc LeBlanc, Robert Zubek, 2004. MDA: A formal approach to game design and game research. In Proceedings of the AAAI Workshop on Challenges in Game AI, Vol. 4. AAAI, San Jose, CA, 1722.",
      "doi": ""
    },
    {
      "text": "Kai Huotari and Juho Hamari. 2012. Defining gamification: a service marketing perspective. In Proceeding of the 16th International Academic MindTrek Conference(MindTrek ’12). Association for Computing Machinery, New York, NY, USA, 17–22. https://doi.org/10.1145/2393132.2393137",
      "doi": "10.1145/2393132.2393137"
    },
    {
      "text": "Ioanna Iacovides, Anna Cox, Richard Kennedy, Paul Cairns, and Charlene Jennett. 2015. Removing the HUD: The Impact of Non-Diegetic Game Elements and Expertise on Player Involvement. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ’15). Association for Computing Machinery, New York, NY, USA, 13–22. https://doi.org/10.1145/2793107.2793120",
      "doi": "10.1145/2793107.2793120"
    },
    {
      "text": "Ioanna Iacovides and Anna L. Cox. 2015. Moving Beyond Fun: Evaluating Serious Experience in Digital Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2245–2254. https://doi.org/10.1145/2702123.2702204",
      "doi": "10.1145/2702123.2702204"
    },
    {
      "text": "Ioanna Iacovides, Joe Cutting, Jen Beeston, Marta E. Cecchinato, Elisa D. Mekler, and Paul Cairns. 2022. Close but Not Too Close: Distance and Relevance in Designing Games for Reflection. Proc. ACM Hum.-Comput. Interact. 6, CHI PLAY, Article 224 (oct 2022), 24 pages. https://doi.org/10.1145/3549487",
      "doi": "10.1145/3549487"
    },
    {
      "text": "Katherine Isbister, Mary Flanagan, and Chelsea Hash. 2010. Designing Games for Learning: Insights from Conversations with Designers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 2041–2044. https://doi.org/10.1145/1753326.1753637",
      "doi": "10.1145/1753326.1753637"
    },
    {
      "text": "Daniel Johnson, Sebastian Deterding, Kerri-Ann Kuhn, Aleksandra Staneva, Stoyan Stoyanov, and Leanne Hides. 2016. Gamification for health and wellbeing: A systematic review of the literature. Internet Interventions 6 (Nov. 2016), 89–106. https://doi.org/10.1016/j.invent.2016.10.002",
      "doi": ""
    },
    {
      "text": "Rilla Khaled. 2018. Questions Over Answers: Reflective Game Design. Springer, Singapore, 3–27. https://doi.org/10.1007/978-981-10-1891-6_1",
      "doi": ""
    },
    {
      "text": "Tae Wan Kim and Kevin Werbach. 2016. More than just a game: ethical issues in gamification. Ethics and Information Technology 18, 2 (Jun 2016), 157–173. https://doi.org/10.1007/s10676-016-9401-5",
      "doi": "10.1007/s10676-016-9401-5"
    },
    {
      "text": "Janaki Kumar. 2013. Gamification at Work: Designing Engaging Business Software. In Design, User Experience, and Usability. Health, Learning, Playing, Cultural, and Cross-Cultural User Experience, Aaron Marcus (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 528–537.",
      "doi": ""
    },
    {
      "text": "Richard N. Landers, Kristina N. Bauer, and Rachel C. Callan. 2017. Gamification of task performance with leaderboards: A goal setting experiment. Computers in Human Behavior 71 (2017), 508–515. https://doi.org/10.1016/j.chb.2015.08.008",
      "doi": "10.1016/j.chb.2015.08.008"
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Chapter 3 - Experimental design. Morgan Kaufmann, Boston, USA, 45–69. https://doi.org/10.1016/B978-0-12-805390-4.00003-0",
      "doi": ""
    },
    {
      "text": "Thomas W. Malone. 1980. What Makes Things Fun to Learn? Heuristics for Designing Instructional Computer Games. In Proceedings of the 3rd ACM SIGSMALL Symposium and the First SIGPC Symposium on Small Systems (Palo Alto, California, USA) (SIGSMALL ’80). Association for Computing Machinery, New York, NY, USA, 162–169. https://doi.org/10.1145/800088.802839",
      "doi": "10.1145/800088.802839"
    },
    {
      "text": "Tim Marsh and Brigid Costello. 2013. Lingering Serious Experience as Trigger to Raise Awareness, Encourage Reflection and Change Behavior. In Persuasive Technology(Lecture Notes in Computer Science), Shlomo Berkovsky and JillEditors Freyne (Eds.). Springer, Berlin, Heidelberg, 116–124. https://doi.org/10.1007/978-3-642-37157-8_15",
      "doi": "10.1007/978-3-642-37157-8_15"
    },
    {
      "text": "Elisa D. Mekler, Julia Ayumi Bopp, Alexandre N. Tuch, and Klaus Opwis. 2014. A Systematic Review of Quantitative Studies on the Enjoyment of Digital Entertainment Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 927–936. https://doi.org/10.1145/2556288.2557078",
      "doi": "10.1145/2556288.2557078"
    },
    {
      "text": "Elisa D. Mekler, Florian Brühlmann, Klaus Opwis, and Alexandre N. Tuch. 2013. Do Points, Levels and Leaderboards Harm Intrinsic Motivation? An Empirical Analysis of Common Gamification Elements. In Proceedings of the First International Conference on Gameful Design, Research, and Applications (Toronto, Ontario, Canada) (Gamification ’13). Association for Computing Machinery, New York, NY, USA, 66–73. https://doi.org/10.1145/2583008.2583017",
      "doi": "10.1145/2583008.2583017"
    },
    {
      "text": "Elisa D. Mekler, Florian Brühlmann, Alexandre N. Tuch, and Klaus Opwis. 2017. Towards understanding the effects of individual gamification elements on intrinsic motivation and performance. Computers in Human Behavior 71 (2017), 525–534. https://doi.org/10.1016/j.chb.2015.08.048",
      "doi": "10.1016/j.chb.2015.08.048"
    },
    {
      "text": "Elisa D. Mekler, Ioanna Iacovides, and Julia Ayumi Bopp. 2018. “A Game that Makes You Question...”: Exploring the Role of Reflection for the Player Experience. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’18). Association for Computing Machinery, New York, NY, USA, 315–327. https://doi.org/10.1145/3242671.3242691",
      "doi": "10.1145/3242671.3242691"
    },
    {
      "text": "Sebastian Misztal and Jonas Schild. 2022. Visual Delegate Generalization Frame – Evaluating Impact of Visual Effects and Elements on Player and User Experiences in Video Games and Interactive Virtual Environments. In CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 191, 20 pages. https://doi.org/10.1145/3491102.3501885",
      "doi": "10.1145/3491102.3501885"
    },
    {
      "text": "Matt Kucic October 26 and 2005. 2005. How to Prototype a Game in Under 7 Days. https://www.gamedeveloper.com/disciplines/how-to-prototype-a-game-in-under-7-days",
      "doi": ""
    },
    {
      "text": "Margaree Peacocke, Robert J. Teather, Jacques Carette, I. Scott MacKenzie, and Victoria McArthur. 2018. An empirical comparison of first-person shooter information displays: HUDs, diegetic displays, and spatial representations. Entertainment Computing 26 (2018), 41–58. https://doi.org/10.1016/j.entcom.2018.01.003",
      "doi": ""
    },
    {
      "text": "S. Price, Y. Rogers, D. Stanton, and H. Smith. 2003. A New Conceptual Framework for CSCL. Springer Netherlands, Dordrecht, 513–522. https://doi.org/10.1007/978-94-017-0195-2_61",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist 55, 1 (2000), 68–78. https://doi.org/10.1037/0003-066X.55.1.68",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4 (Dec. 2006), 344–360. https://doi.org/10.1007/s11031-006-9051-8",
      "doi": ""
    },
    {
      "text": "Virginia Schmied, Sarah Beake, Athena Sheehan, Christine McCourt, and Fiona Dykes. 2011. Women’s Perceptions and Experiences of Breastfeeding Support: A Metasynthesis. Birth 38, 1 (Mar 2011), 49–60. https://doi.org/10.1111/j.1523-536X.2010.00446.x",
      "doi": ""
    },
    {
      "text": "Katie Seaborn and Deborah I. Fels. 2015. Gamification in theory and action: A survey. International Journal of Human-Computer Studies 74 (Feb. 2015), 14–31. https://doi.org/10.1016/j.ijhcs.2014.09.006",
      "doi": "10.1016/j.ijhcs.2014.09.006"
    },
    {
      "text": "Penelope Sweetser and Peta Wyeth. 2005. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment 3, 3 (Jul 2005), 3. https://doi.org/10.1145/1077246.1077253",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, and Luc Geurts. 2021. Virtual Feed: A Simulated Breastfeeding Experience in Virtual Reality. In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3411763.3451575",
      "doi": "10.1145/3411763.3451575"
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, and Luc Geurts. 2022. Challenges and Opportunities for Playful Technology in Health Prevention: Using Virtual Reality to Supplement Breastfeeding Education. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, Danvers, MA, USA, 406–409. https://doi.org/10.1109/VRW55335.2022.00088",
      "doi": ""
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, and Luc Geurts. 2022. Virtual Feed: Design and Evaluation of a Virtual Reality Simulation Addressing the Lived Experience of Breastfeeding. In CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 438, 17 pages. https://doi.org/10.1145/3491102.3517620",
      "doi": "10.1145/3491102.3517620"
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, Luc Geurts, and Katta Spiel. 2021. Understanding the Role of Technology to Support Breastfeeding. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Online - Yokohama, Japan) (CHI ’21). Association for Computing Machinery; New York, NY, USA, New York, NY, USA, 1–13. https://doi.org/10.1145/3411764.3445247",
      "doi": "10.1145/3411764.3445247"
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, Marnix Lijnen, Marten Geets, Maria Aufheimer, Luc Geurts, and Joke Muyldermans. forthcoming. Supporting Partner Involvement in Breastfeeding Education Through a Gamified Mobile App: System Design and Mixed-Method Exploratory Study. (forthcoming).",
      "doi": ""
    },
    {
      "text": "Mattia Thibault and Juho Hamari. 2021. Seven Points to Reappropriate Gamification. Springer International Publishing, Cham, 11–28. https://doi.org/10.1007/978-3-030-68207-1_2",
      "doi": ""
    },
    {
      "text": "Raphael Vallat. 2018. Pingouin: statistics in Python. Journal of Open Source Software 3, 31 (Nov 2018), 1026. https://doi.org/10.21105/joss.01026",
      "doi": ""
    },
    {
      "text": "Rob van Roy and Bieke Zaman. 2015-04-01. Moving Beyond the Effectiveness of Gamification.",
      "doi": ""
    },
    {
      "text": "Rob van Roy and Bieke Zaman. 2017. Why Gamification Fails in Education and How to Make It Successful: Introducing Nine Gamification Heuristics Based on Self-Determination Theory. Springer International Publishing, Cham, 485–509. https://doi.org/10.1007/978-3-319-51645-5_22",
      "doi": ""
    },
    {
      "text": "Erika Noll Webb. 2013. Gamification: When It Works, When It Doesn’t. In Design, User Experience, and Usability. Health, Learning, Playing, Cultural, and Cross-Cultural User Experience(Lecture Notes in Computer Science), AaronEditor Marcus (Ed.). Springer, Berlin, Heidelberg, 608–614. https://doi.org/10.1007/978-3-642-39241-2_67",
      "doi": "10.1007/978-3-642-39241-2_67"
    },
    {
      "text": "Becky K. White, Roslyn C. Giglia, Jane A. Scott, and Sharyn K. Burns. 2018. How New and Expecting Fathers Engage With an App-Based Online Forum: Qualitative Analysis. JMIR mHealth and uHealth 6, 6 (June 2018), e144. https://doi.org/10.2196/mhealth.9999",
      "doi": ""
    },
    {
      "text": "Carolin Wiedemann and Soenke Zehle. 2012. Depletion design: a glossary of network ecologies. Institute of Network Cultures, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Josef Wiemeyer, Lennart Nacke, Christiane Moser, and Florian ‘Floyd’ Mueller. 2016. Player Experience. Springer International Publishing, Cham, 243–271. https://doi.org/10.1007/978-3-319-40612-1_9",
      "doi": ""
    },
    {
      "text": "Iain Williamson, Dawn Leeming, Steven Lyttle, and Sally Johnson. 2012. ‘It should be the most natural thing in the world’: exploring first-time mothers’ breastfeeding difficulties in the UK using audio-diaries and interviews. Maternal & Child Nutrition 8, 4 (2012), 434–447. https://doi.org/10.1111/j.1740-8709.2011.00328.x",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2015. WHO European Region has lowest global breastfeeding rates. https://www.euro.who.int/en/health-topics/Life-stages/maternal-and-newborn-health/news/news/2015/08/who-european-region-has-lowest-global-breastfeeding-rates",
      "doi": ""
    }
  ]
}