{
  "doi": "10.1145/3544548.3580947",
  "title": "Drifting Off in Paradise: Why People Sleep in Virtual Reality",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Sleep is important for humans, and past research has considered methods of improving sleep through technologies such as virtual reality (VR). However, there has been limited research on how such VR technology may affect the experiential and practical aspects of sleep, especially outside of a clinical lab setting. We consider this research gap through the lens of individuals that voluntarily engage in the practice of sleeping in VR. Semi-structured interviews with 14 participants that have slept in VR reveal insights regarding the motivations, actions, and experiential factors that uniquely define this practice. We find that participant motives can be largely categorized through either the experiential or social affordances of VR. We tie these motives into findings regarding the unique customs of sleeping in VR, involving set-up both within the physical and virtual space. Finally, we identify current and future challenges for sleeping in VR, and propose prospective design directions.",
  "authors": [
    {
      "name": "Michael Yin",
      "institution": "Department of Computer Science, University of British Columbia, Canada",
      "img": "/do/10.1145/contrib-99660234766/rel-imgonly/profile.jpg",
      "acmid": "99660234766",
      "orcid": "0000-0003-1164-5229"
    },
    {
      "name": "Robert Xiao",
      "institution": "Department of Computer Science, University of British Columbia, Canada",
      "img": "/do/10.1145/contrib-81548910156/rel-imgonly/img_6433x_cropped_large.jpeg",
      "acmid": "81548910156",
      "orcid": "0000-0003-4306-8825"
    }
  ],
  "references": [
    {
      "text": "Atye Babaii, Mohsen Adib-Hajbaghery, and Ali Hajibagheri. 2015. Effect of using eye mask on sleep quality in cardiac patients: a randomized controlled trial. Nursing and midwifery studies 4, 4 (2015).",
      "doi": ""
    },
    {
      "text": "Rosa María Baños, Cristina Botella, Mariano Alcañiz, Víctor Liaño, Belén Guerrero, and Beatriz Rey. 2004. Immersion and emotion: their impact on the sense of presence. Cyberpsychology & behavior 7, 6 (2004), 734–741.",
      "doi": ""
    },
    {
      "text": "Matt T. Bianchi. 2018. Sleep devices: wearables and nearables, informational and interventional, consumer and clinical. Metabolism 84(2018), 99–108. https://doi.org/10.1016/j.metabol.2017.10.008 Interactions of Sleep and Metabolism: Exploring Mechanisms, Technology, Clinical Practice and Research from Bench to Bedside.",
      "doi": ""
    },
    {
      "text": "Edward Bixler. 2009. Sleep and society: An epidemiological perspective. Sleep Medicine 10(2009), S3–S6. https://doi.org/10.1016/j.sleep.2009.07.005 The Art of Good Sleep Proceedings from the 6th International Sleep Disorders Forum: Sleep and Society.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in Social Virtual Reality: Challenges for Platform Governance. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 100 (nov 2019), 25 pages. https://doi.org/10.1145/3359202",
      "doi": "10.1145/3359202"
    },
    {
      "text": "Jan Born, Björn Rasch, and Steffen Gais. 2006. Sleep to Remember. The Neuroscientist 12, 5 (2006), 410–424. https://doi.org/10.1177/1073858406292647 arXiv:https://doi.org/10.1177/1073858406292647PMID: 16957003.",
      "doi": ""
    },
    {
      "text": "Doug A. Bowman and Ryan P. McMahan. 2007. Virtual Reality: How Much Immersion Is Enough?Computer 40, 7 (2007), 36–43. https://doi.org/10.1109/MC.2007.257",
      "doi": "10.1109/MC.2007.257"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic Analysis. American Psychological Association, Washington, D.C., USA, 57–71.",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 981–992. https://doi.org/10.1145/2858036.2858498",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Gordon Calleja. 2010. Digital games and escapism. Games and Culture 5, 4 (2010), 335–353.",
      "doi": ""
    },
    {
      "text": "Chien-Yu Chen, You-Kwang Wang, and Zhi-Wei Wang. 2022. Research on the Application of the Dynamic Assisted Sleep Light to Smart Mobile Devices. Applied Sciences 12, 10 (2022), 5191.",
      "doi": ""
    },
    {
      "text": "Jounhong Ryan Cho, Eun Yeon Joo, Dae Lim Koo, and Seung Bong Hong. 2013. Let there be no light: the effect of bedside light on sleep quality and background electroencephalographic rhythms. Sleep medicine 14, 12 (2013), 1422–1425.",
      "doi": ""
    },
    {
      "text": "Yong K Choi, George Demiris, Shih-Yin Lin, Sarah J Iribarren, Carol A Landis, Hilaire J Thompson, Susan M McCurry, Margaret M Heitkemper, and Teresa M Ward. 2018. Smartphone applications to support sleep self-management: review and evaluation. Journal of Clinical Sleep Medicine 14, 10 (2018), 1783–1790.",
      "doi": ""
    },
    {
      "text": "Francesca De Simone, Jie Li, Henrique Galvan Debarba, Abdallah El Ali, Simon N.B Gunkel, and Pablo Cesar. 2019. Watching Videos Together in Social Virtual Reality: An Experimental Study on User’s QoE. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 890–891. https://doi.org/10.1109/VR.2019.8798264",
      "doi": ""
    },
    {
      "text": "Massimiliano de Zambotti, Giacinto Barresi, Ian M Colrain, and Fiona C Baker. 2020. When sleep goes virtual: the potential of using virtual reality at bedtime to facilitate sleep. Sleep 43, 12 (09 2020). https://doi.org/10.1093/sleep/zsaa178 arXiv:https://academic.oup.com/sleep/article-pdf/43/12/zsaa178/34875557/zsaa178.pdfzsaa178.",
      "doi": ""
    },
    {
      "text": "Massimiliano De Zambotti, Nicola Cellini, Aimee Goldstone, Ian M Colrain, and Fiona C Baker. 2019. Wearable sleep technology in clinical and research settings. Medicine and science in sports and exercise 51, 7 (2019), 1538.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 2012. Self-determination theory.(2012).",
      "doi": ""
    },
    {
      "text": "Julia Diemer, Georg W Alpers, Henrik M Peperkorn, Youssef Shiban, and Andreas Mühlberger. 2015. The impact of perception and presence on emotional reactions: a review of research in virtual reality. Frontiers in psychology 6 (2015), 26.",
      "doi": ""
    },
    {
      "text": "Nicole M Duggan, M Adrian Hasdianda, Olesya Baker, Guruprasad Jambaulikar, Andrew J Goldsmith, Anna Condella, Desiree Azizoddin, Adaira I Landry, Edward W Boyer, and Andrew J Eyre. 2022. The Effect of Noise-Masking Earbuds (SleepBuds) on Reported Sleep Quality and Tension in Health Care Shift Workers: Prospective Single-Subject Design Study. JMIR formative research 6, 3 (2022), e28353.",
      "doi": ""
    },
    {
      "text": "Jennifer Falbe, Kirsten K Davison, Rebecca L Franckle, Claudia Ganter, Steven L Gortmaker, Lauren Smith, Thomas Land, and Elsie M Taveras. 2015. Sleep duration, restfulness, and screens in the sleep environment. Pediatrics 135, 2 (2015), e367–e375.",
      "doi": ""
    },
    {
      "text": "Anna Felnhofer, Oswald D Kothgassner, Leon Beutl, Helmut Hlavacs, and Ilse Kryspin-Exner. 2012. Is virtual reality made for men only? Exploring gender differences in the sense of presence. Proceedings of the International Society on presence research (2012), 103–112.",
      "doi": ""
    },
    {
      "text": "Michele Ferrara and Luigi De Gennaro. 2001. How much sleep do we need?Sleep Medicine Reviews 5, 2 (2001), 155–179. https://doi.org/10.1053/smrv.2000.0138",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Divine Maloney. 2021. Body, Avatar, and Me: The Presentation and Perception of Self in Social Virtual Reality. Proc. ACM Hum.-Comput. Interact. 4, CSCW3, Article 239 (jan 2021), 27 pages. https://doi.org/10.1145/3432938",
      "doi": "10.1145/3432938"
    },
    {
      "text": "Daniel A. Guttentag. 2010. Virtual reality: Applications and implications for tourism. Tourism Management 31, 5 (2010), 637–651. https://doi.org/10.1016/j.tourman.2009.07.003",
      "doi": ""
    },
    {
      "text": "Shona L Halson. 2019. Sleep monitoring in athletes: motivation, methods, miscalculations and why it matters. Sports medicine 49, 10 (2019), 1487–1497.",
      "doi": ""
    },
    {
      "text": "László Harmat, Johanna Takács, and Róbert Bódizs. 2008. Music improves sleep quality in students. Journal of advanced nursing 62, 3 (2008), 327–335.",
      "doi": ""
    },
    {
      "text": "Yeonju Jang and Eunil Park. 2019. An adoption model for virtual reality games: The roles of presence and enjoyment. Telematics and Informatics 42 (2019), 101239. https://doi.org/10.1016/j.tele.2019.101239",
      "doi": "10.1016/j.tele.2019.101239"
    },
    {
      "text": "Vinodaran Kalaiselvan, Feninferina Azman, Lim Kok Cheng, and Fiza Abdul Rahim. 2019. nocturnOWL: Sleep-monitoring Virtual Pet Mobile Application. In 2019 IEEE Conference on Open Systems (ICOS). 51–56. https://doi.org/10.1109/ICOS47562.2019.8975709",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Raphaela Groten, and Mel Slater. 2012. The sense of embodiment in virtual reality. Presence: Teleoperators and Virtual Environments 21, 4(2012), 373–387.",
      "doi": "10.1162/PRES_a_00124"
    },
    {
      "text": "Jarrod Knibbe, Jonas Schjerlund, Mathias Petraeus, and Kasper Hornbæk. 2018. The Dream is Collapsing: The Experience of Exiting VR. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174057",
      "doi": "10.1145/3173574.3174057"
    },
    {
      "text": "Logan Kugler. 2021. The State of Virtual Reality Hardware. Commun. ACM 64, 2 (jan 2021), 15–16. https://doi.org/10.1145/3441290",
      "doi": "10.1145/3441290"
    },
    {
      "text": "Shinjae Kwon, Hojoong Kim, and Woon-Hong Yeo. 2021. Recent advances in wearable sensors and portable electronics for sleep monitoring. iScience 24, 5 (2021), 102461. https://doi.org/10.1016/j.isci.2021.102461",
      "doi": ""
    },
    {
      "text": "Marc Erich Latoschik, Florian Kern, Jan-Philipp Stauffert, Andrea Bartl, Mario Botsch, and Jean-Luc Lugrin. 2019. Not Alone Here?! Scalability and User Experience of Embodied Ambient Crowds in Distributed Social Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 25, 5(2019), 2134–2144. https://doi.org/10.1109/TVCG.2019.2899250",
      "doi": ""
    },
    {
      "text": "Raeann G LeBlanc, Paige Czarnecki, Jordan Howard, Cynthia S Jacelon, and Jenna Marquard. 2022. Usability Experience of a Personal Sleep Monitoring Device to Self-manage Sleep Among Persons 65 Years or Older With Self-reported Sleep Disturbances. CIN: Computers, Informatics, Nursing(2022), 10–1097.",
      "doi": ""
    },
    {
      "text": "Soon Young Lee and Jiyeon Kang. 2020. Effect of virtual reality meditation on sleep quality of intensive care unit patients: A randomised controlled trial. Intensive and Critical Care Nursing 59 (2020), 102849. https://doi.org/10.1016/j.iccn.2020.102849",
      "doi": ""
    },
    {
      "text": "Zilu Liang, Bernd Ploderer, and Mario Alberto Chapa-Martell. 2017. Is Fitbit Fit for Sleep-Tracking? Sources of Measurement Errors and Proposed Countermeasures. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (Barcelona, Spain) (PervasiveHealth ’17). Association for Computing Machinery, New York, NY, USA, 476–479. https://doi.org/10.1145/3154862.3154897",
      "doi": "10.1145/3154862.3154897"
    },
    {
      "text": "Tiffany Low, Russell Conduit, Prerna Varma, Hailey Meaklim, and Melinda L. Jackson. 2020. Treating subclinical and clinical symptoms of insomnia with a mindfulness-based smartphone application: A pilot study. Internet Interventions 21 (2020), 100335. https://doi.org/10.1016/j.invent.2020.100335",
      "doi": ""
    },
    {
      "text": "Divine Maloney and Guo Freeman. 2020. Falling Asleep Together: What Makes Activities in Social Virtual Reality Meaningful to Users. Association for Computing Machinery, New York, NY, USA, 510–521. https://doi.org/10.1145/3410404.3414266",
      "doi": "10.1145/3410404.3414266"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2020. It Is Complicated: Interacting with Children in Social Virtual Reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). 343–347. https://doi.org/10.1109/VRW50115.2020.00075",
      "doi": ""
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Andrew Robb. 2020. A Virtual Space for All: Exploring Children’s Experience in Social Virtual Reality. Association for Computing Machinery, New York, NY, USA, 472–483. https://doi.org/10.1145/3410404.3414268",
      "doi": "10.1145/3410404.3414268"
    },
    {
      "text": "Divine Maloney, Guo Freeman, and Donghee Yvette Wohn. 2020. \"Talking without a Voice\": Understanding Non-Verbal Communication in Social Virtual Reality. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 175 (oct 2020), 25 pages. https://doi.org/10.1145/3415246",
      "doi": "10.1145/3415246"
    },
    {
      "text": "Divine Maloney, Samaneh Zamanifard, and Guo Freeman. 2020. Anonymity vs. Familiarity: Self-Disclosure and Privacy in Social Virtual Reality. In 26th ACM Symposium on Virtual Reality Software and Technology (Virtual Event, Canada) (VRST ’20). Association for Computing Machinery, New York, NY, USA, Article 25, 9 pages. https://doi.org/10.1145/3385956.3418967",
      "doi": "10.1145/3385956.3418967"
    },
    {
      "text": "Marta Matamala-Gomez, Tony Donegan, Sara Bottiroli, Giorgio Sandrini, Maria V Sanchez-Vives, and Cristina Tassorelli. 2019. Immersive virtual reality and virtual embodiment for pain relief. Frontiers in human neuroscience 13 (2019), 279.",
      "doi": ""
    },
    {
      "text": "Georges Matar, Jean-Marc Lina, Julie Carrier, and Georges Kaddoum. 2018. Unobtrusive Sleep Monitoring Using Cardiac, Breathing and Movements Activities: An Exhaustive Review. IEEE Access 6(2018), 45129–45152. https://doi.org/10.1109/ACCESS.2018.2865487",
      "doi": ""
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300794",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Peter G Michaelson and Eric A Mair. 2004. Popular snore aids: do they work?Otolaryngology–Head and Neck Surgery 130, 6 (2004), 649–658.",
      "doi": ""
    },
    {
      "text": "Xue Ming, Rebecca Koransky, Victor Kang, Sarah Buchman, Christina E. Sarris, and George C. Wagner. 2011. Sleep Insufficiency, Sleep Health Problems and Performance in High School Students. Clinical Medicine Insights: Circulatory, Respiratory and Pulmonary Medicine 5(2011), CCRPM.S7955. https://doi.org/10.4137/CCRPM.S7955 arXiv:https://doi.org/10.4137/CCRPM.S7955PMID: 22084618.",
      "doi": ""
    },
    {
      "text": "Fares Moustafa and Anthony Steed. 2018. A Longitudinal Study of Small Group Interaction in Social Virtual Reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (Tokyo, Japan) (VRST ’18). Association for Computing Machinery, New York, NY, USA, Article 22, 10 pages. https://doi.org/10.1145/3281505.3281527",
      "doi": "10.1145/3281505.3281527"
    },
    {
      "text": "Craig D Murray and Judith Sixsmith. 1999. The corporeal body in virtual reality. Ethos 27, 3 (1999), 315–343.",
      "doi": ""
    },
    {
      "text": "Joschka Mütterlein. 2018. The three pillars of virtual reality? Investigating the roles of immersion, presence, and interactivity. In Proceedings of the 51st Hawaii international conference on system sciences.",
      "doi": ""
    },
    {
      "text": "Joschka Mütterlein and Thomas Hess. 2017. Immersion, presence, interactivity: Towards a joint understanding of factors influencing virtual reality acceptance and use. In Proceedings of the 23rd Americas Conference on Information Systems (AMCIS 2017).",
      "doi": ""
    },
    {
      "text": "Teruaki Nochino, Yuko Ohno, Takafumi Kato, Masako Taniike, and Shima Okada. 2019. Sleep stage estimation method using a camera for home use. Biomedical engineering letters 9, 2 (2019), 257–265.",
      "doi": ""
    },
    {
      "text": "Karen Ritchie Norifumi Tsuno, Alain Besset. 2005. Sleep and depression. Journal of Clinical Psychiatry 66, 10 (2005), 1254–69. https://doi.org/10.4088/jcp.v66n1008",
      "doi": ""
    },
    {
      "text": "Jolanta Orzeł-Gryglewska. 2010. Consequences of sleep deprivation. International Journal of Occupational Medicine and Environmental Health 23, 1(2010), 95–114. https://doi.org/10.2478/v10001-010-0004-9",
      "doi": ""
    },
    {
      "text": "Yun Suen Pai, Marsel L Bait, Juyoung Lee, Jingjing Xu, Roshan L Peiris, Woontack Woo, Mark Billinghurst, and Kai Kunze. 2022. NapWell: an EOG-based sleep assistant exploring the effects of virtual reality on sleep onset. Virtual Reality 26, 2 (2022), 437–451.",
      "doi": "10.1007/s10055-021-00571-w"
    },
    {
      "text": "Federica Pallavicini, Alessandro Pepe, and Maria Eleonora Minissi. 2019. Gaming in Virtual Reality: What Changes in Terms of Usability, Emotional Response and Sense of Presence Compared to Non-Immersive Video Games?Simulation & Gaming 50, 2 (2019), 136–159. https://doi.org/10.1177/1046878119831420 arXiv:https://doi.org/10.1177/1046878119831420",
      "doi": "10.1177/1046878119831420"
    },
    {
      "text": "Jonathan M Peake, Graham Kerr, and John P Sullivan. 2018. A critical review of consumer wearables, mobile applications, and equipment for providing biofeedback, monitoring stress, and sleep in physically active populations. Frontiers in physiology 9 (2018), 743.",
      "doi": ""
    },
    {
      "text": "Tekla S. Perry. 2016. Virtual reality goes social. IEEE Spectrum 53, 1 (2016), 56–57. https://doi.org/10.1109/MSPEC.2016.7367470",
      "doi": "10.1109/MSPEC.2016.7367470"
    },
    {
      "text": "Roosa Piitulainen, Perttu Hämäläinen, and Elisa D Mekler. 2022. Vibing Together: Dance Experiences in Social Virtual Reality. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 188, 18 pages. https://doi.org/10.1145/3491102.3501828",
      "doi": "10.1145/3491102.3501828"
    },
    {
      "text": "Jaziar Radianti, Tim A. Majchrzak, Jennifer Fromm, and Isabell Wohlgenannt. 2020. A systematic review of immersive virtual reality applications for higher education: Design elements, lessons learned, and research agenda. Computers & Education 147 (2020), 103778. https://doi.org/10.1016/j.compedu.2019.103778",
      "doi": "10.1016/j.compedu.2019.103778"
    },
    {
      "text": "Johnmarshall Reeve. 2012. A Self-determination Theory Perspective on Student Engagement. Springer US, Boston, MA, 149–172. https://doi.org/10.1007/978-1-4614-2018-7_7",
      "doi": ""
    },
    {
      "text": "Kathryn J. Reid, Zoran Martinovich, Sanford Finkel, Judy Statsinger, Robyn Golden, Kathryne Harter, and Phyllis C. Zee. 2006. Sleep: A Marker of Physical and Mental Health in the Elderly. The American Journal of Geriatric Psychiatry 14, 10(2006), 860–866. https://doi.org/10.1097/01.JGP.0000206164.56404.ba",
      "doi": ""
    },
    {
      "text": "Samantha M Riedy, Michael G Smith, Sarah Rocha, and Mathias Basner. 2021. Noise as a sleep aid: A systematic review. Sleep Medicine Reviews 55 (2021), 101385.",
      "doi": ""
    },
    {
      "text": "Giuseppe Riva, José Gutiérrez-Maldonado, and Brenda K Wiederhold. 2016. Virtual worlds versus real body: virtual reality meets eating and weight disorders., 63–66 pages.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344–360.",
      "doi": ""
    },
    {
      "text": "Ibrahim Sadek, Antoine Demarasse, and Mounir Mokhtari. 2020. Internet of things for sleep tracking: wearables vs. nonwearables. Health and technology 10, 1 (2020), 333–340.",
      "doi": ""
    },
    {
      "text": "Benjamin Saunders, Julius Sim, Tom Kingstone, Shula Baker, Jackie Waterfield, Bernadette Bartlam, Heather Burroughs, and Clare Jinks. 2018. Saturation in qualitative research: exploring its conceptualization and operationalization. Quality & quantity 52, 4 (2018), 1893–1907.",
      "doi": ""
    },
    {
      "text": "Martijn J Schuemie, Peter Van Der Straaten, Merel Krijn, and Charles APG Van Der Mast. 2001. Research on presence in virtual reality: A survey. CyberPsychology & Behavior 4, 2 (2001), 183–201.",
      "doi": ""
    },
    {
      "text": "Ulrike Schultze. 2010. Embodiment and presence in virtual worlds: a review. Journal of Information Technology 25, 4 (2010), 434–449.",
      "doi": ""
    },
    {
      "text": "Hannah Scott, Leon Lack, and Nicole Lovato. 2020. A systematic review of the accuracy of sleep wearable devices for estimating sleep onset. Sleep Medicine Reviews 49 (2020), 101227. https://doi.org/10.1016/j.smrv.2019.101227",
      "doi": ""
    },
    {
      "text": "Waralak V Siricharoen. 2019. The Effect of Virtual Reality as a form of Escapism.. In CONF-IRM. 36.",
      "doi": ""
    },
    {
      "text": "Mel Slater. 2017. Implicit learning through embodiment in immersive virtual reality. In Virtual, augmented, and mixed realities in education. Springer, 19–33.",
      "doi": ""
    },
    {
      "text": "Mel Slater. 2018. Immersion and the illusion of presence in virtual reality. British Journal of Psychology 109, 3 (2018), 431–433.",
      "doi": ""
    },
    {
      "text": "SlimeVR. 2021. What Happens When a Virtual Streamer doesn’t Own Her Body?Crowd Supply. https://www.crowdsupply.com/slimevr/slimevr-full-body-tracker",
      "doi": ""
    },
    {
      "text": "Jacob H. Steffen, James E. Gaskin, Thomas O. Meservy, Jeffrey L. Jenkins, and Iopa Wolman. 2019. Framework of Affordances for Virtual Reality and Augmented Reality. Journal of Management Information Systems 36, 3 (2019), 683–729. https://doi.org/10.1080/07421222.2019.1628877 arXiv:https://doi.org/10.1080/07421222.2019.1628877",
      "doi": ""
    },
    {
      "text": "Theresa Jean Tanenbaum, Nazely Hartoonian, and Jeffrey Bryan. 2020. \"How Do I Make This Thing Smile?\": An Inventory of Expressive Nonverbal Communication in Commercial Social Virtual Reality Platforms. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376606",
      "doi": "10.1145/3313831.3376606"
    },
    {
      "text": "Erik Wolf, Marie Luisa Fiedler, Nina Döllinger, Carolin Wienrich, and Marc Erich Latoschik. 2022. Exploring Presence, Avatar Embodiment, and Body Perception with a Holographic Augmented Reality Mirror. In 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 350–359. https://doi.org/10.1109/VR51125.2022.00054",
      "doi": ""
    },
    {
      "text": "Shengjie Yao and Gyoung Kim. 2019. The Effects of Immersion in a Virtual Reality Game: Presence and Physical Activity. In HCI in Games, Xiaowen Fang (Ed.). Springer International Publishing, Cham, 234–242.",
      "doi": ""
    }
  ]
}