{
  "doi": "10.1145/3544548.3580654",
  "title": "Exploring User Motivations Behind iOS App Tracking Transparency Decisions",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2023,
  "badges": [],
  "abstract": "Apple’s App Tracking Transparency framework allows users to decide whether they want to allow their activity to be tracked for advertising purposes. In this work we examine the tracking decisions made by 312 participants and their associations with privacy concern and personality factors, and conduct a thematic analysis on participants’ reasons for choosing to accept or reject tracking requests. Despite 51% of participants reporting that they had rejected tracking for privacy reasons, higher privacy concern scores did not correlate with a lower rate of tracking acceptance. Additionally, 43% of participants held incorrect beliefs about what tracking does, including nearly a quarter who mistakenly believed that accepting a tracking request would share their location with the requesting app. We suggest explanations for these misconceptions and provide recommendations that may improve usability of both App Tracking Transparency and future Privacy Enhancing Technologies.",
  "tags": [
    "Apple",
    "privacy salience",
    "privacy",
    "iOS",
    "privacy concern",
    "privacy paradox",
    "privacy calculus",
    "privacy decision making",
    "App Tracking Transparency"
  ],
  "authors": [
    {
      "name": "Hannah J Hutton",
      "institution": "School of Management, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782130",
      "orcid": "0000-0002-1895-0798"
    },
    {
      "name": "David A Ellis",
      "institution": "School of Management, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659738162",
      "orcid": "0000-0001-6172-3323"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Leslie K John, and George Loewenstein. 2012. The impact of relative standards on the propensity to disclose. Journal of Marketing Research 49, 2 (2012), 160–174.",
      "doi": ""
    },
    {
      "text": "Apple Support 2021. If an app asks to track your activity. Retrieved April 14, 2022 from https://support.apple.com/en-us/HT212025",
      "doi": ""
    },
    {
      "text": "Andrés Arrieta. 2020. Facebook’s Laughable Campaign Against Apple Is Really Against Users and Small Businesses. Retrieved August 13, 2022 from https://www.eff.org/deeplinks/2020/12/facebooks-laughable-campaign-against-apple-really-against-users-and-small",
      "doi": ""
    },
    {
      "text": "Michael C Ashton and Kibeom Lee. 2009. The HEXACO–60: A short measure of the major dimensions of personality. Journal of personality assessment 91, 4 (2009), 340–345.",
      "doi": ""
    },
    {
      "text": "Michael C Ashton, Kibeom Lee, and Reinout E De Vries. 2014. The HEXACO Honesty-Humility, Agreeableness, and Emotionality factors: A review of research and theory. Personality and Social Psychology Review 18, 2 (2014), 139–152.",
      "doi": ""
    },
    {
      "text": "Susan Athey, Christian Catalini, and Catherine Tucker. 2017. The digital privacy paradox: Small money, small costs, small talk. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Susan B Barnes. 2006. A privacy paradox: Social networking in the United States. First Monday (2006).",
      "doi": ""
    },
    {
      "text": "BBC News 2021. TikTok faces privacy investigations by EU watchdog. Retrieved June 21, 2022 from https://www.bbc.co.uk/news/technology-58573049",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Tom Buchanan, Carina Paine, Adam N Joinson, and Ulf-Dietrich Reips. 2007. Development of measures of online privacy concern and protection for use on the Internet. Journal of the American society for information science and technology 58, 2 (2007), 157–165.",
      "doi": ""
    },
    {
      "text": "Kovila PL Coopamootoo. 2020. Usage patterns of privacy-enhancing technologies. In Proceedings of the 2020 ACM SIGSAC Conference on Computer and Communications Security. 1371–1390.",
      "doi": "10.1145/3372297.3423347"
    },
    {
      "text": "Lynne M Coventry, Debora Jeske, John M Blythe, James Turland, and Pam Briggs. 2016. Personality and social framing in privacy decision-making: A study on cookie acceptance. Frontiers in psychology 7 (2016), 1341.",
      "doi": ""
    },
    {
      "text": "Reinout E De Vries, Anita de Vries, and Jan A Feij. 2009. Sensation seeking, risk-taking, and the HEXACO model of personality. Personality and Individual Differences 47, 6 (2009), 536–540.",
      "doi": ""
    },
    {
      "text": "Anzo DeGiulio, Hanoom Lee, and Eleanor Birrell. 2021. “Ask App Not to Track”: The Effect of Opt-In Tracking Authorization on Mobile Privacy. In International Workshop on Emerging Technologies for Authorization and Authentication. Springer, 152–167.",
      "doi": ""
    },
    {
      "text": "Tobias Dienlin, Philipp K Masur, and Sabine Trepte. 2019. A longitudinal analysis of the privacy paradox. New Media & Society(2019), 1–22.",
      "doi": ""
    },
    {
      "text": "Tamara Dinev and Paul Hart. 2006. An extended privacy calculus model for e-commerce transactions. Information Systems Research 17, 1 (2006), 61–80.",
      "doi": "10.1287/isre.1060.0080"
    },
    {
      "text": "Roger Dingledine, Nick Mathewson, and Paul Syverson. 2004. Tor: The second-generation onion router. Technical Report. Naval Research Lab Washington DC.",
      "doi": ""
    },
    {
      "text": "Julia Brande Earp, Annie I Antón, Lynda Aiman-Smith, and William H Stufflebeam. 2005. Examining Internet privacy policies within the context of user privacy values. IEEE Transactions on Engineering Management 52, 2 (2005), 227–237.",
      "doi": ""
    },
    {
      "text": "David A Ellis, Brittany I Davidson, Heather Shaw, and Kristoffer Geyer. 2019. Do smartphone usage scales predict behavior?International Journal of Human-Computer Studies 130 (2019), 86–92.",
      "doi": "10.1016/j.ijhcs.2019.05.004"
    },
    {
      "text": "Flurry 2021. iOS 14 Opt-in Rate - Weekly Updates Since Launch. Retrieved July 3, 2022 from https://www.flurry.com/blog/ios-14-5-opt-in-rate-idfa-app-tracking-transparency-weekly/",
      "doi": ""
    },
    {
      "text": "Flurry 2021. iOS 14.5 Opt-in Rate - Daily Updates Since Launch. Retrieved July 3, 2022 from https://www.flurry.com/blog/ios-14-5-opt-in-rate-att-restricted-app-tracking-transparency-worldwide-us-daily-latest-update/",
      "doi": ""
    },
    {
      "text": "Electronic Frontier Foundation. 2014. HTTPS Everywhere. Retrieved August 27, 2022 from https://www.eff.org/de/https-everywhere",
      "doi": ""
    },
    {
      "text": "Carla F Griggio, Midas Nouwens, and Clemens Nylandsted Klokmose. 2022. Caught in the Network: The Impact of WhatsApp’s 2021 Privacy Policy Update on Users’ Messaging App Ecosystems. In CHI Conference on Human Factors in Computing Systems. 1–23.",
      "doi": ""
    },
    {
      "text": "John Haggerty, Thomas Hughes-Roberts, and Robert Hegarty. 2015. Hobson’s choice: security and privacy permissions in Android and iOS devices. In International Conference on Human Aspects of Information Security, Privacy, and Trust. Springer, 506–516.",
      "doi": ""
    },
    {
      "text": "Leslie K John. 2015. The consumer psychology of online privacy: Insights and opportunities from behavioral decision theory.(2015).",
      "doi": ""
    },
    {
      "text": "Konrad Kollnig, Pierre Dewitte, Max Van Kleek, Ge Wang, Daniel Omeiza, Helena Webb, and Nigel Shadbolt. 2021. A Fait Accompli? An Empirical Study into the Absence of Consent to Third-Party Tracking in Android Apps. In Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021). 181–196.",
      "doi": ""
    },
    {
      "text": "Konrad Kollnig, Anastasia Shuba, Max Van Kleek, Reuben Binns, and Nigel Shadbolt. 2022. Goodbye tracking? Impact of iOS app tracking transparency and privacy labels. In 2022 ACM Conference on Fairness, Accountability, and Transparency (FAccT ’22). 508–520.",
      "doi": "10.1145/3531146.3533116"
    },
    {
      "text": "Robert S Laufer and Maxine Wolfe. 1977. Privacy as a concept and a social issue: A multidimensional developmental theory. Journal of Social Issues 33, 3 (1977), 22–42.",
      "doi": ""
    },
    {
      "text": "Kibeom Lee and Michael C Ashton. 2004. Psychometric properties of the HEXACO personality inventory. Multivariate behavioral research 39, 2 (2004), 329–358.",
      "doi": ""
    },
    {
      "text": "Robert R McCrae and Paul T Costa. 1987. Validation of the five-factor model of personality across instruments and observers.Journal of personality and social psychology 52, 1(1987), 81.",
      "doi": ""
    },
    {
      "text": "Meta for Business 2020. Speaking Up for Small Businesses. Retrieved June 28, 2022 from https://www.facebook.com/business/news/ios-14-apple-privacy-update-impacts-small-business-ads",
      "doi": ""
    },
    {
      "text": "Meta Investor Relations 2022. Meta Reports Fourth Quarter and Full Year 2021 Results. Retrieved July 6, 2022 from https://investor.fb.com/investor-news/press-release-details/2022/Meta-Reports-Fourth-Quarter-and-Full-Year-2021-Results/default.aspx",
      "doi": ""
    },
    {
      "text": "EU Article 29 Data Protection Working Party. 2017. Guidelines on Data Protection Impact Assessment (DPIA) and determining whether processing is \"likely to result in a high risk\" for the purposes of Regulation 2016/679. Retrieved July 25, 2022 from https://ec.europa.eu/newsroom/article29/items/611236",
      "doi": ""
    },
    {
      "text": "Sameer Patil, Roberto Hoyle, Roman Schlegel, Apu Kapadia, and Adam J Lee. 2015. Interrupt now or inform later? Comparing immediate and delayed privacy feedback. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1415–1418.",
      "doi": ""
    },
    {
      "text": "Heather Shaw, Paul J Taylor, David A Ellis, and Stacey M Conchie. 2022. Behavioral consistency in the digital age. Psychological science 33, 3 (2022), 364–370.",
      "doi": ""
    },
    {
      "text": "The Economist 2022. How Apple’s privacy push cost Meta $10bn. Retrieved June 16, 2022 from https://www.economist.com/the-economist-explains/2022/02/03/how-apples-privacy-push-cost-meta-10bn",
      "doi": ""
    },
    {
      "text": "Ari Ezra Waldman. 2020. Cognitive biases, dark patterns, and the ‘privacy paradox’. Current Opinion in Psychology 31 (2020), 105–109.",
      "doi": ""
    },
    {
      "text": "Joshua A Weller and Erik W Thulin. 2012. Do honest people take fewer risks? Personality correlates of risk-taking to achieve gains and avoid losses in HEXACO space. Personality and individual differences 53, 7 (2012), 923–926.",
      "doi": ""
    },
    {
      "text": "Joshua A Weller and Aysel Tikir. 2011. Predicting domain-specific risk taking with the HEXACO personality structure. Journal of Behavioral Decision Making 24, 2 (2011), 180–201.",
      "doi": ""
    },
    {
      "text": "Alan F. Westin. 1967. Privacy and Freedom. Atheneum, New York.",
      "doi": ""
    },
    {
      "text": "Meredydd Williams, Jason RC Nurse, and Sadie Creese. 2016. Privacy salience: Taxonomies and research opportunities. In IFIP International Summer School on Privacy and Identity Management. Springer, 263–278.",
      "doi": ""
    },
    {
      "text": "Wired 2019. How Cambridge Analytica Sparked the Great Privacy Awakening. Retrieved June 19, 2022 from https://www.wired.com/story/cambridge-analytica-facebook-privacy-awakening",
      "doi": ""
    },
    {
      "text": "Ingo Zettler, Benjamin E Hilbig, and Timo Heydasch. 2013. Two sides of one coin: Honesty–Humility and situational factors mutually shape social dilemma decision making. Journal of Research in Personality 47, 4 (2013), 286–295.",
      "doi": ""
    }
  ]
}