{
  "doi": "10.1145/3544548.3581024",
  "title": "AnisoTag: 3D Printed Tag on 2D Surface via Reflection Anisotropy",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "In the past few years, the widespread use of 3D printing technology enables the growth of the market of 3D printed products. On Esty, a website focused on handmade items, hundreds of individual entrepreneurs are selling their 3D printed products. Inspired by the positive effects of machine-readable tags, like barcodes, on daily product marketing, we propose AnisoTag, a novel tagging method to encode data on the 2D surface of 3D printed objects based on reflection anisotropy. AnisoTag has an unobtrusive appearance and much lower extraction computational complexity, contributing to a lightweight low-cost tagging system for individual entrepreneurs. On AnisoTag, data are encoded by the proposed tool as reflective anisotropic microstructures, which would reflect distinct illumination patterns when irradiating by collimated laser. Based on it, we implement a real-time detection prototype with inexpensive hardware to determine the reflected illumination pattern and decode data according to their mapping. We evaluate AnisoTag with various 3D printer brands, filaments, and printing parameters, demonstrating its superior usability, accessibility, and reliability for practical usage.",
  "tags": [
    "fabrication",
    "machine-readable tag",
    "physical hyperlinks",
    "information embedding",
    "3D printing"
  ],
  "authors": [
    {
      "name": "Zehua Ma",
      "institution": "CAS Key Laboratory of Electromagnetic Space Information, University of Science and Technology of China, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659374564",
      "orcid": "0000-0002-8153-341X"
    },
    {
      "name": "Hang Zhou",
      "institution": "GrUVi, Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659148033",
      "orcid": "0000-0001-7860-8452"
    },
    {
      "name": "Weiming Zhang",
      "institution": "CAS Key Laboratory of Electromagnetic Space Information, University of Science and Technology of China, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474668179",
      "orcid": "0000-0001-5576-6108"
    }
  ],
  "references": [
    {
      "text": "des lettres et des beaux-arts de Belgique. Académie royale des sciences. 1822. Nouveaux mémoires de l’Académie royale des sciences et belles-lettres de Bruxelles. Vol. t.2 (1822). 171–200 pages. https://www.biodiversitylibrary.org/item/101263https://www.biodiversitylibrary.org/bibliography/104707.",
      "doi": ""
    },
    {
      "text": "Michael Ashikhmin and Peter Shirley. 2000. An Anisotropic Phong BRDF Model. J. Graph. Tools 5, 2 (Feb. 2000), 25–32. https://doi.org/10.1080/10867651.2000.10487522",
      "doi": "10.1080/10867651.2000.10487522"
    },
    {
      "text": "Donald A. Clarke, Rodger L. Reynolds, and Timothy R. Pryor. 1985. Panel surface flaw inspection.",
      "doi": ""
    },
    {
      "text": "Germinal Pierre Dandelin. 2021. Dandelin Spheres. Retrieved December, 2021 from https://en.wikipedia.org/wiki/Dandelin_spheres/",
      "doi": ""
    },
    {
      "text": "Arnaud Delmotte, Kenichiro Tanaka, Hiroyuki Kubo, Takuya Funatomi, and Yasuhiro Mukaigawa. 2020. Blind Watermarking for 3-D Printed Objects by Locally Modifying Layer Thickness. IEEE Transactions on Multimedia 22, 11 (2020), 2780–2791. https://doi.org/10.1109/TMM.2019.2962306",
      "doi": ""
    },
    {
      "text": "Mustafa Doga Dogan, Faraz Faruqi, Andrew Day Churchill, Kenneth Friedman, Leon Cheng, Sriram Subramanian, and Stefanie Mueller. 2020. G-ID: Identifying 3D Prints Using Slicing Parameters. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376202",
      "doi": "10.1145/3313831.3376202"
    },
    {
      "text": "Mustafa Doga Dogan, Ahmad Taka, Michael Lu, Yunyi Zhu, Akshat Kumar, Aakar Gupta, and Stefanie Mueller. 2022. InfraredTags: Embedding Invisible AR Markers and Barcodes Using Low-Cost, Infrared-Based 3D Printing and Imaging Tools. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 269, 12 pages. https://doi.org/10.1145/3491102.3501951",
      "doi": "10.1145/3491102.3501951"
    },
    {
      "text": "Karim A. ElSayed, Adam Dachowicz, and Jitesh H. Panchal. 2021. Information Embedding in Additive Manufacturing through Printing Speed Control. In Proceedings of the 2021 Workshop on Additive Manufacturing (3D Printing) Security (Virtual Event, Republic of Korea) (AMSec ’21). Association for Computing Machinery, New York, NY, USA, 31–37. https://doi.org/10.1145/3462223.3485623",
      "doi": "10.1145/3462223.3485623"
    },
    {
      "text": "Esty. 2005. 3D printed products. Retrieved December, 2022 from https://www.etsy.com/market/3d_printed_objects",
      "doi": ""
    },
    {
      "text": "Jie Feng, Wangyu Xiao, and Bingfeng Zhou. 2013. Image-Pair-Based Anisotropic Material Modeling. In SIGGRAPH Asia 2013 Technical Briefs (Hong Kong, Hong Kong) (SA ’13). Association for Computing Machinery, New York, NY, USA, Article 17, 4 pages. https://doi.org/10.1145/2542355.2542376",
      "doi": "10.1145/2542355.2542376"
    },
    {
      "text": "George Fisher-WIlson. 2018. 3D Hubs. Retrieved October, 2020 from https://www.hubs.com/get/trends/ Digital Manufacturing Trends 2018..",
      "doi": ""
    },
    {
      "text": "Frank Gray. 1953. Gray code. Retrieved December, 2021 from https://en.wikipedia.org/wiki/Gray_code/",
      "doi": ""
    },
    {
      "text": "Chris Harrison, Robert Xiao, and Scott Hudson. 2012. Acoustic Barcodes: Passive, Durable and Inexpensive Notched Identification Tags. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology(Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 563–568. https://doi.org/10.1145/2380116.2380187",
      "doi": "10.1145/2380116.2380187"
    },
    {
      "text": "Jong-Uk Hou, Do-Gon Kim, Sunghee Choi, and Heung-Kyu Lee. 2015. 3D Print-Scan Resilient Watermarking Using a Histogram-Based Circular Shift Coding Structure. In Proceedings of the 3rd ACM Workshop on Information Hiding and Multimedia Security (Portland, Oregon, USA). Association for Computing Machinery, New York, NY, USA, 115–121. https://doi.org/10.1145/2756601.2756607",
      "doi": "10.1145/2756601.2756607"
    },
    {
      "text": "Jong-Uk Hou, Do-Gon Kim, and Heung-Kyu Lee. 2017. Blind 3D Mesh Watermarking for 3D Printed Model by Analyzing Layering Artifact. IEEE Transactions on Information Forensics and Security 12, 11(2017), 2712–2725. https://doi.org/10.1109/TIFS.2017.2718482",
      "doi": "10.1109/TIFS.2017.2718482"
    },
    {
      "text": "V.M. Huynh and W.H. Wong. 1993. An optical technique for the measurement of 2-D texture of roller bearing surfaces. In Proceedings of 36th Midwest Symposium on Circuits and Systems. 1464–1466.",
      "doi": ""
    },
    {
      "text": "Wenzel Jakob, Adam Arbree, Jonathan T. Moon, Kavita Bala, and Steve Marschner. 2010. A Radiative Transfer Framework for Rendering Materials with Anisotropic Structure. ACM Trans. Graph. 29, 4, Article 53 (July 2010), 13 pages. https://doi.org/10.1145/1778765.1778790",
      "doi": "10.1145/1778765.1778790"
    },
    {
      "text": "Ryosuke Kikuchi, Sora Yoshikawa, Pradeep Kumar Jayaraman, Jianmin Zheng, and Takashi Maekawa. 2018. Embedding QR codes onto B-spline surfaces for 3D printing. Computer-Aided Design 102 (2018), 215–223. https://doi.org/10.1016/j.cad.2018.04.025 Proceeding of SPM 2018 Symposium.",
      "doi": "10.1016/j.cad.2018.04.025"
    },
    {
      "text": "Sohyun Kim, Hyunjin Seong, Yusun Her, and Jaehoon Chun. 2019. A study of the development and improvement of fashion products using a FDM type 3D printer. Fashion and Textiles 6, 1 (2019), 1–24.",
      "doi": ""
    },
    {
      "text": "Ching-Chih Lee. 1999. Analysis and Modeling of Surface Waviness Inspection with Light Reflection, Part 1: Laser Beam Scanning Method. Journal of Manufacturing Science and Engineering-transactions of The Asme 121, 4 (1999), 778–784.",
      "doi": ""
    },
    {
      "text": "Dingzeyu Li, David I. W. Levin, Wojciech Matusik, and Changxi Zheng. 2016. Acoustic Voxels: Computational Optimization of Modular Acoustic Filters. ACM Trans. Graph. 35, 4, Article 88 (jul 2016), 12 pages. https://doi.org/10.1145/2897824.2925960",
      "doi": "10.1145/2897824.2925960"
    },
    {
      "text": "Dingzeyu Li, Avinash S. Nair, Shree K. Nayar, and Changxi Zheng. 2017. AirCode: Unobtrusive Physical Tags for Digital Fabrication. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 449–460. https://doi.org/10.1145/3126594.3126635",
      "doi": "10.1145/3126594.3126635"
    },
    {
      "text": "Joseph J. Lim, C. Lawrence Zitnick, and Piotr Dollár. 2013. Sketch Tokens: A Learned Mid-level Representation for Contour and Object Detection. In 2013 IEEE Conference on Computer Vision and Pattern Recognition, Portland, OR, USA, June 23-28, 2013. IEEE Computer Society, 3158–3165. https://doi.org/10.1109/CVPR.2013.406",
      "doi": "10.1109/CVPR.2013.406"
    },
    {
      "text": "Henrique Teles Maia, Dingzeyu Li, Yuan Yang, and Changxi Zheng. 2019. LayerCode: Optical Barcodes for 3D Printed Shapes. ACM Trans. Graph. 38, 4, Article 112 (July 2019), 14 pages. https://doi.org/10.1145/3306346.3322960",
      "doi": "10.1145/3306346.3322960"
    },
    {
      "text": "E. Ohbuchi, H. Hanaizumi, and L. A. Hock. 2004. Barcode readers using the camera device in mobile phones. In 2004 International Conference on Cyberworlds. 260–265.",
      "doi": "10.1109/CW.2004.23"
    },
    {
      "text": "Fei Peng, Jing Yang, and Min Long. 2019. 3-D Printed Object Authentication Based on Printing Noise and Digital Signature. IEEE Transactions on Reliability 68, 1 (2019), 342–353. https://doi.org/10.1109/TR.2018.2869303",
      "doi": ""
    },
    {
      "text": "Hao Peng, Peiqing Liu, Lin Lu, Andrei Sharf, Lin Liu, Dani Lischinski, and Baoquan Chen. 2020. Fabricable Unobtrusive 3D-QR-Codes with Directional Light. Computer Graphics Forum(2020). https://doi.org/10.1111/cgf.14065",
      "doi": ""
    },
    {
      "text": "Hao Peng, Lin Lu, Lin Liu, Andrei Sharf, and Baoquan Chen. 2019. Fabricating QR codes on 3D objects using self-shadows. Computer-Aided Design 114 (2019), 91–100. https://doi.org/10.1016/j.cad.2019.05.029",
      "doi": "10.1016/j.cad.2019.05.029"
    },
    {
      "text": "Emily E Petersen, Romain W Kidd, and Joshua M Pearce. 2017. Impact of DIY home manufacturing with 3D printing on the toy and game market. Technologies 5, 3 (2017), 45.",
      "doi": ""
    },
    {
      "text": "Tess Roberts. 2020. 3D Hubs. Retrieved October, 2020 from https://www.hubs.com/blog/3d-printing-trends-2020/ 3D printing trends 2020..",
      "doi": ""
    },
    {
      "text": "Calvin Smith. 2019. Developing a Commercial Product Using a Consumer Grade 3D Printer. (2019).",
      "doi": ""
    },
    {
      "text": "Chen Song, Zhengxiong Li, Wenyao Xu, Chi Zhou, Zhanpeng Jin, and Kui Ren. 2018. My Smartphone Recognizes Genuine QR Codes! Practical Unclonable QR Code via 3D Printing. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 2, Article 83 (July 2018), 20 pages. https://doi.org/10.1145/3214286",
      "doi": "10.1145/3214286"
    },
    {
      "text": "Peter Troxler and Patricia Wolf. 2017. Digital maker-entrepreneurs in open design: What activities make up their business model?Business horizons 60, 6 (2017), 807–817.",
      "doi": ""
    },
    {
      "text": "Jeffrey Voris, Benjamin Foster Christen, Jorge Alted, and David W. Crawford. 2014. Three dimensional (3D) printed objects with embedded identification (ID) elements.",
      "doi": ""
    },
    {
      "text": "Joseph Ying Sen Wee, Christopher Ian Byatte, Anthony David George Rhoades, and David Leslie McNeight. 2015. Objets de vertu. US Patent App. 14/485,880.",
      "doi": ""
    },
    {
      "text": "Karl D. D. Willis and Andrew D. Wilson. 2013. InfraStructs: Fabricating Information inside Physical Objects for Imaging in the Terahertz Region. ACM Trans. Graph. 32, 4, Article 138 (July 2013), 10 pages. https://doi.org/10.1145/2461912.2461936",
      "doi": "10.1145/2461912.2461936"
    },
    {
      "text": "Lin Zhang, Ying Shen, and Hongyu Li. 2014. VSI: A Visual Saliency-Induced Index for Perceptual Image Quality Assessment. IEEE Transactions on Image Processing 23, 10 (2014), 4270–4281. https://doi.org/10.1109/TIP.2014.2346028",
      "doi": ""
    },
    {
      "text": "Li Zhekun, Rajit Gadh, and B. S. Prabhu. 2004. APPLICATIONS OF RFID TECHNOLOGY AND SMART PARTS IN MANUFACTURING. In ASME 2004 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference. 123–129.",
      "doi": ""
    }
  ]
}