{
  "doi": "10.1145/3544548.3581491",
  "title": "Redlining Maps and Terrains of Sustainability:: Interdisciplinary Mapping of Racialized Redlining to Present-Day Sustainability Agendas in HCI",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [],
  "abstract": "We ask how historic redlining, a US government run, racially discriminatory practice of assessing and mapping property values for federally subsidized home loan eligibility in the 1930s, is tied to current issues of sustainability. We frame redlining as a historic data practice, tied to ongoing exposure to environmental harms and difficulty building generational wealth in African American communities in Indianapolis. To address this, we made maps to ground interdisciplinary discourse between the authors: two who research sustainable human computer interaction (SHCI) and one who researches sustainable food systems, including issues of food security. Our maps, which combine historical redlining maps and contemporary sustainability issues facing Indianapolis, helped us explore the ongoing impacts of redlining across our disciplines. We develop the term ‘sustainability’ for HCI across racial, socioeconomic, and environmental tensions and reflect on how SHCI's emerging posthuman emphasis on human/non-human relations are associated with human/human challenges like redlining.",
  "tags": [
    "Sustainable HCI, Redlining",
    "Sustainability, Ecological Posthumanism, Socioeconomic Sustainability"
  ],
  "authors": [
    {
      "name": "Heidi Biggs",
      "institution": "College of Information Sciences and Technology, Pennsylvania State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441708",
      "orcid": "0000-0001-9208-7921"
    },
    {
      "name": "Shellye Suttles",
      "institution": "O'Neill School of Public & Environmental Affairs, Indiana University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778861",
      "orcid": "0000-0003-4100-8431"
    },
    {
      "name": "Shaowen Bardzell",
      "institution": "College of Information Sciences and Technology, Pennsylvania State University, United States",
      "img": "/do/10.1145/contrib-81100057558/rel-imgonly/shaowen_bardzell.png",
      "acmid": "81100057558",
      "orcid": "0000-0001-7596-9244"
    }
  ],
  "references": [
    {
      "text": "Veronica Abebe, Marina Beshai, Naaji R Hylton, Carina G Lewandowski, Lindsey A Moore, Ethan H Thai, Frelicia N Tucker, and Janet Vertesi. 2022. Anti-Racist HCI: notes on an emerging critical technical practice. In CHI 2022.",
      "doi": "10.1145/3491101.3516382"
    },
    {
      "text": "Lisa Austin. 2022. From Privacy to Social Legibility. Surveillance and Society 20, 3: 302–305.",
      "doi": ""
    },
    {
      "text": "Lindsay Barbieri, Sonya Ahamed, and Sam Bliss. 2019. Farming within limits. Interactions 26, 5: 70–73. https://doi.org/10.1145/3348795",
      "doi": "10.1145/3348795"
    },
    {
      "text": "Ruha Benjamin. 2019. Race after technology: Abolitionist tools for the new jim code. Social Forces.",
      "doi": ""
    },
    {
      "text": "Heidi Biggs, Jeffrey Bardzell, and Shaowen; Bardzell. 2021. Watching Myself Watching Birds: Abjection, Ecological Thinking and Posthuman Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21).",
      "doi": "10.1145/3411764.3445329"
    },
    {
      "text": "Heidi Biggs, Tejaswini Joshi, Ries Murphy, Jeffrey Bardzell, and Shaowen Bardzell. 2021. Alternatives to Agrilogistics: Designing for Ecological Thinking. In In Proceedings of the ACM on Human-Computer Interaction,.",
      "doi": "10.1145/3479557"
    },
    {
      "text": "Heidi Biggs, Cayla Key, Audrey Desjardins, and Afroditi Psarra. 2021. Moving Design Research: GIFs as Research Tools. 1–14.",
      "doi": ""
    },
    {
      "text": "Heidi R Biggs and Audrey Desjardins. 2020. High Water Pants: Designing Embodied Environmental Speculation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–13. https://doi.org/10.1145/3313831.3376429",
      "doi": "10.1145/3313831.3376429"
    },
    {
      "text": "Tony Dunne and Delena Pacenti Bill Gaver. 1999. Cultural Probes. ACM Interactions, February: 21–29.",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable Interaction Design: Invention & Disposal, Renewal & Reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’07), 503–512. https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Eli Blevis. 2018. Seeing What Is and What Can Be. 1–14. https://doi.org/10.1145/3173574.3173944",
      "doi": "10.1145/3173574.3173944"
    },
    {
      "text": "William Blomquist and Roger B Parks. 1995. Fiscal, service, and political impacts of Indianapolis-Marion County's Unigov. Publius: The Journal of Federalism 25, 4: 37–54.",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Peter Wright, John Bowers, Andy Boucher, Nadine Jarvis, Phil Reynolds, and Bill Gaver. 2010. Age and experience: Ludic engagement in a residential care setting. DIS 2010 - Proceedings of the 8th ACM Conference on Designing Interactive Systems: 161–170. https://doi.org/10.1145/1858171.1858200",
      "doi": "10.1145/1858171.1858200"
    },
    {
      "text": "David J. Bodenhamer, Robert G. Barrows, and David Gordon. Vanderstel. 1994. Encyclopedia of Indianapolis. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Rosi Braidotti. 2013. The Posthuman. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Janet X. Chen, Allison McDonald, Yixin Zou, Emily Tseng, Kevin A. Roundy, Acar Tamersoy, Florian Schaub, Thomas Ristenpart, and Nicola Dell. 2022. Trauma-Informed Computing: Towards Safer Technology Experiences for All. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3491102.3517475",
      "doi": "10.1145/3491102.3517475"
    },
    {
      "text": "Kate Crawford. 2021. The Atlas of AI. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Paul J Crutzen. 2002. The “anthropocene.” In Journal de Physique IV (Proceedings), 1–5.",
      "doi": ""
    },
    {
      "text": "Jenny L. Davis, Apryl Williams, and Michael W. Yang. 2021. Algorithmic reparation. Big Data and Society 8, 2. https://doi.org/10.1177/20539517211044808",
      "doi": ""
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2018. Lessons from the woodshop: Cultivating design with living materials. Conference on Human Factors in Computing Systems - Proceedings 2018-April: 1–12. https://doi.org/10.1145/3173574.3174159",
      "doi": "10.1145/3173574.3174159"
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2019. Designing with waste: A situated inquiry into the material excess of making. Proceedings of the 2019 ACM Designing Interactive Systems Conference (DIS ’19): 1307–1319. https://doi.org/10.1145/3322276.3322320",
      "doi": "10.1145/3322276.3322320"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the 28th international conference on Human factors in computing systems (CHI ’10), 1975–1984. https://doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design. 656–671. https://doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. Proceedings of the 8th ACM Conference on Designing Interactive Systems . ACM.: 1–10. https://doi.org/10.1145/1858171.1858173",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Elizabeth Eisenhauer. 2001. In poor health: Supermarket redlining and urban nutrition. GeoJournal 53, 2: 125–133. https://doi.org/10.1023/A:1015772503007",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger. 2019. Entanglement HCI the next wave? ACM Transactions on Computer-Human Interaction 27, 1: 1–27. https://doi.org/10.1145/3364998",
      "doi": "10.1145/3364998"
    },
    {
      "text": "Tony Fry. 2009. Design futuring. University of New South Wales Press.",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi and Johan Redström. 2020. Technology and More-Than-Human Design. Design Issues 36, 4: 33–44.",
      "doi": ""
    },
    {
      "text": "Jenny Goldstein and Eric Nost (eds.). 2022. The Nature of Data: Information, Environments, Politics. University of Nebraska Press.",
      "doi": ""
    },
    {
      "text": "David Hankerson, Andrea R. Marshall, Jennifer Booker, Houda el Mimouni, Imani Walker, and Jennifer A. Rode. 2016. Does technology have race? Conference on Human Factors in Computing Systems - Proceedings 07-12-May-: 473–485. https://doi.org/10.1145/2851581.2892578",
      "doi": "10.1145/2851581.2892578"
    },
    {
      "text": "Donna Haraway. 2003. The Companion Species Manifesto: Dogs, People, and Significant Otherness. Chicago, Ill.: Prickly Paradigm.",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 2016. Staying with the trouble: Making kin in the Chthulucene. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Amy E. Hillier. 2003. Redlining and the Home Owners’ Loan Corporation. Journal of Urban History 29, 4: 394–420. https://doi.org/10.1177/0096144203029004002",
      "doi": ""
    },
    {
      "text": "Noura Howell, Audrey Desjardins, and Sarah Fox. 2021. Cracks in the Success Narrative: Rethinking Failure in Design Research through a Retrospective Trioethnography. 28, 6.",
      "doi": ""
    },
    {
      "text": "Bran Knowles, Oliver Bates, and Hakansson Maria. 2018. This Changes Sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’18), 1–12. https://doi.org/10.1145/3173574.3174045",
      "doi": "10.1145/3173574.3174045"
    },
    {
      "text": "Haley M Lane, Rachel Morello-frosch, Julian D Marshall, and Joshua S Apte. 2022. Historical Redlining Is Associated with Present-Day Air Pollution Disparities in U.S. Cities. https://doi.org/10.1021/acs.estlett.1c01012",
      "doi": ""
    },
    {
      "text": "League of Women Voters of Indianapolis (ed.). 2016. UNIGOV HANDBOOK: A Citizens Guide to Local Government. League of Women Voters of Indianapolis Education Fund, Indianapolis.",
      "doi": ""
    },
    {
      "text": "Dongying Li and Bev Wilson. 2022. Modeling the relationships between historical redlining , urban heat , and heat-related emergency department visits: An examination of 11 Texas cities. 49, 3. https://doi.org/10.1177/23998083211039854",
      "doi": ""
    },
    {
      "text": "Min Li and Faxi Yuan. 2022. Historical Redlining and Resident Exposure to COVID - 19: A Study of New York City. Race and Social Problems 14, 2: 85–100. https://doi.org/10.1007/s12552-021-09338-z",
      "doi": ""
    },
    {
      "text": "Max Liboiron. 2021. Pollution is colonialism. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Ann Light, Irina Shklovski, and Alison Powell. 2017. Design for Existential Crisis. Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17): 722–734. https://doi.org/10.1145/3027063.3052760",
      "doi": "10.1145/3027063.3052760"
    },
    {
      "text": "Jen Liu, Daragh Byrne, and Laura Devendorf. 2018. Design for Collaborative Survival: An Inquiry into Human-Fungi Relationships. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–13. https://doi.org/10.1145/3173574.3173614",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Jen Liu and Phoebe Sengers. 2021. Legibility and the Legacy of Racialized Dispossession in Digital Agriculture. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2. https://doi.org/10.1145/3479867",
      "doi": "10.1145/3479867"
    },
    {
      "text": "Szu Yu Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2019. Symbiotic encounters: HCI and sustainable agriculture. Conference on Human Factors in Computing Systems - Proceedings: 1–13. https://doi.org/10.1145/3290605.3300547",
      "doi": "10.1145/3290605.3300547"
    },
    {
      "text": "Szu Yu Cyn Liu, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Decomposition as design: Co-creating (with) natureculture. TEI 2019 - Proceedings of the 13th International Conference on Tangible, Embedded, and Embodied Interaction: 605–614. https://doi.org/10.1145/3294109.3295653",
      "doi": "10.1145/3294109.3295653"
    },
    {
      "text": "Maya Livio and Laura Devendorf. 2022. The Eco-Technical Interface: Atuning to the Instrumental.",
      "doi": ""
    },
    {
      "text": "Yanni Alexander Loukissas. 2019. All Data are Local: Thinking Critically in a Data-Driven Society. MIT Press.",
      "doi": ""
    },
    {
      "text": "Lawrence L Martin and Jeannie Hock Schiff. 2011. City–county consolidations: Promise versus performance. State and local government review 43, 2: 167–177.",
      "doi": ""
    },
    {
      "text": "Lawrence L Martin and Jeannie Hock Schiff. 2011. City–county consolidations: Promise versus performance. State and local government review 43, 2: 167–177.",
      "doi": ""
    },
    {
      "text": "Alison Mills. 2018. The Color of Law: A Forgotten History of How Our Government Segregated America. Berkeley Planning Journal 29. https://doi.org/10.5070/bp329138440",
      "doi": ""
    },
    {
      "text": "Donovan Moxley and Burnell Fischer. 2020. Historic HOLC Redlining in Indianapolis and the Legacy of Environmental Impacts. Journal of Public and Environmental Affairs 1, 1: 1–8. https://doi.org/10.14434/jpea.v1i1.30321",
      "doi": ""
    },
    {
      "text": "Anthony Nardone, Joan A Casey, Rachel Morello-frosch, Mahasin Mujahid, John R Balmes, and Neeta Thakur. 2020. Articles Associations between historical residential redlining and current age-adjusted rates of emergency department visits due to asthma across eight cities in California: an ecological study. 24–31. https://doi.org/10.1016/S2542-5196(19)30241-4",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of oppression: How search engines reinforce racism. nyu Press.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-ogburu, Angela D R Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. 1–16.",
      "doi": ""
    },
    {
      "text": "Jasper Tran O'Leary, Sara Zewde, Jennifer Mankoff, and Daniela K. Rosner. 2019. Who gets to future? Race, representation, and design methods in Africatown. Conference on Human Factors in Computing Systems - Proceedings: 1–13. https://doi.org/10.1145/3290605.3300791",
      "doi": "10.1145/3290605.3300791"
    },
    {
      "text": "Cathy O'neil. 2016. Weapons of math destruction: How big data increases inequality and threatens democracy. Crown.",
      "doi": ""
    },
    {
      "text": "Doenja Oogjes and Ron Wakkary. 2022. Weaving Stories: Toward Repertoires for Designing Things. In In CHI Conference on Human Factors in Computing Systems (CHI ’22).",
      "doi": ""
    },
    {
      "text": "Robert Phillips and Kaylene Kau. 2019. Gaming for Active Nature Engagement Animal Diplomacy Bureau: designing games to engage and create player agency in urban nature. The Design Journal 22, sup1: 1587–1602. https://doi.org/10.1080/14606925.2019.1594993",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2017. Matters of Care: Speculative Ethics in More Than Human Worlds.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Shivani Kapania, and Hannah Highfll. 2021. Everyone wants to do the model work, not the data work: Data cascades in high-stakes ai. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3411764.3445518",
      "doi": "10.1145/3411764.3445518"
    },
    {
      "text": "Richard D Sawyer and Joe Norris. 2013. Duoethnography Understanding Qualitative Research. New York.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Alex Hanna, and Emily Denton. 2021. Do Datasets Have Politics? Disciplinary Values in Computer Vision Dataset Development. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2. https://doi.org/10.1145/3476058",
      "doi": "10.1145/3476058"
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI. 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025682"
    },
    {
      "text": "Jerry Shannon. 2020. Dollar Stores, Retailer Redlining, and the Metropolitan Geographies of Precarious Consumption. Annals of the American Association of Geographers 0, 0: 1–19. https://doi.org/10.1080/24694452.2020.1775544",
      "doi": ""
    },
    {
      "text": "Gregory D. Squires. 1992. From Redlining to Reinvestment.",
      "doi": ""
    },
    {
      "text": "Erik Steiner and Matt Nowlin. 2022. Modern Redlining in Indianapolis? - SAVI. SAVI. Retrieved September 11, 2022 from https://www.savi.org/2022/04/14/modern-redlining-in-indianapolis/",
      "doi": ""
    },
    {
      "text": "Bill Tomlinson, Eli Blevis, Bonnie Nardi, Donald J. Patterson, M. Six Silberman, and Yue Pan. 2013. Collapse informatics and practice: Theory, method, and design. ACM Transactions on Computer-Human Interaction 20, 4: 1–26. https://doi.org/10.1145/2493431",
      "doi": "10.1145/2493431"
    },
    {
      "text": "Anna Lowenhaupt Tsing. 2015. The mushroom at the end of the world: On the possibility of life in capitalist ruins. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Palashi Vaghela, Steven J. Jackson, and Phoebe Sengers. 2022. Interrupting Merit, Subverting Legibility: Navigating Caste In “Casteless” Worlds of Computing. Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3491102.3502059",
      "doi": "10.1145/3491102.3502059"
    },
    {
      "text": "Ron Wakkary. 2021. Things we could design: For more than human-centered worlds. MIT press.",
      "doi": ""
    },
    {
      "text": "Anne-Marie Willis. 2006. Ontological Designing. Design Philosophy Papers 4, 2: 69–92. https://doi.org/10.2752/144871306x13966268131514",
      "doi": ""
    },
    {
      "text": "Kathryn Yusoff. 2018. A Billion Black Anthropocenes or None. University of Minnesota Press. Retrieved from http://www.academia.edu/download/52821795/bitcoin-Kindle-conversion.pdf",
      "doi": ""
    },
    {
      "text": "1969. Negroes Oppose Lugar Unigov Plan: Fear Council Districts May Be Gerrymandered. Indianapolis Recorder. Retrieved January 23, 2023 from https://newspapers.library.in.gov/?a=d&d=INR19690125-01.1.1&srpos=3&e=——-en-20-INR-1-byDA-txt-txIN-unigov——",
      "doi": ""
    },
    {
      "text": "History of Fair Housing - HUD | HUD.gov / U.S. Department of Housing and Urban Development (HUD). Retrieved September 7, 2022 from https://www.hud.gov/program_offices/fair_housing_equal_opp/aboutfheo/history",
      "doi": ""
    },
    {
      "text": "Unigov: Unifying Indianapolis and Marion County. Digital Civil Rights Museum. Retrieved January 23, 2023 from https://digitalresearch.bsu.edu/digitalcivilrightsmuseum/items/show/42",
      "doi": ""
    },
    {
      "text": "Kroger Settles Discrimination Suit | Progressive Grocer. Retrieved September 14, 2022 from https://progressivegrocer.com/kroger-settles-discrimination-suit",
      "doi": ""
    }
  ]
}