{
  "doi": "10.1145/3544548.3581285",
  "title": "DuoRhythmo: Design and remote user experience evaluation (UXE) of a collaborative accessible digital musical interface (CADMI) for people with ALS (PALS)",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "We present DuoRhythmo, a collaborative accessible digital musical interface (CADMI) that gives people living with Amyotrophic Lateral Sclerosis (PALS) the experience of remotely and collaboratively creating music in real-time. We designed DuoRhythmo specifically to be utilized for eye tracking and optimized it for head- and computer mouse interaction, as well using a user-centered design approach. Together with five PALS, we completed a mixed-methods evaluation to assess the accessibility of DuoRhythmo. Participants described the CADMI using the Microsoft Desirability Toolkit (MDT) as fun, empowering, accessible, easy to use, engaging, and stimulating and gave an average System Usability Scale (SUS) score of 79.5. We suggest further research on remote collaboration within the field of accessible digital musical instruments (ADMIs) using the term CADMI to explore the positive effects of collaborative music-making on the quality of life of PALS.",
  "tags": [
    "people living with ALS",
    "musical co-creation",
    "user-centered design",
    "eye tracking",
    "remote user experience evaluation",
    "accessibility"
  ],
  "authors": [
    {
      "name": "Balazs Andras Ivanyi",
      "institution": "Multisensory Experience Lab, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778292",
      "orcid": "0000-0002-6758-8377"
    },
    {
      "name": "Truls Bendik Tjemsland",
      "institution": "Multisensory Experience Lab, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781947",
      "orcid": "0000-0002-3279-631X"
    },
    {
      "name": "Christian Vasileios Tsalidis de Zabala",
      "institution": "Multisensory Experience Lab, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781448",
      "orcid": "0000-0002-3402-4428"
    },
    {
      "name": "Lilla Julia Toth",
      "institution": "Multisensory Experience Lab, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781091",
      "orcid": "0000-0002-4651-7289"
    },
    {
      "name": "Marcus Alexander Dyrholm",
      "institution": "Multisensory Experience Lab, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779996",
      "orcid": "0000-0002-8671-3217"
    },
    {
      "name": "Scott James Naylor",
      "institution": "Multisensory Experience Lab, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783842",
      "orcid": "0000-0002-6627-7569"
    },
    {
      "name": "Ann Paradiso",
      "institution": "Enable Group, Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545822456",
      "orcid": "0000-0002-5092-8603"
    },
    {
      "name": "Dwayne Lamb",
      "institution": "Enable Group, Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659476636",
      "orcid": "0000-0001-8932-4850"
    },
    {
      "name": "Jarnail Chudge",
      "institution": "Enable Group, Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239971",
      "orcid": "0000-0002-5788-5204"
    },
    {
      "name": "Ali Adjorlu",
      "institution": "Multisensory Experience Lab, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659431097",
      "orcid": "0000-0001-5414-8631"
    },
    {
      "name": "Stefania Serafin",
      "institution": "Department of Architecture, Design and Media Technology, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100453403",
      "orcid": "0000-0001-6971-1132"
    }
  ],
  "references": [
    {
      "text": "Ableton. 2012. Margulies and Anderson’s eye-controlled musical interface for Ableton Live. Retrieved December 10, 2022 from http://youtu.be/2Gf9QuClzJI",
      "doi": ""
    },
    {
      "text": "Nazem Atassi, Amanda Cook, Cristiana ME Pineda, Padmaja Yerramilli-Rao, Darlene Pulley, and Merit Cudkowicz. 2011. Depression in amyotrophic lateral sclerosis. Amyotrophic Lateral Sclerosis 12, 2 (2011), 109–112. https://doi.org/10.3109/17482968.2010.536839",
      "doi": ""
    },
    {
      "text": "Audiokinetic. 2022. Wwise is Audiokinetic’s software for interactive media and video games. Retrieved December 10, 2022 from http://audiokinetic.com/products/wwise/",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip T Kortum, and James T Miller. 2008. An empirical evaluation of the system usability scale. Intl. Journal of Human–Computer Interaction 24, 6(2008), 574–594. https://doi.org/10.1080/10447310802205776",
      "doi": ""
    },
    {
      "text": "Paul Batchelor. 2017. SoundJam: An Eye-Controlled Music Composition and Performance environment. Retrieved December 10, 2022 from https://github.com/MSRenable/HandsFreeSoundJam",
      "doi": ""
    },
    {
      "text": "Joey Benedek and Trish Miner. 2002. Measuring Desirability: New methods for evaluating desirability in a usability lab setting. Proceedings of Usability Professionals Association 2003, 8-12(2002), 57.",
      "doi": ""
    },
    {
      "text": "Erin Beneteau. 2020. Who Are You Asking?: Qualitative Methods for Involving AAC Users as Primary Research Participants. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376883",
      "doi": "10.1145/3313831.3376883"
    },
    {
      "text": "Genesis R. Bojorquez, Kimmeth E. Jackson, and Amy K. Andrews. 2020. Music Therapy for Surgical Patients. Critical Care Nursing Quarterly 43, 1 (Jan. 2020), 81–85. https://doi.org/10.1097/cnq.0000000000000294",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "John Brooke 1996. SUS: A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4–7.",
      "doi": ""
    },
    {
      "text": "Andrea Calvo, Adriano Chiò, Emiliano Castellina, Fulvio Corno, Laura Farinetti, Paolo Ghiglione, Valentina Pasian, and Alessandro Vignola. 2008. Eye Tracking Impact on Quality-of-Life of ALS Patients. In Computers Helping People with Special Needs, Klaus Miesenberger, Joachim Klaus, Wolfgang Zagler, and Arthur Karshmer (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 70–77.",
      "doi": ""
    },
    {
      "text": "Richard Cave and Steven Bloch. 2020. Voice banking for people living with motor neurone disease: Views and expectations. International Journal of Language & Communication Disorders 56, 1 (Dec. 2020), 116–129. https://doi.org/10.1111/1460-6984.12588",
      "doi": ""
    },
    {
      "text": "Eugenia Costa-Giomi. 2004. Effects of three years of piano instruction on children’s academic achievement, school performance and self-esteem. Psychology of music 32, 2 (2004), 139–152. https://doi.org/10.1177/0305735604041491",
      "doi": ""
    },
    {
      "text": "DatoDUO. 2022. Dato DUO — the synth for two. https://dato.mu/.",
      "doi": ""
    },
    {
      "text": "Nicola Davanzo and Federico Avanzini. 2020. Hands-Free Accessible Digital Musical Instruments: Conceptual Framework, Challenges, and Perspectives. IEEE Access 8(2020), 163975–163995. https://doi.org/10.1109/ACCESS.2020.3019978",
      "doi": ""
    },
    {
      "text": "Nicola Davanzo, Piercarlo Dondi, Mauro Mosconi, and Marco Porta. 2018. Playing Music with the Eyes through an Isomorphic Interface. In Proceedings of the Workshop on Communication by Gaze Interaction (Warsaw, Poland) (COGAIN ’18). Association for Computing Machinery, New York, NY, USA, Article 5, 5 pages. https://doi.org/10.1145/3206343.3206350",
      "doi": "10.1145/3206343.3206350"
    },
    {
      "text": "Erik D. Demaine, Francisco Gomez-Martin, Henk Meijer, David Rappaport, Perouz Taslakian, Godfried T. Toussaint, Terry Winograd, and David R. Wood. 2009. The distance geometry of music. Computational Geometry 42, 5 (2009), 429–454. https://doi.org/10.1016/j.comgeo.2008.04.005 Special Issue on the Canadian Conference on Computational Geometry (CCCG 2005 and CCCG 2006).",
      "doi": "10.1016/j.comgeo.2008.04.005"
    },
    {
      "text": "Molly Doyle and Barbara Phillips. 2001. Trends in augmentative and alternative communication use by individuals with amyotrophic lateral sclerosis. Augmentative and Alternative Communication 17, 3 (2001), 167–178. https://doi.org/10.1080/aac.17.3.167.178 arXiv:https://doi.org/10.1080/aac.17.3.167.178",
      "doi": ""
    },
    {
      "text": "Mohamad A. Eid, Nikolas Giakoumidis, and Abdulmotaleb El Saddik. 2016. A Novel Eye-Gaze-Controlled Wheelchair System for Navigating Unknown Environments: Case Study With a Person With ALS. IEEE Access 4(2016), 558–573. https://doi.org/10.1109/ACCESS.2016.2520093",
      "doi": ""
    },
    {
      "text": "Michael A. Elliott, Henrique Malvar, Lindsey L. Maassel, Jon Campbell, Harish Kulkarni, Irina Spiridonova, Noelle Sophy, Jay Beavers, Ann Paradiso, Chuck Needham, Jamie Rifley, Maggie Duffield, Jeremy Crawford, Becky Wood, Emily J. Cox, and James M. Scanlan. 2019. Eye-controlled, power wheelchair performs well for ALS patients. Muscle & Nerve 60, 5 (Aug. 2019), 513–519. https://doi.org/10.1002/mus.26655",
      "doi": ""
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement.Journal of experimental psychology 47, 6 (1954), 381.",
      "doi": ""
    },
    {
      "text": "Emma Frid. 2019. Accessible digital musical instruments—a review of musical interfaces in inclusive music practice. Multimodal Technologies and Interaction 3, 3 (2019), 57.",
      "doi": ""
    },
    {
      "text": "Microsoft Research Enable Group. 2017. Microsoft Hands-Free Sound Machine is an eye-controlled, 16-step sound sequencer that provides users the ability to generate musical compositions via a combination of.wav and midi samples, and supports output to physical instruments as well as stage effects.Retrieved December 10, 2022 from http://microsoft.com/en-us/research/project/microsoft-hands-free-sound-machine/",
      "doi": ""
    },
    {
      "text": "Ian Hattwick. 2017. Computer music design euclidean rhythm - GitHub repository. Retrieved December 10, 2022 from https://github.com/computermusicdesign/euclidean-rhythm",
      "doi": ""
    },
    {
      "text": "Henkjan Honing, Olivia Ladinig, Gábor P Háden, and István Winkler. 2009. Is beat induction innate or learned? Probing emergent meter perception in adults and newborns using event-related brain potentials. Annals of the New York Academy of Sciences 1169, 1 (2009), 93–96. https://doi.org/10.1111/j.1749-6632.2009.04761.x",
      "doi": ""
    },
    {
      "text": "Anthony J Hornof. 2014. The Prospects For Eye-Controlled Musical Performance.. In NIME. Citeseer, NIME, Goldsmiths, University of London, 461–466.",
      "doi": ""
    },
    {
      "text": "Alon Ilsar, Gail Kenning, Sam Trolland, and Ciaran Frame. 2022. Inclusive Improvisation: Exploring the Line between Listening and Playing Music. ACM Trans. Access. Comput. 15, 2, Article 9 (may 2022), 21 pages. https://doi.org/10.1145/3506856",
      "doi": "10.1145/3506856"
    },
    {
      "text": "QSR International. 2022. NVivo is a qualitative data analysis computer software. Retrieved December 10, 2022 from https://qsrinternational.com/nvivo-qualitative-data-analysis-software/home",
      "doi": ""
    },
    {
      "text": "Nataliya V Ivankova, John W Creswell, and Sheldon L Stick. 2006. Using mixed-methods sequential explanatory design: From theory to practice. Field methods 18, 1 (2006), 3–20.",
      "doi": ""
    },
    {
      "text": "Robert J. K. Jacob. 1995. Eye Tracking in Advanced Interface Design. Oxford University Press, Inc., USA, 258–288.",
      "doi": ""
    },
    {
      "text": "Jamboxx. 2022. A hands-free electronic, breath-powered instrument. Retrieved December 10, 2022 from http://jamboxx.com/",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane and Meredith Ringel Morris. 2017. Let’s Talk About X: Combining Image Recognition and Eye Gaze to Support Conversation for People with ALS. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 129–134. https://doi.org/10.1145/3064663.3064762",
      "doi": "10.1145/3064663.3064762"
    },
    {
      "text": "Juno Kim, Greg Schiemer, and Terumi Narushima. 2007. Oculog: Playing with Eye Movements. In Proceedings of the 7th International Conference on New Interfaces for Musical Expression (New York, New York) (NIME ’07). Association for Computing Machinery, New York, NY, USA, 50–55. https://doi.org/10.1145/1279740.1279747",
      "doi": "10.1145/1279740.1279747"
    },
    {
      "text": "Ableton Live. 2022. Live is a digital audio workstation created by Ableton founders Gerhard Behles and Robert Henke. Retrieved December 10, 2022 from http://ableton.com/en/live/",
      "doi": ""
    },
    {
      "text": "Alex Lucas, Miguel Ortiz, and Franziska Schroeder. 2019. Bespoke Design for Inclusive Music: The Challenges of Evaluation, NIME2019. NIME, Porto Alegre, Brazil, 1–6.",
      "doi": ""
    },
    {
      "text": "Päivi Majaranta and Andreas Bulling. 2014. Eye Tracking and Eye-Based Human–Computer Interaction. Springer London, London, 39–65. https://doi.org/10.1007/978-1-4471-6392-3_3",
      "doi": ""
    },
    {
      "text": "Paul Mehta, Jaime Raymond, Moon Kwon Han, Theodore Larson, James D Berry, Sabrina Paganoni, Hiroshi Mitsumoto, Richard Stanley Bedlack, D Kevin Horton, 2021. Recruitment of Patients With Amyotrophic Lateral Sclerosis for Clinical Trials and Epidemiological Studies: Descriptive Study of the National ALS Registry’s Research Notification Mechanism. Journal of Medical Internet Research 23, 12 (2021), e28021.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2022. Eye Control for Windows. Retrieved December 10, 2022 from http://microsoft.com/en-us/garage/wall-of-fame/eye-control-windows-10/",
      "doi": ""
    },
    {
      "text": "Carlos H. Morimoto, Antonio Diaz-Tula, José A. T. Leyva, and Carlos E. L. Elmadjian. 2015. Eyejam: A Gaze-Controlled Musical Interface. In Proceedings of the 14th Brazilian Symposium on Human Factors in Computing Systems (Salvador, Brazil) (IHC ’15). Association for Computing Machinery, New York, NY, USA, Article 37, 9 pages. https://doi.org/10.1145/3148456.3148493",
      "doi": "10.1145/3148456.3148493"
    },
    {
      "text": "Ander Ramos Murguialday, Jeremy Hill, Michael Bensch, Suzanna Martens, Sebastian Halder, Femke Nijboer, Bernhard Schoelkopf, Niels Birbaumer, and Alireza Gharabaghi. 2011. Transition from the locked in to the completely locked-in state: A physiological analysis. Clinical Neurophysiology 122, 5 (2011), 925–933. https://doi.org/10.1016/j.clinph.2010.08.019",
      "doi": ""
    },
    {
      "text": "Jakob Nilsen. 2022. Why You Only Need to Test with 5 Users. https://nngroup.com/articles/why-you-only-need-to-test-with-5-users/.",
      "doi": ""
    },
    {
      "text": "NINDS. 2022. Amyotrophic Lateral Sclerosis (ALS) Fact Sheet | National Institute of Neurological Disorders and Stroke. Retrieved December 10, 2022 from https://ninds.nih.gov/Disorders/Patient-Caregiver-Education/Fact-Sheets/Amyotrophic-Lateral-Sclerosis-ALS-Fact-Sheet",
      "doi": ""
    },
    {
      "text": "Normcore. 2022. Only multiplayer framework that provides industry-standard VOIP and audio streaming capabilities for Unity.Retrieved December 10, 2022 from http://normcore.io/",
      "doi": ""
    },
    {
      "text": "International Alliance of ALS/MND Associations. 2022. PALS and CALS Advisory Council. Retrieved December 10, 2022 from http://als-mnd.org/about-us/committees-advisory-councils/pals-and-cals-advisory-council/",
      "doi": ""
    },
    {
      "text": "International Alliance of ALS/MND Associations. 2022. What is ALS/MND?https://als-mnd.org/what-is-alsmnd/.",
      "doi": ""
    },
    {
      "text": "Otter.ai. 2022. Real-time transcription of meeting notes using AI.Retrieved December 10, 2022 from http://Otter.ai/",
      "doi": ""
    },
    {
      "text": "William Christopher Payne, Ann Paradiso, and Shaun K. Kane. 2020. Cyclops: Designing an Eye-Controlled Instrument for Accessibility and Flexible Use. In NIME 2020. NIME, NIME, Birmingham City University, 576–580.",
      "doi": ""
    },
    {
      "text": "Helen Petrie and Nigel Bevan. 2009. The Evaluation of Accessibility, Usability, and User Experience. In The Universal Access Handbook, Vol. 1. CRC Press, Boca Raton, Florida, United States, 1–16.",
      "doi": ""
    },
    {
      "text": "Andrea Polli. 1999. Active vision: Controlling sound with eye movements. Leonardo 32, 5 (1999), 405–411.",
      "doi": ""
    },
    {
      "text": "English Queen’s University Belfast’s School of Arts and Languages. 2022. Performance without Barriers explore the role of technology in removing the access barriers encountered by some disabled musicians in creative pursuits. Retrieved December 10, 2022 from http://performancewithoutbarriers.com/",
      "doi": ""
    },
    {
      "text": "Pilar Rojas, Ana I Ramírez, José A Fernández-Albarral, Inés López-Cuenca, Elena Salobrar-García, Manuel Cadena, Lorena Elvira-Hurtado, Juan J Salazar, Rosa de Hoz, and José M Ramírez. 2020. Amyotrophic lateral sclerosis: a neurodegenerative motor neuron disease with ocular involvement. Frontiers in Neuroscience 14 (2020), 566858.",
      "doi": ""
    },
    {
      "text": "Franziska Schroeder and Alex Lucas. 2021. Distributed Participatory Design: The challenges of designing with physically disabled musicians during a global pandemic. Organised Sound 26, 2 (2021), 219–229.",
      "doi": ""
    },
    {
      "text": "Tiago Silva da Silva, Angela Martin, Frank Maurer, and Milene Silveira. 2011. User-Centered Design and Agile Methods: A Systematic Review. In 2011 Agile Conference. IEEE, IEEE, Salt Lake City, Utah, USA, 77–86. https://doi.org/10.1109/AGILE.2011.24",
      "doi": "10.1109/AGILE.2011.24"
    },
    {
      "text": "Philip L Smith and Daniel R Little. 2018. Small is beautiful: In defense of the small-N design. Psychonomic bulletin & review 25, 6 (2018), 2083–2101. https://doi.org/10.3758/s13423-018-1451-8",
      "doi": ""
    },
    {
      "text": "VERBI Software. 2022. MAXQDA is a software program designed for computer-assisted qualitative data.Retrieved December 10, 2022 from http://maxqda.com/",
      "doi": ""
    },
    {
      "text": "Rossella Spataro, Valeria Bono, Santino Marchese, and Vincenzo La Bella. 2012. Tracheostomy mechanical ventilation in patients with amyotrophic lateral sclerosis: clinical features and survival analysis. Journal of the neurological sciences 323, 1-2 (2012), 66–70. https://doi.org/10.1016/j.jns.2012.08.011",
      "doi": ""
    },
    {
      "text": "Splice. 2022. Splice offers royalty-free audio samples.Retrieved December 10, 2022 from http://splice.com/",
      "doi": ""
    },
    {
      "text": "Karette Stensaeth. 2013. “Musical co-creation”? Exploring health-promoting potentials on the use of musical and interactive tangibles for families with children with disabilities. International journal of qualitative studies on health and well-being 8, 1(2013), 20704. https://doi.org/10.3402/qhw.v8i0.20704",
      "doi": ""
    },
    {
      "text": "Den'etsu Sutoo and Kayo Akiyama. 2004. Music improves dopaminergic neurotransmission: demonstration based on the effect of music on blood pressure regulation. Brain Research 1016, 2 (Aug. 2004), 255–262. https://doi.org/10.1016/j.brainres.2004.05.018",
      "doi": ""
    },
    {
      "text": "L. Taylor, Paul Wicks, Peter N. Leigh, and Laura H. Goldstein. 2010. Prevalence of depression in amyotrophic lateral sclerosis and other motor disorders. European Journal of Neurology 17, 8 (2010), 1047–1053. https://doi.org/10.1111/j.1468-1331.2010.02960.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1468-1331.2010.02960.x",
      "doi": ""
    },
    {
      "text": "Tobii. 2022. Tobii Eye Tracker 5 is a head and eye tracker. Retrieved December 10, 2022 from http://gaming.tobii.com/product/eye-tracker-5/",
      "doi": ""
    },
    {
      "text": "Tobii. 2022. Tobii Unity SDK for Desktop provides the ability to implement eye-tracking features in Unity applications. Retrieved December 10, 2022 from developer.tobii.com/pc-gaming/unity-sdk/",
      "doi": ""
    },
    {
      "text": "Unity. 2022. Unity is a cross-platform game engine developed by Unity Technologies, first announced and released in June 2005. Retrieved December 10, 2022 from http://unity.com/",
      "doi": ""
    },
    {
      "text": "Zacharias Vamvakousis and Rafael Ramirez. 2016. The EyeHarp: A Gaze-Controlled Digital Musical Instrument. Frontiers in Psychology 7 (2016), 906–906. https://doi.org/10.3389/fpsyg.2016.00906",
      "doi": ""
    },
    {
      "text": "Xiaoyi Zhang, Harish Kulkarni, and Meredith Ringel Morris. 2017. Smartphone-Based Gaze Gesture Communication for People with Motor Disabilities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2878–2889. https://doi.org/10.1145/3025453.3025790",
      "doi": "10.1145/3025453.3025790"
    }
  ]
}