{
  "doi": "10.1145/3544548.3581032",
  "title": "Understanding how technology can support social-emotional learning of children: a dyadic trauma-informed participatory design with proxies",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Trauma-informed design is an important yet challenging area due to required expertise for careful engagement with the vulnerable and traumatized person, particularly with children. While technologies have the potential to generate value for the person with experience of trauma, the risk of exposing them to additional trauma due to research and design has ethical implications. We explore this space by engaging with therapists and social workers as dyads of proxies for parents and children with a history of trauma. We conducted a study as a participatory workshop with proxies to understand how technology could support parents in coaching social-emotional learning during episodes of high intensity emotion and difficult behavior by the child. Our findings identified design qualities to embed in SEL technology, and three roles that parents can play in implementing SEL strategies at home. We contribute a set of seven methodological guidelines for dyadic trauma-informed participatory design with proxies.",
  "tags": [
    "participatory design",
    "trauma-informed design",
    "mental health",
    "proxy",
    "therapist",
    "pre-reflection",
    "social emotional learning",
    "children"
  ],
  "authors": [
    {
      "name": "Naseem Ahmadpour",
      "institution": "Affective Interactions lab, Sydney School of Architecture, Design and Planning, The University of Sydney, Australia",
      "img": "/do/10.1145/contrib-99658772453/rel-imgonly/307a8586.jpg",
      "acmid": "99658772453",
      "orcid": "0000-0003-1818-1930"
    },
    {
      "name": "Lian Loke",
      "institution": "Design lab, Sydney School of Architecture, Design and Planning, The University of Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309499718",
      "orcid": "0000-0001-7174-8209"
    },
    {
      "name": "Carl Gray",
      "institution": "Nepean Blue Mountains Local Health District, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701396",
      "orcid": "0000-0002-9628-6650"
    },
    {
      "name": "Yidan Cao",
      "institution": "Affective Interactions lab, Sydney School of Architecture, Design and Planning, The University of Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660007035",
      "orcid": "0000-0003-3374-3524"
    },
    {
      "name": "Chloe Macdonald",
      "institution": "Western Sydney Local Health District, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778391",
      "orcid": "0000-0002-1843-2309"
    },
    {
      "name": "Rebecca Hart",
      "institution": "Wstern Sydney Local Health District, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779217",
      "orcid": "0000-0002-5629-2909"
    }
  ],
  "references": [
    {
      "text": "Elizabeth A. Ankrah, Arpita Bhattacharya, Lissamarie Donjuan, Franceli L. Cibrian, Lilibeth Torno, Anamara Ritt Olson, Joel Milam, and Gillian Hayes. 2022. When Worlds Collide: Boundary Management of Adolescent and Young Adult Childhood Cancer Survivors and Caregivers. In CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": ""
    },
    {
      "text": "Naseem Ahmadpour, Andrew David Weatherall, Minal Menezes, Soojeong Yoo, Hanyang Hong, Gail Wong, 2020. Synthesizing multiple stakeholder perspectives on using virtual reality to improve the periprocedural experience in children and adolescents: survey study. Journal of Medical Internet Research 22, 7 (2020), e19752.",
      "doi": ""
    },
    {
      "text": "Cathy Kezelman AM, Nick Hossack, Pam Stavropoulos, and Pip Burley. 2015. The cost of unresolved childhood trauma and abuse in adults in Australia. Technical Report. Technical Report. Adults Surviving Child Abuse (ASCA).",
      "doi": ""
    },
    {
      "text": "Karen Anne Cochrane, Kristina Mah, Anna Ståhl, Claudia Núñez-Pacheco, Madeline Balaam, Naseem Ahmadpour, and Lian Loke. 2022. Body Maps: A Generative Tool for Soma-based Design. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction. 1–14.",
      "doi": "10.1145/3490149.3502262"
    },
    {
      "text": "David V Baldwin. 2013. Primitive mechanisms of trauma response: An evolutionary perspective on trauma-related disorders. Neuroscience & Biobehavioral Reviews 37, 8 (2013), 1549–1566.",
      "doi": ""
    },
    {
      "text": "Amy Elizabeth Ballin. 2022. Connecting Trauma-Sensitive Schooling and Social–Emotional Learning to Promote Educational Equity: One School’s Intentional Design. Children & Schools 44, 2 (2022), 107–115.",
      "doi": ""
    },
    {
      "text": "Lisa Feldman Barrett. 2006. Are emotions natural kinds?Perspectives on psychological science 1, 1 (2006), 28–58.",
      "doi": ""
    },
    {
      "text": "Howard Bath. 2008. The three pillars of trauma-informed care. Reclaiming children and youth 17, 3 (2008), 17–21.",
      "doi": ""
    },
    {
      "text": "Karen L Bierman, John D Coie, Kenneth A Dodge, Mark T Greenberg, John E Lochman, Robert J McMahon, and Ellen Pinderhughes. 2010. The effects of a multiyear universal social–emotional learning program: The role of student and school characteristics.Journal of consulting and clinical psychology 78, 2(2010), 156.",
      "doi": ""
    },
    {
      "text": "Christina Bollo and Amanda Donofrio. 2021. Trauma-informed design for permanent supportive housing: four case studies from Seattle and Denver. Housing and Society (2021), 1–22.",
      "doi": ""
    },
    {
      "text": "Jordan L Boyd-Graber, Sonya S Nikolova, Karyn A Moffatt, Kenrick C Kin, Joshua Y Lee, Lester W Mackey, Marilyn M Tremaine, and Maria M Klawe. 2006. Participatory design with proxies: developing a desktop-PDA system to support people with aphasia. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 151–160.",
      "doi": "10.1145/1124772.1124797"
    },
    {
      "text": "Ingrid Burkett. 2012. An introduction to co-design. Sydney: Knode (2012), 12.",
      "doi": ""
    },
    {
      "text": "Lisa D Butler, Filomena M Critelli, and Elaine S Rinfrette. 2011. Trauma-informed care and mental health. Directions in Psychiatry 31, 3 (2011), 197–212.",
      "doi": ""
    },
    {
      "text": "Rebecca Campbell, McKenzie Javorka, MacKenzie Hetfield, Katie Gregory, Lauren Vollinger, and Wenjuan Ma. 2022. Developing trauma-informed research methods: using proxy respondents to assess sexual assault survivors’ experiences seeking medical forensic exams. Violence and victims 36, 6 (2022), 793–807.",
      "doi": ""
    },
    {
      "text": "Julie Canfield. 2005. Secondary traumatization, burnout, and vicarious traumatization: A review of the literature as it relates to therapists who treat trauma. Smith College Studies in Social Work 75, 2 (2005), 81–101.",
      "doi": ""
    },
    {
      "text": "Janet X Chen, Allison McDonald, Yixin Zou, Emily Tseng, Kevin A Roundy, Acar Tamersoy, Florian Schaub, Thomas Ristenpart, and Nicola Dell. 2022. Trauma-Informed Computing: Towards Safer Technology Experiences for All. In CHI Conference on Human Factors in Computing Systems. 1–20.",
      "doi": ""
    },
    {
      "text": "Victoria Clarke and Virginia Braun. 2021. Thematic analysis: a practical guide. Thematic Analysis (2021), 1–100.",
      "doi": ""
    },
    {
      "text": "Stephanie S Covington. 2008. Women and addiction: A trauma-informed approach. Journal of psychoactive drugs 40, sup5 (2008), 377–385.",
      "doi": ""
    },
    {
      "text": "Kristen M Cuevas, Jane Balbo, Krista Duval, and Elizabeth A Beverly. 2018. Neurobiology of sexual assault and osteopathic considerations for trauma-informed care and practice. Journal of Osteopathic Medicine 118, 2 (2018), e2–e10.",
      "doi": ""
    },
    {
      "text": "Jiamin Dai and Karyn Moffatt. 2021. Surfacing the voices of people with dementia: Strategies for effective inclusion of proxy stakeholders in qualitative research. In Proceedings of the 2021 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3411764.3445756"
    },
    {
      "text": "Claudia Daudén Roquet, Nikki Theofanopoulou, Jaimie L Freeman, Jessica Schleider, James J Gross, Katie Davis, Ellen Townsend, and Petr Slovak. 2022. Exploring Situated & Embodied Support for Youth’s Mental Health: Design Opportunities for Interactive Tangible Device. In CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": ""
    },
    {
      "text": "Ann P Daunic, Nancy L Corbett, Stephen W Smith, James Algina, Daniel Poling, Megan Worth, Delaney Boss, Emily Crews, and Jessica Vezzoli. 2021. Efficacy of the social-emotional learning foundations curriculum for kindergarten and first grade students at risk for emotional and behavioral disorders. Journal of School Psychology 86 (2021), 78–99.",
      "doi": ""
    },
    {
      "text": "Rachael Dietkus. 2022. The Call for Trauma-Informed Design Research and Practice. Design Management Review 33, 2 (2022), 26–31.",
      "doi": ""
    },
    {
      "text": "James Duffee, Moira Szilagyi, Heather Forkey, and Erin T Kelly. 2021. Trauma-informed care in child health systems. Pediatrics (2021).",
      "doi": ""
    },
    {
      "text": "Joseph A Durlak, Allison B Dymnicki, Rebecca D Taylor, Roger P Weissberg, Kriston B Schellinger, David Dubois, Mark Lipsey, Mark Greenberg, and Mary Utne O’brien. 2007. Collaborative for Academic, Social, and Emotional Learning (CASEL). (2007).",
      "doi": ""
    },
    {
      "text": "Joseph A. Durlak, Roger P. Weissberg, Allison B. Dymnicki, Rebecca D. Taylor, and Kriston B. Schellinger. 2011. The Impact of Enhancing Students’ Social and Emotional Learning: A Meta-Analysis of School-Based Universal Interventions. Child Development 82, 1 (1 2011), 405–432. https://doi.org/10.1111/j.1467-8624.2010.01564.x",
      "doi": ""
    },
    {
      "text": "Heather Dye. 2018. The impact and long-term effects of childhood trauma. Journal of Human Behavior in the Social Environment 28, 3(2018), 381–392.",
      "doi": ""
    },
    {
      "text": "Maurice J. Elias, Joseph E. Zins, Roger P. Weissberg, Karin S. Frey, Mark T. Greenberg, Norris M. Haynes, Rachael Kessler, Mary E. Schwab-Stone, and Timothy P. Shriver. 1997. The Need for Social and Emotional Learning: Guidelines for Educators. Association for Supervision and Curriculum Development.",
      "doi": ""
    },
    {
      "text": "Dorothy L Espelage, Chad A Rose, and Joshua R Polanin. 2015. Social-emotional learning program to reduce bullying, fighting, and victimization among middle school students with disabilities. Remedial and special education 36, 5 (2015), 299–311.",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. “A Stalker’s Paradise” How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Yue Fu, Rebecca Michelson, Yifan Lin, Lynn K. Nguyen, Tala June Tayebi, and Alexis Hiniker. 2022. Social Emotional Learning with Conversational Agents: Reviewing Current Designs and Probing Parents’ Ideas for Future Ones. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6, 2, Article 52 (jul 2022), 23 pages. https://doi.org/10.1145/3534622",
      "doi": "10.1145/3534622"
    },
    {
      "text": "Isser Troy Mangin Gagan, Maria Angela Mikaela Eusebio Matias, Ivy Tan, Christianne Marie Vinco, Ethel Ong, and Ron Resurreccion. 2022. Designing A Virtual Talking Companion to Support the Social-Emotional Learning of Children with ASD. In Interaction Design and Children (Braga, Portugal) (IDC ’22). Association for Computing Machinery, New York, NY, USA, 464–471. https://doi.org/10.1145/3501712.3535287",
      "doi": "10.1145/3501712.3535287"
    },
    {
      "text": "Shari M. Geller and Stephen W. Porges. 2014. Therapeutic presence: Neurophysiological mechanisms mediating feeling safe in therapeutic relationships. Journal of Psychotherapy Integration 24, 3 (2014), 178–192. https://doi.org/10.1037/a0037511",
      "doi": ""
    },
    {
      "text": "Madeleine J George, Michael A Russell, Joy R Piontak, and Candice L Odgers. 2018. Concurrent and subsequent associations between daily digital technology use and high-risk adolescents’ mental health symptoms. Child development 89, 1 (2018), 78–88.",
      "doi": ""
    },
    {
      "text": "Naska Goagoses, Heike Winschiers-Theophilus, and Michael Bosomefi Chamunorwa. 2020. The (potential) role of technology for Young children’s social-emotional learning: During and beyond the COVID-19 pandemic. Digital Government: Research and Practice 2, 1 (2020), 1–6.",
      "doi": "10.1145/3429986"
    },
    {
      "text": "Anna Goddard. 2021. Adverse childhood experiences and trauma-informed care. Journal of Pediatric Health Care 35, 2 (2021), 145–155.",
      "doi": ""
    },
    {
      "text": "Daniel Goleman. 1998. Working with emotional intelligence. Bantam.",
      "doi": ""
    },
    {
      "text": "Gail S Goodman, Jodi A Quas, Deborah Goldfarb, Lauren Gonzalves, and Alejandra Gonzalez. 2019. Trauma and long-term memory for childhood events: Impact matters. Child Development Perspectives 13, 1 (2019), 3–9.",
      "doi": ""
    },
    {
      "text": "John M Gottman, Lynn Fainsilber Katz, and Carole Hooven. 1996. Parental meta-emotion philosophy and the emotional life of families: Theoretical models and preliminary data.Journal of Family Psychology 10, 3 (1996), 243.",
      "doi": ""
    },
    {
      "text": "Phillip Gough, A. Baki Kocaballi, Khushnood Z. Naqshbandi, Karen Cochrane, Kristina Mah, Ajit G. Pillai, Yeliz Yorulmaz, Ainnoun Kornita Deny, and Naseem Ahmadpour. 2022. Co-Designing a Technology Probe with Experienced Designers. In Proceedings of the 33rd Australian Conference on Human-Computer Interaction (Melbourne, VIC, Australia) (OzCHI ’21). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3520495.3520513",
      "doi": "10.1145/3520495.3520513"
    },
    {
      "text": "Foad Hamidi, Melanie Baljko, and Isabel Gómez. 2017. Using participatory design with proxies with children with limited communication. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 250–259.",
      "doi": "10.1145/3132525.3132527"
    },
    {
      "text": "Rochelle F Hanson and Jason Lang. 2016. A critical look at trauma-informed care among agencies and systems serving maltreated youth and their families. Child maltreatment 21, 2 (2016), 95–100.",
      "doi": ""
    },
    {
      "text": "Maxine Ed Harris and Roger D Fallot. 2001. Using trauma theory to design service systems.Jossey-Bass/Wiley.",
      "doi": ""
    },
    {
      "text": "Sen H Hirano, Michael T Yeganyan, Gabriela Marcu, David H Nguyen, Lou Anne Boyd, and Gillian R Hayes. 2010. vSked: evaluation of a system to support classroom activities for children with autism. In Proceedings of the SIGCHI conference on human factors in computing systems. 1633–1642.",
      "doi": "10.1145/1753326.1753569"
    },
    {
      "text": "Larke N Huang, Rebecca Flatow, Tenly Biggs, Sara Afayee, Kelley Smith, Thomas Clark, and Mary Blake. 2014. SAMHSA’s Concept of Truama and Guidance for a Trauma-Informed Approach. (2014).",
      "doi": ""
    },
    {
      "text": "Sophie Isobel, Allyson Wilson, Katherine Gill, and Deborah Howe. 2021. ‘What would a trauma-informed mental health service look like?’Perspectives of people who access services. International Journal of Mental Health Nursing 30, 2 (2021), 495–505.",
      "doi": ""
    },
    {
      "text": "Jade Jiang and Naseem Ahmadpour. 2022. Beyond Immersion: Designing for Reflection in Virtual Reality. In Proceedings of the 33rd Australian Conference on Human-Computer Interaction (Melbourne, VIC, Australia) (OzCHI ’21). Association for Computing Machinery, New York, NY, USA, 208–220. https://doi.org/10.1145/3520495.3520501",
      "doi": "10.1145/3520495.3520501"
    },
    {
      "text": "Thomas Keenan, Subhadra Evans, and Kevin Crowley. 2016. An introduction to child development. Sage.",
      "doi": ""
    },
    {
      "text": "Ibrahim Kira, Linda Lewandowski, Cheryl L Somers, Jina S Yoon, and Lisa Chiodo. 2012. The effects of trauma types, cumulative trauma, and PTSD on IQ in two highly traumatized adolescent groups.Psychological Trauma: Theory, Research, Practice, and Policy 4, 1(2012), 128.",
      "doi": ""
    },
    {
      "text": "Dak Kopec and J Davis Harte. 2020. Design as the missing variable in trauma-informed schools.(2020).",
      "doi": ""
    },
    {
      "text": "Dana Kralicek, Swati Shelar, Lisa von Rabenau, and Paulo Blikstein. 2018. Inside out: teaching empathy and social-emotional skills. In Proceedings of the 17th ACM Conference on Interaction Design and Children. 525–528.",
      "doi": "10.1145/3202185.3213525"
    },
    {
      "text": "Sarah Kuhn and Michael J Muller. 1993. Participatory design. Commun. ACM 36, 6 (1993), 24–29.",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Molly Stewart Lawlor. 2016. Mindfulness and social emotional learning (SEL): A conceptual framework. In Handbook of mindfulness in education. Springer, 65–80.",
      "doi": ""
    },
    {
      "text": "Lian Loke, Aaron Blishen, Carl Gray, and Naseem Ahmadpour. 2021. Safety, Connection and Reflection: Designing with Therapists for Children with Serious Emotional Behaviour Issues. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 162, 17 pages. https://doi.org/10.1145/3411764.3445178",
      "doi": "10.1145/3411764.3445178"
    },
    {
      "text": "Julia Makhaeva, Christopher Frauenberger, and Katta Spiel. 2016. Creating creative spaces for co-designing with autistic children: the concept of a\" Handlungsspielraum\". In Proceedings of the 14th Participatory Design Conference: Full papers-Volume 1. 51–60.",
      "doi": "10.1145/2940299.2940306"
    },
    {
      "text": "Emanuela Mazzone, Janet C Read, and Russell Beale. 2011. Towards a framework of co-design sessions with children. In IFIP conference on human-computer interaction. Springer, 632–635.",
      "doi": ""
    },
    {
      "text": "Michael J Muller and Allison Druin. 2012. Participatory design: The third space in human–computer interaction. In The Human–Computer Interaction Handbook. CRC Press, 1125–1153.",
      "doi": ""
    },
    {
      "text": "Coral Muskett. 2014. Trauma-informed care in inpatient mental health settings: A review of the literature. International journal of mental health nursing 23, 1 (2014), 51–59.",
      "doi": ""
    },
    {
      "text": "Gill Neha. 2019. The Importance Of Trauma-Informed Design. https://www.forbes.com/sites/forbesnonprofitcouncil/2019/12/09/the-importance-of-trauma-informed-design/?sh=59062e066785",
      "doi": ""
    },
    {
      "text": "Lorene M Nelson, WT Longstreth Jr, Thomas D Koepsell, and Gerald Van Belle. 1990. Proxy respondents in epidemiologic research. Epidemiologic Reviews 12, 1 (1990), 71–86.",
      "doi": ""
    },
    {
      "text": "Yuval Neria, Evelyn J Bromet, Sylvia Sievers, Janet Lavelle, and Laura J Fochtmann. 2002. Trauma exposure and posttraumatic stress disorder in psychosis: findings from a first-admission cohort.Journal of consulting and Clinical Psychology 70, 1(2002), 246.",
      "doi": ""
    },
    {
      "text": "Madeline Petrillo. 2021. Creating safe spaces: trauma-informed design. (2021).",
      "doi": ""
    },
    {
      "text": "A Treatment Improvement Protocol. 2014. Trauma-informed care in behavioral health services. Rockville, USA: Substance Abuse and Mental Health Services Administration (2014).",
      "doi": ""
    },
    {
      "text": "Adithyan Rajaraman, Jennifer L Austin, Holly C Gover, Anthony P Cammilleri, David R Donnelly, and Gregory P Hanley. 2022. Toward trauma-informed applications of behavior analysis. Journal of Applied Behavior Analysis 55, 1 (2022), 40–61.",
      "doi": ""
    },
    {
      "text": "Elizabeth Reeves. 2015. A synthesis of the literature on trauma-informed care. Issues in mental health nursing 36, 9 (2015), 698–709.",
      "doi": ""
    },
    {
      "text": "Linda Rosenberg. 2011. Addressing trauma in mental health and substance use treatment. The journal of behavioral health services & research 38, 4 (2011), 428–431.",
      "doi": ""
    },
    {
      "text": "Mamta Roy and Regina Giraldo-García. 2018. The Role of Parental Involvement and Social/Emotional Skills in Academic Achievement: Global Perspectives.School Community Journal 28, 2 (2018), 29–46.",
      "doi": ""
    },
    {
      "text": "Ria Roy. 2021. Need of the hour: inculcating trauma-informed design principles for our workers, work, workplace, and the world. Performance improvement 60, 3 (2021), 27–29. https://doi.org/10.1002/pfi.21962",
      "doi": ""
    },
    {
      "text": "Coleen Sallot. 2021. Utilizing Virtual Play to Help Adopted Children with Trauma. In Extended Abstracts of the 2021 Annual Symposium on Computer-Human Interaction in Play. 49–54.",
      "doi": "10.1145/3450337.3483471"
    },
    {
      "text": "EB-N Sanders. 2000. Generative tools for co-designing. In Collaborative design. Springer, 3–12.",
      "doi": ""
    },
    {
      "text": "Klaus R Scherer. 2005. What are emotions? And how can they be measured?Social science information 44, 4 (2005), 695–729.",
      "doi": ""
    },
    {
      "text": "Allison Schimmel-Bristow and Kym R Ahrens. 2018. Technology use among special populations. Technology and adolescent mental health(2018), 43–57.",
      "doi": ""
    },
    {
      "text": "Adriano Schimmenti. 2018. The trauma factor: Examining the relationships among different types of trauma, dissociation, and psychopathology. Journal of Trauma & Dissociation 19, 5 (2018), 552–571.",
      "doi": ""
    },
    {
      "text": "Jeffrey C Schneider, Nhi-Ha T Trinh, Elizabeth Selleck, Felipe Fregni, Sara S Salles, Colleen M Ryan, and Joel Stein. 2012. The long-term impact of physical and emotional trauma: the station nightclub fire. (2012).",
      "doi": ""
    },
    {
      "text": "KL Shaw, TR Southwood, and JE McDonagh. 2006. Growing up and moving on in rheumatology: parents as proxies of adolescents with juvenile idiopathic arthritis. Arthritis Care & Research: Official Journal of the American College of Rheumatology 55, 2 (2006), 189–198.",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Kael Rowan, Christopher Frauenberger, Ran Gilad-Bachrach, Mia Doces, Brian Smith, Rachel Kamb, and Geraldine Fitzpatrick. 2016. Scaffolding the scaffolding: supporting children’s social-emotional learning at home. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 1751–1765.",
      "doi": "10.1145/2818048.2820007"
    },
    {
      "text": "Abigale Stangl, Joanna Weidler-Lewis, Carlye Lauff, Emily Price, and Eric Fauble. 2017. The SEL transition wheel: Designing for early childhood social emotional learning. In Proceedings of the 2017 Conference on Interaction Design and Children. 334–339.",
      "doi": "10.1145/3078072.3079746"
    },
    {
      "text": "Siew Tzuh Tang and Ruth McCorkle. 2002. Use of family proxies in quality of life research for cancer patients at the end of life: a literature review. Cancer investigation 20, 7-8 (2002), 1086–1104.",
      "doi": ""
    },
    {
      "text": "Nikki Theofanopoulou and Petr Slovak. 2022. Exploring Technology-Mediated Parental Socialisation of Emotion: Leveraging an Embodied, In-situ Intervention for Child Emotion Regulation. In CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": ""
    },
    {
      "text": "Martin Tomitsch, Cara Wrigley, Madeleine Borthwick, Naseem Ahmadpour, Jessica Frawley, A Baki Kocaballi, Claudia Núnez-Pacheco, and Karla Straker. 2018. Design. think. make. break. repeat. A handbook of methods. Bis Publishers.",
      "doi": ""
    },
    {
      "text": "Cameron Tonkinwise. 2004. Ethics by design, or the ethos of things. Design philosophy papers 2, 2 (2004), 129–144.",
      "doi": ""
    },
    {
      "text": "Joan C Tronto. 1998. An ethic of care. Generations: Journal of the American Society on Aging 22, 3 (1998), 15–20.",
      "doi": ""
    },
    {
      "text": "Bessel A Van der Kolk. 1994. The body keeps the score: Memory and the evolving psychobiology of posttraumatic stress. Harvard review of psychiatry 1, 5 (1994), 253–265.",
      "doi": ""
    },
    {
      "text": "Education Victoria State Government and Training. [n.d.]. Promote mental health: social and emotional learning. https://www.education.vic.gov.au/school/teachers/health/mentalhealth/Pages/socialemotion.aspx#link54",
      "doi": ""
    },
    {
      "text": "Carolyn Webster-Stratton and M Jamila Reid. 2004. Strengthening social and emotional competence in young children—The foundation for early school readiness and success: Incredible years classroom social skills and problem-solving curriculum. Infants & Young Children 17, 2 (2004), 96–113.",
      "doi": ""
    },
    {
      "text": "Stephanie Wilson, Abi Roper, Jane Marshall, Julia Galliers, Niamh Devane, Tracey Booth, and Celia Woolf. 2015. Codesign for people with aphasia through tangible design languages. CoDesign 11, 1 (2015), 21–34.",
      "doi": ""
    },
    {
      "text": "Western Sydney Local Health District WSLHD. 2018. Child and Family Unit (CFU) (4-12 years),.",
      "doi": ""
    },
    {
      "text": "Victor Yalom and Marie-Helene Yalom. [n.d.]. Peter Levine on Somatic Experiencing. https://www.psychotherapy.net/interview/interview-peter-levine",
      "doi": ""
    },
    {
      "text": "Anastasia E Yasik, Philip A Saigh, Richard A Oberfield, and Phill V Halamandaris. 2007. Posttraumatic stress disorder: memory and learning performance in children and adolescents. Biological psychiatry 61, 3 (2007), 382–388.",
      "doi": ""
    },
    {
      "text": "Soojeong Yoo, Andrew Weatherall, Gail Wong, Sarah Scott, Minal Menezes, Nicholas Wood, Ajit Pillai, and Naseem Ahmadpour. 2019. Clinician Perspective on VR Games for Managing Periprocedural Anxiety in Children. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction. 280–284.",
      "doi": "10.1145/3369457.3369522"
    }
  ]
}