{
  "doi": "10.1145/3544548.3581428",
  "title": "MapUncover: Fostering Spatial Exploration through Gamification in Mobile Map Apps",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Getting from A to B has never been easier. Mobile navigation systems allow universal access to spatial information. However, following detailed route instructions leads to a decrease in spatial exploration behaviour and therefore a reduction of spatial knowledge acquisition. Facilitating spatial exploration has the potential to counteract this negative effect. This paper investigates how we can support people in re-discovering their surroundings. We designed and evaluated a mobile application to promote spatial exploration through gamification. The app requires active exploration behaviour to uncover a map. Gamification elements such as quests, statistics, and social competition are used to encourage exploration. We conducted an exploratory field study (n = 22). Our results show a significant increase in familiarity with the environment and a variety of exploration patterns. Based on our findings, we propose modifications to current mapping applications by limiting the visible cartographic elements and alternating routes to improve spatial knowledge acquisition.",
  "authors": [
    {
      "name": "Eve Schade",
      "institution": "University of St. Gallen, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659584203",
      "orcid": "0000-0002-0786-6662"
    },
    {
      "name": "Gian-Luca Savino",
      "institution": "University of St. Gallen, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474165",
      "orcid": "0000-0002-1233-234X"
    },
    {
      "name": "Jasmin Niess",
      "institution": "University of St. Gallen, Switzerland and University of Oslo, Norway",
      "img": "/do/10.1145/contrib-99659260376/rel-imgonly/niessj.jpg",
      "acmid": "99659260376",
      "orcid": "0000-0003-3529-0653"
    },
    {
      "name": "Johannes Schöning",
      "institution": "University of St. Gallen, Switzerland",
      "img": "/do/10.1145/contrib-81508685058/rel-imgonly/20160404_5404_dsc_6947_small.jpg",
      "acmid": "81508685058",
      "orcid": "0000-0002-8823-4607"
    }
  ],
  "references": [
    {
      "text": "Louise Barkhuus and Donghee Yvette Wohn. 2019. Making the city my own: uses and practices of mobile location technologies for exploration of a new city. Personal and Ubiquitous Computing 23, 2 (April 2019), 269–278. https://doi.org/10.1007/s00779-018-01191-z",
      "doi": "10.1007/s00779-018-01191-z"
    },
    {
      "text": "Mona Bartling, Bernd Resch, Tumasch Reichenbacher, Clemens Rudolf Havas, Anthony C. Robinson, Sara Irina Fabrikant, and Thomas Blaschke. 2022. Adapting mobile map application designs to map use context: a review and call for action on potential future research themes. Cartography and Geographic Information Science 49, 3 (May 2022), 237–251. https://doi.org/10.1080/15230406.2021.2015720",
      "doi": ""
    },
    {
      "text": "Hochul Cho, Hyunsoo Park, Chang-Yeun Kim, and Kyung-Joong Kim. 2016. Investigation of the Effect of “Fog of War” in the Prediction of StarCraft Strategy Using Machine Learning. Computers in Entertainment 14, 1 (Dec. 2016), 2:1–2:16. https://doi.org/10.1145/2735384",
      "doi": "10.1145/2735384"
    },
    {
      "text": "Ashley Colley, Jacob Thebault-Spieker, Allen Yilun Lin, Donald Degraen, Benjamin Fischman, Jonna Häkkilä, Kate Kuehl, Valentina Nisi, Nuno Jardim Nunes, Nina Wenig, Dirk Wenig, Brent Hecht, and Johannes Schöning. 2017. The Geography of PokéMon GO: Beneficial and Problematic Effects on Places and Movement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1179–1192. https://doi.org/10.1145/3025453.3025495",
      "doi": "10.1145/3025453.3025495"
    },
    {
      "text": "Paul Coulton, Jonny Huck, Adrian Gradinar, and Lara Salinas. 2017. Mapping the Beach Beneath the Street: Digital Cartography for the Playable City. Springer Singapore, Singapore, 137–162. https://doi.org/10.1007/978-981-10-1962-3_7",
      "doi": ""
    },
    {
      "text": "Dan Cvrcek, Marek Kumpost, Vashek Matyas, and George Danezis. 2006. A study on the value of location privacy. In Proceedings of the 5th ACM workshop on Privacy in electronic society(WPES ’06). Association for Computing Machinery, New York, NY, USA, 109–118. https://doi.org/10.1145/1179601.1179621",
      "doi": "10.1145/1179601.1179621"
    },
    {
      "text": "Sebastian Deterding. 2012. Gamification: designing for motivation. Interactions 19, 4 (July 2012), 14–17. https://doi.org/10.1145/2212877.2212883",
      "doi": "10.1145/2212877.2212883"
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From Game Design Elements to Gamefulness: Defining \"Gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (Tampere, Finland) (MindTrek ’11). Association for Computing Machinery, New York, NY, USA, 9–15. https://doi.org/10.1145/2181037.2181040",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "European Union Agency for Fundamental Rights. 2022. Consent to use data on children. https://fra.europa.eu/en/publication/2017/mapping-minimum-age-requirements-concerning-rights-child-eu/consent-use-data-children",
      "doi": ""
    },
    {
      "text": "Sebastian Stefan Feger, Paweł W. Woźniak, Jasmin Niess, and Albrecht Schmidt. 2021. Tailored Science Badges: Enabling New Forms of Research Interaction. In Designing Interactive Systems Conference 2021 (Virtual Event, USA) (DIS ’21). Association for Computing Machinery, New York, NY, USA, 576–588. https://doi.org/10.1145/3461778.3462067",
      "doi": "10.1145/3461778.3462067"
    },
    {
      "text": "Kyle T. Gagnon, Brandon J. Thomas, Ascher Munion, Sarah H. Creem-Regehr, Elizabeth A. Cashdan, and Jeanine K. Stefanucci. 2018. Not all those who wander are lost: Spatial exploration patterns and their relationship to gender and spatial memory. Cognition 180 (Nov. 2018), 108–117. https://doi.org/10.1016/j.cognition.2018.06.020",
      "doi": ""
    },
    {
      "text": "Reginald G. Golledge. 1995. Path selection and route preference in human navigation: A progress report. In Spatial Information Theory A Theoretical Basis for GIS(Lecture Notes in Computer Science). Springer, Berlin, Heidelberg, 207–222. https://doi.org/10.1007/3-540-60392-1_14",
      "doi": ""
    },
    {
      "text": "Zhan Guo and Becky P.Y. Loo. 2013. Pedestrian environment and route choice: evidence from New York City and Hong Kong. Journal of Transport Geography 28 (2013), 124–136. https://doi.org/10.1016/j.jtrangeo.2012.11.013",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in Psychology, Peter A. Hancock and Najmedin Meshkati (Eds.). Human Mental Workload, Vol. 52. North-Holland, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Chuanxiuyue He and Mary Hegarty. 2020. How anxiety and growth mindset are linked to navigation ability: Impacts of exploration and GPS use. Journal of Environmental Psychology 71 (Oct. 2020), 101475. https://doi.org/10.1016/j.jenvp.2020.101475 13 citations (Crossref) [2022-09-09].",
      "doi": ""
    },
    {
      "text": "Mary Hegarty, Anthony E Richardson, Daniel R Montello, Kristin Lovelace, and Ilavanil Subbiah. 2002. Development of a self-report measure of environmental spatial ability. Intelligence 30, 5 (2002), 425–447. https://doi.org/10.1016/S0160-2896(02)00116-2",
      "doi": ""
    },
    {
      "text": "J.J. Huck, A. Gradinar, P. Coulton, and L. Salinas. 2016. Paths of Desire: Dynamic Visual Hierarchies to Intentionally Influence Route Decision. In Proceedings of the 24th Annual GIS Research UK Conference. GIS Research UK ; Conference date: 30-03-2016 Through 01-04-2016.",
      "doi": ""
    },
    {
      "text": "María-Blanca Ibáñez, Ángela Di-Serio, and Carlos Delgado-Kloos. 2014. Gamification for Engaging Computer Science Students in Learning Activities: A Case Study. IEEE Transactions on Learning Technologies 7, 3 (July 2014), 291–301. https://doi.org/10.1109/TLT.2014.2329293 Conference Name: IEEE Transactions on Learning Technologies.",
      "doi": ""
    },
    {
      "text": "Iris A Junglas, Norman A Johnson, and Christiane Spitzmüller. 2008. Personality traits and concern for privacy: an empirical study in the context of location-based services. European Journal of Information Systems 17, 4 (Aug. 2008), 387–402. https://doi.org/10.1057/ejis.2008.29",
      "doi": ""
    },
    {
      "text": "Ippokratis Kapenekakis and Konstantinos Chorianopoulos. 2017. Citizen Science for Pedestrian Cartography: Collection and Moderation of Walkable Routes in Cities through Mobile Gamification. Hum.-Centric Comput. Inf. Sci. 7, 1, Article 90 (Dec. 2017), 23 pages. https://doi.org/10.1186/s13673-017-0090-9",
      "doi": "10.1186/s13673-017-0090-9"
    },
    {
      "text": "Raman Kazhamiakin, Annapaola Marconi, Alberto Martinelli, Marco Pistore, and Giuseppe Valetto. 2016. A gamification framework for the long-term engagement of smart citizens. In 2016 IEEE International Smart Cities Conference (ISC2). 1–7. https://doi.org/10.1109/ISC2.2016.7580746",
      "doi": ""
    },
    {
      "text": "Pascal Lessel, Maximilian Altmeyer, and Antonio Krüger. 2018. Users As Game Designers: Analyzing Gamification Concepts in a \"Bottom-Up\" Setting. In Proceedings of the 22nd International Academic Mindtrek Conference (Tampere, Finland) (Mindtrek ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3275116.3275118",
      "doi": "10.1145/3275116.3275118"
    },
    {
      "text": "MapTiler AG. 2022. maptiler. https://www.maptiler.com/",
      "doi": ""
    },
    {
      "text": "maputnik. 2017. Maputnik Editor. https://github.com/maputnik/editor.",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler, Florian Brühlmann, Alexandre N. Tuch, and Klaus Opwis. 2017. Towards understanding the effects of individual gamification elements on intrinsic motivation and performance. Computers in Human Behavior 71 (June 2017), 525–534. https://doi.org/10.1016/j.chb.2015.08.048",
      "doi": "10.1016/j.chb.2015.08.048"
    },
    {
      "text": "Jennie Middleton. 2011. “I’m on Autopilot, I Just Follow the Route”: Exploring the Habits, Routines, and Decision-Making Practices of Everyday Urban Mobilities. Environment and Planning A: Economy and Space 43, 12 (2011), 2857–2877. https://doi.org/10.1068/a43600 arXiv:https://doi.org/10.1068/a43600",
      "doi": ""
    },
    {
      "text": "Fiona Fui-Hoon Nah, Venkata Rajasekhar Telaprolu, Shashank Rallapalli, and Pavani Rallapalli Venkata. 2013. Gamification of Education Using Computer Games. In Human Interface and the Management of Information. Information and Interaction for Learning, Culture, Collaboration and Business,, David Hutchison, Takeo Kanade, Josef Kittler, Jon M. Kleinberg, Friedemann Mattern, John C. Mitchell, Moni Naor, Oscar Nierstrasz, C. Pandu Rangan, Bernhard Steffen, Madhu Sudan, Demetri Terzopoulos, Doug Tygar, Moshe Y. Vardi, Gerhard Weikum, and Sakae Yamamoto (Eds.). Vol. 8018. Springer Berlin Heidelberg, Berlin, Heidelberg, 99–107. https://doi.org/10.1007/978-3-642-39226-9_12",
      "doi": "10.1007/978-3-642-39226-9_12"
    },
    {
      "text": "Niantic, Inc.2016. Pokémon GO. Niantic, Inc. https://pokemongolive.com/",
      "doi": ""
    },
    {
      "text": "Scott Nicholson. 2015. A RECIPE for Meaningful Gamification. In Gamification in Education and Business, Torsten Reiners and Lincoln C. Wood (Eds.). Springer International Publishing, Cham, 1–20. https://doi.org/10.1007/978-3-319-10208-5_1",
      "doi": ""
    },
    {
      "text": "OpenStreetMap contributors. 2017. OpenStreetMap Wiki and Maps. Planet dump retrieved from https://planet.osm.org. https://www.openstreetmap.org",
      "doi": ""
    },
    {
      "text": "Daniele Quercia, Rossano Schifanella, and Luca Maria Aiello. 2014. The Shortest Path to Happiness: Recommending Beautiful, Quiet, and Happy Routes in the City. In Proceedings of the 25th ACM Conference on Hypertext and Social Media (Santiago, Chile) (HT ’14). Association for Computing Machinery, New York, NY, USA, 116–125. https://doi.org/10.1145/2631775.2631799",
      "doi": "10.1145/2631775.2631799"
    },
    {
      "text": "Ian T. Ruginski, Sarah H. Creem-Regehr, Jeanine K. Stefanucci, and Elizabeth Cashdan. 2019. GPS use negatively affects environmental learning through spatial transformation abilities. Journal of Environmental Psychology 64 (Aug. 2019), 12–20. https://doi.org/10.1016/j.jenvp.2019.05.001",
      "doi": ""
    },
    {
      "text": "Angela Schwering, Jakub Krukar, Rui Li, Vanessa Joy Anacta, and Stefan Fuest. 2017. Wayfinding Through Orientation. Spatial Cognition & Computation 17, 4 (Oct. 2017), 273–303. https://doi.org/10.1080/13875868.2017.1322597 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/13875868.2017.1322597.",
      "doi": ""
    },
    {
      "text": "Helen Sharp, Yvonne Rogers, and Jennifer Preece. 2019 - 2019. Interaction design : beyond human-computer interaction (fifth edition. ed.). Wiley, Indianapolis.",
      "doi": ""
    },
    {
      "text": "Chen Si, Yusuf Pisan, and Chek Tien Tan. 2016. Understanding Players’ Map Exploration Styles. In Proceedings of the Australasian Computer Science Week Multiconference (Canberra, Australia) (ACSW ’16). Association for Computing Machinery, New York, NY, USA, Article 69, 6 pages. https://doi.org/10.1145/2843043.2843480",
      "doi": "10.1145/2843043.2843480"
    },
    {
      "text": "Tuomas Vaittinen and David McGookin. 2016. Phases of Urban Tourists’ Exploratory Navigation: A Field Study. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). Association for Computing Machinery, New York, NY, USA, 1111–1122. https://doi.org/10.1145/2901790.2901795",
      "doi": "10.1145/2901790.2901795"
    },
    {
      "text": "Tuomas Vaittinen and David McGookin. 2018. Uncover: Supporting City Exploration with Egocentric Visualizations of Location-Based Content. Personal and Ubiquitous Computing 22, 4 (Aug. 2018), 807–824. https://doi.org/10.1007/s00779-018-1167-9",
      "doi": ""
    },
    {
      "text": "Stephen A White. 2004. Introduction to BPMN. Ibm Cooperation 2, 0 (2004), 0.",
      "doi": ""
    },
    {
      "text": "Bruce W. A. Whittlesea. 1993. Illusions of familiarity.Journal of Experimental Psychology: Learning, Memory and Cognition 19 (1993), 1235–1253.",
      "doi": ""
    },
    {
      "text": "Yiyi Zhang and Tatsuo Nakajima. 2020. Gamified navigation system: enhancing resident user experience in city exploration. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers(UbiComp-ISWC ’20). Association for Computing Machinery, New York, NY, USA, 180–183. https://doi.org/10.1145/3410530.3414405",
      "doi": "10.1145/3410530.3414405"
    }
  ]
}