{
  "doi": "10.1145/3544548.3581181",
  "title": "Online Proctoring: Privacy Invasion or Study Alleviation?: Discovering Acceptability Using Contextual Integrity",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Detecting fraud during online exams using proctoring software comes with substantial privacy challenges. Previous work argues students experience heightened anxiety and have privacy concerns. However, little is known about which specific aspects of online proctoring cause these concerns. This study contributes such insights by using the Contextual Integrity (CI) framework to discover how students (N = 456) rate the acceptability of 1064 proctoring information flows with varying information types, recipients, and transmission principles. We find that the acceptability varies considerably depending on the context. Besides exposing obvious privacy violations, we find that, under certain conditions, students consider it acceptable to share data with teachers - despite their lack of involvement in proctoring. Also, the acceptability of sharing highly sensitive information - which should under no circumstances be shared - sometimes increases. We discuss the implications of these and other findings and provide concrete recommendations for educational institutions using online proctoring.",
  "tags": [
    "Privacy",
    "Acceptability",
    "Information flows",
    "Contextual integrity",
    "Online proctoring"
  ],
  "authors": [
    {
      "name": "Arnout Terpstra",
      "institution": "Tilburg Institute of Law, Technology & Society (TILT), Tilburg University, Netherlands and SURF, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654971",
      "orcid": "0000-0002-3904-8461"
    },
    {
      "name": "Alwin De Rooij",
      "institution": "Department of Communication and Cognition (DCC), Tilburg University, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460654796",
      "orcid": "0000-0002-9840-4892"
    },
    {
      "name": "Alexander Schouten",
      "institution": "Department of Communication and Cognition (DCC), Tilburg University, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81326492834",
      "orcid": "0000-0002-4717-0678"
    }
  ],
  "references": [
    {
      "text": "The University of Kansas. 2020. The Evolution of Distance Education in 2020. Retrieved 6 September 2022 from https://educationonline.ku.edu/community/distance-education-evolution-in-2020",
      "doi": ""
    },
    {
      "text": "Florida National University. 2019. The Evolution of Distance Learning. Retrieved 6 September 2022 from https://www.fnu.edu/evolution-distance-learning/",
      "doi": ""
    },
    {
      "text": "Silvester Draaijer, Amanda Jefferies and Gwendoline Somers. 2018. Online Proctoring for Remote Examination: A State of Play in Higher Education in the EU. In Proceedings of the Technology Enhanced Assessment (Cham, 2018, 2018). Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Neil Selwyn, Chris O'Neill, Gavin Smith, Mark Andrejevic and Xin Gu. 2021. A necessary evil? The rise of online exam proctoring in Australian universities. Media International Australia, 1-16.",
      "doi": ""
    },
    {
      "text": "Cathy Li and Farah Lalani. 2020. The COVID-19 pandemic has changed education forever. This is how. Retrieved 6 September from https://www.weforum.org/agenda/2020/04/coronavirus-education-global-covid19-online-digital-learning/",
      "doi": ""
    },
    {
      "text": "Donald L. McCabe, Linda Klebe Trevino and Kenneth D. Butterfield. 2001. Cheating in Academic Institutions: A Decade of Research. Ethics & Behavior, 11, 3 (2001/07/01), 219-232.",
      "doi": ""
    },
    {
      "text": "Mark M. Lanier. 2006. Academic Integrity and Distance Learning. Journal of Criminal Justice Education, 17, 2 (2006/10/01), 244-261.",
      "doi": ""
    },
    {
      "text": "Stefan Janke, Selma C. Rudert, Änne Petersen, Tanja M. Fritz and Martin Daumiller. 2021. Cheating in the wake of COVID-19: How dangerous is ad-hoc online testing for academic integrity? Computers and Education Open, 2 (2021/12/01/), 100055.",
      "doi": ""
    },
    {
      "text": "Mohammed Juned Hussein, Javed Yusuf, Arpana Sandhya Deb, Letila Fong and Som Naidu. 2020. An evaluation of online proctoring tools. Open Praxis, 12, 4, 509-525.",
      "doi": ""
    },
    {
      "text": "Rianne Conijn, Ad Kleingeld, Uwe Matzat and Chris Snijders. 2022. The fear of big brother: The potential negative side-effects of proctored exams. Journal of Computer Assisted Learning, 38, 6 (December 2022), 1521-1534.",
      "doi": ""
    },
    {
      "text": "Alex Duncan and David Joyner. 2022. On the necessity (or lack thereof) of digital proctoring: Drawbacks, perceptions, and alternatives. Journal of Computer Assisted Learning, 38, 5 (2022/10/01), 1482-1496.",
      "doi": ""
    },
    {
      "text": "Shaanan Cohney, Ross Teixeira, Anne Kohlbrenner, Arvind Narayanan, Mihir Kshirsagar, Yan Shvartzshnaider and Madelyn Sanfilippo. 2021. Virtual Classrooms and Real Harms: Remote Learning at U.S. Universities. In Proceedings of the Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021) (2021).",
      "doi": ""
    },
    {
      "text": "Simon Coghlan, Tim Miller and Jeannie Paterson. 2021. Good Proctor or “Big Brother”? Ethics of Online Exam Supervision Technologies. Philosophy & Technology, 34, 4 (2021/12/01), 1581-1606.",
      "doi": ""
    },
    {
      "text": "David G. Balash, Dongkun Kim, Darikia Shaibekova, Rahel A. Fainchtein, Micah Sherr and Adam J. Aviv. 2021. Examining the Examiners: Students' Privacy and Security Perceptions of Online Proctoring Services. In Proceedings of the Seventeenth Symposium on Usable Privacy and Security (SOUPS 2021) (2021). USENIX Association.",
      "doi": ""
    },
    {
      "text": "Faten F. Kharbat and Ajayeb S. Abu Daabes. 2021. E-proctored exams during the COVID-19 pandemic: A close understanding. Education and Information Technologies, 26, 6 (2021/11/01), 6589-6605.",
      "doi": ""
    },
    {
      "text": "Shea Swauger. 2020. Our bodies encoded: Algorithmic test proctoring in higher education. In Critical Digital Pedagogy, J. Stommel, C. Friend and S. M. Morris (eds.). Hybrid Pedagogy Inc.,",
      "doi": ""
    },
    {
      "text": "Shea Swauger. 2020. Software that monitors students during tests perpetuates inequality and violates their privacy. Retrieved 6 September 2022 from https://www.technologyreview.com/2020/08/07/1006132/software-algorithms-proctoring-online-tests-ai-ethics/",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Wash. L. Rev., 79, 119.",
      "doi": ""
    },
    {
      "text": "Arnout Terpstra, Alexander P. Schouten, Alwin de Rooij and Ronald E. Leenes. 2019. Improving privacy choice through design: How designing for reflection could support privacy self-management. First Monday, 24, 7 (06/30).",
      "doi": ""
    },
    {
      "text": "Alexander Amigud, Joan Arnedo-Moreno, Thanasis Daradoumis and Ana-Elena Guerrero-Roldan. 2018. An integrative review of security and integrity strategies in an academic environment: Current understanding and emerging perspectives. Computers & Security, 76 (2018/07/01/), 50-70.",
      "doi": ""
    },
    {
      "text": "Youssef Fouad, Arno Lodder, Jessica Hrudey and Silvester Draaijer. 2018. A Lawful basis for online proctoring. Poster presentation during International Conference on Technology Enhanced Assessment (Amsterdam, The Netherlands, 2018).",
      "doi": ""
    },
    {
      "text": "Gordon OReilly and John Creagh. 2016. A Categorization of Online Proctoring. In Proceedings of the Global Learn 2016 (Limerick, Ireland, 2016). Association for the Advancement of Computing in Education (AACE).",
      "doi": ""
    },
    {
      "text": "Simone Arnò, Alessandra Galassi, Marco Tommasi, Aristide Saggino and Pierpaolo Vittorini. 2021. State-of-the-Art of Commercial Proctoring Systems and Their Use in Academic Online Exams. International Journal of Distance Education Technologies (IJDET), 19, 2, 55-76.",
      "doi": ""
    },
    {
      "text": "Aditya Nigam, Rhitvik Pasricha, Tarishi Singh and Prathamesh Churi. 2021. A Systematic Review on AI-based Proctoring Systems: Past, Present and Future. Education and Information Technologies, 26, 5 (2021/09/01), 6421-6445.",
      "doi": ""
    },
    {
      "text": "Lex Sietses. 2020. White paper Online proctoring. Questions and answers about remote proctoring., SURF.",
      "doi": ""
    },
    {
      "text": "Alexandra Okada, Peter Scott and Murilo Mendonca. 2015. Effective web videoconferencing for proctoring online oral exams: A case study at scale in Brazil. Open Praxis, 7, 3, 227-242.",
      "doi": ""
    },
    {
      "text": "Yousef Atoum, Liping Chen, Alex X. Liu, Stephen D. H. Hsu and Xiaoming Liu. 2017. Automated Online Exam Proctoring. IEEE Transactions on Multimedia, 19, 7, 1609-1624.",
      "doi": "10.1109/TMM.2017.2656064"
    },
    {
      "text": "Jose J. Vazquez, Eric P. Chiang and Ignacio Sarmiento-Barbieri. 2021. Can we stay one step ahead of cheaters? A field experiment in proctoring online open book exams. Journal of Behavioral and Experimental Economics, 90 (2021/02/01/), 101653.",
      "doi": ""
    },
    {
      "text": "Timothy H. Reisenwitz. 2020. Examining the Necessity of Proctoring Online Exams. Journal of Higher Education Theory and Practice, 20, 1, 118.",
      "doi": ""
    },
    {
      "text": "Seife Dendir and R. Stockton Maxwell. 2020. Cheating in online courses: Evidence from online proctoring. Computers in Human Behavior Reports, 2 (2020/08/01/), 100033.",
      "doi": ""
    },
    {
      "text": "Lee William Daffin Jr. and Ashley A. Jones. 2018. Comparing Student Performance on Proctored and Non-Proctored Exams in Online Psychology Courses. Online Learning, 22, 1, 131-145.",
      "doi": ""
    },
    {
      "text": "Helaine M. Alessio, Nancy Malay, Karsten Maurer, A. John Bailer and Beth Rubin. 2018. Interaction of Proctoring and Student Major on Online Test Performance. International Review of Research in Open and Distributed Learning, 19, 5.",
      "doi": ""
    },
    {
      "text": "Helaine Alessio and Karsten Maurer. 2018. The Impact of Video Proctoring in Online Courses. Journal on Excellence in College Teaching, 29, 183-192.",
      "doi": ""
    },
    {
      "text": "Helaine M Alessio, Nancy Malay, Karsten Maurer, A John Bailer and Beth Rubin. 2017. Examining the effect of proctoring on online test scores. Online Learning, 21, 1, 146-161.",
      "doi": ""
    },
    {
      "text": "Ann Boyd Davis, Richard Rand and Robert Seay. 2016. Remote Proctoring: The Effect of Proctoring on Grades. In Advances in Accounting Education: Teaching and Curriculum Innovations, T. J. Rupert and B. B. Kern (eds.). Emerald Group Publishing Limited, 23-50.",
      "doi": ""
    },
    {
      "text": "Sam Skolnik. 2020. Ninety Percent of Suspected Cheaters Cleared by California Bar. Retrieved 6 September 2022 from https://news.bloomberglaw.com/business-and-practice/ninety-percent-of-suspected-cheaters-cleared-by-california-bar",
      "doi": ""
    },
    {
      "text": "Drew Harwell. 2020. Cheating-detection companies made millions during the pandemic. Now students are fighting back. Retrieved 11 September 2022 from https://www.washingtonpost.com/technology/2020/11/12/test-monitoring-student-revolt/",
      "doi": ""
    },
    {
      "text": "Laura Bergmans, Nacir Bouali, Marloes Luttikhuis and Arend Rensink. 2021. On the Efficacy of Online Proctoring using Proctorio. In Proceedings of the 13th International Conference on Computer Supported Education, CSEDU 2021 (2021). SCITEPRESS Digital Library.",
      "doi": ""
    },
    {
      "text": "Fleur L. Meulmeester, Eline A. Dubois, C. Krommenhoek-van Es, Peter G. M. de Jong and Alexandra M. J. Langers. 2021. Medical Students’ Perspectives on Online Proctoring During Remote Digital Progress Test. Medical Science Educator, 31, 6 (2021/12/01), 1773-1777.",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Hall, Madison B. Roberts, Katharyn A. Taylor and Dawn E. Havrda. 2022. Changes in Academic Performance after Transitioning to Remote Proctoring: A Before-After Evaluation. Pharmacy, 10, 4.",
      "doi": ""
    },
    {
      "text": "G.S. Prakasha, K.Y. Hemalathaa, Ponni Tamizh, Bhola Bhavna and Anthony Kenneth. 2021. Online Test Anxiety and Exam Performance of International Baccalaureate Diploma Programme Students under E-Proctored Exams amid COVID-19. Problems of Education in the 21st Century, 79, 6, 942-955.",
      "doi": ""
    },
    {
      "text": "Daniel Woldeab and Thomas Brothen. 2019. 21st century assessment: Online proctoring, test anxiety, and student performance. International Journal of E-Learning & Distance Education, 34, 1, 1-10.",
      "doi": ""
    },
    {
      "text": "Daniel Woldeab and Thomas Brothen. 2021. Video Surveillance of Online Exam Proctoring: Exam Anxiety and Student Performance. International Journal of E-Learning & Distance Education, 36, 1 (07/16).",
      "doi": ""
    },
    {
      "text": "NL Times. 2022. Webcam exam software \"discriminatory,\" doesn't recognize darker skin tones, says student. Retrieved 6 September 2022 from https://nltimes.nl/2022/07/15/webcam-exam-software-discriminatory-doesnt-recognize-darker-skin-tones-says-student",
      "doi": ""
    },
    {
      "text": "Todd Feathers. 2021. Proctorio Is Using Racist Algorithms to Detect Faces. Retrieved 6 September 2022 from https://www.vice.com/en/article/g5gxg3/proctorio-is-using-racist-algorithms-to-detect-faces",
      "doi": ""
    },
    {
      "text": "Azariel Del Carmen. 2021. Online Exam Proctoring: The Dark Side of Student Privacy and Health. Retrieved 6 September 2022 from https://stmuscholars.org/online-exam-proctoring-the-dark-side-of-student-privacy-and-health/",
      "doi": ""
    },
    {
      "text": "Aishah Hussain. 2020. BPTC student ‘forced to defer’ exams over fears she'd have to remove headscarf for male invigilator. Retrieved 14 September 2022 from https://www.legalcheek.com/2020/08/bptc-student-forced-to-defer-exams-over-fears-shed-have-to-remove-headscarf-for-male-invigilator/",
      "doi": ""
    },
    {
      "text": "Lydia X. Z. Brown. 2020. How Automated Test Proctoring Software Discriminates Against Disabled Students. Retrieved 11 September 2022 from https://cdt.org/insights/how-automated-test-proctoring-software-discriminates-against-disabled-students/",
      "doi": ""
    },
    {
      "text": "Ben Burgess, Avi Ginsberg, Edward W. Felten and Shaanan Cohney. 2022. Watching the watchers: bias and vulnerability in remote proctoring software. arXiv e-prints, arXiv:2205.03009.",
      "doi": ""
    },
    {
      "text": "Monica Chin. 2020. Exam anxiety: how remote test-proctoring is creeping students out. Retrieved 6 September 2022 from https://www.theverge.com/2020/4/29/21232777/examity-remote-test-proctoring-online-class-education",
      "doi": ""
    },
    {
      "text": "Elmer Smaling. 2021. ‘You're guilty until proven innocent.’ Online proctored exams cause students anger and frustration. Retrieved 6 September 2022 from https://www.erasmusmagazine.nl/en/2021/02/17/youre-guilty-until-proven-innocent-online-proctored-exams-cause-students-anger-and-frustration/",
      "doi": ""
    },
    {
      "text": "Ronan Skyring. 2020. ANU Clubs Speak Out Against Online Invigilation Program Proctorio. Retrieved 6 September 2022 from https://www.woroni.com.au/news/anu-clubs-speak-out-against-online-invigilation-program-proctorio/",
      "doi": ""
    },
    {
      "text": "Todd Feathers. 2021. Schools Are Abandoning Invasive Proctoring Software After Student Backlash. Retrieved 6 September 2022 from https://www.vice.com/en/article/7k9ag4/schools-are-abandoning-invasive-proctoring-software-after-student-backlash",
      "doi": ""
    },
    {
      "text": "Tracy Zhang and Jason Kelley. 2020. Students Are Pushing Back Against Proctoring Surveillance Apps. Retrieved 6 September 2022 from https://www.eff.org/deeplinks/2020/09/students-are-pushing-back-against-proctoring-surveillance-apps",
      "doi": ""
    },
    {
      "text": "Jacco Bos. 2020. ‘Proctoring maakt inbreuk op onze privacy en moet afgeschaft worden’. Retrieved 6 September 2022 from https://www.folia.nl/opinie/138292/proctoring-maakt-inbreuk-op-onze-privacy-en-moet-afgeschaft-worden",
      "doi": ""
    },
    {
      "text": "Sara Morrison and Rebecca Heilweil. 2020. How teachers are sacrificing student privacy to stop cheating. Retrieved 6 September 2022 from https://www.vox.com/recode/22175021/school-cheating-student-privacy-remote-learning",
      "doi": ""
    },
    {
      "text": "David Foster and Harry Layman. 2013. Online Proctoring Systems Compared. Caveon Test Security.",
      "doi": ""
    },
    {
      "text": "Jenifer Sunrise Winter. 2012. Privacy and the emerging internet of things: using the framework of contextual integrity to inform policy. In Proceedings of the Pacific Telecommunciations Council Annual Conference (Honolulu, Hawaii, USA, 2012). Pacific Telecommunications Council.",
      "doi": ""
    },
    {
      "text": "Noah Apthorpe, Yan Shvartzshnaider, Arunesh Mathur, Dillon Reisman and Nick Feamster. 2018. Discovering Smart Home Internet of Things Privacy Norms Using Contextual Integrity. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol., 2, 2.",
      "doi": "10.1145/3214262"
    },
    {
      "text": "Noah Apthorpe, Sarah Varghese and Nick Feamster. 2019. Evaluating the Contextual Integrity of Privacy Regulation: Parents' IoT Toy Privacy Norms Versus COPPA. In Proceedings of the 28th {USENIX} Security Symposium ({USENIX} Security 19) (2019).",
      "doi": ""
    },
    {
      "text": "Yan Shvartzshnaider, Schrasing Tong, Thomas Wies, Paula Kift, Helen Nissenbaum, Lakshminarayanan Subramanian and Prateek Mittal. 2016. Learning privacy expectations by crowdsourcing contextual informational norms. In Proceedings of the Fourth AAAI Conference on Human Computation and Crowdsourcing (2016).",
      "doi": ""
    },
    {
      "text": "Elana Zeide and Helen Nissenbaum. 2018. Learner Privacy in MOOCs and Virtual Education. Theory and Research in Education, 16, 3, 280-307.",
      "doi": ""
    },
    {
      "text": "Patricia A. Norberg, Daniel R. Horne and David A. Horne. 2007. The Privacy Paradox: Personal Information Disclosure Intentions versus Behaviors. Journal of Consumer Affairs, 41, 1, 100-126.",
      "doi": ""
    },
    {
      "text": "Susan B. Barnes. 2006. A privacy paradox: Social networking in the United States. First Monday, 11, 9.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Ralph Gross. 2006. Imagined Communities: Awareness, Information Sharing, and Privacy on the Facebook. In Proceedings of the Privacy Enhancing Technologies (Berlin, Heidelberg, Germany, 2006). Springer Berlin Heidelberg.",
      "doi": ""
    },
    {
      "text": "Daniel J. Solove. 2021. The Myth of the Privacy Paradox. George Washington Law Review, 89.",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus. 2012. The mismeasurement of privacy: using contextual integrity to reconsider privacy in HCI. In Proceedings of the Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA, 2012). Association for Computing Machinery.",
      "doi": "10.1145/2207676.2207727"
    },
    {
      "text": "Chantal Mutimukwe, Shengnan Han, Olga Viberg and Teresa Cerratto-Pargman. Forthcoming. Privacy as Contextual Integrity in Online Proctoring Systems in Higher Education: A scoping review. In Proceedings of the The 56th Hawaii International Conference on System Sciences (Hawaii, Forthcoming).",
      "doi": ""
    },
    {
      "text": "Bert-Jaap Koops. 2021. The concept of function creep. Law, Innovation and Technology, 13, 1 (2021/01/02), 29-56.",
      "doi": ""
    },
    {
      "text": "Hervé Abdi. 2010. Holm's sequential Bonferroni procedure. Encyclopedia of research design, 1, 8, 1-8.",
      "doi": ""
    },
    {
      "text": "Due to the anonymisation process, pointers to the original data will be provided later on.",
      "doi": ""
    },
    {
      "text": "Norman E. Kinney. 2001. A Guide to Design and Testing in Online Psychology Courses. Psychology Learning & Teaching, 1, 1 (2001/03/01), 16-20.",
      "doi": ""
    },
    {
      "text": "Anwar ul Haq, Arshad Jamal, Usman Butt, Asim Majeed and Aykut Ozkaya. 2015. Understanding Privacy Concerns in Online Courses: A Case Study of Proctortrack. In Proceedings of the Global Security, Safety and Sustainability: Tomorrow's Challenges of Cyber Security (Cham, 2015//, 2015). Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Autumm Caines and Sarah Silverman. 2021. Back Doors, Trap Doors, and Fourth-Party Deals: How You End up with Harmful Academic Surveillance Technology on Your Campus without Even Knowing. The Journal of Interactive Technology and Pedagogy, 20.",
      "doi": ""
    },
    {
      "text": "Colette Cuijpers. 2021. Online proctoring put to the test. In The New Common, (eds.). Springer, Cham, 53-57.",
      "doi": ""
    },
    {
      "text": "Daniel J. Solove. 2012. Introduction: Privacy Self-Management and the Consent Dilemma Symposium: Privacy and Technology. Harvard Law Review, 126, 7 (2012-2013), 1880-1903.",
      "doi": ""
    },
    {
      "text": "Ben Wolford. What are the GDPR consent requirements? Retrieved 15 September 2022 from https://gdpr.eu/gdpr-consent-requirements/",
      "doi": ""
    },
    {
      "text": "Carol Robinson. 2012. Student engagement: what does this mean in practice in the context of higher education institutions? Journal of Applied Research in Higher Education.",
      "doi": ""
    },
    {
      "text": "Nicole Gosch, David Andrews, Carla Barreiros, Philipp Leitner, Elisabeth Staudegger, Martin Ebner and Stefanie Lindstaedt. 2021. Learning Analytics as a Service for Empowered Learners: From Data Subjects to Controllers. In Proceedings of the LAK21: 11th International Learning Analytics and Knowledge Conference (2021). Association for Computing Machinery.",
      "doi": "10.1145/3448139.3448186"
    },
    {
      "text": "Elvira Lotsari, Vassilios S. Verykios, Chris Panagiotakopoulos and Dimitris Kalles. 2014. A Learning Analytics Methodology for Student Profiling. In Proceedings of the Artificial Intelligence: Methods and Applications (Ioannina, Greece, 2014). Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Dirk Tempelaar, Bart Rienties, Jenna Mittelmeier and Quan Nguyen. 2018. Student profiling in a dispositional learning analytics application using formative assessment. Computers in Human Behavior, 78 (2018/01/01/), 408-420.",
      "doi": ""
    },
    {
      "text": "Tom Buchanan, Carina Paine, Adam N. Joinson and Ulf-Dietrich Reips. 2007. Development of measures of online privacy concern and protection for use on the Internet. Journal of the American Society for Information Science and Technology, 58, 2, 157-165.",
      "doi": ""
    },
    {
      "text": "Nicole Ogden. 2021. Popular anti-cheating software used in the Netherlands vulnerable to hackers. Retrieved 15 September 2022 from https://dutchreview.com/news/anti-cheating-software-vulnerable-to-hacks/",
      "doi": ""
    },
    {
      "text": "Lawrence Abrams. 2020. ProctorU confirms data breach after database leaked online. Retrieved 15 September 2022 from https://www.bleepingcomputer.com/news/security/proctoru-confirms-data-breach-after-database-leaked-online/",
      "doi": ""
    },
    {
      "text": "Kirsten Errick. 2021. Students Sue Online Exam Proctoring Service ProctorU for Biometrics Violations Following Data Breach. Retrieved 15 September 2022 from https://lawstreetmedia.com/news/tech/students-sue-online-exam-proctoring-service-proctoru-for-biometrics-violations-following-data-breach/",
      "doi": ""
    }
  ]
}